{
  "game_id": "0021500649",
  "espn_id": "400828536",
  "date": "Jan 22, 2016",
  "matchup": "TOR vs. MIA",
  "headline": "Sealed with kiss: Lowry gives fan a peck, Raptors top Heat",
  "body": "TORONTO --  All-Star guard Kyle Lowry came up with a new play Friday night -- the peck-and-roll.\n\nLowry was trying to save a loose ball early in the first quarter for the Toronto Raptors when he toppled out of bounds, landing on a woman sitting in the first row.\n\nSeeing that she wasn't hurt, Lowry gave her a kiss on the forehead and then made his way back onto the court. The fan, wearing a Raptors jersey, was all smiles.\n\nLowry finished with 15 points and six assists as Toronto never trailed in topping the Miami Heat 101-81 for its season-high seventh straight game.\n\nA day earlier, Lowry beat out Cleveland's Kyrie Irving in fan voting for the last starting guard spot in the Eastern Conference. The All-Star Game is next month in Toronto.\n\n\"We're just playing, man,\" Lowry said. \"We're just out there playing with confidence. We're sticking with our principles. We're maintaining our principles and we're maintaining our composure. No matter what happens in the game, we're just trying to keep it smooth and not get too up or down.\"\n\nFor the Raptors, who celebrated the 10-year anniversary of Kobe Bryant's 81-point game against them by limiting an entire team to exactly the same point total, it was the third time in franchise history that they have put together a run of seven or more wins. This is their first seven-game streak since winning a franchise-high nine in a row in 2002. It was also the longest winning run under Raptors coach Dwane Casey.\n\nDeMar DeRozan had 33 points, including 4-for-5 shooting from 3-point range. For the third straight game, he scored at least 30.\n\n\"If it's there I'll shoot it,\" DeRozan said of his 3-point shooting. \"I'm not going to come out like a Ray Allen or anything, but if it's there I'm going to take it.\"\n\nWhile Casey praised the efforts of his stars, he was more impressed that his team was able to put away an injury-riddled opponent, albeit one with star power in the likes of Dwyane Wade and Chris Bosh. Wade had 22 points and Bosh 26.\n\n\"The second half I thought we played the way we were supposed to play, we played with some intensity,\" Casey said. \"I thought we did a better job of getting to them defensively in the second half.\"\n\nFor Wade, who had sat out two of the last four games with shoulder soreness, and who had to test it in warmups before declaring himself ready to go, just getting into the game was a point of pride.\n\n\"At this point I don't think I've got time to wait around to feel great,\" he said. \"We've got so many bodies down, you want to get out there and help our team when you can.\"\n\nBut while Toronto's 52 percent mark on 13-of-25 shooting from beyond the 3-point mark stood out, including one from James Johnson 27 seconds in that gave Toronto a lead they would never relinquish, Heat coach Erik Spoelstra believes it was more than that.\n\n\"There were key moments, swing moments in this game where we could get it to five, or get it to seven, and every time we had an opportunity to score we'd have an awkward offensive possession and before you know it, it's a 14-point game,\" he said. \"We didn't respond in those swing moments the way we needed to.\"\n\nSPOTLIGHT ON McADAMS\n\nCanadian actress Rachel McAdams, nominated for best supporting actress at next month's Oscars for her role in \"Spotlight,\" sat courtside and was serenaded by the Toronto mascot, the Raptor, in the first quarter. She received a personalized jersey, a bouquet of flowers and a toy Raptor for her troubles.\n\nCASEY NOT SEEING STARS YET\n\nOn the possibility of coaching the Eastern Conference in next month's All-Star Game following Friday's dismissal of David Blatt, coach of the conference-leading Cleveland Cavaliers, Casey was succinct. \"I have not even thought about it, not even concerned about it. I'm just concerned about the Miami Heat. I don't mean to be trite, but that's the least of my concerns,\" he said.\n\nNBA rules dictate that the coaching staff of the team with the conference's best record on Jan. 31 is given the honor, but given that Blatt was replaced by his assistant Tyronn Lue on Friday, the NBA has said it will examine the situation and make a final decision by the end of the month. The Raptors are second.\n\nTIP-INS\n\nHeat: While Wade returned to the lineup after missing Wednesday's loss in Washington with shoulder soreness, the injury-riddled Heat dressed just nine players for the game. ... Bosh registered the 17,000th career point with a driving layup in the first quarter. ... Friday's game was the Heat's ninth on the road of the all-time franchise-high 12-game road trip they are currently on. So far, Miami has put up a 3-6 record away from American Airlines Arena in January.\n\nRaptors: Toronto has won 18 straight games when holding opponents to less than 100 points, the second-longest streak in franchise history. The team is 23-3 in those games this season. ... Friday's game was the first time the Air Canada Centre has sold out for the first 20 home games to begin a season. Overall, including playoffs, the Raptors have sold out 58 consecutive games.\n\nUP NEXT\n\nHeat: At Chicago on Monday.\n\nRaptors: Host Los Angeles Clippers on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994730.523337
}