{
  "game_id": "0021500695",
  "espn_id": "400828582",
  "date": "Jan 28, 2016",
  "matchup": "MIL @ MEM",
  "headline": "Green has 21 points, Gasol 15 as Grizzlies rout Bucks 103-83",
  "body": "MEMPHIS, Tenn. -- The Memphis Grizzlies' methodical, in-the-mud style of play doesn't routinely translate into 100-point performances.\nBut continued offensive adjustments have resulted in a seven-game run of reaching the century mark, the latest coming Thursday night in a 103-83 victory over the Milwaukee Bucks.\n\"I think it's the way we've been able to move the ball,\" point guard Mike Conley said. \"Guys are getting high-percentage looks, and guys are playing very confident right now. They're not hesitant on their jump shots.\"\nJeff Green scored 21 points, while Marc Gasol added 15 points and eight rebounds for the Grizzlies, who pulled away in the second half by outscoring the Bucks 53-42.\n\"We didn't get to our pace at all from the start,\" Milwaukee coach Jason Kidd said. \".Once (the Grizzlies) had the lead, they started firing off some 3s and they started to make a couple.\n\"Then the game got out of hand, and we were down 20.\"\nCourtney Lee, Tony Allen and Matt Barnes added 13 points for Memphis, all Barnes' coming in the fourth, when he connected on four 3-pointers.\nGreg Monroe led the Bucks with 21 points and Khris Middleton added 15 points and six assists. Michael Carter-Williams finished with 10 points.\nThe game slipped away from the Bucks at the start of the third. Milwaukee committed a trio of turnovers in the opening minute of the quarter and Memphis converted the miscues into a 56-41 lead, causing an early timeout from Kidd.\nMemphis carried a 76-62 lead into the fourth. And when the Grizzlies converted a handful of 3-pointers in the early stages of the fourth, the lead ballooned to 25 and the teams emptied their benches.\n\"They have great defenders to begin with,\" Bucks reserve center Miles Plumlee said. \"But we are a team that attacks the paint, and when they really sink in on us, it's tough.\"\nAfter Memphis opened the second half with six straight points, the Bucks never got the deficit under 10 the rest of the way.\n\"It's about not giving up a hundred,\" Gasol said when asked about the string of 100-point games. \"It's not about what we get. Obviously, if we score a lot of points, that gives us confidence and gets some of the guys going.\"\nTIP-INS:\nBucks: Reserve F John Henson did not make the trip, staying home with a sore lower back. ... The Bucks' last win in Memphis was Nov. 21, 2009. ... Milwaukee has outrebounded its opponents in the last eight games. ... Middleton's 15 points stopped a streak of games with at least 20 points at seven. ... Milwaukee made only one of its 16 attempts from 3-point range. The one conversion tied a season low.\nGrizzlies: Memphis has won nine of the last 10 in the series, including five in a row at home. ... Memphis is now 19-4 against sub-.500 teams. ... The Grizzlies have won 11 of their last 12 home games.\nBAD STREAK FOR GREEK FREAK\nGiannis Antetokounmpo was whistled for a technical midway through the fourth, and was ejected. It was unclear what was said to lead to the ejection, because it was only his first tech of the game. He did not comment after the game. Antetokounmpo finished with seven points, going 2 for 10 from the field as Allen, Memphis' main defender, guarded him much of the night. Antetokounmpo entered the game having connected on 28 of 56 shots in his previous four games.\nALL-STAR PICKS\nNo Grizzlies were selected for the All-Star Game. \"Obviously, we know Big Spain (Gasol) got snubbed,\" Allen said. As for Gasol, he said: \"It's always good to be there and represent a team. On the other hand, you can use that week to rest and get ready for the last part of the season.\"\nUP NEXT\nBucks: Host Miami on Friday\nGrizzlies: Host Sacramento on Saturday",
  "source": "espn_api",
  "crawled_at": 1764994046.956293
}