{
  "game_id": "0021500906",
  "espn_id": "400828793",
  "date": "Mar 02, 2016",
  "matchup": "LAL @ DEN",
  "headline": "Augustin leads Nuggets to 117-107 win over Lakers",
  "body": "DENVER -- Kobe Bryant's farewell performance in Denver was shortened by a sore shoulder.\nNo matter, the fans still showed their appreciation. And at least he didn't have to cover D.J. Augustin.\nAugustin scored 22 of his 26 points in the fourth quarter to lead six Denver players in double figures, and the Nuggets beat the Los Angeles Lakers 117-107 on Wednesday night as Bryant made his final appearance at the Pepsi Center.\n\nA balky shoulder wasn't about to keep him completely off the court. Bryant finished with five points, but didn't play in the second half. Fans kept chanting \"We want Kobe\" as he sat on the bench with a wrap on his shoulder.\n\"It was important to get out there and play and show appreciation for all these years,\" Bryant said. \"Had it not been the case, I wouldn't have played. I wanted to get out there, though.\"\nBryant even signed his shoes and gave them to some lucky kids behind the bench.\nThe reason they were the fortunate recipients? Because they correctly guessed the name of his dog in a back-and-forth exchange during timeouts.\n\"To be able to converse with the fans was awesome,\" Bryant said. \"I had a great time.\"\nThe night may have belonged to Bryant, but the Nuggets stole the show.\nEmmanuel Mudiay added 22 points and Denver used a 10-0 run midway through the final quarter to gain some separation.\nBryant got a kick out of the fact that Mudiay wasn't even a year old when the Lakers star began his NBA career.\n\"That's crazy,\" Bryant said.\nThe Nuggets honored Bryant with a video tribute during a timeout in the first quarter. After showing a string of highlights, the big screen read, \"Congratulations on an amazing career.\" Bryant was so engrossed in the team huddle he didn't glance up.\nD'Angelo Russell scored 24 points for the Lakers, his second consecutive big night. He had 39 points Tuesday in a win over Brooklyn with Bryant sitting out.\nAugustin did a little bit of everything to help the Nuggets turn a three-point deficit into a 95-88 lead with 6:41 left. During the stretch, he had a steal, an assist and eight points, including two 3-pointers.\nHe also put the finishing touches on the game with a three-point play in the final 2 minutes. Augustin tossed up a circus shot that went in as he was fouled by Marcelo Huertas.\n\"Just going with the flow of the game. It happens sometimes,\" Augustin said. \"I took what they gave me.\"\nThe Nuggets played without leading scorer Danilo Gallinari, sidelined with an ankle injury.\nBryant received a standing ovation when he was introduced before the game. He also was cheered each time he touched the ball in the first quarter by a capacity crowd filled with Bryant jerseys. Several fans were holding signs that said things such as \"Hug Me, Kobe!\" \"Aloha, Kobe\" and \"Heroes and Legends are Forever,\" which was decorated in purple-and-yellow glitter.\nAll this adoration was quite a contrast from more than a decade ago, when Bryant was booed each time he visited the Pepsi Center. Back then, the jeers stemmed from a sexual assault case against Bryant in Eagle, Colorado. The charges were eventually dismissed.\nADVICE FOR PEYTON\nBryant's advice to Denver Broncos quarterback Peyton Manning on whether to return or retire was simple: Follow your heart.\n\"You can't make these decisions based on outside influences or successes or failures,\" Bryant said. \"It's a very personal decision. A very emotional decision. You have to make that from within. You can't cheat the game. ... I don't have that desire to come back and perform again.\"\nROOKIE CHALLENGE\nThe game matched two of the top point guards taken in the draft last summer. Russell was selected with the No. 2 pick, and Mudiay went seventh overall.\nTIP-INS\nLakers: G Lou Williams (strained left hamstring) is expected to be sidelined at least a week. He was hurt in the second quarter on Tuesday. ... F Larry Nance Jr. was held out with a sore right knee. ... Jordan Clarkson left in the third quarter with a strained left knee.\nNuggets: Gary Harris had 16 points. ... Toughest Nuggets player to go against, according to Bryant? Carmelo Anthony, now with the New York Knicks.\nUP NEXT\nLakers: Host Atlanta on Friday.\nNuggets: Host Brooklyn on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994255.6823769
}