{
  "game_id": "0021501023",
  "espn_id": "400828910",
  "date": "Mar 18, 2016",
  "matchup": "TOR vs. BOS",
  "headline": "Lowry, Raptors send Celtics to fourth straight loss",
  "body": "TORONTO --  Luis Scola had another fast start against the Boston Celtics, and Kyle Lowry provided the big finish.\n\nLowry had 15 of his 32 points in the fourth quarter, Scola scored all of his 17 in the first 11 minutes of the game and the Toronto Raptors beat the Celtics 105-91 on Friday night.\n\n\"Scola had 13 against us last game in the first quarter and 17 tonight,\" Boston coach Brad Stevens said. \"He's a Celtic killer.\"\n\nThe Raptors, playing their fourth game in five nights, led by as many as 19 in the first half and won their third straight.\n\nBoston matched a season worst with its fourth straight loss and has dropped five of six.\n\n\"It's a good win for us,\" Lowry said. \"It was a good test for us, four tough games and four tough teams, but it was fun.\"\n\nThe Celtics had cut the Raptors' lead to 79-74 lead going into the fourth quarter, outscoring Toronto 33-24 in the third on the strength of 12 points by Isaiah Thomas, who finished with 20.\n\nBut Toronto pulled away with a 14-2 run over the first five minutes of the fourth quarter. Lowry had 10 points during that stretch, punctuating the spurt with back-to-back 3s, rubbing it in by saying something to a Celtics fan behind the Boston bench who he said was \"talking trash the whole game.\"\n\n\"I think I got the last word on that,\" Lowry said.\n\nThomas said while \"we played Celtics basketball\" in the third quarter, the rest of the game wasn't good enough.\n\n\"We have to change something up,\" Thomas said. \"We got ourselves back into the game, so we showed signs of playing like we know how, but a good team like the Raptors you can't just play one good quarter.\"\n\nEvan Turner had 12 points and five rebounds for the Celtics, who dropped from fourth to sixth in the Eastern Conference standings.\n\n\"I thought we played the best in the third quarter that we've played in two weeks, so that's good,\" Stevens said. \"We have to sustain it for a longer period than one quarter.\"\n\nThe Raptors raced out to a 30-14 lead after the first quarter, shooting 55 percent from the field led by Scola, whose 17 points included hitting 3 for 4 from beyond the arc.\n\nBoston's 14 points were the fewest by a Toronto opponent in the first quarter this season.\n\n\"I felt good,\" said Scola, who missed his final three field goal attempts of the night and did not get to the foul line. \"This is a team with a bunch of pieces and they all have their role.\n\n\"We have two main guys (Lowry and DeMar DeRozan) and those are the guys we want shooting all the shots. Those are the guys that are going to carry us and everybody else, we have a job to do.\"\n\nDeRozan finished with 15 points, seven rebounds and six assists.\n\nTIP-INS\n\nCeltics: The 14 points in the first quarter was the second-lowest total of the season for the Celtics, who scored 13 in the opening period against San Antonio in November. ... Boston had a 21-15 edge in fast-break points and a 44-38 advantage in the paint.\n\nRaptors: C Jonas Valanciunas dressed but did not play for the third straight game as he nurses the left hand he bruised in Monday's loss to the Chicago Bulls.\n\nCOSTLY TURNOVERS\n\nThe Celtics turned the ball over seven times in the first quarter and six times in the fourth, leading to a total of 21 points for the Raptors. They turned it over just three times in the second and third quarter, which led to no Toronto points.\n\nROAD WOES\n\nThe Celtics fell to 16-18 on the road and have lost a season-high four straight games away from home.\n\nCLASSY COACHING COMPANY\n\nToronto's Dwane Casey now has 201 wins with the Raptors, one of just five current NBA head coaches with at least 200 wins with their team. The others are: Gregg Popovich (1,080 with San Antonio), Erik Spoelstra (390 with Miami), Rick Carlisle (372 with Dallas) and Frank Vogel (241 with Indiana).\n\nUP NEXT\n\nCeltics: Visit Philadelphia on Sunday night.\n\nRaptors: Host Orlando on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994699.7469099
}