{
  "game_id": "0022000740",
  "espn_id": "401307530",
  "date": "Apr 02, 2021",
  "matchup": "IND vs. CHA",
  "headline": "Short-handed Hornets rout slumping Pacers 114-97",
  "body": "INDIANAPOLIS -- — Charlotte coach James Borrego said he was as proud of this Hornets victory as any other in this challenging season that has tested his team's depth.\n\n\r\n                    Already missing an injured backcourt, the Hornets overcame losing guard Gordon Hayward to a right foot sprain for the second half and beat the Indiana Pacers 114-97 on Friday night.\n\n\r\n                    “We had a number of guys out. We had scoring out,\" Borrego said. “But this team just continues to fight and figure it out.”\n\n\r\n                    Reserve guard Miles Bridges scored a season-high 23 points to lead seven double-digit scorers.\n\n\r\n                    “It's always tough seeing one of your teammates going down,\" Bridges said. “I feel like everybody had a step-up mentality.”\n\n\r\n                    Bridges scored 16 of his points in the second quarter, and a 3-pointer in the final seconds gave the Hornets a 60-49 lead at halftime.\n\n\r\n                    Cody Zeller scored 17 points and Terry Rozier 15 for Charlotte, which has won five of seven.\n\n\r\n                    Hayward got the Hornets off to a fast start with 12 points, six rebounds and six assists in the first quarter. The Hornets, who managed just 11 first-quarter points in a Thursday loss at Brooklyn, took a 28-24 lead.\n\n\r\n                    “Gordon was having a heck of a game,” Borrego said. “We could have crumbled. We could have given in. But this group will not give in. ... This is what our season has been about, and we're built for this.\"\n\n\r\n                    The Pacers, according to leading scorer Caris LeVert, played “uninspired.\" He had 16 points.\n\n\r\n                    “I feel like the losing is getting to our spirit,” LeVert said after the Pacers fell to 8-14 at home, which includes losing eight of nine at Bankers Life Fieldhouse.\n\n\r\n                    “We're trying hard, man,” Pacers coach Nate Bjorkgren said. “We're trying hard. There's a lot of frustration. It's on all of us.”\n\n\r\n                    Not having point guard Malcolm Brogdon due to a sore hip translated to sloppy ballhandling as the Pacers committed 20 turnovers, twice as many as the Hornets. \n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Are without point guard LaMelo Ball (broken wrist) and shooting guard Malik Monk (sprained ankle), the latter going down on Thursday night. .... Played third game of six-game trip.\n\n\r\n                    Pacers: Dropped to 10-19 since a loss to Charlotte on Jan. 27. ... All-Star forward Domantas Sabonis missed the final quarter with a left ankle sprain.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Visit Boston on Sunday night.\n\n\r\n                    Pacers: Visit San Antonio on Saturday night.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997132.210083
}