{
  "game_id": "0022301064",
  "espn_id": "401585692",
  "date": "Mar 29, 2024",
  "matchup": "ORL vs. LAC",
  "headline": "Kawhi Leonard scores 29 to lead Clippers past Magic 100-97",
  "body": "ORLANDO, Fla. -- — Kawhi Leonard and Paul George hit decisive jump shots in the final seconds for the Los Angeles Clippers, the Orlando Magic did not, and LA won for the fifth time in six road games, 100-97 on Friday night.\n\n\r\n              The Clippers, who have lost five straight at home, held on to fourth place in the Western Conference with nine games left in the regular season.\n\n\r\n              “I'm not worried about the playoffs right now,” said Leonard. “We're just trying to execute what's in front of us. There are no excuses. We've just got to lock in at home and get a win.”\n\n\r\n              Leonard, who scored 25 of his 29 points in the second half, put the Clippers ahead with a mid-range jumper with 34 seconds left. George scored with 5.2 seconds to play before Orlando's Franz Wagner missed a couple of 3-point attempts just before the buzzer.\n\n\r\n              Paolo Banchero led Orlando with 23 points and eight rebounds, but had two of his seven turnovers in the final minute. The 21-year-old power forward took the blame for the Magic's third straight loss.\n\n\r\n              “If I show up the way I’m supposed to, we win all these games,” Banchero said.\n\n\r\n              Jalen Suggs scored 15 for the Magic and Moritz Wagner came off the bench for 12 points and nine rebounds.\n\n\r\n              Ivica Zubac, who finished with 14 points and 10 rebounds, scored twice to help the Clippers open the second half on an 8-0 run for a 61-50 lead, their biggest of the game.\n\n\r\n              “We did a great job building an 11-point lead, playing good basketball, and then we just got comfortable, turning the ball over, careless passes . . . and allowed them to get back in the game,” said Clippers coach Tyronn Lue. “But I loved our defense tonight. Overall, a tough, gritty win for us. Coming down the stretch, keeping our composure, coming down late in the game and finding a way to win.”\n\n\r\n              After getting his first field goal with 1:46 left in the first half, Banchero responded to the Clippers rally with 11 points over a five-minute stretch to help Orlando regain a brief lead.\n\n\r\n              “I’ve got to find a way to start games better,” he said. “I don’t like how I’m playing right now so I’ll just work on it.”\n\n\r\n              Leonard and Amir Coffey hit 3-pointers late in the third quarter and the Clippers moved out to a 10-point lead. But Mo Wagner scored the Magic's first 10 points of the fourth quarter, most of them during a Clippers scoreless stretch of 5:35. By the time George finally scored on a layup with 4:15 left, Orlando led 94-89.\n\n\r\n              But Banchero's runner in the lane with 1:28 left, regaining a one-point lead for Orlando, was the Magic's only field goal over the final 4 1/2 minutes.\n\n\r\n              Orlando's three straight losses — all at home — have been by two points to Sacramento, eight to Golden State and three to the Clippers.\n\n\r\n              Mo Wagner insists the Magic are “playing really good basketball.”\n\n\r\n              “Sometimes stuff doesn’t go your way. We’re going to show up tomorrow and play the same way and hope for a different result,” he said. \"I said the same thing when we had a nine-game winning streak and we were like the sweet darling on social media. Everything was cool.\n\n\r\n              “But if you’re trying to go somewhere, you better figure it out at some point.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: Visit Charlotte on Sunday night.\n\n\r\n              Magic: Host Memphis on Saturday night.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996176.3104
}