{
  "game_id": "0021600429",
  "espn_id": "400899871",
  "date": "Dec 21, 2016",
  "matchup": "MIL @ CLE",
  "headline": "Irving, James lead short-handed Cavs past Bucks 113-102",
  "body": "CLEVELAND -- Kyrie Irving didn't get tired of seeing the Milwaukee Bucks on consecutive days in December.\nIn fact, he wouldn't mind playing them a few more times in late April, May or June when it really matters.\n\"I hope,\" he said.\nIrving had 31 points and a career-high 13 assists, and LeBron James scored 29 as the Cleveland Cavaliers won their second game in 24 hours over the young Bucks, 113-102 on Wednesday despite being without two starters.\nThe NBA champions were not at full strength as Kevin Love didn't dress for the second straight game with a bruised left knee, and J.R. Smith sat out after breaking his right thumb Tuesday at Milwaukee. Smith needs surgery, and the Cavs won't have a timetable on his return until after the operation.\nThey were barely missed as Cleveland's two biggest stars more than made up for the absences and the Cavs won for the eighth time in nine games. The only loss in that stretch was last week at Memphis when James, Irving and Love stayed home to rest.\nAfter his big performance Wednesday night, Irving was asked if he sees the Bucks as a contender, a team Cleveland could meet in the playoffs. Milwaukee beat the Cavs 118-101 on Nov. 29.\n\"I hope, man. It would be great, four games against them,\" Irving said. \"I'm fired up to go against them every time now, for real. Ever since they kicked our (butts) in Milwaukee it's been personal and it's going to continue to be personal.\"\nGiannis Antetokounmpo scored 28 points and Jabari Parker 27 for the Bucks, who took the Cavs to overtime at home Tuesday but fell behind by 21 in the fourth quarter this time and couldn't come back.\n\"They're the champs,\" Milwaukee coach Jason Kidd said. \"They showed that again tonight. They never panic. They've seen everything. For a young team like ourselves, we're going through that. Hopefully, we can learn from our mistakes.\"\nTristan Thompson added 15 rebounds for Cleveland.\nCavs coach Tyronn Lue wanted to rest Irving and James, who played a respective 47 and 45 minutes in Tuesday's overtime win at Milwaukee.\n\"He came to me and asked me how I felt. I said great,\" James said. \"He gave me a little look and I said, `I feel great,' and uh, that was it.\"\nLike Irving, James sees the Bucks as a team to watch in the future, and a possible challenger to the Cavs in the East. Maybe not this season, but at some point.\n\"The next several years they could be really, really good,\" James said. \"For me, I'm ready for whatever matchup. It doesn't matter if it's this year, or if it's several years, I'm going to be ready for it.\"\nIrving scored 14 in the third quarter, capping the period with a three-point play to put Cleveland ahead by 15.\nJames made three 3-pointers in a span of 1:11 in the second to give Cleveland a 51-35 lead, but Lue, perhaps concerned about overworking his superstar, replaced him with Richard Jefferson.\nJames had an incredulous look as he ran off the floor and seemed to wonder why Lue would pull him while on such a shooting tear.\n\"He was mad,\" Lue said.\n\"I wished he would've changed his mind,\" James said. \"I had made three straight 3s. I don't know. It's cool, though. We won.\"\nHELLO, DELLY\nMatthew Dellavedova, who endeared himself to Cleveland fans with his tenacity for three seasons, was presented with his NBA championship ring before tip-off. The Cavs swarmed \"Delly\" and nearly knocked general manager David Griffin down as he was about to give Dellavedova the diamond jewelry, which was knocked from the GM's hands.\n\"A couple of guys got some shots in there. Tristan, maybe,\" Dellavedova said. \"It was a special moment. I loved playing here.\"\nTIP-INS\nBucks: F Michael Beasley missed his fourth straight game with a sprained left foot. ... Antetokounmpo is the only player in the NBA leading his team in points, rebounds, assists, steals and blocks. Only four players -- James, Kevin Garnett, Dave Cowens and Scottie Pippen -- have done it for a season.\nCavaliers: Jefferson was ejected with 3:19 left and tossed his jersey into the stands as he walked to the locker room. \"He lost it,\" Lue said. ... James is expected to have his minutes reduced next month. He's averaging 37.3 per game, but Lue said there are no plans to curtail James' playing time until the 31-year-old says so.\nUP NEXT\nBucks: Host Washington on Friday.\nCavaliers: Host Brooklyn on Friday night before playing Golden State on Christmas in a rematch of the past two NBA Finals.",
  "source": "espn_api",
  "crawled_at": 1764995199.909101
}