{
  "game_id": "0021900697",
  "espn_id": "401161339",
  "date": "Jan 27, 2020",
  "matchup": "OKC vs. DAL",
  "headline": "Doncic scores 29, leads Mavericks past Thunder, 107-97",
  "body": "OKLAHOMA CITY --  Kobe Bryant's death fully registered with Luka Doncic in the midst of a game.\n\nDoncic had 29 points and 11 rebounds, and the Dallas Mavericks beat the Oklahoma City Thunder 107-97 Monday a night after Bryant, one of the NBA's all-time greats, was involved in a fatal helicopter crash.\n\nDoncic had been thinking about it all -- the All-Star had messages remembering those involved in the accident on his shoes. Still, a wave of emotion hit suddenly and unexpectedly.\n\n\"I broke down after the first quarter,\" he said. \"That was when it really hit me. It was really hard to explain.\"\n\nWhen the game started following a moment of silence, the Mavericks took an 8-second violation in honor of the number Bryant wore to start his NBA career. The Thunder then took a 24-second shot clock violation in honor of the number Bryant wore later. After the two violations, the scoreboard clock read 11:24, and the 24-second clock below it had been reset to show 24 seconds. The crowd chanted \"Kobe! Kobe!\" as the clock counted down.\n\nDallas coach Rick Carlisle tried his best to get his players to focus on playing basketball.\n\n\"This was a tough, emotional game,\" he said. \"It was like that for both teams, but I'm proud of our guys for keeping it together and getting through it.\"\n\nDallas controlled most of the game. The Mavericks led 59-47 at halftime and pushed the lead to 70-54 before the Thunder went on an 11-0 run. Dallas regained control and led 88-77 at the end of the third quarter. The Mavericks led by at least 10 points the entire fourth quarter.\n\nTim Hardaway Jr. scored 15 points and Kristaps Porzingis added 14 points and 10 rebounds for Dallas.\n\nDennis Schroder scored 21 points for the Thunder. Shai Gilgeous-Alexander scored 16 points but missed 15 of his 20 shots.\n\nAfter the game, Bryant's death brought a heavy dose of perspective to the locker rooms.\n\n\"For it to happen to someone like him -- a role model, a father, a husband and a living legend -- it is heartbreaking and heartwrenching,\" Hardaway said.\n\nSchroder, who played for the Atlanta Hawks before he joined the Thunder, remembered a game against the Lakers in Atlanta.\n\n\"Felt like a home game for them (the Lakers),\" Schroder said. \"There were so many Laker fans, all purple and yellow, everybody chanting for Kobe.\"\n\nGilgeous-Alexander wore a gold No. 8 Bryant jersey to his interview session.\n\n\"I just wanted to pay homage to a guy I looked up to growing up,\" Gilgeous-Alexander said. \"There's a lot of guys also in the league that look up to him. He's done wonderful things for this game.\"\n\nTIP-INS\n\nMavericks: C Willie Cauley-Stein, acquired in a trade with Golden State, did not play. Mavericks coach Rich Carlisle said before the game that Cauley-Stein had been with the team for less than 24 hours. ... Outrebounded the Thunder 56-48. ... Attempted 51 3-pointers and made 19. ... The Thunder scored zero points off the Mavericks' nine turnovers.\n\nThunder: Paul had joined Gilgeous-Alexander as the only Thunder players to start every game this season. In 47 games, he averages 17.2 points, 6.4 assists and 5.0 rebounds. ... Thunder guard Terrance Ferguson also sat out for personal reasons. ... C Nerlens Noel played with a mask after having surgery for a fractured cheek.\n\nHE SAID IT\n\nHardaway, whose father played against Michael Jordan: \"I didn't grow up watching Michael Jordan like that. My dad played against him, so when I was older and able to pick up the game of basketball in the 2000s, Kobe was like our Michael Jordan for my type of generation and younger. So it was with a lot of heavy hearts and we made sure that we came out and competed for him, because I know that is what he would want everyone to do for him.\"\n\nUP NEXT\n\nMavericks: Host the Phoenix Suns on Tuesday.\n\nThunder: Visit the Sacramento Kings on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBAbasketball and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996216.240694
}