{
  "game_id": "0022100936",
  "espn_id": "401360755",
  "date": "Mar 02, 2022",
  "matchup": "MIA @ MIL",
  "headline": "Holiday's basket caps huge rally as Bucks stun Heat 120-119",
  "body": "MILWAUKEE -- — Seemingly buried by the Miami Heat's avalanche of 3-point shots, the Milwaukee Bucks maintained their championship mentality and never gave up hope they could rally.\n\n\r\n              Then they pulled off one of their most stirring comebacks of the season.\n\n\r\n              Jrue Holiday banked in a driving layup  with 1.9 seconds left and the defending NBA champions rallied from a 14-point deficit in the final six minutes to beat the Eastern Conference-leading Heat 120-119 on Wednesday night. \n\n\r\n              “We’ve done it before,” said Milwaukee's Giannis Antetokounmpo, who had 28 points, 17 rebounds and five assists. “We did it against Boston. We were down 13 in the Christmas game (with five minutes left) and came back and won the game.”\n\n\r\n              It was a win the Bucks needed as they enter the toughest stretch of their schedule.\n\n\r\n              This marked the last of six straight home games for the Bucks, who now visit the Central Division-leading Chicago Bulls and host the Western Conference-leading Phoenix Suns in their next two outings.\n\n\r\n              “We can't really dwell on this win,” said Holiday, who had 25 points and 11 assists. “We accept it and we love it, but these games are not stopping.”\n\n\r\n              The Bucks outscored Miami 21-6 down the stretch to snap the Heat’s four-game winning streak. Miami, which shot 21 of 44 from 3-point range, led 119-116 and had the ball with less than 20 seconds left before everything fell apart. \n\n\r\n              “We did enough for 47 minutes and change to put ourselves in position to win this game,” Heat coach Erik Spoelstra said. “We just couldn't close it out.”\n\n\r\n              Milwaukee's winning flurry started when Bobby Portis got a steal that led to a 3-pointer from Khris Middleton that got the Bucks within one.\n\n\r\n              On the ensuing inbounds pass, Antetokounmpo forced a jump ball against Jimmy Butler. \n\n\r\n              “I was able to get my hands on the ball, and at the end of the day, when you want to win, things just happen,” Antetokounmpo said. “That's just instinct talking.”\n\n\r\n              The Heat believed Antetokounmpo made enough contact on the play to warrant a foul call.\n\n\r\n              “I'm not going to go on a big rant about the officiating and all that,” Spoelstra said. “I'm just shocked. I'm shocked that wasn't a foul on Jimmy as we were trying to inbound. We certainly had some other opportunities to be able to close out the game, particularly when we were up four. That's just the way it goes. I have not looked at that. I just can't imagine from my vantage point how that wasn't a foul.”\n\n\r\n              Antetokounmpo won the tip and got it to Bobby Portis. The Bucks didn't call a timeout and instead got the ball to Holiday, who worked his way to the other end of the court and made the winning basket.\n\n\r\n              “He’s so good at getting in the paint and creating and finishing,” said Middleton, who scored 26 points. “At that point, we said there was going to be no timeout, so whoever got it, which we knew was going to be Jrue with the tip, the way we were lined up, just give him space and let him create. He did a great job putting his head down to the basket and making a big layup for us to get the win.”\n\n\r\n              The Heat had no timeouts left, and Tyler Herro missed a desperation 3-point attempt at the buzzer. It was a disappointing finish to a spectacular night from Herro, who scored 30 points and shooting 6 of 10 from beyond the arc.\n\n\r\n              Gabe Vincent had 21, Bam Adebayo 18, Duncan Robinson 15 and Caleb Martin 12 for the Heat. Bobby Portis scored 15 for the Bucks.\n\n\r\n              Miami appeared to have the game in hand when it took a 113-99 lead with a 9-0 run that featured two 3-pointers from Vincent and one from Herro.\n\n\r\n              But the Bucks wouldn’t go away and finally stole the victory in the closing seconds.\n\n\r\n              TIP-INS\n\n\r\n              Heat: Miami played its 35th road game Wednesday and goes back on the road to face Brooklyn on Thursday. The Heat have played the most road games of any NBA team. After the trip to Brooklyn, the Heat will be at home for 11 of their next 12 games. ... Kyle Lowry missed a second straight game due to personal reasons.\n\n\r\n              Bucks: Mike Budenholzer earned his 200th win as the Bucks coach. He owns a 200-90 record in four seasons at Milwaukee and is 413-287 in nine seasons overall.\n\n\r\n              UP NEXT\n\n\r\n              Heat: Visit the Brooklyn Nets on Thursday. The Heat are 2-0 against the Nets this season after winning 106-93 in Brooklyn on Oct. 27 and 115-111 in Miami on Feb. 12.\n\n\r\n              Bucks: Visit the Chicago Bulls on Friday in their first road game since Feb. 10. In their only previous matchup this season, the Bucks beat the Bulls 94-90 on Jan. 21 in Milwaukee.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992633.118418
}