{
  "game_id": "0022000776",
  "espn_id": "401307568",
  "date": "Apr 07, 2021",
  "matchup": "IND vs. MIN",
  "headline": "Holiday brothers lead Pacers past Timberwolves",
  "body": "INDIANAPOLIS -- — Aaron Holiday scored 22 points, brother Justin Holiday had 21 and the short-handed Indiana Pacers beat the Minnesota Timberwolves 141-137 on Wednesday night.\n\n\r\n                    The Pacers were without All-Star forward Domantas Sabonis and three other injured starters, and had lost nine of 10 home games. \n\n\r\n                    “It was a tribute to how we were playing together and playing fast,” Justin Holiday said. “Hopefully when we get everybody back, we can continue to do this.”\n\n\r\n                    Karl-Anthony Towns led NBA-worst Minnesota with 32 points, 12 rebounds and six assists. Anthony Edwards had 27 points.\n\n\r\n                    “We just didn't play hard enough in the beginning,” Towns said. “They played with urgency and desperation from the beginning.”\n\n\r\n                    Aaron Holiday wrapped it up with two free throws with 8.3 seconds remaining.\n\n\r\n                    Justin Holiday hit four 3-pointers in the final quarter, when the Timberwolves rallied to make it a one-possession game. T.J. McConnell made a key 3-pointer for a 138-132 lead with 24.9 seconds remaining. He finished with 19 points.\n\n\r\n                    “Credit everyone who played tonight,” McConnell said. “They came in ready.”\n\n\r\n                    Aaron Holiday scored 14 points in the second quarter, and the Pacers outscored the Timberwolves 42-25 in the period for a 21-point halftime lead. The Pacers had a season-high 77 points at the break.\n\n\r\n                    “Their second unit carved us apart,” Timberwolves coach Chris Finch said. “We didn't have a will to guard the ball.”\n\n\r\n                    The Pacers led 69-44 in bench scoring.\n\n\r\n                    Caris LeVert added 18 points for the Pacers. They shot 59% from the field.\n\n\r\n                    TIP-INS\n\n\r\n                    Timberwolves: Have not won back-to-back games since the first two of the season.\n\n\r\n                    Pacers: Recent injuries resulted in a starting lineup without a player who began the season as a starter. \n\n\r\n                    UP NEXT\n\n\r\n                    Timberwolves: At Boston on Friday night.\n\n\r\n                    Pacers: At Orlando on Friday night.\n\n\r\n                    ------\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997128.4364219
}