{
  "game_id": "0022400250",
  "espn_id": "401704816",
  "date": "Nov 18, 2024",
  "matchup": "ATL @ SAC",
  "headline": "Hunter scores 24 points, Daniels has game-winning block as Hawks beat Kings 109-108",
  "body": "SACRAMENTO, Calif. -- — De'Andre Hunter scored 24 points and Dyson Daniels had four blocks, including one in the final seconds, as the Atlanta Hawks beat the short-handed Sacramento Kings 109-108 on Monday night.\n\n\r\n              Daniels' clutch defensive play on Kings star De'Aaron Fox finished off a late back-and-forth affair. Trae Young had 19 assists for Atlanta. Clint Capela, who had 14 points and 14 rebounds, scored the final three points for the Hawks to put them up 109-106 with under two minutes to play.\n\n\r\n              Keon Ellis had a career high 33 points, including nine 3-pointers, to lead Sacramento. The Kings were without Domantas Sabonis (back), DeMar DeRozan (back) and Malik Monk (right ankle sprain). \n\n\r\n              Sacramento led 66-64 at halftime, after falling behind 22-6 to start the game.\n\n\r\n              Takeaways\r\n              Hawks: The Hawks got some key rotational pieces back with Bogdan Bogdanovic and Kobe Bufkin both active. Bogdanovic (right hamstring) played in his first game since the season opener and Bufkin (right shoulder) had not been active this season. Bogdanovic, who averaged 16.9 points per game last season, scored six on Monday. Bufkin had five points.\n\n\r\n              Kings: Ellis, who entered the game averaging 5.3 points per game this season, made his first six 3s in the first half and became the fifth player in franchise history to make nine 3-pointers in a game.\n\n\r\n              Key moment \r\n              Daniels stripped Fox of the ball as Fox went up for a shot on the left wing in the final seconds, ending the game. The 21-year-old, who entered the game with a steal in 12 consecutive games, also had 14 points and eight rebounds.\n\n\r\n              Key stat\r\n              The Hawks won despite just seven points from Young. The point guard was in a passing mood on Monday, finishing one shy of a career high, while attempting just seven shots.\n\n\r\n              Up next\r\n              Kings visit the Los Angeles Clippers on Friday, and Hawks visit Golden State on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997958.422386
}