{
  "game_id": "0021400837",
  "espn_id": "400579129",
  "date": "Feb 23, 2015",
  "matchup": "MEM @ LAC",
  "headline": "Grizzlies beat Clippers, win second game against L.A. this season",
  "body": "LOS ANGELES -- The Memphis Grizzlies are on a roll with Jeff Green.\nThe Los Angeles Clippers aren't the same without Blake Griffin.\nWhen the teams got together, they played a grind-it-out style better suited to the Grizzlies than the high-flying Clippers, whose four-game winning streak ended with a 90-87 loss Monday night.\nMike Conley scored 18 points, Jeff Green added 16 and Marc Gasol had 14 to help the Grizzlies improve to 15-3 since Green joined the team on Jan. 12.\n\n\"We just grind, play hard, play defense and play together,\" said Zach Randolph, who had 10 rebounds. \"There's nothing pretty about it. We don't have any high-fliers. We always play the same way, so it didn't matter if Blake was out there or not.\"\nIt did to the Clippers, who still had their other late-game option in Chris Paul. But he lost the ball with 1.9 seconds left and bent over with his hands in his head.\n\"All I could think about was if I was watching at home this dummy didn't even get a shot up,\" said Paul, who had 30 points and 10 rebounds. \"I didn't execute on that last play. You try to thrive in those situations and for that to happen, it's tough.\"\nMemphis led by eight before the Clippers scored seven in a row to close to 88-87. After Conley stripped Paul, he got fouled and made both. The game ended with Matt Barnes throwing the ball into the hands of Courtney Lee.\n\"We like to wrap teams up with both hands and put them down in the mud,\" Gasol said. \"That's where we feel more comfortable.\"\nJamal Crawford added 15 points off the bench for the Clippers.\nNo surprise that it was a tight game between the teams who've met in the playoffs twice in the last three years. Neither led by more than eight points and there were 12 lead changes and 11 ties. The teams will meet again Friday in Memphis.\nThe Clippers fell to 4-2 without the injured Griffin, and have lost both meetings with the Grizzlies this season. DeAndre Jordan finished with nine points -- well under his 20.8 average without Griffin -- and 17 rebounds.\n\"We had a chance to win it, but we'll see them in a few days,\" Jordan said.\nPaul's driving layup pulled the Clippers within three before Conley banked in a jumper and Lee followed with a 3-pointer, extending the Grizzlies' lead to 88-80.\nPaul wasn't done, though. He got fouled and made two free throws, then found J.J. Redick, who hit a 3-pointer after missing his first five. Paul followed with a jumper that left the Clippers down 88-87 with 1:10 to go. But his turnover ended the Clippers' hopes.\n\"We held a team that likes to score a lot of points to 80-something points,\" Gasol said. \"We made enough plays defensively at the end of the game to stay on top.\"\nMemphis was 19-of-26 from the free throw line, while the Clippers made just 12 trips.\n\"That helped set our defense, which is good for us, especially against a team that scores as much as they do,\" Grizzlies coach David Joerger said.\nThe Grizzlies erased a seven-point deficit in the third behind Gasol and Green, who had 11 points, including three 3-pointers. His second 3 gave the Grizzlies their first lead since making the game's opening basket, and his third extended their lead to 64-59.\nThe Clippers used a 9-2 run to close the third, with Jordan dunking off Paul's layup attempt that bounced off the glass to take a 68-66 lead into the fourth.\nTIP-INS\nGrizzlies: Memphis is 12-2 when Green starts. ... G-F Vince Carter missed his ninth straight game with a left foot tendon injury.\nClippers: The Clippers' 12-game winning streak against West opponents at Staples Center ended. ... Paul joined Oscar Robertson, Magic Johnson and Isiah Thomas as the fourth player in NBA history to reach 12,500 points and 6,500 assists in less than 675 career games.\nGRIFFIN MENDING\nGriffin had the cast on his right elbow removed and stitches taken out. He has been cleared for some light workouts, but no running yet and there's no timetable for his return from the surgery to remove a staph infection.\nGREEN'S INFLUENCE\nGreen has improved the Grizzlies since coming to them in a trade last month. He came in averaging 12.3 points and 3.8 rebounds.\n\"We're going to post him up when we can, try to get him out in transition and get some easy baskets, letting him use the basketball in pick-and-rolls,\" Joerger said. \"Jeff is an athletic guy who can go in and get engaged with rebounding when Zach and Marc are banging. Defensively, Jeff can guard bigger guys, bigger 3s, which has given us problems at times.\"\nUP NEXT\nGrizzlies: At Sacramento on Wednesday.\nClippers: At Houston on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764992141.484867
}