{
  "game_id": "0021800625",
  "espn_id": "401071301",
  "date": "Jan 11, 2019",
  "matchup": "CLE @ HOU",
  "headline": "Harden has triple-double to lead Rockets over Cavs 141-113",
  "body": "HOUSTON --  The Houston Rockets still have a way to go to reach their goal of earning the top seed in the Western Conference.\n\nBut it seems far more attainable than it was just a month ago.\n\nJames Harden had 43 points, 10 rebounds and 12 assists in 29 minutes -- the first player in NBA history to have a 40-point triple-double in less than 30 minutes played -- to lead the Houston Rockets to a 141-113 rout of the Cleveland Cavaliers on Friday night for their eighth win in 11 games.\n\n\"I think we've all had that in the back of our mind. It was just a far reach earlier in the season,\" Harden said. \"Now it's pretty close. We've just got to continue to do what we've been doing. Playing well, taking care of opportunities like this tonight. Just continue to get better, strive to get better.\"\n\nThe Rockets, who were in 14th place in the West in early December, are 4  1/2 games out of first place and tied with the Clippers for fifth.\n\nAfter the Cavaliers got a 117-108 win in the first meeting with Houston this season, the Rockets were determined to take care of business this time around. They did that, racing out to a 28-point lead after scoring a season-high 77 points in the first half behind 24 points from Harden.\n\nIt's Harden's 15th straight game with at least 30 points, his franchise-record 13th game with 40 points this season and the seventh in the last nine games as he has carried the team with Chris Paul and Eric Gordon out with injuries.\n\nAnte Zizic came off the bench to score 18 for the Cavaliers, whose season-long skid extended to 12 games.\n\n\"We just couldn't stop them,\" Cavaliers coach Larry Drew said. \"They were raining 3s all over the place. They broke us down off the dribble. They are in a rhythm now and playing very good basketball.\"\n\nHarden needed less than 2 1/2 quarters to reach 30 points on Friday night, hitting a 3 with 7:41 left in the third to give him 32 points and push Houston's lead 91-58. He joins Kobe Bryant (16 games in 2003) as the only players to score 30 points in at least 15 games in a row since the 1972-73 season.\n\nAbout three minutes later, he pushed his total to 40 after he was left wide open to drive into the lane for an easy layup to make it 99-68. Harden grabbed his 10th rebound with about 90 seconds left in the third quarter to give him his sixth triple-double this season and the 41st of his career.\n\nHarden played just 29 minutes and 34 seconds, and made eight 3-pointers to extend his NBA record to 12 games in a row with at least five.\n\n\"The step-back 3s, he's perfected that,\" coach Mike D'Antoni said. \"He's got 16 3s and they're all step-backs. I don't know how he does it ... everybody knows what he's doing and he still gets them off, and they're kind of open. They're not forced, so he's just an incredible player.\"\n\nClint Capela added 19 points on 7-of-8 shooting after making just four of 16 field goals in a loss to Milwaukee on Wednesday night.\n\nHarden and fellow starters Capela and Tucker also sat out the fourth quarter with Houston up 113-81 entering the fourth. Even with the trio watching the final quarter from the bench, the Rockets maintained a huge lead and their 141 points were a season high and the most Cleveland has allowed this season.\n\nTIP-INS\n\nCavaliers: Rodney Hood returned after missing the last three games with a sore left Achilles tendon. He had six points, two assists and two rebounds in 18 minutes. ... Cedi Osman had 15 points and Collin Sexton added 14. ... Jordan Clarkson and Jalen Jones added 12 points each.\n\nRockets: Paul missed his 10th game in a row with a strained left hamstring. ... Gordon missed his sixth straight game with a bruised right knee. ... It's the sixth time this season Houston has scored 70 points or more in the first half.\n\nDATE NIGHT?\n\nTucker boxed out a couple of Cavaliers and avoided grabbing the ball to help Harden collect his 10th rebound on Friday night. Tucker joked that Harden might owe him for the move.\n\n\"Dinner, movies. I need a date,\" Tucker joked.\n\nLater, Harden was asked if Tucker deserves dinner for helping him get his triple-double.\n\n\"I took P.J. to dinner, movies, Europe,\" Harden said laughing. \"I take P.J. everywhere with me. He gets enough already.\"\n\nUP NEXT\n\nCavaliers: Visit Los Angeles Lakers on Sunday night.\n\nRockets: Visit Orlando on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994776.061671
}