{
  "game_id": "0022000564",
  "espn_id": "401299015",
  "date": "Feb 17, 2021",
  "matchup": "CHI vs. DET",
  "headline": "LaVine leads Bulls over Pistons in newly scheduled game",
  "body": "CHICAGO -- — Zach LaVine scored 37 points and the Chicago Bulls beat the Detroit Pistons 105-102 Wednesday night on short notice.\n\n\r\n                    The Bulls were scheduled to visit Charlotte, with the Pistons at Dallas. Those games got called off Tuesday by the NBA because of COVID-19 contact tracing concerns with the Hornets and power outages in Texas. The Bulls and Pistons were then scheduled to play each other, instead.\n\n\r\n                    Bulls coach Billy Donovan benched his young players at the start of the second half but they came through with big shots late.\n\n\r\n                    “As professionals you hope they go to the locker room, they regroup, they realize there’s going to be some changes made,” Donovan said. “When my number’s called, I have to be ready and prepared, and I thought those guys did that.” \n\n\r\n                    Chicago made two 3-pointers late in the game to hold off Detroit. Coby White made his shot from the corner to give the Bulls a 100-96 lead with just over a minute left before Patrick Williams knocked down a 3-pointer with 29 seconds remaining to make it 103-98.\n\n\r\n                    White was one of the players that Donovan pulled.\n\n\r\n                    “It was a learning experience for me,” White said. “I had to accept the challenge and do what I needed to help my team win.” \n\n\r\n                    LaVine made a free throw to ice the game in the final seconds. He scored 15 points in the third quarter to help Chicago rally from a 25-point, second-quarter deficit, the biggest comeback in the NBA this season.\n\n\r\n                    Wendall Carter Jr. added 18 points while Williams had 15. Chicago won its second straight game overall and fifth in a row against Detroit.\n\n\r\n                    Jerami Grant scored a career-high 43 points for the Pistons, who cooled off after a strong start.\n\n\r\n                    “I think we could’ve done a better job in the third quarter and I thought we gave up the lead,” Grant said. “Down the stretch, we missed some shots that we normally make. We gave up the game.” \n\n\r\n                    Delon Wright scored 10 of his 12 points in the first half while Dennis Smith Jr. added 10 points off the bench.\n\n\r\n                    Detroit started the second quarter on a 12-0 run and Chicago failed to score until Carter's follow dunk midway through the period. \n\n\r\n                    Chicago outscored Detroit 27-12 in the third quarter and retook the lead when Garret Temple made a layup with 10 minutes left to make it 74-73.\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Detroit scored 11 points off 13 Chicago turnovers … F Sekou Doumbouya missed his third straight game with a concussion.\n\n\r\n                    Bulls: Thad Young added nine points and 10 rebounds off the bench … Otto Porter Jr. missed his eighth straight game with recurring back spasms. Coach Billy Donovan said the forward is doing some conditioning but has not done any work on the court. … Lauri Markkanen (shoulder) is doing some conditioning but still experiencing discomfort in his shoulder.\n\n\r\n                    QUICK ADJUSTMENT\n\n\r\n                    Chicago planned to fly to Charlotte after its overtime win at Indiana on Monday before a snowstorm forced the team to stay the night in Indianapolis. On Tuesday, instead of flying to Charlotte, the NBA announced the Hornets’ next two game were postponed because of the league’s health and safety protocols. \n\n\r\n                    As the Bulls planned to return back to Chicago for practices, the NBA announced Tuesday Chicago would play Detroit, forcing a quick adjustment. \n\n\r\n                    “There was a lot to get ready for because as a staff, you have guys working on Charlotte to get prepared to play them,” Donovan said. “Now, all of a sudden, you’re playing a team that wasn’t even on your schedule so there was no reason to prepare.”\n\n\r\n                    Detroit had Dallas on its mind Tuesday morning before severe weather in Texas forced the game to be postponed and sent the Pistons to Chicago. \n\n\r\n                    “It’s like I said at the beginning of the year, the only thing that’s going to be usual about this year is the unusual,” Pistons coach Dwane Casey said.\n\n\r\n                    UP NEXT\n\n\r\n                    Pistons: Play Friday in Memphis, where they have lost seven of the last nine.\n\n\r\n                    Bulls: Visit Philadelphia on Friday. They have lost five straight there.\n\n\r\n                    ------\n\n\r\n                    More AP NBA:\n\n\r\n                    https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997597.264889
}