{
  "game_id": "0021701066",
  "espn_id": "400975812",
  "date": "Mar 21, 2018",
  "matchup": "MEM @ PHI",
  "headline": "76ers rest starters in 4th quarter after thumping Grizzlies",
  "body": "PHILADELPHIA --  The 76ers are closing in on their first playoff berth since 2012, but they're not satisfied with merely making the postseason. So there was no chance they would take lowly Memphis lightly.\n\nRobert Covington, J.J. Redick and Dario Saric each had 15 points to pace all five Philadelphia starters in double-figures, and the 76ers continued their push for home-court advantage in the playoffs with a 119-105 victory over the Grizzlies on Wednesday night.\n\n\"We are on the war path to get home-court advantage,\" coach Brett Brown said.\n\nJoel Embiid added 14 points and Ben Simmons had 13 points, nine assists and seven rebounds for the 76ers (40-30), who won their fourth straight to improve to a season-best 10 games over .500. None of the starters played in the fourth quarter.\n\n\"We're moving up,\" Embiid said. \"Our goal is home-court advantage.\"\n\nPhiladelphia began Wednesday sixth in the Eastern Conference, just a game back of the Pacers for the fourth spot and accompanying home-court advantage for a first-round series.\n\n\"That's what we're playing for,\" Simmons said. \"We have to stick with it.\"\n\nPhiladelphia controlled play in the first half and headed to the locker room up 58-44, led by Embiid's 14 points. Philadelphia completely pulled away with a dominant third quarter, outscoring the Grizzlies 41-25 to take a 99-69 lead into the fourth.\n\nPhiladelphia shot 64 percent (16 for 25) from the field in the period, including 6 for 10 from 3-point range.\n\n\"It was a great sight to see,\" Embiid said.\n\nThe starters didn't play another minute, saving energy for the second game of the back-to-back on Thursday night at Orlando. The move did prevent Simmons from reaching his fourth triple-double in the last five games.\n\nWayne Selden Jr. had 18 points to lead Memphis (19-52), which has lost 21 of its last 22 games.\n\n\"We gave in a bit, probably the first time in a long time I can remember that happening,\" Memphis interim coach J.B. Bickerstaff said. \"Frustration took over. (The 76ers) are playing with a high purpose right now. They put their thumb down when they had to.\"\n\nNO EASY OUT\n\nBrown said that Philadelphia isn't going to be an easy out, or a team that opponents will relish facing, in the playoffs.\n\n\"We have accumulated some firepower,\" he said. \"If we can keep moving forward, I wouldn't want to play us. We can be dangerous.\"\n\nHOT DIGGETY\n\nThe 76ers gave two free hot dogs at halftime to every fan in attendance as thanks for braving the nor'easter that blanketed the Philadelphia region with snow. The team announced a crowd of 10,411.\n\nLONG ROAD\n\nThe Grizzlies dropped their 16th in a row on the road and have yet to win away from Memphis in 2018. Their last road win came Dec. 31, 2017, 114-96 at Sacramento.\n\nTIP-INS\n\nGrizzlies: Marc Gasol will sit out Thursday's game at Charlotte, Bickerstaff said prior to the game. He had five points and six rebounds. ... Tyreke Evans didn't play against the 76ers but will be in the lineup Thursday. ... The Grizzlies beat Philadelphia 105-101 on Jan. 22 in Memphis.\n\n76ers: Brown said he planned to play Embiid on Thursday at Orlando in the second game of the back-to-back. Brown plans to rest Embiid at some point in the final 12 games, though he expects the 7-footer to resist. \"I bet it comes with a fight,\" Brown said of his decision to sit Embiid.\n\nUP NEXT\n\nGrizzlies: At Charlotte on Thursday night.\n\n76ers: At Orlando Thursday night.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992718.864958
}