{
  "game_id": "0022200202",
  "espn_id": "401468357",
  "date": "Nov 14, 2022",
  "matchup": "MIA vs. PHX",
  "headline": "Adebayo scores 30, Heat storm back to stun Suns 113-112",
  "body": "MIAMI -- — Elite scorer. Elite defender.\n\n\r\n              Devin Booker got to his spot. Jimmy Butler got there, too. And Butler rose to the moment, capping a brilliant comeback win for the Miami Heat.\n\n\r\n              Bam Adebayo scored 30 points, including a pair of go-ahead free throws with 35 seconds left, and Butler's block was part of a frantic finish as the Heat rallied from a 13-point, fourth-quarter deficit to beat the Phoenix Suns 113-112 on Monday night.\n\n\r\n              “Those two guys are really the foundational heartbeat pieces to our team,\" Heat coach Erik Spoelstra said. “We follow their warrior spirits. They're just so tough, the epitome of being two-way basketball players.\"\n\n\r\n              Phoenix had three shots to win on its final possession — a missed layup by Cameron Payne, the jumper from Booker from the right elbow that Butler blocked, and then a 3-pointer from Booker that bounced off the rim, with Butler hounding him again.\n\n\r\n              “Tough break for us,\" Suns coach Monty Williams said. “Our guys fought like heck to have a chance to win.\"\n\n\r\n              Butler finished with 16 points, 13 rebounds and seven assists for Miami. Caleb Martin and Kyle Lowry each scored 15 for Miami, which got back to .500 at 7-7.\n\n\r\n              “I love the fact that we won this game on the defensive end,\" Butler said.\n\n\r\n              Adebayo outscored the Suns by himself in the last eight minutes, 12-10. Phoenix missed 12 of its 16 shots in that span, while Miami finished 8 for its last 12.\n\n\r\n              Booker led the Suns with 25 points. Duane Washington Jr. added 21 and Deandre Ayton finished with 16 points and 12 rebounds for the Suns, who shot only four free throws compared to Miami's 25.\n\n\r\n              “That is hard to swallow ... a physical game like that, where everybody's bumpin', we only get four free throws,\" Williams said. “This is becoming really hard to swallow. You feel like you can't even talk about it because you're going to be fined.\"\n\n\r\n              The Heat went 22 for 25 on those tries from the line, the 13th consecutive game where they shot at least 80% from the stripe — extending their franchise record.\n\n\r\n              It was the first time an NBA team shot four free throws in a game since May 16, 2021 — also the Suns, against San Antonio.\n\n\r\n              Torrey Craig’s layup with 8:03 left put Phoenix up 102-89, the Suns’ biggest lead of the night. The Heat outscored Phoenix 24-10 the rest of the way.\n\n\r\n              “We've had tests all year, and some of those games we didn't finish,\" Adebayo said. “They were nothing but experience for a game like this.\"\n\n\r\n              Both teams were missing key guards. Miami’s Tyler Herro was out for the fourth consecutive game with a sprained left ankle, and Phoenix’s Chris Paul sat with right heel soreness.\n\n\r\n              TIP-INS\n\n\r\n              Suns: The Suns don’t believe Paul’s heel issue is long-term. “Day-to-day,” Williams said. ... Phoenix lost back-to-back games for the first time this season. ... The Suns had been 7-0 in games in which they led by at least 13 points.\n\n\r\n              Heat: Among those in the crowd -- Wayne Gretzky, Odell Beckham Jr. and Melvin Ingram. ... Dewayne Dedmon had 12 for the Heat, including a pair of 3-pointers late in the third to stop a Phoenix run. ... Adebayo also had 10 rebounds.\n\n\r\n              LOWRY 2K\n\n\r\n              Lowry’s first 3-pointer was the 2,000th of his career. He’s the 12th player in NBA history to make that many.\n\n\r\n              BIRTHDAY REF\n\n\r\n              South Florida native Dedric Taylor was one of the referees, working on his 47th birthday. Taylor worked for the City of North Miami Beach Parks & Recreation Department and was a UPS driver before getting into the NBA.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Host Golden State on Wednesday\n\n\r\n              Heat: Visit Toronto on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993986.677095
}