{
  "game_id": "0021600977",
  "espn_id": "400900372",
  "date": "Mar 11, 2017",
  "matchup": "ORL vs. CLE",
  "headline": "James's triple leads Cavaliers over Magic, 116-104",
  "body": "ORLANDO, Fla. --  While the Cleveland Cavaliers are a work in progress heading toward the end of the season, LeBron James is rolling along just fine.\n\nJames had 24 points, 13 assists and 12 rebounds, and the Cavaliers stopped a three-game losing streak with a 116-104 victory over the Orlando Magic on Saturday night.\n\nKyrie Irving scored 22 points for Cleveland, which placed seven players in double figures. Tristan Thompson had 14 points and 13 rebounds, and Iman Shumpert added 15 points.\n\n\"We've got some great possibilities and it's a process,\" said James, who posted his career-best ninth triple-double of the season. \"We can never get too high or too low. We are getting guys acclimated and getting guys back into the system. It's a process for us and we understand that.\"\n\nThe Cavaliers played without All-Star Kevin Love and Kyle Korver due to injuries. Love is recovering from knee surgery, and Korver missed his second straight game with a sore left foot.\n\nBut J.R. Smith made three of Cleveland's 15 3-pointers and finished with 11 points in his second game after right thumb surgery. Deron Williams, who signed with the Eastern Conference-leading Cavs last month, added 10 points.\n\n\"We've still got to get Kevin back, Kyle back,\" coach Tyronn Lue said. \"We still have pieces to plug in to figure it out. It's going to take a little time.\"\n\nOrlando had four players score in double figures, but lost for the fourth time in five games. Nikola Vucevic had a team-high 20 points and 16 rebounds after missing the previous four games with a sore right Achilles.\n\nThe Magic put together a 12-2 run to tie it at 63 with 9:43 left in the third. But Richard Jefferson responded with a 3-pointer and Smith added two big 3s to help Cleveland run back out to an eight-point advantage with James on the bench for much of the quarter.\n\nThe Cavaliers (43-21) shot 50 percent (43 for 86) from the field overall.\n\n\"They definitely have a lot of weapons,\" said Aaron Gordon, who guarded James most of the night. \"They're the defending world champs for a reason.\"\n\nJames found his rhythm in the second quarter, collecting six points and six assists while helping Cleveland to a 59-51 lead at the break. The Cavs shot nearly 53 percent from the field while Orlando converted just 38.5 percent from the field during the opening half.\n\nTIP-INS\n\nCavaliers: Finished with 30 assists. ... Cleveland went 15 for 25 at the free-throw line.\n\nMagic: Gordon had 16 points, and Evan Fournier finished with 15. Elfrid Payton finished with eight points, 10 rebounds and six assists.\n\nTRIPLE FEEL\n\nOn the subject of triple-doubles, James said he knows when his assists are high but is usually unaware of the other numbers until he is told.\n\n\"I can feel the assists because I know the ball is popping, especially out of my hands,\" he said. \"But the points I never think about it and the rebounds just kind of happen in the flow. But the assists I always try to be conscious of that because I have to get my guys the ball.\"\n\nUP NEXT\n\nCavaliers: Visit the Houston Rockets on Sunday night. The Cavaliers defeated Houston in an early season matchup, but the Rockets have not lost two straight to Cleveland since 2001-02 season.\n\nMagic: Open a three-game West Coast swing at Sacramento on Monday night. The Magic have defeated the Kings in their last two meetings.",
  "source": "espn_api",
  "crawled_at": 1764995823.416915
}