{
  "game_id": "0022400851",
  "espn_id": "401705417",
  "date": "Feb 28, 2025",
  "matchup": "ATL vs. OKC",
  "headline": "Gilgeous-Alexander scores 31 points as Thunder roll past Hawks 135-119 to continue dominance of East",
  "body": "ATLANTA -- — Shai Gilgeous-Alexander scored 31 points and the Oklahoma City Thunder continued their overwhelming dominance of the Eastern Conference by beating the Atlanta Hawks 135-119 on Friday night.\n\n\r\n              Luguentz Dort scored 20 points and led Oklahoma City's long-range assault by shooting 6 of 11 on 3-pointers. Jalen Williams also scored 20 points for the Thunder.\n\n\r\n              Oklahoma City never trailed and improved to 21-1 against the Eastern Conference. The Thunder (48-11), who have the Western Conference's top record, are 27-10 against the West.\n\n\r\n              Atlanta center Onyeka Okongwu had 23 points and 13 rebounds. Caris LeVert scored 23 points. \n\n\r\n              Trae Young added 19 points with 12 assists for the Hawks. Young shot only 5 of 14 from the field.\n\n\r\n              Takeaways\r\n              Thunder: G Isaiah Joe scored 12 points in 11 minutes before being ruled out in the third quarter with lower back soreness. ... F Chet Holmgren, who was listed as questionable with a right calf contusion, started and scored seven points in 15 minutes.\n\n\r\n              Hawks: Atlanta trailed by 20 at 45-25 but tightened the deficit with a 14-0 run, capped by LeVert's 3-pointer, late in the first half to trail 71-64 at halftime.\n\n\r\n              Key moment \r\n              Led by Gilgeous-Alexander, the Thunder pulled away late in the third period. After leading 91-81, the Thunder controlled the final minutes of the period to stretch their advantage to 27 before taking a 108-84 lead into the fourth.\n\n\r\n              Key stat\r\n              The Thunder made 23 of 50 3s. Their season high for 3-pointers was 27 in a 137-101 win over New Orleans on Feb. 10.\n\n\r\n              Up next\r\n              The Thunder visit San Antonio on Sunday and the Hawks visit Memphis on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997919.024908
}