{
  "game_id": "0022001034",
  "espn_id": "401307843",
  "date": "May 11, 2021",
  "matchup": "TOR vs. LAC",
  "headline": "Clippers lead all the way in 115-96 win over Raptors",
  "body": "TAMPA, Fla. -- — Kawhi Leonard scored 20 points, Paul George added 16 and the Los Angeles Clippers led all the way Tuesday night in a 115-96 win over the Toronto Raptors.\n\n\r\n                    Terance Mann also scored 20 points and Ivica Zubac had 18 points and 10 rebounds for the Clippers, who stayed one game ahead of the Denver Nuggets in the race for third place in the Western Conference. Both teams have three road games left to play. The Nuggets hold the tiebreaker, having won two of three against the Clippers.\n\n\r\n                    Chris Boucher had 16 points and seven rebounds for the Raptors, who played without most of their regular rotation and lost for the seventh time in eight games.\n\n\r\n                    “They were missing a lot of players,” said Leonard, who had seven rebounds and five assists.\n\n\r\n                    Marcus Morris Sr. opened the game with a 3-pointer and the Clippers never trailed.\n\n\r\n                    After three 3-pointers by Rajon Rondo, a couple of dunks by Zubac and two straight baskets by Leonard, the Clippers took a 17-point lead late in the first half.\n\n\r\n                    “It’s hard playing these games when their best players aren’t there, but it’s all about us offensively,” said Clippers coach Tyronn Lue, who wasn't happy about 10 turnovers in the first half and 18 in the game. \"Just the flow of our game was kind of choppy.\n\n\r\n                    “I thought in the third quarter we played hard and set the tone defensively. We have to be more professional. Until we do that we’re going to have 18, 19 turnovers and you can’t have that, especially when you're playing against better teams.”\n\n\r\n                    Leonard had only one turnover in 30 minutes.\n\n\r\n                    “You want to be in single digits (in turnovers) in the playoffs,” Leonard said. “It just comes down to what kind of mindset do we want to have. At times we can look real nasty, and that's what we've got to clean up. We can't just keep talking about it. We have to start doing it.”\n\n\r\n                    Malachi Flynn's 3-pointer got the margin down to eight just before the end of the first half. But the Raptors, using their 35th different starting lineup of the season, never got any closer in the second half.\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: G Patrick Beverley started for the first time since April 8. ... F-C Serge Ibaka, who has not played since March 14 due to a back injury, hopes to play during the season-ending four-game road trip.\n\n\r\n                    Raptors: Boucher started and played 38 minutes after missing nine games with a sprained left knee. ... F Pascal Siakam (strained left shoulder) and G-F Rodney Hood (fractured finger) did not play after being injured Sunday night. ... G Kyle Lowry, G Fred VanVleet and F OG Anunoby also sat out the first game after Toronto's official elimination from the postseason.\n\n\r\n                    NO HOME GAMES\n\n\r\n                    Before the Raptors’ second-to-last “home” game in Tampa, Raptors coach Nick Nurse was asked what he missed about Toronto.\n\n\r\n                    “I miss the snow, the wind, the cold. I’m from Iowa,” he said, half jokingly. “But I miss the electricity of playing at home, where six hours before a game, you could just feel the vibe in the air. And I guess I miss the change in the seasons a little bit.”\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Play Thursday night at Charlotte.\n\n\r\n                    Raptors: Play Thursday night at Chicago.",
  "source": "espn_api",
  "crawled_at": 1764996820.8020968
}