{
  "game_id": "0021900456",
  "espn_id": "401161098",
  "date": "Dec 25, 2019",
  "matchup": "MIL @ PHI",
  "headline": "Embiid stars as 76ers beat Bucks 121-109",
  "body": "PHILADELPHIA --  Joel Embiid was unyielding under the basket, arms extended sky high as Giannis Antetokounmpo tried to plow through the All-Star center for a bucket. Embiid absorbed the contact and slapped the ball out of Antetokounmpo's hands, one of a bountiful of disruptive plays triggered by the big man.\n\nEmbiid used a national showcase to play like an MVP, and the Sixers pushed around a Bucks team that had the best record in the NBA.\n\n\"A lot of people have kind of forgotten who I am,\" Embiid said. \"When I'm needed, I'm going to show up.\"\n\nEmbiid had 31 points and 11 rebounds in Philadelphia's first home Christmas game in 31 years, and the 3-point happy 76ers beat Milwaukee 121-109 on Wednesday.\n\nTobias Harris sank five 3s, Josh Richardson and Furkan Korkmaz each had four and even Embiid hit three as part of Philly's franchise record-tying 21 3s (on 44 attempts) in its most complete game of the season.\n\n\"I think this team is designed for the playoffs,\" coach Brett Brown said. \"I believe the road we have traveled so far has been a little bit erratic, at times. But I think the landing spot is exciting.\"\n\nHarris and Al Horford hit 3s over the final 90 seconds to push back a late Bucks run, and the Sixers improved to 16-2 at home.\n\nThere was a charged atmosphere for the anticipated matchup featuring Embiid and Ben Simmons taking on Khris Middleton and Antetokounmpo. Fans dressed as elves, wore ugly sweaters and held signs that said all they wanted for Christmas was a Sixers win.\n\nThey got it, with Embiid bullying the reigning MVP in Antetokounmpo on the way to the Sixers' biggest halftime lead (21 points) against the Bucks under coach Mike Budenholzer.\n\n\"It was just one of those nights,\" Budenholzer said.\n\nEmbiid scored 23 points and was troublesome defensively, holding Antetokounmpo to 4-for-14 shooting in the half. The Sixers hit 11 3s in the half and made the NBA-best Bucks (27-5) look like anything but Eastern Conference contenders.\n\nBrown said before the game the Bucks were \"NBA royalty.\" They have a ways to go before they're crowned tops in the East.\n\nWith fans chanting \"Trust the Process!\" on Embiid free throws, the star center was worthy of the holiday highlight video.\n\n\"I reminded our team, people in America have more appreciation for this day in the NBA,\" Brown said. \"We're grateful for the opportunity.\"\n\nThe Sixers aced their test against the NBA's best.\n\n\"I'm not going to overvalue one game,\" 76ers general manager Elton Brand said, \"but it's a good barometer.\"\n\nIt wasn't just Embiid that flustered the Bucks. Korkmaz was knocked on his rear and buried Philly's 16th 3 of the game late in the third for a 93-67 lead that had the crowd going wild. Korkmaz's shot capped a string of 3s on five straight Sixers baskets. Mike Scott, the reserve better known for his man-of-the-people popup appearances, became the seventh Sixer to hit a 3 for a 98-70 lead. The 76ers led 100-73 through three.\n\nMiddleton scored 31 points and Antetokounmpo had 18 points and 14 rebounds. Antetokounmpo got flustered over a perceived missed call on an eye poke and was whistled for a technical in the fourth.\n\nAntetokounmpo, who was 8 for 27 from the floor, 0 for 7 3s, said he briefly suffered blurred vision.\n\n\"We had to go through this today. We had to go down 30,\" Antetokounmpo said. \"We had to have our character tested today because the only way you get better is when you face adversity. Our team is going to be better.\"\n\nBrand held a state-of-the-franchise press conference before the game and preached chemistry and continuity would eventually get the Sixers among the best in the East, a conference many pundits picked them to win.\n\n\"We are going to get there,\" Brand said. \"Home-court advantage is important but having Joel healthy in the playoff in May, June, that is important to us. We could still grow into a team that could be a No. 1 seed.\"\n\nFor a game, the 76ers sure played like one.\n\nTIP-INS\n\nBucks: The Bucks trailed by 29 and held only an early three-point lead.\n\n76ers: Embiid had his seventh game this season with 30 points and 10 rebounds. He scored 20 points before halftime for the second time this season. ... Simmons had 15 points and 14 assists. .. The Sixers scored 120-plus points in three straight games for the first time since they did it in four straight from March 28-April 3, 1990\n\nBANNER TIME\n\nBucks guard Donte DiVincenzo admired the 2016 and 2018 Villanova national championship banners that hang in the rafters. The former Wildcats star was named Final Four Most Outstanding Player in the '18 title run.\n\n\"There's two of them things. That's tough,\" he said.\n\nTRADE MARKET\n\n\"I always look at opportunities to improve the team. That is my job to make sure Brett and the group have the pieces to compete for a championship. Right now, I am definitely encouraged,\" Brand said.\n\nUP NEXT\n\nBucks: Play Friday at Atlanta.\n\n76ers: Open a four-game trip Friday at Orlando.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996156.292387
}