{
  "game_id": "0021600939",
  "espn_id": "400900334",
  "date": "Mar 06, 2017",
  "matchup": "MEM vs. BKN",
  "headline": "Lin leads late rally as Nets defeat Grizzlies 122-109",
  "body": "MEMPHIS, Tenn. --  The Memphis Grizzlies' downward spiral is in full spin right now. A loss to the lowly Brooklyn Nets provided the latest proof of their troubles.\n\nThe Nets put together a fourth-quarter rally to break open a close game and beat Memphis 122-109 on Monday night, winning for only the second time in the last 20 games.\n\nThe loss to the worst team in the NBA was the third straight for the Grizzlies and fifth defeat in the last seven.\n\n\"I don't know what to say,\" said reserve forward Zach Randolph, who had 10 points, but was 4 of 12 from the field.\n\nSean Kilpatrick led the Nets with 23 points, but it was a fourth-quarter performance by Jeremy Lin, who scored nine straight points down the stretch, that gave Brooklyn the cushion it needed. Lin finished with 18 points, including 11 in the final frame.\n\n\"He had some big shots and he made some big shots,\" Nets coach Kenny Atkinson said. \"But I thought everyone contributed. . It was really a team victory.\"\n\nIsaiah Whitehead scored 15 points, while Randy Foye and Caris LeVert added 14 apiece as Brooklyn shot 53 percent in snapping a two-game slide.\n\nMike Conley led Memphis with 32 points, his eighth 30-point game this season.\n\nThe teams traded leads until a little more than 4 minutes remained when a dunk by Rondae Hollis-Jefferson started a stretch of eight straight Brooklyn points, part of a 13-2 run for the Nets. Lin scored nine straight in the spurt, including a 3-pointer to give the Nets a 116-106 lead with 1:43 left.\n\n\"We had too many `My bads' and too many `We should have done this, we should have done that,\" said Memphis center Marc Gasol, who had 18 points. \"Too many of them. Especially down the stretch.\"\n\nThe game had 15 lead changes and nine ties, the last lead change coming with Hollis-Jefferson's dunk. In the game-clinching push, Lin had four straight free throws and a 10-footer before his 3-pointer stretched the lead to 10.\n\nMemphis, which carried a 57-56 lead into intermission, built the advantage to 12 in the third and carried a 91-88 lead into the final quarter.\n\nTIP-INS\n\nNets: The win snapped a five-game Brooklyn losing streak against Memphis. ... Kilpatrick converted 16 of 17 free throws. ... Brooklyn played its sixth game of the eight-game circus road trip, covering about 8,100 miles over 16 days. Ringling Brothers and Barnum & Bailey Circus was at the Barclays Center, which will now host the ACC Tournament. ... LeVert made all five of his shots, including two from outside the arc, through the first three quarters before his only miss -- a 3-pointer in the fourth.\n\nGrizzlies: Memphis made all seven of its 3-pointers in the first quarter. Vince Carter missed the opening attempt of the second to end the streak. Memphis finished the night 10 of 25 from outside the arc. ... Carter passed Moses Malone (1,329) for 16th in NBA history for career regular-season games played. ... F Brandan Wright, who had missed several games, returned after his wife gave birth to twin girls.\n\nCHANGE IS HERE\n\nMemphis coach David Fizdale tipped his hand on a lineup change in pregame comments. Fizdale noted the Grizzlies entered the game 14-13 since Jan. 1 and that is unacceptable. \"At some point, obviously, I'm going to look to shake some things up,\" he said. He started Andrew Harrison at guard and Wright at forward with JaMychal Green and Tony Allen coming off the bench.\n\nATTITUDE ADJUSTMENT\n\nLin said the win is part of an effort to build a new identity for the Nets. \"We want to develop a nastiness about us. We want to develop a toughness about us. Hopefully, we can continue to build on this.\"\n\nUP NEXT\n\nNets: Continue their eight-game road trip with the seventh stop on Wednesday in Atlanta.\n\nGrizzlies: Play the second game of their four-game homestand Thursday night against the Los Angeles Clippers as the two teams jockey for postseason position in the Western Conference.",
  "source": "espn_api",
  "crawled_at": 1764995574.931062
}