{
  "game_id": "0022400568",
  "espn_id": "401705134",
  "date": "Jan 15, 2025",
  "matchup": "HOU @ DEN",
  "headline": "Green and Sengun help the Rockets beat the short-handed Nuggets 128-108",
  "body": "DENVER -- — Jalen Green scored 34 points, Alperen Sengun had 20 points, nine rebounds and eight assists and the Houston Rockets beat the short-handed Denver Nuggets 128-108 on Wednesday night.\n\n\r\n              Green, who hit six 3-pointers, continued his recent scoring surge. He is averaging 32 points in Houston's last six games, including a career-best 42 points against Memphis on Monday.\n\n\r\n              Fred VanVleet added 16 points, eight assists and three steals for the Rockets, who beat Denver for the fifth time in six meetings.\n\n\r\n              The Nuggets were without two of their five leading scorers in reigning league MVP Nikola Jokic (right elbow inflammation) and Aaron Gordon (right calf injury).\n\n\r\n              Jamal Murray and Christian Braun each scored 22 point for Denver, which had 18 turnovers in the loss, including five apiece from its starting backcourt of Murray and Russell Westbrook. \n\n\r\n              Takeaways\r\n              Rockets: Houston won its fifth in a row and improved to 10-3 in its last 13 games to solidify its standing as the No. 2 team in the Western Conference.\n\n\r\n              Nuggets: Denver, which had won eight of its previous 10 games, absorbed its most lopsided defeat since a 145-118 loss to the New York Knicks on Nov. 25.\n\n\r\n              Key moment\r\n              Houston opened the second quarter on an 8-2 run that was capped off by a corner 3 by former Nugget Jeff Green that stretched the Rockets' lead to 11 points. Houston outscored Denver 41-25 in the period to take a 69-48 lead into halftime.\n\n\r\n              Key stat\r\n              The loss was Denver’s eighth in 20 home games this season, matching the Nuggets’ home loss total across 41 regular-season games in 2023-24.\n\n\r\n              Up next\r\n              Houston continues its three-game road swing Thursday at Sacramento. The Nuggets are back in action Friday at the Miami Heat.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997384.928535
}