{
  "game_id": "0021800183",
  "espn_id": "401070864",
  "date": "Nov 10, 2018",
  "matchup": "SAC vs. LAL",
  "headline": "James scores 25 as Lakers top Kings 101-86",
  "body": "SACRAMENTO, Calif. --  Smoke from the raging Northern California wildfires seeped into the Golden 1 Center, giving LeBron James a headache and leading Los Angeles Lakers coach Luke Walton to shorten his players' stints on the court.\n\nBut the haze did little to slow James and the Lakers, who used their best defensive effort of the year to earn a 101-86 win Saturday night against the Sacramento Kings, lifting Los Angeles to .500 (6-6) for the first time this season.\n\nJames scored 25 points and recently signed Tyson Chandler had 12 rebounds for the Lakers, who began the season with three straight losses but now have won four of their last five.\n\nThe Lakers held the Kings, who entered the game averaging 118 points per contest, to their lowest scoring total of the season. It was only the second time Sacramento has been held below 100 points this season, and it marked the first time Los Angeles had held an opponent below 100.\n\n\"We won the game tonight because of our defense,\" Walton said. \"I think we've been showing glimpses of that defense, but tonight was the first time we've been able to put it together for long stretches.\"\n\nJames hit three 3-pointers and had seven rebounds. He only had two assists, though he often fed teammates for open shots that missed -- including Lonzo Ball, who was 2 for 10 from the field.\n\nChandler, playing in his second game with the Lakers, logged 23 minutes and scored three points. In his first game, the Lakers held Minnesota to 110 points -- which, up until Saturday night's game, was tied for the lowest by any Los Angeles opponent this season.\n\n\"For me, the defense has been easy because it comes naturally, but it's a matter of getting into the offense,\" Chandler said. \"The key for us was getting back on transition, building walls, forcing them into a half-court offense.\"\n\nJames said the Lakers' center duo of starter JaVale McGee and Chandler, who combined for 20 rebounds and a pair of steals, has solidified a defense that struggled early in the season.\n\n\"(Chandler) just shored up our front court. We have a great 1-2 punch now with JaVale and Tyson,\" James said.\n\nDe'Aaron Fox had 17 of his 21 points in the first half to lead the Kings, who shot 35 percent from the field and went 6 for 25 on 3-pointers. Willie Cauley-Stein added 12 points and 12 rebounds.\n\nFox said the Lakers were able to shut down the Kings' fast-paced offense by getting back quickly on defense.\n\n\"They got back every shot attempt and they sent four people back,\" he said. \"And we didn't shoot the ball well.\"\n\nThe Lakers were ahead by six points at the half and held a 76-65 lead entering the fourth quarter. They built that lead to 20 points at 88-68 before the Kings responded with a 10-0 run, but Sacramento got no closer.\n\nON THE REBOUND\n\nThe Lakers had a season-high 59 rebounds, including a season-best 17 on the offensive end. Five of Chandler's rebounds were offensive, while McGee had three of his eight rebounds on offense.\n\nLEBRON'S RETURN\n\nJames made his NBA debut in Sacramento 15 seasons ago as the No. 1 overall draft pick of the Cleveland Cavaliers. He had 25 points, nine assists, six rebounds and four steals in the Oct. 29, 2003, game in which the Kings defeated the Cavs 106-92.\n\nBAD SHOOTING\n\nThe Kings were held to their worst field goal percentage of the season, going 32 of 92 from the field. They were averaging 49 percent shooting coming into the contest, third best in the NBA.\n\nTIP-INS\n\nLakers: Ball missed all six of his 3-point attempts, most of them wide open. ... There were plenty of Los Angeles fans in the stands, and several \"Let's Go Lakers\" chants in the fourth quarter.\n\nKings: Sacramento's 44 points in the first half matched a season low. ... The Kings had scored 100 or more points in each of their seven previous contests. ... Sacramento had a season-low 11 assists.\n\nUP NEXT\n\nLakers: Return home to host Atlanta on Sunday.\n\nKings: Conclude a four-game home stand on Monday by hosting San Antonio, which has won 14 straight against Sacramento.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994224.1361809
}