{
  "game_id": "0021600739",
  "espn_id": "400899430",
  "date": "Feb 01, 2017",
  "matchup": "PHX vs. LAC",
  "headline": "Griffin scores 29, Clippers bounce back to beat Suns 124-114",
  "body": "PHOENIX --  A game against the Phoenix Suns was just what the embarrassed and short-handed Los Angeles Clippers needed.\n\nAnd even that wasn't all that easy.\n\nBlake Griffin scored 29 points in his third game back from injury and the Clippers bounced back from a humiliating 46-point loss at Golden State to beat the Suns 124-114 on Wednesday night.\n\nThe victory over the team with the worst record in the West left Los Angeles 2-4 since Chris Paul went down with a torn left thumb ligament.\n\nRaymond Felton added 18 points and J.J. Redick 16 for the Clippers.\n\n\"Right now, we are scrambling for each win,\" Los Angeles coach Doc Rivers said. \"That is the mode we have been in. We have been in that mode. We have been playing without Blake. We have been playing without both of them for a while. Now we get Blake back, but it takes him time. We are just in the mode of survival.\"\n\nGriffin missed 18 games recovering from a right knee procedure.\n\nLos Angeles never trailed, but Phoenix cut the lead to two four times and was down by just one at 94-93 with 10:26 to play.\n\nEric Bledsoe scored 41 to tie the career high he set two games ago, but Phoenix lost its fifth in a row. Devin Booker added 20 points, his 14th straight game scoring at least 20.\n\n\"I was proud how we stuck with it,\" Griffin said. \"At times, we let up defensively and didn't execute the way we want it to. But with the adversity, DJ going out, them playing real hard and E Bled (Bledsoe) having a fantastic game, I was proud the way we stuck with it and dug it out at the end.\"\n\nThe Clippers' DeAndre Jordan drew a flagrant foul two for flattening Phoenix's Marquese Chriss and was ejected with 4:52 left in the third quarter.\n\n\"I didn't agree with it at all,\" Jordan said. \"I tried to go for the ball, but I couldn't get it and got his arm. I am 6-11, 280 pounds. If I flagrant-2 somebody, they are probably not going to get up afterward.\"\n\nLos Angeles led by as many as 14 early in the third quarter and was up 83-71 when Jordan left. The Suns came back to twice cut it to two late in the third quarter.\n\nBledsoe's reverse layup in traffic cut it to 90-88 with 10 seconds left, but Brandon Bass' jumper put the Clippers up 98-88 entering the fourth quarter.\n\nP.J. Tucker's 3-pointer made it a one-point game, 94-93, with 10:26 to play. But Bass, who didn't play in the first half, sank a jumper and made two free throws and Los Angeles led 98-93.\n\nPhoenix stayed close for a while and was down 109-106 after Bledsoe's three-point play with 3:50 left. But Redick banked in a 3-pointer from the top of the key to make it 112-106, and Felton's 3 with 2:15 to play pretty much sealed the win.\n\nLos Angeles was up 45-34 in the second quarter when Marreese Speights scored inside with 8:50 left.\n\nBut a Phoenix lineup mostly of reserves, led by Leandro Barbosa, narrowed the gap. Phoenix scored the last seven points of the half, five by Bledsoe, to cut the lead to 62-59 at the break.\n\nBledsoe had eight assists and four rebounds to go with his 41-point performance.\n\n\"I think Bledsoe is playing at an elite level,\" Suns coach Earl Watson said, \"so we have to make sure moving forward our team, everything we do, we cannot waste his valuable time.\n\n\"So Bledsoe is at an elite level, Book is coming up, he's playing at that level, also.\"\n\nNow, Watson said, he needs complementary players so the Suns can \"just capture this momentum that those two have in the backcourt.\"\n\nTIP-INS\n\nClippers: Rivers made his team on Monday watch its 46-point loss at Golden State. ... The Clippers are 3-0 against Phoenix this season, two without Paul.\n\nUP NEXT\n\nClippers: Los Angeles returns home for a rematch with the Warriors, who routed the Clippers at Golden State 144-98 on Saturday.\n\nSuns: After an 0-3 homestand, Phoenix plays the Kings in Sacramento on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995961.6908212
}