{
  "game_id": "0022401186",
  "espn_id": "401705752",
  "date": "Apr 13, 2025",
  "matchup": "ORL @ ATL",
  "headline": "Keaton Wallace logs first career triple-double as Hawks beat Magic 117-105 before play-in rematch",
  "body": "ATLANTA -- — Keaton Wallace posted his first career triple-double and Atlanta beat the Orlando Magic 117-105 on Sunday to give the Hawks a split of their four-game, regular-season series and momentum for a rematch in the play-in tournament.\n\n\r\n              Wallace had 15 points, 15 assists and 11 rebounds to become Atlanta's first two-way player to record a triple-double. He added five steals.\n\n\r\n              Most starters were held out as the teams prepared for the play-in tournament. Atlanta, the No. 8 seed in the Eastern Conference, will play at No. 7 Orlando on Tuesday. The winner advances to the playoffs. \n\n\r\n              Terance Mann scored 19 points for Atlanta.\n\n\r\n              The Hawks closed the regular season with three straight wins and ended the Magic's five-game winning streak.\n\n\r\n              Takeaways\r\n              Magic: Anthony Black had 20 points and 10 rebounds and Jonathan Isaac had 12 points and 10 rebounds. Center Wendell Carter Jr. and forward Tristan da Silva were Orlando’s only regular starters.\n\n\r\n              Hawks: Rookie Zaccharie Risacher scored six points in nine minutes as the only Atlanta regular to start. Trae Young was one of five players held out on fan appreciation day.\n\n\r\n              Key moment\r\n              Following a 24-24 tie late in the opening period, the Hawks scored 13 consecutive points to lead 37-24 early in the second period.\n\n\r\n              Key stat\r\n              After sitting out the game, Hawks guard Dyson Daniels led the NBA with 229 steals, 3.0 steals per game and 443 deflections. It was the league's most steals since Gary Payton's 231 for Seattle in the 1995-96 season. The last player to have as many as 200 steals in a season was Chris Paul with 216 for New Orleans in 2008-09.\n\n\r\n              Up next\r\n              Atlanta visits Orlando on Tuesday in the play-in tournament with the winner landing the No. 7 seed in the playoffs and the loser facing an elimination game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997518.463338
}