{
  "game_id": "0022401173",
  "espn_id": "401705739",
  "date": "Apr 11, 2025",
  "matchup": "ATL @ PHI",
  "headline": "Young scores 36, LeVert adds 31 as Hawks secure play-in spot with 124-110 over 76ers",
  "body": "PHILADELPHIA -- — Trae Young hit six 3-pointers and had 36 points and 11 assists, Caris LeVert added 31 points and the Atlanta Hawks beat the Philadelphia 76ers 124-110 on Friday night, securing an Eastern Conference play-in spot.\n\n\r\n              Georges Niang scored 16 points and Mouhamed Gueye added 10 points and a career-high 18 rebounds for the Hawks. Dyson Daniels had 10 rebounds to go with eight points, eight assists, three steals and two blocks. The 6-foot-7 forward has 229 steals this season, the most since Gary Payton (231) in 1995-96. \n\n\r\n              Jared Butler led the 76ers with 25 points and seven assists and Marcus Bagley chipped in career highs of 20 points, 10 rebounds and five assists. Bagley, who went into the game 1 for 21 from 3-point range in his eight-game NBA career, hit four 3s in the final 5 1/2 minutes of the first half. \n\n\r\n              Takeaways\r\n              Hawks: Atlanta was trying to stay in the top eighth in the play-in tournament field and got a much-needed win. The Hawks entered the night one game ahead of Chicago and two games ahead of Miami for that spot. If they finish in the top eight, they can lose their first play-in game and still be alive for a playoff spot.\n\n\r\n              76ers: The loss guaranteed Philadelphia the fifth-best odds in the NBA draft lottery. That spot gives them a 10.5% chance at getting the top overall pick. \n\n\r\n              Key moment\r\n              Atlanta led 111-102 in the fourth quarter before going on a 9-0 run to put the game out of reach. Young hit two 3-pointers during that stretch.\n\n\r\n              Key stat\r\n              LeVert made 12 of 15 field goals for the Hawks.\n\n\r\n              Up next\r\n              The Hawks play their home finale Sunday — the last day of the regular season — against the Orlando Magic. The 76ers host the Chicago Bulls on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997909.05968
}