{
  "game_id": "0021800305",
  "espn_id": "401070986",
  "date": "Nov 27, 2018",
  "matchup": "PHX vs. IND",
  "headline": "Bogdanovic's 3 helps Pacers escape with win in Phoenix",
  "body": "PHOENIX --  A night after their biggest road blowout victory in 22 years, the Indiana Pacers had to go down to the wire against the Phoenix Suns.\n\nLong-range shooting touch pulled the Pacers through.\n\nBojan Bogdanovic sank the go-ahead 3-pointer with 31 seconds to play and the Pacers escaped with a 109-104 victory over the Suns on Tuesday night.\n\nThe Pacers, coming off 121-88 victory at Utah the previous night, had their hands full in a tight fourth quarter against a 4-15 Suns team.\n\n\"That wasn't pretty at all,\" Indiana coach Nate McMillan said. \"We weren't sharp in this game but you got to find ways to win games like that.\"\n\nMyles Turner's 3 gave Indiana a 104-101 lead with 48 seconds to play, but Devin Booker responded with a 3-pointer to tie it at 104-104 with 45 seconds left.\n\nAfter Bogdanovic's long-range basket, Booker's attempt at a game-tying 3 barely rimmed out. Darren Collison's two free throws wrapped up the scoring.\n\n\"We didn't want to lose, simple as that,\" Collison said. \"There was nothing coach could tell us, other than the fact if we would've let that game slip away, it would've been a bigger downfall on our part. ... I felt like it was more on us that we kind of let the game get out of hand and kind of lost focus, but it's the NBA, we're just trying to get wins.\"\n\nDoug McDermott and Domantas Sabonis scored 21 points apiece for Indiana. Turner added 16 and Bogdanovic 15.\n\nT.J. Warren scored 25 for the Suns. Booker was just 7-of-21 shooting but scored 20 points and had eight assists. Deandre Ayton had 18 points and 12 rebounds.\n\nIndiana led by as many as 13 points in the second and third quarters, but Phoenix, with Booker and Ayton on the bench, used a 15-2 run late in the third and early in the fourth to go up 85-81 when Richaun Holmes made one of two free throws with 9:51 to play.\n\nUntil the final seconds, nobody led by more than four the rest of the way.\n\nMcDermott and Sabonis each scored 12 in the second quarter. McDermott's consecutive 3s in an 8-0 Pacers spurt put Indiana up 46-35 with 6:37 left in the half. Indiana stretched it to 52-39 on Sabonis' two free throws but Phoenix got it back to single digits and trailed 61-54 at the break.\n\nIndiana stretched the lead back to 13, 76-63, on Collison's 3-pointer but the Suns finished the quarter with a 7-2 spurt, Isaiah Canaan's 3-pointer cutting the lead to 81-77 entering the final quarter.\n\n\"I think the awareness in the second half is something that we needed, that's how we have to play,\" Phoenix coach Igor Kokoskov said. \"And we battled. I think we gave ourselves a chance to come back, a chance the tie the game and maybe go overtime. Who knows?\"\n\nAs for Booker's last shot, Kokoskov said, \"You don't put everything on the last shot. It was in and out. We know Book's going to make a lot of shots for this franchise.\"\n\nTIP-INS\n\nPacers: Indiana's 33-point win at Utah was the fifth time the Pacers have won a road game by at least 30 points and first in 22 years (when they won at Vancouver 127-80 in December 1996). ...  Indiana reserves scored a season-high 62 points in the rout at Utah. ... McDermott and Sabonis were a combined 8-for-11 in the second quarter against Phoenix. .... McDermott scored 21 for the second game in a row after going scoreless in his previous game.\n\nSuns:  Ayton became the fourth player since 1992 with at least 300 points and 200 rebounds in his first 20 NBA games. The others who did it are Blake Griffin, Tim Duncan and Shaquille O'Neal. ... Ayton had 14 points and seven rebounds in the first half. ... A victory would have given Phoenix two wins in its last three games. Suns have won just four all season.\n\nUP NEXT\n\nPacers: At the Los Angeles Lakers on Thursday night.\n\nSuns: At the Los Angeles Clippers on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995099.834882
}