{
  "game_id": "401810035",
  "espn_id": "401810035",
  "date": "Nov 05, 2025",
  "matchup": "POR vs OKC",
  "headline": "Avdija and Trail Blazers rally from 22 down to hand Thunder their first loss, 121-119",
  "body": "PORTLAND, Ore. -- — Deni Avdija had 26 points, 10 rebounds and nine assists, and the Portland Trail Blazers erased a 22-point deficit Wednesday night in a 121-119 victory over the Oklahoma City Thunder.\n\n\r\n              Jrue Holiday added 22 points, including two clutch free throws that put Portland ahead 121-118 with six seconds left. Jerami Grant scored 20 off the bench as the Blazers handed the defending NBA champions their first loss of the season.\n\n\r\n              With the Thunder (8-1) trailing by three, Isaiah Joe was fouled on a jumper with 0.5 seconds remaining. After a replay review showed Joe’s toe was on the 3-point line, he made his first free throw but missed the second on purpose. Oklahoma City came up empty on a last-second tip-in attempt.\n\n\r\n              Thunder star Shai Gilgeous-Alexander scored 35 points and Aaron Wiggins added 27. Oklahoma City was without several players who played in Tuesday night's win at the Los Angeles Clippers, as Chet Holmgren, Lu Dort and Alex Caruso all sat out.\n\n\r\n              Holiday’s jumper gave Portland (5-3) its first lead at 97-96 with 6:44 left. After the Blazers forced a backcourt violation on Oklahoma City’s next possession, Holiday made a 3-pointer to put Portland up 100-96. \n\n\r\n              Wiggins then went on a personal 5-0 run to put the Thunder back in front 101-100. The teams exchanged leads from there before Grant’s jumper put the Trail Blazers up 105-104. Portland pushed its lead to nine before OKC charged back.\n\n\r\n              Avdija started 0 for 10 from the field and didn’t make his first field goal until there were 38 seconds left in the third quarter. That sparked a Portland rally. Duop Reath’s 3-pointer just before the third-period buzzer made it 86-81.\n\n\r\n              Oklahoma City jumped out to a 41-21 lead after the first quarter. Struggling offensively, Portland turned to Reath, a 3-point shooting center. Reath played the entire second quarter and scored nine points, all on 3s, to help the Blazers outscore the Thunder 36-24 in the period.\n\n\r\n              Oklahoma City led by 14 in the third before Portland rallied.\n\n\r\n              Up next\r\n              Oklahoma City visits Sacramento on Friday night. \n\n\r\n              Portland visits Miami on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042570.6424441
}