{
  "game_id": "0021801083",
  "espn_id": "401071756",
  "date": "Mar 22, 2019",
  "matchup": "TOR vs. OKC",
  "headline": "George scores 28 as Thunder beat Raptors 116-109",
  "body": "TORONTO --  Stuck in a four-game losing streak, Russell Westbrook and the Oklahoma City Thunder came to Toronto and got their swagger back.\n\nPaul George scored 28 points, Westbrook had 18 points, 13 assists and 12 rebounds, and the Thunder beat the Raptors 116-109 on Friday night.\n\nDennis Schroder came off the bench to score 12 of his 26 points in the fourth quarter and Jerami Grant scored 19 as the Thunder avenged Wednesday's 123-114 home defeat to Toronto.\n\n\"We just played defense at a higher level tonight,\" Westbrook said.\n\nBesides defense, the Thunder also improved their outside shooting, making 20 of 43 shots from 3-point range. Oklahoma City shot 13 for 43 from 3 in Wednesday's loss.\n\n\"They made `em tonight,\" Raptors coach Nick Nurse said.\n\nSchroder connected on 10 of 16 shots, going 4 of 7 from long range.\n\n\"He gave us a really good boost at both ends of the floor,\" coach Billy Donovan said.\n\nSchroder called it an important win for the Thunder.\n\n\"We got back to our swag, how we play,\" Schroder said. \"To come up big like that in Toronto means a lot for everyone.\"\n\nKawhi Leonard scored 37 points and Pascal Siakam had 25 for the Raptors, who played without All-Star point guard Kyle Lowry.\n\nLowry missed his second straight game because of a sprained right ankle. Nurse said there's no structural damage to Lowry's ankle, but soreness remains following a collision with New York's Mitchell Robinson on Monday. Nurse said Lowry is expected to return next week.\n\nDanny Green scored 19 points and Serge Ibaka had 11, but Toronto couldn't hold a double-digit lead in the third quarter for the second straight game. The Raptors gave away a 20-point lead before recovering to win in overtime Wednesday, but weren't able to match that on their home court.\n\n\"We were right there, really close there at the end and didn't get many breaks,\" Nurse said.\n\nOklahoma City trailed by 10 points to start the second half, and was down 13 with 5:23 to go in the third before rallying. Westbrook gave the visitors the lead for the first time since early in the first quarter on a layup with 1:18 left in the period, putting them up 80-79. The Thunder closed the third with a 20-4 run to take an 83-80 lead into the fourth.\n\nLeonard cut the gap to 93-91 on a free throw with 7:33 to play but George hit 3-pointers on either side of a fast-break layup by Grant, giving Oklahoma City a 101-91 edge with 6:21 left.\n\nThe Thunder missed eight of their first 10 shots of the game. Toronto was 5 of 6 from 3-point range in the first, with Green making all three of his attempts, and the Raptors led 29-22 after one.\n\nThe Raptors led 58-48 at halftime.\n\nTIP-INS\n\nThunder: Oklahoma City has won four straight in Toronto. ... Westbrook shot 6 for 20, going 3 for 10 in each half. ... Terrance Ferguson scored 11 points. ... Oklahoma City made a season-high 22 3-pointers against the Lakers on Jan. 17.\n\nRaptors: Norman Powell had a career-high 11 rebounds. ... Starting C Marc Gasol didn't attempt a shot until scoring on a dunk with 1:40 remaining in the fourth. ... Former Raptors star Jorge Garbajosa attended the game.\n\nSTREAK STOPPED\n\nToronto lost for the first time in 20 games when leading at the half, ending a franchise-record streak.\n\nROTTEN RECIPE\n\nThe Raptors made 22 turnovers, one shy of their season worst.\n\n\"If someone told you before the game you'd have 20 turnovers and they'd hit 20 3s, you'd say we'd lose by 20,\" Raptors Fred VanVleet said. \"It's not a recipe for success.\"\n\nUP NEXT\n\nThunder: At Memphis on Monday night.\n\nRaptors: Host Charlotte on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994247.4626381
}