{
  "game_id": "0022201223",
  "espn_id": "401469378",
  "date": "Apr 09, 2023",
  "matchup": "DET @ CHI",
  "headline": "LaVine, DeRozan put Bulls over Pistons; play-in game next",
  "body": "CHICAGO -- — Zach LaVine scored 17 points and DeMar DeRozan added 16 to help the Bulls end the regular season Sunday with a 103-81 win over the Detroit Pistons. \n\n\r\n              Shortly after, Detroit coach Dwane Casey stepped down for a job in the franchise's front office, capping the Pistons' NBA-worst 17-65 season. Killian Hayes had 26 points and Jaden Ivey scored 16 for the Pistons.\n\n\r\n              Up 67-64 at the end of the third quarter, the Bulls put in their reserves. The bench crew, led by Carlik Jones’ 11 points, put the game away with an 11-2 run midway through the final period.\n\n\r\n              Chicago had the 10th spot in Eastern Conference standings locked up, and travel to Toronto for Wednesday's elimination game in the NBA’s play-in tournament. The winner advances to Friday’s meeting with the loser of Tuesday’s Atlanta-Miami game.\n\n\r\n              “You gotta be composed,” said DeRozan, who has experience with a play-in tournament game. “The time on the clock is really your season. You just have to focus on the moment and understand you have to get past that test first.”\n\n\r\n              Jalen Duren had 17 rebounds for Detroit, which snapped an 11-game skid Friday night at Indiana.\n\n\r\n              Casey, the league’s coach of the year with Toronto in 2018, mostly had young teams in Detroit. He guided the Pistons to the playoffs in his first season but the franchise stayed close to the Eastern Conference basement the next four seasons.\n\n\r\n              “When you bring in a young team, this league is not very forgiving in terms of wins and losses,” he said. “I knew that coming in.”\n\n\r\n              The Pistons can begin hoping they win the May 16 NBA Draft lottery and a shot at selecting 7-foot-2 French superstar Victor Wembanyama. Detroit picked Cade Cunningham two years ago after winning the first selection.\n\n\r\n              TIP-INS\n\n\r\n              Pistons: The 65 losses are Detroit’s most since the 1979-80 season, when coach Dick Vitale was fired a dozen games in and the team finished a franchise-worst 16-66.\n\n\r\n              Bulls: DeRozan played his first nine seasons in Toronto before being traded. He said he’s looking forward to seeing his original employer in the playoffs. “I’m pretty sure (coach) Nick (Nurse) and those guys are going to do everything in their power to make sure I don’t beat them,” he said. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994349.611841
}