{
  "game_id": "0022400647",
  "espn_id": "401705213",
  "date": "Jan 26, 2025",
  "matchup": "OKC @ POR",
  "headline": "Shai Gilgeous-Alexander scores 33 points, NBA-leading Thunder beat Trail Blazers 118-108",
  "body": "PORTLAND, Ore. -- — Shai Gilgeous-Alexander scored 33 points and the NBA-leading Oklahoma City Thunder beat the Portland Trail Blazers 118-108 on Sunday night.\n\n\r\n              Jalen Williams added 24 points and eight assists, and Isaiah Hartenstein had 14 points and 11 rebounds to help the Thunder rebound from a home loss to Dallas on Thursday night. Oklahoma City is 37-8 overall and 17-5 on the road. \n\n\r\n              Deni Avdija had 28 points, eight assists and seven rebounds for Portland.\n\n\r\n              Portland made things interesting in the final period, cutting it to 93-88 on Anfernee Simons' free throws. The Thunder countered with a banked 3-pointer from Williams to make it 96-88. A 3-pointer from Alex Caruso made it 105-90.\n\n\r\n              Takeaways\r\n              Thunder: Oklahoma City leads the league in steals for the second straight season. According to coach Mark Daigenault, the biggest reason is the defensive prowess of their best players, not anything he is coaching. “On our level, it’s the quality of defensive personnel,\" he said.\n\n\r\n              Trail Blazers: Rookie center Donovan Clingan has been in and out of the lineup this season with injuries. He returned Friday night in a win over Charlotte, finishing with 13 rebounds and four blocks. “I’m happy to have him back out there,” coach Chauncey Billups said. \n\n\r\n              Key moment\r\n              The Thunder outscored the Trail Blazers 39-27 in the second quarter.\n\n\r\n              Key stats\r\n              \r\n              Oklahoma City had a 52-22 edge in points in the paint and a 28-13 advantage on second- chance points.\n\n\r\n              Up next\r\n              The Thunder are at Golden State on Wednesday night. The Trail Blazers host Milwaukee on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997681.9648151
}