{
  "game_id": "0022401040",
  "espn_id": "401705606",
  "date": "Mar 24, 2025",
  "matchup": "DAL @ BKN",
  "headline": "Naji Marshall's 22 leads Mavericks to 120-101 rout of Nets in Anthony Davis' return",
  "body": "NEW YORK -- — Naji Marshall scored 22 points off the bench to lead the Dallas Mavericks to a 120-101 rout of the Brooklyn Nets on Monday night.\n\n\r\n              P.J. Washington and Spencer Dinwiddie finished with 16 each, Brandon Williams scored 15 and Kai Jones added 13. Anthony Davis, in his first game back after missing six weeks with a groin injury, had 12 points in 27 minutes.\n\n\r\n              Brooklyn dropped to 23-49 with its fourth straight loss. Nic Claxton led the Nets with 19 points. \n\n\r\n              Takeaways\r\n              Mavericks: For a team that is in a neck-and-neck race with Phoenix for the final Western Conference play-in spot, Dallas believes that the reinsertion of Davis — among others — can provide a boost. “We understand what’s at stake here,” coach Jason Kidd said before the game. “We got to figure out how to win.” \n\n\r\n              Nets: With three weeks remaining, coach Jordi Fernandez wants his team to use the final 11 games of the season to work on in-game execution. “We have to control (in order) to (have) one more possession,” Fernandez said before the game. “I think winning teams take care of those possessions.”\n\n\r\n              Key moment\r\n              Dallas guard Spencer Dinwiddie knocked down a left corner 3, and then assisted on buckets by Marshall and Jones in a 26-second span midway through the third quarter that allowed the Mavericks to extend their lead to 75-56.\n\n\r\n              Key stat\r\n              Brooklyn entered the game ninth in the NBA in 3-pointers attempted per game (39.1) and 27th in percentage of 3-pointers made per game (34.5%). Against the Mavericks, the Nets made 11 of their 33 attempts from beyond the arc.\n\n\r\n              Up next\r\n              The Mavericks play the Knicks on Tuesday night. Brooklyn hosts Toronto on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997136.11049
}