{
  "game_id": "0021501054",
  "espn_id": "400828941",
  "date": "Mar 22, 2016",
  "matchup": "OKC vs. HOU",
  "headline": "Westbrook's triple-double leads Thunder past Rockets 111-107",
  "body": "OKLAHOMA CITY -- Russell Westbrook's recent play has been on par with some of the game's all-time greats.\nThe dynamic point guard had 21 points, 15 assists and 13 rebounds to help the Thunder beat the Houston Rockets 111-107 on Tuesday night.\nWestbrook has 15 triple-doubles this season and 34 in his career. It's the most triple-doubles by a player in a season since 1988-89, when Magic Johnson had 17 and Michael Jordan had 15. It was also Westbrook's sixth triple-double in March. According to STATS, it's the most by a player in a calendar month since Jordan had seven in April 1989.\n\n\"That's just a blessing,\" Westbrook said. \"Especially getting mentioned with those guys. Those guys are Hall of Famers. My job is try to help us win games and try to win a championship.\"\nIt was his third triple-double in a row and fourth in his past five games. The Thunder improved to 15-0 this season when he gets a triple-double and 30-4 all-time.\n\"When he helps us rebound like that and passes the ball, it's good for our team,\" Thunder forward Kevin Durant said. \"I think the thing is rebounds. When he rebounds like that, we're a better team. He can pass and he can score with the best of them. When he rebounds that way, it gives us a little something extra.\"\nDurant scored 23 points and Dion Waiters added 17 to help the Thunder win their fifth straight.\nJames Harden had 24 points, a career-high 16 assists and seven rebounds for the Rockets. Dwight Howard had 16 points and 13 rebounds and Patrick Beverley added 16 points.\nHouston led 99-97 when Westbrook took over. He found Steven Adams for a dunk on an inbounds pass, got a steal and a dunk, then made a long 2-point jumper to give the Thunder a 103-99 lead.\nHarden's 3-pointer with 13.8 seconds to play cut Oklahoma City's lead to 108-107. Serge Ibaka made 1 of 2 free throws with 11.9 seconds left to give the Thunder a two-point lead. Harden then tried the get the ball down low to Howard, but Waiters stole it.\n\"It was the right read by both of our guys offensively, but it was a heck of a defensive play by Waiters to deflect the ball,\" Rockets coach J.B. Bickerstaff said.\nWestbrook made two free throws at the other end with 3.5 seconds remaining to put the game out of reach.\n\"We felt like we were in it the whole game,\" Howard said. \"We had great opportunities to win. K.D. made some tough shots, Russ made some tough shots and they got some stops down the stretch. That won them the game.\"\nWestbrook scored 14 points in the fourth quarter after struggling with his shot for most of the game.\n\"It's just read and react,\" Westbrook said. \"I just try to find ways. In the first half, if guys are doubling and they're coming over, I try to find open guys and trust my teammates in making shots. Late in the game, some spots opened up, and that's when I attacked.\"\n---\nSTAT LINES\nDurant tied a career high by scoring at least 20 points for the 56th consecutive game.\n\"I don't care,\" he said. \"That's what I'm supposed to do. That's what they pay me for. They rely on me every night to be consistent, and I've got to be that way.\"\nRARE AIR\nJordan had seven triple-doubles in just 12 games in April 1989. From March 25 to April 14, he had 10 triple-doubles in 11 games, including a stretch of seven straight.\nELITE COMPANY\nThe only other player to have at least five triple-doubles in a month since Jordan's outburst was Grant Hill, who had five for Detroit in April 1997.\nTIP-INS\nRockets: Howard played for the first time since the league investigated a spray he said he had routinely put on his hands for grip for the past five years. A Rockets spokeswoman said there has been no discipline from the league, and Howard chose to use nothing on his hands. ... Harden's 10 assists in the first half matched the most he's had in a half in his career. ... A basket by Michael Beasley late in the third quarter was waved off after review because he took the shot after the shot clock had expired.\nThunder: F Kyle Singler sat out with soreness and tightness in his lower back. ... The Thunder shot 52.2 percent in the first quarter. ... Oklahoma City attempted just three free throws in the first half. ... The Thunder improved to 6-0 on Tuesdays this season. ... Durant passed Michael Finley and moved into 81st place on the league's all-time scoring list. He now has 17,326 points.\nUP NEXT\nRockets: Host Jazz on Wednesday.\nThunder: Host Jazz on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994132.164439
}