{
  "game_id": "0022200200",
  "espn_id": "401468355",
  "date": "Nov 14, 2022",
  "matchup": "CHA @ ORL",
  "headline": "Hornets stop 8-game slide with 112-105 win against Magic",
  "body": "ORLANDO, Fla. -- — LaMelo Ball had 17 points and nine assists, and the Charlotte Hornets stopped an eight-game slide with a 112-105 victory over the Orlando Magic on Monday night.\n\n\r\n              Charlotte had seven players score in double figures, including its starting lineup. Mason Plumlee had 18 points and 10 rebounds. Terry Rozier scored 17 points, and Kelly Oubre Jr. had 16 points and six steals.\n\n\r\n              Franz Wagner scored 23 points and Wendell Carter Jr., added 20 for Orlando, but the Magic had 22 turnovers.\n\n\r\n              Ball, who missed the Hornets' 113-93 loss at Orlando last month because of a sprained ankle, played in only his second game of the season after missing the first 13.\n\n\r\n              “Obviously he makes a huge difference for our team,” said Steve Clifford, who won for the 200th time as coach of the Hornets.\n\n\r\n              Charlotte led 93-74 after Ball hit two 3-pointers in quick succession early in the fourth quarter.\n\n\r\n              Bol Bol and Chuma Okeke made two 3-pointers each to launch Orlando's only serious run of the game, but the Magic could get no closer than seven.\n\n\r\n              With the help of 13 Magic turnovers, Charlotte dominated the first half, leading 58-45 at the break despite going 3 for 17 from beyond the arc.\n\n\r\n              'At halftime I liked all of it,\" Clifford said. “I liked the way we moved the ball. We didn’t shoot well and yet we were still scoring. For the first two and a half quarters, that’s as good as we’ve played. Our defense was really good.”\n\n\r\n              Mo Bamba kept Orlando in the game in the first half with 14 points and seven rebounds.\n\n\r\n              Bamba described the 22 turnovers, leading to 21 Charlotte points, as “deflating.” Coach Jamahl Mosley agreed.\n\n\r\n              “That was the game. That was the game right there,\" Mosley said. “Turning the basketball over, losing possessions, and then giving up wide-open layups at the other end.”\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Made 7 of 35 3-point shots in the game. ... F Gordon Heyward missed a seventh game with a left shoulder contusion. ... G Dennis Smith (sprained left ankle) missed a second game but might be back Wednesday. ... Plumlee, shooting free throws with his left hand this season, made 2 of 2 Monday night to raise his season percentage to .589, a big step up from last season's right-handed .392. \n\n\r\n              Magic: Rookie F Paolo Banchero (sprained ankle) did not play. He was a “game-time” decision. “Obviously he wanted to play,” Mosley said. “This is the first time he’s really hurt that ankle and I think he’s responding to it well. He’s doing the treatments he needs to do, he’s working in the training room, he’s doing everything that’s necessary to get back on the court.” ... G Cole Anthony missed a ninth game due to a torn oblique. ... Eight of Bamba's 11 rebounds were at the offensive end. ... On their current homestand, which ends Wednesday night, the Magic have defeated Golden State, Dallas and Phoenix while losing to Oklahoma City, Houston and Charlotte.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Play at home against Indiana on Wednesday night.\n\n\r\n              Magic: Play at home against Minnesota on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994286.248184
}