{
  "game_id": "0021800240",
  "espn_id": "401070921",
  "date": "Nov 19, 2018",
  "matchup": "CLE @ DET",
  "headline": "Drummond, Pistons cruise past Cavaliers 113-102",
  "body": "DETROIT --  Before Detroit's matchup with Cleveland, Pistons coach Dwane Casey stressed the importance of a good start.\n\n\"When the bell rings, we've got to be ready to run and play fast, and play together,\" Casey said. \"I've had it before and somehow, there's some reason we get off to that slow start, and we can't afford that.\"\n\nCasey could have few complaints about his team's start Monday night. The Pistons shot 74 percent from the field in the first quarter and sailed to a 113-102 win over the Cavaliers.\n\nAndre Drummond had 23 points and 16 rebounds for the Pistons, Blake Griffin added 21 points and 12 rebounds, and Reggie Bullock scored 21 points. The Pistons led 66-46 at halftime, and the game was never close after that.\n\n\"We had a lot of positives,\" Casey said. \"I thought our defense was solid and we started the game well. I was on the team about the start and we scored 38 points in the first quarter.\"\n\nThe Cavaliers are now an NBA-worst 2-13 heading into their reunion with LeBron James. The Los Angeles Lakers play at Cleveland on Wednesday night.\n\nDrummond scored 13 points in the first quarter. The Pistons led 38-27 after one, then scored the first 11 points of the second. Bullock's 3-pointer in the final seconds made it a 20-point advantage at the half.\n\nThe lead reached 30 in the third quarter before the Cavaliers went on an 18-2 run that lasted well into the fourth, making the final score a little more respectable.\n\n\"I feel like we were on a run, and we were rolling,\" Cleveland's Collin Sexton said. \"When it's like that, I feel like anything's possible.\"\n\nSexton led the Cavs with 18 points, and Jordan Clarkson contributed 16.\n\nRECORD\n\nThe Pistons shot 13 of 38 from 3-point range. They've made at least 10 shots from beyond the arc in six straight games, tying a franchise record set last November.\n\nBullock was 4 of 7 from long distance.\n\n\"We ran a lot of zone tonight, we weren't as sharp with our drops as far as where the ball is located,\" Cavs coach Larry Drew said. \"When you're playing against a team that shoots 3s, you just have to know where shooters are.\"\n\nTEMPERS FLARE\n\nFour Detroit players were called for technical fouls in the fourth quarter. Stanley Johnson, Jose Calderon and Reggie Jackson received technicals within a 103-second span, and Drummond was called for one later in the quarter.\n\n\"Always like standing up for ourselves, but you're never going to beat the power of the whistle,\" Griffin said. \"I said to Coach Casey, it starts with me. I've gotten three technical fouls in the fourth quarter late in games, and early in the season, and I've set a bad precedent.\"\n\nTIP-INS\n\nCavaliers: Cleveland is without star F Kevin Love (left foot), and G George Hill (right shoulder) and F Sam Dekker (left ankle) were also out. ... The Cavs were outrebounded 50-36 but had a 20-11 advantage in second-chance points. ... Rodney Hood and Ante Zizic scored 12 points each, and Tristan Thompson and Cedi Osman added 10 apiece.\n\nPistons: Detroit is without G Luke Kennard (right shoulder). ... Jackson scored 13 points and Ish Smith added 11.\n\nUP NEXT\n\nCavaliers: Host the Lakers on Wednesday night.\n\nPistons: At Houston on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994801.571311
}