{
  "game_id": "0021900296",
  "espn_id": "401160938",
  "date": "Dec 02, 2019",
  "matchup": "MEM vs. IND",
  "headline": "Balanced scoring carries Pacers past short-handed Grizzlies",
  "body": "MEMPHIS, Tenn. --  Indiana’s balanced scoring was too much for a makeshift Memphis Grizzlies lineup.\n\nMalcolm Brogdon scored 19 points, Domantas Sabonis added 18 and the Pacers beat the depleted Grizzlies 117-104 on Monday night.\n\nSeven players scored in double figures for the Pacers, including Myles Turner with 17 points. Jeremy Lamb and reserve Justin Holiday had 15 apiece, with Holiday missing only one of his six 3-point attempts.\n\nHoliday said “I think guys are just ready, and when they get their chance” they seize the moment.\n\n“It’s a testament to moving the ball, just playing together on both ends,” Lamb added.\n\nBall movement has become the key for the Pacers, who have won six of seven. Their passing and cutting provided open shots, and Indiana capitalized by shooting 50% from the field and hitting 16 of 38 3-pointers (42%).\n\n“You move the ball to the open man and you’re going to shoot a high percentage,” coach Nate McMillan said.\n\nJaren Jackson Jr. led Memphis with a season-high 31 points. Solomon Hill moved into the starting lineup and added 22, also a season best. Dillon Brooks finished with 19 on 7-of-16 shooting.\n\nThe Grizzlies were short-handed as four players -- all key parts of the rotation -- sat out with various ailments. That left the reserves trying to play with any kind of rhythm.\n\nFor the most part it was unsuccessful, but first-year Memphis coach Taylor Jenkins said he was still proud of the effort, adding “there’s no excuses.”\n\n“We could have come out super flat,” Jenkins said. “I know our offense wasn’t where it could have been, missing some shots, layups, 3s, but we competed.”\n\nFor McMillan, the key to Indiana’s recent success has been unselfish play.\n\n“I just like the fact that we’re moving the ball,” he said. “We’re sharing the ball, getting the ball to the open man. Normally, when you play that way good things happen.”\n\nTIP-INS\n\nPacers: Defeated Memphis 126-114 last Monday. ... Sabonis has reached double figures in all 18 games he’s played this season. He also had 14 rebounds in his 15th double-double of the season. … T.J. Warren was held to 14 points, all in the first half. He had at least 23 in three of his previous four games.\n\nGrizzlies: Played without both their first-round rookies. G Ja Morant is nursing a sore back sustained in last Monday’s loss at Indiana, and F Brandon Clarke is dealing with left hip soreness. Meanwhile, forward Kyle Anderson also sat out with right heel soreness. C Jonas Valančiūnas was out with an illness. … Tyus Jones started in Morant’s place, and Hill replaced Valančiūnas. It was Hill’s first start of the season.\n\nMELTON EMERGES\n\nMemphis reserve guard De’Anthony Melton benefited from the absence of other rotation players, playing a season high in minutes (just under 25) and scoring a season-best 16 points on 6-of-10 shooting. He also grabbed nine rebounds. Some think Melton should be getting more playing time, and his performance against the Pacers seemed to bode well.\n\n“Loved it,” Jenkins said, later adding: “If he keeps having the simple mentality on defense and offense and keeps his game plan pretty simple for himself, I think he could have a really bright future.”\n\nLEARNING FROM INJURIES\n\nWith key players out, Memphis can learn something from the Pacers about how the absences can help create a balanced team. Indiana has had its share of injuries, including guard Victor Oladipo, who is rehabbing a right knee injury. Lamb has missed nine games, while Turner has sat out six.\n\n“I feel like when a lot of people were injured, a lot of people were able to step up and get some playing time,” Lamb said. “We really saw what we had and it made us a better team. You don’t always see that going through it, but now we see it has made us a better team.”\n\nUP NEXT\n\nPacers: Travel to Oklahoma City to play the Thunder on Wednesday night.\n\nGrizzlies: Play at Chicago on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995746.031191
}