{
  "game_id": "0021900774",
  "espn_id": "401161416",
  "date": "Feb 07, 2020",
  "matchup": "PHX vs. HOU",
  "headline": "Oubre scores career-high 39, Suns top Rockets 127-91",
  "body": "PHOENIX --  Kelly Oubre Jr. was one of many Phoenix Suns players who had their names floated in trade rumors over the past week. But the trade deadline came and went, nobody was moved, and by Friday morning's shootaround there was a mini-celebration that everyone was still around.\n\n\"The first thing we said when we saw each other this morning was `We made it!\" Oubre said.\n\nThe good vibes continued several hours later when the Suns played one of their best games of the season in a 127-91 victory over the Houston Rockets. Oubre scored a career-high 39 points and Devin Booker added 33.\n\n\"I don't want to get too high on the hog, but I thought that was a really good effort from our guys,\" Suns coach Monty Williams said. \"There was a sense of urgency from the tip to play with great effort. That was pleasing for me.\"\n\nThe Suns poured in 46 points in the first quarter and led the rest of the way, turning back a handful of Houston rallies. The Rockets were playing without All-Star guard Russell Westbrook, who was held out for rest one night after Houston beat the Los Angeles Lakers.\n\nThe 24-year-old Oubre had a stellar game on his bobblehead night, hitting a 3-pointer at the buzzer to give the Suns a 97-73 lead going into the fourth quarter. He shot 14 of 19 from the field, including 7 of 9 from 3-point range.\n\n\"My teammates were passing me the ball,\" Oubre said. \"I was just playing within the coach's system, being in attack mode, staying aggressive. I'm honored, but we've got another one tomorrow.\"\n\nThe Suns snapped a four-game losing streak overall and a 13-game losing streak against the Rockets that dates to 2016.\n\nJames Harden led the Rockets with 32 points despite not playing in the fourth quarter because the Suns were well ahead. He finished 9 of 19 from the field and made five 3-pointers.\n\n\"They played better than we did,\" Houston coach Mike D'Antoni said. \"Their athleticism, their freshness just overwhelmed us and we were dead-legged, couldn't make threes. Just all kinds of little things.\"\n\nThe Suns jumped out to a 46-26 lead by the end of the first quarter, shooting 17 of 20 from the field, including 8 of 10 from 3-point range. Booker scored 18 points and Oubre had 10.\n\nHouston bounced back in the second quarter, cutting the deficit to 65-55 by halftime. Harden scored 25 points in the first half, including 16 in the second quarter. The Rockets cut the Suns' lead to 65-59 early in the third quarter, but couldn't get any closer.\n\n\"In games like this you've got to jump on teams. It was kind of going back and forth and they kind of blitzed us,\" Harden said. \"We tried to fight our way back. It was just too much.\"\n\nThe Suns shot 56% from the field for the game, including 15 of 31 (48%) on 3-pointers. Phoenix improved to 21-31 for the season while Houston fell to 33-19.\n\nSMALL BALL SPUTTERS\n\nThe Rockets have had some success over the past week with abnormally small lineups, including one game where nobody listed over 6-foot-6 played. The undersized approach didn't work against the Suns.\n\nHouston went small again against Phoenix, though the Rockets did start the recently-acquired 6-foot-8 Robert Covington. The Suns won the rebound battle 51-29 and had a 50-36 advantage on points in the paint.\n\nTIP-INS\n\nRockets: Westbrook didn't play one night after scoring 41 points against the Lakers on 17-of-28 shooting from the field. ... Houston shot just 34% from the field against the Suns, including 11 of 48 (23%) on 3-pointers.\n\nSuns: Phoenix has a long list of injured players, including guard Tyler Johnson (right knee soreness) and forwards Dario Saric (left ankle sprain), Aron Baynes (left hip soreness) and Frank Kaminsky III (right patella stress fracture). ... Rookie forward Cameron Johnson played on Friday after missing 10 games with a right quad contusion. ... Booker scored his 33 points in just 29 minutes.\n\nUP NEXT\n\nThe Rockets return home to host Utah on Sunday.\n\nThe Suns host Denver on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996549.341546
}