{
  "game_id": "0022400714",
  "espn_id": "401705280",
  "date": "Feb 04, 2025",
  "matchup": "CHI vs. MIA",
  "headline": "Josh Giddey, Matas Buzelis score 24 to lead the Bulls over the Heat 133-124",
  "body": "CHICAGO -- — Rookie Matas Buzelis scored a career-best 24 points and Josh Giddey matched it to help the Chicago Bulls top the Miami Heat 133-124 on Tuesday night.\n\n\r\n              Coby White scored 22 points and Ayo Dosunmu added 21 points and nine assists for the Bulls, who played their first game since trading two-time All-Star Zach LaVine to Sacramento late Sunday.\n\n\r\n              Tyler Herro and Bam Adebayo each scored 23 for Miami, which had won three of four.\n\n\r\n              The Bulls trailed 118-114 with five minutes to play but an 11-2 run helped secure the win. \n\n\r\n              Nikola Jovic added 20 points and Kel’el Ware finished with 17 points and 12 rebounds for the Heat, which opened the game on a 12-2 run and led 70-60 at intermission.\n\n\r\n              Bulls center Nikola Vucevic, also the subject of trade speculation, finished with 12 points and 10 rebounds in what could be his final home game at the United Center.\n\n\r\n              Takeaways\r\n              Miami: G Duncan Robinson shook off a right hip contusion and started fast. He began the game-opening run with a pair of 3-pointers.\n\n\r\n              Bulls: Zach Collins, Kevin Huerter and Tre Jones, the trio who came to Chicago in a seven-player trade involving LaVine, were not available Tuesday night and coach Billy Donovan said they won’t play before the trade deadline.\n\n\r\n              Key moment\r\n              White appeared stuck at the top of the key with the shot clock running down, but spun away into an open lane for a dunk with 2:25 left that gave Chicago a 125-120 lead and capped the decisive run.\n\n\r\n              Key stat\r\n              Buzelis is going to see more minutes as the season winds down and he gave hometown fans plenty to enjoy Tuesday. He finished the night 10 for 10 from the floor with several spinning scoops at the basket and four 3-pointers.\n\n\r\n              Up next\r\n              The Heat travel to Philadelphia on Wednesday, the same night the Bulls visit Minnesota.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997057.942388
}