{
  "game_id": "0021701156",
  "espn_id": "400975902",
  "date": "Apr 03, 2018",
  "matchup": "TOR @ CLE",
  "headline": "LeBron scores 27 as Cavs down East-leading Raptors again",
  "body": "CLEVELAND --  Once his layup dropped, LeBron James sent another message.\n\nAs Cleveland's crowd cheered following his artistic shot, James walked within a few feet of Toronto's bench, pounded his chest several times and screamed, \"I'm still a problem!\"\n\nThe Raptors didn't need any reminders.\n\nJames scored 27 points, the last coming on a sensational layup, and the Cavaliers continued to gain momentum with the playoffs quickly approaching by beating Toronto 112-106 on Tuesday night.\n\nJames added nine rebounds and six assists as the Cavs posted their second win in two weeks over the Eastern Conference's top team, whose lead over second-place Boston remains at two games. This time, the Cavaliers were much healthier than when they beat the Raptors on March 21 despite missing five rotational players and coach Tyronn Lue.\n\nJose Calderon added 19 points and Kevin Love 18 points and 15 rebounds for the Cavs, who are 9-1 since March 17 despite not having all their pieces.\n\nJames still isn't sure what the postseason may bring for Cleveland, which has eliminated Toronto in each of the past two postseasons.\n\n\"We don't know what we can become,\" James said. \"We have no idea. But right now we're playing good ball and we want to try to continue that. But we don't know what we can become. We have not been whole all year.\"\n\nDeMar DeRozan scored 19 and Jonas Valanciunas 17 for Toronto, which will host Boston on Wednesday. The Raptors didn't quit and scored eight points in 34 seconds before the Cavs put it away with four free throws. Kyle Lowry scored only 5 on 2-of-11 shooting.\n\nThe Raptors are just 3-5 since winning 11 straight from Feb. 26-March 16.\n\n\"Right now we've got to find our rhythm on both ends of the floor, whether it's offense or defense,\" coach Dwane Casey said. \"That's slip-sided away on us. We've got to get that back. We've got five games to go. We've played some of the best teams in the league, but we've got to find our identity and get back to being who we are. We've got a locker room full of fighters.\n\n\"We've bounced back the entire year. I have total confidence in those guys that they're going to scratch their way out of it as we go into the playoffs.\"\n\nThe Cavaliers still aren't at full strength. Starting point guard George Hill missed his second straight game with a sprained left ankle and Lue was in attendance but only in an advisory role as he remains on medical leave.\n\nCleveland's ball movement was excellent in the second quarter and so was its accuracy.\n\nThe Cavs made their first five 3-pointers -- in less than four minutes -- and opened a 16-point lead. Love dropped three of the 3s with the others by Rodney Hood and Calderon, who made his first six field-goal attempts and scored 14 in the opening half.\n\nTIP-INS\n\nRaptors: Lowry attended Monday night's NCAA title game in San Antonio and the proud Villanova alum wore a championship cap to Tuesday's shootaround.  He refused to blame his performance on his social activities. \"I'm still a professional,\" said Lowry, who is 6 of 24 in his past two games. \"I just missed shots. I got back in time. I didn't miss nothing. I just missed some shots.\" ... Remain one win shy of matching the franchise record of 56 wins set in 2015-16. ...\n\nCavaliers: James passed Kobe Bryant with his 942nd 20-point game, third most in league history. ... Won their seventh straight home game. ... Kyle Korver played for the first time since March 19. He was excused to be with family following the death of his 27-year-old brother.\n\nPERFECT SEASON\n\nJames has never played in every game in a season, coming closest in 2008-09, when he played in 81 before sitting out the finale to rest for the playoffs.\n\nHe's started all 78 this season -- his 15th in the NBA -- but insists 82 for 82 is not a goal.\n\n\"My plan is to play one game at a time and see how I feel after that game,\" he said. \"I didn't come into the season, saying, `OK, we're going to play 82 games this season,' but my plan is to be as healthy as I can, work on my body, train my body every day to be available for my teammates every game.\"\n\nLUE CLOSE\n\nThere's still no definite return date for Lue. But acting coach Larry Drew, who has gone 8-1 while filling in for his boss since March 19, doesn't expect there to be any \"feeling out\" period when Lue comes back.\n\n\"I can see that the guys have already embraced him,\" Drew said. \"So it's just a matter of him being more hands on now once he does get back. From what I've seen, it looks like everybody has rolled their sleeves up and just waiting for the day he comes back so they can get to work.\"\n\nUP NEXT\n\nRaptors: Host Boston on Wednesday.\n\nCavaliers: Host Washington on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764992835.891855
}