{
  "game_id": "0021800056",
  "espn_id": "401070737",
  "date": "Oct 24, 2018",
  "matchup": "CHA @ CHI",
  "headline": "Zach LaVine lifts Bulls past Hornets with 2 late free throws",
  "body": "CHICAGO --  After missing one potential winning shot in the final seconds, Zach LaVine was determined to give himself another opportunity.\n\nHe made good on the second chance.\n\nLaVine made two free throws with 0.5 seconds left to give the Chicago Bulls their first victory of the season, 112-110 over the Charlotte Hornets on Wednesday night.\n\nWith the score tied at 110, LaVine missed a jumper with seven seconds left. Charlotte called time to set up a potential winning play, but LaVine forced a turnover on the inbounds pass, giving Chicago the ball back with five seconds to play.\n\nHe was fouled driving to the basket to set up the winning free throws. He finished with 32 points for his fourth straight 30-point game to start the season.\n\n\"I wasn't going to miss again,\" LaVine said. \"They were going to have to foul me or I was going to get a dunk.\"\n\nCameron Payne scored all of his career-high 21 points in the second half, going 7 for 11 on 3 pointers for Chicago in the opener of the home-and-home set with the Hornets.\n\nKemba Walker had 23 points on 5-for-14 shooting for Charlotte.\n\n\"I thought we missed some open looks, but they did a great job on the defensive end,\" Walker said. \"They play hard. They really deserve that win.\"\n\nThe Bulls had a 54-53 halftime lead mainly thanks to 35 bench points. Jabari Parker had nine, and Cristiano Felicio and Chandler Hutchison had eight apiece. The trio combined to go 10 for 14 from the field. Before Wednesday, Felicio hadn't played this season and Hutchison had a total of three points in two games.\n\n\"We just did not defend well enough in the first half,\" Charlotte coach James Borrego said. \"That was unacceptable defense. Especially when shots aren't falling, you got to be on your defense.\"\n\nChicago stretched the advantage to 85-74 with 2 1/2 minutes left in the third on a 3-pointer by Payne -- his fifth of the quarter.\n\nThe lead was 88-78 with a minute remaining in the third before Charlotte ran off 11 straight points -- capped by Tony Parker's jumper -- to grab an 89-88 edge with 10 1/2 minutes to play in the fourth.\n\nAfter the teams traded baskets and the lead for a few minutes, the Hornets seemingly took control with a 103-98 lead with 5 1/2 left. The Bulls, though, rallied to tie it at 105 on a Payne 3-pointer with 3:34 to play.\n\nThat set the stage for LaVine's stretch drive.\n\n\"I love his attack,\" Bulls coach Fred Hoiberg said. \"I love the way he goes after the rim and gets into the paint.\"\n\nCAN'T MISS\n\nLaVine actually tried to miss the second free throw with 0.5 seconds left, but his awkward line drive bounced off the rim and through. \"That's crazy, right?\" he said. \"I really tried to miss that. It was only point-5 seconds left, so if I would have got it off the rim, the game would have been over.\"\n\nKEEP SHOOTING\n\nPayne, starting in place of injured Kris Dunn, missed both of his shots in the first half before getting hot. \"My mentality was just to keep being aggressive and Zach kept finding me,\" Payne said.\n\nTIP-INS\n\nHornets: Borrego, Michael Kidd-Gilchrist and Walker each were assessed technical fouls in the first half.\n\nBulls: F Bobby Portis injured his right knee early in the fourth quarter and did not return. He is scheduled to have an MRI on Thursday ... Dunn sprained the MCL in his left knee on Monday against Dallas and will be sidelined four to six weeks. Dunn injured the knee in the second quarter, but continued to play, finishing with nine points and seven assists before fouling out.\n\nUP NEXT\n\nHornets: Host Chicago on Friday night.\n\nBulls: At Charlotte on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994442.905797
}