{
  "game_id": "0021401221",
  "espn_id": "400579513",
  "date": "Apr 15, 2015",
  "matchup": "MIL vs. BOS",
  "headline": "Celtics win 6th straight, beat Bucks 105-100",
  "body": "MILWAUKEE -- Kelly Olynyk needed five stitches to close a gash to his face after taking an elbow while going for a rebound.\nStarting for the injured Avery Bradley, Gigi Datome made big buckets in extended time in the fourth quarter.\nThe Boston Celtics showed no quit Wednesday night even with their postseason future set, finishing the regular season with their sixth straight win following a 105-100 victory over the Milwaukee Bucks.\n\nDatome scored 22 points, including two key buckets in the final 3 minutes. Olynyk added 16 for the Celtics, who are locked into the seventh seed in the Eastern Conference and will play No. 2 seed Cleveland when the playoffs begin this weekend.\n\"It's all coming together. It's pretty cool to see,\" Olynyk said. \"We're excited to get this next chapter rolling.\"\nErsan Ilyasova had 21 to lead Milwaukee, which is the sixth seed in the East and will play Chicago in the opening round.\n\"Obviously it's not the way we wanted to finish the season, but it is what it is. They came out with a lot (more) energy than we did to win the game,\" Ilyasova said.\nThe teams turned to reserves mainly in the fourth quarter. The pace bogged down at times in the final 12 minutes with little-used players on both sides getting significant minutes.\nBoston won the matchup of the benches.\nOlynyk, a jump-shooting center, scored 10 of his 16 points in the fourth quarter.\nThe pony-tailed Datome following a 3 with 2:20 left with a layup to give Boston a 105-97 lead with 1:28 remaining.\nDatome, who was averaging 4.2 points coming into Wednesday, was 9 of 15 from the field and 3 of 7 from 3-point range. Bradley sat out with a bruised left quadriceps.\n\"We've talked about it all year. We want to be the type of team that can plug guys in if somebody's missing and play, and play well,\" coach Brad Stevens said. \"For the most part, I thought we played pretty well.\"\nMilwaukee had its three-game winning streak snapped. Still, fans were happy inside the Bradley Center after the game with the Bucks finishing the season with a .500 record at 41-41. It's a dramatic improvement from last season's disastrous 67-loss campaign.\n\"I think it's a great start for our foundation, for this young group. Understanding what it takes to win,\" Bucks coach Jason Kidd said. \"Only 16 teams make the playoffs now and we're one of them.\"\nMilwaukee's Khris Middleton was 6 of 7 in the first half for 13 points, but the Celtics took a 49-45 lead after hitting 7 of 14 from the 3-point range by halftime.\nMiddleton finished with 18 points.\nLOOKING AHEAD\nBucks co-owners Marc Lasry and Jamie Dinan handed out T-shirts to fans at the entrances as thank-you gifts. The team's previous owner, former U.S. Sen. Herb Kohl, was also in attendance as the Bucks finished with their best record since winning 46 games in 2009-10.\nThe new bosses were in a good mood talking about the potential matchup with Chicago, a long-time Central Division rival just 90 miles south of Milwaukee.\n\"I would say it's going to be a very long, long, lonely drive home back to Chicago after the games here,\" Dinian said. \"That's my advice, OK? Stay home because it's going to be very lonely and sad on that long ride home.\"\nBIG 4-0\nThe Celtics finished the regular season 40-42, a 15-win improvement from the previous year.\n\"That was our goal,\" said center Jared Sullinger, who finished with 11 points. \"To you, it might be overachieving. To us, it's just another day in the ballpark.\"\nTIP INS\nCeltics: Bradley did not travel with the team to receive treatment in Boston. He got hurt Tuesday night in a 95-93 win over Toronto. Stevens indicated that Bradley should be ready for the playoffs. ... Guard Isaiah Thomas also sat out for rest.\nBucks: Reserve forward Jared Dudley sat out a second straight game to rest his sore back. He's expected to be ready for the playoffs.\nUP NEXT\nCeltics: At East No. 2 seed Cleveland.\nBucks: At East No. 3 seed Chicago.\n---\nFollow Genaro Armas at http://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764991740.768308
}