{
  "game_id": "0021800314",
  "espn_id": "401070995",
  "date": "Nov 28, 2018",
  "matchup": "POR vs. ORL",
  "headline": "Lillard has Portland-record 10 3s in 115-112 win over Magic",
  "body": "PORTLAND, Ore. --  Damian Lillard didn't realize he was at 10 3-pointers. Had he known, well, maybe he would have gone for the record.\n\n\"I honestly didn't know I had made 10. If I would have known that I would have went for it,\" Lillard said, adding with a smile, \"What is it? Fourteen? Oh, I could have got that, too.\"\n\nLillard set a franchise record for 3s on his way to 41 points, and the Portland Trail Blazers held off the Orlando Magic 115-112 on Wednesday night.\n\nJusuf Nurkic added 16 points and 13 rebounds as the Blazers stopped a season-high three-game slide. Lillard surpassed the previous Portland record of nine 3s that he shared with Nicolas Batum.\n\n\"It felt good. I've been struggling kind of shooting from 3,\" Lillard said. \"I shoot a lot of them. After practice, sometimes, before practice, I've been shooting and shooting them. I knew eventually I would get hot and start making them. It just felt good.\"\n\nHe'll just have to wait for another chance at the NBA record of 14 set by Golden State's Klay Thompson in a game earlier this season.\n\nNikola Vucevic had 20 points and eight rebounds for the Magic, who have lost four of their last five games.\n\nPortland pushed its lead to 108-98 on Evan Turner's layup with just over five minutes to go, but Evan Fournier hit a pair of 3-pointers and Jonathan Isaac added a layup to close the gap to 108-106.\n\nJonathan Simmons made two free throws to tie it, but CJ McCollum responded with a 3-pointer for the Blazers.\n\nFournier had a step-back jumper to get Orlando within a point before McCollum missed a pair of free throws with about two minutes to go. Lillard's floater with 55 seconds gave Portland a 113-110 lead.\n\nThere was some confusion at the end of the game after what was described as a game-clock malfunction prompted a video review. Officials put 0.9 seconds on the clock but Orlando's inbounds was off and time ran out.\n\n\"We've got to get better. C'mon. You play that offensive game against that team, in this arena, you gotta win that game,\" Magic coach Steve Clifford said.\n\nOrlando, playing the fourth of a six-game trip, was without Aaron Gordon, who was sidelined by a sore lower back. Gordon is averaging 16.1 points and 7.3 rebounds this season. He left Monday's 116-110 loss at Golden State in the third quarter with back spasms.\n\nIsaac replaced Gordon in the starting lineup.\n\nVucevic scored 15 in the first half to help Orlando to a 63-55 lead at the break. Nik Stauskas had 15 early points for the Blazers.\n\nTrailing 82-79, Portland went on a 16-2 run, capped by Lillard's record-breaking 10th 3-pointer, to go up 95-84 going into the fourth quarter.\n\n\"We have to play with more physicality, especially on the rebounding. We did a good job getting stops, we just didn't get the rebound,\" Vucevic said. \"We have to change that and play with a lot more intensity.\"\n\nPortland coach Terry Stotts said the Blazers were better in the second half.\n\n\"The first half was very disappointing with our defensive focus, aggressiveness, everything. I didn't think we had much of an impact on the game at all in the first half defensively,\" He said. \"But I liked, especially the third quarter, that defensively we were much better and obviously Damian in the third quarter was incredible. He carried us like he does often.\"\n\nPortland was coming off a 104-100 loss at home to the Clippers on Sunday night.\n\nABOUT THOSE 3S\n\nPortland finished with a season-high 19 3-pointers. Lillard's seven 3-pointers in the third were a franchise record for a quarter.\n\nTIP-INS\n\nMagic: Ross is from Portland and played at Jefferson High School before going to Washington. ... The Magic have dropped five straight to Portland. ... Vucevic fouled out with 13.7 seconds left.\n\nTrail Blazers: It was Stotts' 400th career win. He is the 47th coach in NBA history to reach the milestone. ... It was Lillard's fourth game this season with 40 or more points.\n\nUP NEXT\n\nMagic: Play Friday night at the Phoenix Suns.\n\nTrail Blazers: Host the Denver Nuggets on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995193.212418
}