{
  "game_id": "0021500873",
  "espn_id": "400828760",
  "date": "Feb 27, 2016",
  "matchup": "MIL vs. DET",
  "headline": "3-point shooting helps lift Pistons to 102-91 win over Bucks",
  "body": "MILWAUKEE -- The Detroit Pistons played near-perfect offensive basketball for 24 minutes on Saturday night.\nAndre Drummond dominated the paint, and teammates drove into the lane before kicking the ball out to the 3-point line to open shooters.\nThe Pistons built on a strong start from the perimeter in the first half against the Milwaukee Bucks, and Drummond posted his NBA-leading 50th double-double with 15 points and 17 rebounds in a 102-91 victory.\nDetroit coach Stan Van Gundy chalked up the robust play to crisp, clean ball movement. The Pistons had just one turnover in the first half and pounced on Milwaukee mistakes all night long.\nDetroit opened 6 of 7 from behind the arc in the first quarter and 11 of 19 in the half, and outscored the Bucks 23-6 in points off turnovers for the night.\n\"But early on, I thought our guys did a very good job of seeing open men, finding open men and getting the ball to them,\" Van Gundy said. \"Those 3s were basically wide-open, rhythm 3s and those are good.\"\nPoint guard Reggie Jackson set the tone with 22 points and eight assists for Detroit, which won its third straight game and had all five starters score in double figures.\n\"They've played much more unselfishly and I think Reggie has gotten it started by being a much more willing passer, particularly early in games,\" Van Gundy said.\nKhris Middleton led the Bucks with 26 points. Defensively, Milwaukee gave outside shooters less room in the second half.\nBut the Bucks could never get closer than five after spotting the Pistons a 16-point lead in the second quarter.\n\"Our energy and effort in that first half wasn't up to par,\" Milwaukee coach Jason Kidd said. \"They had a lot of warmup 3s and they made them.\"\nMiscues kept hurting the Bucks, who committed 21 turnovers a game after amassing 15 against Boston. That wasn't the way Kidd wanted his team to start a stretch of five straight home games.\nFROM THE ARC\nThe 11 3-pointers in the first half matched the number of 3s Detroit hit in its previous game, a win Wednesday against Philadelphia. Tobias Harris and Kentavious Caldwell-Pope each made two in the first quarter.\nBucks defenders often got tangled up on Detroit drives into the lane, leaving shooters with long, clean looks in the corners. Other times, shooters were left wide open on the wing with defenders slow to rotate.\n\"They were just breaking down our defense, and the offensive rebounds -- that was the main thing,\" Middleton said.\nON BOARDS\nThe Bucks were playing well offensively, too, in the first half, hitting 54 percent from the field. But they couldn't keep up with Detroit from behind the arc or on the offensive glass, where the Pistons had a 17-12 edge for the game. Drummond finished with 10 offensive boards.\nDISHING IT\nDetroit had 11 assists on 14 baskets in the first quarter, when Jackson had five assists. The Pistons have improved since trading for Harris from Orlando five games ago.\n\"Guys are getting more comfortable with their roles. We've been trying to attack downhill and just take what the defense gives us,\" Jackson said.\nTIP-INS\nPistons: Detroit started a stretch with seven of nine games on the road. ... Drummond nearly had a double-double in the first quarter with 10 points and nine boards. ... Detroit finished 12 of 30 from 3-point territory.\nBucks: G Steve Novak had to be helped off the floor with 2-plus minutes left after Jackson appeared to bump into Novak's left leg. Kidd said Novak had a sprained left knee after the veteran needed help to get back to the locker room. Novak was scheduled to have more tests on Sunday. ... The Bucks hope to get guard Jerryd Bayless (left knee) back during the homestand. One of the team's best shooters from 3-point range, Bayless missed his fifth straight game.\nUP NEXT\nThe Pistons host Toronto on Sunday.\nThe Bucks host Houston on Monday.\n---\nFollow Genaro Armas at http://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764994027.775189
}