{
  "game_id": "0022100330",
  "espn_id": "401360154",
  "date": "Dec 02, 2021",
  "matchup": "MEM vs. OKC",
  "headline": "Grizzlies throttle Thunder by NBA-record 73-point margin",
  "body": "MEMPHIS, Tenn. -- — The game was long decided and the Memphis starters were relegated to cheerleaders on the bench when John Konchar got a steal and headed to the basket.\n\n\r\n                    His right-handed dunk gave the Grizzlies a 145-67 lead over the Oklahoma City Thunder with 3:02 left and a new franchise record for points in a game.\n\n\r\n                    That 78-point advantage was Memphis' biggest lead on Thursday night, but by the time it was over the Grizzlies were still 73 points ahead. Their 152-79 win over the Thunder shattered the NBA record for the largest margin of victory.\n\n\r\n                    “At that moment, I didn’t know it was a franchise record,” Konchar said. “I just kind of saw the lane, and I dunked it. But it’s awesome.”\n\n\r\n                    The 73-point margin easily topped the previous mark, which was Cleveland’s 68-point win over Miami. The Cavaliers topped the Heat 148-80 on Dec. 17, 1991.\n\n\r\n                    “Tonight is not necessarily who we are,” Thunder coach Mark Daigneault said. “I think we’ve definitely shown that from a competitive standpoint. This isn’t indicative of who our team is.”\n\n\r\n                    Memphis used 12 players and nine of them reached double figures in scoring, with Jaren Jackson Jr.’s 27 points leading the way for the Grizzlies. Memphis was without its best player, injured guard Ja Morant.\n\n\r\n                    It was 72-36 at halftime and the Grizzlies just kept adding to the lead.\n\n\r\n                    “I think there was some slippage defensively and I think before you know it, teams are in a rhythm and the game is out of hand,” Oklahoma City's Mike Muscala said. “We didn’t fight, obviously. You’d rather go out fighting. You would rather go out putting your best foot forward and playing together.”\n\n\r\n                    The Thunder flirted with being on the wrong end of the record last season, trailing Indiana by 67 points on May 1 before rallying — such as it was — to lose by merely 57 points, 152-95.\n\n\r\n                    This was worse. Historically worse.\n\n\r\n                    The Grizzlies set a franchise record for shooting, making 62.5% of their shots. De’Anthony Melton scored 19 points, Santi Aldama scored 18 and John Konchar scored 17 for the Grizzlies, and none of those three players even started.\n\n\r\n                    “Man, it feels great. It feels great to be in the history books, especially in front of our home crowd,” Melton said. “And we did it one through 15. Everybody contributed, everybody played hard and we all got to get in the game. So, it’s always a blessing.\n\n\r\n                    “We knew with (Morant) going down what we had to do,” Melton said. “We had to step up.”\n\n\r\n                    No Memphis starter played more than 21 minutes. Lu Dort led the Thunder with 15 points, and Oklahoma City shot only 33%.\n\n\r\n                    It was 12-8 after five minutes. From there, there was no stopping Memphis. The Grizzlies outscored the Thunder by 15 points in each of the four quarters.\n\n\r\n                    “Franchise records are obviously great. Obviously proud of our guys that they don’t think about that,” Memphis coach Taylor Jenkins said. “We’re just motivated by what are our standards every single night. Tonight was on pretty full display both offensively and defensively.”\n\n\r\n                    It was the third straight game the Grizzlies have led from start to finish.\n\n\r\n                    “Obviously, it was a combination of things,” Daigneault said. “They played with great force and pace. They made some shots. We didn’t shoot it well early and just really couldn’t get a grip on the game. Any part of the game.”\n\n\r\n                    The Thunder lost their eighth straight as they continued to play without a number of players, including leading scorer Shai Gilgeous-Alexander, who entered concussion protocol earlier Thursday. Gilgeous-Alexander scored 39 points against the Rockets on Wednesday night but suffered a blow to the head late in the game.\n\n\r\n                    Point guard Josh Giddey, who averages 10.4 points and 5.5 assists, sat out with a non-COVID-19 illness, and the remaining players couldn't fill the void in Oklahoma City's offense.\n\n\r\n                    The Thunder had been competitive in their seven straight losses before Thursday night. Their largest margin of defeat was 13 points.\n\n\r\n                    “When you compete, you have exposure to the highs and lows of competition,” Daigneault said. “And competition comes with great joy, and it also comes with grief and frustration and anger. And when you step in that ring, that’s what you expose yourself to is all of those things. It’s why the joy feels so good, because when you get punched and you taste your own blood, it doesn’t feel right.”\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: Ty Jerome got his first start of the season in place of Gilgeous-Alexander and finished with 12 points. ... Darius Bazley is the only Oklahoma City player to start all 22 games. ... Oklahoma City’s 36 points in the first half was its season low for a half.\n\n\r\n                    Grizzlies: Were without reserves Kyle Anderson (back soreness) and Ziaire Williams (left knee soreness). ... Memphis is 3-0 since Morant sprained his right knee against Atlanta last Friday. ... The 36 points by the Thunder were a season low by an opponent in a half. ... Memphis’ previous largest margin of victory was 49 points in a 133-84 win over Houston on Feb. 28, 2021. ... The 152 points were the most by Memphis in a game. Its previous mark was 144 against Golden State on Jan. 3, 2007.\n\n\r\n                    UP NEXT\n\n\r\n                    Thunder: At Detroit on Monday.\n\n\r\n                    Grizzlies: At Dallas on Saturday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764992822.047143
}