{
  "game_id": "0022000158",
  "espn_id": "401267318",
  "date": "Jan 12, 2021",
  "matchup": "BKN vs. DEN",
  "headline": "Durant scores 34, Nets charge back from 18 down, top Nuggets",
  "body": "NEW YORK -- — Kevin Durant had 34 points, 13 assists and nine rebounds, Bruce Brown made a huge contribution while starting for the absent Kyrie Irving, and the Brooklyn Nets rallied from 18 down to beat the Denver Nuggets 122-116 on Tuesday night.\n\n\r\n                    Brown scored a season-high 16 points, including the tying and go-ahead baskets down the stretch. Durant followed with Brooklyn's next six points, including a 3-pointer that essentially put it away at 120-113 with 27 seconds to play.\n\n\r\n                    “Guys have pride. They want to come out and compete, and everybody came with it tonight, especially in the second half,” Durant said. \n\n\r\n                    Nikola Jokic had 23 points, 11 assists and eight rebounds for the Nuggets, who were trying to sweep a three-game road trip. But they were outscored 68-46 in the second half and squandered their chance to climb above .500 for the first time this season.\n\n\r\n                    Denver coach Michael Malone said his short-handed team might have been a little tired at the end of a tough stretch.\n\n\r\n                    “But we have to find a way to fight through that and hopefully we can realize once again that playing three quarters is not going to get it done in this business,” Malone said. “You have to find a way to play as close to 48 (minutes) as possible and when we do that, I think we have a chance to be a pretty good team.” \n\n\r\n                    Caris LeVert added 20 points for the Nets, who had dropped two in a row during Irving's four-game absence for personal reasons and seemed well on their way to a third when they trailed 79-61 early in the third quarter. But they got hot from 3-point range and Durant from just about everywhere. \n\n\r\n                    “All we need to do is bring energy, play hard and play defense, and we did that tonight,” Brown said.\n\n\r\n                    They blew past the Nuggets with a 29-4 run that gave them a 90-83 lead, and when Jokic checked out after the next possession he kicked over a chair in the last row of Denver’s bench in frustration. \n\n\r\n                    Will Barton scored 22 points for the Nuggets, making six 3-pointers. Jamal Murray scored 20.\n\n\r\n                    Jokic scored 13 points in the first quarter and Denver already led by double digits barely a minute into the second. The lead was eight with about four minutes left before Murray finally got going with three baskets, including a 3-pointer that made it 70-54 at the break.\n\n\r\n                    TIP-INS\n\n\r\n                    Nuggets: Denver gave 7-foot-2 Bol Bol his first career start, with Gary Harris out for personal reasons. Bol Bol finished with five points in 16 minutes. ... Monte Morris scored 14 points.\n\n\r\n                    Nets: Before the game, coach Steve Nash wasn't sure if Durant would play Wednesday at New York. Durant, who missed last season recovering from surgery to repair a ruptured Achilles tendon, sat out the second half of the Nets' first back-to-back of the season. “I really hope Kevin plays tomorrow, but we’ll see,” Nash said. “We have to judge these things day to day and moment to moment.” Durant said afterward he planned to play. ... DeAndre Jordan, the starting center to begin the season, didn't play.\n\n\r\n                    IRVING UPDATE\n\n\r\n                    The Nets and the NBA are looking into Irving’s actions after a video showed the point guard at an indoor family gathering not wearing a mask. General manager Sean Marks said a date for Irving's return hadn't been determined, and the All-Star could face a fine if the NBA determines he violated the health and safety rules in place during the coronavirus pandemic.\n\n\r\n                    UP NEXT\n\n\r\n                    Nuggets: Return home to face Golden State on Thursday.\n\n\r\n                    Nets: Visit the New York Knicks on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997519.9596758
}