{
  "game_id": "0021900943",
  "espn_id": "401161585",
  "date": "Mar 07, 2020",
  "matchup": "MEM vs. ATL",
  "headline": "Valanciunas, Morant lead Grizzlies past Hawks, 118-101",
  "body": "MEMPHIS, Tenn. --  Jonas Valanciunas had 27 points and 17 rebounds, rookie Ja Morant added 24 points and the Memphis Grizzlies beat the Atlanta Hawks 118-101 on Saturday night to keep their hold on the final Western Conference playoff spot.\n\nJosh Jackson had 17 points, Dillon Brooks and De'Anthony Melton added 13 each and Memphis won for the fourth time in five games. Valanciunas was 10 of 13 from the field and had three blocks.\n\nMemphis' win left them solidly in eighth place in the West. Asked if they were watching the standing, Valanciunas replied: \"Yeah. It's that time of year, right? We're watching the standings. You want to climb higher and higher, so wins (are) really important.\"\n\nJohn Collins led the Hawks with 27 points, converting 9 of 16 shots, including 3 of 5 from 3-point range. Trae Young, who averages 29.6 a game, was held to 16 points, making only 4 of 16 on the night, including missing all but one of his 10 3-point attempts. Young, who missed Friday's loss against Washington with flu-like symptoms, said there were still some lingering effects.\n\n\"I definitely tried to fight back,\" said Young, adding that the training staff ran tests on him Saturday to make sure he could play. \"I know everybody was kind of banged up with the back-to-back, so I wanted to come back and play.\"\n\nMemphis dominated the game, leading by 26 points at one point and held the Hawks to 33.7% shooting.\n\nAtlanta's shooting woes were evident early, making only three of its first 18 shots and shooting 23.8% in the first quarter as Memphis took the lead to as many as 20.\n\n\"We were out there getting stops and trying to get out and run,\" said Morant, who made all four of his 3-point attempts, \"and get good shots out of it.\"\n\nYoung did not get his first field goal until a goaltending call with 8:22 left in the half as the Grizzlies continually switched defenders on the second-year guard.\n\n\"To be honest with you, we just missed some wide-open shots. Shots just weren't going in that we usually hit,\" Young said.\n\nMemphis stretched the lead to 26 before halftime and the Grizzlies carried a 66-45 lead into the break.\n\nThe Hawks never got closer than 16 in the second half, dropping their third straight and fifth in their last seven.\n\nTIP-INS\n\nHawks: Cam Reddish, who was probable before the game with lower back pain, played, but left in the first half suffering lower limb cramping and did not return. . The Hawks 29.8% shooting in the first half was a season-low for a first half. The previous first-half low was 32.6% against the Clippers on Jan. 22. . Kevin Huerter has knocked down multiple 3-pointers in six straight games. . Collins has a 3-pointer in eight straight.\n\nGrizzlies: Valanciunas missed a tip-in at the buzzer before halftime, his only miss in the first half. He had made 14 straight shots and the missed tip prevented him from tying the franchise record of 15 straight by Marc Gasol. .Valanciunas recorded his 32nd double-double in the first half. . Kyle Anderson was 5 of 7 from the field, including 2 of 3 from 3-point range finishing with 12 points.\n\nTHOUGHTS ON VINCE\n\nVeteran Vince Carter, who played three years with the Grizzlies, was given a standing ovation in his last visit to Memphis.\n\n\"The ultimate respect for an ultimate pro,\" Memphis coach Taylor Jenkins said. \".You hear so many guys talking about they want to leave the NBA in a better place than when they came in. This guy's a prime example of it.\"\n\nTHOSE WERE THE DAYS\n\nHawks coach Lloyd Pierce was an assistant coach for the Grizzlies during the heyday of Grit and Grind when Memphis made it to the NBA Western Conference Finals and still remembers his time fondly.\n\n\"I still remember `Whoop that Trick' all the time,\" Pierce said. \"I remember being behind the bench, in a timeout and everything is shaking. Your body's shaking as you're sitting there. And you look up .and everybody's got a towel. That was just a great feel. I think the city really adopted the Grit and Grind and we don't bluff.\"\n\nUP NEXT\n\nHawks: Host Charlotte on Monday night.\n\nGrizzlies: Host Orlando on Tuesday night\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995681.4180748
}