{
  "game_id": "0021600321",
  "espn_id": "400899763",
  "date": "Dec 07, 2016",
  "matchup": "CHA vs. DET",
  "headline": "Walker's big 4th quarter lifts Hornets past Pistons 87-77",
  "body": "CHARLOTTE, N.C. --  On a rough shooting night for just about everyone, Kemba Walker got hot just long enough for the Charlotte Hornets.\n\nWalker scored 14 of his 25 points in the fourth quarter, Nic Batum posted his third straight double-double and the Hornets beat the Detroit Pistons 87-77 on Wednesday despite shooting just 34 percent from the field.\n\n\"The shots just weren't falling (for) both teams,\" Walker said. \"Both teams played hard. Defensively I thought both teams were great, but down the stretch we were able to make some big plays and get a huge burst in the fourth quarter.\"\n\nBatum had 14 points and 14 rebounds for the Hornets, who won for the third time in four games despite being held to 38 points in the first half on 27 percent shooting.\n\nCharlotte also got three key baskets in the fourth from reserve Marco Belinelli, who finished with 13 points.\n\n\"Marco was instrumental in getting our offense going in the third with a couple of catch-and-shoot buckets,\" coach Steve Clifford said.\n\nAndre Drummond had a season-high 26 points and 20 rebounds for the Pistons (12-12), who were coming off a 102-91 victory over the Bulls on Tuesday night. It was his 11th 20-20 game since 2012-13, tops in the NBA during that stretch.\n\nDetroit shot 38 percent from the field. It also went 5 for 8 from the free-throw line, compared to 21 for 29 for Charlotte.\n\n\"You can't have a 20 free throw differential and expect to win no matter how hard you're fighting,\" Pistons coach Stan Van Gundy said.\n\nMarvin Williams returned to Charlotte's starting lineup after missing the last six games with a hyperextended knee and finished with 12 points and five rebounds. He also provided a needed physicality on defense.\n\nWilliams said afterward he felt great.\n\n\"I was a little worried about my conditioning,\" Williams said. \"Sometimes, with lower-body injuries, you can't stay in shape like you want to. I just wanted to come out and be aggressive, not offensively but defensively.\"\n\nThe Hornets (13-9) pulled away when Walker began to heat up in the fourth quarter, finding lanes to drive to the basket and rediscovering the touch on his jumper that had eluded him for most of the night. Walker was 5 of 9 from the field in the fourth after going 4 of 13 in the first three quarters.\n\nThe Hornets trailed 39-38 at halftime. It was only the fourth time this NBA season both teams scored fewer than 40 in the first half.\n\nTIP-INS\n\nPistons: Made just 4 of 27 3-point shots. ... Had 13 turnovers.\n\nHornets: Walker has scored in double digits in all 22 games this season. ... Walker has multiple steals in 11 games this season.\n\nDRUMMOND's BIG NIGHT\n\nDrummond went 11 for 14 from the field and 4 for 7 from the line. He was looking for a measure of revenge against the Hornets after being ejected in the second quarter against Charlotte last week for a flagrant-2 foul when officials ruled he deliberately elbowed Roy Hibbert in the head.\n\nJACKSON'S LEGS\n\nPistons guard Reggie Jackson couldn't quite get to the basket on the second night of a back-to-back and settled for more jump shots than normal. He has been battling back from tendinitis in his left knee.\n\n\"I find myself not being as fresh as I normally feel,\" Jackson said. \"I'm sure I will get back to who I am and doing the things that I do.\"\n\nUP NEXT\n\nPistons: Travel to Minnesota on Friday night to play the Timberwolves, who are just 3-7 at home.\n\nHornets: Are back at home Friday night when they host the Orlando Magic.",
  "source": "espn_api",
  "crawled_at": 1764995528.7929778
}