{
  "game_id": "401810161",
  "espn_id": "401810161",
  "date": "Nov 30, 2025",
  "matchup": "MIN vs SA",
  "headline": "Edwards sets Wolves franchise mark in 125-112 home win against Spurs",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 32 points to became Minnesota's all-time leader in games with 30 or more points, Julius Randle added 22 points, 12 assists and six rebounds, and the Timberwolves pulled away from the San Antonio Spurs in the fourth quarter of a 125-112 victory Sunday night.\n\n\r\n              Donte DiVincenzo scored 18 points and Naz Reid added 15 for Minnesota, which went 2-0 at home on the weekend after losing three straight on the road. The Spurs fell to 5-2 without Victor Wembanyama, who missed another game with a left calf strain.\n\n\r\n              The Wolves outscored San Antonio 36-19 in the fourth quarter of the teams’ first matchup this season. On two separate occasions in the first four minutes of the final period, DiVincenzo and Reid made back-to-back 3s to help the Wolves seize momentum.\n\n\r\n              De'Aaron Fox led the Spurs with 25 points on 10-of-15 shooting. After being acquired in a seven-player, seven-pick trade involving San Antonio, Sacramento and Chicago in February, Fox entered Sunday second on the team in scoring behind Wembanyama with 24 points per game.\n\n\r\n              Devin Vassell and Keldon Johnson added 22 points apiece for the Spurs, who went 2-2 on their four-game road trip.\n\n\r\n              San Antonio led 93-89 entering the fourth quarter and 62-61 at halftime after going up by 10 earlier in the second. Fox led all first-half scorers with 19 points on 8-of-11 shooting.\n\n\r\n              Edwards went 7-for-9 for 16 first-half points but also committed six turnovers, including five in the first quarter, and was charged with his third technical foul in the past four games.\n\n\r\n              But the Wolves star eventually settled in to finish 13 for 18 and 4 for 6 on 3-pointers for 32 points and his 102nd career 30-point outing, breaking the franchise record previously held by Karl-Anthony Towns.\n\n\r\n              Up next\r\n              Spurs: Host Memphis on Tuesday.\n\n\r\n              Wolves: At New Orleans on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042725.280865
}