{
  "game_id": "0022400267",
  "espn_id": "401704833",
  "date": "Nov 23, 2024",
  "matchup": "HOU vs. POR",
  "headline": "Simons scores 25, Sharpe adds 24 as Trail Blazers bounce back with 104-98 win over Rockets",
  "body": "HOUSTON -- — Anfernee Simons scored 25 points and Shaedon Sharpe added 24 as the Portland Trail Blazers bounced back from a tough loss with a 104-98 win over the Houston Rockets on Saturday night.\n\n\r\n              The victory came after Portland was blown out 116-88 by the Rockets in an NBA Cup game Friday night.\n\n\r\n              The Trail Blazers led by three late before Alperen Sengun cut the lead to 99-98 on a shot in the paint with 21 seconds left.\n\n\r\n              Portland got two free throws apiece from Deni Avdija and Sharpe to make it 103-98 with 4.3 seconds remaining. Simons added another free throw after a technical foul on Fred Van Vleet to secure the win.\n\n\r\n              Houston’s Dillon Brooks and Sharpe had to be separated after they got tangled up fighting for a rebound with about two minutes left. Brooks had to be pulled away from Simons after Brooks took issue with Simons pushing him away from the fray.\n\n\r\n              Sharpe was called for a loose ball foul on the play and Simons and Brooks both received technical fouls.\n\n\r\n              Sengun had 22 points and Amen Thompson added 19 points off the bench for the Rockets.\n\n\r\n              Takeaways\r\n              Trail Blazers: They showed grit in putting Friday’s loss behind them and moving quickly to snap a two-game skid. \n\n\r\n              Rockets: Houston needs to play more consistently after a poor offensive showing Saturday night a game after Friday’s big offensive outing when the team made 15 3-pointers.\n\n\r\n              Key moment\r\n              Simons scored five quick points to make it 99-96 with less than 30 seconds to go, putting the Trail Blazers on top for good. He made a layup before hitting a 3-pointer after a block by Avdija. \n\n\r\n              Key stat\r\n              The Blazers made 18 of 44 3-pointers and Houston managed just 8 of 32 attempts with Jalen Green going 1 for 9.\n\n\r\n              Up next\r\n              The Trail Blazers visit Memphis on Monday night and the Rockets visit Minnesota on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997404.898408
}