{
  "game_id": "0021400021",
  "espn_id": "400578313",
  "date": "Oct 31, 2014",
  "matchup": "MEM @ IND",
  "headline": "Randolph leads Grizzlies over Pacers 97-89",
  "body": "INDIANAPOLIS -- Zach Randolph gave over four dozen tickets to family and friends from his hometown in Indiana.\nHe didn't disappoint with a big third quarter.\nRandolph scored 11 of his 22 points in the third and added 13 rebounds to lead the Memphis Grizzlies to a 97-89 victory over the Indiana Pacers on Friday night.\n\"We actually got off to a good start and they made a run, but we just kept fighting,\" he said. \"We just kept playing. We started playing defense and we started getting stops.\"\nMarc Gasol had 20 points and six rebounds and Mike Conley added 17 points for the Grizzlies, who are 2-0 for just the third time in franchise history. They have a shot to open the season with three straight wins for the first time.\nThe third quarter was the difference.\nThe Grizzlies trailed by as much as 13 points in the third quarter, but Conley and Randolph combined for 13 points in a 26-2 run to take a 74-63 lead with 2:23 remaining in the third.\nChris Copeland came off the bench with 16 points and six rebounds and C.J. Miles finished with 13 for the short-handed Pacers.\n\"They, as a veteran team, a playoff team, they stepped up their pressure,\" Miles said. \"That's what good teams do. Play like that comes with experience. We're a team that needs to figure that out.\"\nCourtney Lee, who finished with 12 points, was diagnosed with a mild concussion after he left the game at the 2:03 mark in the second quarter. He fell to the ground after a missed lay-up and suffered a blow to the back of the head after hitting Roy Hibbert's knee.\nHe lay on the floor with his hands on his head for several minutes before he was helped to the locker room.\nThe Pacers look its first lead early in the second quarter and led at the break 53-45.\nThe Grizzlies shot just 9 of 20 in the second quarter and Indiana took advantage with a 13-2 run. But Memphis' big third quarter was too much for the Pacers to overcome.\n\"We played with a lot more aggressiveness in the second half,\" Memphis coach David Joerger said. \"They weren't able to get up as many shots and get up by as many points in the second half.\"\nTIP-INS\nGrizzlies: Had just nine turnovers and converted Indiana's 18 turnovers into 14 points. . Despite poor shooting in the second quarter, Memphis still shot 44.3 percent. . The Grizzlies brought three players for an Indiana homecoming. Conley and Lee are from Indianapolis, and Randolph grew up nearly 70 miles away in Marion, Indiana.\nPacers: Hibbert was taken out of the mix early when he picked up his second foul at the 7:19 mark of the first quarter and didn't return until midway through the second quarter. . Beno Udrih was 3 of 3 from 3-point range and Rodney Stuckey added six points in the second quarter, including a turnaround jumper to give Indiana its first lead. . Hibbert blocked a hook-shot by Randolph early in the third quarter and Luis Scola scored to put the Pacers ahead 57-46 before the Grizzlies went on run and pulled away.\nDOWN LOW\nVogel acknowledged before the game the significance of defending the post, but the Grizzlies scored 14 points in the paint to pull away in the third quarter. At the same time, Memphis scored nine fast break points, and forced the Pacers to six turnovers and didn't commit any.\nUP NEXT\nMemphis visits Charlotte on Saturday.\nThe Pacers travel to Atlanta on Saturday and will play three of the next four games on the road.",
  "source": "espn_api",
  "crawled_at": 1764992201.8959959
}