{
  "game_id": "0022300502",
  "espn_id": "401585130",
  "date": "Jan 07, 2024",
  "matchup": "DEN vs. DET",
  "headline": "Murray scores 37, Jokic has 16 assists as Nuggets cruise to 131-114 win over Pistons",
  "body": "DENVER -- — Jamal Murray was hitting jumpers. Nikola Jokic was finding open teammates. \n\n\r\n              Simple as that, the Denver Nuggets were rolling.\n\n\r\n              Murray scored a season-high 37 points, Jokic had 16 assists and the Nuggets handed the Pistons their 18th straight road loss by cruising past Detroit 131-114 on Sunday night.\n\n\r\n              Murray followed an off-shooting game against Orlando on Friday with a bounce-back one, hitting 14 of 24 shots from the floor. He also was 6 of 7 from the free throw line.\n\n\r\n              “His energy and his will to win really is infectious,\" Nuggets coach Michael Malone said. \"When he sees that ball go in, he’s really unguardable.” \n\n\r\n              Jokic was more distributor and shot blocker than scorer, taking just three shots and finishing with four points. The two-time NBA MVP tied a career high with five blocked shots in between setting teammates up for easy buckets around the rim. He had a chance at his career high of 18 assists, but didn't play in the fourth quarter with the game in hand. \n\n\r\n              “Unusual stat line,” Murray cracked about his pick-and-roll teammate.\n\n\r\n              The Pistons fell to 1-19 away from home, with their lone road win on Oct. 27 at Charlotte.\n\n\r\n              Jalen Duren led Detroit with 20 points, while Alec Burks added 18. Cade Cunningham had three points before leaving midway through the second quarter with a strained left knee. \n\n\r\n              “We lost. We lost by a lot. So, I’d be lying if I said I was happy about anything that happened in the game,” Duren said when asked about helping hold Jokic to just four points. \"He still affected the game and did a lot for his team.”\n\n\r\n              Denver won the last matchup with Detroit 107-103 on Nov. 20 in a game where both Jokic and Malone were ejected for arguing. Jokic picked up another technical Sunday for what was deemed a flop. He exaggerated the contact when he took a push out on the wing in the third quarter. \n\n\r\n              Soon after, Peyton Watson took a shove from Ausar Thompson while running down the floor and fell to the floor. Watson got up angry, but was restrained by Kentavious Caldwell-Pope. Officials called Thompson for a flagrant foul.\n\n\r\n              \"The energy I needed. I fed off of it,\" said Watson, who had 13 of his 15 points in the third quarter. “It definitely knocked some energy into me. I'm glad I was able to go upward from there.”\n\n\r\n              It was a productive third quarter all around for Denver as the team outscored the Pistons by a 43-28 margin to take control of the game. That was a departure from the last two games in which Denver struggled coming out of intermission. Murray did his part, too, reminding his teammates in the hallway of the importance of ramping up the defense in the second half.\n\n\r\n              His words were as effective as his jumper.\n\n\r\n              “We just wanted to hold ourselves accountable,\" Murray explained. “I thought we did a good job coming ready to play knowing this team, they’re trying to win.” \n\n\r\n              Michael Porter Jr. and Caldwell-Pope each had 18 points for a Nuggets team that moved to 18-0 this season against teams below .500. The Pistons fell to 0-19 versus teams above .500.\n\n\r\n              The Pistons dropped their fourth straight game. This skid comes on the heels of ending their NBA record-tying 28-game losing streak against Toronto on Dec. 30.\n\n\r\n              “We had a few mishaps tonight,” Pistons coach Monty Williams said, alluding to the 43 points the Pistons gave up in the pivotal third quarter. “We’ve just got to get over the hump as far as having those kinds of quarters.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Begin a three-game homestand Tuesday against Sacramento.\n\n\r\n              Nuggets: At Utah on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996759.572327
}