{
  "game_id": "0021600541",
  "espn_id": "400899962",
  "date": "Jan 05, 2017",
  "matchup": "PHX @ DAL",
  "headline": "Bledsoe has 26, Suns pull away late from Mavericks, 102-95",
  "body": "DALLAS --  Eric Bledsoe spent time last summer trying to teach himself not to get down when a game wasn't going well.\n\nThe Phoenix guard applied those lessons in Dallas, helping his team win consecutive games for just the second time this season.\n\nBledsoe scored 11 of his 26 points in the fourth quarter, including seven straight to break a tie in the final two minutes, and the Suns beat the Mavericks 102-95 on Thursday night.\n\nThe six-year veteran had missed all four of his 3-pointers through three quarters before making two of three while the Suns were 4 of 5 from long range in the fourth. He finished 9 of 16 from the field .\n\n\"I have to show up in crunch time no matter how bad the game is going for me,\" said Bledsoe, who scored nine of Phoenix's last 11 points and had a game-high seven assists. \"The last couple of minutes is my time.\"\n\nDevin Booker, Bledsoe's backcourt mate, added 22 points as the Suns (12-25) denied the Mavericks (11-25) their third two-game winning streak in a matchup of Western Conference also-rans.\n\n\"We want our guards to get after it, control the pace, create tempo and play with a lot of edge,\" Suns coach Earl Watson said. \"It just filters throughout our team.\"\n\nDeron Williams led the Mavericks with 20 points, including consecutive baskets for a 93-all tie before Bledsoe's tiebreaking 3-pointer started a 9-2 run to finish the game.\n\nTyson Chandler had 18 rebounds for Phoenix against his former team, and Brandon Knight scored 17 points after missing a game with a sprained right wrist.\n\nLed by the 7-foot-1 center who helped carry the Mavericks to their only NBA title in 2011, the Suns outrebounded the Mavericks 53-31.\n\n\"Not good,\" Dallas coach Rick Carlisle said. \"And that's a big factor obviously in the game and the outcome. You shoot better but lose by seven. That's one of the reasons.\"\n\nDallas' 7-footer, Andrew Bogut, had no rebounds and also went scoreless with five fouls a day after suggesting in a radio interview in his native Australia that his days in Dallas might be short. He didn't talk to reporters after the game.\n\nBogut, obtained in an offseason trade after Golden State had to dump salary to add Kevin Durant, is coming off the bench because starting alongside star forward Dirk Nowitzki hasn't been a good mix. Bogut is a prime candidate for a trade, with Dallas likely looking to the future.\n\nThe Mavericks led 72-70 after Devin Harris picked up a loose ball that got away from P.J. Tucker near midcourt and hit a 3-pointer at the third-quarter buzzer. That led to a fourth quarter with five lead changes and two ties.\n\nTIP-INS\n\nSuns: Alex Len had 14 points and seven rebounds. ... Chandler scored three points to go with three assists and had his eighth game with at least 15 rebounds. ... Bledsoe had at least 20 points for the 19th time in 37 games, and Booker hit the mark for the 15th time in 37 games.\n\nMavericks: Harrison Barnes, Dallas' leading scorer, had 19 points. ... The guards were strong off the bench, with Seth Curry scoring 16 points and Harris 12. ... Curry was in double figures for the ninth time in 11 games and the 18th time this season. He had 12 double-figure games with Sacramento last season.\n\nNOWITZKI'S PROGRESS\n\nThe 7-foot German played for the sixth time in seven games after missing 22 of the previous 24 with a strained right Achilles tendon. He played 28 minutes and had 13 points on 5-of-14 shooting, missing a number of open looks, with a team-high seven rebounds. \"I think it's too early to judge any of that stuff,\" Carlisle said. \"This has been a long road, so the good thing is he's moving better.\"\n\nA LITTLE RUN\n\nThanks to their modest winning streak, the Suns are 3-2 in their past five games after losing six of the previous seven. For the moment, they're out of last place in the West. \"We have aspirations and goals to make it to the playoffs,\" said Booker, who made all three of his 3-pointers. \"We know it could go either way right now, but we keep fighting through it. Tonight was a big game.\"\n\nUP NEXT\n\nSuns: Home against Cleveland before consecutive games in Mexico City against Dallas and San Antonio.\n\nMavericks: Finish their three-game homestand Saturday against Atlanta before a three-game trip that includes the game against the Suns in Mexico City.\n\n---\n\nThis story has been corrected to indicate Devin Harris scored 12 points, not 13.",
  "source": "espn_api",
  "crawled_at": 1764995976.951927
}