{
  "game_id": "0022400371",
  "espn_id": "401704937",
  "date": "Dec 19, 2024",
  "matchup": "POR vs. DEN",
  "headline": "Simons' buzzer-beating layup gives the Blazers a 122-120 win over the Nuggets",
  "body": "PORTLAND, Ore. -- — Anfernee Simons made a driving layup at the buzzer to give the Portland Trail Blazers a 122-120 victory over Nikola Jokic and the Denver Nuggets on Thursday night.\n\n\r\n              Simons drove to his right and got past defender Russell Westbrook, lofting the ball high off the glass as the horn sounded. He finished with 28 points and 10 assists.\n\n\r\n              Shaedon Sharpe scored 27 points for the Blazers, who snapped a six-game skid. Deni Avdija added 19 points and Deandre Ayton had 15 points and 13 rebounds.\n\n\r\n              Jokic had 34 points and eight assists for Denver. Jamal Murray added 24 points and 10 assists, and Westbrook scored 19 points.\n\n\r\n              Takeaways\r\n              Nuggets: Denver struggled defensively against the NBA’s third-worst offense.\n\n\r\n              Blazers: Ayton was solid in his return after Portland's starting center missed the previous two games with an illness.\n\n\r\n              Key moment\r\n              Denver trailed by 17 points at the start of the fourth quarter but rallied to take a two-point lead on Michael Porter Jr.'s dunk with just under a minute remaining. Simons and Sharpe made two free throws each to put Portland back on top before Jokic tied it on a layup with 16.8 seconds left.\n\n\r\n              Key stat\r\n              Portland shot 46.4% to Denver's 54%, but the Blazers got to the foul line more often and made five more free throws on the night. Portland made 16 3-pointers to Denver's 15.\n\n\r\n              Up next\r\n              Nuggets: At New Orleans on Sunday.\n\n\r\n              Trail Blazers: At San Antonio on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998187.44349
}