{
  "game_id": "0021401161",
  "espn_id": "400579453",
  "date": "Apr 08, 2015",
  "matchup": "CHI @ ORL",
  "headline": "Derrick Rose scores nine in 19-minute return in Bulls' loss to Magic",
  "body": "ORLANDO, Fla. -- The Orlando Magic spoiled Derrick Rose's return from his latest knee injury.\nVictor Oladipo had 23 points and scored on a layup with 1.5 seconds left to give the Magic a 105-103 victory over the Chicago Bulls on Wednesday night.\nRose started and played for the first time in more than a month since undergoing surgery on his right knee. But working on a minutes restriction, the point guard was 3-of-9 from the field and finished with nine points in 19 minutes.\n\"I felt all right,\" Rose said. \"I think it was about right. It'll get better the more I play, but I'm getting better every week. It'll take some time, but I'll get there.\"\nThe Bulls had a final chance with 1.5 seconds remaining, but an inbounds pass by Mike Dunleavy to Pau Gasol at the rim sailed out of bounds.\nNik Vucevic added 22 points in the Magic's third straight win.\n\"There's no playoff but we're trying to treat every game like a playoff game,\" Oladipo said. \"There's teams that we're playing that are playoff seeds, but we're trying to get better too.\"\nJimmy Butler had 19 points for Chicago. Gasol, Taj Gibson and Nikola Mirotic each added 15.\nRose was in his first action since Feb. 23 -- a span of 20 games. He underwent a minor operation on his right knee on Feb. 27-- the latest in a string of knee issues for the former league MVP.\nA torn meniscus in his right knee sidelined Rose most of last season. He also tore the anterior cruciate ligament in his left knee in the 2012 playoff opener.\nThe plan was to ease Rose back into action by playing just 20 minutes on Wednesday. Bulls coach Tom Thibodeau stuck pretty close to that, with Rose logging 19:24 in total.\nHe tried to make the most of it, and came out firing early on, connecting on two of his first four field goals. Rose played just shy of 13 minutes in the first half, scoring on a pair of jumpers, including a 3-pointer, along with an assist and two turnovers.\nBut he went cold after that, missing his next six shots.\nOrlando took advantage, and climbed out of a 15-point, first-half hole to regain the lead 77-75.\nRose finally broke the drought, dropping in a fast break layup that put the Bulls back in front 71-68, before reaching his minutes limit and going to the bench for the final time with 5:34 left in the third quarter.\n\"The shots I put up, I thought they were good shots before I shot it. I'm more concerned with us losing more than anything,\" Rose said.\nChicago kept the momentum, and capitalized on some late Magic miscues to end the period on a 12-2 spurt, and take an 87-79 lead into the fourth.\nBut Orlando didn't go away, and tied it at 96 on a layup by Evan Fournier.\nA 3-pointer by Mirotic briefly put Chicago back up 99-96. Oladipo responded with a floater and 3-pointer to nudge the Magic up in front 101-99.\nOut of a timeout, Gasol got free in the lane for a layup and was fouled. He missed his ensuing free throw, leading to a jumper by Orlando's Aaron Gordon.\nAaron Brooks turned it over the Bulls' next trip down the floor, but Fournier came up short on a jumper.\nA scramble for a rebound after a Bulls miss went out of bounds. A replay review gave it back to Chicago with 11.5 seconds to play. Gasol was then fouled by Gordon and connected on both free throws to set up Oladipo's layup.\nRose said the hardest part was watching from the bench late in the game.\n\"Very hard. At the same time, it's all about patience. I'm going to have my turn,\" Rose said. \"Right now while I'm not playing, I'm just trying to learning a little more and seeing how they're playing. The only thing I can do is just sit back and watch and learn.\"\nTIP-INS\nBulls: G Kirk Hinrich returned after missing last two games with a hyperextended left knee.\nMagic: Connected on their first 19 free throws. ...G Evan Fournier returned after missing last 17 games with a sore right hip. G Willie Green (hyperextended right knee) and Devyn Marble (eye) both sat out.\nGETTING REACQUAINTED\nWednesday marked just the 20th time this season that the Bulls lineup of Rose, Butler, Joakim Noah, Gasol and Mike Dunleavy started together. \"That's all you can do is try to build some continuity,\" Bulls coach Tom Thibodeau said.\nUP NEXT\nBulls: At Miami on Thursday night.\nMagic: Host Raptors on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764991645.041791
}