{
  "game_id": "0021300937",
  "espn_id": "400489810",
  "date": "Mar 09, 2014",
  "matchup": "DET @ BOS",
  "headline": "Rajon Rondo's 18 assists, Jeff Green's 27 points spark Celtics",
  "body": "BOSTON -- The Boston Celtics overcame Detroit's dominance inside by passing the ball precisely and protecting it better than they had all season.\nRajon Rondo had 18 of Boston's season-high 38 assists and the Celtics committed just seven turnovers in a 118-111 win over the Detroit Pistons on Sunday night.\n\"When one guy has it going as far as passing the ball, it's contagious,\" said Rondo, who also scored 11 points and didn't turn the ball over. \"We scored a bunch of points tonight. We kept on pushing. We played free and just had fun.\"\n\nJeff Green scored 27 points, Kris Humphries had 20 points and 11 rebounds and Kelly Olynyk added 18 points off the bench for the Celtics in their second-highest scoring output of the season.\nJerryd Bayless had 15 points and Jared Sullinger 14 for the Celtics, who got at least one assist from every player that entered the game.\n\"I think we do have a pretty unselfish group moving the ball. We missed a couple of extra passes, but not very many,\" Boston coach Brad Stevens said. \"It's good to see the body movement and the ball movement. I think we've been pretty active on that end of the floor.\"\nJosh Smith had 28 points and 11 rebounds for the Pistons and was one of three Detroit players with double-doubles. Andre Drummond had 18 points and 22 rebounds and Greg Monroe finished with 22 points and 14 boards. Will Bynum added 18 points off the bench for the Pistons, who have lost seven of eight and 10 of their last 12.\n\"I think that our effort level needs to be a little bit harder,\" Bynum said. \"I think maybe we need to play with a sense of urgency. We are trying to make the playoffs.\"\nDetroit controlled the game inside, outrebounding Boston 54-39 and outscoring the Celtics 64-44 in the paint. However, the Pistons committed 16 turnovers and could not cool off the Celtics once they started hitting shots.\nBoston shot 15 for 22 in the third quarter, including eight 3-pointers, in its highest scoring game since beating Orlando 120-105 on Nov. 11.\n\"Sometimes we close out hoping they miss and I thought down the stretch of the game, we closed out trying to make them miss,\" Detroit coach John Loyer said. \"We dared them to shoot the basketball and they had a very good shooting night, but you've got to adjust as the game goes on and guys are shooting the ball.\"\nBoston beat the Pistons for the first time in three meetings this season.\nDetroit had rallied from 21-points down to win in Boston on Dec. 18, but the Celtics were able to hold off the Pistons each time they rallied down the stretch this time.\nAfter going 2 for 14 from 3-point range in the first half, the Celtics made five from beyond-the-arc in the first 6 minutes of the third quarter.\nSmith pulled Detroit to 69-63 on a 3-pointer with 7:27 left in the period, the Green made back-to-back 3s followed by another from Bayless to stretch Boston's lead to 78-63. The Celtics finished the period with eight 3s and led 95-84 entering the fourth.\nMonroe's three-point play with 9:28 remaining cut Boston's lead to 97-89, then Bynum pulled up for a jumper on a fast break to get the Pistons within six.\nDetroit stayed within reach and pulled to 113-109 on two free throws by Bynum, but the Pistons had to foul and Humphries sealed it by making two from the line.\nThe Celtics shot 50 percent in the second quarter and led by 13, but Detroit closed the half on a 9-2 run to pull within 57-49 at the break.\nGame notes\nDrummond's 45 double-doubles are most for a Detroit player since Isiah Thomas had 47 in 1985-86. ... Humphries' previous high this season was 19 points. ... Rondo reached 4,101 career assists, passing Bill Russell (4,100) for fifth place in team history. ... Boston finished with just seven turnovers.",
  "source": "espn_api",
  "crawled_at": 1764993293.3062348
}