{
  "game_id": "0021901265",
  "espn_id": "401224740",
  "date": "Aug 05, 2020",
  "matchup": "LAL vs. OKC",
  "headline": "CP3 leads Thunder's rout of cold-shooting Lakers, 105-86",
  "body": "LAKE BUENA VISTA, Fla. --  Chris Paul had 21 points, seven rebounds and six assists in the Oklahoma City Thunder's 105-86 victory over the poor-shooting Los Angeles Lakers on Wednesday night.\n\nDanilo Gallinari scored 19 points and Steven Adams had 18 for the Thunder (42-25), who never trailed in their first win over the Lakers in four meetings this season. Oklahoma City pulled even with Houston for the fifth seed in the Western Conference playoff picture with five games left.\n\nThe 86 points were the fewest by the Lakers -- and by a Thunder opponent -- this season.\n\n\"We just tried to stick to the game plan,\" Paul said. \"We tried to keep those guys off the (free throw) line as much as possible. We tried to build a wall up on LeBron when he's pushing it. Just trying to make it hard for them.\"\n\nLeBron James had 19 points and 11 rebounds for the Lakers (51-16), who had another possibly concerning offensive performance while dropping to 2-2 in the bubble. Los Angeles, which has already clinched the top seed in the West and the Pacific Division title, never held a lead for the first time all season.\n\n\"I think we had some great possessions,\" James said. \"I think sometimes we have some bad shot selection throughout the course of these games, but I think we got some great looks. Our defense is pretty good. We only allowed the Thunder to shoot 43% from the field. We'll get our rhythm and start making some.\"\n\nThe Lakers went a season-worst 5 for 37 on 3-pointers and made only 35% of their shots overall. Los Angeles dropped two games behind Milwaukee for the NBA's best overall record, which won't provide a real home-court advantage in the NBA Finals this year.\n\n\"We're building habits, and every time we're out there we have a chance to build and find rhythms,\" Lakers coach Frank Vogel said. \"These games are still really important for us to do that.\"\n\nDion Waiters scored 14 points for the Lakers, whose poor perimeter shooting in the bubble still hasn't been fixed as they dropped to 25% on 3-pointers in their last four games. They went 1 for 12 behind the arc in the first quarter against Oklahoma City, and they missed 19 of their first 22 attempts until late in the third quarter.\n\nThe Thunder were only 5 for 24 on 3-pointers, but their steady defense and 32-for-36 effort at the free throw line led to a comfortable win.\n\n\"I felt we had a good team effort in terms of getting back and letting (James) see a crowd,\" Thunder coach Billy Donovan said. \"Neither team shot it too well from behind the line today.\"\n\nTIP-INS\n\nThunder: They played without Mike Muscala (concussion protocol), Terrance Ferguson (bruised right leg) and Dennis Schroder, who is away from the team for the birth of his second child. ... Adams got his leg caught underneath his body when he fell in a heap with Davis during the third quarter. He left the court briefly, but returned to the game.\n\nLakers: Dwight Howard sat out with a sore right knee. ... Los Angeles got a scare in the third quarter when Paul elbowed Kentavious Caldwell-Pope in the ribs, forcing Caldwell-Pope to leave the game. The Lakers are already without Avery Bradley and Rajon Rondo. Caldwell-Pope returned later.\n\n9 AD\n\nAnthony Davis scored just nine points on 3-for-11 shooting in 29 minutes. That matches his second-lowest point total in a Lakers uniform and his lowest-scoring performance while playing at least 29 minutes since January 2018.\n\n\"I think we're fine,\" Davis said. \"I don't think anything is eye-opening, something that we need to be afraid of. The offense is going to come around.\"\n\nUP NEXT\n\nThunder: Face the Memphis Grizzlies on Friday.\n\nLakers: Face the Houston Rockets on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995963.123199
}