{
  "game_id": "0021700359",
  "espn_id": "400975110",
  "date": "Dec 06, 2017",
  "matchup": "MIL vs. DET",
  "headline": "Bucks use fourth-quarter run to beat Pistons 104-100",
  "body": "MILWAUKEE --  After a poor third quarter cost them a nine-point halftime lead, the Milwaukee Bucks came out firing to start the fourth.\n\nThe Bucks began the final period on a 14-1 run and held on for a 104-100 win over the Detroit Pistons on Wednesday night.\n\nGiannis Antetokounmpo had 25 points and 10 rebounds, and Khris Middleton had 21 points, including four free throws in the final 20 seconds to help the Bucks win for the fourth time in five games. Eric Bledsoe added 22 points.\n\n\"We just stayed with it,\" Middleton said. \"We did a great job of holding onto the lead. We have just been grinding it out and staying with it.\"\n\nMilwaukee took a 60-51 lead into halftime, but Detroit outscored the Bucks 25-16 in the third quarter to send the game to the fourth tied at 76.\n\nThe Bucks took a 90-77 lead on a jumper by Malcolm Brogdon with 6:42 remaining. Including the end of the third quarter, Detroit went 7:57 without a field goal until Tobias Harris scored with 5:12 left.\n\nAndre Drummond scored 27 points with 20 rebounds for Detroit, which lost its fourth straight.\n\nPistons coach Stan Van Gundy blamed the slow start to the fourth quarter on the Pistons bench players.\n\n\"Our bench has not played well on this trip,\" Van Gundy said. \"We maybe have to change up our rotations. Our bench has been really, really good for us, but now has not been.\"\n\nReggie Jackson's jumper pulled Detroit within 97-94, but Bledsoe tipped in his own miss to make it 99-94 with 32.1 seconds to play.\n\n\"Giannis and Bledsoe made some big plays down the stretch with some offensive rebounds,\" Bucks coach Jason Kidd said. \"Just the confidence that those two have in one another and in the team is great. Nobody is panicking trying to execute the play.\"\n\nMilwaukee led 64-53 after an alley-oop dunk by John Henson with 9:55 left in the third quarter.\n\nThe Pistons answered with a 14-2 spurt to take a 67-66 lead. Harris scored the final eight points of the run, including a 3-pointer to cap the stretch with 6:09 remaining in the third.\n\nHarris had 21 points, and Avery Bradley scored 20.\n\n\"We just need to keep our head up,\" Drummond said. \"We can't allow these losses to get us down. It is a long season.\"\n\nTIP-INS\n\nPistons: Forward Jon Leuer was out with a left ankle sprain. ... After coming off the bench Monday against San Antonio, forward Stanley Johnson returned to the starting lineup. Forward Anthony Tolliver moved to the bench.\n\nBucks: Guard Jason Terry is expected to miss multiple weeks with a left calf strain suffered Monday against Boston. ... Playing double-digit minutes for the first time since Oct. 31, guard Rashad Vaughn scored 11 points in 17 minutes.\n\nGREEK FREAK BIRTHDAY\n\nAntetokounmpo celebrated his 23rd birthday Wednesday. He has the most points (5,364), rebounds (2,407) and assists (1,230) in Bucks history before turning 23.\n\nHis 30 games of scoring at least 30 points before reaching 23 years old is second to only Kareem Abdul-Jabbar's 32 in franchise history.\n\nRETURNING HOME\n\nFormer Marquette star and Wisconsin native Henry Ellenson returned to the building where he played college basketball. Ellenson has played in just nine games for Detroit this season, averaging 4.2 points and 2.6 rebounds.\n\nUP NEXT\n\nPistons: Detroit hosts Golden State on Friday night.\n\nBucks: Milwaukee continues a three-game homestand against Dallas on Friday night.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993037.188875
}