{
  "game_id": "401809947",
  "espn_id": "401809947",
  "date": "Oct 24, 2025",
  "matchup": "HOU vs DET",
  "headline": "Cunningham's late free throws help Pistons beat Rockets 115-111",
  "body": "HOUSTON -- — Cade Cunningham scored 21 points and made two free throws with 5.5 seconds left to help the Detroit Pistons hold on to beat the Houston Rockets 115-111 on Friday night.\n\n\r\n              Detroit coach J.B. Bickerstaff got his 300th career win, making him and his father Bernie Bickerstaff (419) the first father-son duo to in NBA history to each reach 300 career wins. \n\n\r\n              Paul Reed’s layup made it 113-110 before Houston cut the lead to two when Alperen Sengun made 1 of 2 free throws with 1:32 remaining.\n\n\r\n              Both teams missed 3-point attempts before Detroit’s Ausar Thompson missed a 3 with 35 seconds left and Reed blocked Sengun’s shot in the lane 16.4 seconds to go.\n\n\r\n              Houston was forced to foul and Cunningham sunk both free throws to make it 115-111 and give the Pistons their first win of the season after they lost to Chicago in their opener. \n\n\r\n              Thompson had 19 points for Detroit to outdo identical twin brother Houston’s Amen Thompson, who finished with 10.\n\n\r\n              Kevin Durant had 37 points for the Rockets and was 16 of 18 from the free throw line. He was 3 of 3 from 3-point range after missing all four of his long-range shots Tuesday in his first game with the Rockets after this summer’s blockbuster trade from Phoenix.\n\n\r\n              The Pistons led by 5 after a 3-pointer by Cunningham with about 8½ minutes to go before Durant scored all of Houston’s points in an 8-3 run to tie it at 101-all midway through the quarter.\n\n\r\n              The Rockets trailed by 3 with about five minutes left when Durant tied it at 105 with a 3-pointer.\n\n\r\n              Detroit used a 6-0 run to take a 111-105 lead with three minutes left. Jabari Smith Jr. hit a 3-pointer for Houston after that and Durant made a pair of free throws to get Houston within 1 with less than two minutes to go.\n\n\r\n              Up Next\r\n              Pistons: Host Boston on Sunday.\n\n\r\n              Rockets: Host Brooklyn on Monday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042491.902739
}