{
  "game_id": "0022201167",
  "espn_id": "401469322",
  "date": "Apr 02, 2023",
  "matchup": "ATL vs. DAL",
  "headline": "Trae Young lifts Hawks past Mavericks in OT, 132-130",
  "body": "ATLANTA -- — Trae Young made two free throws with 1.8 seconds remaining in overtime to give Atlanta the lead and the Hawks beat the Dallas Mavericks 132-130 on Sunday night to keep pace in the Eastern Conference play-in race.\n\n\r\n              Young was fouled by Kyrie Irving, who scored 41 points, with the game tied at 130 on what Young said was “kind of a lucky play for us and unlucky for them.”\n\n\r\n              Young said he accidently stepped on the foot of Mavericks guard Josh Green before crashing into Irving. “I just got in Kyrie's way,” Young said.\n\n\r\n              Mavericks coach Jason Kidd said “it was a wild ending” and added “it was just unfortunate we got a foul there that could have gone either way.”\n\n\r\n               Following Young's free throws, Luke Doncic, who scored 22 points, missed a last-second 3-pointer.\n\n\r\n              “I thought Luke got a great look there at the end,” Kidd said. “He's the one who can make it.”\n\n\r\n              The Hawks (39-39) moved back into eighth place in the play-in race. Toronto and Chicago put pressure on the Hawks with wins before Atlanta’s game. The Hawks have the tiebreaker advantage over Toronto.\n\n\r\n              The Hawks are only one ahead of the 10th-place Bulls for the final play-in spot in the Eastern Conference and play at Chicago on Tuesday night.\n\n\r\n              Irving's mid-range jumper with 37 seconds remaining in regulation tied the game at 121. Saddiq Bey's layup gave the lead back to Atlanta. \n\n\r\n              Christian Wood was fouled by John Collins and made one free throw before missing the second with 1.2 seconds remaining. With 0.4 seconds remaining, Atlanta's Clint Capela fouled JaVale McGee near the basket as McGee reached for Doncic's inbound pass. McGee missed the first free throw and made the second to tie the game at 123 and force overtime.\n\n\r\n              John Collins' 3-pointer, followed by Clint Capela's jam, gave Atlanta an 84-74 lead midway through the third period. The Hawks stretched the advantage to 15 points at 91-76, but Dallas used a 15-3 run to close the deficit to 94-91 entering the final period.\n\n\r\n              HUNTER HURTING\n\n\r\n              Hawks small forward De'Andre Hunter missed his second consecutive game after an MRI on Saturday revealed a bone bruise and muscle strain in his left knee. \n\n\r\n              Hawks coach Quin Snyder said Hunter is “a unique player and very important ... for his ability to take a defensive matchup.” Snyder said before the game Hunter would have been valuable in the matchups against the Mavericks, where the presence of small forward Tim Hardaway Jr. makes it more difficult to devote extra defensive attention to Doncic and Irving.\n\n\r\n              PLAYING CATCH-UP\n\n\r\n              Dallas (37-42) remained 11th in the Western Conference, one spot out of the play-in.\n\n\r\n              “We know the position we’re in,” Kidd said. “We’re playing catch-up. We’ve got to find a way to win and right now we’re coming up short.”\n\n\r\n              The Mavs have lost three straight and seven of eight.\n\n\r\n              TIP-INS\n\n\r\n              Mavericks: Kidd made a pregame plea for improved contributions from his bench “on both ends.” It was part of his emphasis on improved overall defensive play. “It's effort. It's grit,” Kidd said. “It's what you want to do as much as energy.” Kidd complained the Mavs' defense was “nonexistent” in a 129-122 loss at Miami on Saturday night. ... Christian Wood had 18 points and 11 rebounds.\n\n\r\n              Hawks: Saddiq Bey had 13 points as the fill-in starter for Hunter. ... Capela had 14 points and 11 rebounds.\n\n\r\n              UP NEXT\n\n\r\n              Mavericks: Begin streak of three straight home games to finish regular season when they host Sacramento on Wednesday night.\n\n\r\n              Hawks: At Chicago on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994803.0556889
}