{
  "game_id": "0021900741",
  "espn_id": "401161383",
  "date": "Feb 03, 2020",
  "matchup": "CHA vs. ORL",
  "headline": "Vucevic helps Magic snap 5-game skid, beat Hornets 112-100",
  "body": "CHARLOTTE, N.C. --  All the Orlando Magic needed to get back on track was a return trip to Charlotte.\n\nNikola Vucevic scored 22 points, Aaron Gordon had 16 points and 12 rebounds, and the Magic snapped a five-game skid with a 112-100 win over the Hornets on Monday night. Evan Fournier added 17 points and Markelle Fultz had 12 points and 14 assists for the Magic, who won for the first time since beating the Hornets by 23 points here on Jan. 20.\n\n\"We always preach don't ever get too high, never get too low in this league -- and this was just one of those games that we needed,\" Gordon said.\n\nTerry Rozier scored 18 points to lead the struggling Hornets, who have lost 11 of 12.\n\nOrlando (22-28) led by eight entering the fourth quarter but quickly stretched the lead to 16 behind back-to-back 3-pointers from Terrence Ross and Gary Clark. The Hornets cut the lead to seven, but Ross hit two more 3s on consecutive possessions to push the lead back to 13. Ross finished with 13 points on four 3s.\n\nOrlando shot 16 of 34 from 3-point range; the Hornets were 9 of 31.\n\n\"We lost at the 3-point line by 21 points and that was the difference,\" Hornets coach James Borrego said. \"We won the paint game and that was encouraging. ... But unfortunately they made seven more 3s than us, which isn't typical for them. They're not typically a big-time 3-point shooting team but they made shots that you have to give them credit for.\"\n\nThe Magic move the ball well too, finishing with 35 assists.\n\nMagic coach Steve Clifford called the ball movement a \"step forward.\"\n\n\"I mean it's how we have to play,\" Clifford said. \"It's how we're built. We play traditional NBA basketball, but the ball has got to move. Everybody has to share it equally and when we do, that's when we played our best last year.\"\n\nDevonte Graham scored 15 points for the Hornets (16-34) after being held to just two points in the first three quarters. Graham came into the game struggling from the field, making 8 of 23 shots from the floor over his previous three games. He finished 6 of 13 against Orlando.\n\nTIP INS\n\nMagic: Khem Burch sat out after experiencing lower back soreness before the game. ... Orlando was out-rebounded 46-37.\n\nHornets: Rookie P.J. Washington missed his second straight game with a sprained right ankle.\n\nFULTZ STEPS UP\n\nFultz's 14 assists were a season high.\n\n\"He's got great shooters around him,\" Fournier said with a laugh.\n\nFournier called Fultz a \"special talent,\" adding that \"he's a point guard, he's athletic and he's big. He's able to get into small spaces and just find guys around him and we're all aware of that. He's a good passer, so we're always ready for him.\"\n\nMARTIN GIVES A SPARK\n\nCharlotte's Cody Martin gave his team a needed spark off the bench, scoring a career-high 13 points on 6-of-6 shooting.\n\n\"For me it is about confidence, and the more I play the more confidence I have,\" Martin said.\n\nMO BAMBA\n\nThe Magic got 12 points, seven rebounds and two blocked shots from Mo Bamba in less than 12 minutes of playing time.\n\n\"It changes everything,\" Fournier said. \"To be a good team, you need balance and to have balance, you have to have a good bench and they definitely did a good job -- even Gary (Clark) who's new. He was locked in today. He had a big shot, so everyone contributed.\"\n\nUP NEXT\n\nMagic: Travel to face the Celtics on Wednesday night.\n\nHornets: Face the Rockets on the second night of a back-to-back Tuesday in Houston.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996060.833411
}