{
  "game_id": "0021800230",
  "espn_id": "401070911",
  "date": "Nov 17, 2018",
  "matchup": "TOR @ CHI",
  "headline": "VanVleet, Green, Ibaka lead Raptors to 122-83 rout of Bulls",
  "body": "CHICAGO --  With Kawhi Leonard sitting out, Toronto Raptors coach Nick Nurse inserted Fred VanVleet into the starting lineup Saturday night hoping it would snap the reserve guard out of a recent funk.\n\nMission accomplished.\n\nVanVleet scored 18 points, Danny Green added 17 and Serge Ibaka had 16 points and four blocks, sending the short-handed Raptors to a 122-83 rout of the Chicago Bulls that snapped their three-game losing streak.\n\nLeonard, the team's leading scorer, was held out after playing 43 minutes in an overtime loss Friday night at Boston. He played in just nine games last season and has yet to appear in back-to-back games this season.\n\nGreen went 7 for 7 from the field, including 3 of 3 on 3-pointers. VanVleet, who entered shooting just 36.1 percent from the floor, was 7 for 11 -- including 4 of 7 on 3s.\n\n\"Obviously, getting out there and getting an extended run is helpful to get a rhythm,\" VanVleet said. \"But at the end of the day, I just have to make shots, and tonight I was able to do that.\"\n\nAntonio Blakeney had 13 points and Justin Holiday and Jabari Parker each added 12 for the Bulls, who have dropped four straight.\n\nChicago also played without its leading scorer, Zach LaVine, who sat out with an illness. LaVine first experienced symptoms Thursday night and struggled through Friday night's game at Milwaukee.\n\nWithout him, the Bulls struggled on offense, making just 30 of 86 field goal attempts (34.9 percent) and committing 22 turnovers.\n\n\"We didn't have a rhythm,\" coach Fred Hoiberg said. \"We had trouble executing, we allowed them to crawl up into us and there were way too many turnovers.\"\n\nVanVleet had 10 first-half points on 4-for-8 shooting. Pascal Siakam also scored 10 and Green led the way with 14 as Toronto took a 57-44 halftime lead.\n\nThe Bulls managed just nine points in the third quarter (on 4-for-19 shooting) as the Raptors opened an 89-56 lead entering the fourth.\n\nVanVleet had eight points and made all three of his shots in the third.\n\n\"He really looked like his old self,\" Nurse said. \"He's been a shell of himself lately, in all phases. Not getting the ball where he wants to go. Not shooting the 3 at a high level. In my head, he's a 45-plus shooter and he's shooting somewhere in the 20s this year.\n\n\"He just looked like a different guy out there, and that's good.\"\n\nNone of Toronto's starters played in the fourth, but the Raptors still managed to stretch the lead to 40 points.\n\n\"We need to do something,\" Chicago rookie Wendell Carter Jr. said. \"Try our hardest, don't quit and play as hard as you can until the last second.\"\n\nSECOND-HALF WOES\n\nThe Bulls were outscored 65-39 in the second half, a day after being outscored 78-41 after halftime at Milwaukee.\n\nHOME COOKING\n\nBesides starting, VanVleet got a lift from playing in the United Center. He's from Rockford, about a 90-minute drive away, and had family and friends in attendance.\n\n\"It's always great to play here,\" VanVleet said.\n\nBOTTOMS UP\n\nBulls center Robin Lopez displayed a unique celebration after hitting a 3-pointer in the first half. As he headed back on defense, Lopez pantomimed opening a can of beer and taking a swig. It was his first 3 of the season.\n\nTIP-INS\n\nRaptors: G Kyle Lowry didn't return after tweaking an ankle in the third quarter. Lowry, though, said afterward that's he's fine. ... OG Anunoby (sprained right wrist), C.J. Miles (right adductor strain) and Norman Powell (left shoulder) didn't play.\n\nBulls: F Lauri Markkanen, sidelined since the preseason with a sprained right elbow, is close to being cleared for contact. \"We'll see,\" Hoiberg said. \"He just had a great workout before we had our walkthrough out there and he's making progress, and that's the important thing.\"\n\nUP NEXT\n\nRaptors: At the Orlando Magic on Tuesday night.\n\nBulls: Host the Phoenix Suns on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994123.878648
}