{
  "game_id": "0022400967",
  "espn_id": "401705533",
  "date": "Mar 14, 2025",
  "matchup": "SAC @ PHX",
  "headline": "Booker and Durant each score 22 points as Suns beat Kings 122-106",
  "body": "PHOENIX -- — Devin Booker had 22 points and 13 assists, Kevin Durant also scored 22 points and the Phoenix Suns beat the Sacramento Kings 122-106 on Friday night.\n\n\r\n              Tyus Jones made six 3-pointers to finish with 20 points as the Suns made 24 3-pointers in the game, one short of the franchise record. They shot 55.8% (24 of 43) from behind the arc.\n\n\r\n              Ryan Dunn scored 16 points, Bradley Beal had 15 and Oso Ighodaro finished with 11 as the Suns, who are 11th in the Western Conference, gained a game on ninth-place Sacramento.\n\n\r\n              Domantas Sabonis had 12 points, 12 assists and 11 rebounds in his return after missing six games with a hamstring injury. DeMar DeRozan scored 23 points, Zach LaVine added 21 and Malik Monk 18 for the Kings.\n\n\r\n              Phoenix’s Mason Plumlee was ejected for the second consecutive game, this time for a flagrant foul against Sabonis in the third quarter. He was tossed along with Houston’s Steven Adams for a fight in Wednesday’s game. Plumlee started as Nick Richards missed the game with a sprained right ankle.\n\n\r\n              Takeaways\n\n\r\n              Kings: Getting Sabonis back helped but they shot poorly from long range (8 for 32, 25%) and committed 19 turnovers for 38 Phoenix points.\n\n\r\n              Suns: Picked up a much-needed win at home where they’re now 19-13. Nine of their final 15 games are in Phoenix.\n\n\r\n              Key moment\n\n\r\n              Phoenix raced to an early 19-point lead and when Sacramento cut it to two just before half, Durant made a 3-pointer for a 62-57 halftime lead.\n\n\r\n              Key stat\n\n\r\n              Sabonis, Monk and LaVine were a combined 0 for 13 from 3-point range until LaVine made one midway through the fourth quarter.\n\n\r\n              Up next\n\n\r\n              The Kings host Memphis on Monday. The Suns visit the Lakers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997316.603926
}