{
  "game_id": "0021801143",
  "espn_id": "401071816",
  "date": "Mar 30, 2019",
  "matchup": "PHI @ MIN",
  "headline": "In Butler's return, 76ers top Wolves 118-109",
  "body": "MINNEAPOLIS --  The jeers for Jimmy Butler in his return to Minnesota only gave the Philadelphia 76ers more fuel.\n\nTobias Harris had his highest-scoring game in a month, rookie Jonah Bolden ably filled in for All-Star Joel Embiid and the Sixers moved one step closer toward solidifying the No. 3 seed for the Eastern Conference playoffs.\n\nHarris had 25 points, Ben Simmons pitched in 20 points, 11 rebounds and nine assists and the Sixers hung on to beat the Timberwolves 118-109 on Saturday, as Butler was booed every time he touched the ball.\n\nThe Sixers (49-27) stretched their lead over Boston and Indiana to 4 1/2 games with eight games to go. They're still four games behind second-place Toronto.\n\n\"I'm glad we came in here and did what we were supposed to do to get a rhythm moving forward,\" said Butler, who offset his 4-for-17 shooting night with 13 rebounds, five assists and two steals. \"Home, away, whoever it's against, I'm solid. I'm cool.\"\n\nThe crowd was predictably biased against Butler, whose disinterest in staying with Minnesota triggered the trade that sent him to Philadelphia for Robert Covington, Dario Saric and Jerryd Bayless. Wolves fans even jeered him as he walked off the court clutching his lower back in the first quarter, an injury that didn't require him to leave the game but he acknowledged was bothering him afterward.\n\nSixers teammate Amir Johnson even joined in the fun during introductions, playfully joining the jeering and pointing both thumbs down as a grinning Butler jogged onto the court before the opening tip. Carly Simon's 1972 pop song, \"You're So Vain,\" played over the sound system.\n\n\"The crowd kind of set the table with just the mood in the building,\" Sixers coach Brett Brown said. \"It was great the way the team responded. You get that kind of fight-or-flight feeling, and I thought we fought.\"\n\nHarris even joked to Butler at halftime to play off the ball.\n\n\"Because those boos were annoying me,\" Harris said, smiling. \"But it was a fun atmosphere to be a part of. I thought Jimmy did a great job of just battling through and playing.\"\n\nWith Embiid staying home from this three-game road trip to rest his left knee, Bolden produced 19 points in 31 minutes, both career bests.\n\n\"Hopefully that gives him a lot of confidence, just being ready,\" Simmons said.\n\nBolden had logged only a total of 20 minutes over the last nine games.\n\n\"He gave them a great lift, and that's a luxury to have,\" Wolves coach Ryan Saunders said.\n\nTOO LITTLE, TOO LATE\n\nAndrew Wiggins scored 24 points and Karl-Anthony Towns had 21 points for the Wolves, whose first crack at Butler and the Sixers went badly on Jan. 15 in Philadelphia, nine days after coach Tom Thibodeau was fired and replaced by Saunders. That game quickly turned into the worst of the season for the Wolves , who gave up 83 points in the first half on the way to a 149-107 defeat that still makes them wince more than two months later.\n\nThe Sixers made eight 3-pointers in the first quarter for the second straight game, the most allowed in the opening frame by the Timberwolves in franchise history, and surged to a 41-20 lead that looked a lot like that earlier blowout. The Sixers still held a 15-point advantage past the midpoint of the third quarter, when the reserves sparked a spirited rally for the Wolves one night after their one-point overtime win over defending NBA champion Golden State .\n\nAnthony Tolliver's third 3-pointer of the game cut the lead to 92-85 early in the fourth quarter, and a one-handed floater in the lane by Cameron Reynolds brought the Timberwolves within 97-94. Wiggins used a finger roll to reduce the deficit to 105-102, but Towns fouled Harris as he made a jumper and complained enough about the call to get a technical, too. That turned into a four-point possession for the Sixers, who outscored the Wolves 13-6 over the final 5:10.\n\nThe Sixers owned a 21-3 advantage in second-chance points, with 40 defensive rebounds versus just four offensive rebounds by the Wolves.\n\n\"They killed us the last game so we tried to come back and try to get revenge, but it didn't work out in our favor,\" said Wiggins, who reached the 20-point mark for the sixth straight game. \"But I feel that we still played hard.\"\n\nTIP-INS\n\n76ers: Simmons had five assists by the end of the first quarter, hitting that mark for a league-high-tying 65th time, matching Oklahoma City's Russell Westbrook, out of 74 games this season. ... James Ennis III (bruised right quadriceps) returned from a two-game absence with five points and seven rebounds in 17 minutes.\n\nTimberwolves: With Covington, Derrick Rose and Jeff Teague all shut down for the remainder of the season with injuries and Luol Deng and Taj Gibson still out, too, the Wolves were short-handed enough to sign forward Mitch Creek, a 26-year-old Australian who played in four games for the Nets, to a 10-day contract.\n\nUP NEXT\n\n76ers: Play at Dallas on Monday night.\n\nTimberwolves: Finish a four-game homestand on Monday night against Portland.\n\n---\n\nMore AP NBA coverage: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764993987.143163
}