{
  "game_id": "0021900365",
  "espn_id": "401161007",
  "date": "Dec 11, 2019",
  "matchup": "SAC vs. OKC",
  "headline": "Kings storm back in 4th quarter to stun Thunder, 94-93",
  "body": "SACRAMENTO, Calif. --  Buddy Hield was upset about not getting a foul call when Oklahoma City double-teamed him in the final seconds while he was attempting to get free for a shot. When no whistle blew, Hield calmed down and passed the ball to Sacramento teammate Bogdan Bogdanovic.\n\n\"I found the best shooter in the gym, so it’s cool,\" Hield said.\n\nBogdanovic made a 3-pointer with 13.4 seconds remaining and the Kings overcame an 11-point deficit in the fourth quarter to beat the Thunder 94-93 on Wednesday night.\n\nIt was the second time in three days Sacramento hit a late 3 to win. Nemanja Bjelica's 33-footer at the buzzer lifted the Kings over Houston 119-118 on Monday. They also got a clutch defensive stop from Cory Joseph to hold off the Dallas Mavericks on Sunday.\n\n\"When you trust the guys you have on the court, sometimes at the end you have to sit back and let them do what they do,\" Sacramento coach Luke Walton said. \"I enjoy those moments.\"\n\nBoth teams committed turnovers with the game tied in the final minute before Shai Gilgeous-Alexander hit two free throws to put the Thunder up 93-91 with 31.6 seconds left. That came 24 seconds after Oklahoma City failed to advance the ball past midcourt within the allotted eight seconds.\n\n“We had some opportunities in the fourth to have better possessions offensively,” Thunder coach Billy Donovan said. “The possessions we had weren’t good enough. They made some shots that I thought we defended really well, but we didn’t close the game as well as we had some other games.”\n\nBogdanovic, who missed five of his first six 3s, got the ball outside the arc and paused as Oklahoma City defender Dennis Schroder went flying past him trying for a block. Bogdanovic then hit a 28-foot jumper to give Sacramento the lead.\n\nChris Paul missed a shot from the elbow for the Thunder as time expired.\n\n“I watch all these games on League Pass night in and night out, and as soon as it left (Bogdanovic’s) hand you just know it's going in,” Paul said. “I got to the spot I wanted to. I have to knock that down.”\n\nHield had eight of his 23 points in the fourth quarter for the Kings. Bogdanovic scored 17 and Marvin Bagley III added 11 points and six rebounds after missing the previous 22 games with a broken right thumb.\n\n“It was great,” said Bagley, the second overall pick in the 2018 draft. “Being back out there after that period of time rehabbing and making sure I was healthy enough to play, it felt good to be back out there playing a game that I love.”\n\nSchroder had 17 points to lead six Thunder players in double figures. Paul wasn’t one of them. Oklahoma City’s point guard had eight points, 12 assists and seven rebounds.\n\nThe Thunder had won three straight.\n\nSacramento trailed by 14 early in the third but made a late run and cut the gap to 71-69 following consecutive 3s by Hield, who had missed six of his first seven attempts from beyond the arc.\n\nTIP-INS\n\nThunder: Schroder’s three 3-pointers in the first half matched that of the entire Sacramento team. Oklahoma City finished with 13 3s. … Steven Adams had 12 points and 11 rebounds.\n\nKings: Bagley’s first shot was an airball and he finished 5 of 13. He was injured in the first game of the season. … Hield missed nine of his first 11 shots. … Sacramento had only three assists in the first half and finished with 12.\n\nUP NEXT\n\nThunder: End their four-game road trip Saturday in Denver. Oklahoma City lost all four games to the Nuggets last season.\n\nKings: Host the New York Knicks on Friday. Sacramento won the first game between the teams this season, 113-92 at Madison Square Garden.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995903.72608
}