{
  "game_id": "0022201043",
  "espn_id": "401469198",
  "date": "Mar 16, 2023",
  "matchup": "BKN vs. SAC",
  "headline": "Kings beat Nets, clinch first winning season since 2005-06",
  "body": "NEW YORK -- — For the first time in 17 years, Sacramento has a winning team again.\n\n\r\n              Domantas Sabonis had 24 points and 21 rebounds, and the Kings clinched their first winning season since 2005-06 by beating the Brooklyn Nets 101-96 on Thursday night.\n\n\r\n              De'Aaron Fox added 18 points, six rebounds and five assists for the Kings, who improved to 42-27, second in the Western Conference. They hadn't finished above .500 since going 44-38 in 2005-06, the last of eight consecutive playoff appearances under Rick Adelman. \n\n\r\n              The Kings have had a losing record in the other 29 seasons since moving to Sacramento but are in good shape to end the NBA's longest current postseason drought in their first season under Mike Brown.\n\n\r\n              “I think being here for over four years now, and seeing the bottom — the very bottom — and to see the frustration of fans and the people in the organization, I think it’s nice to be on the other side it,” veteran Harrison Barnes said. \"A lot of people, they don’t get a chance to stay in an organization long enough to see the good times and the bad, they just see the bad side. So I consider myself fortunate to be able to be part of this moment.” \n\n\r\n              The Kings improved to 10-2 since the All-Star break by turning to their defense on a night their usually potent offense stalled while playing on the second night of a back-to-back. They won Wednesday in Chicago when Fox's 3-pointer gave them a 117-114 victory.\n\n\r\n              Sacramento held Brooklyn without any second-chance points and just two fast-break points with some defensive possessions that Brown said were among the best he'd seen all season.\n\n\r\n              “And to see that again in this situation, a back-to-back, was really, really encouraging,” Brown said, “because we’re going to have to win games like this come playoff time.” \n\n\r\n              Yes, it's safe to talk playoffs again in California's capital.\n\n\r\n              Sabonis had 20 points by halftime and the Kings led by as much as 17, but the Nets made it close.\n\n\r\n              Mikal Bridges scored 23 points for the Nets, who fell 1 1/2 games behind the New York Knicks for fifth place in the Eastern Conference and are just 1 1/2 ahead of seventh-place Miami as they try to avoid the play-in tournament.\n\n\r\n              Spencer Dinwiddie added 18 points and Nic Claxton had 14 points and 14 rebounds for the Nets, back in Brooklyn after going 3-2 on their road trip and hoping to capitalize on a home-heavy schedule the rest of the way. Nine of their remaining 12 games are at Barclays Center. \n\n\r\n              It was tied at 41 with under 3 1/2 minutes remaining in the first half before Sabonis converted a three-point play. That kicked off a 13-0 finish for the Kings, with Fox's jumper making it 54-41 at the break.\n\n\r\n              “They were just playing harder and getting stops and they were just scoring, getting to the line,” Bridges said. “But yeah, they just played harder than us.” \n\n\r\n              A three-point play by Barnes followed by a 3-pointer from Fox pushed it to 60-43, but the Nets would recover with a 10-0 spurt later in the third to trim it to six points. Sacramento went on to take an 82-71 advantage to the fourth. \n\n\r\n              TIP-INS\n\n\r\n              Kings: Kevin Huerter was scoreless in six minutes before leaving with a right leg injury. He came up limping after missing a shot in the first quarter and will have an MRI exam Friday. ... Sabonis was the first player in the NBA this season with at least 20 points, 10 rebounds and three blocks in the first half. He had five assists, falling short of a third straight triple-double.\n\n\r\n              Nets: Brooklyn is 19-13 at home. The Nets were trying to join Milwaukee and Boston as the only teams with 20 wins at home and on the road. \n\n\r\n              STILL SEE SIMMONS?\n\n\r\n              Ben Simmons has sat out all 12 games since the All-Star break with left knee and back soreness, but Nets coach Jacque Vaughn said the expectation remains that he will play again this season. Vaughn said the 2016 No. 1 pick was doing some work on the court and hadn't had any setbacks, but there was no timetable for his return. “So we want him back to hoop, he wants to be back to hoop and that is definitely the goal,” Vaughn said.\n\n\r\n              UP NEXT\n\n\r\n              Kings: At Washington on Saturday.\n\n\r\n              Nets: Host Denver on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994851.8852549
}