{
  "game_id": "0021500135",
  "espn_id": "400828022",
  "date": "Nov 13, 2015",
  "matchup": "LAL @ DAL",
  "headline": "Pachulia's double-double lifts Mavericks over Lakers 90-82",
  "body": "DALLAS -- Zaza Pachulia was the Dallas Mavericks' contingency option when free agent DeAndre Jordan signed with the Los Angeles Clippers over the summer.\nHe didn't play like a backup plan on Friday night.\nPachulia notched his fifth double-double in nine games to help the Mavericks beat the Lakers 90-82 for Los Angeles' fourth straight loss.\nPachulia led the team with season highs of 18 points and 16 rebounds. He was 5 for 7 from the floor and 8 for 11 at the free-throw line.\n\"My numbers don't count; they don't matter without the win,\" Pachulia said. \"Thank you to my teammates for finding me. Thank you to my teammates for missing some good shots offensively so that I could get some offensive rebounds.\"\n\n\"He's been just tremendous,\" Dallas coach Rick Carlisle said.\nKobe Bryant returned to action after missing the Lakers' two previous games with a tight back. He hit his first three shots and finished with 19 points while playing a season-high 32:25.\n\"I felt OK,\" said Bryant, who was also bothered by an upset stomach on Thursday. \"It's frustrating ... but I thought we took a step in the right direction.\"\n\"He's Kobe Bryant,\" Lakers coach Byron Scott said. \"The first 5 or 6 minutes, I was sitting there thinking I can't believe this guy was sick the other day, back was hurting a couple days ago.\"\nDallas extended its record winning streak in the series between the teams to nine.\nJordan Clarkson led the Lakers with 21 points and was 3 of 5 on 3-point shots.\nDeron Williams had 13 points and Dwight Powell collected 10 points and 12 rebounds for Dallas.\nThe Lakers built a 19-9 lead midway through the first quarter but shot a season-low 33 percent for the game.\nThe Mavericks led by as many as 10 in the third quarter. But the Lakers pulled within 71-70 with 8 minutes left in the fourth. With a chant of \"Let's go Lakers!\" building, Los Angeles had a chance to take the lead. But Lou Williams missed a jumper, and Wesley Matthews followed at the other end with a 3-pointer.\nThe Mavericks came off a season-high 55.3 percent shooting game in their win over the Clippers on Wednesday night. They shot 36.6 percent compared to the Lakers' season-low 33.0.\n\"The biggest thing was we couldn't finish in the paint,\" Scott said.\nDirk Nowitzki, Dallas' leading scorer going into the game averaging 18.9 points, was held to nine on 4 for 13 shooting.\nMINUTE BY MINUTE\nDallas' Chandler Parsons played a season-high 17:51 and saw action during both halves for the first time this season as he recovers from off-season knee surgery. \"Take it game by game and see how the knee responds,\" Parsons said.\nNOT SWEET HOME\nThe Lakers' Julius Randle, who grew up in suburban Plano, Texas, played his first NBA game in Dallas and scored six points, shooting 2 for 9. \"Regardless of where we are, since we didn't get the win, it's upsetting,\" Randle said.\nOLDIES BUT GOODIES\nNowitzki and Bryant, both 37, exchanged smiles after Nowitzki spun under Bryant to score on an up-and-under layup during the second quarter. \"It was just two old guys having fun,\" Bryant said. \"I was trying to catch him before he got too high because he's too damn tall.\" Said Nowitzki: \"It's always great to see him. He's a legend.\"\nTIP-INS\nLakers: They outrebounded Dallas 42-41. Los Angeles entered last in the NBA in rebound margin. ... The Lakers finished a five-game road trip 1-4. \"We felt we should have won three of the five,\" Scott said.\nMavericks: Dallas Cowboys quarterback Tony Romo, who's expected to return in a week following a seven-game absence, was seated a few seats from the Mavericks' bench. ... The Mavericks led in bench scoring 33-19.\nUP NEXT\nLakers: Home against Detroit on Sunday night.\nMavericks: At Houston on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764994319.704061
}