{
  "game_id": "0021900401",
  "espn_id": "401161043",
  "date": "Dec 17, 2019",
  "matchup": "SAC @ CHA",
  "headline": "Monk's big 4th quarter lifts Hornets over Kings 110-102",
  "body": "CHARLOTTE, N.C. --  Malik Monk noticed teammates Devonte Graham and Terry Rozier were struggling from the field, so he figured it was time to do something about it.\n\n\"I seen that a little bit when I looked at the (stat) sheet,\" Monk sad. \"We were just off, and there wasn't anybody else scoring. So somebody had to step up and I was able to do that.\"\n\nMonk scored 14 of his season-high 23 points in the fourth quarter on 5-of-5 shooting, and the Charlotte Hornets spoiled De'Aaron Fox's return from injury with a 110-102 win over the Sacramento Kings on Tuesday night.\n\nCody Zeller had 17 points and nine rebounds, and Bismack Biyombo added 10 points and 12 rebounds as the Hornets (13-17) won for the fourth time in five games.\n\nOn a night when Graham and Rozier shot a combined 5 of 21 through the first three quarters, the Hornets needed a spark in the fourth and Monk provided it.\n\nHe scored eight straight points early in the quarter, including a pair of 3s from the same spot just a few feet left of the top of the key. That seemed to ignite Graham, Charlotte's leading scorer this season, who knocked down two more 3s for a 10-point lead with six minutes left as part of a 23-11 run to begin the fourth.\n\nMonk had five his career-high 10 rebounds in the fourth quarter, including a putback dunk off a missed 3-pointer by Rozier to seal the game with 42 seconds left.\n\n\"I was attacking the rim, wasn't being too passive and just looking to score first,\" Monk said.\n\nHornets coach James Borrego said it was Monk's best game of the season.\n\n\"He was fantastic on both ends of the floor,\" Borrego said. \"To have 10 rebounds is just a credit to his engagement on that end of the floor. Rebounding, defending, attacking the rim. I thought he was fantastic tonight. Really proud of his effort tonight. Our bench tonight was great.\"\n\nFox returned after missing 17 games with left ankle sprain and led the Kings (12-15) with 19 points. He played 30 minutes despite supposedly being on a minutes restriction.\n\n\"It was nice to get De'Aaron Fox back out there,\" Kings coach Luke Walton said. \"I thought he looked good and was moving well, created some good looks and opportunities for us and we will continue to get better and learn from this game.\"\n\nTIP-INS\n\nKings: Were outrebounded 51-33.\n\nHornets: F Nic Batum (hand) did not play. ... Charlotte scored 52 points in the paint.\n\nWILLIAMS BIG RETURN\n\nAfter missing the previous five games with knee issues, veteran Charlotte forward Marvin Williams had 16 points, three rebounds and two blocks in his first game back. His 16 points came on 5-of-8 shooting from the field, including 3 of 5 from beyond the arc. This was his sixth game of the season with at least three 3-pointers.\n\nGOING BIG\n\nWith P.J. Washington recovering from a broken finger, the Hornets started two big men in Zeller and Biyombo.\n\n\"It's given us size, its given us rebounding, rim pressure,\" Borrego said. \"We just feel bigger, stronger out there with those two guys. I don't know where we go from here. I thought tonight and last game it gave us at what those two guys can do for us defensively and on the boards. They're both great rebounders and they both play extremely hard.\"\n\nBAGLEY FEELING BETTER\n\nMarvin Bagley III had 14 points and seven rebounds off the bench in 22 minutes for the Kings.\n\n\"I feel great,\" Bagley said of slowly working back into form. \"I feel like how I was before I got hurt conditioning-wise. Just have to keep going and keep pushing.\"\n\nBagley said it might take the Kings some time to get used to him and Fox being back in the rotation for the team to regain its chemistry.\n\n\"Its different because the whole time I was out and De'Aaron was out they had a certain group (on the floor) and we just need to work our way back in,\" Bagley said. \"It changes it up a little bit but I think it's coming along. It's coming along fine. Like I said, we just let this one go. It's nothing to worry about. We just have to fix our mistakes and continue to move forward and try to win.\"\n\nUP NEXT\n\nKings: Travel to Indiana to face the Pacers on Friday night.\n\nHornets: At the Cleveland Cavaliers on Wednesday for the second night of a back-to-back.",
  "source": "espn_api",
  "crawled_at": 1764995900.653594
}