{
  "game_id": "0022300982",
  "espn_id": "401585610",
  "date": "Mar 17, 2024",
  "matchup": "ATL @ LAC",
  "headline": "Dejounte Murray, De'Andre Hunter help Hawks beat Clippers 110-93 to snap 3-game skid",
  "body": "LOS ANGELES -- — Dejounte Murray scored 21 points, De’Andre Hunter added 20 and the Atlanta Hawks beat the Los Angeles Clippers 110-93 on Sunday night to snap a three-game losing streak.\n\n\r\n              Jalen Johnson had 18 points and 12 rebounds, and Clint Capela added 15 points and 13 rebounds for the Hawks.\n\n\r\n              “We were all on the same page. Everybody was hungry to do better, and I think we did that from the first guy all the way down, was talking to each other, was helping each other,” said Murray, who had five 3-pointers, marking a career-high fifth straight game he has knocked down at least four from beyond the arc. “We were active the whole game, and I think that was important for this great team win.”\n\n\r\n              Kawhi Leonard scored 28 points to lead the Clippers, and Paul George had 26. Los Angeles has lost four of its last five and is in fourth place in the Western Conference.\n\n\r\n              “If you don’t play hard and compete and you don’t take care of things you need to take care of on a nightly basis, you can lose. And so tonight was one of those nights,” Clippers coach Tyronn Lue said.\n\n\r\n              Atlanta — which sits in 10th place in the Eastern Conference — had a 31-29 lead at the end of the first quarter, before outscoring the Clippers 30-15 in the second quarter to take a 61-44 advantage into halftime. Atlanta was 11 of 23 from the field in the quarter while the Los Angeles was 6 of 23, including 1 of 10 on 3-pointers.\n\n\r\n              Capela led the way for the Hawks in the first half with 10 points and 10 rebounds.\n\n\r\n              Leonard had 17 points in the first quarter, the second-most points he has had in the opening 12 minutes of a regular-season game in his 12-year career. He had three 3-pointers and completed a four-point play with 40 seconds remaining that tied the score at 29-all.\n\n\r\n              Atlanta then scored the next 10 points to take control.\n\n\r\n              “I've got to give them credit. They started shrinking the floor and bringing in another guy towards me,” Leonard said.\n\n\r\n              Los Angeles got within six midway through the quarter before Atlanta countered with a 17-2 run. A turnaround hook shot by Capela put the Hawks up 61-40 with 2:15 remaining in the first half.\n\n\r\n              Hawks coach Quin Snyder lauded his team's defense. Atlanta forced 16 turnovers, which led to 26 points and also held Los Angeles to a 37.8% shooting rate from the floor (28 of 74).\n\n\r\n              “Our players said some things to each other that we need to do on defense and trying to be really focused on doing those things. And then, offensively really attacking this group. They’re a very good team, so I was happy with how we played,” Snyder said.\n\n\r\n              A 3-pointer by Hunter gave Atlanta its largest lead at 91-62 less than one minute into the fourth quarter. The Clippers went on a 24-9 run, but could not draw closer.\n\n\r\n              James Harden, who missed the Clippers' last two games due to a left shoulder strain, had nine points and nine assists in 36 minutes.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Remain in Los Angeles to face the Lakers on Monday night.\n\n\r\n              Clippers: At Portland on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996270.762951
}