{
  "game_id": "0021801197",
  "espn_id": "401071870",
  "date": "Apr 07, 2019",
  "matchup": "OKC @ MIN",
  "headline": "Westbrook's triple-double lifts Thunder past Wolves 132-126",
  "body": "MINNEAPOLIS --  The Thunder are tough enough to beat when Russell Westbrook and Paul George are rolling. But when their bench players are locked in, too, Oklahoma City can be impossible to stop.\n\nWestbrook and George each scored 27 points and Dennis Schroder had 14 of his 21 in the fourth quarter in a 132-126 victory over the Minnesota Timberwolves on Sunday.\n\nSchroder led a group of Thunder reserves that outscored Minnesota's second team 44-26, and he changed the game early in the fourth quarter by scoring the final 10 points in a 12-0 run that vaulted the Thunder into a 109-101 lead.\n\n\"He's a starter anywhere else,\" George said of Schroder, who started the last two seasons in Atlanta before joining the Thunder mostly in a reserve role. \"He's a big talent. It's a pleasure for us, myself especially as a shooter, to have a guy come in, step in and lift the group when we need baskets the most.\"\n\nWestbrook added 10 rebounds and 15 assists for his 32nd triple-double of the season as the Thunder remained a half-game ahead of San Antonio for seventh place in the Western Conference.\n\n\"That's just what he does,\" said Timberwolves guard Josh Okogie, who spent most of the game guarding Westbrook. \"He has great teammates around him that can make plays. He's a playmaker himself. He's aggressive, rebounds and can get to the rim.\"\n\nKarl-Anthony Towns led Minnesota with 35 points, while Andrew Wiggins scored 24 and Dario Saric added 23. Tyus Jones scored 10 points and tied his career high with 13 assists with zero turnovers for the Wolves.\n\nOklahoma City entered the fourth quarter trailing 97-95, but Schroder quickly took over as the Thunder's pick-and-roll offense gave Minnesota fits. In a four-minute span early in the fourth, Schroder converted three drives to the basket, hit two jump shots, and went 4 for 4 from the free-throw line.\n\n\"Russ and George are already a handful,\" Wiggins said. \"When (Schroder) got going, a quick guard getting to the rim and finishing, it did cause some problems.\"\n\nThe Thunder built a 115-103 lead, and Minnesota didn't get closer than four the rest of the way.\n\n\"Russell got the ball to him in areas of the floor where he can go be who he is,\" Thunder coach Billy Donovan said. \"It's great to have a guy like that because he can generate offense for you by himself.\"\n\nThe Thunder opened the game by making five of their first six shots and led by 14 before Minnesota pushed back and cut the deficit to 38-31 after one. Westbrook and Terrance Ferguson scored nine apiece as the Thunder shot 7 of 13 on 3-point attempts.\n\nLeading 62-60 at halftime, Oklahoma City came out strong again, making its first six shots of the third quarter, including a 3-pointer and a dunk on consecutive possessions by George.\n\nBut Wiggins kept Minnesota afloat by making three straight jump shots. Then after Towns dunked twice, Saric hit four straight 3-pointers to put Minnesota on top 89-83.\n\n\"Some of their shots were tough ones that were going in,\" George said. \"Those kind of shots, you have to just continue on playing, and we did that.\"\n\nGeorge scored eight points in the final 40 seconds to cut Minnesota's lead to 97-95 after three.\n\nAfter scoring 38 points in the first quarter, Oklahoma City closed the game out with a 37-point fourth quarter. It all added up to a Thunder victory and another in a long line of disappointing defensive performances for the Timberwolves this season.\n\n\"It wasn't just in the fourth. It was throughout the whole game, especially that first quarter. We've got to get stops,\" Jones said. \"It's always frustrating. We're scoring enough points. We've got to make it tougher for teams on the defensive side of things.\"\n\nTIP-INS\n\nThunder: The victory helped Oklahoma City avoid being swept by the Wolves this season. Minnesota had won the first three in the series this year. ... George has 288 3-pointers this season, the fifth highest single-season total for any player in NBA history.\n\nTimberwolves: Before the game the Timberwolves honored Jones with the Flip Saunders Legacy Award for his contributions to the community. ... Minnesota has scored at least 100 points in a team-record 29 straight games.\n\nFULL HOUSE\n\nThe Timberwolves rank 28th in the NBA in home attendance but Sunday's game was played before a full house. It didn't hurt that the Twin Cities are teeming with out-of-town basketball fans visiting this weekend to attend the NCAA men's Final Four across town at U.S. Bank Stadium.\n\nUP NEXT\n\nThunder: Host Houston on Tuesday night.\n\nTimberwolves: Host Toronto on Tuesday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994542.004009
}