{
  "game_id": "0021500500",
  "espn_id": "400828387",
  "date": "Jan 02, 2016",
  "matchup": "MIL @ MIN",
  "headline": "Bucks shake off Mayo's ejection to beat Timberwolves 95-85",
  "body": "MINNEAPOLIS --  After getting forcibly removed from the court during a volatile outburst of frustration, Milwaukee Bucks guard O.J. Mayo apologized for the distraction he caused.\n\nAfter giving up a 17-point lead and wilting in the second half, Minnesota Timberwolves interim coach Sam Mitchell thought his players needed to apologize as well.\n\nGreg Monroe had 19 points and 10 rebounds to help the Bucks overcome Mayo's wild ejection in a 95-85 victory over the Timberwolves on Saturday night.\n\nJohn Henson scored 15 points for the Bucks, and Khris Middleton added 13. Mayo had to be pushed off the court by coaches and security staff after he picked up two technical fouls in the first quarter.\n\n\"It was a poor decision on my end to definitely disrespect the game,\" Mayo said. \"Poor decision of mine to misrepresent the Bucks, myself, my family, obviously my teammates.\"\n\nRicky Rubio had 14 points, seven assists and six rebounds for the Timberwolves, who led 22-5 in the first quarter. Andrew Wiggins added 19 points on 7-for-17 shooting.\n\nMitchell said he left his young players on the court in the fourth quarter because he was \"hoping a little embarrassment set in on how they were playing.\"\n\n\"If they (weren't), we've got the wrong guys on our team,\" Mitchell said.\n\nGiannis Antetokounmpo had 11 points and nine rebounds, and Jerryd Bayless scored 13 for Milwaukee.\n\nKarl-Anthony Towns had eight points and 10 rebounds for Minnesota but shot just 4 of 17. The Wolves were 3 of 14 on 3-pointers in falling to 5-13 at home.\n\n\"We played too cool, thinking we don't need to be aggressive all the time,\" Rubio said. \"This league is built for men. We weren't men tonight.\"\n\nMayo picked up a technical foul from Pat Fraher after arguing for a foul call on a drive to the basket. As the game went to break, referee Jason Phillips gave Mayo another technical, which prompted the ejection. Mayo spun back toward the officiating crew, and coaches Eric Hughes and Joe Prunty had to try to restrain him by yanking on his jersey.\n\nMayo made several more efforts to get back onto the court and finally was forced down the tunnel to the locker room by a security official.\n\n\"That's my guy. He's good,\" Mayo said of Hughes. \"Things happen, and he has my back. And you know, I have his back. That said, bad decision by me but happy we got the win.\"\n\nIt was the latest outburst from Mayo, who got into a heated confrontation with Kings center DeMarcus Cousins in a back hallway this season.\n\n\"In the moment, that's obviously not what we want to do,\" Prunty said. \"We have to stay within our character. Juice is an emotional player, and we have to, we need him to be aggressive, assertive. Obviously this wasn't exactly what we like. But he'll be fine, and you know, it's something, it happens sometimes.\"\n\nMayo's exit did seem to wake up the Bucks after a dreadful start to the game. They missed their first 11 shots, trailed by 17 only 9 minutes in and didn't make a field goal until 3:18 remained in the first quarter, the longest drought to start a game since the New Orleans Hornets went 9:18 against Orlando in 2006.\n\nBut after going 3 for 17 in the first quarter, the Bucks went 10 for 17 in the second to climb back into it.\n\nThey opened the fourth period with an 11-0 surge to take an 83-70 lead and never looked back.\n\nMITCHELL'S CAMPAIGN\n\nMitchell turned a question about the team's defense during his pregame availability with reporters into a monologue about the difficulty of coaching young players today. He said coaching continuity is important to establish a system that players can grow into. Wolves owner Glen Taylor has said he will wait until after the season to make an evaluation of the coaching situation in lieu of Flip Saunders' death on Oct. 25.\n\n\"My job is to coach the team and do what I think is right to do,\" Mitchell said. \"I don't worry about whether I'm going to be here or not next year. My job is to teach them to the best of my ability so that whoever is coaching this team, whether it's me or anybody else, at least they come in the door and see that these guys have an idea of how to play.\"\n\nTIP-INS\n\nBucks: Milwaukee shot 8 for 16 from 3-point range. ... Minneapolis native Rashad Vaughn had five points in 16 minutes.\n\nTimberwolves: The 8:42 that the Wolves kept the Bucks from making a field goal was the longest stretch to start a game since the franchise moved to its automated statistics system in 1996-97. ... Wiggins entered shooting 18 percent from 3-point range over his previous 23 games. He went 0 for 3.\n\nUP NEXT\n\nBucks: Host San Antonio on Monday.\n\nTimberwolves: Visit Philadelphia on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994063.17821
}