{
  "game_id": "0021800645",
  "espn_id": "401071321",
  "date": "Jan 14, 2019",
  "matchup": "BKN vs. BOS",
  "headline": "Russell scores 34, Nets send Celtics to 3rd straight loss",
  "body": "NEW YORK --  The Boston Celtics had been beating the Brooklyn Nets for years, first in trades and then in games.\n\nWith D'Angelo Russell on a roll and Kyrie Irving on the bench in street clothes, Brooklyn finally broke through.\n\nRussell scored 18 of his 34 points in the third quarter and the Nets ended a 10-game losing streak to Boston with a 109-102 victory on Monday night, sending the Celtics to a winless three-game road trip.\n\nThe Nets hadn't beaten Boston since Jan. 2, 2016, before Kenny Atkinson became coach.\n\n\"Listen, these guys think they can do something special and so far we're making strides,\" Atkinson said of his team that is now seventh in the Eastern Conference.\n\nWith Irving nursing a bruised right quadriceps, the Nets blew open the game with a 15-0 run in the third quarter and outscored the Celtics 44-21 in the period.\n\nJarrett Allen added 19 points and 12 rebounds for the Nets, who have won nine of their last 10 home games. Rookie Rodions Kurucs also scored 19 points.\n\nJayson Tatum scored 34 points for the Celtics, who dropped games at Miami and Orlando to start their trip. Jaylen Brown added 22 points.\n\n\"I can't really put my finger on it,\" the Celtics' Marcus Morris said. \"Yeah, kind of surprised because I thought we were moving in a good direction.\"\n\nBoston was off from the start, with Brad Stevens calling a timeout just 29 seconds into the game after a turnover led to Russell's 3-pointer and a 3-0 Brooklyn lead.\n\nRussell made seven 3-pointers in his second-highest point total in a Nets uniform.\n\n\"I trust my craft and I know what I'm capable of,\" said Russell, adding he believed he should be an All-Star this season.\n\nBut the game didn't get away from the Celtics until the third, when Russell hit three 3-pointers in the 15-0 burst that made it 76-59. Brooklyn then scored seven straight after Terry Rozier's basket, pushing it to 83-61.\n\n\"We went on a drought and Brooklyn just blew us out of the water,\" Stevens said.\n\nNets fans have watched their team stumble and the Celtics soar as the result of the 2013 trade that sent Paul Pierce and Kevin Garnett to Brooklyn, and a number of draft picks to Boston.\n\nSo a group of fans enjoyed the rare chance to rub it in as the Nets were romping, with a fairly loud \"Kyrie's Leaving! Kyrie's Leaving!\" chant breaking out early in the fourth quarter, when the Nets led by 27.\n\nIrving, a free agent after the season, was noticeably frustrated with the Celtics' execution at the end of their loss in Orlando on Saturday.\n\nBut it was almost a premature celebration, as Boston charged all the way back to get within seven in the final minute.\n\nTIP-INS\n\nCeltics: Boston also played without Marcus Smart because of an illness. ... Aron Baynes, who has a broken bone in his left hand, will be re-evaluated Tuesday, but Stevens said he didn't know what steps Baynes would have to take to be cleared for a game.\n\nNets: Reserve G Shabazz Napier was sidelined by right hamstring tightness. Fs Rondae Hollis-Jefferson and Jared Dudley and G Allen Crabbe remained out with injuries. ... The Nets won for the first time in five games this season on a Monday. They had their most lopsided loss of the season on the previous Monday, falling 116-95 in Boston.\n\nTV TALENTS\n\nThe TV play-by-play announcers for both teams were announced Monday as the sportscasters of the year in their respective states, as voted by the National Sports Media Association. Ian Eagle of Yes Network was honored for the fourth time as New York Sportscaster of the Year, having also won in 2013, 2014 and 2016. Mike Gorman of NBC Sports Boston won for the second time in Massachusetts.\n\nUP NEXT\n\nCeltics: Host Toronto on Wednesday.\n\nNets: Visit Houston on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995412.856192
}