{
  "game_id": "0021800910",
  "espn_id": "401071583",
  "date": "Feb 26, 2019",
  "matchup": "OKC @ DEN",
  "headline": "Jokic scores 36 points, Denver beats Thunder 121-112",
  "body": "DENVER --  Nikola Jokic is making his presence felt down the stretch, and that's the way the Denver Nuggets want it.\n\nJokic scored 36 points, including five free throws in the final moments, and the Nuggets fended off Oklahoma City's late rally for a 121-112 victory Tuesday night in a matchup between two of the top three teams in the Western Conference standings.\n\n\"When the game's on the line, we're going to one guy: Nikola Jokic,\" Nuggets coach Michael Malone said. \"He's been able to score in the post against single coverage, double teams. We've won so many close games ... and a lot of those you can attribute to Nikola being effective and efficient in the post and score, make the right play or go to the foul line and make a free throw.\"\n\nJokic said he's getting to the point where he's looking for the ball and anticipating it will come his way at crunch time, and it's a role he is embracing.\n\n\"Even if I don't score, I think I can bring something. I can make a good pass,\" Jokic said. \"I think the coaches are comfortable to call plays for me and I think the team trusts me.\"\n\nJokic added 10 assists and nine rebounds to finish just shy of his 13th triple-double this season for the Nuggets who won their fifth straight and ninth in a row at home. They improved to 3-0 against the Thunder this season, clinching the four-game season series between the Northwest Division rivals.\n\n\"To have beaten them three times this year says a lot about our team. I don't even think we've played our best basketball yet,\" Malone said.\n\nWill Barton added 23 points and Jamal Murray 20 for Denver, which extended its division lead over the Thunder to four games.\n\nPaul George had 25 points to lead Oklahoma City which fought back from an 18-point deficit in the second half but could not sustain its rally in the late going.\n\nRussell Westbrook finish an assist shy of a triple-double with 22 points, 14 rebounds and nine assists. Jerami Grant added 21 points.\n\nOklahoma City got back into the game by turning up its defense, forcing five turnovers in six Denver possessions in one stretch, to pull into a 97-all tie on a 3-pointer by Dennis Schroder with 6:02 left to play.\n\nWestbrook followed by hitting a 3-pointer to give the Thunder its first lead since early in the first half.\n\nDenver, though, fought back, retaking the lead on a 3-pointer by Murray.\n\nThe game remained tight down the stretch. Murray hit another 3-pointer and Jokic put in a layup around a Westbrook layup for a 112-106 Denver lead with 1:36 remaining. Jokic helped Denver solidify its lead and quash Oklahoma City's comeback in the final moments by making five of six free throws to boost the Nuggets' advantage to 117-108 with 44 seconds remaining.\n\n\"We had some things that we were able to control that we didn't do a good enough job of, and that part of it was disappointing,\" Thunder coach Billy Donovan said. \"Because the guys, I thought, battled and worked so hard to get back in the game to give ourselves a chance.\"\n\nTrailing by 13 at the half, the Thunder scored the first eight points of the third quarter, including 3-pointers by Westbrook and George to equal the number of 3s Oklahoma City had in the first half. But the Nuggets' got going on offense again and pulled in front by as many as 18 points before George hit a 3-pointer from the half-court line as the Thunder pulled to 91-78 going into the fourth quarter.\n\nJokic connected on successive 3-pointers in the last 56 seconds of the second quarter, and Denver moved in front 64-51 at the half.\n\nKEY CONTRIBUTOR\n\nJokic wasn't the only one with impact plays down the stretch. Paul Millsap, who had 12 points and 10 rebounds, delivered a huge block in the fourth quarter to help blunt Oklahoma City's comeback and in the late going grabbed an offensive rebound and put back a key layup. \"I just thought all his hustle plays down the stretch were tremendous for us,\" Malone said.\n\nTIP-INS\n\nThunder: G/F Andre Roberson, who has yet to play this season because of a left patellar tendon injury, has resumed light basketball activities and the Thunder remain hopeful he can return this season. \"We're all optimistic that maybe at some point, we can get him back,\" Thunder coach Billy Donovan said. \"He's working really hard. He's making strides. How that progresses, we'll have to wait and see, but to me it's encouraging to see he is kind of jogging around a little bit out there and he is shooting the ball.\"\n\nNuggets: F Trey Lyles missed a third consecutive game with a left hamstring strain.\n\nUP NEXT\n\nThunder: Return home to play the Philadelphia 76ers on Thursday night.\n\nNuggets: Host the Utah Jazz on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994566.849893
}