{
  "game_id": "0022401013",
  "espn_id": "401705579",
  "date": "Mar 20, 2025",
  "matchup": "CHI @ SAC",
  "headline": "Coby White scores 35 points to lead the Chicago Bulls to a 128-116 win over the Sacramento Kings",
  "body": "SACRAMENTO, Calif. -- — Coby White scored 35 points as the Chicago Bulls beat the Sacramento Kings 128-116 on Thursday night.\n\n\r\n              Kevin Huerter scored 25 points while adding five rebounds, seven assists, and four steals. Nikola Vucevic shot 9 for 14, including 4 for 5 from beyond the arc to finish with 24 points.\n\n\r\n              Malik Monk led the way for the Kings with 34 points and five assists. Sacramento also got 22 points and six rebounds from Trey Lyles.\n\n\r\n              The Bulls entered halftime down 64-55. Vucevic paced the team in scoring in the first half with 11 points. An 11-0 run in the third quarter turned a five-point deficit into a six-point lead for the Bulls. They outscored the Kings by 21 points in the final two quarters, as White led the way with 31 second-half points.\n\n\r\n              Takeaways\r\n              Bulls: Chicago took advantage of Sacramento center Domantas Sabonis sitting out with a sprained right ankle. The Bulls got a strong offensive performance from Huerter, who scored one short of his season high on 10-for-16 shooting. It was his highest point total since Dec. 8.\n\n\r\n              Kings: Sacramento followed a surprise win over East-leading Cleveland on Wednesday with a poor defensive effort against the Bulls. The Kings allowed Chicago to shoot 52.3% from the field.\n\n\r\n              Key moment\r\n              Huerter’s driving layup with 8:15 remaining gave the Bulls the lead for good.\n\n\r\n              Key stat\r\n              The Bulls shot 42.9% from the 3-point line (15 for 35).\n\n\r\n              Next up\r\n              The Bulls travel to take on the Lakers in their next game on Saturday night. The Kings play host to the Milwaukee Bucks on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_api",
  "crawled_at": 1764997032.9810119
}