{
  "game_id": "0021801139",
  "espn_id": "401071812",
  "date": "Mar 30, 2019",
  "matchup": "DET vs. POR",
  "headline": "Jackson, Pistons end Blazers' 6-game streak with 99-90 win",
  "body": "DETROIT --  On the night the Detroit Pistons honored the \"Bad Boys\", the current roster had to play the same kind of defense that led to championships in 1989 and 1990.\n\nThe Pistons missed their first 13 field-goal attempts and didn't make a 3-pointer until the second half but were still able to end the Portland Trail Blazers' six-game winning streak with a 99-90 victory on Saturday night.\n\n\"Our defense saved us tonight,\" Pistons coach Dwane Casey said. \"We couldn't make a shot, but we stepped up on the other end and kept ourselves in the game.\"\n\nOne of the reasons for Detroit's offensive struggles was the unexpected absence of Blake Griffin, who was a late scratch with a sore left knee.\n\n\"He told me he would give it a try in warmups, but he couldn't go,\" Casey said. \"That's a shock for the rest of the team -- one minute he's out there and then he's not.\n\nReggie Jackson scored 28 points, Andre Drummond had 22 points and 19 rebounds, and the Pistons won their 11th straight home game to maintain a half-game lead over the Brooklyn Nets for the sixth seed in the Eastern Conference.\n\n\"We knew we had to step it up without Blake,\" Jackson said. \"It's tougher for us when he's not out there, and we weren't hitting shots, so we had to grind it out and get this win.\"\n\nDamian Lillard scored 23 points and Enes Kanter added 20 points and 15 rebounds for Portland, which fell a half-game behind the Houston Rockets for the third seed in the Western Conference.\n\n\"We prepared for Blake to play, but that's still a good NBA team that can win games without him,\" Maurice Harkless said. \"He's one of their better players, so it is good for us, but we still didn't come away with a win.\"\n\nJackson hit a 17-foot jumper with 4:48 left in the first quarter for Detroit's first basket. The Pistons shot 14.3 percent in the quarter, but only trailed 14-11 as the Trail Blazers managed just 25.9 percent.\n\n\"That was a brutal quarter of basketball,\" Portland coach Terry Stotts said. \"We had a lot of opportunities to take a bigger lead, but we didn't take advantage.\"\n\nThings didn't get much better in the second quarter, as the teams combined to go 1 for 22 on 3-pointers in the half. Portland scored 30 of its 34 points in the paint to take a three-point lead.\n\nJackson's dunk gave the Pistons their first lead of the game at 52-51 with 4:41 left in the third, and he and Drummond finished with 23 points in the quarter to help Detroit take a 66-59 lead.\n\nPortland never seriously challenged in the fourth quarter.\n\n\"We're trying to play our best basketball right now,\" Jackson said. \"We need to find a way to get into the playoffs and then go from there.\"\n\nTIP-INS\n\nTrail Blazers: Portland forced 32 missed shots in the first half and held Detroit to only three offensive rebounds. . Lillard scored 20-plus points for the 57th time this season.\n\nPistons: The Pistons celebrated the 30th anniversary of the 1989 championship with a halftime ceremony. Isiah Thomas spoke on behalf of his teammates and recognized Drummond, who came out of the locker room to watch.\n\nUP NEXT\n\nTrail Blazers: Visit the Indiana Pacers on Monday.\n\nPistons: Visit the Minnesota Timberwolves on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994648.1621802
}