{
  "game_id": "0022400249",
  "espn_id": "401704815",
  "date": "Nov 18, 2024",
  "matchup": "ORL @ PHX",
  "headline": "Wagner scores 32 points, Black adds 20 as Magic beat the Suns 109-99",
  "body": "PHOENIX -- — Franz Wagner scored 32 points, Anthony Black added 20 and the Orlando Magic beat the struggling Phoenix Suns 109-99 Monday night.\n\n\r\n              Tyus Jones had 18 points for Phoenix. Devin Booker — coming off a season-high 44 points — had 17.\n\n\r\n              The Suns had three starters out due to injury, including Kevin Durant, Bradley Beal and Jusuf Nurkic. It was Durant’s sixth straight game out of the lineup. Phoenix is 1-5 over that stretch, including losing four straight.\n\n\r\n              Orlando was without leading scorer Paolo Banchero, who has an oblique injury.\n\n\r\n              The Magic opened the third quarter with a 64-48 lead and then scored the first five points for a 19-point edge. The closest Phoenix got down the stretch was 98-91 with 3:36 left after Booker hit a 3-pointer.\n\n\r\n              Takeaways\r\n              Magic: Orlando showed it can win on the road against a strong, although depleted team. Since March 29 last season, the Magic won 14 consecutive home games, including five straight this season. After the win against Phoenix, they are 3-14 away from the Kia Center in the same time frame.\n\n\r\n              Suns: Phoenix is in the midst of a injury-filled tailspin. The one silver lining is several young players are getting experience. Rookie Oso Ighodaro had 12 points and seven rebounds.\n\n\r\n              Key moment\r\n              Orlando was leading 54-46 with 2:23 left in the second quarter and went on a 10-2 run to take a 64-48 lead at the half.\n\n\r\n              Key stat\r\n              The last six games Orlando has held their opponents under 100 points and in three of those games under 90 points.\n\n\r\n              Up Next\r\n              The Suns host the Knicks on Wednesday, while the Magic play on the road against the Clippers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997576.149378
}