{
  "game_id": "401809981",
  "espn_id": "401809981",
  "date": "Oct 28, 2025",
  "matchup": "OKC vs SAC",
  "headline": "Shai Gilgeous-Alexander's 31 points lead Thunder to comeback win over Kings, help OKC improve to 5-0",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 31 points, and the Oklahoma City Thunder stayed undefeated by rallying to beat the Sacramento Kings 107-101 on Tuesday night.\n\n\r\n              Gilgeous-Alexander went 1 for 9 from the field in the third quarter, but bounced back and went 4 for 6 with nine points in the fourth to help the defending NBA champs improve to 5-0.\n\n\r\n              Aaron Wiggins and Ajay Mitchell each scored 18 points for the Thunder, one of four unbeaten teams in the league.\n\n\r\n              Zach LaVine scored 23 points, DeMar DeRozan scored 19 and Domantas Sabonis added 10 points and 18 rebounds for the Kings. Former Thunder star Russell Westbrook had 16 points and nine rebounds in his first start of the season for Sacramento. \n\n\r\n              The Thunder won at Dallas on Monday night and were short-handed on Tuesday. Forward Chet Holmgren, the team's No. 2 scorer, sat out with lower back soreness. Oklahoma City already had been missing two key rotation players in 2025 All-Star Jalen Williams (recovery from right wrist surgery) and sharpshooting guard Isaiah Joe (bruised left knee).\n\n\r\n              It looked like the schedule and the injuries might have caught up with Oklahoma City. The Kings led 62-58 at halftime after shooting 56.1% from the field.\n\n\r\n              Oklahoma City took a 71-70 lead in the third quarter on two free throws by Lu Dort, but the Kings immediately responded with an 11-0 run. Sacramento took an 83-80 lead into the fourth.\n\n\r\n              The Thunder trailed for much of this game before Dort's 3-pointer put them up 99-97 in the closing minutes. Alex Caruso's 3-pointer made it 104-99 with 46 seconds to play, and Gilgeous-Alexander's stepback 3-pointer with 16 seconds left extended the lead to six.\n\n\r\n              Up next\r\n              Sacramento: Visits the Chicago Bulls on Wednesday night.\n\n\r\n              Oklahoma City: Hosts the Washington Wizards on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042520.135347
}