{
  "game_id": "401810115",
  "espn_id": "401810115",
  "date": "Nov 19, 2025",
  "matchup": "NO vs DEN",
  "headline": "Jokic's triple-double and Watson's career-high 32 points push the Nuggets past the Pelicans, 125-118",
  "body": "NEW ORLEANS -- — Nikola Jokic had 28 points, 12 assists and 11 rebounds, and the Denver Nuggets defeated the New Orleans Pelicans 125-118 on Wednesday night.\n\n\r\n              Peyton Watson scored a career-high 32 points as Denver won for the eighth time in nine games. Jamal Murray had 14 points, including a pair of free throws with 31 seconds left.\n\n\r\n              Zion Williamson scored 14 points for New Orleans in 29 minutes in his return from a left hamstring injury that had sidelined him for eight games.\n\n\r\n              Rookie Derik Queen, who started opposite Jokic at center, scored a season-high 30 points to go with nine rebounds. He also helped cause Jokic to commit nine turnovers and foul out with 2:44 left.\n\n\r\n              Trey Murphy III added 23 points for the Pelicans, who lost their seventh straight and fell to 0-3 under interim coach James Borrego. \n\n\r\n              After trailing by as many as 19, New Orleans reduced its deficit to single digits in the final minutes, but former Pelican Jonas Valanciunas, who scored 14 points, hit a pair of clutch jumpers for the Nuggets.\n\n\r\n              Pelicans rookie Jeremiah Fears scored 16, giving the guard 11 or more points in all but one of New Orleans' 15 games this season.\n\n\r\n              Watson scored 11 of his points in the first six minutes of the second half, when the Nuggets widened their lead from 62-58 at halftime to 81-70.\n\n\r\n              That's when Jokic started to take over, hitting a putback layup, a 7-foot pull-up jumper and a 3 that made it 93-76.\n\n\r\n              With Williamson back in the starting lineup, the Pelicans raced to a 13-point lead when Herb Jones' 3 made it 23-10 in the first quarter. But Denver steadily erased its deficit and took the lead for good when Watson's 3 made it 51-49 with 3:02 left in the second quarter.\n\n\r\n              Up next\r\n              Nuggets: Visit the Houston Rockets on Friday night in NBA Cup West Group C play.\n\n\r\n              Pelicans: Visit the Dallas Mavericks on Friday night in NBA Cup West Group B play.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042657.309908
}