{
  "game_id": "0022000009",
  "espn_id": "401266795",
  "date": "Dec 25, 2020",
  "matchup": "LAC @ DEN",
  "headline": "Leonard leaves bloodied, but Clippers beat Nuggets 121-108",
  "body": "DENVER -- — Kawhi Leonard was hurt and the Denver Nuggets were mounting a rally like they did three months ago.\n\n\r\n                    This time, the Los Angeles Clippers didn’t allow Denver to complete the comeback.\n\n\r\n                    Leonard had 21 points before taking an elbow to the face in the fourth quarter, Paul George scored 23 points and had nine assists, and Los Angeles beat the Nuggets 121-108 on Friday night.\n\n\r\n                    It was the second straight big win for LA, which beat the Lakers on Tuesday night. \n\n\r\n                    “We’re a different team than last year,” George said.\n\n\r\n                    The Clippers led by 11 with 6:11 left Friday night when Serge Ibaka went up for a rebound and caught the side of his teammate’s face with his right elbow. Leonard lay bleeding on the court before walking to the locker room.\n\n\r\n                    “He got up and walked off the floor, so he’s going to be good,” LA coach Tyronn Lue said.\n\n\r\n                    Leonard was ruled out shortly thereafter and was being evaluated postgame, but it did put a scare into George.\n\n\r\n                    “Really worried. I was thinking the worst,” George said. “I didn’t know if he was concussed or what actually happened, I just saw him laying on the ground. That was first and foremost, making sure he was OK.”\n\n\r\n                    The Clippers didn’t need Leonard to close out a Nuggets team that upset them in the second round of the Western Conference semifinals last season.\n\n\r\n                    Nikola Jokic finished with 24 points, 10 assists and nine rebounds for Denver, which has dropped its first two games of the season. Jamal Murray added 23 points, 13 coming in the fourth.\n\n\r\n                    The Nuggets rallied from double-digit second-half deficits in Games 5, 6 and 7 of the second-round series in September, winning all three and wiping out LA’s 3-1 lead to advance to the Western Conference finals. It was a surprising end for a team many thought could beat the Lakers and advance to the NBA Finals.\n\n\r\n                    George said he has put that disappointment in the past.\n\n\r\n                    “I buried last year, left last year in the bubble,” he said. “This is a new season, new team, new goals, new everything. I was ready and poised and confident coming into this year, and I was prepared coming into this season.”\n\n\r\n                    Denver wasn’t able to do it again but made a run after trailing by 24 late in the third quarter. The Nuggets used an 11-0 run into early in the fourth, and two 3-pointers by Murray sliced a 98-74 deficit to 106-95 with 7:35 left. \n\n\r\n                    “When you’re down 25, it’s about pride and about effort,” Murray said. “We wanted to play hard and let the lead take care of itself. We saw the lead chip away like we did in the playoffs, we just couldn’t get over the hump.”\n\n\r\n                    Leonard went out soon after but Denver never got the deficit under 10.\n\n\r\n                    “They made a run, we lost Kawhi so we could have lost our composure, lost our game, but we took a good timeout,” Nicolas Batum said. “We kept moving the ball and made big shots.”\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: F Marcus Morris (sore right knee) missed his second straight game, but coach Lue said he is day-to-day. “He’s been doing his own rehab with the sports science team and he’s progressing,” Lue said. \n\n\r\n                    Nuggets: F JaMychal Green sat out with a left calf strain. Green, who played for the Clippers last season, has yet to play in the regular season after signing with Denver in the short offseason.\n\n\r\n                    SCROOGED AGAIN\n\n\r\n                    Denver was playing on Christmas night for the second straight season, with both ending in double-digit losses. Last year the New Orleans Pelicans beat the Nuggets 112-100 in Denver, stopping a seven-game winning streak.\n\n\r\n                    “Two years in a row we weren’t ready to play on Christmas night,” coach Michael Malone said. “Bah humbug.”\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Host the Dallas Mavericks on Sunday night.\n\n\r\n                    Nuggets: Host the Houston Rockets on Monday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997711.95452
}