{
  "game_id": "0022201029",
  "espn_id": "401469184",
  "date": "Mar 14, 2023",
  "matchup": "TOR vs. DEN",
  "headline": "VanVleet has 36, Raptors hand Nuggets 4th straight loss",
  "body": "TORONTO -- — Fred VanVleet scored 36 points, O.G. Anunoby had 24 and the Toronto Raptors used a franchise-record, 49-point first quarter to beat Denver 125-110 on Tuesday, handing the slumping Nuggets their season-high fourth straight loss.\n\n\r\n              Nikola Jokic scored 28 points, Michael Porter Jr. added 23 and Aaron Gordon had 18 for the Western Conference-leading Nuggets, who are winless since a March 6 home victory over the Raptors.\n\n\r\n              “Right now we’re just in chill mode, and you can’t be in chill mode with 13 games to go in the season,” Nuggets coach Michael Malone said. “We’ve got to try to find a way to get our swagger back.”\n\n\r\n              Denver opponents have scored 100 or more points in five straight games, and 120 or more in each of the past three.\n\n\r\n              “Maybe we’ve gotten a little soft with success,” Malone said. “We’ve been on cruise control for so long, No. 1 in the West since like December 15. I just told our players we’ve gotten away from who we are.”\n\n\r\n              Malone said several Denver veterans spoke up after the game, urging the team to play better. Asked whether he thought the Nuggets needed to hear those words, Jokic was clear, saying: “Yes.”\n\n\r\n              VanVleet shot 13 for 22 and made a season-high eight of his 12 attempts from distance as Toronto extended its home winning streak to five.\n\n\r\n              VanVleet had seven assists, three steals and just two turnovers in nearly 38 minutes.\n\n\r\n              “Freddie called an incredible game tonight,” Raptors coach Nick Nurse said. “He really had us incredibly organized. He found a bunch of little wrinkles.”\n\n\r\n              Jakob Poeltl had 12 points and 11 rebounds, Pascal Siakam scored 12 points and Gary Trent Jr. had 11 for the Raptors, who never trailed. \n\n\r\n              Denver guard Jamal Murray shot 5 for 18 and scored 14 points and Bruce Brown added 12, but the Nuggets lost the opener of a season-high, five-game road trip.\n\n\r\n              The Raptors shot 20 for 28 in the first to lead 49-30 after one.\n\n\r\n              “We just dug too much of a big hole and couldn’t climb the mountain from there,” Murray said.\n\n\r\n              Toronto was up 88-64, its biggest lead of the game, after Siakam’s basket with 8:16 left in the third. Denver used a 28-10 run to cut the gap to 98-92, but the Nuggets couldn’t keep it up in the fourth.\n\n\r\n              “When you expend so much energy getting back in the game you have nothing left to finish,” Malone said. \n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Jokic had eight rebounds and seven assists. … Murray led Denver with nine assists. … Shot 1 for 6 from 3-point range in both the first and second quarters. Denver finished 6 for 25 from long range. … Made 14 turnovers, leading to 25 points. \n\n\r\n              Raptors: Shot 20 for 28 in the first. … Toronto’s previous record for points in a quarter was 48, set in the first quarter at New Jersey on Jan. 11, 1997. … The Raptors returned from a five-game road trip to begin a stretch that sees them play seven of eight at home. Toronto is 21-13 at home this season.5 \n\n\r\n              HOMECOMING\n\n\r\n              After sitting out the fourth quarter of Sunday’s loss to Brooklyn because of soreness in his left knee, Murray returned to the lineup to play his first game north of the border since December 2018, and had some 40 to 50 family and friends on hand to watch him.\n\n\r\n              “It’s always nice being home, seeing everybody, seeing people I haven’t seen for years,” Murray said. “It always brings you back to earth.”\n\n\r\n              Murray is from Kitchener, Ontario, about 65 miles west of Toronto. He missed the last part of the 2020-21 season and all of last season after surgery to repair a torn ACL in his left knee. Still, Malone said before the game that “there was no way (Murray) wasn’t playing.” Murray received a warm ovation when the starters were introduced. \n\n\r\n              DUNK OF THE DAY\n\n\r\n              Anunoby wowed the crowd with a one-handed putback slam on Trent’s missed shot in the second. \n\n\r\n              UP NEXT Nuggets: At Detroit on Thursday night. Raptors: Host Oklahoma City on Thursday night. ------ AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994021.6381838
}