{
  "game_id": "0022000838",
  "espn_id": "401307634",
  "date": "Apr 14, 2021",
  "matchup": "MIA @ DEN",
  "headline": "Jokic's triple-double leads Nuggets over Heat 123-106",
  "body": "DENVER -- — Nikola Jokic had 17 points, 11 assists and 10 rebounds for his 15th triple-double of the season to lead the Denver Nuggets over the Miami Heat 123-106 on Wednesday night.\n\n\r\n                    Michael Porter Jr. added 25 points and 10 rebounds for the Nuggets. Six Denver players scored in double figures in the team’s first game without Jamal Murray, who is out for the rest of the season.\n\n\r\n                    “You play to win a championship. One person down, next man up. The goal’s the same,” Porter said. “I think we have the talent to do it.”\n\n\r\n                    Murray was hurt in the final minute of Monday’s loss at Golden State when he planted his left foot to go up for a layup. An MRI confirmed an ACL tear and dealt Denver’s title hopes a serious blow.\n\n\r\n                    “Jamal’s devastated, understandably so,” coach Michael Malone said before the game. “I think the team is also a little. We understand the importance of Jamal Murray. We’re a better team when Jamal’s healthy.”\n\n\r\n                    The Nuggets have won 18 of their last 23 and ended a two-game skid. Before Murray went down, Denver was rising in the Western Conference and considered a legitimate threat to contend for a title. \n\n\r\n                    “We’re underdogs,” Malone said. “They want to talk about other teams, let them talk about them. As devastated as we are for Jamal Murray, we still have a tremendous opportunity in front of us. And if we waste that, it will be a travesty.”\n\n\r\n                    Jimmy Butler had 13 points and nine assists for the Heat a night after he rolled his right ankle in a loss at Phoenix. Bam Adebayo led Miami with 21 points and Kendrick Nunn added 16 points.\n\n\r\n                    “We can be a better team. We still haven’t put together a game of Miami Heat basketball for 48 minutes,” Adebayo said. “When we start doing that, that’s when we’ll start adding these wins up.”\n\n\r\n                    The Nuggets led by 11 at halftime and stretched it to 15 late in the third quarter. JaMychal Green and P.J. Dozier made 3-pointers early in the fourth to open up a 20-point lead. \n\n\r\n                    Green finished with 17 points, Aaron Gordon added 16 points and Dozier scored 15. Denver had 33 assists, 10 in the third quarter to pull away.\n\n\r\n                    “They’re a unique team, the way they pass the ball, the way they cut off the ball,” Miami coach Erik Spoelstra said. “They really make you have to concentrate and trust what you do for the entire possession. They were able to exploit a few of those things against us in the second half.”\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: G Goran Dragic was unavailable so he could rest with Miami playing on consecutive nights. “This situation is just something we want to monitor and be smart about,” Spoelstra said before the game. “He’s feeling great. Our schedule is pretty busy, and we think this will help.” ... G Victor Oladipo (right knee soreness) is not on the road trip.\n\n\r\n                    Nuggets: G Shaquille Harrison was inactive for the fourth straight game due to health and safety protocols. ... Denver is 10-2 in its last 12 home games after starting the season 9-8 at Ball Arena.\n\n\r\n                    WEIGHING THE OPTIONS\n\n\r\n                    Malone was asked before the game about the possibility the team will sign guard Austin Rivers to a 10-day contract. Malone said it will be difficult to integrate a new player with just 17 games left in the regular season.\n\n\r\n                    “There’s not a lot of practice time, because it seems like we play every day, every other day,” he said. “It makes it challenging to bring anybody in at this point.”\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: At Minnesota on Friday to wrap up a four-game trip. The Timberwolves have won four straight over Miami.\n\n\r\n                    Nuggets: At Houston on Friday.\n\n\r\n                    —",
  "source": "espn_api",
  "crawled_at": 1764996764.495182
}