{
  "game_id": "0021500343",
  "espn_id": "400828230",
  "date": "Dec 11, 2015",
  "matchup": "PHX vs. POR",
  "headline": "McCollum's 3-point shooting helps Blazers beat Suns 106-96",
  "body": "PHOENIX --  The Portland Trail Blazers had a couple of hurdles to overcome Friday night.\n\nThey'd lost the first two meetings with the Phoenix Suns this season by double digits. The Blazers also had struggled recently in close road games.\n\nThe Blazers made sure Friday's game wouldn't go down to the wire -- and they ended their recent history of frustration against Phoenix in the process. They went on a 13-0 run in the fourth quarter and benefited from clutch shooting and solid defense in a 106-96 victory over the Suns.\n\nC.J. McCollum scored 26 points and made five 3-pointers, Damian Lillard added 18 points and the Blazers held the Suns to 14 fourth-quarter points, their defense forcing two shot-clock violations in the quarter.\n\nMcCollum and Lillard, one of the highest-scoring guard duos in the NBA, hit 3-pointers during the 13-0 stretch.\n\n\"We've been through this before many games where we've been up or been close at the end and squandered leads,\" McCollum said. \"So I think it was really important for us to really focus on the defensive end and then offensively get good shots, run some clock.\"\n\nEric Bledsoe led the Suns with 31 points. Bledsoe has four of his eight career 30-point games against the Blazers.\n\nThe two teams combined to make 25 of 69 3-point attempts in what was an up-and-down affair until midway through the fourth. There were seven lead changes and eight ties.\n\n\"Our team defense was not there,\" Bledsoe said.\n\nThe Blazers avoided a season sweep at the hands of the Suns in the final meeting between the two teams.\n\n\"They pretty much dominated us here and at our place,\" Blazers coach Terry Stotts said. \"They closed out the fourth quarter better than we did. Those two games, certainly back to back, were in the back of our mind.\"\n\nSuns guard Brandon Knight, the team's second-leading scorer at 21.4 points per game, didn't score until making a free throw with 7:34 left in the game. Knight didn't make a basket in 12 attempts. He had 10 assists.\n\n\"We were trying to get him to stay aggressive at the beginning of the fourth quarter, but he was just kind of dribbling around and not looking for the shot,\" Suns coach Jeff Hornacek said.\n\nPortland used a 16-6 run early in the third quarter to build a 73-67 advantage. But the Suns reclaimed the lead 82-78 after three quarters following Bledsoe's 3-pointer with 59 seconds left.\n\nThe Blazers didn't score a point for more than three minutes to start the game but finished the first quarter with a 33-26 lead, thanks in large part to 3-point shooting. McCollum hit two 3-pointers and Allen Crabbe had two more off the bench, with Crabbe scoring 10 points in less than four minutes.\n\nCrabbe finished with 18 points, tying a career high. Al-Farouq Aminu had 13 points and 13 rebounds for Portland.\n\nThe Suns rallied to tie the score at 35 in the second quarter with Devin Booker and Mirza Teletovic hitting two 3-pointers each. Booker, a rookie guard from Kentucky, is 17 of 23 from 3-point range this season.\n\nTeletovic had 15 points and six rebounds. He shot 4 of 10 on 3-point attempts.\n\nPhoenix went up 61-57 with 31 seconds left in the first half when Bledsoe banked in a wild shot while being fouled and made a free throw.\n\nTIP-INS\n\nTrail Blazers: Portland made 12 3-pointers on Friday. The Blazers have connected on at least 10 3-pointers in five of their last six games and in 10 games overall this season. ... Crabbe has scored in double figures in six straight games and has made a 3-pointer in 15 games in a row.\n\nSuns: Markieff Morris was active but didn't play. Morris was returning from a sinus infection that forced him out of the team's last game. ... C Tyson Chandler missed his eighth straight game with a hamstring strain. He's been out since Nov. 29. ... The Suns observed a moment of silence before the game to honor 12-time NBA All-Star Dolph Schayes, who died Thursday. The team also issued a statement in remembrance of former center John \"Hot Rod\" Williams, who died Friday in Louisiana. Williams played for Phoenix from 1995-98.\n\nSTAR WARS AND 50 CENT\n\nThe Suns did a special tribute to \"Star Wars\" on Friday night, with costumed \"Star Wars\" characters on the court for lineup introductions while sound effects from the movie played. Rapper 50 Cent announced the Suns' starting lineup.\n\nUP NEXT\n\nTrail Blazers: Host New York on Saturday.\n\nSuns: Host Minnesota on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994871.517782
}