{
  "game_id": "0022301091",
  "espn_id": "401585719",
  "date": "Apr 01, 2024",
  "matchup": "CHI vs. ATL",
  "headline": "Vit Krejci sets career highs with 18 points, 6 3s as Hawks beat Bulls 113-101",
  "body": "CHICAGO -- — Vit Krejci felt as if the ball was going to go in with each shot.\n\n\r\n              He was right every time, and it sure felt good.\n\n\r\n              Krejci made all his shots and set career highs with 18 points and six 3-pointers, Bogdan Bogdanovic scored 20 and the Atlanta Hawks beat the Chicago Bulls 113-101 Monday night in a matchup between potential play-in tournament opponents.\n\n\r\n              Krejci made all six field-goal attempts and surpassed his previous highs of 16 points and four 3s, helping Atlanta win for the fifth time in six games.\n\n\r\n              “It's just a confidence,” he said. “You knock down a couple. The team was playing well. I think the reason why we shot the ball well today was we just were moving the ball. When you get a 3 off of three passes or a kickout or something like that, it always feels better than a one-pass 3.\"\n\n\r\n              Dejounte Murray scored 17 points and Clint Capela added 15 points and 11 rebounds as the 10th-place Hawks moved within a half-game of the ninth-place Bulls in the Eastern Conference. Chicago owns the head-to-head tiebreaker after taking two of three from Atlanta and would host a play-in game if the teams finish tied.\n\n\r\n              DeMar DeRozan led the Bulls with 31 points. Coby White scored 22. Ayo Dosunmu added 15 points, and Andre Drummond had 13 points and 18 rebounds. \n\n\r\n              “As bad as it feels now, I don't think we played that bad,” DeRozan said. \n\n\r\n              Bogdanovic made 6 of 7 shots, including a pair of 3s. The hot-shooting Hawks went 19 of 40 from beyond the arc the Bulls made just 7 of 28.\n\n\r\n              Bogdanovic also had to be separated from coach Quin Snyder during a timeout late in the game. Bogdanovic slammed a water bottle and kept pointing at his chest as he rose from his seat and got in Snyder's face.\n\n\r\n              The two brushed it off, with Snyder saying, “Bogey was terrific, and I he and I are in a great place — better than good.\" Bogdanovic called it nothing more than a “basketball argument\" and insisted they are on good terms.\n\n\r\n              “Quin is my guy, for sure,” he said. “He was pushing me through the whole year. We have little fights. It's normal that it happens. It's sad that it happened on a game and on TV, so now that's highlighted. But it's just part of a game that we play. I think that's normal. In our world, that's kind of normal.”\n\n\r\n              Atlanta led by 17 late in the third quarter and was never seriously threatened after that.\n\n\r\n              Krejci, a third-year pro from the Czech Republic, almost matched his career scoring high in the first half. He made all five shots and a 3 just before the halftime buzzer to give the Hawks a 61-53 lead.\n\n\r\n              Murray scored 11 in the half and made three 3s, and the Hawks were 14 of 26 on 3-pointers through the first two quarters.\n\n\r\n              The Bulls' Lonzo Ball (left knee surgery) was in Chicago, and Zach LaVine (right foot surgery) and Patrick Williams (left foot surgery) were flying in to continue their rehab. Javonte Green missed the game to tend to a family matter. His 10-day contract was also set to expire.\n\n\r\n              Hawks guard AJ Griffin (right high ankle sprain) is participating in individual basketball activities and will be evaluated in seven to 10 days. Forward Mouhamed Gueye (sprained right UCL) is going through full contact workouts, and center Onyeka Okongwu (sprained left big toe) has resumed individual activities. He will be evaluated in seven to 10 days.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host Detroit on Wednesday.\n\n\r\n              Bulls: Three of Chicago's final six games are against New York, starting with Friday's game at the United Center.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995858.2039838
}