{
  "game_id": "0022301146",
  "espn_id": "401585774",
  "date": "Apr 09, 2024",
  "matchup": "TOR vs. IND",
  "headline": "Haliburton, Siakam power the Pacers to a 140-123 win over the Raptors",
  "body": "TORONTO -- — Tyrese Haliburton scored 30 points, Pascal Siakam added 16 points in 26 minutes in his second game back in Toronto and the Indiana Pacers pulled away early in the second half and beat the Raptors 140-123 on Tuesday night.\n\n\r\n              Obi Toppin scored 23 points and T.J. McConnell added 17 as the Pacers won their third straight to remain in sixth place in the Eastern Conference standings.\n\n\r\n              The Pacers are a game ahead of the Philadelphia 76ers in the race to avoid a spot in the Play-In Tournament. Both teams have two games remaining.\n\n\r\n              “Every win is big and nothing has been settled yet,” Pacers coach Rick Carlisle said.\n\n\r\n              Siakam suited up for his 39th game with the Pacers after playing the first 39 games of the season with Toronto. He was traded to Indiana on Jan. 18. Indiana has gone 22-17 with Siakam, who also had nine rebounds and three assists.\n\n\r\n              “This is what you play for, to be in the playoffs and play some meaningful basketball at this time of the year,” Siakam said.\n\n\r\n              RJ Barrett scored 23 points, Kelly Olynyk added 22 and rookie Javon Freeman-Liberty contributed a career-high 20 points for the Raptors, who had their two-game winning streak halted.\n\n\r\n              Toronto rookie Grady Dick was ruled out before the game due to a sore groin.\n\n\r\n              The Raptors list of absentees also included guard Immanuel Quickley (rest), All-Star forward Scottie Barnes (left hand), center Jakob Poeltl (left pinkie), forward Chris Boucher (right knee) and guard DJ Carton (right ankle).\n\n\r\n              Freeman-Liberty replaced Quickley at point guard.\n\n\r\n              “That’s not a position that he’s used to playing a lot, so he’s playing out of his position,” Raptors coach Darko Rajakovic said. “He did a good job trying to get us organized, communicating and learning on the fly.”\n\n\r\n              The Pacers overcame a 12-point deficit and led 65-64 at halftime. Indiana opened the third quarter with a 21-9 run for a 106-91 advantage.\n\n\r\n              “We didn’t have a great start,” Carlisle said. “I don’t know what we expected because even though Toronto is out of the playoffs, they played their butts off.”\n\n\r\n              UP NEXT\n\n\r\n              Pacers: At the Cleveland Cavaliers on Friday night.\n\n\r\n              Raptors: At the Brooklyn Nets on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA:  https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995803.866272
}