{
  "game_id": "0022301136",
  "espn_id": "401585764",
  "date": "Apr 07, 2024",
  "matchup": "ORL vs. CHI",
  "headline": "Magic beat Bulls 113-98, still hoping to finish as high as No. 2 in the East",
  "body": "ORLANDO, Fla. -- — With a week left in the regular season, the Orlando Magic could still finish anywhere between second place and eighth in the Eastern Conference.\n\n\r\n              Paolo Banchero scored 24 points, Jalen Suggs added 19 and the Magic kept up their playoff push with a 113-98 win over the Chicago Bulls on Sunday night.\n\n\r\n              The Magic (46-32) moved into a tie for third place in the East by completing a four-game sweep of the Bulls. They are a game behind second-place Milwaukee, tied with New York, a half-game ahead of Cleveland, 1 1/2 games ahead of sixth-place Indiana, 2 1/2 ahead of Philadelphia and three ahead of Miami.\n\n\r\n              “Things are going to flow up and down a ton in these last four (games),” Magic coach Jamahl Mosley said. “Us being able to just focus on doing what we're capable of doing is all that matters right now.”\n\n\r\n              The Magic have two games left against the slumping Bucks.\n\n\r\n              DeMar DeRozan had 30 points for the Bulls and Javonte Green, starting for the first time this season in place of injured forward Alex Caruso, added 15 points and eight rebounds. \n\n\r\n              The Bulls, locked into the bottom half of the Eastern Conference play-in bracket, shot 50.7% from the field but made only six 3-pointers and had 21 turnovers.\n\n\r\n              With four games remaining, the Bulls (37-41) cannot move up but can drop down to 10th place. They are playing for home court in the first play-in game against Atlanta.\n\n\r\n              “We are coming to a point where we can't play those (erratic) games,” DeRozan said. “The reality is you don't want the other side of it.”\n\n\r\n              Green, coming off a career-high 25 points in a win over New York on Friday night after spending most of the season in the G League, shot 6 for 7 in 22 minutes.\n\n\r\n              Magic forward Franz Wagner left the game in the third quarter with a sprained right ankle after scoring 16 points. Jonathan Isaac played only five minutes of the first half before leaving with a sore back.\n\n\r\n              Caruso had ankle and toe issues after playing 32 minutes Friday night.\n\n\r\n              A couple of 3-pointers by Green was all the offense the Bulls mustered in the first eight minutes. They fell behind by 19 in the first quarter and never caught up, although two scoring bursts by DeRozan kept them in the game.\n\n\r\n              “They always have a chance to win because they can always just go isolate DeRozan, like you saw,” Suggs said. “So we did have to come out and make a statement. We knew they were not going to fold, and they need wins as well.”\n\n\r\n              The Magic led 89-68 late in the third quarter. DeRozan led another charge that got Orlando's lead down to 96-90 with 6:49 left, but a series of Chicago turnovers resulted in a 12-1 Magic run that Wendell Carter Jr. capped with a 3-pointer for a 108-91 lead with 3:16 left.\n\n\r\n              “We’re not going to win turning the ball over 21 times,” Bulls coach Billy Donovan said. “Some of it was carelessness with the ball, but it was like everyone contributed to it. There was a wide range of turnovers.”\n\n\r\n              Eight Bulls players committed at least one turnover but DeRozan led the way with seven.\n\n\r\n              \"I put that on me,\" DeRozan said. “It is going to eat me up tonight, but I think all of us were just trying to do too much. We were trying to make the simple harder than it was.”\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host New York on Tuesday.\n\n\r\n              Magic: Visit Houston on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995679.910188
}