{
  "game_id": "0022100359",
  "espn_id": "401360183",
  "date": "Dec 06, 2021",
  "matchup": "ATL @ MIN",
  "headline": "Hawks use season-high 3s to beat Timberwolves 121-110",
  "body": "MINNEAPOLIS -- — Trae Young had 29 points and 11 assists, Timothe Luwawu-Cabarrot scored 23 points and the short-handed Atlanta Hawks beat the Minnesota Timberwolves 121-110 Monday night.\n\n\r\n              Danilo Gallinari scored 20 points off the bench for Atlanta, which was without injured wings Cam Reddish, Bogdan Bogdanovich, Solomon Hill and De’Andre Hunter on the second night of a back-to-back. \n\n\r\n              Luwawu-Cabarrot had a career-high seven 3-pointers, shooting 7 of 14 as the Hawks set a franchise record with 25 makes on a season-high 49 attempts from beyond the arc. Young was 4-of-9 shooting from 3 and Gallinari finished 4 of 6.\n\n\r\n              “Keep shooting them,” Young said. “They keep going in, keep shooting them. We were getting good looks, and we were making the right play and right read. It was just going in. It was one of those nights.”\n\n\r\n              Karl-Anthony Towns had 31 points and 16 rebounds for Minnesota in his return after missing one game with a tailbone contusion. Anthony Edwards added 20 points for the Wolves, who were also short-handed without starting guards D’Angelo Russell and Patrick Beverly.\n\n\r\n              “Our urgency to contest shots was not there,\" Minnesota coach Chris Finch said. “As the game went on, we just kept stopping short and stopping short. The ball movement, we knew it was going to be there. We knew what we were trying to do. We didn’t run shooters off the line.”\n\n\r\n              Minnesota’s improved defense has been susceptible to 3s but has benefited from opponents’ poor shooting.\n\n\r\n              Atlanta came out firing from 3 and never stopped.\n\n\r\n              The Hawks, who started the day second in the NBA in 3-point shooting at 37.8%, hit eight of their first 12 from deep. Their nine 3s in the first marked their season high in any quarter and they tied it in the third.\n\n\r\n              “It’s relief,” Luwawu-Cabarrot said. “We feel all good, I would say, satisfied. It’s satisfying passing the ball like that, finding someone open and just making. We got to keep playing like that.”\n\n\r\n              Towns, clearly bothered by the tailbone injury, tried to keep the Timberwolves in the game. \n\n\r\n              Minnesota cut the lead to 11 three minutes into the second half, but Atlanta then scored 10 straight, including 3s from Luwawu-Cabarrot and John Collins.\n\n\r\n              Michael Beasley scored all 24 of his points in the second half for the Wolves, who closed within 10 in the fourth.\n\n\r\n              “Terrible,” Towns said of how he feels. “I wanted to come back. I knew we were down a little bit with D-Lo. I didn’t want to leave Ant out there by himself. Kind of pushed up the process a little bit. Happy to be back. Just wished we would’ve played with a little more umph. I think that’s what was a lacking, a little umph.”\n\n\r\n              ONE REASON\n\n\r\n              Atlanta started the day tied for the fifth-fewest attempts from 3 in the league, averaging 32 tries per game, despite their strong percentage.\n\n\r\n              “Ball movement,” Hawks coach Nate McMillan said about the increased attempts from 3 on Monday. “We shoot 3s that are open. We don’t want to come down and just jack a contested 3. If our offensive action can create those opportunities, the pick-and-roll or traps with good ball movement, you can get those shots. When we have moved the ball, tonight it was playing to our second and third option, we were getting wide-open looks and our guys were knocking those shots down.”\n\n\r\n              Over the past four games, the Hawks are averaging 17 made 3s per game on 47.7% shooting.\n\n\r\n              TIP-INS\n\n\r\n              Hawks: Bogdanovich has missed four games in a row due to a right ankle sprain. Hill was out of the lineup with a hamstring injury from Sunday’s loss to Charlotte. Reddish missed his fourth straight game as he deals with a left wrist sprain. Hunter had surgery in November on his right wrist. ... The Hawks had lost three of four. ... Clint Capela added 16 rebounds.\n\n\r\n              Timberwolves: Beverly missed his sixth straight game with a left adductor strain. He was called for a technical foul while arguing a call against Leandro Bolmaro in the second quarter. Russell was out with right ankle soreness. ... Without Beverly and Russell, Bolmaro made his first career start. He had two points in 18 minutes. ... Jaden McDaniels returned to the lineup after an illness caused him to miss three games. Coach Chris Finch said McDaniels lost 10 pounds.\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Return home against Brooklyn on Friday.\n\n\r\n              Timberwolves: Host Utah on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993807.2521448
}