{
  "game_id": "0021500108",
  "espn_id": "400827995",
  "date": "Nov 10, 2015",
  "matchup": "LAL @ MIA",
  "headline": "Bosh scores season-high 30; Heat top Lakers 101-88",
  "body": "MIAMI -- Moments after the game was over, Dwyane Wade and his son Zaire walked to midcourt to meet Kobe Bryant for some hugs, handshakes and photos.\nIt was an image the Wade family won't forget.\nThe numbers Chris Bosh put up in the game were more important for the Miami Heat.\nBosh scored a season-high 30 points and grabbed 11 rebounds, Hassan Whiteside had 19 points and 15 rebounds in only 27 minutes of work, and the Heat pulled away in the second half to beat the Los Angeles Lakers 101-88 on Tuesday night.\n\nLuol Deng scored 14 and Wade added 12 for Miami. The Heat led 50-49 at the break, then by as many as 18 later on against a Lakers team that was without Bryant for the first time this season.\n\"I think we did a fantastic job coming out in the third quarter,\" Bosh said. \"We kind of sparred with them and in the fourth we blew it open.\"\nNick Young made his first five shots, four of them from 3-point range, and finished with 17 for Los Angeles. Lou Williams and Metta World Peace each scored 14 while Bryant sat out with a back problem.\nIt was unclear how the injury flared up; Bryant said Monday he was anticipating playing against the Heat.\n\"If he can't go, you know he's hurt,\" Lakers coach Byron Scott said. \"The level of concern is pretty up there right now.\"\nBryant downplayed the injury, saying it comes with the territory of being a 20-year veteran.\n\"It's wear and tear,\" Bryant said. \"It's soreness, something I can knock out with a little rest and treatment.\"\nAfter the Bryant-Wade postgame summit, Bryant walked off the court -- giving high-fives to a few fans who lingered for possibly their final look at him in Miami. Bryant is contemplating retiring after this season.\n\"It was a cool moment,\" Wade said. \"I had an opportunity to speak to Kobe last night and he asked me if the boys were coming. I was like, `Nah, school night.' So he hinted to me that he wanted to see them, so I was able to bring them and have a cool moment.\"\nBryant had a message to Wade's son Zaire in their postgame talk: Shoot the ball.\n\"I asked him how many times he shot the ball,\" Bryant said. \"Dwyane said not enough. And I said `Are you going to be like Uncle Kobe and shoot a lot more?' Dwyane said, `See, I told you.' So we had a nice little laugh about that.\"\nTIP-INS\nLakers: World Peace made his first NBA start in exactly 23 months. His last was Dec. 10, 2013, for New York at Cleveland. ... The Lakers have committed at least 20 fouls in all seven of their games; they were whistled for 21 on Tuesday. ... If Bryant doesn't return next season, his final numbers in Miami: 23.8 points in 15 games, with the Lakers going 4-11 in those contests.\nHeat: Miami traded G Mario Chalmers -- a member of two NBA title games -- and F James Ennis to Memphis earlier in the day. ... The Heat honor soldiers at every home game and have done so for years, but there was one of particular significance in the arena on Tuesday -- U.S. Air Force Master Sergeant Jennifer Johnson, the mother of Heat guard Tyler Johnson. ... Miami has blocked at least five shots in all eight of its games so far. The only other season where the Heat opened with a streak like that was 2010-11.\nCELEB WATCH\nLongtime University of Miami trustee Alex Rodriguez -- he's better known as the New York Yankees' designated hitter -- was sitting at midcourt, and Hurricanes men's basketball coach Jim Larranaga watched the game next to Heat President Pat Riley.\nAlso, several members of the U.S. men's national soccer team were in the crowd and some took part in an on-court shooting contest during a second-quarter stoppage in play. The team has been training in South Florida to prepare for the start of 2018 World Cup qualifying.\nWHITESIDE AT HOME\nIt was the fourth consecutive home game with a double-double for Whiteside, who reached that plateau in the second quarter.\nUP NEXT\nLakers: At Orlando on Wednesday.\nHeat: Host Utah on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994322.956683
}