{
  "game_id": "0021900059",
  "espn_id": "401160701",
  "date": "Oct 30, 2019",
  "matchup": "IND @ BKN",
  "headline": "Pacers beat Nets 118-108 for first victory of season",
  "body": "NEW YORK --  Domantas Sabonis and the Indiana Pacers finally got their first victory of the season.\n\nSabonis scored 29 points, Jeremy Lamb added 25 and Indiana Pacers beat the Brooklyn Nets 118-108 on Wednesday night for their first victory in five games.\n\n\"(Sabonis) was a monster down there,\" Pacers coach Nate McMillan said. \"Just defending, rebounding, initiating offense. Had to play a lot of minutes, but was fired up and I thought we rode his energy.\"\n\nSabonis carried the frontcourt load when Myles Turner left the game after spraining his right ankle in the first quarter.\n\n\"It's tough,\" Sabonis said about losing Turner. \"Because it's the beginning of the season, we're also trying to find each other and find that chemistry and play together, and obviously he's going to be out for a little bit. It's tough. I wish him a speedy recovery. When he comes back he's going to help us, he's the best defender in the league.\"\n\nMalcolm Brogdon added 21 points and 13 assists for Indiana.\n\nKyrie Irving led Brooklyn with 28 points, Spencer Dinwiddie had 20 and Caris LeVert 15. The Nets have lost two in a row to fall to 1-3.\n\n\"We're not really running anything (on offense),\" Nets coach Kenny Atkinson said. \"In training camp you're practicing a lot, but you have a nice flow, you kind of know what you're doing. I think we've lost a little bit of our structure and organization, which is natural with a new team and new guys.\"\n\nThe Pacers took their largest lead at 112-96 on Brogdan's 3-pointer with 4:43 remaining. Indiana took a 90-83 lead into the fourth quarter, with Sabonis and Lamb each scoring seven points in the third.\n\nWith three new starters in Irving, DeAndre Jordan and Taurean Prince, the Nets have become more of an isolation team than the cohesive group from a season ago.\n\n\"Basketball has a way of being sequentially sound or it can be sequentially off completely,\" Irving said. \"Be able to weather the storm out there. Some possessions are not going to be perfect. We want to limit the mistakes out there where you have opportunities to attack the basket, shoot threes and get everyone confident. Wins and losses come and go. It just gives us a chance to dive into practice and really take it day by day. The details are really what separates the good and the bad teams in the league.\"\n\nTIP-INS\n\nPacers: McMillan vowed to continue using a frontcourt tandem of Myles Turner and Sabonis for the season. \"That's what we're going with. We signed Domantas to an extension and these are the bigs we're going into the future with. This is something that we decided on giving this a look and a try this season.\" ... Victor Oladipo (right knee surgery rehab) and Edmond Sumner (sore right hand) were out for Indiana. ... Turner sprained his right ankle at the 2:19 mark of the first quarter and was assisted to the locker room.\n\nNets: Atkinson briefly addressed ESPN's story on Irving's interactions with his teammates. \"I know all these elite players, not just Kyrie, are used to the scrutiny. It's just part of the business. I didn't feel the need to talk to him about it.\" ... Wilson Chandler (NBA suspension) and Kevin Durant (right Achilles rehab) were out for Brooklyn.\n\nGIANTS GREAT IN ATTENDANCE\n\nTwo-time Super Bowl champion Justin Tuck sat courtside.\n\nUP NEXT\n\nPacers: Host Cleveland on Friday night.\n\nNets: Host Houston on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995888.262479
}