{
  "game_id": "0022400783",
  "espn_id": "401705349",
  "date": "Feb 12, 2025",
  "matchup": "MEM @ LAC",
  "headline": "Kawhi Leonard scores 25 points in Clippers' 128-114 victory over Grizzlies",
  "body": "INGLEWOOD, Calif. -- — Kawhi Leonard scored 25 points, James Harden and Norman Powell each had 18 and the Los Angeles Clippers beat the Memphis Grizzlies 128-114 on Wednesday night.\n\n\r\n              Leonard played a season-high 34 minutes, with all of his 30-minute games coming in the last three contests.\n\n\r\n              Amir Coffey added 15 points, Kris Dunn had 14 and Ivica Zubac finished with 12 points with 13 rebounds. Harden also had 10 assists.\n\n\r\n              With Memphis playing without Ja Morant (knee) on the second night of a back-to-back, Desmond Bane scored 16 of his 23 points in the first quarter for the Grizzlies. Jaylen Wells added 18 points. GG Jackson had 15 points and Santi Aldama 14.\n\n\r\n              Memphis committed 22 turnovers that led to 41 Clippers points. The Grizzlies have lost of of their last three.\n\n\r\n              Takeaways\r\n              Grizzlies: The Grizzlies are 36-18 at the All-Star break. The extended break lasts until Feb. 20 when Memphis plays three road games in a span of four days.\n\n\r\n              Clippers: Bogdan Bogdanovic scored seven points in his Clippers debut after he was acquired from Atlanta at the trade deadline. Ben Simmons, who was signed Saturday after his contract was bought out by Brooklyn, was introduced to the crowd from the bench and could make his Clippers debut Thursday.\n\n\r\n              Key moment\r\n              Leonard's 3-pointer with 7:07 remaining in the third quarter capped a 10-0 run to give the Clippers an 88-70 lead. It also gave him at least 20 points for the fourth time in 15 games this season.\n\n\r\n              Key stat\r\n              With a 3-pointer in the third quarter, Harden moved past Hakeem Olajuwon and into sole possession of 13th place on the NBA’s career list. Harden has 26,949 points.\n\n\r\n              Up next\r\n              The Grizzlies are at Indiana on Feb. 20. The Clippers are at Utah on Thursday night.\n\n\r\n              ------ AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997724.464575
}