{
  "game_id": "0021900004",
  "espn_id": "401160626",
  "date": "Oct 23, 2019",
  "matchup": "DET @ IND",
  "headline": "Andre Drummond helps Pistons beat Pacers in opener",
  "body": "INDIANAPOLIS --  Andre Drummond softened up the perimeter by hammering away in the middle. Luke Kennard finally took advantage late.\n\nIt was quite an opening-night combination for the Detroit Pistons.\n\nDrummond scored 32 points, grabbed 23 rebounds and blocked four shots while Kennard made half of his career-high six 3-pointers in the final six minutes to help the Pistons pull away for a 119-110 victory over the Indiana Pacers on Wednesday night.\n\n\"I'm glad he (Drummond) is on my team,\" Derrick Rose said after his Pistons debut. \"It just feels good to win, especially the first game.\"\n\nThe Pacers had billed their opener as the debut of a new era complete with four new starters and a retro lineup with 6-foot-11 Myles Turner and 6-11 Domantas Sabonis playing alongside one another.\n\nBut Drummond and Kennard ruined the big unveil.\n\nThe league's three-time rebounding champ was a wrecking ball right from the start, knocking down 12 of 18 shots and even making his last eight free throws after missing the first two. Kennard warmed up late, scoring 16 of his career-high 30 points in the final 11 minutes.\n\nIndiana never recovered. Sabonis had 27 points and 13 rebounds and Malcolm Brogdon added 22 points in his first game with the Pacers.\n\n\"We got outworked tonight, I think,\" Turner said after scoring 25 points. \"That's one thing we hang our hat on here, outworking people. I think we got outworked and they were a little grittier than we were.\"\n\nIt was far from pretty, though.\n\nThe teams combined for 33 turnovers and 29 fouls resulting in a back-and-forth game in which neither team seized control for long.\n\nIndiana extended a 55-54 halftime lead to 73-64 midway through the third quarter then nearly gave it all away as the Pistons closed to 86-83 after three.\n\nDrummond helped the Pistons trade punches early in the fourth, just long enough for Kennard to heat up. When he knocked down the second of back-to-back 3s to end an 8-0 run with 4:40 to play, Detroit led 105-101. His third 3 of the quarter, with 1:24 left made it 113-103 and sealed the Pacers fate.\n\n\"I love the way we fought,\" Kennard said. \"That was great to come into an atmosphere like this, opening night, for a team on the road it's not always easy to come away with a win.\n\nTIP-INS\n\nPistons: Drummond, the NBA leader in double-doubles last season, moved within one game of tying Shaquille O'Neal (34) for the second-most 20-20 game since 1988-89. ... Rose had 18 points and went 5 for 5 from the field in the first half. ... Tony Snell scored 10 points on a night the Pistons committed 18 turnovers. ... Detroit's bench outscored Indiana 57-16.\n\nPacers: T.J. Warren was taken straight to the locker room with 3:46 left after taking a hard spill following an offensive foul. He finished with 10 points. .... Brogdon was 10 of 11 from the free- throw line, and Jeremy Lamb scored 10 points in his first game with Indiana. ... The Pacers were outrebounded 45-36 and lost on opening night for the first time in four years.\n\nOLADIPO UPDATE\n\nTwo-time All-Star Victor Oladipo has participated in two five-on-five practices since he was cleared by team doctors late last week.\n\nSo far, coach Nate McMillan said Oladipo has had looked fine. But he's also likely weeks away from taking another big step.\n\n\"He looks OK out there,\" McMillan said, noting Oladipo is only practicing every other day. \"He wants to play a little more but he's limited for what he can do for the next month or so before he gets re-evaluated.\"\n\nREPLACING THE PISTON\n\nSix-time All-Star Blake Griffin missed the game with an injured left hamstring and a sore knee.\n\nAnd until he returns, the Pistons may find themselves cobbling together spare parts till he can return. But coach Dwane Casey had to like what he saw Wednesday.\n\nWhen times get tough, that's when everyone looks to Blake,\" coach Dwane Casey said. \"You know when you go a couple possessions without a basket, we usually look to Blake. So in those situations, who do we go to? I think that's what we have to find out.\"\n\nUP NEXT\n\nPistons: Host Atlanta on Thursday night.\n\nPacers: At Cleveland on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996315.559533
}