{
  "game_id": "0021900346",
  "espn_id": "401160988",
  "date": "Dec 09, 2019",
  "matchup": "SAC @ HOU",
  "headline": "Bjelica's 3 at buzzer lifts Kings over Rockets 119-118",
  "body": "HOUSTON --  When Luke Walton took over as coach of the Sacramento Kings, he thought Nemanja Bjelica was just a big man he could use to create space.\n\nAs he's gotten to know Bjelica, Walton has started to see that the 6-foot-10 forward is much more than that, which was clear on Monday night against the Houston Rockets when Bjelica made a 3-pointer at the buzzer to lift the Kings to a 119-118 victory.\n\n“As I get to know him and see what he's capable of ... (I see) he's a skilled player,” Walton said.\n\nThe game was tied before Russell Westbrook drove into the lane for a layup that put Houston on top with a second to go. After a timeout, Cory Joseph inbounded the ball to Bjelica and his 3-pointer swished through the net to give the Kings the win and send the entire bench onto the court to celebrate.\n\n“Great pass by Cory and I was open and went deep because I felt good at that range,” Bjelica said. “And I just took a shot and it went in.”\n\nHouston coach Mike D'Antoni explained what happened with his team's defense on the final play.\n\n“Just a breakdown,” he said. “We just left a guy wide open for no reason whatsoever.”\n\nBuddy Hield had 26 points to lead the Kings, who had six players score in double figures as they won their second straight after losing the previous three.\n\nHield and the rest of the Kings were thrilled to see Bjelica make such a big play.\n\n“You saw when he made the shot how everyone loves him,” Hield said. “He's one of the best teammates on the team so everybody is happy for his success.”\n\nWestbrook had a season-high 34 points and James Harden added 27 points and 10 assists for Houston.\n\nThe game was tied earlier in the fourth when Westbrook dished it to Ben McLemore, whose 3-pointer made it 116-113 with 22.7 seconds to go. Hield missed a 3-pointer after that, but Bogdan Bogdanovic grabbed the rebound and got it back to Hield, who didn't miss this time to tie it again with 8.4 seconds left.\n\nWestbrook tied it earlier in the period on a layup before Harrison Barnes made it 113-110 with a 3-pointer. The lead was short-lived as Westbrook made a 3 seconds later to tie it again with about a minute left.\n\nThe Kings led by six after a 3-pointer by Yogi Ferrell with about 9 minutes left. The Rockets scored the next four points before Bogdanovic's 3-pointer pushed Sacramento's lead to 105-102 midway through the quarter.\n\nHouston got four quick points from Clint Capela before Harden made two free throws to put the Rockets on top 106-105 with 4 1/2 to play.\n\nHarden had a 3-pointer waved off late in the third quarter when he was called for an offensive foul. D'Antoni challenged the call, but it was upheld. Joseph had a three-point play on the other end before Harden made a 3-pointer. This time Trevor Ariza was called for a foul on Harden and Walton challenged the call. Officials ruled that Ariza did foul Harden, but that it was before the shot so three points were taken off the board.\n\nHarden made both free throws to put Houston on top, but Barnes added a pair of free throws for Sacramento after that to leave the Kings up 94-93 entering the fourth quarter.\n\nTIP-INS\n\nKings: F Marvin Bagley (broken right thumb) is getting close to a return after missing 22 games with his injury, but Walton wouldn't say exactly when he expects him to return. ... Bjelica had 17 points and made three 3-pointers. ... Barnes had 19 points and eight rebounds.\n\nRockets: C Tyson Chandler missed a second straight game with flu-like symptoms. ... G Austin Rivers sat out with an illness. ... P.J. Tucker had 10 points for his fifth game with at least 10 points in the last seven. ... Houston outrebounded Sacramento 51-37.\n\nCREATIVE PRACTICE\n\nWalton wanted to try some new things on defense against Harden and Westbrook on Monday, but Sacramento's schedule hadn't left any time for practice lately. So he got creative.\n\n“We put that in this morning in our film session,” he said. “We had tape down on the floor in the hotel ballroom that we were in and we walked through it in a ballroom. So with that being said, I think our guys did a good job of executing something that is new for us.”\n\nUP NEXT\n\nKings: Host Oklahoma City on Wednesday night.\n\nRockets: Visit Cleveland on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764996407.63283
}