{
  "game_id": "0021500913",
  "espn_id": "400828800",
  "date": "Mar 04, 2016",
  "matchup": "PHX @ ORL",
  "headline": "Suns beat Magic to end 17-game road losing streak",
  "body": "ORLANDO, Fla. -- Since their last road win, the Phoenix Suns have new coach and three new players in the starting lineup.\nAlex Len scored a career-high 31 points and grabbed 15 rebounds Friday night, and the Suns held the Orlando Magic scoreless for a 7 1/2-minute stretch to snap a 17-game road losing streak, 102-84 Friday night.\nDevin Booker and Ronnie Price added 14 points each for Phoenix, which got its first road victory since Dec. 7 at Chicago. The streak tied a franchise record.\n\"Everyone came in focused tonight, the level of concentration was high. Winning is winning,\" Len said. \"We had 14 stops in a row. That got us going.\"\nElfrid Payton had 19 pints and 11 assists for Orlando, which shot 35 percent against the NBA's bottom-ranked team in defensive field-goal percentage.\n\"They were much more physical than us and we never did respond,\" Magic coach Scott Skiles said. \"Tyson (Chandler), Len, (P.J.) Tucker, Price -- those guys, from a physical standpoint, dominated us. It is very disappointing. It is a game we had to have.\"\nMirza Teletovic hit two 3-pointers late in the first half to help the Suns take an eight-point lead, the largest of the half for either team.\nWhen Phoenix scored the first nine points of the second half, Skiles replaced all five of his starters, but it didn't help. Phoenix scored seven more points before Payton scored on a layup with 5:24 left in the third quarter, ending a stretch of 14 straight missed shots by Orlando.\nBy then the Suns had taken a 24-point lead.\n\"We locked in on every possession,\" said Suns coach Earl Watson, who replaced Jeff Hornacek on Feb. 1. \"Tonight what you saw was a glimpse of what we envision being. This was just one step.\"\nRookie Mario Hezonja sparked a Magic rally with a long jumper and a couple of 3-pointers, but they could get no closer than 13.\nTIP-INS\nSuns: Price played almost 45 minutes. ... The Suns scored half of their 44 second-half points from the foul line. ... The 7-foot-1 Len, who averages 8.4 points, scored in double figures for the seventh straight game.\nMagic: G Victor Oladipo was out with a lower back contusion. The Magic are 1-4 without Oladipo this season. ... Payton had 13 points and four assists in the first quarter, figuring in 22 of the team's 29 points. . . . The Magic have lost three straight to the Suns, including both meetings this season.\nCOULD BE WORSE\nThe Suns have won only twice under Watson but he put it in perspective: \"I was in the D League last year taking six-hour bus rides. This is a different deal for me; I'm excited to fly on a plane again from city to city.\"\nUP NEXT\nSuns: At Memphis on Sunday.\nMagic: At Golden State on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994833.4280431
}