{
  "game_id": "0021900453",
  "espn_id": "401161095",
  "date": "Dec 23, 2019",
  "matchup": "SAC vs. HOU",
  "headline": "Rockets survive sloppy fourth quarter, beat Kings 113-104",
  "body": "SACRAMENTO, Calif. --  One week after setting a franchise record by coming back from 25 point down to win, the Houston Rockets nearly went the other way after taking a big lead against Sacramento.\n\nLike it has much of the season, Houston's defense made the difference down the stretch when the Rockets offense went silent.\n\nJames Harden scored 34 points, Russell Westbrook had 28 and the Rockets overcame one of their worst fourth quarters of the season to beat the Kings 113-104 on Monday night.\n\n\"I thought we did a good job defending at a high rate, staying true to ourselves and leaning on our defense, not our offense,\" Westbrook said. \"We lean on our defense every night. We have obviously a great offense, a lethal offense, but we lean on our defense.\"\n\nClint Capela added 15 points and 14 rebounds as the Rockets won their seventh straight on the road.\n\nIt didn't come easily.\n\nTwo weeks after losing to the Kings on Nemanja Bjelica's buzzer-beating 33-footer, the Rockets squandered most of a 25-point lead before holding on at the end.\n\nThat was in stark contrast to Houston's win over San Antonio on Dec. 16 when the Rockets rallied from down and beat the Spurs 109-107.\n\n\"A 10- or 15-point lead was like a five-point lead back in the day,\" Houston coach Mike D'Antoni said. \"They got hot and they did what they were supposed to do. We made some mistakes but a win here is a good win.\"\n\nThe Rockets won despite shooting 3 of 17 in the fourth quarter. All three baskets were 3-pointers, including one by Westbrook that put Houston ahead 107-96 after the Kings had pulled within six.\n\nHarden made a 3-pointer then added a pair of late free throws.\n\n\"We just got lax,\" Harden said. \"That's just human nature. You get up 18, 20 points and you start doing things that you weren't doing to gain the lead. It happens.\"\n\nDe'Aaron Fox tied his career-high of 31 points and had nine rebounds and six assists for Sacramento. Richaun Holmes added 12 points and 14 rebounds. The Kings have lost four straight.\n\n\"We didn't do the little things well enough tonight to win the game,\" Sacramento coach Luke Walton said.\n\nHouston built a 16-point lead in the first quarter despite slow starts by Harden and Westbrook. The two took five shots total in the opening period and had nine points combined, while House and Capela handled the scoring load early.\n\nThe Rockets big two got going after that. Harden scored 13 in the second quarter and Westbrook had 10.\n\nHouston pulled away in the third and led 86-61 following a short jumper by Harden.\n\nTIP-INS\n\nRockets: Westbrook's streak of 30 points or more ended at three games. . Ben McLemore scored eight points against his former team. McLemore was Sacramento's first-round pick (seventh overall) in 2013.\n\nKings: Trevor Ariza had 12 points and six rebounds off the bench. . Bogdan Bogdanovic (right ankle soreness) did not play.\n\nHIELD SITS OUT FOURTH Buddy Hield is Sacramento's leading scorer but was on the bench the entire fourth quarter. He finished with 10 points on 3 of 12 shooting. \"I played the guys that had it going,\" Walton said. \"It wasn't a punishment at all. It was more, `Look, we're a team and we're trying to win out here and if these guys are going well, well then we keep rolling with them.\"\n\nDON'T FORGET\n\nWestbrook said Bjelica's buzzer-beater on Dec. 9 was a source of motivation going into the game. \"We definitely had it on our radar and I made sure that we all knew that coming in,\" Westbrook said.\n\nMISSED FREEBIES\n\nFox scored 19 in the fourth quarter but missed five free throws over the final 6 minutes.\n\nUP NEXT\n\nRockets: Play the Warriors on Wednesday in San Francisco. Houston has won six of the last eight against Golden State.\n\nKings: Play Minnesota at Golden 1 Center on Thursday. The two teams split four games last season, each winning twice at home.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995899.1135879
}