{
  "game_id": "0022200400",
  "espn_id": "401468555",
  "date": "Dec 11, 2022",
  "matchup": "ATL vs. CHI",
  "headline": "Griffin wins game at OT buzzer, Hawks hold off Bulls 123-122",
  "body": "ATLANTA -- — A.J. Griffin hit a 6-footer on an alley-oop pass at the overtime buzzer and the Atlanta Hawks snapped a three-game losing streak with a 123-122 victory over the Chicago Bulls on Sunday night.\n\n\r\n              DeMar DeRozan sank three free throws with 0.5 seconds remaining in overtime to finish with 33 points as it appeared the Bulls had the game wrapped up. But Griffin took sideline alley-oop pass from Jalen Johnson and scored on a turnaround jumper with Derrick Jones Jr. defending for the win.\n\n\r\n              It was Griffin's second overtime buzzer-beater in his rookie season, the first coming in a 124-122 win over Toronto on Nov. 19. \n\n\r\n              “The same thing was going through my head,\" Griffin said after scoring 17 points. “Just how fast it happens. I think coach drew up a great play and J.J. made a great pass.\n\n\r\n              “Getting that confidence from the coach to be able to go out there and execute. Even on a day when shots aren't falling, just to continue to keep playing. Just the encouragement to keep going. On to the next one.\"\n\n\r\n              Trae Young hit a 20-footer with 1 second left to give the Hawks a 121-119 lead in the extra period, and Bogdan Bogdanovic scored 17 of his 28 points in the first half for Atlanta.\n\n\r\n              DeRozan calmly swished the free throws after taking the inbound pass and firing up a 3 in which he was fouled by Bogdanovic. He knew the game wasn't over, however.\n\n\r\n              “I mean I've been in the league so much that I've seen crazier stuff happen,\" DeRozan said. “It's not over ’til it's over. ... They made a hell of a play. ... Shake their hand and move on.\"\n\n\r\n              DeRozan had 12 points in the fourth quarter but he missed a layup that would’ve given Chicago a one-point lead with 16.5 seconds remaining.\n\n\r\n              Jones hit one of two free throws that could’ve given the Bulls a one-point victory, but instead sent the game to overtime. \n\n\r\n              Young had 19 points and 14 assists for the Hawks. The team’s leading scorer, Young was 5 for 18 from the field, including 2 for 8 on 3s, but his runner with 1:45 remaining gave the Hawks the lead at 107-105. He followed with a 3 to make it 110-107 with 50.6 seconds left in regulation.\n\n\r\n              Young has struggled lately, beginning the night 7 of his last 41 on 3s over his last six games and fourth in the league in turnovers. \n\n\r\n              One night after scoring a season-high 144 points and shooting 63.5% in a lopsided win over Dallas, the Bulls shot 48%, including 28.9% on 3s.\n\n\r\n              Clint Capela got his eighth straight double-double and 16th of the season, finishing with 15 points and 14 rebounds for the Hawks.\n\n\r\n              TIP-INS\n\n\r\n              Bulls: G Javonte Green was cleared to play despite being listed as questionable with right knee soreness. He had two points in 11 minutes despite missing the last three games. ... G Alex Caruso (lower back contusion) stayed in Chicago to get treatment. ... G Ayo Dosunmu had an abdominal contusion late in the second quarter and didn’t return.\n\n\r\n              Hawks: G Dejounte Murray, the team’s second-leading scorer, missed his second straight game with a left ankle sprain. He is expected to be sidelined for another week and a half. ... De’Andre Hunter, who missed four straight games with a right hip flexor strain, was a game-time decision and scored 16. ... C Onyeka Okongwu, listed as questionable before the game with left foot soreness, finished with 14 points. ... F John Collins missed his fifth consecutive game with a left ankle sprain. He is expected to be out another week.\n\n\r\n              CONDOLENCES\n\n\r\n              Atlanta coach Nate McMillan paid his respects to NBA legend Paul Silas, who passed away Saturday night at 79. The Hawks held a moment of silence for Silas, a former NBA coach who played for St. Louis and Atlanta for the first five years of his career beginning in 1964-65, before the game.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host New York on Wednesday and Friday.\n\n\r\n              Hawks: At Memphis on Monday and Orlando on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994840.041279
}