{
  "game_id": "0022101083",
  "espn_id": "401360902",
  "date": "Mar 22, 2022",
  "matchup": "LAC @ DEN",
  "headline": "Jokic, Nuggets bounce back with 127-115 win over LA Clippers",
  "body": "DENVER -- — Nikola Jokic bounced back from a rare poor shooting performance, scoring 30 points to lead the Denver Nuggets to a 127-115 win over the Los Angeles Clippers on Tuesday night.\n\n\r\n              It was his supporting cast's performance that fired up coach Michael Malone, who smiled as he scanned the stat sheet and saw all five starters plus reserves Bones Hyland and Austin Rivers had scored in double figures.\n\n\r\n              “I'm extremely pleased,” Malone said. “Yes, Nikola is an MVP, but this team with nine games to go, needs everybody to step their game up down the stretch and alleviate some of the pressure that's put on Nikola every night.”\n\n\r\n              Denver had lost four of six, including a 124-104 home loss to the Celtics on Sunday night in which Jokic missed 15 shots and blamed himself for the defeat.\n\n\r\n              Against the Clippers, he was 9 of 15 from the floor — he also had two baskets that were waived off — and sank 12 of 13 free throws. He also pulled down a game-best 14 rebounds for his 59th double-double of the season. \n\n\r\n              The only thing worse than facing Jokic is facing Jokic coming off a bad game.\n\n\r\n              “For sure,” Clippers coach Tyronn Lue said. “He was the MVP last year and has a great chance to win it again this year. We knew he was going to play well. Usually don’t play bad two games in a row, so he came out played well, got his team going. That’s to be expected.”\n\n\r\n              The Clippers, who got 24 points from Terance Mann, dropped their fourth straight game. They have lost seven of nine overall. Marcus Morris Sr., Isaiah Hartenstein and Robert Covington each added 14 points.\n\n\r\n              Hyland, Aaron Gordon and Jeff Green scored 16 points apiece for Denver. Monte Morris had 15 and Will Barton 10. Rivers scored 11.\n\n\r\n              “Everybody contributed,” Gordon said.\n\n\r\n              Jokic's tip-in appeared to give the Nuggets a 74-61 halftime lead but a review showed he touched it just a tick after the buzzer went off. \n\n\r\n              Jokic had a tip-in while being fouled with about six minutes left in the game, but the basket was waived off and the Nuggets got the ball out of bounds, then Will Barton missed a 3.\n\n\r\n              The Clippers chipped away, cutting a 14-point deficit at one point to 111-109. Morris and Jeff Green responded with back-to-back 3-pointers, and the Nuggets closed on a 16-6 run.\n\n\r\n              “We haven’t finished games the way we wanted to lately,\" Clippers guard Reggie Jackson said. “We haven’t come up with as many wins as we’ve wanted to. But keep your spirits up and understand that we’ve put in a lot of work. It’s going to continue to show. We’re still in a great position. We’re going to continue to come out here and play our best basketball at the right time.”\n\n\r\n              Hyland had four clutch 3-pointers, two in the waning minutes of the second quarter that helped Denver take an 11-point lead into the break. He had another that sent the Nuggets into the fourth with a 99-88 advantage and one that made it 107-95 after the Clippers had pulled within six points.\n\n\r\n              “That kid plays with so much energy,” Monte Morris said. “He's coming into his own, for sure.”\n\n\r\n              TIP-INS\n\n\r\n              Clippers: The Clippers bench and Nuggets big man DeMarcus Cousins were assessed a double-technical foul at 7:39 of the second quarter. Roughly two minutes later, Clippers F Robert Covington was whistled for a technical while Gordon was shooting free throws after getting fouled on a 3-point try. Jokic stepped in and sank the technical foul shot before Gordon sank his third, giving the Nuggets a 55-48 lead.\n\n\r\n              Nuggets: The Nuggets shot 62% from the field in the first half and made 14 of 15 free throws. ... Malone said F Zeke Nnaji may not play again this season. Nnaji has been dealing with bilateral knee soreness. “I don’t know when, or if, he’ll be back,\" Malone said. \"I really can’t say because I really did not anticipate he’d be out this long.” \n\n\r\n              UP NEXT\n\n\r\n              Clippers: Host the Philadelphia 76ers on Friday night.\n\n\r\n              Nuggets: Host the Phoenix Suns on Thursday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993571.694293
}