{
  "game_id": "0021600795",
  "espn_id": "400900200",
  "date": "Feb 09, 2017",
  "matchup": "ORL vs. PHI",
  "headline": "Sixers edge Magic 112-111 after McConnell's jumper",
  "body": "ORLANDO, Fla. --  With Joel Embiid out of the lineup, the Philadelphia 76ers had been close but just not good enough at times lately.\n\nThings were different Thursday night. Instead of finding ways to lose in the end, the Sixers came up with enough clutch plays down the stretch to escape Orlando with a 112-111 victory.\n\nT.J. McConnell hit a pull-up jumper in the lane with 5.8 seconds remaining for the go-ahead basket. The victory snapped a five-game losing streak for the Sixers, who have been without Embiid for seven straight games.\n\n\"It is hard to win without Joel but we can't say that every time he is not playing,\" McConnell said. \"I think the games that we lost, we sort of stopped fighting.\n\n\"Tonight we could have easily given up but we fought and fought. It was just a good team win on the road.\"\n\nMcConnell, the second-year point guard, received most of the credit from his teammates after coming up with a key steal and then the big shot.\n\n\"This is my so-called second game-winner in however many years of playing basketball, so I can't be that clutch,\" McConnell said.\n\nBut he wasn't alone. The Sixers got big plays from a lot of places, most of all their bench. The reserves scored 65 points, with Dario Saric leading the way with 24. Nik Stauskas contributed 13 and Sergio Rodriguez added 12 after a strong first half.\n\nErsan Ilyasova was the only starter in double figures with 16 points.\n\n\"We don't win tonight without the bench. They were unbelievable,\" said McConnell, who finished with eight points. \"They came in and picked us up. All credit to them, they did an incredible job.\"\n\nThe Magic played with the lead for much of the game but with Frank Vogel opting to go with a three-guard lineup in the absence of Aaron Gordon for much of the night, Orlando faltered defensively at critical moments.\n\nThe Magic also had 21 turnovers in a game that once led by 15 points. Evan Fournier scored 24 points but also had six turnovers, while Nikola Vucevic had 21 points and 11 rebounds in Orlando's third straight loss.\n\n\"We didn't get the stops,\" Fournier said. \"I feel a lot responsible because I had six turnovers tonight and all those turnovers led to easy baskets. We're upset about it.\"\n\nThe Sixers, meanwhile, head home feeling like they accomplished something with a comeback in the absence of Embiid.\n\n\"There is so much belief,\" said Nerlens Noel. \"We've gone through a few games where we have been struggling but the guys have done a great job of mentally staying prepared for a game like this. We showed up, we were prepared and we did what we had to do.\"\n\nTIP-INS\n\nPhiladelphia: The Sixers are 14-18 with Embiid in the lineup and 6-16 without him. ... The Sixers outscored the Magic 10-1 on second-chance points in the first half.\n\nOrlando: The Magic had a couple of adjustments to their starting lineup Thursday night. C.J. Watson replaced Elfrid Payton at point guard and with Gordon out, second-year swingman Mario Hezonja started at small forward instead of veteran Jeff Green.\n\nTHE OTHER END OF THE LEAGUE\n\nThe win was the 100th for Philadelphia over the last five seasons, the fewest of any NBA team. The 76ers are 100-363 (.216) over that span. The second-worst record belongs to Orlando, 123-342 (.265).\n\nLOSING NUMBERS\n\nThe 76ers have given up more than 100 points in 12 straight games and have been outrebounded in nine straight. They were outrebounded by 16.4 per game during their five-game skid.\n\nMAGIC GIVE AWAY\n\nOrlando gave away $1 million to 17 local nonprofit organizations on Thursday afternoon.\n\nUP NEXT\n\nPhiladelphia: The Sixers return home to take on the Miami Heat on Saturday.\n\nOrlando:  The Magic begin a two-game road swing at Dallas on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995835.466143
}