{
  "game_id": "0022200038",
  "espn_id": "401468193",
  "date": "Oct 23, 2022",
  "matchup": "ATL vs. CHA",
  "headline": "Oubre, Richards power Hornets to 126-109 win over Hawks",
  "body": "ATLANTA -- — Kelly Oubre Jr. scored 24 points, Nick Richards added a career-high 20 points and grabbed 11 rebounds in a reserve role, and the Charlotte Hornets coasted to a 126-109 victory over the Atlanta Hawks on Sunday night.\n\n\r\n              The Hornets won decisively despite being without three projected leading scorers. LaMelo Ball has missed the first three games this season with a left ankle sprain. Terry Rozier couldn’t play after spraining his right ankle in the home-opening loss to New Orleans on Friday, and Miles Bridges has been sidelined since early July with three felony domestic violence charges.\n\n\r\n              “You can always win a game in this league if you have the right approach, the right attitude, you play the right way and then sometimes things go your way, also,\" Hornets coach Steve Clifford said.\n\n\r\n              Those absences had no effect on the Hornets as they went up by 15 early in the third on Gordon Hayward’s straightaway 3-pointer, and the Hawks never recovered. A 3 by Oubre pushed the lead to 18 points, and Richards fast-break layup put Charlotte up 98-78 in the closing minutes of the period.\n\n\r\n              “We believe that we have talent across the board on this roster,\" Oubre said. “Any guy can be thrown in any situation and perform, but it’s early. We know we have to continue to hold down the fort until our guys get back so they can have a smooth transition when they get back on the court.\"\n\n\r\n              Dennis Smith Jr., who started in Rozier’s spot, scored 18 points as the Hornets improved to 2-1 on the young season.\n\n\r\n              Trae Young finished with 28 points and Dejounte Murray had 19 for Atlanta (2-1.) John Collins and Clint Capela each had 10 rebounds.\n\n\r\n              With the lead at 102-82, Young’s frustration showed as he drew a technical foul after arguing his blocked shot should’ve been goaltending. The Hawks trailed by 20 entering the fourth and never came close to single digits of the lead the rest of the way.\n\n\r\n              “I think at the end of that first quarter they got in a rhythm and a groove and then they just got hot,\" Young said. “We started out the game pretty good. I think it was 22-9 (in Atlanta's favor) to start the game and it was really good, but they just got hot and we couldn’t stop them.\"\n\n\r\n              Young, last season’s leader in total points and total assists, had three fouls and sat out during a large portion of the second quarter as the Hornets outscored Atlanta 37-25 in the period.\n\n\r\n              Murray’s four-point play ended an 11-0 run for the game’s first double-digit lead at 15-5 midway through the first. The lead swelled to 13 before the Hornets went on a 22-6 run to go up 33-30 on Smith’s fast-break layup early in the second. \n\n\r\n              Charlotte took its first double-digit lead on Oubre’s jumper at the 1:24 mark of the second and led 59-55 at halftime.\n\n\r\n              “We didn’t play defense,\" Hawks coach Nate McMillan said. “There was no energy. There was no urgency from us on the defensive end of the floor. I didn’t think there was much energy by us on the offensive end of the floor.\"\n\n\r\n              Collins, who averaged 23.5 points in the first two games, was 0 for 4 from the field and had just four points in the first half. He finished with 10 points on 3-of-12 shooting.\n\n\r\n              It was the teams’ first meeting since Atlanta routed Charlotte 132-103 in a play-in game last April.\n\n\r\n              “Tonight was just extra special because this is where our season ended last year,\" Oubre said. “It was a bigger challenge for us to come here and stay locked in and focused on the game plan. Super proud of Coach and super proud of the guys for being ready.\"\n\n\r\n              TIP-INS\n\n\r\n              Hornets: F Cody Martin (left quadriceps soreness) was out. ... James Bouknight, the 11th overall draft pick of 2021, was a combined 0 for 10 from the field in the first two games. He came off the bench to hit a two 3s as Charlotte was making a run early in the second and had a team-high 10 points in the first half. \n\n\r\n              Hawks: G Bogdan Bogdanovic missed his third straight game as he recovers from a right knee injury. There is no timetable for his return. ... Atlanta’s bench was outscored 30-9 in the first half and 52-28 in the game. \n\n\r\n              UP NEXT\n\n\r\n              Hornets: At New York on Wednesday.\n\n\r\n              Hawks: At Detroit on Wednesday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764995216.485996
}