{
  "game_id": "0022301141",
  "espn_id": "401585769",
  "date": "Apr 07, 2024",
  "matchup": "BKN vs. SAC",
  "headline": "Sabonis' 61st straight double-double sparks Kings' 107-77 rout of Nets",
  "body": "NEW YORK -- — Domantas Sabonis had 18 points and 20 rebounds to extend his streak of double-doubles to 61 games, and the Sacramento Kings routed the Brooklyn Nets 107-77 on Sunday night.\n\n\r\n              De’Aaron Fox scored 20 points for the Kings, who improved to 45-33 and stopped a two-game slide that had dropped them into ninth in the Western Conference. Sacramento moved back up to eighth later Sunday when the Los Angeles Lakers lost to Minnesota.\n\n\r\n              Sabonis owns the seventh-longest streak of double-doubles in NBA history, having moved past Elvin Hayes' stretch of 60 straight from Oct. 30, 1968, to Feb. 22, 1969.\n\n\r\n              “He's such a competitor,” Kings coach Mike Brown said. “His competitive nature in my opinion is the thing that just drives him. He very seldom takes plays off. ...He never stops. ”\n\n\r\n              Keegan Murray added 19 points for the Kings, while Trey Lyles had 14 and Davion Mitchell chipped in 12 off the bench.\n\n\r\n              Cam Thomas scored 21 points for the Nets, who had won two straight. Trendon Watford had 16 and Jalen Wilson finished with 11.\n\n\r\n              “We just (have to) keep building,” Brooklyn swingman Mikal Bridges said. “Just keep playing the right way, keep playing hard.”\n\n\r\n              Brown noted before the game that the Kings were in a desperate playoff race.\n\n\r\n              They played like it. Sacramento’s made 51.1% of its shots from the field and 43% of its 3-pointers to take a 65-40 halftime lead. The bench contributed 29 points.\n\n\r\n              The Kings finished with 15 3-pointers and got 42 points from their reserves. \n\n\r\n              And then there was Sabonis.\n\n\r\n              He nearly extended his streak in the first quarter, as the Sacramento center tallied eight points and eight rebounds in the opening 12 minutes.\n\n\r\n              Sabonis scored his 10th point of the game with 4:09 left in the second quarter on a layup, and when he grabbed Watford's missed layup with 2:22 remaining, the Sacramento big man had extended his streak.\n\n\r\n              “He's going to for sure clean up the glass and he's definitely a willing passer,” Brown said. “We definitely need (Sabonis) and his production says so. The two years I've been here (his) anchoring us, especially when it comes to the glass, has been a huge, huge benefit.”\n\n\r\n              The Nets outscored Sacramento 24-13 in the third quarter to cut the deficit to 78-64 heading into the fourth.\n\n\r\n              “I was happy with the guys' effort in the second half,” Nets interim coach Kevin Ollie said. “It was great. That third quarter, they came out and played some solid defense and then we kind of went to our bench in that fourth quarter.”\n\n\r\n              But the Kings ripped off an 18-8 run in the first 6:35 of the fourth quarter. The spurt was highlighted by Fox’s spectacular two-handed dunk.\n\n\r\n              In the final two minutes, Kings fans who made the trip to Brooklyn chanted “Light the beam!”\n\n\r\n              Brooklyn played without starting center Nic Claxton due to a sprained left ankle. The Kings did not have Kevin Huerter (dislocated left shoulder) and Malik Monk (sprained right knee). \n\n\r\n              UP NEXT:\n\n\r\n              Kings: Visits Oklahoma City on Tuesday night.\n\n\r\n              Nets: Host Toronto on Wednesday night. \n\n\r\n               MORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764996607.490346
}