{
  "game_id": "0022200130",
  "espn_id": "401468285",
  "date": "Nov 04, 2022",
  "matchup": "PHX vs. POR",
  "headline": "Grant hits jumper at buzzer, Trail Blazers top Suns 108-106",
  "body": "PHOENIX -- — The Portland Trail Blazers had 1 second left and a game-winning shot opportunity. The problem was their two biggest game-winning-shot-makers were out with injuries.\n\n\r\n              In a weird way, coach Chauncey Billups said he believes that worked in his team's favor.\n\n\r\n              Jerami Grant hit a 13-foot baseline jumper at the buzzer after a great in-bounds pass from Justise Winslow to lift the short-handed Trail Blazers over the Phoenix Suns 108-106 on Friday night.\n\n\r\n              “When you're missing guys like (Damian Lillard) and (Anfernee Simons), you become less predictable,” Billups said. “You never know where the ball is going and that's tough to guard.”\n\n\r\n              Grant's bucket capped a season-high 30 points. The 6-foot-8 forward shot 10 of 17 from the field and added five assists.\n\n\r\n              The Blazers were down to the last second when Winslow lofted a high in-bounds pass to Grant, who grabbed the ball and tossed a high-arching 13-foot jumper in the air. It rattled through the net and after a review the officials confirmed it left his hands in time. It was Winslow's ninth assist of the night.\n\n\r\n              “We've got a connection,” Grant said. ”Been knowing him for long time. I know how he plays and he knows how I play.\"\n\n\r\n              Grant's clutch shot capped a back-and-forth final minute.\n\n\r\n              Devin Booker made a 3-pointer to put the Suns ahead 106-104 with about 30 seconds left, just moments after Jusuf Nurkic sank his own 3 to put the Blazers up 104-103.\n\n\r\n              Nurkic — who had 14 points and eight rebounds — tied the game at 106-all with his putback after an offensive rebound with 23 seconds left. The Suns looked like they would have the final possession of regulation but Mikal Bridges was called for traveling. That gave the Blazers enough time to set up their winning play.\n\n\r\n              Suns coach Monty Williams thought his team defended the Blazers' final play well.\n\n\r\n              “He hit a tough shot,” Williams said. \n\n\r\n              Portland led for most of the night and built a 15-point lead midway through the third quarter, but settled for an 86-80 advantage heading into the fourth.\n\n\r\n              That's about the time the cold-shooting Suns finally started hitting some shots. Damion Lee made three 3-pointers in the fourth, including one from the corner with 4:15 left that tied the score at 97. \n\n\r\n              Portland is now tied with Phoenix atop the Western Conference at 6-2. The Suns' two losses both came against the Blazers.\n\n\r\n              Booker led the Suns with 25 points, while Deandre Ayton added 24 points and eight rebounds. Booker was double-teamed on the final possession and said he didn't regret throwing the ball to Bridges, even though he was called for the travel.\n\n\r\n              “I am going to give it to him every time,\" Booker said. “Whoever is open on this team, that is what it comes down to, trusting your teammates and every possession I am going to do that.” \n\n\r\n              The Blazers won despite missing Lillard and Simons, who have combined to average 53 points per game this season.\n\n\r\n              The Suns had their own injury issues. They were missing both of their backup point guards — Cam Payne and Duane Washington Jr. — so when All-Star Chris Paul was on the bench it was a challenge to get good shots.\n\n\r\n              The Trail Blazers took advantage of the Suns' sloppy second unit on the way to a 59-49 halftime lead. Grant led the Blazers with 18 points while Ayton also had 18 points for the Suns before the break.\n\n\r\n              JOHNSON OUT\n\n\r\n              Suns forward Cam Johnson left the game in the first quarter when he injured his right knee. \n\n\r\n              Johnson scored a season-high 29 points in Tuesday's win over the Timberwolves. He appeared to suffer the injury on Friday when the Suns were in transition. Johnson planted to run down the court, but landed awkwardly and started limping. He came out of the game a few plays later.\n\n\r\n              TIP-INS\n\n\r\n              Trail Blazers: Lillard missed his third straight game.\n\n\r\n              Suns: G Cameron Payne (left foot soreness), G Duane Washington (not with team) and F Ish Wainright (back) were not available to play. ... Had 11 turnovers in the first half. ... Hosted their 32nd consecutive sellout crowd.\n\n\r\n              UP NEXT\n\n\r\n              The teams play again in Phoenix on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995097.005045
}