{
  "game_id": "401809510",
  "espn_id": "401809510",
  "date": "Nov 07, 2025",
  "matchup": "ORL vs BOS",
  "headline": "Franz Wagner and Desmond Bane power the Magic to a 123-110 win over the Celtics",
  "body": "ORLANDO, Fla. -- — Franz Wagner scored 27 points, Desmond Bane added 22 points and seven assists and the Orlando Magic beat the Boston Celtics 123-110 Friday night in their NBA Cup opener.\n\n\r\n              Jaylen Brown scored 32 points for the Celtics. Payton Pritchard added 27 points and Derrick White had 16 points and 10 assists.\n\n\r\n              The Celtics and Magic are grouped with Brooklyn, Detroit and Philadelphia in East Group B of the NBA's in-season tournament. It was their first meeting since the Celtics eliminated the Magic in five games in a first-round playoff series in April. \n\n\r\n              Paolo Banchero finished with 15 points and nine rebounds for the Magic.\n\n\r\n              Wagner, Tristan da Silva and Anthony Black hit 3-pointers as part of a 20-2 run that gave Orlando a 16-point lead in the first quarter, the Magic's largest advantage of the game. \n\n\r\n              The Celtics rallied to tie the game in the second half and led 96-95 when Brown hit his final jumper midway through the fourth quarter.\n\n\r\n              Wagner, Bane and Wendell Carter Jr. (18 points, five rebounds) countered with 3-pointers in a 17-4 run that put the game away.\n\n\r\n              Brown scored 14 straight points for Boston before going to the bench for a six-minute break with 2:20 remaining in the third quarter.\n\n\r\n              Anfernee Simons scored all 11 of his points early in the final period to help Boston stay in it until the final minutes.\n\n\r\n              Orlando shot 50% overall and made 17 of 36 (47.2%) 3-pointers. Boston shot 13 for 37 (35.1%) from distance.\n\n\r\n              Up next\r\n              The Celtics face the Magic again on Sunday in Orlando.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042574.105592
}