{
  "game_id": "0022000602",
  "espn_id": "401307386",
  "date": "Mar 15, 2021",
  "matchup": "CHA vs. SAC",
  "headline": "Rozier, Gordon help Hornets rally past Kings 122-116",
  "body": "CHARLOTTE, N.C. -- — Gordon Hayward saw the athletic De'Aaron Fox closing in on him out of the corner of his eye while driving for a breakaway basket, and he knew he had only one option: dunk it.\n\n\r\n                    So Hayward leaped high and delivered a powerful two-handed dunk over Fox's outstretched arm, drawing a foul on a play that proved pivotal in the Charlotte Hornets' fourth straight win.\n\n\r\n                    “I can still jump from time to time,” the 30-year-old Hayward said with a smile.\n\n\r\n                    Terry Rozier scored 26 points, Hayward added 25 and the Hornets overcame a 15-point deficit in the second half to beat the Sacramento Kings 122-116 on Monday night after trailing almost the entire game.\n\n\r\n                    Fox led the Kings with 29 points, while Richaun Holmes had 17 points and 15 rebounds in a game in which Marvin Bagley III left early with a broken left hand.\n\n\r\n                    Hayward's momentum-turning play came with Charlotte trailing by one with 1:33 left.\n\n\r\n                    The 6-foot-7 Hayward knocked the ball away in the frontcourt, took a lookahead pass from Rozier and dunked over Fox, bringing the pandemic-restricted crowd of about 3,000 to its feet. He was fouled on the play and made the free throw to give Charlotte its first lead at 113-111.\n\n\r\n                    “When I got the kick-out I did see Fox and he’s just super athletic, so I thought he would try to challenge,” Hayward said. “In those situations, you definitely cannot try to lay it up. You have to go dunk it — and that’s what I did.” \n\n\r\n                    Said Hornets coach James Borrego of the team's biggest acquisition this offseason: “He makes winning plays.”\n\n\r\n                    He isn't the only one making winning plays for this surprising Hornets team, which moved into a tie for fifth place in the Eastern Conference with the Boston Celtics.\n\n\r\n                    After Hield quickly tied the game at the other end, Rozier, who has earned a reputation this season as being fearless, answered with a huge 3-pointer from the left wing to put the Hornets ahead for good with 54 seconds left,\n\n\r\n                    “Clutch. Ice in his veins, there’s no doubt about it,\" Hayward said Rozier. \n\n\r\n                    Down three, the Kings (15-24) fouled Bismack Biyombo — a 57.1% career free throw shooter — and he missed both shots. But the reserve center quickly redeemed himself at the other end of the court by blocking Fox on a drive to the basket with 34 seconds left.\n\n\r\n                    Rozier and Hayward, who were a combined 13 of 13 from the foul line, helped iced the game with each making a pair of free throws in the closing seconds helping the Hornets outscore the Kings 21-8 in the final 5 1/2 minutes.\n\n\r\n                    “I’m extremely proud of this group,\" Borrego said. “For some reason, we play our best basketball down the stretch and I guess, if there’s a time to pick your best basketball, it’s the last four or five minutes of the game. This group, they continue to fight.”\n\n\r\n                    TIP INS\n\n\r\n                    Kings: Shot 55.8% from the field and scored 68 points in the paint. ... Coach Luke Walton picked up a technical foul in the third quarter.\n\n\r\n                    Hornets: LaMelo Ball had 16 points and four assists. ... Bench outscored the Kings 42-22. ... Had 30 assisted baskets.\n\n\r\n                    BAGLEY'S HAND\n\n\r\n                    The Kings announced after the game that Bagley sustained a fracture of the fourth metacarpal in his left hand. He will undergo further medical evaluation and an update regarding course of treatment will be provided in the coming days.\n\n\r\n                    “He’s put in so much hard work this year,\" Walton said. “I’ve said all year long, he’s continued to make really big strides and he was putting together a heck of a game tonight. We’re going to miss him.”\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Visit Wizards on Wednesday night.\n\n\r\n                    Hornets: Will play 11 of their next 13 games on the road beginning Wednesday night at Denver.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997016.183247
}