{
  "game_id": "0021600700",
  "espn_id": "400900121",
  "date": "Jan 27, 2017",
  "matchup": "CHI vs. MIA",
  "headline": "Goran Dragic leads Heat to 6th straight, 100-88 over Bulls",
  "body": "CHICAGO -- The mantra of every struggling team is to keep working and things will eventually turn around.\nAlthough it rarely works out that way, the Miami Heat are trying to be the exception.\nGoran Dragic had 26 points and 11 assists, Willie Reed scored 20 points and Dion Waiters added 19 to lead the Heat to their sixth straight win Friday night, a 100-88 victory over the bickering Chicago Bulls.\nDragic was asked what has pleased him most about the streak following an 11-30 start.\n\"That we're doing it as a team,\" he said. \"We're playing for each other, we're fighting for each other. Everybody's feeling comfortable. We know what we need to do. As long as we take care of business with the defense, we feel like can play with anyone.\"\nDwyane Wade had 15 points to lead the Bulls, who began the day with a team meeting and ended it with a second straight frustrating loss.\nWade and Jimmy Butler started the controversy when they questioned the desire of the team's younger players following a loss to the Atlanta Hawks on Wednesday. Rajon Rondo fired back a day later, criticizing Wade and Butler in an Instagram post.\nAll three players were fined, and Wade and Butler were held out of the starting lineup as punishment.\n\"We obviously had a very emotional day,\" coach Fred Hoiberg said. \"It's not an excuse for how we played. It's the worst game we've played all year, in my opinion.\"\nButler was the first off bench and received a loud ovation from the United Center crowd when he checked in with 6:53 remaining in the first quarter. Wade also received a loud ovation when he entered 28 seconds later.\nRondo, though, was greeted by some boos when he checked in with 5:05 to go in the first.\nWhether it was the controversy or coming off the bench, Butler never developed a rhythm and finished with just three points on 1-for-13 shooting.\n\"I'll be back,\" he said. \"I promise I will be back. I am not worried at all.\"\nMiami took control with a 24-14 advantage in the third quarter to break open a tie game at halftime. The Bulls tried to rally in the fourth, but the Heat answered every charge.\n\"I liked our toughness, in the second half especially,\" Heat coach Erik Spoelstra said.\nTIP INS\nHeat: C Hassan Whiteside didn't play because of a sprained right ankle suffered Wednesday night against Brooklyn.\nBulls: Part of the frustration for Wade and Butler against the Hawks was losing a game in which they combined for 73 of the Bulls' 114 points. It was the first time they each had scored at least 30 points in a game this season.\nMEDIA UNFRIENDLY\nBesides Wade and Butler not starting, all three players were fined for airing grievances in the media and on social media. General manager Gar Forman made his displeasure known in the team meeting and in individual talks with the players.\n\"It's not how we want to operate,\" Forman said. \"It is totally unacceptable, and we made it very clear to the players that were involved that it's unacceptable. It's a distraction that's not needed. I think it's a detriment to team growth.\"\nNO REGRETS\nWith the controversy and recent struggles, Wade was asked if he had any second thoughts about signing with the Bulls after spending his first 13 seasons with the Heat.\n\"I've been happy,\" he said. \"The process of losing ballgames is never fun. ... I'm not having fun being an average team, from that standpoint, but I am enjoying the journey.\"\nMOVING ON\nAs part of his Instagram post, Rondo said his \"vets\" with the Celtics didn't take days off, a clear shot at Wade.\n\"I could take that as a personal attack,\" he said. \"But what's that going to do for me? Come in here and fight Rajon because he said his vets practiced every day? I'm 35. I'm not practicing every day. That's very clear.\"\nUP NEXT\nHeat: Host the Pistons on Saturday night. Miami has dropped its first two games against Detroit by a combined 32 points.\nBulls: They wrap up a three-game homestand Sunday night against the Philadelphia 76ers before beginning a six-game road trip.",
  "source": "espn_api",
  "crawled_at": 1764995046.8572931
}