{
  "game_id": "0022300283",
  "espn_id": "401584911",
  "date": "Dec 02, 2023",
  "matchup": "DET vs. CLE",
  "headline": "Strus, Garland each score 22 points, Cavaliers hand Pistons 17th straight loss",
  "body": "DETROIT -- — Max Strus and Darius Garland each scored 22 points and the Cleveland Cavaliers handed the Detroit Pistons their 17th straight loss, 110-101 on Saturday.\n\n\r\n              “That was a physical game,” said Strus, who scored 14 points in the second half. “You could tell they were trying to earn one, and all respect to them. They played hard and they crashed the glass.”\n\n\r\n              The Pistons are 2-18, with the losing streak the longest in one season in franchise history and second-longest overall behind a 21-game slide at the end of the 1979-80 season and start of 1980-81. They haven't won since Oct. 28 against Chicago and are 4-41 since last season's trade deadline.\n\n\r\n              \"I want to win, because I know how hard it is, especially when you’re young and we’re struggling,” said Bojan Bogdanovic, who had 22 points in his season debut after an offseason calf injury. “It’s hard to say good words and hard to say something positive. We want to win.”\n\n\r\n              Donovan Mitchell added 20 points for Cleveland, and Jarrett Allen had 19 points and 11 rebounds, but Strus and Cavaliers coach J.B. Bickerstaff had special praise for reserve Isaac Okoro. He had nine points, seven rebounds, four steals and four assists in 33:01 off the bench.\n\n\r\n              “He was unbelievable down the stretch,” Bickerstaff said. “He was taking charges, making shots, driving to the basket and scoring. He was awesome when we needed him to be, and that's who he is.”\n\n\r\n              Cade Cunningham added 23 points and 11 assists for Detroit.\n\n\r\n              Detroit started the second half with a 10-0 run to take a 58-54 lead, and pushed the advantage to eight. Cleveland, though, used an 11-0 run to take an 81-77 lead with 1:13 left in the quarter.\n\n\r\n              Detroit outscored the Cavaliers 34-31 in the period, but Allen's layup with 2.1 seconds left put Cleveland up 85-82 going into the fourth and the Cavs quickly took a 10-point lead.\n\n\r\n              “When you’ve lost this many games, you’re trying to do your darndest to do whatever it takes to win the game,” Pistons coach Monty Williams said. “We just had a lull in the second and then we had that lull at the end of the third and the beginning of the fourth.\"\n\n\r\n              Jaden Ivey's free throw pulled Detroit to 96-92 with 6:01 left, but Bogdanovic missed a tying 3-pointer with 3:29 left. Garland scored at the other end and, after another Bogdanovic miss, Mitchell made it 104-97.\n\n\r\n              “I ran some stuff down the stretch for (Bogdanovic), but I think he was a bit gassed at that moment,” Williams said. “I just love having him on the floor.” \n\n\r\n              Jalen Duren missed two free throws with 2:13 to play, and Allen's tip put it away.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Orlando on Wednesday night.\n\n\r\n              Pistons: Host Memphis on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995783.994252
}