{
  "game_id": "0022400023",
  "espn_id": "401703392",
  "date": "Nov 19, 2024",
  "matchup": "MEM vs. DEN",
  "headline": "Murray, Porter lead Nuggets past Grizzlies 122-110",
  "body": "MEMPHIS, Tenn. -- — Jamal Murray scored 27 points, Michael Porter Jr. added 24 points and 10 rebounds as the the Denver Nuggets snapped a two-game losing streak defeating the Memphis Grizzlies 122-110 in an NBA Cup game on Tuesday night.\n\n\r\n              Christian Braun finished with 19 points, while Russell Westbrook added 12 points, 14 assists and 10 rebounds.\n\n\r\n              Santi Aldama led Memphis with 28 points, matching his career high. Jaren Jackson Jr. had 19 points, eight rebounds and five blocks. Scotty Pippen Jr. scored 16 points.\n\n\r\n              It was the second straight game between the two teams. Memphis defeated Denver 105-90 on Sunday. The Nuggets had lost two straight, the slide coinciding with the absence of reigning MVP Nikola Jokic who missed his third straight game Tuesday for personal reasons.\n\n\r\n              Takeaways\r\n              Nuggets: After Sunday's loss to the Grizzlies, Denver coach Michael Malone encouraged his team to play more physical. Denver started the game with much more fire on Tuesday, forcing Memphis turnovers with more aggressive defense.\n\n\r\n              Grizzlies: Memphis is one of the worst teams in the league at protecting the ball, committing 16.6 turnovers a game. The Grizzlies already had 14 in the first half, leading to 16 Denver points and a double-digit Nuggets lead at the break. \n\n\r\n              Key moment\r\n              Memphis was already reeling at halftime trailing 68-57, and Denver opened the second half outscoring Memphis 15-1 to take the lead to 83-58, enough of a buffer to withstand Memphis' rally in the fourth.\n\n\r\n              Key stat\r\n              Denver did not shoot well in Sunday's loss to Memphis, connecting on 41.7%. In Tuesday's victory, the percentage was much better at 48.5%. The Nuggets are now 8-0 when they shoot better than 45%. Meanwhile, Memphis is winless in NBA Cup games 0-6 over the last two seasons.\n\n\r\n              Up next\r\n              The Nuggets returns home to face Dallas on Friday. The Grizzlies host Philadelphia on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997751.9209511
}