{
  "game_id": "0022300159",
  "espn_id": "401584787",
  "date": "Nov 08, 2023",
  "matchup": "PHI vs. BOS",
  "headline": "Joel Embiid, Tyrese Maxey lead 76ers to sixth straight win, 106-103 over the Boston Celtics",
  "body": "PHILADELPHIA -- — The 76ers did what they could to shed themselves of the bad vibes that lingered over the franchise in the wake of an appalling postseason exit.\n\n\r\n              They hired a new coach. They traded a malcontent. \n\n\r\n              Joel Embiid and Tyrese Maxey are determined to show the new-look 76ers won't suffer the same-old postseason fate.\n\n\r\n              Embiid had 27 points and 10 rebounds and Maxey had 25 points and nine assists to lead the Philadelphia 76ers to their sixth straight win, 106-103 over the Boston Celtics on Wednesday night.\n\n\r\n              The 76ers are the only 6-1 team in the Eastern Conference and their lone loss came on opening night. \n\n\r\n              They are 5-0 at home.\n\n\r\n              “New coach, new systems, bunch of new guys, just trying to get everybody up to speed,” Embiid said. “Let's see what we can do.”\n\n\r\n              Kristaps Porzingis led the Celtics with 29 points and Derrick White, back after missing two games for the birth of his child, had 19.\n\n\r\n              The Sixers were amped for the first game between the long-time rivals since their Eastern Conference semifinal matchup last season.\n\n\r\n              The 76ers blew a 3-2 series lead and collapsed in Game 6 and 7 losses that ushered in a summer of upheaval. Coach Doc Rivers was fired and replaced by Nick Nurse. James Harden soon demanded a trade and never again played for the Sixers.\n\n\r\n              The Celtics didn’t stand pat after coming up a game short last season of making back-to-back trips to the NBA Finals. They acquired the 7-footer Porzingis and five-time all-defensive selection Jrue Holiday.\n\n\r\n              Throw in Giannis Antetokounmpo and Damian Lillard in Milwaukee and the 76ers didn't get pegged in the preseason as a serious contender in the East.\n\n\r\n              Maybe it's time to reconsider.\n\n\r\n              “Boston got a lot better,” Embiid said. “They looked like they're the best team in the NBA, by far. Good for them. Milwaukee, too, Obviously, adding Dame is huge. He's amazing. That combination of Dame and Giannis, pretty good. Unstoppable.\"\n\n\r\n              For a moment in Philly, the echoes of Game 6 seemed too familiar. \n\n\r\n              Jayson Tatum’s 3-pointer pulled the Celtics to 94-87 and flashed reminders of the decisive ones he hit late in Game 6 — he buried one 3 for an 84-83 lead and a second that made it 87-83 — for the playoff win in Philly.\n\n\r\n              His shot on Wednesday started another Boston comeback. Tatum hit another bucket that pulled the Celtics within four with 61 seconds left but Embiid answered with a fadeaway. Jaylen Brown hit a step-back 3 that made it 106-103.\n\n\r\n              Porzingis missed a 3 in the final seconds and the Celtics lost their second straight game.\n\n\r\n              “It was a really good look,” he said. “As I went into the shot, I kind of went into it as it was a mid-range shot. I jumped a little higher. I usually don't do that for 3s. I just shot it bad.\"\n\n\r\n              Tatum finished with 16 points and 15 rebounds. The Celtics were 15 of 47 from 3-point range.\n\n\r\n              Tobias Harris scored 17 for the Sixers.\n\n\r\n              Amid the recent roster changes, the one constant for the Sixers is Embiid. The reigning MVP scored 13 points in the third quarter. His quarter almost seemed quiet compared to the 29 points he scored on 10 of 10 shooting in the third on Monday against Washington.\n\n\r\n              He buried a 3 from well beyond the top of the arc for a 72-68 lead that sent the crowd into a frenzy. Porzingis missed a dunk and Robert Covington — one of a handful role players acquired in the Harden deal — came right down and hit a 3. Embiid raised his arms, exhorting the crowd to get louder, as the 76ers closed the quarter up 81-71.\n\n\r\n              “Any time you're playing against a great team, like Maxey and Embiid, if you're down 10, you're down 15 to 18 because of their ability to make shots,” Celtics coach Joe Mazzulla said.\n\n\r\n              Both teams were an Eastern Conference-best 5-1 coming in and the Sixers talked openly about using this game as an early-season measuring stick. They passed this one.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host Brooklyn on Friday in an In-Season Tournament game.\n\n\r\n              76ers: Play Friday at Detroit in an In-Season Tournament game.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996439.064579
}