{
  "game_id": "0022000678",
  "espn_id": "401307467",
  "date": "Mar 25, 2021",
  "matchup": "MIA vs. POR",
  "headline": "McCollum, Blazers hold off short-handed Heat, 125-122",
  "body": "MIAMI -- — CJ McCollum got Portland started, and Damian Lillard provided the finish.\n\n\r\n                    Lillard made three free throws with one second remaining for the final margin, and the Trail Blazers survived a wild ending to beat the short-handed Miami Heat 125-122 on Thursday night.\n\n\r\n                    Lillard was fouled by Miami’s Trevor Ariza on a 3-point attempt, which the Heat argued to no avail. He coolly sank all three foul shots, and the Blazers snapped a two-game slide.\n\n\r\n                    “Sometimes I might have it going, but he's the closer,\" McCollum said of Lillard.\n\n\r\n                    Miami didn’t have a time-out remaining to advance the ball and couldn’t get a desperation attempt to tie the game off before time expired.\n\n\r\n                    McCollum had 21 of his game-high 35 points in the first quarter for Portland, which got 22 points from Lillard, 20 points from Carmelo Anthony and 18 points to go along with 16 rebounds from Enes Kanter.\n\n\r\n                    Bam Adebayo and Tyler Herro each had 29 points for Miami, which dropped its fifth straight and fell to 22-23. Kendrick Nunn scored 22 for the Heat.\n\n\r\n                    “I was happy with the way we fought out there,\" Herro said. “That was a great game, down to the end and they came down with a couple more free throws.\"\n\n\r\n                    A combination of trades, illness, injury and virus-related issues left the Heat with nine players for the game.\n\n\r\n                    Victor Oladipo and Nemanja Bjelica have yet to join the club after being acquired earlier Thursday in moves that sent Kelly Olynyk and Avery Bradley to Houston, plus Chris Silva and Moe Harkless to Sacramento. The other Heat absences: Jimmy Butler was sick, Goran Dragic has a back issue and Udonis Haslem and KZ Okpala remain in the league’s health and safety protocols. \n\n\r\n                    Portland took a 100-99 lead with 7:57 left on a 3-pointer by Anthony. To that point, neither team had been up by more than eight all night.\n\n\r\n                    Miami then went on an 11-0 run to take a 110-100 lead, with Gabe Vincent, Andre Iguodala and Herro all making 3-pointers on consecutive possessions and Herro adding a pair of free throws to cap the spurt.\n\n\r\n                    Portland answered with an 11-0 run of its own, taking the lead back on a layup by Lillard with 3:48 left.\n\n\r\n                    Back and forth they went the rest of the way, with some team either taking the lead or pulling into a tie eight times in the final 1:44. Lillard got the call from referee Brian Forte at the end, and Portland got the win.\n\n\r\n                    “Brian saw it one way, we see it another way,\" Heat coach Erik Spoelstra said. “I think it was a great game and a buzzkill way to end it. I think everybody wanted to see overtime, but Lillard's also a great player. He puts a lot of pressure on you.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: McCollum now has five quarters with at least 21 points in his career, including a 28-point first quarter against Chicago in 2018. The NBA-high for a first quarter this season is 22 by Denver’s Nikola Jokic vs. Utah on Jan. 31. ... Former Heat forward Derrick Jones Jr., who started for Portland, spent a few minutes at halftime greeting staff in the Miami bench area.\n\n\r\n                    Heat: Miami went 0-4 on its homestand, the first time it was winless on a homestand of that length since 2008. ... The Heat used their 19th starting lineup of the season. ... Duncan Robinson scored 12 for Miami.\n\n\r\n                    MOVING UP\n\n\r\n                    Anthony broke his tie with Dirk Nowitzki and moved into outright possession of fourth place on the all-time opponent regular-season scoring list at AmericanAirlines Arena. He has 463 points, trailing only Paul Pierce (599), LeBron James (569) and Vince Carter (561). Nowitzki had 443.\n\n\r\n                    NURKIC RETURNING\n\n\r\n                    Blazers center Jusuf Nurkic announced on Twitter earlier Thursday that he was cleared to resume game play Friday in Orlando. He missed 32 games with a broken right wrist and will be on a minutes restriction Friday.\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Visit Orlando on Friday.\n\n\r\n                    Heat: Visit Charlotte on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997817.610832
}