{
  "game_id": "0021600982",
  "espn_id": "400900377",
  "date": "Mar 11, 2017",
  "matchup": "PHX @ DAL",
  "headline": "Devin Booker hits winning shot, Suns beat Mavericks 100-98",
  "body": "DALLAS --  Devin Booker figured he'd have a better chance to win the game one-on-one than with help.\n\n\"Coach asked me did I want a screen,\" the Phoenix guard said. \"I said no because I figured they'd double-team it, so I just went with isolation. With Wesley (Matthews) being one of the better defenders, I knew it was going to be a tough shot, so I shot a little fadeaway and it went.\"\n\nBooker's 19-foot jumper over Matthews with 1.4 seconds left gave the Suns a 100-98 victory over the Dallas Mavericks on Saturday night.\n\nBooker scored 25 of his 36 points in the second half. He scored the Suns' final eight points, twice making tying baskets. After Matthews missed a 3-point attempt, Booker hit the winner.\n\nThe Mavericks failed to get off a shot before time expired.\n\nBooker made 12 of 20 field goal attempts, and all 10 free throws.\n\n\"A dominant performance tonight, especially down the stretch,\" Phoenix coach Earl Watson said. \"Devin played on another level. He's 20 years old, two game winners so far this year. He wanted to take the last shot and he's confident that it'll go in. The kid is going to be pretty special.\"\n\nDallas coach Rick Carlisle said the loss was his fault.\n\n\"Clearly, we should have gone and double-teamed the guy the whole fourth quarter,\" Carlisle said. \"I'm taking full responsibility for this whole thing. Next year when we play these guys again, we'll have to consider double-teaming him earlier.\"\n\nThe Suns have won four of six. They ended Dallas' four-game winning streak.\n\nDirk Nowitzki had 23 points -- 19 in the first half -- and added 11 rebounds for Dallas. Harrison Barnes also scored 23 points for the Mavericks, making a career-high 13 free throws in 14 attempts.\n\nT.J. Warren scored 16 points for Phoenix, Eric Bledsoe had 12, and Alan Williams 10.\n\nDevin Harris had 14 points for Dallas, and Yogi Ferrell added 13 for the Mavericks.\n\nDallas led 96-92 with 2:04 to play before Booker scored on two straight trips down the floor to tie it. After Harrison Barnes made two free throws, Booker scored again for a 98-98 tie.\n\nTIP-INS\n\nSuns: Alex Len did not play after injuring a hip in the pre-game warmup. ... Rookie Tyler Ulis has averaged 11 minutes per game this season, but that has increased to 23 over the last five games. \"Tyler's playing well,\" Watson said.\" At the same time, (Bledsoe) kind of has been limping with a knee injury recently, so we're going to make sure we keep track of that.\" Bledsoe leads Phoenix with 21 points and six assists per game.\n\nMavericks: Nerlens Noel missed both games of Dallas' weekend back-to-back because of a sore left knee. \"We're hoping he can play Monday,\" Carlisle said. ... Dallas stayed in the game by making a season-high 33 of 36 free throw attempts. ... Nowitzki's double-double was the 404th of his career.\n\nOPENING ACT\n\nIn the first quarter, Nowitzki made five of six field goal attempts. His teammates were 1 for 10. Neither team missed a free throw (Dallas 11 for 11, Phoenix five for five). Neither team had an offensive rebound.\n\nSURE SHOT\n\nSuns rookie Derrick Jones Jr., who made his first start, extended his streak of field goals made to 10 in a row with a first-quarter jump shot. He missed a layup in the third quarter to end the streak. He also missed his first NBA 3-point attempt. He's 24 for 3 (77 percent) for the season.\n\nNUMBER 11. WHO?\n\nMavericks F Dorian Finney-Smith thought his jersey was a bit tight when he put it on before the game. Then it was pointed out to the 6-8 Finney-Smith that he was wearing the No. 11 jersey of 6-0 G Yogi Ferrell. At the adjacent locker, Ferrell checked and saw that he had Finney-Smith's No. 11 jersey.\n\nUP NEXT\n\nSuns: Begin a three-game homestand on Sunday vs. Portland.\n\nMavericks: Start a four-game trip on Monday at Toronto.",
  "source": "espn_api",
  "crawled_at": 1764995954.8484218
}