{
  "game_id": "0021800059",
  "espn_id": "401070740",
  "date": "Oct 24, 2018",
  "matchup": "MIL vs. PHI",
  "headline": "Antetokounmpo's triple-double leads Bucks past 76ers 123-108",
  "body": "MILWAUKEE --  After a cold start, Giannis Antetokounmpo and the Milwaukee Bucks offense again roared to life, including a near-record output in the second quarter.\n\nBefore celebrating the scoring outburst, coach Mike Budenholzer wanted to talk about his team's second-half defense after a 123-108 win over the Philadelphia 76ers on Wednesday night.\n\nAfter surrendering 64 first-half points, Milwaukee's defense buckled down in the second half, holding the 76ers to 44 points, including 17 in the third quarter.\n\n\"We've got to have our defense there no matter what we are doing on the other end,\" Budenholzer said. \"When you do that, you can keep a lead and maybe build a lead.\"\n\nEric Bledsoe said the turnaround stemmed from paying greater attention to the defensive game plan.\n\n\"I thought we did a poor job in the first half,\" Bledsoe said. \"We locked in during the second half.\"\n\nAntetokounmpo had 32 points, 18 rebounds and 10 assists to lead the Bucks, who improved to 4-0 for the first time since the 2001-02 season.\n\nAntetokounmpo downplayed his performance.\n\n\"I feel like I can be way better and help my teammates find open shots even more and I'm going to keep trying to get better,\" he said.\n\nKhris Middleton had 25 points, and Brook Lopez chipped in 21.\n\nJoel Embiid scored 30 points for Philadelphia, which was coming off a wild 133-132 overtime loss Tuesday at Detroit. JJ Redick added 19 points for the 76ers, who fell to 2-3.\n\nThe Bucks overcame early ice-cold shooting before gradually taking control.\n\nLopez misfired on his first four 3-point attempts but then sank five straight to spark a second-quarter rally.\n\n\"We all came out and struggled a little bit shooting it, but we have to stick with it,\" Lopez said.\n\nAntetokounmpo had a message for Lopez after the early misses.\n\n\"Keep shooting. That's what I told him, personally,\" Antetokounmpo said. \"I heard everybody tell him to keep shooting. We don't want Embiid staying in the paint all night. He's not going to give us driving lanes. He made some shots and the paint opened up.\"\n\nLopez's shooting helped propel the Bucks to 49 second-quarter points, four shy of the team record for a quarter.\n\n\"You have to pick your poison and figure out what you can live with,\" 76ers coach Brett Brown said. \"You can't have it all. Give him credit, he made those shots. It was hard to overcome that many points in the second period.\"\n\nThe Bucks led by eight during the second quarter and held a 71-64 advantage at the break. Middleton had 20 first-half points, and Redick had 16.\n\nMilwaukee stretched the lead to 15 during the third quarter and held a 92-81 advantage heading to the fourth.\n\nThe Bucks poured it on in the final period, building a 16-point lead midway through. The 76ers pulled within eight late, but a pair of free throws by Antetokounmpo and a driving, one-handed scoop layup by Eric Bledsoe quickly pushed the lead to 12.\n\nThe 76ers held a 34-22 lead after one quarter by making 6 of 8 from 3-point range, with five players sinking shots from deep. The Bucks made just 1 of 11 3s and shot 23 percent overall, trailing by 14 at one point.\n\nThe Bucks finished 13 for 43 from long range for the game.\n\nFAST PACE\n\nThe Bucks have pushed the pace on offense under first-year coach Budenholzer, which left Antetokounmpo with his hands on his knees on a few occasions.\n\n\"We play fast. I was a little bit out of breath,\" he said. \"I've got to get in shape.\"\n\nTIP-INS\n\n76ers: Ben Simmons left Saturday's game against Orlando in the first quarter and didn't play Tuesday night against Detroit. He logged 37 minutes Wednesday night. ... Embiid has recorded a double-double in all five of the team's games. ... Brown on Bucks forward Ersan Ilyasova, who played with Philadelphia last season: \"He's a fantastic teammate. He's a pro's pro. He's a prideful worker and he is skilled at what he does.\"\n\nBucks: Matthew Dellavedova missed the game due to illness. ... D.J. Wilson also was inactive with a right hamstring injury.\n\nUP NEXT\n\n76ers: Host Charlotte on Saturday night.\n\nBucks: At Minnesota on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994534.877106
}