{
  "game_id": "0022000099",
  "espn_id": "401267259",
  "date": "Jan 04, 2021",
  "matchup": "MIL vs. DET",
  "headline": "Giannis scores 43 as Bucks beat Pistons 125-115",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 43 points and the Milwaukee Bucks defeated the Detroit Pistons 125-115 on Monday night to move above the .500 mark for the first time this season.\n\n\r\n                    The reigning two-time MVP scored 30 points by halftime, shot 17 of 24 from the floor overall and finished with nine rebounds. \n\n\r\n                    Antetokounmpo said he might have gotten a little more room to operate inside because the Bucks (4-3) have shot so well from 3-point range lately. Milwaukee made at least 20 3-pointers in three of its first six games, including 22 in a 126-96 blowout of Chicago on Friday.\n\n\r\n                    “They know that the previous game I’d been finding my teammates for a lot of 3s, finding the shooters,” Antetokounmpo said. \"Coming to this game, they probably were like, ‘Don’t let them pick us apart with our passing.’ That’s why there was a lot of space.”\n\n\r\n                    Antetokounmpo's presence helped the Bucks outscore the Pistons 62-42 in the paint, including a 40-14 edge in the first half.\n\n\r\n                    “Next game we've just got to make it harder for him,” said Detroit guard Derrick Rose, who scored 24 points off the bench to match Jerami Grant for the team lead. “Nobody was taking any charges tonight against him. We didn't make him think.”\n\n\r\n                    The Bucks (4-3) have won their last eight regular-season meetings with the Pistons, which represents the longest streak for either team in the history of the series.\n\n\r\n                    Detroit (1-6) played without two of its top three scorers in Blake Griffin and Josh Jackson. \n\n\r\n                    The Pistons rested Griffin to protect his surgically repaired left knee after he played 29 minutes a night earlier in a  122-120 loss to Boston. Jackson has a sprained right ankle.\n\n\r\n                    Milwaukee's Khris Middleton scored 19 points, Jrue Holiday had 15 and D.J. Augustin 11. Bryn Forbes and Bobby Portis added 10 each. \n\n\r\n                    Sekou Doumbouya, Wayne Ellington and Svi Mykhailiuk scored 13 each for the Pistons.\n\n\r\n                    Milwaukee went ahead for good midway through the first quarter and led by as much as 18, though Detroit cut the margin to single digits in the fourth quarter.\n\n\r\n                    The Bucks led 118-110 with just over two minutes left when Doumbouya drove into the lane and had his shot blocked by Antetokounmpo. The star forward followed that up with a putback on the other end to give Milwaukee a 10-point edge with 1:39 remaining.\n\n\r\n                    Detroit never threatened again.\n\n\r\n                    “They just kept coming at us, coming at us,” Bucks coach Mike Budenholzer said. “They made some big 3s, tough 3s, and that blocked shot and then the putback was big.”\n\n\r\n                    TIP-INS\n\n\r\n                    Pistons: Detroit coach Dwane Casey is optimistic Jackson will return for Wednesday’s game at Milwaukee. “If it was up to him, he’d probably be ready to go again tonight. But take our time, let it get fully healed and try not to cause any further damage,” Casey said. \n\n\r\n                    Bucks: Milwaukee didn’t have reserve guards Pat Connaughton or Sam Merrill available. Budenholzer said Connaughton strained his left groin in practice and Merrill sprained his left ankle while landing on a stanchion during Friday's game. Budenholzer didn’t have a timeline for when either player might return.\n\n\r\n                    HAYES HURT\n\n\r\n                    Pistons rookie guard Killian Hayes headed to the locker room early in the third quarter after he got hurt making a diving attempt to deflect a pass. Casey said Hayes would get an MRI on Tuesday.\n\n\r\n                    “They thought it was a hip flexor, but they weren't sure, so they're going to see,” Casey said.\n\n\r\n                    UP NEXT\n\n\r\n                    The teams play in Milwaukee again on Wednesday. This is the Pistons’ second straight back-to-back set, as they split two home games with Boston on Friday and Sunday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997419.46881
}