{
  "game_id": "0021900490",
  "espn_id": "401161132",
  "date": "Dec 29, 2019",
  "matchup": "LAL vs. DAL",
  "headline": "LeBron reaches assist milestone as Lakers beat Mavericks",
  "body": "LOS ANGELES --  On the night before his 35th birthday, LeBron James reached another milestone.\n\nJames became the ninth player in NBA history with 9,000 assists during the Los Angeles Lakers' 108-95 victory over the Dallas Mavericks on Sunday.\n\nJames -- named the Associated Press Male Athlete of the Decade earlier in the day -- got No. 9,000 with 4:35 remaining in the first quarter when he fired an outlet pass to Anthony Davis three-quarters of the way down the court for a dunk. It was one of 13 assists on the night for King James.\n\n\"It was something that was instilled in me when I first picked up a basketball,\" James said about his ability to distribute the ball. \"One of my earliest coaches said the best part of the game was to move side to side, attract the defense and get the teammate the open look.\"\n\nJames, who scored 13 points, has been more aggressive running the point the past two games. He totaled 29 assists and only three turnovers in victories over Portland and Dallas.\n\n\"His pace the last two nights has been outstanding, and not wanting to settle,\" Lakers coach Frank Vogel said. \"We have done a much better job of living in the paint the past couple games, making great decisions and being aggressive.\"\n\nJames concurred that he's been more aggressive because he wants to get up the floor quicker to have more time to see what opposing defenses are doing.\n\n\"My teammates and coaching staff trust me to play the point and run the show,\" he said. \"It's my job to take care of the ball, put guys in position to be successful, get them the ball on time and on target.\"\n\nDavis led the Lakers with 23 points and nine rebounds. Kentavious Caldwell-Pope added a season-high 19 points, including four 3-pointers, and Dwight Howard scored 15. All of Howard's points came in the second quarter.\n\nThe Lakers'defense was also impressive as they held the Mavericks to a season low in points and shooting from the floor at 36%. Vogel said he threw in some zone defenses for the first time in the regular season.\n\n\"I think it was good and messed them up a little bit. It disrupted them a little bit,\" Davis said.\n\nLuka Doncic led Dallas with 19 points but struggled from the field one night after getting his ninth triple-double of the season. The second-year guard shot 5 of 14 and missed all six of his 3-point attempts.\n\n\"That was one of the worst games we played. We didn't play like us and had a really bad night. I can't say much more,\" Doncic said.\n\nDelon Wright came off the bench to score 14 points. Dorian Finney-Smith and J.J. Barea had 12 apiece.\n\nLos Angeles, which has won two straight after a four-game losing streak, led most of the way. The Lakers were up 35-31 midway through the second quarter before going on a 12-2 run to take control. The Mavericks committed four turnovers during a spurt that led to seven Lakers points, including a pair of dunks by Howard.\n\nThe Lakers' largest lead was 17 midway through the third.\n\n\"They played with more force. Any time we started to get some traction they had an answer,\" Dallas coach Rick Carlisle said.\n\nSURPRISE MEETING\n\nDoncic got to shake hands with Lakers great Kobe Bryant courtside after the game and said he was surprised.\n\n\"He was talking Slovenian. He was talking my language. I saw Kobe talking Slovenian and I was really surprised,\" Doncic said.\n\nTIME TO REFLECT\n\nJames said he would have a small birthday party Monday but did acknowledge that turning 35 was special.\n\n\"I don't have wishes. Biggest one I had was when I turned 21. This one will be mild. When I turn 40, that will be epic,\" he said.\n\nTIP-INS\n\nMavericks: G Tim Hardaway Jr. tweaked his hamstring during the first quarter and did not return. Carlisle said after the game the team was optimistic it was nothing serious and Hardaway is day-to-day. ... Dwight Powell had 11 rebounds, marking his second game this season with double digit boards. ... Kristaps Porzingis scored 11 points.\n\nLakers: It was the 25th time in Howard's 15-year career that he scored 15 or more in a quarter. The last time was March 21, 2018, for Charlotte against Brooklyn when he put up 19. ... Los Angeles is 4-0 during road/home back-to-back games. ... JaVale McGee had 11 points and Danny Green added 10.\n\nUP NEXT\n\nMavericks: Travel to Oklahoma City on Tuesday.\n\nLakers: Host the Phoenix Suns on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996005.2784178
}