{
  "game_id": "0022400563",
  "espn_id": "401705129",
  "date": "Jan 15, 2025",
  "matchup": "CHI vs. ATL",
  "headline": "Keaton Wallace scores career-high 27 points to help the Hawks beat the Bulls, 110-94",
  "body": "CHICAGO -- — Keaton Wallace had a career-high 27 points and the short-handed Atlanta Hawks beat the Chicago Bulls 110-94 on Wednesday night.\n\n\r\n              Wallace nearly doubled his previous high of 14. He made four 3-pointers and had six assists.\n\n\r\n              Daeqwon Plowden scored 19 points in his NBA debut after being called up from the G League’s College Park Skyhawks.\n\n\r\n              Dyson Daniels scored 18 points, and Onyeka Okongwu added 14 points, 13 rebounds and seven assists to help the Hawks win for the third time in four games even though Trae Young sat out due to a bruised right rib. The three-time All-Star was hurt against Phoenix on Tuesday night when he scored a season-high 43 points in a 122-117 win. \n\n\r\n              Coby White scored 16 points for Chicago. Zach LaVine had 15, and Nikola Vucevic added 14 points and 16 rebounds.\n\n\r\n              Takeaways\r\n              Hawks: Young, averaging 23.1 points and a league-leading 11.9 assists, was part of a lengthy list of sidelined Hawks. It included Jalen Johnson (right shoulder inflammation), De’Andre Hunter (left foot soreness), Larry Nance Jr. (right hand) and rookie Zaccharie Risacher (left adductor irritation).\n\n\r\n              Bulls: The Bulls simply couldn't find much of a rhythm and lost for the fourth time in five games.\n\n\r\n              Key moment\r\n              Wallace scored 18 in the first half as the Hawks built a 61-47 lead.\n\n\r\n              The 6-foot-3 guard had eight points in a 15-0 run early in the second quarter that gave Atlanta a 42-27 lead. The Bulls got within four late in the half before the Hawks scored 13 straight, capped by Okongwu’s alley-oop dunk to make it 59-42 with 1:30 left. Okongwu also put back Bogdan Bogdanovic’s missed 3 in the closing seconds to send Atlanta to the locker room up by 14.\n\n\r\n              The Bulls went on a 12-2 run in the third to pull within 72-67 with about five miutes left in the quarter. The Hawks led by eight going into the fourth and remained in control from there.\n\n\r\n              Key stat\r\n              Both teams struggled from 3-point range, with the Hawks making 13 of 43 and the Bulls going 6 for 27.\n\n\r\n              Up next\r\n              The Hawks visit Boston on Saturday night, and the Bulls host Charlotte on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997071.4771001
}