{
  "game_id": "0022300122",
  "espn_id": "401584750",
  "date": "Nov 01, 2023",
  "matchup": "HOU vs. CHA",
  "headline": "Green scores 23, VanVleet 22 as the Rockets earn 1st win of the season, beating the Hornets 128-119",
  "body": "HOUSTON -- — Jalen Green scored 23 and Fred VanVleet added 22 points and 11 assists as the Houston Rockets earned their first win of the season, 128-119 over the Charlotte Hornets on Wednesday night.\n\n\r\n              The Rockets, who dropped their first three games, led by 18 points in the first half before letting the Hornets get back in it. But Houston used a big run in the third quarter to stretch its lead and withstood a late push by the Hornets for the victory.\n\n\r\n              VanVleet, an eight-year veteran who joined the Rockets this season, said young teams have to learn how to win. \n\n\r\n              “Especially with the history and the circumstances that have been here the last couple of years, you have to learn how valuable possessions are and how fast things can snowball both ways,” he said. “So just continue to make the right plays and chip away and then once it gets crunch time, you've got to be able to get organized and keep your mind right and make the crucial plays.”\n\n\r\n              Houston was up by five points late in the fourth quarter when a 3-pointer by Green pushed the lead to 120-112 with less than two minutes left.\n\n\r\n              LaMelo Ball made 1 of 2 free throws before Green added a driving layup with just more than a minute to go.\n\n\r\n              Terry Rozier made a basket for Charlotte, before Alperen Sengun made a thundering one-handed dunk a few seconds later, pushing the lead to 124-115.\n\n\r\n              Green was glad to see the Rockets get their first win after losing a couple of close games after a blowout loss to Orlando in their opener.\n\n\r\n              “We all knew what we were doing and the growth that we made,” he said. “So it was just good to put this one together.”\n\n\r\n              All five of Houston’s starters score at least 17 points. Dillon Brooks had 20, Sengun had 19 and seven rebounds and Jabari Smith Jr. added 17.\n\n\r\n              P.J. Washington scored 23 and Rozier finished with 21 points to lead the Hornets, who fell to 1-3.\n\n\r\n              “There's things we've got to do better,” Charlotte coach Steve Clifford said. “Actually a lot of the stuff we didn't do well tonight, we've done well in the other games. What we've got to do is put it all together.”\n\n\r\n              Ball had just six points with about six minutes left before scoring 10 points, with two 3-pointers, to power an 18-9 run that cut the lead to 115-110 with about 2½ minutes to go. He finished with 19 points and five assists. \n\n\r\n              The Rockets led by three points early in the third before using an 11-2 run to make it 77-65 with eight minutes left in the quarter. Green had a 3-pointer in that stretch and Brooks made two consecutive 3’s to cap the run.\n\n\r\n              Charlotte ended the quarter with a 7-2 spurt, with the first four points from Nick Richards, cutting the lead to 86-78 entering the fourth.\n\n\r\n              Houston’s Amen Thompson, the fourth overall pick in this year’s draft, had four points before leaving in the third quarter with a sprained right ankle.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: Visit Indiana on Saturday night.\n\n\r\n              Rockets: Play consecutive home games against Sacramento on Saturday and Monday nights.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995645.734014
}