{
  "game_id": "0021501038",
  "espn_id": "400828925",
  "date": "Mar 20, 2016",
  "matchup": "TOR vs. ORL",
  "headline": "DeRozan, Scola lead Raptors over Magic 105-100",
  "body": "TORONTO --  With just over three weeks left in the regular season, the Toronto Raptors are within a game of the top spot in the Eastern Conference.\n\nDeMar DeRozan had 25 points, Luis Scola added 20 more and the Raptors beat the Orlando Magic 105-100 on Sunday to pull a game behind the Cleveland Cavaliers for first place.\n\n\"Eventually when we get to the seventh game of the conference final -- if we get there -- we'll worry about it then,\" Scola said. \"We're fighting for it, because it's the right thing to do, but we can't lose sleep over it.\"\n\nDeRozan agreed.\n\n\"I really don't look at it like we're chasing Cleveland,\" he said. \"At the end of the day, we're going to have homecourt advantage regardless. Our biggest focus is just getting everything we need to get together, especially defensive-wise as a team.\"\n\nThe short-handed Raptors played just eight players and didn't put much together defensively through the first three quarters, allowing the Magic to shoot 51.6 percent from the floor. Trailing 91-85 with 7:54 left, though, Toronto scored 10 straight points to lead by four with 5:22 left.\n\nA 3-pointer from Orlando's Evan Fournier with 1:11 remaining cut the lead to 97-96, but DeRozan responded with a floating jumper with 53.9 left and added a free throw after being fouled by Ersan Ilyasova to open up a four-point edge.\n\nTerrence Ross then tacked two successful free throws. Brandon Jennings' jump shot with 33.8 seconds to play made things uncomfortable for Toronto, but he missed the resulting free throw and the Raptors held on for the victory, their fourth in a row.\n\n\"We had good looks down the stretch, we just couldn't make them,\" said Orlando coach Scott Skiles, whose team fell to the Raptors for the 13th time in its last 14 games. \"They had 45 free throws and that's very difficult to overcome. Kyle (Lowry) and DeMar (DeRozan) shot 26 between them and we shot 18 as a team, so those shots have to go in for you if there is that type of discrepancy.\"\n\nFor Victor Oladipo, whose 21 points were tied with Fournier as a team high, it was simply a lack of execution in key moments.\n\n\"We got some great looks, some of them didn't fall for us and they killed us on the boards,\" he said after his team got outrebounded 15-8 in the final 12 minutes.\n\nThe Magic have lost seven straight games in Toronto, and this was the 13th loss this season by five or fewer points.\n\n\"It actually drives me crazy when I think about it, but it's too late now, we can't change anything,\" Fournier said.\n\nSHORT-HANDED SUCCESS\n\nWith Cory Joseph rested for the first time this season and Jonas Valanciunas still nursing a bruised left hand, it was incumbent on the rest of the Raptors to step up in their absence. Jason Thompson responded with a season-high 10 rebounds.\n\n\"We're just trying to be strategic,\" coach Dwane Casey said of resting Joseph. \"No disrespect to any team that we're playing, believe me, we're going into these games to win. It's not vacation time.\n\nFREE AND EASY\n\nDeRozan made 13 of 16 free throws, and the Raptors improved to 13-4 when he makes at least 10 from the free-throw line. Stopping him and Lowry from getting to the line is a tough task.\n\n\"That's what they do,\" Fournier said. \"They have two very good drivers in Kyle Lowry and DeRozan and they get calls, that's what they do. They're aggressive and they get calls. That's it.\"\n\nTIP-INS\n\nMagic: Nikola Vucevic (groin) missed Sunday's contest. ... While the backcourt pairing of DeRozan and Lowry capture many of the Toronto headlines, for Orlando coach Scott Skiles, a reserve player has held most of his attention.\n\n\"The guy that's really hurt us has been Cory Joseph, especially in London, he kept penetrating but not only penetrating but getting all the way to the rim,\" he said.\n\nJoseph has scored a season-high 19 points in both previous games against Orlando this season but was rested on Sunday.\n\nRaptors: Patrick Patterson (ankle) sat out Sunday's game. ... Toronto is now just one victory away from tying the franchise record for wins in a single season (49), set last year. ... The Raptors have scored 100 or more points in a season-high 12 consecutive games, the second longest such streak in team history (20). ... While Golden State Warriors guard Stephen Curry is the runaway favorite to win a second straight MVP award, Skiles wouldn't be surprised if Lowry gets some love from the voters, too. \"That certainly wouldn't shock me if he was getting MVP votes,\" Skiles said. \"He's really, really tough, he's mentally tough, he likes to make big plays and if you're in a close game you know he's going to take it, he's going to take action and try to do something.\"\n\nUP NEXT\n\nMagic: Visit Boston on Monday night.\n\nRaptors: Visit Boston on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764994698.044041
}