{
  "game_id": "0021500133",
  "espn_id": "400828020",
  "date": "Nov 13, 2015",
  "matchup": "MEM vs. POR",
  "headline": "Randolph's putback sends Grizzlies past Portland 101-100",
  "body": "MEMPHIS, Tenn. --  A losing streak was going to end, and Zach Randolph's last-second basket made sure it was that of the Memphis Grizzlies.\n\nMarc Gasol scored a season-high 31 points, but it was Randolph's put-back basket with less than a second left that gave the Grizzlies a 101-100 victory over the Portland Trail Blazers on Friday night.\n\n\"I knew the ball wasn't coming to me,\" Randolph said of the inbounds play. \"I was just trying to get myself in position to be around the ball and try to get a tip-in. And that's what happened.\"\n\nBut it took several attempts.\n\nCourtney Lee missed a shot in the corner with time running out, Jeff Green's tip attempt missed and Randolph grabbed the rebound. But Allen Crabbe blocked his shot with 1.6 seconds left.\n\nRandolph got it back for the winner and saved the Grizzlies from blowing an 11-point, fourth-quarter lead.\n\n\"I just stuck with it. Good come to good, I guess,\" Randolph said with a laugh.\n\nPortland still had a final shot with 0.6 of a second left, but Al-Farouq Aminu's 17-footer was short and the Grizzlies snapped a four-game losing streak.\n\nThe Trail Blazers lost their fourth straight and haven't won since a 115-96 victory over Memphis on Nov. 5.\n\n\"It's tough, man,\" said Portland guard Damian Lillard, who had 11 points. \"I thought we defended really well down the stretch. ... (Randolph) is just a handful on the glass, and he was able to get one last rebound.\"\n\nRandolph's winning basket gave him 15 points for the game. Green scored 14, while Mike Conley and newcomer Mario Chalmers added 11 points apiece.\n\nC.J. McCollum led Portland with 26 points, including 10 in the fourth quarter. Aminu had 16 and Crabbe finished with 12, converting all five of his shots from the field.\n\nPortland had erased an 11-point Memphis lead in the final 4:03.\n\n\"We allowed them to get to the free-throw line and get easy points,\" Green said of the Portland rally. \"They gained a rhythm.\"\n\nAminu's 3-pointer from the left sideline with 12.5 seconds left gave Portland a 100-99 lead, setting the stage for Randolph's winner.\n\nMemphis led 92-81 with about 4 minutes left when the Trail Blazers went on a 16-5 run fueled by eight points from McCollum. Aminu converted a pair of free throws to tie the game at 97 with 36.3 left.\n\nGreen answered with a layup, but Aminu's 3-pointer with 12.5 seconds left gave Portland a 100-99 lead.\n\n\"I thought it was a terrific effort, especially in the fourth quarter,\" Portland coach Terry Stott said. \"To fight back in a game like that was good to see.\"\n\nWELCOME TO MEMPHIS:\n\nChalmers got a nice ovation when he entered the game in the first quarter -- a tad surprising since he hit the 3-pointer against the Memphis Tigers to send the 2008 national championship game into overtime, eventually won by Kansas. And Chalmers was worried about the fans' reaction. He woke up from his afternoon nap thinking about it. \"I thought there would be a little bit of booing in there,\" he said, \"but they made me feel right at home.\"\n\nA DATE FOR LAST-SECOND WINS:\n\nRandolph's winning basket came with 0.6 of a second remaining and on the one-year anniversary of Courtney Lee's reverse layup alley-oop with 0.3 of a second remaining to beat Sacramento 114-113.\n\nTIP-INS:\n\nTrail Blazers: Portland was without F Meyers Leonard, who injured his left shoulder against the Spurs Wednesday. ... Portland has lost eight straight in Memphis, counting regular-season and playoff games. ... Lillard's 11 points marked the first time this season he hasn't reached 20. ... Outrebounded Memphis 43-35, marking the first time this season the Trail Blazers have lost while winning the battle of the boards.\n\nGrizzlies: Avoided their first five-game losing streak since December 2013.\n\nUP NEXT:\n\nTrail Blazers: Travel to Charlotte on Sunday\n\nGrizzlies: Travel to Minnesota on Sunday",
  "source": "espn_api",
  "crawled_at": 1764994479.212106
}