{
  "game_id": "0021800373",
  "espn_id": "401071054",
  "date": "Dec 07, 2018",
  "matchup": "OKC @ CHI",
  "headline": "Markkanen's layup lifts Bulls over Thunder 114-112",
  "body": "CHICAGO --  The Chicago Bulls endured injuries to key players and a coaching change this week. Maybe now, the tide is turning for them.\n\nLauri Markkanen scored 24 points and drove for the go-ahead layup in the closing seconds to lead the Bulls to a 114-112 victory over Oklahoma City on Friday and their first win under coach Jim Boylen.\n\nThe Thunder's Russell Westbrook had just hit a tying layup when Markkanen spun around Paul George and banked in a layup over the outstretch arm of Steven Adams, making it 114-112 with 4.9 seconds left.\n\nGeorge's 3-point attempt from the top of the key then ricocheted off the rim, and the Bulls came out on top after dropping seven in a row.\n\n\"We've had a couple of rough weeks here,\" Markkanen said. \"Adversity hit us. I think that made us stronger. (We) have to put the team first and just keep going.\"\n\nThe last-second victory over one of the top teams in the Western Conference was a rare feel-good moment for Chicago in a season marked by injuries, losses and a coaching change.\n\n\"We have to learn how to win,\" Boylen said. \"We have to learn how to take the pressure of an NBA fourth quarter. I thought we did that.\"\n\nA longtime NBA assistant, Boylen took over Monday when Fred Hoiberg got fired following a 5-19 start. The Bulls lost at Indiana the following night in his debut. But with Markkanen back and Kris Dunn and Bobby Portis just about ready to return from their injuries, things are looking at least a little more promising.\n\n\"You can't give in,\" said Zach LaVine, who led Chicago with 25 points.\n\nMarkkanen hit four 3-pointers in his third game back after missing the first 23 because of a sprained left elbow.\n\nJustin Holiday scored 20, going 4 of 6 from beyond the arc, and Jabari Parker finished with 16 points.\n\nThe Thunder had won 16 of 19 following an 0-4 start and came in with a 13-0 record against teams below .500.\n\n\"A slip up is all it is tonight,\" George said. \"We dropped one. But we're going to keep it rolling.\"\n\nThey couldn't pull this one out despite getting 24 points, 17 rebounds and 13 assists from Westbrook. The triple-double was his 109th, though he also committed 10 turnovers.\n\nAdams finished with 21 points and 10 rebounds, and George and Dennis Schroder each scored 19.\n\nTIGHT STRETCH\n\nThe Thunder outscored Chicago 29-17 in the third quarter to turn a 70-62 halftime deficit into a 91-87 lead going into the fourth.\n\nThey were up 98-91 when Chicago went on a 14-2 run. LaVine hitting a tiebreaking 3, Wendell Carter Jr. had a big block against a driving Westbrook, and Markkanen added two free throws to make it a five-point game with 4:46 remaining.\n\n\"We held them to 44 in the second half and gave up 70 in the first,\" coach Billy Donovan said. \"When you live dangerously like that, sometimes you're not going to be on the winning end.\"\n\nTIP-INS\n\nThunder: Donovan said \"nothing was brought to my attention\" about possibly adding C Joakim Noah, trying to revive his career after signing with Memphis this week. \"Our roster's pretty complete so that's probably the biggest thing,\" he said. \"No one's a bigger fan and admires him more than I do.\" Noah starred for Donovan on back-to-back NCAA championship teams at Florida and spent his first nine NBA seasons in Chicago before spending two with the New York Knicks. ... The Thunder were 10 of 28 on 3-pointers and 16 for 24 at the foul line.\n\nBulls: Boylen wasn't sure if Dunn (sprained left MCL) and Portis (sprained right MCL) will return Saturday when the Bulls host Boston. \"I'm not trying to be vague; I don't know yet. We kind of wait to see how they respond in the morning, it's one of those types of things. We check in and we go from there.\" Dunn has appeared in just one game -- Oct. 22 at Dallas -- while Portis has played in four. ... Chicago hit 12 of 25 3-pointers.\n\nUP NEXT\n\nThunder: Host Utah on Monday.\n\nBulls: Host Boston on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994612.6752121
}