{
  "game_id": "0021600723",
  "espn_id": "400900144",
  "date": "Jan 30, 2017",
  "matchup": "MEM @ PHX",
  "headline": "Conley scores career-high 38, Grizzlies rout Suns 115-96",
  "body": "PHOENIX --  The Memphis Grizzlies are changing their style and that's opened the door for more offense from Mike Conley.\n\nThe Grizzlies guard scored a career-high 38 points and Memphis just missed a franchise record with 16 3-pointers in a 115-96 rout of the Phoenix Suns on Monday night.\n\nConley matched his career best with seven 3s (in 10 attempts) and made 12 of 18 shots overall in his fourth 30-point game of the season. He had five the rest of his career.\n\n\"Our system this year, we're more or less trying to make that transition to the new-age kind of basketball where we spread it all over the court a little bit, get in pick-and-rolls,\" he said. \"It really bodes well for my game and I'm just trying to look for my opportunity to score.\"\n\nCoach David Fizdale said he's given Conley \"the green light to do it all the time.\"\n\n\"I love it when he's aggressive and he really inspires guys when he plays like that,\" Fizdale said. \"I love to see him play like that and expect to see a lot more of that.\"\n\nMarc Gasol and Zach Randolph each added 18 points for the Grizzlies in their third stop of a season-high, six-game road trip.\n\nDevin Booker scored 22, running his string of 20-point games to 13, for Phoenix. Rookie Marquese Chriss added a career-high 20.\n\nPhoenix never led and trailed by as many as 30 in matching its season worst with a fourth straight loss.\n\nEric Bledsoe, coming off a career-high 41 points in a Phoenix loss to Denver on Saturday night, was 2 for 9 and finished with eight points.\n\nConley made seven of his first eight 3-point tries.\n\n\"I almost made one off the glass. It rolled around forever,\" Conley said. \"It was just one of those nights you know, had it going. Guys were so unselfish trying to get me the ball and just told me to shoot it every time I touched it. It was just fun to be in that kind of environment.\"\n\nSuns coach Earl Watson pointed out the rest of Conley's line: nine assists, six rebounds, only two turnovers.\n\n\"Mike is able to put up that type of night,\" Watson said. \"Mike is going early, his confidence and rhythm are really great.\"\n\nConley, whose previous career best was 36, was pretty much unstoppable in the first half, making 8 of 10 shots, 4 of 5 3-pointers, for 23 points to help Memphis build a 59-48 lead.\n\nA 10-0 run early in the third quarter gave Memphis a 72-52 lead on Conley's fifth 3-pointer of the night (in six tries).\n\nThe Grizzlies' 16 3s (in 28 attempts) were one shy of their franchise best of 17 in Sacramento on New Year's Eve.\n\nTIP-INS\n\nGrizzlies: Memphis waived rookie Troy Williams and signed Toney Douglas to a 10-day contract. ... Troy Daniels sat out the game (right knee). ... Vince Carter turned 40 years old on Thursday. ... It was Memphis' first game against the Suns this season. ... Randolph's teammates were kidding him about making two 3s and dunking twice for the first time ever in a game.\n\nSuns: P.J. Tucker drew two technical fouls and was ejected from the game with 6:27 to play. ... Rookie Dragan Bender missed his fourth straight game with right ankle soreness. ... Phoenix has lost four in a row three times and has never won more than two straight.\n\nWRIGHT BACK\n\nMemphis' Brandan Wright made his season debut with about five minutes to play after being sidelined all season with a left ankle injury. He had been cleared to play earlier in the day.\n\nBefore the game, Fizdale had said of the forward, \"If I have an opportunity to slip him in there, I will\" and the big lead gave him just that chance.\n\nUP NEXT\n\nGrizzlies: Memphis plays at Denver on Wednesday night in the fourth stop of the six-game trip.\n\nSuns: Phoenix remains home to face the Los Angeles Clippers on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995592.827862
}