{
  "game_id": "0022400145",
  "espn_id": "401704711",
  "date": "Nov 02, 2024",
  "matchup": "MIL vs. CLE",
  "headline": "Mitchell's last-second jumper helps Cavs stay unbeaten with 114-113 win at Milwaukee",
  "body": "MILWAUKEE -- — Donovan Mitchell scored 30 points including a jumper with three-tenths of a second left and the Cleveland Cavaliers remained unbeaten with a 114-113 victory over the Milwaukee Bucks on Saturday night.\n\n\r\n              The 7-0 Cavaliers are one win away from matching their best start in franchise history. They won their first eight games in 1976-77.\n\n\r\n              Milwaukee has lost five straight since winning its opener. The Bucks wasted a brilliant performance from Damian Lillard, who had 41 points with nine assists and shot 10 of 15 from 3-point range.\n\n\r\n              Lillard had put Milwaukee ahead by hitting a step-back jumper with 9.8 seconds remaining.\n\n\r\n              Giannis Antetokounmpo had 34 points, 16 rebounds and nine assists for the Bucks.\n\n\r\n              The Bucks played without Khris Middleton, who hasn't yet made his season debut as he recovers from surgery on his ankles.\n\n\r\n              Takeaways\r\n              Cavaliers: Cleveland showed its gumption by winning at less than full strength one night after beating the Orlando Magic 120-109 at home. Cleveland was missing Caris LeVert due to a sore right knee. \n\n\r\n              Bucks: After shooting a combined 17 of 73 on 3-point attempts in losses at Boston and Memphis, the Bucks were 18 of 39 from beyond the arc Saturday. Their hot start from long range helped them build a 16-point first-quarter lead. In the end, Lillard and Antetokounmpo didn't get enough help. The Bucks need more from Gary Trent Jr., who scored three points in 34 minutes.\n\n\r\n              Key moment\r\n              After Lillard put Milwaukee ahead, Cleveland called timeout. Evan Mobley inbounded a pass to Mitchell, who caught it while barely avoiding a backcourt violation. Mitchell briefly lost control of the ball, but regained possession in 3-point range, dribbled inside the arc and hit a 19-footer.\n\n\r\n              Key stat\r\n              Lillard's 10 3-pointers were his most since joining the Bucks last season. His 41 points were two off his best total as a Buck.\n\n\r\n              Up next\r\n              The teams meet again Monday in Cleveland.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997860.790168
}