{
  "game_id": "401809237",
  "espn_id": "401809237",
  "date": "Oct 23, 2025",
  "matchup": "GS vs DEN",
  "headline": "Stephen Curry's 42 points lift Warriors over Nuggets in thrilling 137-131 OT win",
  "body": "SAN FRANCISCO -- — Stephen Curry scored 42 points, including a game-tying 3-pointer late in regulation to help the Golden State Warriors overcome Aaron Gordon's career-high 50 points and beat the Denver Nuggets 137-131 on Thursday night. \n\n\r\n              The Warriors went on a 12-2 run in overtime that started with a corner 3-pointer from Al Horford and featured a back-breaking one from Jimmy Butler that made it 133-127 with 41 seconds to play as Golden State got off to a 2-0 start this season.\n\n\r\n              Gordon broke Alex English's franchise record for a season opener of 47 points set in 1985 against Golden State. Gordon's 10 3-pointers tied Terry Rozier's record set in 2020 for the most made in a season opener.\n\n\r\n              It was a dramatic end to regulation with Gordon hitting a tiebreaking 3-pointer with 25.7 seconds to play only to watch Curry tie it 4.3 seconds later with a long 3 of his own. Nikola Jokic then missed a shot in the lane just before the buzzer, sending the game to overtime, where the Warriors took control. \n\n\r\n              Jokic finished with 21 points, 13 rebounds and 10 assists to join Oscar Robertson as the only players with four triple-doubles in season openers.\n\n\r\n              The Nuggets were the last team in the NBA to take the court in the regular season and promptly became the first team in six years to fall behind by 10-0 or worse in the opener. They quickly responded with 12 straight points of their own and didn't trail again in the half.\n\n\r\n              Gordon made all seven his attempts from 3 in the first half — the most 3-pointers ever in the first half of a season opener to help Denver take a 70-61 lead at the break. Gordon matched Golden State’s output from long range in the half on 16 fewer attempts.\n\n\r\n              Up next\r\n              Nuggets: Host Phoenix on Saturday night.\n\n\r\n              Warriors: Visit Portland on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042486.780509
}