{
  "game_id": "0021800404",
  "espn_id": "401071085",
  "date": "Dec 11, 2018",
  "matchup": "TOR @ LAC",
  "headline": "Raptors hand Clippers worst loss of season, 123-99",
  "body": "LOS ANGELES --  Kyle Lowry was in a funk right along with his Toronto Raptors. He had a combined 15 points in his last five games while the team had lost three of four.\n\nAdding to their woes, leading scorer Kawhi Leonard was out with a bruised right hip against the surprising Clippers.\n\n\"It was just time for me to step up and play,\" Lowry said.\n\nSerge Ibaka had 25 points and nine rebounds, Lowry added 21 points while making four of the Raptors' 14 3-pointers, and Toronto cruised past Los Angeles 123-99 on Tuesday night.\n\n\"We didn't slow it down,\" Lowry said.\n\nToronto shot 52 percent from the floor, had 34 assists and outscored the Clippers 28-4 in fast-break points.\n\n\"This was a game everybody thought would be very difficult for us to win,\" coach Nick Nurse said, \"but we kind of lined up all these things and were very focused.\"\n\nFred VanVleet kept the ball moving in place of Leonard with a career-high 14 assists.\n\n\"Whether Kawhi played or not, I think he was going to have a healthy game,\" VanVleet said of Lowry. \"When he's playing like that, we're going to be a tough team to beat.\"\n\nThe Clippers endured their biggest loss of the season against the NBA's best team (22-7).\n\n\"From the start you could see the Raptors pushing the pace at us the entire game,\" Clippers coach Doc Rivers said, \"and we really never caught up to it.\"\n\nWith leading scorer Tobias Harris held to 10 points -- he averages 21.4 -- the Clippers were led by a pair of reserves.\n\nBoban Marjanovic had 18 points and Tyrone Wallace added 15. Their fourth loss in six games dropped them into a tie for second with the Lakers at 17-10 in the Pacific Division.\n\n\"We just gave in to their offensive pressure,\" Rivers said.\n\nThe Raptors extended their lead in the third quarter, using an early 10-0 run followed by five consecutive 3-pointers to go into the fourth ahead 103-74. Lowry hit three of the 3s and Delon Wright had two.\n\n\"When he let go he knew it was going in,\" Nurse said of Lowry.\n\nIbaka had back-to-back monster dunks before the 3-point onslaught began, drawing cheers on Canada Night at Staples Center.\n\nBoth teams played their reserves in the fourth, but the Clippers were too far behind to make a serious dent.\n\nTIP-INS\n\nRaptors: Nurse plans to coach at Golden State on Wednesday before returning to Carroll, Iowa, where his 94-year-old mother died Monday. \"He said before the game she would have kicked his butt if he wasn't here,\" Lowry said. \"That just shows the toughness in his family.\" ... They improved to 6-0 vs. the West. ... After their current four-game trip, the Raptors won't travel beyond the Central time zone for the rest of the season. ... Wright got stitches above his right eye. ... G Norman Powell missed his 18th straight game with a left shoulder injury.\n\nClippers: G Lou Williams sat out with a sore left hamstring that he sustained on Monday at Phoenix. ... With the team trailing by 29, longtime fan Billy Crystal had seen enough and departed before the fourth quarter began. ... They lost at home for just the third time in 12 games. ... They've lost four of six overall. ...  They were beaten at home by the Raptors for the first time since Nov. 22, 2015.\n\nUP NEXT\n\nRaptors: At Golden State on Wednesday in the second game of a back-to-back. They are 5-0 on the second night this season.\n\nClippers: At San Antonio on Thursday. They beat the Spurs by five points last month.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994276.6021152
}