{
  "game_id": "0022400666",
  "espn_id": "401705232",
  "date": "Jan 29, 2025",
  "matchup": "CHI @ BOS",
  "headline": "Kristaps Porzingis finishes with 34 points, carrying Celtics over Bulls 122-100",
  "body": "BOSTON -- — Kristaps Porzingis scored 26 of his season-high 34 points in the first half, and the Boston Celtics coasted to a 122-100 victory over the Chicago Bulls on Wednesday night.\n\n\r\n              The 7-foot-2 Porzingis made a season-best eight 3-point shots in 14 attempts with 11 rebounds over 33 minutes, helping Boston bounce back from a rough home loss to the Rockets on Monday.\n\n\r\n              Jaylen Brown added 28 points, Derrick White had 22 and Jayson Tatum 16 for the recently up-and-down Celtics, who are just 7-6 in their last 13 games.\n\n\r\n              Coby White led Chicago with 16 points in 31 minutes in his first game after missing four straight with an ankle injury. The Bulls have dropped eight of nine.\n\n\r\n              Bulls’ leading scorer Zach LaVine missed the game for personal reasons.\n\n\r\n              Tatum’s second of consecutive 3-pointers 15 seconds apart midway into the third quarter gave Boston its biggest lead of the game, 86-62.\n\n\r\n              The Bulls beat the Celtics in their previous trip to TD Garden on Dec. 19 when LaVine scored 36 points but were blown out by 25 points two days later at home.\n\n\r\n              Takeaways\r\n              Bulls: They certainly looked like they were missing LaVine’s team-high 24.0 points per game for stretches.\n\n\r\n              Celtics: Were focused from the start after the frustrating two-point loss against Houston. They opened a double-digit edge just over two minutes into the game.\n\n\r\n              Key moment\r\n              After the Celtics’ lead was sliced to six, they went on a 13-0 run over a nearly four-minute stretch midway in the second. Brown had nine points in the spree.\n\n\r\n              Key stat\r\n              Porzingis set his season-high in made 3s for a game by connecting on six in the opening half.\n\n\r\n              Up next\r\n              The Bulls play the middle game of their three-game road trip at Toronto on Friday. The Celtics are at New Orleans, also Friday, the first of their three-game trip.\n\n\r\n              \r\n                ------\r\n              \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997062.529197
}