{
  "game_id": "0021600787",
  "espn_id": "400900192",
  "date": "Feb 08, 2017",
  "matchup": "MIL vs. MIA",
  "headline": "Miami Heat extend win streak to 12, beat Bucks 106-88",
  "body": "MILWAUKEE --  The Miami Heat keep winning despite having to weather an injury to another key player.\n\nThe Milwaukee Bucks just can't keep their young core together on the floor at the same time.\n\nMiami extended its winning streak to 12 games with a 106-88 win on Wednesday night over the hard-luck Milwaukee Bucks, who lost young forward Jabari Parker in the third quarter to a sprained left knee.\n\n\"When we see anybody go down, we cringe,\" Heat coach Erik Spoelstra said. \"We hope he's OK. It definitely took away\" from the Bucks' ability to come back.\n\nParker will have an MRI on Thursday, general manager John Hammond said. Center John Henson said Parker was yelling to teammates that he had hyperextended the knee.\n\n\"We'll know more tomorrow after we have the MRI,\" Hammond said.\n\nHassan Whiteside had 23 points and 16 rebounds, while James Johnson added 20 points off the bench for the Heat. Guard Dion Waiters didn't play with an ankle injury.\n\nBut Miami was in control from the start, building a 15-2 lead and holding the Bucks to 33 percent shooting in the first quarter. Whiteside amassed 17 points and 11 rebounds alone in a dominating first half, which ended with a 55-44 lead for Miami.\n\nGoran Dragic had 13 of his 16 points in the first half, easily getting into the lane against Milwaukee's soft interior defense.\n\n\"We had to get out to a great start,\" Whiteside said. \"They've got guys that are really long ... so we had to come out here with a great start.\"\n\nAll-Star Giannis Antetokounmpo, the Bucks' 6-foot-11 forward, had 22 points and eight rebounds, while the 6-8 Parker finished with 14 points.\n\nA lackluster night for the Bucks got worse when Parker went down with 6:34 left in the third quarter. Parker hurt the same knee two seasons ago.\n\nThe injury appeared to deflate the rest of the Bucks and their fans. Leading by 11 at the time of Parker's injury, Miami maintained a comfortable, double-digit lead the rest of the way.\n\nTHE STREAK\n\nSpoelstra didn't go there.\n\n\"I'm not going to talk about the streak,\" Spoelstra said. \"It's more about a group of players coming together to form an identity as a team and embrace each other, embrace a culture, embrace defending with a purpose.\"\n\nBUCKS POSTGAME\n\nCoach Jason Kidd did not address reporters after the game. Following a wait of roughly 45 minutes, Hammond spoke to the media.\n\n\"We were discussing a basketball decision. It had nothing to do with the injury,\" Hammond said. \"We were just talking basketball at that time. I know, it's ironic timing but really, we were just having a basketball discussion.\"\n\nTIP-INS\n\nHeat: Waiters missed the game after spraining his left ankle on Monday at Minnesota. Spoelstra said Waiters was improving, and that he was walking again without a boot to protect the foot. ... Waiters joined Justise Winslow, Josh Richardson and Josh McRoberts on the Miami injury report. The team plans to sign Marcus Georges-Hunt, a 6-foot-6 forward playing with Maine in the NBA Developmental League. \"I think it's necessary right now,\" Spoelstra said. \"We need some insurance, just in case.\" A rookie out of Georgia Tech, Georges-Hunt averaged 16.4 points, 5.8 rebounds and 4.2 assists with Maine.\n\nBucks: Parker got hurt on the same night that G Khris Middleton returned after missing the first 50 games this season with a torn hamstring. Middleton looked spry in limited action, scoring five points in 15 minutes as Kidd eases his top guard back into the rotation. Middleton, Antetokounmpo and Parker form the team's young core. ... Parker hurt his left knee initially in December 2014, an injury that ended his rookie season after 25 games. He was averaging a career-high 20.2 points this season.\n\nUP NEXT\n\nHeat: Make the third stop of a four-city road trip when they play Brooklyn on Friday.\n\nBucks: Host the Los Angeles Lakers on Friday.\n\n---\n\nFollow Genaro Armas at: https://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764995169.4315479
}