{
  "game_id": "0022200628",
  "espn_id": "401468783",
  "date": "Jan 12, 2023",
  "matchup": "MIA vs. MIL",
  "headline": "Short-handed Heat rally, top short-handed Bucks, 108-102",
  "body": "MIAMI -- — The Miami Heat were short-handed. The Milwaukee Bucks were short-handed.\n\n\r\n              The Heat got the better of it all.\n\n\r\n              Gabe Vincent scored a career-best 28 points, Bam Adebayo had 24 points and 12 rebounds, and the Heat beat the Bucks 108-102 in a game in which at least five would-be starters were out for various reasons.\n\n\r\n              “We're developing some grit and mental toughness and stability,\" Heat coach Erik Spoelstra said.\n\n\r\n              Jimmy Butler had 17 points and 11 rebounds for the Heat, who got 14 points, eight rebounds and seven assists from Victor Oladipo.\n\n\r\n              Max Strus had 12 points and 10 rebounds for Miami (23-20), which moved a season-best three games over .500, even without starters Kyle Lowry, Tyler Herro and Caleb Martin.\n\n\r\n              Jrue Holiday had 24 points and 11 assists for the Bucks, who were without Giannis Antetokounmpo, Grayson Allen, Khris Middleton, Serge Ibaka and Joe Ingles. Many are expected back when the teams play again in Miami on Saturday.\n\n\r\n              “We got up 15 or so and the energy and effort was good at both ends to start the game,\" Bucks coach Mike Budenholzer said.\n\n\r\n              Jevon Carter scored 18, Jordan Nwora had 16, AJ Green scored 15 and Bobby Portis had 12 for the Bucks.\n\n\r\n              The Heat's streak of consecutive free throws made ended at 55, when Butler missed one with 27.7 seconds left. They finished 15 of 16 from the line and nearly became the first team in Heat history to be perfect from the line in consecutive games. Miami set an NBA record with a 40-for-40 showing from the line in a win Tuesday over Oklahoma City.\n\n\r\n              Milwaukee led 32-17 after the game's first 15 minutes, even with two regular starters out in Antetokounmpo and Allen. Middleton is another starter, but has been limited to seven games so far this season.\n\n\r\n              But it ended up becoming Miami's biggest comeback win of the season. The Heat rallied from a pair of 13-point deficits for wins, and were 0-8 in games in which they trailed by 14 or more.\n\n\r\n              “Winning,\" Strus said. “Winning cures everything. We're finding ways to grit out wins and come together as a unit.\"\n\n\r\n              Miami came into the night 28th in the 30-team NBA in rebounding, Milwaukee came into the game leading the league in that department. But the Heat outrebounded the Bucks 61-39 – by far the biggest rebound margin Miami has enjoyed this season. They outrebounded the Los Angeles Clippers by 14 on Jan. 2.\n\n\r\n              “I think a lot of that goes toward having our center back,\" Vincent said, after Adebayo returned from a one-game absence with a wrist issue. “He makes the game easy on both sides of the floor for a lot of us.\"\n\n\r\n              Miami outscored Milwaukee 58-18 in the paint. The Bucks made 35 field goals, 22 of them being 3-pointers.\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Milwaukee is now 4-3 without Antetokounmpo this season. ... The Bucks were 19-1 in games in which they led by at least 15 points this season. The other loss was at Chicago on Dec. 28. ... Carter’s six 3-pointers were a season high. His career best on 3’s is eight, done in the final game of his rookie season for Memphis against Golden State on April 10, 2019. \n\n\r\n              Heat: Inter Miami coach Phil Neville was at the game. ... Miami used another different starting lineup, its eighth in 10 games and its 19th so far this season. ... Dewayne Dedmon served his one-game suspension imposed for conduct detrimental to the team, surrounding his actions in Tuesday’s matchup against Oklahoma City.\n\n\r\n              TOUGH STRETCH\n\n\r\n              The Bucks are in a tough schedule stretch. They played in Atlanta on Wednesday, got to Miami around 2:30 a.m., played Thursday, play Saturday afternoon in Miami, then play Indiana on Monday afternoon in Milwaukee — as part of the league’s Martin Luther King Day lineup — to start another back-to-back that ends Tuesday against Toronto.\n\n\r\n              NAME GAME\n\n\r\n              The “FTX Arena” signage was still in place at Miami’s arena on Thursday, one day after a bankruptcy court terminated the naming rights deal between the collapsed cryptocurrency exchange and Miami-Dade County. The county and the Heat said Thursday they will “work aggressively to identify a new naming rights partner for the arena.” The FTX signage is likely to begin coming down in the next few days.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993961.5828018
}