{
  "game_id": "0022301148",
  "espn_id": "401585776",
  "date": "Apr 09, 2024",
  "matchup": "MIL vs. BOS",
  "headline": "Bucks withstand Antetokounmpo's injury to beat Celtics 104-91. Teams combined for record-low 2 FTs",
  "body": "MILWAUKEE -- — On the night they finally snapped their four-game skid, the Milwaukee Bucks encountered an entirely different reason for worry.\n\n\r\n              Their two-time MVP is hurt.\n\n\r\n              Giannis Antetokounmpo strained his left calf late Tuesday in the third quarter of the Bucks' 104-91 victory over the Boston Celtics, who became the first team in NBA history to not shoot a free throw on a night the teams combined for a record-low two attempts. \n\n\r\n              Bucks coach Doc Rivers said after the game that Antetokounmpo was undergoing an MRI on his calf and also would have his Achilles tendon tested. Rivers was asked about his concern level.\n\n\r\n              “High, I would say that,” Rivers said. “He's Giannis. I think everyone probably feels the same way as I do right now. We're just going to hope for the best.”\n\n\r\n              Patrick Beverley had 20 points and 10 rebounds after the Bucks shook up their lineup by having the veteran guard start ahead of Malik Beasley, who came off the bench for the first time all season.\n\n\r\n              But that lineup change was overshadowed by Antetokounmpo's situation.\n\n\r\n              Antetokounmpo was heading up the court late in the third quarter after a Celtics basket when he grabbed his left calf and took a seat. He was helped off the floor, and cameras showed him heading to the locker room under his own power.\n\n\r\n              The Bucks said Antetokounmpo had a left soleus strain. The soleus is a muscle in the calf.\n\n\r\n              “Any time you see one of your teammates go down, it’s I think a real level of concern,” Bucks guard Damian Lillard said. “We spend a lot of time around each other, more than we would our families. I think that was the No. 1 thing. And then for it to be your best player, the most important part of our team, at this point in the season, it was like an, ‘Oh, (damn)’ moment, especially because there was nobody else around.”\n\n\r\n              Antetokounmpo had 15 points, eight rebounds and seven assists, and he also attempted the game's only free throws. He went 1 of 2 from the line in the first quarter.\n\n\r\n              The previous record for fewest combined attempts in a game was 11.\n\n\r\n              “I didn't realize that until they told me just before I walked in,” Bucks center Brook Lopez said during his postgame availability. “It is weird, after the fact. I honestly didn't really catch it throughout the game. I didn't notice it.”\n\n\r\n              Milwaukee withstood Antetokounmpo's injury thanks to a blazing start that enabled the Bucks to take a 24-point lead in the first half. \n\n\r\n              “That was the first time where like the game wasn't going our way since I don't remember when, you know what I mean?” Celtics coach Joe Mazzulla said. “To me, that's a good opportunity, to play through that, find different ways to create runs, find different ways to just build stuff on either end of the floor. I thought it was a good situation for us to be in because we hadn't seen it in a while.”\n\n\r\n              Lopez and Bobby Portis scored 15 points apiece, and Lillard and Khris Middleton added 12 apiece. Portis also had 10 rebounds.\n\n\r\n              The Celtics, who already have clinched the NBA’s best regular-season record and No. 1 overall playoff seed, were playing without Al Horford and Kristaps Porzingis. Horford was unavailable due to a sprained left big toe, and the Celtics are managing Porzingis’ workload after he missed five games last month with a sprained right hamstring.\n\n\r\n              Jayson Tatum scored 22 points to lead the Celtics. Jaylen Brown had 14 points and 10 rebounds, and Jrue Holiday had 12 points.\n\n\r\n              Lopez went 4 of 5 on 3-point attempts in the opening six minutes to set the tone for a first quarter in which the Bucks shot 14 of 18 overall and 8 of 10 from 3-point range. \n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host the New York Knicks on Thursday.\n\n\r\n              Bucks: Host the Orlando Magic on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996098.917674
}