{
  "game_id": "0021600015",
  "espn_id": "400899422",
  "date": "Oct 27, 2016",
  "matchup": "CHI vs. BOS",
  "headline": "Wade scores 22 in Chicago debut, Bulls beat Celtics 105-99",
  "body": "CHICAGO --  Dwyane Wade got the ball in the corner, took a dribble to his left and stepped back for the dagger 3-pointer.\n\nHe made a throat slashing gesture with his right hand after the ball swished through the net and started jumping around as the crowd roared.\n\nWade scored 22 points in a triumphant Chicago debut, Jimmy Butler had 24 and the Bulls won their season opener, beating the Boston Celtics 105-99 on Thursday night.\n\nWade hit the clinching 3 with 26.3 seconds left. Taj Gibson added 18 points and 10 rebounds, and the new-look Bulls got off to a winning start after missing the playoffs last season for the first time since 2008.\n\n\"To be able to make a shot like that and helps us get this win, it's like the perfect storm,\" Wade said.\n\nIsaiah Thomas led Boston with 25 points. Avery Bradley had 16, and Jae Crowder 14 points, but the Celtics came up short after opening with a win over Brooklyn the previous night.\n\n\"We lost the game in a fashion we didn't want to lose,\" Crowder said. \"I feel like we got punked all night.\"\n\nThe Bulls remade their roster in the offseason, jettisoning one hometown superstar and welcoming another when they traded Derrick Rose to New York and signed Wade to a two-year deal worth about $47 million in a move that stunned Miami.\n\nThe three-time NBA champion and 12-time All-Star is off to a good start with the Bulls after 13 seasons with the Heat. Wade hit 4 of 6 3-pointers in this game after making just 7 of 44 all of last season.\n\nRajon Rondo, signed by Chicago after a resurgent season with Sacramento, added nine assists. Butler had seven rebounds, and the Bulls pounded the Celtics on the glass 55-36.\n\nThey showed a scrappiness and edge that was missing last season. They were unselfish, passing the ball around, and hit 11 of 25 3-pointers.\n\n\"I think everybody's having fun out there,\" Butler said.\n\nHANGING ON\n\nThe Bulls were leading 95-81 midway through the fourth quarter after newcomer Michael Carter-Williams buried a 3 and a floater and Butler hit a floater of his own.\n\nThe Celtics scored 11 straight to get back into it, a driving layup by Thomas cutting it to 95-92.\n\nIt was 101-99 when Boston's Jaylen Brown got called for a travel. Wade then nailed that 3 over Bradley to make it a five-point game with 26.3 seconds left, sealing the win for Chicago.\n\n\"We're learning each other,\" Wade said. \"We're learning what we have in those types of moments at the end of ballgames and those types of moments.\"\n\nTEMPERS FLARE\n\nButler had some heated words with college teammate Crowder late in the first half.\n\nCrowder rebounded a miss by Wade -- another Marquette product -- and charged into Butler, leading to a heated exchange.\n\nRondo also got into it with Isaiah Thomas, and all four players got called for technicals.\n\n\"Jae's my guy,\" Butler said. \"It's the heat of the moment. That's what's supposed to happen.\"\n\nTIP-INS\n\nCeltics: Boston coach Brad Stevens said Rondo made a good impression on him during their time together in Boston. \"I thought he was very bright obviously, he understood the game, he can make passes in small areas that I have never seen before,\" Stevens said. \"And I tried to coach him like I would coach anybody else. The only thing I would say that you have to be yourself so I coached him like I would coach anybody else.\"\n\nRondo was working his way back from a torn ACL in his right knee and played in 30 games during Stevens' first season -- 2013-14. He started 22 games the following year for Boston before being dealt to Dallas.\n\nBulls: The Bulls signed former Celtics first-round draft pick R.J. Hunter. The guard from Georgia State was let go by Boston this week in what Stevens called a numbers crunch. \"We had more than 15 NBA players so it was just a matter of time who he was going to get picked up by,\" Stevens said. \"I think the way that he plays fits with how they like to play.\"\n\nUP NEXT\n\nCeltics: At Charlotte on Saturday.\n\nBulls: Host Indiana on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764995119.408712
}