{
  "game_id": "0021600881",
  "espn_id": "400900287",
  "date": "Feb 26, 2017",
  "matchup": "CHA @ LAC",
  "headline": "Griffin scores 43, Clippers hold off Hornets 124-121 in OT",
  "body": "LOS ANGELES --  Since returning from knee surgery last month, a healthy Blake Griffin has been on quite a tear.\n\nHis performance Sunday night was the most impressive yet.\n\nGriffin scored a season-high 43 points and added 10 rebounds and five assists as the Los Angeles Clippers held off the Charlotte Hornets 124-121 in overtime.\n\n\"He's played like he's on a mission,\" teammate J.J. Redick said. \"I don't know what that mission is, but he's been dominant. That's as good as I've seen him play.\"\n\nRedick scored 22 points for the Clippers, and center DeAndre Jordan added 20 points and 19 rebounds. Chris Paul, in his second game back from a thumb injury, had 15 points, 17 assists, nine rebounds and no turnovers in 41 minutes.\n\nThe Clippers needed every bit of that production because the Hornets got 34 points from Kemba Walker and 31 from Nicolas Batum, who was 8 of 13 on 3-pointers.\n\nCharlotte overcame a 17-point deficit to force overtime. With his team down by five with 48.2 seconds left in regulation, Walker hit a 3 and then added two free throws with 11.9 seconds remaining to tie it. Paul missed a 15-foot fallaway at the buzzer.\n\n\"We didn't give up,\" Batum said. \"We made big plays, we made stops. We did some good things but at the end, one or two more good plays and we could have closed out the game.\"\n\nCharlotte was playing on back-to-back nights, having defeated the Kings in Sacramento on Saturday. Despite their effort, the undersized Hornets could not stop Griffin.\n\n\"He's a monster,\" Charlotte coach Steve Clifford said. \"He's so skilled and smart, and he's the perfect player.\"\n\nThe Hornets are without center Cody Zeller, and backup Frank Kaminsky fouled out with 4:21 left in regulation. Just 15 seconds later, forward Michael Kidd-Gilchrist also fouled out.\n\n\"Charlotte is not a big, physical team and we were able to exploit that and take the ball inside with Blake,\" Clippers assistant coach Mike Woodson said.\n\nTIP-INS\n\nHornets: Kaminsky, a second-year center, is suddenly on the rise. He's averaged 17.7 points and 6.6 rebounds in his last nine games. His 13 rebounds Saturday against the Kings were a career high and he's had three double-doubles in his last six games after posting only one previously in his career.\n\nClippers: Paul reported no ill effects after playing 33 minutes in his first game back Friday from a torn thumb ligament. \"He came out great. (But) you can see there are things he needs to work on,\" coach Doc Rivers said before the game.\n\nLAMB CHOPS\n\nHornets forward Jeremy Lamb had a solid game off the bench with 19 points and six rebounds. This is his fifth NBA season, but he is only 24.\n\n\"He did a good job,\" Clifford said. \"He was on the attack, got the ball going to the basket and made a huge shot at the end. He played well.\"\n\nGETTING HEALTHY\n\nWith the return of first Griffin and now Paul, the Clippers are fully healthy for the first time in more than two months. \"This is as healthy as we've been all year,\" Rivers said. \"Now we just have to get our timing back.\"\n\nUP NEXT\n\nHornets: Play the fifth of seven consecutive road games Tuesday, this time against the struggling Lakers (19-41), losers of four straight.\n\nClippers: Will host the Rockets on Wednesday, a team that beat Los Angeles by 24 points in Houston on Dec. 30. The Clippers played that game without Paul and Griffin.",
  "source": "espn_api",
  "crawled_at": 1764995482.73088
}