{
  "game_id": "0021800418",
  "espn_id": "401071099",
  "date": "Dec 13, 2018",
  "matchup": "CHI @ ORL",
  "headline": "Vucevic leads Magic over Bulls 97-91 in Mexico City",
  "body": "MEXICO CITY --  The Bulls had the fans, but Nikola Vucevic and the Magic got the win.\n\nVucevic scored 26 points, including a tiebreaking jumper with 28 seconds remaining, and Orlando snapped a three-game losing streak with a 97-91 victory over Chicago on Thursday night in its first of two games in Mexico.\n\nVucevic shot 11 for 21 from the field and grabbed 10 rebounds, while D.J. Augustin added 15 points for the Magic.\n\n\"It was what we came here for. We were coming from (three) straight losses and we knew the trip was not going be easy against a team that was going to regroup,\" Vucevic said. \"It was tough, but we found a way in the end and now we are focusing on Utah for Saturday.\"\n\nZach LaVine scored 23 points but the Bulls (6-23) lost for the 10th time in their last 11 games and remained with the worst record in the Eastern Conference.\n\nThe Bulls, playing in Mexico for the first time in their history, were the main attraction for the game in a country where the franchise is considered the second-most popular among local fans. Many of them fell in love with the team when Michael Jordan led the Bulls to six championships in the 1990s.\n\nMost of the 20,201 fans that packed the Arena Ciudad de Mexico were using the red and black colors from the Bulls, who arrived in Mexico amid reports of turmoil in the locker room under new coach Jim Boylen.\n\n\"We knew about the fans and we wanted to come here and give Mexico City an exciting game and we did,\" said Justin Holiday, who finished with 18 points for the Bulls. \"We are on the right direction. We got another loss but we are on the right direction.\"\n\nAfter Lauri Markkanen tied it at 91 with 1:06 left to play, Vucevic nailed a 15-foot jumper to put the Magic ahead and Augustin iced the game with four free throws in the final seconds.\n\nThe Bulls led 26-24 after the first quarter, but Augustin nailed a couple of 3-pointers in an 11-3 run in the middle of the second and Orlando was ahead 39-29 with seven minutes left to play. LaVine scored on back-to-back jumpers to close the deficit to 51-46 at halftime.\n\nLaVine had 14 points after two quarters while Vucevic led the Magic with 13.\n\nChicago started the second half on a 7-2 run and tied it at 53 after a couple of free throws from Wendell Carter Jr., but Orlando took a six-point lead into the fourth period after 3-pointers from Jonathon Simmons and Mo Bamba.\n\nThe game was the NBA's 27th in Mexico, and Orlando will play Utah on Saturday. Only the United States and Canada have hosted more.\n\nEight of the last 26 games in Mexico have been regular-season contests.\n\nTIP-INS\n\nMagic: With 11 3-pointers, the Magic have 19 games with 10 or more and have an 11-8 record in those games. ... Orlando broke a four-game losing streak to the Bulls, who swept them in the 2017-18 series for the first time since 2012-13.\n\nBulls: The game was the first neutral-site, regular-season game for Chicago outside of the United States. ... Holiday made four 3-pointers and has converted at least one in 39 straight games, the longest streak in Bulls history and the longest of his career.\n\nUP NEXT\n\nMagic: Play at Mexico City against Utah.\n\nBulls: Play at San Antonio on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994831.400064
}