{
  "game_id": "0021801131",
  "espn_id": "401071804",
  "date": "Mar 29, 2019",
  "matchup": "POR @ ATL",
  "headline": "Lillard, Aminu pace Portland's blowout win over Hawks",
  "body": "ATLANTA --  Damian Lillard says the Portland Trail Blazers are making the best of a tough situation after CJ McCollum and Jusuf Nurkic went down with injuries.\n\n\"I just like the fact that we continue to roll,\" Lillard said. \"Obviously with CJ being out is a blow and Nurkic being out is a blow, but we haven't used it as a crutch or excuse. We haven't put our heads down and pouted about it. We just kept working and kept going after it.\"\n\nLillard scored 36 points, Al-Farouq Aminu added 17 and 11 rebounds, and the Trail Blazers extended their winning streak to a season-high six games with a 118-98 victory over the Atlanta Hawks on Friday night.\n\nPortland took charge with a 16-0 run in the third quarter that pushed the lead to 21 points. The Hawks pulled within 10 early in the fourth on Trae Young's runner, but Zach Collins' follow dunk and Jake Layman's difficult three-point play made it 97-82 to remove any remaining suspense.\n\nLillard, with his 26th game of at least 30 points, outplayed Young, who scored 18 of his 26 points in the first quarter.\n\n\"I thought we did a good job of limiting them to one shot,\" Lillard said about the second half. \"They weren't getting second and third opportunities. We were physical. We recognized actions and took stuff away. Our presence was there in the second half.\"\n\nThe Blazers have won nine of 10 and are in third place in the Western Conference.\n\nAtlanta's three-game winning streak, tying its longest of the season, was snapped.\n\n\"Shots weren't falling,\" Young said. \"We hit nine 3s tonight. We usually hit a little bit more. I didn't shoot the ball well. I started off early, but my shots weren't going in after that first quarter.\"\n\nAminu has double-doubles in consecutive games for the first time this season. He had 12 points and 11 boards against Chicago on Wednesday.\n\nJohn Collins finished with 20 points the Hawks, who had no solution for Lillard.\n\n\"Dame kind of got off to a nice start,\" Collins said, \"and it kind of ignited them all night.\"\n\nTIP-INS\n\nBlazers: Friday marked the sixth straight game that McCollum, Portland's second-leading scorer, missed after hurting his left knee. McCollum had his first career triple-double when the Blazers beat Atlanta two months ago. ... The team has no timetable for McCollum or Nurkic to return. Nurkic, the team's third-leading scorer, went down with a gruesome left leg injury this week. ... Portland improved to 13-1 when holding opponents under 100 points.\n\nHawks: F Taurean Prince missed the game with a foot injury. ... Young hit a 3 in the first quarter that gave him 150 and made him the 12th NBA rookie ever to reach the mark.\n\nEARLY MOVEMENT\n\nYoung and Lillard each had 18 points in the first quarter. It marked Lillard's highest total in the first quarter this season and tied a season high for Young.\n\nIN THE THIRD\n\nBlazers coach Terry Stotts called timeout after Kevin Huerter's 3 cut the lead to five. Enes Kanter followed with a hook shot, and Lillard tore through the Atlanta defense for a hard right-handed dunk that made it 66-59.\n\nThe Hawks pulled within four before Layman had three-point play, Lillard hit four free throws and Maurice Harkless' basket pushed the lead to 82-67. Aminu's 3 and Collins' short jumper made it a 21-point game.\n\nMOVING UP THE LIST\n\nYoung passed Dominique Wilkins for third place on the Atlanta rookie scoring list in the second quarter and moved past John Drew for second place late in the fourth with his 1,444th point. Wilkins, the Hawks' vice president for basketball and a longtime TV broadcaster, played from 1982-83. Drew debuted in 1974-75. Pete Maravich set the Hawks' record with 1,880 points in 1970-71.\n\nRESPECT FOR ICON\n\nU.S. Rep. John Lewis was honored briefly during the first-quarter timeout, receiving a long standing ovation for his lifetime contributions in public service. Lewis worked closely with slain civil rights leader Martin Luther King Jr. during the 1960s and has represented his adopted hometown's district since 1987.\n\nUP NEXT\n\nTrail Blazers: At Detroit on Saturday.\n\nHawks: Host Milwaukee on Sunday.\n\n---\n\nFor more AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995154.6322508
}