{
  "game_id": "0022000729",
  "espn_id": "401307519",
  "date": "Mar 31, 2021",
  "matchup": "LAL vs. MIL",
  "headline": "Drummond leaves debut with bruised toe, Bucks beat LA 112-97",
  "body": "LOS ANGELES -- — Andre Drummond left his Lakers debut with a bruised right toe, and Jrue Holiday scored 28 points in the Milwaukee Bucks' 112-97 victory over Los Angeles on Wednesday night.\n\n\r\n                    Giannis Antetokounmpo had 25 points and 10 rebounds, and Khris Middleton added 17 points and eight assists as the Bucks snapped their three-game losing streak with a workmanlike victory over the depleted defending NBA champions, who are still without LeBron James and Anthony Davis.\n\n\r\n                    Drummond scored four points in 14 minutes before limping off the court early in the third quarter after trying to play without the toenail on his big right toe. The nail was completely ripped off in the first quarter when Bucks center Brook Lopez stepped on Drummond's foot, but Drummond said he didn't notice the extent of the injury until halftime, even though it was “very, very painful.”\n\n\r\n                    “To have this happen to me in the first game is kind of deflating for me, but my head is high,” said Drummond, who hadn't played in a game for Cleveland since Feb. 12. “I’m going to take it game by game and come back better than ever.”\n\n\r\n                    X-rays were negative on Los Angeles' new center, but the bruise adds another injury problem to the Lakers' list ahead of a tough schedule in April. James missed his sixth straight game for the Lakers with a sprained right ankle, and Davis missed his 20th consecutive game with a right calf injury.\n\n\r\n                    “We don’t worry about that,” coach Frank Vogel said of the Lakers’ mounting injury woes. “We worry about the guys in uniform. We know we have enough. We have a deep team. We’ve been playing better basketball, and we know we can win. Our group is going to grind.”\n\n\r\n                    Montrezl Harrell scored 19 points and Dennis Schröder added 17 points for the Lakers' supporting cast, but their two-game winning streak ended against the powerhouse Bucks, who rebounded smartly from a blowout loss to the Clippers.\n\n\r\n                    “I think it was important (because) the starters hadn’t played well for the last two games,” Milwaukee coach Mike Budenholzer said. “They have high standards, high expectations of each other. They’ve set the bar high. We need to come out play well, play hard. There was a little bit of that tonight.”\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Bobby Portis missed his fourth straight game under the NBA's health and safety protocols. ... PJ Tucker missed his fourth straight game with a strained left calf. ... Donte DiVincenzo was called for a flagrant foul on Kentavious Caldwell-Pope in the third quarter.\n\n\r\n                    Lakers: Kyle Kuzma scored 16 points, but went 1 for 9 on 3-pointers. ... They hit eight of their first 12 3-pointers, a solid effort by a team ranked 23rd in 3-point shooting percentage. They then missed 22 of their final 24.\n\n\r\n                    ANTETOKOUNMPO BROTHERS\n\n\r\n                    Giannis Antetokounmpo and his two brothers shared the court for 52 seconds late in the fourth quarter. Thanasis Antetokounmpo is Giannis' teammate with the Bucks, while Kostas Antetokounmpo is a Lakers reserve.\n\n\r\n                    The Greek brothers also gathered on the court after the buzzer for a hug and a memorable conversation.\n\n\r\n                    “You can never have a feeling like this,” Giannis said. “This moment, seeing the guys I grew up with, we slept in the same bed, we were looking at the ceiling and just wondering if we were ever going to play in the NBA, to be on the court and have our mother watching and videotaping ... I think this is the best moment I’ve ever had in the NBA.”\n\n\r\n                    Giannis checked out of the game after just five simultaneous possessions for the three brothers, but he watched gleefully from the bench as Thanasis drilled a step-back 3-pointer over Kostas with 1:01 to play.\n\n\r\n                    “Thanasis is ruthless, man,\" Giannis said. \"Stepback on his little brother? C’mon, man. How can you do that to your little brother?”\n\n\r\n                    The Antetokounmpos became the second trio of brothers to play at the same time in an NBA game. Jrue Holiday and his brothers, Justin and Aaron, did it in December 2019.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: At Portland on Friday.\n\n\r\n                    Lakers: At Sacramento on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997294.201565
}