{
  "game_id": "0022201003",
  "espn_id": "401469158",
  "date": "Mar 10, 2023",
  "matchup": "TOR @ LAL",
  "headline": "Russell scores 28 points in return, Lakers beat Raptors",
  "body": "LOS ANGELES -- — D’Angelo Russell had 28 points and nine assists in his dynamic return from a six-game injury absence, and Dennis Schröder added 23 points and seven assists in the surging Los Angeles Lakers' 122-112 victory over the Toronto Raptors on Friday night.\n\n\r\n              Austin Reaves scored 18 points while Rui Hachimura and Jarred Vanderbilt added 16 apiece as the Lakers won for the seventh time in nine games even with little contribution this time from Anthony Davis.\n\n\r\n              The superstar big man had only eight points and nine rebounds while struggling against Toronto’s defense, but Russell and the Lakers' reserves took charge before Davis sealed the win on his only field goal of the second half with 46 seconds to play.\n\n\r\n              “That we were able to come away with this win against a really good team with only eight from (Davis), that's a sign of growth,” Lakers coach Darvin Ham said. “That's a sign of how deep and talented we are.”\n\n\r\n              Russell was the centerpiece of the Lakers’ activity at the trade deadline, but the point guard appeared in only four games to begin his second stint in Los Angeles before spraining his right ankle. He returned to the starting lineup with a spring in his step, hitting five 3-pointers while both making and celebrating a series of high-difficulty plays that had the Lakers' home crowd roaring repeatedly.\n\n\r\n              “I know this from being here (before): The fans are ready to explode at a certain point in the game,” Russell said. “I just wanted to bring that energy and give them that. ... It shouldn't go unnoticed, because our fans are the first to put a battery in someone's back that has a little momentum, so why not do the right things, bring that positivity and embrace what our fans have to offer?”\n\n\r\n              The Lakers moved into ninth place in the Western Conference three days ago with a win over Memphis, and they are excelling despite the lengthy absence of LeBron James. Russell and Schröder led an outstanding effort while the Lakers surged away to their sixth win in eight games since the All-Star break. Los Angeles also went 19 for 19 at the free throw line.\n\n\r\n              Scottie Barnes scored 20 of his career-high 32 points in the second half, and O.G. Anunoby made his first 11 shots while scoring 31 points for the Raptors, who had won seven consecutive road games against the Lakers since 2014.\n\n\r\n              Anunoby attributed the Raptors' fourth-quarter struggles to “them getting comfortable, them getting stops and playing with confidence. They hit shots, and it just carried over.”\n\n\r\n              Toronto went 1-4 on a five-game road swing capped by back-to-back losses in Los Angeles despite long stretches of strong play throughout the trip.\n\n\r\n              “Sometimes you can play bad basketball and win every game,” Anunoby said. \"You just try to take the positives from the losses, carry them over and win the next game.”\n\n\r\n              Russell racked up 12 points and seven assists in the first half while the Lakers erased an early 15-point deficit in a game with several wild momentum swings. The Lakers managed just four field goals in a nightmare third quarter, but took a nine-point lead midway through the fourth with a 26-8 run.\n\n\r\n              TIP-INS\n\n\r\n              Raptors: Will Barton scored five points in his return from a one-game absence with a non-COVID illness. ... Jakob Poeltl had 17 points and 10 rebounds.\n\n\r\n              Lakers: Ham said they haven't decided whether to sign a backup center with new acquisition Mo Bamba possibly sidelined until the postseason by a high left ankle sprain. ... Davis turns 30 on Saturday.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host Denver on Tuesday night.\n\n\r\n              Lakers: Host New York on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994023.383252
}