{
  "game_id": "0021901273",
  "espn_id": "401224748",
  "date": "Aug 06, 2020",
  "matchup": "LAL @ HOU",
  "headline": "Harden's 39 help Rockets past short-handed Lakers 113-97",
  "body": "LAKE BUENA VISTA, Fla. --  James Harden had 39 points and 12 assists to lead the Houston Rockets to a 113-97 victory on Thursday night over the Los Angeles Lakers, who were playing without LeBron James.\n\nThe Lakers, who clinched the top seed in the Western Conference on Monday, didn't have James because of a sore right groin.\n\nThe Rockets were also short-handed, missing Russell Westbrook because of a bruised right quadriceps. But the combination of Harden's big game and Houston's long-range shooting were enough to take care of the Lakers. The Rockets made 21 of 57 3's while Los Angeles hit just 2 of 19.\n\nThe Lakers scored the first 10 points of the fourth quarter to cut the lead to 94-89 with about eight minutes to go. Houston had three turnovers and didn't score in the fourth until a layup by Harden with just more than seven minutes remaining to allow Los Angeles to make it close.\n\nHouston coach Mike D'Antoni raved about the way Harden has been playing since the season restarted as the Rockets have gone 3-1.\n\n\"His commitment on defense is number one,\" he said. \"He stays locked in and is trying to win whatever it takes, accepting the double teams and trying to trying to bust it through to other guys. So there's a lot of good things to marvel about.\"\n\nHarden's layup jump-started Houston's offense and was the start of an 11-0 run that pushed the lead to 105-89 with five minutes remaining. Harden, Austin Rivers and Robert Covington each made a 3-pointer in that span.\n\n\"We're playing pretty good,\" Harden said. \"There's a lot of things especially defensively that we can correct but I think our energy ... and pace has been good.\"\n\nKyle Kuzma led the Lakers with 21 points and Anthony Davis added 17 points with 12 rebounds.\n\n\"We did some things poorly at times, we did some things well at times,\" Lakers coach Frank Vogel said. \"You learn from the tape and put it in the game plan for the next time you play these guys.\"\n\nA shot by Quinn Cook got the Lakers within 10 with midway through the third quarter. Houston scored the next seven points, with a 3 by Harden, to extend the lead to 86-69 about a minute later.\n\nThe Rockets used a 5-0 run capped by a 3-pointer from P.J. Tucker to make it 91-73 later in the third quarter. Los Angeles wrapped up the third with a 6-3 spurt to cut the deficit to 94-79 entering the fourth.\n\nHarden said the Rockets are focused on improving on defense as the playoffs approach.\n\n\"Our energy, our effort and our aggressiveness defensively is something that we have to hang our hats on,\" he said.\n\nTIP-INS\n\nLakers: Alex Caruso sat out with a sore neck. ... Rajon Rondo (right thumb surgery) arrived in Florida on Wednesday and must test negative for the coronavirus seven straight times before entering the bubble. But it's unclear when he'll be able to begin practicing. ... Dwight Howard had eight points and 15 rebounds after missing Wednesday's game with a sore knee.\n\nRockets: G Eric Gordon, who has missed all four games in the bubble after spraining his left ankle in a scrimmage, has began shooting again after resting his ankle for several days. Coach Mike D'Antoni hopes Gordon will be able to play in at least one game before the playoffs begin on Aug. 17.\n\nUP NEXT\n\nLakers: Play Pacers on Saturday.\n\nRockets: Play Sacramento Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996738.037958
}