{
  "game_id": "0021800362",
  "espn_id": "401071043",
  "date": "Dec 05, 2018",
  "matchup": "CHA @ MIN",
  "headline": "Towns has 35 points, Timberwolves beat Hornets 121-104",
  "body": "MINNEAPOLIS --  The air cleared following the trade of star Jimmy Butler, the Minnesota Timberwolves are talking more and winning as a result.\n\nKarl-Anthony Towns scored 35 points, Andrew Wiggins added a season-high 26 points and Minnesota beat the Charlotte Hornets 121-104 on Wednesday night for its sixth victory in seven games.\n\nTowns tied a career high with six blocks and had 12 rebounds. Wiggins tied season highs with six rebounds and five assists and the Timberwolves rallied again.\n\n\"I feel like it has changed,\" Wiggins said about the team's communication. \"I feel like everyone is just saying whatever is on their mind. Negative, positive, you just take it as a positive.\"\n\nA back-and-forth affair turned on another strong defensive half for Minnesota, which limited Charlotte to 40 points on 31.3 percent shooting in the second half. Jeff Teague had a season-high 18 assists, and Taj Gibson added 11 points and 10 rebounds for the Wolves.\n\nMinnesota recovered from a 19-point deficit for its biggest comeback win of the season Monday night against Houston. Wiggins scored seven straight points at one point for the Wolves in the second quarter as they used a 22-7 run to erase a 15-point deficit.\n\nMinnesota credited a second-half meeting as the turning point against the Rockets. Trailing by two at halftime on Wednesday, the Wolves again used the discuss what had gone wrong.\n\n\"We came in here, we had another talk,\" Towns said. \"Every game, we're getting more and more close with each other. We came in here and we had a very great discussion, I'll call it, with each other on what we had to do. We understood what the hole was and how to get out of it. We proved to ourselves we could get out of any hole.\"\n\nJeremy Lamb had 18 points and 11 rebounds for Charlotte, and Nicholas Batum finished with 18 points. The Hornets have lost five of their past six games.\n\n\"They showed that the last 10, 15 games when they made the trade that they have a good defensive team,\" Batum said. \"We had a good lead in the second quarter and we stopped playing as a team, I think, and stopped moving the ball. You've got to give credit to their defense also.\"\n\nTowns and Robert Covington, who came along with Dario Saric in the trade that sent Butler to Philadelphia, helped the Wolves pull away in the fourth. Towns had 11 points during a 22-2 run to take a 17-point lead in the fourth.\n\nTowns had 21 in the second half. Covington dealt with foul trouble in the first half but had 12 points in the second half and 17 for the game.\n\nCharlotte's reserves pushed the Hornets ahead in the second quarter. Charlotte started the quarter on a 20-6 run to open its biggest lead of the game at 15 points. Rookie Miles Bridges had a windmill dunk to begin the quarter and Frank Kaminsky hit a pair of 3s.\n\n\"Our margin for error is very small,\" Hornets coach James Borrego said. \"The first half the ball was moving. We made 3's. We got to the rim. I liked our attacks in the first half. Second half, we went a little bit dry.\"\n\nTIP-INS\n\nHornets: Marvin Williams was out of the lineup for the first time this season with a right shoulder strain sustained in Sunday's loss against New Orleans. Williams has started every game at power forward this season. Michael Kidd-Gilchrist started in his place. ... Kemba Walker made his 502nd career start for Charlotte, the most of any player in team history. Walker passed Muggsy Bogues, who had made 501 starts. ... The Hornets have lost three games in a row for the first time this season. They hadn't won or lost more than three games in a row all season.\n\nTimberwolves: Minnesota had 11 blocks, one shy of its season high for a single game. ... The Wolves play 10 of their next 13 games on the road.\n\nWIGGINS BOUNCES BACK\n\nWiggins had struggled for much of this season, culminating in an 0-for-12 shooting night on Nov. 24. It was the first time in Wiggins' career he finished a game scoreless. He recovered with one of his better games of the season on Monday against Houston and then followed it up on Wednesday.\n\nIt was the ninth career game for Wiggins with at least 20 points, five rebounds and five assists.\n\n\"It feels good to be back,\" Wiggins said. \"I had a little stretch where I wasn't playing too well, but it happens. I just got back in the gym and I got back to myself.\"\n\nUP NEXT\n\nHornets: Host Denver on Friday night.\n\nTimberwolves: At Portland on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994414.7741508
}