{
  "game_id": "0022301038",
  "espn_id": "401585666",
  "date": "Mar 25, 2024",
  "matchup": "HOU vs. POR",
  "headline": "Jalen Green’s 27 points leads Rockets over Trail Blazers for 9th straight win",
  "body": "HOUSTON -- — Jalen Green scored 27 points to lead the Houston Rockets to a 110-92 win over the Portland Trail Blazers on Monday night.\n\n\r\n              It was the Rockets' ninth straight win, their longest winning streak since 2019. \n\n\r\n              At 36-35, Houston is now just a half game behind Golden State for the final spot in the NBA Play-In Tournament. \n\n\r\n              “For sure, I’m looking at it,” Green said of the standings. “I was watching the Warriors last night. We’re making a push, and we’re executing so we’ve just got to stay the course.” \n\n\r\n              Green entered Monday tied for fourth in the NBA in scoring in March with 27.8 points per game on 51.4% shooting. Against Portland, he made 9 of 26 shots, including 4 of 12 from 3.\n\n\r\n              “He was kind of forcing it a little bit early and looked a little anxious, but he grinded it out and played the right way,” Rockets coach Ime Udoka said. “It was huge for him to come out in the second half like that.” \n\n\r\n              Rockets forward Jabari Smith Jr. was out, serving a one-game suspension for his Saturday night fight with Jazz guard Kris Dunn. In his place, Jock Landale had a season-high 17 points and added nine rebounds. \n\n\r\n              “His energy really got us back in the game,” Udoka said. “His energy has been huge lately, and we really needed it tonight with a few guys struggling early.” \n\n\r\n              Houston outscored Portland 33-20 in the third quarter, taking an 80-71 lead into the fourth after trailing 51-47 at halftime. \n\n\r\n              Portland suffered its seventh straight loss and fell to 4-13 since the All-Star break. \n\n\r\n              Dalano Banton led the Blazers with 28 points and 11 rebounds off the bench, while Scoot Henderson added 15 points.\n\n\r\n              “We need to keep our defensive intensity up,” Henderson said. “That’s going to give us a chance every night — defensive intensity, moving the ball and just making the game easier for ourselves and not trying to one-on-one the whole game because we can’t win like that.” \n\n\r\n              In Saturday night’s loss to Denver, Portland became the second team to start five rookies since NBA box scores started tracking starters in the 1971-72 season. The Blazers started the same five rookies on Monday night. \n\n\r\n              Portland briefly held a nine-point lead in the first quarter but entered the second quarter down 28-25. \n\n\r\n              “I thought we had a really good first half and had some good moments in that third quarter, but the game kind of turned,” Blazers coach Chauncey Billups said. “They picked up their defensive pressure, and we just didn’t respond well to it. Give them credit. They turned it up when they needed to, defensively, against a young group.” \n\n\r\n              The Blazers were missing Deandre Ayton (left elbow tendinitis), Anfernee Simons (left knee tendinitis), Malcolm Brogdon (right elbow tendinitis) and Jerami Grant (right hamstring strain). \n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Atlanta on Wednesday night.\n\n\r\n              Rockets: Visit Oklahoma City on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995571.170112
}