{
  "game_id": "0022101056",
  "espn_id": "401360876",
  "date": "Mar 18, 2022",
  "matchup": "CHI @ PHX",
  "headline": "Suns rout Bulls, move closer to wrapping up top spot in NBA",
  "body": "PHOENIX -- — As if the Phoenix Suns aren’t strong enough already, Deandre Ayton is adding some dimensions to his game.\n\n\r\n              “He is aggressive in the post. I didn’t see a ton of finesse,” Suns coach Monty Williams said after Ayton scored 20 points in the Suns’ 129-102 rout of the Chicago Bulls Friday night to move closer to clinching the NBA's best regular-season record this season.\n\n\r\n              “I saw, ‘I am getting to my spot and if you are not going to give me any resistance, I may go through you.’\"\n\n\r\n              Ayton was 8 of 11 from the field, continuing to make mid-range jumpers while also getting inside for easier shots. He also led the Suns with 12 rebounds.\n\n\r\n              At a franchise-best 57-14 through 71 games, the Suns moved nine games ahead of second-place Memphis with 11 games left. Memphis lost at Atlanta earlier Friday.\n\n\r\n              Devin Booker led Phoenix with 28 points. The Suns rolled despite being without two starters — point guard Chris Paul and forward Jae Crowder — and sixth man Cam Johnson, all out with injuries.\n\n\r\n              “We don’t want to be ‘Chris and Book’ dimensional,” Williams said. “We want to be comfortable to go to other guys so that in those key moments it is not something new to them.”\n\n\r\n              They certainly weren't Friday. Cameron Payne scored 15 points, Torrey Craig and Landry Shamet had 14 each, JaVale McGee 12 and Mikael Bridges 11.\n\n\r\n              DeMar DeRozan scored 19 points for Chicago, fifth in the Eastern Conference at 41-29. Nikola Vucevic added 16 points. Coby White had 14, Zach LaVine 12 and Tristan Thompson 11.\n\n\r\n              The Suns are 9-4 without Paul, out since the All-Star break with a fractured right thumb. \n\n\r\n              Craig started his second game in place of Crowder, and the forward came through with another strong performance. On Wednesday night at Houston, Craig scored 21 points on 8-of-8 shooting, including three 3-pointers, and had 14 rebounds.\n\n\r\n              “To get the lead that we got and sustain it, then maintain it throughout the second half was pretty impressive,” Craig said.\n\n\r\n              For the Bulls, it was more of the same. They lost their third in a row to fall to 2-6 in March. All the losses in the streak have been on the road, where Chicago is 16-19. After a home game on Monday, the Bulls play five straight on the road.\n\n\r\n              “I don’t want to take anything away from Phoenix or teams we’ve played against, but we’ve got to be able to have a better response when shots aren’t going in,” Chicago coach Billy Donovan said. “I thought some of the (Suns’) offensive rebounds in the second quarter really hurt us, and then we started missing shots. We gotta develop a resilience when it’s not going well.”\n\n\r\n              DeRozan said the team is dealing with some new adversity after a solid season.\n\n\r\n              “We’re at that time of the year where nothing is a secret,\" he said. \"We’ve played great basketball and now teams are coming after us no matter who we play. Once we figure it out, we’ll be fine.”\n\n\r\n              The teams met on Feb. 7 in Chicago, with Booker scoring 38 points in a 127-124 Suns victory.\n\n\r\n              “That is a really good team over there and we played really well,” Booker said. “We enjoy that matchup.”\n\n\r\n              NUMBERS\n\n\r\n              The Suns (48.5%) and Bulls (48.2%) entered Friday as the top field-goal percentage teams in the NBA. The Suns bettered their season average, making 56% while the Bulls struggled and made just 41%.\n\n\r\n              IRISH PRIDE\n\n\r\n              Williams was busy preparing for his team’s game, but he was able to keep track of Notre Dame’s upset victory over Alabama in the NCAA tournament earlier Friday.\n\n\r\n              “I saw a little before I left, and then I got a text telling me that they won,” the former Irish forward said before the game. Williams played at Notre Dame from 1989-94. “Coach (Mike) Brey has just changed our program. I hope he’s there for another 20 years.”\n\n\r\n              “It’s a big win for us because it’s hard to get those elite players to come to Notre Dame, because of other stuff. For him to do it in a year where this is not one of the years they’ve been really really good is great.\"\n\n\r\n              INJURY UPDATE\n\n\r\n              Bulls: PF Patrick Williams could return to the Bulls next week, Donovan said. Williams has missed 65 games with a wrist injury that required surgery.\n\n\r\n              Williams is likely to play Sunday for the Bulls’ Windy City G-League team before he returns to the NBA.\n\n\r\n              Donovan also said the status of G Lonzo Ball (right knee) has not changed. Ball, out since Jan. 28, is in the middle of the original prognosis of six to eight weeks, but he has not been able to resume activities. Donovan said there is a chance he will not return before the regular season ends in three weeks.\n\n\r\n              Suns: Crowder (left groin soreness) is being brought along slowly. He also missed sat out Wednesday night at Houston. Johnson (right quad) has missed eight games.\n\n\r\n              NEXT\n\n\r\n              Bulls: Host Toronto on Monday night.\n\n\r\n              Suns: At Sacramento on Sunday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992940.03182
}