{
  "game_id": "0021600542",
  "espn_id": "400899963",
  "date": "Jan 05, 2017",
  "matchup": "LAL @ POR",
  "headline": "McCollum scores 27 as Trail Blazers beat Lakers 118-109",
  "body": "PORTLAND, Ore. -- One down, two to go.\nWith his struggling team in a short stretch of games it really needs to win, Trail Blazers coach Terry Stotts is actually looking ahead a little bit.\nPortland got started Thursday night with a 118-109 victory over the Los Angeles Lakers. CJ McCollum scored 27 points and Damian Lillard had 21 points and 10 assists in his return from a sprained ankle.\n\"It's a little bit of a departure for me to talk about the future, but these three games get us back in the mix,\" Stotts said.\nFollowing their victory Thursday night, the Blazers host the Detroit Pistons on Saturday before heading south to play the Lakers again on Tuesday.\n\"We've been playing much better; it hasn't always led to wins,\" Lillard said. \"Two of these next three at home, one of them on the road against a team we beat tonight that we know we're capable of beating, we've got to take advantage of that, and not take it for granted.\"\nEvan Turner scored 15 of his season-high 20 points in the fourth quarter as Portland secured its ninth straight regular-season victory over the Lakers, a franchise record.\nD'Angelo Russell had 22 points, 10 in the final period, and Jordan Clarkson added 21 off the bench for Los Angeles, which led by 14 in the first half.\nRussell's turnaround jumper put the Lakers up 101-99 midway through the fourth. He added a pair of free throws, but Lillard hit a 3-pointer that closed the gap.\nMcCollum's floater put Portland in front before he hit a 3 with 4:06 to go that pushed the lead to 107-103. He added another basket that extended it, and the crowd chanted \"Beat L-A! Beat L-A!\"\nTurner padded the advantage with a jumper with just more than two minutes left, and the Lakers couldn't catch up.\n\"It was one of those nights where at the end all of the key plays went their way,\" Lakers guard Nick Young said.\nLillard missed five games after spraining his left ankle against San Antonio on Dec. 23. He is the team's top scorer with an average of 27 points and 6.2 assists per game. The Blazers went 2/3 without him, including Wednesday night's 125-117 loss to the Golden State Warriors.\n\"Obviously, he makes them a lot more dangerous,\" Lakers coach Luke Walton said before the game.\nLuol Deng sat out because of right biceps tendinitis. Deng played more than 31 minutes Tuesday night in the Lakers' 116-102 victory at home against Memphis.\nJulius Randle had a triple-double (19 points, 14 rebounds, 11 assists) against the Grizzlies. He finished with 17 points and nine rebounds against the Blazers.\nLillard didn't look rusty from the layoff, hitting his first four shots, including a 3-pointer that gave the Blazers an early 21-16 lead.\nClarkson, Lou Williams and Brandon Ingram hit consecutive 3s to cap a 13-0 run that gave the Lakers a 37-29 lead early in the second quarter. Los Angeles pushed the advantage to 54-43 after Russell's short jumper late in the half.\nPortland climbed back into it with a 13-2 run to open the second half, capped by Maurice Harkless' 3-pointer that tied the game at 66. The Blazers took an 84-81 lead on Turner's fast-break layup late in the third quarter.\nTIP-INS\nLakers: Walton said he can't really compare his head coaching experience from last season, when he stepped in for Steve Kerr with the Warriors, to his first season running the Lakers. \"This whole thing takes time, and obviously we're in the earlier stages,\" he said.\nTrail Blazers: Allen Crabbe has scored in double figures in five straight games, a season high. He finished with 14 points. ... McCollum has averaged 35 points over the last three games.\nLILLARD'S ANKLE\nLillard, who had his fourth double-double in his past six games, said he was pain-free following the game.\n\"He looked really fresh at the beginning. He may have fatigued a little bit. A couple of the shots late looked a little tired. But I thought he managed the game pretty well,\" Stotts said. \"I tried to get him off the ball so it wasn't quite as fatiguing.\"\nQUOTABLE\n\"Honestly, I didn't feel like we had our legs. Not sure why, but it felt like we came out and the first couple of plays we ran and we weren't cutting hard, we weren't pushing the ball into the spots we wanted the ball to be in. That's not OK. So we made a mess, and we tried to regroup from there,\" Walton said.\nUP NEXT\nLakers: Host the Miami Heat on Friday night.\nTrail Blazers: Host the Detroit Pistons on Saturday night, when an ice storm is expected to hit Portland.",
  "source": "espn_api",
  "crawled_at": 1764995408.060452
}