{
  "game_id": "0021901292",
  "espn_id": "401224767",
  "date": "Aug 10, 2020",
  "matchup": "PHX vs. OKC",
  "headline": "Booker's 35 help Suns top Thunder, remain perfect in restart",
  "body": "LAKE BUENA VISTA, Fla. --  Devin Booker scored 35 points, and the Phoenix Suns rolled past the short-handed Oklahoma City Thunder 128-101 on Monday to improve to 6-0 in the restart and improve their playoff chances.\n\nThe Suns have surged in the Western Conference standings. They entered the day just 1 1/2 games behind eighth-place Memphis and a game behind ninth-place Portland in the race to qualify for a spot in the play-in series.\n\n\"We haven't accomplished anything,\" Phoenix coach Monty Williams said. \"That may sound like coach-speak, but we dug ourselves a hole with our record. We scrapped all year long and won some games, but it's been an uphill battle.\"\n\nWilliams appreciates the position the Suns are in.\n\n\"We've done a good job of getting to this point,\" he said. \"No one knew we were going to be here, but we're here and we're thankful for that.\"\n\nPhoenix center Deandre Ayton sat out the first quarter because he missed his coronavirus test on Sunday. He tested negative on Monday and was cleared. He started the second quarter.\n\n\"In an NBA season guys are going to make mistakes,\" Williams said. \"You have to be able to give people grace. It wasn't intentional. Thankfully he was able to get tested early enough that he was able to come back and play, and the guys received him with open arms because we all understand we're human.\"\n\nWith Ayton out, Oklahoma City led 37-23 at the end of the first quarter. After Ayton entered the game, Phoenix dominated the rest of the way. He finished with 10 points and six rebounds in just over 17 minutes.\n\nOklahoma City was without four of its top five scorers. Shai Gilgeous-Alexander (bruised right calf), Danilo Gallinari (left ankle maintenance), Dennis Schroder (birth of child) and Steven Adams (bruised left leg) sat out. Reserve center Nerlens Noel (sprained right ankle) also did not play.\n\nRookie Darius Bazley had 22 points and 10 rebounds for the Thunder.\n\nThe Suns rallied from 15 points down in the second quarter to take a 65-64 lead at halftime. Phoenix opened the second half on an 11-2 run and controlled the game from there.\n\n\"I thought their pressure disrupted us,\" Thunder coach Billy Donovan said. \"I thought we got a little bit stagnant. We made some pretty decent plays. We were able to get some open looks, but I thought there in the second quarter they turned up their defensive intensity and that probably took us out of some rhythm.\"\n\nTIP-INS\n\nThunder: Mike Muscala scored 11 points in just his second start of the season. ... Abdel Nader scored 15 points in his seventh start of the season. ... Bazley joined Russell Westbrook and James Harden as the only Thunder rookies to score at least 20 points in back-to-back games.\n\nSuns: Mikal Bridges and Cameron Johnson each scored 18 points. ... Cameron Payne, a former Thunder player, scored 14 points. ... Shot 57% in the second quarter.\n\nLONG RANGE\n\nBooker drained a shot from near halfcourt as the shot clock wound down to give the Suns an 88-75 lead in the third quarter.\n\nThe box score listed the shot as 39 feet.\n\n\"I was telling the guys on the team `I was open.\" Booker said grinning. \"No, I'm just messing with you. It was late in the shot clock, decided I had to get one on the rim.\"\n\nSTAT LINES\n\nPhoenix has averaged 120 points in its six-game surge.\n\n\"What's working for us is we've committed to a style of play,\" Williams said. \"We've been able to adapt to different situations. Being in this bubble has been like two training camps for us.\"\n\nQUOTABLE\n\nChris Paul was the only one of Oklahoma City's top five scorers this season to play. The 35-year-old point guard finished with 14 points and seven assists.\n\nPaul said he remembers times when he couldn't participate because of injury, so he doesn't take opportunities to play for granted.\n\n\"I just want to hoop and I feel great,\" he said.\n\nUP NEXT\n\nThunder: Play the Miami Heat on Wednesday.\n\nSuns: Play the Philadelphia 76ers on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996536.1295831
}