{
  "game_id": "0021900197",
  "espn_id": "401160839",
  "date": "Nov 18, 2019",
  "matchup": "OKC @ LAC",
  "headline": "George’s 3 helps Clippers edge Thunder 90-88",
  "body": "LOS ANGELES --  The Clippers’ offense wasn’t doing much through three quarters, so they buckled down on defense and narrowly avoided getting beat by a couple of former teammates.\n\nPaul George hit a go-ahead 3-pointer against his old team with 25 seconds left, lifting Los Angeles over the Oklahoma City Thunder 90-88 on Monday night to improve to 8-1 at home.\n\n“It’s any other game but it was fun to see familiar faces and share some laughs,” George said.\n\nWith the Clippers minus Kawhi Leonard for the third straight game because of a bruised left knee, Oklahoma City tied the score at 86 on a 3 by ex-Clipper Danilo Gallinari. Chris Paul made two free throws after being fouled by George for an 88-86 lead, but George’s 3 put Los Angeles back ahead 89-88.\n\nMaurice Harkless was then called for a foul on Gallinari that was overturned following a replay challenge by Clippers coach Doc Rivers.\n\n“I’m changing my opinion. I think the challenge is good for the game,” joked Rivers, who had been critical of the new rule.\n\nThe Thunder retained possession and Terrance Ferguson inbounded to Gallinari, whose open 3-pointer missed.\n\n“The last shot Gallo took, I cringed. I’ve seen that movie before,” said Lou Williams, who had 11 points and nine assists. Wide open at the top of the key, that’s his shot. Luckily for us it rimmed out.”\n\nGeorge hit a free throw with 0.3 seconds left to close it out against the team that traded him to Los Angeles last summer.\n\n“The difference in the game was me not fighting through that screen at the end that allowed Paul George to get that final shot,” said Paul, who had forced a turnover by George on the previous play.\n\nThe Thunder fell to 0-5 on the road.\n\nMontrezl Harrell had 28 points and 12 rebounds off the bench to lead the Clippers. George finished with 18 points after scoring 30-plus in his first two games of the season after rehabbing from two shoulder operations.\n\n“Offense was spotty all night but we did a great job of making enough winning plays,” Harrell said. “That is just what it comes down to, putting enough stops together and making sure that the defense does not take a lapse even when your offense isn’t going for you.”\n\nPaul scored 22 points, making 10 of 11 free throws, in 29 minutes. Gallinari added 14 points and Shai Gilgeous-Alexander, another former Clipper, had 11 points despite five fouls. Gilgeous-Alexander also took a late 3 that missed.\n\nNeither team led by more than six points all night.\n\nHarrell scored on back-to-back dunks, with George’s alley-oop pass setting up the first one, and he scored another basket before George followed with a 3-pointer to put the Clippers ahead 75-70.\n\nThe Thunder led 79-78 on a basket by Dennis Schroder before Harrell dominated the final 2:44.\n\nHarrell scored eight straight points to give Los Angeles an 86-83 lead.\n\nThe Thunder led 59-54 on Paul’s 3-pointer in the third. The Clippers revived themselves with a 12-5 run, getting back-to-back 3-pointers from Patrick Patterson and JaMychal Green, to head into the fourth leading 66-64. George was limited to a single 3 in the quarter.\n\nTIP-INS\n\nThunder: Gallinari and Gilgeous-Alexander were honored with a video tribute from the Clippers during a timeout in the first quarter. “The people were very good to me and I was very happy to see the video,” Gallinari said. Gilgeous-Alexander missed the video because he was talking to his coach. “I’ll have to go and see it later,” he said. ... Hamidou Diallo (left knee sprain) sat out his second straight game.\n\nClippers: Landry Shamet (high ankle sprain) missed his fourth game in a row. ... Assistant coach Sam Cassell turned 50.\n\nTURNING IT OVER\n\nGeorge had seven turnovers as he continues to adjust to his new teammates.\n\n“When you miss a lot of games you’re usually sloppy with the ball,” Rivers said. “All of those things will get better for him as the season goes on.”\n\nCOMING HOME\n\nPaul hasn’t left Los Angeles completely. His family continues to live here, including his wife and kids who have remained in local schools. His father and brother attended the game, too.\n\n“I love coming back here,” he said.\n\nUP NEXT\n\nThunder: At the Los Angeles Lakers on Tuesday in the second game of a local back-to-back at Staples Center. The teams play again at OKC on Nov. 22.\n\nClippers: Host the Boston Celtics on Wednesday in the third of five straight home games.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996249.2098649
}