{
  "game_id": "0021800193",
  "espn_id": "401070874",
  "date": "Nov 12, 2018",
  "matchup": "CHI vs. DAL",
  "headline": "Barnes scored 22, leads Mavericks past Bulls 103-98",
  "body": "CHICAGO --  The Dallas Mavericks didn't need a big contribution from Luka Doncic to beat the Chicago Bulls. Harrison Barnes and J.J. Barea took care of that.\n\nBarnes scored a season-high 23 points and the Mavericks overcame a sluggish performance by their prized rookie to beat the Bulls 103-98 Monday night.\n\nBarea added 14 points, five rebounds and five assists, and the Mavericks won for the third time in four games after losing six in a row, even though Doncic struggled. The leading scorer among NBA rookies, Doncic finished with 11 points on 3-of-12 shooting.\n\n\"Sometimes, (Doncic)'s gonna have bad games,\" Barea said. \"He's still young, and he can't be great every game. So we've got to help him out.\"\n\nThe Mavericks led by as many as 14 points and never trailed after the first quarter. But they struggled to put this one away, with Chicago pulling within a point four times in the second half.\n\nZach LaVine led the Bulls with 26 points. Jabari Parker scored all but two of his 16 points in the second half.\n\nLaVine's breakaway windmill dunk cut Dallas' lead to 58-57, but Dennis Smith Jr. responded with a 3-pointer.\n\n\"We came out too lackadaisical,\" LaVine said. \"We've got to come out and play better. We've got to have more energy.\"\n\nIt was 87-84 midway through the fourth when Smith hit a jumper and Barnes made two free throws to stretch the lead to seven points. Doncic hit a 3 with just over three minutes left to make it 96-88. After the Bulls got within four, Barnes made two free throws with 10.5 seconds left and the Mavericks hung on.\n\n\"We've had a lot of tough losses this year, times where we were close and just couldn't get over the hump, couldn't make the right play,\" Barnes said. \"Things are finally starting to come together.\"\n\nBENCH BOSSES\n\nDallas' bench outscored Chicago's subs 44-26. \"Our bench has been playing great for us all season,\" Barnes said. \"So it has been great to see them keep us in games, get us in games, finish games.\"\n\n3-POINT WOES\n\nThe Bulls, who came into the game shooting 36.9 percent on 3-pointers, were 8 of 33. LaVine missed all six.\n\nTIP-INS\n\nMavericks: Mavericks G Wesley Matthews missed Monday's game because of a strained left hamstring. Matthews did not travel to Chicago. He played 31 minutes in a win over Oklahoma City on Saturday. Coach Rick Carlisle says the Mavericks hope he can play Wednesday, when the Mavericks host Utah. ... Jalen Brunson, who's from suburban Lincolnshire, scored two points in his first NBA game in Chicago. ... Carlisle said the Mavericks would have drafted Wendell Carter Jr. with the fifth overall pick this year had they not traded up to get Doncic at No. 3. Carter went to the Bulls at No. 7. \"I see him as another coming of an Al Horford-type player,\" Carlisle said.\n\nBulls: The Bulls expect F Lauri Markkanen to miss more time than they initially anticipated because of a left elbow injury he suffered in the preseason. Coach Fred Hoiberg said Markkanen will likely wind up missing nine to 11 weeks. The Bulls initially thought he would be out six to eight weeks after he was hurt in practice in late September. Hoiberg said Markkanen still is experiencing some pain and is not shooting from long range. ... Hoiberg said G Kris Dunn (sprained medial collateral ligament in his left knee) has not started running on the court. He was hurt at Dallas on Oct. 22.\n\nUP NEXT\n\nMavericks: Host Utah on Wednesday.\n\nBulls: Visit Boston on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994846.792414
}