{
  "game_id": "0021800869",
  "espn_id": "401071542",
  "date": "Feb 21, 2019",
  "matchup": "BKN vs. POR",
  "headline": "Center duo of Nurkic, Kanter leads Blazers over Nets, 113-99",
  "body": "NEW YORK --  When Jusuf Nurkic went to the bench, the Portland Trail Blazers inserted a player who barely knew their offense.\n\nImagine how good Portland's center combination can be once Enes Kanter gets up to speed.\n\nNurkic had 27 points and 12 rebounds, Kanter added 18 points and nine boards in his Portland debut, and the Trail Blazers beat the Brooklyn Nets 113-99 on Thursday night.\n\n\"Obviously, our two big guys really dominated inside,\" Blazers coach Terry Stotts said.\n\nThe tandem was so good that the Trail Blazers didn't even need a big night from All-Star guard Damian Lillard, who was just 5 for 21 from the field. He finished with 13 points, eight rebounds and eight assists.\n\n\"They're going to change the dynamic for a lot of teams, how they guard us obviously,\" Blazers guard CJ McCollum said.\n\nKanter signed last week with the Blazers after losing his job with the Knicks and then getting his release after they couldn't find a deal before the trade deadline. He made his first seven shots and finished 8 for 9, missing only a 3-pointer, as the Blazers relied on a steady diet of pick-and-rolls when he was in to compensate for his unfamiliarity with their sets.\n\nLanguishing on the bench during much of what became an 18-game losing streak for the Knicks, Kanter was excited to be on the floor in meaningful situations.\n\n\"Last time I got a win I think it was like almost two months,\" he said.\n\nMcCollum added 21 points in a good return from the break for the Blazers after going into it with a 129-107 victory over Golden State. They opened a seven-game road trip and don't play their first home game after the All-Star break until March 7 against Oklahoma City.\n\nAllen Crabbe had 17 points for the Nets, who came out of the All-Star break above .500 for the first time since 2013. All-Star guard D'Angelo Russell shot only 4 for 16, finishing with 14 points and eight assists.\n\n\"We didn't have great rhythm tonight, didn't play well. I think that's across the board. Didn't coach well, didn't play well,\" Nets coach Kenny Atkinson said. \"It was just one of those games where I think Portland was simply the better team. There's just no way around it.\"\n\nLillard's 3-pointer midway through the third -- his only one through three quarters -- gave Portland a 69-63 lead that the Blazers would extend largely through Kanter's work inside. He followed with four baskets in the period, including one that gave Portland its largest lead at 82-67.\n\nThe lead was 14 after his free throws with 10:40 to play before Ed Davis, Shabazz Napier and Crabbe -- all former Blazers -- fueled a 15-2 surge that trimmed it to 90-89. But Portland pushed the lead back into double digits, with Lillard contributing a 3-pointer with a little over 3 minutes to go and Nurkic getting a three-point play when he was fouled on a powerful dunk.\n\nTIP-INS\n\nTrail Blazers: Portland has won four straight in Brooklyn. ... Al-Farouq Aminu had 11 points and 10 rebounds.\n\nNets: F Jared Dudley returned after missing 16 games with a strained left hamstring. That leaves just sixth man Spencer Dinwiddie on the Nets' injured list, and Atkinson said he is doing plenty of things on the court as he recovers from surgery to repair torn ligaments in his right thumb.\n\nBROOKLYN'S BROADCASTER\n\nThe Nets honored YES Network announcer Ian Eagle for his 25 years calling the team's games. Eagle was presented with a No. 25 Nets jersey with his name on it, and a video tribute featuring former Nets players was played on the video screen.\n\nLEVERT IN THE LINEUP\n\nCaris LeVert had 12 points on 4-for-11 shooting. He was just 13 for 36 in his first three games since returning from a lengthy absence with a dislocated right foot, but Atkinson kept him in the starting lineup. Atkinson said he still trusted LeVert and thought he was looking good even with his shot not falling yet.\n\n\"Obviously we have a long relationship now. He's been here from the beginning and so I'm not thinking of just the past three games, three or four games,\" Atkinson said. \"I'm thinking of preseason and last season and how well he started the season and listen, I think from a physical standpoint he's looked pretty sharp.\"\n\nUP NEXT\n\nTrail Blazers: At Philadelphia on Saturday.\n\nNets: At Charlotte on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995395.122157
}