{
  "game_id": "0022200212",
  "espn_id": "401468367",
  "date": "Nov 16, 2022",
  "matchup": "MIN @ ORL",
  "headline": "Edwards, Towns lead Timberwolves to rout of Magic, 126-108",
  "body": "ORLANDO, Fla. -- — Anthony Edwards scored 35 points, Karl-Anthony Towns added 30 and the Minnesota Timberwolves built a 27-point lead in the first half in a 126-108 victory over the Orlando Magic on Wednesday night.\n\n\r\n              Edwards and Towns had season scoring highs and the Timberwolves shot 52.3% in posting their biggest victory margin of the season. \n\n\r\n              Edwards' big scoring night and six assists were birthday presents for Towns, who turned 27 on Tuesday.\n\n\r\n              “I texted him and told him, ‘Happy birthday,’ and that I would see him this morning,” Edwards said. \"He did what he gets paid to do for his birthday — 10 for 15 from the field, 30 points and he’s the reason we won tonight. That’s his gift from me.”\n\n\r\n              Rudy Gobert, the NBA’s leading rebounder, had 16 points and eight rebounds to help Minnesota win back-to-back road games for the first time this season.\n\n\r\n              Bol Bol led the Magic with a career-high 26 points and added 12 rebounds. Jalen Suggs added 23 points, six rebounds and six assists.\n\n\r\n              Edwards hit three 3-pointers and had a dunk to spot the Timberwolves to a 15-6 lead and they stretched it to 18 by the end of the first quarter. He finished the first quarter with 19 points.\n\n\r\n              “Obviously his great start kind of launched us. Then everyone just kind of fed into the game,” said Minnesota coach Chris Finch. \"Then he started to drive it in the third (quarter) against their switches and was able to get to the free throw line.” \n\n\r\n              “I should have had probably more, but I missed some free throws, missed some layups and open threes,\" said Edwards, who compiled a plus/minus of plus-29 in 39 minutes. \n\n\r\n              Orlando cut a 27-point second-half lead down to nine on a four-point play by Suggs early in the fourth quarter, but D'Angelo Russell scored nine of his 11 points to help Minnesota push its lead back up to 114-97 in the closing minutes.\n\n\r\n              “We showed grit and toughness in the second half, but you have to bring it for both halves. You can’t play 24 minutes of basketball,” Suggs said. “We have to bring it from the tip.”\n\n\r\n              The Magic played without rookie Paolo Banchero and center Wendell Carter Jr., their two leading rebounders and two of their top three scorers.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: F Taurean Prince was ejected after committing a Flagrant Foul 2 on Suggs with 4.9 seconds remaining in the third quarter. ... Finch raised his career coaching record to 69-69. ... The ‘Wolves, who came into the NBA with the Magic in 1989, are 24-42 against Orlando.\n\n\r\n              Magic: The Magic went 3-4 on a seven-game homestand. ... Carter missed the game due to a foot injury. Coach Jamahl Mosley said Carter has been “playing through it” for some but he missed his first game of the season.\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: At Philadelphia on Saturday night.\n\n\r\n              Magic: At Chicago on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995185.664439
}