{
  "game_id": "0022400046",
  "espn_id": "401703415",
  "date": "Nov 29, 2024",
  "matchup": "MIA vs. TOR",
  "headline": "Butler scores 26, Herro adds 23 and Adebayo has triple-double as Miami tops Toronto 121-111",
  "body": "MIAMI -- — Jimmy Butler scored 26 points, Tyler Herro added 23 and the Miami Heat beat the Toronto Raptors 121-111 on Friday night.\n\n\r\n              The Heat were 21 of 54 on 3-pointers in the game, the third-most attempts from beyond the arc in franchise history. Miami has taken 56 in a game twice.\n\n\r\n              Bam Adebayo had a triple-double for Miami — 14 points, 10 assists and 10 rebounds, the last of those boards coming after Butler airballed a jumper in the final seconds. Jaime Jaquez Jr. scored 15 points for the Heat, who moved back over .500 at 9-8.\n\n\r\n              Scottie Barnes had a triple-double for Toronto with 24 points, 10 rebounds and 10 assists. RJ Barrett scored 25 for Toronto and Jakob Poeltl — on 10-for-11 shooting — finished with 24 points and 10 rebounds.\n\n\r\n              Takeaways\r\n              Raptors: Bruce Brown, who has yet to play this season following right knee surgery, continues conditioning toward his debut. “We don't want to rush anything. It's very important for him to get his health right, conditioning right,” Raptors coach Darko Rajakovic said.\n\n\r\n              Heat: Butler is shooting 61% in his last five games — 35 for 57 in that span since he returned from a four-game absence with a sprained ankle.\n\n\r\n              Key moment\r\n              Toronto went on a 12-0 run to take a 79-77 lead. Miami immediately answered with a 19-2 run to take a 96-81 edge with 43.7 seconds left in the third quarter and never trailed again.\n\n\r\n              Key stat\r\n              It was the first game in Heat history where the team used at least 10 players and all of them took two or more shots from 3-point range. There had been three other games in club history where at least 10 Miami players took two 3s — but not everyone who played on those nights did so.\n\n\r\n              Up next\r\n              The teams face off again Sunday in Toronto.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996925.440165
}