{
  "game_id": "0022301215",
  "espn_id": "401616469",
  "date": "Dec 06, 2023",
  "matchup": "DEN @ LAC",
  "headline": "Clippers overcome Jokic's triple-double to beat Nuggets 111-102 and snap 8-game skid against champs",
  "body": "LOS ANGELES -- — The Los Angeles Clippers are starting to figure out who they are since James Harden's arrival a month ago.\n\n\r\n              Paul George scored 25 points and the Clippers overcame an early 15-point deficit to beat Denver 111-102 on Wednesday night and snap an eight-game skid against the defending NBA champion Nuggets.\n\n\r\n              “To bounce back and beat Sacramento, beat Golden State the other night, it's coming,” Clippers coach Tyronn Lue said. “I give those guys for just staying patient. I think we found who we are and how we want to play. Tonight was a big step in the right direction.”\n\n\r\n              Denver won 113-104 last week in Los Angeles as former Clipper Reggie Jackson scored 35 points with Nikola Jokic, Jamal Murray and Aaron Gordon all sidelined. They all played in the rematch.\n\n\r\n              Murray scored 23 points in his return from a sprained right ankle while limited to 29 minutes.\n\n\r\n              “We still could have won the game,\" Murray said. \"It's not because Jokic missed a couple floaters.”\n\n\r\n              Jokic had a triple-double with 22 points, 15 rebounds and 10 assists. He shot 9 of 32.\n\n\r\n              “I was taking the shots I usually take,\" Jokic said. “The ball didn't get in on some possessions. Some possessions they played really good defense.” \n\n\r\n              Michael Porter Jr. had 18 points and nine rebounds, making 7 of 8 from the floor and hitting four 3-pointers.\n\n\r\n              It was Denver's first loss to the Clippers since Jan. 11, 2022. The Nuggets fell to 5-8 on the road.\n\n\r\n              The Clippers led by one when Harden and Kawhi Leonard combined to score 11 in a row for a 103-97 lead.\n\n\r\n              Harden added 20 points and 11 assists, Leonard had 17 points and Norman Powell had 17 points off the bench as the Clippers got back to .500 at 10-10.\n\n\r\n              “We still want to come in and be a defensive team,” Leonard said. “I still feel like defense wins championships.”\n\n\r\n              Jokic scored six straight to open the third and Jackson scored four in a row to close it with Denver leading 82-79.\n\n\r\n              The Clippers outscored the Nuggets 40-21 in the second, led by Powell with 11 points and Harden with nine. After tying the game at 46-all on Kobe Brown's 3-pointer, the Clippers ran off 11 in a row while their improved defense forced Jokic into repeated misses and two turnovers. He was held to four points in the quarter, when the Clippers led 61-57 at halftime.\n\n\r\n              The Nuggets came out firing, hitting eight 3-pointers in the first including three by Porter. They shot 58% from the floor and led by 15 points.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Houston on Friday night.\n\n\r\n              Clippers: At Utah on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996766.176967
}