{
  "game_id": "0022301162",
  "espn_id": "401585790",
  "date": "Apr 10, 2024",
  "matchup": "ORL @ MIL",
  "headline": "Portis scores 30 points, Bucks beat Magic 117-99 without injured Antetokounmpo",
  "body": "MILWAUKEE -- — Bobby Portis had 30 points, nine rebounds and a career-high five steals to help the Milwaukee Bucks withstand Giannis Antetokounmpo's absence and beat the Orlando Magic 117-99 on Wednesday night.\n\n\r\n              The Bucks played a night after Antetokounmpo left a 104-91 victory over the Boston Celtics because of a strained left calf. The Bucks announced Wednesday that the two-time MVP would miss the final three games of the regular season, though his availability for the start of the playoffs remains uncertain.\n\n\r\n              “No timeline or anything like that, but we’ve got the best team working with him,” Bucks coach Doc Rivers said before the game. “There’s no one who’s going to work harder than him. You know that. He’ll be back when he should be back. We’ll find out when that is.”\n\n\r\n              Damian Lillard had 29 points and nine assists for the Bucks, who improved to 4-3 in games Antetokounmpo has missed this season. Jae Crowder scored 14 points off the bench. Pat Beverley had 13 points, eight rebounds and six assists.\n\n\r\n              Milwaukee also was missing Khris Middleton as the team monitors his workload after a sprained left ankle caused him to sit out 16 straight games this season.\n\n\r\n              “We're a deep team,” Lillard said. “Obviously Giannis is the head of the snake. When he's out there, we're at our best. But we've got a lot of guys in our locker room. We've got vets, and I think tonight, we understood what the mission was. We knew that we were going to be a couple of guys down -- Giannis and Khris. We knew how we had to play. We knew what kind of energy we needed to have. I thought we came out and played that way from the start.”\n\n\r\n              Milwaukee (49-31) is 1 1/2 games ahead of New York (47-32) and two games ahead of Cleveland (47-33) in the race for the Eastern Conference’s No. 2 playoff seed behind the Boston Celtics, who already have clinched the NBA’s best regular-season record.\n\n\r\n              The Magic (46-34) have lost two straight and three of four as they try to earn one of the Eastern Conference’s top six seeds and avoid falling into a play-in situation. Orlando is chasing its first playoff berth since 2020 and only its third since 2012.\n\n\r\n              Orlando visits Philadelphia on Friday and hosts Milwaukee on Sunday in its final two regular-season games.\n\n\r\n              “I think those games will be very similar to the game we played tonight,” said Cole Anthony, who led the Magic with 23 points. “Tonight was a playoff atmosphere. The fans were loud. The refs, they were kind of letting us play. And we played against a really good team. That's how it's going to be when we get to the playoffs.”\n\n\r\n              Paolo Banchero had 20 points and Jalen Suggs added 18 for the Magic. Orlando's Franz Wagner missed a second straight game because of a sprained right ankle.\n\n\r\n              The Magic scored the first five points of the game, but the Bucks answered with a 7-0 run. Although the Magic tied the game a couple of times in the next 2 1/2 minutes, they never led again.\n\n\r\n              Portis had 24 points and four steals in the first half alone to help the Bucks grab a 64-50 lead at the break. In the first 1 1/2 quarters of the game, Orlando committed 10 turnovers and the Bucks outscored the Magic 16-0 in points off turnovers.\n\n\r\n              “They did a great job of capitalizing off every single mistake we made,” Anthony said.\n\n\r\n              The Bucks maintained a double-digit lead throughout the second half.\n\n\r\n              Bucks reserve guard A.J. Green played 15 minutes before exiting with a sprained left ankle.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Philadelphia on Friday night.\n\n\r\n              Bucks: At Oklahoma City on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995678.5452218
}