{
  "game_id": "0021501153",
  "espn_id": "400829040",
  "date": "Apr 03, 2016",
  "matchup": "LAL vs. BOS",
  "headline": "Boston Celtics survive Kobe Bryant's 34, beat Lakers 107-100",
  "body": "LOS ANGELES -- After 20 years, two NBA Finals meetings and countless major moments, Kobe Bryant cherishes the history and tradition of the Los Angeles Lakers' rivalry with the Boston Celtics.\nByron Scott hopes the youngsters currently wearing those famed uniforms now understand what the rivalry means to the men who came before them after watching the way Bryant left it.\nIsaiah Thomas scored 26 points, and the Celtics clinched a playoff berth while besting Bryant for the final time with a 107-100 victory over the Lakers on Sunday night.\n\nBryant scored 34 points in his final showdown with the Lakers' traditional rivals, putting up the second highest-scoring performance of his farewell season. And unlike in most games on this strange, friendly farewell tour of the NBA with a miserable Lakers team, Bryant wasn't having much fun.\n\"This is probably the first game in a while where K.B. was dead serious for the whole game,\" said Scott, the longtime Lakers guard whose distaste for the Celtics is palpable. \"He understands it's serious.\"\nBryant hit a jumper with 56 seconds left, and Julius Randle's three-point play moments later trimmed Boston's lead to four points, setting off roars at Staples Center. But Bryant missed two late jumpers, and the Celtics secured their eighth playoff berth in nine years.\n\"It's weird, the last time I'm facing that green,\" Bryant said. \"It's been a joy to go against them, to be a part of a rivalry that I've watched for so long.\"\nRandle had 20 points and 10 rebounds, and Jordan Clarkson added 17 points in the Western Conference-worst Lakers' 60th loss of the season.\nJae Crowder added 22 points for the Celtics, who blew an early 17-point lead and survived a tense fourth quarter in their first game since snapping the Golden State Warriors' NBA-record 54-game home winning streak.\nEvan Turner scored eight of his 17 points in the fourth quarter, while Amir Johnson had 10 points and 13 rebounds for the Celtics, who were grateful to survive Bryant's last shot.\n\"That's the best player of my generation,\" said Thomas, who scored 13 points in a 2-minute span of the second quarter. \"He changed the game, not just on the court, but off the court. He means a lot. That's my favorite player.\"\nBOSTON FUTURE\nThe Celtics also moved a half-game ahead of Miami and Charlotte for fourth place in the tight Eastern Conference standings. \"That's what you want, to give yourselves a chance, and the only way you get a chance is to make the playoffs,\" Boston coach Brad Stevens said. \"It's been a very focused group.\"\nKOBE'S LAST SHOT\nBryant, who made a key shot in the Lakers' surprising win at Boston on Dec. 30, came back with his fourth 30-point game of his final season. He hadn't gone for 30 since getting a season-high 38 against Minnesota two months ago.\n\"I told him, `Are you sure you're going to retire this year?\" Crowder said with a laugh.\nBryant looked rejuvenated after playing just nine minutes in the Lakers' previous game four days ago. The 20-year veteran still intends to play in each of the Lakers' six remaining games.\nVITTI'S VALEDICTION\nThe Lakers honored retiring athletic trainer Gary Vitti after the first quarter with a video tribute, a standing ovation and a framed jersey featuring a medical cross in place of a number. Vitti has been on the Lakers' bench for 32 seasons, overseeing the health of Bryant and his teammates while the Lakers won eight championships. Bryant has credited Vitti with a major role in his resilience through innumerable injuries.\nTIP-INS\nCeltics: Turner played 35 minutes after starting in place of Avery Bradley, who left the team for what Stevens called \"good personal reasons\" -- apparently the birth of a child. Turner also left the court through the Lakers' tunnel with 15.7 seconds left after getting hit in the face while fighting with Randle for a rebound. ... Thomas repeatedly gestured at courtside fan Floyd Mayweather Jr. after baskets. The point guard and the boxer are friends.\nLakers: Brandon Bass didn't play against his former Boston teammates. ... Fans near courtside included UFC President Dana White, Casey Affleck, David Beckham, Robbie Keane, Steven Gerrard and Yasiel Puig.\nUP NEXT\nCeltics: Host Pelicans on Wednesday.\nLakers: At Clippers on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994238.0584671
}