{
  "game_id": "0022300917",
  "espn_id": "401585545",
  "date": "Mar 09, 2024",
  "matchup": "CHI @ LAC",
  "headline": "Clippers rally in fourth quarter to extend winning streak to 3 with 112-102 victory over Bulls",
  "body": "LOS ANGELES -- — Paul George scored 22 points, Kawhi Leonard added 19 and the Los Angeles Clippers rallied for their third straight victory, 112-102 over the Chicago Bulls on Saturday.\n\n\r\n              James Harden had his second triple-double of the season with 14 points, 11 rebounds and 10 assists. It was the 76th triple-double of his 15-year career, eighth all-time and fourth among active players.\n\n\r\n              “We talked about at halftime just what to look for just in terms of their coverages and what’s going to be available. And I thought we did a good job of responding,” said associate head coach Dan Craig.\n\n\r\n              Norman Powell came off the bench and scored 18 points, including a pair of 3-pointers early in the fourth quarter as the Clippers scored 11 straight points to open the period after trailing 85-83 after three.\n\n\r\n              “I thought we were getting downhill, with our attacks. As much as they hugged the paint, I thought we found ways to get crafty and get downhill,” George said. “I thought we played defense. I thought that was the difference between the two halves. We played defense and brought some physicality.”\n\n\r\n              Tyronn Lue coached the game despite feeling ill. He did not participate in pregame and postgame interviews.\n\n\r\n              The Bulls made only five of their 18 shots in the fourth quarter and missed eight of nine from beyond the arc.\n\n\r\n              Ivica Zubac had 10 of his 16 points in the third quarter as Los Angeles came back from a 16-point deficit early in the period. \n\n\r\n              “Every game we’re going to need someone different,” Harden said about the contributions of Zubac and Powell. “I thought it was everyone who contributed.”\n\n\r\n              The Clippers have won four of six. At 41-21, they remain locked into fourth place in the Western Conference.\n\n\r\n              Los Angeles began a stretch of three games in four days, including two straight afternoon games, a task made more difficult with daylight saving time occurring this weekend. \n\n\r\n              DeMar DeRozan had 24 points and 10 assists, but the Bulls had their three-game winning streak snapped. Nikola Vucevic added 22 points and 11 rebounds.\n\n\r\n              Chicago (31-33) is ninth in the Eastern Conference and trails Miami by 4 1/2 games for sixth and not having to take part in the play-in tournament.\n\n\r\n              Vucevic had 14 points and 10 rebounds in the first half as the Bulls built a 57-46 lead.\n\n\r\n              Chicago extended its advantage to 14 on Ayo Dosunmu's 3-pointer 46 seconds into the third quarter. The Clippers then countered with a 23-9 run to tie it at 69-all midway through the quarter.\n\n\r\n              “I thought we started the first half well. We moved the ball and made some shots. The turnovers and our inability to make enough shots, kind of impacted the third quarter,” Bulls coach Billy Donovan said.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host the Dallas Mavericks on Monday.\n\n\r\n              Clippers: Host the Milwaukee Bucks on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995872.6456058
}