{
  "game_id": "0022100850",
  "espn_id": "401360669",
  "date": "Feb 12, 2022",
  "matchup": "TOR vs. DEN",
  "headline": "Nuggets beat Raptors 110-109, end Toronto's streak at eight",
  "body": "TORONTO -- — Rookie guard Bones Hyland made a tiebreaking 3-pointer with 2:16 to play, Nikola Jokic added a pivotal late block, and the Denver Nuggets beat Toronto 110-109 Saturday, ending the Raptors’ winning streak at eight.\n\n\r\n              “We fought, we competed, and we found a way,” Nuggets coach Michael Malone said. “This was a really big win. They had won more games than anybody lately. “\n\n\r\n              Jokic had 28 points and 15 rebounds, Jeff Green scored 19 points and Aaron Gordon had 13 as the Nuggets won for the third time in four games.\n\n\r\n              Hyland scored 11 points and Will Barton had 10.\n\n\r\n              Pascal Siakam scored a season-high 35 points and had 10 rebounds, but the Raptors lost for the first time since Jan. 26 at Chicago. Fred VanVleet scored 25 points, Scottie Barnes had 17 and Gary Trent Jr. 11.\n\n\r\n              The Raptors’ winning streak was the longest active run in the NBA, and was Toronto’s longest since a franchise-record, 15-game run from Jan. 15 to Feb. 10, 2020.\n\n\r\n              “We’ve been playing some good basketball,” VanVleet said. “A couple more possessions tonight, maybe it would have went our way.”\n\n\r\n              Jokic shot 10 for 16 and went 8 for 10 at the free throw line. He also had six assists.\n\n\r\n              “He definitely had his way in there in the paint,” VanVleet said. “He’s a heck of a player.”\n\n\r\n              Barnes scored to knot it at 103-all with 2:33 left, but the Nuggets scored seven of the next 10 points, leading 110-106 after Barton’s basket with 28 seconds left.\n\n\r\n              Hyland’s go-ahead 3 was his only shot attempt of the fourth quarter.\n\n\r\n              “He’s not scared of the moment,” Malone said. “He’s a tough kid.”\n\n\r\n              Jokic also had praise for the rookie’s performance.\n\n\r\n              “Lately I’m really confident in him because he’s making the right play,” Jokic said. “He’s making the shots and he’s taking good shots. I’m very confident in him.”\n\n\r\n              VanVleet cut it to 110-109 with a 3 with 22 seconds remaining. After a Denver timeout, Jokic was fouled but missed both free throws, giving Toronto possession with 12.2 seconds to play.\n\n\r\n              VanVleet missed a 3, and Jokic preserved the win with a huge block on OG Anunoby’s follow-up shot attempt.\n\n\r\n              “That’s another game-sealing block by Nikola Jokic,” Malone said. “Incredible play to block OG Anunoby’s offensive rebound putback.”\n\n\r\n              Hyland called Jokic’s block “the biggest play of the game.”\n\n\r\n              Raptors coach Nick Nurse was left feeling frustrated after his team came up short.\n\n\r\n              “Geez, we got a great look, and OG battled and got a heck of a chance at a putback there as well,” Nurse said.\n\n\r\n              VanVleet said he didn’t make a clean catch on Siakam’s pass before the missed 3.\n\n\r\n              “He made a great pass, I just didn’t catch it as well as I want to,” VanVleet said.\n\n\r\n              Jokic scored 18 points in the first quarter as Denver led 31-25. Siakam replied with 13 in the second, four of them during a 13-0 Toronto run, as the Raptors led 57-56 at halftime.\n\n\r\n              Siakam scored nine points in the third and VanVleet had eight, including a tiebreaking 3-pointer with 27 seconds left, as Toronto took an 86-83 lead to the fourth.\n\n\r\n              TIRE CHANGE\n\n\r\n              Jokic said he changed footwear at halftime because of “a flat tire,” his description of a burst air bubble in one of his shoes.\n\n\r\n              BESTED ON THE BOARDS\n\n\r\n              Denver outrebounded Toronto 50-35 as the Nuggets improved to 21-8 when they have more rebounds than their opponent.\n\n\r\n              “That’s one number that jumps out,” Malone said. “When you can outrebound a team 50 to 35, that usually bodes well for you.”\n\n\r\n              FANS RETURNING\n\n\r\n              The Raptors played before a sparse crowd of around 300 fans for the fourth straight game. By the time of their next home game, March 1 against Brooklyn, public health restrictions in Ontario are expected to allow 50 percent capacity at sporting events. A further increase in capacity could come before the end of March.\n\n\r\n              TALENT SCOUT\n\n\r\n              Anunoby played for new teammate Thad Young’s AAU team when he was 16 years old.\n\n\r\n              “The first time I saw him I was like, ‘This kid is going to be a pro,’” Young said.\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: F Zeke Nnaji (right hamstring) was not available. … G Monte Morris (concussion protocol) missed his second straight game. … Made 18 turnovers, leading to 22 points for Toronto.\n\n\r\n              Raptors: Siakam had seven assists. … VanVleet returned after sitting out Thursday’s win at Houston because of a sore left groin. … Young was active but did not play. Toronto acquired Young from San Antonio on Thursday.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host Orlando on Monday night.\n\n\r\n              Raptors: At New Orleans on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764992727.817982
}