{
  "game_id": "0022000610",
  "espn_id": "401307395",
  "date": "Mar 16, 2021",
  "matchup": "MIA vs. CLE",
  "headline": "Butler scores 28, Heat stay hot with 113-98 win over Cavs",
  "body": "MIAMI -- — The Miami Heat got another win, and for a change it came relatively easily.\n\n\r\n                    Jimmy Butler had 28 points and 12 rebounds, Bam Adebayo returned from a knee issue and finished with 14 points, nine rebounds and six assists, and the Heat eased past the Cleveland Cavaliers 113-98 on Tuesday night.\n\n\r\n                    Kelly Olynyk scored 17 points, Tyler Herro had 15 and Duncan Robinson added 14 for Miami, which won for the 11th time in its last 12 games. But this win was unlike most others for the Heat this season, in that it was only the third in which Miami held a double-digit lead for the entire fourth quarter.\n\n\r\n                    “It was a little bit up and down, our game,\" Heat coach Erik Spoelstra said. “There was some sloppiness to it, some miscues defensively. But overall, we made enough plays to come out with the win.\"\n\n\r\n                    Collin Sexton scored 21 for Cleveland, which got 16 points and eight rebounds from JaVale McGee in 21 minutes on 8-for-10 shooting. It’s been an up-and-down, mostly down, time of late for the Cavaliers — who lost 10 consecutive games, then won four in a row, and have gone 0-4 since.\n\n\r\n                    “We need to continue to improve as a team, but the baseline is there,” Cleveland coach J.B. Bickerstaff said. “We are together. We are willing to compete. We take bumps and adversity together and we continue to fight.”\n\n\r\n                    Larry Nance Jr. scored 14, Darius Garland had 11 and Isaac Okoro added 10 for the Cavaliers, who were held below 100 points for the NBA-leading 17th time this season. The Cavs were just 10 for 35 from 3-point range, 2 for 18 in the first half.\n\n\r\n                    “You can play really good defense, you can find the extra man, you can do all the stuff you're supposed to do,\" Nance said. “If we're getting good looks and not making them, that's an issue in itself. We're generating solid looks. Just got to start knocking them down, really.\"\n\n\r\n                    Adebayo hadn’t played since March 2, missing four games with left knee tendinitis. He was 6 for 14 from the field, and his three-point play off a pass from Butler with 1:54 left gave Miami a 108-93 lead — erasing any remaining doubt.\n\n\r\n                    Adebayo said he didn't feel limited in his return game.\n\n\r\n                    “It was good to be back,\" Adebayo said. “Watching your teammates win, I wanted to be part of that.\"\n\n\r\n                    Kendrick Nunn added 10 for the Heat. Miami’s other wins where the lead was double digits for the entirety of the fourth quarter were Jan. 4 against Oklahoma City and Feb. 5 against Washington.\n\n\r\n                    TIP-INS\n\n\r\n                    Cavaliers: Cleveland called its first timeout 53 seconds into the game, trailing 5-0. The Cavs scored the next nine out of that break and briefly kept the lead, then trailed for the game’s final 39:56. ... The Cavaliers are 1-9 in their last 10 games against Miami.\n\n\r\n                    Heat: Avery Bradley (calf) is still out and missed his 19th consecutive game. ... Julia Dale, who dazzled crowds as a little girl when she was the good-luck charm anthem singer from Miami’s past playoff runs and now is a college student, returned for Tuesday’s anthem. \n\n\r\n                    LOVE OUT\n\n\r\n                    Cleveland forward Kevin Love, who played 10 minutes in New Orleans on Friday and left Sunday’s game at Atlanta after just 1:41, was sidelined again by right calf soreness. “Trying to stay positive with him,” Bickerstaff said. Love has appeared in only four games this season.\n\n\r\n                    HEAT TURNAROUND\n\n\r\n                    Miami started the season 11-17 and has gone 11-1 since, though Spoelstra insists the turnaround was happening before this 12-game stretch. “We saw the appropriate steps being made long before it started to change in the record,” Spoelstra said.\n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: Host Boston on Wednesday.\n\n\r\n                    Heat: Visit Memphis on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996784.428285
}