{
  "game_id": "0022300961",
  "espn_id": "401585589",
  "date": "Mar 15, 2024",
  "matchup": "CHA vs. PHX",
  "headline": "Booker scores 21, Suns use balanced scoring and hold off 4th quarter rally to beat Hornets 107-96",
  "body": "CHARLOTTE, N.C. -- — Devin Booker led a balanced Phoenix attack with 21 points and 11 assists as the Suns beat the Charlotte Hornets 107-96 on Friday night for their fourth win in six games.\n\n\r\n              Grayson Allen and Bradley Beal each scored 15 points, and Jusuf Nurkic chipped in with 13 points and 21 rebounds for the Suns (39-28), who bounced back from a lopsided 127-112 loss to the NBA-best Boston Celtics on Thursday night.\n\n\r\n              “That's the name of the game for us,” said Kevin Durant, had 13 points and was one of six Suns in double figures. “There are going to be nights where everybody has to contribute scoring the ball and tonight was one of those nights.”\n\n\r\n              Vasa Micic followed up a career-high 25-point effort on Wednesday night against the Memphis Grizzlies with 21 points to lead Charlotte. Miles Bridges added 17 points and 10 rebounds for the Hornets.\n\n\r\n              The Suns entered the game in seventh place in the crowded Western Conference standings and battling to avoid having to play their way into the playoffs via the play-in tournament.\n\n\r\n              Only two games separated fifth-place New Orleans and ninth-place Dallas entering the Friday night's games.\n\n\r\n              Phoenix led by 25 points entering the fourth quarter, but the Hornets quickly cut the lead to 10 when Brandon Miller nudged Durant out of the way with his shoulder, sending the 2014 league MVP stumbling backward, and knocked down a 3-pointer with six minutes remaining.\n\n\r\n              But Durant responded with a pull-up baseline jumper and Nurkic grabbed an offensive rebound and threw down a two-handed dunk to push the lead to 16 points with two minutes left to start sending fans to the exits.\n\n\r\n              Miller surpassed 1,000 career points in his 60th career game, the third-fastest Hornets rookie to reach that mark behind Alonzo Mourning (53 games) and Larry Johnson (55 games).\n\n\r\n              Durant said he has been impressed with what he has seen from Miller, the No. 2 overall pick, and how he's adjusting to the pro game.\n\n\r\n              “Usually this is around the time of year that rookies start to understand the game a little bit more,” Durant said. “Their coach is putting him in best position to just learn and get better. That is always the best way — throw guys out in the fire and let them play games and get better.”\n\n\r\n              The Suns overcame a 13-0 Hornets run in the first quarter to take a 54-45 lead into the break, holding the Hornets to 2-of-22 shooting from beyond the arc.\n\n\r\n              “When you miss three or four in a row like that, sometimes you’ve just got to play with more force, drive the ball harder and try to get something going more to the basket,” Hornets coach Steve Clifford said. \"Even in the second half, we just shot the ball really poorly.”\n\n\r\n              Suns coach Frank Vogel again touted Durant's defense, saying he will be disappointed if he's not selected to the NBA All-Defensive team.\n\n\r\n              It is one honor that has eluded Durant since coming into the league in 2007.\n\n\r\n              “He's one of the best in the league in iso defense and on-ball defense,” Vogel said. “He's really long and physical. He doesn't get enough credit for that side of the ball. ... He guards the other team's best perimeter player pretty much every night. He's guarded 5s and point guards and pretty much done it all.”\n\n\r\n              UP NEXT\n\n\r\n              Suns: At Milwaukee on Sunday.\n\n\r\n              Hornets: Open four-game trip at Philadelphia on Saturday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995944.8600268
}