{
  "game_id": "0021600697",
  "espn_id": "400900118",
  "date": "Jan 27, 2017",
  "matchup": "ORL @ BOS",
  "headline": "Thomas scores 21 as Celtics rout Magic 128-98",
  "body": "BOSTON -- Three quarters was plenty of time for Isaiah Thomas to extend his streak of scoring at least 20 points.\nThomas made it 30 games in a row with 21 points, then got to watch the entire fourth quarter from the bench as the Boston Celtics routed the Orlando Magic 128-98 on Friday night.\n\"All we really care about is the win, but it was great to get our first blowout of the year and be able to rest in the fourth quarter,\" Thomas said. \"The whole team played a great game tonight.\"\nRookie Jaylen Brown added a career-high 20 points, Jae Crowder scored 19 and Kelly Olynyk made all seven shots he attempted, finishing with 16 points.\nIt was the most points the Celtics have scored this season, five better than Boston's total in a 127-123 overtime loss to Portland on Jan. 21. The Celtics' previous high score in regulation came in a 128-122 loss to the defending champion Cleveland Cavaliers on Nov. 3.\nThe Celtics closed the first quarter on a 15-0 run and continued pulling away from there to their widest margin this season.\n\"I thought our shooting and the way we shared the ball were really good,\" coach Brad Stevens said. \"The shooting will come and go, but hopefully we can keep sharing the ball like that. That was good.\"\nThe Celtics outscored Orlando 36-17 in the third quarter and finished the game with 39 assists, 11 coming from Marcus Smart and eight from Thomas. Boston also dominated inside, outscoring Orlando 54-34 in the paint and outrebounded the Magic 47-37.\n\"It's good to get one of those wins,\" Thomas said. \"We haven't had one this season, so it was good for our confidence. We played the right way tonight and we took care of business.\"\nNikola Vucevic and Damjan Rudez finished with 14 points apiece to lead the Magic, who trailed by as much as 40 and lost their third straight and fell to 3-11 in January.\n\"I think we're frustrated,\" coach Frank Vogel said \"I think we're undermanned and we have guys trying to perform roles outside their realm. It doesn't look pretty right now.\"\nIt certainly didn't Friday night. Boston topped 100 points before the end of the third period and got a bonus at the end when Terry Rozier went to the line with the clock reset to 1 second after a video review. Rozier made both foul shots and the Celtics led 104-65 entering the fourth quarter.\nBoston held a 68-48 halftime lead after shooting 61 percent (28 of 46) in the first half. The Celtics outrebounded the Magic 25-16 in the first two periods and outscored Orlando 38-28 in the paint.\nThe second half was much like the first.\nElfrid Payton converted a three-point play for the Magic that cut the margin to 79-59 with 7:07 left in the third. Thomas answered with a 20-foot jumper that got the Celtics going on a 22-5 run. Thomas added a 3-pointer and set up Jonas Jerebko for a layup, followed by another miss by the Magic and fastbreak the other way for a layup by Smart.\nCrowder hit a 3-pointer to make it 93-62, then stole the ball from Bismack Biyombo and Thomas converted the turnover into another 3-pointer.\nKING OF NEW ENGLAND\nWith the outcome all but decided, Boston fans got a running start on the Super Bowl with chants of \"Brady!\" throughout fourth quarter after a fan appeared on the scoreboard monitor wearing a No. 12 Patriots jersey.\nMAGIC MELTDOWN\nThe Celtics' shooting was above 60 percent until dropping off slightly in the fourth quarter. Vogel credited Boston for hitting the shots, but felt his own players contributed to the Celtics' shooting success.\n\"We're not playing like good defensive players and I'm not tying these guys together like a good defensive coach. It's a collective failure right now on that end that we have to get right,\" he said.\nROAD REST\nThe Celtics had a late night ahead with a flight to Milwaukee for a game Saturday, so it was an easy choice for Stevens to rest his starters and let Boston's reserves finish off the rout.\n\"We've got a lot of games this week, so hopefully that's a good thing,\" Stevens said.\nTIP-INS\nMagic: Payton had 12 points and had seven assists, and Aaron Gordon scored 13 points for the Magic. ... G D.J. Augustin returned to the lineup after missing Tuesday's loss to Chicago with a sore right foot. ... G Evan Fournier (sore right foot) participated in some of the morning shootaround, but did not dress and missed his seventh straight game.\nCeltics: Boston's 68 points in the first half was the most the Celtics have scored in the first two periods this season, topping 64 points in the first half of the opener at Brooklyn. ... Thomas was selected as a reserve for the Eastern Conference All-Star team for the second straight year. ... C Al Horford (groin) sat out Friday, but was probable to play Saturday night at Milwaukee, Stevens said. ... G Avery Bradley (sore right Achilles' tendon) missed his fifth straight game.\nUP NEXT\nMagic: Visit Toronto on Sunday in the second of a three-game road trip.\nCeltics: Visit Milwaukee on Saturday, then are back at home for the next four.",
  "source": "espn_api",
  "crawled_at": 1764995845.018572
}