{
  "game_id": "0022000512",
  "espn_id": "401267672",
  "date": "Feb 26, 2021",
  "matchup": "LAL vs. POR",
  "headline": "Schröder returns, Lakers beat Blazers 102-93 to snap skid",
  "body": "LOS ANGELES -- — LeBron James had 28 points, Dennis Schröder added 22 in his return to the Lakers' lineup, and Los Angeles snapped its four-game losing streak with a 102-93 victory over the Portland Trail Blazers on Friday night.\n\n\r\n                    Montrezl Harrell had 17 points, while James added 11 rebounds, seven assists, four steals and three blocked shots as the defending NBA champions avoided their longest losing streak since March 2019.\n\n\r\n                    The fresh-legged Schröder was outstanding after a four-game absence under the NBA's health and safety protocols, scoring 13 points in the second half and leading the Lakers' decisive surge on both ends of the court.\n\n\r\n                    “His energy alone gives us a spark,” James said of Schröder. “His competitive nature gives us a spark. To have him back in our lineup just means so much to our team. It was big-time.”\n\n\r\n                    Los Angeles pushed ahead in the third quarter and hung on comfortably for only its second win since losing All-Star selection Anthony Davis to a calf injury 12 days ago.\n\n\r\n                    Damian Lillard scored 24 of his 35 points in the first half for the Blazers, who lost their fourth straight. Portland committed 16 turnovers while losing to the Lakers at Staples Center for the first time since November 2018.\n\n\r\n                    “Tonight was about our offense,” Portland coach Terry Stotts said. “There’s always room to improve defensively, but the Lakers did a really good job of being aggressive on us, creating turnovers in the third quarter, and we weren’t able to capitalize on some of the opportunities that we did have.”\n\n\r\n                    The Lakers broke open a close game with a 14-4 run led by Schröder late in the third quarter. The German point guard also teamed with Alex Caruso to play solid defense on the largely unstoppable Lillard, who got just one shot while playing the entire third quarter.\n\n\r\n                    “In the first half, we pretty much had our way,” Lillard said. “I was able to get in the paint, play pretty free. In the second half, they just loaded up. They were blitzing, and I didn’t really have any space.”\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: CJ McCollum missed his 19th straight game with a broken foot. ... Robert Covington had four points on 1-of-8 shooting in 40 minutes.\n\n\r\n                    Lakers: Damian Jones didn't play after driving from Phoenix to Los Angeles earlier Friday when the Lakers signed him to a 10-day contract. ... They opened a three-game homestand, and they won't play outside California again until March 21.\n\n\r\n                    DENNIS' DETOUR\n\n\r\n                    Schröder was frustrated with the NBA's testing procedures after returning from his enforced absence. He said he never tested positive for COVID-19, but was only possibly exposed to someone at his home whose tests later came back negative.\n\n\r\n                    “The NBA, I think, has got to do better,” he said.\n\n\r\n                    Schröder said he had to spend several days in the guest house on his property playing video games and working out. He also texted his thoughts to his teammates and coaches while watching the Lakers' losses without him.\n\n\r\n                    “I missed my teammates, coaches, just the whole routine we have, going into the facility,” Schröder said. “We don't want that to happen again.”\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Host Hornets on Monday.\n\n\r\n                    Lakers: Host Warriors on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997305.7953951
}