{
  "game_id": "0022400187",
  "espn_id": "401704753",
  "date": "Nov 08, 2024",
  "matchup": "BKN @ BOS",
  "headline": "Tatum scores 33, Pritchard has six points in OT to lead Celtics to 108-104 win over Nets",
  "body": "BOSTON -- — Jayson Tatum had 33 points and nine rebounds, Payton Pritchard scored six points in overtime and the Boston Celtics beat the Brooklyn Nets 108-104 on Friday night. \n\n\r\n              Pritchard finished with 20 points. Jrue Holiday added 17 points and five assists, and Derrick White scored 14 and had six assists for the Celtics (8-2).\n\n\r\n              Cam Thomas reached 30 points for the fourth time this season, finishing with 31 to lead the Nets (4-5). Dennis Schroder added 20 points.\n\n\r\n              Cameron Johnson was fouled by Tatum after missing a wide open 3-point attempt in the closing seconds of regulation but grabbed his own miss. He calmly sank two free throws, tying it at 94 with 7.6 seconds to play.\n\n\r\n              Tatum front-rimmed a 3 as time expired, sending it to OT.\n\n\r\n              Boston guard Jaylen Brown missed his fourth straight game with a strained left hip flexor, center Luke Kornet was also out because of right hamstring tightness.\n\n\r\n              Takeaways\r\n              Nets: Coach Jordi Fernandez talked before the game that it was going to be “exciting because they like to run, too,” so they slowed Boston by picking up defensively deep in the backcourt most of the game. \n\n\r\n              Celtics: Coming off their first home loss of the season Wednesday night against Golden State, the Celtics saw another team that limited the 3-point line and delated their offensive sets. The fast break was Boston's remedy, as the Celtics outscored the Nets 20-10 in transition.\n\n\r\n              Key moment\r\n              Leading 105-102, Boston forced the Nets into a shot-clock violation before Pritchard was fouled on the other end and hit two free throws.\n\n\r\n              Key stat\r\n              The Celtics were held below its league-leading average of 19 3-pointers made per game. They ended up shooting 14 for 53 from deep, but the Nets only made 10 3s. \n\n\r\n              Up next\r\n              The Nets are at the Cavaliers on Saturday night, and Boston is at Milwaukee on Sunday.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998005.172605
}