{
  "game_id": "0021600394",
  "espn_id": "400899836",
  "date": "Dec 16, 2016",
  "matchup": "MEM vs. SAC",
  "headline": "Cousins, Koufos lead Kings to 96-92 win over Grizzlies",
  "body": "MEMPHIS, Tenn. --  Sacramento coach Dave Joerger returned to Memphis and left town with a win against his former team.\n\nDeMarcus Cousins scored 22 points, Kosta Koufos had 16 points and 13 rebounds, and the Sacramento Kings weathered a late Memphis rally for a 96-92 victory over the Grizzlies on Friday night.\n\nJoerger, who started as an assistant with the Grizzlies, was the head coach for three seasons. It was his first return to Memphis since he was fired after last season, ending nine years with the organization.\n\n\"It was not an enjoyable game to coach from that aspect,\" Joerger said of the return. \"But now, I'm here (with Sacramanto) and these are my guys now.\"\n\nIt wasn't until the final seconds that Joerger could fully enjoy the return.\n\nThe Kings led by 11 with 4 minutes left, but Tony Allen, who had 16 points, scored two baskets and Troy Daniels converted a pair of 3-pointers, the last one with 55 seconds left to trim Sacramento's lead to 95-92.\n\nThe Grizzlies had a chance to tie, but Mike Conley -- returning after missing nine games with a back injury -- missed a leaning 3-point attempt with 3.9 seconds left.\n\nMemphis coach David Fizdale was blunt about the Grizzlies inability to outhustle the Kings to loose balls.\n\n\"Our effort was pathetic,\" Fizdale said.\n\nGarrett Temple added 17 points and Darren Collison had 11 for Sacramento. Marc Gasol led Memphis with 20 points. Daniels finished with 13.\n\nThe Kings, who led 52-42 at halftime, benefited from a poor shooting night from the Grizzlies. Every time Memphis got the deficit under double digits in the fourth, the Kings seemed to have an answer including the final push.\n\n\"We just grinded it out,\" Koufos said. \"They are an experienced team. They are going to fight the whole game.\n\n\"For us, we've got to just try and execute as much as possible and we did that.\"\n\nTIP-INS\n\nKings: G Garrett Temple started his second game of the season. ... Joerger got a mixed reception when he was introduced before the game. ... Sacramento held an opponent under 100 points for the fourth time in the last eight games.\n\nGrizzlies: Conley missed nine games after he was injured in the Nov. 28 in home game against the Charlotte Hornets. Memphis went 7-2 in his absence. ... With a free throw in the third quarter, Conley passed Pau Gasol to become the all-time leading scorer in franchise history.\n\nSHALLOW SLOGAN\n\nMemphis has a reputation for its toughness, but didn't live up to it Friday. \"They outworked us,\" guard Tony Allen said of the Kings. \"For a team that says they `grit and grind,' I don't think that should happen on our home court.\"\n\nHOLIDAY RETURNS\n\nConley wasn't the only return for Friday night's game. There are plenty of Kings who have spent time in Memphis beyond Joerger and several members of his coaching staff. Forward Matt Barnes was with the Grizzlies last season, while Koufos played two seasons in Memphis. Forward Skal Labissiere lived in Memphis before playing collegiately at Kentucky. Rudy Gay, who started his NBA career with the Grizzlies, didn't play due to a right hip flexor.\n\nSAME DAVE\n\nAsked if Joerger was different before the game, Cousins said: \"Honestly, no. He was the same guy coming in. Same message. Maybe he (thought about the return) deep down inside, but he didn't show it.\"\n\nSAGER STRONG\n\nLike other teams in the league, the Grizzlies held a moment of silence before the game for sideline reporter Craig Sager, who died Thursday after his fight with leukemia. Fizdale wore a colorful Sager-like T-Shirt under his suit coat.\n\nUP NEXT\n\nKings: Close out their three-game road trip on Sunday with a stop in Dallas to face the Mavericks\n\nGrizzlies: Play the Utah Jazz on Sunday in the third game of a four-game homestand.",
  "source": "espn_api",
  "crawled_at": 1764995617.130341
}