{
  "game_id": "0022300719",
  "espn_id": "401585347",
  "date": "Feb 06, 2024",
  "matchup": "HOU @ IND",
  "headline": "Pascal Siakam scores 29 and fuels third-quarter charge to lead Pacers past Rockets 132-129",
  "body": "INDIANAPOLIS -- — Pascal Siakam relied on his scoring punch, T.J. McConnell added the energy and the Indiana Pacers defense turned up the pressure in the second half Tuesday.\n\n\r\n              It was exactly what they needed.\n\n\r\n              Siakam finished with 29 points and teamed up with McConnell to score 17 during a third-quarter rally that propelled the Pacers past the Houston Rockets 132-129.\n\n\r\n              “The third quarter, we just kind of sat down, get down into the bodies and pressured more,” Siakam said. “That's how we've got to be, that's how we've got to play defense to continue to evolve, which I think is an area that can make us a special team.”\n\n\r\n              The defense has been Indiana's biggest weakness most of this season. But with the addition of Siakam through a mid-January trade with Toronto and the savviness of McConnell, things could be changing.\n\n\r\n              McConnell had 17 points and four assists as the Pacers allowed 54 second-half points just two days after holding their first opponent to less than 100.\n\n\r\n              The result: Indiana won its second straight overall and for the ninth time in the series.\n\n\r\n              But Houston sure made it tough.\n\n\r\n              Jalen Green had 30 points in the Rockets' second straight loss while Dillon Brooks added 23. Rookie Amen Thompson finished with 13 points, 13 rebounds and six assists as Houston played without starting guard Fred VanVleet, who coach Ime Udoka said isn't likely to return until closer to the All-Star break.\n\n\r\n              And yet, Houston still seemed to be in control when it extended a 75-68 halftime lead to 85-75 early in the third. Then, over the final 9:53 of the quarter, everything changed.\n\n\r\n              “We defended well for two quarters, second and fourth,” Udoka said. “We didn't feel like we had to take any contested shots tonight, just continuing to penetrate and kick, make easy reads. We didn't really duplicate it as well in the second half.”\n\n\r\n              The difference showed. While Indiana's defense allowed just 14 points during that long third-quarter stretch, Siakam and McConnell fueled the comeback. Indiana used that closing 31-17 flurry to take a 106-99 lead.\n\n\r\n              Houston never fully recovered as Indiana quickly extended the margin to 14 early in the fourth and the Rockets couldn't get closer than seven until Alperen Sengun's tip-in made it 129-124 with 1:13 to go.\n\n\r\n              Green's 3 with 46 seconds to play cut the deficit to 130-127. \n\n\r\n              But two-time All-Star Tyrese Haliburton answered with a layup to seal the victory despite continuing to play on a minutes restriction as he continues to rehab from a left hamstring injury. He had 18 points, seven assists and one giant smile.\n\n\r\n              “There's a little bit of service after the game, but in the game, I feel good after a little while so that's a positive,” he said. “To be able to start games, finish games and play close to my traditional minutes, I'm just happy to be more healthy.”\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Continue their four-game road trip Friday night at Toronto.\n\n\r\n              Pacers: Host Golden State on Thursday night.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995598.528692
}