{
  "game_id": "0022000677",
  "espn_id": "401307466",
  "date": "Mar 24, 2021",
  "matchup": "ATL @ SAC",
  "headline": "Fox, Haliburton lift Kings past Hawks 110-108",
  "body": "SACRAMENTO, Calif. -- — De’Aaron Fox scored 37 points, Tyrese Haliburton made a pair of free throws with 36.6 seconds remaining and the Sacramento Kings beat the Atlanta Hawks 110-108 on Wednesday night.\n\n\r\n                    Haliburton finished with 17 points and seven assists, Buddy Hield scored 14 and Richaun Holmes had 16 points and eight rebounds.\n\n\r\n                    Clint Capella had 25 points and 17 rebounds for the Hawks, who have lost back-to-back games after winning their first eight under interim coach Nate McMillan.\n\n\r\n                    Fox shot 13 of 20 and rattled Atlanta’s defense all night. He had 15 points in the first quarter, scored against a trio of Atlanta defenders inside the key with an up-and-under move in the third, then later added a turnaround 19-footer as the shot clock expired.\n\n\r\n                    “I was just playing, seeing how they were guarding pick and rolls, how soft they were guarding the ball,” Fox said. “For me, it’s just continuing to try to grow as a player and become more efficient in what I do … and help my team win.”\n\n\r\n                    It’s the 10th 30-point game for Fox this season.\n\n\r\n                    “It feels like the game is really slowing down for him, which is similar to that pre-injury run we were on with him,” Kings coach Luke Walton said. “We’re clearly a better team when he’s playing like that. He’s really finding that comfort level out there and getting to his spots at his pace. \n\n\r\n                    \"It’s the shot that he wants to take and that’s what you love to see out of your offensive guys.”\n\n\r\n                    McMillan blamed Atlanta’s inconsistent offense and lack of defense.\n\n\r\n                    “I thought we really settled on the perimeter, and in that second half we didn’t continue to keep the pressure on their defense,” McMillan said. “Defensively, we never really established our defense where we were getting stops. Fox had his way pretty much most of the night.”\n\n\r\n                    As good as Fox was, Haliburton made the difference down the stretch.\n\n\r\n                    The 12th overall pick in the draft, Haliburton had a four-point play with 4:58 remaining, then added a 10-foot turnaround jumper. After Young’s 3-pointer tied the score at 108, Haliburton was fouled driving toward the basket and made both free throws.\n\n\r\n                    “Tyrese, all season long, he’s got that clutch gene,” Walton said. “You get in those final couple minutes of a game and if he gets a shot you feel pretty comfortable he’s going to make it. He did it again tonight.”\n\n\r\n                    Young and Hield exchanged misses before Danilo Gallinari’s shot at the buzzer hit the side of the rim.\n\n\r\n                    Before Gallinari’s miss, Fox ran up behind Young and poked the ball out of bounds.\n\n\r\n                    “We know what we can do offensively, but for us we know we have to finish games,” Fox said. “Defensively, there’s times when we’re getting nine or 10 stops in a row. For us, it’s just continuing to build on that. You try to sustain that and make that your consistent play.”\n\n\r\n                    Fox made eight of his first 11 shots to keep Sacramento in front for most of the first half before Atlanta closed the second quarter on a 10-3 run. John Collins’ alley-oop dunk on a pass from Young capped the run and tied it at 57.\n\n\r\n                    TIP-INS\n\n\r\n                    Hawks: Bogdan Bogdanovic scored 20 points in his first game back at Golden 1 Center. Bogdanovic spent his first three seasons in Sacramento before signing with the Hawks in the offseason. ... Rajon Rondo was held out because of right adductor soreness.\n\n\r\n                    Kings: Marvin Bagley III (broken bone in left hand) sat out a fifth consecutive game. ... Chimezie Metu had seven points in his first action after missing 16 games with a fractured right wrist. ... Cory Joseph played in his 310th consecutive game, the longest active streak in the NBA.\n\n\r\n                    UP NEXT\n\n\r\n                    Hawks: Visit Golden State on Saturday in San Francisco.\n\n\r\n                    Kings: Face the Warriors on Thursday night at Golden 1 Center. Golden State beat Sacramento 137-106 in January. \n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997635.1538298
}