{
  "game_id": "0022100366",
  "espn_id": "401360190",
  "date": "Dec 08, 2021",
  "matchup": "CHA vs. PHI",
  "headline": "Embiid scores 32, 76ers hold off Hornets again 110-106",
  "body": "CHARLOTTE, N.C. -- — Joel Embiid scored 32 points, Seth Curry added 23 points and eight assists and the Philadelphia 76ers beat the Charlotte Hornets for the second time in three nights, 110-106 on Wednesday night.\n\n\r\n              Philadelphia has won 16 straight games vs. Charlotte.\n\n\r\n              Tobias Harris added 18 points in a rematch of a game the 76ers won 127-124 in overtime Monday night on the same court.\n\n\r\n              “It’s tough to beat the same team twice no matter what the situation is,” 76ers coach Doc Rivers said. \"We did that. I thought we just hung in there. I thought there were times where we could’ve pulled away and there was a turnover or a missed defensive assignment here or there. But I will take the win.”\n\n\r\n              Gordon Hayward had a season-high 31 points and seven assists for the Hornets, who played without five rotational players, including last year’s NBA Rookie of the Year LaMelo Ball due to NBA health and safety protocols. \n\n\r\n              Kelly Oubre Jr., who had 35 points in Charlotte’s loss Monday night, finished with 22 points and 10 rebounds but finished just 3 of 12 from beyond the arc and missed a free throw that would have made it a one-possession game with 7 seconds left.\n\n\r\n              The Hornets have lost five of their last six. \n\n\r\n              Philadelphia finished its four-game road trip with a 3-1 record after starting out with a one-point loss at Boston.\n\n\r\n              \"Anytime we can go on the road and get wins, those are always important,\" Harris said. “We did a good job in the fourth quarter executing and getting the shots we wanted and making those looks.”\n\n\r\n              Embiid, who had 43 points and 15 rebounds in the previous matchup, wasn't as dominant with his fadeaway jumper but made 15 of 19 foul shots, which left Hornets coach James Borrego a little perplexed.\n\n\r\n              “I don’t have an answer for that,” Borrego said. “I’ll go back and watch them, but if he is going to shoot 19 free throws a night, it’s going to be tough.”\n\n\r\n              For the second time in three nights, the short-handed Hornets played the 76ers tight in a game that featured 16 lead changes and 12 ties.\n\n\r\n              P.J. Washington banked home a 3-pointer from the top of the key with 3:25 left to give the Hornets a 98-97 lead, igniting the crowd.\n\n\r\n              Danny Green and Embiid answered with 3s to swing the momentum back to Philadelphia. Embiid then added a dunk on a drive down the middle of the lane to extend the lead to seven with 1:53 remaining. The Hornets clawed back to get it to 3m but Harris made two free throws to push the lead to five. The Hornets never got within three again.\n\n\r\n              For the second straight game, Borrego only played eight guys while working with a limited bench due to protocols.\n\n\r\n              “I probably played them too many minutes,\" Borrego said. “I have to watch that and make sure I don’t overrun them.”\n\n\r\n              CURRY'S RECORD\n\n\r\n              Seth Curry is hoping to see his brother Stephen break the NBA's all-time record for career 3-pointers in person.\n\n\r\n              The 76ers host Stephen Curry and the Warriors on Saturday night in Philadelphia. Curry needs 16 3-pointers to break the record. The Warriors were playing the Portland Trail Blazers late Wednesday night before traveling to Philadelphia.\n\n\r\n              “It's pretty inevitable,\" Seth Curry said. “He's getting up 15 a night and shooting it well. He's going to get it one of these days. So hopefully he makes 14 tonight and we hold him to like two or three on Saturday night.”\n\n\r\n              HEATED EXCHANGE\n\n\r\n              The game had a heated moment.\n\n\r\n              Late in the second quarter, Philadelphia’s Andre Drummond and Charlotte’s Miles Bridges exchanged words and had to be separated by teammates before both players were assessed a technical foul.\n\n\r\n              TIP-INS\n\n\r\n              76ers: Tyrese Maxey returned to the starting lineup after sitting out a game with an illness. “I felt OK,\" Maxey said. ”It is still hard to breathe out there.\" ... Scored 23 points off 19 Charlotte turnovers.\n\n\r\n              Hornets: Center Nick Richards rolled his left ankle in the second quarter but was able to return. ... Miles Bridges had 20 points.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Host the Jazz on Thursday night.\n\n\r\n              Hornets: Host the Kings on Friday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993182.954813
}