{
  "game_id": "0022001069",
  "espn_id": "401307883",
  "date": "May 16, 2021",
  "matchup": "MIA @ DET",
  "headline": "Heat rout Pistons 120-107 with several key players out",
  "body": "DETROIT -- — Nemanja Bjelica scored 17 of his 21 points in the first half, and the Miami Heat routed the Detroit Pistons 120-107 on Sunday night despite holding out several key players in a relatively meaningless game.\n\n\r\n                    Precious Achiuwa scored a career-high 23 points and Max Strus added 20 for the Heat.\n\n\r\n                    “I feel great for those young guys to be able to get out there and compete, and also show how much they’ve improved since the beginning of the year,” Heat coach Erik Spoelstra said. “You can see the improvement that they’ve made, and it translates to impacting winning. Even in a game like this, it mattered, and they did it together.”\n\n\r\n                    Miami, locked into the No. 6 seed in the Eastern Conference, played without Bam Adebayo (rest), Trevor Ariza (rest), Jimmy Butler (lower back), Goran Dragic (lower back, right knee), Andre Iguodala (left hip) and Kendrick Nunn (left calf). All of those players except Butler played the previous day in a loss at Milwaukee.\n\n\r\n                    The Heat still had no trouble with Detroit, which also was without several key players. The loss assured that the Pistons would finish alone with the second-worst record in the league. Detroit will now have a draft pick no worse than sixth.\n\n\r\n                    “This is probably one of the most important summers of their basketball-playing careers,” Pistons coach Dwane Casey said. \"It’s got to be a consistent summer, whether it’s basketball, weight training, diet.”\n\n\r\n                    The Pistons were without Sekou Doumbouya (personal reasons), Wayne Ellington (calf), Jerami Grant (right knee), Frank Jackson (right ankle) and Isaiah Stewart (personal reasons).\n\n\r\n                    Saddiq Bey led the Pistons with 22 points, and Josh Jackson added 17.\n\n\r\n                    Miami led 32-13 after the first quarter. The Heat shot 62% from the field for the half and led 69-47.\n\n\r\n                    “We feel good as a team. We feel like we’re in a great spot, we have a great matchup coming up in the first round,” Miami’s Tyler Herro said. “It’s the end of the season and we feel like we’re trending in the right direction.”\n\n\r\n                    Miami takes on Milwaukee in the first round of the playoffs. The Heat eliminated the Bucks last year en route to the NBA Finals.\n\n\r\n                    Detroit finished the season with five straight losses. The Pistons haven't picked in the top six in the draft since they infamously selected Darko Milicic at No. 2 in 2003.\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Miami went just 13 of 20 on free throws, but that was still enough to set a single-season franchise record for free throw percentage. The Heat finished at 79.01%. Their previous record was 78.96% in 1991-92. ... KZ Okpala was ejected for a flagrant foul with 1:50 remaining in the game.\n\n\r\n                    Pistons: Never led in the game and trailed by as many as 28 points.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Begin the postseason at third-seeded Milwaukee.\n\n\r\n                    Pistons: Season over.\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997856.1973782
}