{
  "game_id": "0022301036",
  "espn_id": "401585664",
  "date": "Mar 25, 2024",
  "matchup": "TOR vs. BKN",
  "headline": "Schroder, Watford score 19 apiece, Nets beat Raptors 96-88 to snap 6-game skid",
  "body": "TORONTO -- — Dennis Schroder scored 19 points against his former team, Trendon Watford had 11 of his season-high 19 points in the second quarter and the Brooklyn Nets snapped a six-game losing streak by beating the short-handed Toronto Raptors 96-88 on Monday night.\n\n\r\n              Mikal Bridges scored 13 points and Jalen Wilson added 12 as the Nets outscored Toronto 28-19 in the fourth quarter to help Brooklyn win for the first time since March 10 at Cleveland.\n\n\r\n              “When it got down to crunch time, we just took care of the ball and executed,” Watford said.\n\n\r\n              Brooklyn coach Kevin Ollie said the Nets, who were staying over in Toronto, planned to celebrate with a late meal at an upscale Italian restaurant on Monday night before flying to Washington on Tuesday for Wednesday’s game against the Wizards.\n\n\r\n              “I told these guys it’s hard to win in the NBA,” Ollie said. “We’re going to get a nice team dinner. The wine is going to taste a little bit better.”\n\n\r\n              Gary Trent Jr. scored 18 points and Javon Freeman-Liberty had 15 for Toronto. The Raptors have lost 11 straight and are winless since a home victory over Charlotte on March 3.\n\n\r\n              Among Toronto’s seven absent players was center Jontay Porter. The NBA has opened an investigation into Porter amid gambling allegations, a league spokesman and Raptors head coach Darko Rajakovic confirmed Monday night.\n\n\r\n              Rajakovic said he learned the news about Porter shortly before the game and did not speak to his players about it.\n\n\r\n              “We were focused on basketball, we were focused on the game,” Rajakovic said. “Nobody wants that kind of situation to happen to anybody, to any team. We’re just going to deal with it.”\n\n\r\n              Porter’s locker was empty ahead of Monday’s game, although his nameplate was still in place.\n\n\r\n              Nic Claxton had 16 rebounds for Brooklyn, one shy of his career high. The Nets outrebounded Toronto 50-30, including a 16-8 edge on offensive rebounds.\n\n\r\n              “Nic really attached the backboards and got us some extra possessions, which was huge because we had 20 turnovers,” Ollie said.\n\n\r\n              Guard Cam Thomas, who led the Nets with 19 points in Saturday’s loss to the Knicks, was scratched after experiencing back spasms during the pre-game warm up. Also, forward Cameron Johnson was absent because of a sprained right big toe.\n\n\r\n              Ollie said he didn’t know whether Thomas would be ready to return Wednesday.\n\n\r\n              Nets guard Dennis Smith Jr. was not available because of a sore right hip, while forward Keita Bates-Diop sat because of a sore right shin. \n\n\r\n              For the second straight game, Toronto played without four regular starters, with only Trent available. All-Star Scottie Barnes (left hand) and center Jakob Poeltl (left pinkie) remain injured. RJ Barrett and Immanuel Quickley rejoined the team Monday after being away for personal reasons. The pair watched from the bench Monday, but they remain sidelined for return to competition reconditioning.\n\n\r\n              Earlier Monday, Toronto signed guard Kobi Simmons to a 10-day contract. Simmons scored seven points in 17 minutes.\n\n\r\n              The Raptors had 23 assists Monday, giving them a single-season franchise record of 2,086. Toronto, which has 10 games remaining, had 2,085 assists in 2018-19.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At the Washington Wizards on Wednesday.\n\n\r\n              Raptors: Host the New York Knicks on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996187.551244
}