{
  "game_id": "0022100777",
  "espn_id": "401360596",
  "date": "Feb 02, 2022",
  "matchup": "CLE @ HOU",
  "headline": "Rockets snap home skid with 115-104 win over Cavaliers",
  "body": "HOUSTON -- — Christian Wood and rookie Jalen Green scored 21 points each and the Houston Rockets snapped an 11-game home skid with a 115-104 win over the Cleveland Cavaliers on Wednesday night.\n\n\r\n              It’s the first win by the Rockets in Houston since a 114-104 victory over Brooklyn on Dec. 8 and it snaps a four-game losing streak overall. \n\n\r\n              “It’s been a long streak,\" Wood said. “These fans deserved a win and we were able to give them a good one tonight.\" \n\n\r\n              Coach Stephen Silas said he addressed the home skid during a team meeting Wednesday morning, listing each loss on a white board before stressing the need to end it against the Cavs. \n\n\r\n              “Usually when I do stuff like that they respond,\" he said. “I probably should have done it sooner.\" \n\n\r\n              A dunk by Jarrett Allen followed by a 3-point play by rookie Evan Mobley cut Houston’s lead to 3 with less than three minutes left. But Houston scored the next 10 points to make it 115-102 with just more than a minute to go.\n\n\r\n              Wood scored the first five points in that stretch before Cleveland turnovers on consecutive possessions led to five points by Kevin Porter Jr. \n\n\r\n              “Our composure is something that’s been good for us when we’ve been right there at the end of games,\" Silas said. \n\n\r\n              Mobley had a career-high 29 points with 12 rebounds as the Cavaliers lost for the second time in three games while playing without star Darius Garland, who is out with lower back soreness. \n\n\r\n              “We just didn’t play well,\" coach J.B. Bickerstaff said. “Credit to the Rockets, don’t take anything away from what they did, but we didn’t get the job done at the level that we're capable of tonight.\"\n\n\r\n              This game featured two of the most recent draft’s top picks in Green, who was taken second, and Mobley, the third overall selection. \n\n\r\n              It was the first 20-point game since Jan. 5 for Green, who has been in a shooting slump.\n\n\r\n              “I’m always super proud of Jalen and the things he does on the floor,\" Silas said. “He was aggressive, he was finding his teammates tonight... when he's attacking, when he shoots the open shots he becomes a really, really good player.\" \n\n\r\n              Porter added 16 points with seven assists for Houston and Garrison Mathews had 16 points off the bench. \n\n\r\n              Kevin Love had 21 points with 13 rebounds for the Cavaliers and Cedi Osman scored 13. \n\n\r\n              Mobley had two baskets around a shot by Houston’s Josh Christopher to get the Cavs within 5 with about 8 ½ minutes to go. \n\n\r\n              Houston scored the next four points before another basket by Mobley cut the lead to 100-93 with about 5 ½ minutes remaining. \n\n\r\n              A 6-2 spurt by the Cavaliers, powered by three dunks, got them within 6 midway through the third quarter, but Mathews hit a 3 for the Rockets to push it to 81-72. \n\n\r\n              Cleveland cut the deficit to 6 again later in the third before Houston used an 7-0 run, with the last five points from Wood, to make it 88-75 with three minutes left in the third. \n\n\r\n              Love got going after that, scoring all of Cleveland’s points in an 8-2 run that cut the lead to 90-83 entering the fourth. \n\n\r\n              FREE THROW WOES\n\n\r\n              Bickerstaff was irked that the Cavaliers made just 15 of 27 free throws Wednesday. \n\n\r\n              “You have to make free throws, there’s no if ands or buts... you’ve got to go in there with a disciplined approach,\" he said. \n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Love’s 13 rebounds gave him 4,005 with the Cavaliers, making him the seventh player in team history to reach 4,000. ... Lauri Markkanen missed a fifth straight game with a sprained ankle. ... Allen received a flagrant 1 foul for knocking Mathews down as he shot a 3-pointer in the second quarter. \n\n\r\n              Rockets: Houston had 29 free throw attempts in first half, which is tied for the most in the NBA this season in any half. ... They took just four in the second half to finish 23 of 33. ... The Rockets made 14 of 40 3-pointers. \n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Charlotte Friday night. \n\n\r\n              Rockets: Visit San Antonio Friday night. \n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764993822.141619
}