{
  "game_id": "0021900597",
  "espn_id": "401161239",
  "date": "Jan 13, 2020",
  "matchup": "LAL vs. CLE",
  "headline": "LeBron's 31 put Lakers past Cavs 128-99 for 9th straight win",
  "body": "LOS ANGELES --  Kevin Love and LeBron James hadn't played against each other since before they got together on the Cleveland Cavaliers in 2014 for a memorable four-year partnership.\n\nAfter their first meeting since James moved to the West Coast ended in a blowout win for the Lakers, they got together on court with Tristan Thompson to renew a friendship that's bigger than the game.\n\n\"That's a brotherhood,\" Love said. \"That's a bond that can never be broken. You saw Tristan and myself out there with him. That's something we'll always remember and kind of take to our graves. He's my brother for life, and it is weird playing against him.\"\n\nThese three champions' connection is rock-solid, even after a game that demonstrated why only James is contending for another ring this year.\n\nJames scored 23 of his 31 points in a dominant second half, and Dwight Howard added season highs of 21 points and 15 rebounds in Los Angeles' ninth consecutive victory, 128-99 over the Cavs on Monday night.\n\nThe powerhouse Lakers posted their highest-scoring half in 33 years while scoring 81 in the second half behind James, who added eight assists while passing Isiah Thomas for sole possession of eighth place on the NBA's career list.\n\nJames led Los Angeles to its third straight win without Anthony Davis, who is out with a bruised backside.\n\n\"Defensively, we got stops, and we had great pace,\" James said. \"Even when they scored, we got the ball out and continued to play with pace. We played with a lot of balance.\"\n\nJames hasn't been gone from Cleveland long enough to forget about his connection with Love or his spirited practice competitions with Thompson. The Cavaliers who stayed behind recognize their old teammate's steady brilliance, but they also see the improved aspects to James' ever-evolving game.\n\nThompson guarded James for long stretches, just like he would in scrimmages back in Cleveland. James still went 12 for 16, and he quarterbacked the Lakers' up-tempo offense to perfection in the second half.\n\n\"He made some 3s to get himself going, but he did a good job of getting his teammates involved,\" Thompson said. \"I accept the challenge. It's fun playing against the best player of our generation, and probably one of the best of all time. I love it.\"\n\nLove had 21 points and 11 rebounds for Cleveland in the third stop of a six-game road stretch. Two days after the Cavs posted a surprising win at powerhouse Denver, they couldn't keep up with a franchise icon who hasn't slowed down.\n\nReturning from a one-game absence with an apparent case of the flu, James improved to 2-0 against the Cavaliers since he departed for the second time in 2018. James had 32 points and 14 rebounds in his return to Cleveland in November 2018, and he was injured last January when the Cavs beat the Lakers at Staples Center.\n\nThompson had 17 points and 10 rebounds for Cleveland, while Collin Sexton and Darius Garland added 16 points apiece.\n\nCleveland jumped to a 14-point lead in the first half while most of the Lakers played listlessly, but Los Angeles ran away from the middle of the second quarter onward.\n\n\"When the pendulum began to swing, we couldn't stop it,\" Cleveland coach John Beilein said. \"LeBron took charge, just like he always has for a long time.\"\n\nTIP-INS\n\nCavaliers: Former Lakers F Larry Nance Jr. missed his sixth straight game with left knee soreness, but Beilein is hopeful Nance will return during their road trip. ... Beilein said he has known for \"a couple of weeks\" that first-round pick Dylan Windler would miss the entire season due to a stress reaction in his lower left leg. The Cavaliers announced Windler's yearlong absence Monday. \"Would have been a great addition for us,\" Beielein said. \"Feel bad for him, but he'll be almost like another first-round draft pick next season.\"\n\nLakers: Veteran G Rajon Rondo also missed the game with an injured finger. ... James and Avery Bradley both played despite the flu. Bradley scored 12 points. ... Danny Green had 10 points in his return from a one-game absence with a sore right hip.\n\nAD'S PROGRESS\n\nDavis is close to returning after his scary fall last week in a home game against New York, coach Frank Vogel said. The six-time All-Star missed the Lakers' road games at Dallas and Oklahoma City last weekend, and his return could depend on his pain tolerance.\n\nDavis felt good enough to make a quick trip Sunday to Lambeau Field, where he and JaVale McGee watched the Packers beat the Seahawks. Davis is a Chicago native, but he wore an Aaron Rodgers jersey to support Green Bay.\n\nVogel said his players cleared the trip with the Lakers, who had the day off Sunday and didn't hold a shootaround Monday morning.\n\nLEBRON'S ASSISTS\n\nJames, passed Thomas with his 9,062nd assist during the third quarter. He is the NBA's leader with a career-best 10.7 assists per game while molding himself into a virtuoso playmaker alongside Davis.\n\nDWIGHT'S DOMINANCE\n\nHoward capped another outstanding game in his bounce-back season with his ninth career 3-pointer in the fourth quarter.\n\n\"He was a monster tonight,\" Vogel said.\n\nUP NEXT\n\nCavaliers: Stay in Los Angeles to face the Clippers on Tuesday night.\n\nLakers: Host the Orlando Magic on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995995.4173892
}