{
  "game_id": "0022201094",
  "espn_id": "401469249",
  "date": "Mar 23, 2023",
  "matchup": "BKN vs. CLE",
  "headline": "Okoro's 3-pointer sends Cavaliers past Nets 116-114",
  "body": "NEW YORK -- — Isaac Okoro hit a 3-pointer from the corner with 0.7 seconds remaining and finished with 11 points as the Cleveland Cavaliers beat Brooklyn 116-114 Thursday night and closed in on their first playoff berth since 2018 with a two-game sweep of the Nets. \n\n\r\n              “It was a lot of pressure put into the shot, of course,” Okoro said. “You always feel good with a game-winner. For me, it was my first one.”\n\n\r\n              Donovan Mitchell scored 31 points, Evan Mobley had 26 points and 16 rebounds and Jarrett Allen finished with 12 points and 10 rebounds against his former team. Cleveland, which beat Brooklyn 115-109 on Tuesday, won for the eighth time in 10 games and reduced its magic number to clinch one of the Eastern Conference's top playoff spots to two.\n\n\r\n              “It was ugly at times,” Mitchell said. “There’s just so much going on (in the playoff race), and at the end of the day all we can do is control what we can control and winning these games instead of praying that other teams lose or win, we just gotta go out there and do what we do, and it’s great to have a win like this tonight.”\n\n\r\n              Mikal Bridges scored 32 points, Spencer Dinwiddie had 25 points and 12 assists and Joe Harris hit five 3-pointers and finished with 15 points as the Nets lost their fifth straight game.\n\n\r\n              “It’s frustrating,” Bridges said. “Obviously, we’ve got to keep the energy and morale high, but it’s devastating losing like that.”\n\n\r\n              Cleveland trailed 112-104 with 2:13 left before closing the game on a 12-2 run, with the help of three crucial Nets turnovers. Trailing by one, Mitchell missed a second free throw that would’ve tied the game, then he missed a put-back, and three different Nets had their hands on the ball for the potential rebound before it bounded to Cleveland guard Caris LeVert.\n\n\r\n              “I thought we did a great job of getting some stops to put ourselves in that position,” Cavaliers coach J.B. Bickerstaff said. “You miss the free throw, we had multiple opportunities at it, but guys didn’t quit on the play, and we talk about winning 50-50 balls and winning the scrap.”\n\n\r\n              LeVert, who spent his first four seasons with Brooklyn, found Okoro in the corner, and he drained the 3-pointer to give Cleveland the lead.\n\n\r\n              “The ball goes out to Caris, and I’m just running to the corner and going to my spot, and Caris trusted me,” Okoro said. “Once it left my hand, I knew it was going in.”\n\n\r\n              Bickerstaff said Okoro had no fear of taking the big shot.\n\n\r\n              “But I think what was most important is Caris saw that he was open and got him the ball, and that speaks to this team,” Bickerstaff said.\n\n\r\n              A heave from half court by Bridges at the buzzer fell short.\n\n\r\n              Bridges secured his eighth 30-plus point game as a member of the Nets through three quarters with 14 points in the third quarter. Then Harris heated up with four fourth-quarter 3-pointers in a sub-five-minute span, helping Brooklyn build a 10-point advantage.\n\n\r\n              “I felt like we deserved to win that game because we did a lot of good things throughout the course of the night,” Nets coach Jacque Vaughn said. “This is an opportunity for us to learn who we are.”\n\n\r\n              The Cavaliers rank first in the NBA in points-against per game and defensive rating, but had no answer for the Nets offense, which shot 56% in the first half. Dinwiddie had 19 points, including 11 in the second quarter, and seven assists, helping Brooklyn take a 61-60 lead into the break.\n\n\r\n              Mitchell and Bridges each scored in double figures in the first quarter, seeming to trade baskets in the early going. Mitchell scored 12 in the first, including nine in the first 2:17. Bridges had 10, helping the Nets build a 33-31 lead after one.\n\n\r\n              TIP-INS Cleveland: Mitchell is 35 points from 10,000 for his career. … With two made 3-pointers Thursday, Garland is now four away from tying Wesley Person for eighth place on the Cavaliers’ all-time list. … Guard Raul Neto (left-hamstring tightness) missed his second straight game.\n\n\r\n              Brooklyn: Bridges is averaging 25.8 points and 5.1 rebounds per game for the Nets since joining them via trade Feb. 11. Ben Simmons (left-knee/back soreness) missed his 14th consecutive game. Vaughn said pregame Simmons has been working individually and “not with teammates.”\n\n\r\n              UP NEXT Cavaliers: Host the Houston Rockets on Sunday.\n\n\r\n              Nets: At Miami Heat on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994849.163918
}