{
  "game_id": "401809781",
  "espn_id": "401809781",
  "date": "Nov 14, 2025",
  "matchup": "NY vs MIA",
  "headline": "Towns, Shamet power Knicks to a 140-130 win over Heat in NBA Cup game",
  "body": "NEW YORK -- — Karl-Anthony Towns scored 39 points and Landry Shamet added a career-high 36 points off the bench as the New York Knicks beat the Miami Heat 140-130 in an NBA Cup game on Friday night.\n\n\r\n              Jordan Clarkson scored 25 points, Mikal Bridges had 15, and Josh Hart recorded his first triple-double of the season with 12 points, 12 rebounds and 10 assists as the Knicks posted a season-high point total.\n\n\r\n              Jalen Brunson missed his first game of the season due to a sprained right ankle sustained in Wednesday’s loss to Orlando. OG Anunoby left the game after two minutes with a left hamstring strain and did not return.\n\n\r\n              Norman Powell scored a season-high 38 points to lead the Heat. Jaime Jaquez Jr. had 23. Andrew Wiggins and Kel’el Ware scored 15 points apiece, while Pelle Larsson had 14 and Davion Mitchell 11. \n\n\r\n              The Knicks and Heat are 1-1 in Group C play.\n\n\r\n              The Knicks trailed 62-61 in the second quarter before Towns connected on consecutive 3-pointers and a pair of free throws. New York never trailed again and led 78-68 at halftime.\n\n\r\n              Miami got within two at 104-102, but the Knicks held on for a 110-104 lead after the third quarter.\n\n\r\n              After Jaquez hit a layup to open the final quarter, the Knicks responded with a 10-0 run and went on to take their biggest lead at 125-110 on Shamet’s 3-pointer with 6:55 left.\n\n\r\n              Miami never got closer than eight points the rest of the way.\n\n\r\n              The Heat had their biggest lead after scoring the first seven points of the game, and were ahead 35-32 after the first quarter.\n\n\r\n              Up next\r\n              The teams meet again in Miami on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042621.478894
}