{
  "game_id": "0021800536",
  "espn_id": "401071212",
  "date": "Dec 30, 2018",
  "matchup": "DET @ ORL",
  "headline": "Fournier's buzzer beater lifts Magic past Pistons 109-107",
  "body": "ORLANDO, Fla. --  Even when he's not having a big game, Evan Fournier is still the Orlando Magic's best option at the end of games.\n\nFournier took an inbounds pass outside the 3-point arc, dribbled to the free throw line and shot a floating jumper that dropped through the nets as the buzzer sounded on Orlando's 109-107 win over the Detroit Pistons on Sunday.\n\n\"Evan wants the ball at the end, he has courage,\" Magic coach Steve Clifford said. \"That was not an easy shot, but if he can get a shot like that, you're comfortable he's going to make it.\"\n\nD.J. Augustin had 26 points and eight assists, and Nikola Vucevic and Aaron Gordon each scored 22 points to help the Magic win their second straight. Fournier finished with 13.\n\nWith the clock winding down, Fournier was the easy call for the potential winning shot attempt. He had a 3-pointer to beat Cleveland at the buzzer earlier this season.\n\n\"I really embrace those moments,\" Fournier said. \"It's everyone's dream to have one buzzer beater in the NBA so having two is even better.\"\n\nFournier's winning basket ended a wild finish in which Detroit wiped out an eight-point deficit in the final three minutes only to lose for the 11th time in their last 14 games.\n\nLuke Kennard scored 16 points to lead the Pistons. Reggie Bullock and Blake Griffin had 15 apiece and Andre Drummond had 14 points and 15 rebounds.\n\nDetroit thought it had pushed the game into overtime when Bullock was fouled on a 3-point attempt with 2.5 seconds to go and made all three free throws to tie the score at 107.\n\nHowever, the Pistons couldn't come up with a stop when they needed one.\n\n\"Games don't come down to just one play,\" Detroit coach Dwane Casey said. \"There were way too many possessions before that when we did things that get you beat. We just have to learn to do the simple things.\"\n\nNeither team led by more than six points in the second half until Augustin sparked an 8-0 run with back-to-back 3-pointers and fed Jonathan Isaac for a fastbreak layup that gave Orlando a 95-87 lead with 7:07 left in the game.\n\nLater in the quarter, Augustin stole a rebound from Drummond, drove the lane and whipped a wraparound pass to Vucevic for an uncontested layup that made it 104-95 with 3 1/2 minutes to go.\n\nDetroit rallied quickly. A layup by Reggie Jackson cut the deficit to 105-104 with 8.9 seconds remaining.\n\nOrlando's Terrence Ross got loose for a breakaway dunk with 5.4 seconds to go but Bullock's free throws tied it.\n\nFournier took the inbounds pass and immediately drove into the lane, lofting his shot just before the buzzer sound to give Orlando the win.\n\nTIP-INS\n\nPistons: Detroit came into the game off a season-worst 37-point loss to Indiana. ... Detroit is No. 1 in offensive rebounding advantage over opponents with a plus-110 margin coming in. The Pistons added to that, grabbing 17 rebounds to 10 for the Magic. ... Griffin took a nasty fall when he slipped on a wet floor while trying to inbound the ball after a turnover. Griffin lay on the floor for 15 seconds before getting up and continuing play.\n\nMagic: PG D.J. Augustin badly sprained his ankle after stepping on Griffin's foot with 1:44 left in the game, but stayed in the game. ... Orlando came in off as season-best 29-point win over Toronto. ... F Jonathon Simmons left the game in the second quarter with an ankle injury and did not return. ... The Magic outscored the Pistons 22-8 in points in the paint in the first quarter.\n\nMUCH ADO ABOUT NOTHING?\n\nCasey was upset enough with Detroit's performance in a 125-88 loss at Indiana on Friday to apologize to fans for \"one of the worst exhibitions we've put on the floor.\"\n\nTwo days later, he downplayed the impact of the 20-minute team meeting he had with players after the game.\n\n\"Nothing came out of the meeting that hasn't been said before,\" Casey said before Sunday's game. \"When you walk across the black lines, if you have your hard hat on and your boots tied, that is what this game is about. We haven't exemplified that enough consistently and until we do, we're going to be on a roller coaster.\"\n\nUP NEXT\n\nPistons: Continue a four-game road trip Tuesday night at Milwaukee.\n\nMagic: Start a six-game road trip in Charlotte on Monday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994697.939808
}