{
  "game_id": "0022400345",
  "espn_id": "401704911",
  "date": "Dec 07, 2024",
  "matchup": "MEM @ BOS",
  "headline": "Ja Morant scores 32 to help Grizzlies beat Celtics 127-121 and snap 10-game losing streak in Boston",
  "body": "BOSTON -- — Ja Morant had 32 points, nine assists and nine rebounds, and the Memphis Grizzlies snapped a 10-game losing streak in Boston with a 127-121 win over the Celtics on Saturday night.\n\n\r\n              Jaren Jackson Jr. added 27 points and nine rebounds for Memphis, which won in TD Garden for the first time since Nov. 27, 2013. The Grizzlies have won eight of their last nine. \n\n\r\n              Jrue Holiday had 23 points for the Celtics, who went 18 for 60 from the 3-point line. Jaylen Brown and Payton Pritchard each finished with 22 points. \n\n\r\n              The Celtics erased a 14-point, third-quarter deficit, taking a 97-94 lead early in the fourth. Memphis rallied and led 117-115 with less than four minutes to play. The Grizzlies then scored seven straight to get it back up to 124-115 and were able to close it out. \n\n\r\n              Marcus Smart played in TD Garden for the first time since being dealt to Memphis as part of the three-team trade that brought Kristaps Porzingis to Boston in 2023. He played 19 minutes but was only 1 of 11 from the floor, finishing with three points.\n\n\r\n              Takeaways\r\n              Grizzlies: Morant had one of his best all-around efforts since returning from his hip injury last month. He showed explosiveness offensively, throwing down a double-clutch reverse dunk. He also facilitated for his teammates in the halfcourt, a solid sign in just his sixth game back.\n\n\r\n              Celtics: The Celtics lost for the first time this season on the second night of a back-to-back (4-1).\n\n\r\n              Key moment\r\n              Smart checked into the game at the 8:50 mark of the first quarter and acknowledged a standing ovation from Celtics fans, stopping to wave to the crowd.\n\n\r\n              Key stat\r\n              Memphis outscored Boston 64-40 in the paint. \n\n\r\n              Up next\r\n              The Grizzlies visit the Washington Wizards on Sunday. The Celtics host the Detroit Pistons on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997740.482688
}