{
  "game_id": "0021600082",
  "espn_id": "400899532",
  "date": "Nov 05, 2016",
  "matchup": "DET vs. DEN",
  "headline": "Pistons roll at home again, 103-86 over Denver",
  "body": "AUBURN HILLS, Mich. --  Andre Drummond bounced back from a couple quiet games, and the Detroit Pistons breezed to another easy victory at home.\n\nDrummond had 19 points and 20 rebounds, and Detroit beat the Denver Nuggets 103-86 on Saturday night. The Pistons have won all four of their home games this season by double digits, and they haven't trailed by more than three points in any of them. They were never behind Saturday after scoring the game's first 10 points.\n\nDrummond had only six points in a loss at Brooklyn on Wednesday night, and only nine in a win over New York the previous night.\n\n\"I wasn't myself the past two games,\" Drummond said. \"I wasn't playing with energy and I wasn't doing things I'm supposed to do to help my team win games.\"\n\nThe Pistons were all playing with purpose at the beginning of Saturday's game. Drummond threw down a one-handed dunk off an alley-oop pass from Ish Smith in transition to put Detroit up 8-0, and Denver took a quick timeout. It was 16-2 when the Nuggets called time again, and by the time the first quarter ended, Denver was 5 of 27 from the field and trailed 29-12.\n\n\"I thought in the first quarter, our defense was the best it's been all year, and maybe as good as it's been since I've been here,\" Detroit coach Stan Van Gundy said.  \"We were really on it, and it was making more than one, two efforts on every possession.\"\n\nIt was 51-44 at halftime and 77-67 after three, then the Pistons started the fourth quarter with another 10-0 run and the rout was on again.\n\n\"We're only five games in, but there's been a pattern for four straight games where we've gotten down by 15, 18,\" Denver coach Michael Malone said. \"It was 20-4 to start the game. We're paid professionals. You have to be ready to play.\"\n\nMarcus Morris and Jon Leuer scored 15 points each for Detroit, and Kentavious Caldwell-Pope added 13. Wilson Chandler led Denver with 21 points.\n\nTIP-INS\n\nNuggets: Denver was averaging 31.8 points in the third quarter this season, the second-best mark in the league. The Nuggets were held to 23 by Detroit. ... F Nikola Jokic was called for a flagrant foul in the third, and Drummond made both free throws after Denver had cut a 14-point lead to nine.\n\nPistons: Detroit (4-2) is off to a solid start despite the absence of PG Reggie Jackson, who has been dealing with knee issues. ... The Pistons recovered nicely on defense after allowing a 71-point first half against Brooklyn. ... Drummond went 7 of 11 from the free throw line.\n\nMILESTONE\n\nDrummond had three blocked shots, bringing his career total to 500.\n\n\"Not enough,\" he joked. \"It's definitely a good milestone, and thanks to my teammates for letting their man get by them.\"\n\nDrummond finished one point short of what would have been his 11th career game with at least 20 points and 20 rebounds.\n\nCHANGES\n\nMalone was understandably displeased with his team's performance at the beginning of the game, and he indicated the starting lineup would be altered.\n\n\"We were flat everywhere, it wasn't just offensively,\" Malone said. \"Our defense was horrendous. They did whatever they wanted. It was the fifth game in a row where our starting group came out asleep, so we're not going to have the same starting lineup (Sunday) night.\"\n\nChandler wasn't about to dispute the coach's reaction.\n\n\"I can understand his frustration,\" Chandler said. \"Us as players individually, we're frustrating ourselves.\"\n\nUP NEXT\n\nNuggets: Visit Boston on Sunday night.\n\nPistons: Start a four-game trip against the Clippers in Los Angeles on Monday night.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764996088.1430678
}