{
  "game_id": "0021600861",
  "espn_id": "400900267",
  "date": "Feb 24, 2017",
  "matchup": "OKC vs. LAL",
  "headline": "Westbrook's triple-double leads Thunder past Lakers, 110-93",
  "body": "OKLAHOMA CITY --  Russell Westbrook connected with his new teammates immediately.\n\nWestbrook scored 17 points in his 28th triple-double of the season, and the Oklahoma City Thunder defeated the Los Angeles Lakers 110-93 on Friday night.\n\nIt was the first game in a Thunder uniform for Taj Gibson and Doug McDermott, acquired Thursday in a trade with the Chicago Bulls. Gibson scored 12 points and McDermott added eight, even though they arrived Thursday night and weren't even available for shootaround on Friday.\n\nWestbrook said the newcomers handled the hectic situation well.\n\n\"Great, man. Like pros,\" Westbrook said. \"They came in and competed. Obviously, they don't know many plays and many sets, but it was all right. They did a great job with spacing and knowing how to play the game.\"\n\nWestbrook also had 18 rebounds and 17 assists for the 65th triple-double of his career.\n\nGibson is glad to have Westbrook as a teammate now instead of an opponent.\n\n\"It's a lot easier, because when he's coming at you full speed and he has that mentality where he's just so mad, it's scary. You've got to get out the way,\" Gibson said.\n\nAnd he already feels comfortable with the Thunder.\n\n\"It helped make things a little bit better, knowing that you come into a situation where people want you and welcome you with open arms,\" Gibson said.\n\nAlex Abrines and Andre Roberson each set a career high with 19 points, and Steven Adams added 15 points and 10 rebounds for the Thunder.\n\nD'Angelo Russell scored 29 for the Lakers, who shot just 39.6 percent. It was the team's first game since sending scoring leader Lou Williams to the Houston Rockets.\n\n\"I knew at times we'd stall out offensively because Lou was such a big part of it,\" Lakers coach Luke Walton said. \"But I thought they did a great job.\"\n\nWestbrook didn't make a field goal until 3:15 remained in the first half, but he went 8 for 9 from the free throw line before the break. He had 13 points, eight rebounds and eight assists in the first half to help the Thunder take a 58-51 lead.\n\nWestbrook clinched his triple-double in the first few minutes of the third quarter. Abrines hit three 3-pointers in the opening minutes of the period to give the Thunder a 73-58 lead.\n\nGibson got the crowd into it with a dunk on an assist from Westbrook with 2:27 left in the third, and the Thunder remained in control the rest of the way.\n\n---\n\nTIP-INS\n\nLakers: F Corey Brewer, obtained in the deal that sent Williams to Houston, scored two points in four minutes. ... Julius Randle had 13 points and 11 rebounds. ... Los Angeles shot 2 of 12 on 3-pointers in the first quarter and 7 of 35 overall.\n\nThunder: Starting shooting guard Victor Oladipo sat out with back spasms. ... Gibson entered with 3:47 left in the first quarter. McDermott entered with 2:54 to go in the first. ... F Enes Kanter returned after missing the previous nine games with a broken forearm. He finished with four points on 2-for-12 shooting.\n\nQUOTABLE\n\nAbrines, on getting his first career start in Oladipo's place: \"I was really excited. A little bit nervous. I feel really excited my first year. Just getting in the starting five and hearing your name before the game is something nobody's going to take away from me. I can tell my son I was there. I was in the starting five with Russ and those guys.\"\n\nSTAT LINES\n\nWestbrook went 4 for 18 from the field. It was the fewest field goals he has made in a game since making four on Nov. 3 against Golden State.\n\nUP NEXT\n\nLakers: Host the San Antonio Spurs on Sunday.\n\nThunder: Host the New Orleans Pelicans on Sunday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995269.8107982
}