{
  "game_id": "0021700007",
  "espn_id": "400974703",
  "date": "Oct 18, 2017",
  "matchup": "MIL @ BOS",
  "headline": "Greek Freak (37 points) leads Bucks past Celtics, 108-100",
  "body": "BOSTON -- Giannis Antetokounmpo dribbled into the paint, spun to his left and found his path to the basket blocked by Celtics rookie Jayson Tatum.\nInstead, the Greek Freak fed the ball to Matthew Dellavedova beyond the arc for the 3-pointer that helped seal Milwaukee's 108-100 victory over the Boston Celtics in the Bucks' season opener on Wednesday night.\n\"I passed the ball to Delly,\" said Antetokounmpo, who had 16 of his 37 points in the fourth quarter- and the biggest assist of the game, as well. \"And that's what Delly does.\"\nOne night after a gruesome broken ankle just six minutes into the season cost Boston top free agent Gordon Hayward -- perhaps for the entire year -- the Celtics fell to 0-2 by giving up an 11-1 run that left Milwaukee with a 97-90 lead and under three minutes to play.\nAntetokounmpo added 13 rebounds, Rookie of the Year Malcolm Brogdon scored 19 points and Khris Middleton had 15 points and nine rebounds for the Bucks. Dellavedova scored 15 points, including the 3-pointer with 45 seconds left after the Celtics cut the lead to two points.\n\"I thought Giannis made a great play at the end, trusting his teammate,\" Bucks coach Jason Kidd said. \"Just to trust his teammate down at the end to make a play ... he got off the ball and Delly made a big shot.\"\nKyrie Irving scored 17 points on 7-for-25 shooting in his Boston debut, and Jaylen Brown had 18 in a subdued home opener for the Celtics, who underwent a near-complete overhaul over the summer even after earning the No. 1 seed in the Eastern Conference last season.\nAlthough Irving and No. 3 draft pick Jayson Tatum appeared in a Celtics home uniform for the first time, Hayward was left to wish them well in a pregame video in his hospital gown from his hospital bed. After cheering Hayward during his scoreboard appearance, the Celtics fans broke into a chant of his name during the first half.\n\"Like he told us before the game, we got that message -- before the whole arena got the message -- he's fine,\" Celtics guard Terry Rozier said. \"Personally, it was tough seeing, but I think we'll be fine. We've just got to adjust.\"\nBut the team was unable to make up for the absence of the player who was expected to be their key offseason acquisition when he signed a four-year, $128 million contract to rejoin Brad Stevens, his college coach, in Boston.\nThe Celtics trailed by seven heading into the third quarter before scoring 14 of the next 16 points, taking a 69-64 lead on Irving's 3-pointer from the top of the key. But the Bucks regained the lead with six minutes to play, holding Boston without a basket for about five minutes.\nFIGHTING WORDS\nBoston's Marcus Smart and Dellavedova traded hard fouls early in the second quarter, leading to some shoving and a technical foul for the Celtics guard. First, Smart went to the floor with a bit of a hip check. Later, Smart seemed to embellish his fall when Dellavedova ran into his screen.\nSmart came up and put his chest into the Bucks guard, and Milwaukee's John Henson reached in to try to restrain him. Dellavedova was called for a common foul and Smart was given a technical.\nTIP-INS\nBucks: Returned to the road for their season opener. Before opening at home the past two seasons, the Bucks had tipped off on the road for 30 years in a row. ... Greg Monroe went to the locker room in the first quarter with a cut on the side of his head, near his right eye, and said he had \"a couple of\" stitches. He and finished with 10 points in 17 minutes.... Antetokounmpo's 37 points were the third-most in his career.\nCeltics: No. 3 overall draft pick Tatum had eight points and nine rebounds. ... Brown had his left wrist taped after the game and said \"sprained it or something.\"\nUP NEXT\nBucks: Host Cleveland on Friday night.\nCeltics: Visit Philadelphia on Friday night.\n---\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993066.097941
}