{
  "game_id": "401809778",
  "espn_id": "401809778",
  "date": "Nov 07, 2025",
  "matchup": "MIN vs UTAH",
  "headline": "Edwards scores 37, Randle adds 19 with 10 rebounds as Timberwolves beat the Jazz 137-97",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 37 points and Julius Randle added 19 points, 10 rebounds and 12 assists as the Minnesota Timberwolves defeated the Utah Jazz 137-97 in an NBA Cup game Friday night.\n\n\r\n              Edwards, in his second game back after missing four games with a strained hamstring, shot 7 for 12 from 3-point distance.\n\n\r\n              Randle was just one rebound shy of completing his triple-double in the first half as Minnesota built a 79-45 lead at the break. He had his second triple-double of the week after accomplishing the feat Monday in a win at Brooklyn.\n\n\r\n              Jaden McDaniels had 22 points and seven rebounds for the Timberwolves, who shot a season-high 56.8% from the floor.\n\n\r\n              Keyonte George led Utah with 18 points and Lauri Markkanen added 12 for the Jazz, who shot 37.2% from the field and allowed a season-high point total. Utah allowed at least 134 points for the third time in nine games this season.\n\n\r\n              Second-year point guard Isaiah Collier made his season debut after missing Utah's first eight games with a strained hamstring.\n\n\r\n              Edwards started quickly, hitting two 3-pointers and a 12-foot step-back jumper in the first 90 seconds. He scored 14 points to help Minnesota race out to a 43-15 lead after one quarter.\n\n\r\n              The game was Minnesota's first in the NBA Cup. The Jazz slipped to 0-2 in the competition. The teams are part of the Western Conference Group A along with Phoenix, Oklahoma City and Sacramento.\n\n\r\n              Up next\r\n              Jazz: Host the Minnesota Timberwolves again on Monday. \n\n\r\n              Timberwolves: At Sacramento on Sunday night before a rematch with the Jazz in Utah on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042580.562835
}