{
  "game_id": "0022200758",
  "espn_id": "401468913",
  "date": "Jan 30, 2023",
  "matchup": "MIN vs. SAC",
  "headline": "Fox, Lyles help Kings outlast Timberwolves 118-111 in OT",
  "body": "MINNEAPOLIS -- — De'Aaron Fox scored 32 points and Trey Lyles had eight of his 11 points in overtime for the Sacramento Kings, who outlasted the Minnesota Timberwolves 118-111 on Monday night.\n\n\r\n              Malik Monk scored 19 points, Domantas Sabonis had 17 points and 13 rebounds before fouling out and Keegan Murray added 13 points and 13 rebounds for the upstart Kings, who produced another signature win in their promising quest to end an NBA-record 16-year absence from the playoffs.\n\n\r\n              The Kings had a season-high 15 steals and turned 18 turnovers by the Timberwolves into 21 points.\n\n\r\n              “It’s just trying to be disruptive. If we get a deflection and it turns into a steal, great,” Fox said.\n\n\r\n              Lyles took over for Sabonis at center and started overtime with a 3-pointer. He dunked on Rudy Gobert for a three-point play and got wide open for a slam with 37.8 seconds left for a five-point lead that put the game away and gave the Kings a two-game split after a 117-110 loss on Saturday.\n\n\r\n              “Both those games were kind of ugly to our standards, so I thought we did a good job maintaining our composure down the stretch,” Murray said.\n\n\r\n              Anthony Edwards had 33 points and eight rebounds for the Timberwolves, hitting the 30-point mark for the fifth time in the last six games, but he had six turnovers amid heavy double-teams down the stretch.\n\n\r\n              “He’s drawing a big crowd,” Wolves coach Chris Finch said. “For the most part, he’s trying to make the right play. Maybe he needs to see it a little earlier.”\n\n\r\n              Gobert added 19 points and 14 rebounds in a classic big man battle with Sabonis, who was whistled for a technical after a missed contested layup that had him screaming at the officials about the no-call with 3:57 left. \n\n\r\n              Neither team led by more than five points for the entire fourth quarter, when Edwards went to work once again for the Wolves and made baskets on three straight possessions for a 98-95 lead with 2:12 to go.\n\n\r\n              Fox is one of those clutch players, too. He gave the Kings the lead twice with shots in the final 1:48 and had the chance to win it at the regulation buzzer, when his fadeaway fell short. \n\n\r\n              Jaden McDaniels hit the game-tying 3-pointer with 13.5 seconds left for the Wolves, but they failed to take advantage of the absence of Sabonis in overtime and hurt themselves anew with unforced errors on both ends. In another sign of the crowded Western Conference race, they fell from fifth place to ninth. The Kings are in third, with just one more win than the Wolves.\n\n\r\n              “To go into overtime in someone else’s building and gut out a win is definitely big,” Fox said.\n\n\r\n              EARLY BRICKS\n\n\r\n              The rims on both ends were in an unforgiving mood. The Wolves had a season-low 17 points in the first quarter. D'Angelo Russell missed his first three free throws after missing a total of twice from the line in his previous 13 games.\n\n\r\n              “We tried to scrape this one out, and we made too many mistakes to get the win,” Russell said.\n\n\r\n              GHOST TOWNS\n\n\r\n              Timberwolves star Karl-Anthony Towns has missed 32 games with a strained right calf. He posted an Instagram photo over the weekend showing his right foot in a walking boot.\n\n\r\n              “No setbacks at all,” Finch said. “Just part of the process.”\n\n\r\n              TIMES CHANGE\n\n\r\n              Three years and three days ago, the Kings stunned the Timberwolves by overcoming a 27-point deficit — they were still down 17 with 2:49 left in regulation — to win in overtime.\n\n\r\n              Only three players remain on each team's roster from that night. The only ones who saw the floor in both the Jan. 27, 2020, game: Fox and Harrison Barnes for Sacramento and Naz Reid for Minnesota.\n\n\r\n              TIP-INS\n\n\r\n              Kings: SG Kevin Huerter went 5 for 19 from the floor and 2 for 12 from 3-point range in the two-game series. ... SG Deonte Burton was signed to a 10-day contract prior to the game, plucked from the G-League affiliate in Stockton.\n\n\r\n              Timberwolves: Backup SF Taurean Prince returned from a four-game absence with a sprained left ankle. ... The Wolves shot 13 for 25 from the free-throw line.\n\n\r\n              UP NEXT\n\n\r\n              Kings: Visit San Antonio on Wednesday.\n\n\r\n              Timberwolves: Host Golden State on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995165.97169
}