{
  "game_id": "0021501021",
  "espn_id": "400828908",
  "date": "Mar 18, 2016",
  "matchup": "OKC @ PHI",
  "headline": "Westbrook's 13th triple-double helps Thunder down 76ers",
  "body": "PHILADELPHIA --  Russell Westbrook is making getting a triple-double practically a daily routine.\n\nWestbrook had 20 points, 15 rebounds and 10 assists for his league-leading 13th triple-double, and Kevin Durant had 26 points and 13 rebounds to lead the Oklahoma City Thunder to a 111-97 victory over the Philadelphia 76ers on Friday night.\n\n\"It's a blessing, especially to go out and have fun and get the win,\" Westbrook said. \"I think it's fun to see where we're playing the right way. It's fun for our guys to see everybody happy playing the right way.\"\n\nWestbrook's 13 triple-doubles tie Grant Hill (1996-97) and Jason Kidd (2007-08) for the most in a season over the last 25 years. Westbrook, appropriately, reached the triple-double by assisting Durant on a layup with 4:14 left in the game.\n\nEnes Kanter contributed 16 points for the Thunder, who clinched a playoff spot with their 14th straight victory over Philadelphia. It is the longest winning streak in the NBA by one team over another.\n\n\"They are one of the elite teams in the NBA, and they are the head of the snake,\" Philadelphia coach Brett Brown said.\n\nThe NBA-worst 76ers lost their fourth straight and 17th in 18 games while falling to 9-60, keeping alive the possibility of matching the 1972-73 76ers for worst record in the 82-game season. That Philadelphia team went 9-73.\n\nNik Stauskas scored 23 points and Hollis Thompson added 16 for the 76ers.\n\nDurant and Westbrook combined for 16 of the Thunder's 32 third-quarter points as Oklahoma City took control in the period. The Thunder, who trailed by as many as seven points in the opening 24 minutes, led by just six at the half. But Oklahoma City's dynamic duo combined on a variety of highlight plays in the decisive period to help the Thunder enter the fourth ahead 85-68.\n\nDurant drew \"oohs\" and \"aahs\" from a rare capacity crowd at the Wells Fargo Center when he went through his legs and then behind his back before draining an 18-footer four minutes into the quarter. Westbrook charged down the lane for a dunk four minutes later for two of his eight third-quarter points, bringing the fans out of their seats again. And Durant followed with a jumper on the Thunder's ensuing possession to push the Thunder's lead to 77-58 with 2:59 left in the quarter.\n\n\"It's just fun playing the right way,\" Durant said. \"We had some nice plays out there. You could tell the crowd was into it. We just like the way we played tonight.\"\n\nWestbrook also flashed his notorious fire in the period, staring down Carl Landry after Landry tried to get the ball out of Westbrook's hand following a turnover by the Oklahoma City star. The referee intervened and nothing further came of it.\n\n\"I come out and compete every night at a high level and try to keep my energy up for my teammates,\" Westbrook said.\n\nSaid Brown of Westbrook and Durant: \"There's a competitive anger you see in their faces, a determination and will more than you can put any stat on.\"\n\nPLAYOFFS?\n\nThe Thunder head back to the postseason after last year's hiatus ended a five-year postseason run that included their appearance in the 2012 NBA Finals.\n\n\"It's my first time, so I'm excited I'll have an opportunity to do that,\" first-year Thunder coach Billy Donovan said. \"It's a great accomplishment. We're excited about that, but we also realize what's in front of us and the areas we want to improve on.\"\n\nREBOUND EDGE\n\nThe Thunder, who entered leading the NBA with 48.4 rebounds per contest, outrebounded Philadelphia 63-36.\n\n\"We're small and we're not thick,\" Brown said. \"We're light right now. They are the best in the NBA. I wish it was better than that.\"\n\nTIP-INS\n\nThunder: F Serge Ibaka (rest) didn't play, but Donovan said he is expected to play Saturday night against the Pacers. ... Philadelphia native Dion Waiters played his second game after missing four games following the death of younger brother Demetrius Pinckney, who was killed in South Philadelphia on March 8. He had nine points. ... The Thunder swept the season series, having defeated Philadelphia 102-85 at home on Nov. 13. Westbrook had 21 points, 17 rebounds and 11 assists in that contest. ... Durant has scored 20 or more points in 54 straight games. ... Oklahoma City improved to 9-4 in the first game of a back-to-back situation. The Thunder play at Indiana on Saturday night.\n\n76ers: C Jahlil Okafor (knee) missed his 10th straight game. The rookie is out for the season. ... F Robert Covington (concussion) and F Richaun Holmes (Achilles') sat out for the third straight game. ... Naughty by Nature performed a halftime concert. ... For the second straight night, a fan won a 50-inch television by making a layup, free throw and 3-pointer.\n\nUP NEXT\n\nThunder: Saturday night at Indiana.\n\n76ers: Host Boston Sunday night",
  "source": "espn_api",
  "crawled_at": 1764994135.4370198
}