{
  "game_id": "0022300627",
  "espn_id": "401585255",
  "date": "Jan 25, 2024",
  "matchup": "PHI @ IND",
  "headline": "Pascal Siakam has triple-double, Pacers end 76ers' winning streak at 6 with 134-122 victory",
  "body": "INDIANAPOLIS -- — The Indiana Pacers produced the perfect celebration Thursday night.\n\n\r\n              Pascal Siakam had his first triple-double in 15 months, Tyrese Haliburton was announced as an All-Star starter and the Pacers got a desperately needed win.\n\n\r\n              Siakam finished with 26 points, 13 rebounds and 10 assists and Indiana never trailed in a 134-122 victory over the Philadelphia 76ers.\n\n\r\n              “We made it our kind of game,” Pacers coach Rick Carlisle said. “Siakam was obviously tremendous, the sixth triple-double of his career, his first, obviously, with the Pacers. When you have a power forward get a triple-double, it's pretty special.”\n\n\r\n              For Siakam, it was his first win since Toronto traded him to the Pacers last week — against his longtime coach, Nick Nurse.\n\n\r\n              The victory snapped a three-game losing streak and, fittingly, capped a night in which Pacers players and fans relished the announcement of Haliburton making his first All-Star start.\n\n\r\n              Perhaps, even better — it came against reigning MVP Joel Embiid, who had 31 points and seven rebounds just three days after breaking the 76ers' franchise record with 70 points. Philadelphia had won six straight.\n\n\r\n              Embiid also was announced as a starter for the Feb. 18 All-Star Game that will be played in Indianapolis. But Nurse acknowledged Embiid and most of his players seemed sluggish on a night the team was missing two starters.\n\n\r\n              “You go through this sometimes,” Nurse said. “But we still, I think we've got to play a little better and guard a little better. We just didn't have any kind of defensive success.”\n\n\r\n              And that was even with Haliburton sitting out another game because of a strained left hamstring.\n\n\r\n              Instead, the Pacers made this one look easy. They opened with six straight points, quickly extended the margin to double digits and led by 17 before settling for a 73-61 halftime cushion.\n\n\r\n              Indiana then opened the second half with 10 straight points to make it 83-61. Philadelphia never recovered in a game that it never led.\n\n\r\n              Siakam made sure of it.\n\n\r\n              “He was good, he was very good,” Nurse said. “He got going early and when he does that, you're going to see him play really, really good. We got to him kind of late on some double teams and there was nobody there to rotate out, which is why he had such a big assist number.”\n\n\r\n              Indiana improved to 8-4 against the Eastern Conference's top three teams and is .500 or better against all three.\n\n\r\n              The All-Star announcement came just as the game was about to start, so the Pacers honored Haliburton during the first timeout by replaying the television clip. Fans gave Haliburton a standing ovation, and the 23-year-old guard waved to the crowd.\n\n\r\n              UP NEXT\n\n\r\n              76ers: At Denver on Saturday.\n\n\r\n              Pacers: Host Phoenix on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996423.933484
}