{
  "game_id": "0021800521",
  "espn_id": "401071197",
  "date": "Dec 28, 2018",
  "matchup": "CLE @ MIA",
  "headline": "Winslow, Adebayo lead Heat past Cavs, 118-94",
  "body": "MIAMI --  Justise Winslow is in a groove.\n\nWinslow had 24 points and 11 rebounds and the Miami Heat beat the Cleveland Cavaliers 118-94 on Friday night.\n\n\"You can tell the game is now slowing down for him and once the game slows down for you, it's scary how good you can be. So we all are enjoying it,\" Heat guard Dwyane Wade said.\n\nWinslow, who recently made the move to be Miami's starting point guard with Goran Dragic sidelined with an injury, added seven assists while helping spark the team's defensive turnaround after the first quarter.\n\n\"He has put together some rock-solid floor game and is really inspiring on both ends of the court,\" Heat coach Erik Spoelstra said. \"People only look at that final number on the box score. I don't want that to define the impact that he is making. It's about being a complete basketball player on both ends and he did that tonight.\"\n\nWinslow has scored at least 20 points in three straight games. He also had a three-game stretch earlier this month where he scored at least 20.\n\n\"I think I'm just playing with a lot of instincts and I'm just trying to lead,\" Winslow said. \"I want all of the guys to play free. I want all of the guys to be confident in their shots. I'm going to be confident in mine. I think that's been a big thing of recent. I think we've been just super confident within each other and my teammates have been super confident with me.\"\n\nBam Adebayo made all eight shots and scored 18 points, Josh Richardson added 16 points and Rodney McGruder chipped in 13 as seven players scored in double figures for the Heat, who have won six of seven.\n\nJordan Clarkson had 18 points for the Cavaliers, who have lost five straight.\n\n\"We didn't make any shots tonight,\" Clarkson said. \"We got some good looks we just didn't knock them down. But at the same time we have to attack the zone as well, get in the paint, kick out and make the shots easier.\"\n\nIt was the 15th consecutive home win for Miami over Cleveland. The Cavs' last win in Miami was Jan. 25, 2010 -- a game where LeBron James and Shaquille O'Neal both started for Cleveland. The last time the Cavs won in Miami without LeBron James was Dec. 21, 2001.\n\nCleveland shot 58 percent (11 of 19) in the first quarter for a 30-29 lead, but just 32 percent (20 of 62) the rest of the game, finishing at 39 percent.\n\n\"We talk about being a good defensive team and we've been a good defensive team this whole month so we knew we had to turn it around or we knew we was going to be in for a dog fight,\" Wade said.\n\nMiami shot 52.7 percent (48 of 91) for the game.\n\nTIP-INS\n\nCavaliers: C Ante Zizic (knee) was held out, leaving the Cavs with nine players who dressed. . Cleveland's bench entered the game sixth in the NBA, averaging 43.5 points. Its reserves scored 42. . The Cavs' first game of 2019 will be Wednesday, at home against Miami.\n\nHeat: F James Johnson (illness) did not play after the first quarter, while F Udonis Haslem (illness) was not at the game. ... SG Dion Waiters is on a G League rehabilitation assignment with Sioux Falls. \"It's a great opportunity for him to get some 5-on-5 work,\" Spoelstra said. \"We haven't been able to do that here. He's been putting in great work, but it hasn't been 5-on-5 and that's the next step for him.\"\n\nWADE GIVES JERSEY TO BOSH\n\nWade has been giving his jersey to an opposing player after each game in his final season, but this time he gave one to former Heat teammate Chris Bosh.\n\n\"It was good,\" Wade said. \"That's one of my good friends and we was chilling last night with my daughter talking. I didn't tell him I was going to give him my jersey, but I thought it would be good. I gave Bron (LeBron James) my jersey in L.A. We all are what we are in this game because of each other as well so I thought it was great that I can give him a little piece of this last dance. This organization is a championship organization and is respected the way that it is because of that guy helping bring two championships here. I'm just thankful I can do that.\"\n\nUP NEXT\n\nCavaliers: Visit Atlanta on Saturday.\n\nHeat: Host Minnesota on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994784.728565
}