{
  "game_id": "0021800504",
  "espn_id": "401071180",
  "date": "Dec 26, 2018",
  "matchup": "ATL vs. IND",
  "headline": "Young, Sabonis, Evans power Pacers past Hawks 129-121",
  "body": "ATLANTA --  Victor Oladipo loves it when Indiana gets so many players involved in the offense.\n\nThaddeus Young scored 21 points, Domantas Sabonis and Tyreke Evans each added 19, and the Pacers won their third straight game with a 129-121 victory over the Atlanta Hawks on Wednesday night.\n\n\"Everybody was scoring,\" Oladipo said. \"We had very balanced scoring tonight. We just to have to continue getting better every game.\"\n\nThe Pacers, who began the night with the third-best record in the Eastern Conference, have won 10 of 12. Coach Nate McMillan used nine players, eight of whom finished in double figures as Indiana matched a season high with 35 assists.\n\n\"When guys are open, you have to get them the ball,\" McMillan said. \"You shoot a better percentage when you move the ball and you have your feet set, and that's what we continue to express to our guys.\"\n\nKent Bazemore tied a career high with 32 points, John Collins added 21 points and 11 rebounds and Dewayne Dedmon had 18 points and a season-best 15 rebounds for the rebuilding Hawks, who had won three straight.\n\nIt was an off night for the Pacers' defense, which entered with the NBA's best scoring average. The Hawks, who have the league's second-worst offense, stayed close by hitting 17 3-pointers.\n\nCory Joseph's 3 and fast-break layup ended a 19-10 run that gave the Pacers an 87-85 lead in the third quarter. Indiana never trailed after Myles Turner hit a 3 to make it 90-88 in the final minute of the period, and Young's 3 pushed the lead to seven with a second to go.\n\nThe Pacers took charge in the fourth. Joseph fed Sabonis for an inside basket, Evans drove the lane on a fast break to feed Young, and Sabonis converted a three-point play to extend the margin to 102-93 with 9:03 remaining. Joseph followed with a 3 that gave Indiana its first double-digit advantage.\n\nEvans deked rookie Kevin Huerter on the perimeter and drove the lane for a layup that made it an eight-point lead. Evans' 3 put the Pacers up 11 with 3:37 to go.\n\n\"It's very important because you have guys attacking from everywhere, and the other team doesn't know how to stop it,\" said Oladipo, who leads the team in scoring and finished with 16 points.\n\nYoung and Sabonis each scored inside in the final two minutes to hold Atlanta back when it pulled within five.\n\nYoung has been producing at a high clip recently, averaging 18.8 points and nearly 10 rebounds in his previous four games.\n\nDarren Collison finished with 11 points and eight assists for Indiana, which improved to 23-12. Trae Young had 17 points and nine assists for Atlanta, which dropped to 9-24.\n\n\"It's a good measuring stick for us,\" Bazemore said. \"We came up a little short, just the small things that get you over the hump. We're learning. We're growing.\"\n\nTIP-INS\n\nPacers: It was Indiana's fourth victory in its last 21 games at Atlanta. ... Evans missed the previous two games with a right knee bruise. ... Sabonis finished two rebounds shy of his 16th double-double. He already has matched his total from last season. ... Sabonis was averaging 9.6 rebounds, tops among players who have started fewer than half their games. He has made one start in 33 games.\n\nHawks: Collins returned to the lineup after missing the past two games with a left ankle sprain. He turned the same ankle during the preseason and missed the first 15 games. He has a double-double in nine of his last 10 games. ... Bazemore took a career-high 25 shots from the field. ... Atlanta leads the league in turnovers and committed 20, leading to 24 points for Indiana. ...  Dedmon started in place of Alex Len, sidelined by a sore back. ... F Omari Spellman had five points in seven minutes after missing eight games with right hip soreness.\n\nUP NEXT\n\nPacers: Host Detroit on Friday.\n\nHawks: Visit Minnesota on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995369.3401978
}