{
  "game_id": "0021500301",
  "espn_id": "400828188",
  "date": "Dec 06, 2015",
  "matchup": "LAL @ DET",
  "headline": "Caldwell-Pope, Drummond help Pistons beat Lakers 111-91",
  "body": "AUBURN HILLS, Mich. -- With the focus on Kobe Bryant's last visit to Detroit, the Pistons showed they are turning into a pretty good basketball team.\nKentavious Caldwell-Pope scored 22 points, Andre Drummond added 18 points and 15 rebounds, and the Pistons beat the Los Angeles Lakers 111-91 Sunday.\nReggie Jackson added 20 points as the Pistons won their fourth straight.\n\"We know that if we really want to be a contender, we need to keep playing this way,\" Jackson said. \"We are beating the teams we need to beat, and we've been doing the right things on offense. Now we have to go down to Charlotte and beat a really good defensive team.\"\nThe Pistons swept a four-game home stand, beating the Rockets, Suns, Bucks and Lakers.\n\n\"To get all four is obviously good,\" Pistons coach Stan Van Gundy said. \"Tomorrow is going to be a challenge, because we're going on the road on the second half of a back-to-back and we're playing a team that's one of the best in the league on both ends.\"\nLou Williams scored 21 points and Julius Randle added 15 points and 11 rebounds as Los Angeles lost for the ninth time in 10 games.\n\"We're just getting off to terrible starts,\" Lakers coach Byron Scott said. \"We're not coming out ready to play, and that's something that can't continue if we want to win some games.\"\nBryant missed much of the Lakers' pregame warmups while battling a stomach bug, and needed an IV after the game before talking to the media.\n\"If it wasn't my last season, I probably wouldn't have played,\" he said.\nBryant received a standing ovation before the game, when the arena went dark while Pistons public address announcer John Mason read off his long list of achievements, graciously skipping the loss to Detroit in the 2004 Finals.\nBryant missed his first nine shots, and when he finally made one -- a 3-pointer midway through the third quarter -- the fans gave him his second ovation of the night and a brief \"KO-BE\" chant broke out.\n\"This entire process has made me more mature,\" Bryant said about the reception he has received on his farewell tour. \"It helped me realize how fortunate I've been to play this sport.\"\nHe finished with five points on 2-of-15 shooting.\nDrummond had his 12th game of at least 15 points and 15 rebounds. Anthony Davis is second in the league with four.\nThe Pistons opened the game with a 15-0 run over the first 3 minutes. That included a play where Bryant dribbled the ball at the top of the key while surveying the defense, and Jackson slid over to make a clean steal and broke back the other way for a basket.\nThe Lakers briefly got themselves back into the game, but with Bryant missing all seven of his first-half shots, Detroit was able to build a 65-42 lead at the break.\nThe Pistons expanded it to 90-65 after three, although Bryant drew another cheer and chant when he made a simple fast-break layup late in the quarter.\n\"It was tough, because that's the league's ultimate competitor, and now he's winding down,\" Jackson said. \"It is going to feel really strange to play in a league next year that doesn't have him in it.\"\nThe most excitement of the fourth quarter came when Nick Young shoved Anthony Tolliver after a hard foul. Metta World Peace was on the bench and didn't get involved as Marcus Morris quickly broke things up. Young was ejected.\n\"I thought Nick probably over-reacted a little bit,\" Scott said.\nYoung agreed, saying he was frustrated by the score more than the foul itself.\nTIP INS\nLakers: Bryant's first game at The Palace of Auburn Hills wasn't for the Lakers. In the spring of 1993, he played in Magic Johnson's Roundball Classic -- a high school All-Star game. ... Larry Nance Jr. didn't play due to a sore knee.\nPistons: Steve Blake had a four-point play to give the Pistons a 20-point lead midway through the second quarter, thanks to a bad foul by Williams. ... Detroit is now 12-9, the first time they have been three games over .500 since starting 3-0.\nUP NEXT:\nLakers: At Toronto on Monday\nPistons: At Charlotte on Monday.",
  "source": "espn_api",
  "crawled_at": 1764994302.7662349
}