{
  "game_id": "0021900623",
  "espn_id": "401161265",
  "date": "Jan 17, 2020",
  "matchup": "MIA @ OKC",
  "headline": "Nunn's 22 points lead Heat past Thunder, 115-108",
  "body": "OKLAHOMA CITY --  Kendrick Nunn continues to make good things happen for the Miami Heat.\n\nThe rookie guard scored 22 points to help the Heat top the Oklahoma City Thunder 115-108 on Friday night.\n\nNunn, the two-time Eastern Conference rookie of the month, was coming off a 33-point effort Wednesday in a win over San Antonio. Against the Thunder, he made 9 of 17 shots, including 3 of 5 3-pointers.\n\nHeat forward Jimmy Butler said Nunn's success and confidence come from hard work.\n\n\"Whether you're on the defensive end and you're working on the schemes of everything, or it's the offense and you're getting in your bag and you're working on shooting the ball -- he's constantly in the gym working on his game,\" Butler said. \"He will be in this league for a while.\"\n\nBam Adebayo had 21 points and eight rebounds to help the Heat win their second straight. Butler added 14 points and 10 rebounds.\n\nEven with the second-best record in the Eastern Conference, the Heat had struggled a bit on the road. They evened their record at 11-11 away from home.\n\n\"This is a good one for sure,\" Heat forward Duncan Robinson said. \"This is a tough place to win.\"\n\nDanilo Gallinari scored 27 points and Shai Gilgeous-Alexander and Dennis Schroder each had 18 for the Thunder, who lost for the third time in four games.\n\n\"They were more physical,\" Thunder guard Chris Paul said. \"They cut harder. They just -- they beat us from the jump ball.\"\n\nMiami led 61-47 at halftime behind 16 points from Adebayo on 7-for-8 shooting. The Heat entered the fourth quarter with a 92-78 edge.\n\nMiami expanded its lead to 105-83 with 8 minutes remaining before the Thunder made a push. Oklahoma City cut the deficit to seven on a 3-pointer by Paul with just over 2 minutes remaining but never got closer.\n\n\"Home teams are always going to make a run,\" Heat coach Erik Spoelstra said. \"This team is too good, too well coached, too many good players -- it's not going to be just a runaway going down the stretch. But you can see our effort level, and you know the ice that the guys are putting on right now -- it's well earned.\"\n\nThe Thunder have started a troublesome habit of digging holes for themselves at home. They fell behind by 32 against the Los Angeles Lakers last Saturday and 30 against the Toronto Raptors on Wednesday before trailing by 22 on Friday.\n\nEach time, significant rallies fell short.\n\n\"We've got to figure it out because this kind of sucks right now,\" Paul said.\n\nTIP-INS\n\nHeat: The team said Justise Winslow will miss at least two more weeks while recovering from a back injury that has allowed him to play just one game since Dec. 4. The team originally called Winslow's injury a back strain, then updated the diagnosis to a bone bruise. He's averaging 11.3 points, 6.6 rebounds and 4.0 assists in 11 games this season.\n\nThunder: C Steven Adams did not play. He left Wednesday's game against the Toronto Raptors with a right knee contusion. He averages 11.8 points 10.0 rebounds and 1.2 blocks. ... C Nerlens Noel returned to action. He missed the previous six games with a left ankle sprain. ... Noel opened the scoring with his first 3-pointer of the season. ... G Terrance Ferguson left the game ill and did not return. ... Coach Billy Donovan was called for a technical early in the third quarter.\n\nSUBPAR STARTS\n\nThe Thunder allowed 41 points in the first quarter against the Lakers, who were without LeBron James and Anthony Davis. They gave up 38 points in the first quarter against Toronto before surrendering 40 points in the opening period against the Heat. The three teams shot a combined 65.3% in those first quarters (47 for 72).\n\nHE SAID IT\n\nSpoelstra, on his team's approach late: \"You don't want to try to be passive to try to win. Down the stretch, even as they started to step up their pressure, I liked the guys' aggressiveness, and we took and hunted for some 3s.\"\n\nUP NEXT\n\nHeat: Visit San Antonio on Sunday.\n\nThunder: Host Portland on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995511.1692228
}