{
  "game_id": "0021500740",
  "espn_id": "400828627",
  "date": "Feb 03, 2016",
  "matchup": "OKC vs. ORL",
  "headline": "Russell Westbrook sizzles to lead Thunder to 12th win in 13 games",
  "body": "OKLAHOMA CITY -- With the ball in Kevin Durant's hands in the final seconds, Oklahoma City coach Billy Donovan didn't call a timeout. Instead, he let one of his superstars do his thing.\nDurant made that decision pay off. He hit a 3-pointer with just a half-second on the clock to give the Thunder a wild 117-114 win over the Orlando Magic on Wednesday night.\nDurant's buzzer-beater capped his 37-point outing for Oklahoma City, which has won five straight and 12 of its past 13. Durant extended his streak of games with 20 or more points to 36, the longest run in the NBA.\n\nOklahoma City's other superstar, Russell Westbrook, posted his third straight triple-double with 24 points, a career-high 19 rebounds and 14 assists. He has eight triple-doubles this season, five coming in the last 11 games. It was the 27th triple-double of his career, moving him into a tie with Rajon Rondo for second place among active players, behind only LeBron James with 39.\n\"When you have the two players [Donovan] has, you don't need a timeout,\" Orlando coach Scott Skiles said. \"Just give them the ball and get out of the way.\"\nVictor Oladipo scored 37 points -- just one off his career high -- to lead Orlando, which has lost 14 of its last 16 games. The Magic have dropped nine of their last 10against Oklahoma City, including a double-overtime thriller in Orlando on Oct. 30, in which they blew an 18-point fourth-quarter lead.\nOrlando led into the final minute on Wednesday before Westbrook tied the game at 114 with a driving layup with 29.4 seconds left. Oklahoma City's Serge Ibaka then blocked a layup attempt by Oladipo and Dion Waiters grabbed the rebound for the Thunder.\n\"There it is,\" Skiles said. \"We drove to the basket and they blocked it. Westbrook drove to the basket and laid the ball in.\"\nWaiters quickly passed the basketball to Durant, who stopped about 28 feet from the basket and knocked down the 3-pointer to put Oklahoma City ahead, saying he \"just felt comfortable with the shot when I let it go.\"\nAfter a timeout, Oladipo missed a well-guarded 3-point attempt at the buzzer.\nDurant deflected attention to Ibaka and Westbrook, saying they also made winning plays.\nIbaka \"set (Oladipo) up for that block,\" Durant said. \"That was a huge play. Russell made a huge play right before that, grabbing that rebound and calling timeout, and then also making a layup. That set me up for the shot at the end. There's much more than just me making that shot.\"\nIbaka finished with six blocks to go with nine points and seven rebounds for Oklahoma City, while Enes Kanter had 13 points. Hezonja and Nikola Vucevic each scored 16 points for Orlando, while Tobias Harris added 15 and Smith, 13.\nWESTBROOK ON THE BOARDS\nWestbrook's 19 rebounds weren't only his career high, but the most by a point guard since Jason Kidd had 19 on Nov. 16, 2007, also against Orlando, according to STATS LLC. The last player with a primary career position of point guard to record 20 or more rebounds in a game was Fat Lever, who had 22 on April 20, 1990, against San Antonio.\nWestbrook said there's no particular secret to his rebounding.\n\"I go get the ball, man,\" he said. \"I don't have a method. I just try to work harder than the next guy and go out and compete at a high level every night. That's it.\"\nTIP-INS:\nMagic: Center Dewayne Dedmon sat out after spraining a foot during Orlando's practice on Tuesday. Coach Scott Skiles said he didn't think Dedmon's injury was long-term. ... Oladipo was called for a technical foul in the third quarter for complaining about a no-call, and about four minutes after that, Elfrid Payton also received a technical after being called for a foul. ... Smith was called for a flagrant foul for pushing Steven Adams on a second-quarter shot attempt.\nThunder: Durant moved into 91st place on the NBA's all-time scoring list with 16,744 points, passing Latrell Sprewell (16,712). Durant is 13 points behind No. 90 Elton Brand. ... Durant spent Tuesday night watching No. 1 Oklahoma rout TCU in Norman. ... Oklahoma City has won eight straight home games.\nUP NEXT:\nMagic: Host the Los Angeles Clippers on Friday\nThunder: Visit the Golden State Warriors on Saturday",
  "source": "espn_api",
  "crawled_at": 1764994159.396375
}