{
  "game_id": "0022000883",
  "espn_id": "401307681",
  "date": "Apr 21, 2021",
  "matchup": "PHX @ PHI",
  "headline": "Paul, Booker lead Suns past undermanned 76ers, 116-113",
  "body": "PHILADELPHIA -- — Joel Embiid grabbed a two-handed rebound, turned and heaved an 85-foot, right-handed strike with a throw ripped from Bryce Harper's playbook that banked off the glass and rattled off the front and back of the rim and out.\n\n\r\n                    The Philadelphia center was flat on his back in disbelief over the near-make that would have sent the game to overtime.\n\n\r\n                    “It would have made for a long flight, long night and not a lot of sleep,\" Suns coach Monty Williams said.\n\n\r\n                    Rest easy, Phoenix.\n\n\r\n                    Chris Paul, Devin Booker, Mikal Bridges and the Suns walked off winners on the road for the second time this week against one of the top teams in the East. Paul scored 28 points, Booker had 19 and Bridges 18 to lead the Phoenix Suns to a 116-113 victory over Philadelphia on Wednesday night.\n\n\r\n                    Embiid had 38 points and 17 rebounds and one oh-so-close shot.\n\n\r\n                    ‘When I threw it, it looked good,\" Embiid said.\n\n\r\n                    Paul, a 93% free-throw shooter, missed one from the line that would have sealed the win instead of giving Embiid a glimmer of highlight-reel hope.\n\n\r\n                    “If you’re up three, I always want to make the free throw to go up four,” Paul said. “That shot was in-and-out. I ain’t never seen anything like it.”\n\n\r\n                    Neither had the rest of the Suns.\n\n\r\n                    “That was a heck of a display of a throw right there,” Suns forward Cameron Johnson said.\n\n\r\n                    Said Bridges: “I don't know how I would have reacted. That was crazy.”\n\n\r\n                    The Suns improved their NBA-best road record to 19-7 and are second overall at 42-16 — 1 1/2 games behind Utah for the league lead.\n\n\r\n                    Paul hit five 3s and Bridges, a former Villanova standout, continued to haunt the Sixers three years after an ill-fated draft-night deal. The Sixers selected Bridges with the 10th overall pick in 2018 — a feel-good story because of the Nova connection and his mother worked for the 76ers’ parent company. Zhaire Smith played only 13 NBA games and is out of the league while Bridges turned into a breakout star for the blossoming Suns.\n\n\r\n                    The Sixers again played without starters Ben Simmons (unspecified illness) and Tobias Harris (right knee). Simmons missed his second straight game and Harris his third, the Sixers certainly secure enough in playoff spot to the point they don’t have to rush either one back. Seth Curry also missed the game with a left hip flexor -- three starters down certainly one reason why  had the Suns as three-point favorite.\n\n\r\n                    The Sixers would certainly like all three back in time for this week’s two-game set in Milwaukee. Shake Milton, Furkan Korkmaz, and Matisse Thybulle joined Embiid and Danny Green (18 points) in the lineup.\n\n\r\n                    \"I know we got a lot of guys out, but we still want to win the game,\" 76ers coach Doc Rivers said.\n\n\r\n                    Embiid left in the third when he slammed his left knee on the court and sat behind the basket with a towel around his leg. He rested on his back and stretched his knee as the teams went basket-for-basket. Embiid jogged in place on the baseline and played cheerleader as the short-handed Sixers tried to hang with the Suns. Embiid has missed 18 games this season with injuries, notably a bone bruise on his right knee that cost him 11 games after the All-Star break.\n\n\r\n                    Rivers said he did not know who would be available for both games against the Bucks.\n\n\r\n                    Paul buried consecutive 3s for an 85-81 lead in Embiid’s absence and the All-Star center did not check back in until a shade over 6 minutes left the game and the Sixers down seven. Embiid buried a 3 in a late-game lineup in which he was the only regular starter. \n\n\r\n                    The Suns, coming off an overtime win in Milwaukee, got big baskets down the stretch from Booker -- including a nice bank off the glass and he swished a fall-away jumper for the dagger with 13 seconds left in the game. \n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Rivers, who stumped for Joe Biden during his campaign President, welcomed the guilty verdict of the former Minneapolis police officer convicted of murder and manslaughter in the death of George Floyd. “The fact that we celebrated a man who committed murder is going to jail, I thought about that last night and I’m not so sure if we’ve come a long way or we have a long way to go,” Rivers said. Rivers said he talked to the team about the verdict and felt “it was my responsibility” as coach to discuss current events with his players. \n\n\r\n                    Suns: Count Rivers among the fans of Williams. “Monty is a terrific coach. When you talk to other coaches and who you have to prepare for, who runs good stuff, Monty’s name always comes up. Now he has the talent,” Rivers said. The Suns will make the playoffs for the first time sine 2010. ... Jae Crowder left the game with a sprained right ankle. \n\n\r\n                    UP NEXT\n\n\r\n                    Suns: At Boston on Friday night.\n\n\r\n                    76ers: At Milwaukee on Thursday night and Saturday.\n\n\r\n                    ----",
  "source": "espn_api",
  "crawled_at": 1764997735.1187232
}