{
  "game_id": "401810175",
  "espn_id": "401810175",
  "date": "Dec 02, 2025",
  "matchup": "BOS vs NY",
  "headline": "Celtics hold off late Knicks charge to win 123-117 in rematch of East semifinal",
  "body": "BOSTON -- — Jaylen Brown scored a season-high 42 points, sealing the game with a breakaway dunk in the final seconds Tuesday night as the Boston Celtics beat the New York Knicks 123-117 in a rematch of last season's Eastern Conference semifinal.\n\n\r\n              Derrick White scored seven of his 22 points in the last four minutes, after the Celtics turned back a New York charge that cut a 15-point deficit to 102-99. Jordan Walsh had six points and five rebounds in the fourth quarter for Boston.\n\n\r\n              Mikal Bridges scored 17 of his 35 points in the fourth and went 8 for 12 from 3-point range overall. Karl-Anthony Towns added 29 for the Knicks, who had won four in a row.\n\n\r\n              Boston has won four of its last five games, beating four of the top six teams in the Eastern Conference.\n\n\r\n              The Knicks took off to a 17-4 lead and led 39-25 before Boston scored the next 12 points and later scored seven in a row, taking a 47-46 lead on Brown’s dunk that woke up the crowd. Brown scored 18 points in the second quarter and 15 in the third.\n\n\r\n              Boston led by 18 after three and had a 102-87 advantage with eight minutes left before Bridges hit a 3-pointer and followed it with three free throws, then made another 3 to make it 102-99 and finish off a 12-0 run.\n\n\r\n              But Boston came out of a timeout with Josh Minott’s 3-pointer, then Walsh scored on back-to-back putbacks to give the Celtics an eight-point lead. Bridges hit a 3 to make it a four-point game with 46 seconds left, but he missed one on New York’s next possession with a chance to cut the deficit to one.\n\n\r\n              Up next\r\n              The Knicks host the Charlotte Hornets on Wednesday night. \n\n\r\n              The Celtics visit Washington on Thursday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042737.580597
}