{
  "game_id": "0022300623",
  "espn_id": "401585251",
  "date": "Jan 24, 2024",
  "matchup": "HOU vs. POR",
  "headline": "Anfernee Simons scores 33 points as Trail Blazers rally to beat Rockets 137-131 in overtime",
  "body": "HOUSTON -- — Anfernee Simons scored 33 points and Jerami Grant added 21 as the Portland Trail Blazers rallied to beat the Houston Rockets 137-131 in overtime on Wednesday night. \n\n\r\n              “So many great efforts and I’m just proud of our guys,” Portland coach Chauncey Billups said.\n\n\r\n              Portland opened overtime with a 9-2 run, with five points from Malcolm Brogdon, to take a 133-126 lead with about two minutes left in the extra session.\n\n\r\n              The Rockets got a free throw from Alperen Sengun and a layup from Fred VanVleet to cut the lead to four points with less than a minute left in OT.\n\n\r\n              But Deandre Ayton tipped in a shot with 10 seconds remaining to give Portland a 135-129 lead, and the Trail Blazers held on for the win.\n\n\r\n              Brogdon had 19 points and Ayton added 18 points and 17 rebounds for the Trail Blazers, who snapped a two-game skid.\n\n\r\n              “Malcolm is just Mr. Reliable for us,” Billups said. “He makes shots when we need it. ... He makes plays when we need it. He just does it all for us. He’s a savvy veteran who can impact games.”\n\n\r\n              Sengun had 30 points, 10 rebounds and eight assists, and Jalen Green scored 29 as the Rockets dropped a second straight game.\n\n\r\n              “This was a game we should have won tonight,” Green said. “But things happen, and we've got to bounce back.”\n\n\r\n              Brogdon hit a 3-pointer to cut the lead to a point with 3 seconds to go in regulation. Aaron Holiday made two free throws with 1.1 seconds remaining to push Houston’s lead to 124-121.\n\n\r\n              But Grant forced overtime when he hit an off-balance 3-pointer at the buzzer.\n\n\r\n              “The shot was incredible that he hit,” Billups said. “Great players make coaches look good. He hit a heck of a shot. He just rose up and knocked it down.”\n\n\r\n              Portland used a 6-0 run, with the last four points from Ayton, to take a 116-114 lead with 2½ minutes remaining in the fourth.\n\n\r\n              Houston trailed by two points before Sengun made a basket and then got a steal at the other end. Green made a layup to put Houston on top before the Rockets forced another turnover.\n\n\r\n              Sengun added another bucket after that to put the Rockets up 120-116 with about 90 seconds to go.\n\n\r\n              Brogdon made a basket for before Sengun scored again, giving Houston a 122-118 advantage with less than a minute left.\n\n\r\n              “We've just got to guard better,” VanVleet said. “Our defense wasn't very good.”\n\n\r\n              VanVleet added 18 points with seven assists and six rebounds for the Rockets in his return after missing a game with lower back tightness. Jabari Smith Jr. sat out for a second straight game for Houston with a sprained left ankle.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At San Antonio on Friday.\n\n\r\n              Rockets: At Charlotte on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995607.3542988
}