{
  "game_id": "0021600095",
  "espn_id": "400899545",
  "date": "Nov 07, 2016",
  "matchup": "CHA vs. IND",
  "headline": "Hornets roll over Pacers 122-100 behind strong first half",
  "body": "CHARLOTTE, N.C. --  There was a point midway through the first quarter when Paul George began to wonder if the Indiana Pacers were ever going to keep the Charlotte Hornets from scoring.\n\nKemba Walker had 24 points and 10 assists, and the Hornets scored on their first 12 possessions to build a 21-point lead in the first quarter on their way to a 122-100 rout of the listless Pacers on Monday night.\n\nCharlotte scored on every possession until Marvin Williams missed a jumper with 5:48 left in the first. By that point, the Hornets led 30-14 and were already on their way to a lopsided victory.\n\n\"We couldn't get a stop and we couldn't get a break,\" George said. \"It's concerning that they are scoring and no one cares. No one cares. We are looking bad. We are terrible right now.\"\n\nCharlotte, meanwhile, is looking pretty good under fourth-year coach Steve Clifford.\n\nThe Hornets (5-1) tied a 23-year franchise record with 75 points in the first half on 56.5 percent shooting and are off to the best start in franchise history.\n\nCharlotte scored 35 points off 18 Indiana turnovers.\n\n\"We know the formula,\" said Charlotte center Spencer Hawes, who had 13 points and 13 rebounds. \"The way we move the ball when we're playing defense, we'll do well. That's what we have to do moving forward because when we do that, we do pretty well.\"\n\nCharlotte's starters were 17 of 25 from the field before halftime as the Hornets established a 20-point lead and never looked back.\n\n\"We're all out of whack. There's no trust, there's no chemistry, there's no belief. We're kind of just lifeless right now,\" George said.\n\nTIP-INS\n\nPacers: C.J. Miles led the Pacers with 23 points, while Al Jefferson had 12 points and nine rebounds in his return to Charlotte. ... Indiana shot only 15 free throws, compared to Charlotte's 32.\n\nHornets: Have won four straight against the Pacers. ... Treveon Graham scored his first NBA points when he knocked down a 3-pointer from the left wing.\n\nKIDD-GILCHRIST HURTS BACK\n\nMichael Kidd-Gilchrist made all four shots from the field and all five free throws and had 13 points before leaving the game in the third quarter with a lower back injury.\n\nClifford said Kidd-Gilchrist is day to day.\n\n\"He's sore,\" Clifford said. \"He wanted to keep playing. But he was laboring out there and we can't have him hurt. He's been sore. Hopefully, he'll get treatment and we'll see how he feels.\"\n\nROAD WOES\n\nIndiana is 0-4 on the road this season, losing those games by an average margin of 16.5 points.\n\nPacers coach Nate McMillan said he can't explain his team's inconsistency away from home.\n\n\"We play a really good ballgame (against Miami) and we get on the road and we haven't even been in these games,\" McMillan said. \"It's something we need to look at.\"\n\nTOUCHING TRIBUTE\n\nThe Hornets put together a nice video tribute to Jefferson and showed it on the scoreboard during the first quarter. The crowd responded with a standing ovation. Jefferson played three seasons for the Hornets before signing last offseason with the Pacers.\n\n\"It was very touching. It was cool,\" Jefferson said. \"It was good to know that they appreciate the time I spent here. It was cool and I was glad to see it.\"\n\nPICK AND ROLL\n\nThe Hornets effectively used the pick and roll to beat the Pacers.\n\n\"It gets back to the same thing -- when we're taking 3s when the ball hits the paint and we have the ability to go to the basket, where we're very difficult to guard,\" Clifford said. \"When we have those possessions where the ball sticks a little bit or it's not a good screen or not a good attack and you play around the perimeter ... then you put no pressure on the defense.\"\n\nUP NEXT\n\nPacers: Return home to face Philadelphia on Wednesday night, where they are 3-0 this season.\n\nHornets: In the midst of a three-game homestand and host the Utah Jazz on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764995548.665827
}