{
  "game_id": "0022300481",
  "espn_id": "401585109",
  "date": "Jan 05, 2024",
  "matchup": "BKN vs. OKC",
  "headline": "Nets open 32-point lead, beat Thunder 124-115 to end 5-game losing streak",
  "body": "NEW YORK -- — The Nets hadn't won in the new year and their leading scorer hadn't even made a shot.\n\n\r\n              Everything changed quickly Friday night.\n\n\r\n              Spencer Dinwiddie and Nic Claxton each scored 23 points and Brooklyn snapped a five-game losing streak by beating the Oklahoma City Thunder 124-115. \n\n\r\n              Cam Thomas broke out of a 0-for-20 shooting slump with 19 points, including 16 in the Nets' most dominant first half of the season. They led 75-47 at the break and by 32 in the third quarter.\n\n\r\n              “First win in ’24. You’ve got to start somewhere, so what better place than to beat a team that beat us a couple days ago, one of the top teams in the West, maybe in the league. So this was major,” said Dennis Smith Jr., who had 13 points, 12 rebounds and seven assists. \n\n\r\n              Shai Gilgeous-Alexander had 34 points, nine assists and six rebounds for the Thunder, who have dropped two straight after a five-game winning streak. Jalen Williams added 20 points and Chet Holmgren had 17. \n\n\r\n              The Nets' skid started with a 144-122 home loss to Milwaukee on Dec. 27, when they rested three starters and didn't play Thomas — a starter at the time — or Mikal Bridges after the first quarter. They were fined $100,000 on Thursday, the first team penalized for violating the league’s player participation policy that went into effect this season.\n\n\r\n              The Nets followed that with an 0-4 trip and had just two victories — consecutive games against Detroit near the end of the Pistons' record-tying 28-game losing streak — in their previous 12 games.\n\n\r\n              But they rolled through most of this one, surpassing 100 points in three quarters for second time this season. Claxton grabbed 13 rebounds and Bridges scored 17 points.\n\n\r\n              “They were just the aggressor in the game on both ends of the floor I thought,” Thunder coach Mark Daigneault said. “Really credit them, they’d struggled lately and they did a great job of attacking the game and setting a tone for the game.” \n\n\r\n              The Thunder beat the Nets on New Year's Eve, wrapping up a 10-3 December that helped earn Gilgeous-Alexander the Western Conference player of the month and Holmgren the West's rookie of the month, making the Thunder the first team to win both monthly honors since the Knicks in the 2012-13 season.\n\n\r\n              But after opening the new year by beating NBA-leading Boston on Tuesday night, the Thunder have dropped the first two on their four-game road trip, \n\n\r\n              Thomas missed his final two shots in the first game against the Thunder, was 0 for 11 in a blowout loss in New Orleans and followed by going 0 for 7 Wednesday at Houston. But he had an easy first shot with a layup off a Thunder turnover, sending him to a 3-for-3 start, and he was 6 for 9 in 13 minutes of the first half. \n\n\r\n              “That’s just the type of player that he is,” Claxton said Thomas, who came in averaging 20.8 points. “Especially once he sees those first one or two go in, I feel like the rim just gets a little bigger for him.” \n\n\r\n              It was tied at 14 midway through the first quarter before the Nets broke free with a 19-1 run, going ahead 33-15 on Thomas' jumper with 1:59 left in the period. The Nets led 75-47 on Cam Johnson's 3-pointer with 29 seconds to go in the half.\n\n\r\n              Lonnie Walker IV played six minutes after missing the last 17 games with a strained left hamstring, but Johnson left late with cramping in his left hamstring. \n\n\r\n              UP NEXT\n\n\r\n              Thunder: At Washington on Monday night.\n\n\r\n              Nets: Host Portland on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996349.909903
}