{
  "game_id": "0022400459",
  "espn_id": "401705025",
  "date": "Jan 01, 2025",
  "matchup": "TOR vs. BKN",
  "headline": "Barnes scores 33, Quickley has 21 in return as Raptors beat Nets 130-113, snap 11-game slide",
  "body": "TORONTO -- — Scottie Barnes had 33 points and 13 rebounds and the Toronto Raptors snapped an 11-game losing streak by beating the Brooklyn Nets 130-113 on Wednesday night.\n\n\r\n              Immanuel Quickley returned to the lineup for Toronto and contributed 21 points and a season-high 15 assists. He played for just the fourth time this season, returning after missing 22 games because of a torn ligament in his left elbow.\n\n\r\n              Gradey Dick scored 22 points and Ochai Agbaji added 14 as Toronto won for the first time since a home win over Indiana on Dec. 3.\n\n\r\n              The Raptors were coming off a franchise-worst 54-point loss at Boston on New Year’s Eve. Toronto scored 71 points against the Celtics, the fewest by any NBA team this season.\n\n\r\n              Cam Johnson scored 24 points and D’Angelo Russell had 22 in his return to Brooklyn but the Nets lost their third straight and 11th of 14. \n\n\r\n              Russell was acquired from the Lakers on Dec. 29, rejoining the team he played from 2017 to 2019.\n\n\r\n              Keon Johnson scored 17 points and Nic Claxton had 16 points and 10 rebounds as the Nets lost their second straight on the road.\n\n\r\n              Takeaways\r\n              Nets: Noah Clowney (lower back) did not return after a hard fall late in the third quarter. Maxwell Lewis had to be helped off after appearing to injure his left knee late in the fourth.\n\n\r\n              Raptors: Quickley missed another eight games in October and November because of a pelvic contusion.\n\n\r\n              Key moment\r\n              Quickley assisted on four straight baskets, including 3-pointers by Dick and Agbaji, as Toronto stretched a seven-point lead to 15, 114-99, with just over five minutes remaining.\n\n\r\n              Key stat\r\n              Brooklyn’s Ben Simmons scored just two points. Simmons missed his first five shot attempts of the game before making a jumper in the fourth. \n\n\r\n              Up next\r\n              Brooklyn visits Milwaukee on Thursday and Toronto hosts Orlando on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996971.136105
}