{
  "game_id": "0021600267",
  "espn_id": "400899717",
  "date": "Nov 30, 2016",
  "matchup": "DET @ BOS",
  "headline": "Caldwell-Pope scores 25 as balanced Pistons beat Celtics",
  "body": "BOSTON --  The Detroit Pistons' relaxed attitude is finally paying off with some road wins.\n\nKentavious Caldwell-Pope scored 25 points and Tobias Harris had 21 to lead balanced scoring that carried the Pistons to a 121-114 win over the Boston Celtics on Wednesday night.\n\nAndre Drummond added 20 points and 17 rebounds, one night after he was ejected in the second quarter of a victory at Charlotte for a flagrant-2 foul.\n\nMarcus Morris had 20 points and Ish Smith 19 for the Pistons, who had lost eight of their first nine road games before winning away from home on consecutive nights.\n\n\"We're having fun,\" Drummond said. \"The more we play like that the better the season is going to be.\"\n\nThe Pistons beat the Hornets by 23 points a night earlier.\n\n\"Coming in with the problems we've had on the road, to play the way we've played the last two nights against two teams that are over .500 and have good personnel, to be on a back-to-back is a heck of a win,\" Detroit coach Stan Van Gundy said.\n\nIsaiah Thomas paced the Celtics with 27 points, and Kelly Olynyk scored a season-high 19. Boston had won five of seven.\n\n\"It's disappointing, but like I said, they were making shots, man,\" Celtics guard Avery Bradley said. \"Hats off to those guys. They played well. Their starters played very well. (We've) just got to move on to the next game.\"\n\nThe Pistons shot 55.2 percent. Boston finished at 44 percent, going 15 of 42 on 3-point attempts.\n\n\"They made shots,\" Olynyk said. \"They made shots when they needed to make shots. They made them four quarters in a row.\"\n\nDetroit used a 9-0 spree midway through the fourth quarter to open a 103-95 edge with 5:08 to play after Boston went on an 11-0 run to take its first lead since early in the opening period. Morris and Harris each hit a 3-pointer during the Pistons' spurt.\n\nDetroit pushed its lead to 112-101 on Smith's basket before Boston closed within four points in the final 30 seconds.\n\nThe Pistons were shooting better than 55 percent midway through the third quarter and opened their biggest lead of the game, 90-80, on Jon Leuer's dunk.\n\nBoston center Al Horford returned after missing Monday's win at Miami due to the birth of his second child. He scored nine points.\n\nTIP-INS\n\nPistons: Van Gundy said G Reggie Bullock hasn't gotten an appointment yet for a second opinion on the torn meniscus in his left knee.\n\nCeltics: Coach Brad Stevens said there was no longer a limit on F Jae Crowder's minutes in his sixth game back from a sprained left ankle. ... G Marcus Smart went down to the floor hard early in the fourth, but walked slowly to the bench during a stoppage.\n\nSIMPLE FORMULA\n\nThe Pistons outrebounded Boston 52-33 and had a 13-9 edge on the offensive glass.\n\n\"That's been a key for us,\" Van Gundy said. \"When we've rebounded the ball well, we've won. When we haven't, we haven't won.\"\n\nGET BETTER\n\nThe Pistons reached the .500 mark (10-10), but Smith said they can play a lot better.\n\n\"It's not bad. We've got so much room for improvement,\" he said. \"We've been a really good home team, defensively at home. We can get so much better.\"\n\nLOOKING GOOD\n\nOlynyk shot the ball well despite having a cut on his right elbow that he sustained Monday in Miami. He had it wrapped and went 7 for 9 from the floor.\n\n\"It's good,\" Olynyk said. \"Obviously tender.\"\n\nUP NEXT\n\nPistons: At Atlanta on Friday in the finale of a three-game road trip before they return home for two straight.\n\nCeltics: Host Sacramento on Friday before they head on the road for three in a row. The Kings' scheduled game at Philadelphia on Wednesday night was postponed due to condensation on the court.",
  "source": "espn_api",
  "crawled_at": 1764996075.0146718
}