{
  "game_id": "0022000830",
  "espn_id": "401307625",
  "date": "Apr 14, 2021",
  "matchup": "BKN @ PHI",
  "headline": "Embiid, 76ers top undermanned Nets 123-117 for 1st in East",
  "body": "PHILADELPHIA -- - The Nets played without starters from the opening tip. The 76ers tried to rest theirs in the fourth quarter.\nBut with Brooklyn's deep reserves making it a game late between the two top teams in the East, Ben Simmons and Joel Embiid checked in to bail out the checked-out Sixers.\nEmbiid had 39 points and 13 rebounds and Philadelphia beat Brooklyn 123-117 on Wednesday night in an anticipated matchup that fizzled with the Nets missing their biggest stars.\n\"When the playoffs start, it's a whole new beast. And we'll be ready for them,\" 76ers coach Doc Rivers said. \"And I'm sure they'll be ready for us.\"\nThe Sixers (38-17) moved into first place in the Eastern Conference and hold the tiebreaker in a game played without James Harden, Kevin Durant, Blake Griffin and LaMarcus Aldridge. With the Nets standouts hurt or just rested, the game had more of a preseason feel than a possible preview of the conference final this summer.\nNo matter, the Sixers moved back atop the standings and have the No. 1 seed in sight with just 17 games left this season.\n\"It makes sense to try and have as many home games as possible,\" Rivers said.\nWith good reason -- the Sixers improved to 21-5 at home.\n\"I think they're comfortable at home,\" Rivers said. \"Young teams typically are comfortable at home. I guess the surprise this year is (the record) without the fans. I certainly can understand with the fans.\"\nThe Sixers had 4,094 fans spread around the arena to watch Embiid have another stellar outing against the undermanned Nets. He scored 21 points by halftime, his 14th 20-point 1st half this season (most in NBA).\nKyrie Irving scored 23 points in the first half -- his eighth 20-point first half of the season -- and finished with 37 points. Irving missed Tuesday's game against Minnesota for personal reasons. Irving, though, sat out as the deep reserves helped the Nets rally from 22 points down to make it 118-115 with 1:15 left.\nLandry Shamet scored 17 points, and DeAndre Jordan had 12 points and 14 rebounds.\n\"I didn't want to take the group out that was doing so well,\" Nets coach Steve Nash said. \"I wanted to reward those guys for playing as well as they did.\"\nEmbiid and Simmons,, who scored 17 points, watched the bulk of the fourth from the bench until they were pressed into service over the final 5 minutes. Embiid sealed the win from the free-throw line to the tune of \"M-V-P!\" chants.\n\"They should not have had to come back in,\" Rivers said.\nSimmons said the Sixers have \"got to close our games.\"\n\"We've got to lock in that fourth quarter,\" Simmons said.\nHarden is out with a strained right hamstring and Durant got a night off after playing 27 minutes against the Timberwolves. The Nets are taking it easy with Durant as he comes back from a nagging left hamstring injury.\nYes, the Nets might still be the betting favorite to win the championship - had them Wednesday night as 11-5 favorites - but pushing for the No. 1 seed isn't worth the tradeoff of having a healthy roster for the postseason.\n\"It'd be great to have the No. 1 seed. I think it means a lot, it's valuable,\" Nash said. \"But not at the expense of losing players or prolonging our injury situation. So I think we have to be very careful and make sure that our guys get to the finish line as whole as possible.\"\nNash brushed off suggestions the Nets held out Durant to keep the Sixers guessing how they might look as close to a full unit in the playoffs.\n\"I think when you start to really try to be cute, it backfires most of the time,\" he said. \"It wasn't strategic. It was, this is what this is the availability we have.\"\nTobias Harris made all six shots in the second quarter and scored 13 of his 26 points to help the Sixers start to open up the game. Simmons closed the third on fastbreak dunk for a 94-84 lead that got a rise out of the small and enthusiastic crowd.\nTIP-INS\nNets: Also played without Tyler Johnson, Spencer Dinwiddie and Chris Chiozza. Chiozza had surgery Wednesday on his right hand after he was injured against the Timberwolves.\n76ers: C Dwight Howard sat out with left knee soreness. ... DJ Jazzy Jeff rang the ceremonial bell. ... Harris said he's dealing with a nagging knee injury.\nSPEAKING OUT\nRivers continues to speak out against police brutality and said there needed to be reform in police unions following the death of 20-year-old Black motorist Daunte Wright in a shooting in Minnesota.\n\"I think that's where our energy should go, because we have to take out this situation where you feel like you will get away with murder because you're protected,\" Rivers said. \"When you take that away, I think there would be change.\"\nUP NEXT\nNets: host Charlotte on Friday.\n76ers: host the Los Angeles Clippers on Friday.\n------",
  "source": "espn_api",
  "crawled_at": 1764997478.9503732
}