{
  "game_id": "0022301164",
  "espn_id": "401585792",
  "date": "Apr 10, 2024",
  "matchup": "MIN @ DEN",
  "headline": "Jokic scores 41 points and leads Nuggets past Timberwolves 116-107 to take lead in West",
  "body": "DENVER -- — Nikola Jokic minimized the matchup between teams tied atop the Western Conference standings, then put on a show for the ages — and for anyone still doubting he's the best player on the planet.\n\n\r\n              The odds-on favorite to win a third MVP trophy, Jokic registered his 20th career 40-point game in powering the Denver Nuggets past the Minnesota Timberwolves 116-107 on Wednesday night.\n\n\r\n              Scoring 41 points to go with 11 rebounds and seven assists, Jokic made 16 of 20 shots against the NBA's best defense while being guarded most of the night by the league's top defender, Rudy Gobert, along with Naz Reid. All of it in front of the 41st sellout at Ball Arena and a national television audience on ESPN. \n\n\r\n              “Nikola always embraces the physicality. He never shies away from it,” Nuggets coach Michael Malone said. “Rudy Gobert is going to be a Hall of Fame player one day. Rudy Gobert is going to be regarded as one of the best defenders of his generation. And it just speaks to how great Nikola is. I don't think anybody in the NBA can guard Nikola 1-on-1.”\n\n\r\n              Jamal Murray added 20 points in 27 minutes and Michael Porter Jr. scored 18 for the Nuggets, who pulled away by holding Anthony Edwards without a bucket in the fourth quarter.\n\n\r\n              Edwards led Minnesota with 25 points but was a non-factor in the fourth as Denver's reserves put on a show featuring Peyton Watson's six blocks and Christian Braun's rim-rattling dunks. \n\n\r\n              Jokic was eager to talk about the Nuggets' closers.\n\n\r\n              “They were great,” he said. “P-Wat, it seemed like he was all over the place. He was just full of energy. And C.B., that sequence of two minutes, it was really amazing. I was happy for those guys. I think they don't get enough credit what they are doing on the floor, and they're helping us energy-wise, effort-wise. We need them.”\n\n\r\n              As for his MVP chances, which he certainly enhanced Wednesday night, Jokic demurred, saying, “I think I'm playing good basketball. The team is playing good basketball. I think there is a lot of guys playing really good basketball in the league and a couple of guys deserve to have that award.”\n\n\r\n              Edwards said Jokic kept blocking his way to the basket, so he had no choice but to dish and his teammates' shots just weren't falling: “He’s just there, so there’s nowhere for me to go,\" Edwards said. \n\n\r\n              The Nuggets (56-24) took a one-game lead over Minnesota and Oklahoma City, who are both 55-25 in the West. The Thunder walloped San Antonio 127-89 on Wednesday night to stay within striking distance of the conference's top seed.\n\n\r\n              The defending NBA champion Nuggets are a best-in-the-West 33-8 at home — where they parlayed the No. 1 seed last year into a 10-1 playoff record on their way to winning the franchise's first NBA title.\n\n\r\n              Jokic downplayed this showdown's significance, suggesting, \"I don’t think it’s a really big game.” Edwards, though, insisted this was as big as a regular-season game can get.\n\n\r\n              “We knew what this game was going to determine,” Edwards said. “If we won it, we knew we were going to possibly be the No. 1 seed, and if we lost it, we knew they’d possibly be the No. 1 seed. I think we cared before but now that we lost we can’t do nothing about it.”\n\n\r\n              Denver trailed much of the night but closed the third quarter on a 9-1 run to take an 83-80 lead into a fourth period they utterly dominated.\n\n\r\n              Entering the playoffs at optimum health is more important than going into the postseason as the top seed in the West, suggested Malone, who's been saying for weeks that he's confident his team can win anywhere, anytime, regardless of seeding.\n\n\r\n              The Wolves were at less than full strength in the playoffs a year ago but still gave the Nuggets the hardest time of any opponent on Denver's journey to the title. And regardless of what seed Minnesota ends up with, Karl-Anthony Towns (knee) is set to return to action as soon as this weekend.\n\n\r\n              So, despite this disappointment in Denver, the Timberwolves are swaggering into the playoffs instead of staggering in as they did a year ago.\n\n\r\n              “It’d be a lot easier because he’s going to get 25 points every night,” Edwards said. “He walks in the gym with 25 points.”\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Host the Atlanta Hawks on Friday night.\n\n\r\n              Nuggets: Visit the San Antonio Spurs on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996444.6145751
}