{
  "game_id": "0022400309",
  "espn_id": "401704875",
  "date": "Dec 01, 2024",
  "matchup": "MIA @ TOR",
  "headline": "Barrett scores 37, Barnes adds 23 points and 10 rebounds as Raptors beat Heat 119-116",
  "body": "TORONTO -- — RJ Barrett scored 37 points, Scottie Barnes had 23 points and 10 rebounds, and the Toronto Raptors beat the Miami Heat 119-116 on Sunday night.\n\n\r\n              Jakob Poeltl had 17 points and 11 rebounds and rookie Ja’Kobe Walter scored 12 points as Toronto improved to 5-4 at home. \n\n\r\n              Barrett shot 15 for 20 and made all four of his free-throw attempts. He finished 3 for 4 from 3-point range.\n\n\r\n              Barnes had his sixth career triple-double in Friday’s loss at Miami and narrowly missed his seventh Sunday, when he finished with nine assists.\n\n\r\n              Tyler Herro scored 31 points and Jimmy Butler added 17 but Miami lost for the first time in three games. The Heat have not won three straight so far this season.\n\n\r\n              Herro shot 6 for 12 from long range but missed a 3 that would have tied the score with 29 seconds left.\n\n\r\n              Miami’s Bam Adebayo scored 13 points and had a season-high 20 rebounds. Adebayo had a career-best 21 rebounds in a loss at Toronto on Nov. 25, 2018.\n\n\r\n              Terry Rozier scored 17 points for the Heat. Miami is 5-5 on the road.\n\n\r\n              Takeaways\r\n              Heat: Duncan Robinson shot 3 for 12 and finished with eight points. He shot 2 for 7 on 3s.\n\n\r\n              Raptors: Barrett topped 30 points for the third straight home game and the fifth time in seven.\n\n\r\n              Key moment\r\n              Barrett scored six points as Toronto used a 13-2 run late in the third to turn a 77-75 deficit into an 88-79 lead.\n\n\r\n              Key stat\r\n              After making 21 of 54 shots from 3-point range in Friday’s home win over the Raptors, the Heat finished 15 for 40 from distance on Sunday.\n\n\r\n              Up next\r\n              Miami visits Boston on Monday and Toronto hosts Indiana in an NBA Cup game on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996923.8304708
}