{
  "game_id": "0022300603",
  "espn_id": "401585231",
  "date": "Jan 21, 2024",
  "matchup": "HOU vs. BOS",
  "headline": "Kristaps Porzingis scores 32 points, NBA-leading Celtics beat Rockets 116-107",
  "body": "HOUSTON -- — Kristaps Porzingis scored 32 points and the NBA-leading Boston Celtics beat the short-handed Houston Rockets 116-107 on Sunday night.\n\n\r\n              The Celtics improved to 33-10, rebounding from their first home loss of the season Friday night against Denver. Boston is 20-1 at home and 13-9 on the road.\n\n\r\n              “Each night, it can be a different guy who has a good game,” Porzingis said. “We have that trust in each other that we’re willing to sacrifice to get a guy the ball if he’s having a good night, and tonight was my night. We just took advantage of the mismatches.”\n\n\r\n              Porzingis was 11 of 20 from the field and 6 of 11 from 3-point range. He added five blocks. Derrick White had 21 points and 12 rebounds, Jayson Tatum scored 18 points on 4-of-17 shooting, and Jaylen Brown had 13 points, 11 rebounds and 10 assists for his third career triple-double.\n\n\r\n              “Teams are switching on- and off-ball and pressuring us so the ability to play in the post is something we have to continue to develop for the long-term success of this team,” Celtics coach Joe Mazzulla said. “I thought he was great, and he stepped up tonight and played a great game.”\n\n\r\n              Dillon Brooks led Houston with 25 points, hitting 5 of 15 from 3-point range. Alperen Sengun had 24 points and Jalen Green added 16. Rookie Amen Thompson finished with 15 points and a career-high 13 rebounds.\n\n\r\n              Less than 24 hours after beating Utah 127-126 in overtime, Houston played without Fred VanVleet (lower back), Jabari Smith Jr. (ankle), Jeff Green (calf), Reggie Bullock (lower back) and Tari Eason (leg).\n\n\r\n              “We played hard and played together,” Brooks said. “It’s good to know we have it in us to play at that level against one of the great teams in the NBA. We’ve got to figure out how to do it for 48 minutes.”\n\n\r\n              Boston was without Al Horford (rest) and Jrue Holiday (right elbow sprain). Holiday’s brother, Aaron, had 12 points and five assists off the bench for Houston.\n\n\r\n              The Celtics once again beat up on former coach Ime Udoka’s new team. The Celtics routed the Rockets 145-113 in Boston on Jan. 13.\n\n\r\n              “We had our chances,” Udoka said. “Our focus and attention to detail was better on certain guys. We did a decent job on Jaylen Brown and Jayson all night — it was just that the others hurt us, especially offensive rebounds from some of their bigs.”\n\n\r\n              The Celtics outrebounded the Rockets 56-49 and had 17 offensive rebounds, helping them outscore the Rockets 23-10 in second-chance points.\n\n\r\n              “It’s something we’ve stressed this year, and it’s something we’ve gotten better at,” Mazzulla said. “On nights like this, it keeps baskets alive and gives us extra possessions.”\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Dallas on Monday night.\n\n\r\n              Rockets: Host Portland on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995608.7520268
}