{
  "game_id": "0022400758",
  "espn_id": "401705324",
  "date": "Feb 10, 2025",
  "matchup": "CHA @ BKN",
  "headline": "Nets pull away from Hornets after LaMelo Ball leaves with ankle injury, win 97-89",
  "body": "NEW YORK -- — Nic Claxton scored 16 points and the Brooklyn Nets pulled away after LaMelo Ball was lost to another ankle injury and beat the Charlotte Hornets 97-89 on Monday night.\n\n\r\n              Cam Johnson and Day'Ron Sharpe each added 14 points for the Nets, who won for the fifth time in six games in the best stretch of their first season under Jordi Fernandez. This was their second easy victory over Charlotte during that span.\n\n\r\n              Moussa Diabate had a career-high 21 points and grabbed 10 rebounds for the Hornets before he was forced out of the game with a right eye abrasion. Tidjane Salaun scored 16 points.\n\n\r\n              Ball played the first 10 minutes and the Hornets announced at halftime he wouldn't play the rest of the night because of right ankle soreness. He had only recently returned from a five-game absence with a sprained left ankle. \n\n\r\n              Takeaways\r\n              Hornets: Charlotte is 1-16 in games Ball has missed this season. Not surprisingly, this game got away from the Hornets once their point guard was lost with them trailing by three.\n\n\r\n              Nets: With one game to go, the Nets should feel good about they are playing going into the All-Star break. They've now won consecutive games at home for the first time this season.\n\n\r\n              Key moment\r\n              Charlotte trailed by two about 2 1/2 minutes into the second quarter before a 9-0 run gave the Nets a 47-36 lead and it was never close again. Brooklyn led by double digits nearly all the second half.\n\n\r\n              Key stat\r\n              Even though he missed the last three quarters, Ball was still tied for the team lead in 3-pointers until Salaun made his second of the game with 5:34 to play. Charlotte finished 6 for 31 (19%).\n\n\r\n              Up next\r\n              The Nets host Philadelphia on Wednesday in their final game before the All-Star break. The Hornets are at Orlando on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997441.900043
}