{
  "game_id": "0022000151",
  "espn_id": "401267311",
  "date": "Jan 11, 2021",
  "matchup": "MIL @ ORL",
  "headline": "Antetokounmpo, Bucks pull away late to beat Magic 121-99",
  "body": "ORLANDO, Fla. -- — Giannis Antetokounmpo returned from a one-game absence because of a minor back injury and scored 22 points as the Milwaukee Bucks beat the Orlando Magic 121-99 on Monday night.\n\n\r\n                    Antetokounmpo, the reigning two-time NBA MVP, started slowly and battled through second-half foul trouble before coming alive in the fourth quarter. Milwaukee won a second straight and beat Orlando for a fifth consecutive time in the regular season.\n\n\r\n                    “At the end of the day, I had five fouls, but I was just trying to play the game, go downhill and get my teammates involved,” said Antetokounmpo, who had six rebounds and four assists. “I was just wanting to execute down the stretch.”\n\n\r\n                    Khris Middleton finished with 20 points and 10 rebounds for the Bucks, while reserve Bobby Portis played well for a second straight game, scoring 20 points.\n\n\r\n                    Nikola Vucevic had 28 points and 13 rebounds to lead the short-handed Magic, who have lost three straight since Markelle Fultz was lost to a season-ending knee injury. Aaron Gordon had 21 points, eight assists and five rebounds and contributed solid defense against Antetokounmpo.\n\n\r\n                    “We felt like we played OK for three quarters and we were right there and then we just made too many mistakes on both ends of the fourth,” Vucevic said. “Milwaukee is a team that’s going to take advantage of it.”\n\n\r\n                    Milwaukee missed 17 of its first 24 3-point shots but drilled six 3s in the fourth quarter. Seconds after Gordon spectacularly dunked over Antetokounmpo to get the Magic within 88-86, Milwaukee’s superstar forward hit a straight-on 3-pointer that quieted the pandemic-restricted crowd of 3,248. He followed that up by finding Portis for another 3 as the Bucks went on a 22-2 run.\n\n\r\n                    “He puts in a lot of time and effort in and he’s growing in all ways,” Milwaukee coach Mike Budenholzer said. “It was just two big plays because the momentum could have swung on the (Gordon) dunk. It’s a huge momentum swing for him to make the 3 and then to create the open 3 for Bobby.”\n\n\r\n                    The teams were playing for the first time since last August, when they squared off in a first-round playoff series in the bubble at Walt Disney World. Orlando won Game 1 of that series before Milwaukee captured the next four. Milwaukee also won the four regular-season meetings with Orlando last season.\n\n\r\n                    Milwaukee led 63-54 at the half despite missing 13 of its first 17 3-point shots. The Bucks forced eight turnovers in the second quarter and 11 in the first half and turned those Magic mistakes into 17 points.\n\n\r\n                    In the fourth quarter, the Magic shot 7 of 21, including 1 of 8 from 3-point range.\n\n\r\n                    “The game was the first 3 1/2 minutes of the fourth quarter where we had just poor possessions on offense, lack of purpose and fouling at the other end of the floor,” Magic coach Steve Clifford said.\n\n\r\n                    Bryn Forbes added 14 points and three 3s for Milwaukee, which shot 50.5% from the floor.\n\n\r\n                    TIP-INS\n\n\r\n                    Bucks: Monday marked the Orlando return of D.J. Augustin, who played for the Magic the previous four seasons. Augustin averaged double digits in scoring each of the last three seasons and hit the game-winning 3 for the Magic in Game 1 of the 2019 NBA playoffs. After drafting point guard Cole Anthony with the No. 15 pick, the Magic informed Augustin that they wouldn’t be pursuing him in free agency. Said Clifford: “In my 21 years, for me, he’s one of the favorite guys I’ve ever coached. … Those calls when people leave are never easy. That was a difficult conversation.” Augustin finished with eight points and four assists on Monday.\n\n\r\n                    Magic: When guard Evan Fournier hobbled off the court on Dec. 31 because of back spasms, the injury wasn’t initially thought to be serious. However, Fournier missed his sixth consecutive game on Monday. Clifford said the guard won’t play Wednesday and could miss Friday and Saturday’s games as well. ... After initially being ruled out earlier in the day, James Ennis started and played on a strained hamstring.\n\n\r\n                    UP NEXT\n\n\r\n                    Bucks: At Detroit on Wednesday. The Bucks are 2-0 already against the Pistons.\n\n\r\n                    Magic: At Boston on Wednesday to begin a six-game trip. The teams play again in Boston on Friday. Orlando is 4-0 in two-game sets this season.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997415.858793
}