{
  "game_id": "0021900183",
  "espn_id": "401160825",
  "date": "Nov 17, 2019",
  "matchup": "CLE vs. PHI",
  "headline": "Harris, Embiid lead 76ers to 114-95 rout of Cavaliers",
  "body": "CLEVELAND --  The Philadelphia 76ers made certain there was no late drama against the Cleveland Cavaliers this time.\n\nA few days after a one-point victory over the Cavaliers at home, the 76ers jumped ahead early and steadily built the lead for a 114-95 rout Sunday.\n\nCleveland nearly pulled off an upset in Philadelphia on Tuesday before falling 98-97, but the 76ers quickly ended any hope of a repeat.\n\nTobias Harris scored 27 points and Joel Embiid had 14. Ben Simmons had 10 points and 11 assists, and the 76ers had six players score in double figures.\n\nPhiladelphia went ahead midway through the first quarter and pulled away, shooting 67% in the half. The lead reached 75-44 early in the third quarter.\n\n\"We needed a win and we came out with great energy and used our defense to fuel everything,\" said Harris, who played with a jammed left pinky. \"When you get high-percentage shots and play good defense, it's a good combination.\"\n\nThe 76ers had dropped five of seven going into the game, including losses in Orlando and Oklahoma City, but finished their road trip on a high note.\n\n\"How people respond to losing and how they play is an interesting snapshot,\" 76ers coach Brett Brown said. \"For the most part, the guys didn't let up. Defensively, we came out with a sting. The partnership of all the pieces was effective.\"\n\nPhiladelphia shredded Cleveland's defense with 33 assists on 46 baskets. Harris was 12 of 14 from the field, missing only one of 12 2-point attempts.\n\nCavaliers forward Kevin Love took a hard fall after being flattened by Furkan Korkmaz while shooting in the lane in the first quarter. Love, who injured his right knee, got up after being on the floor for a couple of moments and gave the thumbs-up sign to the crowd.\n\nLove, who scored 12 points in 25 minutes, expects to play Monday night when the Cavaliers visit New York.\n\n\"My knee was bent all the way and when I hit the floor all that weight kind of jammed up on me,\" he said. \"It's going to pretty sore tomorrow. Nothing serious. I'm going to have to treat it a lot. Hopefully it will be gone in a few days.\"\n\nCollin Sexton had 17 points for Cleveland, which has lost three straight and opened a stretch of five games in seven days.\n\nThe Cavaliers were ahead of the 76ers by five points late in Tuesday's game, but couldn't hold the lead. Love missed an open 3-pointer on the final possession.\n\n\"This isn't just a tough loss like it was in Philly, where we competed,\" Cavaliers coach John Beilein said. \"We got blown out in our own arena on a Sunday afternoon in front of a great crowd. It measures you a little bit.\"\n\nBrown is looking forward to the 76ers playing 13 of their next 18 at home.\n\n\"How can that not be fantastic?\" he said. \"In Philadelphia, there is a uniqueness about that building and the fans.\"\n\nTIP-INS\n\n76ers: Simmons swatted Sexton's shot into the second row of the stands in the third quarter. ... Nine players scored in the first half. ... G Trey Burke played for Beilein at Michigan, winning NCAA Player of the Year honors in 2013.\n\nCavaliers: F Larry Nance Jr. didn't play because of a sprained left thumb, but Beilein doesn't expect the injury to be a long-term issue. Nance has been playing with a wrap on his thumb for several games and aggravated it on a dunk Thursday ... C Ante Zizic made his first appearance after missing 11 games with left foot plantar fasciitis. He scored six points in 17 minutes.\n\nBIRD DELAY\n\nA bird flew on the court and landed near the 76ers bench in the first quarter, briefly stopping the game. A couple of Philadelphia players walked toward the bird, which immediately flew away. The bird returned in the third quarter.\n\nTEAM HISTORY\n\nThe Cavaliers, who are celebrating their 50th season, inducted the inaugural class into the team's Wall of Fame. Nick Mileti, who founded the franchise, and longtime general manager Wayne Embry were in attendance for their inductions. Former players John Johnson and John \"Hot Rod\" Williams, who are both deceased, and Bill Fitch, the Cavaliers first coach, were also inducted.\n\nUP NEXT\n\n76ers: Host New York on Wednesday. Philadelphia begins a three-game stretch at home, where it is 4-0.\n\nCavaliers: Visit New York on Monday, which starts a trip that includes games in Miami and Dallas.\n\n----\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996331.436366
}