{
  "game_id": "0022401088",
  "espn_id": "401705654",
  "date": "Mar 30, 2025",
  "matchup": "HOU @ PHX",
  "headline": "Rockets rout Suns 148-109 as Phoenix star Durant leaves with ankle injury",
  "body": "PHOENIX -- — Jalen Green scored 33 points for Houston, and Phoenix star Kevin Durant left with an ankle injury in the Rockets' 148-109 romp over the Suns on Sunday night.\n\n\r\n              Durant fell to the floor with 6:57 left in the third quarter after he stepped on Rockets Jabari Smith Jr.‘s foot. Durant got to his feet, but could not put weight on his left leg. Suns coach Mike Budenholzer said Durant will have an MRI on Monday and will not accompany the team to Milwaukee for a game Tuesday night. \n\n\r\n              Durant finished with 11 points in 23 minutes, but the Rockets were already well ahead, having taken a 78-49 lead at halftime. Houston (49-26) has won 12 of its last 13 and is second in the Western Conference standings, two games ahead of Denver.\n\n\r\n              Alperen Sengun had 16 points and nine rebounds and rookie Amen Thompson had 12 points, 10 rebounds and nine assists for the Rockets. Neither played in the fourth quarter as Houston led by 42 points.\n\n\r\n              Devin Booker scored 28 points for the Suns, who fell two games behind Dallas for the final play-in spot in the West with six games remaining. It was Phoenix’s third loss in a row.\n\n\r\n              Rockets forward Dillon Brooks was ejected i n the second quarter after a brief shoving match with Durant. He was assessed two technical fouls while Durant and Nick Richards each received one.\n\n\r\n              Takeaways\r\n              Rockets: The Rockets are 12-4 in March with a game remaining.\n\n\r\n              Suns: Own the tiebreaker against the Mavericks based on winning the season series from Dallas. But with or without Durant, five of their last six games are against playoff teams.\n\n\r\n              Key moment\r\n              After Brooks’ ejection, Houston outscored Phoenix 23-11 the rest of the half to lead by 29 at the break.\n\n\r\n              Key stat\r\n              Phoenix committed 19 turnovers leading to 34 Houston points.\n\n\r\n              Up next\r\n              The Rockets are at the Los Angeles Lakers on Monday night. The Suns are at Milwaukee on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997347.582122
}