{
  "game_id": "0022400300",
  "espn_id": "401704866",
  "date": "Nov 30, 2024",
  "matchup": "ATL @ CHA",
  "headline": "Jalen Johnson scores 20 points, Hawks hang on to beat Hornets 107-104 for 3rd straight win",
  "body": "CHARLOTTE, N.C. -- — Jalen Johnson had 20 points and nine assists, De'Andre Hunter added 18 points and the Atlanta Hawks handed the Charlotte Hornets their fifth straight loss 107-104 on Saturday night.\n\n\r\n              Onyeka Okongwu added 16 points and 11 rebounds for the Hawks, who have won three straight. Trae Young and No. 1 overall draft pick Zaccharie Risacher each had 14 points.\n\n\r\n              Brandon Miller finished with 32 points for the Hornets and Josh Green added 17.\n\n\r\n              Miller’s 3-pointer cut Atlanta’s lead to one, but Hunter answered with two free throws with 9.7 seconds left. Charlotte had a chance to tie but Miller missed an off-balance 3 and Okongwu grabbed the rebound and made two free throws to seal the game.\n\n\r\n              Charlotte has been without centers Mark Williams and Nick Richards for the last 14 games, but Richards was finally able to return giving the Hornets some help on the glass. Richards didn't start, but scored 12 points and had five rebounds before fouling out with a minute to play.\n\n\r\n              Takeaways\r\n              Hawks: Young struggled early with four first quarter turnovers and didn’t score his first points until the 3:52 mark in the second quarter. \n\n\r\n              Hornets: Charlotte is going to be hard pressed for scoring with LaMelo Ball out for at least two weeks with a calf injury. \n\n\r\n              Key moment\r\n              Hunter scored on a driving layup to give the Hawks the lead then appeared to get hurt. Charlotte had a five-on-four situation at the end other end but turned the ball over. Young came up with the steal and threw the ball ahead to Hunter for a dunk with 19 seconds left.\n\n\r\n              Key stat\r\n              Moussa Diabate continues to keep possessions alive for the Hornets, finishing with eight offensive rebounds. \n\n\r\n              Up next\r\n              The Hawks host the Pelicans on Monday night, while the Hornets close out a five-game homestand against the 76ers on Tuesday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998299.781292
}