{
  "game_id": "0021901243",
  "espn_id": "401224718",
  "date": "Aug 01, 2020",
  "matchup": "TOR vs. LAL",
  "headline": "Lowry scores 33 to lead Raptors to 11th straight over Lakers",
  "body": "LAKE BUENA VISTA, Fla. --  Kyle Lowry had 33 points and a career-high 14 rebounds and the defending NBA champion Toronto Raptors restarted their season by beating the slow-starting Los Angeles Lakers for the 11th straight time, 107-92 on Saturday night.\n\nOG Anunoby scored 23 points for the Raptors, the second-place team in the Eastern Conference. They haven't lost to Los Angeles since the 2014-2015 season.\n\nLowry had a strong second half to help turn back a surge by the Lakers, the Western Conference leaders who are 1-1 in the restart. The Lakers' magic number for clinching the top seed in the West remains at one.\n\nLowry's biggest shot was a 3-pointer from the right wing for a 97-86 lead with 3:01 to play.\n\n\"He was vintage Kyle tonight,\" coach Nick Nurse said. \"He was scoring and flying around and taking charges and competing and getting us some critical buckets. He was great.\"\n\nLowry was all for a full-speed reentry.\n\n\"Nick says he's going to kind of ease us back in and use it as an exhibition,\" Lowry said. \"We've got too many competitive guys that want to go out there and play and hoop and win games, especially against the guys like the Lakers and with the team that's No. 1 in the West. The competitive juices get going.\"\n\nLeBron James had 20 points and 10 rebounds, and Anthony Davis had just 14 points after he scored 34 in a win against the Los Angeles Clippers in their first game back on Thursday night. Kyle Kuzma scored 16.\n\nThe Lakers shot a season-low 35.4% from the field.\n\n\"I don't think there's anything you can do better,\" James said. \"You execute your offense to get the best shot and we did that tonight. We went 10 for 40 from the 3-point line. I believe a lot of those 40 3s are great looks after getting to the point, knowing what they're going to give up. We just have to step up and knock them down.\"\n\nJames hit consecutive 3-pointers for a 76-72 lead early in the fourth quarter.\n\nAnunoby responded with consecutive 3s for a 78-76 lead. The Raptors continued to pull away and Anunoby made a layup for a 90-83 lead.\n\nWith James and Davis struggling, the Raptors jumped to a 13-0 lead behind Anunoby and Lowry before the Lakers got back into it behind their bench.\n\nThe Lakers' reserves outscored the Raptors 13-2 in the first quarter and 31-6 in the first half to help Los Angeles to a 44-41 halftime lead. Kuzma had nine points and Alex Caruso seven.\n\nJames had seven points and Davis just one in the first half.\n\nThe Raptors \"did a great job of really making other people beat them,\" Kuzma said. \"I think for most of the game they double-teamed Anthony and LeBron in the post and kind of left a lot of guys open to make some shots. We just didn't hit shots tonight. We got what we wanted, great shots, open shots. It was tough for us to hit 'em.\"\n\nTIP-INS\n\nLakers: L.A. hasn't beaten Toronto since winning 129-122 in overtime at Staples Center on Nov. 30, 2014.\n\nRaptors: Toronto's last regular-season game was March 9 at Utah, when it completed a five-game Western Conference road trip. ... Due to travel restrictions in Canada, the Raptors reconvened on June 22 in Fort Myers, Florida, to prepare for the resumption of the season.\n\nUP NEXT\n\nLakers: Play the Utah Jazz on Monday night.\n\nRaptors: Play the Miami Heat on Monday.",
  "source": "espn_api",
  "crawled_at": 1764995577.774687
}