{
  "game_id": "0022000571",
  "espn_id": "401307354",
  "date": "Mar 11, 2021",
  "matchup": "MIA vs. ORL",
  "headline": "Heat top Magic 111-103, get over .500 for 1st time this year",
  "body": "MIAMI -- — For the first time this season, the Miami Heat have a winning record.\n\n\r\n                    They hope that's just the beginning.\n\n\r\n                    Jimmy Butler had 27 points and 11 assists, Kelly Olynyk scored 20 points and the Heat beat the Orlando Magic 111-103 on Thursday night — getting to 19-18 on the season after winning for the eighth time in their last nine games.\n\n\r\n                    “It's been an objective of ours for several weeks,\" Heat coach Erik Spoelstra said. “A small hurdle. It was something that we wanted to do.\"\n\n\r\n                    Miami opened the season with a loss to Orlando, and had gone 0-6 in opportunities this season to move over .500 — until Thursday. Tyler Herro scored 17 points, Kendrick Nunn had 13 and Goran Dragic added 11 for the Heat.\n\n\r\n                    Butler had 10 points in the fourth quarter, and led a defensive charge that limited Orlando to 8-for-28 shooting in the final 12 minutes.\n\n\r\n                    “Jimmy just controlled the game down the stretch for us,\" Olynyk said.\n\n\r\n                    All-Star Nikola Vucevic finished with 24 points and a game-high 17 rebounds for the Magic, who have dropped six straight. Dwayne Bacon scored a season-high 21 for Orlando and Michael Carter-Williams had 17 for the Magic — who lost despite outrebounding Miami 57-44.\n\n\r\n                    The Heat were without Bam Adebayo (knee) and Avery Bradley (calf), while Orlando was without Terrence Ross (knee), Evan Fournier (groin), James Ennis (calf) and Cole Anthony (rib).\n\n\r\n                    Aaron Gordon, who hadn’t played since Jan. 31 because of a sprained left ankle, had nine points for Orlando. He had two seven-minute stints to start the first and third quarters and did not play otherwise because of a minutes restriction.\n\n\r\n                    “AG coming back is huge for us. ... Definitely good to have him back,\" Vucevic said.\n\n\r\n                    Even with the Magic being short-handed, the game was close the whole way. The Heat had a pair of seven-point leads in the first quarter, Orlando had a four-point lead early in the second, and those were the extremes for either side until the final minutes.\n\n\r\n                    They went to the fourth quarter tied at 82, and Miami's lead was just 93-92 when Bacon made a 3-pointer midway through the final period.\n\n\r\n                    Orlando then missed its next eight shots, Olynyk hit a 3-pointer with 57.7 seconds left for the first double-digit lead of the evening at 108-98, and the Heat could exhale.\n\n\r\n                    “This is a game we definitely should have won,” Bacon said. “We can’t keep letting it slip away like this in the fourth quarter.”\n\n\r\n                    It was Miami’s first game since center Meyers Leonard used an anti-Semitic slur while livestreaming a video game earlier in the week. He was fined $50,000 by the NBA, the maximum allowed, and will remain away from the Heat indefinitely — even being edited out of the team’s pregame introduction video shown Thursday night.\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Gordon’s 15-game absence was the second-longest of his career. He missed 32 games as a rookie in 2014-15 with a broken foot. ... Bacon’s previous season high for scoring was 20, at Golden State on Feb. 11. ... Orlando started the season 6-2. The Magic are 7-22 since. ... Khem Birch had the rare zero-point, 11-rebound game for the Magic.\n\n\r\n                    Heat: KZ Okpala committed three fouls in the first 5:18. The last time a Heat player committed three fouls that early was Jan. 4, 2016, when Chris Andersen had three in the first 4:40 against Indiana. ... Miami had a pregame moment of silence for Larry Wahl, the longtime New York Yankees and Miami Hurricanes public-relations official who died last week of blood cancer.\n\n\r\n                    .500 MARK\n\n\r\n                    With Miami now having a winning record, Chicago, Washington and Detroit are the only other teams that have not been over .500 this season.\n\n\r\n                    MAGIC CHAMPS\n\n\r\n                    Orlando’s G League affiliate, the Lakeland Magic, won that league’s championship Thursday by topping the Philadelphia-affiliated Delaware Blue Coats. “They played well at both ends of the floor,” Magic coach Steve Clifford said.\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Visit San Antonio on Friday.\n\n\r\n                    Heat: Visit Chicago on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996788.833299
}