{
  "game_id": "0022201169",
  "espn_id": "401469324",
  "date": "Apr 02, 2023",
  "matchup": "ORL vs. DET",
  "headline": "Magic hand Pistons 20th loss in 21 games with 128-102 win",
  "body": "ORLANDO, Fla. -- — Paolo Banchero and Wendell Carter Jr. had 14 points and nine rebounds each before sitting out the fourth quarter Sunday night in the Orlando Magic's 128-102 rout of the Detroit Pistons.\n\n\r\n              Killian Hayes scored 20 points and Eugene Omoruyi added 19 for the Pistons, who lost for the 20th time in 21 games. They need a win in their remaining four games to avoid matching the franchise's worst record ever.\n\n\r\n              “Obviously losing 20 of 21 games, mentally, can be tough, but we’ve still got four games left,” said Hayes. “Tonight was a bad presentation of the Pistons, losing by 30. The Magic are not 30 points better than us.”\n\n\r\n              “This was the first time in a long time I didn’t feel like the guys were locked in,” said Pistons coach Dwane Casey. “The focus was not there. For whatever reason the execution, the sharpness was not there.”\n\n\r\n              Jalen Suggs led eight Orlando players in double figures with 18 points, and Cole Anthony added 17 points and six rebounds for the Magic, who shot 57.3% and made 17 of 33 3-point shots. It was the fifth win in six games for the Magic, who are trying to finish the season on a high note despite not making the playoffs for the ninth time in 11 years.\n\n\r\n              “We feel the energy, we feel the buzz,” said Suggs, who made four of six 3-pointers. “Just around town, everyone is saying how excited they are, how they love what we’re doing. Things like that are refreshing.”\n\n\r\n              “We have a lot of weapons on this team,\" said Anthony. “When we get out there and just play selflessly, it's fun.”\n\n\r\n              Franz Wagner finished with 16 points and eight assists and a plus-minus of plus-33 for Orlando.\n\n\r\n              Anthony and Suggs scored five points each on a 23-4 spurt that opened the second quarter and gave the Magic a 24-point lead. The Pistons, who had eight turnovers in the quarter, never threatened again and fell behind by as many as 30 points in the fourth quarter.\n\n\r\n              “They hit us a little early just with the physicality. We felt that,” said Magic coach Jamahl Mosley. “And then it registered that we have to come out and play our game of basketball, which is what we did tonight.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Detroit's worst record ever (16-66) was posted in 1978-80. ... With 14 points, Jaden Ivey became the first rookie in franchise history to score in double figures in 65 games. ... The Pistons' only lead of the game was 4-3. ... Two of Detroit's 16 wins have come against the Magic.\n\n\r\n              Magic: C Goga Bitadze picked up a technical foul to go with his sixth personal with 6:50 remaining. ... Anthony had his 11th straight double-figure scoring game and 11th straight game of a five or more rebounds. ... The Magic are 29-24 since their 5-20 start.\n\n\r\n              BANCHERO GETS CASEY’S VOTE\n\n\r\n              The game featured the NBA’s leading rookies in scoring (Banchero), rebounding (Jalen Duren) and assists (Ivey). But Casey didn’t put much stock in a question about the Rookie of the Year competition.\n\n\r\n              “I think Jaden is one of the top rookies in our league, but I think Paolo has separated himself because he’s been consistent from Day One,” Casey said. “I will put our rookies right there behind him in the rookie race, but Paolo is a few years ahead of himself.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host Miami on Tuesday night.\n\n\r\n              Magic: Host Cleveland on Tuesday night. ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994308.021367
}