{
  "game_id": "0021900169",
  "espn_id": "401160811",
  "date": "Nov 15, 2019",
  "matchup": "IND @ HOU",
  "headline": "Harden’s 44 points lead Rockets over Pacers 111-102",
  "body": "HOUSTON --  The Houston Rockets got another huge offensive game from James Harden.\n\nBut it was the team's defense against the Indiana Pacers that the Rockets thought was the most impressive part of their win.\n\nHarden scored 44 points and the Rockets used a big fourth quarter run to pull away and get the 111-102 victory on Friday night.\n\nHouston has won a season-high six games in a row and Harden has scored 36 points or more in five straight games to carry the Rockets as they deal with injuries to Clint Capela, Eric Gordon and Danuel House.\n\nIndiana led by 4 on a 3-pointer by Doug McDermott before Houston used a 14-0 spurt to make it 94-88 with about five minutes left. Harden took over in that stretch, scoring the last 12 points and making two 3-pointers. The Pacers couldn't do anything offensively as Houston built its lead and missed seven shots and had two turnovers.\n\nHarden was asked how big the team's defense in that stretch was to the win.\n\n\"It was huge,\" Harden said. \"That's the game right there.\"\n\nIndiana got its first point in almost five minutes when Domantas Sabonis made the second of two free throws with less than five minutes to go and Justin Holiday made a layup about a minute later.\n\nBut Russell Westbrook hit a 3-pointer seconds after that to push the Rockets' lead to 10 with three minutes remaining.\n\nThough the defense has improved during this winning streak, Westbrook still sees room for improvement.\n\n\"We're moving in the right direction,\" he said. \"We're doing a good job of staying locked in for the most part ... and it's showing.\"\n\nThe Pacers cut it to six points with a 3 by Aaron Holiday with about a minute left, but Tyson Chandler added a tip-in layup to secure the victory.\n\nSabonis had 18 points and 13 rebounds and McDermott added 18 points off the bench as Indiana had its four-game winning streak was snapped.\n\nBen McLemore had a season-high 21 points and Westbrook scored 17 with eight rebounds and six assists.\n\n\"He hit some timely 3s,\" coach Mike D'Antoni said of McLemore. \"His defense is always pretty good. He runs the floor. He plays really hard and he can shoot. So yeah -- he was good.\"\n\nA dunk by Justin Holiday got the Pacers within four points midway through the third quarter before Houston used an 8-2 run to make it 75-65 with about four minutes left in the quarter. McLemore led the way in that stretch with two 3-pointers.\n\nThe Pacers got going after that, scoring the next 10 points to tie it with about a minute left in the third. Houston missed five shots and had a turnover to allow Indiana to close the gap.\n\nAustin Rivers ended a scoring drought of more than three minutes by Houston after that, but Indiana scored the next four points to take a 79-77 lead.\n\nHouston entered the fourth quarter up by 1 after P.J. Tucker hit a 3-pointer at the end of the third.\n\nThe Pacers, who were already without Myles Turner and Jeremy Lamb because of injuries, played most of Friday's game without Malcolm Brogdon after he left in the first quarter with a sore lower back.\n\n\"That's a big loss when you're going up against guys like Harden and Westbrook,\" coach Nate McMillan said. \"Not only do you need him offensively but you need his size defensively.\"\n\nTIP-INS\n\nPacers: Turner missed his eighth straight game with a sprained right ankle, but could return on Saturday night. ... Lamb sat out for the fifth game in a row with a sprained left ankle. ... T.J. Warren busted his lip and was bleeding after a collision in the third quarter. He was tended to by a trainer for a few minutes and re-entered the game late in the quarter.\n\nRockets: C Capela missed the game and won't play on Saturday after sustaining a concussion on Wednesday night. ... Rivers scored 10 points off the bench. ... Houston made 14 of 46 3-pointers.\n\nLIKE FATHER, LIKE SON\n\nChandler made his first start of the season in place of Capela at center against Sabonis. It wasn't the first time he'd played against a member of the Sabonis family, after playing two games against Sabonis's father, Arvydas Sabonis, in his last NBA season in 2002-03. Chandler, who was in his second NBA season, was 20 that year and Arvydas Sabonis was 38.\n\n\"Both of them are great players,\" the 37-year-old Chandler said. \"His dad was huge and so skilled. I think I caught him at the end of his career after injuries and all that. But his son is really good and has a bright future ahead of him.\"\n\nUP NEXT\n\nPacers: Host Milwaukee on Saturday night.\n\nRockets: Visit Minnesota on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995880.416404
}