{
  "game_id": "0022000369",
  "espn_id": "401267529",
  "date": "Feb 08, 2021",
  "matchup": "TOR @ MEM",
  "headline": "VanVleet, Siakam lead Toronto rally to overcome Grizzlies",
  "body": "MEMPHIS, Tenn. -- — Intentional or not, Toronto coach Nick Nurse’s ejection in the third quarter kickstarted the Raptors to a winning rally.\n\n\r\n                    Fred VanVleet and Pascal Siakam each scored 32 points and the Raptors put together a second-half burst to beat the Memphis Grizzlies 128-113 on Monday night. \n\n\r\n                    Norman Powell added 29 for the Raptors, who began their rally after the ejection of Nurse, who picked up his second technical of the game in the third quarter. \n\n\r\n                    “Well, definitely sparked them,” Nurse said of his departure. “I don’t need any credit at all. I’m glad they started playing better and playing up to their capabilities and glad they found a way to win.”\n\n\r\n                    VanVleet also had nine assists for Toronto, which outscored Memphis 65-43 in the second half, including 34-16 in the fourth.\n\n\r\n                    The Raptors appeared reeling with 3 minutes left in the third quarter. Nurse had just been ejected and starting guard Kyle Lowry had left in the first half with back spasms. \n\n\r\n                    But Nurse’s departure was followed by a 27-5 run as Toronto turned up the defense and got strong backing from a cheering bench. That rally eventually stretched the Raptors’ lead to 113-100 with 7:48 left and Memphis never really threatened again.\n\n\r\n                    “They executed well on offense and defensively,” said Memphis guard Ja Morant, who had 18 points and nine assists. “Got stops. Got buckets and they were able to get out to a lead and hang on.”\n\n\r\n                    Jonas Valanciunas led Memphis with 27 points and a season-high 20 rebounds. Dillon Brooks had 22 points, but was 8 of 20 from the field, Morant was only 5 of 17 from the field as Memphis shot 43%.\n\n\r\n                    “I think teams have scouted us a little differently and we’ve regressed defensively,” Memphis coach Taylor Jenkins said of the fourth-quarter slide. “It happens throughout the season. We’ve just got to get back to it, keep working, keep finding ways to get better defensively. And offensively, we’re seeing a whole lot different game plans, especially late in the games.”\n\n\r\n                    Memphis used a strong second quarter to take a 70-63 lead into the break. Valanciunas’ domination inside against his former team keyed much of the Grizzlies' offense. He already had 18 points and 14 rebounds at halftime, the first player in franchise history to have that stat combination in a half.\n\n\r\n                    “I think we were all frustrated and embarrassed with our effort to start,” VanVleet said.\n\n\r\n                    As Memphis took the lead to double digits in the third, things got testy between the teams. First, Nurse picked up his second technical, then Grayson Allen got called for a flagrant on Chris Boucher. All of this allowed Toronto to remain close before the Raptors pulled away in the fourth.\n\n\r\n                    “It was fun. It was fun postgame in the locker room,” Nurse said. “Guys were enjoying it, and they should. I talk about never getting too high or getting too low, but you’ve got to enjoy the wins. It’s too hard to get them.”\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Are not only in the midst of a six-game road trip, but only have one home game — Saturday against Minnesota — before going on a three-game trip, making nine of 10 games on the road. They are 5-8 on the road. … Powell connected on six 3-pointers and passed Damon Stoudamire for ninth on the franchise’s 3-pointers list.\n\n\r\n                    Grizzlies: Memphis had scored at least 47 points from the bench in eight straight games. It ended the night with 18 points from the reserves. … With F Brandon Clarke sitting with right calf soreness, rookie Desmond Bane made his first career start. Brooks moving from guard to forward. \n\n\r\n                    HE SAID IT\n\n\r\n                    VanVleet called Nurse’s second technical “a great ejection.”\n\n\r\n                    “After that, it felt like all we needed to do was get rid of him. We were better off without him,” the guard said with a laugh.\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Travel to Washington to face the Wizards on Wednesday.\n\n\r\n                    Grizzlies: Host Charlotte on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996871.356503
}