{
  "game_id": "0021900228",
  "espn_id": "401160870",
  "date": "Nov 23, 2019",
  "matchup": "TOR @ ATL",
  "headline": "Siakam, VanVleet help Raptors hold off Hawks",
  "body": "ATLANTA --  Raptors coach Nick Nurse reminded his team at halftime to focus on getting stops and letting the defense spark the offense.\n\n\"That's the name of the game,\" guard Fred VanVleet said. \"We track how many consecutive stops we got. We came out of the half and had two stops, two 3s and just built from there.\"\n\nPascal Siakam scored 34 points and VanVleet had 25, helping the Toronto Raptors beat Trae Young and the Atlanta Hawks 119-116 on Saturday night.\n\nSiakam, at 6-foot-9, 230 pounds, turned in another impressive performance, hurting the Hawks with mid-range jumpers and 3s. He has scored at least 30 in six games, one more than he had last season.\n\nNorman Powell added 20 points for defending champion Toronto in its third straight win.\n\nYoung had 30 points, 10 rebounds and 10 assists in his second career triple-double, but Atlanta dropped its sixth straight game. The dynamic second-year guard hit two 3-pointers from 30-plus feet.\n\n\"It sucks that we lost, but if we play like, it's going to be tough to beat us,\" Young said. \"Obviously, we were down a couple of guys, but the way we played tonight, if we play like that, we can turn things around. We've got to do that every night.\"\n\nTwo nights after holding an opponent under 40 percent from the field for the sixth time this season, the defending NBA champion Raptors let Atlanta shoot nearly 53 percent.\n\nHawks rookie De'Andre Hunter went 6 for 10 from 3-point range and finished with 26 points.\n\nVanVleet's 3 with 10:02 remaining gave Toronto its first lead since the final minute of the first quarter. The Raptors never trailed again.\n\n\"I thought we were thinking maybe it was going to be a little easier than you do on a normal NBA night, which is a mistake,\" Nurse said. \"I thought we played one-on-one early and didn't hustle back on D early and didn't execute our schemes very well. We were kind of chasing that, but saying that, sometimes you've got to find a way to win it, and give the guys all the credit in the world for that because it was a tough game.\n\nSiakam's layup at the 2:49 mark made it a 10-point advantage, but the Hawks pulled within four on Young's fast-break floater with 37.5 seconds to go. Siakam quickly answered with a dunk before Hunter hit a 3 with 24.8 seconds remaining.\n\nHunter hit his sixth 3 to cut the lead to two, and Rondae Hollis-Jefferson made 1 of 2 foul shots. Young missed a 3 at the buzzer.\n\nYoung hit a straightaway 3 from 36 feet to put the Hawks up 61-52 in the closing seconds before halftime.\n\nTIP-INS\n\nRaptors: F Serge Ibaka missed his seventh straight game with a right ankle sprain. Nurse said Ibaka is \"getting closer.\" ... G Kyle Lowry missed his seventh straight game with a left thumb fracture. Nurse said Lowry could return next weekend. Lowry worked out on the floor before the game.\n\nHawks: F Cam Reddish was sidelined by a left wrist sprain, missing his second straight game. Coach Lloyd Pierce said Reddish still can't grip the ball without pain. ... Young began the game as the only NBA player with top five averages in assists, points and steals.\n\nSERIES\n\nToronto has won eight straight against the Hawks, including five in a row in Atlanta.\n\nBETTER SHOWING\n\nAtlanta coach Lloyd Pierce convened a nearly hour-long team meeting following Friday's embarrassing loss at Detroit. He liked what he saw from his team a night later.\n\n\"We couldn't stop them, and that was really a difference, but I thought our guys competed even during that time for 48 minutes,\" Pierce said. \"Really just proud of the effort that everybody showed tonight.\"\n\nUP NEXT\n\nRaptors: Host Philadelphia on Monday night.\n\nHawks: Host Minnesota on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995646.306029
}