{
  "game_id": "0021600798",
  "espn_id": "400900203",
  "date": "Feb 09, 2017",
  "matchup": "POR vs. BOS",
  "headline": "Thomas has 34 and Celtics beat Blazers 120-111",
  "body": "PORTLAND, Ore. --  Isaiah Thomas' teammates kept telling him to keep shooting, that the shots would fall.\n\nAnd they did.\n\nThomas wound up with 34 points after a slow start, including 15 in the fourth quarter, and the Boston Celtics rebounded from a loss the previous night to beat the Portland Trail Blazers 120-111 on Thursday.\n\nThomas had just a single basket in the first quarter.\n\n\"I was missing a lot of easy shots all night long. It was a tough night for me offensively. But I just stay the course,\" Thomas said. \"The guys keep saying `Keep shooting, just get open.' I just try to make those shots.\"\n\nMarcus Smart added 18 for the Celtics, who had seven scorers in double figures. Thomas, who went into the game as the NBA's No. 2 scorer behind Russell Westbrook, has scored 20 or more points in 37 straight games. He surpassed the 10.6 points he was averaging in fourth quarters to lead the league.\n\nDamian Lillard had 28 points and seven assists for the Blazers, while Al-Farouq Aminu added a season-high 26 points, including 10 in the final quarter.\n\nThe Celtics were playing the second of a back-to-back after losing the opening game of their four-game road trip, 108-92 in Sacramento. The loss snapped a seven-game winning streak.\n\nThomas' driving layup gave Boston a 106-102 lead with just under 3 minutes left. Lillard made free throws and it looked like Portland got a break with a stop, but Aminu turned over the ball on the other end and Jaylen Brown made free throws to push Boston's lead to 108-104. Smart added a layup and Portland couldn't catch up.\n\n\"That's a really good, hard-nosed, tough win,\" Boston coach Brad Stevens said.\n\nPortland was coming off a 114-113 victory at Dallas on Tuesday night. CJ McCollum won it on a runner with 0.9 seconds left.\n\nBut the victory was costly for the Blazers. Guard Evan Turner fractured a bone in his right hand during the third quarter and will be out for the next five to six weeks.\n\nTurner is averaging 9.7 points, 3.8 rebounds and 3.4 assists in 50 games, including 10 starts. He had just been promoted to the starting lineup when he was injured.\n\n\"That was definitely tough -- on top of the position we're in. We need all the bodies we have. So it's definitely frustrating,\" he said. \"I guess one perk is it's just a bone. It wasn't anything worse. And then, on top of that, the All-Star break is going to take a week. So hopefully I don't miss too much.\"\n\nThe Celtics were without Jae Crowder because of a family issue. Smart started in his place.\n\nThe Blazers led by as many as 15 points in the first half, but Lillard thought the Blazers were hurt after letting Boston close to 55-49 at the break after a 15-4 run. Thomas had 14 points in the second quarter.\n\n\"I think that was our first mistake, second-best team in the East right now, you give them life and allow them to feel like they're still in the game and can take it over,\" he said. \"Then in third, they took the lead and from that point on it was a back-and-fourth game. Both teams competed hard. Then it got down the stretch and they just made those plays that we didn't make.\"\n\nTIP-INS:\n\nCeltics: Guard Avery Bradley missed his 12th game with a sore right Achilles. ... Thomas was handed a technical foul for elbowing Portland's Meyers Leonard midway through the second quarter.\n\nTrail Blazers: Portland defeated the Celtics 127-123 in overtime on Jan. 21 in Boston. McCollum scored 35 points.\n\nSMART MOVES: Both Thomas and Lillard praised Smart for making the difference in the end.\n\n\"He does all the stuff that's not in the stat sheet. If you want a championship team, you need guys like that on your team,\" Thomas said. \"He had offensive rebounds, defensive rebounds, steals, key baskets. He does it all.\"\n\nLillard chimed in: \"I thought Marcus Smart was huge for them. It probably won't show up on the stat sheet but he did a lot of winning things for them.\"\n\nUP NEXT:\n\nCeltics: Boston plays at Utah on Saturday.\n\nTrail Blazers: The Blazers host the Hawks on Monday, the first of two meetings this season.",
  "source": "espn_api",
  "crawled_at": 1764995654.676789
}