{
  "game_id": "0022400588",
  "espn_id": "401705154",
  "date": "Jan 18, 2025",
  "matchup": "IND vs. PHI",
  "headline": "Pascal Siakam scores 21 points to lead the surging Pacers past the short-handed 76ers 115-102",
  "body": "INDIANAPOLIS -- — Pascal Siakam scored 10 of his 21 points in the fourth quarter, and Myles Turner added 18 points and 11 rebounds to help the Indiana Pacers beat the short-handed Philadelphia 76ers 115-102 on Saturday night.\n\n\r\n              Indiana has won two straight and eight of nine and is fifth in the Eastern Conference standings.\n\n\r\n              Tyrese Maxey led the Sixers with 28 points on a night Philadelphia was missing five key players — including Joel Embiid, Paul George and Kyle Lowry — because of injuries,\n\n\r\n              The bench got even shorter when Justin Edwards fouled out early in the fourth. Ricky Council IV had a career-high 18 points and Kelly Oubre Jr. added 18. Philadelphia has lost five straight and eight of 10. \n\n\r\n              Still, the Sixers managed to make it competitive. They trailed 61-59 at halftime and moved within 79-76 with 3:06 left in the third, but Indiana closed out the quarter on a 10-4 run.\n\n\r\n              Takeaways\r\n              76ers: Coach Nick Nurse has struggled to find consistency with so many injuries. Andre Drummond played for the third time since Jan. 1 and while he was sharp at times, Drummond and his teammates didn't have enough at the end.\n\n\r\n              Pacers: Getting healthy has made a huge difference for coach Rick Carlisle's team. Indiana has rounded into playoff form and seems to be getting deeper by the day. The bigger question moving forward is how the Pacers will use swingmen Bennedict Mathurin and Aaron Nesmith.\n\n\r\n              Key moment\r\n              Indiana held Philadelphia without a basket over the final 3:10 as it extended a six-point lead to 13.\n\n\r\n              Key stat\r\n              Forcing 17 turnovers certainly helped the 76ers. Getting outrebounded 50-32 against a team still improving on the glass did not.\n\n\r\n              Up next\r\n              76ers: At Milwaukee on Sunday.\n\n\r\n              Pacers: Travel to Paris for two games against San Antonio, the first on Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998136.967721
}