{
  "game_id": "0021800854",
  "espn_id": "401071527",
  "date": "Feb 13, 2019",
  "matchup": "MIL @ IND",
  "headline": "Antetokounmpo fuels Bucks late rally to charge past Pacers",
  "body": "INDIANAPOLIS --  Giannis Antetokounmpo delivered the finishing touch Wednesday.\n\nThe Milwaukee Bucks needed everything he could muster.\n\nAntetokounmpo rallied the Bucks from a 10-point fourth-quarter deficit, recorded his fifth triple-double of the season and led Milwaukee past Indiana 106-97. He finished with 33 points, 19 rebounds and 11 assists to keep the Bucks atop the Eastern Conference heading into the All-Star break.\n\n\"There are only so many things you can do,\" said Pacers forward Thaddeus Young, who spent most of the night trying to defend Antetokounmpo. \"But when he's trying to post you up in the middle and is just spinning, he's already at the rim. It's just a tough battle. He did what he's supposed to do.\"\n\nTime after time.\n\nAntetokounmpo opened the game by making five of the Bucks' nine first-quarter baskets, assisting on the other four. And after Milwaukee fell into an 86-76 hole early in the fourth, he bailed them out by scoring 12 points on 4-of-6 shooting with six rebounds and three assists over the final 11 1/2 minutes.\n\nEvery moment the Bucks needed a big play, Antetokounmpo made it.\n\nHis driving layup out of a timeout with 9:17 to go ended Indiana's 7-0 run. His dunk with 5:06 remaining gave Milwaukee a 93-92 lead. His 10-foot turnaround jumper at the 3:51 mark tied it at 95, and his nifty pass to a wide open Ersan Ilyasova for a tiebreaking layup with 2:36 left gave Milwaukee the lead for good.\n\nIt was that kind of night.\n\nAntetokounmpo closed out the first half with a flourish -- his 13th game with at least 25 points, 15 rebounds and five assists to break a tie with Shaquille O'Neal for the most in a single-season since 1976-77.\n\nMalcolm Brogdon scored 17 points and Khris Middleton added 15.\n\n\"The team did a great job keeping its composure,\" Antetokounmpo said. \"We changed the lineup, played harder and switched everything. We were able to make Indiana go 1-on-1, and I think we did a better job rebounding the ball and running the floor.\"\n\nFor a while, it looked as if the Pacers had a pretty solid handle on the three-time All-Star.\n\nAntetokounmpo followed his 5-of-7 start by missing six of his next seven shots as the Pacers charged back from 26-18 first-quarter deficit and a 55-47 halftime deficit to take the lead midway through the third quarter. They extended the margin to 10 on Tyreke Evans' 3-pointer with 9:37 left.\n\nBut then the Bucks' best player steadied himself and his teammates, helping Milwaukee outscore the Pacers 30-11 the rest of the way.\n\nBojan Bogdanovic led the Pacers with 20 points as Indiana's six-game winning streak ended.\n\n\"He's a monster,\" Indiana coach Nate McMillan said. \"Nineteen rebounds? He is starting their break rebounding the ball and they were able to score 23 fast-break points off our misses and turnovers.\"\n\nTIP-INS\n\nBucks: Have won 20 road games, one more than they did all of last season. ... Milwaukee improved to 11-1 against Central Division foes this season by ending a four-game losing streak at Indianapolis. ... Middleton had six rebounds and five assists. ... George Hill scored 12 points in his home state while Ilyasova finished with 11. ... Recently acquired Nikola Mirotic sat out with a strained right calf.\n\nPacers: Bogdanovic has 20 games with 20 or more points this season, a career high. ... Darren Collison and Domantas Sabonis each scored 14 points. Collison also had seven assists and six rebounds. ... Myles Turner had 11 points, six rebounds and two blocks. ... The Pacers scored 18 points in the first and fourth quarters and fell to 4-10 when scoring fewer than 100 points.\n\nTAKING A BREAK\n\nBucks coach Mike Budenholzer is putting a planned trip to Costa Rica on hold so he can coach the Eastern Conference this weekend.\n\nBut Budenholzer and McMillan both encouraged their players to spend some time doing things other than basketball over the next week.\n\n\"It would be nice to do a littler cardio, a little something to stay in shape. If that involves some basketball that's fine,\" Budenholzer said. \"Certainly, though, a break is probably needed by everybody.\"\n\nTHEY SAID IT\n\nBucks: \"It's a good way to go into the break, beating a good team on the road,\" Budenholzer said.\n\nPacers: \"We got away from what got us there,\" Turner said. \"The ball movement stopped and we just fell apart.\"\n\nUP NEXT\n\nBucks: Return from the All-Star break by hosting Boston on Feb. 21.\n\nPacers: Close out a six-game home stand against New Orleans on Feb. 22.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994471.480213
}