{
  "game_id": "0022400753",
  "espn_id": "401705319",
  "date": "Feb 09, 2025",
  "matchup": "TOR @ HOU",
  "headline": "Brooks scores 19 as the Rockets snap a six-game skid with 94-87 win over the Raptors",
  "body": "HOUSTON -- — Dillon Brooks scored 19 points, Jalen Green added 18 and the short-handed Houston Rockets snapped a six-game skid with a 94-87 win over the Toronto Raptors on Sunday.\n\n\r\n              The Raptors led by four early in the fourth quarter before Houston used a 14-2 run to make it 77-69 with about 7 minutes to go.\n\n\r\n              Houston was up by four a couple of minutes later when Green made two 3-pointers to power a 9-3 spurt that extended the lead to 86-76.\n\n\r\n              The Rockets were without Fred VanVleet for a fifth straight game because of an ankle injury and Steven Adams was out because they played Saturday. All-Star Alperen Sengun left in the first quarter with back spasms.\n\n\r\n              Jeff Green and Jock Landale filled in for Sengun and Green had a season-high 14 points while Landale added 11 with a season-best 10 rebounds. \n\n\r\n              Immanuel Quickley had 20 points for the Raptors, who lost a fourth straight.\n\n\r\n              Takeaways \r\n              Raptors: Toronto missed Gradey Dick in the second half after he left the game with a neck bruise following a collision with Amen Thompson near the end of the second quarter. Dick, who averages 15.6 points, didn’t score before exiting the game.\n\n\r\n              Rockets: Although the Rockets escaped this one with a win, they desperately need VanVleet back to steady their offense and get them back on track. \n\n\r\n              Key moment\r\n              The Rockets trailed by four early in the fourth quarter when Jamison Battle was called for a foul on Jeff Green. The play was reviewed and upgraded to a flagrant 1 foul after officials ruled Battle hit Green in the groin area. Green made both free throws to start the big run that gave Houston the lead for good.\n\n\r\n              Key stat\r\n              The Raptors made just 8 of 42 3-pointers. \n\n\r\n              Up next\r\n              The Raptors visit the 76ers on Tuesday night and Houston hosts the Suns on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996952.25645
}