{
  "game_id": "401809978",
  "espn_id": "401809978",
  "date": "Oct 28, 2025",
  "matchup": "WSH vs PHI",
  "headline": "76ers rally in fourth, beat Washington 139-134 in overtime to remain undefeated",
  "body": "WASHINGTON -- — Tyrese Maxey scored 39 points with 10 assists, and the Philadelphia 76ers stormed back with Joel Embiid on the bench, beating the Washington Wizards 139-134 in overtime on Tuesday night to remain unbeaten.\n\n\r\n              Embiid scored 25 points in a season-high 23:02, but with the 76ers managing his minutes, it was Adem Bona who turned the game around late. He blocked four shots in the fourth quarter and another in OT as Philadelphia rallied from a 16-point deficit after three to improve to 4-0.\n\n\r\n              Alex Sarr scored 31 points for the Wizards, who had 110 points in the first three quarters then only 16 in the fourth. When Khris Middleton missed from the left elbow in the final seconds for Washington, the game went to overtime tied at 126.\n\n\r\n              The Wizards then scored the first five points of overtime before conceding a 9-0 run, including a follow dunk by Bona with 27.6 seconds left that gave the 76ers the lead. A 3-pointer by Kyshawn George made it 135-134 with 7 seconds remaining, but after Maxey made two free throws, Middleton forced a pass into heavy traffic that was intercepted.\n\n\r\n              Washington had eight players in double figures by the end of the third quarter before collapsing.\n\n\r\n              The Wizards led 72-68 at halftime and went on a quick 14-3 run at the start of the third quarter. They led by as many as 19.\n\n\r\n              Embiid did most of his damage in the first half, when he had 18 points. Trendon Watford made his season debut for Philadelphia after missing the first three games with hamstring problems. He scored two points in 18:20.\n\n\r\n              Up next\r\n              76ers: Host Boston on Friday night.\n\n\r\n              Wizards: At Oklahoma City on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042517.956352
}