{
  "game_id": "401810204",
  "espn_id": "401810204",
  "date": "Dec 05, 2025",
  "matchup": "OKC vs DAL",
  "headline": "Gilgeous-Alexander's 33 points in 3 quarters power Thunder to 14th straight win",
  "body": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander scored 33 in three quarters, and the Oklahoma City Thunder defeated the Dallas Mavericks 132-111 on Friday night to claim their 14th straight win.\n\n\r\n              Gilgeous-Alexander made 10 of 12 field goals and 11 of 12 free throws to help the Thunder improve to 22-1 overall. He scored at least 20 points for the 95th straight game, the second-longest streak in league history behind Wilt Chamberlain’s 126 straight from 1961-1963. \n\n\r\n              Chet Holmgren and Jalen Williams each scored 15 points for the Thunder, who rolled without injured starters Lu Dort and Isaiah Hartenstein. Oklahoma City shot 56% from the field and made 26 of 28 free throws.\n\n\r\n              Dallas, though also dealing with several injuries, had won three straight. Star rookie Cooper Flagg, who averaged 27 points during the win streak, scored 16 on Friday.\n\n\r\n              Jaden Hardy led Dallas with 23 points. He made 8 of 13 field goals, including 5 of 9 3-pointers. Naji Marshall added 18 points for the Mavericks.\n\n\r\n              Dallas' Anthony Davis, who averaged 20.6 points per game before Friday night, did not score in the first three quarters. He finally scored on a layup with just over eight minutes remaining. He finished with two points on 1-for-9 shooting, though he had eight rebounds and six assists.\n\n\r\n              Gilgeous-Alexander scored 17 points in the first half to help Oklahoma City take a 63-48 lead at the break. The Thunder took charge in the third, outscoring the Mavericks 41-26 to go up 104-74 heading into the fourth. Gilgeous-Alexander scored 16 points in the quarter, making 5 of 6 field goals and all four free-throw attempts.\n\n\r\n              Up next\r\n              Mavericks: Host the Houston Rockets on Saturday.\n\n\r\n              Thunder: Visit the Utah Jazz on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042763.434582
}