{
  "game_id": "0021900160",
  "espn_id": "401160802",
  "date": "Nov 13, 2019",
  "matchup": "TOR @ POR",
  "headline": "Siakam, VanVleet lead Raptors past Trail Blazers 114-106",
  "body": "PORTLAND, Ore. --  The Toronto Raptors defense gave the team another reason to celebrate.\n\nThe Raptors held Damian Lillard to just nine points in a 114-106 win over the Portland Trail Blazers on Wednesday night.\n\nPascal Siakam scored 36 points and Fred VanVleet had 30, but the story for Toronto was a defense that made life difficult for yet another star player on their road trip.\n\nAfter holding LeBron James to 13 points and Kawhi Leonard to just 12 points in their last two games, taking Lillard out of the equation was another notch on the belt for the defending champions.\n\n\"It's the defense,\" VanVleet said. \"Offense comes and goes but defense has been pretty consistent for us. The good thing about our game is that most superstars are pretty unselfish so if you throw 2 or 3 guys at them they're passing. We want to make them pass and make somebody else make shots.\"\n\n\"They're really trying to guard from the start of the game to the end,\" Raptors coach Nick Nurse said of his team. \"I always talk about, can we execute our schemes, where we're supposed go, and they're doing pretty good job of that.\"\n\nSiakam scored 13 of his 36 points in the fourth quarter to help close out the Trail Blazers and help Toronto bounce back from Monday night's loss to the L.A. Clippers.\n\n\"It felt like college a little bit just posting up every possession. It was fun,\" Siakam said. \"That hasn't happened in a while.\"\n\nRodney Hood led the Blazers with 25 points.\n\nLillard, who entered Wednesday trailing only James Harden in points per game, had his worst outing of the season. Lillard had 2-fof-12 shooting from the field and was 2 of 7 from 3-point range. He did dish 10 assists.\n\n\"It's the fourth team in a row to come out denying me full court. Box-and-one, I don't remember seeing that many box-and-ones in the NBA, but I mean, they make me play against a crowd. Even when I try to get downhill and be aggressive, there's four guys right there. The right play is to kick it ahead, get it out, that was the only option they gave me a lot of times. It's just what it was.\"\n\nHood stood up to the Raptors' challenge, returning from a two-game absence with back spasms. CJ McCollum also pitched in 18 points while Anfernee Simons had 17 off the bench.\n\nStill, the Trail Blazers once again found themselves staring at a familiar postgame script.\n\n\"I get frustrated sometimes losing games, especially losing games that we were in,\" Lillard said. \"If we was getting blown out, I would be getting upset about that but it wouldn't be the same feeling. We in every game, down the stretch when it's time to win a game we're not doing the necessary things to get a win.\"\n\nThe Raptors attacked in waves, with Siakam scoring seven straight points to close the quarter and give the Raptors an 87-78 lead heading into the fourth.\n\nThe Raptors also got solid bench contributions from Rondae Hollis-Jefferson (16 points, 11 rebounds) and Terence Davis (15 points).\n\nThe Blazers went on an 11-2 run to start the fourth quarter, tying the game at 89 with 9:06 left as Lillard watched from the bench.\n\nNassir Little made his first NBA start against the defending champs. Little drew the job of guarding Siakam.\n\n\"I thought he had a really good game,\" Stotts said of the rookie Little. \"I thought he held his own with Siakam defensively, brought a lot of energy and played hard.\"\n\nLittle finished with seven points and five rebounds.\n\nA dunk by Hollis-Jefferson with 5:29 left gave the Raptors a 101-94 lead. Another jumper by Siakam with 3:38 left gave the Raptors a 108-94 lead, their largest of the game.\n\nTIP-INS\n\nRaptors: The Raptors made a line-up change on Wednesday night as they were without starting small forward OG Anunoby, who is dealing with an injury to his eye.\n\nAnunoby, who walked into the Moda Center Wednesday with an eye-patch over his right eye, will likely be available to play when the Raptors finish their road trip later this weekend.\n\n\"They told me it was close for this game, that he might make it, but it's not going to happen,\" head coach Nick Nurse said. \"He will be ready to go Saturday in Dallas.\"\n\nNurse gave the starting opportunity to reserve forward Malcolm Miller, who had only appeared in two games heading into Wednesday.\n\nTrail Blazers: After entering the season with high expectations, the Blazers have sputtered out of the gate through the first 11 games of the season.\n\nTuesday night's loss to a short-handed Sacramento Kings group was as painful as any of the losses they've had to start the season.\n\n\"We're not where we want to be,\" Blazers coach Terry Stotts said. \"The losses at Golden State and (Sacramento) really took a toll. Those two teams were undermanned and if those two games are wins that changes the outlook of where we are. We've played a lot of close games, we've played a lot of good teams competitively but I'd say right now we're a middle of the road team trying to find ourselves.\"\n\nNow, the Blazers will look to find themselves as they embark on a 10-day, six-game road trip.\n\nUP NEXT\n\nRaptors: Saturday at Dallas Mavericks.\n\nTrail Blazers: Saturday at San Antonio Spurs.\n\n---\n\nMore AP NBA coverage: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995653.983101
}