{
  "game_id": "0021700697",
  "espn_id": "400975443",
  "date": "Jan 23, 2018",
  "matchup": "OKC vs. BKN",
  "headline": "Westbrook's late basket lifts Thunder past Nets",
  "body": "OKLAHOMA CITY --  Russell Westbrook had one goal on the Thunder's final possession: make it to the rim.\n\nThe Brooklyn Nets left him just enough space, and the reigning MVP put Oklahoma City over the top once again.\n\nWestbrook made a go-ahead layup with 3.3 seconds left to help the Thunder rally from a 15-point second-half deficit and beat the Nets 109-108 on Tuesday night.\n\n\"They sat in the paint all game long,\" Westbrook said. \"I was just trying a way to get to the basket.\"\n\nThe lead changed six times in the final 2:23. Brooklyn went ahead 108-107 on a driving layup by Spencer Dinwiddie with 7.8 seconds left, but Westbrook answered with his own. After three timeouts, Dinwiddie missed a 3-point attempt at the buzzer, with the Thunder's Andre Roberson guarding him closely.\n\nWestbrook had 32 points and Paul George added 28 points and nine rebounds after being left off the NBA All-Star roster earlier in the day. Oklahoma City committed a season-low four turnovers while extending its winning streak to five games.\n\n\"I really thought this was one of the best wins we've had all year,\" Oklahoma City coach Billy Donovan said, noting that Brooklyn made 16 3-pointers to seven for the Thunder. \"From a statistical standpoint, you don't normally win a game like that.\"\n\nJoe Harris led the Nets with 19 points while Dinwiddie and DeMarre Carroll had 13 each. The Nets ended a two-game winning streak, matching their longest of the season.\n\n\"We can talk about the last plays, but I do think we gave up 35 points in the fourth quarter and made a ton of mistakes,\" Brooklyn coach Kenny Atkinson said. \"I loved our competitive spirit all game, how we defended, but I thought in the fourth quarter we made some fundamental mistakes.\"\n\nOklahoma City rallied with stellar 3-point shooting in the fourth quarter, going 5 of 8 after making only 2 of 17 attempts from behind the arc.\n\nBrooklyn went 10 of 18 from 3-point range in the first half and outscored the Thunder 21-10 over the final seven minutes of the half to lead 59-47 at the break. The Nets led 68-53 after two free throws by Rondae Hollis-Jefferson with 8:20 left in the third quarter.\n\nWestbrook scored eight points during a 12-0 run that cut the margin to 68-65, but 3-pointers by Harris and D'Angelo Russell helped the Nets rebuild their lead to 83-68 with 1:28 left in the quarter. They were up 85-74 going into the fourth.\n\nThe Thunder's five fourth-quarter 3-pointers -- including two each by backups Raymond Felton and Patrick Patterson -- quickly closed that gap. Westbrook's 16-foot jumper with 6:13 left put Oklahoma City up 97-96 -- its first lead since the second quarter.\n\nALL-STAR SNUB\n\nWestbrook, normally curt and brief with media after games, passionately defended George, saying it was \"unbelievable\" and \"outrageous\" that George didn't join him as an All-Star reserve. George entered the game averaging 20.8 points per game and ranked second in the NBA with 2.16 steals per game.\n\nGeorge was gracious when discussing the situation, saying it's much tougher to make an All-Star team in the loaded Western Conference than it was in the Eastern Conference, when he was with the Indiana Pacers.\n\n\"I wasn't an All-Star to the voters or whoever that made the list,\" George said. \"Everybody that thought the same wasn't an All-Star, apparently. Life goes on.\"\n\nTIP-INS\n\nNets: Brooklyn has had 22 games decided by six points or fewer, the highest total in the NBA. ... Dinwiddie, who hit a floater from 14 feet with 0.9 seconds left to give the Nets a 101-100 win at Detroit on Sunday, has made six baskets to tie or take the lead in the final minute of the fourth quarter or overtime this season, tied for the NBA lead.\n\nThunder: Anthony scored 10 points and now is 30 away from becoming the 21st player to reach 25,000 career points.\n\nNEXT UP\n\nNets: Continue their five-game trip at Milwaukee on Friday night.\n\nThunder: Host Washington -- and former Thunder coach Scott Brooks -- on Thursday night.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993105.390775
}