{
  "game_id": "0022200407",
  "espn_id": "401468562",
  "date": "Dec 12, 2022",
  "matchup": "MIN @ POR",
  "headline": "Lillard ties own Blazers mark with 11 3-pointers, beats Minn",
  "body": "PORTLAND, Ore. -- — Damian Lillard tied his own franchise record by making 11 3-pointers and finished with 38 points, leading the Portland Trail Blazers over the Minnesota Timberwolves 133-112 on Monday night.\n\n\r\n              Lillard shot 11 for 17 from long range and didn't play in the fourth quarter. The Blazers never trailed and led by as many as 27.\n\n\r\n              “I literally didn’t know how many 3s I had,” Lillard said. “I was just shooting. I knew I was in double digits and I thought I made a lot of 3s tonight and then I think how many did I shoot?”\n\n\r\n              With the game out of reach, Portland coach Chaucey Billups wasn't tempted to put Lillard back in the game in the fourth.\n\n\r\n              “He was on a heater that was fun to watch,” Billups said. “He can always use some rest as well. But we rode him as good as we could and we was able to take care of business.”\n\n\r\n              Jerami Grant had 24 points for Portland and Jusuf Nurkic added 14 points and 16 rebounds.\n\n\r\n              D’Angelo Russell scored 23 points for Minnesota, and Rudy Gobert had 16 points and 20 rebounds. The Timberwolves shot 49% (46 for 93) from the field, 53% (10 for 19) on free throws and 37% (10 for 27) on 3s. \n\n\r\n              “When you miss that many free throws and lay-ups, it really comes down to were we really ready to play?” Timberwolves coach Chris Finch said. “And all of the 3s, we need to get those under control.” \n\n\r\n              Lillard made eight 3s and scored 27 points as the Blazers took a 70-59 halftime lead. He opened the second half by making his ninth 3-pointer.\n\n\r\n              The Blazers pushed their lead to 15 multiple times in the third quarter and Lillard tied his team record with his 11th 3 for an 88-70 lead with 5:45 left in the third quarter. \n\n\r\n              Lillard continued his great play since returning from a calf strain on Dec. 4. Over the last four games, Lillard has averaged 33.7 points per game while shooting 50% from the field, 50% from the 3-point line, and 100% from the free-throw line. \n\n\r\n              The Timberwolves closed to 88-78, forcing the Blazers to call a timeout. Portland then pushed its lead to 106-84 going into the fourth and the advantage reached 27 in the final quarter.\n\n\r\n              TIP-INS\n\n\r\n              Timberwolves: Minnesota’s defensive efforts have been stymied by fouls. Finch believes the fouls can also take a toll on the offense, one night after Minnesota was outscored 22-4 in fast-break points. “One of the worst parts about fouling is you’re facing a set defense all the time,” Finch said. “It’s slowing the game down. We didn’t run a lot the other day.” \n\n\r\n              Trail Blazers: After starting the season as a top 10 defense, the Blazers have slipped to 23rd in defensive rating. Blazers coach Chauncey Billups thinks several things are at play. “Our focus is off and on. Sometimes it’s lasered in, sometimes it’s not. Sometimes we’re both during the game. Some of these offenses we play are really tough as well. It’s all of the above. I think we are in a good space as a team but we just have to tighten up a few things.”\n\n\r\n              UP NEXT\n\n\r\n              Minnesota: At the Los Angeles Clippers on Wednesday night. \n\n\r\n              Portland: At San Antonio on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995177.281286
}