{
  "game_id": "0021501093",
  "espn_id": "400828980",
  "date": "Mar 27, 2016",
  "matchup": "HOU @ IND",
  "headline": "George scores 25 points, Pacers beat Rockets 104-101",
  "body": "INDIANAPOLIS --  Paul George did the bulk of his work for the Indiana Pacers early on, and then Monta Ellis and Ian Mahinmi came through at the end.\n\nGeorge scored 16 of his 25 points in the first quarter and the Pacers overcame 34 points from James Harden to beat the Houston Rockets 104-101 on Sunday night\n\n\"This was exactly the kind of game we expected,\" Mahinmi said. \"We knew we had to have this one tonight. A big thing right now is that we are still learning to play with each other, and we are getting better.\"\n\nThe trio worked well together to put the game away and keep the Pacers rolling on a playoff push.\n\nEllis scored 23 points on 10-of-18 shooting, including the go-ahead basket with 4:46 remaining to give the Pacers a 96-95 lead. Mahinmi, who tied his career high with 19 points, followed up with back-to-back baskets to give the Pacers a 104-101 lead.\n\nHarden added eight rebounds and Trevor Ariza added 14 points for the Rockets, who have lost two straight.\n\nThe Pacers took a 16-point lead in the third quarter and appeared to have the game put away before the Rockets went on a run and took a lead early in the fourth quarter with a dunk by Ariza.\n\nThe Pacers are in seventh place in the Eastern Conference. The Rockets dropped to eighth in the West and are trying to stay in the chase for the playoffs.\n\nIt was a solid effort in the second half for Houston, though.\n\nThe basket by Ariza in the fourth quarter came while the Pacers turned it over three straight possessions and the Rockets scored three straight baskets to take an 85-81 lead.\n\nThe Pacers extended a 10-point halftime lead at the start of the second half when George Hill made a 3-pointer and Ellis drove to the basket to put Indiana ahead 67-51.\n\nBut then Houston went on a 19-3 run. Trevor Ariza made a 3 and Harden made three more, including one to tie the game at 70 with 3:37 left in the third quarter.\n\nBefore that, the opportunities were few and far between.\n\n\"They're a very good defensive team,\" Houston coach J.B. Bickerstaff said. \"They do a great job protecting the paint and they're running you off the 3-point line and sending you to more people.\"\n\nHouston recorded its second-lowest 3-point percentage in a game this season and was held to 21.2 percent from behind the arc.\n\n\"They missed some open 3-pointers, but overall, I thought our 3-point defense was good,\" Pacers coach Frank Vogel said. \"They hurt us and got back in the game in the third quarter when they went small, and James Harden really got going.\"\n\nThe Pacers used strong ball movement to take a 57-47 halftime lead.\n\nEllis and Miles each made 3-pointers during a 10-2 spurt late in the second quarter and Mahinmi scored to cap off the run to make it 55-42 with 1:41 left in the first half.\n\nTIP INS\n\nRockets: Dwight Howard had 11 points and 10 rebounds. ... Houston was 2 of 18 from 3-point range in the first half and finished 7 of 33. ... Forward Sam Dekker was out with lower-back soreness.\n\nPacers: George and Mahinmi each had 11 rebounds. ... The Pacers were 9 of 26 from 3-point range. ... Indiana shot 50 percent from the field in the first half.\n\nUP NEXT\n\nRockets: At Cleveland on Tuesday night.\n\nPacers: Host Central Division rival Chicago on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764994601.307606
}