{
  "game_id": "0021800120",
  "espn_id": "401070801",
  "date": "Nov 02, 2018",
  "matchup": "CHI vs. IND",
  "headline": "Oladipo leads balanced Pacers past Bulls 107-105",
  "body": "CHICAGO --  Whenever the Indiana Pacers needed a big play, Victor Oladipo delivered.\n\nIt was an all-too-familiar finish for the Chicago Bulls.\n\nOladipo had 25 points and 14 rebounds, Darren Collison made a tiebreaking jumper down the stretch, and the Pacers topped the Bulls 107-105 on Friday night.\n\n\"The great thing about this team is we respond well,\" Oladipo said. \"We get on each other. We get upset at each other. We challenge each other, but at the end of the day, we're still a family.\"\n\nMyles Turner added 18 points and Collison finished with 14 as Indiana earned its fifth consecutive road win for its longest such streak since April 2012. Turner also matched a career high with six blocked shots, including Antonio Blakeney's desperate jumper as the final seconds ticked off.\n\nThe Pacers trailed by as many as 18 early in the second quarter.\n\n\"We stayed with it,\" coach Nate McMillan said. \"We started to get some stops. Second unit came in and got us back into the game, and the second half, we had to fight and score, and get stops.\"\n\nIndiana appeared to be in solid shape with a 95-91 lead with 30.5 seconds left. But Blakeney converted a four-point play after he was fouled by Collison on a 3-point try from the top of the key.\n\n\"I'm just shooting with confidence,\" said Blakeney, who finished with a career-high 22 points. \"I've been working hard.\"\n\nCollison then made up for the mistake with a pullup jumper with about 18 seconds remaining, putting Indiana back in front. The veteran guard was 6 for 15 from the field.\n\nChicago then had three chances on its final possession and came up empty. Zach LaVine missed a fadeaway jumper and Justin Holiday was off on an open 3-pointer before Blakeney was blocked by Turner.\n\n\"Of course I thought it was going down,\" Holiday said. \"I couldn't believe the ball bounced to me. I was like, oh yeah, it's over. But some fall, some don't.\"\n\nIt was the second straight heartbreaking result for Chicago, which lost 108-107 to Denver in overtime on Wednesday night. The Bulls are winless on a four-game homestand heading into the finale Saturday night against Houston.\n\n\"I mean it's a good thing we're in these situations,\" Holiday said. \"Obviously we would rather be up and not be in them, but we're going to need this down the road to be able to win games.\"\n\nLaVine scored nine of his 20 points in the fourth quarter, and Holiday finished with 19 points. Jabari Parker and rookie Wendell Carter Jr. each had 11 points.\n\nTHERE HE IS\n\nVeteran center Robin Lopez checked in for the Bulls with 3:54 left in the first half for his first action since Oct. 22 at Dallas. Lopez was listed as a Did Not Play-Coach's Decision for Chicago's previous five games.\n\nLopez finished with two rebounds, two blocked shots and an assist in almost four minutes against Indiana.\n\nTIP-INS\n\nPacers: It was Oladipo's first double-double of the season. ... Thaddeus Young grabbed nine rebounds, giving him 1,005 with the Pacers. ... Indiana shot 47.1 percent (40 for 85) from the field. It was shooting 50.6 percent from the floor coming into the night, second in the NBA.\n\nBulls: Another MRI on G Denzel Valentine's sprained left ankle showed significant improvement, according to coach Fred Hoiberg. \"He really just did straight ahead running today and he did spot shooting,\" Hoiberg said. There is no timetable yet for his return. ... F Lauri Markkanen (right elbow sprain) is feeling better, Hoiberg said. \"Still, I think yesterday was the five-week mark, so he's still a couple weeks away from being out there,\" he said.\n\nUP NEXT\n\nPacers: Open a three-game homestand Saturday night against the Boston Celtics.\n\nBulls: Host the Rockets on Saturday night. Chicago has dropped four in a row against Houston.\n\n---\n\nJay Cohen can be reached at http://www.twitter.com/jcohenap\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994851.6413708
}