{
  "game_id": "0022200044",
  "espn_id": "401468199",
  "date": "Oct 24, 2022",
  "matchup": "IND @ PHI",
  "headline": "Harden, Embiid lead 76ers past Pacers 120-106 for 1st win",
  "body": "PHILADELPHIA -- — James Harden and the 76ers watched plenty of their bad plays on film during recent practices. The clips magnified the results on the court.\n\n\r\n              “I felt like we were 0-82,” Harden said.\n\n\r\n              They don't have to worry about that now.\n\n\r\n              Harden had 29 points and 11 assists, and Joel Embiid scored 26 points to lead the Philadelphia 76ers to their first win of the season, 120-106 over the Indiana Pacers on Monday night.\n\n\r\n              The Sixers started 0-3, dropping the first two games to Eastern Conference contenders Boston and Milwaukee. Embiid dropped 40 points in a loss to San Antonio as the Sixers still joined Orlando as the only East teams at 0-3.\n\n\r\n              “We've got to continue to work, continue to build really good habits and live with the results,” Harden said.\n\n\r\n              Harden made 10 of 18 shots from the floor and hit two straight 3s in the fourth that pushed the lead to 109-95.\n\n\r\n              “I'm trying to create the best shot available,” Harden said. \n\n\r\n              The Sixers put the smack down on the Pacers from the jump and a little bit of something from everyone to cruise into the win column. The Sixers had six players each hit one 3-pointer in the first quarter. They made 12 of 22 shots in the second and raced to a 19-point lead. Harden and Tobias Harris combined for nine of Philadelphia's 19 3-pointers.\n\n\r\n              “We have a team that can shoot 3s, right? if you’re open, shoot them,” Rivers said.\n\n\r\n              Harris hit four 3s and scored 18 points.\n\n\r\n              “People don't talk about Tobias Harris enough,” Pacers coach Rick Carlisle said. “He's a tremendous player.”\n\n\r\n              Tyrese Haliburton led the Pacers with 19 points and 10 assists. Buddy Hield had 18 points. \n\n\r\n              The good news for Philly, the Sixers didn’t need much out of Embiid. The reigning NBA scoring champion, Embiid said over the weekend his offseason were slowed by a battle of plantar fasciitis (pain under the heel and foot). Embiid said he essentially shut down all physical activity for two months headed into training camp and said he was still “trying to work my way back.”\n\n\r\n              He threw down a thunderous right-handed baseline dunk late in the third that woke up a quiet crowd.\n\n\r\n              “I liked his patience,” Rivers said. “This is one of those games, you haven’t won a game, they were trapping him every time. He just kept moving it. There was no rush. I just liked how he approached the game.”\n\n\r\n              The good news for the Sixers, their slow start was lost in the Philly sports shuffle among the Phillies trip to the World Series, the Eagles’ 6-0 start and the Union’s run to the Eastern Conference final. \n\n\r\n              Plus, it’s early and Rivers believed the Sixers can straighten out and contend rather than fall into a long losing streak. \n\n\r\n              “I’ve seen talent,” Rivers said. “It just has to match and work. I just like our guys in the locker room. There’s no reason to believe the other way, personally.” \n\n\r\n              Rivers, in his third season as Philadelphia’s coach, added the Sixers still have to shore up some weaknesses to become the kind of team that can make a run in the East.\n\n\r\n              “We may go on a run. Even if we do, we’re not ready yet to be that team,” he said. “It’s just going to take time.” \n\n\r\n              TIP-INS\n\n\r\n              Pacers: Made only 12 of 44 3-point attempts. ... The Pacers did have a 30-30 fourth against the 76ers but they could not stop Harden. \n\n\r\n              “I think everyone that plays Philadelphia has got to figure out what they're willing to live with,” Carlisle said. \n\n\r\n              76ers: G Shake Milton made his season debut in the second quarter. Milton, once seen as a second-unit spark, is in his fifth season with the Sixers. He did not score in 6 minutes. ... G De’Anthony Melton scored all of his season-high 11 points in the first half. \n\n\r\n              UP NEXT\n\n\r\n              Pacers: Continue their road with games against Chicago (Wednesday), Washington (Friday), and consecutive games in Brooklyn on Saturday and Monday.\n\n\r\n              76ers: Play consecutive games in Toronto on Wednesday and Friday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994345.338026
}