{
  "game_id": "401809953",
  "espn_id": "401809953",
  "date": "Oct 24, 2025",
  "matchup": "SAC vs UTAH",
  "headline": "Sabonis helps Kings hold off Jazz for 105-104 victory",
  "body": "SACRAMENTO, Calif. -- — Domantas Sabonis scored off an offensive rebound with six seconds remaining to cap a wild ending and lift the Sacramento Kings to a 105-104 win over the Utah Jazz on Friday night.\n\n\r\n              Zach LaVine had 31 points to help the Kings to their ninth consecutive victory against the Jazz.\n\n\r\n              Malik Monk added 20 points off the bench with six 3-pointers, and Dennis Schroder scored 17 for Sacramento.\n\n\r\n              The Kings trailed 96-92 midway through the fourth quarter before going on an 11-4 run sparked by Lavine, who scored seven points over the final five minutes.\n\n\r\n              Lauri Markkanen had 33 points to lead the Jazz. Keyonte George added 18 points and 10 assists. Brice Sensabaugh scored 15 off the bench.\n\n\r\n              LaVine’s scoring surge in the fourth quarter put the Kings in front but he was called for charging with Sacramento leading 103-102 with 50 seconds remaining.\n\n\r\n              After Markkanen was fouled with 28 seconds left and missed the second of two free throws, the Kings were called for a lane violation. Markkanen made the re-try to put the Jazz ahead 104-103.\n\n\r\n              Monk missed a mid-range shot but Sabonis — who did not play in Sacramento’s season opener because of a hamstring strain — snatched the rebound and scored on the putback. \n\n\r\n              Sabonis was fouled on the play but missed his free throw. George shot an airball at the buzzer.\n\n\r\n              The teams combined for 27 3-pointers. Utah held a 50-33 rebounding advantage.\n\n\r\n              Coming off a 30-point night in Sacramento’s season-opening loss to Phoenix on Wednesday, LaVine got the Kings going with 15 points in a seven-minute span in the first quarter.\n\n\r\n              Up next\r\n              Jazz: Host the Phoenix Suns on Monday.\n\n\r\n              Kings: Host the Los Angeles Lakers on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042497.010453
}