{
  "game_id": "0021601057",
  "espn_id": "400900452",
  "date": "Mar 21, 2017",
  "matchup": "MIL @ POR",
  "headline": "Middleton has 26 and Bucks beat the Blazers 93-90",
  "body": "PORTLAND, Ore. --  The Milwaukee Bucks were primed for Portland's late-game surge.\n\nKhris Middleton scored 26 points, and the Bucks outlasted the Trail Blazers for a 93-90 victory on Tuesday night.\n\n\"This shows how much we've grown over the season,\" Middleton said. \"At this time last season we would've panicked but tonight and on this road trip we stayed with it and weathered the storm.\"\n\nGiannis Antetokounmpo added 22 points for the Bucks (35-35), who have won nine of 11 as they jostle for playoff positon in the Eastern Conference. They are a half-game ahead of Miami for the seventh spot.\n\nPortland was Milwaukee's fourth stop on a five-game road trip.\n\nThe Trail Blazers (32-38) had won three in a row and eight of 10. They dropped to a full game back of idle Denver for the final postseason berth in the West.\n\nDamian Lillard led Portland with 31 points, and CJ McCollum added 21. Jusuf Nurkic had 11 points and 14 rebounds.\n\nPortland trailed by as many as 15 points in the third quarter, but closed to 70-68 early in the fourth on a pair of free throws from Allen Crabbe. McCollum's consecutive layups gave the Blazers an 88-85 lead with 3:46 left.\n\nThe Bucks retook the lead on Middleton's hook shot, and John Henson's putback made it 93-90 with 1:39 to go.\n\nAs the clock wound down, Lillard missed a 3-pointer and McCollum missed a layup. Middleton also missed on the other end.\n\nPortland got the ball with 6.4 seconds left, but Lillard's 3-pointer at the buzzer bounced off the backboard.\n\n\"I peeked up at the clock, and at the same time I know CJ was coming around because I heard him call my name,\" Lillard said. \"Looking at it on film the right play, I think, would've been to toss it back to him. He probably could have got a cleaner and better look than I got, but it happened too fast.\"\n\nPortland didn't score for the last 3:12 of the game. Bucks coach Jason Kidd echoed Middleton in saying the team was able keep its focus on defense in the final minutes.\n\n\"We kept our discipline and we didn't panic when they made their run,\" Kidd said.\n\nPortland was coming off a 115-104 victory at Miami on Sunday. Lillard had a season-best 49 points with nine 3-pointers, which matched a franchise high. The win capped a 4-1 road trip.\n\n\"I thought we competed hard still,\" Lillard said. \"Tonight the game just didn't go well. We had to fight and scratch and claw to be in the situation we were in.\"\n\nMilwaukee was coming off a 117-92 loss at Golden State on Saturday.\n\nThe Bucks outscored the Blazers 30-14 in the second quarter for a 48-35 lead at the break.\n\nPortland closed to 65-58 on Lillard's layup with just under three minutes to go in the third. The Blazers finished the quarter on a 14-4 run to trim the Bucks' lead to 67-63 heading into the fourth.\n\nLILLARD'S TEAR\n\nLillard continued his hot shooting with his seventh straight game with 25 points or more, a career best. He has 23 games with 30 or more points this season, one off his career best. He also added four steals against the Bucks, matching his season high.\n\nNO THREES\n\nThe Blazers went 4 for 21 from 3-point range, an emphasis for Milwaukee.\n\n\"For us to focus on trying to take the 3-pointer out of the game and make them take tough twos, I thought the guys executed the game plan well,\" Kidd said.\n\nTIP-INS\n\nBucks: Milwaukee's roster includes Portland native Terrence Jones, signed on March 4 for the rest of the season. Jones played 51 games for New Orleans this season before he was waived. He's only played sparingly for the Bucks. \"He's a talented young man and he'll get his chances but right now we're top-heavy with bigs,\" Kidd said.\n\nTrail Blazers: Lillard became the first Trail Blazer to make 1,000 career 3-pointers during the victory against the Heat, and the Blazers' arena announcer recognized the milestone during player introductions on Tuesday night.\n\nUP NEXT\n\nBucks: Play the second of a back-to-back at Sacramento on Wednesday night, the final game of a five-game road trip.\n\nTrail Blazers: Host the Knicks on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995138.068276
}