{
  "game_id": "0021900153",
  "espn_id": "401160795",
  "date": "Nov 12, 2019",
  "matchup": "SAC vs. POR",
  "headline": "Fox-less Kings beat slumping Trail Blazers 107-99",
  "body": "SACRAMENTO, Calif. --  After a slow and sluggish start in their first game without leading scorer De'Aaron Fox, Sacramento eventually found a nice rhythm with Bogdan Bogdanovic running the offense.\n\nLuke Walton was even more impressed with his team's defense, something that's been an ongoing issue for the Kings.\n\nBogdanovic had 25 points and 10 assists, Nemanja Bjelica added 19 points and 12 rebounds and the Kings won in their first game since losing leading scorer Fox to an ankle injury, beating the slumping Portland Trail Blazers 107-99 on Tuesday night.\n\nSacramento forced 17 turnovers and prevented Portland's potent backcourt tandem of Damian Lillard and CJ McCollum from taking over.\n\n\"It's what we've been preaching about every day since Day 1 of training camp,\" Walton said. \"I'll be the first to admit it needs to get a lot better. We started the game, we couldn't make anything. That's why defense is important. Every night won't go like that but the competitive level that we played with on the defensive end tonight, that needs to be a steady constant for us.\"\n\nThe Kings overcame a sloppy first half when they shot 36.7 percent, made a big run in the third quarter, then pulled away in the fourth to end a two-game losing streak to the Blazers.\n\nFox suffered a Grade 3 sprain in his left ankle during practice Monday. The third-year point guard, who started 81 games last season, will be reevaluated in a few weeks.\n\n\"Ankle sprains happen a lot in the NBA. But it is unfortunate that it is as severe as it is,\" Walton said. \"What's important is that our team comes together, grows, fights, and gets better. And he attacks his rehab and get back with us as soon as he can.\"\n\nBjelica helped make up for the loss of Fox. He made eight of his 14 shots and set a season-high for rebounds in his first double-double of the season. Buddy Hield added 20 points.\n\nLillard had 27 points and McCollum added 24 for the Blazers (4-7), who have lost five of six. Nearly half of Lillard's points (13) came at the free throw line.\n\n\"The third quarter got away from us defensively and we had some trouble with matchups,\" Portland coach Terry Stotts said. \"They got off to a good start in the third quarter and built a lead. We really couldn't recover after that.\"\n\nThe Kings led by 14 early in the fourth quarter before the Blazers chipped away and pulled within 98-93 on a 3-pointer from Anfernee Simons with 2:51 remaining.\n\nBjelica answered with a 3, and after McCollum scored for Portland, Cory Joseph added a 3-pointer that made it 104-95. Joseph, starting in place of Fox, missed his first five shots before that.\n\n\"We kept fighting, played great defense and we knew we were going to make shots in the second half,\" Bjelica said. \"Everybody played well.\"\n\nTIP-INS\n\nTrail Blazers: Portland missed 11 of its first 15 shots outside the arc. ... Whiteside went to the bench with his third foul 6  1/2 minutes into the first quarter. ... Rodney Hood missed his second consecutive game because of back spasms.\n\nKings: Richaun Holmes had 11 points and 10 rebounds, his third double-double in 10 games. ... Hield shot 2 of 11 from 3-point range. ... Trevor Ariza left in the first half with a sore right groin. ... Sacramento was called for delay of game twice in the first half, resulting in a technical foul.\n\nHE SAID IT\n\n\"We're 4-6. What do we have to be satisfied about?\" -- Walton\n\nTURNING IT AROUND\n\nSacramento trailed by three at halftime, then outscored Portland 35-21 in the third quarter. It was only the second time this season that the Kings have outscored an opponent in the third period.\n\nUP NEXT\n\nTrail Blazers: Host Toronto on Wednesday. The two teams split their two-game series last year.\n\nKings: Play at the Los Angeles Lakers on Friday. It will be Walton's first appearance at the Staples Center since being let go by the Lakers in the offseason.\n\n--\n\nMore AP NBA:https://apnews.com/tag/NBAandhttps://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996421.470531
}