{
  "game_id": "0021800834",
  "espn_id": "401071507",
  "date": "Feb 10, 2019",
  "matchup": "POR @ DAL",
  "headline": "Doncic, Mavericks erase deficit in 102-101 win over Blazers",
  "body": "DALLAS --  Luka Doncic was summoned back to the court for a very brief speech to a group of about 100 Slovenians who made the 24-hour trek to see their countryman, the teenage rookie sensation for the Dallas Mavericks.\n\nThe bigger thrill for the visitors came a little earlier when Doncic helped engineer a fourth-quarter comeback against the playoff-contending Portland Trail Blazers.\n\nDoncic scored 13 of his 28 points in the fourth, Tim Hardaway Jr. finished with 24 and the Mavericks erased a 15-point deficit in the final 10 minutes for a 102-101 victory Sunday.\n\n\"I don't normally play him the whole quarter, but when we began to make the push early in the fourth it was just one those times where he was going to have to finish for us to have a chance,\" said coach Rick Carlisle, whose team matched its biggest comeback of the season.\n\nDamian Lillard scored 21 of his 30 points in the last half of the third quarter to help the Blazers build a lead that grew to 96-81 early in the fourth before the Mavericks rallied to hand Portland its first loss in 34 games when leading after three quarters this season.\n\nLillard made eight straight shots and in one stretch scored 16 straight Portland points in the third, but the All-Star guard missed his last four attempts as the Blazers went 10:10 without a field goal in a nine-point fourth quarter.\n\nThe last miss from Lillard was a driving layup in the final seconds after Doncic had missed at the other end, and Dallas' Maxi Kleber hunched over with the rebound and hung on long enough for time to expire.\n\n\"Some missed opportunities, some turnovers, some poor decisions, and you have got to give Dallas a lot of credit,\" said Portland coach Terry Stotts, whose team entered the game with a 33-0 record when leading after three quarters this season. \"They play with a lot of energy.\"\n\nThere is plenty of debate over whether the Mavericks still want to make the playoffs after trading the other four starters around Doncic in a pair of deals that were clearly about the future over the present.\n\nThree of the starters went to New York, and the Mavericks have decided not to play the centerpiece of that deal. They instead plan to let 2018 All-Star Kristaps Porzingis continue his recovery from a knee injury sustained about a year ago with the Knicks.\n\nHardaway was the second-biggest part of the deal for Dallas, and had his best showing in his third game. With the intensity of the rally building, he won a scramble for a loose ball and weaved through defenders for an emphatic left-handed dunk to get Dallas within one.\n\nDoncic gave the Mavericks their first lead since early in the second quarter with a finger-roll layup, then the 19-year-old put them ahead for good with a 3-point play on a driving layup for a 102-99 lead with 1:28 remaining.\n\nAfter CJ McCollum made a shot, the teams exchanged misses before Lillard's last-second attempt in the third loss in the past 10 games for Portland.\n\n\"I just think it's a message because they're a team that's below .500 right now,\" Lillard said. \"They just had a trade. They got all new guys and things like that, and it's a game that we should be able to win.\"\n\nJustuf Nurkic had 18 points on 9-of-11 shooting and 10 rebounds before fouling out when Hardaway got the Mavericks to 97-all on free throws. They had been even at 67 in the third before Lillard took over and gave the Blazers a comfortable lead.\n\nDwight Powell had 13 points and eight rebounds, including an alley-oop dunk from Doncic that kicked the comeback into another gear while getting Dallas within six. Doncic had nine rebounds and six assists.\n\nDorian Finney-Smith started the game-ending 21-5 run by tipping in his own miss and finished with 11 points and six boards.\n\nTIP-INS\n\nBlazers: McCollum was just 6 of 17 from the field and finished with 14 points, ending his career-best streak of three straight games with at least 30 points. ... The Blazers had a double-digit lead in the first half as well after going on a 20-1 run.\n\nMavericks: C Salah Mejri was re-signed three days after being waived as part of the trade that sent Harrison Barnes to Sacramento. ... Hardaway reached 5,000 career points with two buckets in the first quarter. His next two baskets were 3-pointers to give him 700 for his career.\n\nSLOVENIAN FIELD TRIP\n\nThe group of Slovenians will see the Mavericks in Houston again Monday and Wednesday when Miami plays in Dallas. It's the first time a large group has traveled from their home country. There were local Slovenian contingents in Cleveland and New York.\n\nThe idea was for this group to see the Slovenian showdown between Doncic and Goran Dragic, teammates on the national team. But Dragic hasn't played since Dec. 10 because of a right knee injury that required surgery. He isn't expected back until after the All-Star break.\n\nUP NEXT\n\nBoth teams finish a back-to-back Monday, with Portland at Oklahoma City and Dallas at Houston.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995166.8963509
}