{
  "game_id": "0021901305",
  "espn_id": "401224780",
  "date": "Aug 12, 2020",
  "matchup": "TOR @ PHI",
  "headline": "Raptors rally past Sixers to give Griffin a coaching win",
  "body": "LAKE BUENA VISTA, Fla. --  Stanley Johnson scored the tiebreaking basket in the lane with 4.9 seconds remaining, giving the Toronto Raptors a 125-121 victory over the Philadelphia 76ers on Wednesday that made a winner of Adrian Griffin.\n\nRaptors coach Nick Nurse let his assistant coach run the team and they responded with a late run from the bottom of their bench, long after Philadelphia's Joel Embiid had ended his night, to improve to 6-1 in the restart.\n\n\"Tomorrow back to reality, but it was an awesome feeling,\" Griffin said.\n\nKyle Lowry and Chris Boucher each scored 19 points for the Raptors. Norman Powell had 17 and Pascal Siakam finished with 15.\n\nEmbiid played just the first half after missing a game with a left ankle injury. He also took a hit on the hand in this one and finished with five points in 14 minutes.\n\nTobias Harris scored 22 points and Furkan Korkmaz had 21 for the 76ers, who became locked into the No. 6 seed in the Eastern Conference earlier Wednesday, securing a first-round matchup against the Boston Celtics.\n\nThey've already lost All-Star Ben Simmons to knee surgery and hope Embiid will be at his best, but will have to be ready no matter who they have.\n\n\"We've had different lineups from the start to now and if you were to look at our team, a big word for us would be just being able to adapt,\" Harris said. \"To adapt to who's in, who's out, how we're going to play and what we're going to do moving forward.\"\n\nGriffin said Nurse approached him with the opportunity to coach and the Raptors pulled it out for him by rallying from 10 down midway through the fourth quarter, and six down with under 2 minutes to play.\n\nHe got a chance to draw up a winning play after calling timeout with 18 seconds left. The 76ers blocked a shot but it came right back to Johnson, who softly put it in. The Sixers then threw away the ensuing inbounds pass.\n\nLowry said the players forgot to give Griffin a game ball, but the Raptors expect he'll get a head coaching opportunity in the NBA soon and will get plenty of other chances.\n\n\"We were really excited for him,\" Powell said. \"We wanted to go out there and play hard and help him get his win as a head coach. I thought we did that throughout the game.\"\n\nThe Raptors' first-round series against No. 7 Brooklyn had already been set.\n\nTIP-INS\n\nRaptors: Boucher had nine rebounds and four blocks. ... The Raptors went 3-1 against the 76ers, winning the series for the seventh straight season.\n\n76ers: Philadelphia is 3-4 in the restart. ... Alec Burks, who scored a team-high 23 points in a loss to Phoenix in the last game, sat out with left foot soreness.\n\nCOACH'S CHANCE\n\nGriffin praised Nurse for giving him an opportunity to get head coaching experience in a game.\n\n\"I think Coach is an awesome human being. He understands a coach like me needs some reps,\" Griffin said. \"Being a head coach, he knows my ambitions and he wants to see me grow as an individual on and off the court, so definitely just an awesome gesture by Coach.\"\n\nHISTORY LESSON\n\n76ers coach Brett Brown said the shirt he wore before the game, featuring a white figure with his arm around a Black one, was designed by Spurs guard Patty Mills, an Australian. Brown explained that for those who didn't know Mills' Aboriginal history, his mother came from what was called the \"stolen generation,\" which he said was \"a cleansing of their version of Black children being brought into white suburban Adelaide.\"\n\n\"And so this American thing that we're going through with George Floyd and the flash points that we've all experienced here in the United States, it's not unique to this nation,\" added Brown, who worked with Mills on the Spurs and Australia's national team.\n\nUP NEXT\n\nRaptors: Play Denver on Friday.\n\n76ers: Play Houston on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995569.778121
}