{
  "game_id": "0021600704",
  "espn_id": "400900125",
  "date": "Jan 28, 2017",
  "matchup": "CHA vs. SAC",
  "headline": "Cousins scores 35, Kings top Hornets 109-106",
  "body": "CHARLOTTE, N.C. --  While DeMarcus Cousins had another huge night, the All-Star was more excited about getting some big-time help from his teammates.\n\nCousins had 35 points and 18 rebounds, and four others Kings had at least 13 points as the Sacramento Kings beat the Charlotte Hornets 109-106 on Saturday night for their third win in the last four games.\n\nDarren Collison had 17 points, Anthony Tolliver added 14 and Aaron Afflalo and Willie Cauley-Stein chipped in with 13 apiece for the Kings (19-28).\n\n\"It makes my job a whole lot easier,\" said Cousins, who has 27 double-doubles this season. \"Guys have been great lately. They are believing. Their confidence is high, which we need, and we're just on the right path and we feel it.\"\n\nCousins scored the go-ahead basket with 14.3 seconds left on a driving layup from the right side of the lane, saying the only thing he saw was \"the basket.\"\n\n\"We are realizing what is going to win us games and it's not iso(lation) basketball,\" Cousins said. \"When we are making the defense work and getting the best shot for the team and just finding the open man, we are realizing that is working for us.\"\n\nBut Cousins proved again why he is a dominant force inside with seven offensive rebounds.\n\n\"Even when they did miss he got the rebound and put it in,\" Hornets coach Steve Clifford said.\n\nThe Hornets had a chance to take the lead in the closing seconds as Kemba Walker dished out to an open Frank Kaminsky at the top of the key, but the 7-footer shot an airball with 1 second remaining. Cousins grabbed the rebound and was fouled, making one free throw for the final margin.\n\n\"DeMarcus understands that the defense is giving him all sorts of looks,\" Collison said. \"The good thing about DeMarcus that I've seen if he's not scoring ball, he's telling guys to continue to hit their shots. He understands the game.\"\n\nTIP-INS\n\nKings: Outscored the Hornets 48-38 in the paint. ... Tolliver provided a big lift off the bench in the first half with 11 points on three 3-pointers.\n\nHornets: Walker has 34 20-point games this season. ... Clifford picked up his eighth technical foul of the season in the second quarter after arguing for a charge on Cousins against Walker. ... Walker moved into third place in franchise history in field goals made (2,586), passing Gerald Wallace. He is behind only Dell Curry and Larry Johnson.\n\nSTOPPING KEMBA\n\nWalker had 20 points in the third quarter and appeared to be heating up for a big fourth. But the Kings held him to one shot attempt and no points in the final quarter.\n\nWhen asked what his team did to stop Walker, Kings coach Dave Joerger joked, \"Put some stuff in his water down at their bench down there.\"\n\n\"He carries a big load for this team,\" Joerger said. \"He's well-deserving of the honor of being an All-Star. I've seen it only twice a year, but it always seems like especially in the last three minutes, you don't want the ball in his hands in a close game. Maybe we got into his legs. We tried to be up in pick-and-rolls and give him looks where you know, smaller guys don't like playing in small spaces. We just tried to take it out of his hands.\"\n\nTURNOVER ISSUES\n\nThe Hornets paid Nic Batum $120 million to make plays, and he's certainly doing that with 19 points, seven assists and seven rebounds.\n\nBut Batum's turnovers are beginning to become a concern. He has 31 in the last eight games, including four games with at least five.\n\nUP NEXT\n\nKings: Remain on the road, traveling to face Philadelphia on Monday night.\n\nHornets: Head to the West for a three-game road trip beginning Tuesday at Portland.",
  "source": "espn_api",
  "crawled_at": 1764995499.07405
}