{
  "game_id": "0021600109",
  "espn_id": "400899559",
  "date": "Nov 09, 2016",
  "matchup": "ORL vs. MIN",
  "headline": "Timberwolves thump Magic to earn first road win",
  "body": "ORLANDO, Fla. --  The Minnesota Timberwolves are a collection of young talented players who are still trying to figure out how to maintain big leads once they get them.\n\nOrlando, meanwhile, is just trying to find its way.\n\nOn Wednesday night, the Timberwolves may have taken a critical step in their journey, while the Magic are looking like they have far more questions than answers after Minnesota jumped to a 30-point first-half lead before coming away with a 123-107 victory.\n\nZach LaVine scored 37 points and Andrew Wiggins added 29 for the Timberwolves (2-5), who bounced back from a defensive meltdown a night earlier to record their first road win of the season.\n\n\"There is a small difference between winning and losing,\" said Minnesota coach Tom Thibodeau, whose team snapped a three-game losing streak. \"You take a hard look at the mental mistakes. The biggest thing is eliminating all of the ways you beat yourself first.\"\n\nFor the Timberwolves that meant not doing the little things to squander 20-plus point leads as they have done this season. When the Magic pulled within 11 points in the second half, Minnesota consistently came up with plays to stretch the lead back to 20. Tyus Jones came off the bench to come up with a couple of key steals for Minnesota, which made 13 3-pointers.\n\n\"That's what you can be,\" LaVine said. \"It doesn't matter whose hitting in a game, we find the man with the hottest hand. We have so many dynamic players on this team. Once we get it all clicking you get a result like this tonight.\"\n\nCoach Frank Vogel doesn't seem to have that luxury at this point as the Magic (3-5) got off to another slow start and found themselves vulnerable on defense all game. Orlando, which has lost two straight, allowed Minnesota to shoot nearly 52 percent from the field and 57 percent from 3-point range.\n\n\"We're working to correct (the letdowns), but we haven't figured it out yet,\" Vogel said. \"It's a long NBA season. Blowouts happen when you hit teams that are red hot. You hope you'll do better than we did tonight.\"\n\nKarl-Anthony Towns dominated inside with 20 points and 11 rebounds while Shabazz Muhammad scored 13 points and Gorgui Dieng had 12.\n\nNikola Vucevic led the Magic with 24 points and 14 rebounds, while Elfrid Payton had 18 points and Evan Fournier added 13.\n\nTIP-INS\n\nTimberwolves: Minnesota had lost eight straight in Orlando ... The Timberwolves rank fourth in the NBA in 3-point shooting at 38.8 percent entering Wednesday night's game ...The Timberwolves came into Wednesday night allowing 111.0 points and allowing opponents to shoot nearly 52 percent from the field during their last three games, all losses.\n\nMagic: Vogel got so frustrated with his starting unit that went to his bench quicker than usual, bringing in D.J. Augustin, Jeff Green and Bismack Biyomboa for Payton, Vucevic and Serge Ibaka in the first 4 minutes of the game. ... Orlando was averaging 16.0 second-chance points per game entering Wednesday night, which ranked them fourth in the NBA. Last season, the Magic averaged just 12.6 second-chance points.\n\nNO KNEE-JERK DECISIONS\n\nThere has been speculation that Vogel may be ready to make a change to his lineup, inserting Biyombo into the starting unit in place of Vucevic to improve the interior defense. But Vogel he doesn't feel such a move is necessary at this point.\n\n\"When it becomes apparent to me and I'm not a knee-jerk coach,\" he said when asked what will make him know it's time to make a change.  \"If it's needed you will see it. I wouldn't expect it anytime soon.\"\n\nSAME FACES, NEW PLACES\n\nVogel and Thibodeau met for years as Central Division foes as coaches of the Indiana Pacers and Chicago Bulls, respectively.\n\nThey are both starting over in new places this season with Thibodeau heading up the Timberwolves and Vogel coaching the Magic.\n\nUP NEXT\n\nTimberwolves: Return home after a three-game trip to take on the Los Angeles Clippers on Saturday.\n\nMagic: End a two-game home stint against the Utah Jazz on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995883.7698061
}