{
  "game_id": "0021600743",
  "espn_id": "400899449",
  "date": "Feb 02, 2017",
  "matchup": "HOU vs. ATL",
  "headline": "Howard has 24 points, 23 rebounds as Hawks rally past Rockets",
  "body": "HOUSTON -- Dwight Howard repeatedly insisted that this had nothing to do with revenge.\nHoward scored 24 points and grabbed 23 rebounds in his first game in Houston since signing with Atlanta in the offseason, leading the Hawks to a 113-108 victory over the Rockets on Thursday night.\n\"I didn't really think about it like that,\" Howard said. \"It wasn't like, `Aww, we've got to beat Houston because it's my first time back.' I just knew we needed the win.\"\nThe Hawks trailed by as many as 20 points and entered the fourth quarter down 13 before Howard led a late comeback.\nTim Hardaway Jr. had a career-high 33 points for Atlanta, including a driving dunk with less than a minute remaining that gave Atlanta a three-point lead. Hardaway scored 23 points in the fourth quarter, going 8 for 11 from the field, 3 for 5 from the 3-point line and 4 for 5 from the foul line.\nHoward said Hardaway gets a scary look on his face when he's angry enough to take over a game, and he saw it in the fourth quarter.\nTeammates teased Hardaway in the postgame locker room, jokingly providing him special services, such as bringing him deodorant and offering to make him a plate for his dinner.\n\"These guys can play all they want, but what was working was DeAndre' Bembry -- you've got to give him all the credit,\" Hardaway said. \"He took the challenge of guarding possibly the MVP of the season, it's a hard task, but he stayed discipline.\"\nBembry matched up with James Harden for nearly the entire fourth quarter, holding him to just six points.\nHarden finished with 41 points, eight assists and eight rebounds, but the Rockets struggled to make shots down the stretch. Clint Capela had 22 points and nine rebounds.\nHouston lost its lead when Hardaway was fouled on a driving layup and converted the free throw to give Atlanta a one-point lead with two minutes remaining.\nDuring the fourth-quarter rally, Hawks coach Mike Budenholzer made the bold call to leave starters Paul Millsap and Dennis Schroder on the bench to keep the streaking unit in the game.\n\"I think it speaks to the character of the team to keep fighting until you find the right group that gave us the chance to win,\" Budenholzer said. \"That group found a way without two of our best players and that was special.\"\nHoward, who spent the last three seasons in Houston, received a mostly warm welcome by the Toyota Center crowd, with some light, scattered boos.\n\"I appreciated my time here. I chose this city in free agency, and I chose it for a reason,\" Howard said. \"I think Houston is a great place, but with the business of basketball, I felt like coming home would be great for my career.\"\nHoward dominated the game early, winning the tip against Capela and scoring eight points in the first four minutes. He had a double-double before halftime.\nAfter a back-and-forth first half that featured 13 lead changes, the Rockets held a slim 50-47 lead at the break. Houston got separation early in the second half when Harden drained three 3-pointers in the first two minutes of the third quarter. Harden scored Houston's first 13 points of the quarter, extending the lead to nine.\nAfter hitting one fadeaway jumper in his red-hot third quarter, Harden gestured to a sideline spectator in a newsboy cap and gold chain: boxer Floyd Mayweather, who was in town for the Super Bowl.\n\"Man, we just relaxed,\" Harden said. \"Honestly, we did a good job in the first three quarters, and in the fourth quarter, I don't know what happened. Obviously, we didn't make shots, but defensively, we just relaxed. We didn't follow our principles.\"\nTIP-INS\nHawks: Thabo Sefolosha missed his third straight game with a groin injury. Hardaway started in his place. ... Mike Dunleavy left the game early in the fourth quarter with an apparent ankle injury and did not return.\nRockets: Before the game, SG Eric Gordon was selected as one of the eight participants in the 3-point shooting contest during NBA All-Star Weekend in New Orleans on Feb. 18. Gordon ranks second in the NBA with 170 3-pointers made, shooting 38.6 percent from the 3-point line.\nLATE ARRIVALS\nThe nationally televised game was sparsely attended for much of the first half. With a sizeable area of downtown blocked off for nearby Super Bowl festivities, traffic was heavy, parking was difficult and fans were rerouted around usual routes, causing a late-arriving crowd. Two courtside spectators who arrived on time to sit midcourt courtside next to Rockets owner Les Alexander were Hall of Fame centers Hakeem Olajuwon and Dikembe Mutombo.\nHONORING BATTIER\nAs part of their ongoing celebration of the franchise's 50th season, the Rockets honored former small forward Shane Battier with a video montage during the first half. Battier played five seasons in Houston from 2006 to 2011 and was named to the Rockets' all-decade team for the 2000s. At one point during the third quarter, Battier returned to his baseline seat to find a familiar face occupying his chair: former teammate and 7-foot-6 Hall of Famer Yao Ming.\nLIVE BY THE 3\nHouston went 13-for-51 (25.5 percent) from 3-point range, recording 50 3-point attempts for the sixth time this season. Only one other team has recorded 50 3s in a single game in NBA history. Houston has made 15 3s only twice in the past 11 games after doing so in 15 of 20 games prior.\nUP NEXT\nHawks: Host Orlando on Saturday night.\nRockets: Host Chicago on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764995762.281471
}