{
  "game_id": "0021701094",
  "espn_id": "400975840",
  "date": "Mar 25, 2018",
  "matchup": "CLE @ BKN",
  "headline": "James scores 37, Cavs beat Nets 121-114 for 5th straight win",
  "body": "NEW YORK --  LeBron James powered into the lane for his latest assault on the rim and a former teammate made an ultimately useless attempt to stop him.\n\n\"I should have just gotten out of the way,\" Joe Harris said.\n\nMight as well. There's no way right now to defend James even by staying in front of him -- or in Harris' case, beneath him.\n\nJames had 37 points, 10 rebounds and eight assists, and the Cleveland Cavaliers beat the Brooklyn Nets 121-114 on Sunday for their fifth straight victory.\n\nJames kept up his latest sensational stretch by going 14 for 19 from the floor, highlighted by the soaring slam over Harris. He reached 2,000 points in a season for the 10th time, joining Karl Malone and Michael Jordan as the only players in NBA history to do that.\n\nAssociate head coach Larry Drew, running the team in Tyronn Lue's place, was asked to make an MVP case for James.\n\n\"You just look at the stat sheet,\" Drew said, \"and it's just not about points, it's what he's doing on the boards, it's what he's doing from an assists standpoint. He's just a force. He's a force and I mean he has put up MVP numbers without a doubt.\"\n\nKevin Love added 20 points and 15 rebounds for the Cavaliers, who came in averaging 122.5 points during the streak and just about reached that even with a slow start. Jordan Clarkson had 18 points, George Hill scored 17 and Rodney Hood finished with 16.\n\nHarris scored a career-high 30 points for the Nets, who lost their third straight. Just as they did Friday in Toronto, the Nets hung in against one of the East's best but didn't have enough to pull it out.\n\nHarris' two free throws with 6:17 left gave Brooklyn its last lead at 100-99 before Cleveland ran off eight straight points. James had two baskets during the run, both backboard-shaking slams on lob passes.\n\nThe lead grew to 10, and when the Nets got it down to five, James halted their charge by running down the clock and nailing a 3-pointer that made it 119-111 with 39 seconds remaining.\n\n\"When we get stops we're very dynamic and that's what we did,\" James said.\n\nThe Cavs missed their first eight shots before James took one, which he made. He had 12 points in the first quarter, including his latest powerhouse dunk over Harris in the final seconds of the period.\n\nBut Harris rebounded nicely from being on the wrong end of James' highlight, going 8 for 9 in the first half and making all four of his 3-pointers as the Nets took a 62-60 lead.\n\nTIP-INS\n\nCavaliers: James had triple-doubles in two of the first three meetings with the Nets this season, including when the Cavs lost in Brooklyn in October. ... Cleveland played without forward Jeff Green because of an illness.\n\nNets: DeMarre Carroll had 18 points. He came in averaging 15.5 in March, the highest total of any month in his nine-year career. ... The Nets have just two home games remaining. Six of the Nets' final eight are on the road.\n\nLBJ 2K\n\nJames reached 2,000 points in a season for the first time since 2013-14. Malone (12) and Jordan (11) previously did it.\n\nDELIGHTFUL DUNK\n\nLove was on the bench for James' slam the end of the first quarter. He celebrated by running and jumping into the nearby backboard stanchion .\n\n\"I wasn't out there for the Portland game when LeBron had the dunk over (Jusuf) Nurkic,\" Love said of a recent James highlight dunk, \"but I was out there today and I was just having fun with it. It was fun to see. I love that type of play.\"\n\nLUE'S RECOVERY\n\nDrew said he spoke Saturday to Lue, who took a leave of absence from the team last week for unspecified health reasons. Drew said he didn't know when Lue planned to rejoin the Cavs but that he was on the road to recovery.\n\n\"He's back to being his old self with the cracking jokes and he's doing the things necessary from a health standpoint to get him back,\" Drew said.\n\nUP NEXT\n\nCavaliers: Visit Miami on Tuesday.\n\nNets: Visit Orlando on Wednesday.\n\n---\n\nFollow Brian Mahoney on Twitter: http://www.twitter.com/Briancmahoney",
  "source": "espn_api",
  "crawled_at": 1764993159.13121
}