{
  "game_id": "0021600705",
  "espn_id": "400900126",
  "date": "Jan 28, 2017",
  "matchup": "DET @ MIA",
  "headline": "Heat extend win streak to 7, top Pistons 116-103",
  "body": "MIAMI --  There was only one quarter in which Miami figured out how to slow down Detroit.\n\nThat was enough for the Heat.\n\nGoran Dragic scored 23 points, Wayne Ellington added 19 and the Heat pushed the NBA's longest current winning streak to seven games by topping the Pistons 116-103 on Saturday night.\n\nThe Heat outscored Detroit 26-12 in the fourth quarter, holding the Pistons to 30 percent shooting.\n\n\"Our toughest, most physical, most committed minutes were there at the end,\" Heat coach Erik Spoelstra said. \"That's what's good to see.\"\n\nJames Johnson scored 18 and Dion Waiters added 17 for the Heat, who tied a season high with 14 3-pointers. Ellington made three in a span of less than two minutes of the fourth quarter as Miami pulled away.\n\nMiami was 11-30 at the midway point of its season -- and hasn't lost since. Only Golden State, San Antonio and Houston have put together longer winning streaks this season than the Heat run of late.\n\n\"We are clicking on all cylinders,\" Waiters said. \"We're playing together, having fun, and guys are making plays. We're just playing the right way. We're healthy and it's fun.\"\n\nReggie Jackson scored 24 for Detroit, which got 17 points and 20 rebounds from Andre Drummond. Tobias Harris added 16 points and Marcus Morris scored 14.\n\n\"Down the stretch we were terrible. Terrible,\" Pistons coach Stan Van Gundy said. \"We didn't make plays. We've got to find better stuff down the stretch. ... I don't know if defenses have us figured out or what, but we're just not making plays.\"\n\nEllington's first in that late trio of 3s came with 4:38 left, giving the Heat a nine-point lead. He struck again about a minute later, and the last of those with 2:55 remaining put Miami up 114-101.\n\nMiami won despite getting outscored 62-40 in the paint. The Heat more than made up for that by outscoring Detroit 42-12 from 3-point range, and somehow looker fresher down the stretch -- even though Miami was on a back-to-back and Detroit had not played since Monday.\n\n\"We had time off to prepare and figure ourselves out and hone in on what's going to separate us from other teams in the fight from teams that are going to fade,\" Jackson said. \"Defensively we've just got to be better.\"\n\nTIP-INS\n\nPistons: Detroit came in allowing 101 points per game; the Heat got to 101 points with 7:26 remaining. ... Drummond had his 30th double-double of the season secured by halftime. ... The Pistons were averaging 98.5 points entering January; through 12 games this month, they're averaging 106.8 per game.\n\nHeat: Tyler Johnson (shoulder) missed his fifth straight game, but may play Monday against Brooklyn. ... The Heat are now 7-0 since calling Okaro White up from Sioux Falls in the NBA Development League ... Udonis Haslem's son Kedonis, a standout lineman at Florida high school football power St. Thomas Aquinas, announced his commitment to play at Toledo on Saturday.\n\nWHITESIDE RETURNS\n\nHassan Whiteside returned to Miami's starting lineup, after missing Friday's win in Chicago with ankle soreness. He finished with nine points and 12 rebounds -- with five points and six boards in the fourth quarter alone.\n\nHOT SHOTS\n\nEven with Kentavious Caldwell-Pope struggling (2 for 11), Detroit's starters shot 31 for 59 in the game -- 53 percent.\n\nUP NEXT\n\nPistons: Visit Boston on Monday, ending a two-game trip. Detroit is 1-1 against the Celtics this season.\n\nHeat: Host Brooklyn on Monday, the Nets' only trip to Miami this season. The Heat won in Brooklyn on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764996054.189656
}