{
  "game_id": "0022000309",
  "espn_id": "401267469",
  "date": "Jan 31, 2021",
  "matchup": "TOR vs. ORL",
  "headline": "Raptors snap 3-game losing streak, beat Raptors 115-102",
  "body": "TAMPA, Fla. -- — Pascal Siakam has been getting to the rim and it's paying off for the Toronto Raptors.\n\n\r\n                    Siakam had 30 points and 10 rebound, leading the Raptors to a 115-102 win over the Orlando Magic on Sunday night.\n\n\r\n                    Siakam had his second straight 30-point game and the Raptors snapped a three-game losing streak.\n\n\r\n                    “I've been feeling a little better, and I've been focusing on doing the things that make my body feel good, and living with the results,” said Siakam, who had been nagged by injuries early in the season. “That's been working for me in the last few weeks. I've been healthy. I've been taking the right shots and the shots are going to fall.”\n\n\r\n                    Kyle Lowry had 12 points and 14 assists, and Aaron Baynes aded eight points and 16 rebounds for the Raptors. Uta Watanabe came off the bench and hit all three of his 3-pointers on the way to 11 points.\n\n\r\n                    Rookie Cole Anthony led Orlando with 16 points. Nikola Vucevic added 15 points and 14 rebounds for the Magic, who have lost 11 of 13. \n\n\r\n                    Magic forward Aaron Gordon left the game in the third quarter with an ankle injury after scoring 14 points.\n\n\r\n                    Orlando shot 40% for the game and the Magic's only lead came at 3-2 after a 3-pointer by Gordon.\n\n\r\n                    The Raptors led 58-44 after a first half in which Orlando shot 36% and Vucevic scored only three points.\n\n\r\n                    A couple of 3-pointers by Terence Davis helped Toronto stretch the lead to 16 points in the third quarter. Davis scored 12 points in his second start of the season.\n\n\r\n                    Anthony and Vucevic did most of the scoring on a modest run that helped Orlando cut the gap to eight early in the fourth quarter. But Watanabe nailed a 3-pointer and the Raptors pulled away.\n\n\r\n                    “I'm getting an opportunity and I'm doing my job to help the team win,” said the 26-year-old Watanabe, who has averaged 19 minutes over the last five games. “I've never had an opportunity like this and I can't take it for granted.”\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: A lane runner by Evan Fournier was Orlando’s only 2-point field goal in the first 11 minutes. ... Vucevic moved past Scott Skiles, into eight place on Orlando's list for free throw attempts.\n\n\r\n                    Raptors: Siakam shot 12 fr 23, all but two of his shots from near the basket. . . . F OG Anunoby missed a third game with a calf injury and G Marvin Powell missed a second game with a quad injury. Powell hopes to play Tuesday. ... Baynes had 10 rebounds in a scoreless first half.\n\n\r\n                    DEFENSIVE DIFFERENCE\n\n\r\n                    The Raptors were 15-5 after 20 games last season, and 34-15 at the end of January in a season in which they gave up an NBA-low 106.5 points per game.\n\n\r\n                    “After the long (2019) playoff run, we came back and picked up right where we left off,” Nurse said. “We came back last year and we were way ahead of schedule defensively, and we’re probably a good chunk behind it this year.”\n\n\r\n                    Toronto has given up an average of 116.7 points in 12 losses.\n\n\r\n                    ROSS IN RELIEF\n\n\r\n                    Terrence Ross, the Raptors’ first-round draft choice in 2012, has not started a game for since Nov. 25, 2017. He has come off the bench in his last 172 games for the Magic. “He’s so comfortable in his role and he plays starter’s minutes, finishes every game,” explained Magic coach Steve Clifford. “He gives us a better chance to be balanced.”\n\n\r\n                    UP NEXT\n\n\r\n                    Magic: Play the Raptors on Tuesday night in the first of three straight home games. \n\n\r\n                    Raptors: Tuesday's game in Orlando will open a six-game trip.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996877.839413
}