{
  "game_id": "0021800727",
  "espn_id": "401071400",
  "date": "Jan 25, 2019",
  "matchup": "CHA @ MIL",
  "headline": "NBA-leading Bucks rally to beat Hornets 108-99",
  "body": "MILWAUKEE --  Seldom-used Pat Connaughton and a defensive switch sparked the NBA-leading Milwaukee Bucks.\n\nAnd Connaughton didn't even score.\n\nGiannis Antetokounmpo had 34 points and 14 rebounds and Milwaukee rallied to beat Charlotte 108-99 on Friday night, outscoring the Hornets 32-12 in the fourth quarter.\n\nMalcolm Brogdon added 19 points, Eric Bledsoe had 18, and Khris Middleton 15 to help the Bucks improve to 35-12 with their sixth straight victory. They are 22-4 at home.\n\n\"Once we switched up our coverages and made them play a lot of 1-on-1, it changed the game for us,\" Bledsoe said. \"We were taking the ball out (of the net) all game, up until the end. We started to get stops, get out and get transition shots, drive and kick. We did a great job.\"\n\nDown 92-80 with 9:45 left, the Bucks fought back with an 11-0 run. They finally took the lead on Brogdon's drive with 5:34 left. After Walker scored, Antetokounmpo did a huge spin and dunked with one hand to put the Bucks up 97-96.\n\nBucks coach Mike Budenholzer inserted Connaughton in the final minute of the third quarter, with the Bucks looking ragged. Connaughton's energetic defense helped energize Milwaukee, and he remained in the game until the final 25 seconds.\n\n\"I've always prided myself on trying to make winning plays, whatever that may be,\" Connaughton said. \"For professional athletes, that's our job to be ready. This team is unique. We have guys one through 15 who have made an impact on the season at some point.\"\n\nConnaughton had not played in six of the previous nine games.\n\n\"It's just mostly gut,\" Budenholzer said. \"We were in a little bit of mud. Just see if we could find a spark. I don't think he made a basket but he had as big an impact on the game as anybody. The crowd's energy and Pat's energy really lifted us up in the fourth quarter.\"\n\nCharlotte star Kemba Walker was injured in a scrum with 2:06 left when Antetokounmpo landed him. Walker headed directly to the locker room. Nicolas Batum led the Hornets with 19 points, Jeremy Lamb and Michael Kidd-Gilchrist each had 16, and Walker had 10 on 3-of-12 shooting.\n\n\"We played well for 42 minutes,\" Batum said. \"This is the best team in the East, maybe one of the top two teams in the NBA right now. They've got one MVP candidate, they've got a great coach and they play well, especially at home. It's been three games and we've played those guys, we've had a chance to win every time. We moved the ball really well. But they did a good job the last 6 minutes, being more aggressive on defense and they scored in transition every time.\"\n\nTIP-INS\n\nHornets: Tony Parker sat out to rest. The former San Antonio star scored 17 points in 17 minutes off the bench in the Hornets' 118-107 victory at Memphis on Wednesday night. \"What he's done in fourth quarters, you talk about experience, you talk about basketball IQ and knowledge and winning plays,\" Bucks coach Mike Budenholzer said. \"He's got a whole data base of what it takes to win games, and he can dial it up in those moments.\" ... Walker collided with Antetokounmpo in a scramble for a loose ball late in the game and suffered what the team termed a mild neck sprain. Walker went to the locker room and did not return in the final 2 minutes.\n\nBucks: Rookie guard Donte DiVincenzo was inactive because if a left heel injury. He left the arena in a walking boot after the game. \"We may just need to give him an extended period of rest or non-activity and be exceedingly cautious,\" Budenholzer said. \"Part of it is Donte wants to play so bad and he's such a hard worker. Sometimes when you're coming back from some of these injuries it can actually work against you. You just need to give it some time.\" The Bucks have plenty of backcourt options off the bench with Sterling Brown, George Hill and Tony Snell in the current rotation.\n\nUP NEXT\n\nHornets: Host New York on Monday night.\n\nBucks: At Oklahoma City on Sunday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994381.0692842
}