{
  "game_id": "0021901290",
  "espn_id": "401224765",
  "date": "Aug 09, 2020",
  "matchup": "SAC vs. HOU",
  "headline": "Rivers has career-high 41 as Rockets down Kings 129-112",
  "body": "LAKE BUENA VISTA, Fla. --  Austin Rivers scored a career-high 41 points off the bench and the Houston Rockets used a big third quarter to pull away and cruise to a 129-112 victory over the Sacramento Kings on Sunday night.\n\n\"He's been playing well and obviously, tonight was his night,\" coach Mike D'Antoni said. \"He played great.\"\n\nRivers made six 3-pointers as Houston improved to 4-1 at Disney on a night the Rockets played a second straight game without Russell Westbrook, who has a bruised right quadriceps.\n\n\"I believe I'm a premier scorer. That's just how I feel,\" Rivers said. \"But I'm on a team where that's not required of me. Every night I play with the best scorer in the NBA, and I play with one of the other best scorers too with James (Harden) and Russ. So you've got to play a role and buy in. That's what winning basketball is.\"\n\nHarden added 32 points, eight rebounds and seven assists for Houston.\n\nThe Kings fell to 1-5 in the bubble after being eliminated from playoff contention earlier Sunday when Portland beat the 76ers. Sacramento's playoff drought is now 14 years, which is the longest active streak in the NBA.\n\n\"We have to understand and change our mindset as far as what it takes to win,\" Sacramento coach Luke Walton said. \"The main thing I hope we take from this whole bubble experience is learning that lesson firsthand and playing these type of games night in and night out.\"\n\nDe'Aaron Fox had 26 points for the Kings.\n\nD'Antoni was impressed with Houston's work on defense Sunday and likes how his team has improved in that area since it's been in Florida.\n\n\"I think they're starting to enjoy it even,\" he said. \"So, lot of emphasis on it, a lot of talk and everybody has bought in so it makes it fun to play that way.\"\n\nThe Rockets were up by 24 early in the fourth quarter when Sacramento used an 8-0 run to cut the lead to 97-81 with about 9  1/2 minutes remaining.\n\nRivers made two free throws after that before the Kings used a 7-2 run, with 3s from Bogdan Bogdanovic and Buddy Hield, to make it 102-88 with about 8 minutes to go.\n\nHouston got back on track after that, using a 11-4 run to push the lead to 113-92 with less than 5 minutes left and most of the Rockets starters went to the bench for good after that.\n\nHouston was up by seven in the third quarter before scoring the next eight points, with 3s from Ben McLemore and Robert Covington, to make it 74-59 with about 7  1/2 minutes left in the quarter.\n\nA shot by Harrison Barnes got the Kings within 14 points later in the third before a 12-4 spurt by Houston extended the lead to 91-69 with about a minute left in the third.\n\nTIP-INS\n\nRockets: D'Antoni said Westbrook and Eric Gordon (sprained left ankle) could both return for the next game on Tuesday. Gordon hasn't played since the season restarted after he was injured in a scrimmage. ... McLemore had 20 points and made six 3-pointers.\n\nKings: Richaun Holmes sat out with right hip soreness. ... Kent Bazemore didn't play because of a sore left calf. ... Barnes had 11 points and 10 rebounds.\n\nUP NEXT\n\nRockets: Play San Antonio on Tuesday.\n\nKings: Play New Orleans on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764996372.826795
}