{
  "game_id": "0022400900",
  "espn_id": "401705466",
  "date": "Mar 06, 2025",
  "matchup": "PHI @ BOS",
  "headline": "Tatum scores 35 to carry load for short-handed Celtics in 123-105 win over 76ers",
  "body": "BOSTON -- — Jayson Tatum had 35 points and seven rebounds and the Boston Celtics powered past the Philadelphia 76ers 123-105 on Thursday night. \n\n\r\n              It was Tatum’s 24th game this season with at least 30 points even though he sat out the entire fourth quarter as Boston won for the ninth time in its last 11 games.\n\n\r\n              Payton Pritchard added 19 points and Derrick White finished with 12 points after having one of his teeth knocked out in the first half when he took an inadvertent elbow. But he returned to start the third quarter.\n\n\r\n              Kelly Oubre Jr. led the 76ers with 27 points and Lonnie Walker IV added 17.\n\n\r\n              Both teams were short-handed.\n\n\r\n              The Celtics played without Jaylen Brown (knee), Jrue Holiday (finger), Al Horford (toe), Kristaps Porzingis (illness) and Sam Hauser (ankle). \n\n\r\n              The 76ers were missing Joel Embiid (knee), Paul George (left groin), Eric Gordon (wrist), Kyle Lowry (hip), Tyrese Maxey (back) and Jared McCain (knee). \n\n\r\n              Takeaways\r\n              76ers: Oubre tried to carry the scoring load on a night when he was surrounded by reserves. But he didn’t get nearly enough help.\n\n\r\n              Celtics: As Boston gets over some recent ailments, young players continue to have some promising moments. Neemias Queta was scolded by coach Joe Mazzulla after a first-half stint, but was mostly solid down the stretch, finishing with eight points, nine rebounds and and four assists.\n\n\r\n              Key moment\r\n              The Celtics led 97-79 heading into the fourth quarter. They then opened the final period on a 10-0 run that included six straight points – and back-to-back dunks – by Queta as Boston’s lead grew to 30.\n\n\r\n              Key stat\r\n              In the third quarter Tatum was whistled for his 10th technical foul of the season. That leaves him six away from a one-game suspension. \n\n\r\n              Up next\r\n              The 76ers host Utah on Sunday night. The Celtics host the Los Angeles Lakers on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998208.178686
}