{
  "game_id": "0022400263",
  "espn_id": "401704829",
  "date": "Nov 21, 2024",
  "matchup": "LAL vs. ORL",
  "headline": "Franz Wagner hits a clutch 3, and the Magic exploit Davis' mistakes for a 119-118 win over Lakers",
  "body": "LOS ANGELES -- — Franz Wagner hit a go-ahead 3-pointer with 2.5 seconds to play, and the Orlando Magic roared back to snap the Los Angeles Lakers' six-game winning streak with a 119-118 victory Thursday night.\n\n\r\n              Anthony Davis missed two free throws with 19 seconds left and then missed an 18-foot jumper at the buzzer for the Lakers, who lost to a Magic team playing without three starters in its third game in four nights.\n\n\r\n              Wagner scored 15 of his 37 points in the fourth quarter and added 11 assists for the Magic, who have won seven of eight. Jalen Suggs added 23 points, and Moritz Wagner had a season-high 19.\n\n\r\n              Davis had 39 points and nine rebounds for the Lakers, while LeBron James scored 14 of his 31 points in the fourth quarter.\n\n\r\n              Los Angeles lost at home for the first time in eight games.\n\n\r\n              Kentavious Caldwell-Pope missed the game for personal reasons, while Wendell Carter Jr. (plantar fasciitis) missed his 10th straight game. Paolo Banchero (oblique) is still out.\n\n\r\n              Rui Hachimura (ankle) missed his fourth straight game for LA, and Bronny James (heel bruise) missed his second straight.\n\n\r\n              Takeaways\r\n              Magic: This was an impressive outing from a short-handed team. Orlando didn't look tired in the slightest, with Suggs and the Wagners leading a feisty, mature group performance. The Magic appear ready to build on last season's breakthrough to become a contender in the East.\n\n\r\n              Lakers: James and Davis took over down the stretch yet again, but Davis came up short in the clutch.\n\n\r\n              Key moment\r\n              James and Davis combined to miss four of six free throws in the final 39 seconds, leaving the door open for Orlando.\n\n\r\n              Key stat\r\n              The Wagners scored 20 of Orlando's 30 points in the fourth quarter.\n\n\r\n              Up next\r\n              Magic: Host Detroit on Saturday. Orlando is 7-0 at home.\n\n\r\n              Lakers: Host Denver on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_api",
  "crawled_at": 1764997209.648881
}