{
  "game_id": "0022000019",
  "espn_id": "401267179",
  "date": "Dec 23, 2020",
  "matchup": "SAC @ DEN",
  "headline": "Hield tip-in leads Kings to 124-122 overtime win in Denver",
  "body": "DENVER -- — Nikola Jokic recorded his standard triple-double but his cohort was on the bench fouled out by overtime and his late-game heroics were a little rusty.\n\n\r\n                    Harrison Barnes stole the ball from Jokic with 2.6 seconds left and Buddy Hield tipped in his miss at the buzzer, sending the Sacramento Kings storming off the court with a stunning 124-122 win over the Denver Nuggets in overtime Wednesday night.\n\n\r\n                    Jokic recorded a triple-double with 29 points, 15 rebounds and 14 assists, but he had a crucial offensive foul with 2.6 seconds left in regulation that denied Denver a chance to win it in regulation and he watched helplessly as Barnes stole the ball in the chaotic closing moments of overtime.\n\n\r\n                    Hield led Sacramento with 22 points and Barnes and De’Aaron Fox each added 21 for the Kings, who snapped a six-game skid in Denver, where they had last won on Jan. 3, 2017.\n\n\r\n                    Fox also had a key block of Will Barton’s layup with 10.6 seconds remaining in overtime and Barnes grabbed the long rebound and raced downcourt to for a layup that tied it at 122 with 6.5 seconds left.\n\n\r\n                    Denver called timeout, but Barnes punched the ball away from Jokic, then raced for a 4-foot dunk that Barton blocked. Hield tipped it in just before the buzzer, then raced off the court and through the tunnel at the newly renamed Ball Arena.\n\n\r\n                    Michael Porter Jr. scored 24 points for Denver despite early foul trouble, but playoff star Jamal Murray was held to five points and was 1-for-9 shooting before fouling out late in regulation.\n\n\r\n                    “I’d be lying if I told you our defense had a lot to do with that,” Kings coach Luke Walton said. “When you’re as good as Jamal Murray and you have a shooting night like that, that’s more him having an off-night. Now, I give our guys credit for competing and making it hard for him. But he sees that every night.\n\n\r\n                    “I actually feel bad for whoever has to guard him next time out. I’m assuming he’ll probably have a pretty good game. But our guys did a heck of a job competing.”\n\n\r\n                    Before the game, Nuggets coach Michael Malone was asked if Murray could match his playoff prowess in the new season, and he used the opportunity to talk about how the team’s first trip to the Western Conference Finals in a decade last summer was already old news.\n\n\r\n                    “As great as last season was -- I’m going to keep saying this -- that season is over,” Malone said. “That was a different team. Yes, we have our core back, but we have seven new players. As great as it was to win our division, to get to the Western Conference Finals, to comeback from two 3-1 deficits; starting tonight, who cares? That’s over.”\n\n\r\n                    Murray emerged as a bona fide star in the bubbled playoffs in Florida, but Malone said Murray, Jokic and everyone else has to forget about that run now.\n\n\r\n                    “We can’t rely on that,” Malone said. “That is ancient history in my eyes. Now, Jamal has a challenge of being that player for 72 games. He did it at a high level for 19 games in the playoffs. Now, this is the beginning of the 2020-2021 season, can Jamal Murray bring it every night and help this team reach even greater heights? \n\n\r\n                    “Our goal has still been, we haven’t obtained our goal yet, and that is to win a championship. Jamal is going to be a big part of that.”\n\n\r\n                    After the game, Malone pointed to the Kings' 36-24 third quarter as the key to Denver's disappointment, and Jokic concurred, saying, “We relaxed. We played a really good first half. They came out of (halftime) really aggressive with a lot of energy and picked up the tempo of the game. We didn’t match it.”\n\n\r\n                    TIP-INS\n\n\r\n                    Kings: Corey Joseph had 12 points in 12 minutes off the bench in the first half. ... Sacramento didn't lead at all in the first half, and there was only one tie before halftime, at 7-7.\n\n\r\n                    Nuggets: Murray missed all five of his 3-pointers but made all seven of his free throws. ... The Nuggets were outrebounded 53-45 although no Kings reached double digits off the glass (four Sacramento players had nine boards).\n\n\r\n                    UP NEXT\n\n\r\n                    Kings: Open their home slate Saturday night against the Phoenix Suns, whom they’ll also host on Sunday night.\n\n\r\n                    Nuggets: On Christmas night, they host the Los Angeles Clippers, one of the teams they rallied to beat in the playoffs after falling into a 3-1 hole, a development that led to a Clippers offseason shakeup.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997208.028679
}