{
  "game_id": "0022401002",
  "espn_id": "401705568",
  "date": "Mar 19, 2025",
  "matchup": "OKC vs. PHI",
  "headline": "Jaylin Williams' triple-double helps short-handed Thunder cruise past 76ers 133-100",
  "body": "OKLAHOMA CITY -- — Jaylin Williams scored a career-high 19 points and had 17 rebounds and 11 assists for his second career triple-double, and the Oklahoma City Thunder cruised past the injury-depleted Philadelphia 76ers 133-100 on Wednesday night with Shai Gilgeous-Alexander and three other starters sidelined.\n\n\r\n              Gilgeous-Alexander, the NBA's top scorer at 33.0 points per game and a leading MVP candidate, sat out for rest, while Lu Dort, Isaiah Hartenstein and Jalen Williams got the night off because of injuries.\n\n\r\n              Aaron Wiggins scored 26 points for the Western Conference-leading Thunder, who clinched the Northwest Division title and moved closer to wrapping up the No. 1 seed in the Western Conference.\n\n\r\n              Isaiah Joe added 21 points and Chet Holmgren scored 19 for Oklahoma City, which led 70-56 at halftime and 103-74 after three quarters.\n\n\r\n              Quentin Grimes scored 28 points and Justin Edwards added 19 for Philadelphia, which was without injured starters Tyrese Maxey, Kelly Oubre Jr., Joel Embiid and Paul George. Embiid and George are out for the rest of the season.\n\n\r\n              The teams combined to shoot 109 3-pointers. Philadelphia set a franchise record with 57 attempts.\n\n\r\n              Takeaways\r\n              76ers: Coach Nick Nurse's patchwork lineup kept the game competitive in the first half, but could not match Oklahoma City's depth after halftime.\n\n\r\n              Thunder: With reserves getting more playing time, seven players scored in double figures, including Branden Carlson (16), Kenrich Williams (13) and Dillon Jones (11).\n\n\r\n              Key moment\r\n              Oklahoma City went on a 33-14 run to stretch its lead to 29 points by the end of the third quarter.\n\n\r\n              Key stat\r\n              Oklahoma City made 24 of 56 3-point attempts (46.2%). Philadelphia was 18 of 57 (31.6%).\n\n\r\n              Up next\r\n              The 76ers visit San Antonio on Friday, and the Thunder host Charlotte on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997500.319638
}