{
  "game_id": "0022301088",
  "espn_id": "401585716",
  "date": "Apr 01, 2024",
  "matchup": "MEM @ DET",
  "headline": "Jaren Jackson Jr. scores 40, Grizzlies hang on to beat Pistons 110-108",
  "body": "DETROIT -- — Jaren Jackson Jr. scored 27 of his 40 points in the second half and the Memphis Grizzlies held on for a 110-108 victory over the Detroit Pistons on Monday night.\n\n\r\n              Grizzlies coach Taylor Jenkins thinks Jackson has reached a new level since moving to center.\n\n\r\n              “JJ was phenomenal tonight,” Jenkins said. “Not just 40 points, but he was playing downhill and getting to the line. It is really impressive what he's done since probably the middle of January, when we made the change.”\n\n\r\n              Memphis trailed 57-44 at halftime, but Jackson scored 21 points in a 41-point third quarter.\n\n\r\n              “Halftime was huge,” Jackson said. “We regrouped and stopped playing like we were down 100 points. Coach told us to play like we were down one.”\n\n\r\n              Cade Cunningham, who finished with 36 points, missed a tying 12-footer as time expired.\n\n\r\n              “I told Cade that he's going to win us a playoff game someday like that,” Pistons coach Monty Williams said. “(By) playing the way he did down the stretch tonight.”\n\n\r\n              Jackson went 13 of 23 from the floor and 12 of 14 from the free-throw line. Former Piston Luke Kennard added 19 points and eight assists for Memphis, which had lost three straight and seven of eight.\n\n\r\n              “Things started to go our way in the second half,\" Jackson said. “We started moving the ball and Luke went crazy.”\n\n\r\n              Detroit has lost nine of 10.\n\n\r\n              Memphis had a 110-108 lead when a loose ball went out of bounds with 1:04 left.\n\n\r\n              The Pistons were given the ball, but Jenkins challenged. Replay showed it had gone out of bounds off Detroit rookie Chimezie Metu's foot.\n\n\r\n              GG Jackson missed a shot with 50 seconds left, and then Metu missed a 3-pointer with 36 seconds to play. Jackson missed a layup, giving Cunningham his final chance.\n\n\r\n              “I didn't think I was going to be that wide open on the last play and I missed,” Jackson said. “I was really glad to hear the buzzer after that.”\n\n\r\n              Pistons center Jalen Duren left the game in the first quarter with a facial injury. Williams didn't have an update after the game.\n\n\r\n              Detroit used an 18-3 run late in the second quarter to take a 57-44 halftime lead. Cunningham and Jaden Ivey combined for 35 points on 14-of-19 shooting in the first half. Jackson had 13 for Memphis before lighting up the Pistons in the second half.\n\n\r\n              “I wasn't displeased with our defense against (Jackson),” Williams said. “We could be in better help position, but he did a really good job of initiating contact.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Visit Milwaukee on Wednesday.\n\n\r\n              Pistons: Visit Atlanta on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995989.993773
}