{
  "game_id": "0021900769",
  "espn_id": "401161411",
  "date": "Feb 07, 2020",
  "matchup": "MEM @ PHI",
  "headline": "Korkmaz, Simmons lead 76ers past Grizzlies 119-107",
  "body": "PHILADELPHIA --  The 76ers needed to get back to their home court to get back on track. Furkan Korkmaz’s shooting helped, too.\n\nKorkmaz scored a career-high 34 points, Ben Simmons added 22 points and 10 assists and Philadelphia snapped a four-game losing streak with a 119-107 victory over the Memphis Grizzlies on Friday night.\n\n“We needed this,” Simmons said.\n\nJoel Embiid didn’t come out after halftime due to a stiff neck. He finished with 10 points and 10 rebounds in 16 minutes for the 76ers, who improved to an NBA-best 23-2 at home.\n\nKorkmaz made 13 of 17 shots, including 7 of 9 3-pointers.\n\n“It was a tough week,” Korkmaz said. “Everybody brought their spirit, everybody helped each other and everybody looked good on the court.”\n\nThe 76ers were glad to be back in Philadelphia after a dismal four-game road trip that saw them get outscored by 73 total points while allowing an average of 123 points per contest in defeats to Atlanta, Boston, Miami and Milwaukee. Those losses dropped the 76ers’ road record to 9-19.\n\nThe latest road defeat, Thursday’s 112-101 setback at Milwaukee, came after a players-only meeting following Monday’s 137-106 blowout at Miami.\n\nJa Morant had 15 points to pace Memphis, which lost for just the fourth time in 17 games. The Grizzlies, who last made the playoffs in 2017, entered 3½ games ahead of Portland for the final postseason berth in the Western Conference.\n\n“They just executed at a really high level and imposed their will,” Memphis coach Taylor Jenkins said.\n\nGetting to the playoffs was considered an afterthought for the 76ers, who began the season as title contenders. But Philadelphia was the No. 6 seed if the playoffs started Friday.\n\nThe 76ers were out of sync offensively during their skid, and coach Brett Brown has been trying to mesh All-Stars Simmons and Embiid without success of late.\n\n“It’s a good problem to have – if it’s a problem,” 76ers GM Elton Brand said prior to the game.\n\nBrand made some moves this week to help Brown.\n\nPhiladelphia acquired some outside shooting and bench production with the additions of Glenn Robinson III and Alec Burks from Golden State for three second-round picks. Neither was available for Friday’s game, and their first appearance could come in Sunday’s home contest against Chicago.\n\nRobinson and Burks were added for their outside shooting, something Korkmaz provided in a strong first half for Philadelphia.\n\nKorkmaz had 20 points while making 8 of 9 shots, including 4 of 5 3-pointers, to help the 76ers take a 58-44 lead at the break. Simmons added 16 points and helped Philadelphia pull away late in the second quarter with five points in the final 40.9 seconds, including a pair of free throws after getting fouled following a steal of an unsuspecting Morant at midcourt.\n\nEven without Embiid, it was all 76ers after the intermission.\n\nSimmons fed Matisse Thybulle for a dunk that gave Philadelphia its largest lead to that point, 74-51 with 7:28 left in the third quarter. And then Simmons stripped Kyle Anderson following a timeout, finishing with a two-handed jam that put Philadelphia up 25 points.\n\nThe lead eventually grew to 33 points.\n\nCOMING SOON\n\nThe Grizzlies also were without their newly acquired players.\n\nNeither Jordan Bell, Justise Winslow, Gorgui Deng nor Dion Waiters suited up. Jenkins said prior to the game he is looking forward to getting the new players into the fold.\n\n“They’re just going to enhance what we’re building here,” he said. “I’m very excited about the new guys coming in. I’m excited to get them in the fold and get them up to speed in what we’re doing.”\n\nBRAND BACKS BROWN\n\nBrand gave his support to Brown prior to the contest.\n\n“I believe in Brett’s ability to lead this team,” Brand said.\n\nBrown has come under fire of late for the 76ers’ struggles, particularly on the road.\n\n“We have to fix that,” Brand said. “We can do it and will do it.”\n\nTIP-INS\n\nGrizzlies: Grayson Allen (hip) missed his seventh straight contest. … Jenkins, a Penn graduate, stopped by his alma mater to talk to a student group and visited his favorite cheesesteak spot.\n\n76ers: Josh Richardson returned to the court after sitting out five games due to a hamstring injury. He had four points in 15 minutes. … Philadelphia waived Jonah Bolden and signed Norvel Pelle. Pelle played in 14 games this season. He scored five points.\n\nUP NEXT\n\nGrizzlies: At Washington on Sunday.\n\n76ers: Host Chicago on Sunday.\n\n--\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995699.6607301
}