{
  "game_id": "0021500251",
  "espn_id": "400828138",
  "date": "Nov 29, 2015",
  "matchup": "MEM vs. PHI",
  "headline": "76ers tie NBA worst with 0-18 start after loss to Grizzlies",
  "body": "MEMPHIS, Tenn. --  The Philadelphia 76ers were again poised to end their losing streak. And, as has happened lately, they were unable to close the deal.\n\nThe Memphis Grizzlies used a late fourth-quarter rally to erase a Sixers lead and capture a 92-84 victory on Sunday, sending Philadelphia to its NBA-record 18th straight loss to start the season.\n\nThe loss matched the 0-18 opening by the 2009-10 New Jersey Nets, and marked the 28th consecutive defeat for the Sixers -- the longest such streak ever in the four major United State sports.\n\n\"We did not want to be that team to (lose to the Sixers) because we'll be in the history books for that reason,\" said Memphis guard Mike Conley, who led the Grizzlies with 20 points. \"The games are tough. You can only do wrong. They can do anything they want. They're just trying to do whatever they can to win.\"\n\nZach Randolph had 17 points and 11 rebounds for Memphis, while Matt Barnes and Jeff Green finished with 13 points apiece as Memphis won for the seventh time in the last nine.\n\nIsaiah Canaan led the Sixers with 16 points, while Robert Covington and Hollis Thompson scored 12 points each. Jerami Grant finished with 11 points.\n\nNeither team took care of the basketball, with Memphis committing a season-high 26 turnovers and Philadelphia having 27.\n\n\"We turned it over a few times. Missed some shots,\" said Philadelphia center Jahlil Okafor, who had nine points and 13 rebounds. \"They hit some big 3s down the stretch. ...That was the end of the game.\"\n\nThe Sixers led 76-71 with 7:38 remaining and Memphis fans were booing their team. But the Grizzlies went on a 15-1 run to retake control of the game, with Randolph scoring eight points in the rally.\n\nThe Sixers, as they've done in recent games, were competitive, especially because Memphis was struggling. Thompson's 3-pointer in the closing seconds of the third -- the Sixers were 7 of 11 in the period -- gave Philadelphia a 67-64 lead entering the fourth.\n\n\"We knew if you were going to play halfcourt and get into a fistfight with these men -- and they're playoff-experienced men -- that doesn't favor us,\" Philadelphia coach Brett Brown said. \"If you can play with pace and play with space and avoid the fistfight, you knew you had the best chance of being in the game and stealing a win.\"\n\nThat appeared as a possibility with the Sixers holding a five-point lead, Memphis coach Dave Joerger calling timeout and the boos increasing. About that time, Memphis came out of its haze.\n\n\"I thought our concentration was something we really struggled with,\" Joerger said, \"and getting the shots we were looking for and having the urgency defensively to get back.\"\n\nTIP-INS:\n\n76ers: F/C Nerlens Noel missed his second straight game with right knee soreness. ... The Sixers' 31 first-half points were the lowest by a Memphis opponent since Indiana scored 30 on March 22, 2014. ... The Sixers' last win was 99-85 over the Denver Nuggets on March 25.\n\nGrizzlies: Randolph returned after missing five games with right knee soreness. ... Green made his 37th consecutive free throw in the first half, breaking Marc Gasol's record of 36 set six days ago. Prior to Gasol, the mark was held by Anthony Peeler with 35, set 18 years and eight months earlier.\n\nEND OF THE ROAD\n\nPhiladelphia closed out a six-game road trip from Charlotte to Miami, up to Minnesota, across to Boston, down to Houston and finally in Memphis. \"We have made progress,\" Brown said. \"It's not going to display itself on the win side of things, but the people that follow us will know that.\"\n\nSO CLOSE\n\nDespite setting the record for most consecutive losses to open a season, the Sixers have been close in recent games. The loss at Memphis marked the fifth straight time Philadelphia has lost by single digits. The last double-digit loss was 113-88 at Charlotte on Nov. 20, the opening night of the road trip.\n\nUP NEXT\n\nSixers: Host Los Angeles Lakers on Tuesday\n\nGrizzlies: Travel to New Orleans Pelicans on Tuesday",
  "source": "espn_api",
  "crawled_at": 1764994468.235573
}