{
  "game_id": "0021400725",
  "espn_id": "400579017",
  "date": "Feb 02, 2015",
  "matchup": "MEM @ PHX",
  "headline": "Grizzlies rally at end, beat Suns for 7th time in a row",
  "body": "PHOENIX -- Someday, the Phoenix Suns will beat the Memphis Grizzlies.\nThey haven't done it in two years and it looked as though they finally had one Monday night. But Suns turnovers and clutch Memphis scoring spelled another loss to the Grizzlies.\nJeff Green converted a three-point play with 4.5 seconds to play and the Grizzlies rallied from seven down in the final 1:35 to beat the Suns for the seventh straight time, 102-101.\n\"I'd been struggling all game and I just wanted to come through for the team,\" Green said.\nMarc Gasol blocked Markieff Morris' shot at the finish to preserve the victory.\n\"We are lucky,\" Memphis coach David Joerger said. \"We are happy to get out of here with a win in a game where it probably should have gone the other way.\"\nThe Grizzlies, who won their seventh in a row overall and 11th in the last 12 games, scored the final eight points after Isaiah Thomas' 3-pointer put Phoenix up 101-94 with 1:49 to play.\nThomas scored all 24 of his points in the second half, 16 in the fourth quarter, and Phoenix used its three point-guard lineup to take a seven-point lead after trailing most of the game.\nMike Conley led Memphis with 23 points. Zach Randolph scored 19, including 17 in the second half.\nIn their previous game, on Jan. 11, the Grizzlies won in Memphis in double-overtime.\nWith Phoenix leading 101-99, Conley missed a jumper under pressure, but Green grabbed the rebound, scored and was fouled by Eric Bledsoe to go to the line for the winning basket.\n\"He made a great play, but I don't think I fouled him,\" Bledsoe said.\nThe final play was designed for Morris, but Bledsoe said that on the inbounds pass he tried to get it to Thomas, who was open. Morris grabbed the pass before it got to Thomas and took the shot with Gasol in his face.\nMorris said he didn't see Thomas and was just doing what he was supposed to do on the play.\nBledsoe scored 21 and Goran Dragic 15 for the Suns, meaning the three point guards combined for 60 points. Memphis led 82-74 when Bledsoe came in with 9:45 to play to put the trio of guards on the court together.\nFrom there, the Suns outscored the Grizzlies 24-9, with a 17-4 run putting them up 98-91 when Bledsoe made two free throws with 3:31 remaining.\n\"When we do play that lineup, nine times out of 10 it works to our advantage,\" Thomas said. \"It's tough to guard three aggressive guards out there.\"\nCoach Jeff Hornacek said he went with the small lineup, against the big Grizzlies, because the pace had been so slow.\n\"We needed some life and energy and that group got us going, got us back in the ballgame,\" he said.\nBledsoe blamed himself for mistakes down the stretch.\n\"It's my fault. I made two critical plays that can't happen, two turnovers,\" he said. \"They came down and got easy looks at the basket, free throws.\"\nTIP-INS\nGrizzlies: Tony Allen played despite a sore right hamstring and ankle. ... Randolph, named the Western Conference player of the week on Monday, got a technical foul early in the game then sat for the next nine minutes. ... Memphis opened a four-game road trip.\nSuns: The Suns missed their first seven free throws, then made their next 11. ... Phoenix last beat the Grizzlies on Feb. 5, 2013. The Suns last beat them in Phoenix on Dec. 12, 2012. ... Markieff Morris picked up his 11th technical foul, tying him with Russell Westbrook for most in the NBA. Hornacek has eased his brief policy of benching anyone who gets a \"T\" for the rest of the game, so Morris stayed in. ... Gerald Green had two turnovers and a foul and took no shots in 3:26 on the floor in the first half. He didn't play again.\nUP NEXT\nGrizzlies: at Utah on Wednesday.\nSuns: at Portland on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764992150.8070312
}