{
  "game_id": "0021800273",
  "espn_id": "401070954",
  "date": "Nov 23, 2018",
  "matchup": "CHI vs. MIA",
  "headline": "Richardson has 12-point in 4th, leads Heat past Bulls",
  "body": "CHICAGO --  Erik Spoelstra gave the ball to Josh Richardson.\n\nRichardson scored 12 of his 27 points in the fourth quarter and Hassan Whiteside had 18 points and 10 rebounds to help the Miami Heat beat the Chicago Bulls 103-96 on Friday night.\n\nSpoelstra decided to go without Dwyane Wade in the closing minutes.\n\n\"I didn't necessarily do it on purpose, but I did want to see that group finish without Dwyane,\" Spoelstra said. \"I did not want to see him go in there and all of a sudden everyone defer to him. We're going to need that, obviously, because Dwyane is obviously one of the best ever in this league in closing games, but J Rich (Richardson) has been in this situation before a few times. I thought his poise and preparation to get to the proper sports was much better, much more detailed, and even made some plays outs of that, which shows growth.\"\n\nWade has taken notice of Richardson's rise as a go-to-player in the Miami offense.\n\n\"I think he understands that he's our guy. We're going to him. He's picking up the phone every time we call him for the most part,\" said Wade.\n\nBam Adebayo added 14 points and 13 rebounds, and the Heat held on after nearly squandering a 26-point lead in the fourth quarter.\n\nZach LaVine got the Bulls to 87-84 with 6:07 left, but Richardson had back-to-back baskets and Wayne Ellington answered with a 3. Richardson made his fifth 3 to put the Heat up 100-90 with 2:00 left.\n\nJustin Holiday had 27 points and 13 rebounds for the Bulls, and LaVine added 24.\n\n\"Again, we continue to show ourselves what we're capable of doing but at the same time we show what we're capable of doing negatively as well, too,\" Holiday said.\n\nWithin a minute in the second quarter, Whiteside shot two airballs on free throws. His first airball came on the front end of a shooting foul, then he did it again trying to convert a three-point play. Whiteside could get a chuckle about it because the Heat were on a 20-2 run, where he scored 12 point. The Heat outscored the Bulls 32-13 in the second quarter. Whiteside was perfect from the floor in the second quarter, making all five of his attempts, while going 2 for 7 from the free throw line.\n\nThe Bulls were horrific in the second quarter, making only 2 of 19 field goal attempts, while committing nine turnovers. Whiteside provided the defensive presence for the Heat by blocking three shots in the quarter.\n\n\"That was the difference. It's been a tough quarter for us all year long. We just didn't have any resiliency in that second quarter to fight through the tough times,\" said Bulls coach Fred Hoiberg.\n\nThe Heat led 60-39 at the half. Richardson finished with 13 points in the half for Miami and Holiday led the Bulls with 17 points in the half.\n\nThe Heat led by as many as 26 in the second quarter, but the Bulls were able to get within four points in the fourth quarter. Chicago went on a 9-0 run midway through the third quarter. LaVine capped it off with a dunk. Then in the fourth quarter, Parker scored six consecutive points to get Chicago within 81-77. Parker scored 17 of his 23 points in the fourth quarter.\n\nTIP-INS\n\nHeat: James Johnson was in the starting lineup for the first time this season. He underwent surgery for a hernia back in May.  \"I'm going to try to fast track him as much as possible but not at the thought of trying to jam in 30 minutes. He's going to be a big part of what we're doing,\" Spoelstra said.\n\nBulls: Rookie F Chandler Hutchison missed his second straight game with back spasms. ... Chicago Bears linebacker Khalil Mack, who sat courtside, drew a loud ovation when he appeared on the video board during the first quarter.\n\nUP NEXT\n\nHeat: At Toronto on Sunday.\n\nBulls: At Minnesota on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994842.009984
}