{
  "game_id": "0022200616",
  "espn_id": "401468771",
  "date": "Jan 10, 2023",
  "matchup": "ORL @ POR",
  "headline": "Franz Wagner has 29 points, Magic hold off Blazers 109-106",
  "body": "PORTLAND, Ore. -- — Franz Wagner scored 29 points, Wendell Carter Jr. added 20 points and 10 rebounds and the Orlando Magic beat the Portland Trail Blazers 109-106 on Tuesday night. \n\n\r\n              Wagner had 15 points in the fourth quarter alone. \n\n\r\n              “I think that’s why you play basketball, those important plays, those important moments,” Wagner said. \n\n\r\n              The Magic led 19 points in the first half, but the Blazers closed the gap in the second quarter to tie it at 50 at halftime. \n\n\r\n              After trailing 82-73 to start the final quarter, Portland pulled to 89-84 on Anfernee Simons' layup. Orlando stayed in front, going up 104-94 on Wagner's 3-pointer with 3:35 left. \n\n\r\n              Damian Lillard's layup with 1:32 left got Portland as close as 105-101. Gary Harris fouled Lillard on a 3-point attempt — and Lillard made all three free throws to pull the Blazers closer at 107-106 with 25.1 seconds to go. \n\n\r\n              Markelle Fultz made free throws for Orlando and Portland missed a flurry of 3-point attempts in the final moments.\n\n\r\n              Lillard finished with 30 points for the Blazers, who lost their fourth straight. Portland has lost nine of their last 12 games. \n\n\r\n              “We’re just in a little funk, man. I don’t know what it is. I can’t really pinpoint it,” Blazers coach Chauncey Billups said.\n\n\r\n              Paulo Banchero added 19 points for the Magic. They were coming off a 115-101 loss at Sacramento the night before.\n\n\r\n              “I felt like we did a really good job, even when it got a little chaotic, we made all their shots tough,” Carter said. \n\n\r\n              Jerami Grant made a pair of layups to cap a 16-1 run that erased Orlando's first-half lead and got the Blazers within 40-36. Jusuf Nurkic's layup and free throw tied the game at 47 and the teams went into halftime knotted at 50. \n\n\r\n              After the Blazers scored a season-low 20 points in the opening quarter, they outscored the Magic 30-17 in the second. Nukic started despite battling a non-COVID illness and led all scorers in the first half with 18 points, along with eight rebounds and a pair of blocks. \n\n\r\n              The Magic opened the second half with an 15-0 run. Simons ended the scoring drought with a 3-pointer 4:40 into the half. Lillard's emphatic dunk pulled Portland to 79-70 late in the third quarter. \n\n\r\n              TIP INS\n\n\r\n              Magic: Center Bol Bol was available after missing four games because of health and safety protocols but he did not play. ... The Magic were 0-7 on the second night of back-to-backs heading into the game. ... It was the third of a five-game trip for Orlando. \n\n\r\n              Trail Blazers: Gary Payton II made his season debut a week ago against Detroit, after rehabbing from an offseason core injury. He missed the next three games because of an ankle sprain but played Tuesday.\n\n\r\n              PORTER'S RETURN\n\n\r\n              Former Trail Blazers great Terry Porter, whose number hangs from the rafters at the Moda Center, has returned to the team as an alumni ambassador. He'll foster relationships with other former players as the Blazers enhance their alumni program, the team announced on Tuesday. \n\n\r\n              Porter most recently served as basketball coach at the University of Portland for five seasons until 2021. He joins fellow ambassadors Brian Grant and Bob Gross. \n\n\r\n              ISAAC'S RETURN\n\n\r\n              Magic forward Jonathan Isaac, who hasn't played for two seasons, is set to play for the G-League Lakeland Magic as he continues his return from a torn ACL. He has been practicing with Orlando since December. \n\n\r\n              “I mean, that is such great news,\" Magic coach Jamahl Mosley said. “You talk about the journey he’s been on since being hurtt. To put it in perspective, it’s 892 days, tomorrow since he’s played in a full game.”\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Utah on Friday night. \n\n\r\n              Trail Blazers: Host Cleveland on Thursday night. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994631.272266
}