{
  "game_id": "0021800031",
  "espn_id": "401070714",
  "date": "Oct 20, 2018",
  "matchup": "CHI vs. DET",
  "headline": "Griffin, Smith lead Pistons over Bulls 118-116",
  "body": "CHICAGO --  Blake Griffin was having a big game and he had just hit a key 3-pointer on his previous attempt.\n\nStill, the perennial All-Star had no problem deferring to a reserve for a potential game-winning shot Saturday night.\n\nGriffin had 33 points and 12 rebounds, Ish Smith scored all 15 of his points in the second half, including the decisive basket, and the Detroit Pistons beat the Bulls 118-116 in Chicago's home opener.\n\n\"Ish is unbelievable,\" Griffin said. \"He just does so many things that are huge for our team. I think the team recognizes that, but I hope everybody else does, too.\"\n\nGriffin was 12 for 23 from the field, including 5 of 7 on 3-pointers, as Detroit won its second straight to start the season.\n\nWith the score tied at 116, Smith drove through the defense for a layup with 5.4 seconds left.\n\n\"Coach (Dwane Casey) set up a great play and I got two great screens,\" Smith said.\n\nZach LaVine had 33 points on 12-of-22 shooting for Chicago, which dropped its second consecutive game. The Bulls played without starters Kris Dunn (excused absence) and Lauri Markkanen (sprained right elbow), and reserve Denzel Valentine (left ankle).\n\n\"I loved his aggressiveness,\" coach Fred Hoiberg said of LaVine. \"I thought he started the game attacking and that's when he's at his best.\"\n\nDetroit had a 60-58 halftime lead despite shooting 34 percent in the first two quarters. Griffin had 16 points on 5-of-7 shooting. LaVine had 19 first-half points for Chicago.\n\nThe Pistons led 85-84 entering the fourth before the Bulls scored four straight points. Smith put Detroit back on top 89-88 and the Pistons held a slim advantage until LaVine hit a 3-pointer with 24.6 seconds left.\n\nAfter Smith's basket, Chicago had a chance to tie or go ahead with a 3, but LaVine lost the ball -- he was pressured by Griffin -- as he rose for a 3-pointer.\n\n\"It can't happen,\" LaVine said. \"It has to be either a miss or a make, so that's really upsetting to lose that way. We played so good and to have it end like that, it's an emotional roller-coaster.\n\nGriffin was asked if he got a hand on the ball.\n\n\"I don't know,\" he said. \"I'm gonna say yeah for now.\"\n\nA WIN IS A WIN\n\nTo make the playoffs this season, the Pistons know they must play well on the road. They consider Saturday a good start.\n\n\"A win is a win on the road,\" Casey said. \"That was one of our challenges going into this year -- executing on the road. In the game, we still need to be better, down the stretch we have to do better, and we will.\"\n\nROOKIE WOES\n\nBulls C Wendell Carter Jr., the seventh pick in the NBA draft, had eight points and two rebounds in 18 minutes mostly matched up against Detroit's Andre Drummond. It wasn't an overwhelming effort, but Carter has a fan in Griffin.\n\n\"I can't speak for him, but I'm sure it's chaos and confusion for him right now,\" Griffin said. \"He doesn't look that way, but that's just how you feel no matter what when you're a rookie.\n\n\"But he's so talented that he's going to be fine. It's just a matter of time. I watched him play probably more than any other player in college. I really like his game.\"\n\nTIP-INS\n\nPistons: F Reggie Bullock (illness) and F Stanley Johnson (toe) returned to the starting lineup after missing the opener against Brooklyn. Bullock finished with 16 points in 24 minutes, while Johnson had 10 points in 30 minutes.\n\nBulls: Valentine will be out for at least another two weeks after a scan on Friday revealed a bone bruise in his left ankle. He'll be re-evaluated in two weeks. \"It's not that bad,\" Valentine said. \"My ankle's feeling better, so it's just time.\" ... Dunn missed his second straight game following the birth of his first child. He is expected to rejoin the team Monday in Dallas.\n\nUP NEXT\n\nPistons: Host the Philadelphia 76ers on Tuesday night.\n\nBulls: At the Dallas Mavericks on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994860.181076
}