{
  "game_id": "0021600956",
  "espn_id": "400900351",
  "date": "Mar 08, 2017",
  "matchup": "DET @ IND",
  "headline": "George's 3rd-quarter flurry sends Pacers past Pistons 115-98",
  "body": "INDIANAPOLIS --  Paul George spent the first half Wednesday night trying to get his teammates started.\n\nThen the four-time All-Star finally took charge.\n\nGeorge scored 13 of his 21 points during the second half of the third quarter, leading the Indiana Pacers on a decisive run and a 115-98 blowout over Detroit.\n\n\"We needed him to knock down some shots in the third quarter and he did that to extend that lead to about 20,\" coach Nate McMillan said. \"The second unit closed it out.\"\n\nIndiana trailed only once all night for a total of 22 seconds and finished with its largest victory margin since a 21-point victory Feb. 4, also against the Pistons.\n\nBefore the game, Detroit coach Stan Van Gundy made it clear he was still searching for solutions to defend George, who had scored 26.3 points in the first three meetings this season and has routinely decimated the Pistons defense each of the past two seasons.\n\nIt still didn't work.\n\n\"They destroyed us,\" Van Gundy said \"We didn't play defense at all. They scored on anything they wanted and we didn't guard at all.\"\n\nGeorge was 7 of 12 from the field and finished with eight rebounds -- taking the entire fourth quarter off with the rest of Indiana's starters.\n\nFive other Pacers also scored in double figures, but it was George's third-quarter flurry that turned the game after Detroit took its only lead, 63-62 on a step-back jumper from Marcus Morris with 7:39 to go.\n\nC.J. Miles answered with a 3-pointer on the ensuing possession, and George broke a 65-65 tie with a 21-footer to start a 25-8 quarter-closing run. George had nine points and three rebounds over the final 6:25 of the quarter, which ended with Indiana leading 90-73.\n\n\"We needed to get some stops but it seemed like they had a pretty good offensive rhythm, so I left them (the starters) in a little longer than usual,\" McMillan said.\n\nDetroit never got closer than 15 the rest of the way and was swept in the four-game season series.\n\nTobias Harris led the Pistons with 22 points, Stanley Johnson had a season-high 17 and Andre Drummond wound up with 14 points and 15 rebounds for his 43rd double-double of the season.\n\nTIP-INS\n\nPistons: Have lost five straight in Indianapolis and 16 of the last 18 road games in the series. ... Harris stayed in the game after appearing to take a nasty spill while finishing a dunk late in the second quarter. He only scored four points after the play. ... Morris got his 100th career block in his 400th career game.\n\nPacers: Had two turnovers in the first half and finished with a season-low five. ... The Pacers were 11 of 23 on 3s and have now made 11 or more in five of seven games since the All-Star break. ... Before the game, NBA Slam Dunk contest winner Glenn Robinson III was presented with his trophy. Former Pacers star Darnell \"Dr. Dunk\" Hillman, who got a check but no trophy when he won the NBA's unofficial dunk contest in 1976-77, also received a trophy.\n\nTURNOVER TURNAROUND\n\nOf all the gaudy numbers in the box score, two were of particular interest to McMillan\n\nFive turnovers, a season-low, and 27 assists. Their previous low on turnovers was six, also against Detroit on Feb. 4.\n\n\"We wanted under 10, so we did a solid job offensively,\" McMillan said.\n\nDetroit wasn't bad either, finishing with 10 turnovers.\n\nUP NEXT\n\nPistons: Host the defending champion Cavaliers on Thursday. Cleveland has won five of the last seven in the series.\n\nPacers: Will try to snap a two-game losing streak against the Bucks when it heads to Milwaukee on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764996036.260426
}