{
  "game_id": "0021600946",
  "espn_id": "400900341",
  "date": "Mar 07, 2017",
  "matchup": "OKC vs. POR",
  "headline": "Trail Blazers overcome Westbrook's 58 to top Thunder 126-121",
  "body": "OKLAHOMA CITY --  Portland countered NBA scoring leader Russell Westbrook's onslaught with strength in numbers.\n\nSeven Trail Blazers scored in double figures, and Portland overcame Westbrook's career-high 58 points to beat the Oklahoma City Thunder 126-121 on Tuesday night.\n\n\"When you see the stats, Russ got like 60 or whatever,\" said Portland center Jusuf Nurkic, who scored 17 points. \"I give him 80, we still have to win. I respect what he does, but I'm happy for our team.\"\n\nAllen Crabbe scored 23 points, Damian Lillard had 22 and C.J. McCollum 21 for the Trail Blazers, who won their third straight. Portland shot 55 percent and forced Westbrook to keep producing.\n\n\"We're not good enough to take nights off defensively,\" Westbrook said.\n\nWestbrook shot 21 of 39, but just 6 of 15 in the fourth quarter. He entered the game as the league leader in points and plus/minus score in the last five minutes of regulation and overtime. He missed four shots in the final 83 seconds that could have tied the game or given the Thunder the lead.\n\n\"Yeah, just missed them,\" Westbrook said. \"Made them all game.\"\n\nWestbrook also finished with nine assists and made 13 of 16 free throws.\n\n\"He's incredible,\" Portland center Meyers Leonard said. \"With that being said, sometimes, it becomes a one-man show. Now, he's capable of that, but I think it's to our credit, from top to bottom, that we had a lot of guys contribute.\"\n\nVictor Oladipo scored 16 points and Enes Kanter added 11 for Oklahoma City, which dropped its fourth straight. Oklahoma City lost despite shooting 52 percent.\n\nWestbrook scored 28 points in the first half to give the Thunder a 67-61 lead. The Thunder shot 68 percent before the break.\n\nThe Trail Blazers outscored the Thunder 38-25 in the third quarter to take a 99-92 lead into the fourth.\n\nPortland pushed its lead to 12 early in the fourth quarter, and the Trail Blazers led 106-97 when Westbrook checked back in after a rest. The Thunder rallied to tie the score at 116, but Nurkic scored in close twice to put Portland up 120-116.\n\nWestbrook missed a 3 with the Thunder trailing 122-119, and Nurkic made two free throws with 9.8 seconds remaining. Westbrook scored a quick layup to make it a three-point game with 4.5 seconds to go. Portland got the ball in, and Lillard made two free throws with 1.4 seconds remaining to clinch the win.\n\n\"We were sharing the ball,\" Leonard said. \"We believed in what we were doing. We believed in each other, and that was key, especially when it comes down to the end of the game, trusting the next guy. This was a very big win for us.\"\n\n---\n\nTIP INS\n\nTrail Blazers: F Evan Turner sat out with a right hand injury. ... Had just one turnover in the first quarter. ... Scored 11 second-chance points in the third quarter.\n\nThunder: Oladipo returned to the starting lineup after missing six games with back spasms. ... Oklahoma City's 40 points in the first quarter were a season high for any quarter. The Thunder shot 75 percent in the opening period.\n\nQUOTABLE:\n\nWestbrook, after being asked if the Thunder need to be patient after adding three new players through trades: \"We don't really have time for that this time of year, where you've got to be playing your best basketball and figuring out how you want to move forward.\"\n\nSTAT LINES\n\nCrabbe made 7 of 10 shots and 5 of 7 3-pointers.\n\n\"I was just coming in and being aggressive off the bench,\" he said. \"I feel like I got into a rhythm early and was moving well without the ball. When I'm engaged like that, I think I can do big things for the team.\"\n\nUP NEXT\n\nThe Trail Blazers will host Philadelphia on Thursday.\n\nThe Thunder will host the San Antonio Spurs on Thursday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP.",
  "source": "espn_api",
  "crawled_at": 1764995262.133893
}