{
  "game_id": "0022000258",
  "espn_id": "401267418",
  "date": "Jan 25, 2021",
  "matchup": "TOR @ IND",
  "headline": "Pacers use 4th-quarter scoring flurry, beat Raptors 129-114",
  "body": "INDIANAPOLIS -- — Indiana Pacers guard Malcolm Brogdon spent Sunday night searching for answers.\n\n\r\n                    By Monday night, he had found them.\n\n\r\n                    A little more than 24 hours after playing his poorest game of the season, Brogdon scored a career-high 36 points, flirted with a triple-double and accounted for the final seven points as the Pacers pulled away from Toronto 129-114.\n\n\r\n                    ”I was on the phone with coach (Nate Bjorkgren) late last night, trying to figure out how to make adjustments. I was really angry after last night's game,” Brogdon said. “I was incredibly locked in today. We both love the game, we both think about the game all the time and we both hate losing. It drove me crazy until we were able to get back on the court tonight.\"\n\n\r\n                    The difference showed.\n\n\r\n                    Brogdon didn't just score, he found open teammates, played defense and helped spur the decisive fourth-quarter flurry. He finished with nine assists and seven rebounds, Jeremy Lamb matched his season high with 22 points and Myles Turner scored 11 of his 21 points over the final 8 1/2 minutes when the Pacers finally put it away.\n\n\r\n                    And they did all that despite missing All-Star forward Domantas Sabonis for the final three quarters. He left with a bruised knee in the first half. Sabonis didn’t return.\n\n\r\n                    But with Brogdon leading the charge, Sabonis' absence didn't matter.\n\n\r\n                    “I thought he came out with a focus,\" Bjorkgren said. “He was in attack mode the entire evening.”\n\n\r\n                    Toronto was led by Fred VanVleet's 25 points and six rebounds. Norman Powell scored 24 points as the Raptors rallied from a 70-60 halftime deficit to finally reclaim a 102-100 lead on Kyle Lowry's go-ahead dunk with 9:46 left in the game. \n\n\r\n                    It didn't last long.\n\n\r\n                    Goga Bitadze tied the score, Turner broke the tie by making 1 of 2 free throws and then fueled the decisive 12-4 run with his late scoring flurry. Indiana went 14 of 17 from the free-throw line in the fourth quarter and wound up with its highest free-throw attempt total (45) in nearly a decade.\n\n\r\n                    “It was hard to play anything (defensively),\" Toronto coach Nick Nurse said. “All we did was a parade to the free-throw line. You can’t play defense when every time they touch the ball it’s a foul.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: Lowry scored 12 points. He needs two more to join DeMar DeRozan and Chris Bosh as the only players in franchise history to score 10,000. ... VanVleet made three more 3-pointers to extend his franchise-record to 49 consecutive games with a 3. .... OG Anunoby had 10 points and reached double figures for a career-best ninth consecutive game. ... All-Star Pascal Siakam missed his second straight game with swelling in his left knee. Nurse said he would be examined when the team returns home Tuesday.\n\n\r\n                    Pacers: Turner also had 10 rebounds and three blocks despite playing with a fractured right hand. ... Bitadze and Aaron Holiday each scored 10 points. ... Lamb added seven rebounds. ... Bjorkgren, who spent the previous two years on Nurse's staff, got his first NBA win against his former mentor. Bjorkgren's head-to-head record against Nurse is 4-5 including seven matchups in the G League.\n\n\r\n                    DOUBLE TROUBLE\n\n\r\n                    Sabonis' franchise-record streak of 16 consecutive double-doubles to open the season ended unceremoniously after he had 11 points, three rebounds and two assists in the first 11 minutes. The All-Star is one of just six players since the ABA-NBA merger to start the season with 15 straight double-doubles.\n\n\r\n                    Bjorkgren said the injury occurred when Sabonis and Lowry banged knees and that Sabonis would be examined again Tuesday.\n\n\r\n                    QUICK EXIT\n\n\r\n                    When Lowry was called for a technical foul and subsequently ejected with 47 seconds left to play, he didn't stick around long. Lowry continued to talk to the refs as he strolled toward the opposite end of the court, then took his jersey off as he walked through the tunnel to the locker room.\n\n\r\n                    UP NEXT\n\n\r\n                    Raptors: Begin a three-game homestand Wednesday against Milwaukee.\n\n\r\n                    Pacers: Play the first of two games in Charlotte on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996882.8390489
}