{
  "game_id": "0022300781",
  "espn_id": "401585409",
  "date": "Feb 14, 2024",
  "matchup": "CHI @ CLE",
  "headline": "Donovan Mitchell scores 30 points, Cavaliers rally from 17 down to beat Bulls 108-105",
  "body": "CLEVELAND -- — Donovan Mitchell scored 30 points, including the go-ahead free throw with 44 seconds left, and the Cleveland Cavaliers overcame a 17-point deficit to beat the Chicago Bulls 108-105 on Wednesday night.\n\n\r\n              Coby White had a chance to force overtime as time expired, but his 3-pointer from the top of the key rimmed out. Mitchell’s go-ahead free throw gave the Cavaliers a 104-103 lead and his two makes with 4.7 seconds left extended it to 108-105.\n\n\r\n              Isaac Okoro scored 16 points and Jarrett Allen had 13 points and 10 rebounds for Cleveland, which has won 18 of its last 20 and is an NBA-best 23-5 since Dec. 16. The Cavaliers, who are second in the East, are 10-1 at home since the start of January.\n\n\r\n              “This team just has fight, that never-give-up mentality, like we needed today,” said Okoro, who tied his career high with four 3-pointers. “When we got down, we kept fighting and were more physical, aggressive pushing it and playing faster on offense.”\n\n\r\n              White scored 23 of his 32 points in the second hal for Chicago, and DeMar DeRozan had 24 points and six assists, and Andre Drummond had 10 points and 15 rebounds. Chicago went 2-2 on a four-game trip heading into the NBA All-Star break.\n\n\r\n              All seven lead changes and nine ties took place in the final 10:40, beginning when Cleveland went ahead 79-78 on a 3-pointer by Georges Niang. White also made two free throws and threw the ball out of bounds in the last 17 seconds.\n\n\r\n              “These moments define the game, so I’ve got to take it on the chin and be better the next time,” White said. “Nothing can prepare you, except for going through them. I’m pretty ticked I didn’t make the last shot, but it means a lot to be put in that position.”\n\n\r\n              Chicago scored the first eight points of the game, eventually going up 46-29 in the second quarter behind 11 points from DeRozan. The Cavaliers shot 23.8% on 3s in the opening half, but made 7 of 16 tries after intermission.\n\n\r\n              Six Cleveland players scored in double digits with Evan Mobley having 14, Darius Garland 12 and Niang 11 before fouling out.\n\n\r\n              “This group believes in what they’re doing, so no one felt like they had to change and do something different when the shots weren’t falling,” Cleveland coach J.B. Bickerstaff said. Sticking with it, we score 37 points and the fourth quarter and win the game.”\n\n\r\n              Bulls forward Patrick Williams missed his ninth game in a row with left midfoot bone soreness. Coach Billy Donovan said Williams no longer feels discomfort when walking and could return before the end of the month.\n\n\r\n              “The last two months have been kind of crazy because of injuries, but we pushed through it,” DeRozan said. “When we come back, we need to put everything and more into the last 27 games.”\n\n\r\n              Cavaliers forwards Sam Merrill and Dean Wade did not play as a result of an illness that also affected Garland.\n\n\r\n              UP NEXT\n\n\r\n              Bulls: Host Boston on Thursday, Feb. 22.\n\n\r\n              Cavaliers: Host Orlando on Thursday, Feb. 22.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995882.159075
}