{
  "game_id": "0021600350",
  "espn_id": "400899792",
  "date": "Dec 10, 2016",
  "matchup": "CHI vs. MIA",
  "headline": "Butler, Wade lead Bulls to 105-100 win over Heat",
  "body": "CHICAGO --  Dwyane Wade wearing a Chicago Bulls uniform never will look right to Miami coach Erik Spoelstra. On nights like this, it's particularly painful.\n\nWade scored 28 points against his former team, Jimmy Butler led the way with 31 and the Bulls held off the struggling Heat 105-100 on Saturday.\n\nButler scored Chicago's final 10 points to help the Bulls come out on top after Miami pulled within one.\n\nWade, the 12-time All-Star and three-time NBA champion with Miami, keyed a big third-quarter run in his second game against the Heat. He and the Bulls hung on after handing San Antonio its first road loss two nights earlier.\n\n\"I've seen it for so many years on our side,\" Spoelstra said. \"He showed his competitiveness and the variety of his menu. He was going into the post, he was playing pick-and-roll basketball -- he puts a tremendous amount of pressure on your team defense. He's got all the talent in the world, but what really makes Dwyane is his intellect for the game. He knows where the defense is going to be, and he knows the moves before you even make them.\"\n\nGoran Dragic led Miami with 21 points and 11 assists, and an energetic Hassan Whiteside added 20 points after being benched for part of Friday's blowout loss in Cleveland. Tyler Johnson scored 15, but the Heat dropped their fifth straight.\n\nJohnson cut it to 97-96 when he nailed a 3-pointer with 4:20 left. Butler then drove for a three-point play and hit another free throw to make it 101-96, but the Heat weren't finished.\n\nA layup by Dragic and basket by Whiteside in the lane cut it to 101-100 with 13 seconds remaining. Butler then hit two free throws to boost Chicago's lead back up to three.\n\nWith a chance to tie, Dragic and Josh Richardson botched a handoff near the top of the key. Butler got the steal and hit two more foul shots with less than a second left to seal the win.\n\n\"In this league, there are going to be some nights you're going to play amazing, and there are going to be some nights where you play just well enough to get a win,\" Wade said. \"Never begrudge a win. We played good enough to get a win tonight.\"\n\nBIG DUNK\n\nWade let out a smile after he was fouled by Whiteside on a soaring dunk after splitting two defenders for a three-point play during an 18-2 run in the third. Wade scored 11 during that spurt.\n\nTHAT'S MONEY\n\nFloyd Mayweather took in the game and was shown on the video board during the third quarter.\n\nTIP-INS\n\nHeat: F Udonis Haslem rejoined Heat after they let him miss Friday's game at Cleveland to watch his son win a state football championship. The 14-year veteran got to see Kedonis Haslem, a 6-foot-4, 290-pound lineman, and Fort Lauderdale St. Thomas Aquinas pound Plant 45-6 in the Florida Class 7A final. \"He's missed all of his son's important playoff games and championship games, senior year,\" Spoelstra said. \"U.D. has been in 13 years of service with us and you miss so many moments that we felt that this would be a moment that he wasn't going to miss and regret years from now.\" ... Spoelstra said Whiteside has been dealing with knee and hip issues as well as \"a couple other things.\" ... Miami was 5 of 20 on 3-pointers and 11 of 18 at the foul line.\n\nBulls: Chicago was just 1 of 8 on 3-pointers but hit 28 of 31 free throws, with Butler going 15 for 16. ... The Bulls, who began the night second to Denver in rebounds per game at 48.6, had 47. ... Chicago had dropped three straight at home to Miami. ... The Bulls are 6-1 at the United Center against Eastern Conference teams.\n\nUP NEXT\n\nHeat: Host Washington on Monday night.\n\nBulls: Host Minnesota on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764995082.540831
}