{
  "game_id": "0022400427",
  "espn_id": "401704993",
  "date": "Dec 28, 2024",
  "matchup": "MIA @ ATL",
  "headline": "Jalen Johnson scores 28 to lead the Hawks over the Heat 120-110",
  "body": "ATLANTA -- — Jalen Johnson scored 28 points and the Atlanta Hawks closed out a four-game homestand, winning a third straight contest, 120-110 over the Miami Heat on Saturday.\n\n\r\n              Trae Young added his 22nd double-double of the season, with 11 point and 15 assist, and De'Andre Hunter scored 26 points in his 14th consecutive game with at least 15 points coming off the bench.\n\n\r\n              Tyler Herro scored 28 points and dished out 10 assists and Bam Adebayo added 17 points and 10 rebounds. It was the Heat's fourth game in a row without star Jimmy Butler, who sat out for what the team called “return to competition reconditioning.”\n\n\r\n              Takeaways\r\n              Heat: Miami lost despite five players finishing with double-digit point totals. The Heat shot 44.4% from the field, but it wasn't enough to overcome a Hawks team that hit over half of its shots, 51.2% from the field.\n\n\r\n              Hawks: Johnson has been on an offensive tear in his last two games. He finished two points shy of his single-game career high of 30 points, set in his last game, on Thursday against the Chicago Bulls. Hunter also finished just one point shy of his single-game career high of 27 points.\n\n\r\n              Key moment\r\n              After a close first half that featured nine lead changes, Atlanta seized control early in the second half. With five minutes to go in the third quarter, Atlanta’s Garrison Mathews and Hunter hit back-to-back 3s to give Atlanta an 81-72 lead, their biggest of the night, and forcing a Miami timeout.\n\n\r\n              Key stat\r\n              Young finished one assist shy of a franchise single-game record for assists against the Miami Heat, set by Mookie Blaylock in 1993.\n\n\r\n              Up next\r\n              The Hawks begin a six-game road trip in Toronto on Sunday, while the Heat visits the Rockets on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998289.7503161
}