{
  "game_id": "0022400065",
  "espn_id": "401704631",
  "date": "Oct 23, 2024",
  "matchup": "MIA vs. ORL",
  "headline": "Banchero scores 33, Magic roll in 2nd half to beat Heat 116-97 on opening night",
  "body": "MIAMI -- — Paolo Banchero scored 33 points and grabbed 11 rebounds, Franz Wagner scored 23 and the Orlando Magic rolled past the Miami Heat 116-97 on Wednesday night in the opener for both teams.\n\n\r\n              Gary Harris added 18 for Orlando, all on 3-pointers. The Magic were 18 of 49 from 3-point range.\n\n\r\n              Terry Rozier scored 19 for Miami, which celebrated “Pat Riley Court” night with a halftime ceremony. Nikola Jovic scored 15 and Tyler Herro added 14 for the Heat.\n\n\r\n              Orlando led by as many as 32 in the second half.\n\n\r\n              Takeaways\r\n              Magic: Orlando's high for 3-pointers attempted in a first half last season was 23. The Magic tried 27 before halftime on Wednesday, a clear sign that they see the 3-pointer as more of an option this season. The Magic made a league-low 903 3s last season.\n\n\r\n              Heat: Jimmy Butler was 1 for 8 from the field and scored three points. It's the fifth time in his career that he played at least 24 minutes and scored three points or less.\n\n\r\n              Key moment\r\n              The whole third quarter was a moment for the Magic. Orlando outscored Miami by 21 points in the third, 39-18. It was the most lopsided third quarter on the road for the Magic since Feb. 7, 2010, when they outscored Boston by 25 on the way to a 96-89 win.\n\n\r\n              Key stat\r\n              Banchero had the sixth instance of an Orlando player scoring at least 30 in a season opener. Tracy McGrady did it twice and Shaquille O'Neal, Nick Anderson and Anfernee Hardaway did it once. Anderson (1992) and O'Neal (1993) each scored 42 for the Magic opening night record. Banchero is now No. 3 on that list with his 33-point effort.\n\n\r\n              Up next\r\n              Orlando plays its home opener Friday night against Brooklyn. Miami goes to Charlotte on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996943.898429
}