{
  "game_id": "0022000314",
  "espn_id": "401267474",
  "date": "Feb 01, 2021",
  "matchup": "MIA vs. CHA",
  "headline": "Monk runs wild, scores 36 as Hornets top Heat 129-121 in OT",
  "body": "MIAMI -- — Malik Monk had the best scoring game of his career, and the Charlotte Hornets got a comeback they won’t soon forget.\n\n\r\n                    Monk came off the bench to score 36 points and make nine 3-pointers, Devonte’ Graham added 24 points and the Hornets rallied from a 10-point deficit in the final 2:47 of regulation to beat the Miami Heat 129-121 in overtime on Monday night.\n\n\r\n                    The 36 points was a Hornets' reserve record, one better than the 35 that Graham had against Indiana on Nov. 5, 2019.\n\n\r\n                    “I was ready, and I was just locked in,\" Monk said.\n\n\r\n                    Monk sent the Hornets to OT by making a 3-pointer with 16.6 seconds left, and Charlotte never trailed in the extra period. Cody Zeller had 19 points and 12 rebounds, Gordon Hayward scored 19 and LaMelo Ball finished with 14 points and seven assists for Charlotte in his first start.\n\n\r\n                    “It’s been a resilient group all year,” Hornets coach James Borrego said. “We never dropped the sword. Our mentality is to keep fighting to the end. Down 10 with two-plus minutes to go, nobody hung their heads.”\n\n\r\n                    Jimmy Butler scored 25 points and Bam Adebayo added 23 for Miami, which got 19 from Max Strus. The Heat used a 24-7 run to turn a seven-point deficit into a 10-point lead late in the fourth, then gave up 28 points in the final 7:47.\n\n\r\n                    “At the end of the day, if you have a double-digit lead you have to find a way to get stops and finish it off,\" Heat coach Erik Spoelstra said. “We weren't able to do that.\"\n\n\r\n                    The Hornets made 21 3-pointers, tying the third-most in franchise history. They also set a season-high for points and topped the 30-assist mark for the ninth time this season.\n\n\r\n                    Duncan Robinson had 16, while Tyler Herro and Kelly Olynyk each scored 11 for Miami. Herro’s status was in question because someone he lives with tested positive for COVID-19 on Saturday. But Herro was cleared to play Monday afternoon, which indicates that the housemate likely got a false positive and returned multiple negative tests since.\n\n\r\n                    “We have to get stops. That's the bottom line,\" Adebayo said. “You can play as much offense as you want, but you have to get stops.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Hornets: Ball got the first start of his career for Charlotte because Terry Rozier missed the game with a sprained right ankle. ... Charlotte hadn’t won consecutive games in Miami since 2007. ... The Hornets could be down another starter. PJ Washington left in the third quarter; the initial diagnosis was a sprained right foot. Washington finished with six points in 24 minutes.\n\n\r\n                    Heat: Strus’ previous career-high was 12. ... Meyers Leonard was not with the team Monday; he was getting his injured shoulder checked by a doctor. He hurt his ankle Feb. 3, 2020 and between that and the shoulder issue has appeared in eight of Miami’s 65 games since.\n\n\r\n                    MARCH 11 MEMORIES\n\n\r\n                    It was the first game between the teams since March 11, the night the NBA suspended last season because of the pandemic. “In some ways it feels like forever ago and then I walked into this building and it feels like yesterday. ... Things have never been the same since. Hopefully we’re back there soon,” Borrego said.\n\n\r\n                    NOTHING HAPPENED\n\n\r\n                    Olynyk had a 3-pointer blocked in the second quarter, the ball ricocheted off Hayward’s head, Olynyk got it back, Herro missed a 3, Adebayo got that rebound, lost the ball and it eventually wound up back with Olynyk — who made a 3. Except it didn’t happen; the NBA replay center ruled a few minutes later that Olynyk’s made 3 was after the shot clock expired.\n\n\r\n                    UP NEXT\n\n\r\n                    Hornets: Host Philadelphia on Wednesday.\n\n\r\n                    Heat: Host Washington on Wednesday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996809.2534442
}