{
  "game_id": "0021800378",
  "espn_id": "401071059",
  "date": "Dec 08, 2018",
  "matchup": "HOU @ DAL",
  "headline": "Doncic scores 11 straight, Mavs rally past Rockets, 107-104",
  "body": "DALLAS --  Luka Doncic started with a routine 3-pointer from the corner.\n\nThen the Dallas rookie skipped back several feet behind the arc to hit one over Houston center Clint Capela, followed by a floater in the lane for a tie.\n\nAfter faking a drive that sent Capela scrambling toward the basket, the 19-year-old Slovenian settled behind the 3-point line one more time, connecting again for the 26th lead change between the Mavericks and Rockets.\n\nSo much for a rough shooting night.\n\nDoncic scored 11 straight points to erase an eight-point deficit late in the fourth quarter and the Mavericks went on to their ninth consecutive home victory, 107-104 over the Rockets on Saturday night.\n\n\"It's pretty clear that he's got a flair for the moment,\" Dallas coach Rick Carlisle said. \"He's unafraid. You don't see that every day. It's a unique three or four minutes, whatever he put together there.\"\n\nJames Harden shrugged off early foul trouble to score 35 points, but missed all four of his 3-point tries in the fourth quarter. Two of them were during Doncic's flurry, along with Chris Paul missing a pair of free throws before Doncic's tying bucket.\n\n\"The first thing I'd like to do different is make my free throws,\" said Paul, who scored 23 points while matching Harden with eight assists. \"I think that's where, honestly, it ticked the game off. We were up two. Throws would have put us up four. They hit some step-backs.\"\n\nDoncic was 3 of 13, and the Mavericks weren't too far removed from a nearly six-minute scoring drought in the fourth quarter when he made the first 3 with the Mavericks trailing 102-94, the largest Houston lead of the game.\n\n\"I wasn't playing great,\" said Doncic, who finished 7 of 17 with all three of his 3-pointers in that final stretch and had seven rebounds. \"My game wasn't good at all. I get confident in the end of games. I would say that I feel comfortable.\"\n\nLost in the electrifying stretch by the third overall pick in last spring's draft was center DeAndre Jordan's backdoor bounce pass to rookie second-rounder Jalen Brunson.\n\nThe two-time NCAA champion from Villanova, making his second career start with Dennis Smith Jr. out because of a sprained right wrist, hit the twisting layup to get the Dallas lead back to three with 24 seconds left and finish off his career high of 14 points.\n\nDoncic scored 21 points along with Wesley Matthews, who missed two free throws with a chance to put the game away in the final seconds. Eric Gordon missed a potential tying 3-pointer for Houston at the buzzer less than two weeks after the Rockets lost to the Mavericks by 20 at home.\n\n\"I thought we played well,\" Houston coach Mike D'Antoni said. \"I think the good news out of all this is that if we play with that intensity, we're going to win a lot of games. Having said that, Doncic did it to us right toward the end.\"\n\nTIP-INS\n\nRockets: It was the seventh loss in nine games since a season-best five-game winning streak. ... Clint Capela had 12 points and 13 rebounds for his 18th double-double. ... The Rockets had just four other assists besides the 16 combined from Harden and Paul. ... Harden had his 10th 30-point game of the season.\n\nMavericks: It's the longest home winning streak since Dallas won nine straight in 2011, the year of the franchise's only championship. ... F Maxi Kleber was out with a left big toe sprain. ... Smith sat for the second straight game and third time in seven games because of the wrist issue. ... Dorian Finney-Smith scored 14 points along with Harrison Barnes.\n\nHARDEN'S RECOVERY\n\nHarden already had 10 points when he picked up his third foul with 4:17 left in the first quarter. He fell for a pump fake from Doncic and reached as the rookie went by him. Doncic sold the contact well and got the call. But Harden didn't foul again until midway through the fourth quarter, finishing 11 of 22 from the field, including 6 of 16 from 3.\n\nALL-AROUND GAME\n\nJordan had his 15th double-double by halftime with 12 points and 10 rebounds. He didn't score in the second half but had both of his steals along with the clutch assist to Brunson, who was 7 of 9 from the field.\n\nUP NEXT\n\nRockets: Host Portland on Tuesday night.\n\nMavericks: Host Orlando on Monday night.\n\n---\n\nFor more AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995309.065011
}