{
  "game_id": "0021501126",
  "espn_id": "400829013",
  "date": "Mar 31, 2016",
  "matchup": "OKC vs. LAC",
  "headline": "Adams' late basket lifts Thunder past Clippers 119-117",
  "body": "OKLAHOMA CITY -- The Oklahoma City Thunder's rebounding dominance finally won out over the Los Angeles Clippers' sizzling 3-point shooting.\nKevin Durant scored 31 points, Steven Adams made a go-ahead tip-in with 26.9 seconds left and the Thunder held on to avoid a potentially embarrassing loss, edging the depleted Clippers 119-117 on Thursday night.\nRussell Westbrook added 26 points and 11 assists for the Thunder, who lead the Clippers by 5 1/2 games in the race for the No. 3 seed in the NBA's Western Conference playoffs. The Thunder outrebounded Los Angeles 46-26, offsetting the Clippers' 16-of-29 outing from 3-point range.\n\"These games are hard to play just because guys could be out of their normal rotation,\" Oklahoma City coach Billy Donovan said. \"Give them a lot of credit. They shot the ball extremely well from behind the 3-point line. . I give our guys credit for battling and hanging in there through an incredible shooting night by them.\"\n\nThe Clippers played without usual starters Chris Paul, DeAndre Jordan and J.J. Redick, as coach Doc Rivers chose to rest them. Blake Griffin also was out, serving the last game of a four-game team-imposed suspension.\nJamal Crawford and Austin Rivers carried the load offensively, each scoring 32 points and going a combined 12-of-17 from 3-point range. Los Angeles led by as many as nine in the second half but couldn't hold on, in good part because of the Thunder's large rebounding advantage.\nNo rebound was bigger than one by Adams that came after Westbrook took a well-guarded, fallaway 15-foot jumper that missed badly. Adams tipped it in to put Oklahoma City ahead.\n\"Just got lucky, mate,\" Adams said. \"I made some awful plays beforehand, a couple of them. I was just happy to kind of make at least one good play in a big moment.\"\nAustin Rivers, who posted a career scoring high, missed a driving shot in the final seconds -- after the Thunder denied a 3-point shot -- and Westbrook rebounded with 2.7 seconds left to seal the win for the Thunder.\nWestbrook also grabbed a key rebound with 37.4 seconds left, knocking the ball away from Wesley Johnson after Durant had missed a 3-point attempt.\n\"The two back-to-back offensive rebounds, to me, was the difference in the game,\" Doc Rivers said. \"I thought we had the rebound and we were going to have the last shot of the game, then Westbrook makes a great play. That's what he does.\n\"No moral victories. We wanted to win. That's got to be your mindset. But I was just happy that they just kept competing over and over again. This bodes well for us.\"\nOklahoma City made 10 of its first 11 shots and led by as many as 12 in the second quarter, but the Thunder's poor interior defense and the sharpshooting of Crawford and Austin Rivers allowed Los Angeles to quickly close the gap.\nThe duo went 8 of 8 from 3-point range in the first half, combining for 40 points, and Crawford made three free throws with 1.3 seconds left to give the Clippers a 69-65 halftime lead. Los Angeles shot 63.2 percent in the first half, the Thunder 58.1 percent.\nA 12-2 run to open the second half put Oklahoma City up 77-71, but the Clippers scored nine straight to regain the lead and were up 92-83 after a dunk by Johnson on a play that started with a turnover by Westbrook. Los Angeles led 97-93 entering the fourth quarter.\nConsecutive dunks by Durant and Adams, off assists from Westbrook, gave the Thunder the lead again at 110-109 with 5:56 left. Los Angeles went up 115-110 after consecutive 3-pointer by Johnson and Jeff Green.\n\"Weird game,\" Durant said. \"Crazy game. But I'm glad we won.\"\nTIP-INS\nClippers: In addition to the absence of Paul, Jordan, Redick and Griffin, the Clippers were without Paul Pierce, who's still nursing a sprained ankle. ... Los Angeles' starting lineup was Crawford, Rivers, Luc Mbah a Moute, Johnson and Cole Aldrich. ... Rivers' previous career high was 25 points, against Sacramento on Feb. 21, 2015. He also set a career high with seven 3-pointers in nine attempts.\nThunder: Durant recorded his 60th straight game of 20 or more points, the fourth-longest streak since the NBA-ABA merger. ... Westbrook's double-double was his 50th of the season. ... Serge Ibaka had 16 points and nine rebounds and Adams added 13 points on 6-of-7 shooting.\nRESTING UP\nDoc Rivers said it made sense to rest the majority of his starters against the Thunder, considering the gap between the Thunder and the Clippers in the standings. The Clippers will be off Friday and Saturday before Paul, Jordan, Redick and Griffin all return for a game Sunday against the Washington Wizards.\n\"I don't know how much guys need rest or not,\" Doc Rivers said. \"I think they do. I know Chris, for sure, and J.J. DJ (Jordan) is young, but he's given us so many minutes. I just thought if we were going to do it, it was a good time. We have two more back-to-backs, so we may do it a couple more times. I'm not sure. I'll just go by what I see.\"\nUP NEXT:\nClippers: Host Washington on Sunday.\nThunder: Visit Houston on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764994125.31978
}