{
  "game_id": "0021600416",
  "espn_id": "400899858",
  "date": "Dec 19, 2016",
  "matchup": "PHX @ MIN",
  "headline": "Towns, Timberwolves beat Suns 115-108",
  "body": "MINNEAPOLIS --  Karl-Anthony Towns has watched his Minnesota Timberwolves give up so many leads this season that he had finally had enough.\n\nOnce he made up his mind, the Phoenix Suns couldn't hold him down.\n\nTowns had 28 points and 15 rebounds, and the Timberwolves beat the Phoenix Suns 115-108 on Monday night.\n\n\"I was going to do everything in my power and my part to ensure we didn't come out of tonight with a loss,\" Towns said.\n\nAndrew Wiggins scored 26 points and Zach LaVine added 23 for the Timberwolves. Ricky Rubio had 12 assists and Minnesota picked up its first win at home since Nov. 17.\n\nEric Bledsoe scored 27 points for the Suns, who have lost three straight and four out of five. Brandon Knight had 21 points off the bench and Devin Booker scored 18 on 6-for-15 shooting for Phoenix.\n\nThe game figured to be heavy on offense, with two young teams far more concerned with putting the ball in the basket than stopping anyone on the other end.\n\nThe Suns came into the game second in the league in pace, second in fast-break points and third in points off turnovers. And the Wolves are the first team in history to have three 21-year-olds averaging at least 20 points per game.\n\n\"One thing we know we need to get better at is our toughness,\" Suns coach Earl Watson said. \"That's not a stat. We have to become more feisty because we are small on the perimeter.\"\n\nThe Wolves built a 14-point lead in the first half, but have given away double-digit leads all season long. They were coming off a particularly disheartening loss against Houston on Saturday night in which they blew a 12-point lead with two minutes to play before losing in overtime.\n\nPhoenix cut the deficit to two points several times in the fourth, but the Wolves had an answer each time.\n\nAfter Phoenix cut the Wolves' lead to 105-103 with four minutes to play, Towns grabbed two offensive rebounds against Tyson Chandler, who ranks fifth in the NBA in rebounding, and scored on the second putback after getting fouled.\n\nTowns let out a yell and pounded his bicep, then swished the free throw for a five-point lead. The play ignited a 10-2 run that put away the game.\n\n\"Even missing the first one, I was determined to get that second one,\" Towns said. \"I would've gotten a foul running over someone to get it. Every single ounce of energy I had left to make sure I go up and get that ball.\"\n\nThat kind of intensity is what Wolves coach Tom Thibodeau has been trying to instill from the start.\n\n\"Great, multiple-effort play,\" Thibodeau said. \"That's will and determination and often times that's the difference right there between winning and losing.\"\n\nTIP-INS\n\nSuns: Knight made 8 of 13 shots, and his efficiency in the first half kept the game from getting away from the Suns while Booker and Bledsoe started 3 for 14. ... Jared Dudley scored 12 and Leandro Barbosa had 10 points for the Suns bench, which outscored Minnesota's 44-20. ... The Suns missed 10 free throws.\n\nTimberwolves: Rubio made two technical free throws to run his streak to 34 straight without a miss. That's the longest active streak in the league after Stephen Curry's ended at 44 in a row last week. ... The Wolves went 24 for 25 from the line.\n\nVOLATILE SUNS\n\nMarqueese Chriss and P.J. Tucker both picked up technical fouls for arguing with the officials, and the Suns had trouble keeping their composure for much of the night. Chriss was particularly erratic, barking at officials Monty McCutcheon, David Guthrie and Kane Fitzgerald and wrestling with Towns under the basket.\n\nTucker voiced his displeasure often while guarding Wiggins, with officials not letting him play as physical as the burly forward likes to on that end.\n\n\"We let it get to us early as far as the refs and the other team, we let it get to us and we could never recuperate from it,\" Bledsoe said.\n\nUP NEXT\n\nSuns: Phoenix heads back home to face the Houston Rockets on Wednesday.\n\nTimberwolves: Minnesota hits the road to play the Atlanta Hawks on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995988.9577138
}