{
  "game_id": "0021800640",
  "espn_id": "401071316",
  "date": "Jan 13, 2019",
  "matchup": "MIL @ ATL",
  "headline": "Antetokounmpo leads the way, Bucks win Budenholzer's return",
  "body": "ATLANTA --  Giannis Antetokounmpo had just one rebound in the first half as the Bucks lost the battle of the boards by 16.\n\nMilwaukee took charge of the game in the second half with Khris Middleton and Antetokounmpo exerting their will in the paint.\n\n\"We played a little bit harder, moved the ball and we did a better job of rebounding,\" Antetokounmpo said. \"Running and getting to our spots, knocking down shots. That's it.\"\n\nAntetokounmpo scored 33 points, Eric Bledsoe added 24 points and 10 assists, and Milwaukee beat the Hawks 133-114 on Sunday in Mike Budenholzer's return to Atlanta.\n\nMiddleton finished with 17 points and 11 rebounds to help the Bucks improve to 30-12, second-best in the NBA. Coming off a loss at Washington that Antetokounmpo missed with injuries, Milwaukee is 12-0 following a defeat and remained the league's only team not to drop consecutive games.\n\nBudenholzer, making his first appearance at State Farm Arena since leaving the Hawks after last season, wished his former team well as it rebuilds with youngsters John Collins, Trae Young, Kevin Huerter and Omari Spellman.\n\n\"It's good to come back and see some familiar faces where you worked for five years,\" Budenholzer said. \"I think to check that box and for the team to play well and execute is good. We'll move on.\"\n\nThe Bucks are soaring, thanks mostly to the 6-foot-11, 242-pound Antetokounmpo, who scored 14 on free throws and had two dazzling assists early in the fourth. He first smothered Trae Young to steal the ball and feed George Hill for a 3-pointer that made it 104-90, before adding a no-look drop pass on D.J. Wilson's layup for a 16-point lead. He later hit a couple of jumpers to make it a 15-point advantage.\n\nMilwaukee has won 12 of 15 dating to Dec. 14. The Bucks began the day outscoring opponents by an NBA-leading 9.1 points per game.\n\nAntetokounmpo showed no ill effects after sitting out Friday with right quadriceps soreness and a left hip contusion.\n\nYoung finished with 26 points, and DeAndre' Bembry added 18 for Atlanta, which dropped to 13-30. The Hawks have dropped six of eight. Their 24 turnovers led to 34 points for Milwaukee.\n\n\"It's a recurring problem, but I'd like to think guys are just trying to make plays,\" the Hawks' Kevin Huerter said. \"We were being a little careless with the ball on some possessions.\"\n\nTIP-INS\n\nBucks: Antetokounmpo did a postgame jersey exchange with 41-year-old Hawks F Vince Carter. \"I'm a big fan of his,\" Antetokounmpo said. \"He's done great things for this league.\"... G Malcolm Brogdon scored 14 points and missed just his second free throw in 86 free-throw attempts this season. ... Middleton began the day averaging 20.4 points over his previous eight games.\n\nHawks: F Taurean Prince, the team's third-leading scorer, returned after missing the last 18 games with a left ankle sprain. On a minutes restriction, Prince had seven points and five rebounds in 11 minutes. ... G Kent Bazemore, the team's second-leading scorer, has missed eight straight games with a right ankle injury.\n\nNO REGRETS\n\nBudenholzer said \"change and moving is part of life\" when asked before the game about leaving the Hawks. Calling it \"a heck of a five years,\" Budenholzer wasn't looking back with animosity following a 24-58 finish last season.\n\nHe was the NBA Coach of the Year in his second season, leading Atlanta to 60 wins and its first appearance in the Eastern Conference finals. When principal owner Tony Ressler bought the team and Danny Ferry was out as general manager, Budenholzer added president of basketball operations to his title, but the Hawks made three bad moves that set the organization back and precipitated the rebuild.\n\nAl Horford and Paul Millsap, two model team leaders, left as free agents after the Hawks decided not to trade them. In between those gaffes, the team signed mercurial center Dwight Howard to a three-year, $70.5 million contract and dealt him away after one ill-fit season.\n\nBudenholzer said he loves his job with the Bucks and wishes the Hawks well.\n\n\"A rebuild -- it's a tough job to be the owner in a rebuild, to be a GM to be a coach. These are tough jobs, and so I don't know who the right coach is,\" he said. \"And I think they feel great about where they are and that's important for them. They have their direction they know where they're going. I'm obviously very happy with our team, our front office and our roster. I'm very excited about where I am.\"\n\nUP NEXT\n\nBucks: Host Miami on Tuesday.\n\nHawks: Host Oklahoma City on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994490.049856
}