{
  "game_id": "0022200805",
  "espn_id": "401468960",
  "date": "Feb 05, 2023",
  "matchup": "TOR @ MEM",
  "headline": "Siakam, Raptors rally past Grizzlies 106-103 as Morant sits",
  "body": "MEMPHIS, Tenn. -- — Pascal Siakam scored 19 points, including a pair of free throws with 9 seconds left, and the Toronto Raptors rallied from a 15-point deficit to beat the Memphis Grizzlies 106-103 on Sunday.\n\n\r\n              Jaren Jackson Jr. missed a 3-pointer with 5.2 seconds left that would have tied the game for the Grizzlies, who played without star Ja Morant because of right wrist soreness.\n\n\r\n              Toronto won its second straight game and went 4-3 on its season-long seven-game road swing. Memphis has lost three straight and eight of nine.\n\n\r\n              Chris Boucher scored 17 points and matched his season high with three 3-pointers for the Raptors. Scottie Barnes scored 13 of his 16 points in the fourth quarter, including a pair of key baskets down the stretch. Fred Van Vleet had 15 points and seven assists.\n\n\r\n              “Things got tight in the fourth quarter,” Barnes said. “It was just the ball was coming to me, and I was having a ball. I was just trying to get downhill and win the game.”\n\n\r\n              Desmond Bane led Memphis with 26 points, while Jackson had 18 points and four blocks. In addition to Morant, the Grizzlies were missing center Steven Adams (right knee) and forward Dillon Brooks, who served a league-assessed one-game suspension for his confrontation with Cleveland’s Donovan Mitchell on Thursday.\n\n\r\n              Toronto put the game away by outscoring Memphis 28-17 in the fourth quarter, and Bane said there are obviously things that need to change.\n\n\r\n              “I think just valuing every possession,” the Grizzlies guard said. “Understanding the magnitude of every possession for a full 48 minutes, but especially down the stretch. When it comes down to it, we've got to be able to rebound the basketball and not allow teams to get second chances.”\n\n\r\n              Memphis led most of the game before Toronto asserted itself late. The Grizzlies were ahead 81-66 with 4:44 left in the third quarter. The Raptors got within 86-78 entering the fourth.\n\n\r\n              “You don't want to try and come down and out-jump-shoot teams,” Raptors coach Nick Nurse said. “They were open shots, but we needed to get in attack mode and attack the paint. (Jump shots) are great when they all go in, but when none of them go in, it looks and feels really bad, and you put yourself in a big hole.”\n\n\r\n              Precious Achiuwa got free for a baseline dunk with 2:32 left that gave the Raptors a 100-99 lead. From there, the teams traded baskets until Barnes hit a pair of shots, the latter with 20.1 seconds left for a 104-103 advantage.\n\n\r\n              “It was a great win ... to close it out with that fourth quarter,” VanVleet said. “Things were not really going our way. We just hung in there and made a couple of more plays at the end.”\n\n\r\n              TIP-INS\n\n\r\n              Raptors: F O.G. Anunoby, whose name has been mentioned in trade rumors, missed his fifth straight game with a left wrist sprain. ... VanVleet handed out his 2,000th career assist in the first quarter. ... Barnes had his 100th career block in the third quarter. ... Gary Trent Jr. had 10 points, ending his streak at 11 straight games with at least 15 points.\n\n\r\n              Grizzlies: Santi Aldama finished with 15 points. ... Tyus Jones recorded his 500th career steal in the first quarter. ... The loss prevented Memphis from sweeping the series with Toronto. It hasn't won both games against the Raptors in the regular season since 2012-13.\n\n\r\n              MORANT FRIEND PUNISHED\n\n\r\n              Morant tweeted that a friend of his has been banned from games at FedExForum for a year. The punishment stems from a confrontation on Jan. 29, when the Grizzlies hosted Indiana. During the game, there was barking between Pacers players and friends of Morant seated along the sideline. The talking apparently continued into the players’ parking area after the game, leading to an investigation by the league. Memphis coach Taylor Jenkins said he was aware of the league’s investigation and that the team addressed the matter internally. He did not elaborate further.\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Host San Antonio on Wednesday night.\n\n\r\n              Grizzlies: Host Chicago on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994042.9948301
}