{
  "game_id": "0021800053",
  "espn_id": "401070734",
  "date": "Oct 24, 2018",
  "matchup": "CLE vs. BKN",
  "headline": "Russell, Harris lead Nets past winless Cavaliers 102-86",
  "body": "CLEVELAND --  Life without LeBron James has been harder so far than the Cleveland Cavaliers hoped.\n\nCleveland fell to 0-4 after a 102-86 loss to Brooklyn on Wednesday night. D'Angelo Russell scored 18 points, Joe Harris added 16 and the Nets outscored the Cavaliers 38-17 in the third quarter to pull away.\n\nJames led the Cavaliers to four straight NBA Finals and a championship in 2016, but the four-time MVP signed with the Los Angeles Lakers in the summer.\n\nHis absence was obviously going to leave a void, but blowout losses at home to Atlanta and Brooklyn have been especially disappointing for the Cavs.\n\n\"We need a `W' on the board, for sure,\" said All-Star forward Kevin Love. \"Obviously we thought we'd be in a different position right now.\"\n\nLove was one of three Cleveland players to score a team-high 14 points. The 11-year veteran said the Cavaliers didn't show any fight in the second half during their latest loss.\n\n\"These are big growing pains and we need to get through these,\" he said. \"Guys have to continue to fight. Can't hang their heads, can't have bad body language. This isn't the previous four years. We have to fight for everything that we've got.\"\n\nThe Cavaliers lost their first two games on the road to Toronto and Minnesota. Cleveland was coming off a 133-111 loss in its home opener to the Hawks. The Cavaliers are 0-4 for the first time since losing their first five games in 2003-04 when James was a rookie.\n\nCleveland will face a difficult task Thursday with a road game against Detroit and Blake Griffin, who scored 50 points in an overtime win over Philadelphia on Tuesday.\n\nThe first half had 11 lead changes and the teams were tied at 45 going to halftime before the Nets took over. Brooklyn hit 16 of 22 from the field in the third quarter to pull away.\n\nHarris made a 3-pointer that put the Nets up 50-47 and Brooklyn never trailed again. Jared Dudley's second 3-pointer of the run pushed the lead to 68-50 with 6:12 remaining in the quarter.\n\n\"Just by moving the basketball, we went from getting good shots to great shots,\" Harris said. \"As long as you're doing that, the shots are going to start falling. We're trying to build on games like this. Hopefully, we can keep it going.\"\n\nThe Nets maintained a lead over 20 points for most of the fourth quarter, causing many in the crowd at Quicken Loans to head for the exits.\n\nThe Nets placed six players in double figures. Dudley scored 12 points.\n\nJordan Clarkson and rookie Collin Sexton also scored 14 points for Cleveland.\n\nNets forward Rondae Hollis-Jefferson and guard Shabazz Napier made their season debuts. Jefferson, out with a hip injury and the birth of his first child, scored seven points in 17 minutes. Napier, sidelined with a strained right hamstring, scored eight points in 11 minutes.\n\nThe Nets broke a 10-game losing streak in Cleveland and won for the first time at Quicken Loans Arena since April 3, 2013.\n\nTIP-INS\n\nNets: F Rodions Kurucs (sprained left ankle) was unavailable and will not play Friday at New Orleans. Coach Kenny Atkinson said his status will be updated this weekend. ... F Treveon Graham (strained left hamstring) and F DeMarre Carroll (right ankle surgery) remain out.\n\nCavaliers: Veterans Kyle Korver and J.R. Smith came off the bench in the first quarter after not playing Sunday. Korver had two points in 19 minutes while Smith scored seven points in 18 minutes... Cleveland was 6 of 26 from the field in the first quarter. ... Love had 10 points in the first half, the only Cleveland player to reach double figures in the first two quarters.\n\nEVEN START\n\nThe Nets have split their first four games and Atkinson gave credit to the defense Wednesday.\n\n\"Holding a team to 86 points with Kevin Love and Rodney Hood and a lot of explosive scorers, that's a heck of a job by our guys,\" he said.\n\nMAKE A SHOT, PLEASE\n\nThe Cavaliers were 3 of 18 on 3-point attempts Wednesday and have made 28 of 87 from behind the arc for the season.\n\n\"We have to make shots,\" coach Tyronn Lue said. \"If we're open for the 3, we have to let it go.\"\n\nUP NEXT\n\nNets: Visit New Orleans on Friday.\n\nCavaliers: Visit Detroit on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994811.838746
}