{
  "game_id": "0021500537",
  "espn_id": "400828424",
  "date": "Jan 07, 2016",
  "matchup": "CHI vs. BOS",
  "headline": "Gasol, Rose lead way as Bulls beat Celtics 101-92",
  "body": "CHICAGO -- Pau Gasol was so in tune he gave a performance even one of the greatest tenors could appreciate.\nGasol had 17 points and 18 rebounds with Placido Domingo looking on, and the Chicago Bulls beat the Boston Celtics 101-92 on Thursday night for their sixth straight victory.\n\"When our main players play at our highest level, we're a really good team,\" Gasol said.\nThe Bulls, who looked like they were coming apart not too long ago, certainly appear to be hitting the right notes.\n\nGasol had his 19th double-double. And as if that wasn't enough, he was planning to have dinner with his countryman Domingo, who was in town to perform.\n\"He's a basketball fan, he's a sports fan,\" Gasol said. \"He's here for a performance. I wish he was just here to visit me, but that doesn't work that way. He's a guy that I truly admire. I have a great friendship, relationship, with him.\"\nAs good as Gasol was, this was hardly a one-man show.\nDerrick Rose scored 18 points. Jimmy Butler added 19 points and 10 assists.\nThe Bulls used a big third quarter to extend their longest win streak of the season and handed the Celtics their fourth loss in five games.\nBoston coach Brad Stevens missed this one to visit cancer-stricken former Butler center Andrew Smith, who played on the Bulldogs' two runs to the national championship game. He has been battling non-Hodgkin's lymphoma and was scheduled to undergo a bone marrow transplant Thursday, according to The Boston Globe.\n\"I was obviously thinking about Brad and wanting to represent him well and our players -- wanting to do right by them,\" said assistant Jay Larranaga, who filled in for Stevens. \"They worked really, really hard. They're traveling all over the place. Played last night, really, really tough game.\"\nBoston got 17 points from Jae Crowder. Kelly Olynyk added 16 points and nine rebounds, but the Celtics shot just 35.7 percent and were 5 of 25 on 3-pointers.\nIsaiah Thomas scored 14 but missed all four 3s while shooting 5 of 17 overall. Jared Sullinger added 13 points and 11 rebounds for Boston.\n\"They played great defense,\" Sullinger said. \"But we have to turn it back around and get back on our high horse and get back to running our offense the way we should.\"\nThe Celtics got outscored 26-16 and shot 7 of 32 in the third as Chicago stretched a one-point halftime lead to 74-63.\nIt was 61-49 with just over 8 minutes left in the quarter after Taj Gibson hit a hook shot, finishing a 15-2 run that started with a fadeaway by Rose near the end of the first half.\nGasol, who scored eight in the third, had a pair of baskets during that run. Butler scored seven in the period, and the Bulls were never really threatened down the stretch.\n\"It feels good, but we can't settle,\" Butler said. \"We've got to continue to win games, try to build upon it, just keep playing basketball the right way.\"\nHE SAID IT\nLarranaga, whose father Jim coaches the University of Miami, when asked if he heard from his dad: \"Texted with my dad real quick and told me, `Don't talk to the refs.' That was his word of advice.\"\nTIP-INS\nCeltics: Larranaga said he found out late Thursday morning that he would be filling in. He was not sure when Stevens will rejoin the team. ... G Avery Bradley missed his third straight game with a sore left hip.\nBulls: The Bulls hope C Joakim Noah will return from a sprained left shoulder next week, coach Fred Hoiberg said. Noah has not taken contact in practice and likely won't travel with the team this weekend. He has not played since Dec. 21.\nUP NEXT\nCeltics: Visit Memphis on Sunday.\nBulls: Visit Atlanta on Saturday.",
  "source": "espn_api",
  "crawled_at": 1764993936.497927
}