{
  "game_id": "401810182",
  "espn_id": "401810182",
  "date": "Dec 03, 2025",
  "matchup": "ATL vs LAC",
  "headline": "Harden scores 27, Clippers end 5-game skid by beating Hawks after moving on without Paul",
  "body": "ATLANTA -- — James Harden had 27 points and nine assists, and the Los Angeles Clippers ended a five-game losing streak with a 115-92 win over the Atlanta Hawks on Wednesday night in their first game after deciding to move on without Chris Paul.\n\n\r\n              Kawhi Leonard had 21 points, six rebounds and five assists. Ivica Zubac contributed 14 points and 17 rebounds for the Clippers, who won for just the sixth time this season.\n\n\r\n              Earlier in the day, the Clippers sent home 12-time All-Star Paul, who was averaging 2.3 points in what is expected to be the final season of his 21-year NBA career. He played in 16 of the Clippers' 21 games in his return to the franchise where he had some of the best years of his career.\n\n\r\n              Nickeil Alexander-Walker led the Hawks with 21 points. Dyson Daniels added 15 points and two steals.\n\n\r\n              Jalen Johnson, who leads the Hawks in points (23.2), rebounds (10.0) and assists (7.2), was a late scratch with right calf tightness. Kristaps Porzingas (illness) also missed the game, and guard Trae Young is still a few weeks away from returning from a knee injury.\n\n\r\n              The result was a disjointed first half that saw the Hawks shoot 38% from the floor with 11 turnovers and just eight assists. The Clippers led 55-41, then scored the first five points of the second half to push the lead to 19. The Hawks never pulled within 13 the rest of the game.\n\n\r\n              Harden was aggressive for the Clippers from the start, taking 12 shots in the first quarter. He finished 11 of 24, and had no free throw attempts for the first time this season and just the second time in two years. Harden is third in the league at 8.0 free throw attempts per game.\n\n\r\n              Up next\r\n              The Hawks host the Denver Nuggets on Friday.\n\n\r\n              The Clippers are in Memphis on Friday for the third game of a five-game road trip.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_direct_latest",
  "crawled_at": 1765042744.674294
}