{
  "game_id": "0021800142",
  "espn_id": "401070823",
  "date": "Nov 05, 2018",
  "matchup": "CLE @ ORL",
  "headline": "Fournier's buzzer beater lifts Magic over Cavs 102-100",
  "body": "ORLANDO, Fla. --  Evan Fournier has struggled with his jump shot early this season. He got a big one to go down Monday night, though.\n\nThe seventh-year swingman hit a 22-footer at the final horn and the Orlando Magic came back from a five-point deficit in the last 24 seconds, taking advantage of a late collapse by Cleveland in a 102-100 victory over the scuffling Cavaliers.\n\nFournier took an inbounds pass with 1.8 seconds left after Nikola Vucevic blocked George Hill's shot at the other end, and the ball went out of bounds off Hill.\n\n\"I finished well shooting the ball, but I missed so many open shots in the first half and third quarter, it's amazing,\" Fournier said. \"I knew (the last shot) wasn't going to be catch-and-shoot situation because that's a tough shot. ... I knew I had time to dribble.\"\n\nJ.R. Smith's 3-pointer with 41.9 seconds remaining had given the Cavaliers a 100-95 lead until Aaron Gordon scored after an offensive rebound for the Magic with 23.8 seconds to go. D.J. Augustin made a steal and two free throws with 18.7 seconds left to trim the deficit to one.\n\nKyle Korver then lost the ball to Fournier, who hit one of two free throws with 13 seconds on the clock to tie it at 100.\n\n\"We had to steal the ball, execute, and really win a game you're not supposed to when you're down whatever with 15 seconds left,\" Fournier said. \"Most of the time you don't win those games.\"\n\nGordon scored 23 points for Orlando, while Fournier and Terrence Ross had 15 each. Fournier added three steals, including that critical one in the final seconds while the Cavaliers were trying to protect a one-point lead.\n\nHill scored 11 of his 22 points in the fourth quarter and made 10 of 12 shots for Cleveland (1-9), which remained winless on the road. Tristan Thompson added 19 points and 16 rebounds.\n\n\"It was real tough, but the good part about it is the way we competed,\" said Smith, who had 14 points. \"Mistakes were made, but to see the way we played together defensively and executing on offense was inspiring to watch.\"\n\nVucevic scored the final six points of the first half, including a putback with 1.4 seconds left, to leave Orlando (4-6) with a 58-47 halftime lead -- the largest of the game for either team.\n\nCleveland answered with 11 straight points early in the third quarter and pulled ahead 71-68 on a 3-pointer by Hill.\n\nHill and Smith combined for nine points and Jordan Clarkson converted a four-point play as the Cavaliers finished the period on a 15-2 run to lead 79-70.\n\nBut they didn't finish it. In the last 20 seconds they had two turnovers, and their only shot was blocked.\n\n\"We put ourselves in a great situation and we just did not execute down the stretch,\" Cleveland coach Larry Drew said. \"When situations come up like that, you have to know what to do and execute. We didn't handle it and that is why we lost the game.\"\n\nJOB REPORT\n\nDrew, promoted to head coach when the Cavaliers fired Tyronn Lue on Oct. 25, reached an agreement to remain the head coach for the rest of the season. Drew said there was no discussion about anything beyond this season.\n\nTIP-INS\n\nCavaliers: Sam Dekker left the game with an ankle injury at 10:04 of the third quarter. ... Clarkson, who has come off the bench for double figures in every game, scored his first eight points in a span of 71 seconds.\n\nMagic: F Jonathan Isaac missed a second game with a sprained right ankle. ... The Magic played their third game in four nights, including wins on consecutive nights. Their next four games are against teams that failed to make the playoffs last season.\n\nUP NEXT\n\nCavaliers: Home against Oklahoma City on Wednesday night.\n\nMagic: Home against Washington on Wednesday night.\n\n---\n\nMore AP NBA: www.apnews.com/NBA and www.twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994805.741076
}