{
  "game_id": "0021801061",
  "espn_id": "401071734",
  "date": "Mar 19, 2019",
  "matchup": "LAL @ MIL",
  "headline": "Bucks beat Lakers 115-101; Antetokounmpo, James sit out",
  "body": "MILWAUKEE --  Billed as a battle of All-Star captains, the Milwaukee Bucks and Los Angeles Lakers instead took the court Tuesday night without their respective franchise players.\n\nMissing Giannis Antetokounmpo, who is nursing an injured ankle, the Bucks repeatedly thwarted rallies by the Lakers, who didn't have the services of LeBron James due to a sore groin, before finally putting away Los Angeles 115-101.\n\n\"We didn't play well with the lead. That's frustrating on a lot of different levels,\" Milwaukee coach Mike Budenholzer said.\n\nKhris Middleton scored 30 points and had 10 rebounds, Brook Lopez tied a season high with 28 points, and Nikola Mirotic chipped in with 23 for Milwaukee, which improved to an NBA-best 53-18.\n\nBudenholzer credited Lopez's all-around game for leading the Bucks to victory.\n\n\"I thought he was phenomenal,\" Budenholzer said. \"Some of his shots were just very timely, then he's finishing in the paint, he's driving it, getting to the free throw line. He did a lot of things offensively.\"\n\nKentavious Caldwell-Pope had a season-high 35 points for the Lakers, three off his career best.\n\n\"He's a very skilled shooter. It's a lot of fun when he is having a game like that,\" Lakers coach Luke Walton said.\n\nKyle Kuzma added 17 points for Los Angeles, which has lost four consecutive games and nine of 10.\n\nAntetokounmpo, a front-runner for the league MVP award, poured in a career-high 52 points in a 130-125 loss to the Philadelphia 76ers on Sunday, but sprained his right ankle in that game after colliding with Joel Embiid on a drive to the basket late in the third quarter. He remained in the game, but continued soreness forced him to sit against the Lakers.\n\nJames, who had 33 points in a loss to the Knicks on Sunday, didn't play due to a sore left groin, the same injury that caused him to miss a career-high 17 consecutive games earlier this season.\n\nThe Bucks led by 11 after the first quarter, but the Lakers worked their back in the second, eventually tying it at 56 before falling behind 61-58 at the half. Caldwell-Pope had 23 first-half points, helped by 5-for-8 shooting from 3-point range.\n\nMilwaukee seemed to gain control in the third quarter, building a 23-point lead at one point. The Bucks led 99-84 heading to the fourth.\n\nThe Lakers clawed back, however, and cut the lead to five midway through the fourth quarter. But the Bucks again pushed the lead to double digits.\n\n\"I thought our guys gave everything they had tonight,\" Walton said.\n\nLINGERING EFFECTS\n\nAntetokounmpo received treatment on his ankle during the team's off day on Monday. Bucks coach Mike Budenholzer said before the game he wasn't good to play. \"He can't play,\" he said. Tony Snell started for Antetokounmpo.\n\nBUCKS ADD FRAZIER\n\nTo help fill a void at guard, the Bucks signed Tim Frazier, who played 47 games this season for the New Orleans Pelicans before being waived on Feb. 28. He averaged 4.8 points, 4.5 assists and 1.8 rebounds. The 28-year-old Frazier appeared in four preseason games for the Bucks.\n\n\"We feel really fortunate that Tim was somebody that we could add to the team,\" Budenholzer said. Frazier played 12 minutes but didn't score. To clear a roster spot, Milwaukee cut forward Christian Wood. \"We are very appreciative of all he did for us, the progress he made, the player he's becoming,\" Budenholzer said.\n\nBROOM BALL\n\nWhen a ball became wedged between the top of the backboard and the shot clock early in the second quarter, Bucks 7-foot center Brook Lopez grabbed a long-handle broom from a ball boy. After successfully knocking the ball loose, Lopez triumphantly raised his hands and bowed to the cheering crowd, which responded with a chant of \"MVP.\"\n\n\"We're all heroes. We're just each waiting for our moment and mine came tonight,\" Lopez said.\n\nFASHION STATEMENT\n\nAntetokounmpo, who was in uniform, donned a thick white headband with the NBA logo while on the bench, something he doesn't do during game action. \"I don't think that's a good look for him,\" Middleton said.\n\nNAP TIME\n\nWhen asked to assess what sparked his hot shooting, Caldwell-Pope, who made 8 of 14 shots from 3-point range, had a quick explanation. \"I had a great nap. I woke up feeling good. I don't like to take long naps, so I try to plan my naps, 45 minutes to an hour long.\"\n\nGORDON IN THE HOUSE\n\nLos Angeles Chargers running back Melvin Gordon, a former star at the University of Wisconsin, attended the game.\n\nTIP-INS\n\nLakers: Lance Stephenson missed a sixth consecutive game with foot/toe injuries. .Caldwell-Pope made a 3-pointer as time expired to end the third quarter.\n\nBucks: G Sterling Brown (right wrist soreness), guard Donte DiVincenzo (bilateral heel bursitis) and center Pau Gasol (left ankle soreness) and F Ersan Ilyasova (illness) sat out. Brown is closest to returning to game action, coach Mike Budenholzer said. \"We're hopeful by the end of the week that he will be cleared to play and be available for games,\" he said.\n\nUP NEXT\n\nLakers: Host Brooklyn on Friday\n\nBucks: At Cleveland on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994318.748498
}