{
  "game_id": "0021900412",
  "espn_id": "401161054",
  "date": "Dec 18, 2019",
  "matchup": "MEM @ OKC",
  "headline": "Thunder overcome 24-point deficit to beat Grizzlies 126-122",
  "body": "OKLAHOMA CITY --  Dennis Schroder scored 31 points, and the Oklahoma City Thunder overcame a 24-point deficit and beat the Memphis Grizzlies 126-122 on Wednesday night.\n\nDanilo Gallinari and Shai Gilgeous-Alexander each scored 20 points and Chris Paul added 18 for the Thunder, who rallied from 26 points down to beat the Chicago Bulls on Monday.\n\nBrandon Clarke scored 27 points, Jonas Valanciunas scored 24 and Ja Morant added 22 for the Grizzlies.\n\nThe Thunder got off to another shaky start on Wednesday. Memphis shot 54% in the first half and took a 68-59 lead at the break. Valanciunas and Morant each scored 13 points for the Grizzlies while Gallinari scored 11 points for the Thunder.\n\nOklahoma City did not score for three minutes to start the third quarter, and Memphis took an 80-59 lead. The Grizzlies' largest lead was 89-65.\n\nThe Thunder surged at the end of the third quarter. Abdel Nader hit a 3-pointer with nine seconds left, then Schroder stole the inbound pass and Gilgeous-Alexander hit a 16-footer at the buzzer to cut Oklahoma City's deficit to 100-93. Oklahoma City finally took the lead on a pull-up jumper by Schroder with just over eight minutes to play.\n\nPaul's short jumper gave the Thunder a 122-120 lead in the final minute. Memphis could have tied the game, but Morant and Clarke missed in close and Schroder made two free throws at the other end for Oklahoma City to push the Thunder lead to four.\n\nAfter a dunk by Clarke, Schroder was fouled with 7.5 seconds to go, and he made both free throws to give the Thunder control for good.\n\nTIP-INS\n\nGrizzlies: Were outscored 27-12 at the free-throw line. ... Made just 2 of 10 3-pointers in the second half.\n\nThunder: Shot 55% in the first quarter, despite missing all five of their 3-point attempts. ... Scored 28 points in the final 7:10 of the third quarter. ... G Hamidou Diallo is still out with a hyperextended right elbow.\n\nUP NEXT\n\nThe Grizzlies visit the Cleveland Cavaliers on Friday.\n\nThe Thunder host the Phoenix Suns on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995736.857766
}