{
  "game_id": "0022300470",
  "espn_id": "401585098",
  "date": "Jan 03, 2024",
  "matchup": "TOR @ MEM",
  "headline": "Immanuel Quickley scores 26, Pascal Siakam adds 24 as Raptors hold on to defeat Grizzlies 116-111",
  "body": "MEMPHIS, Tenn. -- — Immanuel Quickley scored 26 points, Pascal Siakam added 24 and the Toronto Raptors weathered a late Memphis rally to defeat the Grizzlies 116-111 on Wednesday night.\n\n\r\n              Quickley, who came to Toronto in a late-December trade that sent OG Anunoby to the New York Knicks, was 8 of 18 from the field, including 5 of 8 on 3-pointers. Scottie Barnes finished with 20 for Toronto.\n\n\r\n              Quickley was playing only his second game since the trade, but already is impressing Toronto coach Darko Rajakovic.\n\n\r\n              “He fits great,” Rajakovic said of Quickley. “It's a guy that can do so much with the ball. His shooting is really something that makes a difference for us.”\n\n\r\n              Quickley said the transition has been smooth. The Toronto organization's family environment and welcoming approach has helped make the change easier. The Raptors are \"a top-tier organization. It makes it really easy for me, the basketball part,” he said.\n\n\r\n              “Darko pulled me aside while the game was going on and said: ‘You’re not having fun. Have fun,'” Quickley related about getting more comfortable with a new team. “I've never really had a coach do that.”\n\n\r\n              Ja Morant led the Grizzlies with 28 points, nine assists and eight rebounds. Jaren Jackson Jr. finished with 24 points, including 13 in the fourth quarter. Desmond Bane added 22 for Memphis and Ziaire Williams scored 18 points.\n\n\r\n              “I've got to get this team better prepared. We were flat tonight. That's on me,\" Memphis coach Taylor Jenkins said. \n\n\r\n              But the Memphis players were unwilling to let Jenkins take the blame for their play in a losing effort. \n\n\r\n              “As a coach, you can only do so much,” Bane said. “You don't put a jersey on. You don't run up and down the court. So, it has nothing to do with him, honestly. We're all grown men. It's on us. We've got to be better.”\n\n\r\n              Toronto led 102-84 with nine minutes left, but Memphis crafted a 16-4 run that brought the team back into the game. The Grizzlies got within five points on several occasions, but Toronto never relinquished the lead and won its second straight.\n\n\r\n              “To be honest, in that fourth quarter, I thought we really didn't keep control on the offensive end,” said Rajakovic, who was an assistant in Memphis before taking the reins in Toronto. “We were all over the place. What we were doing. What we were executing.”\n\n\r\n              Both teams were coming off wins — Toronto defeating Cleveland on Monday; Memphis earning a win over San Antonio on Tuesday. But both teams were below the playoff threshold in their respective conferences.\n\n\r\n              Shot accuracy abandoned Memphis in the second quarter allowing the Raptors to run off 11 straight points leading to a 62-48 advantage at the break. Another small push to start the second half took Toronto's lead to 20.\n\n\r\n              And the Raptors still appeared in control with nine minutes left. But Jackson's scoring supplemented by 12 points from Williams brought the Grizzlies back in the game. Memphis shot 52% in the fourth, including 6 of 11 from outside the arc.\n\n\r\n              “I was not happy with the way we executed in the fourth quarter,” Rajakovic said. “That's what created a lot of issues for us.”\n\n\r\n              UP NEXT\n\n\r\n              Raptors: Continue a six-game road trip Friday in Sacramento. Grizzlies: Start a three-game road trip in Los Angeles against the Lakers on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995429.3493152
}