{
  "game_id": "0022000243",
  "espn_id": "401267403",
  "date": "Jan 23, 2021",
  "matchup": "DET vs. PHI",
  "headline": "Embiid hits late free throws, 76ers beat Pistons 114-110",
  "body": "DETROIT -- — Joel Embiid had 33 points and 14 rebounds, and his two free throws with 7.2 seconds left helped the Philadelphia 76ers seal a 114-110 victory over the Detroit Pistons on Saturday night.\n\n\r\n                    Ben Simmons added 20 points, nine rebounds and seven assists for the 76ers, and he made a couple big free throws of his own in the final minute. Philadelphia is atop the Eastern Conference but didn't push its lead over the last-place Pistons into double figures until early in the fourth quarter. That was when Dwight Howard's dunk put the 76ers up 99-88.\n\n\r\n                    Detroit trailed 110-108 after Jerami Grant made a 3-pointer with 28.5 seconds left, but Simmons calmly made two free throws to push the lead to four. \n\n\r\n                    “I have the confidence to step up and knock it down,” Simmons said. “Especially late game.”\n\n\r\n                    Delon Wright's layup made it 112-110, but Embiid closed the game out with his free throws and finished 12 of 17 from the line.\n\n\r\n                    Wayne Ellington scored 17 points for the Pistons, who led 63-61 at halftime and kept the game competitive despite being without Blake Griffin and Derrick Rose.\n\n\r\n                    “I loved the effort, I loved the togetherness guys played with,\" Detroit coach Dwane Casey said. \"We continue to do that, good things are going to happen.”\n\n\r\n                    Embiid scored 80 points in his previous two games, both wins over Boston. He said he had a sore back following a hard fall on his tailbone in Friday's game against the Celtics, but he was able to play, and the Pistons had all sorts of trouble stopping him.\n\n\r\n                    Embiid scored 21 points in the first half, keeping the 76ers within two even though Detroit outscored Philadelphia 27-6 from beyond the arc through two quarters.\n\n\r\n                    TIP-INS\n\n\r\n                    76ers: Howard received a technical foul in the second quarter, evidently for complaining to officials after his shorts appeared to be torn.\n\n\r\n                    Pistons: Ellington went 4 of 6 from 3-point range and is 24 of 41 from long distance in the past five games. ... Griffin sat out to manage a left knee injury, and Rose was out with left knee soreness.\n\n\r\n                    SOLID NIGHT\n\n\r\n                    Simmons hasn't been great from the line in his career. Last season, he shot 62%, and the previous two seasons were worse than that.\n\n\r\n                    He was 10 of 12 on Saturday, however.\n\n\r\n                    “Just having that confidence to knock those free throws down in a close game is big right now,\" teammate Tobias Harris said.\n\n\r\n                    Philadelphia went 30 of 38 as a team.\n\n\r\n                    UP NEXT\n\n\r\n                    These teams meet again in Detroit on Monday night. Philadelphia coach Doc Rivers said this sort of mini-series has its benefits and drawbacks.\n\n\r\n                    “Let’s say if a key guy is out and you get two cracks at a very good team, not only is it tough for that team but more importantly for the fans. They don’t get the chance to see a key guy in either one of the games,” Rivers said. “That’s part of the reason why they don’t do them. The competition is what I like about them. When you see a team back to back, the games are connected, they always are.”\n\n\r\n                    ------\n\n\r\n                    Follow Noah Trister at https://twitter.com/noahtrister\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997919.469814
}