{
  "game_id": "0021800353",
  "espn_id": "401071034",
  "date": "Dec 04, 2018",
  "matchup": "SAC @ PHX",
  "headline": "Hield scores 20, Kings bury Suns early in 122-105 win",
  "body": "PHOENIX --  The Sacramento Kings couldn't have asked for an easier lead-in to a three-game Eastern swing.\n\nBuddy Hield scored 20 points in 18 minutes and the Kings buried the Suns early on Tuesday night, outscoring Phoenix 36-9 in the first quarter as they cruised to a 122-105 victory.\n\nDe'Aaron Fox had 16 points and seven assists. Seven players scored in double figures for Sacramento, including Bogdan Bogdanovic off the bench with 14 points, and no starter played more than 27 minutes.\n\nSacramento has won two straight after losing its previous three.\n\n\"I just found the right spots, right time and my teammates were able to hit me,\" Hield said. \"Everybody did a great job of spreading the ball around.\"\n\nRookie De'Anthony Melton led Phoenix with a career-high 21 points. Trevor Ariza and Josh Jackson scored 14 each for the Suns, who have lost six straight and nine of 10.\n\nPlaying without leading scorer Devin Booker, who has missed two of the last three games, and forward TJ Warren, out for the third straight game with right ankle soreness, the Suns couldn't overcome 3-for-17 shooting in the first 12 minutes.\n\n\"We lost the game in the first quarter, then from there it was just competing to show we had character, which we did in the second half,\" Suns coach Igor Kokoskov said. \"No excuses, the effort wasn't there.\"\n\nThe Suns missed their first 12 3-point attempts. Sacramento center Willie Cauley-Stein had four steals in the game's first four minutes.\n\n\"It was just the focus and the desire defensively to get after them,\" Kimgs coach Dave Joerger said. \"It was kind of our night and a lot of shots went down for us and we got off to a quick start, and that helped.\"\n\nThe Kings ended the period on Bogdanovic's layup with 1.4 seconds remaining. That brought boos from the crowd as the Suns set a season low for scoring in a quarter.\n\nFans cheered derisively when the Suns reached double figures at the 9:37 mark of the second period.\n\nHield's third 3 of the first half gave the Kings a 46-13 lead at the eight-minute mark. Melton made the Suns' first 3-pointer of the night with 6:20 left in the second quarter, and when Ariza flew in for a fast-break dunk with 4:42 to go in the half, the score was 53-24.\n\nThe Kings took a 68-40 lead into halftime, with Hield's 18 points leading the way.\n\n\"It is really hard to play a game where we don't make shots. There are going to be times like that,\" Jackson said. \"It's basketball, but the times we don't make shots we have to make sure we play good defense and not let the other team score.\"\n\nPhoenix got as close as 22 points in the third quarter, 81-59, but the Kings responded with a 13-2 run and took a 99-67 lead into the fourth.\n\nTIP-INS\n\nKings: Four of Tuesday's starters have started all 23 games this season. The exception was Iman Shumpert, who has started 18 of 20 games. ... Bogdanovic walked over to slap hands with Kokoskov during a stoppage in play in the first quarter. Both are from Serbia. ... At 12-11, this is the deepest into a season the Kings have been above .500 since the end of the 2005-2006 campaign.\n\nSuns: Booker was unable to play after injuring his hamstring Sunday against the Los Angeles Lakers. ... For the second time this season, the Suns started three rookies in Deandre Ayton, Elie Okobo and Mikal Bridges. ... G Troy Daniels scored a season-high 13 points off the bench.\n\nBAGLEY RULED OUT\n\nA possible matchup between the top two picks in this year's draft fizzled when Marvin Bagley III, chosen second overall by the Kings after Ayton was taken by the Suns, was ruled out for the second straight game with back spasms.\n\nJoerger noted that NBA teams often play more games before Christmas than a college team plays in the entire season.\n\n\"It's a grind and he loves to play, so you love that part about him and he wants to be out there,\" Joerger said of Bagley, who is from nearby Tempe. \"He'll get back out there as soon as he is physically confident and so is our staff.\"\n\nBAHAMA BALLERS\n\nAyton and Hield were born in The Bahamas, making Tuesday's game the first in NBA history to feature two players from the island nation. They are the fourth and fifth players from their country in NBA history, and five media members from The Bahamas were credentialed to cover the game.\n\nUP NEXT\n\nKings: At the Cleveland Cavaliers on Friday.\n\nSuns: At the Portland Trail Blazers on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994885.5572748
}