{
  "game_id": "0022000198",
  "espn_id": "401267358",
  "date": "Jan 17, 2021",
  "matchup": "CHI @ DAL",
  "headline": "Bulls roll past Mavs 117-101 to end 4-game losing streak",
  "body": "DALLAS -- — Lauri Markkanen had 29 points and 10 rebounds, Garrett Temple scored 15 of his season-high 21 points in the second quarter and the Chicago Bulls ended a four-game losing streak with a 117-101 victory over the Dallas Mavericks on Sunday.\n\n\r\n                    Dallas star Luka Doncic passed Michael Jordan on the career list with his 29th triple-double, finishing with 36 points, 16 rebounds and 15 assists, including a behind-the-back pass to Willie Cauley-Stein for a dunk. Doncic is tied with Grant Hill for 15th place. \n\n\r\n                    The Slovenian sensation, who had 30 points at halftime, didn't get nearly enough help with the Mavericks missing five rotation players because of COVID-19 protocols and guard Tim Hardaway Jr. with a left groin strain.\n\n\r\n                    “Not having Hardaway hurts us,” coach Rick Carlisle said. “But we have other guys that can fill in and do the job defensively and play a role within the system.” \n\n\r\n                    Doncic had his European sidekick in Kristaps Porzingis, who scored 20 points, after both missed a loss at Chicago this month. But the 7-foot-3 Latvian was 0 of 7 from 3-point range as Dallas players not named Doncic shot 10% from deep (2 of 20).\n\n\r\n                    Markkanen, in his second game back after missing seven games because of COVID-19 protocols, was 10 of 19 from the field while recording season highs in points and rebounds.\n\n\r\n                    “I was a little short on my shot and trying to get my legs back,” Markkanen said. “Conditioning-wise, I feel pretty good. There was a stretch in the third quarter when I checked in and I felt like it was 20 seconds and I was gassed. Other than that little stretch, it was pretty good.”\n\n\r\n                    The Bulls, who lost all four games on their skid by four points or fewer, took control with a 40-point second quarter and didn't let their lead get under nine points in the second half.\n\n\r\n                    Zach LaVine, who had 21 first-quarter points in the earlier win over Dallas, didn't get his first bucket until the third quarter while going 1 of 8 from the field and making all eight free throws to finish with 10 points and 10 assists. \n\n\r\n                    “I thought he made great decisions and he played a tremendous floor game,” coach Billy Donovan said. “He didn’t really force anything. There was a lot of things we did today where I thought there was some growth from the last game.”\n\n\r\n                    Dallas guard Jalen Brunson, who scored a season-high 31 points when Doncic was sidelined by a quadriceps injury in Chicago, was listed as questionable on the COVID-19 list and didn't play. Josh Richardson, Dorian Finney-Smith, Maxi Kleber and Dwight Powell were out again. Carlisle said he expected Brunson to be available Monday against Toronto.\n\n\r\n                    TIP-INS\n\n\r\n                    Bulls: After setting a franchise record with consecutive games with at least seven 3-pointers, LaVine missed all five shots from long range. ... The Bulls finished with six players in double figures. The other was Wendell Carter Jr., who had 12 points, seven rebounds and five of Chicago's 14 steals.\n\n\r\n                    Mavericks: During warmups for the first two of two straight games on MLK Day weekend, the players wore shirts that read on the front, “Now is the time to make justice a reality for all.” The back read, “honor KING.” ... Cauley-Stein and James Johnson were the other double-figure scorers for Dallas with 10 points apiece.\n\n\r\n                    HELP IN THE FOURTH\n\n\r\n                    The Bulls kept the lead in double digits throughout the fourth quarter thanks in part to Otto Porter Jr., who had 12 of his 14 points in the final period and finished with nine rebounds. Thaddeus Young scored 15 points, with four in the fourth.\n\n\r\n                    GAMES PILING UP\n\n\r\n                    If the schedule holds, the Mavericks are headed on another three-game road trip that will put them at 11 of their first 15 games away from home. After that, it's another back-to-back with a home game against Houston on Saturday. And that will be five games in seven days.\n\n\r\n                    “Right now we’re entering the most difficult stretch of schedule in Mavericks history,” Carlisle said.\n\n\r\n                    UP NEXT\n\n\r\n                    Bulls: Chicago visits Houston on Monday to finish its fourth back-to-back. The Bulls have lost each of the first three back ends.\n\n\r\n                    Mavericks: Dallas travel to the Raptors' temporary home in Tampa, Florida, on Monday in the second back-to-back of the season. The Mavericks lost at Chicago in the first game of their other back-to-back before winning at Houston.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997599.999807
}