{
  "game_id": "0021501225",
  "espn_id": "400829112",
  "date": "Apr 13, 2016",
  "matchup": "MIL vs. IND",
  "headline": "Solomon Hill scores 25, Pacers beat Bucks 97-92",
  "body": "MILWAUKEE -- The Indiana Pacers rested four starters in their regular-season finale as they started looking ahead to the playoffs. The backups filled in quite nicely against the Milwaukee Bucks.\nSolomon Hill scored a season-high 25 points and went a career-best 7 of 11 from 3-point range, and the Pacers defeated Milwaukee 97-92 on Wednesday night with starters including Paul George and Monta Ellis sitting out.\nLavoy Allen and Glenn Robinson III each added 14 points for Indiana, which had clinched the seventh seed in the Eastern Conference on Tuesday night after beating the New York Knicks. Indiana is locked into a first-round playoff series with the Toronto Raptors.\n\nIndiana led by as many as 24 before the Bucks closed to within five with 36 seconds left. No Pacer played more than the 33 minutes by Hill.\n\"This game went the way I wanted it to go,\" coach Frank Vogel said. \"Guys came in, they were the aggressor, they jumped all over this team early and then the third-unit guys came in and finished strong.\"\nGiannis Antetokounmpo led the Bucks with 19 points and nine rebounds. Jabari Parker added 17 points and seven boards.\nBut the Bucks' franchise forwards didn't play much in the fourth quarter as Milwaukee finished 33-49 and out of the playoffs after making a surprise run last season with a young roster.\nLeading scorer Khris Middleton played just eight minutes. He strained his left thigh last week.\nThe Bucks were beset by injuries in the backcourt this season.\n\"Nobody got hurt (Wednesday) and now we get back to the drawing board to see how we can get better for next season,\" coach Jason Kidd said.\nThe Pacers built the lead back to double digits for stretches of the fourth quarter after Milwaukee went nearly five minutes of the period without a field goal.\nON A ROLL\nIndiana enters the playoffs having won six of seven, a confidence-building stretch that followed a 1/3 spurt.\n\"So, I love the fact that we're playing some good basketball,\" Hill said. \"We're playing some winning basketball.\"\nJASON KIDD\nKidd, who finished his second season in Milwaukee, said he wouldn't initiate any discussion about a contract extension. He's entering the final year of a three-year deal. \"If that comes up sometime this summer, then we'll address it,\" Kidd said before the game.\nBUCKS BRASS\nContract extensions aren't discussed during the season, Bucks co-owner Wes Edens said. Edens and fellow owners Marc Lasry and Jamie Dinan said before the game that they were disappointed with the 33-win season, though they were happy with the progress in areas including the growth of Antetokounmpo and Parker.\n\"John Hammond has drafted some great players over time. He's a very, very high-quality general manager. Jason is a young coach,\" Edens said. \"We all have a lot of room to grow.\"\nCHRISTMAS TIME\nPacers forward Rakeem Christmas, a rookie from Syracuse, made his NBA debut, scoring four points and making both his field-goal tries.\nTIP-INS\nPacers: Coach Vogel said the decision to rest the four starters was as much \"about the guys that get opportunities as the guys that are resting.\" It was a chance for reserves to get into more of a rhythm with the playoffs looming, he said.\nBucks: G Jerryd Bayless missed his seventh straight game because of a hyperextended right knee. Bayless, one of the team's top 3-point shooters this year, is set to become a free agent. \"We like what Bayless has done the last few years,\" Kidd said. \"We'll see how the summer plays out.\"\nUP NEXT:\nPacers: Play second-seeded Toronto in the first round of the playoffs.\nBucks: With the season over, the team holds exit interviews for players on Thursday.\n---\nFollow Genaro Armas at http://twitter.com/GArmasAP",
  "source": "espn_api",
  "crawled_at": 1764993990.9765928
}