{
  "game_id": "0021601091",
  "espn_id": "400900486",
  "date": "Mar 26, 2017",
  "matchup": "OKC @ HOU",
  "headline": "Williams leads Rockets to easy 137-125 win over Thunder",
  "body": "HOUSTON --  James Harden was Houston's fourth-leading scorer on Sunday against the Oklahoma City Thunder.\n\nHowever, it was clear to everyone that he was the key to Houston's victory.\n\nLou Williams scored 31 points off the bench, Harden finished with 22 points and 12 assists, and the Rockets never trailed while cruising to a 137-125 victory.\n\n\"He could've easily gotten 40 points and he could've just kept on going,\" coach Mike D'Antoni said. \"But he knew these guys were going and threw the ball their way. He just plays the game the way it should be played.\"\n\nRussell Westbrook had 39 points, 13 assists and 11 rebounds for his second straight triple-double and 36th this season, but Harden led the Rockets to a 25-point bulge through three quarters in the matchup between top MVP candidates.\n\n\"The hit a lot of shots, man,\" Westbrook said. \"They got hot and especially with a team like that, they get hot and it can be trouble.\"\n\nTrevor Ariza and Eric Gordon added 24 points apiece for the Rockets, whose lead was trimmed to eight on a 3-pointer by Westbrook with about 90 seconds left. The Rockets scored four quick points after that to secure the victory.\n\nHarden certainly loves to score, but had plenty of fun watching so many other guys get in on the action.\n\n\"Especially when you've got several guys knocking down shots and making plays,\" he said. \"Trevor did a really good job on both ends and obviously Lou and Eric. Pat (Beverley) didn't score the ball but he did so many other things that won't show up on the stat sheet but got us a victory.\"\n\nHarden left late in the game after crashing into the court and appearing to injure his left wrist. It was wrapped after the game, but he said he was OK and didn't expect to miss any time.\n\nHouston jumped out to a 9-0 lead and was up by at least 20 for most of the game. It was a stark change from the first three games between these teams this season, which were decided by a combined seven points.\n\nWilliams made 11 of 15 shots and tied a career-high by making 7 of 8 3-pointers. He didn't miss a shot until his layup was blocked by Jerami Grant early in the fourth quarter.\n\nHouston won its fourth straight overall and has won nine of their past 12 games against the Thunder.\n\nThe Rockets shot 71 percent in the first half, and Harden made a layup before grabbing a rebound and hitting a 3-pointer at the buzzer to extend Houston's lead to 113-88 entering the fourth quarter.\n\nThe Thunder chipped away with a 12-4 run midway through the fourth quarter to get within 126-114 with 4 minutes left. Williams hit a 3-pointer after that to slow down the Thunder the team's late run.\n\nHouston had built a 79-59 lead by halftime thanks in part to nearly perfect 3-point shooting by Ariza and Williams. Ariza made four of five attempts and had 16 points at the break, and Williams was a perfect 6 for 6 overall, with four 3-pointers to pile up 18 points in the first two quarters.\n\nTIP-INS\n\nThunder: Victor Oladipo finished with 15 points. ... Steven Adams and Alex Abrines scored 11 points apiece. ... The Thunder had won the past 11 games in which Westbrook had a triple-double.\n\nRockets: Houston's 79 points were the most the team has scored in a half this season. ... Sunday was the 12th time this season the Rockets had 100 points before the fourth quarter. ... Williams had at least 20 points off the bench for the 29th time this season. ... The Rockets shot 63.3 percent for their highest field goal percentage since shooting 63.4 percent on Jan. 24, 1995.\n\nANDERSON'S HEALTH\n\nHouston's Ryan Anderson will miss about two weeks after spraining his right ankle on Friday night against the Pelicans. D'Antoni hopes Anderson will recover in time to play the last couple of regular-season games and be at full strength for the start of the playoffs.\n\nTHEY SAID IT\n\nWestbrook on his relationship with Harden: \"It's a blessing to be able to have people you grew up with in the NBA. It's something you don't take for granted and friendships are something I don't take for granted. James is a good friend of mine, and I am a good friend of his.\"\n\nUP NEXT\n\nThunder: Visit Dallas on Monday.\n\nRockets: Host Golden State on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764995251.136266
}