{
  "game_id": "0022000582",
  "espn_id": "401307365",
  "date": "Mar 12, 2021",
  "matchup": "MIA @ CHI",
  "headline": "Butler scores 28, Dragic adds 25 as Heat beat Bulls 101-90",
  "body": "CHICAGO -- — Jimmy Butler scored 28 points against his former team, Goran Dragic added 20 of his 25 points in the fourth quarter, and the Miami Heat beat the Chicago Bulls 101-90 Friday night for their ninth win in 10 games.\n\n\r\n                    Butler, who played his first six seasons in Chicago, scored 25 through the first three quarters. The five-time All-Star was more than willing to let Dragic take over from there.\n\n\r\n                    “I knew it was Goran's time,” said Butler, who had eight assists. “He had made a couple shots earlier. He was getting into the paint at will so it was time for him to take it up a notch.”\n\n\r\n                    Butler implored Dragic to be more aggressive. And he sure did assert himself down the stretch.\n\n\r\n                    Dragic made three 3-pointers in the fourth quarter and shot 4 of 8 in the game. He shot 9 of 15 overall and finished one point shy of his season high, helping Miami come out on top on a night when both teams looked as if they were finishing back-to-backs.\n\n\r\n                    “We needed it,” coach Erik Spoelstra said. “This game was in the mud. Back-to-backs, they are what they are. Both teams had to deal with it. ... This was a game you just had to stay the course, have some mental toughness. Guys had to make some plays. And Goran was just sensational, obviously, in that fourth quarter.”\n\n\r\n                    The Heat improved to 20-18 after moving above .500 for the first time this season by beating Orlando on Thursday. The Bulls delivered another sluggish performance coming off a blowout loss a night earlier to Philadelphia with Sixers Joel Embiid and Ben Simmons unavailable due to contact tracing.\n\n\r\n                    Zach LaVine led Chicago with 30 points. Lauri Markkanen scored 20 in his second game back after missing more than a month because of a sprained right shoulder. The Bulls lost for the fourth time in five games.\n\n\r\n                    “I wanted to try to set the tone because I knew they were gonna be physical,” LaVine said. “That's their whole identity. I just tried to match it and tried to get us off to a good start.” \n\n\r\n                    CARRYING MIAMI\n\n\r\n                    Dragic said he was “passive” in the first half. He credited the Bulls and Tomas Satoransky in particular.\n\n\r\n                    “Jimmy told me at one point, Hey G, we need you to be more aggressive and to be more involved,” Dragic said.\n\n\r\n                    He certainly delivered in the fourth.\n\n\r\n                    Dragic scored eight in a row in a span of just over a minute early in the quarter, hitting two foul shots and back-to-back 3s to turn a one-point lead into an 81-72 advantage with 8:50 remaining in the game.\n\n\r\n                    He added 12 more in a stretch of about three minutes, capped by a 3 with 3:26 left to make it 96-82.\n\n\r\n                    “Goran can get like that,” Butler said. “Feed the hot hand. The game's simple.”\n\n\r\n                    TIP-INS\n\n\r\n                    Heat: Miami has won four straight in Chicago. ... The Heat were without C Bam Adebayo (knee) and G Avery Bradley (calf) as well as F Meyers Leonard, who was suspended Thursday by the NBA and fined $50,000 for using an anti-Semitic slur. Adebayo missed his third game in a row, while Bradley has not played since Feb. 3. \n\n\r\n                    Bulls: F Garrett Temple walked off the court with an ankle injury after fouling Dragic early in the fourth and is scheduled for an MRI on Saturday, coach Billy Donovan said. ... Chicago had six turnovers in the first quarter after giving the ball away seven times in the opening period against Philadelphia on Thursday. ... Otto Porter Jr. was scoreless in 12 minutes in his second game back. He had been sidelined since Feb. 1 because of back spasms.\n\n\r\n                    UP NEXT\n\n\r\n                    Heat: Visit Orlando on Sunday.\n\n\r\n                    Bulls: Host Toronto on Sunday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996787.482691
}