{
  "game_id": "0022300284",
  "espn_id": "401584912",
  "date": "Dec 02, 2023",
  "matchup": "MIA vs. IND",
  "headline": "Pacers put on historic shooting show, run away from Heat 144-129",
  "body": "MIAMI -- — Let's put what the Indiana Pacers did on Saturday night in perspective. They missed 15 shots in the first quarter, then 14 shots in the next three quarters combined.\n\n\r\n              Oh, and without their best player.\n\n\r\n              Add it all up, and the NBA's highest-scoring team just put on a dazzling offensive show — the best-shooting show ever against the Miami Heat. Bruce Brown scored 30 points, Obi Toppin added 22 and the Pacers shook off the absence of leading scorer Tyrese Haliburton to beat the Heat 144-129.\n\n\r\n              “The start wasn't awesome,” Pacers coach Rick Carlisle said. “But the fight was there from start to finish.”\n\n\r\n              The Pacers missed their first shot of the second quarter and were shooting 36% — 9 for 25 — at that point. \n\n\r\n              They shot an absurd 78% — 47 for 60 — the rest of the way.\n\n\r\n              The Pacers finished at 66%, the second-best rate in franchise history. They shot 67% against Minnesota on Oct. 24, 2017. And it was the best percentage ever shot against a Heat team; the Los Angeles Lakers shot 64% against Miami on Nov. 23, 1988.\n\n\r\n              “You have to credit Indiana,” Heat coach Erik Spoelstra said. “You took out their best player, the guy that drives this offense, and they didn't slow down one bit.”\n\n\r\n              T.J. McConnell shot 10 for 11 and finished with 20 points and 11 assists off the bench for Indiana, and Aaron Nesmith also had 20 points for the Pacers.\n\n\r\n              Jimmy Butler scored 33 points for Miami, which got 18 from Caleb Martin. The 273 points in the two games against the Pacers — Miami won 142-132 on Thursday — were the most ever by Miami in a two-game span.\n\n\r\n              The Heat went 1-1 in those games, even with the Pacers playing without Haliburton — who had 44 points in Thursday's game.\n\n\r\n              Haliburton was dealing with right knee soreness and what the team said was an upper respiratory infection. Carlisle said it was the non-COVID illness, not the knee, that kept Haliburton out on Saturday. Haliburton missed one other game this season — and in that one, the Pacers lost 155-104 to Boston.\n\n\r\n              They get a second chance at Boston on Saturday in the In-Season Tournament quarterfinals.\n\n\r\n              “We were in this situation before in Boston when Ty was out and I only had two points,” Brown said. “That's unacceptable. So, I took a challenge mentally to be better tonight.”\n\n\r\n              Miami lost starting forward Haywood Highsmith after just three minutes because of back spasms — Martin started the second half in his place — and the Heat were again without All-Star center Bam Adebayo because of a bruised left hip.\n\n\r\n              Adebayo missed the second half of Thursday's win because of the hip issue, which has bothered him for a couple weeks, and already has been ruled out of Miami's next game Wednesday at Toronto. The earliest he might play again is Friday when the Heat play host to Cleveland.\n\n\r\n              “We just want to take care of it before it does take a turn for something else,” Spoelstra said. “He seems to continue to get hit in that exact same spot, which is almost impossible. But we’ll take care of it.”\n\n\r\n              Adebayo was clearly missed on the defensive end. The Pacers made 23 of 28 shots in the paint over the middle two quarters, fueling a stretch where they outscored Miami 81-67 over those 24 minutes. \n\n\r\n              UP NEXT\n\n\r\n              Pacers: Host Boston in an In-Season Tournament quarterfinal game Monday.\n\n\r\n              Heat: Visit Toronto on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995378.8553522
}