{
  "game_id": "401810214",
  "espn_id": "401810214",
  "date": "Dec 07, 2025",
  "matchup": "CHA vs DEN",
  "headline": "Denver plays Charlotte following Jokic's 40-point game",
  "body": "Denver Nuggets (16-6, fourth in the Western Conference) vs. Charlotte Hornets (7-16, 12th in the Eastern Conference)\n\n\r\n              Charlotte, North Carolina; Sunday, 6 p.m. EST\n\n\r\n              BOTTOM LINE: Denver plays the Charlotte Hornets after Nikola Jokic scored 40 points in the Nuggets' 134-133 victory against the Atlanta Hawks.\n\n\r\n              The Hornets are 5-6 in home games. Charlotte is 5-11 in games decided by 10 or more points.\n\n\r\n              The Nuggets are 10-2 in road games. Denver has a 2/3 record in one-possession games.\n\n\r\n              The Hornets are shooting 45.3% from the field this season, 1.3 percentage points lower than the 46.6% the Nuggets allow to opponents. The Nuggets average 13.6 made 3-pointers per game this season, the same that the Hornets allow.\n\n\r\n              TOP PERFORMERS: Miles Bridges is averaging 20.8 points, 6.2 rebounds and 3.4 assists for the Hornets. Tidjane Salaun is averaging 5.0 made 3-pointers over the last 10 games.\n\n\r\n              Jamal Murray is averaging 24.6 points and 6.9 assists for the Nuggets. Jokic is averaging 40.0 points and 9.0 rebounds while shooting 50.0% over the past 10 games.\n\n\r\n              LAST 10 GAMES: Hornets: 3-7, averaging 111.2 points, 43.0 rebounds, 23.5 assists, 7.1 steals and 5.3 blocks per game while shooting 44.0% from the field. Their opponents have averaged 115.8 points per game.\n\n\r\n              Nuggets: 6-4, averaging 126.8 points, 42.7 rebounds, 29.5 assists, 5.5 steals and 4.5 blocks per game while shooting 52.2% from the field. Their opponents have averaged 123.5 points.\n\n\r\n              INJURIES: Hornets: Grant Williams: day to day (acl), Pat Connaughton: day to day (calf), Josh Green: out (shoulder), Collin Sexton: day to day (thigh), Tre Mann: day to day (ankle).\n\n\r\n              Nuggets: Christian Braun: out (ankle), Aaron Gordon: out (hamstring), Julian Strawther: out (back).\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042771.449644
}