{
  "game_id": "0021900552",
  "espn_id": "401161194",
  "date": "Jan 07, 2020",
  "matchup": "PHX vs. SAC",
  "headline": "Kings rally from 21 points down, beat Suns 114-103",
  "body": "PHOENIX --  The Sacramento Kings pulled off quite the stunner when they recovered from a 21-point deficit in the third quarter to beat the Phoenix Suns 114-103 on Tuesday night.\n\nThe players on the floor who made it happen were even more surprising.\n\nAn unlikely lineup that included the disgruntled Dewayne Dedmon and veteran guard Trevor Ariza led the comeback, pushing the Kings to their second win in two nights and third out of four games. Both came off the bench, but Sacramento coach Luke Walton stuck with them in the game's most important minutes.\n\nDedmon hasn't played much in recent weeks and was fined $50,000 by the NBA last week after making public comments about wanting a trade. He was forced into action on Tuesday because of a shoulder injury for Richaun Holmes and responded with 12 points and 10 rebounds.\n\n\"He stepped up,\" Kings guard Cory Joseph said of Dedmon. \"Everybody sees the game, but sometimes they don't see the work players put in behind the scenes. That's what he's been doing. He's been waiting for his moment and his moment was today. He executed and delivered for us.\"\n\nThe 30-year-old Dedmon signed a three-year, $40 million deal with the Kings during the offseason but came into the game averaging just 4.8 points and 3.8 rebounds.\n\n\"He's done a nice job of keeping himself ready,\" Walton said. \"He took full advantage today, played for his teammates just like that whole group did. They all made plays for each other and it was a lot of fun to coach.\"\n\nSacramento's De'Aaron Fox led the team with 27 points while Nemanja Bjelica added 19. Buddy Hield scored 16 points and Ariza had 15.\n\nThe Kings trailed 83-62 with 4:25 remaining in the third but recovered in a hurry, rallying to take a 92-91 lead on Bjelica's dunk with about eight minutes left. The game was tight for the next several minutes but Fox hit a 3-pointer and then another jumper to push the Kings ahead 107-100 with 2:29 left.\n\nThe Suns were led by Devin Booker, who scored 34 points and had seven assists. It was Booker's seventh straight game with at least 30 points, which extends his franchise record. The performance didn't stop the Suns from coughing up the big lead and losing their second straight game at home.\n\n\"This is about perseverance,\" Suns coach Monty Williams said. \"We are not going to turn this thing around overnight. It just takes a lot of will. You cannot quit.\"\n\nDeandre Ayton added 21 points and nine rebounds. Kelly Oubre Jr. had 17 points.\n\nThe game was tied at 53 at halftime but the Suns started the second half on an 18-2 run and pushed their advantage to 21 points before settling for an 87-78 lead after three quarters. Things continued to spiral out of control in the fourth quarter for Phoenix, which has a 7-19 record after starting the season 7-4.\n\n\"We can't win against anyone if we don't compete for 48 minutes,\" Suns forward Aron Baynes said. \"But if we compete for 48 minutes, we can beat anyone.\"\n\nThe Kings were playing the second night of a back-to-back after beating the Warriors 111-98 on Monday.\n\nTIP-INS\n\nKings: Forward Marvin Bagley III (left foot sprain), Holmes (right shoulder strain) and guard Bogdan Bogdanovic (right ankle soreness) didn't play. ... Because of the injuries, Harry Giles III made his first career start. He finished with eight points and eight rebounds. ... Fox led the Kings with 16 points in the first half.\n\nSuns: Forward Dario Saric scored five points in 18 minutes. His role has been reduced since Ayton came back to the lineup, but Williams said he wanted to get the 25-year-old more involved in the rotation. ... Ayton scored 14 points on 7-of-8 shooting in the first half. He also had eight rebounds.\n\nUP NEXT\n\nKings: Sacramento returns home to face the Bucks on Friday.\n\nSuns: Phoenix hosts the Magic on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996561.4610791
}