{
  "game_id": "0021600807",
  "espn_id": "400900212",
  "date": "Feb 10, 2017",
  "matchup": "CHI @ PHX",
  "headline": "Booker scores 27 points, Suns roll past Bulls 115-97",
  "body": "PHOENIX --  Chicago is the latest Eastern Conference team to fall to the Phoenix Suns, another ugly loss for the Bulls on the road.\n\nDevin Booker scored 27 points, Eric Bledsoe added 23 and the Suns rolled past Chicago 115-97 on Friday night.\n\nJimmy Butler scored 20 and Dwyane Wade 18 for the Bulls, who were coming off a 31-point loss at Golden State two nights earlier.\n\n\"Awful, awful,\" Chicago coach Fred Hoiberg said. \"They outcompeted us in every category tonight -- every category -- rebounding, loose balls, transition 19-6 (in fast-break points). That tells you all you need to know.\"\n\nThe Suns, with the second-worst record in the NBA, snapped a three-game losing streak and won for just the second time in 10 games.\n\nBut they are 11-7 against the East, 7-4 at home. Of course, that makes them 5-30 against the Western Conference.\n\n\"We just keep navigating through this season,\" Phoenix coach Earl Watson said. \"It hasn't been the easiest season, but we understand where we started. ... With our young, feisty roster, we continue to push forward.\"\n\nButler played despite a bruised right heel, and Wade had an upper respiratory illness.\n\n\"Obviously, I was under the weather,\" Wade said. \"I'm just trying to fight fatigue and Jimmy the same thing, trying to come back after being off for a while.\"\n\nButler said he was in \"a little pain.\"\n\n\"I don't want to say that I'm out there completely healthy, but I want to compete,\" he said. \"I was just hoping this thing goes away so I'm not favoring it. And it's crazy because the way that the game goes, sometimes you've got to use that foot and you try to avoid it.\"\n\nChicago has lost three of four, with one stop remaining on a six-game road trip.\n\nT.J. Warren scored 16 and Alan Williams had 14 points and 11 rebounds for Phoenix.\n\nPhoenix was up by 13 at halftime, led by 14 in the third quarter and opened a 20-point advantage down the stretch in the fourth.\n\n\"Just playing defense,\" Booker said. \"I put this game up there with any other game with us playing defense this year. We were at our best, we were helping each other, a lot of communication going on. We've been saying it all year, we can score with anybody, it's just about getting stops.\"\n\nChicago had an early 25-16 lead, but the Suns outscored Chicago 23-6 over the final 8:41 of the first half to lead 56-43 at the break.\n\nThe Bulls opened the second half with a 9-2 spurt to cut the margin to 58-52, but Bledsoe responded with a three-point play and P.J. Tucker's 3-pointer gave Phoenix a 59-45 lead with 4:40 left in the third quarter.\n\nChicago scored the first two points of the fourth to get within eight, but never got closer.\n\nBooker's 3 capped a 15-4 run that gave Phoenix its biggest lead, 109-89, with 2:58 to play.\n\nCENTER SHORTAGE\n\nPhoenix center Tyson Chandler sprained his right ankle with 3:50 to play in the first half and did not return. The Suns already were without Chandler's backup, Alex Len, who was suspended by the NBA for one game for leaving the bench during an altercation with the Grizzlies in Memphis on Wednesday night. Their absences meant extra playing time for Williams, who made the most of his 24 minutes on the court.\n\nWilliams, who grew up in Phoenix, usually is the most animated player cheering on his teammates from the bench.\n\n\"He brings it every day in practice, he brings it every day on the bench,\" Booker said. \"So to see him out there shining and getting this opportunity in front of his hometown, it's unbelievable.\"\n\nTIP-INS\n\nBulls: Fell to 26-28. ... Chicago missed 13 of its last 16 shots in the first half. ... The Bulls hadn't played Phoenix in 15 months. The Suns won that game in Chicago 103-101 by scoring the final seven points. ... The Bulls host the Suns in two weeks.\n\nSuns: The crowd of 18,055 was the Suns' sixth sellout of the season. ... Ex-Suns star Shawn Marion had a courtside seat with his young son. ... Williams' mother, Jeri Williams, is the Phoenix police chief. ... Phoenix is second to Golden State in fast-break points.\n\nUP NEXT\n\nBulls: Complete a six-game road trip at Minnesota on Sunday.\n\nSuns: At the Houston Rockets on Saturday night.",
  "source": "espn_api",
  "crawled_at": 1764995042.172601
}