{
  "game_id": "0022301056",
  "espn_id": "401585684",
  "date": "Mar 27, 2024",
  "matchup": "MIN vs. DET",
  "headline": "Timberwolves beat Pistons 106-91 to hit 50-win mark for 5th time in franchise's 35 seasons",
  "body": "MINNEAPOLIS -- — Naz Reid had 21 points and 10 rebounds and Jaden McDaniels added 20 points to help the Minnesota Timberwolves overcome a sluggish start Wednesday night to beat the NBA -worst Detroit Pistons 106-91.\n\n\r\n              Rudy Gobert had 11 points and 14 rebounds and Kyle Anderson scored 14 points off the bench to help offset a quiet nine points by All-Star Anthony Edwards for the Wolves (50-22), who moved into a second-place tie with Oklahoma City in the Western Conference after the Thunder lost in overtime to Houston. \n\n\r\n              Denver has a half-game lead over Minnesota and Oklahoma City after the Nuggets lost to Phoenix.\n\n\r\n              “Why not the first seed? And regardless of whether we do or not, we know the real season starts in mid-April,” Gobert said.\n\n\r\n              The Wolves hit the 50-win mark for just the fifth time in their 35 seasons, matching the franchise's third-highest total with 10 games to go. Minnesota's all-time best record was 58-24 in 2003-04.\n\n\r\n              “It means a lot. I’ve been here four years now and ain’t got close to 50 wins,” McDaniels said. “It’s a little milestone, but we've still got to keep winning.”\n\n\r\n              Cade Cunningham scored 32 points for the Pistons (12-61), who lost their eighth straight. With nine games to go, they've got the fourth-most losses in the franchise's 76-year history. The ignominious record (16-66) was set in 1979-80.\n\n\r\n              Edwards was largely disengaged, whether it was the defense by rookie Tosan Evbuomwan or simply a lifeless opponent on the other side at the end of a homestand after high-energy games against Denver, Cleveland and Golden State. Still, after being swept last season by a 65-loss Pistons team, this recovery from a rough first half was an encouraging sign for a Minnesota team with much bigger goals.\n\n\r\n              “We’re going to keep stacking ’em up, because there’s a lot to play for yet,” coach Chris Finch said.\n\n\r\n              The Wolves improved to 40-4 when allowing less than 110 points, leaning against on their Gobert-led, league-leading defense.\n\n\r\n              “He’s doing a great job. He’s setting the standard for everybody else,” Anderson said.\n\n\r\n              The Pistons ruled out seven players with injuries, with guard Jaden Ivey the latest to land on the list with a sore left knee. Coach Monty Williams sent out his 34th different starting lineup, with Chimezie Metu taking the floor for just his fifth game with the club and Evbuowman getting the start. The Pistons have used 30 players this season, tied with Houston (2020-21) for the most in a season in NBA history.\n\n\r\n              “There were some tough shots, maybe some times when we didn’t move the ball enough before we got into shots, especially when they were on their run,” Cunningham said. “We’ve got to find ways to make them guard still.”\n\n\r\n              The game was tied with less than four minutes left in the third quarter when Anderson's mid-range floaters started to kick in. When Nickeil Alexander-Walker hit one of his three 3-pointers near the end of the period, the Wolves were up by 12.\n\n\r\n              “We just don’t have enough firepower to come back from that kind of deficit,\" Williams said.\n\n\r\n              This will be the fifth straight year without Detroit in the playoffs. The last time the Pistons won a series in the playoffs was 2008, when they beat Orlando in the second round to advance to their third straight conference finals under coach Flip Saunders.\n\n\r\n              Saunders, who died of cancer at age 60 in 2015, was also the coach the last time the Wolves won a playoff series in 2004. They beat Sacramento in the second round to reach the conference finals, their lone appearance in the 35-year history of the franchise.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: at Washington on Friday.\n\n\r\n              Timberwolves: at Denver on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996450.027549
}