{
  "game_id": "0021700930",
  "espn_id": "400975676",
  "date": "Mar 02, 2018",
  "matchup": "DAL @ CHI",
  "headline": "Portis leads late rally, Bulls beat Mavs 108-100",
  "body": "CHICAGO --  Bobby Portis and the Chicago Bulls finally broke through with a late burst that made the difference.\n\nPortis scored 22 points and made three straight shots during the decisive run in the fourth quarter to help Chicago roar back and beat the Dallas Mavericks 108-100 on Friday night.\n\nPortis had 15 in the second half and Chicago used a 16-4 run in the final five minutes to end a five-game losing streak.\n\n\"I'm just trying to go out there to provide some scoring and some energy for us,\" said Portis, who played just over 34 minutes off the bench. \"If the shots are there, I'll take `em. If not, I'll move it on.\"\n\nKris Dunn finished with 18 points and rookie Lauri Markkanen had 17 points and 12 rebounds as Chicago won for just the third time in 16 games.\n\nPortis made a layup with 4:09 left to tie it at 96, then hit a turnaround jumper with 3:44 remaining to give Chicago its first lead. Portis followed up with a layup to make it 100-96.\n\n\"With Bobby, it's all about confidence,\" coach Fred Hoiberg said. \"He's not shying away from anything. He's not shying away from a shot, certainly.\n\n\"When he gets in that rhythm, when he gets in that zone, he's fun to watch.\"\n\nThen 3-point shots by Dunn and Markkanen and a jumper by Zach LaVine, who had 16 points, sent the Bulls to the win.\n\nHarrison Barnes scored 26 points and rookie Dennis Smith Jr. had 25 as Dallas lost for the 13th time in 16 games. The Mavericks have dropped six straight on the road.\n\nDirk Nowitzki had 18 points. The 39-year-old German's season high was 22 against the Lakers on Feb. 10.\n\nNowitzki pointed to untimely turnovers down the stretch that did in the Mavericks. Dallas had 16 for the game and nine in the second half.\n\n\"We really didn't play smart enough to pull this one out,\" Nowitzki said. \"We've been in plenty of close games this year. Unfortunately, we haven't really found ways of holding on consistently. Otherwise we'd be in the playoff hunt.\"\n\nFor most of the game, Smith stood out against Markkanen in a matchup of 20-year-old rookies. Markkanen entered fourth in rookie scoring (14.8 points per game) and Smith fifth (14.6).\n\nDallas settled for a 49-47 lead at the half after opening an 11-point lead in the first quarter and 14-point advantage in the second. The Mavericks raced ahead 10-0 just 3:12 in on Barnes' driving dunk and went up 21-10 on Smith's jumper with 4:51 left.\n\nDallas stretched the lead to 42-28 on JJ Barea's 3-pointer 4:04 into the second quarter, but an 11-0 run, capped by LaVine's three-point play, got the Bulls back into the game.\n\nThe Mavericks made their first five field goal attempts of the third, including consecutive 3s by Wesley Matthews, Smith and Barnes to open the lead to 62-52. Dallas stretched the lead to 73-59 on Smith's running layup midway through the quarter.\n\nTIP-INS\n\nMavericks: Smith scored 15 points in the first half on 6-of-9 shooting. ... Barnes scored 13 in the first half, going 6 for 12 from the floor. ... Forward Nerlens Noel played 15 minutes in his second game back from thumb surgery.\n\nBulls: Hoiberg said he planned to give Portis just his second start of the season in the Bulls' next game, on Monday against Boston. ... C Robin Lopez was inactive for a fifth straight game. ... Forward Jarell Eddie, who was signed to a 10-day contract, was assigned to the G League Windy City Bulls on Friday.\n\nTAKING AMES\n\nThree of four NBA players from Ames, Iowa were in the building. Barnes and fellow Dallas forward Doug McDermott, along with Bulls coach Fred Hoiberg, all attended Ames High School. Hoiberg went on to play at Iowa State, located in Ames, before 10 NBA seasons. He returned to Iowa State to coach for six seasons.\n\nDick Gibbs, 69, was the first Ames high school product to play in the NBA (1971-76)\n\nUP NEXT\n\nMavericks: Host New Orleans on Sunday night in the opener of a four-game homestand.\n\nBulls: Host Boston on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764993944.870684
}