{
  "game_id": "0022300306",
  "espn_id": "401584934",
  "date": "Dec 12, 2023",
  "matchup": "LAL @ DAL",
  "headline": "Doncic, Hardaway led Mavs over Lakers 127-125 in LA's first game since winning NBA Cup",
  "body": "DALLAS -- — Luka Doncic is piling up the minutes with All-Star sidekick Kyrie Irving sidelined by a bruised foot.\n\n\r\n              When his back cooperates, Tim Hardaway Jr. feels the responsibility to pile up the points when Irving isn't out there. \n\n\r\n              Doncic had 33 points and 17 assists, Hardaway scored a season-high 32 points and the Dallas Mavericks beat Los Angeles 127-125 on Tuesday night in the Lakers' first game since winning the inaugural In-Season Tournament.\n\n\r\n              Anthony Davis finished with 37 points and 11 rebounds, while LeBron James had 33 points, nine assists and eight boards as the Lakers' season-best four-game winning streak ended. LA erased a 15-point deficit early in the third quarter to set up an entertaining finish.\n\n\r\n              Dante Exum scored a season-high 26 points with a career-best seven 3-pointers on nine attempts, going 5 of 7 in the fourth quarter to help the Mavs stay in front. Austin Reaves had 22 for the Lakers.\n\n\r\n              Playing a night after back spasms made him a late scratch in Memphis, Hardaway filled in nicely in Irving's second game out since injuring the foot. He was 10 of 21 from the field, including 5 of 10 from 3, and 7 of 8 on free throws.\n\n\r\n              “Knowing how they're defending Luka, I had to just try to put a stamp on the game,” said Hardaway, who had missed three of the previous five games with his back issues. “When any shooter has any kind of daylight and you see the first shot go up and it goes in, the basket feels like an ocean.”\n\n\r\n              Grant Williams scored 19 points for Dallas in his return from a three-game absence with a right knee injury, but the Mavericks were still without two starters in Irving and Derrick Jones Jr. (quadriceps).\n\n\r\n              Dallas didn’t have rotation players Josh Green (elbow) and Maxi Kleber (toe), and Seth Curry joined them when he was ruled out at halftime with an ankle injury.\n\n\r\n              Doncic recorded his eighth consecutive 30-point game in his third straight game with at least 40 minutes. The four-time All-Star hadn’t done that since the 2021 playoffs.\n\n\r\n              The 24-year-old Doncic played the entire second half a night earlier to help Dallas hang on for a 120-113 victory in Memphis, then played 23 of the first 24 minutes against the Lakers. \n\n\r\n              The only real rest came late in the third, when a six-point lead disappeared, and he had enough left to get eight points and six assists in the fourth quarter, finishing at 43 minutes a night after playing 44.\n\n\r\n              “I don’t know how I played,” Doncic said. “I slept very little today, and everything hurts. I am getting older. But we got two back-to-back wins, which is amazing especially against a team like the Lakers.”\n\n\r\n              The Lakers took their first lead since early in the first quarter on Davis' first 3-pointer since Oct. 29 for a 95-93 edge with 0.1 seconds left in the third. \n\n\r\n              Doncic and James traded go-ahead and tying buckets twice midway through the fourth before James was called for an offensive foul. Doncic's 14th assist led to a 3-pointer from Exum for a five-point edge.\n\n\r\n              The Mavs, who won their fourth in a row, led by five before James hit a 3 at the buzzer for the final margin as Dallas held on in the second night of a back-to-back. The Lakers had two days off after their NBA Cup-clinching victory over Indiana in Las Vegas.\n\n\r\n              The Lakers were down three in the final minute when Exum hit a 3. An earlier one in the fourth came when Doncic wrapped a pass around one LA defender and through the hands of another.\n\n\r\n              “It was definitely impactful,” Lakers coach Darvin Ham said of Exum's second-highest scoring game, behind a 28-point outing for Cleveland almost four years ago. “In an attempt to put extra bodies in front of Luka, you decide who you are going to play a little bit heavier off of, but these guys are pros.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: At San Antonio on Wednesday to finish a back-to-back in the first of consecutive games against the Spurs, who just set a franchise record with their 17th straight loss.\n\n\r\n              Mavericks: Minnesota at home Thursday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995534.777602
}