{
  "game_id": "0021601009",
  "espn_id": "400900404",
  "date": "Mar 15, 2017",
  "matchup": "CHI vs. MEM",
  "headline": "Conley, Gasol lead Grizzlies over Bulls 98-91",
  "body": "CHICAGO --  After getting away lately from the tough defense that defines them, the Memphis Grizzlies have each other's backs again.\n\nMarc Gasol and Mike Conley scored 27 points apiece to lift the Grizzlies to their second straight win after dropping five straight, beating the Chicago Bulls 98-91 on Wednesday.\n\n\"Our defense has been much more consistent,\" Gasol said. \"We've been trusting the guy behind us a lot more, and the guy behind us has been there more often.\"\n\nThe Bulls lost for the sixth time in seven games and also lost Dwyane Wade to a sprained right elbow late in the game, missing the final 8:34.\n\nWade said he suffered the injury after colliding with a teammate and Memphis' Zach Randolph while going for a rebound.\n\n\"Hopefully it's not as bad as I perceived it to be,\" said Wade, who had his arm in a sling after the game. \"I knew it was something more just because of what I heard. I tried to play through it a little bit until the pain started getting a little more.\"\n\nBulls coach Fred Hoiberg said Wade will have an MRI on Thursday morning.\n\nMeanwhile, Conley and Gasol combined for 18 points in the fourth quarter for Memphis, who had 24 as a team.\n\n\"Obviously we're going to go through those guys, but the best thing about those guys is that they're willing passers,\" said Tony Allen, who scored 10 points in his hometown of Chicago. \"We want those guys to be more selfish than anything. When they have that 1-2 going, we just have to fall in line.\n\n\"We're going to need those guys to continue that down the stretch.\"\n\nChicago never led in the second half, but Nikola Mirotic had a pair of tying 3-pointers in the fourth quarter. Both were answered by Gasol, his teammate on the Spanish national team. The Grizzlies center hit a 3-pointer on the first, and then had a traditional three-point play on the second, finishing a dunk after a foul by Mirotic for an 86-83 lead.\n\nThe teams stayed within six points of each other in the first half, and Memphis went to the locker room with a 54-50 lead.\n\nThe Grizzlies then scored the first 10 points of the third quarter, capped by a pair of 3-pointers by Conley to go up 64-50.\n\nChicago closed the third quarter with a 7-0 run capped by Jimmy Butler's alley-oop dunk, delivered perfectly from Rajon Rondo from half-court to make it 74-71.\n\nRondo, who was starting his second straight game after coming off the bench for 27 straight games, scored 17 points to lead Chicago.\n\nMirotic and Butler had 14 points apiece for the Bulls, who shot 37.4 percent from the field.\n\n\"I like the way our defense is starting to come back to us,\" Memphis coach David Fizdale said. \"It's just good to see our guys competing again. We're competing as a team and with some purpose again. That's nice to see.\"\n\nTIP-INS\n\nGrizzlies: Vince Carter made his first field-goal attempt to make it nine straight after scoring 24 points Monday against Milwaukee. The 40 year-old went 8-for-8 shooting from the field and 2 of 2 from the free-throw line in that game, becoming the sixth player to score 20 or more points past their 40th birthday. He joined Hall of Famers Kareem Abdul-Jabbar, Robert Parish, John Stockton, Michael Jordan and Karl Malone on that list. Carter scored seven points on Wednesday. ... Randolph and Conley tied for game-high honors with nine rebounds apiece.\n\nBulls: Jerian Grant, who started 21 of his last 24 games played, was held out by Hoiberg for the second straight game. . Rookie Denzel Valentine had two 3-pointers during Chicago's comeback in the fourth quarter. He finished with 11 points, his third straight double-digit effort.\n\nPAYNE IN PAIN\n\nChicago point guard Cameron Payne missed Wednesday's game with a sore right foot, the same one he fractured twice in 2016.\n\nPayne had surgery in July on the foot after a Jones fracture and then had an acute fracture in September on the same bone.\n\n\"I feel like it's just constant pain, I just need to take a little time off it,\" Payne said. \"Honestly, it's just day to day. I feel like if it was playoffs, I'm playing, for sure.\"\n\nThis was the first game he missed since a trade deadline move from Oklahoma City last month, Payne has averaged 6.0 points, 1.7 assists and 1.6 rebounds for the Bulls in nine games.\n\nRONDO THE RUNNER\n\nThe return of Rondo as a starter has ignited the Chicago running game, as the Bulls outscored Memphis 21-2 on the fast break.\n\nIn the two games since Rondo was re-inserted into the starting lineup, Chicago has outscored opponents 39-4 in transition.\n\nUP NEXT\n\nGrizzlies: At Atlanta on Thursday. The Hawks topped the Grizzlies 107-90 on Saturday in Memphis.\n\nBulls: At Washington on Friday against one of the Eastern Conference's hottest teams. The Wizards have won 25 of their last 33 games.",
  "source": "espn_api",
  "crawled_at": 1764995019.712715
}