{
  "game_id": "0022200627",
  "espn_id": "401468782",
  "date": "Jan 12, 2023",
  "matchup": "BKN vs. BOS",
  "headline": "Celtics pull away in 4th, beat Nets 109-98 for 5th straight",
  "body": "NEW YORK -- — No Kevin Durant on one side, no Jaylen Brown on the other.\n\n\r\n              When the fourth quarter arrived, Kyrie Irving seemed to take it upon himself to pick up the missing offense for the Nets.\n\n\r\n              The Celtics just relied on the balance and defense that have made them the top team in the NBA.\n\n\r\n              Jayson Tatum had 20 points and 11 rebounds, and Boston pulled away to beat Brooklyn 109-98 on Thursday night in the Nets' first game since losing Durant to a knee injury.\n\n\r\n              Marcus Smart added 16 points and 10 assists for the Celtics. Malcolm Brogdon also scored 16 points, teaming with fellow backup guard Payton Pritchard to lead the decisive spurt early in the fourth that sent the Celtics to their fifth straight victory.\n\n\r\n              Smart said the two reserves changed the game for the Celtics.\n\n\r\n              “They got us on a rhythm, they got our momentum back for us,” Smart said.\n\n\r\n              Brown had right adductor tightness, a night after scoring a season-high 41 points in a victory over New Orleans. Interim coach Joe Mazzulla said Brown could miss a week or more.\n\n\r\n              Derrick White, starting for Brown, scored 15 points, and Boston picked up the pace with the quickness Pritchard said the backups possess.\n\n\r\n              “So it makes us really dangerous and fast” he said. “I think that’s kind of what changed the game, is that speed.”\n\n\r\n              Irving scored 24 points for the Nets, who were right with the Celtics until getting outscored 12-2 to open the fourth. T.J Warren added 20 and Joe Harris, starting for Durant, had 18.\n\n\r\n              Irving was 3 for 10 in the fourth, taking more than half the team's shots after coach Jacque Vaughn said he didn't want the star guard feeling he needed to do more in Durant's absence. \n\n\r\n              “The first three quarters, felt like I had some good rhythmic shots going,” Irving said. “In the fourth, I just wanted to be aggressive.”\n\n\r\n              The Nets, who will be without Durant for at least two weeks after he sprained the medial collateral ligament in his left knee on Sunday, had won 18 of their previous 20 games and reached the midpoint of their schedule at 27-14.\n\n\r\n              Ben Simmons had a season-high 13 assists and grabbed nine rebounds, but took just three shots and was scoreless.\n\n\r\n              Brogdon and Pritchard each had two baskets early in the fourth, when the Nets missed six of their first seven shots. A lob to Luke Kornet capped the burst and made it 96-84 and the Nets couldn't really get close again.\n\n\r\n              The Celtics swept the Nets in the first round of last season's playoffs and have won the last five regular-season meetings, including a victory here last month that was the only defeat in Brooklyn's 12-1 December.\n\n\r\n              “You want to play the best team and the way they play, they’re very together defensively and offensively,” Simmons said. “They have some great individuals, but when you put it together they play team basketball.”\n\n\r\n              The Nets shot 51.2% — right at their league-leading average — in a well-played first half, but the Celtics rallied to a 60-57 lead when Tatum was fouled and made all three free throws with 9.8 seconds left. \n\n\r\n              TIP-INS\n\n\r\n              Celtics: Boston also played without another starter, Al Horford, because of low back stiffness. ... Kornet scored 11 points. \n\n\r\n              Nets: The Nets had their five-game home winning streak snapped. ... Brooklyn waived G Alondes Williams, who had been signed to a two-way contract and appeared in one game for the Nets. \n\n\r\n              ALL-STAR UPDATE\n\n\r\n              Tatum moved ahead of Philadelphia's Joel Embiid for the No. 3 spot in the Eastern Conference frontcourt in the latest update of fan balloting, putting the Nets and Celtics in position to have three starters in the All-Star Game. Durant is the leader among East frontcourt players and Irving is tops among guards. Brown is fourth in the backcourt.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: At Charlotte on Saturday.\n\n\r\n              Nets: Host Oklahoma City on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994876.781992
}