{
  "game_id": "0021800863",
  "espn_id": "401071536",
  "date": "Feb 13, 2019",
  "matchup": "PHX @ LAC",
  "headline": "Williams scores 30, Clippers send Suns to 15th straight loss",
  "body": "LOS ANGELES --  Lou Williams has a well-earned reputation of providing instant offense off the bench. The Los Angeles Clippers veteran guard did it at a historic level on Wednesday night.\n\nWilliams scored 30 points and had 10 assists in 22 minutes as the Clippers routed the Phoenix Suns 134-107. According to the Elias Sports Bureau, he is the first player in NBA history with at least 30 points and 10 assists in fewer than 23 minutes. It was also the 27th game of his 13-year career in which he has scored 30 or more off the bench, tying Ricky Pierce.\n\nWilliams -- who scored a season-high 45 in Monday's loss at Minnesota -- was just as quick out of Staples Center. He showered and left before the locker room was open to the media. One reason might have been was that it was the final game before the All-Star break.\n\n\"That's impressive but he's been doing that all year,\" Clippers guard Patrick Beverley said of Williams' night. \"It's been fun to watch. Sometimes you get caught up watching him sometimes.\"\n\nWilliams scored 11 points during the first quarter as the Clippers led 32-22 after going 12 of 21 from the field.\n\nIt was also a record night for the Suns, but for the wrong reason. They have lost 15 straight, tying a franchise mark set late last season (March 2 to April 1). The average losing margin during the streak is 16.3 points and six of the defeats have been by 20 points or more.\n\nPhoenix (11-48) has the worst record in the Western Conference and second-worst mark in the league.\n\n\"It's very discouraging. We show signs here and there but we have to put it all together,\" said guard Kelly Oubre Jr., who had a career-high 28 points. \"The only way is up. Right now, we're at the bottom.\"\n\nDanilo Gallinari scored 20 points and Montrezl Harrell 19 for the Clippers, who shot a season-high 59.5 percent from the floor. Los Angeles is still a work in progress after a series of moves before last week's trade deadline.\n\nLandry Shamet, who was acquired from Philadelphia on Feb. 6, got his first Clippers' start while Garrett Temple and Ivica Zubac, who came in separate deals on Feb. 7, also played over 20 minutes.\n\n\"We're getting there. We still don't have a lot of the offense in but we'll have two important practices next week before going back on the road,\" coach Doc Rivers said.\n\nThe Clippers led for most of the game and pushed the margin to double digits for the final 27 minutes. They led by as many as 31 during the third quarter.\n\nLos Angeles led 67-51 at halftime, and put the game out of reach during a two-minute stretch in the third quarter when it scored 13 straight points to lead 82-55 with 7:12 remaining. Gallinari fueled the run with three straight 3-pointers.\n\nThe Clippers go into the break 32-27 while holding the eighth and final seed in the Western Conference.\n\n\"I don't know what the number (of wins) is to get to the playoffs,\" Gallinari said. \"We just have to take every game and win as many as possible.\"\n\nTIP-INS\n\nSuns: Deandre Ayton added 20 points along with eight rebounds. Kokoskov said T.J. Warren is making progress from his right ankle injury and is likely to return after the All-Star break. The forward has missed the last 10 games.\n\nClippers: Zubac scored 16 points and had seven rebounds. Los Angeles had 100 points at the end of three quarters, marking the fifth time this season it had reached the century mark before the start of the fourth quarter.\n\nUP NEXT\n\nSuns: Travel to Cleveland on Thursday, Feb. 21 in their first game after the All-Star break.\n\nClippers: Travel to the Memphis Grizzlies on Friday, Feb. 22.\n\n---\n\nFollow Joe Reedy at www.twitter.com/joereedy\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995063.1308749
}