{
  "game_id": "0021800386",
  "espn_id": "401071067",
  "date": "Dec 08, 2018",
  "matchup": "MIA @ LAC",
  "headline": "Wade scores 25 points in his 1,000th game, Heat top Clippers",
  "body": "LOS ANGELES --  Dwyane Wade showed he still has his scoring touch.\n\nWade scored 25 points in his 1,000th career game, leading the Miami Heat to a 121-98 victory over the Los Angeles Clippers on Saturday night.\n\nThe veteran guard was 8 for 21 from the field and 5 for 10 from 3-point range en route to his second-highest scoring total of the season. It came nearly two weeks after he had a season-high 35 points at Toronto on Nov. 25, and one day after he had two points in a win over Phoenix.\n\n\"Every time I get an opportunity to so something like this, obviously its's great and special, but I just want to help this young team win,\" Wade said. \"When we get wins like this, wins in four of our last five, we're getting better.\"\n\nWade, who is retiring after this season, will play his final regular-season game in Los Angeles on Monday against the Los Angeles Lakers.\n\n\"He's still Dwyane Wade,\" the Clippers' Lou Williams said. \"Kobe (Bryant) had 60 points in his last game. Those guys have superpowers bro. Every once in a while, you like to see it on TV. You hate that it's (on) you sometimes.\"\n\nThe Heat were down to eight players on the second night of back-to-back games on the road, but still had plenty to beat the Clippers, who would have moved into sole possession of the top spot in the Western Conference with a victory.\n\nJustise Winslow scored 21 points and James Johnson added 18 points for the Heat, while Kelly Olynyk added 15 points and 10 rebounds. Derrick Jones Jr. had 11 rebounds.\n\nMiami was without guard Josh Richardson, who was a late scratch because of a shoulder impingement. They also lost guard Tyler Johnson early in the first with a left hip contusion. Johnson had scored eight points in the opening five minutes. Goran Dragic was out because of rest.\n\nThe Heat finished strong despite playing Friday night at Phoenix when they defeated the Suns. Miami has won four of its past five games and is 2-0 to start a season-high six-game road trip.\n\n\"When they show up for shootaround, you find out more guys aren't playing, but (these) guys look forward to the challenge instead of trying to make an excuse and get on to the next game,\" Heat head coach Erik Spoelstra said.\n\nThe Heat held a 91-90 lead late after three quarters before using a big fourth to pull away. From late in the third until just over three minutes remained, the Heat went on a 25-2 run to take control.\n\nClippers coach Doc Rivers was given two technical fouls in the midst of the Heat's run, getting tossed by official Ray Acosta with 7:17 to play.\n\n\"I've been in the league a long time; I was saying the call was awful,\" Rivers said. \"I don't know how you get a technical foul when the official is on the other side of the floor. But listen, we played poorly. (My technical) wasn't why we lost the game. We didn't play very well.\"\n\nTobias Harris scored 20 points and Williams added 18 for the Clippers, who were just 7 of 29 from 3-point range and 33 for 89 from the field. Danilo Gallinari had 12 points and 10 rebounds for the Clippers, who saw their NBA-best nine-game home win streak end. The Clippers entered having won 10 of their past 13 games.\n\nTIP-INS\n\nHeat: Along with outscoring the Clippers 30-8 in the final quarter, the Heat outrebounded the Clippers 19-7 in the fourth. ... Wade was 4 for 7 from 3-point range in the opening two quarters, tying his career high for made 3s before halftime.\n\nClippers: The Clippers made just two field goals in the fourth quarter and went 1 of 7 from 3-point range. ... The eight-point fourth quarter was their lowest scoring quarter since March 2003. ... The Clippers never led in their first home game in 10 days after going 2-2 on a four-game road trip. ... Luc Mbah a Moute, who has not played since Oct. 23 because of a knee injury, is likely two weeks away from playing according to Rivers.\n\nZONED IN\n\nThe Heat dusted off a zone defense to get the Clippers out of sorts and it worked in turning a close game into a rout. But the results from the zone were actually a pleasant surprise.\n\nThe Heat went to the floor-spacing defense primarily to preserve its energy.\n\n\"I think at first it was to rest guys or to preserve energy and eventually we saw they were struggling with it,\" Winslow said. \"We just kept going back to it. It was great. It killed two birds with one stone. Coming into the game, we really didn't know who was going to play and who wasn't going to play, but we always say, `It's all we got. It's all we need.\"\n\nUP NEXT\n\nHeat: At the Los Angeles Lakers on Monday.\n\nClippers: At Phoenix on Monday.\n\n---\n\nFor more AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995255.919373
}