{
  "game_id": "0021900307",
  "espn_id": "401160949",
  "date": "Dec 04, 2019",
  "matchup": "MIL @ DET",
  "headline": "Giannis Antetokounmpo leads Bucks past feisty Pistons in blowout win",
  "body": "DETROIT -- Giannis Antetokounmpo was ready to go toe-to-toe with Blake Griffin during a second-quarter flare-up between division rivals Milwaukee and Detroit.\nThe game was turning contentious. It wouldn't stay close for long.\n\"They're just a great defensive team and just play really physical,\" Antetokounmpo said. \"They want to be physical, they want to be dirty. They want you to get out of your game, and whenever you come in Detroit, you expect that.\"\nAntetokounmpo scored 35 points to lift the Bucks to their 13th consecutive victory, 127-103 over the Pistons on Wednesday night. The last time the Bucks had a longer winning streak than this was when they won 16 in a row spanning the end of the 1972-73 season and the beginning of 1973-74. They also had a 13-game run shortly after that 16-game streak ended.\nMilwaukee won all eight matchups with the Pistons last season -- four in the regular season and four in the first round of the playoffs. The Bucks also beat Detroit last month in their first meeting of 2019-20.\nThere were six technical fouls in this game, and there were words exchanged during a couple of mild altercations. The first involved Antetokounmpo and Griffin after those two collided around midcourt in the second quarter.\n\"There's going to be a lot of teams that are going to come out and try to be physical with me -- try to hit me, knock me down to the floor,\" Antetokounmpo said. \"I just got to keep my composure.\"\nIn the third quarter, Antetokounmpo fell to the floor after being fouled, and then Griffin stepped over him. Milwaukee's Khris Middleton came over to confront Griffin. Three technicals were assessed after that.\n\"At first, I was trying to ... talk back, let them know that this is more than basketball. We can stop playing basketball and we can fight,\" Antetokounmpo said. \"At the end of the day, my teammates want me in the game, my teammates want me to keep my head in the game and I was like, whatever. At this point, whatever.\"\nThat emotions were running high was no surprise to Pistons coach Dwane Casey.\n\"That's going to happen. In a competitive game, it's going to happen,\" Casey said. \"If anything, that should get you more focused, more riled up, more ready to play, more ready to compete and more ready to be physical and finish at the rim. All those things you have to do in a competitive game like that, a physical game like that.\"\nThe Bucks went on a 13-2 run late in the second quarter to lead 57-39, and although Detroit closed to within 11 at the half, the Pistons never made a major run during the final two quarters. Antetokounmpo scored 12 points in the third, and Milwaukee led 92-72 after three.\n\"I liked our fire in the second quarter. I liked our fire in general,\" Bucks coach Mike Budenholzer said. \"I think the guys, they're in a good place. They're playing good basketball. So we'll keep it going.\"\nAndre Drummond had 23 points and 14 rebounds for Detroit. Middleton had 17 points for the Bucks.\nTIP-INS\nBucks: Milwaukee had led start to finish in each of its previous two games, but the Bucks trailed 24-22 after the first quarter in this one.\nPistons: Detroit came into the game shooting a league-leading 39.9% from 3-point range. The Pistons went 11-of-36 (30.6%) on Wednesday. ... The Pistons were without G Luke Kennard (knee). G Reggie Jackson has played only two games this season because of a lumbar stress reaction. The team announced Tuesday that he'll be evaluated again in a couple of weeks.\nBLOWOUTS\nThis game probably became a bit more anticipated after the Pistons routed their previous two opponents by 34 and 33 points. But the Bucks had won their previous two by 41 and 44, and this one wasn't close, either.\n\"They're at the top of the league, really, for a reason,\" Griffin said. \"It was a good test for us, the second time we played them on the second night of a back-to-back. But we've just got to be better.\"\nUP NEXT\nBucks: Host the LA Clippers on Friday night.\nPistons: Host the Indiana Pacers on Friday night.\nInformation from The Associated Press was used in this report.",
  "source": "espn_api",
  "crawled_at": 1764996163.844159
}