{
  "game_id": "0022200883",
  "espn_id": "401469038",
  "date": "Feb 16, 2023",
  "matchup": "CHI vs. MIL",
  "headline": "Giannis sets assists mark, hurts wrist; Bucks beat Bulls",
  "body": "CHICAGO -- — Giannis Antetokounmpo stayed on the ground, grimacing in pain before heading to the locker room. A sprained wrist in the early going ended his night.\n\n\r\n              Not before he set yet another franchise record. \n\n\r\n              Antetokounmpo became Milwaukee’s career assists leader before getting injured, and the Bucks won their 12th straight, beating the Chicago Bulls 112-100 on Thursday night.\n\n\r\n              Brook Lopez scored a season-high 33 points. Jevon Carter had 22 against his hometown team, and Jrue Holiday added 15 points and nine assists.\n\n\r\n              The Bucks were never seriously threatened. But Antetokounmpo’s injury early in the second quarter cast a bit of a cloud over a team that otherwise has so much going for it heading into the All-Star break.\n\n\r\n              Coach Mike Budenholzer said initial reports were “hopeful\" and the X-ray was “clean.” \n\n\r\n              “We'll just see how he feels tomorrow, see how he feels the next few days and continue to evaluate it,” Budenholzer said. \n\n\r\n              He had “no idea” if Antetokounmpo would travel to Salt Lake City for the All-Star Game.\n\n\r\n              The two-time MVP was hurt trying to block a finger roll attempt by Chicago’s Coby White after the guard drove past him. He jammed his wrist when he reached out — perhaps to soften the blow — as he crashed into the padded stanchion. He continued to flex his hand and got subbed out a few seconds later before heading to the locker room.\n\n\r\n              “He's a guy that's attacking the basket all the time,” Budenholzer said. “He's fearless. He takes a lot of falls so you kind of learn to just expect him to always just bounce back up, and that's what we're hoping for from this one.”\n\n\r\n              Antetokounmpo finished with a season-low two points and three assists, giving him 3,274 over 10 seasons to break Paul Pressey’s record of 3,272 from 1982 to 1990. He also had seven rebounds.\n\n\r\n              SETTING THE RECORD\n\n\r\n              Antetokounmpo matched the assists mark when he fed Lopez for a 3-pointer two minutes into the game and broke it when he passed to Carter for another 3 that bumped Milwaukee’s lead to 19-10 in the first quarter. He also is the Bucks’ career leader in blocks, triple-doubles, free throws made, free throws attempted and minutes.\n\n\r\n              “It's greatness, right?” Holiday said. “Especially to do it with one franchise, to be here through the ups and the downs, to see where he started and where he is now. I'm so happy for him.”\n\n\r\n              Lopez made three 3-pointers. Carter hit four from beyond the arc, and the Bucks beat Chicago for the first time in three games this season. \n\n\r\n              SLIDE CONTINUES\n\n\r\n              The Bulls lost their sixth in a row, their worst skid since dropping six straight in the 2020-21 season. They also fell seven games under .500 at 26-33, not what they envisioned after making the playoffs a year ago.\n\n\r\n              Nikola Vucevic had 22 points and 16 rebounds. Zach LaVine scored 18, and Patrick Williams had 16 points.\n\n\r\n              “We're not just throwing in the towel,” LaVine said. “I don't think we have the type of team or personnel to do that. Losing hurts.”\n\n\r\n              SIDELINED STARS\n\n\r\n              Both teams were missing stars, with Milwaukee’s Khris Middleton managing a sore right knee that has kept him out for a big portion of the season and Chicago’s DeMar DeRozan sidelined for the second time in as many nights because of a strained right quadriceps.\n\n\r\n              TIP-INS\n\n\r\n              Bucks: Though Middleton's absence was not expected, coach Mike Budenholzer said the three-time All-Star did not experience a setback against Boston on Tuesday. Middleton had 16 points and 11 rebounds in 25 minutes against the Celtics. “I think we're overall not concerned, but we'll see how he does over the break and just continue to work with him and make sure he's in a good place when he plays,” Budenholzer said. \n\n\r\n              Bulls: The Bulls said DeRozan is expected to play in the All-Star Game on Sunday. ... G Ayo Dosunmu was selected to replace injured Houston Rockets guard Jalen Green on fellow former Illinois star Deron Williams' team in Friday's Rising Stars game. The Chicago product played in the game as a rookie last year and was averaging 9.6 points and 2.9 assists in his second season after being drafted in the second round. Dosunmu called it a “blessing” to be selected again and said Williams was “a big mentor” for him in the draft process.\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Miami on Feb. 24.\n\n\r\n              Bulls: Host Brooklyn on Feb. 24.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994287.676289
}