{
  "game_id": "0022401201",
  "espn_id": "401734902",
  "date": "Dec 10, 2024",
  "matchup": "ORL @ MIL",
  "headline": "Bucks beat Magic 114-109 to return to the NBA Cup semifinals in Las Vegas",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 37 points, Damian Lillard had nine of his 28 in the final minute and the Milwaukee Bucks returned to the NBA Cup semifinals in Las Vegas by beating the Orlando Magic 114-109 on Tuesday night.\n\n\r\n              Milwaukee reached the semifinals of the in-season tournament in Las Vegas last December and will be the only returning team in Year 2. They will play Saturday against the winner of Wednesday’s quarterfinal between the New York Knicks and Atlanta Hawks.\n\n\r\n              Jalen Suggs led a short-handed Orlando team with 32 points but missed a potential go-ahead 3-pointer with 12 seconds left. Lillard was fouled and sank two free throws with 9.1 seconds remaining and Suggs missed a potential tying 3.\n\n\r\n              Antetokounmpo then made both free throws with 5 seconds left and the Bucks held on.\n\n\r\n              The Magic were missing forwards Paolo Banchero (torn right oblique), Jonathan Isaac (right hamstring strain) and Franz Wagner, who suffered a torn right oblique on Friday against Philadelphia; along with guard Gary Harris (left hamstring strain).\n\n\r\n              Takeaways\r\n              Magic: Orlando’s bench scored 28 points in the first half, including 13 by Moritz Wagner and 10 from Anthony Black. But Wagner did not score in the second half.\n\n\r\n              Bucks: Bobby Portis helped the Bucks erase an early 11-point deficit as he hit his first seven shots and scored 16 points in the first half. He finished with 22 points and 10 rebounds.\n\n\r\n              Key moment\r\n              Bucks forward Khris Middleton registered three consecutive assists — the first two on passes to Antetokounmpo and the third to set up a 3-pointer by Gary Trent Jr — as the Bucks took a 78-70 lead as part of an 11-0 Milwaukee run. Middleton did not score but had eight assists.\n\n\r\n              Key stat\r\n              Antetokounmpo extended his streak to 22 straight games with 20 or more points on 50% shooting, the longest streak to open a season in league history and the third-longest at any point in a season (Shaquille O’Neal and Zion Williamson, both 25 games). Antetokounmpo was 15 of 24 from the field.\n\n\r\n              Up next\r\n              The Magic will play New York or Atlanta on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764997563.95959
}