{
  "game_id": "0021800317",
  "espn_id": "401070998",
  "date": "Nov 29, 2018",
  "matchup": "LAL vs. IND",
  "headline": "LeBron carries Lakers down stretch of 104-96 win over Pacers",
  "body": "LOS ANGELES --  LeBron James' team was in danger of blowing a close game Thursday night until he seized control and carried his teammates to victory.\n\nThe Los Angeles Lakers are still getting used to this enormous advantage, and they love it.\n\nThe Indiana Pacers? They've seen this plenty of times over the years, and they're still not crazy about it.\n\nJames scored 12 of his 38 points in the final five minutes, and the Lakers rebounded from their first back-to-back losses in a month with a 104-96 victory over the Pacers.\n\nBrandon Ingram scored 14 points and Josh Hart added 13, but the Lakers wasted an early 24-point lead before James carried them to their 10th win in 14 games.\n\n\"We've got the best player ever to put on a jersey, so that helps us out a lot,\" Hart said.\n\nJames added nine rebounds and seven assists in his first game since scoring a season-low 14 points in the Lakers' loss at Denver.\n\nThe Lakers are just 21 games into James' first season, and he is still adjusting his game to his new team's needs. He's playing the fewest minutes per game in his career, and he is learning to delegate responsibility for ball-handling and big shots.\n\nBut when the Lakers need the four-time league MVP to put them on his shoulders, the 16-year veteran can do that, too.\n\n\"That's the challenge I've been kind of battling with since the season started,\" James said. \"How much do I defer and allow some of our young guys to figure out, and how much do I try to take over games? I think tonight was one of those instances where they looked at me and wanted me to close the game, and I just tried to make plays.\"\n\nIndiana trimmed Los Angeles' lead to 89-88 on Domantas Sabonis' jumper with 4:59 left, but James replied with a 3-pointer and a three-point play on consecutive possessions to start a 10-0 Lakers run. He added a 22-foot jumper with 2:21 to play and a 19-footer on the next possession, calmly sealing it.\n\n\"I figured I wouldn't have the ball in my hands as much, coming into the season and knowing the multiple ball-handlers that we have on this team,\" James said. \"Those guys have the ability to make plays as well. But I'm available anytime we need a play to be made. It's a challenge for me, and it's an adjustment for me, but whatever it takes to help our ballclub be as great as it can be toward the end of the season, and at the same time getting better every day.\"\n\nSabonis had 20 points and 15 rebounds as the Pacers lost for the first time in three stops on their four-game West Coast trip.\n\nVictor Oladipo sat out his sixth straight game for Indiana with a sore right knee, but the Lakers still needed James and some strong defense to close it out. The Pacers missed five of their six 3-point attempts in the fourth quarter.\n\n\"It's a challenge to match up and defend those guys when LeBron is playing five different positions,\" Indiana coach Nate McMillan said. \"Late in the game, he got aggressive and looked to attack to make something happen. He hit some shots and made some plays whenever the game got close.\"\n\nJames' Cleveland Cavaliers eliminated the Pacers from the playoffs in each of the past two seasons, going to seven games in the opening round last year. James' Miami Heat also sent Indiana home in three consecutive postseasons from 2012-14.\n\n\"We had this game,\" said Darren Collison, who scored nine points. \"We were up. We did some good things, and we didn't do some good things. We know what we did wrong collectively.\"\n\nTIP-INS\n\nPacers: Bojan Bogdanovic had 14 points for the Pacers, and Thaddeus Young added 11. ... Indiana fell short of its eighth road victory already this season. Only Toronto and Utah have more.\n\nLakers: Lonzo Ball had two points and eight rebounds in 34 minutes while playing through an ankle injury. Ball sprained his ankle in LA's loss at Denver on Tuesday, but made good on his vow to play through it. ... Lance Stephenson played five scoreless minutes. He played in all 82 games last season for the Pacers in his second stint with the club, averaging 9.2 points. ... Kentavious Caldwell-Pope hit three 3-pointers and scored 11 points.\n\nCONTRASTING QUARTERS\n\nThe Lakers scored the game's first 13 points and jumped to a 23-point lead while rolling to a 38-point first quarter. Yet LA led only 56-50 at halftime after Sabonis scored 14 during the Pacers' 35-point second quarter.\n\nAWAITING OLADIPO\n\nOladipo scrimmaged in half-court work before the game, but wasn't quite ready to play. The Indiana star could go through a full practice Friday. \"We can't worry about that,\" McMillan said when asked if the Pacers miss their top scorer. \"We've got to go to work with the guys that are on the court.\"\n\nUP NEXT\n\nPacers: At Sacramento on Saturday night.\n\nLakers: Host Dallas on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995023.98826
}