{
  "game_id": "0021800267",
  "espn_id": "401070948",
  "date": "Nov 23, 2018",
  "matchup": "DET vs. HOU",
  "headline": "Jackson scores 22, leads Pistons past Rockets 116-111 in OT",
  "body": "DETROIT --  Detroit has a new Big Three: Andre Drummond, Blake Griffin and Reggie Jackson.\n\nThe Pistons' trio played major roles in Detroit's 116-111 overtime victory over the Houston Rockets on Friday night as they combined for 73 points and 33 rebounds.\n\nThey also got some help from little-known rookie Bruce Brown.\n\nTwo days earlier in Houston, the Rockets beat the Pistons 126-124 behind 43 points from James Harden. This time, though, Pistons coach Dwane Casey put Brown on Harden for most of the fourth quarter and overtime.\n\n\"We've always known Bruce could play defense,\" Casey said. \"My experience against James is to find someone to pick him up full court and make him work. Bruce took that opportunity.\"\n\nBrown, getting plenty of help, stripped Harden on a key late-game possession and held him scoreless in overtime.\n\n\"When we played Boston, he guarded Kyrie, (Marcus) Smart, (Terry) Rozier, (Gordon) Hayward and (Marcus) Morris in the same game,\" Griffin said. \"Not many other rookies can do that.\"\n\nBrown wasn't expecting the assignment, but was happy to give it a shot.\n\n\"It's a big challenge, but he's a great scorer,\" he said. \"Honestly, I didn't go into tonight expecting to touch the floor, but I knew the game plan and I knew his tendencies.\"\n\nBrown did enough for Detroit's three offensive stars to put the game away.\n\nJackson scored 19 of his 22 points after the third quarter, while Griffin had 13, including a key 3-pointer late in regulation and two overtime dunks.\n\nGriffin scored 28 points and Drummond had 23 points and 20 rebounds for Detroit, which has won five of seven.\n\nHarden scored 33 points for the Rockets, who had won five straight. Clint Capela finished with 29 points and 21 rebounds.\n\nThe Rockets led 103-101 early in overtime, but the Pistons scored seven straight points, including two dunks by Griffin. Detroit made all five field goal attempts in overtime, and went 7-for-9 from the line.\n\n\"They hit some big shots,\" said Chris Paul, who finished with 20 points. \"We had some mistakes, but we played some good defense at times. Good offense beats good defense any day.\"\n\nJackson hit five free throws in the fourth quarter and six more in overtime.\n\n\"It seemed like we had them stopped on every possession and then someone would get free and we'd foul them for an and-one,\" Houston coach Mike D'Antoni said.\n\nHouston had a chance to win the game in regulation.\n\nTwo free throws by Jackson tied the game at 93 with 1:11 to play, but he fouled Harden at the other end. Harden made the first free throw, then grabbed the offensive rebound of his missed second attempt.\n\nBrown, though, stole the ball and forced Harden into a foul to prevent a layup with 37.7 seconds to play. The rookie made both free throws to put Detroit ahead 95-94, but Harden's jumper put Houston back in front with 22 seconds to go.\n\nGriffin appeared to win the game with a 3-pointer with 2.6 seconds left, but Eric Gordon drove the baseline for a tying layup with 0.1 second left in regulation.\n\n\"We should have won the game in regulation,\" D'Antoni said. \"We had our best 3-point defenders out there and we forced Blake into a really tough shot. He just made a great, great play.\"\n\nCapela and Harden combined for 38 points in the first half, but Drummond and Griffin's 29 points and 20 rebounds were enough to give the Pistons a 61-56 lead at the break.\n\nDetroit started the second half with an 11-2 run for a 72-58 advantage, but couldn't keep control. The Rockets outscored the Pistons 21-6 through the rest of the third quarter and took a 79-78 lead on Chris Paul's 3-pointer with 1.1 seconds left.\n\nThe Pistons continued to struggle offensively in the fourth quarter, scoring one point in the first five minutes. The Rockets built their advantage to 85-79, but Griffin and Jackson were able to keep the Pistons in the game.\n\nTIP INS\n\nRockets: Houston has lost four of its last five visits to Detroit. . The loss was the Rockets' first in six games against the Eastern Conference this season.\n\nPistons: Detroit made seven 3-pointers, ending a franchise-record streak of seven straight games with at least 10. . DeMarcus Cousins is second in the NBA with 15 20-point, 20-rebound games since Drummond entered the league.\n\nUP NEXT\n\nRockets: At Cleveland on Saturday.\n\nPistons: Host Phoenix on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994712.463673
}