{
  "game_id": "0021800256",
  "espn_id": "401070937",
  "date": "Nov 21, 2018",
  "matchup": "CLE vs. LAL",
  "headline": "LeBron welcomed back as hero in return to Cleveland",
  "body": "CLEVELAND --  Once the video tribute ended, a simple sentiment filled the giant scoreboard. Against a black backdrop, giant white letters delivered the heartfelt message.\n\nCleveland wanted to say something.\n\n\"THANK YOU, LeBRON,\" it said.\n\nEight years after he was treated like a thug, LeBron James was welcomed back properly.\n\nBack on the court where he performed for 11 seasons, and under the title banner he helped raise, James returned to Cleveland and rallied the Los Angeles Lakers to a 109-105 win on Wednesday night over the Cavaliers, who played their best game of the season against their former teammate but couldn't stop him when it mattered most.\n\nJames finished with 32 points, 14 rebounds and seven assists. He also scored or assisted on 11 straight points as the Lakers overcame a 99-91 deficit in the fourth quarter.\n\nBut basketball took a backseat to James' homecoming, which was so different than his return in 2010, when betrayed Cleveland fans unleashed their fury on him.\n\nThere were no profane chants this time. No derogatory signs. No venom.\n\nOnly love, and James felt it.\n\n\"From the time we landed yesterday, it just felt a different way,\" he said. \"I'm a different person. We're all different from eight years ago, both good and bad. But more importantly, this experience has been great. So it's all about growth and we all have grown from that moment eight years ago. So I kind of leave the past in the past and always focus on the present and see what happens in the future.\"\n\nThe Cavs, who came in a league-worst 2-13, gave James and the Lakers all they could handle. And even after giving up an eight-point lead, they had a chance to tie late, but Kyle Korver missed a wide-open 3-pointer with 17 seconds left and Kentavious Caldwell-Pope made four free throws in the final 15 to seal it for Los Angeles.\n\nJordan Clarkson had 20 points and Tristan Thompson 14 and 15 rebounds for Cleveland.\n\nFrom the moment he stepped back onto Quicken Loans Arena floor, James was treated like a returning champion.\n\nOn the night before Thanksgiving, Cleveland said thanks to the Northeast Ohio son, the one who ended the city's 52-year championship drought.\n\n\"A hero has come back,\" Cavs coach Larry Drew said before tip-off.\n\nJames was the last Lakers player introduced before the game, presented with a line familiar to all Cavs fans: \"A 6-foot-8 forward from St. Vincent-St. Mary High School,\" said arena announcer Sean Peebles. \"Welcome home! LeBron James.\"\n\nThe crowd roared and stood as James walked out and huddled with his new teammates, who must have wondered what was in store for them.\n\nBut unlike that ugly night of Dec. 2, 2010, when James returned with the Miami Heat and was subjected to a toxic, charged atmosphere of hatred unlike anything seen before or since, this was a night for celebration -- and maybe more closure.\n\nJames has moved on.\n\nCleveland, too.\n\nWith 8:09 left in the first quarter, James was saluted by the Cavs with a moving video tribute during a timeout. Images of James' playing days with Cleveland -- highlighted by the Cavs' historic comeback to win the 2016 title -- were shown along with video clips of his impact on the community, including his opening of the I Promise School in his hometown of Akron.\n\nJames was touched by the presentation. He bit his lower lip while walking back onto court and pointed to all corners of the building in appreciation, his chance to reconnect with a fan base he'll always share a special, if not complicated, relationship.\n\n\"I appreciate these fans, just as much as they appreciate me,\" he said. \"Every single night we stepped on the floor, they always showed their appreciation to not only myself but to my teammates over these 11 years, especially the last four years -those championship runs that we were making. So that was just my salute to them for them appreciating what I was able to accomplish with my teammates and coaches along those four years.\"\n\nTIP-INS\n\nLakers: Coach Luke Walton is impressed with James' knack for blocking out external distractions. \"The great ones have that ability,\" he said. \"When they're on the basketball court nothing else matters, other than what they're trying to do. Their focus level seems to somehow get higher with the louder the noise gets. I don't know how. I don't know why.\"\n\nCavaliers: Did not commit a turnover in the first half. ... Starting G George Hill missed his sixth straight game with a sprained right shoulder sustained on Nov. 4. Hill has ramped up his on-court workouts in recent days and could be back soon. ... Drew said he was unaware of Smith's comments accusing the Cavs of \"tanking.\" Drew believes his team is playing hard, and promised to nothing but coach his team to win. \"To coach to lose, I don't understand that, I don't know how to do that,\" he said. \"I don't know how anybody can do that. That's something I would never, ever do.\"\n\nSCHOOL DAY\n\nEarlier in the day, James made a surprise visit to his I Promise School, a refurbished elementary for at-risk kids he founded and plans to expand.\n\n\"It was grandparent's day,\" he said. \"We kept it that way, we didn't tell none of the kids until I actually walked into all six of the classrooms individually, spent a good amount of time with those classrooms, my third and fourth graders. It was great. It was a good way to go into Thanksgiving, all of being thankful, the great lives they've had.\"\n\nHOME COOKING\n\nFollowing the game, the Lakers feasted on hamburgers, french fries and shakes from Swenson's, an Akron drive-in restaurant favored by James.\n\nSitting at his locker, James sipped on a banana shake and smiled.\n\n\"I'm good,\" he said. \"I got my hometown food.\"\n\nUP NEXT\n\nLakers: Host Utah on Friday.\n\nCavaliers: At Philadelphia on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994799.6589959
}