{
  "game_id": "0022400184",
  "espn_id": "401704750",
  "date": "Nov 08, 2024",
  "matchup": "CHA vs. IND",
  "headline": "Ball scores 31 points, Miller has 29 to help the Hornets beat the Pacers, 103-83",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball scored 17 of his 31 points in the fourth quarter, Brandon Miller tied a career high with seven 3-pointers and had 29 points and the Charlotte Hornets overcame a 13-point deficit to beat the Indiana Pacers 103-83 on Friday night.\n\n\r\n              Cody Martin added 15 points and Tre Mann had 14 off the bench. The Hornets have won two straight to improve to 4-5.\n\n\r\n              Pascal Siakam scored 27 points for Indiana (4-5). Benedict Mathurin added 22.\n\n\r\n              With Charlotte down by 13, the cold-shooting Ball exited the game with about six minutes remaining in the third quarter. Miller took over, putting the Hornets on his back. The second-year forward made five 3s and scored 17 points as Charlotte finished the quarter on a 23-2 run.\n\n\r\n              At one point, Miller nearly turned the ball over, tracked it down and simply flipped it up to beat the shot clock for a 3, bringing the crowd to its feet.\n\n\r\n              Takeaways\r\n              Pacers: Indiana, playing without Aaron Nesmith due to an ankle injury, simply fell apart defensively in the second half and holding the Hornets to 44 points in the first half.\n\n\r\n              Hornets: As if the Hornets need any more injuries, forward Miles Bridges sat out with a bone bruise in his knee. Charlotte is already without centers Mark Williams and Nick Richards. Rookie Tidjane Salaun started for Bridges, becoming the second-youngest player in franchise history to start behind only Michael Kidd-Gilchrist.\n\n\r\n              Key moment \r\n              Ball was 5 of 20 entering the fourth quarter, but went 5 of 9 from the field with three 3s down the stretch.\n\n\r\n              Key stat\r\n              The Hornets were 11 of 24 from beyond the arc in the second half.\n\n\r\n              Up next \r\n              The Pacers host New York on Sunday. The Hornets are at Philadelphia on Sunday night.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997468.612492
}