{
  "game_id": "401809982",
  "espn_id": "401809982",
  "date": "Oct 28, 2025",
  "matchup": "GS vs LAC",
  "headline": "Butler, Curry provide 1-2 punch as Warriors beat Clippers 98-79 to stay unbeaten at home",
  "body": "SAN FRANCISCO -- — Jimmy Butler had 21 points, five rebounds and five assists, Stephen Curry added 19 points and eight assists, and the Golden State Warriors beat the Los Angeles Clippers 98-79 on Tuesday night.\n\n\r\n              Curry shot 7 for 15 a night after four Warriors players scored 20 or more points to beat Memphis — but it marked just the sixth time in Curry’s 17 seasons he wasn’t one of them.\n\n\r\n              Butler and Moses Moody each hit 3-pointers late in the third quarter as the Warriors used a 10-2 burst over the final 2:07 to go ahead 78-63 starting the fourth.\n\n\r\n              Brandin Podziemski followed up a 23-point performance against the Grizzlies with 12 points, while Quinten Post had 12 points on 4 3-pointers and eight rebounds. \n\n\r\n              James Harden scored all 20 of his points by halftime while Kawhi Leonard added 18 points and five rebounds in a game featuring a 13-point second quarter by Golden State followed by the Clippers' 14-point third.\n\n\r\n              Harden's 3 with 41 seconds left in the first half gave Los Angeles its first lead heading into halftime ahead 49-46 after ending the second quarter on a 24-6 run.\n\n\r\n              Ivica Zubac contributed 14 points and a season-best 13 rebounds for the cold-shooting Clippers, who went 6 for 33 from long range and 30 of 82 overall (36.6%).\n\n\r\n              Los Angeles had won the last seven in the series and three in a row at Chase Center, where the Warriors improved to 3-0 so far.\n\n\r\n              Al Horford was back for the Warriors against the tall, physical Clippers team featuring the 7-foot Zubac after sitting out the front end of the back-to-back to manage a left toe injury.\n\n\r\n              The Clippers began 6 for 20 and 1 for 8 on 3s to fall behind 27-14 on a night they missed Bradley Beal for a second consecutive game because of back soreness. \n\n\r\n              Up next\r\n              Clippers: Host New Orleans on Friday night.\n\n\r\n              Warriors: At Milwaukee on Thursday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042521.0526028
}