{
  "game_id": "0022400709",
  "espn_id": "401705275",
  "date": "Feb 03, 2025",
  "matchup": "POR vs. PHX",
  "headline": "Ayton helps the Trail Blazers beat the Suns 121-119 for 4th straight win",
  "body": "PORTLAND, Ore. -- — Deandre Ayton had 25 points and 20 rebounds, and the Portland Trail Blazers edged the Phoenix Suns 121-119 in overtime on Monday night for their fourth consecutive victory.\n\n\r\n              Deni Avdija scored 24 points for Portland, which also beat Phoenix 127-108 on Saturday night. Toumani Camara made five 3-pointers and scored 17 points.\n\n\r\n              The Blazers had a 120-117 lead when Avdija fouled Devin Booker on a 3-pointer with 4.4 seconds left. Booker made the first two free throws but missed the third, which Ayton grabbed for his 20th rebound.\n\n\r\n              Anfernee Simons had 13 points and 10 assists for Portland.\n\n\r\n              Booker scored 34 points while becoming the franchise's career scoring leader. Kevin Durant had 27 points for the Suns, and Bradley Beal finished with 25.\n\n\r\n              A layup by Beal cut the Blazers' lead to 116-115 with 32.6 seconds left in overtime. On Portland’s next possession, Ayton got two offensive rebounds and made two foul shots with 7.8 seconds left. Ayton was fouled again with 5.5 seconds left and made both free throws again.\n\n\r\n              Royce O’Neale’s 3-pointer for the Suns with 1.7 seconds left in regulation tied it at 107.\n\n\r\n              Takeaways\r\n              Suns: Booker broke Walter Davis' Suns scoring record of 15,666 points. “The city loves Devin,” coach Mike Budenholzer said of Booker’s connection to the franchise and region.\n\n\r\n              Blazers: Winners of eight of nine overall, the Blazers are playing some of their best basketball in several seasons.\n\n\r\n              Key moment\r\n              Ayton went five of six from the line in the final seven seconds of overtime.\n\n\r\n              Key stat\r\n              Portland outscored the Suns 21-12 in fast-break points.\n\n\r\n              Up next\r\n              The Suns visit the Oklahoma City Thunder on Wednesday. The Trail Blazers host the Indiana Pacers on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998174.846786
}