{
  "game_id": "0022300949",
  "espn_id": "401585577",
  "date": "Mar 13, 2024",
  "matchup": "MIA vs. DEN",
  "headline": "Denver beats Miami 100-88 in an NBA Finals rematch and moves atop the Western Conference",
  "body": "MIAMI -- — After four months of looking up at others in the Western Conference, Denver finally is alone atop the standings.\n\n\r\n              Michael Porter Jr. scored 25 points, Aaron Gordon added 16 and the reigning NBA champion Nuggets took sole possession of first place in the West standings with a 100-88 win over the sliding Miami Heat in a finals rematch on Wednesday night.\n\n\r\n              “If we can get (the No. 1 seed), sure, we’re going to take it,\" Nuggets coach Michael Malone said. \"And we’re not going to shy away from that. You know, it was very effective for us last year, having home-court throughout the entirety of the playoffs.”\n\n\r\n              Jamal Murray scored 14 points and Nikola Jokic finished with 12 points, 14 rebounds and six assists for the Nuggets (46-20), who moved a half-game ahead of Oklahoma City (45-20) and a full game up on Minnesota (45-21) in the West race.\n\n\r\n              Denver is an NBA-best 10-1 since the All-Star break, and the Nuggets are 32-9 when their go-to starting five — Porter Jr., Gordon, Murray, Jokic and Kentavious Caldwell-Pope — are together in the lineup. The Nuggets hadn't ended a day alone atop the West since mid-November.\n\n\r\n              “When they want to put on the jets, they've been able to leave teams behind in the dust,” Heat coach Erik Spoelstra said.\n\n\r\n              Bam Adebayo scored 17 points and grabbed 13 rebounds for Miami. Jimmy Butler scored 15, Terry Rozier had 14 and Duncan Robinson added 11 for the Heat (35-30), who are now 2 1/2 games behind Orlando — a winner over Brooklyn on Wednesday — in the Southeast Division race.\n\n\r\n              The Heat have lost four straight and remain No. 8 in the Eastern Conference, playing again Wednesday without Tyler Herro (foot) and Kevin Love (heel).\n\n\r\n              Denver is 12-1 in its last 13 games against the Heat, including last season's NBA Finals, and has won seven consecutive games on Miami's home floor.\n\n\r\n              Reggie Jackson made three jumpers in a span of three possessions late in the fourth for Denver, his seven-point flurry putting the Nuggets up by 10 with 3:38 left. That was more than enough; Denver held Miami to four points in the final 4:34 and outscored the Heat 28-17 in the fourth.\n\n\r\n              “They were playing off me, trying to guard the best player in the world — Jokic,” Jackson said.\n\n\r\n              Added Spoelstra: “They had their burst, and that was basically the game.”\n\n\r\n              Denver used a 15-0 run in the first quarter to build a double-digit lead, one that eventually reached 13 points in the opening period. The Nuggets led for all but 2:48 of the first half, but the Heat never trailed by more than eight in the second quarter.\n\n\r\n              And in the third, Miami finally — but briefly — reclaimed the lead. Former Nuggets center Thomas Bryant scored for a four-point lead late in the third, matching Miami's biggest edge of the night, but Denver responded with a 10-2 run and stayed ahead the rest of the way.\n\n\r\n              “Something we always talk about is that your fourth quarter has to be your best quarter,” Malone said. “It's closing time.”\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Visit San Antonio on Friday night.\n\n\r\n              Heat: Visit Detroit on Friday night, then again Sunday afternoon.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995336.003604
}