{
  "game_id": "0022000328",
  "espn_id": "401267488",
  "date": "Feb 03, 2021",
  "matchup": "LAC @ CLE",
  "headline": "George scores 36, Clippers use 3-pointers to drill Cavaliers",
  "body": "CLEVELAND -- — Paul George missed the first two games of the Los Angeles Clippers' long road trip. He barely missed anything in the finale.\n\n\r\n                    George drained 8 of 9 3-pointers and scored 36 points, Kawhi Leonard added 24 and Los Angeles found enough energy on tired legs to end a six-game road swing with a 121-99 victory over the Cleveland Cavaliers on Wednesday night.\n\n\r\n                    Just 24 hours after dropping a tight game in Brooklyn that had an NBA Finals vibe, the Clippers bounced back by making 20 3-pointers to avoid losing two straight for the first time this season. They are the only team in the league not to drop two in a row.\n\n\r\n                    George said the 124-120 loss to the Nets — he scored 26, but missed 13 shots and took just one free throw — inspired his performance against the Cavs.\n\n\r\n                    “I had some good looks, and I just told myself that if I got the same open shots, I would knock them down,” George said.\n\n\r\n                    The Clippers started the trip down two All-Stars as both George and Leonard were sidelined by COVID-19 protocols. They sat out games in Atlanta and Miami, but now that they're back, a team with title aspirations is gaining confidence.\n\n\r\n                    “We're getting better,” coach Tyronn Lue said after his team's 4-2 trip. “We've got some things we've still got to get better at. We've still got a long way to go.”\n\n\r\n                    George went 13 of 20 from the field and Los Angeles made 20 of 34 on 3s, outscoring Cleveland 60-12 from behind the arc. \n\n\r\n                    George banked in a 32-footer at the horn to end the third, capping his 16-point quarter that gave the Clippers a 14-point cushion heading into the fourth.\n\n\r\n                    “I didn’t know he was 8 of 9 from 3,” Lue said. “But I knew he was shooting the rock.”\n\n\r\n                    The Cavs were hanging around and only down 10 when the Clippers went on a 12-0 run that featured 3s by George and Lou Williams that ended any hopes of a Cleveland comeback.\n\n\r\n                    Collin Sexton scored 27 and Darius Garland 23 for the Cavaliers, who played well in spurts but couldn't stop the Clippers' 3-point barrage.\n\n\r\n                    “Paul George had more 3s than our team,” Garland said. “I don't think we're going to win many games shooting just 2s.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Ivica Zubac had 16 rebounds. ... Dropped their first five 3-pointers and went 6 of 9 from deep in the first quarter. ... Los Angeles went 4-2 on the trip is 11-2 in its last 13 overall. ... Lue has known Sexton for years and is not surprised by the guard's quick rise to stardom. “He's a hard worker,” said Lue, who was fired six games into Sexton's rookie season. “When I was here we had to kick him out of the gym because he was doing too much.”\n\n\r\n                    Cavaliers: F Larry Nance Jr. missed his fourth game with a sprained right wrist. Nance came back after sitting out two games, but aggravated the injury. ... F Kevin Love is getting closer to playing after being sidelined for months with a severe right calf strain. He's finally doing individual basketball activities. The five-time All-Star has played just 46 minutes this season. “He was moving around and looks good,” coach J.B. Bickerstaff said. “He says he feels good. Obviously, we’re going to be intelligent about how we bring him back.\" \n\n\r\n                    TY GAME\n\n\r\n                    The final stop on the Clippers’ trip was also a special one for coach Lue, who guided the Cavaliers to the NBA title in 2016. It was his first visit to Cleveland as a head coach, and he received a nice ovation when he was introduced before the game.\n\n\r\n                    “What we did will always be in my heart,” Lue said, adding he stays in touch with several players from that team. “It was just a magical year, so that bond will never be broken.”\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Head home to face the Boston Celtics on Friday.\n\n\r\n                    Cavaliers: Begin a rugged stretch against winning teams by playing the first of back-to-back home games against Milwaukee on Friday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997695.000016
}