{
  "game_id": "0022400083",
  "espn_id": "401704649",
  "date": "Oct 25, 2024",
  "matchup": "CHI @ MIL",
  "headline": "Coby White scores 35, Bulls roll past Bucks 133-122 to get in the win column",
  "body": "MILWAUKEE -- — Coby White scored 35 points, and the hot-shooting Chicago Bulls spoiled Milwaukee’s home opener with a 133-122 victory over the Bucks on Friday.\n\n\r\n              Zach LaVine added 25 points, Nikola Vucevic had 22 and Josh Giddey scored 17 for the Bulls, who shot 21 of 47 from 3-point range.\n\n\r\n              Giannis Antetokounmpo led the Bucks with 38 points, 11 rebounds and five assists. Damian Lillard had 28 points, but only went 3 of 12 from deep.\n\n\r\n              After the first three minutes of the third quarter featured five lead changes, the Bulls broke a 72-all tie and pulled ahead for good by scoring seven straight points.\n\n\r\n              Takeaways\r\n              Bulls: White was just two points off his career high of 37 points he scored against Sacramento last season. ... Lonzo Ball didn't play for the Bulls, two days after participating in his first regular-season game since Jan. 14, 2022, as he comes back from multiple knee surgeries. He will be available for their home opener Saturday.\n\n\r\n              Bucks: Two nights after they looked sharp in a 124-109 season-opening victory at Philadelphia, the Bucks struggled badly on defense and didn't give Antetokounmpo and Lillard enough help on offense. ... Khris Middleton remained out as he recovers from offseason surgeries to each of his ankles.\n\n\r\n              Key moment\r\n              After Milwaukee's A.J. Green made a pair of 3-pointers in the first minute of the fourth quarter to cut Chicago's lead to 102-101, Patrick Williams answered with a 3-pointer of his own. Williams' basket started a 13-1 run, and the Bucks never seriously threatened again.\n\n\r\n              Key stat\r\n              The Bulls' 21 3-pointers were the most in a game since hitting a franchise-record 25 against New Orleans on Feb. 10, 2021.\n\n\r\n              Up next\r\n              The Bulls play their home opener on Saturday against the Oklahoma City Thunder, while the Bucks are at Brooklyn on Sunday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997121.7919219
}