{
  "game_id": "0021500852",
  "espn_id": "400828739",
  "date": "Feb 24, 2016",
  "matchup": "OKC @ DAL",
  "headline": "Durant, Westbrook lead Thunder over Mavs 116-103 for sweep",
  "body": "DALLAS -- Kevin Durant pulled up from about 40 feet and hit a buzzer-beating shot at halftime while Oklahoma City led the entire first half against Dallas.\nWhen that wasn't enough for the Thunder to finish off a season sweep of the Mavericks, they used their inside guys to get control again.\nDurant and Russell Westbrook scored 24 points apiece while Steven Adams and Enes Kanter took turns with dominant stretches in the second half of Oklahoma City's 116-103 victory Wednesday night.\n\n\"My job is to be able to find those guys when they're making shots, when they're contributing to our team,\" Westbrook said about his post players. \"They've been doing that all season, and that's what I try to do.\"\nWestbrook had 13 assists and seven rebounds as the Thunder scored the first 15 points of the fourth quarter and weathered a 14-0 Dallas run to avoid matching a season high with a third straight loss in their first game since a blowout defeat at home against Cleveland.\nThe addition of David Lee didn't help the Mavericks inside. Adams scored 11 of his 15 points in the third quarter and Kanter had eight in the first 5 minutes of the fourth, the last on a dunk to finish a 31-7 run over both quarters for a 102-81 lead.\nDirk Nowitzki had a season-high 33 points to lead the Mavericks, who went 0-4 against a possible first-round playoff opponent.\nWhile Oklahoma City is comfortably in third place in the Western Conference, Dallas has lost six of eight to fall into a group of four teams battling for the last three postseason berths.\n\"I don't look at the standings that much,\" Mavericks coach Rick Carlisle said. \"I'm looking at how we're playing. I didn't like the way we played in the first and fourth quarters tonight -- and those are pretty important quarters.\"\nDion Waiters, relegated to the bench with Andre Roberson's return from a 10-game absence and struggling from 3-point range, hit consecutive shots from beyond the arc to give the Thunder a 96-81 lead early in the fourth quarter.\nWaiters scored 11 of his 14 points in the fourth, when he made all three shots from long range.\n\"Our bench did not shoot the ball particularly well, but we just kept talking about trusting the pass and finding the open man,\" Thunder coach Billy Donovan said. \"Those shots started to fall because we made the right plays.\"\nDurant and Westbrook, who had his 39th double-double, carried the Oklahoma City offense until the Mavericks rallied and took their first lead at 63-62 on a jumper by Deron Williams early in the third quarter.\nThe Thunder came out of the third with an 87-81 lead thanks in large part to Adams, whose dunk late in the quarter put them ahead for good at 75-74. The 7-footer had a pair of offensive rebounds and baskets to go with two blocks when the teams were trading the lead.\n\"It's tricky when you go against those guys,\" Lee said. \"If you load up, then after the game we're talking about Durant or Westbrook having 40. And if you do load up, sometimes those other guys get involved.\"\nAfter missing 14 straight shots, Dallas made six in a row and pulled to 105-97 with a chance to get closer. But Nowitzki missed a jumper and Wesley Matthews was off on a 3 before Durant made one from long range to get the lead back to double digits for good.\nTIP-INS\nThunder: Roberson, who missed nine of the 10 games with a sprained right knee, had four points on 1-of-5 shooting in 21 minutes. ... Randy Foye scored six points on a pair of 3-pointers in his second game since coming over at the trade deadline in a deal with Denver.\nMavericks: Rookie C Salah Mejri had four blocks in the first half, including one each on Durant and Westbrook for the second straight game. ... Matthews had 15 points, all on 3-pointers, and Williams finished with 14 points and six assists. ... Raymond Felton had 10 points and nine assists.\nBALANCED ON THE BOARDS\nKanter led the Thunder with nine rebounds, while Serge Ibaka had 13 points and eight boards. Durant also had eight rebounds to go with six assists. Oklahoma City had five players with at least seven rebounds, and the NBA leader in rebounding margin finished with a 52-42 edge.\nLEE'S DEBUT\nLee replaced Nowitzki midway through the first quarter in his Dallas debut. He quickly had a rebound and a chance at a three-point play. But he missed the free throw on the way to four points and four rebounds in 15 minutes in his first game since Jan. 10 with Boston, which waived him last week.\nUP NEXT:\nThunder: At New Orleans on Thursday.\nMavericks: Host Denver on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994150.598007
}