{
  "game_id": "0021400901",
  "espn_id": "400579193",
  "date": "Mar 04, 2015",
  "matchup": "MEM @ HOU",
  "headline": "Marc Gasol's last-second shot lifts Grizzlies over Rockets",
  "body": "HOUSTON -- The Memphis Grizzlies needed a pick-me-up after dropping three of their last four games, including two straight at home.\nThey found it in a thrilling last-second victory over the Houston Rockets on Wednesday night.\nMarc Gasol made a jumper with 0.1 seconds left to give the Grizzlies a 102-100 victory.\n\n\"It was huge for us mentally because we hadn't been playing to our level of expectations,\" Mike Conley said. \"We've lost some games in the past few weeks that we feel like we shouldn't have lost. To lose (Tuesday) night in Utah and to beat a very good team in Houston that we know is going to be there in the playoff standings, it means a lot.\"\nWith the game tied, Gasol blocked James Harden's layup with 6.4 seconds left to give the Grizzlies the ball back for his winner.\nHarden was upset that he didn't draw a foul on that play on a night the Rockets tied a season low with five free throw attempts.\n\"I drove to the basket, I got grabbed on my arms and nothing was called,\" Harden said.\nGasol finished with 21 points.\nCourtney Lee made a pair of free throws with about a minute remaining to give Memphis a 100-98 lead. Terrence Jones tied it with a hook shot seconds later, and Gasol missed on the other end to set up the final sequence.\nThe win extended the Grizzlies' lead over second-place Houston in the Southwest Division and tied the season series at 2-2.\nJones had 21 points and Harden scored 18 in his return after a one-game suspension for kicking LeBron James on Sunday.\nThe Grizzlies were up by 12 with about 5 minutes left when Houston went on a 14-2 run, with seven points from Jones, to tie it at 98 with 1½ minutes left.\nA 10-0 run by the Grizzlies to open the fourth quarter broke a tie and gave them a 89-79 lead with 9 minutes left. They did most of that damage from the inside, with all but two of those points coming in the paint.\n\"The key was defense,\" Gasol said. \"We contained them on one side of the floor and they didn't get as many easy baskets and they weren't able to run.\"\nCoach Kevin McHale was unhappy with his team's defense.\n\"They got layups and steady cuts off of us,\" McHale said. \"We were not very good defensively. We gave them 102 points and they've had a hard time scoring.\"\nThe Rockets missed their first six shots of the fourth quarter before Josh Smith's 3-pointer cut it to 7 with about 7½ minutes remaining.\nMemphis scored five quick points, with a 3-pointer by Jeff Green, to make it 96-84 midway through the quarter.\nThe Grizzlies scored the first six points of the second half to take a 60-59 lead early in the third quarter. Houston led by a basket later in the third when Memphis scored eight points in a row, with the first six from Gasol, to go back on top 71-65 midway through the quarter. Houston's offense stalled in that span as the Rockets had a pair of turnovers and Harden missed a 3-pointer.\nThe Rockets got back on track after that, using a 10-2 spurt with 3s from Harden and Jason Terry, to take a 75-73 lead.\nSmith had a nifty no-look pass to Jones for a dunk near the end of the third quarter and a reverse layup by Smith tied it at 79-all entering the fourth.\nMemphis scored six straight points, with four from Gasol, to get within two points later in the second quarter, but Smith made a 3-pointer with less than a second left in the quarter to leave Houston up 59-54 at halftime.\nThe Rockets made five 3-pointers in the first quarter, with three straight coming at the end of an 18-4 run that gave them a 25-13 lead with 5 minutes left in the quarter.\n---\nTIP-INS\nGrizzlies: G/F Vince Carter missed his 14th straight game with a tendon injury in his left foot. ... Zach Randolph and G Beno Udrih returned Wednesday after missing Tuesday's game against Utah with illnesses. Randolph had 15 points and Udrih added four.\nRockets: Harden had 13 assists and has had at least 10 assists in four of his last five games. ... Smith added 16 points and eight rebounds for Houston. ...\nHOWARD HEALING: McHale said that C Dwight Howard, who hasn't played since Jan. 23 because of swelling in his right knee, is \"coming along.\" But there's still no timetable for his return. McHale hopes he's able to play at least a few games before the playoffs so he can get his rhythm back.\n\"When you're away from it and you get back it takes a little time,\" McHale said. \"You need timing and ... it just takes time.\"\nUP NEXT\nGrizzlies: Host the Los Angeles Lakers on Friday night.\nRockets: Host Detroit on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764992134.401099
}