{
  "game_id": "0021601034",
  "espn_id": "400900429",
  "date": "Mar 18, 2017",
  "matchup": "HOU @ DEN",
  "headline": "Harden has 40 in triple-double, Rockets top Nuggets 109-105",
  "body": "DENVER --  James Harden shook off a hard fall and fatigue to lead the Houston Rockets to a 109-105 victory over the Denver Nuggets on Saturday night.\n\nHe scored 40 points, pulled down 10 rebounds and dished out 10 assists for his 19th triple-double of the season and second in 24 hours.\n\nThat's 81 points, 25 boards and 21 assists in two nights.\n\n\"Drained?\" Harden asked, parroting the reporter's question. \"What's that?\"\n\n\"I'm just happy we won (coming) off a loss,\" at New Orleans, Harden said.\n\nThe Nuggets held Houston to 5-of-24 shooting from 3-point range but missed too many layups and free throws as their lead over hard-charging Portland for the final playoff spot in the West was sliced to 1 1/2 games.\n\n\"We missed 18 layups tonight,\" Denver coach Michael Malone said. \"So we could easily have won the game if we made our free throws and finished around the basket.\"\n\nThat last point surely will hit home with Denver guard Will Barton, who went 2 for 13 from the floor and made just one of nine 3-point attempts.\n\nWith his team trailing 107-105, Barton missed a 3-pointer and a layup in the final 30 seconds.\n\nAfter Barton's last errant 3-point try, Harden missed at the other end and Nikola Jokic, who got into early foul trouble, corralled the rebound. But Barton missed a runner that would have tied it with about five seconds left, and Harden drew a foul. He sank both free throws to reach 40 points for the second time in two nights.\n\n\"They made shots and we didn't,\" Jokic said. \"They played really good during that last stretch and we didn't make shots and that's it.\"\n\nHUGE HARDEN\n\nHarden scored 18 points in the third quarter, including Houston's final 16 of the period. He capped the run with a buzzer-beating 3 that gave the Rockets an 80-74 lead.\n\nIt wasn't all rosy for Harden, however. He hit the floor hard on his right elbow after fouling Mason Plumlee in the final minute of the third. Harden sat on the floor for about 30 seconds surrounded by his concerned teammates before getting up and shaking it off.\n\nThanks to Harden, the Rockets outscored Denver 29-18 in the decisive third quarter.\n\n\"I took whatever they gave me,\" Harden said. \"Whether it was shooting the 3 or getting to the basket, creating. We kind of woke up in that second half.\"\n\nMANY MISFIRES\n\nThe Rockets made only 21 percent of their 3-pointers. They hit just one of 15 shots from beyond the arc before Ryan Anderson swished one to break a 61-all tie late in the third quarter. Nobody other than Harden scored again for the Rockets until Eric Gordon banked in a jumper a minute into the fourth.\n\n\"We can score in a lot of different ways,\" Anderson said. \"We had a lot of looks at the basket because they were taking away our 3-point shots. That's something we adjusted to. Our game plan was to kick out and get open 3s. But their bigs did a great job of switching and trying to contain James. I mean, that's a tough task for them, though. We wanted to take advantage of what we can do, obviously. If they're going to switch, we're going to have James attack.\"\n\nCLOSE CALL\n\nNot only was Jokic in foul trouble, but the Nuggets were missing Danilo Gallinari (left knee), Wilson Chandler (groin) and Darrell Arthur (knees).\n\n\"It makes it even more difficult,\" Malone said. \"We kept on fighting back, we kept on giving ourselves a chance and that's what I liked about our team tonight. You guys have to understand that's a very good team over there and we have rookies out there playing meaningful minutes in the fourth quarter and making mistakes, which is what rookies do.\n\n\"They will be better off for it, hopefully next game and definitely in the future.\"\n\nTIP-INS\n\nRockets: Were coming off a 128-112 loss at New Orleans on Friday night. Houston's last visit to Denver also came 24 hours after the Rockets had played, but that time they built a 42-33 first-quarter lead on their way to a 128-110 win on Dec. 2. ... Houston missed 10 consecutive shots from behind the arc during one stretch.\n\nNuggets: Jokic took a seat after picking up his fourth foul with 10:17 left in the third quarter. Three of the fouls came on offense. \"The more he's not in the game, the better for us,\" Anderson said.\n\nUP NEXT\n\nRockets: Host the Nuggets on Monday night to begin a four-game homestand.\n\nNuggets: Monday's game in Houston starts a rough stretch with seven of nine on the road.\n\n---\n\nFollow Arnie Melendrez Stapleton on Twitter: http://twitter.com/arniestapleton",
  "source": "espn_api",
  "crawled_at": 1764995742.315967
}