{
  "game_id": "0022400410",
  "espn_id": "401704976",
  "date": "Dec 26, 2024",
  "matchup": "IND vs. OKC",
  "headline": "Gilgeous-Alexander ties career high with 45 points as Thunder beat Pacers for ninth straight win",
  "body": "INDIANAPOLIS -- — Shai Gilgeous-Alexander tied his career high with 45 points to lead the Oklahoma City Thunder to a 120-114 victory over the Indiana Pacers on Thursday night.\n\n\r\n              Gilgeous-Alexander hit 15 of 22 shots and all 11 free throws in Oklahoma City’s ninth consecutive victory.\n\n\r\n              Jalen Williams scored 20 points and Isaiah Hartenstein had 11 points and 13 rebounds for the Thunder.\n\n\r\n              Andrew Nembhard scored 23 points and Pascal Siakam added 22 points and 10 rebounds for the Pacers, who had their five-game winning streak snapped. Bennedict Mathurin finished with 18 points and Myles Turner had 11 rebounds.\n\n\r\n              After Tyrese Haliburton scored to give the Pacers a 107-103 lead, the Thunder answered with an 8-0 run to go ahead 111-107 with 1:39 remaining.\n\n\r\n              The Pacers led by 15 in the first half before settling for a 61-53 halftime lead. They were ahead 84-83 after three quarters on Jarace Walker's 3-pointer with 13 seconds left in the period.\n\n\r\n              Takeaways\r\n              Thunder: Gilgeous-Alexander was the difference in a back-and-forth game. There were 11 lead changes but the Thunder didn’t lead until the third quarter. Oklahoma City was without defensive ace Alex Caruso, who strained his left hip in Monday’s victory over Washington.\n\n\r\n              Pacers: Indiana couldn't overcome an off-night by Haliburton, who had just four points. Obi Toppin sprained his left ankle in the first quarter. He returned for four minutes in the second quarter but didn’t play in the second half.\n\n\r\n              Key moment\r\n              Gilgeous-Alexander sank a 3-pointer from 26 feet to push the Thunder’s lead to 114-109 with 59 seconds left.\n\n\r\n              Key stat\r\n              The Pacers committed 11 turnovers, eight more than Oklahoma City.\n\n\r\n              Up next\r\n              The Thunder face Charlotte on Saturday, while the Pacers play at Boston on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://www.apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764998148.6048682
}