{
  "game_id": "0021600830",
  "espn_id": "400900235",
  "date": "Feb 13, 2017",
  "matchup": "POR vs. ATL",
  "headline": "Hawks prevail 109-104 over Trail Blazers in overtime",
  "body": "PORTLAND, Ore. --  Paul Millsap thought he'd have a different shot than the floater he made to force overtime.\n\nOnce there, the Atlanta Hawks scored the final 12 points to beat the Portland Trail Blazers 109-104 on Monday night.\n\nTim Hardaway Jr. scored 25 points while Dennis Schroder added 22 for the Hawks. Millsap finished with 21, including the basket that sent him sprawling to the floor at the end of regulation.\n\n\"Initially I wanted to go baseline but I fumbled the ball and I had to go middle. It's a good thing,\" he said. \"I was able to get a good look at it and put it up with my left hand. You've just got to be calm and patient in those situations.\"\n\nCJ McCollum had 26 points for the Blazers, who traded starting center Mason Plumlee to Denver a day earlier. Damian Lillard added 21.\n\nLillard's 3-pointer and McCollum's floater gave Portland a 104-97 lead in overtime. Atlanta made free throws to stay close and Schroder's layup pulled the Hawks to 104-103. Kent Bazemore's layup gave Atlanta the lead with 40 seconds left.\n\nPortland got the ball with 12 seconds left, but Lillard appeared to slip on a drive to the basket. Millsap and Taurean Prince made free throws for the final margin.\n\n\"When you lose a tough game and you lose a brother in Mason, you know, it's tough,\" said Ed Davis, who had 11 points and 13 rebounds for the Blazers. \"And this one hurts especially, because we felt we had this game.\"\n\nHardaway, who was averaging 22.0 points in Atlanta's last five games, hit a 3-pointer with 1:40 left in regulation that closed Atlanta within 95-94. Maurice Harkless' tip after Davis missed a pair of free throws kept Portland in front 97-94 with 34 seconds left.\n\nAfter Dwight Howard missed the second of a pair of free throws, Atlanta got the ball with 2.2 seconds left and Millsap made the layup to send the game into overtime.\n\nHawks coach Mike Budenholzer said: \"2.2 seconds is longer than you think. It was a heck of a shot. Paul has been great at the end of games this year.\"\n\nPortland acquired center Jusuf Nurkic in the trade for Plumlee, who averaged 11.1 points as a starter this season for Portland.\n\nNurkic, who was on the bench in street clothes, was not available for the game against the Hawks. The Blazers started Meyers Leonard at center.\n\nAl-Farouq Aminu's 3 gave Portland a 34-21 lead, which was cut to 48-42 at the break.\n\nAminu finished with 14 points and 15 rebounds.\n\nTIP-INS:\n\nHawks: The Hawks continued to play without Thabo Sefolosha (left groin injury) and Tiago Splitter (right calf strain). Sefolosha missed his eighth game with the injury, but Budenholzer suggested he may play Wednesday against the Clippers.\n\nTrail Blazers: Portland recalled forward Jake Layman and guard Tim Quarterman from the Windy City Bulls of the NBA D-League on Monday. Layman averaged 17.9 points, 6.0 rebounds and 2.0 assists over eight games with the Bulls, while Quarterman averaged 9.8 points, 6.3 rebounds and 7.2 assists in nine games over two stints with the team.\n\nMISSED OPPORTUNITY\n\nLeonard was frustrated after the game that he did not make a case for himself in Plumlee's absence. He finished with two points and six rebounds in just under 24 minutes.\n\n\"Sometimes things don't happen the way you want them to. I've just got to hold my head high and keep trying to gain my teammates' and coaches' trust and belief in me, because I know I do a lot of good things,\" Leonard said.\n\nUP NEXT\n\nHawks: Atlanta plays one more on the road, against the Los Angeles Clippers on Wednesday, before the All-Star break.\n\nTrail Blazers: The Blazers could have Nurkic available for Wednesday night's game at Utah.",
  "source": "espn_api",
  "crawled_at": 1764995653.119974
}