{
  "game_id": "0022300211",
  "espn_id": "401584839",
  "date": "Nov 19, 2023",
  "matchup": "TOR vs. DET",
  "headline": "Raptors set franchise record with 44 assists, hand Detroit 11th straight loss",
  "body": "TORONTO -- — Pascal Siakam scored 23 points, Scottie Barnes and Dennis Schroder each had 17 and the Toronto Raptors never trailed in beating Detroit 142-113 on Sunday, handing the struggling Pistons their 11th consecutive loss.\n\n\r\n              Barnes led Toronto with nine assists as the Raptors recorded a franchise-record 44. Toronto finished with more assists than Detroit had made baskets (39).\n\n\r\n              “Today was one of those games where the ball was on a string for us,” Toronto center Jakob Poeltl said. “Everybody was sharing the ball, everybody was moving well. You create a lot of easy shots that way.”\n\n\r\n              Toronto’s previous record for assists in a game was 40, set Nov. 18, 2019 against Charlotte.\n\n\r\n              The Raptors have dished out 25 or more assists in nine consecutive games, the second longest streak in team history. Toronto had a 10-game run of 25 or more assists in January 2020.\n\n\r\n              Stanley Umude scored 19 points and Cade Cunningham had 18 for the Pistons. Detroit has the worst record in the NBA at 2-12 and has not won since beating Chicago on Oct. 28.\n\n\r\n              “I think a few of our guys are dealing with how hard the league is,” Pistons coach Monty Williams said. “When you’re dealing with it, the one thing you can control is your competition level. I didn’t see that across the board tonight.”\n\n\r\n              Cunningham said it was “unacceptable” for Williams to have to question the team’s level of competition amid a prolonged losing streak.\n\n\r\n              “That should be the last thing that needs to be asked of us or talked about, is how hard we compete,” Cunningham said. “That should be a given.”\n\n\r\n              Poeltl had 16 points and 10 rebounds, and Gary Trent Jr. came off the bench to score 18 points for the Raptors. Toronto set a season-high for points and led by as many as 40 in posting its fifth straight win over Detroit.\n\n\r\n              Chris Boucher scored 14 points for the Raptors and Precious Achiuwa had 12.\n\n\r\n              Cunningham, who shot 7 for 17, was the only Detroit starter to score more than 10 points.\n\n\r\n              “We’ve got to be realistic about the situation,” Cunningham said. “It’s hard to just be like ‘Oh, we’re good, we’re good,’ because we’re bad. We’ve got to address that.” \n\n\r\n              James Wiseman scored 15 for Detroit and Alec Burks scored 14. Ausar Thompson had 10 rebounds.\n\n\r\n              O.G. Anunoby returned to Toronto’s starting lineup after missing the previous three games because of a cut finger on his right hand. Anunoby shot 2 for 11 and scored nine points in 27 minutes.\n\n\r\n              Six different Raptors had at least one assist in the first quarter as Toronto recorded assists on 12 of 14 field goals. \n\n\r\n              The Raptors led 32-20 after one and stretched their advantage to 69-45 at the intermission. Toronto’s first-half point total was a season-high.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Host the defending NBA-champion Denver Nuggets on Monday.\n\n\r\n              Raptors: Visit the Orlando Magic on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995455.866859
}