{
  "game_id": "0021900810",
  "espn_id": "401161452",
  "date": "Feb 12, 2020",
  "matchup": "MIL @ IND",
  "headline": "Pacers pull away late to beat Bucks, snap 6-game skid",
  "body": "INDIANAPOLIS --  Malcolm Brogdon flipped the script Wednesday night.\n\nRather than watch another late lead slip away, the Indiana Pacers guard found his finishing touch.\n\nBrogdon thwarted Milwaukee's charge with a nearly perfect fourth-quarter performance, helping the the Pacers hold on for a 118-111 victory while snapping a season-worst six-game losing streak.\n\n\"I think my teammates rely on me and I think the past five game games I haven't been doing my job, calming the game down, finishing the game,\" he said. \"But tonight, I felt more like myself. My teammates trusted me with the rock.\"\n\nBrogdon made it pay off, too, with a rare victory over his former team which just happens to have the best record in the league. He finished with 17 points and matched his career high with 13 assists, but saved his best for the final quarter when he scored 10 points, recorded five assists and making all four of his free throws.\n\nNumbers only told part of the tale.\n\nAs Milwaukee methodically cut a 25-point first half deficit to five early in the fourth, it seemed another game might get away from the Pacers. But Brogdon scored on back-to-back baskets and found Jeremy Lamb for a layup.\n\nWhen the Bucks made it 90-86 with 8:18 to go, Brogdon found Lamb and T.J. Warren for back-to-back 3-pointers and closed out the 10-0 run by making two free throws and a 14-foot runner to give Indiana a 100-86 lead with 6:19 to go.\n\nGame over.\n\n\"I remember saying in the huddle, at the end of the day, you know it's a game of runs we've just to go finish the game,\" two-time All-Star Victor Oladipo said.\n\nT.J. Warren led the way with 35 points as the Pacers ended a five-game home losing streak and a four-game skid in the series against the Bucks.\n\nYes, it helped that reigning league MVP Giannis Antetokounmpo missed his second straight game following the birth of his first child.\n\nAnd the Pacers' fast start didn't hurt, either.\n\nThe difference this time: Indiana steadied itself when the Bucks got within 82-71 at the end of the third quarter and opened the fourth with six straight points before Brogdon became the closer.\n\n\"We kept fighting,\" Donte DiVincenzo said after leading the Bucks with 19 points. \"We had guys come in at the end and kept that energy high.\"\n\nTIP-INS\n\nBucks: Milwaukee had a five-game winning streak snapped and lost its first game against a Central Division foe this season after winning the first 11. ... The Bucks fell to 5-1 in games Antetokounmpo has missed this season. ... George Hill (strained left hamstring) and Kyle Korver (sore back) also missed the game. ... Khris Middelton had 17 points, Eric Bledsoe finished with 15 points and Sterling Brown had 14. ... DiVincenzo and Brown each had eight rebounds. ... The Bucks have scored at least 100 points in 78 consecutive games, tied for the sixth-longest streak in NBA history.\n\nPacers: First-time All-Star Domantas Sabonis had 15 points and eight rebounds, while Myles Turner had 14 points and 10 rebounds. ... Oladipo and Jeremy Lamb each scored 13 points, and Warren had four steals. ... After scoring 68 points in the first half, the Pacers went 6 of 24 from the field in the third quarter. ... Indiana snapped a four-game losing streak in the series with Milwaukee, winning for the first time in three tries this season.\n\nOLADIPO UPDATE\n\nOladipo came in averaging 10.8 points, shooting 29.5% from the field and 23.1% on 3s.\n\nUnexpected? Not really.\n\nBut coach Nate McMillan said the Pacers will use the All-Star break to contemplate how best to use Oladipo when Indiana returns to action.\n\n\"We've already made one adjustment when he went from coming off the bench to starting,\" McMillan said. \"We'll look at how he's playing, how he's feeling and figure out if we need to adjust his role after the break.\"\n\nOladipo went 5 of 7 from the field and 1 of 2 on 3s on Wednesday.\n\n\"He's been out more than a year. You can't expect him to be the Victor of old in two weeks,\" McMillan said.\n\nUP NEXT\n\nBucks: return from the All-Star break Feb. 20 at Detroit.\n\nPacers: visit New York on Feb. 21, following the All-Star break.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996455.846814
}