{
  "game_id": "0021600047",
  "espn_id": "400899497",
  "date": "Nov 01, 2016",
  "matchup": "HOU @ CLE",
  "headline": "Irving scores 32 as Cavaliers beat Rockets to stay unbeaten",
  "body": "CLEVELAND --  Kyrie Irving's personal showcases are becoming a common occurrence.\n\nIrving scored a season-high 32 points and the reigning NBA champion Cleveland Cavaliers remained undefeated, beating the Houston Rockets 128-120 on Tuesday night.\n\n\"He's growing every day,\" said LeBron James, who scored 19 points and had 13 rebounds. \"He's only 24 years old. He's special.\"\n\nCount Houston coach Mike D'Antoni as another Irving fan after watching Cleveland's point guard take over the game.\n\n\"Kyrie is great, he's got it all,\" D'Antoni said. \"All you can do is hope he misses shots. You put a hand in his face to make it as difficult as possible.\"\n\nKevin Love scored 24 points as Cleveland placed six players in double figures. The Cavaliers are 4-0 for the first time in 16 years.\n\nJames Harden scored a season-high 41 points and had 15 assists for Houston.\n\nRyan Anderson's 3-pointer cut Cleveland's lead to 114-112 with 2:18 to play, but 3-pointers by James and J.R. Smith and another 3 by Irving with 34 seconds left pushed the margin to 125-116.\n\nThe game's tip-off was moved up an hour to 6 p.m. because the Indians and Cubs were playing Game 6 of the World Series across the street at Progressive Field.\n\nJames and some teammates made their way across the plaza to Progressive Field for Game 6.\n\nCleveland scored 43 points in the fourth quarter, making 13 of 15 from the field, including its last eight shots.\n\n\"It's all about executing down the stretch,\" Irving said. \"That's not necessarily hard for us. It's just about consistently getting better.\"\n\nHarden, who was 13 of 20 from the field, gave the Cavaliers credit for hitting clutch shots.\n\n\"They didn't miss the last five or six minutes,\" he said. \"Some shots we wanted to live with and some shots they just made.\"\n\nSmith scored 15 points for Cleveland while Mike Dunleavy and Channing Frye had 11 apiece.\n\nEric Gordon scored 16 points for Houston. Nene added 13 and Anderson had 12.\n\nIrving's driving layup after a spin move in the lane gave Cleveland a 94-92 lead with 8 minutes to play and began a 13-3 run. Iman Shumpert and Dunleavy hit 3-pointers before Love was fouled shooting a 3 and made all three free throws.\n\nJames, who air-balled a free throw in the second quarter, also had eight assists.\n\nRockets guard Trevor Ariza left the game in the third quarter after bumping heads with Tristan Thompson. Ariza received five stitches and returned with a bandage under his right eye.\n\nHouston, which began a five-game trip, opens the season with seven road contests in eight games. The Rockets had won four straight games in Cleveland.\n\nTIP-INS\n\nRockets: Houston committed a backcourt violation when Ariza stepped across the timeline after receiving the opening tip. ... Harden has been playing point guard in place of Patrick Beverley (left knee), who remains out after undergoing arthroscopic surgery on Oct. 25. ... C Clint Capela made two free throws in the third quarter after missing his first seven attempts of the season.\n\nCavaliers: Smith hit his 344th 3-pointer, passing Cleveland assistant coach Damon Jones for ninth place on the team's all-time list. ... Frye returned to the team after missing two games after the death of his mother. ... Cleveland trailed after the opening quarter for the first time in four games.\n\nLESSONS LEARNED\n\nHarden thought the loss produced some positives for the Rockets, who fell to 2-2.\n\n\"It was a good test for us,\" he said. \"Playing against the defending champions on their home court, we can take some good things out of this.\"\n\nNOT A BIG THING\n\nCavaliers coach Tyronn Lue won't lose any sleep over the fact the Rockets scored 120 points and shot 48 percent.\n\n\"I didn't care, just win,\" he said. \"So this game I just circled `Get a win.' That's a tough team to play.\"\n\nUP NEXT\n\nRockets: Visit New York on Wednesday. D'Antoni coached the Knicks from 2008-2012, posting a 121-167 regular season record with one playoff appearance.\n\nCavaliers: Host Boston on Thursday. The Celtics host Chicago on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995799.8778
}