{
  "game_id": "0022300776",
  "espn_id": "401585404",
  "date": "Feb 13, 2024",
  "matchup": "LAL vs. DET",
  "headline": "LeBron, Davis lead surging Lakers past Pistons 125-111 for their 5th victory in 6 games",
  "body": "LOS ANGELES -- — LeBron James had 25 points and eight assists, Anthony Davis had 20 points and 14 rebounds, and the Los Angeles Lakers beat the NBA-worst Detroit Pistons 125-111 Tuesday night for their fifth win in six games.\n\n\r\n              D'Angelo Russell scored 21 points and hit four 3-pointers for the Lakers, who have won 10 of 15 overall to move three games above .500 (29-26) for the first time since a week before Christmas. Rui Hachimura and Austin Reaves added 15 points apiece in another dominant offensive game by the Lakers' new starting lineup, which combined for 96 points.\n\n\r\n              “Just trusting each other, not that we didn't before,” Davis said. “And then shot-making. Guys are making shots, making plays. It's fun playing this way. Guys are making the right plays, and the ball is popping. The result has been some good wins for us.”\n\n\r\n              Davis' six blocked shots led the defense, highlighted by his exceptional stop of Jaden Ivey as the only man back on a 3-on-1 Pistons fast break in the third quarter. James repeatedly referred to Davis after the game as “the defensive player of the year,” an award Davis has never won.\n\n\r\n              “I feel like I should have won it a couple of times (already), but didn't,” Davis said. “At this point, I'm just trying to win and continue to have a presence on the defensive end. If that seems to be in the plans for me to win it this year, then obviously it would be exciting for me to have one under my belt, but I feel like I could've had a couple of them in my career.”\n\n\r\n              The Lakers had a rare three-day break between games before this meeting, and they rolled to an early 24-point lead in their final home game before the All-Star break, when James will participate for the 20th time. After this game, James said he isn't playing at Utah on Wednesday in the Lakers' last game before the break.\n\n\r\n              Spencer Dinwiddie had six points and seven assists in his debut with the Lakers, who signed the veteran Los Angeles native last Saturday. Dinwiddie started 48 games for Brooklyn this season, and the graduate of Taft High School in suburban Woodland Hills will be a key scoring option and playmaker off the bench for the Lakers.\n\n\r\n              Ausar Thompson scored 19 points and James Wiseman had 18 points and nine rebounds for the Pistons, who had won two of their previous three games for only the third time all season. Team owner Tom Gores, who lives in Beverly Hills, watched from courtside.\n\n\r\n              “They definitely jumped on us early on,” Thompson said. “They played very fast off makes, misses, running up the court. They’re big, so they would post us up. We came in talking about it, but we’ve got to do a better job executing.”\n\n\r\n              Cade Cunningham had 12 points, seven assists and seven rebounds in the least impressive game of a strong road trip for Detroit, which beat Sacramento and Portland to open it before barely losing to the Clippers in this building last weekend.\n\n\r\n              One game after the Lakers put up 87 points in the second-highest scoring first half in franchise history, they dropped 71 on the Pistons and took a 71-48 halftime lead paced by Davis' 18 points and 12 boards. The lead matched the Lakers' biggest halftime margin of the season.\n\n\r\n              “That was pretty much the game,” Detroit coach Monty Williams said. “There was more to it than that, but that put us in such a hole. ... I think they have a game tomorrow, and I felt like their mindset was like, ‘We’ve got to jump on these guys right away.' We didn't understand that.”\n\n\r\n              Detroit trimmed the lead to 12 points with 4:50 to play, but got no closer. Davis sat out the entire fourth quarter, resting his legs for the back-to-back set.\n\n\r\n              New Pistons guard Quentin Grimes remained out with a sprained right knee. He has yet to debut for his new team since arriving in the multiplayer trade with New York.\n\n\r\n              Lakers guard Max Christie missed his second straight game with a sprained right ankle.\n\n\r\n              UP NEXT\n\n\r\n              Pistons: At Phoenix on Wednesday.\n\n\r\n              Lakers: At Utah on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996813.3335721
}