{
  "game_id": "0021501128",
  "espn_id": "400829015",
  "date": "Apr 01, 2016",
  "matchup": "CHA vs. PHI",
  "headline": "Walker scores 27, Hornets defeat 76ers 100-91",
  "body": "CHARLOTTE, N.C. -- When the Philadelphia 76ers clawed back to within four points with five minutes left to play, Kemba Walker and the Charlotte Hornets just dug a little deeper.\nWalker had three 3-pointers in the final five minutes and finished with 27 points and 11 rebounds, and the Hornets held off the 76ers 100-91 on Friday night leaving them on the verge of clinching an Eastern Conference playoff spot.\n\"We just locked in a little more, and grinded that win out,\" Walker said.\nThat is what good teams do, and the Hornets have turned into a good team this season.\nCharlotte (44-31) can wrap up a postseason berth for the second time in three seasons if Detroit beats Chicago on Saturday night.\nCoach Steve Clifford said team owner Michael Jordan has impressed upon those in the organization the Hornets need to consistently be a \"top-four or five team\" in the East, not one that squeaks into the postseason every year.\nThe Hornets are making strides in that area.\n\"Obviously, that's a process,\" Clifford said. \"But being in the playoffs two of three years is a big thing.\"\nNicolas Batum overcame a shaky start and had 19 points and seven assists for the Hornets, who have won 14 of their last 17 games and positioned themselves to potentially host a playoff series. They have a big game Sunday at Cleveland that could go a long way toward determining their playoff destiny.\nJerami Grant and Hollis Thompson each had 17 points, Carl Landry added 16 and Elton Brand chipped in 13 points and 11 rebounds for Philadelphia.\nWhen the Hornets cut the lead to four on a pair of free throws by Brand, the crowd began getting restless.\nBut the Hornets stepped on the gas and left the East's cellar dwellers in the dust.\nWalker knocked down a 3-pointer from the top of the key and Batum found Cody Zeller for a dunk. After a 76ers timeout, Walker hit another 3 and Batum scored on a fade-away bank shot to push the lead safely back to 14.\n\"Defensively, I don't have too many regrets,\" 76ers coach Brett Brown said. \"We needed to make more shots. It's almost that simple. We leave Charlotte feeling quite good about our defense, we just have to try to find a way to make some more shots.\"\nPhiladelphia shot just 36 percent.\nWith the win, the Hornets matched their best single-season win total since 2009-10, when they finished 44-38.\nWalker appeared more rested and sharp after only two games this week and drove by 76ers defenders like they were standing still at times. Jeremy Lin had two how-did-he-do-that shots, including one he simply threw up over his shoulder.\nBut it was Marvin Williams who had the highlight of the night dunking over Landry after taking a give-and-go feed from Batum. The one-handed slam brought the sold-out crowd to its feet and sent Williams' teammates on the bench literally throwing themselves on the floor in celebration.\nAl Jefferson had 13 points and rookie Frank Kaminsky provided a big lift off the bench with eight points and five rebounds in the first half, helping the Hornets open a comfortable lead.\nTIP-INS\n76ers: Fell to 3-36 on the road this season. ... Thompson posted his 35th game in double-figure scoring.\nHornets: All five Hornets starters are shooting better than 75 percent from the free throw line this season. ... Clifford, selected the Eastern Conference coach of the month, went over .500 (120-119) for his coaching career. ... The Hornets had their 13th sellout crowd of the season -- a new Time Warner Cable Arena record.\nDRIVE MORE\nThe 76ers attempted 39 3-pointers -- and made just 10 -- leaving Brown feeling like his team needs to drive more.\n\"Ultimately you look down at 10-for-39 from three and one of those players Hollis (Thompson) was 5 for 9, there were a lot of other players that were down,\" Brown said.\nCAM IN THE HOUSE\nNFL Most Valuable Player Cam Newton from the Carolina Panthers took in the game from a luxury suite. He was surrounded by young kids who attended the game through the quarterback's charitable foundation.\nUP NEXT\n76ers: Host New Orleans on Tuesday night.\nHornets: Visit Cleveland on Sunday night.",
  "source": "espn_api",
  "crawled_at": 1764994340.899446
}