{
  "game_id": "0021400342",
  "espn_id": "400578634",
  "date": "Dec 13, 2014",
  "matchup": "POR @ IND",
  "headline": "LaMarcus Aldridge has 19 points, 14 boards as Blazers top Pacers",
  "body": "INDIANAPOLIS -- LaMarcus Aldridge and Damian Lillard provided the 1-2 punch Portland needed Saturday night.\nAs usual, it was a knockout combination.\nThe All-Stars made back-to-back 19-foot jumpers in the fourth quarter, helping to fend off Indiana's desperate rally for a 95-85 victory that snapped the Trail Blazers' two-game losing streak.\nAldridge finished with 19 points and 14 rebounds while Lillard added 18 points, enough to hand the Pacers an eighth consecutive loss.\n\"We really realized, because of outcomes of previous games, we've got to do whatever it takes to put ourselves in a position to win this game,\" center Robin Lopez said after finishing with eight points and eight rebounds.\nNeither the road trip nor their final game on it went the way the Trail Blazers (18-6) envisioned.\nAfter starting with wins at New York and Detroit, Portland arrived in Indiana following losses at Minnesota and Chicago. They started slow Monday, too, but Aldridge and Lillard helped them turn the game in the second quarter when they shot 77.8 percent from the field and outscored the Pacers 36-15 to take a 58-38 halftime lead.\nAnother fast start in the third quarter seemingly put away the game. Aldridge's 20-foot jumper with 8:03 left gave Portland a 69-40 lead.\nBut the staggered Pacers refused to stay down and instead slowly fought their way back into contention.\nThey got within 82-66 after three, closed the deficit to 82-71 early in the fourth and then suddenly were within 86-78 when David West hit a 20-footer with 4:18 left. That's when Aldridge and Lillard made their back-to-back baskets to finally put the Pacers away.\n\"They made a lot of shots and they were being aggressive going to the basket,\" coach Terry Stotts said of the Pacers' comeback. \"Games have a tendency of swaying one way or the other, they did make their run but we took care of it at the end.\"\nIndiana was led by C.J. Watson, who had 23 points and Rodney Stuckey, who had 14 points and a career-high 14 rebounds. The Pacers have now shot less than 40 percent in five of their last eight games and have lost the last four by an average of 11.5 points.\n\"We just took our foot off the gas for a short period of time and that lead went up,\" Stuckey said. \"A team like that, you can't do that.\"\n---\nTIP-INS\nTrail Blazers: Portland has been strong in the West, but it has dominated the East. The Northwest Division leaders are now 11-1 against the Eastern Conference foes this season after winning at Indiana for the first time since December 2009.\nPacers: Roy Hibbert has played more like the struggling center from the second half of last season than a two-time All-Star. While his own injury and those to teammates have posed obstacles, Indiana needs more from its big man. Hibbert entered Saturday averaging 11.6 points and 7.2 rebounds. Against Portland, he was 4 of 11 from the field with 10 points and 10 rebounds.\nBETTER START\nIndiana has struggled mightily all season in the first quarter. On Saturday, they looked better, outscoring Portland 23-22. It's only the seventh time this season the Pacers have taken a lead into the second quarter. They're 3-13 when trailing after one.\nTHE SWEEP\nIn addition to ending this season's losing streak and its four-game skid at Indiana, Portland also pulled off a rare season sweep of the Pacers. The last time they did that was 2009-10. Five players scored in double figures for Portland on Saturday.\nUP NEXT\nTrail Blazers: Host San Antonio on Monday.\nPacers: Host the Los Angeles Lakers on Monday.",
  "source": "espn_api",
  "crawled_at": 1764992095.0771441
}