{
  "game_id": "0022200292",
  "espn_id": "401468447",
  "date": "Nov 27, 2022",
  "matchup": "IND @ LAC",
  "headline": "Zubac scores 31, pulls down 29 boards; Clippers beat Pacers",
  "body": "LOS ANGELES -- — Ivica Zubac had the best game of his six-year NBA career on Sunday afternoon. Yet, the Los Angeles Clippers center was frustrated after picking up his sixth foul late in the fourth quarter.\n\n\r\n              It's understandable, considering Zubac was one rebound away from having the fourth 30-point, 30-rebound game in the NBA since 1981.\n\n\r\n              “I was mad at myself because I wanted to get that 30 and 30 so bad. It hurts. It’s definitely not as happy as I should be,” said Zubac, who had 31 points and 29 rebounds in the Clippers 114-100 victory over the Indiana Pacers.\n\n\r\n              “I was just mad at myself for going for it, but I just I can’t help myself. Every time I see someone trying to get away I try to block it.”\n\n\r\n              It was the third time since 1973-74 that a player has put up a 31-point, 29-rebound, 3-blocks line in a game. Hall of Famer Kareem Abdul-Jabbar was the last to accomplish it on Feb. 3, 1978, at New Jersey.\n\n\r\n              Zubac had a career high in total rebounds and offensive boards with 12. It is also the most rebounds in an NBA game this season.\n\n\r\n              “It's crazy. I always wanted to get a 20/20 game,” Zubac said. “It's crazy to be mentioned with Kareem. It’s incredible.”\n\n\r\n              Zubac made a pair of free throws with 3:46 remaining for the second 30-point game of his career. But his hopes of getting the league's fourth 30-point/30-rebound rebound game and first since 2018 ended six seconds later when he picked up his sixth foul while trying to block T.J. McConnell's shot.\n\n\r\n              “He was just ready to go. He’s been good for us all year,” Clippers coach Tyronn Lue said. “It was great to see him rewarded with a big game like this. Guys being happy for him, looking for him in the paint and boxing out so he can rebound the ball.”\n\n\r\n              Norman Powell added 19 points and Terance Mann 14 for the Clippers, who are still without Kawhi Leonard and Paul George.\n\n\r\n              Jalen Smith scored a career-high 23 points for the Pacers, while Tyrese Haliburton added 15 and T.J. McConnell 14.\n\n\r\n              “He had a great presence around the basket and we didn’t do a good job,” Pacers coach Rick Carlisle said of Zubac. “He just dominated in there. In a situation like that we've got to have more than one guy helping out Myles (Turner) and we didn't do that.”\n\n\r\n              Zubac, a sixth-year center from Croatia, also is the first Clippers player since DeAndre Jordan in 2018 to have a game with at least 20 points and 20 rebounds. Zubac is the 12th player in franchise history with a 20/20 game.\n\n\r\n              It was the second-most rebounds in a Clippers game since 1981, according to SportRadar. Michael Cage had the most with 30 in a 1988 game against Seattle.\n\n\r\n              Zubac was 14 of 17 from the field, including three dunks, and 3 of 3 on free throws in 31 minutes. He had 14 points in the first quarter, which was a career high for him in any period.\n\n\r\n              “I had 16 and 15 at halftime and I just told myself that I’m gonna try to get every rebound possible. Just being aggressive on the offensive board, I think that was a big part of that game,\" Zubac said.\n\n\r\n              Los Angeles led 59-57 at halftime and was up 65-62 with 8:28 remaining in the third quarter before going on a 16-3 run over a five-minute span to break it open. Marcus Morris Sr. had six points during the run and Zubac added four.\n\n\r\n              The Clippers' largest lead was 20 early in the fourth quarter.\n\n\r\n              TIP-INS\n\n\r\n              Pacers: Buddy Hield, who came into the game second in the league with 69 3-pointers, was 1 of 9 beyond the arc and finished with 10 points. \n\n\r\n              Clippers: Morris scored 13 points while John Wall and Moses Brown added 10 apiece off the bench.\n\n\r\n              UP NEXT\n\n\r\n              Pacers: Remain in Los Angeles to face the Lakers Monday.\n\n\r\n              Clippers: Travel to Portland on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994334.773495
}