{
  "game_id": "0022300228",
  "espn_id": "401584856",
  "date": "Nov 22, 2023",
  "matchup": "MIL @ BOS",
  "headline": "Tatum shakes off illness, helps Celtics slow Giannis and beat fellow East power Bucks 119-116",
  "body": "BOSTON -- — Jayson Tatum shook off an illness to have 23 points and 11 rebounds, carrying the Boston Celtics over the Milwaukee Bucks 119-116 on Wednesday night in an early showdown of top Eastern Conference teams.\n\n\r\n              Jaylen Brown had 26 points and eight assists for Boston, which improved the NBA's best record to 12-3. Kristaps Porzingis added 21 points and Derrick White scored 13.\n\n\r\n              “I thought it was great. Obviously, the fans and everyone in the building knew this was No. 1 and No. 2 seed playing against each other, and that just adds more fuel to the atmosphere,” Porzingis said. “The energy was there. We played hard and they made a good push at the end and almost made a comeback, but we held strong.” \n\n\r\n              The Celtics opened a 21-point lead in the first half and never trailed. They held that double-digit edge until the Bucks made a late charge in the final two minutes, slicing it to 114-111 before Tatum hit three free throws in the closing 21.2 seconds.\n\n\r\n              Brook Lopez led Milwaukee (10-5) with 28 points. Damian Lillard had 27 points, five rebounds and five assists, but Giannis Antetokounmpo was limited to 21 points after scoring at least 40 in his last two games.\n\n\r\n              “When you miss a lot of shots, usually it's what the opposing team is doing,\" Lillard said of the slow start. ‘When you look at how we played, we just didn’t execute well. We didn't have good pace to our offense, we didn't make extra passes, we didn't screen for each other; a lot of things we have to do.\"\n\n\r\n              The Bucks, who scored 130 points or more in their last three games, had a five-game winning streak halted.\n\n\r\n              Tatum started despite being listed as questionable after scoring a season-high 45 points in an overtime loss at Charlotte in the last game.\n\n\r\n              The Celtics led 67-53 at halftime after shooting a sizzling 58.1%, including 12 of 23 from 3-point range.\n\n\r\n              “We were making great plays and executing for each other and we had our defensive connectivity,\" Boston coach Joe Mazzulla said. \n\n\r\n              They broke in front 10-0 and pushed it to 21-8 before opening a 54-33 edge on Brown’s three-point play midway through the second quarter.\n\n\r\n              Antetokounmpo was pulled by first-year coach Adrian Griffin after a dibbling violation. The two appeared to have words while the star was leaning against the scorer’s table facing the court, where he remained before checking back in on the next stoppage of play.\n\n\r\n              The teams made some of the biggest additions during the offseason, looking for supremacy in the East.\n\n\r\n              In late June, the Celtics acquired Porzingis in a blockbuster three-team deal that sent one of its longtime floor leaders, Marcus Smart, to Memphis.\n\n\r\n              The Bucks later added Lillard on Sept. 27, months after he requested a trade out of Portland. Milwaukee traded Jrue Holiday in that deal, and the Celtics acquired him from the Trail Blazers four days later. \n\n\r\n              Those players got involved right away, too, when Holiday picked up Lillard defensively on Milwaukee’s first possession and Porzingis challenged Antetokounmpo’s shot that caromed off the backboard on his initial drive to the basket.\n\n\r\n              “We knew neither one of us was going to win the championship tonight,” Lillard said of the energy in the building. “The thing that made it a high-level game is they were the first team in the East and we were the second. The winner walks away No. 1 right now, which means nothing. A lot of high-level players on their team, a lot of high-level on ours.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host the Wizards in an In-Season tournament game on Friday night.\n\n\r\n              Celtics: At the Magic in an In-Season tourney game on Friday afternoon.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996155.5212429
}