{
  "game_id": "0022001038",
  "espn_id": "401307847",
  "date": "May 11, 2021",
  "matchup": "MIL vs. ORL",
  "headline": "Antetokounmpo lifts Bucks past Magic, 114-102",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo scored 27 points and the Milwaukee Bucks kept up their chase of the No. 2 seed in the Eastern Conference with a 114-102 victory over the Orlando Magic on Tuesday night.\n\n\r\n                    The Bucks (44-25) remained a game behind Brooklyn (45-24) for the second spot in the East. The Nets defeated Chicago 115-107 on Tuesday night.\n\n\r\n                    Milwaukee, which holds the tiebreaker over the Nets, plays two of its final three games on the road, while Brooklyn finishes with three at home. Brooklyn is two games behind Philadelphia, which lost at Indiana. \n\n\r\n                    “The defense, a lot of good stretches that put us in a spot to win a game in a back-to-back, that this time of year is not easy,” Bucks coach Mike Budenholzer said.\n\n\r\n                    Donte DiVincenzo added 19, Brook Lopez 17 and Jrue Holiday 15 for the Bucks, coming off a 146-125 loss at San Antonio on Monday. Bobby Portis had 10 points and 15 rebounds.\n\n\r\n                    “Obviously last night we had a stinker,” Portis said. “San Antonio, they just shot the hell out of it. But we’ve been coming together as a team. Hopefully, our team is trending in the right direction and peaking at the right time, knowing that the playoffs are a couple of weeks away.”\n\n\r\n                    Cole Anthony had 18 points and Mo Wagner 17 for the Magic.\n\n\r\n                    Wendall Carter Jr. hit two free throws to pull the Magic within 92-85, but the Bucks responded with a 9-2 run on six free throws and Holiday’s 3-pointer to make it 101-87 with 5:40 remaining.\n\n\r\n                    Antetokounmpo had 12 points in the fourth quarter, including 10 of the first 11.\n\n\r\n                    “I think he got the ball in a couple good spots,” Budenholzer said. “Donte got him the ball for a couple free throws to start the quarter. I felt like he found them in a sideline pick-and-roll action, the two of them. We needed that.”\n\n\r\n                    Antetokounmpo capped a 10-3 run with two free throws to put the Bucks up 75-61 with just under four minutes left in the third quarter. Donta Hall hit a free throw with to pull the Magic within 79-71 entering the final period.\n\n\r\n                    “It was a lot more fun today,” Wagner said. “We competed, I think, as a unit. Regardless of what team it is, you’ve got to come out ready every day. I think we did that today. Great effort. Did a lot of good things, defensively especially.”\n\n\r\n                    TIP-INS\n\n\r\n                    Magic: Center Mo Bamba was out with a non-COVID illness and did not play. … Forward Chuma Okeke, out with a sprained left ankle, did not make the trip and will not play again this season, coach Steve Clifford said.\n\n\r\n                    Bucks: Milwaukee will increase fan capacity at Fiserv Forum to 50%, or approximately 9,000 fans, for the playoffs under new guidelines from the Milwaukee Health Department, the team announced Tuesday. Capacity has been limited to about 3,300. \n\n\r\n                    UP NEXT\n\n\r\n                    Magic: At Atlanta on Thursday.\n\n\r\n                    Bucks: At Indiana on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764997366.344267
}