{
  "game_id": "0022200832",
  "espn_id": "401468987",
  "date": "Feb 09, 2023",
  "matchup": "ATL vs. PHX",
  "headline": "Young scores 36 as Hawks beat short-handed Suns 116-107",
  "body": "ATLANTA -- — Seeing his short-handed team struggle in a loss to Atlanta only made Phoenix coach Monty Williams all the more eager to see Kevin Durant in a Suns uniform.\n\n\r\n              Trae Young scored 25 of his 36 points in the second half and the Hawks beat the Suns, still awaiting the arrival of the newly acquired Durant, 116-107 on Thursday night.\n\n\r\n              “It's more than a lift,” Williams said of the impact he expects from Durant. “I think it's more of a jolt, not just because of who is is, but his love of the game.”\n\n\r\n              The Suns had only nine players available after trading Cam Johnson and Mikal Bridges as part of a package for Durant, the 13-time All-Star, before Thursday’s trade deadline.\n\n\r\n              “Today was a tough day in so many respects, emotionally and the human side of it,” Williams said before adding, “but going forward, it's Kevin.”\n\n\r\n              After leading 56-47 at halftime, the Hawks extended their lead to 20 points in the third quarter.\n\n\r\n              Josh Okogie had 25 points and Deandre Ayton added 23 points and for Phoenix, which had its three-game winning streak end.\n\n\r\n              Durant did not join his new team for the game, but the anticipation for his arrival is growing.\n\n\r\n              “You can put him on any team and he’s going to fit,” Suns guard Landry Shamet said of Durant before the game. “He knows how to play. He’s played in a number of different systems. He’s insertable in any of them. You can throw it to him and he’s going to go score every time. He’s going to make the right play.”\n\n\r\n              The Hawks also made roster adjustments after two trades and also used only nine players. \n\n\r\n              Atlanta traded Justin Holiday, Frank Kaminsky and two second-round picks to Houston for shooting guard Garrison Matthews and center Bruno Fernando. The 6-foot-9 Fernando began his career in Atlanta in the 2019-20 season.\n\n\r\n              Also, the Hawks acquired former Detroit small forward Saddiq Bey as part of a three-team trade and sent five second-round draft picks to Golden State. The Hawks announced the deal as official following league approval after the game.\n\n\r\n              Atlanta led most of the game despite 19 turnovers, including nine by Young.\n\n\r\n              “We're going to need to be sharper than that,” Hawks coach Nate McMillan said. “We've got to be sharper with execution on both ends of the floor.”\n\n\r\n              Atlanta led 93-75 after three quarters before Phoenix scored the first nine points of the final period. Young sank a jumper to end the Suns' run, and his 3-pointer from the front of the halfcourt logo gave Atlanta a 104-91 lead.\n\n\r\n              Dejounte Murray had 19 points and John Collins had 16 for Atlanta. \n\n\r\n              HOMECOMING\n\n\r\n              The Hawks, coming off a 2/3 road trip, played only their sixth home game of 2023. They play 17 of their final 27 regular-season games at home as they look to move up from eighth in the Eastern Conference.\n\n\r\n              “It’s good to be back home, but we have to take advantage of this home stretch that we have,” McMillan said.\n\n\r\n              DOMINATING THE BOARDS\n\n\r\n              Clint Capela had 17 of the Hawks’ season-high 59 rebounds. Onyeka Okongwu had 11 rebounds. No Phoenix player had more than five rebounds.\n\n\r\n              “I think crashing the boards was big for us,” said Young, who had seven rebounds.\n\n\r\n              TIP-INS\n\n\r\n              Suns: F Devin Booker (groin), F Cameron Payne (right foot sprain) and Shamet (right foot soreness) were unavailable.\n\n\r\n              Hawks: With 12 assists, Young recorded his 27th double-double of the season. He posted his 61st consecutive game with at least 10 points and five assists, leaving him five games away from matching Oscar Robertson (66) for the fourth-longest streak in NBA history.\n\n\r\n              UP NEXT\n\n\r\n              Suns: Visit Indiana on Friday.\n\n\r\n              Hawks: Host San Antonio on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994820.810169
}