{
  "game_id": "0022400241",
  "espn_id": "401704807",
  "date": "Nov 17, 2024",
  "matchup": "CHI vs. HOU",
  "headline": "Sengun records triple-double, VanVleet scores 28 in Rockets 143-107 rout of Bulls",
  "body": "CHICAGO -- — Fred VanVleet scored a season-high 28 points, Alperen Sengun had 20 points, 11 rebounds and 11 assists for his second triple-double this season and the Houston Rockets routed the Chicago Bulls 143-107 on Sunday night for their fifth straight win.\n\n\r\n              Jalen Green scored 18 points as all five Houston starters reached double figures, and the Rockets topped their previous season-high in points (128). Amen Thompson played despite right quad soreness and added 16 points and 11 rebounds off the bench.\n\n\r\n              The Rockets dominated in the paint at both ends and pulled in 66 rebounds to Chicago's 47.\n\n\r\n              Zach LaVine led Chicago with 15 points, and Talen Horton-Tucker scored 12 off the bench as the Bulls dropped their second straight and third in four.\n\n\r\n              After a sluggish start, the Rockets came on to shoot 52.4% (55 of 105) from the floor. \n\n\r\n              Takeaways\r\n              Rockets: Houston, which entered Sunday leading the NBA with 49.5 rebounds per game, improved to 8-2 when outrebounding an opponent.\n\n\r\n              Bulls: Chicago had no answer for Houston's dominance in the paint and shot 33.6% (36 of 107). The 143 points were the most Chicago ever allowed to Houston.\n\n\r\n              Key moment\r\n              LaVine's free throws tied it at 36 4:06 into the second quarter. Led by VanVleet and Sengun, Houston outscored Chicago 32-16 to take a 68-52 halftime lead. The Rockets started the third with an 11-0 run and blew it open to 108-78 after 36 minutes.\n\n\r\n              Key stat\r\n              The Rockets set a season-high for points in a quarter when they outscored Chicago 41-26 in the second. They followed up by by scoring 40 in the third.\n\n\r\n              Up next\r\n              The Rockets play at Milwaukee on Monday, the same day the Bulls face the Pistons in Detroit.\n\n\r\n              ------ \n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997105.38077
}