{
  "game_id": "0021300672",
  "espn_id": "400489545",
  "date": "Jan 28, 2014",
  "matchup": "POR vs. MEM",
  "headline": "Zach Randolph's double-double helps push Memphis past Portland",
  "body": "PORTLAND, Ore. -- There is something about returning to Portland that brings the best out of Memphis forward Zach Randolph.\nRandolph did another number on his former team Tuesday night, finished with 23 points and 10 rebounds to lead the Grizzlies to a 98-81 victory over the Trail Blazers.\nMike Conley had 19 points and seven assists, and Marc Gasol added 15 points and eight rebounds for the Grizzlies (23-20), who won their third straight and seventh in eight games.\nLaMarcus Aldridge finished with 27 points and 16 rebounds as the Blazers (33-13) suffered their most lopsided defeat of the season. Portland registered a season low for points scored and had their home winning streak snapped at five games.\nRandolph registered his 27th double-double of the season as a franchise record-setting 190th for the Grizzlies, who never trailed.\nPortland fell to 18-5 at home.\nRandolph, who played his first six seasons with the Blazers, averaged 22.7 points on 52.9 percent shooting in seven previous visits.\n\"It's always fun to come back,\" said Randolph, who scored 13 of his 23 points in the first half as the Grizzlies opened a 61-46 lead. \"This is where I started, man. That's just the kind of player that I am.\"\nThe Grizzlies, picking up where they had left off in Saturday's 99-81 home win over Houston, shot 58.3 percent in the first quarter against the Blazers and jumped in front 31-22 behind Randolph's 11 points.\n\"It was important for us to get off to a fast start and we did,\" Randolph said. \"We had great offense during the game, but our defense was the key.\"\nThe Grizzlies held Portland, averaging a NBA-leading 109 points a game, to 34.5 percent shooting two nights after the Blazers shot a season-low 33.7 percent in a 103-88 loss at Golden State.\n\"Memphis saw blood and they lunged at our jugular,\" Blazers center Robin Lopez said. \"I really think we kind of slashed our own throat in a way, which kind of let them run away with it.\"\nAldridge was 6 of 7 in the first quarter and Nicholas Batum converted a three-point play that pulled Portland within 24-22, but Memphis outscored the Blazers 7-0 over the final 2:20 of the period to open a nine-point cushion.\n\"We were in attack mode on both ends of the floor,\" Grizzlies coach David Joerger said. \"Most of the night, we were the aggressors.\"\nMemphis connected four times from 3-point range in the second quarter, including one by Courtney Lee that extended the lead to 57-39 with 3:39 to play in the half.\nDamian Lillard connected from 3 for Portland to start the fourth quarter, sparking a 23-13 run that cut the deficit to 94-81 with 2:27 to play.\n\"It was a disappointing game, needless to say,\" said Blazers coach Terry Stotts, whose team was playing its ninth game in 14 nights. \"We got off to a slow start. We caught a team that's trying to put it together. They're on a roll and they're playing very well. They showed that in the first half.\"\nLillard finished with 16 points, Lopez had 14, and Batum 10 for the Blazers.\n\"We're in a rough patch right now,\" Lillard said. \"We're not shooting the ball very well and we've got to defend better. We've played so well, we were due for a rough patch and a little bit of adversity.\"\nThe Grizzlies remain in fourth place in the Southwest Division but are gaining ground.\n\"We're getting our chemistry right,\" Randolph said. \"I don't want to say we're right there or that we're hitting our peak, but it's coming. As long as we keep working hard and playing 48 minutes, we give ourselves a chance to compete with anybody.\"\nGame notes\nAldridge recorded his 22nd game with at least 20 points and 10 rebounds, second most in the league behind Minnesota's Kevin Love (26). . With his 15th point Tuesday, Aldridge passed Cliff Robinson for third among Portland's all-time leading scorers with 10,406 points. Aldridge's 27 point brought his career total to 10,418. . Memphis guard Tony Allen, whose last appearance was on Jan. 3 at Denver, was not in uniform and missed his 11th consecutive game with a sprained left wrist. Allen was averaging 10.2 points and 3.9 rebounds at the time of his injury. . Randolph went into Tuesday's game with 384 career double-doubles, ranking eighth among active players. . Randolph won the 2003-04 NBA Most Improved Player Award while in Portland and was the only player in club history to lead the team in scoring and rebounding in four consecutive seasons.",
  "source": "espn_api",
  "crawled_at": 1764992971.819259
}