{
  "game_id": "0022000404",
  "espn_id": "401267564",
  "date": "Feb 12, 2021",
  "matchup": "CLE @ POR",
  "headline": "Trent has 26 points, Blazers rout Cavaliers 129-110",
  "body": "PORTLAND, Ore. -- — Gary Trent Jr. had 26 points and the Portland Trail Blazers handed the Cleveland Cavaliers their sixth straight loss with a 129-110 victory Friday night. \n\n\r\n                    Carmelo Anthony added 23 points and Enes Kanter had 21 points and 13 rebounds for the Blazers, who have won five of their last six games. Portland led by as many as 30 points in dominating the Cavaliers. \n\n\r\n                    “We're staying locked in, trying to get as many wins as we can,” Trent said. \n\n\r\n                    Collin Sexton had 25 points for Cleveland, which has lost eight of its last nine and tumbled to third-to-last in the Eastern Conference. \n\n\r\n                    Cleveland was routed 133-95 by the Denver Nuggets on Wednesday night, a loss coach J.B. Bickerstaff called “embarrassing.” The game against the Blazers was the second of a five-game road trip. \n\n\r\n                    “I mean, obviously, we're going through a rough patch at a tough time against very good teams,” Bickerstaff said after the loss in Portland. \n\n\r\n                    The Blazers were playing the second of a back-to-back, following a 118-114 victory over Eastern Conference leader Philadelphia. \n\n\r\n                    Jarrett Allen had started the last two games for Cleveland in place of Larry Nance Jr., who is out with a fractured left hand. But Taurean Prince started against the Blazers. Allen finished with 22 points off the bench. \n\n\r\n                    Portland jumped out to a 22-4 lead at the start, but the Cavaliers closed the gap to 34-23 by the end of the opening quarter. \n\n\r\n                    The Blazers took a 65-45 lead on Anfernee Simons' 3-pointer late in the first half. Anthony, who has been hot the past two games, hit a 3-pointer at the buzzer that put Portland up 73-52 at the break. He led all scorers with 16 points off the bench. \n\n\r\n                    Trent made a 3-pointer that gave the Blazers an 85-61 lead and the rout was on. He finished the game with four 3s. \n\n\r\n                    Trent has been getting more playing time in the absence of CJ McCollum, who is out with a fractured bone in his left foot. \n\n\r\n                    Trent said he's also learning from Damian Lillard, as well as Anthony. \n\n\r\n                    “Everything I'm doing now I've just been working on in the shadows,” Trent said. “Now I'm having the opportunity to put it in play, to actually go through it, try moves and different stuff that I've been working on.” \n\n\r\n                    The Blazers lost Rodney Hood for the final quarter because of left foot soreness. \n\n\r\n                    Lillard, who was averaged 29.4 points a game, third best in the NBA, finished with 20 points before resting the final quarter. \n\n\r\n                    The Blazers finished their homestand 3-0. \n\n\r\n                    TIP INS\n\n\r\n                    Cavaliers: Kevin Love is traveling with the Cavaliers, but is still recovering from a calf strain and isn't quite ready to join the team. “He’s making steps in the right direction. I would expect an update within the next week or so, but he’s headed in the right direction,” Bickerstaff said at shootaround. \n\n\r\n                    Trail Blazers: Last year, the Blazers dropped their lone game against the Cavaliers. ... Portland hit nearly 60% from the floor in the first half. The 21-point halftime lead was the Blazers' largest of the season. \n\n\r\n                    GRABBING THOSE OFFENSIVE BOARDS\n\n\r\n                    Of his 13 boards, Kanter had seven offensive rebounds. “It's a special talent,” Blazers coach Terry Stotts said. “He has a nose for the ball. He's got great hands. He's persistent. It's just a remarkable skill.\"\n\n\r\n                    Kanter has 14 double-doubles this season. \n\n\r\n                    WHERE THERE'S A WILL\n\n\r\n                    Andre Drummond, who finished with eight points, was asked after the game how the Cavaliers can recapture the success they had early in the season. \n\n\r\n                    “We just have to find the will, the will to do it,” Drummond said. “We're playing really good teams right now, playoff teams, championship-contending teams. This is a great test for us as a young team to go against these teams and see where we are. Obviously we have a lot of work to do.” \n\n\r\n                    UP NEXT\n\n\r\n                    Cavaliers: visit the Los Angeles Clippers on Sunday. \n\n\r\n                    Trail Blazers: play at the Dallas Mavericks on Sunday. \n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997887.717885
}