{
  "game_id": "0022301014",
  "espn_id": "401585642",
  "date": "Mar 22, 2024",
  "matchup": "MIN vs. CLE",
  "headline": "Timberwolves top Cavaliers 104-91 behind Conley's 21 points and fan favorite Reid's 18",
  "body": "MINNEAPOLIS -- — Mike Conley scored 21 points and fan favorite Naz Reid added 18 points on his beach towel giveaway night, leading the Minnesota Timberwolves past the Cleveland Cavaliers 104-91 on Friday. \n\n\r\n              Anthony Edwards had 16 points and 13 rebounds, Rudy Gobert grabbed 15 rebounds and Jaden McDaniels added 15 points, three steals and two blocks for the Timberwolves (48-22), who shot 52% from 3-point range (14 for 27) and kept pace with first-place Oklahoma City (49-20) in the Western Conference playoff race after the Thunder won at Toronto. \n\n\r\n              The Wolves are third, one game behind Denver (49-21). They matched their best 70-game record in franchise history and already have their most wins in 20 seasons.\n\n\r\n              “We’ve been able to get the ball going,” Conley said. “It’s been humming around the horn, and everybody’s getting good looks.”\n\n\r\n              Darius Garland led the Cavaliers with 19 points, Caris LeVert added 16 and Jarrett Allen had his 35th double-double of the season with 15 points and 13 rebounds, but banged-up Cleveland lost for the fifth time in seven games.\n\n\r\n              The Cavs played without All-Star Donovan Mitchell for the third straight game because of a broken nose.\n\n\r\n              “The ball got sticky for us in the second half,” LeVert said. “It was tough to score against their defense.”\n\n\r\n              Reid exited the concussion protocol after missing the last game and moved into the starting lineup with immediate success. Gobert was back, too, after a rib injury sidelined him for the three previous games.\n\n\r\n              Reid got hot at the ideal time as the crowd proudly raised the blue towels down the stretch in his honor. He opened the fourth quarter with a 3-pointer and a few minutes later finishing a fast break with a ferocious dunk for a game-high 84-70 lead.\n\n\r\n              With 2:26 to go, Reid drained a corner 3-pointer for a 12-point lead before a Cavs timeout. Gobert patted him on the shoulders on their way to the bench as the crowd chanted “Naz Reid!” over and over again.\n\n\r\n              “That’s something that you dream about, definitely at this level in the NBA,” Reid said. “That’s love.”\n\n\r\n              The role players did the bulk of the dirty and glamorous work for the Wolves on this night, playing again without All-Star Karl-Anthony Towns as he sat on the bench with a wide smile and backward baseball cap in his eighth consecutive absence recovering from a torn meniscus in his left knee.\n\n\r\n              The Wolves put on 3-point shooting show in the first half in honor of their absent ace, hitting seven of their first 11 tries with a career high-tying four makes by Jordan McLaughlin.\n\n\r\n              “J-Mac is playing otherworldly right now,” coach Chris Finch said.\n\n\r\n              The Cavs surged back in front with an 18-5 run for a three-point lead at the intermission after 10 points in the second period by sharpshooting sub Sam Merrill.\n\n\r\n              The Cavs (43-27) won 17 out of 18 during one stretch earlier this winter and remain in third place in the Eastern Conference, two games behind Milwaukee for the No. 2 seed and one game ahead of fourth-place Orlando. They beat the Wolves in overtime two weeks ago without Mitchell behind a career-high 33 points and 18 rebounds from Allen, but the injuries might be catching up to them a bit. Starters Evan Mobley (sprained ankle, nine games) and Max Strus (strained knee, 10 games) have been sidelined, too.\n\n\r\n              “We just got stagnant. There wasn't a lot of movement,” coach J.B. Bickerstaff said. “Give them credit for being good defensively, but I just think we weren’t as attack-minded to get to the paint.”\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Visit Miami on Sunday night.\n\n\r\n              Timberwolves: Host Golden State on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996452.21956
}