{
  "game_id": "0022300349",
  "espn_id": "401584977",
  "date": "Dec 18, 2023",
  "matchup": "HOU @ CLE",
  "headline": "Donovan Mitchell has 37 points, Cavaliers beat Rockets 135-130 for their 11th straight overtime win",
  "body": "CLEVELAND -- — Donovan Mitchell scored 37 points, Sam Merrill had a career-high 19 off the bench and the Cleveland Cavaliers earned their 11th consecutive overtime victory by beating the Houston Rockets 135-130 on Monday night.\n\n\r\n              Merrill had five points and Max Strus added four in the extra period, when Cleveland outscored Houston 13-8 to match the second-longest OT winning streak in NBA history. New Orleans owns the record with 13 victories in a row from 2006-08.\n\n\r\n              “This is what Sam does, this is who he is,” Mitchell said. “I’ve been playing pickup games against him since he was at Utah State and I was with the Jazz. When hard work meets opportunity, it’s a beautiful thing to see.”\n\n\r\n              Rockets center Alperin Sengun made one free throw with 36.8 seconds left in regulation to tie it. Caris LeVert missed a 3-pointer on the Cavaliers’ subsequent possession and Sengun’s fadeaway at the buzzer rimmed out.\n\n\r\n              Fred VanVleet had season highs of 27 points and 17 assists, along with eight rebounds, and Sengun had 24 points, eight rebounds and six assists. The Rockets are 2-10 on the road and 11-1 at home.\n\n\r\n              “We’re doing great on offense, which you can tell, but not so much on defense,” Sengun said. “Me being in foul trouble tonight didn’t help, but we are not doing as good on defense as we usually do.”\n\n\r\n              The Cavaliers have won both of their games since announcing that starting power forward Evan Mobley and former All-Star point guard Darius Garland will likely be out until February.\n\n\r\n              Mobley was scheduled for arthroscopic left knee surgery Monday, while Garland will undergo a procedure to repair his broken jaw that occurred in a collision with Boston’s Kristaps Porzingis last week.\n\n\r\n              “Every game, it’s going to be by committee. No one player can do what they do,” said Mitchell, adding that his right shoulder was sore after running into the basket stanchion. “But honestly, it’s time for us to start winning. No excuses.”\n\n\r\n              Strus scored 17 points and LeVert had 12 points, seven rebounds and five assists. Merrill made 5 of 10 3-pointers in a career high-tying 24 minutes for the Cavaliers, who are 2-0 on a four-game homestand.\n\n\r\n              “I’m grateful for Coach (J.B. Bickerstaff) and his trust in me,” Merrill said. “That’s a pretty cool stat about our record in overtime. I didn’t know that.”\n\n\r\n              VanVleet is averaging a career-high 8.8 assists and an NBA-best 38.3 minutes in his first season with Houston. He had eight points and 10 assists in the first half, which featured 13 lead changes and eight ties.\n\n\r\n              Dillon Brooks had 16 points in his first game in Cleveland since Feb. 2, when the then-Grizzlies forward was ejected for striking Mitchell in the groin on the baseline. Both players were ejected, while Brooks also received a one-game suspension.\n\n\r\n              There were 22 fouls called and 27 free throws attempted in the third, when Cleveland scored a season-high 42 points and carried a 99-98 advantage into the fourth.\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host Atlanta on Wednesday night.\n\n\r\n              Cavaliers: Host Utah on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995620.378368
}