{
  "game_id": "0021800245",
  "espn_id": "401070926",
  "date": "Nov 19, 2018",
  "matchup": "MIL vs. DEN",
  "headline": "Antetokounmpo, Bledsoe lead Bucks past Nuggets, 104-98",
  "body": "MILWAUKEE --  The Milwaukee Bucks have been plagued lately by sluggish first-half performances.\n\nThey got away with it again Monday night.\n\nThe Bucks fell behind by 17 points before rallying to down the Denver Nuggets 104-98. Giannis Antetokounmpo scored 29 points and Eric Bledsoe added 23, including two late 3-pointers.\n\nAntetokounmpo added 12 rebounds for Milwaukee, which came from 22 down in the first half to beat the Chicago Bulls on Friday night. The Bucks also fell behind by double digits in the first quarter in a loss to Memphis on Wednesday.\n\n\"We've got to do a better job to try to set the tone,\" Antetokounmpo said. \"I think we did a better job this game, but we can do a lot better. I think our talent saves us. I feel like we are so talented that even when we are down 10, down 15, we can always get back into the game.\"\n\nThe Bucks swept the two-game season series against the Nuggets for the first time since 2009-10.\n\nJamal Murray had 17 points, eight rebounds and a season-best nine assists for Denver, which has lost six of its last seven games.\n\n\"We still have confidence. We just aren't winning games,\" Murray said.\n\nNikola Jokic had 20 points, Gary Harris 14 and Malik Beasley chipped in with a season-high 12 points off the bench.\n\n\"I was really pleased with the fight and the competitive spirit. We gave ourselves a chance against a very good basketball team on the road,\" Nuggets coach Michael Malone said. \"But there are no moral victories. We've got to start winning these games.\"\n\nThe Bucks led 78-77 heading to fourth quarter. The teams exchanged leads until Milwaukee went on a late 8-0 run that featured a pair of 3-pointers by Bledsoe.\n\n\"I think Eric is in a really good place,\" Bucks coach Mike Budenholzer said. \"He is understanding what we need in different moments.\"\n\nDenver pulled within two points with less than a minute left on Jokic's 3 but Khris Middleton, who had been 0 for 7 from deep, answered with a 3-pointer to put the Bucks up 103-98 with 27 seconds left.\n\nAfter trailing by 10 to start the third quarter, the Bucks grabbed the lead late in the period on a slam dunk by Antetokounmpo.\n\nDenver used a 17-4 to start the second quarter to build a 17-point lead and held a 56-46 advantage at the half. Milwaukee closed the half on a 10-3 run.\n\nThe Nuggets led 29-25 after the first quarter, sparked by nine points from Gary Harris.\n\nTIP-INS\n\nNuggets: Shot 6 of 21 from 3-point range in the first half. .With 11 first-half points, Murray was the lone Denver player to reach double figures, although all nine players who saw action scored. ...Malone was whistled for a technical foul in the third quarter after arguing an offensive foul call on Juancho Hernangomez.\n\nBucks: Lopez had seven first-quarter rebounds. He entered the game averaging 3.3 rebounds. .Antetokounmpo and Middleton combined to shoot 1 for 14 from 3-point range.\n\nCITY EDITION\n\nThe Bucks donned their colorful city edition uniforms for the first time this season. The uniforms feature a color scheme inspired by the Robert Indiana-designed court at the MECCA, which served as the Bucks' home until 1988. Milwaukee will wear the uniforms for 12 games this season.\n\nLONG-RANGE LOPEZ\n\nBrook Lopez, who connected on a career-high eight 3-pointers when the teams met earlier this month, was just 2 of 7 from deep but both turned out to be clutch. Lopez's 3-pointer late in the first half helped fuel a Bucks' rally. His 3 with 2:41 left in the game gave the Bucks a six-point lead.\n\nTURNOVER TROUBLES\n\nAlthough Murray nearly recorded his first career triple-double, he also committed five turnovers.\n\n\"He did some good things out there for us. For him, the challenge is going to be valuing the basketball,\" Malone said. \"As a starting point guard, you can't have five turnovers.\"\n\nUP NEXT\n\nNuggets: Visits Minnesota on Wednesday.\n\nBucks: Host Portland on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994521.183018
}