{
  "game_id": "0022200977",
  "espn_id": "401469132",
  "date": "Mar 06, 2023",
  "matchup": "DET vs. POR",
  "headline": "Lillard's triple-double helps Blazers beat Pistons 110-104",
  "body": "DETROIT -- — Damian Lillard had 31 points, 13 rebounds and 12 assists, securing his second triple-double of the season and third of his career before the end of the third quarter, and the Portland Trail Blazers beat the Detroit Pistons 110-104 on Monday night.\n\n\r\n              Lillard scored 16 points in the first quarter to give the Trail Blazers a 31-18 lead, and they had little trouble keeping a comfortable margin against a banged-up and slumping team for most of the night.\n\n\r\n              “He came out and set the tone for us,” coach Chauncey Billups said. “He usually does.”\n\n\r\n              The 6-foot-2, 200-pound dynamic guard also hit the boards for his undersized team, grabbing three more than he had in any other game this season.\n\n\r\n              “We are kind of small and we need him in there right now,” Billups said. “He's going to fight with the big guys. He’s prepared to do whatever it takes.”\n\n\r\n              Detroit pulled within six points with 1:39 left to fire up the previously quiet fans, and Jerami Grant quieted them with a 3-pointer on the ensuing possession. Grant finished with 26 points against his former team.\n\n\r\n              “I applaud our fight and scratch down the stretch,” Pistons coach Dwane Casey said.\n\n\r\n              Cam Reddish had 13 points, Trendon Watford scored 12 and Drew Eubanks added 10 points for the Trail Blazers, who have won two straight for the first time in a month to strengthen their hopes of rallying into the playoffs.\n\n\r\n              “I don’t mind floating under the radar,\" Billups said. “I just want us to get healthy and see if we can make the push that that I believe we can.”\n\n\r\n              Isaiah Livers matched a career high with 17 points for the Pistons, who have lost a season-high eight straight games.\n\n\r\n              “He did an excellent job of being aggressive and taking his open shots,” Casey said. \"He was our best 3-point shooter out there at times.\"\n\n\r\n              Detroit rookie Jaden Ivey had 13 points and 13 assists, Cory Joseph scored 14 points, Alec Burks had 13 and James Wiseman added 12.\n\n\r\n              The Pistons were without injured starters Bojan Bogdanovic, Isaiah Stewart and rookie center Jalen Duran, along with key reserve Killian Hayes.\n\n\r\n              \"We were out of sorts offensively because that is such a new lineup,\" Casey said. “That hurt us in the first quarter and then we compounded them when we started substituting.\"\n\n\r\n              WELCOME BACK \n\n\r\n              Billups, NBA Finals MVP during Detroit's third and last championship in 2004, was welcomed back with a roar from the crowd at Little Caesars Arena.\n\n\r\n              “Even though this is not the building I played in, it’s still home,” said Billups, who played with the Pistons at The Palace in suburban Detroit. \"It’s always fun no matter what. It’s just another game for me to coach, in all honesty, but it means so much more to see everybody.”\n\n\r\n              Fans politely clapped for Grant, who was dealt to Portland last summer for a 2025 first-round pick that Detroit used in a trade with New York to acquire Duren.\n\n\r\n              TIP-INS\n\n\r\n              Blazers: Anfernee Simons (ankle) missed a third straight game. ... Lillard has 30-plus points in all three of his triple-doubles and has scored at least 30 in six straight games against Detroit. \n\n\r\n              Pistons: Bogdanovic (Achilles tendon), Stewart (hip), Duren (ankle) and Hayes (hand) left the team short-handed. ... Detroit is 5-21 in 2023.\n\n\r\n              UP NEXT\n\n\r\n              Blazers: Play at Boston on Wednesday night.\n\n\r\n              Pistons: Host Washington on Tuesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994363.489488
}