{
  "game_id": "0021800310",
  "espn_id": "401070991",
  "date": "Nov 28, 2018",
  "matchup": "MIL vs. CHI",
  "headline": "Antetokounmpo scores 36 points, Bucks hold off Bulls 116-113",
  "body": "MILWAUKEE --  Giannis Antetokounmpo kept doing his thing for the Milwaukee Bucks.\n\nBut he still needed a helping hand from teammate Khris Middleton, who sank a clutch 3-pointer with 5.2 seconds left to send the Bucks to a 116-113 victory over the Chicago Bulls on Wednesday night.\n\nAntetokounmpo had a season-high 36 points, 11 rebounds and eight assists in an entertaining duel with former teammate Jabari Parker, who paced the Bulls with 24 points, eight rebounds and five assists.\n\nAfter several missed tips by Brook Lopez and a tap-out by guard Eric Bledsoe, Malcolm Brogdon smartly passed the ball back to a wide-open Middleton at the top of the 3-point arc to set up the winning shot. Justin Holiday missed a 3 for Chicago that would have tied it in the final seconds.\n\nMiddleton's game-winner was the only shot he took in the fourth quarter.\n\n\"For several years, Khris has been a big shot-maker, a big-shot guy at the end of games,\" Bucks coach Mike Budenholzer said. \"When you don't get a touch, that can make it harder.\n\n\"I think they were rotating, sometimes they were taking away Giannis and getting a quick rotation to Khris and we got some good open looks on the backside. He's a heck of a player.\"\n\nAntetokounmpo just missed a third triple-double this season. He attacked in the paint and shot 14 of 21 from the field and 8 of 12 on free throws.\n\n\"So far, I've figured out my spots and I know where I can be effective from,\" Antetokounmpo said. \"I've just got to keep being aggressive. I don't think there are guys in the league that can guard me 1-on-1 down there.\n\n\"But I think what makes this team great and what makes me great in this game plan is that I can pass the ball. I think teams are scared of that.\"\n\nAntetokounmpo also had a crucial block of Parker's shot with the score tied at 111 in the last minute, and the star forward then sank two free throws with 36 seconds left before the Bulls' Zach LaVine tied the score with a reverse layup.\n\nThe Bucks (15-6) improved to 11-2 at home and bounced back from a close loss Monday at Charlotte. Chicago (5-17) lost its fourth in a row and for the eighth time in nine games.\n\nBrogdon finished with 24 points, five rebounds and six assists while hitting all six 3-pointers he attempted. Middleton added 17 points, six rebounds and four assists.\n\n\"I was just trying to be aggressive and take my opportunities where they were,\" Brogdon said. \"Khris and Giannis attract so much attention. Just knock down shots.\"\n\nLaVine also had 24 points for Chicago and rookie guard Ryan Arcidiacano continued his stellar play in the last week with 22 points, five rebounds and four assists. Robin Lopez added 17 points off the bench.\n\n\"I love how we're competing right now,\" Bulls coach Fred Hoiberg said. \"I thought we did execute down the stretch. When we have our movement, we have a lot of great looks at the basket.\"\n\nThe Bulls again scored 40 points in the first quarter, equaling their total in the opening quarter on Nov. 16 in the first meeting between the teams.\n\nParker had 10 points in the quarter and the Bulls shot 66.7 percent from the floor (12 of 18) to take a 40-30 lead.\n\nAntetokounmpo sparked a Bucks rally in the second and finished the half with 20 points, five rebounds and four assists.\n\nMilwaukee outscored Chicago 33-22 in the second period to take a 63-62 halftime lead.\n\nA 3-pointer by Brook Lopez gave the Bucks a 77-72 lead with 7:40 left in the third quarter and prompted a Bulls timeout.\n\nArcidiacono sank a pair of 3s as the Bulls regained the lead at 82-80 before the Bucks responded with dunks by Antetokounmpo and Pat Connaughton sandwiched around a free throw by Middleton.\n\nThe Bucks led 92-89 entering the final quarter.\n\nTIP-INS\n\nBulls: Second-year forward Lauri Markkanen is making progress in his recovery from a right elbow sprain sustained in training camp. He practiced Tuesday for the first time since being injured and worked out before Wednesday's game. \"The plan is to have him for a full-contact practice again (Thursday in Detroit),\" Hoiberg said. \"He will gradually get his rhythm and his timing and his conditioning back. It's exciting.\" Markkanen, an all-NBA rookie first-team selection last season, has missed the first 22 games. ... G Denzel Valentine had left ankle surgery in Green Bay on Tuesday and will be out for the rest of the season. He is expected to return to full basketball activities in six months. ... Parker is getting more comfortable with his new team and entered averaging 16.3 points and 7.2 rebounds per game. \"He's had a great couple weeks for us,\" Hoiberg said. \"We're very tough to guard when he rebounds the ball and pushes it with pace. We're using him all over, as the trail-spot attack guy and using him on the block, and he's been a really good facilitator in those spots.\"\n\nBucks: Veteran forward Ersan Ilyasova returned after missing two games with right knee soreness and had nine points and five rebounds in 20 minutes off the bench. Budenholzer said Ilyasova and third-year forward Thon Maker will be counted on to help make up for the loss of center John Henson, who had surgery on his left wrist Tuesday. Henson is expected to be out at least 12 weeks but could return this season. \"We've played some really big lineups earlier in the season,\" Budenholzer said. \"Without John, we may play some smaller lineups and look at different combinations of guys. I think (Maker) knows what he needs to do.\"\n\nUP NEXT\n\nBulls: Play at Detroit on Friday.\n\nBucks: Play at New York on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994515.136957
}