{
  "game_id": "0022300827",
  "espn_id": "401585455",
  "date": "Feb 25, 2024",
  "matchup": "LAC vs. SAC",
  "headline": "Kings beat Clippers 123-107 behind Fox and hand LA back-to-back losses for 1st time since December",
  "body": "LOS ANGELES -- — De’Aaron Fox scored 33 points, Domantas Sabonis had his NBA-leading 20th triple-double and the Sacramento Kings defeated the Clippers 123-107 on Sunday night, sending Los Angeles to its second loss in a row for the first time since late December.\n\n\r\n              Norman Powell led the Clippers with 21 points in his first start of the season in place of Paul George, who sat out with a sore left knee. Kawhi Leonard added 20 points, as did James Harden, who made all 10 of his free throws to go with eight assists. Los Angeles hadn't lost two straight since Dec. 21 and 23.\n\n\r\n              The third-place Clippers came out of the All-Star break playing a back-to-back on the road. They returned home for the first time, where they were 20-6, only to lose to a team below them in the West.\n\n\r\n              “I feel like we’re competing, but we’re just like a step behind. Hopefully we get a rhythm,” Leonard said. “We're a little flat right now, but we got time to pick it up.”\n\n\r\n              Harrison Barnes added 22 points for the Kings, who won their third in a row. Sabonis finished with 17 points, 12 rebounds and 12 assists, making him one of six players in NBA history with 20 or more triple-doubles in a season.\n\n\r\n              “I think people kind of become numb to what he’s doing,” Fox said of Sabonis. “Averaging close to a triple-double, that’s a tough thing to do.”\n\n\r\n              The Clippers cut their deficit to five early in the fourth before the Kings had them down 10. After again rallying to get to 101-96 on Terance Mann's three-point play, the Clippers soon trailed by 10 again.\n\n\r\n              “When you’re playing from behind like that, it’s tough,” Clippers coach Tyronn Lue said. “One mistake, one wrong play and the lead goes back up. You can't get that far down, especially against a good team.”\n\n\r\n              Barnes and Davion Mitchell hit consecutive 3-pointers and Barnes scored again, pushing the Kings' lead to 116-100.\n\n\r\n              “We didn’t give up 30 points in a single quarter,” Fox said. “If you’re guarding that way, you give yourself a chance every single night.”\n\n\r\n              The Kings ran off 10 straight points to open the third before Barnes' 3-pointer extended their lead to 18 points.\n\n\r\n              After their early three-minute scoreless stretch, the Clippers outscored the Kings 29-21 the rest of the period to end the third trailing 89-80. \n\n\r\n              UP NEXT\n\n\r\n              Kings: Host the Miami Heat on Monday in the second game of a back-to-back.\n\n\r\n              Clippers: Host the Lakers on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996542.7853708
}