{
  "game_id": "0022400820",
  "espn_id": "401705386",
  "date": "Feb 23, 2025",
  "matchup": "OKC @ MIN",
  "headline": "West-leading Thunder outlast Timberwolves 130-123 behind 37 points from Gilgeous-Alexander",
  "body": "MINNEAPOLIS -- — Shai Gilgeous-Alexander had 37 points, eight rebounds, eight assists and three steals to help the West-leading Oklahoma City Thunder beat the Minnesota Timberwolves 130-123 on Sunday night to open a home-and-home set.\n\n\r\n              The teams will play again Monday night in Oklahoma City.\n\n\r\n              Chet Holmgren added 19 points for the Thunder, who shot a season-best 54% (19 for 35) from 3-point range.\n\n\r\n              Gilgeous-Alexander re-entered the game with eight minutes left and sparked an 18-4 spurt over the next 5:16 after his cousin, Nickeil Alexander-Walker, hit a 3-pointer that put the Timberwolves up 110-105.\n\n\r\n              Anthony Edwards had 29 points and 10 rebounds for the short-handed Timberwolves (31-27), who wiped out a 19-point deficit in the second quarter before losing for the fourth time in five games.\n\n\r\n              The Thunder (46-10) have lost only once in the last 25 days, when they fell in Minnesota on Feb. 13. Oklahoma City has a 9 1/2-game lead over Denver and Memphis for the Western Conference lead.\n\n\r\n              Takeaways\r\n              Thunder: Aaron Wiggins and Alex Caruso were vital off the bench. Caruso hit three 3-pointers and had steal to set up a 3-pointer by Gilgeous-Alexander over a 2:47 stretch midway through the fourth quarter.\n\n\r\n              Timberwolves: Missing the starting frontcourt, Rudy Gobert (back) and Julius Randle (groin), the Timberwolves lost Jaylen Clark in the third quarter when he hit the back of his head on the floor after an off-balance layup. Clark, who made his second career start, was ruled out with neck pain.\n\n\r\n              Key moment\r\n              After the Thunder went up 52-33 by making 19 of their first 27 shots, the Timberwolves had a 25-4 run over a 6:07 stretch. With Holmgren on him at the top of the key, Edwards used a crossover dribble and a slight step-back for his first made 3-pointer of the game with 2:36 left in the second quarter.\n\n\r\n              Key stat\r\n              The Timberwolves missed 11 of their first 12 attempts from 3-point range.\n\n\r\n              --------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764997676.397734
}