{
  "game_id": "0021900151",
  "espn_id": "401160793",
  "date": "Nov 12, 2019",
  "matchup": "LAL @ PHX",
  "headline": "Lakers pull away with late 3-pointers to beat Suns 123-115",
  "body": "PHOENIX --  Kyle Kuzma was out on the floor in the crucial final minutes on Tuesday night when his teammates made the extra pass and found him at the 3-point line. Both times, he never hesitated to take the shots that splashed through the net and pushed the Lakers to a 123-115 over the Phoenix Suns.\n\nNobody looked happier than Anthony Davis and LeBron James. They'll take all the help they can get.\n\n\"Welcome back,\" Davis said they told Kuzma.\n\nDavis had 24 points and 12 rebounds and Kuzma added a season-high 23 points on 9 of 16 shooting to push the Lakers (8-2) to their best 10-game start since 2010 and bounce back from a home loss to Toronto on Sunday.\n\nJames added 19 points, 11 assists and seven rebounds.\n\nPhoenix (6-4) trailed for a big chunk of the fourth quarter but pushed ahead 113-111 on Devin Booker's fastbreak layup with 3:29 left. The Lakers responded with three straight 3-pointers -- one from James and two more from Kuzma -- to lead 120-113 and put the game out of reach.\n\nKuzma missed the first four games of the season this year because of an ankle injury he suffered during the summer while playing for USA basketball. He averaged 18.7 points last season but was scoring just over 10 per game until Tuesday's outburst.\n\n\"I've just got teammates who believe in me,\" Kuzma said. \"We all believe in each other. We're a team and we pick each other up.\"\n\nLos Angeles dominated in the paint with 70 points. Dwight Howard came off the bench to score 12 points and grab nine rebounds in 20 minutes. The Lakers had 39 assists on 51 made field goals.\n\n\"That is the secret for us,\" Lakers coach Frank Vogel said. \"If you truly commit to the extra pass offensively and playing for each other, we are going to be near unbeatable. That was a really good team we beat tonight -- that's a really good win.\"\n\nThe Suns were led by Ricky Rubio and Booker, who both scored 21 points. Aron Baynes added 20 and Dario Saric had 18.\n\n\"Down the stretch we have to be better,\" Booker said. \"Rebound better, execute better. We didn't do that tonight.\n\nDavis scored 14 points as the Lakers took a 60-58 halftime lead. James added nine points and eight assists.\n\nCLOSE GAME\n\nThe Lakers' 3-point barrage in the final minutes ended a very close game for most of the night. Neither team ever led by double figures and there were 29 lead changes and 14 ties.\n\nAccording to the Elias Sports Bureau that was the most lead changes in a Suns game since 2009.\n\nHURTING DAVIS\n\nDavis had another productive game despite taking \"a shot\" to the ribs during the first quarter. He went to the locker room to get it wrapped, but quickly returned and shot 9 of 17 from the field.\n\nDavis said he wasn't sure if he'd play against Golden State, which is a quick turnaround on Wednesday. The 6-foot-10 forward said he would see how his body responded in the morning.\n\n\"I just want to play,\" Davis said. \"It's tough for me to lead from the sideline.\"\n\nTOUGH NIGHT\n\nPhoenix's Kelly Oubre Jr. had a rough night, scoring just one point in 19 minutes. He shot 0 of 5 from the field, including 0 of 4 from 3-point range. The bad shooting night snapped a career-high streak of scoring in double figures for 22 consecutive games.\n\nEFFICIENT BOOKER\n\nBooker came into the game shooting 54.5% from the field, 53.2% on 3-pointers and 92.3% on free throws. He's still on his 50/50/90 pace after shooting 9 of 18 from the field against the Lakers. He also had nine assists on Tuesday.\n\nTIP-INS\n\nLakers: Vogel said before the game that Rajon Rondo (right calf strain) and Troy Daniels (sore left knee) were on 15-minute restrictions. Rondo had five points, six rebounds and seven assists in 14 minutes in his season debut. Daniels didn't play.\n\nSuns: Rookie guard Ty Jerome missed his 10th straight game with a sprained right ankle. ... Baynes continued his good outside shooting with a 4 of 6 performance from behind the 3-point line. ... Frank Kaminsky had 16 points and nine rebounds in 23 minutes.\n\nUP NEXT\n\nLakers return home to host Warriors on Wednesday.\n\nSuns host the Hawks on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sport",
  "source": "espn_api",
  "crawled_at": 1764996035.67047
}