{
  "game_id": "0022200198",
  "espn_id": "401468353",
  "date": "Nov 13, 2022",
  "matchup": "LAL vs. BKN",
  "headline": "Davis scores season-high 37, Lakers beat Nets to snap skid",
  "body": "LOS ANGELES -- — Anthony Davis knew he had to have a big game to help the Los Angeles Lakers snap a five-game losing streak. \n\n\r\n              After getting motivation from an unlikely source, he put together his best game of the season.\n\n\r\n              “I was watching the Green Bay Packers game (against the Dallas Cowboys) and Aaron Rodgers threw a slant to Allen Lazard for 40 yards. He was flexing and that got me motivated,” said Davis, who had a season-high 37 points and 18 rebounds in the Lakers 116-103 victory over the Brooklyn Nets Sunday night.\n\n\r\n              “I knew I had to dominate to get this win. With LeBron (James) out, a lot of guys lean on me to get the job done.” \n\n\r\n              Davis grabbed 10 offensive rebounds, which tied a career-high in a regular-season game, as the Lakers led throughout. Davis was averaging only 8.6 points in the second half, but had 21 against the Nets, including 15 in the third quarter.\n\n\r\n              “I was trying to get to the paint and score inside knowing they had limited shot blockers,” Davis said. “If we put it on the rim then I had a guard on me and a chance to get an offensive rebound.”\n\n\r\n              Davis was not only active inside on the boards, but in his shot selection as well. All but two of his 25 attempts were in the paint.\n\n\r\n              “That’s been the plan and figuring out how to get him more touches and in rhythm. Everything was aggressive,” Lakers coach Darvin Ham said.\n\n\r\n              Lonnie Walker IV added 25 points for Los Angeles, which was missing James for the second straight game due to an left adductor strain.\n\n\r\n              Kevin Durant led the Nets with 31 points, nine rebounds and seven assists. Cam Thomas came off the bench to score 15 points and Edmond Sumner added 13.\n\n\r\n              “We played in spurts tonight. It was a perfect storm for them. They made shots and got to the rim,” Durant said.\n\n\r\n              The Lakers led by 16 with less than four minutes remaining in the third, but the Nets rallied to close to 91-87 on a two free throws by Durant with 8:27 remaining in the fourth quarter. The Lakers then blew it open with a 15-2 run, including seven points by Walker and four from Davis.\n\n\r\n              Los Angeles' largest lead was 18 with four minutes remaining.\n\n\r\n              Kyrie Irving missed his sixth straight game as part of a team suspension for refusing to say he had no antisemitic beliefs,\n\n\r\n              Los Angeles had a 55-46 lead at halftime. The Lakers extended their advantage to 77-61 with 3:56 remaining in the third quarter on a 3-pointer by Walker before the Nets scored 11 straight points and closed the quarter on a 16-3 run.\n\n\r\n              “I knew we expended a lot of juice from the Clipper game (a 110-95 win on Saturday). The guys gave what they had,” said Brooklyn coach Jacque Vaughn after the Nets fell to 1/3 during the second game of back-to-backs.\n\n\r\n              TIP-INS\n\n\r\n              Nets: Nic Claxton suffered a left eye contusion during the third quarter and did not return. ... Markieff Morris made a crosscourt shot at the end of the first half, but it happened after the buzzer. ... Ben Simmons was declared out one hour before tipoff due to left knee soreness. ... Seth Curry (left ankle) sat out after playing 26 minutes on Saturday in a win over the Clippers. \n\n\r\n              Lakers: Austin Reaves had 15 points while Russell Westbrook had 14 points and 12 assists. ... Walker scored 11 of the Lakers' first 20 points.\n\n\r\n              UP NEXT\n\n\r\n              Nets: At the Sacramento Kings on Tuesday.\n\n\r\n              Lakers: Host the Detroit Pistons Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994150.140887
}