{
  "game_id": "0021800692",
  "espn_id": "401071368",
  "date": "Jan 21, 2019",
  "matchup": "CLE vs. CHI",
  "headline": "Bulls snap 10-game losing streak, beat Cavaliers 104-88",
  "body": "CLEVELAND --  Somebody was bound to break a long skid Monday -- Zach LaVine and the Chicago Bulls seized the opportunity.\n\nLaVine scored 25 points and the Bulls broke a 10-game losing streak, beating the Cleveland Cavaliers 104-88 in a meeting of teams that began the day with the worst records in the NBA.\n\n\"It stinks to lose 10 in row,\" said guard Kris Dunn, who scored 13 points and was one of five Bulls to hit double figures. \"A game like this can galvanize us.\"\n\nChicago (11-36) never trailed and has won all three games this season against Cleveland (9-39), which has lost 16 of 17 overall.\n\n\"We talked about the first quarter starts,\" Bulls coach Jim Boylen said. \"Our energy and spirit were good, kind of gave us momentum into the rest of the game.\"\n\nThe Bulls hit 15 of 29 3-pointers and built a 21-point lead in the fourth quarter. Chicago won for the first time since Dec. 28 against Washington.\n\nBobby Portis had 15 points while Lauri Markkanen added 13 for the Bulls, who have rolled to two lopsided wins at Cleveland in less than a month.\n\nThe Bulls defeated the Cavaliers 99-98 in Chicago on Nov. 10 and routed Cleveland 112-92 on Dec. 23 at Quicken Loans Arena.\n\nRookie Collin Sexton scored 18 points, but had no assists in 29 minutes for the Cavaliers. Ante Zizic, who is seeing playing time because of injuries in Cleveland's frontcourt, had 13 points.\n\nChicago hit 12 of 22 shots in the first quarter and built a 15-point lead late in the period. Cleveland cut into the margin and trailed by six at halftime before the Bulls regained control by making five 3-pointers in the third quarter.\n\n\"We got a lot from a lot of guys,\" Boylen said. \"Kris was very good. Zach was real efficient, which we need him to be.\"\n\nThe Cavaliers, in addition to dealing with several injuries, looked like a tired team after going 1-5 on a road trip that ended Saturday night in Denver. Cleveland missed its first eight shots and coach Larry Drew called timeout less than four minutes into the game.\n\n\"I'm not going to use that as an excuse or as crutch,\" Drew said. \"Early on, I could see they did not have their legs. We clearly didn't have the zap. I really thought at some point it would kick in, but we did not have it.\"\n\nTIP-INS\n\nBulls: The team announced after the game that C Wendell Carter Jr. had successful surgery to repair the ulnar collateral ligament in his left thumb Monday morning. The rookie is expected to be sidelined for eight to 12 weeks. The surgery was performed by Dr. John Fernandez at Midwest Orthopedics at Rush Hospital in Chicago  ... Robin Lopez started at center and Portis saw minutes in the pivot. ... LaVine dunked off an alley-oop pass from Kris Dunn in the second quarter.\n\nCavaliers: C Tristan Thompson missed his third straight game because of a sore left foot. \"As long as he's feeling any kind of discomfort, we're going to keep him out,\" Drew said. Thompson missed 10 games in December with the injury. ... F Larry Nance Jr. is expected to miss two more weeks with a sprained right knee.\n\nTOUGH TRIP\n\nThe Cavaliers' 11-day trip began Jan. 9 and finally ended Saturday. Cleveland broke a 12-game losing streak against the Los Angeles Lakers, playing without the injured LeBron James, on Jan. 13.\n\nThe Cavaliers returned to Cleveland at 4:30 a.m. Sunday. Their flight landed in the middle of a snowstorm that began early Saturday and lasted about 24 hours. The storm, which dumped about a foot of snow on the area, and made the drive home a challenge.\n\n\"A few guys got stuck in snow,\" Drew said. \"We were out in the middle of the intersection pushing cars. I don't believe I closed my eyes until about 6:30.\"\n\nGOOD BALANCE\n\nChicago had 11 players score and five were in double figures. Jabari Parker hit two 3-pointers early in the fourth and finished with 10. Lopez had eight points and nine rebounds.\n\nNO ADVANTAGE\n\nThe Cavaliers haven't won at home since Dec. 12 against New York. Cleveland has lost eight in a row at Quicken Loans Arena.\n\nUP NEXT\n\nBulls: Host Atlanta on Wednesday.\n\nCavaliers: Visit Boston on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764994768.182622
}