{
  "game_id": "0021901286",
  "espn_id": "401224761",
  "date": "Aug 09, 2020",
  "matchup": "TOR vs. MEM",
  "headline": "Siakam scores 26; Raptors hang on to top Grizzlies, 108-99",
  "body": "LAKE BUENA VISTA, Fla. --  Pascal Siakam scored 26 points to help the Toronto Raptors beat Memphis 108-99 on Sunday, preventing the Grizzlies from clinching a spot in the Western Conference play-in series.\n\nNorman Powell scored 16 points and Kyle Lowry added 15 for the Raptors, who clinched the No. 2 seed in the Eastern Conference and their fifth consecutive season with at least 50 wins.\n\nThe Raptors have earned the right to rest their key players before the playoffs start.\n\n\"We've played heavy minutes,\" Raptors coach Nick Nurse said of his starters. \"We did what we kind of needed to do to go 4-1 (in the restart) and put this thing where we needed it to be. I would say you'll see a little bit of everything here in the last three games as far as lots of guys playing.\"\n\nDillon Brooks scored 25 points, Grayson Allen matched a season high with 20 and Ja Morant had 17 points and 10 assists for the Grizzlies.\n\nThe Grizzlies dropped to 1-5 in the restart and are barely hanging on to eighth place in the West, with Portland, Phoenix and San Antonio close behind. There will be a play-in series in the West, starting Saturday.\n\n\"I'm not worried about no play-in game right now,\" Morant said. \"My focus now is learning from my mistakes from this game against the Raptors, try to fix them, and go out and play Boston.\"\n\nToronto scored 40 points in the second quarter and led 60-54 at halftime.\n\nLowry hit a 3-pointer as time expired in the third quarter to put Toronto up 88-71. The Raptors held the Grizzlies to 30% shooting in the period.\n\nToronto led 94-79 before Memphis rallied with a 13-1 run that trimmed the Raptors' lead to 95-92. Siakam responded with two 3-pointers to help the Raptors regain control.\n\n\"There so many moments -- missed shot here and there,\" Memphis coach Taylor Jenkins said. \"They made the plays down the stretch. Siakam -- what a heck of a game.\"\n\n---\n\nTIP-INS\n\nGrizzlies: The bench outscored the starters 30-24 in the first half. The starters shot a combined 9 for 28 before the break. ... Brandon Clarke scored 16 points. ... Made just 14 of 42 3-pointers.\n\nRaptors: Serge Ibaka was issued a technical foul for arguing a call late in the third quarter. He finished with 12 points and 12 rebounds ... Committed 25 turnovers and forced 22.\n\nTRADING PLACES\n\nMarc Gasol and Jonas Valanciunas faced their former teams for the first time. The Grizzlies sent Gasol to Toronto for Valanciunas last February. Gasol averaged 15.2 points, 7.7 rebounds and 1.5 blocks in 11 seasons with Memphis.\n\nGasol had 10 points and six rebounds. Valanciunas went scoreless and attempted just two shots, but he had 10 rebounds.\n\nQUOTABLE\n\nJenkins, on the effort against the Raptors: \"I'm obviously proud of our guys. Tough-fought game. Obviously got down double digits there in the second half. That's an elite team right there. That team's got a great shot to play in the finals. I thought our guys brought it today.\"\n\nSTAT LINES\n\nSiakam was coming off a 5-for-15 shooting performance against Boston on Friday. He followed it by making 9 of 16 shots against the Grizzlies.\n\n\"I don't really care about makes and misses, to be honest, because I know that I work hard and I always do the right thing and I make the right plays, and at the end of the day, that's my attention,\" he said.\n\nUP NEXT\n\nGrizzlies: Play the Boston Celtics on Tuesday.\n\nRaptors: Play the Milwaukee Bucks on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995572.7392771
}