{
  "game_id": "0022300378",
  "espn_id": "401585006",
  "date": "Dec 21, 2023",
  "matchup": "MIL vs. ORL",
  "headline": "Antetokounmpo scores 37 points, Bucks beat Magic 118-114 for 6th straight victory",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo and the Milwaukee Bucks have been feeling right at home. Now they want to maintain that same momentum on the road,\n\n\r\n              Antetokounmpo had 37 points, 10 rebounds and six assists and Milwaukee beat the Orlando Magic 118-114 on Thursday night for its sixth consecutive victory — all at home on the longest homestand of the season.\n\n\r\n              The Bucks have won 15 straight games at Fiserv Forum, their longest single-season home winning streak since 1991-92 when they won their first 18 at home.\n\n\r\n              “I think we're trending upwards,” said Damian Lillard, who had 24 points and eight assists. “I think defensively we're still having some miscommunications, maybe some mistakes, but I think we're defending a lot better than we had been starting the season. I think offensively we're finding ourselves, sort of establishing how we're going to play and how it works for everybody. It's still not perfect on either end, but we're finding a way to win games.”\n\n\r\n              The Bucks will open a four-game trip in New York on Saturday.\n\n\r\n              “We were able to enjoy our time at home,” Antetokounmpo said. “Obviously, winning makes you more happy. You're able to enjoy your time more, practices, too, and the time you spend with your family.”\n\n\r\n              Khris Middleton and Brook Lopez added 14 points each for Milwaukee.\n\n\r\n              Franz Wagner scored 29 points for the Magic, who have lost four in a row. Paolo Banchero had 23 points and Moe Wagner 21. Cole Anthony added 18 points and 10 rebounds.\n\n\r\n              “The Bucks have two big-time players who made big-time plays down the stretch,” Magic coach Jamahl Mosley said. “Our guys played hard. They played together. They played with poise, all the things we're asking a team that's growing and getting better to do.\"\n\n\r\n              Orlando had a 60-40 edge in the paint but went just 8 of 33 on 3-point attempts to continue its slump from long range. The Magic were 9 of 36 from beyond the arc Wednesday in a 115-106 home loss to Miami.\n\n\r\n              After scoring a season-low 11 points while getting a triple-double Tuesday in a 132-119 victory over the San Antonio Spurs, Antetokounmpo had nine points in the first 2 1/2 minutes Thursday while helping the Bucks build an 11-2 lead.\n\n\r\n              After trailing 80-65 midway through the third quarter, the Magic cut Milwaukee’s lead to 93-91 on Franz Wagner’s 3-pointer with 9:02 left in the game.\n\n\r\n              Orlando had two possessions with a chance to tie or pull ahead but failed to score either time. Lopez then scored on a pass from Malik Beasley to start a 9-2 spurt.\n\n\r\n              The Magic got the margin back down to five with two minutes left but couldn't get any closer until Gary Harris hit a 3-pointer in the final second.\n\n\r\n              Orlando was missing Jalen Suggs because of a sprained left wrist and Joe Ingles due to a sprained left ankle.\n\n\r\n              UP NEXT\n\n\r\n              Magic: At Indiana on Saturday night.\n\n\r\n              Bucks: At New York on Saturday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996144.210807
}