{
  "game_id": "0022000430",
  "espn_id": "401267590",
  "date": "Feb 16, 2021",
  "matchup": "TOR @ MIL",
  "headline": "Raptors beat Bucks 124-113 despite losing Lowry to injury",
  "body": "MILWAUKEE -- — Fred VanVleet scored 33 points, Pascal Siakam added 23 and the Toronto Raptors withstood the loss of Kyle Lowry to beat the slumping Milwaukee Bucks 124-113 on Tuesday night.\n\n\r\n                    Lowry exited with a sore left ankle in the third quarter but had 18 points, six rebounds and six assists in 22 minutes. The ankle problem caused Lowry to go to the locker room late in the first half, though he returned to start the third quarter.\n\n\r\n                    “He hit it a couple of times, once in the first half and then once in the second,” Raptors coach Nick Nurse said. “They're going to evaluate it thoroughly here tonight and we should know more here tomorrow.”\n\n\r\n                    Even with Lowry out of the game, the Raptors never fell behind in the second half.\n\n\r\n                    “Any time a guy goes down, it's that next-man-up mentality that we've always had here,” VanVleet said. “Something I've tried to continue to do is increase my level of play when he's out. I thought the entire team just picked it up a notch when he went down. That's what you like to see.”\n\n\r\n                    Milwaukee lost its fourth straight despite getting 34 points, 10 rebounds, eight assists and five steals from Giannis Antetokounmpo. The Bucks hadn’t dropped four in a row since the 2019 Eastern Conference finals against Toronto, when they blew a 2-0 lead and lost the series in six games.\n\n\r\n                    Antetokounmpo nearly recorded his second straight triple-double. The two-time reigning MVP had 24 points, 17 rebounds and 10 assists Sunday in a 114-109 loss to the Oklahoma City Thunder.\n\n\r\n                    “You've just got to go to work the next day,” Bucks coach Mike Budenholzer said. “We've got to look at the film. We've got to go to practice. We've got to see where we can get better. Nobody's happy with the result. Nobody feels good about it.”\n\n\r\n                    Siakam added 13 rebounds and six assists. VanVleet had a team-high seven assists.\n\n\r\n                    The Bucks were playing the first of eight straight home games after ending a six-game road trip. This prolonged homestand also gives the Bucks the chance to play in front of spectators at Fiserv Forum for the first time this season.\n\n\r\n                    Tuesday’s game featured only about 250 invited guests and family members of players in an arena that seats over 17,000. \n\n\r\n                    But the return home couldn't end the Bucks' slide.\n\n\r\n                    Milwaukee trailed 112-103 and then scored six straight points before Donte DiVincenzo missed a potential tying corner 3-pointer with 5:08 remaining. The Raptors answered with seven straight points and stayed in front by at least six the rest of the way.\n\n\r\n                    OG Anunoby returned to action after missing 10 games with a strained left calf and had 13 points and seven rebounds in 27 minutes. Chris Boucher scored 14 points and Norman Powell had 11.\n\n\r\n                    Pat Connaughton had a season-high 20 points and Bobby Portis scored 16 for the Bucks. DiVincenzo had 12 points and eight assists but shot just 1 of 8 from 3-point range.\n\n\r\n                    TIP-INS\n\n\r\n                    Raptors: With 6-foot-10 center Aron Baynes moving to the bench to make room for Anunoby, the Raptors opened the game with a lineup that didn’t include anyone taller than 6-9. The Raptors still outrebounded the Bucks 44-41.… Yuta Watanabe missed a fourth straight game with a sprained left ankle. \n\n\r\n                    Bucks: The Bucks hadn’t lost four straight in the regular season since Feb. 25 to March 2, 2018. … Jrue Holiday missed a fifth straight game due to the NBA’s health and safety protocols. ... The Bucks will have 500 more invited guests Thursday and 750 on Friday before opening games up to the general public starting Sunday. The Milwaukee Health Department has allowed the Bucks to fill 10% of the seats, which equates to about 1,800 people.\n\n\r\n                    UP NEXT\n\n\r\n                    The Raptors and Bucks meet again in Milwaukee on Thursday. \n\n\r\n                    ------\n\n\r\n                    Follow Steve Megargee at https://twitter.com/stevemegargee\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996866.115861
}