{
  "game_id": "0021900017",
  "espn_id": "401160659",
  "date": "Oct 25, 2019",
  "matchup": "TOR @ BOS",
  "headline": "Brown scores 25, Celtics rally late to beat Raptors 112-106",
  "body": "BOSTON --  Kemba Walker said he wants to earn the role of being a leader with the Celtics this season.\n\nHe didn't mind following his teammates in Boston's win over the Toronto Raptors on Friday night.\n\nWalker recovered from a second straight poor shooting start to score 11 of his 22 points in the fourth quarter and help the Celtics rally to beat the defending NBA champions 112-106.\n\nJaylen Brown had 25 points, including a key 3-pointer in the closing minutes. Jayson Tatum finished with 25 points and nine rebounds.\n\nWalker said support from his teammates helped him shake off a 0-for-5 start from the field just two days removed from his  4 for 18 performance in Boston's season-opening loss to Philadelphia.\n\n\"That's what I needed,\" Walker said. \"The things that they said to me are the things that I needed to hear. They seen my face, kind of down at times. They just kept encouraging me.\"\n\nThe Celtics shot only 38%, but it wasn't for a lack of trying. They had 109 attempts in the game.\n\nPascal Siakam scored 33 points and had eight rebounds to lead the Raptors, who went 18 of 36 from the 3-point line.  Kyle Lowry finished with 29 points, including six 3-pointers.  But the pair also had nine turnovers between them.\n\nSiakam said teams are playing him differently through two games.\n\n\"There's more help, obviously,\" he said. \"Last year, I felt like I was always out there on the side just working. Now there's a little more intention.\"\n\nThere were 12 ties and 19 lead changes, with neither team holding more than a seven-point lead.\n\nBoston found its shot in the fourth quarter, outscoring Toronto 36-24.\n\nOne of the plays that got the Celtics going came with 5:43 to play. Brown corralled a Marc Gasol miss, took two dribbles and threaded a half-court bounce pass between three Raptors defenders to a cutting Gordon Hayward for a layup to give the Celtics a 99-98 lead.\n\n\"I have definitely been working on that side of my game, being a playmaker and making plays for others,\" Brown said. \"Hopefully there will be a lot more passes like that coming soon.\"\n\nLater, the Celtics were leading 107-106 when Brown hit a 3-pointer with 2:49 to play.\n\nO.G. Anunoby was called for a charge on Walker with 1:26 left, which was challenged by the Raptors. But after a review, the call was upheld.\n\nBoston got a shot-clock violation on its next trip down the floor, but Lowry turned it over on Toronto's ensuing possession when his one-handed pass along the baseline sailed out of bounds with 45 seconds remaining.\n\nThe Celtics closed out the final 9:07 of regulation on a 30-17 run.\n\nComing off a 34-point game in Toronto's season-opening win over New Orleans on Tuesday, Siakam also started slow. He missed his first four shots and was scoreless in the first period before he got a finger roll to fall just before halftime.\n\nTIP-INS\n\nRaptors: Hollis-Jefferson and McCaw (sore right knee) sat for the second straight game, but Nurse said one or both could be ready to go on Saturday.\n\nCeltics: Daniel Theis left the game in the second quarter with a sprained left ankle, but returned in the third period. . Enes Kanter (left knee contusion) Tacko Fall (concussion protocol) and Romeo Langford (sore right knee) were both inactive.\n\nCHALLENGE\n\nCeltics coach Brad Stevens is 1-0 in using the coach's challenge this season.\n\nHe successfully challenged a foul called on Williams as he contested a 3-point attempt by Gasol from the corner with 0.3 seconds. Replay appeared to show Williams whiff on his contest of Gasol's attempt. The NBA Replay Center agreed, prompting a jump ball.\n\n\"Exhilarating,\" Stevens said of winning the challenge.\n\nROTATING BIG MEN\n\nStevens said they will likely have a rotating center spot early throughout this season.\n\nEven before Enes Kanter was injured in the opener, he said the expectation was for the center position to often vary by opponent.\n\n\"We'll see how we go, night to night, who is the best option to look at,\" Stevens said.\n\nTheis started Friday and played 14 minutes. Robert Williams III logged 14 minutes off the bench.\n\nUP NEXT\n\nRaptors: At the Bulls on Saturday\n\nCeltics: At the Knicks on Saturday.\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995959.194425
}