{
  "game_id": "0022200833",
  "espn_id": "401468988",
  "date": "Feb 09, 2023",
  "matchup": "CHI @ BKN",
  "headline": "Dinwiddie has 25 in Brooklyn return, Nets beat Bulls 116-105",
  "body": "NEW YORK -- — Spencer Dinwiddie scored 25 points in his first game since returning to Brooklyn and the Nets beat the Chicago Bulls 116-105 on Thursday night, hours after trading superstar Kevin Durant to Phoenix.\n\n\r\n              Joe Harris had 18 points, and Yuta Watanabe chipped in 14 points in 22 minutes off the bench. Dorian Finney-Smith, who came with Dinwiddie from Dallas in the trade for Kyrie Irving, had nine points and nine rebounds in his Nets debut.\n\n\r\n              “We just found a way,” Nets coach Jacque Vaughn said. “No panic from our guys. I thought we did a really good job of focusing on the game plan. It’s great to see us really lock in, especially at the end of the game.”\n\n\r\n              It was Dinwiddie’s first game in a Nets uniform since Dec. 27, 2020. He spent five seasons with the team and returned with 18 points in the second half. \n\n\r\n              “The entire last four or five days have been weird for me,” Dinwiddie said. “If I was going to revisit a spot, out of the three I’ve been at, it would definitely be here, unequivocally.”\n\n\r\n              Zach LaVine scored 38 points and DeMar DeRozan had 14 for Chicago, which lost its second straight and fell to 10-18 on the road. \n\n\r\n              “Every single day that goes by we have less opportunity to take on this challenge,’’ DeRozan said. “The room for error is getting slimmer and slimmer. It’s on us to realize it.’’\n\n\r\n              The Durant trade was agreed to in the early hours of the morning Thursday then announced shortly before tipoff. Brooklyn traded Durant and forward T.J. Warren for Cam Johnson, Mikal Bridges, Jae Crowder — who was subsequently flipped to Milwaukee for two second-round selections — and four first-rounders (2023, 2025, 2027, 2029) plus a pick swap in 2028.\n\n\r\n              Durant, a 13-time All-Star who was slated to represent the Nets at the upcoming All-Star Game in Utah, averaged 29 points per game over 129 games for Brooklyn, but missed time in each of his four seasons with the Nets. His trade followed that of Irving on Sunday.\n\n\r\n              “I’m not going to sugarcoat it, it’s always difficult when you’re trading a player of that stature and that ilk,” Nets general manager Sean Marks said. “My job as GM and our job as a front office is to try and bring in that caliber of talent. So those decisions are not easy, they come with a lot of thought, a lot of process on systemic debriefs and discussions that go along with that.”\n\n\r\n              Playing short-handed and in danger of losing more ground in the Eastern Conference playoff race, the Nets snapped a two-game skid with a 20-6 fourth-quarter run, keyed by Dinwiddie and Watanabe. Dinwiddie scored 13 in the fourth and Watanabe hit a pair of 3s. \n\n\r\n              Brooklyn, which is 29th in the NBA in rebounds per game, also outrebounded Chicago 49-46, winning the rebounding battle for the first time in 16 games.\n\n\r\n              “We only gave up 21 points in the fourth, and that was with ((Watanabe) on the floor finishing for us,” Vaughn said. “I think we saw the versatility and size come into play tonight where we didn’t get destroyed rebounding-wise and shot-discrepancy.”\n\n\r\n              Brooklyn looked sluggish from the outset, shooting just 28.6% from the field in the first quarter, and Chicago capitalized. LaVine scored 12 in the first quarter, and the Bulls used a 16-2 run to build a 13-point advantage early in the second.\n\n\r\n              But the Nets heated up from the outside, making 8 of 12 3-pointers, led by Harris’ six in the second. Brooklyn led by as many as seven and took a 53-50 advantage into halftime.\n\n\r\n              “I think everybody kind of was trying to figure out each other and how we were going to be playing,” Harris said. “Once that started and the rhythm got there and everybody was able to kind of settle in, we started playing really well and played really well together.”\n\n\r\n              Brooklyn built an 11-point advantage early in the third. But Chicago scored 30 of the quarter’s final 44 points, keyed by LaVine’s 14 in the frame.\n\n\r\n              TIP-INS\n\n\r\n              Bulls: The Bulls were one of just two teams that did not make a trade before Thursday’s 3 p.m. EST deadline. “It’s us vs. everybody,” LaVine said after the game. … DeRozan (right-hip soreness) returned after missing Chicago’s game in Memphis on Tuesday. \n\n\r\n              Nets: Bridges and Johnson were on the Brooklyn bench but didn’t dress due to the trade’s late announcement. It was Bridges’ first missed game since high school. … Cam Thomas, who scored 134 points over Brooklyn’s previous three games, had his streak of three straight 40-point games snapped. He finished with 20 points. … Center Nic Claxton missed the game, his fourth of the season, with a hamstring injury.\n\n\r\n              UP NEXT\n\n\r\n              Chicago: At Cleveland on Saturday\n\n\r\n              Brooklyn: Host Philadelphia on Saturday",
  "source": "espn_api",
  "crawled_at": 1764994482.153939
}