{
  "game_id": "0022200285",
  "espn_id": "401468440",
  "date": "Nov 25, 2022",
  "matchup": "DEN @ LAC",
  "headline": "Gordon scores 29, Nuggets beat short-handed Clippers 114-104",
  "body": "LOS ANGELES -- — Denver coach Michael Malone knew when the schedule came out that his team was going to have to be successful again on the road if it was going to be contend in the Western Conference.\n\n\r\n              So far, the Nuggets are living up to Malone's goal of being road warriors.\n\n\r\n              Behind Aaron Gordon's 29 points and an additional 19 from Jamal Murray, the Nuggets beat the short-handed Los Angeles Clippers 114-104 on Friday night for their league-best eighth road win.\n\n\r\n              Denver has played 13 of its first 19 on the road and gone 8-5 after having a franchise-record 25 wins away from the friendly confines of Ball Arena last season.\n\n\r\n              “If you’re winning at that level on the road, you know you’re a good team. Our challenge now is to go home and take care of business,” Malone said after the Nuggets won their second straight and third in their last four games.\n\n\r\n              Nikola Jokic added 19 points, 13 rebounds and six assists for the Nuggets, who led by 21 at one point during the fourth quarter with a run of 10 straight points midway through the period.\n\n\r\n              John Wall had a season-high 23 points for the Clippers, who were down to 10 players with Kawhi Leonard, Paul George and Luke Kennard out due to injuries. Leonard missed his second straight game after he sprained his right ankle Monday night against Utah. George (right hamstring) missed his third straight game and Kennard (right calf) has been out the last four.\n\n\r\n              Terance Mann added 16 points and Marcus Morris Sr. had 15.\n\n\r\n              The Clippers had 11 turnovers in the first half, but only three in the final 24 minutes.\n\n\r\n              “We were being too casual with the basketball in the first half, but addressed that at halftime,” coach Tyronn Lue said. “In the second half we had our chances, and got it to seven. The margin of error is very slim so we got to take advantage of those opportunities. But I thought we did some good things and we've got some things we’ve got to clean up.”\n\n\r\n              Denver was down to 10 players in Wednesday’s win over Oklahoma City but was bolstered by the returns of Murray and Ish Smith to the lineup.\n\n\r\n              “It feels like we’re starting to put something together. So this is something to build on,” said Gordon, who scored 19 points in the second half.\n\n\r\n              The game was tied at 18 midway through the first quarter before the Nuggets scored nine straight points to lead the rest of the way.\n\n\r\n              Denver extended its advantage to 64-52 at halftime and led by 17 with 2 minutes remaining in the third after a pair of free throws by Vlatko Cancar made it 85-68. The Clippers made a late run to get it to 87-77\n\n\r\n              TIP-INS\n\n\r\n              Nuggets: Michael Porter Jr. (heel), Jeff Green (knee), Bones Hyland (illness) and Payton Watson (illness) did not play. ... Cancar had 13 points coming off the bench. ... Murray also had nine assists. ... Denver had a 21-4 advantage in second-chance points.\n\n\r\n              Clippers: Robert Covington had 12 points, including a pair of 3-pointers and reached 1,200 for his career. ... Norman Powell had 11 points off the bench. ... Los Angeles was 19 of 34 on free throws, with the 55.9% rate being its second-lowest of the year.\n\n\r\n              UP NEXT\n\n\r\n              Nuggets: Host the Houston Rockets on Monday.\n\n\r\n              Clippers: Host the Indiana Pacers on Sunday afternoon.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994728.0318358
}