{
  "game_id": "0021500965",
  "espn_id": "400828852",
  "date": "Mar 11, 2016",
  "matchup": "HOU @ BOS",
  "headline": "Harden's 32 help Rockets end Celtics' home streak 102-98",
  "body": "BOSTON -- A month ago, Rockets interim coach J.B. Bickerstaff referred to his underperforming group as \"a broken team.\"\nA win over one of the NBA's hottest teams could help them get closer to figuring out their issues.\nJames Harden scored 32 points, including Houston's final eight, and the Rockets snapped the Boston Celtics' 14-game home winning streak with a 102-98 victory on Friday night.\n\nMichael Beasley added 18 points and eight rebounds, and Dwight Howard finished with 12 points and 12 rebounds for Houston, which has won three straight -- all on the road.\nBickerstaff said he feels as though the uneasiness that existed before the All-Star break has subsided for a team that knows it will need to fight to remain a playoff team.\n\"As soon as we came back from the break, we wiped everything that happened before that out,\" Bickerstaff said. \"My focus was on the 27 games we had remaining and we wanted to play the right way. We have the willingness to share, we have the willingness to (play) defense. There has been a comradery and togetherness.\n\"We'll be even better in the weeks to come but we are taking steps in the right direction now.\"\nThe Rockets led by 11 in the third quarter, before seeing that cushion cut to two points in the fourth.\nIsaiah Thomas led the Celtics with 30 points, but had six turnovers. Jared Sullinger added 24 points and 12 rebounds. He had only one turnover in his previous four games.\nBoston struggled from the field all night, shooting 37 percent and committing 15 turnovers. The Celtics were also outscored 60-46 in the paint in their first home loss since Jan. 6.\n\"That takes a hit on you when other guys are making tough shots and you're getting the shots you want, but you can't knock them in,\" Thomas said.\nBoston coach Brad Stevens made an adjustment late in the third quarter, inserting rookie Terry Rozier into the lineup. Rozier started the fourth quarter and was active, knocking down an early 3-pointer handing out a trio of assists before heading to the bench with about four minutes to play.\nIt helped lessen the damage done by Beasley, who scored 10 of Houston's first 12 points of the quarter.\nThe Rockets continued to be aggressive, and a free throw by Harden gave the Rockets a 97-91 lead with 2:33 remaining.\nIt stayed that way when a missed step-back jumper by Harden led to an inadvertent whistle during a scramble for the rebound at the 1:11 mark.\nAn ensuing jumpball between Howard and Sullinger was controlled by Houston, and Harden knocked down a 19-footer with less than a minute left that got the lead back to eight.\n\"It's getting there,\" Harden said. \"We have one more game tomorrow to finish the road trip off the right way.\"\nTIP-INS\nRockets: Have scored 100 or more points in 45 of 54 games under Bickerstaff.\nCeltics: Are 6-21 when trailing entering the fourth quarter. ... F Kelly Olynyk missed his 11th consecutive game with a right shoulder sprain. The 7-footer has been out since suffering the injury Feb. 10. He recently returned to going through light practice activity. The Celtics are now 7-4 without him.\nMASTERING SMALL BALL: The Rockets outplayed one of the quickest teams in the Eastern Conference by matching their small alignment, which has been even smaller lately with Olynyk out with the injured shoulder. \"The small lineup that we've played down the stretch most of these games is getting familiar with each other,\" Bickerstaff said. \"They know their spots to be in, they know the expectations of what they need to do with that unit to be successful.\"\nINJURY UPDATE: Celtics starting F Jae Crowder played just 21 minutes Friday before leaving with what he said afterward is a high right ankle sprain. He is scheduled to have a precautionary MRI on Saturday. \"I was on a fast break, and I came down in an awkward way, and I got up and I didn't feel good,\" Crowder said.\nUP NEXT\nHouston: at Charlotte on Saturday.\nBoston: at Indiana on Tuesday.",
  "source": "espn_api",
  "crawled_at": 1764994612.1588721
}