{
  "game_id": "0022400898",
  "espn_id": "401705464",
  "date": "Mar 05, 2025",
  "matchup": "LAC vs. DET",
  "headline": "Harden scores 50 points for 1st time with Clippers as Los Angeles beats Pistons 123-115",
  "body": "INGLEWOOD, Calif. -- — James Harden scored 50 points, his 24th career 50-point game and first with the Clippers, as Los Angeles beat the Detroit Pistons 123-115 on Wednesday night.\n\n\r\n              Harden scored 23 in the first quarter and ended up with the eighth 50-point game in franchise history, the first since Lou Williams on Jan. 10, 2018, at Golden State.\n\n\r\n              Bogdan Bogdanovic added 23 points and Ivica Zubac had 22 points and 11 rebounds for the Clippers, who played without Kawhi Leonard (knee) and Norman Powell (hamstring) on the second night of back-to-back games.\n\n\r\n              Cade Cunningham had 37 points and 10 assists for the Pistons, who lost for just the second time in 12 games. \n\n\r\n              Takeaways\r\n              Pistons: In the midst of their best stretch since the 2007-08 season, the Pistons shot 52% but had their two-game win streak snapped.\n\n\r\n              Clippers: Los Angeles had lost three straight and six of seven after its collapse against Phoenix on Tuesday, so Harden's throwback performance was a timely one. \n\n\r\n              Key moment\r\n              With the Clippers trailing by two midway through the fourth quarter, Bogdanovic made consecutive 3-pointers and then drew an offensive foul before Harden got the next four points for a 10-0 run and 107-99 lead.\n\n\r\n              Key stat \r\n              Harden joined Bob McAdoo, World B. Free and Williams as the only players in franchise with at least four 40-point games in a season.\n\n\r\n              Up next\r\n              The Pistons visit Golden State on Saturday. The Clippers host New York on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997938.2152991
}