{
  "game_id": "0021901289",
  "espn_id": "401224764",
  "date": "Aug 09, 2020",
  "matchup": "POR vs. PHI",
  "headline": "Lillard drops 51 as Trail Blazers top 76ers; Embiid injured",
  "body": "LAKE BUENA VISTA, Fla. --  Everything is back to normal for Damian Lillard.\n\nThe All-Star point guard scored 51 points after a frustrating finish a night earlier, and the Portland Trail Blazers beat the Philadelphia 76ers 124-121 on Sunday.\n\nOn Saturday against the Los Angeles Clippers, Lillard missed a pair of free throws with 18.6 seconds to go and a 3-pointer with 9.5 seconds left in a 122-117 loss. Clippers players Paul George and Patrick Beverley were seen laughing at Lillard's misfortune.\n\nLillard got the last laugh Sunday by scoring 18 points in the fourth quarter.\n\n\"It wasn't really so much my performance yesterday and I wanted to perform a certain way today,\" he said. \"It was like, we let one slip that we should have had yesterday, and I'm a big part of why it got away from us. So tonight, I was like `That's not going to happen.\"\n\nPortland bounced back and pulled within a half-game of Memphis for eighth place in the Western Conference. The Trail Blazers increased their chances of qualifying for the play-in series, which will start Saturday.\n\nThe 76ers lost much more than the game. All-Star center Joel Embiid left in the first quarter with what the team called a left ankle injury, and he did not return. He contested a shot, then backed up and stepped awkwardly into the stanchion. He had been averaging 30 points per game since the restart.\n\n76ers coach Brett Brown wouldn't say whether Embiid would miss time.\n\n\"I'm going to learn more physically,\" Brown said. \"I don't know enough to comment on it.\"\n\nIt was more bad injury news for the 76ers. All-Star point guard Ben Simmons is out indefinitely with an injured left knee.\n\nJosh Richardson scored a season-high 34 points and Alec Burks added 20 for Philadelphia. The 76ers would have moved into a tie with the Indiana Pacers and Miami Heat for fourth place in the Eastern Conference standings with a win.\n\nWithout their stars, the 76ers fell behind by 17 in the second quarter and trailed 67-58 at halftime.\n\nThe game tightened up late. Philadelphia's Al Horford hit a 3-pointer to trim Portland's lead to 122-121. Portland's Jusuf Nurkic made two free throws with 10.2 seconds remaining to put his team up three. Richardson missed a 3-pointer for Philadelphia, and the 76ers couldn't get another shot off after a scramble for the rebound.\n\n\"I thought our guys fought,\" Brown said. \"I really thought the spirit of the group was fantastic. We called upon many different players that I think played with a spirit and a passion that you're proud of.\"\n\nTIP-INS\n\n76ers: Horford was issued a technical foul in the third quarter. He scored 15 points. ... Burks scored 15 points in the fourth quarter.\n\nTrail Blazers: Lillard scored a basket in the first quarter when he drove to the hoop and his pass bounced off Philadelphia's Tobias Harris, off the backboard and into the basket. ... Carmelo Anthony scored 20 points and moved into 15th place on the NBA's career scoring list.\n\nQUOTABLE\n\nLillard on dealing with pressure: \"I'm willing to risk it all,\" he said. \"If we lose, I can deal with it -- coming up short like yesterday. When we win, it's like, `Let's do it again.' I enjoy it. It's fun.\"\n\nAGGRESSIVE APPROACH\n\nLillard made 16 of 28 shots and 15 of 16 free throws.\n\n\"I did tell myself coming into the game I coming out off the rip as soon as the ball gets tossed in the air, I'm going. I'm attacking,\" he said. \"And that was that.\"\n\nSTAT LINES\n\nLillard made 5 of 6 field goals and 5 of 6 free throws in the fourth quarter.\n\nUP NEXT\n\n76ers: Play the Phoenix Suns on Tuesday.\n\nTrail Blazers: Play the Dallas Mavericks on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996601.46427
}