{
  "game_id": "0021900747",
  "espn_id": "401161389",
  "date": "Feb 03, 2020",
  "matchup": "MIA vs. PHI",
  "headline": "Butler scores 38, Heat roll past 76ers 137-106",
  "body": "MIAMI --  Jimmy Butler shook off the notion that a game against his former team should carry extra significance.\n\nThe win was all that mattered.\n\nButler scored a season-high 38 points before getting the fourth quarter off, and the Miami Heat scored a franchise-record 81 points in the second half to beat the Philadelphia 76ers 137-106 on Monday night.\n\n\"I'm never worried about offense,\" Butler said. \"Hell, I'm never worried about defense. I'm only worried about winning.\"\n\nGoran Dragic scored 24 points for Miami, Duncan Robinson scored 19 and All-Star Bam Adebayo finished with 18 points, 11 assists and eight rebounds for the Heat. Derrick Jones Jr. added 15 points for Miami, which set season-highs for points and victory margin.\n\nMiami also won the season series, 3-1.\n\n\"We just want to get better as the season goes on and we knew that this game was important just from the standpoint of being able to go up 3-1 against one of the teams we're jostling against in this competitive Eastern Conference,\" Heat coach Erik Spoelstra said. \"It matters.\"\n\nFor Philadelphia, it was more of the same. The team with an NBA-best 22-2 home record lost for the 10th time in its last 12 road games. Joel Embiid led the 76ers with 29 points and 12 rebounds, and Mike Scott scored 17 points -- most of it off 5-of-7 shooting from 3-point range -- in 18 minutes.\n\nBen Simmons had 16 points for Philadelphia.\n\n\"Second half we were pretty much nonexistent all around,\" Philadelphia's Tobias Harris said. \"We just never made our mark on the defensive end in the second half.\"\n\nThe 76ers are winning home games by an average of 10 points. But on the road, they've been beaten nine times by double-digits already this season -- and this 31-point defeat came only two days after what had been a season-worst 21-point loss at Brooklyn on Saturday.\n\n\"We're not playing defense the way we can play defense,\" 76ers coach Brett Brown said. \"It starts and almost stops there for me.\"\n\nButler was 14 for 20 from the field and 8 for 8 from the foul line. The Heat committed only three turnovers; its previous franchise-low for a game was four, set against Orlando on Jan. 24, 2009.\n\n\"We want Jimmy to be aggressive,\" Dragic said. \"He's our leader.\"\n\nTIP-INS\n\n76ers: Simmons tried his first 3-pointer since Dec. 10, a beat-the-clock 26-footer at the end of the first quarter that missed. He's now 2 for 23 in his career from beyond the arc. ... Embiid had 11 of Philadelphia's first 17 points. He then had three of the 76ers' next 37 points. ... Former Heat guard Josh Richardson (left hamstring strain) did some on-court work Monday but missed his fifth straight game.\n\nHeat: It's unknown if Justise Winslow, who has missed 27 of Miami's last 28 games with a bone bruise in his lower back, will be on the plane Tuesday when Miami leaves for a five-game trip that will last until the start of the All-Star break. ... Butler had never had 38 points through three quarters. He had 37 points after 36 minutes in a game for Chicago in April 2017.\n\nINJURIES\n\nMeyers Leonard, one of only two Heat players -- Adebayo is the other -- to have started all 49 games this season, needed help to the locker room early in the third quarter after spraining his left ankle. And Tyler Herro left after 10 minutes with right foot soreness, which he tried to play through after being taped up in an unusual way before the game. Spoelstra said Herro has been dealing with the issue, described as a sprain, for about 10 days.\n\nBIG LEAD\n\nMiami's biggest lead was 35. The only game where the Heat had a bigger lead this season was against Houston on Nov. 3, when they led by 41.\n\nUP NEXT\n\n76ers: Visit Milwaukee on Thursday.\n\nHeat: Visit the L.A. Clippers on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995500.413465
}