{
  "game_id": "0022200559",
  "espn_id": "401468714",
  "date": "Jan 02, 2023",
  "matchup": "DET @ POR",
  "headline": "Grant scores 36, Blazers rout Pistons in Payton's debut",
  "body": "PORTLAND, Ore. -- — Jerami Grant scored 36 points against his former team, Anfernee Simons added 30 and the Portland Trail Blazers beat the Detroit Pistons 135-106 on Monday night.\n\n\r\n              Gary Payton II played 14 minutes in his Portland debut, finishing with seven points, four assists and two steals. The son of Hall of Fame guard Gary Payton missed the first 35 games this season following surgery for a core muscle injury and called the rehabilitation process “frustrating.”\n\n\r\n              He signed with the Trail Blazers as a free agent after winning an NBA championship with the Golden State Warriors last June. \n\n\r\n              “I was tired of watching all my guys out there. The only way I can help out there is playing,” Payton said. “That was the biggest part of the frustration, that I can’t be out there in the moment. Now that I’m here, we had a hell of a game. We were just flying everywhere. The energy is contagious, it just gets everybody going.” \n\n\r\n              Grant was 12 for 17 from the field, including 5 of 8 from 3-point range, and Payton’s debut buoyed a Blazers team that had lost four of five. \n\n\r\n              Damian Lillard had 19 points, 10 assists and four steals for Portland.\n\n\r\n              “They were on a mission,” Pistons coach Dwane Casey said. “We didn’t meet their intensity. Especially on the offensive end, we got stagnant. Then defensively, we didn’t lock in on our switching.” \n\n\r\n              Bojan Bogdanovic scored 21 points to lead Detroit, and Alec Burks added 19 off the bench. \n\n\r\n              Like his father, Payton attended Oregon State. He entered to an ovation and connected on his first shot — a 3-pointer from the left corner. To start the second quarter, Payton threw a lob to Shaedon Sharpe for an alley-oop. Late in the third, Payton dove on a loose ball, which led to Portland free throws and raucous cheers from the crowd as the Blazers extended their lead. \n\n\r\n              “It was extremely exciting,” Grant said of Payton’s return. “He adds another dynamic to our team.” \n\n\r\n              Finally, to start the fourth period, Payton stole an inbounds pass and scored to give Portland a 104-82 cushion. The Blazers led by as many as 34. \n\n\r\n              “Obviously, it’s good to get those steals and points. But it sets a tone with the team he’s out there playing with,” coach Chauncey Billups said of Payton’s energy. ”You see a guy doing those type of things, diving on the floor and kicking it up for the steal — if you don’t match that level of intensity, you look bad. It changes things for you.” \n\n\r\n              Portland shot 57% from the field and went 14 for 31 (45%) from 3-point distance, while the Pistons were 6 of 18. \n\n\r\n              With center Jusuf Nurkic in early foul trouble, replacement Drew Eubanks finished with 10 points and 10 rebounds for the Blazers. They led 62-51 at halftime and pushed the margin to 22 in the third quarter.\n\n\r\n              Nurkic had three points and two rebounds in 14 minutes. After going to the bench, he was ruled out for the remainder of the game due to an illness that kept him out of Portland’s previous game. \n\n\r\n              Payton’s arrival comes at a time when Portland’s defensive struggles have been a focus in the locker room. \n\n\r\n              “We had a lot of heart-to-hearts over the last couple of games about what we need to do to get back to what we were doing at the beginning of the season,” Eubanks said. “I just like how we were able to come out and implement those things. The real test for us now is if we can do it on the road in these next three and solidify those defensive habits.” \n\n\r\n              WAITING GAME\n\n\r\n              The Trail Blazers were thrilled to finally have Payton available.\n\n\r\n              “It’s been a tough little rehab for him, so I know he’s probably feeling really good about it,” Billups said before the game. “We all, coaches, players, everybody in the organization is happy to have him. He’s our big free-agent acquisition this year.”\n\n\r\n              UP NEXT\n\n\r\n              Pistons: Visit the Golden State Warriors on Wednesday night.\n\n\r\n              Trail Blazers: Visit the Minnesota Timberwolves on Wednesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994367.554104
}