{
  "game_id": "0021700080",
  "espn_id": "400974831",
  "date": "Oct 28, 2017",
  "matchup": "MEM vs. HOU",
  "headline": "Parsons, Grizzlies' bench leads Memphis past Houston",
  "body": "MEMPHIS, Tenn. --  Ten days ago, the boos rained down on a struggling Chandler Parsons as the Memphis Grizzlies fans expressed their displeasure with the lack of return on the team's $94 million investment.\n\nNo one booed Parsons on Saturday night.\n\nParsons finally gave Memphis fans what they've waited for since his signing 16 months ago, scoring 24 points on accurate shooting to lead the Grizzlies to a 103-89 victory over the Houston Rockets.\n\n\"That was awesome. I've been waiting on tonight for a really long time,\" said Parsons, who was 9 of 11 from the field, including 6 of 8 from 3-point range. \".It's all about confidence with me. I felt like everything I threw up there was going to go in.\"\n\nParsons, who has struggled and battled injuries since signing with the Grizzlies last season and was jeered in their home opener, was part of a dominating Memphis bench effort. By the time Rockets coach Mike D'Antoni cleared his bench with just under 4 minutes left and Memphis leading by 19, the Grizzlies held a 62-15 advantage in bench points.\n\nThe reserves are made up of players such as Tyreke Evans, Mario Chalmers, rookie Dillon Brooks -- all of whom were not with the team last year -- and Parsons.\n\n\"Our chemistry is perfect right now, just because most of our second unit, we're coming back from injuries. Coming back from rehab,\" said Chalmers, who had 15 points, four assists and two steals. \"That's the thing we have in common. We're all hungry.\"\n\nThe Rockets shot 38 percent for the game, were 14 of 38 from outside the arc (37 percent) and committed 19 turnovers, leading to 23 points.\n\nRyan Anderson led the Rockets with 22 points, while James Harden added 20 points and eight assists, but was 6 of 18 from the field, including 2 of 9 from 3-point range. Clint Capela had 12 points and 12 rebounds for the Rockets, who were playing their fourth game in six days, including three on the road.\n\n\"They played really well, so that's the biggest thing,\" D'Antoni said of Memphis. \"But then having said that, I thought we ran out of steam, and we've got guys playing a lot of minutes. We lost our legs.\"\n\nTIP-INS\n\nRockets: D'Antoni coached the game despite the death of his father, Lewis, earlier in the day. Lewis D'Antoni, 103, was a successful high school coach in West Virginia. ... F Trevor Ariza and C Nene both returned to action after missing the last two games: Ariza with a left midfoot sprain and Nene with left Achilles soreness. .The 89 points were the fewest scored by the Rockets under D'Antoni, one fewer than the 90 scored in their loss to Memphis on Monday.\n\nGrizzlies: Parsons' 24 points were his best in 39 games with Memphis. ... Parsons also recorded a season high in minutes with almost 19. ... Rookie Ivan Rabb made his first appearance of the season in the closing minute. .Chalmers 15 points was a season high.\n\nALL HAIL THE RESERVES\n\nThe bench performance came at an opportune time. No Memphis starter reached double figures. The Grizzlies reserves have outscored the opponents bench 246-126 through the first six games.\n\nMISSING GORDON\n\nHouston played without starting guard and second-leading scorer Eric Gordon, who sat out with a stomach illness -- a huge blow for the Rockets. \"If Eric could have went, then that would have given us one more guy that can make a play. When you don't have that, then it just snowballed away,\" D'Antoni said.\n\nARIZA'S RETURN\n\nD'Antoni called Ariza's return after two games \"remarkable. We thought he would be out 3-4 weeks.\" Ariza, who finished with 10 points, said he is just trying to find his rhythm. \"I'm fine. I didn't feel anything.\" Asked about the quick recovery, \"Good genes, I guess.\"\n\nUP NEXT\n\nROCKETS: Host the Philadelphia 76ers on Monday\n\nGRIZZLIES: Close out a four-game homestand on Monday against the Charlotte Hornets\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764992811.9320729
}