{
  "game_id": "0022200401",
  "espn_id": "401468556",
  "date": "Dec 11, 2022",
  "matchup": "MIL @ HOU",
  "headline": "Jalen Green scores 30 points, Rockets beat Bucks 97-92",
  "body": "HOUSTON -- — Jalen Green had 30 points and seven rebounds, Kevin Porter Jr. added 18 points and seven assists and the Houston Rockets beat the Milwaukee Bucks 97-92 on Sunday night to extend their home-winning streak to four games.\n\n\r\n              Houston was coached by assistant coach John Lucas with head coach Stephen Silas away from the team following the death of father and long-time NBA player and coach Paul Silas.\n\n\r\n              “That’s for Coach,” Lucas said. “That one’s for him.”\n\n\r\n              Green was 12 of 21 shooting, including 3 of 6 on 3-pointers.\n\n\r\n              “I work with him every day,” Lucas said. “I know how good he is. The problem is being patient and for him to be patient, but he’s growing.”\n\n\r\n              Kenyon Martin Jr. had 10 points and five rebounds for the Rockets. Houston shot 44% and was 6 of 27 on 3-pointers. \n\n\r\n              “That’s a good win for us,” Lucas said. “We had a good day of practice the other day. We talked about accountability, talked about being professional and starting to grow up. … We’re better than young. We’re not great, but we are better than young. We’re going to make some mistakes, but I think we did a great job.”\n\n\r\n              The Rockets made 11 of 12 free throws, going 5 of 6 in the final minute to put the game away.\n\n\r\n              “From the beginning we’ve been preaching about being a defensive team and making that our identity,” Porter said. “Each game we’ve been getting better in moments and aspects of the game, but tonight it was our defensive end, rotating that low man and just helping the helper. You saw a lot of that tonight, and we were just consistent tonight.”\n\n\r\n              Jrue Holiday had 25 points and eight assists for Milwaukee, Bobby Portis added 17 points and 15 rebounds and Giannis Antetokounmpo had 16 points and 18 rebounds. The Bucks had won four in a row.\n\n\r\n              Antetokounmpo scored his 15,000th point in the second quarter.\n\n\r\n              The Bucks shot 37% and were 12 of 43 on 3-pointers. Milwaukee committed 16 turnovers. Houston outscored Milwaukee, 56-36, in points in the paint.\n\n\r\n              “We didn’t shoot it well enough tonight,” Bucks coach Mike Budenholzer said. “We got a lot 3s up. We like that. We think that’s good. Overall, we think that’s going to be good for us in the long run, but tonight, we weren’t able to make enough 3s to take away their willingness to put multiple bodies and people in the paint.”\n\n\r\n              Green made two free throws with 34 seconds remaining to give Houston a two-point lead. Following a Milwaukee timeout, Grayson Allen turned it over on a lob pass to Antetokounmpo, and Antetokounmpo fouled Green, who made one of two free throws with 27 seconds left.\n\n\r\n              Antetokounmpo missed a layup and fouled Jabari Smith Jr. on the rebound. Smith made two free throws with 19 seconds remaining to give Houston a 97-92 lead. Portis missed a 3-pointer with 14 seconds left, and Martin got the rebound to ice it.\n\n\r\n              “I don’t think that’s not uncommon or unusual, everybody’s focused on Giannis,” Budenholzer said of the Rockets’ late game defense. “We had a couple opportunities and didn’t deliver, didn’t take care of the ball, didn’t make shots. We didn’t play good enough to win.”\n\n\r\n              TIP-INS\n\n\r\n              Bucks: F Khris Middleton left early in the second quarter with a left ankle sprain and did not return. He was scoreless in six minutes. … Allen scored 11 points.\n\n\r\n              Rockets: Houston recalled G Josh Christopher, Trevor Hudgins and Darius Day from their NBA G League affiliate Rio Grande Valley. … Smith took Houston’s first free throws with 7:59 remaining in the third. \n\n\r\n              REMEMBERING PAUL SILAS\n\n\r\n              The Rockets held a moment of silence before the game in honor of Paul Silas.\n\n\r\n              “From the team, the coaching staff, all the basketball personnel, all our prayers and thoughts are with Coach and his family right now,” Lucas said to begin his pregame availability. “Paul Silas did a lot for basketball.”\n\n\r\n              UP NEXT\n\n\r\n              Bucks: Host Golden State on Tuesday night.\n\n\r\n              Rockets: Host Phoenix on Tuesday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994587.717321
}