{
  "game_id": "0022300086",
  "espn_id": "401584714",
  "date": "Oct 27, 2023",
  "matchup": "ORL @ POR",
  "headline": "Franz Wagner scores 23, Magic win their 2nd straight to open season 102-97 over the Trail Blazers",
  "body": "PORTLAND, Ore. -- — Orlando's final minutes against the Trail Blazers on Friday night might have gone differently for the Magic in years past. \n\n\r\n              While Orlando led by as many as 13 points in the fourth quarter, Portland closed the gap in the waning moments. In the end, the Magic won their second straight game to open the season, holding off the Blazers 102-97.\n\n\r\n              “I think today is one of those days where we can definitely learn from the last couple of minutes, but it definitely helps having been in those moments, and having a look at it in practice and on film, and seeing what decides those close games,\" said Franz Wagner, who led the Magic with 23 points. \"I think today we didn't do a great job with that, but we'll keep learning and keep looking at stuff we did wrong.” \n\n\r\n              Cole Anthony added 18 points off the bench for the Magic, playing the first of a four-game western road trip. \n\n\r\n              Shaedon Sharpe, starting in place of the injured Anfernee Simons, had 24 points for the Trail Blazers. Simons was injured in Portland's opener and will miss up to six weeks. \n\n\r\n              “I put the work in so I'm not really fazed by anything,” Sharpe said about stepping into Simon's role. “I trust my teammates. I like the group of guys we've got here.”\n\n\r\n              Portland trailed 82-80 going into the fourth quarter after Moritz Wagner’s dunk for Orlando. The Magic pushed the lead to 97-84 after Franz Wagner's 3-pointer, but the Blazers got within 99-93 with 1:33 left. \n\n\r\n              After Franz Wagner made one of two free throws, Deandre Ayton's tip-in made it a five-point game but Portland couldn't get closer. \n\n\r\n              Magic coach Jamahl Mosely called a timeout in those final minutes. \n\n\r\n              “The guys came into the huddle and the first thing they said was `We've been here before, right? This is what we work on in practice. We've been through these two-minute drills,'” Mosley said. \n\n\r\n              The Magic routed Houston 116-86 in their opener at home on Wednesday. It was the largest margin of victory on opening night in team history and six Magic players were in double figures. \n\n\r\n              The Blazers announced before the game that Simons will miss four-to-six weeks with a thumb injury that requires surgery. He tore the ulnar collateral ligament in his right thumb during Wednesday’s 123-111 loss to the Los Angeles Clippers.\n\n\r\n              The absence of Simons stings as the Blazers embark on their first season without All-Star guard Damian Lillard, who was traded to the Milwaukee Bucks in the offseason. Simons, who averaged 18 points last season, was expected to fill the void.\n\n\r\n              Simons, wearing a splint on his thumb, addressed the crowd at Moda Center before Friday's game.\n\n\r\n              “We've got a lot of new faces and a lot of things to be excited about,\" Simons told the crowd. \"We're hoping we make you proud this season by the way we play.”\n\n\r\n              The Magic went up 31-26 in the opening quarter, but Sharpe pulled the Blazers in front 50-47 with 4:01 left in the first half with a jumper and a layup following Jerami Grant's steal. Skylar Mays added a layup for Portland. \n\n\r\n              Orlando closed the gap and tied it at 52 on Franz Wagner's 3-pointer before heading into halftime with a 63-55 lead. Sharpe led all players with 13 points in the half. \n\n\r\n              Paulo Banchero's jumper gave the Magic a 70-59 lead early in the second half before the Blazers pulled within 72-69 on Sharpe's 3-pointer. Banchero, last season's rookie of the year, finished with 14 points and seven rebounds. \n\n\r\n              Ayton had 14 points and 15 rebounds for Portland. \n\n\r\n              UP NEXT\n\n\r\n              Magic: The road trip continues on Sunday at the Los Angeles Lakers. \n\n\r\n              Trail Blazers: Visit the Philadelphia 76ers on Sunday. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996183.913119
}