{
  "game_id": "0022000892",
  "espn_id": "401307691",
  "date": "Apr 22, 2021",
  "matchup": "PHX @ BOS",
  "headline": "Walker ties season high with 32 points, Celtics beat Suns",
  "body": "BOSTON -- — A few days off went a long way for Kemba Walker. \n\n\r\n                    Walker matched his season high with 32 points and the Boston Celtics rolled to a 99-86 victory over the Phoenix Suns on Thursday night. \n\n\r\n                    Walker was 11 of 17 from the field, hitting five 3-pointers. The Celtics were without Jaylen Brown because of a sore left shoulder, and Jayson Tatum struggled shooting for the second straight game, going 3 of 17. He had 15 points and 11 rebounds. \n\n\r\n                    The Celtics (32-27) led by 21 points in the second half. They have won nine of their last 11. \n\n\r\n                    “I was just taking the shots available to me,” Walker said. “Some shots went in.”\n\n\r\n                    He also did it on the defensive end, drawing three charges on the night. \n\n\r\n                    “I want to win. And plays like that shows it,\" Walker said. \"I’m just trying to lead by example.” \n\n\r\n                    Coming off a victory in Philadelphia on Wednesday night, the Suns (42-17) dropped two games behind idle Utah Jazz for the best record in the NBA. Phoenix has the NBA's best road record at 19-8.\n\n\r\n                    Chris Paul had 22 points, eight rebounds and eight assists. Devin Booker finished with 15 points before fouling out with 4:37 left.\n\n\r\n                    Walker and Smart both sat out Monday night’s loss to Chicago with non-COVID-19 illnesses. Due to a rare late season break in the schedule, they had two extra days to recoup before Thursday’s matchup. \n\n\r\n                    Walker, who also hasn’t played in back-to-backs in order to rest the tender left knee that sidelined him for the first 11 games this season, looked rejuvenated. He connected on his first four field goals of the night, including three 3-pointers, during a 19-point first half. \n\n\r\n                    Almost every part of his game was working offensively, from creating space with the dribble for 3s, to breaking down defenders and getting in the lane for shorter jumpers or drawing fouls. \n\n\r\n                    He said the extra time off has given him a lift. \n\n\r\n                    “I’m feeling good,\" Walker said. \"Obviously, some days are going to better than others. But I’m feeling great. I’m doing great job of taking care of my body. It’s all about the upkeep.” \n\n\r\n                    Boston took a 66-45 lead in third quarter on a jumper by Tatum. The Suns responded with a 14-2 run and trailed 77-65 entering the fourth.\n\n\r\n                    A 3-pointer by Mikal Bridges got Phoenix to 95-86 with 1:29 left. But a steal and layup by Marcus Smart helped the Celtics close it out. \n\n\r\n                    “For 48 minutes they played longer and harder than us,\" Bridges said. “We can’t control making shots, but we can control playing harder than that team. We’ve just got to learn from it and get ready for the next game.” \n\n\r\n                    TIP-INS\n\n\r\n                    Suns: Scored 24 points off 23 Celtics turnovers. … Jae Crowder (sprained right ankle) and Abdel Nader (sore right knee) were both out. \n\n\r\n                    Celtics: Closed the second quarter on a 16-4 run. … Jaylen Brown (left shoulder bursitis), Evan Fournier (health and safety protocols) and Robert Williams (sore left knee) all sat out. Williams is day-to-day. Fournier could be back as early as this weekend, coach Brad Stevens said. … Romeo Langford took Brown’s place in the lineup, his second start of the season. \n\n\r\n                    ROUGH NIGHT\n\n\r\n                    The Suns expected to have a tough task coming off a narrow win at Philadelphia on Wednesday. And it was.\n\n\r\n                    It was a humbling night for the Suns, who shot just 41% from the field (36 of 88) and 6 of 35 from 3.\n\n\r\n                    “If you told me we’re going to hold Boston to 99 points, you’d take that,” Suns coach Monty Williams said. “We just couldn’t make a shot.” \n\n\r\n                    UP NEXT\n\n\r\n                    Suns: At Brooklyn on Sunday night.\n\n\r\n                    Celtics: At Brooklyn on Friday night.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997733.815964
}