{
  "game_id": "0021601165",
  "espn_id": "400900543",
  "date": "Apr 05, 2017",
  "matchup": "CHA vs. MIA",
  "headline": "Dragic, Heat top Hornets 112-99; pull into tie for 8th place",
  "body": "CHARLOTTE, N.C. --  There was a time in his career when Hassan Whiteside might not have reacted so well to a frustrating night.\n\nBut when Whiteside was whistled for a technical foul, the 7-footer channeled his anger and sparked the Miami Heat to a crucial 112-99 victory over the Charlotte Hornets on Wednesday night.\n\nHe got plenty of help from his teammates, too.\n\nGoran Dragic scored 33 points, and the Heat made a franchise-record 21 3-pointers -- six of those by James Johnson -- to pull back into a tie for eighth place in the Eastern Conference. Miami controls its own playoff destiny since it holds the head-to-head tiebreaker over Indiana for the final spot.\n\nJohnson was 6 of 7 from 3-point range and had 26 points, while Whiteside had a strong second half and finished with 13 points and 20 rebounds as the Heat dealt a near-fatal blow to Charlotte's playoff hopes. The loss drops the 10th place Hornets 2  1/2 games behind the Heat and Pacers with three games remaining.\n\n\"It's part of his growth,\" Heat coach Erik Spoelstra said of Whiteside. \"Who knows what would've happened two years ago?\"\n\nWhiteside hadn't scored and only had seven rebounds when he got into an altercation early in the third quarter with the Heat leading 61-58. While trying to corral a loose ball, Whiteside threw an elbow in the direction of Michael Kidd-Gilchrist, although in never landed. Cody Zeller stepped in to break things up, but a frustrated Whiteside shoved Zeller away, which resulted in a technical.\n\nThe incident seemed to ignite the sleeping giant.\n\nAfter Nic Batum made the free throw for the technical, the Heat went on a 14-0 run. Whiteside came alive with six points during that stretch, including a monster left-handed dunk, and dominated on the glass. The dunk seemed to release more than two quarters of frustration.\n\nWhen asked if technical foul angered him, Whiteside said: \"What do you think?\"\n\nWhen either team missed a shot from there on out, it seemed Whiteside was there to grab the rebound.\n\n\"To have an emotional, physical game where everybody was on edge, he was able to compartmentalize those emotions and transfer that into efficient play,\" Spoelstra said. \"He really became a force in the paint on both ends.\"\n\nSaid Whiteside: \"Coach told me, `Whiteside, we might need 20 rebounds from you.' So I said, `OK, check. Somebody ordered 20 rebounds.' So I had to deliver.\"\n\nAlthough Dragic knocked down 13 of 21 shots and had five 3-pointers, Hornets coach Steve Clifford said it was Whiteside was the difference in the game.\n\n\"He took over in the third quarter,\" Clifford said.\n\nJohnson was key, too.\n\nHe made two clutch 3-pointers in the fourth quarter to put the game away. Most of his six 3s came above the bend in the arc, where he normally shoots below 30 percent.\n\n\"He's a driver,\" Clifford said. \"... That's from a guy who you say you are going to live with him making that shot.\"\n\nSaid Johnson: \"I was just taking what they were giving. The team was finding me and the basket felt huge.\"\n\nBatum led Charlotte with 24 points, while All-Star Kemba Walker had 18 points on 6-of-17 shooting.\n\nTIP INS\n\nHeat: Improved to 27-10 since Jan. 13. ... Have won 22 of the last 28 games vs. Charlotte and have not lost a season series to the Hornets since the 2009-10 season.\n\nHornets: There was seemingly more elbow room on the Charlotte bench without 7-footer Patrick Ewing taking up real estate. Ewing left to become the head coach of Georgetown earlier this week. ... Williams made a three-quarters court shot to beat the buzzer at halftime.\n\nTIRED HORNETS\n\nClifford doesn't normally make excuses for his team, but said that fatigue contributed to the loss.\n\n\"We were exhausted,\" Clifford said. \"I mean, these games have been taxing. We've been playing every game like an elimination game.\"\n\nWILLIAMS FINISHING STRONG\n\nWilliams continues to finish the season strong, scoring 15 points and grabbing 12 rebounds for the Hornets. Williams had 11 double-doubles this season, eight of those coming in the last 17 games.\n\nUP NEXT\n\nHeat: At Toronto on Friday night.\n\nHornets: Face the Celtics on Saturday night in their final regular-season home game of the season.",
  "source": "espn_api",
  "crawled_at": 1764995459.861575
}