{
  "game_id": "401810045",
  "espn_id": "401810045",
  "date": "Nov 08, 2025",
  "matchup": "LAC vs PHX",
  "headline": "Booker barely misses his 1st regular-season triple-double, still leads Suns past Clippers 114-103",
  "body": "INGLEWOOD, Calif. -- — Devin Booker had 21 points, 10 rebounds and nine assists, and the Phoenix Suns held off the Clippers 114-103 on Saturday night for their second win over Los Angeles in three days.\n\n\r\n              Mark Williams scored 19 points for the Suns, who have won four of five. Phoenix kept a lead throughout the fourth quarter, and Booker's three-point play with 2:59 left got the Suns out of trouble after Los Angeles had trimmed the deficit to five.\n\n\r\n              Booker fell just short of his first triple-double in the regular season during his 11-year, 683-game career, failing to add a 10th assist after he returned to the game with 7:41 to play. The Suns' star guard got his only triple-double in Game 1 of the Western Conference finals in June 2021 — also against the Clippers.\n\n\r\n              Ivica Zubac had 21 points and 15 rebounds, and John Collins scored 19 in the short-handed Clippers' fourth straight loss. James Harden had 13 points and 13 assists, but went 2 of 10 on 3-point attempts.\n\n\r\n              The Suns beat the Clippers 115-102 in Phoenix on Thursday. The rivals have already met three times this season, with Phoenix winning twice.\n\n\r\n              Jalen Green needed assistance to leave the court in the final minute of the first quarter with an apparent re-injury of the right hamstring that kept him out of Phoenix’s first eight games. Green, acquired from Houston over the summer in the megatrade sending Kevin Durant to the Rockets, scored 29 points Thursday in an impressive Suns debut.\n\n\r\n              Bradley Beal scored 12 points for the Clippers, briefly getting into a shooting rhythm against his former team in the second half after going to the locker room in the first half with left hip soreness.\n\n\r\n              Kawhi Leonard missed his third straight game for the Clippers with a sprained ankle that will keep him out for “the next few games,” coach Tyronn Lue said.\n\n\r\n              Harden returned after missing Thursday's game for personal reasons.\n\n\r\n              Up next\r\n              Suns: Host New Orleans on Monday.\n\n\r\n              Clippers: Host Atlanta on Monday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042588.473377
}