{
  "game_id": "0022000925",
  "espn_id": "401307728",
  "date": "Apr 26, 2021",
  "matchup": "MEM @ DEN",
  "headline": "Porter scores 31 points, Nuggets knock off Grizzlies 120-96",
  "body": "DENVER -- — Michael Porter Jr. erupted for 31 points courtesy of a torrid shooting night, Paul Millsap added nine of his 12 points in the fourth quarter and the short-handed Denver Nuggets beat the Memphis Grizzlies 120-96 on Monday.\n\n\r\n                    Nikola Jokic finished with 24 points and 15 rebounds for his league-leading 53rd double-double to help the Nuggets knock off Memphis for a sixth straight time at home. The Grizzlies’ last win in the Mile High City was Feb. 26, 2017.\n\n\r\n                    Porter was 12 of 19 from the floor, including 3 of 6 from 3-point range. He also had seven boards.\n\n\r\n                    “I love when Michael’s aggressive and not just settling for jump shots,” Nuggets coach Michael Malone said. “We know how pretty that jump shot is, how effective that jump shot is. But when he can go to the basket ... (it's) really fun to watch.”\n\n\r\n                    Denver pulled away early in the fourth quarter on the strength of a 12-0 run in which PJ Dozier (five points) and Millsap (seven) accounted for all the scoring.\n\n\r\n                    From there, the Nuggets coasted to their sixth win in seven games. They held the Grizzlies to 4-of-32 shooting from 3-point range.\n\n\r\n                    “It was a good defensive night for us,” Jokic said.\n\n\r\n                    Ja Morant added 27 points to lead the Grizzlies, who finished a seven-game trip with a 4-3 mark.\n\n\r\n                    “We definitely got better over this road trip even though we lost some close ones and didn’t finish it out strong,” said Grayson Allen, who had eight points. “We got four wins out of it. That’s good.”\n\n\r\n                    The Nuggets were without Monte Morris and Will Barton due to right hamstring ailments. They were already missing Jamal Murray, who’s sidelined for the season with a torn ACL. Gone with the trio was 44.2 points a game and 11.2 assists.\n\n\r\n                    Aaron Gordon helped pick up the slack with 15 points. Dozier finished with nine, while Facundo Campazzo had seven assists and seven points.\n\n\r\n                    “Almost every night, you know what you’re going to get from Michael and Nikola,” Malone said. “But other guys stepped up. We’re going to need that.”\n\n\r\n                    Malone didn’t mince words when asked about the difference between the teams from a week ago, when the Nuggets beat the Grizzlies 139-137 in double overtime.\n\n\r\n                    “They are a lot healthier,” Malone said. “We are not.”\n\n\r\n                    In that game, Memphis was missing Jonas Valanciunas, Jaren Jackson Jr. and Dillon Brooks. On Monday night, Valanciunas finished with 13 points, Jackson 10 and Brooks nine despite foul trouble.\n\n\r\n                    The Grizzlies are finally starting to round back into health.\n\n\r\n                    “It’s really nice,” Allen said. “We have a really deep team.\"\n\n\r\n                    TIP-INS\n\n\r\n                    Grizzlies: Jackson and Kyle Anderson each had seven rebounds. ... Morant had six assists and six boards.\n\n\r\n                    Nuggets: F JaMychal Green picked up a technical in the fourth quarter.\n\n\r\n                    RAH-RAH MCGEE\n\n\r\n                    Nuggets center JaVale McGee has found a way to chip in even when he’s not playing — as a cheerleader on the bench. It resonates with Malone.\n\n\r\n                    “His energy, his positivity, supporting guys whether he’s playing or not, his voice in the locker room, has just been really fun to watch,” Malone said. \"I appreciate it so much and I’ve told him that.”\n\n\r\n                    DEFENSIVE PRIDE\n\n\r\n                    Campazzo takes great pride in guarding players such as Stephen Curry, Damian Lillard and on Monday night, Morant.\n\n\r\n                    “Two years ago, I was watching all these star players on TV,” Campazzo said. “Right now, I'm guarding them. I try to enjoy that. I try to compete and be smart, try to help the team.” \n\n\r\n                    ROAD SCHOLARS\n\n\r\n                    Grizzlies coach Taylor Jenkins has seen his team’s cohesion blossom even more on this long trip.\n\n\r\n                    “We talk about these great growth opportunities, and our guys are relishing this opportunity,” Jenkins said. “The biggest takeaway? The togetherness of this team is getting more entrenched.”\n\n\r\n                    UP NEXT\n\n\r\n                    Grizzlies: Kick off a brief two-game homestand Wednesday against Portland. Memphis beat the Trail Blazers in successive games last weekend.\n\n\r\n                    Nuggets: Host Zion Williamson and the New Orleans Pelicans on Wednesday. Denver is 1-1 against the Pelicans this season, including a 113-108 win on March 26 at New Orleans.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764996924.184735
}