{
  "game_id": "0022200714",
  "espn_id": "401468869",
  "date": "Jan 24, 2023",
  "matchup": "MIA vs. BOS",
  "headline": "Bam Adebayo has 30 points, Heat rallies past Celtics 98-95",
  "body": "MIAMI -- — Bam Adebayo isn't going to hear his name when the NBA announces the All-Star Game starters Thursday night. He knows that.\n\n\r\n              But All-Star reserves are picked by coaches. Their ballots for the Feb. 19 game in Salt Lake City are due early next week.\n\n\r\n              And Adebayo made his case for their votes on Tuesday night. He scored 30 points, grabbed 15 rebounds, and put Miami ahead for good on a jumper with 20.4 seconds left — carrying the Heat to a 98-95 victory over the Boston Celtics.\n\n\r\n              “They booted us in the Eastern Conference finals last year,\" said Adebayo, who is averaging 21.6 points and 10.2 rebounds so far this season. “I feel like a lot of guys still carry that.\"\n\n\r\n              Miami used a 15-0 run in the fourth to erase a 10-point deficit and held Boston to 13 points in the final quarter — matching the fewest points by the Celtics in any period this season.\n\n\r\n              Adebayo had nine points and eight rebounds in that fourth quarter.\n\n\r\n              “It's not really my nature to go out and campaign,\" Heat coach Erik Spoelstra said. “I just think he's an All-Star and he showed it tonight. It's a big win. It was on TV. I hope people notice.\"\n\n\r\n              The Celtics had been 26-3 when leading at halftime and 30-3 when leading after three quarters. They led 58-50 at the half, 82-75 going into the fourth and pushed that margin out to 87-77 early in the final quarter.\n\n\r\n              “It was just two good teams out there playing,” Celtics interim coach Joe Mazzulla said. “They made a few more plays at the end than we did.”\n\n\r\n              Jayson Tatum finished with 31 points, 14 rebounds and seven assists for the Celtics. Derrick White scored 23 points, and Robert Williams III had 11.\n\n\r\n              Miami's Tyler Herro stole a cross-court pass thrown by Tatum with just over a second remaining, denying Boston a chance to tie or take the lead. Haywood Highsmith’s free throw with 0.6 seconds left put Miami up by three.\n\n\r\n              Boston called time, and Payton Pritchard’s straightaway 30-footer fell short as time expired.\n\n\r\n              Pritchard played 42 minutes because the Celtics were short-handed. Boston was without three would-be starters in Jaylen Brown (right adductor), Al Horford (lower back stiffness) and Marcus Smart (right ankle) — as well as Malcolm Brogdon, out for personal reasons.\n\n\r\n              Miami played without Jimmy Butler, who sat out with lower back tightness. \n\n\r\n              Boston led 87-77 when Williams got an alley-oop dunk with 8:47 left. The Heat scored the next 15 points while the Celtics missed 10 consecutive shots — but Tatum’s three-point play with 2:19 left stopped both of those runs and got Boston within 92-90.\n\n\r\n              “Our spacing was a little off,\" Mazzulla said.\n\n\r\n              Boston's Grant Williams hit a 3 to tie it at 95 with 43 seconds left, and Adebayo hit a 13-footer on the next Miami possession to put the Heat ahead for good.\n\n\r\n              Highsmith had 15 points and 10 rebounds, Max Strus scored 13 points and Victor Oladipo had 12 for the Heat.\n\n\r\n              “If we have to win ugly, so be it,\" Spoelstra said.\n\n\r\n              TIP-INS\n\n\r\n              Celtics: Tatum had 21 points in the first half. He's averaging 15.3 points in first halves this season, third-best in the NBA behind only Luka Doncic and Joel Embiid. ... Boston fell to 7-1 on the second night of back-to-backs this season. The Celtics were the only NBA team entering Tuesday with an unbeaten record in those situations.\n\n\r\n              Heat: Miami missed 14 of its last 16 shots in the first half. ... Butler had played in 11 consecutive games, a season-long streak. ... Miami (27-22) is a season-high five games over .500. ... Kyle Lowry had eight assists and five rebounds for the Heat. ... Miami turned the ball over only eight times, and Boston turned those into six points. The Heat turned 17 Celtics turnovers into 17 points.\n\n\r\n              RARE WIN\n\n\r\n              Including last season’s Eastern Conference finals, the Celtics had won four straight games at Miami — and 13 of their last 16 true road games against the Heat, excluding Miami’s designated home games from the bubble during the 2020 restart.\n\n\r\n              UP NEXT\n\n\r\n              Celtics: Host New York on Thursday night.\n\n\r\n              Heat: Host Orlando on Friday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995194.3748538
}