{
  "game_id": "0021500955",
  "espn_id": "400828842",
  "date": "Mar 09, 2016",
  "matchup": "OKC vs. LAC",
  "headline": "Russell Westbrook's huge triple-double leads Thunder to win",
  "body": "OKLAHOMA CITY -- Kevin Durant couldn't think of a real-life example of what he saw Russell Westbrook do on Wednesday night.\nIt resembled a video game.\n\"NBA 2K,\" Durant said. \"On rookie.\"\n\nWestbrook had 25 points, a career-high 20 assists and 11 rebounds to help the Oklahoma City Thunder beat the Los Angeles Clippers 120-108. According to STATS, it was the first triple-double with at least 25 points, 20 assists and 10 rebounds since Magic Johnson did it for the Los Angeles Lakers in 1988.\n\"I was born in 1988,\" Westbrook said.\nIt also was the first triple-double with at least 20 points and 20 assists since Rod Strickland did it for the Washington Wizards in 1998.\n\"That's unheard of,\" Durant said. \"Words can't even describe it because it looks so effortless, easy and smooth in the game, and you don't even know what's going on.\"\nWestbrook made 9 of 15 shots and all seven of his free throws. It was the 30th triple-double of his career, his 11th this season, second straight and third in his past five games. The Thunder are unbeaten this season when Westbrook gets a triple-double and 26-4 in his career.\n\"Just a win, man,\" Westbrook said. \"More important just to see all my teammates happy and all see my teammates enjoy the game and enjoy this win. That's the most important part for me, is just making sure everybody feels comfortable about their game.\"\nDurant had 30 points and 12 rebounds, and Serge Ibaka added 15 points for Oklahoma City.\nJeff Green scored 23 points and J.J. Redick had 22 for the Clippers. Chris Paul shot just 5-of-15, scoring 12 points with 16 assists.\nThe Thunder extended their lead over the Clippers to 2½ games for third place in the Western Conference standings.\n\"They got a little bit of everything tonight,'' Paul said. \"They got the shots they wanted. They got 3s. They got layups. They got a little bit of everything.\"\nWestbrook's performance was the highlight of an otherwise somber day for the franchise. The Thunder already were reeling after assistant coach Monty Williams' wife, Ingrid, was killed last month in a car crash in Oklahoma City. Part-owner Aubrey McClendon died last week in a one-car accident in Oklahoma City, then Thunder guard Dion Waiters' younger brother, Demetrius Pinckney, was shot and killed Tuesday in Philadelphia.\nThe Thunder reflected on McClendon's life with a video tribute and held a moment of silence for McClendon and Pinckney before the game.\nThe Thunder were ready at game time. Their 39 points in the first quarter were a season high and helped them take a 10-point lead. Westbrook's eight assists in the period tied a career high for the first.\nThe Clippers trimmed Oklahoma City's lead to 64-62 at halftime. The Clippers shot 59.5 percent in the first half, and the Thunder shot 52.2 percent. Westbrook had 17 points and 12 assists at the break.\nDurant went to the bench to rest midway through the third with the Thunder leading 79-75. Two quick assists from Westbrook to Ibaka doubled the margin and forced the Clippers to call a timeout. The Thunder closed the quarter strong and led 93-83 heading into the fourth.\nIn their loss to the Clippers last week, the Thunder squandered the 17-point lead they took into the fourth quarter. This time, they finished the job.\n\"I thought it was growth,\" Westbrook said. \"I thought we did a good job of sticking together.\"\nSTAT LINES\nDurant has scored at least 30 points in all four games in March. For the month, he's averaging 31 points, 11.3 rebounds and 7.3 assists.\nQUOTABLE\nThunder C Steven Adams on Westbrook: \"That is our commander in chief, really, just helping everyone out. It was brilliant because he was reading the defense and wasn't forcing anything, just playing the game.\"\nTIP-INS\nClippers: Coach Doc Rivers called a timeout 63 seconds into the game after the Clippers fell behind 5-0. He also was called for a technical in the first quarter. ... Luc Mbah a Moute sat out with a left eyelid laceration. ... The Clippers were outrebounded 52-29 and had just two offensive rebounds.\nThunder: Waiters returned to Philadelphia to be with family and was not with the team. ... Enes Kanter scored 10 points on 5-for-5 shooting in the first half.\nUP NEXT\nClippers: Host Knicks on Friday.\nThunder: Host Timberwolves on Friday.",
  "source": "espn_api",
  "crawled_at": 1764994142.6650612
}