{
  "game_id": "401809502",
  "espn_id": "401809502",
  "date": "Oct 31, 2025",
  "matchup": "IND vs ATL",
  "headline": "Jalen Johnson scores 22 as Hawks beat Pacers 128-108 to keep Indiana winless",
  "body": "INDIANAPOLIS -- — Jalen Johnson scored 22 points and had 13 rebounds, Nickeil Alexander-Walker scored 21 points, and the Atlanta Hawks beat Indiana 128-108 in NBA Cup group play on Friday night to keep the Pacers winless this season.\n\n\r\n              Pascal Siakam finished with 18 points and five assists while Jarace Walker added 17 points for the 0-5 Pacers, who are dealing with a rash of injuries.\n\n\r\n              The team announced Friday that forward Obi Toppin will miss at least three months due to a stress fracture in his right foot that will require surgery. Two-time All-Star Tyrese Halliburton could miss the entire season after tearing his right Achilles tendon in the Game 7 loss to Oklahoma City in last season's championship series.\n\n\r\n              The Pacers are also missing starters Bennedict Mathurin (foot) and Andrew Nembhard (left shoulder strain) as well as T.J. McConnell (left hamstring strain).\n\n\r\n              The Hawks played without four-time All Star Trae Young, who sprained his right knee against the Nets on Wednesday night.\n\n\r\n              The Hawks took the lead for good with 3:39 remaining in the second quarter, then pulled away in the third quarter. Atlanta led 63-59 at halftime but outscored the Pacers 34-17 in the third.\n\n\r\n              The Hawks pulled away with a 10-0 run in the third quarter to extend an 11-point lead to 21 points. They outscored the Pacers by 16 points in the final two quarters.\n\n\r\n              The Hawks shot 18.9 percentage points better from the field (54.3%) than the Pacers (35.4%).\n\n\r\n              Johnson was 9 of 16 from the floor while Alexander-Walker was 8 for 14. Dyson Daniels added 18 points.\n\n\r\n              Quenton Jackson had 15 for the Pacers.\n\n\r\n              Up next\r\n              The Hawks stay on the road at the Cavaliers on Sunday.\n\n\r\n              The Pacers play the Warriors on Saturday.\n\n\r\n              ------\n\n\r\n              The Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
  "source": "espn_direct_latest",
  "crawled_at": 1765042532.567394
}