{
  "game_id": "0022000477",
  "espn_id": "401267637",
  "date": "Feb 22, 2021",
  "matchup": "PHX vs. POR",
  "headline": "Booker scores 34, Suns roll to 132-100 win over Blazers",
  "body": "PHOENIX -- — Devin Booker's 17-footer to beat the halftime buzzer brought the 3,000 fans to their feet. His 3-pointer with two seconds remaining in the third quarter earned an even bigger roar from the socially distanced crowd.\n\n\r\n                    Because of shots like those, no heroics were needed in the fourth.\n\n\r\n                    Booker took a seat on the bench and got comfortable. This one was over.\n\n\r\n                    Booker scored 34 points, Deandre Ayton added 19 and the Phoenix Suns kept rolling with a 132-100 win over the Portland Trail Blazers on Monday night.\n\n\r\n                    There's been some talk over the past few months about whether Booker should earn his second straight All-Star selection. He certainly looked worthy in a dominant performance against the Blazers. \n\n\r\n                    Booker finished 12 of 17 from the field and hit both his 3-point attempts. He was 8 for 8 at the free throw line.\n\n\r\n                    “There’s no doubt about it,” Suns coach Monty Williams said. “Nobody can debate Book’s not an All-Star, end of story.”\n\n\r\n                    Said forward Mikal Bridges: “You see what he does game in and game out: leads us to wins. He deserves it — that's all I have to say.”\n\n\r\n                    Phoenix has won nine of its past 10 games and put this one away late in the third quarter with a fast flurry. Booker made his 3-pointer with two seconds remaining and then — following a quick Portland turnover — Cam Johnson hit another 3 at the buzzer to give the Suns a 100-71 lead.\n\n\r\n                    The 32-point win was the Suns' largest margin of victory this season.\n\n\r\n                    “Everyone's locked in,” Booker said. \n\n\r\n                    Portland has lost two straight following a six-game winning streak. The Suns improved to 20-10 on the season while the Trail Blazers fell to 18-12.\n\n\r\n                    Booker poured in points all night, scoring 17 as the Suns pushed ahead 32-26 in the first quarter. The sixth-year guard was up to 22 points by halftime, including an off-balance 17-footer at the buzzer that gave Phoenix a 63-54 advantage.\n\n\r\n                    Damian Lillard led the Trail Blazers with 16 points in the first half and finished with 24. Nassir Little added 18 off the bench. \n\n\r\n                    It was a fairly tight game until the third quarter, when the Suns had a 37-17 advantage.\n\n\r\n                    “It went off track in the third quarter, which is an understatement,” Blazers coach Terry Stotts said. \n\n\r\n                    Stotts said he was confident his team would get back on track after the rough night.\n\n\r\n                    “We always bounce back. That has been a trait of ours,” Stotts said. “You are going to have some bad losses and it is how you respond to them. That is what matters.”\n\n\r\n                    COOLING OFF, A LITTLE\n\n\r\n                    Phoenix entered on an incredible shooting roll from long range, breaking the franchise record with 24 3-pointers in a win Saturday against Memphis. That came one night after tying the franchise record with 22 3s against the Pelicans. It was the fourth time in NBA history that a team made at least 22 3s in back-to-back games.\n\n\r\n                    The Suns were very good again on Monday from long range, but not quite as prolific. They shot 16 of 33 on 3-pointers (48.5%).\n\n\r\n                    TIP-INS\n\n\r\n                    Trail Blazers: Portland got good minutes from its bench in the first half. Rodney Hood had nine points and Carmelo Anthony added eight. ... Anthony got a technical foul in the third quarter for elbowing Suns forward Jae Crowder in the face.\n\n\r\n                    Suns: Booker scored the team's first six points and made six of his first seven shots. ... Phoenix's bench contributed 64 points. Dario Saric had 14 and Johnson added 13.\n\n\r\n                    UP NEXT\n\n\r\n                    Trail Blazers: Travel to face Denver on Tuesday.\n\n\r\n                    Suns: Host the Charlotte Hornets on Wednesday.\n\n\r\n                    ------\n\n\r\n                    Follow David Brandt on Twitter: www.twitter.com/davidbrandtAP\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997751.374648
}