{
  "game_id": "0022400526",
  "espn_id": "401705092",
  "date": "Jan 10, 2025",
  "matchup": "ORL vs. MIL",
  "headline": "Antetokounmpo scores 41 and Bucks hold off Magic 109-106 in Banchero's return",
  "body": "ORLANDO, Fla. -- — Giannis Antetokounmpo had 41 points and 14 rebounds and the Milwaukee Bucks beat Orlando 109-106 on Friday night in spite of 34 points by the Magic's Paolo Banchero in his long-awaited return from an injury.\n\n\r\n              Damian Lillard added 29 points for the Bucks, including a couple of free throws with 9.3 seconds left for the game's final points.\n\n\r\n              Playing for the first time since tearing his right oblique on Oct. 30, Banchero also had seven rebounds and three assists in 27 minutes. He made 5 of 8 3-point shots.\n\n\r\n              Cole Anthony had 18 points and seven rebounds for Orlando and Tristan da Silva had 16 points and 10 rebounds.\n\n\r\n              Bobby Portis came off Milwaukee's bench to score 11 points and grab seven rebounds.\n\n\r\n              Takeaways\r\n              Bucks: The Bucks moved into a virtual tie with the Magic for fourth place in the East with their third straight win.\n\n\r\n              Magic: After going 19-15 in Banchero's 10-week absence, the Magic are still missing Jalen Suggs and Franz and Mo Wagner. But the injuries and poor shooting are costing them close games against good teams.\n\n\r\n              Key moment\r\n              With the Bucks clinging to a one-point lead with 9.3 seconds left, Lillard was fouled by Anthony Black and fell down while taking an inbounds pass. The Magic challenged the call but it was ruled that Black had made contact with both hands. \n\n\r\n              Key stat\r\n              The Bucks shot 52% to offset nine missed free throws (seven by Antetokounmpo).\n\n\r\n              Up Next:\r\n              Bucks: Play at New York on Sunday.\n\n\r\n              Magic: Play at home against Philadelphia on Sunday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997548.518375
}