{
  "game_id": "0022300658",
  "espn_id": "401585286",
  "date": "Jan 29, 2024",
  "matchup": "LAC @ CLE",
  "headline": "Donovan Mitchell scores 28, Jarrett Allen gets 20 points, 17 rebounds as Cavs down Clippers 118-108",
  "body": "CLEVELAND -- — Still not at full strength, the Cavaliers flexed on one of the NBA's hottest teams.\n\n\r\n              Donovan Mitchell had 28 points and 12 assists and Jarrett Allen extended his double-double streak to 15 straight games as Cleveland welcomed back Evan Mobley with a 118-108 win over the Los Angeles Clippers on Monday night.\n\n\r\n              Isaac Okoro added 17 points — all in the first half — as the Cavs held off a late comeback and ended L.A.'s winning streak at five. They also handed the Clippers just their fifth loss in 27 games since Dec. 2.\n\n\r\n              Cleveland, meanwhile, is 10-1 since Jan. 3 and the Cavs aren't quite whole.\n\n\r\n              Allen finished with 20 points and 17 rebounds, extending his franchise record for consecutive games with double digits in points and boards. The Cavs needed Allen to step up his game while Mobley was out with a knee injury, and the affable center has done that and more over the past month.\n\n\r\n              The Cavs went 14-4 without Mobley and point guard Darius Garland, who could be back from a broken jaw in a few days.\n\n\r\n              “It's a testament to our team,” Allen said. “It's a testament to (coach) J.B. (Bickerstaff) and the organization. We got guys who are willing to sacrifice.”\n\n\r\n              Kawhi Leonard scored 30 and Norman Powell 18 for the Clippers, who got within four in the final two minutes but fell to 2-1 on a season-long seven-game road trip. \n\n\r\n              Paul George, who has been slowed by a sore groin, scored 13 on 3 of 11 shooting for Los Angeles before fouling out with 3:07 left. James Harden finished with 11 points, 10 assists and seven rebounds.\n\n\r\n              “It was a great team win for them,” Leonard said. \"Starting with Donovan, they did a great job all night. We’ve just got to keep shooting with confidence because we know the shots are going to start going in. We are getting the looks we want — open looks — so we’ll keep taking them.”\n\n\r\n              Cleveland's Caris LeVert, who has developed a knack for hitting buzzer beaters at home, dropped a step-back jumper before the horn — it was initially ruled a 3 — to give the Cavs an 88-81 lead entering the fourth.\n\n\r\n              The Cavs pushed their lead to 12 before the Clippers fought back and got within 112-108 on Amir Coffey's jumper. However, Coffey missed a free throw that would have pulled L.A. even closer and Mitchell dropped an 18-foot jumper with 1:09 remaining.\n\n\r\n              Cleveland is finally closer to being healthy.\n\n\r\n              Mobley played for the first time since undergoing left knee surgery on Dec. 18. He finished with 10 points and nine rebounds in 21 minutes. The Cavs plan to initially limit his time until he works back into game shape.\n\n\r\n              Mobley made it back in just six weeks — the team had estimated eight — and credited a positive mindset for his quick recovery.\n\n\r\n              “I looked at it as an opportunity and just wanted to get back for the guys,” he said. “I want to do what I can do fit in.”\n\n\r\n              Mobley's return is expected to be quickly followed by Garland coming back after missing 19 games with a broken jaw. The point guard will likely play Wednesday night.\n\n\r\n              Mobley had some strong moments and a few in which he showed rust from his layoff. In the second quarter, he grabbed a rebound, dribbled the length of the floor and knifed through the Clippers' defense before dunking — his first points since Dec. 6.\n\n\r\n              “It's good to have Evan back,” Allen said. “He stayed locked in, and now that he's back he's looking like his old self again.”\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At Washington on Wednesday.\n\n\r\n              Cavaliers: Host Detroit on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764996548.87693
}