{
  "game_id": "0021501083",
  "espn_id": "400828970",
  "date": "Mar 26, 2016",
  "matchup": "CHI @ ORL",
  "headline": "Bulls' playoffs hopes dealt blow with 111-89 loss to Magic",
  "body": "ORLANDO, Fla. -- The Chicago Bulls came into Saturday night's game against Orlando needing to turn things around for their fading playoff chances.\nBut it was the short-handed Magic, a team long out of the playoff hunt, who seemed to play with the sense of urgency the Bulls needed to have.\nOrlando, playing without leading scorers Nikola Vucevic and Victor Oladipo, got points from a collection of role players -- including a career-high 18 points and season-high 13 rebounds from Dewayne Dedmon -- on the way to an impressive 111-89 win at the Amway Center that sent the Bulls to their third straight loss and put their playoff hopes in serious doubts.\n\nBulls stars Taj Gibson and Jimmy Butler had expressed their frustration with the late-season slide before Saturday night's game. The Bulls' display against another non-playoff team did little to calm things as they saw their chances to make up ground for the eighth and final playoff in the Eastern Conference take another blow.\nChicago is two games behind both Indiana and Detroit, which are tied for the last two spots in the conference.\n\"I sure hope not,\" Bulls first-year coach Fred Hoiberg responded when asked if he thinks his team has quit on trying to make a playoff run.\n\"Obviously, what I'm saying right now, my message isn't getting across,\" he added. \"We're going to sit in a room and hopefully get it figured out tomorrow.\"\nThere is no denying the frustration among the Bulls' players, who made mistake after mistake against the Magic.\n\"Obviously, we're really struggling right now,\" forward Mike Dunleavy said. \"We look like a team that's lost in terms of doing the things you need to do. It's a lot of stuff. We have to find our way. We've had success in the past, but it's going to be tough right now.\"\nThe Bulls, however, insist they have not given up on the season despite what it looks like on the floor.\n\"I don't think anybody's quit,\" shooting guard Jimmy Butler said. \"We've just hit adversity at the wrong time and we've got to fix it. It better carry over from in this locker room out to the court. That's the only way to get this thing fixed.\n\"Nobody else can play basketball for us.\"\nAside from a brief run early in their third quarter, that reduced their 18-point halftime deficit to nine points, the Bulls (36-36) never seemed to play with much urgency. Taj Gibson was consistently strong in the paint, leading the Bulls with 16 points on 8-of-9 shooting. But the other key Bulls players were mostly non-factors.\nDerrick Rose had an off night with just nine points on 4-of-14 shooting, while committing four turnovers. Butler had a quiet 12 points and Mike Dunleavy added 10 points. Center Pau Gasol, who missed Thursday night's loss to the New York Knicks with continued swelling in his right knee, scored just seven points on 3-of-6 shooting while being completely outplayed by Dedmon.\nThe Magic journeyman center looked much more the All-Star center as he dominated the paint. Dedmon, who teammates made a point of getting the ball inside to him early, exceeded his career high in the first half with 16 points to help lead the Magic to a 68-50 halftime lead.\n\"He was really active,\" Magic coach Scott Skiles said. \"He was on the boards. He got some opportunities sometimes he might not normally get and was able to finish them.\"\nDedmon was far from the only Magic player who stepped up Saturday night. Point guard Elfrid Payton outplayed his much more celebrated counterpart, coming up with a double-double with 15 points and 10 assists against Rose and the Bulls other point guards.\nThe Magic, which led by as many as 29 points, also received big contributions off the bench from forwards Jason Smith and Andrew Nicholson, who scored 14 points apiece.\n\"We've had a lot of halves, quarters where we're very energetic, see each other,\" said Skiles, whose team improved to 30-43. \"We played unselfishly tonight. We did it very well.\"\nMeanwhile, Hoiberg seemed at a loss for what to do to get things turned around as the season heads into the final stretch.\n\"It's hard to say,\" he said. \"They're locked in at shootaround. They're getting after it. They're paying attention to what we're doing, then we go out there and get slapped in the face. It just spirals downhill.\"\nTIP-INS\nMagic: C Nikola Vucevic missed his 12th straight game with lingering groin issues. ... Ersan Llyasova (shoulder) sat for the second consecutive game.\nBulls: Gasol returned to the lineup, but remained on a minutes restriction.\nUP NEXT\nBulls: host Atlanta on Monday night.\nMagic: host Brooklyn on Tuesday night.",
  "source": "espn_api",
  "crawled_at": 1764993902.798541
}