{
  "game_id": "0022200767",
  "espn_id": "401468922",
  "date": "Jan 31, 2023",
  "matchup": "CHA @ MIL",
  "headline": "Bucks beat Hornets 124-115 for 5th consecutive victory",
  "body": "MILWAUKEE -- — Khris Middleton is making the most of his limited minutes as he works his way back from injuries that kept him from playing for much of the season.\n\n\r\n              Middleton scored 18 points and sparked a third-quarter run that put the Milwaukee Bucks ahead for good as they beat the Charlotte Hornets 124-115 on Tuesday night for their fifth straight victry. \n\n\r\n              “Right now I'm trying to be as aggressive as I can,” Middleton said. “I know it sounds simple or whatever, but that's just the mindset I'm trying to come up with, especially with my limited minutes. Hopefully as my minutes keep going (up), I keep the same mindset, because it's been working.\"\n\n\r\n              The Bucks withstood a triple-double from Charlotte’s LaMelo Ball, who had 27 points, 11 assists and 10 rebounds.\n\n\r\n              Giannis Antetokounmpo had 34 points and 18 rebounds to help the Bucks avenge one of their most embarrassing losses of the season. Jrue Holiday added 15 points and a career-high 13 rebounds.\n\n\r\n              Middleton played 20 minutes, his longest outing since coming back from a sore right knee that caused him to miss 18 games. The three-time All-Star also missed the Bucks' first 20 games while recovering from offseason surgery on his left wrist. \n\n\r\n              He has come off the bench in each of the Bucks' five games since his return.\n\n\r\n              “I started my career coming off the bench, so it doesn't really bother me at all,” Middleton said. “I've been on the bench before, not playing games, sometimes coming in first quarter, second quarter or sometimes not until the second half. I just know I have to stay ready and have to be loose.”\n\n\r\n              In a game that featured 11 ties and 17 lead changes, Middleton helped Milwaukee gain command. He scored 11 points during a 14-3 spurt late in the third quarter that helped the Bucks take a 97-90 lead into the final period. \n\n\r\n              “He got going when they kind of took control of the game,” Hornets coach Steve Clifford said. \n\n\r\n              Charlotte (16-36) entered the night with the fourth-worst record in the NBA, but the Hornets won 138-109 at Milwaukee on Jan. 6 to hand the Bucks their second-most lopsided loss of the season. The Hornets had 51 points in the opening period that night — matching the NBA record for a first quarter — and limited Antetokounmpo to nine points.\n\n\r\n              Even after scoring 50 points in a 135-110 victory over the New Orleans Pelicans on Sunday, Antetokounmpo spent part of his postgame press conference talking about how the Bucks needed to play better in the rematch with the Hornets. \n\n\r\n              The Hornets still made this one interesting. \n\n\r\n              Milwaukee took a 114-97 lead on Antetokounmpo's 3-pointer with 7:13 left. but didn't make another basket until Antetokounmpo's driving layup with 27.1 seconds remaining.\n\n\r\n              Charlotte cut it to 118-113 when Mason Plumlee hit a layup and drew a foul with 1:06 left. But Plumlee missed the ensuing free throw, and the Bucks put it away from there.\n\n\r\n              “Their record doesn't give them justice,” Antetokounmpo said. “They're a really good team. Or maybe they just play well against us. I don't know.”\n\n\r\n              Terry Rozier scored 20 points, Gordon Hayward 16, Jalen McDaniels 15 and P.J. Washington and Plumlee 14 each for Charlotte. Plumlee also had 14 rebounds.\n\n\r\n              TIP-INS\n\n\r\n              Hornets: Ball's triple-double was his second of the season and eighth of his career. His other triple-double this season came Dec. 22, when he had 25 points, 12 assists and 11 rebounds in a 126-105 loss to the Los Angeles Clippers.\n\n\r\n              Bucks: Pat Connaughton shot just 1 of 8 from 3-point range. He had gone 25 of 49 from beyond the arc over his last eight games. … After getting a steal in the opening seconds of the second half, Holiday threw an off-the-backboard pass to Antetokounmpo, who was unable to convert the dunk attempt.\n\n\r\n              UP NEXT\n\n\r\n              Hornets: At Chicago on Thursday night.\n\n\r\n              Bucks: Host the Los Angeles Clippers on Thursday night.\n\n\r\n              ----\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994260.1762931
}