{
  "game_id": "0021900882",
  "espn_id": "401161524",
  "date": "Feb 28, 2020",
  "matchup": "MIL vs. OKC",
  "headline": "Giannis Antetokounmpo helps Bucks rout Thunder, 133-86",
  "body": "MILWAUKEE --  Giannis Antetokounmpo and the NBA-leading Milwaukee Bucks made quick work of the Oklahoma City Thunder.\n\nAntetokounmpo had 32 points and 13 rebounds and Milwaukee surged to a 24-point lead in the second quarter in a 133-86 victory Friday night. The 47-point margin was the Bucks' largest of the season -- and the Thunder's worst of the season.\n\n\"It feels good. It feels good seeing other guys going out there, playing hard and being up 40 points, sitting on the bench, relaxing, having fun,\" Antetokounmpo said. \"Everyone is smiling. Games like these are always the best games.\n\n\"We were extremely ready. We moved the ball. We were defending. We know that in the fourth quarter, they always come back to the game. We never relaxed.\"\n\nChris Paul scored 18 points for Oklahoma City.\n\n\"We got a lot of really good looks, but our defense and our rebounding wasn't much tonight,\" Paul said. \"It's just an old-fashioned butt whooping.\"\n\nBoth teams were without their second-leading scorers. Bucks All-Star Khris Middleton was a late scratch with a sore neck. An ankle injury kept Thunder forward Danilo Gallinari out.\n\nMilwaukee surged to a 24-point lead in the second quarter behind 14 second-quarter points from Antetokounmpo, seven from Donte Divincenzo, who started in place of Middleton, and back-to-back 3-pointers from Wesley Matthews.\n\nA key moment occurred late in the second period.\n\nWith Milwaukee leading, 54-43, Bucks coach Mike Budenholzer got a technical foul after approaching a referee during a timeout with 3:43 left in the quarter. That was moments after Eric Bledsoe was called for a charging foul that irked Budenholzer. After that, the Bucks went on a 17-4 run and led 71-47 at halftime.\n\n\"I just felt like we got a lot of stops and then it felt like the ball movement and the spacing and shooting just was really good,\" Budenholzer said. \"Kind of the marrying of good defense with good offense.\"\n\nMilwaukee outrebounded Oklahoma City, 67-36.\n\nThe Bucks made a season-high 21 3-pointers. The Thunder were 6 for 35 on 3-pointers.\n\n\"Your offense dictates your transition defense and dictates how you can get set,\" said Thunder coach Billy Donovan. \"I don't think we took bad shots. It's the shot-fake drive instead of shooting it and getting in the rotation, maybe getting fouled, maybe getting a cleaner look. Those things could have been better.\"\n\nTIP-INS\n\nThunder: Oklahoma City is one of the top NBA teams statistically in preventing fast-break points partly because it commits relatively few turnovers on offense, Donovan said. \"If you don't turn the ball over a lot, it gives you a better chance to get the floor balance,\" he said.\n\nBucks: Middleton's absence was unexpected. \"I think just kind of one of those strange things where, just today he came in, neck was sore,\" Budenholzer said a couple of hours before tip-off. \"We'll see how it goes in the next day or so.\" Middleton had scored 20 or more points in 11 of his last 12 games. ... Former Bucks great Kareem Abdul-Jabbar was in attendance, getting a standing ovation when he was introduced midway through the first quarter. ... The Bucks are on pace to become the third team in league history to win at least 70 games.\n\nGIANNIS POWER\n\n\"He's just constantly driven to improve. He's obviously very, very skilled, very talented, very gifted and he's not satisfied,\" Budenholzer said about Antetokounmpo. \"We kind of want that to be the identity of our organization and when your best player's built that way, usually you follow the lead of your best player. It's critical to us.\"\n\nSILENCE FOR SHOOTING\n\nA moment of silence was done before the game to remember the five victims of a shooting Wednesday at the Molson Coors brewery complex in Milwaukee. The gunman, who killed himself, and all five victims were employees of Molson Coors, known locally as Miller Brewing.\n\nUP NEXT\n\nThunder: Host Oklahoma City on Tuesday night.\n\nBucks: At Charlotte on Sunday.",
  "source": "espn_api",
  "crawled_at": 1764996127.148774
}