{
  "game_id": "0022201060",
  "espn_id": "401469215",
  "date": "Mar 18, 2023",
  "matchup": "MIA @ CHI",
  "headline": "DeRozan leads balanced attack as Bulls beat Heat 113-99",
  "body": "CHICAGO -- — DeMar DeRozan scored 24 points to lead a balanced Bulls offense and Chicago held off a late surge by Miami to beat the Heat 113-99 on Saturday night.\n\n\r\n              DeRozan shot 9 of 12 from the floor to help the Bulls sweep the season series from the Heat. Coby White made four 3-pointers and finished with 18 points, Zach LaVine also had 18 and Patrick Beverley added 17 as the Bulls shot 56.3% (45 for 80) from the field overall, including 17 for 34 from 3-point range.\n\n\r\n              “No matter how well I shoot it, I’m 38% for my career from 3-point (range) for over a decade,” said Beverley, who shot 5 of 10 against Miami. \"No matter how well I shoot it, I think it’s the look of me that people want to leave me open. Keep letting them do it.\n\n\r\n              “Everyone sees me as a defensive guy. They don’t see me as a 3-point shooter, but my numbers are there with the best of them.”\n\n\r\n              Chicago nearly blew all of a 27-point lead after Nikola Vucevic converted a 3-point play with slightly more than 10 minutes left in the third quarter. Miami, led by 24 points from Jimmy Butler and 23 from Bam Adebayo, cut its deficit to 93-90 with nine minutes left.\n\n\r\n              “It was more like we were playing on our heels and passively in the first half,” Miami coach Erik Spoelstra said. “They got into a great groove. They really didn’t feel us at all in the first half. So even some shots they normally might not make, the basket just got bigger and bigger. Before we knew it, we surrendered 70 (in the first half).”\n\n\r\n              The Bulls showed few signs of fatigue during the first half, one night after outlasting Minnesota 139-131 in two overtimes. They didn't need to rely heavily on DeRozan, who scored 49 points in 52 minutes against the Timberwolves or LaVine (39 in 47).\n\n\r\n              Beverley scored 11 of his 14 first-half points during an 11-2 run that enabled the Bulls to expand their lead to 21 midway through the second quarter. But he drew his fifth foul with 7:14 left in the third quarter. The Heat were in the early stages of a 15-0 run during a six-minute stretch.\n\n\r\n              Beverley had to leave briefly midway through the first quarter after claiming he got kicked on a jump shot by Jimmy Butler. White substituted for Beverley and sank three shots and stole a pass in the final six minutes of the quarter. \n\n\r\n              “They didn't want to let DeMar get 49 points again,” said White, referring to DeRozan's season-high Friday. “They were doubling Zach because he's at a superstar level.”\n\n\r\n              Bulls guard Alex Caruso left with 6:55 left in the second quarter because of a left mid-foot sprain and did not return.\n\n\r\n              TIP-INS\n\n\r\n              Heat: G Kyle Lowry (left knee soreness) was held out as part of an injury management plan as the Heat played the first of two games on back-to-back nights. “This is the plan for this week,” Spoelstra said. \"We're formulating the plan for next week. We'll see where we go from here.\" Lowry played in three consecutive games after missing 15 straight because of soreness.\n\n\r\n              Bulls: G Javonte Green (right knee soreness) was ruled after after experiencing soreness following consecutive days of practicing involving contact drills. “It was good progress,” Bulls coach Billy Donovan said. “He put a few good days in. I think they (the doctors) want to see more consistency from him.”\n\n\r\n              UP NEXT\n\n\r\n              Heat: Travel to Detroit to play the Pistons on Sunday.\n\n\r\n              Bulls: Take on the 76ers on Monday night in Philadelphia.\n\n\r\n              —\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764993920.968401
}