{
  "game_id": "0021900681",
  "espn_id": "401161323",
  "date": "Jan 25, 2020",
  "matchup": "DET vs. BKN",
  "headline": "Kyrie Irving scores 45 points, Nets beat Pistons in OT",
  "body": "DETROIT --  Kyrie Irving took over, scoring on an array of shots and even over a backboard that was simply in his way.\n\nIrving scored 17 of his 45 points in the third quarter to overcome a double-digit deficit and the Brooklyn Nets went on to beat the Detroit Pistons 121-111 in overtime Saturday night.\n\n\"It was about time,\" Irving said.\n\nThe six-time All-Star played in his sixth game after a 26-game absence due to an injured right shoulder, which he was treating shortly after his sensational performance.\n\nAt one point during Irving's scoring tear after halftime, he shot a floater over 6-foot-11 Andre Drummond and the backboard from the baseline.\n\n\"It just came down to execution and Kyrie having an out-of-body experience,\" Drummond said. \"When he's knocking down shots like that, it is kind of tough to do anything against him.\n\nIrving made free throws early in the extra period to put the Nets ahead and his assists helped them end a five-game losing streak.\n\n\"The way we've been struggling it's big for us,\" Nets guard Spencer Dinwiddie said.\n\nThe Nets went ahead 106-104 with 38.4 seconds left in regulation when Drummond was called for goaltending. Derrick Rose had an unforced turnover on the ensuing possession, then made up for it with a tying layup with 1.9 seconds left.\n\nIrving missed a 3-pointer just before the buzzer, sending it to overtime.\n\n\"We worked really hard, but it came down to a couple possessions at the end of regulation,\" Detroit coach Dwane Casey said. \"I thought we ran out of gas a little in overtime.\"\n\nThe Nets and Pistons are among many sub-.500 teams in the Eastern Conference, likely vying for the last two spots in the playoffs.\n\nBrooklyn's Jarrett Allen finished with 20 points and 15 rebounds, and Joe Harris scored 16 points. Nicolas Claxton had 10 points, and Dinwiddie added 10 points off the bench.\n\nRose had 27 points for Detroit, scoring more than 20 for the 12th straight game to extend his career high.\n\nDrummond had a double-double in the first quarter and finished with 20 points and 21 rebounds. He has an NBA-high eight games with 20 or more points and rebounds and 40 in his career, tying Bob Lanier's franchise record.\n\nIt was an impressive performance after missing two games for dental surgery.\n\n\"It was a tough week,\" Drummond said. \"I've got a fake tooth in there now and I've still got a lot of (dental) work left ahead of me.\n\nDrummond had 11 points and 10 rebounds in the first quarter, which ended with the Nets ahead 26-25.\n\nIrving was dominant in the third quarter, scoring eight consecutive points in the game and a total of 12 points in 2:02.\n\n\"Kyrie set the tone in the first two possessions the second half, he went to the rim, got fouled scored a layup,\" Nets coach Kenny Atkinson said. \"It loosened the defense up.\"\n\nIrving's scoring surge helped the Nets go into the fourth quarter with an 80-77 lead.\n\n\"It definitely jump-started our team,\" Dinwiddie said. \"He really kicked into high gear and basically said we weren't going to lose the game.\"\n\nTIP-INS\n\nNets: Garrett Temple moved into the starting lineup, ending Dinwiddie's streak of 32 straight starts. The move sets up Dinwiddie and Caris LeVert to provide the scoring off the bench. ... DeAndre Jordan (finger) missed a fourth straight game and is day to day. ... Timothe Luwawu-Cabarrot was signed to a second 10-day contract.\n\nPistons: Bruce Brown (illness) returned after missing the first two games. ... Reggie Jackson (back) sat out as planned. He has not been cleared for back-to-back games. ... Drummond scored 25 points to help Detroit beat the Nets 113-109 on Nov. 2 in previous meeting and the two teams will meet Wednesday night in Brooklyn.\n\nUP NEXT\n\nNets: At New York on Sunday night.\n\nPistons: Host Cleveland on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996271.71519
}