{
  "game_id": "0021800474",
  "espn_id": "401071155",
  "date": "Dec 21, 2018",
  "matchup": "CHI vs. ORL",
  "headline": "Markkanen scores 32, Bulls beat Magic 90-80",
  "body": "CHICAGO --  Whether it was driving inside for a poster-worthy dunk or burying 3-pointers, Lauri Markkanen did exactly what the Chicago Bulls needed him to do.\n\nMarkkanen scored a season-high 32 points and the Bulls won for just the third time in 15 games, beating the Magic 90-80 on Friday night.\n\n\"I think I can do multiple things, so take one thing away from me I can do other stuff,\" he said. \"I think we did a good job of recognizing their coverages, using that to our advantage.\"\n\nMarkkanen was 12 for 20 from the field in his 10th game since missing the start of the season with a right elbow injury. The 7-footer also went 4 for 6 from beyond the arc.\n\nRobin Lopez had 14 points for Chicago. Kris Dunn added 12 points and seven assists, and Justin Holiday finished with 11 points and 10 rebounds.\n\nOrlando lost for the fifth time in its last seven games. Evan Fournier scored 24 points, and Nikola Vucevic had 19 points and 19 rebounds after missing a game for the birth of his son.\n\nThe Magic posted their second-lowest point total of the season while shooting just under 33 percent. They didn't exactly help themselves on defense, either.\n\n\"They're a scrappy team and they play hard,\" said Aaron Gordon, who scored 14 points for Orlando on 4-for-17 shooting. \"But this is a game that we gave away. We didn't do what we need to do on offense. We didn't take care of defense. We just came out there, I don't know what we were thinking. Obviously, we weren't ready to play the game and that's a disappointing loss.\"\n\nMarkkanen hit the 30-point mark for the third time in his career. He shook off a slow start after taking just six shots in a 96-93 loss to Brooklyn on Wednesday.\n\nHe had the crowd roaring in the third quarter when he drove for a hard dunk on Vucevic.\n\nThe Bulls led by as many as 15. Vucevic's turnaround jumper got Orlando within five with 1:37 remaining, but Markkanen hit a jumper and two foul shots to help seal the game for Chicago.\n\n\"Well, I just think he was aggressive,\" coach Jim Boylen said. \"I think we tried to move him around a little bit, get him to his spots. He's a great kid, he's coachable. He wants to do the right thing. He's coming back ... so it's gonna be a process. He's still a young player. But he was competitive and he was aggressive. And if you're that big and that skilled and you do that, you got a chance to have a good game. And he did. I'm really proud of him.\"\n\nTIP-INS\n\nMagic: F Jonathan Simmons was sidelined by a sprained right ankle. He was injured Wednesday against San Antonio. ... Orlando scored 76 in a loss to Dallas on Dec. 10. ... The Magic hit 8 of 33 3-pointers.\n\nBulls: The 80 points were the fewest allowed by Chicago this season. ... F Jabari Parker (stomach illness) hopes to return Sunday at Cleveland after missing his fourth straight game. He was still experiencing fatigue and believes he would benefit from another practice before rejoining the rotation. \"When I come in, I want to contribute,\" Parker said. \"I hold myself to a high standard, and I'm gonna try to do my best to contribute to the team.\" ... F Bobby Portis said it's \"not tough at all\" to remain patient as he works his way back from a sprained right ankle. He also dismissed the idea that the banged-up Bulls are snake-bitten. \"I wouldn't say that,\" he said. ... G Cameron Payne sat out with a strained calf.\n\nUP NEXT\n\nMagic: Host Miami on Sunday.\n\nBulls: Visit Cleveland on Sunday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994827.295273
}