{
  "game_id": "0021800944",
  "espn_id": "401071617",
  "date": "Mar 03, 2019",
  "matchup": "CHA vs. POR",
  "headline": "Hood, Nurkic lead Blazers past Hornets 118-108",
  "body": "CHARLOTTE, N.C. --  Nicolas Batum said the Hornets' game plan was to stop Portland's backcourt tandem of Damian Lillard and C.J. McCollum.\n\nHe didn't expect Rodney Hood to beat them.\n\nHood broke out of a shooting slump with a season-high 27 points -- all in the second half -- and Jusuf Nurkic added 26 points and 15 rebounds to help the Trail Blazers beat Charlotte 118-108 on Sunday.\n\n\"I've been through worse slumps before. The biggest thing I did the second half was not think as much as I have,\" said Hood, who was acquired in a trade from Cleveland last month. \"You know, trying to learn the plays, try to figure everything out. When we just play ball I think I can affect the game in a positive way.\"\n\nIn the Blazers' last five games, Hood had made just 7 of 32 shots from the field, including 1 of 10 from 3-point range.\n\nAnd he didn't score Sunday until making a pull-up jumper with 2:26 left in the third quarter.\n\nBut he carried that momentum over to the fourth quarter, when he made 7 of 10 shots -- including three 3s -- and all four free-throw attempts for 21 points. By the middle of the period, teammates could sense his confidence and were setting screens to free him up.\n\n\"I think C.J. was 2 for 12 and (Lillard) was 9 for 20-something,\" Batum said. \"We contained those guys pretty well and I think when you get like 21 points (from Hood) in the fourth, we didn't see that coming.\"\n\nLillard added 23 points for the Blazers, who have won six of their past seven.\n\nPortland entered the game tied with Oklahoma City for the third-best record in the Western Conference. The Thunder were hosting the Grizzlies later Sunday.\n\n\"Tonight it was Rodney Hood. CJ (McCollum) had a game against Toronto,\" Blazers coach Terry Stotts said. \"It's just been different things on different nights, not one thing.\"\n\nJeremy Lamb had 23 points and Kemba Walker had 18 points and a season-high 12 assists for the Hornets, who entered the day tied with the Magic for the eighth and final playoff spot in the East.\n\nThe Blazers limited Walker to 5-of-21 shooting.\n\nIt was a back-and-forth game until the six-minute mark of the fourth quarter, when the Blazers went on a 12-2 run sparked by Hood to break it open. Portland scored from a variety of spots including a fast-break layup from a hustling Nurkic, an 18-foot jumper by Hood and a put-back from Al-Farouq Aminu that led to a three-point play.\n\nHood ended Charlotte's chance of a comeback when he drilled a 27-footer from the top of the key to push the lead to 14 with 2 1/2 minutes left.\n\nThe Blazers built a 56-50 halftime lead behind Nurkic, who dominated the paint in the first half with 14 points, seven rebounds and four assists. Lamb, who was benched earlier this month for rookie Miles Bridges, was the primary reason the Hornets stayed in the game, outscoring his team's entire starting five in the first half with 20 points on 8-of-11 shooting.\n\nTIP-INS\n\nTrail Blazers: Seth Curry, who is from Charlotte, played in his first NBA game at the Spectrum Center and finished with eight points.\n\nHornets: Were outrebounded 48-35 by the Blazers.\n\nINSIDE PLAY\n\nBehind Norkic, the Blazers dominated the Hornets in the paint, outscoring them 58-38.\n\n\"He worked at getting position,\" Stotts said. \"When he had a matchup, he was able to finish around the basket. It's a tough matchup for (Cody) Zeller, so they tried to keep a bigger body on them.\"\n\nKAMINSKY'S SPARK\n\nFrank Kaminsky has gone from afterthought to contributor in the last two games for the Hornets. Kaminsky had a second straight solid outing with 18 points and seven rebounds for Charlotte after playing in just three other games since the start of the New Year.\n\n\"He looks really aggressive right now, asserting himself,\" Hornets coach James Borrego said. \"We're looking for him and he's playing with a lot of confidence right now, shooting the ball, driving and creating offense for us as well as battling on the boards. We're going to need him. We need that spark and he's giving it to us right now.\"\n\nUP NEXT\n\nTrail Blazers: Visit the Memphis Grizzlies on Tuesday night.\n\nHornets: Host the Miami Heat on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994357.006443
}