{
  "game_id": "0022200073",
  "espn_id": "401468228",
  "date": "Oct 28, 2022",
  "matchup": "TOR vs. PHI",
  "headline": "Maxey has career-high 44, 76ers beat Raptors without Embiid",
  "body": "TORONTO -- — Tyrese Maxey scored a career-high 44 points, carrying the Philadelphia 76ers without Joel Embiid to a 112-90 victory over the Toronto Raptors on Friday night.\n\n\r\n              Embiid sat out because of a sore right knee. A five-time All Star and the reigning NBA scoring champion, Embiid is averaging 27.6 points and 10 rebounds in five games.\n\n\r\n              The 76ers didn’t miss Embiid and didn’t even need much from James Harden because of Maxey, who made his first 10 shots, seven of them from long range, and didn’t miss until a 3-pointer rimmed out with 8 minutes left in the third quarter.\n\n\r\n              “I just know how good we can be, I know how talented we are, but we’ve got to match our talent with the energy that we play with, and defensive tenacity,” Maxey said. “Tonight we knew it was going to be extremely hard without Joel. That made guys step up, that made guys do things they don’t normally do.”\n\n\r\n              Maxey shot 15 for 20 overall, going a career-best 9 for 12 from outside.\n\n\r\n              “Rese didn’t miss,” 76ers guard Matisse Thybulle said. “They just kept going in.”\n\n\r\n              Maxey had eight rebounds and four assists. He shot 5 for 6 at the free throw line.\n\n\r\n              “I thought he was awesome,” 76ers coach Doc Rivers said. “He led us in rebounds.”\n\n\r\n              De’Anthony Melton and Tobias Harris each scored 13 points and Harden had 11 as the 76ers never trailed and won for the second time in six games, splitting a pair north of the border against their Atlantic Division rivals.\n\n\r\n              “We’re not close to where we want to be,” Rivers said, “and we’re going to have some bumps early and we know that. But once we get there, we’re going to be a really good basketball team.”\n\n\r\n              Pascal Siakam had 26 points and 10 rebounds, O.G. Anunoby scored 19 points and Scottie Barnes had 13 for the Raptors, who lost for the first time in three home games. Toronto’s 90 points were a season low.\n\n\r\n              “We were really locked in on the defensive end,” Maxey said.\n\n\r\n              Raptors All Star guard Fred VanVleet shot 0 for 11, going 0 for 8 from 3-point range. VanVleet scored one point.\n\n\r\n              “We just weren’t very sharp at either end,” Raptors coach Nick Nurse said.\n\n\r\n              Maxey was 5 for 5 in the first, starting the quarter with four straight 3-pointers and ending it with a buzzer-beating shot to give the 76ers a 28-26 lead. Philadelphia made 7 of 14 from long range in the first.\n\n\r\n              Maxey made five more shots in the second, two of them from distance, and Harden scored eight points to give the visitors a 65-48 lead at the half. The Sixers shot 15 for 24 in the second.\n\n\r\n              “Once you get stops the game becomes way easier, honestly, not just for myself, for all of us,” Maxey said.\n\n\r\n              Anunoby cut it to 70-64 with a steal and dunk with 4:09 left in the third but Maxey replied with four points as Philadelphia took an 81-70 lead to the fourth.\n\n\r\n              TIP-INS\n\n\r\n              76ers: Melton started with Embiid out. … After shooting 25 for 44 in the first half, Philadelphia shot 6 for 20 in the third quarter. … Maxey’s previous career high was 39, set against Denver on Jan. 9, 2021.\n\n\r\n              Raptors: Toronto made 10 turnovers in the first half, leading to 18 points for the 76ers. The Raptors didn’t make a first-half turnover in Wednesday’s 119-109 win over Philadelphia, and had nine in the game. They had 17 Friday. … Toronto didn’t score a bench point in the first half. … F Otto Porter Jr. (personal reasons) was not available.\n\n\r\n              UP NEXT\n\n\r\n              76ers: Visit Chicago on Saturday night.\n\n\r\n              Raptors: Host Atlanta on Monday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994106.996663
}