{
  "game_id": "0021800867",
  "espn_id": "401071540",
  "date": "Feb 21, 2019",
  "matchup": "CLE vs. PHX",
  "headline": "Cavaliers send Suns to franchise-record 16th straight loss",
  "body": "CLEVELAND --  Kevin Love's presence makes an obvious difference for the Cleveland Cavaliers.\n\nPlaying his third game since returning from foot surgery, Love had 16 points and 11 rebounds and Cleveland sent the Phoenix Suns to a franchise-record 16th straight loss, 111-98 on Thursday night.\n\n\"He's a walking double-double,\" Cleveland forward Larry Nance Jr. said \"That's something he's been his whole career and it's certainly not going to change now.\"\n\nCedi Osman scored 19 points for Cleveland while NBA-worst Phoenix (11-49) topped the record of 15 set March 2- April 1, 2018. The Suns' last victory was Jan. 12 over Denver.\n\nDevin Booker scored 30 points for Phoenix, and Kelly Oubre Jr. had 23. The Suns have allowed at least 110 points in each game of the losing streak.\n\n\"You have to change something where we're at the point we're at,\" Booker said. \"We have to hold people accountable. You can't take things personally when a guy calls you out. We need to start not being scared to step on people's toes when something is wrong.\"\n\nLove played 22 minutes and was 6 of 13 from the field. He played nearly 16 minutes Feb. 21 against New York and sat out the final game before the All-Star break against Brooklyn two days later.\n\nLove, who committed three turnovers in the first quarter, admitted he's still shaking off some rust.\n\n\"I looked like I hadn't played many games lately and looked like I had just come off break,\" he said. \"That will go away. Couple shots were pretty short, getting my legs underneath me, but overall I felt pretty good and just kind of progress in these minutes.\"\n\nThe Cavaliers plan to steadily increase Love's playing time over the next several games as he rebuilds his stamina after missing over 50 games because of the surgery in November.\n\nAnte Zizic had 15 points and 12 rebounds for the Cavaliers.\n\nCleveland trailed 72-71 late in the third quarter before taking control with a 12-0 run. The Cavaliers scored 34 points in the fourth quarter, leading by as much as 17.\n\nCleveland had 34 assists -- one short of a season high -- led by Matthew Dellavedova with 11.\n\nTIP-INS\n\nSuns: F T.J. Warren (sore right ankle) missed his 11th straight game. He worked out at Quicken Loans Arena but has not progressed beyond shooting drills. ... Interim co-general manager James Jones accompanied the team to Cleveland. He spent the final three seasons of his career with the Cavaliers and was a member of their 2016 NBA championship squad.\n\nCavaliers: Love picked up four fouls in the first half. .... F Tristan Thompson (sore left foot) practiced Wednesday, but missed his 14th straight game.\n\nLOOKING AHEAD\n\nCleveland (13-46) has the second-worst record in the East. Both teams are in line for a prime spot in the May 14 draft lottery. The league's three worst teams will have a 14 percent chance for the first pick in the draft and a chance to take Duke star Zion Williamson.\n\nIT'S HAPPENED BEFORE\n\nCavaliers coach Larry Drew hadn't seen the video of Williamson's knee injury when the projected top pick blew out his shoe Wednesday night. Drew said the same thing happened to him in the early 1990s during training camp while he played for the Los Angeles Lakers, but he wasn't injured.\n\n\"It was kind a weird thing that happened,\" he said. \"I was in Hawaii. We were playing in a small gym that had no air conditioning. Shoes got saturated very quickly. I tried to come to a step and my foot right came out the side of my shoe.\"\n\nNUMBERS DON'T LIE\n\nSuns coach Igor Kokoskov admitted there's no way to sugarcoat his team's predicament.\n\n\"We all feel bad about it, but that's who we are right now with our record,\" he said. \"That's not opinion, that's just fact. You can't be lackadaisical and take any possession off. When you have a young team, players need to understand that every possession, every shot, every screen is important.\"\n\nUP NEXT\n\nSuns: At Atlanta on Saturday night.\n\nCavaliers: Host Memphis on Saturday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994752.7642722
}