{
  "game_id": "0022300662",
  "espn_id": "401585290",
  "date": "Jan 29, 2024",
  "matchup": "LAL @ HOU",
  "headline": "Jalen Green and Alperen Sengun power the Rockets past the Lakers 135-119",
  "body": "HOUSTON -- — Jalen Green scored 34 points and Alperen Sengun added 31 to help the Houston Rockets to a 135-119 win over the Los Angeles Lakers on Monday night.\n\n\r\n              Houston led by as many as 30 points in the second half before the Lakers used a 20-5 run to get within 10 with four minutes left.\n\n\r\n              The Rockets scored the next six points, with three from Green, to make it 127-111 with about three minutes left and the Lakers removed their starters.\n\n\r\n              Green, the second overall pick in the 2021 draft, is working to be a more all-around player in his first season under coach Ime Udoka.\n\n\r\n              “I'm building on it,” Green said. “That's what he wants from me. That's what I want for myself. Brick by brick, just going to keep learning and keep growing each game.”\n\n\r\n              LeBron James, Anthony Davis and D’Angelo Russell scored 23 points apiece for the Lakers, who had won two in a row, capped by a 145-144 double-overtime victory over Golden State on Saturday. \n\n\r\n              Cam Whitmore had 20 points off the bench for Houston, and Jabari Smith Jr. had 18 points and nine rebounds in his return after missing four games with a sprained left ankle. Green and Sengun also had 12 rebounds and seven assists each to help the Rockets to the victory. \n\n\r\n              The Rockets were up by 25 points after a basket by Sengun with about nine minutes left when the Lakers used a 12-3 run to get within 119-103 midway through the quarter.\n\n\r\n              Soon after that, James was knocked to the court after being hit in the face by Brooks as the two fought for a rebound. James remained face down on the court for a couple of minutes while team officials attended to him before getting up and walking off the court.\n\n\r\n              The play was reviewed and determined to be a flagrant 1 foul, and James remained in the game.\n\n\r\n              James missed both free throws, but made a layup seconds after that to start an 8-2 run that cut the lead to 121-111 with four minutes to go.\n\n\r\n              The Rockets led by 18 at halftime and opened the third quarter with a 16-4 run to make it 94-64 with about 7½ minutes left in the quarter.\n\n\r\n              Houston was up by 29 a couple of minutes later before the Lakers used an 11-2 spurt, with five points from Davis, to cut the lead to 101-81 with about two minutes left in the third.\n\n\r\n              James was disappointed in how they performed to end the first quarter. \n\n\r\n              “We just didn’t get back,” he said. “We didn’t have a sense of care factor. We didn’t have no care factor in those last two minutes.” \n\n\r\n              The Lakers' Jarred Vanderbilt was ejected in the second quarter after getting two technical fouls during an exchange with Brooks.\n\n\r\n              Vanderbilt got his first technical foul after pushing Brooks below the neck after a basket by the Lakers with about 10 minutes left in the second quarter. Brooks was walking away from Vanderbilt and had his back to him when Vanderbilt tapped him on the back of the head, drawing another technical and an immediate ejection. \n\n\r\n              Vanderbilt appeared to be upset after Brooks pushed him while he was in the air on a dunk about a minute earlier. He landed awkwardly after making that shot and fell to the ground. \n\n\r\n              “I feel like he felt like I did a dirty play,” Brooks said. “And when he feels that way he likes to bump. And it’s basketball, we bump and tussle and I feel like he took it a little too far.”\n\n\r\n              James refused to talk about Brooks, but Davis had plenty to say about him. \n\n\r\n              “You take a hard foul, it’s part of basketball,” Davis said. “But you’re just not going to blatantly push someone in their back when they have no control of their body in the air. I think he should have got ejected for that. And then … obviously you know that him and Bron have their whatever and from what I saw it was just a blatant hit on LeBron to the face.”\n\n\r\n              UP NEXT\n\n\r\n              Lakers: Visit Atlanta on Tuesday.\n\n\r\n              Rockets: Host New Orleans on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764995509.798044
}