{
  "game_id": "0022400767",
  "espn_id": "401705333",
  "date": "Feb 11, 2025",
  "matchup": "MEM @ PHX",
  "headline": "Ja Morant scores 26 and the Grizzlies hold on late to beat Durant and the Suns 119-112",
  "body": "PHOENIX -- — Ja Morant scored 26 points, Desmond Bane had 20 and the Memphis Grizzlies held on to beat the Phoenix Suns 119-112 on Tuesday night.\n\n\r\n              Kevin Durant became the eighth player in NBA history to reach 30,000 points when he sank two free throws with 1:11 left in the third quarter. Durant finished with 34 points but Phoenix lost for the fifth time in its last six games.\n\n\r\n              Jaren Jackson Jr. added 17 for Memphis, which led by as many as 19 before Phoenix cut the margin to three on Bol Bol's 3-pointer with 2:34 left. Morant's layup on the ensuing possession turned back the threat.\n\n\r\n              The Grizzlies had a 60-42 rebounding edge and got 44 points from bench players. Santi Aldama had 14 points and made four 3-pointers.\n\n\r\n              Takeaways\r\n              Grizzlies: Memphis has won three straight on the road for the first time this season. The Grizzlies are now 15-11 away and 21-6 at home.\n\n\r\n              Suns: Phoenix — playing without injured guard Bradley Beal — still seems to be searching for a consistent playing rotation. Bol Bol supplied a spark with 18 points and 14 rebounds, but it wasn't enough to push the Suns to victory. They fell to 26-27 for the season.\n\n\r\n              Key moment\r\n              Memphis led 45-36 with 7 1/2 minutes remaining in the second quarter before going on a 13-3 run to build a sizable lead. Scotty Pippen Jr. had six points and Jackson contributed five in that stretch.\n\n\r\n              Key stat\r\n              The Grizzlies improved to 14-3 following a defeat this season. They have not lost consecutive games since Jan. 3-4.\n\n\r\n              Up next\r\n              The Grizzlies visit Los Angeles Clippers on Wednesday and the Suns travel to Houston on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764997725.718221
}