{
  "game_id": "0022300501",
  "espn_id": "401585129",
  "date": "Jan 07, 2024",
  "matchup": "MIN @ DAL",
  "headline": "Irving hits big 3-pointers, scores 35 points to lead the Mavericks over the Timberwolves, 115-108",
  "body": "DALLAS -- — Kyrie Irving made the tying and go-ahead 3-pointers, finishing with 35 points to lead the Dallas Mavericks to a 115-108 victory over the Minnesota Timberwolves on Sunday night.\n\n\r\n              Irving shot 14 of 27, including 6 of 8 from the 3-point arc. Luka Doncic added 34 points on 12-of-26 shooting, including 5 of 12 from the 3-point arc.\n\n\r\n              Irving’s 3 from the top of the arc tied it at 106 with 2:59 remaining. He then stole the ball from Rudy Gobert and made another 3 from the right corner with 2:05 to play.\n\n\r\n              Derrick Jones Jr. sealed the Mavs’ win with a driving dunk with 24 seconds to go.\n\n\r\n              “We knew we were undersized against Gobert and (Karl-Anthony Towns) tonight, so we wanted to do our best job possible rebounding and doing the little things,” Irving said. “Little things got us this win today.”\n\n\r\n              Anthony Edwards led all scorers with 36 points on 14-of-27 shooting for the Timberwolves. Minnesota had won the first two meetings this season.\n\n\r\n              It was a clutch finish for the Mavs (22-15) against the best clutch team statistically in the NBA. Dallas improved to 12-5 in clutch games, third-best in the league. Minnesota is now 11-3 in clutch games, which occur when the scoring margin is within five points with five or fewer minutes remaining.\n\n\r\n              Minnesota (25-10) is the top team in the Western Conference and has the second-best record in the league behind the Boston Celtics. Dallas entered the game seventh in the West, a half-game behind the New Orleans Pelicans.\n\n\r\n              Irving hit a 10-footer to give the Mavs a 96-87 lead early in the fourth quarter. But the Wolves’ 19-4 run over the next six minutes gave them a six-point lead with 3:45 remaining. Minnesota scored 11 consecutive points before Dwight Powell converted a three-point play on a layup and free throw with 3 1/2 minutes left to cut the deficit to three.\n\n\r\n              “It was a really good game. We got down, we came back, we took a lead. Normally we’ve been winning those games, but today we didn’t,” Timberwolves coach Chris Finch said. “I thought we had some good looks, just maybe rushed at times.”\n\n\r\n              Irving hit consecutive 3-pointers to give the Mavs a 78-73 lead midway through the third quarter, and the Mavs finished the period on a 19-9 run to take a 91-82 lead behind a scoring surge from Doncic and Irving. The pair combined to score 14 points during the run.\n\n\r\n              The Mavs had eight blocks and seven steals, including two and three from Irving.\n\n\r\n              Dallas led 60-56 at the half behind 52.3% shooting compared to Minnesota’s 43.5% shooting. The T-Wolves outrebounded the Mavs 26-19 at the half, but Dallas held its own on the boards in the second half, finishing even with Minnesota 25-25 on the glass.\n\n\r\n              “I thought they were good looks, just didn’t make them,” said Towns, who was 8 of 16 from the field, including 3 of 9 from the 3-point arc. “They obviously, defensively, presented a lot of challenges, and they scored a lot of points. They’re really good players; we try to make it as difficult as possible. We‘ve got great defenders on this side – they made some tough shots – we had to make some tough shots to fight back into this game as a team. We just didn’t find a different way to win tonight.”\n\n\r\n              The Mavs were without Dante Exum (right plantar fascia), Maxi Kleber (right toe dislocation), and Dereck Lively II (left ankle sprain).\n\n\r\n              UP NEXT\n\n\r\n              Timberwolves: Visit Orlando on Tuesday.\n\n\r\n              Mavericks: Host Memphis on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996476.4522219
}