{
  "game_id": "0021900563",
  "espn_id": "401161205",
  "date": "Jan 09, 2020",
  "matchup": "DET vs. CLE",
  "headline": "Cavaliers rally past Pistons, 115-112 in OT",
  "body": "DETROIT --  Tristan Thompson and the Cleveland Cavaliers finished a tumultuous couple days with an emotional victory.\n\nHowever they felt about what had unfolded between them and coach John Beilein, the Cavaliers kept playing hard.\n\nThompson scored a career-high 35 points with 14 rebounds, and Kevin Love made a tiebreaking 3-pointer with 37.9 seconds left in overtime to lift Cleveland to a 115-112 victory over the Detroit Pistons on Thursday night. The Cavaliers snapped a five-game losing streak, rallying from a 13-point third-quarter deficit.\n\nBeilein said earlier Thursday that he'd apologized for his comments during a film session the previous day. ESPN.com, citing unidentified sources, reported that Beilein suggested during a Wednesday film session his players were no longer playing \"like a bunch of thugs.\" Beilein said he meant to say \"slugs\" in reference to the team's effort level.\n\nAlthough Beilein said the response to his explanation and apology had been positive, it was anyone's guess how the Cavaliers would play.\n\n\"We motivate each other, at the end of the day -- especially myself and Kev,\" Thompson said. \"It's on us to motivate our teammates. Coach's job is to give us the scout and the game plan, but we don't need no coaches at all to motivate us. Us as players, we motivate each other.\"\n\nWith the score tied at 110, Love got open in the left corner and connected from long range to put the Cavaliers ahead to stay. Thompson got free for a dunk with 16.7 seconds remaining to push the lead to five.\n\nDetroit had one last chance after forcing a turnover, but Derrick Rose missed a 3-pointer in the final seconds. Rose also missed a jumper at the end of regulation that could have won it.\n\nBeilein downplayed the idea that this victory was extra special because of the previous 48 hours.\n\n\"The past couple days are part of today's world,\" Beilein said. \"It is great to get a win for these guys right there, and that's all it's really about.\"\n\nThere was no question the Cavaliers were in an upbeat mood in the locker room afterward.\n\n\"Usually, you go into a college locker room, and everybody's jumping around. Pro locker room, everybody's chilling after a win,\" Beilein said. \"That locker room was hopping around right now -- everybody was really excited.\"\n\nAndre Drummond had 28 points and 23 rebounds for Detroit. The Pistons are without star forward Blake Griffin, who had surgery on his left knee.\n\nThe Cavaliers rallied from their double-digit deficit and took a brief lead at 91-90 in the fourth. Detroit answered with nine straight points, but Cleveland battled back again, and it was tied at 102 at the end of regulation.\n\n\"We just didn't play the right way in the second half. We allowed them to get a rhythm going,\" Drummond said. \"We allowed them to get some steam.\"\n\nROSTER MOVE\n\nThe Cavaliers signed F Alfonzo McKinnie to a 10-day contract. He scored four points and made an impact defensively.\n\n\"That's (assistant) J.B. Bickerstaff. We wanted him in there for defense, but he was the one with, `Let's put him on Rose,\" Beilein said. \"He does most of our substitutions and our matchups, and I never would have thought of that one.\"\n\nGOING INSIDE\n\nCleveland went just 5 of 20 from 3-point range, and Love's late 3 was the only one the Cavaliers made after the end of the third quarter.\n\nCollin Sexton made only one 3 but finished with 19 points and six rebounds. Darius Garland had 20 points and seven assists.\n\n\"It felt good to get a win for our team, as well as coach,\" Sexton said. \"Show him we're with him.\"\n\nTIP-INS\n\nCavaliers: Cleveland was without G Dante Exum (illness), F Larry Nance Jr. (left knee soreness), G Kevin Porter Jr. (left knee sprain) and G-F Dylan Windler (left lower leg stress reaction). ... Love had 17 points and nine rebounds.\n\nPistons: Detroit was missing Griffin, G Luke Kennard (bilateral knee tendinitis), F Markieff Morris (left foot sprain), G Khyri Thomas (right foot surgery) and G Reggie Jackson (lumbar spine stress reaction). ... Drummond had 10 rebounds at the offensive end and 13 on defense. ... Rose scored 27 points.\n\nUP NEXT\n\nCavaliers: At Denver on Saturday night.\n\nPistons: Host Chicago on Saturday night.\n\n---\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996280.0306618
}