{
  "game_id": "0022400156",
  "espn_id": "401704722",
  "date": "Nov 04, 2024",
  "matchup": "LAL @ DET",
  "headline": "Cunningham has 3rd career triple-double to help the Pistons beat the Lakers, 115-103",
  "body": "DETROIT -- — Cade Cunningham had 17 points, 11 rebounds and 11 assists for his third career triple-double and the Detroit Pistons beat the Los Angeles Lakers 115-103 on Monday night.\n\n\r\n              Jaden Ivey matched a season high with 26 points. Tim Hardaway Jr. scored 19 points, Tobias Harris had 15 points and Jalen Duren had 11 points and 14 rebounds.\n\n\r\n              Anthony Davis scored 37 points for Los Angeles, and LeBron James had 20 points, 11 assists and eight rebounds. Davis appeared to hurt his left ankle late in the fourth quarter, but stayed in the game.\n\n\r\n              Austin Reaves added 17 points on 7-of-17 shooting for the Lakers.\n\n\r\n              Detroit got off to a strong start, leading 33-22 after a quarter, and maintained control of the game all night.\n\n\r\n              Takeaways \r\n              Lakers: Davis is off to perhaps the best start of his career. He entered the game averaging an NBA-high 31.8 points and was ahead of his scoring pace early, scoring nine points in each of the first two quarters. The 31-year-old center was 13 of 23 from the field and grabbed a team-high nine rebounds. Two hours before the game, he was one of two Lakers working on his shot.\n\n\r\n              Pistons: After leading the league in losses in each of the last two seasons, Detroit is showing signs of improvement under first-year coach J.B. Bickerstaff. The Pistons have won three games, a total they didn't reach until Dec. 30 last year. Detroit has won three of four games, a relative stretch of success it had only once last season from March 7-13.\n\n\r\n              Key moment \r\n              Ivey made a 3-pointer and a jumper late in the game, both off assists from Cunningham, to seal the victory.\n\n\r\n              Key stat \r\n              Detroit outrebounded Los Angeles 55-37 and had a 22-13 edge in second-chance points.\n\n\r\n              Up next \r\n              The Lakers close a five-game trip Wednesday night at Memphis. The Pistons are at Charlotte on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764997215.5911539
}