{
  "game_id": "0022300582",
  "espn_id": "401585210",
  "date": "Jan 18, 2024",
  "matchup": "MEM @ MIN",
  "headline": "West-leading Timberwolves beat Grizzlies 118-103 to reach midpoint with 30-11 record",
  "body": "MINNEAPOLIS -- — Anthony Edwards scored 26 of his 28 points in the second half and the West-leading Minnesota Timberwolves beat the injury-ravaged Memphis Grizzlies 118-103 on Thursday night.\n\n\r\n              Rudy Gobert had 17 points and 10 rebounds and tied his season high with six blocks, Naz Reid scored 20 points and Mike Conley had 17 points and 10 assists. Minnesota outscored the Grizzlies 37-17 in the fourth quarter after leading for less than five minutes of the first three periods.\n\n\r\n              “It felt to me as long as we just keep it close, we can find a run,” Wolves coach Chris Finch said.\n\n\r\n              Jaren Jackson Jr. had 36 points and Luke Kennard added 18 points for the Grizzlies, who had their eighth starting-lineup combination in nine games this month and never let their lack of depth limit their energy as they started a four-game trip. They put on a passing and cutting clinic against the league leader in scoring defense. \n\n\r\n              Santi Aldama, who had 13 points off the bench, tried to get under Gobert's skin with stare-downs, trash talk and lobbying the officials for foul calls on the three-time NBA Defensive Player of the Year.\n\n\r\n              But Edwards came to life with 14 points in the third quarter, at one point escaping traffic in the lane by chest-passing the ball off the backboard to himself for a dunk that sent the crowd into a frenzy.\n\n\r\n              “That’s just kudos to him and how athletic he is,” Reid said.\n\n\r\n              Conley had the first eight points — burying a pair of 3-pointers from the wing — on an 11-0 run for the Wolves early in the fourth that gave them the lead for good at 96-89.\n\n\r\n              “You don’t always win pretty, and they don’t ask you how you win at the end of the year,” Conley said.\n\n\r\n              The Wolves (30-11) hit the midpoint of their schedule on pace for 60 wins. The franchise record (58) was set in 2003-04 when they reached the Western Conference finals, the only year they've ever advanced past the first round of the playoffs. They're 17-2 at home and 21-6 against conference opponents, also paces for franchise records. The Wolves could lose their last 41 games and still finish with a better record than they had in 15 of their first 34 seasons.\n\n\r\n              “This team’s got it clicking on both sides of the floor,” Grizzlies coach Taylor Jenkins said.\n\n\r\n              The Grizzlies beat the Wolves in six games two years ago in an intense first-round series matching two up-and-coming teams, but the Grizzlies have gone sideways since then.\n\n\r\n              With Ja Morant out for the rest of the season following shoulder surgery and Marcus Smart ( finger ) and Desmond Bane ( ankle ) sidelined for more than another month, the Grizzlies are missing three of their top four scorers. Veteran center Steven Adams had season-ending knee surgery, and key reserve Brandon Clarke remains sidelined since tearing his Achilles tendon more than 10 months ago. Backups Derrick Rose (hamstring) and Jake LaRavia (ankle) are out, too.\n\n\r\n              The Grizzlies went 6-3 with Morant, who started the season with a 25-game suspension from the NBA for off-the-court behavior. They're 9-23 without him.\n\n\r\n              “The guys have been doing it all season long,\" Jenkins said. \"Some nights you're going to breakthrough. Some nights you're going to come up a little bit short.”\n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: At Chicago on Saturday night. \n\n\r\n              Timberwolves: Host Oklahoma City on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996020.300805
}