{
  "game_id": "0021900437",
  "espn_id": "401161079",
  "date": "Dec 21, 2019",
  "matchup": "PHX vs. HOU",
  "headline": "Harden racks up 47 points, Rockets beat Suns 139-125",
  "body": "PHOENIX --  The James Harden-Russell Westbrook combo is starting to become everything the Houston Rockets hoped it would be. The two superstar guards bring different speeds to the offense, and the Phoenix Suns couldn't stop either one Saturday.\n\n\"Russell is go, go, go, go,\" Rockets coach Mike D'Antoni said. \"When it's half-court, maybe it's James' time.\"\n\nHarden scored 47 points, Westbrook added 30 and the Rockets rolled to a 139-125 victory over the Suns for their 10th victory in the past 13 games.\n\nPhoenix pulled to 115-107 with 9:37 left but the Rockets responded with a 21-9 run -- which included four 3-pointers from Harden -- that slowly deflated the Suns' players and crowd.\n\nHarden shot 15 of 27 from the field, including 9 of 19 from 3-point range. He leads the NBA with 38.5 points per game and blew past that number with his fourth quarter outburst, hitting his quartet of 3s in a span of about three minutes.\n\nThe former Arizona State star has already scored 1,124 points this season, most for a player through 29 games since Rick Barry had 1,134 in the 1966-67 season. By the end of the night, he received an ovation from a big chunk of the fans.\n\n\"This city has shown me so much love before I even got to the NBA,\" Harden said. \"So I feel like it's my job to go out there and put on a show.\"\n\nHarden's scoring has been a constant throughout the season, but Westbrook's production has spiked in recent weeks. He's averaging 33.7 points, 8.0 rebounds and 6.3 assists over his past three games. The two players took turns dominating on Saturday, hitting Phoenix with waves of offense that couldn't be stopped.\n\n\"I don't know if 30 (points) is a benchmark or not, but Russell's playing really well, doing a lot of stuff,\" D'Antoni said. \"And you know James has been playing great.\"\n\nSaid Westbrook: \"It's a good balance for our team, for myself. I think it's moving in the right direction.\"\n\nWestbrook added 10 assists, and Clint Capela had 14 points and 17 rebounds. The Rockets shot 59% from the field.\n\nThe Suns have lost six straight games and fell to 11-18. Kelly Oubre Jr. led Phoenix with 26 points, and Devin Booker had 19. Elie Okobo scored 17 in his first start of the season and all five starters scored in double digits for just the third time this season.\n\nBooker said he thought the Suns did a good job of competing in the second night of a back-to-back after losing to the Thunder on Friday, but they couldn't figure out a way to stop Harden or Westbrook.\n\n\"They're MVP players, they're going to make those shots,\" Booker said. \"It's how you respond and just keep defending and playing the right way.\"\n\nHarden scored 18 points in the first quarter and had 29 by halftime, shooting 10 of 15 from the field, including 4 of 8 from 3-point range. The Rockets led 70-65 at the break after shooting 61% from the field.\n\nTIP-INS\n\nRockets: G Eric Gordon (knee) has missed the past 19 games after having knee surgery. He had the surgery on Nov. 13 and was expected to miss about six weeks. Houston coach Mike D'Antoni said he wasn't sure if Gordon would return during the team's four-game trip that ends on Christmas Day against Golden State.\n\nSuns: C Deandre Ayton missed his second straight game with a sprained ankle. Ayton played in just one game after returning from his 25-game suspension, scoring 18 points against the Clippers in 24 minutes before leaving in the second half after injuring his ankle. ... PG Ricky Rubio missed the game because of an illness. Okobo started in his place.\n\n\"You can boo-hoo and whine about it, but it does no good,\" Phoenix coach Monty Williams said pregame. \"You look around the league, Minnesota is missing players, New Orleans is missing players all year. ... It's happening to everyone. I don't know if anyone's dealt with what we've dealt with, but I like my team, I like the fight and the way they show up every day.\"\n\nUP NEXT\n\nRockets: Play the third game of the their four-game road trip against the Kings on Monday.\n\nSuns: Host the Nuggets on Monday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996573.127311
}