{
  "game_id": "401809992",
  "espn_id": "401809992",
  "date": "Oct 29, 2025",
  "matchup": "PHX vs MEM",
  "headline": "Ja Morant's jumper with 7.6 seconds left lifts Grizzlies over the Suns 114-113",
  "body": "PHOENIX -- — Ja Morant scored 28 points — including a go-ahead 11-foot jumper with 7.6 seconds remaining — to push the Memphis Grizzlies past the Phoenix Suns 114-113 on Wednesday night.\n\n\r\n              The Suns trailed 99-89 midway through the fourth, but rallied to tie at 108 on Devin Booker's jumper with 2:23 left. Mark Williams had a dunk with 51.4 seconds to give Phoenix a 113-112 lead.\n\n\r\n              The teams traded scoreless possessions before Santi Aldama found Morant for the game-deciding bucket. Booker — who scored 16 of his 32 points in the fourth quarter — had a potential game-winning 3 bounce off the rim at the buzzer.\n\n\r\n              The Grizzlies have won six straight over the Suns.\n\n\r\n              Phoenix forward Royce O'Neale hit a 3-pointer with 9:16 left to tie the score at 87, but the Grizzlies scored the next seven points and kept the lead through much of the fourth. \n\n\r\n              Jaren Jackson Jr. had 18 points for Memphis. Aldama had 14 points, 10 rebounds and five assists off the bench, turning to stare at the Suns bench after a 3-pointer gave the Grizzlies a 106-97 lead with 5:04 left.\n\n\r\n              Morant scored 18 points in the second half and shot 10 of 19 from the field. He added eight rebounds and seven assists. \n\n\r\n              Booker shot just 10 of 26 from the field. Williams got his first start with the Suns and finished with 20 points on 9-of-11 shooting and 11 rebounds.\n\n\r\n              The Suns have dropped four straight since beating the Sacramento Kings in the opening game of the season.\n\n\r\n              Phoenix led 53-49 at halftime. Collin Gillespie had 13 of his 14 points before the break.\n\n\r\n              Suns guard Jalen Green (hamstring) didn't play for the fifth straight game while Dillon Brooks (groin) missed his second game in a row.\n\n\r\n              Up next\r\n              Grizzlies: Host the Lakers on Friday.\n\n\r\n              Suns: Host the Jazz on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042528.164854
}