{
  "game_id": "0021900647",
  "espn_id": "401161289",
  "date": "Jan 20, 2020",
  "matchup": "MIL vs. CHI",
  "headline": "Antetokounmpo has triple-double as Bucks down Bulls 111-98",
  "body": "MILWAUKEE --  The Milwaukee Bucks committed 23 turnovers -- and won anyway.\n\nGiannis Antetokounmpo and Co. finished strong on Monday.\n\nAntetokounmpo had a triple-double and scored his 10,000th career point, and the Bucks beat the Chicago Bulls 111-98 to sweep the four-game season series.\n\nAntetokounmpo had 28 points, 14 rebounds and 10 assists for his fourth triple-double of the season. He reached 10,000 points on a jump hook with 4:30 remaining in the fourth.\n\nBut the reigning NBA MVP also committed eight turnovers. The Bulls scored 24 points off Milwaukee's miscues.\n\nAntetokounmpo said he thinks a trip to Paris this week, as well as the rare late afternoon, weekday start, may have played a part in the team's sloppy play.\n\n\"A game like this, it's kind of a tricky game,\" he said. \"We're about to leave to go to Paris, we've got to take care of our family here, make sure everything's right. You've got to make sure you pack your bags, all that other stuff. It takes away from the game.\"\n\nAntetokounmpo shrugged off the turnovers to help the Bucks pull away late.\n\n\"Having turnovers doesn't slow me down. I want to keep being aggressive,\" he said.\n\nBucks coach Mike Budenholzer credited the Bulls' aggressive defensive scheme.\n\n\"Chicago makes it hard on you,\" he said. \"They force a lot of turnovers, they're active defensively.\"\n\nKhris Middleton added 24 points for Milwaukee, which has won 10 consecutive games over the Bulls dating to the 2017-18 season. It's the Bucks' longest winning streak over Chicago since the teams began playing in 1968.\n\nThe Bucks ran their league-best record to 39-6 with their seventh straight victory. Milwaukee shot 58%, with Middleton connecting on 10 of 13 shots.\n\nZach LaVine had 24 points for Chicago, which shot just 37%. Kris Dunn scored 15 points, and reserve Thaddeus Young added 14 points.\n\nLaVine has scored at least 20 points in 11 consecutive games.\n\n\"We just kept fighting and scrapping,\" Bulls coach Jim Boylen said. \"If we have a normal shooting night from the 3, it's a different outcome.\"\n\nAfter a sloppy first half by both teams, the Bucks began to take control, opening the third quarter on a 13-4 run, sparked by Middleton's eight points. Milwaukee's lead grew to as many as 16 in the quarter before Chicago clawed back.\n\nTIP-INS\n\nBulls: Two-way player Adam Mokoka returned to the team and was active but did not play. ... After being outscored 14-0 by Bucks reserves in first quarter, Chicago's bench outscored Milwaukee's 16-6 in the second. ... Boylen was whistled for a technical foul as the teams left the court at halftime. ... Young had a season-high four 3-pointers.\n\nBucks: Robin Lopez sat out a second consecutive game due to an undisclosed illness. Lopez will not accompany the team on the trip to Paris. \"It makes sense for Robin to stay and try and get healthy,\" Budenholzer said. ... With Lopez out, Budenholzer turned to Dragan Bender, who has played mostly with the team's G-League affiliate this season, to be the first big man off the bench. ... Milwaukee scored 100 or more points for the 69th straight game, dating to last February. ... Had 15 first-half turnovers.\n\nFRENCH CONNECTION\n\nThe Bucks take on the Hornets in Paris on Friday. \"I think we can go over there in a good mindset. I think the whole group, including myself, are excited about experiencing Paris and a little bit of French culture and just the people and the excitement for the NBA game and our team,\" Budenholzer said. \"I think there's a really healthy outlook on spending three or four days together as a team, all those bonding opportunities, whether it be meals or walking the streets and seeing different things.\"\n\nMARKKANEN MISSES\n\nBoylen said he remains confident in Lauri Markkanen despite his ongoing shooting struggles. The 7-foot Markkanen went 0 for 7 from 3-point range against the Bucks.\n\n\"I know he's going to work. He cares and he has high character,\" Boylen said. \"I believe in him and our team believes in him.\"\n\nMarkkanen shot 2 for 11 overall.\n\n\"I've had long stretches where I didn't make shots. I'm not worried about that,\" Markkanen said.\n\nUP NEXT\n\nBulls: Host Minnesota on Wednesday in their first meeting of the season.\n\nBucks: Travel to France to face Charlotte on Friday. Milwaukee will be the visiting team in the NBA's first regular-season game in Paris. It will be the Bucks' second regular-season game in Europe. Milwaukee played the New York Knicks in London during the 2014-15 season.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996141.068702
}