{
  "game_id": "0022000324",
  "espn_id": "401267484",
  "date": "Feb 02, 2021",
  "matchup": "BKN vs. LAC",
  "headline": "Irving scores 39, Nets cool off Clippers with 124-120 win",
  "body": "NEW YORK -- — Kyrie Irving, Kevin Durant and James Harden relished a chance to test themselves against the NBA's best.\n\n\r\n                    The Los Angeles Clippers left Brooklyn impressed — and eager for another shot at the Nets.\n\n\r\n                    Irving scored a season-high 39 points, including eight straight in the fourth-quarter run that sent Brooklyn into the lead for good, and the Nets beat the Clippers 124-120 on Tuesday night.\n\n\r\n                    Durant added 28 points, Harden had 23 points, 14 assists and 11 rebounds, and the three stars scored all the points in the decisive 13-0 spurt. The Nets held on from there to snap the Clippers' three-game winning streak.\n\n\r\n                    “We just matched it tonight,\" Irving said. \"We knew that they were going to bring it, so it was just an exciting game. It was great competition for the top players in the world, some of the top players in the world to go against each other on TV.” \n\n\r\n                    Kawhi Leonard scored 33 points and Paul George had 26 for the Clippers, who entered with the NBA's best record and lost for just the second time in 12 games.\n\n\r\n                    They had a five-point lead midway through the fourth before Durant hit a 3-pointer. Irving followed with one of his own, then made a basket and another 3. Harden finished off the spurt with a 3, making it 110-102 with 4:10 to play.\n\n\r\n                    “I thought there was a stretch there where we played great defense, were in their face and it was almost like each one of them took a turn making a shot,” George said. “They’re just tough. They're tough to guard.” \n\n\r\n                    The Clippers got it down to one in the final seconds before Irving's free throws closed it out. They host the Nets on Feb. 21.\n\n\r\n                    “It was a fun matchup,\" George said. \"Look forward to doing it again.” \n\n\r\n                    The Nets bounced back from an embarrassing defensive performance, when they gave up 48 points in the fourth quarter Sunday in a 149-146 loss to Washington, which has the fewest wins in the league. \n\n\r\n                    Looking good defensively promised to be difficult against a Los Angeles team that came in leading the NBA in 3-point percentage. The Clippers finished 15 for 36, right at their average of 41.7%, but Irving hit six behind the arc and the Nets got the stops they needed for their sixth straight home victory.\n\n\r\n                    “Once we get that down pat defensively, you’re talking about blowing teams out,” Harden said, “because offensively we’ll continue to figure it out. Defensively, we have to figure it out. That’s what it has to be in order for us to be playing at the end.”\n\n\r\n                    The Clippers made nine of their first 11 shots and raced to a 12-point lead. The margin was still 11 with under 3 1/2 minutes left in the half, but the Nets closed with a 12-2 spurt to trail just 58-57 at the break.\n\n\r\n                    TIP-INS\n\n\r\n                    Clippers: Nicolas Batum returned after missing a game with a groin injury and scored 21 points. ... One of Tyronn Lue's assistants is Kenny Atkinson, who was the Nets' coach for 3 1/2 seasons before they made a change in March just before the season was suspended. Lue chuckled and offered a “no comment” when asked if he thought the game meant extra to Atkinson, who is from New York. \n\n\r\n                    Nets: Brooklyn had scored 30 or more points in nine straight quarters before being held to 24 in the first. ... Nets coach Steve Nash thought it was “probably too soon” to expect that center Norvel Pelle, signed last week, could make a contribution, but added “we can’t say that forever.”\n\n\r\n                    MUST-SEE TV\n\n\r\n                    The Nets played their 10th game since acquiring Harden on Jan. 14. YES Network, which televises the Nets locally, said viewership was up 69% from then, from an average of 72,000 viewers to 122,000. The two most-viewed games globally on NBA League Pass this season have come since Harden's acquisition. The Jan. 21 game against Cleveland when the Big Three played together for the first time was first followed by the Jan. 16 game when Harden made his Nets debut against Orlando.\n\n\r\n                    UP NEXT\n\n\r\n                    Clippers: Visit the Cleveland Cavaliers on Wednesday in the final game of their six-game trip.\n\n\r\n                    Nets: Host the Toronto Raptors on Friday.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997507.705282
}