{
  "game_id": "0021800341",
  "espn_id": "401071022",
  "date": "Dec 02, 2018",
  "matchup": "DAL vs. LAC",
  "headline": "Barnes, Jordan star in Mavericks' 114-110 win over Clippers",
  "body": "DALLAS --  DeAndre Jordan said he didn't have any extra incentive Sunday night in his first meeting against his former team. His 23 rebounds might indicate otherwise.\n\nJordan scored 16 points to go with his season-high rebound total, and Harrison Barnes had 30 points to help the Dallas Mavericks beat the Los Angeles Clippers 114-110.\n\nDorian Finney-Smith tipped in a rebound with 35 seconds remaining to give Dallas the lead for good.\n\nJordan, who played 10 seasons with Los Angeles before signing with Dallas as a free agent this offseason, downplayed the motivation to beat his former team. He talked instead about setting a tone for his own team with his rebounding. Dallas won the rebound battle 64-44 on Sunday.\n\n\"I know it's demoralizing to other teams -- playing defense and then having us get offensive rebounds,\" Jordan said. \"That sucks the life out of a team, little by little.\"\n\nThe game featured two loose-ball scraps between the Mavs' Dennis Smith Jr. and the Clippers' Patrick Beverley -- the first resulting in Smith losing part of a tooth, and the second in Beverley's ejection after a technical foul.\n\nMontrezl Harrell scored 23 points to lead the Clippers, and Danilo Gallinari and Lou Williams each had 21.\n\n\"It was a game we should have won,\" Williams said. \"We didn't do a lot of things in our style of play.\"\n\nWilliams gave the Clippers just their second lead of the second half at 110-109 with a 3-pointer with 46.9 seconds left, before Barnes drove the lane and missed -- but Finney-Smith was there for a tip-in.\n\nJordan then stole the ball from Williams and made one of two free throws for a 112-110 lead with 27.3 seconds to play. Smith blocked Tobias Harris' shot, gathered the ball and made the clinching free throws with 9.2 seconds left.\n\n\"That's winning stuff right there,\" Mavericks coach Rick Carlisle said of Smith's play.\n\nDallas played without rookie Luka Doncic, who suffered a right hip strain Friday against the Lakers. Without a true wing off the bench, Barnes played 38 minutes.\n\nA TOOTH AND A TECH\n\nSmith and Beverley were involved in separate loose-ball scrambles in the third and fourth quarters, both resulting in jump balls but having ramifications beyond the plays themselves.\n\nIn the first sequence, Beverley appeared to elbow Smith in the mouth, causing Smith to lose part of a tooth. Smith left the game briefly for medical attention, only after winning the jump ball. And he appeared postgame with the tooth appearing intact, calling it \"magic.\"\n\nThen the two wrestled on the floor for another loose ball in the fourth quarter, and after Beverley got up holding the ball, he threw the ball into the stands, earning a technical foul and an ejection. He said after the game that a fan uttered an expletive about his mother.\n\n\"Anybody that knows me knows that I'm a family first guy and some things are just unacceptable,\" Beverley said. \"If no one is going to control fans, what are we supposed to do as players? I'm a grown man, but when you bring family into it, especially in a basketball game, there's only so much you can tolerate as a man.\"\n\nTIP-INS\n\nClippers: Coach Doc Rivers on Beverley's technical: \"I told him it's the life we live and you got to turn the other cheek even though I know it's hard, but we can't get technicals. We just have to walk away and then the league has to take care of stuff like that.\" ... The Clippers lost for just the second time in 11 games.\n\nMavericks: In addition to Doncic, reserve forward Maxi Kleber sat out with right knee soreness. Coach Rick Carlisle doesn't believe either injury is serious. ... Barnes' 30 points were a season-high, and J.J. Barea had 20 of his season-high 24 points in the first half. Barea left in the final minute with a bloody nose after an inadvertent elbow from Avery Bradley, but was fine after the game.\n\nUP NEXT\n\nClippers: Second half of a back-to-back Monday night at New Orleans.\n\nMavericks: Host Portland on Tuesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995468.37168
}