{
  "game_id": "0021600373",
  "espn_id": "400899815",
  "date": "Dec 13, 2016",
  "matchup": "OKC @ POR",
  "headline": "Lillard has 17 and Blazers beat Thunder 114-95",
  "body": "PORTLAND, Ore. -- Damian Lillard called it a breakthrough.\nComing off a one-point loss to the Clippers the night before, the Portland Trail Blazers snapped a four-game losing streak with a 114-95 victory over the Oklahoma City Thunder on Tuesday night.\nLillard had 17 points and nine assists before sitting in the fourth quarter. Mason Plumlee added 18 points for the Blazers, who led by 26 points in Portland's first game back after a 1-4 road trip.\nRussell Westbrook was off his league-leading average of 31.1 points a game with 20 for the Thunder, who have lost two of their last three after a six-game winning streak. Westbrook also sat for the final quarter.\nPortland was coming off a 121-120 loss at Los Angeles on Monday night to extend the season's longest losing streak.\n\"We had a chance to win that game, but we came up short,\" Lillard said about the game against the Clippers. \"I think all of those things we went through, and then staying with it, and the build up, tonight felt like kind of a breakthrough from all those experiences.\"\nThe Thunder were without Victor Oladipo because of a right wrist sprain, forcing Oklahoma City's first starting lineup change of the season. Jerami Grant, acquired by the Thunder in a trade with Philadelphia at the start of the season, got his first start for Oklahoma City and finished with 11 points.\n\"I didn't think that we shot the ball particularly well today,\" Thunder coach Billy Donovan said. \"I thought that we had fairly decent looks, but we didn't shoot the ball well, and I thought some of that bled into our defense a little bit.\"\nThe Blazers didn't have Al-Farouq Aminu, who has a sore back, instead starting Noah Vonleh. But Vonleh got into foul trouble, collecting three in the first quarter.\nWestbrook's 3-pointer put the Thunder up 25-16 early, but Portland came back to take a 32-31 lead on Allen Crabbe's layup before the end of the first quarter. CJ McCollum made a three-quarter court shot, but he didn't beat the buzzer.\nPortland stretched the lead to 50-36 after Evan Turner's floater and free throw. The two sides exchanged words midway through the second quarter when Lillard reached down to pick up the ball at a timeout and Westbrook kicked it.\nLillard closed out the half with a left-handed layup to make it 68-52. Plumlee's basket stretched Portland's lead to 90-65 late in the third quarter.\nPlumlee said he didn't feel Portland went through any lulls.\n\"Every time they made a 3 or they had two baskets in a row, we would get right back on defense, we would get a good shot on offense so we didn't let anything get out of control,\" he said. \"We didn't let anything snowball.\"\nTIP-INS\nThunder: Westbrook drew the ire of fans when he forcefully threw the ball and it went into the seats. He was heartily booed when he touched the ball for the rest of the game. ... The Thunder were coming off a 99-96 victory at home over Boston on Sunday.\nTrail Blazers: C.C. Sabathia and Derek Jeter had courtside seats. ... Maurice Harkless had five steals, his most as a Blazer. ... Six Portland players finished in double figures.\nALL ABOUT THE SHOES: In addition to being Star Wars Night at the Moda Center, the Blazers were celebrating the release of Lillard's new signature shoe, the Dame 3. Lillard wore an all-red version of the Adidas shoe, which will be released Wednesday, and the fans at the game were all treated to T-shirts emblazoned with Lillard's logo.\nNOT TALKING: Westbrook was asked to explain what happened with Lillard and the kicked ball: \"I don't know,\" he replied.\nUP NEXT\nThunder: Visit Utah on Wednesday night.\nTrail Blazers: Head back out on the road to face Denver on Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764995310.247287
}