{
  "game_id": "0022301051",
  "espn_id": "401585679",
  "date": "Mar 27, 2024",
  "matchup": "ATL vs. POR",
  "headline": "Dejounte Murray scores 30 points, Hawks hand Trail Blazers 8th straight loss with 120-106 victory",
  "body": "ATLANTA -- — Dejounte Murray had 30 points and seven assists and the Atlanta Hawks won their third in a row and handed Portland its eighth straight loss, beating the Trail Blazers 120-106 on Wednesday night.\n\n\r\n              Garrison Mathews hit five 3-points and scored a season-high 21 points to help the Hawks remain 10th in the Eastern Conference and avenge a 106-102 loss in Portland on March 13. Matthews led the Atlanta backups to 41 points.\n\n\r\n              Bogdan Bogdanovic added 16 points and five assists, and Clint Capela had 16 points and 10 rebounds.\n\n\r\n              “(Murray)'s efficiency tonight was just terrific,” Hawks coach Quin Snyder said. “He picked his spots. He set people up. He really set the tone for us.”\n\n\r\n              Murray was questionable with back soreness before the game, but led the Hawks at both ends of the floor.\n\n\r\n              “I always try to make the right basketball play, keeping confidence in my guys,” Murray said. “They know I believe in them. I’m always looking to get them the ball and for them to be aggressive taking shots.”\n\n\r\n              Dalano Banton led Portland with a career-high 31 points off the bench. He also had nine assists and five rebounds. Toumani Camara had 17 points, and Scoot Henderson added 15 points and six assists.\n\n\r\n              For the third straight game, the Trail Blazers started five rookies due to injuries throughout the roster, including Deandre Ayton, Jerami Grant, Matisse Thybulle, Malcom Brogdon and Anfernee Simons.\n\n\r\n              The Blazers were 14 of 31 from 3-point range, but committed 18 turnovers.\n\n\r\n              The Hawks were without multiple starters as well, with star Trae Young recovering from a finger injury and fellow starters Jalen Johnson and Saddiq Bey also out.\n\n\r\n              Mathews has seen his playing time climb with the rash of injuries, and he has taken advantage with two 20-point outings in his last three games. He is 11-for-17 from three during that stretch.\n\n\r\n              The Hawks had 10 first-half steals and hit seven of 11 three-pointes in the second quarter to take a 65-58 lead at the break.\n\n\r\n              An 11-0 burst from the Hawks early in the third quarter pushed the lead to 76-60. Murray and Bogdanovic combined for nine points during the run. The Hawks never let the lead get below nine points after that.\n\n\r\n              UP NEXT\n\n\r\n              Trail Blazers: At Miami on Friday night.\n\n\r\n              Hawks: Host Boston on Thursday night. On Monday night in Atlanta, the Hawks beat the NBA-leading Celtics 120-118.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764996266.353224
}