{
  "game_id": "0022000374",
  "espn_id": "401267534",
  "date": "Feb 08, 2021",
  "matchup": "LAL vs. OKC",
  "headline": "Lakers rally past Thunder 119-112 in OT for 5th win in a row",
  "body": "LOS ANGELES -- — LeBron James had 28 points, 14 rebounds and 12 assists for his third triple-double of the season, and the Los Angeles Lakers beat the Oklahoma City Thunder 119-112 in overtime on Monday night to win their fifth in a row.\n\n\r\n                    It was their second straight overtime win after beating Detroit in two overtimes on Saturday. The Lakers tied their longest winning streak of the season despite being without Anthony Davis, who sat out with right Achilles tendinosis.\n\n\r\n                    “I'm good with one overtime compared to two overtimes,\" James said. “Get home a little bit earlier and my heart don’t feel as bad as it did the other night.\"\n\n\r\n                    The Lakers dominated overtime after playing from behind for much of regulation. They scored seven straight to go up 117-110. The Thunder had a turnover, a shot-clock violation and two misses by Shai Gilgeous-Alexander before Hamidou Diallo finally scored.\n\n\r\n                    James answered with a basket that kept the Lakers ahead 119-112. \n\n\r\n                    The Thunder's miscues weren't over. Darius Bazley turned the ball over on a double-dribble and Gilgeous-Alexander was called for an offensive foul. Oklahoma City challenged that call, but lost the decision and the Lakers kept possession before playing out the clock.\n\n\r\n                    “We just have to stick with it,” Thunder center Al Horford said. “Our guys learn pretty quick. We make a mistake, we watch it on film and we correct it. We keep improving and that’s the mindset we have.”\n\n\r\n                    Gilgeous-Alexander narrowly missed matching James' triple-double. He finished with 29 points, 10 assists and seven rebounds. Bazley added 21 points and a career-high 16 rebounds. Diallo had 20 points and tied his career high with 11 rebounds.\n\n\r\n                    “They got a lot of energy, a lot of young guys, no quit in them,” James said.\n\n\r\n                    Dennis Schroder added 19 points for the Lakers. Montrezl Harrell had 21 points and Wesley Matthews had 16, including four 3-pointers, off the bench. Kyle Kuzma added 11 points and 10 rebounds.\n\n\r\n                    “I feel like our guys are playing hard. We're not shooting the ball well,” Lakers coach Frank Vogel said. “We had a ton of great looks from the perimeter and they didn't fall. When you’re not shooting well you got to win it with your defense.\" \n\n\r\n                    The Lakers trailed by 11 in the fourth, the same deficit they faced in the first quarter.\n\n\r\n                    “Allowing ourselves to get down double-digits is not something we want to have long term,\" James said. “We play with a sense of urgency. I just think it’s our demeanor and our pace is very slow to start the game. We can change that.\"\n\n\r\n                    James stole the ball from Bazley and scored to tie the game, 107-all. It was part of an 8-0 run by the Lakers in the closing seconds.\n\n\r\n                    Gilgeous-Alexander got fouled on a 3-point attempt and made all three free throws with 1 second left to force the extra session.\n\n\r\n                    The Lakers opened the third on an 18-8 run, highlighted by consecutive dunks from James including a one-handed reverse jam, to take a 74-68 lead. The Thunder answered by closing out the quarter with a 16-2 spurt, with Diallo scoring seven to go into the fourth leading 84-76.\n\n\r\n                    TIP-INS\n\n\r\n                    Thunder: They lost to the Lakers by 29 points on Jan. 13. ... They had just eight available players, with George Hill and Mike Muscala among those sidelined. \n\n\r\n                    Lakers: They've won six games this season after trailing by 10 or more points. ... Alex Caruso sat out after jamming two fingers against Detroit and having swelling.\n\n\r\n                    LEBRON AND BRADY\n\n\r\n                    James said watching Tom Brady win his seventh career Super Bowl with Tampa Bay at age 43 was inspiring. At 36, James has competed in 10 NBA Finals and won four titles.\n\n\r\n                    “I don't know how long I'm going to play the game,\" he said. “The way I feel right now, we'll see what happens. I have no timetable on it. I have no year. The game will let me know when it's time.\"\n\n\r\n                    UP NEXT\n\n\r\n                    The teams meet again Wednesday at Staples Center.\n\n\r\n                    ------",
  "source": "espn_api",
  "crawled_at": 1764997939.17887
}