{
  "game_id": "0022400293",
  "espn_id": "401704859",
  "date": "Nov 27, 2024",
  "matchup": "MEM vs. DET",
  "headline": "Smart scores 25, leads Grizzlies to 131-111 win over Pistons",
  "body": "MEMPHIS, Tenn. -- — Marcus Smart scored a season-high 25 points to lead the Memphis Grizzlies to a 131-111 victory over the Detroit Pistons on Wednesday night.\n\n\r\n              Smart was 8 of 12 from the field, including 7 of 11 from outside the arc. Scotty Pippen Jr. and Jake LaRavia finished with 19 points apiece, Pippen adding seven rebounds while hitting 9 of 12 shots as Memphis won its fourth straight. LaRavia missed only one of his nine shots.\n\n\r\n              Marcus Sasser led the Pistons with 22 points, while Simone Fontecchio had 18. Jaden Ivey finished with 17 points. \n\n\r\n              Both teams were missing key offensive threats. Pistons guard Cade Cunningham missed his third game with a sacroiliac joint sprain. Meanwhile, Ja Morant, who just returned to the Grizzlies lineup after missing eight games, wasn't available because of a left knee contusion. \n\n\r\n              Takeaways\r\n              Pistons: Cunningham's absence, along with Tobias Harris, meant the loss of more than 37 points on offense. Second-year player Ausar Thompson, playing in his second game of the season after dealing with a blood clot issue, started in Harris' spot.\n\n\r\n              Grizzlies: Memphis, which leads the league in points in the paint, was right near its average with 60 points. Memphis had 72 bench points.\n\n\r\n              \r\n              Key moment\r\n              Memphis outscored the Pistons 37-18 in the second quarter, including a 31-7 burst. The Grizzlies shot 59% overall in the quarter compared to 36% for Detroit.\n\n\r\n              Key stat\r\n              Memphis missed its first nine shots from outside the arc but made 14 of its next 29 as the Grizzlies lead ballooned to 104-77 entering the fourth. Meanwhile, Detroit's Malik Beasley was 2 of 4 from 3, ending his streak of 10 games with at least three 3-pointers.\n\n\r\n              Up next\r\n              The Pistons play at the Pacers on Friday, the same day Memphis hosts New Orleans. \n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997747.250828
}