{
  "game_id": "0021900824",
  "espn_id": "401161466",
  "date": "Feb 20, 2020",
  "matchup": "MEM @ SAC",
  "headline": "Barnes makes 7 3-pointers in Kings' win over Grizzlies",
  "body": "SACRAMENTO, Calif. --  Five days after winning the 3-point competition during All-Star weekend, Buddy Hield’s free throw shooting made the difference for Sacramento and has the Kings pondering a potential late run at the postseason.\n\nThat might be a lofty aspiration for a team still 11 games under .500, but Hield wants his teammates to embrace it as much as possible.\n\nHarrison Barnes scored a season-high 32 points and matched his career high with seven 3, De’Aaron Fox added 26 and Sacramento beat the Memphis Grizzlies 129-125 on Thursday night.\n\n\"No matter what you have to try to start this second part of the season with a win,\" Hield said. \"Every game is a must-win and (we) have to play every game like our back is against the wall if we want to make things interesting, and we can.\"\n\nHield, who joined Peja Stojakovic as the only Kings to win the NBA's 3-point contest, added 20 points, including four free throws in the final seconds.\n\n“It’s fun,” Hield said of his clutch free throws. “It’s what you live for, to be in that situation for your team.”\n\nKent Bazemore scored 18 as the Kings won their fourth straight against the Grizzlies at home.\n\nDe’Anthony Melton scored 24 and Ja Morant had 19 for the Grizzlies.\n\nMemphis trailed by 15 early in the fourth quarter but took advantage of Sacramento’s struggles at the free throw line and caught a break when Melton was fouled by Barnes attempting a 3-pointer with 7.5 seconds remaining.\n\nMelton made all three free throws to pull the Grizzlies within 125-124.\n\nAfter Hield sank two free throws for Sacramento, Morant made one then intentionally threw the second off the front of the rim but was called for a lane violation.\n\n“It’s just one of those games where we couldn’t keep up with the runs until the fourth quarter. That’s where we came up with some big stops,” Memphis coach Taylor Jenkins said. “We had great production from a lot of different guys off the bench to help us when we may have been struggling from that starting group.”\n\nHield made two more free throws to seal the win for the Kings.\n\n“We were playing some pretty good basketball before we left, so to come out and see that our guys came back locked in ready to go to me shows how they’ve been all year long,” Sacramento coach Luke Walton said. “They’re going to keep playing hard, they’re going to keep fighting, keep trying to get better.”\n\nThe Kings looked fresh coming off the All-Star break, particularly Barnes.\n\nSporting a much more noticeable beard that he intends to keep until Sacramento gets to .500 or the season ends, Barnes made his first four shots and eight of 10 while going 6-for-6 on 3s in the first half, including a buzzer beater that made it 70-61.\n\nTIP-INS\n\nGrizzlies: Memphis is winless in Sacramento since Dec. 31, 2017. … The Grizzlies are 8-2 when Kyle Anderson starts. Anderson had 12 points and five rebounds. … Jaren Jackson Jr. scored eight straight in the third quarter. That matched his total against Portland in the final game before the All-Star break.\n\nKings: Jabari Parker had a rough debut in Sacramento after being acquired from Atlanta in exchange for Dwayne Dedmon. Parker missed his first five shots and scored four points. … The 70 points matched a season-high for a half. The Kings put up 70 in the second half against the Spurs on Feb. 8.\n\nGOOD CHALLENGE\n\nSacramento led 117-113 when Fox was whistled for his fourth foul. After Walton challenged the call and it was overturned, Fox made a step-back 3-pointer.\n\nGILES DEFENSE\n\nHarry Giles has been getting more playing time for the Kings and came up big in the fourth quarter with a pair of blocked shots. He also took a charge that helped stop Memphis’ momentum.\n\n“He gives us a toughness and an edge when he’s playing that way,” Walton said. “He deserved and earned to be on the court at the end. He was good tonight.”\n\nUP NEXT\n\nGrizzlies: Play in Los Angeles against the Lakers on Friday night. Memphis is winless in two games against the Lakers this season.\n\nKings: Play the Clippers in Los Angeles on Saturday afternoon.\n\n--\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995695.749801
}