{
  "game_id": "0021500315",
  "espn_id": "400828202",
  "date": "Dec 08, 2015",
  "matchup": "HOU @ BKN",
  "headline": "Nets hold off Rockets to sweep season series",
  "body": "NEW YORK -- The Brooklyn Nets finally beat Houston twice in a season again, and it sure helped that the Rockets were so busy beating themselves.\nBrook Lopez scored 24 points, Joe Johnson had 22, and the Nets beat the Rockets 110-105 on Tuesday night to sweep the season series for the first time in 14 years.\n\"I thought throughout the game we played pretty good basketball,\" Johnson said. \"We got off to a great start, which is always good for us because we're pretty much a young team and confidence is key for us.\"\n\nBrooklyn set season highs for assists (27) and field goal percentage (55.6), capitalizing on the good opportunities the Rockets created for them with 24 turnovers.\n\"Just poor decision-making, especially on my end,\" All-Star James Harden said. \"Had too many unforced turnovers, just giving them opportunities.\"\nThaddeus Young finished with 20 points and 12 rebounds for the Nets, who have recorded two of their six victories this season against Houston. Bojan Bogdanovic scored 19 points in place of injured rookie Rondae Hollis-Jefferson.\nJohnson had 15 points on 6-of-8 shooting in the fourth quarter of his bobblehead night as the Nets avoided a third straight loss.\n\"That's what Joe does,\" Lopez said. \"There's a reason his bobblehead looks the way it does. We know we can go to him time and time again in the crunch time. He's going to deliver.\"\nMarcus Thornton scored a season-high 32 points for the Rockets, who got quiet nights from Harden and Dwight Howard. Corey Brewer had 22 in extended minutes after starting forward Trevor Ariza was lost to a bruised lower back after 4 minutes.\nHarden was 2 for 9 for 10 points, and also finished with nine assists and seven turnovers. Howard, who had 22 points and 18 rebounds Saturday in a victory over Sacramento, took just five shots and finished with 10 points and nine rebounds.\n\"We should've come out with a better effort. We didn't and we paid the price for it,\" Howard said. \"Our effort was better in the third and fourth quarter, but we can't hand teams good leads and expect to come back.\"\nThe Rockets had won three in a row and were trying to get back to .500 for the first time since they were 4-4 after a loss to the Nets on Nov. 11.\nThat was the Nets' first victory of the season after seven losses and by adding Tuesday's win, they took a pair from the Rockets for the first time since 2001-02.\nThornton scored 17 straight Houston points in the fourth, but the Rockets couldn't get the stop they needed whenever they got really close.\nThe Nets also had 24 turnovers in the sloppy contest.\nThe Rockets came in allowing 107.3 points per game, 28th in the NBA, and for a while it appeared even the anemic Nets offense would blow past that. Brooklyn had 57 points at halftime and opened an 18-point lead in the third quarter before Thornton had six straight points to finally get the Rockets going.\nThe Rockets cut it to 80-72 after three, and Thornton made consecutive 3s early in the fourth and then had a steal and layup to trim it to 84-82.\nTIP-INS\nRockets: Ariza was hurt in the first quarter when he landed hard on a drive to the basket, with a loud thud. He stayed down for a couple of minutes before limping to the locker room. ... Howard celebrated his 30th birthday.\nNets: Lopez became the sixth player to make 400 starts for the Nets franchise, following Buck Williams (633), Jason Kidd (504), Kerry Kittles (455), Richard Jefferson (417) and Jason Collins (405). ... The Nets, who came in averaging an NBA-best 46.9 points per game in the paint, had 54 against Houston.\nROOKIE'S RECOVERY\nCoach Lionel Hollins estimated a 10-week absence for Hollis-Jefferson, who broke his right ankle Saturday in practice. However, the Nets said an official timetable won't be known until after surgery on Wednesday morning.\nBIRTHDAY BOY\nHoward said his birthday wish would be to win a championship.\n\"That's the only thing I play for, is to win a championship,\" he said. \"So, I'll be very thankful when that day happens.\"\nUP NEXT\nRockets: Visit Washington on Wednesday.\nNets: Host Philadelphia on Thursday.",
  "source": "espn_api",
  "crawled_at": 1764994652.729367
}