{
  "game_id": "0021500628",
  "espn_id": "400828515",
  "date": "Jan 19, 2016",
  "matchup": "PHX vs. IND",
  "headline": "Ellis, George lead Pacers past Suns 97-94",
  "body": "PHOENIX --  The Indiana Pacers almost blew a 20-point second-half lead Tuesday night. In the end, the deficit was too large for struggling and short-handed Phoenix to close.\n\nMonta Ellis scored 20 points, Paul George had 19 and the Pacers beat the Suns 97-94 to end a three-game losing streak.\n\nGeorge added eight rebounds and Myles Turner scored 15 points for Indiana.\n\n\"This was all about us getting a win and getting back to playing winning basketball,\" George said. \"It was poor closing this game out. We've got to do a better job, but it was a good start to getting back to playing some defense.\"\n\nDevin Booker had a career-high 32 points for the Suns, who lost for the 14th time in 15 games and fifth in a row. Brandon Knight added 21 points.\n\nThe Suns fought back to trail 95-92 with 3.8 seconds left after an off-balance 3-pointer by Knight, but they didn't have enough time to complete the comeback.\n\n\"We made some shots to get a comfortable lead to when they make their run, we were able to still hold them off because we established that in the beginning,\" Ellis said.\n\nJoe Young's 3 made it 71-51 with 3:08 left in the third quarter, part of the rookie's 11 points.\n\nThe Suns came back with 10 straight points, and a high-flying dunk by Archie Goodwin with 0.9 seconds left made it 71-61.\n\nThe Suns made only 34.6 percent of their shots. They went 0 for 7 with four turnovers to start the second quarter and went 7:32 without a point between the first and second quarters. That stretch allowed the Pacers to build a 15-point lead, 32-17, after Young hit a long jumper at the 7:21 mark.\n\nPhoenix committed 22 turnovers for the game.\n\nBooker, a rookie out of Kentucky, became the third-youngest player in NBA history at age 19 years and 81 days to record a 30-point game. LeBron James and Kevin Durant are the only two players who were younger than Booker to score 30 in a game, and Booker achieved the highest point total in a game for a rookie in the NBA this season.\n\n\"I'm getting a lot of time out there and getting that opportunity so I'm learning the game every day,\" Booker said.\n\nPLAYERS DOWN\n\nThe Pacers lost center Ian Mahinmi to a sprained left ankle with 52.9 seconds left in the first half. Mahinmi was going for a loose ball and came down on the back of Ellis, landing awkwardly on his own left leg and crashing to the floor. Mahinmi missed the Pacers' game at Denver on Sunday with a sore left heel.\n\nMahinmi did not play in the second half and was replaced by Turner.\n\nSuns starter Markieff Morris strained his right shoulder on a dunk attempt before halftime and did not play in the second half. He was replaced by Mirza Teletovic, but Teletovic twisted an ankle in the third quarter and did not return.\n\nThat gave extended minutes to Len and P.J. Tucker, who had to play power forward, and also some time for seldom-used Sonny Weems.\n\n\"It is what it is, it's a part of the league,\" Tucker said. \"There's no excuse. We've got five guys that can play, we've got to out and play together and play hard.\"\n\nTIP-INS\n\nPACERS: F George Hill missed his second straight game for personal reasons. ... G Rodney Stuckey missed his fourth straight game due to a sprained right ankle and bone bruise.\n\nSUNS: F Jon Leuer did not play after feeling back spasms during pre-game warmups. ... C Alex Len returned after missing three straight games with a sprained left hand, playing 21 minutes and pulling down 12 rebounds.\n\nMYLES OF MOMENTUM\n\nTurner's energy gave the Pacers a lift in the second quarter. Turner emphatically swatted away layup attempts by Booker and Knight for goaltending calls on defense, but knocked down back-to-back jumpers to help the Pacers keep a sizable lead. He waved his arms and shouted in celebration after the second make. Turner was whistled for goaltending on a third shot late in the fourth quarter but the call was overturned.\n\nUP NEXT\n\nPACERS: At Golden State Friday night.\n\nSUNS: Host San Antonio Thursday night.",
  "source": "espn_api",
  "crawled_at": 1764994847.756188
}