{
  "game_id": "0021500517",
  "espn_id": "400828404",
  "date": "Jan 04, 2016",
  "matchup": "OKC vs. SAC",
  "headline": "Cousins has 33 points, 19 boards, Kings top Thunder 116-104",
  "body": "OKLAHOMA CITY -- The Sacramento Kings will take a win any way they can get one.\nDeMarcus Cousins had 33 points and a season-high 19 rebounds, and Sacramento took advantage of Kevin Durant being out of the lineup to beat the Oklahoma City Thunder 116-104 on Monday night.\nDurant missed the game with a sprained right big toe. His status is day-to-day, but coach Billy Donovan said before the game that he didn't consider it serious.\nWithout Durant, Russell Westbrook took on more of the load. He had 17 points, 15 assists and eight rebounds, but he made just 2 of 15 shots in the second half.\n\"It definitely helped having K.D. out,\" Cousins said. \"That's a big threat that they didn't have tonight. It made our jobs a little bit easier on defense. I think we were able to key in on Russ tonight and make other guys shoot, and we won the game.\"\nRajon Rondo had 13 points, 19 assists and nine rebounds, Marco Belinelli scored 21 points and Rudy Gay added 16 for Sacramento.\nSerge Ibaka scored a season-high 25 points, Anthony Morrow had a season-high 20 points and Steven Adams added 15 points and 10 rebounds for the Thunder.\nCousins scored eight points during a 17-0 run late in the first half after the Kings fell behind 31-14.\nSacramento led 68-66 at halftime, and the Kings closed the third quarter on a 9-2 run to take a 90-82 lead.\n\"Transition,\" Westbrook said. \"They got in transition and got some easy points and got themselves going.\"\nOklahoma City's Nick Collison drew a technical foul early in the fourth quarter after arguing a foul call against him, and the Kings made the free throw to go up 96-87. Morrow was called for a technical with 5:24 remaining, and it appeared the Thunder had unraveled for good.\nGay was called for a technical with 4:07 remaining, and the Thunder cut the deficit to eight after the free throw and two foul shots by Adams. But Gay scored on a fast break layup and was fouled. He made the free throw to put Sacramento up by 11 with 3:10 to play.\n\"They made a little run, but we stopped the bleeding early and gained control of the game again,\" Cousins said.\n---\nSTAT LINES\nWestbrook missed all eight of his shots in the third quarter. He made just 6 of 23 in the game.\nPLAYERS OF THE MONTH\nDurant and Westbrook were named co-Western Conference Players of the Month earlier in the day. Westbrook has won the award four of the past five months. The two have combined to be honored nine times in the past 14 months.\nQUOTABLE\nCousins, on a fan who said he acts like an 8-year-old: \"I told her that she has a great 8-year-old.\"\nTIP-INS\nKings: Cousins had 10 points and seven rebounds in the first quarter. ... Outrebounded the Thunder 24-13 in the first half. ... Willie Cauley-Stein injured a finger on his right hand in the fourth quarter.\nThunder: Morrow got the start in Durant's place and scored seven points in the game's first four minutes. ... Westbrook had seven assists in the first quarter, the second-most he's had in a quarter this season. His 11 assists in the first half were the second-most he's had in a half in his career.\nUP NEXT\nKings: Play at Mavericks on Tuesday.\nThunder: Host Grizzlies on Wednesday.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .",
  "source": "espn_api",
  "crawled_at": 1764994180.995331
}