{
  "game_id": "0021900148",
  "espn_id": "401160790",
  "date": "Nov 12, 2019",
  "matchup": "MIA vs. DET",
  "headline": "Butler scores 20, Heat hang on to beat Pistons 117-108",
  "body": "MIAMI --  Jimmy Butler knows this Miami Heat team can get much better.\n\nThat being said, he's quite happy with the start.\n\nButler scored 11 of his 20 points in the fourth quarter, added 13 assists and the Miami Heat wasted most of what was a 29-point lead before hanging on to beat the shorthanded Detroit Pistons 117-108 on Tuesday night.\n\n\"We want it to be tough to come here and play,\" Butler said. \"We don't want people to come here and want to play the Miami Heat. We don't want people to want to play the Miami Heat, home or away.\"\n\nKendrick Nunn also had 20 for Miami, while Bam Adebayo scored 18 points and grabbed 14 rebounds for the Heat. Goran Dragic also had 18 points for the Heat (7-3), who matched the third-best 10-game start in Heat history.\n\nButler's 13-assist, zero-turnover game was the fifth in Heat history and the first since Dwyane Wade had one in 2009.\n\nLuke Kennard was 0 for 7 in the first half, but recovered to score 22 for Detroit. Andre Drummond had 16 points and nine rebounds before fouling out, and Christian Wood added 16 for the Pistons -- who never led, but made the second half plenty interesting by getting as close as seven late.\n\n\"NBA basketball games are long,\" Heat coach Erik Spoelstra said. \"And you have to play all the way through to the end. ... But these are good experiences for our team.\"\n\nDetroit held Blake Griffin (hamstring, knee) and Derrick Rose (hamstring) out, not wanting to play either on a back-to-back after both played Monday.\n\nThat wasn't the Pistons' only issue.\n\nRecord snow -- Detroit's biggest November storm ever, according to the National Weather Service, with 9.2 inches as the official mark and some suburbs reporting more than a foot -- made just getting to Miami a problem for the Pistons, who played Monday night at home and then were hoping to be airborne sometime in the 11 p.m. hour.\n\nThe Pistons didn't leave their airport gate in Detroit until 2:40 a.m., got in the air 10 minutes later and were at their gate at Miami International Airport at 5:34 a.m. That was more than four hours behind their intended schedule.\n\n\"Whether we got in at 11 o'clock last night or 5 o'clock this morning, we've got to have that type of toughness and that type of resilience versus adversity that we haven't exhibited so far this year,\" Pistons coach Dwane Casey said.\n\nHe saw plenty of that.\n\nDetroit got down by as many as 29 in the first half, going into the break trailing 59-37. The Pistons got it down to 13 in the third, only to see Miami push the margin back out to 20 entering the fourth.\n\nMiami's lead was 15 when Drummond fouled out early in the fourth and it still wasn't over. Kennard made a 3-pointer with about 2 minutes left to get the Pistons within 111-103, but the Heat escaped.\n\n\"They came out ready to go from the jump and we were relaxing and let them punch us in the face,\" Pistons guard Bruce Brown said.\n\nTIP-INS\n\nPistons: The 22-point halftime deficit was the second-largest Detroit has ever faced against Miami. The Pistons trailed the Heat 59-36 at the break of a game in 2012. .. Detroit came into the night shooting a league-best 41% from 3-point range. The Pistons shot 15 of 41 from deep on Tuesday.\n\nHeat: The 1999-2000 and 2011-12 Heat teams were 8-2. There have been eight others to start 7-3, the most recent before now being 2013-14. ... Meyers Leonard has started all 10 games this season, the first time he's had that long a starting streak in his career.\n\nHASLEM PLAYS\n\nUdonis Haslem got in for the first time this season, making this officially his 17th year with the Heat. Miami was without Justise Winslow (concussion), James Johnson (sick), Tyler Herro (ankle), Derrick Jones Jr. (hip), KZ Okpala (Achilles) and Dion Waiters (suspended).\n\nHOME COOKING\n\nThe Heat are 4-0 at home for the first time since 2012-13. They haven't trailed at home at any point in their last 11-1/2 quarters, going back to a 10-9 deficit against Atlanta -- a total of 136 minutes, 9 seconds.\n\nUP NEXT\n\nPistons: Visit Charlotte on Friday.\n\nHeat: Visit Cleveland on Thursday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995554.967214
}