{
  "game_id": "0021500514",
  "espn_id": "400828401",
  "date": "Jan 04, 2016",
  "matchup": "DET vs. ORL",
  "headline": "Pistons pour it on late in 115-89 rout of Magic",
  "body": "AUBURN HILLS, Mich. --  Stan Van Gundy now has two point guards he can count on.\n\nBrandon Jennings had 17 points and six assists in his fourth game back from his Achilles tendon injury, and the Detroit Pistons rolled to their most lopsided victory of the season, a 115-89 win over the Orlando Magic on Monday night.\n\nJennings missed 11 months because of his injury, and he now backs up Reggie Jackson for the Pistons. Jackson had 14 points and seven assists against the Magic, and Van Gundy -- who is Detroit's coach and team president -- indicated afterward the Pistons are not looking to part with either point guard.\n\n\"I've said all along, our plan right now is that Brandon can help us make a playoff push, and that's what we're going to do,\" Van Gundy said. \"If something changes in the next five weeks, then we'll look at it. But right now, he's a very good player who can help us, and that's the only way we're looking at it.\"\n\nAndre Drummond had 17 points and 12 rebounds for the Pistons, and Kentavious Caldwell-Pope scored 21.\n\nVictor Oladipo, starting in place of injured guard Elfrid Payton, led Orlando with 18 points.\n\nDetroit led 57-47 at halftime, and although Orlando scored the first seven points of the third quarter, a 16-4 run later in the period gave the Pistons a comfortable advantage again. Detroit then poured it on at the start of the fourth.\n\nDetroit had lost four of five coming into the game, but the Pistons were in control throughout the first half, taking a 21-6 lead on a one-handed, alley-oop dunk by Drummond. The big man had 10 points and five rebounds in the first quarter, and Detroit led by as many as 16 in the second.\n\n\"Two or three minutes into the game, and we already had guys bending over and grabbing their shorts. We've been a low-energy team for a while now,\" Orlando coach Scott Skiles said. \"It isn't unusual during a season to have a couple guys struggling for a few games, but when the whole team is going in that direction, it gets frightening.\"\n\nJackson scored 10 points in the third and helped Detroit stay ahead as Orlando made its run. It was 65-63 after a 3-pointer by Oladipo, but Marcus Morris answered with a jumper and Caldwell-Pope connected from beyond the arc to put the Pistons up by seven.\n\nJennings beat the buzzer with a 3 to give Detroit an 88-74 lead after three. The Pistons then went on a 19-2 run to start the fourth.\n\nJennings faked a behind-the-back pass in transition with a bit of slight-of-hand before finding Caldwell-Pope for a 3-pointer. Caldwell-Pope and Jennings added two more 3s to make it 106-76.\n\n\"It all really started with our defense, just getting stops, especially that phenomenal stretch by our second unit in the fourth,\" Jackson said. \"They just really blew the game wide open.\"\n\nMorris scored 13 points for the Pistons. Nikola Vucevic had 16 for Orlando.\n\nON THE BOARDS\n\nThe Pistons had 14 of their 18 offensive rebounds in the second half. They outscored Orlando 22-5 on second-chance points in the game.\n\nBLANKED\n\nOrlando guard Evan Fournier, who came in averaging 14.3 points per game, went scoreless on 0-of-6 shooting.\n\nTIP-INS\n\nMagic: Payton was out with a bruised left ankle. ... Orlando's most lopsided loss of the season was 111-76 against Cleveland on Dec. 11.\n\nPistons: The most lopsided previous win for the Pistons this season was their most recent one before Monday -- a 115-90 rout of Minnesota last Thursday.\n\nUP NEXT\n\nMagic: Host Indiana on Wednesday night.\n\nPistons: Play at Boston on Wednesday night.\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994929.2320771
}