{
  "game_id": "0022300172",
  "espn_id": "401584800",
  "date": "Nov 09, 2023",
  "matchup": "ORL vs. ATL",
  "headline": "Young scores 41, Murray hits go-ahead 3 as the Hawks beat the Magic 120-119 in Mexico City",
  "body": "MEXICO CITY -- — Trae Young put on a show for nearly 20,000 fans in the NBA's regular-season game in Mexico City.\n\n\r\n              He wouldn't mind getting to do it every season.\n\n\r\n              Young scored 41 points, then fed Dejounte Murray for a go-ahead 3-pointer with 31 seconds left to give the Atlanta Hawks a 120-119 victory over the Orlando Magic on Thursday night.\n\n\r\n              “I love the energy of the arena tonight, the electricity. It was fun playing here,” Young said. “I know we’re obviously probably going to expand the league and expand it to a couple more cities. I mean, I’m going to be open to playing here. This is an unbelievable place to play.\"\n\n\r\n              Jalen Suggs scored 21 points and Paolo Banchero had 17, but missed a 3-pointer with 7.9 seconds remaining on Orlando’s final possession.\n\n\r\n              “We were trying to run the same play for Franz (Wagner). He scored on a possession before but he drew two defenders, kicked it out to me and I missed the shot,\" Banchero said. “We had a chance to win and we didn’t win. But it was a great game, though. Great environment.”\n\n\r\n              Young had 33 points in the first half for Atlanta (4-3), which played for the first time south of the border. Jalen Johnson had 19 points, Murray added 16 and Bogdan Bogdanovic finished with 15. \n\n\r\n              Although the Magic played the game as the host team, many of the sellout crowd that came to the Arena Ciudad the Mexico, a glass-clad state of the art facility, were wearing jerseys of Young, who lived in Lubbock, Texas, or Hawks gear and cheered loudly for the visiting team.\n\n\r\n              The atmosphere seemed to make the players forget about playing at an altitude of 7,350 feet above sea level, but that did not last forever.\n\n\r\n              “You can definitely feel the altitude, it affected all of us,\" Young said. \"There was a moment in the third quarter when I had to come out because the altitude got to me, I needed to get a breather.”\n\n\r\n              The Magic pulled ahead 111-100 after rookie Anthony Black hit a 3-pointer from the right corner, but the Hawks had a 14-2 run sealed with Johnson’s driving layup to take a 114-113 lead with 4:04 left to play.\n\n\r\n              The teams exchanged leads and Wagner scored on a hook to put Orlando ahead 119-117 with 43 seconds left to play. Young drove toward the basket and fired a pass out to Murray behind the arc for the final points. \n\n\r\n              The Hawks built an 18-7 lead early in the game after a 3 by Young, but the Magic rallied to tie it at 34 after the first 12 minutes.\n\n\r\n              The Hawks led 73-69 at the half, with Young shooting 9 for 14 from the field and 11 for 11 from the free throw line.\n\n\r\n              But the Atlanta guard cooled off in the third scoring, going just 1 for 6, and Orlando closed the quarter on an 11-5 run to take a 98-93 lead into the fourth period.\n\n\r\n              It was the league’s 32nd game in Mexico since 1992, more than any country outside the U.S. and Canada.\n\n\r\n              According to NBA metrics, there are 30 million fans in the country and it has been mentioned as a potential city when, or if the league, decides to expand.\n\n\r\n              “I can´t set a specific timeline, but a main part of my job, if not the most important part of my job, is to grow this league. So it´s something to think about a lot,\" NBA Commissioner Adam Silver said before the game.\n\n\r\n              Mexico has an NBA G League team that had a successful first year playing at the Arena Ciudad the Mexico. Positive feedback from former NBA players who reside in Mexico City might help the city on its bid for a franchise in the future, but for now the only thing certain is more regular season games.\n\n\r\n              “We´ll definitely will be back,\" Silver said when pressed by Mexican reporters for the chances of the city getting a team. “We will be back next year with at least one game, we´ll see whether it´s two games.”\n\n\r\n              UP NEXT\n\n\r\n              Hawks: Host the Miami Heat on Saturday night after a three-game road trip\n\n\r\n              Magic: Host the Milwaukee Bucks on Saturday\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_api",
  "crawled_at": 1764995748.077961
}