{
  "game_id": "0022200935",
  "espn_id": "401469090",
  "date": "Mar 01, 2023",
  "matchup": "CLE @ BOS",
  "headline": "Tatum scores 41 to help Celtics outlast Cavaliers 117-113",
  "body": "BOSTON -- — Jayson Tatum is two days shy of his 25th birthday and has already accomplished more than many of his peers will in their entire careers.\n\n\r\n              Yet he isn’t where he wants to be. Not yet. Having more nights like Wednesday was a nice preamble to blowing out his birthday candles.\n\n\r\n              Tatum scored 18 points in a pivotal third quarter and finished with 41 points as the Boston Celtics held on to beat the Cleveland Cavaliers 117-113. \n\n\r\n              “I guess I never really take time to think about where I’m at or the things I’ve accomplished,” Tatum said. “Time does fly. My sixth season. About to be 25. So I’m just trying to enjoy the moment and stay present.”\n\n\r\n              Tatum added 11 rebounds and eight assists as Boston earned its first victory in three games versus Cleveland this season. With his 20th career 40-point game, the 24-year-old surpassed Giannis Antetokounmpo for seventh place on the NBA’s all-time scoring list for players under 25. \n\n\r\n              It helped Tatum outduel fellow All-Star Donovan Mitchell, who scored 44 points and sidestepped an injury following a fall in the third quarter.\n\n\r\n              Al Horford added 23 points and 11 rebounds for Boston. Jaylen Brown finished with 16 points. \n\n\r\n              Cleveland dropped to 13-19 on the road this season and 19-12 against teams above .500. Darius Garland added 29 points and nine assists for the Cavaliers.\n\n\r\n              “Tatum’s a heck of a player, Brown’s a heck of a player that knows how to make you pay,” Cavaliers coach J.B. Bickerstaff said.\n\n\r\n              Mitchell’s scary moment came with under six minutes left in the third quarter. While driving into the lane, he lost his footing and tumbled awkwardly to the court, leading to a layup on the other end by Tatum.\n\n\r\n              Mitchell briefly remained on the floor after the Cavs called a timeout, but he was able to walk to the bench. He stayed in the game when play resumed, scoring Cleveland’s next 10 points and 19 in the quarter. But his teammates managed just seven points, while shooting 3 of 11 from the field. It was Mitchell’s seventh 40-point game this season.\n\n\r\n              Mitchell told reporters afterward that he felt pain in his groin similar to what kept him out for a total of six games in January and February. \n\n\r\n              “There was no coming out of the game for me,” Mitchell said. “Just trying to find ways to make plays.” \n\n\r\n              Bickerstaff said Mitchell will continue to be evaluated.\n\n\r\n              “I kept talking to him. He wanted to stay on the floor,” Bickerstaff said. “He knew once he came out it would stiffen up on him, make it difficult for him to come back in. We talked to the medical staff, he was ready to go, so we kept him out there.”\n\n\r\n              Boston outscored Cleveland 41-26 in the third and saw its three-point halftime advantage grow to 96-78 entering the fourth.\n\n\r\n              Cleveland closed within 107-94 with less than five minutes to play when Marcus Smart was whistled for a loose ball foul on Mitchell as the two jockeyed for position on a rebound. \n\n\r\n              Spurred by pleas from Smart and the entire Celtics bench, coach Joe Mazzulla challenged the call. A review showed Mitchell had grabbed Smart’s arm and yanked it in the air, and the call was overturned. \n\n\r\n              Tatum knocked down a 3 on the ensuing possession. \n\n\r\n              Cleveland made one last push late, getting consecutive 3s by Garland to get as close as 113-108 in the final minute. Boston was able to close it out at the foul line. \n\n\r\n              TIP-INS\n\n\r\n              Cavaliers: Mitchell posted his 23rd 30-point game of the season, tying his career high for 30-point games in a season (2021-22). … Garland had 12 points, six assists and two steals in the first half. ... The Cavs scored 30 points in the paint in the first half. \n\n\r\n              Celtics: Improved to 15-18 this season against teams above .500. … Went 6 of 7 from the 3-point line in the third quarter. … Marcus Smart had three steals in the first half.\n\n\r\n              UP NEXT\n\n\r\n              Cavaliers: Host Pistons on Saturday.\n\n\r\n              Celtics: Host Nets on Friday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764995232.557981
}