{
  "game_id": "0021900157",
  "espn_id": "401160799",
  "date": "Nov 13, 2019",
  "matchup": "HOU vs. LAC",
  "headline": "Harden scores 47 points, Rockets beat Clippers 102-93",
  "body": "HOUSTON --  James Harden was pestered and harassed on defense by Patrick Beverley for most of Houston’s game against the Los Angeles Clippers on Wednesday night.\n\nDespite all of Beverley’s antics Harden still scored 47 points and the Rockets outlasted the Clippers 102-93 in a wild game that saw Los Angeles coach Doc Rivers ejected in the fourth quarter.\n\nAfterward, Russell Westbrook was asked about Beverley’s defensive effort against Harden.\n\n“Pat Bev trick y'all like he play defense,” Westbrook said. “He don't guard nobody, man. It's just running around doing nothing. As you seen what happened -- 47. All that commotion to get 47.”\n\nHouston was up two with about two minutes left when Beverley, a former Rocket, fouled out. Harden made both free throws before grabbing a rebound on the other end and hitting a 3 to make it 95-88.\n\nBeverley was given a technical foul during a timeout after the play and Harden hit the two free throws.\n\nRivers was then given two technical fouls and ejected to the delight of son Austin Rivers, the Houston guard who laughed and signaled for the officials to T-up his father. Doc Rivers spent several more seconds screaming at the referees before slowly walking across the court and to the locker room.\n\nDoc Rivers said after the game that he was upset with the officials because of a mix up with the number of timeouts. He said that he tried to challenge a play but that it was past the 30 seconds allotted after a play in which to make a challenge. So they told him he didn’t burn a timeout on the challenge and he had two remaining. His ejection came after they said he was out of timeouts when he called the timeout where Beverley received his technical.\n\n“We didn't deserve to win with the way we were playing right now offensively or defensively but mistakes like that cannot happen on this level,” Doc Rivers said. “That was awful and the response was to throw me out? I didn't swear. I just said: ‘This is nuts.’”\n\nCrew chief Tony Brothers said the Clippers were incorrectly told that they would keep their timeout after it was determined they couldn’t challenge a play.\n\n“He was given an opportunity to try to get his composure, but it didn’t happen,” Brothers said. “He came out onto the floor when we wanted to start resuming play. He was given a technical foul. The first one he says: ‘I don’t care,’ and he continued to stay on the floor so he was given a second technical and ejected.”\n\nAustin Rivers will still laughing about the situation after the game and tweeted: “Welp.... thanksgiving is going to be weird,” before talking to reporters.\n\n“He actually is sensitive with stuff like that so we'll see what happens,” Austin Rivers said. “I love him, but it was a really good moment that I enjoyed a lot ... I really enjoyed that. It was fun.”\n\nHarden made both free throws before JaMychal Green made a 3 for Los Angeles. But Harden stole the ball from Kawhi Leonard, and Tyson Chandler made a reverse dunk with 37 seconds left to make it 100-91.\n\nLeonard led the Clippers with 26 points, 12 rebounds and seven assists and Lou Williams added 20 points off the bench.\n\nWestbrook added 17 points to help the Rockets win their fifth straight game.\n\nTIP-INS\n\nClippers: F Paul George (shoulder surgery) is getting close to returning and could make his season debut in the next few days. ... Beverley had six points and two rebounds. ... Green had 20 points.\n\nRockets: G Eric Gordon had arthroscopic surgery on his right knee and is expected to miss about six weeks. Gordon was injured on Monday night against New Orleans and general manager Daryl Morey announced that he had surgery on Wednesday. ... Houston made 14 of 42 3-pointers.\n\nCAPELA’S NIGHT\n\nClint Capela had 12 points and 20 rebounds before going to the locker room with about 4 1/2 minutes remaining after taking a blow to the face while fighting for a rebound. Capela has had at least 20 rebounds in three straight games to become the first Rocket to do that since Moses Malone in 1982.\n\nCoach Mike D’Antoni said after the game that he thought Capela was OK but that he was being evaluated and they’d know more on Thursday.\n\nTHEY SAID IT\n\nHarden on Houston’s defense: “These last five or six games we've been holding teams under 100 points or right at 100 points and that's going to get us where we need to go.”\n\nUP NEXT\n\nClippers: At New Orleans on Thursday night.\n\nRockets: Host Indiana on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764996654.86384
}