{
  "game_id": "401810089",
  "espn_id": "401810089",
  "date": "Nov 16, 2025",
  "matchup": "SA vs SAC",
  "headline": "Fox's season-high 28 points leads Spurs past Kings, 123-110, as Wembanyama sits out with calf injury",
  "body": "SAN ANTONIO -- — De’Aaron Fox had a season-high 28 points along with 11 assists and the San Antonio Spurs beat the Sacramento Kings 123-110 on Sunday with Victor Wembanyama missing his first game of the season with a calf injury.\n\n\r\n              Harrison Barnes added 20 points and Devin Vassell had 16 points as San Antonio snapped a two-game skid.\n\n\r\n              Wembanyama was ruled out prior to the game due to a strained left calf. San Antonio coach Mitch Johnson said the injury was progressive and not due to any single play. Wembanyama’s status is day to day.\n\n\r\n              San Antonio also lost Stephon Castle following the first half with an injured left hip. Castle had four points while playing 15:34 in the first half and closing the second quarter on the court. His status is unknown but he was on the bench in the second half.\n\n\r\n              The Spurs continued their balanced attack without Wembanyama leading the way.\n\n\r\n              Seven players scored in double figures with Keldon Johnson contributing 14 points and 12 rebounds.\n\n\r\n              DeMar DeRozan had 27 points to lead Sacramento, which lost its sixth straight. Domantas Sabonis added 17 points and 13 rebounds.\n\n\r\n              Fox beat his former team for the first time since being traded to San Antonio on Feb. 5 as part of a three-team deal with Chicago that brought Zach LaVine to the Kings. \n\n\r\n              Fox was limited to 16 points in his lone previous matchup with the Kings on March 7 while going 0 for 6 on 3-pointers. He drained his initial field goal Sunday along with his first two 3-point attempts in the opening minutes. He closed the game 4 for 8 on 3-pointers and was 11 for 20 from the field.\n\n\r\n              San Antonio won for the first time in a five-game homestand after losing leads in the final minutes of back-to-back losses to Golden State.\n\n\r\n              Up next\r\n              Sacramento plays Wednesday at Oklahoma City.\n\n\r\n              San Antonio hosts Memphis on Tuesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042634.718595
}