{
  "game_id": "0022400976",
  "espn_id": "401705542",
  "date": "Mar 16, 2025",
  "matchup": "DAL vs. PHI",
  "headline": "Quentin Grimes scores 28 as Sixers beat Mavs 130-125 in matchup of injury-depleted teams",
  "body": "DALLAS -- — Quentin Grimes scored 28 points in his first game against his former team and the Philadelphia 76ers beat the Dallas Mavericks 130-125 in a matchup of injury-depleted clubs Sunday.\n\n\r\n              Jalen Hood-Schifino added 19 points as the Sixers won for just the third time in 18 games.\n\n\r\n              P.J. Washington Jr. had 29 points and 12 rebounds for Dallas after missing the previous eight games with a sprained right ankle. Klay Thompson and Naji Marshall scored 21 apiece.\n\n\r\n              The defending Western Conference champion Mavericks dropped a season-worst three games under .500. Their lead for 10th, and the West's final play-in spot, is still 1 1/2 games over Phoenix, which lost to the Los Angeles Lakers 107-96 on Sunday.\n\n\r\n              The teams had 19 players between them listed as out on the injury report, headlined by Kyrie Irving and Anthony Davis for Dallas and Joel Embiid, Paul George and Tyrese Maxey for the Sixers.\n\n\r\n              Grimes joined Philadelphia in the “other” deal the Mavs made before the trade deadline. That was two days after Dallas infuriated its fan base by sending superstar Luka Doncic to the Lakers for Davis in early February.\n\n\r\n              Takeaways\r\n              76ers: Injured center Andre Drummond paid tribute to retired Mavericks superstar Dirk Nowitzki by wearing a T-shirt featuring the 7-foot German's one-legged, fadeaway shot. That's the pose used in Nowitzki's statue outside the arena.\n\n\r\n              Mavericks: The missing star power was on display with Irving (season-ending torn ACL) and Davis (strained groin) on the bench in street clothes. Embiid, George and Maxey weren't with the Sixers for the start of a six-game road trip, which matches their longest of the season.\n\n\r\n              Key moment\r\n              Grimes made two free throws for a 126-123 lead with 25 seconds left when a foul on Marshall was confirmed on review. \n\n\r\n              Key stat\r\n              The Sixers finished 20 of 24 on free throws after making all six in the final 25 seconds.\n\n\r\n              Up next\r\n              The Sixers finish a back-to-back at Houston on Monday. The Mavs visit Indiana on Wednesday.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764997140.214015
}