{
  "game_id": "0021800431",
  "espn_id": "401071112",
  "date": "Dec 15, 2018",
  "matchup": "DET vs. BOS",
  "headline": "Pistons end Boston's 8-game run, beat Celtics 113-104",
  "body": "DETROIT --  Jayson Tatum leaped toward the basket and Andre Drummond met him there, blocking the Boston forward's attempt at a one-handed dunk.\n\nIt was a fitting conclusion to an impressive second half of defense by the Detroit Pistons.\n\n\"I was thinking to myself as I was running. I'm like, if he gets this dunk, it's going to ignite their entire team,\" Drummond said. \"I have to do something.\"\n\nThere would be no late surge by the Celtics in the final minutes. Blake Griffin scored 27 points and Drummond added 19 points and 20 rebounds to help the Pistons win 113-104 on Saturday night, snapping the Celtics' eight-game winning streak. Detroit also ended its own six-game skid with a solid 48-minute effort.\n\nThe Pistons took control with a 13-0 run in the third quarter and played well at the start of the fourth as well.\n\n\"They looked great. They were screening us, they were active, they were alert, they played great,\" Celtics coach Brad Stevens said. \"We couldn't match them shot for shot because the way we were guarding, that's what we had to do, and we just couldn't do it. So hats off to them. It's not our best game. That's it.\"\n\nKyrie Irving led Boston with 26 points. The Celtics were down nine when Drummond blocked Tatum with 1:25 remaining.\n\nBoth teams shot over 60 percent from the field in the first quarter, and the game was still tight at halftime, with Detroit up 57-56. Drummond punctuated his team's 13-point run in the third with a dunk that put the Pistons ahead 76-66.\n\nBoston closed the quarter strong and trailed by just seven after three, but a 10-1 run to start the fourth put Detroit up 95-79.\n\nThe Celtics missed their first seven shots from the floor in the final quarter and went over seven minutes before making a field goal.\n\nThe Pistons had 20 turnovers, including eight in the fourth quarter.\n\n\"The simple plays, just making the simple pass is the key,\" Detroit coach Dwane Casey said. \"The game gives you simple plays and for whatever reason we kind of get discombobulated.\"\n\nTIP-INS\n\nCeltics: Marcus Smart was called for three fouls in the first 7:37. He did play a bit more before halftime and finished the game with 21 points and five fouls. ... The Celtics were without Jabari Bird (personal reasons), Al Horford (left knee) and Guerschon Yabusele (right ankle).\n\nPistons: Detroit was without Henry Ellenson (left ankle), Zaza Pachulia (illness), Glenn Robinson III (left ankle) and Ish Smith (right adductor). ... Reggie Bullock was back in the starting lineup after missing five games with a left ankle sprain. He scored 15 points.\n\nSTREAK\n\nOne streak that did stay intact was Griffin's run of 20-point games. He has at least 20 points in nine straight, the first Detroit player to do that since Richard Hamilton in 2008-09.\n\nGriffin also surpassed the 12,000-point mark for his career.\n\n\"It's good to get a win. We'll take it how we can get it,\" Griffin said. \"Guys stepped up and guys played really, really well tonight. I thought we earned that one.\"\n\nDIFFERENT CHALLENGE\n\nNone of the teams the Celtics beat during their winning streak currently has a winning record. Detroit improved to 14-13 by snapping the streak.\n\n\"We played a team that came here to play tonight,\" Smart said. \"They hit a lot of shots and they came out with more energy than we did. They hit us in the face and we wasn't ready.\"\n\nUP NEXT\n\nCeltics: Host Phoenix on Wednesday night.\n\nPistons: Host Milwaukee on Monday night.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "source": "espn_api",
  "crawled_at": 1764994705.239956
}