{
  "game_id": "0021700691",
  "espn_id": "400975437",
  "date": "Jan 22, 2018",
  "matchup": "PHX @ MIL",
  "headline": "Bucks beat Suns 109-105 hours after firing Jason Kidd",
  "body": "MILWAUKEE --  Khris Middleton spent three-plus years under Jason Kidd's tutelage, blossoming into a dangerous scorer with the Milwaukee Bucks.\n\nHe showed off what he learned in the Bucks' first game without Kidd.\n\nMiddleton scored 35 points, Malcolm Brogdon added a career-high 32 and Milwaukee beat the Phoenix Suns 109-105 on Monday night hours after firing Kidd.\n\n\"It's tough for me,\" Middleton said. \"He took my game to another level. He took this team to a whole other level. Today was a tough day.\"\n\nAssistant Joe Prunty was promoted to replace Kidd for the rest of the year. After a slow start, the Bucks heeded the new coach's call to focus.\n\nThe sharpshooting Middleton couldn't miss in the final minute.\n\nBrogdon had a steal with 40 seconds left after the Bucks double-teamed guard Devin Booker in the backcourt. Brogdon lobbed a cross-court pass to Middleton, who hit a jumper from the left corner with 24 seconds left for a 105-100 lead.\n\nMiddleton also hit a fade-away jumper from nearly the exact same spot with defender Isaiah Canaan in his face with 54 seconds left for a three-point edge that roused the crowd at the Bradley Center.\n\n\"We're professionals. It's about regrouping and coming out there and doing your job,\" Brogdon said.\n\nT.J. Warren had 23 points for Phoenix, which has lost four of five. Troy Daniels added 15 points on 5-of-10 shooting from 3-point territory.\n\n\"To me it felt like a playoff atmosphere game,\" Daniels said. \"They were physical, we were physical. We were right there trying to fight back.\"\n\nIt was an emotional night for the Bucks following the surprise firing of Kidd. His three-plus season tenure included two playoff appearances but stretches of inconsistency on both ends of the floor. Other than a 33-win season in 2015-16, the Bucks hovered around .500 under Kidd as a young core of Antetokounmpo, Middleton and Brogdon turned into top-flight players.\n\n\"He's been a great teacher for me. Mostly, I was a spot-up shooter. He allowed me to post up and expanded my game to pick-and-rolls and driving,\" Middleton said.\n\nThe Suns fell to 17-30, making them an ideal opponent for the Bucks to beat in their first game under Joe Prunty, the former assistant who will replace Kidd the rest of the season.\n\nPrunty was fiery at times on the sideline and jawed with an official, a contrast from Kidd's typically mild-mannered demeanor.\n\nMiddleton and Brogdon sparked the Bucks in the closing minutes by dominating in the backcourt.\n\nEric Bledsoe added 19 points for the Bucks against his former team. He was dealt to Milwaukee earlier this season in a trade that sent Greg Monroe to Phoenix.\n\nMonroe finished with 19 points and seven rebounds.\n\nThe Bucks started slow, then used a 24-10 in the first quarter to get back in the game that was tied at 53 at halftime.\n\nTIP-INS\n\nSuns: Monroe played for the first time in three games, and his 30 minutes were his most since playing 34 on Jan. 3 against Denver. Coach Jay Triano said he wanted to give a break to Tyson Chandler, the 35-year old starting center averaging about 26 minutes over his previous nine games. \"He has been going hard,\" Triano said. \"We'll give (Monroe) a chance to come back home where he was and see how he plays.\"\n\nBucks: Prunty stuck with a plan put in place by Kidd to rest Antetokounmpo for a second straight game because of knee soreness.\n\nHOT POTATO\n\nTurnovers punctuated sloppy stretches during the night, with the Bucks coughing up the ball 18 times. But Milwaukee also forced 22 turnovers, including four steals by the lightning-quick Bledsoe.\n\n\"They were more aggressive than we were. They were aimed at the ball,\" Triano said.\n\nSUN RAYS\n\nBooker was 2 of 14 from the field and finished with 14 points but added eight assists. ... F Jared Dudley had a season-high nine assists.\n\nQUOTABLE\n\n\"Once they made the decision, which was a tough one, that they did, they put the onus on the players. We understand that it's going to take us as a group collectively.\" -- veteran Bucks G Jason Terry, who also played with Kidd in the NBA.\n\nUP NEXT\n\nSuns: At the Indiana Pacers on Wednesday night.\n\nBucks: Host the Brooklyn Nets on Friday night.\n\n---\n\nThis version corrects to show Greg Monroe had 19 points.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "source": "espn_api",
  "crawled_at": 1764993903.465555
}