{
  "game_id": "0022301098",
  "espn_id": "401585726",
  "date": "Apr 02, 2024",
  "matchup": "HOU @ MIN",
  "headline": "Naz Reid helps Wolves gain ground in West with 113-106 win over Rockets",
  "body": "MINNEAPOLIS -- — Naz Reid strengthened his case for the Sixth Man of the Year Award with 25 points and six rebounds, Anthony Edwards scored 19 points and the Timberwolves kept up their push for the No. 1 seed in the Western Conference with a 113-106 victory over the Houston Rockets on Tuesday night.\n\n\r\n              The Timberwolves, who have clinched a playoff berth, are tied for second with Oklahoma City at 52-23, a half-game behind Denver, with seven games remaining in the regular season. \n\n\r\n              “It's a headache, man,” Wolves point guard Mike Conley Jr. said. “You look up and one day, you're first, next day, you're third, second, you never know. At this point, we're just trying to keep our head down, worry about the game that's in front of us and trying to take care of our business.”\n\n\r\n              Houston had a seven-game road win streak snapped and has dropped two in a row following 11 straight victories that brought it back into the playoff picture. The Rockets (38-37) are now three games out of the Western Conference's final play-in position.\n\n\r\n              Making his sixth straight start in place of injured Karl-Anthony Towns, Reid breathed life into an initially quiet Target Center crowd on Tuesday. The 6-foot-9 center is averaging 13.1 points and 5.1 rebounds and shooting 40.7% from 3-point range this season, all career highs.\n\n\r\n              “I was just playing my game, trying to get my rhythm ... from all facets of the floor,” Reid said. “We all have the same mindset, and that's to do whatever we need to win. Whether we're up 10 or down 10, just make it happen.”\n\n\r\n              His 3 from the right wing with 2:45 left helped stave off a late Rockets rally. Fred VanVleet's 3 on the previous possession had cut the Wolves' lead to one.\n\n\r\n              Reid recently said it's a personal goal to win the John Havlicek Sixth Man of the Year Trophy. With Kings reserve Malik Monk out for at least four weeks with a knee injury, Reid is on the short list of candidates to usurp him for the award.\n\n\r\n              Reid entered Tuesday first in points and 3s made and third in rebounds, blocks and steals among reserve centers.\n\n\r\n              Jalen Green led the Rockets with 26 points, five rebounds and six assists. VanVleet finished with 22 points.\n\n\r\n              “It's tough to do that in the NBA, win that many games in a row,” Houston coach Ime Udoka, the Western Conference coach of the month for March, said before the game regarding his team's 11-game win streak. “Players understand they have to increase their role, be more efficient. We've had to make some quick adjustments.”\n\n\r\n              The Rockets led by as much as 11 before the Wolves closed the first half on a 21-4 run. Reid led the way with 17 first-half points, Conley converted a four-point play on a 3-pointer from the top of the key, and Jordan McLaughlin made a pair of 3s to give Minnesota a 54-45 halftime lead.\n\n\r\n              The Wolves never trailed again.\n\n\r\n              Before Tuesday’s game, Wolves coach Chris Finch said he’d like to see his team come out with more of an edge at home. He didn't get his wish. Houston led 23-16 after a quarter and went ahead by 10 on Green's 3 to open the second.\n\n\r\n              “I think (our mindset is) just to keep going, to keep fighting,\" Reid said. “It's a 48-minute game; a lot of things can happen.”\n\n\r\n              UP NEXT\n\n\r\n              Rockets: Host Golden State on Thursday.\n\n\r\n              Timberwolves: Host Toronto on Wednesday.",
  "source": "espn_api",
  "crawled_at": 1764995565.727882
}