{
  "game_id": "0022300040",
  "espn_id": "401584128",
  "date": "Nov 21, 2023",
  "matchup": "PHI vs. CLE",
  "headline": "Garland leads shorthanded Cavaliers to 122-119 win over 76ers in overtime",
  "body": "PHILADELPHIA -- Despite playing shorthanded for a third straight game, the Cleveland Cavaliers continued their winning ways as Darius Garland scored 32 points and Jarrett Allen added 26 in a 122-119 overtime win over the Philadelphia 76ers on Tuesday night in the NBA In-Season Tournament.\nThe Cavaliers (8-6, 2-1 In-Season Tournament) have won four straight and remained alive for the Eastern Conference's wild-card berth despite playing without three rotation pieces in Donovan Mitchell, Caris LeVert and Isaac Okoro due to injury.\n\"It gives us some confidence,\" Garland said. \"We have to keep it rolling, keep moving the ball and the bodies moving. Our bigs have been holding it down right now.\"\nCleveland had six players in double figures. The Cavs dominated the paint and the glass, outrebounding the Sixers 61-53 and holding a 68-52 edge in points in the paint.\n\"These guys want to do it for each other,\" Cleveland coach J.B. Bickerstaff said. \"The Cavaliers way is that the team is better than the individual. These guys bought into it and they are figuring out who we are.\"\nThe 76ers (10-4, 2-2 In-Season Tournament) have lost both of their tournament games on their bright red home court. Overall, the 76ers have lost three straight at home after winning their first six at home to start the season.\nJoel Embiid scored 32 points and Tyrese Maxey added 30 for the Sixers.\n\"We raised our level of play in the second half and gave ourselves a chance,\" Philadelphia coach Nick Nurse said. \"It just didn't work out.\"\nThe Cavs were able to control the tempo through three quarters, grabbing an 18-point lead early in the third quarter. Still, Maxey and Embiid helped Philadelphia climb back, cutting Cleveland's lead to nine at the end of three and briefly grabbing a one-point lead on a three-play play with 2:07 to play.\n\"We got them where we wanted them,\" Garland said, describing the mood as overtime began. \"We just had to go back to what was working. We needed to go back (to the paint), attack Joel and try to get him out of the game (with fouls.)\"\nAllen hit the biggest shot of the night, an 8-foot hook shot off Craig Porter's ninth assists of the game to give the Cavs a 120-119 lead with 18 seconds left in overtime. Both Embiid and Maxey missed layups at the other end. Garland made two free throws with 9.7 seconds left after Embiid fouled out. Philadelphia's chances for a second overtime crashed when Maxey's final 3-point attempt fell short.\nSixers guard Kelly Oubre Jr. continued his rehab work after breaking a rib after allegedly being hit by a car on Nov. 11 as a pedestrian on a downtown Philadelphia street.\nOubre participated on Monday in individual on-court workouts and will be reevaluated in a week to determine when he can return to the court. \"He was in good spirits and it was good,\" Nurse said. \"He was pretty energetic on the court (Monday).\"\nUP NEXT\nCavaliers: Return home to face Miami on Wednesday.\n76ers: Open a two-game road trip against Minnesota on Wednesday night.",
  "source": "espn_api",
  "crawled_at": 1764996437.6048782
}