{
  "game_id": "0021900543",
  "espn_id": "401161185",
  "date": "Jan 06, 2020",
  "matchup": "ATL vs. DEN",
  "headline": "Nikola Jokic scores career-high 47 points with no turnovers",
  "body": "ATLANTA -- Nikola Jokic wasn't keeping track of his points as the night wore on. He just knew he was scoring a lot.\n\"I never know that,\" he said. \"I just liked the flow of the game. I think I made a few shots and got to the line a little bit, and I think the flow was really good for me.\"\nJokic scored a career-high 47 points, Will Barton added a season-best 28, and the Denver Nuggets held off the Atlanta Hawks 123-115 on Monday.\nThe Nuggets, coming off a surprising loss at Washington two nights earlier, have won four of six to improve to 25-11, second in the Western Conference. Atlanta, worst in the NBA at 8-29, has dropped 11 of 13.\nTrae Young finished with 29 points, and Kevin Huerter had 22 for the Hawks.\nJokic's previous career high of 41 points was set Nov. 7, 2017, at home against Brooklyn. His previous season high of 31 came at home nine days ago against Memphis.\nAccording to the Elias Sports Bureau, Jokic is the third center with 45 points and no turnovers in a game, joining Shaquille O'Neal (Nov. 9, 1994, at Hornets) and Moses Malone (April 8, 1987, at Nets). Turnovers were first tracked in 1977-78.\n\"We go as he goes,\" Barton said. \"I feel like no one can stop him.\"\nJokic surpassed his previous career high with a putback that gave Denver a 114-109 lead with 3:14 remaining. Jamal Murray followed with a turnaround jumper in the lane, and Barton put back his own miss to put the Nuggets up 118-109 at the 1:57 mark.\nThat essentially ended all hopes for the Hawks, but it wasn't entirely easy for Denver.\nAfter John Collins' dunk cut the lead to 91-88 just 22 seconds into the fourth quarter, Nuggets coach Michael Malone called a timeout. Monte Morris followed with a runner, and Michael Porter Jr. jammed in a putback to make it 95-88.\nThe Hawks cut the margin to one before Barton found Morris for an alley-oop and hit a 3-pointer to make it 106-100 with 6:54 remaining. Atlanta pulled within two on Young's 35-footer with 4:24 left, and Malone called another timeout. The move worked, as the Hawks made just three field goals the rest of the way.\nHuerter's second straight 3 cut the lead to two at the 6:07 mark of the third, and then Malone called a timeout. Jokic quickly followed with a jumper, then stole the ball in the lane from Alex Len to set up Murray's two free throws.\n\"Jokic is definitely a very skilled player,\" Collins said. \"I felt like he got to the line a lot tonight, which gave him a little bit of a boost, but I still feel like down the stretch and for four quarters, we did a solid job just trying to make him take tough shots. We did the best we could.\"\nJerami Grant's three-point play made it 36-34 at the 9:37 mark of the second, and the Nuggets didn't trail again. About three minutes later, Grant rebounded a missed Hawks shot and drove for a layup that gave Denver its first double-digit lead.\nMurray's layup in the final second put the Nuggets up by nine at halftime.\nTIP-INS\nNuggets: Murray and Barton both returned after overcoming minor injuries that caused them to leave in the third. Murray, who finished with 16 points after scoring a season-high 39 at Washington, knelt down before walking off the floor after getting tangled up on Len's hard screen. Barton's right knee knocked against De'Andre Hunter's knee early in the third. ... Murray missed a free throw in the third, ending a streak of 37 straight makes from the foul line. ... It was Barton's 29th birthday. ... Denver outrebounded the Hawks 40-34 and has won 12 straight and 17 of 19 when leading on the boards. ... The Nuggets are 7-4 in games decided by 10 or fewer points.\nHawks: Young made a dazzling move early in the fourth, faking a behind-the-back pass as he was driving past Morris and Porter to dribble the ball between his legs before making a right-handed layup. ... F Vince Carter, a 42-year-old in his final season, jumped in the lane to block Gary Harris' dunk attempt out of bounds midway through the fourth. ... F Jabari Parker, the team's third-leading scorer, missed his fourth straight game due to a right shoulder impingement.\nAVENGED\nThe Nuggets lost 125-121 to the Hawks at home in mid-November, as Young had 42 points and 11 assists. Denver had dropped nine of 11 in Atlanta.\n\"The Hawks beat us on our home court,\" Barton said. \"We had to come in and handle business.\"\nUP NEXT\nNuggets: At the Dallas Mavericks on Wednesday.\nHawks: Host the Houston Rockets on Wednesday.\nThe Associated Press contributed to this report.",
  "source": "espn_api",
  "crawled_at": 1764996686.066894
}