{
  "game_id": "0021900007",
  "espn_id": "401160629",
  "date": "Oct 23, 2019",
  "matchup": "MEM @ MIA",
  "headline": "Butler misses Miami debut, Heat beat Grizzlies 120-101",
  "body": "MIAMI --  An opening-night sellout crowd in Miami came to see Jimmy Butler.\n\nThey wound up being enthralled by rookies Kendrick Nunn and Chris Silva instead.\n\nJustise Winslow finished with 27 points, seven rebounds and seven assists, Nunn scored 24 points in his NBA debut and the Heat -- playing without Butler, who missed the game for personal reasons -- put together a huge fourth quarter to beat the Memphis Grizzlies 120-101 on Wednesday night in the season opener for both teams.\n\n\"Just the beginning,\" Nunn said.\n\nHis beginning had a heck of a finish.\n\nA 24-1 run in the fourth turned everything around for Miami, which trailed 86-83 after Grayson Allen scored the opening basket of the final quarter for Memphis.\n\nAfter that, it was all Miami. Nunn and Silva -- also making his NBA debut -- combined for 19 points on 8-for-10 shooting in the fourth, with eight rebounds and three blocks. The Grizzlies, total, managed 17 points, seven rebounds and no blocks in the fourth.\n\n\"Obviously a tough one,\" Grizzlies coach Taylor Jenkins said after his career debut. \"The fourth quarter is not indicative of who we are and what we can be.\"\n\nJa Morant, the No. 2 pick in this year's draft, scored 14 points and had four assists for Memphis. Jaren Jackson Jr. led the Grizzlies with 17 points, and Tyus Jones added 15.\n\nMorant got off to a fast start, making his first four shots and going 5 for 7 in the first half. He picked up his fourth foul 17 seconds into the second half, and finished 6 for 12 from the floor.\n\n\"I'm not focused on the positives,\" Morant said. \"For me it's just the negative. I felt I could have been better in a lot of places, help my team out with turning up the pace to keep us going. They capitalized on a lot of our mistakes tonight.\"\n\nGoran Dragic scored 19 points for Miami, while Bam Adebayo had 14 points and 11 rebounds. Butler was with the Heat for their morning shootaround practice, then told the team around mid-afternoon that he would not be able to play.\n\n\"Everything is fine,\" Heat coach Erik Spoelstra said.\n\nThe Heat were also without guard Dion Waiters, suspended one game for conduct detrimental to the team, and forward James Johnson -- still out because of a conditioning issue that kept him from training camp and sidelined for all five of Miami's preseason games.\n\nMemphis hasn't won a season-opening game on the road since the franchise's inaugural game at Portland in 1995. The Grizzlies are 0-7 in openers away from home since.\n\nTIP-INS\n\nGrizzlies: None of the five players who started Memphis' opener last year are still with the Grizzlies. ... Jonas Valanciunas picked up four fouls by halftime, a first in his career. He'd had three fouls by the break on 73 previous occasions, including playoffs. ... Memphis had 60 points by halftime, a team record for a season opener. The previous high was 56 -- by Vancouver against Seattle in 2000. A year ago, Memphis had 39 at halftime of Game 1.\n\nHeat: Having Herro and Nunn in the starting lineup marked the fourth time in franchise history that Miami had two rookies in the first five on opening night. They joined Kevin Edwards and Rony Seikaly (1988), Udonis Haslem and Dwyane Wade (2003) and Mario Chalmers and Michael Beasley (2008). ... Spoelstra is beginning his 25th season with the organization.\n\nALLEN RETURNS\n\nRay Allen was back, and back in his spot. The former Heat guard attended the opener, and when he was introduced to the crowd after the first quarter, he went to the far corner opposite the Heat bench -- where he hit the overtime-forcing 3-pointer with 5.2 seconds left in Game 6 of the 2013 NBA Finals against San Antonio, a series Miami would win in seven games. \"It's like I never left,\" Allen said.\n\nYOUNG DEBUTS\n\nHerro, at 19 years and 276 days, became the youngest player to ever start for the Heat. Morant -- 20 years and 74 days -- became the second-youngest player to start a season opener for the Grizzlies. Shareef Abdur-Rahim was 19 years, 326 days old when he opened for Vancouver against Portland on Nov. 1, 1996.\n\nUP NEXT\n\nGrizzlies: Host Chicago on Friday.\n\nHeat: Visit Milwaukee on Saturday.\n\n---\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764995776.214831
}