{
  "game_id": "0021900890",
  "espn_id": "401161532",
  "date": "Feb 29, 2020",
  "matchup": "IND @ CLE",
  "headline": "Warren, Brogdon lead Pacers past Cavaliers. 113-104",
  "body": "CLEVELAND --  The Indiana Pacers aren't big on headlines and highlight reels.\n\nThe Pacers showed off their specialty- winning plays down the stretch -- in a 113-104 victory over the Cleveland Cavaliers on Saturday night\n\nT.J. Warren scored 30 points, Malcolm Brogdon hit the go-ahead basket midway through the fourth quarter in a game that was tied 15 times and had 12 lead changes.\n\n\"I felt like we didn't panic at the end,\" said Domantas Sabonis, who fell just short of a triple-double with 18 points, 13 rebounds and nine assists. \"We really wanted to come out and get it done the way we know we're capable of.\"\n\nWarren had three baskets down the stretch while Brogdon's jumper gave Indiana a 96-95 lead with 6:41 remaining. Center Myles Turner's 3-pointer with the shot clock winding down and a minute to play sealed it.\n\nBrogdon scored 22 points. Sabonis had his 46th double-double of the season and Victor Oladipo, a game-time decision with a sore ankle, scored 19 points.\n\n\"We have five guys on the court that can get us a great look -- and a lot of teams can't say that,\" Oladipo said after the Pacers won for the fifth time in six games after losing a season-high six in a row.\n\nThe Pacers trail Philadelphia by a game for fifth in the Eastern Conference, but coach Nate McMillan and his team don't receive the attention other contending teams do.\n\n\"He doesn't get the respect outside the coaching circles that he deserves,\" Cavaliers coach J.B. Bickerstaff said. \"His teams are always well coached. His teams very rarely beat themselves. They play to their strengths. They have underappreciated guys to go along with with being an underappreciated team and coach too.\"\n\nCavaliers center Andre Drummond, who returned after missing two games because of a strained left calf, had 27 points and 13 rebounds. Kevin Love had 20 points and 12 rebounds.\n\nThe game was tied 11 times in the first half and again at 86 going into the fourth quarter. Warren and Brogdon keyed Indiana's surge to a 108-101 lead. Love's 3-pointer with 2:07 left cut it to 108-104, but Cleveland didn't score again.\n\n\"We were right there going back and forth the entire games,\" Love said. \"We just couldn't pull this out, which was tough for us.\"\n\nCleveland is 3-3 since Bickerstaff took over as coach when John Beilein resigned during the All-Star break. The Cavaliers won the final game Beilein coached.\n\nOladipo played despite twisting his left ankle in Thursday's win over Portland and feeling soreness before the game. He missed the first 47 games while coming back from a ruptured quad tendon in his right knee last season.\n\n\"My ankle is a little sore now, but I was able to move pretty good out there,\" he said.\n\nTIP-INS\n\nPacers: Indiana began a five-game trip that takes a circuitous route to Cleveland, San Antonio, Milwaukee, Chicago and Dallas. Indiana hosts Boston on March 10. ... Coach Nate McMillan said he expects G Aaron Holiday and G Justin Holiday to receive more time at shooting guard following the loss of Jeremy Lamb to a season-ending left knee injury.\n\nCavaljers: G Collin Sexton scored 16 points and is 27 of 52 from the field in the last three games. ... C Tristan Thompson was out because of a bruised left knee. ... Cleveland opened a five-game homestand that also features Utah, Boston, Denver and San Antonio.\n\nTAKE ONE FOR THE TEAM\n\nOladipo, who is 6-foot-4 and 210 pounds, took a charge in the third quarter when the 6-11, 279-pound Drummond drove into the lane after getting a steal at midcourt. Oladipo established position in the lane with Drummond coming at him and the collision sent both players to the floor.\n\nTD PASSES\n\nLove and Drummond exchanged long passes for easy baskets in the third quarter. Drummond hit Love for a layup before the two traded places on Cleveland's next possession. The Pacers called timeout while Love and Drummond celebrated at midcourt.\n\n\"That was the first time I've seen that,\" Drummond said. \"Play after play, that's big time.\"\n\nDrummond prefers to start the long plays than be on the receiving end.\n\n\"For me I like to pass,:\" he said. \"So if the Browns need a backup quarterback, you know where to find me. I'm pretty accurate.\"\n\nUP NEXT\n\nPacers: At San Antonio on Monday night.\n\nCavaliers: Host Utah on Monday night.",
  "source": "espn_api",
  "crawled_at": 1764995835.289641
}