{
  "game_id": "0021600517",
  "espn_id": "400899416",
  "date": "Jan 02, 2017",
  "matchup": "CHI vs. CHA",
  "headline": "Butler has 52 to help Bulls top Walker, Hornets",
  "body": "CHICAGO -- Following a year of inconsistency and disappointment, the Chicago Bulls entered 2017 with plenty of resolutions.\nThere's one thing, however, they are hoping remains the same -- the production of Jimmy Butler.\nButler scored 52 points and outdueled Kemba Walker, carrying Chicago in a 118-111 victory over the Charlotte Hornets on Monday night.\nButler was a point shy of his career high, which he got Jan. 14, 2016 at Philadelphia. He scored 20 points in the first half and 17 in the game's final four minutes.\n\"It's an understatement to say he was phenomenal. He did it in any which way,\" Bulls coach Fred Hoiberg said. \"He just took what the defense gave him and obviously made huge plays down the stretch.\"\nButler also had 12 rebounds and six assists while shooting 21 of 22 from the free-throw line. He has scored at least 25 points in four straight games, and his performance Monday surpassed his previous season high of 40 points, which he notched Wednesday against Brooklyn.\n\"I was just playing basketball,\" Butler said. \"I didn't even know how many points I had. I just had a groove. Coach kept drawing up the same play.\"\nWalker went blow-for-blow with Butler for much of the game, boosting his All-Star candidacy with 34 points and a season-high 11 rebounds. Walker, who scored 37 points against Cleveland on Saturday, notched consecutive 30-point games for the first time since March 7-9, 2016.\nStill, Hornets coach Steve Clifford saw room for improvement from everyone -- his star included.\n\"(Walker) did a good job on offense,\" Clifford said. \"But we have to try on defense, all of them. Our defense is soft and they pick and choose when they want to play. It's not going to work.\"\nCharlotte, which entered Monday ranked among the top defensive teams in the NBA at 102.6 points allowed per game, has surrendered 119.5 over its last two losses.\nNikola Mirotic had 12 points and Michael Carter-Williams finished with 10 points and nine rebounds for Chicago.\nNic Batum, who recorded a triple-double in Charlotte's victory over Chicago on Dec. 23, had 19 points, six rebounds and five assists. Jeremy Lamb added 15 points off the bench.\nCharlotte led Chicago for much of the second half until Butler's three-point play with four minutes remaining tied the game at 100. Carter-Williams' jumper at 2:33 gave the Bulls a lead they would not relinquish.\nSTILL NO LOVE FOR RONDO\nRajon Rondo, who indicated he may ask for a trade after being benched both Friday and Saturday, again received no floor time in Monday's win. The 11th-year guard is averaging 7.2 points and 7.1 assists per game.\nTIP-INS\nHornets: Cody Zeller entered the NBA's concussion protocol Monday after taking an elbow to the head in the fourth quarter of Saturday's contest with the Cleveland Cavaliers. He has no timetable for return. Roy Hibbert started in place of the injured Zeller. ... Marco Belinelli (left ankle sprain) missed his fifth straight game.\nBulls: Dwyane Wade sat with swelling in his left knee. The 34-year-old veteran noticed the swelling Saturday night after playing in back-to-back defeats. Hoiberg does not believe the issue warrants an MRI, and Wade could return Wednesday against Cleveland. ... Rookie Denzel Valentine, who had played just four total minutes over his last seven games, played 18 minutes and hit his first three 3-pointers, finishing with nine points. He exited with an ankle injury in the second half.\nUP NEXT\nHornets: Host the Thunder on Wednesday night. Charlotte has dropped 13 of its last 15 against Oklahoma City.\nBulls: Visit the Cavaliers on Wednesday night. Rondo had a triple-double in Chicago's 111-105 victory against Cleveland on Dec. 2.",
  "source": "espn_api",
  "crawled_at": 1764995063.674214
}