{
  "game_id": "0021500372",
  "espn_id": "400828259",
  "date": "Dec 16, 2015",
  "matchup": "CHA @ ORL",
  "headline": "Frye's 17 points help Magic beat Hornets 113-98",
  "body": "ORLANDO, Fla. --  Channing Frye's 3-point shooting got him a spot in Orlando's starting lineup 11 games ago.\n\nIt took a while, but the nine-year veteran is starting to show that was a good move.\n\nFrye hit 5 of 7 from deep and scored a season-high 17 points to help the Magic romp past the Charlotte Hornets 113-98 on Wednesday night.\n\nThe 6-foot-11 power forward is 8 for 12 from long range in his last two games, both easy wins for Orlando. He was 3 for 13 in the previous six games when Orlando was 3-3.\n\n\"We were missing him out there the last couple of games and now we found him,\" Magic coach Scott Skiles said. \"Opponents have something else to be concerned about and that should open some other guys up.\"\n\nFrye's shooting spread the floor for teammates, who had season highs for shooting percentage (55.8 percent), 3-pointers made (14) and 3-point shooting (58.3 percent) against a scrambling Charlotte defense.\n\n\"It's my job to create space and if they're going to leave me open, I'm going to shoot,\" Frye said. \"We can be a great team if we rely on each other and just get the best shot possible every possession.\"\n\nAll five Magic starters were in double figures. Evan Fournier scored 15 points, Nik Vucevic had 14 points and eight rebounds and Elfrid Payton had 12 points and nine assists for Orlando. Tobias Harris scored 13 for the Magic, and Orlando led by as many as 25 in the fourth quarter before turning the game over to the reserves.\n\nThe Hornets shot well at times, but had trouble sustaining any momentum. Charlotte hit 36 of 79 shots (45.6 percent), but 16 turnovers cost them 25 points.\n\nReserve Jeremy Lamb led the Hornets with 16 points. P.J. Hairston had 14 points, Kemba Walker had 12 and Cody Zeller had 11. Charlotte's starting five was just 16-of-40 shooting.\n\n\"The whole tone for the game was set by turnovers in the first quarter,\" Charlotte coach Steve Clifford said. \"That led to wide open shots and that's how some of their guys got going. We never got our defense where it was good enough to make a real run in the game.\"\n\nVictor Oladipo scored 11 points and Jason Smith had 10 for the Magic.\n\nFrye hit 4 of 5 3-point attempts to help Orlando build a 58-45 halftime lead. The Magic pushed the lead to 70-52 about 5 minutes into the third and never let Charlotte closer than 11 points the rest of the game.\n\nOrlando's swift ball movement resulted in 28 assists on 43 baskets. Charlotte's defenders were constantly a step behind while the Magic swung the ball from side-to-side and found wide-open shooters.\n\n\"Too many easy shots,\" Hairston said. \"We gave them the shots they wanted and they took what we gave them.\"\n\nJEFFERSON SUSPENSION STARTS\n\nCharlotte C Al Jefferson missed the last six games with a calf strain. He is healthy again but will miss the next five Hornets games serving a suspension for violating the league's drug policy. The Hornets play five games in the next 10 days. Jefferson won't be eligible until Charlotte hosts Memphis Dec. 26. \"Al is going to have to do a lot of conditioning,\" Clifford said. \"He can do shootarounds, but with our schedule, we won't be doing a lot of practicing so he's going to have to get work in with the assistant coaches and trainers.\"\n\nBACK ON TRACK\n\nThe Magic have won two straight since a 111-76 loss to the Cleveland Cavaliers a week ago. Orlando's two wins have been by 13 over Brooklyn and 17 over Charlotte and the Magic dominated the play in both games. \"It says a lot that we got back on track,\" Payton said. \"Sometimes those games are going to happen, but you can't let consecutive losses go on. We got back on track fast.\"\n\nTIP-INS\n\nCharlotte: Jefferson missed his seventh straight game. Charlotte is 4-3 in his absence. ... The Hornets lead the NBA with only 12.5 turnovers a game. ... The Hornets bench averages 40.4 points a game, best in the Eastern Conference. They had 49 against Orlando. ... The Hornets are averaging 10.1 3-pointers per game, four more than they averaged last season (6.1).\n\nMagic: The Magic had 18 assists on 23 baskets in the first half. ... Payton averaged just 9.9 points on 34.2 percent shooting the first 14 games. He's averaged 14.5 points on 48 percent shooting the last 10. ... Orlando has eight home wins this season. They got their eighth home win last season on Feb. 20.\n\nUp Next:\n\nHornets: Play at Toronto on Thursday night.\n\nMagic: Host the Trail Blazers on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994395.4477901
}