{
  "game_id": "0022200784",
  "espn_id": "401468939",
  "date": "Feb 02, 2023",
  "matchup": "MIL vs. LAC",
  "headline": "Antetokounmpo scores 54 points, Bucks beat Clippers 106-105",
  "body": "MILWAUKEE -- — Giannis Antetokounmpo celebrated his most famous 50-point performance by ordering 50 chicken nuggets at a Chick-fil-A drive-through the next day.\n\n\r\n              He already has an idea how to commemorate reaching that plateau for the third time in the last month.\n\n\r\n              Antetokounmpo scored 20 of his 54 points in the fourth quarter and the Milwaukee Bucks overcame a 21-point deficit to beat the Los Angeles Clippers 106-105 on Thursday night for their sixth consecutive victory.\n\n\r\n              “Tomorrow I think I'm going to go to Culver's,” said Antetokounmpo, who also had 18 rebounds. “I'll go get 50 cheeseburgers and try to eat as many as I can. The rest, I'll have my son eat them or I give them to my dog.\"\n\n\r\n              The Greek star has scored at least 50 points in three of his last 11 games. He had a career-high 55 on Jan. 3 in a 123-113 victory over Washington and scored 50 in only 30 minutes Sunday in a 135-110 triumph over New Orleans.\n\n\r\n              Antetokounmpo now has reached the half-century mark in six career regular-season games. That doesn’t include his 50-point outburst against the Phoenix Suns in Game 6 of the 2021 NBA Finals, which gave the Bucks their first title since 1971 and led to his trip to Chick-fil-A.\n\n\r\n              He joins Kareem Abdul-Jabbar as the only players in Bucks history to have at least three 50-point games in a season.\n\n\r\n              “It's a great compliment to be up there with Kareem,” Antetokounmpo said. “Man, I never thought I was going to score 50 in the NBA when I got drafted. It's an insane, crazy journey.”\n\n\r\n              Over his last six games, Antetokounmpo has averaged 40.2 points and 14.5 rebounds. His two free throws with 1:47 remaining put Milwaukee ahead 106-105 for its first lead since the second quarter as the Bucks scored the final seven points of the game.\n\n\r\n              Antetokounmpo squandered an opportunity to put Milwaukee in front when he missed two free throws in a 105-104 game with 2:13 left. But he drove to the basket again on the Bucks' next possession, drew Ivica Zubac's sixth foul and hit his free throws this time around.\n\n\r\n              “He's relentless,” Bucks coach Mike Budenholzer said. “He's going to put himself in position to help us win. Whatever it takes for us to win, he's going to do it. He's fearless and relentless. That's what you saw going down the stretch.”\n\n\r\n              The Clippers failed to capitalize on a couple of Milwaukee turnovers in the closing seconds. Kawhi Leonard missed an 18-footer in the final second while being guarded by Wesley Matthews with help from Pat Connaughton.\n\n\r\n              “I've been doing that since my mom told me I've got to guard the best player when I was 4 years old,” Matthews said. “That's just who I am. Nothing but respect for those guys. I feel like those guys have that same (respect) toward me. The best way to pay them respect is to try and stop them. The best way they can pay me respect is to go after me.”\n\n\r\n              The Clippers had plenty of chances to pull back ahead.\n\n\r\n              Paul George stole the ball from Jrue Holiday and the Clippers called a timeout with 27.1 seconds left in a one-point game, but Leonard missed a jumper. Antetokounmpo got the rebound but threw the ball out of bounds, giving Los Angeles possession with 15.1 seconds to go.\n\n\r\n              The Clippers again got the ball to Leonard, who missed once more.\n\n\r\n              “We wanted to run it to Connaughton, but they switched the matchup,\" Clippers coach Tyronn Lue said. \"They brought Matthews into it. He did a good job of climbing into Kawhi, making him uncomfortable and making him back up a little bit so he couldn’t get right downhill.”\n\n\r\n              Norman Powell scored 26 points to lead the Clippers. Leonard had 17 points, 11 rebounds and five assists, but shot 7 of 26. Marcus Morris and George had 16 points each. Zubac had 12 points and 13 rebounds.\n\n\r\n              Khris Middleton had 16 points and Holiday added 12 for the Bucks. Holiday missed his first eight shots and didn’t get his first basket until late in the third quarter.\n\n\r\n              TIP-INS\n\n\r\n              Clippers: Morris returned after missing four games with a bruised rib. …George earned his eighth career All-Star selection earlier in the day. \n\n\r\n              Bucks: Holiday was named an All-Star reserve, marking his first All-Star selection since 2013 with the Philadelphia 76ers. He joins Antetokounmpo on the All-Star team. This is the fourth time in the last five seasons that the Bucks have had multiple All-Stars.\n\n\r\n              UP NEXT\n\n\r\n              Clippers: At New York on Saturday night.\n\n\r\n              Bucks: Host Miami on Saturday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994568.431892
}