{
  "game_id": "0022200643",
  "espn_id": "401468798",
  "date": "Jan 14, 2023",
  "matchup": "MEM @ IND",
  "headline": "Morant's slam in Indy highlights Grizzlies' 9th straight win",
  "body": "INDIANAPOLIS -- — Ja Morant had 23 points, 10 assists and another ferocious dunk, and the Memphis Grizzlies beat the Indiana Pacers 130-112 on Saturday night to extend the NBA's longest current winning streak to nine games.\n\n\r\n              Desmond Bane scored 25 points to lead the Grizzlies, who tied Denver for the Western Conference's best record at 29-13.\n\n\r\n              Neither Bane nor Morant was needed in the fourth quarter. Morant's soaring slam over Jalen Smith made it a 20-point game with 4:20 left in the third, and Memphis led by as much as 34 in the fourth.\n\n\r\n              Asked if the dunk was his best, Morant said, “Yeah, easy” because of the difficulty, then added, “It's what everybody has been waiting for. I finally made it.”\n\n\r\n              Added Bane: “I ain't seen nothing like that one. That's probably going to go down as dunk of the year.”\n\n\r\n              The game was tied in the second quarter before Memphis outscored the Pacers 27-11 to take a 68-52 lead at halftime. Morant had five points and four assists during that span.\n\n\r\n              “Obviously we're having fun out there, playing hard and playing together,” said Bane, who grew up in Richmond, Indiana.\n\n\r\n              Santi Aldama added 17 points and Ziaire Williams 13 for the Grizzlies.\n\n\r\n              “We're not playing perfect basketball,\" Grizzlies coach Taylor Jenkins said of the streak. “I'm just glad our guys are finding different ways to win, whether we're playing with a lead or playing from behind. Each game has presented a different challenge for us and our guys have stayed the course.”\n\n\r\n              Reserve guard Chris Duarte scored 25 points for the Pacers. Rookie Bennedict Mathurin had 16 and T.J. McConnell 13.\n\n\r\n              \"That very well may be the best team on the planet right now,\" Pacers coach Rick Carlisle said. “They're very hard to play.”\n\n\r\n              The Pacers, missing two starters, have lost three in a row. Point guard Tyrese Haliburton, Indiana's leading scorer and NBA assist leader, is expected to miss two weeks after sustaining a left elbow strain and left knee contusion on Wednesday. Center Myles Turner, who averages 17 points, is out with back spasms.\n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Morant has averaged 28.7 points during the streak. ... Have won four in a row on the road to improve to 11-10 in away games.\n\n\r\n              Pacers: Duarte angrily exited in the second quarter with a sore left hand and used his right hand to knock over a chair. He returned midway through the third. \n\n\r\n              UP NEXT\n\n\r\n              Grizzlies: Host Phoenix on Monday.\n\n\r\n              Pacers: Visit Milwaukee on Monday.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994527.4304261
}