{
  "game_id": "0021800555",
  "espn_id": "401071231",
  "date": "Jan 02, 2019",
  "matchup": "CLE vs. MIA",
  "headline": "Richardson leads Wade-less Heat past Cavaliers, 117-92",
  "body": "CLEVELAND --  Dwyane Wade's absence was no problem for the Miami Heat on Wednesday night.\n\nWith Wade sitting out because of an illness, Josh Richardson led seven players in double figures with 24 points and Miami rolled past the Cleveland Cavaliers 117-92.\n\nHeat coach Erik Spoelstra wasn't surprised so many players made key contributions without their third-leading scorer.\n\n\"One of our biggest strengths is our depth and versatility,\" he said. \"We should be a team with 7-8 guys in double figures every night. It shows we have a lot of guys that can hurt you.\"\n\nMiami hit 16 of 31 3-pointers. Tyler Johnson added 16 points, and Derrick Jones Jr. had 13. The Heat have won seven of nine to reach the .500 mark at 18-18.\n\n\"Everyone was just kind of in a groove,\" Richardson said. \"I was taking what the defense was giving me, but yeah, I was feeling it.\"\n\nCleveland dropped to 8-30 -- the worst record in the NBA -- with its season-worst seventh straight loss.\n\nCavaliers coach Larry Drew believes his team must show more toughness physically and mentally.\n\n\"We've got to be grimy as far as our style of play,\" he said. \"We can't play cute. We can't play pretty. We've got to get on the floor for loose balls. We've got to get our body on people when they go in (the lane). We've got to do all the little things, which add up to be big things.\"\n\nTristan Thompson and Rodney Hood returned from injuries and started for the Cavaliers, but it mattered little in their ninth loss in 10 games. Thompson had 14 points, and Hood added 13.\n\nThe Heat grabbed control in the second quarter, turning a one-point deficit into a 17-point lead. Jones scored 11 points in the period while Dion Waiters, playing in his first game in over a year, had seven points in six minutes.\n\n\"I was just really excited to get back,\" Waiters said. It was nice -- all the hard work you put in -- to have those shots fall, it felt good. I had fun.\"\n\nMiami outrebounded Cleveland 25-9 in the first half. Heat center Hassan Whiteside had nine boards, matching the Cavaliers' total for the first two quarters.\n\nCleveland led 30-29 early in the second when Miami took over. The Heat hit six 3-pointers in the quarter, including three by Jones. Waiters added a 30-footer while Richardson and Tyler Johnson also hit from beyond the arc.\n\nMiami led 58-43 at halftime and continued to pad the margin. Whiteside scored on an alley-oop from James Johnson, who added a pair of 3-pointers. Richardson's 3-pointer at the buzzer pushed the lead to 93-73.\n\nThe Heat can move over .500 for the first time since they were 3-2 with a win over Washington at home Friday.\n\nNIGHT OFF\n\nWade is averaging 14.1 points in 27 games in his 16thand final season. He played in 46 games last season with Cleveland, where he was reunited with LeBron James, before being traded to Miami. Wade is one 3-pointer shy of 500 for his career.\n\nSHOOTING AROUND\n\nDrew said forward Kevin Love, who had surgery on his left foot in November, has begun shooting drills, but has yet to practice. The team doesn't have a definitive timeline for when Love will return, but it's hoped he's back later in the month.\n\nDrew said Love will visit a doctor soon as he continues to rehab his injury.\n\nBIG MARGIN\n\nMiami ended the game with a 47-22 rebounding advantage with Whiteside grabbing a game-high 12.\n\n\"We knew we had to be a little more vigilant, and we have been the last few games,\" Spoelstra said. \"We were able to do that again tonight.\"\n\nTIP-INS\n\nHeat: Richardson has hit multiple 3-pointers in a career-high 12 straight games. He was 4 of 7 against Cleveland. ... Waiters hadn't appeared in a game since Dec. 22, 2017 when he injured his left ankle and had surgery in January of last year. He played for Cleveland from 2012-15.\n\nCavaliers: Thompson missed the last 10 games because of a sore left foot. Hood was out four games because of a sore left Achilles. .... G Patrick McCaw, signed to an offer sheet Dec. 28, scored two points in 18 minutes in his first appearance with Cleveland. He played the last two seasons with Golden State.\n\nUP NEXT\n\nHeat: Host Washington on Friday night.\n\nCavaliers: Host Utah on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBA and https://twitter.com/AP-Sports",
  "source": "espn_api",
  "crawled_at": 1764994781.778561
}