{
  "game_id": "0022200919",
  "espn_id": "401469074",
  "date": "Feb 27, 2023",
  "matchup": "CHA vs. DET",
  "headline": "Ball fractures ankle in Hornets' 117-106 win over Pistons",
  "body": "CHARLOTTE, N.C. -- — LaMelo Ball made six 3-pointers before breaking his right ankle in the third quarter, and the Charlotte Hornets held on to beat the Detroit Pistons 117-106 on Monday night for their fifth straight victory.\n\n\r\n              Terry Rozier scored 22 points, Gordon Hayward had 19 points and rookie Mark Williams added 15 points and 11 rebounds for Charlotte, which is still second-to-last in the Eastern Conference standings — ahead of only Detroit.\n\n\r\n              Ball finished with 18 points on 6-of-7 shooting from 3-point range, his fifth straight game making at least five 3s. He was hurt on a non-contact play in the third, and the Hornets announced after the game that X-rays revealed a fracture to his right ankle.\n\n\r\n              Hayward said Charlotte's players didn't find out about the severity of the injury until after the game, with most of them figuring Ball had just tweaked something.\n\n\r\n              “It's certainly disappointing because he's a major part of our team and we felt like we were rounding the corner,” Hayward said.\n\n\r\n              Ball’s other ankle has been bothersome this season — he’s sprained his left ankle three ties, limiting him to 36 games.\n\n\r\n              This time, he hurt his right ankle as he was he was dribbling and attempting to make a move near half court. Ball fell down, but managed to prevent the ball from going out of bounds. He left the game and did not return.\n\n\r\n              Hornets coach Steve Clifford didn't say how long Ball would be out. Charlotte has 19 games left and isn't in playoff contention, so it would be hard to imagine the team rushing him back.\n\n\r\n              “It’s just a basketball ankle and there is nothing that you can do about that,” Clifford said.\n\n\r\n              Hamidou Diallo scored 23 points, and James Wiseman had his best game since coming to Detroit from Golden State as part of a four-team trade, finishing with 23 points on 9-of-11 shooting. Marvin Bagley added 21 points and 12 rebounds off the bench for Detroit, which has lost five straight.\n\n\r\n              The Pistons trailed by 24 in the second half before cutting the lead to five on a driving left-handed layup by Killian Hayes with five minutes remaining. But Rozier answered with a short jumper and Kelly Oubre Jr. canned a 3-pointer from the corner to push the lead back to double digits.\n\n\r\n              Rozier put the game away when he drove the right side of the lane and scored and drew a foul for a 3-point play, putting the Hornets up 10 with 46 seconds left.\n\n\r\n              Ball had an interesting start to the game.\n\n\r\n              After knocking down an early 3, he turned the ball over on three straight possessions, slapping his hands together in a moment of frustration after the third miscue. But the former All-Star point guard bounced right back, connecting on three 3s on Charlotte's next four possessions to spark a 34-8 run to end the first quarter and give the Hornets a 20-point lead.\n\n\r\n              The Hornets were 7 of 7 from 3-point range in the first quarter and 13 of 26 for the game.\n\n\r\n              The Pistons shot 11.5% (3 of 26) from long range.\n\n\r\n              “We did not have a good shooting night,” Pistons coach Dwane Casey said. “For us to be successful, we’ve got to have a balance between interior scoring and also 3-point shooting, and we did not have that from the outside for whatever reason.”\n\n\r\n              MCGOWENS EXTENDED\n\n\r\n              The Hornets guard Bryce McGowens signed a multi-year contract extension. The 40th overall pick in the 2022 draft has appeared in 26 games this season, averaging 4.1 points and 1.7 rebounds in 14.7 minutes.\n\n\r\n              “It means a lot that the team believes in me, believes in my growth as a person and a player,\" McGowens said. “I’m going to continue to come in day by day and just try to get better, try to learn and try to win some games.”\n\n\r\n              TIP-INS\n\n\r\n              Pistons: Isaiah Livers left the game with a left ankle sprain in the first half and did not return. ... Bojan Bogdonanovic (Achilles tendon) and Jaden Ivey (personal reasons) did not play.\n\n\r\n              Hornets: Played without Cody Martin (knee soreness) and P.J. Washington (foot strain).\n\n\r\n              UP NEXT:\n\n\r\n              Pistons: Host Chicago on Wednesday night.\n\n\r\n              Hornets: Host Phoenix on Wednesday night.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP--Sports",
  "source": "espn_api",
  "crawled_at": 1764994247.0041652
}