{
  "game_id": "0022400649",
  "espn_id": "401705215",
  "date": "Jan 27, 2025",
  "matchup": "CLE vs. DET",
  "headline": "Darius Garland scores 22, Donovan Mitchell 21 as Cavs end mini slide with 110-91 win over Pistons",
  "body": "CLEVELAND -- — Darius Garland scored 22 points, Donovan Mitchell added 21 and the Cleveland Cavaliers snapped a season-high, three-game losing streak with a 110-91 win over the Detroit Pistons on Monday night.\n\n\r\n              Cleveland, which has led the Eastern Conference from the start, ended its mini slump with an 11th straight win over Detroit. The Cavs are 22-3 at home.\n\n\r\n              They also improved to 2-0 against former coach J.B. Bickerstaff, who led Cleveland's rebuild and guided the Cavs into the playoffs the past two seasons. However, Bickerstaff was fired following last year's postseason exit before being hired by the Pistons.\n\n\r\n              Jarrett Allen had 15 points and Evan Mobley 14 rebounds for Cleveland.\n\n\r\n              Cade Cunningham scored 22 points and Malik Beasley 19 for Detroit. Jalen Duren had 12 points and 15 rebounds for the Pistons, who have 23 wins after going 14-68 last season.\n\n\r\n              The Cavs were again without three rotational players, as Caris LeVert (wrist), Isaac Okoro (shoulder) and Dean Wade (knee) sat out with injuries. Coach Kenny Atkinson didn't have a timeline on Wade other than to say it “isn't day to day.”\n\n\r\n              Takeaways\r\n              Pistons: Other than Cunningham and Beasley, Detroit's offense was horrid. Starting forwards Ausar Thompson and Tobias Harris went a combined 1 of 15 from the field.\n\n\r\n              Cavaliers: Cleveland got back to its defensive principles, playing with more intensity and purpose than during the past week's rough patch.\n\n\r\n              Key moment\r\n              Mobley followed his own miss with a rebound on the baseline before whipping a pass through the lane to Mitchell, who knocked down a 3-pointer to put the Cavs up 77-62 and in control in the third.\n\n\r\n              Key stat\r\n              Cleveland came in leading the NBA in 3-point percentage (.398) but had a rough night behind the arc, going just 12 of 44.\n\n\r\n              Up next\r\n              The Pistons visit Indiana on Wednesday. The Cavs are in Miami that night to face the Heat.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/nba",
  "source": "espn_api",
  "crawled_at": 1764998314.472165
}