{
  "game_id": "0021501027",
  "espn_id": "400828914",
  "date": "Mar 18, 2016",
  "matchup": "LAL vs. PHX",
  "headline": "Knight's big stretch drive helps Suns beat Lakers 95-90",
  "body": "LOS ANGELES --  While their fans look at every loss as a possible gain at lottery time, the Phoenix Suns are focused on winning, so perhaps next season they'll be thinking about playoff seeding instead of lottery positioning.\n\nBrandon Knight scored nine of his 22 points in the fourth quarter after the Suns nearly blew a 19-point lead, and they hung on for a 95-90 victory over the Los Angeles Lakers on Friday night.\n\n\"We're not trying to get ping-pong balls. That's not a big deal to us,\" rookie Devin Booker said. \"We're trying to build and get ready for next year. Hopefully the guy we get will be able to come in and work with us. But we're trying to take this thing to the next level and turn it around.\"\n\nKnight, who recorded his first NBA triple-double with a career-high 15 assists against the Lakers in the Suns' 120 -101 win on Nov. 16, finished the game with four free throws, a 3-pointer and a 14-foot running jumper.\n\nBooker had 21 points and seven assists for the Suns in a matchup of teams with second- and third-worst records in the league. The Suns are 19-50, and Lakers 14-55, with the team with the worse record having a better chance of winning the draft lottery.\n\n\"We don't think about that as a team. I mean, we think about not making the playoffs, but the lottery stuff doesn't matter,\" forward P.J. Tucker said. \"We're going to go out there and fight every night, do what we're supposed to do and try to win games.\"\n\nIt the Lakers were coasting for a better spot in the lottery, it didn't show by the way they played down the stretch after missing 10 of their first 11 shots in the game and shooting 28.1 percent through the first three quarters.\n\n\"It doesn't enter my brain whatsoever,\" coach Byron Scott said of the lottery. \"At the end of the day, if they do everything the right way no matter what the circumstances are, then everything will fall in place. I still firmly believe that if you go out there and intentionally try to lose games, that type of karma is going to come back on you. So I'm not going to mess with fate right now.\"\n\nReserve Lou Williams scored 30 points for Los Angeles. Kobe Bryant didn't play again because of his chronically sore right (shooting) shoulder.\n\nThe Lakers have 13 games left in his 20th and final pro season and the NBA's No. 3 career scorer wants to be healthy to play in his scheduled swan song on April 13 at Staples Center -- one of the most coveted tickets in franchise history.\n\nThe Lakers are 6-27 since beating Phoenix 97-77 at Staples Center on Jan. 3 for their season-best third straight victory. That was the night the Suns had their lowest point total ever against their Pacific Division rivals.\n\nIn the rematch, the Lakers' reserves took over in the fourth quarter and reduced the deficit to 84-83 on a 3-pointer by Williams with 3:52 remaining.\n\nRyan Kelly had a chance to put the Lakers ahead for the first time since the opening minutes, but missed both free throws with 1:18 to play. Kelly was called for offensive goaltending 29 seconds later on an attempted tip-in of Larry Nance Jr.'s missed layup on the Lakers' next possession.\n\n\"It was tough, man. They went on their run, finally, and you knew that was going to happen,\" Tucker said. \"But we responded well in that situation, finished the way we needed to finish and got some stops. Fortunately we got a goaltending call and Brandon hit a big shot.\"\n\nThe Suns, who were held under 70 points for only the fourth time in franchise history on Thursday night in their 103-69 loss at Utah, led the Lakers 47-32 at halftime following an 18-4 run capped by Jon Leuer's layup with 3:52 left the second quarter.\n\nTIP-INS\n\nSuns: Interim head coach Earl Watson is one of two former UCLA players to become head coaches in the NBA. The other was Kiki Vandeweghe (Nets, 2009-10). \"I'm learning a lot, which is why we hired Bob Hill,\" said Watson, who is 5-15 since replacing Jeff Hornacek on Feb. 1. \"I want Bob beside me so that he can yell at me and we can debate a lot.\"\n\nLakers: Longtime trainer Gary Vitti, who is retiring at season's end, will be honored by the club on April 3 when the Lakers host Boston. ... Bryant has missed each of the last four meetings with the Suns, including three this season. Bryant has missed 16 of the Lakers' 69 games. They are 4-12 when he's out of the lineup.\n\nUP NEXT\n\nSuns: Host Memphis on Monday.\n\nLakers: Host Memphis on Tuesday",
  "source": "espn_api",
  "crawled_at": 1764994247.293962
}