{
  "game_id": "0022200024",
  "espn_id": "401468179",
  "date": "Oct 21, 2022",
  "matchup": "MEM @ HOU",
  "headline": "Ja Morant scores 49 points, Grizzlies beat Rockets 129-122",
  "body": "HOUSTON -- — Ja Morant scored 49 points and hit five 3-pointers to lead the Memphis Grizzlies to a 129-122 victory over the Houston Rockets on Friday night. \n\n\r\n              Morant carried the team on a night Desmond Bane and Tyus Jones struggled. Bane made just 3 of 16 shots for 14 points and Jones was 4 for 13 with 11 points. \n\n\r\n              The Rockets led by 16 in the first half before the Grizzlies used a big run to start the third quarter and take the lead. \n\n\r\n              Morant has eight 3-pointers in just two games this season after averaging 1.5 3s a game last season. Memphis coach Taylor Jenkins was asked if anyone can stop the young star now that he's incorporated more 3-point shooting into his game. \n\n\r\n              “I don’t think so,” he said. “What a phenomenal game by Ja. Just in attack mode throughout the game.” \n\n\r\n              Houston coach Stephen Silas agreed.\n\n\r\n              “It’s changes everything because he’s downhill,” Silas said. “You have to honor the 3. When he’s making his 3-point shot he’s very, very hard to guard.” \n\n\r\n              A basket by Brandon Clarke put Memphis up by two points before Garrison Mathews and Jabari Smith Jr. made back-to-back 3-pointers to put Houston up 108-104 with about nine minutes to play. \n\n\r\n              Morant scored five points in a 10-0 spurt that gave Memphis a 118-110 lead with six minutes left. \n\n\r\n              Houston made five points with a 3-pointer from Eric Gordon to get within five points with about two minutes to go. But Morant made a jump shot a few seconds later to extend the lead to 125-118. \n\n\r\n              Jalen Green, the second pick in the 2021 draft, led the Rockets with 33 points. But he struggled after halftime and scored just 13 points in the second half. Alperen Sengun added 23 points for the Rockets, who fell to 0-2 this season.\n\n\r\n              Morant had another great game after scoring 34 points in the opener to lead Memphis to a 115-112 overtime victory over the Knicks. \n\n\r\n              He made his first five 3-point attempts and didn’t miss until he threw up a shot late in the fourth quarter to avoid a shot- clock violation. \n\n\r\n              He talked about why he's off to such a strong start on long-range shooting this season. \n\n\r\n              “Work,” he said. “Locking myself in the gym. Just getting as many shots up as I can. I’ve got to keep it going, continue to work even though my shots are falling now.” \n\n\r\n              Houston led by eight at halftime before the Grizzlies opened the second half with an 18-9 run to take an 80-79 lead with about eight minutes remaining in the third quarter.\n\n\r\n              Morant had nine points in that span and Bane capped it with a 3-pointer. \n\n\r\n              The Grizzlies remained up by one a couple of minutes later after a dunk by Morant before Green made a 3-pointer to put Houston on top 87-85. \n\n\r\n              Houston trailed by 3 later in the third before scoring the last eight points of the quarter, with a 3-point play by Tari Eason, to take a 100-95 lead into the fourth. \n\n\r\n              TIP-INS\n\n\r\n              Grizzlies: Memphis made 19 of 42 3-pointers. … Bane had seven assists and six rebounds. … John Konchar had 17 points and made three 3-pointers.\n\n\r\n              Rockets: Smith, the third overall pick in this year’s draft, had 10 points after scoring 17 in his NBA debut Wednesday. … Kevin Porter Jr. scored 18. … Bruno Fernando left the game in the fourth quarter with left knee soreness.\n\n\r\n              ODDS AND ENDS\n\n\r\n              Memphis has won four of its last five in Houston after losing the previous four. ... This is the second consecutive season the Grizzlies have started 2-0 after opening a season with two wins just twice from the 2001-02 season to the 2019-20 season. ... Memphis has so 35 straight games when scoring 120 points or more. \n\n\r\n              UP NEXT \n\n\r\n              Grizzlies: At Dallas on Saturday night.\n\n\r\n              Rockets: At Milwaukee on Saturday night.\n\n\r\n              ------",
  "source": "espn_api",
  "crawled_at": 1764994529.978276
}