{
  "game_id": "0021500272",
  "espn_id": "400828159",
  "date": "Dec 02, 2015",
  "matchup": "TOR @ ATL",
  "headline": "Lowry sizzles in 4th, Raptors rally from 17 down to win",
  "body": "ATLANTA -- Kyle Lowry wasn't feeling well, so he wanted to save his energy for the fourth quarter.\nWhen the time came for Lowry to push himself to another level, Atlanta's defense looked helpless.\n\"I just attacked early and tried to get to the basket early,\" he said. \"They're not really big-time shot-blockers, and I just wanted to attack the basket.\"\nLowry scored 22 of his season-high 31 points in the fourth, DeMar DeRozan added 17 points and the Toronto Raptors rallied from 17 down in the third to beat the Atlanta Hawks 96-86 on Wednesday night.\nLowry overcame flu-like symptoms that forced him from the game in the second period. He returned to begin the third, but didn't build momentum until the fourth when Toronto outscored the Hawks 39-20.\n\"It's a basketball game,\" Lowry said. \"You've got two halves, and my teammates always count on me, so I went out and left it all out on the floor tonight.\"\nThe Raptors, who have won five of six, scored just 32 points in the first half. A team official said they set a franchise record for points in a quarter in the fourth.\nAtlanta led by 17 midway through the third before the Raptors went on a 33-15 run to go up 74-73 on Lowry's fast-break layup with 6:28 remaining. It was Toronto's first lead since late in the first.\nPaul Millsap scored 14 points and Thabo Sefolosha had 13 for the Hawks. They have dropped three of five and lost for the first time in 36 home games when leading to begin the fourth.\n\"It's just unacceptable on our part,\" Hawks center Al Horford said. \"We just relaxed in the second half as a team, especially in the fourth quarter. It's just disappointing.\"\nLowry was too quick off the dribble, running circles around Atlanta's defense go to 7 for 8 from the field on a variety of shots.\nHis 3-pointer made it 80-75 and Lowry followed with a fast-break layup that made it 82-75 with 4:54 remaining.\n\"I told him, `Win the game for us,' \" DeRozan said. \"That's what he did.\"\n---\nTIP-INS\nRaptors: Toronto missed 16 of its first 18 attempts on 3s before Terrence Ross hit one in the close seconds of the third to cut the lead to seven. ... Reserve big men Patrick Patterson and Lucas Nogueira combined for 11 rebounds in the final period.\nHawks: Horford scored 12 points to extend his streak of double-digit games to 21, tying a career high. ... Atlanta's point total was a season low.\nGOOD TO SEE YOU\nHawks coach Mike Budenholzer gave Raptors guard DeMarre Carroll a hug before the game. Carroll, who finished with five points, had the best two seasons of his six-year career under Budenholzer, becoming a full-time starter and helping the Hawks advance to the Eastern Conference finals for the first time. Atlanta wanted to keep Carroll, who signed a four-year, $60 million contract with Toronto, but needed to save money to re-sign Millsap.\nNOT YET, YOUNG MAN\nBefore the start of the third, Teague came over to joke with Hawks great Dominique Wilkins that he was about to pass him for seventh place on the franchise list for career assists. Wilkins, the team's TV analyst, laughed. \"Not tonight,\" Wilkins said. \"Next game.\" Teague needs five to pass Wilkins at 2,321.\nUP NEXT\nRaptors: Host Denver on Thursday night.\nHawks: Host Los Angeles Lakers on Friday night.",
  "source": "espn_api",
  "crawled_at": 1764994756.076143
}