{
  "game_id": "401810178",
  "espn_id": "401810178",
  "date": "Dec 02, 2025",
  "matchup": "GS vs OKC",
  "headline": "Shai Gilgeous-Alexander scores 38 points as defending champion Thunder hold off Warriors 124-112",
  "body": "SAN FRANCISCO -- — Shai Gilgeous-Alexander scored 38 points and made a key 3-pointer with 3:34 left, Jalen Williams added 22 points and six assists, and the Oklahoma City Thunder held off the determined Golden State Warriors 124-112 on Tuesday night.\n\n\r\n              Chet Holmgren hit a go-ahead 3 from the top with 6:02 remaining and finished with 21 points and eight rebounds for the defending champions.\n\n\r\n              Brandin Podziemski scored 17 points and Seth Curry added 14 in his Warriors debut with older brother Stephen Curry sidelined for a second straight game because a bruised left quadriceps and muscle strain sustained last Wednesday against Houston. \n\n\r\n              Pat Spencer’s putback with 2:26 left in the third got Golden State to 81-79 then his 3 the next time down made it a one-point game — and he matched his career high with 17 points to go with six assists. Podziemski’s buzzer-beating 3 at the end of the third pulled the Warriors within 91-88.\n\n\r\n              Jimmy Butler didn't play the second half for Golden State because of a sore left knee. He started despite being questionable because of a bruised left glute muscle after a hard fall in Saturday’s win against the Pelicans. He then cut awkwardly under the basket and lost his left shoe midway through the second quarter, limping afterward.\n\n\r\n              Gilgeous-Alexander, averaging 32.5 points, scored nine over the final 1:16 of the second quarter to put Oklahoma City ahead 63-44 at halftime. The Thunder (21-1) handed the Warriors just their third home defeat.\n\n\r\n              Seth Curry received a warm ovation when he checked in for the closing moments of the first quarter after re-signing with the team Monday. He was with Golden State for training camp then waived for financial reasons with the plan to bring him back. \n\n\r\n              There were more cheers when he made a jumper at the 8:24 mark of the second quarter for his first points.\n\n\r\n              Gary Payton II had 13 points, five rebounds and five assists for Golden State while Draymond Green and Buddy Hield also scored 13.\n\n\r\n              Up next\r\n              Thunder: Host Dallas on Friday night.\n\n\r\n              Warriors: Begin a three-game road trip Thursday at Philadelphia.\n\n\r\n              ------\n\n\r\n              AP NBA: https://apnews.com/hub/NBA",
  "source": "espn_direct_latest",
  "crawled_at": 1765042740.015758
}