{
  "game_id": "0021400890",
  "espn_id": "400579182",
  "date": "Mar 03, 2015",
  "matchup": "LAL @ CHA",
  "headline": "Jefferson, Williams lead Hornets past Lakers 104-103",
  "cleaned_body": "CHARLOTTE, N.C. --  Al Jefferson was thrilled when the Charlotte Hornets traded for Mo Williams -- and not only because they're best friends.\n\nJefferson said Williams' outside shooting and passing ability has helped make his job a little easier in the low post.\n\n\"That's one of the things I love about him being here,\" Jefferson said of Williams, who he got to know growing up in Mississippi. \"When the game gets tight, people are going to double me. When you have a chance to kick it out to a knockdown shooter, it takes the pressure off me.\"\n\nJefferson had 21 points and 16 rebounds, Williams added 20 points and 13 assists, and the Hornets beat the Los Angeles Lakers 104-103 on Tuesday night for their third win in four games.\n\nWilliams has been stellar since being acquired from Minnesota, averaging 22.8 points and eight assists per game in place of the injured Kemba Walker.\n\n\"I've played with him before and we already had a good understanding of each other,\" Williams said of playing with Jefferson. \"So I know how to make an easy pass for him.\"\n\nWilliams' scoring -- he has at least 17 points in all six games -- has been an added bonus for the Hornets, who are 3-3 since the All-Star break.\n\nHe knocked down a big 3-pointer with a minute to play to push the lead to six and added five free throws in the final 18 seconds to seal the win.\n\nGerald Henderson had 21 points, including several key baskets late in the fourth quarter as all five starters finished in double figures.\n\nJeremy Lin led the Lakers with 23 points off the bench, while Jordan Clarkson had 19.\n\nThe Hornets took the lead for good with 4:44 left when Henderson connected on a 3-pointer from the right wing on an assist from Williams for an 89-86 lead. Henderson pushed the lead to five a minutes later when he made a 17-footer off yet another feed from Williams.\n\nAfter the Lakers cut the lead to 95-92, Williams hit a 3-pointer from the top of the key. Williams made the second of two free throws with 3.4 seconds left to push the lead to four before Lin added a meaningless 3-pointer at the buzzer.\n\nHornets coach Steve Clifford said the plan when Walker returns later this month from knee surgery is to play both point guards at certain points of the game.\n\n\"I think Kemba playing with Mo can help our offense,\" Clifford said. \"But it's going to be defense, rebound, grind-it-out and don't turn the ball over.\"\n\nThe Hornets won despite shooting 21 of 31 from the free-throw line. Williams was 8 of 9 from the stripe.\n\nThe Lakers have lost two in a row coming off a season-high three-game winning streak.\n\nThe Lakers were a combined 12 of 40 from the field in the second and third quarters but managed to stay close behind some key baskets by Lin, who has stepped up his game since the All-Star break.\n\nHowever, the first five minutes of the third quarter again proved problematic for the Lakers.\n\nThe Hornets went on a 16-5 run to open the third quarter after the game was tied at 50 at halftime.\n\n\"We come out lackadaisical and the other team comes out with more aggressiveness,\" Scott said. \"It takes us three, four or five minutes to get back into it. And we don't have that room for error. We have to come out like we are down 15 or 20 points.\"\n\n---\n\nTIP-INS\n\nLakers: Nick Young missed another game with a sore left knee. Young is one of five Lakers who didn't play. Kobe Bryant remains out with a torn rotator cuff, along with Steve Nash (sciatic pain), Julius Randle (fractured tibia) and Ronnie Price (elbow).\n\nHornets: Rookie P.J. Hairston was inactive for the Hornets again and has fallen behind Jeffery Taylor and Troy Daniels on the team's depth chart, according to coach Steve Clifford.\n\nMASON HONORED\n\nThe Hornets honored Anthony Mason with a moment of silence before the game. Mason, who passed away over weekend, played for the Hornets from 1996-2000 and was a popular figure in the organization.\n\nMOVING THE BALL\n\nThe Hornets continue to move the ball well with Williams in the lineup, piling up 30 assists on the night.\n\nUP NEXT\n\nLakers: At Miami on Wednesday night.\n\nHornets: At Brooklyn on Wednesday night.",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.683207",
  "pipeline_version": "v1"
}