{
  "game_id": "0021401206",
  "espn_id": "400579498",
  "date": "Apr 13, 2015",
  "matchup": "CHI @ BKN",
  "headline": "Bulls rout Nets, clinch home-court advantage in 1st round",
  "cleaned_body": "NEW YORK -- Derrick Rose wasn't even aware the Chicago Bulls had clinched home-court advantage in the first round of the playoffs.\n\"I don't care who we play, where at, whenever,\" Rose said. \"I'm just happy to be playing.\"\nAnd the Bulls are thrilled to have him back.\nChicago clinched at least the fourth-best record in the Eastern Conference with a 113-86 victory over the Brooklyn Nets on Monday night, a victory so complete that Rose couldn't even get back on the floor in the fourth quarter.\n\nRookie Nikola Mirotic scored 26 points and Pau Gasol had 22 points and 11 rebounds. Jimmy Butler shot 7 for 10 and scored 17 points for the Bulls, who moved a half-game ahead of Toronto into sole possession of third place in the East.\nRose had 13 points and seven assists but only played 23 minutes because the Bulls were already too far ahead by the time he would've gone back for his last stint.\nThat was enough time for coach Tom Thibodeau to say his point guard played \"real well\" in his fourth game back from his latest knee surgery.\n\"Because I think the real function of the point guard is how the team plays,\" Thibodeau said.\nThe Nets fell into ninth place in the East and will need a win Wednesday and a loss by Indiana in at least one of its final two games to reach the postseason.\n\"The way I look at is that we have one more game left. We have to win it,\" coach Lionel Hollins said.\n\"I know we're going to be written off tomorrow in the paper, but that is your job,\" he added in his postgame press conference. \"Do what you want to do, but we'll be here on Wednesday and try to close out the season with a victory and see what happens.\"\nWith the Bulls leading by 15 late in the third, Mirotic made a 3-pointer, then after two free throws by Joe Johnson, knocked down two more in a row with the crowd -- filled with plenty of Bulls fans -- cheering louder with each one in a scene reminiscent of Stephen Curry's late comeback attempt in Golden State's loss here.\nMirotic tried for four in a row, but his shot at the third-quarter buzzer was off the mark. No matter, as the Bulls were already ahead 87-65.\nHe finished with six 3-pointers, proving why his teammates don't want him to hesitate.\n\"I made the first one, second one I was like, `OK, there you go, so keep shooting,\" Mirotic said.\nThe Nets dropped their second in a row after a late-season surge had moved them up to seventh in the East. They close the regular season at home against Orlando.\nBojan Bogdanovic led the Nets with 17 points. Brooklyn shot 37 percent, with Deron Williams going 3 for 13.\nRose had 22 points, eight assists and six rebounds Saturday in a victory over Philadelphia. He looked good again, making two straight 3-pointers in the second quarter -- credited with the second one after a video review -- as Chicago opened a 14-point lead. The Nets cut it in half and trailed 57-50 at halftime.\nRose walked toward the scorer's table with about 4 1/2 minutes left, but after a chat with Thibodeau returned to the bench.\nTaj Gibson finished with 15 points and nine rebounds in place of starting center Joakim Noah, who was removed from the lineup shortly before the game with what the Bulls said was left hamstring tendinitis.\nTIP-INS\nBulls: Thibodeau said he expected to go with a nine-man rotation in the playoffs, with Kirk Hinrich and Tony Snell getting the last guard spot depending on situation. Hinrich sat out Monday with an injured left knee. ... The Bulls finished 16-2 against the Atlantic Division.\nNets: The Nets fell to 18-22 at Barclays Center, their first losing record at home since moving to Brooklyn in 2012. ... New St. John's coach Chris Mullin attended the game. The Hall of Famer grew up in Brooklyn.\nRESTING ROSE\nThibodeau, on his fourth-quarter conversation with Rose before the former MVP returned to the bench: \"He had a couple of suggestions,\" Thibodeau joked. Rose said he would get extra work Tuesday to make up for the time he was supposed to get.\nUP NEXT\nBulls: Host Atlanta on Wednesday.\nNets: Host Orlando on Wednesday.",
  "tags_rule": [
    "MomentumShift",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.327196",
  "pipeline_version": "v1"
}