{
  "game_id": "0021700316",
  "espn_id": "400975067",
  "date": "Nov 30, 2017",
  "matchup": "MIL @ POR",
  "headline": "Middleton has 26 and Milwaukee beats the Blazers 103-91",
  "cleaned_body": "PORTLAND, Ore. --  The Bucks tried to take 3-pointers away and contest every shot, a tactic that worked well against Portland.\n\nKhris Middleton had 26 points, Eric Bledsoe had 25 and Milwaukee beat the Trail Blazers 103-91 on Thursday night to snap Portland's three-game winning streak.\n\nGiannis Antetokounmpo added 20 points, nine rebounds and three blocked shots for the Bucks, who have won their last four games against the Blazers.\n\n\"I think it was our defense,\" Middleton said. \"(CJ) McCollum and Dame (Lillard), those are two dynamic scorers, especially from the 3-point line. We did a great job of keeping them off the line.\"\n\nThe Bucks led by 24 points in the third quarter and the Blazers struggled to keep up. Portland was also vexed by turnovers, with 19.\n\nJusuf Nurkic led Portland with 25 points and 11 rebounds, while Damian Lillard added 18 points.\n\nLillard's layup closed Portland within 94-81 with 5:52 left, and it appeared the Blazers may rally, but Middleton answered with an 11-foot jumper. Portland's frustration was clear when Nurkic and coach Terry Stotts both earned technicals for a foul call on Nurkic on a block.\n\n\"Tough game,\" Lillard said. \"They played physical, they played aggressive defensively. We know they like to load up and use their length, and they were allowed to play that way. So it is what it is.\"\n\nPortland was coming off a 4-1 trip, including a 103-91 victory over the Knicks on Monday. The Blazers also saw the return of forward Al-Farouq Aminu, who missed 13 games with a right ankle injury.\n\nBut they struggled with the Bucks from the start.\n\nMiddleton hit a 3-pointer at the buzzer to give the Bucks a 33-21 lead at the end of the first quarter. Portland went on a 10-2 run to close within 35-31, but Middleton slowed the rally with a long jumper.\n\nJohn Henson's short jumper put the Bucks up 46-33 as the Trail Blazers struggled to find much offensive flow. Lillard went up for a layup to end the half, and he was blocked by Antetokounmpo.\n\nMilwaukee led 60-45 at the break, propelled by Bledsoe with 17 points. Bledsoe's jumper stretched the lead to 69-49 in the third quarter.\n\nBledsoe's layup made it 83-59, and boos could be heard among the hometown fans.\n\nHenson had 13 points and 10 rebounds for the Bucks, who withstood any efforts by the Blazers to rally.\n\n\"They've grown a lot, understand how to finish a game,\" coach Jason Kidd said. \"It is hard to keep a big lead. You have the tendency to relax. I thought the team did a good job both offensively and defensively. It's hard to win here.\"\n\nTIP-INS\n\nBucks: Milwaukee guard Gary Payton II went to Oregon State, following in the footsteps of his famous father. The crowd at the Moda Center greeted him with a warm applause when he came in the game late. ... Thon Maker was given a flagrant foul for elbowing Nurkic in the face in the first quarter.\n\nTrail Blazers: With Aminu's return, rookie Caleb Swanigan went to the inactive list for the game. ... Portland wore new all-red \"Statement\" uniforms for the first time. The jerseys featured a black diagonal stripe.\n\nTRIBUTE\n\nPortland played a video tribute to former Blazer Steve \"Snapper\" Jones, who died this past weekend in Houston after a lengthy illness. Jones was a three-time All-Star in eight ABA seasons and played his lone NBA season with the Blazers in 1975-76 before a lengthy career in broadcasting. He was 75.\n\nLETDOWN\n\n\"Typically this is the way it goes,\" Lillard said. \"You have a good road trip and then the first game back home, it's a setup for a letdown. We talked about that before the game, we wanted to come out and I guess play above that. And they came in ready. They played a good game.\"\n\nUP NEXT\n\nThe Bucks return home to host the Kings on Saturday night.\n\nThe Trail Blazers host the Pelicans on Saturday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "MomentumShift",
    "Streak",
    "CoachComment",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.194952",
  "pipeline_version": "v1"
}