{
  "game_id": "0021701149",
  "espn_id": "400975895",
  "date": "Apr 01, 2018",
  "matchup": "CLE vs. DAL",
  "headline": "LeBron, Cavs struggle before beating Mavericks 98-87",
  "cleaned_body": "CLEVELAND --  LeBron James couldn't get his shot to drop. However, he wouldn't let the Cavaliers fall.\n\nJames struggled before extending his record double-digit scoring streak to 868 games and Cleveland had a rough time with Dallas before putting away the lottery-bound Mavericks 98-87 on Sunday night.\n\nJames, who broke Michael Jordan's NBA mark for consecutive games with at least 10 points on Friday night, didn't reach 10 until 7:59 remained. He finished just 5 of 21 from the field but found his range when it counted most, draining a pair of 3-pointers during a 15-2 run in the fourth quarter when the Cavs finally finished off the Mavericks.\n\n\"It wasn't a typical LeBron game,\" said interim head coach Larry Drew, who is filling in for Tyronn Lue. \"But we were still able to come out with a win. When the game was on the line, he put it on his shoulders once again.\"\n\nAnd although his shot was off, James finished with 16 points, 13 rebounds and 12 assists, his 17th triple-double this season and No. 72 of his career.\n\n\"I missed four, five, maybe six layups, which I'm not accustomed to doing,\" James said. \"But me not shooting the ball well never stopped me making an impact on the game. So if I'm not shooting well, I gotta make sure I get my guys on time, on target with my passes and I gotta rebound and I gotta do other things to help us win and I was able to do that.\"\n\nCleveland, which has withstood numerous injuries all season, has won eight of nine and is 17-8 since Feb. 7. With the win, the Cavs held onto the No. 3 spot in the Eastern Conference with five regular-season games left.\n\nHarrison Barnes scored 30 points to lead Dallas, which has dropped eight of nine. Dirk Nowitzki scored nine in possibly the 39-year-old's final career game in Cleveland.\n\nThe Cavs were in danger of sliding into fifth place behind Philadelphia and Indiana before waking up in the fourth quarter. They trailed 81-79 before going on an 11-0 run that was capped by a 3 from James, who spent part of Saturday night on stage with pop superstar Justin Timberlake.\n\n\"We tried to make it tough on him, but obviously he's one of the best players in the game, if not the best player in the game,\" Nowitzki said. \"You look up and he's got a triple-double. He's affecting the game even though he wasn't shooting the ball really well. He can drive. He can dish it.\"\n\nTIP-INS\n\nMavericks: Nowitzki was questionable with an ankle issue but started his 76th game this season, a credit to his durability and dedication. \"He's another guy that's just so extremely meticulous with his approach,\" coach Rick Carlisle said. \"He changed his diet about 12 years ago or 13 years ago and went to very specific kinds of foods. Drinking a lot of water. There's a level of consistency there that is amazing.\" ... Signed G Aaron Harrison for the remainder of the season. He originally signed a 10-day contract on March 22.\n\nCavaliers: F Kyle Korver remains sidelined with a sore right foot. Korver recently rejoined the team after attending his younger brother's funeral, but he's still not completely healthy and the Cavs want him as close to 100 percent as possible for the playoffs. ... F Kevin Love finished with 13 points and 13 rebounds, his 400th career double-double.\n\nAWKWARD MOMENT\n\nFans booed when the Cavs ran out the clock with 98 points. When they score 100, everyone in attendance get McDonald's chicken nuggets.\n\n\"We were laughing about that because they were a little upset,\" Love said. \"We couldn't make it a happy Easter, just Easter. Sorry, we didn't get nuggets. Go home and eat.\"\n\nHEY COACH\n\nLue was in the locker room following the game and was in good spirts while speaking with players and reporters. There is still no firm timetable on his return. The 40-year-old announced he was stepping away to address his health on March 19.\n\nDIRK & LEBRON\n\nNowitzki and James are ranked sixth and seventh, respectively, on the NBA's career scoring list. And while they're among the greatest players of this generation, Carlisle says they resemble players of yesteryear.\n\n\"The thing you love to see is a guy like LeBron James and a guy like Dirk that are new-age athletes from the standpoint of just an amazing level of skill, commitment, all kind of stuff, but old school in their approach and particularly old school in their appreciation for the Oscars and the Russells and the Chamberlains and the Wests and those kind of guys. That's extremely special.\"\n\nUP  NEXT\n\nMavericks: Host Portland on Tuesday.\n\nCavaliers: Host Toronto on Tuesday.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "TripleDouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.261295",
  "pipeline_version": "v1"
}