{
  "game_id": "0021701143",
  "espn_id": "400975889",
  "date": "Apr 01, 2018",
  "matchup": "CHA vs. PHI",
  "headline": "Simmons' 20 points, 15 assists, Sixers beat Hornets 119-102",
  "cleaned_body": "CHARLOTTE, N.C. --  This pass-happy approach is paying off for the Philadelphia 76ers.\n\nBen Simmons and the Sixers posted their 10th straight victory for their longest winning string since 2003, beating the Charlotte Hornets 119-102 Sunday.\n\nPlaying without injured star Joel Embiid, the Sixers kept sharing the ball. Simmons led the way with 20 points and 15 assists.\n\nThe Sixers set a team record with their ninth straight game of 30 or more assists -- they had 36 on their 48 baskets.\n\n\"We're having fun on the court and that's really important for us,\" said reserve guard Marco Belinelli, who led Philadelphia with 22 points on 9-for-10 shooting. \"For sure, we miss Joel out there on defense. But we know that everybody needs to step up and be aggressive on offense and defense and just play together.\"\n\nEmbiid suffered an orbital fracture of his left eye last week and underwent surgery on Saturday. His projected return is as soon as two weeks, right about the time the Sixers would open the playoffs.\n\n\"You're in the NBA current that pulls you along in good ways and sometimes it can suck you out to sea,\" said Philadelphia coach Brett Brown, whose team remained in fourth place of a tight Eastern Conference race. \"It's a violent thing you go through and it's just never-ending. We're in a good current right now. So that moves us along. We want more and we know we always have to play better defense and bide time without Joel.\"\n\n\"We owe it to him to do whatever we can to let him play with his team -- our team -- wherever we can. And we see the path to doing that is fighting like heck to get a home-court advantage. We feel like we can control our own destiny if we're able to do that, which allows us to give ourselves a chance to re-introduce him to the team,\" he said.\n\nJ.J. Redick had 20 points for Philadelphia. Robert Covington added 17 points and 11 rebounds.\n\nAfter falling behind 33-28 early in the second quarter, the 76ers went on a 13-1 surge to go ahead with 6:53 left in the opening half.\n\nThe Sixers led 68-55 early in the second half. After the Hornets went on a 16-3 surge to get within 72-71 midway through the third quarter, the 76ers scored 14 straight points to pull away.\n\n\"I think the runs they had the whole game were really fueled by turnovers,\" said Charlotte coach Steve Clifford, whose team committed 16 turnovers that led to 19 Philadelphia points. \"They create offense with their defense.\"\n\nCharlotte was led by Malik Monk and Michael Kidd-Gilchrist with 16 points apiece. Willy Hernangomez added 15 points and 11 rebounds.\n\n\"I think it was too many mistakes,\" Hernangomez said. \"We turned the ball over a lot -- and that's where they live.\"\n\nDOUBLE-DOUBLE\n\nDwight Howard played only 26 minutes for the Hornets, but had 10 points and 10 rebounds for his 13th straight double-double and 49th overall this season. Howard began the day ranked fourth in the NBA in the statistic, with only Karl-Anthony Towns (64), Andre Drummond (58) and Russell Westbrook (54) having record more.\n\nTIP-INS\n\n76ers: Brown certainly has had to deal with Embiid being out of his lineup before, but offered great sympathy for the most recent injury (orbital fracture) that will keep him for the rest of the regular season. \"For him to continue to have setbacks, you feel for him,\" Brown said of Embiid, a 2014 first-round pick who missed the entire 2014-15 and 2015-16 seasons, 51 games in the 2016-17 season and will miss 19 games this season.\n\nHornets: Cody Zeller's sore left knee kept him out of a fourth straight game Clifford thinks the 7-foot center may not play again this season. \"I would say we're at the stage now where it almost becomes, `Why?\" Clifford said of Zeller, who has missed 40 games this season with right and left knee injuries.\n\nUP NEXT\n\n76ers: Host Nets on Tuesday night.\n\nHornets: Visit Bulls on Tuesday night.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.157814",
  "pipeline_version": "v1"
}