{
  "game_id": "0021400745",
  "espn_id": "400579037",
  "date": "Feb 05, 2015",
  "matchup": "POR vs. PHX",
  "headline": "LaMarcus Aldridge notches record 220th double-double in win",
  "cleaned_body": "PORTLAND, Ore. -- As LaMarcus Aldridge has grown older and stronger, rebounding has come easier for him. His teammates have something to do with that, too.\nThe four-time All-Star had 19 points and 13 rebounds for his team-record 220th double-double, and the Portland Trail Blazers beat the Phoenix Suns 108-87 on Thursday night.\nAldridge said early in his career, former Blazers coach Nate McMillan used him as a big man who could switch and guard pick-and-rolls.\n\"I think now our defense is better. I'm at the rim more, I'm in the paint more, so I think it's just a mindset of knowing, I'm in the paint, so go and get it,\" Aldridge said.\nNicolas Batum added 20 points and Robin Lopez, playing his second game after missing 23 with a broken right hand, had 11 points and 12 rebounds for the Blazers, who won their second straight after a three-game skid.\n\"It was a big win for us,\" Portland guard Damian Lillard said. \"They've given us a lot of trouble in the last two or three years. We came out tonight and took the challenge defensively. We really got after them on the defensive end of the floor.\"\nMarkieff Morris had 18 points for the Suns, who dropped their third in a row. Phoenix climbed back into the game in the third period after trailing by 19 in the first half, but ultimately the Blazers thwarted the rally with a dominant fourth quarter.\nPortland opened the fourth with a 9-2 run to go up 75-67. Batum's 3-pointer stretched the lead to 86-75 with 6:03 left.\nPortland went 6-9 in January after ascending to the top spot in the Western Conference standings earlier this season. Before a 103-102 victory Tuesday night over the Jazz, the Blazers had lost five of six.\nThe Suns were one of the teams that beat the Blazers last month, 118-113 in Phoenix on Jan. 21.\nBut the Suns are struggling on the road, with six straight losses, and they were coming off a 102-101 loss at home to Memphis on Monday.\n\"It was just one of those games,\" Morris said. \"We came out real sluggish and lackadaisical and they got out to a good lead on us.\"\nThe Blazers jumped out to a 25-13 advantage on Wesley Matthews' 3-pointer. Portland got a spark off the bench from C.J. McCollum, who had 12 points.\nThe Suns struggled with turnovers, committing eight in the first quarter alone, and trailed 46-35 at halftime. The first-half point total was a season low for Phoenix.\nThe Suns closed the gap to 52-46, but there was a scary moment when Alex Len crashed into the base of the basket and appeared to injure his right ankle. He was able to walk off the court, but did not play in the fourth quarter. X-rays were negative.\nAfter the game, the team said Len had a sprain, but he left the Moda Center on crutches. Suns coach Jeff Hornacek expressed concern.\n\"He'll get treatment on it,\" Hornacek said. \"I don't know how long he'll be out. I'm guessing he'll be out through the (All-Star) break to give him the extra rest, but I think we'll know more tomorrow.\"\nMorris' 3-pointer and a free throw from Miles Plumlee pulled the Suns to 54-53 midway through the third quarter.\nThe Suns briefly took a 63-62 lead after Eric Bledsoe's layup with 1:20 left in the third quarter, but Batum answered with a 3 on the other end.\n\"It was an ugly game to watch, but I thought it was good on the court for us, our competitiveness,\" Aldridge said.\nTIP-INS\nSuns: Phoenix assigned T.J. Warren and Tyler Ennis to its D-League affiliate Bakersfield on Wednesday. ... The loss snapped a three-game winning streak over the Blazers.\nTrail Blazers: Matthews will compete in the 3-point contest at the All-Star Game. He went into Thursday with an NBA-leading 151 3-pointers this season. ... It was Aldridge's 25th double-double of the season. ... Aldridge surpassed Sidney Wicks, who had 219 double-doubles for Portland.\n`SHEED RETURNS\nEx-Blazer Rasheed Wallace was at the game and the crowd chanted his name after he was shown on the video scoreboard. Afterward, Aldridge came close to using Wallace's classic quote: \"Both teams played hard.\"\n\"I think both teams played well, not the cliched line, but I thought both teams played defense well,\" Aldridge said, before he was chided for not mimicking Wallace.\nUP NEXT\nThe Suns host Utah on Friday night.\nThe Trail Blazers visit Dallas on Saturday.",
  "tags_rule": [
    "DoubleDouble",
    "Streak",
    "EarlyRun",
    "MomentumShift"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.512056",
  "pipeline_version": "v1"
}