{
  "game_id": "0021701127",
  "espn_id": "400975873",
  "date": "Mar 29, 2018",
  "matchup": "SAC vs. IND",
  "headline": "Oladipo comes through late to lift Pacers past Kings 106-103",
  "cleaned_body": "SACRAMENTO, Calif. --  Victor Oladipo got the Pacers off to a quick start, then picked up the pace again in the fourth quarter after Indiana's offense went into a brief funk.\n\nWith that, Nate McMillan's team picked up another win on the road and stayed in the hunt for home-court advantage in the first round of the playoffs.\n\nOladipo made his first five shots before scoring 13 of his 24 points in the fourth quarter, including a pair of free throws with 2.5 seconds remaining, and the Pacers held on to beat the Sacramento Kings 106-103 on Thursday night.\n\n\"I just got in my spots and I was effective. That was it,\" Oladipo said. \"I was worried about just being aggressive, getting to my spots and making the right play.\"\n\nBojan Bogdanovic had 25 points, Thaddeus Young added 18 points and eight rebounds, and Darren Collison finished with eight points and nine assists against his former team to help the Pacers extend their winning streak to four.\n\nIndiana remained percentage points behind fourth-place Philadelphia in the East.\n\n\"This is Victor's first time really being in this position where he's leading a team and the ball is in his hands late and his team is having success,\" McMillan said. \"He's doing a good job of when he has single coverage taking shots and making shots, and when teams are double-teaming, getting the ball out and trusting (his teammates).\"\n\nCyclone fences were erected around Golden1 Center and extra members of law enforcement in riot gear were lined up outside the arena in anticipation of a possible third day of protests over the fatal police shooting of Stephon Adams, an unarmed 22-year-old African-American who was shot in his grandparents' backyard on March 18 as police searched for a person suspected of attempting to break into several homes.\n\nA funeral for Clark was held early Thursday afternoon and protestors held marches near the district attorney's office but did not make it to Golden1 Center. That was in contrast from previous marches when demonstrators surrounded the arena and prevented fans from getting inside.\n\nThe Pacers led 99-91 with 3 minutes left following a 12-5 run. Oladipo had eight points during the surge, including a pair of three-point plays.\n\nAfter Buddy Hield scored seven consecutive points, Bogdanovic sank a pair two free throws for Indiana before Sacramento's Bogdan Bogdanovic -- no relation to the Pacers player -- hit a 3-pointer with 3.4 seconds left to pull the Kings within 104-103.\n\nOladipo, who struggled from the perimeter, then made his shots from the line.\n\n\"Sacramento was hitting big shot after big shot it seemed,\" Oladipo said. \"We did a great job of just being poised and getting a win.\"\n\nWillie Cauley-Stein had 19 points and seven rebounds for the Kings. Bogdanovic scored 21 points and Hield had 20.\n\n\"We made some mistakes but we shot the ball pretty well,\" Sacramento coach Dave Joerger said. \"Had a chance there the last couple of minutes but they made some tough shots and pulled back in there.\"\n\nTIP-INS\n\nPacers: Young went to the locker room briefly in the second quarter after taking a hard foul from Sacramento's Skal Labissiere. ... Oladipo has made at least one steal in 59 consecutive games, the longest active streak in the NBA and the sixth-longest in league history.\n\nKings: Cauley-Stein had 17 points in the first half. ... Garrett Temple remains sidelined with a left ankle sprain.\n\nGETTING IT DONE ON THE ROAD\n\nThe Pacers have finished above .500 on the road only five times in their history and not since 2013-14. The win over Sacramento, however, improved Indiana to 19-18 away from home with wins in eight of its last 12 road games.\n\n\"We've been in a lot of situations this year and we feel as though we've experienced both ends of the spectrum,\" Oladipo sad. \"We've been successful and we haven't. But we know what it takes to be successful and that's what we did today.\"\n\nUP NEXT\n\nPacers: Travel to Los Angeles to play the Clippers on Sunday.\n\nKings: Host Golden State on Saturday.",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.473289",
  "pipeline_version": "v1"
}