{
  "game_id": "0021400941",
  "espn_id": "400579233",
  "date": "Mar 09, 2015",
  "matchup": "MEM @ CHI",
  "headline": "Marc Gasol leads Grizzlies past Pau Gasol, Bulls 101-91",
  "cleaned_body": "CHICAGO -- During halftime, Memphis Grizzlies coaches showed tape that revealed Marc Gasol was repeatedly open near the foul line. To take advantage, all they needed was to get him the ball and for him to shoot.\nGasol did and it helped the Grizzlies beat brother Pau Gasol and the Chicago Bulls 101-91 on Monday night.\nMarc Gasol scored 15 of his 23 points during the third quarter, and was 10 of 16 from the field and Memphis moved to two games ahead of idle Houston for the Southwest Division lead.\nThe Grizzlies padded their lead thanks in part to the younger Gasol brother, who had only four points after intermission.\n\"My teammates found me at the elbows and in the post, and I was able to make some shots,\" Marc Gasol said. \"That makes their bigs come out and pick up their coverage a bit more. You get confidence. You get in a rhythm.\"\nJeff Green had 19 and Zach Randolph added 16 for the Grizzlies, who held the Bulls to 43.8 percent shooting and forced 17 turnovers. It was a needed win for Memphis, which had been 3-4 in its last seven games and averaged just 91.4 points over that span but improved to 21-11 on the road.\n\"We have a good group of guys. We all feel like we have a chance to do something special this year,\" Memphis coach David Joerger said. \"You try to take care of your body, whether that be nutrition or sleep or staying in at night.\"\nPau Gasol, Marc's older brother, had 13 points and 11 rebounds for his 43rd double-double to match the career high he set during the 2010-11 season with the Los Angeles Lakers. Off the bench, Nikola Mirotic had 18 points and 12 rebounds for his fifth double-double.\nUnfortunately for the Bulls, that couldn't help them avoid their third consecutive loss, matching a season-high three-game skid.\nMemphis stretched its lead to as many as 11 and entered the fourth with a 73-65 lead. The Bulls then tied the game at 82 with 7:10 left when Tony Snell (21 points) stole an errant pass for a breakaway dunk.\nChicago led by as much as four in the fourth but Memphis regained the lead, going up 95-88 with 2:04 left when the Bulls were called for a technical for having six players on the court.\nBulls coach Tom Thibodeau blamed himself for the play, but found no fault with the effort from his short-handed team which was playing for the fourth time in five days.\n\"I thought the fight was strong. We're shorthanded. Fourth game in five nights, bouncing all over the place,\" Thibodeau said. \"We came up short but I thought they played with great effort.\"\nChicago was without former MVP Derrick Rose, All-Star Jimmy Butler (left elbow) and Taj Gibson (left ankle).\nMeeting with the media for the first time since undergoing surgery Feb. 27 to repair the torn cartilage in his right knee, Rose said his return this season is \"the plan, so whenever I feel right, that's when I'm going to step back.\"\nIn the meantime, Chicago will have to stay competitive without him and the two other key pieces. That didn't happen Monday, as the Bulls lost ground on idle Cleveland in the Central Division race. With the loss, the Bulls fell a full game behind the Cavaliers (40-25) for the lead and saw how narrow their margin of error has become.\n\"We're battling,\" Pau Gasol said. \"That's what needs to continue to happen.\"\nTIP-INS\nGRIZZLIES: Veteran Vince Carter has been eased into the rotation after a 14-game absence because of torn tendon in his left foot. In his third game back, Carter scored nine points in 13 minutes. ... Memphis improved to 16-6 with Green in the starting lineup.\nBULLS: Bulls coach Tom Thibodeau said Gibson is day-to-day. Gibson hasn't played since Feb. 27, and was averaging 10.6 points and 6.6 rebounds. ... Noah had six assists to surpass Rose (231) for the team lead. ... Chicago wore green uniforms with sleeved jerseys in observance of St. Patrick's Day.\nTHE HONOR\nPau and Marc Gasol have played against each other plenty of times before, but it still means something for the All-Star brothers to go head-to-head. \"It is an honor honestly,\" Marc said. Pau added that the Gasols are a \"very fortunate family\" and that it's a \"huge privilege\" to face Marc. The brothers had lunch near the Memphis team hotel Monday.\nHAPPY 100\nThe game paired the two active coaches with the best records in their first 100 starts. Thibodeau had a 77-23 record, while Joerger owned a 65-35 mark.\nUP NEXT\nGrizzlies: At Boston on Wednesday.\nBulls: At Philadelphia on Wednesday.",
  "tags_rule": [
    "DoubleDouble",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.457566",
  "pipeline_version": "v1"
}