{
  "game_id": "0022100984",
  "espn_id": "401360803",
  "date": "Mar 09, 2022",
  "matchup": "MIL vs. ATL",
  "headline": "Antetokounmpo scores 43 points, Bucks hold off Hawks 124-115",
  "cleaned_body": "MILWAUKEE -- — Giannis Antetokounmpo had 43 points and 12 rebounds and the Milwaukee Bucks beat the Atlanta Hawks 124-115 on Wednesday night for their sixth straight victory.\n\nDefending champion Milwaukee edged a half-game ahead of idle Philadelphia for second place in the Eastern Conference and moved within two games of first-place Miami, which lost at home to NBA-leading Phoenix.\n\nBobby Portis added 23 points and 15 rebounds, and Khris Middleton had 23 points and eight assists to help Milwaukee beat Atlanta for the first time in three tries this season.\n\nTrae Young led Atlanta with 27 points and 11 assists, including 22 points in the second half, and De'Andre Hunter had 17 points.\n\nAntetokounmpo slashed to the basket repeatedly and dunked or scored from close range as he made 15 of 22 field goals and 12 of 17 at the free throw line. He scored 82 points in a 24-hour span after getting 39 in a victory at Oklahoma City on Tuesday night.\n\n“The things he does are not normal,\" Portis said. “It’s fun to be his teammate and fun to play alongside him.”\n\nMiddleton made several perfect lobs to Antetokounmpo for easy baskets early in the game, helping his teammate get off to a great start with 17 points in the first quarter.\n\n“I see him work every day but also I've seen the growth and the greatness,” Middleton said. “When it's front of your eyes every day you get used to it, but not in a bad way. You just realize how good he is and you expect so much of him.”\n\nPortis and Middleton took over in the second quarter, combining for 27 of Milwaukee's 31 points.\n\nThe Bucks took a 68-54 halftime lead but the Hawks rallied behind the play of Young and pulled within five points late in the fourth quarter.\n\nMiddleton and Jrue Holiday sank 3-point shots to help the Bucks keep their lead, and Milwaukee's defense stiffened as Portis blocked a shot by Bogdan Bogdanovic and Middleton drew an offensive foul on Hunter.\n\nPortis' rejection came with the Bucks leading by eight points, after Antetokounmpo scored on a drive to give Milwaukee a 120-112 lead.\n\n“The block by Bobby stands out to me,\" Bucks coach Mike Budenholzer said.. \"That’s what we need. We need stops down the stretch. There are going to be a lot of close games in the East. It’s great to see it come defensively.”\n\nHawks coach Nate McMillan was enraged at the offensive foul call on Hunter and picked up two technical fouls in a row to be ejected with 1:22 remaining.\n\n“I thought De'Andre’s play was the same play that Giannis had done a couple of times in this game, and the result was a foul on De'Andre,” McMillan said. “I thought Giannis twice on a couple of our guys drove through them.”\n\nMiddleton made both free throws stemming from the technicals and Antetokounmpo rebounded a miss and scored to give the Bucks a 124-112 lead.\n\nThe Bucks continued their strong run since the all-star break. They lost to Brooklyn in the first game after the break but have rebounded to win the next six, including victories over Miami, Chicago and Phoenix. Now they head west for a four-game trip, opening at Golden State on Saturday night.\n\n“I think we were confident as a team before but I think we're building a lot of good habits,” Antetokounmpo said. \"We're playing together. We are figuring out how to play down the stretch. We're figuring out how to box out and get rebounds, to get the ball to Jrue or Khris to make plays.\n\n“We're feeling good as a team.”\n\nTIP-INS\n\nHawks: Kevin Huerter returned from a left shoulder injury suffered in a March 4 game at Washington. Huerter was in the starting lineup and finished with 16 points. Forward John Collins played for the third straight game after missing seven games with a strained foot. He scored just two points and was 0 for 9 from the field in 19 minutes.\n\nBucks: George Hill (neck soreness), Pat Connaughton (right finger surgery), Lindell Wigginton (right ankle sprain) and Lopez were out. Grayson Allen (left hip) returned from a one-game absence and contributed 11 points and five rebounds in 28 minutes.\n\nUP NEXT\n\nHawks: Host Los Angeles Clippers on Friday night.\n\nBucks: At Golden State on Saturday night.",
  "tags_rule": [
    "ReturnFromInjury",
    "InjuryReport",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.777344",
  "pipeline_version": "v1"
}