{
  "game_id": "0021401074",
  "espn_id": "400579366",
  "date": "Mar 27, 2015",
  "matchup": "DET @ ORL",
  "headline": "Jackson has triple-double, leads Pistons over Magic 111-97",
  "cleaned_body": "ORLANDO, Fla. -- It took a while, but once the Detroit Pistons got Reggie Jackson going north and south with the basketball, they easily ran away from the Orlando Magic.\nJackson scored 26 points, grabbed 11 rebounds and handed out 10 assists as the Pistons cruised to a 111-97 win over the Magic. Tayshaun Prince added 23 points and Andre Drummond had 16 points and nine rebounds for Detroit.\nIt was the fourth straight victory for the Pistons and Jackson's second triple-double since joining Detroit. Most of his damage was done in the third period, when he had 17 points, five rebounds and three assists as Detroit pushed a one-point halftime lead to 87-76 by the end of the quarter.\n\"That was a fabulous third quarter,\" Detroit coach Stan Van Gundy said. \"Reggie sort of had a tough start, but he started to attack (in the third quarter) and that really gets him going. When he's playing laterally, east and west, he's not as good. When he's on the attack, he's really good.\"\nJackson, who came to Detroit in a trade at the All-Star break, says he's fitting in quickly with his new team. He's especially encouraged by the four-game win streak.\n\"All of my teammates have done a great job encouraging me,\" Jackson said. \"We just want to keep riding the wave we've been on and see where we end up,\" Jackson said.\nMagic interim coach James Borrego has been trying to instill a defensive identity in his team since taking over for Jacques Vaughn a month ago, but has to wonder again if anyone is listening. Orlando has given up 104 or more points in six of its last seven games.\n\"Our defense needs to be much better,\" Borrego said. \"We gave up two, 30-point quarters defensively and you can't be a consistent winner in this league giving up 30-point quarters.\"\nOrlando shot 52.4 percent in the game, placed five starters in double-figures, but lost for the ninth time in 10 games. Tobias Harris scored 21 points, Nik Vucevic had 20 points and 14 rebounds, and Elfrid Payton had 14 points and 13 assists.\n\"We have to show improvement,\" Harris said. \"The fans come out to support us and we have to show some urgency out there and build something.\"\nJackson helped the Pistons seize control in the third period when he scored 17 points, grabbed five rebounds and handed out three assists to help Detroit build an 11-point lead. Orlando tried three different defenders on the Pistons point guard, but none could stop him. He plowed through the middle of the lane at will, getting all of his points on driving layups or free throws.\nHe finished the quarter one assist short of a triple-double and the Pistons, who led by as many as 15 in the quarter, settled for an 87-76 lead going into the final period. Jackson sat out the first eight minutes of the fourth quarter, but got the triple-double with a pass to Joel Anthony for a layup with 1:30 to go.\nPrince did the bulk of the fourth-quarter work before Jackson returned. The 35-year-old veteran added nine points to the 14 he scored in the second period as Detroit built the lead to 17 with four minutes to play and coasted from there.\nThe Magic hit 24 of 39 field-goal attempts (61.5 percent) in the first half, but the hot shooting couldn't even get them a lead. Vucevic had 10 points and eight rebounds and Payton had 10 points and eight assists, but the Magic still trailed 54-53 at halftime.\nPrince had 14 points in the second quarter on 6-of-8 shooting and the Pistons made up for numerous misses with nine second-chance points to stay in control.\nTIP-INS\nPistons: SG Kentavious Caldwell-Pope is shooting 53.7 percent (43 of 80) and averaging 22.4 points over the last five games. ... C Andre Drummond leads the NBA in offensive rebounds per game (5.4) and is second (13.4) behind DeAndre Jordan in overall rebounding. ... Jackson is averaging 12.2 assists over the last five games.\nMagic: Shaquille O'Neal, who entered the NBA with the Magic in 1992, was inducted into the team's hall of fame before the game and introduced to the crowd between the first and second periods. ... Magic C Nik Vucevic and Pistons C Andre Drummond are tied for third in the NBA with 40 double-doubles each this season. ... C Dewayne Dedmond missed the game with a sore ankle. SG Evan Fournier missed his 15th straight game with a sore hip.\nMAGIC HOF FOR VAN GUNDY? NO!\nThe Magic put to rest a sometimes-turbulent relationship with O'Neal with his induction. Detroit coach Stan Van Gundy, who took the Magic to the NBA Finals during his five seasons, also saw his tenure end on a bitter note and was asked if he too should expect a call for the Magic HOF some day? \"No chance, absolutely no chance,\" Van Gundy said. \"The way things went down at the end . I guess if it were a whole new group of people here, but not with the current group. That ain't happening.\"\nUP NEXT\nPistons: play at Miami on Sunday.\nMagic: have four days off before playing at home against San Antonio on Wednesday.",
  "tags_rule": [
    "DoubleDouble",
    "TripleDouble",
    "CoachComment",
    "MomentumShift"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.602666",
  "pipeline_version": "v1"
}