{
  "game_id": "0021700432",
  "espn_id": "400975183",
  "date": "Dec 16, 2017",
  "matchup": "MIA vs. LAC",
  "headline": "Richardson scores 28 points, Heat beat Clippers 90-85",
  "cleaned_body": "MIAMI -- A slow start to the season is in the past for Josh Richardson.\nRichardson scored a career-high 28 points to help the Miami Heat beat the LA Clippers 90-85 on Saturday night.\n\"J-Rich played unbelievable tonight,\" Heat point guard Goran Dragic said.\nRichardson was 10 for 16 from the field to record his second 20-plus scoring game of the month and is averaging 16.3 points a game in December after averaging 8.8 points in his first 21 games.\n\"I've been feeling good lately,\" Richardson said. \"It's just another day.\"\nHeat coach Erik Spoelstra became the franchise's victory leader with 455, passing Pat Riley. Spoelstra is only one of two active head coaches in the NBA with at least 450 wins with their current team, joining San Antonio's Gregg Popovich.\n\"I thought that it would be most fitting to go retro and have an old-school Miami Heat game in honor of coach Riley,\" Spoesltra said. \"This is the type of game he probably enjoys the most-you win shooting 37 percent. I think we scored too many points this game. But those are the old-school, tough, grind-it-out, find-any-way-as-a-competitor to win the games. That's in honor of my mentor and my coach. He's still my coach.\"\nDion Waiters added 13 points, and Kelly Olynyk scored nine of his 11 points in the fourth quarter for Miami. The Heat have won four of five to go over .500 for the first time in December.\n\"I really enjoyed this game for our guys,\" Spoelstra said.\nMontrezl Harrell led the Clippers with 15 points, and DeAndre Jordan had 12 points and 20 rebounds. Lou Williams was held to 13 points, snapping a string of scoring at least 17 in 11 consecutive games, a career-best.\nDespite his struggles most of the game, Williams rattled in a 3 from the left wing with 1:50 left for an 85-84 lead.\nDragic hit a baseline jumper on the ensuing possession to regain the lead.\nAfter a review, the Heat were awarded the ball after a turnover by the Clippers as the ball was batted around the court before Jawun Evans tossed it out of bounds, but Dragic badly missed a 3 keeping the Heat lead at 86-85.\nWilliams was then called for an offensive foul before he had a chance at another 3.\n\"We should go up two,\" Williams said. \"The referees were for sure that I pushed him, but we looked at the replay. He tripped on his own man's foot. I got both of my hands down.\"\nRichardson responded with a pair of free throws for an 88-85 lead with 19.9 seconds left.\nJamil Wilson missed a 3 and after another foul call, Clippers coach Doc Rivers was whistled for a technical foul in the closing seconds.\n\"I just thought the calls overall, honestly,\" Rivers said about his frustration.\nWilliams missed his first seven shots before slamming home a two-handed dunk on a backdoor cut. He made 4 of 16 shots from the floor.\n\"For me personally I had a rough game,\" Williams said. \"I got banged up early in the game. I was out there on a turned ankle and wasn't shooting the ball well so to even have an opportunity to put us up two right there (at the end), not making shots, but to be in a position to make a big shot and they take it away, yeah it frustrated me.\"\nTIP-INS\nClippers: It's been an oddly scheduled road trip for the Clippers, who were in Florida on Wednesday to play Orlando, then left for a game at Washington on Friday, then returned to the Sunshine State for the matchup with the Heat. ... Austin Rivers (concussion) did not play, but has been cleared and is expected to make his return next game. ... Willie Reed made his first return to Miami after playing in 71 games with the Heat last season. Reed scored two points in four minutes. ... The Clippers are 0-5 on the second game of a back-to-back.\nHeat: James Johnson suffered a right ankle injury in the first quarter and did not return. He is scheduled to have an MRI on Sunday. ... Jordan Mickey scored a career-high nine points off the bench picking up the minutes left behind by Johnson's exit. ... Miami came into Saturday getting 35.5 percent of its points this season off 3-pointers, by far the highest such rate in franchise history. The Heat got 28.7 percent of their points last season off 3s.\nUP NEXT\nClippers: At San Antonio on Monday night to conclude a four-game road trip.\nHeat: At Atlanta on Monday night looking for its fourth consecutive win over the Hawks.",
  "tags_rule": [
    "InjuryReport",
    "PhysicalGame",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.737746",
  "pipeline_version": "v1"
}