{
  "game_id": "0022100762",
  "espn_id": "401360581",
  "date": "Jan 31, 2022",
  "matchup": "MIA @ BOS",
  "headline": "Brown scores 29, Celtics run past shorthanded Heat 122-92",
  "cleaned_body": "BOSTON -- — Jaylen Brown had 29 points, Jayson Tatum added 20 points and 12 rebounds and the Boston Celtics rolled past the Miami Heat 122-92 on Monday night.\n\nBoston led by as many as 32 on its way to claiming its fourth victory in five outings. Marcus Smart added 16 points and seven assists.\n\nIt was Brown’s fourth consecutive game with 25 or more points, and Tatum has scored 20 or more in his last six games.\n\nThe Celtics' onslaught was keyed on the defensive end, where they forced 18 turnovers.\n\n“We’re still working on some things, but I’m very encouraged by the progress of our group,\" said Celtics big man Al Horford, who contributed 14 points and nine rebounds. \"Now we can kind of see what we can do and who we are.”\n\nMiami has lost two straight and struggled mightily without several key players in the first of its six-game road trip: Jimmy Butler (toe), P.J. Tucker (knee) and point guard Kyle Lowry, who missed his eighth consecutive game for personal reasons.\n\nIn their absence, Max Strus finished 27 points. Caleb Martin had 14 points and Bam Adebayo chipped in 12 points, five rebounds and five assists. Miami also was coming off a triple-overtime loss to Toronto on Saturday.\n\n“We played about seven good minutes of basketball. The rest of it I would love to just put in a dumpster truck,” Heat coach Erik Spoelstra said. “It was just uncharacteristic for us. But we've been through a bunch of stuff in the last 72 hours.\n\nThe Celtics connected on eight of their first 11 shots and jumped out to a 21-7 lead. Miami struggled for quality looks on its end of the floor, shooting just 29% (6 of 21) in the opening period.\n\nThe Heat settled down, starting the second quarter on an 18-5 run to tie the game at 32. It prompted Celtics coach Ime Udoka to call a timeout. His team immediately responded with seven straight points to key a 22-13 run to close the half.\n\nUdoka said the team heeded his message to limit the open looks for Miami's shooters.\n\n“We got our physicality back,\" Udoka said. “Credit to our guys. They bounced back and finished out the half, then carried it over to the third quarter.”\n\nBoston led 67-52 in the third when Adebayo was assessed a technical at the 8:38 mark and pulled from the game by Spoelstra. By the time Adebayo returned with 2:04 left in the period, Boston's lead had grown to 86-67. The Celtics took a 94-70 edge into the fourth and cruised the rest of the way.\n\nSmart said he feels like the team is finding its way after some rough patches earlier in the season.\n\n“I love it, especially with the adversity that we've been dealing with this whole season — the up and down, not being consistent,” Smart said. “For us to finally make start to make that walk in the right direction, it's big for us. .... It's something that we needed. It's happening at the right time for us.”\n\nTIP-INS\n\nHeat: Shot 39% (34 of 87) for the game. … Had five turnovers leading to 10 Boston points in the third quarter. … Rookie C Omer Yurtseven missed the game after being placed in the health and safety protocols.\n\nCeltics: Had 16 3-pointers. … Outscored the Heat 40-25 in the third quarter. ... Shot just 5 of 12 from the free-throw line in the second quarter. … Recognized former players Eddie House (2007-10) and Brandon Bass (2011-15) in continuation of their season-long salute to past Celtics as part of the NBA’s 75th anniversary season. House also played four seasons for the Heat. “That was probably the only highlight of the night,” Spoelstra said.\n\nUP NEXT\n\nHeat: At Toronto on Tuesday.\n\nCeltics: Host Hornets on Wednesday.\n\n------",
  "tags_rule": [
    "EarlyRun",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.725798",
  "pipeline_version": "v1"
}