{
  "game_id": "0021701065",
  "espn_id": "400975811",
  "date": "Mar 21, 2018",
  "matchup": "TOR @ CLE",
  "headline": "LeBron scores 35, carries Cavaliers past Raptors 132-129",
  "cleaned_body": "CLEVELAND --  The standings show the Eastern Conference's top team plays in Canada.\n\nThe best player remains in Cleveland, Ohio.\n\nLeBron James reminded Toronto he's king.\n\nPlaying without five teammates and his coach, James scored 35 points and added 17 assists, his last setting up a late a 3-pointer by Kevin Love, as the undermanned Cavaliers rallied to beat the Raptors 132-129 on Wednesday night.\n\nThe Cavs were down five rotational players and coach Tyronn Lue, who missed his second straight game for health reasons.\n\nBut they still had James, who earlier in the day said, \"I'll be available, so we got a chance.\"\n\nThe three-time champion delivered another virtuoso performance, adding seven rebounds without committing a turnover in nearly 40 minutes.\n\n\"I've never seen anything like it,\" said associate coach Larry Drew, filling in for Lue. \"It's just amazing what he does, night in and night out. How he sustains it is just mind-boggling.\"\n\nJames made three free throws in the final 7.8 seconds, but missed one with 3.9 seconds to go, giving Toronto a final shot. DeMar DeRozan got a decent look on a 3-pointer -- contested by James -- at the horn but missed. DeRozan and Toronto coaches complained the All-Star was fouled to no avail.\n\nThe win felt like a statement by the Cavs, but James insisted there were no intended messages.\n\n\"It's a good win for us because of how depleted we are on our roster and everything that's been going on,\" he said. \"It's a good win for us against a very good opponent.\n\n\"But I don't need to remind anybody about what my teams are capable of doing.\"\n\nLove, playing his second game after missing 21 games with a broken left hand, finished with 23 points and 12 rebounds and George Hill had 22 on 10-of-11 shooting for the Cavs, who were blown out by 34 points against Toronto in January.\n\nBut that was before Cleveland shook up its roster with four trades designed to get back to the NBA Finals. The Cavs are third in the East, but still as dangerous as anyone.\n\n\"They're still a top team in our conference -- and in this league,\" DeRozan said. \"You can't overlook them or under-look them no matter what type of changes they made.\"\n\nKyle Lowry scored 24 and DeRozan had 21 for the Raptors, who scored 79 points in the first half and were in control in the third quarter before James brought Cleveland back.\n\nWith the Cavs up 125-124, James drove the lane and whipped the ball into the corner to Love, who knocked down his 1,000th career 3-pointer.\n\nThe Raptors have lost to the Cavs in each of the past two postseasons, getting swept last year in the conference finals. But this is a different Toronto team, deeper, more experienced and maybe poised to dethrone Cleveland.\n\nNot if James has anything to say about it.\n\nLAST SHOT\n\nWhile he protested on the floor, DeRozan was calm in addressing whether James made contact with him on his errant 3-pointer.\n\n\"I don't know,\" he said. \"It's over with now. There's nothing you can do about it. It was a heck of a game.\"\n\nREMATCH\n\nThe teams will meet again on April 3 in Cleveland.\n\nCURIOUS GEORGE\n\nHill had his best game since joining the Cavs. He had shot just 12 of 31 in his previous five games.\n\n\"I've been playing like crap the last couple weeks,\" Hill said. \"I've been hard on myself, staying in the gym with our coaches and things like that, shooting more, watching more film and just trying to figure out how I can find myself again.\"\n\nTIP-INS\n\nRaptors: Tied a franchise record by scoring 79 points in the first half. They also did it in 1997 against the Nets. ... Coach Dwane Casey said the team's confidence has never been higher and has given Toronto an aura it didn't have before. \"It doesn't mean you're going to go out and beat a team,\" he said. \"But I think we go into the game with a different mindset, more of a hunted mindset than we did last year.\" ... G C.J. Miles sat out with a flu bug. ... The Raptors have made at least 10 3-pointers in team-record 14 straight games.\n\nCavaliers: F Kyle Korver was excused Tuesday following the death of his younger brother, Kirk. ... F/C Tristan Thompson (ankle) and Rodney Hood (back) were listed as questionable but sat out. ... F Larry Nance Jr. (hamstring) is aiming to return this weekend. He has missed four games. ... Drew spoke with Lue on Tuesday and said he reported feeling better. \"He's on the right trail of recovering and I'm really happy to hear that from him,\" Drew said. ... Nick Gilbert, owner Dan Gilbert's son, sat in the front row next to his dad. The younger Gilbert recently spent 38 days in the hospital following brain surgery. He received an ovation from the crowd.\n\nUP NEXT\n\nRaptors: Host Brooklyn on Friday.\n\nCavaliers: Host Phoenix on Friday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "ClutchShot",
    "CoachComment",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.036887",
  "pipeline_version": "v1"
}