{
  "game_id": "0021300476",
  "espn_id": "400489349",
  "date": "Jan 02, 2014",
  "matchup": "OKC vs. BKN",
  "headline": "Joe Johnson buzzer-beater caps Nets' comeback vs. Thunder",
  "cleaned_body": "OKLAHOMA CITY -- The way Brooklyn guard Joe Johnson looked at it, it was his turn at the game-clinching shot. So he asked coach Jason Kidd for the ball on the final possession.\nJohnson made the most of his last-second opportunity, sinking a high-arching jumper at the buzzer to give the Nets a 95-93 comeback win over Oklahoma City on Thursday night.\n\"He delivered,\" Kidd said.\n\nBrooklyn (11-21) trailed 89-79 with 6:54 remaining, but used a 14-0 run to go up 93-89 in the closing minutes -- surprising the Western Conference-leading Thunder (25-7).\nAfter the Nets rallied for that four-point lead, Deron Williams -- who finished with a season-high 29 points -- and Kevin Garnett both missed shots that could have sealed the win.\nOklahoma City's Serge Ibaka tied the game at 93 with an inside basket with 5.8 seconds left. Johnson then took a pass from Garnett on the other end, stepped back and connected on a 19-footer from the top of the key.\nBrooklyn had lost two in a row and six of seven coming into the game.\n\"I thought we as a team did a great job in keeping the game close and coming up with the big plays, especially in the fourth quarter and down the stretch,\" Johnson said. \"Coach drew the play up in the huddle, and the rest is history.\"\nKevin Durant led the Thunder with 24 points on 8-of-13 shooting. The NBA's leading scorer had scored 33 or more in each of Oklahoma City's last three games -- all of which it played without All-Star point guard Russell Westbrook following his knee surgery on Dec. 27.\nThe loss was the second straight for the Thunder, which fell to Portland on Dec. 31. It's only the second time Oklahoma City has lost two straight games this season.\n\"We've just got to be better,\" Durant said. \"It's tough to swallow, losing at the buzzer like that after being up so much.\"\nBrooklyn, which trailed by as many as 16 points twice in the game, appeared finished at various points during the first half and even near the end of the third quarter when the Thunder went up 77-61 after a 3-pointer by Jeremy Lamb.\nThe Nets, however, had other plans -- going on their 14-0 run in the closing minutes to take a 93-89 lead. Paul Pierce scored five points during the spurt, and Williams gave Brooklyn its first lead since the first half with a 3-pointer to go up 91-89.\nPierce finished with 18 points, but it was Williams who spearheaded the fourth-quarter comeback. He scored 18 in the second half.\n\"We didn't give in to the team making the run, even though in the third quarter they really pushed the lead,\" Pierce said. \"The crowd really got behind them, but the thing is we really stayed together.\n\"Hopefully we can build on it.\"\nThe loss was the third in four games at home for the Thunder, who opened the season 13-0 at home.\n\"We have to do a better job definitely of protecting leads,\" coach Scott Brooks said. \"That's something that we have to do a better job of, especially on our home floor.\"\nBrooklyn, despite its struggles this season, was up 29-26 after the first quarter -- led by eight points from Williams. The Nets stayed close into the second quarter, trailing 38-37 after a 3-pointer by Mirza Teletovic.\nOklahoma City, now 14-3 at home this season, took control after that with a 14-1 run to go up 52-38. Ibaka had two fast-break baskets during the spurt and Durant added a pull-up 3 on the break.\nThabo Sefolosha capped the run with a jumper for the Thunder, who shot 52.5 percent (21 of 40) in the first half. The guard also gave Oklahoma City its biggest lead of the half with a free throw to go up 59-43 late in the second quarter.\nThe Nets were just 13-of-34 shooting (38.2 percent) in the first half, but connected on 18 of 36 shots (50 percent) in the second half. Williams was 10 of 17 from the floor, while Johnson finished 4 of 11.\nNone were bigger than his last shot.\n\"That's a good way to start the new year,\" Williams said.\nGame notes\nWestbrook, out until after the All-Star break, was courtside during the game and was walking without crutches. ... Brooklyn scored five points in 0.9 seconds to end the third quarter, with Pierce hitting a jumper and Williams connecting on a 3 at the buzzer following a steal.",
  "tags_rule": [
    "MomentumShift",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.694120",
  "pipeline_version": "v1"
}