{
  "game_id": "0021700467",
  "espn_id": "400975218",
  "date": "Dec 21, 2017",
  "matchup": "TOR @ PHI",
  "headline": "DeRozan scores 45 points, Raptors rally to beat 76ers",
  "cleaned_body": "PHILADELPHIA --  With DeMar DeRozan knocking down 3-pointers early, Toronto Raptors coach Dwane Casey thought he was back in Seattle.\n\nDown the stretch, Casey watched DeRozan do what's made him a three-time All-Star: get to the foul line.\n\nDeRozan combined the two to score a career-high 45 points and the Raptors overcame a 22-point deficit to beat the Joel Embiid-less Philadelphia 76ers 114-109 on Thursday night.\n\nDeRozan, a career 28 percent shooter from 3-point range, set a career high with six 3s in nine attempts in Toronto's fifth straight win.\n\n\"I thought he was a young Ray Allen,\" Casey said about DeRozan's 4-of-4 first-quarter shooting from 3, reminiscing of his days as an assistant coach with the Seattle SuperSonics in the early 2000s. \"That's what we need from him. It opens up the floor, especially on nights when we just didn't have it. We were playing in mud in the first half.\"\n\nDeRozan became more conventional in the fourth quarter. His jumper with 4:13 left put the Raptors ahead to stay after they trailed 76-54 early in the third quarter.\n\nHe hit two free throws with 53 seconds left after Philadelphia's Robert Covington missed a go-ahead 3-point attempt, and then two more with 6.4 seconds left put it away.\n\nDeRozan finished 13 of 15 from the line to best the 43 points he scored against Boston last season. The Sixers only took 14 free throws as a team.\n\n\"That's been my career the past few years, getting to the free throw line,\" DeRozan said. \"Being able to close out the game and me understanding to slow the game down. Get the momentum going our way and try to kill them at the free-throw line.\"\n\nKyle Lowry added 23 points to help the Raptors to their 11th win in 12 games.\n\n\"Sometimes you're going to have games where you let your All-Star, your superstar, take over,\" Lowry said of DeRozan.\n\nBen Simmons scored 20 points but had seven of the Sixers' 23 turnovers in their fourth straight loss. Covington added 19 points and Dario Saric had 18 points, 10 rebounds and nine assists.\n\nPhiladelphia, which blew a 16-point lead Tuesday night in a loss to Sacramento, fell to 1-7 without Embiid.\n\n\"We need to come and play dirty, play tough,\" Saric said.\n\nIt was another day of uncertainty and false hope for the Sixers regarding their oft-injured franchise center, who went from questionable to probable to out in eight hours.\n\nEmbiid missed two games with back tightness after logging a career-high 49 minutes in a triple-overtime loss to Oklahoma City last Friday. But the big man participated in shootaround and coach Brett Brown said less than two hours before tipoff that Embiid was \"probable\" and would play barring a setback in warmups.\n\nEmbiid didn't show any discomfort during pregame drills, but was ruled out about 30 minutes before tipoff.\n\n\"He felt OK in the morning and then half an hour before the game, we learned he didn't feel comfortable playing.\" Brown said. \"So we decided to rest him again.\"\n\nThe Sixers were also without starting shooting guard JJ Redick (right hamstring), but used Covington's 5-of-7 shooting from 3-point range to race ahead by 22.\n\nThings quickly fell apart. Lowry and Delon Wright (12 points) got hot in a 22-2 run that included bad passes and poor shots by the Sixers.\n\n\"We're going to get healthy,\" Brown said. \"We're going to get better.\"\n\nTIP-INS\n\nRaptors: F C.J. Miles (dental procedure) missed his second straight game.\n\n76ers: Former Raptors C Amir Johnson started in Embiid's place. ... Redick is doubtful for Saturday's rematch in Toronto.\n\nFRAGILE EMBIID\n\nEmbiid has played in 54 of a possible 277 games since being the No. 3 overall pick in the 2014 draft. That includes two lost years to foot injuries and last season being cut short by knee surgery. He's yet to be cleared to play on consecutive days because of his knee, and his back has been an on-and-off problem.\n\nUP NEXT\n\nThe teams meet again Saturday night in Toronto.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "ReturnFromInjury",
    "CoachComment",
    "CareerHigh",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "ReturnBoost",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.969408",
  "pipeline_version": "v1"
}