{
  "game_id": "0021400053",
  "espn_id": "400578345",
  "date": "Nov 04, 2014",
  "matchup": "CHI vs. ORL",
  "headline": "Bulls beat winless Magic without Derrick Rose and Joakim Noah",
  "cleaned_body": "CHICAGO --  With Derrick Rose and Joakim Noah out, Pau Gasol showed how much of a difference he can make for the Chicago Bulls.\n\nGasol had 16 points and 13 rebounds, and the Bulls beat the winless Orlando Magic 98-90 on Tuesday night.\n\nJimmy Butler led the Bulls with 21 points and Taj Gibson added 16 for Chicago, which finally pulled away in the final minutes of a game that was tied after three quarters.\n\n\"It was a good team win,\" Bulls coach Tom Thibodeau said. \"We can't feel too good about it. We have to be ready for tomorrow night.\"\n\nRose missed his second straight game after injuring both ankles Friday against Cleveland. He took part in the morning shootaround and was listed as probable to play, but was taken out of the starting lineup about a half hour before the game after going through warmups.\n\nNoah was ill and with Gibson battling foul trouble all night, Gasol was asked to carry a heavy load. He did, playing 41 minutes to help Chicago improve to 3-1.\n\nThe Bulls may be without both Rose and Noah when they play Wednesday in Milwaukee, but if so Gasol will probably be ready.\n\n\"You have to always be prepared physically and mentally to face differing and difficult circumstances where you're going to have to play a little longer, work a little harder,\" Gasol said. \"This was what this league is about, as well.\"\n\nKirk Hinrich started in place of Rose, who has played in only 12 games since tearing the ACL in his left knee during the opening round of the 2012 playoffs.\n\nBut without the former MVP and Noah, the Bulls still pulled away from Orlando, which is 0-4 for the first time since dropping its first six in 1990-91.\n\n\"I thought we had a few good looks at the rim, and then you give them credit for really executing down the stretch, getting the basketball where they wanted to and making some tough shots,\" Magic coach Jacque Vaughn said. \"But I did think we did some good things to put us in position to win the basketball game.\"\n\nTobias Harris scored 21 points and Nikola Vucevic had 19 points and 13 rebounds for Orlando. Vucevic, who entered the night leading the league with 15.7 rebounds per game, had his fourth double-double of the season after picking up 36 last season.\n\n\"Our mentality was to come in here and get a win,\" Harris said. \"It's discouraging that we didn't get that done tonight, but I think that's what's going to make us better and make us hungrier on the floor.\"\n\n---\n\nTIP-INS\n\nMagic: Following Tuesday, Orlando will play 15 of its next 20 games on the road. Since last season, the Magic are 4-39 away from home. . F/C Kyle O'Quinn missed his third straight game with a sprained left ankle. \"We'll definitely miss him,\" Vaughn said.\n\nBulls: Noah averaged 19.0 points, 12.3 rebounds and 6.0 assists in three games against Orlando last season. . The Bulls started a run of four games in five nights, the first of three such stretches this season.\n\nYOUTHFUL DISCRETION\n\nIt appears both Doug McDermott and Nikola Mirotic have impressed Thibodeau. McDermott scored 12 and Mirotic added eight. \"I keep saying it over and over about (Mirotic) and Doug: I love them both,\" Thibodeau said.\n\nBETTER TUESDAY\n\nOne game after going 4 for 15 with 11 points in a loss to Toronto, Harris recovered by hitting nine of 15 shots. It was his second game of more than 20 points this season.\n\nSAVE THE DATE\n\nTuesday was the 20th anniversary of the Bulls' first regular-season game at the United Center. Scottie Pippen led the Bulls with 22 points in their 89-83 win over the Charlotte Hornets on Nov. 4, 1994.\n\nUP NEXT\n\nMagic: Visit Philadelphia on Wednesday.\n\nBulls: Visit Milwaukee on Wednesday.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "FoulTrouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.525413",
  "pipeline_version": "v1"
}