{
  "game_id": "0021700188",
  "espn_id": "400974939",
  "date": "Nov 12, 2017",
  "matchup": "TOR @ BOS",
  "headline": "Celtics hold off Raptors 95-94 for 12th straight victory",
  "cleaned_body": "BOSTON --  Al Horford turned back the clock in his return from a two-game absence with a concussion.\n\nHorford scored 21 points on 8-of-9 shooting to help the Boston Celtics hang on to beat the Toronto Raptors 95-94 on Sunday for their 12th straight victory.\n\n\"He's playing young again,\" teammate Terry Rozier said.\n\nHorford had 15 points, 10 rebounds and nine assists against his former team in Atlanta on Monday night, the same day an elbow to the head from Kent Bazemore sent him into the NBA's concussion protocol. Horford also missed nine games last season with a concussion.\n\nHorford disagreed with Rozier's assessment, thinking he's playing even better.\n\n\"I don't know if young Al Horford played like this, to be honest,\" the former four-time All-Star said. \"You know, it's been years of just working on my game and try to play this new way.\"\n\nBoston (12-2) was playing without Kyrie Irving after he took an inadvertent elbow to the face from teammate Aron Baynes on Friday night against Charlotte. Irving has a minor facial fracture but has not been diagnosed with a concussion as initially feared.\n\nJaylen Brown added 18 points, and Rozier helped fill in for Irving with 16 points off the bench. Boston shot just 40.2 percent from the field.\n\nDeMar DeRozan scored 24 points, and Kyle Lowry had 19 points and seven assists for Toronto. The Raptors dropped to 7-5 after winning two straight.\n\n\"They are the best team in the NBA right now, 12 in a row,\" Lowry said. \"They're playing unbelievable, everyone is picking up slack.\"\n\nJayson Tatum's acrobatic layup with 1:26 remaining in the fourth quarter put the Celtics up 95-90.\n\nDeRozan missed a potential go-ahead stepback jumper with 19 seconds remaining. Tatum got the rebound, but elbowed Fred VanVleet in the face for an offensive foul that was confirmed by video review.\n\nDeRozan had another look to give Toronto the win, but missed a turnaround jumper with 2 seconds left. Serge Ibaka scooped up the rebound, but lost the ball as time expired.\n\n\"He shook him, he was wide open, vaulted up, and I'll take that shot 999 times out of 1,000,\" Raptors coach Dwane Casey said about DeRozan's effort.\n\nBrown, who was guarding DeRozan on the final possession, was a bit surprised himself that the shot didn't go down.\n\n\"That's a shot that DeMar DeRozan probably hits nine times out of ten,\" Brown said. \"I got a late contest, but he missed this one so we'll take the win.\"\n\nSTREAKING\n\nBoston's 12-game winning streak is tied for its third-longest in the last 30 years. The Celtics also won 12 straight from Jan. 11-Feb. 3, 2009. Toronto has never snapped an opponent's winning streak of 10 or more games in franchise history, according to Elias Sports Bureau.\n\nMASKED KYRIE\n\nIrving visited a facial specialist Sunday and was fitted for a mask after being injured Friday. The last time Irving played in a mask was on Dec. 15, 2012, when he scored a then-career-high 41 points versus New York with Cleveland.\n\nPASSING BARGNANI\n\nLowry's 3-pointer with 5:32 left in the first quarter moved him past Andrea Bargnani (6,581 points) into fourth place on Toronto's scoring list. Vince Carter is third with 9,420 points.\n\nTIP-INS\n\nRaptors: DeRozan had 20 or more points for the seventh straight regular season game in Boston and is averaging 22 points in that stretch. ... Norman Powell left the game with a right hip pointer.\n\nCeltics: Boston held an opponent under 100 points for the 11th time in its last 12 games. Opponents are averaging 92.2 points during the winning streak. ... Rozier scored at least 10 points in a career-best three straight games.\n\nUP NEXT\n\nRaptors: Continue a three-game trip Tuesday night against Houston.\n\nCeltics: Visit Brooklyn on Tuesday night in a tuneup for Thursday night's home showdown with defending champion Golden State.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.625056",
  "pipeline_version": "v1"
}