{
  "game_id": "0022100625",
  "espn_id": "401360444",
  "date": "Jan 12, 2022",
  "matchup": "CHI vs. BKN",
  "headline": "Durant, Harden lead Nets to 138-112 romp over Bulls",
  "cleaned_body": "CHICAGO -- — Kevin Durant knew the rest of the league had to be watching, curious to see just how good the Brooklyn Nets can be when they have all their superstars playing.\n\nWell, here's the answer.\n\nDurant scored 27 points, James Harden added 25 points and a season-high 16 assists, and Brooklyn rolled to an easy win over Chicago, beating the Bulls 138-112 Wednesday night in a matchup between the Eastern Conference’s top two teams.\n\nDurant had 17 points in the third to help Brooklyn break open a game that was tied at 71-all early in the quarter. The second-place Nets silenced a raucous crowd and came away with the win with all three superstars in the lineup for just the second time.\n\n“We’re trying to make no statements to the league,” Durant said. “I mean, who cares what they think. We know what we bring to the table, and it’s all about us. But I’m sure people were watching the game tonight.”\n\nKyrie Irving scored nine in his third game. The seven-time All-Star has refused to get the COVID-19 vaccine and is barred from suiting up in New York due to the city’s mandate.\n\nBut Durant dominated over 30 minutes and finished with nine assists. Harden hit five 3-pointers. Patty Mills scored 21 and nailed of 6 of 8 from beyond the arc, helping Brooklyn come out on top after losing five of seven.\n\nThe Nets also avoided a three-game sweep by the Bulls. More than anything, they showed how dangerous they can be when they have all their best players available. That hasn't happened often the past two years.\n\n“We're that good,” Harden said. “We have a chance to be that good. We just haven't had enough of it.”\n\nZach LaVine scored 22. DeMar DeRozan added 19 points. But Chicago lost for the second time in three games after winning nine straight to match their best run since the end of the 2010-11 regular season. The Bulls also had their nine-game home win streak snapped.\n\n“I think you own it,” coach Billy Donovan said. \"I think our guys have worked hard up to this point to be where we are in the standings, and with that there’s a greater responsibility.”\n\nThe Nets outscored the Bulls 39-19 in the third to turn a two-point halftime lead into a 101-79 advantage.\n\nDurant had 10 in about a two-minute span, including a 3 to make it 99-79 before Irving drove for a layup in the closing minute.\n\nBy then, the Nets were well on their way. They took control midway through the third with an 18-4 run to break open a game that was tied at 71, a 3-pointer by Mills making it 89-75.\n\n“When that run happened, I think it was just a continuous sort of flow we had from the first half,” Irving said. “We just felt like once we break this open, hit a few more 3s, make it tough for them on the defensive end — we felt like we'd have control of the game.”\n\nQUOTABLE\n\n“I'm in Jersey. I go into the facility, into Brooklyn, to get my treatment, do workouts and then I go back home and I'm either with my son or my fiancee or both. If you only understood how many people support the Nets from my hometown and also from where I'm from, it's a lot. Sometimes, it can be a little overwhelming. I can't really go out and watch at a local bar or anything like that.” — Irving on where he watches Nets home games.\n\nTIP-INS\n\nNets: Though Chicago has a similar mandate as New York City, an exception allowed Irving to play. It applies to visiting professional and college athletes as well as non-resident performance artists. ... C Nic Claxton (left hamstring tightness) missed the game.\n\nBulls: Donovan had no update on F Derrick Jones Jr., who left with a right knee injury 36 seconds into the game. He twisted it pulling up near the Chicago basket and had to be helped to the back. ... G Alex Caruso missed his 10th straight game and fourth since entering the NBA’s COVID-19 protocol. He missed the first six of them because of a sprained left foot, and Donovan does not expect him to play against Golden State on Friday.\n\nUP NEXT\n\nNets: Host Oklahoma City on Thursday.\n\nBulls: Host Golden State on Friday.\n\n------",
  "tags_rule": [
    "InjuryReport",
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.195269",
  "pipeline_version": "v1"
}