{
  "game_id": "0021700735",
  "espn_id": "400975481",
  "date": "Jan 28, 2018",
  "matchup": "TOR vs. LAL",
  "headline": "VanVleet scores career-high 25, Raptors beat Lakers 123-111",
  "cleaned_body": "TORONTO --  Raptors guards DeMar DeRozan and Kyle Lowry are bringing their coach along to next month's NBA All-Star Game.\n\nFred VanVleet scored a career-high 25 points, DeRozan had 19 and the Raptors beat Los Angeles 123-111 on Sunday to snap the Lakers' winning streak at four games.\n\nThe victory guarantees the Raptors (33-15) will have the second-best record in the Eastern Conference through Feb. 4, meaning Dwane Casey will coach Team LeBron at next month's All-Star Game in Los Angeles. Brad Stevens, whose Boston Celtics lead the Eastern Conference, is ineligible after coaching last year's game.\n\nLowry showered Casey with water during a postgame celebration inside the Raptors' locker room. Casey said it was an \"honor\" to represent the East on All-Star weekend.\n\n\"To put a light on our program and see what we're doing is the most important thing,\" Casey said.\n\nCasey is the first coach in Raptors history to earn the All-Star spot.\n\n\"It's something that, for the last couple of years, we've been fighting for,\" DeRozan said. \"What an accomplishment. You want to be able to see your coaching staff get in there and be able to coach an All-Star Game.\"\n\nDeRozan, however, will be playing for Team Steph, pitting him against his own coach.\n\n\"I wish he was coaching us,\" DeRozan said. \"I'm going to talk crazy trash to him, for sure.\"\n\nLowry had 14 points and 11 rebounds, and Jonas Valanciunas added 13 points and 10 boards as the Raptors won their seventh straight over the Lakers.\n\n\"We just didn't play well enough to win against a team like this on the road,\" Lakers coach Luke Walton said. \"We didn't make shots. You've got to really go after it and get it. For whatever reason we didn't play with that edge tonight and they made us pay for it.\"\n\nToronto is 18-4 at home this season, the second-best mark in the NBA behind San Antonio (20-4).\n\nC.J. Miles scored 13 points, Serge Ibaka had 11 and Delon Wright 10.\n\nJulius Randle had 17 points and 10 rebounds, and Jordan Clarkson scored 17 for the Lakers. Kentavious Caldwell-Pope added 16 points, Larry Nance Jr. had 15 and Brandon Ingram 14.\n\nRandle and Valanciunas were each issued a technical foul after Valanciunas shoved Randle late in the second, upset after being elbowed in the face when Randle drove to the basket on the previous possession. An angry Randle got up and approached Valanciunas, but teammates and referees stepped between them.\n\nTIP-INS\n\nLakers: G Alex Caruso scored a career-high 11 points. ... F Nigel Hayes, whose 10-day contract expired following the game, will not be offered a new contract.\n\nRaptors: Toronto has not lost to the Lakers since a 129-122 overtime defeat at Los Angeles on Nov. 30, 2014. ... Eight different Raptors made at least one 3-pointer. ... DeRozan had a game-high seven assists. ... Former Toronto Blue Jays star Joe Carter attended the game.\n\nLATEST ON LONZO\n\nLakers rookie guard Lonzo Ball missed his seventh straight game. The team said Saturday that Ball has been diagnosed with a sprained medial collateral ligament in his left knee. Walton said Ball will participate in an optional workout Monday. \"I'll be interested to be in there and watch him work out and see how he's moving,\" Walton said. \"He hasn't started ramping it up as far as the explosive or contact type of work yet.\"\n\nJUST A SECOND\n\nThe Lakers used six offensive rebounds to score 11 second-chance points in the first quarter. They finished with 17.\n\nUP NEXT\n\nLakers: Visit Orlando on Wednesday, their third stop on a season-long five-game road trip. It's the first meeting of the season between the teams.\n\nRaptors: Host Minnesota on Tuesday. Toronto has won 13 straight home games against the Timberwolves.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "CareerHigh",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.953044",
  "pipeline_version": "v1"
}