{
  "game_id": "0021701133",
  "espn_id": "400975879",
  "date": "Mar 30, 2018",
  "matchup": "OKC vs. DEN",
  "headline": "Millsap scores 36 as Nuggets top Thunder 126-125 in OT",
  "cleaned_body": "OKLAHOMA CITY --  Denver coach Michael Malone said before the game that Paul Millsap was improving, but it wouldn't be fair to expect the veteran forward to be as good as he was before a left wrist sprain cost him 44 games.\n\nMillsap was actually better on Friday night.\n\nHe scored a season-high 36 points to help the Nuggets beat the Oklahoma City Thunder 126-125 in overtime.\n\nMillsap made 13 of 18 field goals and grabbed nine rebounds.\n\n\"These past few days, it's been feeling pretty good, so I've been able to drive left a lot and got to get back in and play my game,\" Millsap said. \"Pretty much, that's some of it. The rest of it was Coach calling plays and my teammates giving me the ball.\"\n\nNikola Jokic had 23 points and 16 rebounds, and Will Barton added 18 points for the Nuggets, who were 2-4 on their road trip and desperately needed the win for the Western Conference playoff race. Denver entered the night two games out of the No. 8 spot.\n\n\"It's a good win, especially with how we executed down the stretch,\" Millsap said. \"The way we did it was very special because we have been struggling on this road trip. To get a win like this against a really good team and beating them in the fashion that we did you know it was special to us.\"\n\nOklahoma City's Russell Westbrook had 33 points, 13 assists and nine rebounds, but he missed what would have been a game-winning 3-pointer at the end of regulation. Carmelo Anthony scored 23 points and Jerami Grant added 16 for the Thunder, who have lost four of five. Those losses have been by a combined nine points, with none by more than four.\n\n\"I wouldn't use the word frustration, but I would -- certainly, I think there's been things as it relates to execution,\" Thunder coach Billy Donovan said.\n\nDenver led 122-121 in overtime and had the ball before the Thunder tied up Jamal Murray and forced a jump ball with 15 seconds left. The Thunder got possession on the jump ball, but Denver's Mason Plumlee blocked Grant's layup.\n\n\"I felt like I had the chance to contest it without fouling and not put them back on the free throw line, so we get the block and the rebound and it was all good,\" Plumlee said.\n\nMillsap made two free throws at the other end to put Denver up 124-121.\n\nOklahoma City's Paul George was fouled with 4.6 seconds left. He made the first free throw, then the Thunder were called for a lane violation on George's intentional miss. Barton made two free throws on the other end to seal it.\n\nMillsap scored 15 points in the first half to give Denver a 62-58 lead. The Nuggets scored the first six points of the second half, including two buckets by Millsap, to go up 10. The Nuggets expanded their lead to 15 later in the quarter and took a 92-79 advantage into the fourth.\n\nOklahoma City's reserves helped the Thunder climb back into the game. Westbrook tied the game at 94 on a drive when the Nuggets were called for goaltending, and the Thunder finally took a 99-97 lead on a 3-pointer by Grant.\n\nBarton made a layup with nine seconds left to tie the score at 114. Westbrook missed a deep three in the closing seconds, and the game went to overtime.\n\nDonovan said he wanted Westbrook to drive to the hoop at the end of regulation, but it wasn't available. Westbrook has been one of the most effective drivers and free-throw shooters in the league in recent years, but the 29 percent 3-point shooter chose to launch from 27 feet.\n\n\"I thought he created a good shot for himself,\" Donovan said. \"I didn't think he took a bad shot. He had an opportunity to make it. He didn't make it.\"\n\n---\n\nTIP-INS\n\nNuggets: Shot 52.2 percent in the first half. ... F Wilson Chandler left the game with a nose contusion. ...  G Gary Harris missed his seventh straight game with a right knee strain. Malone said he expects Harris to miss at least another week.\n\nThunder: Opened the game with a 9-0 lead. ... Made just 15 of 26 free throws. ... Made a franchise-record 20 3-pointers.\n\nQUOTABLE\n\nMalone: \"They went on a big run in the fourth quarter, but we answered and we responded and made enough plays to get a hell of a win for us. Proud of all of our guys.\"\n\nSTAT OF THE NIGHT\n\nThe Thunder, who entered the game fifth in the league in rebounding and first in offensive rebounding, were outrebounded 58-50.\n\nUP NEXT\n\nThe Nuggets host the Milwaukee Bucks on Sunday.\n\nThe Thunder play at the New Orleans Pelicans on Sunday.\n\n---\n\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.748677",
  "pipeline_version": "v1"
}