{
  "game_id": "0021400879",
  "espn_id": "400579171",
  "date": "Mar 01, 2015",
  "matchup": "POR @ SAC",
  "headline": "Lillard, Aldridge leads Blazers past Kings for 3rd in a row",
  "cleaned_body": "SACRAMENTO, Calif. --  Damian Lillard has a knack for playing well in the fourth quarter and demonstrated it again Sunday in helping the Portland Trail Blazers hold off the Sacramento Kings.\n\nLillard scored nine of his 31 points in the fourth quarter, LaMarcus Aldridge had 26 points and 15 rebounds, and the Blazers beat the Kings 110-99 for their third straight victory.\n\nWith Portland clinging to a one-point lead early in the fourth quarter, Lillard quickly responded with a 3-pointer and followed with a jumper to help the Blazers pull away from the feisty Kings, who trailed by 10 entering the fourth. Portland closed the game with a 10-3 run.\n\nLillard had his fingerprints all over this game, contributing seven assists, four rebounds and hitting three 3-pointers. He made 11 of 20 shots, all six free throws, and scored 19 second-half points.\n\n\"Particularly in the first half, Damian really controlled the game,\" Portland coach Terry Stotts said. \"When we needed scoring in the second half he did that, too. He really managed the game well.\"\n\nIt was a rare road win for Portland, only its second victory in 11 road games since Jan. 14.\n\n\"It's just been one of those things, the road losses,\" said Wes Matthews, who had 17 points. \"We have learned from it. This time of year you need to get every win you can. Every win is a big one.\"\n\nRobin Lopez had 15 points and eight rebounds for Portland, which is 14-13 on the road. The Blazers made 10 3-pointers, shot 49 percent and outrebounded the Kings 43-33 in winning for the fifth time in seven games.\n\nRudy Gay scored 24 points and Derrick Williams had 13 of his 18 in the fourth quarter for the Kings. Andre Miller had 12 points and 10 assists.\n\nPressuring the Blazers early in the fourth quarter, the Kings opened with a 13-4 run, cutting the lead to 89-88 on a 3-pointer by Gay.\n\nThe Blazers committed some costly turnovers throughout the game. Sacramento led in fast-break points 24-7 and forced the Blazers into 17 turnovers, which led to 23 points.\n\n\"We played sloppy at times and they turned up their defense on us in the second half,\" Matthews said. \"George Karl is one of those coaches who stresses aggressiveness and we had too many turnovers.\"\n\nKings leading scorer and rebounder DeMarcus Cousins missed his second straight game with a sprained left ankle and bruised left hip.\n\nThe Kings are 2-12 when Cousins doesn't play this season.\n\nLillard made a pair of 3-pointers and scored 10 points in the third quarter to send Portland to the fourth with an 85-75 lead. The Kings had no answers for Lillard in the fourth quarter, either.\n\n\"Lillard got into a rhythm in the fourth quarter. I think we double LaMarcus a couple of times and the guys hit a couple of 3s,\" Miller said. \"But the main thing is that we didn't get any stops. The fourth quarter is about getting stops and their All-Star players made plays.\"\n\nWilliams scored eight points in the first 3 1/2 minutes of the final period as the Kings cut it to 89-88. Lopez scored six points to help keep the Blazers ahead and a driving layup by Lillard gave Portland a 108-97 lead with under a minute to play.\n\n---\n\nTIP-INS\n\nTrail Blazers: Portland scored 14 unanswered points in the first quarter and led 34-23. ... Lopez was called for a flagrant 1 foul for pushing Reggie Evans to the ground underneath the Kings' basket late in the second quarter.\n\nKings: Karl got a technical for arguing an offensive foul against Miller in the first quarter. ... Darren Collison missed his ninth straight game. He is scheduled to have surgery Tuesday to repair a \"core muscle injury\" and could be lost for the season.\n\nUP NEXT\n\nBlazers: Visit the Los Angeles Clippers on Wednesday.\n\nKings: Visit New York on Tuesday.",
  "tags_rule": [
    "InjuryReport",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.084636",
  "pipeline_version": "v1"
}