{
  "game_id": "0021301121",
  "espn_id": "400489994",
  "date": "Apr 02, 2014",
  "matchup": "MIL @ MIA",
  "headline": "LeBron James delivers as Heat turn away Bucks, stay atop East",
  "cleaned_body": "MIAMI -- LeBron James is dealing with a few aches and pains, which obviously is not the best news for the Miami Heat with two weeks left in the regular season.\nCome game time, though, nothing seems to be ailing him.\nBringing the crowd out of its seats with a pair of highlight-reel dunks in the first half, then drilling a deep 3-pointer to end the third quarter, James was his typical effective self on Wednesday night. He led Miami with 17 points, and the Heat stayed atop the Eastern Conference with a wire-to-wire 96-77 win over the Milwaukee Bucks.\n\"If I feel like I can give something, I've got to be out there for my teammates,\" James said. \"It's my obligation to be out there for them. I'm dealing with a few things, but for me to sit out, I have to be dealing with a lot more.\"\nChris Bosh scored 15 and Mario Chalmers scored 14 for the Heat.\n\"I like our effort,\" Bosh said. \"We just have to take care of business and do what we're supposed to do.\"\nRamon Sessions scored 19 points for Milwaukee, which got 14 from Jeff Adrien, 11 from Brandon Knight and 10 from John Henson. Zaza Pachulia grabbed 16 rebounds in 26 minutes for the NBA-worst Bucks, who have now had 11 games this season in which they never led.\n\"Getting down against a team like that is definitely tough because they continue to play hard,\" Knight said. \"They don't let up and they don't make many mistakes. ... Credit to them but we didn't execute defensively and we didn't play hard enough.\"\nThe Bucks fell to 14-61 with seven games remaining and are now only one loss away from tying the franchise record for most defeats in a season.\n\"As we wind this thing down with seven games to go, the thing I want is see them compete,\" Bucks coach Larry Drew said. \"We're dealing with adverse times. This is really a good time to see what guys are truly made of.\"\nJames said he doesn't currently plan on sitting out any of Miami's final eight games, and Heat coach Erik Spoelstra said he probably wouldn't even think about any strategy to get him some rest for at least another week -- a stance that can't come as a surprise, considering the East No. 1 seed is hardly secure. With the win, Miami (52-22, .703) remained percentage points ahead of Indiana (53-23, .697) in the East race.\nThe Pacers beat Detroit 101-94 earlier Wednesday.\n\"It's tempting to start to look ahead. We're only two weeks away,\" Spoelstra said. \"But there's so much basketball left in these two weeks. And it is very compelling at this time of year, and we are trying to accomplish some things. So as guys start to get back into the lineup we want to take a step forward as a group. And there's a process to that.\"\nAt some point, that process will presumably include getting Dwyane Wade, Ray Allen and Greg Oden back into the lineup. Wade missed his 23rd game of the season, his fourth straight with a hamstring problem. The Heat are 11-1 in the last 12 games that Wade has missed.\nAllen has been sidelined by a flu bug that struck his entire family, though he's nearing a return. Oden has been sidelined by back spasms, with Spoelstra saying he's also close to getting back.\n\"We're sharpening our swords,\" Spoelstra said.\nMilwaukee opened the fourth quarter with six straight points, cutting Miami's lead to 14 and getting the Heat to call time-out.\nWhatever doubt existed at that point, if any, didn't last long.\nNorris Cole snapped Miami's scoreless drought with a beat-the-shot-clock 3-pointer as he was leaning to his right with 8:35 left, Rashard Lewis swished another 3 on the next Heat possession to restore the 20-point cushion, and that basically ensured James would remain in his warmups for the rest of the evening.\nGame notes\nThe Bucks led the Heat for a total of 2 minutes, 21 seconds this season -- in three games. ... Miami's Udonis Haslem earned a technical late in the half after a bit too much physicality with Adrien under the basket. Haslem also got his 1,500th career offensive rebound. ... The Heat moved to 30-6 at home, the seventh time in franchise history they've won that many in Miami. ... Milwaukee's O.J. Mayo missed the game with an ankle injury.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.892447",
  "pipeline_version": "v1"
}