{
  "game_id": "0021400748",
  "espn_id": "400579040",
  "date": "Feb 06, 2015",
  "matchup": "LAL @ ORL",
  "headline": "Harris scores 34, Magic  down Lakers 103-97 in overtime",
  "cleaned_body": "ORLANDO, Fla. --  After a half-season of futility culminated in a coaching change, the Orlando Magic returned to their home floor in desperate need of a victory.\n\nIt took some extra work, but a matchup with the woeful Los Angeles Lakers turned out to be the perfect remedy.\n\nTobias Harris had a career-high 34 points and the Magic snapped a 10-game losing streak with a 103-97 overtime victory over the Lakers on Friday night in James Borrego's debut as interim coach.\n\n\"It was a huge win for J.B; I think everybody was pulling for him in his first game,\" Harris said. \"He deserves it more than anybody. ... That's the challenge, our task right now: Can we turn it around or will we just lie down and roll over ourselves? I thought this was a step in the right direction.\"\n\nNik Vucevic added 25 points and 13 rebounds to give the Magic their first win at home since Jan. 14. Borrego took over for Jacque Vaughn, who was fired on Thursday.\n\nThe Lakers led by as many as 14 points, but were outscored 22-13 in the fourth quarter. Orlando then dominated in overtime, using turnovers to get easy baskets.\n\nRyan Kelly led Los Angeles with 20 points, connecting on five 3-pointers. Carlos Boozer, Jordan Clarkson and Jeremy Lin all finished with 14. It was the Lakers' second straight overtime loss.\n\n\"They were much more aggressive (and) more physical than we were,\" Lakers coach Byron Scott said. \"I thought we just played not to lose. We were on our heels and it looked like we were scared.\"\n\nBorrego shook things up immediately with a brand new starting lineup and a promise to inject added focus on defense.\n\nIt didn't show early, and taking care of the ball turned out to a bigger issue for the Magic, forcing them to play from behind for most of the night. The Magic had 19 turnovers for the game, leading to 27 Lakers' points.\n\nBut after battling back to send the game to overtime, Orlando finally picked things up on the defensive end, using blocks to gain extra possessions.\n\nIt culminated in a steal and dunk by Victor Oladipo that gave Orlando a 99-94 lead, forcing the Lakers to scramble and foul in the final minute.\n\n\"It's exhausting,\" Borrego said. \"I have a much deeper appreciation for what head coaches do, the amount of mental stress as well as physical stress, the amount of decisions you have to make, the management of the game. The emotion was the moment, the fight, sticking with the guys. They really pulled us through tonight.\"\n\nTIP-INS\n\nLakers: Were outscored 58-30 in the paint. ... Shot 60 percent (6 of 10) from the 3-point line in the first half, but just 31 percent (5 for 16) in the second.\n\nMagic: Snapped a streak of 14 straight games in which opponents had scored 100 or more points. ... Improved to 2-0 in overtime games this season. ... Called for a technical foul in the fourth quarter for having six players on the floor. ... The Friday starting unit of Harris, Channing Frye, Vucevic, Oladipo and Elfrid Payton was the 14th different one Orlando has used this season.\n\nPARTING SHOTS, ADVICE\n\nBorrego said he's received numerous texts from his basketball mentors since being named interim coach. He also said that he had spoken with Vaughn since he was dismissed on Thursday. \"He said `Go get 'em.\" Borrego said. \"He's a mentor of mine. He's a friend of mine, and I will continue to reach out to him and talk. That line is still open for us.\"\n\nUP NEXT\n\nLakers: Conclude a four-game road trip Sunday at Cleveland.\n\nMagic: Host the Bulls on Sunday.\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "tags_rule": [
    "Streak",
    "PhysicalGame",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.775592",
  "pipeline_version": "v1"
}