{
  "game_id": "0021401117",
  "espn_id": "400579409",
  "date": "Apr 01, 2015",
  "matchup": "HOU vs. SAC",
  "headline": "James Harden's career-high 51 help Rockets nullify Kings' big rally",
  "cleaned_body": "HOUSTON -- James Harden continues to strengthen his case for the MVP award, and is forging a place as one of the best players in Houston Rockets history in the process.\nHe had a career-high 51 points, and the Rockets squandered a huge early lead but held on for a 115-111 win over the Sacramento Kings on Wednesday night.\nThe performance surpassed Harden's previous career best of 50 points, which came on March 19. It's his 33rd 30-point game this season and the ninth time he's scored 40 this season, which both lead the NBA.\nHe's the first player in the history of a franchise with Hall of Famers Hakeem Olajuwon and Moses Malone to have two 50-point games in a season. There have only been 10 in team history.\n\"He finds a way to wow our team every time he goes out there,\" Houston's Trevor Ariza said. \"He's just so crafty and he can score so many different ways. It's definitely fun to watch.\"\n\nHouston was up by nine with about eight minutes left when Sacramento used a 9-2 spurt to get within 104-102 with 5 1/2 remaining. An 8-0 run by Harden, which he capped with a 3-point play, pushed the lead to 112-104.\nFour straight points by the Kings cut the lead to four with less than a minute left, but they didn't score after that.\nDeMarcus Cousins led the Kings with his second career triple-double with 24 points, 21 rebounds and 10 assists after missing Monday's game to rest. He also tied a career best with six blocks.\n\"I've never coached a guy that can put up so many things into a game,\" Kings coach George Karl said. \"He has a triple-double, but really has a quadruple-double because he had six blocks, three steals and at least one or maybe two charges. There are another 10 possessions he gave us because of his defensive abilities.\"\nHarden, who scored 17 points in the third quarter, had 49 points before knocking down a pair of free throws with less than two minutes left to eclipse his previous high-point game.\nThe Rockets led by as many as 19 points in the first half before Sacramento rallied to take the lead early in the third quarter.\nHarden, who is second in the league in scoring, tied a career best by making eight of nine 3-pointers, and Ariza had six and finished with 22 points.\n\"Shooting 8-of-9 from 3 is hard to do,\" coach Kevin McHale said. \"It's hard to do when you're by yourself, much less in a game when everything is contested.\"\nBoth teams played without a star. The Rockets were missing Dwight Howard, who isn't playing both games of back-to-backs since returning from a two-month absence with swelling in his right knee. He'll play Thursday night at Dallas.\nSacramento's Rudy Gay, who is averaging 20.9 points a game, sat out after getting a concussion Monday night\nHarden said he doesn't change the way he plays when Howard isn't on the floor.\n\"If the attack is there, then I take it,\" he said. \"If not, I find the assist, find one of my teammates open and I'll pass the ball. Similar to every single game I play in.\"\nThe game was tied at 70 after a 3-pointer by Ben McLemore with about 7 minutes left in the third quarter. Houston used a 9-2 run to take a 79-72 lead. Ray McCallum's 3-pointer soon after that got Sacramento within 5, before Harden took over.\nHe scored their next 11 points, while the Kings managed just one basket, to extend the lead to 93-79 with two minutes left in the quarter.\nHouston led by five early in the third quarter before Sacramento scored six straight points, with four from Cousins, to take a 61-60 lead.\nThe Rockets were up by 19 after opening the second quarter with an 11-0 run. The Kings got going after that, using a 14-2 spurt, punctuated by a dunk by Cousins, to cut the lead to 48-41 midway through the quarter.\nA 3-pointer by Harden a couple of minutes later made it 54-45, but Sacramento scored the next eight points to get within 54-53 two minutes before halftime.\nThe Rockets led 58-55 at halftime.\nTIP-INS\nKings: The Kings aren't sure when Gay will return. He must pass the league-mandated concussion protocol before playing again. ... The 10 assists by Cousins tied a career high.\nRockets: Joey Dorsey started in place of Howard and seven points and 11 rebounds. ... Jones returned on Wednesday after missing six games with a partially collapsed lung and tied a career high with seven blocks.\nQUOTABLE\nCousins on Harden's play this season: \"James is a tough guy to guard, period. Everybody knows that. I don't think the word `stop' is a word you can use when you're talking about James Harden.\"\nUP NEXT\nKings: Host New Orleans on Friday.\nRockets: Visit Dallas on Thursday.",
  "tags_rule": [
    "LateCollapse",
    "TripleDouble",
    "CoachComment",
    "EarlyRun",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Collapse",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.840975",
  "pipeline_version": "v1"
}