{
  "game_id": "0021400551",
  "espn_id": "400578843",
  "date": "Jan 10, 2015",
  "matchup": "DET vs. BKN",
  "headline": "Brandon Jennings' 2nd-half effort helps Pistons deal Nets another loss",
  "cleaned_body": "AUBURN HILLS, Mich. -- The Pistons and Nets were both out of gas by the end of Saturday night's game.\nDetroit was just able to coast a little further.\nPlaying for the fourth time in five nights, the Pistons put together an 8-0 run in the final three minutes to beat the Nets 98-93. The Nets, who were in action for the fifth time in seven days, had two key turnovers in that stretch.\n\"Those are the type of games that get people talking about changing the NBA schedule,\" said Pistons coach Stan Van Gundy. \"We didn't have any energy and neither did they, and this is the kind of game you get in that situation. You just keep trying to get good shots and hope something goes in, even though you don't have any legs, and you keep working on defense.\"\nDetroit's confidence also may have helped down the stretch, something that would have been hard to imagine a month ago. The Pistons have won eight of nine since releasing Josh Smith after a December loss to the Nets, while Brooklyn has lost five in a row.\n\"We played good defense, but we had 10 turnovers in the second half,\" said Nets coach Lionel Hollins. \"Every game, the turnovers are hurting us and the missed shots are hurting us. We had shots tonight that would have put us ahead or further ahead, and we couldn't hit them.\"\nBrandon Jennings had 20 points despite going scoreless in the first half, and Detroit also got 16 points and 17 rebounds from Greg Monroe and 14 points and nine boards from Andre Drummond.\nJoe Johnson led the Nets with 17 points, while Brook Lopez had 11 points and 15 rebounds.\nThe Pistons set a franchise record with 43 3-point attempts in Friday's 106-103 loss to Atlanta. The previous high was 33. And it didn't take long for Saturday's game to turn into an outside-shooting duel.\nThe teams combined to go 10-for-33 from outside the arc in the first half, which ended at 47-47. Johnson and Kyle Singler both went 3-for-4 on threes in the half, while the rest of their teammates struggled.\n\"There was a little bit of trying to get a rhythm and a flow, but I thought we hit our stride in the fourth quarter,\" Singler said. \"This was big, because Coach told us after last night that we weren't going to fall back into losing a game and going backward.\"\nJennings scored 13 points in the third, but the Pistons still needed a buzzer-beating dunk by Drummond to take a 74-69 lead into the fourth.\nWith both teams continuing to bomb away from outside with little success, the game remained close until the Pistons turned a pair of turnovers into fast-break baskets. Jennings then hit a 3-pointer to make it 91-84 with 2:30 to play.\nMason Plumlee was called for a charge at the other end, and Greg Monroe's layup gave Detroit a nine-point lead, its biggest of the game. After that, the only excitement was Lopez's late 3-pointer -- the first of his 369-game career.\n\"We gave ourselves an opportunity, and we just have to keep going,\" Lopez said. \"We know what this league is like.\"\nTIP-INS\nNets: Kevin Garnett returned to the lineup after resting Friday night in a loss to Philadelphia. However, he finished with only two points in 16 minutes. ... Lopez was 0-for-9 on 3-pointers before hitting the meaningless shot Saturday.\nPistons: Drummond played 28 minutes, one night after sitting out most of Friday's loss due to an illness. ... The Pistons have taken 76 3-pointers in the last two games, making 24 of them. They have taken 33 or more threes five times in franchise history -- all this season.\nUP NEXT\nNets: Host the Rockets on Monday.\nPistons: Visit the Raptors on Monday.",
  "tags_rule": [],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.838334",
  "pipeline_version": "v1"
}