{
  "game_id": "0021700700",
  "espn_id": "400975446",
  "date": "Jan 23, 2018",
  "matchup": "LAL vs. BOS",
  "headline": "Kuzma gets 28, leads Lakers past rival Celtics 108-107",
  "cleaned_body": "LOS ANGELES --  Kyle Kuzma scored 17 points in the fourth quarter, showing off a spectacular array of big shots and slick passes.\n\nAnd if Boston's Marcus Smart hadn't missed a 3-pointer at the buzzer, it still wouldn't have been enough for a win because the Los Angeles Lakers couldn't hit their free throws down the stretch.\n\n\"That's why we've got practice tomorrow,\" Kuzma said with a grin.\n\nThe Lakers still have much to learn, but they took another major step with a victory in this hallowed NBA rivalry.\n\nKuzma scored 28 points and the surging Lakers sent the Celtics to their fourth consecutive loss, 108-107 Tuesday night.\n\nJordan Clarkson scored 22 points in the sixth consecutive home win by the Lakers, who have won three straight and seven of nine overall during their best stretch of the season.\n\nKuzma hit five 3-pointers and dominated down the stretch, yet Los Angeles nearly gave it away by missing 10 of its 17 free throws in the fourth quarter, including four in the final 20 seconds. The Lakers are the NBA's worst team at the free-throw line and also at the 3-point line, where Kuzma's teammates were a combined 2 for 19 -- which made this win all the more improbable to coach Luke Walton.\n\n\"I have confidence that those guys that missed them tonight will make them in the future,\" Walton said. \"But hopefully we can remedy that sooner rather than later.\"\n\nKyrie Irving scored 33 points for the Eastern Conference-leading Celtics, who opened a four-game road trip by extending their longest losing streak in nearly two years. Smart added 22 points and led the Celtics back.\n\nKentavious Caldwell-Pope missed two free throws for Los Angeles with 5.7 seconds left, but Smart's final miss over Caldwell-Pope's defense allowed Los Angeles to snap a four-game losing streak against Boston.\n\n\"It was a great game for us to learn from,\" Irving said. \"Minor details, you know? Getting offensive rebounds and blocking out. Taking opportunities to force them into tough shots.\"\n\nIrving led the Celtics back within two points late, but Kuzma and Julius Randle came up with big baskets on offensive rebounds. Smart then hit two free throws for Boston with 19.2 seconds left after Josh Hart missed two for LA, trimming the lead to 106-105.\n\nClarkson hit two free throws, and Terry Rozier hit a twisting layup with seven seconds left before Caldwell-Pope's misses.\n\nTIP-INS\n\nCeltics: Al Horford returned with 13 points and 12 rebounds after missing the last game in the concussion protocol after taking an elbow to the head. ... Boston beat the Lakers 107-96 on Nov. 8.\n\nLakers: Caldwell-Pope (right heel) and Brandon Ingram (sprained left ankle) played after being questionable before game time. Ingram had seven points on 2-for-11 shooting. ... Kuzma has 15 20-point games this season, the most by a Lakers rookie since Eddie George in 1995. ... Fans near courtside included Ryan Leaf, Dodgers stars Kenley Jansen and Yasiel Puig, and comedian Nick Kroll.\n\nHAYWARD HERE\n\nGordon Hayward was with the Celtics after traveling to Los Angeles last week. He will stay in town for the next 7-10 days to continue his rehabilitation from his horrifying left ankle injury just five minutes into the season. Boston coach Brad Stevens said the move is designed \"just to mix it up\" during Hayward's extensive rehab, which is still proceeding on schedule. Stevens said Hayward could begin traveling with the team full-time by early March as he continues to work toward a return. Until then, he'll watch practice from the sidelines while staying as stationary as possible. \"He's a really good spot-up shooter,\" Stevens said with a grin.\n\nKUZMAGIC\n\nKuzma, the Lakers' impressive rookie forward from Utah, had his best offensive game since Christmas. He put the Lakers ahead during a 3  1/2-minute stretch of the fourth quarter with 13 points and a behind-the-back assist to Larry Nance Jr. for a dunk that brought Staples Center to its feet. He added four rebounds and three assists without and turnover and did it all in less than 27 minutes of play. \"His fourth quarter was incredible,\" Walton said.\n\nBALL OUT\n\nLonzo Ball missed his fifth consecutive game with a sore left knee for the Lakers, but they've developed a solid offensive approach in the absence of the rookie point guard. Replacements Tyler Ennis and Alex Caruso contributed little offensively, but Clarkson had another outstanding playmaking game, and Randle contributed 14 points and 14 rebounds.\n\nUP NEXT\n\nCeltics: Stay in LA to face the Clippers at Staples Center on Wednesday night.\n\nLakers: At the Chicago Bulls on Friday night to open a five-game road trip. LA plays 11 of its next 14 on the road.\n\n---\n\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.260988",
  "pipeline_version": "v1"
}