{
  "game_id": "0021300996",
  "espn_id": "400489869",
  "date": "Mar 17, 2014",
  "matchup": "CHA vs. ATL",
  "headline": "Hawks continue dominance of Bobcats 97-83",
  "cleaned_body": "CHARLOTTE, N.C. --  Paul Millsap thinks the Atlanta Hawks finally have things headed in the right direction.\n\nAfter a brutal stretch in which they could do little right and lost 14 of 15 games, the Hawks have suddenly battled back to win four straight, including a 97-83 victory over the Charlotte Bobcats on Monday night.\n\nThe win pulled the Hawks to within 1 1/2 games of the Bobcats for the seventh spot in the Eastern Conference playoff race and snapped Charlotte's eight-game home winning streak.\n\n\"It was probably the best second half we have played all year,\" Millsap said. \"Our intensity was there.\"\n\nThat's exactly what coach Mike Budenholzer has stressed to his players in practice in recent weeks.\n\nApparently his guys were listening.\n\nThe Hawks limited the Bobcats to 31 points in the second half on 29 percent shooting from the field.\n\n\"I think we have been talking about improving our defense going down the stretch here,\" Budenholzer said. \"The activity and the effort and the commitment on the defensive end in the second half allowed us to beat a very, very good team tonight. That's something that we want to continue to build on and continue to improve as we go down the stretch here.\"\n\nMillsap scored 17 of his team's 19 points during one stretch at the end of the second quarter and the beginning of the third. Charlotte took an eight-point lead into halftime, but was outscored 30-16 in the pivotal third quarter.\n\n\"I was just being aggressive and attacking the basket,\" Millsap said. \"I made a few layups and that opened the 3-point shot. We made a few threes.\"\n\nThe Hawks were 13 of 34 from 3-point range and showed good ball movement throughout the game, repeatedly getting open looks at the basket.\n\nSaid Kyle Korver: \"We had a tough February, but we kept fighting.\"\n\nThe Bobcats had won four straight games coming in, but stumbled in an effort to get back to .500 for the first time since Nov. 23.\n\nKemba Walker led the Bobcats with 20 points and seven assists.\n\nAl Jefferson, who was selected the Eastern Conference Player of the Week on Monday, had 16 points and 12 rebounds for his 30th double-double of the season, but was just 6 of 15 from the field. It was only the second time in the last 10 games he's been held to fewer than 20 points.\n\nThe Hawks did a good job of forcing Jefferson to set up further from the basket than he likes and also doubled down when needed.\n\n\"It takes effort and the effort was there,\" Millsap said. \"Guys had tough jobs coming in knowing they had to help and then pop out and get the 3-point shooters.\"\n\nIt was Atlanta's 11th straight win over Charlotte.\n\nPero Antic had 11 points and 10 rebounds and DeMarre Carroll scored all nine of his points in the fourth quarter to help the Hawks open an 18-point lead.\n\nThe Bobcats shot just 4 of 19 from the field in the third quarter and watched a six-point halftime evaporate. They never mounted a serious threat in the fourth quarter.\n\nCarroll made sure there was no comeback, with a pair of dunks and a 3-pointer.\n\nThe Bobcats (33-35) were looking to tie a franchise record with their ninth straight win at home, but failed to put up much of a fight in a sluggish second half. For the second straight game, the Bobcats struggled on offense, looking out of sync and taking poor shots.\n\nJefferson said the Bobcats didn't come ready to play.\n\n\"We didn't have the effort on the defensive or the offensive end,\" Jefferson said. \"I just can't give you no other answer than that. They were ready to play tonight.\n\n\"We've just got to be focused and have the energy. We can't make up excuses as far as being back to back or whatever because it's the NBA. We just didn't have the energy. Even when we were up, we just weren't focused.\"\n\nThe Hawks continue to have Charlotte's number. They have defeated the Bobcats three times this season, including a 118-116 home overtime victory on Dec. 28 and now own the head-to-head tiebreaker over the Bobcats. Millsap also led all scorers in the last outing with 33 points and 13 rebounds.\n\n\"We have to be able to handle bumps in the road,\" Bobcats coach Steve Clifford said. \"We're not going to play great every night.\"\n\nGame notes  Millsap scored 20 or more points for the 24th time this season. ... Walker has scored in double-figures 51 times this season for the Bobcats. ... The Bobcats have been thriving in the paint this season, but outscored 38-24 by the Hawks on Monday night.",
  "tags_rule": [
    "DoubleDouble",
    "Streak",
    "CoachComment",
    "MomentumShift"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.674017",
  "pipeline_version": "v1"
}