{
  "game_id": "0021300887",
  "espn_id": "400489760",
  "date": "Mar 02, 2014",
  "matchup": "OKC vs. CHA",
  "headline": "Kevin Durant, Russell Westbrook team as Thunder overwhelm Bobcats",
  "cleaned_body": "OKLAHOMA CITY -- Thunder fans who braved ice, snow and single-digit temperatures got a special treat -- a look at the old Russell Westbrook.\nThe three-time All-Star scored 26 points to lead Oklahoma City past the Charlotte Bobcats 116-99 Sunday night. He was 10-of-12 from the floor in 25 minutes in his fifth game since returning from right knee surgery. He has steadily improved and is looking more like the player he was before he missed 27 games.\n\"He was aggressive all night, playing downhill on the pick and rolls,\" said Thunder forward Kevin Durant, who finished with 28 points. \"He was just great tonight. That was good to see.\"\nWestbrook said he needed time to get comfortable again.\n\"The more I play, the more rhythm I'm able to catch and the more rhythm I'm able to get,\" he said.\nReggie Jackson scored 17 points and Serge Ibaka had 15 points and 10 rebounds for the Thunder, who won their second straight after losing their first three games following the All-Star break. Oklahoma City outrebounded the Bobcats 44-29.\nDurant made just 8 of 24 field goals, but sank all 12 of his free throws. He also had six rebounds and five assists.\n\"I get a lot of shots, man,\" Durant said. \"There's going to be nights when I feel like that. It's a part of the game, and I think that's the beauty of the game -- just trying to fight through the obstacles, do what I can to help my team.\"\nAl Jefferson scored 25 points and Anthony Tolliver added 17 for the Bobcats, who had won four straight before losses to San Antonio and Oklahoma City.\nThe Thunder made 13 of 24 shots in the fourth quarter to outscore the Bobcats 31-18. Charlotte coach Steve Clifford said his team had the wrong mindset to close the game.\n\"I think through three quarters we did a good job, but we came out in the fourth, and again, particularly when they brought their starters back, we just couldn't contain the ball and couldn't keep the ball out of the paint, which has been something we've been good at all year,\" he said.\nWestbrook scored 17 points on 7-for-7 shooting in the first half to help the Thunder take a 61-55 lead at the break.\n\"He set the tone the first half,\" Clifford said. \"He always plays with high energy, and if he's going to make all the shots, then they're going to be hard to beat.\"\nJefferson had 15 points on 7-for-9 shooting. The Bobcats shot 54 percent in the first half, but were outrebounded 20-13.\nThe Bobcats started off hot in the second half. A 3-point play by Gerald Henderson trimmed Oklahoma City's lead to 61-60. The Thunder responded with a 6-0 run, including two putback baskets by Steven Adams, to take a 67-60 lead.\nWestbrook showed some of his explosiveness after a steal. He drove down court, then extended his right arm and elevated for a powerful one-handed throwdown to give the Thunder a 77-67 lead.\n\"Tonight, he was phenomenal,\" Durant said. \"He was great. That dunk capped it off.\"\nThe Bobcats hung tough and trailed just 85-81 at the end of the third quarter. Charlotte cut the deficit to 86-84 early in the fourth quarter, but the Thunder responded with an 8-2 run. A perfectly executed pick-and-roll ended with Durant scoring on a pass from Westbrook, and Ibaka scored on the next possession to give the Thunder a 104-92 lead and put the game out of reach.\nWestbrook, who also had five assists, dominated from the start.\n\"I thought Russell really had a great command of the game,\" Oklahoma City coach Scott Brooks said. \"I think it is good to see him continue to get his game legs under him. I give the staff a lot of credit. They have put him in a position to get better day by day.\"\nGame notes\nOklahoma City general manager Sam Presti announced before the game that Thunder guard Thabo Sefolosha would miss four to six weeks with a left calf strain. Sefolosha left Friday's game against Memphis in the first half and didn't return. ... Several Oklahoma City players, including Durant and Westbrook, traveled to Stillwater, Okla., Saturday night to watch Oklahoma State upset No. 5 Kansas. ... Presti said new acquisition Caron Butler will be with the team Monday after the Thunder signed him Saturday. ... Durant was called for a technical foul in the first quarter after being whistled for a carry and disagreeing with the call.",
  "tags_rule": [
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.120513",
  "pipeline_version": "v1"
}