{
  "game_id": "0022100426",
  "espn_id": "401360250",
  "date": "Dec 15, 2021",
  "matchup": "MEM @ POR",
  "headline": "Desmond Bane scores 23, Memphis beats Trail Blazers 113-103",
  "cleaned_body": "PORTLAND, Ore. -- — Desmond Bane scored 23 points and the Memphis Grizzlies stretched their winning streak to four games with a 113-103 victory over the Portland Trail Blazers on Wednesday night.\n\nDillon Brooks scored 22 points and Steven Adams had 10 points and 14 rebounds for the Grizzlies, winners of nine of their last 10 games.\n\nNorman Powell scored 25 points in Portland's seventh straight loss.\n\n“We've got guys that want to win, guys that make winning plays, and we find a way to win,\" Brooks said. \"Portland had a couple of runs and we withstood them and made our own runs, and we made enough plays to win the game. That win right there comes down to the top guy down to the bottom guy, one through 12.\"\n\nThe teams meet again on Sunday in Memphis.\n\nThe Blazers led by as many as 10 points after taking the lead in the third quarter, but Memphis closed within 82-80 going into the final period and then went on a 14-0 run to go up 94-82.\n\nBrooks' 3-pointer made it 108-96 with 3:44 left and all but sealed the win.\n\n“Kept it pretty close in the third quarter and then we just hit our stride in the fourth quarter,” Grizzlies coach Taylor Jenkins said.\n\nThe Blazers were playing the second of a back-to-back after a 111-107 overtime loss to the Phoenix Suns a night earlier.\n\nPortland has dealt with a spate of injuries. Damian Lillard missed five games with abdomen tendinopathy earlier this month.\n\nHis backcourt partner, CJ McCollum, is currently out with a collapsed lung, but the Blazers reported earlier Wednesday that McCollum had a CT scan on Tuesday and is showing improvement.\n\nHowever, he won't travel with the team for an upcoming two-game trip.\n\n“McCollum will continue his recovery protocol, which includes light conditioning, and will be reevaluated next week, ” the team said in a statement.\n\nJa Morant missed his 10th game for the Grizzlies because of a left knee sprain and the league's COVID-19 health and safety protocols.\n\nMorant  posted to Twitter following the game, writing: “Way to stay locked in & battle back gang. Great team win.”\n\nThe Grizzlies went on a 16-3 run to wrap up the opening quarter with an early 24-19 lead. Memphis stretched it to as many as 16 points before going into the half ahead 55-47.\n\nLillard's deep 3-pointer tied it at 59, then Powell added another 3 and a free throw to put the Blazers in front. Bane's basket briefly gave a 66-65 lead back to the Grizzlies, but it was short-lived.\n\nPowell's two-handed dunk made it 72-66 for the Blazers, but they couldn't maintain the momentum.\n\n“I just felt like at the start of that fourth quarter, they just turned it on, man, from a physicality standpoint,\" Blazers coach Chauncey Billups said. “We ran a few plays, we couldn't get the ball, we couldn't catch it where we wanted to catch it. A lot of that — give them credit.”\n\nJENKINS' LOSS\n\nJenkins said after the game that Wednesday was rough because his father-in-law had passed away. The coach said the team's win was for him.\n\n“Today was a game with a heavy heart for me. I lost my father-in-law today. I know he’s in a better place,\" Jenkins said. \"It was a rough afternoon for me, but being around this group means a lot to me. They infused a very positive, joyful spirit in me.”\n\nTIP INS\n\nGrizzlies: Memphis had won four straight on the road going into their short two-game West Coast trip. ... Dillon Brooks, who played for the Oregon Ducks, was greeted with warm applause when he was introduced as a starter. ... Memphis had six players in double figures.\n\nTrail Blazers: Portland won the first of the four-game series against the Grizzlies this year. ... Portland had 10 first-quarter turnovers for 12 Memphis points. ... Norman Powell briefly left for the locker room after a hard hit in the first half, but he returned.\n\nUP NEXT\n\nThe Grizzlies visit the Sacramento Kings on Friday.\n\nThe Trail Blazers host Charlotte on Friday.\n\n------",
  "tags_rule": [
    "LateCollapse",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Collapse",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.832483",
  "pipeline_version": "v1"
}