{
  "game_id": "0021700736",
  "espn_id": "400975482",
  "date": "Jan 28, 2018",
  "matchup": "OKC vs. PHI",
  "headline": "Westbrook's 37 lead Thunder past 76ers for 8th straight win",
  "cleaned_body": "OKLAHOMA CITY --  The Thunder and Philadelphia 76ers aren't even in the same conference, yet they played as though they were longtime rivals.\n\nRussell Westbrook scored 37 points, Paul George added 31, and Oklahoma City beat Philadelphia 122-112 on Sunday night for its eighth straight victory.\n\nThe game was more intense than usual from the start, with a lot of extra trash talking and bumping. The teams combined for 51 fouls and 61 free throw attempts. It carried over from Oklahoma City's triple-overtime victory in Philadelphia in December.\n\n\"Leading into this game, after a little talk after game one, I think to this game, I kind of was looking forward to it,\" Westbrook said. \"But you know -- Oklahoma City 2-0.\"\n\nWestbrook made just 6 of 20 shots in the first half, when he was knocked to the ground trying to take a charge as Joel Embiid threw down a vicious dunk over him. He was 8 of 13 in the second half and also had 14 assists and nine rebounds.\n\nGeorge shot 9 of 17 a day after being named the All-Star replacement for New Orleans' DeMarcus Cousins. The Thunder are 7-0 when George scores at least 30 points and 11-4 when he scores at least 25.\n\nSteven Adams added 20 points and 13 rebounds for the Thunder. He made 10 of 11 shots for the Thunder and grabbed 10 offensive rebounds.\n\nEmbiid had 27 points and 10 rebounds, and Ben Simmons added 22 points for the 76ers.\n\nIt was a bittersweet day for the Thunder. The team announced Sunday that guard Andre Roberson is expected to miss the rest of the season after having surgery on a ruptured left patella tendon. Roberson, who was a second-team All-Defense selection last season, was injured when his knee buckled and he fell during the third quarter Saturday at Detroit.\n\n\"It's tough,\" Westbrook said. \"Dre is my boy. I love having him on the floor with me, and it's a tough situation for him. We are just going to continue to lift him up and pray for him, keep our spirits high for him and keep this thing rolling.\"\n\nGeorge hit a 3-pointer at the first-half buzzer to trim Philadelphia's lead to 58-57.\n\nA dunk by Simmons put the 76ers up 75-68 early in the third before the Thunder got things going. Oklahoma City went on a 12-0 run, and a reverse layup by Westbrook put the Thunder up 86-79 and forced the 76ers to call timeout. George closed out the surge with a 3-pointer that put Oklahoma City up 10.\n\nThe Thunder led 92-83 at the end of the third. Oklahoma City shot 60 percent from the field in the period and held Embiid to two points.\n\nPhiladelphia left its starters in to start the fourth, and they helped the 76ers take a 98-97 lead early in the quarter.\n\nOklahoma City pulled away late. Westbrook's 3-pointer with just under three minutes to play put the Thunder up seven, and he followed with a jumper to make it a nine-point game with two minutes left.\n\n\"We made runs, they made runs,\" Simmons said. \"But down the stretch, we didn't take care of the ball and execute.\"\n\nTIP-INS\n\n76ers: Embiid picked up his third foul with 8:34 left in the second quarter and the 76ers up 37-36, but he played the rest of the half. ... Shot 50 percent from the field.\n\nThunder: F Patrick Patterson knocked heads with Embiid in the second quarter and left the game because of the blood rule. He returned later. ... Former University of Oklahoma football coach Barry Switzer attended the game. ... Committed just 10 turnovers.\n\nSTAT LINES\n\nGeorge regained the league lead in steals per game. He trailed Milwaukee's Eric Bledsoe heading into the night, but he had four steals to Bledsoe's two on Sunday. George now averages 2.21 while Bledsoe is at 2.195.\n\nQUOTABLE\n\nAdams, on being resilient without Roberson: \"I don't know. I wouldn't give too much credit to it because  it's our job. It's what we have to do. But if you want to give us credit for it, we'll take it.\"\n\nUP NEXT\n\n76ers: Travel to Milwaukee on Monday.\n\nThunder: Travel to Washington on Tuesday.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball .",
  "tags_rule": [
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.478478",
  "pipeline_version": "v1"
}