{
  "game_id": "0021400937",
  "espn_id": "400579229",
  "date": "Mar 08, 2015",
  "matchup": "LAL vs. DAL",
  "headline": "Ellis' big 3rd quarter helps Mavericks beat Lakers 100-93",
  "cleaned_body": "LOS ANGELES -- Monta Ellis had a dreadful time at the offensive end for the Dallas Mavericks in back-to-back road losses against Portland and Golden State, making just seven of 34 shots and scoring a combined 18 points.\nIt all came together Sunday night for the All-Star shooting guard against the Los Angeles Lakers. Ellis shot 12 for 22 and scored 18 of his 31 points in the third quarter to help the Mavs pull out a 100-93 victory.\n\"It's a long season, and sometimes you go through stretches when you just have to stay positive and do the necessary work you need to do to get yourself back on track,\" said Ellis, who shot 5 of 7 from 3-point range. \"The shots were just falling tonight, and my big men did a great job of screening for me so that I could get to my spots and attack the rim.\n\"Sometimes I can be my own enemy when I go to the basket and don't get the foul. Then I get frustrated and lose my game a little bit,\" he added. \"Tonight the biggest thing for me was just to get back to being aggressive -- and if they call it, they call it. If they don't, I continue to attack.\"\n\nDirk Nowitzki had 12 points for the Mavericks, who had lost four of five. They played without point guard Devin Harris for the second straight game because of an injured right hand, but Chandler Parsons returned to the lineup and finished with 11 points and six rebounds in 35 minutes after missing seven games with a sprained left ankle.\n\"Getting Parsons back was a key for us,\" Ellis said. \"His shot wasn't going down, but he played great defense in the second half and made a couple of plays down the stretch to get us over the hump. We needed a win, and the team did a great job of coming together.\"\nThe Mavs are 24-4 against opponents with losing records, but 17-19 against teams above .500. Four of their next five games are against teams with 40 or more wins -- Cleveland, the Clippers, Oklahoma City and Memphis.\n\"The quality of our opponents has gone up in recent weeks, and that makes it harder,\" coach Rick Carlisle said before the game. \"We're just going through a tough period right now. We've missed some of our key guys and there's been a trickle-down effect, which makes it harder on the other guys.\"\nCarlos Boozer had 17 points and eight rebounds off the bench for the Lakers, who have lost five straight and 21 of 25.\nOf the Lakers' 46 losses, 21 have been decided by seven points or fewer.\n\"Same old story -- they turned it up a notch,\" coach Byron Scott said. \"We turned it over a bunch of times, and every shot that we had was under duress. We didn't move the ball as well as we did earlier in the game. Dallas did a real good job of just being aggressive. The bottom line is, they have two or three guys they can go to, and I'm basically searching.\"\nAl-Farouq Aminu scored six points in a 1:36 span and Rajon Rondo added a 17-footer to give the Mavericks a 92-90 edge with 4:12 remaining after they trailed by six on Boozer's reverse layup with 6:36 to play.\n\"You've just got to climb out of the hole,\" Ellis said. \"We did everything we needed to do tonight to get this one. We feel good about ourselves going home for this two-week stretch. Now we'll try to put some wins together.\"\nThe Lakers got only one field goal after the one by Boozer -- a layup by Wayne Ellington at the final horn. Rondo hit a 17-foot bank shot for a 95-90 lead with 2:43 left, and Ellis helped put it away with a 3-pointer and a 21-footer 56 seconds apart.\nTIP-INS\nMavericks: Nowitzki had four rebounds, leaving him 40 shy of becoming the 41st player in NBA history with at least 10,000 in the regular season. \"You're talking about one of the really remarkable careers in NBA history,\" Carlisle said. \"There's never been a 7-foot-1 guy in the history of this league that's played his position the way he's played it at his age, and he's got a lot of good basketball left in him. So we're vigilant about watching his minutes, and he's vigilant about working to keep his body tuned up and ready to play.\"\nLakers: Nick Young missed his seventh straight game because of a sore left knee. \"He still has pain in there and some swelling,\" Scott said. \"It's not going down as quickly as we had anticipated, so we're less optimistic about him coming back anytime soon. And we're not going to rush him back if he's not 100 percent, but it would be good for him to go out on a positive note because he's obviously struggled this year with his shooting. I'm not saying he has anything to prove, but I think it would help his confidence.\" ... The Lakers are 0-7 at home this season against Southwest Division clubs, and 0-14 under those circumstances since Nov. 12, 2013, when they beat New Orleans 116-95.\nUP NEXT\nMavericks: Host Cleveland on Tuesday.\nLakers: Host Detroit on Tuesday.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.490602",
  "pipeline_version": "v1"
}