{
  "game_id": "0021701073",
  "espn_id": "400975819",
  "date": "Mar 22, 2018",
  "matchup": "ORL vs. PHI",
  "headline": "76ers rout Magic 118-98 for fifth straight win",
  "cleaned_body": "ORLANDO, Fla. --  The Philadelphia 76ers keep raising the bar.\n\n\"After last night, knowing we were in fourth position, we wanted to come out and send a message and let everybody know we will go for the home court,\" Joel Embiid said Thursday night after a 118-98 rout of the Orlando Magic.\n\n\"But after this game I kind of have a new goal. I want to get to 50 wins. We've got to keep pushing for that.\"\n\nEmbiid had 17 points and nine rebounds in just 20 minutes and the surging 76ers moved closer to a playoff berth with their fifth straight victory.\n\nErsan Ilyasova scored 18 points, leading six Philadelphia players in double figures as the 76ers (41-30) clinched their first non-losing season in six years. Robert Covington and Marco Belinelli added 15 points.\n\nRodney Purvis came off the bench to score 19 points for the Magic, who have lost eight of nine and dropped to 21-51. Aaron Gordon, the only Orlando starter to score in double figures, had 10 points and 11 rebounds.\n\nEmbiid and J.J. Redick combined for 10 points in a 12-0 run that left the 76ers with a 70-47 lead just before halftime.\n\n\"I think our third period was the thing I was most impressed with,\" said coach Brett Brown. \"We knew with the lead we had built, to be able to maintain that sense of urgency and treat it as an opportunity to build on this lead, we can get some of our high-minute guys some rest.\"\n\nThe Magic's last lead was 14-12 after Nikola Vucevic made a 3-pointer midway through the first quarter. Belinelli scored on an inbound pass play to tie it, then hit a jump shot to put the 76ers ahead to stay. They led by double figures after the first 15 minutes and by 35 at one point, making for another long night for Magic coach Frank Vogel.\n\n\"We all understand the situation and it's not a lot of fun to be part of, but we've got to compete,\" he said. \"We started the game that way, and I felt like we gave in and relented when they made their run. That's why you saw the mass subs.\"\n\nThe 76ers played the fourth quarter without any starters for the second straight night, leaving Ben Simmons with six points, 11 rebounds and 10 assists.\n\nSimmons has nine triple-doubles. Only one player in NBA history has produced as many as 10 triple-doubles in his rookie season. Oscar Robertson had 26 triple-doubles in his rookie season of 1960-61.\n\nTIP-INS\n\n76ers: Their 41st win clinched their first .500 or better finish since 2011-12, the last time they were in the playoffs. ... The five-game win streak is all against losing teams. The 76ers' last eight wins have come over losing teams. . . . The 76ers are 18-0 when holding opponents under 100 points.\n\nMagic: F Jonathan Isaac, who missed 46 games of his rookie season due to an ankle injury, did not play because of a left foot sprain. ... F Jonathon Simmons was out with a right wrist contusion.\n\nWE'RE NO. 4!\n\nBrown said his players understand what holding onto the fourth position would mean. \"We're aware of where we're at and we're adamant about holding onto fourth in the East,\" Brown said. \"We want to go into the playoffs in rhythm and trending in the form that can equate to a win in the playoffs.\"\n\nUP NEXT\n\n76ers: Host Minnesota on Saturday night.\n\nMagic: Host Phoenix on Saturday night.",
  "tags_rule": [
    "InjuryReport",
    "TripleDouble",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.284724",
  "pipeline_version": "v1"
}