{
  "game_id": "0021400878",
  "espn_id": "400579170",
  "date": "Mar 01, 2015",
  "matchup": "LAL vs. OKC",
  "headline": "Thunder get past Lakers without Kevin Durant and Russell Westbrook",
  "cleaned_body": "LOS ANGELES -- D.J. Augustin was still in Detroit when the Oklahoma City Thunder played 14 games without Kevin Durant and Russell Westbrook earlier this season.\nWith the Thunder's superstar duo sidelined again, the undersized new guy seized the opportunity to show his skill.\nSerge Ibaka had 18 points and 14 rebounds, Augustin added 18 points, nine rebounds and five assists, and Oklahoma City beat the Los Angeles Lakers 108-101 Sunday night to snap a two-game skid.\n\nThe game looked like trouble on paper for the eighth-place Thunder. Durant is out with a foot injury, while Westbrook underwent surgery on his right cheek Saturday in his native Los Angeles, where the Lakers had won a season-best three straight.\nYet with Augustin in charge and fellow newcomer Enes Kanter adding 16 points and 15 rebounds, the Thunder's supporting players and backups never trailed against the 14th-place Lakers. Augustin stepped in for Westbrook as the Thunder's catalyst, and the veteran looked sharp in his sixth game with his sixth NBA team.\n\"I'm surrounded by great players who know the game,\" Augustin said. \"They made it easy to transition to this team. I feel like I fit in right away.\"\nOklahoma City went 4-10 earlier in the season when Durant and Westbrook both were sidelined, but the Thunder clawed back into playoff position after their return. They're holding off New Orleans in eighth place in the Western Conference with 22 games to play.\nWestbrook had triple-doubles in his past three games, but needed surgery after breaking a bone in his face by colliding with teammate Andre Roberson's knee on Friday. Durant hasn't played in six straight games while nursing a broken bone in his right foot.\nJeremy Lamb added nine of his 14 points in the fourth quarter while Augustin went scoreless. Lamb's 3-pointer with 4:23 to play stretched Oklahoma City's lead to a game-high 14 points, allowing the Thunder to avoid a winless three-game road trip.\n\"Losing streaks are always frustrating,\" Lamb said. \"When you can end that, it always feels good. ... [Augustin] really controlled the game. He kept us under control.\"\nJeremy Lin had 20 points, eight assists and six rebounds for the Lakers, whose modest winning streak ended meekly. Los Angeles got at least eight points from eight players, but couldn't win its season-high fourth straight.\n\"We fought hard and still made a push at it, but just came up short,\" Lakers guard Wayne Ellington said. \"They didn't have K.D. and they didn't have Russ, so it was time for other guys to step up for them. I think D.J. did a great job for them and sparked them early.\"\nJordan Hill had 14 points and 12 rebounds while hitting his first career 3-pointer for the Lakers, who played without top scorer Nick Young. He missed his third straight game with a sore left knee.\n\"It's discouraging, but it's not like we were at full force, too,\" Lin said. \"I mean, we've been down without Kobe for a long, long time, and Nick was hurt. This was one where we felt like it was a winnable game, but they played well.\"\nTIP-INS\nThunder: Augustin hit a 3-pointer from well behind the line at the halftime buzzer. ... Newly acquired forward Steve Novak missed his fourth straight game after an appendectomy. ... Kanter returned from a one-game absence with a thigh bruise to play his fourth game with Oklahoma City.\nLakers: Lin is averaging 17.0 points per game since the All-Star break. ... Rookie point guard Jordan Clarkson had 12 points and four assists. He was a San Antonio high school teammate of Roberson, who scored eight points for the Thunder. ... The teams meet again in Oklahoma City on March 24.\nBOARD BARRAGE\nOklahoma City grabbed 16 offensive rebounds to Los Angeles' nine. The disparity was the primary reason that Lakers coach Byron Scott thought all of his big men were soundly outplayed. Ibaka had five of those offensive boards. \"It was offensive rebounds that cost us the game,\" Lakers forward Ed Davis said. \"I don't know exactly what the second-chance points were [20-13 for the Thunder], but they definitely killed us on the glass, and that's probably the main reason why we lost.\"\nUP NEXT\nThunder: Host Philadelphia on Wednesday.\nLakers: At Charlotte on Tuesday.",
  "tags_rule": [
    "ReturnFromInjury",
    "TripleDouble",
    "Streak",
    "CoachComment",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.062922",
  "pipeline_version": "v1"
}