{
  "game_id": "0022101016",
  "espn_id": "401360835",
  "date": "Mar 13, 2022",
  "matchup": "ATL vs. IND",
  "headline": "Trae Young scores 47, Hawks hold off Pacers 131-128",
  "cleaned_body": "ATLANTA -- — Trae Young scored 33 of his 47 points in the first half, and the Atlanta Hawks beat the Indiana Pacers 131-128 on Sunday night.\n\nAtlanta, 10th in the Eastern Conference, had seven players score in double figures and shot 54.8% from the field. Danilo Gallinari and De'Andre Hunter had 15 points apiece, and Kevin Huerter finished with 14.\n\nThe Hawks have won 13 of 15 at home and two straight overall. They had a season-high 77 points in the first half.\n\nTyrese Halliburton and Buddy Hield each scored 25 points for Indiana, which has dropped four of five and 13 of 17. The Pacers, 13th in the East, fell to 8-27 on the road.\n\nYoung’s 33 first-half points were a career high for either half. He was coming off his NBA-leading 23rd game of at least 25 points and 10 assists in Friday’s win over the Los Angeles Clippers. That’s 10 more than James Harden, the next closest player. He finished with five assists.\n\nYoung was forced to make some plays down the stretch after Atlanta nearly blew a big lead.\n\n“When I came back in, they went with the box-and-one,\" Young said. “When I say box-and-one, they were face-guarding and not letting me catch it. Everybody didn’t know what to do when we got in that position. We went over it before, but we’ve got to be better in those situations, and I think that’s what allowed them to get back in the game.\"\n\nThe Hawks’ biggest lead of the first half was 19 in the closing seconds on Young’s two free throws. Atlanta shot 60% from the floor in the first half, 59.1% on 3s.\n\nYoung was 9 for 13 from the floor, including 7 for 9 on 3s, in the first two quarters. He did as he pleased most of the game, pulling up for long 3s, showing off his ballhandling ability and scoring with ease.\n\nIndiana went on a 21-10 run to begin the third and pulled within seven at the 6:09 mark, but Young drove the lane for a runner and hit a layup on a fast break to make it 94-82 and cause the Pacers to call timeout.\n\nYoung went 14 for 14 on free throws.\n\n“Guy’s a great player and he got comfortable,\" Indiana coach Rick Carlisle said. “Their entire team was comfortable, so we had to change that and we did. We get another shot at these guys coming up at home, and we’ll be ready.\"\n\nThe Pacers, down to eight players because of injuries, pulled within two on Duane Washington Jr.’s free throws with 1:09 remaining in the game. Young knocked down a pair of free throws with 28.8 seconds to go and two more with nine seconds left to help close it out.\n\n“At this point in the season, we don’t have to play our best — we have to play our hardest,\" Young said. “Good effort and energy and live with the results. I think when you focus on playing your best and playing perfect, that’s when you make mistakes and mess up. If we come out with the mentality of playing hard and playing with energy, everything else will take care of itself.”\n\nReserve Hawks center Onyeka Okongwu loved watching Young take over the game in the first half.\n\n“Trae was really hot, and we really feed off that when a guy gets hot,\" said Okongwu, who finished with 13 points and nine rebounds. “It lifts everybody else up. When he gets in that zone, it’s like let him rock, honestly.\"\n\nTIP-INS\n\nPacers: C Goga Bitadze (right foot), G Chris Duarte (left big toe) and G Lance Stephenson (left ankle) were questionable before the game but were ruled out. ... G Malcolm Brogdon (concussion), G T.J. McConnell (right wrist), C Myles Turner (left foot), F T.J. Warren (left foot), and G Ricky Rubio (left knee) were out.\n\nHawks: F John Collins, the team’s second-leading scorer and rebounder, was out with a right finger sprain and a right foot strain. Gallinari started in his spot and scored 11 points in the second quarter. ... Atlanta’s previous first-half high was 76 points, coming against Indiana on Feb. 8. ... Young reached 40 points for the seventh time this season.\n\nTOUGH TO STOP\n\nAtlanta coach Nate McMillan has been impressed all season with Young’s ability to run the pick-and-roll and create scoring opportunities for his teammates. The Hawks rank seventh in scoring and Young is fifth in scoring and third in assists.\n\n“I think we’ve seen pretty much everything teams have tried to do,” McMillan said. “Trap, they deny, they try to play box-and-one. Normally he’s going to get the best defender and normally they’ve tried to (use) length. They switch one through five, so Trae has seen really all the defenses this year. Trae does a good job creating offense out of that set so we’re going to continue.”\n\nUP NEXT\n\nPacers: Host Memphis on Tuesday.\n\nHawks: Host Portland on Monday.\n\n------",
  "tags_rule": [
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.368513",
  "pipeline_version": "v1"
}