{
  "game_id": "0021300896",
  "espn_id": "400489769",
  "date": "Mar 03, 2014",
  "matchup": "POR vs. LAL",
  "headline": "Wesley Johnson tips Blazers late as Lakers survive",
  "cleaned_body": "PORTLAND, Ore. -- Wesley Johnson was hard-pressed to think of a more memorable shot he's had than his game winner against Portland.\nKent Bazemore lobbed to Johnson for the go-ahead basket with 6.9 seconds left, and the Los Angeles Lakers defeated the Trail Blazers 107-106 on Monday night.\nThey had been practicing that very play.\n\"It's one of them. It's gotta be up there,\" Johnson said about where the shot ranked. \"To pull out the win like we did and fight the whole game, it was a good one.\"\n\nPau Gasol scored 22 points, and the Lakers won their second straight, snapping the Blazers' five-game winning streak. Jodie Meeks added 21 points.\nThe Lakers, who led by as many as 15 points in the first quarter, pushed the lead to 97-86 in the fourth on MarShon Brooks' short jumper.\nBut Nicolas Batum's 3-pointer narrowed the gap to 103-101 for the Blazers with 3:37 left before Wesley Matthews' fadeaway jumper tied it at 105 with 1:10 left.\nDamian Lillard hit one of two free throws to give Portland its first lead since the first quarter. But the officials reversed a possession call with 7.1 seconds left, giving the ball to the Lakers. Bazemore pitched to Johnson for the deciding layup, and Lillard missed a 3-pointer as time ran out.\n\"These guys are straight up athletes in this league, and you can just throw it anywhere around the dash,\" Bazemore said. \"(Johnson) caught it and could have actually dunked it but went with a safe one.\"\nRobin Lopez had 19 points and 16 rebounds, while Batum had 17 points and 15 rebounds for the Blazers.\nLos Angeles was coming off a 126-122 victory at home Friday over Sacramento, which snapped a three-game losing streak. But the Lakers still sit at the bottom of the Western Conference with the Kings.\n\"They were making shots. They were making jumpers. I think we were deflated all the way around,\" Matthews said. \"Their energy was higher than ours.\"\nThe Blazers won the first meeting against the Lakers, 114-108 on Dec. 1.\nXavier Henry, who had 27 points against the Blazers in December, returned to the Lakers' lineup Monday after missing 28 games with a right knee injury, but he was played only sparingly. Coach Mike D'Antoni said he would limit Henry's minutes to start.\nSteve Nash ran through drills on the court before the game but sat out of his eighth straight game after a brief return from a nerve root irritation that causes him back pain.\nEarlier in the day at shootaround, D'Antoni told reporters he was doubtful Nash would return this season. After the game, D'Antoni said: \"He's not quite there physically. He tried it and couldn't' finish a game, so there's really no point in pushing the injury further. He's just trying to get well, and then we'll see.\"\nNash, who made the trip to Portland, was noncommittal: \"We'll see how I feel next week and if I get a chance to practice.\"\nNash, 40, has played in 10 games for the Lakers this season, averaging 7.6 points and 4.7 assists.\nKobe Bryant was also in Portland, but he has not been medically cleared to play after breaking his left knee in December.\nThe Lakers jumped out to a 31-16 lead in the first quarter, capping a 14-2 run with Meeks' dunk. Portland struggled with eight turnovers.\nPortland closed the gap in the second quarter, pulling to within 45-38 on Batum's dish to Lopez for the dunk and a free throw. But Bazemore's last-break dunk extended the Lakers' lead to 56-47 with 3:27 left in the half.\nThe Lakers led 63-56 at the half.\nLos Angeles wouldn't let the Blazers get closer than four points, and Gasol's dunk extended the lead to 82-73 with 2:36 left. Dorell Wright hit two consecutive 3-pointers for Portland to close within 82-79, but Bazemore answered with a 3 for the Lakers.\nBlazers coach Terry Stotts said he didn't believe his team overlooked the Lakers.\n\"I think it's a credit to the Lakers. They sustained their style of play from the very beginning,\" Stotts said. \"They got out in transition, they were aggressive in passing lanes, they forced eight turnovers in the first quarter. They got us on our heels right away. We got back, but I thought what the Lakers did more than anything was they came out and sustained it for the entire game.\"\nGame notes\nLopez had 13 points in the first half, a new career high. ... The Blazers announced a contest for fans to design a new floor for the Moda Center for the 2014-15 season. ... Portland was coming off a 102-96 victory at home over Denver on Saturday.",
  "tags_rule": [
    "ReturnFromInjury",
    "Streak",
    "CoachComment",
    "EarlyRun",
    "CareerHigh",
    "InjuryReport",
    "ClutchShot"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.965702",
  "pipeline_version": "v1"
}