{
  "game_id": "0021700925",
  "espn_id": "400975671",
  "date": "Mar 01, 2018",
  "matchup": "POR vs. MIN",
  "headline": "Blazers beat Timberwolves 108-99 for fifth straight win",
  "cleaned_body": "PORTLAND, Ore. --  Damian Lillard wasn't concerned. He knew his shots would eventually fall.\n\nLillard finished with 35 points after a slow start and the Portland Trail Blazers rallied to beat the Minnesota Timberwolves 108-99 on Thursday night for their season-high fifth straight win.\n\nLillard missed all seven shots from the field in the opening quarter.\n\n\"I was just missing. I was missing a lot of shots short, kept hitting the front of the rim. When it was leaving my hands it felt good. I just knew I had to shoot the ball it a little bit higher,\" he said. \"I really wasn't worried about it, honestly.\"\n\nCJ McCollum had 19 points and Jusuf Nurkic added 16 for Portland, which improved to 36-26. It was the first time Portland was 10 games over .500 since the end of the 2014-15 season.\n\nKarl-Anthony Towns had 34 points and 17 rebounds for the Timberwolves, who lost their fourth straight in the Moda Center.\n\nAfter struggling in the first half, Portland mounted a comeback in the second and pulled ahead 84-82 on Shabazz Napier's running jump shot with 8:07 left.\n\nAl-Farouq Aminu and McCollum hit back-to-back 3-pointers to give Portland a 92-86 lead with 3:48 left. Lillard's 3 extended it and the Timberwolves couldn't catch up.\n\nThe teams split the season series 2-2.\n\n\"It's tough not to come out of here with a win -- we would have loved it,\" Towns said. \"Now we have to go out and get the next game. Learn from our mistakes.\"\n\nThe Timberwolves were playing their third game without Jimmy Butler, who had surgery on Sunday to repair a meniscal injury in his right knee. It isn't clear when he'll be able to return. Butler is the team's top scorer, averaging 22.2 points.\n\nPortland shot just 25 percent in the first quarter (6 for 24). McCollum went 1 for 5, and the Blazers trailed 24-19.\n\nLillard had been hot going into the game, averaging 31.4 points in February, the highest scoring average for a Blazer in a single month in team history.\n\nTowns hit a 3-pointer that put Minnesota in front 47-36, but Lillard answered with his first basket from the field, a jumper, then added a driving layup and a free throw. The Blazers cut the lead to 49-44 at the break.\n\nTowns had 21 points in the half, including 19 in the second quarter alone.\n\nPortland opened the second half on a 7-0 run to go up 51-49 for a short-lived lead. Andrew Wiggins' jumper extended Minnesota's lead to 74-64 late in the quarter.\n\nLillard's 3-pointer and rebound basket from Davis got Portland within 78-75 going into the fourth quarter.\n\n\"He started hitting some long 3s -- he made some superstar shots. That happens with Dame,\" Towns said.\n\nBlazers starter Maurice Harkless left the game in the first half with a left knee injury. He did not return.\n\nWiggins added 21 points for the Timberwolves. Towns has had a double-double in a league-high 55 games this season.\n\nTIP-INS\n\nTimberwolves: The Timberwolves waived forward Shabazz Muhammad before the game. \"He wasn't playing as much as he would have liked and we told him we'd try to do the right thing for him,\" coach Tom Thibodeau said. Muhammad averaged 3.8 points and 1.4 rebounds in 32 games this season. ... The Timberwolves arrived in Portland early and Thibodeau was able to attend Portland's 116-99 victory over Sacramento on Tuesday.\n\nTrail Blazers: Portland went 0 for 13 from 3-point range in the first half. .. Lillard has made a 3-pointer in 44 straight games, tying the franchise record set by Nic Batum. ... Napier hit a halfcourt shot late in the game but it didn't count because he'd been fouled.\n\nGROWTH\n\nBoth coach Terry Stotts and Lillard said the Blazers wouldn't have won the game a few months ago.\n\n\"They have a lot of confidence and they understand we may not have won this game earlier in the season. We were able to fight through and hang with it defensively when things weren't going our way offensively, and then having the belief that it was going to break at some point,\" Stotts said.\n\nINJURY UPDATE\n\nHarkless had a patella tendon strain and said after the game that if it was the playoffs, he would have tried to keep playing. Minnesota's Taj Gibson, who left the game in the third quarter, has a right hip bruise.\n\nUP NEXT\n\nTimberwolves: Visit the Utah Jazz on Friday night in the second of a back-to-back.\n\nTrail Blazers: Host Oklahoma City on Saturday.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "CoachComment",
    "MomentumShift"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.363415",
  "pipeline_version": "v1"
}