{
  "game_id": "0021400951",
  "espn_id": "400579243",
  "date": "Mar 10, 2015",
  "matchup": "LAL vs. DET",
  "headline": "Lakers snap 5-game skid with 93-85 win over Pistons",
  "cleaned_body": "LOS ANGELES --  In their second straight season out of the playoffs, at least the injury-riddled Los Angeles Lakers know they can still beat the Detroit Pistons.\n\nJordan Hill led seven Lakers in double figures with 16 points on Tuesday night in a 93-85 victory that ended a five-game losing streak. It was their sixth straight win over the Pistons and 11th in the last 12 meetings, but they were officially eliminated from playoff contention before their game ended when New Orleans beat Brooklyn.\n\nThe game was Byron Scott's 1,000th as an NBA head coach during the regular season. This is his first season with the Lakers, whom he helped win three championships as a player in the \"Showtime\" era with Magic Johnson as his backcourt mate. One of those titles came against the Pistons in 1988.\n\n\"Obviously, the main thing on that bucket list is to win a championship as a coach. And there's no better place for me to do that than here,\" said Scott, who guided the Nets to the NBA Finals in his first two seasons and lost both times. \"I've learned a lot in 1,000 games, and I still think I have a lot to learn and to accomplish.\"\n\nGreg Monroe had 24 points and nine rebounds for the Pistons, but missed a pair of critical free throws with 1:09 remaining and Detroit trailing by three. Andre Drummond had 21 rebounds along with 14 points, but couldn't prevent Detroit's seventh straight loss as the Lakers finished with 46 points in the paint and a 46-41 rebounding edge.\n\n\"They kept getting second shots, and I think that's what really hurt us,\" Monroe said. \"Jeremy Lin and Wayne Ellington both were getting to the paint and were able to penetrate and make plays. That made the difference.\"\n\nDetroit fell 5 1/2 games out of the eighth and final Eastern Conference playoff spot with 19 games left on the schedule and four teams to jump over to get there.\n\nThe Pistons trailed by as many as nine before getting as close as 85-82 on a fast-break layup by former Laker Jodie Meeks with 1:42 left. But Hill helped put it away with a 20-footer in the final minute and Lin added four free throws.\n\n\"Every time they had a small run, we were able to cut it off,\" Lin said. \"That's the way it's got to be, with everybody pitching in here and there.\"\n\nThe Pistons led 50-49 at halftime but missed their first eight shots of the third as the Lakers went on an 8-0 run.\n\n\"The third quarter has kind of been our Achilles heel,\" said Lakers rookie point guard Jordan Clarkson, who had 10 points and eight assists. \"We were just staying aggressive on the defensive end and forcing them into turnovers. We were rebounding the ball as well. That's a good rebounding team, so we were just trying to keep them off the glass.\"\n\nTIP-INS\n\nPistons: Meeks, who spent the previous two seasons with the Lakers and shot under 90 percent on free throws in each of them, is leading the NBA from the line this season (92.3 percent) . ... The Pistons' other meeting with the Lakers this season resulted in a 106-96 defeat that came during Detroit's 13-game losing streak. ... Rookie G Spencer Dinwiddie, who was born in Los Angeles and played his high school ball in Woodland Hills, fouled out for the first time as a pro with 20.4 seconds to play after 19-plus minutes off the bench.\n\nLakers: Kobe Bryant, out for the season after rotator cuff surgery, reiterated that his plans are to return for a 20th season -- and possibly beyond. \"Who said I was retiring? It was never a question for me whether or not I was going to play next year,\" the NBA's No. 3 career scorer said. \"It's discouraging. You have an injury and you have another one and you have another one -- it's discouraging. But I'll respond to it the same way I always have: just sticking to the process.\" Injuries have limited Bryant to just 41 of 144 games since the start of last season. The team is 44-101 without him in the lineup, but only 12-29 when he's played. ... Guard Jabari Brown, the leading scorer in the NBA Development League this season with a 24.4 average for the Los Angeles D-Fenders, signed a 10-day contract.\n\nUP NEXT\n\nPistons: At Golden State on Wednesday.\n\nLakers: Host New York Knicks on Thursday.",
  "tags_rule": [
    "PlayoffContext",
    "Streak",
    "FoulTrouble",
    "CoachComment",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.797489",
  "pipeline_version": "v1"
}