{
  "game_id": "0021701046",
  "espn_id": "400975792",
  "date": "Mar 18, 2018",
  "matchup": "TOR vs. OKC",
  "headline": "Raptors see 11-game win streak snapped by OKC as three ejected",
  "cleaned_body": "TORONTO -- Oklahoma City coach Billy Donovan praised his team's poise following a hard-fought road win over the streaking Raptors.\nToronto, meanwhile, found it harder to stay calm and collected after some controversial calls down the stretch.\nRussell Westbrook had 37 points, 14 assists and 13 rebounds for his fifth straight triple-double, Steven Adams scored 25 points, and the Thunder beat the Raptors 132-125 on Sunday, snapping Toronto's winning streak at 11.\n\"You've got to be able to keep your composure through it all,\" Westbrook said. \"That's what the game is all about. We've got a lot of veteran guys on this team who are able to do that.\"\nPaul George scored 22 points and Carmelo Anthony had 15 as the Thunder extended their winning streak to six. Corey Brewer scored 10 points for Oklahoma City.\n\"A big part of it tonight was our team's poise,\" Donovan said. \"That was really important.\"\nDeMar DeRozan scored 24 points and Kyle Lowry fouled out with 22 points and 10 assists as the Eastern Conference-leading Raptors suffered just their sixth home loss of the season. Toronto is 29-6 at Air Canada Centre, the best home record in the NBA.\nDeRozan, Serge Ibaka and Raptors coach Dwane Casey were all ejected in the final minute for complaining to the referees. DeRozan was incensed after not getting a call when he tried to drive on Brewer with 30 seconds left. DeRozan picked up two technical fouls in the following 22 seconds.\n\"He tried to smack me because I had a layup,\" a visibly frustrated DeRozan said. \"I got fouled.\"\nHaving reviewed the video, Casey said the Raptors would file a formal complaint.\n\"Officials are going to miss calls, but at the juncture of the game when some of the calls were made, we've got to get it right around the league,\" Casey said. \"Not just this game, the entire league.\"\nStill, Casey took pains to point out that the Raptors, not the referees, were ultimately to blame.\n\"We made enough mistakes down the stretch also,\" Casey said. \"We shot ourselves in the foot, missed easy shots, layups, free throws, turnovers.\"\nDeRozan, however, didn't share Casey's view. Asked whether the officials had cost Toronto the game, DeRozan said, \"It's obvious for us.\"\nDelon Wright and CJ Miles each scored 15 points, and Pascal Siakam and Jonas Valanciunas each had 10 for the Raptors.\nThe score was tied 119-119 when Lowry fouled out with 3:19 remaining. Westbrook immediately drove for a layup past Wright, Lowry's replacement.\nAfter Wright missed a layup at the other end, Westbrook added another layup to cap a personal 10-point run and give Oklahoma City a 123-119 lead with 2:38 remaining.\nWright and DeRozan each made a pair of free throws to tie it at 123-123 with 1:41 left, although DeRozan missed a free throw on Anthony's technical foul.\nWestbrook put the Thunder ahead to stay by driving for a layup with 39 seconds left, then banked home a jump shot with 11 seconds left, giving Oklahoma City a four-point cushion.\nTIP-INS\nThunder: The starting five combined to shoot 17-for-18 in the first quarter. ... Adams scored a career-high 27 points against Minnesota on Dec. 1.\nRaptors: Lowry returned after sitting out to rest in Friday's win over Dallas. ... G Fred VanVleet was unavailable because of a right hand contusion. ... F Norman Powell (sprained left ankle) returned after missing the previous two games.\nONE THAT GOT AWAY\nToronto dropped to 43-2 when leading through three quarters. The Raptors, who also lost a Dec. 11 road game to the Clippers after taking a lead into the fourth, were ahead 98-97 through three against the Thunder.\nAGONY FOR ADAMS\nAdams went down in pain after taking a knee to the groin while defending Ibaka's drive in the third. Adams stayed down for several minutes before walking gingerly to the locker room but was able to return.\n\"That did not look very comfortable,\" Donovan said.\nAdams and Ibaka were teammates in Oklahoma City for three seasons. \"My old mate,\" a smiling Adams said, shaking his head.\nMELO'S MILESTONE\nAnthony reached 25,289 points, passing Reggie Miller (25,279) to take over 19th place on the NBA's points list. Next up is Alex English (25,613).\nUP NEXT\nThunder: Visit Boston on Tuesday. Oklahoma City has won three straight road games against the Celtics.\nRaptors: Visit Orlando on Tuesday. Toronto has won the past two meetings.",
  "tags_rule": [
    "TripleDouble",
    "FoulTrouble",
    "Streak",
    "CoachComment",
    "CareerHigh",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.114446",
  "pipeline_version": "v1"
}