{
  "game_id": "0022101015",
  "espn_id": "401360834",
  "date": "Mar 13, 2022",
  "matchup": "ORL vs. PHI",
  "headline": "Embiid's 35 points, 16 rebounds lead 76ers over Magic in OT",
  "cleaned_body": "ORLANDO, Fla. -- — Joel Embiid and the Philadelphia 76ers brought out the best in the Orlando Magic.\n\nEmbiid had 35 points and 16 rebounds and the 76ers kept rallying, finally beating Orlando 116-114 in overtime Sunday night.\n\nDown by 17 points in the first half and trailing by 10 in the fourth quarter, the Sixers were behind 113-109 with 1:25 left in OT. Orlando has the worst record in the Eastern Conference at 18-51.\n\n“This was a big win for us. I know people are like: ‘Oh, it’s the Orlando Magic.' But they just beat the Timberwolves the other night and the Timberwolves came back and beat the Miami Heat,” said Georges Niang, who hit two big 3-pointers in the fourth quarter to help send the game into overtime. “That should tell you something about the NBA.”\n\nJames Harden hit one of two free throws with 6.7 seconds left in overtime to give Philadelphia a two-point lead. Cole Anthony missed a 3-pointer at the horn for Orlando.\n\nAnthony's three 3-pointers had put the Magic ahead in the final minutes.\n\n“(The final shot) could have gone in and we'd be in a different mood,” Anthony said. “This is a game that easily could have fallen in our favor.”\n\nHarden finished with 26 points and Tobias Harris added 25 and nine rebounds for the 76ers.\n\nWendell Carter Jr. had 23 points and 12 rebounds to lead Orlando, which fell just short of a second upset in three days.\n\n“We're giving ourselves a chance in the fourth quarter,” Carter said. “We're going to be in this position a lot, and we're going to win some and lose some. It's good experience.”\n\nEmbiid, who also had seven assists, set up Tyrese Maxey for a 3-pointer just before the fourth-quarter buzzer, but Maxey missed. Embiid missed two foul shots with 1:39 left after making his first 15 free throws of the game.\n\nThe Magic led 57-40 late in the first half, in which the 76ers shot 33%.\n\n“I would like to get off to a good start, but it's almost like we've got to get punched in the mouth before we turn on our defensive intensity,” Philadelphia coach Doc Rivers said. “That stretch of defense in the third quarter was phenomenal, but we have to start the game that way.”\n\nA 10-footer by Niang and free throws by Harden and Embiid helped reduce Orlando's lead to 12 at halftime.\n\nThe Magic went without a field goal for nearly seven minutes of the third quarter. But Markelle Fultz capped a Magic bench rally with a couple of assists and a 3-pointer of his own for a 10-point lead with 10:03 left.\n\nHarden responded with four free throws and Niang hit two 3-pointers to get the 76ers back in it. Embiid made a 3-pointer to put Philadelphia up 101-98, its first lead since the first quarter.\n\nTIP-INS\n\n76ers: Niang had 16 points in 36 minutes off the bench. . . . The 76ers held Orlando without a field goal for the final 3:50 of regulation. . . . F Danny Green missed a third straight game with a finger laceration.\n\nMagic: The Magic have lost eight straight to Philadelphia, including all four meetings this season. . . .. Fultz, playing in his sixth game of the season, had eight points and 11 assists in 19 minutes. . . . After missing their first four attempts, the Magic shot a healthy 42 percent (18 for 43) from 3-point range. . . . Mo Bamba, who had 27 points and 12 rebounds Friday night in the win over Minnesota, did not score in the first half.. But\n\nUP NEXT\n\n76ers: Play at home against Denver on Monday night.\n\nMagic: Play at home against Brooklyn on Tuesday night.\n\n------",
  "tags_rule": [
    "MomentumShift",
    "ClutchShot",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.278044",
  "pipeline_version": "v1"
}