{
  "game_id": "0021400911",
  "espn_id": "400579203",
  "date": "Mar 06, 2015",
  "matchup": "CHA vs. TOR",
  "headline": "Jefferson, Hornets top Raptors 103-94 in tech-filled game",
  "cleaned_body": "CHARLOTTE, N.C. -- Al Jefferson had 23 points and 13 rebounds and the Charlotte Hornets beat the Toronto Raptors 103-94 on Friday night in a game that had six technical fouls.\nJefferson was 11 of 21 from the field en route to his team-leading 19th double-double of the season. Mo Williams added 23 points, and Lance Stephenson had 11 points and eight rebounds to help Charlotte win its fourth straight. The Hornets entered the night in the eighth and final playoff spot in the Eastern Conference.\nDeMar DeRozan had 30 points on 14-of-26 shooting for Toronto. The Raptors have lost seven of their last eight games. Kyle Lowry returned to the starting lineup after missing the last three games with nagging injuries and fatigue and scored 25 points in 37 minutes.\nThe Hornets have beaten the Raptors eight straight times at home.\nOfficial Joey Crawford made his presence felt, twice assessing double technical fouls. The first time he slapped Michael Kidd-Gilchrist and Jonas Valanciunas and later got Gerald Henderson and Terrence Ross. Crawford also hit James Johnson late and Lance Stephenson in separate incidents after the game.\nThe Hornets led 80-75 early in the fourth quarter before going on a 17-3 run highlighted by a highlight real no-look bounce pass from Stephenson to Cody Zeller for a dunk. Stephenson began celebrating the pass even before Zeller elevated, racing back down the court with his arm stretched wide and big smile on his face.\nWilliams was big again for the Hornets.\nHe came in averaging 21.6 points and 8.9 assists in the six games since being acquired from Minnesota in a trade. He added seven more assists and four 3-pointers as he continues to fill in admirably for the injured Kemba Walker. He had 15 points in the second half.\nWilliams is playing so well that coach Steve Clifford said before the game that he plans to pair Williams with Walker in the backcourt at times once Walker is healthy enough to return from a knee injury. Clifford said Walker could be back as soon as next week.\n\"They're two of our best three scorers,\" Clifford said.\nThe Hornets closed the first half strong to open a 53-42 lead and the Raptors could never get closer than five after the break.\n---\nTIP-INS\nRaptors: Lou Williams came in having scored 20 points off the bench in each of the last three games, but managed just four points against the Hornets in limited playing time.\nHornets: The Hornets missed a chance to make it five straight games with all five starters finishing in double figures in scoring when Kidd-Gilchrist was held to eight points. The other four starters finished in double digits. ... Stephenson is shooting 14 percent from beyond the 3-point arc this season.\nUP NEXT\nRaptors: At Oklahoma City on Sunday night.\nHornets: At Detroit on Sunday night.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.220818",
  "pipeline_version": "v1"
}