{
  "game_id": "0021700278",
  "espn_id": "400975029",
  "date": "Nov 25, 2017",
  "matchup": "ORL @ PHI",
  "headline": "JJ Redick hits 8 3s, 76ers send Magic to 8th straight loss",
  "cleaned_body": "PHILADELPHIA -- Filling in for the injured Ben Simmons at point guard, T.J. McConnell had a plan.\n\"Anytime you see JJ open, give him the ball,\" he said.\nSmart decision.\nJJ Redick hit eight 3-pointers and scored 29 points, and the Philadelphia 76ers cruised without Simmons to a 130-111 victory over the skidding Orlando Magic on Saturday night.\n\"He's a point guard's dream when it comes to shooters,\" said McConnell, who had 15 points, 13 assists and seven rebounds. \"He's the best I've ever played with.\"\nJoel Embiid shook off an illness that left him in bed all day to score 18 points and grab 14 rebounds, and the Sixers didn't miss a beat with Simmons missing his first game of the season with swelling in his left elbow.\nRedick hit six first-half 3s, four coming in the final 3:10 of the second quarter, as the Sixers built a 70-55 halftime lead.\n\"I kind of blacked out there in the second quarter,\" Redick said, smiling. \"No, when you hit a couple shots in a row, the ball is like a magnet and your teammates are kind of looking for you. . T.J. did a great job seeking me out.\"\nElfrid Payton had 22 points, eight rebounds and nine assists in another miserable defensive performance for the Magic, who have lost eight straight.\n\"Just not a good enough defensive disposition,\" Magic coach Frank Vogel said. \"We're not going to beat anybody giving up 130 points.\"\nThe Sixers shot 51 percent in winning their third straight game to move to 11-7 as they try to finally turn the corner after years of losing.\nPhiladelphia, thinking it could finally compete this season, signed Redick to a one-year, $23 million contract in July.\nRedick said watching the Sixers' unselfishness in previous seasons attracted him.\n\"Sometimes with the intention of sort of, maybe not trying to win at times, but I like how they played,\" Redick said in a wink to the Sixers' \"Process\" rebuild.\nRedick, drafted 11th overall by the Magic in 2006, was part of a humming offense without their star rookie. Redick hit 10 of 18 shots, 12 of them 3-point attempts.\nAfter missing his first NBA season with a broken right foot, Simmons had played in the Sixers' first 17 games and been one of the league's top rookies.\nSixers coach Brett Brown said his team would continue to play fast even without Simmons because advanced metrics show the Magic struggle when opponents push the pace.\nAnd defense was Vogel's biggest worry before the game, when he called his team's transition in Friday's loss to Boston \"garbage.\" Asked if he would be quick to pull players who make defensive mistakes, he said, \"I would hope that I wouldn't have to coach that way, but they're showing me that I do.\"\nBefore the game was 4 minutes old, Vogel had yanked Payton and Aaron Gordon.\n\"Trying to teach,\" Vogel said.\nThe moves didn't work, as the Magic allowed 70 first-half points a night after giving up 73 in Boston.\nGordon scored 16 points and Nikola Vucevic added 14 points and 14 rebounds.\nTIP-INS\nMagic: Vogel, who grew up in nearby Wildwood Crest, New Jersey, had about 40 friends and family on hand, including his parents and brother. \"This always feels like home,\" he said. . F Jonathan Simmons played despite a sore right quadriceps.\n76ers: Brown didn't know if Simmons would play Monday against LeBron James and Cleveland, but acknowledged \"we get who's coming into town.\" . Jerryd Bayless served as backup point guard and hit a 3 and made a driving layup in the final minute of the third quarter to make it 101-85. . New Phillies manager Gabe Kapler rang the replica Liberty Bell before the game.\nEMBIID SICK\nEmbiid played 28:32 after skipping the morning shootaround.\n\"I missed two years of basketball (with injuries) and I don't want to ever be in the type of setting where because I'm sick I'm not able to play,\" he said. \"I just want to be on the court.\"\nUP NEXT\nThe Magic visit Indiana on Monday as Vogel faces the team he coached for six seasons.\nThe 76ers host Cleveland on Monday in the fifth game of six straight at home.\n---\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:50.899365",
  "pipeline_version": "v1"
}