{
  "game_id": "0021300566",
  "espn_id": "400489439",
  "date": "Jan 15, 2014",
  "matchup": "CHI @ ORL",
  "headline": "Bulls stave off Magic bid in triple-OT thriller",
  "cleaned_body": "ORLANDO, Fla. -- It's no secret that the Chicago Bulls gave up a lot of talent when they decided to trade away Luol Deng last week.\nWhat the Bulls have shown since he left, though, is that there is still plenty of fight left in the players that remain on the roster.\nJoakim Noah had a season-high 26 points and 19 rebounds, Carlos Boozer scored 23, and the Bulls held on to beat the Orlando Magic 128-125 in triple-overtime on Wednesday night.\n\"The only thing it defines is us going on a plane right now a lot happier,\" Noah said. \"There's nothing better than winning a basketball game. It feels good. We know we didn't play great basketball tonight but we found a way.\n\"We came back from the dead, a lot of people stepped up.\"\nThe Magic had a chance to win the game with less than 10 seconds to play, but Glen Davis' jumper was partially blocked and rebounded by the Bulls with just 1.5 seconds remaining.\nThe game featured 20 lead changes and 14 ties and lasted just over 3 hours. Nine players logged over 40 minutes. That included Chicago's Jimmy Butter, who played a franchise-record 60 minutes and finished with 21 points.\nThe Bulls have now won the last seven matchups with the Magic played in Orlando and improved to 4-1 since dealing Deng.\nChicago coach Tom Thibodeau said Noah was a key throughout.\n\"There's not many players like him,\" Thibodeau said. His all-around defense, every aspect, the rebounding effort, to seeing things early (and) how they're developing... It's just great effort.\"\nOrlando came into the game in desperate need of a win coming off a 0-5 road trip. The Magic played one of their best games of the season but it wasn't enough as they extended their season-high losing streak to nine games.\nVictor Oladipo had a career-high 35 points and Jameer Nelson added 31 points and 10 assists for Orlando. Tobias Harris added 22 points and 16 rebounds.\n\"I was more mad than exhausted,\" said Oladipo, who played a team-high 57 minutes. \"I'm more mad than exhausted right now. But it's a short turnaround, so you have to have a short-term memory.\"\nWhat made Orlando's effort even more surprising is that it played without starters Arron Afflalo and Nik Vucevic. Afflalo missed his third straight game with a strained right foot, and Vucevic was out for the fifth straight with a concussion.\nDuring their recent road trip, the Magic were tripped up by those injuries.\nDespite losing by an average of 20 points during the trip, coach Jacque Vaughn continually lauded his team's improvement throughout. He did again after Wednesday's loss.\n\"You feel for the guys, you want them to get a victory underneath them. But we got better tonight,\" Vaughn said.\nIn a game that didn't see either team take more than an four-point lead in any of the overtime periods, the Magic went ahead 125-122 in the third OT on a 3-pointer by Harris.\nBut Chicago kept chipping away, and eventually took the lead for good, 126-125, on a jumper by Tony Snell.\nThe Bulls had a 119-116 lead in the second overtime on a tip-in by Noah.\nAfter several empty possessions on both ends, Davis tied it on a straightway 3 with just 4.2 seconds left.\nNoah got free on a drive on the other end, but was fouled.\nThe Bulls then failed to get up a shot.\nThe Magic controlled the early pace of first overtime and took a 111-108 lead on a free-throw by Harris with 1:22 remaining.\nBut the Bulls committed their 17th turnover of the night on a bad pass by Noah with less than a minute to play, prompting a Magic timeout.\nNelson briefly got free, but came up empty on a 13-foot jumper, giving it back to Chicago.\nComing out of a timeout Mike Dunleavy got free on the wing and sank a 3-pointer to tie it with 13.4 seconds left.\nNelson dribbled the clock down, but couldn't get a shot off before time expired.\nThe Magic hovered above 55 percent shooting as they built as much as a 15-point lead in the third quarter.\nButler said the win was indicative of a style that hasn't gone away for the Bulls.\n\"We're grimy and we play as a team,\" he said. \"There is no guy that doesn't give all the effort on every single play. Whenever you play like that, good things happen. The basketball gods will reward you.\"\nGame notes\nThe Magic are now 0-11 without Vucevic this season, and 0-4 in overtime games. ... The Bulls recalled G Marquis Teague on Wednesday from the Iowa Energy of the NBA Development League.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.274123",
  "pipeline_version": "v1"
}