{
  "game_id": "0022100001",
  "espn_id": "401358773",
  "date": "Oct 19, 2021",
  "matchup": "MIL vs. BKN",
  "headline": "Bucks begin title defense with 127-104 victory over Nets",
  "cleaned_body": "MILWAUKEE -- — Giannis Antetokounmpo and the Milwaukee Bucks didn't let the celebration of the franchise's first NBA championship in half a century distract them as they opened their title defense.\n\nIn his first game since scoring 50 points in a title-clinching Game 6 NBA Finals victory over the Phoenix Suns, Antetokounmpo had 32 points, 14 rebounds and seven assists to lead the Bucks to a 127-104 victory over the Brooklyn Nets on Tuesday night.\n\n“We're part of history,” Antetokounmpo said. “I'm excited. But now it's over with. We've got to focus on building good habits, keep moving forward and keep playing good basketball and hopefully we can repeat this again this year, next year and all the years that we're going to be here down the road.”\n\nKhris Middleton and Pat Connaughton each added 20 points to help the Bucks withstand the loss of Jrue Holiday, who sat out the second half with a bruised right heel after scoring 12 points. Bucks coach Mike Budenholzer said MRI results on Holiday were encouraging.\n\nKevin Durant led the Nets with 32 points and 11 rebounds. Patty Mills scored 21 points and shot 7 of 7 from 3-point range. James Harden added 20 points.\n\n\"We weren't very good,” Brooklyn coach Steve Nash said. “If you're not playing at a high level against the champs, you're not going to win.”\n\nThe Nets were missing star guard Kyrie Irving, who isn’t with the team due to his refusal to get a COVID-19 vaccine.\n\nA New York mandate requires professional athletes on local teams to be vaccinated to practice or play in public venues. Rather than using Irving exclusively in road games, the Nets decided he wouldn’t play or practice with them at all until he could be a full participant.\n\nAfter receiving their rings, raising a banner and watching a highlight video of their first NBA championship since 1971, the Bucks defeated the team that nearly eliminated them in the second round of the playoffs. Antetokounmpo acknowledged that he teared up a little bit during the pregame ceremony.\n\n“When they were playing those videos, you cannot help yourself but get emotional,” Antetokounmpo said. “Looking back to the journey, where we started from and where we are right now.\"\n\nMilwaukee rallied from a 2-0 deficit and  won Game 7 at Brooklyn in overtime  after Durant’s foot barely crept across the 3-point arc in the final seconds of regulation, turning a potential series-winning 3-pointer into a game-tying 2-point basket.\n\nThe Bucks went on a 21-4 run in the first quarter to extend a 10-8 advantage to 31-12. They got the lead back up to 19 again in the second quarter and were ahead 66-59 at halftime. The lead never dropped below seven the rest of the way.\n\nMilwaukee outrebounded Brooklyn 54-44 and took 21 more shots than the Nets.\n\n“We were climbing uphill all game,” Durant said.\n\nMilwaukee got 15 points from Jordan Nwora and 10 from Grayson Allen.\n\nFANCY RINGS\n\nMilwaukee's championship rings  include the messages “Fear The Deer” and “Bucks In 6.” The latter slogan has served as a rallying cry among fans ever since former Bucks guard Brandon Jennings used those words while incorrectly predicting the outcome of Milwaukee's 2013 first-round series with the eventual NBA champion Miami Heat.\n\nJennings and former Bucks guard Michael Redd were both in the crowd.\n\nThe rings, designed by Jason of Beverly Hills, have 360 diamonds on the top to represent the Bucks' total wins under current ownership. There are 16 emerald-shape diamonds on each side, symbolizing their 16 playoff wins last season and their 16 division titles in franchise history.\n\n“My first thought as soon as it was handed to me is this is the biggest ring I've ever seen in life, and there's a lot of diamonds in it,” Nwora said.\n\nHerb Kohl, the 86-year-old former U.S. senator who owned the Bucks from 1985-2014, also got a ring and received a standing ovation when he was announced.\n\nTIP-INS\n\nNets: Mills had a brilliant Brooklyn debut after spending the last 10 seasons in San Antonio, but the Nets didn't get much else from their bench. Brooklyn's other reserves combined for just four points.\n\nBucks: Milwaukee was missing guard Donte DiVincenzo (ankle) and forwards Bobby Portis (hamstring) and Semi Ojeleye (calf). Budenholzer didn’t have an estimate on when any of the three might make their season debut but said that Portis and Ojeleye will play before DiVincenzo, who tore a ligament in his left ankle during last season’s playoffs.\n\nUP NEXT\n\nNets: At Philadelphia on Friday.\n\nBucks: At Miami on Thursday.\n\n------",
  "tags_rule": [
    "MomentumShift",
    "PlayoffContext",
    "ReturnFromInjury",
    "CoachComment",
    "ClutchShot"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "HighStakes",
    "Health": "ReturnBoost",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.086746",
  "pipeline_version": "v1"
}