{
  "game_id": "0021400517",
  "espn_id": "400578809",
  "date": "Jan 05, 2015",
  "matchup": "LAL @ POR",
  "headline": "Damian Lillard's 39, clutch basket help rally Blazers past Lakers",
  "cleaned_body": "PORTLAND, Ore. -- On a night that could have gone terribly wrong for the Trail Blazers, Damian Lillard made everything right in the end.\nLillard scored 39 points and made the go-ahead basket with 36 seconds remaining as Portland rallied from a 10-point deficit in the second half to beat the Los Angeles Lakers 98-94 on Monday night.\nIn the first quarter, Blazers starting guard Wesley Matthews collapsed to the floor and grabbed his left knee while driving to the basket. Matthews was helped to the locker room, then returned to the bench and eventually the game during the second quarter.\nMatthews, averaging 16.9 points per game, said he had a hyperextended left knee but didn't think it was serious. He played 30 minutes and scored five points.\n\"I told him he scared me, because he did,\" Portland coach Terry Stotts said. \"I was shocked to see him come back. I'm no doctor, but it didn't look good.\"\nLillard hit four 3-pointers, and scored 16 points during the fourth quarter to lead the Blazers (27-8). He has scored at least 39 points in three of his past nine games.\nLaMarcus Aldridge added 21 points, and reserve center Meyers Leonard had 12 points and 12 rebounds for Portland.\nThe Lakers (11-24) were without Kobe Bryant, the team's leading scorer at 23.6 points per game. Bryant stayed home for a scheduled day of rest. It was the fourth game Bryant has skipped after sustaining two leg injuries the past two seasons.\nJordan Hill led Los Angeles with 23 points and 14 rebounds. Five Lakers scored in double figures, including Jeremy Lin with 14 points.\nLillard has had several big scoring performances of late, often with Portland trailing late in the game and the Blazers needing a boost. Such was the case Monday, with the Lakers leading for most of the second half and 83-76 with 5:55 remaining.\nLillard hit back-to-back 3s during a 12-2 run that gave the Blazers an 88-85 lead. During the final 36 seconds, he made the go-ahead basket and three free throws to help Portland secure the win.\n\"I don't live for it, but I would like us to play with the type of urgency we did for the last eight minutes for the entire game. But when it's needed, I'm definitely not going to shy away from it,\" Lillard said.\nLillard scored 24 points in the second half and several times hit tough, contested shots.\n\"He got hot, definitely, and we didn't do a good enough job of disrupting him. I've got to do a better job of making his life more difficult,\" Lin said.\nThe Lakers briefly took a 92-91 lead with 43 seconds remaining on two free throws by Lin. But Lillard immediately went to work, driving to the basket for the go-ahead layup seven seconds later.\nLos Angeles took control early in the third quarter, running off 10 consecutive points to take a 61-54 lead. The Lakers led by as many as 10 before Lillard helped the Blazers cut the deficit to 73-70 heading into the fourth.\nNeither team was able to shake loose in the first half. The Blazers led by as many as seven, but the Lakers closed the second quarter on a 9-4 run to cut the halftime deficit to 47-45.\nThe first-half highlight came when Nick Young chased down a ball in the backcourt, stepped over midcourt and hit a 40-foot 3-pointer to beat the 24-second shot clock.\nTIP-INS\nLakers: Los Angeles forward Wesley Johnson, who injured his hip Sunday against Indiana, could be back as early as the end of this week, coach Byron Scott said. ... Lakers forward Ryan Kelly, who had played just 46 minutes in the first 44 games, made his first start of the season. ... G Ronnie Price took an elbow to his nose during the third quarter and did not return. Scott said Price, who needed 11 stitches and thought he probably broke his nose, could play Wednesday against the Los Angeles Clippers but might have to wear a mask.\nTrail Blazers: Stotts was selected Western Conference coach of the month for December. Portland went 13-3 in December, tying a franchise record for wins in one month. ... C Chris Kaman made his first start of the season. Robin Lopez (broken right hand) and Joel Freeland (right shoulder) are out for an extended period.\nLEONARD'S BIG NIGHT\nLeonard had his first double-double of the season. The most surprising element of his game came on the perimeter, where he went 3-of-4 from 3-point range. Leonard helped Portland get going in the fourth quarter with a four-point play when he was fouled while hitting a 3-pointer that cut the Lakers' lead to 76-74.\n\"He played like we needed him to. He was making shots, shooting confident and grabbing rebounds. It was an all-around good performance,\" Matthews said.\nLILLARD LIKES LAKERS\nLillard's 39 points were a career best for a home game, breaking his previous high of 38, also against the Lakers. It was the second-highest scoring performance by a Blazers player against Los Angeles; the record is 43 points by Clyde Drexler in 1989. In eight career games against the Lakers, Lillard is averaging 26.3 points.\nUP NEXT\nLakers: Wednesday at Los Angeles Clippers.\nTrail Blazers: Thursday at home against Orlando.\nThe Associated Press contributed to this report.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "CoachComment",
    "LateCollapse"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Collapse",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.325328",
  "pipeline_version": "v1"
}