{
  "game_id": "0021300833",
  "espn_id": "400489706",
  "date": "Feb 23, 2014",
  "matchup": "OKC vs. LAC",
  "headline": "Clippers outlast Thunder, overcome Kevin Durant's 42 points",
  "cleaned_body": "OKLAHOMA CITY -- NBA scoring leader Kevin Durant marveled at what Jamal Crawford did to his team.\nCrawford scored 36 points to help the Los Angeles Clippers beat the Oklahoma City Thunder 125-117 on Sunday afternoon.\nDurant scored 42 points, but such performances are almost expected from him. Crawford, on the other hand, averages about 19 points.\n\nHe's known to be streaky, and in this game, he was on. He made 5 of 8 3-pointers, many of which were launched from well beyond the line.\n\"Jamal Crawford comes across halfcourt shooting,\" Durant said. \"You've got confidence once you start seeing the ball go in the rim.\"\nMatt Barnes scored 24 points, Chris Paul had 18 points, 12 assists and eight rebounds, Blake Griffin scored 20 points and DeAndre Jordan added 18 points and 12 rebounds for the Clippers, who snapped a two-game skid and beat the team with the league's best record.\n\"We were on the plane yesterday flying here and we were just talking about how we hadn't beaten any good teams on the road, any really good teams, and this would be a perfect time to start,\" Paul said.\n\"Doc (Clippers coach Doc Rivers) was on us, telling us that in the playoffs, you're going to lose a home game at some point and you've got to be able to win on the road. Hopefully this is a win for us that gets us moving.\"\nDurant also had 10 assists, and Serge Ibaka added 20 points for the Thunder, who lost their second straight. It was the most points the Thunder have allowed this season, and it came on the heels of a 103-81 home loss to Miami on Thursday.\n\"We've just got to get over this little slow stretch that we're in,\" Durant said. \"We'd better. We've got to play defense. That's the thing. We can't just let teams come in here and do whatever they want offensively.\"\nOklahoma City overcame a 15-point deficit late in the third quarter to take a 115-112 lead on a 3-pointer by Durant with 2:43 to play, but the Clippers controlled the game from there.\nA 3-pointer by Crawford with 1:30 remaining gave Los Angeles a 119-115 lead. Crawford scored again on a floating jumper in the final minute to push the lead to 121-117.\n\"Jamal made timely shots,\" Paul said. \"Every time they made a run and we just needed a bucket, Jamal was our guy.\"\n\nOklahoma City's Russell Westbrook missed a 3-pointer on the other end, and Paul made two free throws to extend the Clippers' lead to six.\nPaul sprained his right thumb against Memphis on Friday, and he wasn't sure he'd play.\n\"I think the credit goes to our training staff,\" he said. \"I came here to the arena thinking that I wasn't playing, but they found a way.\"\nThe Clippers shot 66 percent in the first half to take a 72-66 lead at the break. Barnes made a 3-pointer with 9.8 seconds left in the first half, and a loose ball foul was called on Ibaka away from the shot. Griffin made the free throw to give the Clippers a 72-64 lead. Durant closed the half with a long 2-pointer.\nThe Clippers scored 44 points in the second quarter, just short of their season high of 46 in a period.\nThe Clippers had 27 fast-break points at halftime.\n\"We really couldn't get ourselves in front of them, and they were beating us down the floor early, and it gave them some confidence and led them to winning the game,\" Westbrook said.\nGriffin hit a 3-pointer to push the Clippers' lead to 91-79 with 3:26 left in the third quarter. Darren Collison's layup pushed the lead to 95-80 late in the third quarter, but Oklahoma City outscored the Clippers 13-4 in the final two minutes of the period to cut its deficit to 99-93. Derek Fisher hit two 3-pointers to start the rally, and then Durant made a 3 with 1.6 seconds left in the quarter.\nThe Thunder trimmed the Clippers' edge to a point on a pair of free throws by Jeremy Lamb, and Fisher tied it at 107 on a 3-pointer with just over six minutes to play.\nThe Clippers kept the offense working from there, holding on for a win that they hope launches their playoff push.\n\"It's very important,\" Crawford said. \"Coming down the stretch, we just want to continue to do our game, every single night, no matter who we're playing. It doesn't matter. As long as we keep getting better down the stretch, I think we'll be in good shape.\"\n\nGame notes\n\nThe Clippers made their first five shots. ... Thunder center Kendrick Perkins missed Sunday's game against the Los Angeles Clippers with a strained left groin. He was injured during the third quarter of Oklahoma City's loss to Miami on Thursday night. Steven Adams, a rookie, got his third career start in Perkins' place. ... Rivers and Crawford were issued technical fouls in the first quarter. Paul was given one in the second quarter. ... Clippers guard J.J. Redick sat out with a bulging disc in his lower back. He had missed the previous six games. He has played in just 30 games this season while dealing with wrist, hip and back injuries. He averages 15.7 points and 2.2 assists per game.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.788644",
  "pipeline_version": "v1"
}