{
  "game_id": "0022100672",
  "espn_id": "401360491",
  "date": "Jan 19, 2022",
  "matchup": "MIA vs. POR",
  "headline": "Short-handed Heat pull away late, top Trail Blazers 104-92",
  "cleaned_body": "MIAMI -- — The leading scorer had just been placed in the NBA's health and safety protocols. The point guard is out for personal reasons. The team leader got ejected just before halftime.\n\nNone of that derailed the Miami Heat.\n\nCaleb Martin scored 26 points, Bam Adebayo added 20 points and 11 rebounds, and the short-handed Heat cranked up the defense in the fourth quarter to beat the Portland Trail Blazers 104-92 on Wednesday night.\n\n“I bet that was my boss' favorite fourth quarter of the season,” Heat coach Erik Spoelstra said.\n\nOh, that's for certain: Heat President Pat Riley surely was loving this.\n\nStarting with the final minute of the third quarter, Miami forced Portland into 5-of-26 shooting (19%) to end the game, including misses on each of the Trail Blazers' final 12 tries from 3-point range.\n\nBlazers coach Chauncey Billups said the Heat wore Portland down, “which is a compliment to them.\"\n\n“You’ve got to give them credit,” Billups said. “But I was happy with how hard we played in the game, the entire game.\"\n\nMax Strus scored 15 points for Miami, including a 3-pointer with 2:01 remaining that put the Heat up 10. Dewayne Dedmon scored 12 for the Heat, who started the game without Kyle Lowry and Tyler Herro — then lost Jimmy Butler to a first-half ejection.\n\nLowry missed the game for personal reasons. Herro entered the NBA’s health and safety protocols on Wednesday.\n\nAnfernee Simons scored 27 points, CJ McCollum scored 24 and Jusuf Nurkic finished with 18 points and 14 rebounds for Portland. Robert Covington added 11 points and 12 rebounds for the Blazers.\n\n“Their athleticism and length kind of disrupted us a little bit,\" Simons said.\n\nMcCollum hit a jumper to tie the game at 87-87 with 6:57 left. The Heat outscored the Blazers 17-5 from there.\n\nGabe Vincent scored 11 for Miami, which held a 58-12 lead in bench scoring.\n\n“Underdog mentality,\" Adebayo said.\n\nButler was ejected with 2:28 left in the first half, arguing on a play where he scored and got fouled by Nurkic. Referee Mousa Dagher, who was under the basket, did not call a foul; referee Eric Dalen indicated one and the NBA’s play-by-play report said referee Courtney Kirkland, along the left sideline, actually called the foul.\n\nBut Butler took offense with Dagher not calling it and marched right toward him, shouting. Dagher called a technical foul, as would be expected following the hostile reaction. Butler walked away and continued saying something, though he did not appear to be directing anything toward a specific referee. Kirkland called the second technical, prompting the automatic ejection.\n\n“Jimmy walked away,\" Spoelstra said. “I really commend him for that.\"\n\nTIP-INS\n\nTrail Blazers: Portland has, by far, the best regular-season record of any team visiting Miami. Even with the loss, the Blazers are 21-12 on the Heat's home floor, well ahead of second-best Oklahoma City’s 18-14 record at Miami when including the Seattle years. ... Portland had 10 3-pointers in the first half, the eighth time that’s happened by intermission for the Blazers this season.\n\nHeat: Herro turns 22 on Thursday. He scored more points — 2,344 — by his 22nd birthday than anyone in Heat history, 65 more than Michael Beasley. They’re well ahead of all others; Adebayo is third with 1,206. ... Omer Yurtseven’s streak of 14 consecutive double-digit rebound games ended because he played 7.4 seconds to end the first half. He hasn’t been in the rotation since Adebayo returned on Monday.\n\nAFTER BUTLER\n\nWhen Butler got ejected, the Heat were without 40% of their scoring this season. Herro, Butler and Lowry, in that order, are Miami’s leaders in total points.\n\nBLAZERS MOVES\n\nPortland announced a number of front-office hirings and promotions Wednesday, including one that was of particular interest in Miami. Sheri Sam — who played in all but one of the 96 games that the Miami Sol were part of in their three NBA seasons, 2000 through 2002 — is the Trail Blazers’ new scouting manager. Sam will work with Portland’s basketball operations staff on player evaluation, information gathering, the salary cap and basketball analytics. She was the leading scorer and rebounder in Sol history.\n\nUP NEXT\n\nTrail Blazers: Visit Boston on Friday.\n\nHeat: Visit Atlanta on Friday.\n\n------",
  "tags_rule": [
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.241152",
  "pipeline_version": "v1"
}