{
  "game_id": "0021700143",
  "espn_id": "400974894",
  "date": "Nov 05, 2017",
  "matchup": "MIN vs. CHA",
  "headline": "Teague's double-double leads Wolves past Hornets",
  "cleaned_body": "MINNEAPOLIS --  Jeff Teague spent the first quarter getting his Timberwolves teammates into the game. He spent the rest of the night taking the Hornets out of it.\n\nTeague had 18 points and 12 assists, and Minnesota beat Charlotte 112-94 on Sunday for its fifth straight victory.\n\nTeague scored just two points but dished out seven assists as the first quarter ended with the teams tied at 28. But in the second quarter, Teague took over the scoring duties, hitting three 3-pointers in transition as Minnesota pulled out to a 17-point lead and never looked back.\n\n\"We've got so much talent on this team, so many guys who can do so many things,\" said Teague, who signed with the Timberwolves after spending seven years in Atlanta and one in Indiana. \"I think it's my role to try to get those guys going, and then things will come a little easier to me.\"\n\nAndrew Wiggins led Minnesota with 20 points, while Karl-Anthony Towns, Jimmy Butler, Gorgui Dieng and Jamal Crawford all reached double figures in scoring.\n\n\"He's not only scoring, he's getting everyone else involved,\" Butler said of Teague. \"When he's playing at a high level, it's so much easier for everybody to follow.\"\n\nThe Timberwolves moved to 7-3 on the young season, just a half-game behind Houston for the top spot in the Western Conference. The last time Minnesota won five games in a row was Jan. 2-10, 2009.\n\nCody Zeller led Charlotte with 16 points, while Marvin Williams, Dwight Howard and Jeremy Lamb each scored 13 points for the Hornets. All-Star Kemba Walker was limited to nine points on 4-for-15 shooting.\n\n\"We weren't there. Our talk was off, our communication was bad, we weren't getting to our spots,\" Hornets forward Frank Kaminsky said. \"It's just, we didn't play well on defense. That's the end of the story.\"\n\nMinnesota pulled out to a double-digit lead on the strength of a 12-2 run midway through the second quarter. The flurry culminated in three 3-pointers on three straight shots. Teague pulled up in transition and hit the first two; on the next possession, he called for the ball at the top of the key, and when Howard closed hard on Teague, the Timberwolves' assist leader slipped a pass to Butler, who drained a 3 from the wing.\n\nTeague later added another 3-pointer and a driving layup for 11 points in the quarter as Minnesota led 68-51 at the half.\n\n\"I thought he had a good blend when the game was hanging in the balance in the second quarter,\" Timberwolves coach Tom Thibodeau said. \"He had three 3s that sort of opened it up. I think when he does that, it puts more pressure on the defense to come up, and that opens up other things.\"\n\nWith six players scoring at least 13 points, a 54-38 rebounding edge and 30 free throw attempts, the Timberwolves put together one of their strongest all-around games of the season. But the point guard who's been in Minneapolis for all of 10 games knows there's plenty of work left to do.\n\n\"It's still a work in progress. We're still trying to figure out each other,\" Teague said. \"We're starting to get into a little groove but we're miles away from the team we want to be.\"\n\nTIP-INS\n\nHornets: F Michael Kidd-Gilchrist missed his second straight game due to personal reasons. ... The Hornets have lost two straight after posting a season-high, three-game winning streak. . Charlotte dropped to 1-4 on the road. Last season the Hornets were 22-19 at home but won just 14 road games.\n\nTimberwolves: Teague's double-double was his fourth in the last five games. ... The last time the Wolves were four games over .500 was on Jan. 15, 2007, when they were 20-16. . The Wolves were playing the second half of a back-to-back stretch.\n\nDON'T LOOK BACK\n\nWinning streaks aren't a common occurrence for the Timberwolves, who haven't made the playoffs since the 2003-04 season. That's also the last time they've won more than five consecutive games. But with a three-game trip coming up next, Thibodeau said his team won't be thinking about extending streaks.\n\n\"This will be a great test for us,\" said Thibodeau, whose team plays at Golden State, Phoenix and Utah in the next week. \"If we're looking back at what happened here, we won't be ready for what's coming.\"\n\nUP NEXT\n\nHornets: At New York on Tuesday.\n\nTimberwolves: At Golden State on Wednesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.555549",
  "pipeline_version": "v1"
}