{
  "game_id": "0021401022",
  "espn_id": "400579314",
  "date": "Mar 20, 2015",
  "matchup": "MIL @ BKN",
  "headline": "Lopez, Nets pull out 3-overtime victory over slumping Bucks",
  "cleaned_body": "NEW YORK --  Jason Kidd's games in Brooklyn now last almost as long as his coaching tenure did.\n\nThe Nets and Milwaukee Bucks played three overtimes here for the second time this season, the home team pulling this one out 129-127 Friday night despite Kidd's team pulling down an NBA season-high 81 rebounds.\n\nThat helped Milwaukee put up 129 shots, most in the league and 22 more than Brooklyn, but the Nets overcame all that.\n\n\"We just fought tonight. Being down in so many difficult situations throughout the game, guys just didn't give up. We played like a desperate basketball team tonight,\" said Jarrett Jack, who got almost all the minutes after the third quarter while Deron Williams sat.\n\nBrook Lopez had 32 points and a season-high 18 rebounds, throwing down a powerful dunk on a three-point play to open the scoring in the third OT, and the Nets finally held on to hand the Bucks their fifth straight loss. It's the first time teams played two triple-overtime games against each other in the same season, according to research provided to the Nets by Elias.\n\n\"It wasn't just that one play,\" Lopez said. \"We stuck with it the entire game. We never gave up. We were down big and our bench was huge.\"\n\nMilwaukee had pulled out a 122-118 triple-overtime win here on Nov. 19 in Kidd's first trip back to face the team he coached to the second round last season. The Bucks (34-35) led this game by 14 points in the second half before falling for the 10th time in 12 games, dropping below .500 for the first time since December.\n\nZaza Pachulia had 22 points, 21 rebounds -- an NBA season-high 18 offensive -- and seven assists for Milwaukee.\n\n\"It was a great fight,\" Kidd said. \"Everybody spent a lot of energy tonight, but that's what it takes for us to win and unfortunately we came up with the `L'.\n\nThaddeus Young scored 24 points and Joe Johnson had 20 for the Nets, who stopped a four-game home losing streak.\n\nKhris Middleton finished with 29 points, eight rebounds and six assists for Milwaukee. Giannis Antetokounmpo had 23 points and 14 rebounds, and Ersan Ilyasova added 20 points and 13 boards, but both fouled out in the third overtime.\n\nIlyasova's sixth came while trying to stop what became Lopez's dunk over him, and Lopez followed the three-point play with another basket for a 122-117 lead. Milwaukee nearly tied it again, but Middleton's 3-point attempt spun out in the closing seconds and Johnson's free throw made it 129-125 with 8.1 seconds to play.\n\nThe Bucks dropped their 10th straight on the road, where they haven't won since Feb. 2 at Toronto. They are just 4-12 since the trade deadline deal that sent Brandon Knight to Phoenix and brought them Michael Carter-Williams from Philadelphia but remain the No. 6 seed in the Eastern Conference.\n\nThe Nets are just trying to get in the postseason, 1 1/2 games out of the eighth spot, and got a sorely needed home win. They came in as the only team in the NBA with a better road than home record.\n\nMilwaukee scored a season-high 68 points in the first half and stretched its lead to 79-65 midway through the third. Johnson's 3-pointer tied it at 101 with 1:19 left in regulation, with Antetokounmpo missing a jumper with a second left.\n\nHe made up for that with the tying jumper with 15 seconds remaining in the first OT. Johnson's miss sent it to the next overtime, and he got it right in the next OT with a tying 3-pointer with 18 seconds to go.\n\nTIP-INS\n\nBucks: Milwaukee's previous best half was 66 points against the Knicks on Nov. 18 in a 117-113 victory. ... The Bucks fell to 10-3 against the Atlantic Division. They hadn't lost to any other team besides division leader Toronto.\n\nNets: Lopez has six double-doubles in 15 games since the All-Star break. He had five in 42 games before the break. ... The Nets matched their franchise record for most home OT games in a single season. They also played six in the 2010-11 season in Newark.\n\nKIDD'S TAKE\n\nKidd, defending the deal: \"Sometimes you've got to look in front of you and so I think the trade was a good thing, a positive thing no matter how our record shakes out. We're here to build something, not to do something in six months, right. This is a bigger picture and so we feel that we have a core here that will be around for a long time and have success.\"\n\nUP NEXT\n\nBucks: Host Cleveland on Sunday.\n\nNets: Visit Indiana on Saturday.",
  "tags_rule": [
    "DoubleDouble",
    "Streak",
    "FoulTrouble"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.818731",
  "pipeline_version": "v1"
}