{
  "game_id": "0021400033",
  "espn_id": "400578325",
  "date": "Nov 01, 2014",
  "matchup": "DET vs. BKN",
  "headline": "Nets earn first win, beat Pistons 102-90",
  "cleaned_body": "AUBURN HILLS. Mich. --  Joe Johnson and Lionel Hollins have separate histories beating up the Detroit Pistons.\n\nSaturday, they got to do it together.\n\nJohnson scored 15 of his 34 points in the final eight minutes and Hollins beat the Pistons for the 10th time in 11 tries as the Brooklyn Nets pulled away to win 102-90.\n\n\"I was moving pretty good, and we just started executing and hitting big shot after big shot,\" Johnson said. \"We had a lot of mistakes and we let the lead slip away in the fourth quarter, but then Coach called a timeout and we got things back together.\"\n\nJohnson has averaged 16.4 points in 40 career games against Detroit, but has rarely looked more impressive than he did Saturday against Stan Van Gundy's team. Johnson was 14 of 23 from the floor, torching everyone the Pistons tried against him, and added eight rebounds.\n\n\"We got blown up by a great player,\" Van Gundy said. \"I've been coaching against him for a long time, and as you can see, I still haven't found a way to stop him. We wanted to double him, but he was making 23-footers, and you don't want to run a guy out that far. At the end, we didn't have a choice.\"\n\nThe Pistons (0-3) got 18 points and 11 rebounds from Greg Monroe, who was making his season debut after a two-game suspension for a drunk-driving arrest, but shot 1 for 17 on 3-pointers.\n\n\"Obviously, 5.9 percent isn't going to get you anywhere on 3-pointers,\" Van Gundy said. \"A lot of that is on me, because I still don't have a handle on what this team can do offensively.\"\n\nKevin Garnett added 18 points and 14 rebounds for the Nets (1-1), while Deron Williams scored 15.\n\n\"Being 1-1 is obviously better than being 0-2, but I would have been proud of the way this team (played) no matter what happened,\" Hollins said.\n\nThe Nets led 59-47 after a first half that saw them score at least 25 points against Pistons small forward Kyle Singler. Singler struggled against Johnson, who had 17 in the first half, and was beaten badly by Williams for three straight baskets.\n\nThe Pistons were able to protect Singler a little more in the third quarter, and with Monroe available, they were able to withstand Andre Drummond's third straight game with foul trouble.\n\nThat let them stay within 81-75 at the end of three, and they took a 84-83 lead when Caron Butler hit three free throws with 8:49 to play. Drummond, though, picked up his fifth foul moments later, and Johnson scored the next seven points to put Brooklyn back in front.\n\nKentavious Caldwell-Pope ended the Nets' run with a jumper, but the Pistons weren't able to do anything with Johnson.\n\n\"It's crazy,\" Garnett said. \"I've got the best seat in the house to be able to watch him. I told him after this one that he played an awesome game.\"\n\n---\n\nTIP-INS\n\nNets: Garnett was booed every time he touched the ball, just as he has been at the Palace of Auburn Hills since the Celtics beat the Pistons in the 2008 Eastern Conference finals.\n\nPistons: The game was the official debut of the multi-million dollar renovations of the 26-year-old Palace, highlighted by a massive six-screen videoboard at center court. The new technology was used as part of a halftime tribute to Detroit that included a surprise appearance by Kid Rock. . The Pistons shot 25 percent (8 for 32) outside the paint.\n\nTURNING POINT\n\nAfter the Pistons took the lead on Butler's free throws, Johnson outscored the Pistons 15-2 in a stretch of just under five minutes. \"What can you say when a guy gets hot like that? We just tried to get him the ball in a good position and he took over the game,\" Hollins said.\n\nNUMBERS\n\nThrough three games, the Pistons are shooting 21.9 percent on 3-pointers, but taking more than 20 a game. Josh Smith (0 for 6) and Caldwell-Pope (2 for 16) have struggled the most.\n\nUP NEXT:\n\nNets: Host Oklahoma City on Monday.\n\nPistons: Host New York on Wednesday.",
  "tags_rule": [
    "ReturnFromInjury",
    "FoulTrouble"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "ReturnBoost",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.683220",
  "pipeline_version": "v1"
}