{
  "game_id": "0021300580",
  "espn_id": "400489453",
  "date": "Jan 16, 2014",
  "matchup": "OKC @ HOU",
  "headline": "Thunder prevail after Rockets set record for futility in 2nd half",
  "cleaned_body": "HOUSTON -- Oklahoma City coach Scott Brooks showed his team each of the 12 3-pointers Houston made in its 73-point first half Thursday night.\n\nThe halftime video session worked. The Rockets didn't make another 3, and were held to a franchise-low in points in the second half of the Thunder's 104-92 win.\nKevin Durant scored 36 points and Reggie Jackson added 23 to lift Oklahoma City to the victory.\nJames Harden and Terrence Jones scored 16 points apiece for Houston, which had just 19 second-half points after its season-best performance in the first half -- setting an NBA record for the largest scoring differential between two halves. Houston's 19-point second half is tied for the second-fewest points in a second half in NBA history.\n\"I've never seen anything like that,\" Brooks said. \"That's inspiring.\"\nHouston coach Kevin McHale was troubled by his team's inability to build on its great first half.\n\"We had a terrible time shooting the ball, laying it in, making simple plays,\" McHale said. \"We couldn't sustain anything offensively in the second half. Give them credit. They got out and got after us.\"\nThe Rockets took to Twitter after the game to add some levity to the situation:\n\nFirst half = Godfather 1 & 2. Second half = Godfather 3.\n— Houston Rockets (@HoustonRockets) January 17, 2014\n\nThe Thunder used a big third quarter to erase a 12-point deficit and tie the score entering the fourth. The teams stayed within a basket after that until Jackson scored five points in a 7-0 run which gave the Thunder a 97-89 lead with about 4 minutes left.\nOklahoma City stretched its advantage to 103-92 on a fast-break dunk by Jackson with 1:18 to go.\nDurant shook his head when asked about the vast difference in Oklahoma City's defense after halftime. Along with shutting down Houston's 3-point shooting, the Thunder also held Harden scoreless after the break.\n\"We were able to come down and stifle them a little bit and get them out of their rhythm,\" Durant said. \"They're a great offensive team. They score the ball so quickly. I think we did a great job of just putting pressure on them.\"\nOklahoma City was up by eight when Houston's Dwight Howard and Kendrick Perkins got tangled up fighting for a rebound. The two had to be separated and Perkins received a personal foul and they both were slapped with technicals for the scuffle.\nSerge Ibaka added 21 points and 15 rebounds for the Thunder. Howard had 11 points and eight rebounds for the Rockets.\n\nJeremy Lamb's 3-pointer early in the fourth quarter made it 86-85, giving Oklahoma City its first lead since early in the second quarter. The teams each scored a basket after that before both offenses went silent, with neither team scoring for about a 3-minute span.\nJackson ended Oklahoma City's scoring drought with a reverse layup with about 7 minutes remaining before Chandler Parsons ended Houston's with a bucket about a minute later to cut the Thunder's lead to 90-89.\nThe Rockets had a 12-point lead with about 4 minutes left in the third quarter before Oklahoma City went on a 15-3 run to tie it at 83 entering the final period. Ibaka scored four quick points to get the spurt going and also had a 3-pointer in that span.\nDurant had the big finish for the run, taking Parsons off the dribble and pulling up to sink a 3-pointer at the buzzer. Durant fell backward to the court after the shot and flipped over before getting up wearing a huge grin as he was mobbed by teammates.\nAfter matching a season high with 41 points in the second quarter, the Rockets had a terrible third, scoring just 10 points, and their nine points in the fourth were a season low.\nThe Thunder led by seven in the second quarter before Houston got going. The Rockets used a 9-0 run, powered by four points from Jones, to take a 43-41 lead with about 8 minutes left in the quarter. Harden had a nifty play near the end of that run when he hit an off-balance layup before crashing to the court.\nHouston capped the 41-point quarter with a 13-1 spurt to take a 73-59 lead into halftime. Parsons hit two 3s in that run and Donatas Motiejunas added a third.\nDurant was having a tough first quarter and had three turnovers before getting going in the last 1 1/2 minutes of the period. He scored all nine of the Thunder's last points of the quarter to leave Oklahoma City up 36-32 entering the second.\nHe had two dunks and was fouled on a 3-pointer and made all three free throws in that span.\nGame notes\nHouston's 73 points in the first half were a season high for a half. ... McHale received a technical foul for arguing with the officials in the second quarter.\nThe Associated Press contributed to this report.",
  "tags_rule": [
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.659417",
  "pipeline_version": "v1"
}