{
  "game_id": "0021700645",
  "espn_id": "400975391",
  "date": "Jan 15, 2018",
  "matchup": "MEM vs. LAL",
  "headline": "Brooks scores 19 to lead Grizzlies over Lakers 123-114",
  "cleaned_body": "MEMPHIS, Tenn. --  The Los Angeles Lakers had won four straight games behind a stalwart defense. It didn't come with them to Memphis.\n\nThe Grizzlies shot 51 percent from the field and 46 percent from 3-point range, and eight Memphis players reached double figures in a 123-114 victory over the Lakers on Monday.\n\n\"We let them move the ball wherever they wanted,\" said Lakers coach Luke Walton, whose team had limited opponents to an average of 95.3 points during the winning streak. \"... They just didn't feel us. That's not how we've been playing defense over this stretch.\"\n\nDillon Brooks matched his season best with 19 points while Marc Gasol had 17 points and seven rebounds for Memphis. Tyreke Evans had 15 points and 12 assists. Wayne Selden and James Ennis III added 13 points each.\n\nBrooks converted his first four shots, starting with a pair of 3-pointers. The Grizzlies kept hitting shots into the third, making 12 of 23 to build a 97-77 entering the fourth.\n\n\"I just felt confident in my shot,\" said Brooks, who finished 6 of 8 from the field, including 4 of 5 from outside the arc. \"... Coach (J.B. Bickerstaff) has been stressing shoot and shoot with confidence. Once the first shot went in, I felt good.\"\n\nThe Lakers were without Lonzo Ball, who injured his left knee in Saturday's overtime win at Dallas, and Brandon Ingram also didn't play because of a left ankle sprain.\n\nKentavious Caldwell-Pope led Los Angeles with 27 points, while Kyle Kuzma finished with 18. Josh Hart had 16 points, including 10 in the fourth quarter when the Lakers cut a 20-point lead down to single-digits in the final minutes.\n\n\"We weren't aggressive on defense,\" Caldwell-Pope said. \"We weren't helping each other. ... We couldn't get stops.\"\n\nTIP-INS\n\nLakers: Los Angeles signed G Gary Payton II to a two-way contract. He appeared in 12 games for the Milwaukee Bucks, six of them starts, averaging 2.5 points and 1.4 rebounds. He scored four points in 12 minutes against Memphis. ... The Lakers have lost seven straight road games in the series, and their last win in Memphis was in December 2013.\n\nGrizzlies: This was the 16th annual game for the Grizzlies on Martin Luther King Day. King was killed on April 4, 1968 at the Lorraine Motel a short distance from FedExForum. ... The Grizzlies are now 7-9 on games surrounding MLK festivities. ... The Grizzlies honored former NBA players Sam Perkins, James Worthy and Anfernee `Penny' Hardaway, along with WNBA player Swin Cash with the 13th Annual National Civil Rights Museum Sports Legacy Awards. ... F Deyonta David recorded his third block -- a career-best -- in the second quarter. He ended the night with five.\n\nREMEMBERING MLK\n\nAs it does annually, the game brings out thoughts from coaches about the importance of playing on the Martin Luther King holiday.\n\n\"It's an absolute honor,\" Walton said, adding of King: \"What really separates him, is he really emphasized doing it through a peaceful manner.\"\n\nBickerstaff, Memphis' interim coach, said it is a matter of recognizing the price paid by others in the fight to reach where players are today.\n\n\"When you have this opportunity to pay that respect, you do this job with the best of your ability and you give everything you've got in honor of those who had to fight those fights for you,\" Bickerstaff said.\n\nNO LONZO\n\nBall said he must wait until he can run better and swelling goes down. When asked if he thought he might be able to test it in the next day or so, he replied: \"If it's like today, probably not.\"\n\nUP NEXT\n\nLakers: Close out a three-game trip at Oklahoma City on Wednesday night.\n\nGrizzlies: Host the New York Knicks on Wednesday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.251026",
  "pipeline_version": "v1"
}