{
  "game_id": "0021700957",
  "espn_id": "400975703",
  "date": "Mar 06, 2018",
  "matchup": "CHA vs. PHI",
  "headline": "Covington, hot-shooting 76ers rout Hornets 128-114",
  "cleaned_body": "CHARLOTTE, N.C. --  The Philadelphia 76ers are pretty tough inside when center Joel Embiid is on the court.\n\nNow if the young 76ers can move the ball and hit 3-point shots like they did Tuesday night, they may prove to be a tough out in the Eastern Conference playoffs.\n\nThe 76ers had 35 assists and hit 16-of-33 shots from beyond the arc in an easy 128-114 win over the Charlotte Hornets.\n\nRobert Covington led the way with 22 points on five 3-pointers, while rookie sensation Ben Simmons chipped in with 16 points, 13 assists and eight rebounds. Dario Saric had 19 points and Embiid added 18 as part of a balanced scoring attack.\n\n\"We have to make 3s,\" 76ers coach Brett Brown said. \"Joel draws a crowd and gets a lot of attention. When Cov is scoring it does help, but what really helps is being able to punish the double-teams on Joel with a sort of a lethal 3-point line attack. It stings. It's deflating when you play kick out, 3-ball, 3-ball, 3-ball.\"\n\nThe 76ers shot 57.5 percent from field.\n\nCovington was 7 of 11 from the field and 5 of 9 from 3-point range. He said he knows when he's knocking down shots it changes everything for his team.\n\n\"It opens the floor a whole lot,\" Covington said. \"It gives Joel a lot more room to play, Ben slashes and Dario gets wide-open looks.\"\n\nDwight Howard had a season-high 30 points and grabbed six rebounds, while Nic Batum had 12 points and 10 assists for Charlotte, which fell seven games out of the final playoff spot in the Eastern Conference with 17 games remaining.\n\nEmbiid dominated Howard in Friday's 110-99 win in Philadelphia with 23 points and 15 rebounds to Howard's six points and six rebounds. Howard was much better this time around, but he didn't get much help from this teammates. Charlotte's other starters were a combined 9 of 26 from the field.\n\nIt didn't help the Hornets that top defender Michael Kidd-Gilchrist was ejected in the second quarter after picking up a second technical foul for disputing a non-call on a drive to the basket.\n\nSimmons only took nine shots against the Hornets, but made eight of them. When he wasn't scoring at will, he was finding open teammates for open baskets.\n\n\"I try not to get caught up in what people say,\" Simmons said. \"Some people want me to score more and do certain things. I try not to feed into that. I don't have to be a guy that comes out and has 30 points every game right now. I think the best thing I can do out there is find my teammates and do what I'm really good at and that's finding guys.\"\n\nTIP INS\n\n76ers: Outrebounded the Hornets 44-33. ... Had 35 assists to Charlotte's 26.\n\nHornets: Howard picked up his 14th technical foul of the season for arguing a call. ... Howard made a 3-pointer to beat the buzzer at halftime and celebrated by blowing a kiss to the crowd.\n\nWALKER'S WOES\n\nKemba Walker might be starting to show signs of fatigue after carrying this team all season. The All-Star point guard was 1 of 9 from the field and was held to a season-low five points.\n\n\"Listen, he's not a machine,\" Hornets coach Steve Clifford said. \"I mean he's a human being and he's played at such an incredibly high level all year that, you're going to have games now and then where you're not. Sooner or later you're not going to get 27 every night, you're just not.\"\n\nMONK'S MINUTES\n\nHornets rookie Malik Monk saw some playing time at point guard with Michael Carter-Williams out with a shoulder injury. He was 3 of 10 from the field and had nine points and two assists.\n\n\"I thought he did a good job,\" Clifford said. \"We were organized when he was on the floor and we'll watch the film and we'll take things that he can learn from and grow.\"\n\nLUKE STILL KING\n\nMake no doubt it, Luke Kuechly is still king in Charlotte. The crowd erupted into a loud chorus of \"Luuuuuuke\" after the beloved Panthers perennial All-Pro linebacker was shown sitting courtside on the big screen.\n\nUP NEXT\n\n76ers: Visit Miami on Thursday night.\n\nHornets: Host Nets on Thursday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "PhysicalGame",
    "InjuryReport",
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.356052",
  "pipeline_version": "v1"
}