{
  "game_id": "0021300564",
  "espn_id": "400489437",
  "date": "Jan 14, 2014",
  "matchup": "OKC @ MEM",
  "headline": "Marc Gasol returns as Grizzlies slip Thunder despite Kevin Durant's 37",
  "cleaned_body": "MEMPHIS, Tenn. -- The Memphis Grizzlies celebrated the return of Marc Gasol with a victory over one of the league's top teams -- and one of their biggest rivals.\nCourtney Lee scored a season-high 24 points, including the closing two free throws, and the Grizzlies beat the Oklahoma City Thunder 90-87 on Tuesday night in Gasol's first game in almost eight weeks.\nWhile Lee provided the early offensive punch for Memphis, many teammates were talking about the return of the Gasol, the league's reigning Defensive Player of the Year, who missed 23 games with a left knee injury. The 7-foot-1 center played 24 minutes and finished with 12 points.\n\n\"Everybody is excited, especially for him,\" said guard Mike Conley, who had 19 points and seven assists in Memphis' third straight victory. \"He's been itching to get out there forever, and I thought he did great. It gave us a good boost.\"\nGasol, whose return was not announced until just before the game, received a rousing ovation from the Memphis crowd when he was introduced with the starting lineup. He said the cheers gave him \"goose bumps\" and made him feel like a rookie again. He said the knee did not bother him, but the large knee brace he is wearing is uncomfortable.\n\"It felt really good, especially since we got the win,\" Gasol said of the knee. \"That makes everything worth it.\"\nZach Randolph had 23 points and 13 rebounds on the night his inside partner returned.\nKevin Durant led the Thunder with 37 points, converting 15 of 28 shots. Reggie Jackson scored 17, but also committed seven of Oklahoma City's 19 turnovers. Serge Ibaka finished with 11 points and four blocks as the Thunder lost their third in the last four.\nDurant, who has dealt with an aching left wrist and did not practice Monday, had ice on it after the game, but said he did not aggravate the injury.\nLee converted a 22-footer from the right wing as time ran out in the third period to help Memphis carry a 72-67 lead into the final frame.\nMemphis, which trailed 47-43 at the break, converted 10 of 18 shots in the third, while the Thunder managed only 9-of-22. That led to the Grizzlies outscoring Oklahoma City 29-20 in the period.\nMemphis still held the lead at 87-84 with less than a minute left. Jackson missed a 4-foot runner, then Gasol missed a 7-footer in the lane for Memphis. Oklahoma City had the ball after a timeout with 20 seconds left. Durant drove and kicked the ball out to Ibaka, who missed a 3-pointer from the left corner.\n\"I seen (the defender) come off of Serge and he was wide open, and I trust him 100 percent,\" Durant said. \"That shot looked good, but it hit the side rim and rimmed out.\n\"Great shot. We've just got to live with the results.\"\nRandolph split a pair of free throws with 10.6 seconds remaining for an 88-84 lead, enough that Ibaka's 3-pointer with 4.6 seconds left wasn't enough.\nLee's free throws provided the final margin.\n\"Courtney Lee had his way,\" Oklahoma City coach Scott Brooks said. \"We didn't do a good job of starting the game off on him. Throughout the game, he sprinkled in some good shots.\"\nThe Thunder weathered an early burst of points from Lee, who had 14 in the first quarter as Memphis built a 12-point lead.\nOklahoma City erased the advantage with a 15-1 rally spanning the first and second quarters.\nGame notes\nThe Grizzlies went 10-13 when Gasol was out of the lineup. ... Despite traveling with the team and warming up before the game, Thunder G Russell Westbrook remained on the inactive list recovering from right knee surgery. ... Lee's previous season high was 18 on Dec. 13 against the Knicks when he was with Boston. ... Thunder C Kendrick Perkins now has almost as many fouls (105) as points scored this season (117). ... The game marked only the fourth time this season the Thunder has lost when outrebounding their opponent.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.667405",
  "pipeline_version": "v1"
}