{
  "game_id": "0021700588",
  "espn_id": "400975334",
  "date": "Jan 07, 2018",
  "matchup": "OKC @ PHX",
  "headline": "Reserves Bender, Jackson help Suns beat Thunder 114-100",
  "cleaned_body": "PHOENIX --  Dragan Bender and Josh Jackson were fourth overall picks in the draft: Bender in 2016, Jackson in 2017.\n\nBoth are just 20 years old, and the jury is out on whether they deserved to go that high.\n\nThey sure looked good Sunday night, though.\n\nBender scored 17 of his career-high 20 points in the second half, Jackson had 17 points and 10 rebounds in the first double-double of his rookie season, and the Phoenix reserves played a big role in the Suns' 114-100 victory over the Oklahoma City Thunder.\n\n\"We're trying to develop young players here and they both stepped up big-time today,\" Suns interim coach Jay Triano said. \"I thought they played really well together. Josh would drive and kick and find Dragan on the perimeter and I think there's a comfort level really developing with those two.\"\n\nBender made a career-best six 3-pointers, going 5 of 6 in the second half. The Suns beat the Thunder for the third straight time dating to last season, with all three wins coming in Phoenix.\n\nRussell Westbrook had his 14th triple-double of the season and second in a row with 26 points, 11 assists and 10 rebounds, but Oklahoma City never led after the first quarter. Paul George added 19 points and Steven Adams 18 for the Thunder.\n\nDevin Booker scored 26 and T.J. Warren 23 for Phoenix.\n\nThe Suns made a season-high 17 3s in 39 attempts while Oklahoma City was 8 of 27.\n\n\"We like the way we played,\" Triano said. \"We shot a lot of 3s, which is what we want to do. We got into our drive-and-kick game. I thought we were solid defensively. I think they missed a bunch of shots as well. This is a game that we feel really good about and it's a step for us. It's a step for us for sure.\"\n\nBooker's 3-pointer gave Phoenix a 74-60 lead with 7:56 left in the third, but the Thunder responded with a 15-2 run. Westbrook made one of two free throws to cap the outburst and cut the lead to 76-75 with 5:03 left in the period.\n\nBender's 3 ignited a 14-4 Suns surge, Jackson's 3-pointer boosting the lead to 90-79 with 32 seconds left in the quarter. Carmelo Anthony's three-point play cut the lead to 90-82 entering the fourth.\n\nBender sank two more 3s to start a 14-2 outburst that put Phoenix up 107-89 after Tyler Ulis' 3-pointer with 6:42 remaining.\n\n\"All my 3s in the second half were wide-open 3s,\" Bender said. \"We moved the ball really well. They gave us some open shots.\"\n\nBender also had six rebounds, four assists and three blocked shots.\n\nThe Thunder had beaten the Lakers and Clippers on the three-game road trip before losing Sunday.\n\n\"In the first half we did not play like we had played the last couple of games,\" Oklahoma City coach Billy Donovan said. \"Then we tried to get back to that level. We got back to it for a little bit but we couldn't get all the way there.\"\n\nTIP-INS\n\nThunder: Westbrook moved past Larry Bird into 40th on the NBA career assist list. ... Westbrook missed four of seven free throws. The Thunder were 12 of 21 at the line. ... Terrance Ferguson fouled out with 7:42 to play. ... George and Westbrook are 1-2 in the NBA in steals. George had one, Westbrook two in the game. ... Westbrook has 93 career triple-doubles.\n\nSuns: The 14-point winning margin matched Phoenix's biggest of season. ... Suns committed season-low seven turnovers. ... Marquese Chriss left the game with a right hip strain in the second quarter and did not return. He had scored in double figures the previous five games. ... Warren was back after missing a game due to illness. ... Tyson Chandler had 13 rebounds and needs 22 to become 40th player in NBA history with 10,000.\n\nBENCH BLOWOUT\n\nThe Suns reserves outscored their Oklahoma City counterparts 48-21, 28-11 in the second half.\n\nJackson made a career-high three 3s in six tries. Bender was 6 for 9.\n\nJackson became the first Suns rookie to have at least 10 points, 10 rebounds and five assists in a game since Joe Johnson on Feb. 22, 2002.\n\nUP NEXT\n\nThunder: Host Portland on Tuesday night.\n\nSuns: Host Houston on Friday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "TripleDouble",
    "FoulTrouble",
    "CoachComment",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.718367",
  "pipeline_version": "v1"
}