{
  "game_id": "0022100621",
  "espn_id": "401360440",
  "date": "Jan 12, 2022",
  "matchup": "ATL vs. MIA",
  "headline": "Herro's 21 points lead Heat past slumping Hawks, 115-91",
  "cleaned_body": "ATLANTA -- — Tyler Herro and other young Miami players are finding ways to keep the Heat winning without some of their biggest names.\n\nHerro had 21 points and Miami scored the first 16 of the second half to break open a close game as the Heat capped a successful road trip by beating the Atlanta Hawks 115-91 on Wednesday night.\n\nHerro added 11 assists to lead short-handed Miami's balanced attack. Caleb Martin had 18 points and the Heat closed a 4-2 trip with three wins to remain among the Eastern Conference leaders.\n\nMiami had six players on its inactive list, including top scorer Jimmy Butler, who missed his third consecutive game with a right ankle sprain.\n\n“I think what this team has learned to do is just continue to have to find a way to win with different lineups and different people out,” said Duncan Robinson, who had 14 points.\n\n“We’ve had to find different ways to win as well. I think it’s also showcased just our depth in general.”\n\nMiami coach Erik Spoelstra said his players haven't used injuries and COVID-19 protocols as reasons they shouldn't win.\n\n“We’ve just been living in a world and a profession right now where there has just been an inordinate amount of moving parts and our guys have just handled it really well,” Spoelstra said. “I give them a lot of credit.”\n\nJohn Collins led Atlanta with 16 points. Trae Young had 15.\n\nThe Hawks scored the first seven points of the fourth quarter, cutting Miami's lead to 88-75. Atlanta again pulled within 13 with about five minutes remaining, but Herro answered with a 3-pointer.\n\nMiami's Max Strus scored the first eight points of the second half, including two 3-pointers. After leading 56-51 at halftime, Miami extended the advantage to 72-51 with the 16-0 run. The Heat's biggest lead was 75-53.\n\nAfter matching its franchise record with 22 3-pointers in Saturday night's 123-100 win at Phoenix, Miami delivered more long-distance shooting with 16 3s.\n\nThe Hawks (17-23) have lost three consecutive games and seven of nine. They began the night 12th in the East. Defense continues to be a constant weakness for coach Nate McMillan's team, which led 27-21 after the first quarter.\n\n“They do a good job of making you defend late into the shot clock and we just were not disciplined enough to defend late,” said McMillan, who was back on the bench after missing four games following a positive test for COVID-19.\n\n\"I thought we did a good job in the first quarter defending them. ... You have to sustain that.”\n\nAfter a 2-4 trip highlighted the team's need for a turnaround one season after advancing to the Eastern Conference finals, the Hawks began a crucial stretch in which they play 10 of 12 games at home.\n\nDe'Andre Hunter scored 15 points for Atlanta, including 13 in the first half, in his return after missing two months following right wrist surgery.\n\nTIP-INS\n\nHeat: C Dewayne Dedmon (left knee sprain) returned after missing seven games. ... F Markieff Morris was held out after entering the health and safety protocols on Monday.\n\nHawks: C Clint Capela (left ankle sprain) and F Cam Reddish (right ankle sprain) were unavailable. ... Capela ranks third in the NBA with 13.1 rebounds per game, and he left a void as Miami claimed a 54-37 advantage on the boards. ... F Jalen Johnson was inactive after being recalled from the G League College Park Skyhawks. G Skylar Mays was transferred to College Park.\n\nBIG REBOUNDING ROOKIE\n\nHeat center Omer Yurtseven had 13 points and 10 rebounds. The rookie has double-figure rebounds in 12 consecutive games, but couldn't extend his streak of four games with at least 16 rebounds.\n\nBACK ON THE BENCH\n\nMcMillan said “I’m better” in his return from the positive COVID-19 test.\n\n“A few days ago there was a fatigue factor, a little cough, the symptoms everyone else is having,” McMillan said before the game. “I’m back and looking forward to getting to work here.”\n\nUP NEXT\n\nOnly two days after the season's first meeting between the Southeast Division rivals, Miami returns home to host Atlanta on Friday night.\n\n------",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.728941",
  "pipeline_version": "v1"
}