{
  "game_id": "0021300992",
  "espn_id": "400489865",
  "date": "Mar 16, 2014",
  "matchup": "OKC vs. DAL",
  "headline": "Mavericks net rare win over Thunder in OKC as Russell Westbrook rests",
  "cleaned_body": "OKLAHOMA CITY -- The Dallas Mavericks didn't care if Oklahoma City was without star guard Russell Westbrook. They were just glad to finally beat the Thunder.\nShawn Marion scored 19 points, Vince Carter added 18 and the Mavericks rolled past Oklahoma City 109-86 on Sunday night, ending a seven-game regular-season losing streak to the Thunder.\nDallas beat Oklahoma City for the first time since Jan. 2, 2012. In addition to the seven straight regular-season losses to the Thunder, the Mavericks also were swept in a 2012 playoff series.\n\n\"We played well,\" Dallas coach Rick Carlisle said. \"Look, they're down a great player, so we caught a break there. But you've still got to go out and play and they've had a great record with and without Westbrook. It's a game we needed. We need every one, the battle that we're in. We did good things. We had to clean some things up at halftime with rebounding. We did. We had four good quarters.\"\nOklahoma City played without three usual starters -- the injured Kendrick Perkins and Thabo Sefolosha in addition to Westbrook. With the team wanting to ease Westbrook back into gear after his most recent knee surgery -- which cost him 27 games -- he was given the game off to rest. The Dallas game was the opener of what will be three back-to-backs on the Thunder schedule by March 25.\nOklahoma City coach Scott Brooks said Westbrook will return Monday when the Thunder visit the Chicago Bulls.\nKevin Durant scored 30 points for Oklahoma City, his 26th straight game of 25 points or more, the longest such streak since Michael Jordan did so in 40 straight games during the 1986-87 season. But with most of the Thunder's other players struggling offensively, that wasn't enough to make up for Westbrook's absence.\nBrooks said his team lacked energy and effort and Durant agreed with that assessment, saying the Thunder \"just coasted\" as they fell two games behind San Antonio in the race for the top spot in the Western Conference.\nDurant refused to blame the absence of the three starters for the team's lackluster performance.\n\"There is no excuse,\" he said. \"We've got to figure it out. We've each got to do it. We're pros. ... We've got to act like we care. It will be all right. We've got another one tomorrow.\"\nDirk Nowitzki added 17 points and Jose Calderon had 16 points for Dallas, which entered the game tied for seventh in the Western Conference standings. The Mavericks, who begin an eight-game homestand on Monday against the Boston Celtics, became only the third Western Conference team to win this season in Oklahoma City, joining Portland and the Los Angeles Clippers.\n\"This is a tough place to play,\" Nowitzki said. \"Obviously, Westbrook getting the night off, that helped us, but it's really only a good thing if you win the game. I've lost plenty of games in my career before when people were resting or hurt, but we still lost. It's only an advantage if you take care of business and I thought we did a good job.\"\nPorous defense, which Brooks has said has been at the root of Oklahoma City's recent slump, again was an issue against the Mavericks. Dallas shot 53.3 percent from the field and was even better from 3-point range, finishing 13-of-24. Calderon and Carter each went 4-for-8 from behind the arc and two other Mavericks (Marion and Nowitzki) had at least two 3-pointers apiece.\nOutside of Durant and Serge Ibaka (19 points), Oklahoma City struggled offensively. The Thunder shot 36.7 percent from the field and never made a serious run during the second half after trailing 59-48 at halftime.\nDallas led 91-70 entering the fourth quarter and the Mavericks eventually led by 26 points.\nGame notes\nThe Thunder signed G Mustafa Shakur to a 10-day contract on Sunday. Shakur, who has spent time in the NBA Development League this season, hadn't played in the NBA since appearing in 22 games for the Washington Wizards during the 2010-11 season before entering Sunday's game with 6:16 left. He spent time on Oklahoma City's roster during the 2009-10 season but never played. ... Carter raised his career total to 23,010 points, becoming the 27th NBA player to pass the 23,000-point mark with a 3-pointer with 2:17 left in the third quarter. ... Nowitzki was called for a technical foul with 7:52 left in the third quarter by official Derrick Collins after Nowitzki complained about being called for traveling by Collins. ... Reggie Jackson added 13 points for Oklahoma City.",
  "tags_rule": [
    "Streak",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.864471",
  "pipeline_version": "v1"
}