{
  "game_id": "0021701097",
  "espn_id": "400975843",
  "date": "Mar 25, 2018",
  "matchup": "TOR vs. LAC",
  "headline": "Williams scores 26, Clippers beat Raptors 117-106",
  "cleaned_body": "TORONTO --  Lou Williams got going in the fourth quarter -and carried the Los Angeles Clippers to a much-needed victory.\n\nWilliams scored 26 points against his former team, 18 in the final quarter, and the Clippers overcame an 18-point first-quarter deficit to beat the Toronto Raptors 117-106 on Sunday night.\n\nTobias Harris scored 20 points, Montrezl Harrell had 19 points and Milos Teodosic 15 as the Clippers boosted their playoff hopes by winning for the second time in seven games and snapping a three-game losing streak north of the border.\n\n\"Everybody did good things tonight,\" Clippers coach Doc Rivers said. \"We challenged them at halftime and I thought every single guy came out and played great.\"\n\nAustin Rivers scored 11 points and DeAndre Jordan had 14 rebounds to help the Clippers wrap up a four-game road trip on a winning note. Los Angeles went 2-2 on the trip, and has won 13 of 20 on the road.\n\nWilliams connected on seven of 11 shot attempts in the fourth, scoring 12 consecutive points for the Clippers in one stretch.\n\n\"It makes it a lot easier to run the offense,\" Rivers said. \"It was, give it to Lou, basically.\"\n\nWilliams said he started heating up after his first shot of the fourth.\n\n\"I made one going left, which is my go-to shot,\" Williams said. \"Any time you see your bread and butter going, I made two of those in a row, and I think everything else opened up after that.\"\n\nToronto's DeMar DeRozan played with Williams in Toronto in 2014-15, when Williams won the Sixth Man award.\n\n\"When you've got a scorer like Lou, it gets to a point once he sees that ball go in, it doesn't matter what you do to him,\" DeRozan said. \"He showed it tonight.\"\n\nJonas Valanciunas had 16 points and 10 rebounds for the Raptors, who dropped to 30-7 at home, the best mark in the NBA.\n\n\"That's the first time in a long time our second unit did not play well,\" Raptors coach Dwane Casey said.\n\nIt was a tough night for DeRozan and fellow All-Star Kyle Lowry. DeRozan scored 11 points, making three of 12 field goal attempts. Lowry had 11 points and eight assists, shooting 4 for 9.\n\n\"Just one of those nights,\" DeRozan said. \"You can't play how you want to play every single night.\"\n\nFred VanVleet scored 16 points, Pascal Siakam had 15, and Serge Ibaka 12.\n\nHarrell and Williams each scored six points as the Clippers used a 16-2 run at the start of the fourth quarter to turn an 80-80 tie into a 14-point edge with 8:43 remaining.\n\nToronto rallied, cutting it to 105-100 on Ibaka's 3 with 2:58 to go. After a Clippers timeout, Williams converted a three-point play, then added back-to-back jumpers to close out his 12-point run, giving the Clippers a 112-103 lead with 1:29 left.\n\nValanciunas scored 12 of Toronto's first 14 points and the Raptors led 27-9 after Ibaka's 3 at 5:49 of the first.\n\n\"They came out and hit us in the mouth early,\" Williams said.\n\nLos Angeles closed the quarter with a 19-8 run, cutting it to 35-28 after one.\n\nVanVleet scored eight points in the second and Toronto led 60-53 at halftime.\n\n\"We should have been down 30,\" Rivers said.\n\nLos Angeles took its first lead of the game, 66-64, on a 3 by Austin Rivers at 7:23 of the third. The Clippers led 72-66 with 4:36 left in the third, but C.J. Miles scored six points as Toronto battled back to tie it at 80 heading to the fourth.\n\nTIP-INS\n\nClippers: Harris scored 13 points in the first quarter. ... Los Angeles had lost seven of its past eight visits to Canada. The Clippers had not won in Toronto since Jan. 25, 2014.\n\nRaptors: Miles returned after missing the previous two games because of an illness. He finished with 11 points. ... Lowry celebrated his 32nd birthday.\n\nQUALITY QUARTET\n\nThe Clippers are the only team to have beaten Boston, Toronto, Houston and Golden State, the top two teams in the East and West, respectively. Los Angeles swept the season series against Toronto, beating them 96-91 on Dec. 11\n\nUP NEXT\n\nClippers: Host Milwaukee on Tuesday. Los Angeles has won nine of the past 12 meetings.\n\nRaptors: Host Denver on Tuesday. Toronto lost 128-111 when the teams met in Colorado last Nov. 1.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:50.711819",
  "pipeline_version": "v1"
}