{
  "game_id": "0022100216",
  "espn_id": "401360040",
  "date": "Nov 17, 2021",
  "matchup": "BKN vs. CLE",
  "headline": "Harden, Nets outlast short-handed Cavaliers, 109-99",
  "cleaned_body": "NEW YORK -- — James Harden scored 27 points, LaMarcus Aldridge had 24 and Kevin Durant 23 to help the Brooklyn Nets beat the short-handed Cleveland Cavaliers 109-99 on Wednesday.\n\nPatty Mills added 21 points to give the Nets four 20-point scorers for the first time this season. Brooklyn improved to 11-5 with its eighth victory in 10 games.\n\n“The good thing is we (came) away with the win,” Harden said. “We just (have) to keep improving. No excuses.”\n\nRicky Rubio led Cleveland with 25 points, Darius Garland added 24 and Kevin Love, Cedi Osman, and Dean Wade each had 11. The Cavaliers dropped to 9-7.\n\n“In the second half we collectively competed a lot better than we did in the first half,” Love said. “We gave ourselves a chance.”\n\nCleveland played without center Jarrett Allen (illness), guard Collin Sexton (torn left meniscus), and forwards Evan Mobley (sprained right elbow), Lauri Markkanen (conditioning) and Lamar Stevens (sprained right ankle).\n\nBrooklyn led 62-41 at the half, with Durant scoring 19 points and Harden 16. Cleveland outscored Brooklyn 32-19 in the third to cut it to 81-73.\n\n“The second half we just had a meltdown,” Harden said. “They capitalized. They made shots. We got fortunate they missed a lot of open shots in the first half. The second half they made a lot of them.”\n\nBrooklyn twice pushed the lead to 13 in the fourth quarter, but the Cavaliers outscored the Nets 8-2 in a 2:05 stretch to close to 96-89 with 4:43 left. Brooklyn finished the game by outscoring the Cavs 13-10.\n\n“We definitely as you mentioned and (coach JB Bickerstaff) mentioned were throwing the punches rather than just (absorbing punches),\" was how Love analyzed the difference between the first and second halves for Cleveland. “Shooting the ball with confidence and getting into the lane much better. There was so much we did better in the second half (and) really started to make (the Nets) feel us.\"\n\nLove played in his first game after clearing COVID-19 protocols. He said he experienced “crazy muscle aches, sensitive skin, can't smell (or) taste...muscle spasms, fatigue and chest and head got hit pretty tough as well.”\n\nUP NEXT:\n\nCavaliers: Host Golden State on Thursday night.\n\nNets: Host Orlando on Friday night.",
  "tags_rule": [
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.257450",
  "pipeline_version": "v1"
}