{
  "game_id": "0021400011",
  "espn_id": "400578303",
  "date": "Oct 29, 2014",
  "matchup": "DET @ DEN",
  "headline": "Nuggets open with 89-79 win over Pistons",
  "cleaned_body": "DENVER --  With key players returning from injury and still rounding into form, the Denver Nuggets leaned on Kenneth Faried.\n\nFaried had 22 points and 17 rebounds and the Nuggets opened the season with an 89-79 victory over Detroit, spoiling Stan Van Gundy's first game at the Pistons' coach on Wednesday night.\n\n\"He was huge for us right from the beginning of the game,\" Nuggets coach Brian Shaw said. \"Aggressive, getting good position down low. Got their bigs in foul trouble. Once again it's a carryover from the way he played at the end of last season to the summer with the U.S. team, throughout training camp.\"\n\nAnd it helped Danilo Gallinari, JaVale McGee and Nate Robinson, all coming off major injuries that cost them significant time last season, ease back into action.\n\n\"We're healthy but the guys coming back from injuries still need time to get back into the rhythm of the game,\" said Timofey Mozgov, who had in 13 points and 11 rebounds. \"They're going to be better and we all will get better.\"\n\nArron Afflalo, in his second tour with Denver after being acquired in an offseason trade with Orlando, had 15 points. Gallinari had seven points on 1-of-8 shooting in limited action in his first game since suffering an ACL injury in April 2013.\n\n\"Physically, I feel good. There is no pain. I'm not scared. I'm ready to go,\" Gallinari said. \"I was a little rusty, but we all knew it. First game, you want to get the `W,' and go on to the next one.\"\n\nJosh Smith, Detroit's leading scorer last season, had 25 points to lead the Pistons. D.J. Augustin added 15 points.\n\nThe Pistons managed only one basket in the last three minutes.\n\n\"We didn't get good shots,\" Van Gundy sad. \"I thought most of the shots we had, we took a lot of difficult shots. We were trying to do everything on one pass. It's going to be tough. I thought we drove the ball pretty hard, drew help and then tried to force shots. We did not do a good job moving the ball.\"\n\nBrandon Jennings did not play in the fourth quarter and was held to four points.\n\n\"You go with the guys you think give you the best chance to win,\" said Van Gundy, opting to stick with Augustin in the late going.\n\nSaid Jennings: \"A little surprising. It never happened before in my career. It is what it is. I just have to push through it. I thought D.J. did a good job.\"\n\nAfflalo hit consecutive baskets, including a 3-pointer, as part of a 9-0 third-quarter burst that put Denver in front 64-59. But the Pistons responded with a layup by Jonas Jerebko and a pair of free throws by Augustin and trailed 65-63 going into the fourth quarter.\n\nDetroit went in front 68-67 on a hook shot by Jerebko before Randy Foye and Alonzo Gee each hit 3-pointers on successive Denver possessions as the Nuggets regained the lead midway through the final period.\n\nThe Pistons pulled to within 79-77 on Augustin's 5-foot floater. Denver, though, pulled away with eight straight points in the closing minutes, including a tip-in by Mozgov. Lawson connected on a 17-foot step-back jumper with 6.5 seconds left in the second quarter, allowing the Nuggets to go in front 42-40 at halftime.\n\nNeither team led by more than six points in the first half, and each squad scored 19 points in the second quarter.\n\nTIP-INS\n\nPistons: Rookie guard Spencer Dinwiddie, who missed his final 18 games at Colorado last season because of a knee injury before being drafted by the Pistons, had an assist in limited action in his return to Colorado. ... Greg Monroe served the first of a two-game suspension stemming from an arrest last February on a DUI allegation.\n\nNuggets: Danilo Gallinari, Nate Robinson and JaVale McGee, all coming off major injuries, will be eased back into action. Coach Brian Shaw said before the game that they'll be limited to about 20 minutes of playing time early on in the season. ... J.J. Hickson served the first of a five-game suspension related to a violation of the NBA's anti-drug program.\n\nPIVOTAL MOMENT\n\nWith Denver trailing 68-67, Randy Foye and Alonzo Gee hit successive 3-pointers to give the Nuggets a 73-68 lead with 8:49 left to play. Denver never trailed the rest of the way.\n\nSTAR POWER\n\nChauncey Billups, who led the Pistons to a title and also starred for the Nuggets during a standout 17-year NBA career before retiring in the offseason, watched the game from a courtside seat.\n\nUP NEXT\n\nThe Nuggets head to Oklahoma City, where they went 0-2 last season, to play the Thunder on Saturday night.\n\nThe Pistons continue their opening trip Thursday night at Minnesota.",
  "tags_rule": [
    "InjuryReport",
    "FoulTrouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.242105",
  "pipeline_version": "v1"
}