{
  "game_id": "0021701164",
  "espn_id": "400975910",
  "date": "Apr 03, 2018",
  "matchup": "POR @ DAL",
  "headline": "Smith highlight helps Mavs top playoff-bound Blazers 115-109",
  "cleaned_body": "DALLAS -- Dennis Smith Jr. added another highlight to a solid rookie season with a Dallas Mavericks team headed to the lottery for the second straight year.\nWhen Portland coach Terry Stotts watches the tape, he won't be looking for highlights.\nSmith scored 18 points, including a dazzling dunk to help keep the bottom-feeding Mavericks ahead in a 115-109 win on Tuesday night, delaying for now the Trail Blazers' hopes of clinching home-court advantage in the first round of the playoffs.\n\"You don't want to talk about that dunk?\" Dallas coach Rick Carlisle said when the first question wasn't about Smith beating Damian Lillard to a loose ball, poking it past the star Portland guard, running it down and bouncing it one more time before leaping for the slam.\n\"Should have pulled that one out at the All-Star Game,\" said Carlisle, who looked up the video board to watch the replay. \"That was unbelievable.\"\nA hodge-podge lineup kept the Mavericks in front most of the fourth quarter, with Maxi Kleber giving them their biggest lead at 104-94 on a 3-pointer with 3:13 remaining.\nSmith, a point guard drafted ninth last year with the Mavericks hoping the build around him, returned shortly thereafter and made the defining play for a 107-99 lead 1:19 remaining.\nThe 20-year-old, who had another layup to push the lead back to seven in the final minute, also led the Mavericks with eight assists and tied Kleber for the team high in rebounds with eight. Kleber scored nine points.\nLillard scored 29 for the Blazers, who could have clinched home court for the first time in five straight playoff appearances under Stotts with a win and losses by Oklahoma City and Utah.\nThe Thunder lost to Golden State, while the Jazz pulled within three games of Portland with four to go by beating the Los Angeles Lakers.\nThe Blazers qualified for the playoffs with Sunday's win over Memphis, but it was their second straight bad loss, sandwiched around two wins. The other was a 108-103 defeat at the Grizzlies, who are with the Mavericks among the four worst teams in the Western Conference.\nPortland, which played the first of three straight in Texas on a four-game road trip, is 4-4 since a 13-game winning streak.\n\"We've been a very, very good team for two or three months, but this game on the heels of losing to Memphis and the poor first half against Memphis at home, I don't know,\" Stotts said. \"It's not going to be easy the rest of the way, and we've got to understand that.\"\nHarrison Barnes, J.J. Barea and Yogi Ferrell scored 15 apiece as the Mavericks avoided getting swept by Portland in a season series for the first time since 1998-99.\nCJ McCollum scored 16, but he and Lillard combined to go 2 of 15 from 3-point range as the Blazers shot 25 percent (10 of 40) from behind the arc. McCollum and Lillard had eight assists apiece.\nTIP-INS\nTrail Blazers: G Shabazz Napier, the Final Four most outstanding player when Connecticut won the NCAA title at the home of the Dallas Cowboys four years ago, was 4 of 4 from 3 and had 13 points. ... Jusuf Nurkic had 15 points and 13 rebounds for his team-leading 24th double-double.\nMavericks: Dirk Nowitzki missed his first five 3-point tries but finished 3 of 10 and had 14 points. ... Dwight Powell was the sixth player in double figures with 12 points. ... C Nerlens Noel was suspended for the final five games of the season for violating the NBA's anti-drug program.\nLILLARD'S ANKLE\nLillard was limping in the locker room after the game, saying his left ankle was \"real sore.\" He said he thought he landed on somebody's foot, but wasn't sure who. \"I jumped up and I landed on it, all my weight on one foot after I jumped off one foot,\" Lillard said. \"Just in a vulnerable position.\"\nNO TIME TO THINK\nSmith, who was in the dunk contest during All-Star weekend, said he wasn't planning for the dunk he ended up doing once he knocked the ball past Lillard. And it wasn't the most emphatic dunk because he said he bounced the ball too high before the leap. \"I didn't have time to get a windmill in or stuff like so I tapped it in when I got it.\"\nUP NEXT\nTrail Blazers: At NBA-leading Houston on Thursday.\nMavericks: Start of three-game road trip Wednesday at Orlando.\n---\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "Streak",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.613331",
  "pipeline_version": "v1"
}