{
  "game_id": "0021701064",
  "espn_id": "400975810",
  "date": "Mar 20, 2018",
  "matchup": "POR vs. HOU",
  "headline": "Rockets win 115-111 to snap Blazers' 13-game winning streak",
  "cleaned_body": "PORTLAND, Ore. --  James Harden says he's constantly working on his step-back 3-pointer. It paid off against Portland.\n\nHarden scored 42 points, including a pair of 3s down the stretch, and the Houston Rockets snapped the Trail Blazers' 13-game winning streak with a 115-111 victory on Tuesday night.\n\n\"This doesn't just happen,\" Harden said about his shot from distance. \"I am constantly working on it every day, every single day. I am trying to get better and improve. I'm still doing that.\"\n\nPortland's winning streak was tied for the second-longest in franchise history. The team also won 13 consecutive games in 2007.\n\nChris Paul added 22 points for the Rockets, who have won six straight and 23 of their last 24 and have the best record in the NBA.\n\nAl-Farouq Aminu had 22 points, including six 3-pointers, for Portland. The Blazers had also won nine straight at the Moda Center before the loss.\n\n\"They're the No. 1 team in the league for a reason. The find ways to win, they've got a lot of shooters out there. James is going to be the MVP of the league. They played how we thought they would play, and our team, I thought we came out and played a good game, too,\" Damian Lillard said. \"We've just got to make a few more plays and make a few more shots if we want to beat a team like that.\"\n\nHarden and Trevor Ariza each hit 3-pointers to stretch Houston's lead to 110-102. Harden added another step-back 3 with 1:55 left and it seemed Portland was out of it.\n\n\"I just try to wait for the defender to make his move,\" Harden said. \"When he gets to where I want him to be, then I take my shot. It's all about rhythm, timing.\"\n\nBut the Blazers rallied with a 9-0 run, capped by CJ McCollum's floater with 28 seconds left to pull within 113-111.\n\nPaul went to the line with 1.3 seconds left and made both shots. After a timeout, Lillard tried a 3-pointer but it missed.\n\nJusuf Nurkic finished with 21 points and 11 rebounds for Portland, while Lillard had 20 points. Neither Lillard nor backcourt mate McCollum hit a 3-pointer in the game.\n\nAminu had four 3-pointers in the opening quarter and finished with 16 points to lead all scorers. Harden had 14 for the Rockets, who trailed 31-27 going into the second.\n\nEvan Turner put back his own layup to cap an 11-2 Portland run and put the Blazers up 42-38. Turner had to leave the game later in the period after he sustained a cut that appeared above his left eve.\n\nHarden was booed each time he had the ball by the Moda Center crowd, but he finished the half with 21 points and the score was knotted at 55.\n\nPortland had five 3-pointers in the first quarter compared to Houston's one -- but the Rockets' production picked up in the second quarter with seven 3s. The Rockets went into the game with the league's best 3-point percentage at 50 percent, while the Blazers were next at 45.5 percent.\n\nHouston finished with 19 3-pointers while Portland had 11.\n\n\"Credit their defense, but I had some pretty good looks,\" said McCollum, who finished with eight points. \"I'd like to get some of those back.\"\n\nPortland was hurt when Nurkic got his fourth foul with 4:08 left in the third and went to the bench with 15 points and 10 rebounds. Paul's 3 gave the Rockets an 86-85 lead just before the third quarter ended.\n\nHouston has won all three meetings this season.\n\nTIP INS:\n\nRockets: It was the last game on Houston's three-game road trip. ... Harden scored the first nine points in the first half, and the first nine points in the second half.\n\nTrail Blazers: Lillard is still awaiting the birth of his first child. His girlfriend's due date was Monday. ... Former Oregon running back LaMichael James was at the game, as was former Portland center Chris Kaman. .... Lillard has at least 20 points in 16 straight games.\n\nANOTHER STREAK DASHED\n\nLillard's franchise-record streak of 52 games with a 3-pointer ended. He said Houston was effective on him, but he tried to find other ways to contribute.\n\n\"At some point you've got to take those shots,\" he said. \"And you've got to figure out a way to stay aggressive and try to find it. It just didn't go in as much as I would have liked it to. You've got to give credit to what they were able to do defensively.\"\n\nBOILING IT DOWN\n\nHarden said the Rockets' success is pretty simple. \"The reason we're good is guys play defense. Guys hit 3s. We just take what they give us.\"\n\nUP NEXT\n\nRockets: Host Detroit on Thursday.\n\nTrail Blazers: Host the Boston Celtics on Friday.",
  "tags_rule": [
    "Streak"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.780343",
  "pipeline_version": "v1"
}