{
  "game_id": "0021700889",
  "espn_id": "400975635",
  "date": "Feb 24, 2018",
  "matchup": "POR @ PHX",
  "headline": "Lillard's layup after Suns turnover gives Portland victory",
  "cleaned_body": "PHOENIX --  Passing the ball inbounds at a critical time proved too big a challenge for the sputtering Phoenix Suns. So, Damian Lillard got one final chance.\n\nOf course, he came through.\n\nLillard scored 40 points, the last two on a driving layup with nine-tenths of a second to play, and the Portland Trail Blazers rallied from 15 down in the final 7 1/2 minutes to beat Phoenix 106-104 on Saturday night, the Suns' ninth straight loss.\n\nLillard called it one of his \"more significant performances\" of the season.\n\n\"Obviously, Damian was huge, showed his leadership, showed his talent,\" Portland coach Terry Stotts said. \"We overcame a horrendous shooting night for most of the night and found a way.\"\n\nLillard, who scored 19 points in the fourth quarter, got the final chance because Phoenix's Troy Daniels couldn't get the ball inbounds on a five-second call that turned possession over to Portland with 20.6 seconds to play.\n\n\"We knew they didn't have any time outs left,\" Stotts said, \"so we gave it a shot and made some good reads and didn't give them any outlets.\"\n\nDevin Booker scored 30 points for the Suns, losers of 14 of their last 15.\n\nHis two free throws gave Phoenix its biggest lead, 93-78, with 7:26 to play. Lillard triggered the subsequent 18-4 outburst that caught the Suns at 97-97 on his 3-point play. Booker's fifth and final 3-pointer gave the Suns a 100-97 lead with 2:19 to go. Lillard's 3 tied it at 100 with 1:10 left.\n\nBooker's powerful driving basket put Phoenix up 104-102 with 33.6 seconds to go. But, after a timeout, Lillard's step-back 15-footer tied it at 104-104 with 28 seconds left. The Suns called time out to set up the play but, on the sidelines, Daniels couldn't get the ball inbounds for the five-second call.\n\n\"We had no timeouts. I didn't see anybody open. If I did, I would have thrown it obviously,\" Daniels said. \"I've been in that position a lot of times, but like I said, it's tough to be in that position when you have no timeouts. You learn from and you get it better.\"\n\nOn the play, Portland's CJ McCollum said \"I just tried to take away Booker.\"\n\n\"I saw how they were set up and I just guarded him normal and when I turned and saw him run toward half-court I just shaded toward him,\" McCollum said.\n\nBooker never broke open, Daniels decided not to chance it, and the last opportunity was gifted to Portland.\n\n\"There was 20 seconds left and I just wanted to make sure I got the last shot,\" Lillard said. \"I really just wanted to get the clock down, keep it towards half-court where it is further out and I can get downhill. I took a peek, the clock was at six and I got downhill.\"\n\nThe Blazers, coming off a win at Utah the previous night, have won three straight and five of six.\n\nThe game was tied 10 times before Portland finished the first half with a 7-2 spurt take a 55-50 lead at the break.\n\nBut the Suns turned it on in the third quarter, outscoring the cold-shooting Blazers 31-16. Portland scored the first five of the second half to take its biggest lead, 60-50. But Phoenix overwhelmed the Trail Blazers 29-5 to go up 79-65 on Booker's 3.\n\nTIP INS\n\nTrail Blazers: Swept the season series with Phoenix for the first time since the 1998-99 season. ... It's Portland's first seven-game winning streak against the Suns since 1987-88. ... Blazers were 3 of 22 on 3s through three quarters, finished season-worst 6 of 30.\n\nSuns: Rookie Josh Jackson drew his eighth technical of the season. .... C Tyson Chandler (neck) was out for the third straight game and fifth in last six. ... Last time the teams met, in Portland on Jan. 16, Booker scored 43 -- third-highest of his career.\n\nUP NEXT\n\nTrail Blazers: Host Sacramento on Tuesday night.\n\nSuns: At New Orleans on Monday night.",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.402700",
  "pipeline_version": "v1"
}