{
  "game_id": "0021200182",
  "espn_id": "400277902",
  "date": "Nov 23, 2012",
  "matchup": "POR vs. MIN",
  "headline": "Wesley Matthews, Damian Lillard propel Blazers past slumping Wolves",
  "cleaned_body": "PORTLAND, Ore. -- Wesley Matthews had been waiting for a game like this.\n\nMatthews had a season-high 30 points, rookie Damian Lillard had a career-high 28 points and eight assists, and the Portland Trail Blazers sent the Minnesota Timberwolves to their fourth straight defeat with a 103-95 win Friday night.\n\nJ.J. Hickson had 14 points and 13 rebounds, returning from a shoulder injury for Portland, which has won four of its past five games. LaMarcus Aldridge had 13 points and sat for stretches in foul trouble. Matthews made five of the Blazers' 11 3s.\n\nMatthews has been steady but not spectacular for Portland this season, averaging 17.3 points per game while leading the Blazers in 3-point shooting at 44 percent. His previous season high was 22 points.\n\n\"There haven't been too many games where I could really just let go -- it felt really good,\" Matthews said.\n\nKevin Love had 24 points and 13 rebounds in his second game back for Minnesota, which is 1-5 after winning three of its first four this season. Nikola Pekovic had 18 points and 10 rebounds, and Luke Ridnour added 14 points for the Wolves.\n\nPortland never looked back after going on a 13-0 run that started just before the end of the third quarter. The Blazers led 88-78 at the end of that run and went up 95-84 after Matthews hit a 3-pointer with 6:16 remaining.\n\n\"Wes Matthews and Lillard ... they just couldn't miss. It's as easy as that,\" Love said.\n\nThis first matchup of the season between the teams was highly anticipated on several fronts. It was supposed to mark a Portland homecoming for former Blazers star Brandon Roy, who came out of retirement to join the Wolves this season but is out after having knee surgery Monday.\n\nLove is still popular in Portland, where he grew up and attended high school. And Minnesota general manager David Kahn, coach Rick Adelman and much of Adelman's staff have strong ties to the city. Kahn signed Portland's Nicolas Batum to an offer sheet in the offseason, forcing the Blazers to match the four-year, $44 million offer to keep the fifth-year Frenchman. Batum finished with nine points and five assists, shooting just 3-of-10 from the field, while fighting flu-like symptoms.\n\nLove made his season debut Wednesday in the Wolves' 101-94 loss against Denver, coming back early after suffering a broken hand doing pushups Oct. 18. He had a huge game, with 34 points and 14 rebounds against the Nuggets.\n\nPortland had a three-game winning streak snapped in a 114-87 loss at Phoenix on Wednesday night. The Blazers committed 22 turnovers in what was arguably the team's worst performance of the season. They had just 12 turnovers Friday.\n\n\"I think it's important for us that how we play is important,\" Portland coach Terry Stotts said. \"Sometimes it's not going to be defined by a box score or winning a certain category. It's just playing with a rhythm on the offensive end, and with a certain amount of intensity and grit on the defensive end.\"\n\nMinnesota led 41-28 after starting off the second quarter with an 8-0 run and led 55-50 at the half. But Portland chipped away at the advantage, shooting 61 percent in the third and pulling ahead 71-69 near the end of the quarter.\n\n\"We just didn't defend them well enough,\" Adelman said. \"They shot the hell out of the ball, and we didn't finish plays at the basket.\"\n\nGame notes Former NBA star Gary Payton and professional wrestler Rowdy Roddy Piper were in attendance. ... Minnesota had lost 16 in a row to the Blazers before taking two of three in the series last season. ... Love is averaging 30.3 points in his past four games against Portland. ... The Blazers won't be back at the Rose Garden for 15 days. Portland plays its next seven games on the road, all against Eastern Conference teams.",
  "tags_rule": [
    "ReturnFromInjury",
    "Streak",
    "FoulTrouble",
    "CoachComment",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.610084",
  "pipeline_version": "v1"
}