{
  "game_id": "0021701170",
  "espn_id": "400975916",
  "date": "Apr 04, 2018",
  "matchup": "ORL vs. DAL",
  "headline": "Jamel Artris has career-high 18, Magic hold off Mavs 105-100",
  "cleaned_body": "ORLANDO, Fla. -- The Orlando Magic finished off the depleted Dallas Mavericks with their G League players Wednesday night.\nJamel Artis, Khem Birch and Rodney Purvis, players who spent most of the season playing for the NBA G League's Lakeland Magic, combined for 16 of Orlando's 28 points in the fourth quarter of a 105-100 victory.\n\"It was a great experience for them,\" Magic coach Frank Vogel said. \"For those guys to not only get overall minutes, but closing minutes in end-of-game situations, all those things are valuable for our young guys.\"\nArtis had 18 points for his second straight career high. He was coming off a 16-point game Tuesday night in a victory at New York.\n\"I love the G League. The guys that were there, we built a family, built a bond,\" he said. \"It's the experience that we went through. It's a path. Maybe I took the long way, but I still have a lot of work to do and I'm going to continue to build every day.\"\nPurvis, another undrafted rookie, hit two straight jumpers after the Mavericks had pulled to within three early in the fourth quarter.\n\"It brings back a lot of memories and I hope we can be out here a lot more in the future,\" he said. \"It's just good having that camaraderie . . . We just go out there and try to bring a lot of energy and play the game the right way.\"\nAaron Gordon led the Magic with 20 points without playing in the fourth quarter. Gordon scored 16 points in the first quarter, leading the Magic to an early 14-point lead. Bismack Biyombo had 12 points, 12 rebounds and a career-high five assists.\nJalen Jones led Dallas with 15 points. Johnathan Motley added 14 points and eight rebounds in his first NBA start, and Kyle Collinsworth came off the bench for 14 points and nine rebounds.\nThe Mavericks, who have lost 12 of 15, listed seven players out with injuries including Dirk Nowitzki, the 19-year veteran who missed only his second game of the season.\nPoint guard J.J. Barea, the only Maverick to start in Tuesday night's win and again Wednesday night, sat out the second half with an apparent oblique strain.\n\"I'm making sure that nothing is wrong and it doesn't get worse,\" he said. \"I'm going back to Dallas and make sure.\"\nTwo straight dunks by Motley got Dallas back in the game in the second quarter and the Mavericks kept it close for the rest of the way. Dorian Finney-Smith missed an open 3-pointer that could have put Dallas ahead with just over two minutes left.\nNEXT MEN UP\nThe Mavericks went with four different starters after a win over Portland on Tuesday night. \"It's the NBA and it's a dynamic league and things happen. They've got a lot of guys out, too,\" said Dallas coach Rick Carlisle. In their 79th game, the Mavericks started five players who had started a total of 22 games for them this season.\nTIP-INS\nMavericks: Nowitzki, who played 25 minutes Tuesday night in a win over Portland, did not make the trip. \"There'll be more information tomorrow,\" Carlisle said. \"That's really all I'm authorized to say at this point.\" . . . G Dennis Smith Jr. (left knee) and F Harrison Barnes (rest) also sat out the game.\nMagic: C Nikola Vucevic (rest), F Jonathan Isaac (left ankle), G Jonathon Simmons (right wrist) and G Evan Fournier (left knee) did not play. . . . Isaac has missed 51 games in his rookie season.\nUP NEXT\nMavericks: At Detroit on Friday night.\nMagic: Host Charlotte on Friday night.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.438846",
  "pipeline_version": "v1"
}