{
  "game_id": "0021401026",
  "espn_id": "400579318",
  "date": "Mar 20, 2015",
  "matchup": "OKC vs. ATL",
  "headline": "Russell Westbrook posts another triple-double as Thunder beat Hawks",
  "cleaned_body": "OKLAHOMA CITY -- The Thunder keep losing players and finding ways to win.\nHours after Oklahoma City learned it might be without reigning MVP Kevin Durant for the rest of the season, Russell Westbrook had yet another triple-double and scored 17 of his 36 points in the fourth quarter to help the Thunder defeat the Atlanta Hawks 123-115 on Friday night.\n\"One thing I do know -- our guys are going to continue to fight and rally, and our crowd is going to continue to support our guys because they give effort,\" Thunder coach Scott Brooks said. \"We've never, ever given up and felt sorry for ourselves.\"\n\nThe update on Durant's right foot came during the same week the Thunder found out forward Serge Ibaka might also be out for the season with a knee injury. Big man Enes Kanter also missed Friday's game with a sprained left ankle. And forward Nick Collison was in a boot and on crutches following Friday's game after sustaining a high ankle sprain on his left foot.\nIn the midst of it all, the Thunder became just the fourth team in NBA history to go from nine games under .500 to nine games over .500 in the same season.\n\"It's not healthy for the head coach to go through all these injuries,\" Brooks said. \"But our team's going to continue to rally around each other and help each other fight through it.\"\nWestbrook's 10 rebounds and 14 assists gave him his seventh triple-double since the All-Star break, his ninth of the season and the 17th of his career.\nHe also made all 17 of his free throws, the most without a miss by any player in the league this season. He has made 36 free throws the past two games. According to STATS, that's the most by any player in back-to-back games since Durant made 41 combined on Jan. 18 and Jan. 20, 2013.\nDion Waiters matched a season high with 26 points, Anthony Morrow scored 12 of his 21 in the fourth quarter and Steven Adams had 12 points and 16 rebounds for Oklahoma City.\nThree of Westbrook's four assists in the final period went to Morrow for 3-pointers. Westbrook balanced finding ways to score with finding his teammates, which has been a struggle for him at times.\n\"It's so important that towards the end of the games that we learn from our mistakes, especially myself, on being able to find our shooters,\" Westbrook said. \"He's one of the best shooters in the world, in the NBA, and my job is to be able to read the defense. A lot of attention is on me late in the game, and my job is to be able to find the shooters.\"\n\nPero Antic scored a career-high 22 points and Dennis Schroder added 21 for the Eastern Conference-leading Hawks, who were blown out by Western Conference leader Golden State on Wednesday. The Hawks won three of the first four on their road trip before dropping the final two.\n\"Not the way we wanted to finish the road trip, but we have a chance to go home now,\" forward Al Horford said.\nThe Hawks shot 58 percent in the first half and led 68-61 at the break. Antic matched his career high of 18 points before halftime, and Schroder added 12. Westbrook had 19 points, seven assists and six rebounds in the first half.\nAtlanta extended its lead to 12 early in the third quarter, but a 7-0 run by the Thunder trimmed the Hawks' lead to 81-76. Atlanta still led 95-90 heading into the fourth.\nBack-to-back 3-pointers by Morrow cut Atlanta's lead to 103-102 with just over seven minutes to play, and a 3 by Westbrook tied it at 105. On Oklahoma City's next possession, Westbrook found Morrow for his third 3-pointer of the quarter to finally put the Thunder ahead.\nMorrow hit yet another 3 with just over four minutes to play, and the Thunder remained in control from there.\nWestbrook was pleased with his team's ability to close.\n\"It is great, man,\" Westbrook said. \"It is a great feeling. Everything was clicking on both sides of the floor.\"\nTIP-INS\nHawks: F Kyle Korver missed his third straight game with a broken nose. ... Former Thunder G Thabo Sefolosha, now with the Hawks, sat out with a right calf strain. The crowd cheered loudly when he was shown on the big screen. ... Atlanta shot 50 percent.\nThunder: Oklahoma City shot 51 percent. ... The Thunder outrebounded the Hawks 44-34. ... Oklahoma City committed just 12 turnovers.\nSTAT LINES\nCollison, pressed into playing more minutes than usual because Ibaka and Kanter were out, scored 13 points, his second-highest total of the season. He shot made 6 of 9 and had five rebounds and three assists in 24 minutes.\nUP NEXT\nThunder: Host Miami on Sunday.\nHawks: Host San Antonio on Sunday.",
  "tags_rule": [
    "MomentumShift",
    "TripleDouble",
    "CoachComment",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.287271",
  "pipeline_version": "v1"
}