{
  "game_id": "0021400424",
  "espn_id": "400578716",
  "date": "Dec 23, 2014",
  "matchup": "OKC vs. POR",
  "headline": "Damian Lillard forces OT, scores 40 to key Blazers' win over OKC",
  "cleaned_body": "OKLAHOMA CITY -- In a matchup of star Western Conference point guards, Portland's Damian Lillard made the big shots and Oklahoma City's Russell Westbrook didn't.\nLillard scored 40 points, making a tying 3-pointer with three seconds left in regulation, and the Trail Blazers rallied from a 13-point, fourth-quarter deficit to beat the Thunder 115-111 on Tuesday night.\nLillard's 40-point outing was his second in Portland's past four games, following a 43-point outburst against San Antonio on Friday. Lillard, who also had 11 assists and six rebounds, went 8-of-12 from 3-point range. He had seven points in the extra period.\n\n\"Every time we get in a situation like that, I try to find a spot on the floor where I feel like I can get to for sure, and tonight was just another one of those times,\" Lillard said.\nWestbrook scored a season-high 40 points and added 10 rebounds and six assists but missed a potential game winner at the regulation buzzer before fouling out with 1:39 left in overtime. Oklahoma City played for a third straight game without NBA MVP Kevin Durant, who has a sprained right ankle.\nLaMarcus Aldridge overcame an upper respiratory illness to score 25 points and grab nine rebounds for the Blazers, although he shot 9-of-28 from the field. He and Oklahoma City's Serge Ibaka, who scored 16 points, both were ejected with 9.5 seconds left in overtime after getting involved in a scuffle underneath Portland's basket.\nReggie Jackson scored 21 points for the Thunder, including seven straight during a 67-second span to build a 78-73 lead with 10:58 left in regulation. A jumper by Westbrook extended that margin to 91-78 with 5:04 left, and the Thunder led 95-85 with 1:40 left.\nBut Oklahoma City faltered down the stretch. Lillard scored six straight points in a 34-second span -- one on a free throw after Westbrook was whistled for a technical foul with 1:33 left.\n\n\"That was my fault,\" Westbrook said. \"I think that was the turning point in the game, for us and our energy. I didn't think I deserved it ... but I've got to do a better job of controlling my emotions, especially when the game is on the line like that. I take the blame for that. It turned the whole game around for them and it gave them a chance to win the game.\"\nWestbrook went 1-of-2 from the line with 5.2 seconds left to give the Thunder a three-point cushion before Lillard's jumper over a charging Ibaka tied the game at 98.\n\"I was just pointing to the watch,\" Lillard said of his celebration after the shot. \"That's 'Lillard Time.' That was the first time anybody's seen that. I was just feeling myself a little bit at the moment.\"\nWesley Matthews scored 22 points and went 5-of-8 from 3-point range. Portland hit a season-high 17 3-pointers in 31 attempts.\nTIP-INS\nTrail Blazers: After official Sean Corbin called a foul on Lillard that sent Westbrook to the free throw line, Portland coach Terry Stotts yelled at Corbin, saying he shouldn't reward Westbrook \"just because he cries every time.\" ... Portland is 6-1 this season against Northwest Division foes and leads the division standings by 9 1/2 games. ... The Blazers have won 11 of their past 14 road games.\nThunder: Oklahoma City's Steven Adams and Portland's Joel Freeland each were issued a technical foul with 32.8 seconds left in the first half after jostling with each other following Westbrook's 3-pointer.\nINJURY UPDATES\nOklahoma City coach Scott Brooks said Durant's ankle is improving every day but wouldn't commit to a timetable for his return. ... Stotts said starting forward Nicolas Batum aggravated a sprained wrist during the Blazers' loss Monday at Houston. Batum sat out Tuesday but should be back quickly, possibly as soon as Friday.\nQUOTE OF THE NIGHT\nAldridge, on the altercation with Ibaka: \"It was just a long night, I thought, of unnecessary stuff going on. This (pointing to a scar on his face) is unnecessary. I've got scratches on my shoulder. That's unnecessary. The game was over with, and he was doing a little bit of extra stuff, and it wasn't needed.\"\nUP NEXT\nTrail Blazers: Host Philadelphia on Friday.\nThunder: Visit San Antonio on Thursday.",
  "tags_rule": [
    "PhysicalGame",
    "InjuryReport",
    "ClutchShot",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.248638",
  "pipeline_version": "v1"
}