{
  "game_id": "0022100979",
  "espn_id": "401360798",
  "date": "Mar 08, 2022",
  "matchup": "MIL @ OKC",
  "headline": "Giannis scores 39; Bucks top Thunder for 5th straight win",
  "cleaned_body": "OKLAHOMA CITY -- — Giannis Antetokounmpo scored 39 points, and the Milwaukee Bucks defeated the Oklahoma City Thunder 142-115 on Tuesday night for their fifth straight win.\n\nBucks coach Mike Budenholzer doesn’t want to mess with a good thing. Milwaukee is averaging 128.4 points and shooting 49% from the field during its win streak.\n\n“Just want them to keep playing,\" he said. \"I don’t want to screw them up. I’ll stay out of their way.”\n\nAntetokounmpo made 13 of 19 shots and had seven rebounds and seven assists. Budenholzer said Antentokounmpo continues to dominate without forcing things, and that helps the team.\n\n“If a team wants to throw extra bodies at him and turn him into a passer, he’s more than willing, more than capable,\" Budenholzer said. \"And guys are shooting it well.”\n\nKhris Middleton had 25 points and nine assists, and Bobby Portis added 18 points and 14 rebounds for the Bucks, who scored a season-high point total and shot 53% (53 for 100) from the field.\n\nShai Gilgeous-Alexander had 33 points, a career-high 14 assists and eight rebounds for the Thunder. It was the sixth time in seven games since the All-Star break that Gilgeous-Alexander has scored at least 30 points.\n\n“He’s just a great player,” Budenholzer said. “We were all talking about it back in the locker room after the game. He’s impressive. The ball’s in his hands a ton, but he still makes the right plays.\"\n\nThe Thunder have allowed at least 120 points five times in seven games since the All-Star break. Thunder coach Mark Daigneault said his team can do better.\n\n“We’re capable, but it’s going to require sharper execution, better effort, more togetherness, more competitiveness in order for us to sustain that level,” he said.\n\nAntetokounmpo drained a 30-footer at the first-half buzzer to give the Bucks a 76-65 lead at the break. Once known as simply a player that scored around the basket, he had the confidence to leave his wrist in the air well after he took the shot.\n\n“I’ve shot a lot of deep ones in a game,” he said. “It's one of those days that it went in. It felt good because I’ve been working on it for a while now.\"\n\nAntetokounmpo scored 18 points in the first half and helped the Bucks shoot 59.2% from the field. Oklahoma City shot 58.5% before the break. Gilgeous-Alexander led the Thunder with 21 points and seven assists.\n\nThe Bucks opened the second half with a quick 9-2 run and led 105-93 heading into the fourth.\n\nAntetokounmpo scored seven points in the first two minutes of the fourth quarter. His 3-pointer put the Bucks up 115-96.\n\nTIP-INS\n\nBucks: G Grayson Allen missed the game with left hip soreness. ... Ex-Thunder forward Serge Ibaka had 14 points and seven rebounds in 18 minutes. He was greeted warmly by the fans when he checked in during the first quarter. ... Fell two points short of their season high for points in a half with 76 in the first.\n\nThunder: Gilgeous-Alexander drained a 28-foot 3-pointer with 5.0 seconds left in the first quarter to cap off a 13-point, six assist opening period. ... Rookie Lindy Waters III scored a career-high 16 points. ... Rookie G Tre Mann left the game early with what appeared to be an ankle injury. He returned and finished with 11 points in 29 minutes.\n\nINJURY UPDATE\n\nLu Dort, Oklahoma City’s No. 2 scorer, will miss the rest of the season after having surgery to address a cartilage tear in his left shoulder. Dort joins reserves Ty Jerome and Mike Muscala as Thunder players who had procedures on Tuesday, the team announced. Dort, a well-established defensive guard, stepped up his offensive game this season and averaged 17.2 points. The team said he is expected to return to full basketball activities before next season.\n\nHOT STREAK\n\nGilgeous-Alexander has been efficient during his recent surge. He is shooting 57.1% from the field and has shot at least 50% in five of seven games since the All-Star break. He’s also averaging 7.7 assists and 6.3 rebounds during that span.\n\nSTAT LINES\n\nThe Bucks outrebounded the Thunder 53-36, and outscored Oklahoma City 15-5 in second-chance points.\n\nUP NEXT\n\nBucks: Host the Atlanta Hawks on Wednesday.\n\nThunder: Visit the Minnesota Timberwolves on Wednesday.\n\n------\n\nFollow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP\n\n------",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.281174",
  "pipeline_version": "v1"
}