{
  "game_id": "0021400244",
  "espn_id": "400578536",
  "date": "Nov 30, 2014",
  "matchup": "MEM @ SAC",
  "headline": "Grizzlies squelch Kings' rally with late run of their own, go to 15-2",
  "cleaned_body": "SACRAMENTO, Calif. --  The Memphis Grizzlies left nothing to chance against the Sacramento Kings this time.\n\nLess than three weeks since their disputed win in Memphis, the Grizzlies started fast and closed with a flurry to beat the short-handed Sacramento Kings 97-85 on Sunday for their fifth straight win.\n\n\"It was important for us to come out strong. We did,\" Grizzlies coach Dave Joerger said. \"It was just a good game for us mentally to push through and finish in the second half.\"\n\nZach Randolph had 22 points and 12 rebounds, and Marc Gasol added 18 points and six rebounds to help the Grizzlies hold off a late rally on the road.\n\nThe frontcourt tandem took advantage of a Sacramento team playing without center DeMarcus Cousins, who missed his second straight game because of a virus. Memphis built a 21-point lead in the second quarter and pulled away again in the fourth to stretch its NBA-best record to 15-2.\n\n\"I think everybody came into training camp with that mindset of coming in and being aggressive from the get-go and being the team that we want to be,\" Gasol said.\n\nSo far, so good.\n\nRudy Gay scored 20 points and reserve Reggie Evans finished with 17 points and 20 rebounds as Sacramento (9-8) lost its third game in a row.\n\nThe Kings closed the deficit to 79-76 midway through the fourth quarter before Memphis went on a 19-6 run behind a dominating defensive effort and near-mistake-free execution. The Grizzlies outshot the Kings 48 percent to 47 percent. Memphis had 23 turnovers, while Sacramento had 13.\n\n\"At some point we have to find a way to stop beating ourselves,\" Kings coach Michael Malone said.\n\nThe second meeting between the Grizzlies and Kings this season had a lot less drama than the first.\n\nThe Grizzlies rallied from 26 points down to beat the Kings 111-110 on Nov. 13 in Memphis. The Kings protested the outcome, arguing that Courtney Lee's game-winning shot should not have counted because it came after time expired.\n\nThe NBA said Friday that Commissioner Adam Silver determined the officials' call was correct \"and not a misapplication of the playing rules.\"\n\nWithout Cousins clogging the middle, the Grizzlies had all kinds of room to roam in the rematch.\n\nRandolph and Gasol gobbled up rebounds on both ends, and Mike Conley and company dribbled through the lane with relative ease. Memphis also turned its swarming defense into easy transition baskets, opening a 51-30 lead in the second quarter that set off light boos from the crowd.\n\nThings seemed to get more complicated for the Kings when Ryan Hollins, who started in Cousins' place, was ejected in the third quarter after receiving his second technical foul. Instead, the seldom-used Evans sparked Sacramento back, getting Gasol in foul trouble and slicing Memphis' lead to 74-65 heading to the fourth.\n\n\"We made a run at it,\" Gay said, \"but if we hadn't built that hole so deep in the first half we probably would have been in a better position.\"\n\nTIP-INS\n\nGrizzlies: Memphis improved to 7-2 on the road. ... Tony Allen added 13 points and three rebounds, Lee scored 11 and Conley finished with 10 points and six assists.\n\nKings: Malone said the team is hopeful Cousins will not miss any more time with the illness. ... Ben McLemore had 18 points, and Darren Collison added 16 points, seven rebounds and seven assists.\n\nHACK-A-TONY\n\nThe Kings intentionally fouled Allen on consecutive possessions with less than 4 minutes to play. Allen missed the first two and made the second pair. \"You see they stopped right after I hit them two, so that wasn't a good idea,\" Allen said.\n\nEVANS' BREAKOUT\n\nEvans had not played in the last seven games. He shot 7 of 10 from the floor in nearly 35 minutes. \"Well, I ain't no rookie or nothing. I have 13 years in the league,\" Evans said. \"They shoot just like I shoot and they play defense just like I play it. They are human just like me. There is no sense in being scared.\"\n\nUP NEXT\n\nGrizzlies: At Houston on Wednesday.\n\nKings: Host Toronto on Tuesday.",
  "tags_rule": [
    "MomentumShift",
    "FoulTrouble",
    "CoachComment",
    "Rivalry",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.038246",
  "pipeline_version": "v1"
}