{
  "game_id": "0021700370",
  "espn_id": "400975121",
  "date": "Dec 08, 2017",
  "matchup": "ORL vs. DEN",
  "headline": "Kenneth Faried, bench lead Nuggets past Magic, 103-89",
  "cleaned_body": "ORLANDO, Fla. --  The Denver Nuggets needed a spark after a miserable first quarter Friday night, and they got something more like a fire from their bench in a 103-89 victory over the Orlando Magic.\n\nKenneth Faried led the way with 20 points and 10 rebounds and Denver rebounded from a 14-point first quarter with a 53-16 advantage in bench scoring.\n\n\"I noticed we started running and they started calling timeouts. Our energy changed,\" said Malik Beasley, one of three Nuggets to come off the bench with double-digit scoring. \"We were hyped on the bench and hyped on the court, especially in the second half, just pushing on them and not breaking down.\"\n\nWill Barton added 19 points. Emmanuel Mudiay had 18 and Beasley 12 for the Nuggets. Only Barton started.\n\n\"Obviously, I rode that second unit in the second quarter and they deserved those minutes,\" coach Michael Malone said. \"We had great energy, great efficiency. Anytime you outscore your opponent 53-16, that's a great job by them.\"\n\nAfter falling behind by 11 in the first quarter, the Nuggets (14-11) dominated the rest of the game, shooting 61 percent (28 for 46) in the second and third quarters en route to their second road victory since Oct. 29.\n\nNikola Vucevic led the Magic (11-16) with 21 points and 17 rebounds. Jonathan Simmons also scored 21 points, 11 in the first quarter.\n\nWith Mudiay and Faried contributing 11 points each, Denver erased a 13-point deficit in the second quarter and led 49-48 at halftime.\n\n\"In the first quarter we were very good defensively. In the second quarter, we weren't,\" said Magic coach Frank Vogel. \"Mudlay, Faried, Beasley, those guys turned the game around.\"\n\nGary Harris scored six straight Denver points early in the second half to put the Nuggets ahead to stay.\n\nMagic forward Aaron Gordon left with a concussion shortly after colliding with Harris midway through the third quarter. Orlando also played without guard Evan Fournier for the first time this season.\n\n\"It's not easy when you lose guys that are a big part of what we're doing, but it's part of the job we do,\" Vucevic said. \"People get injured. Every team goes through it. We need the next guy to step up and find a way to win games.\"\n\nDEFENSIVE NUGGETS\n\nThe 89 points were the fewest given up by the Nuggets since the second game of the season. They gave up an average of 116.8 points in losing five of their preceding six road games. \"The story of the game for me was our defense,\" Malone said. \"We weren't down early because of defense. We were down because we couldn't make a shot.\"\n\nTIP-INS\n\nNuggets: It was the fourth straight game in which neither Nikola Jokic (left ankle) nor Paul Millsaps (left wrist) played. ... The Nuggets have won only six times in Orlando. They lost 15 straight here, a streak that ended in 2008.\n\nMagic: Arron Afflalo started his first game for the Magic since April 16, 2014, two months before being traded to Denver for Fournier. ... F Aaron Gordon (concussion) has been ruled out for Saturday night's game.\n\nUP NEXT\n\nNuggets: At Indiana on Sunday in the fourth game of a six-game trip.\n\nMagic: At Atlanta on Saturday night in a rematch of the Magic's overtime victory Wednesday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "CoachComment",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.348895",
  "pipeline_version": "v1"
}