{
  "game_id": "0021400216",
  "espn_id": "400578508",
  "date": "Nov 26, 2014",
  "matchup": "DET vs. LAC",
  "headline": "Crawford helps Clippers past Pistons 104-98",
  "cleaned_body": "AUBURN HILLS, Mich. --  Chris Paul picked up his game in the third quarter, and the rest of the Los Angeles Clippers joined him in the fourth.\n\nPaul scored 14 of his 23 points in the third, and the Clippers beat the slumping Detroit Pistons 104-98 on Wednesday night.\n\nLos Angeles outscored Detroit 32-25 in the final period. The Clippers shot 64.7 percent from the field in the last 12 minutes, including a 5-for-7 finish from 3-point range.\n\nDetroit has lost six in a row.\n\n\"Winning a game in the NBA is hard,\" Clippers coach Doc Rivers said. \"Those guys are professionals, and they want to break that streak, so it was going to be tough. If we hadn't embraced that, we wouldn't have won this game.\"\n\nLos Angeles reserve Jamal Crawford scored 14 of his 25 points in the fourth. Blake Griffin finished with 15 points, seven rebounds and seven assists.\n\n\"You look at the box score, and you see you held Chris to seven assists and 12 shots, and you think you did a good job against him,\" Detroit coach Stan Van Gundy said. \"Then you realize he made nine of those shots and you see what Jamal did, and you don't feel as good.\"\n\nD.J. Augustin scored 19 points for the Pistons, and Andre Drummond had 17 points and 13 rebounds.\n\nDetroit dropped to 3-12, a shock for a coach who has never had a losing season or missed the playoffs.\n\n\"I've never been in this situation,\" a frustrated Van Gundy said.\n\nThe Pistons used their one consistent strength -- rebounding -- to build a slim 51-48 halftime lead. Detroit outrebounded the Clippers 24-17 in the half, including a 7-2 edge on the offensive glass. Drummond had 12 points and seven boards at the break.\n\nAfter a quiet first half of six points and five assists, Paul increased his intensity to carry a lethargic Clippers offense with his big third quarter.\n\n\"We're not going to have it every night, and this was one of those games where we just had to find a way to win,\" he said. \"That's not usually us, but we got the win and now we can get out of here.\"\n\nCrawford gave Paul a rest early in the fourth and kept things going, scoring five straight points to put Los Angeles up 81-75.\n\nThe Clippers increased their lead to 11 with Paul still on the bench, with Kentavious Caldwell-Pope struggling to guard Crawford. Detroit finally adjusted, and Josh Smith's layup cut the lead to 93-91 with 2:39 to play.\n\nGriffin answered with a dunk for Los Angeles, and after a Pistons miss, Paul knocked down a 3-pointer to make it a seven-point game. Crawford applied the finishing touches, blocking a Caldwell-Pope shot before hitting a 3 at the other end.\n\n\"I'm just trying to be a better all-around player,\" said Crawford, who played his college ball an hour away at Michigan. \"Early in my career, I had the mentality that I could outscore everyone, but now I really take pride in my defense. If I'm not locked in, I get upset with myself.\"\n\n---\n\nTIP-INS\n\nClippers: Rivers got involved in the action in the second quarter. He jumped onto the court to avoid Pistons rookie Spencer Dinwiddie, who was trying to save a loose ball. Unfortunately for the Pistons, Dinwiddie's backhanded flip hit Rivers and bounced out of bounds, giving the Clippers the ball. . Glen Davis showed surprising athletic ability, vaulting a courtside advertising board while pursuing a rebound.\n\nPistons: Detroit had a distinct advantage in fouls early, only being called for one in the first quarter while Los Angeles picked up eight, but Smith and Kyle Singler still picked up first-half technicals for arguing calls. . Brandon Jennings missed his second straight game with a sprained left thumb.\n\nUP NEXT\n\nClippers: At Houston on Friday.\n\nPistons: Host Milwaukee on Friday.\n\nPAYING RESPECTS\n\nLos Angeles G J.J. Redick, who has talked often about the positive impact Van Gundy had on his career when they were together in Orlando, came down and hugged the coach and exchanged a few words with him before the opening tip.\n\nROOKIE STEPPING UP\n\nWith Jennings sidelined, Dinwiddie got his first real chance to shine. The rookie, who fell to the second round because of a knee injury at Colorado, scored 10 points in 17 minutes.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.978973",
  "pipeline_version": "v1"
}