{
  "game_id": "0022100941",
  "espn_id": "401360760",
  "date": "Mar 03, 2022",
  "matchup": "BKN vs. MIA",
  "headline": "Durant has 31 points in return, but Heat rally to beat Nets",
  "cleaned_body": "NEW YORK -- — Kevin Durant's shot looked good the whole way, one that would have given the Brooklyn Nets the lead with under a minute left.\n\nAfter 1 1/2 months of misery without their superstar, the Nets couldn't have asked for a better scenario than Durant taking the potential go-ahead 3-pointer in his return.\n\n“I played on the Olympic team with KD, so a lot of times a lot of his shots look like they’re going in,” Heat star Bam Adebayo said. \"He just missed.\"\n\nAfter their season went sideways when Durant went down, the Nets will need those to start falling — and he believes they will.\n\n“I felt great,\" Durant said. “I’m only going to get better, more comfortable out there.”\n\nHe couldn't stop the Nets' slide, as Adebayo had 30 points, 11 rebounds and six assists to lead Miami to a 113-107 victory on Thursday night.\n\nTyler Herro added 27 points for the Eastern Conference-leading Heat, who bounced back from a tough loss in Milwaukee a night earlier with an impressive victory despite missing some of their top players.\n\nDurant had 31 points in his first game since Jan. 15 and his return from a 21-game absence with a sprained left knee ligament inspired the Nets to a 16-point lead. But Miami tightened up its defense in the second half and held off a late surge by the Nets.\n\nDurant had a 3-point attempt from straightaway that would have given the Nets the lead go in and out with 57 seconds left, and the Heat worked it inside to Adebayo on the ensuing possession for a 111-107 advantage with 35 seconds to go.\n\nThe Nets are 32-32. They were 5-16 without Durant, tumbling all the way from second place in the Eastern Conference to eighth. Only the Knicks (3–16) and Rockets (3–15) had been worse since Jan. 16, according to the Elias Sports Bureau.\n\nBrooklyn was still without Kyrie Irving and Ben Simmons on Thursday, so even Durant wasn't enough against the Eastern Conference leaders. Bruce Brown scored 21 points for the Nets, who played a third straight game without coach Steve Nash, who was placed into health and safety protocols Monday. Jacque Vaughn again ran the team.\n\nAdebayo was 12 for 15 from the field and Caleb Martin added 22 points for Miami. Max Strus had 21.\n\nThe Heat were without Jimmy Butler (left big toe), Kyle Lowry (personal reasons) and P.J. Tucker (left knee) on the second night of a back-to-back. They fell 120-119 in Milwaukee, a game they led by 14 points midway through the fourth quarter.\n\n“We had a bad taste in our mouth after we lost last night,” Strus said. “I think we should have won that one as well, so coming back tonight with guys out, the team that we had, it was a special game and one we’ll remember for the rest of the season.”\n\nDurant missed 3-pointers on his first two shots, then made his final four of the first quarter for nine points and a 35-23 lead.\n\nHe still had those nine points with under 2 1/2 minutes remaining in the half, then converted a three-point play, knocked down a jumper and a 3-pointer for eight points in a minute as Brooklyn took a 67-60 lead to the break.\n\nHeat coach Erik Spoelstra turned to a zone defense and the Heat held the Nets to 17 points and 6-for-28 shooting in the third quarter, taking an 88-84 lead to the fourth.\n\n“Spo tricks us with that zone,” said Goran Dragic, the former Heat guard who made his first start for the Nets. “They really played well the zone. We kind of lost the pace of the game.”\n\nTIP-INS\n\nHeat: Miami shot 51.9% from the field. ... Duncan Robinson missed all three shots but had seven assists.\n\nNets: The Nets announced in a statement that Joe Harris would have another surgery on his left ankle and miss the remainder of the season. Harris, who led the NBA in 3-point shooting percentage in two of the last three seasons, has been trying to return after having surgery on the ankle Nov. 29. ... Brooklyn used its 36th different starting lineup, most in the NBA this season.\n\nSIMMONS STATUS\n\nSimmons' back began acting up as he tried to build up his conditioning after not playing at all this season for Philadelphia. General manager Sean Marks said in an interview with team broadcaster YES Network that Simmons has been rehabbing the injury for the last week or so and would next move to individual work.\n\n“Hopefully, by the end of next week he’s getting more into the team environment and then we can really ramp up and start him getting into sort of game shape and so forth,” Marks said, adding there was no timetable for when Simmons could play.\n\nUP NEXT\n\nHeat: Host Philadelphia on Saturday.\n\nNets: Visit Boston on Sunday.",
  "tags_rule": [
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.777041",
  "pipeline_version": "v1"
}