{
  "game_id": "0021700429",
  "espn_id": "400975180",
  "date": "Dec 16, 2017",
  "matchup": "CHA vs. POR",
  "headline": "Trail Blazers beat Hornets 93-91 for 3rd straight road win",
  "cleaned_body": "CHARLOTTE, N.C. --  Hornets associate head coach Stephen Silas expressed concern about stopping the Trail Blazers' talented backcourt. Turns out, his concerns were warranted.\n\nCJ McCollum had 25 points, Damian Lillard flirted with a triple-double and Portland held on to beat Charlotte 93-91 on Saturday night. Lillard had 18 points, 11 assists and seven rebounds and the Trail Blazers won their third straight on the road.\n\n\"Even though it wasn't in a sexy way on the offensive end, in a sense, I think defensively we stuck in there and did the right things to make some plays,\" Evan Turner said.\n\nNic Batum had a season-high 23 points for the Hornets. They have dropped 10 of their last 12 games, including five straight at home.\n\nKemba Walker had three chances to put the Hornets ahead late, but couldn't convert.\n\nHe missed a foul line jumper with 18 seconds left with the Hornets trailing by one. McCollum made 1 of 2 free throws to push the lead to 93-31. On the ensuing possession Walker drove the lane, but couldn't get a layup to drop -- or draw the foul call -- with Jusuf Nurkic defending. A scramble for the loose ball ensued, but Jeremy Lamb air-balled a 3-pointer from the left wing.\n\nThe Hornets still had a chance after Al-Farouq Aminu missed two free throws with 3 seconds left but Walker's heave from just inside the half court line hit only the backboard.\n\nIt was that kind of night for Charlotte.\n\n\"Kemba obviously had a rough night, but he gutted it out,\" Silas said of Walker, who played with his sprained left wrist taped after aggravating it in a loss on Friday night to the Miami Heat. \"The plays that he had down the stretch, I wouldn't want the ball in anybody else's hands.\"\n\nThe Trail Blazers started an 18-4 run with 3:35 left in the third quarter as McCollum sparked the outburst with 3-pointers on back-to-back possessions. Charlotte tied it with 4 minutes remaining behind Walker and Lamb, but could never take the lead.\n\n\"The last few minutes (of the game) were pretty exciting,\" Blazers coach Terry Stotts said. \"I was proud that we were able to hold on. It's the NBA, nothing is easy. You have to grind it out, it would be nice to have a 20-point win, but those are hard to come by.\"\n\nBatum called that frustrating, particularly with it being the second night in a row the Hornets had battled back to make it a close game in the fourth quarter only to lose.\n\n\"We put ourselves in a bad situation where we were down like 15 or 16 again,\" Batum said. \"We can't as a team let that happen every time.\"\n\nTIP INS\n\nTrail Blazers: Held the Hornets to 32 percent shooting in the first half to build a 49-37 lead at the break.\n\nHornets: Johnny O'Bryant did not play in the second half due to a personal reason, according to the team. ... Michael Carter-Williams missed a wide open layup at the end of the third quarter with absolutely nobody around him.\n\nNO ROOKIES: Silas didn't play either of the team's rookies, Malik Monk or Dwayne Bacon, saying that he is shortening his rotation.\n\n\"Because we need some wins,\" Silas said of the Hornets, who dropped to 10-19. \"And it's not time to develop or gift minutes right now. It's about winning and my rotations going to be short for a little while just until we get this thing back on track.\"\n\nROAD WARRIORS: The Blazers are 3-1 on their current road trip and look to finish strong against the Timberwolves on Monday night.\n\n\"It's always hard to get a win on the road and we did that,\" Aminu said. \"We're going to keep on battling and try to finish out the road trip for sure.\"\n\nHOWARD IN CHECK:\n\nThe Blazers held Dwight Howard to nine points on 3 of 10 shooting.\n\n\"I thought Jusuf Nurkic and Ed Davis did a very good job of making it difficult for him to catch the ball and making him shoot over the top by not putting him in a position where he could just dunk the ball,\" Stotts said. \"Like any great player, you have to just make him work.\"\n\nUP NEXT\n\nTrail Blazers: At Minnesota on Monday night.\n\nHornets: Host New York on Monday.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "TripleDouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.268748",
  "pipeline_version": "v1"
}