{
  "game_id": "0021700971",
  "espn_id": "400975717",
  "date": "Mar 07, 2018",
  "matchup": "LAL vs. ORL",
  "headline": "Lopez, LA Lakers hold off Magic 108-107 in bizarre ending",
  "cleaned_body": "LOS ANGELES --  After the Los Angeles Lakers surged to a big late lead, the Orlando Magic erased it all and even went in front with 5 seconds left. Brook Lopez put the Lakers back ahead in the final second, setting the stage for a momentous finish.\n\nThanks to a mistake with the Staples Center clock, the Magic didn't even get the chance.\n\nLopez scored 27 points and hit two free throws with 0.6 seconds to play, and the Lakers blew a nine-point lead in the final 90 seconds before rallying back to beat Orlando 108-107 on Wednesday night.\n\nThe game ended with a curious sequence of events. When the Magic inbounded the ball at midcourt after Lopez's free throws, the clock started before anyone had touched the long pass. But because the mistake was technically a clock malfunction, the officials said the teams must have a jump ball at center court instead of replaying the possession, effectively preventing the Magic from getting a final chance to win.\n\n\"Just common sense would tell me in that situation, if the clock started early, just redo the possession,\" Orlando coach Frank Vogel said. \"They felt otherwise.\"\n\nThe weird ending ruined an otherwise thrilling finish between the Magic, who have lost nine of 11, and the surging Lakers, who have won six of seven.\n\n\"I don't understand the rule,\" said Nikola Vucevic, who had 24 points and 12 rebounds for Orlando. \"Pretty much any home team, if you're up one and still got 1 second (on the clock), as soon as somebody throws it, just run the clock, and if somebody touches it, it's a jump ball. It doesn't make any sense. I think they've got to look into that. That's frustrating when things out of your hands hurt you. But at the same time, that's not why we lost the game.\"\n\nAaron Gordon scored 28 points and made a driving, go-ahead layup with 5 seconds to play for the Magic, who trailed 106-97 before scoring 10 straight points. Lopez then drew a foul while backing into the low post with 0.6 seconds left, and he coolly made both free throws.\n\n\"I knew I was going to hit them,\" Lopez said. \"It was bizarre. I guess we had the game-winning jump ball.\"\n\nLonzo Ball had 16 points, six rebounds and five assists for the Lakers, who broke open a tie game with an 11-0 run midway through the fourth quarter, capped by Lopez's thunderous dunk with 6:09 to play. But the Magic stormed back and trimmed LA's lead to 106-105 when Jonathon Simmons made one of two free throws with 33 seconds left.\n\nIsaiah Thomas added 13 points and nine assists off the bench for the Lakers, who thrived despite the absence of leading scorer Brandon Ingram for the third straight game due to a strained groin.\n\n\"It's obvious we've got a young group, and we didn't execute down the stretch,\" Thomas said. \"I still don't even know how it ended. I don't even know what the call was. That (stinks) for the Magic. I'm glad we won.\"\n\nTIP-INS\n\nMagic: Before the game, Orlando waived guard Rashad Vaughn. His sore knee would have prevented him from playing out the rest of his second 10-day contract, so the Magic made the move. ... Evan Fournier scored 11 points before being sidelined during the second half by a sprained left knee.\n\nLakers: They wore their powder-blue Minneapolis Lakers throwback uniforms. ... Ingram won't return until Sunday against Cleveland at the earliest. ... The 7-foot Lopez somehow didn't get a rebound in 35 minutes of play. \"Fun fact,\" he said with a sardonic grimace.\n\nROOKIE ROLL\n\nKyle Kuzma had 20 points and 10 rebounds in one of his best games of 2018. The University of Utah product had at least 20 points and 10 rebounds for the first time since Dec. 22 at Golden State. He appeared to hit the rookie wall in January.\n\nTHE BIG PAYBACK\n\nWhile recording their 10th win in their last 11 home games, the Lakers avenged an embarrassing loss in Orlando on Jan. 31. The Magic routed the Lakers 127-105 at Amway Center, even without Gordon in the lineup. That embarrassment partly sparked the Lakers on their current run of strong form, with nine wins in 14 games since that defeat.\n\nUP NEXT\n\nMagic: At Sacramento Kings on Friday night for the third stop on a five-game road trip.\n\nLakers: At Denver Nuggets on Friday night.\n\n---\n\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.724845",
  "pipeline_version": "v1"
}