{
  "game_id": "0022100090",
  "espn_id": "401359914",
  "date": "Oct 31, 2021",
  "matchup": "CHA vs. POR",
  "headline": "Ball, Oubre lead Hornets past Trail Blazers, 125-113",
  "cleaned_body": "CHARLOTTE, N.C. -- — The Charlotte Hornets signed free agent Kelly Oubre Jr. this offseason to provide energy off the bench and allow starting forward Gordon Hayward to rest a little more so he can make it through an 82-game season.\n\nOubre is working out just as planned so far for the surging Hornets.\n\nLaMelo Ball had 27 points, nine rebounds and seven assists and Oubre sparked the Hornets by scoring 13 of his 26 points in the decisive fourth quarter in a 125-113 victory over the Portland Trail Blazers on Sunday night.\n\n“He has been fantastic,” said James Borrego, who won his 100th game as head coach of the Hornets. “This why we brought him here. We believe in him. We believe there is a major role for him on this team and tonight was a great example.”\n\nMiles Bridges added 19 points and a career-high nine assists, and P.J. Washington had 17 points and some big plays down the stretch to help Charlotte improve to 5-2.\n\nThe Hornets led 89-88 entering the fourth quarter when Oubre took over.\n\nHe provided 10 quick points, including two 3s and a dunk off an offensive rebound. He also helped the Hornets step up their overall defensive effort with a steal out near the top of the key as Charlotte limited the Blazers to 25 points in the fourth quarter.\n\nOubre had another 3 with 2 1/2 minutes to play to stifle one Blazers rally and push the lead back to double digits. Washington sealed the win with a turnaround jumper in the lane to beat the shot clock and a block at the other end.\n\n“He is a difference maker out there,\" Hornets guard Terry Rozier said about Oubre. \"He and Miles Bridges do the same thing. He just turns it up out there.”\n\nThe Hornets had 36 assists.\n\n“This is pretty much the most fun I have had in my career playing basketball,” Oubre said. “We all have the same goal in mind. We want each other to eat and succeed and as long, so as we have that mindset I think we will have more and more fun throughout the year.”\n\nC.J. McCollum had 25 points for Portland, and Jusuf Nurkic had 13 points and 14 rebounds. The Blazers had won two in a row.\n\nCharlotte finished 20 of 42 from 3-point range after entering the game as the league's second-best 3-point shooting team at 40.2%.\n\n“I thought we got caught up kind of playing their style,” said Blazers coach Chauncey Billups. \"They kind of just get up and down and run and play like you’re at the park and it’s easy to get caught up like that because that’s fun. It’s fun to play that way. I thought we got caught up there.”\n\nBALL STEPS UP\n\nBall broke out of a mini-slump by making 10 of 20 shots from the field, including four 3s. Ball was coming off a tough two-game stretch where he was 1 of 10 from 3-point range and he was held to six points in a loss Friday night to the Miami Heat.\n\n“That was a mature performance,” Borrego said. “He owned it from the Miami game. There are things we all have to correct from that game. We watched the film, we talked about it and that was a very mature response by him.”\n\nLILLARD STRUGGLES AGAIN\n\nDamian Lillard, coming off a season-high 25 points in a victory over the Los Angeles Clippers on Friday night, had 14 points and 12 assists for Portland. He was 5 of 20 overall and 2 of 14 from 3-point range.\n\nLillard is shooting just 37.1% from the field and 26.2% from 3-point range.\n\nROZIER RETURNS\n\nRozier got the start after missing the last four games with a sprained right ankle. The team's leader scorer last season finished with 14 points on 4 of 10 shooting and chipped in with five assists in nearly 33 minutes of action.\n\n“It felt good being out there with my brothers,” Rozier said. “It felt like it has been a long time coming.”\n\nIt's the first time the Hornets have been at full strength this season.\n\nTIP-INS\n\nTrail Blazers: Cody Zeller received a warm welcome from the crowd at the Spectrum Center when he was introduced in the first quarter. Zeller spent eight seasons with the Hornets before signing with the Trail Blazers this past offseason.\n\nHornets: This was the first game of the season the Hornets did not trail by at least 10 points, although they were close. Their biggest deficit was eight points.\n\nUP NEXT\n\nTrail Blazers: Host Cleveland on Monday night.\n\nHornets: At Philadelphia on Monday night.\n\n------",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.469588",
  "pipeline_version": "v1"
}