{
  "game_id": "0021400501",
  "espn_id": "400578793",
  "date": "Jan 03, 2015",
  "matchup": "POR vs. ATL",
  "headline": "Paul Millsap's 27 lead Hawks past Blazers for fourth straight win",
  "cleaned_body": "PORTLAND, Ore. -- Even a late threat from the Trail Blazers didn't rattle the steady Hawks.\nPaul Millsap had 27 points and Atlanta held off a late Portland rally for a 115-107 victory Saturday night for their fourth straight win.\nJeff Teague added 22 points and the Hawks, playing the second game of a back-to-back, improved to 11-5 on the road, including six straight wins away from home.\n\"We just kept saying, 'Stay solid. Keep playing our game, and let's go out and get this game,' \" said Kyle Korver, who added 14 points. \"And that's what we did.\"\nThe loss snapped a four-game winning streak for the Trail Blazers, who have lost just three games at home this season. LaMarcus Aldridge led Portland with 30 points and 12 rebounds.\nThe Hawks led by as many as 20 points in the second half. But trailing 106-96 with just under 3 minutes to go, Wesley Matthews hit a 3-pointer and Aldridge added a layup.\nAldridge dunked to make it 109-103 with 1:21 left, but the rally fell short.\nThe Hawks were coming off a 98-92 victory at Utah on Friday, which popped them into the top spot in the Eastern Conference for the first time since Dec. 27, 1997.\nThe victory improved the Hawks to 8-2 over Western Conference opponents.\n\"This is a tough place to play,\" Millsap said of Portland's Moda Center. \"I've played here many times over the years when I was in Utah -- I know how tough it is to play here. The crowd gets into it and the team feeds off the crowd. Winning here says a lot about our team.\"\nThe Blazers got a hard-fought 102-97 overtime victory at home against Toronto on Tuesday, which extend their winning streak at home to seven straight games.\nWith Matthews effectively guarding Korver, the Blazers jumped out to an 8-0 lead after Matthews' 3-pointer. But Atlanta went on an 18-3 run to lead 29-20 at the end of the first quarter.\n\"Great first few minutes, but then I thought they did a really good job of just taking us out of our rhythm and making us play too fast,\" Aldridge said. \"Their defense made us uncomfortable most of the night.\"\nTrailing by as many as 11 in the half, Portland pulled to 50-47 on consecutive late baskets from Aldridge. Nicolas Batum added a layup, but the Hawks still led 52-49 at the break.\nAtlanta extended the lead in the second half, going up 62-51 on Millsap's dunk. Teague's basket pushed the advantage to 81-61.\nThe Blazers responded with a 14-2 run to close out the third quarter, capped by Damian Lillard's long 3-pointer at the buzzer that closed the gap to 83-75.\nAldridge thought that might be the start of a momentum shift.\n\"I thought things were definitely going to change for us,\" he said. \"Just with who we are, I thought we were getting over the hump, but they played defense and made shots down the stretch.\"\nPortland was hurt early in the fourth when center Joel Freeland appeared to injure his right shoulder and was whisked to the locker room. Freeland had been getting more minutes in the absence of Robin Lopez, who is out with a broken hand.\nAfter the game the Blazers said an MRI confirmed that Freeland sustained a right shoulder strain. He will be reevaluated in two weeks.\nTIP INS\nHawks: Blazers coach Terry Stotts was head coach of the Hawks in 2003-04, coaching the team to a 52-85 record.\nTrail Blazers: Lillard was playing in his 198th consecutive game for the Blazers, ranking him second with Terry Porter on the franchise all-time list. ... Singer k.d. Lang, a Portland resident, was among the fans at the game.\nTHE 3-POINTERS\nMuch was made going into the game about the potential 3-point battle between Matthews and Korver, both known for their perimeter shooting. In the end, both players finished with four 3 pointers.\nOverall, the Blazers made 13 and the Hawks made six. While normally the Blazers win those games where they score that many, Matthews lamented: \"You have nights like that sometimes.\"\nSTAT OF THE NIGHT\nThe Hawks had 64 points in the paint, while the Blazers had 38. That was an issue for Stotts.\n\"I've been concerned about points in the paint all season. As long as we score, if we get them in the paint, I'm not as concerned. But defensively, that is a concern. The ball was getting to the rim too much.\"\nQUOTABLE\nWesley Matthews on the Blazers: \"We just weren't ourselves.\"\nUP NEXT\nHawks: At the Los Angeles Clippers on Monday.\nTrail Blazers: Host the Los Angeles Lakers on Monday.",
  "tags_rule": [
    "EarlyRun",
    "Streak",
    "MomentumShift"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.033424",
  "pipeline_version": "v1"
}