{
  "game_id": "0021700790",
  "espn_id": "400975536",
  "date": "Feb 05, 2018",
  "matchup": "POR @ DET",
  "headline": "Pistons win 4th straight in 111-91 rout of Portland",
  "cleaned_body": "DETROIT --  Stan Van Gundy worried over the weekend that the Detroit Pistons were becoming too reliant on Blake Griffin.\n\nThat wasn't a problem Monday night.\n\nAndre Drummond had 17 points and 17 rebounds, and the Pistons beat the Portland Trail Blazers 111-91 for their fourth straight victory. Detroit had 36 assists on 44 field goals and had six players with at least 12 points.\n\n\"I didn't really think we moved the ball that much at the start of the game, but then we really got it going,\" said Van Gundy, Detroit's coach. \"The best part is that you look how many guys got involved -- it wasn't just one or two guys with a bunch. Once you start moving the ball, it gets contagious.\"\n\nDetroit has won three in a row with Griffin in the lineup after acquiring him in a trade last week. Following a win over Miami on Saturday, Van Gundy said the Pistons might be playing through Griffin too much. He still led Detroit in scoring Monday, but the Pistons had plenty of threats.\n\n\"They had one action -- dribble handoff out of the corner -- and they kept getting down to the center of our defense,\" Portland's Damian Lillard said. \"Once guys get confident and get to making shots, it's hard to stop.\"\n\nThe victory pulled the Pistons back to .500 and even with Philadelphia for the final playoff spot in the Eastern Conference.\n\nGriffin had 21 points, nine rebounds and six assists, and did a good bit of his offensive damage from the perimeter, making three 3-pointers. Anthony Tolliver added 15 points for Detroit, and Reggie Bullock and Langston Galloway contributed 13 apiece.\n\nLillard scored 20 points and C.J. McCollum added 14 for the Blazers, who lost again after falling at the buzzer at Boston on Sunday. Portland was without Evan Turner on Monday because of a left calf injury.\n\nDetroit led by 13 in the second quarter and was up 49-43 at halftime. The Pistons pushed the lead to double digits again in the third. A 9-0 run capped by Luke Kennard's 3-pointer made it 75-57.\n\nDetroit was never seriously threatened in the fourth, and the game ended with several seldom-used reserves on the court.\n\nTIP-INS\n\nTrail Blazers: Lillard is six points shy of Jerome Kersey for fifth place on the franchise's career scoring list.\n\nPistons: Dwight Buycks (illness) missed the game. ... Detroit has won five in a row against Portland. The teams meet again March 17 at Portland.\n\nPULLING EVEN\n\nDrummond now has 266 double-doubles since entering the NBA in 2012-13. He's tied with DeMarcus Cousins for the most in that span.\n\nGETTING COMFORTABLE\n\nDrummond and Griffin seem to be developing some chemistry together, and they combined for 11 assists.\n\n\"It can only get better from here,\" Drummond said. \"He's going a great job of adjusting right now. We didn't really understand what was going to happen when we first got him. We didn't know how long it was going to take for him to adjust, but him being the professional that he is, he adjusted very quickly.\"\n\nTOUGH STRETCH\n\nThe Blazers went 0-3 in a four-day stretch that included road games against Toronto, Boston and Detroit.\n\n\"That's part of the NBA schedule. You play back-to-backs, you play three in four nights,\" Portland coach Terry Stotts said. \"I don't think anybody uses that as an excuse.\"\n\nUP NEXT\n\nTrail Blazers: Host the Charlotte Hornets on Thursday night.\n\nPistons: Host the Brooklyn Nets on Wednesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.575949",
  "pipeline_version": "v1"
}