{
  "game_id": "0021401202",
  "espn_id": "400579494",
  "date": "Apr 13, 2015",
  "matchup": "HOU @ CHA",
  "headline": "Harden scores 29, Rockets beat Hornets",
  "cleaned_body": "CHARLOTTE, N.C. -- James Harden has given up on trying to decipher where the Houston Rockets will wind up seeded in the Western Conference playoffs.\nHe says it's just too confusing.\n\"I don't even look at it,\" Harden said. \"All of the teams are basically tied and it will come down to the final game -- and we still may not know until all of the games are over.\"\n\nThe focus, he said, is on the Rockets taking care of their own business.\nHarden scored 29 points, Josh Smith had a double-double and Houston defeated the Charlotte Hornets for the ninth straight time 100-90 on Monday night. He was only 7 of 20 from the field, but did plenty of damage from the free throw line where he was 14 of 16. It marked the 62nd time this season he's scored at least 20 points in a game.\nSmith added 16 points and 11 rebounds for the Rockets, who moved back into a tie with San Antonio for first place in the Southwest division with one game remaining. The Memphis Grizzlies, which played on the West Coast Monday night against the Los Angeles Clippers, could make it a three-way tie if they win.\nHouston finishes the season at home against Utah on Wednesday night.\n\"It's going to be big for us,\" Harden said.\nJason Terry had 13 points and Trevor Ariza and Corey Brewer chipped in with 11 for the Rockets (55-26).\nHarden said that type of balanced scoring balance will be huge for the Rockets as they gear up for the postseason.\n\"We move the basketball and everybody gets shots, and defensively we help each other out,\" Harden said.\nSaid Smith: \"It just shows how deep we are.\"\nThe Rockets won without center Dwight Howard, who was given a night off to rest.\nCharlotte played without starters Al Jefferson, Michael Kidd-Gilchrist and Cody Zeller and reserves Lance Stephenson and P.J. Hairston due to injuries. They also rested Mo Williams.\nRockets coach McHale bemoaned his team's slow starts during in his pre-game press conference, then watched as his team missed 9 of 12 shots to start the game and fell behind by six.\nHouston didn't start to take control until late in the third quarter when Harden began to find his rhythm.\nThe lefty scored on drives to the basket and got to the foul line, finishing with 10 points in the quarter helping the Rockets open an 83-75 lead. Houston would never surrender the lead, but didn't put the game away until the final two minutes when Terry knocked down a 3-pointer to push the lead to 12.\n\"We got it going much better in the second half,\" McHale said.\nBrian Roberts scored 23 points off the bench for the Hornets, who have lost five straight games.\nJeffery Taylor had 16 points and Troy Daniels added 15 for the Hornets (33-48), who were eliminated from playoff contention last week. Bismack Biyombo, whose contract is up after the season, had nine points and 13 rebounds.\nCharlotte struggled from the foul line, converting just 9 of 17 shots. The Rockets were 21 of 26.\nTIP-INS\nRockets: Ariza has scored in double digits in 16 of his last 19 games. ... Improved to 26-15 on the road. ... Joey Dorsey started for Howard, but didn't score. He had five rebounds.\nHornets: Roberts scored 16 points in the second quarter on 6-of-10 shooting, including four 3-pointers. ... Finished the season 19-22 at home.\nGOING YOUNGER\nWith their postseason hopes over, Hornets coach Steve Clifford has been playing rookie Noah Vonleh and youngster Troy Daniels more in recent games. Daniels played 28 minutes and Vonleh 22.\n\"I think it's a great way to jump start their summers,\" Clifford said.\nCAPELLA SCORES 10\nClint Capella scored 10 points and have five rebounds for the Rockets and drew praise after the game from McHale.\n\"He works extremely hard,\" McHale said. \"Every single day he works. He's a true professional as a young guy. When coach calls your name, you go and run the floor, you get dunks, you block shots, and you rebound the basketball. He's learning.\"\nUP NEXT\nRockets: Host Utah on Wednesday night.\nHornets: At Toronto on Thursday night.",
  "tags_rule": [
    "DoubleDouble",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.090778",
  "pipeline_version": "v1"
}