{
  "game_id": "0021301022",
  "espn_id": "400489895",
  "date": "Mar 21, 2014",
  "matchup": "CHI @ IND",
  "headline": "Luis Scola, Lance Stephenson lift Pacers over visiting Bulls",
  "cleaned_body": "INDIANAPOLIS -- Even in the midst of their worst month of the season, the Indiana Pacers are finding ways to win big games.\nOn Friday night, the Pacers beat the Chicago Bulls 91-71 to take a 13-game lead on the Bulls in the Central Division. The Pacers have won five of their last six games after losing four straight earlier this month -- the team's worst skid of the year.\nThe win couldn't come at a better time.\n\"In the NBA, a week looks like an eternity, so it feels like we haven't been playing great in a while,\" Luis Scola said. \"We needed it. We needed the confidence and we also needed the win.\"\nScola had 19 points off the bench and Lance Stephenson finished with 15 for the Pacers (51-18), who went on a 19-0 run in the third quarter.\nCarlos Boozer was called for a Flagrant 1 foul with 7:31 left in the third, Roy Hibbert made two free throws and Stephenson made a basket to give the Pacers a 63-45 lead.\nD.J. Augustin and Jimmy Butler each scored 17 points for the Bulls (38-31), who have lost two of their last three.\nThe win also gave Indiana a 2-1 series lead over the Bulls. The Pacers will visit Memphis on Saturday and then Chicago on Monday before they host Miami on Wednesday.\nPaul George, who finished with 10 points, 12 rebounds and 10 assists, also made a basket and dunked, David West scored twice and Stephenson made a basket, a dunk and converted a three-point play to help the Pacers pull away in the big run in the third quarter.\n\"I'm very proud of the team approach and the willingness to share the basketball and move the basketball,\" Pacers coach Frank Vogel said. \"I think we did remind ourselves of who we are tonight.\"\nVogel's main point of emphasis heading into the game was sharing the ball. Indiana finished with 27 assists.\nThe Bulls went on a 7-0 run early in the fourth quarter, but it wasn't enough.\nJoakim Noah scored a basket, Augustin made two free throws, Butler made another and Mike Dunleavy scored to make it 77-69 with 9:30 remaining. Scola scored to end the run and give Indiana a 79-69 lead.\nAugustin made a layup, but Scola scored again and later made a layup and a free throw to give the Pacers an 84-71 lead with 4:27 remaining.\nNot much went right for Chicago, who shot just 36.4 percent and was outrebounded 51-36.\nChicago forward Taj Gibson felt wronged, too.\nHe fouled out with 7:07 left in the fourth when he knocked Scola to the ground on a rebound. He was called for his fifth foul on the offensive end of the floor 30 seconds before fouling out.\n\"I thought there was a lot of flopping going on out there,\" Gibson said. \"Anytime you see that, it makes you think that you don't want to get a ticky-tack foul. It was a dog fight, a slug fest, and I thought a couple of calls didn't go our way and took some of our momentum away.\"\nA potential upcoming playoff preview.\nScola broke away in the second quarter with 12 points. He made back-to-back baskets, Evan Turner scored, and Scola made another jumper in an 8-0 run at the start of the second quarter to give the Pacers a 27-23 lead.\nScola scored to give the Pacers a 42-35 lead with 3:54 left in the first half before the Bulls went on a 6-0 run.\nNoah scored a pair of free throws, Gibson scored and Augustin made a layup to make it 42-41 with 1:48 left in the half. George Hill scored for Indiana and Augustin scored to make it 44-43 at halftime.\nGame notes\nIndiana announced about an hour before tipoff that Andrew Bynum was out indefinitely with soreness and swelling in his right knee and said he would \"continue to undergo treatment.\" Bynum, who signed with Indiana on Feb. 1 after being suspended in December by the Cleveland Cavaliers, made his debut with the Pacers against the Boston Celtics last week and played in just two games. ... The Bulls handed Indiana its first loss of the season back on Nov. 16 after the Pacers got off to their best start in franchise history. Derrick Rose and Luol Deng combined for 43 points in that game. This time, the Bulls didn't have either. Deng has since been traded and Rose hasn't played since Nov. 22.",
  "tags_rule": [
    "CoachComment",
    "PhysicalGame",
    "FoulTrouble"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.700247",
  "pipeline_version": "v1"
}