{
  "game_id": "0021700975",
  "espn_id": "400975721",
  "date": "Mar 08, 2018",
  "matchup": "OKC vs. PHX",
  "headline": "Russell Westbrook, Thunder rout Suns 115-87",
  "cleaned_body": "OKLAHOMA CITY --  A week after Russell Westbrook's late-game play ended Oklahoma City's losing streak to Phoenix, the reigning MVP keyed another victory over the Suns.\n\nWestbrook had 27 points, eight rebounds and nine assists in the Thunder's 115-87 rout Thursday night.\n\n\"He set the table for everybody tonight,\" Thunder coach Billy Donovan said. \"He did a really, really great job of playing downhill, getting guys shots. He was terrific. His leadership, his communication out there in timeouts, in huddles, that's what we need from him. Because when he does do all that -- and it's a lot on his plate -- it just takes our team to a different level.\n\n\"I thought tonight he just totally controlled the game.\"\n\nPaul George added 21 points, Corey Brewer had 17, Steven Adams 16, and Carmelo Anthony 11.  Brewer, who made his Thunder debut two games ago, replaced Josh Huestis in the starting lineup and responded with a 6-for-11 performance from the floor.\n\n\"I feel more comfortable,\" Brewer said. \"I'm learning the system and each day is getting easier. For me I know how to fit. I've been in the league so long I know how to fit.\"\n\nBrewer's addition to the lineup added an energy and defensive presence that the Thunder have been searching for in Andre Roberson's absence.\n\nIn the second quarter, Westbrook hit Brewer with a no-look pass as Brewer cut to the basket for a layup, showcasing Brewer's energy and ability to move on the court.\n\n\"I feel comfortable with Corey shooting the ball out of the corner, and he's also a good cutter. He can tell when his guy maybe falls asleep or is focusing in on some different actions and can back-cut.\"\n\nOn the other end of the floor, the Thunder limited the Suns to 33.7 percent from the field and 24.3 percent from 3-point range.\n\n\"We did a good job of just being aggressive and making them shoot tough shots,\" Westbrook said. \"Using our size on them and defending at a high rate.\"\n\nDevin Booker, wearing a headband for the first time in his three-year NBA career, had 30 points for Phoenix. He had 39 last week in Arizona in a loss to the Thunder.\n\nThe Suns built an early first-quarter lead, jumping to a 14-8 lead by the first media timeout behind five quick points from Booker and four from Josh Jackson.\n\nBut the Thunder erased the deficit by the end of the first quarter behind a dominant post presence. Led by Adams' eight first-quarter points, the Thunder outscored the Suns 14-2 in the paint in the frame.\n\nOklahoma City led 49-38 at halftime, shooting 46.3 percent from the floor and limiting the Suns to just 27.9 percent. Westbrook had a 7-0 run of his own in third to push the lead to 22 points.\n\nTIP-INS\n\nThunder: Improved to 1-2 with Brewer in the lineup. ... Terrance Ferguson left late in the third quarter after a collision with Adams. Ferguson, who scored two points, is in the concussion protocol.\n\nSuns: Lost their fourth game in a row. They haven't won in March. ... T.J. Warren missed the game because of back spasms. Josh Jackson started in his place, scoring six points.\n\nCOLLISON TIME\n\nWith the Thunder up by double-digits in the fourth quarter, Thunder forward Nick Collison made his 11th appearance of the season. He played four minutes and received a thunderous applause when he dunked the ball.\n\n\"It's still fun to play,\" Collison said. \"The juices are still flowing a little bit when you get out there. It was a good four and a half minutes or whatever it was.\"\n\nSTAT LINE\n\nWhile all of the Thunder starters finished in double figures, the bench only contributed 23 points. At halftime, the only points scored off the bench came from a 3-pointer by Raymond Felton.\n\nUP NEXT\n\nSuns: At Charlotte on Saturday.\n\nThunder: Host San Antonio on Saturday night.",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.209325",
  "pipeline_version": "v1"
}