{
  "game_id": "0021301075",
  "espn_id": "400489948",
  "date": "Mar 28, 2014",
  "matchup": "CHA @ ORL",
  "headline": "Magic edge Bobcats 110-105 in OT",
  "cleaned_body": "ORLANDO, Fla. --  A big early deficit and an opponent's hot shooting hand didn't faze Nikola Vucevic or the rest of the Orlando Magic.\n\nVucevic scored 24 points and grabbed 23 rebounds, and Jameer Nelson had five points in overtime as the Magic edged the Charlotte Bobcats 110-105 on Friday night.\n\nAaron Afflalo, who finished with 17 points, sent the game into overtime with a 3-pointer with 7.6 seconds remaining as Orlando won its second straight. In overtime, Nelson's 3-pointer with 2:26 left put Orlando ahead for good.\n\n\"I knew it would turn around,\" Vucevic said. \"I kept my confidence high. I had all good looks,\" said Vucevic, who was 11-for 22 from the field. \"A 15-16 point lead in this league is nothing. You have to keep fighting, grinding and that's what we did tonight.\"\n\nVucevic, who recorded his fifth career game with 20 points and 20 rebounds, keyed a dominant rebounding effort (57-36) by Orlando. His first-half total of 16 matched Charlotte's team total through two quarters.\n\nOrlando, which trailed during the first 44 minutes, took a 94-93 lead on an Afflalo's free throw with 1:12 left. But Josh McRoberts, who had a career-high 24 points, drove the lane to put Charlotte ahead. Kemba Walker then hit a fadeaway jumper with 14.6 seconds left to put the Bobcats up three -- setting up Afflalo's tying 3.\n\n\"It was great fight by all of the guys,\" Orlando coach Jacque Vaughn said. \"Whether it was the unit that started the fourth quarter and really got us going defensively to put up a 16-point quarter versus a team like that or the mental fight of Nik Vucevic, who starts out the game 4-for-14 and doesn't give in and wills his way and helps his team. Pretty impressive in a lot of different ways.\"\n\nThe Bobcats looked as though they had escaped after Walker's final basket in regulation, but a defensive lapse gave Afflalo a look, and the game went to overtime.\n\n\"All you've got to do is do what we're supposed to do right there and the game ends. That was it,\" Charlotte coach Steve Clifford said. \"We have to make one play that you make time after time and we didn't make the play.\"\n\nTobias Harris had 15 points for the Magic, while Victor Oladipo added 14 and Kyle O'Quinn 13. Nelson, who missed the last four games with a sore knee, had 11.\n\nWalker matched McRoberts with 24 points for Charlotte, while Al Jefferson scored 20. Gerald Henderson added 14 and Michael Kidd-Gilchrist 10.\n\n\"That was our biggest emphasis coming in: to get to the glass and be physical,\" Clifford said. \"We weren't willing to do that to start the game and that's what kept them (Orlando) in the game. I want to see a recommitment to the way we were defending and rebounding early in the year consistently. We're sporadic now.\"\n\nOrlando pulled to within one point twice in the third quarter, the last when O'Quinn's layup made it 59-58 with 7:17 remaining.\n\nCharlotte answered as McRoberts drained back-to-back 3-pointers and scored eight points during a 16-6 run that pushed the Bobcats' lead back to double-digits at 75-64. Charlotte took an 81-74 lead into the fourth quarter.\n\nMcRoberts, whose six 3-pointers were a career high, was often left unchallenged from 3-point range and took full advantage. He was 4-for-6 from behind the arc for all 12 of his first-half points as the Bobcats took a 50-41 halftime lead.\n\nCharlotte scored the game's first five points and hit nine of its first 11 shots to take a 22-10 advantage on Kidd-Gilchrist's dunk with 6:52 remaining. The Bobcats led by as many as 16 in the opening quarter.\n\nOrlando used 11 rebounds from Vucevic and eight points off the bench from Harris in the second quarter to get as close as 43-39 with 1:31 remaining in the second quarter. Charlotte then scored the next six points and finished the half on a 7-2 run to take a nine-point halftime lead.\n\nGame notes The loss sent Charlotte 2 1/2 games behind Washington for the sixth seed in the Eastern Conference. ... This was only the third time since January that Charlotte lost to a team with a losing record. ... This was Orlando's 1,000th regular-season victory. ... Nelson also had eight assists and four rebounds in 32 minutes. ... The Magic went to the free-throw line 35 times, compared to Charlotte's 14.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.633358",
  "pipeline_version": "v1"
}