{
  "game_id": "0021700342",
  "espn_id": "400975093",
  "date": "Dec 04, 2017",
  "matchup": "BKN @ ATL",
  "headline": "LeVert, Hollis-Jefferson pace Nets' win over Hawks",
  "cleaned_body": "ATLANTA --  With his team headed to Mexico City for two games this week, Caris LeVert knew the Brooklyn Nets couldn't afford a second straight poor outing against the Atlanta Hawks.\n\n\"We feel like we let one get away at home against these guys,\" he said. \"We wanted to come in and play super hard tonight. I think that gives us great momentum going into Mexico.\"\n\nLeVert scored a season-high 17 points, Rondae Hollis-Jefferson had 16 and the Nets used a strong third quarter to beat the Atlanta Hawks 110-90 on Monday night.\n\nBrooklyn, avenging Saturday's home loss to Atlanta, had everything working in its favor in the second half. It began the third trailing by one but went on a 17-0 run to go ahead 70-54 on DeMarre Carroll's 3-pointer. The lead swelled to 29 in the fourth as the Nets earned their largest win of the season.\n\nBrooklyn leaves Tuesday for Mexico City to face Oklahoma City and Miami and help the NBA broaden its international appeal. They head there with coach Kenny Atkinson knowing that LeVert can handle more minutes to spell starting point guard Spencer Dinwiddie.\n\nLeVert tied a career high with seven assists and played over 27 minutes.\n\n\"I thought Spencer was on fumes a little bit and I thought Caris came in and really took the torch,\" Atkinson said. \"He was really good in the pick-and-roll. He can really pass the ball, had a couple of nice lobs, a couple of nice wraparounds.\"\n\nHawks point guard Dennis Schroder, the catalyst in the last game, hit his first seven shots but missed eight of his last 10. He finished with 19 points but was a nonfactor in the second half.\n\n\"He was hitting tough shots,\" LeVert said. \"He was hitting floaters, contested floaters, contested pull-ups. If you look at the numbers, they're going to even out. You're not going to keep hitting those shots.\"\n\nThe Nets improved to 5-9 on the road. They didn't win their fifth away from home last season until early March.\n\nDinwiddie and Carroll each had 13 points to help Brooklyn improve to 9-14 overall. Hollis-Jefferson began the game 1 for 9 from the field but hit his last five shots.\n\nThe Hawks missed 17 of their first 18 shots in the third. They pulled within nine on Luke Babbit's 3 in the closing minute, but Jarrett Allen had two dunks and assisted on Levert's jumper to lead by 15.\n\nKent Bazemore and DeAndre' Bembry each added 13 points for Atlanta, which dropped to 5-18, second-worst in the NBA.\n\n\"It just looked like we were a little bit short on some good looks,\" Hawks coach Mike Budenholzer said. \"Then we had some shots that just went in and out. If those go in, maybe it's a little different game.\"\n\nTIP-INS\n\nNets: Allen Crabbe was ejected after fouling out in the fourth. He threw the ball hard from Brooklyn's end against Atlanta's backboard. ... Allen scored 11 points with four dunks. He also hit his first career 3 in the first after going 0 for 7 beyond the arc in his only season at Texas. ... Tyler Zeller had a season-high nine rebounds. ... Brooklyn had eight steals after getting just one Saturday.\n\nHawks: C Miles Plumlee started his second straight game following the left tibia injury to Dewayne Dedmon and had one point with seven rebounds went scoreless. Acquired with Marco Belinelli in the offseason trade that sent Dwight Howard to Charlotte, Plumlee was out the first 14 games with a strained right quadriceps, but he had a bad start to the season by showing up out of shape on the first day of training camp. ... Atlanta was outscored 18-6 in fast-break points and 23-8 in second-chance points.\n\nUP NEXT\n\nNets: Play a pair of games in Mexico City against Oklahoma City on Thursday and Miami on Saturday.\n\nHawks: Visit Orlando on Wednesday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "ThreePointExplosion",
    "CoachComment",
    "CareerHigh",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.097699",
  "pipeline_version": "v1"
}