{
  "game_id": "0022100790",
  "espn_id": "401360609",
  "date": "Feb 04, 2022",
  "matchup": "TOR vs. ATL",
  "headline": "Siakam matches season high with 33 points, Raptors top Hawks",
  "cleaned_body": "TORONTO -- — Pascal Siakam matched his season high with 33 points, Fred VanVleet had 26 points and 11 assists and the Toronto Raptors beat the Atlanta Hawks 125-114 on Friday night for their fifth straight victory.\n\nThe Raptors also beat the Hawks 106-100 in Atlanta on Monday night, with the Hawks' only two losses in the last 10 games coming against Toronto.\n\nSiakam scored 21 points in the first quarter. Gary Trent Jr. scored 19 points, Scottie Barnies had 16, Chris Boucher 11 and Precious Achiuwa 10.\n\nDe’Andre Hunter and John Collins each scored 23 points for Atlanta, Trae Young had 22 points and 13 assists, and Bodan Bogdanovic had 18 points.\n\n“This team, they speed you up with their pressure and their trapping, and changing defenses,” Hawks coach Nate McMillan said about the Raptors. “We had a couple of turnovers late that hurt us.”\n\nBesides its two wins over Atlanta, Toronto beat Miami twice in this five-game streak, once in triple overtime, and had an OT victory over Chicago on Thursday night. The Bulls and Heat are the top two teams in the Eastern Conference.\n\n“I think we should feel pretty good,” Siakam said. “Definitely some tough games out there against really good teams in the East. Those are the teams we want to face every single night. The games came at us pretty fast. I liked the way we responded every single game.”\n\nBoth teams were playing the second night of a back-to-back. Toronto played its fifth game in seven days, while Atlanta played for the fifth time in eight days.\n\n“We knew it was going to be rough and we knew we were going to be fatigued,” Toronto’s OG Anunoby said. “We just try to pick each other up and play hard, get through it.”\n\nYoung was coming off a 43-point performance Thursday night in a 124-115 home victory over NBA-leading Phoenix. Young shot 9 for 20 against Toronto and went 0 for 4 from 3-point range.\n\n“We definitely had heavy legs,” McMillan said. “They had heavy legs as well. I thought it affected our shooting.”\n\nAtlanta shot 20 for 41 from distance against the Suns, but missed 19 of its first 24 attempts Friday before four straight 3-pointers in the final quarter helped close the gap to five points, 115-110, with 4:11 remaining.\n\nYoung’s jump shot with 3:26 left cut the gap to three, but Barnes scored a layup and Trent hit a corner 3 to put Toronto up by eight, 120-112, with 1:56 left.\n\n“It wasn’t a work of art but it was enough tonight,” Raptors coach Nick Nurse said.\n\nQUARTER POUNDERS\n\nSiakam is the second Raptors player in the past month to put up a 20-point quarter. VanVleet had 24 in the third quarter of a Jan. 7 home win over Utah. Siakam holds the Raptors record for points in a quarter, scoring 25 in the first quarter of a Jan. 26, 2020 win at San Antonio.\n\nDOWN AND OUT\n\nThe Hawks are 2-12 in road games where they trail after the first quarter, and 5-18 overall in such games.\n\nTIP-INS\n\nHawks: Collins started after injuring his right shoulder late in Thursday’s win over Phoenix. … G Lou Williams returned after sitting out Thursday because of back spasms. … F Danilo Galinaro (right hamstring) was not available.\n\nRaptors: Shot 5 for 11 from 3-point range in the first half but made 7 of 10 from distance in the third quarter. … Anunoby had 10 rebounds, while Siakam and Barnes each had nine. … Toronto had 17 turnovers. Its season high is 21.\n\nUP NEXT\n\nHawks: At Dallas on Sunday night.\n\nRaptors: At Charlotte on Monday night.\n\n------",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.542032",
  "pipeline_version": "v1"
}