{
  "game_id": "0021300857",
  "espn_id": "400489730",
  "date": "Feb 26, 2014",
  "matchup": "MEM vs. LAL",
  "headline": "Grizzlies thwart Lakers' long-range, fourth-quarter rally",
  "cleaned_body": "MEMPHIS, Tenn. -- The Los Angeles Lakers almost had enough 3-point shooting down the stretch to overtake the Grizzlies.\nHowever, Memphis' lead was just a little too big.\nCourtney Lee scored 18 points, Marc Gasol had 14 points and 12 rebounds, and the Grizzlies overcame the late 3-point shooting display to beat the Lakers 108-103 on Wednesday night.\n\"It was an interesting game,\" Memphis coach Dave Joerger said. \"Good energy from our first group. Good energy from our second group. We were in attack mode.\"\nTony Allen added 17 points for Memphis, while James Johnson also scored 14 and Zach Randolph added 13.\nJodie Meeks led the Lakers with 19 points, Wesley Johnson added 18 and Pau Gasol had 17 points and 10 rebounds. Jordan Farmar's added 16 points and MarShon Brooks and Kent Bazemore finished with 14 each.\nThe Lakers were 7 of 11 on 3-pointers in the fourth quarter and Farmar's 3 from 29 feet with about 15 seconds left pulled Los Angeles to 106-103. However, Lee's two free throws closed the scoring.\nMemphis still led 102-89 with 2:22 left, but a 3-pointer by Johnson, another by Bazemore and two by Farmar made things uncomfortable for the Grizzlies.\nMemphis guard Mike Conley said he couldn't believe Farmar connected on the first long-range shot, then he moved out deeper for the one that brought the Lakers closer.\n\"They have a lot of firepower,\" Conley said. \"If they start missing shots, they can get down 10 or 15 points, but once they start making them and getting hot and making 3s, the game can change in an instant.\"\nThe game came on a day when Lakers coach Mike D'Antoni and Pau Gasol were addressing Gasol's postgame criticism regarding the team's style of play after Tuesday's loss at Indiana. Both said the comments were part of the frustration associated with the Lakers losing. Los Angeles has dropped three straight and seven of eight.\n\"I thought there was better energy and better karma,\" D'Antoni said. \"There was a much better feeling among themselves. I thought they battled and their defense was good in the second half.\"\nFarmar said the Lakers have to play through Gasol, noting not only is he the best player on the team, but a willing passer who gets others involved. Farmar said that helped loosen up the Grizzlies' defense to provide 3-point opportunities down the stretch.\n\"If you give him a lot of space to work, he's really talented,\" Farmar said of Gasol. \"Guys have to help, and once they help, we've got guys who can knock down shots instead of just scrambling around trying to manufacture them.\"\nThe Grizzlies dominated the first half, shooting 57 percent, including 4 of 9 from outside the arc for a 65-46 lead at the break.\nThe Grizzlies came out sloppy in the second half, helping the Lakers pull to 76-64 on Pau Gasol's jumper. Consecutive 3-pointers from Brooks and Meeks helped pull Los Angeles to 82-73 at the end of the third.\nRyan Kelly's 3-pointer to open the fourth brought Los Angeles within six.\nMemphis took the lead back to double digits with a 9-2 push, before the Lakers used 3-point shooting to make it interesting down the stretch.\n\"We want to have a chance to win every night,\" Farmar said. \"It doesn't make sense to go out there and lose by 20, guys just going for their numbers and stuff. Let's just play good basketball. Let's play through our best player (Gasol) and figure it out from there.\n\"We can be a solid team. We can compete every night to win. We may not get it like (Wednesday), but we're right there at the end of the game with a chance.\"\nGame notes\nMemphis reserve G Mike Miller had six points, ending his string of three games off the bench with at least 10 points. ... The Lakers bench, second in league in scoring at 41 points a game, scored 35 but Memphis' reserves had 49. ... Lakers C Chris Kaman did not dress because of a sore back. ... Memphis is 52-7 over the past two seasons when it reaches 100 points.",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.018458",
  "pipeline_version": "v1"
}