{
  "game_id": "0021401197",
  "espn_id": "400579489",
  "date": "Apr 12, 2015",
  "matchup": "OKC @ IND",
  "headline": "Westbrook scores 54, but Pacers hold off Thunder 116-104",
  "cleaned_body": "INDIANAPOLIS -- Russell Westbrook did everything he could Sunday night to give Oklahoma City's fading playoff hopes a boost.\nHis temper may wind up costing the Thunder any chance of making it.\nThe All-Star Game MVP scored a career-high 54 points and nearly pulled off his 12th triple-double of the season, but Indiana closed the game on a 10-1 run to hold on for a 116-104 victory.\nNot only did the Thunder fail to take advantage of New Orleans' 121-114 loss in Houston to move into the No. 8 spot in the West, but now they may have to play the second half of a back-to-back on Monday night without their top scorer after he picked up his 16th technical foul of the season. NBA rules require a player to sit out one game at that point, though Thunder coach Scott Brooks sounded hopeful Westbrook will play.\n\"I'm pretty confident this one will be rescinded,\" Brooks said. \"That's not my decision, but I feel confident about it.\"\nIt might be a last-ditch hope for the Thunder (43-37), who have lost five of their last six and are already playing without last year's MVP, Kevin Durant, and forward Serge Ibaka. Both will miss the rest of the regular season with injuries.\nWithout them in the lineup, Westbrook has been brilliant -- and he was again Sunday night.\nHe opened the game with 22 points and four assists in the first quarter and finished it with a 20-point scoring flurry in the fourth when he twice cut the deficit to three points in the final 3 1/2 minutes.\nBut with 5:57 left, Westbrook was called for his third foul, then argued about the call. A moment later, he was whistled for a critical technical foul.\nC.J. Miles made the free throw, George Hill completed a three-point play to push a 93-88 lead to 97-88 and it could force the NBA's scoring leader to sit out Monday night against Portland. He's already had one technical rescinded this season.\n\"Every night I go out and compete harder than anybody else in this league,\" Westbrook said when asked if he took too many shots by going 21 of 43 from the field. \"As long as my teammates don't have a problem with it, I'm good with it.\"\nBut somehow the Pacers withstood Westbrook's repeated challenges.\nMiles matched his season high with 30 points to lead Indiana (36-43) to its fifth straight win and into a tie for the eighth and final playoff spot in the East. Brooklyn owns the tiebreaker after going 2-1 against the Pacers this season.\nHey, at least, they still have a chance to make it with two games left.\n\"That's not fun, knowing no matter how good we're playing, we're still relying on somebody else,\" Miles said after going 6 of 8 from 3-point range. \"But the big thing is to take care of our business and give ourselves a chance.\"\nIndiana never trailed in the second half, but Westbrook keep them close most of the game.\nHe tied the score at 88 on a breakaway dunk with 7:55 to go. And after the Pacers scored 12 straight points, Westbrook got them within 102-99 on a layup with 3:13 to go. Westbrook's 3 with 1:19 left made it 106-103, but the Pacers allowed only one point the rest of the way.\n\"These guys have really stayed in the fight, had a great attitude and a great perspective to grind through the tough spots,\" Pacers coach Frank Vogel said. \"You get in the playoffs, you've got a chance to go somewhere.\"\n---\nTIP-INS\nThunder: If Oklahoma City misses the playoffs for the first time in six years, it may be because of free throw shooting. After going 16 of 26, 18 of 26 and 15 of 28 in its previous three games, the Thunder were a dismal 11 of 28 on Sunday. Westbrook's teammates were just 4 of 17 from the line.\nPacers: Indiana got the win it needed against a team it has struggled mightily against in recent years. The Pacers beat Oklahoma City for only the second time in their last six meetings, a stretch that included a 105-92 loss on the road in February.\nBY GEORGE\nThe Pacers are 4-0 since Paul George returned last weekend. On Sunday, he played 14 minutes was 3 of 9 from the field including a banked 3 at the end of the third quarter. He finished with eight points and six rebounds.\nUP NEXT\nThunder: Host Portland on Monday.\nPacers: Host Washington on Tuesday.",
  "tags_rule": [
    "TripleDouble",
    "PhysicalGame",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.376407",
  "pipeline_version": "v1"
}