{
  "game_id": "0022100041",
  "espn_id": "401359865",
  "date": "Oct 25, 2021",
  "matchup": "CHA vs. BOS",
  "headline": "Tatum scores 41 points as Celtics beat Hornets 140-129 in OT",
  "cleaned_body": "CHARLOTTE, N.C. -- — Jayson Tatum scored a season-high 41 points, Jaylen Brown added 30, including an emphatic dunk in overtime, and the Boston Celtics beat Charlotte 140-129 on Monday night, handing the Hornets their first loss of the season.\n\nDennis Schroder had nine of his 23 points in overtime, and Robert Williams added 12 points and 16 rebounds in a game that featured 28 lead changes.\n\n“It just showed that we have some fight in us, some toughness,” Tatum said of the Celtics, who battled back from 12 points down in the fourth quarter. “Whatever was going our way, wasn't going our way, we had to figure it out.\"\n\nMiles Bridges had 25 points and 10 rebounds and LaMelo Ball added 25 points on seven 3-pointers for the Hornets before fouling out in overtime. Kelly Oubre added 19 points for Charlotte (3-1), which was denied its first 4-0 start in franchise history.\n\nBoth teams had a chance to win the game at the end of regulation but had difficulty inbounding the ball resulting in neither team getting a shot off in the game's final 15 seconds.\n\nCharlotte fell behind by four in overtime before Ball canned a long 3 to give the Hornets with 3:25 left and then knocked down two free throws to push the lead to 3.\n\nBut it was all Celtics from there.\n\nSchroder and Brown made back-to-back 3s and Brown added a powerful one-handed dunk over the athletic Bridges after receiving a pass on a fast break from Tatum.\n\nBrown said he had to make up for a missed breakaway dunk in overtime against the New York Knicks last week that proved to be a turning point in the loss. He said he'd taken some teasing from teammates and wasn't about to let it happen again.\n\n“Miles is obviously one of the better athletes in the league so I knew if I tried to lay it up he was going to send it back to Boston,” Brown said. “So I went up with bad intentions.\"\n\nTatum called it a “big time” dunk, and it appeared to suck the life out of the Hornets even though it was still a 5-point game with 1:21 left.\n\nSchroder went 4 of 4 from the foul line down the stretch to help seal the win.\n\nBoth teams were playing on the second night of a back-to-back, and Hornets coach James Borrego felt his team was “gassed out” down the stretch.\n\n“They are tough, physical and they do this to most teams in the half court,” Borrego said of the Celtics. “They are long, they are physical, they switch out. We will find ways to get better as we go. We are trying to do the right thing and this is another process in learning and will help us down the road.”\n\nThe Celtics erased a 12-point fourth quarter lead as Brown started to heat up.\n\nBoston would battle back to cut the lead to one with 2:03 remaining as Tatum drove the lane and Mason Plumlee was called for goaltending. Boston purposely fouled Plumlee at the other end of the floor on the next possession the Hornets new center missed both free throws badly. Boston took the lead on a dunk by Williams with 1:47 left.\n\nBut Ball would answer with a 26-footer at the other end to give the Hornets back the lead. Tatum tied with two free throws with 1:11 left, setting up a frantic, although scoreless final minute of regulation.\n\n“We don’t love these overtime games, but it builds toughness mentally as well as getting in shape and playing through these,” said Celtics coach Ime Udoka. “But we just kept chipping away. We jumped it up a little bit and did a few different things trapping wise and sped them up and the guys had to obviously make shots on the other end.”\n\nTIP-INS\n\nCeltics: Attempted 50 3-pointers, making 19. ... Boston's Al Horford sat out with a left adductor strain. ... Jabari Parker had 13 points, all in the first half.\n\nHornets: Charlotte played without Terry Rozier for the third time in four games because of a sprained ankle and forward P.J. Washington (knee) was also out. Borrego said Washington is day to day.\n\nPLAYING THROUGH MIGRAINE\n\nMarcus Smart said afterward that nearly didn't play at all because he woke up with a migraine. He received fluids before the game and ate several bananas and told coaches he was going to try to give it a go.\n\n“I decided to go,” Smart said. “I decided to fight through it.”\n\nThe Celtics are glad he did, as he turned in one of the game's biggest plays by fighting through a screen and denying a side inbounds pass to Ball near halfcourt with 14 seconds left in regulation, forcing a Charlotte turnover.\n\nBALL IMPRESSES\n\nBall was impressive all night.\n\nWith the game tied at 75, he got Smart off balanced with a drive to the top of the key and nifty step-back 3, saluting as it went through the net. A few seconds later Ball corralled a defensive rebound and released a full-court baseball pass to Gordon Hayward for a layup.\n\nUP NEXT\n\nCeltics: Host Washington on Wednesday night.\n\nHornets: Visit Orlando on Wednesday night.\n\n------",
  "tags_rule": [
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.303174",
  "pipeline_version": "v1"
}