{
  "game_id": "0021400015",
  "espn_id": "400578307",
  "date": "Oct 29, 2014",
  "matchup": "OKC @ POR",
  "headline": "Blazers rally in fourth quarter to beat short-handed Thunder",
  "cleaned_body": "PORTLAND, Ore. -- LaMarcus Aldridge's first basket of this season was a bit of a surprise, even to him.\nAldridge hit a 3-pointer and Portland's All-Star forward went on to score 27 points in the Trail Blazers' 106-89 season-opening victory over the injury-depleted Oklahoma City Thunder on Wednesday night.\nAldridge, who has been working on his long-range shot, said Russell Westbrook's defense on the play gave him no choice but to shoot.\n\"I don't think anyone was thinking my first shot would be a long 3, so it was pretty cool,\" he said.\nThe Thunder only suited up nine players. Most notably they were without reigning NBA MVP Kevin Durant, who had surgery for a fractured bone in his right foot this month and will likely be sidelined until December.\nWestbrook picked up the slack, with 38 points, including 26 in the first half.\nAfter trailing for much of the game, Portland pulled to an 89-80 lead with 7 minutes left on Damian Lillard's 3-pointer. Nicolas Batum passed to Aldridge for the alley-oop dunk to put the Blazers up 93-83 and the Thunder could not catch up.\n\"It felt great,\" Aldridge said. \"I've been waiting for this game for a while.\"\nPortland outscored the Thunder 31-12 in the fourth quarter. All five Blazers starters were in double figures.\nWith 14 straight home-opening victories, the Blazers matched the Boston Celtics' record set from 1979-92.\nAlso sitting out the opener for the Thunder were guard Reggie Jackson (right ankle), forward Grant Jerrett (ankle surgery), guard Jeremy Lamb (lower back sprain), forward Mitch McGary (left foot fracture) and guard Anthony Morrow (left MCL sprain).\nDurant averaged 32 points last season when the Thunder went to the Western Conference finals, carrying the team when Westbrook was nursing a knee injury. The roles are reversed to start this season.\n\"I thought we played hard. That's the only thing I can ask from the guys. Just compete, play hard and play for each other. They did that tonight but we made too many mistakes at the end of the game,\" Thunder coach Scott Brooks said.\nThe Blazers opened with the exact same roster as last season, when they won 54 games and advanced to the second round of the playoffs.\nDespite being short-handed, Oklahoma City took a 13-5 lead on Westbrook's seven-point outburst.\nThe Blazers pulled in front 35-34 in the second quarter on a 12-footer from Chris Kaman, picked up by the Blazers as a free agent in the offseason to help backup Robin Lopez.\nWestbrook hit five straight free throws to give the Thunder back the lead, and he dunked to close out the half make it 54-49 for Oklahoma City at the break.\nWestbrook pushed the lead to 71-65 midway through the third quarter with a layup and the free throw. But the Blazers never let the game get away from them and trailed just 77-75 going into the final quarter.\nLillard, who had no points in the first half, hit a 3-pointer that gave Portland an 81-77 lead with 10:35 go.\n\"We put ourselves in position to win the game but we don't take moral victories around here and never will,\" Westbrook said. \"We just gotta find a way to close the game out better.\"\nTIP-INS\nTrail Blazers: The Blazers have a new floor at the Moda Center, thanks to a fan contest last spring that garnered 19,000 entries. The court is lighter within the 3-point arc and the keys are painted solid red. The Blazers' pinwheel is still at center court. ... Portland was without center Meyers Leonard because of an upper respiratory infection.\nThunder: Durant was on the court in his sweats in pregame warmups, his foot in a sturdy gray boot. He changed into a suit and watched the game from courtside. It was the first game against the Blazers he had missed in his career. ... Oklahoma City's schedule has the Thunder traveling 6,300 total miles with two back-to-backs. ... As usual when the Thunder come to town, there were several Seattle SuperSonics jerseys in the crowd.\nBATUM'S D: Batum's defense of Westbrook in the fourth quarter helped boost the Blazers. Westbrook had just two of his points in the final period. \"That's kind of been my job since I got here, to take the best player and to try to stop him,\" said the versatile forward. Batum finished with 16 points, five rebounds and six assists.\nQUOTING: Brooks on Westbrook: \"Russell's our leader. He's our leader on the court until Kevin comes back -- and then we've got two leaders. I have no complaints how Russell played. He's an emotional, competitive basketball player and he's going to lead us that way. I thought he was terrific tonight.\"\nLILLARD'S SLOW START: Lillard finished with 10 points, seven in the fourth quarter alone. He and Wesley Matthews combined to make all five of their 3-point attempts in the period. \"I didn't want to force my rhythm on to the game,\" Lillard said. \"I knew there would come a point where I needed to attack or make a shot or make a play, and that time came.\"\nUP NEXT\nTrail Blazers: At Sacramento Kings on Friday night.\nThunder: At Los Angeles Clippers on Friday night.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.523885",
  "pipeline_version": "v1"
}