{
  "game_id": "0021400265",
  "espn_id": "400578557",
  "date": "Dec 03, 2014",
  "matchup": "DET @ BOS",
  "headline": "Celtics recover in OT, beat Pistons 109-102",
  "cleaned_body": "BOSTON -- The Boston Celtics have struggled to finish off teams this season, blowing a 23-point lead against Atlanta one night before wasting an 11-point, fourth-quarter advantage against Detroit on Wednesday.\nGood thing for them they had overtime to fall back on against the Pistons.\nJeff Green scored 32 points, including a 3-pointer as Boston opened overtime with eight straight points, and the Celtics snapped a five-game losing streak by beating Detroit 109-102.\n\"I'm excited for the guys that they gutted one out when it kind of teeter-tottered toward not going their way,\" said Celtics coach Brad Stevens, whose team led by 11 with just over three minutes left in regulation. \"We needed to respond. I'm not going to overreact, though. We've only done it once.\"\nThe loss was the 10th in a row for Detroit. Greg Monroe scored 15 of his 29 points after the 3:13 mark of the fourth, when the Pistons rallied from an 84-83 deficit.\nBut Detroit never recovered after giving up the first three baskets -- including 3-pointers by Jared Sullinger and Green to open the overtime.\n\"I don't really believe much in momentum,\" Pistons coach Stan Van Gundy said.\nAndre Drummond had 27 points, 14 rebounds, four steals and five blocked shots, including Green's potential game-winner at the end of regulation, for Detroit.\nDetroit led by six points in the second quarter and held their last lead in the third at 55-54.\nBoston opened the fourth quarter with a 10-3 run with Kelly Olynyk scoring seven straight points on a dunk, a 3-pointer and a reverse layup that made it 73-64. He followed that up with a defensive rebound and bounce pass for an assist on Evan Turner's basket that gave the Celtics an 11-point lead with 7:25 to play.\nThat's when Monroe rattled off nine points in a row and, after Green made two free throws, the Pistons' forward added another basket to make it 86-84 with less than a minute to play.\n\"He just made shot after shot after shot,\" Stevens said.\nIt was 88-85 when Caron Butler sank a wide-open 3-pointer from the left wing to tie it. The Celtics had a chance to win in regulation when Green drove and attempted a floater from about six feet that Drummond swatted away.\n\"The dam got hit but didn't break. That's the good thing,\" said Olynyk, who had 20 points and seven rebounds for the Celtics, who had lost six in a row at home and blown double-digit leads on their own floor five times. \"We played in that overtime well, got some stops when we needed to and hit some big shots.\"\nWHAT'S THE POINT\nPistons point guard Brandon Jennings had 12 assists and one point on 0-for-11 shooting. Backup D.J. Augustin was 0-for-6. Even one basket in regulation could have made a difference.\n\"There's a lot of ifs. A lot of ifs,\" Van Gundy said. \"A lot of things that could have happened and didn't.\"\nSHOOTING SLUMPS\nThe teams combined to miss 121 shots, with the Celtics outshooting Detroit 39.8 percent to 36.3 percent. \"Honestly, when you're shooting 36 percent,\" Van Gundy said, \"you don't have a lot of margin for errors to win games.\"\nTIP-INS\nPistons: Josh Smith fouled out with 6:47 to play. He had 12 points and 11 rebounds. ... The Pistons broke 100 for the second time this season. They needed 52 minutes, 40 seconds to do it.\nCeltics: First-round draft pick Marcus Smart returned after missing 10 games with a sprained left ankle. He played five minutes, missed three 3-point attempts and had two assists. ... Rajon Rondo entered the game having made just 9 of his last 30 free throw attempts. He did not go to the line against Detroit.\nUP NEXT\nPistons: Host Philadelphia on Saturday.\nCeltics: Host the Los Angeles Lakers on Friday.",
  "tags_rule": [
    "Streak",
    "FoulTrouble",
    "CoachComment",
    "InjuryReport",
    "ClutchShot"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.247204",
  "pipeline_version": "v1"
}