{
  "game_id": "0021701119",
  "espn_id": "400975865",
  "date": "Mar 28, 2018",
  "matchup": "MEM vs. POR",
  "headline": "MarShon Brooks scores 21 as Grizzlies beat Blazers 108-103",
  "cleaned_body": "MEMPHIS, Tenn. --  With a 10-day contract to make an impression, MarShon Brooks got off to a very nice start.\n\nBrooks scored 14 of his 21 points in the fourth quarter in his first game with Memphis, helping the last-place Grizzlies beat the Portland Trail Blazers 108-103 on Wednesday night.\n\nBrooks made each of his four 3-point attempts in the final period in his first NBA appearance since April 16, 2014, with the Lakers. He signed a 10-day contract with Memphis on Tuesday.\n\n\"You don't really have time to get comfortable on a 10-day. You just don't,\" Brooks said. \"Thank God I made shots. That helps.\"\n\nBrooks, who averaged 36.6 points for the Jiangsu Dragons of the Chinese Basketball Association this year, was 7 for 12 from the field.\n\nDillon Brooks had 18 points for the Grizzlies (21-54), who trailed 93-86 with 7 minutes left. Chandler Parsons finished with 15 in Memphis' second straight win.\n\nCJ McCollum led Portland (46-29) with 42 points, and Wade Baldwin IV added 15 points on 5-for-6 shooting.\n\nThe Trail Blazers went 3 for 8 at the line in the final 7 minutes. A handful of turnovers in the fourth only made matters worse.\n\n\"In the fourth quarter, you have to make free throws,\" Portland coach Terry Stotts said. \"You can't miss free throws, and you have to guard better. You can't give up 32 points in the fourth quarter and have turnovers and missed free throws. Not going to win many games like that.\"\n\nTrail Blazers star Damian Lillard, who had 41 points in Tuesday's win over New Orleans, was not with the team after the birth of his son.\n\nTIP-INS\n\nTrail Blazers: Played their third game in four days. ... Shabazz Napier started his eighth game of the season in place of Lillard. ... Portland had won seven in a row on the road. ... The Blazers have scored at least 100 points in 18 straight games. ... McCollum's 42 points were his second-highest of the season. He scored 50 on Jan. 31 against Chicago.\n\nGrizzlies: Had not won consecutive games since a three-game winning streak from Jan. 15-19. ... Jarell Martin had a career-high 14 rebounds. ... Of Memphis' 21 victories this season, 11 have come against teams currently in playoff spots.\n\nPLAYOFF WATCH\n\nThe Trail Blazers hold a two-game lead over fourth-place Oklahoma City in the Western Conference standings.\n\nDRAFT WATCH\n\nThe Grizzlies moved into a tie with Atlanta for the second-worst record in the NBA. The Hawks lost Wednesday night to Minnesota. Both still have a better record than the Phoenix Suns.\n\nLAST WORD\n\n\"He's a bucket-getter.\" -- Memphis interim coach J.B. Bickerstaff on MarShon Brooks.\n\nUP NEXT\n\nTrail Blazers: Host the Los Angeles Clippers on Friday\n\nGrizzlies: Play the Jazz in Utah on Friday.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.366214",
  "pipeline_version": "v1"
}