{
  "game_id": "0021700948",
  "espn_id": "400975694",
  "date": "Mar 04, 2018",
  "matchup": "BKN @ LAC",
  "headline": "Clippers rally to hand Nets 8th straight road loss, 123-120",
  "cleaned_body": "LOS ANGELES --  The Clippers were reeling, on the verge of losing to a Brooklyn team that hadn't won a road game since Jan. 21. The Nets dropped 3-pointers from all over the floor, and after leading by as many as 15, Los Angeles found itself down by eight with just over three minutes left.\n\n\"It just seemed like we had a lot of moments where we could have just given up in that game,\" Clippers guard Austin Rivers said.\n\nInstead, Rivers helped bring it home. He scored 14 of his 27 points in the fourth quarter -- including the go-ahead 3-pointer with 33.5 seconds remaining -- to lead the Clippers to a 123-120 victory Sunday night.\n\n\"The Nets made shot after shot and they played extremely hard,\" Clippers coach Doc Rivers said. \"But it felt like at the end of the game our guys said, `We need this game.\"\n\nLou Williams got the last of his 21 points with a 15-foot jumper with 8.9 seconds left, and rookie Sindarius Thornwell blocked Joe Harris' 3-point attempt before the buzzer to seal the victory.\n\nIt was the ninth consecutive road loss for the Nets, and 11th in their last 12 overall. Brooklyn got 27 points from reserve Caris LeVert, who hit 5 of 7 3-pointers, and DeMarre Carroll had 20 points.\n\nThe Nets connected on 8 of 15 3-pointers in the fourth quarter, 19 of 45 3-pointers on the night and rallied to lead 118-110 with 3:11 to play on LeVert's 3-pointer.\n\n\"Tough loss,\" Nets coach Kerry Atkinson said. \"We climbed back, showed a lot of grit, had an opportunity. But credit to the Clippers. (Austin) Rivers makes an unbelievable shot. We had some opportunities and they didn't go down.\n\n\"The shot selection and the inability to get key stops. That's why you lose an eight-point lead. It's not just one or the other.\"\n\nTIP-INS\n\nNets: C Jahlil Okafor was cleared to play after missing five games with the flu, but did not enter the game. ... G D'Angelo Russell made his second trip back to Staples Center this season since his trade from the Lakers. \"I've been impressed with how he's bought into what we're trying to do from a basketball standpoint, from a performance standpoint,\" Atkinson said. \"He's gotten stronger. He has to cut down on his turnovers. His shot selection has to be cleaned up. We're thrilled with how he's played for us.\"\n\nClippers: In his 13th season, Williams is averaging career highs in points (23.2), assists (5.4), 3-point percentage (.369) and free-throw percentage. Said Doc Rivers: \"He was probably underrated by all of us. Lou's a better player than I thought. I have always liked Lou as a scorer, but I didn't know he was lethal. He's as good of a scorer as maybe I've coached.\" ... Los Angeles signed G Sean Kilpatrick to a 10-day contract.\n\nWHERE'S THE FOUL\n\nDown by three with 8.9 seconds to play, the Nets inbounded after a timeout and the Clippers had explicit instructions -- foul whoever gets the ball.\n\nOnly it never happened.\n\n\"I almost died when we didn't foul,\" Doc Rivers said.\n\nThe ball ultimately ended up with Harris, but his tying 3-pointer was cleanly blocked by Thornwell.\n\n\"You just have to be prepared for the moment,\" Thornwell said. \"I guess it was just defensive instinct.\"\n\nHarris got the ball back but was short on a desperation 3 at the buzzer.\n\nUP NEXT\n\nNets: Play the fourth of five consecutive road games Tuesday at Golden State.\n\nClippers: Remain at home Tuesday to play New Orleans.\n\n---\n\nMore NBA basketball: https://apnews.com/tags/NBAbasketball",
  "tags_rule": [
    "ReturnFromInjury",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "ReturnBoost",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.533308",
  "pipeline_version": "v1"
}