{
  "game_id": "0021700668",
  "espn_id": "400975414",
  "date": "Jan 19, 2018",
  "matchup": "MIA @ BKN",
  "headline": "Carroll scores 26, leads Nets past Heat, 101-95",
  "cleaned_body": "NEW YORK --  Down by 16 points early in the second half against the Heat, the Nets dug in on defense.\n\nDeMarre Carroll tied a career-high with 26 points, Spencer Dinwiddie had 15 and the Brooklyn beat Miami 101-95 on Friday night.\n\nBrooklyn snapped a five-game losing skid at Barclays Center and a seven-game home losing streak to the Heat. The Nets also improved to 11-1 when holding opponents under 100 points this season.\n\nThe Heat led 64-48 with 8:53 left in the third quarter but scored just five points the rest of the period as Brooklyn closed to within two.\n\n\"What were we up by, like 16 or so?\" Miami's Hassan Whiteside said. \"I think that was really the turning point of the game because it should've been over, you know, you up 16 against a team in the third quarter. Shouldn't be no way they come back from that. We've got to do a better job of playing with a lead and it shouldn't have even come down to the fourth quarter.\"\n\nWhiteside had 21 points and 13 rebounds, and Goran Dragic scored 17 points for the Heat.\n\nCaris LeVert and Joe Harris each added 12 points for the Nets. D'Angelo Russell played 14 minutes and went 0-for-5 from the field for Brooklyn in his first action after missing 32 games following left knee surgery.\n\nLeVert made an acrobatic layup to give the Nets a 95-91 lead with 57.8 seconds remaining and then made a step-back jumper to ice the game at 97-91.\n\n\"I thought Caris and Quincy (Acy) came in the game and changed the energy,\" Nets coach Kenny Atkinson said.\n\nCarroll hit a 3-pointer from the wing to give Brooklyn an 89-86 lead with 4:19 left.\n\n\"There were so many big plays,\" Atkinson said. \"At the end of the day, this is a player's game. DeMarre hits a big three, Caris and Spencer have two big-time drives in the pick-and-roll and we made plays, but more importantly we got stops.\"\n\nBrooklyn took a 79-77 lead with 8:57 remaining on a corner 3-pointer from LeVert. It was Brooklyn's first lead since the 5:41 mark of the first quarter.\n\nWhiteside led Miami with 15 points and eight rebounds at the half as the Heat took a 53-43 lead into the locker room. Carroll led Brooklyn with 11 points at the half.\n\nTIP-INS\n\nHeat: Coach Erik Spoelstra praised Dragic before the game. \"He means everything to our team. In our eyes, he's having an All-Star season. There's a reason why we are where we are in the East, and he's a big part of it.\" ... Isaiah Whitehead (G-League assignment) and Jeremy Lin (ruptured patella tendon) were out for Brooklyn.\n\nNets: Atkinson said Russell will play in short stints as he works his way back from left knee surgery. ... Tyler Johnson (left ankle), Dion Waiters (left ankle), Okaro White (left foot) and Rodney McGruder (left tibia) were out for Miami.\n\nUP NEXT\n\nHeat: Visit Charlotte on Saturday in the fourth of a five-game trip.\n\nNets: Begin a five-game trip at Detroit on Sunday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.397672",
  "pipeline_version": "v1"
}