{
  "game_id": "0021700227",
  "espn_id": "400974978",
  "date": "Nov 17, 2017",
  "matchup": "LAL vs. PHX",
  "headline": "Devin Booker's 33 points power Suns past Lakers, 122-113",
  "cleaned_body": "LOS ANGELES --  The Phoenix Suns weren't about to go down for the third time without a fight against the Los Angeles Lakers.\n\nDevin Booker hit six 3-pointers while scoring 33 points, and the Suns beat the Lakers for the first time in three meetings this season, 122-113 on Friday night.\n\nTyler Ulis scored 16 points for the Suns, and the diminutive point guard also got into an aggressive shoving match with Lakers guard Kentavious Caldwell-Pope near the Phoenix bench with 3:17 to play. Ulis, Caldwell-Pope and Suns rookie Josh Jackson were given technical fouls following the fracas.\n\nAccording to Ulis, the Suns' strong effort was all about payback for two previous losses to the Lakers in the past month.\n\n\"We understand that those were two games that we definitely should have had, definitely should have won,\" Ulis said. \"You know we wanted to come out tonight and prove that we should have won both of those games and win the next matchup as well.\"\n\nThese two young teams have had extracurricular altercations in each of their meetings this season. After this one, the Suns calmed down and pushed on to avenge their home loss to the Lakers on Monday.\n\n\"We've played three times in such a short amount of time, and it's like the same idea behind a playoff series,\" Lakers coach Luke Walton said. \"By Game 3, 4, 5, it starts to get chippy.\"\n\nJackson eagerly rushed in to confront Caldwell-Pope, while Lakers rookie Lonzo Ball created yet another immediate viral online sensation when he walked away from the drama.\n\n\"It's the NBA. People ain't really going to fight,\" Ball said. \"I ain't trying to get no tech.\"\n\nAlex Len had 17 points and 18 rebounds for the Suns, who won for just the second time in eight games. Phoenix bounced back impressively after giving up 142 points in a home loss to Houston one night earlier.\n\n\"After dropping the first two games, we knew we were going in with a must-win mentality, that we want to punch first and win,\" Booker said. \"I think we did that.\"\n\nRookie forward Kyle Kuzma scored 28 of his career-high 30 points in the second half for the Lakers, who committed 20 turnovers while losing for the fifth time in six games.\n\nBrook Lopez had 19 points and 10 rebounds for Los Angeles. Ball had a quiet six points, six assists and six rebounds in 38 minutes.\n\n\"Just a lack of focus,\" Ball said of the Lakers' effort. \"We probably came in complacent. We beat them twice, so we thought it was going to be easier, I guess.\"\n\nTIP-INS\n\nSuns: Big man Dragan Bender celebrated his 20th birthday with 10 points and five rebounds. ... Greg Monroe had six points and one rebound in his second appearance with the Suns. ... Big man Tyson Chandler missed his second straight game with a respiratory illness.\n\nLakers: Larry Nance Jr. has been cleared to return to practice earlier than expected. The forward broke his left hand Nov. 2 and was expected to be sidelined four to six weeks. ... Kuzma's sixth 20-point game is the most among NBA rookies.\n\nBIG GAME BOOK\n\nBooker scored 36 points in the Suns' home loss to the Lakers on Monday, and he kept up his history of torrid performances against LA. Perhaps motivated by a verbal altercation near the Lakers' bench in Phoenix four days earlier, Booker hit all six of his 3-pointers in the first half at Staples Center. \"With Devin playing the way he is, getting another 30, you have to pay attention to him, and it creates space for everyone else,\" Phoenix interim coach Jay Triano said. \"Seems like some of our guys really stepped up and made tough shots when they had to, or got to the free throw line.\"\n\nKUUUUZ\n\nKuzma, who also had 10 rebounds, set a new career high in points for the second straight game with a dynamite second half. The rookie from the University of Utah became the first Lakers rookie to get 30 points and 10 rebounds in a game since Magic Johnson did it in 1980.\n\nSTRONGER START\n\nOne night after giving up 90 points in the first half to Houston, the Suns yielded a measly 53 first-half points to the Lakers while jumping out to a 12-point lead. Booker nailed two 3-pointers in the final 14 seconds, with Ball's first field goal on a layup sandwiched between them.\n\nUP NEXT\n\nSuns: Host the Chicago Bulls on Sunday.\n\nLakers: Host the Denver Nuggets on Sunday.\n\n---\n\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "tags_rule": [
    "PhysicalGame",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.499706",
  "pipeline_version": "v1"
}