{
  "game_id": "0021200157",
  "espn_id": "400277877",
  "date": "Nov 21, 2012",
  "matchup": "CHA vs. TOR",
  "headline": "Ramon Sessions helps surging Bobcats hold off Raptors",
  "cleaned_body": "CHARLOTTE, N.C. -- The Charlotte Bobcats are off to a fast start so far this season.\n\nLess than three weeks into the season, the surprising Bobcats are a game away from matching last season's win total following a 98-97 victory Wednesday night over the Toronto Raptors.\n\nRamon Sessions hit a 16-footer with 28 seconds left, and the Bobcats made a late defensive stand to win for the fifth time in six games to run their record to 6-4 matching the franchise's best start.\n\nThe Bobcats were an NBA-worst 7-59 last season.\n\nTo put this season's impressive start in perspective, it took the Bobcats 40 games last season before winning their sixth game.\n\nThis season the Bobcats continue to find ways to win close games, running their record to 5-0 in games decided by four points or fewer.\n\nAs they've done all season, the Bobcats did it with defense.\n\nToronto had four shots to win it in their final possession, but two shots were blocked -- one by Jeffery Taylor and the other by Bismack Biyombo -- and Andrea Bargnani's baseline jumper fell short as time expired.\n\nBobcats coach Mike Dunlap called the defensive stand \"two-thirds willpower and one-third technique.\"\n\n\"We were trying to switch everything, but at the end, coach said just stay with your man,\" Biyombo said. \"We had to make quick decisions, and I think we made pretty quick decisions and we did a pretty good job as a team. It was just big time.\"\n\nKemba Walker had 19 points and seven assists for the Bobcats, while Sessions and Michael Kidd-Gilchrist each had 14 points. Walker and Sessions have both scored in double digits in all 10 games.\n\nBargnani had 25 points and Kyle Lowry added 21 for the Raptors. Jonas Valanciunas added 16 points and 10 rebounds.\n\nThe Bobcats won despite shooting 42 percent from the field and 15 percent from the 3-point range.\n\n\"We won ugly tonight, but it doesn't really matter,\" Dunlap said.\n\nThe Bobcats got some quality minutes from Biyombo, who's not typically known for his offensive prowess. The second-year forward had six of his 11 points in the third quarter, including a powerful dunk over Bargnani after battling for control of an offensive rebound.\n\nAlong with his key block on Toronto's final possession, he was 5 of 6 from the field.\n\n\"He was excellent,\" Dunlap said. \"He was all professional tonight. The rebounding, plugging the gaps. He did a lot of the dirty work tonight. I thought as a team we were a little flat, but he wasn't. In many ways he ignited us.\"\n\nThe Bobcats led by as many as 10 early in the fourth quarter before Jose Calderon hit a 3-pointer, DeMar DeRozan scored on a layup and jumper and Bargnani hit a jumper from the top of the key to tie the game at 88 with 4:50 to play. Bargnani then knocked down a 3-pointer to give Toronto a 3-point lead with 1:52 to play.\n\nBut the Bobcats kept battling with Walker driving the left side of the line and scoring and drawing a sixth foul on Valanciunas. Walker finished the 3-point play to tie the game with game with 55 seconds left.\n\nDeRozan hit 1-of-2 free throws at the other end before Sessions got a foul line jumper to drop with 28.3 seconds left.\n\nAfter two misses, the Raptors set up an inbounds play for Lowry with 6.4 seconds left and his 12-footer was rejected by Taylor. Valanciunas had another shot as time expired but couldn't knock it down, and the Bobcats held after a furious defensive stand.\n\n\"These guys played their heart out and they are hurt right now,\" Raptors coach Dwane Casey said. \"We have to create some breaks for ourselves. I thought we shot ourselves in the foot with some mental mistakes that we made as far as turnovers are concerned.\"\n\nLowry had 16 points at the break after hitting all three 3-point attempts for the Raptors.\n\n\"It's very frustrating. We're working so hard,\" Lowry said. \"But we've got to get better. Our 3-9 record doesn't show how good of a team we are. We're better than 3-9.\"\n\nGame notes The Bobcats had a streak of 29 straight free throws snapped when Biyombo missed in the second quarter. ... Bargnani's 25 points were his season high. ... Raptors guard Terrence Ross gave his team a boost off the bench with 11 points.",
  "tags_rule": [
    "EarlyRun",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.290903",
  "pipeline_version": "v1"
}