{
  "game_id": "0021400899",
  "espn_id": "400579191",
  "date": "Mar 04, 2015",
  "matchup": "CHA @ BKN",
  "headline": "Hornets rout Nets 115-91 in key game in East race",
  "cleaned_body": "NEW YORK -- The Charlotte Hornets didn't try to hide it: This was an important game.\nThey couldn't have started it much better.\nAl Jefferson and Gerald Henderson each scored 19 points, Marvin Williams had 18 and the Hornets routed Brooklyn 115-91 on Wednesday night to move into sole possession of eighth place in the Eastern Conference.\nMo Williams added 14 points and a season-high 14 assists for the Hornets, who rode a blistering start to their third straight win, breaking a tie with the Nets for the final playoff spot in the East.\n\"I felt like the team that wanted it more was going to win the game,\" Mo Williams said. \"It's just, the teams are so much evenly matched and I felt like for the most part we came out and we punched them in the mouth early and we took their punch back, and we regrouped and came out in the third quarter and kind of punched them again and they just didn't recover after that.\"\nMichael Kidd-Gilchrist finished with 10 points, his career-best seventh straight game in double figures, and 13 rebounds as Charlotte battered Brooklyn on the boards and led by as many as 32 points.\nDeron Williams scored 12 points for the Nets, who defeated West contenders Dallas and Golden State in their previous two games.\nBut they had nothing in a game that would've given them the season-series tiebreaker against the Hornets, who tied the series at 1 with a game remaining.\n\"They shot lights out in that first quarter, put our backs against the wall and really didn't let up,\" Deron Williams said.\nMindful of the Nets' strong first-quarter play -- they came in shooting an NBA-best 50.1 percent in the period -- Charlotte coach Steve Clifford changed his starting lineup, even though the Hornets had all five starters in double figures in three straight games, something they hadn't done in six years.\nMarvin Williams replaced Cody Zeller to match up with Brooklyn's smaller lineup, and he had 10 points and made all three shots in the first quarter to help trigger Charlotte's sizzling start.\nThe Hornets ran off 11 in a row for a 13-2 lead, then hit the Nets later in the period with a 13-0 run that made it 29-6. By the time Jefferson powerfully dunked while knocking Deron Williams backward, they were 13 of 15 from the field.\nIt was 35-15 after one, and when the Nets got within 12 early in the third, Charlotte responded with 10 straight points for a 68-46 lead.\n\"Brooklyn's been the best team in the NBA in the first quarter. That's how I think they've been winning a lot of games, they've been playing from ahead,\" Jefferson said. \"We knew starting the first quarter was going to be a big key for us, and we started off hitting a lot of open shots. Our first and third quarter was great.\"\nClifford said he thought the Nets had perhaps the most weapons of any of the six teams fighting for the East's final two playoff spots, but most of them were misfiring Wednesday. Joe Johnson was 1 of 6 and fellow starting forward Alan Anderson went 1 of 5 as they were outscored 28-4 by Marvin Williams and Kidd-Gilchrist.\n---\nTIP-INS\nHornets: Associate head coach Patrick Ewing said he will attend the funeral Friday for former Knicks teammate Anthony Mason, who died Saturday at 48.\nNets: Brooklyn had won 10 in a row at home in March. The Nets were 9-0 at Barclays Center in March 2014. ... The Nets had a six-game home winning streak against Charlotte that dated to their New Jersey days.\nKEMBA'S CLOSE\nKemba Walker was cleared to resume all basketball activities after visiting the doctor who performed surgery on his left knee Jan. 28, moving him closer to a return. Clifford said the Hornets will practice again Saturday and Walker's return to action will depend on how the knee responds to an increased workload. Walker, who leads the Hornets with 18.8 points per game, hopes to play next week during a three-game homestand.\nUP NEXT\nHornets: Host Toronto on Friday.\nNets: Host Phoenix on Friday.",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "HotShooting"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.854781",
  "pipeline_version": "v1"
}