{
  "game_id": "0021300136",
  "espn_id": "400489009",
  "date": "Nov 16, 2013",
  "matchup": "CHA vs. MIA",
  "headline": "LeBron James goes for 30 as Heat continue dominance over Bobcats",
  "cleaned_body": "CHARLOTTE, N.C. -- Charlotte Bobcats coach Steve Clifford said after all of these years in the NBA he's still amazed at some of the things LeBron James does.\n\"You know, he'd be fun to watch if you weren't coaching the other team,\" Clifford said.\nJames scored 30 points to help Miami beat Charlotte 97-81 Saturday night for the Heat's 13th straight victory against the Bobcats.\n\nWith Mario Chalmers suspended, Chris Bosh limited due to foul trouble, Ray Allen out with the flu and Dwyane Wade a non-factor, James came up big for the Heat. The four-time MVP was 13 of 18 from the field and had seven assists in his eighth 20-point game this season.\n\"More than anything, it was his energy,\" Heat coach Erik Spoelstra said of James. \"When you see him attacking off the glass and pushing coast to coast, you know he feels good with his body and you know it sets a great tone for our team. He's playing with great energy on both ends of the court.\"\nMiami (7-3) relied on its bench to close the game out.\nOf Miami's 29 points in the fourth quarter, 23 came from reserves Michael Beasley, Chris Andersen, Rashard Lewis and Roger Mason Jr.\nBeasley finished with 15 points and Andersen had 10 for the Heat, winners of six of their last seven overall.\nBosh said it was an odd feeling having so many starters out of the game in the fourth quarter with the outcome still in doubt.\n\"I don't know when the last time that has happened,\" Bosh said. \"But (the reserves) kept the lead at a nice distance. We were rooting for them and encouraging them because we need everybody -- one through 15 -- to not only raise their play but sustain it.\"\nJames said he had intentions of returning to the game late in the fourth quarter but didn't need to after the Heat's reserves began to pull away with the lead.\n\"Once they got going I just said let them keep going,\" James said. \"They had a great rhythm.\"\nKemba Walker had 22 points to lead the Bobcats, who shot 35 percent from the field. Jeff Taylor scored 14 points and has now finished in double digits in six of the last seven games.\nThe Bobcats (5-5) had won two straight coming in, and stayed within 10 points for a good portion of the fourth quarter but could never grab the lead.\n\"We've got to keep on pushing,\" Walker said. \"I think we've been playing some great basketball right now. It's still early in the season. All we have to do is keep looking forward and keep trying to get better.\"\nJames had 20 points in the first half on 8-of-11 shooting and Miami led by as many as 16. Only one of James' first-half field goals came from outside of 10 feet as he did his damage driving and attacking the basket.\nIt's a good thing for Miami that James was on his game early because the other parts of the big three struggled. Wade only played 23 minutes after his knee tightened up, while Bosh had three fouls and no points in eight first-half minutes. Bosh would later pick up his fifth foul with 4:27 left in the third quarter and drew a technical foul after he'd taken a seat on the bench.\nA few seconds later, Spoelstra began chirping at the officials and he was slapped with a technical, too.\nBut the Heat survived, in part because of their defense.\nJames said that's a good sign.\n\"At the end of the day if we don't defend we aren't going to be able to compete where we want to compete,\" James said. \"It was nice to see us play with a lot of energy tonight.\"\nChalmers was serving a one-game suspension after being ejected from the Heat's 110-104 victory over Dallas on Friday night. Chalmers was called for flagrant-2 foul with 5:01 remaining in the fourth quarter after referees ruled he intentionally swung an elbow at Dirk Nowitzki's head as he tried to fight through screen. Before Saturday night's game Spoelstra said he \"disagreed\" with the NBA's decision to suspend Chalmers.\n\"We don't have to agree with it,\" Spoelstra said. \"What we can do is agree to disagree.\"\nGame notes\nClifford picked up his first technical foul as Bobcats coach in the second quarter. ... James excited the crowd when blocked Walker's breakaway layup into the fifth row behind the basket. ... Shane Battier drew his eighth charge of the season. ... Carolina Panthers defensive end Charles Johnson attended the game.",
  "tags_rule": [
    "CoachComment",
    "PhysicalGame",
    "FoulTrouble"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.267756",
  "pipeline_version": "v1"
}