{
  "game_id": "0021401007",
  "espn_id": "400579299",
  "date": "Mar 18, 2015",
  "matchup": "POR @ MIA",
  "headline": "Wade scores 32, Heat rally to beat Blazers 108-104",
  "cleaned_body": "MIAMI -- Dwyane Wade grabbed the last rebound along the baseline and threw the ball skyward as time expired, a scene eerily reminiscent of the final play of his first NBA Finals.\nNo, this isn't 2006.\nBut Wade is unquestionably turning back the clock.\nWade scored 15 of his 32 points in the fourth quarter, including a jumper with 13.6 seconds left to break a tie and help the Miami Heat beat the Portland Trail Blazers 108-104 on Wednesday night.\n\n\"This is what I love to do,\" Wade said. \"This is the fun part of this game. I mean, obviously the last couple years I had to do what I had to do for that team. But now for this team I get to be a little bit back to my usual self, having the ball. I'm not going to do it right every time, but I like my chances most nights.\"\nWade leads the NBA in fourth-quarter scoring this season, averaging 7.3 points. Miami trailed by 11 in the second half, but rallied and moved up to the No. 7 spot in the Eastern Conference playoff race.\n\"He just understands the moment right now,\" Heat coach Erik Spoelstra said. \"We don't have to talk about it. Here's the ball -- make the play for the team.\"\nLuol Deng had 24 points on 4-for-4 shooting from 3-point range for Miami, which got 20 points and 11 assists from Goran Dragic and a 12-point, 10-rebound night from Hassan Whiteside.\nLaMarcus Aldridge led Portland with 34 points and 12 rebounds. Damian Lillard scored 17 and Arron Afflalo added 15 for the Trail Blazers, who fell a half-game behind Houston in the race for third in the Western Conference.\n\"They picked up the pressure defensively in the second half,\" Blazers coach Terry Stotts said. \"Miami played very well, particularly at the offensive end.\"\nAfter Wade hit the go-ahead jumper, Portland turned it over on the inbounds pass. Wade got fouled 4 seconds later and sealed it with two free throws.\n\"D-Wade is amazing,\" Whiteside said. \"Y'all can quote me on that. And that's it.\"\nMiami turned the 11-point deficit into an eight-point lead with 5:40 left. That left the Blazers plenty of time.\nAldridge got into the lane and scored with 1:35 left to tie the game. After Whiteside blocked a shot from Robin Lopez at the rim, Aldridge got the offensive rebound -- his only one on that end of the floor all night -- and scored with 52.1 seconds left to put the Blazers up 104-102.\nBut the rest was all Wade.\n\"I'm just doing whatever I can to help my teammates,\" Wade said.\nMiami got assists on 10 of its 13 field goals in the third, had seven different players score and went 5 for 5 from 3-point range -- the team's best one-quarter showing from beyond the arc since the first game of the 2013-14 season -- to get within 81-79 going into the fourth.\nDeng opened the final quarter with another 3-pointer, and Miami had its first lead since the opening minutes.\n\"Their third-quarter momentum made it a game and they did it with guys you don't necessarily expect to do that,\" Stotts said.\nTIP-INS\nTrail Blazers: Aldridge had 13 of his points in the opening quarter, making him the fourth player to score that many against Miami in the first 12 minutes of a game this season. ... Portland is now 18-8 all-time in Miami, still the best winning percentage of any Heat opponent. ... Robin Lopez, continuing his love affair with NBA mascots, playfully tackled the Heat's \"Burnie\" before the game. Burnie was carrying signs saying \"Free Hugs\" and \"No More Violence.\"\nHeat: Earlier in the day, the Heat -- as expected -- signed Michael Beasley for the remainder of the season. ... Miami tried only two 3-pointers in the first half, and one of those was a time-running-out half-courter by Tyler Johnson. The Heat came into the night averaging nearly 10 first-half 3-point attempts. ... Deng passed Chris Bosh for the team's season lead in 3-pointers.\nDRAGIC'S NIGHT\nDragic's 11 assists were his most in a Heat uniform. \"For sure, it was a huge win for us, especially with how we played at the end,\" Dragic said.\nPOINTS WASTED\nPortland was 24-4 coming into the night when scoring at least 104 points. The Blazers were also 7-0 when shooting better than 50 percent -- they shot 51 percent in this loss.\nUP NEXT\nTrail Blazers: At Orlando on Friday.\nHeat: Host Denver on Friday.",
  "tags_rule": [
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.578955",
  "pipeline_version": "v1"
}