{
  "game_id": "0021300999",
  "espn_id": "400489872",
  "date": "Mar 17, 2014",
  "matchup": "CHI vs. OKC",
  "headline": "Kevin Durant extends 25-point streak as Thunder down Bulls",
  "cleaned_body": "CHICAGO -- The individual accomplishments are all well and good to Kevin Durant.\nThis means more.\nThe Thunder shook off their worst loss, then stood their ground when the Bulls came charging at them.\n\nDurant finished with 35 points and 12 rebounds, and Oklahoma City beat Chicago 97-85 on Monday night.\nRussell Westbrook added 17 points after sitting out the previous day to rest his surgically repaired knee, and the Thunder rebounded from their most lopsided loss of the season.\nThey went on a 13-point run after the Bulls scored eight straight early in the fourth to cut the lead to one and pulled this one out after falling by 23 at home to Dallas on Sunday.\nDurant ran his streak of games with 25 or more points to 32, the longest in the NBA since Michael Jordan did it in 40 in a row during the 1986-87 season. He also chipped in with five assists.\n\"I just go out there and ... play to win,\" Durant said. \"If all that stuff comes with it, then that's cool.\"\nWhat's most impressive about the streak is the sheer consistency, the lack of a true off game. That and the fact Durant just shrugs it off stand out most to coach Scott Brooks.\n\"I know when I had a three-game streak of four, I was worried about that fourth game,\" Brooks said. \"I had to make my first shot. He's not worried about it. He's worried about playing hard and playing the correct way and finding ways to help his team win. That's what he's done. He's an amazing leader and he's so consistent.\"\n\nWestbrook had nine rebounds and nine assists, although he did struggle from the field. He was 5 of 14, and the Thunder shot 41.3 percent overall.\nThey had the touch from long range, hitting 13 of 25 3-pointers -- three each by Durant, Westbrook and Caron Butler.\nThe Bulls never found their rhythm, shooting 34.5 percent overall, and settled for a six-game split on a tough homestand that included wins over defending champion Miami and Houston.\n\"I would have liked it better if we won a couple more games, but 3-3 we'll take it,\" Joakim Noah said. \"We've just got to move forward. I wish we could have this game back.\"\nNoah, who's been hearing \"MVP!\" chants lately, had a rather quiet night, although he just missed his fourth triple-double of the season. He shot just 2-of-8 but finished with nine points, 12 rebounds and nine assists.\nTaj Gibson had 16 points and seven rebounds. Jimmy Butler scored 13, and Carlos Boozer chipped in with 12 points and 11 rebounds, but the Bulls came up short.\nThe Thunder were leading by nine early in the fourth when the Bulls scored eight straight points, Butler's fastbreak dunk putting a charge in the crowd and back-to-back baskets by Gibson cutting it to 76-75 with about 10 minutes remaining. After that, things turned in a big way.\nThe Bulls missed their next 11 shots, and the Thunder scored 13 straight over the next 6 1/2 minutes.\nDerek Fisher started the decisive rally with a 3-pointer. A layup by Serge Ibaka, dunk by Durant, three free throws by Caron Butler, a driving bank shot by Westbrook and a free throw by the guard just over a minute later made it 89-75 with 3:45 remaining.\nNoah hit a free throw for Chicago 15 seconds later, and after Ibaka nailed a 3, Gibson dunked to end a 7-minute, 4-second drought between baskets for the Bulls.\n\"We took their hit, and that's what the game's all about,\" Durant said. \"There's going to be a time when you've got things clicking. You're up nine, we'd have pushed it up to 12, 15, but we didn't find a way. But everybody stayed poised.\"\nGame notes\nWestbrook insisted Chicago's Derrick Rose can make a strong return from his latest season-ending knee surgery. The two have trained together in the offseason. \"I talked to him numerous times,\" Westbrook said. \"He's a tough guy as you guys know. He does a great job of coming out, competing. It's unfortunate that he had to be hurt and he'll be out another year, but he's going to come back the same D-Rose he was before.\" ... Bulls backup F Tornike Shengelia was out with flu-like symptoms. ... The Bulls wore green jerseys in honor of St. Patrick's Day.",
  "tags_rule": [
    "MomentumShift",
    "TripleDouble"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.791818",
  "pipeline_version": "v1"
}