{
  "game_id": "0021700997",
  "espn_id": "400975743",
  "date": "Mar 11, 2018",
  "matchup": "HOU @ DAL",
  "headline": "Gordon, Paul lead Harden-less Rockets past Mavericks 105-82",
  "cleaned_body": "DALLAS --  When the Houston Rockets' MVP candidate needs a night off, they can simply elevate the NBA's Sixth Man of the Year to the starting lineup.\n\nOr turn the ball over to an eight-time all-NBA point guard.\n\nThat's why they have the best record in the league -- as Houston showed without James Harden on Sunday night. Eric Gordon scored 26 points and Chris Paul had 24 points and 12 assists as the Rockets beat the Dallas Mavericks 105-82.\n\nHarden sat because of a sore left knee, but the team had plenty of 3-point shooting even without him.\n\n\"What's that? Thirty points a night?\" Paul said of Harden's absence. \"But it just gave other guys an opportunity to step up.\"\n\nHouston, which had its 17-game win streak snapped Friday in Toronto, broke the game open in the third quarter after leading by only one at the break. The Rockets hit their first six 3s of the period amid a 22-10 run. They finished 17 for 45 from beyond the arc, with Gordon going 6 for 11.\n\nPaul either scored or assisted on the first 20 points of the quarter and finished the quarter with 12 points and five assists as Houston outscored Dallas 32-16.\n\n\"He orchestrated a great game, but he has done that for about 15 years,\" coach Mike D'Antoni said.\n\nHouston clinched a playoff spot with the win. When asked about that achievement after the game, Gordon said: \"I'd much rather have that No. 1 seed.\"\n\nOn that front, the Rockets moved 1  1/2 games ahead of Golden State for the best record in the NBA after the Warriors lost to Minnesota earlier Sunday. Houston also holds the tiebreaker on Golden State should the teams finish with identical records.\n\nHouston also swept the four-game season series from the Mavericks for the second year in a row.\n\nDwight Powell led the Mavericks with 20 points, one short of his career high, on 9-of-11 shooting. Harrison Barnes added 14. Dallas shot just 35 percent from the field, a figure that looks even worse in the context of Powell's night.\n\nA TON OF BRICKS\n\nDallas finished 33 for 94 from the field. Barnes shot 4 of 16, Dennis Smith was 2 of 12, and J.J. Barea was 2 of 9, though he had 13 assists.\n\nFrom 3-point range, the Mavericks made a season-low five shots on 31 attempts, and even Dallas' normally reliable free-throw shooting was off. The team averages 77 percent from the line but hit just 11 of 18 (61 percent) Sunday.\n\n\"They are a great team, even without Harden,\" Mavericks coach Rick Carlisle said. \"They did what they had to do, and we just couldn't make enough shots.\"\n\nMATTHEWS SITS OUT\n\nMavericks guard Wesley Matthews sat out Sunday because of a right leg injury suffered in the first half of the Mavericks win over Memphis on Saturday night. He said he played through it and was ready to go Sunday, but was advised to sit out. Carlisle said Matthews wouldn't travel, at least initially, on the team's upcoming four-game road trip.\n\n\"I'm going to get an MRI tomorrow, and we'll know more then,\" Matthews said. \"It took three heads to pull me off the court tonight.\"\n\nTIP-INS\n\nRockets: D'Antoni said Harden should be available Monday against San Antonio. The Rockets are 5-3 without him in the lineup. ... Houston used its 13th different starting lineup of the year. ... D'Antoni was on hand in nearby Frisco, Texas, to watch his alma mater, Marshall, coached by his brother Dan, win the Conference USA Tournament final Saturday. The Thundering Herd beat Western Kentucky 67-66 for their first NCAA Tournament berth since 1987.\n\nMavericks: Barea assisted on nine of the Mavericks' first 10 field goals. ... Dallas signed F Jameel Warney to a 10-day contract. Warney has averaged 20 points in 40 games for the Mavericks' G-League affiliate, the Texas Legends. Warney entered in the fourth quarter and scored five points. ... In addition to Matthews, Dorian Finney-Smith and Salah Mejri sat out for the Mavericks. Finney-Smith had played Saturday after missing 51 with a quadriceps injury.\n\nUP NEXT\n\nRockets: Host the Spurs on Monday for the second half of a back-to-back.\n\nMavericks: Start a four-game road trip Tuesday at the Knicks. Dallas plays 10 of its final 15 on the road.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "PlayoffContext",
    "ThreePointExplosion",
    "CoachComment",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.888240",
  "pipeline_version": "v1"
}