{
  "game_id": "0021200481",
  "espn_id": "400278201",
  "date": "Jan 04, 2013",
  "matchup": "CHI @ MIA",
  "headline": "Carlos Boozer, Bulls beat up Heat on glass, post road win",
  "cleaned_body": "MIAMI -- Even when seated, the Chicago Bulls outrebounded the Miami Heat.\n\nFollowing one missed shot, the ball rolled between forward Carlos Boozer's legs as he fell on his backside, yet he still managed to scoop it up and feed a teammate for two more second-chance points for Chicago.\n\nDominating on the glass and the hardwood, the Bulls became only the third visiting team to win in Miami this season, beating the Heat 96-89 on Friday night.\n\nChicago outrebounded Miami 48-28. The Bulls had 19 offensive rebounds to four for the Heat.\n\n\"Everybody in both locker rooms understands what the overwhelming key to the game was,\" Miami coach Erik Spoelstra said. \"They were throwing it up there and playing volleyball against us.\"\n\nThe Eastern Conference-leading Heat fell to 15-3 at home. Their other home defeats came against the Knicks and Warriors.\n\n\"It always feels good to beat the Heat,\" said center Joakim Noah, who had 12 rebounds. \"And we get a night out in the city, so we're hyped right now. We haven't been playing great basketball and this is probably our biggest win of the year against the defending champs. It feels good.\"\n\nThe first meeting between the teams this season was a bruiser, and the Bulls repeatedly outfought and outfoxed Miami on the boards.\n\nThe Heat, who are last in the NBA in rebounds, had won four games this season when outrebounded by 15 or more. But this time the disparity beat them.\n\n\"It's just the will of going to do it,\" LeBron James said. \"It's a reoccurrence. You give a team like this extra possessions, they're going to capitalize.\"\n\nJames scored 30 points, extending his streak of scoring at least 20 points to 31 consecutive games this season, and 52 games in a row overall when including last year's playoff run. He has scored at least 25 in eight consecutive games.\n\nBut he had just six rebounds, which led the Heat. Boozer had 12 rebounds for Chicago, and Taj Gibson added nine in 17 minutes.\n\nThe Bulls' final offensive rebound helped seal the win. Jimmy Butler grabbed it and fed Boozer for a layup with 46 seconds left to put them up 93-86.\n\nChicago had 20 second-chance points to seven for Miami.\n\n\"It's killing us, plain and simple,\" said Heat center Chris Bosh, who had one offensive rebound in 38 minutes. \"Is it scheme? Is it mental? We'd better figure it out.\"\n\nBoozer scored 27 points after totaling a season-high 31 on Wednesday at Orlando. Noah, back after missing one game with flu-like symptoms, had 13 points.\n\nThey set the tone with their physical play.\n\n\"I don't know if that small ball is going to work against us,\" Noah said. \"Not with guys like Carlos Boozer in the game.\"\n\nWhile the Heat were often on their heels, they kept coming back. A jarring foul by Kirk Hinrich near the sideline staggered James and he collapsed on the Bulls bench, then was helped to his feet by coach Tom Thibodeau.\n\nSeconds later, James sank a 3.\n\nNoah drew a flagrant foul when he tackled James around the neck with one arm to stop a drive early in the fourth quarter. The violation led to a four-point possession for the Heat, with James sinking four consecutive free throws.\n\nThe next time Miami had the ball, James drove for a dunk that cut Chicago's lead to 75-72. But the Heat got no closer.\n\n\"We understand how important rebounding is,\" Thibodeau said, \"and it showed tonight.\"\n\nChicago won with more than mere muscle. The Bulls' 5-foot-9 Nate Robinson made a leaping interception of a James pass, then smartly bounced the ball off Miami's Shane Battier to avoid traveling. The ball dribbled out of bounds, allowing Chicago to keep possession.\n\nRobinson's 3-pointer with 6 1/2 minutes left gave the Bulls their biggest lead, 83-73.\n\nThe Bulls pounded the boards from the start and scored the final 10 points of the first quarter for a 26-22 lead. Butler's buzzer-beater to end the first half put them up 49-48.\n\nMarco Belinelli sank a 3-pointer to put Chicago up 75-66 after three quarters.\n\nThe Heat had won their past two games, both in overtime, but the Bulls wouldn't let them get to OT.\n\nGame notes Regarding All-Star voting, James said with a chuckle: \"It looks like I'm going to be a starter. Surprising.\" ...  The Bulls are 9-8 home and 9-5 on the road. ... Chicago improved to 8-1 on the road against the Eastern Conference.",
  "tags_rule": [
    "LateCollapse",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Collapse",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.773811",
  "pipeline_version": "v1"
}