{
  "game_id": "0021700319",
  "espn_id": "400975070",
  "date": "Dec 01, 2017",
  "matchup": "TOR vs. IND",
  "headline": "DeMar DeRozan scores 26 points, Raptors top Pacers 120-115",
  "cleaned_body": "TORONTO --  With a season-high 70 points in the paint, the Toronto Raptors brushed off the Indiana Pacers for their sixth straight home victory.\n\nDeMar DeRozan scored 26 points, Jakob Poeltl made all eight of his field goal attempts and had a career-high 18 points and the Raptors beat the Pacers 120-115 on Friday night.\n\n\"We came out extremely aggressive, attacking,\" DeRozan said. \"Everybody was in attack mode.\"\n\nSerge Ibaka added 15 points, Jonas Valanciunas had 13 and Kyle Lowry and Fred VanVleet each had 11 for the Raptors. They are 8-1 at home.\n\n\"This is our comfort zone,\" DeRozan said.\n\nThe Raptors set a season-high with 60 points in the paint Wednesday night a victory over Charlotte and wasted no team beating the mark, much to the disappointment of Indiana coach Nate McMillan.\n\n\"That was game plan No. 1, to keep them out of the paint, keep them off the free throw line,\" McMillan said. \"To give up 70 points, just not good at all. There is no excuse for that, just no excuse.\"\n\nToronto came in averaging 48.4 points in the paint, the most by any Eastern Conference team. The Raptors have scored 50 or more points in the paint in 12 of 21 games, including the past four straight.\n\nPoeltl's previous career-high was 14, done twice. His eight made baskets were also a career-high.\n\n\"We've been working on it a lot, on my finishing, and I think it's paying off,\" Poeltl said. \"Obviously, there's not a lot of defensive focus on me, so I'm trying to use that space to finish.\"\n\nVictor Oladipo scored a season-high 36 points for Indiana, and Myles Turner had 17, and Darren Collison 16. The Pacers lost their second straight road game after winning the previous four away from home. They have lost eight consecutive regular-season visits to Toronto.\n\nToronto is 13-0 this season when leading after three quarters. The Raptors led 94-89 heading to the fourth.\n\nIndiana trailed by five, 103-98, after Oladipo made three free throws with 8:31 left. Norman Powell answered with a one-handed dunk, sparking an 8-0 run by the Raptors that gave Toronto a 111-98 lead with 6:48 remaining.\n\n\"The guys that were in there understood the moment,\" DeRozan said. \"The energy kept it going, the bench kept it going, and we took care of business.\"\n\nThe Pacers rallied, and a layup by Collison made it 116-11 with 1:45 left. Indiana missed its next three shot attempt, allowing DeRozan to seal the victory at the free throw line.\n\nTurner started for the Pacers despite a sore right knee suffered when he collided with an opponent in Wednesday night's loss at Houston.\n\nTIP-INS\n\nPacers: Indiana committed just one personal foul in the opening quarter, when Bogdanovic fouled DeRozan after 24 seconds. ... The Pacers shot 8 for 8 at the free throw line in the first. ... Indiana made one of 11 3-point attempts in the fourth.\n\nRaptors: C Lucas Nogueira was inactive after being diagnosed with a torn right calf earlier Friday. Nogueria left in the fourth quarter of Wednesday's win over Charlotte. ... Toronto's first five field goals each came from from a different member of the starting lineup. ... The Raptors have outscored their opponents in the second quarter of 12 consecutive games.\n\nBLOCK PARTY\n\nIbaka wowed the crowd with a huge chase-down block on Bogdanovic in the first.\n\nWELCOME HOME\n\nFormer Raptors G Cory Joseph got a warm ovation in his first game back in Toronto. \"It felt great,\" said Joseph, who grew up in the city's eastern suburbs. \"Toronto is a special place for me.\"\n\nUP NEXT\n\nPacers: Begin a season-high six-game homestand against New York on Monday night. After losing seven straight meetings, New York has won four of five against the Pacers.\n\nRaptors: Host Phoenix on Tuesday night. Toronto has lost its past two home meetings with the Suns.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.456913",
  "pipeline_version": "v1"
}