{
  "game_id": "0021300953",
  "espn_id": "400489826",
  "date": "Mar 11, 2014",
  "matchup": "POR @ MEM",
  "headline": "Grizzlies strengthen hold on final Western Conference playoff berth",
  "cleaned_body": "MEMPHIS, Tenn. -- The Memphis Grizzlies are headed on a three-game road trip with a better grip on the Western Conference's final playoff spot.\nMarc Gasol scored 19 points, Zach Randolph added 18 points and 12 rebounds as the Grizzlies defeated the Portland Trail Blazers 109-99 on Tuesday night.\nThe victory kept Memphis in the conference's eighth spot with a one-game edge over the idle Phoenix Suns. But players are not satisfied with the current position.\n\"Even though we are in, we want to be higher,\" guard Courtney Lee said. \"We're still chasing, and I think that's the right mindset to have going forward because if you continue to chase, you'll never get complacent and fall off.\"\nMike Conley added 17 points and Lee finished with 16. Mike Miller had 14 for Memphis, which won its third straight.\nDamian Lillard led the Trail Blazers with 32 points on 8-of-21 shooting from the field, but connecting on 12 of 13 free throws, including six in the fourth quarter when he was fouled on a pair of 3-point attempts. LaMarcus Aldridge had 19 points and 10 rebounds, while Nicolas Batum contributed 15 points for Portland, which lost its third straight, matching its longest skid of the season.\nMemphis built its lead to double-digits early in the fourth quarter and Portland got it under 10 -- to nine -- on only two occasions the rest of the way. The common refrain from the Trail Blazers was it was \"just one of those nights.\"\n\"They would just get a tip ball or a loose ball and they would hit a 3 with it,\" Lillard said. \"It was just one too many of those situations.\"\nWhile Memphis heads on a road trip to New Orleans, Toronto and Philadelphia holding the final playoff spot, Portland sits in the conference's fifth slot.\nTrail Blazers coach Terry Stotts was pleased with the way his team competed and shooting 22 of 29 from the foul line.\n\"I thought we had a lot of shots we normally make,\" Stotts said. \"We took care of the ball (eight turnovers). We got to the free-throw line. We were aggressive.\n\"I thought it was just one of those nights.\"\nPortland struggled from the field, connecting on 41 percent for the game. In addition to Lillard's percentage, Aldridge was 8 of 23 and Batum was 5 of 13. Wesley Matthews managed only one field goal on seven attempts.\n\"I think he had good looks,\" Stotts said of Aldridge's shooting. \"But you can't make them every night.\"\nAldridge considered it just part of a shooting slump that will end at some point.\n\"I am going to find my rhythm, and I am going to make those shot I've been missing soon. It will get a lot better,\" he said.\nThe Grizzlies, who shot at least 50 percent in each quarter, finished the night at a season-best 56 percent including 6 of 12 from outside the arc.\nMemphis held a 54-47 lead at the break, but Portland was close despite shooting 41 percent. The Trail Blazers gathered nine offensive rebounds for 10 second-chance points.\nMemphis stretched the lead back to 15 to open the second half, and kept the advantage through the middle stages of the quarter. Lee was the catalyst for Memphis, scoring 13 in the quarter, a difference, he said, of not playing as passive as he had in the first half.\n\"Coaches and my teammates were telling me to go out and be more aggressive,\" Lee said of the second half. \"You don't have to tell me that twice.\"\nThe Trail Blazers closed the stanza on a 10-4 run to cut the lead to 78-69 entering the fourth. After Nick Calathes connected on a 3-pointer to open the fourth period, Memphis had its double-digit lead back.\nGame notes\nMemphis has won five straight in the series. ... Portland G Will Barton, who played at the University of Memphis, got in for the final minute of the game. ... Five of the previous seven games in the series were decided by six points or less. ... Memphis has a seven-game home winning streak.",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:50.763048",
  "pipeline_version": "v1"
}