{
  "game_id": "0021200015",
  "espn_id": "400277735",
  "date": "Nov 02, 2012",
  "matchup": "CHA vs. IND",
  "headline": "Kemba Walker helps Bobcats end 23-game skid",
  "cleaned_body": "CHARLOTTE, N.C. --  The agony is over for Michael Jordan and the Charlotte Bobcats.\n\nKemba Walker scored a career-high 30 points in Mike Dunlap's coaching debut and the Bobcats snapped a 23-game losing streak with a 90-89 victory over the Indiana Pacers on Friday night.\n\nThe Bobcats lost their final 23 games last season to finish 7-59, the worst winning percentage (.106) in NBA history, prompting Jordan, the team's owner, to proclaim the franchise had \"hit rock bottom.\"\n\nNow they're looking to start a different kind of streak.\n\n\"It was something that was in the back of all of our heads,\" Walker said. \"We didn't want that streak to keep on with us, so to get it over with now was extremely important. But now that it's over we don't ever want to get to that point again.\"\n\nThe Bobcats, playing with a newfound aggressiveness on defense under Dunlap -- they forced 19 turnovers -- started the year strong against a Pacers team that won 19 of 33 road games last season.\n\n\"They look like a different team out there,\" said guard D.J. Augustin, who joined the Pacers this offseason as a free agent after four seasons with the Bobcats.\n\n\"They came at us with a full-court trap and it kind of threw us off our game. They were very intense.\"\n\nDunlap has been preaching defense throughout the preseason and hammering his players with 3- to 4-hour practice sessions to build their conditioning.\n\nIt seemed to pay off.\n\n\"Guys are really, really buying in and that's all it takes,\" Walker said. \"It's about sacrifice. It's about buying into what your leader is preaching. It showed tonight. We made some huge stops at the end.\"\n\nIt was a strange finish as the teams combined to score just two points in the game's final 2:37. Indiana had several chances but turnovers and missed shots proved to be their undoing.\n\nAugustin tried to bury his old team with an 18-foot jumper from the wing as time expired but it bounced away.\n\n\"I had a good look at it, but it just didn't go down,\" Augustin said.\n\nSaid Dunlap: \"The most important thing was to kill the elephant and that elephant was that losing streak. We had to get that off of everybody's back. It's just one of those marks you want to clean off the board.\"\n\nWalker was the catalyst all game for the Bobcats, hitting 9 of his first 13 shots -- most of those coming on drives to the lane where the 6-foot-1 point guard somehow managed to get his shots above much taller defenders and get them with a soft touch high off the glass.\n\nWhen asked how he made some of those shots, Walker laughed and said, \"I don't know.\n\n\"I think I was having a really good night. Coach Dunlap was helping with those kinds of crazy shots all offseason. It's just all of the hard work that has been paying off.\"\n\nWalker also drew contact along the way, making 9 of 10 free throws, an area where the Pacers struggled all game. Indiana shot just 59 percent from the free throw line.\n\nGerald Henderson added 18 points for the Bobcats and Ramon Sessions chipped in 11 points, including a big 3-pointer early in the fourth quarter.\n\nTyler Hansbrough and Lance Stephenson led the Pacers with 15 points each.\n\nThe Bobcats were the worst shooting team in the league last season, but they came out strong building a 12-3 lead. That was short-lived as they quickly cooled off going more than 6 minutes without a point. The Pacers grabbed the lead behind 12 hard-fought points by Hansbrough and took a 43-39 halftime lead.\n\nWalker scored eight quick points to start the second half, giving the Bobcats a lead they would never relinquish.\n\nIndiana played without forward Danny Granger, the team's leading scorer the past five seasons, who continues to be sidelined indefinitely with soreness in his left knee. Before the game, coach Frank Vogel said they are still awaiting the medical results of a second opinion on his knee.\n\nThe Pacers shot just 36.5 percent from the field.\n\n\"It was a tough shooting night but you have to give the Bobcats credit,\" Vogel said. \"Kemba Walker was sensational. We turned the ball over too much and we couldn't knock down our free throws.\"\n\nMichael Kidd-Gilchrist, the No. 2 overall pick in this year's draft, struggled offensively for the Bobcats, going 1 for 7 from the field and he didn't play much down the stretch.\n\nHowever, he played hard with seven rebounds and was impressive at times on defense.\n\nIn the second quarter, Kidd-Gilchrist skied to block a shot by 7-foot Roy Hibbert in the lane, igniting a fastbreak layup and three-point play on the other end by Walker.\n\n\"I was nervous coming into this game,\" Kidd-Gilchrist said. \"I'm a rookie. So, I was just nervous. But I thought I did pretty well.\"\n\nGame notes Pacers F Sam Young only played 20 seconds before leaving with a right shoulder injury. He was hurt when he got Henderson in the air with a pump fake and Henderson's leg landed on his shoulder on the way down. ... Former professional wrestler Ric \"The Nature Boy\" Flair attended the game. ... The Bobcats won their season opener last year before the season quickly began to unfold.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.733265",
  "pipeline_version": "v1"
}