{
  "game_id": "0021700230",
  "espn_id": "400974981",
  "date": "Nov 18, 2017",
  "matchup": "ATL vs. BOS",
  "headline": "Irving, Brown help Celtics rally for 15th straight win",
  "cleaned_body": "ATLANTA --  Kyrie Irving appreciates what he calls \"the innocence of the game\" during Boston's 15-game winning streak.\n\nIn his first season with the Celtics after demanding a trade from Cleveland, Irving is enjoying the torrid start because everything feels so new.\n\n\"Most of us have never been on a winning streak like this,\" he said. \"I don't know if we even know how to pay attention to all the hoopla that goes on in terms of the excitement of it. I just think that every single game we take it as a challenge.\"\n\nIrving scored 30 points, Jaylen Brown added a career-high 27 and the Celtics beat the Atlanta Hawks 110-99 on Saturday night.\n\nAt 15-2, Boston leads the NBA and has matched the best start in franchise history through 17 games. The winning streak is the club's fifth-longest, four behind the 2008-09 team that set the franchise mark.\n\nDennis Schroder had 23 points, and Kent Bazemore added 19 for Atlanta. The Hawks are an Eastern Conference-worst 3-13, but they still had plenty of adrenaline following a 46-point victory over Sacramento -- the biggest in franchise history -- two nights ago.\n\n\"I still feel like we can make some big things happen this season,\" Schroder said. \"We just have to stay together as a team.\"\n\nThe Celtics erased a 16-point deficit to take their first lead on Brown's 3-pointer midway through the third. It marked Boston's fourth win when trailing by at least 16 during the streak.\n\nIt's been a tough week for Brown, a 21-year-old whose best friend Trevin Steede passed away this week in metro Atlanta. Brown and Streede went to Wheeler High School together in nearby Marietta. He spoke publicly about Steede a couple of days ago and skipped talking to reporters after beating the Hawks.\n\n\"He's not alone,\" Irving said. \"That's the spirit in the truest form. (Brown) may not say much but he knows we're all here for him.\"\n\nIrving, playing with a protective mask to protect a minor facial fracture, ended the game with a right-handed finger-roll layup, delighting a few thousand Boston fans who were chanting \"MVP! MVP!\" in the fourth quarter.\n\nIn 31 minutes, Irving made 10 of 12 shots, including five 3-pointers, and hit all five of his free throws.\n\nIrving, frustrated that the mask was affecting his peripheral vision two nights ago, took it off to help Boston beat defending NBA champion Golden State by four points. He scored 16 points, but was just 4 for 16 from the field.\n\n\"I could see just a little bit more of the crowd tonight,\" Irving said. \"The eye holes were a little bit bigger. The basket looked a little bit better. I was told to kind of keep it on, so it was a better fit.\"\n\nThe Celtics lead NBA in scoring defense, but they gave up 35 points in the first quarter and trailed by 15 entering the second.\n\n\"I think the biggest thing is that we can't keep digging these holes,\" Boston coach Brad Stevens said. \"We need to put an emphasis on playing with pace and getting the ball to the other side of the floor.\"\n\nAtlanta used a 16-0 run in the first to take a 15-point lead. But fueled by Marcus Smart and other reserves, Boston pulled within four twice in the second and cut the lead to six in the closing minutes on Brown's 3.\n\nMarcus Morris and Jayson Tatum each had 14 points for Boston. John Collins scored 18 and Taurean Prince added 14 for Atlanta\n\nTIP-INS\n\nCeltics: Tatum was scoreless until he stole the ball and dunked to cut the lead to four in the third. The 19-year-old former Duke standout followed with an acrobatic, one-handed dunk on a fast break to make it 75-72 and had another dunk to put Boston up 78-77 near the end of the period. Tatum had all 14 of his points in the third.\n\nHawks: Prince is developing into a solid option on offense, spinning for a layup against Shane Larkin and floating a soft assist on Collins' dunk that put Atlanta up 84-82. But Prince has a substandard reputation as a defender, and coach Mike Budenholzer gave him an earful after calling timeout in the third. Prince had just missed an assignment that left Brown open to hit the big 3 from the left corner.\n\nUP NEXT\n\nCeltics: At Dallas on Monday night.\n\nHawks: At San Antonio on Monday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.250497",
  "pipeline_version": "v1"
}