{
  "game_id": "0021700251",
  "espn_id": "400975002",
  "date": "Nov 20, 2017",
  "matchup": "SAC vs. DEN",
  "headline": "Nuggets beat Kings 114-98 without coach and 2 starters",
  "cleaned_body": "SACRAMENTO, Calif. --  Will Barton didn't know Mike Malone was suspended by the NBA until the Denver Nuggets coach informed him as Barton got on the team bus to head to the arena.\n\n\"I thought he was joking,\" Barton said. \"I told him we'd hold it down for him.\"\n\nMinus their coach and two starters, the short-handed Nuggets did just that -- and only 24 hours after losing by 21 points to begin their three-game road trip.\n\nBarton and Trey Lyles made two 3-pointers apiece during a big run in the third quarter, and Denver pulled away to beat the Sacramento Kings 114-98 on Monday night.\n\nBarton finished with 25 points, six rebounds and five assists in his third start this season for Denver, which also was without injured starters Paul Millsap and Wilson Chandler.\n\n\"Given the circumstances, I'll take it,\" said Nuggets assistant Wes Unseld Jr., who coached the team while Malone stayed back at the team hotel. \"The minute (we) got in here from the team bus they knew it was a task at hand. We were under adverse circumstances and had no other option than to pull it together.\"\n\nMalone served a one-game NBA suspension for making contact with a referee in Sunday's loss to the Los Angeles Lakers. Denver also was missing Millsap, who sprained his left wrist against the Lakers, and Chandler (lower back pain).\n\nAfter a sluggish first half, Denver pulled away in the third quarter following a 19-7 run late in the third quarter sparked by the long-distance shooting of Barton and Lyles. The Nuggets shot 15 of 32 beyond the arc and led by as many as 22 in the final period.\n\n\"That third quarter we were real patient and sound, ran our sets and got going,\" Barton said. \"Anytime you're missing two starters, impact guys like that, it's going to take a while.\"\n\nNikola Jokic added 16 points and 14 rebounds, and Gary Harris scored 20 for the Nuggets.\n\nGeorge Hill and Kosta Koufos scored 16 points apiece to lead six players in double figures for Sacramento. The Kings, who had won their three previous home games against the Thunder, 76ers and Trail Blazers, have lost five of six overall.\n\n\"Athletically, (the Nuggets) go and get balls and jumped over the top of us and did some of those kind of things,\" Kings coach Dave Joerger said. \"We've got to be more physical. We were a step slow in the second half.\"\n\nBARTON COMES UP BIG\n\nBarton shot 9 of 15 and made a season-high five 3-pointers on six attempts from beyond the arc. \"He wasn't an aggressive scorer but he was a playmaker for us,\" Unseld said. \"Down the stretch he controlled the game.\"\n\nWHAT WENT WRONG\n\nJoerger thought his team played hard throughout the game but rookie guard De'Aaron Fox wasn't so sure. Asked if the Kings let up in the second half when the Nuggets got on their roll, Fox said: \"It felt that way. But it's happened before, we've got back before. It's just something if we go down, we've got to pick it up even more. You have to pick up your effort when things are going south.\"\n\nTIP-INS\n\nNuggets: With Millsap and Chandler out, Unseld went to a three-guard lineup but the offense sputtered in the first half with 11 turnovers. Denver did a much better job after the break and pulled away. . The Nuggets dominated the offensive rebounding (14-5) and converted that into a 19-6 advantage in second-chance points.\n\nKings: Zach Randolph had 12 points and six rebounds in his third consecutive start at center. ... Buddy Hield missed his second straight game with a sore right ankle.\n\nUP NEXT\n\nNuggets: Play at Houston on Wednesday. The Rockets have won four straight against Denver.\n\nKings: Host the Lakers on Wednesday. The teams split the season series in 2016-17.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.013648",
  "pipeline_version": "v1"
}