{
  "game_id": "0021300614",
  "espn_id": "400489487",
  "date": "Jan 20, 2014",
  "matchup": "POR @ HOU",
  "headline": "Chandler Parsons, Rockets snap Blazers' 5-game winning streak",
  "cleaned_body": "HOUSTON -- The last time the Houston Rockets scored more than 70 points in a first half they followed it with a franchise-low 19 points after halftime.\nThey had no such letdown Monday night against the Portland Trail Blazers.\nChandler Parsons scored a season-high 31 points and Dwight Howard added 24 to lead the Rockets to a 126-113 win over Portland that snapped the Trail Blazers' five-game winning streak.\nThe Rockets scored a season-high to win their second straight, building a big lead early and answering every time Portland made a run.\nJames Harden added 22 points and had five assists and Patrick Beverley returned from a broken hand to score 17 points. Parsons added 10 rebounds and seven assists while finishing one point shy of his career-high.\nHarden talked about the difference between Monday night and last week's loss to Oklahoma City, when they set an NBA record for the largest scoring differential between two halves.\n\"We just held our composure,\" Harden said. \"We couldn't worry about what they were doing or anything. We had to figure out a way to fight through it and play harder, push the tempo a little harder and play defense.\"\nLaMarcus Aldridge had 27 points and 20 rebounds for the Trail Blazers, who have won seven of their last 11 games.\n\"We got close and we just couldn't get over that hump,\" Aldridge said. \"Our shots didn't fall for us and they made tough shots and were able to get the win.\"\nHouston was up by 18 points after a 3-pointer by Harden with about eight minutes left. The Trail Blazers used a 9-2 run over the next two minutes to cut it to 115-104. The Rockets struggled in that stretch, missing two layups and committing a turnover.\nHouston missed two 3-pointers on one possession after that before Beverley hit a jump shot. Howard gave Houston a 119-104 lead when he grabbed an alley-oop from Harden and finished with a two-handed slam.\nDamian Lillard added 24 points for Portland and Wesley Matthews had 18.\nA 7-0 run by Portland midway through the third quarter got the Trail Blazers within six points. The Rockets scored the next seven straight to pad their lead to 93-80.\n\"They made a run in the third quarter and instead of us complaining, we got to the bench and we talked about what we needed to do and we got a good win against a very, very good team,\" Howard said.\nJeremy Lin made a 3-pointer with less than 10 seconds left in the third quarter to make it 106-91 entering the fourth.\nHarden was fouled on a 3-point attempt and made all three free throws before hitting a 3-pointer for a 6-0 run that pushed Houston's lead to 79-61 early in the third quarter.\nThe Trail Blazers answered with a 9-0 spurt to cut the lead to 79-70. Aldridge had a 3-point play during that stretch and Lillard capped it with two free throws when he was fouled by Howard, who also got a technical on the play.\nThe Rockets scored for the first time in almost three minutes on a layup by Parsons with about seven minutes left in the quarter. Nicolas Batum made a layup before Parsons added a 3-pointer to extend Houston's lead to 84-72.\nMo Williams got Portland within seven points when he opened the second quarter with a jump shot. But Houston countered with eight straight points powered by two 3-pointers from Omri Casspi to push the lead to 45-30.\nFive straight points by Matthews a couple of minutes later cut Houston's lead to 12 points. The Rockets responded again, scoring seven points in a row to extend the lead to 60-41.\nCasspi scored five quick points soon after that to extend Houston's lead to 71-49. Portland scored the last seven points of the half to get within 71-56 at the break.\nThe Rockets made 10 of 13 3-pointers in the first half to help them to score more than 70 points in a half for the second time in a week.\nHouston scored on its first 11 possessions to build a 25-11 lead. Beverley, who returned to the starting lineup after missing 14 games following surgery to repair a broken right hand, had two 3-pointers in that span and Harden had one.\nGame notes\nHouston's Terrence Jones, who scored a career-high 36 points in the last game, sat out with a deep thigh bruise. Donatas Motiejunas started in his place and finished with nine points and nine rebounds. ... The Trail Blazers have scored at least 98 points in 29 games in a row. ... Batum injured one of his fingers and said he \"felt it crack\" but wasn't sure of the extent of the injury after the game.",
  "tags_rule": [
    "ReturnFromInjury",
    "InjuryReport",
    "Streak",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.746551",
  "pipeline_version": "v1"
}