{
  "game_id": "0021300951",
  "espn_id": "400489824",
  "date": "Mar 11, 2014",
  "matchup": "DET vs. SAC",
  "headline": "Pistons clamp down on Kings in 99-89 win",
  "cleaned_body": "AUBURN HILLS, Mich. --  If the Detroit Pistons had played defense like this all season, their chances of making the playoffs might not look so remote.\n\nJosh Smith scored 24 points and Rodney Stuckey added 23, and the Pistons held Sacramento to 11 points in the third quarter in a 99-89 victory over the Kings on Tuesday night.\n\n\"I thought our bigs were tremendous in pick-and-roll tonight,\" Detroit interim coach John Loyer said. \"But it was a team effort. The guys on the ball did a good job. We didn't give them easy looks.\"\n\nAndre Drummond added 15 points and eight rebounds for Detroit, outscoring DeMarcus Cousins in a matchup of two of the NBA's top young big men. Cousins had 13 points and 14 rebounds but shot 5 of 15 from the field.\n\nDetroit trailed 54-52 at halftime, but outscored the Kings 20-11 in the third quarter.\n\n\"I thought we lost that game in the third quarter,\" Sacramento coach Michael Malone said. \"We did not come out ready to play. We had some good looks, but did not knock them down.\"\n\nRudy Gay scored 20 points and Isaiah Thomas added 19 points and eight assists for Sacramento.\n\nThe Pistons snapped a three-game losing streak and pulled to within three games of Atlanta for the final playoff spot in the Eastern Conference.\n\n\"We played with a sense of urgency,\" Detroit guard Will Bynum said. \"There are a couple of things we could do a little better, but this is definitely a building point.\"\n\nThe Pistons have shown little sign of a late-season run, but they put the Kings away with impressive starts to the third and fourth quarters.\n\nDetroit began the third on an 8-0 run thanks to a dunk by Drummond and 3-pointers by Smith and Brandon Jennings. An alley-oop from Smith to Drummond on the break made it 69-60.\n\n\"Sometimes it isn't about numbers, it's how you play,\" Loyer said. \"I thought it was one of Andre's better games. I thought he did a much better job in the post. I thought his defense was good.\"\n\nIt was 72-65 after three, and Detroit started the fourth with six straight points.\n\n\"We're concentrating on feeling more comfortable and we're also trying to play for something,\" Smith said. \"I don't want to sit home in April and think about what I could have done.\"\n\nThe Pistons won despite a rough shooting night for their two point guards. Jennings and Will Bynum combined to go 5 of 24 -- although they did finish with 13 assists between them.\n\nCousins dunked on Drummond early in the game, giving the Kings a 12-6 lead, but the Pistons kept him under control for the most part. Drummond blocked a shot by Cousins out of bounds later in the first quarter.\n\n\"We just make too many small mistakes during the game. Turnovers hurt us, and we didn't communicate on defense,\" Cousins said. \"We're making things too hard on ourselves. They came to play, and they made it tough for us, but we are hurting ourselves.\"\n\nGreg Monroe, who was drafted two spots after Cousins in 2010, had six points and 12 rebounds for Detroit.\n\nGame notes There was a moment of silence before the game in honor of William Clay Ford, who died Sunday. Ford was owner of the Detroit Lions and the last surviving grandchild of automotive pioneer Henry Ford. ... Sacramento's Ray McCallum, who played college basketball at Detroit, scored nine points on 4-of-5 shooting. ... The Kings did match up well with Detroit inside, outscoring the Pistons and their imposing front line 18-8 on second-chance points. ... Sacramento shot 3 of 15 from 3-point range, and in the second half the Kings went 6 of 17 on free throws.",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.149173",
  "pipeline_version": "v1"
}