{
  "game_id": "0021300446",
  "espn_id": "400489319",
  "date": "Dec 28, 2013",
  "matchup": "POR vs. MIA",
  "headline": "Chris Bosh's 37 points, late 3-pointer lead Heat over Blazers",
  "cleaned_body": "PORTLAND, Ore. -- Chris Bosh made his case: He wanted to go for the win.\nSo with 0.5 seconds left Saturday night, he sank the 3-pointer that gave Miami a 108-107 victory over the Portland Trail Blazers. Playing without LeBron James because of injury, the Heat acquiesced to Bosh's wishes on the play that won it.\n\"My call at the end of the game was much more conservative,\" coach Erik Spoelstra said. \"I drew something up to get him on the move and he said, 'No, I want it for the 3.' So he overruled it and became a prophet.\"\n\nBosh finished with a season-high 37 points and added 10 rebounds to hand Portland its third loss at home this season.\nWesley Matthews scored 23 points for the Blazers, who had won seven of eight.\nJames injured his right groin and tweaked his left ankle Friday night in a 108-103 overtime loss at Sacramento that snapped Miami's six-game winning streak. He stayed in the game and finished with 33 points, eight rebounds and eight assists.\nThe four-time NBA MVP warmed up before Saturday's game but was declared inactive about an hour before the opening tip. Michael Beasley started in his place.\nThe Blazers held a 94-91 lead halfway through the final quarter, but Bosh hit a 3-pointer to tie it at 96. He made another 3 that brought Heat players on the bench -- including James -- to their feet as Miami pulled in front 101-98 with 2:03 left.\nLaMarcus Aldridge's layup narrowed it to 103-102 with 1:08 to go before Nicolas Batum made all three of his free throws after he was fouled beyond the arc by Dwyane Wade.\nWade dunked to tie it at 105 with 26 seconds left, but the Heat fouled Batum with 7.7 seconds to go and he made both shots, setting up Bosh's 3-pointer when Wade drove right and kicked it back to him well beyond the arc.\nBosh wanted that 3.\n\"In that situation I wanted to go for the win,\" Bosh said. \"It was just how I felt at the moment. So we kind of changed it where Dwyane had an opportunity downhill and if he got double-teamed I was behind him for the jumper.\"\nSpoelstra praised Bosh for taking the lead in James' absence.\n\"He was terrific tonight, a true two-way player,\" the coach said. \"He took the challenge for the majority of his minutes on one of the premier players in this league (Aldridge) and then had to shoulder a big-time offensive load. That takes incredible stamina but also the skill set that he put on display tonight on both ends of the court.\"\n\nWade called the victory the Heat's first \"signature win of the year.\"\nAldridge, who finished with 22 points, missed a short jumper at the buzzer.\n\"It was obviously a disappointing loss. I was disappointed that we put ourselves in that position at the end of the game where it had to come down to a couple of plays at the end,\" Trail Blazers coach Terry Stotts said. \"Give Miami credit. We knew that they had a lot of good players and with James out, they had a lot of good players that can make plays and they did.\"\nBeasley appeared to get hurt himself early in the second half and came off the floor limping. He appeared in obvious pain while being attended to on the bench, but later returned to play.\nThe two-time defending NBA champions also were without Chris Andersen (sore back), but Ray Allen (right knee tendinitis) and Wade (rest), who both missed the game against the Kings, were back in the lineup.\nJames was the only Miami player to start the team's first 29 games. Listed as day-to-day, he'll celebrate his 29th birthday on Monday when the Heat play at Denver to wrap up a four-game trip.\nBosh's follow shot gave the Heat a 19-12 lead midway through the first quarter. Aldridge hit a 21-foot jumper that tied it at 24 before the period was over.\nDamian Lillard's 3-pointer gave Portland a 32-30 lead and Robin Lopez added a layup as the first quarter came to a close.\nThe Blazers stretched the lead when Dorell Wright's layup off a dish by Mo Williams made it 43-34. Miami closed the gap but Portland held a 62-58 advantage at the break.\nBosh and Matthews each had 18 points at the half.\nBosh's layup and Rashard Lewis' 3-pointer put the Heat in front 71-69 midway through the third quarter. Portland quickly reclaimed the lead, pushing it to 86-79 on Williams' 3-pointer. The Blazers led by as many as nine points.\n\"Tonight we made a lot of mistakes. It was kind of a lesson that all of those things can come back to bite us,\" Lillard said. \"But you can't win them all. We've won so many of them and tonight we almost had another one.\"\nGame notes\nJames has given the Blazers trouble in Portland, averaging 29.6 points, 9.9 rebounds and 7.2 assists in his past 10 games at the newly renamed Moda Center. ... Actress Julia Louis-Dreyfus was at the game. ... Spoelstra grew up in Portland and played basketball at the University of Portland. ... It was the first time this season that the Blazers lost a game they led after the third quarter.",
  "tags_rule": [
    "Streak",
    "InjuryReport",
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.290319",
  "pipeline_version": "v1"
}