{
  "game_id": "0021700487",
  "espn_id": "400975238",
  "date": "Dec 23, 2017",
  "matchup": "MEM vs. LAC",
  "headline": "Evans, Gasol help Grizzlies defeat Clippers 115-112",
  "cleaned_body": "MEMPHIS, Tenn. --  The Memphis Grizzlies haven't won many games lately, and those few victories have featured drama in the closing seconds.\n\nTyreke Evans had 30 points and 11 assists, Marc Gasol had 17 points and a season-high 15 rebounds and Memphis snapped a three-game losing streak with a 115-112 victory over the Los Angeles Clippers on Saturday night.\n\nThe Clippers had the ball with a chance to tie in the closing 21 seconds, but a tough Memphis defense forced a bad pass from Lou Williams, and Evans ran the ball down in the backcourt as the horn sounded. The victory was only the third for Memphis in the last 22 games. In each, the opponents failed to convert shots for a tie or victory on the final possession.\n\n\"You take the win any way that you can,\" Memphis interim coach J.B. Bickerstaff said. \"We've got to be better in those moments, though.\"\n\nAustin Rivers had 38 points, his second straight game setting a career high, while Williams finished with 36. But no other Clippers player reached double figures. DeAndre Jordan, the league's leading rebounder, had 18 boards.\n\n\"It was a great comeback at the end when you're down that many,\" Clippers coach Doc Rivers said.\n\nMemphis had its largest lead of the game with 5 minutes left, 109-93, before Austin Rivers and Williams began chipping into the advantage. Eventually, the guards helped craft a 19-6 run, pulling the Clippers within 115-112 with 1:00 left after a 3-pointer from Williams. After a couple missed attempts by Memphis, Doc Rivers called timeout with 21 seconds left. But Los Angeles never got off a shot in the ensuing possession.\n\n\"I didn't like the last play at all,\" the Clippers coach said. \"I thought we were looking for the 3, which we wanted, but we also could have gotten a quick 2. But we basically just dribbled the clock out.\"\n\nMemphis has struggled in at least one quarter in games throughout the losing skid. This time, Memphis used a strong third quarter to stretch its 63-59 halftime lead to as many as 12. The 16-point advantage in the closing 5 minutes was enough of a cushion for Memphis.\n\nFor the Clippers, playing the second night of a back-to-back after a win in Houston on Friday, there wasn't quite enough energy to overcome the deficit.\n\n\"Emotionally, on defense, we weren't communicating,\" Austin Rivers said. \"We weren't into it. They got too many buckets, and it cost us down the stretch.\"\n\nTIP-INS\n\nClippers: Los Angeles fell to 6-12 on the road. ... The Clippers, as they have been in recent games, were without F Blake Griffin, G Patrick Beverley, F Danilo Gallinari and F Wesley Johnson. That represents an average of 56.1 points per game on the injured list. ... Jordan reached double figures in rebounds for the 20th time this season.\n\nGrizzlies: The 63 first-half points were two short of Memphis' season high for a half. ... Evans has scored at least 20 points in 15 games this season, and his six 3-pointers were a career-high. ... Gasol's 15 rebounds were one short of his career-best 16 against the Pelicans on Jan. 16, 2015. ... Memphis had 28 assists on its 40 made field goals. ... The 115 points were a season high for Memphis.\n\nBUM HIP\n\nGasol played after being listed as doubtful before the game with left hip soreness. The hip has bothered him since the closing seconds of a Dec. 15 win over Atlanta. He said it was sore enough when he woke up Saturday that he questioned whether he would play.\n\n\"We need this,\" Gasol said of the victory. \"We need wins, and we need home wins and something to build on. ... Even though I didn't play great, it was worth it because we won.\"\n\nBACK-TO-BACK FATIGUE\n\nThe Clippers won an emotional game in Houston on Friday, expending a lot of energy while scoring 76 points in the second half to erase a 15-points Rockets lead. Doc Rivers was concerned about the impact of Friday's game even before playing the Grizzlies. And the fatigue was a factor.\n\n\"This is the first time in 10-15 games that I can say the other team played harder,\" Rivers said. \"They got to every loose ball. ... I just didn't think we had it.\"\n\nUP NEXT\n\nClippers: Host Sacramento on Tuesday.\n\nGrizzlies: Play the Suns in Phoenix on Tuesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "MomentumShift",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.200312",
  "pipeline_version": "v1"
}