{
  "game_id": "0021400003",
  "espn_id": "400578295",
  "date": "Oct 28, 2014",
  "matchup": "LAL vs. HOU",
  "headline": "Rockets' rout of Lakers marred by injury to Julius Randle",
  "cleaned_body": "LOS ANGELES -- After Lakers rookie Julius Randle left his NBA debut strapped to a wheeled stretcher with a broken right leg, every player at Staples Center gained a sober perspective on the season opener.\nEven ex-teammates Kobe Bryant and Dwight Howard realized their shouting match was particularly inconsequential in the final minutes of the Houston Rockets' blowout win.\nJames Harden scored 32 points, Howard added 13 points and 11 rebounds before getting into an exchange with Bryant, and the Rockets spoiled Bryant's return to the Lakers with a 108-90 victory over Los Angeles on Tuesday night.\nBryant's comeback game and the Lakers' return from a 55-loss season went from bad to miserable when Randle broke his right leg in the fourth quarter. The seventh overall pick out of Kentucky collided with two Rockets under the basket and landed awkwardly, collapsing to the court in agony.\nAfter his own Lakers debut ended somberly, coach Byron Scott described the scene as \"heartbreaking.\"\n\"The last three or four minutes, obviously we weren't thinking a whole lot about basketball,\" Scott added. \"We were just thinking about Julius, and hoping he's OK.\"\nRandle's injury cast a pall over the night for the Lakers, who are banking on the 19-year-old power forward to become a solid player -- perhaps their next star. His right leg was immobilized before his teammates lifted him onto the stretcher, obvious pain on his face, with Bryant squeezing his hand.\n\"We'll help him through this, and he'll come back a better basketball player,\" Bryant said. \"That's the goal, is to try to find a silver lining in this. He'll use the time to come back and be stronger.\"\nBryant scored 19 points in his first game back at Staples Center after missing most of the Lakers' worst season in a half-century with two major injuries.\nA few moments before Randle's injury, Howard and Bryant received matching technical fouls when Howard elbowed Bryant in the face after grabbing a rebound in the fourth quarter, setting off a lengthy stretch of shouting and finger-pointing between the former teammates.\nAlthough teammates stepped between them, Bryant appeared to yell \"Try me!\" at Howard, who wore his usual broad grin while responding.\n\"There's no need to go into it. We won the game,\" Howard said. \"It's over with. It's about basketball. I'm not even focused on it.\"\nHoward spurned Bryant and the Lakers after one season in 2013 to take roughly $30 million less as a free agent in Houston. Scott said the two superstars \"don't like each other,\" a notion that made Bryant laugh.\n\"You can't help but like him,\" Bryant said with a straight face. \"He's a teddy bear. I really mean that. He's a nice kid.\"\nHoward got a flagrant foul for the elbow, and Bryant got a personal foul in addition to their technicals. Both veterans were pulled from the blowout immediately afterward.\nTrevor Ariza and Terrence Jones scored 16 points apiece, while Harden hit three 3-pointers and 15 free throws. Ariza hit five 3-pointers for the Rockets, who took an 18-point lead in the first half and weren't threatened.\n\"We looked pretty good,\" Harden said. \"It was just a matter of time for everybody to get on the court together and execute, and tonight, we did a pretty good job.\"\nJeremy Lin scored seven points against his former teammates in his Lakers debut, struggling to score against Patrick Beverley. Lin is the Lakers' starting point guard after Steve Nash's latest season-ending injury.\nBryant extended his franchise record just by stepping on the court for his 19th season with the Lakers, tying Utah's John Stockton for the most seasons with one team in NBA history. That 19th season is likely to be rocky, although he relishes the chance to play for Scott, the longtime Lakers shooting guard and Inglewood, California, native who got his self-described dream job this summer.\nBryant played just six games last season due to two major injuries, and the Lakers won just 27 games in their worst performance since moving to Los Angeles.\nCarlos Boozer added 17 points in his Lakers debut.\nTIP-INS\nRockets: Rookie Tarik Black scored two points and Kostas Papanikolaou had four in their NBA debuts. Black made the roster as an undrafted free agent out of Kansas. Papanikolaou spent last season with FC Barcelona. ... Jason Terry scored eight points off the bench in his Houston debut.\nLakers: Randle scored two points and second-round pick Jordan Clarkson had eight in their NBA debuts for the Lakers. ... Xavier Henry and Ronnie Price both played despite injuries. Henry missed the entire preseason. ... Kanye West, Kim Kardashian, Will Ferrell, Alibaba founder Jack Ma, Yasiel Puig, Floyd Mayweather Jr., Gerard Butler, Adam Levine and Behati Prinsloo attended the game.\nWHAT'S NEXT\nThe Lakers left shortly afterward for their road opener in Phoenix on Wednesday.\nThe Rockets flew to Utah for another road game Wednesday.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.321989",
  "pipeline_version": "v1"
}