{
  "game_id": "0022101057",
  "espn_id": "401360871",
  "date": "Mar 18, 2022",
  "matchup": "SAC vs. BOS",
  "headline": "Tatum, Brown combine for 62, Celtics beat Kings 126-97",
  "cleaned_body": "SACRAMENTO, Calif. -- — Jayson Tatum made seven 3-pointers and scored 32 points, Jaylen Brown added 30 points and the Boston Celtics beat the Sacramento Kings for the second time this season, 126-97 on Friday night.\n\nPayton Pritchard had 14 points and eight assists as the Celtics won for the seventh time in eight games to remain in fourth place in the Eastern Conference.\n\n“Great energy from the start,” Celtics coach Ime Udoka said. “In general, offense crisp, good focus, regardless of who they were playing, and that’s what we have to do.”\n\nDomantis Sabonis had 30 points and 20 rebounds for slumping Sacramento. The Kings have lost nine of 12 since the All-Star break and seem destined to miss the playoffs for an NBA-record 16th consecutive season.\n\n“We had 12 turnovers for 20 points in the first half. There’s no way to defend that,” Kings interim coach Alvin Gentry said. “We can’t play uphill against this team all the time.”\n\nLike they did in a 53-point win over the Kings in January, Brown and Tatum set the tone while helping the Celtics build an early 23-point lead against a Sacramento defense that left both with open looks much of the night.\n\nBoston’s dominant duo combined for 42 points in the first half on 17-of-23 shooting, then finished the fourth quarter on the bench with the Celtics up by 21.\n\nTatum finished 12 for 16 from the field and 7 for 10 beyond the arc while notching his 24th game with 30 or more points. Brown, who has 13 games with 30 or more, shot 11 for 18.\n\n“We’re much more upbeat,” Tatum said. “We’re having a lot more fun and we’re winning. Once you’re winning that cures a lot of things. It’s always fun playing that way.”\n\nThe Celtics outscored the Kings by 82 points in their two games this season.\n\nBARNES BLANKED\n\nSacramento’s Harrison Barnes did not score in 24 minutes. It’s the first time that Barnes has failed to score while playing 20 minutes or more since Game 3 of the Western Conference finals in 2015. Barnes hadn’t been blanked in the regular season since Nov. 23, 2014.\n\n“We need him and we’re trying to get him going,” Gentry said. “It’s also tough on you when you have an assignment where you’re trying to guard Tatum and Tatum is playing like he is. But we do have to get him going.”\n\nTECHNICAL TIME IN THE THIRD\n\nOfficials handed out three technicals in the third quarter. The Celtics had two (coach Ime Udoka and Grant Williams) and the Kings had one (Sabonis).\n\nHOLMES DONE FOR SEASON\n\nKings forward Richaun Holmes will miss the remainder of the season for personal reasons, the team announced before the game. Holmes, who last played on March 12 against Utah, averaged 23.9 points and seven rebounds in 45 games\n\n“Richaun is a core member of our team, who is very important to our success,” general manager Monte McNair said in a statement released by the Kings. “We fully support Rich and look forward to seeing him back on the court for the 2022-23 NBA season.”\n\nTIP-INS\n\nCeltics: Boston hadn’t won in Sacramento since March 6, 2019.\n\nKings: Point guard De’Aaron Fox did not play after injuring his right hand against Milwaukee on Wednesday. … Sacramento had a 14-0 run in the third quarter.\n\nUP NEXT\n\nCeltics: Continue their road trip against the Nuggets on Sunday. Boston has won the last four against Denver.\n\nKings: Face the Suns at Golden 1 Center on Sunday. The two teams have split two games this season, the home team winning each.\n\n----",
  "tags_rule": [
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.260226",
  "pipeline_version": "v1"
}