{
  "game_id": "0021400646",
  "espn_id": "400578938",
  "date": "Jan 23, 2015",
  "matchup": "CHI @ DAL",
  "headline": "Rose, Butler score 20 each as Bulls top Mavericks 102-98",
  "cleaned_body": "DALLAS --  After Derrick Rose missed a potential clinching shot on a hard drive through the lane in the final seconds, he sealed Chicago's victory by winning a scramble for the loose ball.\n\nThis takedown of a Western Conference playoff contender from Texas was a little tougher than the first, and another sign that the Bulls are putting a rough patch behind them.\n\nRose scored 20 points, Jimmy Butler had 14 of his 20 in the second half and the Bulls beat the Dallas Mavericks 102-98 Friday night.\n\nThe Bulls, losers of six of eight games before a quick Texas two-step, held on in the closing seconds a night after handing defending champion San Antonio its most lopsided loss of the season in Chicago.\n\n\"It means we can beat any team when we put our mind to it,\" Butler said. \"I feel like we're deep and we play hard. And if we do what we're supposed to do, we can beat anybody.\"\n\nDirk Nowitzki scored 24 points to lead the Mavericks, who had won three straight and were trying to get coach Rick Carlisle his 600th career victory.\n\nDallas withstood a 5-minute field goal drought in the fourth quarter to get to 100-98 on a three-point play by Monta Ellis, who was fouled by Taj Gibson on a jumper.\n\nBut after Rose missed in close, he scrambled for the rebound and got the ball to Kirk Hinrich, who tossed it to Pau Gasol. The Mavericks couldn't get the foul until Chandler Parsons finally grabbed Gasol with 0.1 seconds remaining. Gasol made both free throws.\n\n\"That just kind of sums up the entire game as far as offensive rebounds,\" Rajon Rondo said after the Mavericks were outrebounded, 47-30. \"That's been our Achilles heel all night getting rebounds and we can't finish the job in the closing seconds of the game.\"\n\nGasol had 13 points and 16 rebounds, and Joakim Noah added six points and seven boards in his return after missing four games with a sprained right ankle.\n\nRose scored 13 points in the first quarter, including consecutive 3-pointers when he pulled up well behind the line both times to give the Bulls a 22-12 lead.\n\nThe Mavericks twice pulled even in the third quarter but never led because they couldn't win the battle of the backcourts. While Rose and Butler combined for 40 points, Monta Ellis had 17 for Dallas but Rondo scored just six on 3-of-9 shooting with four assists.\n\n---\n\nTIP-INS\n\nBulls: G Mike Dunleavy, close to returning from a right ankle injury, missed his 12th straight game. ... Gibson had 15 points and seven rebounds. ... Rose was 3 of 5 from 3-point range, and Tony Snell was 2 of 4 and scored 10 points. Hinrich made both his attempts as the Bulls shot 56 percent from long range (9 of 16).\n\nMavericks: Devin Harris had a four-point play with Dallas trailing by nine late in the third quarter. He hit a 3 from the left wing, and Hinrich was called for hitting him on the arm. The free throw cut Dallas' deficit to 77-72. ... Tyson Chandler had his 19th double-double with 10 points and 12 rebounds. He also had five blocks. ... Parsons scored 19 but had just one rebound.\n\nNOAH'S RETURN\n\nNoah started and played 23 minutes, with six of his seven rebounds on the offensive end as the Bulls outscored the Mavericks 18-15 on second-chance points. He led the Bulls with two blocks. \"I got a little winded, but it just felt good to be out there,\" said Noah, who has been bothered by the ankle for a month and missed four games in December before returning and tweaking the injury.\n\nSITTING RONDO\n\nMavericks coach Rick Carlisle said it was a coach's decision to sit Rondo in favor of Harris in the closing minutes and wouldn't elaborate. Rondo said he wouldn't seek an explanation. \"If he brings it up, he does,\" Rondo said. \"But it's not something that I'll go to his office and make a big deal about.\"\n\nUP NEXT\n\nBulls: Sunday at home against Miami.\n\nMavericks: Sunday at New Orleans.",
  "tags_rule": [
    "DoubleDouble",
    "PlayoffContext",
    "CoachComment",
    "InjuryReport",
    "ClutchShot"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.970768",
  "pipeline_version": "v1"
}