{
  "game_id": "0021700496",
  "espn_id": "400974448",
  "date": "Dec 25, 2017",
  "matchup": "OKC vs. HOU",
  "headline": "Westbrook scores 31, OKC keeps rolling with win over Rockets",
  "cleaned_body": "OKLAHOMA CITY --  Oklahoma City is starting to have the look of a contender.\n\nRussell Westbrook had 31 points and 11 assists to help the Thunder stay hot with a 112-107 win over the Houston Rockets on Monday night.\n\nPaul George scored 24 points and Carmelo Anthony added 20 for the Thunder, who won their fifth straight game and their 11th in their past 14. Oklahoma City shot 54.4 percent from the field against the Rockets, who entered the day with the best record in the Western Conference.\n\nThe Thunder started 4-7 after acquiring George and Anthony in the offseason, but they've charged back to the center of the West's playoff picture as they've figured out how to distribute the ball among their stars.\n\n\"Every night, teams guard us differently,\" Westbrook said. \"Once we figure that out and see how teams are guarding us -- find ways to make the game easier for (George and Anthony), and that's my job.\"\n\nJames Harden led the Rockets with 29 points, but he made just 7 of 18 field goals. The league's leading scorer was coming off back-to-back 51-point games.\n\n\"Give them credit,\" Harden said. \"They made big-time shots. We had our chances, though. We had several chances, we just couldn't convert and we couldn't get stops when we needed to.\"\n\nTrevor Ariza and Eric Gordon each scored 20 points and Clint Capela added 19 points and 10 rebounds for Houston, which lost its third straight.\n\nHouston point guard Chris Paul sat out with a groin strain. The Rockets are 15-1 when he plays and 10-6 when he doesn't.\n\nThe Thunder held the Rockets below their league-best average of 115.4 points per game. The Rockets made just 12 of 37 3-pointers.\n\n\"I thought tonight we made multiple efforts, which we knew we was going to have to do against a fast-paced team like that, a team that likes to move the ball, play fast, put up a lot of shots, put up a lot of 3s,\" Anthony said. \"We knew that we was going to have to scramble tonight, and I thought we did a great job tonight of not getting frustrated when they did make some tough shots, make some 3s.\"\n\nWestbrook shot 4 for 14 in the first half but made his last two before the break to help the Thunder lead 58-57 at halftime. Harden had 11 points in the first half but made just 1 of 8 shots.\n\nWestbrook broke away for a fast-break dunk to give the Thunder a 65-59 lead early in the third quarter. The Rockets rallied, and the score was tied at 88 heading into the fourth.\n\nHouston had the ball down by three in the final minute. Harden missed a wild 3-pointer while trying but failing to draw a foul, and the Thunder got control in a scramble. Westbrook found Andre Roberson for a layup with 21 seconds left to put the Thunder up 112-107.\n\nWestbrook scored 11 points in just under nine minutes in the fourth quarter.\n\n\"I'm coming,\" he said. \"That's what I bring to the table. Once I hit the floor, it's nonstop.\"\n\nTIP-INS\n\nRockets: Capela returned to the starting lineup. He had missed the previous two games with a left heel contusion. ... Houston committed just one turnover in the first quarter and 14 overall.\n\nThunder: Roberson left in the first quarter but returned later in the period with fingers taped together on his left hand. ... C Steven Adams had 12 points and six rebounds in the first quarter and finished with 15 points and 10 rebounds ... George and Anthony had three fouls in the first half. George finished with five and Anthony with four.\n\nQUOTABLE\n\nAnthony played without his shooter arm sleeves early in the game and didn't feel like himself without them.\n\n\"That wasn't me out there,\" he said. \"Honestly I don't know who that was out there. I swear, I don't know who that was.\"\n\nSTAT LINES\n\nWestbrook, George and Anthony combined to make 16 of 22 field goals in the second half.\n\nUP NEXT\n\nRockets: At Boston on Thursday night.\n\nThunder: Host Toronto on Wednesday night.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .\n\n---\n\nMore AP NBA coverage: https://apnews.com/tag/NBAbasketball .",
  "tags_rule": [],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.735114",
  "pipeline_version": "v1"
}