{
  "game_id": "0021700201",
  "espn_id": "400974952",
  "date": "Nov 14, 2017",
  "matchup": "BKN vs. BOS",
  "headline": "Masked man: Irving returns as Celtics win 13th straight",
  "cleaned_body": "NEW YORK --  Kyrie Irving really dislikes having to play in a mask.\n\nOn the other hand, he loves what comes next: Boston putting its 13-game winning streak on the line against the NBA champions.\n\n\"It's definitely an incredible streak we're on, and now comes the whole media frenzy of will the streak end, and what's going to happen on Thursday and the Golden State Warriors coming to Boston,\" Irving said. \"So I'm looking forward to all that hoopla.\"\n\nIrving returned to the lineup and scored 25 points while wearing the mask, and the Celtics beat the Brooklyn Nets 109-102 on Tuesday night to remain unbeaten since an 0-2 start.\n\nMarcus Morris added 21 points and 10 rebounds, and Jayson Tatum scored 19 points for the Celtics, who have the NBA's best record. Golden State is next at 11-3, and Boston got good preparation for the game against a persistent Brooklyn team.\n\n\"The way that they converted on us in transition after our mistakes tonight, you can't have that against Golden State. You just get blown out of the gym,\" Celtics coach Brad Stevens said. \"We just have to play really solid on both ends and do what we do as well as we can and see where we stand.\"\n\nIrving missed one game with a minor facial fracture after he was hit by teammate Aron Baynes on Friday. He fiddled with the mask frequently, but it didn't seem to affect his play much. He made a jumper with 3:40 left after the Nets had closed within four points and drove for another basket about 35 seconds later.\n\n\"Today, just finding his way and doing what he does, making big plays for us, coming through and sealing the game,\" said Celtics center Al Horford, who had 17 points and 11 rebounds.\n\nBoston then finally put it away with Jaylen Brown's alley-oop feed to Tatum before Irving hit two free throws to make it 106-96.\n\nJoe Harris scored 19 points and Rondae Hollis-Jefferson had 16 points and nine rebounds for the Nets, who are without leading scorer D'Angelo Russell because of a bruised left knee. Allen Crabbe and Caris LeVert added 15 points apiece.\n\nIrving has had to play in a mask before, and he's done it well. He scored a then career-high 41 points in a loss at New York on Dec. 15, 2012, while with Cleveland. But he described it like having foggy blinders, restricting his peripheral vision.\n\nThe Celtics started 7 of 9 from the field to lead 17-4, but the Nets jumped ahead in the second quarter and countered every time Boston threated to pull away until the final minutes.\n\n\"I thought guys competed,\" Nets coach Kenny Atkinson said. \"We just have to do it in long stretches.\"\n\nTIP-INS\n\nCeltics: Irving was not announced as a starter when lineups were introduced, even though coach Brad Stevens had said he would start, after an apparent mix-up between the coach and scorer's table. ... The Celtics have won six straight in Brooklyn, where they were cheered loudly and Irving even heard \"MVP! MVP!\" chants.\n\nNets: Atkinson didn't put a timetable on Russell's return, saying he was getting daily updates. ... Rookie center Jarrett Allen returned after missing six games with a strained left foot.\n\nNOT THE MAN IN BLACK\n\nEven some of Irving's teammates asked him if he would wear the black mask he sported in the 41-point game at Madison Square Garden. Instead, he wore a clear one and said that's lucky for them, because he said the black mask made it so hard to see that passing wasn't much of an option.\n\n\"They were like, `The masked man! The black mask!\" Irving said. \"I was like, `I scored that many because I just was looking at the basket.\"\n\nHOME SWEET HOME\n\nIt was the Nets' first home game in November, having been on the road out West all month. Brooklyn plays just four home games in November. Three are this week, and the Nets host Portland on Nov. 24 before going back on the road for three straight games.\n\nMEXICAN FANS\n\nEntertainers Diego Alfaro and Georgina Holguin from Mexico attended the game to help promote the Nets' upcoming games in Mexico City to their home fans. Brooklyn will play Miami and Oklahoma City in December.\n\nUP NEXT\n\nCeltics: Host Golden State on Thursday night.\n\nNets: Host Utah on Friday night.\n\n---\n\nFollow Brian Mahoney on Twitter: https://twitter.com/Briancmahoney\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.974285",
  "pipeline_version": "v1"
}