{
  "game_id": "0021400268",
  "espn_id": "400578560",
  "date": "Dec 03, 2014",
  "matchup": "MEM @ HOU",
  "headline": "Tarik Black steps up as Rockets hand Griz third loss; streak over at 5",
  "cleaned_body": "HOUSTON -- Houston rookie Tarik Black was booed in his hometown of Memphis when the Rockets played there earlier this season.\nOn Wednesday night, Black got plenty of cheers in helping the Rockets to a 105-96 win over the Grizzlies.\nBlack, who played at the University of Memphis, started in place of injured Dwight Howard and had 10 points and a season-high 11 rebounds for the first double-double of his young NBA career.\nHe said it felt good to have a big game against the Grizzlies.\n\"It did, especially because of the talent they have on that team and how high-caliber of a team it is,\" he said. \"To go out there and perform well against them makes it that much better. Them being my hometown, obviously I want to perform well against them because people are watching back home.\"\nJames Harden scored 21 points, and Trevor Ariza and Jason Terry added 16 each to help the short-handed Rockets cruise to victory.\nThe Grizzlies (15-3) had won five in a row, and their two previous losses this season had been by a combined five points.\nMemphis jumped out to an 8-0 lead in this one but couldn't do much after that. Houston didn't trail after the first quarter.\nMike Conley had 15 points and six assists for Memphis, but also had five of the team's 20 turnovers. Things were much different Wednesday than in the first game against Houston this season which the Grizzlies won 119-93.\n\"A lot of it was effort,\" he said. \"They wanted it a little bit more it seems like tonight. They went after loose balls and offensive rebounds were a big one. They were making all the hustle plays, and those are things that last time we played we won that battle.\"\nThe Rockets led by 12 at halftime and scored the first 10 points of the third quarter to put the game out of reach. The Rockets led 94-68 entering the fourth quarter and neither team's starters played much after that.\nHouston was without three starters, including Howard who missed his seventh straight game with a strained right knee.\nHarden was proud of the way Houston's reserves helped in the win.\n\"Guys stepped up,\" Harden said. \"Everybody played a role (Wednesday) and contributed to the team in a positive way.\"\nThe Grizzlies rediscovered their offense after Houston scored the first 10 points of the third quarter, with Conley breaking an almost four-minute scoring drought with a jump shot with less than 10 minutes left in the quarter. It was the start of an 8-2 run by Memphis, powered by six points from Conley, to cut the lead to 70-54.\nBut they were soon back in their offensive doldrums, with Conley committing turnovers on back-to-back possessions after the Grizzlies missed consecutive 3-pointers. Houston scored nine straight points and made it 79-54 midway through the third.\nThe Rockets were up by eight points in the second quarter before a 10-2 spurt made it 55-39.\nMark Gasol received a technical foul soon after that for slamming the ball down after being called for a charge. Harden made the free throw before a layup by Black left Houston up 58-40.\nThe Grizzlies scored the final six points of the quarter to cut the lead to 58-46 at halftime.\nJoey Dorsey added seven points and eight rebounds to help Black inside with Howard out.\nTIP-INS\nGrizzlies: Gasol tied a season-low with eight points. He said after the game that he bruised his right knee. ... Former Rockets player Courtney Lee scored a season-low four points.\nRockets: Coach Kevin McHale said Patrick Beverley, who has been out five games with a hamstring injury, probably won't play until next Wednesday, and that Howard will be out at least through the weekend. ... There is no timetable for the return of F Terrence Jones, who has missed the last 14 games with nerve damage in his left leg.\nPICK UP THE PACE: Memphis coach Dave Joerger said one of the reasons for his team's great start to the season is that the Grizzlies are playing at a faster pace this year. He said he didn't really talk to them about changing it too much, but simply gave the players a \"gentle nudge\" in that direction. He has seen the change help in many ways.\n\"We're getting easier shots earlier in the clock,\" Joerger said. \"We're not playing up against the clock as much (but) the bigger thing for us is how efficient we are.\"\nUP NEXT\nGrizzlies: Host San Antonio on Friday.\nRockets: At Minnesota on Friday.",
  "tags_rule": [
    "DoubleDouble",
    "CoachComment",
    "EarlyRun",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.639681",
  "pipeline_version": "v1"
}