{
  "game_id": "0021501191",
  "espn_id": "400829078",
  "date": "Apr 09, 2016",
  "matchup": "CHI vs. CLE",
  "headline": "Bulls stay in playoff race, keep Cavaliers from clinching East's No. 1",
  "cleaned_body": "CHICAGO -- The Chicago Bulls keep throwing in teases like this to go with all those flat performances.\nThat might be the most frustrating part about their season, and Jimmy Butler would rather not dwell on it.\n\"What's the sense in talking about it?\" he said.\n\nButler scored 21 points, rookie Cristiano Felicio added a career-high 16 and the Bulls kept their playoff hopes alive with a 105-102 victory over LeBron James and the Cleveland Cavaliers on Saturday night.\nChicago took the lead with a 15-0 run early in the fourth quarter and hung on for the win when J.R. Smith missed a 3-pointer at the buzzer, preventing Cleveland from clinching the No. 1 seed in the Eastern Conference even though James scored 33. The Bulls still need to win their final two games and hope Indiana drops its remaining three in order to avoid missing the playoffs for the first time since 2008.\n\"It shows character. It shows pride,\" Pau Gasol said. \"But it's also very frustrating because if we showed this type of edge and competitiveness every single night, we wouldn't be talking about this.\"\nThe Bulls are a combined 7-1 against the top two teams in the East, taking three of four from the Cavaliers and sweeping four games against Toronto.\nThey took this one even though James had a huge game, hitting 13 of 17 shots -- including 4 of 5 3-pointers. The four-time MVP also grabbed seven rebounds.\nSmith hit seven 3s and scored 24 points, and Kevin Love added 20 points and 13 rebounds.\n\"I like where this team is right now,\" Love said. \"When we have a win-or-die or win-or-go-home mentality, we're going to be really, really hard to beat.\"\nTIGHT FINISH\nThings got real tight in the closing minute when Love hit a 3 and James scored on a layup to cut it to 104-101 with 30 seconds left.\nButler missed a pull-up jumper with about 9 seconds left. Cleveland's Smith grabbed the rebound, got fouled and made the first free throw. He then rebounded his miss on the second attempt, and the Cavaliers worked the ball to Matthew Dellavedova, who shot an air ball attempting a wide-open 3 with 2.5 seconds remaining rather than pass the ball to James at the top of the circle.\n\"One more swing (of the ball), selfishly, I wish I had a look at it the way I was shooting the ball tonight, but Delly left it short,\" James said.\nGasol then hit one of two free throws to put the lead at three before Smith missed the potential tying 3 off an inbounds as time expired.\nFor Chicago, Butler scored 15 in the second half, and Felicio did not miss a shot in the game, going 7 for 7 from the field and 2 of 2 on free throws.\nDECISIVE RUN\nThe Bulls were trailing 84-82 early in the fourth when a cutting Felicio dunked to start that 15-0 run. Felicio also had a driving layup during the spurt, Aaron Brooks added a layup and floater, and Butler buried a fadeaway shot with just under six minutes left to make it 97-84.\nTIP-INS\nCavaliers: G Iman Shumpert (left knee soreness) sat out. ... Coach Tyronn Lue had no update on G Mo Williams, who returned to Cleveland this week for further evaluation on his injured left knee. He did not accompany the team to Chicago.\nBulls: F Taj Gibson (rib contusion) and G E'Twaun Moore (left hamstring) were sidelined.\nUP NEXT\nCavaliers: Host Atlanta on Monday.\nBulls: Visit New Orleans on Monday.",
  "tags_rule": [
    "CareerHigh",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.466406",
  "pipeline_version": "v1"
}