{
  "game_id": "0022100547",
  "espn_id": "401360366",
  "date": "Jan 02, 2022",
  "matchup": "CLE vs. IND",
  "headline": "Mobley, Love help Cavaliers rally past Pacers 108-104",
  "cleaned_body": "CLEVELAND -- — Rookie Evan Mobley had 24 points and nine rebounds, Kevin Love scored 20 points and the Cleveland Cavaliers snapped a three-game losing streak with a 108-104 win over the Indiana Pacers on Sunday night.\n\nJarrett Allen scored 18 points and Lamar Stevens added a season-high 15 for Cleveland, which trailed 84-73 in the third quarter before going on a 17-0 run to take the lead for good. Love scored eight points in a row during the surge.\n\n“Guys are all stepping up in different ways for us, like Lamar when we really needed it in the third quarter,” said Love, who has topped 20 points in five straight games. “We scrapped in the second half and we never really stepped back once we got started.”\n\nDomantas Sabonis had 32 points, 13 rebounds and seven assists for the Pacers, and rookie Duane Washington Jr. scored a season-high 20 points. Indiana has dropped four straight overall and hasn’t won on the road since Nov. 22 in Chicago.\n\nWashington drained a 3-pointer with eight seconds left to pull Indiana within 3 at 107-104, but Brandon Goodwin split a pair of free throws to restore the Cavaliers’ two-possession lead. Cleveland made 7 of 12 foul shots in the fourth quarter.\n\n“Their run at the end of the third was the difference in the game, so that was tough,” Pacers coach Rick Carlisle said. “I’m proud of the way the guys competed all night, which makes this a really disappointing result, given the effort that was given.”\n\nAllen also grabbed 11 rebounds and blocked three shots, while the recently signed Goodwin had seven points and five assists. Cleveland lost shooting guard Isaac Okoro to a left elbow injury due to a pick by Sabonis on a screen.\n\nMobley, the third overall pick from USC, is averaging 20.8 points and shooting 63.3% from the field in four games since exiting the NBA’s health and safety protocols. He made 11 of 16 shots against Indiana.\n\n“We want Evan to shoot the ball more because we believe it’s going in every time,” Allen said. “If he keeps being aggressive, we believe that’s going to help us keep winning games. We really needed this tonight to give us a boost.”\n\nJustin Holiday scored 18 points on six 3-pointers, and 28-year-old rookie Keifer Sykes had 10 points and five assists in his first start for Indiana. Sykes played in South Korea, Turkey, Italy, China, Greece and Australia before signing with the Pacers on Dec. 27.\n\n“Our defense was the reason it slipped away from us,” Holiday said. “Sometimes, you don’t always stay hot offensively, but a few more stops and we win the game.”\n\nPacers guard Caris LeVert and center Goga Bitadze were added to the safety protocols earlier in the day. They have seven players in the COVID-19 program, including Malcolm Brogdon, Chris Duarte and Jeremy Lamb.\n\nHOMECOMING\n\nPacers guard Lance Stephenson signed a 10-day contract Saturday, one day after playing for the Atlanta Hawks in their 121-118 win in Cleveland. Stephenson, who is in his third stint with Indiana, was out of the NBA for two years before joining Atlanta on Dec. 22. “He’s worked incredibly hard for this opportunity, coming back first to the G League (with Grand Rapids),” Carlisle said. “I know he’s going to go at it full bore.”\n\nTIP-INS\n\nPacers: No event was scheduled at Rocket Mortgage FieldHouse on Saturday, allowing Indiana to hold a practice after arriving in Cleveland. “We went through some defensive stuff, offense and defensive stuff again,” Carlisle said. … F Justin Anderson appeared in three games with the Cavaliers before signing a 10-day contract Saturday. ... Indiana has the second-worst road record in the East at 3-14 after losing its last five.\n\nCavaliers: G Darius Garland and F Cedi Osman remain in the COVID-19 protocols. Top scorer Garland missed his fourth straight game, while backup swingman Osman has sat out five in a row. … G Kevin Pangos had seven points in his third consecutive start at the point. The 28-year-old rookie spent the past six seasons playing in Europe. “Kevin has seen a lot and the moments aren’t too big for him,” coach J.B. Bickerstaff said.\n\nUP NEXT\n\nPacers: Visit New York on Tuesday night.\n\nCavaliers: Host Memphis on Tuesday night.\n\n------",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.995921",
  "pipeline_version": "v1"
}