{
  "game_id": "0021400609",
  "espn_id": "400578901",
  "date": "Jan 18, 2015",
  "matchup": "OKC @ ORL",
  "headline": "Thunder blow away Magic to kick off five-game road trip",
  "cleaned_body": "ORLANDO, Fla. -- There's no question the Oklahoma City Thunder have had their struggles at times on the road this season.\nTheir performance against the Magic could be a big step in changing that.\nKevin Durant had 21 points, 11 rebounds and eight assists, and Oklahoma City ran past Orlando 127-99 on Sunday night.\n\nRussell Westbrook finished with 17 points and six assists, and Serge Ibaka and Dion Waiters each added 16 points.\nThe Thunder never trailed, and led by 38 on their way to snapping a four-game road losing streak. They also shot 57 percent in the first of five road games in nine nights.\n\"We started the game with a lot of energy, a lot of effort, the defense was good and we passed the ball really well tonight,\" Durant said. \"Everybody touched the ball. ... We were aggressive attacking the rim and we found the open jump-shooters. We can't look too far down the road; we're always worried about today.\"\nVictor Oladipo led Orlando with 23 points. Elfrid Payton added 19 points and eight assists.\nThe Magic gave up a franchise-record 79 first-half points on their way to dropping their second straight game. The Thunder were also the sixth consecutive opponent to score 100 or more points against them.\nThe Magic appeared to be finding an offensive identity last week when they embraced an up-tempo style and picked up wins over Chicago and Houston.\nBut the Thunder stunted that growth Sunday, scoring the game's first 13 points, and connecting on 25 of their first 32 field goals on the way to building the 38-point lead in the first half. Their field-goal percentage didn't fall below 70 percent until the third quarter.\n\"I thought overall they just gave us an early punch,\" Magic coach Jacque Vaughn said.\nOklahoma City also spread around the ball, getting assists on 18 of 32 field goals. Four players reached double figures in the opening 24 minutes, led by Durant's 16.\nOrlando didn't help itself with 10 first-half turnovers that led to 13 Oklahoma City points.\nOne of the few positives for the Magic was the return of rookie forward Aaron Gordon after a 31-game absence with a fractured left foot.\nBut he played sparingly, keeping with Vaughn's desire not to have him matched up too much defensively with Durant in his first game back. Gordon finished with eight points in 12 minutes.\n\"We did shoot extremely well, and we did play one of our best offensive games we've had all year. We were clicking on all cylinders this time,\" Thunder coach Scott Brooks said. \"We haven't played well in our last three road games, but we came out with a road-trip mentality.\"\n---\nTIP-INS\nThunder: The 79 points in the first half is the most the Thunder have scored in a half since the franchise moved to Oklahoma City. The old record was 74 on March 24, 2010 against Houston. ... The Thunder shot 16 of 21 (76 percent) from the field in the second quarter. ... Durant and Westbrook were both whistled for technical fouls in the third quarter. It was the 10th of the season for Westbrook and third for Durant.\nMagic: Orlando is now 5-17 when an opponent scores 100 or more points. ... C Nikola Vucevic received his second technical foul of the season in the third quarter. ... The old record for points scored by an opponent in a half was 78 by Houston on April 8, 1990. ... F Tobias Harris sat out for the fifth straight game with sprained left ankle.\nUP NEXT\nThunder: At Miami on Tuesday.\nMagic: At Detroit on Wednesday.",
  "tags_rule": [
    "Streak",
    "InjuryReport",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.070267",
  "pipeline_version": "v1"
}