{
  "game_id": "0021300642",
  "espn_id": "400489515",
  "date": "Jan 24, 2014",
  "matchup": "MEM @ HOU",
  "headline": "Chandler Parsons sets record with 10 3s in half in loss to Grizzlies",
  "cleaned_body": "HOUSTON -- Courtney Lee is fitting right in with his new team.\nLee scored 19 points, Zach Randolph added 15 and the Grizzlies held off the Houston Rockets for an 88-87 win on Friday night.\nThe victory helped Memphis improve to 6-2 since Lee joined the team on Jan. 7 from the Celtics as part of a three-team trade.\n\"I'm super comfortable,\" Lee said. \"From Day 1 when I came in, coaches told me to go out and play my game. Everybody that's playing is on the same page. We're just playing the right way.\"\nLee made six free throws on Friday night to remain perfect by making all 22 of his free throw attempts since the trade.\nMike Miller drew an offensive foul to give Houston the ball back with 8.3 seconds left. But Patrick Beverley shot an air ball 3-point attempt under heavy pressure to give the Grizzlies the victory.\nIt is the first win for Memphis over a Southwest Division opponent after it started the season 0-10 in the division.\nThe victory ruined a spectacular night for Houston's Chandler Parsons. He had a career-high 34 points and made 10 3-pointers -- all in the second half. It is an NBA record for 3s in a half and a franchise record for 3s in a game.\n\"I was pretty much unconscious. My body went numb,\" Parsons said when asked about his second-half shooting. \"I've never felt that feeling on a basketball court before.\"\nBut he really couldn't celebrate his big night since it didn't get Houston a win.\n\"It's frustrating,\" he said. \"At the end of the day, you want to win the game no matter how good or bad you play.\"\nA 6-1 run by Memphis gave the Grizzlies an 88-84 lead with about two minutes left. Parsons made his 10th 3 to make it 88-87 right after that.\nHe had his only miss of the second half a few seconds later, and James Harden couldn't get him the ball on the last possession.\nHarden set a career high with 13 assists, but had a tough night shooting. He was just 2 of 11 and finished with 10 points.\n\"Lee was really good and did a good job of staying in front of Harden,\" coach Dave Joerner said.\nThe Grizzlies led by four points when Houston scored five quick points capped by Parsons' ninth 3-pointer to take an 83-82 lead with a little more than four minutes remaining.\nHe was knocked to the ground by Tayshaun Prince as it left his hand and no foul was called. He looked angrily at the nearest official as the crowd erupted when it swished the net.\n\"Chandler kept us in the game,\" coach Kevin McHale said. \"Otherwise, it would have been an 88-70 game.\"\nMemphis outscored Houston 12-7 over the first four minutes of the fourth quarter to take a 76-71 lead.\nThe Rockets scored the first 11 points of the second half to erase a nine-point deficit and take a 46-44 lead with about nine minutes left in the third quarter. Houston -- which had made just one 3-pointer in the first half -- had two during that run. They were both by Parsons, who was 0 for 3 on 3s in the first half.\nMemphis finally ended its offensive drought with a 3-pointer by Prince after that, but Houston responded with a pair of 3s to push the lead to 52-47.\nRandolph scored seven straight points after that to put the Grizzlies back on top 53-52. About a minute later, Lee scored the first five points of a 7-0 spurt to extend the lead to 60-55.\nHouston tied the game at 64-all entering the fourth quarter thanks to 3-pointers on three consecutive possessions by Parsons to end the third and leave him with six in the quarter.\nThe Rockets missed five 3-pointers in that span as part of a 0-for-12 start to 3-point shooting. Omri Casspi made Houston's first one with less than a minute remaining in the first half. They were 1 for 14 on 3s in the first half and trailed 44-35 at the break.\nThe Grizzlies were up by seven points in the first quarter before Houston used a 12-6 run to cut the lead to 21-20.\nGame notes\nGrizzlies G Tony Allen missed his ninth straight game with a sprained left wrist. ... Houston's Terrence Jones returned after missing two games dealing with the flu and a deep thigh bruise and had nine points. ... These teams meet again on Saturday night in Memphis.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.847405",
  "pipeline_version": "v1"
}