{
  "game_id": "0021400695",
  "espn_id": "400578987",
  "date": "Jan 29, 2015",
  "matchup": "CHI @ LAL",
  "headline": "Lakers avoid matching record skid by outlasting Bulls in 2OT",
  "cleaned_body": "LOS ANGELES -- When the Los Angeles Lakers blew a nine-point lead in 70 seconds late in regulation, they certainly seemed to be careening straight toward another loss in overtime.\nThat's when the young, patchwork Lakers discovered a poise they've never had before -- just in time to avoid a historic defeat.\nJordan Hill scored 26 points and forced the second overtime with a clutch jumper, and the Lakers snapped their nine-game losing streak in thrilling fashion with a 123-118 victory over the Chicago Bulls on Thursday night.\n\nWayne Ellington scored 23 points and rookie Jordan Clarkson added 18 for the Lakers, who held off the Bulls for their first victory since Jan. 9. With big late baskets from everybody in their unassuming lineup, the Lakers avoided matching the 1994 squad coached by Magic Johnson for the longest skid in the 16-time champion franchise's history.\n\"We can surprise a lot of people out there if we keep playing like we did tonight,\" Hill said.\nCarlos Boozer had 16 points against his former team for the Lakers, who got their first win since Kobe Bryant was lost for the season with a torn right rotator cuff.\nAnd it was fairly packed with drama. After longtime Lakers big man Pau Gasol tied it with 11 seconds left in regulation, Hill's short hook shot at the buzzer rattled out. Hill hit a tying 20-footer with 16 seconds left in the first overtime, and Derrick Rose badly missed his 20-footer at the first OT buzzer.\n\"It felt good to have the win, but I wish it didn't have to go two overtimes,\" Clarkson said after his latest precocious performance. \"I should have taken care of the ball and been more aggressive, but we got it done.\"\nEllington hit two early shots in the second overtime to put the Lakers up for good. Los Angeles made five of its seven shots in the second OT while holding on.\nAll-Star Jimmy Butler matched his career high with 35 points for the Bulls, who rallied to force the first overtime but couldn't finish it.\n\nGasol had 20 points and 10 rebounds in his Staples Center return against the Lakers, and he forced the first overtime with the tying tip-in.\nRose added 17 points before missing that potential game winner at the first overtime buzzer for the Bulls, who flopped after their thrilling win at Golden State on Tuesday.\n\"In this league, if one team is playing with great intensity and the other one lets up just a slight bit, the players in this league are too good,\" Bulls coach Tim Thibodeau said. \"We've played low-energy (basketball), and then it came down to a miracle comeback to get it to overtime.\"\nLos Angeles led by 15 points in the second half, and Hill's basket with 1:29 left put the Lakers up 98-89. After Butler hit a 3-pointer, two free throws and a breakaway dunk, Gasol leaned over Robert Sacre and tipped in Rose's miss.\nRose's 3-pointer to open overtime gave the Bulls their first lead. Gasol made one free throw with 35 seconds left to put Chicago up 106-104, but Hill drained his long jumper before Rose failed to score on an isolation play.\nTIP-INS\nBulls: Thibodeau said the entire locker room was \"thrilled\" by Butler's selection as an All-Star reserve. \"He has worked extremely hard to put himself in that position,\" Thibodeau said. ... Gasol had 23 points and 13 rebounds when the Bulls beat the Lakers on Christmas in Chicago. ... The Bulls and the NHL's Blackhawks are both in Southern California on long trips while Disney on Ice takes over the United Center. The Blackhawks lost to the Kings in this same building Wednesday.\nLakers: Los Angeles hadn't played a double-OT game since April 22, 2012. ... Nick Young missed his second game with a sprained right ankle. ... Boozer is being paid about $13.5 million not to play for the Bulls this season. Chicago got rid of the power forward using the amnesty clause in July after four seasons together. ... Soccer greats David Beckham and Robbie Keane and MLS commissioner Don Garber all watched the game from courtside.\nPAU'S HOME\nThe Lakers gave a warm pregame video tribute to Gasol, who won two NBA titles in seven seasons in Los Angeles before leaving as a free agent last summer. Gasol got standing ovations in warm-ups and again before the game, when he stepped to center court and waved both arms at fans wearing commemorative gold T-shirts. \"It was tough at first,\" Gasol said. \"So many emotions. And that ovation at the start of the game, it was hard to focus. So it took me a while to kind of get settled into the game.\"\nUP NEXT\nBulls: At Phoenix on Friday.\nLakers: At New York on Sunday.",
  "tags_rule": [
    "MomentumShift",
    "Streak",
    "CoachComment",
    "CareerHigh",
    "InjuryReport",
    "ClutchShot"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.470973",
  "pipeline_version": "v1"
}