{
  "game_id": "0021400787",
  "espn_id": "400579079",
  "date": "Feb 10, 2015",
  "matchup": "LAL vs. DEN",
  "headline": "Lawson powers Nuggets to 106-96 win over Lakers, ending skid",
  "cleaned_body": "LOS ANGELES --  The Denver Nuggets are heading into the All-Star break feeling a bit better about themselves.\n\nTy Lawson tied his season-highs with 32 points and 16 assists, leading Denver to a 106-96 victory over the Los Angeles Lakers on Tuesday night that snapped the Nuggets' six-game skid.\n\n\"That steak is going to taste a little bit better for a while until we get back to the grind,\" Lawson said.\n\nDarrell Arthur added 15 points, and Wilson Chandler and J.J. Hickson had 13 points each for the Nuggets, whose four-game road losing streak ended.\n\n\"We've been stuck in the mud for a while now, so it just feels good to be back in the winning side,\" Denver coach Brian Shaw said, \"especially the last game going into the break.\"\n\nThe Nuggets twice erased double-digit deficits.\n\n\"It was tough, especially in the first half,\" Lawson said. \"Coming off a back-to-back, everybody's legs were kind of dead. I mean, that's no excuse, but a lot of our shots were short. We're a tough-minded team and we've been down a lot this year, so we've learned how to come back and make a game of it.\"\n\nCarlos Boozer scored 15 of his 21 points in the second half and grabbed 10 rebounds, and Wayne Ellington added 18 points for the Lakers, who fell to 0-5 this month.\n\nThe Kobe Bryant-less Lakers were coming off an 0-4 trip during Grammy Awards week. Jeremy Lin and Wesley Johnson added 12 points each.\n\n\"We got to stay positive,\" Lakers coach Byron Scott said. \"This is still a work in progress.\"\n\nThe Lakers trailed for much of the fourth, when Hickson, Lawson and Arthur did most of Denver's scoring. Leading by one, Arthur ran off seven straight to give the Nuggets an 86-79 lead. Randy Foye followed with a 3-pointer and Lawson scored four straight, extending Denver's largest lead to 10.\n\nLos Angeles rallied to get to 95-94 on six straight points, including four in a row by Johnson. But the Nuggets controlled the final 2 1/2 minutes. Lawson scored 15 of their last 17 points and closed out the win with a 3-pointer.\n\n\"The last three or four minutes we have no confidence,\" Scott said. \"We're just waiting for the wheel to fall off. Guys are looking at the clock like, `Please run out.\"\n\nLawson sparked the Nuggets in the third, scoring 10 of their 12 points during a 12-2 run that gave Denver a 63-61 lead. From there, neither team led by more than four. Nick Young scored the Lakers' last four points to tie the game 71-all going into the fourth.\n\n\"They got us on our heels and we didn't respond as well as we'd like,\" Ellington said. \"We got to figure out how to close it out. We're ahead and we always find a way to let a team back in.\"\n\nTIP-INS\n\nNuggets: G Jameer Nelson sat out his fourth straight game with a strained left Achilles. He briefly practiced the other day and has had persistent soreness since then. \"I joked with him that he's 32 and he's getting up there, and he doesn't heal as well as he used to,\" Shaw said. \"He'll aggressively continue to do his rehab over the break.\"\n\nLakers: Lin had five turnovers, which Scott blamed on \"bad decisions. A lot of it is dribbling into traffic.\" ... G Jordan Clarkson had a career-high seven assists. ... The Lakers fell to 7-18 at home. ... Denzel Washington (caught on the video board putting a $100 bill into his wallet), Red Hot Chili Peppers bassist Flea and former Laker Ron Artest, wearing a panda T-shirt and cap, attended.\n\nSTRUGGLING EXES\n\nScott, Shaw and Knicks coach Derek Fisher -- a trio of former Lakers players -- are each in charge of losing teams this season.\n\n\"None of us are used to being in these kind of situations,\" Shaw said. \"Byron's obviously been at it a little longer as a coach and been in some different situations. But these are all tests. We all have the work ethic and we all have the pedigree. So we all just need a little patience for things to change and get it going in the right direction.\"\n\nFINING NICK\n\nYoung was fined for showing up late, something he's done before this season.\n\n\"He's tried to sneak in a few times and that didn't work,\" Scott said.\n\nYoung's shooting has slumped lately, four games since returning to the lineup after not dressing and not playing in two straight games.\n\nAsked where Young's mind is these days, Scott said, \"I don't want to get into where Nick's mind is. I just want him to get back to where he was.\"\n\nUP NEXT\n\nNuggets: After the All-Star break at Milwaukee on Feb. 20.\n\nLakers: At Portland on Wednesday in the second half of a back-to-back.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.276624",
  "pipeline_version": "v1"
}