{
  "game_id": "0021200262",
  "espn_id": "400277982",
  "date": "Dec 05, 2012",
  "matchup": "CHI @ CLE",
  "headline": "Marco Belinelli nets season-high 23 as Bulls clip Cavs",
  "cleaned_body": "CLEVELAND --  The Chicago Bulls got a boost from an unexpected source Wednesday night.\n\nMarco Belinelli, starting his second straight game in place of injured shooting guard Richard Hamilton, scored a season-high 23 points, and the Bulls took control early on to beat the Cleveland Cavaliers 95-85.\n\nBelinelli helped the Bulls bounce back from a four-point home loss to Indiana on Tuesday, a game in which he scored only six points in 24 minutes. He looked like a different player against the Cavaliers, going 7 for 15 from the field.\n\n\"Marco scored in different ways tonight,\" Chicago coach Tom Thibodeau said. \"He drove, he got to the line, he was able to catch-and-shoot. He's a very good catch-and-shoot player, so we wanted to play off that. Each day, he's playing better.\"\n\nAdded Belinelli: \"It was good for me to get going early, and my teammates looked to find me, which was good. I was just going to be aggressive and keep trying my best.\"\n\nLuol Deng added 22 points for Chicago, which went ahead for good less than two minutes in and shot 66.7 percent in the first quarter.\n\nThe Cavaliers have lost 13 of 15 and are 2-7 since point guard Kyrie Irving broke his left index finger last month. Anderson Varejao recorded his 10th straight double-double with 11 points and 15 rebounds -- his 10th straight game with at least 15 boards.\n\nCleveland played without Irving and Dion Waiters, its two leading scorers. Waiters missed his second straight game with a sprained left ankle. Irving, the reigning rookie of the year, averages 22.9 points and Waiters 15.2.\n\n\"We've got to play a damn near perfect game on both ends of the floor,\" Cavaliers coach Byron Scott said. \"The effort has been great. It was great tonight. We're just going to keep working. That's the only thing we can do.\"\n\nDonald Sloan scored a season-high 14 points to lead Cleveland.\n\nAll five Chicago starters reached double figures. Joakim Noah had 13 points and 15 rebounds, Kirk Hinrich scored 11, and Carlos Boozer had 10 points and 12 boards.\n\nCleveland has dropped 10 consecutive games against Chicago.\n\nBoth teams were shorthanded in the backcourt. The Bulls again played without Hamilton, who sustained a left plantar fascia tear in Saturday's game against Philadelphia. He missed Tuesday's and could be sidelined for two weeks.\n\nChicago, which moved one game over .500, has played the entire season without point guard Derrick Rose, who underwent reconstructive surgery on his left knee during last season's playoffs.\n\n\"It takes time, but we're getting there,\" Deng said. \"We've got a lot of guys who are new to the system.\"\n\nWhile the Bulls, who had the best regular-season record in the Eastern Conference a year ago, can withstand injuries to key players, the Cavaliers aren't at that stage. Scott, however, won't use injuries as an excuse.\n\n\"It's the NBA,\" he said. \"We're not the only team going through having some guys who are hurt that you wish were out there. We'll play the guys we have available. We're not going to cry about the guys who aren't here.\"\n\nCleveland was plagued by a slow start for the second straight game. The Cavaliers led 4-3, but it didn't take long for the Bulls to seize control. Chicago led 19-8 with just more than four minutes to play in the quarter. The Bulls were 12 of 18 from the field in the period and led 27-11 going into the second quarter.\n\nCleveland trailed 30-17 after one quarter in Tuesday's loss to Detroit. The Bulls built a 45-27 lead, but the Cavaliers scored the last eight points of the quarter to trail by 10 at halftime. Cleveland briefly cut the lead to five and trailed 72-63 going into the fourth quarter. The Bulls maintained a double-figure lead for most of the final period.\n\nNoah was hit with a technical for arguing a foul call against teammate Taj Gibson in the fourth quarter. Cleveland guard Jeremy Pargo was also given a technical for throwing the ball off Belinelli's face later in the quarter. Belinelli fouled Pargo going to the basket, after which Pargo tossed the ball behind him, hitting the Chicago player.\n\nGame notes The Bulls haven't lost a regular-season game to the Cavaliers since March 19, 2010. Cleveland beat Chicago in the first round of the playoffs that season ... Chicago, in a stretch of four games in five nights, plays at Detroit on Friday. ... Cleveland travels to Minnesota on Friday.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.425374",
  "pipeline_version": "v1"
}