{
  "game_id": "0022100518",
  "espn_id": "401360337",
  "date": "Dec 29, 2021",
  "matchup": "LAC @ BOS",
  "headline": "Eric Bledsoe has big 4th quarter, Clippers hold off Celtics",
  "cleaned_body": "BOSTON -- — Eric Bledsoe scored 10 of his 17 points in the fourth quarter, hitting a key 3-pointer down the stretch, to help the Los Angeles Clippers beat the Boston Celtics 91-82 on Wednesday night.\n\nMarcus Morris had 23 points and 10 rebounds, and Terance Mann and Luke Kennard each added 17 points for the Clippers. Los Angeles ended a two-game skid and completed a season sweep of the Celtics on a night both clubs were short-handed.\n\n“They showed their vet savvyness,” Mann said about Bledsoe and Morris. “They showed why they’re long-time players in this league. They helped close the game out for us. They showed what they do best.\"\n\nJaylen Brown led Boston with 30 points. Robert Williams had 16 points and 14 rebounds, and Al Horford added nine points with 10 rebounds for the Celtics, who couldn't overcome a woeful shooting night from three-point range. Boston made just 4 of 42 3-pointers and was 1 for 18 from beyond-the-arc in the fourth quarter.\n\n\"We missed a lot of easy looks,\" said Brown, who went 1-for-13 on 3-pointers.\n\nThe Clippers were without star forward Paul George for a third straight game with a torn ligament in his right elbow that could keep him out up to a month. But Los Angeles, which had lost five of six, led most of the game.\n\nBoston was missing scoring leader Jayson Tatum, who was placed on the COVID-19 health and safety protocols list on Monday, and starting guard Marcus Smart, who was out with a hand injury.\n\nDown 10 early in the third quarter, the Celtics used a 12-2 run midway through the quarter to tie it at 57. The Clippers took a 69-63 lead into the fourth.\n\nBoston opened the fourth quarter on a 9-2 run, pulling to 71-70 on a pair of free throws by Brodric Thomas and taking a one-point lead on a putback by Romeo Langford with 9:30 left to play. The Clippers regained control, with Bledsoe hitting a 3-pointer from the top of the key for an 86-78 lead with 2:05 left.\n\nBoston coach Ime Ukoda said the shooting woes were a combination of factors, including trying to get the Clippers out of their zone defense that was so effective with Boston missing shot after shot.\n\n“That’s what they’re trying to do — protect the paint and make us take those threes,” Ukoda said.\n\nHOME COURT\n\nMann, who grew up nearby in Lowell, Mass., said he had played at TD Garden before but this was his first start as a pro in Boston. He said he had nearly 50 people in the stands, spread out throughout the arena to cheer him on.\n\n“It’s a dream come true,” Mann said. “I used to come here and sit all the way at the top in the halo and wish that I could be on that floor one day and I am. To start in front of almost 50 people ... is amazing.\"\n\nOUCH\n\nRobert Williams needed a few minutes after landing hard face-first while diving for a loose ball with 5:49 left in the fourth. Williams was able to get back to his feet and received an appreciative ovation for the hustle play as he headed to the locker room. Williams was back within a few minutes and checked back into the game with 2:45 remaining. Williams had 10 of Boston's 21 offensive rebounds.\n\nTIP-INS\n\nClippers: Ivica Zubac had 14 rebounds. ... Morris, who played two seasons for Boston, made five of his first six shots and led all scorers with 12 points in the first quarter. The Clippers won the first meeting 114-111 on Dec. 8 after being swept by Boston last season. ... G Reggie Jackson, missed his fourth straight game after being placed on the COVID-19 safety protocol list last week. G Jay Scrubb, F Moses Wright and G Brandon Boston Jr. were also on the protocol list and F Nicolas Batum missed his second straight game with a right ankle sprain.\n\nCeltics: In addition to Tatum missing his second game of the season, Boston was also without G Marcus Smart for the second straight game because of a cut on his hand. Boston still had a long list of players on the safety protocol list with five others — C Bruno Fernando, C Enes Freedom, G C.J. Miles, F Aaron Nesmith and G Dennis Schroder.\n\nUP NEXT\n\nClippers: At Toronto on Friday night.\n\nCeltics: Host Phoenix on Friday.\n\n----",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.728285",
  "pipeline_version": "v1"
}