{
  "game_id": "0022100103",
  "espn_id": "401359927",
  "date": "Nov 02, 2021",
  "matchup": "MIL @ DET",
  "headline": "Antetokounmpo leads Bucks in 117-89 rout of Pistons",
  "cleaned_body": "DETROIT -- — Giannis Antetokounmpo had 28 points, nine assists and eight rebounds as the Milwaukee Bucks ended a three-game losing streak with a 117-89 rout of the Detroit Pistons on Tuesday.\n\n“Thank God we won a game,” Antetokounmpo said with a grin. “I was worried we were going to start tanking for the No. 1 pick.”\n\nWith Brook Lopez (back) sidelined, Antetokounmpo spent much of the time playing center on defense. He blocked four shots but doesn't want to stay at the new spot.\n\n“I learned today that I hate playing (center),\" he said. “I have never appreciated Brook as much as I do tonight. Please come back soon, Brook.”\n\nThe Bucks also got 16 points from Pat Connaughton and reserve Jordan Nwora.\n\n“We really needed this one tonight,” Bucks coach Mike Budenholzer said. “We talked about setting the tone on both ends of the floor, and I thought we did that. Obviously, Giannis was a big part of that, but we saw a lot of other guys stepping up.”\n\nJerami Grant led the Pistons (1-6) with 21 points, but Trey Lyles was the only other player to reach double figures with 13.\n\n“We know this is all part of the growing pains that a young team has to deal with,” Grant said. “That doesn't make it any easier to go through what we're going through. We need to get focused tomorrow, because we've got a back-to-back coming up against pretty good teams.”\n\nCade Cunningham, the No. 1 pick in this summer's draft, went 2 for 14 in his second NBA game, including 0 of 9 from behind the 3-point line. He is shooting 13.6% (3 of 22) thus far and has missed all 14 3-point attempts.\n\n“This was the young man's second NBA game after being out for a month with a sprained ankle,” Pistons coach Dwane Casey said. “Right now, we're just trying to help him knock off the rust and get him some confidence in his shot.”\n\nThe Pistons stayed close early, only trailing 36-31 in the second quarter, but they couldn't score consistently against Milwaukee's defense. The Bucks finished the half with a 21-8 run to take a 57-39 lead.\n\nAntetokounmpo, who played 27 minutes total, had 12 points and seven rebounds in the first half, as the Bucks outshot Detroit 47.8% to 34.1%.\n\n“I thought we got off to a great start on the defensive end, and it built from there,” Connaughton said. “When we play that well on both ends of the floor, we are a dangerous team.”\n\nGrant had 14 points in the half, including 3 3-pointers, but his teammates went 2 for 19 from behind the arc.\n\n“We took 47 3-pointers today, which is about where we need to be,” Casey said. “But you can't win by only making eight of them. We're getting good looks — we're taking shots I want us to take — but we just don't have a lot of confidence right now.”\n\nThe Bucks expanded their lead to 29 points in the third quarter and cruised to the easy win.\n\n“The starters went in there and did their jobs, which meant I was able to get them out of there earlier than normal,” Budenholzer said. “They didn't want to run any more than they needed to run.”\n\nCUNNINGHAM’S SLOW START\n\nCunningham’s 0-for-14 start on 3-pointers is the longest drought to start a career since Grant Williams went 0 for 25 in his first 20 games for the Boston Celtics in 2019-20. Cam Reddish also started 0 for 14 that season in four games for the Atlanta Hawks.\n\nTIP INS\n\nBucks: Milwaukee beat the Pistons for the 11th straight time in the regular season, and lead the overall series 140-112.\n\nPistons: Since winning their only game of the season on Oct. 30 against Orlando, the Pistons are 0-2 with an average margin of defeat of 27 points.\n\nUP NEXT\n\nBucks: Host the New York Knicks on Friday night.\n\nPistons: Host the Philadelphia 76ers on Thursday night.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.959960",
  "pipeline_version": "v1"
}