{
  "game_id": "0022100481",
  "espn_id": "401360305",
  "date": "Dec 23, 2021",
  "matchup": "MIL @ DAL",
  "headline": "Middleton, Bucks top Mavs 102-95 with pair of superstars out",
  "cleaned_body": "DALLAS -- — Khris Middleton and the Milwaukee Bucks have won more than they've lost in five games with Giannis Antetokounmpo in the COVID-19 protocols, thanks to two wins in Texas on a back-to-back.\n\nMiddleton scored 26 points and the Bucks beat the Dallas Mavericks 102-95 on Thursday night with the superstar for each team sidelined because of COVID-19.\n\nWhile the Bucks were without their two-time MVP because of health and safety protocols, Luka Doncic sat for the first time for that reason for Dallas.\n\nThe Mavericks had been hopeful their 22-year-old sensation could return against the reigning NBA champions after missing five games with left ankle soreness. Instead, Doncic is one of seven Dallas players out for COVID-19 reasons.\n\nThe Bucks weathered a stretch of 15 consecutive missed shots bridging the first and second quarters, finally getting a cushion midway through the fourth after leading by one going into the final quarter.\n\n“This is a good win,” said coach Mike Budenholzer, whose team was playing a night after a 126-106 win in Houston. “On the road, back to back, a lot of hits to the roster. It was an ugly first half. But our guys found a way to kind of hang in there, stay close.”\n\nDoncic backup Jalen Brunson scored 19 points, again leading the Mavericks in the two-time All-Star's absence.\n\nJrue Holiday scored 24 points and DeMarcus Cousins had a season-high 22 points and eight rebounds as the Bucks improved to 3-2 since Antetokounmpo entered the protocols.\n\nWhile Middleton was 8 of 14 from the field, made all eight free throws and had seven assists in his second game back for Milwaukee after missing three with a left knee injury, the Mavericks were without their second-leading scorer in Kristaps Porzingis.\n\nThe oft-injured, 7-foot-3 Latvian missed a second consecutive game with a right toe injury and has been sidelined for nine games with three different injuries this season. Porzingis also had back and knee issues.\n\nThe Mavericks have six players on 10-day contracts under the COVID-19 allowance after adding four since beating Minnesota without three of their top four scorers Tuesday.\n\nDallas couldn't do it again.\n\nFive of the short-notice additions played against the Bucks, who are without another double-figure scorer in Bobby Portis Jr. and made their first move under the COVID-19 guidelines Thursday by signing Javin DeLaurier. He didn't play.\n\n“You give them a fair opportunity to fight,” coach Jason Kidd said of the Dallas replacements. “In the last two games, they did. For the guys that it’s their second day, or second game, they did everything they could. And for the new guys, they’ve got to get their feet settled. Unfortunately, they’re on a clock. Against the world champs, believe it or not, we were in the game.”\n\nMarquese Chriss led the newcomers with 13 points before fouling out, while all five Dallas starters scored in double figures, including Sterling Brown with 10 points and 13 rebounds. But the Mavericks shot 27% from 3-point range, with Dorian Finney-Smith and Frank Ntilikina combining to go 4 of 19.\n\nTIP-INS\n\nBucks: There were no other players in double figures, but Pat Connaughton scored seven of his nine points in the fourth quarter.\n\nMavericks: Porzingis was listed as questionable and went through his pregame warmup routine before getting ruled out. Dallas coach Jason Kidd said the toe injury is improving. ... F Eugene Omoruyi had surgery on his right big toe and is unlikely to return this season. The undrafted rookie from Oregon saw limited action in four games. ... This was Kidd's first meeting with Milwaukee as a head coach since the Bucks fired him midseason in 2017-18.\n\nUP NEXT\n\nBoth teams are part of the Christmas Day lineup Saturday.\n\nMilwaukee: At home against Boston, looking to keep the Celtics from clinching the season series. Boston won the first two meetings at home.\n\nDallas: At Utah in the final game of the day. The Mavericks lost both in a two-game set at the Jazz last season.\n\n------",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.658328",
  "pipeline_version": "v1"
}