{
  "game_id": "0022100386",
  "espn_id": "401360210",
  "date": "Dec 10, 2021",
  "matchup": "MIL @ HOU",
  "headline": "Milwaukee ends Houston's 7-game streak with 123-114 win",
  "cleaned_body": "HOUSTON -- — Giannis Antetokounmpo had 41 points and 17 rebounds, and the Milwaukee Bucks snapped the Houston Rockets' seven-game winning streak with a 123-114 victory Friday night.\n\n“I was just looking to be aggressive,\" he said. “Last game I wasn’t as aggressive as I wanted.\"\n\nHouston hadn't fallen since ending a 15-game losing streak No. 24. The Rockets led by 10 at one point Friday and hung around until the Bucks pulled away in the fourth.\n\nEric Gordon's 3-pointer got Houston within 1 before Khris Middleton scored the last five points of a 7-0 stretch to extend Milwaukee's lead to 117-109 with about four minutes to go.\n\nHouston scored the next three points, with a layup by Christian Wood. But Jrue Holiday intercepted a bad pass by Garrison Mathews and dished it to Antetokounmpo for a dunk that made it 119-112 with less than a minute left and sent fans toward the exits.\n\nMilwaukee coach Mike Budenholzer was asked about the play of Antetokounmpo and Middleton down the stretch.\n\n“When you have a good team and have players like that, you’re fortunate to put the ball in their hands and let them make plays,\" he said.\n\nMathews led the Rockets with a season-high 23 points and made a career-best six 3-pointers. Wood and Armoni Brooks had 21 apiece for Houston.\n\nJae'Sean Tate had six points for Houston with nine assists and a steal.\n\n“He’s very much the pulse and heart and soul on what we have going on,\" coach Stephen Silas said.\n\nBobby Portis and Middleton added 21 points each for Milwaukee as the Bucks won for the 11th time in 13 games.\n\nBudenholzer raved about the defense of Wesley Matthews, who was signed less than a week ago.\n\n“He just has that focus that I think you need,\" he said. “He’s delivered early in a good way and we’re excited that we have everything he brings to the table. I thought he was huge tonight.\"\n\nMilwaukee trailed by eight early in the fourth quarter before scoring the next 10 points, capped by a 3 from Antetokounmpo, to take a 100-98 lead with about 8 ½ minutes remaining.\n\nGordon ended Houston’s scoring drought a few seconds later when he made a 3.\n\nHouston led by seven at halftime, but the Bucks opened the third quarter with a 10-3 run to tie it at 68 with about 9 ½ minutes left in the third quarter.\n\nThe game was tied again about two minutes later when a dunk by Antetokounmpo put the Bucks up 75-73.\n\nHoliday made two free throws to get Milwaukee within two late in the third quarter, but Josh Christopher hit a 3 for Houston to extend the lead to 95-90 entering the fourth quarter.\n\nTIP-INS\n\nBucks: Budenholzer received a technical in the second quarter for yelling at officials about a foul call. ... G George Hill missed his fourth straight game with a hyperextended right knee. ... Holiday scored 12 points with seven assists.\n\nRockets: G Jalen Green was out for the seventh consecutive game with a strained left hamstring. ... G Kevin Porter Jr. missed a third straight game with a bruised left thigh. ... F Danuel House sat out for a second game with a sprained left ankle.\n\nBLOCK PARTY\n\nAntetokounmpo had two blocks to give him 805, passing Alton Lister (804) for most in franchise history.\n\nHe set the record when he stuffed a layup by rookie Alperen Sengun midway through the second quarter.\n\n“It’s big time, a great compliment to my career, but I’ve got to keep getting better, keep defending better,\" Antetokounmpo said.\n\nSENGUN'S NIGHT\n\nSengun scored a career-high 15 points for Houston, but Silas kept him on the bench for the last few minutes of the game.\n\n“I wanted to figure out a way to keep him in the game, but when they have Giannis at the 5, it was hard,\" Silas said.\n\nUP NEXT\n\nBucks: Visit the Knicks on Sunday.\n\nRockets: Visit Memphis on Saturday night.\n\n----",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.949956",
  "pipeline_version": "v1"
}