{
  "game_id": "0021400704",
  "espn_id": "400578996",
  "date": "Jan 30, 2015",
  "matchup": "CHI @ PHX",
  "headline": "Bledsoe, Dragic team for 44 points as Suns beat Bulls 99-93",
  "cleaned_body": "PHOENIX --  As they have so often this season, Eric Bledsoe and Goran Dragic pushed the Phoenix Suns to victory.\n\nBledsoe scored 23 points and backcourt mate Dragic had 21 as the Phoenix Suns held off the Chicago Bulls 99-93 on Friday night.\n\n\"It's a hard matchup when you have two point guards on the floor at all times,\" the Bulls' Derrick Rose said. \"...They are a hard team to defend, the way they play. We did a poor job of getting back in the first half. In the second half, we came back a little, but it was too late.\"\n\nBledsoe's six-footer high off the glass put the Suns up 97-93. It came after a 7-0 Chicago run that cut the lead to 95-93 on Aaron Brooks' layup with 31.9 seconds to go.\n\nMarkieff Morris had 12 points and as season-high 14 rebounds for the Suns. His twin brother, Marcus, also scored 12.\n\nDerrick Rose scored 23, Jimmy Butler, 22, and Brooks, 21, for the Bulls, who were coming off a double-overtime loss to the Lakers in Los Angeles Thursday night and didn't arrive in Phoenix until 3:30 a.m. on Friday.\n\n\"And they still played hard,\" Dragic said. \"It was just amazing to me. Everybody is a professional over there.\"\n\nBut \"fatigue was a factor, no question about it,\" Chicago's Pau Gasol said. \"It wasn't going to be an excuse, but you try to fight through and give ourselves a chance. It's a tougher game that we've played just because we didn't have much left in the tank, but we gave it a good shot.\"\n\nPhoenix finished 6-2 in a franchise-record eight-game homestand.\n\nThe Suns led nearly the entire game and were up by 16 in the second quarter before a 22-6 run gave the Bulls their only lead since the opening minutes on Kirk Hinrich's four-footer with 36 seconds left in the third.\n\nBrandan Wright's layup put the Suns up 68-67 entering the fourth.\n\nDragic's layup after a slick pass from Markieff Morris gave Phoenix a 95-86 lead with 2:24 to play. Chicago scored the next seven, including a 3-pointer and layup by Brooks, before Bledsoe and the Suns put it away.\n\n\"I thought our defense played great tonight,\" said Phoenix coach Jeff Hornacek. \"They challenged just about every shot. ... Overall, it was a great game. We didn't shoot the ball particularly well but we made them in the fourth quarter when we needed it.\"\n\nTIP-INS\n\nBulls: Missed their first seven free throws. ... Chicago is 1-2 halfway through a six-game road trip. ... Jimmy Butler tweaked his knee in the loss to the Lakers but was back in the lineup on Friday.\n\nSuns: Dragic and Bledsoe got his16th 20-point game of the season. ... Phoenix is 16-6 since going to the starting lineup of Dragic, Bledsoe, Alex Len, Markieff Morris and P.J. Tucker.\n\nCOACH'S DECISION\n\nGerald Green, the streak-shooting guard who usually is one of the first players off the Suns bench, didn't play at all.\n\nHornacek said it was just the way the rotation went and was nothing calculated.\n\n\"I wanted Goran and Eric in there most of the time and then with Isaiah (Thomas) taking some of those minutes, we just kind of squeezed him tonight,\" Hornacek said. \"But tomorrow night could be his night where he plays a lot of minutes and does a great job for us.\"\n\nUP NEXT\n\nBulls: At Houston on Wednesday.\n\nSuns: At Golden State Saturday night.",
  "tags_rule": [],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.664872",
  "pipeline_version": "v1"
}