{
  "game_id": "0022100317",
  "espn_id": "401360141",
  "date": "Nov 30, 2021",
  "matchup": "DET @ POR",
  "headline": "Trail Blazers snap 3-game skid with 110-92 win over Detroit",
  "cleaned_body": "PORTLAND, Ore. -- — Ben McLemore found out when he came to the Moda Center on Tuesday afternoon that he'd likely be seeing playing time for the Trail Blazers.\n\nWith Portland missing several players, McLemore had 17 points off the bench and the Blazers handed the Detroit Pistons their seventh straight loss with a 110-92 victory.\n\nMcLemore, a veteran who joined the Blazers in the offseason, had played in just six previous games with the team.\n\n“It's something that I've built up over the course of the years, of just having a switch on when they tell me, `Hey, tonight's the night,” McLemore said.\n\nCJ McCollum led all scorers with 28 points for the Blazers, who snapped a three-game losing streak. Portland has won 10 straight at home for the first time since 2009.\n\nDetroit rookie Cade Cunningham finished with a season-high 26 points, including five 3-pointers. The Pistons have won just four games this season.\n\nBoth teams were playing the second of back-to-backs. The Blazers fell 129-107 at the Utah Jazz on Monday night, while the Pistons were coming off a 110-106 loss at the Los Angeles Lakers.\n\n“When adversity hits with a young team you either join the fight or you step back. I thought tonight we stepped back, where in Los Angeles we joined the fight and competed even when things were going bad,” Pistons coach Dwane Casey said.\n\nThe Blazers were without three key players. Damian Lillard missed the game to manage the abdominal tendinopathy that has bothered him this season, fellow starter Norman Powell has right quad contusion and Nassir Little has a left ankle sprain.\n\nAnfernee Simons started for Lillard, while Tony Snell took Powell's place in the lineup. Simons finished with 12 points and six rebounds.\n\nPortland led by as many as 26 points in the game. McCollum's layup put the Blazers up 36-44 and they went on to lead 54-45 at halftime.\n\nRobert Covington's 3-pointer pushed the Blazers' lead to 65-50 in the third quarter. McLemore hit a 3-pointer and Portland had a 83-62 advantage going into the final period.\n\nMcLemore finished with four 3s. He played 18 minutes.\n\n“He's just a pro, man. He shows up every single day, he never knows when he's going to play. He's rooting for the team when he doesn't play. He's offering advice to the guys that come out of the game and their upset, even when he knows he's not going to play,\" Blazers coach Chauncey Billups said. \"That's what this league should be about.”\n\nThe Pistons fell to 2-9 on the road.\n\n“We're trying to get our energy right, trying to get each other going, but we've just got to keep working at it more than anything,” Cunningham said.\n\nMR. BIG SHOT\n\nFor Billups, it was the first time facing his former team as a head coach. Billups was with 2004 NBA Finals MVP for the Pistons when they won the league title. Detroit retired his jersey in 2016.\n\n“Every time I get an opportunity to play, or coach, or be in contact with the Pistons, it’s always special to me,\" Billups said. \"Everyone knows my feelings on the organization, the city and the fans there.”\n\nBillups is in his first-year as a head coach.\n\nTIP INS\n\nPistons: Trey Lyles has averaged 15 points and 6.3 rebounds in his last three games. ... It was the fourth of a five-game trip for the Pistons. ... Isaiah Stewart finished with 15 points and 13 rebounds.... Cunningham had five of the Pistons' nine 3-pointers. They shot just 25.7% (9-of-35) from the perimeter.\n\nTrail Blazers: Portland Timbers forward Yimmi Chara was at the game. The Timbers play Real Salt Lake on Saturday in the Major League Soccer playoffs. The winner of the game will advance to the league championship. ... With his ninth point of the night, McCollum moved into fifth on the Blazers’ all-time scorers list.\n\nUP NEXT\n\nPistons: Conclude the trip at the Phoenix Suns on Thursday.\n\nTrail Blazers: Host San Antonio on Thursday night.\n\n------",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.629472",
  "pipeline_version": "v1"
}