{
  "game_id": "0021200073",
  "espn_id": "400277793",
  "date": "Nov 09, 2012",
  "matchup": "MEM vs. HOU",
  "headline": "Randolph, Gay lead Grizzlies to fourth straight victory",
  "cleaned_body": "MEMPHIS, Tenn. --  Tony Allen was determined to stop James Harden. The rest of the Memphis Grizzlies clamped down on defense, too.\n\nZach Randolph had 15 points and 14 rebounds, Rudy Gay finished with 21 points and a key basket with 1:03 left, and the Grizzlies won their fourth straight with a 93-85 victory over the Houston Rockets on Friday night.\n\nMemphis' defensive pressure in the second half took the Rockets out of their game, forcing turnovers and leading Harden, who entered the night as the NBA's leading scorer at 30.3 points per game, to shoot 2 of 11 from the field and have only six points after the break.\n\nAllen was the primary defender on Harden, acquired from Oklahoma City just before the start of the season.\n\n\"I knew he was capable of getting that 30-something number,\" said Allen, one of the league's premier defenders. \"He's been coming out there with a vengeance. I just wanted to go out there and compete and not be one of those guys getting hit up for 30.\n\n\"I just took it as a challenge, and we had great guys step up and put fresh bodies on him.\"\n\nDespite its struggles in the second half, Houston was within 87-85 in the final 2 minutes. But Memphis scored the last five points of the game, including Gay's rebound bucket with 1:03 left, to win its 13th consecutive regular-season game at home.\n\nMike Conley had 14 points for Memphis, including a 3-pointer down the stretch, and Jerryd Bayless added 12.\n\nChandler Parsons led the Rockets with a season-high 19 points, including 15 in the second half. Harden had 18 points, but shot only 4 of 18 from the field and 1 of 6 outside the arc. Jeremy Lin had 15 points, while Omer Asik added 10 points and 13 rebounds.\n\n\"Right now, it is just not easy,\" Parsons said. \"It is hard to score, and it is hard to run our offense. We have got to look ourselves in the mirror and address the problems because it has to get better.\"\n\nThe loss was the Rockets' first on the road this season, but third straight overall.\n\nMemphis won despite shooting only 37 percent from the field. Randolph was 5 of 13 and Marc Gasol (six points) missed nine of his 12 shots.\n\nHouston managed 41 percent from the field but was stymied by 20 turnovers, including 12 in the second half.\n\n\"We had 20 turnovers, and they had 18 offensive rebounds,\" Houston coach Kevin McHale said. \"That's too much. We have got to control that.\"\n\nMemphis, as it did in its home opener against Utah this week, started out misfiring, hitting only three of its first 13 shots. That, along with 12 points from Harden, helped the Rockets carry a 46-42 lead into halftime.\n\nMemphis opened the second half with a 12-2 run to take its largest lead of the game at that point. But the Rockets pulled even, and Memphis held a 69-68 lead entering the final period.\n\n\"We think we are just not running,\" Lin said. \"We are not running with urgency and speed. Some of it is on me, too, not getting back (when opponents) do run the ball. We just need to make a conscious effort as a team of getting everybody up the floor.\"\n\nThe Rockets were within 76-75 when Memphis turned up the defensive intensity and began forcing turnovers. The pressure contributed to 11 unanswered points from Grizzlies reserves, including five from Wayne Ellington and four more from Marreese Speights.\n\nWhen Quincy Pondexter forced another turnover on his fourth steal of the night, it led to a drive from Bayless, and Memphis had built its biggest lead at 87-75.\n\nBut the Rockets had one more push left led by Lin's defense and layups. Lin scored seven of nine straight points for Houston and the Rockets were within 87-85 with 2:21 left.\n\nConley's 3-pointer, followed by the rebound basket from Gay, provided enough of a buffer for the Grizzlies.\n\n\"We aren't a team that shoots it well all the time, but we always give forth the effort,\" Conley said. \"Tonight was one of those cases where we didn't shoot the ball well. Guys stepped up defensively and made plays, got out in transition, and once again the second group put us on their back.\"\n\nGame notes Houston has lost four straight in Memphis. ... Harden, who started the season with 37 and 45 points, respectively, has hit only 17 of his 57 shots over the last three games. ... The game featured two of the NBA's top three rebounders in Asik and Randolph. Asik had three offensive boards. Randolph, who leads the league in rebounding, grabbed five on the offensive glass. .Houston, which leads the league with 11.75 steals a game, had only five. Memphis had a season-high 14 steals, including four by Pondexter and three each by Conley and Bayless. ... Randolph has recorded a double-double in all five Memphis games.",
  "tags_rule": [
    "DoubleDouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.074457",
  "pipeline_version": "v1"
}