{
  "game_id": "0021700161",
  "espn_id": "400974912",
  "date": "Nov 08, 2017",
  "matchup": "LAL @ BOS",
  "headline": "Baynes lifts Celtics over Lakers for 10th straight win",
  "cleaned_body": "BOSTON --  The Celtics are piling up injuries almost as quickly as they are victories this season.\n\nAron Baynes matched his career high with 21 points, Kyrie Irving scored 19 and Boston overcame injuries to Al Horford and Jayson Tatum to beat the Los Angeles Lakers 107-96 on Wednesday night for their 10th straight win.\n\nBaynes also had eight rebounds and three assists, and Boston improved to 10-2 even as Horford sat out after being placed in concussion protocol earlier in the day. The Celtics then lost rookie forward Tatum late in the second quarter, when he went to the locker room with a sore right ankle.\n\nCoach Brad Stevens said Tatum had X-rays and was fitted with a walking boot as a precaution. He will be re-examined on Thursday.\n\nIt's yet another blow for a team that lost Gordon Hayward for the season after a gruesome leg injury on opening night.\n\n\"Until we have only four left, I guess we're just gonna keep playing,\" Stevens said.\n\nBoston led by 20 in the second quarter before letting the lead shrink to two in the third. Los Angeles then struggled down the stretch, shooting 5 of 18 from the field with six turnovers in the final period.\n\nBrandon Ingram and Jordan Clarkson led the Lakers with 18 points apiece. Julius Randle had 16 points and 12 rebounds.\n\nCeltics fans gave rookie Lonzo Ball an icy welcome in his first trip to TD Garden. They booed the No. 2 overall pick throughout the night whenever he touched the ball. He finished with nine points, six assists and five rebounds, making just 4 of 15 from the field.\n\nWith Tatum sidelined in the second half, Boston struggled defensively, and the Lakers exploited the paint for several easy baskets.\n\n\"They hit us in the mouth and we were kind of shocked,\" Kyle Kuzma said. \"The second quarter and the second half we fought back.\"\n\nIrving also got banged up and had his right leg examined by trainers between the third and fourth quarters. He came back with just over six minutes to play and immediately made an impact, scoring back-to-back baskets to push Boston's lead back to 100-90.\n\nThe Celtics led by 48-28 in the second quarter but were outscored 24-13 over the final 6:51 of the half to let the Lakers back into the game.\n\nTIP-INS\n\nLakers: Only lead of the game was 2-0. ... Had 12 turnovers in the first half.\n\nCeltics: Shot just 8 of 24 in the fourth quarter. ... The 61 points scored by the first half was a season high. ... Took a season-high 98 field-goal attempts.\n\nLAY OFF BALL\n\nCeltics forward Marcus Morris thinks fans should ease up on Ball.\n\n\"He's a good kid -- it's his dad,\" Morris said. \"He's got a big mouth, everybody knows it. ... He has a long time to do this. He's a young guy. It kind of sucks that he's gotta go everywhere and they just boo him and boo him and boo him. He's just a regular player.\"\n\nBall said he didn't take offense to it.\n\n\"They're home. I'd boo too if I was a fan,\" he said.\n\nRIVALRY REKINDLED?\n\nLakers coach Luke Walton said this generation of players views the Celtics-Lakers rivalry differently than those around for the 1980s matchups.\n\n\"I think some of them get it, more than others,\" he said. \"Guys like Lonzo that grew up in LA, I think if you grew up in either one of these cities, you're probably pretty well schooled on the rivalry. For some of these young guys, they probably don't know much about it.\"\n\nCeltics fans chanted \"Beat LA!\" after Walton was whistled for a technical foul in the third quarter.\n\nCELEBRITY SIGHTINGS\n\nNew Red Sox manager Alex Cora, New England Patriots players Devin McCourty and Dion Lewis, and rapper DMX were in attendance.\n\nUP NEXT\n\nLakers: At Washington on Thursday night.\n\nCeltics: Host Charlotte on Friday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "MomentumShift",
    "CoachComment",
    "CareerHigh",
    "Rivalry",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.007045",
  "pipeline_version": "v1"
}