{
  "game_id": "0022100065",
  "espn_id": "401359889",
  "date": "Oct 28, 2021",
  "matchup": "DET @ PHI",
  "headline": "Embiid scores 30 on bad knee, 76ers hold off winless Pistons",
  "cleaned_body": "PHILADELPHIA -- — His right knee aching, Joel Embiid could have easily skipped a game against winless Detroit. As the 76ers watched another 20-point lead shrink to almost nothing down the stretch, Embiid instead got to work.\n\nEmbiid shook off lingering pain in his right knee and scored 30 points, grabbed 18 rebounds and hit a step-back 3-pointer in the final minute to help the Philadelphia 76ers stave off another collapse in a 110-102 win over the Pistons on Thursday night.\n\n“He imposed his will in several parts,” coach Doc Rivers said.\n\nEmbiid remains hampered by a right knee that hasn’t been right since he suffered a torn meniscus during last season’s playoffs. Embiid’s numbers were off a bit compared to his careers bests, yet the 7-footer has played in every game with the Sixers still without fellow All-Star Ben Simmons.\n\nEmbiid’s health was debated to the point that some fans and media believed the center should take the game off against the Pistons and give him one more day of rest before the Sixers play Saturday.\n\n“There's no excuses. I'm fine,” Embiid said.\n\nWith their habit of blowing large leads again haunting the Sixers, Embiid came back in the game late in the fourth when a 22-point lead was whittled to single digits. He hit a free throw to push the lead back to 10.\n\nThe 76ers watched a 14-point edge evaporate in a loss to Brooklyn in the home opener and last season's Eastern Conference semifinal loss to Atlanta was plagued by lost leads, notably blowing a 26-point lead in a Game 5 defeat.\n\nIt almost happened again after former Villanova standout Saddiq Bey buried a 3 that pulled the Pistons to 101-94 and another that made it 103-97.\n\nEmbiid, though, sank four free throws and buried a 3 from the top of the arc in the waning moments that saved the Sixers — who had 20 turnovers — from a complete meltdown.\n\n“You've just got to bury a team,” Sixers guard Tyrese Maxey said.\n\nEmbiid went through shootaround and a pregame workout feeling healthy enough to give the game a try. Embiid, who has a history of injuries, was NBA MVP runner-up last season and one strike against him was games played: He played in 51 games while Denver’s Nikola Jokic played all 72. Embiid had plenty of reasons to play -- and made the Pistons pay.\n\n“Every single year, I come in with the mindset of trying to play every single game I can,” Embiid said. “I've got to play more games than I have in the past. So far this year, I'm on the right path.”\n\nBad knee or not, he was his usual dominant self. Embiid crashed on the court several times and was even whistled for a technical foul for trash-talking Luke Garza after a rim-crushing dunk.\n\nEmbiid dumped a behind-the-back pass to Maxey for a baseline 3-pointer and a 48-43 lead. Embiid had 19 points and 12 rebounds in the first half to send the Sixers into the break with a 52-46 lead.\n\n“I've never seen that before and I'm so glad I made it,” Maxey said of Embiid's pass. “If not, oof, oof.”\n\nBey led the Pistons with 19 points. Detroit used a 16-1 run late to make the game interesting and fell to 0-4.\n\n“I didn’t start off the game well and missed some early reads and easy shots,\" Bey said. \"The rhythm was a little off at the beginning. I want to win so bad that I’m going to find the rhythm and help the team as much as possible.”\n\nTobias Harris scored 17 points and Maxey had 16 for the Sixers.\n\nTIP-INS\n\nPistons: Bey marked his return to the area and received a smattering of applause during pregame introductions. Coach Dwane Casey credited Villanova coach Jay Wright for turning Bey into a strong pro. “Jay Wright does a great job of preparing his guys for the NBA. Well-prepared, knows the game, coachable,” he said. “Doesn’t take coaching as criticism. That comes from being with coach Wright the whole time.”\n\n76ers: G Shake Milton made his season debut after sitting out with a sprained right ankle. He hit a 3 in the fourth for a 90-72 lead. ... Embiid made 12 of 15 free throws.\n\nSIMMONS UPDATE\n\nSimmons continues to work out with the Sixers and was at the morning shootaround. Simmons, who asked to be traded in the offseason, has yet to play this season.\n\n“The back is getting better,” Rivers said. “It’s more about the mental. Yeah, that’s where it’s at.”\n\nUP NEXT\n\nPistons: Host Orlando on Saturday.\n\n76ers: Continue a four-game homestand against Atlanta on Saturday. Portland and Chicago are in town next week.\n\n------",
  "tags_rule": [
    "LateCollapse",
    "ReturnFromInjury",
    "CoachComment",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Collapse",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.601594",
  "pipeline_version": "v1"
}