{
  "game_id": "0021301113",
  "espn_id": "400489986",
  "date": "Apr 01, 2014",
  "matchup": "POR @ LAL",
  "headline": "Damian Lillard, LaMarcus Aldridge combine for 65 in Blazers' win",
  "cleaned_body": "LOS ANGELES -- The Portland Trail Blazers are hoping they've put all the bad habits behind them with the playoffs on the horizon.\nAnd with a healthy LaMarcus Aldridge providing his usual numbers, they are confident that they can make some noise in the postseason -- with or without home-court advantage.\nDamian Lillard scored 34 points, Aldridge had 31 points and 15 rebounds, and the Blazers beat the Los Angeles Lakers 124-112 Tuesday night.\n\"We had a rough stretch, but now we've kind of picked it back up and we're going in the right direction at the perfect time,\" Lillard said. \"Now that we're close to the postseason, we want to have that rhythm going into the playoffs -- because that's what we play the regular season for.\"\n\nThe Blazers' fourth straight win, coupled with Houston's loss at Brooklyn, moved Portland within 1 1/2 games of the Rockets for fourth place in the Western Conference and home-court advantage in the opening round of the playoffs. The Rockets have three games in hand.\nThe Blazers have six games left on their schedule, five of them at home. One more win will give them their 12th 50-win season in the franchise's 44-year history. But the last four times the team won 50 or more games, they didn't make it past the first round of the postseason.\n\"We don't have a lot of control over that. Right now, it's about winning every game and gearing up for the playoffs,\" coach Terry Stotts said. \"It's that mindset that's the most important thing. Whatever happens with the seedings and all that -- I mean, we haven't even clinched a playoff spot yet.\"\nNick Young, the fifth and last player off the Los Angeles bench, made his first eight shots and finished 15 for 26 with a season-high 40 points. But it wasn't enough to prevent the Lakers' 10th defeat in 14 games. They slipped to 25-49 -- the most losses by the club since finishing 33-49 in 1993-94. The franchise hasn't lost 50 games in a season since 1974-75 (30-52).\n\"I didn't know I made my first eight shots,\" Young said. \"I just got into a zone. I got into a rhythm kind of fast.\"\n\nYoung's point total was the highest off the bench by any player in the league this season, surpassing the 37 Jamal Crawford had for the Clippers on Jan. 25 at Toronto. Young's high-point game in the NBA was 43, for the Washington Wizards against Sacramento on Jan. 11, 2011.\n\"Nick Young had a lot of easy shots in the first half,\" Aldridge said. \"He's a great scorer, so he's going to score. But we did a better job in the second half of making his shots harder.\"\nAldridge, playing his fourth game after missing the previous seven because of a bruised lower back, hit a 13-footer to cap an 18-9 run that extended Portland's two-point halftime margin to 81-70 at the midway mark of the third quarter.\nYoung kept the Lakers within striking distance with his 3-point shooting, draining one with 10:47 left in the game to pull them within 93-86. But Lillard responded with a pair of 3-pointers 28 seconds apart to extend Portland's margin to 13 points, and Los Angeles got no closer than nine the rest of the way.\n\"Coming in, we felt this could be a `trap' game against a team that's not in the playoff race. But we knew coming in that they were a dangerous team,\" Lillard said.\nThe Lakers were bolstered by the return of Xavier Henry and two-time MVP Steve Nash, who played in only his 13th game of the season and came off the bench for just the third time in his 18-year career.\nNash, who turned 40 on Feb. 7, had 10 points and 10 assists in 22 minutes. The eight-time All-Star has been plagued most of the season by nerve root irritation following his comeback from a broken left leg, which led to issues with his back, hip and hamstrings.\nGame notes\nLillard became the first player in Trail Blazers history to make 200 3-pointers in a season when he connected with 8:07 left in the first quarter. Wesley Matthews is close behind him with 186. ... The Lakers played before their eighth non-sellout crowd. Before this season, they had sold out every home game since Dec. 6, 2006. ... Portland C Meyers Leonard was ejected after his flagrant 2 foul on Kendall Marshall with 39.9 seconds to play. ... Portland C Robin Lopez had 10 points and 10 rebounds on his 26th birthday.",
  "tags_rule": [
    "MomentumShift",
    "PhysicalGame",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.731641",
  "pipeline_version": "v1"
}