{
  "game_id": "0021701137",
  "espn_id": "400975883",
  "date": "Mar 30, 2018",
  "matchup": "POR vs. LAC",
  "headline": "Nurkic, new father Lillard lead Blazers over Clippers 105-96",
  "cleaned_body": "PORTLAND, Ore. --  Portland's Jusuf Nurkic and Damian Lillard found their connection against the Clippers.\n\n\"We understand each other,\" Nurkic said. \"Every possession, we already know where we're going to be and how we're going to play. When we look at each other we already know what we're going to do.\"\n\nNurkic had 21 points and 12 rebounds, Lillard added 17 points and 11 assists, and the Trail Blazers held off the Clippers 105-96 on Friday night.\n\n\"I thought Damian was terrific with his passing. He found Nurk. They kept trapping him and he found Nurk almost every time,\" Portland coach Terry Stotts said. \"Someone asked me before the game about getting Nurk more shots. I think Dame is responsible for getting Nurk some shots.\"\n\nRookie Zach Collins came off the bench with a career-high 15 points for the Blazers, who were hurt in the third quarter when Ed Davis rolled his right ankle and left the game.\n\nThe loss snapped a three-game winning streak for the Clippers, who were just outside the playoff picture in the West with six games left. Lou Williams led Los Angeles with 23 points.\n\nAfter trailing by as many as 23 points in the third quarter, the Clippers got within 92-80 early in the fourth, prompting Lillard to return to the game. Los Angeles narrowed the gap again to 102-94 with just under a minute left but Pat Connaughton answered for the Blazers with a 3-pointer on the other end.\n\nPortland remains in third place in the West, coming off a 2-1 road trip that ended with a 108-103 loss at Memphis on Wednesday night. But the Blazers played that game without Lillard, who was awaiting the birth of his first child. Damian Lillard Jr. was born Thursday morning.\n\n\"I don't think there's any way to describe it. It's a different level, different type of excitement. It was my son looking into my eyes. It was different,\" Lillard said Friday.\n\nBut his joy was tempered because his half-brother was shot multiple times in the parking lot of a Portland-area shopping mall on Thursday night. Lillard said 20-year-old Jahrell Lillard was in stable condition. Police continue to look for the suspects.\n\n\"I just tried to go out there and have fun, clear my mind. I didn't want to drag my personal things into the locker room or on to the court,\" Lillard said. \"I had a son, that's a great thing. It was an unfortunate thing with my brother but he survived it so, a lot to be thankful for.\"\n\nThe Clippers were short-handed. The team announced that Milos Teodosic has a torn plantar fascia in his left foot and will be re-evaluated in two weeks. Already missing were Avery Bradley (abdominal surgery) and Patrick Beverley (knee).\n\nBut the Clippers saw the return of Danilo Gallinari, who had missed 18 games with a fractured right hand. Gallinari finished with 11 points.\n\n\"I just thought Portland was the better team. I thought they were better coached, I thought the players played better, I thought they played harder. And that's disappointing,\" Clippers coach Doc Rivers said.\n\nThe first half was a highlight reel of dunks for the Blazers, who led 64-49 at the break. Collins had three dunks in the second quarter to finish the first half with 13 points, topping his career high for a game.\n\nThe Blazers had 17 assists in the first half.\n\nAl-Farouq Aminu's layup and free throw put Portland up 74-51 early in the second half. But Davis headed to the locker room later in the third quarter. The Blazers said after the game that X-rays on the ankle were negative.\n\nPortland was already playing without starter Maurice Harkless, who had a minor procedure on his left knee on Wednesday and will be re-evaluated in two weeks.\n\nTIP-INS\n\nClippers: Los Angeles had won three straight in Portland. ... Austin Rivers struggled, going 1 for 8 from the floor for the game.\n\nTrail Blazers: A reporter quipped that Lillard's newborn son had a stack of his signature shoes waiting for him. \"Nothing but the finest,\" Lillard laughed. ... Portland had 30 assists, matching it season high.\n\nTHE END IS NEAR\n\n\"If you're desperate to get wins like we are to extend our season and play in the postseason like we are, we've got to have a sense of urgency from the start of the game,\" Clippers center DeAndre Jordan said.\n\nUP NEXT\n\nClippers: Host the Indiana Pacers on Sunday.\n\nTrail Blazers: Host the Grizzlies on Sunday.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.440670",
  "pipeline_version": "v1"
}