{
  "game_id": "0021400565",
  "espn_id": "400578857",
  "date": "Jan 12, 2015",
  "matchup": "DET @ TOR",
  "headline": "Brandon Jennings, Pistons knock off Raptors for 9th win in 10 games",
  "cleaned_body": "TORONTO -- Embarrassed by the Raptors last month at home, the Detroit Pistons got their revenge Monday night.\nBrandon Jennings had 34 points and 10 assists, leading the Pistons to a 114-111 victory over the Raptors.\nGreg Monroe had 22 points and 10 rebounds as Detroit won for the ninth time in 10 games. Andre Drummond added 10 points and 14 rebounds, helping the Pistons end a four-game losing streak against Toronto.\nIt was a much different performance than their first meeting of the season, when Detroit lost 110-100 on Dec. 19. In that game, hundreds of hollering Raptors fans filled the Palace and celebrated wildly when James Johnson threw down a vicious dunk on Drummond.\n\"Guys thought it was a little disappointing and embarrassing,\" Jennings said. \"We wanted to come here and get a win tonight.\"\nJennings played a key role with 20 points in the second half, including 15 in the game-changing third quarter.\n\"Brandon was unbelievable,\" Detroit coach Stan Van Gundy said. \"He just put us on his back and carried us.\"\nJodie Meeks scored 11 of his 13 points in the fourth, and Jonas Jerebko had eight of his 10 in the final period of Detroit's sixth straight road win.\nJonas Valanciunas scored a career-best 31 points and had 12 rebounds for the Raptors, who lost for the fifth time in six games. Kyle Lowry had 10 points and 12 assists, Greivis Vasquez scored 16, and Louis Williams had 15.\nAmir Johnson had 12 points and 10 rebounds for Toronto, and Terrence Ross scored 12.\nRaptors coach Dwane Casey said carelessness was costly for his team, which finished with 19 turnovers.\n\"When you commit that many turnovers against a good team like that, you shoot yourself in the foot, and that's what we did tonight,\" Casey said.\nThe Pistons led 112-108 after a 3 by Meeks with 53 seconds left, but Lowry answered with a 3 to cut the deficit to one. Kentavious Caldwell-Pope and Lowry both missed shots before Caldwell-Pope was fouled with six seconds left. Caldwell-Pope made two free throws, and Jennings stole the ball from Lowry at midcourt to end the game, spiking the ball in celebration as the buzzer sounded.\nVan Gundy said Jennings is \"playing as well as I've seen him play since he came into the league.\"\nValanciunas, Johnson and Ross combined to score Toronto's first 30 points of the game before Williams capped the opening quarter with a driving layup in the final second. Valanciunas had 14 in the first as the Raptors led 32-20 after one.\nWilliams scored nine points in the second, and Valanciunas had eight. Monroe scored nine for the Pistons, while Jennings added eight, but Detroit trailed 60-48 at halftime.\nJennings scored seven points and Detroit took advantage of four Toronto turnovers with a 15-6 run to start the third. Jennings tied it at 70 with a 3 with 5:27 left in the quarter and then gave Detroit its first lead since the opening basket of the game with a pair of free throws.\n\"He came out on fire in the third,\" Meeks said of Jennings.\nKEEPING IT SIMPLE\nVan Gundy didn't offer up much of a strategy session to his team after the disappointing first half. \"We got real technical,\" Van Gundy joked. \"We said, 'We've got to try.' There were no X's and O's to talk about. Nothing.\"\nTIP-INS\nPistons: Caron Butler (left hamstring) was unavailable in the second half. ... The Pistons snapped Toronto's streak of 38 home victories when leading after three quarters. Detroit was also the previous visiting team to overcome a fourth-quarter deficit at Air Canada Centre, rallying to beat the Raptors on April 1, 2013.\nRaptors: Lowry had nine assists in the first, two shy of Doug Christie's team record for assists in a single quarter. ... Toronto led after one quarter for the first time since Dec. 28 at Denver. It had been outscored in the first in nine of its previous 11 games.\nUP NEXT\nPistons: Host the Pelicans on Wednesday night.\nRaptors: Host the 76ers on Wednesday night.",
  "tags_rule": [
    "MomentumShift",
    "Streak",
    "CoachComment",
    "HotShooting"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.687675",
  "pipeline_version": "v1"
}