{
  "game_id": "0021400862",
  "espn_id": "400579154",
  "date": "Feb 27, 2015",
  "matchup": "CHI vs. MIN",
  "headline": "Jimmy Butler leads short-handed Bulls over Garnett-less Wolves",
  "cleaned_body": "CHICAGO -- Derrick Rose had knee surgery Friday morning. Pau Gasol was sidelined by an illness, and Taj Gibson sprained his left ankle in the first quarter.\nNo problem for the Chicago Bulls, who turned to their emerging star and skilled center for a short-handed victory.\nJimmy Butler had 28 points and 12 rebounds in Chicago's 96-89 win over the Minnesota Timberwolves, and Joakim Noah finished with 11 points, 12 rebounds and eight assists in a solid all-around performance.\n\n\"It is hard, but we have enough bodies and weapons on our bench to where guys can mix and match and play different positions and guard different positions,\" Butler said.\nThe Bulls won for the seventh time in their past nine games. Mike Dunleavy made five 3-pointers on his way to 21 points, and reserve Tony Snell added 12 points.\n\"Whoever we have out there, just get the job done,\" coach Tom Thibodeau said.\nKevin Martin scored 18 points for the Timberwolves, who have lost four of six to drop to 13-44. Ricky Rubio had 15 points and 10 assists, and Andrew Wiggins finished with 14 points.\nMinnesota was hurt by a whopping 48-16 deficit in points in the paint.\n\"I thought we played hard defensively,\" coach Flip Saunders said. \"For the Bulls, they have All-Stars who performed down the stretch. Butler made plays and Noah made plays, and that's what you want your All-Stars to do.\"\nThe Bulls trailed 85-84 before Kirk Hinrich drove inside for a layup with 4:29 remaining, and then Snell made a smart pass to Dunleavy for an open 3 that made it 89-85. Butler added a clutch bank shot to help Chicago improve to 10-1 in its past 11 games against Minnesota.\n\"It was a great win for us, with all the guys out and what we have been through this week,\" Dunleavy said.\nIt was Chicago's second game since the team announced Tuesday night that Rose had a medial meniscus tear in his right knee. The dynamic point guard walked out of the hospital following his surgery and is expected to be sidelined for four to six weeks, raising the possibility he could return this season.\nIt was an encouraging development for the Bulls, who were still processing another significant injury for the 2011 NBA MVP when they lost 98-86 to Charlotte on Wednesday night. Rose missed the 2012-13 season while he recovered from left knee surgery and played in just 10 games last season before he had surgery on his right knee.\n\"He's a tough-minded guy,\" Thibodeau said. \"There's normal emotion when you get injured, and then there's the fight in him that I think we've all seen. He's not going to back up and he'll put everything he has into the rehab and then coming back.\"\nThibodeau said he didn't know whether Gasol or Gibson would be available Sunday against the Los Angeles Clippers. Gibson was limping badly in the locker room after the game and has had periodic trouble with the same ankle for a while.\nMISSING GARNETT\nSaunders decided to rest Kevin Garnett in the first part of back-to-back games for the Timberwolves. The veteran forward, who was reacquired by Minnesota in a trade with Brooklyn last week, played 19 minutes in an emotional 97-77 home victory over Washington on Wednesday night.\nGarnett, who turns 39 in May, had his warm-ups and high tops on as he cheered for his teammates from the sideline throughout the game.\n\"That leadership is something he is going to bring here,\" Rubio said.\nThibodeau, who was an assistant coach with Boston when Garnett helped the Celtics win the NBA title in 2008, said he thinks the 7-footer will have a significant impact on the young Timberwolves.\n\"When you watch the way he plays offensively and defensively, it's all about winning,\" Thibodeau said. \"When you have a guy like that on your team, the young guys can't help but improve quickly. He'll bring a spirit to that team that'll tie everybody together.\"\nTIP-INS\nTimberwolves: Nikola Pekovic had 12 points and 11 rebounds, but Minnesota was outrebounded 53-45. ... The Timberwolves dropped to 5-23 on the road.\nBulls: Making his second straight start in place of Rose, Aaron Brooks had six points on 2-for-15 shooting. ... Chicago swept the season series against Minnesota, also winning 106-105 on the road Nov. 1.\nUP NEXT\nTimberwolves: Host Memphis on Saturday night.\nBulls: Host Los Angeles Clippers on Sunday.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.393394",
  "pipeline_version": "v1"
}