{
  "game_id": "0021701031",
  "espn_id": "400975777",
  "date": "Mar 16, 2018",
  "matchup": "TOR vs. DAL",
  "headline": "DeRozan has 29, Raptors win 11th straight, beat Mavs 122-115",
  "cleaned_body": "TORONTO --  The Toronto Raptors are on top of the Eastern Conference and learning how to deal with the view.\n\nDeMar DeRozan made the game-winning basket in overtime and the Raptors rallied to match the longest winning streak in franchise history, topping the Dallas Mavericks 122-115 on Friday for their 11th consecutive win.\n\n\"We make it hard on ourselves,\" coach Dwane Casey said. \"Every team is coming in and giving their best shot. We're learning to be the hunted instead of the hunter.\"\n\nDeRozan scored 29 points and Jonas Valanciunas had 21 points and 12 rebounds as the Raptors (52-17) won for the 18th time in 19 games.\n\n\"It's cool but I think we're all looking at it like we've got a bigger goal in mind,\" DeRozan said. \"Every game is not going to be pretty but as long as we're figuring out how to win and doing it in the right way, that's all that matters to me.\"\n\nKyle Lowry got the night off to rest as the Raptors played the second game of the back-to-back. Toronto won at Indiana on Thursday.\n\nDelon Wright scored 15 points and Fred VanVleet had 14, helping Toronto improve to an NBA-best 29-5 at home.\n\nDallas had won three of four. Harrison Barnes scored 27 points for the Mavericks, Dennis Smith Jr. had 19 and J.J. Barea 18.\n\n\"A lot of positives, just not the W,\" Mavericks coach Rick Carlisle said.\n\nUp 84-78 to begin the fourth, Dallas stretched its lead to 101-93 on a jump shot by Barnes with 5:43 remaining, but four points from DeRozan cut it to 101-97 with 4:32 left.\n\nToronto kept coming, pulling within two on a pair of free throws by DeRozan and, after a Dallas turnover, tying it at 106 on DeRozan's jumper with 1:15 to go in regulation.\n\nEach team turned the ball over before Barnes missed a jumper with 24 seconds left and VanVleet grabbed the rebound. After a timeout, DeRozan let the clock wind down before driving and kicking to Serge Ibaka, who missed a potential game-winning shot. DeRozan also missed before the buzzer, sending it to overtime.\n\nFive of Dallas' 12 turnovers came in the fourth quarter.\n\n\"We turned the ball over a little bit too much there,\" Dirk Nowitzki said.\n\nVanVleet and Dallas' Dwight Powell each made a 3 in overtime before DeRozan drove for the tiebreaking basket with 53 seconds left.\n\nValanciunas sealed it by making five of six at the free-throw line in the final 10 seconds.\n\n\"We had it going there on a lot of cylinders,\" Nowitzki said. \"Just couldn't close, couldn't finish, which is disappointing.\"\n\nTIP-INS\n\nMavericks: C Salah Mejri (strained right hamstring) missed his third straight game and will not play Saturday at Brooklyn.\n\nRaptors: F OG Anunoby returned to the starting lineup after missing the previous eight games because of a sprained right ankle. ... F Norman Powell (sprained left ankle) missed his second straight game ... Wright started in Lowry's place. ... Toronto signed F Nigel Hayes to a second 10-day contract.\n\nDELAYED ENTRY\n\nMany fans were slow to arrive at their seats after two entrance gates on the west side of the stadium were shut down while police investigated a suspicious package. The package was eventually detonated, and the seats were full by the second quarter.\n\nCENTURY CLUB\n\nToronto extended its franchise-record streak of games with 100 or more points to 22.\n\nUP NEXT\n\nMavericks: Visit Brooklyn on Saturday night. Dallas has won three straight road games in the series.\n\nRaptors: Host Oklahoma City on Sunday afternoon. Toronto has lost two straight to the Thunder.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.551432",
  "pipeline_version": "v1"
}