{
  "game_id": "0021401228",
  "espn_id": "400579520",
  "date": "Apr 15, 2015",
  "matchup": "CHA @ TOR",
  "headline": "Kyle Lowry leads Raptors to record 49th win",
  "cleaned_body": "TORONTO --  DeMar DeRozan and the playoff-bound Raptors are ready to show Washington's Paul Pierce that they have it.\n\nKyle Lowry scored 26 points and the Raptors wrapped up the regular season with their franchise-record 49th victory, beating the Charlotte Hornets 92-87 on Wednesday night.\n\n\"This is what we play for,\" Lowry said. \"Now it's the time where it gets a little bit more serious.\"\n\nChicago's victory over Atlanta meant Toronto finished fourth in the Eastern Conference, matching the Raptors with Pierce's Wizards in the first round of the playoffs. Toronto will host Washington in Game 1 on Saturday.\n\nPierce, who blocked Lowry's shot in Game 7 of Brooklyn's first round win over Toronto in last year's playoffs, said Tuesday that the Raptors don't scare him even though the Wizards went 0-3 against Toronto this season.\n\n\"We haven't done particularly well against Toronto, but I don't feel they have the `It' that makes you worried,\" Pierce told ESPN.\n\nDeRozan brushed off Pierce's trash talk.\n\n\"Paul Pierce has always got to say something,\" DeRozan said. \"He said something last year. He's always got to say something. Just let him talk. I could care less what he says.\"\n\nJonas Valanciunas added 18 points, DeRozan had 16 and Terrence Ross 13 for the Raptors, who won four of their final five games.\n\n\"The real season starts this weekend, what we've been building for,\" coach Dwane Casey said.\n\nTory Daniels scored a season-high 24 points for Charlotte. Kemba Walker had 17 points, and Gerald Henderson 15 for the Hornets. They lost their last six games to finish at 33-29. After holding the No. 7 spot in the Eastern Conference on March 8, they lost 15 of 20 to fall out of postseason contention.\n\nHornets coach Steve Clifford predicted the Raptors will be \"a handful\" for the Wizards.\n\n\"They're very well coached, they have a number of ways to score and (Casey) is going to know how to prepare them defensively,\" Clifford said.\n\nLowry went 1 for 13 from 3-point range in his first two contests after missing seven straight games with back spasms. After going 2 of 4 on Tuesday night in a loss at Boston, he was 6 of 9 against Charlotte.\n\n\"It feel great,\" Lowry said. \"Good game for me to go into the playoffs off of.\"\n\nDeRozan returned to the starting lineup after sitting out Tuesday to rest his sore right groin. DeRozan missed 21 games this season after suffering a torn tendon in his left groin.\n\nWalker scored nine points in the first quarter, but Ross had seven and DeRozan six to help Toronto take a 25-20 lead.\n\nLowry hit three of Toronto's six 3-pointers in the second and the Raptors closed the quarter with a 17-4 run to lead 55-44 at halftime.\n\nValanciunas scored 10 points in the third, making five of six attempts, to help Toronto take a 78-67 lead into the fourth.\n\n---\n\nTRIPLE THREAT\n\nToronto made 12 3-pointers against the Hornets, raising its season total to a franchise best 726. The previous record was 713, set last season. Toronto went 24-7 when making at least 10 3s and is the only team in the league to have five players make 100 or more from long range: Lou Williams (152), Terrence Ross (145), Greivis Vasquez (133), Lowry (132) and Patrick Patterson (104).\n\nFAN FAVORITES\n\nToronto's final regular season game was its 37th straight sellout and the 39th in 41 home dates. The Raptors broke the 800,000 mark in total attendance for the first time since 2001-02, when they posted a team- record 40 sellouts.\n\nTIP INS\n\nRaptors: Williams got the night off to rest. ... In the final tribute of their 20th anniversary season, Toronto honored former Rookie of the Year Damon Stoudamire. The first player drafted by the Raptors, Stoudamire received a standing ovation following a video tribute late in the first.\n\nHornets: Noah Vonleh matched his career high with 12 rebounds. ... Charlotte was without starters Al Jefferson (right knee), Michael Kidd-Gilchrist (left ankle) and Cody Zeller (right shoulder) and reserves Lance Stephenson (right toe) and P.J. Hairston (right knee). Mo Williams didn't play for the third straight game.\n\nUP NEXT\n\nRaptors: Toronto opens the playoffs at home Saturday.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.161964",
  "pipeline_version": "v1"
}