{
  "game_id": "0021700050",
  "espn_id": "400974801",
  "date": "Oct 24, 2017",
  "matchup": "ORL vs. BKN",
  "headline": "Gordon, Fournier rally Magic to 125-121 win over Nets",
  "cleaned_body": "ORLANDO, Fla. -- On a team that's at its best when consistently moving the ball, there are times Aaron Gordon seems to be working counter his Orlando Magic teammates.\nBut Gordon's habit of taking quick shots and playing isolation basketball came up big for the Magic during their 125-121 comeback win over Brooklyn on Tuesday night. Gordon scored a career-high 41 points, including the go-ahead 3-pointer with 36 seconds remaining.\n\"I just shot confidently, it was a quick shot,\" said Gordon, who also finished with a game-high 14 rebounds. \"It felt good coming off my hands.\"\nGordon was 5 for 5 from 3-point range and converted 14 of 18 from the field in 37 minutes.\nThere were times when Gordon's penchant for rushing shots worked against the Magic, especially as they fell behind by as many as 12 points in third quarter. But Gordon remained aggressive all night and defended his actions on the floor after the game.\n\"I definitely shot the ball well,\" he said. \"Regardless of the statistics, regardless of the numbers that I shot, I'm going to continue to shoot my shot. I feel that I'm open and that I'm in rhythm, whatever happens after that it's out of my control. I'm going to take what I know I can do.\"\nGordon had missed the Magic's previous two games, a close loss to Brooklyn and a blowout win over Cleveland on Saturday, with an ankle injury. In both games the team benefited from good ball movement and shot selection.\nThey shot 51 percent and had 30 assists in last week's five-point loss to the Nets, then had 28 more assists in the victory at Cleveland.\nBut against the Nets on Tuesday night, Orlando (3-1) finished with just 20 assists on 41 baskets.\n\"I'm glad we got a 'W' but there is a lesson in this game,\" said Evan Fournier, who finished with 28 points. \"We got away from moving the ball and we can't have that. We're not the type of team that can play (isolation) ball or pick-and-roll, pick-and-roll. Our strength is body movement and ball movement. We basically waited three quarters to do it.\"\nBut when the Magic got back to the style of play that suits them best they were able to bounce back in the fourth quarter against a Nets team that had taken a commanding lead by scoring on fast breaks and in transitions off Orlando misses.\nIt looked as though the Nets (2-2) would have their second win of the season over the Magic when DeMarre Carroll snatched a rebound out of Nikola Vucevic's hands and took the ball up for the go-ahead layup with 48 seconds remaining.\nBut Gordon answered with his 3-pointer followed by two free throws by Fournier for the four-point win. The Nets missed three consecutive 3-point shots in the waning moments to end the game.\nD'Angelo Russell finished with 29 points for the Nets.\n\"Disappointed. We had our opportunities,\" Brooklyn coach Kenny Atkinson said. \"Obviously, we had a lot of open looks. It's a make-or-miss league.\"\nTIP-INS\nNets: Russell made his first four 3-pointers in the opening five minutes of the opening quarter. Russell finished the first half with 15 points after cooling off the remainder of the half. ... The Nets outscored Orlando 9-4 on second-chance points and 12-6 on fast-break points during the first two quarters.\nMagic: Point guard Elfrid Payton missed his second straight game with a hamstring strain. Coach Frank Vogel said he is unsure when Payton will be ready to go. ... Vucevic, who had been the Magic's most consistent player in their first three games, got off to a slow start. He was 3 for 10 from the field and 0 for 3 from 3-point range to finish the first half with just six points. Vucevic ended the night with 12 points, which included a 0-for-5 showing from 3-point range and just 6 of 17 from the floor.\nQUOTABLE\n\"I think we're two teams struggling to push up in this league and struggling to make strides. There is a lot of energy there and a lot of want from our guys to kind of improve themselves from last year.\" -- Atkinson, on the improvement of both Brooklyn and Orlando.\nUP NEXT\nNets: Host Cleveland on Wednesday night.\nMagic: Host San Antonio on Friday night.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.741461",
  "pipeline_version": "v1"
}