{
  "game_id": "0021200353",
  "espn_id": "400278073",
  "date": "Dec 17, 2012",
  "matchup": "CHI @ MEM",
  "headline": "Grizzlies overcome slow start to defeat Bulls",
  "cleaned_body": "MEMPHIS, Tenn. -- The Memphis Grizzlies were struggling early against the stingy Chicago Bulls, taking bad shots and committing turnovers.\n\nThen the Grizzlies' bench took over, providing the burst that helped Memphis beat the Bulls 80-71 on Monday night.\n\n\"I thought it was huge what they did,\" Grizzlies guard Mike Conley said of the second-period play by the reserves. \"They came in and changed the game, changed the tempo. They got it going up and down a little bit. Got the ball movement where we like it to be.\n\n\"I think the first unit saw what they were doing and what they were able to do,\" Conley said. \"(We) got back in the game and tried to mimic it.\"\n\nConley led Memphis with 17 points on 6-of-12 shooting and four assists, while Zach Randolph added 10 points and 15 rebounds.\n\nRudy Gay had 12 points for Memphis but shot 5-of-13, continuing his slump. Wayne Ellington scored all 11 of his points in the second quarter, when the Grizzlies' reserves provided the lift after a sluggish first period, during which Memphis managed only 11 points for its lowest output in the opening quarter this season.\n\nCarlos Boozer led the Bulls with 16 points and 13 rebounds, while Marco Belinelli finished with 13 points. Luol Deng and Joakim Noah had 11 points apiece for the Bulls, but Deng was 4-of-17 from the field.\n\n\"I thought our defense was pretty good,\" Noah said, adding: \"We are getting good stops, and we are getting on the break, but we are just not getting those easy points. We are turning the ball over a little bit too much on the break. If we can score on those, we can be better.\"\n\nBoth teams shot just better than 37 percent. But Memphis was 6-of-11 from 3-point range, compared to the Bulls hitting only two of 11 long-range shots. The Memphis front line of Gay, Randolph and Marc Gasol was a combined 10-of-34, while the Bulls' starting front line of Deng, Boozer and Noah made 16 of 42.\n\nMemphis controlled the boards 51-39 and had 18 offensive rebounds.\n\n\"I thought the second quarter was the problem,\" Chicago coach Tom Thibodeau said. \"We were outscored 28-14. We had a great first quarter, terrible second quarter and got outrebounded on the road.\"\n\nThe Grizzlies shot just 4-of-22 in the first quarter and had six turnovers, causing them to fall behind.\n\nBut the Memphis bench brought an energy in the second that was missing from the starters. Quincy Pondexter, Jerryd Bayless and Ellington contributed on the offensive end, hitting all five of their shots from 3-point range in the period.\n\nEllington had 11 points in the second to lead Memphis to a 39-34 lead at the break, the Grizzlies' biggest lead of the half.\n\n\"As a second unit, we just try to come in and be aggressive and bring some intensity and share the basketball,\" Ellington said. \"Tonight, it was coming my way, and I was knocking down shots.\n\n\"When you see a couple go down, as a basketball player, it's kind of natural to just get in that zone,\" Ellington continued. \"I got pretty hot in the first half.\"\n\nBoozer had 12 points on 5-of-9 shooting from the field and grabbed eight rebounds for Chicago in the half.\n\nThe leading scorers on both teams were struggling at that point. Deng, who averages 17.8 points per game, was limited to four points on 2-of-7 from the field.\n\nGay, meanwhile, missed all six of his shots in the half and was scoreless.\n\nMemphis extended the lead to 61-53 entering the fourth, as Conley scored seven in the third. Noah had six points for Chicago.\n\nMarreese Speights connected on a tip-in to open the fourth for the first double-digit lead of the game at 63-53.\n\nChicago turned up the defensive pressure at that point, becoming much more active in challenging the Grizzlies and pushing them to uncomfortable passes.\n\n\"You've got to give them credit,\" Memphis coach Lionel Hollins said. \"They defend everybody. You look at what they're missing with (injured players) Richard Hamilton and Derrick Rose out, and they still win games because they defend you and make you earn everything.\"\n\nThe Bulls tried to get Deng involved in the fourth, but he hit only three of 12 shots by the time the game reached the midway point of the final quarter.\n\nChicago got within five points when Jimmy Butler scored on a breakaway dunk with 5:05 left. Memphis then extended the lead back to double digits, providing enough of a buffer for the Grizzlies to win their second straight.\n\n\"We'll take it,\" Randolph said. \"It wasn't pretty, but we got the win.\"\n\nGame notes Thibodeau said before the game that Rose's rehab of his left knee injury continues on schedule. There is no timetable for his return, he said. ... Rose, who played one year at the University of Memphis before turning pro, has returned to play at the FedExForum only twice in his five years in the league. ... Chicago is 2-9 all-time in Memphis. ... Bulls starting G Kirk Hinrich returned after missing two games with a bruised left knee. \"It didn't feel as good as I would like to by any means, but it was good enough to go out there and play.\" ... There was a 27-second moment of silence before the national anthem -- 26 for each of the victims of the Newtown, Conn., shooting and another for a Memphis police officer killed while serving a search warrant Friday only hours before the Newtown slayings. ... The 71 points were a season low for Chicago. The previous low was 76 against Indiana on Dec. 4. ... Gay's 12 points ended his streak of consecutive games with at least 14 points at 24.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.563709",
  "pipeline_version": "v1"
}