{
  "game_id": "0021200046",
  "espn_id": "400277766",
  "date": "Nov 05, 2012",
  "matchup": "POR @ DAL",
  "headline": "O.J. Mayo powers Mavs' victory against Blazers",
  "cleaned_body": "DALLAS --  O.J. Mayo is feeling right at home with the Dallas Mavericks.\n\nMayo celebrated his 25th birthday with 32 points, his second consecutive 30-point home game to start the season, and the Mavericks used a fourth-quarter surge to beat the Portland Trail Blazers 114-91 on Monday night.\n\nChris Kaman and Darren Collison are also fitting in with the Mavericks, who are still without injured star Dirk Nowitzki.\n\nCollison had his second consecutive double-double with 14 points, 13 assists and only one turnover. Kaman scored 16 points on 8-of-10 shooting.\n\n\"In the offseason, the Mavericks lost some good players, but we also got some good players. I think some underrated players,\" Kaman said. \"Some guys can really score the basketball on this team and are very creating, starting with Darren and O.J.\"\n\nAsked about the fast-paced Mavericks offense, which has shot at least 60 percent from the field in consecutive games for the first time in team history, Mayo described it as organized street ball.\n\n\"We have spots to fill, but we just continue moving,\" Mayo said. \"It's kind of hard to guard. We don't do something constant or something you can scout. We pretty much ready the defense and work off that.\"\n\nMayo made six 3-pointers and capped his night with a running dunk with 1:18 left. After shooting 7 for 22 in his first two Dallas games on the road, he is 22 of 35 at home with 13 3-pointers.\n\nThe Trail Blazers, coached by Terry Stotts, a Mavericks assistant the past four seasons under Rick Carlisle, were within 85-83 with 10:17 left.\n\nBut Kaman, who was 8-of-9 shooting in his Dallas debut Saturday after missing the first two games with a strained right calf, made a 17-foot jumper. That was the sixth consecutive shot he made Monday, and it started a game-ending 29-8 run.\n\n\"Obviously, we didn't do a good enough job defensively. I think Dallas put on a flow clinic in the second half,\" said Stotts, who was the Mavs' primary offensive coach. \"The ball was moving, they were setting good screens. They made their shots, got to the rim.\"\n\nLaMarcus Aldridge, a Dallas native, and Wesley Matthews had 20 points each for Portland. Nicholas Batum had 14 points, while J.J. Hickson grabbed 11 rebounds.\n\nRookie point guard Damian Lillard had 13 points and five assists in his fourth NBA game. He had two quick fouls and missed extending some historic achievements.\n\nLillard had matched Geoff Petrie as the only players in Blazers history to score 20 or more points in his first three games. He had joined Oscar Robertson as the only players in NBA history with at least 20 points and seven assists in his first three career games.\n\nMayo hit 3-pointers from the right wing and then the left wing in the third quarter. He hit another from long range to put Dallas up 70-67 with 5 1/2 minutes left in the period, breaking the only tie of the second half.\n\nAfter Sasha Pavlovic beat the shot-clock buzzer with a 3-pointer to get Portland within 75-73, Collison passed to Vince Carter for a 3-pointer. Mayo added another 3 before the end of the third to stretch the lead to 83-77.\n\nMayo scored seven points in the first 5 minutes of the game and had 12 of the Mavericks' first 22 as they built an early 10-point lead.\n\n\"He's one of the hardest workers on this team. He's constantly shooting every day,\" Collison said. \"That 3-point shot is like a mid-range shot to him. ... If he continues to shoot like that, we're all going to have a very good season.\"\n\nPortland got even at 43 on two free throws by Lillard before Aldridge's three-point play gave the Trail Blazers their first lead, 46-45, with 4:16 left in the first half.\n\nBut Lillard shot only 2 of 13, including 1 of 8 on 3-pointers.\n\n\"It was a tough night. I got some good looks, didn't make shots,\" Lillard said. \"That's pretty much it. I tried to stick with it. I got some early fouls and that took the rhythm out of it for me.\"\n\nGame notes Mavericks F Shawn Marion left in the third quarter with a strained knee. It didn't appear that the injury was serious. ... There was a moment of silence before the game in memory of ESPN radio announcer Jim Durham, who died last weekend at his home in Texas. Durham was the Mavericks' television play-by-play man from 1993-2001. ... Another former Mavericks assistant coach brings his team to the American Airlines Center on Wednesday night. Dwane Casey is in his second season as Toronto's head coach.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.425167",
  "pipeline_version": "v1"
}