{
  "game_id": "0021300913",
  "espn_id": "400489786",
  "date": "Mar 05, 2014",
  "matchup": "POR vs. ATL",
  "headline": "Trail Blazers rout Hawks as Kyle Korver's 3-point streak ends",
  "cleaned_body": "PORTLAND, Ore. -- Wesley Matthews had a simple goal going into the Blazers' game against the Hawks: Don't let Kyle Korver get the ball.\nKorver wound up with few chances and his NBA-record streak of 127 games with a 3-pointer was snapped in Atlanta's 102-78 loss to Portland on Wednesday night.\n\"I'm a little bummed,\" Korver said. \"The streak was good, it was good while it lasted. Someday I'll look on it and be proud. Not tonight, obviously. This was a tough game all the way around for us.\"\nKorver had surpassed Dana Barros' record of 89 straight, set from 1994-96, earlier this season. He was 0-for-5 from 3-point range against the Blazers and finished with five total points, well off his 12-point average.\nKorver's streak started in the second game last season and over its course he hit 337 total 3-pointers.\n\"I was thinking, 'Don't let him touch the ball,' \" Matthews said of his pregame plan. \"I was mad when he did touch it.\"\nNicolas Batum had 14 points and a career-high 18 rebounds for Portland. He has had at least 11 rebounds in his past three games, and has seven double-doubles this season.\nMo Williams added 15 points off the bench for Portland, which had six players in double figures and led by as many as 29 points. The Blazers have won six of its past seven games while keeping pace as one of the teams battling for the top four seeds in the West.\nMatthews finished with 10 points, but his main job was Korver.\n\"It was a team thing, but Wes took a lot of pride in that challenge,\" Blazers coach Terry Stotts said. \"It was fun to watch, especially in that third quarter. They were going head to head and Wes took the challenge.\"\nThe Hawks have lost four straight and 12 of their past 13 as they fight to stay in the Eastern Conference playoff picture. Cartier Martin led Atlanta with 16 points off the bench.\nThe game was so lopsided that both coaches rested their starters late in the game. Hawks coach Mike Budenholzer said he didn't want to risk another injury by sending Korver back in the game.\nKorver said it was a matter of pride.\n\"We were getting blown out. I never wanted to keep it going like that,\" he said. \"If they would've put me back in, I would have gone in, but I wasn't looking to get back in just to keep the streak alive.\"\nPortland was coming off a 107-106 loss to the Lakers on Monday that snapped a five-game winning streak.\nAll-Star Damian Lillard started for the Blazers despite missing practice because of a stomach bug, but the Blazers were still without forward Thomas Robinson, who has a sore left knee.\nPortland also was without forward Joel Freeland because of a right knee injury.\nAll-Star forward Paul Millsap missed his fifth straight game for the Hawks because of a bruised right knee. His absence hurts Atlanta, which is already without big men Al Horford and Gustavo Ayon for the season.\nLillard's 3-pointer put the Blazers up 20-17 in the first quarter. Dorell Wright made a 3-pointer and two of three free throws to give the Blazers a 29-19 lead going into the second.\nPortland pushed the lead to 42-28 on Matthews' 3-pointer midway thought the second quarter. Batum made it 51-33 with a 3-pointer late in the half, and the Blazers went to the break with a 56-38 advantage.\nThe Hawks struggled in the first half, shooting just 25 percent (11-of-44) from the floor for their lowest first-half percentage of the season.\nPortland forward LaMarcus Aldridge was also having a tough start, going 0-for-6 from the floor with three rebounds. The three-time All-Star went into the game averaging 23.7 points and 11.2 rebounds.\nAldridge's jumper -- his first basket from the field -- put the Blazers up 68-46 in the third quarter. He finished with 12 points.\nIt was Aldridge's third game back after a five-game layoff because of a left groin injury.\n\"Since coming back, I haven't felt like my timing has been great,\" he said.\nWill Barton's 3-pointer pushed Portland's lead to 87-60 in the second half and the Hawks could never catch up.\nGame notes\nIt was the first of two meetings between the teams this season. .... The two have split the last two regular-season series 1-1. ... Following Wednesday night's game, the Blazers embark on a five-game road trip. ... Oregon Ducks coach Dana Altman was among the fans at the game. Altman coached Korver at Creighton before heading to Eugene.",
  "tags_rule": [
    "DoubleDouble",
    "Streak",
    "CoachComment",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.208043",
  "pipeline_version": "v1"
}