{
  "game_id": "0022100458",
  "espn_id": "401401142",
  "date": "Mar 04, 2022",
  "matchup": "TOR vs. ORL",
  "headline": "Magic end 9-game skid against Raptors with 103-97 victory",
  "cleaned_body": "TORONTO -- — Cole Anthony had 15 points and 12 rebounds, Chuma Okeke had 10 points and a career-high 11 rebounds, and the Orlando Magic beat Toronto 103-97 on Friday night, snapping a nine-game losing streak against the Raptors.\n\n“The energy was awesome,” Anthony said. “We held them under 100. That’s a great night. That’s a very good offensive team.”\n\nMo Bamba scored 14 points, and Jalen Suggs and Gary Harris each had 13 for the Magic. Orlando had lost six straight north of the border.\n\nFranz Wagner and R.J. Hampton each scored 11 points as the Magic won for the third time in four games and bounced back after blowing an 18-point lead Wednesday in an overtime loss to Indiana.\n\n“We’re not looking at our past losses as losses, we’re just looking at them as lessons,” Okeke said.\n\nOrlando hadn’t beaten the Raptors since a 113-98 victory in Toronto on Feb. 24, 2019.\n\n“That’s a game that potentially at the beginning of the year we might have lost,” Anthony said of Friday’s win. “It shows the maturity, it shows the growth, especially when we’re a couple of men down, too.”\n\nMagic center Wendel Carter Jr. was sidelined by a non-COVID illness, while guard Markelle Fultz sat out to rest his left knee. Fultz is likely to return Saturday in the second game of Orlando’s back-to-back.\n\nThe Raptors lost to a 15-win opponent for the second straight night after falling to Detroit on Thursday.\n\n“I’m seeing a lot of opportunities within three or four feet of the basket and I’m seeing a lot of open 3s,” Raptors head coach Nick Nurse said. “I’m not seeing heaves out there that nobody has a chance to make.”\n\nPascal Siakam had 34 points and 14 rebounds for Toronto, and Malachi Flynn scored a season-high 20. The Raptors lost for the fourth time in six games since the All-Star break.\n\nPrecious Achiuwa scored 11 points and Scottie Barnes had 10.\n\nToronto guard Fred VanVleet sat for the fifth time in seven games because of a sore right knee, and forward OG Anunoby missed his sixth straight game because of a fractured right ring finger. Forward Thad Young returned after missing Thursday’s game because of a non-COVID illness.\n\nOrlando led 48-39 at halftime and stretched its lead to 72-60 after three quarters. Toronto cut it to 95-88 with 2:47 left in the fourth, but Orlando answered with a 6-2 spurt. Trailing by 13, the Raptors scored the game’s final seven points.\n\n“I feel like we had a lot of energy from start to finish. We came on strong and we also finished strong,” Okeke said.\n\nCOLD SPELL\n\nToronto’s Gary Trent Jr. shot 2 for 12, including 0 for 9 from 3-point range, extending a dismal run of shooting performances. Trent went 4 for 23 in Thursday’s loss to Detroit, including a 3 for 15 effort from long range. He’s 10 for 46 from 3-point range since the all-star break.\n\nNO QUIT\n\nSuggs hurled a full-court pass to Wagner in search of a late basket with 0.7 seconds left in the first half, but Barnes responded in time to block Wagner’s shot.\n\nCHECK YOUR CALENDAR\n\nThe game was originally scheduled for Dec. 20 but was postponed because the Magic had too many players and staff in the health and safety protocols.\n\nTIP-INS\n\nMagic: Made 15 straight free throws to begin the game before Anthony missed the first of two in the fourth quarter. They finished 20 for 21. … Suggs led Orlando with seven assists.\n\nRaptors: Nurse said Anunoby and VanVleet will accompany the team on an upcoming six-game road trip. There is no timetable for VanVleet’s return. … Flynn matched his season-high with eight assists.\n\nUP NEXT\n\nPistons: At Memphis on Saturday night.\n\nRaptors: At Cleveland on Sunday night.\n\n------",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.426924",
  "pipeline_version": "v1"
}