{
  "game_id": "0021300858",
  "espn_id": "400489731",
  "date": "Feb 26, 2014",
  "matchup": "OKC vs. CLE",
  "headline": "Kyrie Irving scores 31 as Cavs send Thunder to third straight loss",
  "cleaned_body": "OKLAHOMA CITY --  Thunder coach Scott Brooks joked during pregame that he didn't like what he saw from Kyrie Irving at the All-Star game. Brooks coached the West and watched as Irving led the East to a comeback win on his way to earning MVP honors.\n\nBrooks didn't like what he saw from Irving on Wednesday night, and it was no joke this time. The point guard made it look like All-Star weekend again, scoring 14 of his 31 points in the fourth quarter to help the Cleveland Cavaliers beat Oklahoma City 114-104.\n\nIrving also had nine assists, five rebounds and four steals.\n\n\"Kyrie had a huge performance for us,\" Cavaliers coach Mike Brown said. \"He was very efficient in the 43 minutes that he played tonight, I thought offensively, especially.\"\n\nThe young Cavaliers, still adjusting to roster changes since the trade deadline, picked up a meaningful victory. Cleveland shot 14 for 21 from the field in the fourth quarter against the Western Conference-leading Thunder.\n\n\"To come here and get a win in this building versus this team and those players and that coaching staff, for us, is a good confidence booster,\" Brown said. \"Everything for us right now to be a positive will help us long term just as much as it will short term.\"\n\nIt was Oklahoma City's third straight home loss since the All-Star break. The Thunder lost three games at home the entire season before the break.\n\n\"No one in the locker room, including myself, feels good about it,\" Brooks said. \"The exciting thing is we know we can do better. We just have to maximize our potential.\"\n\nJarrett Jack scored 21 points, Spencer Hawes scored 19 and Tristan Thompson added 11 points and 11 rebounds for the Cavaliers, who snapped a three-game losing streak.\n\nKevin Durant had 28 points, 10 rebounds and nine assists, Russell Westbrook had 24 points and nine assists and Serge Ibaka added 16 points and 13 rebounds for the Thunder. Oklahoma City is 0-3 since Westbrook returned from his latest knee surgery.\n\nBrooks said the bigger issue for the Thunder is their suddenly porous defense. Oklahoma City, one of the league's top defensive teams all season, allowed 103 points on 55 percent shooting against Miami and 125 points on 52 percent shooting against the Los Angeles Clippers before its latest collapse.\n\n\"It's a defensive toughness,\" Brooks said. \"We have to get tough on the basketball because we're giving up too much penetration. We have to fight through screens. These are things that we've done a great job at, we just have to get back to it.\"\n\nIn the closing seconds of the first half, Westbrook dribbled as the clock wound down, then pulled up in front of Irving and drained a 3-pointer to give the Thunder a 52-51 lead at the break.\n\nThe Thunder committed 12 turnovers in the first half, but made up for it by shooting 57 percent from the field. Durant scored 15 points before the break and Westbrook had 13 points and six assists. Irving had 14 points, four assists and three steals at halftime.\n\nThe Thunder opened the second half with 3s from Durant and Thabo Sefolosha to take a 58-51 lead. A mid-range jumper by Ibaka stretched Oklahoma City's lead to 62-53, leading Brown to call a timeout.\n\nCleveland regrouped and cut Oklahoma City's lead to three on an unusual play. The Cavaliers' Luol Deng shot a jumper and Nick Collison was called for goaltending and issued a technical foul for grabbing the net. Irving made the free throw to make it a 69-66 game. The Thunder led 76-72 at the end of the period.\n\n\"Oklahoma City, they came out and kind of punched us in the mouth a little bit in that third quarter, and our guys didn't panic,\" Brown said. \"They kind of stayed with it.\"\n\nMatthew Dellavedova tied the game at 81 with a floater early in the fourth quarter. Later, a breakaway dunk by Alonzo Gee gave the Cavaliers a 90-86 edge with 7:10 to play.\n\nDurant's 3-pointer gave the Thunder a 97-95 lead, but the Cavaliers responded with an 8-0 run, highlighted by 3-pointers from Jack and Irving, and they controlled the game from there.\n\n\"Obviously, playing against a great team, you're going to get up for it,\" Irving said. \"Everyone in the league wants to play against a great team like this, especially on their home floor. But this game doesn't mean any more than any other game that we have coming up. Every game just means a lot at this point, no matter who we're playing.\"\n\nGame notes It was the second consecutive start for Thunder C Steven Adams. He replaced Kendrick Perkins, who is out for six weeks with a groin injury. ... Hawes started for the second time since being traded from Philadelphia. ... Durant was honored during pregame for being selected as the Western Conference player of the month for January. ... Thunder G Derek Fisher was issued a technical foul early in the second quarter, his third of the season.",
  "tags_rule": [
    "MomentumShift",
    "LateCollapse",
    "ReturnFromInjury",
    "Streak",
    "CoachComment",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Collapse",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.956759",
  "pipeline_version": "v1"
}