{
  "game_id": "0021300934",
  "espn_id": "400489807",
  "date": "Mar 09, 2014",
  "matchup": "CHI vs. MIA",
  "headline": "Joakim Noah, Bulls drop Heat in OT; LeBron James held to 17",
  "cleaned_body": "CHICAGO -- Joakim Noah and Jimmy Butler understand it.\n\nThe real victory for the Chicago Bulls will come when they're knocking the Miami Heat out of the playoffs, not during the regular season -- no matter how charged the atmosphere is.\nEven so, they'll take this.\nNoah had 20 points and 12 rebounds, D.J. Augustin scored 22 and the Chicago Bulls beat the Miami Heat 95-88 in overtime Sunday after Butler blocked LeBron James at the end of regulation.\n\"I want what they have -- a championship,\" Noah said. \"One day, we're going to have to get through those guys.\"\nThe Heat have owned them when it counts in recent seasons.\nWith a healthy Derrick Rose and the No. 1 seed in 2011, Chicago fell to Miami in the Eastern Conference finals. Last year, with Rose out, the Heat knocked off the Bulls in the second round on the way to their second straight championship.\n\"It's still a good win,\" Butler said. \"It gives us confidence we can beat them. But ... in the playoffs, like Thibs said, we can't go around them; you're going to have to go through them.\"\nDwyane Wade scored 25 for Miami, but with James struggling again, the Heat dropped their third straight to match their longest losing streak of the season.\nJames scored 17 points on 8-of-23 shooting and couldn't come through after Miami blew a 12-point lead down the stretch. With a chance to win it at the end of regulation, he got stripped by Butler on a layup attempt.\nIn overtime, it was all Bulls.\nChicago outscored Miami 9-2, starting with Augustin's 3 just under a minute in. Butler added a jumper from the wing, Noah scored on a putback and Butler hit two free throws to make it 95-86 with 1:33 left before James made a layup.\nNoah also had seven assists and five blocks with his dad -- tennis great Yannick Noah -- looking on.\n\nButler added 16 points and 11 rebounds while containing James.\nWade tried to carry the load for Miami, particularly in the early going. Chris Bosh scored 15, but James had another rough afternoon. The four-time MVP is 23 for 59 in the three games since his career-high and franchise-record 61-point effort against Charlotte last week.\nJames also went without a mask from the start to protect his broken nose, after ditching it during the previous game. He said it was simply uncomfortable, so he decided to play without it even though he was not cleared to do so.\nThe Bulls got back into it after the Heat led by 12 late in the third quarter.\nAugustin's 3-pointer and Butler's steal and two free throws put Chicago ahead 75-74 midway through the fourth.\nIt was 82-82 with just over two minutes left when Noah blocked a layup by James. Taj Gibson raced the other way for a thunderous dunk while getting fouled by Mario Chalmers, drawing a roar from the crowd.\nJames tied it again on a layup with 1:10 left. Wade then stole the ball from Butler and hit two free throws after getting fouled inside by Noah to give Miami an 86-84 lead with 29.2 seconds remaining. But Kirk Hinrich quickly scooped in a runner to knot it at 86 with 20.1 seconds left.\nAfter a timeout, James took the inbounds pass and got stripped driving for a layup along the right side by Butler to send this one to overtime.\n\"I dropped the ball. It's like a double entendre,\" James said. \"I actually dropped the ball, but I dropped the ball on my team. I had it. That's a great play. I give a lot of credit to Jimmy. He got his hand on the ball, but I had the lane. I had the layup.\"\nGame notes\nThings got a bit heated between James and Butler late in the first half. They got tangled going for a loose ball near the Heat basket after James tried to corral a long pass. As they hit the court, Butler's foot hit James' nose, and James appeared to push him. Both players got technicals. \"Two competitors were down there,\" Butler said. \"Whatever happened, happened. But I don't back down.\" James brushed it off, saying, \"Just two competitors going at it, one trying not to give an edge.\" ... The Bulls and Heat split the season series at 2-2.",
  "tags_rule": [
    "Streak",
    "PhysicalGame",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.925182",
  "pipeline_version": "v1"
}