{
  "game_id": "0021301120",
  "espn_id": "400489993",
  "date": "Apr 02, 2014",
  "matchup": "CHI @ ATL",
  "headline": "D.J. Augustin guides Bulls past slumping Hawks",
  "cleaned_body": "ATLANTA -- The Chicago Bulls strengthened their hold on home-court advantage in the playoffs, and made it a little tougher for the Atlanta Hawks to extend their season.\nFor that, the Bulls can thank D.J. Augustin.\nAgain.\nKeeping up his inspired play, Augustin scored 23 points as Chicago held off slumping Atlanta for a 105-92 victory Wednesday night, bumping the Hawks out of the final playoff spot in the Eastern Conference with two weeks left in the season.\nChicago stretched its lead to 2 1-2 games over Brooklyn for home court in the opening round of the playoffs. The Bulls may have lost Derrick Rose to major knee injuries two years in a row, but they are 35-20 since signing Augustin in mid-December.\n\"He's saved our season,\" coach Tom Thibodeau said. \"D.J. can beat you a lot of different ways.\"\nThe performance came three days after Augustin scored a career-high 33 points against Boston.\n\"D-Rose is the face of this team,\" Augustin said. \"I'm just trying to come in, just trying to help us out, do whatever I can do to help us win and go forward in the playoffs.\"\nChicago took control with a 16-3 run in the second quarter and led the rest of the way, fending off the last of Atlanta's runs when Jimmy Butler swished a 3-pointer with just over a minute remaining.\n\"We just want to finish the rest of the season strong,\" Augustin said.\nThe Hawks are heading in the opposite direction, losing for the 21st time in 28 games. This one dropped them slightly behind New York for the eighth playoff seed.\n\"We still control our own destiny,\" DeMarre Carroll said. \"But now things got more interesting.\"\nThe Knicks (33-43) routed Brooklyn 110-81 to climb percentage points ahead of Atlanta (32-42). Cleveland is also in the mix, two games out after beating Orlando. The Hawks host the Cavaliers on Friday night.\nPaul Millsap led the Hawks with 22 points and 11 rebounds, while Jeff Teague added 21 points. But Kyle Korver, with 12 points, was the only other Atlanta player in double figures.\nEveryone else went 13 of 32 from the field.\n\"We're a new team,\" Carroll said, referring to Atlanta's massive turnover the last two summers. \"This year is not going to make or break us. Just to be talking about making the playoffs is amazing.\"\nThe Hawks were up 42-38 with 9 minutes left in the second quarter after Mike Muscala knocked down a couple of free throws.\nChicago took control from there, clamping down defensively and scoring 16 of the next 19 points. The Hawks missed 12 of 13 shots, forced to settle mostly for outside jumpers and botching a couple of easy ones when they did get inside. Augustin capped the spurt with a brilliant hesitation move, freezing the Atlanta defenders before bursting through a gap for an easy layup.\nThe Bulls led 57-49 at the half and never surrendered the advantage.\nAtlanta made several runs, only to have Chicago answer every one of them. With the Hawks down 93-87 and in possession, Taj Gibson swatted away Carroll's driving shot, the Bulls grabbed a loose ball and took off the other way, with Augustin sinking a 3-pointer that led to an Atlanta timeout.\nIt was another trey by Butler that finished off the Hawks -- appropriate enough, since the Bulls went 12 of 25 beyond the arc. Augustin was 4 of 8 from long range, while Butler chipped in with three more.\nIn contrast to the Hawks, six players were in double figures for the Bulls, including Butler and Kirk Hinrich with 17 points apiece.\nAtlanta has eight games left to pull out its seventh straight playoff appearance.\n\"This team is competitive,\" Elton Brand said. \"There's no quit in us. We're going to play it out until the end.\"\nGame notes\nChicago's Joakim Noah had 10 points and 10 rebounds. ... The Bulls swept the season series 4-0 and now have won six straight against the Hawks since last season. ... Thibodeau shrugged off the 200th career victory. \"I've got a good team,\" he said after improving his record to 200-105 in four seasons.",
  "tags_rule": [
    "ThreePointExplosion",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.596455",
  "pipeline_version": "v1"
}