{
  "game_id": "0021401136",
  "espn_id": "400579428",
  "date": "Apr 03, 2015",
  "matchup": "LAL vs. POR",
  "headline": "Blazers celebrate division win as Lakers match franchise mark for losses",
  "cleaned_body": "LOS ANGELES -- The Portland Trail Blazers returned to their locker room to find black T-shirts hanging in their stalls with bold red-and-white letters reading \"Northwest Claimed.\"\nDamian Lillard threw a couple into his travel bag, but no Blazers put them on.\nWhile they're thrilled to have some souvenirs from the franchise's first outright division title of the 21st century, the Blazers also are thinking ahead to bigger celebrations.\nC.J. McCollum scored a career-high 27 points, Lillard added 20 and Portland celebrated its Northwest Division title with a 107-77 victory over the Los Angeles Lakers on Friday night.\n\"It's an honor to be a part of this team and do so many things that this organization hasn't done for so long,\" Lillard said.\nArron Afflalo scored 17 points for the Blazers, who clinched the title earlier in the night with Oklahoma City's loss at Memphis. The Northwest crown is the first division title since a co-championship in 2009 for these Blazers, who earned the franchise's first playoff series victory since 2000 last spring.\n\"It's something that we'll always be a part of, and we need to relish this and enjoy it, because it doesn't happen all the time,\" Portland coach Terry Stotts said. \"It's good to be a part of history, winning the title outright. Like I told the team, the banner is going to go up, and we'll always be a part of it.\"\nWith Portland still fighting for home-court advantage later in the playoffs, Lillard and McCollum led a comfortable win to complete its first season sweep of the woebegone Lakers in 21 years.\nLillard outscored the Lakers by himself in the first quarter (14-12), and Portland jumped to a 25-point lead during the second.\n\"I was disappointed at the start, because I didn't think we came out ready,\" Lakers coach Byron Scott said. \"I thought they came out like, 'Listen, let's punch them in the mouth and see how they react.' I didn't think we reacted very well. I'm disappointed in that aspect.\"\nRookie Jordan Clarkson had 27 points, seven rebounds and five assists for the Lakers, who matched the franchise record with their 55th loss.\nLos Angeles will miss the playoffs in consecutive years for the first time since 1976. The Lakers also lost 55 games last season, but their winning percentage (.267) currently is slightly higher than that of the 1957-58 Minneapolis Lakers (.264), who played only 72 games.\nWesley Johnson had 11 points and a career high-tying 15 rebounds for the Lakers, who have lost 14 of 18.\nTIP-INS\nTrail Blazers: Portland might tighten up its rotation down the stretch in the absence of forward Dorell Wright, who is out for at least a month with a broken hand. ... Portland has won three straight road games for the first time since December. ... Portland hadn't won an outright division title since 1999.\nLakers: Before the game, Los Angeles signed guard Dwight Buycks out of the D-League to a 10-day contract. Buycks made his Lakers debut in the final 6 1/2 minutes, scoring eight points with two 3-pointers. ... Clarkson was named the Western Conference's rookie of the month for March. Surprisingly, no Lakers player had won the award before. ... Will Ferrell and Sylvester Stallone watched courtside.\nBIG MC\nMcCollum scored 16 points in the second half to keep Portland comfortably ahead in its fifth straight win over the Lakers. The guard topped his previous career high of 23 points, set March 24 against Golden State. He has thrived in extended playing time with the absence of Wesley Matthews, who was ruled out for the season last month. \"I have a very good opportunity to be productive, to play my game and play to my strengths,\" McCollum said.\nBIG FAN\nA fan in the second row at Staples Center repeatedly held up a No. 12 Lakers jersey with LaMarcus Aldridge's name on the back, getting a laugh from the Portland big man. Aldridge is a free agent after the season, and the Lakers will have significant salary-cap room.\nUP NEXT\nTrail Blazers: Host Pelicans on Saturday.\nLakers: Host Clippers on Sunday.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.400320",
  "pipeline_version": "v1"
}