{
  "game_id": "0021301114",
  "espn_id": "400489987",
  "date": "Apr 02, 2014",
  "matchup": "DET @ IND",
  "headline": "Paul George's 27 points, 13 boards put Pacers back in business",
  "cleaned_body": "INDIANAPOLIS -- The hard part for the Indiana Pacers isn't over. It takes time to climb out of a slump.\n\"Once you're not playing well and you finally get a win, the hardest part is maintaining that consistency,\" Paul George said. \"You have to understand that it's going to be different every night, but you got to find a way to build off the first win.\"\nGeorge had 27 points and 13 rebounds, David West scored 15 points and the Pacers snapped a three-game skid with a 101-94 win over the Detroit Pistons on Wednesday night.\nGeorge hit a 3-pointer from 35-feet to give the Pacers a 94-90 lead with 3:19 remaining and Indiana never trailed the rest of the way.\nJosh Smith scored 15 of his 24 points in the first quarter and finished with five rebounds, and Greg Monroe added 16 points for the Pistons, who have lost four of their last five games.\nBrandon Jennings hit a 3 to get Detroit within 94-93 before George scored, forced a turnover and West hit a jumper to give the Pacers a 98-93 lead with 1:35 left to play.\n\"We were locked in really early in this game,\" George said. \"They made a late push when we were up a good eight points, they made a pretty good push. But I felt our guys were locked in throughout this whole game.\"\nGeorge's two free throws with 8:54 left in the third gave Indiana a 58-50 lead. The Pistons bounced back with a 9-0 run and Rodney Stuckey hit a 3-pointer to give Detroit a 74-73 lead with 13 seconds left in the third.\nThe Pacers gave fans mixed signals. At times Indiana's sluggish play showed signs of a team that continues to struggle with chemistry, shooting and turnovers.\nThe Pistons scored 17 points off 10 Indiana turnovers.\nAt other times the Pacers looked like the same old team fans were used to before the All-Star break.\nBankers Life Fieldhouse was abnormally silent when the Pistons went on an 8-0 run midway through the first quarter and took a 23-14 lead after Monroe scored with 4:19 left in the opening quarter.\nThen the Pacers showed signs of life.\nThey went on a 12-2 spurt to close out the first. George scored to give the Pacers a 28-27 lead with 20 seconds left in the first.\nEvan Turner dunked and West scored to give the Pacers a 35-32 lead with 8:03 remaining in the second quarter.\n\"We had good pace, we threw it up the floor, we attacked,\" Pistons interim coach John Loyer said. \"I can't fault the way our guys played. They competed their butts off against the best team in the East.\"\nThe Pistons went on an 8-0 run to take 40-35 lead with 5:13 left in the second quarter.\nStephenson then sparked a 10-0 surge with a one-handed dunk and George closed it out with a 3 to give the Pacers a 45-40 advantage with 3:20 left in the half.\nGeorge's free throw with 31 seconds left in the second gave the Pacers a 50-46 lead at halftime.\nThe Pistons handed Indiana its first home loss of the season, 101-96 back on Dec. 16 -- one of the few positives for Detroit this season. The Pacers won twice in Detroit, including a 112-104 overtime win on March 15.\nIndiana hopes Wednesday's win over the Pistons is the start to getting back to playing at the level they were.\n\"You get a win, but you have to string a couple together,\" Pacers center Roy Hibbert said. \"Winning is hard work. We have to see if we can keep it going.\"\nIt won't be easy.\nThe Pacers play three of their next four games on the road. They go to Toronto on Friday and will host Atlanta on Sunday before going on the road to Milwaukee and Miami next week.\nThey host Oklahoma City on April 13 in Indiana's final home game before the playoffs.\nGame notes\nDetroit G Chauncey Billups was out after left knee surgery. ... Pistons G Josh Harrellson was out with a knee injury, C Andrew Bynum was out with a sore right knee and G C.J. Watson was out with a right hamstring straight. ... Hibbert left the game with 1:21 left in the first quarter after he hit the back of his head falling to the ground on a Flagrant 1 foul called on Charlie Villanueva. Team officials said Hibbert has questionable with a sore neck, but he started the second half. . The Pistons shot 44 percent in the first quarter and led by as many as nine points, but went 23 of 68 (33.8 percent) in the final three quarters.",
  "tags_rule": [
    "InjuryReport",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.336199",
  "pipeline_version": "v1"
}