{
  "game_id": "0022100603",
  "espn_id": "401360422",
  "date": "Jan 09, 2022",
  "matchup": "CHI @ DAL",
  "headline": "Doncic has triple-double, Mavericks beat Bulls 113-99",
  "cleaned_body": "DALLAS -- — Luka Doncic had 22 points, 14 rebounds and 14 assists for his third triple-double of the season as the Dallas Mavericks beat Chicago 113-99 on Sunday night for their season-best sixth straight win while snapping the Bulls’ nine-game winning streak.\n\nJosh Green and Maxi Kleber had season highs with 18 points each for Dallas. It was a career high for Green, who scored nine in the fourth quarter, and Kleber tied a career high hitting six shots behind the arc in nine attempts. Jalen Brunson added 17 points, Dorian Finney-Smith had 12 and Dwight Powell 10.\n\nDoncic, back in the lineup after missing the previous game with a right ankle sprain, got his first triple-double since Nov. 29 and has 39 in his four-year NBA career.\n\n“He looked all right, didn’t he?” said Mavericks assistant coach Sean Sweeney, who led the team for the second straight game after Jason Kidd was placed in the NBA health and safety protocols on Friday.\n\nDallas has averaged winning by 15.7 points during its streak and has held opponents to 93.0 points.\n\n“The (defensive) togetherness combined with the effort has been really, really strong as of late,” Sweeney said. “We’re doing a real good job of is understanding what the plan is and then, if there isn’t something that we prepared for, cover for each other when it’s needed.”\n\nDeMar DeRozan and Zach LaVine scored 20 points each to lead the Bulls. Chicago went in averaging 111.3 points per game, eighth best in the league, and was held to double figures for the first time since Dec. 11.\n\nThe Bulls went in leading the NBA in 3-point shooting at 38.7% but with a league-low 29.9 attempts. They hit 7 of 15 in the first half but only 4 of 18 afterward to finish 11 for 33 for 33.3%. “We made guys shoot what we wanted (them) to shoot.,” said Kleber, whose previous game with six 3s came on 12 shots. “Everybody was sticking to the game plan. We never lost our cool.”\n\nThe Bulls fell short of getting their longest streak since 1997-98, in the last of Michael Jordan’s six championship seasons.\n\n“What these guys had done night in and night out to get to nine wins in a row, I’m really, really proud of what they did,” Chicago coach Billy Donovan.\n\n“It would have been nice to get to 10 (consecutive wins), double digits, but we didn’t play good enough to win,” said Nikola Vucevic, who scored 13 points.\n\nThe Mavericks led 83-81 after DeRozan opened the fourth quarter with a 15-foot jumper. Dallas then outscored Chicago 19-7 to take a 102-88 lead with 6:24 to play.\n\nREMEMBER WHEN\n\nGo back to the championship season of 2010-11 to find a Dallas winning streak longer than six games. That season, the Mavericks had regular-season runs of 12, 10 and eight games and had a seven-game streak during the playoffs.\n\nSUCCESSFUL ENCORE\n\nGreen, the Mavericks’ first-round draft pick in 2020, scored a career-high 17 points last Friday in the 24-point win at Houston. That career best lasted fewer than 48 hours.\n\n“I feel like I was able to find a groove and just be able to build off that,” Green said.\n\nWE’VE GOT SPIRIT, HOW ‘BOUT YOU?\n\nLate in the third quarter, the sizable contingent on Bulls fans at American Airlines Center broke into a chant of “MVP!” when DeRozan stepped to the free-throw line. When Doncic got ready to shoot free throws about 40 seconds later, the majority of fans in the building predictably delivered a louder rendition of the same chant.\n\nTIP-INS\n\nBulls: Coby White scored 11 points in the first half for his seventh straight double-figure game and finished with 13. ... F Patrick Williams (wrist broken in late October) has had a cast replaced by a brace.\n\nMavericks: Kristaps Porzingis missed his fifth straight game while in the protocol. … Doncic, No. 77, had seven points, seven rebounds and seven assists at halftime. … Dallas’ only free throw of the first half was shot with 1:17 left when Green completed a three-point play.\n\nUP NEXT\n\nBulls: Host Detroit on Tuesday night to begin a three-game homestand.\n\nMavericks: At New York on Wednesday night.\n\n----",
  "tags_rule": [
    "TripleDouble",
    "Streak",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.728876",
  "pipeline_version": "v1"
}