{
  "game_id": "0021301099",
  "espn_id": "400489972",
  "date": "Mar 30, 2014",
  "matchup": "POR vs. MEM",
  "headline": "LaMarcus Aldridge's 28 lead Blazers past Grizzlies",
  "cleaned_body": "PORTLAND, Ore. -- A healthy LaMarcus Aldridge makes a world of difference for the Portland Trail Blazers.\nAldridge scored 28 points in his third game back from injury and the Trail Blazers extended their winning streak to three games with a 105-98 victory over the Memphis Grizzlies on Sunday night.\n\"Whether he's scoring or not, just getting him touches has a big effect on the game, has a big effect on how the defense reads our offense,\" Blazers center Robin Lopez said of Aldridge.\n\nReserve Mo Williams added 17 points and Wesley Matthews had 15 for the Blazers, who avoided a three-game sweep in the season series.\n\"LA coming back has brought us back to what we do and how we do it,\" Williams said. \"With LA, we know what we need to do and where we need to go, where we get our shots, and when to be aggressive.\"\nPortland opened a two-game lead over Golden State for the fifth place in the Western Conference playoff race and pulled within 2½ games of No. 4 Houston with seven games remaining.\nZach Randolph scored 21 points and Marc Gasol had 20 for the Grizzlies, who lost back-to-back games for the first time since Feb. 3-5 and dropped a half-game behind idle Dallas for the West's eighth and final playoff berth.\nThe Blazers shot 52.0 percent (39 of 75) and had five players score in double figures.\nAldridge, who missed seven games with a back contusion, was the catalyst on offense, making 10 of 20 shots from the field and going 8 for 8 at the free-throw line.\nThe Grizzlies were determined to play Aldridge straight up defensively and not double, as they had in their two wins over Portland. Memphis looked mostly to Randolph, their 6-foot-9, 260-pound power forward, to go toe-to-toe with the Blazers' All-Star.\n\"LaMarcus is their horse,\" Randolph said. \"He's what makes them go, so anytime you've got your best player out there, it makes a difference.\"\nPortland dominated the second quarter, making 10 of 16 shots (62.5 percent) and getting eight points from both Aldridge and Williams to extend a two-point lead at the end of the first quarter to a 57-45 halftime advantage.\n\"We knew exactly what they were going to run,\" Grizzlies guard Tony Allen said. \"It was a great game plan defensively, and they executed.\"\nMathews and Aldridge combined for 13 points during a first quarter that had eight lead changes and six ties before Will Barton followed his own miss to score and give the Blazers a 25-23 lead.\nThe Grizzlies, making their third stop on a five-game swing, made 3 of 14 shots in the first six minutes of the second quarter and were outscored 16-6 as the Blazers extended the lead to 41-29 on two free throws by Aldridge with 5:59 left in the half.\n\"We matched Memphis' physicality,\" Blazers coach Terry Stotts said. \"Our shooting lineup gave us some separation in the first half. We got a lot of good effort off the bench, too.\"\nMike Conley's 3-pointer pulled the Grizzlies within 43-34, but the Blazers reeled off six quick points to open their largest lead of the second quarter, going up 49-34 when Damian Lillard set up Thomas Robinson for a transition layup with 3:58 to play in the half.\nLillard, held scoreless on 0-for-3 shooting in the first half, hit his first four shots of the second half, including a 3-pointer that pushed Portland's lead to 78-60.\nTrailing 91-70 early in the fourth, the Grizzlies mounted one final push and cut the Blazers' lead to 103-96 on James Johnson's 3-pointer from the left corner with 1:12 to play.\nGasol's basket pulled Memphis within 103-98 before Lillard made two free throws with 6 seconds left to close out the scoring.\n\"Portland came out more aggressive and played with more energy,\" Grizzlies coach David Joerger said. \"They have a ton of playmakers and they made us chase them all around the floor.\"\nGame notes\nThe Grizzlies are 16-1 record in road games in which they hold teams to fewer than 90 points and are now 4-15 record when allowing more than 90 points. . Portland's 105 points were the most against Memphis during all of March. The Grizzlies entered Sunday's game leading the West in points allowed at 94.0 points per game. . Lopez became the fourth Blazer to record 300 offensive rebounds in a season, joining Kermit Washington, Buck Williams and Chris Dudley. . After making all five of his free throws, Matthews has made 36 consecutive foul shots dating to March 14 at New Orleans.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.242572",
  "pipeline_version": "v1"
}