{
  "game_id": "0022100344",
  "espn_id": "401360168",
  "date": "Dec 04, 2021",
  "matchup": "MIL vs. MIA",
  "headline": "Bucks rout short-handed Heat 124-102 without Antetokounmpo",
  "cleaned_body": "MILWAUKEE -- — It wasn’t exactly a revenge game for the Milwaukee Bucks, though it felt good.\n\nPat Connaughton made seven 3-pointers and scored 23 points, and the Bucks avenged an embarrassing loss from the second game of the season, beating the Heat 124-102 on Saturday night despite playing without Giannis Antetokounmpo.\n\nMilwaukee led by as many as 31 points against a depleted Heat team missing Jimmy Butler and Bam Adebayo due to injuries. Antetokounmpo sat out with a right calf injury.\n\nThe Heat routed Milwaukee 137-95 in Miami but the Bucks dominated this time behind Khris Middleton, Connaughton and Jrue Holiday.\n\n“We just wanted to go out there and build good habits, just be the best team we can on a day-to-day basis,” said Bucks center Bobby Portis, who had 19 points and a career high-tying 16 rebounds. “It’s not about the Miami Heat and us playing against them.”\n\nConnaughton was 7 of 13 on 3s, tying his career high, and Middleton had 22 points, nine assists and six rebounds in 30 minutes. Holiday scored all of his 16 points in the first half as Milwaukee sprinted to a 17-point lead at intermission.\n\n“I thought he was great,” Bucks coach Mike Budenholzer said. “We needed that burst out of the gate. We got a little bit of separation in the first quarter (34-23) which I thought was important.”\n\nThe Bucks extended their lead to 105-76 after three quarters as Middleton and Portis took over.\n\nDeMarcus Cousins added 11 points in his second game with the Bucks and Thanasis Antetokounmpo had 10. Cousins joined the team earlier in the week to help make up for the absence of Brook Lopez, out indefinitely after undergoing back surgery.\n\n“He’s another big that we really needed,” Portis said. “We were thin on big men and he came in and did his thing. We can feed him in the post and he’s a great passer. He can shoot the ball and get to the free throw line. He can do a lot of things and he’s still a force.”\n\nMax Strus scored 25 points for Miami, making five 3-pointers. Caleb Martin had 16 points and Herro scored 15.\n\nThe Bucks scored 26 second-chance points and outscored Miami in the paint, 48-26. Milwaukee also did a solid job on Herro and Duncan Robinson, who were a combined 8 for 27 from the field.\n\nRINGING OUT\n\nP.J. Tucker played a huge role in the Bucks’ playoff run to the NBA title last season, and he received a thunderous standing ovation from the Fiserv Forum crowd as he received his championship ring prior to the game.\n\nThe 36-year-old forward, who played physical defense against Brooklyn’s Kevin Durant in the Eastern Conference semifinals, is now making an impact as Miami’s starting power forward.\n\n“It’s been a great fit,” Heat coach Erik Spoelstra said. “We have a lot of similar values in how we view competition. We’ve been a fan of his for a long time.\n\n“Tonight is a special night as well. He was a big key to their championship run last year, and we want to celebrate that with him. It’s the toughest thing to do in this profession, to come collectively together and try to win a championship.”\n\nTucker soaked in the moment as he received his ring and said, “I love you forever, Milwaukee. We’ll always be dogs.”\n\nWELCOME BACK\n\nVeteran guard Wesley Matthews was back with the Bucks after signing a one-year deal Friday. The former Marquette player, who was with the Los Angeles Lakers last season, had not signed with any NBA team this season.\n\nMatthews averaged 7.4 points and shot 36.4% from 3-point range in 67 games (all starts) with Milwaukee during the 2019-20 season.\n\n“Wesley is a guy who always takes pride in taking the best perimeter player on the other team,” Bucks coach Mike Budenholzer said. “He has incredible attention to detail and is a focused defender. Offensively, he has ability to spread the court and make shots, make 3s. I think we really need him and he’s going to help us in the short term and the long term, too.”\n\nMatthews played 11 minutes and had three points.\n\nTIP-INS\n\nHeat: Butler missed his fourth straight game after injuring his tailbone in a fall against the Chicago Bulls on Nov. 27. Butler leads Miami in scoring at 23.6 points per game. Adebayo is sidelined with a torn ligament in his right thumb.\n\nBucks: Giannis Antetokounmpo missed his second consecutive game with a right calf injury and starting guard Grayson Allen was out with illness. Veteran backup guard George Hill also was out with a right knee injury and two-way player Javonte Smart filled in as the backup point guard and had eight points in 29 minutes in his NBA debut. ... Rookie Sandro Mamukelashvili made his first NBA start. ... Antetokounmpo had played in all 21 games prior to Wednesday night in Toronto, when he sat out in Milwaukee’s 97-93 loss. … Team officials surprised retired broadcaster Jim Paschke by dedicating the Bucks interview room in his name. Paschke retired earlier this year after 35 years with the team.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:50.771282",
  "pipeline_version": "v1"
}