{
  "game_id": "0021700543",
  "espn_id": "400975289",
  "date": "Dec 31, 2017",
  "matchup": "MEM @ SAC",
  "headline": "Tyreke  Evans scores 26 points, Grizzlies beat Kings 114-96",
  "cleaned_body": "SACRAMENTO, Calif. --  Tyreke Evans' decision to gamble and sign a one-year deal with Memphis this past offseason is looking increasingly more like a safe bet for the veteran guard.\n\nHis troublesome right knee is no longer bothering him as much, either.\n\nEvans had 26 points, seven rebounds and five assists against his former team and the Grizzlies beat the Sacramento Kings 114-96 on Sunday.\n\n\"I love playing against the team that drafted me,\" Evans said. \"Most of the time when I (come) back I've played well. It just gets me going.\"\n\nEvans shot 10 of 16 and had five 3-pointers. He spent two stints with Sacramento and was most recently with the team in 2016.\n\nThe 2010 rookie of the year saw his stock drop after multiple knee surgeries that cost him 99 games over the past two seasons before he signed with Memphis. Healthy this season, Evans is looking more like his former self.\n\nEvans has scored 20 or more in 19 games this season and is shooting a career-high 42.6 percent on 3-pointers.\n\n\"He's had that edge all year,\" Memphis center Marc Gasol said. \"He's had that same mentality so don't take it like he came in here and did something he hasn't done every game. He's come with that aggressiveness.\"\n\nJarell Martin added 11 points and three others had 10 points apiece on a day all 13 players scored for the Grizzlies.\n\nOne day after setting a season high for scoring in a 141-128 loss to the Golden State Warriors, Memphis had another big offensive game in a blowout of stumbling Sacramento.\n\nThe Grizzlies scored 35 points in the first quarter and led by 14 or more at the end of every quarter. Wayne Selden punctuated the win with a dunk that put Memphis up 104-71 with 7:25 remaining.\n\n\"That's the growth we've been looking for in our offense,\" Grizzlies coach J.B. Bickerstaff said. \"For our guys not to hang their head and continue to believe in what we're doing, it shows the steps that we're taking.\"\n\nThe Kings trailed by as many as 33 and missed 11 of 24 free throws and trailed for the final 43 minutes.\n\nIt's the second consecutive year that the two teams played on New Year's Eve. The Grizzlies won both.\n\nWillie Cauley-Stein had 21 points and eight rebounds for the Kings. Buddy Hield added 15 points, and Garrett Temple had 13.\n\nMario Chalmers made a pair of 3-pointers and had eight points in five minutes during Memphis' 36-point first quarter and was involved in a strange sequence of events at the end of the period.\n\nFrank Mason attempted a halfcourt shot at the buzzer and missed while being defended by Chalmers. After officials reviewed the play Mason, who was upset over not the call from the refs, was charged with a technical and Chalmers was called for a foul.\n\nThe Grizzlies led by 24 before a late Sacramento surge cut the gap to 64-46 at halftime.\n\n\"Lack of focus and lack of force,\" Kings coach Dave Joerger said. \"They looked at us and shot over us, and then looked us and drove around us. Each guy has to own their own stuff.\"\n\nOLD FRIENDS\n\nEvans wasn't the only player facing his former team.\n\nZach Randolph, a two-time All-Star over eight seasons who helped Memphis reach the 2013 Western Conference finals before signing with Sacramento in the offseason, had four points and six rebounds. Randolph spent most of the game going against Gasol, his longtime teammate.\n\n\"So many thing go through your head, so many emotions,\" Gasol said. \"Truly a brother. We made each other better when we were playing together, we made each other better in practice when we battled each other. I miss him every day.\"\n\nTIP-INS\n\nGrizzlies: Gasol was called for a technical foul in the fourth quarter after arguing with an official. ... Memphis shot 60 percent (12 of 20) in the first quarter.\n\nKings: Mason limped off the court with a bruised left heel after making two of three free throws on the foul by Chalmers. Mason, who appeared to get hurt a few plays earlier, did not return.\n\nUP NEXT\n\nGrizzlies: At Los Angeles Clippers on Tuesday night.\n\nKings: Host Charlotte on Tuesday night.",
  "tags_rule": [
    "InjuryReport",
    "PhysicalGame",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.352188",
  "pipeline_version": "v1"
}