{
  "game_id": "0021700401",
  "espn_id": "400975152",
  "date": "Dec 12, 2017",
  "matchup": "MIN vs. PHI",
  "headline": "Embiid scores 28 in return as Sixers top Wolves, 118-112",
  "cleaned_body": "MINNEAPOLIS --  Joel Embiid was a spectator for two games, and that was long enough for the Philadelphia big man to get antsy.\n\nEmbiid scored 28 points in his return to the lineup and the 76ers topped the Minnesota Timberwolves 118-112 in overtime Tuesday night to stop a four-game losing streak.\n\n\"We needed this,\" Embiid said. \"My goal is to always bring back a lot of energy. Obviously use my skills, but a lot of it is just playing hard.\"\n\nAfter missing two games with back tightness, Embiid hit two free throws with 14.8 seconds remaining to force overtime. Then he scored seven points in the extra session, including a 3-pointer that gave Philadelphia a seven-point lead in the final two minutes.\n\nJ.J. Redick scored 24 points and made all 11 of his free throws for the Sixers.\n\nJimmy Butler led Minnesota with a season-high 38 points, including a pair of 3s in the final minute of regulation.\n\nEmbiid got the better of Karl-Anthony Towns as the talented 7-footers battled down low all night. Towns had 17 points and 15 rebounds, his 22nd double-double of the season.\n\n\"Last year I was really excited to play against him,\" Embiid said. \"This year was treated like a regular game and we got the win.\"\n\nBefore Butler hit a 3-pointer with 47.6 seconds to play in regulation, Minnesota was 1 for 21 from long range. Butler connected again with 17.8 seconds remaining, but his step-back jumper at the buzzer fell short as the game went to overtime.\n\nButler had 14 fourth-quarter points and helped the Timberwolves build a seven-point lead early in the period. But his late heroics weren't enough.\n\n\"Jimmy was fantastic tonight,\" Towns said. \"I didn't do anything tonight to help him.\"\n\nPhiladelphia jumped out to an early lead in overtime, aided by three free throws from Redick. A dunk by rookie Ben Simmons provided an answer for the Sixers after Minnesota threatened to climb back into it.\n\nThe turnover discrepancy was lopsided. Philadelphia committed 24 turnovers while the Timberwolves turned the ball over just 10 times.\n\nYet despite sloppy play at times, the Sixers didn't end up getting hurt in the end by the turnover margin.\n\n\"It is so frustrating, because they play their hearts out and you just keep squirting the ball around the gym,\" 76ers coach Brett Brown said. \"We were lucky to get out of it with a win with that many turnovers.\"\n\nMinnesota shot just 5 for 29 from 3-point range and was 1 for 13 from deep in the first half. Andrew Wiggins went 8 of 24 overall and 1 of 7 from beyond the arc.\n\n\"Every night, your shot's not going to fall,\" Wiggins said. \"We didn't shoot great from the 3-point line, but that's basketball. You're not going to make all the shots.\"\n\nTimberwolves coach Tom Thibodeau used just three reserves despite visible fatigue from his starting five. Towns and Butler each topped 40 minutes in regulation.\n\nThough four starters played 39 minutes or more, Minnesota players said that wasn't the reason they lost.\n\n\"I think we need to get into better shape if we're tired,\" Butler said. \"Do whatever it takes for this team, this organization, to win. If you're tired, run some extra laps after practice.\"\n\nTIP-INS\n\n76ers: Simmons, who entered averaging 18 points per game, didn't score until 1:17 remained in the fourth quarter when he had a dunk. He finished with seven points. ... The Sixers set a season worst for turnovers. Their previous high was 22 on Nov. 7 against Utah.\n\nTimberwolves: F Nemanja Bjelica missed his 10th straight game with a foot injury. ... Minnesota fell to 5-10 when committing fewer than 15 turnovers in a game. The Timberwolves are 11-2 when turning the ball over 15 or more times.\n\nCLUTCH AT THE LINE\n\nPhiladelphia got to the free throw line 13 times in overtime and made 11 of those shots. The Sixers shot 84.4 percent (27 for 32) from the line overall. Minnesota, meanwhile, was 19 of 27 (70.4 percent) from the stripe.\n\n\"Putting them at the line hurt us,\" Thibodeau said.\n\nIn addition to Redick's perfect performance, Embiid was 11 for 12 at the foul line. Philadelphia entered shooting 74.4 percent on free throws.\n\nUP NEXT\n\n76ers: At the Oklahoma City Thunder on Friday.\n\nTimberwolves: Home against the Sacramento Kings on Thursday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "Streak",
    "ThreePointExplosion",
    "CoachComment",
    "EarlyRun",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.609774",
  "pipeline_version": "v1"
}