{
  "game_id": "0021700459",
  "espn_id": "400975210",
  "date": "Dec 20, 2017",
  "matchup": "LAL @ HOU",
  "headline": "Kuzma, Lakers overcome Harden's 51 to end Rockets' streak",
  "cleaned_body": "HOUSTON --  Lakers rookie Kyle Kuzma set career highs with 38 points and seven 3-pointers against the NBA's hottest team, and he wasn't all that impressed with it.\n\n\"Why not? I scored 30s in summer league, so...,\" he said before trailing off.\n\nThe stakes were a little higher Wednesday night. Kuzma helped the Lakers overcome James Harden's 51 points and end the Rockets' winning streak at 14 games with a 122-116 victory.\n\n\"It's a better team but it's the same mentality,\" Kuzma said. \"I've got the same mentality every time I step on the court. I try to play my hardest and just be locked in.\"\n\nHouston lost for the first time since Nov. 14, while the Lakers snapped a three-game skid. It was tied before Los Angeles scored 10 straight points -- while Houston missed seven shots in a row -- to go up 110-100 with about four minutes left.\n\nHouston ended an almost four-minute scoring drought when Harden made a free throw, and he added three more after being fouled on a 3-point attempt a few seconds later to cut it to 110-104. But former Rocket Corey Brewer, who finished with 21 points, made a 3-pointer before Lonzo Ball hit two free throws to make it 115-104.\n\n\"The fact that we were able to kind of punch them early and you knew that run was coming and then find our composure again and hit some big plays and get some big stops, it was really good to see from our group,\" Lakers coach Luke Walton said.\n\nHarden powered Houston on a night when Chris Paul had just eight points before leaving early in the fourth quarter with a sore left leg.\n\nThe Rockets made seven free throws down the stretch but hit just four field goals in the last eight minutes -- all in the final 1:05.\n\n\"We didn't play defense at all today,\" Houston's Trevor Ariza said. \"They got whatever they wanted and when that happens, you lose.\"\n\nKuzma was unstoppable in the first half, making all nine of his shots, including six 3-pointers. He cooled a bit after the break and finished 12 of 17 overall and 7 of 10 from deep.\n\nThe Lakers led 100-92 after a 3-pointer by Josh Hart with about nine minutes to go, but the Rockets scored the next eight points. Ariza led the way in that span, scoring five points and blocking a shot by Brandon Ingram.\n\nThe Rockets opened the third with a 6-1 run for their first lead of the game, 65-64, with about 9 1/2 minutes left in the quarter.\n\nPaul tied it on a 3-pointer later in the third, but Brewer made the last five points of the period to put the Lakers up 94-89 entering the fourth.\n\nThe Lakers led by 22 points during the first half, but Houston used a 12-2 run midway through the second to cut the deficit and a 7-2 spurt to end that quarter to get within 63-59 at halftime.\n\nTIP-INS\n\nLakers: C Brook Lopez sat out with a sprained right ankle. ... Ball finished with 16 points and nine rebounds. ... The Lakers made 15 3-pointers.\n\nRockets: Harden set a franchise record by scoring at least 20 points in his 30th straight game. The previous record was held by Moses Malone, who did it in 29 straight games in the 1981-82 season. ... C Clint Capela missed the game with a bruised left foot. Coach Mike D'Antoni said it could keep him out a couple more days, but he doesn't expect him to be out for an extended period of time. ... Ryan Anderson received a technical foul after kicking the ball following a personal foul near the end of the third quarter.\n\nWHEN HARDEN SCORES 50\n\nWednesday was Harden's second 50-point game of the season after he scored a career-high 56 points in a win over the Jazz on Nov. 5. It was the seventh time in his career he's scored 50 or more points with all of those games coming with the Rockets. Houston had won the previous six games when he reached the mark.\n\nTHEY SAID IT\n\nBrewer on his success Wednesday: \"It might have been sleeping in my own bed for sure. It's always good to come back to Houston and I love playing here.\"\n\nUP NEXT\n\nLakers: Visit the Warriors on Friday night.\n\nRockets: Host the Clippers on Friday night.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "ThreePointExplosion",
    "CoachComment",
    "CareerHigh",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.251076",
  "pipeline_version": "v1"
}