{
  "game_id": "0021700770",
  "espn_id": "400975516",
  "date": "Feb 02, 2018",
  "matchup": "MIA @ PHI",
  "headline": "76ers get in on Philly's Super Bowl bash with win over Heat",
  "cleaned_body": "PHILADELPHIA --  Joel Embiid is set to crash Philly's Super Bowl bash.\n\nEmbiid and a couple of Sixers teammates are headed to Minnesota to root for the Philadelphia Eagles in the Super Bowl.\n\n\"I've heard that's the biggest event in American sports,\" said Embiid, a native of Cameroon.\n\nOh yes, Embiid heard correct.\n\nHere's another piece of intel that may be harder to believe: Embiid's weekend pregame show starts with a double dip of NBA action.\n\nEmbiid opened the first set of back-to-back games in his career with 17 points and 11 rebounds to help lead the 76ers to a 103-97 win over the Miami Heat on Friday night.\n\nAll the dunks, blocks and 3-pointers at times seemed like background music at what turned into Philly's largest Super Bowl tailgate party. The Sixers cloaked the Wells Fargo Center in green -- from the giveaway \"Brotherly Love\" T-shirts imprinted with the Sixers and Eagles logos to the balloons, signage, and even the table runners on press row.\n\nThe packed house erupted in unison to belt out the \"Fly, Eagles, Fly\" fight song that's as ubiquitous at Philly sporting events as \"Rocky\" movie clips. They broke out enough \"E-A-G-L-E-S! Eagles!\" chants to make the arena sound like the Linc right before kickoff.\n\nThe day kicked off at the same arena with Wing Bowl, Philly's own competitive eating competition. Molly Schuyler gnawed her way through a record 501 chicken wings in 30 minutes to win her third Wing Bowl.\n\nAnd they say Philly doesn't crown champions.\n\nThe city could get another taste should the Eagles win their first Super Bowl.\n\n\"I want to feel that experience,\" Embiid said. \"I want to mix it up. Go in the suite. Then sit in the stands. I want to feel like a regular person to do that.\"\n\nThe Heat nearly harshed Philly's mellow when they turned a 28-point hole into a four-point game on Wayne Ellington's 3-pointer with 25 seconds left.\n\nBut the biggest win for the Sixers may be this: Embiid is set to play games on consecutive nights for the first time since he was picked No. 3 overall in the 2014 draft.\n\n\"I feel like I've been ready,\" Embiid said. \"Now, I'm going to feel like an NBA player. Taking days off in the NBA is not that easy.\"\n\nEmbiid, selected to his first All-Star team, missed his first two seasons with injuries and the Sixers have been leery of pushing their 7-foot-2 center into major minutes over the last two seasons.\n\nEmbiid should be in the starting lineup Saturday at Indiana.\n\n\"We're in a rhythm now. It's tough when he comes out and we've got to back into another rhythm,\" Sixers rookie Ben Simmons said.\n\nThe Sixers are eighth in the Eastern Conference playoff standings and clearly need a healthy Embiid down the stretch to crack the postseason for the first time since 2012. Coach Brett Brown said Embiid will play in back-to-backs because he's been cleared to go -- not to avoid the lousy optics in two weeks of playing in the Rising Stars Challenge, the Skills Challenge and the All-Star game all packed into 48 hours.\n\n\"Joel's availability has got nothing to do with desperation or crunch time. It's all about his health,\" Brown said.\n\nFueled by the Super Bowl frenzy, Philadelphia hit 'em low (30 points in the paint), hit 'em high (three 3s) and watched that scoreboard fly all the way to a 51-41 lead at halftime.\n\nDario Saric made his first five buckets, growled like a dog (Eagles fans have worn dog masks in the playoffs) and had 17 points and 10 rebounds.\n\nTIP-INS\n\nHeat: The Heat outscored the 76ers 37-17 in the fourth quarter. Kelly Olynyk scored 19 points.\n\n\"We should have no regrets in this game. We laid it out there,\" Heat coach Erik Spoelstra said.\n\n76ers: Brown gave the Sixers permission to attend the Super Bowl. \"We're in Indiana. It's not like it's a ridiculous journey,\" Brown said. Brown said the Sixers will not have Monday off from practice. ... Brown said as of yet no one from the Sixers has talked to anyone involved with All-Star weekend about limiting Embiid's minutes.\n\nSIMMONS SNUB\n\nSimmons, the star guard who felt snubbed from the All-Star game, scored 20 points.\n\n\"I mean, if I was an All-Star, I'd be on the All-Star team,\" Simmons said. \"It's a little frustrating but if you look back at how many rookies have made it, it's not one of those things that makes or breaks your career.\"\n\nFEELING SICK\n\nHeat C Hassan Whiteside left the game in the fourth quarter with an undisclosed illness.\n\nUP NEXT\n\nThe Heat play Saturday at Detroit and will host Orlando on Monday night.\n\nThe Sixers play at Indiana on Saturday.\n\n---\n\nMore NBA basketball: https://apnews.com/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.227310",
  "pipeline_version": "v1"
}