{
  "game_id": "0022100577",
  "espn_id": "401360396",
  "date": "Jan 05, 2022",
  "matchup": "SAC vs. ATL",
  "headline": "Huerter's late charge lifts Hawks over Kings 108-102",
  "cleaned_body": "SACRAMENTO, Calif. -- — Kevin Huerter scored five of his 25 points in the final 38 seconds and the short-handed Atlanta Hawks held off the Sacramento Kings 108-102 on Wednesday night.\n\nHuerter added 11 rebounds for his first double-double of the season, helping the Hawks to their third win in nine games. Clint Capella added 11 points and 14 rebounds, and six of Atlanta’s eight players scored in double figures. Cam Reddish had 18 points.\n\n“It was for sure a step in the right direction today,” Huerter said. “It was kind of offense by committee for most of the game. It’s easy to make excuses with the amount of guys we have out but (Sacramento) was on a back-to-back, we had yesterday off and we had enough guys to win the game.”\n\nHuerter’s timing was perfect for Atlanta.\n\nHawks star Trae Young sat out with a lower back bruise two days after putting up a career-high 56 points in a loss at Portland, but the news wasn’t all bad for Atlanta. John Collins, out since Christmas Day on the COVID-19 list, was cleared to return, along with Bogdan Bogdanovich and Jalen Johnson. The three did not play but are expected to join the team in Los Angeles later this week.\n\n“We’re dealing with a lot of different circumstances right now in terms of balancing out the lineup, balancing out the players we have, what they can contribute,” Hawks assistant coach Joe Prunty said. “A lot of guys played big minutes tonight. It worked out for us. Everybody that played in this game contributed in one form or another, and we need to do that every night.”\n\nDe’Aaron Fox had 30 points and six assists for Sacramento. The Kings had won their previous five against the Hawks but fell behind early and struggled to catch up.\n\n“Somewhere along the line, you just have to dig in and you have to come up with a stop to put yourself in position to win a game like that,” Kings interim coach Alvin Gentry said. “We have to be much, much better at home than we are. I like that we battled, but we have to find a way to finish.”\n\nAfter Fox moved between two defenders and converted a three-point play to tie it at 101, Huerter drove across the key and flipped the ball off the backboard with his right hand to score with 37.7 seconds remaining. Huerter added three free throws to extend Atlanta’s lead to 106-101.\n\nHuerter had 11 points in the fourth quarter overall.\n\n“Kevin was great from the moment he came in the game.” Prunty said. “He was great from the beginning. He helped keep us organized as well on both ends of the floor.”\n\nFox and Buddy Hield both shot airballs in the final 25 seconds.\n\nSacramento came out sluggish in the second half of its back to back. The Kings shot 33.3 % in the first two quarters and trailed by nine at the half.\n\nTIP-INS\n\nHawks: Capella’s double-double is his 22nd of the season. ... Cameron Oliver entered the health and safety protocols earlier in the day.\n\nKings: Davion Mitchell missed his first nine shots. ... Chimezie Metu was entered into the health and safety protocols, joining Richaun Holmes who has missed three games.\n\nUP NEXT\n\nHawks: Face the Lakers in Los Angeles on Friday.\n\nKings: Play the Nuggets in Denver on Friday. Sacramento won all three games in the season series between the two teams last year.\n\n----",
  "tags_rule": [
    "DoubleDouble",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.875750",
  "pipeline_version": "v1"
}