{
  "game_id": "0021200824",
  "espn_id": "400278544",
  "date": "Feb 23, 2013",
  "matchup": "CHA vs. DEN",
  "headline": "Javale McGee has 17 points, 7 dunks as Nuggets down Bobcats",
  "cleaned_body": "CHARLOTTE, N.C. --  Ty Lawson has set a goal for the Denver Nuggets as they close the regular season: 18 wins.\n\nDenver took a step in the right direction Saturday night, pulling away from the Charlotte Bobcats in the fourth quarter for a 113-99 win that snapped a four-game road losing streak.\n\nLawson had a team-high 20 points, marking the 13th time in 19 games he's reached the 20-point plateau, and JaVale McGee had 17 points, including seven of his team's 14 dunks.\n\n\"If we get to 53 or 54 (wins) I think that we'll get that fourth seed\" in the playoffs, Lawson said. \"But we know it's going to be a grind for the next couple weeks, couple months.\"\n\nPerhaps not -- if Lawson keeps playing the way he has.\n\nNuggets coach George Karl said Lawson has developed a better understanding of the rhythm of the game and is becoming more assertive in running the offense. He also said Lawson is gaining confidence with his jumper -- something he didn't have earlier this season.\n\nThe rest, Karl said, might be out of his hands.\n\n\"If he got a fair whistle, he would probably score a lot more points,\" Karl said.\n\nAt several points during the game Karl argued for a foul to be called against the Bobcats. He was slapped with a technical foul when he offered a sarcastic response to the referees after a call finally went his way.\n\n\"Ty sometimes is so strong and so quick, I think he gets hit but he doesn't get knocked off balance,\" Karl said. \"As we are aware, a foul is a foul. I have always felt that skinny guys get more calls than strong fullback type guys. Ty has that body that, you know, he is as fast as anyone in the game but he doesn't ever get knocked off balance and because of that I don't think he gets as many calls as he deserves.\"\n\nLawson said the big difference in recent weeks has been being more aggressive and attacking the basket.\n\n\"I figure when I start being aggressive and getting to the lane, things happen for me whether it's scoring or getting assists,\" Lawson said.\n\nThe Nuggets hadn't won on the road since Jan. 23 but scored 66 points in the paint behind 14 dunks to snap the skid.\n\nLawson had nine of his 20 points in the final quarter and handed out five assists as the Nuggets broke open a close game early in the fourth with a flurry of fast-break points.\n\nKenneth Faried finished with 15 points on 7-of-9 shooting, Corey Brewer had 14 and Andre Iguodala chipped in with 13 points and 10 assists.\n\n\"We just played Nuggets basketball,\" Faried said. \"We ran and were able to get those turnovers, so it helped out on the break.\"\n\nThe Nuggets (35-22), who came in having lost four of their last five overall, led 83-74 entering the fourth quarter.\n\nThat's when Lawson took over, repeatedly driving to the hole for easy baskets. Forced to defend Lawson, the Nuggets moved the ball well, resulting in some easy alley-oop dunks for McGee and Faried.\n\nLawson finally sealed it with about five minutes to play when he put the ball between his legs, freezing Walker, and drove to the basket to score and draw the foul to push the lead to 15.\n\nThe Nuggets came in third in the league in scoring and got their high-flying act in gear with nine dunks in the first half to build a 60-54 lead at the break.\n\nDenver shot 53 percent for the game.\n\nKemba Walker recorded his fourth straight 20-point game for the Bobcats, finishing with 24 on 9-of-14 shooting. Gerald Henderson added 19 points and rookie Jeffery Taylor had 18 for the Bobcats, who have lost 11 of their last 13 -- including three straight at home.\n\nDenver forced 18 Charlotte turnovers, leading to 23 points.\n\n\"We had a lot of turnovers that led to a lot of fast break points for them,\" Taylor said. \"We usually keep our turnover count down, so that was a little uncharacteristic for us.\"\n\nThings won't get much easier for the NBA-worst Bobcats (13-43) as they depart on the four-game trip beginning Tuesday night against the Los Angeles Clippers.\n\nBobcats coach Mike Dunlap was pleased with his team's energy, but agreed that turnovers were the difference.\n\n\"We'd turn it over and they'd get an easy basket,\" Dunlap said.\n\nGame notes Byron Mullens, who had been on fire in recent weeks, was sluggish for the second straight night. Over the past two games, Mullens is 2 of 21 from the field for six points. ... Josh McRoberts, acquired in a trade with Orlando earlier in the week, saw his first action for the Bobcats and had three rebounds but didn't score. ... Faried scored in double figures for the 36th time this season.",
  "tags_rule": [
    "Streak",
    "PhysicalGame",
    "CoachComment",
    "HotShooting"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.905428",
  "pipeline_version": "v1"
}