{
  "game_id": "0021401153",
  "espn_id": "400579445",
  "date": "Apr 05, 2015",
  "matchup": "LAL vs. LAC",
  "headline": "Lakers set franchise low with 56th loss",
  "cleaned_body": "LOS ANGELES -- While the Los Angeles Clippers threw alley-oop passes off the backboard and jumped to a 43-point lead, the Lakers needed two late 3-pointers from a guy on a 10-day contract just to avoid the worst offensive performance in franchise history.\nSouthern California's NBA teams have been on divergent trajectories for a few years now, and the Clippers barely even noticed when they escorted the Lakers to another milestone in their long descent.\nBlake Griffin scored 18 points, DeAndre Jordan added 16 points and 11 rebounds, and the Clippers sent the Lakers to their franchise-record 56th defeat of the season, 106-78 Sunday night.\nWith six games still to play, the Lakers surpassed last season's 27-55 team as the losingest in the 16-time champion franchise's illustrious history.\n\"Obviously, losing doesn't sit well with me, period,\" Lakers coach Byron Scott said. \"So I'm not thinking about the record and all that stuff. It's just the fact the losing part doesn't sit well with me.\n\"Hopefully it doesn't sit well with those guys in the locker room, as well.\"\nMatt Barnes scored 14 points and Chris Paul had 15 assists for the Clippers, who beat the Lakers for the third time this season and a record sixth straight time overall, cementing these teams' complete role reversal.\nYet the Lakers' historic ineptitude even forces the Clippers to search for polite ways to describe their relationship with their Staples Center roommates.\n\"I don't know what it is, but it's just like playing your high school [rival],\" Clippers coach Doc Rivers said. \"It's a rivalry, you know. It is, but it's not. But you know each other. Whenever you know each other, you know the game has meaning.\"\nThe playoff-bound Clippers have won 10 of 11 down the stretch, staying in the tight five-team race behind Golden State for home-court advantage in the first two rounds of the Western Conference playoffs.\nAlthough the Clippers got home early Sunday morning after a road victory in Denver, they never trailed or showed much weariness while setting a franchise record with their 25th road victory of the season.\n\"It's a little different now than it was two, three or four years ago,\" Griffin said of the Clippers' rivalry with the Lakers. \"It's always good to get three [wins] against a division opponent.\"\nThe Clippers opened a 31-game lead over the Lakers in the Pacific Division standings, and the teams will meet again on Tuesday night in a designated Clippers home game.\nPaul and Griffin paced the Clips to a 29-point lead in the third quarter, and the margin grew to 43 points in the fourth while stars rested.\nWesley Johnson scored 16 points for the Lakers, who have lost five of six. They've lost 10 of their past 11 games against the Clippers after winning 143 of the franchises' first 192 meetings.\n\"I don't fully understand the context or the history of everything between the two organizations, but it doesn't matter to me that much, to be honest,\" said first-year Lakers guard Jeremy Lin, who had six points and three turnovers. \"What happened tonight is definitely not a good feeling, so we want to try to make sure that doesn't happen again on Tuesday.\"\nThe Lakers at least avoided playing the lowest-scoring game in franchise history.\nDwight Buycks, who signed a 10-day contract with the club two days earlier, hit back-to-back 3-pointers in the final minutes to push the Lakers' point total past its record-low 70, set in November 2002.\nThe Lakers were already eliminated from the playoffs for the seventh time in franchise history, and it marks only the second time that they've missed the playoffs in consecutive seasons (1974-75 and 1975-76).\nAnd in May, the Lakers are slated to participate in only their fourth draft lottery since it was introduced in 1985.\nTIP-INS\nClippers: G Jamal Crawford missed his 17th straight game with a bruised right calf, although coach Doc Rivers said Crawford had been \"thinking about\" returning for the game. ... After Tuesday's rematch with the Lakers, they get a three-day break.\nLakers: G Nick Young probably won't play again this season, Scott reiterated before the game. He has been out since Feb. 22 with a broken left kneecap. ... Rookie G Jordan Clarkson had two points on 1-for-6 shooting, struggling against Paul.\nPADDING STATS\nThe game turned into a Lob City showcase late in the third quarter, with Paul's superb playmaking and the Clippers' defense leading to a succession of spectacular plays. Paul dribbled the ball between Carlos Boozer's legs to ignite a fast break, and he also threw an alley-oop pass off the backboard to Griffin for a two-handed dunk.\nYet Paul wasn't happy about that highlight-reel pass because it grazed the rim, forcing Griffin to make an even more acrobatic play. Griffin jokingly suggested he deserved a rebound for his effort: \"If it was [Jordan], they might have given it to him.\" Jordan has all but wrapped up the NBA rebounding title.\nUP NEXT:\nClippers: Host Lakers on Tuesday.\nLakers: Visit Clippers on Tuesday.\nInformation from The Associated Press and ESPN.com's Baxter Holmes was used in this report.",
  "tags_rule": [
    "CoachComment",
    "Rivalry",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.090969",
  "pipeline_version": "v1"
}