{
  "game_id": "0021700096",
  "espn_id": "400974847",
  "date": "Oct 30, 2017",
  "matchup": "MEM vs. CHA",
  "headline": "Walker leads late rally to send Hornets over Grizzlies",
  "cleaned_body": "MEMPHIS, Tenn. -- Kemba Walker re-entered the game with under 8 minutes left and things changed for the Charlotte Hornets.\nWalker scored nine of his 27 points in a fourth-quarter rally as the Charlotte handed the Memphis Grizzlies their first home loss of the season with a 104-99 win Monday night.\n\"I was just trying to make plays. Trying to do what I can to help my teammates,\" Walker said of the final stretch, where he also added a couple of assists. \"My main focus was to continue to be aggressive, and if I can't score, try to find other people to score.\"\nJeremy Lamb added 17 points and rookie Malik Monk finished with 13 points.\nMemphis held a 10-point lead with 7:57 remaining, but Walker re-entered the game and kick-started the Charlotte rally, which included an 18-4 run by the Hornets. Memphis couldn't catch Charlotte primarily because they made only 6 of 27 shots in the fourth, including 2 of 11 from outside the arc, many of them coming in the closing minutes as the Grizzlies tried to stop the Hornets rally. There were plenty of close shots missed by Memphis as well.\n\"Everything went wrong at the same time,\" Memphis coach David Fizdale said of the Hornets outscoring Memphis 31-17 in the final period. \"It just seemed like we couldn't make a layup, when we had open layup. When we had open threes, we couldn't make open threes.\"\nTyreke Evans led Memphis with 19 points and 10 rebounds, while Mike Conley finished with 16 points. But Conley was a major part of a 34 percent shooting night for the Grizzlies missing 14 of his 18 shots in the game and all seven from outside the arc.\nJames Ennis III and Dillon Brooks scored 11 points apiece.\n\"I really liked the fight,\" Hornets coach Steve Clifford said.\nTIP-INS\nHornets: Won their first road game this season. ... Monk had a nice representation of fans in the stands. His hometown of Lepanto, Arkansas is about 40 miles from Memphis. ... Walker had a team-high six assists and has led the Hornets in assists in each game this season. ... Dwight Howard had seven rebounds, the first time this season he has not reached double digits.\nGrizzlies: Memphis' last four home games have come against teams playing on the second night of a back-to-back. Charlotte defeated Orlando at home Sunday night. ... The game was Memphis' first of the season against an Eastern Conference team. ... C Marc Gasol was listed as questionable before the game with a bum left ankle, but played, finishing with 10 points. ... The Grizzlies bench continued to dominate opponents, outscoring the Hornets reserves 51-39.\nSHOOTING WOES: Neither team shot particularly well -- Memphis at 34 percent and the Hornets connecting on 42 percent. But that 42 percent marked the first time an opponent has shot above 40 percent against the Grizzlies at FedExForum in five home games this season.\nBIG MAN BATTLE\nThe game featured two big, physical centers in Gasol and Howard, but neither showed their normal offensive production. Howard missed eight of his nine shots and both his free throws for 2 points, while Gasol was 4 of 15 from the field. \"Trust me,\" Gasol said, \"in 10 years, I still haven't met a player that wants to miss on purpose.\"\nLOSING LEADS\nDespite suffering only their second loss, Memphis has squandered significant leads several times already this season. \"I know a lot of it is casual play, and that will get you burnt in this league. It's so easy to lose a lead with the way teams shoot the ball,\" Fizdale said.\nUP NEXT\nHORNETS: Entertain the Milwaukee Bucks on Wednesday, the only home game in a six-game stretch.\nGRIZZLIES: Face the Orlando Magic at home on Wednesday.\n---\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "MomentumShift",
    "LateCollapse",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Collapse",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.285684",
  "pipeline_version": "v1"
}