{
  "game_id": "0021401093",
  "espn_id": "400579385",
  "date": "Mar 29, 2015",
  "matchup": "LAL @ BKN",
  "headline": "Nets keep up playoff push, beat Lakers for 3rd straight win",
  "cleaned_body": "NEW YORK -- Alan Anderson patrolled the locker room area in a Michigan State hat, screaming \"Spartan!\" so loudly that his teammates wondered how they could live with him for the next week.\nThe swingman's college team is thriving again in March, and suddenly so is his pro team.\nBrook Lopez had 30 points and 11 rebounds, and the Brooklyn Nets kept up their playoff push by beating the Los Angeles Lakers 107-99 on Sunday for their third straight victory.\n\nJoe Johnson added 18 points, eight rebounds and seven assists for the Nets, who entered play a half-game behind Boston for eighth place in the Eastern Conference. The Celtics hosted the Los Angeles Clippers later Sunday.\nJust like last season, the Nets are trying to overcome a disappointing first half of the season with a strong finish.\n\"It has been a trend, for whatever reason,\" point guard Deron Williams said. \"I wish it was different, but as long as we get in the playoffs we feel like we've got a shot.\"\nBrooklyn won for the fifth time in six games to give itself a chance at a third straight postseason berth after going 21-31 before the All-Star break.\nThe schedule is favorable for a late-season run, with the Nets two games into a stretch that sees them play seven of nine at home -- with another just across the river at the league-worst Knicks. However, they are still just 14-20 at Barclays Center, even with their improved play.\nReserve Jordan Hill had 22 points and 16 rebounds for the Lakers, who played without Jeremy Lin and Carlos Boozer because of upper respiratory infections, while Ed Davis was rested with Hill returning from a three-game absence.\n\"He was active,\" coach Byron Scott said of Hill. \"Did really well on the offensive end. Made some shots for us. Did a great job of rebounding the ball on both ends of the floor. Really gave us a chance towards the end to win the game.\"\nLopez extended his best stretch of the season by making 13 of 22 shots. He averaged 28.8 points in the Nets' four games this week, overwhelming a Lakers team that was both too short-handed and too short.\n\"Regardless of whatever the other team's situation is, we've just got to prepare night in and night out,\" he said. \"It's all on us. We can put ourselves in the playoffs if we just stick with it.\"\nComing off their 106-98 victory over Cleveland on Friday, the Nets started quickly, with Lopez and Williams combining to outscore the Lakers in the first quarter in helping Brooklyn to a 30-19 lead. The Nets made 73 percent of their 2-point shots in the first half, though were only 3 of 17 on 3s in taking a 61-50 lead.\n\"We just wasn't in the right place at the right time in the first half,\" Hill said. \"There wasn't a lot of help. We were letting drives get to the middle. It was tough.\"\nLos Angeles, which never led, cut it to 96-93 with under 4 minutes to play before a dunk by Lopez and 3-pointer by Johnson pushed the lead back to eight.\nRookie Markel Brown scored a season-high 17 points for the Nets, while Williams overcame an illness that sidelined him from practice Saturday to finish with 13 points and nine assists.\n---\nTIP-INS\nLakers: Los Angeles lost for just the third time in 16 meetings. ... Scott said if Boozer is able to return Monday, he would likely sit a different member of the big-man rotation.\nNets: Brooklyn swept the series for the first time since the 2005-06 season. ... The Nets celebrated Chinese culture, with the starting lineups announced in Mandarin and a Chinese dance performance at halftime.\nBEAT L.A.!\nThe Nets beat the Lakers for the first time since moving to Brooklyn three years ago. They had dropped seven in a row at home in the series since a March 2006 victory in East Rutherford, New Jersey. The Nets have won three straight meetings overall for the first time since April 2002 through January 2003.\nUP NEXT\nLakers: Visit Philadelphia on Monday.\nNets: Host Indiana on Tuesday.",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.079045",
  "pipeline_version": "v1"
}