{
  "game_id": "0021700582",
  "espn_id": "400975328",
  "date": "Jan 06, 2018",
  "matchup": "ORL vs. CLE",
  "headline": "LeBron James assist short of triple-double in Cavs' win",
  "cleaned_body": "ORLANDO, Fla. --  LeBron James did a little bit of everything in Cleveland's victory over Orlando\n\nJames had 33 points, 10 rebounds, nine assists and six steals, but it was his steady presence on the floor in the final six minutes that made the difference in Cleveland's 131-127 victory Saturday night.\n\nCleveland let a 20-point fourth-quarter advantage dwindle down to three before and the Magic's shooting touch ran out, much of it because James helped the Cavs make enough plays to secure the win.\n\n\"I play both sides of the floor,\" James said. \"I don't just score or rebound or pass the ball. Anytime you get a steal it allows us to get the ball in the open court and not play against a set defense.\"\n\nKevin Love hit six 3-pointers and finished with 27 points for the Cavaliers, and Isaiah Thomas had 19 points and four assists in his second appearance and first start of the season following a hip injury.\n\nDwayne Wade added 16 points and nine rebounds, including retrieving a Thomas' airball and laying it in to give the Cavs a five-point cushion with 17.8 seconds left.\n\nCleveland seized control in the third period, hitting seven of 11 3-pointers in the period and outscoring Orlando 40-23.\n\n\"We played the right way that quarter,\" Cleveland coach Tyronn Lue said. \"Defensively, we got stops and offensively we shared the ball, played with pace and guys got open looks. Then in the fourth quarter, we got bogged down.\"\n\nAaron Gordon led the Magic's fourth-quarter rally, scoring 11 of his 30 points when the Magic turned a blowout into a tight finish. Elfrid Payton had 20 points and five assists, and Evan Fournier contributed 18 points for the Magic, who lost their fourth straight. Mario Hezonja added 16 points and 10 rebounds in his seventh starting appearance this season.\n\nBut Gordon couldn't match James in any category but scoring and the Magic forward's teammates didn't pick up the slack, especially on the boards. Orlando gave up 13 second-chance points while getting outscored 40-23 in the third period, allowing Cleveland to take a 20-point lead in the final period.\n\n\"That's part of what has to change for us to become a winning team,\" Magic coach Frank Vogel said. \"We've got to box out on every shot. We talk about it every day on a ridiculous level. It's an elementary school fundamental that we continue to break down on and it hurts us.\"\n\nTIP INS\n\nCavaliers: Kyle Korver tied Paul Pierce for fourth-place on the career 3-pointers list with 2,143.  Cleveland has won nine straight times in Orlando. ... James played in his 1,100 game in his 15-year career. ... Cleveland is 22-0 when tied or leading starting the fourth quarter.\n\nMagic: Jonathon Simmons back injury forced the Magic to change their starting lineup for the 16th time this season. ... Magic rookie Wes Iwandu had a career-high 12 points. ... Payton got into a shouting match with Thomas in the first half and both players were given a technical. SG Evan Fournier had his string of consecutive free throws end at 21 since returning from an ankle injury six games ago.\n\nHE'S BACK\n\nThomas made his first start this season for the Cavaliers, after recover from a hip injury and scored 19 points on seven of 13 shooting.\n\nThomas had 17 points in 19 minutes off the bench in his debut Tuesday night against Portland.\n\n\"My body felt a lot better,\" Thomas said. \"I had more of a rhythm early, but that rust was still there. I was missing layups and free throws and things like that. After we got going and my body got caught up, I felt better.\"\n\nThomas took a nasty spill on a drive to the basket, but bounced right up and showed no ill effects.\n\n\"I don't like seeing him hit the floor, but obviously seeing him get up and taking that type of physicality is very key for his progression,\" James said.\n\nUP NEXT\n\nCavaliers: Continue five-game trip at Minnesota on Monday night.\n\nMagic: At Dallas on Tuesday night to start a three-game trip.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.006516",
  "pipeline_version": "v1"
}