{
  "game_id": "0022101169",
  "espn_id": "401360988",
  "date": "Apr 03, 2022",
  "matchup": "IND vs. DET",
  "headline": "Bey, Jackson lead Pistons past Pacers 121-117",
  "cleaned_body": "INDIANAPOLIS -- - Saddiq Bey scored 31 points and Frank Jackson had 19 to lead the sharpshooting Detroit Pistons past the Indiana Pacers 121-117 on Sunday.\nBey hit 11 of 18 shots, including shooting 7 of 9 on 3-pointers, in 23 minutes. The Pistons, who have won three games in a row, sank 21 of 41 3-pointers and set a team record for 3s in a half with 13 in the opening two quarters.\n\"My team did a great job of playing together,\" Bey said. \"I just tried to take what the defense was giving me. We were playing together, sharing the ball and the coaching staff did a good job putting us in the right position.\"\nPistons coach Dwane Casey thought Bey could go for 50 points, but the Pistons needed to play some young players.\n\"When he gets going, he gets it going,\" Casey said. \"When he started in the first quarter, the basket looked like the ocean. He has that knack. He's more than just a shooter. He's putting it on the floor, he's posting up, he's really expanding his game. He has to take a lot of things he's doing well now and keep improving over the summer.\"\nOshae Brissett scored 20 points and had nine rebounds to lead the Pacers, who have lost seven straight.\nTyrese Haliburton flirted with a triple-double with 19 points, a career high-tying 17 assists and a season-high nine rebounds. He became the first player in Pacers history to record at least 17 assists without a turnover and first to do it in the NBA since LeBron James on March 21, 2018.\n\"I pride myself on taking care of the ball and getting guys involved,\" Haliburton said. \"I think that's my best asset as a point guard.\"\nBuddy Hield and Isiah Jackson also scored 19 each for the Pacers. Hield had a season-high nine rebounds and Jackson had seven as the Pacers held a 58-38 rebounding edge.\nDetroit, which shot 43.4% overall from the field, erased a 66-62 halftime by outscoring the Pacers by 11 in the third quarter to take a 98-91 lead.\nBey scored 15 of Detroit's first 17 points, finishing with 20 points in the first quarter as the Pistons led 38-34 lead after the first quarter.\nThe Pistons hit their first eight 3-point shots and 10 off their first 11 3-pointers.\n\"We just didn't play well at all,\" Pacers coach Rick Carlisle said. \"Our level of consistent hard play just wasn't there from start to finish. They played hard from start to finish.\"\nHaliburton said poor starts have plagued the Pacers.\n\"We need to have more of a sense of urgency starting games,\" he said. \"This is our fourth or fifth game in a row where we start bad and then get it going. We have to open games like that.\"\nTIP-INS\nPistons: Cade Cunningham missed the game with right hip soreness. ... Carsen Edwards, who averaged 26.7 points with the Salt Lake City Stars of the NBA G League, signed a two-year deal Sunday. The former Purdue standout scored 13 points on 5-of-15 shooting off the bench and had nine assists. \"He had no clue what we were doing, he just walked in off the streets,\" Casey said. \"He came in played hard, played the right way. He's a little sparkplug.\". ... Braxton Key signed a two-way deal with the Pistons and scored 12 points. ... Detroit released Chris Smith, who recently had ACL surgery.\nPacers: Chris Duarte remained sidelined with a sore left big toe. The rookie hasn't played since March 15 and Carlisle said it's likely Duarte will miss the last three games. ... Reggie Miller was a surprise guest to help celebrate media relations director David Benner's retirement after 28 years.\nUP NEXT\nPistons: Hosts Dallas on Wednesday night.\nPacers: Hosts Philadelphia on Tuesday night.\n-",
  "tags_rule": [
    "TripleDouble",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.065254",
  "pipeline_version": "v1"
}