{
  "game_id": "0021400961",
  "espn_id": "400579253",
  "date": "Mar 11, 2015",
  "matchup": "POR vs. HOU",
  "headline": "LaMarcus Aldridge, Blazers hold off Rockets' Corey Brewer-led rally",
  "cleaned_body": "PORTLAND, Ore. -- Portland won the game and the series, and that could have implications down the line.\nThe Trail Blazers held off a late charge by the Rockets on Wednesday night for a 105-100 victory, pulling into a tie with Houston for third in the Western Conference. LaMarcus Aldridge led the way with 26 points and 14 rebounds.\nBut the win was more than that: Portland won the regular-season series 2-1 and claimed the head-to-head tiebreaker for the first time since the 2010-11 season.\n\"It was big game for us, and we all knew it. I thought everyone was locked in, focused and ready to go,\" Aldridge said. \"Our guys played great.\"\nThe Trail Blazers limited James Harden to 18 points. He was averaging just over 27 points to rank second in the league, and he'd scored more than 40 in two previous games against Portland this season.\nHarden had just four points in the second half.\n\"Just an off night,\" Harden said.\nCorey Brewer scored 23 points for Houston, including 17 in the fourth quarter.\nRobin Lopez finished with 16 points and 10 rebounds for the Blazers, who are tied atop the Western Conference with 27 wins at home this season. Nicolas Batum added 18 points and nine rebounds.\nPortland led by as many as 11 points in the fourth quarter but the Rockets clawed back, pulling within 99-95 on Brewer's layup with 2:13 to go.\nAfter Portland free throws, Brewer added a jumper before his steal and fast-break dunk made 101-100 with 15.3 seconds left. Arron Afflalo made two free throws and Brewer missed a 3-pointer with seven seconds to go to end the threat.\n\"It felt good when it left my hand, I was just short,\" Brewer said. \"I lost a lot of energy trying to come back like that.\"\nThe Blazers were coming off a 121-113 loss at Minnesota on Saturday, which snapped a five-game winning streak. It was Portland's first game without guard Wesley Matthews, who ruptured his Achilles tendon in the prior game.\nMatthews underwent surgery to repair the tendon earlier Wednesday at the Southern California Orthopedic Institute. He will be out for the rest of the season.\nAfflalo, acquired in a trade at the deadline with Denver, started for the second game in Matthews' place. He was tasked, along with Batum, with guarding Harden.\n\"I think every team talks about the same things when they get ready to play James Harden,\" Blazers coach Terry Stotts said. \"They say make him take tough shots, don't foul him, don't put him on the line, all the same things. Some nights you're able to do it better than others.\"\nThe Rockets had won seven of nine, and were coming off a 114-100 victory at Denver.\nBrewer hit a long jumper as the clock expired to take a 29-26 lead into the second quarter. The Rockets led by as many as seven points but Damian Lillard's 3-pointer closed the gap to 38-36.\nThat gave him 150 3-pointers, making Lillard the only NBA player to make 150 or more in each of his first three seasons.\nThe Blazers got into trouble early in the third quarter when Aldridge picked up three quick fouls in about a minute's span and had to head to the bench with four total fouls. The Rockets took advantage, opening the half with an 8-0 run to take a 61-54 lead.\nBatum hit a 3-pointer that tied it at 65, and the teams wrestled for the lead until an 8-0 run put Portland up 82-74 early in the fourth.\n---\nTIP-INS\nRockets: In the two previous meetings against the Blazers, Harden scored 44 and 45 points. Asked how to defend him, Stotts said: \"Look, he's had 44 and 45 against us, so if we hold him to 40 we're improving.\"\nTrail Blazers: A couple was married at the Moda Center before the game. ... Matthews posted a photo of himself in his cast which was shown on the video scoreboard during the game. Portland wore \"With Wes\" T-shirts during pregame warmups.\nREBOUNDS\nThe Blazers outrebounded the Rockets 60-40. Portland has more rebounds than opponents in 10 of 14 games since Lopez returned from a broken right hand.\n\"We pride ourselves on trying to get extra possessions and trying to be a good rebounding team,\" Aldridge said. \"I thought RoLo was great going for offensive boards early and I thought that gave us energy.\"\nUP NEXT\nRockets: Visit Utah on Thursday.\nTrail Blazers: Host Detroit on Friday.",
  "tags_rule": [
    "ReturnFromInjury",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "ReturnBoost",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.976439",
  "pipeline_version": "v1"
}