{
  "game_id": "0021700968",
  "espn_id": "400975714",
  "date": "Mar 07, 2018",
  "matchup": "MIL vs. HOU",
  "headline": "Rockets extend winning streak to 17, beat Bucks 110-99",
  "cleaned_body": "MILWAUKEE --  The Houston Rockets had trouble at times holding on to the ball and keeping up with the young Milwaukee Bucks.\n\nBut as long as the Rockets keep hitting their 3-pointers, they're pretty hard to beat.\n\nJames Harden scored 26 points, Eric Gordon had 18 points and two momentum-swinging 3s in the third quarter, and Houston beat Milwaukee 110-99 on Wednesday night for its 17th straight win.\n\nThe Rockets passed the Boston Celtics for the longest winning streak in the NBA this season. Houston hasn't lost since Jan. 26 at New Orleans.\n\n\"We find ways to win,\" Harden said. \"It's not going to be the same way every game.\"\n\nThe latest victory came on the second of a tough back-to-back stretch of road games that started with a 10-point victory at Oklahoma City. No wonder the Rockets looked sluggish at times against the Bucks.\n\nAnd yet the Rockets still led by 10 for most of the fourth quarter until a late surge by the Bucks sliced the lead to 104-99 with 1:06 left on rookie Sterling Brown's layup.\n\nChris Paul answered with a short floater in the lane with 45 seconds left after driving on Jason Terry to silence Bucks fans who were pleading \"Defense! Defense!\"\n\nHouston obliged after forcing the Bucks to waste 15 seconds on the ensuing inbounds pass and settle for an off-balance 3 that missed. The Rockets led comfortably from there.\n\n\"There were a few 50-50 balls or offensive rebounds that we needed to secure that if we do, it gives us an opportunity to run,\" Bucks coach Joe Prunty said. \"If we run, then maybe we can put them on their heels ... but the ball needs to move.\"\n\nGiannis Antetokounmpo scored 30 points. Khris Middleton finished with 18 points for Milwaukee, while Brown had a career-high 15.\n\nPaul had 16 points and 11 assists for the Rockets, who answered every Bucks charge.\n\nMilwaukee used an 11-0 run to get to within 73-69 with 3:25 left on Brown's corner 3. The Bucks did most of their damage during the spurt around the bucket, with Antetokounmpo leading the way in the post.\n\nThe NBA's most prolific 3-point shooting team countered with another display of clutch perimeter shooting.\n\nThe Rockets would beat the Bucks down the floor to set up open shots on the wing. Gordon knocked down two 3s, and P.J. Tucker added another 3 to help Houston close the third with a 14-7 run for an 87-76 lead.\n\n\"With a win streak like this you are doing a lot of things the right way,\" Gordon said. \"We still play for each other. We knew this was going to be a tough road trip.\"\n\nHouston got off to a sloppy start at the Bradley Center with a seven-turnover first quarter, a night after tying its season high with 22 turnovers in the 10-point win at Oklahoma City.\n\nThe end of the first half offered a glimpse of what was still to come. Harden hit a deep 3 just before the halftime buzzer from well beyond the arc with a defender in his face for a 58-46 lead.\n\n\"We've just got to stick with the game plan, close out, run them off the (3-point) line,\" Brown said.\n\nTIP INS\n\nRockets: Swingman Joe Johnson missed a second straight game due to illness, while coach Mike D'Antoni rested Nene a day after the center played 17 minutes.\n\nBucks: C Tyler Zeller (back) missed a second straight game. ... It does not appear as if Matthew Dellavedova (right ankle) will return soon. The team initially estimated that the guard might miss a month when he got hurt on Feb. 4 at Brooklyn. The Bucks are also still without G Malcolm Brogdon (left quad).\n\nGIANNIS IN THE MIDDLE\n\nThe Bucks went stretches with the 6-foot-11 Antetokounmpo playing center to try to put a quicker lineup on the floor to counter the Rockets. Houston still ended up hitting 47 percent from the floor and 35 percent (14 of 40) from 3-point range, and held a 22-14 edge in fast-break points.\n\nQUOTABLE\n\n\"It's a little carelessness. We played two teams that create a lot of turnovers. A little bit of them and a little bit of us.\" -- D'Antoni on his team's seven first-quarter turnovers.\n\nUP NEXT\n\nRockets: Makes third stop on four-game trip with a visit to the Toronto Raptors on Friday.\n\nBucks: Try to improve to 3-0 this season over New York when the Knicks visit Friday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "ThreePointExplosion",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.072849",
  "pipeline_version": "v1"
}