{
  "game_id": "0021400436",
  "espn_id": "400578728",
  "date": "Dec 26, 2014",
  "matchup": "MEM vs. HOU",
  "headline": "Josh Smith debuts with 21 points as Rockets top Grizzlies in OT",
  "cleaned_body": "MEMPHIS, Tenn. -- Josh Smith immediately paid dividends for the Houston Rockets, while the Memphis Grizzlies remained spiraling on their longest losing streak of the season.\nSmith, who signed earlier in the day, scored 21 points and grabbed eight rebounds Friday night as the Rockets beat Memphis 117-111 in overtime.\n\"We knew what he brought to the table,\" said James Harden, who led the Rockets with 32 points and 10 assists. \"All he has to do is go out there and play his game.\"\n\nThe Rockets held a 111-109 lead with 1:18 left in overtime when Harden missed a 17-footer. Smith grabbed the offensive rebound, leading to a miss by Trevor Ariza, only to have Smith corral another offensive rebound.\nSmith was fouled and converted both free throws, padding the Rockets' lead.\n\"When you're a professional, and you've played a lot of years, it's not that hard,\" Smith said of joining a new team, \"especially since you know a lot of the guys in the locker room. They helped me out when I was kind of lost our there.\"\nAriza finished with 15 points, while Corey Brewer added 13. Patrick Beverley had 12 points for the Rockets, who took over the top spot in the Western Conference's Southwest Division from Memphis.\nDwight Howard had only six points, but connected on all four of his free throws in overtime. He grabbed 11 rebounds.\nMarc Gasol led Memphis with 29 points, while Beno Udrih contributed 17. Quincy Pondexter scored 14, and Vince Carter had 10, including a pair of 3-pointers in the fourth quarter to fuel a Memphis rally.\nThe teams were tied at 104 at the end of regulation after Gasol's jumper at the end of the fourth bounced away.\nIn overtime, Howard opened the scoring by converting a pair of free throws, banking in the second. Ariza followed with a 3-pointer.\nThe Grizzlies got within two points on several occasions in overtime, but couldn't overtake the Rockets as Memphis dropped its fourth straight.\nThe Rockets scored the first five points of the fourth quarter to take the lead, as Memphis missed eight shots to open the period. The Rockets still led 100-91 when Harden converted a pair of free throws with just under 4 minutes left in regulation.\nMemphis countered with 10 unanswered points to retake the lead. Carter connected on consecutive 3-pointers before Harden's drive with 15.5 seconds remaining tied the game at 104. Carter lost the ball on a drive with 0.6 seconds left, but it was ruled out on Howard after an extended review by officials.\nGasol got off a jumper as regulation ended, but it bounced off sending the game to overtime.\n\"We did not do a good job of executing,\" Gasol said, \"and they got more shots than us at the end. We did not do a good job of executing our plays and that happens.\"\nTIP-INS\nRockets: Houston waived rookie Tarik Black to make room for Smith. Black played at the University of Memphis before finishing his last year of eligibility at Kansas. ... The Rockets entered the game having lost seven of their last eight at FedExForum.\nGrizzlies: Tony Allen returned after missing four games with a right corneal abrasion. ... Forward Zach Randolph missed his third straight game with a sore right knee. The Grizzlies are now 1-5 since last season with Randolph out.\nMR. SMITH GOES TO HOUSTON\nRockets coach Kevin McHale said before the game that the adjustment time necessary for Smith is unclear. \"I think everything is an individual basis,\" he said. \"Some guys come in and they're flawless because they may have done the same thing at other places.\" McHale seemed to have a clearer picture afterward of the recently waived Pistons forward. \"He can score in the post, he can pass. He gives us versatility. He can guard big guys or small guys.\"\nOVERTIME\nBoth teams were 3-0 in overtime games before Friday night. Memphis had won in overtime, double overtime and triple overtime.\nUP NEXT\nRockets: Visit San Antonio on Sunday\nGrizzlies: Visit Miami on Saturday",
  "tags_rule": [
    "MomentumShift",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.845136",
  "pipeline_version": "v1"
}