{
  "game_id": "0021700104",
  "espn_id": "400974855",
  "date": "Oct 31, 2017",
  "matchup": "LAL vs. DET",
  "headline": "Ball, Lakers romp to 113-93 win over Pistons",
  "cleaned_body": "LOS ANGELES --  The Los Angeles Lakers were locked in to deliver their best effort of the season. The Detroit Pistons were anything but ready, and the gap between the two mindsets was obvious.\n\nJulius Randle scored 17 points, Lonzo Ball added 13 and the Lakers smashed the Pistons 113-93 on Tuesday night.\n\nPistons head coach Stan Van Gundy was unsure about how his team might handle the adulation associated with a surprising 5-2 start, and those concerns proved to be well-founded in a loss he described as a \"humbling experience.\n\n\"There's nothing we did well and they dominated us,\" Van Gundy said. \"We had no fight in us. It was a bad, bad night.\"\n\nThe Lakers used a 16-5 run in the first quarter to take a lead they would never relinquish, eventually jumping out in front by as many as 23.\n\nAnother superb defensive effort keyed the win, as the Lakers allowed three free-throws, the fewest in a game in franchise history.\n\n\"This is the way we want to play,\" said Lakers forward Brandon Ingram, who had 13 points. \"This is kind of the identity we want to bring every single game.\"\n\nLarry Nance Jr. had 14 points and 12 rebounds for his third double-double for the Lakers, who had lost the previous three games against the Pistons. Kentavious Caldwell-Pope had 13 points in his first chance to play against the Pistons, who drafted him No. 8 overall in 2013.\n\nTobias Harris and Reggie Jackson each had 18 points for the Pistons, who were unable to sweep their three-game California road trip. Andre Drummond had 10 points and 12 rebounds.\n\nBall had a modest statistical performance, finishing with six rebounds and three assists, but Lakers head coach Luke Walton credited him with setting the tone. Ball was aggressive in attacking the paint to create an easy shot for himself or a teammate, and that unselfishness became infectious.\n\nSeven Lakers finished with double figures, and six had at least three assists.\n\n\"Take away the Phoenix game, this is the best game he's played I thought,\" Walton said. \"The way that his pace was, the way he pushed the ball all the time. He was in the other team's paint. He just set the tone and I thought the whole team fed off the way he was playing.\"\n\nTIP INS\n\nPistons: After allowing 24 fast-break points in their first seven games, the Pistons allowed the Lakers to get free for 17 points. . Ish Smith had 12 of the Pistons' 30 points off the bench. .\n\nLakers: Rookie Kyle Kuzma finished with 16 points, scoring 10 points of the Lakers' 33 points in the second quarter. . Los Angeles improved to 14-4 against the Pistons at Staples Center.\n\nRANDLE'S ROLE\n\nRandle is thriving as an impact substitution this season. He showed it again by pacing the team in scoring despite playing just 17:25, the lightest workload for any Laker that finished with at least 10 points.\n\n\"He has just been playing with great energy,\" Walton said. \"He can change games and he did tonight with the way he came in.\"\n\nVan Gundy credited the second-unit pairing of Randle and Kuzma for effectively putting the game out of reach in the second quarter.\n\nHALLOWEEN HIJINKS\n\nLakers forward Corey Brewer arrived at Staples Center in costume as Spider-Man, while Caldwell-Pope dressed up as Steve Urkel from the 1990's TV sitcom \"Family Matters.\"\n\nCaldwell-Pope said the Lakers were so successful because they were having fun, and he certainly did against his former team.\n\n\"We threw the first punch,\" Caldwell-Pope said. \"We kept our feet on the gas. We pushed the ball and got easy layups.\"\n\nUP NEXT\n\nPistons: Host the Milwaukee Bucks on Friday to open a five-game homestand.\n\nLakers: Visit the Portland Trailblazers on Thursday.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.040318",
  "pipeline_version": "v1"
}