{
  "game_id": "0022100393",
  "espn_id": "401360217",
  "date": "Dec 11, 2021",
  "matchup": "SAC @ CLE",
  "headline": "Cavaliers score 81 points in first half, beat Kings 117-103",
  "cleaned_body": "CLEVELAND -- — Rookie Evan Mobley had 15 points and a season-high 15 rebounds and the Cleveland Cavaliers matched their team record with 81 first-half points in a 117-103 victory over the Sacramento Kings on Saturday night.\n\nIsaac Okoro scored 20 points, Jarrett Allen had 19 points and 11 rebounds, and Darius Garland had 16 points and a career-best 13 assists for the Cavaliers. They held a 29-point lead at intermission and won their third in a row.\n\n“Everyone is happy for everyone else anytime one of our teammates does something good,” said Mobley, the third overall pick. “That just speaks to our chemistry. We’ve learned from the things we’ve gone through already and we’ll keep doing that.”\n\nCleveland scored 45 points in the second quarter — one shy of its franchise mark — to take an 81-52 lead. Cedi Osman scored 13 points in the period, eight in a 50-second burst, and had 18 in the half. Okoro had 15 points, and Garland and Mobley scored 12 apiece.\n\n“I was just trying to make the right reads and get my teammates good shots,” Garland said. “The sky is the limit because we have so much talent and we’re so young, but we also have some veterans to help lead the way.”\n\nThe Cavaliers, who have not trailed in 11 consecutive quarters, shot 61.2% from the field in equaling their first-half record set against Portland on Nov. 23, 2016. Their most in any half is 83 in the second at Indiana on Jan. 15, 1993.\n\n“It was an ugly first half and our transition defense was atrocious,” Kings interim coach Alvin Gentry said. “But, hey, we’re not quitters. We’re going to keep battling our butts off to get through this. I can promise you that.”\n\nSacramento pulled to 103-96 in the fourth on a pair of 3-pointers by Buddy Hield and a three-point play by Damian Jones, capping an 18-2 run to start the quarter. Cleveland subsequently regained control as Ricky Rubio hit two deep 3-pointers.\n\nHield had 21 points and Davion Mitchell had 14 points and five assists off the bench. De’Aaron Fox added 13 points and Harrison Barnes had 12 points as the Kings lost their second straight on the road.\n\n“Losing is hard, but it’s going to get better for us,” Mitchell said. “We’ve got to do the little things like get loose balls and win 50-50 balls. That hurt us a lot tonight.”\n\nSacramento fell to 5-5 under Gentry, who replaced Luke Walton on Nov. 21. It was Gentry’s 600th career defeat in 1,115 NBA games.\n\nBoth teams were completing a back-to-back set. Cleveland won 123-106 at Minnesota on Friday, while the Kings lost 124-123 in Charlotte when Fox missed two free throws with 2.4 seconds left.\n\nSEXTON UPDATE\n\nCavaliers G Collin Sexton, who underwent season-ending left knee surgery on Nov. 17, is rehabilitating in Atlanta. Sexton was averaging a team-high 16.0 points when he tore his meniscus at New York on Nov. 7. “The most difficult thing when you’re injured is staying connected to the team, but Collin is following every game closely,” coach J.B. Bickerstaff said. “When he’s comfortable enough to travel, we’ll get him back up here.”\n\nTIP-INS\n\nKings: C Tristan Thompson spent his first nine seasons with Cleveland, starting on its 2016 NBA championship team, and ranks third in franchise history with 5,393 rebounds. “Tristan has been great for us, a good strong voice in the locker room,” interim coach Alvin Gentry said. “The guys respect him and he’s a good energizer off the bench.” … F Richaun Holmes (right eye injury) missed his second consecutive game.\n\nCavaliers: G Dylan Windler, who is no longer in the rotation, is averaging 12.0 points and 7.5 rebounds in two G League games for the Cleveland Charge. Windler was the No. 26 overall pick in the 2019 draft, but has been plagued by injuries since. … Cleveland is tied for the second-best road record in the East at 9-5.\n\nUP NEXT\n\nKings: At Toronto on Monday night.\n\nCavaliers: Host Miami on Monday night.\n\n------",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.987414",
  "pipeline_version": "v1"
}