{
  "game_id": "0021700520",
  "espn_id": "400975266",
  "date": "Dec 28, 2017",
  "matchup": "POR vs. PHI",
  "headline": "Napier's season-high 23 rally Blazers past 76ers, 114-110",
  "cleaned_body": "PORTLAND, Ore. --  Shabazz Napier was struggling so much against the Philadelphia 76ers that Trail Blazers coach Terry Stotts sat him early in the third quarter.\n\nGood thing for Portland that Napier returned in time for the fourth.\n\nNapier, who started for injured guard Damian Lillard, scored 15 of his season-high 23 points in the fourth quarter and the Trail Blazers rallied for 114-110 victory Thursday night.\n\n\"The good thing about basketball is they say you've got the next game, but you always have two halves,\" Napier said. \"I felt like I was kind of lethargic out there in the first half and I felt like basically it can't get any worse, so I just went out there and tried to be positive.\"\n\nCJ McCollum led all scorers with 34 for the Blazers, who snapped a six-game losing streak at home. Portland had a season-high 42 points in the fourth quarter.\n\nThe Sixers, who led by as many as 18 points in the third quarter, have lost 10 of their last 12 games.\n\nJoel Embiid finished with 29 points and nine rebounds, while Dario Saric had 25 points and nine rebounds. The 76ers were hurt when Robert Covington went out in the third quarter with an injured finger on his left hand.\n\n\"It's a disappointing loss. We had an opportunity without Damian being here. I give them credit. They did not roll over,\" 76ers coach Brett Brown said. \"We gave up 18 points when Covington went out. We really missed him, but we give them credit.\"\n\nJJ Redick and Embiid made consecutive 3-pointers to narrow the gap to 103-99 with 2:06 left. Jusuf Nurkic had a pair of free throws before McCollum's pull-up jumper and it appeared the game was out of reach, but Embiid made another 3 that got the Sixers within 109-105 with 16 seconds left.\n\nMcCollum made free throws with 3.4 seconds to go before Embiid added another 3-pointer to make it 111-108, but the Sixers weren't able to catch up.\n\nNurkic finished with 21 points and 12 rebounds, and Portland won its fourth straight against the Sixers at the Moda Center. Napier scored 22 points after halftime.\n\nLillard missed his third game with a strained right hamstring. Portland's top scorer, averaging 25.2 points per game, was injured in a 102-85 loss to San Antonio on Dec.  20.\n\nLillard warmed up a couple of hours before the game and didn't appear hampered by the injury.\n\nOn the other side, Embiid was questionable for the game with back tightness, but played. The 76ers were coming off a 105-98 victory over the Knicks at Madison Square Garden on Christmas that snapped a five-game losing streak.\n\nNurkic made a layup with nine seconds left to give Portland a 52-51 lead at halftime. But he was furious in the third quarter when officials did not stop the game when he had a bloody nose. He collected his fourth foul before heading for the locker room.\n\nNurkic knocked heads with Redick, who appeared to have a cut lip.\n\nNurkic said he was angry.\n\n\"The more I get mad I play better,\" he said. \"I'm not saying every game `Hit me in the nose' but I just need to play with the same energy every game like this.\"\n\nThe Sixers stretched the lead to 75-59 with five minutes left in the quarter, outscoring Portland 24-7. But Ed Davis capped a 10-1 Portland run with a dunk to pull the Blazers to 79-70.\n\nNapier had a personal 7-0 run to close the gap to 88-81. Jerryd Bayless made a 3-pointer on the other end -- but it was later ruled no good because of a shot clock violation.\n\nNapier made two of three free throws and Nurkic added two more, before Napier's layup got the Blazers within 88-87.\n\nTIP INS\n\n76ers: The Sixers beat the Blazers 101-81 in Philadelphia on Nov. 22. Embiid had 28 points and 12 rebounds in that one. ... Embiid had six 3-pointers.\n\nTrail Blazers: Portland is just 7-10 at home this season, but 10-6 on the road. Asked before the game if he'd ever been on a team with that kind of record disparity at home, coach Terry Stotts said simply \"No.\"\n\nQUOTABLE: \"We just need to be accountable. We need to hold each other accountable for everything. I think that's what it comes down to. Making sure we stay on top of each other and make sure we're getting better. Just talking to each other.\" -- Sixers guard Ben Simmons.\n\nUP NEXT\n\n76ers: Visit Denver on Saturday.\n\nTrail Blazers: Visit Atlanta on Saturday to kick off a three-game road trip.\n\n---\n\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.780402",
  "pipeline_version": "v1"
}