{
  "game_id": "0021400389",
  "espn_id": "400578681",
  "date": "Dec 19, 2014",
  "matchup": "CHI @ MEM",
  "headline": "Jimmy Butler's 31 points, Nikola Mirotic's 6 3s lead Bulls over Grizzlies",
  "cleaned_body": "MEMPHIS, Tenn. -- Chicago rookie Nikola Mirotic left the locker room before the media could hear about his perfect shooting night from outside the arc.\nThe rest of the Bulls were willing to speak up in praising the reserve forward.\nMirotic scored a career-best 27 points, converting all six of his 3-pointers on Friday night. That, coupled with 31 points from Jimmy Butler, helped the Bulls beat the Grizzlies 103-97 on Friday night, snapping Memphis' six-game winning streak.\n\n\"Niko was huge with the energy right off the bench,\" Butler said.\n\"Some night's it's going to go more your way; some nights it's not,\" said Bulls forward Pau Gasol, who was limited to six points on 2-of-7 shooting. \"I think tonight he definitely didn't play with any fear.\"\nMirotic thwarted several Memphis rallies, particularly in the first half. In the second quarter he connected on four 3-pointers as Chicgo carried a 51-43 into the break. His six 3-pointers on the night also were a season-best.\nBut Chicago coach Tom Thibodeau said there is more to Mirotic's game than scoring.\n\"He's not afraid,\" Thibodeau said. \"He makes tough plays. He hustles all the time. .He's never satisfied, and I love that about him.\"\nAaron Brooks scored 17 points and Joakim Noah finished with 10 points and 13 rebounds as the Bulls outrebounded Memphis 51-45.\nMike Conley led Memphis with 21 points, while Beno Udrih added 15 points before leaving with a hand injury in the fourth quarter. Marc Gasol had 13 points, but was 5-of-15 from the field -- part of Memphis shooting 39 percent for the game. Vince Carter scored 10 points for Memphis.\nThe game featured not only the Gasol brothers, but two of the top teams in their respective conferences. The Bulls entered the game as fourth-best in the East, while Memphis was second in the West and coming off a week that included wins in double-overtime over Charlotte, at Philadelphia in overtime and a triple-overtime victory at San Antonio on Wednesday night. Within the overtime wins was a victory over the Golden State Warriors, who own the best record in the NBA.\nThe wear and tear of a long stretch showed at times for Memphis.\n\"Tonight was a game where we didn't have enough effort due in large part to very tired legs,\" Memphis coach Dave Joerger said. \"The minutes have added up on us.\"\nMemphis was able to get close in the final 36 seconds. Conley's 3-pointer with 13.8 seconds left pulled Memphis within 99-97.\nBut the Bulls converted nine of 10 free throws in the final 35.5 seconds.\nIf the battle between the teams wasn't enough, there was some extra incentive for Pau Gasol, Noah said. Gasol not only was playing against his brother, but also the franchise where he spent the first six-plus years of his career.\n\"I think for us it was definitely a big win,\" Noah said. \"(The Grizzlies) are definitely playing well. Pau told us (Thursday) that this game meant a lot for him. I like that sentimental (stuff).\"\n------\nTIP-INS:\nBulls: Mirotic's previous season high was 24 against Portland on Nov. 21. ... The Bulls are now 13-2 when holding opponents under 100. ... Bulls guard Derrick Rose missed his second straight game with an illness, and Taj Gibson also sat out with a right ankle injury.\nGrizzlies: Memphis entered the game undefeated against the Eastern Conference in the 2014 calendar year. The Grizzlies had not lost a home game to an Eastern Conference team since Dec. 30, 2013 -- to Chicago. ... Memphis had won 11 straight home games when playing an opponent playing the second night of a back-to-back.\nNO HOMECOMING: Rose, who played a year at the University of Memphis before moving to the NBA, has played only twice in Memphis since joining the Bulls -- his rookie season in 2008 and in 2011.\nMEMPHIS INJURY REPORT: Memphis guard Tony Allen missed his second game with a right corneal abrasion. Udrih left the game in the fourth quarter with a jammed right index finger and did not return.\nUP NEXT:\nBulls: Host Toronto on Monday.\nGrizzlies: Travel to Cleveland on Sunday.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.565163",
  "pipeline_version": "v1"
}