{
  "game_id": "0021300009",
  "espn_id": "400488882",
  "date": "Oct 30, 2013",
  "matchup": "CHA @ HOU",
  "headline": "Dwight Howard grabs 26 rebounds in debut as Rockets win",
  "cleaned_body": "HOUSTON -- This is how Dwight Howard plays when he's healthy.\nHoward had 17 points and a career-high-tying 26 rebounds in his Houston debut, James Harden added 21 points and the Rockets cruised to a 96-83 win over the Charlotte Bobcats on Wednesday night.\nHoward spurned the Lakers to sign an $88 million deal with Houston, joining Harden and a team that made the playoffs last season for the first time since 2009.\nHe said he rushed back too quickly from offseason back surgery last year and never felt quite right in his one disappointing season with Los Angeles. He believes he's returned to form since arriving in Houston and on Wednesday night he showed it.\n\nWhen asked if he could have had a game like this last season, he chuckled.\n\"Physically, I doubt it,\" he said. \"Not the way I did tonight.\"\nHe said there were times last season that he just couldn't do things he was used to doing.\n\"My mind was at the ball, but my body was still on the other side,\" he said. \"I couldn't do it. I'm a lot healthier than I was last season.\"\nIt was the 63rd 20-plus rebound game of his career, but he was hoping for more.\n\"I really was trying to get 30,\" he said. \"I said coming in tonight that I wanted to get 30 rebounds. I was upset that I didn't do it, but I'll try the next game.\"\nThe Rockets led by four points in the fourth quarter before using a 14-4 run to extend the lead to 86-72 with about 3 1/2 minutes left.\nHarden tossed an alley-oop to Howard for a dunk during that span. The crowd roared as Howard pointed and smiled at his new teammate.\n\"He was amazing,\" Harden said. \"Running the floor, rebounding the basketball ... and finishing the basketball. You know, doing what he does. He's a game changer.\"\nAnother dunk by Howard, this one a two-handed slam, capped the spurt.\nHoward didn't want to talk too much about how big this first game was after his offseason talk of joining the Rockets to help them win championships.\n\"I didn't want to put any pressure on myself,\" he said. \"I just wanted to go out there and play and have fun and get back to being who I am as a player. I think when you focus too much on that and what everybody else is saying that's when you don't play like you want to play.\"\n\nCharlotte coach Steve Clifford said dealing with both Harden and Howard was difficult.\n\"They played to their strengths and we weren't able to hold them when we needed to,\" he said.\nThe Bobcats were led by Josh McRoberts, who had 15 points.\nHouston coach Kevin McHale stayed with the big lineup he first used late in the preseason with 7-footer Omer Asik at center and Howard at power forward. But he switched things up and started Patrick Beverley over Jeremy Lin at point guard.\nBeverley injured his ribs in the second quarter and didn't return. Lin received stitches to his chin, but returned to the game. Harden was dealing with a sore wrist and back, but said he'd be OK by Houston's next game on Friday.\nBeverley finished with five points and Lin added 16.\nFrancisco Garcia had five 3-pointers and finished with 19 points.\nAl Jefferson started after missing most of the preseason with a sprained right ankle. Jefferson, who signed a three-year, $41 million deal in the offseason, had 13 points and eight rebounds in 31 minutes.\n\"I was a little rusty and I most definitely am not in game shape and I missed a lot of shots I would normally make,\" he said.\nHouston led by eight points after a putback layup by Howard early in the third quarter. Jefferson got the Bobcats going after that, scoring four points in a 7-2 run to cut the lead to 51-48.\nA 3-pointer by McRoberts about three minutes later got Charlotte within 57-56. But Lin answered with a 3-pointer that was the first of six straight points for Houston, which pushed the lead to 63-56.\nHouston led 67-61 at the end of the third quarter.\nCharlotte is looking to bounce back from a terrible two-year stretch where the team posted an NBA-worst 28-120 record. They added Jefferson and drafted Cody Zeller with the fourth overall pick in an attempt to bolster the lineup.\nZeller had two points and four rebounds in about 15 minutes.\nHoward was given what at first was called a flagrant foul after what looked like a light push at the midsection of McRoberts with about two minutes remaining in the first half. McRoberts got in Howard's face after the foul before teammates pulled him away. The play was reviewed and changed to a personal foul, but Howard went to the bench anyway.\nMcRoberts made both free throws and Howard returned in the third quarter.\nGame notes\nThe Rockets picked up the third-year option on the contracts of forward Terrence Jones and forward/center Donatas Motiejunas on Wednesday. ... Former Rockets star Tracy McGrady, who retired from the NBA this summer, watched the game from a courtside seat next to team owner Leslie Alexander and got a loud ovation when he was introduced during a timeout in the second quarter.",
  "tags_rule": [
    "InjuryReport",
    "PhysicalGame",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.738468",
  "pipeline_version": "v1"
}