{
  "game_id": "0021700805",
  "espn_id": "400975551",
  "date": "Feb 07, 2018",
  "matchup": "BKN @ DET",
  "headline": "Drummond, Griffin leads Pistons over Nets 115-106",
  "cleaned_body": "DETROIT --  Blake Griffin and the Detroit Pistons are on a roll heading into their matchup with his former team.\n\nGriffin scored 11 of his 25 points in the fourth quarter, and Andre Drummond added 17 points and 27 rebounds to lift the Pistons to their fifth straight victory, 115-106 over the Brooklyn Nets on Wednesday night. Detroit hasn't lost since acquiring Griffin last week in a trade with the Los Angeles Clippers.\n\nThe Clippers play at Detroit on Friday night.\n\n\"Obviously, I know all those guys really well. I can't say that it's just another game,\" Griffin said. \"At the end of the day, we're trying to get wins, they're trying to get wins. I'm not really the type of guy to be all buddy-buddy during the game.\"\n\nAllen Crabbe had 19 of his 34 points in the fourth quarter for the Nets. They have lost four in a row and eight of nine.\n\n\"That's the Allen we want,\" Nets coach Kenny Atkinson said. \"Just more aggressive, more assertive, and if that means he's going to take a few bad shots a game, then we're OK with that.\"\n\nCrabbe scored 16 of Brooklyn's points in a row during one fourth-quarter stretch, including a 3-pointer that cut Detroit's lead to three at 91-88. The Pistons put the ball in Griffin's hands after that, and he scored nine of their next 11.\n\n\"He took over,\" coach Stan Van Gundy said. \"He's done some good things since he's been here in the four games, but that was his best offense for us.\"\n\nDrummond had 12 rebounds in the first half and added 11 more in the third quarter. He finished with a season high, just two shy of his career best. It was the third time in the last five games he reached 20 rebounds.\n\nHe shot only 5 of 17 from the field, but that just meant more opportunities for offensive rebounds. He had seven of those. Despite all that, the Pistons were actually outrebounded as a team, 50-46.\n\nTIP-INS\n\nNets: Brooklyn was without Quincy Acy, who was out because of a sprained right middle finger. ... The Nets went 17 of 51 from 3-point range. ... Jarrett Allen had nine points in the fourth quarter and Joe Harris had five. Those two and Crabbe accounted for all of Brooklyn's scoring in the final period.\n\nPistons: Detroit had a huge advantage in turnovers, committing only seven while the Nets had 20. ... Stanley Johnson had 19 points and Ish Smith added 15.\n\nROSTER MOVE\n\nThe Pistons sent Brice Johnson, one of the players they acquired in the trade for Griffin, to the Grand Rapids Drive of the G League.\n\nRETURN\n\nBrooklyn's Spencer Dinwiddie, who used to play for the Pistons, made a last-second shot to give the Nets a win at Detroit last month. The Pistons kept him under control Wednesday. He scored 12 points and noticed how much different Detroit is with Griffin.\n\n\"I think also, beyond Blake, we gave up too many points off turnovers,\" Dinwiddie said. \"Any time a team goes out and gets baskets, it fuels a run.\"\n\nIN RESERVE\n\nBrooklyn came in averaging 44.4 points per game from its bench, but Detroit's reserves won that battle 30-15. Langston Galloway had 13 points for the Pistons.\n\nUP NEXT\n\nNets: Host the New Orleans Pelicans on Saturday night.\n\nPistons: Host the Clippers on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.074768",
  "pipeline_version": "v1"
}