{
  "game_id": "0021700643",
  "espn_id": "400975389",
  "date": "Jan 15, 2018",
  "matchup": "OKC vs. SAC",
  "headline": "Westbrook, Anthony help Thunder rally past Kings 95-88",
  "cleaned_body": "OKLAHOMA CITY --  The third quarter has often been a problem for the Oklahoma City Thunder this season, but that's when they made their move Monday night against the Sacramento Kings.\n\nRussell Westbrook had 19 points, 16 rebounds and nine assists before being ejected, and Oklahoma City rallied from a 15-point first-half deficit to beat Sacramento 95-88.\n\nCarmelo Anthony added 20 points, Paul George scored 18 and Steven Adams had 13 points and 13 rebounds for the Thunder, who avoided what would have been a fourth straight home loss thanks in large part to a dominant third quarter in which they outscored the Kings 31-16.\n\n\"We were definitely more focused,\" George said. \"We've been in this position where we played a sub-.500 team and for whatever reason, we tried to turn it on and win the ballgame late in the fourth. Tonight we took it at them early, got that cushion and that carried us through the finish.\"\n\nBuddy Hield scored 16 points and Willie Cauley-Stein added 15 for Sacramento, which scored only 36 second-half points and is 1-16 on the road against Oklahoma City since the Thunder franchise moved from Seattle.\n\nOklahoma City was up 91-77 with 2:51 left before official Matt Boland called two quick technical fouls on Westbrook after he complained about being called for traveling on a play on which he thought he'd been fouled.\n\nAnother official, Gediminas Petraitis, then called a technical foul on Thunder coach Billy Donovan for protesting Westbrook's ejection. Hield made all three technical free throws and Cauley-Stein went 1 of 2 from the line with 2:35 left, pulling Sacramento to 91-84. But the Kings made only one field goal the rest of the way, and George blocked a shot and came up with a steal in the final two minutes.\n\n\"Melo, he was able to score about 15 points that (third) quarter,\" Hield said. \"He was helping open up the gap for him. (Westbrook) started making plays for everybody else. We got it back under 10, but we've got to be a little more experienced and a little more controlled. We've got to do better at executing late. We have to do a better job at helping each other out and make plays down the stretch.\"\n\nThe Kings led 24-20 after the first quarter and stretched their advantage to 48-33 after two free throws by Bogdan Bogdanovic with 3:03 left in the half. The Thunder closed the half on an 11-3 spurt to pull to 52-46.\n\nThe Thunder seized control with an 11-0 run in the third quarter, highlighted by consecutive alley-oop passes from Westbrook for dunks -- first to Anthony, then to Adams. Anthony's two free throws put Oklahoma City ahead 75-66 with 1:39 left in the quarter.\n\n\"We just had to decide that we wanted to play (and) pick it up, take it up another level,\" Anthony said. \"Once we decided we wanted to do that in the second half, we changed the outcome of the game.\"\n\nAfter the teams went scoreless for the first three-plus minutes of the fourth, Sacramento pulled within seven on a basket by Cauley-Stein, but Patrick Patterson hit two 3-pointers in a 17-second span and Alex Abrines followed with another to extend the Thunder's lead to 86-70.\n\nTIP-INS\n\nKings: Hield traveled back to Norman on Sunday to visit practice at No. 4 Oklahoma. Hield led the Sooners to the 2016 Final Four. ... The Kings, who beat the Thunder on Nov. 7 in Sacramento, haven't won two straight over the Oklahoma City franchise since the 2007-08 season, when the team was in Seattle. ... The Kings made 15 of 25 free throws, while the Thunder went 14 of 29 from the line.\n\nThunder: Ace defender Andre Roberson sat out for the eighth straight game with patellar tendinitis in his left knee. ... For the 14th straight game, Westbrook recorded a double-double with at least 20 points. The only guard in NBA history to have a longer such streak was Michael Jordan, with 15 straight in 1989. ... George, the NBA steals leader, had five. ... Westbrook's 16 rebounds were three off his career high. ... At halftime, the team showed a video with Thunder players reciting excerpts from Martin Luther King Jr.'s famed \"I Have A Dream\" speech.\n\nTHE EJECTION\n\nWith Oklahoma City up by 14 and the game seemingly under control, Westbrook looked to finish it off with a driving layup, but collided with Cauley-Stein as De'Aaron Fox appeared to hit Westbrook in the face. Boland ruled that Westbrook had traveled, setting off the slew of technical fouls.\n\nWestbrook didn't stick around to answer questions after the game, but Donovan said Petraitis later apologized to him for calling the technical foul on the coach.\n\n\"The official made a terrible mistake and he acknowledged it,\" Donovan said. \"I was yelling to the other official across the floor to get his attention and (Petraitis) just T'd me up. He came by and apologized to me. I definitely didn't deserve a T. . I've been doing this long enough, I know when I'm close to getting a T and when I deserve a T. That was totally undeserved and should not have been called.\"\n\nUP NEXT\n\nKings: Host the Utah Jazz on Wednesday before embarking on a six-game road trip.\n\nThunder: Host the Los Angeles Lakers on Wednesday.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "PhysicalGame",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.561960",
  "pipeline_version": "v1"
}