{
  "game_id": "0021301139",
  "espn_id": "400490012",
  "date": "Apr 04, 2014",
  "matchup": "OKC @ HOU",
  "headline": "Rockets sink OKC to clinch playoff spot; Kevin Durant ties MJ mark",
  "cleaned_body": "HOUSTON -- The Houston Rockets are heading to the playoffs for the second straight year and believe wins like the one they picked up Friday night will help them when they get there.\nJames Harden scored 39 points and the Rockets ended a three-game skid and clinched a playoff berth with a 111-107 victory over the Oklahoma City Thunder\n\"It was a great win for us ... just to give ourselves confidence, especially going into the playoffs,\" Harden said. \"We might see them. It was a big win for us. It shows the resilience we have.\"\nKevin Durant scored 28 points and grabbed 12 rebounds for his 40th straight game with at least 25 points, the longest streak since Michael Jordan also did it 40 consecutive times in 1986-87. But he was in no mood to talk about matching the feat after the game.\n\"We lost the game that's all I'm worried about,\" he said. \"I don't care. We lost.\"\nThe normally mild-mannered Durant, who leads the NBA with 32.1 points a game, talked a little trash afterward when asked if he was frustrated by the physical defense Houston's Chandler Parsons and Francisco Garcia played on him.\n\"Those dudes can't check me 1-on-1,\" he said. \"They know that. I ain't afraid to say it either. They know that. So I was playing the double-teams, triple-teams, but you still got to find a way to do it. They're physical just like everybody else and I've been playing against physical players my whole life, so it's nothing different.\"\nThe Thunder, who had already secured a playoff berth, clinched their fourth consecutive Northwest Division title with a loss by Portland later Friday.\nDurant's 3-pointer cut Houston's lead to one with 1:01 remaining, but Houston answered with four straight free throws. He made another 3 with 16 seconds left, but Harden made two free throws to push the lead to 111-107.\nHarden was 17 of 20 from the line and had nine rebounds and seven assists.\nThe Rockets were playing without Dwight Howard and Patrick Beverley, who both missed their fourth straight games. Howard has missed seven games recently because of a left ankle strain and Beverley is out indefinitely with a torn meniscus in his right knee.\n\"There's all kind of adversity in playoff games and playoff runs,\" coach Kevin McHale said. \"You've got to be resilient and that's what I've been preaching with the guys and the coaching staff. You've just got to stay in the fight and keep swinging. When we do that, we're OK.\"\nSerge Ibaka tied a career high with 27 points in a game that Russell Westbrook didn't play because the Thunder were playing the second night of a back-to-back.\nParsons added 23 points for Houston and Terrence Jones had 16 points and 11 rebounds.\nOklahoma City was up by one before Houston scored seven straight points to take a 104-98 lead with less than three minutes left. The Rockets made four free throws before a 3-pointer by Garcia.\nThe Rockets started the fourth quarter with 3-pointers by Jeremy Lin, Isaiah Canaan and Harden for a 9-2 spurt which gave them a 91-86 lead with about 10 minutes left. Durant scored the next four points to get Oklahoma City within 91-90.\nHouston scored the last six points of the third quarter to cut the lead to 84-82 entering the fourth quarter.\nThe Thunder scored 39 points in the third quarter to take the lead after trailing the entire game. They opened the second half with a 9-0 run punctuated by a dunk by Ibaka to make it 54-52. Houston went right back on top with a 3-pointer by Parsons, but a 9-2 spurt by the Thunder gave them a 63-57 lead with about seven minutes left in the quarter.\nThe Thunder trailed through the first quarter and cut it to three points early in the second quarter on a 3-pointer by Caron Butler before an 11-0 run by Houston pushed the lead to 43-29 about five minutes before halftime. Harden scored the last seven points in that span and capped it by making a 3-pointer with Derek Fisher right in his face.\nDurant scored Oklahoma City's final five points to get the Thunder within 50-45 at halftime. The first three points of that run came when Durant was fouled on an off-balance layup he made with his back to the basket and then made the free throw.\nGame notes\nThe 39 points the Thunder scored in the third quarter were the most anyone has scored against Houston this season in the quarter. ... Hall of Famer Hakeem Olajuwon watched the game from a courtside seat. ... The win was Houston's 50th, giving them the 10th 50-win season in franchise history.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.294246",
  "pipeline_version": "v1"
}