{
  "game_id": "0021400023",
  "espn_id": "400578315",
  "date": "Oct 31, 2014",
  "matchup": "MIL vs. PHI",
  "headline": "Mayo scores 25, Bucks beat Sixers 93-81",
  "cleaned_body": "MILWAUKEE -- The sellout crowd gave star rookie Jabari Parker the biggest pregame cheers. Veteran guard O.J. Mayo ended up having the biggest night.\nUnder new ownership, the new-look Milwaukee Bucks got off to a good start in coach Jason Kidd's sideline debut at the Bradley Center.\nMayo scored 10 of his game-high 25 points in the fourth quarter, and the Bucks pulled away with an 11-0 run over the final 8:21 in a 93-81 win Friday night over the Philadelphia 76ers in their home opener.\n\"Being a young team and playing through it and finding a way to grind a win out -- that's what good teams have to do in this league, so we're going in the right direction,\" Kidd said.\nParker finished with 11 points and 10 rebounds. Fellow 19-year-old forward Giannis Antetokounmpo, the team's other teen cornerstone, had eight points and six boards.\nBut it was the 26-year-old Mayo -- a grizzled veteran by Bucks standards -- who got the offense going down the stretch.\nMayo's 3 with 5:10 left put Milwaukee up 88-81. The veteran guard sparked a 7-0 run to start the fourth quarter with another 3.\nAfter a subpar 2013-14 season, when Mayo was sidelined in part by a viral infection, the 6-foot-5 guard is averaging 21 points a game this young season.\n\"It's trusting one another out there and doing everything with energy and effort,\" Mayo said. \"Energy and effort will help us out a lot.\"\nRookie Nerlens Noel had 14 points and 10 boards for Philadelphia.\nHollis Thompson's 3 with 8:21 left got Philadelphia to within 82-81, a five-point swing for the Sixers after the Bucks' Jared Bayless blew a wide-open layup on the other end.\nIt turned out to be Philadelphia's last bucket. The 76ers missed their last 14 shots.\nCoach Brett Brown said his team is looking for a go-to player late in games.\n\"Some of that is just evolving to try to find some specific things. I think we can put Nerlens (Noel) in some better spots. I think after that it's got to be done by a collective effort,\" Brown said.\nThe Sixers were also outrebounded 55-42. Larry Sanders grabbed 15 boards for Milwaukee.\nTIP-INS\n76ers: Before the game, Philadelphia exercised the third-year options for Noel and injured guard Michael Carter-Williams, last season's NBA Rookie of the Year. The Sixers also exercised the fourth-year option for guard Tony Wroten. .... Carter-Williams is expected back in a couple weeks from a right shoulder injury. Coach Brett Brown said he could use 11 players upon Carter-Williams' return.\nBucks: The team broke off contract extension talks with guard Brandon Knight, who is in the final year of the four-year deal he received after being drafted in the first round by Detroit in 2011. Knight would enter restricted free agency after this season. ... The hometown fans gasped after Sanders nearly tossed in an open layup into his own bucket off a jump ball with 6:14 left in the fourth quarter. Sanders smiled as he jogged up the court.\nUP NEXT\n76ers: Host Heat in home opener on Saturday.\nBucks: Visit Wizards on Saturday.\nKNOCKED OUT\nK.J. McDaniels had 12 off the bench for Philadelphia on 5-of-7 shooting in 13 minutes before getting sidelined by what he said was an injury near his right hip. McDaniels, who is scheduled to see the doctor on Saturday, said he thought he may have been hit with an elbow or knee.\n\"I played through it and it just got worse. It was severe,\" he said.\nCUT OFF\nKnight added 13 points, eight assists and seven rebounds but answered questions mostly about the end of contract talks after the game.\n\"It is unfortunate. I definitely wanted to get it done. I love the organization. I love the coaching staff so far, and the players are like my brothers. It is unfortunate that it didn't happen, but I won't be worried about it throughout the year,\" Knight said.\nGAME BALL\nThe game also represented the first home contest for new owners Marc Lasry and Wesley Edens since the New York investment firm executives bought the team in the spring. The Bucks handed the new owners the game ball in the postgame celebration.\n---\nFollow Genaro Armas at http://twitter.com/GArmasAP",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.171349",
  "pipeline_version": "v1"
}