{
  "game_id": "0021400035",
  "espn_id": "400578327",
  "date": "Nov 01, 2014",
  "matchup": "CHI @ MIN",
  "headline": "Jimmy Butler nails two FTs in final second as Bulls edge Wolves",
  "cleaned_body": "MINNEAPOLIS -- Jimmy Butler's surprise return to the Chicago Bulls' starting lineup should really come as no surprise at all.\nButler is the embodiment of the Bulls' mind-over-matter mantra, and he returned just in time to teach No. 1 overall draft pick Andrew Wiggins a hard-to-swallow lesson.\nButler coaxed the over-aggressive Wiggins into a foul with 0.2 seconds left. Then Butler calmly knocked down two free throws to help the Bulls weather another absence from Rose in a 106-105 victory over the Minnesota Timberwolves on Saturday night.\n\nButler scored 24 points on 6-for-12 shooting in his season debut and Pau Gasol added 29 points and six rebounds for the Bulls, who missed Rose with sprained ankles.\n\"What a way to kick off the season,\" Butler said. \"I'm happy we got a dub. Wins are hard to come by, so on to the next one.\"\nKevin Martin scored 33 points and hit a 3-pointer for a 105-104 lead with 2.9 seconds to play.\nThen Butler took the inbounds pass, stumbled to his knee, gathered himself and pump-faked to get Wiggins up in the air.\n\"I said, 'Oh I'm going to get him, I'm going to get him,'\" Butler said. \"I gave him the pump fake and he bit on it.\"\nRicky Rubio tied a career high with 17 assists in his first game since signing a four-year, $55 million contract extension. But the Wolves lost starting power forward Thaddeus Young to a strained neck on a scary collision with Butler just before halftime.\nThe Bulls led by 16 points in the first half, but Anthony Bennett and Martin led a Wolves comeback in the final two quarters. Martin's big 3 came after two offensive rebounds, but Wiggins was too aggressive on Butler on the final possession.\n\"I could've changed the outcome of the game,\" Wiggins said. \"It was a learning experience for me. It hurt, but the good thing about the NBA, I've got another game in a couple days.\"\nRose warmed up before the game, but the Bulls made a late decision to rest their former MVP who has missed most of the last two seasons with knee problems. Taj Gibson also missed the game with an ankle injury, but the Bulls were buoyed by Butler's return.\nThe shooting guard missed the first two games of the season with a sprained left thumb that was expected to keep him out much longer, and he made five of his first six shots to get the Bulls out to a 16-point lead in the first half.\nShowing no signs of disenchantment from the inability to get a new long-term extension done by the Friday deadline, Butler was a force on both ends as usual.\nButler played the entire first quarter and scored nine points while making life miserable for Wiggins on the other end. Wiggins was 0 for 3 at halftime and finished with eight points and six rebounds in 31 minutes.\n\"He came in in great shape, and I think that's helped him greatly because when you do take on an injury, the conditioning's not going to be the same during that time but because he was in great shape it allowed him to bounce back very quickly,\" coach Tom Thibodeau said. \"And Jimmy's got a lot of mental toughness. He's invaluable to us.\"\nROSE UPDATE\nRose said he could've played if it was necessary, but didn't want to push it so early in the season. \"If it was a real need for me to play, I think I could've played but I'm just trying to be smart and trying to give it an extra day,\" Rose said, \"and thank God that we came out with the win.\"\nTIP-INS\nBulls: Bulls coach Tom Thibodeau said he wasn't concerned with Rose's injury and also said he had no doubt in his mind his star point guard would get back to the impact player he was before the knee issues. ... Aaron Brooks scored 13 of his 16 points in the first half. Nikola Mirotic added 12 points and eight boards.\nTimberwolves: In conjunction with Rubio's contract, the Wolves unveiled a ticket promotion dubbed the No. 9 pack in which fans who purchase tickets to eight games get the ninth one -- vs. Milwaukee on Nov. 26 -- free. ... Martin hit all 11 of his free throws.\nRUBIO'S NIGHT\nRubio was just 3 for 10 from the field and scored six points and fouled out with 1:13 to play, which bothered him more than the great passing night. \"I let my team down,\" he said.\nUP NEXT\nBulls: Host Orlando on Tuesday night.\nTimberwolves: Visit Brooklyn on Wednesday night to start an 18-day road trip.",
  "tags_rule": [
    "MomentumShift",
    "ReturnFromInjury",
    "FoulTrouble",
    "CoachComment",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.014601",
  "pipeline_version": "v1"
}