{
  "game_id": "0022100887",
  "espn_id": "401360706",
  "date": "Feb 17, 2022",
  "matchup": "MIL vs. PHI",
  "headline": "Embiid has huge game to help 76ers outlast Bucks, 123-120",
  "cleaned_body": "MILWAUKEE -- — With the regular season already two-thirds of the way over, the Philadelphia 76ers wanted to avoid entering the All-Star break on a losing streak.\n\nJoel Embiid made sure it didn’t happen.\n\nEmbiid had 42 points, 14 rebounds and five assists and the 76ers regrouped after squandering a 15-point lead to beat the Milwaukee Bucks 123-120 on Thursday night.\n\n“The one thing the later All-Star break does, when you come out, it’s a sprint,” 76ers coach Doc Rivers said. “It’s no longer the midway point, where you can ease back from the break. It’s a full sprint when you come back.”\n\nEmbiid put the 76ers ahead for good at 117-116 with a 10-footer with 2:32 left. The victory helped the 76ers enter the All-Star break with momentum two nights after an embarrassing 135-87 home loss to Boston.\n\n“It was all about the start,” Embiid said. “From the start, everybody was aggressive.”\n\nTobias Harris, who scored 19 points, said the 76ers showed more focus Thursday as they responded to that lopsided defeat. He said it was evident as early as the pregame shootaround.\n\n“That was a game that I'll say we kind of needed just to push us back and understand we've got a lot of work to do, to focus,” Harris said.\n\nGiannis Antetokounmpo had 32 points, 11 rebounds and nine assists for the Bucks.\n\nPhiladelphia played without James Harden, who hasn’t made his 76ers debut since coming over in a trade with the Brooklyn Nets last week. The 10-time All-Star and 2018 MVP hasn’t played since Feb. 2 due to an injured left hamstring.\n\nAfter trailing by 15 early in the third quarter, the Bucks clawed back and took their first lead since the second period on Jrue Holiday’s 3-pointer with 5:47 left. Antetokounmpo’s 3-pointer extended the advantage to 116-112 with 3:56 remaining.\n\nBut the 76ers scored the next eight points to pull back ahead for good in the final game for both teams before the All-Star break. The Bucks missed six straight shots and committed turnovers on consecutive possessions during that stretch.\n\n“We had a lot of open looks, good shots that did not fall, shots that we usually make down the stretch,\" Antetokounmpo said.\n\nMilwaukee's Khris Middleton missed a 3-pointer with about nine seconds left.\n\nThe Bucks had one final chance after Philadelphia’s Furkan Korkmaz lost the ball out of bounds with 2.3 seconds left. After Embiid fouled Antetokounmpo to force one more inbounds pass with 1.1 seconds left, Middleton missed a desperation 3-point attempt at the buzzer.\n\n“Very frustrating,” said Middleton, who scored 19 points but shot 2 of 12 from 3-point range. “That's how these games go sometimes. You've just got to trust and keep shooting when I'm open, keep being aggressive.”\n\nPhiladelphia's Tyrese Maxey scored 19 points, Georges Niang added 18 points and Korkmaz had 13.\n\nHoliday scored 24 points for the Bucks, Jordan Nwora had 18 and Bobby Portis 17.\n\nThe 76ers snapped a six-game skid in this series. That included a 118-109 decision at Philadelphia on Nov. 9. Embiid, Harris, Matisse Thybulle and Isaiah Joe didn’t play for the 76ers in that Nov. 9 matchup due to the NBA’s health and safety protocols.\n\nTIP-INS\n\n76ers: Embiid’s 19-point performance against Boston ended a string of 23 straight games in which he had scored at least 25 points. He'd already reached the 25-point mark early in the third quarter Thursday. ... Although Harden didn’t play, he did travel with the team and was on the bench in regular clothes.\n\nBucks: One day after signing with the Bucks, DeAndre’ Bembry wasn’t able to play due to a sore left thumb. … Grayson Allen didn’t play due to a sore left hip. … Thursday marked the midway point of an unusual stretch of six straight home games for the Bucks. Milwaukee has gone 2-1 in a three-game home stand before the All-Star break. The Bucks return from the break to play three more home games.\n\nUP NEXT\n\n76ers: At Minnesota on Friday, Feb. 25.\n\nBucks: Host Brooklyn on Saturday, Feb. 26.\n\n------",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.056212",
  "pipeline_version": "v1"
}