{
  "game_id": "0021700913",
  "espn_id": "400975659",
  "date": "Feb 28, 2018",
  "matchup": "MIL @ DET",
  "headline": "Pistons dominate inside, rout Bucks 110-87",
  "cleaned_body": "DETROIT --  The most obvious advantage for the Detroit Pistons was their rebounding, and Stan Van Gundy felt a lot of players contributed to that.\n\n\"I thought that our cuts -- and a few drives, but a lot of cuts -- forced their `5' to help,\" the Detroit coach said. \"So even if you're missing shots, then bodies are off of Andre (Drummond) and Eric (Moreland), and they're both really good offensive rebounders when that happens.\"\n\nDrummond had 15 points and 16 rebounds, and the Pistons dominated inside in a 110-87 victory over the Milwaukee Bucks on Wednesday night. Moreland added 10 points, 12 rebounds and six assists for Detroit, which won for only the second time in eight games.\n\nThe Pistons outscored Milwaukee 56-34 in the paint and had 15 offensive rebounds in the first half alone. They finished the game with 22.\n\n\"You can't give a team that many extra possessions and have a chance to win,\" Milwaukee's Jabari Parker said. \"If we take away those extra possessions, we're right back in the game.\"\n\nBlake Griffin had eight points, nine rebounds and seven assists for Detroit, which trails Miami by three games for the final playoff spot in the Eastern Conference. Milwaukee is one game ahead of the Heat.\n\nEric Bledsoe scored 19 points for the Bucks, who have lost three straight. Milwaukee star Giannis Antetokounmpo left with 10:08 remaining in the game with an apparent injury around his right eye.\n\n\"We've been told that it is an eye, and he'll be re-evaluated tomorrow,\" Bucks coach Joe Prunty said.\n\nReggie Bullock scored 12 of his 16 points in the first quarter for the Pistons. It was tied at 32 after one, then Detroit held Milwaukee to 12 points in the second and led 53-44 at halftime.\n\nThe Pistons led by as many as 20 in the third and weren't seriously threatened down the stretch. Milwaukee missed its first 11 shots from the field in the fourth.\n\nDetroit finished with a 57-35 advantage on the boards. Drummond had 10 offensive rebounds. It was his 18th career game with at least 10, the most among active players.\n\nThe Detroit bench, an area of weakness lately, outscored Milwaukee's reserves 63-30. Stanley Johnson, who was replaced by James Ennis in the starting lineup, had 19 points.\n\n\"Stanley can adapt and go from starter to the bench,\" Bullock said. \"He played well tonight. He made shots. He got other players involved. He's tough to stop in transition.\"\n\nParker, who set season highs in scoring in each of the previous two games, was held to only seven points after scoring 19 on Tuesday against Washington.\n\nTIP-INS\n\nBucks: G Tony Snell (right thigh) missed the game. ... Milwaukee fell to 9-4 in the second game of back-to-backs.\n\nPistons: Van Gundy said F Jon Leuer (left ankle surgery) is making progress. \"He's doing stuff,\" Van Gundy said. \"We're optimistic that he'll get a full offseason and be ready to go.\" ... Langston Galloway had 13 points and Dwight Buycks added 12.\n\nDELAY\n\nThe start of the game was delayed about 12 minutes because of debris from a pregame entertainment act. The court was cleaned off, and the teams were eventually able to warm up and play.\n\nMILESTONES\n\nDrummond surpassed 6,000 career points, and Ennis played in his 200th career game. Detroit's Anthony Tolliver surpassed 2,000 career rebounds.\n\nUP NEXT\n\nBucks: Host the Indiana Pacers on Friday night.\n\nPistons: Visit the Orlando Magic on Friday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball\n\n---\n\nFollow Noah Trister at www.Twitter.com/noahtrister",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.274533",
  "pipeline_version": "v1"
}