{
  "game_id": "0021400520",
  "espn_id": "400578812",
  "date": "Jan 06, 2015",
  "matchup": "MIL vs. PHX",
  "headline": "Suns dump Bucks behind Markieff Morris double-double",
  "cleaned_body": "MILWAUKEE -- No chance of a letdown for the Phoenix Suns.\nMarkieff Morris scored 26 points and grabbed 10 rebounds to lead the Suns to a 102-96 victory over the Milwaukee Bucks on Tuesday night.\nA bright spot for the Bucks was the return of center Larry Sanders, even if he was in street clothes and sitting on the bench. He missed his seventh consecutive game due to, at first, the flu but since then for personal reasons.\n\"It feels great to be around the guys again,\" Sanders said. His last game was Dec. 23, and he said rumors he might even quit basketball weren't true.\n\"But, what is true,\" he said, \"is that I'm in the process of working things out now to do as best for my psyche and my physical health going forward. There's a lot of evaluating going on.\"\nPhoenix (21-16) was coming off its second-highest scoring total of the season in Sunday's 125-109 win at home over Atlantic Division-leading Toronto.\nFacing the Bucks, who beat the Suns 96-94 six weeks ago on Khris Middleton's buzzer-beating 3-pointer, they still had plenty of energy and drive.\nIsaiah Thomas added 19 and Goran Dragic 16 for the Suns, who have scored 100 or more points in nine straight games.\n\"It wasn't the prettiest game,\" Suns coach Jeff Hornacek said. \"There were a lot of turnovers and a lot of missed shots, but we got it going a little bit in the second half, scoring 59 points. We played more like we were capable of playing.\"\nThe Bucks turned the Suns' 20 turnovers into 22 points while Phoenix cashed in on Milwaukee's 17 miscues for 16. Phoenix shot 40 percent in the first half, falling behind Milwaukee by 10, but then recovered and went 51 percent from the floor in the second.\n\"Our guys made big plays at the end,\" Hornacek said.\nAfter three lead changes and a tie to start the fourth quarter, the Suns went ahead for good when Markieff Morris kept an offensive rebound alive and tipped it in and Marcus Morris converted a three-point play for an 81-76 lead early in the quarter.\nPhoenix capitalized on Milwaukee's poor shooting to cling to a lead that never topped seven points down the stretch. The Bucks made nine of 27 shots in the fourth quarter, and their defense disappeared.\n\"You can't give them wide-open 3s late in the game,\" Bucks coach Jason Kidd said.\nThomas said stopping the Bucks was important.\n\"We got key stops and scored on the offensive end,\" Thomas said. \"We stayed aggressive and got in the bonus with about four or five minutes left in the game. That's what got us the win.\"\nBrandon Knight scored 26 and Giannis Antetokounmpo added 16 for the Bucks, who lost their fourth straight at home.\nThe Suns have won nine of the past 11 and opened the four-game road trip with their third consecutive victory. They also upped their record to 8-1 over Eastern Conference opponents.\nMiddleton's 3 with 1:49 left pulled the Bucks to 94-92, but the Suns pulled away on a jumper by Dragic, a 3-pointer by Markieff Morris and a free throw from Thomas.\nAntetokounmpo and Knight put some energy back in the Bucks' offense when each dunked during a 12-4 surge that put Milwaukee back in the lead 62-58 with 4:44 left in the third quarter.\nTIP-INS\nSuns: Phoenix had 15 points in the first quarter, just four better than its season low of 11 for that period set Oct. 31 against San Antonio. ... Thomas came off the bench to score 13 points in the first half, one better than all Bucks reserves. ... P.J. Tucker missed all four of his shots in the first half, but his first basket of the third gave Phoenix a 45-44 lead.\nBucks: Middleton picked up an inadvertent technical late in the first quarter. With play stopped under the Suns' basket, he spiked the ball while walking away from referee Eric Dalen. When Middleton failed to catch it, Dalen called the foul.\nUP NEXT\nSuns: Visit Minnesota on Wednesday night.\nBucks: Visit Philadelphia on Wednesday night.",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.994672",
  "pipeline_version": "v1"
}