{
  "game_id": "0021300682",
  "espn_id": "400489555",
  "date": "Jan 29, 2014",
  "matchup": "CHA @ DEN",
  "headline": "Bobcats beat Nuggets behind Al Jefferson's 35 points",
  "cleaned_body": "DENVER -- Al Jefferson is pulling away in a big way from a slow, painful start to his season.\nJefferson matched a season high with 35 points, including a key basket in the final seconds, and the Charlotte Bobcats hung on to beat the Denver Nuggets 101-98 on Wednesday night.\nIt was the 10th consecutive game in which Jefferson has scored at least 20 points, an offensive flurry reflecting his improved health since missing nine of the Bobcats' first 12 games this season because of a sprained right ankle.\n\"It is all about staying healthy,\" Jefferson said. \"I am 85 or 90 percent right now. If I were 100 percent, I could be very effective. I am working hard to get to 100 percent.\"\nJefferson looked awfully close to that in a game in which he also had 11 rebounds for his 14th double-double in his last 22 games.\n\"He is scoring and then we are also scoring off him. His effect on his teammates is good,\" Bobcats coach Steve Clifford said.\nGerald Henderson and Ramon Sessions each added 16 points for the Bobcats who beat the Nuggets in Denver for only the second time in eight games here.\nRandy Foye scored a season-high 33 points to lead Denver, which was without leading scorer Ty Lawson (left shoulder). His replacement, Nate Robinson, was knocked out of the game in the first quarter with a left knee sprain, forcing Foye into the unfamiliar role of running the point.\n\"Nate and Ty, they push the ball and do so many different things,\" Foye said. \"I just tried to mimic some of the things that Ty does, just being aggressive, taking it to the basket and trying to make plays for everybody, picking my spots where I needed to score.\n\"But we fouled a lot. We gave them the game. We got stops. They got offensive rebounds and we fouled them. We made some bonehead plays fouling them and just putting them on the free throw line. But we'll figure this out. There's no quit in this team.\"\nRobinson was hurt in a spill underneath the Nuggets' basket. He got up gingerly and continued playing but was forced to leave the game a short time later.\nHe did not return and the Nuggets said Robinson was scheduled to undergo an MRI scan on Thursday to further evaluate the injury, which the team initially described as a sprain.\nEvan Fournier added 19 points for the Nuggets and Timofey Mozgov had 15.\nUp by one at the break, the Bobcats pulled into a 75-all tie heading into the fourth period on a pair of free throws by Sessions, helping to offset a 3-pointer by Fournier moments earlier.\nJefferson's 6-foot jumper evened the score again, at 82-all, but Fournier connected on a jumper and, after a turnover by the Bobcats, Foye drained a 3-pointer to give the Nuggets a five-point edge with 6:38 remaining.\nFoye's long jumper produced a final tie at 95-95 with 1:08 left. Michael Kidd-Gilchrist made one of two free throws and, after Wilson Chandler missed a contested reverse layup, Jefferson sank a jumper for a 98-95 lead with 23.1 seconds remaining.\nDarrell Arthur made a 3-pointer with 10.7 seconds left to pull the Nuggets within 99-98, but after Henderson was fouled and made one of two free throws with 9 seconds remaining, the Bobcats' defense turned away shots from up close by Fournier and Mozgov to help the Bobcats hang on.\n\"It was a weird play at the end,\" Jefferson said. \"The rebound (off Fournier's miss) got deflected in some kind of way. Mozgov got the ball and had a clean shot at a layup, but MKG (Kidd-Gilchrist) made a heck of a job to block it.\"\nAdded Henderson: \"Those are plays that win games.\"\nLeading by as many as 14 points early on, the Bobcats settled for a 53-52 halftime lead as the Nuggets outscored Charlotte 31-21 in the second quarter.\nJefferson converted a three-point play to give Charlotte a 43-31 advantage with 5:47 remaining in the second, but Denver closed the period on a 21-10 run capped by Arthur's 20-jumper an instant before the first-half buzzer.\nGame notes\nThe Bobcats' Ben Gordon missed the game because of illness. ... The Nuggets and Bobcats meet one more time this season on March 10 in Charlotte. ... Kemba Walker missed his fifth game for the Bobcats since spraining his left ankle Jan. 18 against Miami. The Bobcats are 3-2 in that span. ... Jefferson also scored 35 points against the New York Knicks on Jan. 14. ... Foye's previous high this season was 24 points on Jan. 9 against Oklahoma City.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "ClutchShot",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.302992",
  "pipeline_version": "v1"
}