{
  "game_id": "0022100291",
  "espn_id": "401360115",
  "date": "Nov 26, 2021",
  "matchup": "SAC @ LAL",
  "headline": "Fox, Hield lead Kings over Lakers 141-137 in triple OT",
  "cleaned_body": "LOS ANGELES -- — Alvin Gentry said when he became Sacramento's interim coach that it was going to take everyone if the Kings were going to stop their season from spiraling out of control.\n\nOn Friday night, they got plenty of contributions up and down the roster. Seven players scored in double figures as Sacramento outlasted the Los Angeles Lakers 141-137 in triple overtime.\n\n“There are guys this season that haven't played many minutes, but they are starting to give us a boost when called upon,” Gentry said. “For us it takes a village and that's what we are trying to do. We continued to compete, plow our way back a little at a time and eventually took the lead.”\n\nDe’Aaron Fox scored 34 points and Buddy Hield had 13 of his 25 after regulation for the Kings, who have won two straight after dropping eight of nine. They are 2-1 since Luke Walton was fired Sunday.\n\nIn a game that saw 19 ties and 23 lead changes, the Lakers led 126-124 a minute into the third overtime when the Kings went on an 11-2 run to go up by seven with 1:54 remaining. Marvin Bagley III had five points during the spurt, including a three-point play to give Sacramento the lead.\n\nCarmelo Anthony hit a 3-pointer with 9.4 seconds remaining to get the Lakers within a basket, but Hield sank a pair of free throws on the ensuing possession to put it away.\n\nTyrese Haliburton had 19 points for the Kings, who were in their first triple-OT game since 2009.\n\n“It’s been good to get the two wins but we are still climbing,” Fox said. “We wanted to keep running and keep the pace up. We didn't have fresh legs out there, but they were young legs.”\n\nThe Lakers, who are 10-11 after dropping five of their last seven, had four players with at least 20 points with the first time this season. LeBron James led the way with 30 points, Russell Westbrook added 29, Anthony Davis 23 and Malik Monk 20.\n\n“When we get an opportunity to knock a team out, we just allow them to stick around,” Lakers coach Frank Vogel said. “We knew the early season was going to be bumpy. You want to win games like this but there is a big-picture mindset we are taking with this team.”\n\nThe Lakers scored the first six points of the first overtime and were up 110-103 before the Kings scored seven straight, including Hield's 3-pointer to tie it with 28 seconds remaining. Davis had a driving layup with 9.0 seconds remaining but Sacramento forced a second OT on Hield's 18-foot jumper.\n\nThe largest lead anyone had in the second overtime was three points. James made a driving layup with 24 seconds remaining to tie it at 124. Sacramento had the final possession, but couldn't get a shot off.\n\n“We're very frustrated. First game after the road trip, this is a game we should have won,” Davis said. “We had control of it in the fourth and let it get away. We have to be a better home team than we are right now.”\n\nHOW WE GOT TO OVERTIME\n\nMonk scored 11 points during a 24-8 second-half run that saw the Lakers turn a three-point deficit with 4 minutes to go in the third quarter into an 86-73 advantage with 10:02 remaining.\n\nThe Kings would counter with a 22-5 rally, including eight points from Alex Len, to seize a 98-93 advantage with 2:26 to go. Los Angeles, though, scored seven of the last nine points of regulation to send it to overtime.\n\nAfter a layup by James gave the Lakers a 100-98 advantage, Fox tied it with a layup with 21 seconds to go. The Lakers had the final shot, but James missed a 3-pointer at the buzzer to send it to overtime.\n\nTIP-INS\n\nKings: Maurice Harkless started and played only eight minutes due to left knee soreness. ... It was Fox's second game this season with at least 30 points. He scored 37 on Nov. 10 at San Antonio. ... Terence Davis had 13 points before fouling out in overtime. ... Harrison Barnes (right foot sprain) and Richaun Holmes (right eye contusion) were out of the lineup.\n\nLakers: It was Los Angeles' first triple OT game since 2011. ... Anthony (16 points) was 6 of 13 from the field after going 7 of 27 the past two games. ... This was Monk's third game with at least 20 points since joining Los Angeles during the offseason. ... Davis reached 800 career steals when he stripped the ball from Fox during the first overtime.\n\nUP NEXT\n\nKings: Travel to Memphis Sunday.\n\nLakers: Host Detroit Sunday.\n\n------",
  "tags_rule": [
    "MomentumShift",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.967066",
  "pipeline_version": "v1"
}