{
  "game_id": "0021700039",
  "espn_id": "400974790",
  "date": "Oct 22, 2017",
  "matchup": "MIN @ OKC",
  "headline": "Wiggins' heave banks in, leads Timberwolves past Thunder",
  "cleaned_body": "OKLAHOMA CITY --  Andrew Wiggins didn't have time to get near the basket for a final shot.\n\nJust inside halfcourt was close enough.\n\nWiggins' desperation heave banked in as time expired to give the Minnesota Timberwolves a 115-113 victory over the Oklahoma City Thunder on Sunday night.\n\n\"I could see how much time was left,\" Wiggins said. \"I got as close as I could and let it go.\"\n\nCarmelo Anthony had hit a 3-pointer with about five seconds left to give the Thunder the lead. The Timberwolves were out of timeouts, so they had to scramble. Taj Gibson inbounded to Wiggins, who rushed up the court and got free with help from a crushing pick by Karl-Anthony Towns before pulling up for the winner.\n\n\"Everything worked perfectly,\" Wiggins said. \"Taj found me. KAT had a great screen. When it left my hands, the release felt amazing.\"\n\nGibson said the Timberwolves practice those kinds of plays regularly.\n\n\"We practice it six times in practice every day,\" Gibson said. \"Once I got the ball, my job is to take the ball out, be patient, look for the open man, look for the guy running the baseline. I was trying to get Jeff (Teague), but Wig was wide open. KAT did what he was supposed to do, backscreen, and the rest is history.\"\n\nThunder forward Paul George got knocked down on Towns' screen, and it freed up Wiggins.\n\n\"I did see Paul go down, but I didn't have a great look to see how he went down and why,\" Thunder coach Billy Donovan said. \"If it was an illegal screen, the officials will deal with that stuff. For me it's about focusing on our team and what we have to do and what we could have done differently.\"\n\nWiggins scored 27 points and Towns had 27 points and 12 rebounds for Minnesota (2-1).\n\nRussell Westbrook scored 15 of his 31 points in the fourth quarter for the Thunder (1-2), who were coming off a loss at Utah on Saturday night. Anthony scored 23 points and Steven Adams had 17 points and 13 rebounds.\n\nMinnesota led 61-54 at halftime behind 13 points from Towns and 10 from Wiggins. Adams scored 14 points before the break. The Timberwolves fought off several bursts by the Thunder and led 88-75 at the end of the third quarter.\n\nThe Thunder opened the fourth quarter with a five-point run that led to a Minnesota timeout. Oklahoma City continued the surge and got the crowd back into the game. A three-point play by Anthony cut Minnesota's lead to 90-87 as Westbrook returned to the game from a rest.\n\nAdams converted a three-point play to cut Minnesota's lead to 106-105 with 1:50 to go, and a 3-pointer by Westbrook tied the game at 110.\n\nMinnesota hung tough, and Wiggins bailed out the Timberwolves.\n\n\"You take them any way you can get them,\" Minnesota coach Tom Thibodeau said. \"Great shot by a great player.\"\n\n---\n\nTIP-INS\n\nTimberwolves: Gibson, who started for the Thunder at the end of last season, had 11 points and 10 rebounds. ... Shot 57 percent in the first quarter to lead 28-23. ... Minnesota beat Utah at home on Friday. ... Jeff Teague scored 19 points and Jimmy Butler added 15.\n\nThunder: Adams had eight points on 4-for-5 shooting in the first quarter. ... Raymond Felton and Jerami Grant each scored 12 points.\n\nQUOTABLE\n\nTowns on Wiggins' shot and the final sequence: \"Wig is amazing. He's been hitting that shot, weirdly enough, the whole offseason in practice. The one thing that came through my mind if I didn't catch it was to set a screen for somebody and just try to get someone one. I'm glad Wig was able to capitalize on it. We were able to escape with a win, especially with me not playing as well as I like to.\"\n\nGEORGE'S STRUGGLES\n\nGeorge has made just 23 of 62 shots this season. He scored 14 points on 6-for-20 shooting against the Timberwolves.\n\n\"I thought Paul got some really good looks, and it was just one of those nights where the ball didn't go in, but he impacted the game other ways defensively,\" Donovan said. \"I'm not worried about him shooting because he's such an elite shooter.\"\n\nUP NEXT:\n\nTimberwolves: Host the Indiana Pacers on Tuesday.\n\nThunder: George will play against the team he was traded from on Wednesday when the Thunder host the Indiana Pacers.\n\n---\n\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP .\n\n---\n\nMore AP NBA coverage: https://apnews.com/tag/NBAbasketball .",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.107396",
  "pipeline_version": "v1"
}