{
  "game_id": "0021301117",
  "espn_id": "400489990",
  "date": "Apr 02, 2014",
  "matchup": "CHA @ PHI",
  "headline": "Jefferson leads Bobcats past 76ers, 123-93",
  "cleaned_body": "PHILADELPHIA --  Al Jefferson tried to explain how hitting his jumper forces defenses to change their approach.\n\n\"It keeps them on their toes, in my opinion,\" Jefferson said before being cut off.\n\n\"It don't change nothing,\" reserve Jannero Pargo chimed in from two lockers down, \"he ain't going to pass the ball.\"\n\nMuch like his first-half shooting, Jefferson's retort was nearly flawless.\n\n\"Well if I pass it to you, I'll get a turnover, because you'll be on the bench,\" he said.\n\nWith a one-liner about as sharp as his stat line, Jefferson had his Bobcats teammates howling. Jefferson had every reason to feel loose, with 25 points and 10 rebounds in Charlotte's 123-93 win over the Philadelphia 76ers on Wednesday night.\n\n\"This is all the time,\" a smiling Jefferson said of the locker room banter.\n\nSo are the big wins lately for Charlotte.\n\nPerhaps Charlotte is getting hot at the right time, winning by 30-plus points for the second time in six games.\n\n\"Let's hope there's a couple more,\" coach Steve Clifford said.\n\nGary Neal scored 15 points to help the Bobcats inch closer to a playoff berth.\n\nThe Bobcats (37-38) have the seventh-best record in the Eastern Conference. They are 4 1/2 games ahead of the eighth-place New York Knicks and need three wins in the final seven games to clinch their first playoff berth since 2010.\n\nThe Bobcats are counting on Jefferson to carry them deep into April -- and possibly beyond.\n\n\"It falls a lot on me,\" Jefferson said. \"I've only been twice (to the playoffs), but twice is more than a lot of the other guys have been.\"\n\nThe Bobcats raced to a 13-point lead in the first quarter, stretched it to 35 and never once let the Sixers threaten.\n\nMichael Carter-Williams scored 22 points on 10-of-18 shooting for the Sixers, who have lost two straight since snapping an NBA-record tying 26-game losing streak on Saturday.\n\nThe Bobcats set the tone in the first quarter en route to putting away the lowly Sixers. Led by Jefferson, the Bobcats made 11 of their first 15 shots and finished with nine assists on 12 baskets.\n\nJefferson picked up where he left off in March, when he was named Eastern Conference player of the month. He averaged 24.7 points on 56 percent shooting (178-321), 10.6 rebounds and 2.2 assists. He was the first Bobcat to ever win the award.\n\nHe kept his sharp shooting rolling in the first game of April with a 13-point first quarter.\n\n\"It's important to set a tone that you're going to play through him early in the game,\" Clifford said.\n\nJefferson finished 9 of 17 from the floor and made 7 of 10 free throws. He has 20-plus points and 10-plus boards in the same game 23 times this season.\n\nEven in a season that has them with the second-worst record in the NBA, this was as bad as the Sixers have played in weeks. Trailing by 13, the Sixers had five turnovers and only four baskets. They missed all seven 3-point attempts in the first half and finished 4 of 18 overall. The Sixers had two starters go scoreless in the half.\n\n\"They beat us up pretty bad,\" Carter-Williams said.\n\nCharlotte, one of the few teams to lose to the Sixers this season, broke the game open with a 22-8 run in the second. Anthony Tolliver, who scored 16 points, hit a pair of 3s during the spurt and the Bobcats cruised from there.\n\n\"That's a team getting ready for the playoffs,\" Sixers guard Tony Wroten said. \"You can tell a big difference.\"\n\nThe Bobcats continued doing the big things that have them within striking distance of Washington for sixth place. They had only nine turnovers (average a league-low 12.3), outrebounded the Sixers 47-32 and had three bench players score double digits.\n\nGame notes Charlotte F Josh McRoberts (left ankle) sat out. Cody Zeller scored nine points in his first career start. ... 76ers coach Brett Brown again said that injured rookie F Nerlens Noel likely will not play at all this season. \"There's so much to weigh out if we're smart with this, and we will be,\" he said. ... The Bobcats finished one-point shy of matching their season-high point total.",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.786999",
  "pipeline_version": "v1"
}