{
  "game_id": "0021700523",
  "espn_id": "400975269",
  "date": "Dec 29, 2017",
  "matchup": "MIA vs. BKN",
  "headline": "Nets embarrass Heat, leading by 38 before winning 111-87",
  "cleaned_body": "MIAMI --  Brooklyn took out two years of frustration on Miami, and did it in the span of about two quarters.\n\nJoe Harris scored a career-high 21 points, Rondae Hollis-Jefferson added 18 and Brooklyn simply embarrassed Miami 111-87 on Friday night, matching the biggest win any Nets team ever enjoyed over the Heat.\n\nThe final score hardly showed how bad it was for Miami. The Heat led 18-8 early, then were outscored 85-37 over the next 28 minutes. Brooklyn led by 20 at the half, then pushed the margin to 38 late in the third and beat Miami for the first time since Dec. 28, 2015.\n\n\"Great job by the guys being ready,\" Brooklyn coach Kenny Atkinson said. \"Even at halftime you knew the Heat were going to come out with a lot of energy and we responded again. We didn't have a bad quarter defensively.\"\n\nCaris LeVert and Jarrett Allen each had 12 points for the Nets. LeVert added a career-best 11 assists.\n\n\"I'm speechless about it,\" Heat coach Erik Spoelstra said. \"I don't know. We will keep on fighting and digging until we figure it out. I can guarantee you that. ... We have a Dr. Jekyll and Mr. Hyde quality to us that's extremely perplexing. Sometimes we compete at an extremely high level. You can see it, you can feel it. And then we have these games that are unexplainable.\"\n\nJosh Richardson scored 19 points and Hassan Whiteside added 17 for Miami. The Heat shot 3 for 26 from 3-point range, and 34 percent from the field overall -- the team's second-worst rate at home in the last 10 years.\n\n\"We've got to be better,\" Richardson said.\n\nThe Heat started on an 8-0 run. That ended their list of achievements for the evening.\n\nBrooklyn scored 13 unanswered points, grabbed the lead by the end of the first quarter and never relented.\n\n\"We weren't perfect but we were more perfect than the other night,\" Atkinson said, referring to Brooklyn's Wednesday loss at New Orleans. \"The challenge for us is to do it more consistently. That's what we're searching for.\"\n\nIt was the fifth time this season the Heat trailed by as many as 30 in a game -- none of the previous margins as big as the 38-pointer the Nets enjoyed in this one.\n\nSpoelstra angrily called a timeout in the first quarter when Quincy Acy was left all alone for a 3-pointer, one that cut Miami's lead to 18-15. Even then, he could see trouble ahead.\n\n\"That possession was a microcosm of the entire game,\" Spoelstra said. \"The lack of urgency to get back, to scramble, to make a multiple effort. There's an open guy, let him shoot. And then those plays just piled up from there.\"\n\nTIP-INS\n\nNets: Brooklyn beat Miami for the first time in the teams' last seven meetings. ... The largest margin of victory in Nets franchise history at Miami, before Friday, was 22 -- in 1991. ... Harris is the eighth Nets player to have a 20-point game off the bench this season. ... The Nets shot 49 percent, and finished with seven players in double figures. They also outrebounded Miami 54-43.\n\nHeat: Miami missed a chance to move three games over .500 for the first time since the end of the 2015-16 season. The last time the Heat were three games over without Dwyane Wade on the roster was April 18, 2001. ... Spoelstra got a technical for arguing with 1:11 left in the third, and his team down by 37. ... Miami played 41 home games in 2017, going 27-14.\n\nNETS HISTORY\n\nThe Nets led by 35 points after three quarters, matching the franchise record for margin in a road game after 36 minutes. The other time it happened was March 13, 1993, when New Jersey was up 104-69 going into the fourth at Phoenix.\n\nHEAT INJURIES\n\nMiami was again without Justise Winslow, James Johnson, Dion Waiters, Rodney McGruder and Okaro White, all injured. The Heat expect them to all miss Saturday's game in Orlando as well.\n\nUP NEXT\n\nNets: Visit Boston on Sunday, ending a five-game trip.\n\nHeat: Visit Orlando on Saturday, their final game of 2017.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.517996",
  "pipeline_version": "v1"
}