{
  "game_id": "0021201203",
  "espn_id": "400278923",
  "date": "Apr 15, 2013",
  "matchup": "CHI @ ORL",
  "headline": "Carlos Boozer, Bulls beat Magic to end 2-game skid",
  "cleaned_body": "ORLANDO, Fla. --  The fifth seed in the Eastern Conference playoffs is still within the Chicago Bulls' sights.\n\nCarlos Boozer scored 22 points, Luol Deng added 18 and the Chicago Bulls snapped a two-game losing streak with a 102-84 victory over the Orlando Magic on Monday night.\n\nNow with just one game left on their regular-season slate, the Bulls still can catch Atlanta for the fifth seed in the Eastern Conference. They need the Hawks to either split or lose their final two games to move from sixth up to fifth.\n\nIt would be a small victory at the end of a tough year, but is an opportunity they don't want to take for granted, either.\n\n\"We've got one more, and then it really starts,\" center Joakim Noah said. \"I'm just happy that my foot held up. ... I think we're a pretty deep team. We just need to play together and get our chemistry right. The last game is important.\n\n\"It's that time of year, so it's exciting.\"\n\nTobias Harris led Orlando with 20 points, followed by Nik Vucevic with 17 points and 14 rebounds. Maurice Harkless also chipped in 16 points.\n\nThe Magic finish just 12-29 at home, their fewest victories in Orlando since they were 11-30 during the 2003-04 season. Orlando wraps up its schedule Wednesday in Miami. Charlotte beat New York on Monday night, leaving the Bobcats tied with the Magic for the league's worst record.\n\n\"It shows us how much better we have to get, how much harder we have to play,\" Harkless said. \"You know we're a young team. We've got to learn how tough it is playing against these playoff teams. Hopefully in the future we'll be a playoff team.\"\n\nThough he's shrugged off questions lately about his team's playoff preparations, Bulls coach Tom Thibodeau did manage to get both Noah and Taj Gibson some work Monday after each had played sparingly down the stretch.\n\nNeither started the game, but Noah (right foot) was back on the court for just the second time in 14 games and Gibson (left knee) played for the first time in eight games.\n\nRichard Hamilton also returned to action after serving a one-game suspension for hitting Toronto's DeMar DeRozan with an elbow last week.\n\n\"You have to make the best of whatever your circumstances are,\" Thibodeau said. \"Having so many guys out, and then some guys resting down the stretch, gave our guys an opportunity to grow.\"\n\nThe Bulls started slow but outscored the Magic 28-14 in the second quarter to take a 12-point edge into the break.\n\nDeng and Boozer did most of the early offensive lifting, combining for 26 points in the half.\n\n\"We're a team that has people on this team for certain reasons and that's why our team works,\" Boozer said. \"It's like having a car that's missing a couple of pieces. It ain't going to run as smooth. But once we've got everybody back out there, once you've got the parts on the car, it runs pretty good.\"\n\nThe Magic had just three turnovers in the first quarter. They gave it away six times in the second quarter, leading to 10 Chicago points.\n\nChicago maintained its momentum as the lead quickly ballooned above 20 in the opening minutes of the third quarter. Orlando tried to make a few pushes, but never really threatened in the final 12 minutes.\n\nFor the night, the Magic tallied just 16 assists on their 31 field goals.\n\nMagic coach Jacque Vaughn said down year or not, he doesn't expect his team to be down entering Wednesday's finale.\n\n\"Just the same approach that we've had the entire year really, of going into the game and doing the best we can,\" he said. \"We're going to Miami and we're going to try to get a win.\"\n\nWhether Derrick Rose makes a surprise return for the postseason is still to be determined. For now, though, all the focus is on improving the pieces the Bulls know they will have available.\n\n\"We've got a ways to go, but we're fighters and we're excited for the challenge,\" Noah said.\n\nGame notes Vucevic's double-double was his 45th of the season. ... Having spent time in Boston during his stint as a Celtics assistant, Thibodeau said it made Monday's events tough to watch from afar now. \"There's so much going on and the entire meaning of that day -- it's so festive. It's unfathomable just to think about something like that happening there,\" he said. \"It's just a terrible day. Terrible.\"... Thibodeau said a lack of recent practice time for his team hasn't slowed down Rose's rehab schedule. \"That's the important thing and he's going to continue to do so,\" he said. \"So if we're not practicing, he's still doing all his rehab stuff and he's working each and every day.\"",
  "tags_rule": [
    "DoubleDouble",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.794471",
  "pipeline_version": "v1"
}