{
  "game_id": "0021700016",
  "espn_id": "400974442",
  "date": "Oct 19, 2017",
  "matchup": "LAL vs. LAC",
  "headline": "Deflated Ball: Blake gets 29 in Clips' 108-92 rout of Lakers",
  "cleaned_body": "LOS ANGELES -- Patrick Beverley crowded chest-to-chest with Lonzo Ball before an inbounds pass in the first quarter while they were 94 feet from the basket. Moments later at midcourt, Beverley emphatically fouled the Lakers' rookie point guard and watched him fall.\nBall still might turn out to be Los Angeles' basketball star of the future, even after his awfully quiet NBA debut.\nThe present in this town still belongs to the Clippers, even without Chris Paul.\nBlake Griffin scored 29 points and DeAndre Jordan added 14 points and 24 rebounds in the Clippers' 108-92 rout of the Lakers on Thursday night.\nLou Williams added 12 points in the Clippers' first game since Paul spurned the perennial playoff team after six years and forced an offseason trade to Houston. The Clippers will have a new look this season after adding Beverley's tenacity and several new scorers, but they were still miles ahead of their Staples Center co-tenants in both teams' season openers.\nBeverley and the Clippers got little trouble from Ball, who had three points, four assists and nine rebounds in 29 minutes during the first game for the No. 2 overall pick from UCLA. He had about 40 friends and family members in the stands, including his voluble father, LaVar.\n\"We got blown out, so I didn't play too well,\" Ball said. \"It was great to start out, but all I care about is winning, and we lost today. We've got to regroup.\"\nBall is expected to revitalize his hometown team this season, but the rookie started out with all the nerves and mistakes that might be expected from any 19-year-old with the weight of a 16-time NBA champion franchise on his slender shoulders.\nBeverley, who joined the Clippers in Paul's trade to the Rockets, had 10 points while introducing Ball to high-level NBA defense.\n\"I just had to set the tone,\" Beverley said. \"I told him after the game, due to all the riff-raff his dad brings, he's going to get a lot of people coming at him. He has to be ready for that, and I let him know after the game. But what a better way to start him off. I was 94 feet guarding him tonight. Welcome his little young ass to the NBA.\"\nAlong with a handful of good-looking passes and a 3-pointer late in the first half, Ball went 1 for 6 from the field and committed two turnovers.\n\"He's going to be a great talent, but he has to go through the tough times,\" Beverley said. \"He'll appreciate this when he looks back on it.\"\nBrook Lopez scored 20 points in his debut for the Lakers, and Jordan Clarkson added 18.\n\"I wasn't happy with what we gave our fans tonight,\" Lakers coach Luke Walton said. \"Obviously I heard the (boos), and we deserved it at those times.\"\nTIP-INS\nClippers: Danilo Gallinari had 11 points in his LA debut. ... Coach Doc Rivers answered back at Paul, who said he didn't like the Clippers' team culture in a documentary that will be released this week by ESPN. \"Listen, when you leave, you should just leave,\" Rivers said. \"I don't think you have to try to burn the house down or justify why you left. That's what I would say to it. I like our culture.\nLakers: New G Kentavious Caldwell-Pope missed this game while beginning a two-game suspension for getting arrested in March and later pleading guilty to operating a motor vehicle while intoxicated. ... Kyle Kuzma, the Lakers' other first-round pick, had eight points in his NBA debut. ... Andrew Bogut, the former Golden State center, had three fouls and three turnovers in his Lakers debut.\nNEW BACKCOURT\nEven with several new contributors, the Clippers already resemble a hard-nosed, tough-minded veteran team led by Beverley. Milos Teodosic, the other starting guard in Rivers' revamped lineup, hit two 3-pointers in the 30-year-old Serbian rookie's NBA debut.\nMAGIC BALL\nIt was a busy night for Lakers executive Magic Johnson, also a co-owner of the Los Angeles Dodgers. Magic watched from the tunnel while Staples Center showed Game 5 of the NL Championship Series on the scoreboard during pregame warmups, and he celebrated behind the scenes when the Dodgers clinched their first World Series berth since 1988 during the first half. \"I'm just happy for all the players and all the Dodger fans across the world,\" Johnson said. \"This is a moment that I'll never forget. I was torn, because I wanted to be here for Lonzo Ball's first game as a Laker, but my heart is in Chicago. ... I'm so happy with Clayton Kershaw, that he can finally pitch in the World Series. He deserves this moment, and all our players deserve this moment, too.\" Staples Center erupted in cheers when the Dodgers recorded the final out in Chicago, and again when the final out appeared on the video board.\nUP NEXT\nClippers: Host Suns on Saturday.\nLakers: At Suns on Friday.\n---\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.080725",
  "pipeline_version": "v1"
}