{
  "game_id": "0021700499",
  "espn_id": "400975245",
  "date": "Dec 26, 2017",
  "matchup": "TOR @ DAL",
  "headline": "Barea, Mavs end another Raptors 6-game streak with 98-93 win",
  "cleaned_body": "DALLAS --  J.J. Barea has fresh memories of San Antonio scoring the final 13 points in a recent Dallas loss, and Atlanta getting the last five with the score tied in the Mavericks' most recent game.\n\nThe diminutive guard was happy to have a key role in a different ending for the last-place team in the Western Conference.\n\nBarea scored 20 points, including a clinching layup in the final seconds, and the Mavericks ended another six-game winning streak by the Toronto Raptors with a 98-93 victory on Tuesday night.\n\nThe Mavericks held DeMar DeRozan and the Raptors to season lows in shooting percentage as Toronto lost for just the second time in 14 games, with each loss coming after six straight wins.\n\n\"I was thinking about our problems closing out, last three minutes, I was like, (hoping) it doesn't happen again,\" said Barea, who tied the team high with four assists. \"Something we've got to learn. We've got to do a better job of getting some important buckets at the end.\"\n\nDirk Nowitzki scored 18 points and fellow German Maxi Kleber had 15 points and matched his rookie season bests with five blocks and eight rebounds. Harrison Barnes had 16 points and 10 boards.\n\nKyle Lowry led Toronto with 23 points but didn't score in the fourth quarter, while DeRozan couldn't get going at all after averaging 37 points on a three-game road winning streak that ended.\n\nHounded by Dallas defensive specialist Wesley Matthews most of the game, DeRozan scored eight points while shooting 19 percent (3 of 16). His previous low was 20 percent (1 of 5) in his only other single-digit game this season -- two points in a 112-78 win at Atlanta in November.\n\n\"A lot of shots I took that were in the paint, normally shots that I make,\" said DeRozan, who averaged 32 points during the most recent six-game winning streak. \"Missed a lot of floaters, easy things. One of them nights.\"\n\nThe teams combined to make just five of 31 shots in the final 8 minutes -- including two misses by Serge Ibaka with the Raptors trailing by three before Barea hit a layup with 10 seconds left after dribbling out most of the shot clock.\n\nThe Raptors (23-9) came into the game with the best winning percentage in the Eastern Conference but shot under 40 percent for the first time this season.\n\nJonas Valanciunas had 17 points and 11 rebounds for Toronto, and Ibaka added 12 points and 12 boards.\n\nBarea scored the first six points and hit a capping 3-pointer on a 17-0 run that put the Mavericks in front 83-73 late in the third quarter.\n\nTIP-INS\n\nRaptors: G/F C.J. Miles, a former Dallas high school player, hit a 3 in 10 minutes after missing three games because of a dental procedure. ... Coach Dwane Casey said C Lucas Nogueira was available after missing 11 games with a right calf injury, but he didn't play.\n\nMavericks: Nowitzki, in his 20th season, has at least 18 points in five of the past seven games after scoring that many just twice in his first 28 games. ... Barnes tied his career high with his sixth double-double. He did in Golden State's championship season of 2014-15.\n\nDEFENSIVE FOCUS\n\nDeRozan played 35 minutes to Matthews' 36. And wherever DeRozan went, Matthews followed. The results showed offensively for Dallas' defensive specialist. He was 2 of 9 from the field for five points. \"He has an iron will to make it as hard as possible on these great players,\" coach Rick Carlisle said. \"He expended so much energy defensively, his shooting was out of rhythm. That's going to happen.\"\n\nUGLY QUARTER\n\nThe fourth quarter score was 16-13, Toronto. Both teams shot 26 percent in the quarter (5 of 19 for the Raptors, 6 of 23 for the Mavericks). Barea (3 of 5) was the only player with more than one field goal. The teams were a combined 3 of 17 on 3-pointers.\n\nTHE OTHER GERMAN\n\nKleber, also from Nowitzki's hometown of Wurzburg, Germany, matched Barnes for the team high with 13 points in the first half. It was capped by an alley-oop dunk when Yogi Ferrell grabbed a defensive rebound with 6 seconds left, raced the length of the court and tossed it to Kleber for the slam with a couple of seconds to spare.\n\nGERMAN BLOCKADE\n\nKleber (four blocks) and Nowitzki (three) combined for seven blocks in the first half. It was already a season high for Nowitzki, and Kleber matched his season best early in the third quarter. The Mavericks had a season-high 11 blocks.\n\nUP NEXT\n\nRaptors: Second night of back-to-back at Oklahoma City on Wednesday.\n\nMavericks: Also on back-to-back at Indiana on Wednesday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "PlayoffContext",
    "Streak",
    "CoachComment",
    "CareerHigh",
    "InjuryReport",
    "ClutchShot"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.333437",
  "pipeline_version": "v1"
}