{
  "game_id": "0021700577",
  "espn_id": "400975323",
  "date": "Jan 05, 2018",
  "matchup": "LAL vs. CHA",
  "headline": "Kemba gets 19 in Hornets' 108-94 rout of slumping Lakers",
  "cleaned_body": "LOS ANGELES --  With three wins in four stops on a leisurely paced road trip, the Charlotte Hornets unexpectedly hit their stride in California.\n\nThe Los Angeles Lakers are still stumbling around.\n\nKemba Walker had 19 points and seven assists, and the Hornets wrapped up a solid trip with their first back-to-back victories since Thanksgiving, beating the spiraling Lakers 108-94 on Friday night.\n\nJeremy Lamb scored 17 points and Marvin Williams added 16 for the Hornets, who won three of four in the Golden State, including a shocking win over the Warriors to kick off the trip. The Hornets wrapped up the road swing by emphatically avenging their home loss to the Lakers last month.\n\n\"We'll take it all day long,\" associate head coach Stephen Silas said. \"It was a great trip.\"\n\nSix players scored in double figures for Charlotte, which has won four of six overall.\n\nDwight Howard had 15 points and 10 rebounds while the Hornets had little trouble staying ahead of the Lakers after the opening minutes. Charlotte took a 16-point lead in the first half and stretched it to 21 in the third quarter.\n\n\"It means a lot, because we've really been struggling on the road before this trip,\" said Silas, whose team lost 12 of its first 16 road games this season. \"To come on the road and get three wins, especially in the West, it's really big for us. Hopefully we can carry home the momentum from this trip.\"\n\nLonzo Ball had 11 points and five assists in his first game since Dec. 23 for the Lakers, who have lost nine straight since Dec. 20. The rookie point guard missed six games with a sprained left shoulder, and he returned in limited minutes while rebuilding his strength.\n\nThe Lakers' faithful fans are even growing frustrated in what looks like a fifth consecutive losing season. They booed the Lakers after Lamb's uncontested alley-oop dunk on a fast break put the Hornets up by 25 early in the fourth quarter.\n\n\"They got hot and really never stopped making shots,\" Brandon Ingram said. \"Eventually you get tired of losing. I think a lot of guys on this team are used to winning.\"\n\nIngram had 22 points and a career-high 14 rebounds, but Los Angeles dropped to 1-12 since winning at Charlotte on Dec. 9. The Lakers (11-27) are in last place in the Western Conference.\n\n\"Early in the year, if we had off shooting nights like we've had a lot of, we were still right in ballgames because we were defending our tails off,\" Lakers coach Luke Walton said. \"The biggest thing we need to get back to is playing defense like that. We're going to get back to being a good defensive team, no matter what it takes.\"\n\nTIP-INS\n\nHornets: Frank Kaminsky scored 12 points. He also got a technical foul in the fourth quarter for arguing a call. ... Michael Kidd-Gilchrist added 13 points and eight rebounds.\n\nLakers: Brook Lopez scored 11 points in his second game back from an eight-game absence with a sprained ankle. ... Jennifer Lopez and Alex Rodriguez watched the game at courtside, as did comedian John Mulaney.\n\nGETTING SHOTS\n\nThe Lakers are the NBA's worst 3-point shooting team, and they went 9 for 36 against the Hornets. At least they improved the NBA's worst free-throw shooting percentage by going 9 for 12.\n\nHI DWIGHT\n\nHoward received the thunderous boos that have greeted him at Staples Center ever since he completed his single season with the Lakers in 2013 by spurning them to sign a free-agent deal with the Rockets. The Lakers haven't made the playoffs since he left, enduring the worst half-decade in franchise history. \"I don't think about it,\" Howard said. \"At some point, they get over it. ... I had a good time. I thought I played very well, despite just coming off of back surgery and also tearing a labrum, which I guess means nothing to people. Other than that, it's always fun to come here and play in LA.\"\n\nUP NEXT\n\nHornets: Host the Dallas Mavericks on Wednesday in their first home game of 2018.\n\nLakers: Host the Atlanta Hawks on Sunday night in a meeting of the NBA's two worst teams.\n\n---\n\nMore AP NBA: www.apnews.com/tags/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "PhysicalGame",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.754123",
  "pipeline_version": "v1"
}