{
  "game_id": "0021300825",
  "espn_id": "400489698",
  "date": "Feb 22, 2014",
  "matchup": "MEM @ CHA",
  "headline": "Bobcats win 4th straight for longest win streak since 2011",
  "cleaned_body": "CHARLOTTE, N.C. -- The Charlotte Bobcats have relied heavily on Al Jefferson to put them in the thick of the Eastern Conference playoff race.\nOn Saturday night, they proved they could win without their veteran center having a big night.\n\"It shows that we have other guys that can step up,\" point guard Kemba Walker said.\nWith Jefferson double-teamed most of the night, Walker elevated his game, pouring in 31 points to help the Bobcats defeat the Memphis Grizzlies 92-89 for their fourth win in five nights.\nCharlotte is 4-0 since the All-Star break, marking its longest winning streak since March 2011.\nThe Bobcats won despite Jefferson being held to just six points -- tying a season-low -- on 2-of-13 shooting. Jefferson came in having scored 29 or more points in eight of his last 11 games and at least 20 points in 17 of the last 19.\nThe Bobcats used an 18-3 run in the fourth quarter to break open a tight game and then held on down the stretch with Walker making four free throws in the final 25 seconds to snap Memphis' four-game win streak. It was the second straight night Walker hit four free throws in the final 30 seconds to seal a victory.\n\"I shoot so many free throws in practice I'm just thinking, 'Hey, make them,' \" said Walker, who was 10 of 10 from the foul line.\nCharlotte had lost the second night of a back-to-back eight straight times before winning two this week.\n\"To win four in a row against good teams and to play this well in a game like that that was hard fought, you have to feel good about it,\" Bobcats coach Steve Clifford said.\nBut now the Bobcats face a four-game stretch against the NBA's four best teams -- San Antonio, Oklahoma City, Miami and Indiana -- with the first three games on the road.\nThe Grizzlies were led by Mike Conley, who had 16 points, but twice missed 3-point attempts when he had a chance to tie the game on Memphis' final possession.\nMarc Gasol had 15 points, and Zach Randolph had 12 points and 11 rebounds for Memphis, which fell two games behind Dallas in the race for the eighth and final playoff spot in the Western Conference.\nThe Bobcats trailed 66-64 early in the fourth quarter when Anthony Tolliver got hot from the outside, igniting an 18-3 run with three 3-pointers to give Charlotte a 13-point lead. Tolliver finished with nine points.\nThe Grizzlies battled back to take the lead when Conley knocked down an 18-footer with 51 seconds left.\nBut Josh McRoberts sank two free throws to put the Bobcats ahead for good with 38 seconds left.\nConley missed a jumper on the other end and then fouled Walker as he was heading up the court. Walker made two free throws to push the lead to three with 24 seconds left.\nGasol answered with an inside layup, but Walker hit two more free throws with 10.7 seconds left to push the lead back to three. Conley had two open looks in the final 6 seconds, but couldn't connect.\n\"We wanted to win, but the Charlotte Bobcats were the aggressors,\" Memphis guard Tony Allen said. \"They were physical. Coach told us before the game that their talent doesn't jump out at you, but what does is just how hard they play. There's no excuse because they were the aggressors and they pretty much outworked us tonight.\"\nThe Grizzlies' game plan was to make sure Jefferson didn't beat them, aggressively double-teaming the 6-foot-10, 289-pound center every time he touched the ball in the low post.\nThey limited Jefferson to four points on 1-of-6 shooting in the first half and held Charlotte to 39 percent shooting to build a 48-42 halftime lead.\n\"He's shooting it up and they're going to him a lot,\" Grizzlies coach Dave Joerger said. \"We just kept staying in front of him and making his shots tough.\"\nJefferson picked up his third foul with 2:52 left in the first half -- a call that didn't sit well with Clifford, who was slapped with a technical foul for arguing. It was his seventh technical foul of the season.\nGame notes\nAtlanta Falcons running back Steven Jackson and former Carolina Panthers wide receiver Muhsin Muhammad were at the game. ... Memphis had won 16 of its last 20 games coming into Saturday night and three straight against the Bobcats. ... Memphis is 6-5 this season on the second night of a back-to-back.",
  "tags_rule": [
    "Streak",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.643803",
  "pipeline_version": "v1"
}