{
  "game_id": "0021300058",
  "espn_id": "400488931",
  "date": "Nov 05, 2013",
  "matchup": "POR vs. HOU",
  "headline": "James Harden, Dwight Howard lead Rockets to bounce-back win",
  "cleaned_body": "PORTLAND, Ore. -- Houston's All-Star tandem of James Harden and Dwight Howard refused to let the Rockets give in to fatigue.\nHarden scored 33 points, Howard added 29 points and 13 rebounds, and the Rockets beat the Portland Trail Blazers 116-101 on Tuesday night despite playing for the fourth time in five days.\nHouston (4-1) bounced back from getting routed by the Clippers 137-118 on Monday night in Howard's first trip back to Staples Center since leaving the Lakers during the summer.\n\"We got in at 3 a.m. last night,\" Houston coach Kevin McHale said. \"That was a tough one but we got a big win here tonight. James and Dwight had tremendous games.\"\nDamian Lillard scored 22 points and LaMarcus Aldridge added 21 to lead the Blazers, who fell after winning two in a row. Wesley Matthews added 19 points.\nJeremy Lin and reserve Patrick Beverley each had 12 points for the Rockets.\nHoward, the seven-time All-Star, has teamed up with Harden to give Houston one of the most talented duos in the NBA. Harden, who averaged 25.9 points per game last season, recovered from a poor shooting performance against the Clippers, hitting 11 of 18 from the field and 9 of 10 from the free throw line.\nHoward was dominant under the basket as Houston outscored Portland 54-28 in the paint and outrebounded the Blazers 47-30. With center Robin Lopez sitting in foul trouble and backup Joel Freeland out with a hip injury, the Blazers couldn't defend the rim.\n\"Dwight makes the whole game so much easier for each teammate,\" Harden said. \"He draws double-teams. He's a great passer. He dominates the post and he can score it. He does everything.\"\nThe Blazers shot better than 55 percent and had six players score in double figures in a 115-105 victory over San Antonio on Saturday but shot only 41 percent from the field Tuesday and 65 percent from the line.\n\"We had a hard time getting shots to fall, and when that's going to happen, we've got to do better defensively,\" Lillard said.\nHouston led 55-50 at the half and then went on a 15-2 run to start the second half. The Rockets led by as many as 18 points before Portland started chipping away at the lead, getting to 93-88 on a jumper by Mo Williams. However, Beverley hit a 3-pointer and Harden converted a three-point play to push the lead back to double figures.\n\"They are a type of team that can put runs on you,\" Portland coach Terry Stotts said. \"They put up points quickly.\"\nPortland started the game strong and led 19-10 before the Rockets put together a 19-4 run, with Howard and Harden each contributing eight straight points.\nGame notes\nHoward will face the Lakers on Thursday, when the Rockets host his former team at the Houston Toyota Center. ... Beverley returned after missing three games with a torn muscle in his stomach. ... Lopez finished with no points, six rebounds and five fouls in 18 minutes. ... The teams split the series last season, with each winning one at home and away. However, the Rockets have won five of their past six in Portland.",
  "tags_rule": [
    "InjuryReport",
    "FoulTrouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.595267",
  "pipeline_version": "v1"
}