{
  "game_id": "0021700343",
  "espn_id": "400975094",
  "date": "Dec 04, 2017",
  "matchup": "MIL @ BOS",
  "headline": "Irving' 32 helps Celtics hold off Greek Freak, Bucks 111-100",
  "cleaned_body": "BOSTON --  Kyrie Irving has long admired Al Horford's skillset from afar. He's now getting to really savor all the advantages that come along with being his teammate.\n\nIrving had 19 of his 32 points in the second half, helping offset a 40-point night by Giannis Antetokounmpo as the Boston Celtics held off the Milwaukee Bucks 111-100 on Monday night.\n\nAl Horford added 20 points, nine rebounds and eight assists. Jayson Tatum chipped in 17 points to help Boston improve to an NBA-best 21-4. The Celtics have won five of their last six.\n\n\"We're just utilizing our strength's -- me realizing that he can use me and I can use him,\" Irving said. \"When we utilize each other, we can get other guys great shots.\"\n\nThe Celtics shot 50 percent or better from the field for the fifth straight game. That's their longest such streak since 2010.\n\n\"I think it's just the work I've been putting in. It's starting to pay off for me,\" Horford said. \"I feel like we're starting to find our rhythm as a group, and I'm finding my rhythm, too.\"\n\nIt was the third 40-point game this season for Antetokounmpo. Khris Middleton added 19 points while Eric Bledsoe had 18 points.\n\n\"You have to compete against them because they don't stop playing hard,\" Antetokounmpo said. \"From start to finish they play hard and play together.\"\n\nBoston led by as many as 20 in the third quarter, before the Bucks stormed back, thanks in large part to Antetokounmpo. He almost singlehandedly kept the Bucks in it, scoring 16 points in the period and trimming Boston's lead to 88-81 entering the fourth.\n\nIt was 104-97 following a free-throw by Bledsoe, but the Celtics got five straight points from Irving to get the lead back up to 12 with less than a minute to play.\n\nAntetokounmpo and Middleton entered Monday as the most productive scoring duo in the Eastern Conference, averaging a combined 49 points per game.\n\nThey combined for 59 Wednesday. It offset some early inconsistency from the rest of their teammates, which went just 6 of 24 from the field in the first half.\n\nTIP-INS\n\nBucks: Bench was outscored 18-4 in the first half.\n\nCeltics: Are now 11-2 at TD Garden this season, the most home victories in the NBA. ... Outscored Milwaukee 60-34 in the paint. ... Tatum went 4 for 4 from the 3-point line in the first quarter. Boston shot 61 percent (11 of 18) from the field overall in the period.\n\nQUOTABLE\n\n\"I think his mannerisms are just one that you can't see if he's rattled or not. His composure is at a very high level to only be 19.\" -- Milwaukee coach Jason Kidd on Tatum.\n\nRUNNING TIME\n\nKidd was called for technical after jawing with an official at 4:44 in second quarter. It ignited an 8-0 Celtics run that pushed Boston's lead to 56-37. Irving had five points during the run.\n\nMASK OFF\n\nIrving said he could shed his protective facemask for Saturday's matchup with Utah. He has been wearing the mask since breaking a bone in his face on Nov. 10 against Charlotte.\n\nCENTURY CLUB\n\nThe Celtics improved to 16-2 when scoring 100 or more points.\n\nThe Bucks haven't been held under 100 points since a 99-88 loss to Washington on Nov. 20 -- a span of six games.\n\nUP NEXT\n\nBucks: Begin a three-game homestand Wednesday against Detroit.\n\nCeltics: Conclude five-game homestand Wednesday against Dallas.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball(backslash)\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "tags_rule": [],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.056841",
  "pipeline_version": "v1"
}