{
  "game_id": "0021401080",
  "espn_id": "400579372",
  "date": "Mar 27, 2015",
  "matchup": "LAL @ TOR",
  "headline": "Raptors beat Lakers, earn second straight Atlantic Division crown",
  "cleaned_body": "TORONTO -- Last season, the Toronto Raptors defied expectations to win the Atlantic Division.\nTaking the title again is just part of what they expect to achieve this time around.\nToronto won the Atlantic for the third time in its 20-year history by beating the Los Angeles Lakers 94-83 on Friday night behind 18 points from Lou Williams and 19 from Jonas Valanciunas.\n\"We had three goals,\" Raptors coach Dwane Casey said. \"One was to make the playoffs, two was to win the division, and three was to continue on and win into the playoffs.\"\nToronto, which clinched its seventh playoff berth Wednesday, has won just one round in six previous postseason appearances.\n\"It's a lot more that we need to do,\" DeMar DeRozan said, wearing a red T-shirt that said \"Atlantic Claimed\" above the Raptors logo. \"Get in the playoffs, win games in the playoffs, look forward, keep moving forward and not just think one game or one round.\"\nJames Johnson had 17 points, Amir Johnson 11 and Terrence Ross 10 as the Raptors snapped a two-game skid and beat the Lakers for the first time since Dec. 8, 2013.\nJeremy Lin scored 18 points and Jordan Clarkson had 14 for the Lakers, who were outscored 48-35 in the second half and lost for the 11th time in 14 games.\n\"They turned it up in the second half defensively,\" Lin said of the Raptors.\nA turnaround was the tale of Toronto's division title last season, when they started 6-12 but rebounded to go 42-22 after trading Rudy Gay to Sacramento.\nIt's been the opposite story this time, as the Raptors raced out to a 24-7 start and looked like a contender for the Eastern Conference crown. They have faded ever since, and a 7-13 record since All-Star Weekend has left Toronto battling to hold on to home-court advantage in the first round.\n\"Last year was so unexpected,\" DeRozan said. \"We never looked at it as 'We can win our division.' All the odds were against us. This time around, the start that we had ... we kind of were expected to win it. It's kind of different, but it still means a lot.\"\nDeRozan scored six points, making just one of his 10 field goal attempts and missing a dunk in the fourth quarter, but he had 10 rebounds and seven assists, both team highs.\nJames Johnson scored four points as Toronto put the game away with a 9-0 run midway through the fourth quarter. Johnson started the spurt with a fadeaway jumper, DeRozan and Williams added jump shots, and Tyler Hansbrough made one of two from the line before Johnson connected from the corner, putting Toronto up 87-72 with 5:17 remaining.\nHansbrough was later called for a flagrant foul 1 after he pulled Tarik Black down from behind as the two fought for a rebound. The two players exchanged a high five after the whistle.\nRaptors guard Kyle Lowry sat for the fourth time in five games with a sore back. Casey said there is no timetable for Lowry's return.\nToronto missed six straight shots during an 8-0 Lakers run in the opening quarter as Los Angeles built a 24-17 lead after one, boosted by 10 points from Lin. The Lakers also benefited from seven offensive rebounds in the first.\nValanciunas scored nine points in the second as Toronto closed the gap, but the Lakers held a 48-46 lead at halftime.\nHeld scoreless in the first half, Ross had 10 points in the third, including two of Toronto's four 3-pointers, as the Raptors took a 71-66 lead into the fourth. The Lakers missed 12 of 17 field goal attempts in the third.\nSHARING THE BALL\nToronto had 25 assists, the 10th time in 14 games this month they have had 20 or more. The Raptors are 32-14 this season when they finish with 20 or more assists. DeRozan has led the team in assists in four straight games.\nLOVE IN THE AIR\nA member of the Raptors cheerleading team accepted a marriage proposal from her boyfriend following a dance routine in the second quarter.\nTIP-INS\nLakers: Coach Byron Scott returned after missing the previous two games following his mother's death. ... Lin started despite having a respiratory infection. ... The Lakers have never lost the season series against the Raptors.\nRaptors: In its final night of 20th anniversary celebrations, Toronto paid tribute to former GM Isiah Thomas and the team's six founders. Thomas received a huge ovation when he and the other original owners were honored on the court during a second quarter timeout. \"It's great to come back and see this,\" Thomas said of Toronto's rise from expansion team to division champion playing in front of regular sellout crowds.\nUP NEXT\nLakers: Visit Nets on Sunday afternoon.\nRaptors: Host Rockets on Monday night.",
  "tags_rule": [
    "PhysicalGame",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.432360",
  "pipeline_version": "v1"
}