{
  "game_id": "0021400223",
  "espn_id": "400578515",
  "date": "Nov 28, 2014",
  "matchup": "CHI @ BOS",
  "headline": "Butler, Rose carry Bulls past Celtics 109-102",
  "cleaned_body": "BOSTON -- It's no secret that the Chicago Bulls are a much better team with a healthy Derrick Rose.\nHe showed that again on Friday afternoon when the Bulls were struggling to get consistent offense.\nRose scored 14 of his 21 points in the second half -- 12 coming early in the third quarter -- to help the Bulls pull away for a 109-102 win over the Boston Celtics.\n\n\"When he plays like that, it's huge for our team,\" Chicago coach Tom Thibodeau said. \"When you look at his plus-minus when he's on the floor for our team this year, it's off the charts. When he's on the floor it makes a big difference for our team. I think we all know that.\"\nRose missed large portions of the past two seasons with serious knee injuries. He's been struggling to stay in the lineup this year due to ankle and hamstring injuries.\n\"The confidence is through the roof,\" he said. \"I don't need more confidence. I just need to play. I know how good I am and how good I can be. It's just I need to be out there playing.\"\nJimmy Butler hit four free throws late in the game and finished with 22 points for Chicago, which had lost four of its previous six games.\nPau Gasol had 15 points and 15 rebounds, and Joakim Noah added 15 points and 14 boards for the Bulls.\n\"Every time he's on the court he makes our team better,\" Noah said of Rose. \"Any time he's on the court it just makes us that much more dangerous.\"\nRose was held to seven points in the opening half before the 2010-11 MVP scored the 12 in the opening 4 minutes of the second half. After he went to the bench with 4:52 left in the third, he didn't return until 7:02 remained in the game.\nJared Sullinger led Boston with 23 points and 10 rebounds. Avery Bradley had 18 points and Brandon Bass 16 with nine boards. Rajon Rondo had eight points, seven rebounds and nine assists for the Celtics, who have lost six of seven.\nBoston shot 19.2 percent (5 of 26) in the final quarter.\n\"I'm not going to lose any sleep over the ball not going into the basket,\" Boston coach Brad Stevens said. \"We've got to finish. That's the bottom line.\"\nWith the score tied at 100, Jeff Green's driving basket put the Celtics ahead with 2 1/2 minutes left. After each team failed to score on a couple of possessions, Butler's two free throws tied it with 80 seconds to play.\nRondo missed two free throws and Sullinger front-rimmed an attempted 3 before Butler's two free throws moved the Bulls ahead for good, 104-102, with 51 seconds left. Noah then nailed a short jumper on their next possession.\n\"We had a lot of open shots that didn't fall in the fourth,\" Sullinger said.\nBoston missed 17 of its first 20 shots in the final quarter before Sullinger's conventional 3-point play tied it at 100 with 3 minutes to play. He was fouled driving down the lane by Noah, who was attempting to draw a charge.\nThe Celtics held a 91-85 edge after three periods when Sullinger made a 3 with four-tenths of a second left in the quarter.\n---\nNOT GOOD FROM THE LINE\nRondo is shooting just 32 percent (9 of 28) from the foul line this season.\nPROTECTING THE PAINT\nNoah returned after missing the last game with eye abrasion, collecting six of Chicago's 13 blocked shots.\nNEW LOOK\nThe Celtics wore their alternate gray home uniforms -- with sleeves -- for the first of six times this season.\nTIP-INS\nBulls: Rose played his third straight game after missing four with a strained left hamstring. Thibodeau said recent criticism is fair of Rose's decision to miss games with injuries. \"Yes. Because it's really not that important and I've told him this: `Whether it's praise or criticism, it's all the same.' It's really what he thinks.\" he said. \"Only he knows if he's putting everything he has into each and every day. Once he know he's done all you can do, you should feel good about it. I've told him this many times, `If he's injured, I don't want him out there, and if he's healthy, I want him to go.' Hopefully we're moving forward.\"\nCeltics: G Marcus Smart missed his eighth straight game with a sprained left ankle. \"He pulled himself out (of practice) after a few minutes on Wednesday,\" coach Stevens said. \"The ankle was still tender.\"\nUP NEXT\nBulls: At Brooklyn on Sunday.\nCeltics: Host San Antonio on Sunday.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.563273",
  "pipeline_version": "v1"
}