{
  "game_id": "0021700462",
  "espn_id": "400975213",
  "date": "Dec 20, 2017",
  "matchup": "MIN @ DEN",
  "headline": "Towns, Butler lead Timberwolves past Nuggets 112-104",
  "cleaned_body": "DENVER --  Karl-Anthony Towns dominated the start of the fourth quarter and Jimmy Butler took over at the end to stop Denver's eight-game home winning streak.\n\nTowns had 25 points and 10 rebounds, Butler also scored 25 and the Minnesota Timberwolves beat the Nuggets 112-104 on Wednesday night.\n\nJamal Crawford added 20 points and seven assists off the bench for the Timberwolves, who rallied from 14 down.\n\nDenver was without leading scorer Gary Harris and backup point guard Emmanuel Mudiay, forcing coach Michael Malone to use his 13th different starting lineup. Malone went with a bigger group and started Nikola Jokic and Mason Plumlee together for the first time this season.\n\nIt worked for most of the game, but the Nuggets faltered after taking an 80-66 lead late in the third quarter.\n\n\"We didn't play a great 48 minutes, but we did enough to get the win,\" Towns said. \"Sometimes wins are not going to be the prettiest ones, but as long as there's a win at the end of the day it's always fun.\"\n\nJamal Murray led Denver with 30 points. Plumlee added 17 points and 10 rebounds, and Jokic had 22 points, six rebounds and a career-high 10 turnovers.\n\n\"The turnovers have been a recurring nightmare all season,\" Malone said.\n\nButler started slowly two nights after scoring 37 points and hitting 11 of 12 free throws against Portland. He had just 14 points with 4:41 left and then hit a 3-pointer to spark Minnesota's late surge.\n\nHe scored nine straight points when the Timberwolves extended a two-point lead to 110-102 late in the game.\n\n\"That's who he is,\" Minnesota coach Tom Thibodeau said. \"That's Jimmy Butler.\"\n\nTowns was a force earlier in the period when he scored the first 11 points for Minnesota. The Timberwolves used a 19-4 run in the third and fourth to go up by one.\n\nCrawford sparked an 11-2 spurt midway through the fourth to give the Timberwolves a 102-95 lead.\n\nTIP-INS\n\nTimberwolves: Jeff Teague had 16 points and eight assists. ... Minnesota committed nine turnovers, one fewer than Jokic had on his own. ... F Nemanja Bjelica, out since Nov. 22 with a sprained left midfoot, was going through drills before the game and shooting 3-pointers from long range. He is close to returning but missed his 14th straight game.\n\nNuggets: Harris was injured on a hard fall at Oklahoma City on Monday. He is averaging 16.1 points per game. ... Mudiay missed his second straight game with a sprained right ankle. He is day to day. ... G Monte Morris was recalled from Rio Grande of the G-League. With Tyler Lydon and Torrey Craig also up, all of Denver's G-League players are with the team. ... Denver Broncos LB Von Miller sat courtside. He autographed a football and threw it into the stands in the third quarter.\n\nSEASON OF GIVING\n\nJokic has drawn praise around the NBA for his passing ability, but usually he finds teammates. This time, he struggled with ball control and committed 10 turnovers.\n\nHis previous high was seven, but he didn't seem too concerned with hitting double digits.\n\n\"I've had a couple of nights like this. Not 10, maybe six or seven,\" Jokic said. \"I need to take care of it. It's a big number, 10.\"\n\nBANNER MONTH\n\nAfter a slow start, Butler has turned it on this month. The star guard is averaging 25.8 points, six rebounds and 5.2 assists in 10 December games. He also has scored more than 30 points in three games.\n\n\"I have just as much faith in my teammates as I do in myself and that's just part of the game,\" Butler said. \"You take what the game gives you.\"\n\nUP NEXT\n\nTimberwolves: Play at Phoenix on Saturday night.\n\nNuggets: Travel to Portland to face the Trail Blazers on Friday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.817167",
  "pipeline_version": "v1"
}