{
  "game_id": "0021300960",
  "espn_id": "400489833",
  "date": "Mar 12, 2014",
  "matchup": "DET @ TOR",
  "headline": "DeRozan scores 25 as Raptors beat Pistons 101-87",
  "cleaned_body": "TORONTO --  Raptors coach Dwane Casey showed up a little late to his own postgame press conference after Wednesday's win over Detroit. Right after his team finished off the Pistons, Casey and his staff hustled off the court and huddled in their office to watch the final moments of Brooklyn's one-point win over Miami, an outcome that kept Toronto's lead atop the Atlantic Division at three games.\n\nFor the first time in six years, late-season results are important to Toronto. And DeMar DeRozan, who's never been to the postseason, couldn't be happier about that.\n\n\"It always bugged me going home early and just sitting there doing nothing,\" DeRozan said of the empty springs he's known so far. \"It used to make me so hungry just watching. I've got a lot of friends that play in the playoffs and I've always got to hear them all summer talk about their experience. It always pushed me even further.\"\n\nDeRozan scored 25 points, Amir Johnson had 20 against his former team and the Raptors handed Detroit its 10th straight road defeat, beating the Pistons 101-87 and bouncing back from a 101-97 defeat at Brooklyn on Monday night.\"\n\n\"It definitely feels good that we're going in the right direction now,\" DeRozan said.\n\nJohnson said he's constantly checking scores and standings on his phone as the season heads into its final quarter.\n\n\"I'm always watching where teams are, even in the West,\" Johnson said. \"I'm always monitoring what guys are doing, what everybody is doing.\"\n\nCasey enjoys keeping tabs on the competition, but he doesn't want anyone losing focus, either.\n\n\"It is fun, but we've got to take care of our business,\" Casey said. \"We can watch, but if we don't take care of our business, it's not worth (anything).\"\n\nKyle Lowry added 19 points and Jonas Valanciunas had 13 rebounds for the Raptors, who won for the fourth time in five meetings with Detroit. Toronto has won 15 of 19 at home after losing eight of its first 12 home games this season.\n\nToronto won for the 10th time in 13 games.\n\nBrandon Jennings scored 24 points for the Pistons, who have not won away from home since beating Washington on Jan. 18. It's Detroit's longest road skid since losing 11 in a row from Feb. 23 to April 5, 2011.\n\nEleven of Detroit's remaining 17 games are on the road.\n\nGreg Monroe had 13 points and 10 rebounds for the Pistons, Andre Drummond scored 16 and Josh Smith had 13.\n\nDetroit dropped to 4-11 since Jon Loyer replaced Maurice Cheeks as coach on Feb. 9. The Pistons have lost 17 of 24 overall.\n\nLoyer was disappointed by  17 turnovers, and the Pistons being outrebounded 54-39.\n\n\"They dominated us on the boards,\" Loyer said. \"We're one of the best rebounding teams in the league and we didn't constantly block out.\"\n\nAhead by five points to begin the fourth quarter, Toronto took control with a 9-0 run, including a three-point play by DeRozan and a 3-pointer from Greivis Vasquez. \"It was definitely big,\" DeRozan said of the timely spurt. \"We just all came together and told each other `That was their run. They made the push, now it's our turn to turn it up on both ends and put the game away.' That's one thing we're making a conscious effort at getting better at.\"\n\nThe slumping Pistons, who had closed the third on a 12-2 run, missed their first six field goal attempts in the fourth and could not recover.\n\n\"I think we had the momentum going into the fourth quarter but we missed a few shots at the rim early,\" Monroe said.\n\nSmith scored eight points in the second while Bynum and Drummond each had six, but Toronto led 52-45 at halftime.\n\nLowry scored five points as the Raptors took advantage of five Detroit turnovers to start the second half with a 13-2 run, opening a 65-47 lead at 7:40. Once again, however, Toronto couldn't hold on to the double-digit lead. Jennings scored 15 in the third, including a pair of 3-pointers in the final minute, as the Pistons cut the gap to 74-69 heading to the fourth.\n\nGame notes Toronto F Patrick Patterson (right elbow) missed his third straight game. ... Johnson recorded his 405th block with the Raptors, matching Antonio Davis for third place on the team's career list. ... NHL Hall of Famer Paul Coffey attended the game.",
  "tags_rule": [],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.657147",
  "pipeline_version": "v1"
}