{
  "game_id": "0021700648",
  "espn_id": "400975394",
  "date": "Jan 15, 2018",
  "matchup": "HOU @ LAC",
  "headline": "Clippers beat Paul, Rockets 113-102 for 5th win in a row",
  "cleaned_body": "LOS ANGELES --  Chris Paul came back to Staples Center to play against his old team and things got heated.\n\nThe final minutes of the game were filled with technical fouls, ejections, swearing, bumping -- and that was just the beginning.\n\nLou Williams scored 31 points, Blake Griffin added 29 before his ejection, and the Los Angeles Clippers beat Paul and the Houston Rockets 113-102 on Monday night for their fifth victory in a row.\n\nThe tempers that flared during the fourth quarter carried over after the game, when several security guards were present outside the Houston locker room. Citing anonymous NBA sources, ESPN reported several Rockets players headed toward the Clippers' locker room, seeking a confrontation, but were escorted away by security before anything got physical.\n\nAsked about that, Clippers coach Doc Rivers would only say his team was in its own locker room.\n\n\"Their entire team was not in their locker room,\" he said, referring to the Rockets.\n\nPaul had 19 points, six rebounds and seven assists for the Rockets, whose three-game winning streak ended.\n\n\"It's always like that when you lose, especially when you're playing against a former team, all the emotions that go into it, familiar faces and stuff like that,\" Paul said. \"For us, we've got to be better. Give them the credit, they won the game.\"\n\nThings got testy with 3 1/2 minutes to go. Griffin scored under the basket and Paul was called for a foul. Paul ran over to the referees in disbelief. On his way back up court, Griffin went out of bounds and bumped Rockets coach Mike D'Antoni, who became irate and cursed in Griffin's direction.\n\n\"After he said what he said, I said the same thing back,\" Griffin said.\n\nAsked what he said, D'Antoni replied, \"You mean after he hit me? Just that I didn't appreciate him. But other than that, it's good.\"\n\nThe referees reviewed video of the play and confirmed the foul on Paul, while also assessing double technicals to Griffin and D'Antoni.\n\n\"Coach told me he (Griffin) elbowed him and I saw him talking crazy to Coach. I always got our coach's back,\" Paul said. \"You probably can tell me what I said better than I did. Whatever it is, I'm sure my mama is going to tell me to wash my mouth.\"\n\nRivers said he didn't see the Griffin-D'Antoni interaction, and added, \"I don't think a coach should ever get engaged with a player personally, but I've been guilty of it before.\"\n\nThe crowd was on its feet with 1:12 to go after Griffin caught the ball near the midcourt sideline and slammed it off Eric Gordon's back in order to keep it from going out of bounds. Nine seconds later, Griffin and Trevor Ariza received double technicals after exchanging words, and both were ejected.\n\n\"He asked me if I was still coming to his birthday party and I said, `Yeah, I'm going to try,\" Griffin said, smiling.\n\nGriffin high-fived players on the Clippers' bench as he stormed off the court, tearing off his jersey in the process.\n\n\"I know Blake was upset on the last play. He felt like somebody tried to do dirty to him,\" Rivers said. \"I'm glad nobody got hurt.\"\n\nWalking into his postgame interview, Rivers joked: \"We're honoring Martin Luther King Jr. Day; we're non-violent.\"\n\nGriffin said: \"We were where we were supposed to be; we were in our locker room. We can't control what anybody else does.\"\n\nPaul got booed when he brought the ball up court for the first time. Some fans stood and applauded a video tribute to him during a timeout in the first quarter, when Paul waved from the bench, but most appeared to not have forgotten Paul's desire to leave last summer after six years without a title in Los Angeles.\n\nGordon, another ex-Clipper, had 19 points and Ariza added 17. Houston shot 40 percent with injured star James Harden out.\n\nGriffin and Williams dominated the third quarter, combining for 20 points while extending the Clippers' lead to 92-84. Griffin ran off nine in a row and Williams added two 3-pointers.\n\n\"It's an emotional game. It was a big game for us to try to get over .500,\" Williams said after his 13th straight game of 20 or more points.\n\nTAKING IT PERSONAL\n\nWilliams insisted he harbors no ill will toward the Rockets, who took him out of a losing situation with the Lakers only to trade him to the Clippers a short time later. But it still bothered him. \"I'm a very productive basketball player,\" he said. \"A lot of productive basketball players usually don't get traded that much, especially in a short period of time, so I took it very personal.\"\n\nMOVING ON\n\nRivers said the Clippers didn't mention Paul in their pregame discussions. \"Chris was great for us, but Chris decided to leave us,\" Rivers said. \"We don't talk about him. We talked about the way to win the game.\"\n\nTIP-INS\n\nRockets: Harden (hamstring strain) is on track to return later this week. ... Besides Paul, the ex-Clippers on the Rockets' roster are Gordon and Luc Mbah a Moute.\n\nClippers: C DeAndre Jordan (sprained left ankle) is likely to return Saturday at Utah. By then, he would have missed three straight games. ... The Clippers are 2-0 vs. the Rockets, having won by 10 points on Dec. 22. ... LA is 11-3 in its last 14 games despite a slew of injuries. ... Williams, Dekker, Montrezl Harrell and injured Patrick Beverley are ex-Rockets.\n\nUP NEXT\n\nRockets: Host the Minnesota Timberwolves on Thursday in the opener of a three-game homestand.\n\nClippers: Host the Denver Nuggets on Wednesday to end a three-game homestand.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "InjuryReport",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.691692",
  "pipeline_version": "v1"
}