{
  "game_id": "0021400918",
  "espn_id": "400579210",
  "date": "Mar 06, 2015",
  "matchup": "LAL @ MEM",
  "headline": "Randolph, Gasol lead Grizzlies past Lakers 97-90",
  "cleaned_body": "MEMPHIS, Tenn. --  The Memphis Grizzlies used their defense to fuel a late fourth-quarter push and avoid an upset against the Los Angeles Lakers.\n\nZach Randolph had 24 points and 13 rebounds, Marc Gasol scored nine of his 18 in the fourth quarter and Memphis rallied for a 97-90 victory Friday night.\n\nThe defensive effort in the fourth quarter contributed to Memphis holding the Lakers shooting 38 percent in the frame, including missing all four from outside the arc, and committing four turnovers. The result was the Grizzlies erasing a 10-point Lakers lead early in the fourth by outscoring Los Angeles 30-19.\n\n\"They played hard. They had us on our heels,\" Randolph said. \"We couldn't make shots. We just kept sticking with it. We knew we had to get stops.\"\n\nThe Lakers held an 87-84 lead with three minutes left before Memphis closed the game on a 13-3 run, including seven straight to start the rally.\n\n\"We had control for most of the game until the final four or five minutes,\" Lakers forward Ed Davis said.\n\nJeff Green added 16 for Memphis, which won its second straight, and Tony Allen had 15, connecting on all but one of his eight shots. Mike Conley finished with 12 points.\n\nThe Lakers, who lost their fourth straight, were led by a career-high 25 points from Jordan Clarkson, who was 12-of-18 shooting. Clarkson also had six assists. Wayne Ellington and Wesley Johnson finished with 14 points each, Jordan Hill added 13 and Davis scored 10, hitting all five of his shots.\n\nLos Angeles coach Byron Scott thought his team played well on both ends of the floor. He said defensively \"we did some great things,\" while offensively his team moved the ball well and got shots they wanted.\n\nIt was the close where the Lakers fell short.\n\n\"That's what great teams do in the last three minutes when there's a chance to win the game,\" Scott said of the Grizzlies. \"They just buckle down, and they buckled down.\"\n\nThe biggest advantage for the Grizzlies was at the free-throw line, where Memphis was 28 of 33 compared to 7 of 9 for Los Angeles.\n\nClarkson hit his first five shots en route to 17 first-half points as the Lakers took a 46-43 lead into the break.\n\nThe Lakers extended the margin to eight in the third, and the lead reached 10 twice early in the fourth, the last coming on a dunk by Davis with 9:06 left. That was when Memphis began chipping away, eventually overtaking Los Angeles with the 13-3 stretch run.\n\nGasol said the difference was more tenacity and teamwork on defense, something that was missing in early stages of the game.\n\n\"If we play with guys, we're not into it, there's no ball pressure, there's no communication, there's not five guys tied together, it's going to be really hard for us to win games,\" the All-Star center said. \"We need to do it every possession.\"\n\nTIP-INS:\n\nLakers: Los Angeles lost the three previous games this season to the Grizzlies by a total of 14 points. ... Clarkson's previous high in points was 22 against Utah on Feb. 25. . The Lakers have lost 14 of their last 15 road games. . Clarkson became ninth rookie this season to record a 25-point game.\n\nGrizzlies: Reserve F Vince Carter played for the first time after missing 13 games with a tendon injury in his left foot. ... Nick Calathes recorded three steals, his eighth straight game with multiple steals. ... Memphis has a six-game winning streak against the Lakers.\n\nZBo IMPRESSED:\n\nRandolph was impressed with Clarkson, the rookie out of Missouri, who has played well since moving into the starting lineup for the Lakers.\n\n\"That young fellow, he's going to be good,\" Randolph said. \"I didn't even know who he was. I'd never heard of him until tonight. He's a second-round pick? Who's evaluating this talent?\"\n\nUP NEXT:\n\nLakers: host Dallas on Sunday\n\nGrizzlies: visit Pelicans on Saturday",
  "tags_rule": [
    "MomentumShift",
    "Streak",
    "CoachComment",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.824951",
  "pipeline_version": "v1"
}