{
  "game_id": "0021400130",
  "espn_id": "400578422",
  "date": "Nov 14, 2014",
  "matchup": "CHA @ PHX",
  "headline": "Walker, Hornets beat Suns 103-95",
  "cleaned_body": "PHOENIX -- Kemba Walker and the Charlotte Hornets finally finished the job on the road.\nWalker scored 12 of his 19 points in the second half, and Charlotte rallied to beat the Phoenix Suns 103-95 on Friday night.\nAl Jefferson and Gary Neal each had 14 points for the Hornets, who won for the first time in five road games. Lance Stephenson scored 13, and Bismack Biyombo finished with 11 points and 10 rebounds.\n\"We finished it in the end,\" coach Steve Clifford. \"We had chances in New York, obviously were ahead at halftime in L. A., ahead with seven minutes to go in Portland, but tonight we did a good job of finishing up the game at the end.\"\nEric Bledsoe had 22 points and matched a career high with 11 rebounds for the Suns, who had won two in a row. Marcus Morris scored 17 points, and Markieff Morris, Miles Plumlee and Goran Dragic each had 12.\n\"I think we got content when we got the lead but it's basketball and teams go on runs,\" Bledsoe said. \"Every time we tried to get a stop they made a great play. We just missed shots, you know. It happens.\"\nThe Suns got off to a fast start, but only had a 75-74 lead heading into the fourth.\nThe Hornets, led by Neal's two 3-pointers, used a 10-2 run to open a 91-81 lead with 5:54 to go.\nPhoenix closed to 91-87 on a driving layup by Marcus Morris with 3:26 left. But Cody Zeller scored on a reverse layup, and then took a pass from Stephenson while driving down the lane for another layup to make it 95-89 with 1:31 remaining.\n\"We were frustrated at the beginning but we got together,\" Stephenson said. \"We got mentally into the game and got the `W.\"\nCharlotte had lost the last five games in the series.\n\"I thought our defense was pretty good throughout the whole game, even the first quarter,\" Jefferson said. \"When you play against a team like Phoenix or Portland, you know they're going to go on an 8-0 or 10-0 run at any given time. We had to keep them moving because they have a lot of energy.\"\nThe Suns, after watching Charlotte score the game's first five points, closed the first quarter on a 28-9 run to open a 14-point lead. But the Hornets rallied in the second, tying the game on a Zeller dunk with .9 seconds to go in the first half.\n\"I thought our bench got thoroughly beat by these guys,\" Suns coach Jeff Hornacek said. \"We had a good first quarter and then they came out to start the second quarter and scored what, 11 straight? We let them back in and they got life.\"\n---\nTIP-INS\nHornets: Walker started 2 for 7 from the floor but was 6 for 9 in the second half. ... Charlotte was without F Michael Kidd-Gilchrist, who sustained a stress reaction in his right foot during Tuesday's loss at Portland. Neal (left foot contusion), Stephenson (groin strain) and Marvin Williams (left knee tendinitis) all played through injuries. ... PJ Hairston started in place of Kidd-Gilchrist and finished with nine points on 3-of-8 shooting in 17 minutes.\nSuns: Reserve guards Gerald Green and Isaiah Thomas, who combined for 53 points in the Suns' past two games, were 2 of 13 from the floor and finished with nine points -- all from Thomas. ... The Suns' reserves, who average more than 45 points per game, were outscored 45-20 by the Hornets. . Phoenix wrapped up a five-game homestand. The Suns, who have only played two away from the U.S. Airways Center, embark on a season-long, six-game trip starting Saturday night.\nUP NEXT\nHornets: Visit Golden State on Saturday.\nSuns: Visit the Los Angeles Clippers on Saturday.\nHOME NOT SO SWEET\nPhoenix opened the season with seven of its first nine games at home, but managed only a 4-3 mark in what amounts to one-sixth of the home season.\n\"You've got to do better than that,\" Hornacek said. \"If we don't come and play well, we're not going to win a game. It's going to be tough going out on the road, but it's a time to get together and get us going like we did last year on the road.\"",
  "tags_rule": [
    "EarlyRun",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.386991",
  "pipeline_version": "v1"
}