{
  "game_id": "0021700937",
  "espn_id": "400975683",
  "date": "Mar 03, 2018",
  "matchup": "CLE vs. DEN",
  "headline": "Harris scores 32 as Nuggets roll LeBron, Cavs 126-117",
  "cleaned_body": "CLEVELAND --  Tucked inside his locker-room cubicle, LeBron James was getting dressed following another tough loss when a familiar voice grabbed his attention.\n\nRichard Jefferson came to visit.\n\nJames smiled at his former teammate, and in that moment, things were like they used to be for the Cavaliers.\n\nRight now, everything's a struggle.\n\nGary Harris scored 32 points, Will Barton added 23 and the Denver Nuggets did most of their damage behind the 3-point arc in a 126-117 win over Cleveland on Saturday night.\n\nThe Nuggets dropped 19 3-pointers, including three in the final 2:26, to hold off a second-half charge from the Cavs, who remain a work in progress as they try to blend four new players in on the fly.\n\n\"We're all trying to get better,\" said James, who played 42 minutes. \"It's not just the guys at the (trade) deadline, it's all of us. We're all trying to figure it out.\"\n\nJames finished with 25 points, 15 assists and 10 rebounds -- his 13th triple-double this season -- but Cleveland's lack of a dependable No. 2 scorer while Kevin Love is out with a broken left hand continues to be a major problem.\n\nMore troublesome, though, is the Cavs' defense or lack of it. Whenever Denver needed a big basket, the Nuggets got it by taking the extra pass and knocking down 3s.\n\n\"They had it going tonight offensively, so we just tried to throw everything at them,\" Cavs coach Tyronn Lue said. \"We switched. We blitzed. We showed. We did a little of everything. They got hot.\"\n\nJ.R. Smith scored 19 points -- all in the second half -- in his return from a one-game suspension for throwing a bowl of soup on Cavs assistant coach Damon Jones. With Smith and James carrying the scoring load, the Cavs pulled within 115-114 with 2:40 left.\n\nBut the Nuggets answered as Paul Millsap drilled a 3 and Harris made two more to put it away. Jamal Murray and Wilson Chandler added 16 points apiece for the Nuggets, who are 9-3 since Feb. 1 with wins over Golden State, Oklahoma City, Cleveland and two over San Antonio.\n\n\"For us to come in here on a back to back and beat that team, they were doing everything they could to get that win,\" Nuggets coach Mike Malone said. \"I couldn't be prouder of our guys. Important win.\"\n\nDUNK CITY\n\nLarry Nance Jr. gave the Cavs a needed lift and the crowd a jolt with a vicious second-quarter dunk.\n\nCatching a pass on the baseline, Nance, who recently participated in the dunk contest during All-Star weekend, took one dribble, cocked his arm and posterized Denver's Mason Plumlee. The slam brought James and several other amazed Cavs onto the floor to celebrate.\n\nWELCOME BACK\n\nThe 37-year-old Jefferson returned to Cleveland for the first time since being traded in October, and felt strange entering the visitor's locker room at Quicken Loans Arena. He was beloved by his Cavs teammates for his attitude and selflessness.\n\nJefferson experienced plenty of drama during his time in Cleveland, part of playing with James.\n\nHe's close with the three-time champion, who can become a free agent this summer. There's already speculation about where James will sign next.\n\n\"I don't know, no one knows, people can guess, everyone wants to now throw these shots in the dark,\" Jefferson said. \"`Oh he's going to go here, he's going to do this. He played junior high hockey with this person so maybe he'll go play in Minnesota.' Shut up. No one knows.\"\n\nTIP-INS\n\nNuggets: Denver's guards -- Harris, Murray and Barton -- combined for 71 points. ... C Nikola Jokic had nine points, eight assists and seven rebounds. ... Jefferson received a warm ovation when the former Cav, who was traded in October, was introduced during a timeout in the first quarter. ... Malone fondly recalled \"a great five-year\" ride (2005-2010) as an assistant with the Cavs. Malone still marvels that James took the Cavs to the Finals in 2007 with a group of \"castoffs,\" and he's equally impressed about the man he's become. \"Now you look at LeBron off the court and his maturity and his voice and everything that he stands for,\" Malone said. \"It's really remarkable.\" ... Denver will play 11 of 15 games in March on road.\n\nCavaliers: Dropped to 1-4 in last five home games. ... F Jeff Green missed his second game this week with a sore lower back, and Lue said it's possible the 32-year-old could be out even longer. Green underwent an MRI on Saturday that did not reveal any structural damage.\n\nUP NEXT\n\nNuggets: At Dallas on Tuesday.\n\nCavaliers: Host Detroit on Monday.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "TripleDouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.495717",
  "pipeline_version": "v1"
}