{
  "game_id": "0022100253",
  "espn_id": "401360077",
  "date": "Nov 22, 2021",
  "matchup": "BKN @ CLE",
  "headline": "Durant scores 27, Nets get lift from rookie to down Cavs",
  "cleaned_body": "CLEVELAND -- — In two days, Cam Thomas went from G League sensation to Brooklyn spark plug.\n\nKevin Durant returned to the lineup and scored 27 points, James Harden added 14 points and a season-high 14 assists, and Thomas gave Brooklyn a needed second-half lift in a 117-112 win over Cleveland on Monday night.\n\nLaMarcus Aldridge had 21 points and 11 rebounds off the bench for the Nets, who seemed somewhat disinterested for three quarters before awakening to get their sixth win in seven games.\n\n“Sometimes, it takes a little while for them to get going. I wish it didn’t,\" coach Steve Nash said \"They found themselves in a hole, but they’re proud and they responded.”\n\nThomas made sure of it.\n\nThe rookie, who scored 46 points in 39 minutes for the Long Island Nets on Saturday, scored eight of his 11 in the third quarter. He made a 3-pointer and a three-point play to fuel a 13-2 run by the Nets over the final 2:32 as Brooklyn, which trailed much of the game, took an 84-82 lead into the last 12 minutes.\n\n“I got in and I got looks,” said Thomas, who came with a career high of four points. \"When K.D. or James (Harden) kicked it to me, I knocked it down.”\n\nLike any rookie, Thomas has been taking some playful jabs from teammates — especially Durant — but got nothing but love after his performance.\n\n“K.D. tried to trash-talk me, but I ain’t saying nothing back to him tonight,” Thomas said with a laugh.\n\nDurant has been impressed with the 20-year-old guard's fearlessness.\n\n“It's good to have a young dude like Cam who is into it,” Durant said.\n\nDurant was back after missing one game with a sprained right shoulder. With the Nets down 105-102, the All-Star forward made a tough baseline jumper and layup to put Brooklyn back in front.\n\nCleveland's Ricky Rubio hit a 3-pointer to pull the Cavs within one, but Aldridge scored on a putback when the Cavs failed to box out. Durant then grabbed a rebound off a Cleveland miss before firing a pass to an unguarded James Johnson for a layup to make it 113-108.\n\nDurant dropped four free throws in the last 13.8 seconds left to ice it.\n\nDarius Garland scored 24 and Jared Allen had 20 points and 15 rebounds. Lauri Markkanen added 22 points in his first game since Nov. 1 for the still short-handed Cavs, who had chances down the stretch but missed some shots and made critical mistakes.\n\nCleveland has lost four straight.\n\nCavs coach J.B. Bickerstaff was upset with some calls that went against the Cavs in the fourth quarter. He was particularly hot after Rubio was whistled for an offensive foul and the officials didn't see Bickerstaff trying to call a timeout to get a video review.\n\n“What’s right is right and I thought there were definitely some calls that were missed and that is wrong,” a hoarse Bickerstaff said. \"Our guys deserve better than that. People need to change the perceived notion of who the Cavaliers are.\n\n“Our guys are competing their tails off. The opponents will tell you and other coaches will tell you, so I don’t know where the disconnect is.”\n\nDurant (24,367) moved within one point of tying Allen Iverson (24,368) for 25th on the career scoring list.\n\nNash has been impressed with the Cavs, calling them a “very willing, unselfish group.” He expected a tough game and got one.\n\nCleveland was the more aggressive, more focused team in the first half. The Cavs outrebounded the Nets 30-14 while building an 11-point halftime lead.\n\nTIP-INS\n\nNets: Nash sat F Blake Griffin the entire the second half. He added other lineup changes could be coming, particularly with Aldridge playing well. ... F Joe Harris (left ankle sprain), F Bruce Brown (left hamstring tightness), Nic Claxton (illness) and G Kyrie Irving (not with team) were inactive. Harris missed his fourth straight game.\n\nCavaliers: Cleveland attempted 16 free throws in the second quarter after not trying one in the first. ... Fast-starting rookie F Evan Mobley (right elbow) missed his third game in a row. He won't be back until December. The No. 3 overall pick was averaging 14.6 points and 8.0 rebounds before getting hurt. ... F Cedi Osman (lower back spasms) sat out his second game in a row, while F Lamar Stevens (right ankle sprain) last played on Nov. 12.\n\nCHANGING OF GUARD\n\nA two-time league MVP and one of the best point guards in history, Nash has been impressed with Garland and believes the 21-year-old’s versatile game will only grow.\n\n“He’s extremely well-rounded,” Nash said. “There’s an intelligence to the way he plays that can be developed.”\n\nUP NEXT\n\nNets: Visit Boston on Wednesday.\n\nCavaliers: Host the red-hot Phoenix Suns on Wednesday.\n\n------",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.738676",
  "pipeline_version": "v1"
}