{
  "game_id": "0022101127",
  "espn_id": "401360946",
  "date": "Mar 28, 2022",
  "matchup": "TOR vs. BOS",
  "headline": "Siakam scores 40 points, Raptors beat Celtics 115-112 in OT",
  "cleaned_body": "TORONTO -- — Pascal Siakam had a season-high 40 points and 13 rebounds before fouling out, and the Toronto Raptors beat the short-handed Boston Celtics 115-112 in overtime on Monday night.\n\nFred VanVleet and OG Anunoby scored 14 points apiece, Thad Young and Gary Trent Jr. each had 12, and Scottie Barnes scored 10 before fouling out as Toronto snapped a four-game home losing streak against the Celtics.\n\n\"That was a tough one tonight, man,” Raptors head coach Nick Nurse said. “It certainly could have gone either way, and we’ve been on the wrong end of some of those.”\n\nPlaying without forwards Jaylen Brown and Jason Tatum and centers Al Horford and Robert Williams III, Boston lost for the fifth time in 29 games.\n\n“Great night by a lot of guys,” Celtics coach Ime Udoka said. “A lot of guys stepped up. We had our chances and felt we should have won.”\n\nTrent made two free throws to put Toronto up by three points with 14.4 seconds left in the extra period. Marcus Smart and Grant Williams both missed game-tying 3-point tries on Boston’s final possession.\n\nSmart had 28 points and 10 rebounds, Williams scored 17, and Derrick White added 15 for Boston. Seven Celtics players scored 10 points or more, including Daniel Theis, who had 13 points and 10 rebounds.\n\n“It was a tough game,” Smart said. “The fact that we did what we did and had chances, I’m proud of us.”\n\nToronto stayed one game ahead of Cleveland for sixth place in the Eastern Conference, while Boston fell one game behind Miami for first in the East after the Heat beat Sacramento at home. The Celtics host the Heat on Wednesday night.\n\nPhiladelphia and Milwaukee are also one game behind Miami, but both have played two fewer games than the Celtics and Heat. The Sixers and Bucks play Tuesday night.\n\nThe Raptors and Bulls have identical 43-32 records, but Chicago won three of four against the Raptors this season, keeping them in fifth place despite Monday’s road loss to the Knicks.\n\nSixth place is the last guaranteed postseason spot, with teams finishing in the Nos. 7-10 spots headed for the play-in tournament.\n\nBrown and Tatum both sat with sore right knees. Both played in a win over Minnesota on Sunday and are expected to return for Wednesday’s pivotal showdown with the Heat.\n\nHorford missed his second straight game for personal reasons. Before tip off, Udoka said Horford is day to day.\n\nEarlier Monday, the Celtics said Williams will need surgery to repair torn cartilage in his left knee, likely keeping him out for the rest of the regular season and well into the playoffs.\n\n“Obviously, Rob has a huge impact on both sides of the floor,” White said. ”You can’t really replace what he does. He’s unique in that respect.”\n\nWilliams didn’t return after limping off at the end of the third quarter against Minnesota Sunday. Udoka said Williams and the Celtics are considering various surgical options and will make a decision later this week.\n\n“There are some (options) that keep you out longer than others,” Udoka said before the game. “We’re hoping for the best as far as that.”\n\nAfter scoring 10 points in the first, Siakam added 15 more in the second, and VanVleet’s three-point play with 3.3 seconds to go in the half gave Toronto overcame a 38-30 deficit after one to lead 59-58 at the break.\n\n“They came out, they had a lot of energy, they played hard,” Siakam said. “They made some shots early.”\n\nThe score was tied 80-all through three quarters.\n\nJUST FOR KICKS\n\nThe members of Canada’s men’s national soccer team received a standing ovation when they took the court during a timeout in the second quarter. Canada beat Jamaica 4-0 Sunday to reach the World Cup for the first time since 1986.\n\nTIP-INS\n\nCeltics: Made nine turnovers in the second, leading to 14 points. … Shot 6 for 12 from 3-point range in the first quarter, but went 6 for 28 from distance the rest of the way.\n\nRaptors: C Khem Birch (right knee) was not available. … Trent started for Toronto after missing the previous three games because of a sore left big toe. He shot 4 for 12 in 37 minutes. … Siakam matched his career-high with 17 made baskets and attempted a career-high 29.\n\nUP NEXT\n\nCeltics: Host Miami on Wednesday night.\n\nRaptors: Host Minnesota on Wednesday night.\n\n------",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "CareerHigh",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.384323",
  "pipeline_version": "v1"
}