{
  "game_id": "0021401211",
  "espn_id": "400579503",
  "date": "Apr 13, 2015",
  "matchup": "LAL @ SAC",
  "headline": "Casspi helps Kings beat Lakers 102-92",
  "cleaned_body": "SACRAMENTO, Calif. --  The Los Angeles Lakers are one loss away from the worst season in franchise history.\n\nOmri Casspi had 26 points, nine rebounds and six assists to help the Sacramento Kings beat the hapless Lakers 102-92 on Monday night.\n\nLos Angeles will have to win the rematch on Wednesday at home to avoid setting a team record for futility. The 1957-58 Minneapolis Lakers went 19-53 and had a .264 winning percentage. The current Lakers (21-60, .259 percentage) need a victory in their final game to avoid that distinction.\n\n\"I didn't know that (about the record),\" said Jabari Brown, who had 18 points and seven assists. \"Of course, no one wants to be a part of that.\"\n\nThat certainly includes Lakers coach Byron Scott, who was part of the glory days as a Laker when the team won three championships in the 1980s.\n\n`It doesn't matter about records and all that stuff,\" said Scott, who has watched injury after injury decimate what he thought could be a promising first season as Lakers coach. \"I mean, when you step on the floor and put a uniform on -- especially the purple and gold one -- that's enough incentive right there.\"\n\nThe Lakers will need a better effort to avoid a third straight loss to end the season. The Lakers shot 42 percent, missed 11 of 15 3-pointers, and sent the Kings to the free-throw line 36 times.\n\nLos Angeles, which has dropped seven of eight games, is already assured of having the second worst Western Conference record and fourth overall in the NBA.\n\n\"With everything that's happened this season, (the losing) is not stunning to me,\" Scott said. \"It's been a tough season, record-wise, injury-wise, all that stuff. You just take it with a grain of salt and you get ready for the next one.\"\n\nThe victory snapped a three-game losing streak for the Kings, who outscored the Lakers 27-18 in the fourth period to avoid their ninth loss in 10 games.\n\nDerrick Williams scored a season-high 20 points for the Kings. Carl Landry added 14, Ray McCallum had 12. Jason Thompson added 10 points and 10 rebounds.\n\nThe Kings had to shut down leading scorer and rebounder DeMarcus Cousins (right foot) and Rudy Gay (concussion) for the final three games of the regular season.\n\nIt was another strong game for Casspi, who in the absence of Gay and Cousins has been an effective starter who has blossomed as a scorer. He has averaged 22 points in the past five games, including a career-high 31-point effort against Minnesota.\n\n\"I'm happy for him (Casspi) because I think he was struggling when I came here,\" Kings coach George Karl said. \"He understands what we're trying to do a little better than some other guys. His ability to get to the rim has been pretty impressive and I'd like to see him have more games with six assists, like tonight.\"\n\nJordan Clarkson scored 15 points of his 23 points in the second half and Jordan Hill had 18 for the Lakers, who only suited up nine players. Clarkson suffered a mild left ankle sprain in the final minute, but said he expects to play in Wednesdays' game.\n\nAlthough Kings fans screamed \"Beat LA\" several times, there was little at stake for Sacramento, which was playing its final home game of a forgettable season.\n\nThe Kings closed out the fourth quarter strong. Ahead by one point, they went on a 10-1 run to seal the victory. Evander Blue made a 3-pointer to pull the Lakers within a point, but Casspi and McCallum both made two free throws for a 93-88 Kings lead with 3:48 left.\n\nTIP INS\n\nLakers: Guard Dwight Buycks became the latest Lakers' casualty, breaking his hand Sunday against Dallas. The Lakers have lost eight guards to injury or retirement this season. The other injured guards include Kobe Bryant, Steve Nash, Wayne Ellington, Nick Young, Ronnie Price, Xavier Henry and Jeremy Lin. ... Blue, who was playing for the L.A. D-Fenders, was added to the roster after catching a flight that landed in Sacramento an hour before game time. He entered the game in the opening quarter.\n\nKings: The Kings are 5-16 when Cousins hasn't played this season. ... Ben McLemore is the only Kings player to appear in every game this season. ... The Kings entered the game ranked 29th in points allowed and the Los Angeles were 28th.\n\nUP NEXT\n\nLakers host the Kings on Wednesday.",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "CareerHigh",
    "Rivalry",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.511951",
  "pipeline_version": "v1"
}