{
  "game_id": "0021400226",
  "espn_id": "400578518",
  "date": "Nov 28, 2014",
  "matchup": "MIL @ DET",
  "headline": "Illyasova, Dudley lead Bucks beat Pistons 104-88",
  "cleaned_body": "AUBURN HILLS, Mich. --  Milwaukee Bucks coach Jason Kidd knew he was going to need more than a few players to step up against Detroit on Friday night.\n\nHe got even more than he expected.\n\nThe Bucks, playing without John Henson and Zaza Pachulia, didn't have a single starter in double figures scoring, but still managed to beat the hapless Pistons 104-88.\n\nMilwaukee had a 69-13 edge in bench scoring, including 13 of 22 3-point shooting while Detroit's reserves went 1 for 10.\n\n\"This was just a great team effort,\" Kidd said. \"Everyone was going to get a chance to help us win this game, and all 10 guys pitched in. We were turning down good shots in order to get better shots. That's playing at a high level.\"\n\nDetroit's seven-game losing streak matches the longest of Stan Van Gundy's career, set when Miami started 0-7 in his rookie season of 2003-04. That team was 11 games under .500 in early March -- the only time he's been further under that mark than the 3-13 Pistons are now.\n\n\"We should be better than this,\" Van Gundy said in a 90-second press conference. \"We have to find a way to be better.\"\n\nJared Dudley scored 16 points, while former Piston Khris Middleton added 12 points for Milwaukee, which got four reserves into double figures. Andre Drummond led Detroit with 26 points and 20 rebounds, but Greg Monroe only had five points on three shots.\n\n\"When it was our starters against their starters, we were OK,\" said Van Gundy. \"But their bench just strafed us. We didn't have an answer for anything they did. If you look at those guys coming into this game, none of them were really shooting well from the three, but they hit everything tonight.\"\n\nThe Bucks dominated the boards in Tuesday's win, but the Pistons were able to hold them in check in the first half of the rematch. This time, Detroit's problem came on defense, as Milwaukee scored 53 points on 42 field-goal attempts to take a 53-45 lead. Dudley was the biggest contributor, scoring 11 points in 10 minutes.\n\n\"We went with a small lineup and just shared the ball,\" said Ersan Illyasova, who had 22 points and eight rebounds. \"We spread the floor, we found opportunities and we knocked down shots.\"\n\nJabari Parker kept the Bucks in front with a pair of baseline dunks, and 10 points in the quarter from Kentavious Caldwell-Pope kept the Pistons close -- down 74-69 going into the fourth.\n\nMilwaukee scored the first six points of the fourth period, as the Pistons offense struggled to move the ball effectively in halfcourt sets. Detroit was reduced to bombing away from outside, a strategy that allowed the Bucks to pull away with little trouble.\n\n\"Everybody's trying to get on the same page, but when we get out there, it isn't working,\" said D.J. Augustin, who went 1 for 7 from the floor. \"It's rough right now, and we know how the fans are looking at us, but we don't want to lose.\"\n\n---\n\nTIP INS\n\nBucks: Giannis Antetokoumpo drew gasps from the crowd with a spectacular basket in the second quarter. Antetokoumpo took off from outside the 3-point line, and was still able to hit a finger roll at the hoop without traveling. He made a similar play later in the quarter, finishing the basket despite being fouled by Josh Smith. . Pachulia missed the game for personal reasons.\n\nPistons: PG Brandon Jennings missed his third straight game -- two against his former team -- with a sprained left thumb. The Pistons acquired Jennings from the Bucks for Brandon Knight and Middleton before last season.\n\nUP NEXT\n\nBucks: Host the Rockets on Saturday.\n\nPistons: Host the Warriors on Sunday.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.185571",
  "pipeline_version": "v1"
}