{
  "game_id": "0021301018",
  "espn_id": "400489891",
  "date": "Mar 20, 2014",
  "matchup": "OKC @ CLE",
  "headline": "Kevin Durant scores 35 in win to extend streak of 25 or more",
  "cleaned_body": "CLEVELAND -- As the score tightened, Kevin Durant stayed loose.\nSitting in his warm-ups on Oklahoma City's bench, Durant knew he might be called upon again. And when he was, the NBA's leading scorer closed out Cleveland.\n\"My mind's always on the game so I didn't space out,\" he said. \"I was instantly ready.\"\nDurant scored 35 points, finding his shooting touch after a rough start, and made five free throws in the final minute to shut down a furious, fourth-quarter comeback and give the Thunder their 50th win, 102-95 over the injury-riddled Cavaliers on Thursday night.\nDurant missed five of his first six shots, but finally got it going. He has scored 25 or more in 33 straight games -- the league's longest streak since Michael Jordan did it 40 consecutive times (1986-87).\nWith the win, the Thunder, who let a 24-point lead dwindle to five in the fourth, moved within 1 1/2 games of San Antonio for the best record in the Western Conference. Oklahoma City played without point guard Russell Westbrook, who rested his surgically repaired knee.\nDion Waiters scored 30 and Spencer Hawes 20 for the Cavs, who trailed 95-71 with 6:34 left before going on a 21-2 run to pull within 97-92. Durant, though, who had re-entered with 3:34 to go, made his free throws to end Cleveland's rally.\nWhen he took a seat after three quarters, Durant figured his night was done.\n\"But that can happen in this league,\" Durant said. \"Guys have pride and Cleveland plays extremely hard, so those guys made it a game late and we had to close it out.\"\nCleveland played without injured star guard Kyrie Irving (strained biceps) and forward Luol Deng (sprained ankle).\nDurant's performance came two nights after LeBron James dropped 43 points on Cleveland, which lost its season-high fourth straight at home and has seen its playoff chances disappear.\nDurant added 11 rebounds and six assists, his biggest to Serge Ibaka for a dunk with 1:54 left after the Cavs had closed within eight.\nWith the Thunder ahead by 17 entering the fourth, Durant grabbed a seat after scoring 30 in 32 minutes. Oklahoma City's reserves were having their way with the Cavs, but Cleveland quickly reeled off 11 in a row, forcing Oklahoma City coach Scott Brooks to bring Durant back.\nWaiters' steal and layup got Cleveland within five, but the Thunder made sure the ball went to Durant, who then put it away at the line. But not before the Thunder had their nerves frayed.\n\"You hate to talk about the last few minutes,\" Brooks said. \"So I'm not going to.\"\nReggie Jackson started for Westbrook and added 13 points. Derek Fisher had 12 and Jeremy Lamb 10.\nDurant had a very un-Durant-like start.\nHe started 1-of-6 from the field and grew more and more agitated with every missed shot. Late in the first quarter, Durant, who had complained to the officials about not getting a call on a drive, grabbed an offensive rebound, dunked in frustration and got called for a technical.\n\"I just don't care if I miss,\" Durant said. \"I had it in my mind that I was going to start the game off 1 for 10. That's how quickly it can change, man. I thought I might be in for a tough shooting night, but I always stay aggressive.\"\nWith Deng, Cleveland's top wing defender, out and down to just nine dressed players, Cavs coach Mike Brown knew his team would struggle to handle the multifaceted Durant. And when Alonzo Gee picked up his second personal foul less than two minutes into the game, Brown brought in pesky guard Matthew Dellavedova to guard the league's leading scorer.\nDellavedova, generously listed at 6-foot-4, did all he could to pester Durant and it worked -- for a while.\n\"He didn't get under my skin,\" Durant said. \"He plays hard, you can respect a player like that but I didn't pay him any attention\"\nBrown was proud of the job Dellavedova did on Durant.\n\"One thing Delly's going to do for sure is fight,\" Brown said. \"He's going to get up in your chest and he's going to bother you, he's going to show his hands so he's not going to foul you. He makes you work for points.\"\nGame notes\nBrooks has been impressed with Caron Butler, who has played in eight games since signing with Oklahoma City on March 1. Scott said Butler is tough, experienced and fearless. \"He can make shots and he's not afraid to take shots,\" Brooks said. \"We like that.\" ... OKC center Kendrick Perkins (left groin strain) missed his 12th consecutive game and G Thabo Sefolosha (left calf strain) sat out his ninth straight. ... Brown boycotted filling out an NCAA bracket because Butler, where his son Elijah plays, didn't make the field. \"It's my own protest,\" Brown joked. \"I'm loyal.\" ... Dellavedova had 11 points and 10 assists.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.446430",
  "pipeline_version": "v1"
}