{
  "game_id": "0021700819",
  "espn_id": "400975565",
  "date": "Feb 09, 2018",
  "matchup": "ATL vs. CLE",
  "headline": "Korver has 30, James posts triple-double as Cavs top Hawks",
  "cleaned_body": "ATLANTA -- With six players traded away and four newcomers not yet cleared for duty, the Cleveland Cavaliers were left with a lean, tight rotation.\nFewer substitutions? That worked just fine for LeBron James and Kyle Korver.\nJames had a triple-double and Korver scored a season-high 30 points, including four straight 3-pointers to close the third period, as the crisp Cavaliers beat the Atlanta Hawks 123-107 on Friday night for a successful start to their reboot.\n\"It felt like we played together,\" said James, who had 22 points, 12 rebounds and a career-high 19 assists in 41 minutes.\n\"Offensively and defensively the communication was really high. The ball was moving around. The ball was popping and everybody felt like they were in a good rhythm.\"\nOne day after unloading six players, including guards Isaiah Thomas and Dwyane Wade, in three trades, the Cavaliers were in a state of transition. They used 10 players, including two who were on the floor for about one minute.\nKorver, 36, more than made up for a short bench. The former Hawks fan favorite made 7 of 13 from 3-point range and finished two points from matching his career high of 32.\n\"Man, the ball was moving tonight,\" Korver said. \"I don't know the last time I shot that many shots in a game.\"\nKorver played in Atlanta from 2012-17.\n\"I think it's always fun for him to come back and play,\" James said. \"He spent a lot of seasons here. ... I know it was a good feeling for him to do what he did tonight.\"\nJeff Green, also coming off the bench, had 24 points.\nNewcomers George Hill, Jordan Clarkson, Larry Nance Jr. and Rodney Hood joined the Cavs, but remained in the locker room during the game. They are expected to make their debuts with Cleveland on Sunday in Boston.\nThe team sent medical staff to Atlanta to complete physicals with the four players as quickly as possible.\nDennis Schroder led Atlanta with 25 points. Taurean Prince had 15 points.\nTIP-INS\nCavaliers: Cedi Osman, making his first start, had 16 points but struggled at the free-throw line. He made only two of seven free throws, twice missing each of two attempts. ... London Perrantes and John Holland played limited roles to add depth to the temporarily short-handed roster. ... The Cavs had 31 assists and only nine turnovers.\nHawks: Coach Mike Budenholzer says one reason the team bought out Marco Belinelli's was to give younger players, including rookie Tyler Dorsey, more playing time. Dorsey had 14 points and made three 3-pointers. The move with Belinelli, 31, was announced before the game. ... G DeAndre Bembry posted bond and was with the team following his arrest early Friday for speeding on an Atlanta interstate. He was clocked driving a purple Dodge Charger at 128 mph on Interstate 85 about 12:20 a.m. Bembry, who has a left abductor strain, has not played since Dec. 22.\nPARADE OF 3s\nCleveland led 83-80 late in the third period when James scored and was fouled by John Collins. James' momentum carried him into a section of fans under the basket, and he was limping when he emerged. He made the free throw, remained in the game and then had assists on back-to-back 3s by Korver for a 91-80 lead.\n\"It was my fault; I lost him,\" Schroder said of Korver. \"From there on, it went down.\"\nKorver made a third straight 3-pointer following a timeout to stretch the lead to 14 points. Following a basket by Atlanta's Malcolm Delaney, Korver added his fourth 3 of the period, a buzzer-beater.\n\"I had a lot of really good years here,\" Korver said. \"... But it wasn't really added fuel.\"\nHALL OF FAMER IN THE HOUSE\nFormer Atlanta Braves standout Chipper Jones, to be inducted into the Hall of Fame this summer, sat courtside near the Hawks bench.\nUP NEXT\nCavaliers: Visit Boston on Sunday.\nHawks: Host Pistons on Sunday.\n---\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "TripleDouble",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.431154",
  "pipeline_version": "v1"
}