{
  "game_id": "0021700454",
  "espn_id": "400975205",
  "date": "Dec 20, 2017",
  "matchup": "TOR @ CHA",
  "headline": "Raptors overcome sluggish start to beat Hornets 129-111",
  "cleaned_body": "CHARLOTTE, N.C. --  The streaking Toronto Raptors more or less had their fourth straight win locked up by halftime. And that was before DeMar DeRozan got hot.\n\nDeRozan scored 18 of his 28 points after halftime and the Raptors overcame a slow start to beat the Charlotte Hornets 129-111 on Wednesday night for their fourth straight win.\n\nToronto has won 10 of 11 and is in third place in the Eastern Conference.\n\n\"We kept it going,\" Raptors guard Kyle Lowry said. \"It's really good when we get nights like this.\"\n\nSerge Ibaka led the charge in the first half when he scored 15 of his 24 points. Rookie OG Anunoby shot 6 of 7 from beyond the arc and scored a career-high 20 points.\n\n\"I'm getting more comfortable every game,\" Anunoby said.\n\nAnunoby's long-range shooting led a larger scale Raptors attack. Toronto connected on 8 of 13 3-point shots in the first half and finished 16 of 33.\n\n\"You're not going to have nights like this all the time, but it looks really good when you have nights like this,\" Lowry said.\n\nThe Hornets got a career-best 32 points from reserve Jeremy Lamb but lost for the 11th time in 13 games.\n\n\"My teammates put me in great positions to score, and I was able to knock shots down,\" said Lamb. \"But we were down 20 the whole game, so it doesn't really mean much. We've just got to play better.\"\n\nCharlotte closed the first quarter on a 14-2 run to lead 26-22, but the game turned with a 12-2 Toronto run early in the second quarter. The Raptors scored 41 points in the second period en route to a 63-47 halftime lead. Toronto had 10 assists and hit 15 of 23 shots, including 6 of 9 3-pointers, in the quarter.\n\nLamb piled up points on 11-of-17 shooting. He scored 19 points in 15 first-half minutes. Lamb's previous high of 27 came Nov. 3 at San Antonio.\n\nDwight Howard and Kemba Walker scored 15 points apiece, with Howard adding nine rebounds. Johnny O'Bryant III added 10 points for Charlotte.\n\nThe Raptors lead peaked at 25. Toronto's Pascal Siakam scored 12 points and Kyle Lowry added 11.\n\nThe loss is Charlotte's worst since a 106-86 setback against San Antonio Nov. 25.\n\nTIP INS:\n\nRaptors: C.J. Miles (dental procedure) and Lucas Noguiera (right calf) missed the game. ... The Raptors are 32-42 against Charlotte, including 12-25 on the road. Toronto won the teams' first meeting of the year 126-113 in Toronto on Nov. 29.\n\nHornets: Cody Zeller (left knee surgery) and Treveon Graham (lower back spasms) did not play. Marcus Paige (transferred to G League) was unavailable. ... Michael Kidd-Gilchrist suffered a right shoulder strain on a collision at the basket in the third quarter and did not return. ... Howard, a 52.6 percent foul shooter, received an ovation for sinking two free throws in the first quarter. He finished the night 5 of 6 at the line. ... Nicolas Batum was held scoreless in 26 minutes and attempted one shot.\n\nIMPROVING SHOOTER\n\nRaptors coach Dwane Casey did not view Anunoby as a 3-point threat coming out of Indiana.\n\n\"We saw the defense, the toughness, the physicality,\" said Casey. \"But the 3-point shooting is something he's worked his behind off and has really, really improved.\"\n\nAnunoby is shooting 43 percent from beyond the arc, best on the team.\n\nUP NEXT\n\nRaptors: Visit Philadelphia on Thursday night.\n\nHornets: at Milwaukee on Friday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "ThreePointExplosion",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.132418",
  "pipeline_version": "v1"
}