{
  "game_id": "0021301185",
  "espn_id": "400490058",
  "date": "Apr 11, 2014",
  "matchup": "MIL vs. CLE",
  "headline": "Knight, Sessions help Bucks hold off Cavs, 119-116",
  "cleaned_body": "MILWAUKEE --  With slim hopes of avoiding the NBA's worst record, the Milwaukee Bucks are making the most of their late-season opportunity.\n\nChris Wright, in the midst of his second 10-day contract, scored an energetic 14 points off the bench to help the Bucks hold off the Cleveland Cavaliers 119-116 on Friday night. The victory moved the Bucks to within two games of Philadelphia with three games remaining for each team. The 76ers lost at Memphis earlier in the night.\n\n\"I said before, Chris is a guy that I really liked on that first 10 days,\" said Bucks coach Larry Drew. \"It was tough getting rid of him. He did some really good things. He played well. He's got a tremendous spirit about him when he's out on the floor. \"\n\nDion Waiters had 23 points for Cleveland, while Jarrett Jack added 21 and Tristan Thompson 18. Starting guards Brandon Knight scored 24 points and Ramon Sessions added 20 for the Bucks, who also got 15 points and six rebounds from reserve forward John Henson.\n\nKnight's jumper from the right wing put the Bucks up for good at 107-106 with 4:09 remaining. Two free throws by Kyrie Irving pulled the Cavaliers to 111-110, but a basket by Khris Middleton and two free throws by Zaza Pachulia put the Bucks ahead five with 1:44 remaining.\n\n\"Obviously with the moment with us, that we are in, being eliminated from the playoffs , guys struggle with the whole, `We are playing for nothing' type thoughts,\" Jack said. \"You are playing against a team who has struggled all season. But you have to tip your cap to them. They came out regardless of what their record was and played the necessary basketball to get the win tonight.\"\n\nThe 6-foot-8 Wright, undrafted out of Dayton in 2011, spent most of this season with the Maine Red Claws of the D-League, averaging 19.5 points and 8.1 rebounds in 38 games. His only other NBA stint was 24 games with Golden State in the final half of the 2011-12 season, when he averaged 2.9 points and 1.9 rebounds.\n\n\"Just staying ready, and knowing when your number is called, you've got to be ready,\" said Wright. \"That's what coach always tells me: `When I put you in there, go out there and bring energy, you play defense, you run the floor.' Now, with me being here, that's my role on this team, to go out there and bring energy.\"\n\nMilwaukee trailed 69-62 at the half, but Knight scored seven points to pace a 10-0 run that put the Bucks up 90-86 with 1:47 left in the third quarter. Cleveland scored the first nine points of the fourth quarter to take a 96-92 lead on Jack's 3-pointer.\n\nThe Bucks led 37-32 after the first quarter, surpassing their previous season high of 36 points in the opening period. Wright was 4 for 4 in the first quarter, including a couple of alley-oop dunks.\n\n\"I thought his athleticism the first half was very needed,\" Drew said. \"He got out on a couple of breaks and we were able to get him a couple of lobs. He has that ability.\"\n\nWaiters scored 11 points to lead a 19-2 run by Cleveland midway through the second period. Jack's 3 put the Cavaliers up 55-41 with 6:26 left in the half.\n\nThere are a lot of areas during the course of the game where we did not play good basketball,\" Cavaliers coach Mike Brown said. \"Give Milwaukee credit, but I tell you what we did not play the game the right way to start the game and we did not play the right way to finish the first half.\"\n\nBucks forward Jeff Adrien, averaging 10 points and seven rebounds since being acquired in a trade with Charlotte in February, is another player making the most of increased late-season playing time.\n\n\"This trade's a blessing in disguise,\" said Adrien, who had a team-high nine rebounds against the Cavs. \"The outcomes are not what I was used to in Charlotte every game, but I think the effort is there and that's what matters for us.\"\n\nGame notes Although G Waiters has moved back into the Cavaliers' starting lineup, Brown believes Waiters should still be in the running for Sixth Man of the Year. \"He should deserve some credit, some recognition for Sixth Man of the Year,\" Brown said. \"He was giving us a big lift coming off the bench. He can be effective in a lot of different roles for a team. Obviously, he's been effective for us as a starter, but he was huge for us coming off the bench throughout the course of the season. Hopefully, he'll get recognition for it.\" ... Irving entered the game averaging 26.4 against the Bucks, his most against any opponent, but he was held to just 12 points. ... The Cavaliers became just the fifth team to lose two games to the Bucks this season. The Lakers, 76ers, Celtics and Magic are the only other teams the Bucks have beaten twice this season.",
  "tags_rule": [
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.732307",
  "pipeline_version": "v1"
}