{
  "game_id": "0021400534",
  "espn_id": "400578826",
  "date": "Jan 07, 2015",
  "matchup": "LAL @ LAC",
  "headline": "Blake Griffin propels Clippers' rout of Lakers with near-triple-double",
  "cleaned_body": "LOS ANGELES -- The Clippers stormed out of the gate, getting after the Lakers defensively and hitting shots on their own end.\nThis time, they didn't let up.\nBlake Griffin scored 27 points, Chris Paul had 24 points and Matt Barnes added 19 in a 114-89 rout Wednesday night, the Clippers' ninth victory in 10 games against the 16-time NBA champions.\n\"We kept our foot on the gas,\" Paul said.\n\nGriffin just missed a triple-double, with nine rebounds and eight assists. DeAndre Jordan had 10 points and 13 rebounds, and J.J. Redick added 10 points as all five starters reached double figures. Paul had 11 assists.\n\"The ball movement was incredible,\" Barnes said. \"Blake and Chris were finding everybody.\"\nThe Clippers led by 10 after the opening quarter, stretched it to 22 points at halftime and were up by 36 going into the fourth in winning their fifth straight against the Lakers. They are enjoying their most successful stretch against the Lakers in franchise history.\n\"We came out and did everything we wanted to do,\" Griffin said. \"It has to be a little bit of pride.\"\nJordan Clarkson scored 14 points to lead the Lakers. Jordan Hill and Wayne Ellington added 13 points each. Kobe Bryant finished with four points, eight rebounds and seven assists after going scoreless in the first half when he focused on getting the ball to his teammates.\n\"I have a lot of respect for that team over there, they are a very good team, but don't consider them a physical basketball team,\" Lakers coach Byron Scott said. \"But they came out and punched us and we were soft. Period.\"\nThe Clippers scored a season high in points in leading 70-48 at halftime. They closed on a 23-9 run, highlighted by five dunks, including three by Jordan. He dunked off a 3-point miss by Barnes to end the half just after Redick found Griffin open in the lane for a windmill jam.\n\"The ball movement was just beautiful to watch and our defensive intensity was really high,\" Clippers coach Doc Rivers said. \"That's what we have to get back to.\"\nThe Clippers opened the game on a 21-7 run while shooting 52 percent in the first quarter.\nThey blew out the Lakers in the third, outscoring them 29-15. Bryant made his first basket of the game, hitting a 10-footer that left them trailing 85-55. The Clippers opened the period on a 12-2 run, punctuated by Griffin's one-handed dunk after blowing by two defenders.\n\"They are just better,\" Bryant said. \"They play very well together and come at you in waves.\"\nScott's comments echoed what Bryant said recently about the Lakers being as soft as Charmin.\n\"He said the same thing I said,\" Bryant said. \"He just didn't use the toilet paper analogy.\"\nThe Lakers have lost six of their last eight and two in a row while dropping to 11-25 overall. They had been playing slightly better lately, with their previous 10 games being decided by 10 points or less, but they ran into a buzz saw against their Staples Center co-tenants.\nThe Clippers rested their starters in the fourth when Bryant sat out, too.\nTIP-INS\nLakers: Bryant was scoreless on four attempts in the first half, equaling his scoreless first half against Detroit on Dec. 2. He returned after skipping a loss at Portland on Monday to rest. ... Hill, Ellington, Lin and Boozer combined to score 40 of the Lakers' 48 points in the first half. ... They haven't beaten the Clippers since April 4, 2012. ... G Ronnie Price sat out because of a broken nose and flu. Jeremy Lin started in his place.\nClippers: Redick's four-point play in the second quarter was his fifth of the season, tops in the league. ... The Clippers are 2-0 against the Lakers this season. ... New Dodgers shortstop Jimmy Rollins, boxer Floyd Mayweather and Kardashian sisters Khloe and Kendall attended.\nDANCING BALLMER\nClippers owner Steve Ballmer was gyrating during Fergie's performance of \"LA Love\" with a flash mob between the first and second quarters.\n\"He danced exactly how I expected him to,\" a smiling Griffin said before quickly adding, \"but the enthusiasm is amazing.\"\nPaul agreed, saying, \"He was feeling good tonight. It's cool to see how much fun he's having.\"\nThe Clippers missed three of their first four shots to start the second, leading Rivers to say, \"It probably distracted the whole team.\"\nAsked to rate Balllmer's dance moves, Rivers said, \"No comment. Our relationship is too new.\"\nNO RIVALRY\nScott said he doesn't wake up before a game against the Clippers feeling like he did when the Lakers played the Celtics during his heyday.\n\"The biggest difference is they want to kind of declare LA theirs. As I said, that's not happening, either,\" he said. \"Are they the better team in LA now? Yeah, you have to give them credit. But as far as everyone trying to make this a rivalry, you can't have it be a rivalry until both teams are competing for championships.\"\nUP NEXT\nLakers: Host Orlando on Friday.\nClippers: Host Dallas on Saturday.",
  "tags_rule": [
    "TripleDouble",
    "CoachComment",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.723288",
  "pipeline_version": "v1"
}