{
  "game_id": "0022100725",
  "espn_id": "401360544",
  "date": "Jan 26, 2022",
  "matchup": "SAC @ ATL",
  "headline": "Bogdanovic, Okongwu lead surging Hawks past Kings, 121-104",
  "cleaned_body": "ATLANTA -- — Bogdan Bogdanovic scored 18 points in his return from a knee injury, Onyeka Okongwu also had 18 off the bench and the Atlanta Hawks recovered from a slow start to beat the struggling Sacramento Kings 121-104 on Wednesday night.\n\nThe Hawks relied on their backups for their fifth consecutive win. Atlanta’s bench outscored Sacramento’s backups 70-24, including a 41-11 advantage in the first half.\n\n“I thought they really gave us a lift,” Hawks coach Nate McMillan said of his backups. “I thought our first unit started off slow and the second unit came in and really established the defense.”\n\nHarrison Barnes led Sacramento with 28 points. The Kings suffered their fifth consecutive loss overall and 10th straight on the road.\n\nTrae Young scored 17 points with 10 assists, but he and other starters were on the bench most of the second quarter when the Hawks outscored the Kings 46-17.\n\n“Same old story tonight,\" Barnes said. “Three decent quarters and one quarter got away from us.”\n\nAfter trailing by 14 points late in the first quarter, Atlanta led 67-50 at halftime.\n\nKings rookie Davion Mitchell, a native of Hinesville, Georgia, made his second start. Mitchell filled in for Terence Davis, who is out indefinitely with tendon damage in his right wrist.\n\nMitchell took advantage of the opportunity by scoring 20 points, including 10 of Sacramento's first 16.\n\nKings interim coach Alvin Gentry said before the game he expected his players to be motivated following Tuesday night's 128-75 loss at Boston.\n\n“From just a personal pride standpoint, you have a tendency to dig in and try to play much better,” Gentry said.\n\nThe Kings' pride showed — at least in the opening period. Led by Mitchell, the Kings led 33-19 late in the first quarter.\n\nLed by Bogdanovic, Okongwu, Danilo Gallinari and Lou Williams, Atlanta's bench erased the deficit.\n\nOkongwu caught a pass from Williams with his right hand and threw down a one-handed jam to cap a 9-1 run to open the second period.\n\nBogdanovic, who returned after missing five games with right knee soreness, sank a 3-pointer to tie the game at 42 and then added two more baskets, including another 3, for a 47-42 lead.\n\n“Bogi came in and I thought was really the one that got them over the hump,” Gentry said of Bogdanovic.\n\nSacramento's biggest deficit was 30 points, at 90-60 in the third quarter.\n\nWilliams had 15 points while making each of his three 3-pointers.\n\nTIP-INS\n\nKings: Richaun Holmes scored 12 points. ... Davis was injured in a hard fall in Tuesday night's loss at Boston. He was averaging 10.4 points per game, including a career-high 35 points on Jan. 19 against Detroit and 22 points the following game against Milwaukee. ... G De’Aaron Fox (left ankle) missed his third consecutive game.\n\nHawks: The team had no players on its injury report for the first time since Jan. 3, 2020. ... F De'Andre Hunter started and had nine points in 17 minutes after being listed as questionable with lower back discomfort. ... F Jalen Johnson was recalled from G League College Park and had three points.\n\nIDEAS, ANYONE?\n\nGentry said he has tried every motivational tool he knows to spark the Kings.\n\n“I’m open for suggestions, I can tell you that right now,” Gentry said before adding, “We ain't going to give up, I can tell you. We will never quit.”\n\nNEW ROLE\n\nBogdanovic started 26 of his 28 games before Wednesday night, but appeared comfortable with the second unit.\n\n“They had a really good chemistry, even though Bogi really hasn’t played with that unit a whole lot,” McMillan said.\n\nUP NEXT\n\nKings: Continue a five-game road trip at Philadelphia on Saturday.\n\nHawks: Host Boston on Friday night.\n\n------",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.855129",
  "pipeline_version": "v1"
}