{
  "game_id": "0021400512",
  "espn_id": "400578804",
  "date": "Jan 05, 2015",
  "matchup": "CHI vs. HOU",
  "headline": "Jimmy Butler's defense, big shots help Bulls drop Rockets, stay on roll",
  "cleaned_body": "CHICAGO -- Whether he is emerging as an MVP candidate or not, Jimmy Butler isn't sure. The only thing that matters to him is the Chicago Bulls keep winning.\nPau Gasol had 27 points and 14 rebounds, Butler scored 22 points and the Bulls won for the 13th time in 15 games, rallying to beat the Houston Rockets 114-105 on Monday night.\nDerrick Rose added 19 points and nine assists. Nikola Mirotic finished with 17 points.\nButler contained NBA scoring leader James Harden in the second half while making some big shots, and the Bulls outscored the Rockets 19-5 over the final 3:19.\n\n\"I don't know,\" Butler said. \"We just got a really good team. Everybody showed up tonight.\"\nJosh Smith led Houston with 21 points. Harden scored only three of his 20 in the second half, missing all nine shots, and the Rockets lost for the fourth time in six games.\nA leading candidate for Most Improved Player, Butler is starting to enter the MVP discussion because of performances like this. He was particularly good in the closing minutes, scoring five points and taking a charge against Harden during the game-ending rally. That helped the Bulls wipe out a five-point deficit.\nMirotic also hit a 3 and scored five points during that stretch.\nIt was 100-95 before Gasol converted a three-point play off a putback with 3:19 left to start the winning rally.\nButler tied it at 100-all with 2:56 remaining and drew a charge on the perimeter by Harden, who then fouled Gasol as he attempted a jumper. Gasol made both free throws to give the Bulls a 102-100 lead with 2:06 left.\nSmith, who signed with Houston on Dec. 26 after being released by Detroit, answered with a 3 to give the Rockets a one-point lead. But Butler responded with one of his own to put Chicago back on top.\nA driving Rose then got fouled by Patrick Beverley and hit both free throws to make it 107-103 with 1:07 left.\nAfter Harden missed a 3, Mirotic made his attempt to make it 110-103 with 39.6 seconds remaining. That sealed Chicago's sixth straight win against the Western Conference.\nThe Bulls got 12 blocks -- six from Noah -- and hit 27 of 30 free throws. The Rockets attempted just five foul shots, one more than the franchise low.\n\"We just didn't execute down the stretch,\" Smith said. \"We played our butts off for about 40, 44 minutes of that game and then down the stretch we just couldn't find a way to execute. Even though the free throw discrepancy was massive, we still had an opportunity to win that game.\"\nGasol, who scored a season-high 29 in Saturday's overtime win against Boston, got off to a strong start in this one.\nHis 18 points in the first quarter were two shy of a career high. He scored 20 in the half, but the game was tied 62-all at the break.\n\"We're doing great. We're showing great quality on the floor,\" Gasol said.\nHONORING SCOTT\nThere was a moment of silence before the game for Stuart Scott, the ESPN sportscaster who died Sunday following a lengthy fight against cancer.\nTIP-INS\nRockets: Harden was selected the Western Conference Player of the Month for December after averaging 30.6 points while leading the Rockets to a 9-5 record. He is the first Houston player to win the award since Yao Ming in January 2008. Harden entered Monday's game averaging a league-leading 27.2 points, two more than Cleveland's LeBron James. ... Houston attempted a franchise-low four free throws at Denver on January 27, 1978.\nBulls: Mirotic was selected Eastern Conference Rookie of the Month for December. He scored 27 in a win over Memphis and averaged 9.9 points and 5.7 rebounds for the month. ... F Mike Dunleavy Jr. missed his second consecutive game because of a sprained right ankle. He was injured in Thursday's victory over Denver.\nUP NEXT\nRockets: At Cleveland on Wednesday.\nBulls: Host Utah on Wednesday.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.621248",
  "pipeline_version": "v1"
}