{
  "game_id": "0022100223",
  "espn_id": "401360047",
  "date": "Nov 17, 2021",
  "matchup": "CHI @ POR",
  "headline": "Lillard rallies Blazers to 112-107 victory over Bulls",
  "cleaned_body": "PORTLAND, Ore. -- — Larry Nance Jr. certainly heard the home fans chanting his name when he sank a pair of free throws with 12 seconds left to help the Trail Blazers beat the Bulls.\n\n“It was incredible,” Nance said. “You know, it's only Game 16 here for me. So I appreciate it more than they know. I genuinely do.”\n\nDamian Lillard struggled at the start but warmed up to finish with 22 points and 10 assists, rallying Portland to a 112-107 victory over Chicago on Wednesday night.\n\nJusuf Nurkic added 18 points and 12 rebounds for the Blazers, who trailed by 20 in the first half but improved to 7-1 at home.\n\nZach LaVine had 30 points and DeMar DeRozan added 22 for the Bulls, who had won four of five.\n\n“We just played a little lackadaisical, went through the motions and we let them get back into the game,” LaVine said.\n\nPortland closed to 85-81 going into the final quarter and the teams wrestled for the lead down the stretch.\n\nLillard's 3-pointer put Portland in front 102-98 and Nurkic dunked to extend it.\n\nLonzo Ball's layup with three minutes to go narrowed the gap to 104-102. Lillard answered with a basket, but LaVine's 3-pointer made it a one-point game and his layup put Chicago back on top 107-106.\n\nLillard made free throws and Portland reclaimed the lead. After DeRozan missed a jumper on the other end, Nance got the rebound and was fouled. He sank his free throws with 12 seconds left to put Portland up 110-107.\n\nThe Moda Center crowd chanted “Larry! Larry!” and the Bulls couldn't catch up. Nance finished with 16 points and nine rebounds off the bench.\n\n“This team is capable of some amazing things when we put our minds to it,” Nance said. “I thought the effort was great from everybody from top to bottom.”\n\nBlazers first-year coach Chauncey Billups said the team is coming together.\n\n“I think that we're just starting to as a group just get to know each other and how to play with certain guys,” Billups said. \"That's starting to happen. We still have a ways to go with that.\"\n\nLillard (abdomen) and Norman Powell (left ankle) were both questionable for Portland going into the game, but started. Powell finished with 18 points.\n\nDeRozan has been on a tear this season, averaging 26.9 points a game to rank fourth in the NBA. He averaged 35.5 points in Chicago’s past two games, against the Clippers and Lakers.\n\nHis 3-pointer put the Bulls up 55-41 before LaVine scored on a pull-up jumper and Chicago went on to lead 63-48 at the break.\n\nNance Jr.'s 3-pointer pulled the Blazers within single digits at 76-67 with just under five minutes to go in the third quarter.\n\nPowell hit a 3-pointer from the corner and Lillard added a driving layup before Powell made another 3 to get the Blazers to 79-75.\n\nLillard was cold at the start, going 1 for 6 from the field in the opening half. The six-time All-Star has averaged just 20.3 points this season, after finishing last year with an average of 28.8.\n\n“I think we might need to start our games at 8 o'clock instead of 7, because that's when we start playing,” Billups said.\n\nPortland was coming off a victory over the Raptors at home after a 1/3 road trip.\n\nVUCEVIC STILL OUT\n\nBulls coach Billy Donovan said Nicola Vucevic, who missed his fourth game after testing positive for COVID-19, has not yet entered the league protocol's cardiovascular testing phase. Vucevic entered the protocol on Nov. 11. Vucevic had five double-doubles in his last six games before testing positive. Overall he's averaging 13.6 points and 10.9 rebounds this season.\n\nTIP-INS\n\nBulls: Wednesday's game was the fourth of a five-game road trip. ... LaVine and DeRozan have each scored 20 or more points 12 times this season.\n\n“It was a game we definitely feel like we should have won. We were in control of the game the whole time,” LaVine said. “We feel like we gave one away, but give them credit for fighting back. We’ve done that all year.”\n\nTrail Blazers: Portland split the series with the Bulls 1-1 last year, with both teams collecting road wins. ... Lillard became the franchise leader for made free throws in the first half, surpassing Clyde Drexler.\n\nUP NEXT\n\nThe Bulls wrap up their road trip at Denver on Friday night.\n\nThe Trail Blazers host Philadelphia on Saturday night.\n\n------",
  "tags_rule": [
    "DoubleDouble",
    "CoachComment",
    "MomentumShift"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.399894",
  "pipeline_version": "v1"
}