{
  "game_id": "0021700213",
  "espn_id": "400974964",
  "date": "Nov 15, 2017",
  "matchup": "POR vs. ORL",
  "headline": "Lillard has 26 points to lead Blazers over Magic 99-94",
  "cleaned_body": "PORTLAND, Ore. --  Shabazz Napier is clearly comfortable in his role this season.\n\n\"I think you just go out there and play with a free mind, and just enjoy it,\" said Portland's reserve guard, who had a season-high 19 points in the Trail Blazers' 99-94 victory over the Orlando Magic on Wednesday night.\n\nDamian Lillard led the Blazers with 26 points, 11 rebounds and seven assists, but it was Napier who was the difference as Portland went to a three-guard lineup. Napier was 5 for 5 from 3-point range.\n\n\"He killed us. Five for five from the 3, played a terrific basketball game,\" Magic coach Frank Vogel said about Napier. \"They went smaller than we were. They went small, but we went even smaller.\"\n\nCJ McCollum added 24 points and Portland finished 4-2 on its six-game homestand.\n\nEvan Fournier had 22 points for the Magic, who lost their third straight. Nikola Vucevic had 11 points and 10 rebounds.\n\nThe Magic trailed by 11 points during the third quarter, but Fournier's 3-pointer put the Magic up 81-80 with 6:52 left in the game. Portland reclaimed the lead on consecutive baskets from Jusuf Nurkic and Maurice Harkless.\n\nMcCollum's 3-pointer extended the Blazers' lead to 87-83 with 4:30 to go. After Napier's 3-pointer, McCollum added another, and the Blazers led 95-86 with 1:43 left. Orlando couldn't catch up.\n\nThe Magic were playing the last of a four-game road trip. Orlando went into the game with two straight losses, including 110-100 at Golden State on Monday.\n\nThe Blazers were coming off a confidence-boosting 99-82 victory over the Denver Nuggets on Monday that snapped a two-game skid. Portland's offense had been stagnant, especially in close games.\n\nBlazers coach Terry Stotts tweaked the starting lineup, inserting rookie Caleb Swanigan, who made his second straight start. But after playing just five minutes in the first half, Pat Connaughton started the second and the Blazers found success with three guards.\n\nNapier took on the role in the fourth quarter as the Blazers went small.\n\nNapier, a first-round pick out of UConn in 2014 who has played for three different teams, averaged 4.1 points and 9.7 minutes last season. In the past four games for the Blazers, he's averaging 12.5 points and more than 20 minutes a game.\n\nOrlando was without J.J. Augustin (left hamstring) for the seventh straight game and Jonathan Isaac (right ankle) for the second game.\n\nThe Magic stretched its lead to 38-26 early in the second quarter on Jonathan Simmons' layup. But the Blazers found their shot and ended the half on a 17-0 run, capped by McCollum's driving layup, to lead 51-47 at the break. McCollum led all scorers at halftime with 16 points.\n\nThe two teams both scored 24 points in the third quarter, and Portland led 75-51 going into the final period. Shelvin Mack made consecutive baskets to pull the Magic within 79-78.\n\nTIP INS:\n\nMagic: Fournier has scored in double figures a team-high 14 times this season. ... Simmons went into the game ranked fourth in the NBA for scorers off the bench, averaging 15.1 points. He finished with 16 against the Blazers. ... Vucevic's double-double was his fifth this season.\n\nTrail Blazers: Lillard passed Mychal Thompson (9,215 points) for eighth on the team's all-time scoring list. ... Al-Farouq Aminu missed his sixth game with a right ankle injury.\n\nMORE SHABAZZ: Napier is just the third Blazer to make five 3-pointers off the bench when making all of his attempts. He's the only reserve to do it in the league this season.\n\nUP  NEXT\n\nMagic: Returns home to host Utah on Saturday night.\n\nBlazers: Visits Sacramento on Friday night.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.555552",
  "pipeline_version": "v1"
}