{
  "game_id": "0022101196",
  "espn_id": "401361015",
  "date": "Apr 07, 2022",
  "matchup": "CHA vs. ORL",
  "headline": "Ball leads Hornets past Magic after 3 players ejected",
  "cleaned_body": "CHARLOTTE, N.C. -- — LaMelo Ball had 26 points, nine assists and eight rebounds, and the Charlotte Hornets routed the short-handed Orlando Magic 128-101 on Thursday night to get back on the right track after two lopsided losses.\n\nTerry Rozier added 22 points as Charlotte pulled within one game of the Atlanta Hawks and Brooklyn Nets, who are tied for eighth place in the Eastern Conference with two games remaining in the regular season. The Hornets have already locked up a spot in the play-in tournament and are hoping to improve their seed.\n\nChuma Okeke had 20 points and Moritz Wagner scored 17 for Orlando, which has lost seven of its last eight games.\n\nThe game included a shoving match between several players in the fourth quarter with the Hornets up by 25 points, resulting in Orlando’s Robin Lopez and Admiral Schofield and Charlotte’s Montrezl Harrell being ejected. Lopez and Schofield waved to the crowd as they left the floor.\n\nThe win assures Charlotte (41-39) its first non-losing season since 2015-16.\n\nThe Hornets also broke the previous franchise record for points scored (9,081) in a season set in 2018-19.\n\nBut offense hasn't been the issue.\n\nCharlotte entered the game having surrendered 144 points in back-to-back road losses to the Philadelphia 76ers and Miami Heat. They turned the corner on Thursday night, holding the Magic to 40% shooting from the floor.\n\n“We were trying to pay attention to the details on the defensive end,” Rozier said. “If we take care of what we know we can take care of on defense, (then) that becomes our best offense.\"\n\nThe Hornets built a 23-point lead in the first half and remained in control the rest of the way. Coach James Borrego began to empty the bench with about 4 minutes to play.\n\nThe highlight of the night came when Ball made a steal at midcourt, and went between the legs with the ball in mid-air and threw a perfect pass off the glass to the trailing Harrell for a two-handed dunk.\n\n“It’s a cool play,” Ball said. “I saw (Harrell) coming and just threw it off the glass.”\n\nJUST THE WWE\n\nEmotions were running high most of the night.\n\nCharlotte’s Cody Martin dunked over Wagner early on and several Hornets, including P.J. Washington, began talking trash from the sideline. Wagner responded on the next possession with a reverse dunk and proceeded to stare down the Hornets bench.\n\nThat preceded a fourth quarter dustup when Jalen McDaniels fouled R.J. Hampton on a drive. Several players, including Harrell and Lopez, began pushing each other under the basket, but no punches appeared to be thrown. Officials met for more than a minute before the ejections were handed out.\n\n“WWE, ain't nobody fighting,” Rozier said with a laugh.\n\nOkeke said coach Jamahl Mosley told Magic players to keep playing after the altercation.\n\n“He told us to play the right way and stick together and finish the game out.” he said.\n\nBALL'S 3-POINTER\n\nBall became the youngest player in NBA history to reach career 300 made 3-pointers.\n\n“It don't mean nothing to me,” Ball said. “I always can always come in and play my game. Every time I step on the court I feel like I can (make 3-pointers), so I just keep shooting.”\n\nHONORING BONNELL\n\nMiles Bridges was voted the winner of the inaugural Rick Bonnell Award given to the Hornets player who best works with the media. Bonnell was a longtime NBA sports writer for the Charlotte Observer who died last year.\n\nTIP INS\n\nMagic: Were without a number of key players including Franz Wagner (right ankle sprain), Cole Anthony (left toe sprain), Bol Bol (right foot surgery) and Gary Harris (personal reasons).\n\nHornets: Gordon Hayward's left foot clearly hasn't completely healed. After missing 22 games with a left ankle sprain, Hayward returned to play 17 minutes against Philadelphia on Saturday, but he has since missed the last two games since with left foot soreness.\n\nUP NEXT\n\nMagic: Host Heat on Sunday night.\n\nHornets: Visit Bulls on Friday night.\n\n------",
  "tags_rule": [
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.010406",
  "pipeline_version": "v1"
}