{
  "game_id": "0021301223",
  "espn_id": "400490096",
  "date": "Apr 16, 2014",
  "matchup": "CHI @ CHA",
  "headline": "Kemba Walker guides Bobcats over Bulls in OT",
  "cleaned_body": "CHARLOTTE, N.C. -- Al Jefferson knows few people will be giving the Charlotte Bobcats a chance to upset the Miami Heat in the first round of the Eastern Conference playoffs.\nThat doesn't matter to the veteran center.\n\n\"They didn't give us a chance in October, if you remember,\" Jefferson said. \"We were going to be last in the league, right? So we don't worry about what is said outside of these walls right here.\"\nThe Bobcats defeated the Chicago Bulls 91-86 in overtime on Wednesday night to finish the season 43-39 and as the seventh seed in the East. Not bad for a team that was a combined 28-120 over the previous two seasons.\nBut now there is the monumental task of beating the two-time defending NBA champions, something the Bobcats haven't done in the LeBron James era.\nThe Heat are 15-0 against the Bobcats since James signed.\n\"It's going to be a challenge, but it's the playoffs and anything can happen,\" Bobcats guard Kemba Walker said. \"It's not going to be easy. We're going to go out there and give it all we got just like we have been doing all year.\"\nThe series starts on Sunday.\n\"It's going to be a dogfight,\" Jefferson said.\nThe Bulls finished as the No. 4 seed in the East and will face the Washington in the first round after the Wizards leap-frogged the Brooklyn Nets on the final night of the season to grab the fifth spot.\n\n\"They are a great transition team with a lot of shooters and size,\" Bulls forward Carlos Boozer said. \"To make the playoffs you have to be a good team, and they're a good team.\"\nAfter missing a jumper that would have won the game in regulation, Walker scored eight of his 22 points in overtime to help the Bobcats beat the Bulls for the first time this season and finish the regular season with eight wins in their final nine games.\nJefferson added 10 points and 18 rebounds for Charlotte, and Chris Douglas-Roberts finished with 13 points after being held scoreless for the first three quarters.\nJosh McRoberts made a key play in overtime, his block of D.J. Augustin's 3-point attempt leading to a fast-break layup by Walker that gave the Bobcats an 88-81 lead with 1 minute left.\n\"This was the type of game we needed going into the playoffs,\" Jefferson said. \"That's a playoff team and that's a playoff game that we played tonight.\"\nJoakim Noah finished with 14 points and 13 rebounds for Chicago, Boozer added 14 points and 11 rebounds, and Augustin scored 17 points.\nThe Bulls came in having won 10 of their last 11 against the Bobcats, including five straight in Charlotte by an average of 22 points per game.\nAnd it looked early on like this would be another road blowout for Michael Jordan's former team.\nThe Bobcats started the game cold, missing 21 of their first 29 shots from the field to fall behind 33-23. But Jefferson hit a short jumper and the Bobcats made 11 straight shots to take 43-37 lead at halftime.\nAfter a back-and-forth third quarter, the Bulls entered the final period leading 60-59.\nEvery time Chicago attempted to pull away, Douglas-Roberts seemed to have an answer. Two nights after a buzzer-beater to sink the Atlanta Hawks, Douglas-Roberts had 12 points in the fourth period, including a left-handed layup off an offensive rebound with 3:42 left to tie the game at 75.\nAfter Taj Gibson missed a jumper with 25 seconds left, Walker had a chance to win the game but missed an open step-back jumper from 18 feet at the buzzer.\n\"I had a great look at it,\" Walker said. \"Just missed it.\"\nWalker's big overtime helped the Bobcats improve to 20-9 since the All-Star break.\n\"The guys have done a great job,\" Bobcats coach Steve Clifford said. \"We won't think about it right now, but when we reflect back on the year we will. We didn't have a definitive number because I didn't know how good we could be. It's a good group and hopefully we have a lot more in us. It was good to see the locker room tonight. They've worked hard. They've been grinding from the jump.\"\nGame notes\nJefferson was taken to the locker room for observations with a left knee contusion midway through the third quarter. He did return to the game and played the entire fourth quarter. ... With the win, the Bobcats avoided a season series sweep by the Bulls.",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.464882",
  "pipeline_version": "v1"
}