{
  "game_id": "0021700018",
  "espn_id": "400974771",
  "date": "Oct 20, 2017",
  "matchup": "POR @ IND",
  "headline": "McCollum's scores 28 in Blazers' 114-96 win over Pacers",
  "cleaned_body": "INDIANAPOLIS -- If the first two games are any indication of the type of team the Portland Trail Blazers will be in 2017-18, they've put the rest of the NBA on notice.\nStarting its season on the road, Portland has blown out its first two opponents by a combined 68 points, including Friday night's easy win over the Indiana Pacers.\nCJ McCollum scored 28 points on 12-of-18 shooting to lead the Blazers past the Pacers 114-96.\nWith Indiana starting center Myles Turner out with a concussion, McCollum teamed with backcourt mate Damian Lillard to take advantage of an inexperienced Pacers interior defense.\nLillard did most of his damage in the paint in the first half. McCollum picked it up in the second half, scoring Portland's final 12 points of the third quarter and giving the Blazers a 91-73 lead.\n\"Once I see it go in a few times,\" McCollum said, \"that basket gets a little bit bigger for me.\"\nThe Portland pair made it look easy at times as they drove to the basket against rookie T.J. Leaf and second-year player Domantas Sabonis. Lillard scored 11 of his 18 points in the first quarter, and the Blazers led 62-52 at halftime.\nEvan Turner scored 17 points off the bench, and his run of eight straight points in the second quarter helped the Blazers stay ahead with Lillard resting. Turner led a 15-3 run that allowed Portland to gain control.\nLillard was especially pleased with Portland's defensive effort.\n\"We knew (the Pacers) had 140 on opening night,\" he said. \"But it's opening night, you're excited, it's the first game, you're on your home court and a lot of shots go in. But it's hard to do that twice -- score 140 points back-to-back in the NBA. We came in here ready to guard.\"\nThe Pacers hit seven of their first nine shots but finished the first quarter by making two of their final 12. Leaf and Victor Oladipo scored 17 points apiece for the Pacers. Darren Collison added 14 points.\nOladipo said not having Turner was a key to Indiana's repeated defensive breakdowns.\n\"It was a little different today, just because Myles didn't play,\" Oladipo said. \"It is what it is. We'll learn from it and move on.\"\nBIGGIE'S HOMECOMING\nFormer Purdue standout Caleb \"Biggie\" Swanigan, Portland's first-round pick (26th overall), returned to Indiana in an NBA uniform for the first time. Last season's Big Ten Player of the Year was introduced to cheers and scored two points. He had eight points in Portland's season-opening win.\nNOT JUST A THROW-IN\nSabonis, acquired in the trade that sent Paul George to Oklahoma City, earned his first start of the season. The second-year player had three points and eight rebounds in 29 minutes. He scored 16 points off the bench in the Pacers' season-opening win over Brooklyn.\nTIP-INS\nBlazers: Portland has won eight of its last 10 games against Indiana. ... McCollum saw his first action after serving a one-game suspension for leaving the bench during the Blazers' final preseason game.\nPacers: After attempting 34 3-pointers in their season opener, the Pacers had 18 tries from beyond the arc on Friday, connecting on just four. ... The Pacers haven't started 2-0 since the 2013-14 season.\nUP NEXT\nBlazers: Portland wraps up its three-game trip Saturday at Milwaukee. The Bucks swept the season series last year against Portland.\nPacers: Indiana plays Saturday at Miami. The Heat have won their last five regular-season home games over the Pacers and 11 of 12 dating to 2010-2011.\n---\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "ThreePointExplosion"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.419178",
  "pipeline_version": "v1"
}