{
  "game_id": "0021700451",
  "espn_id": "400975202",
  "date": "Dec 19, 2017",
  "matchup": "SAC @ PHI",
  "headline": "Randolph powers Kings past slumping 76ers 101-95",
  "cleaned_body": "PHILADELPHIA --  Zach Randolph and Vince Carter have been playing for so long that some of their teammates were toddlers when they broke into the NBA.\n\nThat double dose of experience worked out quite well for Sacramento on Tuesday night.\n\nRandolph scored 27 points and Carter had two key plays late in the game, helping the Kings to a 101-95 victory over the slumping Philadelphia 76ers.\n\nBuddy Hield had 24 points and Frank Mason III finished with 16 for Sacramento, which came back from a 16-point second-half deficit.\n\n\"Zach started us out and really carried us for a while,\" Kings coach Dave Joerger said. \"He was really, really terrific.\"\n\nThe 36-year-old Randolph was rejuvenated after he rested during Sunday's 108-93 loss at Toronto. He made 12 of 19 shots and grabbed five rebounds.\n\n\"He's an amazing low-post threat, for a long period of time,\" Philadelphia coach Brett Brown said.\n\nBesides putting up solid numbers -- Randolph entered leading the team in scoring and rebounding at 15.2 points and 7 boards per game -- he is enjoying his role as veteran leader.\n\n\"We get along well,\" he said. \"These kids are working, they're playing hard, and it's showing on the court. We believe in them.\"\n\nBen Simmons had 13 points, 12 rebounds and nine assists for Philadelphia, which lost for the seventh time in eight games while playing without center Joel Embiid for the second straight night due to a back injury. Robert Covington led the 76ers with 17 points.\n\nPhiladelphia looked out of sync without Embiid and Sacramento took advantage.\n\nHield gave the Kings a 79-78 lead with a 3-pointer with 9:48 remaining. Carter made a full-court outlet pass to Garrett Temple for a layup that made it 92-86 Sacramento with 4:18 left.\n\nThe 40-year-old Carter  made another crucial play down the stretch, hustling for an offensive rebound that led to Randolph's jumper with 1:59 to play.\n\n\"Coach trusts me to be solid and consistent, not make mistakes and help our guys when I can,\" Carter said. \"I've been in big situations so I enjoy being on the court.\"\n\nSimmons answered with a driving basket that made it 96-92, but he couldn't convert the free throw after being fouled and the rally fizzled from there.\n\n\"I don't think we've been focusing down the stretch -- missing shots, not calling the right plays,\" Simmons said. \"It's just little things like that. It comes down to us focusing, and making sure we're committed to defense and offense at the same time.\"\n\nEMBIID'S ABSENCE\n\nEmbiid did not travel with the team to Chicago for Monday's 117-115 loss to the Bulls. He was expected to play against the Kings on the second night of back-to-back games, but Brown said the team's medical staff advised him to keep the 7-foot center on the sideline.\n\nThe injury has kept Embiid out for four of the last six games. Brown said Embiid's back \"is still a little bit sore.\"\n\nBROWN ON OKAFOR\n\nJahlil Okafor, whom Philadelphia traded to Brooklyn earlier this month, made headlines in New York on Tuesday for saying he was glad to be with an organization that had \"an actual NBA coaching staff.\"\n\n\"Jahlil knows what we did here,\" Brown said before the loss. \"It's a young person who gave a quote. ... I think everybody understands how we treat people here and the attention he received while he was here.\"\n\nTIP-INS\n\nKings: G George Hill (illness) did not play. ... Malachi Richardson had three points in 19 minutes after not playing Sunday due to an ankle injury. ... G De'Aaron Fox was back in the lineup after missing Sunday's game at Toronto due to a bruised right thigh, but he didn't return after re-injuring it in the first half. He had two points in 11 minutes.\n\n76ers: Embiid last played in Philadelphia's nationally televised game against Oklahoma City on Friday night, finishing with 34 points, eight rebounds and six assists in the 76ers' 119-117 triple-overtime loss. ... Prior to the game, the 76ers honored Philadelphia native and South Carolina women's basketball coach Dawn Staley. The Gamecocks play at Temple on Thursday night. ... J.J. Redick left after injuring his hamstring. He had eight points in 15 minutes.\n\nUP NEXT\n\nKings: Finish four-game road trip at Brooklyn on Wednesday night.\n\nSixers: Host Toronto on Thursday night in the first game of a home-and-home series. Philadelphia will play at the Raptors on Saturday night.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.385622",
  "pipeline_version": "v1"
}