{
  "game_id": "0021400611",
  "espn_id": "400578903",
  "date": "Jan 19, 2015",
  "matchup": "CHA vs. MIN",
  "headline": "Hornets beat Timberwolves 105-80 in Jefferson's return",
  "cleaned_body": "CHARLOTTE, N.C. --  It's been a long time since Al Jefferson has come off the bench in an NBA game.\n\nThe big man didn't seem to mind Monday, however.\n\nJefferson returned from a groin injury, scoring eight points and pulling down five rebounds as the Charlotte Hornets defeated the Minnesota Timberwolves 105-80. It's the first time since Dec. 4, 2006 -- a span of 544 games -- that Jefferson didn't start in a game in which he played.\n\n\"Before I started starting all of the time, coming off the bench was fun because you get a chance to see how game was going and because you're playing against the backup center instead of the starting center,\" said Jefferson, who played 25 minutes after missing nine games. \"So I looked at it like that. It was fun.\"\n\nGerald Henderson scored 17 points and Brian Roberts added 16 for the Hornets, who have won seven of their last eight games.\n\nIn all, Charlotte's bench outscored Minnesota 52-31, including 28-3 in the pivotal first half. Reserves Gary Neal had 12 points and P.J. Hairston had 11 for Charlotte.\n\nThaddeus Young had 18 points to lead Minnesota, which failed in its quest to win back-to-back games for the first time this season. Andrew Wiggins, the top pick in the NBA draft last year, had 12 points on 3 of 13 shooting and was limited to two rebounds for the Timberwolves (7-33).\n\nThe 6-foot-10, 289-pound Jefferson said he felt great physically, although he did get a little winded late in the second half.\n\nHe struggled early, missing a couple of easy shots from the low post before starting to regain his old form.\n\nThe 2014 third-team all-NBA selection used a spin move in the low post and made a teardrop shot to get back on track in the second quarter. In the third, he scored off a pick-and-roll with Lance Stephenson, and in the fourth knocked down a step-back 18-foot jumper.\n\nJefferson said that, in hindsight, sitting out nine games was the right thing to do.\n\n\"There were games where I couldn't jump and I felt like I was hurting my teammates instead of helping them,\" said Jefferson, who finished 4 of 11 from the field.\n\nHornets coach Steve Clifford said before the game he expected Jefferson to play about 15 minutes. And when Stephenson returned from a pelvic strain, he saw 26 minutes in his third game back.\n\n\"The only way those two guys are going to get in any kind of game condition is if they get to play,\" Clifford said. \"That was a perfect opportunity to let them go a little longer.\"\n\nThe Hornets jumped out to a 50-33 halftime lead, and the Timberwolves never mounted a challenge after being outscored 27-13 in the second quarter. Charlotte stretched the lead to 30 by the end of the third quarter.\n\n\"They mauled us, really,\" Timberwolves coach Flip Saunders said. \"They're a very good defensive team. We did not react the right way to their physicality.\"\n\nTIP-INS\n\nTimberwolves: Wiggins has scored in double figures in 14 straight games. ... The Timberwolves went 2-2 on their current road trip.\n\nHornets: Charlotte went 12 of 22 from 3-point range after making just 2 of 15 attempts Saturday against Indiana.\n\nGETTING DEFENSIVE\n\nCharlotte has forced 37 turnovers and held opponents to a combined 151 points in the last two games.\n\n\"Our defense was really good and we moved the ball,\" Clifford said.\n\nUP NEXT\n\nTimberwolves: Host Dallas on Wednesday.\n\nHornets: Host Miami on Wednesday.",
  "tags_rule": [
    "EarlyRun",
    "ReturnFromInjury",
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.029089",
  "pipeline_version": "v1"
}