{
  "game_id": "0021300734",
  "espn_id": "400489607",
  "date": "Feb 05, 2014",
  "matchup": "MIL @ DEN",
  "headline": "Chandler leads Nuggets past Bucks, 110-100",
  "cleaned_body": "DENVER --  The Denver Nuggets have played pretty well against the NBA's best teams. It's the games against the league's struggling franchises that have proved to be an issue.\n\nIt almost cost them again against the Milwaukee Bucks. A late charge and a fortunate bounce saved Denver from another disappointing ending.\n\nWilson Chandler scored seven of his 24 points in the final 1:52 and the Nuggets held on for a 110-100 victory over the Bucks on Wednesday night.\n\nTy Lawson had 18 points and 13 assists and Randy Foye scored 20 points for the Nuggets, who avoided another embarrassing home loss to a sub-.500 team.\n\n\"It would have been a sad day had we lost this one, especially when Milwaukee was down and on the road,\" Lawson said.\n\nDenver has stepped up against good teams this season and played some of its worst games against losing clubs, especially at home. The Nuggets, who were 38-3 at Pepsi Center last season, watched Utah, Philadelphia, Cleveland and Charlotte leave Denver with unlikely victories.\n\nComing off a buzzer-beating 116-115 win over the Los Angeles Clippers on Monday, Denver coach Brian Shaw's fears of a letdown were realized when Milwaukee scored the first seven points of the game.\n\n\"For whatever reason, not bringing the same energy,\" he said. \"We don't look forward to the matchups when those marquee names out there. We are not going to meet the challenge. We have to find a way to bring it consistently regardless who our opponent is.\"\n\nLarry Sanders had career-high 25 points and a season-best 15 rebounds for short-handed Milwaukee, and Khris Middleton also scored 25.\n\nThe Bucks had nine available players and then lost guard Luke Ridnour to back tightness in the second quarter. Ersan Ilyasova played a little more than four minutes in the second half and guard Nate Wolters played 27 minutes despite fighting off a cold and a sore back most of the game.\n\n\"We just came up short,\" Milwaukee coach Larry Drew said. \"Finally just ran out of bodies.\"\n\nMilwaukee was trying for its first two-game winning streak of the season after Monday's thrilling win over New York. Brandon Knight's 3-pointer with 1.4 seconds left gave the Bucks the win, and they brought the momentum into Wednesday's game.\n\n\"We had it. We were pretty high to start the game and we battled well,\" Sanders said. \"They just made some good plays down the stretch to get them over the hump. They were real aggressive attacking the basket and it worked in their favor.\"\n\nEven with the short bench, Milwaukee stayed right with Denver for much of the game. Sanders tipped in a missed shot to give the Bucks a 57-53 lead early in the third quarter.\n\nThe Nuggets then buckled down. Five straight points by Lawson sparked a 14-3 run that lifted Denver to a seven-point lead. Kenneth Faried and J.J. Hickson combined for the Nuggets' next 10 points as the lead grew to 77-65 midway through the third.\n\nHickson finished with 19 points and 10 rebounds.\n\nFoye hit a 3-pointer and a pair of free throws to give the Nuggets an 82-70 after three.\n\nQuincy Miller scored five quick points at the start the fourth, helping increase the lead to 18. Milwaukee went on a 17-5 run to get within 99-96 with 2:13 remaining but Chandler scored four straight to make a seven-point game with 1:28 left.\n\nChandler's basket that made it 103-96 bounced off the front of the rim and off the top of the backboard before falling in.\n\n\"I just shot it short,\" he said. \"I thought when I released it I was good, it was just short.\"\n\nMilwaukee couldn't answer the late run.\n\n\"You figure a team like that would give up, but give them credit, they kept fighting and made it a game,\" Chandler said.\n\nGame notes Foye had a career-high four blocked shots. ... Milwaukee G Gary Neal (back spasms) did not play. ... The Nuggets did not hold a shootaround Wednesday morning because of extremely cold temperatures and an extended team event Tuesday. ... Milwaukee F Caron Butler (sprained left ankle) did not make the trip to Denver.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.203418",
  "pipeline_version": "v1"
}