{
  "game_id": "0021700592",
  "espn_id": "400975338",
  "date": "Jan 08, 2018",
  "matchup": "TOR @ BKN",
  "headline": "DeRozan helps Raptors beat Nets in OT after Lowry hurt",
  "cleaned_body": "NEW YORK --  Toronto's big lead was lost, and its point guard was being carried off the court after a painful fall.\n\nDeMar DeRozan made sure at least the game was won.\n\nDeRozan scored 35 points, including a go-ahead three-point play with 26.1 seconds left in overtime, and the Raptors shook off a late injury to Kyle Lowry to beat the Brooklyn Nets 114-113 on Monday night.\n\nThe Raptors blew a 10-point lead in the final 4 1/2 minutes of regulation but recovered to beat Brooklyn for the 10th straight time and win its fifth in a row overall.\n\n\"We rely on Kyle for everything he does for us, to be the general out there on the court,\" DeRozan said. \"And it's tough when he's not out there but we got to figure it out.\"\n\nLowry got hurt when he flipped backward over the Nets' Quincy Acy while going for an offensive rebound in OT. He got up and went back down with what appeared to be pain in both his back and legs, so much so that teammates trying to carry him off the court had to stop because it appeared Lowry was hurting too much.\n\nLowry, who crashed hard into a cameraman behind the baseline earlier in the game, had X-rays and the Raptors said he had an acute back spasm and would be re-evaluated Tuesday.\n\n\"He reminds me a lot of Gary Payton, who threw his body around and he has to play that way to be effective,\" Raptors coach Dwane Casey said. \"And we love it when he does because he was in there, getting rebounds over their guards and he got clipped on that one and hopefully he's OK.\"\n\nLowry had 18 points and 11 assists for Toronto, and Jonas Valanciunas finished with 21 points and 13 rebounds.\n\nSpencer Dinwiddie scored a career-high 31 points for the Nets, but his wild shot on a last drive went over the backboard. They have played a franchise-record five straight games decided by three or fewer points, the first NBA team to do that since San Antonio late in the 2012-13 season.\n\n\"If these close losses turn into wins, we're close to .500 ball,\" Dinwiddie said. \"We're looking at the playoffs. There's a different morale, different vibe, instead of always coming in here feeling a certain way about whatever happened on the court.\"\n\nLowry had a run of seven straight Toronto points to keep a comfortable lead for the Raptors most of the fourth quarter. But suddenly the Nets got hot from 3-point range, and eventually tied it at 107 on Allen Crabbe's drive to the basket with 9.7 seconds remaining. Crabbe was hurt on the play and had to be helped off.\n\nBrooklyn then got the first four points of OT and appeared in good shape when Lowry left, but couldn't hold off DeRozan.\n\n\"We're going to study it and figure out, `Hey, how can we close these games out,\" Nets coach Kenny Atkinson said. \"It's the hardest thing to do in professional sports, is close out a game.\"\n\nTIP-INS\n\nRaptors: Serge Ibaka finished with 11 points and 12 rebounds. ... The Raptors play Cleveland and Golden State in a three-night span later this week.\n\nNets: DeMarre Carroll was held out after injuring his right knee on the final possession of Brooklyn's loss to Boston on Saturday, but Atkinson said the Nets were fortunate the injury wasn't worse. The starting forward is day to day.\n\nDEMAR-VELOUS\n\nDeRozan won Eastern Conference player of the week honors for the third time this season after averaging an NBA-high 35.7 points in three games last week, highlighted by a franchise-record 52 points in a victory over Milwaukee on Jan. 1. DeRozan also won the award for the weeks of Nov. 13-18 and Dec. 18-24.\n\nRUSSELL'S RECOVERY\n\nD'Angelo Russell, who had left knee surgery and has been out nearly two months, practiced with the Nets' G League affiliate Monday. Neither Russell nor Atkinson knew when the starting guard would be ready to play for the Nets, but Russell was just glad to take part in what he said was a tough first practice after missing the last 26 games.\n\n\"Like I said, just getting that sweat again is what I've been looking for,\" Russell said.\n\nUP NEXT\n\nRaptors: Host Miami on Tuesday.\n\nNets: Host Detroit on Wednesday.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.098019",
  "pipeline_version": "v1"
}