{
  "game_id": "0021400873",
  "espn_id": "400579165",
  "date": "Feb 28, 2015",
  "matchup": "MEM @ MIN",
  "headline": "Gasol, Grizzlies withstand scare from Wolves in 101-97 win",
  "cleaned_body": "MINNEAPOLIS --  When Kevin Garnett was thrown out of the game, Marc Gasol went to work and Flip Saunders went looking for a rulebook.\n\nGasol had 27 points and 11 rebounds, and Mike Conley hit a big 3-pointer with 30 seconds left to lift the Memphis Grizzlies to a much-needed 101-97 victory over the Minnesota Timberwolves on Saturday night.\n\nGasol scored nine straight points in the final 4 minutes, and Conley's 3 from the wing broke a 95-all tie. Conley finished with 17 points and hit two free throws with 11 seconds left for Memphis, which had been sluggish over the previous five games.\n\n\"It's been a tough, long week,\" Gasol said of a week that included losses to the Clippers and Kings. \"We finished 3-2 for the week. I wish it was different, 4-1 or 5-0 would've been better of course, but that's the way it went, and on to the next week.\"\n\nAndrew Wiggins scored 25 points and Ricky Rubio had 13 points, 10 assists and seven rebounds for the Wolves. But Garnett was ejected early in the third quarter of his second game back in a Minnesota uniform after picking up his second technical foul for slamming the ball to the court, and Kevin Martin missed a 3-pointer from the corner that could have tied it in the closing seconds.\n\n\"Their argument was that you can't do that,\" said Saunders, the Wolves coach, with a rulebook right in front of him. \"My argument, by the rulebook states that any action has to be in resentment to the call or a no-call. What he did is he bounced the ball because he was frustrated with himself that he made a foul. In no way was it a resentment.\"\n\nZach Randolph had two points on 1-for-5 shooting in the first 42 minutes, then scored five straight against Wiggins and Adreian Payne on the block for an 86-84 Grizzlies lead.\n\nMartin, who finished with 13 points on 5-for-18 shooting, hit a 3 to tie it at 95 before Conley's clutch shot.\n\nThe Grizzlies shot 59 percent and outscored Minnesota 52-30 in the paint. But 24 turnovers led to 32 points that kept the Timberwolves in the game.\n\n\"Their hearts are in the right place, they're playing hard, but we're just making some mistakes,\" Memphis coach Dave Joerger said. \"We've got to get better.\"\n\nA second straight sellout crowd packed the arena to see Garnett, the franchise icon now back in the familiar No. 21 jersey he wore from 1995-2007. But Garnett's night was brief. He picked up a technical for arguing with referee Eric Lewis in the second quarter, then was ejected after picking up another from Bennett Salvatore in the third when Garnett slammed the ball down in frustration after getting called for a foul on Jeff Green.\n\nGarnett's ouster seemed to take the starch out of the crowd, and the Grizzlies threatened to pull away with a 10-2 run that gave them a 67-52 lead midway through the third.\n\nBut Wiggins keyed a 16-2 run that was aided by technical fouls on Gasol and Joerger seconds apart. Gary Neal capped the surge with a 3 to pull Minnesota to 69-68, and Payne's turnaround jumper gave the Wolves a 74-72 lead early in the fourth.\n\nGasol turned out to be too much. He was 4 for 4 in the fourth with 11 points, four rebounds and two assists.\n\n\"When he's that guy, then everybody else can be in the role they're supposed to be in,\" Joerger said. \"That's big-time for us.\"\n\n---\n\nTIP-INS\n\nGrizzlies: Randolph finished with seven points and 11 rebounds. ... Memphis' eight turnovers in the first quarter tied a season high for a period.\n\nTimberwolves: Neal scored 16 points off the bench. ... Nikola Pekovic played 13 minutes and scored one point. He was 0 for 5.\n\nGRIZZLIES BENCH\n\nJoerger has been unhappy with the slow starts provided by his first unit in the last week, but very pleased with his bench players. It was more of the same on Saturday night, when Nick Calathes, Beno Udrih, Kosta Koufos, Tony Allen and Jon Leuer got Memphis going in the second quarter. Allen scored 11 points and Calathes had six assists.\n\nUP NEXT\n\nGrizzlies: Host Utah on Tuesday.\n\nTimberwolves: Host the Los Angeles Clippers on Monday.",
  "tags_rule": [
    "PhysicalGame",
    "ClutchShot",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.000685",
  "pipeline_version": "v1"
}