{
  "game_id": "0022100446",
  "espn_id": "401360270",
  "date": "Dec 18, 2021",
  "matchup": "MIL vs. CLE",
  "headline": "Cavaliers beat short-handed Bucks for 6th straight victory",
  "cleaned_body": "MILWAUKEE -- — Cedi Osman scored 23 points, Darius Garland had 22 points and the Cleveland Cavaliers extended their winning streak to six games, beating the short-handed Milwaukee Bucks 119-90 on Saturday night.\n\nGarland made 10 of 13 shots to pace a Cavaliers offense that shot 50% from the floor, made 16 of 45 3-point attempts and produced 36 assists.\n\n“In order to be successful against Milwaukee, you have to move the ball,” Cleveland coach J.B. Bickerstaff said. “They did a really good job of creating shots for each other.”\n\nJordan Nwora led Milwaukee with 28 points on 11-of-21 shooting. DeMarcus Cousins finished with 12 points and 12 rebounds.\n\nThe Bucks were without any of their regular starters. Giannis Antetokounmpo, Donte DiVincenzo, Wesley Matthews and Bobby Portis are in the NBA's health and safety protocols and unavailable. Khris Middleton remained sidelined due to a hyperextended left knee, while guards Grayson Allen and Jrue Holiday, though not inactive, were held out after playing extensive minutes in a loss Friday night at New Orleans.\n\nThat left Bucks coach Mike Budenholzer with just eight healthy players.\n\nAfter falling behind by 14 after one quarter, Milwaukee didn’t even put up a shot for the first 2:30 of the second quarter and didn’t connect on one until there was 8:59 left in the half. By that point, the Cavaliers seemed to be in cruise control, leading by as many as 20 after Ricky Rubio sank an open 3-pointer with 7:21 left.\n\nMilwaukee cut the deficit to 11 heading into the break but came out flat in the third as Cleveland stretched the lead to 30 when Rubio converted a three-point play with 2:25 left in the quarter.\n\n“They made their 3s and were able to go on a real nice run,” Budenholzer said.\n\nFUN TIMES\n\nWith their victory Saturday, the Cavaliers improved to 19-12 moved into a virtual tie with Chicago for first place in the Central Division, a half-game ahead of Milwaukee.\n\n“It’s been super fun,” Garland said. “It’s not just hero ball, everybody is contributing.”\n\nCleveland won a total of 19 games two years ago during Garland's rookie season and the Cavaliers didn't win No. 19 last year until April 8 en route to a 22-50 finish.\n\n“It's early,” Garland said of the standings. “We don't get too (far) ahead of ourselves.”\n\nWORK IN PROGRESS\n\nCousins started for the second straight night and saw 27 minutes of action, his highest total since joining the Bucks last month and the most playing time he's seen since February when he played 37 minutes for Houston in a loss to the 76ers.\n\nHe's still trying to get acclimated to his new team while also trying to get his body back into game shape after not taking part in training camp or the first few months of the season, and the Bucks' recent schedule — they've played 11 games in 18 days since Cousins signed on Nov. 30 — hasn't exactly been ideal.\n\n“It's almost like there's a day off and then a game so there's been limited practice time and limited preparation,\" Cousins said.\n\nIn nine games for the Bucks, Cousins is averaging 5.0 points on 37.1% shooting with 4.3 rebounds but he expects those numbers to improve as his playing time increases and he becomes more familiar with his teammates.\n\n“I'm confident in my ability,” Cousins said. “I'm confident that I'll be able to find my rhythm eventually so I just have to keep pushing forward.”\n\nTIP INS\n\nCavaliers rookie Evan Mobley missed the game after being placed in the league’s health and safety protocols earlier in the day. ... Semi Ojeleye checked into the game late in the opening quarter, marking his first action since straining his right calf against Oklahoma City on Nov. 19. ... Budenholzer said that Middleton was making good progress and could return to action as early as Wednesday when the Bucks host the Rockets in Milwaukee. ... The Cavs have outscored their opponents by at least 10 points in each of their last 10 victories and are third in the NBA with 13 victories by 10 or more points this season.\n\nUP NEXT\n\nCavaliers: At Atlanta on Sunday night.\n\nBucks: Host Houston on Wednesday night.",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.237897",
  "pipeline_version": "v1"
}