{
  "game_id": "0021301145",
  "espn_id": "400490018",
  "date": "Apr 05, 2014",
  "matchup": "CHA @ CLE",
  "headline": "Bobcats top Cavs in OT, into playoffs for first time since 2010",
  "cleaned_body": "CLEVELAND --  No one will fault the Charlotte Bobcats for taking a moment to savor their second postseason appearance in franchise history.\n\nThey've come a long way in a short period of time.\n\nAl Jefferson scored 24 points, including seven in overtime, and the Bobcats clinched a playoff spot with a 96-94 victory over the Cleveland Cavaliers on Saturday night.\n\nCharlotte is in the postseason for the second time in its 10-year history and the first time since 2010. The Bobcats (39-38) are over .500 for the second time this season and hold seventh place in the Eastern Conference.\n\nSteve Clifford, the Bobcats' third coach in three seasons, praised his team's character.\n\n\"This is a significant accomplishment for our group of guys, and it puts us in a different place in the league,\" he said. \"The guys in the locker room are excited -- and they should be -- because we've got a good group of guys and a group of guys who are truly deserving.\"\n\nWhile the Bobcats were celebrating, the Cavaliers' slim playoff hopes suffered yet another damaging loss despite a career-high 44 points from Kyrie Irving. Cleveland (31-47) trails eighth-place Atlanta by 3 1/2 games for the final playoff spot in the East.\n\nThe Bobcats have made significant progress since finishing 7-59 in the lockout-shortened 2011-12 season. Charlotte was 21-61 last season.\n\n\"Words can't describe it,\" guard Kemba Walker said. \"For me, Gerald (Henderson), and Biz (Bismack Biyombo), we were the original guys here. We were on the worst team my first two years, so to go from there to here, it's like night and day.\"\n\nHenderson's basket gave Charlotte a 90-89 lead with 1:08 remaining and the Bobcats made four free throws down the stretch to seal the win. Walker scored 20 points and Henderson added 15 for the Bobcats, who have won four straight and swept the four-game season series with Cleveland.\n\n\"This means a lot, individually and as a team,\" Henderson said. \"I thought we would be good, but I think we've exceeded everybody's expectations -- even our own.\"\n\nIrving, who defended himself before the game over reports he's unhappy in Cleveland, was 16 of 31 from the field, including five 3-pointers. He added eight assists and seven rebounds.\n\nThe Cavaliers could be eliminated from contention before they play again Wednesday. Irving admitted he'll be paying attention to what Atlanta and New York -- the teams ahead of Cleveland -- are doing.\n\n\"In this game, anything can happen,\" he said. \"I know the Knicks and Hawks play some pretty tough teams coming up. I'll definitely be watching. We'll see.\"\n\nWalker's 3-pointer with 32 seconds remaining in regulation gave Charlotte an 82-80 lead, but Irving's jumper 7 seconds later tied the game.\n\nIrving's basket gave Cleveland an 89-86 lead with 1:55 remaining in overtime, but Jefferson hit a free throw and Henderson's basket put the Bobcats ahead.\n\nFollowing a Cleveland turnover, Walker missed a jumper, but Cody Zeller got the rebound and passed it out to Walker, who was fouled and made both shots with 17 seconds remaining to make it 92-89.\n\nAfter Dion Waiters sank two free throws, Walker split a pair of foul shots with 11 seconds to go. Following a time out, Irving took the inbounds pass at the top of the key, but his wide-open 3-pointer rimmed out.\n\n\"That's as good a look that I had all night,\" he said. \"It was in and out. It was a crucial miss, (but) I can live with that.\"\n\nHenderson's two free throws with 7 seconds left gave the Bobcats a 95-91 lead.\n\nSpencer Hawes made a 3-pointer with 4 seconds to get the Cavaliers within one before Jefferson hit a free throw with 2.3 seconds left. He missed the second, but the Cavaliers had no timeouts remaining and Hawes' desperation full-court heave was short.\n\nGame notes Charlotte has defeated Cleveland five straight times. ... Bobcats assistant coach Mark Price, who starred for the Cavaliers from 1986-95, got a big ovation when he was shown on the scoreboard in the second quarter. ... The Bobcats are 3-14 all-time at Quicken Loans Arena, the worst record by a visiting team at the 20-year-old arena.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.636281",
  "pipeline_version": "v1"
}