{
  "game_id": "0021400209",
  "espn_id": "400578501",
  "date": "Nov 25, 2014",
  "matchup": "CHI @ DEN",
  "headline": "Ty Lawson leads Nuggets over Bulls for fifth straight win",
  "cleaned_body": "DENVER -- The Denver Nuggets have climbed all the way back to .500 after a rough start.\nTy Lawson scored 20 points, including a key jumper in the waning seconds, and the Nuggets beat the Chicago Bulls 114-109 on Tuesday night for their fifth straight win.\nArron Afflalo added 19 points and Danilo Gallinari had 15 for the Nuggets, who have won six of seven since a 1-6 start.\n\"Nobody likes to lose,\" Lawson said. \"I feel like we had a late start ... but it feels good to get back in the mix and be playing for something.\"\nBulls point guard Derrick Rose was limited to 10 minutes in his second game back from a left hamstring strain. Rose, who scored 18 points in his return Monday night against Utah after a four-game absence, felt a little tightness in the hamstring in the first quarter and didn't play the rest of the way.\nCoach Tom Thibodeau said Rose did not reinjure the hamstring and he kept him out for precautionary reasons.\n\"I didn't want to take a chance,\" Thibodeau said.\nRose, playing in the second part of a back to back, added he was trying to \"be smart\" as he moves forward in his return.\n\"We're on a back-to-back, dealing with fatigue and I didn't want to take steps back,\" Rose said.\nJimmy Butler had 32 points for Chicago, and Pau Gasol finished with 22 points and 11 rebounds. But the Bulls lost for the eighth straight time in Denver.\n\"We have to play better and find a way to win games when we are short-handed,\" Thibodeau said.\nTrailing 56-49 at halftime, the Bulls closed to 64-61 when Mike Dunleavy swiped the ball from Lawson to start a fast break that he finished with a layup.\nBut the Nuggets pushed back. When Dunleavy later made a 3-pointer, Lawson answered with a three-point play to help Denver to an 86-76 lead heading into the fourth quarter.\nThe Nuggets used a 6-0 burst that included a pair of dunks by Alonzo Gee to stretch their lead to 94-80 with 8:25 remaining, but then had to fend off a late rally by the Bulls.\nGasol scored a pair of baskets to get Chicago within 10. After a video review erased a 3-point basket by Gallinari because he stepped out of bounds, Gasol converted a three-point play, making it 105-98 with less than two minutes left.\nButler's three-point play with 31.4 seconds remaining trimmed Denver's lead to 109-106, but Lawson then hit a step-back jumper over Kirk Hinrich from 21 feet with 8.3 seconds left to help seal the win.\n\"That's my range,\" Lawson said. \"Kirk Hinrich kept backing up so I had enough space to get it off.\"\nTIP-INS\nBulls: Joakim Noah was inactive because of an eye abrasion suffered in the win at Utah. ... Taj Gibson missed the game because of a left ankle injury. ... The Bulls haven't won in Denver since Feb. 8, 2006. ... Gasol leads the Bulls with seven double-doubles.\nNuggets: Randy Foye could miss up to three weeks because of a right quad strain. ... JaVale McGee is being rested the next couple of games in hopes soreness in his surgically repaired lower left leg abates. ... Darrell Arthur left in the fourth quarter with a left knee contusion. He is day to day.\nUP NEXT:\nBulls: Are at Boston on Friday.\nNuggets: Visit Phoenix on Wednesday.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "CoachComment",
    "MomentumShift"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.462442",
  "pipeline_version": "v1"
}