{
  "game_id": "0021700204",
  "espn_id": "400974955",
  "date": "Nov 15, 2017",
  "matchup": "SAC @ ATL",
  "headline": "Dedmon, hot-shooting Hawks rout Kings, 126-80",
  "cleaned_body": "ATLANTA --  The Atlanta Hawks didn't need to win by the most lopsided margin in franchise history to boost their spirits.\n\nThey just needed any win.\n\nDewayne Dedmon scored a career-high 20 points and had 14 rebounds, and the Hawks rode a dominant first half to a 126-80 win over the Sacramento Kings on Wednesday night.\n\nAtlanta's 46-point margin of victory was two points better than its previous best. Atlanta took a 141-97 win over Detroit on Feb. 7, 1994, and the St. Louis Hawks beat Baltimore 144-100 on Feb. 12, 1965.\n\nFor the Hawks (3-12), the margin was just a bonus.\n\n\"Right now we have the worst record in the NBA, so any win is a good win and we'll take it,\" said Taurean Prince, who had 14 points.\n\nActually, Dallas (2-13) owned the league's worst record even before the Hawks' win, but that mattered little to Prince. The Hawks, who snapped a four-game losing streak and won for the first time at home, felt like they were looking up at the rest of the league.\n\n\"It's a great feeling,\" Dedmon said. \"We have to take this momentum, feed off of it and get ready for the next game.\"\n\nDennis Schroder had 21 points and eight assists for Atlanta.\n\nThe Hawks' poor record only made the rout more painful for the Kings in the matchup of last-place teams. It was the sixth-worst loss in Kings history, their biggest defeat since a 48-point rout by Phoenix on Feb. 2, 2009.\n\n\"Forty-six points in the NBA, it's almost like you're laying down,\" said George Hill, who had 12 points.\n\n\"You gotta take it, you know? Own up to it. You can't back down from it. We got our butts kicked.\"\n\nThe Kings (3-11) completed a 0-3 trip while falling to 1-8 away from home.\n\n\"Losing's one thing but we've got to do a better job of competing,\" Kings coach Dave Joerger said.\n\nAtlanta pulled away with two 12-0 runs in the second quarter and took a 64-35 lead into halftime. The Hawks made six 3-pointers in the quarter.\n\nZach Randolph led the Kings with 16 points. Hill was Sacramento's only other scorer in double figures.\n\nThe Hawks made 50 of 79 (63.3 percent) shots from the field and 16 of their 32 3-point attempts.\n\nThe rout continued in the final period as back-to-back 3s by Price pushed the lead to 108-65.\n\nRookie John Collins had 14 points. Isaiah Taylor had 12 points, and Marco Belinelli and Malcolm Delaney each had 10 as the Hawks had eight scorers in double figures.\n\nDedmon's 14 rebounds set a season high.\n\nTIP-INS\n\nKings: G-F Vince Carter (kidney stone) was inactive for the fourth straight game. ... Sacramento won its first road game at Dallas and has since lost eight straight away from home. ... The Kings were outrebounded 53-29 and had no player with more than four rebounds.\n\nHawks: Ersan Ilyasova had one point and seven rebounds in 13 minutes in his return after missing eight games with a bone bruise in his left knee. ... F-C Miles Plumlee (strained right quad) could be nearing his season debut.  Atlanta assigned Plumlee and G-F Nicolas Brussino to its Erie G League team.\n\nBABBITT HURTING\n\nHawks forward Luke Babbitt had 13 points in the first half, while making three of four 3-pointers. He sat out the second half with lower back spasms. Hawks coach Mike Budenholzer said Babbitt also had tightness in his back before the game and the injury is not believed to be serious.\n\nHOT START\n\nAtlanta made its first eight shots.\n\n\"That was super important,\" Kent Bazemore (8 points) said. \"That's the way we wanted to come out. They never really recovered.\"\n\nUP NEXT\n\nKings: Host Portland on Friday night before visiting the Trail Blazers on Saturday.\n\nHawks: Host Boston for the second time this season on Saturday night. The Celtics beat the Hawks 110-107 on Nov. 6.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "ReturnFromInjury",
    "Streak",
    "CoachComment",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.159230",
  "pipeline_version": "v1"
}