{
  "game_id": "0021301178",
  "espn_id": "400490051",
  "date": "Apr 11, 2014",
  "matchup": "CHA @ BOS",
  "headline": "Celtics beat Bobcats to claim first win in 10 games",
  "cleaned_body": "BOSTON -- Phil Pressey had a career-high 13 assists, dove for loose balls and tipped a missed shot to a teammate with three seconds left.\nNot bad for Boston's 5-foot-11 undrafted rookie who learned after pregame warmups that he would start for just the ninth time.\n\"I started before, so it really wasn't that big a deal,\" he said.\nIt was to the Celtics, who held off a late surge and broke a season-long nine-game losing streak with a 106-103 win over the Charlotte Bobcats on Friday night.\nPressey got the call when Rajon Rondo realized his left shin was too sore for him to play.\n\"Phil Pressey gave us a great lift on the defensive end,\" said Avery Bradley, who led Boston with 22 points. \"I feel like that's why we won the game.\"\nBoston led 104-103 before Jared Sullinger made two free throws with 2.5 seconds left. Charlotte called timeout then got the ball to Jannero Pargo, who missed a straightaway 3-point shot as time expired.\n\"I put my hands up to make him make a tough shot,\" Pressey said. \"He was kind of fading away. If he made that shot we would have gone into overtime. If not, we win.\"\nThe Bobcats were led by Al Jefferson with 32 points and 10 rebounds and Gary Neal with 13 points.\n\"We got what we deserved,\" Jefferson said. \"There was no way we can go in the playoffs with that type of mindset.\"\nCharlotte's season-best five-game winning streak ended as it dropped into the seventh and the next-to-last playoff spot in the Eastern Conference. It trails Washington by one game after the Wizards beat Orlando 96-86 Friday night.\nBoston has the fourth-worst record in the NBA after entering the game tied with Orlando for the third-worst. Sullinger scored 20 points and Pressey had 10 with three steals.\nCharlotte also was missing its top guard, Kemba Walker, who sat out with a sore right groin. Coach Steve Clifford didn't know if he would play Saturday night against Philadelphia.\n\"I'm really more concerned about the guys on the floor,\" Clifford said. \"We had very little defense.\"\nIn a game of surges, Jefferson's short jumper gave Charlotte a 97-96 lead with 4:01 remaining. Boston went ahead 104-97 by scoring the next eight points on a 3-pointer by Sullinger, a layup by Jeff Green and a 3-pointer by Bradley.\nLuke Ridnour's basket with 1:39 to go stopped the run and Jefferson's follow of a missed shot made it 104-101 with 51 seconds left.\nThen Jefferson's layup cut the lead to one point with 29 seconds to play.\nWith the 24-second clock about to expire, Sullinger missed a 3-pointer, but Pressey tipped the rebound to Brandon Bass. The Bobcats fouled him and Boston took the ball out from the side. Sullinger was fouled immediately when he took the inbounds pass.\n\"That's just one of the winning plays that coach (Brad) Stevens talks about,\" Pressey said of his tip, \"diving for a loose ball, boxing out, taking the charge, getting offensive rebounds.\"\nThe Bobcats didn't do enough of that.\n\"We just didn't put much into the game,\" Clifford said.\nBoston led 57-55 at halftime and scored the last 12 points of the third quarter, turning a 75-72 deficit into an 84-75 lead. Bass had five points and Green added four during the rally.\nThe Celtics stretched that to 90-77 before the Bobcats came back with a 10-point run to cut the lead to three. Bradley's basket stopped the surge, but Charlotte tied it at 92 with 5:13 to go on a layup by Jefferson and a 3-pointer by Gerald Henderson.\nBut two days after wasting a nine-point lead with 5:44 left and losing to Atlanta 105-97, the Celtics held on.\n\"We learned our lesson,\" Sullinger said. \"We stayed poised.\"\nGame notes\nBoston F Kris Humphries returned after missing two games with a sore right knee. ... Sullinger suffered a mild left ankle sprain in the third quarter and returned in the fourth. ... Pressey's previous high was 11 assists. ... Jefferson is 1-12 in his career against the Celtics. He has a double-double in 10 of his past 12 games.",
  "tags_rule": [
    "DoubleDouble",
    "MomentumShift",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.166248",
  "pipeline_version": "v1"
}