{
  "game_id": "0021301097",
  "espn_id": "400489970",
  "date": "Mar 30, 2014",
  "matchup": "CHI @ BOS",
  "headline": "D.J. Augustin's career-high 33 points lead Bulls over Celtics",
  "cleaned_body": "BOSTON -- Chicago's D.J. Augustin put an end to a series of pesky rallies by the Boston Celtics.\nAugustin hit a tiebreaking 3-pointer with 2:01 remaining, then continued a perfect night from the foul line while scoring a career-high 33 points for the Bulls in a 107-102 win over Boston.\nAugustin scored 15 in the fourth, including six points from the foul line as the Bulls held off the slumping Celtics.\n\n\"Even though we didn't play great defense tonight, we pulled it out and we know what we have to fix,\" said Augustin, whose previous career high was 31 points scored against Philadelphia in January 2011. \"I really don't follow that. Some of my teammates told me. It's a great accomplishment, but I'm glad we got the win.\"\nJoakim Noah finished with 13 points, 13 assists and eight rebounds for Chicago two nights after it was routed at home by Portland.\n\"That is how we have to win. Our margin of error is not great,\" Chicago coach Tom Thibodeau said. \"We've got to play with great intensity each and every night.\"\nThe Bulls, who avoided losing consecutive games for the first time in nearly two months, will go for a three-game season sweep against the Celtics on Monday night in Chicago.\nCarlos Boozer scored 14, Kirk Hinrich and Mike Dunleavy added 11 points apiece and all five Chicago starters scored in double figures.\nChicago made up for its rebounding struggles by making 25 of 31 foul shots, including 11 of 14 in the fourth quarter.\n\"They were big, especially at the end,\" Augustin said. \"If we had missed a couple of those foul shots, we don't know what the outcome of the game would have been because they made some big 3s at the end,\" Augustin said.\nRajon Rondo had 17 points and 11 assists for Boston, which has lost four straight and nine of 10.\nJeff Green and Jared Sullinger scored 16 points each for Boston and Sullinger pulled down 10 rebounds. Kris Humphries added 14 points and eight rebounds as Boston outrebounded Chicago 39-31, but could not stop Augustin in the fourth.\n\"You can look at it a couple of different ways, but we hate losing,\" Rondo said. \"We've got to find a way eventually to win some of these games. They're very winnable. We're just not closing the games the right way.\"\nThe Celtics kept the Bulls from making a run early in the fourth quarter, matching nearly every basket and continuing to outrebound Chicago. Boston grabbed two offensive rebounds on one possession and Brandon Bass' putback gave the Celtics an 87-86 lead.\nNoah drew a foul on the other end and hit both free throws, Hinrich added a 3-pointer and Augustin made a reverse layup to put the Bulls up 93-87 with 4:36 left.\nRondo answered with a 3-pointer for Boston, then Sullinger blocked a layup attempt by Augustin to set up a fast-break 3-pointer by Green to pull Boston back within a basket. Green hit again from beyond-the-arc after a foul shot by Noah and the score was tied at 96 with 2:13 remaining.\nAugustin broke the tie with his third 3-pointer of the game, then made a steal on an inbounds play that all but ended Boston's chances. Augustin drew a foul and made both free throws, then added four more from the line as the Celtics were forced to foul.\nAugustin's two free throws with 22 seconds left put Chicago up 105-99 and the margin was too much for Boston to overcome.\nGame notes\nCarlos Boozer received a technical and clear-path foul when he grabbed Humphries from behind on his way to an uncontested trip to the basket. ... Humphries tumbled to the court after Boozer let go and was quickly issued the technical. ... Humphries was called for a technical in the third period for a shove on Noah in the lane while both were setting up for a rebound. ... Chicago last lost consecutive games Feb. 1 and 3.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.802817",
  "pipeline_version": "v1"
}