{
  "game_id": "0021401203",
  "espn_id": "400579495",
  "date": "Apr 13, 2015",
  "matchup": "DET @ CLE",
  "headline": "LeBron gets triple-double, Cavs roll Pistons 109-97",
  "cleaned_body": "CLEVELAND -- LeBron James returned to work rested and without a trace of rust. Kyrie Irving may need more time off.\nJames returned to the court after sitting out one game and recorded a triple-double as the Cleveland Cavaliers tuned up for the NBA playoffs with a 109-97 win over the Detroit Pistons on Monday night.\n\nJames, who sat out Sunday's loss in Boston along with Irving and starters J.R. Smith and Kevin Love, had 21 points, 11 assists and 10 rebounds in 32 minutes as the Cavs improved to 33-9 since Jan. 15.\nWith just one regular-season game remaining, James feels good about the Cavs headed into the playoffs.\n\"I'm very excited and happy about our rhythm tonight,\" James said. \"That's kind of what you fear when guys sit out, but tonight it was like we didn't take games off at all.\"\nSmith made eight 3-pointers and scored 28 and Timofey Mozgov had 13 rebounds for the Cavs, who built a 26-point lead in the first half and won for the 19th time in 20 home games.\nIrving scored 12 points in the first half, but Cleveland's All-Star guard was kept out after halftime with tightness in his right hip. Irving has recently been bothered by an issue with his hip, and the Cavs said they were being cautious with him. Cavs coach David Blatt said Irving's injury isn't serious and he'll undergo treatment over the next few days.\n\"It's something we need to be cautious about,\" Blatt said, \"and therein the reason he didn't play yesterday. We're trying to make sure everyone is healthy. He should be OK.\"\nJames doesn't know if he'll play in Wednesday's season finale, and he's hoping Irving can get himself right for this weekend's playoff opener.\n\"He has less than a week to get to feeling as close to 100 percent as possible,\" James said. \"We all have nagging injuries but you want to feel as good as you can going into the postseason. That's the only thing that matters.\"\nAndre Drummond scored 20 and Caron Butler 19 for the Pistons, who fell behind 23-5 in the early going, trailed 36-14 after the first quarter and didn't play anywhere near coach Stan Van Gundy's expectations.\n\"We were not the least bit ready to compete when the game began,\" Van Gundy said. \"We got completely out-competed and blown out from the start. The game was over after one. It's hard to get anything going when you're taking the ball out of the net every time and you're not getting rebounds.\"\nThe Cavs made 17 3-pointers and became one of 13 teams in league history -- six this season alone -- to drop 800 3s in a season. None of the team to do it before this season won an NBA title. Cleveland, Portland and Atlanta all reached the milestone Monday night.\nJames didn't secure his 10th rebound until 8:08 remaining in the fourth quarter, and once he got it Blatt quickly substituted for his superstar. James didn't want to leave the floor before getting rebound No. 10 and he and Blatt had a short back-and-forth during play.\n\"Sometimes you want to have a little fun, too,\" Blatt said. \"He wanted a shot to get the 10th rebound and I was happy to oblige him.\"\nTHREE FOR ALL\nThe Cavs didn't expect to shoot as many 3-pointers as they have this season, but Blatt doesn't mind the long balls provided they come in the flow of the offense.\n\"We want to shoot the 3 when we got a good look,\" he said. \"We got guys who can shoot `em and make `em. It's a credit to the type of players we have. We've got guys who create those situations.\"\nTIP-INS\nPistons: Van Gundy, who led Orlando past Cleveland in the 2009 East finals, doesn't see many weaknesses with the current Cavaliers. \"It will take a great performance to beat them,\" he said. \"If you're going to play big, they've got three guys. If you downsize, LeBron can guard all five positions. There aren't a lot of holes there.\"... F Tayshaun Prince did not play his second straight game, and Van Gundy said he'll likely sit again in the finale as the Pistons use younger players.\nCavaliers: James has 39 career triple-doubles, two this season. ... Cleveland is 41-5 when scoring at least 100 points. ... Despite missing 12 games, James is one of only three players to score 1,700 points with 500 assists, 400 rebounds and 100 steals this season. Houston's James Harden and Oklahoma City's Russell Westbrook are the others. ... Indians manager Terry Francona attended the game on his team's off day.\nUP NEXT\nPistons: at New York on Wednesday to end season.\nCavaliers: host Washington on Wednesday in regular-season finale.",
  "tags_rule": [
    "InjuryReport",
    "TripleDouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.463386",
  "pipeline_version": "v1"
}