{
  "game_id": "0022101036",
  "espn_id": "401360855",
  "date": "Mar 16, 2022",
  "matchup": "BKN vs. DAL",
  "headline": "Dinwiddie hits 3 at buzzer, Mavericks beat Nets 113-111",
  "cleaned_body": "NEW YORK -- — Spencer Dinwiddie knows it's up to Luka Doncic whether he takes the last shot.\n\nDoncic is the man in Dallas, so Dinwiddie said he's well within his right to decide if he's going to be the one to determine whether the Mavericks win or lose.\n\nDoncic passed it — and the way Dinwiddie is going, why wouldn't he?\n\nDinwiddie made a 3-pointer at the buzzer against his former team, giving the Mavericks a 113-111 victory over the Brooklyn Nets on Wednesday night.\n\nDinwiddie hit the winning basket with nine seconds left Sunday in Boston and came through in the clutch again after Kevin Durant had given the Nets a one-point lead with a 3-pointer with 10 seconds to play.\n\n“Same as Boston,” Doncic said. “That’s it.”\n\nThe Mavericks took time after Durant's shot and Doncic brought the ball up before Durant left Dinwiddie and ran toward the All-Star guard. Doncic passed to Dinwiddie, who nailed the jumper from the right side, right in front of Brooklyn's bench. He then ran across the court to the other sideline in celebration.\n\nDuring his celebration, he thanked Nico Harrison, the Mavs general manager who acquired Dinwiddie from Washington last month after a rocky stint with the Wizards. Dinwiddie previously played in Brooklyn, resurrecting his career and playing his way into the big contract he earned from the Wizards.\n\nHe still has friends in Brooklyn, so he said this victory was more fun than revenge.\n\n“It’s like sticking it to your cousin versus, like, being vengeful for an enemy,” Dinwiddie said.\n\nIt's the first time in his career he has hit game-winners in consecutive games. The Mavericks said Chicago All-Star DeMar DeRozan is the only other player to do that this season.\n\nDoncic finished with 37 points, nine rebounds and nine assists in the Mavericks' eighth win in nine games. Dinwiddie scored 22 points, 15 in the fourth quarter.\n\nDurant had 23 points, 10 assists and six rebounds, but Brooklyn had its four-game winning streak snapped. Goran Dragic scored a season-high 21 points and Bruce Brown had 17. Andre Drummond had 14 points and 17 rebounds.\n\nA night after a 150-108 romp in Orlando, when Kyrie Irving scored a career-high 60 points, the Nets were searching for offense with the guard unable to play because of New York City's coronavirus vaccine mandate. The Mavs often sent second and even third defenders to force Durant to give up the ball.\n\nHe beat that by quickly rising for the 3-pointer that gave Brooklyn the lead, but Dinwiddie again came through late for the Mavs and left Durant wondering if he'd made the right decision to double Doncic.\n\n“When you watch that last play, just regret, wondering what the game would have been like if I didn’t go jump Luka right there, you know what I’m saying?” Durant said. “So in hindsight I wish I would have made a different decision, but it is what it is.”\n\nDurant's basket to open the fourth quarter gave Brooklyn a 93-79 lead. But the Nets had only one basket in the next four minutes and a 15-2 run by Dallas trimmed it to one on Dinwiddie's 3-pointer with 7:53 remaining.\n\nThe Nets went back ahead by six midway through the period before the Mavs scored eight straight to take the 104-102 lead on Maxi Kleber's free throws with 3:08 to play\n\nTIP-INS\n\nMavericks: Coach Jason Kidd said he hoped F Marquese Chriss (sore right knee) could play Friday or Saturday. ... With Reggie Bullock (personal reasons) out again, the Mavs stuck with a three-guard lineup with Doncic, Dinwiddie and Jalen Brunson. Brunson scored 18 points.\n\nNets: Seth Curry (left ankle) missed his third straight game but coach Steve Nash said he expected the guard to play Friday against Portland. ... Nash thought C LaMarcus Aldridge (right hip) probably wouldn't be evaluated again until sometime next week.\n\nWEEKLY WINNERS\n\nThe game featured both reigning players of the week in the NBA. Durant won the Eastern Conference award Monday and Doncic took it home in the West for the second time in three weeks.\n\nCOACHES IN A CLASSIC\n\nThe 150 points Tuesday were the second-most the Nets had scored in an NBA game, behind only their 161-157 double-overtime loss to Phoenix on Dec. 7, 2006, when Nash and Kidd went head-to-head as the point guards. Nash scored 42 points, while Kidd carried the Nets with 38 points, 14 rebounds and 14 assists,\n\nAsked what he remembered about the game, Nash joked: “Just back in the day how I used to lock people down. Just keep the top guys under wraps.”\n\nUP NEXT\n\nMavericks: Visit Philadelphia on Friday.\n\nNets: Host Portland on Friday.\n\n—",
  "tags_rule": [
    "Streak",
    "ClutchShot",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.704693",
  "pipeline_version": "v1"
}