{
  "game_id": "0021700941",
  "espn_id": "400975687",
  "date": "Mar 03, 2018",
  "matchup": "OKC @ POR",
  "headline": "McCollum scores 28 as Trail Blazers beat Thunder 108-100",
  "cleaned_body": "PORTLAND, Ore. --  During their recent upswing, the Portland Trail Blazers have received key contributions from several role players. It was Zach Collins' turn Saturday night.\n\nThe rookie forward had a career-high 12 points, including a key 3-pointer down the stretch, as the Blazers earned a 108-100 victory over the Oklahoma City Thunder.\n\n\"It was good, but more importantly, we've got to win right now. I've got to go out there and make sure I do my job to where, with that second unit, we don't let anything slip and we make sure we sustain the lead or we push it,\" said Collins, the 10th pick in last year's NBA draft out of Gonzaga.\n\nCJ McCollum scored 28 points and Damian Lillard added 20 in Portland's sixth straight victory. The win left the Blazers alone in third place in the crowded Western Conference, while the Thunder dropped to seventh.\n\n\"I mean, it's nice but it doesn't really do anything for us right now,\" McCollum said. \"To finish third 20 games from now would be great, but we have a long way to go. We've got a lot of games left to be played and I'm really looking forward to the challenge of us continuing to stick together defensively, continuing to stick to our principles and come away with close wins.\"\n\nRussell Westbrook led the Thunder with 30 points and 11 rebounds, but the loss snapped a three-game winning streak. Paul George added 21 points.\n\nThe Blazers led by 10 early in the fourth quarter but Westbrook converted a three-point play after Pat Connaughton was called for goaltending, pulling the Thunder to 95-90. Westbrook's jumper got Oklahoma City even closer with 3:58 to go.\n\nCollins' 3-pointer put Portland up 102-93 with 2:23 left, but Westbrook answered with his own 3 and Jerami Grant added a layup to trim the Thunder's deficit to 102-98. After Lillard made free throws, Westbrook airballed a 3-pointer and Portland closed it out at the foul line.\n\n\"We closed well but obviously we didn't make the shots down the stretch. But I think we got good enough looks,\" George said. \"We got within three or four points. A play here or there to go our way and we've got a different ballgame. It just didn't happen that way.\"\n\nThe Thunder rested Carmelo Anthony, who is averaging 16.9 points per game, after defeating the Suns 124-116 on Friday night in Phoenix. Patrick Patterson started in his place.\n\nCorey Brewer played for the Thunder even though he had not yet practiced with the team. The 6-foot-9 guard was formally signed by Oklahoma City on Friday.\n\nBrewer, an 11-year NBA veteran, averaged 3.7 points in 54 games this season with the Lakers, who agreed to a buyout with him on Wednesday.\n\n\"I've got confidence in him. I know him as a player and a person. He's very smart and cerebral and he'll be able to figure things out as he's going,\" said Thunder coach Billy Donovan, who also coached Brewer at the University of Florida.\n\nBrewer made his Oklahoma City debut in the first quarter and played 12 minutes with a rebound and an assist, along with four fouls.\n\nThe Blazers were without starter Maurice Harkless, out with a left patellar tendon strain sustained in Thursday night's 109-99 victory over the Timberwolves. Evan Turner started in his place.\n\nThe Thunder led 28-25 going into the second quarter but Portland grabbed a 34-33 lead on Shabazz Napier's 3-pointer. McCollum's putback and Jusuf Nurkic's layup extended the Blazers' advantage to 44-35.\n\nThere was a dustup late in the half when Nurkic and Steven Adams got tangled up before exchanging words. After a video review, Nurkic was called for a common foul but Westbrook got a deadball technical.\n\nThe Blazers led 53-50 at the break. Westbrook led all scorers with 14 points.\n\nPatterson's 3-pointer pulled the Thunder briefly in front, 60-59, but Portland led 83-75 going into the final period.\n\nPortland has won three of the four meetings between the teams this season, giving the Blazers a potential tiebreaker for playoff seeding. Portland has won five straight overall against the Thunder and eight in a row at Moda Center.\n\nTIP-INS\n\nThunder: George has scored 20-plus points in 11 of the past 12 games. ... Adams has had a block in nine straight games, a career-best streak. ... Assistant coach Maurice Cheeks was the head coach of the Blazers from 2001-05.\n\nTrail Blazers: Lillard has made at least one 3-pointer in 45 straight games, setting a franchise record. ... Ed Davis has had double-digit rebounds in three straight games.\n\nRIP CITY\n\nNurkic ripped his jersey off as he went to the bench in the second quarter. \"I've seen it before, but not up close and personal,\" Blazers coach Terry Stotts said.\n\nUP NEXT\n\nThe Thunder host the Houston Rockets -- winners of 15 straight games -- on Tuesday.\n\nThe Trail Blazers visit the Lakers on Monday for a quick one-game road trip. Los Angeles has won five in a row.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.194740",
  "pipeline_version": "v1"
}