{
  "game_id": "0021400369",
  "espn_id": "400578661",
  "date": "Dec 17, 2014",
  "matchup": "CHA vs. PHX",
  "headline": "Thomas, Dragic lead Suns over Hornets, 111-106",
  "cleaned_body": "CHARLOTTE, N.C. --  Goran Dragic said he hates to miss any game.\n\nHe said the angst is even worse when his team is in the midst of a losing streak.\n\nReserve Isaiah Thomas scored 23 points, Dragic returned from a two-game hiatus due to a strained back and had 20, and the Phoenix Suns snapped a six-game skid with a 111-106 victory over the Charlotte Hornets on Wednesday night.\n\n\"Tonight was an important win for us,\" said a relieved Dragic. \"We were close in some games, but you start doubting yourself.\"\n\nDragic played 38 minutes in his first physical activity in four days. He said by the fourth quarter he could barely feel his legs.\n\nIt's a good thing the Suns had Thomas to help carry the load down the stretch with Dragic dragging and Markieff Morris out of the game after being ejected in the third quarter for arguing with officials.\n\nThomas registered his eighth 20-point game of the season, shooting 7 of 13 from the field as Phoenix erased a 17-point, first-half deficit. Thomas had 12 points on 4-of-5 shooting in the fourth quarter.\n\nThe Suns outscored the Hornets 10-2 in the final 2 1/2 minutes.\n\n\"We got stops,\" Thomas said. \"That was the name of the game. We were down the whole game but stuck to it and got some key stops toward the end.\"\n\nGerald Green had 16 points off the bench and Eric Bledsoe chipped in with 15 for the Suns.\n\n\"It's tough when you've lost six in a row and you get down (by 17 points),\" Suns coach Jeff Hornacek said. \"That's an easy time to just quit and say, `Here we go -- number seven.' But our guys didn't quit.\"\n\nAl Jefferson had 28 points and 10 rebounds for Charlotte, which has lost four straight. Kemba Walker scored 27 points before going cold in the final three minutes.\n\nCharlotte led most of the game but the Suns battled back to take the lead at 105-104 with 1:31 left when Dragic stole the ball from Gary Neal, resulting in an uncontested layup by Bledsoe on the other end. Thomas hit a 17-footer pushing the lead to 3.\n\nJefferson answered with a jumper, but Thomas made two free throws to push the lead back to three.\n\nThe Hornets had a chance to tie down the stretch, but Neal missed an awkward 3-pointer from the top of the key with Dragic's hand in his face with 6 seconds left. P.J. Tucker sealed the win with two free throws.\n\n\"Tonight I just thought we had bad execution down the stretch. You have to make plays,\" Walker said. \"It was bad decisions, bad turnovers and forcing shots at the end of the shot clock. It cost us.\"\n\nJefferson had 18 points on 8 of 10 shooting in the first quarter.\n\nHornacek moved Tucker on Jefferson and he helped hold Charlotte's center scoreless in the second quarter by fronting him in the post and denying \"Big Al\" the ball.\n\n\"With Al, you can't let him touch it down there,\" Tucker said. `I don't care how big you are or strong you are, he can score.\"\n\nHornets guard Lance Stephenson was taken to the locker room midway through the third quarter after sustaining a groin contusion following a driving left-handed layup. He returned for about three minutes in the fourth quarter game before being removed down the stretch by coach Steve Clifford.\n\n---\n\nTIP-INS\n\nSuns: Phoenix's losing streak was its longest since a 10-game skid that started in March of 2013.\n\nHornets: Charlotte fell to 1-11 against Western Conference teams.\n\nSHORTER PRESEASON\n\nNBA Commissioner Adam Silver said before the game that the league is considering lightening the load from back-to-back games by shortening the preseason and starting the regular season earlier.\n\nUP NEXT\n\nSuns: At New York on Saturday.\n\nHornets: At Philadelphia on Friday night.",
  "tags_rule": [
    "ReturnFromInjury",
    "Streak",
    "CoachComment",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.277945",
  "pipeline_version": "v1"
}