{
  "game_id": "0021300487",
  "espn_id": "400489360",
  "date": "Jan 03, 2014",
  "matchup": "MEM @ DEN",
  "headline": "Nuggets snap skid with 111-108 win over Grizzlies",
  "cleaned_body": "DENVER --  A two-week losing streak that included a tumultuous player-coach run-in during a game is over and the Denver Nuggets can finally exhale.\n\nTy Lawson scored 18 points, including a key 3-pointer with less than a minute to play, and the Nuggets snapped an eight-game losing streak with a 111-108 win over the Memphis Grizzlies on Friday night.\n\n\"It's a wonderful feeling,\" said Kenneth Faried, one of six Nuggets to score in double figures. \"We got the monkey off our back. We can't put it back on.\"\n\nLawson also had 12 assists for the Nuggets, who played without Andre Miller. His two-game suspension stemming from a verbal clash with coach Brian Shaw during Wednesday's loss to the Philadelphia 76ers was rescinded by the club earlier Friday. But Miller, who lit into Shaw over his lack of playing time in the waning minutes of Wednesday's game in full view of fans and teammates, will remain away from the team until Monday under a newly issued personal leave.\n\nWith frustration and uncertainty running rampant, Shaw held individual meetings with his players, and then had a group session with the team Thursday.\n\n\"It was great,\" guard Randy Foye said. \"Coach called us in and just explained how much confidence he had in us, what he expected from us. He reassured us that he's with us 120 percent. He told us that he needs us to be with him 120 percent, and to believe in the game plan. Coach was awesome, explaining the things that he needed from us, and I think guys took that and ran with it.\"\n\nShaw said dealing with the fallout from the losing streak as well as the verbal clash with Miller was just part of the job.\n\n\"Everything that's gone on in the last 48 hours is part of what you sign up for,\" Shaw said. \"There's ups and downs. ... But just allowing everybody to voice how they felt about the way things were going, assess themselves, assess us as a coaching staff, I think that just liberated everyone.\"\n\nFaried and Timofey Mozgov added 16 points apiece for Denver and Nate Robinson had 15 points, including nine in the fourth quarter.\n\nZach Randolph had 25 points to lead Memphis and Mike Conley added 23. Mike Miller narrowly missed a tying 3-pointer at the buzzer.\n\n\"We didn't guard well,\" Grizzlies coach David Joerger said. \"They got the loose balls. They got the offensive rebounds and we didn't convert on fast breaks. We gave up too many easy baskets.\"\n\nTrailing by 10 at the break, the Grizzlies got back in the game by opening the third quarter with a 13-4 run.\n\nTony Allen's layup little more than three minutes later put the Grizzlies in front 65-64, their first lead since the opening moments of the game. The Nuggets came back, with help from a three-point play by Evan Fournier and a 3-pointer by Robinson to take a 77-75 lead into the fourth quarter.\n\nThe Nuggets extended their lead to 87-77 with 9:32 remaining, getting 3-pointers from Randy Foye and Robinson around a breakaway dunk by Faired. The Grizzlies made another push, getting seven consecutive points capped by Conley's 3-pointer to pull to 98-96 with 4:05 left.\n\nRobinson answered with a 3-pointer to give the Nuggets a bit of breathing room, but Tayshaun Prince drained a 3-pointer with a minute left, getting the Grizzlies within 107-104.\n\nLawson rebuilt the Nuggets' lead to six points with a clutch 3-pointer with 53.1 seconds left. Memphis scored the next four points, and with 4.1 seconds left fouled Robinson, who made one of two free throws with the Grizzlies rebounding and getting the ball with just over 3 seconds remaining.\n\nMiller's attempt for a tying 3-pointer hit the back of the rim and bounced out.\n\n\"They played desperate. They needed a win and they played like it,\" Conley said. \"They worked hard for it and they outworked us at the end.\"\n\nGame notes Lawson has had eight points-assists double doubles this season. ... Mozgov has come off the bench to score in double figures 13 times this season. ... Memphis outscored the Nuggets 27-19 in the third quarter, getting 12 of its points from the free throw line. ... The Grizzlies attempted 38 free throws in all, making 29. Only Houston (44 on Nov. 16) shot more free throws against the Nuggets. ... Randolph reached 25 points and 13 rebounds in a game for the third time this season.",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.061507",
  "pipeline_version": "v1"
}