{
  "game_id": "0021400129",
  "espn_id": "400578421",
  "date": "Nov 14, 2014",
  "matchup": "OKC vs. DET",
  "headline": "Jennings leads Pistons to OT win at Thunder",
  "cleaned_body": "OKLAHOMA CITY -- Brandon Jennings' big second half against Oklahoma City was just a bonus for Detroit coach Stan Van Gundy. The real key to the Pistons' latest win was its defensive effort.\nJennings scored 25 of his 29 points in the second half and overtime to lead the Pistons to a 96-89 victory over the Thunder on Friday night, giving Detroit its first-ever win at Oklahoma City.\nTrailing 30-21 after the first period, the Pistons held the Thunder to just 34 percent shooting and 59 points the rest of the way.\n\"I thought our defense and rebounding is what got us to the point to give Brandon a chance to have his flurry,\" Van Gundy said. \"We've got to become a great defensive team. We just have to be.\"\nJennings scored eight straight points in the extra period.\n\"I think when I hit the one 3, I got my confidence up,\" said Jennings, who was 5 for 8 on 3-pointers. \"Those are big plays right there and I work on them every day. It's one game, we've got 73 more to go. This is a good feeling, of course, to get a win on this road trip.\"\nTeammate Greg Monroe also credited Jennings' recent play.\n\"The past few games he's been on fire,\" teammate Greg Monroe said. \"He's been getting to his spots. He's been knocking down shots and attacking the rim. Whenever he's playing like that we're a better team.\"\nJennings hit a 3-pointer to give the Pistons the lead for good, 87-84 with 2:32 left in overtime. He then added a layup and another 3 while falling to the ground to expand the lead to 92-84.\nThe Pistons' point guard scored 15 in the third quarter to rally the team from a six point halftime deficit to a one-point advantage heading into the final period.\nReggie Jackson missed a 16-foot fade away jumper at the buzzer that would have given the Thunder their first two game winning streak of the season, instead sending the game into overtime.\nJackson finished with 20 points and 12 assists for the Thunder, while Jeremy Lamb had career highs of 24 points and 10 rebounds for his first-ever double-double.\nJackson blamed himself for the Thunder's failure to execute down the stretch and for Jennings' big finish.\n\"I failed my teammates ... they played great, it was never supposed to go to overtime,\" Jackson said. \"I let them down tonight, so if anybody rests uneasy it's my fault. Anybody who watches the game, Brandon Jennings definitely destroyed Reggie Jackson. We lost the matchup and that's why we lost tonight.\"\nThe Pistons jumped out to a 12-4 lead with Monroe hitting his first three shots. Oklahoma City chipped away at the margin as Lamb and Jackson led a 26-9 run to finish the quarter, the pair combining to hit 9 of 13 shots for 21 of the Thunder's 30 first quarter points. That surge gave Oklahoma City a nine-point lead at the end of the period.\nJosh Smith scored 18 for Detroit, Monroe added a 14, while Jonas Jerebko added 12. Andre Drummond had 15 rebounds.\nIbaka had 19 points and 10 rebounds for Oklahoma City.'\n---\nPIVOTAL MOMENT\nJennings' step-back 25-foot shot put Detroit ahead for good in overtime, while Oklahoma City had back-to-back 3-point misses from Anthony Morrow and Lamb and a turnover from Jackson, leading to 12 straight Pistons points in a 2-minute span.\nDO OVER\nMorrow was coming off of a season-high 28-point on 11-for-16 shooting, including 4 for 5 on 3s, in a road win at Boston. Against the Pistons, Morrow shot 4 for 13 overall, including 2 for 8 on 3s.\nMASH UNIT\nOklahoma City had almost as many players on the bench in business suits as basketball uniforms, as Kevin Durant, Russell Westbrook, Perry Jones, Andre Roberson, Mitch McGary and Grant Jerrett continue to be sidelined with injuries.\nUP NEXT\nThunder: Host Houston on Sunday\nPistons: At Memphis on Saturday",
  "tags_rule": [
    "DoubleDouble",
    "MomentumShift",
    "Streak",
    "EarlyRun",
    "CareerHigh",
    "HotShooting"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.122631",
  "pipeline_version": "v1"
}