{
  "game_id": "0021700434",
  "espn_id": "400975185",
  "date": "Dec 16, 2017",
  "matchup": "MIN vs. PHX",
  "headline": "Canaan helps Suns rally to beat T-Wolves 108-106",
  "cleaned_body": "MINNEAPOLIS -- Phoenix coach Jay Triano says he needs newly signed Isaiah Canaan to learn on the fly. Standing at the foul line for three shots with 6 seconds left, Canaan made it through his first lesson with the Suns.\nCanaan sank all three free throws, and the Suns denied Jimmy Butler twice on Minnesota's ensuing possession to cap a bench-led comeback in a 108-106 victory Saturday.\nIt was Canaan's first game since being added to the roster Wednesday after the injury-ravaged Suns received a hardship extension. He helped Phoenix snap a five-game skid\n\"Wanted to see what he could do. He had to get a practice in,\" Triano said.\nAnd it was quite the practice.\nCanaan finished with 15 points and drew a foul on Jeff Teague on a 3-pointer with Minnesota leading by one. Originally ruled a shot-clock violation, replay officials overturned the call and Canaan calmly sank all three shots amid a loud crowd of neon green-clad fans.\n\"Playoff experience really helps in moments like those just to be able to calm down and just know that it's a regular free throw, regular part of the game\" Canaan said. \"When I got fouled, I knew i was going to make them. Stepped up to the line and made them.\nAlex Len blocked Butler's layup attempt out of bounds on the ensuing possession. Butler had one more look from the corner, but the attempt rimmed out and the Suns snapped their five-game losing streak.\nDragan Bender and Troy Daniels each scored 17 points for the Suns, whose bench outscored the starters. TJ Warren added 15 for Phoenix, which trailed by as many as 15.\n\"I kept saying, 'Do we need to give them a rest? Do we need to give them a rest?'\" Triano said about his bench. \"We used our timeouts to give them a rest and I thought they were great at both ends and spread the floor.\"\nKarl-Anthony Towns led Minnesota with 28 points and 11 rebounds. Phoenix had 27 turnovers, but the Wolves struggled from the floor, finishing 40 for 95.\n\"We shot ourselves in the foot tonight,\" Teague said. \"We had plenty of times to bury that team, and we didn't.\"\nThe Wolves took a four-point lead into the fourth before Danuel House converted a three-point play to spark a 22-11 run. Len had 12 points and a career-high 19 rebounds. Len's put back at 7:49 gave the Suns their first lead at 92-91.\n\"We didn't close the quarters out well,\" Thibodeau said. \"Each quarter we had a problem. And then the rebounding was problematic.\"\nPhoenix outrebounded Minnesota 52-31.\nTHE FINAL CALL\nThibodeau took issue with the foul call by referee Mark Ayotte on Teague at the end. \"They didn't call a foul. My interpretation was that what they called was a shot-clock violation.\"\nVideo replays showed Teague falling into Canaan just before the shot clock expired.\nCrew chief Ken Mauer defended the call to a designated pool reporter. \"I told Thibodeau, 'Yes, he did call a foul. The play was handled correctly,'\" Mauer said.\nBUTLER'S BACK\nThibodeau confirmed Butler is dealing with some back issues. Butler left the bench in the second half, but eventually returned.\n\"I could tell his back was bothering him because he was in a lot of pain. Every time he was trying to move, every time he was trying to cut he was in a lot of pain,\" Gibson said.\nTIP INS\nSuns: C Tyson Chandler returned to the starting lineup after missing Thursday night's loss against Toronto. He finished with four points in 20 minutes. ... Tyler Ulis left with an apparent hand injury with less than three minutes in the game. Afterward, Triano said Ulis was fine and could've come back into the game.\nTimberwolves: Towns recorded his league-leading 24th double-double of the season. ... Before the game, Thibodeau addressed G Jamal Crawford's recent comments about his limited playing time. Crawford entered the game averaging 17.7 minutes per game, the lowest since his rookie season. On Friday, he told reporters it was challenging to adjust to the change. \"I think everyone has to sacrifice for the team and if you look at Jimmy, Wig and KAT, they are sacrificing some shot attempts. You have to do what's best for the team,\" Thibodeau said Saturday. ... F Nemanja Bjelica missed his 12th straight game with a sprained left foot.\nUP NEXT\nSuns: At Dallas on Monday night.\nTimberwolves: Host Portland on Monday night.",
  "tags_rule": [
    "DoubleDouble",
    "MomentumShift",
    "Streak",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.796867",
  "pipeline_version": "v1"
}