{
  "game_id": "0021300791",
  "espn_id": "400489664",
  "date": "Feb 13, 2014",
  "matchup": "OKC @ LAL",
  "headline": "Kevin Durant, Thunder send Lakers to record 7th straight home loss",
  "cleaned_body": "LOS ANGELES -- For three quarters, the Los Angeles Lakers tempted the sellout crowd at Staples Center into believing they would pull off one of the most improbable upsets of the NBA season.\nThen Kevin Durant took over and the Lakers got sloppy with the ball, turning it into just another loss in a season full of them for coach Mike D'Antoni's undermanned squad.\nDurant scored 19 of his 43 points in the fourth quarter, and the Oklahoma City Thunder sent the Lakers to a record-setting seventh straight home loss with a 107-103 victory Thursday night.\n\n\"The easy thing to do is look at it like we didn't have the proper focus. But I'm not going to go there -- because when you play against an NBA team that's prideful like the Lakers, they're going to have a good game,\" Oklahoma City coach Scott Brooks said.\nThe Thunder have a 1 1/2-game lead on Indiana for the NBA's best record. Their 43-12 mark equals the best start in the franchise's 47-year history, set by the 1995-96 Seattle SuperSonics.\nOklahoma City is 20-7 without second-leading scorer Russell Westbrook, who hasn't played since getting a triple-double Christmas Day at Madison Square Garden. Westbrook is recovering from arthroscopic surgery on his right knee.\n\"This whole group, they are resilient,\" Durant said. \"We persevered through everything and just stayed together. We had faith no matter what. We are looking forward to having Russell back and make it seem less of a transition for him.\"\nChris Kaman and Wesley Johnson scored 19 points apiece for Los Angeles, and Kendall Marshall added 14 points and 17 assists. The Lakers have lost 22 of their past 27 games and are tied with Sacramento for last place in the Western Conference.\nThe Thunder, coming off a 98-95 win against Portland in which they held All-Stars LaMarcus Aldridge and Damian Lillard to a combined 1-for-17 from the field in the second half, trailed by as many as 15 points late in the third quarter while Durant missed his first eight attempts from 3-point range.\nBut Durant's first 3-pointer of the game cut the Lakers' lead to 85-77 in the opening minute of the fourth, triggering a 15-2 run that enabled Oklahoma City to pull ahead 92-87 with 5:46 to play.\n\n\"He just continued to play the game and do what he has done all season,\" teammate and former Laker Derek Fisher said. \"He is one of the best I have seen in terms of really just playing through anything and everything.\"\nLos Angeles committed seven of its 23 turnovers during the first 4:03 of the final period, and Fisher tied it at 87-all on a 3-pointer. Durant then stole the ball from Johnson and hit a driving layup that gave the Thunder their first lead, 89-87. The five-time All-Star capped the rally with a 3-pointer 32 seconds later.\nThe Lakers came out of the gate like a team that desperately wanted to avoid surpassing the franchise record for consecutive home losses they shared with the 1992-93 squad. They led 54-45 at halftime.\n\"I thought the effort was terrific,\" D'Antoni said. \"They battled the whole game. We ran into a little rough spot there in the start of the fourth. They got into us, and we turned it over way too many times.\"\nSteve Blake made a three-point play after getting fouled by Jeremy Lamb on an off-balance 20-footer from the left elbow. That put the Lakers back in front 95-94 with 3:34 left, but Serge Ibaka's two free throws put the Thunder ahead to stay with 2:38 remaining and they closed with an 11-7 run as Fisher and Durant each made two free throws in the final 17 seconds.\nOklahoma City has won eight of its past 12 meetings with the Lakers.\nD'Antoni was down to eight healthy players, with point guard Steve Nash sitting out because of a recurrence of root irritation in his back and hamstring. Los Angeles is still missing five of its top six scorers -- Kobe Bryant, Pau Gasol, Jordan Farmar, Nick Young, Jodie Meeks and Xavier Henry.\n\"It's been a crazy year, and there will still be some turbulence ahead,\" D'Antoni said. \"But I think during these next 29 games we will get honed in and try to get better. The thing I hope is that with all the effort, they get rewarded for it.\"\nGame notes\nThe Thunder haven't allowed 20 or more points to an opposing player since eight games ago at Miami on Jan. 29, when they overcame 34 points by LeBron James in a 112-95 win. ... Oklahoma City will come out of the All-Star break with a six-game homestand beginning next Thursday against the defending NBA champion Heat. ... Brooks and his staff will be calling the shots for the Western Conference All-Stars on Sunday at New Orleans.",
  "tags_rule": [
    "MomentumShift",
    "TripleDouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:50.748034",
  "pipeline_version": "v1"
}