{
  "game_id": "0021300767",
  "espn_id": "400489640",
  "date": "Feb 10, 2014",
  "matchup": "MIL vs. BOS",
  "headline": "Jeff Green, Celtics knock off NBA-worst Bucks",
  "cleaned_body": "MILWAUKEE -- Jeff Green scored 29 points and Kelly Olynyk added 14 points and 11 rebounds as the Boston Celtics pulled away from the Milwaukee Bucks in the fourth quarter of a 102-86 victory Monday night.\nThe Celtics used a 12-4 run to start the final quarter to break open what had been a tight game. Green had seven points during the spurt and 11 overall in the quarter, while Olynyk scored 10 after Boston entered the fourth clinging to a 70-68 lead.\nJared Sullinger added 13 points and 10 rebounds for Boston.\nBrandon Knight had 22 points for Milwaukee, which also got 17 points from Gary Neal and 16 points from John Henson before he left late in the game with an ankle injury.\nThe Celtics held a 49-46 advantage at the half despite shooting just 40 percent. Brandon Bass led the way with 12 points. Knight had 14 first-half points for the Bucks, who shot 44 percent. The Celtics had 11 second-chance points compared to just one for the Bucks.\nIt was back and forth through the first two quarters with 10 lead changes and six ties.\nBoston held a 26-24 lead after the first quarter, sparked by Bass, who had all 12 of his first-half points in the quarter.\nBoston shot 48 percent for the game, compared with 43 percent for Milwaukee.\nGame notes\nMilwaukee C Larry Sanders was diagnosed with a fractured orbital bone in his right eye. He was injured when he was elbowed by James Harden in Saturday's game against the Houston Rockets. He's expected to be out at least through the All-Star break, coach Larry Drew said. ... The Bucks also were without Caron Butler (ankle), Ersan Ilyasova (back) and O.J. Mayo (illness). Luke Ridnour (back) and Ekpe Udoh (ankle) returned to the lineup. ... Celtics G Rajon Rondo sat out after logging a season-high 37 minutes Sunday. He's been limited from playing in back-to-back games as he recovers from ACL surgery. \"I think he'll be playing back-to-backs very soon,\" Boston coach Brad Stevens said. ... Celtics' starting G Avery Bradley (sprained right ankle) also was out of the lineup. He's scheduled to undergo an MRI on Tuesday.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.937608",
  "pipeline_version": "v1"
}