{
  "game_id": "0021300915",
  "espn_id": "400489788",
  "date": "Mar 06, 2014",
  "matchup": "OKC @ PHX",
  "headline": "Gerald Green's career-best 41 help Suns race by Thunder",
  "cleaned_body": "PHOENIX -- Gerald Green came to the NBA straight from high school with an abundance of raw talent that never translated into a big-time pro career.\nThen came his offseason trade to Phoenix -- his seventh team in seven seasons -- and he seems finally to have found a home.\nOn Thursday night, especially in one remarkable quarter, Green was as good as it gets against one of the best teams in the NBA.\nHe scored 25 of his career-high 41 points in the third quarter and the Suns erased a 16-point deficit to beat the Oklahoma City Thunder 128-122.\n\"I haven't done nothing in this league,\" Green said. \"Every day I come into practice or come into a game, I'm just trying to prove myself.\"\nMarkieff Morris added 24 points, including two free throws with 24.4 seconds to play. Goran Dragic scored 22, including six of the Suns' final 12 points after Oklahoma City led 118-116.\nRussell Westbrook scored a season-high 36 for the Thunder, who would have pulled a half-game ahead of Indiana for the NBA's best record with a victory. Kevin Durant added 34.\nGreen's outburst fell one point shy of a Suns record for most points in a quarter set by Stephon Marbury in 2002. His career-best eight 3-pointers also was one shy of the franchise mark.\n\"I love the way he's playing right now,\" Suns coach Jeff Hornacek said. \"We knew he could shoot the ball. There's not too many guys that can get on a roll like that. The thing that makes him unique (is) some guys you can get up into and maybe challenge a shot a little harder. But Gerald just jumps over everybody. He's making shots that other guys can't get that high to shoot.\"\nIt was Phoenix's second 40-point performance in four games. Dragic had 40 against New Orleans on Friday. Green set a career high for the second time this season. He had 36 at Denver on Feb. 18.\nIn the third quarter, Green was 7 of 11, including 6 of 6 on 3s. Fouled on a 3-pointer with 6.9 seconds left, Green missed one of the three free throws or he would have tied Marbury's franchise record.\n\"I was just feeling it, man,\" he said. \"Guys were finding me in transition. I was just being real aggressive. ... I'm not afraid to take big shots. I'm not afraid to take any type of shot. `'\nThe Thunder had won three in a row, but have lost four of seven.\n\"We gave up 15 3s and we put them on the free throw line 39 times,\" Oklahoma City coach Scott Brooks said. \"You've got to get back. We've been talking about it for about 10 days now. You've got to get back in a defensive disposition when we play these teams who are small and fast and quick.\"\nWestbrook agreed.\n\"Defensively, that's got to be our identity,\" he said. \"We can score with the best of them, but we've got to be able to stop them.\"\nAfter trailing by as many as 16 in the quarter, the Suns scored the final 14 points of the third to lead 101-98 entering the fourth. The run reached 21-3 when Marcus Morris' 3 put Phoenix up 108-101 with 9:34 to play.\nBut Westbrook brought the Thunder back. He made three 3s, the last to tie it at 116 with 4:34 to play. Ibaka's dunk put Oklahoma City back on top, 118-116, with 4:10 to go.\nDragic tied it with a driving layup with 2:22 left, then his reverse layup gave the Suns a 118-116 lead with 2:02 left. He was fouled on the play but missed the free throw, one of 10 misses from the line by Phoenix. Oklahoma City was 19 of 19.\nMarkieff Morris scored to make it 122-118 with 1:11 left, then Durant cut it to 122-120 with 1:01 to go. Dragic's 16-footer boosted the lead to 124-120 with 45.9 seconds remaining. Durant scored again to make it 124-122 with 40.9 seconds left. But Morris made two free throws, then twin brother Marcus made two more with 5.6 seconds to go.\nUp by four at the half, Oklahoma City used a 13-3 surge to build a 96-80 lead on Caron Butler's fourth 3-pointer with 3:47 left in the third.\nGame notes\nThe Suns were without center Miles Plumlee for the second game in a row with a sprained shoulder. ... Phoenix G Eric Bledsoe is close to playing and could be back in any of the coming three games. ... The Thunder had won three in a row in Phoenix. ... Oklahoma City's 41-point first quarter was its highest-scoring quarter of the season and the highest-scoring quarter for a Suns opponent.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.299536",
  "pipeline_version": "v1"
}