{
  "game_id": "0021400882",
  "espn_id": "400579174",
  "date": "Mar 01, 2015",
  "matchup": "CHA @ ORL",
  "headline": "Williams helps Charlotte hold off Orlando 98-83",
  "cleaned_body": "ORLANDO, Fla. --  Mo Williams is going to have to do more than just score to get Charlotte to the playoffs this season. He also needs to distribute the ball like he did Sunday night against Orlando.\n\nWilliams had 23 points and 11 assists, leading the Hornets to a 98-83 victory over the Magic.\n\n\"I'm a player that takes what the defense gives us,\" Williams said. \"The last three games or so, they've been backing off, and my strength is shooting pull-up jumpers. ... Tonight they were showing so I wanted to give up the ball out pretty quick so guys could make plays on the backside.\"\n\nIt was the fifth straight double-digit scoring game for Williams and his second time with double-digit assists since being dealt to Charlotte at the trade deadline.\n\n\"I certainly didn't expect him to score like this so consistently,\" Hornets coach Steve Clifford said. \"I thought he would play smart ... and he's very verbal, good with his teammates. But he's been so efficient offensively.\"\n\nCody Zeller, Al Jefferson and Gerald Henderson had 16 points apiece for Charlotte, which had dropped six of seven.\n\nThe Hornets carried an 11-point lead into the fourth quarter, but had to fight off a Magic surge that got them as close as four in the final period.\n\nVictor Oladipo led the Magic with 21 points. Tobias Harris added 13 points and nine rebounds.\n\nOrlando has lost three straight since a season-high three-game win streak.\n\nA jumper by Ben Gordon trimmed what had been a 15-point Hornets advantage to 74-70 in the fourth quarter. But the Hornets quickly responded, using an 8-0 spurt to stretch their lead back to a dozen with just over five minutes to play.\n\nThe momentum stayed with Charlotte over the next several minutes, with its advantage increasing to as many as 17.\n\n\"We couldn't consistently get shots,\" Magic interim coach James Borrego said. \"We were turning it over, getting poor shots.  Those balls weren't going through the hoop. And I felt like we were getting back in transition defense all night.\"\n\nThe Hornets had nine first-half turnovers, but took a one-point lead into intermission thanks to a poor shooting performance by the Magic.\n\nOrlando was 16 for 45 (35 percent) in the opening 24 minutes and finished just 31 for 85 for the game (36 percent).\n\nTIP-INS\n\nHornets: Charlotte outscored Orlando 18-7 on fast-break points. ... Sunday's matchup with the Magic started a stretch of 17 games over the next 30 days for Charlotte.\n\nMagic: Orlando has held its last nine opponents to fewer than 100 points. It's the third longest such streak in NBA this season. The longest streak is 10 games by Charlotte and Cleveland. ... Aaron Gordon (right ankle) and Evan Fournier (hip) were inactive.\n\nBISMACK IS BACK\n\nHornets F/C Bismack Biyombo returned to the lineup after missing 11 games with a bone bruise in his right knee. His timing was off at times in his 14 minutes. He finished with three points, three rebounds and two turnovers.\n\nSHORT-LIVED LEADS\n\nThe Magic led just twice for a total of 25.4 seconds.\n\nAndrew Nicholson's hook in the lane capped a 9-2 run that gave Orlando its first lead at 31-30 in the second quarter. That lasted for just 20 seconds before a Marvin Williams 3-pointer put the Hornets back in front.\n\nChanning Frye put the Magic up 42-41 with 5.4 seconds left in the half, but Henderson sprinted ahead and got free for a jumper at the buzzer.\n\nUP NEXT\n\nHornets: Host the Los Angeles Lakers on Tuesday.\n\nMagic: Host Phoenix on Wednesday.\n\n---\n\nFollow Kyle Hightower on Twitter at http://www.twitter.com/khightower",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.996605",
  "pipeline_version": "v1"
}