{
  "game_id": "0021301168",
  "espn_id": "400490041",
  "date": "Apr 09, 2014",
  "matchup": "MIL vs. IND",
  "headline": "Pacers edge Bucks, creep back into 1st with starters benched",
  "cleaned_body": "MILWAUKEE -- When Indiana Pacers coach Frank Vogel benched his starters for the entire game against the Milwaukee Bucks on Wednesday night, it meant extended playing time for the team's reserves.\nChris Copeland made sure to take advantage.\nCopeland scored a season-high 18 points and made a difficult driving layup with 1.2 seconds remaining, giving the Pacers a hard-fought 104-102 win that moved them back into first place in the Eastern Conference.\n\"It's big for our confidence, the second unit,\" said Copeland, who went in averaging three points per game. \"Just to get the opportunity out there. A lot of us have been waiting for that all year. So it was very cool for us to get out there and get a win and show the starters that we've got their backs when they need rest.\"\n\nCopeland also tied a career high with four 3-pointers and matched a season high with 17 minutes of playing time.\nFollowing a pair of timeouts, the Pacers inbounded the ball to Copeland, who drove hard to the basket for the winning shot.\n\"I tried to rip through to the basket and tried to use my size,\" Copeland said. \"I saw help coming, so I shot it.\"\nCopeland's shot came after Milwaukee's Khris Middleton had tied the game at 102 by making three free throws. Middleton drew a foul while attempting a shot near the 3-point arc with 4.9 seconds remaining that referees initially ruled a 2-point attempt. After a review, the call was reversed, sending Middleton to the line for three shots.\nLuis Scola also recorded a season high with 24 points and Evan Turner added 23 for Indiana.\nVogel made the unusual move to keep all of his regular first-team players on the bench after saying his team appeared tired following a 107-88 home loss to Atlanta on Sunday, when the Pacers were held to a franchise-low 23 points in the first half.\n\"It was a great win for our guys, a great team effort,\" Vogel said. \"We had a lot of good contributors.\"\nEven without the starters, Indiana moved a half-game ahead of the Heat heading into Friday's matchup in Miami.\nAfter leading the East most of the season, the Pacers had lost five of six games going into the matchup with the Bucks. Still, the Pacers went in just a half-game behind Miami, which lost at Memphis.\nThe Bucks, who had only eight players available due to injuries, have lost six in a row and were on the losing end of all four games with the Pacers this season. Brandon Knight had 25 points and Ramon Sessions 20 for Milwaukee. Jeff Adrien pulled down a career-high 17 rebounds.\nThe game featured 23 lead changes.\nUsual Indiana starters Paul George, David West, George Hill and Lance Stephenson dressed but didn't play. Another starter, Roy Hibbert, was inactive for the game. All five are expected to start against the Heat. Vogel insisted that the move would allow the starters to get some minor injuries healed and allow his reserves to play extended minutes.\nThe Pacers' starting lineup consisted of Scola, Turner, Rasual Butler, Ian Mahinmi and Donald Sloan. The five had a combined scoring average of 21.7 points, equal to George's per-game average.\n\"It was great for us starting guys to sit out and get some rest as well as our bench rotation guys to get some rhythm going late into the season,\" Hill said. \"It's tough to be a spectator. But I had to be a good teammate.\"\nAdrien wasn't pleased with the benching of the Pacers' starters.\n\"It was kind of like a smack in our face,\" he said.\nSessions also was surprised to see Indiana's entire starting lineup on the bench.\n\"They are fighting for something so it was a little surprising to see those guys sit,\" he said.\nThe Pacers built a nine-point lead in the fourth before the Bucks' late rally.\nIndiana held a 53-50 lead at the half, paced by Scola's 16 points and 14 from Turner. Sessions and Knight each had 11 first-half points for the Bucks.\nThe game was tied at 25 after the first quarter. Scola tallied 12 points in the period for Indiana.\nGame notes\nIndiana guard C.J. Watson returned after missing 13 consecutive games with a hamstring injury. ... Milwaukee center Larry Sanders was activated and began serving his five-game suspension for failed drug tests. ... New Marquette University men's basketball coach Steve Wojciechowski attended the game.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.608086",
  "pipeline_version": "v1"
}