{
  "game_id": "0021300337",
  "espn_id": "400489210",
  "date": "Dec 13, 2013",
  "matchup": "CHI @ MIL",
  "headline": "Bulls edge Bucks on Mike Dunleavy's late 3-pointer",
  "cleaned_body": "MILWAUKEE -- As last-second, game-winning 3-pointers go, this one wasn't the prettiest.\nBut it got the job done, and that's the only thing that mattered to Mike Dunleavy and the Chicago Bulls.\n\nAt this point, the Bulls will take whatever offense they can get.\nDunleavy banked in a three-pointer with 5.8 seconds left and Joakim Noah came up with a block on the other end, leading the Bulls to a 91-90 comeback victory over the Milwaukee Bucks on Friday night.\nDunleavy said he had to change the angle of his shot to avoid the reach of his defender, 6-foot-11 forward John Henson.\n\"He's so long so if I would have shot my normal shot, he might have got a piece of it,\" Dunleavy said. \"So basically what I'm saying is, I took a bad shot and it went in.\"\nTrailing by two in the final seconds, Chicago came up with a tie-up on the defensive end and won the jump ball, allowing Dunleavy to hit a high-arching 3 that banged off the glass, then in, for the lead.\nNoah then blocked O.J. Mayo's shot to preserve the lead -- and a victory that appeared unlikely just seconds before.\n\"You could see his rhythm coming offensively,\" Bulls coach Tom Thibodeau said of Noah. \"Defensively, he's been terrific from the start of the season but offensively, you can see his timing is back.\"\nNoah scored 21 points and grabbed 18 rebounds -- both season highs -- for the Bulls, who ended a three-game losing streak. Chicago scored fewer than 80 points in all three of those losses -- including one to Milwaukee in Chicago on Tuesday.\nJimmy Butler scored 16 points in his return from injury for Chicago.\n\"I felt all right,\" Butler said. \"Rusty. Out of shape. Terrible. But I'm glad my guys pulled this win out.\"\nCarlos Boozer scored 14 points and added 12 rebounds.\nGary Neal scored 17 points and Henson added 15 for the Bucks, who appeared to have the game won when Khris Middleton hit a desperation shot with 29.8 seconds left. Instead, it was another disappointment.\n\"It wasn't even really supposed to get to that point, but we made some mistakes, critical mistakes, and that's what happens,\" Henson said.\nAnd to make matters worse for the Bucks, a crowd filled with traveling Bulls fans made it sound like a home game at times for Chicago -- especially at the end, when Dunleavy's shot set off a thunderous ovation.\nThat's not a new phenomenon when the Bulls visit Milwaukee -- but to Henson, it is somewhat annoying.\n\"A little bit, man,\" Henson said. \"But, hey, they're an hour away. It was a Bulls crowd.\"\nMilwaukee went on a 12-4 run to take an 11-point lead with 7:37 remaining. The Bulls chipped away at the lead, but Henson passed to a wide-open Ekpe Udoh on the baseline and Udoh delivered an emphatic dunk for an 88-83 lead with 1:30 left.\nMayo then fouled Dunleavy on a three-point attempt, and Dunleavy hit all three free throws to cut the lead to two. After a Milwaukee miss, Boozer made a game-tying jumper with 54.9 seconds left.\nMiddleton then hit a desperation shot with the clock running out, giving Milwaukee a two-point lead. Butler was called for traveling on the other end and the game appeared to be all but over -- but it was only setting the stage for Dunleavy's big moment.\n\"He hit a tough shot,\" Bucks coach Larry Drew said. \"It wasn't an easy shot. It was a contested shot. But I'll say it again: It should not have come down it (that). We were in position where we should have closed that game out.\"\nWhile Derrick Rose's season-ending knee injury has garnered the most attention, it hasn't been the only critical injury for Chicago this season.\nButler missed 11 games because of a toe injury and the Bulls are still without Luol Deng, who remains sidelined with a sore left Achilles.\nChicago added some depth earlier in the day Friday, signing free agent guard D.J. Augustin. Augustin was scoreless in 11-plus minutes in his Bulls debut.\nGame notes\nDrew said guard/forward Carlos Delfino will have surgery on his right foot in his native Argentina on Saturday. There is no timeline for his return. . Larry Sanders has been fitted with a protective glove and cleared to resume some basketball activities, but there is no timeline for his return from a thumb injury. ... Thibodeau said Deng is feeling better and could be available for Saturday's game.",
  "tags_rule": [
    "MomentumShift",
    "Streak",
    "CoachComment",
    "InjuryReport",
    "ClutchShot"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.933907",
  "pipeline_version": "v1"
}