{
  "game_id": "0021300829",
  "espn_id": "400489702",
  "date": "Feb 22, 2014",
  "matchup": "MIL vs. IND",
  "headline": "George, West help Pacers hold on against Bucks",
  "cleaned_body": "MILWAUKEE -- Seemingly cruising to a blowout victory, the Indiana Pacers let off the gas -- and let the Milwaukee Bucks back in the game.\nIn the end, Paul George, David West and Lance Stephenson were enough to put away the Bucks.\nGeorge scored 32 points and West tied a season high with 30, helping the Pacers hang on to beat the Bucks 110-100 on Saturday night.\n\"Our focus wasn't where it should have been,\" West said. \"But we made enough plays down the stretch to win the game. They came out hot in the third quarter and had us on our heels.\"\nStephenson added 24 points, nine rebounds and eight assists for the Pacers, who had lost three of their previous five games.\nStephenson scored seven straight points to open the fourth quarter. He, George and West combined to score 33 of the Pacers' 35 points in the fourth.\n\"He kept delivering so we kept going to him,\" Pacers coach Frank Vogel said of West. \"And when they double him, we made them pay from the 3-point line. He was pretty special tonight, and Paul was Paul, and Lance took advantage of their two point-guard lineup and had a really strong night.\"\nBrandon Knight scored 30 points for Milwaukee, including 20 in the first half. Khris Middleton added 13 for the Bucks, who had to take solace in fighting back from a 22-point, first-half deficit against one of the league's elite teams.\n\"That's, in my opinion, a top-two team in the NBA,\" Knight said. \"And for us to not give in, not to lay down, means a lot for our team. Because there have been times throughout the season when we've laid down when we get down 20.\"\nWith the Pacers leading by seven at the end of the third quarter, Stephenson opened the fourth with a pair of inside scores and a 3-pointer, extending the lead to 82-68. Milwaukee kept the game close into the final minutes, but West hit a jumper with 48 seconds left to help put away the game.\n\"Defensively, just had breakdown after breakdown right when I thought when the game was within striking distance,\" Bucks coach Larry Drew said. \"But against good teams, you can't make those kind of mistakes.\"\nIndiana led by as many as 22 points in the first half, and by 12 at halftime, largely because of their defense. Knight shot 8 for 14 from the field in the first half for Milwaukee, and the rest of the Bucks shot a combined 7 for 27. But a quick 11-2 run by Milwaukee to begin the third quarter cut the lead to three.\n\"We're a veteran group and they are a young team,\" George said. \"But leads don't last. We've been in this position before where we've been up early and teams have been able to come back. That's an area where we've got to improve. Once we get up big we've got to be able to maintain that lead or push it further.\"\nThe Pacers were without deadline-day acquisition Evan Turner, who was back in Indianapolis getting a physical exam. Turner is expected to join the team on Sunday.\nVogel acknowledged that it was difficult for the team to part ways with popular veteran Danny Granger, who was sent to Philadelphia in the deal for Turner. Vogel addressed it with the team on Friday.\n\"We had a good, I think, team strengthening meeting yesterday before practice,\" Vogel said.\nThe Bucks managed to work in guard Ramon Sessions and forward Jeff Adrien, two players they acquired from Charlotte before Thursday afternoon's trade deadline.\nAdrien contributed right away, scoring twice and throwing an alley-oop to Giannis Antetokounmpo for a dunk in his first four minutes on the floor. He finished the night with 11 rebounds in 18 minutes, providing the Bucks a much-needed physical presence.\n\"You're not going to intimidate this kid, he'll stand toe-to-toe,\" Drew said. \"I told him I didn't care if he fouled out. I wanted him to be physical and be who he is.\"\nGame notes\nMilwaukee guard Nate Wolters left the game with a sprained left ankle. ... Vogel said the team's trainer has \"just killed\" center Andrew Bynum with conditioning work, and Bynum has responded well. Bynum hasn't played since falling out of favor in Cleveland, getting traded to Chicago and being released. ... The Bucks had a \"Y2K night\" promotion, including a halftime concert by rap artist Coolio and a guest appearance by iconic player Glenn \"Big Dog\" Robinson.",
  "tags_rule": [
    "InjuryReport",
    "FoulTrouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.993437",
  "pipeline_version": "v1"
}