{
  "game_id": "0021401073",
  "espn_id": "400579365",
  "date": "Mar 26, 2015",
  "matchup": "MIL vs. IND",
  "headline": "Ersan Ilyasova scores career-best 34 as Bucks hold off Pacers",
  "cleaned_body": "MILWAUKEE -- Struggling with early-season injuries and the adjustment to a new coaching staff, Ersan Ilyasova hasn't quite been himself for the Milwaukee Bucks.\nThat is beginning to change, just as the Bucks reach the most critical point of their playoff push.\nIlyasova followed up a recent run of good performances with a breakthrough game, scoring a career-high 34 points in the Bucks' 111-107 victory over the Indiana Pacers on Thursday night.\n\"Sometimes, you have days like this,\" Ilyasova said.\nGeorge Hill missed a potential tying 3-pointer in the closing seconds for struggling Indiana.\n\"It felt good,\" Hill said. \"It was probably the best shot all day, just the worst result.\"\nKhris Middleton added 17 points and Giannis Antetokounmpo had 16 for the Bucks. They have won two straight after breaking a six-game losing streak.\nIlyasova was 12-of-14 from the field and 5-of-6 from 3-point range.\n\"He was cooking,\" Bucks coach Jason Kidd said. \"He was aggressive, he took open shots, he just didn't settle. He also put the ball on the floor. Everything that he shot pretty much went in.\"\nC.J. Miles scored 26 points, Hill added 24 and C.J. Watson had 23 for the Pacers. They were without forward David West because of an allergic reaction.\nWere the Pacers tired after ending a six-game losing streak in Washington on Wednesday?\n\"No excuse,\" Pacers coach Frank Vogel said. \"We played six straight teams with back-to-backs. Some of them came in with a lot of energy. I thought we played with energy but we just weren't very good early.\"\nMilwaukee jumped on Indiana early and led by double digits for most of the game.\n\"You can't spot a team 23 points and expect to win,\" Vogel said. \"I'm proud of our fight and how they got back into it but you can't start that way.\"\nThe Pacers began to chip away in the fourth quarter, thanks in large part to a flurry of 3-pointers by Hill.\nStill, the Bucks appeared to be on their way to putting the game away, only to have Michael Carter-Williams foul Watson on a 3-point attempt. Watson hit two of three free throws to cut the lead to four with 1:31 left.\nMiles missed a 3-point attempt for Indiana, but officials gave the ball to Indiana on a review of an ensuing out of bounds play. Roy Hibbert then hit a jumper to cut the lead to two with 19.9 seconds left.\nAntetokounmpo was fouled and hit one of two free throws, giving Indiana the ball trailing by 3 with 11.6 left. Hill then missed a frantic 3-point attempt with 1.8 seconds remaining, and Jerryd Bayless hit a free throw to seal the game for Milwaukee.\n\"We've had big leads, we've lost leads, we keep fighting to find a way to get back to the lead then understand we had to get a stop,\" Kidd said. \"I thought the last play was big.\"\nTIP-INS\nPacers: Indiana allowed Milwaukee to shoot 73.7 percent from the field in the first quarter. ... Miles hit three straight 3-pointers in the second. ... Luis Scola was called for a flagrant foul 1 after a video review of his foul on Carter-Williams in the third quarter.\nBucks: Ilyasova had 17 points in the first quarter, hitting three of four 3-point attempts. Forward Jared Dudley, who missed three games because of back spasms, returned Thursday. ... The team did not re-sign forward Chris Johnson after signing him to a pair of 10-day contracts earlier in the month. Kidd expected Johnson to sign with Utah.\nUP NEXT\nPacers: Sunday vs. Dallas.\nBucks: Saturday vs. Golden State.",
  "tags_rule": [
    "Streak",
    "PhysicalGame",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.317269",
  "pipeline_version": "v1"
}