{
  "game_id": "0021701109",
  "espn_id": "400975855",
  "date": "Mar 27, 2018",
  "matchup": "TOR vs. DEN",
  "headline": "DeRozan scores 15, Raptors beat Nuggets 114-110",
  "cleaned_body": "TORONTO --  As the losses pile up and a playoff berth slips further out of reach, Denver Nuggets coach Michael Malone is bewildered by his team's lack of urgency.\n\nDeMar DeRozan, Jonas Valanciunas, and Fred VanVleet each scored 15 points and the Toronto Raptors beat the Nuggets 114-110 on Tuesday night.\n\nNikola Jokic had 29 points and 16 rebounds, and Paul Millsap scored 20 points for the Nuggets, who lost their second straight and fourth of six.\n\n\"We have seven games to go,\" Malone said. \"Every damn play matters, and right now we're not playing like every play matters. We're playing like we have 30 games to go in the season and I can't explain that. It's unacceptable.\"\n\nJamal Murray scored 15 points and fellow Canadian Trey Lyles had 13 for the Nuggets.\n\n\"All the fundamental things it takes to win a basketball game, we're not doing right now,\" a downcast Murray said.\n\nJakob Poeltl scored all of his 12 points in the fourth quarter, including eight straight for Toronto at one stretch.\n\n\"He played great, with intensity,\" Raptors coach Dwane Casey said. \"He was locked in. I was really proud of the way he played.\"\n\nSerge Ibaka had 13 points, Pascal Siakam 12 and Kyle Lowry 11 as the Raptors improved to 31-7 at home.\n\nThe Raptors outscored the Nuggets 53-29 in bench points.\n\n\"Give their guys credit, their bench was fantastic,\" Malone said. \"They're one of the better benches in the NBA and they showcased it again tonight.\"\n\nToronto, which lost to the Clippers on Sunday, avoided what would have been its fifth two-game losing streak. The Eastern Conference-leading Raptors have yet to lose three consecutive games this season.\n\nDenver, which lost at Philadelphia on Monday, was playing the sixth game of a seven-game road trip, but Malone didn't want to use fatigue as an excuse.\n\n\"Right now, the urgency that we need to have supersedes the fatigue factor,\" he said.\n\nUp 85-82 through three quarters, Denver reeled off five straight points in the first minute of the fourth to open an eight-point advantage. Toronto answered with a 13-2 spurt over the next four minutes. Denver called timeout after VanVleet's driving layup gave the Raptors a 95-92 lead with 6:55 to play.\n\nToronto led 111-101 after Poeltl capped his outburst with a layup with just over a minute left. Back-to-back 3-pointers by Murray and Wilson Chandler cut it to 111-107 with 18 seconds remaining. After VanVleet made a pair of free throws, Jokic banked home a 3 to make it 113-110 with 10 seconds to go, but Denver couldn't get any closer.\n\nLowry scored nine points in the first and Wright banked home a half-court heave at the buzzer to give Toronto a 25-23 lead after one. Denver shot 1 for 8 from 3-point range in the first, but went 8 for 8 at the free throw line.\n\nA 3 by Lyles gave Denver a 47-39 lead with 5:43 left in the second but Valanciunas scored eight points and Ibaka had six as the Raptors rallied to tie it at 58 at halftime.\n\nMillsap scored 12 points in the third.\n\nTIP-INS\n\nNuggets: Leading scorer Gary Harris (right knee) missed his sixth straight game. ... Jokic had eight assists. ... Denver shot 14 for 21 in the second. ... The Nuggets are 13-25 on the road.\n\nRaptors: Toronto is 19-11 against Western Conference opponents. ... Lowry and DeRozan each had eight assists.\n\nBLOCK PARTY\n\nToronto blocked a season-high 16 shots. Ibaka, Lowry, and Valanciunas each had four blocks.\n\nBACK-TO-BACK BLUES\n\nThe Nuggets are 4-10 in the second game of back-to-backs.\n\nLONG RANGE RUN\n\nToronto has made 10 or more 3-pointers in 17 consecutive games, a franchise record.\n\nUP NEXT\n\nNuggets: Conclude a seven-game road trip at Oklahoma City on Friday.\n\nRaptors: Visit Boston on Saturday. The Raptors and Celtics meet twice in Toronto's next three games.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.462847",
  "pipeline_version": "v1"
}