{
  "game_id": "0021401131",
  "espn_id": "400579423",
  "date": "Apr 03, 2015",
  "matchup": "CHI vs. DET",
  "headline": "Gasol helps Bull hold on for 88-82 win over Pistons",
  "cleaned_body": "CHICAGO -- Pau Gasol was simply trying to redeem himself for two mistakes. He did more than that and helped the Chicago Bulls get a big win.\nGasol had 26 points and 10 rebounds for his 50th double-double of the season, helping the Bulls beat the Detroit Pistons 88-82 on Friday night. Gasol became the first Bulls player to reach 50 double-doubles since Charles Oakley had 53 during the 1986-87 season.\nGasol secured the feat -- and the win -- with 5.7 seconds to play when he had a tip-dunk of Taj Gibson's miss and got fouled by Andre Drummond. Gasol hit the free throw, giving Chicago a four-point lead and finishing an important win for the Bulls.\nThat followed a sequence when Drummond blocked Gasol's shot before beating the Bulls' big man for a layup to cut Chicago's lead to 83-82.\n\n\"Just trying to make up for two bad plays,\" Gasol said.\nJimmy Butler scored 18 points and Joakim Noah added nine rebounds and 10 assists for the Bulls, who won for the fourth time in five games. Chicago pulled ahead of Toronto for third place in the Eastern Conference after the Raptors' loss to the Brooklyn Nets.\n\"It was an ugly win and we found a way,\" Noah said. \"That's important.\"\nThe Bulls got the win despite another strong performance from Drummond.\nReggie Jackson had 22 points and nine assists for Detroit, while Drummond had 14 points, 22 rebounds and six blocks. Kentavious Caldwell-Pope added 14 points as the Pistons fell to 24-24 since starting the season 5-23. The Pistons had won five of seven but entered play five games out of the final playoff spot in the Eastern Conference.\nDrummond became the first player in Pistons history to have at least 1,000 points, 1,000 rebounds and 100 blocks in consecutive seasons.\n\"Andre competed really hard,\" Pistons coach Stan Van Gundy said. \"I was really happy with him tonight.\"\nThis was the teams' first meeting since the Pistons' 107-91 win over the Bulls on March 21. In that game, the Bulls led by 12 at halftime but were outscored 63-35 over the final 24 minutes.\nThis game was much closer.\nChicago took a 53-37 lead with 9:48 left in the third on Gasol's jumper, but the Pistons answered with a 13-0 run. The spurt included a circus shot by Jackson with 7:40 to go when he scooped an underhanded shot around Noah with the shot clock running out.\nDetroit tied the game at 78 with 2:25 to play on Caldwell-Pope's layup. The Bulls' Aaron Brooks answered with a 3-pointer and a layup, putting Chicago in front 83-78 with 1:15 left.\n\"(Brooks) had some big plays and stuck with it even when it wasn't going his way,\" Bulls coach Tom Thibodeau said. \"Ultimately, he did what he could to help us win.\"\nDrummond hit two free throws with 57.3 to play, and then blocked Gasol's jumper. Drummond followed with a layup to slice Chicago's lead to 83-82 with 30.8 to play, setting up Gasol's heroics.\n\"That last play of the game really killed us. It hurt. Definitely hurt,\" Drummond said. \"Playing that hard to come back and for something like that to happen at the end of the game is a terrible feeling.\"\n---\nTIP-INS\nPistons: Tayshaun Prince scored four points to get within 18 of 10,000 as a member of the Pistons. Prince was a Pistons' first-round pick in the 2002 draft, was dealt to Memphis in Jan. 2013 and returned to Detroit after a Feb. 19 trade from Boston. ... Drummond (13.3) and Greg Monroe (10.4) began the day leading the NBA in most rebounds by a duo at 23.7 per game. The Bulls' combo of Gasol and Noah was third at 21.6\nBulls: Thibodeau said Derrick Rose (right knee) will travel with Chicago for Sunday's game in Cleveland. ... With one block, Noah pulled within one of Scottie Pippen's 774 for second in Bulls history. Michael Jordan (828) is Chicago's all-time leader. ... Kirk Hinrich (left knee) was out and Doug McDermott (back soreness) was available for Friday's game but didn't' play.\nALL ABOUT DERRICK\nWhen Rose returns he will start off with limited minutes. He will also start off with some patience. \"I thought right prior to the All-Star break, that was his best stretch of basketball,\" Thibodeau said. \"But it took him time to get there, and we have to understand that.\"\nNOT GOOD ENOUGH\nVan Gundy is near the end of his first season in control of the Pistons, and he doesn't think he's \"done a real good job.\n\"I think there's more to this team than I've gotten out of them,\" he said. His biggest complaint with his work? \"Where I haven't really done a good job and I guess I'm most disappointed with myself is that we have not come as far defensively as we should have come at this point.\"\nOPPOSITES\nThe Bulls outscored the Pistons 22-9 during the second quarter. Detroit's nine points were a season-low in a quarter for the Pistons and also a Bulls opponent. Then during the third, the Bulls only scored 12 points.\nUP NEXT\nPistons: Host Miami on Saturday night.\nBULLS: At Miami on Sunday.",
  "tags_rule": [
    "DoubleDouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.617687",
  "pipeline_version": "v1"
}