{
  "game_id": "0021400591",
  "espn_id": "400578883",
  "date": "Jan 16, 2015",
  "matchup": "CHI @ BOS",
  "headline": "Rose's double-double leads Bulls over Celtics 119-103",
  "cleaned_body": "BOSTON -- After starting their second-half surge inside, the Chicago Bulls went outside to finish off the Boston Celtics.\nDerrick Rose scored 20 of his 29 points in the second half and hit three of Chicago's seven 3-pointers in the fourth quarter as the Bulls pulled away to beat Boston 119-103 on Friday night.\n\"They're just going in,\" said Rose, whose five 3-pointers were one shy of his career best.\nRose, who was coming off a season-high 32 points Wednesday against Washington, made 12 of 20 shots and was 5 for 8 from 3-point range. He also had 10 assists for just his second double-double of the season, and didn't turn the ball over once.\n\"Derrick was great on both sides of the ball and that's huge for us,\" Chicago coach Tom Thibodeau said. \"What you're seeing is Derrick is getting stronger and stronger, he's gaining more confidence, and he's getting that edge back.\"\nThat's good news for Chicago, which had lost two straight and four of five. The Bulls were also without center Joakim Noah, out with a sprained ankle.\nThe Bulls did just fine with Noah on the bench, using only eight players and turning a close game into a blowout in the second half.\nPau Gasol scored 14 of his 20 points in the third quarter and led Chicago with 11 rebounds. Jimmy Butler added 22 points and six of Chicago's 12 steals. Aaron Brooks added 15 points for the Bulls, who were 27 for 41 in the second half and outscored Boston 31-17 in the fourth quarter.\n\"We started the game off pretty well until the second quarter. We kind of let the pressure down and allowed them to get more comfortable,\" Gasol said. \"In the second half we did a better job defensively.\"\nJared Sullinger had 20 points and eight rebounds for the Celtics, who shot 60 percent in the first half and held a 58-55 halftime lead but could not keep up with the Bulls in the second.\n\"We weren't as tight as we need to be against that level of talent,\" Boston coach Brad Stevens said. \"We were loose in our coverages and a little loose on the ball and it hurt us.\"\nKelly Olynyk added 14 points and nine rebounds, Brandon Bass scored 16 and Tyler Zeller had 12 points for Boston.\nThe Bulls picked up their defense early in the third and capitalized on a series of Boston turnovers.\nAfter Boston pulled to 88-86 at the end of the third, Chicago started strong again in the fourth with an 11-4 run. E'Twaun Moore and Aaron Brooks hit consecutive 3s as the Bulls pulled ahead 99-90, then after a basket by Bass, Chicago went on a 12-2 spurt, with Brooks and Rose hitting back-to-back 3s for a 111-94 lead.\n---\nNO NOAH\nNoah, scheduled for an MRI on his sprained right ankle Saturday, appeared in the final boxscore despite being inactive. Noah carried his enthusiasm from the bench a little too far and received a technical foul with 4:34 left in the third quarter.\n\"That's Jo,\" Rose said. \"We roll with him. We understand him.\"\nFEW FOUL SHOTS\nIt was a quiet night for both teams at the foul line. Rose was one of three Chicago players without a free throw attempt. The Bulls made 10 of 12 foul shots while Boston was 14 for 16.\nTIP-INS\nBulls: Taj Gibson had 13 points and eight rebounds. ... All but one starter scored in double figures. Kirk Heinrich finished with six points. ... Thibodeau was called for a technical early in the second quarter.\nCeltics: Boston made 12 of 20 shots in each of the first two quarters. ... The Celtics played again without recent acquisitions Tayshaun Prince, Shavlik Randolph and Chris Douglas-Roberts. All three were picked up in recent trades but have yet to play for Boston. ... The Celtics were playing at home for the last time before a six-game Western Conference road trip.\nUP NEXT\nBulls: Host Atlanta on Saturday night.\nCeltics: At Los Angeles Clippers on Monday.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.467201",
  "pipeline_version": "v1"
}