{
  "game_id": "0021400616",
  "espn_id": "400578908",
  "date": "Jan 19, 2015",
  "matchup": "MEM vs. DAL",
  "headline": "Dirk Nowitzki takes over late to lead Mavericks past Grizzlies",
  "cleaned_body": "MEMPHIS, Tenn. -- When the Memphis Grizzlies went ahead with 4 minutes left, it was time for Dirk Nowitzki to take over.\nNowitzki scored 21 points, including the last eight for Dallas in the final 2 minutes, to lead the Mavericks past the Grizzlies 103-95 on Monday.\nThe Grizzlies took a two-point lead with about 4 minutes to go, but Dallas outscored Memphis 14-4 the rest of the way. Nowitzki hit a pair of mid-range fadeaway jumpers, a layup and then closed out the scoring with two free throws.\n\"I've got to be better and pick my spots when they're there and just be more efficient,\" Nowitzki said.\n\nMonta Ellis led the Mavericks with 25 points and seven assists. Chandler Parsons added 15 points, and Devin Harris had 12 points off the Dallas bench. Tyson Chandler finished with 10 points and 16 rebounds.\nBoth teams had 42 rebounds, and they were even in turnovers at 13.\n\"We stayed even with them on the boards. We had a low turnover game,\" Dallas coach Rick Carlisle said. \"If you do those two things, you at least have a chance against these guys.\"\nMike Conley, back after missing two games with a right ankle sprain, led Memphis with 22 points. Marc Gasol scored 20, and Zach Randolph had 18 points and 15 rebounds.\nThe game was physical, with battling under the boards, bodies flying and players and coaches pleading to officials about calls. That fits Memphis' style, but the Mavericks held their own.\n\"I know it's going to be physical any time I come (to Memphis) to play,\" Chandler said. \"I mean, I have some scratches and bruises. It's a wrestling match down there any time you face (Gasol and Randolph).\"\nThe Mavericks were 25 of 33 from the foul line and made 10 of 25 3-pointers. Memphis was 20 of 22 on free throws, but only 3 of 22 outside the arc.\n\"The competitive difference in the game was free throws and 3s,\" Memphis coach Dave Joerger said. \"It's not hard to do the math.\"\nThe Mavericks led by as many as 11, and were still up by seven entering the fourth quarter. Memphis tied it at 84, and Conley's 3-pointer with 4:03 left gave the Grizzlies a 91-89 lead.\nRajon Rondo had only three field goals in the game, but two came after Memphis took the lead and before Nowitzki went on his spurt. Ellis had the other field goal during that stretch.\n\"His shot-making at the end of the third quarter gave us a little bit of daylight and put (the Grizzlies) on their heels,\" Carlisle said of Ellis. \"Down the stretch, he was making plays both offensively and defensively.\"\n---\nTIP-INS\nMavericks: Dallas is 13-5 when Chandler has a double-double. ... Nowitzki has reached double figures in all 39 games he's played this season.\nGrizzlies: The FedExForum was evacuated for a short time about 90 minutes before the opening tip. A mechanical detector went off, activating the alarm. After an investigation, it was determined to be a false alarm. ... Pregame activities included the annual Martin Luther King Jr. Day Sports Legacy Symposium honoring Earl Monroe, Jason Collins and Chauncey Billups. ... The Grizzlies are 5-8 on MLK Day.\nEYE POKE\nParsons took a finger to the eye in the first half and had trouble shaking off the irritation, wiping his eye with a towel on several occasions. Afterward, he said there was a slight scratch, but nothing that would prevent him from playing.\nSIGHT TO CAUSE SORE EYES\nCarlisle said he spent the evacuation time before the game sitting on a bus \"with Tony Allen in his bathrobe.\" Allen, the Grizzlies' guard-forward, has been wearing a blue bathrobe in the locker room lately. Asked if the visual of Allen would be memorable, Carlisle replied: \"Hopefully not.\"\nUP NEXT\nMavericks: At Minnesota on Wednesday.\nGrizzlies: Host Raptors on Wednesday.",
  "tags_rule": [
    "DoubleDouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.558432",
  "pipeline_version": "v1"
}