{
  "game_id": "0021400785",
  "espn_id": "400579077",
  "date": "Feb 10, 2015",
  "matchup": "CHI vs. SAC",
  "headline": "Snell scores career-high 24 as Bulls rout Kings, 104-86",
  "cleaned_body": "CHICAGO -- A lack of consistent playing time can send a young player into a funk, but Tony Snell claims not to care how much he's on the floor.\n\"All that matters is that I've got to stay ready,\" Snell said. \"If I go in, just try to do the best I can. If not, cheer my team on.\"\nThe second-year guard was ready Tuesday night, pumping in a career-high 24 points on 9 for 11 shooting to help the Chicago Bulls to a 104-86 rout of the Sacramento Kings.\n\n\"I've been through it last year. It's nothing new,\" Snell said about playing time. \"You never know when your name gets called. I've got to make sure I'm ready when my name gets called.\"\nPau Gasol continued his strong play with 26 points and 16 rebounds -- his NBA-best 34th double-double of the season and 13th straight -- and Derrick Rose added 23 points in a turnover-free performance.\nBut it was Snell's play that stood out. Besides his scoring, Snell started the second half in place of Jimmy Butler (strained right shoulder) and played strong defense on Sacramento's Rudy Gay.\n\"I think he's taking good shots, good rhythm shots,\" Bulls coach Tom Thibodeau said of Snell. \"That's the big challenge: shoot when you should and pass when you should. I like that a lot. He had a great rhythm there and he had a tough matchup, too, when Jimmy went down. Rudy Gay is not an easy guy to guard. That puts enormous pressure on you and I thought he played well on both sides of the ball.\"\nThe Kings (18-33) have dropped 12 of 14. Gay led Sacramento with 24 points, but was held to nine points on 3 for 8 shooting in the second half.\nSnell was 4 for 6 on 3-pointers. His previous high was 20 points.\nThe trio of Snell, Gasol and Rose combined to go 30 for 43 (69.8 percent) from the field as Chicago (33-20) won its third straight.\nThe Bulls, who had a 57-49 halftime advantage, broke the game open in the third, beginning the second half with a 23-8 run for an 80-57 advantage with just under three minutes left in the quarter.\nGasol had 13 points during the run.\n\"We tried to stop it with timeouts, but it didn't help,\" Kings interim coach Tyrone Corbin said. \"They just made shots and runs.\"\nThe Bulls took an 84-64 edge into the final quarter. Sacramento rallied to trim the deficit to 13 at 92-79 with 5 1/2 minutes to play, but that was as close as it got.\nTIP-INS\nKings: Guard Darren Collison missed his third straight game with a right hip flexor ... Forward Rudy Gay returned to the starting lineup after missing one game with a sore left foot.\nBulls: Guard Jimmy Butler didn't play in the second half after suffering a right shoulder strain in the first half. ... Guard Kirk Hinrich (left turf toe) missed his second straight game ... Guard/forward Mike Dunleavy returned to the starting lineup after missing 19 games with a right ankle injury.\nCHANGE COMING?\nBesides trying to turn things around on the court, the Kings had to address reports on Tuesday that George Karl is near a deal to replace interim coach Corbin.\n\"I've been through a lot on my career,\" Corbin said. \"It's a difficult time, but it's part of the job.\"\nKings center DeMarcus Cousins also tried to clarify his stance on the team's coaching situation two days after a postgame rant was interpreted as him not being in support of Karl being hired. \"I don't fire coaches or hire them,\" he told ESPN. \"Everyone knows I liked and respected Coach (Michael) Malone. I didn't want (Malone's firing in December) to happen.\n\"I'm not involved in any coaching decisions right now. I've heard that George Karl is a great coach. If that is the direction that the organization chooses, I'll support it.\"\nUP NEXT\nKings: Visit the Milwaukee Bucks on Wednesday.\nBulls: Host the Cleveland Cavaliers on Thursday.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.854864",
  "pipeline_version": "v1"
}