{
  "game_id": "0021700110",
  "espn_id": "400974861",
  "date": "Nov 01, 2017",
  "matchup": "MIA vs. CHI",
  "headline": "Happy birthday: Heat top Bulls 97-91 to end 3-game slide",
  "cleaned_body": "MIAMI --  Erik Spoelstra seems to get the same birthday present from his team every year.\n\nHe is not complaining.\n\nGoran Dragic scored 20 points, Tyler Johnson added 19 and the Miami Heat beat the Chicago Bulls 97-91 on Wednesday to snap a three-game slide. It also marked the fourth consecutive year that the Heat played and won on their coach's birthday -- Spoelstra is now 47, celebrating that on the same day he and his wife publicly announced they are expecting their first child.\n\n\"It was good to finally get a result ... get a little bit closer to our identity,\" Spoelstra said. \"I liked all the emotions we had to go through. These guys want to win so badly.\"\n\nThere clearly were emotions: Miami was up 15 early, trailed by six midway through the third, then used a 32-12 run down the stretch to finally put the game away. Hassan Whiteside returned from a five-game absence with a bruised knee and scored 13 points and grabbed 14 rebounds for the Heat, who went 3-3 on their six-game homestand.\n\n\"It was a roller-coaster game,\" Dragic said. \"We're happy how we bounced back.\"\n\nLauri Markkanen scored 25 points and Robin Lopez added 22 for the Bulls, who were 7 for 28 from 3-point range and got five of those makes in the final 2 minutes. Chicago fell to 1-5, matching its worst start since 2007-08.\n\nMarkkanen also grabbed eight rebounds.\n\n\"We had a couple good days of practice, competed a lot,\" Markkanen said. \"It definitely showed today, but just wasn't good enough to win.\"\n\nDion Waiters also scored 13 for the Heat, who were without starting forward James Johnson -- a late scratch with right knee tendinitis.\n\nMiami was rolling early, up 20-6 after 8 minutes and 35-20 midway through the second quarter. The Bulls started 1 for 10 from the floor, and Whiteside had eight rebounds in the game's first 4:50.\n\nA 24-10 run by Chicago tied the game late in the half, seven of those field goals by the Bulls coming in close proximity to the rim. Chicago led by as many as six in the third and probably should have been up more, but missed five shots at the rim late in the quarter.\n\n\"Certainly something we can build on,\" said Bulls coach Fred Hoiberg, who raved about his team's effort after the slow start.\n\nThe Heat reclaimed the lead with a 10-1 run to end the third, then kept it the rest of the way. And now Miami's six-game homestand is followed by a six-game trip that starts Friday.\n\n\"We're happy with the win, especially before this long road trip,\" Dragic said. \"It's getting there.\"\n\nTIP INS\n\nBulls: Chicago tinkered with its lineup, starting David Nwaba instead of Paul Zipser. Hoiberg is exploring combinations ahead of the looming return of Bobby Portis (suspension). ... The Bulls' 14-point deficit was their largest in a first quarter this season. ... Justin Holiday started 1 for 13.\n\nHeat: Whiteside made his 200th Heat appearance. ... The Heat play at home three times the rest of November, and have 17 of their next 24 on the road. ... Justise Winslow made his first shot, giving him seven straight makes over three games.\n\nNEW ERA\n\nWednesday marked the first time since March 26, 2003, that the Heat and Bulls played and Dwyane Wade wasn't on either roster. Miami and Chicago played 71 times between 2003-04 and last season; Wade played for Miami in 64 games, sat out four and played for Chicago in three last season.\n\nSPO STATS\n\nAmong the 30 current NBA coaches, only San Antonio's Gregg Popovich has held his job longer than Spoelstra. But there are only nine coaches younger than the Spoelstra: Luke Walton, Tyronn Lue, Brad Stevens, Dave Joerger, former Heat assistant David Fizdale, Frank Vogel, Jason Kidd, Michael Malone and Hoiberg.\n\nUP NEXT\n\nBulls: Visit Orlando on Friday.\n\nHeat: Visit Denver on Friday.",
  "tags_rule": [
    "ReturnFromInjury"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "ReturnBoost",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:50.737806",
  "pipeline_version": "v1"
}