{
  "game_id": "0022100592",
  "espn_id": "401360411",
  "date": "Jan 08, 2022",
  "matchup": "CHA vs. MIL",
  "headline": "Rozier, Hornets hand Bucks 3rd loss in last 4 games, 114-106",
  "cleaned_body": "CHARLOTTE, N.C. -- — Terry Rozier scored 28 points, Miles Bridges added 21 points and eight rebounds, and the Charlotte Hornets beat the Milwaukee Bucks 114-106 on Saturday night, handing the defending NBA champions their third loss in four games.\n\nLaMelo Ball chipped in with 19 points, nine rebounds and eight assists for the Hornets, who held Milwaukee to 38.9% shooting on the Bucks' second road game in two nights.\n\nGiannis Antetokounmpo had 43 points and 12 rebounds, while Khris Middleton added 27 points, 10 rebounds and nine assists for Milwaukee, which won in Brooklyn on Friday but fell to 13-9 on the road. Antetokounmpo finished 18 of 20 from the free throw line.\n\n“That is a big win right there for us,” said Hornets coach James Borrego.\n\nAdded Bridges: “This gives us confidence. They are world champs for a reason.”\n\nThe teams meet again Monday in Charlotte.\n\n“They play hard and they are scrappy,” Antetokounmpo said. “They defend man-to-man and then they'll go zone. ... We have to trust one another and just focus on ourselves.”\n\nRozier continued his torrid pace from 3-point range by going 6 of 10, including a huge 3 with 34 seconds left to put the Hornets up by seven.\n\nRozier has made 36 3-pointers over the last eight games, while shooting 49.3% from beyond the arc.\n\n“Terry is a hired gun,” Borrego said. “He’s an elite catch-and-shoot guy.”\n\nCharlotte led 47-41 at halftime after holding Antetokounmpo to eight points and the Bucks to 30.6% shooting in the first half.\n\nMilwaukee trailed by 14 with 4:50 left in the game, but Antetokounmpo and Middleton brought them back, cutting the lead to four with 47.5 seconds left with a series of big baskets. It included an offensive rebound from Antetokounmpo, whose inadvertent flying elbow left Mason Plumlee with a cut above his eye.\n\nBut Rozier buried a crucial 3-pointer from the left wing to push the lead back to seven and keep the Bucks at a safe distance and Bridges put the game away with a fast-break layup for a three-point play with 10.7 seconds left.\n\n“I just know that the whole gym was staring at 'Melo, so I just tried to create some confusion for the defense. I just slipped out and I was wide open,” Rozier said of his 3-pointer.\n\nMilwaukee's Bobby Portis said he's been watching the Hornets a lot this season and has been impressed, calling them a fun up-tempo team with some marquee players in Ball and Bridges.\n\nHe also knows the Bucks are getting everyone's best effort this season.\n\n“We won last year, so every game for us is going to be a big game,” said Portis, who had 19 points and 13 rebounds. “Every game, teams are coming for us. So we got to compete at a high level each and every game.”\n\nMORE OFFENSE NEEDED\n\nAntetokounmpo, Middleton and Portis combined for 89 points and shot 29 of 54 from the field. But that trio didn't get much help from the rest of the team.\n\nThe other eight Milwaukee players who played were a combined 6 of 36 from the field and accounted for just 17 points.\n\nOUBRE FINDING WAYS\n\nKelly Oubre had 18 points for the Hornets following a game where he had 32 points on a career-high nine 3-pointers — including an NBA record-tying eight in the fourth quarter — in a blowout win over the Detroit Pistons. He was just 2 of 11 from beyond the arc against the Bucks, but found other ways to be effective by slashing to the rim, sliding behind defenders on back cuts and running the court to finish on fast breaks.\n\nTIP-INS\n\nBucks: Jrue Holiday, Grayson Allen, Pat Connaughton and George Hill did not play due to health and safety protocols, while Brook Lopez remained out while recovering from back surgery. ... Middleton had six turnovers.\n\nHornets: Shot 16 of 48 from 3-point range after making a franchise-record 24 3s on 42 attempts against the Pistons.\n\n------",
  "tags_rule": [
    "ThreePointExplosion",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.762088",
  "pipeline_version": "v1"
}