{
  "game_id": "0021400453",
  "espn_id": "400578745",
  "date": "Dec 28, 2014",
  "matchup": "DET @ CLE",
  "headline": "Pistons knock down 17 3-pointers, blow out Cavs in Cleveland",
  "cleaned_body": "CLEVELAND -- The Detroit Pistons have stepped up their play since releasing veteran forward Josh Smith last week. The Cleveland Cavaliers are searching for consistency.\nBrandon Jennings scored 25 points, and the Pistons used an 18-0 run in the second quarter to roll past the Cavaliers 103-80 on Sunday.\nIt was Cleveland's second blowout loss at home in less than two weeks. The Cavaliers lost 127-98 to Atlanta on Dec. 17, and the convincing victory for Detroit drew boos from the home crowd.\n\n\"We're not a very good team, as far as on the court, where we're still trying to find our way,\" said LeBron James, who had 17 points, 10 rebounds and seven assists for Cleveland. \"Right now we're just not very good in every aspect of the game that we need to be to compete every night.\"\nAndre Drummond had 16 points and 17 rebounds for the Pistons (7-23), who were coming off a 119-109 victory over Indiana on Friday. Reserve Jodie Meeks scored 14 points, and Kentavious Caldwell-Pope had 13.\nDetroit also set a franchise record for made 3-pointers by going 17 for 31 from long range.\nKevin Love had 20 points and 10 rebounds for Cleveland, which led 32-17 early in the second quarter. Tristan Thompson also had a double-double for the Cavs, finishing with 18 points and 11 rebounds.\n\"It seems like when we take these losses, we have a great first quarter and we get a little lax and teams start putting it on us,\" James said.\nCavaliers point guard Kyrie Irving missed his second straight game because of a bruised left knee.\nCleveland was ahead 43-32 midway through the second before the Pistons took over. Detroit hit four 3-pointers, including two by Jennings, and Drummond had a dunk and a basket in the lane in a span of 4:40.\nThe Pistons led 50-43 before Love hit a 3-pointer and James added a free throw in the last minute of the first half, but Detroit increased the lead to double figures early in the third quarter and steadily pulled away, leading by 27 points in the fourth.\n\n\"That third quarter was absolutely phenomenal,\" Detroit coach Stan Van Gundy said.\nThe Pistons have won both of their games since Smith was let go.\n\"I think Friday night was our best game of the year, and tonight was better,\" Van Gundy said. \"So, we've played our two best games of the year back to back. But we'll see. It's just two games. We've got a long way to go, but today was a step forward.\"\n\"Everyone just has a free mind, no pressure,\" Jennings said. \"We're just going out there and playing basketball.\"\nJames said he got hit in the left quad late in the first half, but he started the third quarter. The four-time MVP went to the bench for good with 5:34 remaining and Cleveland trailing 95-71.\nThe Cavaliers have lost two of three since starting center Anderson Varejao tore his left Achilles tendon last week. He had season-ending surgery Friday.\nThe Cavs got another scare when forward Shawn Marion left the game after rolling an ankle in the second quarter. He needed help getting to the locker room, but returned in the second half.\nIt was Detroit's first road win against an Eastern Conference team this season.\n\"Everyone just has a free mind, no pressure,\" Jennings said. \"We're just going out there and playing basketball.\"\nOOPS\nPistons forward Anthony Tolliver, who was acquired Wednesday in a trade with Phoenix, was accidentally made inactive.\n\"That was a screw-up on our part, we called that stuff into the league late,\" Van Gundy said. \"So the league went with the inactives from the last game, which Anthony was.\"\nQUICK START, SLOW FINISH\nCavaliers coach David Blatt wasn't pleased his team couldn't build off its strong first quarter.\n\"We started extremely well, but we lost our energy and we lost our competitiveness and that shouldn't happen,\" he said.\nTIP-INS\nPistons: Van Gundy stuck with the starting lineup he used in the first game without Smith, which included a front line of Drummond, Greg Monroe and Kyle Singler with a backcourt of Jennings and Caldwell-Pope.\nCavaliers: Blatt hopes Irving will return for Tuesday's game in Atlanta. G Matthew Dellavedova started again in place of Irving.\nUP NEXT\nPistons: At Orlando on Tuesday.\nCavaliers: At Atlanta on Tuesday.",
  "tags_rule": [
    "DoubleDouble",
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.325076",
  "pipeline_version": "v1"
}