{
  "game_id": "0021400989",
  "espn_id": "400579281",
  "date": "Mar 15, 2015",
  "matchup": "LAL vs. ATL",
  "headline": "Hawks hold off Lakers 91-86",
  "cleaned_body": "LOS ANGELES -- On a night when Atlanta rested three starters and lost Kyle Korver to a broken nose, Dennis Schroder provided a big lift for the Hawks.\nSchroder had 24 points and 10 assists, and Atlanta beat the Los Angeles Lakers 91-86 on Sunday. The 17th overall pick in the 2013 draft made his seventh start in 113 NBA games, and was 7 for 16 from the field in his best game as a pro.\n\"At the beginning of the game,\" Schroder said, \"Coach came up to me and said: `It's your game. Just play your game like you do all the time and don't change anything. Involve your teammates, and if you're open, shoot the ball.' That's what I did. I'm getting my minutes now and I feel very confident on the court.\"\nJeff Teague, DeMarre Carroll and Paul Millsap got the night off in the first part of back-to-back road games at the tail end of a four-game trip. Joining Schroder was Pero Antic at small forward and former Laker Kent Bazemore at power forward.\n\"You know we're a very dangerous team when we can sit three starters, then have another one go down, and still get the job done,\" Bazemore said. \"All those guys that that came in who usually don't get the minutes, they continue to show up and work hard. And it definitely showed tonight.\"\nAl Horford scored 21 points to help the Hawks (52-14) move within a half-game of idle Golden State for the NBA's best record with 16 games left on the schedule -- including a showdown with the Warriors on Wednesday night at Oakland. The Hawks also tied a franchise record with their 22nd road win.\nKorver, one of the Hawks' regular starters, left with a broken nose after taking an offensive foul from Ed Davis with 8:59 left in the first half.\nThe injury ended a streak of 51 consecutive games with a 3-pointer by Korver, who missed both of his shots from behind the arc. The 12-year veteran also owns an NBA-record streak of 127 games with a 3-point field goal. It began with his second game in a Hawks uniform, and ended on March 5, 2014, at Portland.\nReserves Carlos Boozer and Ryan Kelly each scored 13 points for the reeling Lakers, who lost for the 23rd time in 28 games and committed 22 turnovers that were converted into 28 points.\n\"We found out just before the game that they were resting guys in their starting lineup,\" coach Byron Scott said. \"I don't know how our guys took that. But when you turn the ball over as much as we did, to me, it's a lack of focus. We've been pretty good all season in terms of taking care of the ball.\"\nThe Lakers entered the fourth quarter trailing 68-58 with no players in double-figure scoring. Elton Brand, who used to call Staples Center home during his seven seasons with the Clippers, triggered an 8-2 spurt with a layup that helped the Hawks extend their lead to 80-65 with 7:05 to play.\nLos Angeles came roaring back with a 16-2 run fueled by Boozer's eight points and capped by Wesley Johnson's 3-pointer, which sliced the deficit to 85-83 with 30 seconds left. But Schroder cut through the lane for a layup with 13.9 seconds left.\n\"Coach drew up the play, and I just tried to challenge myself,\" Schroder said. \"I was wide open going to the cup. That showed me that Coach trusts me a lot. And I think that's because of my improvement.\"\nJohnson then missed a 3-pointer from the left corner, and the Hawks sealed the win with two free throws each by Bazemore and Schroder.\n\"Our guys on the bench have worked hard all year and waited for opportunities,\" Horford said. \"Tonight they came out and showed what they can do.\"\nTIP-INS\nHawks: Atlanta signed F Austin Daye to a 10-day contract as a stop-gap replacement for backup forward Mike Scott, who is expected to miss four to six weeks because of a broken toe on his left foot. ... Antic picked up his first two fouls three seconds apart and went to the bench with 8:28 left in the first quarter. He finished with three points in 23 minutes. ... The Hawks have won 12 of their last 18 games, following a 33-2 surge.\nLakers: Reserve swingman Nick Young is scheduled to have a CT scan Monday on his swollen left knee, which has forced him to miss the last 10 games. ... The loss ended an eight-game home winning streak against the Hawks, who hadn't beaten the Lakers at Staples Center since Feb. 15, 2006.\nUP NEXT\nHawks: At Sacramento on Monday night.\nLakers: At Golden State on Monday night.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.474862",
  "pipeline_version": "v1"
}