{
  "game_id": "0021401047",
  "espn_id": "400579339",
  "date": "Mar 22, 2015",
  "matchup": "LAL vs. PHI",
  "headline": "Lin's season-high 29 points help Lakers beat 76ers",
  "cleaned_body": "LOS ANGELES --  Jeremy Lin was in the starting lineup for his first 20 games with the Los Angeles Lakers. Things weren't working out to coach Byron Scott's satisfaction, so he changed things up in December.\n\nNow with 14 games left in the season -- after having nothing at stake for months in terms of a playoff berth -- Scott was entertaining thoughts of letting Lin start again after his season-high, 29-point performance on Sunday night in a 101-87 victory over the Philadelphia 76ers.\n\n\"Obviously, I would love to be in the starting lineup, but nothing's guaranteed at this point,\" Lin said. \"I mean, 70 games into the season, I'm just trying to stay focused on doing what I'm supposed to do when I get in there.\"\n\nLin made 10 of 16 shots, dished out five assists and helped the Lakers pick up the pace down the stretch with his aggressiveness and leadership at both ends of the court.\n\n\"I thought he was great,\" Scott said. \"He made great decisions. On the offensive end, he got guys involved. Defensively, he was where he was supposed to be and he did a lot of good things at that end of the floor as well.\"\n\nThomas Robinson had 14 points off the bench for the 76ers, who shot just 36 percent and were outrebounded 52-39 in the first meeting of the season between two of the NBA's worst teams.\n\n\"We tried to double-team Lin with about seven minutes left, and he still found ways to score,\" 76ers coach Brett Brown said. \"We tried multiple people on him and tried to get length on him with Jerami Grant. We tried to blitz him and searched to try to find ways to defend him, but we struggled all night.\"\n\nThe 76ers, coming off home victories over the Pistons and Knicks, haven't won three in a row since a four-game stretch that began with a road win over the Lakers on Dec. 29, 2013.\n\nPhiladelphia took a 75-74 lead into the fourth quarter but missed 12 of its next 13 shots while the Lakers opened the period with a 20-4 run that built them a 94-79 cushion with 4:19 to play. Lin fueled the rally with 12 points, and reserve forward Ed Davis' efforts off the defensive glass were just as critical.\n\n\"I thought Ed did an unbelievable job of protecting the rim. In a lot of ways, he was the most valuable player in this game and played the best,\" Lin said. \"He got a bunch of rebounds, and that's what started our break.\"\n\nThe Sixers went 7 minutes without a field goal until Hollis Thompson -- the sixth and last player off the Philadelphia bench -- hit a 3-pointer with 3:20 remaining.\n\n\"I give the Lakers credit. I thought their length and their defense hurt us,\" Brown said. \"Our point guards struggled tonight. I think they ended up 4 for 26 from that position. As a team, we got selfish in the second half and we didn't move the ball like we did in the first half. We were too ball-dominant with our point guards.\"\n\n---\n\nTIP-INS\n\n76ers: Brown took a 20-second timeout just 1:12 into the game with a 4-0 deficit and requested another with 1:02 left in the game and his team down by 15. ... The 76ers' 53 losses are just three more than the Lakers have, despite the fact that Philadelphia started the season 0-17. ... Philadelphia is 2-35 when allowing 100 or more points.\n\nLakers: Scott, whose mother Dorothy died on March 15 at age 72, will miss the first two games of the road trip to attend her funeral on Wednesday in Southern California. His plans are to rejoin the team in Toronto on Thursday, the day before they play the Raptors. Assistant coach Paul Pressey will call the shots in Scott's absence.\n\nSCOTT ON STEVE\n\nSteve Nash played in only 15 regular-season games for Scott before announcing his retirement Saturday after 17-plus seasons in the NBA. \"He's just an unbelievable person, along with being an unbelievable basketball player,\" Scott said. \"I think he kind of changed the game. It's more of a point guard league now. Steve was just one of those unique point guards that was able to dribble a lot, shoot it from anywhere and score. But he had more fun passing the ball. He's one of the smartest point guards I've ever seen, too.\"\n\nUP NEXT:\n\n76ers: At Sacramento on Tuesday.\n\nLakers: At Oklahoma City on Tuesday.",
  "tags_rule": [
    "MomentumShift",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.182922",
  "pipeline_version": "v1"
}