{
  "game_id": "0022101106",
  "espn_id": "401360925",
  "date": "Mar 25, 2022",
  "matchup": "LAC vs. PHI",
  "headline": "Harden, Embiid have double-doubles, 76ers rout Clippers",
  "cleaned_body": "LOS ANGELES -- — Even after seeing James Harden and Joel Embiid record double-doubles in a convincing 25-point win over the Los Angeles Clippers on Friday night, Philadelphia 76ers coach Doc Rivers doesn't think his team is at its best yet.\n\nThat should be bad news for the rest of the Eastern Conference.\n\nHarden had 29 points and a season-high 15 rebounds while Embiid added 27 points and 10 boards as the Sixers' rolled to a 122-97 victory.\n\n“We’re getting better. The one-two has to be there first. It is. The rest will follow,” Rivers said after Philadelphia (46-27) won its third straight to pull within a half game of the Miami Heat for first place in the Eastern Conference.\n\nIt is the first time since Harden was acquired from the Brooklyn Nets in a blockbuster trade on Feb. 10 that the two All-Stars have had a double-double in the same game for the Sixers.\n\nEven though the Sixers are streaking going into a key clash Sunday against the Phoenix Suns, who have clinched the league's best record, Harden agreed that things remain a work in progress with less than a month remaining until the playoffs.\n\n“Things are headed in the right direction, but every single day we are focusing on execution and details,” said Harden, who is averaging 23 points and 7.6 rebounds since coming to Philadelphia. “There are going to be different ways we are going to have to win in the playoffs, and we have to be prepared for that.”\n\nHarden had a monster first and second quarter, posting 25 points and 11 rebounds. It is the first time in his 12-year career he has done that in a half.\n\nHarden and the Los Angeles Lakers' LeBron James are the only players in the league to have a double-double in a half in which they scored at least 25 points.\n\n“When shots are going in, it makes it better. Tonight was one of those nights where I felt good, we got out to a big lead and the wave continued the entire game,” Harden said.\n\nIt is Embiid's 38th double-double, which is tied for seventh in the league. He also had two blocks and a steal on what was a great defensive night for the Sixers, who blocked eight shots and forced 12 steals.\n\n“We were in synch and focused. We played physical. We were all over them,” Embiid said.\n\nAmir Coffey scored 21 points and Isaiah Hartenstein had 16 points and eight rebounds for the Clippers, who have dropped five straight, with the last three coming by at least 12 points.\n\nThe Clippers scored the first five points of the game before the Sixers took control with a 21-2 run in which Harden scored eight points and Matisse Thybulle added six. A pair of free throws by Harden extended the lead to 32-11 with 1:32 remaining in the first quarter.\n\nThe Clippers countered with a 17-6 run to get within 10, but Philadelphia responded with eight straight points to put it out of reach midway through the first half.\n\nThe Sixers had a 64-43 lead at halftime. Their largest advantage was 28 points during the fourth quarter.\n\n“We were overmatched. They played well and we didn’t play our best game,” Clippers coach Tyronn Lue said. “We had some chances to cut the lead a couple times. We got some rebounds but then turned it over, and then the game got away from us.”\n\nWELCOME BACK\n\nSixers coach Doc Rivers — who led the Clippers for seven seasons — received a scoreboard tribute during the first timeout. It was the first time since Rivers was fired at the end of the 2019-20 season that he was able to receive applause from fans at a Clippers' game.\n\n“I waved at the end. I don’t know how you can have a video with a coach. Are you showing me getting a tech or getting thrown out of the game?” said Rivers, who is 2-2 against his former team.\n\nTIP INS\n\n76ers: Philadelphia is 19-10 against the Western Conference. ... Thybulle had 13 points, Tobias Harris added 12 and Tyrese Maxey 11. ... Embiid leads the league with 74 quarters this season where he has scored in double digits. ... Harden became the 116th player in league history to reach 4,500 career defensive rebounds.\n\nClippers: Terance Mann had 12 points while Reggie Jackson added 11. ... Rookie Brandon Boston Jr. missed the game due to a non-COVID illness.\n\nUP NEXT\n\n76ers: Conclude a three-game trip against the Phoenix Suns on Sunday.\n\nClippers: Host the Utah Jazz on Tuesday.\n\n------",
  "tags_rule": [
    "DoubleDouble",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.395426",
  "pipeline_version": "v1"
}