{
  "game_id": "0021400795",
  "espn_id": "400579087",
  "date": "Feb 11, 2015",
  "matchup": "MEM @ OKC",
  "headline": "OKC shuts down Griz behind Kevin Durant, Russell Westbrook",
  "cleaned_body": "OKLAHOMA CITY -- The Thunder put an exclamation point on their hot streak heading into the All-Star break.\nKevin Durant scored 26 points and Russell Westbrook added 24 to help Oklahoma City defeat the Memphis Grizzlies 105-89 on Wednesday night.\nNick Collison had season highs of 15 points and nine rebounds, and Dion Waiters added 11 points for Oklahoma City, which has won five of six. The Thunder have fought through a rough start that followed early injuries to Durant and Westbrook, and now are within a half-game of the No. 8 position in the Western Conference standings.\n\"We try not to think about that,\" Durant said. \"We're just trying to play good basketball, and that will take care of itself. We're excited that we're going into the break with a W. You'd rather go into the break beating a good team like Memphis.\"\n\nZach Randolph scored 16 points and Jeff Green and Beno Udrih each added 11 for Memphis, which had won 10 of 11. All-Star Marc Gasol finished with just eight points on 2-for-10 shooting. Oklahoma City successfully limited Memphis' inside game and held the Grizzlies to 37 percent shooting.\n\"They just put five guys in the paint, and we didn't make a shot,\" Memphis coach Dave Joerger said. \"We couldn't get in the paint, couldn't make a shot, couldn't make a play. It's one of those things.\"\nMemphis had won the first two meetings this season, but the Grizzlies looked sluggish this time after beating Brooklyn the night before.\nThe rivals have met in the playoffs three of the past four years, and this matchup had the typical intensity before Oklahoma City took charge late in the second quarter.\nA 15-0 run, highlighted by back-to-back 3-pointers by Durant, gave Oklahoma City a 60-42 lead and brought the crowd to its feet.\n\"We needed that to win the game,\" Durant said. \"We knew that was important. They have a championship-caliber team, and we knew they weren't going to give up, so we had to strike while the iron was hot.\"\nDurant scored 19 points and Westbrook added 18 in the first half to help the Thunder take a 66-48 lead.\nOklahoma City shot 57 percent from the field and made 18 of 19 free throws before the break. Randolph scored 14 points in the first half and made five of eight shots, but his teammates made 13 of 42.\nOklahoma City took an 85-69 lead into the fourth quarter. The Grizzlies cut the deficit to 13, but the Thunder responded with two consecutive hoops to make it a 99-82 lead with just less than four minutes remaining. The remaining drama surrounded Westbrook's quest for another triple-double, but he came out of the game with 3:27 to play with nine rebounds and nine assists.\n\"We're playing good basketball,\" Oklahoma City coach Scott Brooks said. \"I like the rhythm of the team right now. I think we're playing well.\"\nTIP-INS\nGrizzlies: Green, a starter for Memphis, played for Oklahoma City before being traded to Boston in 2011. ... G Mike Conley tweaked an ankle and played just 17 minutes. He didn't play in the fourth quarter, but a team spokesman said he was available to return.\nThunder: F Serge Ibaka left the game in the first quarter after taking a hit from Randolph. He had a nose laceration and returned to the game in the second quarter. ... Rookie F Mitch McGary, who had double-doubles in his previous two games, fouled out and didn't score. ... Waiters was issued a technical foul in the second quarter. ... Westbrook, 6-foot-3, won a jump ball against the 6-9 Randolph in the third quarter. ... Durant scored nine points in the first 2:41 of the game.\nQUOTE OF THE NIGHT\nCollison, on playing the Grizzlies: \"We've had so many big games against them over the years. There's a lot of familiarity. You just go and play. There's not much flopping or anything like that; you just go and play good, physical basketball.\"\nSTAT LINES\nWestbrook made 13 of 13 free throws in the first half. According to STATS Research, he's just the sixth player since the start of the 2002-03 season to make at least 13 free throws in a first half without a miss, and he's the only one to do it twice. He also went 13-for-13 in the first half against the Los Angeles Lakers on Dec. 19, 2014.\nUP NEXT\nGrizzlies: At Portland on Feb. 22.\nThunder: Host Dallas on Feb. 19.",
  "tags_rule": [
    "DoubleDouble",
    "TripleDouble",
    "FoulTrouble",
    "CoachComment",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.298491",
  "pipeline_version": "v1"
}