{
  "game_id": "0021700146",
  "espn_id": "400974897",
  "date": "Nov 06, 2017",
  "matchup": "ATL vs. BOS",
  "headline": "Irving, Celtics hold off Hawks in closing minutes",
  "cleaned_body": "ATLANTA -- Kyrie Irving took charge in a fashion only he can.\nDribbling and weaving through the lane and around the perimeter, Irving scored from all over and kept his teammates involved all night.\n\"It's a beautiful game when it's played the right way,\" the four-time All-Star said. \"It's not going to look good every possession, but you've got to be able to move onto the next play. I understand that better than most.\"\nIrving scored 35 points, Jayson Tatum added 21 and the Boston Celtics held off the Atlanta Hawks 110-107 Monday night for their ninth straight victory.\nIrving's 3 from the right wing put the Celtics up 104-103 -- the game's 25th lead change -- with 1:37 remaining, and Boston led the rest of the way.\nDennis Schroder had 23 points for the rebuilding Hawks, who dropped to 2-9 a night after a surprising two-point win at Cleveland.\n\"It would've been sweet to win two in a row against those kinds of teams,\" Schroder said. \"But we ended up short.\"\nBoston improved to 9-2, best in the NBA, and has its longest winning streak in seven years.\nAl Horford had 15 points, 10 rebounds and nine assists in his best game against the Hawks. Horford spent his first nine seasons in Atlanta before leaving as a free agent ahead of last season and had totals of 20 points and 17 rebounds in three games against his former team.\nIrving had his first 30-point game as a Celtic on a night packed with highlights. He dribbled between his legs and behind his back before hitting a floater off the glass from the left baseline to put Boston up 46-44. He had two impressive assists late in the third with long, one-handed passes that led to 3s by Marcus Smart and Tatum, the latter giving Boston a 72-71 lead.\nIrving either scored or assisted on every basket of a 16-2 run in the third that put the Celtics up by seven. He finished with seven assists.\n\"He's just very unique,\" Horford said. \"He has a good sense of how teams are playing him.\"\nThe Celtics started to pull away and took their biggest lead at 10 on Semi Ojeleye's 3 early in the fourth, but the Hawks came back to take a few brief leads in the final period.\n\"To compete the way we did and give ourselves a chance to win, we got better tonight and we can learn from it,\" Atlanta coach Mike Budenhozler said.\nTHAT'S A DRAG\nBoston coach Brad Stevens wasn't pleased with the ball movement or defense early in the third, storming the floor to call timeout after Atlanta's Luke Babbitt hit a 3 to put the Hawks up 57-54.\n\"You could just tell mentally and physically we were dragging a little bit,\" Irving said. \"That's going to happen sometimes considering how hard we play, but we don't want to make that a habit for us. No excuse.\"\nRAINING DOWN\nBudenholzer joked before the game that he regretted having his assistants work with the 6-foot-10 Horford a couple of years ago to develop a strong presence beyond the perimeter. Horford, who went just 1 for 5 on 3s, entered the game shooting nearly 52 percent on 33 attempts from the arc.\n\"I think there was just a real push from us and a credit to him that he could do it,\" Budenholzer said. \"It's part of the way the game is, and his passing just opens up the court even more for him to drive and attack. He's such a good player, such a smart player.\"\nTIP-INS\nCeltics: Irving has scored more points -- 245 -- than any player in his first 11 games with Boston. ... With Marcus Morris getting the night off to rest his sore left knee, Aron Baynes started at center and finished with just two points and three rebounds in 15 minutes.\nHawks: Malcolm Delaney returned after missing two games with a sprained right ankle and had 13 points. Marco Belinelli scored 19 despite a sore left Achilles.\nUP NEXT\nCeltics: Host the Lakers on Wednesday night.\nHawks: Off until they visit Detroit on Friday night.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.306084",
  "pipeline_version": "v1"
}