{
  "game_id": "0021700675",
  "espn_id": "400975421",
  "date": "Jan 20, 2018",
  "matchup": "ATL vs. CHI",
  "headline": "Lopez, Markkanen power Bulls to easy win over Hawks",
  "cleaned_body": "ATLANTA --  Lauri Markkanen wasn't feeling his 3-point shot against Atlanta's perimeter defense, so the Bulls' big man decided to attack inside.\n\n\"That was their game plan, but I can do much more than just shoot from the outside,\" he said. \"I missed I don't know how many 3s, but that wasn't going for me tonight. I had to figure out something else.\"\n\nRobin Lopez scored 20 points, Markkanen added 19 and Chicago easily beat the Hawks 113-97 on Saturday night.\n\nThe Bulls, coming off a 7-point home loss to defending NBA champion Golden State three days ago, have won four of five and 15 of 23. They never trailed, taking an 11-point lead midway through the first quarter on Lopez's dunk and going up 17 on Markkanen's dunk in the closing seconds of the first half.\n\nThe closest Atlanta got in the third was 10 points on John Collins' dunk. The lead swelled to 25 midway through the fourth on Portis' 3.\n\n\"I thought that we really played a complete game tonight,\" Chicago coach Fred Hoiberg said. \"I thought that we played with the right mentality.\"\n\nDennis Schroder scored 18 points and Dewayne Dedmon had 11 for Atlanta, which showed why it's spent the season at or near the bottom of the NBA standings.\n\nThe Hawks began the game ranked seventh in 3-point shooting, but they had little chance of competing after missing 34 of their first 38 shots beyond the arc. Atlanta, coming off a dramatic late victory over New Orleans, was attempting to win three straight for the first time this season.\n\n\"The shot isn't falling, but you have to find another way to win the game,\" Schroder said. \"We didn't do it tonight. We have to keep moving on to the next game.\"\n\nWith the Hawks poorly defending inside, Markkanen took his game to the rim. The 7-foot, 227-pound Finn, a prolific 3-point shooter, had five dunks. He went 0 for 4 beyond the arc, marking the first time in 17 games that he didn't hit a 3.\n\nMarkkanen hit 100 3s in his first 41 games, faster than any rookie in NBA history, but he wants to make the adjustment inside when teams focus on taking his perimeter game away.\n\n\"I know I can't just shoot 3s,\" Markkanen said. \"I've got to get to the rim. Eventually that's going to open a lot more space for 3-pointers and stuff like that. I just try to mix it up.\"\n\nTIP-INS\n\nBulls: Hoiberg said G Kris Dunn, in the NBA's concussion protocol, will not join the team Monday in New Orleans. Dunn is still suffering headaches, dizziness and soreness from losing two front teeth after his face hit the floor. ... Chicago is 7-16 on the road but has won four of its last six away from the United Center. ... The Bulls have hit at least 10 3s in 10 straight games.\n\nHawks: The team's best 3-point veteran shooters, F Ersan Ilyasova and G Marco Belinelli, were a combined 0 for 12 beyond the arc. Atlanta finished 11 for 48. ... The Hawks have dropped three straight in the Bulls series after winning seven in a row.\n\nBULLISH START\n\nChicago did as it pleased in the first half, dishing out 18 assists on 21 field goals to begin the third quarter with a 55-38 lead. They scored the game's first 14 points in the paint on five dunks, and Atlanta had no one capable inside to defend Lopez, who had 16 before intermission on 8 for 9 shooting.\n\nPortis finished with 14 points and Justin Holiday had 13 for the Bulls.\n\n\"We knew it was going to be an important game for us after a tough loss against Golden State,\" Nikola Mirotic said. \"I think that game gave us confidence that we can beat any team in the league.\"\n\nUP NEXT\n\nBulls: Visit New Orleans on Monday.\n\nHawks: Host Utah on Monday.\n\n---\n\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.794685",
  "pipeline_version": "v1"
}