{
  "game_id": "0021300841",
  "espn_id": "400489714",
  "date": "Feb 24, 2014",
  "matchup": "MIL @ PHI",
  "headline": "O.J. Mayo stars as balanced Bucks send 76ers to 11th straight loss",
  "cleaned_body": "PHILADELPHIA -- The Milwaukee Bucks haven't won too often this season, and a road victory has been even rarer.\nThey earned both in a laugher over the nearly-as-hapless Philadelphia 76ers.\nO.J. Mayo made seven 3-pointers and scored 25 points, Ersan Ilyasova added 20, and the Bucks placed seven players in double figures in a 130-110 rout of the 76ers, who lost their 11th straight game on Monday night.\n\"In our situation, it's great to get a win any way we can get it,\" Bucks coach Larry Drew said.\nRamon Sessions scored 16 points, Khris Middleton and Brandon Knight had 15 each, and Giannis Antetokounmpo posted 13 for the Bucks (11-45), who own the NBA's worst record. John Henson added 12 for the Bucks, who had their highest scoring game of the season.\nMilwaukee is 5-22 on the road.\n\"We're not a 130-point team,\" Drew said. \"Tonight was a good night. I'll take it.\"\nPhiladelphia (15-42), which owns the league's second-worst record, has lost 21 of 24 and 10 straight at home. It is the club's longest skid since a 12-game losing streak during the 1996-97 season.\nThaddeus Young led the 76ers with 28 points, Michael Carter-Williams added 20, Tony Wroten had 19, and James Anderson scored 13.\nThe Bucks had lost two in a row, 21 of 24, and 10 straight on the road. Their last away victory was against the Los Angeles Lakers on Dec. 31, 2013.\nMilwaukee still hasn't won back-to-back games this season. Only 12,216 were in attendance for this one.\n\"It feels great,\" Henson said. \"It's the first time in a real long time we got a win like this. Hopefully, we can keep it going.\"\nPhiladelphia trailed 73-44 at halftime, the most points the 76ers have allowed in any half this season. It got worse as the Bucks' lead swelled to 33 points in the third quarter.\nThe 76ers trailed by 35 in the fourth against a team that could have the most ping pong balls in the NBA draft lottery.\n\"The effort was extraordinarily poor,\" Sixers coach Brett Brown said.\nMayo made his first five 3-point attempts. His sixth turned into a four-point play with 3.9 seconds remaining in the third quarter, giving the Bucks a 106-76 advantage.\n\"Guys did a great job of finding me,\" said Mayo, who was 7-for-9 from 3-point territory. \"I had the easy part of knocking them down.\"\nThe Sixers had 11 available players, including guard Eric Maynor and centers Henry Sims and Byron Mullens.\nBut the biggest name from their four deals before the NBA trade deadline on Thursday was inactive. Forward Danny Granger, a former All-Star who was acquired from the Indiana Pacers for forward Evan Turner and forward-center Lavoy Allen, was in town but not at the arena.\nBrown said before the game that a decision on Granger's status could be made within the next day.\nFor now, Philadelphia has no answer how to turn things around.\n\"It's a learning process, and we have to try to get the guys on the learning curve,\" said Young, who added a career-best seven assists.\nIt wasn't nearly enough.\n\"You can't blink,\" Brown said. \"We've had a lot of nights like this.\"\nGame notes\nBucks F Caron Butler sat out with a sprained left ankle. . The Sixers managed only 13 rebounds in the first half. . The Bucks' 73 points in the first half were a season high in any half. . Bucks F Jeff Adrien had 10 rebounds.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:50.723631",
  "pipeline_version": "v1"
}