{
  "game_id": "0021701030",
  "espn_id": "400975776",
  "date": "Mar 16, 2018",
  "matchup": "BKN @ PHI",
  "headline": "Embiid leads 76ers past Nets",
  "cleaned_body": "PHILADELPHIA --  A sellout crowd of nearly 21,000 serenaded Joel Embiid for his birthday, and Embiid showed his gratitude by powering Philadelphia to another win.\n\nEmbiid had 24 points and a career-high 19 rebounds and Robert Covington hit a key 3-pointer to lead the 76ers to a 120-116 victory over the Brooklyn Nets.\n\n\"They've shown me a lot of support since I got here and I appreciate it,\" said Embiid, who turned 24 on Friday. \"That's a great memory.\"\n\nJ.J. Redick added 23 points and Ben Simmons had 21 points, 12 assists and eight rebounds for Philadelphia (38-30), which pulled a half-game behind idle Washington for the fifth seed in the Eastern Conference playoff race.\n\nEmbiid was just 6 for 23 from the field. With his shot off, he affected the game in other ways.\n\n\"When shots aren't falling, you have to do something else,\" Embiid said.\n\nThe 7-footer made his presence felt defensively, including a key block on Spencer Dinwiddie's drive with 21.8 seconds left.\n\n\"He is a complete difference-maker,\" Philadelphia coach Brett Brown said. \"Those are massive stats by any standards.\"\n\nRondae Hollis-Jefferson scored 21 points for the Nets (21-48), who lost their third straight and 19th in the last 22 games.\n\nCoach Kenny Atkinson felt his young team's play was improved, but Philadelphia was just too tough.\n\n\"They're a heck of a team,\" Atkinson said. \"Two great players and they surround them with shooters. They hit a lot of tough shots.\"\n\nBrooklyn tied it at 110 on Jarrett Allen's two free throws with 2:29 left. After a Redick miss, DeMarre Carroll drained a 3 to give the Nets the lead. After Redick made the second of two free throws, Covington tied it with a layup following a Simmons steal.\n\nCaris LeVert's layup put Brooklyn back in front, but Covington's 3 from the right wing gave Philadelphia a 116-115 advantage with 35.4 seconds remaining. Dinwiddie was turned away by Embiid on Brooklyn's ensuing possession.\n\nT.J. McConnell made a pair of free throws to make it 118-115 with 19.1 seconds to play. Dinwiddie came up short on a 3, but the Nets kept possession and Philadelphia fouled Dinwiddie. He made the first and missed the second intentionally, but the 76ers got the rebound and Embiid clinched it with two free throws with 5.2 seconds left.\n\nPulling out a late victory in a close game will help the 76ers' confidence heading into the playoffs, Brown said.\n\n\"It lets them know because we've been on the other side of that,\" Brown said. \"We do have the people, I believe we have the structure and they have shown they have the poise to be able to walk a game down.\"\n\nPhiladelphia trailed by as many as 13 points in the first half and was down 58-55 at the break. But the 76ers pulled ahead with a strong third quarter. Embiid capped the period with a 22-foot jumper as time expired, making it 86-81 Philadelphia entering the fourth.\n\nOKAFOR'S ACTION\n\nJahlil Okafor had six points in six first-half minutes and finished with 10 points in 13 minutes. The former 76ers first-round pick who was traded to Brooklyn on Dec. 7 hadn't played in nine of the last 10 games.\n\nFULTZ UPDATE\n\nBrown said before the game he still doesn't know if Markelle Fultz will return to the court this season. Fultz, the No. 1 pick in the June 2017 draft, has played in just four games this season while rehabilitating his shoulder.\n\n\"At some point soon a decision is going to have to be made,\" Brown said.\n\nTIP-INS\n\nNets: Allen Crabbe (illness) didn't play. ... Allen returned after missing Tuesday's 116-102 loss to Toronto with a sore left foot. He had six points and seven rebounds. ... Dante Cunningham suffered a left eye contusion with 10:28 left in the first half and didn't return. Atkinson didn't have an update afterward.\n\n76ers: Hall of Famer Allen Iverson received a rousing ovation when he was introduced to the crowd at halftime. ... Philadelphia committed just five turnovers.\n\nUP NEXT\n\nNets: Host Minnesota on Saturday night.\n\n76ers: Host Charlotte on Monday.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.515007",
  "pipeline_version": "v1"
}