{
  "game_id": "0021400401",
  "espn_id": "400578693",
  "date": "Dec 21, 2014",
  "matchup": "MEM @ CLE",
  "headline": "Dion Waiters steps up in fourth as hot-shooting Cavaliers down Grizzlies",
  "cleaned_body": "CLEVELAND -- LeBron James and Kyrie Irving stepped aside and let one of their teammates polish off an opponent.\nOn Sunday, Dion Waiters finished Memphis.\nWaiters scored 13 of his 21 points in the fourth quarter as the Cleveland Cavaliers handled one of the Western Conference's best teams, beating the short-handed Grizzlies 105-91.\nThe Cavs have been waiting for the enigmatic and inconsistent Waiters to become more reliable. It's still a work in progress but Waiters, who has frequently been mentioned in trade rumors over the past two seasons, is showing signs of developing into a steady scorer off the bench.\n\n\"He's learning every day,\" said James, who had 25 points and 11 assists. \"He's a young guy. He hasn't experienced much in this league, so for him to have a game like he had, we needed it.\"\nJames scored 16 in the second half and the Cavs shot a season-best 61 percent from the field to improve to just 3-6 against West teams. Anderson Varejao scored 18 and Irving had 17 points and 12 assists for the Cavs, who are 11-3 since their sluggish 5-7 start.\nMarc Gasol scored 23 and added 11 rebounds for the Grizzlies, who played without forward Zach Randolph. He's nursing a sore and swollen right knee he injured in Friday's loss at Chicago.\nJon Leuer added 16 points for Memphis, which dropped to 21-6.\nGasol refused to use Randolph's absence as an excuse.\n\"We play who we have,\" he said. \"Whoever's not here is not here. Trust me, we have enough talent in this locker room not just to win tonight but to win the same amount of games we've won so far.\"\nDespite not having Randolph, their leading rebounder, Grizzlies were still within 79-74 when the Cavs went on an 8-0 run to take control. Irving triggered the spurt with a basket before Waiters, who was benched in the second half of a win over Brooklyn on Friday, fed James for an alley-oop dunk. Waiters then drained a 3-pointer to cap an 11-3 run, and the backup guard scored eight consecutive points to push Cleveland's lead to 100-83.\nWaiters scored 11 points in a span of 2:10, assuming the closer role usually played by James and Irving.\n\"When it's not one of those guys nights, somebody's got to step up and my approach every game is to be locked in as far as being consistent and being aggressive at all times, that's just who I am,\" Waiters said. \"I just try to let the game come to me now. I just take what they give me.\"\nBlatt said his team would need to \"bring it\" to match the Grizzlies' physicality. Cleveland brought it, building a 20-6 lead in the first quarter, helped by Gasol going to the bench after picking up his second personal. The Grizzlies, though, battled back and were only down 11 at halftime.\nTIP-INS\nGrizzlies: An MRI taken Saturday on Randolph did not show any structural damage but the Grizzlies are going to be extra cautious with him as he's likely to sit out Monday against Utah. \"He's a warrior and I just thought taking a night off isn't the worst thing in the world,\" said coach David Joerger. \"A game or two can help you over the long haul.\" ... G Tony Allen missed his third straight game with a scratched cornea. ... Leuer's start was first since he was a rookie in 2011-12 for Milwaukee.\nCavaliers: Cleveland has won eight of nine at home. .. The Cavs are 9-2 when James has at least nine assists. ... Irving shot 8 for 13. He came in shooting just 37 percent (30 of 81) in his previous five games, but Cavs coach David Blatt isn't worried about his point guard's slump lingering. \"Guys go through periods like that,\" Blatt said. ... During a timeout, F Mike Miller's various hairstyles -- long, high and tight and a mullet -- were shown on the giant scoreboard, prompting James to turn to his teammate and say, \"That's (messed) up, man.\"\nPROTEST: During the game several dozen demonstrators gathered outside Quicken Loans Arena to protest the recent death of 12-year-old Tamir Rice, who was shot and killed by a Cleveland police officer while carrying a toy gun. The group walked to the steps of the building where they were met by about 30 uniformed officers.\nUP NEXT\nGrizzlies: Host Utah on Monday.\nCavaliers: Host Minnesota on Tuesday.",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.129847",
  "pipeline_version": "v1"
}