{
  "game_id": "0021400247",
  "espn_id": "400578539",
  "date": "Nov 30, 2014",
  "matchup": "POR vs. MIN",
  "headline": "Blazers beat shorthanded TWolves 107-93",
  "cleaned_body": "PORTLAND, Ore. -- Even LaMarcus Aldridge didn't feel well.\nFending off a cold, Aldridge nonetheless had 26 points and 15 rebounds in Portland's 107-93 victory Sunday night over the Timberwolves, a game where the ill and injured seem to outnumber the healthy.\nThe Timberwolves used just 10 players and two of them, Andrew Wiggins and Mo Williams, played even though they were ailing. Despite being shorthanded, they still kept the Blazers off balance.\n\"They were in a zone and we just didn't do a good job reading it,\" Aldridge said.\nWesley Matthews added 23 points for the Blazers, including six 3-pointers for his third straight game with at least five 3-pointers. The Blazers led by as many as 16 points in the second half.\nPortland (13-4) was coming off a 112-99 loss to Memphis on Friday night that snapped a nine-game winning streak.\n\"In the end it looked like a good game, but it was a struggle for most of the night as far as just kind of getting into a rhythm,\" Blazers coach Terry Stotts said. \"Minnesota did a good job of changing things up, going with a zone, so it was a game that I felt didn't have a lot of rhythm.\"\nShabazz Muhammad came off the bench with a career-high 28 points for Minnesota, which used just nine players. The Timberwolves have won just four games this season, including a 120-119 win in Los Angeles over the Lakers on Friday.\nInjuries and illness have decimated the Timberwolves (4-11). The latest was rookie forward Andrew Wiggins, who played just under 19 minutes after he was a game-time decision with a flu-like illness. He sat out the entire fourth quarter.\nThe Timberwolves were already playing without guards Ricky Rubio (left ankle) and Kevin Martin (fractured right wrist), and centers Nikola Petrovic (sprained right wrist) and Ronny Turiaf (right hip).\nWilliams, who played last season for the Trail Blazers, was playing for Minnesota despite battling strep throat and pink eye. He finished with 21 points and 11 assists, playing 40 minutes.\n\"I'm a team guy so I'm going to do whatever it takes until we can get back healthy,\" Williams said, but added about his minutes: \"I feel it. I feel it right now.\"\nPortland was without guard Will Barton because of gastritis. Damian Lillard had also fought a bug earlier in the week.\nThe Timberwolves went up 30-22 on the Blazers after Anthony Bennett's 21-foot jumper in the second quarter.\nPortland closed the gap and tied it 36-36 on Joel Freeland's basket before pulling in front on Allen Crabbe's 3-pointer. Aldridge's buzzer-beating layup gave the Blazers the 48-40 lead at the half.\nThe Blazers extended the lead to 61-48 on Wesley Matthew's 3-pointer with 7:24 left in the third quarter. Portland had an 8-0 run to close out the quarter for a 75-61 lead.\nThe Timberwolves closed within 89-80 on Gorgui Dieng's short jumper with 6:46 left. Thadeus Young's layup narrowed it to 91-84.\nLillard hit a 3-pointer with 4:10 left to extend Portland's lead to 96-85. Lillard finished with 17 points.\n\"I though defensively our zone was good tonight,\" Minnesota coach Flip Saunder said. \"But they scored a lot of their offense out of our offense. We had some turnovers and some ill-advised shots, and they were able to score in those situations.\"\n---\nTIP INS\nTimberwolves: The NBA granted the Timberwolves a roster exemption so they could expand their roster to 16 players because of all the injuries. Minnesota signed free agent forward Jeff Adrien on Saturday to add some much-needed depth. Adrien is a 6-foot-8 power forward who averaged 6.8 points and 5.8 rebounds in 53 games with Milwaukee and Charlotte last year.\nTrail Blazers: It was Seahawks night at the Moda Center, and the Lombardi Trophy was on display. Seahawks owner Paul Allen also owns the Blazers.\nHAPPY 100th!\nIt was Stotts' 100thvictory as coach of the Blazers. \"I wish we could have gotten it against Memphis,\" he quipped.\nALDRIDGE'S REBOUNDS\nWith 15 rebounds Sunday night, Aldridge moved into a tie with Buck Williams for the fourth-most career rebounds in franchise history, at 4,861. Following the game, when someone asked about passing Williams with one more rebound, Aldridge knocked on the wooden frame of his locker.\nQUOTABLE:\n\"We tried to give it all we had. We were out a lot of guys and that's a very good team. We gave it our all and I thought we did a pretty good job.\" -- Shabazz Muhammad.\nUP NEXT\nThe Timberwolves visit the Los Angeles Clippers on Monday night.\nThe Trail Blazers visit the Denver Nugget on Tuesday night.",
  "tags_rule": [
    "InjuryReport",
    "Streak",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.040789",
  "pipeline_version": "v1"
}