{
  "game_id": "0021700601",
  "espn_id": "400975347",
  "date": "Jan 09, 2018",
  "matchup": "ORL @ DAL",
  "headline": "Mavericks beat Magic 114-99, stop 3-game slide",
  "cleaned_body": "DALLAS -- Dennis Smith Jr. and Yogi Ferrell helped set the pace for the Dallas Mavericks in their 114-99 win over the Orlando Magic on Tuesday night.\nIt started with rebounding.\nThe 6-foot Ferrell led the team with eight boards, the 6-3 Smith had seven and the Mavericks used that spark to get offense going the other way.\n\"Me and Yogi run (after rebounding),\" Smith said. \"We find each other on the break pretty well, and when we can get into the paint it opens up the floor for everybody.\"\nFerrell said it was a result of the rest of the team boxing out, and he just benefited by grabbing the ball.\n\"Those guys do the hard part. We do the easy part and get boards,\" Ferrell said. \"When we do that it gets our break started a lot quicker.\"\nIt also led to a balanced scoring output for Dallas.\nDirk Nowitzki and Smith each scored 20 points as the Mavericks stopped a three-game slide. Wesley Matthews had 16 points for Dallas, which got its first win since Dec. 31 against Oklahoma City.\nHarrison Barnes and Ferrell scored 15 apiece, while J.J. Barea had 12 assists and eight points.\n\"Yogi came in and really changed the game,\" Mavericks coach Rick Carlisle said. \"His impact on the offensive and defensive ends -- his energy was great. In the first half, he was the one guy who was really battling on the boards for us, the shortest guy out there.\"\nCarlisle earned his 708th career win, moving past John MacLeod for 17th in NBA history. Next up is Gene Shue with 784.\nAaron Gordon scored 19 points for Orlando, which has lost five in a row. D.J. Augustin had 18 points, and Marreese Speights finished with 13 points and 10 rebounds.\nThe Magic have allowed at least 100 points in four of their last five games and have lost 14 of 15.\n\"They've just got to do better,\" coach Frank Vogel said. \"We've got to figure that out.\"\nThe Magic led 48-43 at halftime, but Nowitzki and Smith helped the Mavericks rally with 15 points apiece in the second half.\nWith his team leading 66-64 and 4:04 remaining in the third quarter, Ferrell made a pull-up jumper and Barnes followed with another jump shot. The Mavs carried an 82-75 lead into the fourth.\n\"We didn't stick with the same energy that we had in the first half,\" Augustin said. \"We didn't come out and execute like we were supposed to, like we did in the first half, and it kind of fell apart at the end.\"\nThe Magic pulled within four in the final period before the Mavericks closed the game with a 14-3 run over the final four minutes.\nDallas shot 51.8 percent from the floor. Orlando shot 45.6 percent and had 13 turnovers in a sloppy offensive performance.\nOFF THE BENCH\nGordon didn't start after he violated team rules. Vogel didn't elaborate on what rule, but Gordon indicated it had to do with being late to a team function.\n\"Obviously, it hurts. I want to be on the floor as much as I can and starting,\" Gordon said. \"I understand that time management is crucial. Being punctual is part of character. Having a high character leads into winning. It's the little things that matter, so I understand why they did it.\"\nTHE LOGO\nNowitzki went 7 for 7 from the free throw line and is tied with Jerry West for the sixth-most free throws in NBA history at 7,160. Michael Jordan ranks fifth with 7,327.\nTIP-INS\nMagic: F Wes Iwundu and C Kehm Birch were recalled from the G League.\nMavericks: Dallas has not lost a season series to Orlando since 1997-98. The final scheduled meeting between the teams is April 4 in Orlando.\nUP NEXT\nMagic: Visit the Milwaukee Bucks on Wednesday.\nMavericks: Visit the Charlotte Hornets on Wednesday.\n---\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "MomentumShift",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.022982",
  "pipeline_version": "v1"
}