{
  "game_id": "0021700552",
  "espn_id": "400975298",
  "date": "Jan 02, 2018",
  "matchup": "SAC vs. CHA",
  "headline": "Howard, Walker help Hornets pull away and beat Kings 131-111",
  "cleaned_body": "SACRAMENTO, Calif. --  Dwight Howard lost control of the ball on his way in for an apparent dunk when he was fouled from behind by Zach Randolph. As Howard tried to regain his footing, the ball floated about 3 feet above the rim and then fell straight back down and through.\n\n\"I don't know how it went in,\" Howard said with a grin.\n\nOn a night when Charlotte set season highs in several offensive categories, Howard's play was symptomatic of just how good things were going for the struggling Hornets.\n\nHoward had 20 points and eight rebounds, Kemba Walker added 12 points and 10 assists, and Charlotte built a big early lead in beating the Sacramento Kings 131-111 on Tuesday.\n\nNicolas Batum scored 21 points, Jeremy Lamb added 16, and Michael Kidd-Gilchrist and Marvin Williams had 10 points apiece to help the Hornets to their third consecutive victory in Sacramento.\n\n\"To score the way we did, really just did a lot of good things offensively,\" Hornets interim coach Stephen Silas said. \"We need to carry that over because our offense has not been very good up until this point, up until this trip. But things are starting to click a little bit and it's good.\"\n\nCharlotte came in as one of the NBA's worst 3-point shooting teams but repeatedly got open looks from beyond the arc, especially in the first half when the Hornets made 10 of their season high-tying 15 3s. Lamb and Batum hit three apiece to pace the outside shooting.\n\nFour days after stunning Golden State to begin their four-game trip, the Hornets set season highs in scoring and for points scored in the first half (72). Charlotte's previous high was 129 points in an overtime win over Washington on Nov. 22.\n\n\"It was pretty good,\" Howard said. \"I still think our defense could have been a lot better. We gave up too many points in the paint. One-on-one defense, especially for the bigs, could have been a lot better. We're going to take the positives but there are some things we still have to improve on.\"\n\nZach Randolph had 24 points and 10 rebounds for Sacramento. Skal Labissiere added 17 points and a career-best 15 rebounds for the Kings, who have lost five of six.\n\n\"Teams are definitely confident that they can come here and shoot well,\" Sacramento coach Dave Joerger said. \"It's just what it is until it's not.\"\n\nCharlotte led 32-25 but didn't pull away until an 18-4 run midway through the second. Four different Hornets made 3-pointers, and Howard had a dunk and short hook on consecutive possessions.\n\nWalker added a three-point play and Williams had a 3-pointer as part of another run for Charlotte, and Batum's short jumper put the Hornets up 72-52.\n\nSacramento made a brief surge in the third to pull to 76-65, but Kidd-Gilchrist scored eight points over the next 2 1/2 minutes to extend Charlotte's lead to 88-71.\n\nPICK-AND-ROLL PERFECTION\n\nMost of Charlotte's open 3-pointers came as a result of the Hornets' pick-and-roll offense that was basically unstoppable. \"It was more of our ball movement,\" Silas said. \"We stayed in the pick-and-roll basically the whole game, as much as we could. And we were making the extra pass and getting those open 3s.\"\n\nTIP-INS\n\nHornets: Charlotte was 26th in 3-point shooting going into the game but went 15 of 32 from beyond the arc. The 10 3s in the first half were one more than the Hornets were averaging over a full game.\n\nKings: Sacramento trailed at the break despite shooting above 60 percent for most of the first half. ... De'Aaron Fox scored 17 points in his return after missing eight games with a right quadriceps tear sustained against Minnesota on Dec. 14. The fifth overall pick in the draft, Fox shot 5 of 12 and had four assists. ... Frank Mason bruised his left heel Sunday against Memphis and will be re-evaluated in a week.\n\nUP NEXT\n\nHornets: Play the Lakers in Los Angeles on Friday night.\n\nKings: Host the Denver Nuggets on Saturday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "EarlyRun",
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.237999",
  "pipeline_version": "v1"
}