{
  "game_id": "0021400044",
  "espn_id": "400578336",
  "date": "Nov 03, 2014",
  "matchup": "OKC @ BKN",
  "headline": "Brook Lopez scores 18 in return as Nets rip injury-depleted Thunder",
  "cleaned_body": "NEW YORK -- Brook Lopez couldn't explain how happy he was to be back, though his smile said enough.\nFor the Oklahoma City Thunder, it was more misery.\nLopez scored 18 points in his first regular-season game in about 11 months, leading the Brooklyn Nets to the biggest home-opening romp in franchise history, a 116-85 victory over the injury-depleted Thunder on Monday night.\n\n\"I can't put it in words,\" Lopez said. \"It was great to be back out there. I've missed it for a long time and our team definitely took care of business tonight. Our guys make it easy.\"\nAlan Anderson added 18 points and Deron Williams had 17 points and nine assists for the Nets, who got their leading scorer back on a night the Thunder, already without Kevin Durant and Russell Westbrook, lost yet another player to injury.\nReggie Jackson scored 23 points in his season debut after missing the first three games with a sprained right ankle, but the Thunder left just as short-handed as they entered when starting guard Andre Roberson sprained his left foot. He played just 11½ minutes of the first half and left on crutches. He won't play Tuesday at Toronto.\n\"That's just how things are going right now. But we're not throwing the white flag. We're going to keep battling,\" Thunder coach Scott Brooks said.\nWith only nine players available, Jackson logged 42 minutes, shooting 8 of 20.\n\"I played pretty terrible. That sums it up. Seven turnovers. Shot poorly. I felt like I let I let my team down,\" Jackson said.\nLopez was averaging a team-best 20.7 points when he broke his right foot last Dec. 20 against Philadelphia and had season-ending surgery. He was back for the start of training camp but sprained the foot during an exhibition game in China and missed the Nets' first two games.\nHe had played so little that coach Lionel Hollins joked before the game that he would watch the 7-footer to \"make sure he doesn't trip over his tongue.\"\nThat wasn't a problem because Lopez got a quick rest, heading to the bench in less than three minutes after picking up two fouls. The Nets began building a big lead soon after, taking a 32-19 lead after going 5 of 7 from 3-point range in the first quarter.\nLopez shot 6 of 10 from the field and 6 of 7 from the foul line in 24 minutes, highlighted by a powerful dunk off a pass from Kevin Garnett in the first half.\n\"It was just good to see him have that bounce, explosion,\" Garnett said. \"We know he's having foot problems. He's playing through a lot, man. And like I've said, if we're going to be anything, we're going to need the big fellow.\"\nBrooklyn took a 59-40 lead to halftime when Bojan Bogdanovic and Mason Plumlee hooked up for an alley-oop to beat the buzzer.\nThe Nets led by as many as 35 in the second half, Durant standing in the coaches' huddle during timeouts with his broken right foot in a walking boot whenever Brooks tried unsuccessfully to halt Brooklyn's momentum.\nThe Thunder fell to 1-3, though this was the first time they were never really in the game. Perry Jones and Sebastian Telfair each finished with 16 points.\n---\nTIP-INS\nThunder: Oklahoma City had won five straight road games against the Nets, dating to when the franchise was based in New Jersey. ... Reserve Lance Thomas shot 1 of 10.\nNets: Garnett appeared in his 1,380th regular-season game, tying former Net Cliff Robinson for eighth on the career list. ... The Nets are 3-0 in home openers since moving to Brooklyn. The Empire State Building was shining black and white lights to celebrate this opener. ... The Nets will play four games during a weeklong homestand, including one against the rival New York Knicks on Friday.\nBEYOND THE BORDERS\nThe Nets had Bogdanovic (Croatia), Andrei Kirilenko (Russia), Sergey Karasev (Ukraine), Jorge Gutierrez (Mexico) and Jerome Jordan (Jamaica) on the court together in the fourth quarter, the first time in franchise history they have played five international players at one time.\nUP NEXT\nThunder: Visit Toronto on Tuesday, wrapping up an opening week that sends them 6,300 miles for five games, just one at home.\nNets: Host Minnesota on Wednesday.",
  "tags_rule": [
    "ReturnFromInjury",
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.828534",
  "pipeline_version": "v1"
}