{
  "game_id": "0021400269",
  "espn_id": "400578561",
  "date": "Dec 03, 2014",
  "matchup": "MIL vs. DAL",
  "headline": "Monta Ellis buzzer-beater lifts Nowitzki-less Mavericks",
  "cleaned_body": "MILWAUKEE -- Monta Ellis once again saved his sharp shooting for the end.\nEllis hit a wild, fall-away jumper at the buzzer, lifting the Dallas Mavericks over the Milwaukee Bucks 107-105 on Wednesday night.\n\"Too much Monta,\" teammate Tyson Chandler said. \"He's been playing unbelievable, doing a great job. Not just the final shot, but throughout the game with great penetration, finding guys, keeping the defense on their heels, getting us to the bonus early. Just playing great.\"\nA night earlier, Ellis hit three foul shots with 1.2 seconds left in regulation, then made his only 3-point shot of the game for a go-ahead hoop late in double overtime to win at Chicago.\n\nEllis followed up that 38-point effort against the Bulls by scoring 23 against Milwaukee. He had eight in the final two minutes on what otherwise had been a bad shooting night for the Mavericks' top scorer, playing against his former team.\nThe Mavericks won their fifth in a row while resting Dirk Nowitzki because of a sore back. Coach Rick Carlisle called it a \"precautionary\" move.\nNowitzki played 42 minutes in the Mavs' win at Chicago. He recently was given another night off.\nEllis did not stick around to talk to reporters afterward but did make brief comments on the Mavericks' television broadcast.\n\"Coach called the play for me to get an (isolation),\" Ellis said in the TV interview. \"He wanted me to take the last shot, so I just took my time. I just faded to try and get a shot off, and was able to see the basket.\"\nBucks coach Jason Kidd said Ellis \"made a tough shot.\"\n\"Walk or not a walk, they counted the basket. It didn't come down to just that last shot. We made some mistakes leading up to that,\" he said.\nWith Nowitzki out, Ellis got off to a slow start Wednesday. With about six minutes left in the fourth quarter, he was shooting 6-for-20 from the floor.\nThen, he found the range.\n\"We wanted Monta to have the ball at the end, to hit the shot and to get out of there,\" Carlisle said. \"Look, that's an All-Star, flat out. The load he's carried on this trip has been phenomenal. Winning two games without Dirk ... Monta Ellis is having some kind of year.\"\nChandler scored 18 points and added 20 rebounds for the Mavericks.\nBrandon Knight scored 25 points and Khris Middleton added 21 for the Bucks in their third straight loss.\nIn a back-and-forth ending, Ellis made a jumper that put the Mavs ahead with 32.9 seconds left, and Milwaukee turned the ball over on an offensive foul by Knight. Richard Jefferson hit one of two free throws for a 105-103 lead.\nBut Knight hit a jumper over Chandler to tie it with 8.9 seconds left. That set up Ellis, who made a shot falling away to his left with O.J. Mayo guarding him.\n\"'Juice' played some great defense,\" Kidd said. \"He made a tough shot. That's why they're pros.\"\nCUBAN'S CALL\nAs it turns out, a technical foul called on the Mavs' bench early in the third quarter was the handiwork of team owner Mark Cuban, who attended Wednesday's game.\n\"Mark has promised to email the league and let them know it was him who yelled at the ref and not my assistant coach,\" Carlisle said. \"The hope is that the technical will be rescinded. Just to get that on the record.\"\n'INSECURE' JABARI?\nEven after being chosen the Eastern Conference's rookie of the month Wednesday, Milwaukee's Jabari Parker was in no mood to pat himself on the back. Parker said he can't let himself get caught up in personal accolades.\n\"It's all good and dandy,\" Parker said. \"I'm not trying to be disrespectful or ungrateful, but it's only one month.\"\n\"It's just because I'm insecure, that's all,\" he said. \"No, that's the truth. That's the honest truth. You may not be able to brag about the same things a month (from now).\"\nTIP-INS\nMavericks: Carlisle said the team is being cautious to make sure Nowitzki's back injury doesn't linger or get worse. \"We've got to get that thing knocked out of there and get him ready for whatever the next game is,\" he said.\nBucks: Forward Ersan Ilyasova has been ruled out at least four games after an elbow to the face left him with a nasal fracture and concussion-like symptoms in Tuesday night's loss at Cleveland. The team said Ilyasova also showed symptoms of a mild concussion. ... Zaza Pachulia was called for a technical late in the second quarter.\nUP NEXT\nMavericks: Play Phoenix on Friday.\nBucks: Play Miami on Friday.",
  "tags_rule": [
    "InjuryReport",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.698992",
  "pipeline_version": "v1"
}