{
  "game_id": "0021400082",
  "espn_id": "400578374",
  "date": "Nov 08, 2014",
  "matchup": "POR @ LAC",
  "headline": "J.J. Redick (30 points), Blake Griffin (23) help Clippers hold off Blazers",
  "cleaned_body": "LOS ANGELES -- The Los Angeles Clippers finally got themselves together.\nAfter five lackluster games to open the season, including a 17-point loss at Golden State, their offense, defense and energy came together in a 106-102 victory over the Portland Trail Blazers on Saturday.\n\"We came out this year like we won something last year and everyone else came out like they got their heart broken,\" said DeAndre Jordan, who had 14 rebounds. \"We just needed to get back to what got us to where we were last year.\"\n\nJ.J. Redick broke out of a shooting slump with 30 points, and Blake Griffin added 23 while playing sick. Chris Paul had 22 points and 11 assists, and Jamal Crawford scored 20 points in his first start of the season.\n\"I'm a positive person and my glass is always half-full,\" Redick said. \"I knew I would start making some shots. I never got too discouraged, but frustrated for sure.\"\nDamian Lillard led the Blazers with 25 points. LaMarcus Aldridge had 21 points and 10 rebounds, and Robin Lopez scored 17 of his 19 points in the first half.\nAnother slow start led to the Clippers giving up 62 points in the first half, and Griffin \"looked like he was about to die at halftime,\" Paul said. \"He was laid out in there.\"\n\"I thought I was [dead],\" said Griffin, who felt nauseous. \"It wasn't too bad until I started running up and down.\"\nClippers coach Doc Rivers tried to take Griffin out, and he refused.\n\"Without him, we don't win this game,\" Paul said.\nGriffin milked what little energy he had and the Clippers rallied in the third, when they put together a nice run to leave the score tied at 79 heading into the final quarter.\n\"They came out in the second half with a lot more energy and were more active and picked it up and played at a different level,\" Lillard said. \"Redick was the difference. We should have defended him tighter but he made it tough on us when he started making shots.\"\nGriffin and Redick combined to score 15 of the Clippers' first 17 points of the fourth, extending their lead to 96-88. Redick had nine in the key stretch.\n\"To see J.J. going like that helped everybody,\" Paul said.\nLillard kept the Blazers in the game, reducing their nine-point deficit to two with nine straight points that left them trailing 102-100 with just over a minute left.\n\"We did not move the ball well in the second half and we got stagnant,\" former Clipper Chris Kaman said. \"It's frustrating when you have a team as skilled as we are and we lose like that.\"\nPaul was equally hot over the same stretch, scoring eight in a row to keep Los Angeles ahead 104-100.\n\"Usually the law of averages will take over and you make a few,\" Paul said. \"Other than down the stretch when we let Damian make all those buckets, our defense was pretty good.\"\nThe Clippers caught a break after Lillard's running layup cut Portland's lead to two. Paul missed, but Jordan swatted the ball out to Crawford on the perimeter with seven seconds left. Aldridge fouled Crawford, who made both for a 106-102 lead.\nPortland's Wesley Matthews, who finished with 14 points, missed a 3-pointer in the final seconds.\nThe Clippers put together a 14-0 run to take a 77-71 lead with 3:46 to go in the third. Crawford capped the run with two straight 3-pointers.\nThe Blazers led by 14 points in the first half, when both teams shot 51 percent. Portland hit six 3-pointers in the opening quarter, including three by Lillard.\nPortland's 62 first-half points marked the second time the Clippers have allowed over 60 in a half this season.\nClippers forward Glen Davis returned after missing the first five games with a right groin strain. He was scoreless in nine minutes.",
  "tags_rule": [
    "ClutchShot"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.194545",
  "pipeline_version": "v1"
}