{
  "game_id": "0021400494",
  "espn_id": "400578786",
  "date": "Jan 02, 2015",
  "matchup": "MEM @ LAL",
  "headline": "Griz hold on to edge Lakers as Kobe Bryant's buzzer 3 hits rim",
  "cleaned_body": "LOS ANGELES -- The Memphis Grizzlies were on the verge of going to overtime for the fifth time in 11 games when Kobe Bryant threw up a hurried 3-point attempt against them off an inbounds pass from Jeremy Lin.\nBryant had only 0.6 seconds to get off the shot, and it bounced off the rim as time expired, preserving the Grizzlies' 109-106 victory over the Los Angeles Lakers on Friday night.\n\"It's never over. You can't really believe that it didn't go in when he shoots it,\" Memphis coach David Joerger said. \"We all have watched him for so many years and he makes so many great plays, which he did tonight. He hit a tough 3 (with 24 seconds left) when Quincy (Pondexter) was right on him to bring it back to a one-point game.\"\n\nBryant now has missed 13 straight game-tying or go-ahead field goals in the final five seconds of the fourth quarter or overtime, according to ESPN Stats & Information.\nMike Conley had 19 points and nine assists for the Grizzlies, and Marc Gasol scored 18. Three other players scored in double digits for the Southwest Division leaders, who maintained their one-game lead over Dallas while beating the Lakers for the ninth time in the past 11 meetings and fifth time in a row.\nBeno Udrih, the sixth and last player off the Memphis bench, had 16 points in 19 minutes. Tayshaun Prince had a pair of clutch baskets in the final 1:22 to help the Grizzlies hold on. They improved to 24-8, the best start in franchise history, despite forward Zach Randolph missing his sixth straight game because of soreness in his right knee.\nLin and Ed Davis each had 20 points for Los Angeles, while Bryant finished with 15 points, nine rebounds and eight assists. Carlos Boozer scored 14 points in 21 minutes before fouling out with 6:01 remaining and the Lakers trailing 93-88. Teammate Jordan Hill fouled out on an offensive charge with 3:31 to play and the Lakers down 100-96.\nLos Angeles was facing a six-point deficit before Nick Young hit a 3-pointer and converted a breakaway layup off his steal of Conley to slice the deficit to 97-96 with 4:18 left. But the Grizzlies responded with Conley's 3-pointer and a pair of free throws by Gasol.\nDavis, who spent more than a season with the Grizzlies before signing a multiyear deal with the Lakers in July as a free agent, missed the second of two free throws with 2.8 seconds on the clock and a chance to tie the score.\nCourtney Lee was fouled by Young on the ensuing inbounds play and missed one of two at the line, giving the Lakers one more opportunity after Bryant got the rebound and called a timeout.\n\"I'm surprised that I got that good of a look,\" Bryant said. \"It's a tough shot. My main concern was to get it off in time and give myself a chance.\"\nLin made his first five shots and was 6-for-8 from the field with 13 points in his first 13 minutes, leading the Lakers to a 52-47 halftime lead. His fifth basket was a 3-pointer that gave them their biggest lead, 34-22, with 10:02 left in the second quarter.\n\"He played well,\" Bryant said. \"It's a fine balance for him, in terms of when to shoot it and when to set everybody up, but he'll work through it.\"\nMemphis forward Tony Allen had a night to forget, scoring five points in 16 minutes on 2-for-9 shooting.\n\"In the first half, we didn't really play our best,\" Conley said. \"We gave them a little bit of life, and they were confident. When you get a team confident, they believe they can win -- and you'll be in for a long night.\"\nDavis, playing with a clear face mask for the first time since his nose was broken on a foul by Denver's Nate Robinson, blocked a shot by Allen 2:06 after opening tip, and finished the first quarter with nine points and six rebounds.\nTIP-INS\nGrizzlies: Vince Carter played 16 scoreless minutes off the bench for Memphis and attempted five shots -- four of them from 3-point range. ... Memphis improved to 16-4 against Western Conference teams. ... Randolph, who was obtained by Memphis in a July 2009 trade with the Clippers, is 62 rebounds away from overtaking Gasol's brother Pau for the Grizzlies' franchise record.\nLakers: Los Angeles' 10-23 start is the second-worst in the franchise's 67-year history. The 1957-58 Minneapolis Lakers won eight of their first 33 games. The club got off to an 11-22 start in 1959-60 and again in 1993-94. ... F Ryan Kelly, who had been limited to three games all season because of hamstring injuries, played for the first time since Nov. 16.\nNEXT UP\nGrizzlies: At Denver on Saturday.\nLakers: Host Indiana on Sunday.\nThe Associated Press contributed to this report.",
  "tags_rule": [
    "FoulTrouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:54.032920",
  "pipeline_version": "v1"
}