{
  "game_id": "0021400347",
  "espn_id": "400578639",
  "date": "Dec 13, 2014",
  "matchup": "DET @ SAC",
  "headline": "Pistons win second in a row, beat Kings 95-90",
  "cleaned_body": "SACRAMENTO, Calif. --  After going nearly a month without a victory, the Detroit Pistons now proudly own a two-game winning streak.\n\nGreg Monroe scored 24 points, Josh Smith had 21 points, 13 rebounds and five blocked shots, and the Pistons beat the Sacramento Kings 95-90 on Saturday night.\n\nThe Pistons used a 24-14 advantage in the third quarter and never relinquished the lead in registering back-to-back wins for only the second time all season.\n\nDetroit, 5-19 this season, had lost 13 straight and was one loss shy of tying the franchise record before beating Phoenix on Friday.\n\n\"When you're 3-19 there is no pressure to win with that kind of record. You can play carefree, and just try to play your game,\" said Smith, who shot 6 of 9 from the field.\n\nSmith's game, which included seven turnovers, was far from perfect, and his teammates weren't, either. Detroit missed 14 of 20 3-pointers, was outrebounded 55-43 and its 15 turnovers resulted in 20 points.\n\nBut it helped that the Kings were again without leading scorer and rebounder DeMarcus Cousins, who missed his ninth straight game with viral meningitis. The Kings have gone 2-7 without Cousins, who has no timetable for a return.\n\nRudy Gay made four 3-pointers and scored 20, and also added eight rebounds and eight assists for the Kings, who shot 35 percent. But Gay also struggled overall, hitting just 6-of-22 attempts. Usually productive point guard Darren Collison missed nine of 10 shots and had three points.\n\n\"Definitely holding them to 35-percent shooting was good,\" Detroit coach Stan Van Gundy said. \"We made it tough on Rudy Gay -- a great player -- and Collison. We did what we wanted to do defensively.\"\n\nCarl Landry had 15 points and Ben McLemore 14 for Sacramento, which has dropped three straight and eight of 10.\n\nAndre Drummond had 12 points and 10 rebounds, and Kyle Singler added 11 points for Detroit, which had a season-high nine blocks.\n\nWith the Pistons clinging to a four-point lead, Kentavious Caldwell-Pope hit a 3-pointer and DJ Augustin made two free throws to make it 88-79 with 34 seconds remaining. Consecutive 3-pointers by McLemore cut the lead to three points, but Monroe had a breakaway dunk to help seal the victory.\n\nThe Pistons spread the ball around offensively in the second half and played effectively on defense against the cold-shooting Kings, who opened the season with a 9-5 record but have struggled since losing Cousins.\n\n\"I don't think we are waiting for DeMarcus to come back. We just are not playing the right basketball right now,\" Collison said.\n\n\"Regardless when he comes back or not, we are not playing the right basketball. DeMarcus does a lot of things that are good for us and he also builds us up because he is so talented. But you never want to rely on just one guy to build you up.\"\n\nDetroit trailed by three points before scoring 11 unanswered to start the third quarter. The Kings missed their first nine shots and went scoreless for more than 4 1/2 minutes. Despite a 13-0 run later in the period, Detroit only led 67-60 entering the fourth.\n\n\"I thought we missed a lot of great looks. That third quarter really hurt us,\" Kings coach Michael Malone said. \"We shot 18 percent in that quarter. So that makes it hard to build a lead and win games when you struggle to make shots.\"\n\n---\n\nTIP-INS\n\nPistons: Point guard Brandon Jennings had another rough evening offensively, finishing with three points. He is averaging 5.3 points in the past seven games.\n\nKings: Sacramento entered the game averaging less than five 3s a game. The Kings made 7 of 14 in the opening half and finished with a season-high 11. ... Reserve forward Omri Casspi missed his second straight game with a left knee bone contusion.\n\nFATHER VS. SON\n\nBrendan Malone, the father of Kings coach, is an assistant coach with the Pistons. The two spoke for about 10 minutes outside the Kings' locker room after the game, with father providing some consoling words. \"My son is a very good coach, he's done a nice job with this team,\" Brendan said. \"But I understand what he's up against right now, he's doesn't have his best player. That's difficult.\"\n\nUP NEXT\n\nPistons: Visit the Los Angeles Clippers on Monday.\n\nKings: Host Oklahoma City on Tuesday.",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.557348",
  "pipeline_version": "v1"
}