{
  "game_id": "0021300641",
  "espn_id": "400489514",
  "date": "Jan 24, 2014",
  "matchup": "CHI vs. LAC",
  "headline": "Blake Griffin has double-double as Clippers 8-3 without Chris Paul",
  "cleaned_body": "CHICAGO -- When the Los Angeles Clippers lost All-Star Chris Paul to a separated shoulder, they turned to Blake Griffin for leadership.\nAnd he has responded by stepping up his play.\nGriffin had 26 points, 13 rebounds and seven assists to lead the Los Angeles Clippers to a 112-95 victory over the Chicago Bulls on Friday night. The Clippers improved to 7-3 since Paul, who was averaging 19.6 points and 11.2 assists, was injured.\n\"Blake doesn't run from a challenge,\" Clippers guard Jamal Crawford said. \"He's one of the hardest workers I've seen.\"\n\nThe Clippers enjoyed a strong outside game, opening up Griffin on the inside, and he finished with his 27th double-double.\n\"(I want to be) a leader for us, knocking down shots and being able to mix up my game, going inside when I felt the need to and going outside when I needed to,\" Griffin said.\nCrawford added 19 points for the Clippers, who had six players score in double figures and shot 54 percent from the field -- including 13 for 21 on 3-pointers. DeAndre Jordan added 10 points and 12 rebounds.\n\"They were open, the right guy was taking them, all of our 3-point shooters,\" Clippers coach Doc Rivers said. \"They made them, and that opened it up for Blake.\"\nCarlos Boozer scored 22 points for the Bulls, who snapped a three-game winning streak.\n\"I don't think any aspect of our defense was any good,\" Bulls coach Tom Thibodeau said.\nThe Clippers have won four straight against the Bulls, and improved to 3-2 on their seven-game trip.\nChicago cut the lead to eight in the third quarter but Darren Collison answered with two quick baskets and the Clippers led 92-80 heading to the fourth.\nLos Angeles got off to a strong start. The Clippers shot 10 for 14 on 3s and finished 64.1 percent overall from the field in the first half to take a 68-55 lead at halftime.\nJordan's dunk gave the Clippers a 60-39 lead, their largest margin, with 3:52 left before halftime.\nLos Angeles was 7 for 8 from beyond the arc in the first quarter to set a franchise record for 3s in a quarter. The Clippers led 41-26 after shooting 73.7 percent in the period.\n\"That's kind of what we talked about, especially defensively,\" Griffin said about the quick start. \"But we still didn't do a good job in the first quarter. We were just so hot early. We got that lead and kept it. Especially on the road, you never want to come out sluggish.\"\nIn the teams' previous meeting, the Clippers routed the Bulls 121-82 on Nov. 24 for their worst loss of the season in the first game after Derrick Rose suffered a season-ending knee injury.\nThe Clippers were averaging 105.4 points, fifth in the league. The Bulls were one of the NBA's top defensive teams, holding opponents to 92.5 points per game before Friday.\n\"Giving up 3s, we strive for five or less,\" Bulls forward Taj Gibson said. \"That was just crazy. We kept fighting. But once they give a team like that confidence, it's hard to shut them off.\"\nJ.J. Redick scored 18 points and shot 4 for 7 from 3-point range.\nCollison, playing despite a sprained toe, had 17 points.\nBoozer, back from a one-game absence due to a sore left calf, scored 16 points in the first quarter.\nGibson added 18 points, Mike Dunleavy had 17 and Joakim Noah 12 as the Bulls shot 43 percent from the field and 6 for 19 from 3-point range.\nThe Bulls were without Kirk Hinrich, who missed his second consecutive game with a strained right hamstring.\n\"I think we were passive,\" Bulls guard Jimmy Butler said. \"I don't like the word `soft,' but I think we were a little bit of that too.\nThey got the shots they wanted to get. We didn't make it too tough for them at all.\"\nGame notes\nRivers said the Bulls shouldn't let Thibodeau get away. Thibodeau was on Rivers' coaching staff from 2007-10 with the Boston Celtics. \"I think it would be nuts not to have him here,\" Rivers said. \"He's the best coach, one of the best coaches, in the league, so if you have that, that's an asset. And I don't think any right-minded organization would allow that asset to leave. Because with all this adversity they've had with injuries, if you allow that one to leave, things will fall apart -- and that would be pretty much a guarantee.\" Thibodeau declined to address rumors about his future. ... Hinrich will possibly miss the Bulls' trip to Charlotte on Saturday as he continues to receive treatment, Thibodeau said. ... Thibodeau said it would be a great experience for Rose to play for Team USA if he is healthy. Rose was one of 28 players named to the 2014-16 national team pool. The FIBA Basketball World Cup will be Aug. 30-Sept. 14 in Spain. Rose is out for the NBA season after undergoing knee surgery on Nov. 25. ... Thibodeau picked up a technical foul with the Bulls trailing 86-74 with 2:10 left in the third quarter.",
  "tags_rule": [
    "DoubleDouble",
    "ThreePointExplosion",
    "Streak",
    "CoachComment",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.959235",
  "pipeline_version": "v1"
}