{
  "game_id": "0021400283",
  "espn_id": "400578575",
  "date": "Dec 05, 2014",
  "matchup": "HOU @ MIN",
  "headline": "Rockets need OT to beat Wolves despite James Harden's 38 points",
  "cleaned_body": "MINNEAPOLIS -- The Houston Rockets found themselves in an unexpected fight as they staggered into overtime against lowly Minnesota, and James Harden and Dwight Howard couldn't do anything to help them.\nIn what has quickly become a defining characteristic for this version of the Rockets, they somehow found a way.\nHarden had 38 points before fouling out and Nick Johnson scored on a driving layup with 0.8 seconds to go in overtime that helped the Rockets escape with a 114-112 victory over the Timberwolves on Friday night.\n\"I foul out and they still go out there and win the game,\" Harden said. \"Small things like that put it in our minds that we're building and we're growing as a team.\"\nHarden made 11 of 17 shots and also had six assists, but he fouled out with 1:20 to play in regulation and the Rockets let a 13-point lead with 5 minutes to go slip away. Jason Terry, the veteran who has been so valuable with Howard out, hit a 3-pointer and then two free throws in overtime to finish with 19 points. Terry also fed Johnson for the winning bucket.\nThaddeus Young had 19 points for the Timberwolves, the last two coming with 15.9 seconds to go in overtime to tie the game at 112.\nBut Johnson got loose on the final possession and bulled to the rim to hit a tough layup that gave the Rockets (15-4) their sixth win in seven games.\nShabazz Muhammad scored 20 points for the Timberwolves, who were coming off an embarrassing loss to Philadelphia on Wednesday night that snapped the 76ers' 17-game losing streak to start the season. Minnesota put up a much more inspired effort on Friday night, outscoring Houston 22-9 in the final 5 minutes of regulation, but couldn't finish it off.\n\"It hurt for two days, how embarrassing it was to lose to Philadelphia and all that (stuff),\" Rockets coach Kevin McHale said. \"Bottom line is they played harder than we did the whole night, but we just got lucky and won.\"\nThe Wolves were down 96-83 before Zach LaVine converted a three-point play off a dunk, Corey Brewer threw down a dunk in transition and Andrew Wiggins' dunk gave the Wolves a 105-101 lead with 58 seconds to play.\nDonatas Motiejunas scored on a hook shot and hit two free throws to tie the game with 15 seconds to play, and Chase Budinger missed a long jumper at the buzzer that would've won it for Minnesota.\n\"We really should've won,\" said LaVine, who scored 17 points but missed two open jumpers late in the fourth. \"We made some bad plays, but we grew and did a lot better than we did last game.\"\nBoth teams have been racked by injuries, with the Wolves missing Ricky Rubio (ankle), Kevin Martin (wrist), Nikola Pekovic (foot), Ronny Turiaf (hip) and Mo Williams (back).\nThe Rockets have plenty of injuries of their own. Howard has missed the last nine games because of a strained right knee, point guard Patrick Beverley is out with a hamstring strain and power forward Terrence Jones has a left leg injury.\n---\nTIP-INS\nRockets: Trevor Ariza had 17 points and nine rebounds in 44 minutes. ... Kostas Papanikolaou had 10 points and four rebounds off the bench, but couldn't finish the game because of a knee injury that McHale said will be evaluated on Saturday. ... It was the 16th time in 19 games that the Rockets hit at least 10 3-pointers.\nTimberwolves: Coach Flip Saunders said Williams would not make the trip to San Antonio for Saturday's game and will be re-evaluated when the Wolves come back home. ... All five Wolves starters scored in double figures, including 15 points, seven rebounds and six assists for Brewer.\nJOHNSON'S BIG SHOT\nJohnson's game-winner came off a busted play, with Terry running a pick-and-roll with Motiejunas and the defense collapsing on him as he went to the basket. LaVine lost Johnson in the scramble, and he slipped by him for the layup.\n\"We got the win,\" a relieved Johnson said. \"So that's all that matters.\"\nMARTIN ON THE MEND\nMartin spoke to reporters Friday for the first time since he broke his right wrist against the Knicks on Nov. 19. It's a nearly identical injury to the one he had on his left wrist a few years ago, but Martin said he expects a longer, harder recovery this time around.\n\"I do remember my left, there was a lot of soreness, but I don't have a left hand anyways so I didn't really need that,\" Martin said, a joking reference to his proclivity to going to his right. \"With the right, it's going to be a tougher rehab. I'll have to put in a lot more time in this one. So we'll see.\"\nUP NEXT\nRockets: Host Phoenix on Saturday.\nTimberwolves: At San Antonio on Saturday.",
  "tags_rule": [
    "Streak",
    "FoulTrouble",
    "CoachComment",
    "InjuryReport",
    "ClutchShot"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:50.725855",
  "pipeline_version": "v1"
}