{
  "game_id": "0021400987",
  "espn_id": "400579279",
  "date": "Mar 15, 2015",
  "matchup": "POR @ TOR",
  "headline": "LaMarcus Aldridge nets 24 as Blazers continue dominance of Raptors",
  "cleaned_body": "TORONTO -- Portland's Nicolas Batum was so pleased with the way his team played in a big win over the Raptors, he called it \"a dream game.\"\nTo slumping Toronto, it was more like a nightmare.\nLaMarcus Aldridge had 24 points and 10 rebounds and the Trail Blazers beat Toronto for the 12th time in 13 meetings, routing the struggling Raptors 113-97 on Sunday night.\n\"That was a great game tonight, one of the best games of the year,\" said Batum, who finished with 10 points and 12 assists, one shy of his season-high. \"Offense and defense, the way we played was serious, very focused on the game plan. That was a dream game almost. I would love to play like that every time.\"\nDamian Lillard scored 23 points, and Arron Afflalo had 14 to help the Trail Blazers open a five-game trip with their eighth victory in nine games. They improved to 3-1 since losing starter Wesley Matthews to a season-ending ruptured Achilles tendon.\n\"We're peaking at the right time,\" Aldridge said. \"You want to peak toward the end of the season and right now we're peaking at the right time.\"\nDeMar DeRozan scored 22 points, and Jonas Valanciunas had 14 for Toronto. The Raptors lost for the 10th time in 12 games. Toronto, which beat Miami on Friday night, has not won consecutive games since a four-game run on either side of the All-Star break that included home wins over the Clippers, San Antonio and Washington, and a road victory at Atlanta.\nLou Williams scored 11 points, and Kyle Lowry, Amir Johnson and Greivis Vasquez each had 10 for Toronto, who sent many in the sellout crowd of 19,800 home early after falling behind by 18 points in the final quarter.\n\"We have to make sure we get stops,\" Raptors coach Dwane Casey said. \"If you don't it's going to be a long night, especially against a great 3-point shooting team like Portland.\"\nBatum's double-double was his second in five games, and he's scored 10 or more in four of those.\n\"He probably benefited from the All-Star break more than anybody,\" Portland coach Terry Stotts said. \"It allowed him to kind of rest his mind and rest his body and he's been the Nic Batum that we're all used to.\"\nTrailing 93-79 after Chris Kaman's layup to begin the fourth, Toronto cut it to eight with a 6-0 run. After a Portland timeout, the Blazers replied with eight straight points, including a 3 by Afflalo and two straight dunks by Dorell Wright, to restore the double-digit cushion. The Raptors never threatened again.\n\"We just have to play with some more pride,\" Vasquez said. \"All of us.\"\n___\nDOUBLING DOWN Aldridge recorded his 10th straight double-double against the Raptors, the team that bypassed him with the top pick in the 2006 draft in favor of Andrea Bargnani. Aldridge said he no longer uses the snub as motivation. \"When I was younger, I used to think about being a No. 1 pick and about how I should have been a No. 1 pick,\" he said, \"but when you've been in the league this long, I don't even think about it anymore.\"\nLATITUDE\nPortland's official Twitter feed poked fun at Toronto's 'We The North' slogan, pointing out that the Oregon city is at 45.5 degrees, almost two full degrees of latitude further north than the Ontario capital. Minneapolis (44.9 degrees) also is farther north than Toronto (43.7 degrees). After the game, Stotts asked local reporters whether they knew that Portland was farther north than Toronto.\nTIP-INS\nTrail Blazers: F Joel Freeland served a one-game suspension, earned for head-butting Detroit's Shawne Williams on Friday night. ... Batum had a season-high 13 assists in a Dec. 2 win at Denver. His career high is 14. ... Portland is 6-1 in March.\nRaptors: C Valanciunas returned to the starting lineup after sitting out Friday's game following the birth of his first child, a son. ... Toronto fell to 4-2 in Sunday home games. ... The Raptors haven't beaten Portland since a 102-79 home win on Jan. 2, 2013.\nUP NEXT\nTrail Blazers: Visit Wizards on Monday night.\nRaptors: Visit Pacers on Monday night.",
  "tags_rule": [
    "DoubleDouble",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.490121",
  "pipeline_version": "v1"
}