{
  "game_id": "0021400613",
  "espn_id": "400578905",
  "date": "Jan 19, 2015",
  "matchup": "DET @ ATL",
  "headline": "Hawks win 13th straight, one shy of tying team record",
  "cleaned_body": "ATLANTA -- The NBA's best defense kept the Atlanta Hawks' winning streak intact.\nThe Hawks won their 13th straight game, one shy of tying the team record, as Mike Scott and Paul Millsap each scored 20 points Monday in a 93-82 victory over the Detroit Pistons.\nAtlanta is allowing 96.3 points per game, tops in the league. Strong defense helped the Hawks overcome poor shooting from some of their usual scoring leaders against Detroit.\n\nThe Pistons, held to a season-low 12 points in the opening quarter, made only 35.4 percent of their shots -- 29 of 82.\n\"Our defense has got to be there every night and I think that is what put us in position ... to pull out a tough win,\" Hawks coach Mike Budenholzer said.\nThe Hawks haven't lost since Dec. 26 against Milwaukee. They have won 27 of 29 to move to the top of the Eastern Conference. Monday's win before a sellout crowd of 19,108 opened a seven-game homestand.\n\"We want to stay humble as well,\" Scott said.\nScott had eight points as the Hawks pulled away in the fourth quarter. His scoring off the bench helped offset poor shooting from Jeff Teague and Kyle Korver, who combined to make only 8 of 23 shots.\n\"We needed someone to score because a lot of us were off in the first half,\" Korver said. \"Mike came in and gave us that spark.\"\nAl Horford added 14 points, seven assists and six rebounds.\nThe Pistons were trying for their franchise-record eighth straight road win. Detroit had won 11 of 13 overall before its third straight loss to the Hawks this season.\nDetroit coach Stan Van Gundy said Atlanta's defense \"was really good ... a big part of it.\"\n\"I couldn't find anything for us to run that was consistently getting us shots,\" Van Gundy said. \"So it was frustrating on my part, too, not just with our players, with myself. We just couldn't get it going offensively. But I give their defense a lot of credit.\"\nGreg Monroe led Detroit with 16 points and 20 rebounds. Andre Drummond added 13 points and 18 rebounds, but made only 3 of 12 free throws.\n\"They're just active,\" said Monroe of the Hawks' defense. \"Obviously they're a good defensive team.\"\nAtlanta took an 8-0 lead and led 16-12 at the end of a first quarter that included 34 missed shots. The Hawks led 44-41 at the break.\nKorver warmed up with two 3-pointers in the third quarter and had 13 points.\nThe Hawks stretched the advantage to double figures for the first time in the final four minutes.\nTIP-INS\nPistons: The 12 first-quarter points set a season low for any period. ... Drummond had 11 rebounds in the first period. ... Detroit also won seven straight road games in 2002. ... The Hawks ended Detroit's seven-game winning streak on Jan. 9.\nHawks: G Shelvin Mack was held out and could miss at least one week with a left calf strain. ... The longest winning streak in franchise history was 14 games in 1993. ... Horford was named Eastern Conference player of the week after averaging 21.7 points on a league-leading .844 (27-of-32) shooting percentage. He had a triple-double in a win over Philadelphia and averaged 8.0 rebounds and 6.3 assists for the week.\nBOARD WORK\nThe Pistons held the Hawks without an offensive rebound in the first half. Detroit finished with a 61-42 advantage in rebounds. Atlanta grabbed five offensive rebounds in the second half.\n\"I covered my eyes sometimes when the ball went up to the rim,\" Budenholzer said. \"Our guys are fighting. It's not for lack of effort. ... We're prioritizing transition defense and getting back.\"\nKEEP SHOOTING\nBudenholzer said before the game he puts no limit on Korver's 3-point attempts. Korver leads the NBA with his 53.6 percent shooting on 3s. He made three of six 3s against Detroit.\n\"Kyle can shoot whenever he wants,\" Budenholzer said. \"Kyle can shoot coming out of the locker room.\"\nUP NEXT\nPistons: Host Orlando on Wednesday.\nHawks: Host Indiana on Wednesday.",
  "tags_rule": [
    "TripleDouble",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.707041",
  "pipeline_version": "v1"
}