{
  "game_id": "0022101197",
  "espn_id": "401361016",
  "date": "Apr 07, 2022",
  "matchup": "TOR vs. PHI",
  "headline": "Pascal Siakam has triple-double, Raptors beat 76ers 119-114",
  "cleaned_body": "TORONTO -- — Pascal Siakam had 37 points, 12 assists and 11 rebounds for his third career triple-double, Gary Trent Jr. scored 30 points and the Toronto Raptors beat the Philadelphia 76ers 119-114 on Thursday night.\n\nSiakam shot 14 for 28, going 1 for 7 from 3-point range. He made 8 of 10 free throws.\n\n“Pascal, obviously, was awesome,” Raptors coach Nick Nurse said.\n\nSixers coach Doc Rivers called Siakam “phenomenal,” and said the Raptors forward is “playing sensational basketball.”\n\n“He made some crazy shots,” Rivers said. “When he gets in the paint, he’s so clever.”\n\nPrecious Achiuwa scored 20 points and made a career-high five 3-pointers, and Scottie Barnes had 13 points and 10 rebounds to help the Raptors win for the seventh time in eight games.\n\n“We come out and try to be aggressive,” Siakam said. “No matter who we play, if we keep our focus and intensity, and do the things that we know we can do, we’ll be dangerous against anybody.”\n\nJoel Embiid had 30 points and 10 rebounds, and James Harden had 13 points and 15 assists for the 76ers, whose hopes of winning the Atlantic Division title took a hit.\n\nTyrese Maxey scored 22 points, and Danny Green shot 6 for 7 from 3-point range and scored 18 points for Philadelphia. The Sixers (49-31) remain a half game behind Boston (50-31) after the Celtics lost to Milwaukee.\n\nToronto is two games behind Philadelphia. Both teams have two games remaining. The Raptors won three of four against the Sixers this season, meaning the Raptors hold the tiebreaker.\n\nRivers called it a “frustrating loss.”\n\n“Offensively, I thought we lost our rhythm,” Rivers said. “We lost our pace. That’s happened about three times now. We’ve got to keep our pace going.”\n\nThe 76ers trailed 106-102 after Green connected from 3 with 3:31 remaining in the fourth quarter, but Trent scored five points as Toronto answered with a 9-5 run. A steal by Siakam led to a driving dunk for Barnes with 1:30 left, putting the Raptors up 115-107.\n\nPhiladelphia guard Matisse Thybulle was listed as ‘ineligible to play’ on the official NBA injury report. Thybulle, a defensive specialist, has not said publicly whether he is vaccinated against COVID-19. Unvaccinated foreign nationals are currently prohibited from entering Canada. Limited exemptions to the rule no longer apply to professional athletes.\n\n“Matisse had nothing to do with this game,” Rivers said. “We would have lost the game with Matisse.”\n\nMaxey didn’t share the his coach’s sentiments.\n\n“Of course we miss him,” Maxey said of Thybulle. “Him doing what he does, it’s always great for us.”\n\nHarden agreed, saying Thybulle’s absence for multiple games of potential playoff series against Toronto would be “a huge thing.”\n\n“He’s our starter, he’s our best defender,” Harden said.\n\nRaptors guard Fred VanVleet sat because of a sore right knee, while forward OG Anunoby missed his third straight because of a sore right quadriceps.\n\nToronto missed 10 of its first 11 field goal attempts as Philadelphia jumped out to a 17-2 lead. The Sixers were up 33-26 after one quarter.\n\n“We got off to a really good start,” Harden said. “We just didn’t sustain it for the entire game.”\n\nThe Raptors rallied to take a 35-34 lead on Trent’s 3-pointer with 9:23 left in the half. Philadelphia led 60-56 at the intermission.\n\nSiakam scored 15 points in the third and Trent added nine to give the Raptors an 87-85 lead after three quarters.\n\nTIP-INS\n\n76ers: Green started in Thybulle’s place. … Harden shot 3 for 12. … The 76ers finished with three fast-break points, all of them in the fourth quarter. … Made 17 turnovers, leading to 25 points.\n\nRaptors: F Yuta Watanabe (left quadriceps) sat for the fourth straight game. …Achiuwa’s previous career-high for 3-pointers was four, set twice.\n\nPUT A RING ON IT\n\nGreen finally received his 2019 NBA championship ring. VanVleet and Siakam presented the ring to Green in a pregame ceremony at center court.\n\n“It was everything I expected it to be,” Green said. “It was great.”\n\nFASHION FILE\n\nGreen wore a red and black sequined jacket to his postgame press conference. He acknowledged that he had gifted his 2019 Raptors championship jacket to Toronto rookie Scottie Barnes, who modelled it before the game.\n\n“He looked great,” Green said. “He was representing me well.”\n\nBIRD WATCHING\n\nBlue Jays slugger Vladimir Guerrero Jr. and right-hander Alek Manoah attended the game.\n\nUP NEXT\n\n76ers: Host Indiana on Saturday night\n\nRaptors: Host Houston on Friday night.\n\n------",
  "tags_rule": [
    "TripleDouble",
    "CoachComment",
    "EarlyRun",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.623931",
  "pipeline_version": "v1"
}