{
  "game_id": "0021401147",
  "espn_id": "400579439",
  "date": "Apr 05, 2015",
  "matchup": "OKC vs. HOU",
  "headline": "Harden's 41 bests Westbrook's triple-double in Rockets win",
  "cleaned_body": "OKLAHOMA CITY -- James Harden led a postgame dance session in the Houston locker room.\nAnd why not? He scored 41 points, and his Rockets overcame Russell Westbrook's triple-double to beat the Oklahoma City Thunder 115-112 on Sunday.\nIn the process, Harden bested of one of his top challengers for the MVP award and silenced the fans who constantly booed him in the building where he once was beloved. The former Thunder star scored 10 points in the fourth quarter to give his team a cushion.\n\n\"That's my job,\" Harden said. \"It's what I do. I go out there and I take the big shots. My teammates did a great job the entire game of making shots, getting to the rim, just being in attack mode, being aggressive. In the fourth quarter, then, I've got to make shots.\"\nHarden and Westbrook, the league's top two scorers, both entered the game averaging 27.5 points. Harden made 12 of 22 shots and 6 of 9 3-pointers before fouling out with 33 seconds left. The Rockets hung on to win for the seventh time in eight games.\n\"Guys are locked in,\" Harden said. \"They're focused on what we need to do to win, no matter who gets the credit, no matter who gets the glory.\"\nWestbrook finished with 40 points, 13 assists and 11 rebounds. It was his 11th triple-double of the season and the 18th of his career.\nEnes Kanter added 21 points and 17 rebounds for the Thunder, who lost their third straight. Their lead over New Orleans for the No. 8 spot in the Western Conference was cut to a half-game.\nAccording to Stats LLC, Westbrook's 11 triple-doubles are the most for a player in a season since Jason Kidd had 13 in 2007-08, and his nine triple-doubles in a 20-game span are the most in such a stretch since Chicago's Michael Jordan had 11 in 15 games from March 25-April 21, 1989.\nThe Rockets led 89-80 early in the fourth quarter before Westbrook re-entered the game. The Thunder chipped away, and Westbrook tied the score at 100 with a 3-pointer with just more than 3 minutes to play.\nHarden made 3-pointers over Oklahoma City's Kyle Singler on consecutive possessions to put the Rockets up 106-101. Harden made another jumper from near the foul line, this time over Westbrook, to bump the lead to seven.\n\"The shots that he made were tough shots -- step a guy back,\" Houston coach Kevin McHale said. \"But he's been doing it all year. He works hard on those shots, and he makes them.\"\nOklahoma City's Anthony Morrow sank a 3-pointer to cut the deficit to 114-112 with 5.5 seconds to play. Houston's Corey Brewer missed the second of two free throws with 5 seconds remaining to give the Thunder a chance, but Westbrook missed a deep, off-balance 3-pointer as time expired.\nThe Rockets led 42-29 in the second quarter before back-to-back dunks by Westbrook shifted the momentum. Back-to-back 3s by Morrow and D.J. Augustin cut Houston's lead to 52-47. Harden's 3-pointer late in the shot clock over Westbrook with 13.7 seconds left in the half gave the Rockets a 55-47 edge at the break. Houston led 83-77 at the end of the third.\nThe Thunder knew how important the game was, so they dug in after they trailed by 11 with 7:08 remaining to make it tight down the stretch.\n\"It just says that we at least have some fight in us,\" Westbrook said. \"Unfortunately it wasn't enough.\"\nHouston shot 55 percent in the final period to hold on.\n\"The biggest thing is we stay calm,\" Houston center Dwight Howard said. \"We don't allow a team making a run to affect us mentally. We stay together. We come into the huddle and we talk to each other, then we go out there and execute.\"\nTIP-INS\nRockets: Howard scored 22 points in 23 minutes. ... F Donatas Motiejunas missed his sixth straight game with lower back pain. ... Houston made 12 of 19 shots in the second quarter.\nThunder: Oklahoma City was without F Nick Collison (left ankle sprain), G Andre Roberson (left ankle sprain) and F Serge Ibaka (right knee surgery). None are expected back soon. ... The Thunder wore their alternate uniforms with sleeves. ... G Dion Waiters drew a technical foul with 9:21 left in the third quarter. ... C Steven Adams fouled out with 6:04 remaining. ... Morrow scored 22 points and made 6 of 8 3-pointers.\nSTAT LINES\nHarden maintained his minuscule lead over Westbrook in the race for the scoring title. The Rockets star has scored 2,104 points in 76 games for an average of 27.684 points per game. Westbrook has scored 1,715 points in 62 games for an average of 27.661.\nQUOTE OF THE DAY\nMcHale, on the Rockets giving up offensive rebounds and making just 31 of 50 free throws: \"When you miss 19 free throws and give up 17 offensive rebounds, you've got to -- we just found a way. The guys just ground it out.\"\nUP NEXT\nRockets: At San Antonio on Wednesday.\nThunder: Host San Antonio on Tuesday.",
  "tags_rule": [
    "CoachComment",
    "TripleDouble",
    "PhysicalGame",
    "FoulTrouble"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.693570",
  "pipeline_version": "v1"
}