{
  "game_id": "0021700157",
  "espn_id": "400974908",
  "date": "Nov 07, 2017",
  "matchup": "MEM @ POR",
  "headline": "Evans, Conley help Grizzlies hold off Trail Blazers 98-97",
  "cleaned_body": "PORTLAND, Ore. --  Mike Conley was as relieved as the rest of the Memphis Grizzlies when CJ McCollum missed a pull-up jumper with 3.7 seconds left.\n\n\"He had a great look,\" Conley said. \"So we're thankful to get away with a win.\"\n\nTyreke Evans scored 21 points off the bench, Conley had 20 -- all in the second half -- and Memphis held off the Portland Trail Blazers 98-97 on Tuesday night.\n\nMarc Gasol added 16 points as the Grizzlies improved to 2-1 on their five-game road trip.\n\nMemphis wrestled with the Blazers for the lead in the final quarter after neither team was able to put together a double-digit advantage through the first three.\n\nDillon Brooks stripped Portland's Ed Davis and got a layup with a free throw that gave the Grizzlies a 96-91 lead with 39 seconds left. But the Blazers weren't out of it. McCollum hit a 3-pointer with 13.4 seconds remaining to pull Portland within one.\n\nAfter a video review, officials reversed an out-of-bounds call with 12.1 seconds left, giving the ball to the Blazers. McCollum missed a jumper from about 17 feet out and got his own rebound but couldn't get another shot off in time. He finished with a season-high 36 points.\n\n\"I got a good look on a shot I make very often. I've got to finish it, but I didn't,\" McCollum said.\n\nDamian Lillard, who had 12 points for Portland, said it shouldn't have come down to that shot.\n\n\"He got a good look, it didn't fall. It's a lot of things that impact the outcome of a game,\" Lillard said. \"The last play is always what people talk about, but it's a lot that puts you in that position.\"\n\nBrooks, starting for the Grizzlies as a rookie, went to college at Oregon and was treated to hearty applause during pregame introductions. Ducks coach Dana Altman had courtside seats for the game.\n\nBrooks was a second-round pick by Houston and was sent to Memphis in a draft-night trade. He was last season's Pac-12 player of the year and helped take the Ducks to the team's first Final Four appearance since 1939. He averaged 16.1 points, 3.2 rebounds and 2.7 assists per game during his final season.\n\nWith Ben McLemore (foot) and Wayne Seldon (quadriceps) out injured, Brooks made his third start of the season and finished with seven points and eight rebounds.\n\n\"He looks like he's been playing in the league for a while,\" Conley said. \"Each game he gets more respect.\"\n\nBrooks, who guarded McCollum for much of the night, was also relieved after that final shot.\n\n\"He likes going left and he got me on a little push off,\" Brooks said. \"I contested it pretty good I was just hoping that he missed.\"\n\nThe Grizzlies jumped out to a 21-14 lead, but Portland closed the gap early in the second quarter and Evan Turner's pull-up jumper tied it at 29. Lillard missed his first seven shots from the field, finally ending the drought on a layup with 3:12 left in the first half.\n\nMcCollum nearly lost the ball on a drive to the basket but regained control to make a falling-down jumper at the buzzer and give the Blazers a 50-47 lead at halftime. McCollum led all scorers with 15 points at the break, then opened the second half with a 3.\n\nBut the Grizzlies went on a 10-0 run to take a 61-57 lead. Portland tied it 71-all at the end of the third quarter, but Conley hit a 3 for Memphis as time ran out in the period.\n\nTIP-INS\n\nGrizzlies: Conley was 0 for 5 from the field in the first half. ... McLemore was assigned to the G-League Memphis Hustle in preparation for his return. ... Evans has scored 20-plus points in four straight games.\n\nTrail Blazers: McCollum's career high for points is 43 set last season. He made four 3-pointers Tuesday and the final one was the 500th of his career.\n\nONE THAT GOT AWAY\n\nLillard thought the Blazers let this one get away. \"They played a slow game, limited the possessions of the game and we had our opportunities,\" he said. \"We had some turnovers and some possessions on defense where we allowed them to take advantage of us. They just made more plays than we did in that fourth quarter. We had some fouls. Let that one slip. We had our chances.\"\n\nUP NEXT\n\nMemphis' road trip continues in Houston on Thursday.\n\nPortland hosts Brooklyn on Friday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "EarlyRun",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.166994",
  "pipeline_version": "v1"
}