{
  "game_id": "0021300247",
  "espn_id": "400489120",
  "date": "Nov 30, 2013",
  "matchup": "MIL vs. BOS",
  "headline": "Bucks snap 11-game skid with second win over Celtics",
  "cleaned_body": "MILWAUKEE -- The injury-depleted Milwaukee Bucks have been a doormat for just about everyone in the first month of the season.\nThe Boston Celtics are about the lone exception.\nO.J. Mayo rebounded from a subpar game with 22 points and the Bucks snapped an 11-game losing streak with a 92-85 victory over Boston on Saturday night.\n\n\"It feels good to get that monkey off your back,\" Milwaukee coach Larry Drew said. \"It really does. Especially kind of the way we did it, short-handed as we were, playing some guys out of position. It's kind of been our story pretty much all season long.\"\nTwo of Milwaukee's three victories this season have come against Boston. The Bucks beat the Celtics, 105-98, on Nov. 1 in Boston.\nJared Sullinger scored 21 points and had 14 rebounds, while Jeff Green and Jordan Crawford added 18 points apiece for the Celtics.\nThe Bucks went to a zone defense, and Boston missed 40 of its final 62 shots.\n\"We just were kind of waiting to see if they made shots, and they didn't fall for them, so we stuck with it,\" Drew said.\nBoston coach Brad Stevens said his team's struggles simply were due to missing shots.\n\"We moved the ball against the zone and attacked where we wanted to,\" he said. \"We just didn't make as many as we wanted to.\"\nThe Celtics missed 15 of 19 3-point attempts.\n\"We definitely had a good amount of looks, but we just weren't able to knock them down,\" Boston's Avery Bradley said. \"Probably every 3 we took was wide open. We just weren't able to convert.\"\nDespite having the worst record in the Eastern Conference at 3-13, Milwaukee is only three games behind Detroit (6-10), which currently is in the eighth spot in the mediocre Eastern Conference.\n\"To get a fire, all it takes is a spark, so now's the time to keep it going,\" said Ekpe Udoh, who had seven of his nine points in the fourth quarter.\nMilwaukee's Brandon Knight had his second consecutive solid game, scoring 20 points with nine rebounds and eight assists after scoring 17 points against Charlotte.\n\"I came close (to a triple-double) but more importantly we got a win to snap our streak,\" Knight said.\nBoston missed its first nine shots of the fourth quarter, allowing Milwaukee to go on a 10-0 run and take an 80-63 lead on Gary Neal's short jumper with 7:24 to go.\nThe Celtics then went on an 18-5 run, pulling within 88-81 on Green's 3-pointer with 1:20 to go. After each team failed to score on their next possessions, Knight made a layup to make it 90-81 with 55 seconds to go.\nMayo scored only five points on 2-of-11 shooting in the Bucks' 92-76 loss Friday night at Charlotte, but shot 9 of 14 Saturday to give Milwaukee its first win since beating Cleveland 109-104 on Nov. 6.\nKnight said he and Mayo would make a good duo as the season progressed.\n\"I was out and he has his little nicks and bruises,\" Knight said. \"As we play more and more, and as I get my feet wet and get more adjusted to playing with him, and him with me, I think we're going to be a tough backcourt.\"\nJohn Henson had a season-high 13 points and 13 rebounds for Milwaukee.\nMayo had eight points in the third quarter and the Bucks led 70-63 heading to the fourth.\nKnight made all five of his shots, including two 3-pointers, to score 12 points in the second quarter, helping Milwaukee to a 47-41 halftime lead. The Bucks took the lead for good at 44-41 on Knight's 3-pointer with 1:42 left in the half.\nGame notes\nCaron Butler (knee) and Ersan Ilyasova (hamstring, thumb) missed the game for Milwaukee. Butler is expected to miss about a week. ... Rajon Rondo (knee rehab), Kelly Olynyk (sprained right ankle) and Courtney Lee (sore knee) didn't make the trip to Milwaukee. ... Sullinger was called for a flagrant 1 foul when he fouled a driving Khris Middleton with 6:03 left in the third quarter. ... The 11-game losing streak was tied for the second longest in team history. The longest was 15 games in March 1996. ... The teams play against Tuesday in Boston.",
  "tags_rule": [
    "TripleDouble",
    "Streak",
    "CoachComment",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.271266",
  "pipeline_version": "v1"
}