{
  "game_id": "0022100195",
  "espn_id": "401360019",
  "date": "Nov 14, 2021",
  "matchup": "PHX @ HOU",
  "headline": "Suns win 8th straight, hand Rockets 11th loss in a row",
  "cleaned_body": "HOUSTON -- — Devin Booker had 26 points and six assists and the Phoenix Suns won their eighth straight game and handed Houston its 11th loss in a row, routing the Rockets 115-89 on Sunday night.\n\nBooker had 16 points in the first quarter, and finished 9 of 23 from the field.\n\n“It’s been a point of emphasis for us to close out games,” Booker said. “When we have leads on teams, just open it up, stay solid, don’t get out of character and do things that we don’t do. Like Coach (Monty Williams) says ‘Don’t play with the game.’ That’s a product of tonight.”\n\nJaVale McGee added 19 points and 14 rebounds. He was 9 of 12 from the field.\n\n“I thought he was much better tonight, not just blocking shots but distracting shots,” Phoenix coach Monty Williams said of McGee. “For whatever reason, when he comes back in that second and third stint, he has a ton more energy. … His second and third stints tonight were huge, and I thought his defense at the rim was the best it’s been all year, especially for a team that attacks the basket like Houston does.”\n\nChris Paul had 15 points and seven steals, and Mikal Bridges had 14 points and six rebounds. Phoenix shot 43% and was 14 of 40 on 3-pointers.\n\n“For me, I don’t take them for granted,” Williams said of the winning streak. “I’m focused on just getting better and improving and seeing consistency. … I’m focused on our team getting better. I don’t want to take away from the wins and the success we’ve had early in the season, but I have a short-term view and a long-term view.”\n\nChristian Wood had 17 points and eight rebounds for Houston. The Rockets are an NBA-worst 1-12.\n\nJalen Green, Eric Gordon and Kevin Porter Jr. each added 12 points, and Alperen Sengun finished with 10 points and 10 rebounds.\n\nHouston shot 41% and made 7 of 32 on 3-pointers. The Rockets committed 23 turnovers that the Suns turned into 22 points.\n\n“It was disappointing that we had 16 (turnovers) in the first half, which is not good at all,” Houston coach Stephen Silas said. “We started the game again, (down) 17-5, or whatever it was. … That’s not at all a good way to start games and then we knew coming in that the turnovers were going to be the game, and they were again.”\n\nPhoenix led 51-44 and opened the second half on a 20-6 run to push its lead to 71-50. Booker scored 10 points, and Paul had six points in the run. Houston got no closer than 12 the rest of the way.\n\nTIP-INS\n\nSuns: C Deandre Ayton remained out, missing his fifth straight game with a lower right leg contusion. McGee started in his place. … Paul was assessed a technical foul with a minute left in the second quarter. … Cameron Payne scored 13 points, and Cam Johnson scored 10 points.\n\nRockets: Wood was issued a technical foul with 5 1/2 minutes left in the third after slamming the ball on the court. … The Rockets were 12 of 18 from the free throw line. … Houston held a 50-44 advantage in points in the paint.\n\nHE SAID IT\n\n“I thought he was going to have one of those crazy nights. He probably could have if he played more minutes. He certainly set the tone for us. He was hitting within the offense. He was hitting in his own skill package.” — Williams on Booker.\n\nUP NEXT\n\nSuns: At Minnesota on Monday night.\n\nRockets: At Memphis on Monday night.",
  "tags_rule": [
    "Streak",
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.702693",
  "pipeline_version": "v1"
}