{
  "game_id": "0021401029",
  "espn_id": "400579321",
  "date": "Mar 20, 2015",
  "matchup": "CHA @ SAC",
  "headline": "Rudy Gay scores 33 points as Kings beat Hornets 101-91",
  "cleaned_body": "SACRAMENTO, Calif. --  If the Charlotte Hornets fail to make the playoffs, two late-season losses to the lowly Sacramento Kings could haunt them all summer.\n\nRudy Gay had 33 points and nine rebounds, leading the Kings past Charlotte 101-91 on Friday night for their second victory over the struggling Hornets in 10 days.\n\nThe loss was a costly one for the Hornets. A victory would have moved Charlotte past Indiana and Boston into the final playoff spot in the Eastern Conference. The Celtics and Pacers both lost earlier in the evening and are tied for eighth place, a half-game ahead of Charlotte.\n\n\"We knew,\" Hornets guard Kemba Walker said. \"We can't put our heads down. We have to go out and just try to win the next one.\"\n\nTwo wins over Charlotte don't salvage the season for the Kings (23-45), but it did feel good to knock off a playoff contender.\n\n\"We talked this morning about how this was going to be an intense game,\" coach George Karl said. \"We beat them a couple of weeks ago, (but) they are still in the playoff hunt, and they are out on the road trying to find a win. We played hard and won a game with our defense.\"\n\nDespite committing 21 turnovers, the Kings were clearly the better team on this night and never trailed. Sacramento shot 63 percent in the first quarter, when it made five 3-pointers and led 29-22. The Kings shot 47 percent overall and outhustled the Hornets, evidenced by a 48-36 rebounding edge.\n\n\"If we're going to have a chance to win games, we can't get outhustled on the glass like we did tonight,\" Charlotte coach Steve Clifford said. \"They outworked us a little bit. We played with a real frustration level. That really hurt our play.\"\n\nWith the Hornets trailing by 11 at halftime, that frustration surfaced in the third quarter when Walker and Mo Williams drew technical fouls. After the Hornets cut the lead to three early in the period, the Kings built it back to an 11-point margin heading into the fourth.\n\nFor one night at least, the Kings and their fans had something to smile about.\n\n\"It's been a long season and we have to put more joy back into playing basketball,\" Gay said. \"A win is good and when we win the way we did by executing plays, knocking down 3s, and playing the way the coach wants us to makes it easier.\"\n\nGerald Henderson had 20 points and Walker scored 18 for the Hornets, who have dropped three straight and five of six after beginning March with five consecutive wins. Al Jefferson scored 17 points and Michael Kidd-Gilchrist had 13.\n\n\"We've lost our way a little bit lately,\" Henderson said. \"Our defense is not as consistent as it was, and the way we start games is not how we need to play. We haven't come out and played well early in games.\"\n\nDerrick Williams had two resounding dunks in the second half and scored 13 points for the Kings. Although he scored just four points, Reggie Evans had 16 rebounds in 20 minutes.\n\nThe Kings played without leading scorer and rebounder DeMarcus Cousins (right calf strain) for a second straight game. Sacramento is 3-13 when Cousins is not in the lineup.\n\nDespite a tendency to squander fourth-quarter leads, the Kings never lost the lead in the fourth this time and swept the season series. Derrick Williams had eight points in the fourth, when the lead was never less than six.\n\nThe Hornets entered as the only team that had lost to Sacramento in the last two weeks, a stretch that saw the Kings lose eight of nine.\n\n---\n\nTIP-INS\n\nHornets: Reserve guard Mo Williams missed all seven of his shots in the opening half and was scoreless. After missing his first 11 attempts, he made a 3-pointer at the 8:36 mark of the fourth and finished with nine points on 3-of-15 shooting. ... Charlotte is 13-20 on the road and concludes its five-game trip Monday in Chicago.\n\nKings: A poor-shooting team all season from 3-point range, the Kings tied a season high with eight 3s in the first half and finished 9 of 21. ... The Kings are 5-11 under Karl.\n\nUP NEXT\n\nHornets: Sunday in Minnesota.\n\nKings: Host Washington on Sunday.",
  "tags_rule": [
    "PhysicalGame",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.647898",
  "pipeline_version": "v1"
}