{
  "game_id": "0021400584",
  "espn_id": "400578876",
  "date": "Jan 15, 2015",
  "matchup": "OKC @ HOU",
  "headline": "James Harden's 31 help Rockets give Kevin McHale 200th coaching win",
  "cleaned_body": "HOUSTON -- James Harden loved how the Houston Rockets played in the first quarter Thursday night against the Oklahoma City Thunder.\nHe only wishes they'd play that way more often.\n\n\"That's the beauty of this thing,\" Harden said. \"We could be so good, but at times we have mental lapses where we let teams get comfortable.\"\nHarden scored 15 of his 31 points in the first quarter and the Rockets won 112-101.\nThe Rockets led 40-18 after one and didn't trail again to bounce back after a loss to Orlando on Wednesday night that snapped a four-game winning streak.\nHarden came just short of a triple-double with 10 assists and nine rebounds. Trevor Ariza added 17 points and four steals for Houston.\nThe Thunder scored the first three points of the fourth quarter to cut it to 10, but Houston used a 12-0 run to make it 100-78 and cruise to the victory -- the 200th of coach Kevin McHale's career.\nIt was the 17th 30-point game this season for Harden, who leads the NBA in scoring.\nKevin Durant had 24 points and 10 rebounds for the Thunder. They have lost three of their last four games.\n\nThunder coach Scott Brooks said his team can't play like it did in the first quarter and expect to win.\n\"We struggled getting back,\" Brooks said. \"We struggled covering the 3-point line. They were getting everything they wanted in the first quarter ... we can't give up a 40-point quarter.\"\nA 6-0 run by Oklahoma City got the team within 11 with about four minutes left, but Houston scored six quick points after that to make it 108-91.\n\"They are a very good team, KD and Russ (Westbrook) are capable of going on a run by themselves, and so we put emphasis on it to kind of slow them down and try to make other players make plays,\" Harden said.\nHarden made his fifth 3-pointer with about 4 minutes left in the third quarter before back-to-back 3s by Serge Ibaka got the Thunder to 82-71.\nJosh Smith got going after that, outscoring Oklahoma City 6-4 in the next 2 minutes.\nHouston was up 88-75 entering the fourth quarter.\nA 3-pointer by Patrick Beverley pushed Houston's lead to 47-26 with about 9 minutes left in the first half. The Thunder rolled for a bit after that, using a 10-3 spurt, punctuated with a dunk by Durant to cut it to 50-36. That run was helped by a pair of turnovers by Harden.\nWestbrook had turnovers on back to back plays with about 5 minutes left in the second quarter with the first one resulting in a one-handed dunk by Harden to leave the Rockets up 54-39.\nDurant had 15 points in the second quarter to cut Houston's lead to 64-53 at halftime.\n\nThe Rockets made three 3-pointers, with two from Harden, in the game's first 3 1/2 minutes to jump out to a 12-4 lead. Howard had three dunks in the next couple of minutes to power an 11-2 run that extended the lead to 23-6.\nThe Rockets were up by 15 later in the quarter scoring nine straight points, with the first six from Harden to make it 40-16.\nThey made 6 of 10 3-pointers in the period with three from Harden to score their most points in a quarter this season.\nTIP-INS\nThunder: The 40 points the Thunder allowed in the first quarter were the most they've allowed in a quarter since moving to Oklahoma City in 2008. ... Westbrook finished with 16 points, eight rebounds and eight assists.\nRockets: F Terrence Jones remains out with nerve inflammation in his left leg. He hasn't played since Nov. 3. ... It was \"Throwback Thursday\" with both teams wearing throwback uniforms, fans receiving \"Clutch City\" T-shirts and 1980s rapper Tone Loc performing his hits \"Wild Thing\" and \"Funky Cold Medina\" at halftime.\nHARDEN'S BIG MONTH: Harden was presented with a trophy for being named the Western Conference's player of the month for December before the game. It's the first time Harden has received the honor and the first time a Rocket has gotten it since Yao Ming in January of 2008. He earned it after averaging 30.6 points, 7.1 assists, 6.0 rebounds and 1.9 steals a game in a month where the Rockets went 9-5. He led the NBA with eight 30-point games, including three with 40 or more points, in that span.\nUP NEXT\nThunder: Host Golden State on Friday night.\nRockets: Host Golden State on Saturday night.",
  "tags_rule": [
    "TripleDouble",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.217225",
  "pipeline_version": "v1"
}