{
  "game_id": "0022100237",
  "espn_id": "401360061",
  "date": "Nov 19, 2021",
  "matchup": "PHX vs. DAL",
  "headline": "Suns rally in 4th, beat Mavs 112-104 for 11th straight win",
  "cleaned_body": "PHOENIX -- — Chris Paul has piled up plenty of points and assists during his 17 seasons in the NBA.\n\nHe hasn't been a part of too many 11-game winning streaks, though. After the Phoenix Suns polished off the Dallas Mavericks for a 112-104 victory on Friday night in front of a sellout crowd, he knew these three weeks were something special.\n\n“Guys don’t take this for granted,” Paul said. ”The locker room is great. Sometimes you can win games and it feels like you lost in the locker room. But the locker room's great and the spirit is right.\"\n\nMikal Bridges and Devin Booker each scored 19 points and Paul added 18 points and 14 assists. The winning streak is the Suns' longest since the 2006-07 season — and the latest victory followed a familiar pattern. Phoenix was just so-so for the first three quarters before playing its best basketball in the final 12 minutes.\n\n“We were able to sustain for just a little bit longer than them,” Suns coach Monty Williams said. “It allowed for us to have an outburst in that fourth quarter.”\n\nAfter the Mavericks took an 84-79 lead into the fourth quarter, the Suns used a 10-2 run to push ahead 89-86 with 8:55 left. Phoenix kept rolling from there: Landry Shamet hit Jae Crowder for a fast-break 3-pointer for a 94-86 advantage and Booker hit a corner 3 for a 103-90 lead with 4:12 left.\n\n“The whole fourth quarter was a lot of fun,” Booker said.\n\nPhoenix struggled at times with turnovers but made up for it with 14-for-29 shooting from 3-point range. Bridges was 7 of 7 from the field, going 3 of 3 on 3s.\n\nDallas has lost eight straight to the Suns. Kristaps Porzingis led the Mavs with 23 points and 12 rebounds. Jalen Brunson and Tim Hardaway Jr. each had 18 points.\n\nDallas coach Jason Kidd said his team simply didn't make enough shots to win against one of the NBA's best teams.\n\n\"If we are going to rely on shooting the 3 we've got to make them,\" Kidd said. “We had a lot of open looks that didn’t go down. We have to get better at that. For them, they had a lot of open looks that went down.\n\n\"You can’t beat good teams when you play like that.”\n\nThe teams played each other for the second time in three nights. The Suns won 105-98 on Wednesday night. Once again, the Mavericks put up a good fight without injured star guard Luka Doncic but were overpowered by the Suns in the fourth quarter.\n\n“Both ends we didn’t play our best basketball, starting with our offense,” Porzingis said.\n\nPhoenix took a 55-51 halftime lead. Bridges led all scorers with 17 points and made all six shots. Paul added 10 points and four assists. Porzingis led the Mavs with 12 points before the break.\n\nDONCIC UPDATE\n\nDoncic (left knee and ankle sprains) missed his second straight game but has practiced some with the team during the road trip — including during pregame warmups Friday. Kidd said he's hopeful that the star guard can play Sunday against the Los Angeles Clippers.\n\nTIP-INS\n\nMavericks: F/C Maxi Kleber (left oblique strain) missed a second straight game. Doncic is averaging 24.9 points, 8.3 rebounds and 7.9 assists. ... C Willie Cauley-Stein hit his sixth career 3-pointer during the third quarter, which got a big cheer from the Dallas bench. Cauley-Stein is now 6 of 32 beyond the arc in his seven-year career.\n\nSuns: F/C Frank Kaminsky (right knee soreness) missed his second straight game. ... JaVale McGee had 14 points off the bench on 7-of-10 shooting. Cam Johnson added 13 points and made three 3-pointers. ... F Ish Wainwright made his career debut, playing in the last minute of the fourth quarter.\n\nUP NEXT\n\nMavericks: At Los Angeles Clippers on Sunday.\n\nSuns: Host Denver on Sunday night.\n\n------",
  "tags_rule": [
    "Streak",
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.500609",
  "pipeline_version": "v1"
}