{
  "game_id": "0021700538",
  "espn_id": "400975284",
  "date": "Dec 31, 2017",
  "matchup": "MIN @ IND",
  "headline": "Butler scores 26, Timberwolves beat slumping Pacers 107-90",
  "cleaned_body": "INDIANAPOLIS --  The Minnesota Timberwolves never forgot about their loss to the Pacers early in the season. And it was all the motivation they needed to come out strong in Sunday's rematch.\n\n\"We watched film the last two days of their win earlier in the year and it definitely wakes you up,\" forward Jimmy Butler said. \"It was good to get back at them.\"\n\nButler had 26 points, six rebounds and five assists, and the Timberwolves never trailed this time around in a 107-90 victory.\n\nKarl-Anthony Towns had 18 points, 14 rebounds and six blocks, and Taj Gibson added 17 points and nine rebounds for the Timberwolves (23-14), who have won nine of their last 12.\n\nJoe Young scored a career-high 20 points off the bench and Bojan Bogdanovic scored all of his 13 points in the third quarter as the Pacers (19-18) dropped their fourth straight, equaling their worst skid of the season. Indiana also lost four in a row in early November.\n\nThis time, the Pacers have been without guard Victor Oladipo, who averages a team-leading 24.9 points per game. He missed a third straight game with an injured right knee.\n\nYoung is taking advantage of the chance to help fill the void.\n\n\"It's about being ready, and when your time comes, you have to be ready,\" he said. \"Like (teammate) Al Jefferson told me, you just have to be ready at all times. Your name could be called any second. I took that motivation and just stayed ready and my time has come.\"\n\nIt wasn't enough to help the Pacers put together a rally.\n\nAfter taking a 49-38 lead into halftime, the Timberwolves scored eight straight to open the second half. Gibson's 3-pointer at the end of an 11-2 run gave Minnesota a 73-53 lead with 4:40 left in the third quarter.\n\n\"Our starters got us off to a great start,\" Timberwolves coach Tom Thibodeau said. \"We're still striving to be a 48-minutes team. I thought what Jimmy did to get us going at the beginning (was big). I really liked the way he played.\"\n\nButler had 16 points by halftime and didn't play in the fourth quarter.\n\nROUGH START\n\nIndiana missed 12 shots, turned it over five times, fell behind 17-0 to start the game, and didn't score until Domantas Sabonis' hook shoot at the 5:15 mark in the first quarter. The Pacers scored just 13 points in the opening period -- their season low for points in a quarter -- and all 13 points came off the bench.\n\nOPPOSITE NIGHT\n\nWhen the teams first met early in the season, the Pacers shot a franchise-record 66.7 percent from the field. On Sunday, Indiana shot 38.8 percent, its worst since shooting 33.7 percent in a 114-96 loss to Oklahoma City on Oct. 25.\n\nTIP-INS:\n\nTimberwolves: Butler was 10-of-11 from the free-throw line. ... Minnesota turned it over just eight times. ... Towns' six blocks tied his career high. ... The team finished with a 58-36 advantage in points in the paint.\n\nPacers: Indiana's 90 points was its lowest scoring total at home this season. ... Indiana committed 17 turnovers. ... The 58 points off the bench was a season high.\n\nUP NEXT\n\nTimberwolves: Host the Los Angeles Lakers on Monday in the second game of a back-to-back.\n\nPacers: At Milwaukee on Wednesday.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "MomentumShift",
    "CoachComment",
    "CareerHigh",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.799318",
  "pipeline_version": "v1"
}