{
  "game_id": "0021401065",
  "espn_id": "400579357",
  "date": "Mar 25, 2015",
  "matchup": "CHI @ TOR",
  "headline": "Jimmy Butler scores 23 as Bulls beat Raptors for 5th straight time",
  "cleaned_body": "TORONTO -- The Chicago Bulls are feeling good about themselves as they head toward the playoffs.\n\nJimmy Butler scored 23 points, Pau Gasol had 18 and the Bulls beat Toronto 116-103 on Wednesday night for their fifth consecutive victory over the Raptors.\nMaking his second straight start after missing 11 games with a sprained left elbow, Butler was 7 for 8 from the field and 7 for 9 at the free-throw line. The All-Star guard also had five rebounds and three assists.\n\"The more he plays, that rhythm will come back,\" Chicago coach Tom Thibodeau said. \"He's put a lot of extra work in the last couple of days. Obviously we need him on both sides of the ball.\"\nTony Snell scored 17 points as the Bulls moved 1 1/2 games ahead of the Raptors for third in the Eastern Conference. Aaron Brooks had 16 points, and Nikola Mirotic finished with 15.\nButler said he's not concerned about Chicago's opponent in the first round of the postseason or playoff positioning for that matter.\n\"I think we can beat anybody,\" he said. \"I don't think it matters what seed we end up in. We just want to win as many games and get in a rhythm and get rolling heading into the playoffs.\"\nToronto backed into a playoff berth when Miami beat Boston and Charlotte lost to Brooklyn. That was of little consolation to coach Dwane Casey on the heels of the Raptors' second straight loss and third in four games.\n\"There are no moral victories in this league,\" Casey said.\nToronto's DeMar DeRozan was more optimistic.\n\"Our confidence is still high,\" he said. \"All we need is that one game to get ourselves going.\"\nToronto (42-30) needs one more win or another Boston loss to clinch its second straight Atlantic Division title.\nGreivis Vasquez had 22 points for the Raptors, while DeRozan scored 20. Vasquez also matched a career high with six 3-pointers.\nRaptors guard Kyle Lowry rested for the third time in four games with a sore back. Lowry returned to the lineup against Detroit on Tuesday after a two-game absence, but left early in the second quarter and didn't return.\nChicago (44-29) took its first lead since the opening quarter on a layup by Mirotic with 5:47 left, but DeRozan tied it with a pair of free throws.\nThe Bulls then went in front to stay with a 7-0 run. Gasol made a layup, Brooks drained a pull-up 3 and Butler hit two from the line as Chicago opened a 104-97 edge with 3:42 remaining.\n\"We knew it was time to win the game,\" Butler said.\nChicago outscored Toronto 39-21 in the fourth as the Raptors missed 12 of 18 shots. The Bulls have won four of five.\nROSE'S RETURN ON TRACK\nThibodeau said injured guard Derrick Rose remains on track to return in time for the playoffs. \"Everything is going according to plan,\" Thibodeau said of Rose's recovery. \"As long as it does and he doesn't have any setbacks, I don't see why not.\"\nHOME IMPROVEMENT\nAfter playing three times in six days, the Bulls now play only twice in the next seven days, hosting the Knicks on Saturday and visiting Milwaukee next Wednesday. With several players sore, Thibodeau said the down time is coming at a good time. \"It's a chance to sort of get your house in order, tighten up some screws,\" he said.\nTIP-INS\nBulls: C Joakim Noah returned after sitting out Monday's win over Charlotte with general soreness. He had nine points, five rebounds and five assists in 28 minutes. ... F Doug McDermott (back) was not available. ... Chicago has won four straight and eight of 10 in Toronto.\nRaptors: Toronto had only three turnovers through the first three quarters but made four in the fourth. ... Chicago is one of two Eastern Conference opponents the Raptors have not beaten this season. Charlotte is the other. Toronto faces the Hornets twice more before the end of the season. ... The Raptors haven't beaten Chicago since Dec. 31, 2013.\nUP NEXT\nBulls: Host Knicks on Saturday night.\nRaptors: Host Lakers on Friday night.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "CareerHigh",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.531106",
  "pipeline_version": "v1"
}