{
  "game_id": "0021700637",
  "espn_id": "400975383",
  "date": "Jan 14, 2018",
  "matchup": "MIN vs. POR",
  "headline": "Butler scores 24 points, Timberwolves beat Blazers 120-103",
  "cleaned_body": "MINNEAPOLIS --  As Jamal Crawford talked about how the Minnesota Timberwolves must continue improving, next-locker neighbor Jimmy Butler couldn't help himself.\n\n\"Blah, blah, blah,\" Butler playfully jabbed while Crawford spoke with reporters after the Timberwolves' 120-103 victory over Portland on Sunday night.\n\nThe Wolves know they need to keep their second 5-0 homestand in franchise history in perspective.\n\nButler scored 24 points, Jeff Teague added 22 and Karl-Anthony Towns had 20 points and 11 rebounds for his NBA-leading 37th double-double of the season. The Wolves had their first 5-0 homestand since 2001, winning each game by double figures against the likes of New Orleans, Cleveland, Oklahoma City and New York.\n\nBut coach Tom Thibodeau cautioned against reading too much into the wins, which haven't come easy or often in Minnesota for the last 14 seasons.\n\n\"It's important to win everywhere, and `are we building the right habits?\" Thibodeau said. \"You want to make sure that you're thinking about that improvement each and every day so that you can be playing your best at the end.\"\n\nCrawford echoed those thoughts.\n\n\"We know we've come a long ways, but we have some more levels we can go to,\" he said. \"It's good to keep building good habits.\"\n\nThey led by as many as 26 against Portland to send the Trail Blazers to their third loss in a row.\n\nDamian Lillard scored 21 points, and C.J. McCollum and Pat Connaughton each had 18 for Portland. The Blazers had scored 110 points or more in seven straight game.\n\nThat streak was in jeopardy early thanks to the Blazers' paltry 10-point second quarter and 18 total turnovers.\n\n\"Our offense really hit the skids,\" Blazers coach Terry Stotts said. \"We didn't shoot it well, we didn't pass it well, we turned the ball over. Minnesota took advantage of it, so it was a big hole.\"\n\nPortland led by five early and ended the first quarter up 33-31. But the Blazers went cold in the second, shooting only 2 for 15 and scoring more points off six free throws in the quarter. The Wolves, meanwhile, put together a 14-0 run and steadily pulled away.\n\n\"We've got to put our hats on defense,\" Crawford said. \"Offense will come and go, but defense is what can takes us there.\"\n\nHOME COOKIN'\n\nFour of Minnesota's wins during the homestand came against teams currently in position to make the playoffs: New Orleans, Cleveland, Oklahoma City, and Portland. The win also extended the Wolves' home winning streak to eight games, which is the team's longest single-season home winning streak since winning 14 in a row from Dec. 16, 2003, to Feb. 6, 2004.\n\nLILLARD LOSES THE HANDLE\n\nLillard may have led Portland's scoring, but he also had a team-high six turnovers. \"Against a team that good, you can't take away possessions from your team. You need every opportunity,\" he said.\n\nTIP-INS\n\nTrail Blazers: Portland's 10 points in the second quarter wasn't the Blazers' lowest output of the season -- they scored only six against Toronto on Oct. 30. It was, however, the fewest points allows by Minnesota in any quarter at Target Center since Philadelphia scored nine in the second on Dec. 3, 2014. ... The Blazers reserves outscored Minnesota's 42-25. ... Lillard has his fourth 20-plus point performance of his last six. He also contributed eight assists and six rebounds.\n\nTimberwolves: It's the third time in franchise history the Wolves have won five games on a homestand. ... Crawford had 10 points off the bench. ... There were plenty of purple Vikings jerseys in the crowd, which broke out into its loudest cheers of the first half when the final score of Minnesota's last-second playoff victory was flashed on the scoreboard. The crowd also broke out into a few impromptu \"Skol!\" chants.\n\nQUOTE OF THE NIGHT\n\n\"Probably a late arriving crowd, but for a good reason,\" Thibodeau said with the laugh, referring to the Vikings fans who were still filing into Target Center as the game started.\n\nUP NEXT:\n\nTrail Blazers: Host Phoenix on Tuesday night.\n\nTimberwolves: At Orlando on Tuesday night.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.312129",
  "pipeline_version": "v1"
}