{
  "game_id": "0021700670",
  "espn_id": "400975416",
  "date": "Jan 19, 2018",
  "matchup": "MEM vs. SAC",
  "headline": "Brooks, McLemore lead Grizzlies past Kings 106-88",
  "cleaned_body": "MEMPHIS, Tenn. --  The Memphis Grizzlies celebrated Zach Randolph's return and then sent him and his new team away with their seventh straight loss.\n\nDillon Brooks scored a career-best 22 points, Ben McLemore had a season-high 21 and the Grizzlies beat the skidding Sacramento Kings 106-88 on Friday night for their third straight victory.\n\nThe game was a backdrop to Randolph's first return to Memphis since spending eight years as a key figure in the Grizzlies' success. The power forward received a standing ovation when he was introduced with the starting lineups, and the Grizzlies showed a tribute video between the first and second quarters.\n\n\"It's emotional, man. It's a great feeling,\" said Randolph, who finished with four points and six rebounds. \"It's home for me. I love the people, and I love this city.\"\n\nWhile Randolph was saluted, there wasn't much to celebrate for the Kings outside of holding the Grizzlies to a 10-point second quarter -- the lowest-scoring period of the season for a Sacramento opponent. Otherwise, the Kings were limited to 40 percent shooting and were outrebounded 49-44 while committing 21 turnovers.\n\n\"We just had some bad turnovers, unforced turnovers,\" said rookie guard De'Aaron Fox, who had 16 points and six assists to lead the Kings.\n\nHe said for most of the night, the Grizzlies \"got to their spots, got what they wanted.\"\n\nIt's all part of the growing pains for the Kings as coach Dave Joerger plays youngsters like Fox and fellow rookies Justin Jackson and Bogdan Bogdanovic. Joerger announced earlier this week that he would start sitting veterans on a rotating basis to give more time to the younger players.\n\nBogdanovic and veteran Vince Carter had 15 points apiece against the Grizzlies.\n\n\"You can see the progress,\" said Joerger, the former Memphis coach. \"There's positive things that are happening, but there's going to be some inconsistency.\"\n\nTyreke Evans added 14 points and six assists for Memphis, while Andrew Harrison finished with 12. McLemore, who had not gotten off the bench in eight of the previous 11 games, was 6 of 13 from the field against Sacramento, where he played four seasons before signing with the Grizzlies in the offseason.\n\nThe teams were tied 40-all at halftime. But the Grizzlies opened the third quarter with a 22-7 run and the Kings never really threatened the rest of the way.\n\nAfterward, Randolph was hugging former teammates, fans, ball boys and arena workers. After dressing, he walked the court signing autographs and posing for pictures.\n\n\"It was great,\" said Grizzlies center Marc Gasol, who played alongside Randolph on the Memphis front line. \"It was beautiful. All the fans did a great job of showing Z-Bo how much he meant to the city and the franchise.\n\n\"Z-bo got the big night, and we got a great win.\"\n\nTIP-INS\n\nKings: Sacramento has lost 14 of its last 15 games in Memphis. ... Carter hit five 3-pointers, making him the oldest player in NBA history (40 years, 358 days) to make that many in a game. . Willie Cauley-Stein was limited to seven points, but had 11 rebounds.\n\nGrizzlies: Put together their first three-game winning streak since the opening three games of the season. ... McLemore's previous season high was 17 points against Oklahoma City on Dec. 9. ... Brooks has reached double figures in three straight games. ... Memphis has won four straight home games, tying its longest streak of the season.\n\nNO INTROS NECESSARY\n\nRandolph wasn't the only one back who had recent ties to Memphis. Carter also played for the Grizzlies last season before signing with the Kings, and Joerger was the Grizzlies' coach until the end of the 2015-16 season. In addition, F Skal Labissiere played high school ball in Memphis. \"It runs pretty deep,\" Joerger said before the game. \"It's very special. I've got butterflies. I'm sure (Randolph) does. He's excited.\"\n\nUP NEXT\n\nKings: Make their second stop on a six-game road trip Monday night at Charlotte.\n\nGrizzlies: At the New Orleans Pelicans on Saturday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.946881",
  "pipeline_version": "v1"
}