{
  "game_id": "0021301035",
  "espn_id": "400489908",
  "date": "Mar 22, 2014",
  "matchup": "MEM vs. IND",
  "headline": "Grizzlies continue run by holding Pacers to season low in points",
  "cleaned_body": "MEMPHIS, Tenn. -- The Memphis Grizzlies ratcheted up their defense to avoid a back-to-back sweep by the two best teams in the Eastern Conference.\nAnd, in the meantime, Memphis kept its spot in the Western Conference playoff race.\nMike Conley scored 21 points, Zach Randolph added 18 points and 13 rebounds, and the Grizzlies held the Indiana Pacers to their lowest output of the season in an 82-71 victory on Saturday night.\nSeveral Grizzlies players said it may have been their most complete game of the season. The victory came after Memphis lost 91-86 at Miami on Friday night.\n\"It started from the defensive intensity, and it was consistent,\" Conley said. \"On offense, we moved the ball well. We were efficient with it, but defensively, we really locked down and communicated.\"\nMike Miller added 13 points as Memphis moved a game ahead of Phoenix for the final playoff spot in the Western Conference. Marc Gasol, returning after spraining his ankle Friday night, had 10 points and nine rebounds.\nLance Stephenson led the Pacers with 15 points and eight rebounds, while David West added 10 points, but was 5 of 15 from the field.\nPaul George, the Pacers' leading scorer at 22.1 points per game, was held to eight points, missing eight of his 10 shots, and Indiana shot 37 percent for the game.\n\"We couldn't score at all,\" said Pacers center Roy Hibbert, who was in foul trouble and ended the night with four points and no rebounds. \"That's the basic thing. I think we had a lot of contested 2s. Guys were trying, and they were playing hard, but for some reason, something was a little off.\"\nIndiana, which allows a league-low 35.4 points per game in the paint, surrendered 46 to Memphis, which also outrebounded Indiana 47-35.\nThe Pacers' only lead in the game came at 3-2.\nGasol, who was treated for a Grade 1 left ankle sprain sustained in Friday's loss to the Heat, was a game-time decision. He was on medication and didn't warm up before the game.\n\"I wanted to save every step I was going to take for the game,\" said Gasol, adding that the medication made it where he could barely feel his hands or face. \"It definitely helped the purpose, and made it worth it because we won the game.\"\nMemphis, which built a double-digit lead in the first half, maintained the advantage through the third period as the Pacers seemed to be dragging. Through three periods, Indiana was still under 37 percent, and George had been limited to only seven shots and six points.\n\"It's the offensive end where we didn't play well,\" George said. \"We didn't get into a rhythm. ... If you hold a team to 82 points, you are playing pretty good defense.\"\nMemphis continued to maintain the double-digit lead, keeping the Pacers down 10 to 14 points through most of the fourth.\n\"We were a little bit too indecisive and hesitant with the basketball,\" Indiana coach Frank Vogel said. \"We had poor shooting nights from a number of guys.\"\nAs was expected with two of the best defensive teams in the league, the first half was a low scoring affair despite Memphis shooting 46 percent. The Pacers were at 32 percent.\nThat helped Memphis carry a 43-30 lead into the break as Miller connected on four of his first five shots in the second period, all of them from outside the arc, for all of his 13 points in the game.\n\"If you take away Mike Miller's 3s in the first half, this is a college score in terms of the game.\" West said.\nBut the Grizzlies said the performance was important after a Miami game they thought they could have won. They also mentioned that it was an important confidence-builder for the stretch run.\n\"We were in attack mode most of the night on both offense and defense,\" Memphis coach Dave Joerger said. \"That is as complete of a win as we have had all season.\"\nGame notes\nPacers C Andrew Bynum remained inactive for the fourth game with swelling and soreness in his right knee. ...The previous low for points in a game for Indiana was 73 against Dallas on Feb. 12. ... Indiana's three-game win streak against the Grizzlies was snapped. ... Memphis has won nine straight at home. ... The Pacers lost for only the second time this season when holding an opponent under 90 points. They were 26-1 entering the game.",
  "tags_rule": [
    "FoulTrouble",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.567125",
  "pipeline_version": "v1"
}