{
  "game_id": "0021700725",
  "espn_id": "400975471",
  "date": "Jan 27, 2018",
  "matchup": "ORL @ IND",
  "headline": "Pacers use late-game magic to rally past Orlando 114-112",
  "cleaned_body": "INDIANAPOLIS --  Victor Oladipo and Lance Stephenson delivered the perfect combination for the Indiana Pacers.\n\nAfter watching their fatigued and foul-prone teammates spend most of the first 3 1/2 quarters scrambling to stay close, the tag-team energizers took matters into their own hands Saturday night. They drove and dished, they made shots and they defended.\n\nIt was a knockout finish.\n\nOladipo scored 24 points, Stephenson added a season-high 21, each had five rebounds and six assists, and the Pacers overcame a late 10-point deficit to get past the struggling Orlando Magic 114-112.\n\n\"When that energy (is there), when the crowd is into it, the players are into it, the bench is into it -- it's unlike any other,\" Oladipo said. \"It's a great environment to be a part of. It might be a little tougher you know, playing as hard as we did yesterday and coming in (tonight) and trying to repeat. But it's a part of the NBA.\"\n\nThe Pacers powered through on grit.\n\nAfter trailing by as much as 21, Oladipo's 21-footer in the midst of a 15-0 run finally gave the Pacers their first lead at 107-106 with 3:30 to play. And they closed it out by finishing the game on an 18-6 run over the final 6:15.\n\nStill, it almost wasn't enough.\n\nAfter Domantas Sabonis missed 1 of 2 free throws with 20.5 seconds to go, Orlando got two chances to tie the score and one to win it.\n\nBut Aaron Gordon missed a 16-footer with 12.5 seconds left then missed two free throws with 7.9 seconds to go and Jonathan Simmons missed the go-ahead 3-pointer before Oladipo finally corralled the last rebound.\n\n\"We knew it was going to be a tough second half. We played lockdown defense and we fed off of (the energy),\" Stephenson said. \"I know we had a tough rebounding night, but we made up for it. We just kept playing.\"\n\nMagic coach Frank Vogel expected nothing less from his former team.\n\nEach time he sensed the Pacers were about to make a run, Vogel called timeout even after the Pacers cut a 106-96 deficit to 106-95 on Sabonis' layup with 5:32 to go.\n\nBut the last timeout didn't slow down Oladipo, Stephenson or the Pacers, who scored the next six points to take a 111-106 lead.\n\nGordon had 22 points, 11 rebounds and four assists and Evan Fournier wound up with 19 points for the Magic, who have lost seven straight in the series and 19 of their last 22.\n\n\"We knew we'd have to win the second half different than we won the first half, our intensity would have to be greater,\" Vogel said. \"That's what it looked like, and we weren't able to hang on.\"\n\nTIP-INS\n\nMagic: Elfrid Payton had 12 points and five assists on a night Orlando shot 54.5 percent from the field and scored 70 points in the first half. ... Only 10 opponents have failed to score at least 100 points against the Magic this season. ... Orlando has lost 18 of its last 20 to Indiana, dating to March 2013, and hasn't won in Indianapolis since 2014.\n\nPacers: Thaddeus Young scored 20 points and Sabonis finished with 18 points and nine rebounds. ... After shooting 33.3 percent in the first quarter, Indiana shot 63.4 percent from the field in the second half. ... Indiana has given up 143 points in the first half of its last two games. ... The Pacers have won 10 of their last 11 home games against Orlando.\n\nHE'S BACK\n\nPacers center Myles Turner returned to action Saturday after missing the previous nine games with an injured right elbow.\n\nBut he didn't start.\n\n\"We're going to be patient with his return and work him back into the rotation,\" coach Nate McMillan said before the game. \"And Domantas has been doing a pretty good with the starting unit.\"\n\nIn less than 11 minutes, Turner had four points three rebounds and no blocks.\n\nFIGHTING THROUGH\n\nVogel wasn't sure how long he'd last on the sideline.\n\nDuring pre-game availability, Vogel acknowledged he's tried myriad treatments to fight off a cold and his voice was still pretty weak.\n\n\"I'm going to try to coach but I've been coughing an awful lot so we'll see how that goes,\" Vogel said.\n\nHe did make it through but is now 0-3 at Indiana and 0-7 against his former team.\n\nUP NEXT\n\nMagic: Will try to salvage a split in the season series Tuesday at Houston.\n\nPacers: Host Charlotte on Monday in the first of four meetings between the teams this season.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.268458",
  "pipeline_version": "v1"
}