{
  "game_id": "0021400279",
  "espn_id": "400578571",
  "date": "Dec 05, 2014",
  "matchup": "LAL @ BOS",
  "headline": "Zeller leads Celtics to 113-96 win over Lakers",
  "cleaned_body": "BOSTON -- Tyler Zeller scored a career-high 24 points and he can thank Rajon Rondo for most of them.\nThe point guard assisted on seven of Zeller's 10 baskets as Boston's new starting center led the Celtics to a 113-96 win over the Los Angeles Lakers on Friday night.\n\"The more I play with him, the easier it gets,\" Zeller said. \"Everybody knows he's a phenomenal passer. He's going to find the right guy, the open guy. Tonight, it was me.\"\nZeller came off the bench in the first 13 games this season after being traded by Cleveland in July. He's started the last four.\n\"Rondo was just so much more aggressive,\" Celtics coach Brad Stevens said. \"Any time that he's probing like that, Tyler's going to roll to the rim and be available.\"\nRondo finished with 12 points, 16 assists and eight rebounds. Zeller had a season-high 14 rebounds and the Celtics went ahead for good less than two minutes into the game to record their second straight win after five consecutive losses.\n\"Just didn't show a lot of energy to start the game,\" Lakers coach Byron Scott said of his team. \"They moved the ball a lot better than we did.\"\nKobe Bryant scored 22 points but made only 9 of 21 shots as the Lakers lost their second straight game after winning two in a row.\n\"It's an up and down thing for us in terms of how we play,\" Bryant said. \"Frustration is good. You have to be able to use your frustration in the right way and channel it to have good performances.\"\nThe Lakers had cut a 92-78 deficit to 92-83 with 7:49 remaining on a three-point play by Nick Young. Then a long jumper by Avery Bradley began a 13-point Celtics run that put them ahead 105-83 with 3:54 left. They led by at least 17 the rest of the way.\nJordan Hill gave Los Angeles a 3-0 lead with a three-point play. But a jumper by Bradley followed by a layup by Jeff Green with 10:45 to go gave Boston a lead it never lost\nThe rivalry between the now-struggling franchises reached its height in the mid-80s when the teams led by Magic Johnson of Los Angeles and Larry Bird of Boston met for the NBA title three times with the Lakers winning twice. In their most recent championship series, the Lakers won in seven games in 2009-10.\n\"It is unique to think (that) you're driving downtown to play the Lakers,\" Stevens said before the game. \"It's a unique, unique rivalry and it's neat to be a part of.\"\nLeading 53-48 at halftime, the Celtics began the third quarter with a 10-3 run with Green scoring eight. That made it 63-51, but the Lakers cut the lead to 67-60. Then the Celtics scored nine straight points, seven by Jared Sullinger, and led 76-60 with 4:16 left in the third quarter.\nThe Celtics had used a 10-0 run to take a 25-9 lead on Rondo's layup. The Lakers cut that to 30-20 entering the second.\nTHE STATS STORY\nThe Celtics outrebounded and outshot the Lakers by wide margins. Boston held a 68-44 advantage on the boards and made 51.1 percent of its shots while the Lakers connected on 41.3 percent.\nGUARDING KOBE\nStevens rotated several defenders on Bryant, the NBA's leading scorer. \"It was important for us to make sure that we had a fresh guy on him,\" said Green, who finished with 19 points.\nTIP-INS\nLakers: Bryant increased his career total to 32,194 points (plus today) and trails Michael Jordan, with 32,292, for third-place all-time. ... Assistant coach Paul Pressey is the father of Celtics backup guard Phil Pressey. \"I don't know about the young fella,\" Scott said before the game, \"but his Dad is old school. So once the ball goes up, they're no longer father and son until that game is over.\"\nCeltics: Second-year coach Stevens coached against Bryant for the first time Friday night. Bryant was sidelined for both meetings last season. \"Most every player has tendencies that you try and take away,\" Stevens said. \"He just scores in such a variety of ways.\"... Rondo did not attempt a free throw and is 9 for 30 this season.\nUP NEXT\nLakers: Host New Orleans on Sunday.\nCeltics: Host Washington on Sunday.",
  "tags_rule": [
    "CoachComment",
    "CareerHigh",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.484025",
  "pipeline_version": "v1"
}