{
  "game_id": "0022100717",
  "espn_id": "401360536",
  "date": "Jan 25, 2022",
  "matchup": "SAC @ BOS",
  "headline": "Tatum, Brown lead Celtics in 128-75 laugher over Kings",
  "cleaned_body": "BOSTON -- — Jayson Tatum scored 36 points and Jaylen Brown had 30 points and 10 rebounds before both rested the entire fourth quarter as the Boston Celtics routed the Sacramento Kings 128-75 on Tuesday night.\n\nRobert Williams finished with 13 points and 17 rebounds for the Celtics, who got off to a torrid start and never let up on the Kings, even when both teams went to reserves for the final period of a game that had been long decided. Boston stretched its lead to 60 points before it was over.\n\n“We were sharing the wealth. Everybody contributed. Everybody was hitting shots. We scored 128 points,” Tatum said. “It was just a great night overall for everybody.”\n\nBuddy Hield led the Kings with 11 points. He was the only Sacramento player to score in double figures as the Kings lost their fourth straight. Richaun Holmes had nine points and nine rebounds and Tyrese Haliburton added seven assists for Sacramento.\n\nThe Celtics went on an 11-0 run early in the first quarter, then added a 16-0 spurt later in the period while holding the Kings scoreless for a stretch of 5:05. Boston led 38-13 after one.\n\n“They switched on almost every play we had and we didn’t attack it. Really kind of made our offense stagnated,” Kings interim coach Alvin Gentry said. “We had very little ball movement, very low assists and they were able to force us into some tough shots because we were always on the shot clock.”\n\nBrown alone outscored Sacramento with 15 points in the first quarter and had a nice assist with a long bounce pass to set up Robert Williams for a dunk. Grant Williams hit a 3-pointer during the 16-0 run. He also grabbed his own rebound after a miss and put it back up for a layup that Maurice Harkless blocked, but the basket counted after a goaltending call, putting Boston up 33-7.\n\nA 3-pointer by Josh Richardson with 1.1 seconds left in the second quarter gave Boston a 63-30 halftime lead. It was the third straight game the Kings allowed 60 points in the first half.\n\n“We were getting stops and forcing them into tough shots,” Richardson said. “That gave us a lot of opportunities to get out and run and be able to use our athletic ability and take better shots.”\n\nBrown opened the third quarter with a 15-foot jumper, then hit back-to-back 3-pointers. He finished the game 11-for-19, making 5 of 12 3s.\n\nTatum, who scored 51 points Sunday in a 116-87 victory at Washington, was 14-for-23 and made 7 of 12 3s as he and Brown combined to score more than half of Boston's points.\n\n\"They are the two pillars and leaders of the team and when they come out and play with that intensity, everybody seems to follow suit,” Boston coach Ime Udoka said.\n\nNO PRESSURE\n\nEven with the starters out, Richardson said it was on the reserves to keep up the pace and continue pressuring the Kings, even though there was no chance of a comeback.\n\n“It was kind of hard for us to mess that game up off the bench. The starters got us off to such a good start both halves,\" Richardson said.\n\nUNHAPPY COACH\n\nThe Kings were coming off a competitive 133-127 loss at Milwaukee on Saturday, but their strong play didn't carry over.\n\n“I’m disappointed because I thought we competed and did a good job in Milwaukee and gave ourselves an opportunity to win. And it just didn’t work out. They made a couple of big shots,” Gentry said. “But we were never ever in this game, really. Right from the start of the game, we were never in it and that’s very disappointing to me.”\n\nTIP-INS\n\nKings: Leading scorer De’Aaron Fox missed his second straight game with a left ankle injury. ... The Kings made 1 of 12 3-pointers in the first quarter while shooting 17% (5-for-29) from the floor. It didn’t get much better in the second quarter as Sacramento finished the half 10-for-49 overall and 1-for-20 from beyond the arc.\n\nCeltics: Tied their season high for first-quarter scoring with 38 points. ... Tatum had 11 points in the first and Williams had seven rebounds. ... G Marcus Smart was scoreless in his second game back from COVID-19 protocols but did have seven assists. ... Aaron Nesmith added 10 points. ... The Celtics had lost their previous two meetings with Sacramento.\n\nUP NEXT\n\nKings: Finish a back-to-back with a visit to Atlanta on Wednesday night.\n\nCeltics: At Atlanta on Friday night.\n\n------",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.403363",
  "pipeline_version": "v1"
}