{
  "game_id": "0021400175",
  "espn_id": "400578467",
  "date": "Nov 21, 2014",
  "matchup": "MIL @ TOR",
  "headline": "Williams scores 22 as Raptors beat Bucks 124-82",
  "cleaned_body": "TORONTO --  With a visit to Cleveland to face LeBron James coming up on Saturday, Raptors coach Dwane Casey was worried his team might overlook the Milwaukee Bucks.\n\n\"If we don't come out to take care of business, they can embarrass you,\" Casey warned before the game. \"They'll spank you like you stole something.\"\n\nTurns out Casey had nothing to worry about. His team took care of the spanking, then added in some embarrassment, too.\n\nLou Williams scored a season-high 22 points, Jonas Valanciunas added 18 points and 12 rebounds, and the Raptors routed the Bucks 124-82 Friday night.\n\nToronto matched its largest margin of victory in franchise history, set in a 96-54 victory over Miami on March 19, 2008. On Saturday, the NBA announced an official scoring change, giving the Bucks' John Henson credit for a 2-point shot instead of a 3-pointer.\n\n\"I thought the mental focus was great,\" Casey said. \"Nobody in that locker room was even talking about tomorrow night. If we're going to be an elite team or grow to be an elite team in this league, we've got to make sure we care of business and take care of what's in front of us.\"\n\nMilwaukee had won three straight and five of six coming in, but got buried by the Raptors.\n\n\"They embarrassed us,\" Bucks forward Jared Dudley said. \"Early on we were a little sluggish. They came out and executed.\"\n\nKyle Lowry scored 20 points and Terrence Ross had 13 as the Raptors wrapped up a franchise-record seven-game homestand at 6-1 and became the first Eastern Conference team to reach 10 wins.\n\nWilliams connected on five of Toronto's season-high 15 3-pointers, including one each at the end of the first and second quarters. When Williams hit a pair of free throws in the final seconds of the third quarter, it gave Toronto a 101-56 lead. At the time, the 45-point margin represented the biggest lead in franchise history.\n\nThe mark didn't last long. Raptors rookie Bruno Caboclo checked in to begin the fourth, the first action of his career, and made an alley-oop slam followed by a 3 that put the Raptors up 109-59. Caboclo's second 3 at 6:01 of the fourth put Toronto up by 52 -- 116-64.\n\nThe Bucks' previous five defeats this season were by a combined 41 points.\n\nCaboclo said he had \"butterflies in my stomach\" but his performance showed no sign of nerves, finishing with eight points on 3-for-6 shooting.\n\n\"That's definitely a memory he'll have forever,\" Toronto's DeMar DeRozan said.\n\nJabari Parker scored 15 points and Ersan Ilyasova had 14 for a Bucks team playing its third game in four nights, and coming off a triple-overtime win at Brooklyn on Wednesday.\n\n\"We didn't do anything but travel yesterday, so I don't think that was an issue,\" Bucks coach Jason Kidd said.\n\nGiannis Antetokounmpo, who injured his right ankle in the win against the Nets, was not expected to play after testing the injury during pregame warmups. Minutes before tipoff, however, the Bucks said Antetokounmpo would be available. He came off the bench to replace Khris Middleton at 6:07 of the first and finished with seven points in 15 minutes.\n\nValanciunas had 12 points and five rebounds in the first, and Williams finished the quarter with a buzzer-beating 3 as Toronto led 37-27 after one.\n\nWilliams scored 11 more in the second quarter, including another buzzer-beating 3, as the Raptors led 71-45 at halftime. It was Toronto's highest scoring half of the season, eclipsing the 65 points they scored in the second half against Utah on Nov. 15.\n\nBELOVED BRUNO\n\nRaptors fans chanted `We want Bruno' as the score got out of hand, roared with approval when the Brazilian rookie entered the game, then cheered his name at every opportunity the rest of the way. Williams mimicked the chants in the locker room after the game and used his cellphone to snap a photo of the media horde waiting at Caboclo's stall. \"Bruno is like Justin Bieber,\" said Nogueira, referring to the Canadian pop star.\n\nTIP-INS\n\nBucks: Milwaukee's previous worst loss this season was a 101-85 defeat at Orlando on Nov. 14. ... Milwaukee's only lead came on a 3 by Brandon Knight in the second minute of the opening quarter.\n\nRaptors: Toronto missed its first four field goal attempts, then closed the first quarter by making 12 of its next 21 shots. ... Rookie C Lucas Nogueira made his NBA debut, picking up two fouls in his first 39 seconds. ... All 13 active players scored at least two points. ... F Tyler Hansbrough (right shoulder) was not available. ... F James Johnson (right ankle) missed his second straight game.\n\nUP NEXT\n\nBucks: Host Wizards on Saturday.\n\nRaptors: At Cavaliers on Saturday.",
  "tags_rule": [
    "InjuryReport",
    "ClutchShot",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.888969",
  "pipeline_version": "v1"
}