{
  "game_id": "0022100787",
  "espn_id": "401360606",
  "date": "Feb 04, 2022",
  "matchup": "CHA vs. CLE",
  "headline": "Love hits late FTs, Cavs edge Hornets 102-101 in wild finish",
  "cleaned_body": "CHARLOTTE, N.C. -- — The Cleveland Cavaliers nearly lost a game because of a 3-pointer that never went through the hoop — and officials said never should have counted.\n\nKevin Love made two free throws with 1.2 seconds left and finished with 25 points as the Cavaliers escaped with a 102-101 win over Charlotte Hornets on Friday night following a wild fourth quarter.\n\nJarrett Allen had a career-high 29 points and 22 rebounds one day after being snubbed for the All-Star game, and Love scored 22 of his points in the second half as the Cavaliers overcame a bizarre technical foul on bench player Ed Davis for interference. The technical resulted in Hornets guard Terry Rozier being awarded a 3-pointer that he never actually made — and officials later said never should not have counted.\n\nRozier finished with 24 points and Kelly Oubre Jr, added 21 for Hornets, who overcame a double-digit deficit in the fourth quarter, only to lose their third straight game.\n\nThings got strange when Davis, who was on the Cavaliers’ bench in his warmups and never played a minute, was whistled for interference when he swatted at Rozier’s arm from the sideline with 4:44 left in the game. Davis, and others, thought the play had ended and whistles had blown after Dean Wade stepped out of bounds.\n\nBut officials got together and awarded Rozier three points and charged Davis with a technical foul. Rozier made the free throw, completing a four-point swing for Charlotte and cutting Cleveland's lead to six.\n\nCrew chief Brian Forte said via a pool report after the game that officials made a mistake, and Rozier's shot should not have counted.\n\n“It was miscommunication amongst the crew about the sequence of the play,” Forte said. “Upon review after the game, the out of bounds was called prior to the start of the field goal attempt and the shot should not have counted.”\n\nLove agreed.\n\n“We thought the whistle was blown and (the officials) were tapping their head because they thought Dean Wade had stepped out of bounds,” Love said. “That's when E.D. stuck his hand in there.”\n\nThe Hornets capitalized on the momentum and took a 101-98 lead when P.J. Washington hit back-to-back 3-pointers and Oubre added a corner 3 with 47 seconds left.\n\nAllen cut the lead to one before Rozier missed a 3-pointer, setting up a frantic and controversial final few seconds.\n\nCleveland's Brandon Goodwin missed a short jumper with 2.1 seconds left, but Love grabbed the offensive rebound and appeared to miss the follow-up. But officials reviewed the play and called Rozier for a foul.\n\nLove converted the tying and the go-ahead free throws as the home crowd roared its disapproval.\n\n“He’s Kevin Love. There was no doubt in our mind that when he was going to the free-throw line, he was going to make them both,\" Cavaliers coach B.J. Bickerstaff said. \"There’s no situation that he hasn’t seen. There’s no pressure-filled moment that he hasn’t been in.”\n\nThe Hornets tried an inbound alley-oop with 1.2 seconds left, but Gordon Hayward's lob to Miles Bridges hit the front of the rim and bounced away.\n\n“Our guys kept battling and gave ourselves a chance to win the game,” Hornets coach James Borrego said. \"We kept battling. A lot of emotions out there in a tight game and I thought our guys battled until the last whistle there.\n\nSUPPORT FOR ALLEN\n\nLove said he was “gutted” when he learned Allen did not make the All-Star team despite averaging 16.7 points and 10.7 rebounds coming into the game.\n\n“That is a guy I want to compete with every single night,” Love said. “He’s an All-Star. There is no doubt in my mind.”\n\nThere is still a chance Allen could make the team due to an injury to Kevin Durant.\n\n“At first, I was disappointed, but then you have to look at the league and see that is a well-oiled machine that keeps going,\" Allen said. \"So, do I sulk that I didn’t make the game or do I keep working harder and playing my kind of basketball?”\n\nBIG SECOND HALF\n\nLove had only three points at halftime before going on a tear. He made 6 of 12 shots from the field after the break, including 5 of 9 from beyond the arc.\n\n“At halftime J.B. got on me and said, ’Why do you keep pump-faking?' He said, ’no more pump-faking,'” Love said. “... JB wants me to shoot the ball — and shoot it with confidence.”\n\nTIP INS\n\nCavaliers: Made 14 of 40 3-pointers. ... All-Star Darius Garland missed his third straight game with lower back soreness. ... Lauri Markkanen missed his sixth game with a sprained ankle.\n\nHornets: Hayward returned to the starting lineup for the Hornets after missing the last six games in the league’s health and safety protocols and struggled, finishing 3 of 13 from the field for seven points.\n\nUP NEXT\n\nCavaliers: Host Indiana Sunday night.\n\nHornets: Host Miami Saturday night.\n\n------",
  "tags_rule": [
    "ThreePointExplosion",
    "CoachComment",
    "CareerHigh",
    "InjuryReport",
    "PhysicalGame"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Physical",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.982481",
  "pipeline_version": "v1"
}