{
  "game_id": "0021700706",
  "espn_id": "400975452",
  "date": "Jan 24, 2018",
  "matchup": "HOU @ DAL",
  "headline": "Harden, Rockets make it 6 straight over Mavs with 104-97 win",
  "cleaned_body": "DALLAS --  James Harden is an All-Star for the sixth straight season. New Houston teammate Chris Paul will miss the February party for the second year in a row following nine consecutive appearances for the Western Conference.\n\nThe Rockets aren't exactly pleased about the Paul part.\n\n\"He averages what 19 (points) and nine assists?\" Harden asked after getting 25 points and 13 assists in a 104-97 win over the Dallas Mavericks on Wednesday night. \"What are we rewarding? We're winning and he's putting up the numbers, there's no question.\n\n\"Obviously, we have a lot of depth on this team, but I'm not doing it out there by myself. He's controlling the games as well.\"\n\nPaul scored 12 points with seven rebounds and four assists as the Rockets beat their Texas rivals for the sixth straight time. The streak started with a four-game sweep last season. Houston won its fourth straight game and seventh in the past nine.\n\nAfter missing the first 14 games with a left knee injury, Paul later sat another three with a left abductor strain. But the Rockets are 24-5 in games he has played, and won his first 15 starts. He is averaging 18.8 points, 8.8 assists, 5.9 rebounds and 1.9 steals per game.\n\n\"People that should be watching games don't watch the games and see how important a guy is,\" coach Mike D'Antoni said before the game. \"It's perplexing.\"\n\nWesley Matthews matched a pair of season highs with 29 points and seven 3-pointers for the Mavericks, who lost for the seventh time in 10 games since a season-best four-game winning streak that helped lift them out of last place in the West.\n\nTrevor Ariza had 23 points and Eric Gordon scored 17 on 4-of-7 shooting from beyond the arc. Southwest Division-leading Houston was up and down from beyond the arc, going 10 of 14 in the first quarter and 2 of 15 in the second.\n\nThe Rockets finished two shy of their season high in 3s, going 21 of 51. Harden shot 6 of 10 and Ariza was 5 of 14, missing his last four. Chris Paul went 3 of 8.\n\n\"It was a tough game and we were playing from behind,\" Dallas coach Rick Carlisle said. \"We got up 3-0 and things look pretty promising at the moment and then it was just like boom, boom, boom.\"\n\nAriza, who combined with Harden and Chris Paul to go 9 of 10 from 3-point range in the first quarter, was suspended two games for entering the Clippers' locker room after a feisty game in Paul's first game against his former team since the offseason trade that sent him to Houston.\n\nClint Capela had 16 points and 13 rebounds. That included an alley-oop dunk on a pass from near midcourt by Harden in the fourth quarter, when the Rockets took their biggest lead at 20 after a 15-point edge in the first 6 minutes was cut to six at halftime.\n\nTIP-INS\n\nRockets: Capela extended a career best with his 11th straight double-digit scoring game, and the Rockets improved to 16-2 when he scores at least 15. ... Houston was just 11 of 23 on free throws, in part because Harden, an 87 percent free-throw shooter, matched his season low with two attempts.\n\nMavericks: G Yogi Ferrell scored 19, going 4 of 5 from long range. ... Matthews was 7 of 14 from 3. ... Rookie PG Dennis Smith Jr. was chosen for the Rising Stars game. Smith is among rookie leaders in points, assists and steals. ... G Kyle Collinsworth was signed to a second 10-day contract. ... G Devin Harris, who has been in the concussion protocol, missed his second straight game and will be out at least two more, Carlisle said.\n\nLOOK OUT ABOVE\n\nHarden's half-court lob to Capela for the dunk surprised D'Antoni, and one of his opponents. \"I just looked at him like, `That was ridiculous, he can't do that.' It was just so good,\" D'Antoni said. \"Even Wesley Matthews just like looked at him, `Are you kidding me? You're half court and you do that?' It's just a great play.\"\n\nQUIET DALLAS FRONTCOURT\n\nDirk Nowitzki scored seven points in a season-low 15 minutes, including just 4 minutes in the second half. Fellow starter and leading scorer Harrison Barnes had a quiet 10 points. Carlisle said Nowitzki wasn't feeling well. \"It was a stomach thing or something like that,\" Carlisle said.\n\nUP NEXT\n\nRockets: At New Orleans on Friday.\n\nMavericks: Portland at home on Friday.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "InjuryReport",
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.606294",
  "pipeline_version": "v1"
}