{
  "game_id": "0021700752",
  "espn_id": "400975498",
  "date": "Jan 30, 2018",
  "matchup": "POR @ LAC",
  "headline": "Griffin gone, Clippers lose to Trail Blazers 104-96",
  "cleaned_body": "LOS ANGELES --  Damian Lillard knew better than to underestimate the Los Angeles Clippers without newly traded star Blake Griffin.\n\nSure enough, the Clippers made a run in the fourth quarter but the Portland Trail Blazers won 104-96 on Tuesday night.\n\n\"Your mind could be trapped into thinking you don't think they have it,\" said Lillard, who scored 28 points.\n\nCJ McCollum added 16 points and Jusuf Nurkic had 14 points and 18 rebounds for the Blazers, who ended a seven-game skid against the Clippers while winning their third in a row.\n\nPortland shot just 37 percent from the floor, but rode a big third quarter to its third straight win.\n\n\"The third quarter was great,\" Blazers coach Terry Stotts said. \"At both ends of the floor we moved the ball. The offense was efficient. Defensively we were on point. The third quarter was the best part of the game.\"\n\nThe Blazers shot 47 percent in the third, when they outscored the Clippers 30-16 led by Lillard's 10 points.\n\nGriffin was dealt to Detroit in a stunning move on Monday, leaving Los Angeles where he had played his entire career.\n\n\"It was definitely tough to see him go,\" said DeAndre Jordan, who had 18 rebounds for the Clippers.\n\nLou Williams scored 20 points off the bench for the Clippers, who made a run in the fourth after they trailed by 20.\n\nMontrezl Harrell scored 11 of his 15 points early in the period and then Los Angeles scored 10 straight points to get to 100-94.\n\nBut the Clippers were limited to one field goal in the final 2 minutes.\n\nOFFENSIVE BOARDS\n\nThe Blazers outrebounded the Clippers 59-50, including an 18-9 edge on the offensive glass. \"When they win the offensive rebounds, they win the game,\" Clippers coach Doc Rivers said.\n\nLOU WILL\n\nWilliams has scored 20 or more points off the bench in 13 straight games, tying Bubbles Hawkins for the second-longest such streak since bench stats were first tracked in 1970-71.\n\nTIP-INS\n\nTrail Blazers: Lillard has scored 20 or more points in five of his last seven games against the Clippers. ... They improved to 7-17 against LA since the 2011-12 season.\n\nClippers: F Danilo Gallinari returned to the lineup after missing 19 games with a left glute injury. He had 15 points. \"It will come in time, rhythm, touch and shots. Everything will come,\" he said. ... Williams got a technical in the fourth. ... Dodgers CF Joc Pederson attended.\n\nUP NEXT\n\nTrail Blazers: Host the Bulls on Wednesday in the second game of a back-to-back.\n\nClippers: Host Chicago on Saturday in the first of two meetings this season.\n\n---\n\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.163479",
  "pipeline_version": "v1"
}