{
  "game_id": "0021301140",
  "espn_id": "400490013",
  "date": "Apr 04, 2014",
  "matchup": "POR vs. PHX",
  "headline": "Suns' rally denies Trail Blazers a playoff spot for now",
  "cleaned_body": "PORTLAND, Ore. -- Once Gerald Green gets going, he doesn't think he can be stopped.\nGreen scored 18 of his 32 points in the second half and the Phoenix Suns rallied for a 109-93 victory over the Portland Trail Blazers on Friday night.\n\"That's what Gerald does,\" Phoenix coach Jeff Hornacek said of Green, who made 12 of 20 shots from the field, including 4 of 7 from 3-point range. \"When he gets going, you just kind of let him go.\n\"There are times when you go, `Uh, oh, what are we going to see next?' He got a little wild, but he feels nobody can ever stop him. That's the confidence he has.\"\nEric Bledsoe finished with 30 points and Goran Dragic added 19 for the Suns (45-31), who denied the Blazers (49-28) a chance to clinch a Western Conference playoff berth while beating Portland for the third time in four games.\nTrailing 67-57, the Suns outscored Portland 22-13 over the final 6:48 of the third quarter to pull within 80-77, then scored the first seven points of the fourth to take the lead for good.\nRobin Lopez and LaMarcus Aldridge each scored 18 points for the Blazers, who had their four-game win streak snapped and dropped two games behind Houston for the West's No. 4 playoff spot.\n\"I'm glad we don't have to play Phoenix anymore,\" Blazers coach Terry Stotts said. \"Obviously, they're active on the offensive glass and extra possessions hurt us. Usually I like our chances when we hold a team to 40 percent shooting, but give the Suns credit.\"\nThe Suns, battling Dallas and Memphis for the West's final two playoff berths, took the lead for good at 81-80 when Green threw the ball off the backboard and dunked to open the fourth quarter, touching off a 20-5 run that all but put the game out of reach with 5:07 remaining.\nMarkieff Morris scored 12 points for the Suns, who finished with a 59-48 advantage in rebounds, a 24-6 advantage in fast-break points, and a 48-32 edge in points in the paint.\n\"We just had a little more determination, I guess,\" said Bledsoe, who scored 14 of his 30 points in the fourth quarter. \"Everybody knew if we'd lost this game, it was going to be tougher going forward.\"\nThe Suns still face a daunting six-game stretch to close out the regular season, including home games against Oklahoma City and Memphis, and road games against San Antonio and Dallas.\n\"Our destiny is in our own hands, because we still play Dallas and Memphis,\" Dragic said. \"Those two games are going to be really huge for us. Win those games and it's going to be really close.\"\nThe Suns, looking to bounce back from Wednesday's 112-108 loss to the Los Angeles Clippers, got a pair of 3-pointers from Green during a 13-2 run that gave them a 26-19 lead with 1:29 to play in the first quarter.\nThey led 51-45 but then came up empty on their final nine possessions of the second quarter, going 0 for 11 from the field with two missed free throws and a turnover as the Blazers outscored them 9-0 in the closing 3:17 of the half to take a 54-51 halftime lead.\nAldridge, held to four first-half points, made 5 of 8 shots from the field and two free throws, giving him 12 third-quarter points as the Blazers carried an 80-79 lead into the fourth.\nThe Blazers, coming off Tuesday's 124-112 road win over the Los Angeles Lakers, got 15 points from Damian Lillard and shot 43 percent (35 of 81) to the Suns' 40 percent (39 of 97). Both teams also made 6 of 21 shots from 3-point range.\nGame notes\nThe last time the Suns had a player score at least 30 points off the bench was when Dragic had 32 points in a 124-115 loss at Utah on Jan. 25, 2010. . The 16-point loss was the second-worst loss for the Blazers at home this season, ranking behind a 98-81 loss to Memphis on Jan. 28. . The Suns went into Friday's gave averaging an NBA-best 18.6 fast-break points and had scored 20 or more fast-break points in 36 games this season. . Lopez was originally drafted by the Suns in the first round (15th pick overall) of the 2008 NBA draft and played four seasons with Phoenix from 2008-12, averaging 5.8 points and 3.3 rebounds in 242 games.",
  "tags_rule": [
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:59.729577",
  "pipeline_version": "v1"
}