{
  "game_id": "0022100815",
  "espn_id": "401360634",
  "date": "Feb 08, 2022",
  "matchup": "PHX @ PHI",
  "headline": "Suns hold off 76ers 114-109 for NBA-best 44th victory",
  "cleaned_body": "PHILADELPHIA -- — Devin Booker never tires of watching Chris Paul do his thing to lift Phoenix to big wins.\n\nPaul did his part for the Suns in back-to-back nights on the road against top teams in the East — first, Chicago and then Philadelphia — and gets to try it again next game in a rematch with the NBA champs.\n\n“You’re a cold piece of work, CP3,” Booker said.\n\nBooker scored 35 points and Paul had 16 points and 12 assists to lead the Suns to their NBA-high 44th win, 114-109 over the 76ers on Tuesday night.\n\nThe Suns rallied from a 14-point deficit to win for the 14th time in 15 games, raising their record to 44-10.\n\nUp next this week for Phoenix, an NBA Finals rematch at home against the Bucks.\n\n“Our goal is what everybody knows it is,” coach Monty Williams said. “But our mission is to do stuff like we did tonight along the way.”\n\nThe Suns were coming off a 127-124 win at Chicago on Monday night, so Williams gave the team the day off. Sleep in. Scratch shootaround.\n\n“We knew it was going to be a day where we needed juice,” he said.\n\nPaul squeezed big plays down the stretch for the Suns.\n\nJoel Embiid had 34 points and 12 rebounds for the Sixers, though he mishandled the ball twice in the final minutes to doom their comeback try. Embiid had his fifth straight 25-point, 10-rebound game, the longest streak in the NBA over the last two seasons and the longest for a Sixers player since, well, Embiid hit six straight in 2018-19.\n\nPaul inched the Suns loose from a back-and-forth second half when he made 1 of 2 free throws for a 100-99 lead. The Sixers lost control of the defensive rebound on the miss and Paul quickly got the ball back and buried a 3-pointer.\n\nSeth Curry then hit his biggest shot of the game -- because it was his first one. Curry had missed all eight shots (five from 3-point range) and had five fouls when he buried a 3 in front of the Sixers bench to pull them within one.\n\nThe Suns, though, kept hitting free throws (22 of 24 overall) to maintain the lead, and Paul hit a tough 20-footer for a 110-104 lead.\n\nTobias Harris, who scored 30 points, kept the Sixers alive with a 3.\n\nThen came a pair of rare Embiid miscues -- he missed wildly on a 3, then the All-Star starter threw the ball away off a turnover and hunched over in disbelief as Phoenix sealed the win.\n\nMikal Bridges scored 23 points and Jae Crowder had 14 rebounds for the Suns.\n\nTIP-INS\n\nSuns: Missed all seven 3s in the third quarter. ... Improved to 18-3 vs. the East. ... Scored 27 points off 15 turnovers.\n\n76ers: G Matisse Thybulle started after he missed one game with a sore right shoulder. ... Coach Doc Rivers was named one of the 15 greatest coaches in NBA history, as part of the league’s 75th anniversary celebration.\n\nTRADE DEADLINE\n\nThe Sixers have become one of the most talked-about teams in the league as the NBA nears Thursday’s trade deadline. All-Star guard Ben Simmons, who has not played this season, still wants to be traded.\n\nRivers said his door is always open if players rumored to get traded want to talk.\n\n“There’s just so many bad rumors, honestly,” Rivers said. “There’s so much noise and talk with every team, I guess. Obviously, us with the Ben situation.”\n\nRivers did make a postgame plea for another guard.\n\nWilliams said he doesn’t discuss the latest rumors with his team.\n\n“I never bring it up, just because, most of it is just hype,” he said. “I’m not going to bring it up if there’s nothing there.”\n\nUP NEXT\n\nSuns: Host Milwaukee in an NBA Finals rematch on Thursday.\n\n76ers: Host Oklahoma City on Friday.\n\n------",
  "tags_rule": [
    "MomentumShift",
    "CoachComment",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:56.171962",
  "pipeline_version": "v1"
}