{
  "game_id": "0021701160",
  "espn_id": "400975906",
  "date": "Apr 03, 2018",
  "matchup": "CHA @ CHI",
  "headline": "Markkanen, Kilpatrick lead Bulls over Hornets, 120-114",
  "cleaned_body": "CHICAGO --  Many believe it's in the Bulls' best interests to lose as many games as possible as the regular season winds down.\n\nThe players don't.\n\nLauri Markkanen scored 24 points and Sean Kilpatrick added 21 off the bench to lead Chicago to a 120-114 victory over the Charlotte Hornets on Tuesday night.\n\nMarkkanen didn't play in the fourth quarter and totaled just 24 minutes for the game. The 7-foot rookie was 8 of 14 from the field, including 5 of 6 on 3-pointers.\n\nJustin Holiday had 19 points and Bobby Portis added 16 for Chicago, which has won three straight.\n\nThe winning streak could drop the Bulls a few spots in the June draft, but that's of no concern inside the locker room.\n\n\"We're going out there and try to win every game,\" Markkanen said. \"I hope we can keep this thing going.\"\n\nDwight Howard had 23 points and 12 rebounds, and Malik Monk scored 21 points for Charlotte, which has dropped four straight.\n\n\"Turnovers just crushed us, both in the third and fourth,\" Hornets coach Steve Clifford said. \"I mean, we did some good things, but just really poor, poor turnovers that led directly to easy baskets. That was the difference.\"\n\nThe Bulls had an 86-79 lead entering the fourth quarter before coach Fred Hoiberg decided to sit most of his regulars and unofficially tank.\n\nKilpatrick, though, had other plans and took over the reigns of the offense, scoring 19 points in the final 12 minutes to hold off Monk (16 in the fourth) and Charlotte.\n\nKilpatrick iced the game with a 3-pointer with 56.5 seconds to go for a 118-114 lead.\n\n\"It's an amazing feeling,\" he said.\n\nWith Markkanen and Portis sitting out the fourth, Robin Lopez not playing at all and Kris Dunn (sprained right toe), Zach LaVine (left knee tendinitis) and Denzel Valentine (left knee) out with injuries, the Bulls closed with a group of mostly young and unproven players.\n\n\"You want your guys to go out and compete at the highest level and we're doing that across the board right now,\" Hoiberg said. \"We've got so many young guys and they're still learning their way in this league. They want to compete.\"\n\nTIP-INS\n\nHornets: F Nicolas Batum (left Achilles tendon soreness) was a surprise addition to the starting lineup. \"Earlier in the morning, he was going to not play,\" Clifford said. \"Then it felt a lot better at shootaround.\" Batum finished with 11 points in 28 minutes . G/F Dwayne Bacon (sprained right ankle) and G/F Treveon Graham (concussion protocol) each missed a second straight game.\n\nBulls: Valentine was scheduled to have arthroscopic surgery on his left knee to remove loose debris on Wednesday morning and will miss the final week of the season. \"I'll be able to walk out of the hospital,\" he said. \"I had the same thing done in college when I was a senior and I was back playing in two weeks.\" . F Noah Vonleh suffered a strained left calf in the first half and did not return.\n\nFAST START\n\nThe Bulls signed Kilpatrick, a journeyman in his third season, a week ago and he's scored in double figures in four of the five games he's played. He credits his teammates for helping him adjust.\n\n\"It's probably one of the closest teams I've been on,\" he said. \"I think that's something that's real exciting about this group.\"\n\nSTRONG FINISH\n\nIf not for Kilpatrick, Monk might have been the star of the game. He got hot and tried to spark the Hornets.\n\n\"We just started attacking more, being more aggressive on defense and on offense,\" the rookie from Kentucky said. \"I made a couple plays. We just came up short.\"\n\nUP NEXT\n\nHornets: Visit Orlando on Friday night.\n\nBulls: Visit the Boston on Friday night.",
  "tags_rule": [
    "EarlyRun",
    "InjuryReport",
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.499264",
  "pipeline_version": "v1"
}