{
  "game_id": "0021301130",
  "espn_id": "400490003",
  "date": "Apr 04, 2014",
  "matchup": "CHA vs. ORL",
  "headline": "Bobcats hold off Magic, get back to .500",
  "cleaned_body": "CHARLOTTE, N.C. --  The Charlotte Bobcats finally have a happy locker room, the result of winning games and contending for a berth in the NBA playoffs.\n\nThe Bobcats took a step closer to a postseason spot Friday, holding off a fourth-quarter rally to beat the Orlando Magic 91-80 for their third straight win.\n\n\"It shows how hard they've really worked, and how they've fought to get back to this point,\" Charlotte coach Steve Clifford said. \"Now we'd like to get over .500, which would be a nice thing for our team.\"\n\nAl Jefferson had 29 points and 16 rebounds, and Kemba Walker added 13 points, 10 rebounds and 10 assists for the Bobcats, who at 38-38 are back at .500 for the first time since Nov. 23, when they were 7-7.\n\nNow Charlotte has a shot at its first winning record since Nov. 15, when the Bobcats were 5-4 despite not having Jefferson in the lineup because of an ankle injury.\n\n\"We're heading in the right direction,\" Jefferson said. \"We're a team that's playing well right now. We've just got to continue to get better, and get ready for the playoffs.\n\n\"We're right there, but we've got to take it one game at a time.\"\n\nVictor Oladipo scored 21 points and three others finished in double figures for the Magic, who despite having the league's third-worst record (21-55) had beaten Charlotte twice in three previous meetings.\n\nBut on Friday, Orlando faced the Bobcats without 7-foot center Nikola Vucevic, who was a game-time scratch after he complained of soreness in his left Achilles tendon.\n\n\"I went through my pregame routine, and it started to become more and more sore,\" Vucevic said. \"I talked to the trainer, and we decided it was best for me not to go.\"\n\nWithout Vucevic -- who had 24 points and 20 rebounds in the Magic's 110-105 overtime victory over Charlotte on March 28 -- in the lineup, Jefferson broke loose for 21 points and 11 rebounds in the first half.\n\nStill, it took a big run in the second quarter for the Bobcats to take command, leading by as many as 19 points before taking a 53-36 halftime lead.\n\nCharlotte extended that lead to 21 points midway through the third quarter, going up 68-47 on Jefferson's jumper with 5:08 remaining, before Orlando began making a comeback.\n\nDespite shooting just 35.6 percent from the field, the Magic cut the Bobcats' lead to 72-60 by the end of the third quarter, and pulled within 76-69 on Oladipo's 3-pointer with 8:58 remaining in the fourth. But Gary Neal (12 points) had a three-point play 26 seconds later to push Charlotte's lead back into double figures.\n\n\"It was really the effort up and down the floor,\" Magic coach Jacque Vaughn said. \"Just being in the right place and being committed to it. It's just that simple. Overall, the energy in the second half was how we have to be.\"\n\nOrlando had that energy in the first half, twice taking brief leads in the opening minutes of the second quarter. The Magic went up 21-20 on E'Twaun Moore's jumper with 11:43 left, and were ahead 25-24 after Oladipo's layup with 9:02 remaining.\n\nBut Anthony Tolliver (13 points) hit his second 3-pointer of the quarter with 8:44 left to put the Bobcats ahead to stay and kick off a 27-6 run. Jefferson's dunk with 3:36 left gave Charlotte its first double-digit lead, at 41-30, and Walker hit a pair of free throws with 1:50 left to put the Bobcats ahead 51-30, their biggest lead of the half.\n\nThe seventh-place Bobcats begin a three-game road trip Saturday at Cleveland, with stops in Washington on April 9 and Boston on April 11, as the near their first playoff appearance since 2010.\n\n\"It's been a long time coming,\" Walker said. \"It's very satisfying. We've been through a lot of ups and downs this season, but we've stuck with things as a team. It's exciting, especially to get to this point.\"\n\nGame notes Bobcats F Josh McRoberts sat out his second straight game recuperating from a sprained left ankle. Clifford said that McRoberts would take the next two days off, and may resume practice Monday. ... Charlotte got a scare late in the first quarter when Michael Kidd-Gilchrist went down hard after having his layup blocked. Kidd-Gilchrist, who missed seven games with ankle problems earlier this season, was listed as \"questionable\" by team officials for the rest of the game with a bruised back, but he returned to play the second half. ... The Bobcats have created a website -- www.bigalspaint.com -- to promote Jefferson as an All-NBA candidate. The website went public Thursday, and features quotes from opposing players and coaches, stats and stories by local and national media.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.656980",
  "pipeline_version": "v1"
}