{
  "game_id": "0022100057",
  "espn_id": "401359881",
  "date": "Oct 27, 2021",
  "matchup": "MIA @ BKN",
  "headline": "Adebayo has 24, Heat pull away to beat Nets 106-93",
  "cleaned_body": "NEW YORK -- — Bam Adebayo had 24 points and nine rebounds to lead the Miami Heat to a 106-93 victory over the Brooklyn Nets on Wednesday night.\n\nJimmy Butler added 17 points for Miami (3-1). P.J. Tucker finished with 15, and Tyler Herro and Dewayne Dedmon each contributed 14.\n\nA preseason favorite to win the NBA championship, Brooklyn has alternated losses and wins through the first five games of the season and dropped to 2-3. Kevin Durant finished with 25 points and 11 rebounds.\n\n“I like how we’re playing defense the last couple games,” Durant said. “I like where our defense is trending. ... I feel like we’re generating good shots. We’re just (not) knocking them down. If we continue to generate good shots we’ll put ourselves in good position.”\n\nJoe Harris contributed 15 points on 5-for-15 shooting, including 5 for 11 from 3-point range. With his third 3-pointer of the game, Harris passed Jason Kidd as the franchise’s career leader in made 3-pointers.\n\nJames Harden had 14 points and Bruce Brown chipped in with 12.\n\nThe first of four regular-season matchups between the Eastern Conference rivals was a contrast in styles, the flashy, up-tempo, high-scoring Nets against a physical Heat squad.\n\nDespite forcing the Nets to play a possession-by-possession game for much of the first half, the Heat trailed 51-49 at the half. Miami had outscored Brooklyn in the paint (30-20), had more second-chance points (15-2), and had a decided edge in rebounds (35-25).\n\n“We have a bunch of like-minded guys,” coach Erik Spoelstra said. “(That’s) the way those guys are hard-wired.”\n\nWhat the Heat did not have, though, was the tandem of Durant and Harden, who combined for 25 of Brooklyn’s 51 points in the half. Durant also grabbed eight rebounds while Harden added three boards and three assists.\n\nMiami stayed with its approach and it paid dividends in the third quarter, as the Heat outscored the Nets 32-23 and took an 81-74 lead into the fourth. The Heat extended their lead to 88-77 before Brooklyn used a 7-2 spurt to cut the deficit to 90-84.\n\nFollowing a timeout, Durant stared down Butler as he drilled a 3 to bring Brooklyn with three. That was as close as the Nets would come, as Miami pulled away, with Adebayo throwing down two thunderous dunks.\n\nFor the game, Miami outscored Brooklyn 48-34 in the paint, had 27 more second-chance points (31-4), and outrebounded the Nets 62-42.\n\n“Overall a consistent theme was second-chance opportunities,” Harris said. “When you look up and the shot margin was as big as it was, it’s really hard to beat good teams. That was a problem a lot of last year and it’s been a problem a lot of this year so far.”\n\nTIP-INS\n\nHeat: Entering Wednesday, the Heat were limiting opponents to 27% on 3-point attempts but were also yielding 41 attempts from behind the arc per game. “It was similar last year,” Spoelstra said. “I’ll be honest, we haven’t totally wrapped our mind around it. We’re working on it. I don’t love giving up that many 3s (but) you can’t take away everything. This game is different than it was five, six, seven years ago. And we’re still trying to figure it out.\"\n\nNets: Through four games, Durant was averaging 31 points and had 23 assists (5.75 per game). “I think Kevin has taken on more of a leadership role with the ball in his hands,” coach Steve Nash said before the game. “He’s found a nice balance between still leading us in scoring and also facilitating; looking for his teammates. For such a gifted, historic scorer, he really is an unselfish player. I think inside — in his mind, in his heart — he’d be quite happy to pass the ball all night if it was successful. I think he shoots more I think when he needs (to).\"\n\nUP NEXT\n\nHeat: Hosts Charlotte on Friday night.\n\nNets: Continues six-game homestead by hosting Indiana on Friday night.\n\n------",
  "tags_rule": [
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.124511",
  "pipeline_version": "v1"
}