{
  "game_id": "0021400207",
  "espn_id": "400578499",
  "date": "Nov 25, 2014",
  "matchup": "MIL vs. DET",
  "headline": "Knight helps Bucks beat Pistons 98-86",
  "cleaned_body": "MILWAUKEE --  O.J. Mayo made the most of his first start in a year.\n\nMayo scored 17 points to help the Milwaukee Bucks to a 98-86 victory over the Detroit Pistons on Tuesday night. He was 5 for 10 from the field and 4 for 4 at the line his first start since Dec. 14 at Dallas.\n\n\"I just go out there hoopin' man,\" Mayo said. \"You think of a pick-up game, you want to be among the first 10 guys to go out there and play.\"\n\nBrandon Knight had 20 points and eight assists for Milwaukee (8-7), which avoided its first three-game slide of the season. Rookie Jabari Parker contributed 14 points and nine rebounds.\n\nDetroit (3-11) has lost five in a row and eight of nine.\n\nAndre Drummond had 23 points and 10 rebounds for the Pistons, and Greg Monroe added 15 points and eight boards. Drummond was averaging 8.7 points coming into the night, but shot 11 of 15 from the floor.\n\nDetroit guard Brandon Jennings missed his first game of the season after he hyperextended his left thumb late in Friday's 99-89 loss at Atlanta. Jennings, who spent his first four seasons with the Bucks, is averaging 16 points and 5.8 assists per game.\n\n\"We gave them 19 offensive rebounds, we had 19 turnovers and we were 7 of 17 at the free-throw line,\" Detroit coach Stan Van Gundy said. \"They hit 10 3-pointers. Those were the four factors in the game. There's really nothing else to talk about.\"\n\nA basket by Zaza Pachulia gave Milwaukee its biggest lead at 87-73 with 5:46 left.\n\nDetroit closed to 88-80 on a layup by Monroe with 4:17 to go, but the rally fizzled from there.\n\nPachulia grabbed an offensive rebound and nailed a jumper, and after Drummond missed a layup, Knight followed with a 3-pointer to make it 93-80 with 3:11 left.\n\n\"We can't lose three in a row,\" Parker said. \"We didn't want to lose two in a row.\"\n\nMilwaukee put together a 12-1 run to open a 79-67 lead heading into the final period. The Bucks also closed out the first half with an 11-2 run.\n\n\"They scored one point,\" Milwaukee coach Jason Kidd said. \"For us as a young group, those are positive things for us to look at and learn from. They're showing us coaches they can do it.\"\n\nTIP-INS\n\nPistons: Drummond's previous season high of 14 points occurred on Nov. 1 against Brooklyn. ... D.J. Augustin started in place of Jennings and had 11 points and seven assists. He also committed five turnovers. ... Detroit handed visiting Milwaukee a 98-95 loss on Nov. 7 in the only other meeting between the teams.\n\nBucks: In his first game since scoring a career-high 20 points, Giannis Antetokounmpo managed just two points on 1-of-13 shooting. ... John Henson sprained his left foot in the second quarter and did not return. He will not travel with the team to Minnesota. ... Milwaukee's 121 wins against Detroit are its most against any team.\n\nUP NEXT\n\nPistons: Host the Los Angeles Clippers on Wednesday.\n\nBucks: Visit Minnesota on Wednesday.\n\nSILVER IN TOWN\n\nNBA Commissioner Adam Silver was in Milwaukee and met with new Bucks owners Wes Edens and Marc Lasry, as well as local business leaders and elected officials, to discuss a possible new facility for the team.\n\n\"We accomplished a lot,\" Silver said. \"There's a tremendous amount of positive energy in the community. There are always bumps in the road, but there's no doubt here that the people, the fans, the elected officials, they all recognize the value this team brings to the community.\"\n\nBEST DAY OF THE WEEK\n\nThe Bucks are 4-0 on Tuesdays and 4-7 the rest of the week.",
  "tags_rule": [
    "MomentumShift",
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:53.415900",
  "pipeline_version": "v1"
}