{
  "game_id": "0022100874",
  "espn_id": "401360693",
  "date": "Feb 16, 2022",
  "matchup": "ORL vs. ATL",
  "headline": "Trae Young scores 22 points, Hawks rout Magic 130-109",
  "cleaned_body": "ORLANDO, Fla. -- — All-Star starter Trae Young had 22 points and six assists and the Atlanta Hawks routed the Orlando Magic 130-109 on Wednesday night in the final game before the break for both teams.\n\nYoung played only 25 minutes after scoring 41 points in Atlanta's home victory over Cleveland on Tuesday night. The Hawks made 18 of 32 3-point shots and shot 50% overall.\n\n“Anytime you can get some more rest in this league it's great because you play so many games,” Young said. “It was great that we were able to finish the game in three quarters, or three and a half quarters. Our bench was great tonight.”\n\nBogan Bogdanovic led Atlanta with 23 points.\n\nCole Anthony led Orlando with 23 points and seven rebounds. Rookie Jalen Suggs added 19 points in the Magic's fourth straight loss.\n\n“Credit them for finding shooters and making shots,” Magic coach Jamahl Mosley said. “Trae does such a great job of forcing all the attention on him, and then getting it to guys to make shots. We've obviously got to get better at defending the 3-point line.”\n\nYoung’s 3-pointer with 6:26 left in the first quarter broke a 15-15 tie and started a 13-2 run that put the Hawks up for good.\n\nThe back-to-back wins gave the Hawks (28-30) a boost before a week-long break.\n\n“We understand exactly where we are and what we need to do,” coach Nate McMillan said. “We're still in the race but we have to be better to finish the season and play ourselves into it.”\n\nAtlanta led 72-53 after shooting 13-for-19 from behind the arc in the first half. Young and Bogdanovic each made their first three 3-point attempts.\n\n“I thought our guys had good focus,” McMillan said. “They didn't start this break before the game. We pretty much controlled the game from start to finish.”\n\nTIP-INS\n\nHawks: Atlanta won three of four in the season series. . . . Danillo Gallinari, whose playing status had been questionable due to an ankle injury, started the game with a noticeable limp but played 26 minutes . . .De'Andre Hunter went to the locker room to tend to a cut on his face late in the third quarter and never re-entered the game.\n\nMagic: David Steele, in his 24th year as the Magic's television play-by-play announcer, has been named Florida Sportscaster of the Year for the second time. . . . Anthony, questionable with an ankle injury, played 25 minutes. . ... Wendell Carter Jr. had 10 points, 10 rebounds and six assists.\n\nWILLIAMS PLAYS 985TH GAME OFF BENCH\n\nLou Williams set an NBA record when he entered the game for the Hawks with 2:38 left in the first quarter. It was the 985th game in which the 16-year veteran came off the bench, breaking a tie with Dell Curry.\n\n“He’s been the Sixth Man of the Year a few times,” McMillan said. “They need to probably name that award after Lou.”\n\nWilliams won the award in 201-15 with the Toronto Raptors and in 2017-18 and 2018-19 with the Los Angeles Clippers.\n\nUP NEXT\n\nHawks: At Chicago on Thursday, Feb. 24.\n\nMagic: Host Houston on Friday, Feb. 25.",
  "tags_rule": [
    "InjuryReport",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:55.687217",
  "pipeline_version": "v1"
}