{
  "game_id": "0021700924",
  "espn_id": "400975670",
  "date": "Mar 01, 2018",
  "matchup": "SAC vs. BKN",
  "headline": "Kings outlast Nets 116-111 in overtime",
  "cleaned_body": "SACRAMENTO, Calif. --  De'Aaron Fox passed up a chance at a game-winning 3-pointer and settled for a tying floater at the end of regulation. Bogdan Bogdanovic followed Fox's lead in overtime with a couple of momentum-swinging shots of his own.\n\nSacramento's top two rookies certainly are looking a lot more comfortable in the big moments.\n\nBogdanovic made a go-ahead short runner from the baseline with 1:06 left in OT, then added a pair of free throws and the Kings beat the Brooklyn Nets 116-111 on Thursday night.\n\n\"I've said from the beginning of the season that we have great chemistry here,\" Bogdanovic said. \"It's really fun to work with all of these guys. We just love to work. It's nothing else, no secret.\"\n\nThe Kings blew a lead late in the fourth quarter but outscored the Nets 16-11 in the extra period to end a five-game losing streak.\n\nSpencer Dinwiddie's bucket with 1:22 left gave Brooklyn a 111-110 lead before Bogdanovic drove into traffic near the baseline and pulled up for the basket that gave the Kings the lead for good.\n\nAfter Dinwiddie missed a 3-pointer, Buddy Hield made a pair of free throws to make it 114-111. Bogdanovic sank two free throws after D'Angelo Russell also missed a 3-pointer.\n\n\"It came down to who had the grit to go get rebounds and loose balls,\" Fox said. \"It's always great playing these games, games that come to the wire. I feel like we made the correct plays.\"\n\nBogdanovic finished with 23 points, Fox added 21 and Willie Cauley-Stein scored 17 to pace five Sacramento players in double figures.\n\nFinal overall statistics were not available from the game, the second time in eight days that has occurred in Sacramento. The Kings blamed a malfunction of the NBA's scoring program which locked up near the end of the fourth quarter.\n\nEven the giant scoreboard that hangs over center court at Golden1 Center had the final score wrong, listing the Kings winning 116-100.\n\nIt was fitting on a night when the game swung back and forth until overtime.\n\n\"It was a good experience for our guys,\" Kings coach Dave Joerger said. \"Everybody made a play at some point in the game.\"\n\nThe Nets trailed most of the fourth quarter and were down 98-95 following back-to-back buckets by Hield. DeMarre Carroll's 3-pointer tied it and Dinwiddie made two free throws with 6.2 seconds left to put Brooklyn ahead before Fox's 9-foot baseline runner at the buzzer forced overtime.\n\nBrooklyn got the lead early in overtime but couldn't hold it and lost for the 14th time in 16 games.\n\n\"In the fourth quarter and overtime we struggled to stop them,\" Nets coach Kenny Atkinson said. \"They were turning the corners, they were in our paint way too much. We just couldn't close the deal.\"\n\nIt's the Kings' first season sweep of the Nets since 2007-08. A loss would have given Sacramento the worst record in the NBA.\n\nCarroll scored 22 points, Allen Crabbe had 20, and Russell and Jarrett Allen had 15 points apiece for Brooklyn.\n\nTIP-INS\n\nNets: Russell missed his first six shots and didn't score until 7  1/2 minutes remained in the third quarter. ... Allen had dunks on three consecutive possessions in the first quarter, including a soaring one-hander. ... Jahlil Okafor remained out because of an illness but is hopeful of playing Sunday in Los Angeles.\n\nKings: Garrett Temple returned after sitting out the previous two games with a back injury. ... Zach Randolph did not play for the second time in three games because of coach's decision.\n\nRUSSELL'S RECORD . OR NOT.\n\nBefore the scoring system broke down Russell was credited with 10 assists, which matched his season high. He was credited with an 11th in the fourth quarter but it was taken back after a scoring change. That would have tied his career high on Feb. 2, 2017, while he was still with the Los Angeles Lakers.\n\nUP NEXT\n\nNets: Play at the Los Angeles Clippers on Sunday.\n\nKings: Host Utah on Saturday.",
  "tags_rule": [
    "LateCollapse",
    "Streak",
    "CoachComment",
    "CareerHigh",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Collapse",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.785345",
  "pipeline_version": "v1"
}