{
  "game_id": "0022100470",
  "espn_id": "401360294",
  "date": "Dec 22, 2021",
  "matchup": "ATL vs. ORL",
  "headline": "Magic beat Hawks 104-98 in matchup of short-handed teams",
  "cleaned_body": "ATLANTA -- — Franz Wagner scored 25 points, Robin Lopez had 10 points and a career-high 11 assists, and the Orlando Magic beat the Atlanta Hawks 104-98 in a matchup of short-handed teams on Wednesday night.\n\nCam Reddish finished with a season-high 36 points and John Collins had 23 points and 11 rebounds for the Hawks, who have lost seven straight at home.\n\nBoth teams had to make plenty of adjustments before the game with so many players in health and safety protocols.\n\n“It’s been crazy,\" Magic swingman B.J. Johnson said after scoring 14 points in a reserve role and signing a 10-day contract last Friday. “This is year three for me but just how quickly everything has happened these past five or six days with COVID and people getting caught up left and right.\"\n\nHawks guard Kevin Huerter was taken out of the starting lineup after a positive test, joining Lou Williams and Timothe Luwawu-Cabarrot in protocols on Wednesday. Collins was the only regular in Atlanta’s lineup. Bogdan Bogdanovich returned after missing eight games with a right ankle sprain and scored six points.\n\nAtlanta was already without leading scorer Trae Young, leading rebounder Clint Capela and reserve forward Danilo Gallinari. The Hawks started Reddish, Gorgui Dieng, Delon Wright and Skylar May with Collins. They had 11 players dressed.\n\nMagic guard Mychal Mulder joined five teammates in protocols. Terrence Ross, Mo Bamba, Moritz Wagner, R.J. Hampton and Ignas Brazdeikis were the others. Orlando had only four regulars — Wagner, Gary Harris, Chuma Okeke and Lopez — who weren’t listed on the pregame injury report.\n\nLeading scorer Cole Anthony (right ankle sprain) and Wendell Carter Jr. (right leg muscle strain) were game-time decisions, and both were ruled out. Wagner, Harris, Okeke, Lopez and rookie Hassani Gravett started. The Magic had 10 players dressed.\n\nAleem Ford’s fast-break layup put the Magic back up by double digits early in the fourth quarter, and B.J. Johnson followed with a 22-footer that made it 76-63 before Lopez came through with a runner that caused the Hawks to call timeout with 9:12 remaining.\n\nWagner’s three-point play pushed the lead to 89-73 with 6:27 left in the game. Wagner’s runner at the 4:49 mark put the Magic up by 17 before Reddish’s 3 pulled Atlanta within 10 and Orlando called timeout with 3:29 remaining.\n\nWagner credited his new teammates with staying the course and not panicking.\n\n“It’s really impressive to come in with a lot energy on the court, so much shooting, so much confidence,\" Wagner said. “I think it’s really difficult for them to do that, not really knowing the system yet and not really having time to adjust to anything, so really impressed. Even better, I think that they’re all great guys and we’ve built a really good chemistry already.\"\n\nThe Hawks got as close as eight, but Gary Harris hit a pair of free throws to push the lead back to 10 and Orlando was never threatened again after Chuma Okeke buried a 3 from the left corner to make it 99-88.\n\nGravett connected with Aleem Ford for an alley-oop dunk to make it 34-25 midway through the second before Bogdanovich hit a runner to trim the lead to 38-32 at the four-minute mark of the period. Freddie Gillespie banked in an eight-footer at the buzzer to give the Magic a 10-point cushion at halftime.\n\nGary Harris hit a 3 and Robin Lopez had a fast-break dunk to make it 54-37 early in the third as the Magic got off to a 11-4 start to the period. Gravett’s 3 early in the third gave the Magic a 20-point lead, its largest of the game.\n\nCollins hit a 3 from the left wing to bring the Hawks within double digits at the 2:59 mark and he followed with a put-back jam to make it 63-56. Orlando led 70-61 entering the fourth.\n\n“That team was playing in the same situation that we were with a lot of guys out,\" Atlanta coach Nate McMillan said. “I thought they had a better flow, a better rhythm. They brought the intensity and controlled the game from start to finish.\"\n\nTIP-INS\n\nMagic: Orlando never trailed after Wagner hit a runner to make it 12-11 midway through the first. ... The Magic missed 15 of 19 3-point attempts in the first half. They finished at 29.7% on treys. ... Only eight of Orlando’s 40 rebounds were on the offensive end.\n\nHawks: Had 11 of their 14 turnovers, nine of them on Orlando steals, in the first half. ... McMillan called his first timeout midway through the first after Orlando went on a 9-0 run to make it 19-11. ... Reddish and Collins were the only players to finish in double figures. ... Atlanta was outscored 46-36 in the paint.\n\nUP NEXT\n\nMagic: Host New Orleans on Thursday.\n\nHawks. At Philadelphia on Thursday.\n\n------",
  "tags_rule": [
    "InjuryReport",
    "CoachComment",
    "CareerHigh"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.493046",
  "pipeline_version": "v1"
}