{
  "game_id": "0022100571",
  "espn_id": "401360390",
  "date": "Jan 05, 2022",
  "matchup": "BKN @ IND",
  "headline": "Irving helps Nets charge past Pacers in his season debut",
  "cleaned_body": "INDIANAPOLIS -- — Kyrie Irving scored 22 points and sparked Brooklyn to a big rally in the second half of his season debut, Kevin Durant had 39 and the Nets beat the Indiana Pacers 129-121 on Wednesday night.\n\nIrving is ineligible to play home games because he is not vaccinated as mandated in New York City, and the Nets had decided against allowing him to just play road games for most of the season.\n\nBut they changed their mind last month and were glad they did Wednesday, when Irving helped them charge back from a 19-point deficit. The point guard played 32 minutes as Brooklyn snapped a three-game losing streak.\n\n“He looks like himself, not that that’s a surprise,” Nets coach Steve Nash said.\n\nDurant said it was amazing to see Irving out on floor again.\n\n“He didn’t act nervous, he has a nice poker face,” Durant said. “He’s a quiet guy. He plays with energy and passion.”\n\nIrving said he was nervous, adding it was different than any previous debut in his basketball career.\n\n\"This meant a little more, taking eight months off and so much uncertainty,\" he said “I settled down closer to the second half. Whatever the team (needs), I'll do.”\n\nDomantas Sabonis had 32 points, 12 rebounds and 10 assists for the Pacers, who have lost in six in a row. Lance Stephenson, who had two previous stints with the Pacers, scored 30 in his first home game with the Pacers after signing a 10-day contract.\n\n“Just working out two years, waiting for this moment,” Stephenson said. “I’m so happy to be here, it’s home. It's like playing in front of family.\"\n\nStephenson delighted the home crowd by scoring the final 20 points for the Pacers in the first quarter as Indiana took a 37-32 lead. He hit 8 of 9 shots, 4 of 5 3-pointers in that 6-plus minute stretch.\n\nThe 20 points were a record for any Pacers player in the first quarter. It was also the most points in the opening quarter for a player coming off the bench.\n\nThe Pacers shot 62% to a grab a 73-60 lead at halftime. Irving hit a shot at the third-quarter buzzer to cut Indiana’s lead to 101-94. That capped an 8-0 run by the Nets.\n\nPatty Mills sank a 3-pointer to put Brooklyn ahead for good at 107-106 with 7:23 left. Irving followed with two consecutive baskets to push the lead to 111-106 and Indiana never recovered.\n\n“It came down to defense and effort, and second half was night and day to the first,” Nash said. “It took us getting in a deep hole before we showed them the respect the game and them the respect they deserved.”\n\nIrving agreed that the comeback started on the defensive end.\n\nBrooklyn shot 56% overall while Indiana finished at 49%.\n\n“We kept our composure and made shots when we needed to,” said James Harden, who added 18 points. “We got physical and challenged shots.”\n\nA GIFT\n\nNash said the Nets called the first play of the game for Irving, who missed a 19-foot shot\n\n“It was a welcome back gift,” Nash said.\n\nIrving hit 9 of 17 shots and 2 of 4 free throws.\n\nTIP-INS\n\nNets: LaMarcus Aldridge, who has said he is still recovering his condition from his COVID-19 bout, scored 13 points in 16 minutes. He had missed the last game after returning to play two games following his COVID-19 bout. ... DeAndre’ Bembry scored 12 points, hitting all five shots, in 20 minutes.\n\n“He didn’t deserve not to be in the rotation,\" Nash said. “We just had to try different things with everyone back.”\n\nPacers: Malcolm Brogdon, Chris Duarte and Jeremy Lamb have been cleared to play from health and safety protocols but held out for return to competition conditioning. … Caris LeVert, Kelan Martin, Isaiah Jackson and Goga Bitadze were sidelined by the COVID-19 protocols. … Torrey Craig was out with a right groin injury suffered in Tuesday night’s loss at New York.\n\nUP NEXT\n\nNets: Host Milwaukee on Friday.\n\nPacers: Host Utah on Saturday.",
  "tags_rule": [
    "MomentumShift",
    "ReturnFromInjury",
    "Streak",
    "CoachComment",
    "InjuryReport"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Comeback",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.459815",
  "pipeline_version": "v1"
}