{
  "game_id": "0021700190",
  "espn_id": "400974941",
  "date": "Nov 12, 2017",
  "matchup": "HOU @ IND",
  "headline": "James Harden, Rockets beat Pacers 118-95",
  "cleaned_body": "INDIANAPOLIS --  Houston Rockets scored early and often.\n\nJames Harden had 26 points and a season-high 15 assists and the Rockets beat the Indiana Pacers 118-95 on Sunday night.\n\n\"We're preaching it. Getting off to better starts and not trying to fight our way back into games. We've been doing that as of late,\" Harden said.\n\nThe Rockets improved to 11-3, never trailing and leading by as many as 23.\n\nThe Rockets overwhelmed the Pacers from the start, jumping out to a 13-2 lead. Houston continued to pile it on early and often, outscoring the Pacers 24-9 during the first 6 minutes.\n\nIndianapolis native Eric Gordon had 21 points, and Clint Capela had 20 points and 17 rebounds for the Rockets on the way to Houston's sixth straight victory.\n\nHouston outscored Indiana 46-38 in the paint, but their most impressive work on the offensive end of the floor came beyond the 3-point line, making 17 3-pointers.  Houston's defense was also a high point for the Rockets with 10 of Indiana's 13 turnovers coming by way of a steal.\n\n\"It was a professional win,\" Rockets coach Mike D'Antoni said. \"They came in and they took care of business right from the get go. We played well. We've been playing well. We're going to keep it going ... we just don't want to get too excited, we have another game Tuesday.\"\n\nThe lone bright spot of the game for the Pacers came in the second quarter when they managed to cut Houston's lead to 39-34. Victor Oladipo had 28 points, and Domantas Sabonis added 17 off the bench for Indiana, and Lance Stephenson had eight points and 10 assists.\n\nBut the Rockets were simply too much for the Pacers. Houston went into halftime leading once again by double digits, 63-51 and put it away in the third quarter with the same offensive mindset that they started the game with. The Rockets led 87-71 at the start of the fourth and never looked back.\n\nMyles Turner finished with 13 points and eight rebounds for Indiana and a very clear understanding of how and when the game got away from the Pacers.\n\n\"The start,\" Turner said. \"We got off to a bad start and it's hard (to climb back) ... (Houston) cut out from the first play. They executed their stuff, got out and ran and our communication was really bad in transition.\"\n\nROCKET MAN\n\nHarden has at least 20 points and seven assists in all 14 games this season and has seven double-doubles and two triple-doubles.\n\nHOMEGROWN HOOPS\n\nPacers fans still relishing in the excitement of the addition of former Indiana Hoosier Oladipo were happy to welcome back Houston guard Eric Gordon. Gordon, also a former Hoosier, was met with a warm reception during player introductions. Gordon returned to the arena where he played for a state championship in high school. The defending NBA 3-point competition champion averaged 29 points his senior year at North Central High School (Indianapolis) and 20.9 points during his lone year at Indiana.\n\nTIP-INS\n\nRockets: The Rockets are 7-1 on the road, highlighted by their season opening win against Golden State. ... Five of Houston's next seven games will take place at the Toyota Center in Houston, capped off with a rematch against Indiana on Nov. 29. ... The Rockets have held opponents below 100 points six times this season and are 5-1 when doing so. . Clint Capela has eight double-doubles this season. . Houston has made 10 or more 3-pointers in 13 of the first 14 games this season.\n\nPacers: Indiana has lost five of its last six games after a 5-3 start to the season. ... Houston's 35 points in the first quarter were the most allowed by Indiana this season. With 63 points at halftime, the Rockets also tied for the most first-half points allowed by the Pacers this season.\n\nUP NEXT\n\nRockets: Host Toronto on Tuesday night.\n\nPacers: At Memphis on Wednesday night.\n\n---\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "DoubleDouble",
    "TripleDouble",
    "CoachComment",
    "Rivalry"
  ],
  "regime_output": {
    "Performance": "Surge",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:57.989984",
  "pipeline_version": "v1"
}