{
  "game_id": "0021700604",
  "espn_id": "400975350",
  "date": "Jan 10, 2018",
  "matchup": "MIA @ IND",
  "headline": "Miami fights off fatigue, Pacers to hold on for 114-106 win",
  "cleaned_body": "INDIANAPOLIS --  Miami found out an eight-man rotation might be just as effective as a full bench.\n\nSometimes, it can even be better.\n\nGoran Dragic scored 20 points and backup Wayne Ellington made the decisive 3-pointer with 25.5 seconds left Wednesday night to help the Heat fend off a late charge to hold on for a rare 114-106 victory at Indiana.\n\n\"None of these wins are going to come easy, but I think it just says a lot about how tough we are,\" Josh Richardson said after scoring 14 points and shooting 3 of 4 from 3-point range. \"Every night, we have to scratch and claw for everything and it's paying off.\"\n\nThis game might have been their most impressive yet.\n\nWith four players sitting out because of injuries, Tyler Johnson not expected to dress and James Johnson suspended by the league for throwing punches in a victory over Toronto, the Heat showed up at Bankers Life Fieldhouse expecting only seven players to be available for their second road game in two nights.\n\nTyler Johnson, it turns out, managed to play through a sprained left shoulder giving coach Erik Spoelstra one more body to divvy up the minutes.\n\nAnd he needed every one.\n\nEllington, Johnson and Bam Adebayo all played more than 30 minutes, all scored 15 points off the bench and all made key plays throughout the game as Miami won its sixth in a row and snapped a 10-game road losing streak against the Pacers.\n\nHassan Whiteside added 16 points and 15 rebounds.\n\n\"We knew it was going to be tough here. (Indiana) plays extremely well at home,\" Spoelstra said. \"They're athletic. They have great team speed. It wasn't a perfect game by any means, but it was probably a little bit more to our pace and our liking.\"\n\nIt was good enough to fend off the hard-charging Pacers, who had won their previous two games.\n\nVictor Oladipo had 26 points, seven rebounds and four assists and Lance Stephenson gave Indiana a late boost of energy that nearly led Indiana back from a 10-point deficit in the final 9:57. Stephenson wound up with 15 points, eight rebounds and four assists.\n\nMiami showed no sign of fatigue early, shooting better than 60 percent for most of the first two quarters and took a 58-47 lead at halftime.\n\nAnd when Indiana used a 14-2 run to get within 65-63, the Heat fought through the weariness again.\n\nIndiana blew its first chance to tie the score, or take the lead, when Al Jefferson drew an offensive foul late in the third. The Heat then retook an 84-78 lead after three and extended the margin to 90-80 early in the fourth on a basket by Adebayo.\n\nThat's when the Pacers turned it on. They scored six straight to make it 92-89 and used another 6-0 spurt to finally tie it at 97 on Stephenson's 18-footer with 5:09 left.\n\nBut Miami broke the tie on Johnson's 3 and put it away when Ellington's shot dropped in for to make it 109-103.\n\n\"They hit some tough shots,\" Oladipo said. \"They've been hitting tough shots every win, the last three or four wins, down to wire and they executed again. Credit them, they did a great job.\"\n\nTIP-INS\n\nHeat: Dragic also finished with nine assists. ... Miami has won 13 consecutive games in January including last season, the longest active streak in the league. ... The home team had won 18 of the previous 20 regular-season games in this series.\n\nPacers: Missed their first 10 3s and wound up 1 of 18 from beyond the arc. Indiana also went 19 of 29 from the free-throw line. ... Thaddeus Young had 12 points and nine rebounds. ... Domantas Sabonis had 18 points and seven rebounds after replacing Myles Turner in the starting lineup.\n\nTURNER OUT\n\nTurner injured his right elbow Monday night after making a dunk in the victory over Milwaukee.\n\nThe team announced he wouldn't play Wednesday morning and said he would miss at least one more game as he continues to be evaluated. He showed up in street clothes and wore a protective brace over his sport coat on the bench. Turner was averaging 2.24 blocks per game, second in the league.\n\n\"We'll get more information after Friday's game,\" coach Nate McMillan said.\n\nUP NEXT\n\nHeat: Return home to face Milwaukee on Sunday.\n\nPacers: Are seeking their third straight win against Cleveland this season when the Cavaliers come to town Friday.\n\n--\n\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "InjuryReport",
    "ThreePointExplosion",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:51.144704",
  "pipeline_version": "v1"
}