{
  "game_id": "0021700916",
  "espn_id": "400975662",
  "date": "Feb 28, 2018",
  "matchup": "CHA @ BOS",
  "headline": "Irving scores 34 for Boston in 134-106 win over Hornets",
  "cleaned_body": "BOSTON --  The Boston Celtics needed all of 12 seconds to take the lead over Charlotte and continued to pull away from the Hornets over the next 47 minutes.\n\nThe Celtics improved to 4-0 since the All-Star break with a 134-106 rout of the Hornets on Wednesday night, setting a season high for points and finishing with their best shooting percentage in more than four years.\n\n\"I thought we played with force. I thought we executed well. But that was just one of those nights where you had great, great shot-making,\" Boston coach Brad Stevens said.\n\nThe Celtics made 54 of 87 shots (62.1 percent), their best shooting performance since hitting 60 percent against Orlando on Nov. 11, 2013.\n\nKyrie Irving led Boston with 34 points, making 13 of 18 shots overall and going 4-for-6 from 3-point range in the first three quarters. He and the rest of Boston's starters let the Celtics' reserves take it from there.\n\nAfter riding a three-game skid into the All-Star break, the Celtics surged through the end of February and averaged 119 points while winning four straight.\n\n\"I think that for the first few games we've done a great job of responding,\" Irving said. \"And we just want to keep it up because the season definitely doesn't end tomorrow.\"\n\nAron Baynes had 12 points and 10 rebounds and Jaylen Brown scored 15, including nine in the third quarter as the Celtics turned the game into a blowout. Terry Rozier and Greg Monroe scored 14 points apiece for the Celtics, who had seven players score in double figures.\n\n\"That's what we want to see. Offensively we want to continue making the right play,\" Brown said. \"That's one of the things Brad preaches about -- make the right play -- regardless of the score. Seven guys in double figures is a testament to that.\"\n\nKemba Walker made his first eight shots and led Charlotte with 23 points. Dwight Howard had 21 points for the Hornets, who were coming off a victory over Chicago on Tuesday night and couldn't keep up with the Celtics after halftime.\n\n\"That's a product of how we started the game. We've got to do a better job of starting and making sure we don't allow guys to get in a rhythm early,\" Howard said. \"We didn't start the second half the right way. We started it like we did in the first half. They capitalized on it and they didn't look back.\"\n\nBoston led 67-59 at halftime and opened the third quarter on a 12-3 run, followed by an 8-0 spurt a few minutes later as the Hornets continued to wilt.\n\n\"What we got was what we deserved. Our defense was embarrassing,\" coach Steve Clifford said. \"The things that have made us the Hornets over the years ... none of it was there.\"\n\nCharlotte didn't have much luck, either, in the third period. Irving barely beat the shot-clock buzzer with a turnaround jumper that put Boston up 86-67 with 6:29 left in the third, and bounces continued to fall for the Celtics.\n\nBrown missed an opportunity for a three-point play with 4:45 left in the third, but got a second chance at the free throw when Charlotte was called for a lane violation. Brown hit the second attempt and Boston's lead was 94-67.\n\nANOTHER HUNDRED\n\nThe Celtics reached 100 points with nearly two minutes still left in the third quarter and didn't let up in the fourth, when the reserves for both teams played the last 12 minutes.\n\nBoston was shooting 62 percent at the end of the third quarter and maintained that percentage in the fourth. The Celtics easily topped their previous season high of 124 points, recorded against Denver on Dec. 13.\n\n\"Obviously, when shots go in everything feels a lot better,\" Stevens said. \"We're also just getting a lot more comfortable playing together and that sometimes takes a little bit of time.\"\n\nTHIRTYSOMETHING\n\nIrving has scored 30 or more points three times in the last five games and 18 times this season.\n\nHoward said Irving -- who scored 16 in the first quarter -- had it too easy against the Hornets' soft defense.\n\n\"Our effort from the beginning wasn't where we needed it to be,\" Howard said. \"They came out and hit some big shots and they led the whole game.\"\n\nTIP-INS\n\nHornets: Entered the game on their longest winning streak since winning seven straight in March of 2016. ... Charlotte's last four wins have all been by 15 points or more, including Tuesday night's 118-103 home victory over Chicago. ... Walker scored 11 of Charlotte's first 13 points. ... Frank Kaminsky scored 16 points, Michael Carter-Williams scored 14 and Jeremy Lamb added 10 points for the Hornets.\n\nCeltics: Improved to 32-8 when scoring 100 points or more this season. ... Boston led 37-31 after the first quarter and out-rebounded the Hornets 14-7 in the opening period. ... F Daniel Theis was out with a sore right hamstring. ... Marcus Morris scored 15 and Marcus Smart had 10 points.\n\nUP NEXT\n\nHornets: At Philadelphia on Friday.\n\nCeltics: At Houston on Saturday night.\n\n---\n\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
  "tags_rule": [
    "Streak",
    "CoachComment"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "Standard",
    "Health": "Stable",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:52.252007",
  "pipeline_version": "v1"
}