{
  "game_id": "0021400062",
  "espn_id": "400578354",
  "date": "Nov 05, 2014",
  "matchup": "CHI @ MIL",
  "headline": "Bulls pull away down stretch to beat Bucks in Derrick Rose's return",
  "cleaned_body": "MILWAUKEE -- Now there's a sight to calm the jittery nerves of Chicago Bulls fans: Derrick Rose on the court instead of on the injury report.\nRose returned from his latest injury and helped the Bulls continue to make themselves at home in Milwaukee with a 95-86 win over the Bucks on Wednesday night.\n\"I was trying to play,\" Rose said. \"Of course I wasn't 100 percent tonight. But I felt like we needed this win, and just tried to come out here and do anything it takes to get this win with my teammates.\"\nTaj Gibson scored 23 points, Pau Gasol added 22, and Rose had 13 points and seven assists in 32 minutes for the Bulls, who have beaten the Bucks nine straight times in Milwaukee.\n\nRose, who missed most of the previous two seasons because of serious knee injuries, sat out the Bulls' previous two games with sprains in both ankles.\n\"I just wanted to make sure he was comfortable out there,\" Bulls coach Tom Thibodeau said. \"He got through it, which is a good sign. Hopefully, we can go from there.\"\nGiannis Antetokounmpo had 13 points and eight rebounds for the Bucks.\nBucks coach Jason Kidd noted that his team's energy seemed to sag in the second half, and it showed on the scoreboard -- the Bucks scored only 33 points in the final two quarters.\n\"We're a young team,\" Kidd said. \"Guys are getting better. A lot of this is going to be watching tape, understanding the mistakes that we make. They're very simple ones that we can clean up.\"\nWith Chicago leading by one, Gasol hit a jumper and Jimmy Butler made an acrobatic layup. That started a clinching 9-2 run that was capped by Kirk Hinrich's 3-pointer with 2:16 remaining.\nRose's playing status was unclear even a few hours before first tip Wednesday, as Thibodeau said Rose would be evaluated after he went through pregame warm-ups. He was announced as a starter shortly before tipoff.\nAfter a tentative start, Rose began to look more like himself late in the first half, driving for a pair of layups in the final three minutes of the second quarter.\n\"It makes a lot of things easier,\" Butler said of Rose's return. \"He is passing the ball great, he is guarding and he is scoring the ball just like he has always done. It is great to have our leader back.\"\nRose was serenaded with \"MVP!\" chants from a large and loud contingent of Bulls fans near the end of the game.\n\"It was great,\" Gibson said. \"He told us, 'Just keep fighting;' he said, 'I will give it my all in the fourth.' That is what he did. He turned it on in the fourth, he set up good plays.\"\nTIP-INS\nThe Bulls: The Bulls were still without center Joakim Noah, who missed his second straight game because of illness. Noah was expected to travel to Milwaukee to rejoin the team after missing Tuesday's game against Orlando. ... Butler had three steals in a stretch of less than four minutes in the third quarter.\nThe Bucks: Antetokounmpo fired up the crowd with a thunderous two-handed dunk in transition late in the second quarter, set up by a blocked shot by Larry Sanders and a no-look lob from Brandon Knight.\nUP NEXT\nBulls: Play at Philadelphia on Friday.\nBucks: Play at Detroit on Friday.\nKEEP CALM AND DERRICK ON\nPerhaps seeking to calm fears about Rose's recent injury history, Thibodeau said before the game that fans shouldn't read too much into the ankle sprains. \"He's got to play,\" Thibodeau said. \"And he's done a good job of getting himself ready, he's handled everything well.\"\nDEBRIS CAUTION\nAfter officials called back-to-back offensive fouls on the Bucks during a critical stretch of the fourth quarter, the public address announcer had to ask irate fans to refrain from throwing objects on the court. Kidd didn't seem overly annoyed with the calls, chalking them up as a learning experience for his young team.\nPARKER'S PROGRESS\nBucks rookie Jabari Parker struggled, scoring eight points on 4-for-12 shooting. He did have six rebounds. \"So far, I just need to improve,\" Parker said. \"No more excuses. I'm five games in, so I've just got to get better from here.\"\nBACK TO SCHOOL\nButler returned to his alma mater, Marquette University in downtown Milwaukee, to finally pick up his diploma earlier in the day Wednesday.\n\"I had it since I graduated, but I just never went and picked it up,\" Butler said. \"Today I went and picked it up. It feels good to have it. I'm going to get my master's soon.\"",
  "tags_rule": [
    "ReturnFromInjury",
    "InjuryReport",
    "CoachComment",
    "PlayoffContext"
  ],
  "regime_output": {
    "Performance": "Plateau",
    "Momentum": "Stable",
    "Narrative": "HighStakes",
    "Health": "InjuryRisk",
    "Tactical": "Standard",
    "Variance": "Low"
  },
  "processed_at": "2025-12-06T13:04:58.967314",
  "pipeline_version": "v1"
}