{"game_id": "0021400460", "chunk_id": "0021400460_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- Jimmy Butler is finding ways to show what kind of threat he can be for the Chicago Bulls.\nAnd he's finding ways to cause problems for the Indiana Pacers.\nButler had 27 points and nine rebounds to lead the Chicago Bulls to a 92-90 victory over the Indiana Pacers on Monday night.\nIt was Butler's 3-pointer with 1:07 remaining that put the Bulls ahead for good -- his first career winning basket in the final two minutes of the fourth quarter in a regular-season NBA game, according to Elias Sports Bureau research."}
{"game_id": "0021400460", "chunk_id": "0021400460_002", "order": 2, "role": "closing", "text": "\"Derrick [Rose] is always on me to shoot and to shoot 3s and be aggressive,\" he said. \"I'm confident in my game, so I feel like I have to step up and take and make shots late.\"\nPau Gasol had 20 points and Rose added 17 for the Bulls (22-9), who extended the team's season-best winning streak to seven straight.\nChris Copeland scored 13 of his 17 points in the fourth quarter, and George Hill and C.J. Miles each added 11 points for the Pacers (11-21), who trailed by 21 points in the second half.\nThe Bulls seemed to have put the game away when Mike Dunleavy converted a 3-point play to put the Bulls ahead 75-54 with 2:33 left in the third quarter. But the Pacers went on a 23-2 run and regained the lead on Lavoy Allen's basket to make it 84-83 with 6:15 left in the fourth quarter.\n\"It's a different thing, executing in the final four minutes of a game than the first 44 minutes of the game,\" Pacers coach Frank Vogel said. \"We had some poor possession on the offensive end. We were getting some stops, we just fell short.\"\nChicago tied the four-game season series with the Pacers at 1-1 and won for the first time at Indiana after losing the previous four games.\nButler, who scored 32 points in a 99-90 loss to Indiana back on Nov. 15, gave Chicago all the momentum it needed.\nHe had two put-back dunks midway through the third quarter in a 6-2 run, including one with 7:24 remaining in the third to give the Bulls a 59-41 lead.\nButler also scored on a one-handed dunk at the buzzer to give Chicago a 47-35 halftime lead.\n\"The lesson we learned is you have to keep playing,\" Bulls coach Tom Thibodeau said. \"No lead is safe in this league.\"\nThe two teams play the remaining two games of the series in March with each team hosting a game.\nThe Bulls, who lead the Central Division, have put up big offensive numbers lately and scored under 100 points for just the second time in the past seven games.\nTIP-INS\nBulls: Guard Kirk Hinrich has missed four straight games with a left hamstring strain. Thibodeau said Hinrich participated in the morning shootaround at Indiana and could return to the lineup as early as Tuesday against Brooklyn.\nPacers: Indiana shot under 50 percent for the first time after shooting above that mark in the previous four games. The Pacers didn't reach that mark in the first 27 games of the regular season.\nSMASH-MOUTH DEFENSE\nVogel said he wants Indiana to play defense the way the team has been known to in recent years. The Pacers, who are No. 2 in the NBA in scoring defense, held the Bulls to 34.5 percent shooting. Chicago's 11 points in the fourth quarter were the fewest scored by the Bulls this season and the fewest allowed by the Pacers.\nTOUGH CROWD\nMonday's game was a sellout, and Chicago fans made up much of the crowd. During lineup introductions, cheers for the Bulls drowned out boos from Pacers fans. Allen missed a shot early in the second quarter that didn't even reach the rim, and many Bulls fans responded with the \"air ball, air ball\" chant, taking away the home-court feel for the Pacers. Chicago's United Center is a little more than a three-hour drive from Indiana's Bankers Life Fieldhouse.\nUP NEXT\nBulls: Host Brooklyn on Tuesday.\nPacers: Host Miami on Wednesday."}
