{"game_id": "0021300757", "chunk_id": "0021300757_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- Joakim Noah played the final 6:53 with five fouls. Chicago coach Tom Thibodeau didn't want to take him out with the Bulls' double-digit lead slipping away, and that's just the way the All-Star center wanted it.\nNoah finished with 18 points and 13 rebounds, and the Bulls held off the stubborn Los Angeles Lakers 92-86 on Sunday after nearly blowing a 19-point advantage. After picking up his last foul, Noah made a key block against 7-footer Chris Kaman and got a dunk at the other end -- all in a 16-second span.\n\"It was too tight. Either we were going to win it with him, or that was going to be it,\" Thibodeau said. \"At that point, I didn't think we could afford two or three minutes (with Noah on the bench), so we rolled the dice and were fortunate. We're a little short-handed right now -- and the way they spread you out on the perimeter, you need guys that can cover ground.\""}
{"game_id": "0021300757", "chunk_id": "0021300757_002", "order": 2, "role": "closing", "text": "Kirk Hinrich had 19 points and Taj Gibson added 18 for the Bulls, who never trailed against an injury-ravaged Lakers squad missing Kobe Bryant, Pau Gasol, Jordan Farmar, Nick Young, Jodie Meeks and Xavier Henry. Gasol, who had a season-high 19 rebounds the previous time the teams met, missed his fourth straight game because of a groin strain.\nKaman scored a season-high 27 points off the bench for the Lakers, who won their previous two games following a 3-19 slide that buried them in the race for a Western Conference playoff spot. The 11-year veteran's point total was two off his career high, which came on Feb. 13, 2012, when he was playing for New Orleans against Dallas.\n\"He's been in the league for a long time, and he's one of the most skilled big men I've ever seen ever since I was in high school,\" Gibson said. \"He has both left and right-hand hooks, a mid-range game -- and once he's in a rhythm like he was today, it's really hard to stop him.\"\nPoint guard Steve Nash, playing his third game after missing 39 because of a nerve problem in his back, had eight points in 21-plus minutes before departing with 5 minutes left in the third quarter because of irritation in his left leg.\nThe 18-year veteran and two-time MVP, who celebrated his 40th birthday Friday with a team-high 19 points in a victory at Philadelphia, was hit on the same leg he fractured last season.\n\"It was just getting worse lately,\" Nash said. \"But I wanted to play, especially when we are losing. You want to try to fight through it. I've been through that before and I know where it goes, so I didn't want to risk it. I think it was the smartest decision to come out.\"\nGibson, whose buzzer-beating layup in overtime gave the Bulls a 102-100 victory over the Lakers on Jan. 20 at Chicago, led the Bulls to a 52-46 halftime lead with 16 points. He made his seventh start of the season as Carlos Boozer missed his second straight game with a left calf strain.\nThe Bulls, who finished their trip 3-3, opened with a 10-0 run while the Lakers missed their first six shots -- including an airball by Wesley Johnson on a 3-point try from 27 feet. Chicago's starters outscored Los Angeles' starters 73-24.\n\"We wanted to throw the first punch,\" Noah said. \"We started off the game just going to Taj and he set the tone for us in the post.\"\nGibson's reverse layup increased the Bulls' margin to 15 before Los Angeles scored the next 12 points to slice the deficit to 42-39 with 5:55 left in the second quarter. But Chicago built its lead back up to 72-53, its biggest of the game, with a 15-5 run capped by Hinrich's 3-pointer with 3 1/2 minutes left in the third.\nDown by 13 with 6:37 to play, the Lakers narrowed the gap to 88-84 after Steve Blake stole the ball from Hinrich and Kaman fed Johnson for a slam dunk that capped a 13-4 run with 48.3 seconds left. But D.J. Augustin, who had 15 points off the bench, sank four free throws in the final 21 seconds to help seal the victory.\nThe Bulls are 15-5 in games they've led by at least 15 points. Thursday night, they blew a 16-point lead at Golden State and lost 102-87.\n\"It was very important to close this one out, being the last game of the trip,\" Hinrich said. \"That's something we have to work on -- keeping our foot on the gas pedal and not relaxing. We didn't do that today, but we'll definitely take the win.\"\nChicago is 19-20 since star-crossed All-Star Derrick Rose went down with his second major knee injury in three seasons.\n\"The whole time I've been here we've had some real tough injuries and we've always been at the egde, but we always crawl and fight our way back. That's our mindset,\" Gibson said. \"We've got young guys, new guys, and they believe in the same thing. We believe we've got a shot at the playoffs. We believe in each other. And that shows by the way we play.\"\nGame notes\nKaman's point total was two off his career high. ... The Bulls' starters outscored the Lakers starters 73-24. ... Chicago is 19-20 since G Derrick Rose went down with his second major knee injury in three seasons. He has played only 49 games since the start of the 2011-12. ... The Lakers have used 25 different starting lineups and the Bulls have used 18."}
