{"game_id": "0021200107", "chunk_id": "0021200107_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- Modest and unassuming off the court, Damian Lillard has no problem taking charge when placed in a leadership role for the Portland Trail Blazers."}
{"game_id": "0021200107", "chunk_id": "0021200107_002", "order": 2, "role": "body", "text": "The rookie point guard led the way Tuesday night in a game the Blazers needed badly for morale purposes. Lillard had 22 points and nine assists to help Portland stop a four-game losing streak with a 103-86 victory over the short-handed Sacramento Kings."}
{"game_id": "0021200107", "chunk_id": "0021200107_003", "order": 3, "role": "body", "text": "\"We had lost four games, so this one was really important,\" Lillard said. \"It felt like a game we had to win.\""}
{"game_id": "0021200107", "chunk_id": "0021200107_004", "order": 4, "role": "body", "text": "Even though Lillard had a strong pre-draft workout for Sacramento, Thomas Robinson was chosen by the Kings at No. 5 overall and Lillard went to Portland as the sixth pick. Nicolas Batum is grateful Lillard was still available."}
{"game_id": "0021200107", "chunk_id": "0021200107_005", "order": 5, "role": "body", "text": "\"Damian is the perfect fit for us,\" said Batum, who had 15 points, seven rebounds and five assists. \"He knows how to play and already plays like a veteran. He scores, he passes, he attacks and he plays defense.\""}
{"game_id": "0021200107", "chunk_id": "0021200107_006", "order": 6, "role": "body", "text": "Against the Kings, patience in making the right play and taking the appropriate shot were the most noticeable aspects of Lillard's game. He shot 7-of-10 from the field, including 5-of-6 on 3-pointers."}
{"game_id": "0021200107", "chunk_id": "0021200107_007", "order": 7, "role": "body", "text": "\"Last game I didn't shoot the ball so well, but I took the same shots. They just fell tonight,\" Lillard said. \"I'm really comfortable. I have to give a lot of credit to them (his teammates) for allowing me to be comfortable because they've been in the league a few years.\""}
{"game_id": "0021200107", "chunk_id": "0021200107_008", "order": 8, "role": "body", "text": "Portland used a strong third quarter to build its lead to 16 points and pushed the cushion to 22 early in the fourth. The Blazers outrebounded the Kings 44-33 and connected on 14 of 27 attempts from 3-point range."}
{"game_id": "0021200107", "chunk_id": "0021200107_009", "order": 9, "role": "body", "text": "\"This is a team that can make 3s. They take a lot of 3s,\" Kings coach Keith Smart said. \"If they're hot and making shots, you're going to have a tough cover.\""}
{"game_id": "0021200107", "chunk_id": "0021200107_010", "order": 10, "role": "body", "text": "LaMarcus Aldridge scored 19 points for Portland, and Wesley Matthews had 18. J.J. Hickson added 10 points and 13 rebounds."}
{"game_id": "0021200107", "chunk_id": "0021200107_011", "order": 11, "role": "body", "text": "James Johnson scored 16 and Marcus Thornton 14 for the Kings, who dropped their third straight. Jimmer Fredette had 13 points and a career-high six assists, while Robinson scored 12."}
{"game_id": "0021200107", "chunk_id": "0021200107_012", "order": 12, "role": "body", "text": "The Kings played their second consecutive game without leading scorer and rebounder DeMarcus Cousins, suspended following a verbal altercation last week with San Antonio Spurs television announcer Sean Elliott. Cousins lost an appeal Tuesday to reduce the suspension to one game."}
{"game_id": "0021200107", "chunk_id": "0021200107_013", "order": 13, "role": "body", "text": "It didn't help that the Kings were further depleted, missing starting point guard Isaiah Thomas and backup Aaron Brooks, who injured his left ankle in the first quarter and didn't return."}
{"game_id": "0021200107", "chunk_id": "0021200107_014", "order": 14, "role": "body", "text": "A rookie from Weber State, Lillard has scored 20 points or more in five of Portland's eight games."}
{"game_id": "0021200107", "chunk_id": "0021200107_015", "order": 15, "role": "body", "text": "\"In college he was an aggressive player who was a high-volume scorer,\" Fredette said. \"He's doing that here in this league as well. His game is translating very well to the NBA.\""}
{"game_id": "0021200107", "chunk_id": "0021200107_016", "order": 16, "role": "body", "text": "Portland opened the fourth quarter by outscoring the Kings 8-2, hiking its lead to 22 points on a pair of free throws by Matthews. The margin was never fewer than 17 the rest of the game."}
{"game_id": "0021200107", "chunk_id": "0021200107_017", "order": 17, "role": "body", "text": "Lillard continued to shoot well in the third quarter following a productive first half. He made all three shots, including a pair of 3s, and had eight points in the third for the Blazers, who outscored Sacramento 28-16 to assume a 74-58 lead heading into the fourth."}
{"game_id": "0021200107", "chunk_id": "0021200107_018", "order": 18, "role": "body", "text": "\"Except for the beginning of the second half, it was a complete game,\" Portland coach Terry Stotts said. \"We got off to a good start in the first half and we did a lot of good things defensively. We moved the ball. It wasn't 48 minutes. But after we gave up those five easy baskets in the second half, we tightened things down and did a nice job defensively, and we were able to get out and run.\""}
{"game_id": "0021200107", "chunk_id": "0021200107_019", "order": 19, "role": "body", "text": "Trailing by four, the Blazers took control with a 19-2 run over a five-minute stretch in the third quarter. Batum had seven points, including a corner 3 that capped the spurt and put Portland in front 69-56 with 2:12 left."}
{"game_id": "0021200107", "chunk_id": "0021200107_020", "order": 20, "role": "body", "text": "Lillard got going early with a pair of 3-pointers in the first quarter and had 14 points at halftime, helping the Blazers to a 46-42 lead. Fredette had 10 points and four assists for the Kings."}
{"game_id": "0021200107", "chunk_id": "0021200107_021", "order": 21, "role": "closing", "text": "Game notes Portland was 6-of-13 on 3-pointers in the first half and added four more in the third quarter. ... Thomas left the team following news that his grandmother had died. ... Portland reserves have been outscored 135-29. The Kings had 46 bench points to 19 for the Blazers. ... Robinson was back on the court after a two-game suspension for a vicious elbow to the throat of Detroit's Jonas Jerebko."}
