{"game_id": "0021400026", "chunk_id": "0021400026_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- Blake Griffin used a banking analogy to describe his dominant performance against the Lakers on Friday night. And most of the time the Clippers got the ball to him, he was right on the money.\nGriffin scored 39 points and went 11-for-12 from the free throw line, powering the Clippers to a gritty 118-111 victory over the winless Lakers in the first meeting of the season between the Staples Center co-tenants."}
{"game_id": "0021400026", "chunk_id": "0021400026_002", "order": 2, "role": "body", "text": "\"Just carrying over from last year, and all the work I put in this summer, it's confidence-building,\" Griffin said. \"I mean, when you've deposited a lot of money, you feel good about writing checks. And that's kind of what I'm doing now. I've put the time in on this, but I still have to do the same things that make us successful.\"\nDeAndre Jordan had 11 points and 13 rebounds during a foul-plagued 39 minutes. The two-time defending Pacific Division champions have won eight of nine against the Lakers since the start of the 2012-13 campaign, including victories by margins of 36, 48 and 23 points in the final three meetings last season.\nChris Paul had 12 points, 10 assists and two steals for the Clippers.\nJordan Hill scored 13 of his 21 points in the third quarter, and Kobe Bryant had 21 but cost the Lakers down the stretch with his cold shooting.\n\"I just tried to make it as tough as possible on him,\" Paul said. \"If you can't get excited about trying to defend against him, then you're in the wrong business.\"\nAfter stumbling out of the blocks with an 18-point loss to Houston and a 20-point defeat at Phoenix, the injury-riddled Lakers are 0-3 for the fourth time since the franchise left Minneapolis. They also lost their first three games in 2012-13, as well as in 1978-79 and 1960-61 -- their first season in Los Angeles.\nJordan picked up his fifth foul with 6:23 remaining and the Clippers trailing 101-99. Griffin's two free throws tied it for the third time in the quarter at 103 before Jeremy Lin beat the shot clock with a 3-pointer over Paul from the right sideline to give Lakers their last lead.\nLin finished with 17 points and nine assists."}
{"game_id": "0021400026", "chunk_id": "0021400026_003", "order": 3, "role": "closing", "text": "\"We talked through some things and tried to open it up a little bit tonight,\" Lin said. \"We tried to get everything moving and the ball popping. We learned to trust each other more. We're growing and figuring out to trust each other the right way. Just trying to create and attack and make as many plays as possible.\"\nJamal Crawford, last season's sixth man of the year, had 22 points off the bench -- including a 3-pointer that gave the Clippers the lead for good at 112-109 with 1:37 left. J.J. Redick put it away with four free throws in the final 15 seconds.\nStarting forward Wesley Johnson, 0-for-5 in the first half, made a 3 on his first shot of the third quarter, and Hill put the Lakers ahead 62-61 on a layup with 10:01 left in the period after they trailed by 15 points with less than four minutes to go in the first.\n\"It was just a lack of effort on our part, I thought,\" Griffin said. \"We just got complacent -- myself, everybody. We didn't have a sense of urgency and then had to push that 'go' button, so to speak. We let our guard down, and we just can't do that.\"\nGriffin led the Clippers to a 62-56 halftime lead with 18 points on 8-for-13 shooting, after missing his first six shots in Thursday's 93-90 win over Oklahoma City. His first 3-pointer of the season gave them a 25-12 lead with 4:34 left in the first. The Lakers sliced a 13-point deficit to 45-42 with an 11-1 spurt capped by Bryant's 3-pointer with 4:31 left in the half.\nQUOTE OF THE NIGHT\n\"It's just another game. I don't consider Lakers and Clippers a true rivalry yet,\" Lakers coach Byron Scott said before the game. \"Obviously, our biggest rivalry has always been the Celtics. They've got 17 banners; we've got 16 banners. That's a rivalry.\"\nTWIST OF FATE\nScott was drafted fourth overall by the San Diego Clippers, who traded his rights to the Lakers in October 1983 as part of a multiplayer deal for Norm Nixon. Scott went on to win three NBA titles with the Lakers.\nTIP-INS\nClippers: Griffin was 12-for-44 from 3-point range last season. ... Paul had 42 points, 15 rebounds and six assists against Golden State last Halloween.\nLakers: Bryant helped Paul to his feet after knocking him down in the second quarter. ... The Lakers Band made a rare appearance on the court to play the national anthem. Team president Jeanie Buss high-fived each member as they walked off. ... Johnson had five points in 30 minutes before fouling out with 4:22 remaining.\nUP NEXT\nClippers: Host Sacramento on Sunday.\nLakers: Play at Golden State on Saturday night."}
