{"game_id": "0021300893", "chunk_id": "0021300893_001", "order": 1, "role": "lead", "text": "MIAMI -- Best player. Best game of his career.\nLeBron James clearly isn't ready to concede his MVP award to anyone yet.\nDazzling from inside and out, James put on the best scoring show of his NBA life Monday night, pouring in 61 points -- a career high and franchise record -- as the Miami Heat beat the Charlotte Bobcats 124-107. It was the eighth straight win for the two-time defending champions, who are starting to roll as the playoffs get near."}
{"game_id": "0021300893", "chunk_id": "0021300893_002", "order": 2, "role": "body", "text": "James made 22 of 33 shots from the field, including his first eight 3-point attempts.\n\"The man above has given me some unbelievable abilities to play the game of basketball,\" James said. \"I just try to take advantage of it every night. I got the trust of my teammates and my coaching staff to go in there and let it go.\"\nHis career best had been 56 points, on March 20, 2005, for Cleveland against Toronto. Glen Rice scored 56 to set the Heat record on April 15, 1995, against Orlando.\nJames had 24 points at halftime, then added 25 in the third quarter. The record-breaker came with 5:46 left, when James spun through three defenders for a layup that fell as he tumbled to the court.\n\"There was an efficiency to what he was doing,\" Heat coach Erik Spoelstra said. \"The rim looked like an ocean for him.\"\nSpoelstra walked into his postgame news conference with a confession: He nearly took James out after the third quarter.\nGood thing he thought better of that plan.\n\"He was in a great groove, obviously,\" Spoelstra said.\nAl Jefferson had 38 points and 19 rebounds for the Bobcats, his huge night merely an afterthought.\nThis was all about LeBron.\n\"You take away his 61 points,\" Jefferson said, \"and we still had a fighting chance there at the end.\"\nYes, even the Bobcats were marveling at James. He was hitting from everywhere, even a pull-up 3-pointer from about 30 feet -- Spoelstra joked it was from 40 -- late in the third quarter, as the crowd roared and the Heat bench jumped with joy.\n\"Yeah, that was a designed play,\" Spoelstra deadpanned. \"We've been working on that one for a while.\"\nThat was the moment, James said, when he knew he was in the midst of a special night.\n\"I felt pretty good in the first half but halftime can always kind of derail things and slow things up,\" James said. \"But I was able to get things going once again in the third quarter and I knew it could be one of those nights.\""}
{"game_id": "0021300893", "chunk_id": "0021300893_003", "order": 3, "role": "closing", "text": "Not \"one of those nights.\"\nEven for James, this was like no other.\nMost points in a game. Most field goals in a game. Most points in any quarter in Heat history, with the 25 in the third. Most points in the second half, 37, by any Heat player ever.\n\"Once he sniffed 60, we knew he was going for it,\" Heat forward Shane Battier said. \"And the amazing part is the efficiency. Good Lord. Sixty-one on 33 shots, that's Wilt Chamberlain-esque. That's pretty amazing. Incredible performance.\"\nWhen James checked out with 1:24 left, the entire Heat roster met him near midcourt for high-fives and hugs, and the sellout crowd gave him a standing ovation. A second huge roar followed when he waved to the crowd, as \"M-V-P\" chants rained down.\nCharlotte has allowed the two biggest single-game scoring totals in the NBA this season. Carmelo Anthony had 62 points for the New York Knicks against the Bobcats on Jan. 24.\nChris Bosh scored 15 for the Heat, and Toney Douglas added 10.\nChris Douglas-Roberts and Anthony Tolliver each scored 12 for Charlotte.\n\"If he's going to shoot the ball like that from that range, there's nobody that's going to beat them,\" Bobcats coach Steve Clifford said.\nMiami was without guard Dwyane Wade, who got a night off to rest. Spoelstra stressed there's been no setback for Wade, who has been on a knee-maintenance program throughout this season and is averaging 23.5 points on 62 percent shooting since the All-Star break.\nWade probably didn't mind sitting for this one. It gave him a courtside seat for the show.\nJames scored 11 in the first quarter, after which Miami led by three, and added 13 more in the second. His 24-point first half was the highest-scoring opening 24 minutes for the four-time MVP in nearly a year, helping stake the Heat to a 60-54 lead at the break.\nJefferson was up to 26 at that point. He didn't cool off much after halftime, either.\nIt just didn't matter.\nJames, said Clifford, \"was phenomenal.\"\nThere was no way Jefferson or anyone else was keeping up with James, who had to listen to critics in recent weeks say that Kevin Durant's scoring for Oklahoma City this season shifted the balance of MVP power.\nNot so fast.\n\"Every night I go on the floor I want to be the MVP, of this league, MVP of this team, MVP for me, myself and my family,\" James said. \"I've set a high standard and I have to live by that.\"\nJames made three 3-pointers in the first 7 minutes of the quarter -- he was 6 for 6 from beyond the arc at that point -- and when Charlotte bit on his head fake from the top of the key, James coolly found Douglas to set up another 3. A tip-in by James followed not long afterward and just like that, the lead was up to 83-63.\nCharlotte scored the next six points, but any notion that the game was slipping from Miami's control was quickly extinguished.\nJames scored the next six himself, a pair of three-point plays to restore the 20-point edge and give him 43 points, already a season high.\nAll that was left to see was what he'd finish with.\nThe answer was history.\n\"I was happy I was able to make a few plays to help us win,\" James said.\nGame notes\nSpoelstra won the Eastern Conference coach of the month award for February. Houston's Kevin McHale won in the Western Conference, and the Rockets host to Miami on Tuesday night. ... The Heat improved to 10-6 when Wade doesn't play. They're 33-8 when he does. ... Kemba Walker had eight assists for Charlotte. ... The Heat were 16 for 28 from beyond the arc."}
