{"game_id": "0021701155", "chunk_id": "0021701155_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  After a big first half, Buddy Hield struggled to score after the break. However, his persistence paid off in the end."}
{"game_id": "0021701155", "chunk_id": "0021701155_002", "order": 2, "role": "body", "text": "Hield scored 17 of his 19 points in the first two quarters, and then had a key steal and tiebreaking fast-break dunk with 37 seconds left to help the Sacramento Kings snap a four-game skid with an 84-83 victory over the Los Angeles Lakers on Sunday night."}
{"game_id": "0021701155", "chunk_id": "0021701155_003", "order": 3, "role": "body", "text": "\"As good as he was in the first half, he equally as unimpressive in the second half,\" Kings coach Dave Joerger said. \"But he stuck with it and did some other things. That's a credit to him. . I thought he gave us life all night long.\""}
{"game_id": "0021701155", "chunk_id": "0021701155_004", "order": 4, "role": "body", "text": "With the game tied at 80 late in fourth quarter, Hield stepped out of bounds with 54 seconds remaining. However, his steal and dunk 17 second later put the Kings ahead 82-80."}
{"game_id": "0021701155", "chunk_id": "0021701155_005", "order": 5, "role": "body", "text": "The Lakers turned the ball over again, which led to De'Aaron Fox making a floater for a four-point lead with 11 seconds to go. Los Angeles' Brook Lopez made a 3-pointer with 2 seconds remaining for the final margin."}
{"game_id": "0021701155", "chunk_id": "0021701155_006", "order": 6, "role": "body", "text": "Bodgan Bodganovic had 15 points, while Willie Cauley-Stein added 11 points and seven rebounds for the Kings, who were on the second night of a back-to-back. They lost to the Golden State Warriors on Saturday."}
{"game_id": "0021701155", "chunk_id": "0021701155_007", "order": 7, "role": "body", "text": "Julius Randle scored 19 points, while Kentavious Caldwell-Pope added 16 for Los Angeles, which has lost seven of nine."}
{"game_id": "0021701155", "chunk_id": "0021701155_008", "order": 8, "role": "body", "text": "\"The lesson learned is that we feel how frustrating it is to lose a game like that,\" Lakers coach Luke Walton said. \"That is a game we should win at home when we hold the opponent to 84 points. We didn't do a good job of taking it when we had our chance and we keep telling our guys, if you leave it up to the end of the game in the NBA, anything can happen.\""}
{"game_id": "0021701155", "chunk_id": "0021701155_009", "order": 9, "role": "body", "text": "The Kings scored seven straight points to start the fourth quarter and Cauley-Stein gave Sacramento a 77-74 lead on a dunk with 3:31 remaining."}
{"game_id": "0021701155", "chunk_id": "0021701155_010", "order": 10, "role": "body", "text": "Fox completed a three-point play for an 80-78 lead after the Lakers made four consecutive free throws to briefly regain the advantage."}
{"game_id": "0021701155", "chunk_id": "0021701155_011", "order": 11, "role": "body", "text": "Randle blocked JaKarr Simpson's layup and made a free throw at the other end to tie score at 80 with 1:08 left."}
{"game_id": "0021701155", "chunk_id": "0021701155_012", "order": 12, "role": "body", "text": "Nigel Hayes' 3 capped a 10-2 run that gave Sacramento a 60-58 lead with 2:34 remaining in the third. Los Angeles answered with consecutive 3s from Josh Hart and Channing Frye before the end of the period."}
{"game_id": "0021701155", "chunk_id": "0021701155_013", "order": 13, "role": "body", "text": "Despite shooting only 39 percent from the field in the first half, the Kings went into halftime tied with the Lakers at 43 after Fox made a 17-foot jump shot with 5.6 seconds remaining in the half."}
{"game_id": "0021701155", "chunk_id": "0021701155_014", "order": 14, "role": "body", "text": "Randle's second dunk of the first quarter put the Lakers up 14-13 with 4:08 left in the period. Los Angeles went on an 8-0 run to take a 22-16 lead."}
{"game_id": "0021701155", "chunk_id": "0021701155_016", "order": 16, "role": "body", "text": "Kings: Hayes played his first game for the Kings after the team signed him on Saturday. The Lakers signed him to a 10-day contract in mid-January, but did not re-sign him to another. ... Sacramento earned a split of the teams' four-game season series."}
{"game_id": "0021701155", "chunk_id": "0021701155_017", "order": 17, "role": "body", "text": "Lakers: Brandon Ingram was out after going into the NBA's concussion protocol on Saturday, one day after he hit his neck against Milwaukee. ... Alex Caruso started his first career game for the Lakers. ... Ivica Zubac had seven points and 10 rebounds in 18 minutes."}
{"game_id": "0021701155", "chunk_id": "0021701155_019", "order": 19, "role": "body", "text": "The Kings outscored the Lakers 37-19 in bench points, a statistic in which Los Angeles has excelled all season."}
{"game_id": "0021701155", "chunk_id": "0021701155_020", "order": 20, "role": "body", "text": "\"They were great for us,\" Fox said. \"A lot of the games that we win is because of our bench. Sometimes our starters haven't came out and played the way we were supposed to play. A lot of the times, they're able to pick us up.\""}
{"game_id": "0021701155", "chunk_id": "0021701155_021", "order": 21, "role": "body", "text": "Hield, who scored the majority of Sacramento's bench points, said the second unit always plays great, and tries to keep the game within reach so the starters can finish the game."}
{"game_id": "0021701155", "chunk_id": "0021701155_022", "order": 22, "role": "body", "text": "\"We have a lot of energy and we try to build off the (starters),\" Hield said. \"If they bring energy or not, we try to capitalize.\""}
{"game_id": "0021701155", "chunk_id": "0021701155_024", "order": 24, "role": "body", "text": "In addition to being without Ingram, the Lakers were also missing Lonzo Ball, who was out with a left knee contusion. Los Angeles had already lost Isaiah Thomas to a season-ending hip surgery in recent days."}
{"game_id": "0021701155", "chunk_id": "0021701155_025", "order": 25, "role": "body", "text": "Without Ingram and Ball, Kuzma said their abilities to make plays is what the Lakers could have used on Sunday."}
{"game_id": "0021701155", "chunk_id": "0021701155_026", "order": 26, "role": "body", "text": "\"Playmaking, that's the biggest thing,\" Kuzma said of how the team is adjusting without Ingram and Ball. \"Having Lonzo, he's a dynamic point guard. BI can play a little bit of that point forward role. We miss those guys in that respect.\""}
{"game_id": "0021701155", "chunk_id": "0021701155_028", "order": 28, "role": "body", "text": "Kings: At the Phoenix Suns on Tuesday night."}
{"game_id": "0021701155", "chunk_id": "0021701155_029", "order": 29, "role": "closing", "text": "Lakers: At the Utah Jazz on Tuesday night."}
