{"game_id": "0021700176", "chunk_id": "0021700176_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  D'Angelo Russell knew that the difference for Brooklyn against Portland's duo of Damian Lillard and CJ McCollum was going to be the defense."}
{"game_id": "0021700176", "chunk_id": "0021700176_002", "order": 2, "role": "body", "text": "\"Honestly, I think we played defense for all 48 minutes,\" he said. \"We had maybe a minute-and-a-half lapse. For 48 minutes, everybody played their part.\""}
{"game_id": "0021700176", "chunk_id": "0021700176_003", "order": 3, "role": "body", "text": "Russell had 21 points, including 11 in the fourth quarter, and the Nets snapped a four-game losing streak to the Blazers with a 101-97 victory Friday night. He also had nine assists."}
{"game_id": "0021700176", "chunk_id": "0021700176_004", "order": 4, "role": "body", "text": "DeMarre Carroll added 16 points and Allen Crabbe had 12 in his first trip back to Portland since he was traded to the Nets in the offseason."}
{"game_id": "0021700176", "chunk_id": "0021700176_005", "order": 5, "role": "body", "text": "Jusuf Nurkic led Portland with 21 points but played just under one minute in the fourth quarter, and Damian Lillard added 19."}
{"game_id": "0021700176", "chunk_id": "0021700176_006", "order": 6, "role": "body", "text": "The Nets led 77-70 to start the final quarter, but Portland pulled in front 86-84 on Evan Turner's jumper with 6:14 left.  After Russell's running 3-pointer for the Nets tied it at 89, he added a free throw and another basket to push Brooklyn's lead to 92-89."}
{"game_id": "0021700176", "chunk_id": "0021700176_007", "order": 7, "role": "body", "text": "Lillard gave the Blazers a brief 95-94 lead on a pull-up jumper with 2:36 left, but Brooklyn reclaimed it with Rondae Hollis-Jefferson's layup and padded it with Russell's jumper."}
{"game_id": "0021700176", "chunk_id": "0021700176_008", "order": 8, "role": "body", "text": "CJ McCollum's layup pulled Portland to 98-97 with 33 seconds left, but it was as close as the Blazers could get and Russell added a layup with 11.4 seconds to go that would all but seal it."}
{"game_id": "0021700176", "chunk_id": "0021700176_009", "order": 9, "role": "body", "text": "\"Not a good loss, not a good loss,\" said McCollum, who finished with 17. \"It's a game we should have won. No offense to the Brooklyn Nets, but that's a game we should have won.\""}
{"game_id": "0021700176", "chunk_id": "0021700176_010", "order": 10, "role": "body", "text": "Crabbe played for the Blazers from 2013-17. Well-liked by the local fans, he was greeted with warm applause during player introductions."}
{"game_id": "0021700176", "chunk_id": "0021700176_011", "order": 11, "role": "body", "text": "\"I feel like it was a great team effort. I think our defense tonight was on point where it needed to be,\" he said afterward. \"We made the stops that we needed to make and then we made the plays we needed to make on the offensive end.\""}
{"game_id": "0021700176", "chunk_id": "0021700176_012", "order": 12, "role": "body", "text": "Crabbe was traded to Brooklyn over the summer. He is among the young players the Nets hope to build around, but he was slowed at the start of the season by an ankle injury in camp."}
{"game_id": "0021700176", "chunk_id": "0021700176_013", "order": 13, "role": "body", "text": "The Nets have been hampered by injuries of late. Trevor Booker (back), Hollis-Jefferson (hip) and Jarret Allen (foot) were all sidelined for the last game, a 112-104 loss at Denver on Tuesday night.  Brooklyn has been without Jeremy Lin since the first game of the season because of a ruptured patellar tendon."}
{"game_id": "0021700176", "chunk_id": "0021700176_014", "order": 14, "role": "body", "text": "Hollis-Jefferson started Friday and had 11 points."}
{"game_id": "0021700176", "chunk_id": "0021700176_015", "order": 15, "role": "body", "text": "Pat Connaughton hit a 3-pointer at the buzzer to end the first quarter, giving the Blazers an early 28-21 lead. Portland stayed out in front through the half, leading 52-46 at the break."}
{"game_id": "0021700176", "chunk_id": "0021700176_016", "order": 16, "role": "body", "text": "Nurkic led all players with 15 points in the half. He did not speak to reporters after the game about his fourth-quarter absence."}
{"game_id": "0021700176", "chunk_id": "0021700176_017", "order": 17, "role": "body", "text": "\"I thought with their small lineup, I thought defensively we were giving up too much when he was in the game and I liked Ed's athleticism,\"  Blazers coach Terry Stotts said."}
{"game_id": "0021700176", "chunk_id": "0021700176_018", "order": 18, "role": "body", "text": "The Nets went on a 10-0 run midway through the third quarter, pulling within 65-62 on Quincy Acy's 3-pointer. Carroll's 3 tied it at 65 and he added a dunk to give Brooklyn the lead."}
{"game_id": "0021700176", "chunk_id": "0021700176_019", "order": 19, "role": "body", "text": "Turner's 3-pointer and McCollum's long jumper got Portland within 80-79 with 9:12 left in the game. Shabazz Napier had a 3 for Portland that tied it at 82."}
{"game_id": "0021700176", "chunk_id": "0021700176_020", "order": 20, "role": "body", "text": "Portland was coming off a 98-97 loss at home to the Grizzlies on Tuesday night."}
{"game_id": "0021700176", "chunk_id": "0021700176_022", "order": 22, "role": "body", "text": "Nets:  It was the fourth game of a five-game road trip for Brooklyn. ... Crabbe became the second fastest player to reach 25 3-pointers in a season in Nets' history with a 3 in the first half. Crabbe did it in 12 games, while Anthony Morrow did it in 11 in 2011-12."}
{"game_id": "0021700176", "chunk_id": "0021700176_023", "order": 23, "role": "body", "text": "Trail Blazers: The Blazers were playing the fourth in a six-game road The main scoreboard and some of the electronic advertising around the Moda Center was down in the first quarter."}
{"game_id": "0021700176", "chunk_id": "0021700176_024", "order": 24, "role": "body", "text": "LILLARD'S HAND: Lillard was icing his left hand in the locker room following the game."}
{"game_id": "0021700176", "chunk_id": "0021700176_025", "order": 25, "role": "body", "text": "\"On one of my last drives to the rim, they ended up getting the ball, we kind of came down to get the ball and (I) hit my hand, so my hand was numb a little bit,\" Lillard said."}
{"game_id": "0021700176", "chunk_id": "0021700176_026", "order": 26, "role": "body", "text": "He added: \"I think I'll be all right.\""}
{"game_id": "0021700176", "chunk_id": "0021700176_028", "order": 28, "role": "body", "text": "Nets: At Utah on Saturday night."}
{"game_id": "0021700176", "chunk_id": "0021700176_029", "order": 29, "role": "body", "text": "Trail Blazers: Host Denver on Monday night."}
{"game_id": "0021700176", "chunk_id": "0021700176_031", "order": 31, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
