{"game_id": "0021701021", "chunk_id": "0021701021_001", "order": 1, "role": "lead", "text": "ATLANTA --  Dwight Howard insists he holds no grudges against the Atlanta Hawks and coach Mike Budenholzer."}
{"game_id": "0021701021", "chunk_id": "0021701021_002", "order": 2, "role": "body", "text": "They traded him to Charlotte after one forgettable season, but Howard, in his 14th season and with his third team in three years, believes it made him a better player."}
{"game_id": "0021701021", "chunk_id": "0021701021_003", "order": 3, "role": "body", "text": "\"It motivated me to just come back this season with a different mindset,\" he said. \"Play with more confidence and stuff like that, so thank you, Bud.\""}
{"game_id": "0021701021", "chunk_id": "0021701021_004", "order": 4, "role": "body", "text": "Howard scored 20 of his season-high 33 points in the second half, Nicolas Batum had a triple-double and set a career high with 16 assists, and the Hornets beat the Hawks 129-117 on Thursday night."}
{"game_id": "0021701021", "chunk_id": "0021701021_005", "order": 5, "role": "body", "text": "Kemba Walker added 24 points and Marvin Williams had 17 for Charlotte, which kept its slim playoff hopes alive. The Hornets began the night having lost six of seven and were in 10th place in the Eastern Conference, 6 1/2 games behind No. 8 Miami with 13 games remaining."}
{"game_id": "0021701021", "chunk_id": "0021701021_006", "order": 6, "role": "body", "text": "Taurean Prince finished with 22 points and rookie John Collins tied a career high with 21 for Atlanta, the worst team in the East at 20-49."}
{"game_id": "0021701021", "chunk_id": "0021701021_007", "order": 7, "role": "body", "text": "Howard, an Atlanta native and former prep standout who flamed out in his only season with the Hawks last year, was relentless in the paint, using his 6-foot-11, 265-pound frame to dominate the Hawks with five dunks."}
{"game_id": "0021701021", "chunk_id": "0021701021_008", "order": 8, "role": "body", "text": "\"Their whole team functioned at a high level -- Kemba, Batum and him,\" Budenholzer said. \"He made a couple of jump shots. He made three or four from 15 to 17 feet, made his free throws. He was efficient.\""}
{"game_id": "0021701021", "chunk_id": "0021701021_009", "order": 9, "role": "body", "text": "Charlotte went on a 14-2 run to take a 33-19 lead on Jeremy Lamb's 3-pointer and began the second quarter up 14 after shooting nearly 62 percent in the first."}
{"game_id": "0021701021", "chunk_id": "0021701021_010", "order": 10, "role": "body", "text": "Atlanta went on a 12-5 run to cut the lead to 38-35 midway through the second, but the Hornets were up again by double digits in the third when Howard blocked Schroder's 3-point attempt out of bounds and dunked on the ensuing possession."}
{"game_id": "0021701021", "chunk_id": "0021701021_011", "order": 11, "role": "body", "text": "They led by 15 after Williams hit a 3 and Howard had a hard dunk with 9:40 left in the period. Charlotte's biggest lead was 23 points midway through the fourth."}
{"game_id": "0021701021", "chunk_id": "0021701021_012", "order": 12, "role": "body", "text": "\"I liked the energy,\" Hornets coach Steve Clifford said. \"I liked the purpose of play. For the most part, our defense was good.\""}
{"game_id": "0021701021", "chunk_id": "0021701021_014", "order": 14, "role": "body", "text": "Hornets: Batum had 10 points and 10 rebounds. His previous career high in assists was 14 for Portland against Orlando on Jan. 8, 2014. ... Lamb, listed as questionable before the game with back spasms, had 11 points and five rebounds in 25 minutes. ... Walker hit six 3s. ... Reserve F-C Cody Zeller missed the game with a knee injury."}
{"game_id": "0021701021", "chunk_id": "0021701021_015", "order": 15, "role": "body", "text": "Hawks: F Damion Lee had 14 points and is the franchise's first player since Paul \"Snoop\" Graham in 1991 to reach double figures in his first two NBA games. ... G Tyler Dorsey, making his second straight start since Kent Bazemore's season-ending knee injury, had 11 points in 27 minutes. ... Atlanta will begin a six-game trip without key backups F De'Andre Bembry (abdomen) and G Malcolm Delaney (ankle) will also miss the trip. Schroder is playing with a sore elbow. Isaiah Taylor and Tyler Cavanaugh each scored 11 points with tender ankles."}
{"game_id": "0021701021", "chunk_id": "0021701021_017", "order": 17, "role": "body", "text": "In helping Charlotte finish the season series 4-0, Howard averaged 22.8 points and 13.5 rebounds against the Hawks giving him a measure of satisfaction. Signed to a three-year, $70.5 million contract as a free agent to return home to Atlanta last season, Howard was traded away in a salary dump for little-used Miles Plumlee."}
{"game_id": "0021701021", "chunk_id": "0021701021_018", "order": 18, "role": "body", "text": "Budenholzer, responsible as then-team president for bringing Howard to Atlanta, benched the former All-Star center several times in the fourth quarter during the playoffs, signaling the end of his one-year stay."}
{"game_id": "0021701021", "chunk_id": "0021701021_019", "order": 19, "role": "body", "text": "\"I'm not angry at all,\" Howard said. \"It's a business. My time was here was pretty good. It was a lot of learning lessons. It didn't go well I think the people here in Atlanta and myself wanted it to go. But everything happens for a reason.\""}
{"game_id": "0021701021", "chunk_id": "0021701021_021", "order": 21, "role": "body", "text": "Prince is starting to emerge in his second season, averaging 28.3 points over the last three games."}
{"game_id": "0021701021", "chunk_id": "0021701021_023", "order": 23, "role": "body", "text": "Hornets: At New York on Sunday."}
{"game_id": "0021701021", "chunk_id": "0021701021_024", "order": 24, "role": "body", "text": "Hawks: At Milwaukee on Saturday."}
{"game_id": "0021701021", "chunk_id": "0021701021_026", "order": 26, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
