{"game_id": "0021400409", "chunk_id": "0021400409_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Kemba Walker is beginning to emerge as the multifaceted point guard the Charlotte Hornets hoped he would become."}
{"game_id": "0021400409", "chunk_id": "0021400409_002", "order": 2, "role": "body", "text": "Walker is off to the best start of his four-year career, entering the week third in the NBA in assist-per-turnover ratio."}
{"game_id": "0021400409", "chunk_id": "0021400409_003", "order": 3, "role": "body", "text": "He did little to hurt those numbers on Monday night. Walker scored 18 points, handed out nine assists and committed just one turnover as the Hornets coasted to a 110-82 victory over the Denver Nuggets."}
{"game_id": "0021400409", "chunk_id": "0021400409_004", "order": 4, "role": "body", "text": "\"Growing up, I have always been turnover-prone because I was always playing at one speed,\" Walker said. \"Now I'm trying to mix up my speeds and make the right passes.\""}
{"game_id": "0021400409", "chunk_id": "0021400409_005", "order": 5, "role": "body", "text": "Walker has 161 assists on the season to 41 turnovers, nearly a 4 to 1 ratio which ranks behind only Chris Paul and J.J. Barea."}
{"game_id": "0021400409", "chunk_id": "0021400409_006", "order": 6, "role": "body", "text": "\"I want to take care of the basketball,\" Walker said. \"It's really important and something I'm trying to be conscious of this year because when we don't turn it over it gives us a higher percentage of winning games.\""}
{"game_id": "0021400409", "chunk_id": "0021400409_007", "order": 7, "role": "body", "text": "Hornets coach Steve Clifford said Walker is developing into one of the league's better pick-and-roll point guards."}
{"game_id": "0021400409", "chunk_id": "0021400409_008", "order": 8, "role": "body", "text": "\"He's in the paint in every pick-and-roll,\" Clifford said. \"And he can score, but he's (also) kicking the ball out to teammates.\""}
{"game_id": "0021400409", "chunk_id": "0021400409_009", "order": 9, "role": "body", "text": "Al Jefferson shook off some early tightness in his lower body and scored 22 points for the Hornets, who extended their winning streak to a season-high three games. Rookie P.J. Hairston recorded his first career double-double with 10 points and 10 rebounds."}
{"game_id": "0021400409", "chunk_id": "0021400409_010", "order": 10, "role": "body", "text": "Jefferson and Walker combined to shoot 15 of 25 from the field and neither player saw action in the fourth quarter with the game well in hand."}
{"game_id": "0021400409", "chunk_id": "0021400409_011", "order": 11, "role": "body", "text": "Charlotte improved to 3-0 since Gerald Henderson replaced the injured Lance Stephenson in the starting lineup. Stephenson, who has been the subject of trade rumors, is out at least one more game with a groin injury."}
{"game_id": "0021400409", "chunk_id": "0021400409_012", "order": 12, "role": "body", "text": "While the Hornets appear to be playing their best basketball without Stephenson, Clifford said the challenge is to work the team's big-name free agent acquisition into the mix and become even better."}
{"game_id": "0021400409", "chunk_id": "0021400409_013", "order": 13, "role": "body", "text": "\"I'm looking at it and saying as talented as he is, what we can we become playing like this with him playing well also?\" Clifford said. \"And also what things are good that he can add to the team and who should he be on the floor with? That's what we have to figure out.\""}
{"game_id": "0021400409", "chunk_id": "0021400409_014", "order": 14, "role": "body", "text": "Ty Lawson had 18 points for Denver, which had its two-game winning streak snapped."}
{"game_id": "0021400409", "chunk_id": "0021400409_016", "order": 16, "role": "body", "text": "The Hornets took control early, building a 58-40 lead at halftime behind 57 percent shooting from the field. Jefferson and Walker led the way, combining to go 12 of 16 from the field for 32 points before the break."}
{"game_id": "0021400409", "chunk_id": "0021400409_017", "order": 17, "role": "body", "text": "With no scoring option to complement Lawson, the Nuggets never mounted a serious comeback attempt in the second half. The Hornets emptied the bench midway through the fourth quarter up by 30 points."}
{"game_id": "0021400409", "chunk_id": "0021400409_018", "order": 18, "role": "body", "text": "\"I don't know what to say,\" Nuggets coach Brian Shaw said. \"You have eyes, you saw it. It was an ugly, nasty game. We just have to flush it down the toilet.\""}
{"game_id": "0021400409", "chunk_id": "0021400409_021", "order": 21, "role": "body", "text": "Nuggets: Timofey Mozgov suffered a laceration to his left eye during the first quarter and received four stitches. He returned to the game but only played 15 minutes."}
{"game_id": "0021400409", "chunk_id": "0021400409_022", "order": 22, "role": "body", "text": "Hornets: Jeffery Taylor saw his first action of the season following a 24-game suspension. Taylor was rusty, misfiring twice from the field. He also clanked free throw attempts."}
{"game_id": "0021400409", "chunk_id": "0021400409_024", "order": 24, "role": "body", "text": "Clifford took Jefferson out of the game as a precaution five minutes in after the 6-foot-10 didn't leave his feet on a baseline move and threw up an airball. Jefferson said he simply was tight."}
{"game_id": "0021400409", "chunk_id": "0021400409_025", "order": 25, "role": "body", "text": "Clifford said he wanted to be sure, adding, \"I'm into challenges, but I'm not into playing a month without him.\""}
{"game_id": "0021400409", "chunk_id": "0021400409_027", "order": 27, "role": "body", "text": "Nuggets: At Brooklyn on Tuesday night."}
{"game_id": "0021400409", "chunk_id": "0021400409_028", "order": 28, "role": "closing", "text": "Hornets: At Milwaukee on Tuesday night."}
