{"game_id": "0021400982", "chunk_id": "0021400982_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- Unlike the last time the Chicago Bulls played Oklahoma City, Thunder point guard Russell Westbrook showed faith in a teammate with the game on the line, and Anthony Morrow proved worthy.\nWestbrook had 36 points, 11 rebounds and six assists, including one to Morrow for a game-clinching 3-pointer in the final minute, helping the Thunder hold off Bulls 109-100 on Sunday afternoon.\n\"We did a good job of learning from our mistakes,\" Westbrook said. \"The first time we played them, I had a chance to hit Serge [Ibaka] on a kickback [when] two guys was on me. Tonight, same situation -- two guys on me. I kicked to A-Mo and trusted my teammate and he knocked it down, so it was good.\""}
{"game_id": "0021400982", "chunk_id": "0021400982_002", "order": 2, "role": "closing", "text": "Centers Enes Kanter (18 points, 18 rebounds) and Steven Adams (14 points, 11 rebounds) both posted double-doubles for the Thunder. Oklahoma City, the league's top rebounding team, dominated the boards by a 52-33 margin.\nFor only the third time in the Thunder's last nine games, Westbrook didn't record a triple-double, falling short in assists largely because his teammates weren't shooting well early and Westbrook took over as the team's primary offensive option late. Oklahoma City shot 46 percent from the field, with Westbrook finishing 12-of-27.\nWestbrook's final assist came on the game-turning play. With the Thunder up 99-95 in the final minute, he held the basketball until near the end of the shot clock then passed to Morrow, who swished the decisive 3-pointer. The Thunder have won 16 of their last 18 home games.\n\"We wanted to close out the game better than we did a few weeks ago in Chicago,\" Oklahoma City coach Scott Brooks said. \"I thought the defense was good in the game. We made a few mistakes in Chicago that we wanted to make sure didn't happen again.\"\nNikola Mirotic scored 27 points and Pau Gasol added 20 for Chicago, which beat the Thunder on March 5 on a 3-pointer by E'Twaun Moore with 2.1 seconds left. The rematch was tight throughout -- neither team led by more than nine points -- but it was Westbrook making plays in the fourth quarter that proved to be the difference.\nWith the Thunder clinging to a 96-95 lead, Westbrook drove the lane and earned two free throws, making one with 1:27 left. At the other end, he stepped in front of a pass by Aaron Brooks, stole the ball and drove the length of the court for a layup to give Oklahoma City a 99-95 cushion with 1:12 remaining.\nOklahoma City's Dion Waiters stripped Moore on a drive toward the basket, and the ball glanced off Moore's hand with 1 minute left, giving the Thunder possession. After Morrow's 3-pointer, Gasol scored for Chicago. Westbrook then received a quick inbounds pass, and with Chicago coach Tom Thibodeau screaming at his players to trap the elusive Thunder guard, Westbrook drove all the way to the basket for a layup.\nWestbrook made 3 of 4 free throws in the final 12.3 seconds to cap a 14-point quarter.\n\"You just try to make him work for his points,\" Thibodeau said of Westbrook. \"He's playing at such a high level right now and he is making plays on top of it, so he keeps pressure on you at all times.\"\nTIP-INS\nBulls: Thibodeau didn't offer a specific timetable as to when injured forwards Jimmy Butler (left elbow sprain) and Taj Gibson (left ankle injury) might be able to return, but he said Gibson has returned to practice. ... Chicago hasn't won in Oklahoma City since Jan. 27, 2010. ... Gasol just missed what would have been a 45th double-double this season, grabbing eight rebounds.\nThunder: Oklahoma City started two centers, Kanter and Adams, in an attempt to slow the Bulls' potent front-line duo of Gasol and Noah. Kanter set a Thunder record with 10 rebounds in the first quarter. ... Thunder F Serge Ibaka missed a second straight game due to knee soreness. Brooks said Ibaka remains day-to-day. ... Kanter's double-double was his sixth since joining the Thunder at the NBA trade deadline, while Adams recorded his fifth double-double of the season.\nQUOTE OF THE DAY\nGasol, on the performance of Kanter and Adams: \"They were aggressive throughout the night. They understand that having a guy like Russell Westbrook that attacks so much and forces help, especially from bigs so deep into the paint, that they're going to have opportunities. They've got size and strength, and they pursue.\"\nUP NEXT\nBulls: Host Indiana on Wednesday.\nThunder: Visit Dallas on Monday."}
