{"game_id": "0021700345", "chunk_id": "0021700345_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  The Memphis Grizzlies finally got to celebrate a win after almost a month of misery."}
{"game_id": "0021700345", "chunk_id": "0021700345_002", "order": 2, "role": "body", "text": "But the relief of their first victory since Nov. 7 had to wait as the team and their fans held their collective breaths until one last misfire by the Minnesota Timberwolves."}
{"game_id": "0021700345", "chunk_id": "0021700345_003", "order": 3, "role": "body", "text": "Marc Gasol scored 21 points, Tyreke Evans added 16, including the two game-clinching free throws with 12.7 seconds left as the Grizzlies snapped an 11-game losing streak 95-92 on Monday night."}
{"game_id": "0021700345", "chunk_id": "0021700345_004", "order": 4, "role": "body", "text": "The Timberwolves still had a chance to tie after Evans' free throws, but Jimmy Butler's off-balance 3-point attempt over Andrew Harrison with 1.3 seconds remaining, bounced off the glass, grazed the rim and fell harmlessly away from the basket, preserving the Grizzlies first win since defeating Portland about four weeks ago."}
{"game_id": "0021700345", "chunk_id": "0021700345_005", "order": 5, "role": "body", "text": "\"I just didn't want him to get a clean look at the 3,\" Harrison said. \"I just wanted to make it as tough as possible.\""}
{"game_id": "0021700345", "chunk_id": "0021700345_006", "order": 6, "role": "body", "text": "Butler, who led the Timberwolves with 30 points, his second straight game reaching at least 30 points, said he thought the shot had a chance."}
{"game_id": "0021700345", "chunk_id": "0021700345_007", "order": 7, "role": "body", "text": "\"I think every shot I take is a good look,\" Butler said. \"You've got to take it, and go on to the next one.\""}
{"game_id": "0021700345", "chunk_id": "0021700345_008", "order": 8, "role": "body", "text": "Taj Gibson finished with 14 points, while Andrew Wiggins and Jeff Teague added 12 points each, Wiggins going 6 of 17 from the floor."}
{"game_id": "0021700345", "chunk_id": "0021700345_009", "order": 9, "role": "body", "text": "The game was close throughout with 14 lead changes and a dozen ties, the last coming at 86-all with 5:43 remaining. After a pair of free throws from Gasol, Memphis never surrendered the lead the rest of the way, although the margin didn't reach more than three points."}
{"game_id": "0021700345", "chunk_id": "0021700345_010", "order": 10, "role": "body", "text": "\"Our defense in the first half hurt us badly,\" Wolves coach Tom Thibodeau said. \"I thought it was a little better in the second half. We didn't come up with any loose balls at the end, and that could have separated the game.\""}
{"game_id": "0021700345", "chunk_id": "0021700345_011", "order": 11, "role": "body", "text": "Memphis interim coach J. B. Bickerstaff, who got his first win since taking over for David Fizdale earlier this week, said there were a lot of happy players in the locker room."}
{"game_id": "0021700345", "chunk_id": "0021700345_012", "order": 12, "role": "body", "text": "\"It's been awhile,\" Bickerstaff said of the span between wins. \"You almost forgot what it felt like to win because guys want it so bad, and they're emotionally invested. Every loss that kept popping up became a heavier and heavier weight.\""}
{"game_id": "0021700345", "chunk_id": "0021700345_014", "order": 14, "role": "body", "text": "Timberwolves: The loss continued a trend for Minnesota, alternating a win and a loss over the last eight games. ... F Nemanja Bjelica missed his seventh game with a sprained left foot. He was not with the team Monday night, but Thibodeaux said he expects Bjelica to meet the team in LA on Wednesday."}
{"game_id": "0021700345", "chunk_id": "0021700345_015", "order": 15, "role": "body", "text": "Grizzlies: In addition to snapping the losing streak, Memphis also stopped an eight-game skid at home, matching the longest home losing streak since moving to Memphis. .Evans had nine assists in his new role as the team's starting point guard, filling in for the injured Mike Conley (left Achilles injury). .The Grizzlies' 76-75 lead entering the fourth marked the first time Memphis had led after three quarters since the Nov. 7 win at Portland."}
{"game_id": "0021700345", "chunk_id": "0021700345_017", "order": 17, "role": "body", "text": "Karl-Anthony Towns, Minnesota's leading scorer at 20.3 points a game, was limited to seven points, taking only six shots. Thibodeaux noted the Grizzlies were willing to double-team the Timberwolves center down the stretch. \"We tried to play off that,\" the Minnesota coach said of the Grizzlies strategy. \"I thought he did a good job (of) getting the ball out.\" Towns had 11 rebounds and was held without a double-double for only the sixth time this season."}
{"game_id": "0021700345", "chunk_id": "0021700345_019", "order": 19, "role": "body", "text": "\"It was the biggest regular-season win that I have ever been a part of,\" -- Gasol."}
{"game_id": "0021700345", "chunk_id": "0021700345_021", "order": 21, "role": "body", "text": "Conley, who still is a ways from playing, simply tweeted after the game \"Thank God.\""}
{"game_id": "0021700345", "chunk_id": "0021700345_023", "order": 23, "role": "body", "text": "Timberwolves: Travel to Los Angeles to face the Clippers on Wednesday night."}
{"game_id": "0021700345", "chunk_id": "0021700345_024", "order": 24, "role": "body", "text": "Grizzlies: Face the Knicks in New York on Wednesday night."}
{"game_id": "0021700345", "chunk_id": "0021700345_026", "order": 26, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
