{"game_id": "0021300879", "chunk_id": "0021300879_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  After sleep-walking through the first half, the Grizzlies managed to wake up in time to claim their fifth straight victory at home."}
{"game_id": "0021300879", "chunk_id": "0021300879_002", "order": 2, "role": "body", "text": "Zach Randolph had 23 points and 14 rebounds, and Memphis used a big second half to defeat the Cleveland Cavaliers 110-96 Saturday night."}
{"game_id": "0021300879", "chunk_id": "0021300879_003", "order": 3, "role": "body", "text": "\"Coach just stated the obvious -- that we can't let a team come in here and dominate us on both ends of the court,\" Memphis guard Mike Conley said of Dave Joerger's halftime speech. \"We just went out there and tried to be aggressive defensively.\""}
{"game_id": "0021300879", "chunk_id": "0021300879_004", "order": 4, "role": "body", "text": "Randolph had 17 points in the second half to help Memphis outscore Cleveland 56-31 and rally from an early 15-point deficit. Conley and Marc Gasol scored 22 each for the Grizzlies. Conley added seven assists and Gasol had six."}
{"game_id": "0021300879", "chunk_id": "0021300879_005", "order": 5, "role": "body", "text": "Courtney Lee finished with 19 points, including a career-high five 3-pointers, and Tony Allen had 16 points on 7-of-10 shooting."}
{"game_id": "0021300879", "chunk_id": "0021300879_006", "order": 6, "role": "body", "text": "\"Sometimes it's just him getting himself going,\" Gasol said of Randolph in the second half. \"He's so hard to stop that no matter what they try to do it's just Zach being Zach.\""}
{"game_id": "0021300879", "chunk_id": "0021300879_007", "order": 7, "role": "body", "text": "Kyrie Irving led the Cavaliers with 28 points on 11-of-19 shooting, while Tristan Thompson was 8 of 10 for 18 points. Spencer Hawes had 13 points and Luol Deng 11."}
{"game_id": "0021300879", "chunk_id": "0021300879_008", "order": 8, "role": "body", "text": "\"Guys are going to make runs,\" Irving said. \"They made their run. They had a hit-first mentality going into that second half.\""}
{"game_id": "0021300879", "chunk_id": "0021300879_009", "order": 9, "role": "body", "text": "Memphis took control with its big third quarter and led by 91-83 with 8:56 left in the fourth."}
{"game_id": "0021300879", "chunk_id": "0021300879_010", "order": 10, "role": "body", "text": "The Cavaliers used six straight points from Irving to pull within 95-94 with 4:03 left. But a baseline 8-footer by Randolph and a 3-pointer from Conley restored Memphis' cushion. By the time Gasol scored on a hook shot with 1:13 left the Grizzlies' lead was in double digits."}
{"game_id": "0021300879", "chunk_id": "0021300879_011", "order": 11, "role": "body", "text": "\"It was effort, energy and focus,\" Joerger said of the second-half effort that held the Cavaliers to 34 percent shooting. \".We were making one, two or three efforts. The energy picked up, and we made multiple efforts. They didn't have a lot of second chances.\""}
{"game_id": "0021300879", "chunk_id": "0021300879_012", "order": 12, "role": "body", "text": "The Cavaliers dominated the first half, leading by as many as 15 points and taking a 65-54 lead into the break. The Grizzlies provided little resistance and Cleveland shot just under 70 percent for much of the half before going to the locker room at 61 percent."}
{"game_id": "0021300879", "chunk_id": "0021300879_013", "order": 13, "role": "body", "text": "\"In the first half we were the ones who were more physical,\" Cleveland coach Mike Brown said. \"We were the ones hitting first.\""}
{"game_id": "0021300879", "chunk_id": "0021300879_014", "order": 14, "role": "body", "text": "The energy and intensity increased for Memphis to open the second half and that translated into a 21-8 run to overtake Cleveland just past the midway point of the third."}
{"game_id": "0021300879", "chunk_id": "0021300879_015", "order": 15, "role": "body", "text": "At that point, Cleveland had committed five turnovers in the quarter."}
{"game_id": "0021300879", "chunk_id": "0021300879_016", "order": 16, "role": "body", "text": "Memphis would stretch the run to 26-8, including 17 straight points, for an 80-73 lead that became an 87-80 advantage entering the final frame."}
{"game_id": "0021300879", "chunk_id": "0021300879_017", "order": 17, "role": "body", "text": "\"There were positives from it,\" Irving said. \"We fought hard to the end with the exception of the last 3 minutes. We can live with the effort.\""}
{"game_id": "0021300879", "chunk_id": "0021300879_018", "order": 18, "role": "closing", "text": "Game notes Irving has scored at least 20 points in 17 of last 23 games. ... The Cavaliers' 65 points in the first half were the most scored by a Memphis opponent in a half this season. The previous high was 62 in the second half by Dallas on Nov. 2. ... Gasol hit a shot at the end of the first quarter from beyond half court and banked it in. It was shown on the score sheet as 60 feet. It was his first 3-pointer of the season. ... The Cavaliers last won in Memphis on Jan. 13, 2009. ... The game was the nightcap of a doubleheader at the FedExForum. Earlier in the day, No. 21 Memphis defeated seventh-ranked Louisville 72-66."}
