{"game_id": "0021700944", "chunk_id": "0021700944_001", "order": 1, "role": "lead", "text": "TORONTO --  After three double-digit losses to Toronto, the Charlotte Hornets finally turned in a strong performance against the Raptors."}
{"game_id": "0021700944", "chunk_id": "0021700944_002", "order": 2, "role": "body", "text": "Unfortunately, it still wasn't enough to beat the Eastern Conference leaders."}
{"game_id": "0021700944", "chunk_id": "0021700944_003", "order": 3, "role": "body", "text": "DeMar DeRozan scored 19 points, Jonas Valanciunas had 18 points and 13 rebounds and the Raptors beat the Hornets 103-98 on Sunday night, Toronto's 11th win in 12 games."}
{"game_id": "0021700944", "chunk_id": "0021700944_004", "order": 4, "role": "body", "text": "Ahead by 13 points to begin the fourth quarter, Toronto saw its lead dwindle to two before DeRozan and Lowry made key 3-pointers."}
{"game_id": "0021700944", "chunk_id": "0021700944_005", "order": 5, "role": "body", "text": "\"It wasn't a pretty game,\" Raptors coach Dwane Casey said. \"Last year we probably would have lost that game, but we were mature enough to make plays, the right plays.\""}
{"game_id": "0021700944", "chunk_id": "0021700944_006", "order": 6, "role": "body", "text": "Serge Ibaka scored 17 points and Lowry had 14 points and 10 rebounds as the Raptors completed their first season sweep of Charlotte since 2006-07. Toronto improved to 26-5 at Air Canada Centre, the best home record in the NBA."}
{"game_id": "0021700944", "chunk_id": "0021700944_007", "order": 7, "role": "body", "text": "\"They're playing as well as anyone in our league at this point,\" Hornets guard Kemba Walker said. \"They move the ball really well, they trust each other.\""}
{"game_id": "0021700944", "chunk_id": "0021700944_008", "order": 8, "role": "body", "text": "Fred VanVleet and C.J. Miles each scored 12 points for the Raptors, who have won four straight since an overtime loss to Milwaukee on Feb. 23."}
{"game_id": "0021700944", "chunk_id": "0021700944_009", "order": 9, "role": "body", "text": "Walker scored 27 points and Dwight Howard had 10 points and 10 rebounds for the Hornets, who lost their third straight, all on the road. Charlotte is 10-21 away from home."}
{"game_id": "0021700944", "chunk_id": "0021700944_010", "order": 10, "role": "body", "text": "Jeremy Lamb scored 16 points, Frank Kaminsky had 15 and Nicolas Batum added 10."}
{"game_id": "0021700944", "chunk_id": "0021700944_011", "order": 11, "role": "body", "text": "Despite the outcome, Hornets coach Steve Clifford said he liked what he saw in the final quarter."}
{"game_id": "0021700944", "chunk_id": "0021700944_012", "order": 12, "role": "body", "text": "\"Purposeful offense, smart play, and very good defense,\" Clifford said. \"That's what we're capable of. If we are serious about making a run here, that's what we're capable of.\""}
{"game_id": "0021700944", "chunk_id": "0021700944_013", "order": 13, "role": "body", "text": "The Hornets are 5.5 games behind Miami for the final playoff spot in the Eastern Conference with 18 games remaining."}
{"game_id": "0021700944", "chunk_id": "0021700944_014", "order": 14, "role": "body", "text": "\"We need to build on what happened here tonight in the fourth quarter,\" Clifford said."}
{"game_id": "0021700944", "chunk_id": "0021700944_015", "order": 15, "role": "body", "text": "A downcast Walker wasn't as encouraged as his coach."}
{"game_id": "0021700944", "chunk_id": "0021700944_016", "order": 16, "role": "body", "text": "\"We lost,\" Walker said. \"That's all I'm really looking at right now until we watch the film.\""}
{"game_id": "0021700944", "chunk_id": "0021700944_017", "order": 17, "role": "body", "text": "Charlotte's Michael Kidd-Gilchrist scored the game's opening basket but the Hornets never led again."}
{"game_id": "0021700944", "chunk_id": "0021700944_018", "order": 18, "role": "body", "text": "The Hornets cut the deficit to two, 88-86, on a three-point play by Lamb with 5:11 left in the fourth quarter. Lowry answered with a 3 for Toronto and, after Walker split a pair at the line, DeRozan added a corner 3, giving Toronto a 93-87 lead with 3:22 remaining."}
{"game_id": "0021700944", "chunk_id": "0021700944_019", "order": 19, "role": "body", "text": "\"We just tried to do what we could to stay in the game and win it down the stretch but those guys are really good,\" Walker said. \"They just made plays.\""}
{"game_id": "0021700944", "chunk_id": "0021700944_020", "order": 20, "role": "body", "text": "This was the first time in four meetings with Charlotte this season that the Raptors failed to score at least 120 points. Toronto had won the past three meetings this season by 13 points or more."}
{"game_id": "0021700944", "chunk_id": "0021700944_022", "order": 22, "role": "body", "text": "Hornets: F-C Cody Zeller returned after missing the previous two games because of a sore left knee. He fouled out with six points. ... G-F Dwayne Bacon missed the game with an illness. ... Michael Carter-Williams returned in the third quarter after suffering a sprained left shoulder in the second."}
{"game_id": "0021700944", "chunk_id": "0021700944_023", "order": 23, "role": "body", "text": "Raptors: F OG Anunoby (sprained right ankle) missed his second straight game. \"It's not going to be a long-term thing,\" Casey said of Anunoby's injury. Malcolm Miller made his first career start."}
{"game_id": "0021700944", "chunk_id": "0021700944_025", "order": 25, "role": "body", "text": "Batum has at least one steal in 11 consecutive games, the longest streak of his career."}
{"game_id": "0021700944", "chunk_id": "0021700944_027", "order": 27, "role": "body", "text": "The Raptors are 39-1 when they lead through three quarters. The lone exception was a Dec. 11 road defeat to the Clippers in which Toronto led 74-70 after three."}
{"game_id": "0021700944", "chunk_id": "0021700944_029", "order": 29, "role": "body", "text": "Hornets: Open a three-game homestand against the 76ers on Tuesday. Charlotte lost at Philadelphia last Friday, their first meeting of the season. The teams play three more times before April 2."}
{"game_id": "0021700944", "chunk_id": "0021700944_030", "order": 30, "role": "body", "text": "Raptors: Host Atlanta on Tuesday. Toronto has won its past three meetings with the Hawks."}
{"game_id": "0021700944", "chunk_id": "0021700944_032", "order": 32, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
