{"game_id": "0021300752", "chunk_id": "0021300752_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- The banged-up Minnesota Timberwolves were just what the Portland Trail Blazers needed.\nHaving lost six of their previous 10 games, and with a date against first-place Oklahoma City looming on Tuesday, the Blazers took advantage of a Timberwolves team missing three of its best players.\n\"We felt that way even if they had all their guys,\" LaMarcus Aldridge said after scoring 26 points to lead Portland past Minnesota 117-110 Saturday night. \"If they had those guys, it definitely would've been different, but this was a must-win game either way.\"\nAldridge scored 16 of his points in the second half and Wesley Matthews added 21 as the Blazers held off a tougher-than-expected Wolves team missing starters Kevin Love, Nikola Pekovic and Kevin Martin.\nJust minutes before tipoff, the Wolves announced Love -- their All-Star power forward -- would miss the game with a bruised left quadriceps sustained in Friday night's loss in New Orleans. Shortly before that, Martin was ruled out indefinitely with a broken left thumb, also suffered against the Pelicans. Combined with Pekovic, the trio accounts for an average of 60 points and 25 rebounds per game.\n\"It takes a little edge off the game,\" Blazers coach Terry Stotts said. \"We found out Kevin Martin wasn't going to play early and then Love wasn't going to play. I think that deflates the balloon a little bit, you kind of get yourself up for guys like that.\"\nBut the Blazers knew they couldn't afford to let up against the scrappy Wolves, who trailed for most of the first half but led 82-75 with 1:50 to play in the third quarter. Corey Brewer led Minnesota with 26 points and Ricky Rubio scored a career-high 25.\nMinnesota led 87-85 with 9:48 to play in the game before Portland went on a 13-1 run to put the game away. Minnesota pulled within 101-96 with 3:29 to play before Matthews scored five straight and Robin Lopez hit a layup to put the game out of reach.\nThe Wolves got 19 points from Chase Budinger, 14 from Dante Cunningham and a season-high 12 from rookie Shabazz Muhammad.\n\"It doesn't matter who's out,\" coach Rick Adelman said. \"The next guy steps up, that's how you have to approach it. You can't worry about who's not playing, worry about who is playing, and make the best out of the situation. I thought we played well tonight.\"\nAldridge had six points during Portland's game-deciding 13-1 run in the fourth quarter. That run came with Rubio on the bench.\nRookie C.J. McCollum had a season-high 19 points and Nicolas Batum added 15 for the Blazers, who finished their four-game road trip 2-2.\n\"We were really counting on our bench tonight because I really wanted to rest the starters,\" Stotts said. \"They all played a lot of minutes last night and the first half the bench really gave us a boost. We were able to make a little ground with them in the game.\"\nMinnesota's key starters also got a rest -- in their street clothes.\n\"It's tough having all of those guys out,\" Budinger said. \"Those are huge impact guys for us and we're hoping Kevin was able to go but he was really struggling and hurting. He tried to get himself going but just couldn't do it.\"\nGame notes\nDuring halftime, Love told The AP he hopes to play on Monday night against Houston. ... The Blazers played a second-straight game without backup point guard Mo Williams, who left the team Friday for family reasons. Stotts did not have an update on when Williams might return. ... Adelman is assuming Pekovic will not return until after the All-Star break. ... Love bought a full-page advertisement in Sunday's Minneapolis Star Tribune thanking fans for voting him an All-Star starter. \"Just my way of paying tribute to the fans,\" he said at halftime.\nSent from Windows Mail"}
