{"game_id": "0021701004", "chunk_id": "0021701004_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  As the Portland Trail Blazers keep winning, Damian Lillard should keep climbing in the MVP conversation, according to Miami coach Erik Spoelstra."}
{"game_id": "0021701004", "chunk_id": "0021701004_002", "order": 2, "role": "body", "text": "Lillard had 32 points and 10 assists, and the Trail Blazers beat the Heat 115-99 on Monday night for their 10th straight victory."}
{"game_id": "0021701004", "chunk_id": "0021701004_003", "order": 3, "role": "body", "text": "Jusuf Nurkic added 27 points and 16 rebounds for the Blazers, who have the longest current winning streak in the NBA and a two-game lead over Oklahoma City for the No. 3 seed in the Western Conference."}
{"game_id": "0021701004", "chunk_id": "0021701004_004", "order": 4, "role": "body", "text": "After Lillard put the finishing touches on the win, Spoelstra said Portland's All-Star deserves a little more recognition league-wide."}
{"game_id": "0021701004", "chunk_id": "0021701004_005", "order": 5, "role": "body", "text": "\"I don't know if there is any other player in this league right now that is playing at a higher level than Lillard,\" Spoelstra said. \"You know the names in the MVP conversation. The way he's playing right now and winning, he deserves to be in that conversation as well.\""}
{"game_id": "0021701004", "chunk_id": "0021701004_006", "order": 6, "role": "body", "text": "The Heat used an 18-2 run to start the fourth quarter to trim a 19-point deficit to three, but Lillard took charge for the Blazers, just as he has throughout the winning streak. The All-Star guard broke Portland's drought of over five minutes with a 3-pointer midway through the period to put Portland back in front by six, and the Blazers stayed safely ahead from there."}
{"game_id": "0021701004", "chunk_id": "0021701004_007", "order": 7, "role": "body", "text": "Lillard scored 21 points after halftime. He leads the league in second-half scoring."}
{"game_id": "0021701004", "chunk_id": "0021701004_008", "order": 8, "role": "body", "text": "\"It's not just about him being a great player, it is the timing of his greatness, that is so unique,\" Spoelstra added. \"Every time there needs to be a big time play, or if momentum started to go our way, he made that play.\""}
{"game_id": "0021701004", "chunk_id": "0021701004_009", "order": 9, "role": "body", "text": "But Lillard credited Nurkic, who was two points shy of his season high. Lillard said he's seen the work the center is putting in behind the scenes."}
{"game_id": "0021701004", "chunk_id": "0021701004_010", "order": 10, "role": "body", "text": "\"That's the Nurk we need, just a beast, taking his time, scoring on the block, making plays off the block, rebounding the ball, blocking shots,\" Lillard said. \"I think his presence was really felt on both ends of the floor."}
{"game_id": "0021701004", "chunk_id": "0021701004_011", "order": 11, "role": "body", "text": "\"You could tell he's trying to focus on being physical and finishing his shots.\""}
{"game_id": "0021701004", "chunk_id": "0021701004_012", "order": 12, "role": "body", "text": "Goran Dragic scored 23 points for the Heat, who were without two key players in starting center Hassan Whiteside and sixth man Dwyane Wade."}
{"game_id": "0021701004", "chunk_id": "0021701004_013", "order": 13, "role": "body", "text": "The Blazers closed the first quarter on a 14-4 run to take a 34-25 lead, capped by a buzzer-beating 3-pointer from rookie Zach Collins that was accompanied with some guard-like dribbling."}
{"game_id": "0021701004", "chunk_id": "0021701004_014", "order": 14, "role": "body", "text": "\"I don't know if he could do that again, but it was a great shot,\" Blazers coach Terry Stotts said."}
{"game_id": "0021701004", "chunk_id": "0021701004_015", "order": 15, "role": "body", "text": "Another 3-pointer by Collins with 7:03 left in the second quarter put Portland up 45-33, forcing the Heat to call time."}
{"game_id": "0021701004", "chunk_id": "0021701004_017", "order": 17, "role": "body", "text": "Heat: Monday was the deadline for the Heat to use a $5.5 million trade exception they were granted after shooting guard Dion Waiters underwent season-ending surgery on his ankle. The Heat would have had to release a player already on their roster to open up a roster spot to use the sizable exception."}
{"game_id": "0021701004", "chunk_id": "0021701004_018", "order": 18, "role": "body", "text": "Trail Blazers: Lillard came in averaging nearly 33 points during the streak, which includes two victories over the NBA champion Golden State Warriors. \"I think this might be the best level that he's played,\" coach Terry Stotts said. \"I thought what he did last year after the All-Star break was amazing. He carried us to the playoffs last year, showing great leadership and a high quality of play. It might be better this year, but we still have 16 games to go.\""}
{"game_id": "0021701004", "chunk_id": "0021701004_020", "order": 20, "role": "body", "text": "Heat: Continue their three-game road trip in Sacramento on Tuesday."}
{"game_id": "0021701004", "chunk_id": "0021701004_021", "order": 21, "role": "closing", "text": "Trail Blazers: Welcome LeBron James and the Cleveland Cavaliers on Thursday."}
