{"game_id": "0021700078", "chunk_id": "0021700078_001", "order": 1, "role": "lead", "text": "MIAMI --  Kyrie Irving has done a lot of things in Miami: relaxation, offseason workouts, even the filming of an \"Uncle Drew\" commercial."}
{"game_id": "0021700078", "chunk_id": "0021700078_002", "order": 2, "role": "body", "text": "Something he hadn't done there? Win."}
{"game_id": "0021700078", "chunk_id": "0021700078_003", "order": 3, "role": "body", "text": "He's now crossed that off the list as well."}
{"game_id": "0021700078", "chunk_id": "0021700078_004", "order": 4, "role": "body", "text": "Irving took over down the stretch, scoring nine of his 24 points in the final 2:03 and the Boston Celtics extended their winning streak to four games after holding on late to beat the Heat 96-90 on Saturday night."}
{"game_id": "0021700078", "chunk_id": "0021700078_005", "order": 5, "role": "body", "text": "It was Irving's eighth time playing at Miami, and the first time he walked off the Heat home floor a winner."}
{"game_id": "0021700078", "chunk_id": "0021700078_006", "order": 6, "role": "body", "text": "\"Just big possessions down the stretch (and) understanding you have to stay poised,\" Irving said. \"It's unwavering in those situations like that. Winning time -- so it's pretty simple.\""}
{"game_id": "0021700078", "chunk_id": "0021700078_007", "order": 7, "role": "body", "text": "Jayson Tatum scored 20 and Marcus Smart added 16 for the Celtics, who beat Miami for the eighth consecutive time. And afterward, Tatum marveled at Irving's closing flurry."}
{"game_id": "0021700078", "chunk_id": "0021700078_008", "order": 8, "role": "body", "text": "\"It was weird because I've seen it on TV so many times,\" Tatum said. \"And I just saw it in person. I liked it.\""}
{"game_id": "0021700078", "chunk_id": "0021700078_009", "order": 9, "role": "body", "text": "Goran Dragic scored 22 points for Miami, which got 16 apiece from Josh Richardson and James Johnson. Former Boston forward Kelly Olynyk had 14 points and nine rebounds for the Heat, who were 7 for 31 from 3-point range."}
{"game_id": "0021700078", "chunk_id": "0021700078_010", "order": 10, "role": "body", "text": "At 2-3, and mindful of how last season's 11-30 start cost Miami a playoff spot, the Heat already sound anxious to get things fixed."}
{"game_id": "0021700078", "chunk_id": "0021700078_011", "order": 11, "role": "body", "text": "\"I don't want to have a season like last year, when it's late and we figure out things,\" Dragic said. \"We've got to do it now, because it's important.\""}
{"game_id": "0021700078", "chunk_id": "0021700078_012", "order": 12, "role": "body", "text": "Miami was down 11 going into the fourth, then got within two on a pair of occasions late -- when Irving got rolling."}
{"game_id": "0021700078", "chunk_id": "0021700078_013", "order": 13, "role": "body", "text": "He hit a short floater to put Boston up 88-84, and after Dragic scored to cut the Celtics' lead to two again, Irving pulled off one of his acrobatic reverse layups to restore the four-point edge."}
{"game_id": "0021700078", "chunk_id": "0021700078_014", "order": 14, "role": "body", "text": "And on a possession extended by a Boston offensive rebound, Irving's 3-pointer with 57 seconds left made the margin 93-86."}
{"game_id": "0021700078", "chunk_id": "0021700078_015", "order": 15, "role": "body", "text": "\"That's what he is,\" Heat coach Erik Spoelstra said. \"He's a great closer in this game.\""}
{"game_id": "0021700078", "chunk_id": "0021700078_017", "order": 17, "role": "body", "text": "Celtics: Boston has won five straight in Miami, matching the longest such streak in franchise history. ... The Celtics aren't sure if Marcus Morris (sore left knee) will be able to play when they return home Monday, but coach Brad Stevens thinks Morris will be ready sometime in the coming week. Morris has already missed as many games this season -- six -- as he did in the previous four seasons combined."}
{"game_id": "0021700078", "chunk_id": "0021700078_018", "order": 18, "role": "body", "text": "Heat: C Hassan Whiteside (bruised left knee) missed his fourth consecutive game, and the Heat still aren't sure when he'll return. ... Miami had what became a five-point possession late in the second quarter, when Richardson made two free throws after a Flagrant-1 on Al Horford -- followed by a three-point play from James Johnson. ... Dion Waiters didn't play in the fourth quarter and scored only five points."}
{"game_id": "0021700078", "chunk_id": "0021700078_020", "order": 20, "role": "body", "text": "Stevens keeps a close eye on former players, and Olynyk and Jordan Mickey -- former Celtics now with the Heat -- are no exception. \"I really root for everybody,\" Stevens said. Same goes for Spoelstra, who texted injured Celtics forward Gordon Hayward words of support after the All-Star's grotesque ankle injury in Cleveland in the season opener. Hayward considered signing with Miami as a free agent this past summer."}
{"game_id": "0021700078", "chunk_id": "0021700078_022", "order": 22, "role": "body", "text": "Miami was held under 100 points for the first time this season. Boston outscored Miami 53-37 in the middle two quarters -- holding the Heat to 39 percent shooting from the field and 19 percent from 3-point range during that 24-minute span.  But the big problems that Spoelstra was unhappy about postgame were Boston's edges in points off turnovers (21-13) and second-chance points (21-9)."}
{"game_id": "0021700078", "chunk_id": "0021700078_024", "order": 24, "role": "body", "text": "Celtics: Host San Antonio on Monday, looking to snap an 11-game losing streak to the Spurs."}
{"game_id": "0021700078", "chunk_id": "0021700078_025", "order": 25, "role": "closing", "text": "Heat: Host Minnesota on Monday, the fifth game in this six-game homestand."}
