{"game_id": "0021200019", "chunk_id": "0021200019_001", "order": 1, "role": "lead", "text": "CLEVELAND -- Cavaliers coach Byron Scott got right to the point after watching the Chicago Bulls dismantle his team Friday night."}
{"game_id": "0021200019", "chunk_id": "0021200019_002", "order": 2, "role": "body", "text": "\"That's what you call a good, old-fashioned butt-whipping,\" he said following the Bulls' 115-86 win."}
{"game_id": "0021200019", "chunk_id": "0021200019_003", "order": 3, "role": "body", "text": "No one would argue with Scott's assessment. Chicago dominated from start to finish and is 2-0 for the first time since the 2002-03 season despite playing without star point guard Derrick Rose."}
{"game_id": "0021200019", "chunk_id": "0021200019_004", "order": 4, "role": "body", "text": "Richard Hamilton and Carlos Boozer each scored 19 points to pace a balanced attack. Nate Robinson added 16 points and 12 assists for the Bulls, who led the entire game after Boozer hit a jumper 23 seconds in. Chicago made 14 of 19 shots from the field in the first quarter and led 36-16 with 10:34 remaining in the second."}
{"game_id": "0021200019", "chunk_id": "0021200019_005", "order": 5, "role": "body", "text": "Hamilton scored 14 points in the third quarter, and Robinson had 12 in the second. The Bulls shot 63.8 percent from the field for the game, hitting 44 of 69 shots."}
{"game_id": "0021200019", "chunk_id": "0021200019_006", "order": 6, "role": "body", "text": "\"It was awesome,\" Hamilton said. \"It felt good. Everyone was catching the ball in their sweet spots.\""}
{"game_id": "0021200019", "chunk_id": "0021200019_007", "order": 7, "role": "body", "text": "Hamilton, who is entering his 14th season, scored 19 points in Chicago's season-opening win over Sacramento. After being plagued by injuries last season, the 34-year-old guard could give the Bulls another scoring option, which would be especially helpful with Rose unavailable. He isn't expected to return until the second half of the season because of a knee injury."}
{"game_id": "0021200019", "chunk_id": "0021200019_008", "order": 8, "role": "body", "text": "\"In the third quarter, I decided to get a little more aggressive,\" Hamilton said. \"Some dude behind me called me Old Man River, so I had to show him how it's done.\""}
{"game_id": "0021200019", "chunk_id": "0021200019_009", "order": 9, "role": "body", "text": "Hamilton's scoring spree gave his teammates a boost."}
{"game_id": "0021200019", "chunk_id": "0021200019_010", "order": 10, "role": "body", "text": "\"All you heard was his name: 'Rip Hamilton, Rip Hamilton.' He got us all going,\" Robinson said."}
{"game_id": "0021200019", "chunk_id": "0021200019_011", "order": 11, "role": "body", "text": "The Cavaliers, who defeated Washington in their opener, struggled on both ends of the floor. Kyrie Irving had 15 points but Cleveland shot 32 of 79 from the field (41 percent) and committed 17 turnovers."}
{"game_id": "0021200019", "chunk_id": "0021200019_012", "order": 12, "role": "body", "text": "\"As a young team, we still have a lot to learn,\" Scott said. \"As I told the players, you've got to come ready to play, especially against good teams -- and Chicago is a great basketball team.\""}
{"game_id": "0021200019", "chunk_id": "0021200019_013", "order": 13, "role": "body", "text": "Chicago was 18-9 without Rose last season and earned the No. 1 seed in the Eastern Conference playoffs. He tore the ACL in his left knee in Game 1 of the first round against Philadelphia and the Bulls were eliminated by the 76ers."}
{"game_id": "0021200019", "chunk_id": "0021200019_014", "order": 14, "role": "body", "text": "The Bulls have won nine straight games over the Cavaliers, who haven't recorded a win in the series since LeBron James left town after the 2010 season. Chicago has won the last four games by an average margin of 30.2 points. The Cavaliers haven't defeated the Bulls since March 19, 2010."}
{"game_id": "0021200019", "chunk_id": "0021200019_015", "order": 15, "role": "body", "text": "Luol Deng added 14 points for the Bulls, who begin a five-game homestand Saturday against New Orleans. Joakim Noah scored 10."}
{"game_id": "0021200019", "chunk_id": "0021200019_016", "order": 16, "role": "body", "text": "\"The readiness to play was really good,\" Bulls coach Tom Thibodeau said. \"We ran the floor well and played inside-out to set up open shots. When a guy got going tonight, they searched him out a little bit.\""}
{"game_id": "0021200019", "chunk_id": "0021200019_017", "order": 17, "role": "body", "text": "Anderson Varejao, who set career highs with 23 rebounds and nine assists in the opener, scored 12 points for Cleveland, which opens six-game, 11-day road trip Saturday in Milwaukee."}
{"game_id": "0021200019", "chunk_id": "0021200019_018", "order": 18, "role": "body", "text": "\"I thought we were going through the motions,\" Scott said. \"You can't play the Chicago Bulls going through the motions. They're just too good.\""}
{"game_id": "0021200019", "chunk_id": "0021200019_019", "order": 19, "role": "body", "text": "Alonzo Gee also scored 12. Rookie guard Dion Waiters, the Cavaliers' No. 1 draft pick, scored seven points after having 17 in the opener."}
{"game_id": "0021200019", "chunk_id": "0021200019_020", "order": 20, "role": "closing", "text": "Game notes Boozer also had seven rebounds and six assists. ... Robinson was poked in the eye in the fourth quarter, but said he was fine. ... G Kirk Hinrich, who is replacing Rose in the starting lineup, picked up his fourth foul early in the third quarter. He scored nine points and had six assists in 18 minutes. Hinrich is playing with a groin injury ... The Cavaliers' trip also includes stops in Los Angeles to play the Clippers, Golden State, Phoenix, Oklahoma City and Brooklyn. ... Rookie C Tyler Zeller picked up three fouls in 4 minutes in the first half. He scored eight points, seven in the second half."}
