{"game_id": "0021301104", "chunk_id": "0021301104_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Josh Smith saved his only 3-pointers for when the Detroit Pistons needed them most."}
{"game_id": "0021301104", "chunk_id": "0021301104_002", "order": 2, "role": "body", "text": "His first started a 12-0 run midway through the fourth quarter that gave the Pistons the lead for good and the next gave Detroit breathing room in its 116-111 win over the Milwaukee Bucks on Monday night."}
{"game_id": "0021301104", "chunk_id": "0021301104_003", "order": 3, "role": "body", "text": "Greg Monroe matched his season-best with 28 points and had 14 rebounds to help Detroit end a three-game skid in a matchup of the NBA Central Division's worst two teams. Smith scored eight of his 26 during the decisive run."}
{"game_id": "0021301104", "chunk_id": "0021301104_004", "order": 4, "role": "body", "text": "\"It kind of was a relief,\" Smith said of his first 3-pointer, which got the Pistons within 98-95 with 5:2 left in the game. \"I knew if I just stepped into it and shot it with confidence we could make a push.\""}
{"game_id": "0021301104", "chunk_id": "0021301104_005", "order": 5, "role": "body", "text": "He had a 3-point play later in the run and added his second 3-pointer and a subsequent dunk with a minute to play to put the game away. Smith finished the fourth with 15 points and was 11 for 19 from the floor overall."}
{"game_id": "0021301104", "chunk_id": "0021301104_006", "order": 6, "role": "body", "text": "\"It seemed like every shot he made in the fourth quarter was a big shot,\" Monroe said. \"We obviously needed him to kind of pull away.\""}
{"game_id": "0021301104", "chunk_id": "0021301104_007", "order": 7, "role": "body", "text": "Brandon Knight had 25 points and Ramon Sessions added 20 and 11 assists for Milwaukee, which lost its 10th consecutive road game and dropped the season series with the Pistons 3-1."}
{"game_id": "0021301104", "chunk_id": "0021301104_008", "order": 8, "role": "body", "text": "The Bucks outscored the Pistons 13-6 in the final four minutes of the first half and took a 61-52 lead to intermission. Detroit trailed by as many as 11 points early in the third but took the lead with a 12-0 run before heading into the final period trailing 82-81."}
{"game_id": "0021301104", "chunk_id": "0021301104_009", "order": 9, "role": "body", "text": "Andre Drummond had 10 points and 16 boards and Brandon Jennings added 20 points and 13 assists for Detroit, which won despite going to the line 21 times to Milwaukee's 36."}
{"game_id": "0021301104", "chunk_id": "0021301104_010", "order": 10, "role": "body", "text": "\"We just stopped doing the things that we did for three-and-a-half quarters,\" Milwaukee coach Larry Drew said. \"We took some tough shots. We rushed a lot of quick shots around the basket and missed a lot of easy ones.\""}
{"game_id": "0021301104", "chunk_id": "0021301104_011", "order": 11, "role": "body", "text": "Drew was content with his team's job on Smith, who entered the game making 42 percent of his field-goal tries."}
{"game_id": "0021301104", "chunk_id": "0021301104_012", "order": 12, "role": "body", "text": "\"I thought we did a good job from a game strategy standpoint,\" Drew said. \"We did what we were supposed to do. He just started making shots.\""}
{"game_id": "0021301104", "chunk_id": "0021301104_013", "order": 13, "role": "body", "text": "The Bucks got 12 points, 13 rebounds and a career-best three blocks from center Zaza Pachulia. They went almost five minutes without a field goal late in the fourth quarter while Detroit made the decisive run."}
{"game_id": "0021301104", "chunk_id": "0021301104_014", "order": 14, "role": "body", "text": "Khris Middleton and Giannis Antetokounmpo each added 14 points."}
{"game_id": "0021301104", "chunk_id": "0021301104_015", "order": 15, "role": "body", "text": "Pistons coach John Loyer was whistled for a technical foul midway through the third quarter. Two nights earlier he was ejected from the Pistons' 123-98 loss at Philadelphia."}
{"game_id": "0021301104", "chunk_id": "0021301104_016", "order": 16, "role": "closing", "text": "Game notes Drummond and Pachulia each were assessed technical fouls in the first half for arguing calls. . The Bucks finished March 0-9 on the road. Their last win away from home was Feb. 24 at Philadelphia. . Drummond had his Eastern Conference-best 49th double-double. . Bucks G O.J. Mayo (right ankle) was in uniform Monday but did not play for the third straight game."}
