{"game_id": "0021200341", "chunk_id": "0021200341_001", "order": 1, "role": "lead", "text": "CHICAGO --  The Chicago Bulls have relied on their defense while star guard Derrick Rose rehabs his serious knee injury."}
{"game_id": "0021200341", "chunk_id": "0021200341_002", "order": 2, "role": "body", "text": "It worked again Saturday night."}
{"game_id": "0021200341", "chunk_id": "0021200341_003", "order": 3, "role": "body", "text": "Joakim Noah helped force a key turnover and rookie point guard Marquis Teague played tough defense on Deron Williams in the final seconds, helping Chicago rally for an 83-82 win over the Brooklyn Nets."}
{"game_id": "0021200341", "chunk_id": "0021200341_004", "order": 4, "role": "body", "text": "Noah also had 12 points and 10 rebounds as Chicago (13-9) won for the fifth time in six games."}
{"game_id": "0021200341", "chunk_id": "0021200341_005", "order": 5, "role": "body", "text": "Brooklyn had a chance to tie it in the final seconds, but Williams missed a jumper with Teague defending him."}
{"game_id": "0021200341", "chunk_id": "0021200341_006", "order": 6, "role": "body", "text": "\"Marquis stayed ready to play,\" Bulls coach Tom Thibodeau said. \"Marquis has made some significant strides defensively.\""}
{"game_id": "0021200341", "chunk_id": "0021200341_007", "order": 7, "role": "body", "text": "The 19-year-old Teague has played a career-high 20 minutes in each of the last two games with Kirk Hinrich battling a knee injury. He finished with eight points and four fouls, spending much of his time chasing Williams around the court."}
{"game_id": "0021200341", "chunk_id": "0021200341_008", "order": 8, "role": "body", "text": "\"I was just trying to contain him, just keep him in front of me,\" Teague said. \"It's hard to keep a player like that from scoring.\""}
{"game_id": "0021200341", "chunk_id": "0021200341_009", "order": 9, "role": "body", "text": "Noah and Luol Deng trapped Joe Johnson late in the game, resulting in one of Brooklyn's 18 turnovers. Deng turned the mistake into a basket that tied it at 79."}
{"game_id": "0021200341", "chunk_id": "0021200341_010", "order": 10, "role": "body", "text": "\"They surprised us with a couple of double teams,\" Nets coach Avery Johnson said. \"Had we done a better job of taking care of the ball, especially down the stretch, we could have come out on the winning end.\""}
{"game_id": "0021200341", "chunk_id": "0021200341_011", "order": 11, "role": "body", "text": "Brook Lopez had 18 points and 10 rebounds for Brooklyn, which played for the fourth time in five days. The Nets won at home Friday night, beating Detroit 107-105 in double overtime."}
{"game_id": "0021200341", "chunk_id": "0021200341_012", "order": 12, "role": "body", "text": "Marco Belinelli led Chicago with 19 points. He made a layup and two free throws to cap an 8-0 run in the closing minutes."}
{"game_id": "0021200341", "chunk_id": "0021200341_013", "order": 13, "role": "body", "text": "Belinelli also hit the Bulls' only 3-pointers of the game. Chicago shot 2 of 10 from long range overall, but still managed to eke out another close win. All but two of Chicago's wins have come by 10 points or fewer."}
{"game_id": "0021200341", "chunk_id": "0021200341_014", "order": 14, "role": "body", "text": "\"We played great defense the last three or four minutes,\" Belinelli said. \"That's why we won the game.\""}
{"game_id": "0021200341", "chunk_id": "0021200341_015", "order": 15, "role": "body", "text": "Deng scored 17 points and Carlos Boozer added 15 for Chicago."}
{"game_id": "0021200341", "chunk_id": "0021200341_016", "order": 16, "role": "body", "text": "Williams, who played 43 minutes the night before, was on the court for 35 minutes against Chicago and created plenty of problems for the short-handed Bulls."}
{"game_id": "0021200341", "chunk_id": "0021200341_017", "order": 17, "role": "body", "text": "He made it to the free throw line 13 times and kept both Teague and Nate Robinson in foul trouble throughout the game."}
{"game_id": "0021200341", "chunk_id": "0021200341_018", "order": 18, "role": "body", "text": "\"You are never going to be able to stop a guy like Deron Williams,\" Thibodeau said. \"You just have to make him work.\""}
{"game_id": "0021200341", "chunk_id": "0021200341_019", "order": 19, "role": "body", "text": "Johnson scored 16 points in 38 minutes. On Friday night, he played 52 minutes and hit a buzzer-beater for the win."}
{"game_id": "0021200341", "chunk_id": "0021200341_020", "order": 20, "role": "body", "text": "Lopez played 25 minutes in his second game back since an injured right foot cost him seven games. He seemed to be the least sluggish of the Nets on the floor at the start, hitting his first five shots and scoring Brooklyn's first six points. He finished 8 of 17 from the floor."}
{"game_id": "0021200341", "chunk_id": "0021200341_021", "order": 21, "role": "body", "text": "\"Physically I felt good,\" Lopez said. \"But I missed a lot tonight. I have to keep working on getting my touch back.\""}
{"game_id": "0021200341", "chunk_id": "0021200341_022", "order": 22, "role": "body", "text": "Williams hit two free throws to cap a 13-point first quarter and give the Nets a one-point advantage."}
{"game_id": "0021200341", "chunk_id": "0021200341_023", "order": 23, "role": "body", "text": "Robinson ignited the crowd with a hustle play in the first, running back after making a layup to block MarShon Brooks' bid to catch the Bulls off guard."}
{"game_id": "0021200341", "chunk_id": "0021200341_024", "order": 24, "role": "body", "text": "Robinson scored eight points and committed only one turnover starting in place of Hinrich."}
{"game_id": "0021200341", "chunk_id": "0021200341_025", "order": 25, "role": "closing", "text": "Game notes Thibodeau said Hinrich is \"getting better, but not quite there yet.\" He was reluctant to specify anything beyond Hinrich's day-to-day status. ... Nets F Gerald Wallace, who scored a season-high 25 points in 50 minutes Friday night, scored six points in 38 minutes against the Bulls."}
