{"game_id": "0021201176", "chunk_id": "0021201176_001", "order": 1, "role": "lead", "text": "TORONTO --  The way they're struggling against losing teams right now, the Chicago Bulls are probably looking forward to Sunday's matchup with the Miami Heat."}
{"game_id": "0021201176", "chunk_id": "0021201176_002", "order": 2, "role": "body", "text": "Amir Johnson had 24 points and nine rebounds, Rudy Gay scored 23 points and the Toronto Raptors earned their second straight win over Chicago, beating the Bulls 97-88 on Friday night."}
{"game_id": "0021201176", "chunk_id": "0021201176_003", "order": 3, "role": "body", "text": "Playoff-bound Chicago has lost four of its past five meetings with lottery-bound opponents, also losing at Detroit and Washington in the past 11 days."}
{"game_id": "0021201176", "chunk_id": "0021201176_004", "order": 4, "role": "body", "text": "\"You've got to be ready for everybody,\" Bulls coach Tom Thibodeau said. \"Everyone is capable of beating you.\""}
{"game_id": "0021201176", "chunk_id": "0021201176_005", "order": 5, "role": "body", "text": "\"Sometimes you have travel involved or you're down players but you've still got to be ready,\" he added. \"You've still got to get it done. It's that simple.\""}
{"game_id": "0021201176", "chunk_id": "0021201176_006", "order": 6, "role": "body", "text": "While they've come up short against the NBA's lesser lights in recent meetings, the Bulls have fared better against fellow playoff contenders. They halted Miami's 27-game win streak last month, won at Brooklyn last week and snapped New York's 13-game winning streak with an overtime triumph on Thursday."}
{"game_id": "0021201176", "chunk_id": "0021201176_007", "order": 7, "role": "body", "text": "\"That's the nature of the league,\" Thibodeau said. \"What happened yesterday has little bearing on today.\""}
{"game_id": "0021201176", "chunk_id": "0021201176_008", "order": 8, "role": "body", "text": "Boozer said he had no explanation for Chicago's poor run of results against lower-tier opponents."}
{"game_id": "0021201176", "chunk_id": "0021201176_009", "order": 9, "role": "body", "text": "\"You have to forget it and move on to the next one, you can't dwell on it,\" he said."}
{"game_id": "0021201176", "chunk_id": "0021201176_010", "order": 10, "role": "body", "text": "Kyle Lowry had 13 points, 11 assists and nine rebounds, and DeMar DeRozan scored 19 points for the Raptors, who were coming off a 101-98 win in Chicago on Tuesday night."}
{"game_id": "0021201176", "chunk_id": "0021201176_011", "order": 11, "role": "body", "text": "\"Defensively we made it tough on them,\" Toronto coach Dwane Casey said. \"We made them earn every inch of the court.\""}
{"game_id": "0021201176", "chunk_id": "0021201176_012", "order": 12, "role": "body", "text": "Quincy Acy had 10 points and nine rebounds as Toronto won for the fourth time in five games."}
{"game_id": "0021201176", "chunk_id": "0021201176_013", "order": 13, "role": "body", "text": "Chicago's Carlos Boozer fouled out with 19 points and 12 rebounds in 31 minutes, his 11th double-double in the past 13 games."}
{"game_id": "0021201176", "chunk_id": "0021201176_014", "order": 14, "role": "body", "text": "Nate Robinson scored 17 points, Nazr Mohammed had 16 points and 13 rebounds, and Luol Deng added 10 points as the Bulls lost for the third time in four games and lost any hope of earning home-court advantage in the first round of the playoffs."}
{"game_id": "0021201176", "chunk_id": "0021201176_015", "order": 15, "role": "body", "text": "\"They made shots, we didn't,\" Mohammed said. \"We didn't get the stops when we needed them and we didn't execute the way we normally do.\""}
{"game_id": "0021201176", "chunk_id": "0021201176_016", "order": 16, "role": "body", "text": "Bulls guard Richard Hamilton was ejected with 5:33 left in the third after being called for a flagrant foul on DeRozan. Hamilton was tossed after intentionally colliding with DeRozan and attempting to punch him in the face. He was called for a flagrant 2, which carries an automatic ejection."}
{"game_id": "0021201176", "chunk_id": "0021201176_017", "order": 17, "role": "body", "text": "\"I hate to see him get thrown out of a game but there was a lot of grabbing and holding,\" Thibodeau said. \"We've got to handle that better.\""}
{"game_id": "0021201176", "chunk_id": "0021201176_018", "order": 18, "role": "body", "text": "Casey said he had no problems with his players adopting an antagonistic style."}
{"game_id": "0021201176", "chunk_id": "0021201176_019", "order": 19, "role": "body", "text": "\"We want to make guys uncomfortable and play with that kind of edge,\" Casey said. \"We want to frustrate players instead of being frustrated.\""}
{"game_id": "0021201176", "chunk_id": "0021201176_020", "order": 20, "role": "body", "text": "Deng made his second straight start for the Bulls after missing two games with a sore right hip, but Chicago was without center Joakim Noah (right foot) for the 11th time in 12 games, while forward Taj Gibson (left knee) missed his sixth straight game."}
{"game_id": "0021201176", "chunk_id": "0021201176_021", "order": 21, "role": "body", "text": "Aaron Gray started for the Raptors in place of rookie center Jonas Valanciunas, who left Tuesday's win at Chicago after colliding with Gay and injuring his neck."}
{"game_id": "0021201176", "chunk_id": "0021201176_022", "order": 22, "role": "body", "text": "Toronto was also without rookie guard Terrence Ross (left ankle) and swingman Landry Fields (illness)."}
{"game_id": "0021201176", "chunk_id": "0021201176_023", "order": 23, "role": "body", "text": "Johnson made his career-high third 3-pointer of the season with 5:55 left, putting Toronto up 85-76, but a 3 by Chicago's Marco Belinelli cut it to 90-84 with 2:55 left."}
{"game_id": "0021201176", "chunk_id": "0021201176_024", "order": 24, "role": "body", "text": "Johnson responded with a dunk and Gay hit a 3, giving the Raptors a 95-84 lead with 2:18 remaining."}
{"game_id": "0021201176", "chunk_id": "0021201176_025", "order": 25, "role": "body", "text": "\"We just didn't have what it took to make a push in the fourth quarter to try and steal the game,\" Bulls guard Kirk Hinrich said. \"The game was still in reach, we just could never string stops together or make buckets to make it a close game.\""}
{"game_id": "0021201176", "chunk_id": "0021201176_026", "order": 26, "role": "body", "text": "Boozer made his first six field goals of the game and scored 13 in the first. Toronto trailed 19-8 with 5:12 left in the quarter but closed the period on a 12-3 run, cutting the gap to 22-20."}
{"game_id": "0021201176", "chunk_id": "0021201176_027", "order": 27, "role": "body", "text": "Acy put the Raptors in front on an alley-oop dunk with 1:09 left in the second, and the Raptors led 47-43 at the half."}
{"game_id": "0021201176", "chunk_id": "0021201176_028", "order": 28, "role": "body", "text": "Gay scored eight in the third and Toronto led 67-52 with 4:19 left but Robinson and Jimmy Butler each scored five as the Bulls cut it to 73-65 heading into the fourth."}
{"game_id": "0021201176", "chunk_id": "0021201176_029", "order": 29, "role": "body", "text": "Butler came in having scored in double figures in nine of his previous 10 games but struggled in this one, making just two of six shots and scoring seven points."}
{"game_id": "0021201176", "chunk_id": "0021201176_030", "order": 30, "role": "closing", "text": "Game notes Toronto went 27 for 33 from the free throw line while the Chicago finished 11 for 14. ... The Bulls dropped to 12-2 on Fridays. ... Acy and Gay each had three blocked shots. ... Actors Morris Chestnut and Shane West attended the game."}
