{"game_id": "0021700690", "chunk_id": "0021700690_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Marc Gasol and Tyreke Evans led the Memphis Grizzlies in scoring, yet it was the play of a recent two-way signee that provided the spark for a fourth-quarter comeback."}
{"game_id": "0021700690", "chunk_id": "0021700690_002", "order": 2, "role": "body", "text": "Myke Henry connected on a 3-pointer late in the third quarter -- his first NBA points -- then added nine more points in the fourth as Memphis erased a double-digit fourth-quarter deficit to beat the Philadelphia 76ers 105-101 on Monday night."}
{"game_id": "0021700690", "chunk_id": "0021700690_003", "order": 3, "role": "body", "text": "Henry, who was signed by the Grizzlies on Jan. 13, was 3 of 5 from the field in the fourth, including converting two of his three 3-point attempts. That and 10 fourth-quarter points from Evans, who finished with 18 points and eight assists, helped Memphis come back from 10 down with 9:45 left."}
{"game_id": "0021700690", "chunk_id": "0021700690_004", "order": 4, "role": "body", "text": "Consecutive 3-pointers by Henry started the Grizzlies in the right direction. Eventually, Memphis used a 13-2 burst to take their first lead of the night."}
{"game_id": "0021700690", "chunk_id": "0021700690_005", "order": 5, "role": "body", "text": "\"Life comes at you fast, and you, obviously, have to be ready for changes,\" Henry said. \"I was ready. It's been a journey, and I'm just taking it day-by-day.\""}
{"game_id": "0021700690", "chunk_id": "0021700690_006", "order": 6, "role": "body", "text": "Memphis took the lead for good when Gasol's 3-pointer broke a 95-all tie with 4:16 remaining."}
{"game_id": "0021700690", "chunk_id": "0021700690_007", "order": 7, "role": "body", "text": "Gasol scored 19 points, Mario Chalmers added 17 points, including a pair of free throws with 6.2 seconds remaining, to seal a victory that seemed unlikely when Memphis faced a 15-point deficit late in the third and trailed 83-74 entering the fourth."}
{"game_id": "0021700690", "chunk_id": "0021700690_008", "order": 8, "role": "body", "text": "\"When we were up 14 or 15 points, we come in and we let them sort of back in, get a little momentum,\" Sixers coach Brett Brown said of the difference. He later added that \"we started the fourth period pretty poorly.\""}
{"game_id": "0021700690", "chunk_id": "0021700690_009", "order": 9, "role": "body", "text": "Dario Saric led the Sixers with 22 points and added 10 rebounds, and Timothe Luwawu-Cabarott finished with a season-high 20 points. Robert Covington added 18 points and Joel Embiid had 15 points and 14 rebounds as the Sixers ended a three-game winning streak."}
{"game_id": "0021700690", "chunk_id": "0021700690_010", "order": 10, "role": "body", "text": "The Sixers hurt themselves with 10 of their 24 turnovers in the fourth. Memphis collected 20 points off Philadelphia's 10 miscues down the stretch."}
{"game_id": "0021700690", "chunk_id": "0021700690_011", "order": 11, "role": "body", "text": "\"Poise. Lack of judgment. Leadership. I thought that we had not much leadership,\" Brown said of the play down the stretch. \"I thought our poise was poor.\""}
{"game_id": "0021700690", "chunk_id": "0021700690_012", "order": 12, "role": "body", "text": "Evans said the key for the Grizzles was young players stepping up and helping Memphis overcome the third-quarter deficit."}
{"game_id": "0021700690", "chunk_id": "0021700690_014", "order": 14, "role": "body", "text": "\"He was just playing the game, taking what the defense gave him,\" Evans said, adding: \"That's the first time seeing him play like that. He helped a lot.\""}
{"game_id": "0021700690", "chunk_id": "0021700690_016", "order": 16, "role": "body", "text": "Sixers: Have reached 100 points in 34 of 43 games and 10 of last 11. ... Have lost 10 straight in the series. ... Saric has reached double figures in 24 straight games. ... Luwawu-Cabarott started his third game of the season. ... Ben Simmons, the Sixers third-leading scorer at 16.6 points a game, was limited to six points on 3 of 8 from the field."}
{"game_id": "0021700690", "chunk_id": "0021700690_017", "order": 17, "role": "body", "text": "Grizzlies: G Wayne Selden received two technicals -- the second in the third quarter. ... Has a five-game home winning streak. ... Memphis shot 42 percent in the game, compared to 45 percent for Philadelphia -- only the third time this season Memphis has won when shooting a lower field goal percentage. ... The 15-point deficit was the largest the Grizzlies have overcome in a win this season."}
{"game_id": "0021700690", "chunk_id": "0021700690_019", "order": 19, "role": "body", "text": "To no one's surprise, the Sixers have a seat on the Philadelphia Eagles bandwagon headed to the Super Bowl. The Sixers left Philly earlier than planned Sunday so they could arrive in Memphis before the NFC Championship game between the Eagles and Vikings."}
{"game_id": "0021700690", "chunk_id": "0021700690_020", "order": 20, "role": "body", "text": "\"What an amazing event for (Philadelphia),\" coach Brett Brown said."}
{"game_id": "0021700690", "chunk_id": "0021700690_021", "order": 21, "role": "body", "text": "He said enthusiasm is clear across the city, including during the Sixers' win at home Saturday against the Milwaukee Bucks."}
{"game_id": "0021700690", "chunk_id": "0021700690_022", "order": 22, "role": "body", "text": "\"The place (was) about the blow up.\" He said the atmosphere is \"just maniacal, just bananas what's going on in our city.\""}
{"game_id": "0021700690", "chunk_id": "0021700690_024", "order": 24, "role": "body", "text": "Sixers: Host the Chicago Bulls on Wednesday night."}
{"game_id": "0021700690", "chunk_id": "0021700690_025", "order": 25, "role": "body", "text": "Grizzlies: Host the San Antonio Spurs on Wednesday night."}
{"game_id": "0021700690", "chunk_id": "0021700690_027", "order": 27, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
