{"game_id": "0021700331", "chunk_id": "0021700331_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  After dismantling the Sacramento Kings on the road earlier in the week, Milwaukee Bucks coach Jason Kidd worried about a possible letdown as the teams met in a rematch on Saturday night."}
{"game_id": "0021700331", "chunk_id": "0021700331_002", "order": 2, "role": "body", "text": "\"We came off a long road trip and this was a trap game,\" Kidd said."}
{"game_id": "0021700331", "chunk_id": "0021700331_003", "order": 3, "role": "body", "text": "Much like they did in the earlier meeting, the Bucks raced to a big early lead. This time, the Kings fought back and overcame a 20-point, second-half deficit before falling to the Bucks 109-104."}
{"game_id": "0021700331", "chunk_id": "0021700331_004", "order": 4, "role": "body", "text": "\"They kept playing and we were just going through the motions,\" Kidd said. \"You have to give those guys credit. They were down and kept playing and made a game of it. We got the win but it wasn't pretty.\""}
{"game_id": "0021700331", "chunk_id": "0021700331_005", "order": 5, "role": "body", "text": "Giannis Antetokounmpo scored 33 points, made a season-high 17 free throws and had 13 rebounds for the Bucks."}
{"game_id": "0021700331", "chunk_id": "0021700331_006", "order": 6, "role": "body", "text": "\"I think we did a good job starting the game, playing hard and moving the ball and just setting the tone,\" Antetokounmpo said. \"We've got to do a better job keeping the lead and finishing the game up.\""}
{"game_id": "0021700331", "chunk_id": "0021700331_007", "order": 7, "role": "body", "text": "Khris Middleton added 25 points and Eric Bledsoe had 18. Milwaukee beat the Kings 112-87 on Tuesday night in Sacramento."}
{"game_id": "0021700331", "chunk_id": "0021700331_008", "order": 8, "role": "body", "text": "\"It's frustrating but at the end of the day we got the win,\" Bledsoe said. \"I thought we did a great job keeping our composure.\""}
{"game_id": "0021700331", "chunk_id": "0021700331_009", "order": 9, "role": "body", "text": "Zach Randolph led the Kings with 22 points, and Buddy Hield added 19. They were coming off a victory Friday night in Chicago."}
{"game_id": "0021700331", "chunk_id": "0021700331_010", "order": 10, "role": "body", "text": "The Bucks led by as many as 20 in the third quarter and took a 12-point advantage into fourth."}
{"game_id": "0021700331", "chunk_id": "0021700331_011", "order": 11, "role": "body", "text": "\"They kind of pushed us around, we turned the ball over and didn't play with any energy,\" Sacramento coach Dave Joerger said. \"The guys didn't quit, though. They kept fighting.\""}
{"game_id": "0021700331", "chunk_id": "0021700331_012", "order": 12, "role": "body", "text": "Milwaukee's shooting went cold for an extended stretch in the fourth, allowing the Kings to pull to 100-96 on Garrett Temple's 3-pointer with 3:19 remaining."}
{"game_id": "0021700331", "chunk_id": "0021700331_013", "order": 13, "role": "body", "text": "After Antetokounmpo's two free throws, Bogdan Bogdanovic connected on a 3-pointer to pull the Kings within three points. After the Bucks came up empty again, Bogdanovic made two free throws to cut the lead to one with less than 2 minutes remaining."}
{"game_id": "0021700331", "chunk_id": "0021700331_014", "order": 14, "role": "body", "text": "John Henson's hook shot and two free throws by Antetokounmpo put the Bucks up 106-101. Middleton sealed the win with two free throws."}
{"game_id": "0021700331", "chunk_id": "0021700331_015", "order": 15, "role": "body", "text": "Milwaukee jumped to a 14-0 lead, taking advantage of five Kings turnovers. The Kings scored their first points on Randolph's jumper with 7:44 remaining in the first. Sacramento trailed by 16 at one point, finished with eight turnovers and was down 33-25 after the quarter."}
{"game_id": "0021700331", "chunk_id": "0021700331_016", "order": 16, "role": "body", "text": "\"We just have to get off to a better start. We're better than that,\" Randolph said."}
{"game_id": "0021700331", "chunk_id": "0021700331_018", "order": 18, "role": "body", "text": "Antetokounmpo attempted a career-high 22 free throws. \"We have to be in attack mode,\" he said. Antetokounmpo \"set the tone early\" with his aggressive play and by getting to the line, Kidd said."}
{"game_id": "0021700331", "chunk_id": "0021700331_019", "order": 19, "role": "body", "text": "The Bucks made a season-high 35 free throws on 42 attempts, also a season high."}
{"game_id": "0021700331", "chunk_id": "0021700331_021", "order": 21, "role": "body", "text": "Kings: Willie Cauley-Stein sustained a lower back strain in the second quarter after falling awkwardly on a layup and didn't return. ... With the Kings down 12-0 3 minutes into the game, Joerger replaced his entire lineup at once. Joerger picked up a technical foul a short time later after storming onto the court to argue a foul call. Joerger said gaining mental toughness is part of the maturation process for his young team. \"Playing the second night back-to-back. There's a mental toughness to that,\" he said."}
{"game_id": "0021700331", "chunk_id": "0021700331_022", "order": 22, "role": "body", "text": "Bucks: Recalled guard Sterling Brown and forward D.J. Wilson from the Wisconsin Herd of the NBA G League. ... Returned home after a 3-1 trip against Western Conference foes."}
{"game_id": "0021700331", "chunk_id": "0021700331_024", "order": 24, "role": "body", "text": "Kings: At Cleveland on Wednesday night."}
{"game_id": "0021700331", "chunk_id": "0021700331_025", "order": 25, "role": "closing", "text": "Bucks: At Boston on Monday night."}
