{"game_id": "0021200977", "chunk_id": "0021200977_001", "order": 1, "role": "lead", "text": "DENVER --  The Denver Nuggets plodded along for three quarters before beating Memphis at its own game."}
{"game_id": "0021200977", "chunk_id": "0021200977_002", "order": 2, "role": "body", "text": "Hardly known as a half-court team, the high-flying Nuggets had to resort to set plays and setting picks to finally break free."}
{"game_id": "0021200977", "chunk_id": "0021200977_003", "order": 3, "role": "body", "text": "Turns out, they're pretty good at it, especially when they dump the ball inside to Kosta Koufos."}
{"game_id": "0021200977", "chunk_id": "0021200977_004", "order": 4, "role": "body", "text": "Koufos scored 18 points and grabbed a career-high 16 rebounds, helping the Nuggets rally to knock off the Grizzlies 87-80 on Friday night for their 11th straight victory, their longest streak in 30 years."}
{"game_id": "0021200977", "chunk_id": "0021200977_005", "order": 5, "role": "body", "text": "This is definitely an offense Koufos could get used to."}
{"game_id": "0021200977", "chunk_id": "0021200977_007", "order": 7, "role": "body", "text": "\"We want to maintain being a running team,\" the 7-foot center said. \"We need to keep going and attacking.\""}
{"game_id": "0021200977", "chunk_id": "0021200977_008", "order": 8, "role": "body", "text": "That wasn't possible against the Grizzlies, the best defensive team in the league. They clogged the passing lanes and clamped down on fast breaks. The Nuggets were growing frustrated, too, and the crowd restless."}
{"game_id": "0021200977", "chunk_id": "0021200977_009", "order": 9, "role": "body", "text": "The Nuggets hadn't been shut down like this in quite a while, especially at home, where they've now won 15 straight games to run their record at Pepsi Center to 30-3."}
{"game_id": "0021200977", "chunk_id": "0021200977_010", "order": 10, "role": "body", "text": "Then along came Kenneth Faried, providing a much-needed spark with his energetic play. The player known as \"Manimal\" was blocking shots, hustling for rebounds and pestering Zach Randolph, the Grizzlies' force up front who had 18 points and 18 rebounds."}
{"game_id": "0021200977", "chunk_id": "0021200977_011", "order": 11, "role": "body", "text": "With the Nuggets trailing 66-58 heading into the fourth quarter, Faried helped them go on a 17-4 run and seize back the momentum. That's exactly why he's on the court."}
{"game_id": "0021200977", "chunk_id": "0021200977_012", "order": 12, "role": "body", "text": "\"I saw my teammates were not their usual selves -- guys weren't doing what they usually do,\" said Faried, who finished with eight points and four blocked shots. \"It seemed like we were in a struggle offensively, couldn't score the ball. I just played hard and brought some energy. I believed it helped tonight, gave a boost to my teammates.\""}
{"game_id": "0021200977", "chunk_id": "0021200977_013", "order": 13, "role": "body", "text": "That it did. Winning this way also showed the Nuggets they can play any way necessary."}
{"game_id": "0021200977", "chunk_id": "0021200977_014", "order": 14, "role": "body", "text": "\"I thought this was a good test for us,\" Nuggets coach George Karl said. \"I said at the beginning of the fourth quarter, `This is good for us. We'll find out how we have to do it -- can we do it?'"}
{"game_id": "0021200977", "chunk_id": "0021200977_015", "order": 15, "role": "body", "text": "\"I thought Kenneth was great. I thought Kosta -- those guys, in a big game, played at a very important level for us.\""}
{"game_id": "0021200977", "chunk_id": "0021200977_016", "order": 16, "role": "body", "text": "The last time the Nuggets won 11 straight was Feb. 24 to March. 15, 1983."}
{"game_id": "0021200977", "chunk_id": "0021200977_017", "order": 17, "role": "body", "text": "The Grizzlies, Nuggets and Los Angeles Clippers are now tightly bunched in the race for the third seed in the Western Conference, with only a half-game separating the teams."}
{"game_id": "0021200977", "chunk_id": "0021200977_018", "order": 18, "role": "body", "text": "\"We understand where the standings are at,\" said Mike Conley, whose team had its six-game winning streak snapped. \"But we still have 20 games left and anything can happen from there. We're just worried about tomorrow.\""}
{"game_id": "0021200977", "chunk_id": "0021200977_019", "order": 19, "role": "body", "text": "This was a matchup of two of the hottest teams in the NBA not named the Miami Heat. It also was a game of contrasting styles, with Denver trying to push the pace and Memphis preferring to play at a more deliberate tempo."}
{"game_id": "0021200977", "chunk_id": "0021200977_020", "order": 20, "role": "body", "text": "Early on, the Nuggets controlled the rhythm -- and the game -- as they led by as many as nine in the first half. Jerryd Bayless beat the buzzer with a layup just before halftime to send the Grizzlies into the locker room trailing just 48-47."}
{"game_id": "0021200977", "chunk_id": "0021200977_021", "order": 21, "role": "body", "text": "After halftime, the Grizzlies began rolling by slowing things down. They also turned the pressure up a notch and held Denver to a season-low 10 points in the third quarter to take a 66-58 lead."}
{"game_id": "0021200977", "chunk_id": "0021200977_022", "order": 22, "role": "body", "text": "For three quarters, the Nuggets were lethargic and couldn't match the energy of Wednesday, when they thumped the New York Knicks in Carmelo Anthony's first return to the city since he was traded two years ago."}
{"game_id": "0021200977", "chunk_id": "0021200977_024", "order": 24, "role": "body", "text": "\"You grow playing these kinds of games,\" said Danilo Gallinari, who finished with 15 points, including two free throws to break a tie with just over two minutes remaining. \"You cannot grow a lot when you're blowing out a team by 20 or 30. These are the kind of games that make you improve as a team.\""}
{"game_id": "0021200977", "chunk_id": "0021200977_025", "order": 25, "role": "body", "text": "Marc Gasol couldn't agree more."}
{"game_id": "0021200977", "chunk_id": "0021200977_026", "order": 26, "role": "body", "text": "\"I don't see it as a setback. We feel confident in the way we can play this team,\" said Gasol, who chipped in 14 points. \"We played this team well for 36 minutes. Then we tried to play their basketball. We kind of played that way for 12 minutes and they won. But I think for 36 minutes we played good basketball but games last 48 minutes, not 36.\""}
{"game_id": "0021200977", "chunk_id": "0021200977_027", "order": 27, "role": "closing", "text": "Game notes The Grizzlies have been on a 15-5 roll since a three-team deal on Jan. 30 that sent Rudy Gay to Toronto and landed Tayshaun Prince in Memphis. ... Denver has won 26 of its last 28 home games against Memphis. ... The Nuggets are 28-3 when allowing 100 or fewer points."}
