{"game_id": "0021700145", "chunk_id": "0021700145_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  Luke Walton realizes the Los Angeles Lakers will have to climb a steep learning curve as long as they're starting two rookies and a second-year pro who recently turned 20."}
{"game_id": "0021700145", "chunk_id": "0021700145_002", "order": 2, "role": "body", "text": "The exciting youngsters are learning how to survive the NBA's perils from veterans Brook Lopez and Kentavious Caldwell-Pope, who led the way to another win for a rapidly evolving team."}
{"game_id": "0021700145", "chunk_id": "0021700145_003", "order": 3, "role": "body", "text": "Lopez scored 21 points, Brandon Ingram added 20 and the Lakers blew most of a 22-point lead before hanging on for their third victory in four games, 107-102 over the Memphis Grizzlies on Sunday night."}
{"game_id": "0021700145", "chunk_id": "0021700145_004", "order": 4, "role": "body", "text": "Rookie Kyle Kuzma had 13 points and 12 rebounds in his second career start as the Lakers beat Memphis at Staples Center for the fourth straight time despite the Grizzlies' furious late rally. That's all part of the plan for the Lakers, who improved to 5-5 with another resilient effort."}
{"game_id": "0021700145", "chunk_id": "0021700145_005", "order": 5, "role": "body", "text": "\"When we're playing aggressive like that, when we're defending like that, or communicating like that, we're in the game, which is not easy at this level,\" Walton said. \"There's a lot of really good teams out there. We've played and competed and even beat a few of them so far. But I think for our young players, it shows them firsthand what that's all about.\""}
{"game_id": "0021700145", "chunk_id": "0021700145_006", "order": 6, "role": "body", "text": "Los Angeles got at least nine points from seven players, including 15 apiece from Caldwell-Pope and Jordan Clarkson."}
{"game_id": "0021700145", "chunk_id": "0021700145_007", "order": 7, "role": "body", "text": "Tyreke Evans scored 26 points and Mike Conley added 11 of his 23 in the fourth quarter for the Grizzlies, who trailed by 15 points with 5:18 to play before rallying."}
{"game_id": "0021700145", "chunk_id": "0021700145_008", "order": 8, "role": "body", "text": "Memphis trimmed the Lakers' lead to 103-100 with 42 seconds left on Dillon Brooks' free throws after a flagrant foul by Lopez."}
{"game_id": "0021700145", "chunk_id": "0021700145_009", "order": 9, "role": "body", "text": "But Caldwell-Pope swiped the ball from James Ennis III moments before hitting a jumper with 19.1 seconds to play. Lopez added two free throws with 5.5 seconds left to seal it."}
{"game_id": "0021700145", "chunk_id": "0021700145_010", "order": 10, "role": "body", "text": "\"Those guys have played a lot of NBA games, and a lot of us have only played 10 NBA games,\" Kuzma said. \"It's big for them to step up and lead.\""}
{"game_id": "0021700145", "chunk_id": "0021700145_011", "order": 11, "role": "body", "text": "Marc Gasol had 15 points, 10 rebounds and seven assists for the Grizzlies, who have lost three of four. One night after opening a five-game road trip with a win over the Clippers, Memphis ran out of time to counter the Lakers' third-quarter surge to an 86-64 lead."}
{"game_id": "0021700145", "chunk_id": "0021700145_012", "order": 12, "role": "body", "text": "\"It was a tough (third) quarter,\" Memphis coach David Fizdale said. \"They really got after us. The thing that I was most happy about is the resolve we showed, and our huddles were awesome. Guys were really encouraging each other.\""}
{"game_id": "0021700145", "chunk_id": "0021700145_014", "order": 14, "role": "body", "text": "Grizzlies: Chandler Parsons sat out to rest. ... Brooks scored 13 points in his second straight start. ... Kanye West watched from courtside and chatted with Conley at halftime. Conley recently said the music mogul once called him out of the blue to say he's a big fan, and that he thinks Conley is wildly underrated."}
{"game_id": "0021700145", "chunk_id": "0021700145_015", "order": 15, "role": "body", "text": "Lakers: Caldwell-Pope scored nine points in a two-minute burst during the third quarter before going down heavily underneath the basket. He eventually walked to the locker room without aid and returned to the bench several minutes later. The team said he injured his left hip. ... C Andrew Bogut sat out with back tightness. ... Dodgers outfielder Yasiel Puig got wild cheers when he appeared on the video board. Nashville Predators defensemen P.K. Subban and Roman Josi also attended the game."}
{"game_id": "0021700145", "chunk_id": "0021700145_017", "order": 17, "role": "body", "text": "One game after dropping 34 points on his former Brooklyn Nets teammates, Lopez had another big offensive night with four 3-pointers and five assists. He relished his matchup with Gasol, praising the Spaniard as one of the NBA's toughest tasks for a big man."}
{"game_id": "0021700145", "chunk_id": "0021700145_019", "order": 19, "role": "body", "text": "\"We just waited too long to have that sense of urgency to win the game,\" Conley said. \"We have to be better, especially on the second game of a back-to-back against a young team. We didn't start the way we wanted to. It's very tough. You can't spot anybody in this league points. People are too talented. Teams are too good. Unfortunately, we just didn't have what it took early on.\""}
{"game_id": "0021700145", "chunk_id": "0021700145_021", "order": 21, "role": "body", "text": "Lonzo Ball had nine points on 3-for-13 shooting in his latest tough night from the field, but the No. 2 overall pick added nine assists and three rebounds with just two turnovers in 35 minutes. Ball was 1 for 8 on 3-pointers, making him 11 for 47 beyond the arc this season."}
{"game_id": "0021700145", "chunk_id": "0021700145_023", "order": 23, "role": "body", "text": "Grizzlies: At Portland Trail Blazers on Tuesday."}
{"game_id": "0021700145", "chunk_id": "0021700145_024", "order": 24, "role": "body", "text": "Lakers: Open a four-game road trip against the Boston Celtics on Wednesday in the latest chapter of the classic NBA rivalry."}
{"game_id": "0021700145", "chunk_id": "0021700145_026", "order": 26, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
