{"game_id": "0021700477", "chunk_id": "0021700477_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  The Oklahoma City Thunder like their chances with the ball in Russell Westbrook's hands at the end of a game."}
{"game_id": "0021700477", "chunk_id": "0021700477_002", "order": 2, "role": "body", "text": "Westbrook hit a 3-pointer with 1.7 seconds left to cap a 30-point, 15-assist outing, and the Thunder held off the resilient Hawks 120-117 on Friday night. Carmelo Anthony added 24 points on 7-of-12 3-point shooting and Paul George scored 17 for the Thunder, who have won five of their last six after a 12-14 start."}
{"game_id": "0021700477", "chunk_id": "0021700477_003", "order": 3, "role": "body", "text": "\"I think we know now how to close and where we're going to to close,\" George said. \"Russ is our leader. ... We knew that we could kind of mess them up with the play that we had, cause some confusion. They backed off and Russ had an easy, open opportunity. Russ is as good as anybody when it's closing time.\""}
{"game_id": "0021700477", "chunk_id": "0021700477_004", "order": 4, "role": "body", "text": "Atlanta, in last place in the Southeast Division, made Oklahoma City work for this one, rallying after falling behind by 16 points in the first half, and again by seven in the final minutes. Marco Belinelli scored 30 points to lead Atlanta. Ersan Ilyasova added 22 points for the Hawks, who went 15 of 32 from 3-point range."}
{"game_id": "0021700477", "chunk_id": "0021700477_005", "order": 5, "role": "body", "text": "\"There are a lot of things you can learn from a game like tonight,\" Atlanta coach Mike Budenholzer said. \"It's tough to not have the shot or the bounce at the end of the game, but to compete and play the way we did, really both halves, but particularly the second half ... hopefully our team can take something from tonight about how we played.\""}
{"game_id": "0021700477", "chunk_id": "0021700477_006", "order": 6, "role": "body", "text": "The Hawks led 92-88 with 8:49 left after a basket by Kent Bazemore. Westbrook re-entered the game and led the Thunder on a 16-5 run. Anthony's 3-pointer with 5:34 left gave Oklahoma City a 104-97 lead."}
{"game_id": "0021700477", "chunk_id": "0021700477_007", "order": 7, "role": "body", "text": "The Hawks came back again, eventually tying the game at 117 on two free throws by Ilyasova with 11.1 seconds left. After a timeout, George inbounded to Westbrook, who made the final shot over Atlanta's Taurean Prince. Without a timeout, the Hawks could manage only a desperation heave at the buzzer."}
{"game_id": "0021700477", "chunk_id": "0021700477_008", "order": 8, "role": "body", "text": "\"We put ourselves in position to (win) the basketball game with the last shot and it went down,\" a hoarse Westbrook said."}
{"game_id": "0021700477", "chunk_id": "0021700477_009", "order": 9, "role": "body", "text": "The Thunder dominated the second quarter. They broke a 28-28 tie with a 14-2 run to start the quarter, with Raymond Felton and George each hitting two 3-pointers. After the Hawks pulled within 51-43, Oklahoma City went on a 13-5 run and led 64-50 at halftime."}
{"game_id": "0021700477", "chunk_id": "0021700477_010", "order": 10, "role": "body", "text": "Atlanta scored 11 straight points to cut the Thunder lead to 74-70 midway through the third quarter."}
{"game_id": "0021700477", "chunk_id": "0021700477_011", "order": 11, "role": "body", "text": "Oklahoma City made only 19 of 31 free throws."}
{"game_id": "0021700477", "chunk_id": "0021700477_013", "order": 13, "role": "body", "text": "Hawks: Atlanta played without G Dennis Schroder, who sat out with a left ankle injury and was replaced in the starting lineup by Belinelli. Schroder had started and played 32 minutes Wednesday vs. Indiana. ... Prince went 1 of 3 from 3-point range and now has at least one 3-pointer in career-best 14 straight games. ... Belinelli extended his streak of consecutive free throws to 28 ... Atlanta is 2-7 vs. Western Conference teams this season."}
{"game_id": "0021700477", "chunk_id": "0021700477_014", "order": 14, "role": "body", "text": "Thunder: Westbrook was called for an unsportsmanlike technical foul with 3:24 left in the second quarter for shoving Malcolm Delaney after Delaney had fouled him. ... Steven Adams had 16 points and 10 rebounds. ... The Thunder now trail only 66-65 in their all-time series with the Hawks, including the franchise's time in Seattle. ... George and Westbrook entered the game ranked first and second, respectively, in the NBA in steals at 2.45 and 2.10. George had three steals against the Hawks, and Westbrook had two."}
{"game_id": "0021700477", "chunk_id": "0021700477_016", "order": 16, "role": "body", "text": "The Hawks' defensive options on the final play were somewhat limited by Westbrook's skill set, Budenholzer said. Try to guard him closely and he might race by the defender. Give him space, and he could knock down a 3-pointer."}
{"game_id": "0021700477", "chunk_id": "0021700477_017", "order": 17, "role": "body", "text": "\"With his speed and explosion, it's tough to get into him from that far away from the basket,\" Budenholzer said. \"When he's attacking and getting downhill, that's not easy. So when he pulls up from three or four feet behind the 3-point line, no doubt he's capable of doing it. He's done it a lot of times and he did it tonight, so you tip your cap to him and you've just got to take it.\""}
{"game_id": "0021700477", "chunk_id": "0021700477_019", "order": 19, "role": "body", "text": "Hawks: Host Dallas on Saturday before a four-day break."}
{"game_id": "0021700477", "chunk_id": "0021700477_020", "order": 20, "role": "body", "text": "Thunder: At Utah on Saturday before starting a four-game homestand on Christmas Day against Houston."}
{"game_id": "0021700477", "chunk_id": "0021700477_022", "order": 22, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
