{"game_id": "0021400166", "chunk_id": "0021400166_001", "order": 1, "role": "lead", "text": "TORONTO --  Healthy bodies were hard to come by for Memphis on Wednesday night."}
{"game_id": "0021400166", "chunk_id": "0021400166_002", "order": 2, "role": "body", "text": "When it mattered most, so was the solid defense the Grizzlies have become known for."}
{"game_id": "0021400166", "chunk_id": "0021400166_003", "order": 3, "role": "body", "text": "DeMar DeRozan scored 21 points, Terrence Ross had 14 of his 16 in the fourth quarter and the Toronto Raptors beat the undermanned Grizzlies 96-92."}
{"game_id": "0021400166", "chunk_id": "0021400166_004", "order": 4, "role": "body", "text": "Grizzlies guard Courtney Lee and forward Tony Allen were among five players ruled out because of a stomach virus. Memphis center Kosta Koufos, forward Jon Leuer and guard Beno Udrih were also unavailable, leaving the Grizzlies with just 10 active players."}
{"game_id": "0021400166", "chunk_id": "0021400166_005", "order": 5, "role": "body", "text": "\"It was a challenge for us,\" forward Zach Randolph said. \"We still played good. That's why this game hurts so bad. We feel we should have won.\""}
{"game_id": "0021400166", "chunk_id": "0021400166_006", "order": 6, "role": "body", "text": "All five sick players spent time at a Toronto hospital Wednesday, suffering from dehydration. They stayed back at the hotel before the game to remain away from their teammates, and were later sent home on a special charter."}
{"game_id": "0021400166", "chunk_id": "0021400166_007", "order": 7, "role": "body", "text": "Grizzlies guard Mike Conley called it one of the strangest situations he's faced in the NBA."}
{"game_id": "0021400166", "chunk_id": "0021400166_008", "order": 8, "role": "body", "text": "\"It's up there on the list,\" Conley said. \"You should have seen us at shootaround. We had like six guys. We had coaches in all the plays. It was crazy.\""}
{"game_id": "0021400166", "chunk_id": "0021400166_009", "order": 9, "role": "body", "text": "A Grizzlies team spokesman said surgical masks would be made available to those who wanted them onboard the main team charter following the game, an effort to prevent further spread of the virus."}
{"game_id": "0021400166", "chunk_id": "0021400166_010", "order": 10, "role": "body", "text": "Kyle Lowry scored 18 points for Toronto and Lou Williams had 13 as the Eastern Conference leaders won for the seventh time in eight games."}
{"game_id": "0021400166", "chunk_id": "0021400166_011", "order": 11, "role": "body", "text": "Marc Gasol had 22 points and 12 rebounds, and Randolph added 18 points and 18 rebounds for the Grizzlies (10-2), who came in with the NBA's best record but had their four-game winning streak stopped."}
{"game_id": "0021400166", "chunk_id": "0021400166_012", "order": 12, "role": "body", "text": "Conley scored 19 points and Tayshaun Prince added 15 for Memphis, which was outscored 27-17 in the fourth as the Raptors shot 10 for 20, their best in any quarter."}
{"game_id": "0021400166", "chunk_id": "0021400166_013", "order": 13, "role": "body", "text": "\"We couldn't get the stops that we wanted,\" Gasol said."}
{"game_id": "0021400166", "chunk_id": "0021400166_014", "order": 14, "role": "body", "text": "Toronto trailed by six to begin the fourth, but a three-point play by Ross gave the Raptors a 77-76 edge at the 8:18 mark."}
{"game_id": "0021400166", "chunk_id": "0021400166_015", "order": 15, "role": "body", "text": "Gasol made a jumper and then a pair of free throws to restore Memphis' lead, but Ross answered with a 3, putting Toronto up 83-82."}
{"game_id": "0021400166", "chunk_id": "0021400166_016", "order": 16, "role": "body", "text": "Conley hit a jumper, then he and Prince both made a pair from the line to give the Grizzlies an 88-83 edge with 4:34 left. Another 3 by Ross and a driving layup by Lowry tied it at 90 with 2:49 remaining."}
{"game_id": "0021400166", "chunk_id": "0021400166_017", "order": 17, "role": "body", "text": "Gasol missed a pair of free throws with 1:53 to play, and Lowry answered with a tiebreaking layup. At the other end, Conley was called for an offensive foul, the 13th turnover of the game for the Grizzlies."}
{"game_id": "0021400166", "chunk_id": "0021400166_018", "order": 18, "role": "body", "text": "DeRozan and Randolph both missed shots before Lowry sealed it with a fadeaway jumper with 8 seconds to go."}
{"game_id": "0021400166", "chunk_id": "0021400166_019", "order": 19, "role": "body", "text": "\"My teammates and my coaches can always depend on me to make the play at the end,\" Lowry said."}
{"game_id": "0021400166", "chunk_id": "0021400166_020", "order": 20, "role": "body", "text": "Conley missed the final shot of the game for Memphis, which went 4 of 14 in the fourth."}
{"game_id": "0021400166", "chunk_id": "0021400166_023", "order": 23, "role": "body", "text": "As part of their 20th anniversary celebration, the Raptors paid tribute to current Grizzlies guard Vince Carter with a highlight reel during a first-quarter timeout. Although a few fans booed as the video began, most of the sellout crowd of 19,800 stood and cheered. An emotional Carter raised his arms, tapped his heart and wiped tears from his eyes. \"It was a great feeling,\" Carter said. \"I couldn't write it any better.\" When Carter checked in seconds later, some fans booed his first touch. Carter's mother, once a courtside fixture at Raptors games, was in attendance."}
{"game_id": "0021400166", "chunk_id": "0021400166_025", "order": 25, "role": "body", "text": "Grizzlies: Prince and Quincy Pondexter started in place of Allen and Lee. ... To fill out the roster, Memphis signed guard Kalin Lucas and center Hassan Whiteside from Iowa of the D-League. Lucas arrived during player introductions, and Whiteside showed up shortly afterward. ... Memphis is 19-7 against Eastern Conference opponents since the start of 2014. The only other loss this season was at Milwaukee on Nov. 8."}
{"game_id": "0021400166", "chunk_id": "0021400166_026", "order": 26, "role": "body", "text": "Raptors: F James Johnson (right ankle) was not available. Rookie F Bruno Caboclo was active in place of Johnson, injured when he stepped on a cameraman's foot in Saturday's win over Utah. Toronto coach Dwane Casey said there was no timetable for Johnson's return. ... Tyler Hansbrough had his right shoulder taped after a hard fall in the first half while battling for a rebound. ... Toronto was held below 100 points for the second time this season. The other was a 100-93 loss to Chicago on Nov. 13. ... Actor Lou Gossett Jr. attended the game."}
{"game_id": "0021400166", "chunk_id": "0021400166_028", "order": 28, "role": "body", "text": "Grizzlies: Host Celtics on Friday."}
{"game_id": "0021400166", "chunk_id": "0021400166_029", "order": 29, "role": "closing", "text": "Raptors: Host Bucks on Friday."}
