{"game_id": "0021700823", "chunk_id": "0021700823_001", "order": 1, "role": "lead", "text": "HOUSTON --  James Harden and some of his Houston teammates got after Clint Capela after he missed a couple of easy layups in the first quarter against the Denver Nuggets."}
{"game_id": "0021700823", "chunk_id": "0021700823_002", "order": 2, "role": "body", "text": "\"Oh, we yelled at him for missing those bunnies, too, because we've got to look at it as a playoff game and all those points under the basket have to be ... finishes,\" Harden said."}
{"game_id": "0021700823", "chunk_id": "0021700823_003", "order": 3, "role": "body", "text": "Capela soon turned things around and more than made up for his early errors."}
{"game_id": "0021700823", "chunk_id": "0021700823_004", "order": 4, "role": "body", "text": "Harden scored 28 points, Capela added 23 points with a career-high 25 rebounds and the Rockets never trailed in a lopsided 130-104 win on Friday night."}
{"game_id": "0021700823", "chunk_id": "0021700823_005", "order": 5, "role": "body", "text": "The 23-year-old Capela is the youngest Rocket to have at least 23 points and 25 rebounds in a game since Hakeem Olajuwon had 30 points and 25 rebounds against the Knicks on Feb. 14, 1985."}
{"game_id": "0021700823", "chunk_id": "0021700823_006", "order": 6, "role": "body", "text": "It was the first 20-point, 20-rebound game of his career, thanks to a scoring change days after a game against Utah on Dec. 18 that left him with just 19 rebounds on a 24-point night."}
{"game_id": "0021700823", "chunk_id": "0021700823_007", "order": 7, "role": "body", "text": "\"This game I just wanted to make sure, so I got a couple more than 20 so if they take one out I'll still have more than 20,\" he said with a smile."}
{"game_id": "0021700823", "chunk_id": "0021700823_008", "order": 8, "role": "body", "text": "Harden had 11 assists and seven rebounds as Houston won its seventh straight and 11th of 12."}
{"game_id": "0021700823", "chunk_id": "0021700823_009", "order": 9, "role": "body", "text": "The Rockets had a double-digit lead for most of the game and held an advantage of 20 points or more throughout most of the second half. Harden didn't play in the third quarter, and Capela and the rest of the starters sat down for good with about nine minutes left and the game out of hand."}
{"game_id": "0021700823", "chunk_id": "0021700823_010", "order": 10, "role": "body", "text": "Trey Lyles scored 24 points off the bench to lead the Nuggets, who had a three-game winning streak snapped."}
{"game_id": "0021700823", "chunk_id": "0021700823_011", "order": 11, "role": "body", "text": "\"We got really good looks, but they just didn't go our way,\" coach Michael Malone said."}
{"game_id": "0021700823", "chunk_id": "0021700823_012", "order": 12, "role": "body", "text": "The Rockets had a 27-point lead to start the fourth and a 14-6 run to open the quarter made it 111-76 with about nine minutes left. Eric Gordon, Ryan Anderson and Gerald Green all made 3s in that stretch and Chris Paul scored the other five points."}
{"game_id": "0021700823", "chunk_id": "0021700823_013", "order": 13, "role": "body", "text": "Coach Mike D'Antoni took out most of his starters after that and Denver scored the next eight straight, with Torrey Craig and Lyles making four each, to cut the lead to 111-84 with seven minutes remaining."}
{"game_id": "0021700823", "chunk_id": "0021700823_014", "order": 14, "role": "body", "text": "The Nuggets had no answer for Capela, who had 16 rebounds by halftime. He grabbed his 20th to tie his previous career best with about five minutes left in the third."}
{"game_id": "0021700823", "chunk_id": "0021700823_015", "order": 15, "role": "body", "text": "\"Clint is huge for us. He's vital to everything we do,\" Paul said."}
{"game_id": "0021700823", "chunk_id": "0021700823_016", "order": 16, "role": "body", "text": "Denver had a terrible night from long range, making a season-low three 3-pointers on 28 attempts."}
{"game_id": "0021700823", "chunk_id": "0021700823_017", "order": 17, "role": "body", "text": "The Rockets led by 16 early in the third quarter before using a 7-2 run to extend their advantage to 73-52 with about nine minutes left in the period. Capela led the way in that span with four points and Harden added a 3-pointer."}
{"game_id": "0021700823", "chunk_id": "0021700823_018", "order": 18, "role": "body", "text": "Nikola Jokic made a basket for the Nuggets after that before Harden scored the first five points of a 10-2 spurt that made it 83-56 with seven minutes left in the quarter. Houston still led by 27 at the end of the period, 97-70."}
{"game_id": "0021700823", "chunk_id": "0021700823_020", "order": 20, "role": "body", "text": "Nuggets: Jokic had 14 points and seven rebounds. ... Wilson Chandler added 11 points and six rebounds. ... Denver was outrebounded 48-39."}
{"game_id": "0021700823", "chunk_id": "0021700823_021", "order": 21, "role": "body", "text": "Rockets: Trevor Ariza missed his sixth straight game with a strained left hamstring. ... Gordon returned after missing the last game with lower back soreness. ... Anderson had nine points after sitting out the last game with a sprained right ankle. ... Green added 16 points. ... Paul played just 22 minutes, scoring 11 points."}
{"game_id": "0021700823", "chunk_id": "0021700823_023", "order": 23, "role": "body", "text": "The Rockets honored Harden before the game for his 60-point performance in Houston's Jan. 30 win over Orlando. His total set a franchise record, besting the 57 points Calvin Murphy scored in 1978. Harden also had 11 assists and 10 rebounds in that game to become the first player in NBA history to score 60 points in a triple-double. The Rockets showed a video of Harden's highlights before Murphy presented him with a framed picture that featured Harden's image in front of the number 60."}
{"game_id": "0021700823", "chunk_id": "0021700823_025", "order": 25, "role": "body", "text": "Local rapper Travis Scott watched the game from a courtside seat. It's been a big month for Scott after he welcomed a daughter, Stormi, with Kylie Jenner last week. Scott wore baby blue Jordans as he chatted with Houston Astros pitcher Lance McCullers, and he often stood and cheered when the Rockets made big plays."}
{"game_id": "0021700823", "chunk_id": "0021700823_027", "order": 27, "role": "body", "text": "Nuggets: Visit Phoenix on Saturday night."}
{"game_id": "0021700823", "chunk_id": "0021700823_028", "order": 28, "role": "body", "text": "Rockets: Host Dallas on Sunday night."}
{"game_id": "0021700823", "chunk_id": "0021700823_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
