{"game_id": "0021701230", "chunk_id": "0021701230_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  The Houston Rockets and Sacramento Kings were already looking to the future before their season finale even started."}
{"game_id": "0021701230", "chunk_id": "0021701230_002", "order": 2, "role": "body", "text": "For Houston, that comes this weekend with the start of the playoffs. For Sacramento, it's once again wait until next season."}
{"game_id": "0021701230", "chunk_id": "0021701230_003", "order": 3, "role": "body", "text": "Willie Cauley-Stein had 22 points and 11 rebounds to help the Kings finish the regular season with a 96-83 victory over the short-handed Rockets on Wednesday night."}
{"game_id": "0021701230", "chunk_id": "0021701230_004", "order": 4, "role": "body", "text": "\"We have a positive direction that we're going as a franchise,\" Kings coach Dave Joerger said. \"Our guys feel it. Our guys are going out and competing on a regular basis and showing our fans we're coming. I don't know how long it will be, but we're going to go out there and compete and keep getting better.\""}
{"game_id": "0021701230", "chunk_id": "0021701230_005", "order": 5, "role": "body", "text": "With Houston (65-17) already having wrapped up the best record in the NBA, coach Mike D'Antoni opted to rest most of his top players, including starters James Harden, Chris Paul, Trevor Ariza and Clint Capela. The top-seeded Rockets will open the playoffs at home this weekend against Minnesota."}
{"game_id": "0021701230", "chunk_id": "0021701230_006", "order": 6, "role": "body", "text": "\"We have to get ready,\" coach Mike D'Antoni said. \"They're a good team and they fought their way into it. Good for them. We have to play our game and be ready.\""}
{"game_id": "0021701230", "chunk_id": "0021701230_007", "order": 7, "role": "body", "text": "The Kings took advantage of Houston's depleted lineup and ended another disappointing season off by snapping a seven-game skid against the Rockets. Sacramento finished with a 27-55 record in coach Dave Joerger's second season, its worst mark since going 24-58 in 2010-11."}
{"game_id": "0021701230", "chunk_id": "0021701230_008", "order": 8, "role": "body", "text": "The Kings never trailed after the first quarter and coasted to the win."}
{"game_id": "0021701230", "chunk_id": "0021701230_009", "order": 9, "role": "body", "text": "Gerald Green scored 31 points and R.J. Hunter added 19 to lead the Rockets."}
{"game_id": "0021701230", "chunk_id": "0021701230_011", "order": 11, "role": "body", "text": "Rockets: Harden won his first career scoring title, averaging 30.4 ppg, second in franchise history to Moses Malone's 31.1 in 1981-82."}
{"game_id": "0021701230", "chunk_id": "0021701230_012", "order": 12, "role": "body", "text": "Kings: Sacramento now has the NBA's longest current playoff drought after Minnesota earned the eighth seed in the West with a win Wednesday. The Kings have missed the playoffs for 12 straight years."}
{"game_id": "0021701230", "chunk_id": "0021701230_014", "order": 14, "role": "body", "text": "Houston added a new player in Aaron Jackson, who spent the past seven seasons playing overseas. Jackson arrived just before game time and didn't even have his name on the back of his No. 55 jersey, which had belonged to the recently released Tim Quarterman. Jackson scored eight points in 34 minutes."}
{"game_id": "0021701230", "chunk_id": "0021701230_015", "order": 15, "role": "body", "text": "\"It was surreal. I was at a hotel with my girlfriend for her birthday, then my agent called and said, `How fast can you get to the airport? You're playing with the Houston Rockets for the rest of the season,\" he said. \"I packed my bags as fast as I could. Hopefully I can do whatever it takes to try to help them win a championship.\""}
{"game_id": "0021701230", "chunk_id": "0021701230_017", "order": 17, "role": "body", "text": "Houston forward Luc Mbah a Moute will likely miss at least the first round of the playoffs after dislocating his right shoulder Tuesday night against the Lakers. D'Antoni said Mbah a Moute will likely miss two to three weeks with the injury. Mbah a Moute missed 15 games in December and January after dislocating his right shoulder."}
{"game_id": "0021701230", "chunk_id": "0021701230_018", "order": 18, "role": "body", "text": "\"It hurts,\" D'Antoni said. \"That's why we have depth. As the door closes for somebody, it opens for somebody else. That's why we went and got Joe Johnson and we have Ryan (Anderson) coming back in here. You hate to lose Luc. I hate it for him personally. It's not something that anyone would want. He'll be back. We just have to hold on until he's back.\""}
{"game_id": "0021701230", "chunk_id": "0021701230_020", "order": 20, "role": "body", "text": "Longtime Kings television analyst Jerry Reynolds called his final game for the franchise. Reynolds, a former coach and general manager for the Kings, has decided to step down after 20 years in the booth at age 74. He got a lengthy ovation after a video tribute in the first half."}
{"game_id": "0021701230", "chunk_id": "0021701230_021", "order": 21, "role": "body", "text": "\"I'll still be involved with the team in a lesser role,\" Reynolds said. \"I'm not totally retiring and I'm not dead. As far as I'm concerned, that's pretty good.\""}
{"game_id": "0021701230", "chunk_id": "0021701230_023", "order": 23, "role": "body", "text": "Rockets: First round of playoffs vs. Minnesota."}
{"game_id": "0021701230", "chunk_id": "0021701230_026", "order": 26, "role": "closing", "text": "More AP NBA: www.apnews.com/tag/NBAbasketball"}
