{"game_id": "0021701050", "chunk_id": "0021701050_001", "order": 1, "role": "lead", "text": "CLEVELAND --  LeBron James made certain another news-filled day ended with his own headline."}
{"game_id": "0021701050", "chunk_id": "0021701050_002", "order": 2, "role": "body", "text": "James scored 40 points as part of his third triple-double in four games and the Cleveland Cavaliers beat the Milwaukee Bucks 124-117 on Monday night as coach Tyronn Lue began his leave of absence to address health issues."}
{"game_id": "0021701050", "chunk_id": "0021701050_003", "order": 3, "role": "body", "text": "Lue said Monday in a statement he been dealing with chest pains and loss of sleep, and that tests have offered no conclusion about what the issue is. Associate head coach Larry Drew will run the team in Lue's absence."}
{"game_id": "0021701050", "chunk_id": "0021701050_004", "order": 4, "role": "body", "text": "Lue's departure came several hours before Kevin Love returned after missing six weeks because of a broken left hand. The All-Star forward scored 18 points in 25 minutes."}
{"game_id": "0021701050", "chunk_id": "0021701050_005", "order": 5, "role": "body", "text": "Losing their coach while getting back a star player seems to fit the narrative of this turbulent season. The Cavaliers (41-29) are third in the Eastern Conference and have endured roster shake-ups, injuries and other distractions as they try to reach the NBA Finals for the fourth straight time."}
{"game_id": "0021701050", "chunk_id": "0021701050_006", "order": 6, "role": "body", "text": "\"If it's not one thing, it's another,\" James said."}
{"game_id": "0021701050", "chunk_id": "0021701050_007", "order": 7, "role": "body", "text": "James scored 17 points in the third quarter and finished with 12 rebounds and 10 assists for his 16th triple-double this season and 71st of his career."}
{"game_id": "0021701050", "chunk_id": "0021701050_008", "order": 8, "role": "body", "text": "The four-time MVP took over in the third beginning with back-to-back 3-pointers. After not getting a foul called on a third attempt, he finished Cleveland's next possession with a massive dunk. He was fouled attempting another dunk and made both free throws the following time down."}
{"game_id": "0021701050", "chunk_id": "0021701050_009", "order": 9, "role": "body", "text": "James expressed his displeasure, as did the crowd at Quicken Loans Arena, after the officials didn't call a foul when he attempted his third 3-pointer. He quickly took out his frustration on the next two possessions."}
{"game_id": "0021701050", "chunk_id": "0021701050_010", "order": 10, "role": "body", "text": "James is trying to use humor in dealing with the lack of calls."}
{"game_id": "0021701050", "chunk_id": "0021701050_011", "order": 11, "role": "body", "text": "\"I got hit in the head three times today, got elbowed in the nose,\" he said. \"It is what it is at this point. I went to keep pushing and try not to get caught up in the battle with the calls that should be called.\""}
{"game_id": "0021701050", "chunk_id": "0021701050_012", "order": 12, "role": "body", "text": "Milwaukee cut a 17-point lead to 117-109, but James drove the length of the floor for a dunk with just over a minute left."}
{"game_id": "0021701050", "chunk_id": "0021701050_013", "order": 13, "role": "body", "text": "Giannis Antetokounmpo had 37 points and went 11 for 11 at the foul line for Milwaukee, which fell to eighth in the Eastern Conference after Miami defeated Denver."}
{"game_id": "0021701050", "chunk_id": "0021701050_014", "order": 14, "role": "body", "text": "James' performance led to Antetokounmpo having an unusual postgame conversation."}
{"game_id": "0021701050", "chunk_id": "0021701050_015", "order": 15, "role": "body", "text": "\"I was talking to myself taking a shower, asking what I did wrong because he was the first player to score 40 on me,\" he said. \"He's the best player in the world.\""}
{"game_id": "0021701050", "chunk_id": "0021701050_016", "order": 16, "role": "body", "text": "Khris Middleton had 30 points, making 11 of 16 from the field."}
{"game_id": "0021701050", "chunk_id": "0021701050_017", "order": 17, "role": "body", "text": "Lue, 40, led Cleveland to the 2016 NBA championship after taking over for David Blatt midway through that season."}
{"game_id": "0021701050", "chunk_id": "0021701050_018", "order": 18, "role": "body", "text": "No timetable has been given for when Lue will return. He missed the second half Saturday, the second time this season he left a game because he wasn't feeling well. Lue also sat out a game against Chicago at home in December."}
{"game_id": "0021701050", "chunk_id": "0021701050_020", "order": 20, "role": "body", "text": "Love was pleased with the results in his first game since Jan. 30."}
{"game_id": "0021701050", "chunk_id": "0021701050_021", "order": 21, "role": "body", "text": "\"I felt pretty good,\" he said. \"Initially, that first wind is always tough, but even after that I felt like my legs were underneath me and that I could've played a little bit more.\""}
{"game_id": "0021701050", "chunk_id": "0021701050_023", "order": 23, "role": "body", "text": "The Cavaliers honored former Browns tackle Joe Thomas, who attended the game after holding a retirement press conference Monday. James embraced Thomas, who received a standing ovation in an on-court tribute during a timeout."}
{"game_id": "0021701050", "chunk_id": "0021701050_024", "order": 24, "role": "body", "text": "James wanted to acknowledge Thomas, who is certain to be inducted into the Pro Football Hall of Fame in Canton."}
{"game_id": "0021701050", "chunk_id": "0021701050_025", "order": 25, "role": "body", "text": "\"He's a legend around here, that's for sure,\" James said. \"He'll be in the Hall very soon. The good thing for him is he won't have to travel very far. It's right down the street.\""}
{"game_id": "0021701050", "chunk_id": "0021701050_027", "order": 27, "role": "body", "text": "Bucks: Antetokounmpo picked up his second foul at the 5:58 mark of the first quarter and went to the bench. He scored 10 points in the second, including a one-handed dunk off an alley-oop pass from Eric Bledsoe. ... C Tyler Zeller (sore ribs) missed his second straight game."}
{"game_id": "0021701050", "chunk_id": "0021701050_028", "order": 28, "role": "body", "text": "Cavaliers: G Kyle Korver scored 12 points after missing Saturday's game because of a family matter. He's also been dealing with a sore right foot. ... Drew hopes F Tristan Thompson, who hasn't played since March 3 because of a sprained right ankle will return this week. ... Larry Nance Jr. (sore right hamstring), Rodney Hood (strained lower back) and Cedi Osman (strained left hip flexor) are also out."}
{"game_id": "0021701050", "chunk_id": "0021701050_030", "order": 30, "role": "body", "text": "Bucks: Host Los Angeles Clippers on Wednesday."}
{"game_id": "0021701050", "chunk_id": "0021701050_031", "order": 31, "role": "body", "text": "Cavaliers: Host Toronto on Wednesday."}
{"game_id": "0021701050", "chunk_id": "0021701050_033", "order": 33, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
