{"game_id": "0021700721", "chunk_id": "0021700721_001", "order": 1, "role": "lead", "text": "DALLAS --  Damian Lillard had to defeat a stomach bug before he could lead the Portland Trail Blazers past the Dallas Mavericks."}
{"game_id": "0021700721", "chunk_id": "0021700721_002", "order": 2, "role": "body", "text": "Lillard \"ate something weird\" and missed all four shots he took and had a pair of turnovers in the first quarter."}
{"game_id": "0021700721", "chunk_id": "0021700721_003", "order": 3, "role": "body", "text": "\"I kind of had a stomachache,\" Lillard said. \"A kind of weird feeling in my throat like I was going to throw up, so I was kind of winded. I just felt kind of sick, like it was stomach flu or something.\""}
{"game_id": "0021700721", "chunk_id": "0021700721_004", "order": 4, "role": "body", "text": "He started feeling better in the second quarter and his game reflected that, as he scored a game-high 29 points in the final three quarters to lead Portland to a 107-93 victory Friday night."}
{"game_id": "0021700721", "chunk_id": "0021700721_005", "order": 5, "role": "body", "text": "\"I just kept drinking water,\" Lillard said. \"I just kept telling myself it's a mental battle. We had to get the job done and that's what we did.\""}
{"game_id": "0021700721", "chunk_id": "0021700721_006", "order": 6, "role": "body", "text": "Lillard had 14 points in the third quarter when Portland closed out the victory."}
{"game_id": "0021700721", "chunk_id": "0021700721_007", "order": 7, "role": "body", "text": "\"He can get on a rhythm,\" Portland coach Terry Stotts said. \"He is just capable of doing that. After getting off to a slow start offensively, missing four to five shots, he is capable of getting hot.\""}
{"game_id": "0021700721", "chunk_id": "0021700721_008", "order": 8, "role": "body", "text": "C.J. McCollum added 20 points and Jusuf Nurkic had 12 for the Trail Blazers (27-22), who have won four of their past five games -- including two wins against the Mavericks."}
{"game_id": "0021700721", "chunk_id": "0021700721_009", "order": 9, "role": "body", "text": "Ed Davis had 15 points and 13 rebounds off the bench."}
{"game_id": "0021700721", "chunk_id": "0021700721_010", "order": 10, "role": "body", "text": "\"I just tried to come with energy,\" Davis said. \"The ball was finding me and rebounds were falling into my hands, so I was just trying to give a spark to help the team.\""}
{"game_id": "0021700721", "chunk_id": "0021700721_011", "order": 11, "role": "body", "text": "Portland played without forward Evan Turner, who was out for personal reasons. Maurice Harkless started in his place and had five points in 17 minutes."}
{"game_id": "0021700721", "chunk_id": "0021700721_012", "order": 12, "role": "body", "text": "Harrison Barnes scored 21 points and Dennis Smith Jr. had 18 for the Mavericks (16-33) in the first game of a back-to-back. Dallas travels to Denver for a road contest Saturday."}
{"game_id": "0021700721", "chunk_id": "0021700721_013", "order": 13, "role": "body", "text": "Wesley Matthews added 12 points for the Mavericks, who struggled and shot 39.3 percent from the field."}
{"game_id": "0021700721", "chunk_id": "0021700721_014", "order": 14, "role": "body", "text": "\"We were committed to the defensive end, that's for sure, but our offense really wasn't there,\" Matthews said. \"No matter what you do on the defensive end, you don't put the ball in the basket you don't really put much pressure on them.\""}
{"game_id": "0021700721", "chunk_id": "0021700721_015", "order": 15, "role": "body", "text": "The Trail Blazers led 52-44 at halftime and never trailed in the second half. Dallas was as close as two points -- 65-63 -- in the third quarter, but used a 20-4 run in the fourth quarter to put the game out of reach."}
{"game_id": "0021700721", "chunk_id": "0021700721_016", "order": 16, "role": "body", "text": "\"They hit some hellacious shots,\" Mavericks coach Rick Carlisle said. \"We had a poor shot-making night, and that combination can lead to problems quickly with these guys.\""}
{"game_id": "0021700721", "chunk_id": "0021700721_018", "order": 18, "role": "body", "text": "Davis had a big game with his mother, Angela Jones, in attendance, who traveled to Dallas from Virginia to see him get a double-double. \"It's just always good to see family in the stands, especially my mom,\" Davis said."}
{"game_id": "0021700721", "chunk_id": "0021700721_020", "order": 20, "role": "body", "text": "The Mavericks committed only five turnovers, one shy of the franchise record for the fewest in a game. Dallas has 10 games in franchise history with four turnovers, including one game earlier this season."}
{"game_id": "0021700721", "chunk_id": "0021700721_022", "order": 22, "role": "body", "text": "Trail Blazers: Portland leads the all-time series 82-70 and has won three straight against Dallas."}
{"game_id": "0021700721", "chunk_id": "0021700721_023", "order": 23, "role": "body", "text": "Mavericks: G Seth Curry still has yet to play this season due to a leg injury. Carlisle said he expects Curry to play this season, but doesn't know when. ... The Mavericks debuted their \"City\" Edition jersey, a black jersey with neon blue and green trim."}
{"game_id": "0021700721", "chunk_id": "0021700721_025", "order": 25, "role": "body", "text": "Trail Blazers: visit the Los Angeles Clippers on Tuesday."}
{"game_id": "0021700721", "chunk_id": "0021700721_026", "order": 26, "role": "body", "text": "Mavericks: visit the Denver Nuggets on Saturday to complete a back-to-back."}
{"game_id": "0021700721", "chunk_id": "0021700721_028", "order": 28, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
