{"game_id": "0021700687", "chunk_id": "0021700687_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Kemba Walker thinks the Charlotte Hornets can still be a playoff team, and the All-Star point guard would like to be around to see that happen."}
{"game_id": "0021700687", "chunk_id": "0021700687_002", "order": 2, "role": "body", "text": "However, Walker has resigned himself to the fact there is little he can do about reports the Hornets have put him on the block before the Feb. 8 NBA trade deadline."}
{"game_id": "0021700687", "chunk_id": "0021700687_003", "order": 3, "role": "body", "text": "\"I'm over it,\" Walker said. \"I'm not even thinking about it anymore. I just want to win.\""}
{"game_id": "0021700687", "chunk_id": "0021700687_004", "order": 4, "role": "body", "text": "Walker helped his team do just that on Monday night, scoring a game-high 26 points as the Hornets bounced back from a tough loss to beat the Sacramento Kings 112-107."}
{"game_id": "0021700687", "chunk_id": "0021700687_005", "order": 5, "role": "body", "text": "Hornets owner Michael Jordan told the Charlotte Observer on Monday night that \"It's not like we are shopping him. We would not just give him up. I love Kemba Walker. I would not trade him for anything but an All-Star player.\""}
{"game_id": "0021700687", "chunk_id": "0021700687_006", "order": 6, "role": "body", "text": "Jeremy Lamb had 18 points, and Dwight Howard added 14 points, 16 rebounds and six blocks for the Hornets, who have won six of their last nine to improve to 19-26. Marvin Williams and Nic Batum each had 14 points."}
{"game_id": "0021700687", "chunk_id": "0021700687_007", "order": 7, "role": "body", "text": "Walker made five 3s, but struggled shooting the ball over finishing 6 of 20 from the field."}
{"game_id": "0021700687", "chunk_id": "0021700687_008", "order": 8, "role": "body", "text": "That all didn't matter to coach Steve Clifford, who was happy his team could get a win."}
{"game_id": "0021700687", "chunk_id": "0021700687_009", "order": 9, "role": "body", "text": "\"They won at Golden State. They won at Philly. They beat Denver,\" Clifford said of the 13-33 Kings. \"It's the NBA so you have to understand this league.\""}
{"game_id": "0021700687", "chunk_id": "0021700687_010", "order": 10, "role": "body", "text": "The Hornets were coming off an emotionally crushing 106-105 loss to the Miami Heat on Saturday night in which they surrendered a five-point lead in the final 34 seconds and lost on a last-second free throw following a disputed call."}
{"game_id": "0021700687", "chunk_id": "0021700687_011", "order": 11, "role": "body", "text": "However, they came out with a purpose against the Kings, closing the first half with an 11-2 run to build a 12-point lead at the break. They extended the lead to 20 in the second half before allowing the lead to dwindle to three with 1:25 remaining after a 3-pointer by Bogdan Bogdanovic."}
{"game_id": "0021700687", "chunk_id": "0021700687_012", "order": 12, "role": "body", "text": "But there would be no collapse on this night."}
{"game_id": "0021700687", "chunk_id": "0021700687_013", "order": 13, "role": "body", "text": "Howard hit two clutch free throws and Willie Cauley-Stein was called for goaltending on a put back by Howard. Walker added two more free throws after two Kings misses to push the Charlotte lead to nine with 23 seconds left."}
{"game_id": "0021700687", "chunk_id": "0021700687_014", "order": 14, "role": "body", "text": "Skai Labissiere had 23 points and Buddy Hield added 18 for the Kings, who have lost eight straight games and 11 of their last 12. The Kings trailed by 20 in the third quarter, but battled back late behind Hield's shooting. He had 10 points in the fourth quarter."}
{"game_id": "0021700687", "chunk_id": "0021700687_015", "order": 15, "role": "body", "text": "\"We've all got to come collectively as a group and want to win,\" Hield said. \"It's tough when you're not winning. You've got to learn how to win and it's a learning process right now how to finish games when you're down 10, 12, with five minutes to go and try to find a way to execute.\""}
{"game_id": "0021700687", "chunk_id": "0021700687_017", "order": 17, "role": "body", "text": "Kings: The starting backcourt consisted of Vince Carter and De'Aaron Fox. Fox was 11 months old when Carter played in his first NBA game. ... Rookie Justin Jackson, who played at North Carolina, got a nice hand from Tar Heels fans when he checked into the game late in the first quarter."}
{"game_id": "0021700687", "chunk_id": "0021700687_018", "order": 18, "role": "body", "text": "Hornets: Michael Kidd-Gilchrist did not play because of an abscess in his first arm, which meant Treveon Graham got the start this season. Kidd-Gilchrist is expected back in the starting lineup on Wednesday, Clifford said... Howard picked up his ninth technical of the season."}
{"game_id": "0021700687", "chunk_id": "0021700687_019", "order": 19, "role": "body", "text": "WHEN TWO TREES COLLIDE: There was a crazy play in the third quarter when Cauley-Stein went up for a monster dunk in the lane but was rejected by Howard. However, the impact of the collision sent Howard to the floor, allowing Cauley-Stein to corral the loose ball and come back with a two-handed, hang-on-the-rim-for-emphasis dunk."}
{"game_id": "0021700687", "chunk_id": "0021700687_020", "order": 20, "role": "body", "text": "GOOD FROM DEEP: The Hornets made 16 of 40 shots from 3-point range, but got plenty of open looks from deep that didn't go down."}
{"game_id": "0021700687", "chunk_id": "0021700687_021", "order": 21, "role": "body", "text": "\"Just moving the basketball,\" Walker said. \"Whenever you have an open shot just being aggressive and making them. We're all creating for each other to get the best shots possible and whenever we did we just knocked them in tonight.\""}
{"game_id": "0021700687", "chunk_id": "0021700687_023", "order": 23, "role": "body", "text": "Kings: Visit the Magic on Tuesday."}
{"game_id": "0021700687", "chunk_id": "0021700687_024", "order": 24, "role": "closing", "text": "Hornets: Host the Pelicans on Wednesday."}
