{"game_id": "0021700806", "chunk_id": "0021700806_001", "order": 1, "role": "lead", "text": "MIAMI --  James Harden and Chris Paul finished off the Miami Heat."}
{"game_id": "0021700806", "chunk_id": "0021700806_002", "order": 2, "role": "body", "text": "\"We got two assassins out there,\" Rockets coach Mike D'Antoni said."}
{"game_id": "0021700806", "chunk_id": "0021700806_003", "order": 3, "role": "body", "text": "Harden scored 41 points and the Houston Rockets beat the Miami Heat 109-101 on Wednesday night for their sixth straight victory and 10th in 11 games."}
{"game_id": "0021700806", "chunk_id": "0021700806_004", "order": 4, "role": "body", "text": "Paul added 24 points, seven assists, and seven rebounds for the Rockets."}
{"game_id": "0021700806", "chunk_id": "0021700806_005", "order": 5, "role": "body", "text": "\"We just hooped,\" Paul said. \"Me and Coach was talking about it. I think that's what I came here for. That's what we talked about this summer. We can play off of each other and you've still got something in the tank at the end of the game. That's a good feeling to see down the stretch in the fourth quarter, we're still fresh.\""}
{"game_id": "0021700806", "chunk_id": "0021700806_006", "order": 6, "role": "body", "text": "Harden eclipsed the 40-point mark for the eighth time this season. He was 13 of 25 from the field, going 5 of 12 from 3-point, and hit 10 of 12 free frees. He also had six assists and rebounds."}
{"game_id": "0021700806", "chunk_id": "0021700806_007", "order": 7, "role": "body", "text": "\"Just having the opportunity to play with another great player -- I played with some great players, some really good players, but probably nobody the caliber of James,\" Paul said. \"You try not to get caught up in watching what he's doing, but it's special. The scary thing is he can keep getting better.\""}
{"game_id": "0021700806", "chunk_id": "0021700806_008", "order": 8, "role": "body", "text": "Josh Richardson, who scored 30 points for the Heat, drew the assignment of guarding Harden most of the night."}
{"game_id": "0021700806", "chunk_id": "0021700806_009", "order": 9, "role": "body", "text": "\"James is one of the best guards in the world and I mean he knows how to get fouled, he knows how to score, he knows how to playmake for his teammates,\" Richardson said. \"The game just seems to come very easy to him. It seems like he has the game slowed down a lot more than pretty much anybody. So just watching him play, I give him a lot of props. He's a tough guard.\""}
{"game_id": "0021700806", "chunk_id": "0021700806_010", "order": 10, "role": "body", "text": "Harden scored 13 points in the fourth quarter while Paul added seven and the Heat were unable to get any closer than 94-90 with five minutes left."}
{"game_id": "0021700806", "chunk_id": "0021700806_011", "order": 11, "role": "body", "text": "\"James and Chris at the end found some extra juice and just finished it off,\" D'Antoni said."}
{"game_id": "0021700806", "chunk_id": "0021700806_012", "order": 12, "role": "body", "text": "The Rockets wrapped up a 4-0 road trip with a win on the second night of a back-to-back with starters Trevor Ariza and Ryan Anderson, and key reserve Eric Gordon out with injuries."}
{"game_id": "0021700806", "chunk_id": "0021700806_013", "order": 13, "role": "body", "text": "\"Huge win for us,\" Harden said. \"An easy game with two starters out, Eric was out, we could have easily just have chalked it up, but we haven't done that all year. So this just shows us we're getting better. We still have a long way to go obviously, but we're taking the right steps in the right direction."}
{"game_id": "0021700806", "chunk_id": "0021700806_014", "order": 14, "role": "body", "text": "Goran Dragic also had 30 points for Miami. The Heat have a five-game losing streak, their longest slide of the season."}
{"game_id": "0021700806", "chunk_id": "0021700806_015", "order": 15, "role": "body", "text": "\"We're not looking for moral victories at all,\" Heat head coach Erik Spoelstra said. \"We feel that we're a very good basketball team and we're not as far off as people think right now. We've been in 10 straight of these (close) games, but we haven't been able to get over the hump in many of them.\""}
{"game_id": "0021700806", "chunk_id": "0021700806_016", "order": 16, "role": "body", "text": "Clint Capela added 13 points for the Rockets, who are 24-1 when Harden, Paul, and Capela play."}
{"game_id": "0021700806", "chunk_id": "0021700806_017", "order": 17, "role": "body", "text": "Harden scored 16 points in the opening quarter to help the Rockets take a 35-24 lead."}
{"game_id": "0021700806", "chunk_id": "0021700806_018", "order": 18, "role": "body", "text": "The Rockets led by as many as 17 points in the first half at 53-36, but Dragic scored Miami's final 10 points of the half to help cut it to 61-57 lead at the break."}
{"game_id": "0021700806", "chunk_id": "0021700806_020", "order": 20, "role": "body", "text": "Rockets: SG Eric Gordon (back) was held out in the second game of a back-to-back. ... PF Ryan Anderson (right ankle sprain) also did not play. He was injured Tuesday at Brooklyn. ... The Rockets are 34-2 when leading after three quarters."}
{"game_id": "0021700806", "chunk_id": "0021700806_021", "order": 21, "role": "body", "text": "Heat: PF Kelly Olynyk (left shoulder strain) and SG Wayne Ellington (right shoulder strain) each missed their first games of the season. ... Dragic was honored before the game with an All-Star jersey presented to him by Alonzo Mourning. ... Former Heat forward Amar'e Stoudemire sat courtside."}
{"game_id": "0021700806", "chunk_id": "0021700806_023", "order": 23, "role": "body", "text": "With Harden and Paul taking turns running the offense, it has allowed the two to be more effective late in games."}
{"game_id": "0021700806", "chunk_id": "0021700806_024", "order": 24, "role": "body", "text": "\"You all see it,\" Harden said. \"You see the difference. Efficiency, we're not turning the basketball over. We're getting more shots and we obviously can score the basketball at a high level, but you give us an extra five, six, seven possessions per game, it's trouble.\""}
{"game_id": "0021700806", "chunk_id": "0021700806_026", "order": 26, "role": "body", "text": "The Heat had climbed to fourth in the Eastern Conference before their five-game losing streak dropping them to seventh."}
{"game_id": "0021700806", "chunk_id": "0021700806_027", "order": 27, "role": "body", "text": "\"There always is a sense of urgency,\" Dragic said. \"It's not like we're relaxing right now. We had a tough stretch. We still have three games left before the All-Star break. We need to continue. Nobody is going to help us. It's us, 12 guys here and the coaching staff. We have to figure out this thing. There's still a lot of games left, but like you said now they're getting closer and closer.\""}
{"game_id": "0021700806", "chunk_id": "0021700806_029", "order": 29, "role": "body", "text": "Rockets: Host Denver on Friday night."}
{"game_id": "0021700806", "chunk_id": "0021700806_030", "order": 30, "role": "closing", "text": "Heat: Host Milwaukee on Friday night."}
