{"game_id": "0021700260", "chunk_id": "0021700260_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Harrison Barnes admitted he didn't call glass."}
{"game_id": "0021700260", "chunk_id": "0021700260_003", "order": 3, "role": "body", "text": "Barnes banked a 30-footer as the horn sounded and the Dallas Mavericks escaped with a 95-94 victory over the Memphis Grizzlies on Wednesday night. The shot -- reviewed by officials to make sure it was released in time -- came after Memphis had taken a 94-92 lead with a half-second left."}
{"game_id": "0021700260", "chunk_id": "0021700260_004", "order": 4, "role": "body", "text": "\"The biggest thing on my mind was to just give it a chance, throw it at the rim,\" Barnes said about the shot after the inbounds pass from Dennis Smith. \"You know you're not going to be able to get your feet set and get under it or do any jabs."}
{"game_id": "0021700260", "chunk_id": "0021700260_005", "order": 5, "role": "body", "text": "\"You literally are just doing a heave to the basket trying to just get it to the rim.\""}
{"game_id": "0021700260", "chunk_id": "0021700260_006", "order": 6, "role": "body", "text": "Barnes led Mavericks with 22 points, nine of them coming in the fourth quarter to help Dallas thwart a late Memphis comeback. Smith finished with 17 points, and J.J. Barea had 10 points and 11 assists."}
{"game_id": "0021700260", "chunk_id": "0021700260_007", "order": 7, "role": "body", "text": "The winning \"heave\" helped the Mavericks reverse a tough stretch after Dallas held a 92-87 lead with under a minute left. Marc Gasol scored the next five points on a pair of free throws and a 3-pointer, his only one of the night, to tie the game at 92."}
{"game_id": "0021700260", "chunk_id": "0021700260_008", "order": 8, "role": "body", "text": "With about a second left, Grizzlies guard Tyreke Evans missed a layup, but JaMychal Green followed with a dunk. The basket initially was ruled no good on basket interference, but a review overturned the call, capping a 7-0 Memphis run and giving the Grizzlies a 94-92 lead with a half second left, setting the stage for Barnes's final shot."}
{"game_id": "0021700260", "chunk_id": "0021700260_009", "order": 9, "role": "body", "text": "Evans led Memphis with 18 points, while Gasol and Deyonta Davis finished with 14 points each. The loss was the sixth straight for Memphis."}
{"game_id": "0021700260", "chunk_id": "0021700260_010", "order": 10, "role": "body", "text": "\"He threw up a (30)-foot bank shot to break our heart,\" Memphis coach David Fizdale said, later adding: \"This is a tough one.\""}
{"game_id": "0021700260", "chunk_id": "0021700260_011", "order": 11, "role": "body", "text": "Memphis dominated the first half, building the lead to 18. But the third quarter turned the game as the Mavericks outscored the Grizzlies 35-16, giving Dallas a 74-72 lead entering the fourth."}
{"game_id": "0021700260", "chunk_id": "0021700260_012", "order": 12, "role": "body", "text": "\"Defensively, we started to get stop after stop,\" Barea said. \"It worked out. We took the lead finally, and we were able to play in front for a little bit. That always helps.\""}
{"game_id": "0021700260", "chunk_id": "0021700260_014", "order": 14, "role": "body", "text": "Mavericks: F Maxi Kleber started his fourth straight game. .The Mavericks were held to 12 points in the first quarter, their lowest total for a quarter this season. It also was the lowest by a Grizzlies opponent in a quarter. ...Dirk Nowitzki had 13 points and has the second-most points scored against the Grizzlies in franchise history. Kobe Bryant is first. ... Wesley Matthews surpassed 20,000 minutes in his career."}
{"game_id": "0021700260", "chunk_id": "0021700260_015", "order": 15, "role": "body", "text": "Grizzlies: Memphis has lost six straight for the first time since March 22-April 3, 2016. ... Memphis outrebounded Dallas 52-40. ...The Grizzlies suffered 17 turnovers, more than twice as many as the Mavericks (8). .Evans has scored at least 18 points off the Memphis bench in 10 of his last 12 games."}
{"game_id": "0021700260", "chunk_id": "0021700260_017", "order": 17, "role": "body", "text": "Barnes not only didn't call glass, he didn't get a good look at his winning basket. He did know he got it off in time. \"I didn't actually see I had made it,\" he said. \"I was kind of backing up and (Grizzlies guard Dillon Brooks) had a hand in my face. I saw J.J. (Barea) running over. I was hoping he wasn't running at me if it was a loss.\""}
{"game_id": "0021700260", "chunk_id": "0021700260_019", "order": 19, "role": "body", "text": "Mavericks guard Devin Harris had 11 points, but also four steals, becoming the ninth player in Dallas history to reach 500 steals. He is now tied with Mark Aguirre for eighth place on the franchise steal list with 502."}
{"game_id": "0021700260", "chunk_id": "0021700260_021", "order": 21, "role": "body", "text": "Mavericks: Host Oklahoma City on Saturday night"}
{"game_id": "0021700260", "chunk_id": "0021700260_022", "order": 22, "role": "body", "text": "Grizzlies: At Denver on Friday night."}
{"game_id": "0021700260", "chunk_id": "0021700260_024", "order": 24, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
