{"game_id": "0021700899", "chunk_id": "0021700899_001", "order": 1, "role": "lead", "text": "NEW YORK --  With a pair of familiar faces back in action Monday night, the Brooklyn Nets won for the first time all month."}
{"game_id": "0021700899", "chunk_id": "0021700899_002", "order": 2, "role": "body", "text": "Rondae Hollis-Jefferson and Caris LeVert returned to the court and Alan Crabbe scored 21 points to help Brooklyn snap an eight-game losing streak with a 104-87 victory over the Chicago Bulls."}
{"game_id": "0021700899", "chunk_id": "0021700899_003", "order": 3, "role": "body", "text": "LeVert had six points and four assists in just over 21 minutes. Hollis-Jefferson finished with seven points and four rebounds in just under 22 minutes."}
{"game_id": "0021700899", "chunk_id": "0021700899_004", "order": 4, "role": "body", "text": "Hollis-Jefferson hadn't played in a month and LeVert missed five games. The Nets hadn't won since a 116-108 victory over the 76ers on Jan. 31."}
{"game_id": "0021700899", "chunk_id": "0021700899_005", "order": 5, "role": "body", "text": "\"They precipitated a few things. Their athleticism really stands out,\" Brooklyn coach Kenny Atkinson said. \"Their energy, how hard they play, just a big help to our bench and a big help to our defense.\""}
{"game_id": "0021700899", "chunk_id": "0021700899_006", "order": 6, "role": "body", "text": "Jarrett Allen and DeMarre Carroll each scored 18 points for the Nets, and Joe Harris added 15."}
{"game_id": "0021700899", "chunk_id": "0021700899_007", "order": 7, "role": "body", "text": "Kris Dunn led Chicago with 23 points and Lauri Markkanen had 19."}
{"game_id": "0021700899", "chunk_id": "0021700899_008", "order": 8, "role": "body", "text": "The Nets trailed 51-49 at halftime, but scored the first nine points of the second half and took the lead for good. Brooklyn increased its advantage to 80-66 on Spencer Dinwiddie's 3-pointer with 3:08 left in the third and still led by 14 at the end of the quarter."}
{"game_id": "0021700899", "chunk_id": "0021700899_009", "order": 9, "role": "body", "text": "The Nets shot 63.6 percent from the field in the decisive third period, outscoring Chicago 35-19 and holding the Bulls to 36.8 percent from the floor."}
{"game_id": "0021700899", "chunk_id": "0021700899_010", "order": 10, "role": "body", "text": "The Bulls never got closer than 11 the rest of the way."}
{"game_id": "0021700899", "chunk_id": "0021700899_011", "order": 11, "role": "body", "text": "\"We got stops and it led to us getting out in transition,\" Crabbe said. \"It opened up things for us offensively. We made shots tonight.\""}
{"game_id": "0021700899", "chunk_id": "0021700899_012", "order": 12, "role": "body", "text": "Brooklyn increased its lead to a game-high 22 points, 104-82, on Quincy Acy's 3-pointer with 2:46 remaining."}
{"game_id": "0021700899", "chunk_id": "0021700899_013", "order": 13, "role": "body", "text": "The Bulls, who have lost four straight and 13 of 16, took their first lead of the game, 14-13, on Dunn's two free throws midway through the first quarter. But the Nets scored 11 straight points and went on to take a 28-19 lead after one."}
{"game_id": "0021700899", "chunk_id": "0021700899_014", "order": 14, "role": "body", "text": "\"We didn't get stops that we needed,\" Dunn said. \"You know when you don't get stops in this league, you are going to get into trouble.\""}
{"game_id": "0021700899", "chunk_id": "0021700899_015", "order": 15, "role": "body", "text": "Chicago pulled within a point on two occasions in the second quarter before the Nets opened a 49-40 lead on Hollis-Jefferson's jumper with 2:24 left."}
{"game_id": "0021700899", "chunk_id": "0021700899_016", "order": 16, "role": "body", "text": "Those were the final points Brooklyn scored in the half, however, as the Bulls went on an 11-0 run to take their halftime lead."}
{"game_id": "0021700899", "chunk_id": "0021700899_017", "order": 17, "role": "body", "text": "\"The end of the first half was great and then we came out so sluggish with no energy and the adversity hit and we got stagnant,\" Chicago coach Fred Hoiberg. \"You have to keep playing through the tough times and we did not do that well tonight.\""}
{"game_id": "0021700899", "chunk_id": "0021700899_018", "order": 18, "role": "body", "text": "Allen and Dante Cunningham each had nine rebounds to lead the Nets."}
{"game_id": "0021700899", "chunk_id": "0021700899_019", "order": 19, "role": "body", "text": "Denzel Valentine finished with 11 points and 13 rebounds for the Bulls. Bobby Portis scored 12."}
{"game_id": "0021700899", "chunk_id": "0021700899_021", "order": 21, "role": "body", "text": "Bulls: It was the first meeting of the season between the teams. The Bulls won three of four matchups last season and lead the all-time series 92-72."}
{"game_id": "0021700899", "chunk_id": "0021700899_022", "order": 22, "role": "body", "text": "Nets: Brooklyn's losing streak was its longest this season. The Nets had dropped 12 of 13 overall. . Brooklyn hadn't held an opponent below 100 points since defeating the Heat 101-95 on Jan. 19, a span of 14 games. ... With their 20th win, the Nets equaled last season's total."}
{"game_id": "0021700899", "chunk_id": "0021700899_024", "order": 24, "role": "body", "text": "Former Nets star Drazen Petrovic, killed in a car accident in June 1993, was honored during a first-quarter timeout. Following a video tribute, his mother, Biserka, was presented with a commemorative basketball. Petrovic averaged 22.3 points and shot 44.9 percent from 3-point range in his final season with the then-New Jersey Nets. He still ranks third in NBA history in 3-point shooting (43.7 percent)."}
{"game_id": "0021700899", "chunk_id": "0021700899_026", "order": 26, "role": "body", "text": "Hollis-Jefferson returned after missing the Nets' previous 11 games, while LeVert hadn't played since a 123-113 loss to Houston on Feb. 6. Hollis-Jefferson strained his right groin during a 116-91 defeat in Milwaukee on Jan. 26, and LeVert sustained a right knee sprain against the Rockets. Brooklyn went 1-10 during Hollis-Jefferson's absence and was winless without LeVert."}
{"game_id": "0021700899", "chunk_id": "0021700899_027", "order": 27, "role": "body", "text": "\"Rusty, rusty, rusty,\" Hollis-Jefferson said. \"But, I had fun, though.\""}
{"game_id": "0021700899", "chunk_id": "0021700899_029", "order": 29, "role": "body", "text": "Valentine is the only player on either team who has appeared in every game this season. He has started 32 of the Bulls' 60 games."}
{"game_id": "0021700899", "chunk_id": "0021700899_031", "order": 31, "role": "body", "text": "Bulls: Visit the Charlotte Hornets on Tuesday."}
{"game_id": "0021700899", "chunk_id": "0021700899_032", "order": 32, "role": "body", "text": "Nets: At the Cleveland Cavaliers on Tuesday."}
{"game_id": "0021700899", "chunk_id": "0021700899_034", "order": 34, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
