{"game_id": "0021700602", "chunk_id": "0021700602_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  The return of Lonzo Ball has the Los Angeles Lakers running again, and that emphasis on tempo is turning into wins."}
{"game_id": "0021700602", "chunk_id": "0021700602_002", "order": 2, "role": "body", "text": "Julius Randle had 22 points and 14 rebounds, Ball added 11 rebounds and 11 assists, and the Lakers defeated the Sacramento Kings 99-86 on Tuesday night."}
{"game_id": "0021700602", "chunk_id": "0021700602_003", "order": 3, "role": "body", "text": "Brook Lopez scored 18 points and Kentavious Caldwell-Pope had 16 for the Lakers, who have won two straight following a nine-game losing streak."}
{"game_id": "0021700602", "chunk_id": "0021700602_004", "order": 4, "role": "body", "text": "\"That's kind of our best basketball at this point right now, getting out in transition,\" said Brandon Ingram, who had 15 points and five rebounds."}
{"game_id": "0021700602", "chunk_id": "0021700602_005", "order": 5, "role": "body", "text": "With Ball leading the charge, the Lakers were at their most effective when pushing the ball up the court, and they picked up where they left off after tying a franchise record with 42 fast-break points against Atlanta on Sunday. They had a 35-8 edge on the break this time, and Ball's 11 assists were his most since the rookie sustained a shoulder injury that sidelined him for six games. He finished with five points."}
{"game_id": "0021700602", "chunk_id": "0021700602_006", "order": 6, "role": "body", "text": "\"He creates our pace for us,\" Lakers coach Luke Walton said. \"He makes winning plays for us. He gets other people easy shots, so he impacted the game on both ends of the floor and was a big part of why we won tonight.\""}
{"game_id": "0021700602", "chunk_id": "0021700602_007", "order": 7, "role": "body", "text": "Walton was not sated by the win, however. He was unhappy with the Lakers' 26 turnovers and a lackadaisical attitude after going on a 19-0 run in the first quarter. Fueled by eight points from Ingram and seven from Randle, who had 13 points and five rebounds in the first half, Los Angeles took an 18-point lead, its largest of the night."}
{"game_id": "0021700602", "chunk_id": "0021700602_008", "order": 8, "role": "body", "text": "But the second unit let Sacramento right back into the game, and the Lakers were only up 31-27 at the end of the quarter."}
{"game_id": "0021700602", "chunk_id": "0021700602_009", "order": 9, "role": "body", "text": "\"We're trying to play a certain way and have a certain standard,\" Walton said. \"We've been struggling. We will take a win when we can get it, but it just doesn't feel the same way as when you play the game the right way throughout.\""}
{"game_id": "0021700602", "chunk_id": "0021700602_010", "order": 10, "role": "body", "text": "Bogdan Bogdanovic scored 19 points off the bench for the Kings, who have lost five of six. De'Aaron Fox had 15 points and Buddy Hield scored 13."}
{"game_id": "0021700602", "chunk_id": "0021700602_011", "order": 11, "role": "body", "text": "Kings coach Dave Joerger thought fatigue did his team in following a 107-100 loss to San Antonio on Monday. Sacramento shot a season-worst 34.5 percent from the field (30 of 87)."}
{"game_id": "0021700602", "chunk_id": "0021700602_012", "order": 12, "role": "body", "text": "\"It's just that time of year where you have to keep grinding away,\" Joerger said. \"We made too many mental mistakes, made some really bad turnovers that are just head-scratchers. The guys are getting better, and we'll just keep plugging away.\""}
{"game_id": "0021700602", "chunk_id": "0021700602_014", "order": 14, "role": "body", "text": "Los Angeles opened an 84-74 lead going into the fourth quarter, closing the third on a 22-10 run. Sacramento started the second half with a 14-3 surge to take an eight-point lead before Lopez hit three 3-pointers. Lopez then missed from long range on what he admitted was a heat-check shot, but Ball was under the basket for a putback."}
{"game_id": "0021700602", "chunk_id": "0021700602_015", "order": 15, "role": "body", "text": "Lopez finished 5 of 8 from 3-point range."}
{"game_id": "0021700602", "chunk_id": "0021700602_016", "order": 16, "role": "body", "text": "\"They made the last run and just kind of sustained it,\" Fox said."}
{"game_id": "0021700602", "chunk_id": "0021700602_018", "order": 18, "role": "body", "text": "Randle spent most of the season using his superior athleticism to get the better of backup centers and power forwards as a scorer. Walton wants him to be just as willing to pass when driving down the lane now that Randle is becoming a more regular presence in the starting lineup."}
{"game_id": "0021700602", "chunk_id": "0021700602_019", "order": 19, "role": "body", "text": "The growing pains were evident, with six assists and six turnovers against the length of Zach Randolph and Willie Cauley-Stein."}
{"game_id": "0021700602", "chunk_id": "0021700602_020", "order": 20, "role": "body", "text": "\"Tonight he had moments where he was great at it and there were moments where he over-penetrated and we got in trouble,\" Walton said."}
{"game_id": "0021700602", "chunk_id": "0021700602_022", "order": 22, "role": "body", "text": "Kings: G George Hill missed his third straight game to be with his wife, who is pregnant."}
{"game_id": "0021700602", "chunk_id": "0021700602_023", "order": 23, "role": "body", "text": "Lakers: Ball had his ninth career double-double. ... Randle had his eighth double-double of the season."}
{"game_id": "0021700602", "chunk_id": "0021700602_025", "order": 25, "role": "body", "text": "Kings: Host the Los Angeles Clippers on Thursday night."}
{"game_id": "0021700602", "chunk_id": "0021700602_026", "order": 26, "role": "body", "text": "Lakers: Host the San Antonio Spurs on Thursday night."}
{"game_id": "0021700602", "chunk_id": "0021700602_028", "order": 28, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
