{"game_id": "0021400176", "chunk_id": "0021400176_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  After dealing with a stomach virus that affected nearly half the team earlier in the week, the Memphis Grizzlies recovered enough to get their 21st straight regular season home victory."}
{"game_id": "0021400176", "chunk_id": "0021400176_002", "order": 2, "role": "body", "text": "Marc Gasol matched his career high with 32 points, Zach Randolph added 16 points and 16 rebounds, and the Grizzlies beat the Boston Celtics 117-100 on Friday night."}
{"game_id": "0021400176", "chunk_id": "0021400176_003", "order": 3, "role": "body", "text": "\"With the stomach virus that we all had, I think, the guys are still coming back from that,\" said reserve forward Jon Leuer, who had a season-high 19 points. \"We are still feeling a little run down, but it's just a matter when you step between the lines you can't make any excuses. You just have to go play.\""}
{"game_id": "0021400176", "chunk_id": "0021400176_004", "order": 4, "role": "body", "text": "The inside dominance is what is expected from the Grizzlies, who outrebounded Boston 50-38, and outscored the Celtics in the paint 66-38."}
{"game_id": "0021400176", "chunk_id": "0021400176_005", "order": 5, "role": "body", "text": "\"Obviously, we think Marc and Zach work every night but (against Boston) it was really evident we had something going,\" said point guard Mike Conley, who had 15 points and eight assists. \"Marc was hot. Zach was hot, and those are the guys we're going to run our offense through.\""}
{"game_id": "0021400176", "chunk_id": "0021400176_006", "order": 6, "role": "body", "text": "The Grizzlies sent five players -- including Leuer -- home early from Toronto rather than playing in a loss to the Raptors on Wednesday night. Some players still were dealing with the lingering symptoms. Starter Tony Allen and reserve swingman Quincy Pondexter missed Friday's game."}
{"game_id": "0021400176", "chunk_id": "0021400176_007", "order": 7, "role": "body", "text": "Memphis used a strong showing with Gasol leading the way, hitting 13 of 22 shots."}
{"game_id": "0021400176", "chunk_id": "0021400176_008", "order": 8, "role": "body", "text": "\"Gasol was huge, and he was the best player on the floor,\" Boston coach Brad Stevens said. \"He just kept making plays over and over, both with the pass and the shot.\""}
{"game_id": "0021400176", "chunk_id": "0021400176_009", "order": 9, "role": "body", "text": "Kelly Olynyk led Boston with 18 points. Jared Sullinger had 13 points, Jeff Green added 12, while Avery Bradley and Marcus Thornton finished with 11 points each."}
{"game_id": "0021400176", "chunk_id": "0021400176_010", "order": 10, "role": "body", "text": "Memphis never trailed in the game, leading by 21 in the fourth quarter -- the advantage fueled by a 9-0 run."}
{"game_id": "0021400176", "chunk_id": "0021400176_011", "order": 11, "role": "body", "text": "\"We need to come out executing and being aggressive and hit first,\" said Evan Turner, who had 10 points for Boston. \"We have to do a better job of doing that consistently.\""}
{"game_id": "0021400176", "chunk_id": "0021400176_012", "order": 12, "role": "body", "text": "Boston, which trailed by 14 in the first half, made a run to open the third. Eventually, the Celtics, behind Olynyk's 14 points in the quarter, used a 14-4 run to get it under double digits."}
{"game_id": "0021400176", "chunk_id": "0021400176_013", "order": 13, "role": "body", "text": "Boston never got the deficit below nine points in the fourth."}
{"game_id": "0021400176", "chunk_id": "0021400176_014", "order": 14, "role": "body", "text": "\"I think we played well in stretches, but there were certainly stretches where we didn't,\" Stevens said. \"There are some guys out on the floor on (the Grizzlies) we can learn a lot from, especially our young bigs.\""}
{"game_id": "0021400176", "chunk_id": "0021400176_017", "order": 17, "role": "body", "text": "Celtics: Told before the game the Grizzlies had a 20-game regular season home winning streak, Stevens said: \"They don't lose on the road that often, either.\" ... Celtics have lost five straight in the series. ... Green had six rebounds, surpassing 2,500 boards for his career."}
{"game_id": "0021400176", "chunk_id": "0021400176_018", "order": 18, "role": "body", "text": "Grizzlies: Gasol first recorded his career-high 32 points earlier this season against Minnesota. ... Randolph recorded his 16 and 16 through three quarters. He didn't play in the fourth with the Grizzlies well ahead."}
{"game_id": "0021400176", "chunk_id": "0021400176_019", "order": 19, "role": "body", "text": "INFIRMARY REPORT: Seven Grizzlies have dealt with the virus and Memphis coach Dave Joerger expressed concerns the problem may not be over. \"We still don't know who is going to play on Sunday (against the Clippers),\" he said. \"And some of the guys healthy now, may end up being ill by Sunday.\""}
{"game_id": "0021400176", "chunk_id": "0021400176_020", "order": 20, "role": "body", "text": "ON OLYNYK: Stevens said there were times, particularly in the second half, Olynyk showed flashes, but the Celtics need more consistency. \"Maybe there are some learning experiences for these guys, but they have to expedite that curve because they're playing for us. We're not showing them film and learning after practice. They're playing in games.\""}
{"game_id": "0021400176", "chunk_id": "0021400176_022", "order": 22, "role": "body", "text": "Celtics: Host Portland on Sunday."}
{"game_id": "0021400176", "chunk_id": "0021400176_023", "order": 23, "role": "closing", "text": "Grizzlies: Host the L.A. Clippers on Sunday."}
