{"game_id": "0021401222", "chunk_id": "0021401222_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Russell Westbrook did everything in his power to drag the banged-up Oklahoma City Thunder to the playoffs for a sixth straight season."}
{"game_id": "0021401222", "chunk_id": "0021401222_002", "order": 2, "role": "body", "text": "Eleven triple-doubles, 16 technical fouls and one scoring title weren't enough in the rugged Western Conference. And now the Thunder are headed for the same place the lowly Minnesota Timberwolves are -- the NBA's draft lottery."}
{"game_id": "0021401222", "chunk_id": "0021401222_003", "order": 3, "role": "body", "text": "Westbrook went out with a bang, scoring 37 points in Oklahoma City's 138-113 victory over the Timberwolves on Wednesday night that was rendered moot by New Orleans' playoff-clinching in over San Antonio."}
{"game_id": "0021401222", "chunk_id": "0021401222_004", "order": 4, "role": "body", "text": "The Thunder needed a win in the regular-season finale and a loss from the Pelicans against the Spurs to get into the playoffs. Westbrook locked up his first scoring title to hold up his end of the bargain, but the Pelicans beat the Spurs 108-103. That means the Thunder will miss the playoffs for the first time since Westbrook's rookie season in 2008-09."}
{"game_id": "0021401222", "chunk_id": "0021401222_005", "order": 5, "role": "body", "text": "\"Doesn't mean nothing,\" Westbrook said when asked about his first career scoring title. \"Good job. Hurray. I'm at home. Watching other teams play. Doesn't mean nothing.\""}
{"game_id": "0021401222", "chunk_id": "0021401222_006", "order": 6, "role": "body", "text": "Andrew Wiggins had 23 points and six rebounds for the Timberwolves (16-66), who finished with the worst record in the league. They will have a 25 percent chance at the No. 1 draft pick when the  lottery is held on May 19 and are assured of falling no further than fourth."}
{"game_id": "0021401222", "chunk_id": "0021401222_007", "order": 7, "role": "body", "text": "\"It's interesting because people always talk about the lottery,\" coach Flip Saunders said. \"It's not from the perspective of you getting the number one pick, but it shows basically what your basement is.\""}
{"game_id": "0021401222", "chunk_id": "0021401222_008", "order": 8, "role": "body", "text": "Dion Waiters tied a career high with 33 points and hit 5 of 8 3-pointers and Enes Kanter had 25 points and 15 rebounds for the Thunder (45-37), who entered the season as one of the favorites in the Western Conference before losing Kevin Durant, Serge Ibaka and Westbrook to injuries for big chunks of time."}
{"game_id": "0021401222", "chunk_id": "0021401222_009", "order": 9, "role": "body", "text": "Westbrook has been a one-man wrecking crew for most of the season for the short-handed Thunder, and he laid siege to the hapless Timberwolves with a breathtaking first quarter. He hit 7 of 8 shots, both 3-pointers, and 7 of 8 free throws for 23 points to completely overwhelm a Timberwolves team that dressed nine players."}
{"game_id": "0021401222", "chunk_id": "0021401222_010", "order": 10, "role": "body", "text": "\"He's had a season for the ages,\" Thunder coach Scott Brooks said. \"He's done things on both ends, rebounding passing scoring, defending that hasn't been seen in decades. But he's also led.\""}
{"game_id": "0021401222", "chunk_id": "0021401222_011", "order": 11, "role": "body", "text": "He punctuated the quarter with a blow by fellow UCLA product Zach LaVine for a layup, then hit a 3 for a 47-29 lead."}
{"game_id": "0021401222", "chunk_id": "0021401222_012", "order": 12, "role": "body", "text": "\"Sheesh this guy is ridiculous,\" Durant tweeted in the second quarter."}
{"game_id": "0021401222", "chunk_id": "0021401222_013", "order": 13, "role": "body", "text": "He had 34 by halftime and went to the locker room no doubt seeing that the Pelicans had a 16-point halftime lead on the Spurs."}
{"game_id": "0021401222", "chunk_id": "0021401222_014", "order": 14, "role": "body", "text": "Prior to the game, Westbrook said he wasn't going to be glancing at the scoreboard, but he started deferring in the second half when all appeared lost. San Antonio cut it to five in the fourth quarter, but Anthony Davis and Co. closed the defending champions out."}
{"game_id": "0021401222", "chunk_id": "0021401222_015", "order": 15, "role": "body", "text": "Kevin Martin scored 29 points for the Timberwolves, who finished the season with 12 straight losses."}
{"game_id": "0021401222", "chunk_id": "0021401222_016", "order": 16, "role": "body", "text": "Westbrook watched the entire fourth quarter from the bench, and finished the season with an average of 28.1 points to beat out Houston's James Harden. And as much as it stings not to be in the playoffs for one of the NBA's fiercest competitors, Westbrook still managed to find solace in making New Orleans work to the very last day of the season to beat them."}
{"game_id": "0021401222", "chunk_id": "0021401222_017", "order": 17, "role": "body", "text": "\"I thought we showed maturity,\" Westbrook said. \"Obviously with the injuries and different things of that nature throughout the season, our team could've easily gave up. Obviously we made some changes and trades and different things like that. That could've been another excuse that we gave ourselves but we never gave up. We competed all 82 games and I'm proud of that.\""}
{"game_id": "0021401222", "chunk_id": "0021401222_019", "order": 19, "role": "body", "text": "Thunder: The 76 points in the first half were their second-highest total this season. ... The Thunder outscored the Wolves 64-42 in the paint."}
{"game_id": "0021401222", "chunk_id": "0021401222_020", "order": 20, "role": "body", "text": "Timberwolves: Wiggins said he will play for the Canadian national team during Olympic qualifying this summer. There was some question about it after all the minutes he played in his rookie season, but he said he thought he could get enough rest early before competition began in August.  ... LaVine had 19 points and 13 assists."}
{"game_id": "0021401222", "chunk_id": "0021401222_022", "order": 22, "role": "body", "text": "Westbrook took some criticism nationally after taking 43 shots against Indiana on Sunday. He scored 54 points, but the Thunder lost to the Pacers, leading some to say that Westbrook should have gotten his teammates more involved."}
{"game_id": "0021401222", "chunk_id": "0021401222_023", "order": 23, "role": "body", "text": "Coming to his defense was none other than Kobe Bryant, who took to Twitter to support Westbrook's approach in an important game. The gesture resonated with Westbrook."}
{"game_id": "0021401222", "chunk_id": "0021401222_024", "order": 24, "role": "closing", "text": "\"That's my guy. That's my guy. That's my guy,\" Westbrook said. \"Definitely Kobe is a good friend of mine and somebody that being in LA I was able to watch and see become a Hall of Famer and one of the best players to play the game. It's an honor to be able to see somebody like that to be able to have your back and support you.\""}
