{"game_id": "0021400174", "chunk_id": "0021400174_001", "order": 1, "role": "lead", "text": "ATLANTA --  Jeff Teague scored a season-high 28 points and then earned compliments for his defense."}
{"game_id": "0021400174", "chunk_id": "0021400174_002", "order": 2, "role": "body", "text": "Led by Teague's play on both ends of the court, the Atlanta Hawks didn't panic after blowing a 19-point lead and recovered to beat the Detroit Pistons 99-89 on Friday night."}
{"game_id": "0021400174", "chunk_id": "0021400174_003", "order": 3, "role": "body", "text": "Paul Millsap had 15 points and 12 rebounds for Atlanta, which snapped a two-game skid."}
{"game_id": "0021400174", "chunk_id": "0021400174_004", "order": 4, "role": "body", "text": "Hawks coach Mike Budenholzer said he expected Teague's points would get all the attention. Budenholzer said he was just as happy with the point guard's defense and poise down the stretch. Teague had two steals and blocked two shots."}
{"game_id": "0021400174", "chunk_id": "0021400174_005", "order": 5, "role": "body", "text": "\"Jeff Teague was very good,\" Budenholzer said. \"A lot of people talk about his points and his offense, but I thought his defense was very good on the ball.\""}
{"game_id": "0021400174", "chunk_id": "0021400174_006", "order": 6, "role": "body", "text": "Josh Smith had 16 points and Andre Drummond added 13 points with 16 rebounds for the Pistons, who have lost four straight. They had two three-game losing streaks earlier in the season."}
{"game_id": "0021400174", "chunk_id": "0021400174_007", "order": 7, "role": "body", "text": "The Pistons made only 4 of 21 3-pointers and shot only 37.3 percent overall."}
{"game_id": "0021400174", "chunk_id": "0021400174_008", "order": 8, "role": "body", "text": "\"We're just in a shooting slump right now,\" Smith said."}
{"game_id": "0021400174", "chunk_id": "0021400174_009", "order": 9, "role": "body", "text": "Former University of Georgia standout Kentavious Caldwell-Pope was only 1 of 7 from the field for four points. D.J. Augustin had 14 points but made only 4 of 17 shots."}
{"game_id": "0021400174", "chunk_id": "0021400174_010", "order": 10, "role": "body", "text": "\"We just struggle down the last few minutes of games,\" said Detroit coach Stan Van Gundy. \"We've got to find some answers. We as a group, not just the players. ... You look at our shooting percentages. We just don't have really anybody playing at a very high level.\""}
{"game_id": "0021400174", "chunk_id": "0021400174_011", "order": 11, "role": "body", "text": "Detroit rallied after trailing 70-51 in the third quarter."}
{"game_id": "0021400174", "chunk_id": "0021400174_012", "order": 12, "role": "body", "text": "Pistons starting guard Brandon Jennings did not play in the fourth quarter after suffering a hyperextended left thumb."}
{"game_id": "0021400174", "chunk_id": "0021400174_013", "order": 13, "role": "body", "text": "With Jennings out, Augustin led the comeback as Detroit pulled even with a 14-0 run that began late in the third quarter and continued into the final period. Augustin had back-to-back baskets as the Pistons pulled even at 74-74 with 8:31 remaining."}
{"game_id": "0021400174", "chunk_id": "0021400174_014", "order": 14, "role": "body", "text": "Al Horford, who had 14 points, answered with a layup as Atlanta reclaimed the lead for good."}
{"game_id": "0021400174", "chunk_id": "0021400174_015", "order": 15, "role": "body", "text": "\"They did what they were supposed to do,\" Teague said of the Pistons. \"They competed. We were able to withstand the run and make plays at the end.\""}
{"game_id": "0021400174", "chunk_id": "0021400174_016", "order": 16, "role": "body", "text": "Horford sank a buzzer-beating jumper before halftime to give Atlanta a 50-40 lead. The Hawks still led by 10, at 74-64, entering the final period."}
{"game_id": "0021400174", "chunk_id": "0021400174_018", "order": 18, "role": "body", "text": "Pistons: Smith, who played only 23 minutes and had only five points and four rebounds in Wednesday's 88-86 loss to the Suns, was back in form against his former team. He had eight rebounds and led the Pistons with five assists. Smith played for Atlanta from 2004-13. ... Augustine scored nine points in the final period."}
{"game_id": "0021400174", "chunk_id": "0021400174_019", "order": 19, "role": "body", "text": "Hawks: G DeMarre Carroll (groin) started and had 10 points with seven rebounds after missing four games. ... Atlanta on Thursday assigned rookie F-C Adreian Payne to the Fort Wayne Mad Ants of the NBA Development League. Payne was the 15th overall selection in this year's draft. ... Kyle Korver made two 3-pointers to tie Tim Hardaway for 18th all-time with 1,542."}
{"game_id": "0021400174", "chunk_id": "0021400174_021", "order": 21, "role": "body", "text": "Detroit: At Milwaukee on Tuesday night."}
{"game_id": "0021400174", "chunk_id": "0021400174_022", "order": 22, "role": "body", "text": "Atlanta: At Washington on Tuesday night."}
{"game_id": "0021400174", "chunk_id": "0021400174_024", "order": 24, "role": "body", "text": "Atlanta Braves manager Fredi Gonzalez visited with Van Gundy after the game. The two became friends when Gonzalez managed the Marlins and Van Gundy coached the Miami Heat and Orlando Magic. After his postgame news conference, Van Gundy said \"Maybe Fredi has some answers. Maybe we need to bunt more!\""}
{"game_id": "0021400174", "chunk_id": "0021400174_026", "order": 26, "role": "closing", "text": "Budenholzer said his message during the Pistons' run was to remain poised. \"Our players did that,\" he said. \"I think we've got a good group in that way.\""}
