{"game_id": "0021401060", "chunk_id": "0021401060_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Brook Lopez was disappointed when he turned the ball over on an inbounds pass with 3.2 seconds left in the game and the Brooklyn Nets up by three."}
{"game_id": "0021401060", "chunk_id": "0021401060_002", "order": 2, "role": "body", "text": "\"It might have looked like I was point shaving, like I made a call to my Uncle Huey in (Las) Vegas,\" Lopez joked."}
{"game_id": "0021401060", "chunk_id": "0021401060_003", "order": 3, "role": "body", "text": "So he felt a measure of redemption when he deflected the ensuing inbounds pass from Charlotte's Gerald Henderson, preventing the Hornets from getting off a tying 3-pointer in Brooklyn's 91-88 win Wednesday night."}
{"game_id": "0021401060", "chunk_id": "0021401060_004", "order": 4, "role": "body", "text": "\"No question, it was a relief,\" Lopez said."}
{"game_id": "0021401060", "chunk_id": "0021401060_005", "order": 5, "role": "body", "text": "Henderson and Al Jefferson each had 23 points for Charlotte. But Henderson was left contemplating the missed opportunity."}
{"game_id": "0021401060", "chunk_id": "0021401060_006", "order": 6, "role": "body", "text": "\"I probably should have faked or whatever,\" he said of the inbounds pass. \"I wasn't really sure how much time I had left so I tried to get it to him. They put their 7-footer on me and he tipped it. It's just a tough play. It's a tough pass with a 7-footer on you.\""}
{"game_id": "0021401060", "chunk_id": "0021401060_007", "order": 7, "role": "body", "text": "Lopez did more than just tip the pass."}
{"game_id": "0021401060", "chunk_id": "0021401060_008", "order": 8, "role": "body", "text": "He had a game-high 34 points and 10 rebounds as the Nets pulled even with the Hornets in the Eastern Conference standings at 30-40. The win also gives the Nets a 2-1 series lead this season and the tiebreaker over the Hornets."}
{"game_id": "0021401060", "chunk_id": "0021401060_009", "order": 9, "role": "body", "text": "Lopez has scored at least 26 points in each of his last three games, including 31 on Monday night against Boston."}
{"game_id": "0021401060", "chunk_id": "0021401060_010", "order": 10, "role": "body", "text": "\"Brook carried us,\" said Nets coach Lionel Hollins."}
{"game_id": "0021401060", "chunk_id": "0021401060_011", "order": 11, "role": "body", "text": "Deron Williams had 10 points, 14 assists and seven rebounds for the Nets, who have won five of their last seven. Alan Anderson added 13 points off the bench."}
{"game_id": "0021401060", "chunk_id": "0021401060_012", "order": 12, "role": "body", "text": "Nets forward Thaddeus Young left the game late in the third quarter with a hyperextended knee and did not return. Team officials said X-rays were negative and he will be re-evaluated on Thursday."}
{"game_id": "0021401060", "chunk_id": "0021401060_013", "order": 13, "role": "body", "text": "Young's loss could hinder the Nets as they look to compete for a playoff spot. He collided with Henderson in the lane following a sudden change of possession. He remained on the floor for about a minute as teammates gathered around before getting up and limping to the locker room."}
{"game_id": "0021401060", "chunk_id": "0021401060_014", "order": 14, "role": "body", "text": "Young finished with 11 points."}
{"game_id": "0021401060", "chunk_id": "0021401060_015", "order": 15, "role": "body", "text": "With the game tied at 85, Lopez sank a 7-footer off a feed from Williams to give the Nets the lead with 23 seconds left."}
{"game_id": "0021401060", "chunk_id": "0021401060_016", "order": 16, "role": "body", "text": "Kemba Walker air-balled a driving layup and the Hornets were forced to foul Williams, who sank both free throws with 13.2 seconds left to make it a two-possession game."}
{"game_id": "0021401060", "chunk_id": "0021401060_017", "order": 17, "role": "body", "text": "Walker made one of two free throws on the other end and Williams added two more free throws with 9.7 seconds left make it a 91-86 game."}
{"game_id": "0021401060", "chunk_id": "0021401060_018", "order": 18, "role": "body", "text": "That lead seemed safe until Walker scored on a driving layup and Lopez's errant inbounds pass was tipped out of bounds off Williams with 3.2 seconds left, giving the Hornets another shot to tie it at the end of regulation."}
{"game_id": "0021401060", "chunk_id": "0021401060_019", "order": 19, "role": "body", "text": "It was potentially costly loss for the Hornets, who have lost five of their last six."}
{"game_id": "0021401060", "chunk_id": "0021401060_020", "order": 20, "role": "body", "text": "The Hornets have a tough schedule the rest of the way."}
{"game_id": "0021401060", "chunk_id": "0021401060_021", "order": 21, "role": "body", "text": "\"That's fine, if we are going to play our way in we're going to have to earn it and win games like this,\" Hornets coach Steve Clifford said. \"We did a lot of good things but again, we have to know who we are and how to play.\""}
{"game_id": "0021401060", "chunk_id": "0021401060_023", "order": 23, "role": "body", "text": "Nets: The Nets have won four of their last five on the road."}
{"game_id": "0021401060", "chunk_id": "0021401060_024", "order": 24, "role": "body", "text": "Hornets: Charlotte is 3-11 in its last 14 games against Brooklyn."}
{"game_id": "0021401060", "chunk_id": "0021401060_026", "order": 26, "role": "body", "text": "Clifford conceded that Jefferson is not close to 100 percent healthy -- and hasn't been for a while. Still, Clifford said having a hobbled Jefferson is better than not having him at all."}
{"game_id": "0021401060", "chunk_id": "0021401060_027", "order": 27, "role": "body", "text": "\"He's very competitive and you are never going to question his courage,\" Clifford said. \"But let's face it, he hasn't been healthy all year. Every time he gets close to 100 percent he has a setback. Right now he's not close to what he would like to be but he doesn't want to sit out. He battles but doesn't have his quickness and agility.\""}
{"game_id": "0021401060", "chunk_id": "0021401060_029", "order": 29, "role": "body", "text": "Nets: Host Cleveland on Friday night."}
{"game_id": "0021401060", "chunk_id": "0021401060_030", "order": 30, "role": "closing", "text": "Hornets: At Washington on Friday night."}
