{"game_id": "0021701115", "chunk_id": "0021701115_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  The Clippers came out attacking, moving the ball and hitting 3-pointers to start the game. Then they got stagnant."}
{"game_id": "0021701115", "chunk_id": "0021701115_003", "order": 3, "role": "body", "text": "They blew a 16-point, first-half lead and rallied from five down on a slew of 3s in the fourth to beat the Milwaukee Bucks 105-98 on Tuesday night and boost their playoff hopes."}
{"game_id": "0021701115", "chunk_id": "0021701115_004", "order": 4, "role": "body", "text": "Tobias Harris scored 19 points, DeAndre Jordan had 12 points and 16 rebounds, and Lou Williams added 16 points off the bench."}
{"game_id": "0021701115", "chunk_id": "0021701115_005", "order": 5, "role": "body", "text": "The Clippers hit six 3-pointers in the fourth, when they launched a 13-0 run to go back in front 96-88."}
{"game_id": "0021701115", "chunk_id": "0021701115_006", "order": 6, "role": "body", "text": "They made 3-pointers on four straight possessions -- by four different players -- for a 105-96 lead."}
{"game_id": "0021701115", "chunk_id": "0021701115_007", "order": 7, "role": "body", "text": "\"Those really hurt,\" Bucks coach Joe Prunty said."}
{"game_id": "0021701115", "chunk_id": "0021701115_008", "order": 8, "role": "body", "text": "Los Angeles trails Minnesota by 1  1/2 games for the eighth and final Western Conference berth with eight games to play."}
{"game_id": "0021701115", "chunk_id": "0021701115_009", "order": 9, "role": "body", "text": "\"We're focused right now as much as I've ever seen,\" said Austin Rivers, who scored 10 of his 13 points in the fourth. \"We look at each game like it's the last game. We don't have too much room for error.\""}
{"game_id": "0021701115", "chunk_id": "0021701115_010", "order": 10, "role": "body", "text": "Milos Teodosic got their 3-point run going in the first quarter, when he made four of the Clippers' seven 3-pointers. He left the game just before halftime after tweaking his left foot, which has been bothered by plantar fasciitis this season."}
{"game_id": "0021701115", "chunk_id": "0021701115_011", "order": 11, "role": "body", "text": "\"I know he was kicking (expletive),\" Jordan said."}
{"game_id": "0021701115", "chunk_id": "0021701115_012", "order": 12, "role": "body", "text": "Giannis Antetokounmpo scored 26 points and Khris Middleton added 22 for the Bucks, who opened a four-game Western Conference swing by having their two-game winning streak snapped."}
{"game_id": "0021701115", "chunk_id": "0021701115_013", "order": 13, "role": "body", "text": "The Clippers came out strongly to start the second quarter, extending their lead to 16 on a dunk by Williams."}
{"game_id": "0021701115", "chunk_id": "0021701115_014", "order": 14, "role": "body", "text": "But Middleton and the Bucks chipped away, outscoring the Clippers 26-15 in the third and getting stops on defense. Antetokounmpo had 10 points to help send Milwaukee into the fourth leading 82-78."}
{"game_id": "0021701115", "chunk_id": "0021701115_015", "order": 15, "role": "body", "text": "\"We just played defense,\" he said. \"When we are able to do that we're really good.\""}
{"game_id": "0021701115", "chunk_id": "0021701115_016", "order": 16, "role": "body", "text": "The Bucks ended the third on a 9-0 run, including back-to-back baskets by Tyler Zeller that gave them their first lead since the initial basket of the game."}
{"game_id": "0021701115", "chunk_id": "0021701115_018", "order": 18, "role": "body", "text": "Bucks: Backup C Thon Maker sat out with a right groin strain. ... Green Bay quarterback Aaron Rodgers attended."}
{"game_id": "0021701115", "chunk_id": "0021701115_019", "order": 19, "role": "body", "text": "Clippers: They have won five of seven against the Bucks, including 127-120 last week. ... F Danilo Gallinari (right hand contusion, non-displaced fracture) could return Friday at Portland or Sunday against Indiana. He's missed 17 games with the latest in a string of injuries this season."}
{"game_id": "0021701115", "chunk_id": "0021701115_021", "order": 21, "role": "body", "text": "Antetokounmpo was the subject of a segment on \"60 Minutes\" on Sunday. Interviewer Steve Kroft traveled to Greece to visit the gym where Antetokounmpo and his brother honed their basketball skills and explained how his parents emigrated from Nigeria."}
{"game_id": "0021701115", "chunk_id": "0021701115_022", "order": 22, "role": "body", "text": "\"I loved it. It talked about me, talked about my family,\" Antetokounmpo said. \"It talked about where I came from and the most important thing, it talked about how someone's got to work to succeed in life.\""}
{"game_id": "0021701115", "chunk_id": "0021701115_024", "order": 24, "role": "body", "text": "\"When you have a nickname and Freak is at the end of it, you're probably pretty good.\" -- Doc Rivers on Antetokounmpo."}
{"game_id": "0021701115", "chunk_id": "0021701115_026", "order": 26, "role": "body", "text": "Bucks: Visit Golden State on Thursday. They lost to the Warriors 108-94 at home on Jan. 12."}
{"game_id": "0021701115", "chunk_id": "0021701115_027", "order": 27, "role": "body", "text": "Clippers: Visit Phoenix on Wednesday in the second game of a back-to-back, their last one of the season. They are 3-7 on the road in the second game."}
{"game_id": "0021701115", "chunk_id": "0021701115_029", "order": 29, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
