{"game_id": "0021701208", "chunk_id": "0021701208_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Eric Bledsoe replaced the injured Giannis Antetokounmpo as the Milwaukee Bucks' all-purpose threat and ran circles around the Orlando Magic."}
{"game_id": "0021701208", "chunk_id": "0021701208_002", "order": 2, "role": "body", "text": "Coach Joe Prunty was just as impressed with the contributions from his quick point guard that didn't make the stat sheet."}
{"game_id": "0021701208", "chunk_id": "0021701208_003", "order": 3, "role": "body", "text": "Bledsoe had his fourth career triple-double with 20 points, 12 rebounds and 11 assists in a 102-86 win on Monday night in the final regular-season game at the Bradley Center."}
{"game_id": "0021701208", "chunk_id": "0021701208_004", "order": 4, "role": "body", "text": "\"For as good as he was statistically tonight, there are things you don't see on the stat sheet and that ability to get on the ball and defense,\" Prunty said, \"and that's critical for us.\""}
{"game_id": "0021701208", "chunk_id": "0021701208_005", "order": 5, "role": "body", "text": "Shabazz Muhammad added season-high 22 points and helped spark a 20-6 run in the third quarter for the Bucks, who leapfrogged Miami for sixth in the Eastern Conference. The Heat lost to Oklahoma City on Monday."}
{"game_id": "0021701208", "chunk_id": "0021701208_006", "order": 6, "role": "body", "text": "A win on Wednesday night on the road against the Philadelphia 76ers would clinch the sixth seed for Milwaukee."}
{"game_id": "0021701208", "chunk_id": "0021701208_007", "order": 7, "role": "body", "text": "\"We put ourselves in a position to where we're in a pretty position to determine where you want to be if that's what you want to do,\" center John Henson said. \"But we want to be the highest seed possible, so that's the goal.\""}
{"game_id": "0021701208", "chunk_id": "0021701208_008", "order": 8, "role": "body", "text": "Nikola Vucevic led Orlando with 17 points and 10 rebounds, while Bismack Biyombo had 14 points."}
{"game_id": "0021701208", "chunk_id": "0021701208_009", "order": 9, "role": "body", "text": "The Magic fell to 24-57 but had reason to be confident after beating the Bucks 126-117 in their last meeting on March 14. Orlando was 18 of 34 from 3-point range that night to withstand a 38-point outburst by Antetokounmpo."}
{"game_id": "0021701208", "chunk_id": "0021701208_010", "order": 10, "role": "body", "text": "The shooting touch was missing Monday, when Orlando was just 5 of 24 from behind the arc."}
{"game_id": "0021701208", "chunk_id": "0021701208_011", "order": 11, "role": "body", "text": "The Magic couldn't make up for the misses on the defensive end, especially in the third quarter."}
{"game_id": "0021701208", "chunk_id": "0021701208_012", "order": 12, "role": "body", "text": "\"It's been the case all season. Our defense has never been consistent enough,\" coach Frank Vogel said."}
{"game_id": "0021701208", "chunk_id": "0021701208_013", "order": 13, "role": "body", "text": "Milwaukee won its second straight game without Antetokounmpo, who is resting a sore right ankle. Both victories came against 50-loss teams."}
{"game_id": "0021701208", "chunk_id": "0021701208_014", "order": 14, "role": "body", "text": "They got a huge lift on Monday from Bledsoe, with help from Muhammad and Jason Terry off the bench. They helped push the Bucks on the 20-6 run over the final 5:27 of the third to build a 74-67 lead."}
{"game_id": "0021701208", "chunk_id": "0021701208_015", "order": 15, "role": "body", "text": "\"We stopped getting stops. We were defending really well up until that point,\" Magic forward Aaron Gordon said."}
{"game_id": "0021701208", "chunk_id": "0021701208_016", "order": 16, "role": "body", "text": "Terry, the savvy veteran guard, immediately gave the Bucks a spark by forcing a turnover on the inbounds play after Bledsoe's two foul shots. Muhammad gave the Bucks a presence off the dribble to help make up for the absence of the free-wheeling Antetokounmpo."}
{"game_id": "0021701208", "chunk_id": "0021701208_017", "order": 17, "role": "body", "text": "\"Shabazz played a (great) game all night long, played in attack mode ... got to his strengths in the paint,\" forward Khris Middleton said."}
{"game_id": "0021701208", "chunk_id": "0021701208_018", "order": 18, "role": "body", "text": "The Bucks led comfortably the rest of the way to close out the regular season at the Bradley Center. A new arena is scheduled to open in the fall on an adjacent lot in downtown Milwaukee."}
{"game_id": "0021701208", "chunk_id": "0021701208_020", "order": 20, "role": "body", "text": "Magic: Asked for his memories at the Bradley Center, Vogel recalled a time when then-Celtics coach Rick Pitino got into an argument with guard Dee Brown off the court while Vogel was Boston's video coordinator. \"Not a ... fight but just a (verbal) flare-up,\" Vogel said."}
{"game_id": "0021701208", "chunk_id": "0021701208_021", "order": 21, "role": "body", "text": "Bucks: G Malcolm Brogdon (left quad) returned following a 30-game absence. The 2016-17 NBA Rookie of the Year scored two and played 13 minutes, all in the first half."}
{"game_id": "0021701208", "chunk_id": "0021701208_023", "order": 23, "role": "body", "text": "A game that had the feel of a Milwaukee blowout turned tight after a cold-shooting second quarter for the Bucks. They missed their first 12 shots in the period, with a Bledsoe-to-Middleton layup finally ending the scoreless streak with 5:07 left."}
{"game_id": "0021701208", "chunk_id": "0021701208_024", "order": 24, "role": "body", "text": "The pace picked up again once facilitators Bledsoe and Middleton (18 points) re-entered the game, with Milwaukee taking a 45-42 lead at halftime."}
{"game_id": "0021701208", "chunk_id": "0021701208_026", "order": 26, "role": "body", "text": "Vucevic added 10 rebounds to pick up his 29th double-double of the season. ... Biyombo was 6 of 7 from the field. ... The Bucks with a regular season record of 668-536 in their 30 seasons at the Bradley Center."}
{"game_id": "0021701208", "chunk_id": "0021701208_028", "order": 28, "role": "body", "text": "\"Complacency. I think that is kind of what happens to a young team with early wins.\" -- Gordon, on Orlando's struggles after starting 8-4 this season."}
{"game_id": "0021701208", "chunk_id": "0021701208_030", "order": 30, "role": "body", "text": "Magic: Wrap up the season by hosting the Wizards on Wednesday."}
{"game_id": "0021701208", "chunk_id": "0021701208_031", "order": 31, "role": "body", "text": "Bucks: Finish the regular season with a trip to face the 76ers."}
{"game_id": "0021701208", "chunk_id": "0021701208_033", "order": 33, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
