{"game_id": "0021700267", "chunk_id": "0021700267_001", "order": 1, "role": "lead", "text": "NEW YORK -- Jusuf Nurkic apologized to Damian Lillard as they strolled back to their locker room, upset he had missed two free throws with less the three seconds left, giving the Brooklyn Nets a chance to either tie or win it at the buzzer.\nAll Lillard could care about was Nurkic's heads up play a couple of seconds earlier that eventually served as the game-winner.\nLillard scored 34, Nurkic added 29 and 15 rebounds, including eight in the fourth quarter, and the Portland Trail Blazers rallied from a six-point deficit late in the fourth quarter to edge the Nets 127-125 on Friday.\n\"After the game he was telling me, `Man, my bad I missed the free throws, I did this and I this that',\" Lillard recalled. \"I stopped in the hallway, I said, `I don't care about none of that, the most important thing is you made the biggest play of the game'.\"\nPortland trailed 121-115 with 2:20 left after former Trail Blazers' guard Allen Crabbe floater. The Trail Blazers then scored the next eight points, capped by Shabbaz Nappier's three-point play with 55 seconds left. Brooklyn's Spencer Dinwiddie then evened it 123 with a putback layup after missing his own 15-foot pullup shot.\nLillard then freed himself off Dinwiddie's tight defense as Nurkic set a pick at the 3-point arc, diving to the basket as the Portland point guard served him the ball. DeMarre Carroll then slid in to help on the coverage, blocking Nurkic right under the basket. Caris Levert briefly had control of the ball before the Trail Blazers' center snatched it away and put it through, drawing a foul and capping a three-point play with 27 seconds left to put his team ahead for good, 126-123.\n\"I learned never quit,\" said Nurkic, who had eight rebounds and two of his four blocks in the final period. \"There's no lost possession. I see an opportunity to steal the ball and try to make a play. It (went) in.\"\nDespite Lillard's words of encouragement, he was still beating himself for making 5 of 10 free throws.\n\"I know I am a way better free throw (shooter) than I am showing,\" said Nurkic.\nCJ McCollum chipped in 26 for the Trail Blazers, who found themselves down by 11 in the first quarter in a post-Thanksgiving noon tip.\nThe Trail Blazers' defense held the Nets 0 for 5 from the field during their key fourth quarter 8-0 run, two days after a disappointing 20-point loss at Philadelphia.\n\"We made some good defensive stops in the last minute and a half and were able to convert in the other direction,\" Portland coach Terry Stotts said.\nDinwiddie had 23 for the Nets, who have lost three straight games -- the previous two to the defending champions, Golden State Warriors, and Cleveland Cavaliers.\nAfter cutting Portland's lead to 126-125 with 15.7 seconds, he had a chance to put the Nets ahead but missed a 3-pointer with 4:8 seconds left.\n\"I felt like it was a good look,\" Dinwiddie said. \"It bounced around the rim a couple of times but didn't go in.\"\nBrooklyn had six other players score in double-figures, including Rondae-Hollis Jefferson had 17. Sean Kilpatrick added 14 and Joe Harris scored 14.\nTIP-INS\nTrail Blazers: Reserve forward Al-Farouq Aminu remained out again with a sprained right ankle he suffered during a game Nov. 1. He's missed his last 10 games.\nNets: DeMarre Carroll, Tyler Zeller and Trevor Booker each had 10 points for the Nets.\nEARLY BIRD SPECIAL\nPortland's noon start at Brooklyn was the first of two on their regular-season schedule. They'll tip-off again at noon at Boston on Feb. 4 -- the second game of a three-game Eastern Conference road trip.\nSNAP OUT OF IT\nMcCollum made 10 of 19 shots to rebound from Wednesday's dreadful shooting performance at Philadelphia, in which he went 1 for 14 from the field, scoring five points.\nUP NEXT\nTrail Blazers: Continue their five-game road trip at Washington on Saturday.\nNets: Visit Memphis on Monday, the first of three games on the road."}
