{"game_id": "0021300653", "chunk_id": "0021300653_001", "order": 1, "role": "lead", "text": "PORTAND, Ore. -- LaMarcus Aldridge had 21 points in a showdown with Kevin Love that didn't live up to expectations, leading the Portland Trail Blazers to a 115-104 win over the Minnesota Timberwolves on Saturday night.\nIt was the Trail Blazers' 33rd win -- matching their total from all of last season.\nKevin Martin led the Timberwolves with 30 points, while Love finished with 15 points and 13 rebounds.\nAldridge hit a long jumper and drew a foul to give the Blazers a 100-88 lead midway through the fourth quarter. Damian Lillard's 3-pointer pushed the lead to 105-88 and Minnesota, coming off a back-to-back, could never catch up.\nLove, named Thursday as an Western Conference All-Star starter, went into the game against the Blazers averaging 25 points and 13 rebounds, but some Portland fans and his Blazers teammates felt Aldridge -- averaging 24.7 points and 11.6 rebounds -- deserved the starting nod because of his role in the team's success this season.\nAldridge scored a career-high 44 points and had 13 rebounds following the All-Star announcement in Portland's come-from-behind victory at home over Denver on Thursday night. Afterward he said he \"definitely\" thought he should have made it.\nThe 6-foot-11 seventh-year veteran can still make the team as a reserve -- as he has for the past two seasons -- when the coaches' selections are announced later this month.\nLove is a first-time All-Star starter after leap-frogging Houston Rockets center Dwight Howard in the final fan balloting.\n\"I think it's a little sweeter this way because I really didn't expect it,\" he said following the announcement.\nEarlier this season, Love had 29 points, 14 rebounds and nine assists in Minnesota's 120-109 home victory over the Blazers on Dec. 18.\nWhile fans were expecting Aldridge to come out and make a statement, teammate Nicolas Batum quickly tallied 11 points and five rebounds in the first quarter. Love had 10 points to lead Minnesota, which finished the first leading 29-27.\nThe Blazers then took off on a 16-4 run, capped by Thomas Robinson's fast-break dunk to take a 43-33 lead. Mo Williams had 10 points in the spurt.\nPortland led 65-57 at the break.\nThree straight dunks from Nikola Pekovic -- off feeds from Ricky Rubio -- tied the game at 73 midway through the third period. But the Timberwolves didn't pull ahead until Martin's 3-pointer made it 79-78 with 3:50 left in the period. The Blazers answered by finishing out the quarter on an 8-2 run to lead 87-81.\nPortland pushed the lead to 95-86 on consecutive jumpers from C.J. McCollum.\nThe Timberwolves went into the game at .500 and were coming off a 121-120 victory at Golden State on Friday night.\nGame notes\nLove is from Oregon and played for Lake Oswego High School just south of Portland. ... Rubio left Friday night's win over the Warriors with a sprained left ankle in the fourth quarter. He was questionable against the Blazers but started."}
