{"game_id": "0021700294", "chunk_id": "0021700294_001", "order": 1, "role": "lead", "text": "HOUSTON --  After rolling through the first quarter and building a sizeable lead over the Brooklyn Nets, James Harden said the Houston Rockets' momentum was interrupted by something they hadn't seen in a long time -- a zone defense."}
{"game_id": "0021700294", "chunk_id": "0021700294_002", "order": 2, "role": "body", "text": "In Houston's 117-103 win over Brooklyn, Harden scored 20 of his 37 points in the first quarter. When he took a break with 1:28 remaining in the first quarter, he was outscoring the Nets 20-17 by himself, not to mention four assists at that point. He was 5-for-5 from 3-point range in the first quarter and finished 8-for-13."}
{"game_id": "0021700294", "chunk_id": "0021700294_003", "order": 3, "role": "body", "text": "But when Brooklyn went to a zone defense for the first time all season, Harden said the Rockets had to make adjustments."}
{"game_id": "0021700294", "chunk_id": "0021700294_004", "order": 4, "role": "body", "text": "\"They went zone, and it kind of threw us for a loop,\" Harden said. \"We weren't making shots. That zone kind of messed us up a little bit.\""}
{"game_id": "0021700294", "chunk_id": "0021700294_005", "order": 5, "role": "body", "text": "Nets coach Kenny Atkinson likened Houston's hot start to a hurricane and said the Rockets hit them with a one-two punch, going up 43-26 after the first."}
{"game_id": "0021700294", "chunk_id": "0021700294_006", "order": 6, "role": "body", "text": "\"When they scored 43, it was like, `We've got to do something different, guys,\" Atkinson said. \"They still scored a lot of points, but it helped slow them down and at least made them pause and made them think a little.\""}
{"game_id": "0021700294", "chunk_id": "0021700294_007", "order": 7, "role": "body", "text": "Harden added 10 rebounds and eight assists to guide the Rockets to their fifth straight win. Despite the string of blowout victories, Harden said it's easy to stay self-critical and focus on improving, while Rockets head coach Mike D'Antoni said he's staying on top of his team."}
{"game_id": "0021700294", "chunk_id": "0021700294_008", "order": 8, "role": "body", "text": "\"The mentality of, 'I'm going to play well all the time,' that's utopia, that's not possible,\" D'Antoni said. \"So I just cry around and moan around for a while, but I'll be all right. I'll get over it.\""}
{"game_id": "0021700294", "chunk_id": "0021700294_009", "order": 9, "role": "body", "text": "Clint Capela added 20 points for Houston, and Chris Paul had a season-high 14 assists on \"Chris Paul Bobblehead Night\" at the Toyota Center."}
{"game_id": "0021700294", "chunk_id": "0021700294_010", "order": 10, "role": "body", "text": "\"We've got to keep getting better, especially, defensively,\" Paul said. \"We can't just always rely on our offense. But we'll take the wins. Every game is different, but right now, we're just trying to pile up the wins.\""}
{"game_id": "0021700294", "chunk_id": "0021700294_011", "order": 11, "role": "body", "text": "For the Nets, Isaiah Whitehead led scorers with 24 points, matching his career high. The Brooklyn native, who was called up from the G-League on Monday morning, shot 10 of 16 from the field."}
{"game_id": "0021700294", "chunk_id": "0021700294_012", "order": 12, "role": "body", "text": "\"I was just staying ready to take opportunities and doing well with them,\" Whitehead said. \"I'll stay ready throughout the year, and hopefully, I'll get more chances.\""}
{"game_id": "0021700294", "chunk_id": "0021700294_013", "order": 13, "role": "body", "text": "Spencer Dinwiddie had 14 points, Caris LeVert had 13 and Sean Kilpatrick added 12. Coming off of a 98-88 win in Memphis on Sunday night, Brooklyn has lost four of its last five."}
{"game_id": "0021700294", "chunk_id": "0021700294_014", "order": 14, "role": "body", "text": "Houston led 66-55 at halftime and entered the fourth quarter with a 16-point lead."}
{"game_id": "0021700294", "chunk_id": "0021700294_016", "order": 16, "role": "body", "text": "Nets: Forwards DeMarre Carroll (upper respiratory condition) and Allen Crabbe (lower back soreness) were both out. ... Quincy Acy had seven points in 20 minutes after missing the previous two games by coach's decision."}
{"game_id": "0021700294", "chunk_id": "0021700294_017", "order": 17, "role": "body", "text": "Rockets: Houston was without two of its big men -- veteran center Nene was inactive with a strained right shoulder, while rookie center Zhou Qi had a sore left calf. . The Rockets have won 10 of their last 11 meetings at home against Brooklyn."}
{"game_id": "0021700294", "chunk_id": "0021700294_019", "order": 19, "role": "body", "text": "Houston Astros pitcher Lance McCullers, who won Game 3 of the 2017 World Series on his way to earning a ring, was the celebrity guest as part of Houston's \"First Shot\" promotion featuring a local celebrity shooting a pregame free throw for a chance to earn a $5,000 donation from the Rockets to charity. Despite strong form, McCullers' shot rattled in and out, still earning a $1,000 donation to charity."}
{"game_id": "0021700294", "chunk_id": "0021700294_021", "order": 21, "role": "body", "text": "On trying out a zone defense for the first time this season, Atkinson said it was an idea he's mulled before but never followed through. \"I've always thought about it, but I've never had the guts to try it.\""}
{"game_id": "0021700294", "chunk_id": "0021700294_023", "order": 23, "role": "body", "text": "The Rockets hit 20 3-pointers against Brooklyn, marking their fifth straight game of recording 18 or more 3-pointers made. No other team in NBA history has such a streak that lasted longer than two games. Houston has shot 40 percent from 3-point range in four of its past five games. The Rockets are 26-1 when shooting 40 percent or better from beyond the arc under D'Antoni."}
{"game_id": "0021700294", "chunk_id": "0021700294_025", "order": 25, "role": "body", "text": "Paul didn't have a turnover, marking the eighth time in his career he has recorded 14 or more assists without a turnover, all coming since the start of the 2008-09 season. No other player has more than five games of doing so."}
{"game_id": "0021700294", "chunk_id": "0021700294_027", "order": 27, "role": "body", "text": "Nets: Visit Dallas on Wednesday night."}
{"game_id": "0021700294", "chunk_id": "0021700294_028", "order": 28, "role": "closing", "text": "Rockets: Host Indiana on Wednesday night."}
