{"game_id": "0021700989", "chunk_id": "0021700989_001", "order": 1, "role": "lead", "text": "DALLAS --  If the Dallas Mavericks are tanking for a high draft pick, as owner Mark Cuban suggested in an interview that cost him $600,000, they've got some work to do to catch the Memphis Grizzlies."}
{"game_id": "0021700989", "chunk_id": "0021700989_002", "order": 2, "role": "body", "text": "And they lost more ground Saturday night."}
{"game_id": "0021700989", "chunk_id": "0021700989_003", "order": 3, "role": "body", "text": "Harrison Barnes scored 25 points and the Mavericks beat Memphis 114-80, extending the Grizzlies' losing streak to 17 games."}
{"game_id": "0021700989", "chunk_id": "0021700989_004", "order": 4, "role": "body", "text": "The Grizzlies (18-48), who have the longest losing streak in the NBA this season and the league's worst record, sat center Marc Gasol for rest, trailed by 26 points after shooting 26 percent in the first half and didn't lead after the 9:20 mark of the first quarter."}
{"game_id": "0021700989", "chunk_id": "0021700989_005", "order": 5, "role": "body", "text": "The only longer losing streaks in franchise history were skids of 23 and 19 games in the expansion season of 1995-96 in Vancouver. It's the longest losing streak in Memphis pro basketball history."}
{"game_id": "0021700989", "chunk_id": "0021700989_006", "order": 6, "role": "body", "text": "\"It's in our mind every game,\" said Dillon Brooks, who led Memphis with 17 points. \"We're trying to figure out what's working and try to keep progressing through that, but not a lot is clicking right now. I guess we've just got to clear our heads and go into the next game energetic and act like we love the game.\""}
{"game_id": "0021700989", "chunk_id": "0021700989_007", "order": 7, "role": "body", "text": "The Mavericks (21-45), also among the NBA's worst teams, allowed their fewest points in any half this season while building a 56-30 halftime lead on the way to their largest margin of victory this season. Barnes had 14 points in the first half, 10 of them on 11 free throws."}
{"game_id": "0021700989", "chunk_id": "0021700989_008", "order": 8, "role": "body", "text": "J.J. Barea scored 20 for Dallas, and Doug McDermott also had 20 for his highest total since coming to the Mavericks at the trading deadline."}
{"game_id": "0021700989", "chunk_id": "0021700989_009", "order": 9, "role": "body", "text": "\"I like him,\" coach Rick Carlisle said of McDermott. \"If you get him open and running around, he's going to make shots.\""}
{"game_id": "0021700989", "chunk_id": "0021700989_010", "order": 10, "role": "body", "text": "Memphis' JaMychal Green had his 12th double-double with 14 points and 10 rebounds. Dwight Powell of Dallas had his fourth with 15 points and 10 boards."}
{"game_id": "0021700989", "chunk_id": "0021700989_012", "order": 12, "role": "body", "text": "Grizzlies: F Chandler Parsons still gets booed every time he touches the ball in Dallas. He took a maximum offer from the Grizzlies in the summer of 2016 coming off his second knee injury in as many seasons with the Mavericks, who hoped to sign him for less. Parsons scored nine points in 15 minutes. ... The road losing streak is at 14 games. Memphis hasn't won away from home in 2018."}
{"game_id": "0021700989", "chunk_id": "0021700989_013", "order": 13, "role": "body", "text": "Mavericks: F Dorian Finney-Smith played for the first time since Nov. 12 and had seven points in 18 minutes. He missed 51 straight games with left knee quadriceps tendinitis and has missed 57 games overall. ... C Salah Mejri limped to the locker room in the first quarter after the leg got caught under Memphis C Deyonta Davis as both went to the floor. He didn't return, with the injury listed as a right hamstring strain."}
{"game_id": "0021700989", "chunk_id": "0021700989_015", "order": 15, "role": "body", "text": "Along with Gasol, Nerlens Noel of Dallas was out for rest. The Mavericks also sat point guard Dennis Smith Jr. because of a left knee issue that also sidelined him the second and third games of his rookie season."}
{"game_id": "0021700989", "chunk_id": "0021700989_016", "order": 16, "role": "body", "text": "It's the same knee Smith had surgically repaired after a ligament tear in high school. He accelerated the rehab so he could play his only season at North Carolina State. Carlisle said he anticipated Smith would play Sunday against Houston."}
{"game_id": "0021700989", "chunk_id": "0021700989_018", "order": 18, "role": "body", "text": "Gasol has expressed frustration at times this season, particularly when he hasn't played in the fourth quarter. When it happened recently at Chicago, he left without talking to reporters."}
{"game_id": "0021700989", "chunk_id": "0021700989_019", "order": 19, "role": "body", "text": "\"Having not experienced something like this before, it's difficult,\" coach J.B. Bickerstaff said. \"He's beginning to understand that he is a mentor to these younger guys now and he's helping them. He's teaching them. He's leading them. He's trying to show them how to play the game the right way.\""}
{"game_id": "0021700989", "chunk_id": "0021700989_021", "order": 21, "role": "body", "text": "Dirk Nowitzki, the 39-year-old in his 20th season, all with the Mavericks, was 1 of 9 and missed all five 3-pointers, matching his season low with two points. Barea couldn't pass up a chance for a dig on the 13-time All-Star. \"Everybody but Dirk, I think they did their job tonight,\" Barea said."}
{"game_id": "0021700989", "chunk_id": "0021700989_023", "order": 23, "role": "body", "text": "Grizzlies: Open three-game homestand Monday against Milwaukee."}
{"game_id": "0021700989", "chunk_id": "0021700989_024", "order": 24, "role": "body", "text": "Mavericks: Finish four-game homestand and back-to-back against Houston on Sunday."}
{"game_id": "0021700989", "chunk_id": "0021700989_026", "order": 26, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
