{"game_id": "0021300049", "chunk_id": "0021300049_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Jerryd Bayless finally found his range, Memphis clamped down on defense and the Grizzlies used the combination for a victory."}
{"game_id": "0021300049", "chunk_id": "0021300049_002", "order": 2, "role": "body", "text": "Bayless keyed a fourth-quarter rally, scoring all of his 15 points in the period, to lead Memphis to a 95-88 victory over the Boston Celtics on Monday night."}
{"game_id": "0021300049", "chunk_id": "0021300049_003", "order": 3, "role": "body", "text": "Bayless was 6 of 7 in the quarter as Memphis erased a six-point Boston lead with just under 9 minutes to play."}
{"game_id": "0021300049", "chunk_id": "0021300049_004", "order": 4, "role": "body", "text": "\"That's what Jerryd does. He's a volume scorer,\" said Memphis guard Tony Allen, who had four steals. \"He can fill it up. . That was big for us.\""}
{"game_id": "0021300049", "chunk_id": "0021300049_005", "order": 5, "role": "body", "text": "Zach Randolph and Mike Conley also had 15 for Memphis, Conley handing out eight assists. Marc Gasol finished with 14 points and grabbed eight rebounds."}
{"game_id": "0021300049", "chunk_id": "0021300049_006", "order": 6, "role": "body", "text": "Jeff Green led the Celtics with 22 points, while Jared Sullinger scored 16, going 2 of 3 from outside the arc. Avery Bradley scored 14, and Jordan Crawford finished with 12."}
{"game_id": "0021300049", "chunk_id": "0021300049_007", "order": 7, "role": "body", "text": "The Celtics fell to 0-4 under rookie coach Brad Stevens, the first time Boston has lost its first four games since the 1969-70 season."}
{"game_id": "0021300049", "chunk_id": "0021300049_008", "order": 8, "role": "body", "text": "\"I think you just understand where we are and where we have to go,\" Stevens said. \"You do your best to focus on what's next and not pay too much attention to anything else.\""}
{"game_id": "0021300049", "chunk_id": "0021300049_009", "order": 9, "role": "body", "text": "The Celtics, who are the worst team in the league at committing turnovers, matched their average with 21, while Memphis wasn't much better with 19."}
{"game_id": "0021300049", "chunk_id": "0021300049_010", "order": 10, "role": "body", "text": "\"Our biggest thing right now is turning the ball over, there's no question about it,\" Stevens said. \"If we don't do that, we're going to have a better chance of winning.\""}
{"game_id": "0021300049", "chunk_id": "0021300049_011", "order": 11, "role": "body", "text": "Memphis held the Celtics to 33 percent shooting in the final quarter, while Memphis was 10 of 15, and it was all Bayless. Only two other Memphis players took more than one shot in the fourth -- Allen and Jon Leuer with two each."}
{"game_id": "0021300049", "chunk_id": "0021300049_012", "order": 12, "role": "body", "text": "\"I kept looking at my staff saying: `When should I put Mike Conley in,\" Memphis coach Dave Joerger said. \"And then Jerryd Bayless kept making buckets, and I would be silly if I took Jerryd Bayless out of the game.\""}
{"game_id": "0021300049", "chunk_id": "0021300049_013", "order": 13, "role": "body", "text": "Stevens seemed to have a chance at his first NBA victory until Bayless got untracked in the fourth quarter, mostly from around the top of the key."}
{"game_id": "0021300049", "chunk_id": "0021300049_014", "order": 14, "role": "body", "text": "\"I (stunk) the first half honestly.\" Bayless said. \"I was bad. Missing layups and doing things I normally don't do. . It was bad. But I stayed positive, knowing we had to change.\""}
{"game_id": "0021300049", "chunk_id": "0021300049_015", "order": 15, "role": "body", "text": "In a matchup featuring teams with two of the highest turnover rates in the league, both reached double figures before the break, the Celtics with 12, Memphis with 10."}
{"game_id": "0021300049", "chunk_id": "0021300049_016", "order": 16, "role": "body", "text": "Memphis, which trailed 50-46 at the break, opened the second half with a 12-4 burst. Gasol, who missed both his shots in the first half, had 10 early in the third to help the rally that contributed to a 66-57 Memphis lead. It didn't last as Memphis started misfiring, leading to 15 unanswered points for Boston, capped by Sullinger's 3-pointer."}
{"game_id": "0021300049", "chunk_id": "0021300049_017", "order": 17, "role": "body", "text": "That gave the Celtics a 72-66 lead heading into the fourth."}
{"game_id": "0021300049", "chunk_id": "0021300049_018", "order": 18, "role": "body", "text": "Bayless, who was scoreless and had missed all four of his shots in the first three quarters, hit his first six shots in the frame. The comeback was complete when he hit a 3-pointer with 4:19 left. The Celtics never led again."}
{"game_id": "0021300049", "chunk_id": "0021300049_019", "order": 19, "role": "body", "text": "\"I'm not really thinking about stats during the game,\" Bayless said. \"I'm just trying to worry about what we need to do to figure out this win."}
{"game_id": "0021300049", "chunk_id": "0021300049_020", "order": 20, "role": "body", "text": "\"Anybody can have a good night like tonight. Luckily, it was my night.\""}
{"game_id": "0021300049", "chunk_id": "0021300049_021", "order": 21, "role": "closing", "text": "Game notes The best Grizzlies scoring performance against the Celtics is 41 by Bryant Reeves in 1998. .The game featured two of the youngest coaches in the league. Boston's Stevens is youngest at 37; Memphis' Dave Joerger is third-youngest at 39. Jacque Vaughn of Orlando at 38 is between them. .The Celtics, who lost 87-77 at Detroit on Sunday night, were playing their first back-to-back of the season. Boston plays road games on consecutive nights 10 times this season. .The 88 points by the Celtics marked the first time this season Memphis has held an opponent under 100 points."}
