{"game_id": "0021700484", "chunk_id": "0021700484_001", "order": 1, "role": "lead", "text": "ATLANTA --  Dennis Schroder scored every which way Saturday night."}
{"game_id": "0021700484", "chunk_id": "0021700484_002", "order": 2, "role": "body", "text": "The point guard equaled his career high with 33 points, including 27 in the second half, to help the Atlanta Hawks beat the Dallas Mavericks 112-107 in a matchup of last-place teams."}
{"game_id": "0021700484", "chunk_id": "0021700484_003", "order": 3, "role": "body", "text": "After missing Friday night's loss at Oklahoma City with a sprained ankle, Schroder hit a tiebreaking 3-pointer with 1:21 left to put Atlanta ahead 110-107."}
{"game_id": "0021700484", "chunk_id": "0021700484_004", "order": 4, "role": "body", "text": "Schroder shot 10 of 14 in the second half, 4 for 5 on 3-pointers, and Hawks coach Mike Budenholzer was convinced the young German motivated himself by scoring his team's first seven points in the third quarter to tie it at 55."}
{"game_id": "0021700484", "chunk_id": "0021700484_005", "order": 5, "role": "body", "text": "It was a particularly rewarding night for Schroder, who drove to the basket repeatedly as Atlanta topped the Mavericks and fellow German Dirk Nowitzki for the ninth straight time."}
{"game_id": "0021700484", "chunk_id": "0021700484_006", "order": 6, "role": "body", "text": "\"Yeah, that (early) layup might be the reason that I started going, and I was just aggressive and attacked Nowitzki and their big guards,\" Schroder said. \"Nowitzki is kind of slow now, getting older, and that works for me to be aggressive. If help comes, just look (to pass) in the corners.\""}
{"game_id": "0021700484", "chunk_id": "0021700484_007", "order": 7, "role": "body", "text": "Ersan Ilyasova added 19 points and seven rebounds for the Hawks (8-25), who got 13 points off the bench from rookie John Collins and won for just the second time in eight games."}
{"game_id": "0021700484", "chunk_id": "0021700484_008", "order": 8, "role": "body", "text": "Harrison Barnes led the Mavericks (9-25) with 22 points. Nowitzki scored 18, and J.J. Barea had 15 points and 12 assists off the bench as Dallas lost for the eighth time in 10 games."}
{"game_id": "0021700484", "chunk_id": "0021700484_009", "order": 9, "role": "body", "text": "Atlanta, which opened the season with a 117-111 victory in Dallas, has swept the season series from the Mavericks in each of the last four years."}
{"game_id": "0021700484", "chunk_id": "0021700484_010", "order": 10, "role": "body", "text": "\"We didn't have an answer for Schroder,\" Dallas coach Rick Carlisle said. \"He beat us on drives. He beat us on pick-and-rolls. He beat us on traps. He had a great game, particularly in the second half.\""}
{"game_id": "0021700484", "chunk_id": "0021700484_011", "order": 11, "role": "body", "text": "The Mavericks led 53-48 at halftime before Schroder warmed up in the third quarter with 12 points to help Atlanta take a 10-point lead."}
{"game_id": "0021700484", "chunk_id": "0021700484_012", "order": 12, "role": "body", "text": "He scored 15 more in the fourth, making three 3-pointers."}
{"game_id": "0021700484", "chunk_id": "0021700484_013", "order": 13, "role": "body", "text": "Dallas shot 50.6 percent and rang up 31 assists, but it wasn't enough to overcome Schroder, who tied his career highs for field goals (13 of 22) and 3-pointers (4 of 8). Atlanta is 4-1 when he scores 30 or more points."}
{"game_id": "0021700484", "chunk_id": "0021700484_014", "order": 14, "role": "body", "text": "\"We shot the ball pretty well. We were moving the ball pretty well,\" Nowitzki said. \"Schroder was fantastic tonight. ... Schroder came out in the third quarter and really put it on us. It was incredible. He made that run almost by himself.\""}
{"game_id": "0021700484", "chunk_id": "0021700484_015", "order": 15, "role": "body", "text": "Dallas countered several times and last tied the game on a 3-pointer by Barea with 2:28 remaining. The Mavericks scored just two points the rest of the way."}
{"game_id": "0021700484", "chunk_id": "0021700484_016", "order": 16, "role": "body", "text": "The Hawks don't play again until Wednesday, when they will try to win back-to-back games for the first time this season."}
{"game_id": "0021700484", "chunk_id": "0021700484_018", "order": 18, "role": "body", "text": "Mavericks: Wesley Matthews, who leads the team in 3-pointers with 79, didn't hit one until there was 7:28 left in the third quarter. Dallas was just 9 for 33 from beyond the arc after making 17 of 35 in Friday's 113-101 loss at Miami. Matthews went 1 for 7. ... Dallas is 1-5 in the second game of back-to-backs."}
{"game_id": "0021700484", "chunk_id": "0021700484_019", "order": 19, "role": "body", "text": "Hawks: Collins went 6 for 9 and has shot at least 50 percent from the field in 14 consecutive games, stretching his franchise rookie record beyond Stacey Augmon's 11 straight games in 1991-92. The first-round draft pick from Wake Forest scored 10 points in the first half. ... One night after scoring a season-high 27 points in his first start of the season, Marco Belinelli was scoreless in the first half off the bench and finished with two points. ... Malcolm Delaney also set a season high Friday with 20 points. He had seven on Saturday. ... Atlanta is 1-7 in the second game of back-to-backs."}
{"game_id": "0021700484", "chunk_id": "0021700484_021", "order": 21, "role": "body", "text": "The Mavericks look like a team with enough talent to be better than 9-25, and they seem to know it. Their defense is a problem, however, and that explained much of Saturday's result. The Hawks shot 56.8 percent and went 10 of 24 from 3-point range."}
{"game_id": "0021700484", "chunk_id": "0021700484_022", "order": 22, "role": "body", "text": "\"This season has been difficult,\" Barnes said. \"Coaches, players, media -- everyone tries to figure out a reason for that. ... Playing these nights where we have 30 assists, or offensively we get it going, or Dirk has a good game going ... it's difficult not to capitalize on that.\""}
{"game_id": "0021700484", "chunk_id": "0021700484_024", "order": 24, "role": "body", "text": "Mavericks: Host the Toronto Raptors on Tuesday night."}
{"game_id": "0021700484", "chunk_id": "0021700484_025", "order": 25, "role": "body", "text": "Hawks: Host the Washington Wizards on Wednesday night."}
{"game_id": "0021700484", "chunk_id": "0021700484_027", "order": 27, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
