{"game_id": "0021700038", "chunk_id": "0021700038_001", "order": 1, "role": "lead", "text": "NEW YORK --  The Brooklyn Nets thought their rebuilding phase was right on track when they signed Allen Crabbe to an offer sheet in the summer of 2016, only to see Portland step in and match it."}
{"game_id": "0021700038", "chunk_id": "0021700038_002", "order": 2, "role": "body", "text": "After finally being able to acquire him in a trade with the Trail Blazers in July, Nets coach Kenny Atkinson is starting to see some of the intangibles that Crabbe's brings."}
{"game_id": "0021700038", "chunk_id": "0021700038_003", "order": 3, "role": "body", "text": "The gamble, although delayed by a year, might have been worth it."}
{"game_id": "0021700038", "chunk_id": "0021700038_004", "order": 4, "role": "body", "text": "Crabbe, who has been on a minutes restriction because of preseason injuries, came up big Sunday, scoring 20 points -- 10 in the fourth quarter -- to help the Nets beat the Atlanta Hawks 116-104."}
{"game_id": "0021700038", "chunk_id": "0021700038_005", "order": 5, "role": "body", "text": "Crabbe had started the second game of the season Friday night with Jeremy Lin out for the season with a knee injury. Before the matinee meeting with Atlanta, the newcomer told his coach he was willing to come off the bench, with Caris LeVert getting the nod at shooting guard."}
{"game_id": "0021700038", "chunk_id": "0021700038_006", "order": 6, "role": "body", "text": "\"He is the ultimate team guy, ultimate professional,\" Atkinson said. \"He said, `I'll come off the bench. That's better for my rhythm.' Everybody wants to start. To me it shows what kind of guy he is.\""}
{"game_id": "0021700038", "chunk_id": "0021700038_007", "order": 7, "role": "body", "text": "DeMarre Carroll  added 17, and Caris LeVert and D'Angelo Russell each had 16 points to help the Nets improve to 2-1 with their second straight victory."}
{"game_id": "0021700038", "chunk_id": "0021700038_008", "order": 8, "role": "body", "text": "Marco Belinelli had 19 points for Atlanta. The Hawks have lost two in a row to drop to 1-2."}
{"game_id": "0021700038", "chunk_id": "0021700038_009", "order": 9, "role": "body", "text": "Atlanta point guard Dennis Schroeder, who scored 17, went down with a left ankle injury with 3:37 left and had to be helped off the court. X-rays were taken, but the results weren't available."}
{"game_id": "0021700038", "chunk_id": "0021700038_010", "order": 10, "role": "body", "text": "Hawks coach Mike Budenholzer was already thinking of who to pencil if his point guard is out for an extended time. He said Malcom Delaney and Josh Magette could see time there with Kent Bazemore stepping in as well."}
{"game_id": "0021700038", "chunk_id": "0021700038_011", "order": 11, "role": "body", "text": "Brooklyn found a way to win once again without Lin, holding off the Hawks after leading by 16 points late in the third."}
{"game_id": "0021700038", "chunk_id": "0021700038_012", "order": 12, "role": "body", "text": "The Nets led 98-87 with 7:47 go after a pair of free throws from LeVert. Atlanta then went on a 12-1 run, tying it 99 with on Belinelli's 3-pointer with 5:19 left."}
{"game_id": "0021700038", "chunk_id": "0021700038_013", "order": 13, "role": "body", "text": "\"I think the last quarter we played well, everybody was aggressive, everybody was ready to help on defense,\" Belinelli said."}
{"game_id": "0021700038", "chunk_id": "0021700038_014", "order": 14, "role": "body", "text": "After a Brooklyn timeout with 4:51 remaining, Carroll's block on Schroder's layup attempt ignited an 8-0 run that put the game out of reach for the Hawks."}
{"game_id": "0021700038", "chunk_id": "0021700038_015", "order": 15, "role": "body", "text": "Russell, who had eight assists, fed Crabbe for a 3-pointer that made it 102-99. Following a free throw by Carroll and back-to-back 3-point misses by the Hawks, Russell whipped a pass across to the 3-point line near the Brooklyn bench as Crabbe unleashed another one, making it 106-99 with 3:47 to go."}
{"game_id": "0021700038", "chunk_id": "0021700038_016", "order": 16, "role": "body", "text": "\"I told myself I just wanted to be a little more aggressive within the offense,\" Crabbe. \"They're giving me the green light to shoot the ball, so why not. It's not going to hurt me to get them up.\""}
{"game_id": "0021700038", "chunk_id": "0021700038_017", "order": 17, "role": "body", "text": "He made 7 of 12 shots in 25 minutes."}
{"game_id": "0021700038", "chunk_id": "0021700038_018", "order": 18, "role": "body", "text": "After Carroll's free throw increased the lead 107-99, Ersan Ilyasova's layup cut it down to 107-101, the closest the Hawks would get."}
{"game_id": "0021700038", "chunk_id": "0021700038_020", "order": 20, "role": "body", "text": "Hawks: The Hawks are opening with a five-game trip because of renovations at Phillips Arena."}
{"game_id": "0021700038", "chunk_id": "0021700038_021", "order": 21, "role": "body", "text": "Nets: Rondae Hollis-Jefferson limped off court with 8:06 in first quarter due to an injury and returned with 4:14 left in the second. He quickly made a nifty layup, converting a three-point play. ... Brooklyn was held to 19 points in the first quarter after averaging 29.5 over their first two games. ... Rookie Jarrett Allen had a career-high four blocks off the bench in 14 minutes."}
{"game_id": "0021700038", "chunk_id": "0021700038_023", "order": 23, "role": "body", "text": "Hawks: At Miami on Monday night."}
{"game_id": "0021700038", "chunk_id": "0021700038_024", "order": 24, "role": "body", "text": "Nets: At Brooklyn on Tuesday night."}
{"game_id": "0021700038", "chunk_id": "0021700038_026", "order": 26, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
