{"game_id": "0021200225", "chunk_id": "0021200225_001", "order": 1, "role": "lead", "text": "BOSTON -- Two young fans held up a sign that said, \"We Miss RONDO.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_002", "order": 2, "role": "body", "text": "The Celtics looked just fine without him."}
{"game_id": "0021200225", "chunk_id": "0021200225_003", "order": 3, "role": "body", "text": "While star point guard Rajon Rondo began a two-game suspension, Boston got 19 points from Jeff Green and 17 from Jason Terry while cruising to a 96-78 victory over the Portland Trail Blazers on Friday night."}
{"game_id": "0021200225", "chunk_id": "0021200225_004", "order": 4, "role": "body", "text": "Rondo's \"our leader, so it's tough when he's not here,\" Green said. \"So everybody as a group has to pull together as a team and try and take his place.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_005", "order": 5, "role": "body", "text": "Rondo was suspended for his role in a scuffle during a 95-83 loss to the Brooklyn Nets on Wednesday night. Afterward, Celtics coach Doc Rivers called his team \"soft.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_006", "order": 6, "role": "body", "text": "That motivated Courtney Lee, who started in Rondo's place and finished with 10 points, seven rebounds, five assists and three steals."}
{"game_id": "0021200225", "chunk_id": "0021200225_007", "order": 7, "role": "body", "text": "\"Nobody wants to be called soft,\" Lee said. \"I took that personal because I know that I'm far from being soft and I think our team took it personal, too.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_008", "order": 8, "role": "body", "text": "The Celtics never trailed. They carried a 56-33 advantage into the break and took their biggest lead on a 22-foot jumper by Kevin Garnett that made it 65-38 with 8:26 left in the third quarter."}
{"game_id": "0021200225", "chunk_id": "0021200225_009", "order": 9, "role": "body", "text": "The Trail Blazers lost their fourth straight game and had just three scorers in double figures -- LaMarcus Aldridge with 23 points and J.J. Hickson and Meyers Leonard with 11 each."}
{"game_id": "0021200225", "chunk_id": "0021200225_010", "order": 10, "role": "body", "text": "\"We came out passive and they came out really aggressive,\" Aldridge said. \"After the last game (with) everything they had going on, they had to set the tone early and they did.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_011", "order": 11, "role": "body", "text": "The Celtics led 25-18 after one quarter and pulled away in the second when they held the Trail Blazers to just two field goals, both by Aldridge, and outscored them 31-15."}
{"game_id": "0021200225", "chunk_id": "0021200225_012", "order": 12, "role": "body", "text": "\"We went into the third quarter, we played a little better, made some adjustments,\" Portland coach Terry Stotts said, \"but we were on our heels from the beginning.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_013", "order": 13, "role": "body", "text": "Aldridge provided more than half of the Trail Blazers' points in the first half, scoring 17 while collecting five of their seven field goals. Hickson and Damian Lillard scored the others."}
{"game_id": "0021200225", "chunk_id": "0021200225_014", "order": 14, "role": "body", "text": "\"When we come out and set the tone defensively, like we did tonight, that's the type of team we are,\" said Paul Pierce, who had 12 points, eight rebounds and five assists. \"That's the Celtics that I know.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_015", "order": 15, "role": "body", "text": "The Trail Blazers cut the lead to 58-38 before the Celtics scored the next seven on two free throws by Lee, a 3-pointer by Terry and Garnett's jumper."}
{"game_id": "0021200225", "chunk_id": "0021200225_016", "order": 16, "role": "body", "text": "Boston led 75-59 heading into the fourth quarter and was never threatened in the final period."}
{"game_id": "0021200225", "chunk_id": "0021200225_017", "order": 17, "role": "body", "text": "\"We just basically played through\" the big men, Rivers said. \"We took all the pressure off the guards. All they had to do is bring (the ball) up and then throw it to Kevin at the elbow or Jared (Sullinger) at the elbow and then cut and move. That way there's no dribbling.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_018", "order": 18, "role": "body", "text": "Rondo leads the NBA with 12.9 assists per game but was suspended after shoving Brooklyn's Kris Humphries. He'll also miss Saturday night's game at the Milwaukee Bucks."}
{"game_id": "0021200225", "chunk_id": "0021200225_019", "order": 19, "role": "body", "text": "\"We all know Rondo's capabilities,\" Lee said. \"He's a great playmaker. He's going to rack up assists. Today we just came out there and played together.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_020", "order": 20, "role": "body", "text": "Without Rondo, the Celtics scored seven of the first eight points and led by seven after one quarter, making 57.1 percent of their shots to 31.3 percent for the Trail Blazers."}
{"game_id": "0021200225", "chunk_id": "0021200225_021", "order": 21, "role": "body", "text": "It got worse for Portland in the second quarter when Boston scored the first nine points, the first two on free throws by Leandro Barbosa and the last seven by fellow reserve Green."}
{"game_id": "0021200225", "chunk_id": "0021200225_022", "order": 22, "role": "body", "text": "\"Of course, we're frustrated,\" said Portland's Nicolas Batum, who missed 9-of-11 shots. \"The start of the season we played great, so we have to show some pride and (not) play ridiculous like we did tonight.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_023", "order": 23, "role": "body", "text": "The loss came two days after the Trail Blazers became the first team to fall to Washington, which had lost its first 12 games. The Wizards won 84-82."}
{"game_id": "0021200225", "chunk_id": "0021200225_024", "order": 24, "role": "body", "text": "Before the game, Rivers provided a glimpse of his strategy with Rondo being suspended."}
{"game_id": "0021200225", "chunk_id": "0021200225_025", "order": 25, "role": "body", "text": "\"Everyone's going to be the point guard,\" he said. \"I told our guys the entire team has to be ready for ballhandling duties. It left us in a pretty tough spot, but we should be able to play through this and win games still.\""}
{"game_id": "0021200225", "chunk_id": "0021200225_026", "order": 26, "role": "closing", "text": "Game notes The Trail Blazers had just 12 assists. ... Boston's reserves outscored Portland's 41-22. ... Kris Joseph, recalled from Maine of the NBA Development League, played 4 minutes, 55 seconds and scored two points for Boston. ... Portland has three more games left in a season-high, seven-game road trip: Cleveland, Charlotte and Indiana."}
