{"game_id": "0021700931", "chunk_id": "0021700931_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  The Denver Nuggets acknowledged their victory wasn't a masterpiece -- with 24 turnovers and all -- but they were sharp enough to snap a losing streak and hold their playoff spot."}
{"game_id": "0021700931", "chunk_id": "0021700931_002", "order": 2, "role": "body", "text": "Gary Harris scored 26 points, hitting a key basket with just under a minute left, and Denver weathered a fourth-quarter rally to beat the Memphis Grizzlies 108-102 on Friday night."}
{"game_id": "0021700931", "chunk_id": "0021700931_003", "order": 3, "role": "body", "text": "\"It wasn't pretty, but we got the win, and that's all that matters,\" Harris said."}
{"game_id": "0021700931", "chunk_id": "0021700931_004", "order": 4, "role": "body", "text": "The Nuggets held on to the Western Conference's last playoff spot and snapped a two-game losing streak. They improved to 10-19 on the road."}
{"game_id": "0021700931", "chunk_id": "0021700931_005", "order": 5, "role": "body", "text": "\"It was real big,\" said forward Will Barton, who finished with 24 points. \"Road win, which we've been struggling at all year, coming off two L's in a row. With the push we're trying to make, this was vital.\""}
{"game_id": "0021700931", "chunk_id": "0021700931_006", "order": 6, "role": "body", "text": "Harris was 11 of 18 from the field to help the Nuggets shoot 55 percent in the game. Paul Millsap added 15 points as Denver sent the Grizzlies to their 12th straight loss, the longest losing streak in the NBA this season, leaving Memphis with the lowest winning percentage in the league at 29.5 percent (18-43)."}
{"game_id": "0021700931", "chunk_id": "0021700931_007", "order": 7, "role": "body", "text": "\"You can't say enough good things about the way these guys continue to battle in tough circumstances,\" Memphis interim coach J.B. Bickerstaff said. \"Results, we come up short at the end, obviously. But, I couldn't be more proud of the way these guys fought.\""}
{"game_id": "0021700931", "chunk_id": "0021700931_008", "order": 8, "role": "body", "text": "Marc Gasol led Memphis with 22 points and nine rebounds, Jarell Martin had 16 points, and Dillon Brooks 13."}
{"game_id": "0021700931", "chunk_id": "0021700931_009", "order": 9, "role": "body", "text": "Memphis trailed by 15 early in the fourth, but clicked off a 16-6 run to significantly cut into the Denver lead. Eventually, Memphis would get to within 104-102 with a pair of free throws from Gasol with 1:38 left."}
{"game_id": "0021700931", "chunk_id": "0021700931_010", "order": 10, "role": "body", "text": "But Harris nailed a 20-foot jumper with just under a minute left as the Nuggets scored the game's final four points."}
{"game_id": "0021700931", "chunk_id": "0021700931_011", "order": 11, "role": "body", "text": "\"It's a simple game. You either miss or make it, right?,\" Harris said of the shot that stopped Memphis' hopes for a fourth-quarter comeback."}
{"game_id": "0021700931", "chunk_id": "0021700931_012", "order": 12, "role": "body", "text": "Millsap added: \"That was big for us to come out and not fold under pressure. (The Grizzlies) had an opportunity to tie the game up a couple of times, and we were able to get stops.\""}
{"game_id": "0021700931", "chunk_id": "0021700931_014", "order": 14, "role": "body", "text": "Nuggets:The Nuggets failed to reach 114 points. Denver had scored at least 114 in nine of its previous 10 games. ... C Nikola Jokic, who had recorded a triple-double in three of the previous five games, managed nine points, nine rebounds and five assists."}
{"game_id": "0021700931", "chunk_id": "0021700931_015", "order": 15, "role": "body", "text": "Grizzlies: The Grizzlies used their 22nd different starting lineup. ... The last time Memphis had a 12-game losing streak was from Jan. 6-31, 2009. .G Myke Henry, called up from the G League before the game, had a career-high five steals. .F Ivan Rabb had a career-best six offensive rebounds, part of Memphis grabbing 17 from the offensive glass"}
{"game_id": "0021700931", "chunk_id": "0021700931_017", "order": 17, "role": "body", "text": "Millsap, who came off the bench when he returned to action Tuesday after missing 44 games, was in the starting lineup against the Grizzlies. \"I found a little bit of rhythm due to a lot of easy baskets that my teammates were giving me,\" said Millsap, who was out due to wrist injury. \"I feel pretty good for the most part.\""}
{"game_id": "0021700931", "chunk_id": "0021700931_019", "order": 19, "role": "body", "text": "Due to illness and injury, the Grizzlies dressed only 10 players for the game, including guard Wayne Selden, who was on limited minutes in his first game back from right knee soreness. Bickerstaff said in his pregame interview: \"We called Myke Henry and Kobi (Simmons) will be with us\" from the team's G League Memphis Hustle, who played on the road Friday night against the Northern Arizona Suns.  Bickerstaff added that it was \"difficult\" to find 10 players. \"We had to locate Myke (Henry) at the last minute to bring him in.\""}
{"game_id": "0021700931", "chunk_id": "0021700931_021", "order": 21, "role": "body", "text": "Nuggets: At Cleveland on Saturday night."}
{"game_id": "0021700931", "chunk_id": "0021700931_022", "order": 22, "role": "body", "text": "Grizzlies: At Orlando on Saturday night."}
{"game_id": "0021700931", "chunk_id": "0021700931_024", "order": 24, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
