{"game_id": "0021200289", "chunk_id": "0021200289_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  At halftime, the Atlanta Hawks figured they had played cautiously long enough."}
{"game_id": "0021200289", "chunk_id": "0021200289_002", "order": 2, "role": "body", "text": "With a burst of energy, tough defense and 3-point shooting from Lou Williams in the third quarter, the Hawks were able to pull away for a 93-83 victory over the Memphis Grizzlies on Saturday night."}
{"game_id": "0021200289", "chunk_id": "0021200289_003", "order": 3, "role": "body", "text": "\"I think we were just trying to play it safe because (the Grizzlies) are a really good team,\" Atlanta guard Jeff Teague said of the first-half effort. \"They were playing at home, so we didn't want to make any false moves and just keep it close."}
{"game_id": "0021200289", "chunk_id": "0021200289_004", "order": 4, "role": "body", "text": "\"We just came in, (at halftime) and it was like: 'Forget it. Let's play Hawks basketball and get after it.' And it helped.\""}
{"game_id": "0021200289", "chunk_id": "0021200289_005", "order": 5, "role": "body", "text": "Josh Smith had 24 points, while Williams scored 18 of his 21 in the second half. Al Horford had 19 points and grabbed 14 rebounds for Atlanta, which won for the ninth time in its last 10 games. Teague finished with 13 points and six assists."}
{"game_id": "0021200289", "chunk_id": "0021200289_006", "order": 6, "role": "body", "text": "Horford said Teague's leadership was a key to the third quarter, when Atlanta outscored Memphis 32-13. The game was close until the middle of the period, when Atlanta erased a five-point deficit with 20 straight points to build a lead that Memphis could not overcome."}
{"game_id": "0021200289", "chunk_id": "0021200289_007", "order": 7, "role": "body", "text": "\"(Teague) came in at halftime, and you could tell he was bothered by the way the first half went,\" Horford said. \"He made an effort to play better and pick up the pace of the game. I think that was the difference.\""}
{"game_id": "0021200289", "chunk_id": "0021200289_008", "order": 8, "role": "body", "text": "Zach Randolph and Marc Gasol scored 18 points apiece, Randolph grabbing 13 rebounds as Memphis lost at home for only the second time this season. Rudy Gay scored 17 points, but was 7 of 25 from the field. Mike Conley finished with 12 points."}
{"game_id": "0021200289", "chunk_id": "0021200289_009", "order": 9, "role": "body", "text": "Atlanta shot 44 percent for the game, and held Memphis to 43 percent. Atlanta has not allowed an opponent to shoot 50 percent this season."}
{"game_id": "0021200289", "chunk_id": "0021200289_010", "order": 10, "role": "body", "text": "The Hawks outrebounded Memphis 44-40, including 14 off the offensive glass. Atlanta also outscored the Grizzlies in the paint 42-38."}
{"game_id": "0021200289", "chunk_id": "0021200289_011", "order": 11, "role": "body", "text": "\"They just outworked us,\" Conley said. \"We turned the ball over too much (16 on the night). We didn't execute offensively. We didn't get any stops. In the third quarter, we let it slip away and weren't able to get back in the game.\""}
{"game_id": "0021200289", "chunk_id": "0021200289_012", "order": 12, "role": "body", "text": "Atlanta outscored Memphis 52-36 in the second half as Williams and Smith pushed the rally. The Hawks looked fresher after the halftime break despite winning at home Friday night over the Washington Wizards."}
{"game_id": "0021200289", "chunk_id": "0021200289_013", "order": 13, "role": "body", "text": "\"We looked like a team that was tired,\" said Memphis coach Lionel Hollins, whose team won at New Orleans on Friday night. \"They had 42-38 points in the paint and 15 fast-break points. At every area, they just beat us. We survived the first half, and they tried to save their guys by subbing.\""}
{"game_id": "0021200289", "chunk_id": "0021200289_014", "order": 14, "role": "body", "text": "Memphis carried a 47-41 into halftime behind Gasol and Randolph, who had 14 and 12 respectively, Randolph also grabbing nine rebounds."}
{"game_id": "0021200289", "chunk_id": "0021200289_015", "order": 15, "role": "body", "text": "\"In the first half, I didn't think we played well, and I told our guys at halftime.\" Atlanta coach Larry Drew said. \"But yet, we were only six points down, and that was one of the encouraging signs of the first half. We got into a rhythm in the third quarter, and Lou came in and gave us a big lift.\""}
{"game_id": "0021200289", "chunk_id": "0021200289_016", "order": 16, "role": "body", "text": "Atlanta turned up the defensive pressure to open the second half, leading to a 10-4 run and a tie at 51. Memphis missed six of its eight shots in the early minutes of the third quarter and committed three turnovers to allow Atlanta to pull even."}
{"game_id": "0021200289", "chunk_id": "0021200289_017", "order": 17, "role": "body", "text": "Atlanta would continue to push the pace, and the Grizzlies were dragging. The Hawks would craft a 20-0 run as Memphis went almost 5 minutes without scoring."}
{"game_id": "0021200289", "chunk_id": "0021200289_018", "order": 18, "role": "body", "text": "The rally put Atlanta up 73-58. Williams, who was 1 for 6 in the first half, connected on three straight from beyond the arc."}
{"game_id": "0021200289", "chunk_id": "0021200289_019", "order": 19, "role": "body", "text": "\"Just confidence. Just continue to shoot,\" Williams said of the difference from the first half. \"I got a layup, and then I was able to get a 3 and it snowballed from there.\""}
{"game_id": "0021200289", "chunk_id": "0021200289_020", "order": 20, "role": "body", "text": "Williams had 13 points in the third, helping the Hawks carry a 73-60 lead entering the fourth."}
{"game_id": "0021200289", "chunk_id": "0021200289_021", "order": 21, "role": "body", "text": "That was enough for Atlanta to withstand a Memphis push that got the Grizzlies within six points on multiple occasions midway through the fourth."}
{"game_id": "0021200289", "chunk_id": "0021200289_022", "order": 22, "role": "body", "text": "Both times Memphis made a run, Smith scored on 8-footers, the second time also drawing a foul. That was part of Smith scoring seven straight Atlanta points, and when Williams connected on his fourth 3-pointer of the night, the Hawks had stretched the lead back to double digits."}
{"game_id": "0021200289", "chunk_id": "0021200289_023", "order": 23, "role": "body", "text": "\"Once we got a little bit of a lead, we maintained our composure, even when they made a couple of runs,\" Drew said. \"That's just a huge win for us.\""}
{"game_id": "0021200289", "chunk_id": "0021200289_024", "order": 24, "role": "closing", "text": "Game notes: Both teams were playing the second game of a back-to-back. .The game was the nightcap of a doubleheader at the FedExForum. The University of Memphis defeated Austin Peay 83-65 in an afternoon contest. . Hawks G DeShawn Stevenson was available, but did not play for Atlanta because it was the second night of a back-to-back. Meanwhile, G Kyle Korver missed fourth straight game with back spasms. .Memphis had won 20 of its last 21 at home before the loss. .Gay had 17 points, scoring five points in the last minute, marking his 21st consecutive game with at least 14 points. .It was Atlanta's 10 win in the last 12 games of the series."}
