{"game_id": "0021200756", "chunk_id": "0021200756_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- It's no secret that Orlando's current rebuilding process will lean heavily on its ability to develop and get production from its younger players."}
{"game_id": "0021200756", "chunk_id": "0021200756_002", "order": 2, "role": "body", "text": "After nearly a month of swallowing bitter lessons during a season-worst string of losses, the Magic's youth played a big role in helping them finally break out of their haze."}
{"game_id": "0021200756", "chunk_id": "0021200756_003", "order": 3, "role": "body", "text": "J.J. Redick scored 22 points, and Nikola Vucevic added 17 points and 19 rebounds as Orlando snapped a 12-game losing streak with a 110-104 victory over the Portland Trail Blazers on Sunday night."}
{"game_id": "0021200756", "chunk_id": "0021200756_004", "order": 4, "role": "body", "text": "The Magic shot 50 percent from the field in earning their first win since Jan. 16. Jameer Nelson added 10 points and a career-high 15 assists, and reserve Gustavo Ayon also tied a career-high with 16 points to go along with 11 rebounds for the Magic."}
{"game_id": "0021200756", "chunk_id": "0021200756_005", "order": 5, "role": "body", "text": "\"When teams made runs over the last X-amount of games, we kind of shut down a little bit,\" Nelson said. \"Tonight we didn't, we were up and they cut it to three or four. We just kept playing our game. We played well enough to win tonight.\""}
{"game_id": "0021200756", "chunk_id": "0021200756_006", "order": 6, "role": "body", "text": "LaMarcus Aldridge led Portland with 25 points. Nicolas Batum added 19 points and Wesley Matthews chipped in 17."}
{"game_id": "0021200756", "chunk_id": "0021200756_007", "order": 7, "role": "body", "text": "The Blazers, who have lost three in a row, fell to 1-7 in their last eight road games. They still have two more road games this week before the All-Star break."}
{"game_id": "0021200756", "chunk_id": "0021200756_008", "order": 8, "role": "body", "text": "After seeing his 30-point scoring night go for naught in his team's loss to Houston on Friday, Aldridge tried to defer more to his teammates at times Sunday."}
{"game_id": "0021200756", "chunk_id": "0021200756_009", "order": 9, "role": "body", "text": "It did little to draw out a better defensive effort, however."}
{"game_id": "0021200756", "chunk_id": "0021200756_010", "order": 10, "role": "body", "text": "Portland turned it over 14 times, leading to 18 points on the other end by Orlando. The Magic also got into the paint at will, outscoring the Blazers 60-46 on the inside and 15-6 on second-chance opportunities."}
{"game_id": "0021200756", "chunk_id": "0021200756_011", "order": 11, "role": "body", "text": "Part of the reason was how well Orlando's big men played. In addition to his scoring and rebounding, Ayon also helped to open things up offensively with six assists. One pass was particular highlight-worthy, with the second-year big man finding rookie Andrew Nicholson in the lane with a no-look, behind-the-back pass."}
{"game_id": "0021200756", "chunk_id": "0021200756_012", "order": 12, "role": "body", "text": "What made the game particularly impressive was that Ayon had not scored more than four points or had more than two rebounds in any of the Magic's previous five games."}
{"game_id": "0021200756", "chunk_id": "0021200756_013", "order": 13, "role": "body", "text": "\"The NBA is like that, and you have to forget about the game before,\" Ayon said. \"You have to think about the game that's coming up.\""}
{"game_id": "0021200756", "chunk_id": "0021200756_014", "order": 14, "role": "body", "text": "His impact on Sunday was not lost on Portland."}
{"game_id": "0021200756", "chunk_id": "0021200756_015", "order": 15, "role": "body", "text": "\"He has good basketball instincts and he was physical on the boards,\" Blazers coach Terry Stotts said. \"He was aggressive. He did a little bit of everything.\""}
{"game_id": "0021200756", "chunk_id": "0021200756_016", "order": 16, "role": "body", "text": "Guard play was also slanted heavily in the Magic's favor with Nelson's assist total overshadowing a 12-assist night by Portland point guard Damian Lillard, who also shot a dismal 1 for 16 from the field."}
{"game_id": "0021200756", "chunk_id": "0021200756_017", "order": 17, "role": "body", "text": "Orlando held a 79-72 lead entering the final quarter but had to push back against multiple attempts at a run by the Blazers down the stretch."}
{"game_id": "0021200756", "chunk_id": "0021200756_018", "order": 18, "role": "body", "text": "Portland closed to 103-95 with less than 3 minutes to play, but the Magic answered with a 3-pointer by Redick and a layup by Ayon to push the cushion back to 13 with just more than a minute remaining."}
{"game_id": "0021200756", "chunk_id": "0021200756_019", "order": 19, "role": "body", "text": "Redick returned to action Sunday after missing three consecutive games with a sore right shoulder and instantly injected some energy into the Magic lineup."}
{"game_id": "0021200756", "chunk_id": "0021200756_020", "order": 20, "role": "body", "text": "Usually most effective with his outside shot, Redick did his scoring with a variety of cuts to the basket and layups off fast breaks. He attempted only a pair of 3-pointers through the first three quarters, but still managed 17 points in that span."}
{"game_id": "0021200756", "chunk_id": "0021200756_021", "order": 21, "role": "body", "text": "The Magic led by as many as nine late in the second quarter before Batum went on a one-man 11-2 scoring run to tie it. Orlando responded with a 9-3 run to end the half, taking a 55-49 lead into the locker room."}
{"game_id": "0021200756", "chunk_id": "0021200756_022", "order": 22, "role": "body", "text": "Now a game under .500 and stuck in the No. 9 position in the West, it is a tenuous time for the Blazers, who next head to Miami on Tuesday before concluding their road trip at New Orleans on Wednesday."}
{"game_id": "0021200756", "chunk_id": "0021200756_023", "order": 23, "role": "body", "text": "\"There are things that we can fix. If things were going south, that means guys are not playing hard and we think that we are better than we are,\" Lillard said. \"We have spurts that we just let down and teams take advantage of it.\""}
{"game_id": "0021200756", "chunk_id": "0021200756_024", "order": 24, "role": "body", "text": "The Magic play their next two at home, where they have nine of their victories this season."}
{"game_id": "0021200756", "chunk_id": "0021200756_025", "order": 25, "role": "body", "text": "It's no secret that they want to hold onto their feeling from Sunday night."}
{"game_id": "0021200756", "chunk_id": "0021200756_026", "order": 26, "role": "body", "text": "\"You always want to see the fruits of your labor and in this business it's wins and losses and it's just good for the guys' psyche overall,\" Magic coach Jacque Vaughn said. \"But we've stayed firm in our approach and guys have been unbelievable throughout this process."}
{"game_id": "0021200756", "chunk_id": "0021200756_027", "order": 27, "role": "body", "text": "\"I think they see their hard work and the lessons that they're learning along the way, they'll add up for us.\""}
{"game_id": "0021200756", "chunk_id": "0021200756_028", "order": 28, "role": "closing", "text": "Game notes Orlando is the second straight opponent to shoot at least 50 percent against Portland. ... Nicholson was chosen to replace injured Detroit C Andre Drummond in the Rising Stars Challenge during All-Star weekend in Houston. He joins Vucevic, who will play on the opposing team in the game. Asked if he was concerned about either player on his injury-riddled team getting hurt, Vaughn replied, \"That's a nightly prayer.\" ... Magic F Hedo Turkoglu missed his third straight game with flu-like symptoms. ... Hall of Famer Julius Erving was in attendance Sunday night."}
