{"game_id": "0021400712", "chunk_id": "0021400712_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Three straight wins, a sellout crowd and another step toward a new arena. On and off the court, it had to be the best week in recent memory for the Milwaukee Bucks."}
{"game_id": "0021400712", "chunk_id": "0021400712_002", "order": 2, "role": "body", "text": "Jared Dudley scored 18 points and O.J. Mayo had 17 off the bench to help the Bucks beat the struggling Portland Trail Blazers 95-88 on Saturday night."}
{"game_id": "0021400712", "chunk_id": "0021400712_003", "order": 3, "role": "body", "text": "John Henson added 14 for the Bucks, who had won consecutive road games at Miami and Orlando. The Bucks had a pretty big week off the court, too, as Wisconsin Gov. Scott Walker announced a funding plan that could represent a major step toward building a new arena in Milwaukee."}
{"game_id": "0021400712", "chunk_id": "0021400712_004", "order": 4, "role": "body", "text": "Bucks coach Jason Kidd insisted this was the kind of potential he saw \"from Day 1\" when he took the job -- \"or Day 2, or whatever day we're on right now,\" he then conceded."}
{"game_id": "0021400712", "chunk_id": "0021400712_005", "order": 5, "role": "body", "text": "\"It's a great situation,\" Kidd said. \"We're a young team, we're in the process of doing a lot of building. With the new arena right there, with a young team learning how to play the right way, there's a lot of good things and a lot of buzz about the city of Milwaukee.\""}
{"game_id": "0021400712", "chunk_id": "0021400712_006", "order": 6, "role": "body", "text": "Damian Lillard and Wesley Matthews scored 19 points apiece for Portland. LaMarcus Aldridge added 18 points and 13 rebounds for the Blazers, who have lost three straight and eight of 10."}
{"game_id": "0021400712", "chunk_id": "0021400712_007", "order": 7, "role": "body", "text": "\"It was a tough back-to-back and I thought after the loss last night in Atlanta it was going to be a tough place to play tonight,\" Trail Blazers coach Terry Stotts said. \"Milwaukee is playing very well, and their defense showed what they have been doing all year.\""}
{"game_id": "0021400712", "chunk_id": "0021400712_008", "order": 8, "role": "body", "text": "Aldridge had to deal with double-teams from the Bucks that generally kept him contained, and Lillard couldn't capitalize on his opportunities, shooting 6 for 19 from the field."}
{"game_id": "0021400712", "chunk_id": "0021400712_009", "order": 9, "role": "body", "text": "\"It's been a tough month,\" Lillard said. \"I'd rather it be this month than next month or March. I think we can learn something from it.\""}
{"game_id": "0021400712", "chunk_id": "0021400712_010", "order": 10, "role": "body", "text": "The Bucks held the Trail Blazers to 37.1 percent from the floor, which tied Portland's lowest shooting percentage in a game this season."}
{"game_id": "0021400712", "chunk_id": "0021400712_011", "order": 11, "role": "body", "text": "\"It's been a tough stretch for us, there's no sugar-coating it,\" Matthews said. \"We're not playing well. We're not doing what we're supposed to do. But, with stretches like this, we've got the talent to overcome it, and we're going to.\""}
{"game_id": "0021400712", "chunk_id": "0021400712_012", "order": 12, "role": "body", "text": "Milwaukee entered the fourth quarter with a 76-65 lead after finishing the third on a 7-0 run that included a long jumper by Jerryd Bayless with 1.8 seconds left. Mayo then hit a long jumper and a 3-pointer to start the fourth. A few minutes later, recent Bucks addition Kenyon Martin blocked a shot by Lillard, and Bayless hit a 3 on the other end to put the Bucks ahead 84-69 with 9:15 left."}
{"game_id": "0021400712", "chunk_id": "0021400712_013", "order": 13, "role": "body", "text": "For Milwaukee, the most surprising stat of the game might have been 18,717 -- a sellout crowd, only the team's second of the season."}
{"game_id": "0021400712", "chunk_id": "0021400712_014", "order": 14, "role": "body", "text": "\"The crowd was the best I've seen in a long time,\" Henson said. \"They got into it early and often. I think it's starting to pick up here, so it's cool.\""}
{"game_id": "0021400712", "chunk_id": "0021400712_017", "order": 17, "role": "body", "text": "Trail Blazers: Center Robin Lopez remained out as he continues his recovery from a broken right hand. ... Lillard celebrated emphatically after making one of the most impressive plays of the night, grabbing a loose ball near the top of the key, driving the lane and flying in for a dunk with 3:22 left in the second quarter."}
{"game_id": "0021400712", "chunk_id": "0021400712_018", "order": 18, "role": "body", "text": "Bucks: Milwaukee is 16-0 when allowing fewer than 90 points. ... Giannis Antetokounmpo had a pair of highlight-reel moments, a two-handed, alley-oop dunk from Brandon Knight early in the first quarter and a fast-break windmill slam in the third."}
{"game_id": "0021400712", "chunk_id": "0021400712_020", "order": 20, "role": "body", "text": "As if the All-Star snub wasn't bad enough, Lillard might not have gotten much sleep Friday night. He posted a message on his Twitter account in the early hours of Saturday morning saying, \"Pfister hotel in Milwaukee haunted ... Idc what nobody say.\""}
{"game_id": "0021400712", "chunk_id": "0021400712_021", "order": 21, "role": "body", "text": "Lillard isn't by any means the first professional athlete to report an odd experience at the Pfister, which was built in 1893 and is arguably the nicest hotel in town."}
{"game_id": "0021400712", "chunk_id": "0021400712_022", "order": 22, "role": "body", "text": "\"I was hearing noises in the hotel,\" Lillard said after Saturday's game. \"I came to my door -- there is a storage room right outside my door -- I looked up and the storage room (door) was cracked open, the light was off, I was like, what? That's a real story. It was weird.\""}
{"game_id": "0021400712", "chunk_id": "0021400712_024", "order": 24, "role": "body", "text": "New arena plans aside, the BMO Harris Bradley Center got a few tweaks, giving the Bucks' locker room a new look, complete with a personalized photo plaque in each player's locker."}
{"game_id": "0021400712", "chunk_id": "0021400712_025", "order": 25, "role": "body", "text": "Kidd said the changes show the commitment of the team's ownership group. But he didn't necessarily think players fret too much about locker room conditions: \"As long as the uniform's hanging up, that's all that matters,\" he said."}
{"game_id": "0021400712", "chunk_id": "0021400712_027", "order": 27, "role": "body", "text": "Trail Blazers: Tuesday night vs. Utah."}
{"game_id": "0021400712", "chunk_id": "0021400712_028", "order": 28, "role": "closing", "text": "Bucks: Monday night at Toronto."}
