{"game_id": "0021300968", "chunk_id": "0021300968_001", "order": 1, "role": "lead", "text": "CHICAGO -- Mike Dunleavy caught an elbow just above the right eye while drawing a charge early in the second quarter Thursday night and left a trail of blood on the court as he ran into the Bulls' locker room.\nThough the said Dunleavy's return was questionable, there was never any doubt in his mind."}
{"game_id": "0021300968", "chunk_id": "0021300968_002", "order": 2, "role": "body", "text": "After getting 10 stitches to close the gash, Dunleavy returned in the second half to score all of his 21 points to help the Bulls pull away for a 111-87 wire-to-wire victory over the Houston Rockets.\n\"I just knew once they got the stitches done I was coming back,\" he said. \"It was a pretty tough hit. My neck is sore -- there's some whiplash-type stuff -- and we're a little concerned about that, but overall, obviously, I felt pretty good in the second half.\n\"The hit knocked a little sense into me, I guess.\"\nDunleavy's strong second half paced six Bulls in double figures.\nCenter Joakim Noah flirted with a triple-double, finishing with 13 points, 10 rebounds and nine assists in 34 minutes. He was headed for his fourth triple-double of the season, but sat down with about three minutes left because of the lopsided score."}
{"game_id": "0021300968", "chunk_id": "0021300968_003", "order": 3, "role": "body", "text": "Kirk Hinrich scored 19 points for Chicago, going 5 for 6 on 3-pointers, Carlos Boozer added 18 points, D.J. Augustin 13 and Jimmy Butler 11.\nIt was a team effort, but Dunleavy's play was the focus in the Bulls' locker room.\n\"I think it inspired the team,\" Noah said. \"He had a huge knot on his head looking like (Evander) Holyfield, the white version, coming out there putting on a new jersey, gutting it out in the second half shows, it was good for Duke's street credibility.\n\"It was very impressive. It shows a lot about the character of this team. ... I've never seen nothing like that, to get rocked like he got rocked.\"\nThe Bulls improved to 2-2 on their six-game home stand.\nThe Rockets have dropped two straight. Reserve guard Jeremy Lin led Houston with 21 points, while Dwight Howard had 12 points and 10 rebounds in 28 minutes. James Harden had eight points on 2-for-7 shooting in 27 minutes.\nThe Bulls were coming off a humiliating loss to San Antonio on Tuesday. Although they lost by just eight points, 104-96, the game was essentially over after they fell behind by 32 points in the first half. Bulls coach Tom Thibodeau said his team simply wasn't ready to play following an emotional win against the Miami Heat two days earlier."}
{"game_id": "0021300968", "chunk_id": "0021300968_004", "order": 4, "role": "closing", "text": "\"If we don't play with great intensity, we're in trouble,\" Thibodeau said before playing the Rockets. \"Two or three minutes when you don't have that edge, that's 15 or 20 points.\"\nThat wasn't a problem Thursday -- at least for the Bulls.\n\"We did not come out ready to play,\" Rockets coach Kevin McHale said. \"I have no idea why. You have to ask them. We did not offensively or defensively start the game. We were walking it up, not running.\"\nThe Bulls led 50-42 at the half and any thoughts of a Houston comeback were quickly dismissed at the start of the third quarter when the Bulls scored 16 straight points for a 66-42 edge. The final 12 points of the run came on four straight 3-pointers by Dunleavy and Hinrich. They each had two, alternating after Hinrich started the streak.\nLater in the quarter, the Bulls stretched the lead to 77-48 on a 3-pointer by Augustin. They led 85-58 entering the fourth quarter.\nDunleavy finished the period with 18 points on 7-for-11 shooting. He was 3-for-4 on 3-pointers and the Bulls were 6 for 8 from behind the line in the quarter.\nThe Bulls were able to open up the big lead because of the hot shooting, but Noah's defense on Howard was also key. Noah's ability to contain the Rockets' big man straight up hampered the Rockets' offense.\nIt was a far cry from early in his career when Noah usually was overpowered by Howard.\nGame notes\nThe Rockets won 109-94 in the teams' previous meeting on Dec. 18. Houston had 66 points in the paint in that game, the most the Bulls have allowed this season. ... McHale, despite having Dwight Howard on his team, said before the game that Noah should be the league's defensive player of the year. \"Especially after the (Loul) Deng trade, Noah's played with such high intensity,\" McHale said. \"They've been winning a lot of games just on his grit and toughness.\". Before Thursday, the Rockets were 13-3 since Feb. 1 and had won four straight against the Bulls. Rockets were averaging 106.5 points before Thursday."}
