{"game_id": "0021300353", "chunk_id": "0021300353_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- The Oklahoma City Thunder apparently can win ugly, too.\nThe Thunder blew most of a 16-point lead in the final six minutes Sunday night against the Orlando Magic but hung on for a 101-98 win, the 12th in the row to start the season at home for Oklahoma City.\nThe Thunder are the first team in the NBA to open the season with 12 straight home wins since the Cleveland Cavaliers in 2008, according to STATS. The franchise last started 12-0 at home to open the 1993-94 season, when the team was located in Seattle."}
{"game_id": "0021300353", "chunk_id": "0021300353_002", "order": 2, "role": "closing", "text": "Kevin Durant had 28 points, nine rebounds and five assists, and Russell Westbrook added 20 points, 12 rebounds and six assists for Oklahoma City, which has won six straight overall and 14 of its last 15. The Thunder have beaten the Magic in five straight meetings.\nBut Orlando made it interesting, taking advantage of miscues and missed shots by the Thunder to close the game on an 18-5 run. The Magic's Glen Davis missed a potential tying 3-point attempt in the final seconds and Oklahoma City's Serge Ibaka blocked a follow by Nikola Vucevic.\n\"I thought our defense was just up and down throughout the night and then we didn't do a great job of executing down the stretch,\" Oklahoma City coach Scott Brooks said. \"Those are things that we have to continue to work on and do a much better job with that. I think we have been doing a great job of that up until tonight.\"\nThe Thunder's 12-game home winning streak matches their second-longest since the franchise moved to Oklahoma City. The Thunder won 14 in a row at Chesapeake Energy Arena from January-March 2012.\nArron Afflalo scored 25 points and Vucevic had 13 points and 16 rebounds for his 11th double-double this season for Orlando. The Magic, losers in 11 of their 13 road games this season, proved an unlikely threat to Oklahoma City's home dominance.\n\"Just good defense by (the Thunder) on our last possession and give them credit for that,\" Orlando coach Jacque Vaughn said. \"Overall, our guys really believed from beginning to end that we were going to win that game and that's a good start for us.\"\nDurant denied that the Thunder were complacent against Orlando.\n\"They kept fighting to the end,\" he said. \"We got some tough breaks, but we were glad we fought it out and got a win. They made a couple of runs but we were able to take the punch and keep pushing.\"\nA putback by Tobias Harris capped a 9-0 run by Orlando that tied the game at 45-45 with 3:38 left in the first half. After a timeout, Durant scored nine points in an 11-1 spurt by Oklahoma City and the Thunder led 56-49 at halftime.\nOrlando was within 67-62 after a 3-pointer by Jameer Nelson with 6:21 left in the third quarter, but Thabo Sefolosha had a follow dunk and a driving layup during a 16-7 run near the end of the quarter. Oklahoma City led 96-80 after a layup by Westbrook with 6:11 left.\nThe Magic scored eight straight points and cut the margin to 96-88 on a basket by Victor Oladipo with 3:58 left. Durant answered by feeding Westbrook for a layup, then grabbed a rebound off a miss by Nelson and drove the length of the court for a layup with 3:10 left.\nThat proved to be the Thunder's final basket, as they missed their final five shots and turned the ball over twice after that. Oklahoma City finished with 13 turnovers.\nNelson hit a 3-pointer -- with Westbrook defending -- with 31.9 seconds left to pull Orlando within 100-96 with 31.9 seconds to go. Westbrook turned the ball over moments later, leading to a basket by Maurice Harkless with 22.3 seconds left.\nDurant made 1 of 2 free throws with 13 seconds remaining to extend the Thunder's lead to 101-98. Davis missed a 3-point attempt and Vucevic tried to tip the ball in. Vucevic initially was awarded a basket on a goaltending call against Ibaka with 1.3 seconds left. After a video review, officials overturned their call and ruled there should be a jump ball at center court between Ibaka and Vucevic.\nThe tip went to Harris, but his 3-point attempt came after the buzzer.\n\"We had our chance to take it to overtime,\" Afflalo said. \"It would have been great momentum for us. . It just didn't happen.\"\nGame notes\nThe Pacers can improve to 12-0 at home when they host Detroit on Monday night. ... Sefolosha returned to the starting lineup after missing three games due to a sprained knee. He finished with six points in 23:01. . Oklahoma City recorded its 100th straight sellout at Chesapeake Energy Arena, which seats 18,203. . Davis left the game holding his left shoulder with 2:06 left but returned in the final seconds."}
