{"game_id": "0021700951", "chunk_id": "0021700951_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Bojan Bogdanovic has cranked up his tenacity, and it's leading to some of the best basketball of his life."}
{"game_id": "0021700951", "chunk_id": "0021700951_002", "order": 2, "role": "body", "text": "Bogdanovic tied his career high with 29 points and grabbed a key jump ball late to lead the Indiana Pacers over the Milwaukee Bucks 92-89 on Monday night."}
{"game_id": "0021700951", "chunk_id": "0021700951_003", "order": 3, "role": "body", "text": "Bogdanovic has been on a roll since Jan. 29, when he went scoreless in a win over Charlotte. Since then, he's scored in double figures in 13 straight games, and in six of those 13 contests, he's scored 20 or more points."}
{"game_id": "0021700951", "chunk_id": "0021700951_004", "order": 4, "role": "body", "text": "\"After that game I was scoreless here against Charlotte, I was really mad, and I just tried to tell myself that I have to be aggressive,\" Bogdanovic said."}
{"game_id": "0021700951", "chunk_id": "0021700951_005", "order": 5, "role": "body", "text": "His ferocity was obvious in the final five seconds of Monday night's contest."}
{"game_id": "0021700951", "chunk_id": "0021700951_006", "order": 6, "role": "body", "text": "After a video replay was unable to determine whether a loose ball rolled out of bounds off Indiana or Milwaukee, officials called a jump ball with a little more than five seconds remaining and Indiana leading 90-89."}
{"game_id": "0021700951", "chunk_id": "0021700951_007", "order": 7, "role": "body", "text": "When the basketball was tipped, Bogdanovic aggressively boxed out a Milwaukee defender, wrestled the loose ball away from his opponent's hands and held onto it tightly as he was dragged to the ground before a foul was called."}
{"game_id": "0021700951", "chunk_id": "0021700951_008", "order": 8, "role": "body", "text": "\"I just tried to box out (Eric) Bledsoe like on a free throw,\" Bogdanovic said. \"I was really, really locked in (at the foul line) and I knew that I was going to hit both of them.\""}
{"game_id": "0021700951", "chunk_id": "0021700951_009", "order": 9, "role": "body", "text": "Bogdanovic was locked in all night -- just as he has ever since his zero-point outing against Charlotte. Bogdanovic made 9 of 13 from the floor and 5 of 7 from beyond the arc."}
{"game_id": "0021700951", "chunk_id": "0021700951_010", "order": 10, "role": "body", "text": "After Bogdanovic's free throws, Milwaukee had a chance to tie it, but Giannis Antetokounmpo's 3-pointer from the wing hit the front of the rim as time expired."}
{"game_id": "0021700951", "chunk_id": "0021700951_011", "order": 11, "role": "body", "text": "Thaddeus Young finished with 10 and seven rebounds, and Victor Oladipo had 14 points, five assists, five rebounds and 10 turnovers."}
{"game_id": "0021700951", "chunk_id": "0021700951_012", "order": 12, "role": "body", "text": "Despite Bogdanovic's hot hand, the Pacers and Bucks got off to a slow, sloppy start. Indiana led 20-17 at the end of the first quarter. Both teams were playing on the second night of a back-to-back."}
{"game_id": "0021700951", "chunk_id": "0021700951_013", "order": 13, "role": "body", "text": "Milwaukee took a 46-44 lead into halftime, and then both teams came alive in the second half. The Pacers opened up the third with a 19-5 run that gave them a 65-50 lead. The 15-point edge was Indiana's largest of the game."}
{"game_id": "0021700951", "chunk_id": "0021700951_014", "order": 14, "role": "body", "text": "The Bucks put together a 19-5 scoring run to pull within four points at the end of the third quarter, setting up a back-and-forth ending."}
{"game_id": "0021700951", "chunk_id": "0021700951_015", "order": 15, "role": "body", "text": "Antetokounmpo finished with 18 points and 12 rebounds. Eric Bledsoe led the Bucks with 26 points."}
{"game_id": "0021700951", "chunk_id": "0021700951_016", "order": 16, "role": "body", "text": "\"Great effort. We played hard for 48 minutes and it's a 48-minute game,\" Bucks interim coach Joe Prunty said. \"We (ended) up with a pretty good look (to tie the game), just didn't knock it down.\""}
{"game_id": "0021700951", "chunk_id": "0021700951_018", "order": 18, "role": "body", "text": "Indiana: The Pacers have won three straight home games against the Bucks. ... Indiana has won 11 of its 13 home games since the beginning of January. ... The Pacers are 6-7 when playing the second night of a back-to-back. Indiana is 3-3 when the second game of a back-to-back is played at home."}
{"game_id": "0021700951", "chunk_id": "0021700951_019", "order": 19, "role": "body", "text": "Milwaukee: The Bucks are 9-5 when playing on a second night of a back-to-back. The Bucks' nine wins on the second night of a back-to-back is the second most in the NBA."}
{"game_id": "0021700951", "chunk_id": "0021700951_021", "order": 21, "role": "body", "text": "Pacers coach Nate McMillan said point guard Darren Collison is not expected to play this week during Indiana's three-game home stretch, despite recently participating in drills during practice. Collison has not played since Feb. 3. The eighth year veteran underwent arthroscopic knee surgery on his left knee."}
{"game_id": "0021700951", "chunk_id": "0021700951_023", "order": 23, "role": "body", "text": "Milwaukee: Hosts the Rockets on Wednesday night."}
{"game_id": "0021700951", "chunk_id": "0021700951_024", "order": 24, "role": "body", "text": "Indiana: Hosts Utah on Wednesday night."}
{"game_id": "0021700951", "chunk_id": "0021700951_026", "order": 26, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
