{"game_id": "0021700144", "chunk_id": "0021700144_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Damian Lillard appears to have shelved whatever problems he had with his shooting touch the first two weeks of the NBA season."}
{"game_id": "0021700144", "chunk_id": "0021700144_002", "order": 2, "role": "body", "text": "The Portland guard tied his season high with 36 points, hitting 10 of 18 shots and going 15 of 15 from the free throw line, and the Trail Blazers held off the Oklahoma City Thunder 103-99 on Sunday night."}
{"game_id": "0021700144", "chunk_id": "0021700144_003", "order": 3, "role": "body", "text": "Lillard also handed out a season-high 13 assists."}
{"game_id": "0021700144", "chunk_id": "0021700144_004", "order": 4, "role": "body", "text": "Paul George topped the Thunder (4-5) with 27 points. Russell Westbrook had 25 points and nine assists."}
{"game_id": "0021700144", "chunk_id": "0021700144_005", "order": 5, "role": "body", "text": "Lillard went through a five-game stretch where he shot a collective 34 percent (30 of 88). But he has picked it up of late, as Sunday was his fourth consecutive 30-point game. It didn't hurt the confident Lillard that he was facing Westbrook, the 2016-17 NBA MVP."}
{"game_id": "0021700144", "chunk_id": "0021700144_006", "order": 6, "role": "body", "text": "\"I go into every game with the same attitude, but obviously when you're playing against a former MVP, you want to embrace that challenge. You know that if you don't, he's going to take your lunch,\" Lillard said. \"If I don't step up, how's my team going to step up?\""}
{"game_id": "0021700144", "chunk_id": "0021700144_007", "order": 7, "role": "body", "text": "Jusuf Nurkic had 25 points and eight rebounds, while C.J. McCollum hit six 3-pointers and scored 22 points for the Blazers. Coming off a 28-point performance against the Los Angeles Lakers last Thursday, it was the first time Nurkic has scored at least 20 points in consecutive games this season."}
{"game_id": "0021700144", "chunk_id": "0021700144_008", "order": 8, "role": "body", "text": "\"I'm focusing on finishing at the rim, and help in any way that I can. I know this team can win if I bring my good game,\" Nurkic said."}
{"game_id": "0021700144", "chunk_id": "0021700144_009", "order": 9, "role": "body", "text": "Portland needed all of Lillard and Nurkic's efforts to fend off Oklahoma City, which played short-handed for much of the second half after Carmelo Anthony was ejected for a flagrant 2 foul."}
{"game_id": "0021700144", "chunk_id": "0021700144_010", "order": 10, "role": "body", "text": "Anthony, who had 15 points and six rebounds, was ejected with 4:26 left in the third quarter. Driving to the basket for a layup, Anthony elbowed the chin of Nurkic, who collapsed and lay on the floor for more than a minute. Initially, Nurkic was called for the foul, but following a video review, Anthony was hit with a flagrant 2 foul."}
{"game_id": "0021700144", "chunk_id": "0021700144_011", "order": 11, "role": "body", "text": "The call baffled Oklahoma City coach Billy Donovan."}
{"game_id": "0021700144", "chunk_id": "0021700144_012", "order": 12, "role": "body", "text": "\"I've never seen, in the history of the game, a guy gets an and-1' play and then get ejected from the game,\" Donovan said."}
{"game_id": "0021700144", "chunk_id": "0021700144_013", "order": 13, "role": "body", "text": "Portland was beginning to take control of the game before the Anthony ejection, and it only helped fuel the Blazers. Portland separated itself with a 10-0 run to take a 16-point lead. Lillard scored 14 points during the third quarter as the Blazers led 78-67 heading into the fourth."}
{"game_id": "0021700144", "chunk_id": "0021700144_014", "order": 14, "role": "body", "text": "But after going scoreless for more than four minutes, the Blazers' advantage began to wilt. Oklahoma City got to 90-88 on two free throws by Westbrook, but consecutive 3-pointers by McCollum, and Lillard's layup helped the Blazers maintain the lead. The Thunder's comeback hopes were dashed when, down 98-94 with 20.5 seconds left, Westbrook missed three consecutive free throws."}
{"game_id": "0021700144", "chunk_id": "0021700144_015", "order": 15, "role": "body", "text": "\"We've been in these positions before and found ways to lose them. We kept our composure and made our free throws when it mattered,\" Portland coach Terry Stotts said."}
{"game_id": "0021700144", "chunk_id": "0021700144_016", "order": 16, "role": "body", "text": "The game started as an offensive showcase, as the teams combined to hit 13 of their first 16 shots. The Thunder cooled considerably, though, while Portland shot 58 percent during the first half to take a 50-46 halftime lead."}
{"game_id": "0021700144", "chunk_id": "0021700144_017", "order": 17, "role": "body", "text": "For a second straight game, the Blazers were without starting forward Al-Farouq Aminu, who sprained his right ankle Wednesday night against Utah."}
{"game_id": "0021700144", "chunk_id": "0021700144_019", "order": 19, "role": "body", "text": "Thunder: Oklahoma City is 0-4 against Northwest Division foes this season. ... One tradition that continues is Portland fans' booing of Raymond Felton. The Thunder guard was a bust during his one season playing for the Blazers in 2011-12. Felton scored a season-high 15 points."}
{"game_id": "0021700144", "chunk_id": "0021700144_020", "order": 20, "role": "body", "text": "Blazers: Lillard had seven assists in the first eight minutes . Lillard has hit 43 consecutive free throws. ... Nurkic is averaging 24.0 points, 8.0 rebounds and 3.3 assists over his past three games."}
{"game_id": "0021700144", "chunk_id": "0021700144_022", "order": 22, "role": "body", "text": "Crew chief Rodney Mott explained why Anthony's third-quarter foul was a flagrant 2 and not a common foul."}
{"game_id": "0021700144", "chunk_id": "0021700144_023", "order": 23, "role": "body", "text": "\"We deemed that the contact was excessive and that it was not a natural basketball move where he seeks out Nurkic, hits him in the face with an elbow and goes back to the basket,\" Mott told a pool reporter."}
{"game_id": "0021700144", "chunk_id": "0021700144_025", "order": 25, "role": "body", "text": "Thunder: Play at Sacramento on Tuesday."}
{"game_id": "0021700144", "chunk_id": "0021700144_026", "order": 26, "role": "closing", "text": "Blazers: Play host to Memphis on Tuesday."}
