{"game_id": "0021700512", "chunk_id": "0021700512_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  The Oklahoma City Thunder are having fun playing basketball and that's translating into a long winning streak."}
{"game_id": "0021700512", "chunk_id": "0021700512_002", "order": 2, "role": "body", "text": "Paul George went 7 of 10 from 3-point range -- tying the Thunder record for 3s in a game -- and scored 33 points and Russell Westbrook added 30 points, 13 assists and eight rebounds as Oklahoma City won its sixth straight game, beating the red-hot Toronto Raptors 124-107 on Wednesday night."}
{"game_id": "0021700512", "chunk_id": "0021700512_003", "order": 3, "role": "body", "text": "Carmelo Anthony and Steven Adams had 18 points each for Oklahoma City, which is 12-3 in December and is five games over .500 after an 8-12 start. The Thunder are alone in second place in the Northwest Division, two games behind Minnesota."}
{"game_id": "0021700512", "chunk_id": "0021700512_004", "order": 4, "role": "body", "text": "\"The biggest thing is on the court, we're expecting to win,\" George said. \"That just changes really everything, your whole outlook stepping into a game, to preparation, to getting each other ready. We're just stepping on that floor and we're expecting to win.\""}
{"game_id": "0021700512", "chunk_id": "0021700512_005", "order": 5, "role": "body", "text": "The Thunder won despite being on the wrong end of a 23-2 run in the first half, during which the Raptors built a 12-point lead in the second quarter."}
{"game_id": "0021700512", "chunk_id": "0021700512_006", "order": 6, "role": "body", "text": "C.J. Miles led the Raptors with 20 points, while Jonas Valanciunas added 16 and DeMar DeRozan had 15. Kyle Lowry went 3 of 10 from the field but had a double-double with 13 points and 10 assists."}
{"game_id": "0021700512", "chunk_id": "0021700512_007", "order": 7, "role": "body", "text": "Toronto entered the game as the hottest team in the Eastern Conference, but lost its second game in as many nights and fell to 10-3 in December. Miles went 6 of 12 from 3-point range but the Raptors otherwise struggled from behind the arc, finishing 11 of 38."}
{"game_id": "0021700512", "chunk_id": "0021700512_008", "order": 8, "role": "body", "text": "The Thunder posted a sizable 52-34 edge in rebounding."}
{"game_id": "0021700512", "chunk_id": "0021700512_009", "order": 9, "role": "body", "text": "\"We ran into a well-oiled machine tonight,\" Toronto coach Dwane Casey said. \"We had stretches but just didn't have the juice or the energy to come in. It's a difficult part -- two in a row. We should hurt, we should be down, be upset that we lost two in a row. We didn't earn either game. We didn't earn last night the way we played and we didn't earn the game tonight in the stretches we played bad. We've got to put a full game together.\""}
{"game_id": "0021700512", "chunk_id": "0021700512_010", "order": 10, "role": "body", "text": "Oklahoma City rallied to take a 66-63 halftime lead and outscored Toronto 18-10 over the final 5:41 of the third quarter. The Thunder went up 102-88 on a late 3-pointer by Raymond Felton, then pulled away in the fourth quarter, their lead peaking at 117-96 with 4:47 left on a 3-pointer by George ."}
{"game_id": "0021700512", "chunk_id": "0021700512_011", "order": 11, "role": "body", "text": "\"We played like crap,\" DeRozan said. \"As a team. Down the line individually. And it showed.\""}
{"game_id": "0021700512", "chunk_id": "0021700512_012", "order": 12, "role": "body", "text": "Oklahoma City jumped to a 32-23 lead with 2:30 left in the first quarter, but the Raptors seized control with a 23-2 run and led 46-34 after Deion Wright's three-point play with 9:55 left in the half. The Thunder rebounded to take a seven-point lead before settling for a 66-63 halftime lead."}
{"game_id": "0021700512", "chunk_id": "0021700512_013", "order": 13, "role": "body", "text": "\"We just stuck to the game plan,\" George said. \"We knew we needed to be more aggressive. That wasn't how we wanted to end that first quarter after we played so well (to start). We knew we had to kick it up another notch. That's a really good, explosive offensive team. We just couldn't allow them to get comfortable.\""}
{"game_id": "0021700512", "chunk_id": "0021700512_015", "order": 15, "role": "body", "text": "Raptors: Serge Ibaka, a fan favorite during his seven seasons for the Thunder before being traded in June 2016, received a hearty ovation during pre-game introductions and waved to the crowd. ... The Raptors went 24 of 26 from the free-throw line, with Jakob Poeltl responsible for both misses. ... Lucas Nogueira got in the game late in the fourth quarter, after missing the previous 11 games with a right calf injury."}
{"game_id": "0021700512", "chunk_id": "0021700512_016", "order": 16, "role": "body", "text": "Thunder: Westbrook and Valanciunas each received a technical foul after a second-quarter skirmish, and later in the quarter, Adams and Valanciunas were called for a double foul after getting tangled up under the Toronto basket. ... The Raptors' 38 points were the most in the first quarter by a Thunder opponent this season. ... The game was delayed about 3 minutes in the third quarter after a small electrical fire by one of the catwalks at Chesapeake Energy Arena."}
{"game_id": "0021700512", "chunk_id": "0021700512_018", "order": 18, "role": "body", "text": "George, on the brief delay due to the electrical fire: \"We were on fire. The roof was on fire. I think we had something to do with that. . The energy was amazing. From the energy we generated on the floor to the fans giving us energy to keep going. It was too much energy -- lights were blowing out.\""}
{"game_id": "0021700512", "chunk_id": "0021700512_020", "order": 20, "role": "body", "text": "Raptors: Host Atlanta on Friday."}
{"game_id": "0021700512", "chunk_id": "0021700512_021", "order": 21, "role": "body", "text": "Thunder: Continue their four-game home stand, hosting Milwaukee on Friday."}
{"game_id": "0021700512", "chunk_id": "0021700512_023", "order": 23, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
