{"game_id": "0021700561", "chunk_id": "0021700561_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  A teammate asked Giannis Antetokounmpo how he felt after a game in which the Milwaukee Bucks star secured his 18th double-double of the season."}
{"game_id": "0021700561", "chunk_id": "0021700561_002", "order": 2, "role": "body", "text": "\"Good rest,\" said Antetokounmpo, shrugging his shoulders as he reached his locker."}
{"game_id": "0021700561", "chunk_id": "0021700561_003", "order": 3, "role": "body", "text": "Antetokounmpo had 31 points and 10 rebounds before getting a well-earned break in the fourth quarter, and the Bucks pulled away for a 122-101 win over the Indiana Pacers on Wednesday night."}
{"game_id": "0021700561", "chunk_id": "0021700561_004", "order": 4, "role": "body", "text": "Antetokounmpo had his way around the rim with his usual array of dunks and layups, shooting 12 of 18. He clinched his double-double with 1:01 left in the third quarter, passing an offensive rebound to Thon Maker in the corner."}
{"game_id": "0021700561", "chunk_id": "0021700561_005", "order": 5, "role": "body", "text": "Maker hit an open 3-pointer to extend what had been a 10-point halftime lead to a 93-74 edge. It was one of the Bucks' five 3s in the third to put the game out of reach."}
{"game_id": "0021700561", "chunk_id": "0021700561_006", "order": 6, "role": "body", "text": "\"We are still giving up big quarters, to start the first, to start the third,\" Pacers coach Nate McMillan said. \"Defensively we are in a hole, and offensively we are turning the ball over.\""}
{"game_id": "0021700561", "chunk_id": "0021700561_007", "order": 7, "role": "body", "text": "This was just the kind of breather the Bucks needed after losing in overtime at Toronto on New Year's Day, with the dangerous Raptors visiting Milwaukee on Friday. Coach Jason Kidd liked the ball movement after his team had 33 assists, especially in the third quarter."}
{"game_id": "0021700561", "chunk_id": "0021700561_008", "order": 8, "role": "body", "text": "Khris Middleton added 27 points, while Malcolm Brogdon added 17 off the bench for the Bucks."}
{"game_id": "0021700561", "chunk_id": "0021700561_009", "order": 9, "role": "body", "text": "\"We put a huge emphasis on coming out in the third quarter ... and really trying to close it out early,\" Brogdon said."}
{"game_id": "0021700561", "chunk_id": "0021700561_010", "order": 10, "role": "body", "text": "The lead was so safe that Kidd rested Antetokounmpo for the entire fourth quarter. The 6-foot-11 star played just 29 minutes, nine fewer than his season average."}
{"game_id": "0021700561", "chunk_id": "0021700561_011", "order": 11, "role": "body", "text": "Middleton, who averages 37 minutes a night, was also limited to 29 on Wednesday."}
{"game_id": "0021700561", "chunk_id": "0021700561_012", "order": 12, "role": "body", "text": "\"We'd all like to have a game like this when you can keep them under 30 minutes,\" Kidd said."}
{"game_id": "0021700561", "chunk_id": "0021700561_013", "order": 13, "role": "body", "text": "Minus leading scorer Victor Oladipo (24.9 points per game) for a fourth straight game because of a knee injury, the Pacers couldn't keep up with Antetokounmpo's athleticism on both ends of the floor ."}
{"game_id": "0021700561", "chunk_id": "0021700561_014", "order": 14, "role": "body", "text": "Domantas Sabonis had a career-high 24 points on 10-of-13 shooting for Indiana, which lost its season-high fifth straight. Darren Collison added 17 points."}
{"game_id": "0021700561", "chunk_id": "0021700561_015", "order": 15, "role": "body", "text": "The Pacers shot just 20 percent (3 of 15) from 3-point range."}
{"game_id": "0021700561", "chunk_id": "0021700561_016", "order": 16, "role": "body", "text": "\"We are in a tough stretch now. We just got to figure it out together as a team somehow, continue to get better,\" Sabonis said."}
{"game_id": "0021700561", "chunk_id": "0021700561_017", "order": 17, "role": "body", "text": "Antetokounmpo had 21 points on 8-of-11 shooting in the first half to help the Bucks build a 62-52 halftime lead."}
{"game_id": "0021700561", "chunk_id": "0021700561_019", "order": 19, "role": "body", "text": "Pacers: The Bucks shot 58 percent overall, the fourth time in five games that Indiana allowed an opponent to make at least half its shots. ... Officials whistled coach Nate McMillan for a technical with 4:57 left in the third quarter following a contested dunk by Antetokounmpo. ... Sabonis led the team in the first half with 14 points after hitting 6 of 8 shots."}
{"game_id": "0021700561", "chunk_id": "0021700561_020", "order": 20, "role": "body", "text": "Bucks: Alley-oop buckets were a staple of the offense early with Antetokounmpo and Bledsoe each connecting on crowd-pleasing dunks in a first quarter that ended with Milwaukee leading 34-26. The Bucks held a 16-10 edge on points in the paint after the first, before the Pacers tried to get more protective around the rim. Antetokounmpo still held a high-flying advantage because of his quickness and length."}
{"game_id": "0021700561", "chunk_id": "0021700561_022", "order": 22, "role": "body", "text": "\"We can't worry about that. Injuries are a part of it. We definitely miss players when they are out, but we are without Vic and we have to get it done.\" -- McMillan on the adjustment to playing without Oladipo."}
{"game_id": "0021700561", "chunk_id": "0021700561_024", "order": 24, "role": "body", "text": "Bucks guard Matthew Dellavedova had eight points and nine assists in just 17 minutes. He had his third straight game with at least nine assists, all coming off the bench."}
{"game_id": "0021700561", "chunk_id": "0021700561_025", "order": 25, "role": "body", "text": "\"When he's on the floor, I think all four guys believe they have a chance to score, and that helps,\" Kidd said."}
{"game_id": "0021700561", "chunk_id": "0021700561_027", "order": 27, "role": "body", "text": "Pacers: Open a four-game homestand on Saturday by hosting the Chicago Bulls."}
{"game_id": "0021700561", "chunk_id": "0021700561_028", "order": 28, "role": "body", "text": "Bucks: Host the Toronto Raptors on Friday, four days after a losing in overtime at the Air Canada Centre."}
{"game_id": "0021700561", "chunk_id": "0021700561_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
