{"game_id": "0021300628", "chunk_id": "0021300628_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Every shot Caron Butler made helped dull the pain of a recent root canal."}
{"game_id": "0021300628", "chunk_id": "0021300628_002", "order": 2, "role": "body", "text": "Ending a nine-game losing streak?"}
{"game_id": "0021300628", "chunk_id": "0021300628_003", "order": 3, "role": "body", "text": "That gave the Milwaukee Bucks' veteran forward a reason to smile."}
{"game_id": "0021300628", "chunk_id": "0021300628_004", "order": 4, "role": "body", "text": "Butler scored 30 points two days after major dental work and the Bucks rallied from 13 points down in the third quarter for a 104-101 victory over the Detroit Pistons on Wednesday night."}
{"game_id": "0021300628", "chunk_id": "0021300628_005", "order": 5, "role": "body", "text": "\"I don't have that much energy,\" Butler said with a smile. \"I'm going to go home, go to sleep. Just relax.\""}
{"game_id": "0021300628", "chunk_id": "0021300628_006", "order": 6, "role": "body", "text": "A well-deserved break after shooting 12 of 21 and leading the charge by the Bucks' bench in the fourth quarter."}
{"game_id": "0021300628", "chunk_id": "0021300628_007", "order": 7, "role": "body", "text": "All on his bobblehead night, too. Butler was questionable for the game because he was still getting over his trip to the dentist."}
{"game_id": "0021300628", "chunk_id": "0021300628_008", "order": 8, "role": "body", "text": "\"I wasn't feeling good yesterday, feeling extremely weak,\" he said. Coach Larry Drew \"believed in me tonight and gave me an opportunity. That's why it was even more special.\""}
{"game_id": "0021300628", "chunk_id": "0021300628_009", "order": 9, "role": "body", "text": "Brandon Knight added 16 points against the team that traded him in the offseason, while backup center Miroslav Raduljica added eight points and eight rebounds. He was part of the reserve corps -- with Khris Middleton (10 points) and Luke Ridnour (eight points) -- that helped close the gap."}
{"game_id": "0021300628", "chunk_id": "0021300628_010", "order": 10, "role": "body", "text": "The Bucks trailed 76-63 in the third quarter, largely due to Brandon Jennings, who finished with 30 points for Detroit."}
{"game_id": "0021300628", "chunk_id": "0021300628_011", "order": 11, "role": "body", "text": "But Butler provided a boost with his jumper in the fourth and the Bucks held on late."}
{"game_id": "0021300628", "chunk_id": "0021300628_012", "order": 12, "role": "body", "text": "Josh Smith missed two foul shots with about 5 seconds left and Rodney Stuckey missed a desperation 3 at the buzzer."}
{"game_id": "0021300628", "chunk_id": "0021300628_013", "order": 13, "role": "body", "text": "\"It's important we keep the attitude and intensity. I think we got a little comfortable, but we can't let that happen,\" Jennings said. \"No matter what their record is, that's an NBA team over there."}
{"game_id": "0021300628", "chunk_id": "0021300628_014", "order": 14, "role": "body", "text": "At 8-33, the Bucks have the worst record in the NBA, but received a sorely needed confidence boost at the midpoint of the season."}
{"game_id": "0021300628", "chunk_id": "0021300628_015", "order": 15, "role": "body", "text": "\"I told our guys after the game, it's nice to get off that losing streak. Let's enjoy the moment, remember what this feels like tomorrow,\" Drew said. \"By no stretch of the imagination is losing fun.\""}
{"game_id": "0021300628", "chunk_id": "0021300628_016", "order": 16, "role": "body", "text": "Knight, who was traded for Jennings, also had nine assists and six rebounds, while Ersan Ilyasova added 12 points."}
{"game_id": "0021300628", "chunk_id": "0021300628_017", "order": 17, "role": "body", "text": "Greg Monroe added 18 points for Detroit and Stuckey finished 23."}
{"game_id": "0021300628", "chunk_id": "0021300628_018", "order": 18, "role": "body", "text": "The last few minutes found Jennings and Knight guarding each other on the perimeter."}
{"game_id": "0021300628", "chunk_id": "0021300628_019", "order": 19, "role": "body", "text": "Jennings blocked Knight with about 7 seconds left, but Smith missed the two foul shots at the other end."}
{"game_id": "0021300628", "chunk_id": "0021300628_020", "order": 20, "role": "body", "text": "The Pistons had one last chance after a contested possession was ruled in favor of Detroit. Stuckey's 3-point attempt from the corner sailed harmlessly into the side of the glass."}
{"game_id": "0021300628", "chunk_id": "0021300628_021", "order": 21, "role": "body", "text": "\"We made a few bad decisions on both ends of the floor, but I gave up a lot of offensive rebounds so I have to slap myself on the wrist for that,\" said center Andre Drummond, who finished with 11 points and 12 rebounds."}
{"game_id": "0021300628", "chunk_id": "0021300628_022", "order": 22, "role": "body", "text": "A game after going scoreless against the Clippers, Jennings shot 11 of 23 against the team that drafted him in the first round in 2009. Facing off against Knight at one point in the third quarter, Jennings hit a deep 3 to give  Detroit a 76-63 lead, then turned to the crowd and pointed his index finger to his forehead."}
{"game_id": "0021300628", "chunk_id": "0021300628_023", "order": 23, "role": "body", "text": "The Bucks started chipping away. With the shot clock winding down at the end of the third quarter, Butler hit a long 3 to get Milwaukee within 84-81."}
{"game_id": "0021300628", "chunk_id": "0021300628_024", "order": 24, "role": "body", "text": "\"That was definitely a momentum-changer. If we get that rebound and secure that ball, we go into the fourth up seven or eight points,\" Pistons coach Maurice Cheeks said."}
{"game_id": "0021300628", "chunk_id": "0021300628_025", "order": 25, "role": "body", "text": "Just another highlight from a memorable game for Butler. His play off the bench was especially important given the Bucks were without starting center Larry Sanders and veteran guard O.J. Mayo due to illness."}
{"game_id": "0021300628", "chunk_id": "0021300628_026", "order": 26, "role": "body", "text": "As for Butler's bobblehead doll, the likeness was close enough."}
{"game_id": "0021300628", "chunk_id": "0021300628_027", "order": 27, "role": "body", "text": "\"It looks like my cousin,\" he said, \"but it'll do, we are related.\""}
{"game_id": "0021300628", "chunk_id": "0021300628_028", "order": 28, "role": "body", "text": "Game notes The Pistons, the NBA's top offensive rebounding team coming into the night at 14.4 per game, were outrebounded on the offensive glass, 12-9 ...  Milwaukee G Luke Ridnour wore a sleeve around the right wrist he sprained on Saturday against the Spurs. ... Milwaukee used its 19th different starting lineup in its 41st game this season."}
{"game_id": "0021300628", "chunk_id": "0021300628_030", "order": 30, "role": "closing", "text": "Follow Genaro Armas at http://twitter.com/GArmasAP"}
