{"game_id": "0021200894", "chunk_id": "0021200894_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  The Trail Blazers were only in the first quarter against the woeful Bobcats when Nicolas Batum took off and lobbed the ball off the backboard into the hands of charging rookie Meyers Leonard for a dunk."}
{"game_id": "0021200894", "chunk_id": "0021200894_002", "order": 2, "role": "body", "text": "The play didn't go over well with Blazers coach Terry Stotts, who warned the duo about sportsmanship during halftime of Portland's 122-105 victory over Charlotte on Monday."}
{"game_id": "0021200894", "chunk_id": "0021200894_003", "order": 3, "role": "body", "text": "\"I didn't care for it. In fact, it was kind of messing with the game a little bit,\" Stotts said afterward."}
{"game_id": "0021200894", "chunk_id": "0021200894_004", "order": 4, "role": "body", "text": "The pass-off-the-glass dunk had no impact on the outcome. LaMarcus Aldridge had 23 points and 14 rebounds, leading seven Blazers in double figures."}
{"game_id": "0021200894", "chunk_id": "0021200894_005", "order": 5, "role": "body", "text": "Batum and rookie Damian Lillard each finished with 20 points and Portland shot a season-best 59.8 percent from the field. Leonard had a season-high 15 points off the bench -- including that dunk from Batum."}
{"game_id": "0021200894", "chunk_id": "0021200894_006", "order": 6, "role": "body", "text": "\"It was probably a little risky, but hey,\" Leonard shrugged."}
{"game_id": "0021200894", "chunk_id": "0021200894_007", "order": 7, "role": "body", "text": "Ramon Sessions had 18 points off the bench for the Bobcats, who have lost seven straight games. Rookie Michael Kidd-Gilchrist added 17 points."}
{"game_id": "0021200894", "chunk_id": "0021200894_008", "order": 8, "role": "body", "text": "The Bobcats were playing the second of a back-to-back and looked like it. They lost 119-83 at Sacramento on Sunday night after the Kings scored 43 points in the third quarter."}
{"game_id": "0021200894", "chunk_id": "0021200894_009", "order": 9, "role": "body", "text": "One thing that improved for Charlotte was rebounding. After the Bobcats were outrebounded 61-30 against the Kings, the Bobcats finished with a 44-41 advantage over the Blazers."}
{"game_id": "0021200894", "chunk_id": "0021200894_010", "order": 10, "role": "body", "text": "\"One thing is true -- you have got to know how you lost. They are strong at the pick-and-roll game and they found their 3-ball, that's what hurt us,\" Charlotte coach Mike Dunlap said. \"We changed some schemes in the second half, and they still shot well.\""}
{"game_id": "0021200894", "chunk_id": "0021200894_011", "order": 11, "role": "body", "text": "The Bobcats, who lost 18 in a row earlier this season, have only 13 wins -- a league low."}
{"game_id": "0021200894", "chunk_id": "0021200894_012", "order": 12, "role": "body", "text": "The Blazers, still fighting for a spot in the playoffs, won three of four games on their homestand but now head out on the road with games at Memphis, San Antonio and New Orleans. Portland is 3 1/2 games back of Utah for the eighth and final Western Conference playoff spot, while the Lakers are two games back of the Jazz."}
{"game_id": "0021200894", "chunk_id": "0021200894_013", "order": 13, "role": "body", "text": "\"It's gut-check time,\" Lillard said. \"If we're going to make this push for the playoffs we've got to win on the road.\""}
{"game_id": "0021200894", "chunk_id": "0021200894_014", "order": 14, "role": "body", "text": "Batum hit a 3-pointer that gave the Blazers an early 24-16 lead. His lob off the backboard for Leonard's dunk made it 30-21."}
{"game_id": "0021200894", "chunk_id": "0021200894_015", "order": 15, "role": "body", "text": "The French forward said the move is something he does with Leonard and some of the other players in practice. Although Sessions was on him, Batum said that had nothing really to do with it."}
{"game_id": "0021200894", "chunk_id": "0021200894_016", "order": 16, "role": "body", "text": "\"I don't know why I did it in a game,\" Batum said."}
{"game_id": "0021200894", "chunk_id": "0021200894_017", "order": 17, "role": "body", "text": "But immediately he knew he was in trouble with Stotts:  \"He's like, `You're lucky. You're lucky on this one,\" Batum said."}
{"game_id": "0021200894", "chunk_id": "0021200894_018", "order": 18, "role": "body", "text": "Lillard, who has won the West's rookie of the month honors for four straight months, hit a 3-pointer that put Portland ahead 66-51 late in the first half, and the Blazers went on to lead 68-55 at the break."}
{"game_id": "0021200894", "chunk_id": "0021200894_019", "order": 19, "role": "body", "text": "It was the most first-half points for Portland this season. The Blazers shot just over 65 percent."}
{"game_id": "0021200894", "chunk_id": "0021200894_020", "order": 20, "role": "body", "text": "The Blazers maintained a healthy lead throughout the third quarter, but Kidd-Gilchrist got the Bobcats closest when his basket narrowed the deficit to 74-65. Portland led by as many as 17 points in the second half."}
{"game_id": "0021200894", "chunk_id": "0021200894_021", "order": 21, "role": "body", "text": "Gerald Henderson's dunk pulled Charlotte within 108-96 with 3:12 left in the game, but Lillard answered with a 3-pointer for the Blazers. Stotts didn't send most of his starters to the bench until there was only 1:05 left. Later he said he just wanted to make sure Portland got the win."}
{"game_id": "0021200894", "chunk_id": "0021200894_022", "order": 22, "role": "body", "text": "\"We have to stick with our principles,\" Henderson said. \"It's tough to lose every night, but we've got to stay positive, keep our attitudes right, and continue to try and get better, practice-by-practice and game-by-game.\""}
{"game_id": "0021200894", "chunk_id": "0021200894_023", "order": 23, "role": "closing", "text": "Game notes Portland has won five straight against Charlotte at the Rose Garden. ... Atlanta Falcons running back Jacquizz Rodgers was at the game. Rodgers played at Oregon State. .. A fan in the stands held a sign with Lillard's face and the words \"We couldn't be prouder.\"  ... Portland's 122 points were a season high in regulation. ... Portland was coming off a 109-94 victory over the short-handed Timberwolves on Saturday."}
