{"game_id": "0021700554", "chunk_id": "0021700554_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  James Harden's strained left hamstring figures to be a problem for the Houston Rockets. It wasn't a big deal Wednesday night against the Orlando Magic."}
{"game_id": "0021700554", "chunk_id": "0021700554_002", "order": 2, "role": "body", "text": "Gerald Green scored a season-high 27 points, Clint Capela had 21 points and eight rebounds and the Rockets (27-9) got by without the NBA scoring leader in routing the Magic 116-98."}
{"game_id": "0021700554", "chunk_id": "0021700554_003", "order": 3, "role": "body", "text": "\"This was a good day. We've got Golden State (Thursday) so ask me tomorrow,\" Rockets coach Mike D'Antoni said. \"We'll try to hold the fort down until we get James back.\""}
{"game_id": "0021700554", "chunk_id": "0021700554_004", "order": 4, "role": "body", "text": "Green made his first five 3-point shots and finished 7 for 10 from behind the arc for the Rockets, who were never behind and led by as many as 28 late in the third quarter."}
{"game_id": "0021700554", "chunk_id": "0021700554_005", "order": 5, "role": "body", "text": "Eric Gordon and Ryan Anderson, with 17 points each, were among six Rockets in double figures and that did not include Chris Paul, who had eight points, 13 assists and seven rebounds."}
{"game_id": "0021700554", "chunk_id": "0021700554_006", "order": 6, "role": "body", "text": "\"We'e still trying to get healthy,\" Paul said. \"We're still waiting for Luc (Mbah a Moute) to get back and obviously James is out for a while, but it's by committee right now for us.\""}
{"game_id": "0021700554", "chunk_id": "0021700554_007", "order": 7, "role": "body", "text": "Aaron Gordon led the Magic with 16 points after missing his first eight shots. Elfrid Payton and Mario Hezonja added 14 each in Orlando's 12th loss in 13 games."}
{"game_id": "0021700554", "chunk_id": "0021700554_008", "order": 8, "role": "body", "text": "The Magic missed 16 of their first 18 shots and fell behind by 15 points before the end of the first quarter. A scoring burst by Hezonja kept them in the game in the second quarter but they could get no closer than nine."}
{"game_id": "0021700554", "chunk_id": "0021700554_009", "order": 9, "role": "body", "text": "Capela scored on a layup, a dunk and two free throws during the Rockets' 15-5 spurt at the outset of the second half, turning the game into a rout at 70-46."}
{"game_id": "0021700554", "chunk_id": "0021700554_010", "order": 10, "role": "body", "text": "In his first start and only his fourth game with the Rockets, Green produced his 27 points on only 15 shots."}
{"game_id": "0021700554", "chunk_id": "0021700554_011", "order": 11, "role": "body", "text": "\"Chris (Paul) did a great job of getting me going early,\" Green said. \"My rhythm felt really good and I was able to knock down shots."}
{"game_id": "0021700554", "chunk_id": "0021700554_012", "order": 12, "role": "body", "text": "\"Everybody knows we can score, but people underestimate that when we do lock down, we lock down. Today made that point. We held them to 12 points in the first quarter.\""}
{"game_id": "0021700554", "chunk_id": "0021700554_013", "order": 13, "role": "body", "text": "Houston shot 44 percent (15 for 34) from 3-point range while Orlando shot 19 percent (6 for 31)."}
{"game_id": "0021700554", "chunk_id": "0021700554_014", "order": 14, "role": "body", "text": "\"When you're not making shots, everything in the game gets harder,\" noted Magic coach Frank Vogel. \"You press a little bit more, your focus on the defensive end slips a little more and we've got to overcome that.\""}
{"game_id": "0021700554", "chunk_id": "0021700554_016", "order": 16, "role": "body", "text": "The Rockets are well on their way to breaking their own records, set last season, for 3-point attempts (40.3 per game) and 3-pointers made (14.4 per game). \"I don't go out and tell a guy we've got to get 45 threes up,\" D'Antoni said. \"I don't care. It could be 20. Depends on how the other team plays you. But we will not run a play that is set up to get a 15-foot shot.\""}
{"game_id": "0021700554", "chunk_id": "0021700554_018", "order": 18, "role": "body", "text": "Rockets: The game was only the third missed by Harden in the last four seasons. ... After getting 10 points and five rebounds, Nene left the game with a bruised right knee."}
{"game_id": "0021700554", "chunk_id": "0021700554_019", "order": 19, "role": "body", "text": "Magic: F Jonathon Simmons left the game in the second quarter with back spasms and did not return."}
{"game_id": "0021700554", "chunk_id": "0021700554_021", "order": 21, "role": "body", "text": "Rockets: Host Golden State on Thursday night."}
{"game_id": "0021700554", "chunk_id": "0021700554_022", "order": 22, "role": "body", "text": "Magic: Host Cleveland on Saturday night."}
{"game_id": "0021700554", "chunk_id": "0021700554_024", "order": 24, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
