{"game_id": "0021700411", "chunk_id": "0021700411_001", "order": 1, "role": "lead", "text": "PHOENIX --  DeMar DeRozan had already matched his season high with 37 points. With his team up four in the closing seconds, he was needed on the defensive end."}
{"game_id": "0021700411", "chunk_id": "0021700411_002", "order": 2, "role": "body", "text": "DeRozan forced T.J. Warren to take a difficult one-handed floater from 12 feet out, and with the miss the Toronto Raptors sealed a 115-109 victory over the Phoenix Suns on Wednesday night."}
{"game_id": "0021700411", "chunk_id": "0021700411_003", "order": 3, "role": "body", "text": "\"I'm just understanding tendencies,\" DeRozan said. \"We did a great job, we got the rebound and we made our free throws.\""}
{"game_id": "0021700411", "chunk_id": "0021700411_004", "order": 4, "role": "body", "text": "The Raptors have won seven of eight, and at 18-8 tied the second-best start in team history through 26 games."}
{"game_id": "0021700411", "chunk_id": "0021700411_005", "order": 5, "role": "body", "text": "DeRozan scored 18 points in the third quarter and Toronto led by as many as 15 before the Suns rallied in the fourth."}
{"game_id": "0021700411", "chunk_id": "0021700411_006", "order": 6, "role": "body", "text": "\"It was on the starters and myself to come out (of halftime) with that energy and try to get us going,\" DeRozan said."}
{"game_id": "0021700411", "chunk_id": "0021700411_007", "order": 7, "role": "body", "text": "Toronto was 3-1 on its four-game trip. Phoenix has lost five straight and seven of eight -- the last four losses with star guard Devin Booker sidelined by a groin injury."}
{"game_id": "0021700411", "chunk_id": "0021700411_008", "order": 8, "role": "body", "text": "Serge Ibaka had 21 points and 13 rebounds, and Jonas Valanciunas added 20 points and 11 rebounds for the Raptors."}
{"game_id": "0021700411", "chunk_id": "0021700411_009", "order": 9, "role": "body", "text": "\"JV (Valanciunas) was rolling to the basket, getting what he wanted,\" Raptors coach Dwane Casey said. \"We just felt we needed rebounding.\""}
{"game_id": "0021700411", "chunk_id": "0021700411_010", "order": 10, "role": "body", "text": "Valanciunas said his job is simple. \"It doesn't matter which spot on the court I'm in. They pay me to fight for the rebounds,\" he said."}
{"game_id": "0021700411", "chunk_id": "0021700411_011", "order": 11, "role": "body", "text": "Troy Daniels led the Suns with a season-high 32 points on 11-of-16 shooting, including 7 of 10 on 3-pointers. His 3 with 11:12 to go in the fourth quarter and short jumper moments later cut the Raptors' lead to 92-87, and the Suns took advantage of a long scoring drought for the Raptors to pull within three with 9:22 left."}
{"game_id": "0021700411", "chunk_id": "0021700411_012", "order": 12, "role": "body", "text": "\"My teammates were finding me.  I had a couple go in early which is very important and then the rest were just falling,\" Daniels said. \"Even the ones I miss I think they are going in. I think as a shooter you have to think like that.\""}
{"game_id": "0021700411", "chunk_id": "0021700411_013", "order": 13, "role": "body", "text": "The Suns got as close as 111-109 with 22 seconds to play when Daniels knocked down a 17-footer. But DeRozan and Kyle Lowry each hit a pair of free throws in the final seconds."}
{"game_id": "0021700411", "chunk_id": "0021700411_014", "order": 14, "role": "body", "text": "Greg Monroe added 17 points and 11 rebounds for Phoenix, and Warren had 17 points."}
{"game_id": "0021700411", "chunk_id": "0021700411_015", "order": 15, "role": "body", "text": "The Suns went ahead 46-43 midway through the second quarter on the third 3-pointer of the night for Daniels, who scored 14 first-half points. The Raptors finished the half on a 15-6 run to take a 58-52 lead."}
{"game_id": "0021700411", "chunk_id": "0021700411_016", "order": 16, "role": "body", "text": "\"Tried to keep him on the floor as much as we can,\" Suns coach Jay Triano said of Daniels. \"He's got an NBA skill of being able to really shoot the basketball and it's good to see him have a great night.\""}
{"game_id": "0021700411", "chunk_id": "0021700411_017", "order": 17, "role": "body", "text": "Toronto went up 79-68 on Ibaka's 3 with 5:24 left in the third. Lowry's first field goal of the game came at 3:56, when his 3 made it 82-68. Lowry missed his first five shots before that."}
{"game_id": "0021700411", "chunk_id": "0021700411_019", "order": 19, "role": "body", "text": "Suns center Alex Len leaped and grabbed a first-quarter shot from DeRozan that was on its descent. The ball was nowhere near going through the hoop, but Len was whistled for defensive goaltending and DeRozan was fouled on the shot, scoring a three-point play."}
{"game_id": "0021700411", "chunk_id": "0021700411_021", "order": 21, "role": "body", "text": "Raptors: C Lucas Nogueira (right calf injury) and G Delon Wright (right shoulder) did not play. ... The Raptors swept the season series for the first time since the 2012-13 season. ... DeRozan has 86 career 30-point games, second-most in franchise history behind Vince Carter's 91."}
{"game_id": "0021700411", "chunk_id": "0021700411_022", "order": 22, "role": "body", "text": "Suns: Phoenix signed G Isaiah Canaan after receiving an injury hardship exemption from the NBA, with six players inactive Wednesday. Canaan, in his fifth NBA season, did not play.  ... C Tyson Chandler was not with the team, the second time in a week he missed a game for personal reasons. ... Triano, the first Canadian-born head coach in NBA history, was the Raptors coach from 2008-11 and was an assistant with Toronto from 2002-08."}
{"game_id": "0021700411", "chunk_id": "0021700411_024", "order": 24, "role": "body", "text": "The Suns (9-21) matched their longest losing streak of the season at five games."}
{"game_id": "0021700411", "chunk_id": "0021700411_025", "order": 25, "role": "body", "text": "Guard Tyler Ulis was asked if efforts to come back like Wednesday's will lead to wins."}
{"game_id": "0021700411", "chunk_id": "0021700411_026", "order": 26, "role": "body", "text": "\"We are tired of saying that. We are tired of hearing that,\" Ulis said. \"We want to get some wins. We are going out there fighting and playing our hearts out. We just want to come up with a couple.\""}
{"game_id": "0021700411", "chunk_id": "0021700411_029", "order": 29, "role": "body", "text": "Suns: At Minnesota on Friday night."}
{"game_id": "0021700411", "chunk_id": "0021700411_031", "order": 31, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
