{"game_id": "0021201087", "chunk_id": "0021201087_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Jrue Holiday kept shooting until they fell in."}
{"game_id": "0021201087", "chunk_id": "0021201087_002", "order": 2, "role": "body", "text": "Holiday scored nine straight points down the stretch, Evan Turner finished with 21 and the Philadelphia 76ers beat the Charlotte Bobcats 100-92 on Saturday night."}
{"game_id": "0021201087", "chunk_id": "0021201087_003", "order": 3, "role": "body", "text": "After going 1 for 9 in the first three quarters and starting 2 for 13, Holiday got 11 of his 14 points in the fourth to help the Sixers win for the seventh time in 11 games."}
{"game_id": "0021201087", "chunk_id": "0021201087_004", "order": 4, "role": "body", "text": "\"When it comes down to it in the crucial moments, I think my team has a lot of faith in me,\" Holiday said. \"They encouraged me to make plays to close out the game.\""}
{"game_id": "0021201087", "chunk_id": "0021201087_005", "order": 5, "role": "body", "text": "Spencer Hawes had 19 points and Thaddeus Young and Damien Wilkins each scored 15 for Philadelphia."}
{"game_id": "0021201087", "chunk_id": "0021201087_006", "order": 6, "role": "body", "text": "Michael Kidd-Gilchrist had 21 for Charlotte, which has the worst record in the NBA. Gerald Henderson, who had 35 and 34 in his previous two games, finished with 19."}
{"game_id": "0021201087", "chunk_id": "0021201087_007", "order": 7, "role": "body", "text": "The Sixers had lost 31 straight games when their opponent shot at least 50 percent. The Bobcats were 38 for 76 from the floor."}
{"game_id": "0021201087", "chunk_id": "0021201087_008", "order": 8, "role": "body", "text": "\"When you come out of games like this, you emphasize what you did well,\" Bobcats coach Mike Dunlap said. \"We played well on both sides. Give Philadelphia credit.\""}
{"game_id": "0021201087", "chunk_id": "0021201087_009", "order": 9, "role": "body", "text": "Former Sixers star Allen Iverson came out to a rousing ovation before the opening tip on a night fans received his bobblehead doll. Wearing a Phillies zip-up jacket, cap and black sunglasses, Iverson high-fived fans in the front row. The former NBA MVP sat in a suite and waved to the crowd after a video tribute highlighting his career was shown in the second quarter."}
{"game_id": "0021201087", "chunk_id": "0021201087_010", "order": 10, "role": "body", "text": "The Sixers are a long way from Iverson's glory days. They entered the season with high expectations after the acquisition of Andrew Bynum, but he didn't play one game because of knee injuries and the Sixers are five losses away from playoff elimination."}
{"game_id": "0021201087", "chunk_id": "0021201087_011", "order": 11, "role": "body", "text": "Royal Ivey hit a 3-pointer to give the Sixers an 82-80 lead near the midpoint of the fourth quarter and they never trailed again. Holiday sliced through the lane and threw down a left-handed jam over Bismack Biyombo and Josh McRoberts to extend the lead to 91-84."}
{"game_id": "0021201087", "chunk_id": "0021201087_012", "order": 12, "role": "body", "text": "\"That gave us juice,\" Sixers coach Doug Collins said of the dunk."}
{"game_id": "0021201087", "chunk_id": "0021201087_013", "order": 13, "role": "body", "text": "Kemba Walker answered with consecutive baskets to get the Bobcats within 91-88. Holiday then nailed a jumper and added a layup to make it 95-90."}
{"game_id": "0021201087", "chunk_id": "0021201087_014", "order": 14, "role": "body", "text": "\"He closed the game out,\" Turner said. \"He's our All-Star. He did what he's supposed to. He did as he should.\""}
{"game_id": "0021201087", "chunk_id": "0021201087_015", "order": 15, "role": "body", "text": "Down 11 early in the second quarter, the Sixers reeled off 11 straight points. Ivey's 3-pointer tied it at 33. Hawes hit a 3 a few minutes later for a 46-42 lead and Philadelphia was up three at halftime."}
{"game_id": "0021201087", "chunk_id": "0021201087_016", "order": 16, "role": "body", "text": "Charlotte took a 13-point lead in the first quarter following an 11-2 run. Kidd-Gilchrist had seven of those points, including a dunk to finish it off."}
{"game_id": "0021201087", "chunk_id": "0021201087_017", "order": 17, "role": "body", "text": "The Pargo brothers -- Charlotte's Jannero and Philadelphia's Jeremy -- didn't get to go 1-on-1. Jeremy didn't enter the game. Jannero had 11 points."}
{"game_id": "0021201087", "chunk_id": "0021201087_018", "order": 18, "role": "closing", "text": "Game notes In part one of the day/night doubleheader at the Wells Fargo Center, the Flyers beat the Boston Bruins 3-1 in an NHL game. ... The Sixers begin a four-game road trip at Charlotte on Wednesday. ... Flyers forward Wayne Simmonds and Phillies outfielders Ben Revere, Domonic Brown and John Mayberry Jr. also were in the crowd. ... Bobcats C Byron Mullens missed his second straight game because of a sore right ankle."}
