{"game_id": "0021401091", "chunk_id": "0021401091_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  The Portland Trail Blazers are beginning to regain their health, and the results are showing as they inch closer to their first division title in six years."}
{"game_id": "0021401091", "chunk_id": "0021401091_002", "order": 2, "role": "body", "text": "LaMarcus Aldridge had 32 points and 11 rebounds, and Portland beat the Denver Nuggets 120-114 on Saturday night for its third consecutive victory."}
{"game_id": "0021401091", "chunk_id": "0021401091_003", "order": 3, "role": "body", "text": "The Blazers increased their Northwest Division lead to 6 1/2 games over second-place Oklahoma City, which lost to Utah 94-89. The Blazers have 10 games remaining in the regular season, the Thunder nine."}
{"game_id": "0021401091", "chunk_id": "0021401091_004", "order": 4, "role": "body", "text": "Less than a week ago, Portland briefly lost Aldridge, Nicolas Batum and Chris Kaman to injuries, adding to a season-ending loss of shooting guard Wesley Matthews. But the threesome is back, and so is Portland, having won three games during the past four days."}
{"game_id": "0021401091", "chunk_id": "0021401091_005", "order": 5, "role": "body", "text": "Any anxiety about blowing a big lead to Oklahoma City seems all but gone, as the Blazers' magic number to clinch the division title is four. Now it's Portland playing with confidence during an important part of the season."}
{"game_id": "0021401091", "chunk_id": "0021401091_006", "order": 6, "role": "body", "text": "\"These things are important, playing for playoff seeding and playing well in general,\" Blazers guard Arron Afflalo said."}
{"game_id": "0021401091", "chunk_id": "0021401091_007", "order": 7, "role": "body", "text": "\"Every win is a confidence booster and a momentum gainer for us. We all want to be playing our best basketball here in a few weeks.\""}
{"game_id": "0021401091", "chunk_id": "0021401091_008", "order": 8, "role": "body", "text": "Afflalo scored 21 points, Batum added 15 and Kaman 14 for the Blazers. Portland shot 56 percent (48 of 85) from the floor."}
{"game_id": "0021401091", "chunk_id": "0021401091_009", "order": 9, "role": "body", "text": "Aldridge shot 6 of 8 shot and scored 16 points during the third quarter to help Portland increase a five-point halftime lead to 86-78. Aldridge hit 13 of 20 shots in the game."}
{"game_id": "0021401091", "chunk_id": "0021401091_010", "order": 10, "role": "body", "text": "\"A good rhythm. My shot felt good. I was just trying to be a playmaker out there,\" Aldridge said."}
{"game_id": "0021401091", "chunk_id": "0021401091_011", "order": 11, "role": "body", "text": "Earlier in the week, Aldridge missed a game to rest a sore left thumb."}
{"game_id": "0021401091", "chunk_id": "0021401091_012", "order": 12, "role": "body", "text": "\"It still bothers me at times, but I've gotten used to it. I don't think it's anything that's been too much for me,\" Aldridge said."}
{"game_id": "0021401091", "chunk_id": "0021401091_013", "order": 13, "role": "body", "text": "Jameer Nelson scored 22 and Randy Foye 17 as Denver had seven players reach double figures."}
{"game_id": "0021401091", "chunk_id": "0021401091_014", "order": 14, "role": "body", "text": "Denver coach Melvin Hunt was upbeat after the loss, saying the Nuggets did many things well against Portland."}
{"game_id": "0021401091", "chunk_id": "0021401091_015", "order": 15, "role": "body", "text": "\"Our guys played terrific. We got better. I hated walking into the locker room and telling those guys, obviously it's a loss, but they played extremely hard,\" Hunt said."}
{"game_id": "0021401091", "chunk_id": "0021401091_016", "order": 16, "role": "body", "text": "Aldridge, who scored 14 points during the first half, hit two shots early in the third quarter to stake Portland to a 66-55 lead. Later in the quarter, Aldridge hit a 3-pointer as the shot clock expired, then converted a three-point play to push the Blazers' lead to 13."}
{"game_id": "0021401091", "chunk_id": "0021401091_017", "order": 17, "role": "body", "text": "Denver pulled to 101-98 on Nelson's 3-pointer with 5:36 left in the game. But the Blazers ran off seven consecutive points, with Batum's 3-pointer giving Portland a 10-point lead with 2:26 remaining."}
{"game_id": "0021401091", "chunk_id": "0021401091_020", "order": 20, "role": "body", "text": "Nuggets: Denver claimed guard Ian Clark, formerly of Utah, off waivers Saturday. The 6-foot-3 Clark, undrafted and in his second season in the NBA, averaged 1.9 points in 23 games this season for the Jazz. ... This is the first time Denver and Portland have played since making a five-player trade Feb. 19 that sent Afflalo and Alonzo Gee to the Blazers in exchange for Will Barton, Thomas Robinson and Victor Claver to the Nuggets. Only Barton remains on Denver's roster."}
{"game_id": "0021401091", "chunk_id": "0021401091_021", "order": 21, "role": "body", "text": "Trail Blazers: Portland swept the season series 4-0. The Blazers have won eight consecutive games against the Nuggets, last losing to Denver on April 14, 2013. ... Portland finished the second of two back-to-backs during a five-day stretch Saturday, winning three of the four games. ... Portland's magic number to clinch a playoff berth is one."}
{"game_id": "0021401091", "chunk_id": "0021401091_023", "order": 23, "role": "body", "text": "Afflalo shot 8 of 11 in his highest-scoring game since coming to Portland."}
{"game_id": "0021401091", "chunk_id": "0021401091_024", "order": 24, "role": "body", "text": "\"It's always fun. It just relaxes you a little bit to go out there and compete with guys you're familiar with,\" Afflalo said."}
{"game_id": "0021401091", "chunk_id": "0021401091_026", "order": 26, "role": "body", "text": "Foye hit four 3-pointers, two each during the second and third quarter, but played only two minutes in the fourth quarter, as Nelson took over. Hunt all but apologized about having to sideline Foye down the stretch, but said matchups dictated Nelson's presence in the game."}
{"game_id": "0021401091", "chunk_id": "0021401091_027", "order": 27, "role": "body", "text": "\"He made sacrifices for our team, and that goes a long way with me. He handled it like a pro, and I appreciate that,\" Hunt said."}
{"game_id": "0021401091", "chunk_id": "0021401091_029", "order": 29, "role": "body", "text": "Nuggets: Visit Sacramento on Wednesday."}
{"game_id": "0021401091", "chunk_id": "0021401091_030", "order": 30, "role": "closing", "text": "Trail Blazers: Host Phoenix on Monday."}
