{"game_id": "0021400829", "chunk_id": "0021400829_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- No matter how poorly the Los Angeles Lakers and Boston Celtics have played this season, they showed they can still produce a thriller no matter who is wearing the uniforms.\nJeremy Lin had a season-high 25 points, and the Lakers snapped a seven-game losing streak with a 118-111 overtime victory against their old rivals Sunday night.\nWesley Johnson added a season-high 22 points and Nick Young finished with 19, helping Los Angeles win for only the second time in 18 games. The other victory during that stretch came in double overtime at home against Chicago on Jan. 29."}
{"game_id": "0021400829", "chunk_id": "0021400829_002", "order": 2, "role": "closing", "text": "The Lakers haven't won in regulation since Jan. 9, when they beat Orlando 101-84 at Staples Center.\n\"We see how hard we have to play to win, and we see how everybody has to step their game up and contribute in a major way for us to compete against some of these teams,\" Carlos Boozer said.\nIsaiah Thomas, making his Celtics debut after Thursday's trade from Phoenix, scored 21 points in 25 minutes before he was ejected with 5:03 left in regulation and Boston trailing 91-87.\nCeltics guard Avery Bradley got eight of his 20 points in the final 27 seconds of the fourth quarter, including a buzzer-beating 3-pointer that sent the game to overtime. But the Lakers outscored the Celtics 12-5 in the extra period.\nJae Crowder led Boston with 22 points off the bench.\nThe game served as a reminder of how much these franchises have decayed in terms of personnel, and how far they've faded from the national spotlight -- which they shared during the 2008 and 2010 NBA Finals.\n\"I still look at them as a team that we would love to beat -- probably more than any other team in the league -- just because of the rivalry that we had in the `80s,\" said Lakers coach Byron Scott, who won four championship rings with Los Angeles as a player. \"It was probably the best rivalry in all of sports at that particular time. ... You're talking about two of the best franchises in all of sports.\"\nThe Celtics and Lakers have won a combined 33 championships, and they've met in the NBA Finals 12 times. But both teams have struggled the past three years.\n\"I think the NBA wants to see both these franchises get back to where they used to be,\" Scott said. \"I don't think those guys in the locker room and probably the guys in Boston's locker room understand the history of the rivalry between these two franchises and how great a rivalry it was. And that's unfortunate.\"\nThe Celtics took a 78-73 lead into the fourth, thanks in part to the 25 points they scored off 16 Lakers turnovers, but Johnson's 3-pointer put the Lakers ahead 85-84 lead with 8:15 remaining. Thomas and Young then traded 3s before Thomas picked up two technical fouls for disputing an offensive foul on the Celtics' next possession.\n\"Obviously, you need scorers on the floor late in the game. But that was the call that was made,\" Boston coach Brad Stevens said. \"We have to do a better job of handling our emotions.\"\nThe Lakers took full advantage of their sudden good fortune and pulled away to a 98-89 margin with 3:54 remaining, as Lin scored nine points during a 2:22 span of the fourth.\n\"Jeremy Lin killed us the whole night,\" Stevens said. \"He was really effective in a lot of ways -- not only scoring the ball, but also getting into the paint and making plays for others.\"\nThe Lakers couldn't close it out in regulation, however, as Bradley hit a 3 and a layup before forcing overtime with his fourth 3-pointer of the night.\n\"We have to be poised to win at the end of a game,\" Johnson said.\nTIP-INS\nCeltics: Tyler Zeller had 24 points and 14 rebounds against the Lakers in a 113-96 victory in Boston the last time the teams met. He scored eight points in the rematch. ... Evan Turner had 12 assists -- the first Celtics player to reach double digits since Dec. 21, when Turner had 11 against Sacramento. ... The Celtics are 2-7 against the Lakers since losing to them in seven games in the 2010 NBA Finals. ... Boston slipped to 0-10 when allowing its opponent at shoot 50 percent or better from the field. The Lakers ended up at 51.2 percent.\nLakers: Boozer made his first start since the Lakers' loss in Boston on Dec. 5. He had 12 points and eight rebounds in 28 minutes. ... The Lakers took their first lead, 43-42, after falling behind by nine.\nUP NEXT\nCeltics: At Phoenix on Monday.\nLakers: At Utah on Wednesday."}
