{"game_id": "0021401054", "chunk_id": "0021401054_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Detroit Pistons coach Stan Van Gundy still hasn't finished putting together his ideal roster."}
{"game_id": "0021401054", "chunk_id": "0021401054_002", "order": 2, "role": "body", "text": "He's got a very good idea of where to start, though."}
{"game_id": "0021401054", "chunk_id": "0021401054_003", "order": 3, "role": "body", "text": "Van Gundy's three young starters -- Reggie Jackson, Kentavious Caldwell-Pope and Andre Drummond -- dominated Tuesday's game against the Toronto Raptors."}
{"game_id": "0021401054", "chunk_id": "0021401054_004", "order": 4, "role": "body", "text": "Drummond had 21 points and 18 rebounds while Jackson and Caldwell-Pope combined for 54 points, 13 assists and 11 rebounds without a turnover in Detroit's 108-104 victory."}
{"game_id": "0021401054", "chunk_id": "0021401054_005", "order": 5, "role": "body", "text": "\"That is a very promising sign for the future, because it was the three young guys getting the job done tonight,\" Van Gundy said."}
{"game_id": "0021401054", "chunk_id": "0021401054_006", "order": 6, "role": "body", "text": "The Pistons are expected to lose power forward Greg Monroe in free agency this summer, but they have now won four of the last five games while Monroe has been sidelined by a knee injury."}
{"game_id": "0021401054", "chunk_id": "0021401054_007", "order": 7, "role": "body", "text": "\"We're really playing hard, and we're starting to figure out each other's games,\" Drummond said. \"It's taken all year to get used to each other, but it is starting to come together.\""}
{"game_id": "0021401054", "chunk_id": "0021401054_008", "order": 8, "role": "body", "text": "Jackson has been the star of the five-game stretch, averaging 20.2 points and 12.2 assists. Against the Raptors, he had 28 points, nine assists and five rebounds."}
{"game_id": "0021401054", "chunk_id": "0021401054_009", "order": 9, "role": "body", "text": "\"We're finding different ways to attack,\" he said. \"Early on, we were hitting shots from the outside, so they didn't want to leave our wings open. When that happened, I was able to attack some seams.\""}
{"game_id": "0021401054", "chunk_id": "0021401054_010", "order": 10, "role": "body", "text": "DeMar DeRozan had 22 points and 10 rebounds for the Raptors, who lost point guard Kyle Lowry to back spasms in the second quarter."}
{"game_id": "0021401054", "chunk_id": "0021401054_011", "order": 11, "role": "body", "text": "\"I twisted the wrong way and it gave out,\" said Lowry, who had missed the previous two games with a similar problem. \"It's probably the same injury, so I'm going to have to take my time and get it right.\""}
{"game_id": "0021401054", "chunk_id": "0021401054_012", "order": 12, "role": "body", "text": "Toronto took a 91-90 lead with 5:41 left, but Detroit scored the next seven points, including Caldwell-Pope's fifth 3-pointer of the night. Toronto, though, came back to tie the game at 99 on a Lou Williams 3-pointer with 2:35 to play, and then took the lead on Patrick Patterson's three-point play."}
{"game_id": "0021401054", "chunk_id": "0021401054_013", "order": 13, "role": "body", "text": "Two Jackson free throws and a running hook by Tayshaun Prince made it 105-102 Pistons with a minute to play, and Williams missed a 3-pointer with 1.6 seconds left to give Detroit the win."}
{"game_id": "0021401054", "chunk_id": "0021401054_014", "order": 14, "role": "body", "text": "\"We had just scored on the same play -- a high pick-and-roll -- but for whatever reason, Lou didn't use it,\" Raptors coach Dwane Casey said. \"I probably could have called a timeout with six seconds left, but I thought Lou was going to attack.\""}
{"game_id": "0021401054", "chunk_id": "0021401054_015", "order": 15, "role": "body", "text": "The Raptors struggled badly on both ends of the floor in the first half, hitting just one of 10 3-point attempts while the Pistons were shooting 47.4 percent from behind the arc and 48.9 overall. Caldwell-Pope had 18 points in 18 first-half minutes, including three 3-pointers."}
{"game_id": "0021401054", "chunk_id": "0021401054_016", "order": 16, "role": "body", "text": "\"That was just a lack of focus,\" Casey said. \"It was a lack of intelligence in reading situations and understanding who should be rotating. We have to be better.\""}
{"game_id": "0021401054", "chunk_id": "0021401054_017", "order": 17, "role": "body", "text": "Caldwell-Pope left the game early in the third after taking a knee to the thigh while trying to get around an Amir Johnson pick, but returned later in the period. By that point, Detroit had expanded its lead to 79-64, with Jackson and Drummond having scored all 19 Pistons points."}
{"game_id": "0021401054", "chunk_id": "0021401054_018", "order": 18, "role": "body", "text": "Toronto narrowed the gap to 85-75 by quarter's end, then scored the first five points of the fourth to force a Stan Van Gundy timeout after only 54 seconds. After the timeout, Drummond scored on his second put-back attempt of the possession, and Caldwell-Pope hit a 3-pointer to put the Pistons back up by 10."}
{"game_id": "0021401054", "chunk_id": "0021401054_019", "order": 19, "role": "body", "text": "The Raptors, playing in front of what was essentially a home crowd, came back again and took a 91-90 lead on DeRozan's jumper, setting up the back-and-forth finish."}
{"game_id": "0021401054", "chunk_id": "0021401054_021", "order": 21, "role": "body", "text": "Raptors: For the second time this season, Toronto fans outnumbered Pistons fans at the Palace. The crowd was so partisan this time that when national-anthem singer LaShell Renee's microphone cut out during the Canadian national anthem, she was able to let the crowd continue the song before joining back in at the start of the next line."}
{"game_id": "0021401054", "chunk_id": "0021401054_022", "order": 22, "role": "body", "text": "Pistons: Shawne Williams returned after missing the last two games with an illness, giving the Pistons two power forwards once again. While Monroe and Williams were both out, Tayshaun Prince had been backing up Tolliver, forcing Van Gundy to play very small lineups. Prince, though, finished the game at power forward after Tolliver fouled out."}
{"game_id": "0021401054", "chunk_id": "0021401054_024", "order": 24, "role": "body", "text": "Raptors: Host the Bulls on Wednesday."}
{"game_id": "0021401054", "chunk_id": "0021401054_025", "order": 25, "role": "closing", "text": "Pistons: Visit the Magic on Friday."}
