{"game_id": "0021700421", "chunk_id": "0021700421_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Russell Westbrook said goodbye to a three-overtime thriller and trolled Joel Embiid with a smile and a wave."}
{"game_id": "0021700421", "chunk_id": "0021700421_002", "order": 2, "role": "body", "text": "\"I was telling him, `Go home,\" Westbrook said."}
{"game_id": "0021700421", "chunk_id": "0021700421_003", "order": 3, "role": "body", "text": "Embiid irked Westbrook earlier in the game when the 76ers' social media star waved goodbye toward the crowd once Oklahoma City center Steven Adams fouled out. Westbrook got the last laugh, and capped his triple-double, 52-minute effort with the final assist of the game, and the Thunder pulled out a 119-117 victory on Friday night."}
{"game_id": "0021700421", "chunk_id": "0021700421_004", "order": 4, "role": "body", "text": "The early contender for NBA game of the year was led by perhaps the game of Embiid's career. Embiid scored 34 points in 49 minutes with an achy back, saved the game in the first overtime with a block on Westbrook and trash talked Carmelo Anthony."}
{"game_id": "0021700421", "chunk_id": "0021700421_005", "order": 5, "role": "body", "text": "He waved his arms and exhorted the crowd to get louder with each chant of \"Trust the Process!\""}
{"game_id": "0021700421", "chunk_id": "0021700421_006", "order": 6, "role": "body", "text": "\"I'm not about to get in a back-and-forth with him,\" Westbrook said. \"I'm not about to give him my energy.\""}
{"game_id": "0021700421", "chunk_id": "0021700421_007", "order": 7, "role": "body", "text": "Westbrook had an off night from the floor (10 of 33; missed a driving dunk at the end of regulation), yet finished with 27 points, 17 rebounds and 15 assists. He even saved Andre Roberson from goat status in the third OT. Roberson failed to even look at the basket and then missed a layup in a stunning sequence to close the second OT, then earned redemption when Westbrook fed him for the winner with 10 seconds left in the game."}
{"game_id": "0021700421", "chunk_id": "0021700421_008", "order": 8, "role": "body", "text": "\"Just trusting it,\" Westbrook said."}
{"game_id": "0021700421", "chunk_id": "0021700421_009", "order": 9, "role": "body", "text": "It's a twist on the Sixers catchphrase popularized during Embiid's absence over his first two seasons with injuries."}
{"game_id": "0021700421", "chunk_id": "0021700421_010", "order": 10, "role": "body", "text": "Embiid, Philly's franchise center, grabbed his lower back when he took a hard foul on a drive to the basket in the fourth quarter. Embiid grimaced during timeouts on the bench and trudged into position a few times."}
{"game_id": "0021700421", "chunk_id": "0021700421_011", "order": 11, "role": "body", "text": "Embiid, who said he just needed treatment, brushed off Westbrook's wave and took a shot at the Thunder guard's stats."}
{"game_id": "0021700421", "chunk_id": "0021700421_012", "order": 12, "role": "body", "text": "\"They did a lot of things. But, I mean, the dude shot 10 for 33. I wish I would had shot 33 times. I guess we would have had a better chance of actually winning the game,\" Embiid said \"But he told me to go home. This is my home. I ain't going nowhere.\""}
{"game_id": "0021700421", "chunk_id": "0021700421_013", "order": 13, "role": "body", "text": "Embiid sucked it up and carried the Sixers in the fourth and the first overtime. His feed to a charging Ben Simmons on the baseline for a two-handed dunk tied the score at 94-all with 53 seconds left in the quarter. The Sixers closed the fourth on an 11-0 run."}
{"game_id": "0021700421", "chunk_id": "0021700421_014", "order": 14, "role": "body", "text": "Embiid scored the first bucket of OT and the Sixers led for the first time in the game. The Sixers' five-point lead with 1:20 left in overtime was wiped out on Paul George's 3-pointer and a Westbrook bucket that made it 102-all. The Sixers blew their final possession on an ill-conceived 3 for Dario Saric."}
{"game_id": "0021700421", "chunk_id": "0021700421_016", "order": 16, "role": "body", "text": "Westbrook and Robert Covington exchanged 3s and George tied it at 109 on a driving layup. Westbrook and Embiid swapped buckets that kept it even and the Sixers had one more chance to win it Embiid lost the ball late in the second OT."}
{"game_id": "0021700421", "chunk_id": "0021700421_017", "order": 17, "role": "body", "text": "Embiid and Westbrook combined to score eight straight points in the third overtime, and Embiid waved see-ya later when Adams fouled out of the game."}
{"game_id": "0021700421", "chunk_id": "0021700421_018", "order": 18, "role": "body", "text": "But Embiid seemed gassed at the end and there's no telling how the heavy workload may affect his availability the rest of the week."}
{"game_id": "0021700421", "chunk_id": "0021700421_019", "order": 19, "role": "body", "text": "The Sixers were featured on ESPN on Friday as part of Philadelphia All Access, and Sixers' related content was aired throughout the day on all platforms."}
{"game_id": "0021700421", "chunk_id": "0021700421_020", "order": 20, "role": "body", "text": "\"I'm not a fan,\" coach Brett Brown said. \"I like living behind closed doors.\""}
{"game_id": "0021700421", "chunk_id": "0021700421_021", "order": 21, "role": "body", "text": "But Brown understood the exposure would help build the brand and serve as a recruiting pitch of sorts to any free agents intrigued about becoming part of The Process. The Sixers put on a show in the fourth until Embiid gave them a scare."}
{"game_id": "0021700421", "chunk_id": "0021700421_022", "order": 22, "role": "body", "text": "Embiid's health woes have dogged him since his college career at Kansas and every slip, ache or bump throws Sixers fans into a panic. Embiid has been banged-up lately but he calmly went to the line after he smacked the court and made both free throws. He fell again when he tripped over Adams, who earned a foul, and sank two more free throws to make it 78-72."}
{"game_id": "0021700421", "chunk_id": "0021700421_024", "order": 24, "role": "body", "text": "Thunder: Roberson had missed two games with a sprained left ankle. ... Coach Billy Donovan was drilled in the face on an errant no-look pass -- as in, Donovan wasn't looking -- by Sixers forward Richaun Holmes."}
{"game_id": "0021700421", "chunk_id": "0021700421_025", "order": 25, "role": "body", "text": "76ers: F Robert Covington shot three airballs in the first half."}
{"game_id": "0021700421", "chunk_id": "0021700421_027", "order": 27, "role": "body", "text": "Carmelo Anthony warmed-up for his New York homecoming with 24 points. Anthony cracked the 20-point mark for only the second time in his last 10 games and perhaps gave Knicks fans a glimpse of what's ahead when he returns to Madison Square Garden on Saturday. Anthony had struggled headed into Friday's game, averaging just 17.7 points on 40 percent shooting. He made 11 of 17 shots."}
{"game_id": "0021700421", "chunk_id": "0021700421_028", "order": 28, "role": "body", "text": "\"I became entrenched into not just the Knicks but the city as a whole,\" Anthony said. \"Those are my roots. The people there, I became one of them. I've embraced New York City, I've embraced the culture.\""}
{"game_id": "0021700421", "chunk_id": "0021700421_030", "order": 30, "role": "body", "text": "Adams, Westbrook, JJ Redick and Simmons all played 50-plus minutes."}
{"game_id": "0021700421", "chunk_id": "0021700421_032", "order": 32, "role": "body", "text": "Thunder: It's Melo vs. the Knicks at MSG on Saturday."}
{"game_id": "0021700421", "chunk_id": "0021700421_033", "order": 33, "role": "body", "text": "76ers: Play Monday at Chicago."}
{"game_id": "0021700421", "chunk_id": "0021700421_035", "order": 35, "role": "closing", "text": "For more NBA coverage: https://apnedws.com/tag/NBAbasketball"}
