{"game_id": "0021200725", "chunk_id": "0021200725_001", "order": 1, "role": "lead", "text": "ATLANTA --  Hawks coach Larry Drew likes what he's seen lately from point guard Jeff Teague."}
{"game_id": "0021200725", "chunk_id": "0021200725_002", "order": 2, "role": "body", "text": "Teague had 22 points and a season-high 13 assists, Josh Smith added 19 points and 11 rebounds and Atlanta Hawks beat the Memphis Grizzlies 103-92 on Wednesday night."}
{"game_id": "0021200725", "chunk_id": "0021200725_003", "order": 3, "role": "body", "text": "\"He got off to a really good start in that first half, which really set the tone for the game,\" Drew said about Teague. \"You could see Memphis was laboring a little bit to get up and down. We were trying to put an emphasis on really pushing the basketball.\""}
{"game_id": "0021200725", "chunk_id": "0021200725_004", "order": 4, "role": "body", "text": "Al Horford finished with 17 points and 11 rebounds to help the Hawks snap a two-game skid."}
{"game_id": "0021200725", "chunk_id": "0021200725_005", "order": 5, "role": "body", "text": "Zach Randolph scored 20 points and Mike Conley added 17 as the Grizzlies lost their second straight."}
{"game_id": "0021200725", "chunk_id": "0021200725_006", "order": 6, "role": "body", "text": "Atlanta played without No. 2 center Zaza Pachulia, veteran guard DeShawn Stevenson and swingman Anthony Morrow, but still held the Grizzlies to 26.3 percent shooting in the third quarter."}
{"game_id": "0021200725", "chunk_id": "0021200725_007", "order": 7, "role": "body", "text": "\"I thought this was one of the better games we've played in a while,\" Hawks guard Kyle Korver said. \"Energy was high. We had some bad turnovers on the break, but I thought we were out and running and playing aggressive.\""}
{"game_id": "0021200725", "chunk_id": "0021200725_008", "order": 8, "role": "body", "text": "Memphis missed its first 13 shots from the field in the third before Randolph hit a 22-footer at the 6:26 mark, but the Grizzlies trailed by 19 and never recovered."}
{"game_id": "0021200725", "chunk_id": "0021200725_009", "order": 9, "role": "body", "text": "Beginning the game with the NBA's stingiest defense, Memphis allowed the Hawks to shoot a season-high 62.2 percent in the first half."}
{"game_id": "0021200725", "chunk_id": "0021200725_010", "order": 10, "role": "body", "text": "Grizzlies coach Lionel Hollins said he appreciated the effort his reserves made in closing the gap in the fourth, but credited the Hawks' ability to frustrate Memphis' defense."}
{"game_id": "0021200725", "chunk_id": "0021200725_011", "order": 11, "role": "body", "text": "\"They just did what they wanted with the pick-and-roll,\" Hollins said. \"And then we helped, over-helped, and guys were left open all over the court.\""}
{"game_id": "0021200725", "chunk_id": "0021200725_012", "order": 12, "role": "body", "text": "Atlanta committed seven turnovers in the second quarter but still led 58-45 on Teague's layup in the closing seconds."}
{"game_id": "0021200725", "chunk_id": "0021200725_013", "order": 13, "role": "body", "text": "Jerryd Bayless finished with 15 points and Marc Gasol had 14 points and 10 rebounds for Memphis."}
{"game_id": "0021200725", "chunk_id": "0021200725_014", "order": 14, "role": "body", "text": "\"Seemed like we had no emotion in the game,\" Grizzlies guard Tony Allen said. \"There was no griminess to it. There was no grittiness to it. Once they made plays, it was like we put our heads down.\""}
{"game_id": "0021200725", "chunk_id": "0021200725_015", "order": 15, "role": "body", "text": "The Hawks took their first double-digit lead at the 6:25 mark of the second when Teague's 3-pointer from the right corner made it 43-33."}
{"game_id": "0021200725", "chunk_id": "0021200725_016", "order": 16, "role": "body", "text": "Korver scored 12 points for Atlanta, which took its biggest lead at 23 on a free throw by Smith in the third."}
{"game_id": "0021200725", "chunk_id": "0021200725_017", "order": 17, "role": "body", "text": "Smith will try to extend his streak to five straight games with 10 rebounds when the Hawks host New Orleans on Friday. He considered the Hawks' work against Randolph a big part of the team's success."}
{"game_id": "0021200725", "chunk_id": "0021200725_018", "order": 18, "role": "body", "text": "Randolph, the NBA's second-leading rebounder, had seven boards, more than four below his average."}
{"game_id": "0021200725", "chunk_id": "0021200725_019", "order": 19, "role": "body", "text": "\"He's one player that will beat you up on both ends of the floor, offensively and defensively,\" Smith said. \"He's a big body, has soft hands and uses his positioning well in order to get offensive rebounds. I had to make a conscious effort to stay glued to him to limit his offensive rebounds and his touches on the ball.\""}
{"game_id": "0021200725", "chunk_id": "0021200725_020", "order": 20, "role": "body", "text": "Allen believes Memphis will regroup by watching film of its mistakes the last two games. The Grizzlies open a three-game homestand Friday against Golden State."}
{"game_id": "0021200725", "chunk_id": "0021200725_021", "order": 21, "role": "body", "text": "\"I don't think guys had the mindset to come out, seek and destroy,\" Allen said. \"Coach blamed it on the start, but personally I just think they outworked us and they outplayed us.\""}
{"game_id": "0021200725", "chunk_id": "0021200725_022", "order": 22, "role": "body", "text": "Much of that was due to Teague, who had nine points, five assists and no turnovers in the second quarter. He has scored at least 20 points in four of his last six games."}
{"game_id": "0021200725", "chunk_id": "0021200725_023", "order": 23, "role": "body", "text": "\"We were clicking on all cylinders,\" Teague said. \"Al was getting out and running, getting rebounds. Josh was getting out and leading the breaks, and guys were making shots.\""}
{"game_id": "0021200725", "chunk_id": "0021200725_024", "order": 24, "role": "closing", "text": "Game notes Pachulia missed his fourth straight game with a sore right Achilles. ... The Grizzlies dropped to 1-6 when opponents score at least 100 points. ... Drew usually doesn't play Stevenson, a 12th-year veteran, on back-to-back nights. Anthony Tolliver replaced Stevenson in the lineup, finishing with eight points and seven rebounds. \"He was constantly in (Tayshaun Prince's) face and had active hands,\" Drew said. \"Down in the post, I thought his length was very effective tonight.\" ... Atlanta G Devin Harris scored eight points after missing Tuesday's loss at Indiana with a sore left foot. ... Memphis is 5-2 on the road against Eastern Conference clubs this season. ... Both teams were playing for the second consecutive night."}
