{"game_id": "0021300702", "chunk_id": "0021300702_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  For one night, Nick Calathes provided a big reason to believe the Memphis Grizzlies might be able to withstand the loss of Mike Conley on a short-term basis."}
{"game_id": "0021300702", "chunk_id": "0021300702_002", "order": 2, "role": "body", "text": "Calathes, starting in place of the injured Conley, scored a career-high 22 points and the surging Grizzlies defeated the Milwaukee Bucks 99-90 on Saturday."}
{"game_id": "0021300702", "chunk_id": "0021300702_003", "order": 3, "role": "body", "text": "\"Mike must have touched (Calathes') hand or given him a good-luck touch because that man was shooting the lights out of that ball,\" said Memphis reserve forward James Johnson, who had 14 points. \"For him to come in and do that was huge for us. We needed that.\""}
{"game_id": "0021300702", "chunk_id": "0021300702_004", "order": 4, "role": "body", "text": "Zach Randolph had 23 points and 10 rebounds for Memphis, which has won a season-best six straight and 11 of 12 overall. Marc Gasol scored 19."}
{"game_id": "0021300702", "chunk_id": "0021300702_005", "order": 5, "role": "body", "text": "Brandon Knight led Milwaukee with 23 points, including 18 in the second half. He also had seven assists and six rebounds."}
{"game_id": "0021300702", "chunk_id": "0021300702_006", "order": 6, "role": "body", "text": "Ersan Ilyasova finished with 14 points and 13 rebounds for the Bucks, who have lost six in a row. Khris Middleton scored 12 points, while Larry Sanders and Caron Butler finished with 10 each."}
{"game_id": "0021300702", "chunk_id": "0021300702_007", "order": 7, "role": "body", "text": "Milwaukee had a lead for most of the first three quarters but it slipped away in the fourth."}
{"game_id": "0021300702", "chunk_id": "0021300702_008", "order": 8, "role": "body", "text": "\"In the fourth quarter, we got down by a margin of five,\" Knight said. \"We were able to keep it there for a little bit, and then it went to 10. From that point, it was tough to really get in a rhythm.\""}
{"game_id": "0021300702", "chunk_id": "0021300702_009", "order": 9, "role": "body", "text": "The Grizzlies were playing their first game without Conley, the starting point guard who sprained his ankle in Friday night's win at Minnesota. The team announced before the game that Conley will miss at least a week."}
{"game_id": "0021300702", "chunk_id": "0021300702_010", "order": 10, "role": "body", "text": "Even Conley recognized the team's effort, tweeting praise to Calathes after the game with the hashtag \"WinWithoutMike.\""}
{"game_id": "0021300702", "chunk_id": "0021300702_011", "order": 11, "role": "body", "text": "Memphis shot 56 percent in the second half and outscored the Bucks 56-41. Calathes made all three of his shots from outside the arc."}
{"game_id": "0021300702", "chunk_id": "0021300702_012", "order": 12, "role": "body", "text": "\"We played 2 1/2 good quarters, we just didn't finish it,\" Bucks coach Larry Drew said, later adding: \"We had the energy in the first half, but in the second half we didn't, particularly in the third quarter.\""}
{"game_id": "0021300702", "chunk_id": "0021300702_013", "order": 13, "role": "body", "text": "Calathes not only set career highs for points and minutes (40), he shot 8 of 12 in the game and 4 for 5 from 3-point range without committing a turnover. His previous high was 11 points against Houston on Jan. 25."}
{"game_id": "0021300702", "chunk_id": "0021300702_014", "order": 14, "role": "body", "text": "Several of his 3-point attempts in this one were uncontested."}
{"game_id": "0021300702", "chunk_id": "0021300702_015", "order": 15, "role": "body", "text": "\"I think they were giving up my shot, and I made them pay for it,\" Calathes said."}
{"game_id": "0021300702", "chunk_id": "0021300702_016", "order": 16, "role": "body", "text": "But he also recognized the importance of not turning the ball over while trying to get the Grizzlies' offense running through the frontline tandem of Gasol and Randolph."}
{"game_id": "0021300702", "chunk_id": "0021300702_017", "order": 17, "role": "body", "text": "\"I think that was the biggest stat of the night for me, not turning the ball over,\" Calathes said. \"I came into the game telling myself, `Don't make a crazy play. Don't try to go overboard.\""}
{"game_id": "0021300702", "chunk_id": "0021300702_018", "order": 18, "role": "body", "text": "Memphis struggled early but outscored the Bucks 46-32 in the paint and outrebounded Milwaukee 48-38. The Grizzlies also went 6 of 10 beyond the arc, their best percentage in a game this season."}
{"game_id": "0021300702", "chunk_id": "0021300702_019", "order": 19, "role": "body", "text": "The Bucks held a 13-point lead in the first half. Knight scored nine in the third, but Memphis began to make a push at the end of the period -- even adding a point after it was over when officials reviewed a shot by Mike Miller and ruled it a 3. That left Milwaukee with a 69-67 lead entering the fourth."}
{"game_id": "0021300702", "chunk_id": "0021300702_020", "order": 20, "role": "body", "text": "Memphis finally erased the deficit early in the final quarter, opening with a 16-4 rally to build its first double-digit lead of the night."}
{"game_id": "0021300702", "chunk_id": "0021300702_021", "order": 21, "role": "body", "text": "Calathes sparked the burst with a trio of 3-pointers, the third one coming with 3:14 left for a 90-78 lead that Memphis never relinquished."}
{"game_id": "0021300702", "chunk_id": "0021300702_022", "order": 22, "role": "body", "text": "\"It is hard to play 41 minutes,\" Grizzlies coach Dave Joerger said of Calathes. \"He has the ball in his hands a lot. Wow, what a great performance.\""}
{"game_id": "0021300702", "chunk_id": "0021300702_023", "order": 23, "role": "closing", "text": "Game notes Conley missed two previous games this season with a bruised left thigh. ... Bucks C Zaza Pachulia returned after missing 28 games with a broken right foot. ... The Grizzlies used their 14th starting lineup of the season."}
