{"game_id": "0021300426", "chunk_id": "0021300426_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- LaMarcus Aldridge wasn't even sure he was going to play against the Clippers.\nPortland's top scorer and rebounder had his wisdom teeth removed Sunday. So on Thursday night, he was still in some pain. Worse, he hadn't had much to eat. But Aldridge came out and had 32 points and 10 rebounds for the Trail Blazers in a 116-112 overtime victory over the Clippers.\n\"I've had nothing but soup for the last four days,\" he said. \"So I was a little worried about my energy levels.\""}
{"game_id": "0021300426", "chunk_id": "0021300426_002", "order": 2, "role": "closing", "text": "In the end, he didn't even have a turnover as the surprising Blazers upped their record to an NBA-best 24-5. Portland has won seven of its past eight games, and the Blazers have dropped just two at home this season.\nThe Clippers, playing the second game of a back-to-back, mounted a challenge after trailing by as many as 11 points in the fourth quarter. Blake Griffin had 35 points and 11 rebounds, while Chris Paul finished with 34 points and 16 assists.\nAldridge hit a fadeaway with 39 seconds left in overtime, and Portland went ahead 110-109.\nGriffin missed a layup on the other end before Nicolas Batum made a pair of free throws to make it 112-109 with 26.5 seconds to go. After Griffin dunked to narrow it again, Damian Lillard made two free throws for Portland.\nPortland clung to a 114-112 lead with 13.4 seconds left and padded it with Wesley Matthews' foul shots. Paul missed a 3-point attempt as time ran out.\nAldridge scored all of Portland's field goals in overtime, and finished with his ninth game this season with at least 25 points and 10 rebounds, second only to Minnesota's Kevin Love.\nAs for his teeth? \"It's a little bit throbbing,\" he said, shrugging.\nIt was the second of back-to-back losses for the Clippers. Earlier Thursday, the NBA said its referees made a mistake when they ejected Griffin in the team's 105-103 loss to the Warriors on Wednesday night.\nGriffin got his second technical with 10:43 left after scuffling with Andrew Bogut, following Warriors forward Draymond Green to the showers after they got into it at the end of the third.\n\"A common foul should have been called on Griffin for initially attempting to dislodge the Warriors' Andrew Bogut and a technical foul should have been assessed to Bogut for grabbing Griffin by the shirt and wrestling with him,\" Rod Thorn, the NBA's president of basketball operations, said in a statement.\nClippers coach Doc Rivers said he thought Griffin handled the situation well.\n\"Everyone is a target at some point in their career,\" Rivers said. \"You just have to play through it.\"\nIt was the second ejection for the Clippers in as many games. Forward Matt Barnes was ejected with 56 seconds left in the third quarter of a 120-116 OT win over the Minnesota Timberwolves on Sunday night. Barnes fouled Love.\n\"It's a long season. We're in a bad ejection rut right now,\" Rivers said. \"We'll get out of it.\"\nNo one got tossed Thursday.\nMo Williams made back-to-back 3s to give Portland a 34-22 lead in the first half. The Clippers responded with a 9-0 run to close to 34-31, but Aldridge scored six straight points in an 8-2 run and Portland stretched the margin to 42-33.\nPaul's 3-pointer closed the Clippers to within 47-46 at the intermission.\nDorell Wright hit a 3-pointer that gave the Blazers an 84-75 lead early in the fourth quarter.\nBut the Clippers clawed back in, and Paul's pull-up jumper made it 97-96 for Los Angeles' first lead of the second half. After Aldridge's tip-in, Paul added another jumper to give the Clippers a 99-98 lead, then nailed a step-back 21-footer from the corner with 9.3 seconds left.\nUndaunted, Batum hit a 3-pointer to tie it at 101 with 5.3 seconds to go. Paul missed a 17-footer to send the game into overtime.\n\"I got right where I wanted to -- I probably tricked myself too much, I don't even know if they had a foul to give,\" Paul said. \"And with five seconds left, I think I went a little too quick because I thought they were going to try and use one of their fouls. I didn't think I would end up as wide open as I was -- I've got to make that shot. \"\nGame notes\nThe game was the first of three meetings between the two teams this season. The Clippers claimed last season's series 3-1. ... The Clippers' 14 first-quarter points are the fewest they've scored in the first quarter. ... DeAndre Jordan finished with 19 rebounds before fouling out in overtime. ... Barnes also fouled out in OT."}
