{"game_id": "0021700384", "chunk_id": "0021700384_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  The NBA's hottest team has found a home on the road."}
{"game_id": "0021700384", "chunk_id": "0021700384_002", "order": 2, "role": "body", "text": "Houston won its ninth consecutive game after James Harden scored 48 points and the Rockets rallied from 14-point, fourth-quarter deficit to beat the Portland Trail Blazers 124-117 on Saturday night."}
{"game_id": "0021700384", "chunk_id": "0021700384_003", "order": 3, "role": "body", "text": "The Rockets, who trailed for most of the game, won their eighth consecutive road game, running their season road record to 12-1. It is Houston's best road start since the 1996-97 season."}
{"game_id": "0021700384", "chunk_id": "0021700384_004", "order": 4, "role": "body", "text": "Harden hit 16 of 29 shots and grabbed eight rebounds, while Chris Paul scored 24 points and Trevor Ariza had 13 for Houston. The Rockets' 20-4 record is the best by percentage in the NBA this season."}
{"game_id": "0021700384", "chunk_id": "0021700384_005", "order": 5, "role": "body", "text": "\"We're riding high right now. That's great. We know we'll have some bumps. We have a lot of things to figure out, but we just keep getting better and grinding it out,\" Houston coach Mike D'Antoni said."}
{"game_id": "0021700384", "chunk_id": "0021700384_006", "order": 6, "role": "body", "text": "Houston took a good punch from Portland, which was trying to end a three-game home court losing streak. Damian Lillard tied a franchise record with nine 3-pointers and scored 35 points, while C.J. McCollum had 28 for the Blazers (13-12)."}
{"game_id": "0021700384", "chunk_id": "0021700384_007", "order": 7, "role": "body", "text": "\"It was disappointing to lose. . We had a lot of good efforts from a lot of different players. It was good to be in a game at the end against a really good team,\" Portland coach Terry Stotts said."}
{"game_id": "0021700384", "chunk_id": "0021700384_008", "order": 8, "role": "body", "text": "Houston hasn't had a close game in a while, particularly with Paul returning to action from an early season knee injury. That changed Saturday as Portland built a 98-84 lead after three quarters, though Lillard started the fourth quarter with an ice bag on his right foot after limping to the bench."}
{"game_id": "0021700384", "chunk_id": "0021700384_009", "order": 9, "role": "body", "text": "Houston went to a small lineup, and punished Portland's defense with 1-on-1 offense. The Rockets hit 15 of 18 shots, and Harden and Paul combined to score 25 of the team's 40 fourth-quarter points."}
{"game_id": "0021700384", "chunk_id": "0021700384_010", "order": 10, "role": "body", "text": "\"Me and James were talking about how cool it was. I went a few times and then he got to go a few times. It was fun that we got to play off of each other like that,\" Paul said."}
{"game_id": "0021700384", "chunk_id": "0021700384_011", "order": 11, "role": "body", "text": "Harden went 6 of 7 during the fourth quarter, including five layups."}
{"game_id": "0021700384", "chunk_id": "0021700384_012", "order": 12, "role": "body", "text": "\"We went small and they had to adjust to us . once they did that, we had shooters on the court and the lane was wide open. So it was layup, layup, layup, 3-ball,\" Harden said."}
{"game_id": "0021700384", "chunk_id": "0021700384_013", "order": 13, "role": "body", "text": "With Lillard's foot on ice, Houston launched a rally, pulling to 103-98 when Lillard returned with 7 minutes remaining. But the Rockets had momentum, and took a 110-109 lead on Ariza's 3-pointer."}
{"game_id": "0021700384", "chunk_id": "0021700384_014", "order": 14, "role": "body", "text": "The Rockets never trailed again, outscoring Portland 14-6 during the final 3 minutes."}
{"game_id": "0021700384", "chunk_id": "0021700384_015", "order": 15, "role": "body", "text": "\"It took everything we had to beat them,\" D'Antoni said."}
{"game_id": "0021700384", "chunk_id": "0021700384_016", "order": 16, "role": "body", "text": "The Blazers, eager not to finish a home stand 0-4, were aggressive early, as Lillard hit two 3-pointers but also drew two fouls during the first 3 minutes. Midway through the first quarter, Lillard stepped in front of Paul and earned a charging foul, touching off a battle of words that resulted in technicals to Portland's Meyers Leonard and Paul."}
{"game_id": "0021700384", "chunk_id": "0021700384_017", "order": 17, "role": "body", "text": "Lillard's 3-pointer gave Portland its largest lead of the first half at 57-46, but Houston outscored the Blazers 16-5 during the final 5:37 to pull even at 62 at halftime."}
{"game_id": "0021700384", "chunk_id": "0021700384_019", "order": 19, "role": "body", "text": "Rockets: Houston is 10-0 with Paul in the lineup. ... Paul missed 14 games with a knee injury. ... Nene returned to action after missing one game with a corneal abrasion. ... Houston plays its next seven games at home. ... Harden has scored at least 20 points in each of Houston's 24 games this season, only the second player to accomplish such a feat since the 1990-91 season."}
{"game_id": "0021700384", "chunk_id": "0021700384_020", "order": 20, "role": "body", "text": "Trail Blazers: Portland had fresh faces in its starting lineup, as Leonard made his first start and guard Evan Turner his second of the season. They were replacements for injured Jusuf Nurkic (ankle) and Maurice Harkless (quad). ... The Blazers hit a season-high nine 3-pointers during the first half. ... Portland begins a five-game trip Monday at Golden State."}
{"game_id": "0021700384", "chunk_id": "0021700384_022", "order": 22, "role": "body", "text": "Houston piled up a big edge at the free throw line, making 34 of 42 shots, while Portland took only 12 free throws, making nine."}
{"game_id": "0021700384", "chunk_id": "0021700384_023", "order": 23, "role": "body", "text": "\"The disparity was ridiculous,\" Stotts said."}
{"game_id": "0021700384", "chunk_id": "0021700384_025", "order": 25, "role": "body", "text": "Rockets: Host New Orleans on Monday night."}
{"game_id": "0021700384", "chunk_id": "0021700384_026", "order": 26, "role": "body", "text": "Trail Blazers: At Golden State on Monday night."}
{"game_id": "0021700384", "chunk_id": "0021700384_028", "order": 28, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
