{"game_id": "0021300053", "chunk_id": "0021300053_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  The Indiana Pacers lost six of their first nine games last season -- and they seem intent on making up for that in 2013."}
{"game_id": "0021300053", "chunk_id": "0021300053_002", "order": 2, "role": "body", "text": "\"We just want play well and get out of the gates,\" center Roy Hibbert said. \"We're an experienced team and we know every win's important.\""}
{"game_id": "0021300053", "chunk_id": "0021300053_003", "order": 3, "role": "body", "text": "Paul George scored 31 points, and the Pacers remained the NBA's only unbeaten team with a 99-91 victory over the Detroit Pistons on Tuesday night."}
{"game_id": "0021300053", "chunk_id": "0021300053_004", "order": 4, "role": "body", "text": "Indiana matched its best start in franchise history. The Pacers are 4-0 for the first time since the 2004-05 season."}
{"game_id": "0021300053", "chunk_id": "0021300053_005", "order": 5, "role": "body", "text": "Indiana blew a 15-point lead in the first half but took control again with a strong third quarter. C.J. Watson had 15 points and David West finished with 12 for the Pacers. Hibbert had eight points, 10 rebounds and seven blocks."}
{"game_id": "0021300053", "chunk_id": "0021300053_006", "order": 6, "role": "body", "text": "Indiana will try to extend its unbeaten run Wednesday night against Chicago."}
{"game_id": "0021300053", "chunk_id": "0021300053_007", "order": 7, "role": "body", "text": "\"It would be a big win, a huge confidence booster,\" George said. \"But it's no statement. The season's still early.\""}
{"game_id": "0021300053", "chunk_id": "0021300053_008", "order": 8, "role": "body", "text": "Brandon Jennings scored 17 points for the Pistons, who were done in by their 5-for-25 shooting from 3-point range."}
{"game_id": "0021300053", "chunk_id": "0021300053_009", "order": 9, "role": "body", "text": "Detroit led 44-40 early in the third quarter before the Pacers went on a 15-2 run capped by an alley-oop to George. He scored 14 points in the quarter, and Indiana led 74-63 entering the fourth."}
{"game_id": "0021300053", "chunk_id": "0021300053_010", "order": 10, "role": "body", "text": "\"Our starters' disposition and attitude and energy took the game back over,\" Pacers coach Frank Vogel said. \"We were able to ride it out.\""}
{"game_id": "0021300053", "chunk_id": "0021300053_011", "order": 11, "role": "body", "text": "Detroit cut the deficit to four early in the final period, but Indiana responded with six straight points to lead 82-72. The Pacers stretched the lead to 19 at 94-75 before the Pistons rallied in the final minutes to make the final score more respectable."}
{"game_id": "0021300053", "chunk_id": "0021300053_012", "order": 12, "role": "body", "text": "It was 96-91 after Detroit's Kyle Singler made two free throws with 32.6 seconds left, but the Pacers broke Detroit's pressure and the Pistons didn't foul. West made a layup with 16.6 seconds left."}
{"game_id": "0021300053", "chunk_id": "0021300053_013", "order": 13, "role": "body", "text": "The Pacers have won six straight over the Pistons, and the previous three wins had been lopsided, by 19, 32 and 18 points."}
{"game_id": "0021300053", "chunk_id": "0021300053_014", "order": 14, "role": "body", "text": "The Pacers were without George Hill (sore left hip) for a second straight game, and Danny Granger is still out with a strained left calf, but they haven't allowed an opponent to shoot better than 40 percent from the field. Detroit finished at 38 percent and could not overcome its poor showing from the perimeter."}
{"game_id": "0021300053", "chunk_id": "0021300053_015", "order": 15, "role": "body", "text": "\"They were aggressive, and we didn't respond,\" Pistons coach Maurice Cheeks said. \"The paint was packed in, but we still have to attack the basket and either make shots or get to the line. It's a lot easier to do that when you are hitting shots from the perimeter, but you still have to do it.\""}
{"game_id": "0021300053", "chunk_id": "0021300053_016", "order": 16, "role": "body", "text": "Greg Monroe had 14 points and 10 rebounds for the Pistons."}
{"game_id": "0021300053", "chunk_id": "0021300053_017", "order": 17, "role": "body", "text": "\"They have monster size and great guards -- very proud of the effort,\" Vogel said. \"Paul George did everything I asked him to do -- everything you could possibly ask a player to do tonight.\""}
{"game_id": "0021300053", "chunk_id": "0021300053_018", "order": 18, "role": "body", "text": "George made his first five shots and finished the first quarter with 12 points, helping the Pacers to a 29-14 lead. Then they were outscored 27-9 in the second."}
{"game_id": "0021300053", "chunk_id": "0021300053_019", "order": 19, "role": "body", "text": "\"We had to just get back to sharing the ball,\" George said. \"We were making a lot of one-on-one plays. We were getting really pressured out up top and just not getting into our offense.\""}
{"game_id": "0021300053", "chunk_id": "0021300053_020", "order": 20, "role": "body", "text": "Jennings, acquired in an offseason trade, made his first start for the Pistons in his second game with his new team. He was injured for the first two games of the season, and Detroit looked out of sorts offensively Tuesday."}
{"game_id": "0021300053", "chunk_id": "0021300053_021", "order": 21, "role": "body", "text": "Josh Smith, another new acquisition this season for Detroit, scored 16 points but shot 5 of 16. He went 1 of 6 from beyond the arc."}
{"game_id": "0021300053", "chunk_id": "0021300053_022", "order": 22, "role": "body", "text": "\"That's a team that has been together for a number of years, and we're still getting to know each other,\" Smith said. \"That's important, but we still have to do a better job than we did.\""}
{"game_id": "0021300053", "chunk_id": "0021300053_023", "order": 23, "role": "closing", "text": "Game notes Indiana also started 4-0 in 1989-90, according to STATS. ... Detroit's starting backcourt of Jennings and Chauncey Billups went 8 for 25, including 1 of 9 from 3-point range."}
