{"game_id": "0021700307", "chunk_id": "0021700307_001", "order": 1, "role": "lead", "text": "TORONTO --  The Charlotte Hornets came to Canada in search of their first road win in November. They left still without one thanks to Kyle Lowry and his Toronto teammates."}
{"game_id": "0021700307", "chunk_id": "0021700307_002", "order": 2, "role": "body", "text": "He scored a season-high 36 points, DeMar DeRozan had 30 and the Raptors improved to 7-1 at home by beating the shorthanded Hornets 126-113 on Wednesday night."}
{"game_id": "0021700307", "chunk_id": "0021700307_003", "order": 3, "role": "body", "text": "Lowry set a new career-high by hitting eight 3-pointers."}
{"game_id": "0021700307", "chunk_id": "0021700307_004", "order": 4, "role": "body", "text": "\"He shoots it so effortlessly,\" DeRozan said of Lowry. \"It's great when you see him get it off the way he does when he's shooting it. Another Kyle night.\""}
{"game_id": "0021700307", "chunk_id": "0021700307_005", "order": 5, "role": "body", "text": "Jonas Valanciunas scored 12 points and Norman Powell had 10 for the Raptors, who never trailed in winning their second straight."}
{"game_id": "0021700307", "chunk_id": "0021700307_006", "order": 6, "role": "body", "text": "Dwight Howard had 22 points and 10 rebounds for the Hornets, who lost their seventh straight road game and dropped to 1-9 away from home. Jeremy Lamb and Frank Kaminksy each scored 18 points and Michael Kidd-Gilchrist had 12."}
{"game_id": "0021700307", "chunk_id": "0021700307_007", "order": 7, "role": "body", "text": "Toronto has won five straight at home."}
{"game_id": "0021700307", "chunk_id": "0021700307_008", "order": 8, "role": "body", "text": "\"We always preach protecting home court,\" DeRozan said. \"It's always been our comfort zone when we come back home. It's always been big for us.\""}
{"game_id": "0021700307", "chunk_id": "0021700307_009", "order": 9, "role": "body", "text": "Kaminsky said the Hornets can't afford to fall behind by double digits in the first quarter the way they did against Toronto."}
{"game_id": "0021700307", "chunk_id": "0021700307_010", "order": 10, "role": "body", "text": "\"We have to start games better than that, especially on the road,\" Kaminsky said."}
{"game_id": "0021700307", "chunk_id": "0021700307_011", "order": 11, "role": "body", "text": "Hornets coach Steve Clifford said he was \"incredibly disappointed\" with his team's effort after having the past three days off."}
{"game_id": "0021700307", "chunk_id": "0021700307_012", "order": 12, "role": "body", "text": "\"I'm shocked at the level of intensity and attention to detail we played with,\" Clifford said. \"That first half, there was no fight. DeRozan got whatever he wanted, Lowry got whatever he wanted. They took us apart.\""}
{"game_id": "0021700307", "chunk_id": "0021700307_013", "order": 13, "role": "body", "text": "Charlotte guard Kemba Walker did not play for the first time this season because of a bruised left shoulder.  An All-Star for the first time last season, Walker was injured in a collision with San Antonio's LaMarcus Aldridge in Saturday's home loss to the Spurs. Clifford said Walker will be re-evaluated after Thursday's practice in Miami, where Charlotte faces the Heat on Friday night, but sounded doubtful about Walker's hopes for a speedy return."}
{"game_id": "0021700307", "chunk_id": "0021700307_014", "order": 14, "role": "body", "text": "\"He's still really sore,\" Clifford said. \"I would think that unless he gets a lot better tomorrow, Friday will be difficult.\""}
{"game_id": "0021700307", "chunk_id": "0021700307_015", "order": 15, "role": "body", "text": "Walker scored 115 points in four meetings with Toronto last season, his highest total against any opponent."}
{"game_id": "0021700307", "chunk_id": "0021700307_016", "order": 16, "role": "body", "text": "Nicolas Batum cut it to 109-104 with a 3 with 4:43 left, capping a 7-0 run. DeRozan stopped the spurt with a layup, Serge Ibaka followed with a jumper before Lowry sealed it with his seventh 3-pointer."}
{"game_id": "0021700307", "chunk_id": "0021700307_018", "order": 18, "role": "body", "text": "Hornets: Charlotte has not won away from home since beating Memphis on October 30. ... Michael Carter-Williams started in Walker's place."}
{"game_id": "0021700307", "chunk_id": "0021700307_019", "order": 19, "role": "body", "text": "Raptors: C.J. Miles returned after missing the previous two games following the birth of his daughter. ... C Lucas Nogueira left in the fourth with a strained right calf. ... Fred VanVleet had a career-high nine assists. ... Toronto's eight home games are tied with Chicago for fewest in the NBA. The Bulls are 2-6 at home."}
{"game_id": "0021700307", "chunk_id": "0021700307_021", "order": 21, "role": "body", "text": "Casey was furious at his team for allowing a 19-2 Hornets run to begin the third. \"That's totally unacceptable,\" Casey said. \"We're not going to win anything if we come out with that attitude.\""}
{"game_id": "0021700307", "chunk_id": "0021700307_022", "order": 22, "role": "body", "text": "DeRozan said Casey was still steamed about the sluggish start following the game. \"It was pretty loud,\" DeRozan said of Casey's post-game rant."}
{"game_id": "0021700307", "chunk_id": "0021700307_024", "order": 24, "role": "body", "text": "Chicago (1-10) is the only NBA team with double digit road defeats. Atlanta, Oklahoma City, Orlando, and Sacramento all have nine road losses."}
{"game_id": "0021700307", "chunk_id": "0021700307_026", "order": 26, "role": "body", "text": "Blue Jays pitcher Marcus Stroman attended the game, as did actress Elisabeth Moss."}
{"game_id": "0021700307", "chunk_id": "0021700307_028", "order": 28, "role": "body", "text": "Hornets: Charlotte's road trip concludes when it faces Southeast Division rival Miami for the first time this season Friday. The Hornets have lost two straight against the Heat."}
{"game_id": "0021700307", "chunk_id": "0021700307_029", "order": 29, "role": "body", "text": "Raptors: Host Indiana on Friday night. Toronto has won seven straight home games against the Pacers."}
{"game_id": "0021700307", "chunk_id": "0021700307_031", "order": 31, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
