{"game_id": "0021200374", "chunk_id": "0021200374_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  The Memphis Grizzlies' ramped up defensive pressure has led to some impressive wins."}
{"game_id": "0021200374", "chunk_id": "0021200374_002", "order": 2, "role": "body", "text": "Memphis held Milwaukee to a season-low in points and Tony Allen locked down Bucks leading scorer Monta Ellis to help the Grizzlies win 90-80 Wednesday night."}
{"game_id": "0021200374", "chunk_id": "0021200374_003", "order": 3, "role": "body", "text": "Ellis, who entered the game averaging 19 points a game, missed his first 13 shots with Allen on him, and didn't score a field goal until 2:30 was left in the game. He ended the night with four points."}
{"game_id": "0021200374", "chunk_id": "0021200374_004", "order": 4, "role": "body", "text": "\"I'm aware he's not hitting any on me. I'm aware of that,\" Allen said when asked if he realized Ellis was struggling. \"He's a talented scorer. He'll jump out of that slump before you know it.\""}
{"game_id": "0021200374", "chunk_id": "0021200374_005", "order": 5, "role": "body", "text": "Memphis coach Lionel Hollins simply said: \"Tony Allen's defense on Monta Ellis was outstanding.\""}
{"game_id": "0021200374", "chunk_id": "0021200374_006", "order": 6, "role": "body", "text": "Zach Randolph had 15 points and 17 rebounds, Marc Gasol added 12 points and 12 rebounds for Memphis, which entered the game allowing a league-low 90 points a game. Rudy Gay added 13 points, Mike Conley had 11 points and six assists, while Marreese Speights scored 10 points."}
{"game_id": "0021200374", "chunk_id": "0021200374_007", "order": 7, "role": "body", "text": "Brandon Jennings led Milwaukee with 26 points, even though he missed his first eight shots. Marquis Daniels was the only other Bucks player in double figures with 12 points on 5 of 8 from the field."}
{"game_id": "0021200374", "chunk_id": "0021200374_008", "order": 8, "role": "body", "text": "\"I said before the game if we could get it to where neither (Jennings nor Ellis) had a huge game, we'd be all right,\" Hollins said. \"Nine of 26 for 26 points (from Jennings) is not a huge game to me.\""}
{"game_id": "0021200374", "chunk_id": "0021200374_009", "order": 9, "role": "body", "text": "Memphis benefited from an intense defense in the second half, causing 12 Bucks turnovers after halftime leading to 18 points. Memphis committed 10 of its 16 turnovers in the first half."}
{"game_id": "0021200374", "chunk_id": "0021200374_010", "order": 10, "role": "body", "text": "Milwaukee shot 35 percent for the game."}
{"game_id": "0021200374", "chunk_id": "0021200374_011", "order": 11, "role": "body", "text": "\"It was tough,\" Milwaukee coach Scott Skiles said. \"We had a ton of open looks. We just missed them. There's not much to say. We couldn't make a shot, and we were only down nine at halftime. It was tough.\""}
{"game_id": "0021200374", "chunk_id": "0021200374_012", "order": 12, "role": "body", "text": "While Ellis said it was \"just a bad night,\" Jennings, who had his own shooting problems in the first half, noted Ellis' misfiring stymies the Bucks offense."}
{"game_id": "0021200374", "chunk_id": "0021200374_013", "order": 13, "role": "body", "text": "\"He's our scorer, so he's the most important player on this team for us,\" Jennings said. \"I know he's angry right now, but with great scorers like that you shouldn't be too worried because they always come back strong.\""}
{"game_id": "0021200374", "chunk_id": "0021200374_014", "order": 14, "role": "body", "text": "Both teams started the game shooting poorly as the Grizzlies hit just a third of their shots, while the Bucks were 6 of 26, including Ellis and Jennings, the Bucks two top scorers, missing all 12 of their combined shots in the first quarter."}
{"game_id": "0021200374", "chunk_id": "0021200374_015", "order": 15, "role": "body", "text": "Jennings missed eight shots before connecting, while Ellis missed all 10 of his in the half."}
{"game_id": "0021200374", "chunk_id": "0021200374_016", "order": 16, "role": "body", "text": "\"That's a game-changer to have a guy who can do that,\" Conley said of Allen's play. \"To take a guy (like Ellis), who is so good, out of game offensively is unbelievable. As long he can do that, he is able to be a game-changer for us.\""}
{"game_id": "0021200374", "chunk_id": "0021200374_017", "order": 17, "role": "body", "text": "Memphis led 43-34 at halftime by shooting 40 percent, despite Gay and Allen hitting 2 of 7 each and Conley missing his three shots."}
{"game_id": "0021200374", "chunk_id": "0021200374_018", "order": 18, "role": "body", "text": "Neither team had a scorer in double figures at intermission."}
{"game_id": "0021200374", "chunk_id": "0021200374_019", "order": 19, "role": "body", "text": "Memphis took the first double-digit lead of the game on its initial possession of the second half, and eventually extended it to 60-45 as the Grizzlies turned up the defensive pressure. The Bucks, meanwhile, looked like a team struggling to catch their breath on the second night of a back-to-back."}
{"game_id": "0021200374", "chunk_id": "0021200374_020", "order": 20, "role": "body", "text": "\"We just couldn't get anything going on the offensive end,\" Skiles said. \"We can't score one of three possessions and expect to come back and win.\""}
{"game_id": "0021200374", "chunk_id": "0021200374_021", "order": 21, "role": "body", "text": "Memphis would eventually build the lead to 16 in the third and finished the quarter with a 66-51 advantage."}
{"game_id": "0021200374", "chunk_id": "0021200374_022", "order": 22, "role": "body", "text": "\"That's where we lay our hat at is on the defensive end,\" said Allen, who had a season-high four steals. \"Ever since I got here, that's been our motto, holding it down on the defensive end, playing in and out basketball. Whenever we do that, I think we are more effective.\""}
{"game_id": "0021200374", "chunk_id": "0021200374_023", "order": 23, "role": "closing", "text": "Game notes Memphis defeated Milwaukee 108-90 on Nov. 7. .Memphis has won five straight in the series and swept the season series three straight years. The teams played only once in last year's lockout-shortened season. .Memphis had 20 rebounds in the first quarter, the most for a period this season. They ended the night outrebounding Milwaukee 56-44. ... Conley needs one assist to tie Jason Williams for the most assists in Grizzlies franchise history. Williams had 2,069. ... The Bucks, who defeated the Indiana Pacers on Tuesday night, are now 2-3 in second night of a back-to-back. ... The previous low point total for the Bucks this season was 81 at New Orleans on Dec. 3. .Randolph now has a league-best 19 double-doubles in 23 games."}
