{"game_id": "0021200501", "chunk_id": "0021200501_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  It's not quite a winning streak, but after losing 18 straight, coming out on top in two out of three games is close enough."}
{"game_id": "0021200501", "chunk_id": "0021200501_002", "order": 2, "role": "body", "text": "Kemba Walker had 20 points and seven assists, Ben Gordon scored 18 points and the Charlotte Bobcats beat the Detroit Pistons 108-101 in overtime Sunday night for just their second win in 21 games."}
{"game_id": "0021200501", "chunk_id": "0021200501_003", "order": 3, "role": "body", "text": "After snapping the long losing skid with a 91-81 victory at Chicago on Monday, Charlotte lost 106-104 to Cleveland at home on Friday night."}
{"game_id": "0021200501", "chunk_id": "0021200501_004", "order": 4, "role": "body", "text": "Ramon Sessions added 15 points, Michael Kidd-Gilchrist scored 11, and Bismack Biyombo had 10 points and 17 rebounds for the Bobcats."}
{"game_id": "0021200501", "chunk_id": "0021200501_005", "order": 5, "role": "body", "text": "\"It definitely helped push us away from that losing streak and get on with life,\" Charlotte coach Mike Dunlop said about the team's latest win."}
{"game_id": "0021200501", "chunk_id": "0021200501_006", "order": 6, "role": "body", "text": "Tayshaun Prince scored 21 points to lead Detroit, which snapped a four-game winning streak. Greg Monroe had 18 points, 14 rebounds and six assists and Rodney Stuckey also scored 18 points."}
{"game_id": "0021200501", "chunk_id": "0021200501_007", "order": 7, "role": "body", "text": "\"They're a team that when you score on them, they push it right back down your throat. They come at you 100 times faster than you went at them,\" Pistons' rookie center Andre Drummond said. \"That's one of the teams that when you score, you miss a shot, you gotta get back quick or else they're going to score on you.\""}
{"game_id": "0021200501", "chunk_id": "0021200501_008", "order": 8, "role": "body", "text": "Walker's driving layup with 7.8 seconds left in regulation tied the score at 96-all, sending the game to overtime."}
{"game_id": "0021200501", "chunk_id": "0021200501_009", "order": 9, "role": "body", "text": "\"I'm just trying to make the best play possible. Whether it's a pass or making a basket,\" Walker said. \"Tonight it was the basket that put us into overtime.\""}
{"game_id": "0021200501", "chunk_id": "0021200501_010", "order": 10, "role": "body", "text": "Then, he and Tyrus Thomas had four points each for Charlotte in the extra period."}
{"game_id": "0021200501", "chunk_id": "0021200501_011", "order": 11, "role": "body", "text": "\"He's got a big heart and he knows how to close a game,\" Dunlop said about Walker. \"He's a special player.\""}
{"game_id": "0021200501", "chunk_id": "0021200501_012", "order": 12, "role": "body", "text": "Thomas, who had 13 points, was playing in only his second game after missing six weeks with a right calf strain."}
{"game_id": "0021200501", "chunk_id": "0021200501_013", "order": 13, "role": "body", "text": "Prince's jump hook with 2:02 left had given the Pistons a 96-94 lead."}
{"game_id": "0021200501", "chunk_id": "0021200501_014", "order": 14, "role": "body", "text": "Drummond scored six straight points for the Pistons and blocked shot in less than a four-minute span in the fourth quarter, as Detroit led 90-87 with 5:39 left."}
{"game_id": "0021200501", "chunk_id": "0021200501_015", "order": 15, "role": "body", "text": "However, Drummond then fouled Walker, who hit two free throws with 5:15 remaining to bring the Bobcats within one."}
{"game_id": "0021200501", "chunk_id": "0021200501_016", "order": 16, "role": "body", "text": "\"A loss is a loss, no matter who it's to. Whether it's to Derrick Rose, Kemba Walker,\" Pistons point guard Brandon Knight said. \"Those are just guys on certain teams. It's a team game. It's the Pistons lost to the Bobcats.\""}
{"game_id": "0021200501", "chunk_id": "0021200501_017", "order": 17, "role": "body", "text": "The Pistons led 82-79 going into the fourth quarter."}
{"game_id": "0021200501", "chunk_id": "0021200501_018", "order": 18, "role": "body", "text": "Detroit held a 60-59 lead at the half after Charlotte rallied from a 13-point deficit with less than five minutes left in the second quarter."}
{"game_id": "0021200501", "chunk_id": "0021200501_019", "order": 19, "role": "body", "text": "Four consecutive 3-point shots, the first three by Charlie Villanueva and the fourth by Stuckey, helped give the Pistons a 58-45 lead with 4:48 remaining in the first half."}
{"game_id": "0021200501", "chunk_id": "0021200501_020", "order": 20, "role": "body", "text": "\"I think they tried to come out and hit us in the mouth in the first half,\" Gordon said."}
{"game_id": "0021200501", "chunk_id": "0021200501_021", "order": 21, "role": "body", "text": "But the Bobcats scored the next 10 points -- two free throws by Biyombo (4:32), an alley-oop dunk by Jeffery Taylor (4:14), two more free throws by Biyombo (3:45), Thomas' two free throws (3:09) and Biyombo's lay-in (2:36) cut Detroit's lead to 58-55."}
{"game_id": "0021200501", "chunk_id": "0021200501_022", "order": 22, "role": "body", "text": "The Pistons' Knight was credited with a bucket on a goaltending call to make it 60-55 with 1:40 left."}
{"game_id": "0021200501", "chunk_id": "0021200501_023", "order": 23, "role": "body", "text": "But Walker ended the half with two driving lay-ups with 52.4 and 25.7 seconds left."}
{"game_id": "0021200501", "chunk_id": "0021200501_024", "order": 24, "role": "closing", "text": "Game notes Bobcats forward Hakim Warrick didn't play because of flu-like symptoms and Charlotte forward/center Byron Mullens was out with a left ankle sprain. ... Gordon is in his first season with Charlotte after spending the previous three with the Pistons. He averaged 12.5 points and 26.9 minutes in 52 games with Detroit last season."}
