{"game_id": "0021400731", "chunk_id": "0021400731_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  George Hill gave the Indiana Pacers a boost, from the first basket to the final minute."}
{"game_id": "0021400731", "chunk_id": "0021400731_002", "order": 2, "role": "body", "text": "Hill returned to the starting lineup and contributed 20 points and six assists, sending the Pacers past the Detroit Pistons 114-109 Wednesday night."}
{"game_id": "0021400731", "chunk_id": "0021400731_003", "order": 3, "role": "body", "text": "Hill got off to a quick start, making a layup 12 seconds into the game and adding a 3-pointer for a 5-0 lead. His jumper and two free throws at the end kept Indiana ahead in its highest-scoring game of the season."}
{"game_id": "0021400731", "chunk_id": "0021400731_004", "order": 4, "role": "body", "text": "\"Certainly George leading the way is a big difference for us,\" Pacers coach Frank Vogel said. \"He creates things for others and get us organized. He is great playing with the basketball and without the basketball.\""}
{"game_id": "0021400731", "chunk_id": "0021400731_005", "order": 5, "role": "body", "text": "Hill made just his fourth start of the season, and first in six games after being sidelined by a strained left groin. Slowed by a knee injury, he's been limited to 11 games overall"}
{"game_id": "0021400731", "chunk_id": "0021400731_006", "order": 6, "role": "body", "text": "Roy Hibbert had 16 points and 12 rebounds and C.J. Miles added 15 points for the Pacers."}
{"game_id": "0021400731", "chunk_id": "0021400731_007", "order": 7, "role": "body", "text": "Andre Drummond had 18 points and 16 rebounds and Greg Monroe scored 16 for the Pistons."}
{"game_id": "0021400731", "chunk_id": "0021400731_008", "order": 8, "role": "body", "text": "Miles made back-to-back 3-pointers that helped give the Pacers a 102-96 lead, and they led the rest of the way."}
{"game_id": "0021400731", "chunk_id": "0021400731_009", "order": 9, "role": "body", "text": "The Pacers went on a 17-2 run in the third quarter to take a 70-58 lead."}
{"game_id": "0021400731", "chunk_id": "0021400731_010", "order": 10, "role": "body", "text": "Miles finished with four 3-pointers, including a 3 that tied it at 56 and sparked the run. Hill's layup put the Pacers ahead."}
{"game_id": "0021400731", "chunk_id": "0021400731_011", "order": 11, "role": "body", "text": "Indiana dropped the first two games to Detroit of the four-game series in the regular season, including a 98-96 loss on Jan. 16 when Drummond scored on a last-second basket to win it."}
{"game_id": "0021400731", "chunk_id": "0021400731_012", "order": 12, "role": "body", "text": "Hill was inactive that game with the strained groin. Indiana's first loss to Detroit, 119-109 back on Dec. 26, was just Hill's second game of the year."}
{"game_id": "0021400731", "chunk_id": "0021400731_013", "order": 13, "role": "body", "text": "Still, Hill isn't where he wants to be."}
{"game_id": "0021400731", "chunk_id": "0021400731_014", "order": 14, "role": "body", "text": "\"My conditioning is at an all-time low,\" he said. \"But I felt fine physically. It is still going to take a couple game to get my legs back under me.\""}
{"game_id": "0021400731", "chunk_id": "0021400731_015", "order": 15, "role": "body", "text": "Monroe scored just before halftime to give the Pistons a 49-48 lead at the break."}
{"game_id": "0021400731", "chunk_id": "0021400731_016", "order": 16, "role": "body", "text": "\"We were terrible defensively,\" Pistons coach Stan Van Gundy said. \"We defended for four minutes in a 48-minute game. We defended the last four minutes of the first half and that was it.\""}
{"game_id": "0021400731", "chunk_id": "0021400731_017", "order": 17, "role": "body", "text": "After Indiana's big run early in the second half, the Pistons went on a 10-2 run late in the third quarter to get back within two."}
{"game_id": "0021400731", "chunk_id": "0021400731_018", "order": 18, "role": "body", "text": "John Lucas III hit a 3-pointer and Anthony Tolliver made another to make 74-72 with 1:31 remaining in the third quarter."}
{"game_id": "0021400731", "chunk_id": "0021400731_020", "order": 20, "role": "body", "text": "Pistons: Detroit began the day with an average of 8.7 3-pointers per game, the highest rate in team history. The Pistons shot 12 of 24 on 3s, and the Pacers were even better at 12 of 21."}
{"game_id": "0021400731", "chunk_id": "0021400731_021", "order": 21, "role": "body", "text": "Pacers: Indiana wore Flo-Jo jerseys as part of the NBA's Hardwood Classics program. The Pacers wore the jerseys throughout the 1990s and will wear them in six games this season."}
{"game_id": "0021400731", "chunk_id": "0021400731_023", "order": 23, "role": "body", "text": "Pistons: Host Nuggets on Friday."}
{"game_id": "0021400731", "chunk_id": "0021400731_024", "order": 24, "role": "body", "text": "Pacers: Host Cavaliers on Friday."}
{"game_id": "0021400731", "chunk_id": "0021400731_026", "order": 26, "role": "body", "text": "A day after Pacers president Larry Bird called the season \"disappointing,\" Indiana shot a season-best 59.7 percent. The Pacers scored 33 points in the fourth quarter, their best final period of the season."}
{"game_id": "0021400731", "chunk_id": "0021400731_028", "order": 28, "role": "body", "text": "The Pacers and Pistons both have faced injuries. Detroit's Brandon Jennings is out for the season with a ruptured left Achilles tendon. Indiana has missed much of its startling lineup at different times, including All-Star Paul George, who fractured his right leg in the offseason."}
{"game_id": "0021400731", "chunk_id": "0021400731_029", "order": 29, "role": "closing", "text": "In the first quarter, Detroit's Kentavious Caldwell-Pope left with a sore right Achilles. In the second quarter, Indiana's Ian Mahinmi sprained his right ankle."}
