{"game_id": "0021701084", "chunk_id": "0021701084_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Russell Westbrook picked his spots for three quarters, then took complete control in the fourth."}
{"game_id": "0021701084", "chunk_id": "0021701084_002", "order": 2, "role": "body", "text": "The All-Star guard scored 17 of his 29 points in the final period to help the Oklahoma City Thunder beat the Miami Heat 105-99 on Friday night."}
{"game_id": "0021701084", "chunk_id": "0021701084_003", "order": 3, "role": "body", "text": "Westbrook went 6 for 7 from the field and made 3 of 4 free throws in the fourth quarter, despite playing just 8:43 in the period. He helped pick up the slack for his co-star, Paul George, who made just 3 of 16 shots."}
{"game_id": "0021701084", "chunk_id": "0021701084_004", "order": 4, "role": "body", "text": "George was impressed with the way Westbrook finished the game."}
{"game_id": "0021701084", "chunk_id": "0021701084_005", "order": 5, "role": "body", "text": "\"It's new to me, a guy at his level that is always ready for the moment who can just sense how and when to really take charge,\" George said. \"He is one of the most explosive and unique players that I have ever played with.\""}
{"game_id": "0021701084", "chunk_id": "0021701084_006", "order": 6, "role": "body", "text": "Westbrook also had 13 rebounds and eight assists."}
{"game_id": "0021701084", "chunk_id": "0021701084_007", "order": 7, "role": "body", "text": "\"He's going to put his fingerprints on the game somehow, someway, and you just have to find a way to overcome it,\" Heat coach Erik Spoelstra said."}
{"game_id": "0021701084", "chunk_id": "0021701084_008", "order": 8, "role": "body", "text": "Steven Adams added 24 points and 12 rebounds for the Thunder. He scored 20 points in the first three quarters while his teammates struggled to make shots."}
{"game_id": "0021701084", "chunk_id": "0021701084_009", "order": 9, "role": "body", "text": "\"Steven's value is extremely important in that sense of when things get stagnant and we need a possession and need a bucket and we need a quick relief, he will always come through,\" George said. \"He's very underrated when he's posting up or finishing. He's very underrated.\""}
{"game_id": "0021701084", "chunk_id": "0021701084_010", "order": 10, "role": "body", "text": "Oklahoma City has won seven of eight to move into fourth place in the Western Conference standings."}
{"game_id": "0021701084", "chunk_id": "0021701084_011", "order": 11, "role": "body", "text": "James Johnson scored 23 points and Goran Dragic added 20 for the Heat, whose win streak ended at three games."}
{"game_id": "0021701084", "chunk_id": "0021701084_012", "order": 12, "role": "body", "text": "Miami led 66-64 heading onto the fourth quarter."}
{"game_id": "0021701084", "chunk_id": "0021701084_013", "order": 13, "role": "body", "text": "Adams made a layup after a cut to the hoop and he was fouled. He missed the free throw, but the Thunder got the rebound, leading to a mid-range jumper by Westbrook that bumped Oklahoma City's lead to 91-84."}
{"game_id": "0021701084", "chunk_id": "0021701084_014", "order": 14, "role": "body", "text": "Miami cut its deficit to 92-91 on a 3-pointer by Johnson, but Westbrook answered at the other end with a three. Westbrook then got a defensive rebound and bolted to the hoop at the other end for a layup. Miami was called for goaltending, and the Thunder lead was back to six."}
{"game_id": "0021701084", "chunk_id": "0021701084_015", "order": 15, "role": "body", "text": "Miami trimmed Oklahoma City's lead to two in the final minute, but Westbrook found Adams on a pick and roll for a dunk that made it 99-95 with 43 seconds to play. George then stole the ball, made a layup and was fouled. His free throw with 38.2 seconds left put the game out of reach."}
{"game_id": "0021701084", "chunk_id": "0021701084_018", "order": 18, "role": "body", "text": "Heat: G Tyler Johnson committed two fouls in the first 23 seconds. He finished with three fouls. ... G Dwyane Wade finished with seven points in 20 minutes. He hadn't played since March 10."}
{"game_id": "0021701084", "chunk_id": "0021701084_019", "order": 19, "role": "body", "text": "Thunder: Outrebounded the Heat 51-41. ... Improved to 7-1 with G Corey Brewer in the starting lineup. ... Carmelo Anthony finished with six points on 2 for 8 shooting."}
{"game_id": "0021701084", "chunk_id": "0021701084_021", "order": 21, "role": "body", "text": "Oklahoma City made 3 of 17 3-pointers in the first three quarters, then drained 5 of 9 in the fourth."}
{"game_id": "0021701084", "chunk_id": "0021701084_023", "order": 23, "role": "body", "text": "Thunder backup point guard Raymond Felton on scoring eight points in the fourth quarter: \"Every given night, Paul might not be hitting a shot, Russ might not be hitting a shot, `Melo (Anthony) might not be hitting a shot, so it's our job when we come off the bench to try to give the team a spark sometimes. It is what it is. We're all human. Putting the ball in the basket every night -- it's not going to be that way.\""}
{"game_id": "0021701084", "chunk_id": "0021701084_026", "order": 26, "role": "body", "text": "Thunder: Host Portland on Sunday."}
{"game_id": "0021701084", "chunk_id": "0021701084_028", "order": 28, "role": "body", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP"}
{"game_id": "0021701084", "chunk_id": "0021701084_030", "order": 30, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
