{"game_id": "0021701018", "chunk_id": "0021701018_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  De'Aaron Fox made another shot at the buzzer to force overtime. Then Zach Randolph took his turn making the big plays for the Kings."}
{"game_id": "0021701018", "chunk_id": "0021701018_002", "order": 2, "role": "body", "text": "It wasn't pretty at times, not after Sacramento blew a 16-point lead in the fourth quarter, but it was just enough to keep coach Dave Joerger's club on its mini-roll."}
{"game_id": "0021701018", "chunk_id": "0021701018_003", "order": 3, "role": "body", "text": "Fox made a tying layup at the end of regulation -- the second time in two weeks for the rookie point guard -- Randolph scored the first three points of the extra period and finished with 22, and the Kings recovered to beat the Miami Heat 123-119 on Wednesday night."}
{"game_id": "0021701018", "chunk_id": "0021701018_004", "order": 4, "role": "body", "text": "Randolph added a key block on Justise Winslow with 1:19 remaining in OT as Sacramento swept Miami for the first time since 2001-02."}
{"game_id": "0021701018", "chunk_id": "0021701018_005", "order": 5, "role": "body", "text": "\"We just kept playing,\" Randolph said. \"Hit a couple tough shots, got a defensive stop. Just kept playing.\""}
{"game_id": "0021701018", "chunk_id": "0021701018_006", "order": 6, "role": "body", "text": "Randolph had the first three points in overtime with a free throw and 17-foot jumper. Fox made a short runner, Bogdan Bogdanovic hit a 28-foot 3-pointer and Buddy Hield added four free throws."}
{"game_id": "0021701018", "chunk_id": "0021701018_007", "order": 7, "role": "body", "text": "That overshadowed an impressive night by Miami's Goran Dragic, who scored 11 straight points in the fourth quarter to fuel the Heat's comeback and matched his season high of 33 points. But Dragic missed a tying turnaround jumper with 20 seconds left in overtime, then stepped out of bounds with the ball with 12.3 remaining."}
{"game_id": "0021701018", "chunk_id": "0021701018_008", "order": 8, "role": "body", "text": "Hield finished with 24 points, Fox had 20 and Bogdanovic added 14."}
{"game_id": "0021701018", "chunk_id": "0021701018_009", "order": 9, "role": "body", "text": "\"I have a lot of confidence in my young guys,\" Randolph said. \"Not only do they put the time in, they work so when you get on the court it applies to the court. That's what they're doing and I'm proud of them.\""}
{"game_id": "0021701018", "chunk_id": "0021701018_010", "order": 10, "role": "body", "text": "The Heat, who began the day in eighth place in the East, lost their second straight."}
{"game_id": "0021701018", "chunk_id": "0021701018_011", "order": 11, "role": "body", "text": "\"They wanted it and they came back and got us,\" Miami's James Johnson said. \"We can't be complacent and take (anyone) for granted. We're not a team yet that can be able to turn it on and off.\""}
{"game_id": "0021701018", "chunk_id": "0021701018_012", "order": 12, "role": "body", "text": "Wayne Ellington had 22 points with six 3-pointers, Johnson added 18 points, 10 rebounds and seven assists, and Winslow scored 13 points for Miami."}
{"game_id": "0021701018", "chunk_id": "0021701018_013", "order": 13, "role": "body", "text": "The Heat trailed by 16 early in the fourth and were down 104-91 following consecutive buckets by Hield. Dragic, who was fouled hard twice earlier in the quarter, then went on his tear."}
{"game_id": "0021701018", "chunk_id": "0021701018_014", "order": 14, "role": "body", "text": "Dragic made a three-point play and two 3s sandwiched around a pair of free throws to cut the Kings' lead to 104-102. After Fox missed two free throws for Sacramento, Kelly Olynyk's shot beyond the arc gave the Heat their first lead of the second half."}
{"game_id": "0021701018", "chunk_id": "0021701018_015", "order": 15, "role": "body", "text": "\"It was just a high pick-and-roll between him and Kelly,\" Miami coach Erik Spoelstra said. \"They found the weak points in that time and time again. He was just tremendous.\""}
{"game_id": "0021701018", "chunk_id": "0021701018_016", "order": 16, "role": "body", "text": "Ellington's 3-pointer pushed the Heat's lead to 110-106 before Hield hit a 3 to make it 110-109."}
{"game_id": "0021701018", "chunk_id": "0021701018_017", "order": 17, "role": "body", "text": "Miami turned the ball over on a shot clock violation with 9.3 seconds remaining but Randolph missed a short jumper. Olynyk made one of two free throws for the Heat before Fox's shot at the buzzer forced overtime."}
{"game_id": "0021701018", "chunk_id": "0021701018_019", "order": 19, "role": "body", "text": "Heat: Miami made six 3-pointers in the fourth quarter and matched its season-high of 18 overall. The Heat set a franchise record with 43 attempts beyond the arc. ... Dwyane Wade was inactive for a second consecutive game with a mild left hamstring strain. Hassan Whiteside (left hip) sat out his third straight."}
{"game_id": "0021701018", "chunk_id": "0021701018_020", "order": 20, "role": "body", "text": "Kings: Sacramento went 2 of 11 beyond the arc in the first half and finished 8 of 24 on 3-pointers. ... Skal Labissiere (bruised left hip) missed his third straight."}
{"game_id": "0021701018", "chunk_id": "0021701018_022", "order": 22, "role": "body", "text": "Miami has lost nine consecutive games on the road. The Heat last won a game outside of Florida on Jan. 29, when they beat Dallas 95-88. \"We will just have to gather ourselves and keep on developing this muscle of resilience,\" Spoelstra said."}
{"game_id": "0021701018", "chunk_id": "0021701018_024", "order": 24, "role": "body", "text": "Sacramento improved to 3-0 in overtime games this season. \"We've got a lot of guys who aren't scared,\" Fox said. \"When the game gets to overtime it's pretty much crunch time the whole five minutes and we have a whole bunch of guys that can make plays and make shots.\""}
{"game_id": "0021701018", "chunk_id": "0021701018_026", "order": 26, "role": "body", "text": "Heat: Travel to Los Angeles to play the Lakers on Friday."}
{"game_id": "0021701018", "chunk_id": "0021701018_027", "order": 27, "role": "closing", "text": "Kings: Play at Golden State on Friday."}
