{"game_id": "0021300772", "chunk_id": "0021300772_001", "order": 1, "role": "lead", "text": "CHICAGO -- Joakim Noah led the Chicago Bulls past the Atlanta Hawks and gave the fans an added bonus in the process.\nNoah scored 19 points as part of his first triple-double of the season in the Bulls' 100-85 win over the Hawks on Tuesday night. His two late free throws provided the Bulls with their final points and secured free Big Macs for the fans.\n\"Those were tough free throws, man,\" Noah said.\nNot much else seemed difficult for Noah and the Bulls."}
{"game_id": "0021300772", "chunk_id": "0021300772_002", "order": 2, "role": "closing", "text": "Noah added 16 rebounds and 11 assists, and Taj Gibson had 24 points and 12 rebounds, and Jimmy Butler had 12 points and 13 rebounds for the Bulls, who had six players score in double figures.\nChicago won its fourth straight against the Hawks and sixth in a row at home versus Atlanta.\nNoah had his fourth career triple-double and first since Feb. 28, 2013, against Philadelphia. He completed this one with an assist on Gibson's basket with 9:59 left.\nThe performance capped a strong stretch for Noah, who has had at least 10 rebounds in four straight games and at least 14 points in three of his last four contests.\n\"I think the big thing is he's healthy. He's gotten into rhythm,\" Bulls coach Tom Thibodeau said. \"I think missing training camp set him back offensively. Defensively he's been terrific all year.\"\nThe Bulls were without Carlos Boozer for the third straight game because of a left calf strain, and he was replaced in the starting lineup by Gibson. That didn't hurt Chicago much, as the Bulls (26-25) outrebounded the Hawks 57-28, won for the third time in four games, and pulled a half-game in front of Atlanta (25-25) in the Eastern Conference.\n\"We're playing with a lot of defensive intensity,\" Gibson said. \"We got guys great looks. We were real unselfish.\"\nThe Hawks have lost a season-high four straight overall. They fell behind big early, trailing by 25 points during the second quarter.\nAtlanta cut its deficit to eight with 8:47 left in the fourth on Mike Scott's 3-pointer, but Chicago answered with the next six points.\n\"I think the second half is what we expect from our group, what we expect of each other, and the challenges to find a way to play that way for 48 minutes,\" Hawks coach Mike Budenholzer said.\nThe first half clearly wasn't.\nNoah, who was presented his All-Star jersey before the game by Bulls general manager Gar Forman, had six points, six rebounds and six assists during the opening quarter.\nHe ended the first half with seven points, 11 rebounds, and eight assists for the Bulls, who led 58-39 after coming home from a 3-3 trip.\n\"Usually when you come back from a West Coast trip like that you exhale,\" Noah said. \"Nobody exhaled. We played hard and it was a good win for us.\"\nComing off a 79-76 loss to Memphis, in which the Hawks held the Grizzlies to an NBA-record low one free throw, Atlanta's offense woke up too late. The Hawks shot 43.8 for the game after making 40 percent in the first half.\nAll-star forward Paul Millsap had 15 for the Hawks but his streak of four games with at least 10 rebounds was snapped as he had two. Lou Williams added 13 points, and Jeff Teague had 12.\n\"We just have to stay together,\" Millsap said. \"Get back to playing our style of basketball. We feel like we have not played at our pace in the last few games.\"\nKyle Korver extended his NBA record streak of at least one 3-pointer to 119 games with a shot 15 seconds into the second quarter. Korver hasn't gone without one since Nov. 2, 2012, against Houston.\nBut that was the lone Atlanta highlight. The Bulls had a few more, and Noah was responsible for plenty of them.\n\"It feels great to play well. There's no better feeling, especially when you win,\" Noah said. \"A lot of guys stepped up.\"\nGame notes\nThibodeau said that Derrick Rose will \"most likely not\" practice with the team this season. Rose was ruled out for the season after tearing the meniscus in his right knee on Nov. 22. ... The Hawks signed Cartier Martin to a second 10-day contract. Martin also played six games with the Bulls earlier this season. ... Both teams have one game remaining before the All-Star break. ... Teague's brother, Marquis, was traded by the Bulls to Brooklyn on Jan. 21 for forward Tornike Shengelia. ... Atlanta is 9-12 without Al Horford, who is out for the season because of an injured right pectoral muscle."}
