{"game_id": "0021700363", "chunk_id": "0021700363_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  LaVar Ball's fourth-quarter taunts to Philly fans turned up the volume on an already raucous atmosphere. His son, Lonzo, later helped silence the sold-out crowd."}
{"game_id": "0021700363", "chunk_id": "0021700363_002", "order": 2, "role": "body", "text": "Brandon Ingram scored 21 points, including the game-winning 3-pointer with 0.8 seconds remaining on an assist from Lonzo Ball, to lead the Los Angeles Lakers to a 107-104 victory over the Philadelphia 76ers on Thursday night."}
{"game_id": "0021700363", "chunk_id": "0021700363_003", "order": 3, "role": "body", "text": "Julius Randle and Jordan Clarkson added 16 points apiece for the Lakers, who snapped a five-game losing streak."}
{"game_id": "0021700363", "chunk_id": "0021700363_004", "order": 4, "role": "body", "text": "On the winning play, Ball drove to the basket before dishing back to Ingram on the right wing."}
{"game_id": "0021700363", "chunk_id": "0021700363_005", "order": 5, "role": "body", "text": "\"He already saw it before it happened,\" LaVar Ball said of his son's assist."}
{"game_id": "0021700363", "chunk_id": "0021700363_006", "order": 6, "role": "body", "text": "Ingram calmly drained what he called the biggest shot of his young NBA career."}
{"game_id": "0021700363", "chunk_id": "0021700363_007", "order": 7, "role": "body", "text": "\"I think he made a great pass,\" Ingram said. \"I had the confidence to shoot it.\""}
{"game_id": "0021700363", "chunk_id": "0021700363_008", "order": 8, "role": "body", "text": "Lonzo Ball finished with 10 points, eight rebounds and eight assists."}
{"game_id": "0021700363", "chunk_id": "0021700363_009", "order": 9, "role": "body", "text": "The winning basket sent Ball's dad, LaVar, into a wild celebration in a suite."}
{"game_id": "0021700363", "chunk_id": "0021700363_010", "order": 10, "role": "body", "text": "\"When I come this far of a distance, it's hard to beat him,\" LaVar Ball said. \"I don't like all them losses. So, he'll do whatever it takes to get that `W.\""}
{"game_id": "0021700363", "chunk_id": "0021700363_011", "order": 11, "role": "body", "text": "LaVar Ball later embraced his son outside the Lakers locker room and told him how proud he was."}
{"game_id": "0021700363", "chunk_id": "0021700363_012", "order": 12, "role": "body", "text": "\"Keep doing what you're doing,\" he said. \"You're going to figure it out. You're going to have more fun than you've ever had.\""}
{"game_id": "0021700363", "chunk_id": "0021700363_013", "order": 13, "role": "body", "text": "The game was the first for the Lakers since LaVar Ball criticized coach Luke Walton and the Lakers offense in a radio interview, saying son Lonzo was \"very disgusted.\" It has been a tumultuous week for the Ball family, as LaVar withdrew another son, LiAngelo, from UCLA stemming from his suspension by the school for his involvement in a shoplifting incident in China."}
{"game_id": "0021700363", "chunk_id": "0021700363_014", "order": 14, "role": "body", "text": "LaVar Ball recently withdrew youngest son LaMelo from Chino Hills High, where he was a junior, and said he was going to home school him."}
{"game_id": "0021700363", "chunk_id": "0021700363_015", "order": 15, "role": "body", "text": "On Thursday LaVar Ball told ESPN that LiAngelo and LaMelo have signed with Harrison Gaines, the same agent who represents Lonzo Ball. That ends the amateur status of both."}
{"game_id": "0021700363", "chunk_id": "0021700363_016", "order": 16, "role": "body", "text": "Lonzo Ball was loudly booed every time he touched the ball. And Philadelphia fans gave the elder Ball even worse treatment when he began hooting and hollering from his suite in the fourth quarter."}
{"game_id": "0021700363", "chunk_id": "0021700363_017", "order": 17, "role": "body", "text": "\"They don't know the boos make my son stand up because I've been teaching him since he was a baby boos mean ball,\" LaVar Ball said."}
{"game_id": "0021700363", "chunk_id": "0021700363_018", "order": 18, "role": "body", "text": "Lonzo Ball said he enjoyed the atmosphere."}
{"game_id": "0021700363", "chunk_id": "0021700363_019", "order": 19, "role": "body", "text": "\"Right when they called my name, they were ready to go,\" Lonzo Ball said of the fans. \"They were going after us. It's always fun playing like that though.\""}
{"game_id": "0021700363", "chunk_id": "0021700363_020", "order": 20, "role": "body", "text": "Joel Embiid scored 33 points and Ben Simmons had a triple-double with 12 points, 13 rebounds and 15 assists for Philadelphia."}
{"game_id": "0021700363", "chunk_id": "0021700363_021", "order": 21, "role": "body", "text": "\"I never really felt we started playing until halfway through the third,\" Philadelphia coach Brett Brown said."}
{"game_id": "0021700363", "chunk_id": "0021700363_022", "order": 22, "role": "body", "text": "The 76ers battled back from a 16-point second-half deficit to tie the game on Embiid's two free throws with 39.8 seconds remaining."}
{"game_id": "0021700363", "chunk_id": "0021700363_023", "order": 23, "role": "body", "text": "Lonzo Ball missed a 3 on Los Angeles' ensuing possession and Embiid then missed a chance to give Philadelphia the lead."}
{"game_id": "0021700363", "chunk_id": "0021700363_024", "order": 24, "role": "body", "text": "After a timeout, Richaun Holmes' tying attempt at the buzzer was way off."}
{"game_id": "0021700363", "chunk_id": "0021700363_026", "order": 26, "role": "body", "text": "The game matched the top two picks of the 2016 draft, with No. 1 selection Simmons facing off with No. 2 pick Ingram."}
{"game_id": "0021700363", "chunk_id": "0021700363_027", "order": 27, "role": "body", "text": "Simmons drew \"oohs\" and \"ahhs\" in the third quarter when he spun left before throwing down an emphatic right-handed dunk."}
{"game_id": "0021700363", "chunk_id": "0021700363_028", "order": 28, "role": "body", "text": "But Ingram got the last laugh."}
{"game_id": "0021700363", "chunk_id": "0021700363_029", "order": 29, "role": "body", "text": "\"It is (fun),\" Ingram said of playing against Simmons. \"He's a really good player. He gets his team involved. He's a leader of his basketball team.\""}
{"game_id": "0021700363", "chunk_id": "0021700363_031", "order": 31, "role": "body", "text": "Philadelphia's faithful lived up to their reputation as hearty sports fans, drawing praise from the Lakers."}
{"game_id": "0021700363", "chunk_id": "0021700363_032", "order": 32, "role": "body", "text": "\"They have great fans here,\" Randle said. \"It felt like a college atmosphere.\""}
{"game_id": "0021700363", "chunk_id": "0021700363_033", "order": 33, "role": "body", "text": "Philadelphia clawed within 90-86 on Holmes' three-point play with 6:56 left, drawing such a loud reaction from the sold-out crowd that it sounded like the glory days of Allen Iverson exciting the 76ers followers."}
{"game_id": "0021700363", "chunk_id": "0021700363_034", "order": 34, "role": "body", "text": "\"The fans out there were crazy,\" Ingram said. \"It was amazing how poised our team stayed (for) how loud it was in that basketball gym.\""}
{"game_id": "0021700363", "chunk_id": "0021700363_036", "order": 36, "role": "body", "text": "Earlier Thursday, Philadelphia traded Jahlil Okafor to the Brooklyn Nets. The deal ended a stalemate that had kept Okafor, the No. 3 pick in the 2015 draft, on the bench for all but two games this season."}
{"game_id": "0021700363", "chunk_id": "0021700363_037", "order": 37, "role": "body", "text": "The Sixers also sent seldom-used guard Nik Stauskas, the No. 8 overall pick in the 2014 draft, and a 2019 second-round pick to the Nets for forward Trevor Booker. Booker, the 23rd overall pick of the 2010 draft by Washington, averaged 10.1 points with the Nets."}
{"game_id": "0021700363", "chunk_id": "0021700363_039", "order": 39, "role": "body", "text": "Lakers: Former Villanova standout Josh Hart had four points in 9 minutes. ... Los Angeles improved to 3-8 on the road. ... The Lakers won despite shooting 12 for 24 from the free-throw line. ... They entered averaging 17.5 turnovers per game, including 18.4 during the losing streak, but finished with just 11 against Philadelphia."}
{"game_id": "0021700363", "chunk_id": "0021700363_040", "order": 40, "role": "body", "text": "76ers: The triple-double was the third of Simmons' career. ... F Dario Saric didn't play after suffering a left eye laceration in Wednesday's practice. ... G T.J. McConnell returned after missing three games due to a sprained AC joint in his left shoulder and went scoreless in 17 minutes. ... Embiid had 46 points, 15 rebounds, seven assists and seven blocks in the 76ers' 115-109 win in Los Angeles on Nov. 15."}
{"game_id": "0021700363", "chunk_id": "0021700363_042", "order": 42, "role": "body", "text": "Lakers: Play second of four-game trip at Charlotte on Saturday night."}
{"game_id": "0021700363", "chunk_id": "0021700363_043", "order": 43, "role": "body", "text": "76ers: Play at Cleveland on Saturday night, looking to avenge a 113-91 home loss last month."}
{"game_id": "0021700363", "chunk_id": "0021700363_045", "order": 45, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
