{"game_id": "0021300280", "chunk_id": "0021300280_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  After watching Jeffery Taylor lead Charlotte to its latest win, Bobcats coach Steve Clifford was full of praise for his young star."}
{"game_id": "0021300280", "chunk_id": "0021300280_002", "order": 2, "role": "body", "text": "Taylor matched a career high with 20 points, leading six teammates in double figures, and Charlotte beat the Philadelphia 76ers 105-88 on Friday night."}
{"game_id": "0021300280", "chunk_id": "0021300280_003", "order": 3, "role": "body", "text": "\"He's a talented guy,\" Clifford said of the 24-year-old Taylor. \"He's at that age where guys make the biggest jump. Certainly he has the size, athleticism and intelligence to get his game to the next level. And he's a hard worker.\""}
{"game_id": "0021300280", "chunk_id": "0021300280_004", "order": 4, "role": "body", "text": "Subbing for injured starter Michael Kidd-Gilchrist at small forward, Taylor mixed mid-range jumpers with athletic drives and cuts to the basket to scored nine of Charlotte's first 22 points."}
{"game_id": "0021300280", "chunk_id": "0021300280_005", "order": 5, "role": "body", "text": "\"I was just trying to take the opportunities as they came to me,\" said Taylor, a second-round draft pick in his second NBA season. \"A lot of the same shots I made tonight haven't been going in for me lately. I just tried to stay aggressive and take what the defense gave to me.\""}
{"game_id": "0021300280", "chunk_id": "0021300280_006", "order": 6, "role": "body", "text": "Gerald Henderson and Kemba Walker added 18 apiece, and Walker also had a season-high 10 assists. Al Jefferson had 14 points and 12 rebounds, Ramon Sessions added 13 points and rookie Cody Zeller chipped in with 10."}
{"game_id": "0021300280", "chunk_id": "0021300280_007", "order": 7, "role": "body", "text": "Philadelphia was led by Tony Wroten's 21 points. Evan Turner added 16, Hollis Thompson scored 12 and Spencer Hawes had 10 points and 13 rebounds."}
{"game_id": "0021300280", "chunk_id": "0021300280_008", "order": 8, "role": "body", "text": "The Sixers played without starting point guard Michael Carter-Williams, who came in averaging 17.7 points. The rookie sat out because of a sore right knee."}
{"game_id": "0021300280", "chunk_id": "0021300280_009", "order": 9, "role": "body", "text": "Taylor impressed even Philadelphia coach Brett Brown."}
{"game_id": "0021300280", "chunk_id": "0021300280_010", "order": 10, "role": "body", "text": "\"He's a good player,\" Brown said. \"You look at his length and you look at his toughness and that's a rare combination. ... He had personal pride in attacking us.\""}
{"game_id": "0021300280", "chunk_id": "0021300280_011", "order": 11, "role": "body", "text": "In addition to playing without Kidd-Gilchrist, out four to six weeks after breaking his left hand during a loss at Dallas last Tuesday, the Bobcats lost backup center Bismack Biyombo to a right ankle sprain in the first half."}
{"game_id": "0021300280", "chunk_id": "0021300280_012", "order": 12, "role": "body", "text": "In a matchup of defensive-minded teams, the opening quarter was an up-and-down affair that ended with the Bobcats leading 36-33 after shooting 56 percent from the field (14 of 25). They never trailed again, eventually leading by as many as 18 points in the fourth quarter while shooting 46 percent for the game."}
{"game_id": "0021300280", "chunk_id": "0021300280_013", "order": 13, "role": "body", "text": "The Bobcats have held opponents under 100 points for 13 consecutive games, most in the NBA."}
{"game_id": "0021300280", "chunk_id": "0021300280_014", "order": 14, "role": "body", "text": "The Sixers cooled off after hitting seven of their first 12 shots, but Charlotte shot 54 percent (25 of 46) in the first half. The Bobcats took a 62-51 halftime lead on Jefferson's tip-in of a missed layup by Walker at the second-quarter buzzer."}
{"game_id": "0021300280", "chunk_id": "0021300280_015", "order": 15, "role": "body", "text": "\"I feel like the whole first half was not very good for us defensively,\" Brown said of the Sixers."}
{"game_id": "0021300280", "chunk_id": "0021300280_016", "order": 16, "role": "body", "text": "Wroten added: \"We've got to start the game off better defensively. We played better on defense in the second half, but we've just got to play defense like that for the whole 48 minutes.\""}
{"game_id": "0021300280", "chunk_id": "0021300280_017", "order": 17, "role": "body", "text": "Jefferson scored the first two baskets of the third to give the Bobcats the first of what would be multiple 15-point leads in the quarter. The lead swelled to as much as 18 in the fourth as the Bobcats continued running and scoring almost at will in transition, evidenced by the 22-10 edge they held in fast-break points for the game."}
{"game_id": "0021300280", "chunk_id": "0021300280_018", "order": 18, "role": "closing", "text": "The 105 points represented a season high for the Bobcats, only the second time they surpassed the 100-point mark. The only other time came in a 102-97 win at New York on Nov. 5."}
