{"game_id": "0021200813", "chunk_id": "0021200813_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Taj Gibson said the Chicago Bulls need to get back to last season's philosophy of putting tough losses behind them and not dropping back-to-back games."}
{"game_id": "0021200813", "chunk_id": "0021200813_002", "order": 2, "role": "body", "text": "They did just that on Friday night."}
{"game_id": "0021200813", "chunk_id": "0021200813_003", "order": 3, "role": "body", "text": "Gibson scored 17 points on 8-of-11 shooting to lead a balanced scoring attack as the Bulls beat Michael Jordan's Charlotte Bobcats 105-75. The win came after a disappointing 19-point loss at home to the Miami Heat on Thursday night."}
{"game_id": "0021200813", "chunk_id": "0021200813_004", "order": 4, "role": "body", "text": "\"We liked the way were able to bounce back after a bad loss,\" Gibson said. \"Last year we wouldn't allow ourselves to lose two straight games. We need that same mindset.\""}
{"game_id": "0021200813", "chunk_id": "0021200813_005", "order": 5, "role": "body", "text": "Now the tough part will be stringing two wins together."}
{"game_id": "0021200813", "chunk_id": "0021200813_006", "order": 6, "role": "body", "text": "The Bulls travel to Oklahoma City to play the Thunder on Sunday night in a game that figures to be a good measuring stick for Chicago, which was has lost five of its last eight."}
{"game_id": "0021200813", "chunk_id": "0021200813_008", "order": 8, "role": "body", "text": "With Jordan looking on from the end of the Charlotte bench, the Bulls jumped out to a 38-19 lead midway through the second quarter and never looked back. Jordan, the Bobcats owner and former Bulls star, left his seat with about 3 minutes left in the first half and didn't return."}
{"game_id": "0021200813", "chunk_id": "0021200813_009", "order": 9, "role": "body", "text": "The Bulls had failed to score 100 points in their previous six games and were held to 67 by Miami on Thursday night, but found their groove against the NBA-worst Bobcats."}
{"game_id": "0021200813", "chunk_id": "0021200813_010", "order": 10, "role": "body", "text": "Carlos Boozer had 10 points and 10 rebounds as eight Bulls finished in double figures."}
{"game_id": "0021200813", "chunk_id": "0021200813_011", "order": 11, "role": "body", "text": "Luol Deng added 14 points, Nate Robinson, Marco Belinelli and Richard Hamilton all had 12, and Joakim Noah finished with 10 points, eight rebounds and eight assists."}
{"game_id": "0021200813", "chunk_id": "0021200813_012", "order": 12, "role": "body", "text": "\"We were able to get out in transition and get some easy baskets,\" Noah said. \"We had a lot of good ball movement. Everybody was getting an opportunity to score and it just became contagious.\""}
{"game_id": "0021200813", "chunk_id": "0021200813_013", "order": 13, "role": "body", "text": "Bulls coach Tom Thibodeau was happy with his team's energy in what amounted to a trap game."}
{"game_id": "0021200813", "chunk_id": "0021200813_014", "order": 14, "role": "body", "text": "\"We were disappointed in the way we played against Miami,\" Thibodeau said. \"And we felt that we beat ourselves yesterday, so we wanted to correct that. I thought we responded well. The important thing was that we approached today from a standpoint of learning from our mistakes. You can use the (excuse) of `back to back' or `we got in late' and we did none of that. We chose to work, got the lead early and played hard and played well.\""}
{"game_id": "0021200813", "chunk_id": "0021200813_015", "order": 15, "role": "body", "text": "The Bobcats shot 33 percent from the field and lost by 20 points or more for the 10th time this season."}
{"game_id": "0021200813", "chunk_id": "0021200813_016", "order": 16, "role": "body", "text": "Kemba Walker had 27 points to lead Charlotte -- his third straight 20-point game -- but he wasn't happy with his performance."}
{"game_id": "0021200813", "chunk_id": "0021200813_017", "order": 17, "role": "body", "text": "\"We started off too late,\" Walker said. \"We have to kick it off from the jump. I blame myself. I had to set the tempo.\""}
{"game_id": "0021200813", "chunk_id": "0021200813_018", "order": 18, "role": "body", "text": "It was the sluggish Bobcats who looked as though they were on the tail end of a back-to-back."}
{"game_id": "0021200813", "chunk_id": "0021200813_019", "order": 19, "role": "body", "text": "Charlotte shot just 31 percent from the field in the first half and trailed 51-37 at the break. Meanwhile, the Bulls played with energy from the start, forcing four quick turnovers to build an early 10-point lead they never relinquished."}
{"game_id": "0021200813", "chunk_id": "0021200813_020", "order": 20, "role": "body", "text": "Chicago finished with 37 assists and only six turnovers."}
{"game_id": "0021200813", "chunk_id": "0021200813_021", "order": 21, "role": "body", "text": "Charlotte's three highest-paid players -- Ben Gordon ($12.4 million), Tyrus Thomas ($8 million) and Gana Diop ($7.4 million) -- didn't play."}
{"game_id": "0021200813", "chunk_id": "0021200813_022", "order": 22, "role": "body", "text": "Gordon had been a regular reserve but fell out of favor with coach Mike Dunlap before the All-Star break after being disruptive in practice. The team attempted to trade him but was unable to unload his contract."}
{"game_id": "0021200813", "chunk_id": "0021200813_023", "order": 23, "role": "body", "text": "When asked if Gordon not playing was discipline-related, Dunlap said, \"It was more (the younger players) getting more minutes. That's not what drove it. What drove it was to get our young guys more minutes.\""}
{"game_id": "0021200813", "chunk_id": "0021200813_024", "order": 24, "role": "body", "text": "Dunlap hinted that things aren't likely to change anytime soon for Gordon, who is due to make $13 million next season."}
{"game_id": "0021200813", "chunk_id": "0021200813_025", "order": 25, "role": "body", "text": "\"You're trying to develop a core, so you want to get those young guys minutes,\" he said."}
{"game_id": "0021200813", "chunk_id": "0021200813_026", "order": 26, "role": "closing", "text": "Game notes  The Bobcats have lost their last four home games against Chicago by an average margin of 30 points. ... Bobcats center Byron Mullens came in averaging 17.6 points and 9.3 rebounds over the past nine games, but was held to two points on 1-of-12 shooting and had just four rebounds. ... Boozer had his fourth straight double-double and his 28th of the season."}
