{"game_id": "0021700149", "chunk_id": "0021700149_001", "order": 1, "role": "lead", "text": "CLEVELAND --  Kevin Love joked that he might swing by the hospital on his way home."}
{"game_id": "0021700149", "chunk_id": "0021700149_002", "order": 2, "role": "body", "text": "On a recent visit, he got a dose of something that made him and the Cavaliers feel better."}
{"game_id": "0021700149", "chunk_id": "0021700149_003", "order": 3, "role": "body", "text": "Love scored a season-high 32 points without attempting a 3-pointer, LeBron James added 30 following an interesting couple days on social media, and Cleveland withstood a 40-point performance by Giannis Antetokounmpo to beat the Milwaukee Bucks 124-119 on Tuesday night."}
{"game_id": "0021700149", "chunk_id": "0021700149_004", "order": 4, "role": "body", "text": "The Cavs have been one of the NBA's biggest surprises this season -- for all the wrong reasons. But after losing five of six, they did enough to hand the young-and-improving Bucks their fourth straight loss and keep Cleveland fans from panicking."}
{"game_id": "0021700149", "chunk_id": "0021700149_005", "order": 5, "role": "body", "text": "Love was briefly hospitalized after scoring just four points and leaving a surprising loss to Atlanta in the third quarter on Sunday. Following his best game this season, Cleveland's center was asked what IV medications he received."}
{"game_id": "0021700149", "chunk_id": "0021700149_006", "order": 6, "role": "body", "text": "\"I don't know,\" he said with a smile. \"Whatever they gave me I might go back and check myself in tonight.\""}
{"game_id": "0021700149", "chunk_id": "0021700149_007", "order": 7, "role": "body", "text": "Love added 16 rebounds. J.R. Smith found his stroke and added a season-high 20 points for the Cavs."}
{"game_id": "0021700149", "chunk_id": "0021700149_008", "order": 8, "role": "body", "text": "\"That's my guy,\" James said of Smith, who went 5 of 7 on 3-pointers while wearing a model of James' sneakers. \"Swish is my guy and he's been struggling the first 10 games. I told him it was the shoes. He finally decided to wear my shoes. After a long conversation we finally decided to wear them and he had a breakout game."}
{"game_id": "0021700149", "chunk_id": "0021700149_009", "order": 9, "role": "body", "text": "\"He hit the 3-ball, got into the paint. That was Swish. We're gonna need more of that from him a lot coming up.\""}
{"game_id": "0021700149", "chunk_id": "0021700149_010", "order": 10, "role": "body", "text": "Still a few weeks shy of his 23rd birthday, the multi-talented Antetokounmpo finished 16 of 21 from the floor. He also had nine rebounds and eight turnovers before fouling out with 18 seconds left."}
{"game_id": "0021700149", "chunk_id": "0021700149_011", "order": 11, "role": "body", "text": "Malcolm Brogdon had 22 points for Milwaukee, and Khris Middleton finished with 20."}
{"game_id": "0021700149", "chunk_id": "0021700149_012", "order": 12, "role": "body", "text": "Before the game, the Bucks got some scoring help by acquiring guard Eric Bledsoe from Phoenix in exchange for forward/center Greg Monroe and two draft picks."}
{"game_id": "0021700149", "chunk_id": "0021700149_013", "order": 13, "role": "body", "text": "Afterward, coach Jason Kidd complained about the officiating. Milwaukee was called for 31 personals compared to 18 for Cleveland, and the Cavs attempted 38 free throws."}
{"game_id": "0021700149", "chunk_id": "0021700149_014", "order": 14, "role": "body", "text": "Kidd pointed out that over the past three games, opponents have tried 95 free throws to 40 for Milwaukee."}
{"game_id": "0021700149", "chunk_id": "0021700149_015", "order": 15, "role": "body", "text": "\"I just got fined,\" he said. \"That's one way. The other way is by expressing to the officials and I did that the whole night. The different crews that we've had have been awful.\""}
{"game_id": "0021700149", "chunk_id": "0021700149_016", "order": 16, "role": "body", "text": "Cleveland's start to the season has been puzzling on so many levels. Loaded with as much talent as any team in the league, the Eastern Conference champions have been beating good teams and losing to squads they should be handling."}
{"game_id": "0021700149", "chunk_id": "0021700149_017", "order": 17, "role": "body", "text": "\"We don't want to,\" Love said. \"We'd rather come out and play -- because we're capable -- at a high level of basketball every single game. We have a ton of talent in here.\""}
{"game_id": "0021700149", "chunk_id": "0021700149_018", "order": 18, "role": "body", "text": "The myriad issues have led to the usual scrutiny of James, who caused a stir on social media Monday night."}
{"game_id": "0021700149", "chunk_id": "0021700149_019", "order": 19, "role": "body", "text": "Moments after former teammate Kyrie Irving and the Boston Celtics beat the Hawks for their ninth straight win, James posted a meme on his Instagram account of the kids' cartoon character Arthur with a clenched fist with the caption \"mood.\""}
{"game_id": "0021700149", "chunk_id": "0021700149_020", "order": 20, "role": "body", "text": "Asked for the meaning, James shrugged."}
{"game_id": "0021700149", "chunk_id": "0021700149_023", "order": 23, "role": "body", "text": "Plagued by slow starts through their first 10 games, the Cavs came out with better intensity and focus."}
{"game_id": "0021700149", "chunk_id": "0021700149_024", "order": 24, "role": "body", "text": "Cleveland shot 69 percent from the floor (11 of 16) and made 14 of 15 free throws in the first quarter while opening an 11-point lead. It was a much better showing from the Cavs' starters, who were criticized by Dwyane Wade after Sunday's loss."}
{"game_id": "0021700149", "chunk_id": "0021700149_026", "order": 26, "role": "body", "text": "Bledsoe will take some of the pressure off Antetokounmpo, the league's leading scorer."}
{"game_id": "0021700149", "chunk_id": "0021700149_027", "order": 27, "role": "body", "text": "\"He's a great player,\" he said. \"He's going help the team. He's going to make the game easier for everyone.\""}
{"game_id": "0021700149", "chunk_id": "0021700149_029", "order": 29, "role": "body", "text": "Bucks: Brogdon has picked up his scoring. He has three straight 20-point games for the first time in his career. \"He worked extremely hard this summer on his game,\" Kidd said. \"He knows what's coming. He knows what to expect.\" ... C John Henson had two fouls in the first three minutes and was plagued by foul trouble all game. He also picked up a technical."}
{"game_id": "0021700149", "chunk_id": "0021700149_030", "order": 30, "role": "body", "text": "Cavaliers: James played in his 1,072nd game, tying him for 82nd place on the career list with a certain Michael Jeffrey Jordan. ... Smith passed Rashard Lewis (1,787) for 14th place on the NBA's career 3-pointers made list. ... Love didn't attempt a 3-pointer for the first time since Jan. 23, 2015. ... G Iman Shumpert returned after missing a week with a sore right knee and scored six points in 19 minutes."}
{"game_id": "0021700149", "chunk_id": "0021700149_032", "order": 32, "role": "body", "text": "Bucks: At San Antonio on Friday."}
{"game_id": "0021700149", "chunk_id": "0021700149_033", "order": 33, "role": "body", "text": "Cavaliers: Begin a four-game road trip on Thursday at Houston."}
{"game_id": "0021700149", "chunk_id": "0021700149_035", "order": 35, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
