{"game_id": "0021200223", "chunk_id": "0021200223_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Jason Richardson says he knew the Philadelphia 76ers' poor shooting at the start of the season wouldn't last."}
{"game_id": "0021200223", "chunk_id": "0021200223_002", "order": 2, "role": "body", "text": "If his teammates continue to shoot the way they did Friday night, it might not be an issue again."}
{"game_id": "0021200223", "chunk_id": "0021200223_003", "order": 3, "role": "body", "text": "For the fifth time in six games, the 76ers eclipsed 100 points as Evan Turner scored 25 and Richardson hit four 3-pointers down the stretch to beat the Charlotte Bobcats 104-98 for their third consecutive victory."}
{"game_id": "0021200223", "chunk_id": "0021200223_004", "order": 4, "role": "body", "text": "Jrue Holiday added 13 points and a career-high 15 assists for Philadelphia, which shot 51 percent from the field. Richardson had 14 of his 22 points in the final period, and Turner was 10 of 15 from the field for the game."}
{"game_id": "0021200223", "chunk_id": "0021200223_005", "order": 5, "role": "body", "text": "The recent stretch is a far cry from the first four games of the season when the 76ers averaged 83.3 points per game."}
{"game_id": "0021200223", "chunk_id": "0021200223_006", "order": 6, "role": "body", "text": "\"I was never really worried about that,\" Richardson said. \"I knew we had guys that could score and I just thought we were going through a (cold) streak.\""}
{"game_id": "0021200223", "chunk_id": "0021200223_007", "order": 7, "role": "body", "text": "Focused on stopping Holiday and Turner in the lane, the Bobcats too often left Richardson alone in the corner for open looks in the fourth quarter."}
{"game_id": "0021200223", "chunk_id": "0021200223_008", "order": 8, "role": "body", "text": "He repeatedly knocked them down."}
{"game_id": "0021200223", "chunk_id": "0021200223_009", "order": 9, "role": "body", "text": "\"I was very surprised,\" Richardson said. \"There were a couple of other times I looked at the clock and knew we had to burn some time. But I was shocked they left me open so many times.\""}
{"game_id": "0021200223", "chunk_id": "0021200223_010", "order": 10, "role": "body", "text": "The 31-year-old Richardson doesn't play as much as he once did and said the competitor in him clearly misses those minutes."}
{"game_id": "0021200223", "chunk_id": "0021200223_011", "order": 11, "role": "body", "text": "But he knows spot duty and being used down the stretch is probably best for him and the team at this point in his career."}
{"game_id": "0021200223", "chunk_id": "0021200223_012", "order": 12, "role": "body", "text": "\"That's one of the parts about getting older,\" Richardson said. \"You don't want to admit that you get tired being out there that long. But I'm just doing whatever I can to help this team. Right now it's about winning games and helping Philadelphia win a championship.\""}
{"game_id": "0021200223", "chunk_id": "0021200223_013", "order": 13, "role": "body", "text": "Sixers coach Doug Collins called Richardson his \"ace of spades\" on Friday night."}
{"game_id": "0021200223", "chunk_id": "0021200223_014", "order": 14, "role": "body", "text": "Collins said he spoke with Richardson after the game and told him, \"I need you fresh at the end of the game and I think you can see why.\""}
{"game_id": "0021200223", "chunk_id": "0021200223_015", "order": 15, "role": "body", "text": "\"Those were big shots that he made for us and the big plays, so he was tremendous,\" Collins said."}
{"game_id": "0021200223", "chunk_id": "0021200223_016", "order": 16, "role": "body", "text": "Philadelphia (10-6) had 54 points in the paint, most of those in the first half. Thaddeus Young had 15 points and Lavoy Allen contributed 10 points and 10 rebounds."}
{"game_id": "0021200223", "chunk_id": "0021200223_017", "order": 17, "role": "body", "text": "Ben Gordon led Charlotte with 19 points, and rookie Jeffery Taylor matched a career high with 16. The Bobcats (7-8) have dropped three straight and four of five to fall below .500."}
{"game_id": "0021200223", "chunk_id": "0021200223_018", "order": 18, "role": "body", "text": "\"Any time we trade baskets with a good team, a quality team, like that, you know it's going to bite you,\" Gordon said. \"We didn't do a good job of getting stops when we needed, getting key rebounds when we needed it. You know, you can't let a team that shoots that high of a percentage score that many points. We've just got to clean up our defensive intensity.\""}
{"game_id": "0021200223", "chunk_id": "0021200223_019", "order": 19, "role": "body", "text": "There were 15 lead changes in the first half, but Philadelphia held a lead for all of the third quarter and into the fourth before Ramon Sessions' steal and layup tied the game at 81 with 9:17 left."}
{"game_id": "0021200223", "chunk_id": "0021200223_020", "order": 20, "role": "body", "text": "But that's when Richardson began to heat up, hitting three 3-pointers to help push Philadelphia's lead to 95-87 with 3:55 to go. Charlotte made one last run to pull within four with 1:11 left before Richardson responded with a 3 from the left corner to seal the win."}
{"game_id": "0021200223", "chunk_id": "0021200223_021", "order": 21, "role": "body", "text": "Despite the loss, Bobcats coach Mike Dunlap is pleased with his team. With seven wins, Charlotte has already matched last season's total."}
{"game_id": "0021200223", "chunk_id": "0021200223_022", "order": 22, "role": "body", "text": "\"I see the improvement within the losing,\" Dunlap said. \"Maybe some don't and maybe they want to rush us. I'd certainly like to win a game like tonight, but I thought we did a marvelous job of coming back into this game. But this is a playoff team we played, so I think we ultimately have to raise our eyes and understand where we're at on the continuum of improvement.\""}
{"game_id": "0021200223", "chunk_id": "0021200223_023", "order": 23, "role": "closing", "text": "Game notes Young scored in double digits for the 14th time this season. ... Bobcats backup center Bismack Biyombo continues to make strides, tying a career high with 14 points. However, Biyombo's foul shooting remains an adventure. He went 4 of 8 on Friday night and teams will continue to take advantage of that as long as he's in the game. ... Turner scored 20 or more points for the third time in four games."}
