{"game_id": "0021200336", "chunk_id": "0021200336_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Orlando Magic are beginning to learn how to close out games."}
{"game_id": "0021200336", "chunk_id": "0021200336_002", "order": 2, "role": "body", "text": "That's a lesson the Charlotte Bobcats have yet to master."}
{"game_id": "0021200336", "chunk_id": "0021200336_003", "order": 3, "role": "body", "text": "Glen Davis and Arron Afflalo each scored 20 points and Orlando outscored Charlotte 15-5 in the final 3:34 to hand the slumping Bobcats their 11th straight loss Saturday night, 107-98."}
{"game_id": "0021200336", "chunk_id": "0021200336_004", "order": 4, "role": "body", "text": "Jameer Nelson added 16 points and six assists and J.J. Redick had 14 points, including a big 3-pointer down the stretch for the Magic, who've won three of their past four. Nikola Vucevic was a force inside the paint with 13 points and 13 rebounds."}
{"game_id": "0021200336", "chunk_id": "0021200336_005", "order": 5, "role": "body", "text": "\"This is a new team and we're still finding each other,\" Davis said. \"As a team, we're learning and this was a game where we learned from our past experience.\""}
{"game_id": "0021200336", "chunk_id": "0021200336_006", "order": 6, "role": "body", "text": "Magic coach Jacque Vaughn said his team is showing better composure down the stretch."}
{"game_id": "0021200336", "chunk_id": "0021200336_007", "order": 7, "role": "body", "text": "\"Our huddle was composed, the players were composed and I think it showed on the floor,\" Vaughn said. \"It was great to see and great to see the process and our guys improving.\""}
{"game_id": "0021200336", "chunk_id": "0021200336_008", "order": 8, "role": "body", "text": "It helped that the Magic scored 60 points in the paint on 30-of-45 shooting."}
{"game_id": "0021200336", "chunk_id": "0021200336_009", "order": 9, "role": "body", "text": "\"We were just being aggressive,\" Davis said. \"With me down there scoring some points and Arron and Jameer making things happen, it kind of set the tone for our play. And we were able to control the paint.\""}
{"game_id": "0021200336", "chunk_id": "0021200336_010", "order": 10, "role": "body", "text": "The Orlando win overshadowed a career-high 32 points from Kemba Walker."}
{"game_id": "0021200336", "chunk_id": "0021200336_011", "order": 11, "role": "body", "text": "Charlotte's second-year point guard was 11 of 19 from the field."}
{"game_id": "0021200336", "chunk_id": "0021200336_013", "order": 13, "role": "body", "text": "\"I'm trying to get better,\" Walker said. \"That's all you do at this point. I'm just doing whatever I can do to help my team win basketball games. No matter how many points I have I really don't care about that stuff. I'm just trying to win. It wasn't enough tonight.\""}
{"game_id": "0021200336", "chunk_id": "0021200336_014", "order": 14, "role": "body", "text": "Walker, Charlotte's first-round pick a season ago, has excelled this season, particularly at home where he came in shooting 45 percent and averaging 20.4 points per game; compared to 32 percent and 12.4 points per game on the road."}
{"game_id": "0021200336", "chunk_id": "0021200336_015", "order": 15, "role": "body", "text": "Nelson, for one, walked away impressed."}
{"game_id": "0021200336", "chunk_id": "0021200336_016", "order": 16, "role": "body", "text": "\"He's a great young player,\" Nelson said of Walker. \"He's quick and one of the best scoring point guards in the league. There's a lot of time left in his career and he's going to get better.\""}
{"game_id": "0021200336", "chunk_id": "0021200336_017", "order": 17, "role": "body", "text": "The Magic shot 54.5 percent from the field, led by Davis and Afflalo, who were a combined 15 of 25."}
{"game_id": "0021200336", "chunk_id": "0021200336_018", "order": 18, "role": "body", "text": "Orlando led 92-88 when Walker hit a long 3 from the top of the key. On Orlando's next possession Davis spun to the basket, but Byron Mullens had a two-handed block igniting a fast-break layup on the other end for Walker to give Charlotte the lead with 4:07 left in the game."}
{"game_id": "0021200336", "chunk_id": "0021200336_020", "order": 20, "role": "body", "text": "Afflalo gave the Magic the lead back for good seconds later with a turnaround jumper in the lane igniting an 8-0 run."}
{"game_id": "0021200336", "chunk_id": "0021200336_021", "order": 21, "role": "body", "text": "After Davis added a free throw, Redick came off a screen and knocked down a wide open 3-pointer at the top of the key to push the lead to five."}
{"game_id": "0021200336", "chunk_id": "0021200336_022", "order": 22, "role": "body", "text": "As Charlotte struggled to hit shots down the stretch, Nelson made a baseline jumper just as the shot clock expired and Vucevic sent the crowd heading to the exits after scoring and drawing a foul on a nice drive and pass from Nelson to give the Magic a 105-98 lead."}
{"game_id": "0021200336", "chunk_id": "0021200336_023", "order": 23, "role": "body", "text": "Gerald Henderson had 16 points and Ramon Sessions added 14 for Charlotte."}
{"game_id": "0021200336", "chunk_id": "0021200336_024", "order": 24, "role": "body", "text": "In what has been a familiar refrain for the Bobcats, they struggled down the stretch missing six shots on their final seven possessions and turned the ball over once."}
{"game_id": "0021200336", "chunk_id": "0021200336_025", "order": 25, "role": "body", "text": "Meanwhile, they struggled again to make big stops when they needed to."}
{"game_id": "0021200336", "chunk_id": "0021200336_026", "order": 26, "role": "body", "text": "\"Teams are just adjusting to what we do,\" Sessions said. \"I can't state that enough. We just have to make adjustments. I don't know what it is but some type of adjustment has to be made on the offensive end and the defensive end.\""}
{"game_id": "0021200336", "chunk_id": "0021200336_027", "order": 27, "role": "body", "text": "Said Bobcats coach Mike Dunlap: \"We had some good looks and the fact of the matter is there were some 15-footers and six-footers that didn't go in. That makes it frustrating when you lose games.\""}
{"game_id": "0021200336", "chunk_id": "0021200336_028", "order": 28, "role": "body", "text": "But Dunlap said the real problem has been the Bobcats defense"}
{"game_id": "0021200336", "chunk_id": "0021200336_029", "order": 29, "role": "body", "text": "Charlotte has allowed opponents to score at least 100 points in 12 of its past 13 games."}
{"game_id": "0021200336", "chunk_id": "0021200336_030", "order": 30, "role": "body", "text": "\"When you give up 54 percent shooting from the floor and they're getting over 100 points regularly we know what the culprit is,\" Dunlap said."}
{"game_id": "0021200336", "chunk_id": "0021200336_031", "order": 31, "role": "closing", "text": "Game notes Looking for a spark, Dunlap reinserted Henderson into the starting lineup in place of Taylor. Henderson hadn't started since injuring his foot in Week 2.  ... Afflalo and Davis both finished in double digits in scoring for the 20th time this season. ... Magic forward Maurice Harkless tied a career high with four blocked shots."}
