{"game_id": "0021300356", "chunk_id": "0021300356_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Detroit beat Indiana at its own game Monday night."}
{"game_id": "0021300356", "chunk_id": "0021300356_002", "order": 2, "role": "body", "text": "The Pistons were tougher inside, tougher on defense and tougher at fending off challenges."}
{"game_id": "0021300356", "chunk_id": "0021300356_003", "order": 3, "role": "body", "text": "On a night the Eastern Conference's best team looked like anything but, Josh Smith scored 30 points and Greg Monroe had 13 points and 12 rebounds to help Detroit send Indiana to a 101-96 loss -- the Pacers' first at home this season."}
{"game_id": "0021300356", "chunk_id": "0021300356_004", "order": 4, "role": "body", "text": "\"It's impressive the way we came in and competed with the way the Pacers have been playing,\" Pistons coach Maurice Cheeks said. \"We have a good basketball team.\""}
{"game_id": "0021300356", "chunk_id": "0021300356_005", "order": 5, "role": "body", "text": "Detroit (12-14) proved it with a nearly perfect game."}
{"game_id": "0021300356", "chunk_id": "0021300356_006", "order": 6, "role": "body", "text": "The Pistons dominated on the glass with a 55-40 overall advantage and a 20-9 edge on offensive rebounds. They matched the Pacers' shooting percentage of 43.2 percent, had one more 3-pointer and nearly an identical shooting percentage on 3s (35.3 to 35.0), outscored Indiana 44-38 in the paint and 22-14 on second-chance points."}
{"game_id": "0021300356", "chunk_id": "0021300356_007", "order": 7, "role": "body", "text": "For a Pacers team that prides itself on defense and rebounding, it wasn't even close to their best."}
{"game_id": "0021300356", "chunk_id": "0021300356_008", "order": 8, "role": "body", "text": "Detroit also finished with nearly as many blocks (seven) as turnovers (eight) and made five of six free throws during the final minute to hold off Indiana's last charge."}
{"game_id": "0021300356", "chunk_id": "0021300356_009", "order": 9, "role": "body", "text": "The most surprising element was that Indiana never tied the score in the second half and never took the lead on its home floor, where it had gone 11-0 before Monday night. The loss leaves the Pacers (20-4) with the second-best record in the league, percentage points behind Portland (21-4)."}
{"game_id": "0021300356", "chunk_id": "0021300356_010", "order": 10, "role": "body", "text": "The Pistons knew that to end their six-game losing streak in this series and their nine-game losing streak at Bankers Life Fieldhouse, they needed to execute the game plan flawlessly. They did."}
{"game_id": "0021300356", "chunk_id": "0021300356_011", "order": 11, "role": "body", "text": "\"We're forming an identity ourselves,\" said Smith, who went 13 of 29 from the field after meeting with Cheeks about getting more opportunities. \"That has to be being a physical team, try to dominate the paint.\""}
{"game_id": "0021300356", "chunk_id": "0021300356_012", "order": 12, "role": "body", "text": "Indiana's uncharacteristic certainly helped the cause."}
{"game_id": "0021300356", "chunk_id": "0021300356_013", "order": 13, "role": "body", "text": "Paul George was 4 of 14 from the field, finishing with 17 points, nine rebounds and four turnovers. Roy Hibbert had six points and four rebounds. Even the energetic Lance Stephenson couldn't get his flustered teammates righted. Stephenson scored a career best 23 points and Luis Scola added a season high 18 points."}
{"game_id": "0021300356", "chunk_id": "0021300356_014", "order": 14, "role": "body", "text": "What went wrong for the usually unflappable Pacers?"}
{"game_id": "0021300356", "chunk_id": "0021300356_015", "order": 15, "role": "body", "text": "George said the offensive rebounds got Indiana out of sync."}
{"game_id": "0021300356", "chunk_id": "0021300356_016", "order": 16, "role": "body", "text": "Others wondered if the Pacers may have been looking past Detroit, which has won just two of their last six games, and ahead to Wednesday night's rematch with Miami. Indiana beat the two-time defending NBA champs on their home court 90-84 last week and have made no secret that they're out to get the Eastern Conference's No. 1 seed."}
{"game_id": "0021300356", "chunk_id": "0021300356_017", "order": 17, "role": "body", "text": "Indiana coach Frank Vogel quickly discounted that notion, calling Detroit a good team."}
{"game_id": "0021300356", "chunk_id": "0021300356_018", "order": 18, "role": "body", "text": "\"I don't think we were looking ahead at all,\" Vogel said. \"We've got to lick our wounds and see what we need to do better.\""}
{"game_id": "0021300356", "chunk_id": "0021300356_019", "order": 19, "role": "body", "text": "Whatever the explanation, these Pacers didn't even resemble the team that set one franchise record with its perfect 9-0 start and another by opening the season 11-0 at home. Oklahoma City is the last unbeaten team at home this season."}
{"game_id": "0021300356", "chunk_id": "0021300356_020", "order": 20, "role": "body", "text": "Detroit took charge quickly, using a 10-3 first quarter to take a 23-14 lead -- a lead it never relinquished."}
{"game_id": "0021300356", "chunk_id": "0021300356_021", "order": 21, "role": "body", "text": "Even in the second half, when the Pacers typically dominate, the Pistons refused."}
{"game_id": "0021300356", "chunk_id": "0021300356_022", "order": 22, "role": "body", "text": "Detroit scored the last eight points of the first half, turning a 49-49 tie into a 57-49 lead. Then Smith scored Detroit's first eight points in the second half, and the surging Pistons took advantage of Indiana's growing frustration by extending the lead to 72-61 on Brandon Jennings' layup with 5:20 left in the third quarter. Jennings finished with 18 points and eight assists."}
{"game_id": "0021300356", "chunk_id": "0021300356_023", "order": 23, "role": "body", "text": "Indiana rallied again, getting within 79-73 after three, but the Pistons answered with a 7-2 spurt that made it 89-79 with 7:01 to go. Scola's layup with 4:55 remaining ended an 8-0 run that got the Pacers as close as 89-87, but the Pistons ran off five straight points."}
{"game_id": "0021300356", "chunk_id": "0021300356_024", "order": 24, "role": "body", "text": "Stephenson gave it one final push, hitting a 3 with 1:17 to go to cut Detroit's lead to 96-94, but the Pistons closed it out at the free-throw line."}
{"game_id": "0021300356", "chunk_id": "0021300356_025", "order": 25, "role": "body", "text": "\"We had a lot of confidence coming in here tonight. We played Portland (Sunday) night in a game we should have won,\" Jennings said. \"Tonight we knew were playing the best team in the Eastern Conference and we were able to give them their first home loss.\""}
{"game_id": "0021300356", "chunk_id": "0021300356_026", "order": 26, "role": "closing", "text": "Game notes Indiana is the NBA's only team that has not been in a game decided by fewer than five points. ... Guard Chauncey Billups was inactive for the Pistons. ... Vogel said swingman Danny Granger is on track to return to the lineup Friday night against Houston. He has not played this season because of a strained left calf. ... Indiana fell to 10-3 when trailing at halftime."}
