{"game_id": "0021700225", "chunk_id": "0021700225_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Willie Cauley-Stein was very comfortable coming off the bench for the first time this season. Sacramento's 7-foot center was just as happy playing out of position, too."}
{"game_id": "0021700225", "chunk_id": "0021700225_002", "order": 2, "role": "body", "text": "Maybe coach Dave Joerger is onto something."}
{"game_id": "0021700225", "chunk_id": "0021700225_003", "order": 3, "role": "body", "text": "Cauley-Stein scored 13 of his 22 points in the fourth quarter while playing power forward in Joerger's new-look lineup, and the Kings bounced back from an embarrassing loss earlier in the week to beat the Portland Trail Blazers 86-82 on Friday night."}
{"game_id": "0021700225", "chunk_id": "0021700225_004", "order": 4, "role": "body", "text": "\"Coming off the bench and playing the 4 is good for me, playing in space and not being so claustrophobic in the lane all the time,\" Cauley-Stein said. \"I'm starting to unlock something in the game that I've been working on for a long time, the drive-and-kicks, getting in space and shooting jumpers now that the spacing on the floor is right.\""}
{"game_id": "0021700225", "chunk_id": "0021700225_005", "order": 5, "role": "body", "text": "Cauley-Stein had started every game at center for Sacramento this season before Joerger shuffled his lineup and put veteran Zach Randolph in."}
{"game_id": "0021700225", "chunk_id": "0021700225_006", "order": 6, "role": "body", "text": "That didn't seem to bother Cauley-Stein, who came on strong at the end. He scored 10 of the Kings' first 12 points in the fourth, including a pair of alley-oop dunks -- the first coming when Frank Mason got tangled up and found Cauley-Stein cutting down the lane."}
{"game_id": "0021700225", "chunk_id": "0021700225_007", "order": 7, "role": "body", "text": "\"Getting those easy buckets is key just to get in a rhythm,\" Cauley-Stein said. \"Everything else kind of goes from there.\""}
{"game_id": "0021700225", "chunk_id": "0021700225_008", "order": 8, "role": "body", "text": "Portland stayed close and pulled to 82-80 on a pair of free throws from C.J. McCollum, but De'Aaron Fox's 3-pointer helped Sacramento hold on."}
{"game_id": "0021700225", "chunk_id": "0021700225_009", "order": 9, "role": "body", "text": "The teams play again Saturday in Portland."}
{"game_id": "0021700225", "chunk_id": "0021700225_010", "order": 10, "role": "body", "text": "\"At the end of the day, I'm happy we have them tomorrow,\" Blazers center Jusuf Nurkic said. \"We're going to show them what we have.\""}
{"game_id": "0021700225", "chunk_id": "0021700225_011", "order": 11, "role": "body", "text": "George Hill and Garrett Temple added 14 points apiece, and Kosta Koufos had 10 points and seven rebounds to help the Kings to their third straight home win over a team with legitimate playoff hopes."}
{"game_id": "0021700225", "chunk_id": "0021700225_012", "order": 12, "role": "body", "text": "Neither team managed more than 23 points in any of the first three quarters, and the Kings didn't secure the victory until Cauley-Stein made one of two free throws with 3.4 seconds remaining."}
{"game_id": "0021700225", "chunk_id": "0021700225_013", "order": 13, "role": "body", "text": "\"We were playing against one of the top two or three rebounding teams in the league and we did a great job hustling down and coming down to get rebounds,\" Joerger said. \"All 11 guys who played got a defensive rebound, which is what we needed.\""}
{"game_id": "0021700225", "chunk_id": "0021700225_014", "order": 14, "role": "body", "text": "Damian Lillard had 29 points on 9-of-25 shooting and four assists but missed a 3-pointer in the final moments for Portland. McCollum added 19 points."}
{"game_id": "0021700225", "chunk_id": "0021700225_015", "order": 15, "role": "body", "text": "Two days after losing by 46 points in Atlanta, the Kings held off the Blazers with one of their best defensive efforts of the season. Portland committed 18 turnovers and set a season low in scoring."}
{"game_id": "0021700225", "chunk_id": "0021700225_016", "order": 16, "role": "body", "text": "\"They played with desperation defensively, they were aggressive (and) we didn't handle that very well,\" Blazers coach Terry Stotts said. \"It's hard to win a game shooting 37 percent. There are a lot of areas we could have played better, offensively and defensively.\""}
{"game_id": "0021700225", "chunk_id": "0021700225_017", "order": 17, "role": "body", "text": "The Kings led by eight early in the second before Lillard brought the Blazers back within 42-41 at halftime."}
{"game_id": "0021700225", "chunk_id": "0021700225_019", "order": 19, "role": "body", "text": "Trail Blazers: McCollum made at least three 3-pointers in each of his previous six games -- the longest streak of his career -- but went 0 for 4 from beyond the arc against Sacramento. ... Portland shot 34.6 percent (8 of 20) in the first quarter."}
{"game_id": "0021700225", "chunk_id": "0021700225_020", "order": 20, "role": "body", "text": "Kings: Sacramento won for the second time in the last 10 games against Portland. . Buddy Hield limped off the court midway through the fourth with a sprained right ankle and did not return. ... Vince Carter (kidney stone) remains sidelined."}
{"game_id": "0021700225", "chunk_id": "0021700225_022", "order": 22, "role": "body", "text": "Part of Joerger's plan had Cauley-Stein and fellow 7-footer Koufos on the floor together. That made it tough on Portland's big men and kept Lillard and McCollum from getting to the basket freely. \"Crazy defensive lineup right there,\" Cauley-Stein said. \"That second lineup is key for us coming off the bench with that energy. That defensive effort was big-time.\""}
{"game_id": "0021700225", "chunk_id": "0021700225_024", "order": 24, "role": "body", "text": "Portland failed to score a single fast-break point to the chagrin of Stotts. \"We didn't push it as much,\" he said. \"I guess that's part of our identity, that we're not a fast-break team.\""}
{"game_id": "0021700225", "chunk_id": "0021700225_026", "order": 26, "role": "body", "text": "Trail Blazers: Head back to Portland to host Sacramento on Saturday."}
{"game_id": "0021700225", "chunk_id": "0021700225_027", "order": 27, "role": "body", "text": "Kings: Play at Portland on Saturday."}
{"game_id": "0021700225", "chunk_id": "0021700225_029", "order": 29, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
