{"game_id": "0021700757", "chunk_id": "0021700757_001", "order": 1, "role": "lead", "text": "CLEVELAND --  A dramatic, disturbing month for the Cavaliers ended with a defensive stop."}
{"game_id": "0021700757", "chunk_id": "0021700757_003", "order": 3, "role": "body", "text": "LeBron James scored 24 points and turned away Miami's James Johnson before he could get off a shot in the final seconds as Cleveland began a long stretch without injured All-Star Kevin Love by holding off the Heat 91-89 on Wednesday night."}
{"game_id": "0021700757", "chunk_id": "0021700757_004", "order": 4, "role": "body", "text": "\"I was going downhill against him. I liked what I was doing. The only thing is, he's LeBron,\" Johnson said."}
{"game_id": "0021700757", "chunk_id": "0021700757_005", "order": 5, "role": "body", "text": "With the Cavs clinging to a two-point lead after Kyle Korver made one of two free throws, the 6-foot-8, 240-pound Johnson drove the right side for a potential game-tying shot, but was stopped in his tracks by James on the baseline. Johnson then fumbled the ball away as the horn sounded."}
{"game_id": "0021700757", "chunk_id": "0021700757_006", "order": 6, "role": "body", "text": "\"I don't know if there's anybody else back there that would have stopped J.J. from getting to the rim,\" Heat coach Erik Spoelstra said. \"We've seen it before. LeBron met him and was able to stop him basically in the paint. I don't think there's anybody else in the league who could do that.\""}
{"game_id": "0021700757", "chunk_id": "0021700757_007", "order": 7, "role": "body", "text": "Jae Crowder made a go-ahead 3-pointer with 1:21 left for the Cavs, who came in as the NBA's worst defensive team. Cleveland, though, buckled down in big spots and held the Heat to 3-of-28 shooting on 3-pointers."}
{"game_id": "0021700757", "chunk_id": "0021700757_008", "order": 8, "role": "body", "text": "\"To win a game on the defensive side with the struggles we've had, that's pretty impressive,\" James said. \"And versus this team, who's had one of the best records in the NBA in January. It was a big win for us.\""}
{"game_id": "0021700757", "chunk_id": "0021700757_009", "order": 9, "role": "body", "text": "The Cavs rebounded from a troubling loss Tuesday at Detroit -- the undermanned Pistons scored 125 points -- and prevented the Heat from overtaking them for third place in the Eastern Conference standings."}
{"game_id": "0021700757", "chunk_id": "0021700757_010", "order": 10, "role": "body", "text": "It was Cleveland's first game since Love broke his left hand. The five-time All-Star is consulting with surgeons in New York, and it's possible he'll undergo an operation as early as Thursday. Love, who could miss two months, already has screws in the hand from a previous procedure after he broke it in 2009 with Minnesota."}
{"game_id": "0021700757", "chunk_id": "0021700757_011", "order": 11, "role": "body", "text": "While he's out, the Cavs have to hold themselves together."}
{"game_id": "0021700757", "chunk_id": "0021700757_012", "order": 12, "role": "body", "text": "Cleveland shot just 35 percent and got outrebounded, but for the first time in a long time, the defense was solid. The Cavs hadn't held a team under 90 points since Nov. 20."}
{"game_id": "0021700757", "chunk_id": "0021700757_013", "order": 13, "role": "body", "text": "\"The way we've been playing defense lately, we probably would have lost by 30, but we just stayed in the moment,\" coach Tyronn Lue said. \"I thought guys stayed in tune.\""}
{"game_id": "0021700757", "chunk_id": "0021700757_014", "order": 14, "role": "body", "text": "Goran Dragic scored 18 and Josh Richardson had 15 to lead the Heat."}
{"game_id": "0021700757", "chunk_id": "0021700757_016", "order": 16, "role": "body", "text": "The Cavs are happy to see the calendar turn after going 6-8 to start 2018."}
{"game_id": "0021700757", "chunk_id": "0021700757_017", "order": 17, "role": "body", "text": "\"I'm happy January is over,\" Dwyane Wade said. \"Move on to February, which hopefully is a better month. In this league, you have to have a short memory.\""}
{"game_id": "0021700757", "chunk_id": "0021700757_019", "order": 19, "role": "body", "text": "The Cavs have been enveloped in theatrics all season. There have been injuries, blowout losses, persistent trade rumors and more story lines than a day-time soap opera."}
{"game_id": "0021700757", "chunk_id": "0021700757_020", "order": 20, "role": "body", "text": "\"As The Land Turns,\" Lue said with a sigh following his pregame media availability."}
{"game_id": "0021700757", "chunk_id": "0021700757_022", "order": 22, "role": "body", "text": "Playing his first back-to-back games this season, Cavs guard Isaiah Thomas went 2 of 15 from the floor. He was 0 for 6 on 3-pointers but made all nine free throws."}
{"game_id": "0021700757", "chunk_id": "0021700757_023", "order": 23, "role": "body", "text": "He's still struggling because of a serious hip injury, but felt good about finishing January on the floor."}
{"game_id": "0021700757", "chunk_id": "0021700757_024", "order": 24, "role": "body", "text": "\"My body felt good,\" he said. \"My legs (are) not there and it's obvious. But my body is good, my hip felt good and those are positive steps for me mentally to be able to practice back-to-back days and then play in back-to-back games, so it has been a positive month in that aspect.\""}
{"game_id": "0021700757", "chunk_id": "0021700757_026", "order": 26, "role": "body", "text": "The Heat were ice cold, and nearly won anyway."}
{"game_id": "0021700757", "chunk_id": "0021700757_027", "order": 27, "role": "body", "text": "\"That's why we really wanted to get this game,\" Spoelstra said. \"This would have been such a great game to win when we played horribly offensively. To be there at the end, shooting what we did from the 3-point line, free throw line and turnovers on top of that, these are the real gratifying wins if you can find a way -- but we didn't.\""}
{"game_id": "0021700757", "chunk_id": "0021700757_029", "order": 29, "role": "body", "text": "Heat: The tragic death of former NBA player Rasual Butler devastated Spoelstra and forward Udonis Haslem. Butler was drafted by Miami and played three seasons there. \"It's horrible, horrible news for all of us,\" said Spoelstra, who got emotional talking about Butler, who was killed along with his wife in a single-vehicle rollover in Los Angeles. \"He's one of our favorite people that's come through the organization.\" Haslem is the only player left with the Heat who played with Butler. \"Blindsided me,\" he said. \"I immediately took to Rasual when I got here. Another competitor, guy like myself, fearless.\" ... Miami fell to 17-6 when holding opponents under 100 points."}
{"game_id": "0021700757", "chunk_id": "0021700757_030", "order": 30, "role": "body", "text": "Cavaliers: James committed six of his seven turnovers in the first half and didn't get his first assist until 11:16 remained in the third quarter. ... Lue started Crowder because he wanted to match up with Johnson, but Cleveland's lineup could change on a game-to-game basis. ... James has scored in double digits in 841 consecutive games -- 25 shy of Michael Jordan's record."}
{"game_id": "0021700757", "chunk_id": "0021700757_032", "order": 32, "role": "body", "text": "Heat: Continue a four-game trip Friday in Philadelphia."}
{"game_id": "0021700757", "chunk_id": "0021700757_033", "order": 33, "role": "body", "text": "Cavaliers: Host the Houston Rockets on Saturday."}
{"game_id": "0021700757", "chunk_id": "0021700757_035", "order": 35, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
