{"game_id": "0021301058", "chunk_id": "0021301058_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- When Magic coach Jacque Vaughn was asked about his team's noticeable win discrepancy this season in games at home versus on the road, he likened their home floor to feeling like a \"fluffed pillow\" for his young team.\nIt found that warm embrace again, this time at the expense of a team fighting for its playoff positioning.\nTobias Harris had 25 points and 11 rebounds, and Orlando beat the Portland Trail Blazers 95-85 on Tuesday night to stop a nine-game losing streak.\nNikola Vucevic added 22 points and 10 boards for the Magic, who led by just eight at the half but used scoring spurts in the third and fourth quarters to put the game away. Victor Oladipo had 13 points and six assists.\nOrlando improved to 16-18 at home, compared to 4-34 on the road.\n\"When you play on the road it's a lot different,\" Harris said. \"Their crowd gives them energy just like our crowd does. We know we have to get better on the road, but we're playing good at home and tonight was a good win for us.\"\nThe Magic earned their fifth victory against a Western Conference team, but just their third over one that entered the night in position to make the playoffs. Orlando previously posted wins against the Clippers and Thunder in the Amway Center.\nThe Magic also matched their win total for all of last season with nine games remaining.\n\"I was really pleased with the mental focus that we had from the beginning of the game, to come out and not use being on the West Coast as an excuse,\" Vaughn said. \"It was impressive to hold that team to 85 points.\"\nRobin Lopez led Portland with 20 points and 13 rebounds.\nThe Blazers, who entered the night in fifth place in the West, have lost three straight. They were without forward LaMarcus Aldridge, who missed his seventh consecutive game with a lower back contusion.\nAfter getting blown out at Charlotte on Saturday, the Blazers rebounded and showed lots of fight in nearly upending defending champion Miami on Monday night.\nThey didn't seem to have anything left at times against Orlando, which went right at Portland's front line. The Magic outscored the Blazers 46-44 in the paint.\nPortland coach Terry Stotts said before the game that the tight playoff race in the West dictated a need to \"accumulate wins where we can get them.\" He acknowledged afterward that they missed one of those opportunities against the Magic.\n\"This is a very, extremely disappointing loss and in fact it was a game we needed to have,\" Stotts said. \"We've got 10 games left. There's got to be a sense of urgency every game. Playoff race is tight. We'd like to look forward, but we've got four teams that are right on our heels, and every game has a new sense of urgency.\"\nThe Magic closed the third quarter on an 11-2 run and increased their lead to 19 in the opening minutes of the fourth.\nHarris was the most active player for Orlando in the final quarter, scoring eight points. The Blazers were finally able to string together some baskets and cut the lead down to 11 points on a 3-pointer by Wesley Matthews with 2:31 to play.\nBut the Magic were able to close out the game from the foul line.\nOrlando took an eight-point lead into halftime after shooting 50 percent from the field in the first half.\nVucevic led the scoring effort with 14 points. The Magic also had 10 assists on their 21 baskets, including four from Oladipo.\nLopez scored 10 first-half points for Portland, which shot just 40 percent from the field. The Blazers also struggled from the foul line, connecting on only 2 of their 12 attempts.\nThe victory aside, Vaughn said there won't be any heavy focus on wins or losses for his team the rest of the way.\n\"Have not mentioned one time what our record is to the team,\" he said. \"What I do mention to those guys, and (will) when we practice on Thursday, is let's come to work and get better. That's how we'll continue to judge each other and continue to push each other.\"\nGame notes\nOrlando improved to 5-24 against the Western Conference. ... The Magic honored Grant Hill between the first and second quarter as part of their \"Legends Nights\" season-long series to honor former players as part of the team's 25th anniversary season celebration."}
