{"game_id": "0021700756", "chunk_id": "0021700756_001", "order": 1, "role": "lead", "text": "NEW YORK --  Feeling good after his best performance since knee surgery, D'Angelo Russell was just happy his struggling team won."}
{"game_id": "0021700756", "chunk_id": "0021700756_002", "order": 2, "role": "body", "text": "Especially because of what it meant to Jahlil Okafor."}
{"game_id": "0021700756", "chunk_id": "0021700756_003", "order": 3, "role": "body", "text": "Russell scored 22 points, Okafor capped the decisive spurt of the game with a basket against his former team, and the Brooklyn Nets beat the Philadelphia 76ers 116-108 on Wednesday night to snap a four-game skid."}
{"game_id": "0021700756", "chunk_id": "0021700756_004", "order": 4, "role": "body", "text": "\"You get traded you want to put up numbers and get the win at the end of the day,\" Russell said, \"and we got that win for him.\""}
{"game_id": "0021700756", "chunk_id": "0021700756_005", "order": 5, "role": "body", "text": "Spencer Dinwiddie scored 27 points, while rookie center Jarrett Allen, making his first start at home, had 16 points and 12 rebounds for the Nets, who took charge of a close game with an 11-0 run early in the fourth quarter."}
{"game_id": "0021700756", "chunk_id": "0021700756_006", "order": 6, "role": "body", "text": "Dinwiddie had six points during the surge, which started with a 3-pointer by Nik Stauskas and ended on a bucket by Okafor in the first meeting since the 76ers sent both of them to Brooklyn in December."}
{"game_id": "0021700756", "chunk_id": "0021700756_007", "order": 7, "role": "body", "text": "\"If I were to say that that win didn't feel great, I would be lying,\" Okafor said. \"So it felt awesome to be able to pull it out, and for me and Nik to be able to go out there and help win was great.\""}
{"game_id": "0021700756", "chunk_id": "0021700756_008", "order": 8, "role": "body", "text": "Joel Embiid had 29 points and 14 rebounds for the 76ers, who dropped their third straight and fell back to .500 at 24-24. Ben Simmons scored 24 points and J.J. Redick added 20 in his return from a seven-game absence with a leg injury."}
{"game_id": "0021700756", "chunk_id": "0021700756_009", "order": 9, "role": "body", "text": "\"That's a .500 team. That's what a team like that does. You go up and down, up and down, up and down,\" coach Brett Brown said. \"This team can beat anybody and it can lose to anybody. That's part of the wild ride we're on with a bunch of 20-year-olds figuring stuff up.\""}
{"game_id": "0021700756", "chunk_id": "0021700756_010", "order": 10, "role": "body", "text": "Simmons was 9 of 10 for 18 points in his first 14 minutes but the Sixers couldn't build much of a lead in part because of Russell, who recently returned from a two-month absence and felt good enough to play on both nights of a back-to-back. He hadn't scored 20 since mid-November, before the surgery."}
{"game_id": "0021700756", "chunk_id": "0021700756_011", "order": 11, "role": "body", "text": "\"They got some talent over there and for us to get any win in this league is definitely a start, so hopefully we can capitalize on it and keep building,\" Russell said."}
{"game_id": "0021700756", "chunk_id": "0021700756_012", "order": 12, "role": "body", "text": "Neither team led by double digits through three quarters and the 76ers were ahead 92-91 in the opening minute of the fourth before Stauskas made a 3-pointer. Dinwiddie followed with three free throws and another 3, and Okafor scored inside to cap the run and make it 102-92 with 7:09 to play."}
{"game_id": "0021700756", "chunk_id": "0021700756_013", "order": 13, "role": "body", "text": "\"We forgot how to play defense,\" Embiid said."}
{"game_id": "0021700756", "chunk_id": "0021700756_014", "order": 14, "role": "body", "text": "Embiid tried to bring the Sixers back, bulling his way for consecutive baskets that cut it to 111-107. But soon after he fouled Allen and DeMarre Carroll, who made all four free throws to keep Brooklyn safely ahead."}
{"game_id": "0021700756", "chunk_id": "0021700756_016", "order": 16, "role": "body", "text": "76ers: Brown said he expects No. 1 draft pick Markelle Fultz, who appeared in just four games before a right shoulder injury, to play again this season. Brown just can't predict when. \"It's just an answer that I can't give anybody, we can't give anybody, nor can he,\" Brown said. \"I mean at the end of the day it's going to be when he feels good about himself and feels good about his shoulder, and that's almost the bottom line. We'll help him, but really he's got to feel comfortable that he can go be himself and none of us should begrudge him for that.\""}
{"game_id": "0021700756", "chunk_id": "0021700756_017", "order": 17, "role": "body", "text": "Nets: Coach Kenny Atkinson said the Nets hope reserve guard Caris LeVert (left groin) could return Friday, but starting forward Rondae Hollis-Jefferson (right groin) will be out a couple more games."}
{"game_id": "0021700756", "chunk_id": "0021700756_019", "order": 19, "role": "body", "text": "Brown said the only reason Okafor wasn't playing in Philadelphia was because of the big men ahead of him in a crowded frontcourt the last couple of seasons."}
{"game_id": "0021700756", "chunk_id": "0021700756_020", "order": 20, "role": "body", "text": "\"What everybody should really hear is, he's just so young. He was drafted third for a reason,\" Brown said. \"He's a hell of a player and for us in the time and the moment that we're in and with Joel, etc., the court time just wasn't available.\""}
{"game_id": "0021700756", "chunk_id": "0021700756_022", "order": 22, "role": "body", "text": "Atkinson on former 76ers executive Sam Hinkie, whose strategy of building through the draft was heavily debated."}
{"game_id": "0021700756", "chunk_id": "0021700756_023", "order": 23, "role": "body", "text": "\"I think of Sam Hinkie, there should be a management award for him, or a management study on what he did,\" Atkinson said. \"We can argue you like it, you don't like it, but I was around him. I really like him as a person and I just think he did a phenomenal job and thinking long term like that, to have that vision that most of us don't have, let's be honest, I don't think he gets enough credit.\""}
{"game_id": "0021700756", "chunk_id": "0021700756_025", "order": 25, "role": "body", "text": "76ers: Host the Miami Heat on Friday."}
{"game_id": "0021700756", "chunk_id": "0021700756_026", "order": 26, "role": "body", "text": "Nets: Host the Los Angeles Lakers on Friday."}
{"game_id": "0021700756", "chunk_id": "0021700756_028", "order": 28, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
