{"game_id": "0021700136", "chunk_id": "0021700136_001", "order": 1, "role": "lead", "text": "CLEVELAND -- Coming off LeBron James' 57-point performance, it appeared the Cavaliers had finally gained some momentum.\nA team that hadn't won since its season opener proved otherwise.\nDennis Schroder scored 28 points and the injury-riddled Atlanta Hawks ended an eight-game losing streak, beating skidding Cleveland 117-115 on Sunday.\nThe Hawks hadn't won since beating Dallas on Oct. 18 and were missing five players, but the Cavaliers went down to yet another puzzling loss.\nJames, who had 26 points and 13 rebounds, was soaking his feet in a tub of ice water and had ice wraps on both knees and his right elbow following the game. He didn't have an explanation for why there was no carry-over from Friday's 130-122 win over Washington.\n\"That's a question I cannot answer,\" James said. \"I was ready to go. A lot of the guys were ready to go. I cannot answer that question.\"\nCavaliers forward Kevin Love was taken to the hospital after leaving in the third quarter with an illness. The team announced that Love, who had four points and four rebounds in 19 minutes, was treated and released.\nThe Cavaliers cut a 16-point deficit in the second half to two on James' basket with 21 seconds left. Atlanta's Isaiah Taylor missed two free throws with 12.1 seconds to go, but Channing Frye missed a 3-pointer and Dwyane Wade's tip-in fell off the rim.\n\"To get a win in Cleveland is not easy to do,\" Hawks coach Mike Budenholzer said. \"They had a chance down the stretch where they got back in it, but I'm happy for our guys. It's a good win.\"\nThe Cavaliers have also lost to Orlando, New York, Indiana and Brooklyn during their rocky stretch, which has included three straight defeats at home. Wade kept Cleveland in the game with 19 points in the first half and finished with a season-high 25.\nCleveland's first-quarter problems continued. Coach Tyronn Lue used two timeouts in the first seven minutes as the Hawks raced ahead 27-11.\n\"No energy. The effort was pretty bad,\" James said of the early deficit. \"You turn the corner but you can't fix it in one game. We just have to try and figure it out.\"\nSchroder scored 11 straight points in the third quarter to keep Atlanta ahead. Cleveland steadily cut into the lead behind Kyle Korver's 19 points in the fourth.\n\"It's a special place to play and everyone was excited to compete against these guys,\" Schroder said.\nAtlanta put seven players in double figures, including the five starters. Luke Babbitt, making his first start of the season in place of Mike Muscala (sprained ankle), and Taurean Prince each scored 17 points.\nTIP-INS\nCavaliers: G Iman Shumpert (sore right knee) will practice Monday for the first time since being injured Nov. 29. He could play Tuesday against Milwaukee. ... F Tristan Thompson (strained left calf) is expected to miss three to four weeks.\nHawks: Rookie F Tyler Cavanaugh was in uniform after signing a two-way contract Saturday. ... G Malcolm Delaney (sprained right ankle), F Ersan Ilyasova (bruised left knee), C Miles Plumlee (strained right quadriceps) and F DeAndre' Bembry (fractured right wrist) also were unavailable.\nRIGHT TO THE POINT\nFrye said he should have made the 3-pointer in the closing seconds. The veteran forward also put his finger on the Cavaliers' problems.\n\"Honestly, we've got to play harder, be more attentive to detail and have a better sense of urgency,\" he said.\nON THE WAY BACK\nCleveland point guard Isaiah Thomas, acquired as part of the trade that sent Kyrie Irving to Boston, has been doing on-court workouts. The team announced before the season that it hoped he would return by January.\n\"The staff's doing a great job trying to get him ready,\" Lue said. \"We don't want to rush him back if he's not 100 percent. They've been doing a good job taking it slow and make sure they rehabilitate him the right way.\"\nThomas averaged a career-high 28.9 points, third in the league, last season. Derrick Rose has been starting at point guard while James has also run the offense.\nUP NEXT\nHawks: Host Boston on Monday. Atlanta is the only Eastern Conference team without a home victory with an 0-3 record.\nCavaliers: Host Milwaukee on Tuesday. Cleveland earned a 116-97 road win over the Bucks on Oct. 20."}
