{"game_id": "0021300751", "chunk_id": "0021300751_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. -- Thirty years ago, the Detroit Pistons beat the Denver Nuggets 186-184 in triple overtime, a game that remains the highest scoring in NBA history.\nSaturday, the same teams played a game that also featured very little defense.\nOnce again, it was Detroit coming out on top, riding a combined 65 points and 20 assists from Brandon Jennings and Josh Smith to post a 126-109 victory.\nRandy Foye led the Nuggets with 25 points, while Wilson Chandler scored 20 and J.J. Hickson added 15 points and 16 rebounds. Denver lost point guard Ty Lawson to a fractured rib late in the first half. Evan Fournier replaced him at the start of the second half, with Foye moving from shooting guard to the point, and Denver wasn't able to keep up the scoring pace.\n\"You could see it take the wind out of us when Ty came out of the game,\" Nuggets coach Brian Shaw said. \"He's our floor leader and he's the one who controls the pace and the tempo of the game. He's also the best guy we have to stay in front of Jennings.\"\nStill, Detroit needed to put up its highest point total in regulation since March 18, 2008, when they scored 136 against, of course, the Nuggets.\n\"That's a product of the way Denver plays,\" Pistons coach Maurice Cheeks said. \"We're not used to playing at that kind of pace, but we stepped up and made the adjustments to stay with them.\"\nThe win was a victory of sorts for embattled Pistons President Joe Dumars, who saw his two big offseason acquisitions put up big numbers. Jennings had a season-high 35 points and 12 assists -- the first Piston to do that since Isiah Thomas in 1988 -- while Smith had 30 points, 10 rebounds and eight assists.\n\"I think that pushing the ball and making it an up-tempo game made it easier to get the shots that we've been looking for,\" Smith said. \"Guys were setting screens, we were communicating and talking on defense, and it was good. It's fun to be part of something when we're doing it the right way.\"\nJennings also hit six 3-pointers, something he has struggled with all season. His outside shooting was important on a night when Denver hit 15 3s and Jennings' teammates only combined for two.\nRodney Stuckey added 19 points for Detroit, while Andre Drummond had 18 points and 15 rebounds.\n\"We're not going to win too many games when we give up 126 points,\" Shaw said.\nWith both teams on the second night of back-to-back games, it was clear early that this was not going to be a defensive struggle. The Nuggets jumped out to a quick lead by hitting their first four 3-point attempts, but Detroit was able to get to the rim at will, scoring 40 points in the paint before halftime.\nChandler and Foye combined for 23 points in the half -- 21 on 3-pointers -- but Denver had to adjust their attack with Lawson on the bench. The Nuggets turned the ball over twice in the opening moments of the third quarter, but Hickson pulled down six rebounds in the first three minutes of the period to keep Denver in the game.\nDenver was within 97-86 at quarter's end, putting the pressure on a Detroit team that has struggled all season to hold fourth-quarter leads. Sure enough, even though Shaw had to go to Randolph and Jordan Hamilton, the Nuggets used an 8-0 lead to pull within 106-100 with 7:14 to play.\nDetroit forced enough turnovers to end Denver's surge and Jennings iced the game with a pair of late 3-pointers.\n\"We are just being careless with the ball,\" Foye said. \"As a team, we have to do a better job of fighting. We can make shots and we can make threes, but when it comes down to making stops, we have to do that, too.\"\nGame notes\nWill Bynum did not play for the second straight game, and hasn't been on the floor since an argument with Cheeks during a loss in Orlando on Wednesday. ... Chauncey Billups, who played for the first time in a month on Friday, also sat out Saturday's game. ... John Long, who scored 41 points in the NBA's highest-scoring game, was broadcasting Saturday's shootout for Detroit radio, filling in for Rick Mahorn. ... Lawson's fractured rib showed up on a postgame X-ray, and he is doubtful to play Monday at Indiana."}
