{"game_id": "0021400548", "chunk_id": "0021400548_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  When Kobe Bryant stays home to rest, the Los Angeles Lakers must play a different game to compete. With balanced scoring, relentless rebounding and an unlikely contribution from a newcomer, they got the formula exactly right against the slumping Orlando Magic."}
{"game_id": "0021400548", "chunk_id": "0021400548_002", "order": 2, "role": "body", "text": "Jeremy Lin scored 18 points, Carlos Boozer added 12 points and 14 rebounds, and the Lakers beat the Magic 101-84 on Friday night."}
{"game_id": "0021400548", "chunk_id": "0021400548_003", "order": 3, "role": "body", "text": "Rookie Tarik Black had all of his career-high 14 points and nine rebounds in the second half for the Lakers, who won for the second time in their five games this season when coach Byron Scott chooses to rest the 36-year-old Bryant."}
{"game_id": "0021400548", "chunk_id": "0021400548_004", "order": 4, "role": "body", "text": "Bryant wasn't at Staples Center to watch his teammates' steady effort in finishing off the Magic. He also sat out three games last month, and he missed Monday's game in Portland."}
{"game_id": "0021400548", "chunk_id": "0021400548_005", "order": 5, "role": "body", "text": "\"We try to bring more energy when he's out, play more up-tempo,\" said Nick Young, who had nine points."}
{"game_id": "0021400548", "chunk_id": "0021400548_006", "order": 6, "role": "body", "text": "They had plenty of energy, maintaining a lead throughout the final 45 minutes. They finished off Orlando with a 12-2 run midway through the fourth quarter, highlighted by three straight baskets from Boozer."}
{"game_id": "0021400548", "chunk_id": "0021400548_007", "order": 7, "role": "body", "text": "\"I just saw us being much more aggressive than we were the last game, much more physical,\" Lakers coach Byron Scott said, referring to their blowout loss to the Clippers two nights ago. \"(We) quit assuming every shot is going in.\""}
{"game_id": "0021400548", "chunk_id": "0021400548_008", "order": 8, "role": "body", "text": "Victor Oladipo scored 17 points and Tobias Harris added 15 despite spraining his left ankle for the Magic, who have lost five straight for the first time this season."}
{"game_id": "0021400548", "chunk_id": "0021400548_009", "order": 9, "role": "body", "text": "\"It's real frustrating,\" Harris said. \"I know it's tough for us to score out there. I can't really pinpoint what it is.\""}
{"game_id": "0021400548", "chunk_id": "0021400548_010", "order": 10, "role": "body", "text": "Former USC star Nikola Vucevic had 14 points and 11 rebounds. But Orlando was outrebounded 60-36, including 31-16 in the second half, leaving coach Jacque Vaughn a bit steamed."}
{"game_id": "0021400548", "chunk_id": "0021400548_011", "order": 11, "role": "body", "text": "\"I don't know how you gauge effort,\" Vaughn said. \"If Tarik Black is rebounding the basketball with a ferocious tenacity, then I guess he has great effort, (but) you've got to take some responsibility. It starts with looking at the mirror. So that will be us.\""}
{"game_id": "0021400548", "chunk_id": "0021400548_012", "order": 12, "role": "body", "text": "Los Angeles got an eye-catching performance from Black, the big man recently acquired off waivers from Houston. After sitting out the first half, Black made all four of his shots and his first six free throws, exciting the Staples Center crowd with his energy and persistence on the boards."}
{"game_id": "0021400548", "chunk_id": "0021400548_013", "order": 13, "role": "body", "text": "\"We had everybody hitting the boards today, and it's contagious on this team,\" Black said."}
{"game_id": "0021400548", "chunk_id": "0021400548_014", "order": 14, "role": "body", "text": "Lin led the Lakers' steady effort down the stretch, scoring eight points in the fourth quarter. Ryan Kelly added 13 points and eight rebounds, and Jordan Hill had 11 points and nine boards."}
{"game_id": "0021400548", "chunk_id": "0021400548_016", "order": 16, "role": "body", "text": "Magic: The team will re-evaluate Harris' ankle on Saturday. He is the Magic's leading scorer with 18.1 points per game. ... Vaughn is a Los Angeles-area native who grew up rooting for the Lakers' championship teams of the 1980s. Before the game, he rattled off the uniform numbers of the starters, including No. 4, Byron Scott. ... Channing Frye played despite an injured right arm, scoring six points."}
{"game_id": "0021400548", "chunk_id": "0021400548_017", "order": 17, "role": "body", "text": "Lakers: Lin blocked a shot by 7-footer Dewayne Dedmon in the first quarter. ... The Lakers held a pregame moment of silence for Alina Kupchak, the 15-year-old daughter of Lakers general manager Mitch Kupchak, who died earlier this week after a lengthy illness. ... Starting forward Wesley Johnson missed his third straight game with a strained right hip flexor."}
{"game_id": "0021400548", "chunk_id": "0021400548_019", "order": 19, "role": "body", "text": "The Lakers' 24-rebound advantage was their biggest of the season. Boozer and Black outboarded the Magic by themselves in the second half, 18-16."}
{"game_id": "0021400548", "chunk_id": "0021400548_021", "order": 21, "role": "body", "text": "Young had his fourth straight rough shooting game, going 2 for 13. The Lakers' top reserve and offensive energy source missed all six of his 3-point attempts. He is just 13 for 53 in his last four games. Scott suggested Young should come in early to get up more shots, but Young politely disagreed. \"I'm going to stick to being the whole Swaggy P dude, and continue to shoot,\" he said. At least Young has made 25 consecutive free throws."}
{"game_id": "0021400548", "chunk_id": "0021400548_023", "order": 23, "role": "body", "text": "Magic: At Portland on Saturday."}
{"game_id": "0021400548", "chunk_id": "0021400548_024", "order": 24, "role": "closing", "text": "Lakers: Host Portland on Sunday."}
