{"game_id": "0021400328", "chunk_id": "0021400328_001", "order": 1, "role": "lead", "text": "CHICAGO -- Chicago Bulls coach Tom Thibodeau has insisted that Derrick Rose would eventually return to playing the way he was before knee injuries wrecked his previous two seasons.\nOn Friday, Rose looked like he is going to prove his coach right.\nRose scored a season-high 31 points, and the Bulls overcame big nights from Portland's two All-Stars to beat the Trail Blazers 115-106."}
{"game_id": "0021400328", "chunk_id": "0021400328_002", "order": 2, "role": "closing", "text": "Rose went past his previous high of 24 points and scored over 30 for the first time since March 12, 2012. He was 14-of-24 from the floor for the Bulls, who have won three of four and improved to 4-5 at the United Center.\nFor Rose, it was his second consecutive encouraging performance after scoring 23 during Chicago's win over Brooklyn on Wednesday. And like that game, Rose's aggression level resembled where it was before his injuries.\n\"Every game I'm getting more and more comfortable with it,\" Rose said.\nLaMarcus Aldridge scored 21 of his 35 points in the first quarter, his 10 field goals in the period matching a Trail Blazers record set by Darius Miles in 2005. But he was held to two points in the final quarter.\nDamian Lillard also had a season-high 35, making seven 3-pointers and scoring 18 in the fourth. That gave Portland two teammates with at least 35 for the first time since 1988, but not a victory.\n\"The bottom line is we didn't play well enough to win the game,\" Lillard said.\nPortland had won seven straight before losing 90-82 in Minnesota. The Blazers were held to their fewest points of the season and had their worst shooting night (.388) in that one, but went 43-of-88 from the field in Chicago.\n\"It is disappointing to waste a good shooting night like this,\" Portland coach Terry Stotts said.\nChicago broke a seven-game skid against Portland.\nThe Bulls were without center Joakim Noah and forward Doug McDermott. Noah sat his second straight game with a sprained right ankle, and McDermott was absent for the fifth consecutive time due to a right knee problem that will require arthroscopic surgery Saturday.\nPau Gasol had 13 points and 10 rebounds for his eighth straight double-double and 14th of the season. Rookie Nikola Mirotic had 15 points and nine rebounds, and Aaron Brooks scored 17 points for the Bulls, who only committed seven turnovers, outrebounded the Blazers 47-37 and had a 40-15 advantage in bench points.\n\"Overall I was very pleased,\" Thibodeau said.\nRose may have been, but his bigger concern was continuing his progress.\n\"The next time we play it could be something different,\" Rose said, \"so this performance is already behind me.\"\nTIP-INS\nTrail Blazers: Portland recorded 20 assists, running its streak of at least 20 to 23 games to start the season. ... Portland couldn't improve to 11-0 against the Eastern Conference, failing to tie a team record set last season for most consecutive wins against the East to start a season.\nBulls: Swingman Mike Dunleavy was inadvertently elbowed in the nose by Nicolas Batum in the first quarter but returned soon after. ... The Bulls ran their streak of 100 or more points to eight games, their longest since an eight-game span from March 26-April 11, 2009.\nTHANKS, PRESIDENT OBAMA\nDuring a Friday interview on ESPN Radio, President Barack Obama said he likes Thibodeau and that the Bulls could beat the Cleveland Cavaliers if Rose plays at an All-Star level. Thibodeau somewhat brushed off the comment about Cleveland but said \"we have a lot of respect for all (Obama's) done and we certainly appreciate his support. It's great for our team.\"\nNOTHING FREE\nLillard credited Chicago for being a more aggressive team, as the Bulls scored 14 more points on 17 more free throw attempts. \"I think teams are being more assertive than us,\" Lillard said. \"The whistle kind of goes in favor of that and it wasn't on our side.\"\nUP NEXT\nTrail Blazers: Visit Indiana on Saturday.\nBulls: Visit Miami on Sunday."}
