{"game_id": "0021300901", "chunk_id": "0021300901_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Russell Westbrook taught rookie Michael Carter-Williams a swift and thorough lesson."}
{"game_id": "0021300901", "chunk_id": "0021300901_002", "order": 2, "role": "body", "text": "Westbrook had a triple-double in 21 minutes to win the matchup of talented point guards and help the Oklahoma City Thunder defeat the woeful Philadelphia 76ers 125-92 on Tuesday night."}
{"game_id": "0021300901", "chunk_id": "0021300901_003", "order": 3, "role": "body", "text": "The three-time All Star finished with 13 points, 10 rebounds and 14 assists after blowing past Carter-Williams at will. Westbrook wrapped up his eighth career triple-double on a rebound with 4:55 left in the third quarter and left the game for good moments later."}
{"game_id": "0021300901", "chunk_id": "0021300901_004", "order": 4, "role": "body", "text": "The last NBA player to get a triple-double in fewer minutes was Jim Tucker in 1955, according to the Elias Sports Bureau."}
{"game_id": "0021300901", "chunk_id": "0021300901_005", "order": 5, "role": "body", "text": "\"He made everybody better tonight,\" said teammate Kevin Durant, who led the Thunder with 42 points. \"He was moving the basketball, he was aggressive to the rim. I think that's why everybody got open, because of his aggressiveness. He just set the tone for us.\""}
{"game_id": "0021300901", "chunk_id": "0021300901_006", "order": 6, "role": "body", "text": "Westbrook also offered verbal instruction after his pupil decided to talk trash during the third quarter. Turns out, Westbrook is pretty good at that, too."}
{"game_id": "0021300901", "chunk_id": "0021300901_007", "order": 7, "role": "body", "text": "\"I like it,\" he said of Carter-Williams' talking. \"It's good because that's how I play anyway. I compete, and that's what I like to do. He wants to compete as well.\""}
{"game_id": "0021300901", "chunk_id": "0021300901_008", "order": 8, "role": "body", "text": "James Anderson scored 20 for the 76ers, who lost their 15th in a row, their longest slide since a 15-game skid in 1994. Philadelphia shot just 34 percent."}
{"game_id": "0021300901", "chunk_id": "0021300901_009", "order": 9, "role": "body", "text": "Carter-Williams, among the favorites to win the Rookie of the Year award, finished with 14 points on 4-for-12 shooting. Philadelphia coach Brett Brown wasn't amused by Carter-Williams' talking."}
{"game_id": "0021300901", "chunk_id": "0021300901_010", "order": 10, "role": "body", "text": "\"It's always wise to go about your business without instigating an All-Star,\" Brown said. \"I don't mind Michael being competitive, but how you go about that is always a challenge, and again, a learning curve.\""}
{"game_id": "0021300901", "chunk_id": "0021300901_011", "order": 11, "role": "body", "text": "Serge Ibaka and Reggie Jackson each scored 14 points and Perry Jones added 12 for the Thunder, who shot 57 percent from the field in their most lopsided victory of the season."}
{"game_id": "0021300901", "chunk_id": "0021300901_012", "order": 12, "role": "body", "text": "Westbrook had eight assists in the first 6:34 to help the Thunder take a 24-15 lead."}
{"game_id": "0021300901", "chunk_id": "0021300901_013", "order": 13, "role": "body", "text": "\"I never go in looking to shoot first, pass first, rebound first,\" he said. \"I just come in and play off instincts.\""}
{"game_id": "0021300901", "chunk_id": "0021300901_014", "order": 14, "role": "body", "text": "Westbrook got his 10th assist on a long bounce pass to Durant with 4:55 left in the second quarter. Westbrook finished the first half with 11 assists, a Thunder record for a half. He didn't score until he made a layup with 1:50 left in the first half. His second basket was a 29-foot 3-pointer."}
{"game_id": "0021300901", "chunk_id": "0021300901_015", "order": 15, "role": "body", "text": "\"He's just physically so gifted and he's so competitive,\" Brown said. \"There's a -- and I say this respectfully -- he's an angry competitor that wills his way into doing stuff. I say that with the utmost respect. You saw those physical abilities along with just such a strong mind. It's a powerful combination.\""}
{"game_id": "0021300901", "chunk_id": "0021300901_016", "order": 16, "role": "body", "text": "Durant, who made 14 of 20 shots from the floor, did not play in the fourth quarter as the Thunder won their third straight."}
{"game_id": "0021300901", "chunk_id": "0021300901_017", "order": 17, "role": "body", "text": "Caron Butler, the Thunder's recent acquisition, entered for the first time as a member of the team with 5:26 left in the first quarter and received a loud standing ovation. He made his first basket, a jumper, with 2:18 left in the opening period."}
{"game_id": "0021300901", "chunk_id": "0021300901_018", "order": 18, "role": "body", "text": "Durant scored 21 points in the first half on 8-for-11 shooting to help the Thunder take a 61-45 lead at the break."}
{"game_id": "0021300901", "chunk_id": "0021300901_019", "order": 19, "role": "body", "text": "The 76ers made 3-pointers on three consecutive trips down the floor -- the first two by Byron Mullins and the third by Anderson -- to cut what had been a 22-point deficit to 15 midway through the third quarter."}
{"game_id": "0021300901", "chunk_id": "0021300901_020", "order": 20, "role": "body", "text": "The Thunder bounced back and led 98-76 at the end of the period. Durant scored 21 of Oklahoma City's 37 points in the quarter."}
{"game_id": "0021300901", "chunk_id": "0021300901_021", "order": 21, "role": "body", "text": "The crowd cheered loudly when Oklahoma City's 7-foot-3 center, Hasheem Thabeet, stepped out of his usual element and drained a 17-foot jumper that put the Thunder up 110-79 with 7:33 to go."}
{"game_id": "0021300901", "chunk_id": "0021300901_022", "order": 22, "role": "body", "text": "It was a complete win for Oklahoma City."}
{"game_id": "0021300901", "chunk_id": "0021300901_023", "order": 23, "role": "body", "text": "\"I thought defensively, we were really good throughout the game,\" coach Scott Brooks said. \"We were active, we were in passing lanes, we were contesting shots, and we did a great job with rebounding and passing.\""}
{"game_id": "0021300901", "chunk_id": "0021300901_024", "order": 24, "role": "body", "text": "Game notes Jones and C Steven Adams started for the Thunder in place of injured G Thabo Sefolosha and C Kendrick Perkins. ... The 76ers have allowed at least 100 points in 14 of the 15 losses during their skid. All but three of the defeats have been by double digits. ... Thunder G Jeremy Lamb made a layup at the first-quarter buzzer after catching a pass from Durant that traveled most of the length of the court. ... The Thunder shot 70 percent in the first quarter to take a 37-23 lead. ... Brown was issued a technical foul with 5:30 left in the second quarter."}
{"game_id": "0021300901", "chunk_id": "0021300901_026", "order": 26, "role": "closing", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP"}
