{"game_id": "0021300689", "chunk_id": "0021300689_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  Arron Afflalo didn't make a big fuss after his name wasn't among those announced this week as reserve selection for the All-Star game."}
{"game_id": "0021300689", "chunk_id": "0021300689_002", "order": 2, "role": "body", "text": "Whether he was just hiding his disappointment or not, he went out Friday night and reminded the Milwaukee Bucks of why he was worthy of discussion."}
{"game_id": "0021300689", "chunk_id": "0021300689_003", "order": 3, "role": "body", "text": "Afflalo scored 21 points in three quarters of work, Tobias Harris added 18 and the Orlando Magic ran to a 113-102 victory."}
{"game_id": "0021300689", "chunk_id": "0021300689_004", "order": 4, "role": "body", "text": "The Magic snapped a three-game losing streak and extended their home winning streak over Milwaukee to 16 games."}
{"game_id": "0021300689", "chunk_id": "0021300689_005", "order": 5, "role": "body", "text": "\"There are certain feelings you get at certain points in your life, whether it's a motivating factor or something that you looked forward to that didn't happen,\" said Afflalo, who came in averaging career highs in points, rebounds and assists. \"But for me it's created a new level of passion and a new level of hunger.\""}
{"game_id": "0021300689", "chunk_id": "0021300689_006", "order": 6, "role": "body", "text": "Orlando led by as many as 25 points and had six players reach double-figures. Victor Oladipo finished with 15 points and seven assists, and Nik Vucevic had 12 points and six rebounds in his second game back from a concussion."}
{"game_id": "0021300689", "chunk_id": "0021300689_007", "order": 7, "role": "body", "text": "Vucevic, who had had missed 12 straight games, played 25 minutes -- about five minutes more than he did in his return against Toronto earlier in the week. He was productive with his time on the floor, connecting on 5 of 9 field goal attempts."}
{"game_id": "0021300689", "chunk_id": "0021300689_008", "order": 8, "role": "body", "text": "Magic coach Jacque Vaughn said Vucevic did ask to be taken out of the game after playing just over five minutes in the fourth quarter. Vaughn acknowledged he might have pushed him a bit too hard, but expected him to be OK."}
{"game_id": "0021300689", "chunk_id": "0021300689_009", "order": 9, "role": "body", "text": "Vaughn was pleased with his team's effort, particularly how they shared the ball."}
{"game_id": "0021300689", "chunk_id": "0021300689_010", "order": 10, "role": "body", "text": "\"Everyone who played tonight had an assist,\" he said. \"For us to score the basketball we need each other. Tonight was definitely an example of us playing together.\""}
{"game_id": "0021300689", "chunk_id": "0021300689_011", "order": 11, "role": "body", "text": "The only other bad news the Magic got Friday came in the form of another injury. Point guard Jameer Nelson played the entire first quarter, but sat out the remainder of the game with a sore left knee. He is day to day."}
{"game_id": "0021300689", "chunk_id": "0021300689_012", "order": 12, "role": "body", "text": "Caron Butler scored 20 points for Milwaukee, which lost its fifth straight game. The Bucks have lost 14 of their last 15 and eight straight on the road."}
{"game_id": "0021300689", "chunk_id": "0021300689_013", "order": 13, "role": "body", "text": "Milwaukee played without John Henson, who was out with a sprained right wrist. O.J. Mayo missed his third consecutive game with an illness."}
{"game_id": "0021300689", "chunk_id": "0021300689_014", "order": 14, "role": "body", "text": "Henson and Mayo's absences were felt as the Magic quickly jumped out to a double-digit lead in the first half that grew to as many as 22 points in the opening 24 minutes."}
{"game_id": "0021300689", "chunk_id": "0021300689_015", "order": 15, "role": "body", "text": "The margin hovered above 20 for most of the second half with the Bucks never getting back within single digits."}
{"game_id": "0021300689", "chunk_id": "0021300689_016", "order": 16, "role": "body", "text": "\"It was frustrating, but you have to keep playing,\" Khris Middleton said. \"Sometimes you put yourself in a position to win and sometimes you can't.\""}
{"game_id": "0021300689", "chunk_id": "0021300689_017", "order": 17, "role": "body", "text": "The Magic scored a season-high 67 points in the first half and took a 21-point lead into the break."}
{"game_id": "0021300689", "chunk_id": "0021300689_018", "order": 18, "role": "body", "text": "Afflalo led all scorers with 17 first-half points, with Vucevic adding 12 and Maurice Harkless 10."}
{"game_id": "0021300689", "chunk_id": "0021300689_019", "order": 19, "role": "body", "text": "Orlando dominated in the paint as well, outscoring the Bucks 30-18. The Magic also were active in the open court with a 12-3 edge in fast-break points."}
{"game_id": "0021300689", "chunk_id": "0021300689_020", "order": 20, "role": "body", "text": "Milwaukee came out misfiring and ended the half connecting on just 18 of 41 field goal attempts. That was compounded by 13 turnovers that led to 17 Orlando points."}
{"game_id": "0021300689", "chunk_id": "0021300689_021", "order": 21, "role": "body", "text": "\"It's good for us,\" Oladipo said. \"We played well as a team, we did a lot of good things. We kind of took our foot off the gas in the fourth quarter, but other than that we played a pretty good game.\""}
{"game_id": "0021300689", "chunk_id": "0021300689_022", "order": 22, "role": "body", "text": "Afflalo said regardless of the Magic's record, he doesn't plan on slowing down the rest of the season."}
{"game_id": "0021300689", "chunk_id": "0021300689_023", "order": 23, "role": "body", "text": "\"Sometimes the NBA season is so long, when you're losing games you kind of get in this autopilot type of mode, but I've got an extreme fire burning overall, not even about tonight,\" he said. \"I just think my focus is going to be heightened, every little thing that I do.\""}
{"game_id": "0021300689", "chunk_id": "0021300689_024", "order": 24, "role": "body", "text": "Game notes The Magic improved to 3-26 when their opponent scores 100 or more points. ... Milwaukee coach Larry Drew said center Zaza Pachulia, who has missed 27 straight games with a fractured right foot, is \"close\" but still not ready to return to the court"}
{"game_id": "0021300689", "chunk_id": "0021300689_026", "order": 26, "role": "closing", "text": "Follow Kyle Hightower on Twitter at http://www.twitter.com/khightower"}
