{"game_id": "0021700027", "chunk_id": "0021700027_001", "order": 1, "role": "lead", "text": "TORONTO --  DeMar DeRozan fought off flu-like symptoms to give the Toronto Raptors their biggest-ever win over the Philadelphia 76ers."}
{"game_id": "0021700027", "chunk_id": "0021700027_002", "order": 2, "role": "body", "text": "DeRozan scored 30 points, Serge Ibaka had 21 and the Raptors won their 10th straight home game over Philadelphia, routing the 76ers 128-94 on Saturday night."}
{"game_id": "0021700027", "chunk_id": "0021700027_003", "order": 3, "role": "body", "text": "Kyle Lowry scored 17 points, Jakob Poeltl had a career-high 14 and the Raptors won for the 16th time in 17 meetings with the 76ers."}
{"game_id": "0021700027", "chunk_id": "0021700027_004", "order": 4, "role": "body", "text": "The 34-point margin of victory was Toronto's biggest over Philadelphia, eclipsing a 32-point win on Nov. 9, 2014."}
{"game_id": "0021700027", "chunk_id": "0021700027_005", "order": 5, "role": "body", "text": "DeRozan felt ill throughout the day and was sent home after the game without speaking to reporters. He made eight of 12 field goal attempts and shot 14 for 16 from the free throw line."}
{"game_id": "0021700027", "chunk_id": "0021700027_006", "order": 6, "role": "body", "text": "\"We gave him a little more time to isolate tonight,\" Lowry said. \"You give him the opportunity to take his time and be patient he can pretty much get what he wants.\""}
{"game_id": "0021700027", "chunk_id": "0021700027_007", "order": 7, "role": "body", "text": "DeRozan scored 15 in the first, going 4 for 4 from the field and hitting 7 of 8 free throws, to give the Raptors a 36-19 lead after one. Toronto made 14 of 16 free throw attempts in the first, taking advantage of 11 Philadelphia fouls."}
{"game_id": "0021700027", "chunk_id": "0021700027_008", "order": 8, "role": "body", "text": "\"He was getting to the paint, vaulting up, getting to his sweet spot, which creates offense within itself,\" coach Dwane Casey said."}
{"game_id": "0021700027", "chunk_id": "0021700027_009", "order": 9, "role": "body", "text": "Ibaka had five 3-pointers and Lowry had four as Toronto shot 13 for 44 from long range."}
{"game_id": "0021700027", "chunk_id": "0021700027_010", "order": 10, "role": "body", "text": "The Raptors finished 31 for 37 at the line."}
{"game_id": "0021700027", "chunk_id": "0021700027_011", "order": 11, "role": "body", "text": "\"Our inability to not get tricked, to not bite on multiple up-fakes, is a discipline we have to improve on,\" Philadelphia coach Brett Brown said. \"We need to stay ground-bound. We were poor tonight doing that.\""}
{"game_id": "0021700027", "chunk_id": "0021700027_012", "order": 12, "role": "body", "text": "Ben Simmons had 18 points and 10 rebounds and Jerryd Bayless scored 16 for the winless 76ers, who were playing the second game of a back-to-back. Philadelphia lost at home to Boston on Friday night."}
{"game_id": "0021700027", "chunk_id": "0021700027_013", "order": 13, "role": "body", "text": "Justin Anderson had 12 points and Jahlil Okafor had 10 in his season debut."}
{"game_id": "0021700027", "chunk_id": "0021700027_014", "order": 14, "role": "body", "text": "After starting Friday, 76ers center Joel Embiid (left knee) was not available against Toronto. The oft-injured Embiid has not been cleared to play the second game of back-to-backs."}
{"game_id": "0021700027", "chunk_id": "0021700027_015", "order": 15, "role": "body", "text": "\"It's tough without Joel,\" Simmons said. \"We've got to learn to learn to play without him.\""}
{"game_id": "0021700027", "chunk_id": "0021700027_016", "order": 16, "role": "body", "text": "Embiid did not travel to Toronto, but is expected to rejoin the team for Monday's game at Detroit."}
{"game_id": "0021700027", "chunk_id": "0021700027_017", "order": 17, "role": "body", "text": "Toronto's Jonas Valanciunas sprained his left ankle when he was fouled by Philadelphia's Dario Saric with two minutes left in the second. Valanciunas stayed in to shoot his free throws but was replaced about a minute later and headed to the locker room. He did not return."}
{"game_id": "0021700027", "chunk_id": "0021700027_018", "order": 18, "role": "body", "text": "Casey said Valanciunas would undergo an MRI exam."}
{"game_id": "0021700027", "chunk_id": "0021700027_019", "order": 19, "role": "body", "text": "Leading 62-49 at halftime, Toronto started the second half with a 10-2 spurt, including eight points from Ibaka."}
{"game_id": "0021700027", "chunk_id": "0021700027_020", "order": 20, "role": "body", "text": "\"They jumped us, especially at the start of the third,\" Brown said."}
{"game_id": "0021700027", "chunk_id": "0021700027_022", "order": 22, "role": "body", "text": "76ers: Philadelphia committed a season-worst 20 turnovers. ... The Sixers have lost five straight road games dating to last season."}
{"game_id": "0021700027", "chunk_id": "0021700027_023", "order": 23, "role": "body", "text": "Raptors: DeRozan scored more points in the first quarter (15) than he did in the entirety of Thursday's win over Chicago (11). ... Toronto made more free throws in the first (14) than field goals (10)."}
{"game_id": "0021700027", "chunk_id": "0021700027_025", "order": 25, "role": "body", "text": "According to Elias, Simmons is the first NBA player since Oscar Robertson with 10 or more points, 10 or more rebounds and five or more assists in each of his first three games."}
{"game_id": "0021700027", "chunk_id": "0021700027_027", "order": 27, "role": "body", "text": "76ers: Philadelphia visits Detroit on Monday night. The Sixers split with the Pistons in two trips to Detroit last season."}
{"game_id": "0021700027", "chunk_id": "0021700027_028", "order": 28, "role": "body", "text": "Raptors: Toronto kicks off a season-long six game road trip at San Antonio on Monday. The Raptors have lost eight consecutive road games against the Spurs."}
{"game_id": "0021700027", "chunk_id": "0021700027_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
