{"game_id": "0021401179", "chunk_id": "0021401179_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  The Detroit Pistons know all about Rodney Stuckey's streaky shooting. This time, he picked up his play at a pivotal moment for the Indiana Pacers."}
{"game_id": "0021401179", "chunk_id": "0021401179_002", "order": 2, "role": "body", "text": "Stuckey scored 24 points, including three straight jumpers down the stretch, and the Pacers kept up their playoff push with a 107-103 victory over the Pistons on Friday night."}
{"game_id": "0021401179", "chunk_id": "0021401179_003", "order": 3, "role": "body", "text": "Stuckey was selected by Detroit in the first round of the 2007 draft and played for the Pistons for seven seasons before he signed with Indiana in free agency in July."}
{"game_id": "0021401179", "chunk_id": "0021401179_004", "order": 4, "role": "body", "text": "\"He's an up-and-down guy -- he always has been,\" Pistons coach Stan Van Gundy said. \"He hasn't done much of anything against us in our first three games this year, but today, he killed us.\""}
{"game_id": "0021401179", "chunk_id": "0021401179_005", "order": 5, "role": "body", "text": "Indiana (36-43) has won four in a row and is one game behind Brooklyn and Boston for the last two Eastern Conference playoff spots. All three teams won on Friday."}
{"game_id": "0021401179", "chunk_id": "0021401179_006", "order": 6, "role": "body", "text": "\"We know that the Nets and Celtics have our fate in our hands, so all we can do is keep winning games,\" Stuckey said."}
{"game_id": "0021401179", "chunk_id": "0021401179_007", "order": 7, "role": "body", "text": "C.J. Miles also scored 24 points for the Pacers, who trailed by six points with seven minutes to play. Roy Hibbert had 10 points and 11 rebounds."}
{"game_id": "0021401179", "chunk_id": "0021401179_008", "order": 8, "role": "body", "text": "\"This is the story of our season,\" Miles said. \"We keep finding ways to win games.\""}
{"game_id": "0021401179", "chunk_id": "0021401179_009", "order": 9, "role": "body", "text": "Reggie Jackson led Detroit with 21 points. Greg Monroe had 17 points and 12 rebounds, and Andre Drummond finished with 11 points, 15 boards and three blocked shots."}
{"game_id": "0021401179", "chunk_id": "0021401179_010", "order": 10, "role": "body", "text": "\"We're getting better and we came out with the right effort tonight,\" Jackson said. \"I wish we could have played spoiler.\""}
{"game_id": "0021401179", "chunk_id": "0021401179_011", "order": 11, "role": "body", "text": "The game was tied at 79 after three quarters, and even with the Pistons eliminated from postseason contention, they beat the Pacers to several loose balls early in the fourth, forcing Frank Vogel to call for a timeout."}
{"game_id": "0021401179", "chunk_id": "0021401179_012", "order": 12, "role": "body", "text": "Miles hit a pair of 3s to get Indiana back into the game, and Luis Scola tied it at 93 with 4:11 to play. At the same time, Jackson and Monroe both picked up their fifth fouls."}
{"game_id": "0021401179", "chunk_id": "0021401179_013", "order": 13, "role": "body", "text": "\"Those both helped us, especially when we could go at Reggie Jackson and ultimately foul him out,\" Vogel said. \"Putting Drummond on the line helped, too.\""}
{"game_id": "0021401179", "chunk_id": "0021401179_014", "order": 14, "role": "body", "text": "The Pacers were so eager to put Drummond -- the worst free-throw shooter in NBA history -- on the line that they started intentionally fouling him with 3:50 to play, even though the Pistons weren't in the penalty."}
{"game_id": "0021401179", "chunk_id": "0021401179_015", "order": 15, "role": "body", "text": "Two fouls later, Drummond missed two free throws, and Stuckey hit his three straight shots to put Indiana up 101-96 with 1:55 left. Tolliver answered with a 3, but Jackson fouled out seconds later."}
{"game_id": "0021401179", "chunk_id": "0021401179_016", "order": 16, "role": "body", "text": "Jackson and Kentavious Caldwell-Pope each went 1 for 3 from the free-throw line in the final three minutes. For the game, the Pistons went 12 for 23 from the line, compared to 20 for 22 for the Pacers."}
{"game_id": "0021401179", "chunk_id": "0021401179_017", "order": 17, "role": "body", "text": "\"Free throws were the game tonight,\" Van Gundy said. \"These are NBA players, and you have to be able to make free throws. That's ridiculous.\""}
{"game_id": "0021401179", "chunk_id": "0021401179_018", "order": 18, "role": "body", "text": "The first half turned into a scoring duel between Detroit's current point guard and a former holder of the job. Jackson had 15 points to Stuckey's 12, but Stuckey got more help, and a late Paul George 3-pointer gave the Pacers a 51-47 lead at the half."}
{"game_id": "0021401179", "chunk_id": "0021401179_019", "order": 19, "role": "body", "text": "Indiana threatened to pull away early in the third, going up by seven early in the period, but the Pistons rallied after a timeout, scoring the next eight points."}
{"game_id": "0021401179", "chunk_id": "0021401179_020", "order": 20, "role": "body", "text": "George hit another 3-pointer in the last minute, and Ian Mahinmi's tip-in at the buzzer made it 79-79 going into the fourth."}
{"game_id": "0021401179", "chunk_id": "0021401179_022", "order": 22, "role": "body", "text": "Pacers: Chris Copeland was inactive for the second straight game after being stabbed in New York early Wednesday. ... The Pacers, who lead in the NBA in bench scoring, got 48 points from their reserves on Friday, led by Stuckey."}
{"game_id": "0021401179", "chunk_id": "0021401179_023", "order": 23, "role": "body", "text": "Pistons: Jackson had to change jerseys late in the third quarter after getting blood on his original shirt. ... The Pistons took 23 3-pointers and 23 free throws, and only made one more free throw (12) than 3-pointer."}
{"game_id": "0021401179", "chunk_id": "0021401179_025", "order": 25, "role": "body", "text": "Pacers: Host the Thunder on Sunday."}
{"game_id": "0021401179", "chunk_id": "0021401179_026", "order": 26, "role": "closing", "text": "Pistons: Host the Hornets on Sunday in their final home game of the season."}
