{"game_id": "0021400622", "chunk_id": "0021400622_001", "order": 1, "role": "lead", "text": "PHOENIX --  The Phoenix Suns' trio of prolific point guards was at it again."}
{"game_id": "0021400622", "chunk_id": "0021400622_002", "order": 2, "role": "body", "text": "Goran Dragic and Isaiah Thomas scored 24 apiece, Eric Bledsoe added 17 and the Suns pulled away to hand the Los Angeles Lakers their fifth loss in a row -- the last two without Kobe Bryant -- 115-100 on Monday night."}
{"game_id": "0021400622", "chunk_id": "0021400622_003", "order": 3, "role": "body", "text": "That's 65 points -- on 25-of-38 shooting -- for the guard threesome that is at the heart of the Suns' streak of six straight home wins and 13 victories in their last 17 overall."}
{"game_id": "0021400622", "chunk_id": "0021400622_004", "order": 4, "role": "body", "text": "\"The three guards played tremendous,\" Phoenix coach Jeff Hornacek said."}
{"game_id": "0021400622", "chunk_id": "0021400622_005", "order": 5, "role": "body", "text": "They did much of their damage when all three were together on the court."}
{"game_id": "0021400622", "chunk_id": "0021400622_006", "order": 6, "role": "body", "text": "\"We are ready to play small basketball when he (Hornacek) calls our name and we are all out on the floor together,\" Thomas said. \"I think it is dynamic. You don't see it around the league and it is something we love doing and hopefully we could do it a little more.\""}
{"game_id": "0021400622", "chunk_id": "0021400622_007", "order": 7, "role": "body", "text": "Dragic grabbed a team-high nine rebounds and Bledsoe had seven assists. Twelve of Bledsoe's points came in the third quarter when the Suns took control."}
{"game_id": "0021400622", "chunk_id": "0021400622_008", "order": 8, "role": "body", "text": "Nick Young scored 24 for the Lakers, who were tied 51-all at halftime but fell behind by 10 in the third quarter and 19 in the fourth."}
{"game_id": "0021400622", "chunk_id": "0021400622_009", "order": 9, "role": "body", "text": "Bryant sat out the loss at Utah on Friday to rest and then took Monday off, too. He is expected to rejoin the team for practice on Tuesday."}
{"game_id": "0021400622", "chunk_id": "0021400622_010", "order": 10, "role": "body", "text": "The Lakers have lost seven of eight, eight of 10 and 13 of 17."}
{"game_id": "0021400622", "chunk_id": "0021400622_011", "order": 11, "role": "body", "text": "\"Turnovers,\" Los Angeles coach Byron Scott said. \"We had eight at halftime and we finished with 23. You're not going to win a whole lot of games with 23 turnovers.\""}
{"game_id": "0021400622", "chunk_id": "0021400622_012", "order": 12, "role": "body", "text": "The Suns took the lead for good when Dragic made the first basket of the third quarter."}
{"game_id": "0021400622", "chunk_id": "0021400622_013", "order": 13, "role": "body", "text": "Late in the period, Bledsoe -- who had 12 points in the quarter -- sank a 3-pointer, Marcus Morris made one of two free throws and Phoenix took an 85-75 lead with 42 seconds left. The Suns were up 87-77 after three."}
{"game_id": "0021400622", "chunk_id": "0021400622_014", "order": 14, "role": "body", "text": "\"In the first half we weren't aggressive enough,\" Dragic said. \"We fouled too much. They had 23 free throws if I am not mistaken. Then the third quarter was awesome.\""}
{"game_id": "0021400622", "chunk_id": "0021400622_015", "order": 15, "role": "body", "text": "Morris' 3-pointer put Phoenix up 102-83 with 6:58 to play."}
{"game_id": "0021400622", "chunk_id": "0021400622_016", "order": 16, "role": "body", "text": "Los Angeles managed to cut it to 106-100 when Jordan Hill sank a 19-footer with 2:59 left, but the Suns finished the game on a 9-0 run, with the last five points coming from Markieff Morris."}
{"game_id": "0021400622", "chunk_id": "0021400622_017", "order": 17, "role": "body", "text": "\"We turned the ball over and didn't take care of it,\" Lakers guard Jeremy Lin said. \"We ended up shooting ourselves in the foot.\""}
{"game_id": "0021400622", "chunk_id": "0021400622_018", "order": 18, "role": "body", "text": "The Lakers led much of the first half but never by more than six points, thanks in part to free throw troubles. Los Angeles was 15 for 23 at the line in the first two quarters."}
{"game_id": "0021400622", "chunk_id": "0021400622_019", "order": 19, "role": "body", "text": "The Lakers led 46-40 after Wayne Ellington's 3-pointer with 3:16 to play in the second period. But the Suns outscored the Lakers 11-5 the rest of the half. Thomas' 3-pointer tied it at 51 with 29.9 seconds to go."}
{"game_id": "0021400622", "chunk_id": "0021400622_022", "order": 22, "role": "body", "text": "Lakers: Los Angeles is 2-6 without Bryant this season. ... The Lakers lost center Tarik Black to a sprained right ankle with 5 minutes to play. ... Floyd Mayweather Jr. had a seat behind the L.A. bench. ... Los Angeles entered eighth in free throws attempted per game at 22. The Lakers had 23 in the first half."}
{"game_id": "0021400622", "chunk_id": "0021400622_023", "order": 23, "role": "body", "text": "Suns: Phoenix's home winning streak is its longest since winning eight in a row from March 14 to April 13, 2010. ... Alex Len had his string of consecutive double-digit rebound games snapped at four."}
{"game_id": "0021400622", "chunk_id": "0021400622_025", "order": 25, "role": "body", "text": "Lakers: At New Orleans on Wednesday."}
{"game_id": "0021400622", "chunk_id": "0021400622_026", "order": 26, "role": "closing", "text": "Suns: Home against Portland on Wednesday."}
