{"game_id": "0021401186", "chunk_id": "0021401186_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- While other NBA teams are getting ready to play for all the marbles, fans of the lottery-bound Los Angeles Lakers and Minnesota Timberwolves have their minds on ping pong balls and the draft lottery on May 19.\nRyan Kelly scored 21 points, rookie Jabari Brown added 20 points and seven assists, and the Lakers snapped a five-game losing streak with a 106-98 victory over the Timberwolves on Friday night.\n\"It's been a long tough season, and we all know that injuries have been a big part of it,\" Lakers coach Byron Scott said. \"But just like in any situation, you're going to see some bright spots. And we've been able to see that. So our guys are going to keep playing hard. All these guys have three more games to show us what they can do.\n\"I think I've made it pretty clear to our guys that there is still something to play for -- not the playoffs, or anything like that, but just pride and just being a professional and a competitor. That's the bottom line.\""}
{"game_id": "0021401186", "chunk_id": "0021401186_002", "order": 2, "role": "closing", "text": "Each Lakers starter scored in double figures, including rookie point guard Jordan Clarkson with 18 points, nine assists and six rebounds. Tarik Black added 18 points and 10 rebounds.\nPoint guard Jeremy Lin (left knee) was sidelined and Scott sat Carlos Boozer, Jordan Hill and Wayne Ellington to give other players more minutes.\n\"You want to get a look at some of your young guys and see how they react in certain situations,\" Scott said. \"With the veteran players, you've got a pretty good idea of what they can do and what they bring to the table.\n\"Some people might say that's `tanking.' I don't know. But I think you're really just trying to evaluate the talent that you have. ... To me, it's pretty simple.\"\nThe worse the record the better the percentages of landing the top draft pick. The Lakers are 21-58 and have guaranteed the worst record in franchise history. Minnesota is 16-63, the Knicks are 15-64 and the 76ers are 18-61.\nRecent speculation the Lakers intentionally lose games to improve their chances at a top pick makes Scott bristle.\n\"I've heard: `Don't win tonight. We need that pick,\" Scott said. \"That's all I keep hearing. But that's not what this organization is all about. It never has been and never will be.\n\"We still go out and try to win every single game that we can. If you lose a game, so be it. But to go out there and try to lose, to me it's ridiculous.\"\nAndrew Wiggins scored 29 points and fellow rookie Zach LaVine added 18 for the Timberwolves (16-63), who have lost nine straight.\n\"Andrew played actively and went to the boards a lot,\" coach Flip Saunders said. \"He didn't get some of the rebounds -- but considering the amount of minutes he has played, he showed a great amount of energy given the situation.\"\nAfter blowing a 14-point lead in the first half, Los Angeles began the third quarter with an 18-7 run that included three 3-pointers by Kelly and increased its five-point halftime margin to 70-54.\nThe Lakers came out strong again in the fourth with a 12-4 spurt that widened the gap to 92-75. During that run, Clarkson made a behind-the-back pass to Brown for a fast-break layup.\nLaVine hit back-to-back 3-pointers 27 seconds apart to slice the margin to 93-83 with 6:08 remaining. But Wesley Johnson responded with a short jumper, and Black scored six points in the final 3:34.\nTIP-INS\nTimberwolves: Kevin Garnett (left knee), who turns 39 next month, did not play for the 16th consecutive game. ... Minnesota has won only two of its last 18 games -- both in OT. The Timberwolves haven't won in regulation since beating Portland at home on March 7.\nLakers: Clarkson was presented with his NBA rookie of the month award for March by Scott at midcourt during pregame warmups. ... The only other time the Lakers missed the playoffs in consecutive seasons was 1974-75 and 1975-76, when they were a combined 70-94. Since the start of last season, they are 48-113. ... This will be the fourth time since the NBA draft lottery was instituted in 1985 that the Lakers will be involved.\nUP NEXT:\nTimberwolves: at Golden State on Saturday night.\nLakers: host Dallas on Sunday night"}
