{"game_id": "0021700634", "chunk_id": "0021700634_001", "order": 1, "role": "lead", "text": "MIAMI --  Goran Dragic and Erik Spoelstra were asked separately Sunday what a seven-game winning streak means to them, and both immediately provided the same answer."}
{"game_id": "0021700634", "chunk_id": "0021700634_004", "order": 4, "role": "body", "text": "Even in their best stretch of the season, the Miami Heat are still sounding far from content."}
{"game_id": "0021700634", "chunk_id": "0021700634_005", "order": 5, "role": "body", "text": "Dragic scored 11 of his 25 points in the fourth quarter, and the Heat held Milwaukee to its worst shooting game in nearly five years on the way to topping the Bucks 97-79."}
{"game_id": "0021700634", "chunk_id": "0021700634_006", "order": 6, "role": "body", "text": "\"We've still got 40 games left. We cannot be satisfied with that,\" Dragic said. \"We still need to improve. If you start thinking like that, if you're satisfied with that, then it's not going to be pretty for us.\""}
{"game_id": "0021700634", "chunk_id": "0021700634_007", "order": 7, "role": "body", "text": "Josh Richardson scored 16 and Hassan Whiteside finished with 15 points and 10 rebounds for Miami. Milwaukee shot 32 percent, 6 percent worse than any game this season and the lowest percentage by a Bucks team in a regular-season game since March 22, 2013."}
{"game_id": "0021700634", "chunk_id": "0021700634_008", "order": 8, "role": "body", "text": "Giannis Antetokounmpo and Malcolm Brogdon combined to shoot 13 for 24 for the Bucks. Their teammates shot a combined 12 for 55, including a 4-for-16 day from Eric Bledsoe and a 3-for-16 from Khris Middleton."}
{"game_id": "0021700634", "chunk_id": "0021700634_009", "order": 9, "role": "body", "text": "\"We played bad basketball,\" Antetokounmpo said."}
{"game_id": "0021700634", "chunk_id": "0021700634_010", "order": 10, "role": "body", "text": "The Heat trailed 43-41 at the half, then took control by outscoring the Bucks 41-21 in the first 16 minutes of the second half."}
{"game_id": "0021700634", "chunk_id": "0021700634_011", "order": 11, "role": "body", "text": "\"Our guys really stepped it up,\" said Spoelstra, who now has 12 winning streaks of at least seven games in his tenure as Heat coach."}
{"game_id": "0021700634", "chunk_id": "0021700634_012", "order": 12, "role": "body", "text": "Antetokounmpo scored 22 for Milwaukee, which started 1 for 14 from the floor in the second half. Middleton added 16, Brogdon had 15 and Bledsoe scored 10 for Milwaukee."}
{"game_id": "0021700634", "chunk_id": "0021700634_013", "order": 13, "role": "body", "text": "\"We were playing from behind,\" Bucks coach Jason Kidd said. \"We've got some guys who can't make shots right now. We've just got to keep grinding, keep getting those guys a look, and believe that they're going to make the next shot.\""}
{"game_id": "0021700634", "chunk_id": "0021700634_014", "order": 14, "role": "body", "text": "It was a rare easy win for Miami. The first six Heat wins in this streak were all by single digits."}
{"game_id": "0021700634", "chunk_id": "0021700634_015", "order": 15, "role": "body", "text": "The Bucks were making a run in the fourth when Dragic took over. His 3-pointer with the shot clock expiring with 5:19 left put the Heat up by 14, part of a run in which he scored 11 consecutive Miami points."}
{"game_id": "0021700634", "chunk_id": "0021700634_016", "order": 16, "role": "body", "text": "\"Dragon hit those 3s,\" said Bledsoe, Dragic's former teammate in Phoenix. \"Those are the shots we wanted him to take. Unfortunately, he made them.\""}
{"game_id": "0021700634", "chunk_id": "0021700634_018", "order": 18, "role": "body", "text": "Bucks: Milwaukee forced Miami into 15 turnovers, but converted them into only two points. ... The 1 p.m. start time won't be Milwaukee's earliest wake-up call of the season. The Bucks play in Brooklyn at noon on Feb. 4 -- Super Bowl Sunday. ... Olympic sprinting great Usain Bolt of Jamaica sat courtside, across from the Milwaukee bench."}
{"game_id": "0021700634", "chunk_id": "0021700634_019", "order": 19, "role": "body", "text": "Heat: Miami plays nine of its next 11 games on the road. But after that stretch, 18 of the final 29 regular-season contests are at home with no remaining road trip longer than three games. ... The Heat have now had 300 consecutive home regular-season sellouts."}
{"game_id": "0021700634", "chunk_id": "0021700634_021", "order": 21, "role": "body", "text": "Sunday was the start of a rare back-to-back of day games for the Bucks, Heat and Knicks. All play Monday afternoon, part of the NBA's lineup on Martin Luther King Jr. Day. The Bucks and Knicks had similar schedules on this weekend last year, but the Heat haven't had early starts on consecutive days since March 2009. Milwaukee flies to Washington, Miami flies to Chicago and New York heads to Brooklyn. The Wizards, Bulls and Nets all had Sunday off."}
{"game_id": "0021700634", "chunk_id": "0021700634_023", "order": 23, "role": "body", "text": "Former Heat coach Ron Rothstein was honored at halftime for winning the Tex Winter Assistant Coach Lifetime Impact Award. Rothstein was joined by the entire current Heat coaching staff, along with former Heat assistant Tony Fiorentino -- now a team broadcaster -- and David Fizdale, the former Miami assistant who was coach in Memphis until being let go earlier this season."}
{"game_id": "0021700634", "chunk_id": "0021700634_025", "order": 25, "role": "body", "text": "Justise Winslow returned for Miami after missing 14 games with a knee strain, finishing with three points, four rebounds and four assists in 13 minutes. Sunday's appearance was his 37th in Miami's last 115 games."}
{"game_id": "0021700634", "chunk_id": "0021700634_027", "order": 27, "role": "body", "text": "Milwaukee: Visit Washington on Monday, ending a two-game trip."}
{"game_id": "0021700634", "chunk_id": "0021700634_028", "order": 28, "role": "closing", "text": "Miami: Visit Chicago on Monday, starting a five-game swing."}
