{"game_id": "0021700240", "chunk_id": "0021700240_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  Lonzo Ball's haircuts are headline news around LA and the NBA. His father already draws more attention than most politicians, and LaVar Ball is even currently engaged in a public argument with the president."}
{"game_id": "0021700240", "chunk_id": "0021700240_002", "order": 2, "role": "body", "text": "Through all of this extraordinary attention on a 20-year-old point guard and his family, Lonzo has managed to remain focused on his rookie season with the Los Angeles Lakers."}
{"game_id": "0021700240", "chunk_id": "0021700240_003", "order": 3, "role": "body", "text": "He broke through the distractions with another beautiful game against Denver."}
{"game_id": "0021700240", "chunk_id": "0021700240_004", "order": 4, "role": "body", "text": "Ball had his second career triple-double and Julius Randle scored 24 points in the Lakers' 127-109 victory over the short-handed Nuggets on Sunday night."}
{"game_id": "0021700240", "chunk_id": "0021700240_005", "order": 5, "role": "body", "text": "With 11 points, a career-high 16 rebounds and 11 assists, Ball reached the milestone at 20 years and 23 days -- the exact age at which LeBron James became the youngest player to record his second triple-double in 2005."}
{"game_id": "0021700240", "chunk_id": "0021700240_006", "order": 6, "role": "body", "text": "Ball became the youngest player in NBA history with a first triple-double eight days earlier in a loss at Milwaukee."}
{"game_id": "0021700240", "chunk_id": "0021700240_007", "order": 7, "role": "body", "text": "\"This one was a lot better,\" Ball said. \"I actually like this one. Just keep building on it.\""}
{"game_id": "0021700240", "chunk_id": "0021700240_008", "order": 8, "role": "body", "text": "Ball and Magic Johnson are the only Lakers with multiple triple-doubles in their rookie seasons. Johnson had seven, and his new point guard has two in his first 17 games."}
{"game_id": "0021700240", "chunk_id": "0021700240_009", "order": 9, "role": "body", "text": "\"You should always play better in front of your fans, so I'm just trying to put on a good show for them and win at the same time,\" Ball said."}
{"game_id": "0021700240", "chunk_id": "0021700240_010", "order": 10, "role": "body", "text": "Ball had another big game at another turbulent moment in his family life. With his father beefing with Donald Trump over the president's role in resolving brother LiAngelo's legal issues during a UCLA basketball trip to China, Lonzo Ball put together an outstanding floor game to boost the Lakers to just their second win in seven games."}
{"game_id": "0021700240", "chunk_id": "0021700240_011", "order": 11, "role": "body", "text": "\"Never with a young man like this, his age, have I seen it,\" Lakers coach Luke Walton said of the circus surrounding Ball's every move."}
{"game_id": "0021700240", "chunk_id": "0021700240_012", "order": 12, "role": "body", "text": "\"I mean, he got a haircut and fielded three questions on game day about his haircut. One, it's impressive how he is able to maintain and handle it, and two, I think it's a little bit nuts. But that's the way it's going to be.\""}
{"game_id": "0021700240", "chunk_id": "0021700240_013", "order": 13, "role": "body", "text": "Brook Lopez scored 21 points and Jordan Clarkson added 18 for the Lakers, who surged to a 24-point lead in the first half and won easily."}
{"game_id": "0021700240", "chunk_id": "0021700240_014", "order": 14, "role": "body", "text": "Denver coach Mike Malone and top scorer Nikola Jokic were ejected in the second quarter after Malone stepped onto the court during play to argue a no-call on a play by Jokic around the basket. Malone furiously confronted referee Rodney Mott, who swiftly ejected the coach and his best player when Jokic joined in the argument."}
{"game_id": "0021700240", "chunk_id": "0021700240_015", "order": 15, "role": "body", "text": "\"I'll be honest, I deserved to get tossed, but Nikola Jokic did nothing to warrant an ejection,\" Malone said. \"That's something that we'll try to look into if we can.\""}
{"game_id": "0021700240", "chunk_id": "0021700240_017", "order": 17, "role": "body", "text": "Nuggets: Jamal Murray got a technical foul for gesturing at Mott after a no-call shortly after the two ejections. ... Two nights after Denver scored 146 points in a win over New Orleans, the Nuggets mustered just 48 points in the first half while committing 13 turnovers."}
{"game_id": "0021700240", "chunk_id": "0021700240_018", "order": 18, "role": "body", "text": "Lakers: The 6-foot-6 Ball's 16 rebounds are the most in the NBA by a rookie this season. ... Los Angeles had a season-high 36 assists. ... Randle scored 17 points before halftime. ... Josh Hart and Ivica Zubac were recalled from the South Bay Lakers before the game. Hart scored three points, and Zubac played two minutes."}
{"game_id": "0021700240", "chunk_id": "0021700240_020", "order": 20, "role": "body", "text": "Malone was infuriated when Mott didn't call a foul on the Lakers for contact while Jokic battled underneath the basket. When the teams headed upcourt, Malone took two steps onto the hardwood and blocked Mott's path."}
{"game_id": "0021700240", "chunk_id": "0021700240_021", "order": 21, "role": "body", "text": "Jokic had barely joined the argument when Mott tossed him as well, prompting a profane response. Malone's assistants had to calm him down."}
{"game_id": "0021700240", "chunk_id": "0021700240_022", "order": 22, "role": "body", "text": "\"I just want to apologize to the Denver Nuggets,\" Jokic said. \"I feel bad. I left my teammates alone there.\""}
{"game_id": "0021700240", "chunk_id": "0021700240_024", "order": 24, "role": "body", "text": "Randle went 11 of 18 from the field and added seven points and five assists in a stellar game off the bench. Walton would love to see a similar effort from Randle every night."}
{"game_id": "0021700240", "chunk_id": "0021700240_025", "order": 25, "role": "body", "text": "\"I'm trying to figure that out,\" Walton said. \"Because when he plays like he did tonight, he's as good as anyone in this league.\""}
{"game_id": "0021700240", "chunk_id": "0021700240_027", "order": 27, "role": "body", "text": "Denver forward Paul Millsap left with a sprained left wrist in the second quarter of a miserable night for the Nuggets, who lost for just the second time in six games. Millsap had X-rays, but Malone didn't yet know the results."}
{"game_id": "0021700240", "chunk_id": "0021700240_029", "order": 29, "role": "body", "text": "Nuggets: At Sacramento Kings on Monday night."}
{"game_id": "0021700240", "chunk_id": "0021700240_030", "order": 30, "role": "body", "text": "Lakers: Host the Chicago Bulls on Tuesday night."}
{"game_id": "0021700240", "chunk_id": "0021700240_032", "order": 32, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
