{"game_id": "0021400344", "chunk_id": "0021400344_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Practice may not make perfect, though it made a big difference for the Milwaukee Bucks."}
{"game_id": "0021400344", "chunk_id": "0021400344_002", "order": 2, "role": "body", "text": "Brandon Knight scored 22 points, Giannis Antetokounmpo added 20, and the Bucks beat the Los Angeles Clippers 111-106 on Saturday night."}
{"game_id": "0021400344", "chunk_id": "0021400344_003", "order": 3, "role": "body", "text": "The Bucks' defense had been faltering the past two weeks, allowing at least 107 points in four of five games and losing five of their last six contests."}
{"game_id": "0021400344", "chunk_id": "0021400344_004", "order": 4, "role": "body", "text": "With three days off since losing at Oklahoma City on Tuesday night, the Bucks went into the gym to correct some errors. It paid off, with the Clippers star tandem of Chris Paul and Blake Griffin held to just 10 points apiece."}
{"game_id": "0021400344", "chunk_id": "0021400344_005", "order": 5, "role": "body", "text": "\"We harked in on things that are very valuable about our defense that we've seen on film, where we make little mistakes and our whole defense collapses,\" said Larry Sanders, who had 15 points and nine rebounds, but was just as valuable disrupting the Los Angeles offense in the paint."}
{"game_id": "0021400344", "chunk_id": "0021400344_006", "order": 6, "role": "body", "text": "\"Everyone has to be on point and I think everyone did a great job of stepping up tonight,\" Sanders said."}
{"game_id": "0021400344", "chunk_id": "0021400344_007", "order": 7, "role": "body", "text": "The Bucks held Los Angeles to 43 percent shooting. Griffin missed eight of 12 shots and Paul missed 10 of 15 while committing six turnovers for the second straight game."}
{"game_id": "0021400344", "chunk_id": "0021400344_008", "order": 8, "role": "body", "text": "\"You can throw them different looks and you just hope that they miss,\" Milwaukee coach Jason Kidd said. \"We gave them different looks and, again, one shot. When Griffin misses a shot, (DeAndre) Jordan normally around the rim cleaning it up. We just tried to make it tough on those guys and they missed some shots down the stretch.\""}
{"game_id": "0021400344", "chunk_id": "0021400344_009", "order": 9, "role": "body", "text": "It was the ninth consecutive game the Bucks scored at least 100 points, the franchise's longest run since 1991. Los Angeles shot 39 of 91 while Milwaukee took only 76 shots, but made 43."}
{"game_id": "0021400344", "chunk_id": "0021400344_010", "order": 10, "role": "body", "text": "\"They got everywhere they wanted to tonight,\" Paul said. \"We never really made an impact on the game. Just like last night, it was (six) turnovers. Never did that before. Don't think I ever had four offensive fouls in a game, either. We have to defend. We have to play better.\""}
{"game_id": "0021400344", "chunk_id": "0021400344_011", "order": 11, "role": "body", "text": "Jamal Crawford hit a 3-pointer with 3.1 seconds left to pull the Clippers to 109-106. Knight's inbounds pass was tipped out of bounds by Matt Barnes, who was tied up with Khris Middleton on a close play."}
{"game_id": "0021400344", "chunk_id": "0021400344_012", "order": 12, "role": "body", "text": "The referees reviewed the replay and confirmed that the Bucks had the ball. Milwaukee inbounded again, and Knight hit a pair of free throws with 2.1 seconds remaining to close the scoring."}
{"game_id": "0021400344", "chunk_id": "0021400344_013", "order": 13, "role": "body", "text": "Barnes scored a season-high 26 points and JJ Redick added 25 for Los Angeles."}
{"game_id": "0021400344", "chunk_id": "0021400344_014", "order": 14, "role": "body", "text": "Milwaukee made eight consecutive shots en route to a decisive 18-3 run midway through the fourth quarter, sending the Clippers to consecutive losses for the first time this season."}
{"game_id": "0021400344", "chunk_id": "0021400344_015", "order": 15, "role": "body", "text": "\"We allowed them to shoot 56 percent from the field and 60-something (64 percent) from 3,\" Los Angeles coach Doc Rivers said. \"When you do that, you should probably lose the game and we did.\""}
{"game_id": "0021400344", "chunk_id": "0021400344_018", "order": 18, "role": "body", "text": "Clippers: It was the first time this season the Clippers lost the second game when playing on consecutive nights. They won the first five times. . The Clippers were outscored in the paint, 50-36. . The teams play again next Saturday night in Los Angeles."}
{"game_id": "0021400344", "chunk_id": "0021400344_019", "order": 19, "role": "body", "text": "Bucks: Rookie F Johnny O'Bryant dressed for the first time, but did not play. He missed the team's first 23 games with a sprained right knee. . D.M.C. From the group Run-D.M.C. Performed a short set at halftime."}
{"game_id": "0021400344", "chunk_id": "0021400344_021", "order": 21, "role": "body", "text": "Rivers said the Clippers would be among the teams with an interest in signing Ray Allen if the veteran guard decides to return to the NBA this season. Rivers said he talks to Allen frequently. \"He wants to wait and see if he wants to play, and I think he is doing the right thing and has earned that right,\" Rivers said."}
{"game_id": "0021400344", "chunk_id": "0021400344_023", "order": 23, "role": "body", "text": "Barnes committed a hard foul on Antetokounmpo with 40 seconds left in the second quarter, and the Bucks forward swiped his free arm at the Clippers forward during the play. Antetokounmpo was called for a technical foul after the referees reviewed the video. \"There's always something you've never seen,\" Kidd said of the technical being assessed after the referees viewed the replay."}
{"game_id": "0021400344", "chunk_id": "0021400344_025", "order": 25, "role": "body", "text": "Clippers: Host Detroit on Monday."}
{"game_id": "0021400344", "chunk_id": "0021400344_026", "order": 26, "role": "closing", "text": "Bucks: Visit Phoenix on Monday"}
