{"game_id": "0021400839", "chunk_id": "0021400839_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. -- LeBron James rarely likes to talk about his individual achievements.\nOn Tuesday, he made an exception.\nJames had 11 assists in Cleveland's 102-93 victory over the Detroit Pistons. In the process, he moved past Scottie Pippen for first place on the NBA career list for forwards. James now has 6,142 assists -- seven more than Pippen."}
{"game_id": "0021400839", "chunk_id": "0021400839_002", "order": 2, "role": "body", "text": "\"That means a tremendous amount to me,\" James said. \"It means a lot more than passing Allen Iverson on the scoring list in the last game because I have always taken so much pride in my passing game. To me, the greatest rush has always been helping my teammates succeed, not succeeding myself.\"\nJames wears No. 23 in Michael Jordan's honor, but breaking Pippen's record was special in another sense.\n\"When I grew up, I loved Michael, but when you are a kid, you don't think you can grow up and be Michael Jordan,\" he said. \"I patterned a lot of my game after Scottie Pippen because he was the kind of star I thought I could be. So that's a great feeling to break a record he owns.\"\nCavaliers coach David Blatt didn't know James had reached the milestone but was excited to find out.\n\"That's a fabulous achievement, especially when you consider that he just turned 30 years old,\" Blatt said. \"It not only proves his greatness as a player, it shows the ability he has to make the players around him equally great.\"\nMany of James' assists, including the record-breaker in the second quarter that gave him 6,136, found Kevin Love wide open behind the arc. Love had 24 points on eight 3-pointers, which tied his career best.\n\"Kevin had it going tonight, so I was looking to get him the ball,\" James said. \"That's how we play. Find the hot guy, and keep him going.\""}
{"game_id": "0021400839", "chunk_id": "0021400839_003", "order": 3, "role": "closing", "text": "James nearly had an odd triple-double; he turned the ball over nine times, one short of his career high. Kyrie Irving added 18 points for Cleveland, which has won 17 of its past 19 games.\nReggie Jackson had 22 points, nine assists and eight rebounds in his second game with Detroit, while Kentavious Caldwell-Pope added 21.\n\"I thought Reggie has played very well,\" Pistons coach Stan Van Gundy said. \"He's got to get better on the defensive end, so that's something we have to work on, but I like the way he rebounded the ball, and he was aggressive on offense.\"\nTayshaun Prince started at small forward in his first game as a Piston since he was traded to Memphis in January 2013. Prince, who has started his past 673 games in a Detroit uniform, finished with seven points in 31 minutes. He was acquired in a trade with Boston.\nDetroit's backcourt was the difference in the first half, as Caldwell-Pope and Jackson outscored Irving and J.R. Smith 28-10. James and Love were in double figures for Cleveland, but the Pistons led 62-53 at the break.\nCleveland's defense stepped up in the third and held the Pistons to 12 points on 22 percent shooting. That enabled the Cavs to take a 77-73 lead into the fourth, and Iman Shumpert increased the margin to seven with an early 3-pointer.\nAfter that, James started going to the basket on nearly every possession against Detroit's reserves, and Cleveland moved the lead to 11 midway through the period. The Cavaliers outscored Detroit 36-16 in the first 18 minutes of the second half.\n\"We stepped up and made a commitment to each other to play the way that we've been playing for the last several weeks,\" Blatt said. \"We weren't defending, and we didn't have the energy that we needed, but we woke up in time.\"\nTIP-INS\nCavaliers: Love missed his only 3-point attempt of the fourth quarter and fell one triple short of teammate Smith's record of nine against the Pistons. Smith, who set the record with Denver in 2011, went 0-for-2 from behind the arc Tuesday.\nPistons: After trading four players for Prince and Jackson, the Pistons have signed Quincy Miller to a 10-day contract and picked Shawne Williams up off waivers. Miller was in uniform Tuesday but didn't play, while Williams was inactive. ... Prince hit his 500th 3-pointer for Detroit in the first half and joined Joe Dumars, Chauncey Billups, Lindsay Hunter and Rasheed Wallace as the only Pistons to reach that mark.\nUP NEXT\nCavaliers: Host Golden State on Thursday.\nPistons: Host New York on Friday."}
