{"game_id": "0021200322", "chunk_id": "0021200322_001", "order": 1, "role": "lead", "text": "ATLANTA -- Kyle Korver thinks the Atlanta Hawks have been too hesitant to beat a struggling opponent decisively."}
{"game_id": "0021200322", "chunk_id": "0021200322_002", "order": 2, "role": "body", "text": "That wasn't the case this time."}
{"game_id": "0021200322", "chunk_id": "0021200322_003", "order": 3, "role": "body", "text": "Devin Harris scored 20 points, Josh Smith added 18 and the surging Hawks beat Charlotte 113-90 on Thursday night to hand the Bobcats their 10th straight defeat."}
{"game_id": "0021200322", "chunk_id": "0021200322_004", "order": 4, "role": "body", "text": "\"I think mentally, in the locker room, we just decided that we were going to do it,\" Korver said. \"It's easy to let up when you've got a lead and you're trying to create some energy, and we've done that several times.\""}
{"game_id": "0021200322", "chunk_id": "0021200322_005", "order": 5, "role": "body", "text": "Gerald Henderson finished with 17 points and Ramon Sessions had 16 for Charlotte."}
{"game_id": "0021200322", "chunk_id": "0021200322_006", "order": 6, "role": "body", "text": "The Hawks are 12-3 since losing three of their first five games this season. Atlanta, which moved into a first-place tie with Miami in the Southeast Division, has won two straight and five of six."}
{"game_id": "0021200322", "chunk_id": "0021200322_007", "order": 7, "role": "body", "text": "\"As I've stated before, we have to develop that killer instinct and keep playing well even when you have teams down,\" coach Larry Drew said. \"We built a 28-point lead at one point, but they cut into it.\""}
{"game_id": "0021200322", "chunk_id": "0021200322_008", "order": 8, "role": "body", "text": "Louis Williams had eight of his nine assists in the first half for Atlanta. Williams, who finished with 13 points, matched his career high in assists, and Ivan Johnson added a season-high 16 points."}
{"game_id": "0021200322", "chunk_id": "0021200322_009", "order": 9, "role": "body", "text": "Hawks center Al Horford finished with 11 points and three rebounds, ending his streak of seven consecutive double-doubles."}
{"game_id": "0021200322", "chunk_id": "0021200322_010", "order": 10, "role": "body", "text": "Atlanta got off to a strong start offensively, hitting nearly 63 percent of its first 35 shots before Horford and Williams missed jumpers to end the first half."}
{"game_id": "0021200322", "chunk_id": "0021200322_011", "order": 11, "role": "body", "text": "Charlotte shot 35.9 percent and trailed by 17 at the break."}
{"game_id": "0021200322", "chunk_id": "0021200322_012", "order": 12, "role": "body", "text": "\"When you dig a hole like that, it's going to be tough,\" Bobcats rookie Jeffery Taylor said after scoring 12 points. \"We're a young team, but we will stay together and hopefully start playing better and getting some breaks as well.\""}
{"game_id": "0021200322", "chunk_id": "0021200322_013", "order": 13, "role": "body", "text": "Since winning in double overtime at Washington on Nov. 24 and improving to 7-5, the Bobcats have looked similar to the Charlotte team that finished last season 7-59 for the worst winning percentage in NBA history."}
{"game_id": "0021200322", "chunk_id": "0021200322_014", "order": 14, "role": "body", "text": "The Bobcats were coming off a dispiriting home loss Wednesday to the Los Angeles Clippers in which they blew a seven-point lead in the fourth quarter."}
{"game_id": "0021200322", "chunk_id": "0021200322_015", "order": 15, "role": "body", "text": "When Charlotte last visited Philips Arena on Nov. 28, the game was decided on Horford's late free throws and a missed 3-pointer by Hornets forward Byron Mullens."}
{"game_id": "0021200322", "chunk_id": "0021200322_016", "order": 16, "role": "body", "text": "The Hornets were led that night by Ben Gordon, who scored 20 of his 26 points in the fourth quarter. On Thursday, Gordon had just seven points on 2-for-9 shooting."}
{"game_id": "0021200322", "chunk_id": "0021200322_017", "order": 17, "role": "body", "text": "Henderson, though, considered defense a bigger problem."}
{"game_id": "0021200322", "chunk_id": "0021200322_018", "order": 18, "role": "body", "text": "\"We can't come up with any consistent stops,\" he said. \"It's on everybody. We're playing in the NBA. There are some tough matchups out there for whatever lineups we have out there.\""}
{"game_id": "0021200322", "chunk_id": "0021200322_019", "order": 19, "role": "body", "text": "Korver, playing for the second straight night after returning from a five-game absence caused by back spasms, finished with 13 points in 22 minutes."}
{"game_id": "0021200322", "chunk_id": "0021200322_020", "order": 20, "role": "body", "text": "Williams hit consecutive 3-pointers to give Atlanta its first double-digit lead at 26-14 late in the first quarter. Harris hit a 3 midway through the second that made it 45-28."}
{"game_id": "0021200322", "chunk_id": "0021200322_021", "order": 21, "role": "body", "text": "Smith's third-quarter dunk gave the Hawks a 66-43 advantage early in the third."}
{"game_id": "0021200322", "chunk_id": "0021200322_022", "order": 22, "role": "body", "text": "\"Normally when we get big leads, we tend to get complacent a little bit and kind of let our guards down,\" Smith said. \"Tonight we were able to keep our foot on the gas and not let up.\""}
{"game_id": "0021200322", "chunk_id": "0021200322_023", "order": 23, "role": "closing", "text": "Game notes Hawks starting F DeShawn Stevenson scored nine points after missing Wednesday's win at Orlando with a knee injury. ... Atlanta improved to 4-0 on the second night of back-to-backs. ... The Hawks have won seven straight against Charlotte, including three meetings this season."}
