{"game_id": "0021700652", "chunk_id": "0021700652_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Damian Lillard says he's finally feeling close to normal."}
{"game_id": "0021700652", "chunk_id": "0021700652_002", "order": 2, "role": "body", "text": "Lillard, who dealt with a hamstring injury late in December before straining his right calf earlier this month, scored 31 points in a 118-111 victory over the Phoenix Suns on Tuesday night."}
{"game_id": "0021700652", "chunk_id": "0021700652_003", "order": 3, "role": "body", "text": "\"When I came back I knew that it would take some time to just to be able to move comfortably. The last few games, each game has gotten better,\" said Lillard, who missed five games with the hamstring and two with the calf. \"Tonight I just felt good. I felt almost normal at times.\""}
{"game_id": "0021700652", "chunk_id": "0021700652_004", "order": 4, "role": "body", "text": "CJ McCollum had 27 points, including six 3-pointers, and the Blazers snapped a three-game losing streak."}
{"game_id": "0021700652", "chunk_id": "0021700652_005", "order": 5, "role": "body", "text": "Devin Booker had 43 for the Suns, who have lost three straight and five of their last six."}
{"game_id": "0021700652", "chunk_id": "0021700652_006", "order": 6, "role": "body", "text": "The Trail Blazers led by as many as 27 points in third quarter but Booker rallied the Suns in the final period with 21 points. His 3-pointer got the Suns within 103-93 with just over seven minutes left and Portland coach Terry Stotts put his starters back in."}
{"game_id": "0021700652", "chunk_id": "0021700652_007", "order": 7, "role": "body", "text": "Booker hit another 3-pointer to narrow Portland's lead to 107-99. McCollum answered with a basket, and Portland got a stop before Al-Farouq Aminu's 3 from the corner with 3:30 left."}
{"game_id": "0021700652", "chunk_id": "0021700652_008", "order": 8, "role": "body", "text": "Another 3-pointer by Aminu put Portland up 117-105 with 1:12 left and essentially put the game out of reach."}
{"game_id": "0021700652", "chunk_id": "0021700652_009", "order": 9, "role": "body", "text": "Booker finished with five 3-pointers, four of them in the fourth quarter alone."}
{"game_id": "0021700652", "chunk_id": "0021700652_010", "order": 10, "role": "body", "text": "\"I never count us out. I don't care if we're down 20 with a minute to go. You've got to keep playing through the whistle and I think we showed that tonight,\" Booker said. \"You're never out of a game. This is the NBA. You never know what can happen.\""}
{"game_id": "0021700652", "chunk_id": "0021700652_011", "order": 11, "role": "body", "text": "It was Portland's first game back home after a four-game road trip. The Blazers dropped consecutive games to Houston, New Orleans and Minnesota."}
{"game_id": "0021700652", "chunk_id": "0021700652_012", "order": 12, "role": "body", "text": "The Suns were without Marquese Chriss for the third straight game because of a right hip strain. Dragan Bender started in his place."}
{"game_id": "0021700652", "chunk_id": "0021700652_013", "order": 13, "role": "body", "text": "Phoenix was also without T.J. Warren because of low back soreness. Both Chriss and Warren were considered day-to-day."}
{"game_id": "0021700652", "chunk_id": "0021700652_014", "order": 14, "role": "body", "text": "Portland's Shabazz Napier, who has helped give the Blazers a spark off the bench, was available after nursing a lower back strain. He had his back wrapped with an ice pack while the team warmed up for the second half. Napier finished with 11."}
{"game_id": "0021700652", "chunk_id": "0021700652_015", "order": 15, "role": "body", "text": "Lillard hit a 3-pointer with the first shot of the game, and the Blazers opened 8 for 8 from the field. Lillard finished the opening quarter with 12 points, second only to Booker with 13."}
{"game_id": "0021700652", "chunk_id": "0021700652_016", "order": 16, "role": "body", "text": "Pat Connaughton's 3-pointer put the Blazers up 45-36, and McCollum hit a 3-pointer to stretch the lead to 66-51 going into the half.  Lillard and Booker each finished the half with 20 points."}
{"game_id": "0021700652", "chunk_id": "0021700652_017", "order": 17, "role": "body", "text": "Portland pulled away in the second half, going up 80-56 after McCollum's steal and layup. The Suns opened the half just 1-of-13 from the field."}
{"game_id": "0021700652", "chunk_id": "0021700652_018", "order": 18, "role": "body", "text": "The game got a bit testy early in the fourth quarter, when Maurice Harkless and Booker exchanged words. Both were given technical fouls."}
{"game_id": "0021700652", "chunk_id": "0021700652_019", "order": 19, "role": "body", "text": "Troy Daniels finished with 18 points off the bench for Phoenix."}
{"game_id": "0021700652", "chunk_id": "0021700652_020", "order": 20, "role": "body", "text": "For the Suns, the rally came too late."}
{"game_id": "0021700652", "chunk_id": "0021700652_021", "order": 21, "role": "body", "text": "\"I finally found a combination at the end there where we had shooters on the floor and we moved the basketball to give us a little bit of a chance,\" said Suns interim coach Jay Triano."}
{"game_id": "0021700652", "chunk_id": "0021700652_022", "order": 22, "role": "body", "text": "The teams met in the season opener in Phoenix, with the Blazers winning 124-76 for the worst loss in Suns' history. Portland won the second meeting 114-107 in Portland on Oct. 28."}
{"game_id": "0021700652", "chunk_id": "0021700652_024", "order": 24, "role": "body", "text": "Suns: It was the first of a four-game road trip for the Suns. ... Going into the game, Phoenix was 4-4 on the road in the Western Conference."}
{"game_id": "0021700652", "chunk_id": "0021700652_025", "order": 25, "role": "body", "text": "Trail Blazers: McCollum's career high for 3-pointers is seven. ... Portland has traditionally enjoyed a strong home-court advantage, but this season was 10-10 going into Tuesday's game. The victory gave the Blazers a four-game winning streak at the Moda Center."}
{"game_id": "0021700652", "chunk_id": "0021700652_027", "order": 27, "role": "body", "text": "Stotts has been experimenting more and more (when warranted) with a three-guard lineup, with Lillard, McCollum and Napier."}
{"game_id": "0021700652", "chunk_id": "0021700652_028", "order": 28, "role": "body", "text": "\"When they made their run in the first quarter, we went to it in the first quarter and it was good. We had a lead in the third quarter, so I was trying to kind of preserve `Bazz's minutes, otherwise I probably would have gone to it in the third quarter as well,\" Stotts said."}
{"game_id": "0021700652", "chunk_id": "0021700652_030", "order": 30, "role": "body", "text": "Suns: Visit the Denver Nuggets on Friday."}
{"game_id": "0021700652", "chunk_id": "0021700652_031", "order": 31, "role": "body", "text": "Trail Blazers: Host the Indiana Pacers on Thursday."}
{"game_id": "0021700652", "chunk_id": "0021700652_033", "order": 33, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
