{"game_id": "0021400096", "chunk_id": "0021400096_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  With the Trail Blazers off to a 4-3 start, LaMarcus Aldridge was asked to offer his early assessment of the team."}
{"game_id": "0021400096", "chunk_id": "0021400096_003", "order": 3, "role": "body", "text": "Aldridge scored 28 points and had nine rebounds in the Trail Blazers' 116-100 victory over the Denver Nuggets on Sunday night."}
{"game_id": "0021400096", "chunk_id": "0021400096_004", "order": 4, "role": "body", "text": "The Blazers, winners of three of their last four games, made 16 of 31 3-point attempts and all five starters scored in double figures. With a renewed emphasis on defense this season, Portland held the Nuggets to 17 third-quarter points."}
{"game_id": "0021400096", "chunk_id": "0021400096_005", "order": 5, "role": "body", "text": "\"I thought we played a very good offensive game throughout. The second-half defense, even though we got off to a bit of a slow start in the first three minutes, we had a good defensive second half,\" coach Terry Stotts said. \"It was a good, solid home win.\""}
{"game_id": "0021400096", "chunk_id": "0021400096_006", "order": 6, "role": "body", "text": "Wesley Matthews added 21 points, making five of 13 3-point attempts."}
{"game_id": "0021400096", "chunk_id": "0021400096_007", "order": 7, "role": "body", "text": "Ty Lawson had 18 points for Denver after missing the team's 110-101 loss at home to Cleveland on Friday night with a sore left ankle. Kenneth Faried led the Nuggets with 19 points."}
{"game_id": "0021400096", "chunk_id": "0021400096_008", "order": 8, "role": "body", "text": "It was Denver's fifth straight loss."}
{"game_id": "0021400096", "chunk_id": "0021400096_009", "order": 9, "role": "body", "text": "\"I did feel better about this game,\" Nuggets coach Brian Shaw said. \"There's no moral victories but I did feel better with the rotation, with the effort that our guys gave. So we just have to keep chipping away to try and stop the bleeding.\""}
{"game_id": "0021400096", "chunk_id": "0021400096_010", "order": 10, "role": "body", "text": "Portland was coming off a 106-102 loss to the Clippers in Los Angeles the day before but showed no sign of fatigue, leading by 18 points in the fourth quarter."}
{"game_id": "0021400096", "chunk_id": "0021400096_011", "order": 11, "role": "body", "text": "The Nuggets closed to 102-94 on Lawson's driving layup with 3:11 left, but Damian Lillard hit a 3-pointer that extended it to 111-98 with just over a minute left to seal it."}
{"game_id": "0021400096", "chunk_id": "0021400096_012", "order": 12, "role": "body", "text": "Denver also saw the return of J.J. Hickson, who finished a five-game suspension for violating the league's drug policy. Coach Brian Shaw said Hickson's minutes would be limited because the forward was coming off March surgery to repair a torn ACL."}
{"game_id": "0021400096", "chunk_id": "0021400096_013", "order": 13, "role": "body", "text": "The Nuggets were without reserve forward Darrell Arthur, who was suspended for a game without pay for shoving Cleveland guard Dion Waiters in the back as he went up for a first-quarter layup. Arthur was ejected."}
{"game_id": "0021400096", "chunk_id": "0021400096_014", "order": 14, "role": "body", "text": "Aldridge put the Blazers up 55-43 in the first half with a 21-foot jumper. But the Nuggets pulled back into the game, closing to 59-54 on Timofey Mozgov's dunk."}
{"game_id": "0021400096", "chunk_id": "0021400096_015", "order": 15, "role": "body", "text": "Matthews hit a 3-pointer at the buzzer to make it 64-56 going into the break. Matthews had 19 points in the first half."}
{"game_id": "0021400096", "chunk_id": "0021400096_016", "order": 16, "role": "body", "text": "Aldridge's 15-footer gave the Blazers a 75-64 lead midway through the third quarter and Denver never threatened."}
{"game_id": "0021400096", "chunk_id": "0021400096_017", "order": 17, "role": "body", "text": "The game got chippy in the fourth quarter. Denver's Kenneth Faried appeared to shove Blazers guard Steve Blake, who turned around and pushed Faried to the ground. Players from both teams jumped in to separate the two, and Blake was given a flagrant foul after a review."}
{"game_id": "0021400096", "chunk_id": "0021400096_018", "order": 18, "role": "body", "text": "\"I'm playing offense and making sure my point guard got open,\" Faried said. \"He (Blake) ran into the back pick and he got mad about it and pushed me. Yeah, I fell down to make sure the ref saw it.\""}
{"game_id": "0021400096", "chunk_id": "0021400096_019", "order": 19, "role": "body", "text": "Blazers forward Nicolas Batum was injured with just about a minute left in the game. The injury was to his right foot or ankle."}
{"game_id": "0021400096", "chunk_id": "0021400096_021", "order": 21, "role": "body", "text": "Nuggets: Coach Brian Shaw was asked before the game if he planned to double-team LaMarcus Aldridge, who was averaging 22 points. \"Everybody knows I don't like to double team,\" he said \"I might have to get over my own stubbornness.\""}
{"game_id": "0021400096", "chunk_id": "0021400096_022", "order": 22, "role": "body", "text": "Trail Blazers: Before the game the Trail Blazers wore shirts emblazoned with the name Sandy in honor of season ticketholder Sandra Zickefoose, who passed away last Thursday after she collapsed during the fourth quarter of the Blazers' game against Dallas. A single rose rested on her seat at the Moda Center, and the Blazers held a moment of silence."}
{"game_id": "0021400096", "chunk_id": "0021400096_024", "order": 24, "role": "body", "text": "There was no word after the game on the severity of the injury to Batum. Although it appeared that he may have rolled his ankle, he was also holding his knee. He was being evaluated after the game by medical staff and was not in the locker room. He had 10 points in the game."}
{"game_id": "0021400096", "chunk_id": "0021400096_026", "order": 26, "role": "body", "text": "While the Blazers host Charlotte on Tuesday, the Nuggets' next game is at home on Wednesday -- against Portland. \"I think Wednesday we're going to be a lot more electrified because we're tired of losing,\" Faried said. \"We're going to do everything in our power to go out there and fight, claw, tooth and nail to get the win. If we can get over this hump we can get out of this drought.\""}
{"game_id": "0021400096", "chunk_id": "0021400096_028", "order": 28, "role": "body", "text": "The Nuggets host the Trail Blazers on Wednesday night."}
{"game_id": "0021400096", "chunk_id": "0021400096_029", "order": 29, "role": "closing", "text": "The Trail Blazers host the Charlotte Hornets on Tuesday night."}
