{"game_id": "0021700504", "chunk_id": "0021700504_001", "order": 1, "role": "lead", "text": "PHOENIX --  Tyson Chandler learned of the Suns' crafty inbounds play when Jay Triano took over as coach early this season. With 0.6 seconds left in a tie game Tuesday night, he asked Triano during a timeout if Phoenix was going to run it."}
{"game_id": "0021700504", "chunk_id": "0021700504_003", "order": 3, "role": "body", "text": "Dragan Bender and Chandler did the rest."}
{"game_id": "0021700504", "chunk_id": "0021700504_004", "order": 4, "role": "body", "text": "Bender threw a perfect pass at the rim from the opposite sideline, Chandler jumped over the Grizzlies' Brandan Wright to slam it down with 0.4 seconds remaining, and the Suns beat the Memphis Grizzlies 99-97."}
{"game_id": "0021700504", "chunk_id": "0021700504_005", "order": 5, "role": "body", "text": "After replay review for offensive goaltending, the basket counted, and the Grizzlies couldn't get off a decent shot before the final buzzer."}
{"game_id": "0021700504", "chunk_id": "0021700504_006", "order": 6, "role": "body", "text": "\"My job was to punch it in. It was close,\" Chandler said. \"It might have hit the back rim but I caught it over the cylinders because I knew there was no goaltending.\""}
{"game_id": "0021700504", "chunk_id": "0021700504_008", "order": 8, "role": "body", "text": "\"I told our guy (Bender) to shoot the ball in the basket and all Tyson has to do is touch it on the way down or grab the rim and have it hit your knuckle and go in,\" Triano said, explaining the no-goaltending-from-out-of-bounds rule that made the basket good."}
{"game_id": "0021700504", "chunk_id": "0021700504_009", "order": 9, "role": "body", "text": "Had Chandler not touched Bender's pass and it went through the hoop, the basket would not have counted."}
{"game_id": "0021700504", "chunk_id": "0021700504_010", "order": 10, "role": "body", "text": "\"He got a little push. They usually don't call that stuff at the end of the game. I went up and my hand went under and through the rim, so it kind of messed my timing up a little bit,\" Wright said. \"I had to pull it back out because I didn't want to get a goaltend. They just made a play, a perfect pass.\""}
{"game_id": "0021700504", "chunk_id": "0021700504_011", "order": 11, "role": "body", "text": "Devin Booker scored 32 points in his return from a three-week injury absence before fouling out in the final minute, but the Suns needed one final play after Jarell Martin slammed in a rebound with 0.6 seconds remaining to tie it at 97."}
{"game_id": "0021700504", "chunk_id": "0021700504_012", "order": 12, "role": "body", "text": "\"It is what it is,\" Grizzlies coach J.B. Bickerstaff said."}
{"game_id": "0021700504", "chunk_id": "0021700504_013", "order": 13, "role": "body", "text": "The Suns beat the Grizzlies in a tight game at home for the second time in six days after handing them a 97-95 defeat on Dec. 21. Phoenix has won four of its last six games while Memphis has lost nine of 11."}
{"game_id": "0021700504", "chunk_id": "0021700504_014", "order": 14, "role": "body", "text": "The Suns used a 13-0 run to turn a four-point deficit into a 91-82 lead midway through the fourth quarter. The Grizzlies went nearly six minutes without a point."}
{"game_id": "0021700504", "chunk_id": "0021700504_015", "order": 15, "role": "body", "text": "But Booker fouled out with 41 seconds to go and Memphis cut it to 96-95 when Tyreke Evans made a layup with 6.2 seconds left."}
{"game_id": "0021700504", "chunk_id": "0021700504_016", "order": 16, "role": "body", "text": "Evans said he hurt his knee in a collision on his drive that led to the tying basket and had to sit out the final play of game, subbed out for Wright."}
{"game_id": "0021700504", "chunk_id": "0021700504_017", "order": 17, "role": "body", "text": "T.J. Warren scored 17 points for the Suns."}
{"game_id": "0021700504", "chunk_id": "0021700504_018", "order": 18, "role": "body", "text": "Evans had 25 points for the Grizzlies, who got 18 from Marc Gasol."}
{"game_id": "0021700504", "chunk_id": "0021700504_019", "order": 19, "role": "body", "text": "Booker hit his first shot of the game, a 16-foot jumper 13 seconds after tipoff. He made 9 of 21 shots and 11 of 12 of free throws."}
{"game_id": "0021700504", "chunk_id": "0021700504_020", "order": 20, "role": "body", "text": "\"This is better than Christmas for me,\" Booker said. \"Getting a chance to be back out on the floor, playing with my brothers and coming out with a close win makes it that much better.\""}
{"game_id": "0021700504", "chunk_id": "0021700504_022", "order": 22, "role": "body", "text": "Grizzlies: F Chandler Parsons was held out for rest, the third game in the past five in which he didn't play. ... F JaMychal Green missed his second straight game with right knee soreness. ... G Mike Conley missed his 22nd consecutive game with a left Achilles tendon injury. \"He's still working. He's on the trip with us now, so he's improving,\" Bickerstaff said. \"We don't have a (return) date set yet, but he's making steps in the right direction.\""}
{"game_id": "0021700504", "chunk_id": "0021700504_023", "order": 23, "role": "body", "text": "Suns: Triano reached 100 career victories as an NBA coach. He has 13 with the Suns and 87 with Toronto. ... The Suns' bench averaged 51.4 points per game as a unit over five previous games, but combined for 29 with Booker's return Tuesday. ... C Greg Monroe, who had 12 rebounds, eight points and seven assists the last time the teams met, did not play."}
{"game_id": "0021700504", "chunk_id": "0021700504_025", "order": 25, "role": "body", "text": "Bender had the assist of the night, his only one of the game. Booker threw three lobs to the rim for dunks as part of his six assists. Two went to Chandler in the first quarter and one toss found Marquese Chriss for a jam with 4:47 left in the second."}
{"game_id": "0021700504", "chunk_id": "0021700504_027", "order": 27, "role": "body", "text": "The game was delayed for a few moments before the start of the second quarter while officials deliberated about the score. It originally read 29-21 when the first quarter ended, but was changed to 29-19."}
{"game_id": "0021700504", "chunk_id": "0021700504_029", "order": 29, "role": "body", "text": "Grizzlies: At Los Angeles Lakers on Wednesday."}
{"game_id": "0021700504", "chunk_id": "0021700504_030", "order": 30, "role": "body", "text": "Suns: At Sacramento on Friday."}
{"game_id": "0021700504", "chunk_id": "0021700504_032", "order": 32, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
