{"game_id": "0021401051", "chunk_id": "0021401051_001", "order": 1, "role": "lead", "text": "CHICAGO -- Nikola Mirotic and Pau Gasol carried the Chicago Bulls in Jimmy Butler's return to the court.\nMirotic scored 14 of his 28 points in the fourth quarter, and the Bulls clinched a playoff spot with a 98-86 win over the Charlotte Hornets on Monday night.\nGasol had 27 points and 12 rebounds as Chicago moved into a tie with Toronto for third place in the Eastern Conference. Butler added 19 points on 6-of-20 shooting after missing 11 games with a sprained left elbow.\n\"It was great to have him back. Great,\" Bulls coach Tom Thibodeau said. \"He had a bunch of bunnies that he always makes, so his timing was not quite there but I thought as the game went on, he started to get into a rhythm.\""}
{"game_id": "0021401051", "chunk_id": "0021401051_002", "order": 2, "role": "closing", "text": "The Bulls played without center Joakim Noah, who was scratched because of general soreness, but managed to bounce back from an ugly 107-91 loss at Detroit on Saturday.\nKemba Walker had 29 points and Mo Williams scored 15 for the Hornets, who were without Cody Zeller (right shoulder) and shot just 34.6 percent from the field. Charlotte also played most of the second half without Al Jefferson, who was held out as a precaution because of a sore right knee.\nThe Hornets finished with 11 assists and 11 turnovers.\n\"A lot of it was their defense. They're versatile. They have size everywhere. Basically, what they said tonight was shoot jumpers,\" Charlotte coach Steve Clifford said. \"They're going to shut down the paint. Except for Mo, make us shoot from over the top. They did a good job and we still were twice down four in the fourth with five minutes. We had the ball right at the rim. It didn't go in.\"\nCharlotte has lost four of five to fall out of the eighth and final playoff spot in the Eastern Conference. The Hornets are a half-game back of Boston, which beat Brooklyn 110-91 on Monday night.\n\"They did a great job,\" Walker said. \"Every time we tried to make a push, they scored a big basket. We just couldn't get a stop down the stretch.\"\nMirotic was 10 for 19 from the field and also had eight rebounds in 31 1/2 minutes. The 6-foot-10 rookie is averaging 21 points per game in March, helping Chicago stay in contention despite another rash of injuries.\n\"Man, dude can play. He's basically carried this month, to tell you the truth,\" Butler said. \"He's confident, I think he's only going to continue to get better because he's always in a gym working on his game and it shows.\"\nGasol made a 3-pointer from the corner to give the Bulls a 74-69 lead heading into the final period. Mirotic had a big 3 with 2:33 to go, and then dunked over Jason Maxiell with 1:55 remaining to increase Chicago's lead to nine.\n\"We've got 10 games left to play, each and every game will be important and critical for our seeding and we've got to create momentum and consistency going into the playoffs,\" Gasol said.\nTIP-INS\nHornets: Clifford doesn't seem too bothered by the tight race for the final Eastern Conference playoff spot. \"It's a lot of fun,\" Clifford said. \"It's why you play, obviously.\" ... One game after shooting a season-high 80 percent, Michael Kidd-Gilchrist missed his first four shots and was 2 for 8 from the field. He finished with seven points and nine rebounds.\nBulls: Thibodeau said Derrick Rose (knee) is \"making good, steady progress\" and the 2011 NBA MVP is \"doing everything in practice except the contact part.\" ... The Bulls wore their alternate black uniforms at home.\nUP NEXT\nHornets: Host Brooklyn on Wednesday night.\nBulls: Visit Toronto on Wednesday night.\nSTART HIM?\nMirotic has become one of the Bulls' most important players, but he has made only three starts all year.\n\"I like the role he's in,\" Thibodeau said. \"I think that's the best role for him right now.\"\nNOT ENOUGH CONTROL\nDespite leading the NBA in defensive rebound percentage, Charlotte hasn't held a team under 90 points in 12 games, since a 98-83 win at Orlando on March 1. The Hornets are 6-6 in that stretch, including the last five on the road.\n\"It's been a long trip. We've played better,\" Clifford said. \"We had some stretches of good play tonight. We hope to play better on Wednesday.\""}
