{"game_id": "0021700408", "chunk_id": "0021700408_001", "order": 1, "role": "lead", "text": "MIAMI --  The Trail Blazers and Heat began the night with identical records of 13-13, so a close game was to be expected."}
{"game_id": "0021700408", "chunk_id": "0021700408_002", "order": 2, "role": "body", "text": "For Damian Lillard to take over down the stretch was also no surprise."}
{"game_id": "0021700408", "chunk_id": "0021700408_003", "order": 3, "role": "body", "text": "The two-time All-Star guard scored seven of his 18 points in the final 3:16, and the Trail Blazers overcame a 16-point second-half deficit to break their five-game losing streak, beating Miami 102-95 on Wednesday night."}
{"game_id": "0021700408", "chunk_id": "0021700408_004", "order": 4, "role": "body", "text": "Lillard, who came into the game averaging 26.6 points, had only one field goal in the first 31 minutes because the Heat ganged up on him defensively."}
{"game_id": "0021700408", "chunk_id": "0021700408_005", "order": 5, "role": "body", "text": "\"They were trying to show me a lot of attention, so I was just trying to make the right plays,\" he said. \"But down the stretch I knew I would have to get aggressive.\""}
{"game_id": "0021700408", "chunk_id": "0021700408_006", "order": 6, "role": "body", "text": "Lillard converted a three-point play to put the Trail Blazers ahead to stay, 98-95, and sank two free throws on their next possession for a five-point lead."}
{"game_id": "0021700408", "chunk_id": "0021700408_007", "order": 7, "role": "body", "text": "\"You almost hate seeing him have a pedestrian box score stat line going into the fourth quarter,\" Miami coach Erik Spoelstra said. \"You know he's not going to sit back and not put his fingerprints on the game going down the stretch.\""}
{"game_id": "0021700408", "chunk_id": "0021700408_008", "order": 8, "role": "body", "text": "CJ McCollum scored 28 points for the Trail Blazers, who climbed back above .500 and improved to 7-5 on the road."}
{"game_id": "0021700408", "chunk_id": "0021700408_009", "order": 9, "role": "body", "text": "\"That was a game we needed to win coming off five losses in a row,\" McCollum said. \"We had to do whatever it takes to come away with a win.\""}
{"game_id": "0021700408", "chunk_id": "0021700408_010", "order": 10, "role": "body", "text": "The Heat dropped to 5-7 at home."}
{"game_id": "0021700408", "chunk_id": "0021700408_011", "order": 11, "role": "body", "text": "Miami reserve Wayne Ellington sank seven 3-pointers and scored a season-high 24 points. Dion Waiters added 17 points for the Heat, who were hurt by three missed free throws down the stretch."}
{"game_id": "0021700408", "chunk_id": "0021700408_012", "order": 12, "role": "body", "text": "Portland scored the final seven points, shutting out the Heat over the final 2:46. Miami missed its final four shots."}
{"game_id": "0021700408", "chunk_id": "0021700408_013", "order": 13, "role": "body", "text": "\"These are tough to swallow,\" Ellington said. \"We played about 43 minutes of Miami Heat basketball. We've got to get better at finishing.\""}
{"game_id": "0021700408", "chunk_id": "0021700408_014", "order": 14, "role": "body", "text": "The Trail Blazers trailed 70-54 early in the second half, and 79-70 to start the fourth quarter."}
{"game_id": "0021700408", "chunk_id": "0021700408_015", "order": 15, "role": "body", "text": "\"It wasn't a game where we came out and made every shot and everything went well,\" Lillard said. \"We had to go get it. That's usually how it is when you're trying to get things going back in the right direction, so we worked for it.\""}
{"game_id": "0021700408", "chunk_id": "0021700408_016", "order": 16, "role": "body", "text": "The Trail Blazers won for the third time when trailing to start the final period."}
{"game_id": "0021700408", "chunk_id": "0021700408_017", "order": 17, "role": "body", "text": "\"You have to credit Portland,\" Spoelstra said. \"That's not their first rodeo in a close game on the road.\""}
{"game_id": "0021700408", "chunk_id": "0021700408_019", "order": 19, "role": "body", "text": "Both teams were short-handed. Heat forward Justise Winslow left the game in the first half with a left knee strain and did not return, and guard Tyler Johnson sat out because of a migraine."}
{"game_id": "0021700408", "chunk_id": "0021700408_020", "order": 20, "role": "body", "text": "Miami was also without center Hassan Whiteside for a seventh consecutive games because of a bone bruise in his left knee."}
{"game_id": "0021700408", "chunk_id": "0021700408_021", "order": 21, "role": "body", "text": "Al-Farouq Aminu had 15 points and 13 rebounds for the Trail Blazers, who were without Jusuf Nurkic and Meyers Leonard."}
{"game_id": "0021700408", "chunk_id": "0021700408_023", "order": 23, "role": "body", "text": "Ellington went 5 for 5 from 3-point range in the first quarter, helping Miami to a 33-21 lead. Portland limited him to three points in the second half."}
{"game_id": "0021700408", "chunk_id": "0021700408_024", "order": 24, "role": "body", "text": "\"When you make some shots in the first half, they're going to stick to you more in the second half,\" he said."}
{"game_id": "0021700408", "chunk_id": "0021700408_025", "order": 25, "role": "body", "text": "Miami scored 33 points in the first quarter but only 35 in the second half."}
{"game_id": "0021700408", "chunk_id": "0021700408_027", "order": 27, "role": "body", "text": "Miami's Kelly Olynyk had a slight edge in the matchup of former Gonzaga centers. He had 10 points and six rebounds in 28 minutes, and Portland's Zach Collins had nine points and three rebounds in 21 minutes."}
{"game_id": "0021700408", "chunk_id": "0021700408_029", "order": 29, "role": "body", "text": "Trail Blazers: C Nurkic (sprained right ankle) missed his third game in a row. ... F/C Leonard (illness) also sat out. ... F Maurice Harkless (bruised left quad) returned after missing two games but didn't score in nine minutes."}
{"game_id": "0021700408", "chunk_id": "0021700408_030", "order": 30, "role": "body", "text": "Heat: Winslow said he didn't think his injury was serious. ... Spoelstra said Whiteside is working out and feeling better, but he's not ready to return to practice."}
{"game_id": "0021700408", "chunk_id": "0021700408_032", "order": 32, "role": "body", "text": "Miami: The Heat play at Charlotte on Friday night. Miami beat the Hornets earlier this week."}
{"game_id": "0021700408", "chunk_id": "0021700408_033", "order": 33, "role": "body", "text": "Portland: The Trail Blazers continue a five-game trip when they play Friday night at Orlando."}
{"game_id": "0021700408", "chunk_id": "0021700408_035", "order": 35, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
