{"game_id": "0021400524", "chunk_id": "0021400524_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Zaza Pachulia lifted his arms in celebration even before Brandon Knight's 3-pointer swished through the net. Moments later, Pachulia looked just as confident as he drained a jumper himself."}
{"game_id": "0021400524", "chunk_id": "0021400524_002", "order": 2, "role": "body", "text": "For the Milwaukee Bucks, it felt as if everything was going in."}
{"game_id": "0021400524", "chunk_id": "0021400524_003", "order": 3, "role": "body", "text": "Brandon Knight and Khris Middleton scored 18 points apiece, and Milwaukee beat the Philadelphia 76ers 97-77 on Wednesday night."}
{"game_id": "0021400524", "chunk_id": "0021400524_004", "order": 4, "role": "body", "text": "The Bucks (19-18) shot 53.9 percent from the field in their fifth consecutive road win. Pachulia had 11 points and 12 rebounds, and reserve O.J. Mayo added 15 points."}
{"game_id": "0021400524", "chunk_id": "0021400524_005", "order": 5, "role": "body", "text": "\"We played hard,\" Knight said. \"We stuck to our principles. We know they like to play a really fast-paced game. They still did that tonight but we wanted to make sure we played at our place and played the right way.\""}
{"game_id": "0021400524", "chunk_id": "0021400524_006", "order": 6, "role": "body", "text": "K.J. McDaniels scored 14 points and Nerlens Noel had 13 for the Sixers (5-29), who were trying to win consecutive home games for the first time since the start of the 2013-14 season."}
{"game_id": "0021400524", "chunk_id": "0021400524_007", "order": 7, "role": "body", "text": "The Sixers shot 30.1 percent from the field. Starters Michael Carter-Williams (1 for 13), Robert Covington (1 for 11) and Henry Sims (1 for 8) had particularly bad nights."}
{"game_id": "0021400524", "chunk_id": "0021400524_008", "order": 8, "role": "body", "text": "Carter-Williams, the team's second-leading scorer, finished with five points and committed four of the team's 24 turnovers."}
{"game_id": "0021400524", "chunk_id": "0021400524_009", "order": 9, "role": "body", "text": "\"I don't really have any explanation besides I was terrible tonight,\" he said. \"I was trying to make plays and my shot wasn't falling. I tried to get my teammates involved and do other things out there but the game just wasn't going our way.\""}
{"game_id": "0021400524", "chunk_id": "0021400524_010", "order": 10, "role": "body", "text": "After 14 straight losses at the Wells Fargo Center, Philadelphia beat Cleveland 95-92 on Monday for its first home win of the season. But the Sixers got off to a slow start against Milwaukee, falling behind by 16 after the Bucks closed the first quarter on a 17-2 run, capped by a Mayo 3-pointer right before the buzzer."}
{"game_id": "0021400524", "chunk_id": "0021400524_011", "order": 11, "role": "body", "text": "The Sixers opened the second quarter with an 11-2 spurt, but the Bucks used a few transition buckets to rebuild their lead. They had a comfortable 53-39 advantage at the break."}
{"game_id": "0021400524", "chunk_id": "0021400524_012", "order": 12, "role": "body", "text": "Milwaukee shot 59.5 percent from the floor in the first half, while the Sixers shot 28.3 percent."}
{"game_id": "0021400524", "chunk_id": "0021400524_013", "order": 13, "role": "body", "text": "\"We were lost most of the night and that resulted in the poorest game of the year, in my opinion,\" Philadelphia coach Brett Brown said."}
{"game_id": "0021400524", "chunk_id": "0021400524_014", "order": 14, "role": "body", "text": "While the Sixers felt they were doomed by their slow start, the Bucks were encouraged that they managed to hold their wire-to-wire lead and fend off any Philadelphia rallies."}
{"game_id": "0021400524", "chunk_id": "0021400524_015", "order": 15, "role": "body", "text": "The Bucks scored the first nine points of the third period, and Knight had a big transition dunk to put the Bucks up by 24 with five minutes left in the game -- before skipping all the way to the Milwaukee sideline in celebration."}
{"game_id": "0021400524", "chunk_id": "0021400524_016", "order": 16, "role": "body", "text": "\"That's something we've tried to be better at,\" Knight said. \"We've gotten up against other teams with big leads and given them away. So really once we got up, our focus was on continuing do the right things and continuing to make the right plays offensively and defensively.\""}
{"game_id": "0021400524", "chunk_id": "0021400524_017", "order": 17, "role": "body", "text": "Because they held such a comfortable lead, the Bucks even managed to get some top players a little bit of rest."}
{"game_id": "0021400524", "chunk_id": "0021400524_018", "order": 18, "role": "body", "text": "With Milwaukee in the middle of a four-game-in-five-day stretch and a game against the Knicks in London looming next week, coach Jason Kidd opted to hold starting forward Giannis Antetokounmpo out for the entire second half while distributing a lot of minutes to his reserves."}
{"game_id": "0021400524", "chunk_id": "0021400524_019", "order": 19, "role": "body", "text": "\"The game, we felt, was in control.\" Kidd said. \"And that was a good time to give them a rest.\""}
{"game_id": "0021400524", "chunk_id": "0021400524_021", "order": 21, "role": "body", "text": "Bucks: Milwaukee got 37 points from its reserves, including 23 in the first half. .. Center Larry Sanders missed his eighth straight game due to personal reasons. . The Bucks have won four straight over the Sixers."}
{"game_id": "0021400524", "chunk_id": "0021400524_022", "order": 22, "role": "body", "text": "76ers: Tony Wroten, the subject of recent trade rumors, told reporters before the game that he is \"auditioning for everybody.\" But Philly's high-scoring guard then missed his first seven shots and finished the game with 12 points on 4-for-19 shooting. ... The Sixers registered just 11 points in the first quarter, with only three players scoring -- Noel, Carter-Williams and McDaniels."}
{"game_id": "0021400524", "chunk_id": "0021400524_024", "order": 24, "role": "body", "text": "The Bucks are thrilled with their road win streak, but are equally disappointed that they have dropped four straight at home during that same stretch."}
{"game_id": "0021400524", "chunk_id": "0021400524_025", "order": 25, "role": "body", "text": "Kidd has a feeling that will soon begin to change."}
{"game_id": "0021400524", "chunk_id": "0021400524_026", "order": 26, "role": "body", "text": "\"In this league, everything tends to balance itself out,\" Kidd said. \"We'd like to keep winning on the road, but we have to start paying attention to home and protect home.\""}
{"game_id": "0021400524", "chunk_id": "0021400524_028", "order": 28, "role": "body", "text": "Bucks: Host the Timberwolves on Friday."}
{"game_id": "0021400524", "chunk_id": "0021400524_029", "order": 29, "role": "closing", "text": "76ers: Visit Brooklyn on Friday."}
