{"game_id": "0021300646", "chunk_id": "0021300646_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- D.J. Augustin says he has no hard feelings when it comes to the Charlotte Bobcats -- even though they let him walk in free agency after the 2012 season.\n\"Just a business,\" Augustin said with a smile.\nHe sure took care of business Saturday night."}
{"game_id": "0021300646", "chunk_id": "0021300646_002", "order": 2, "role": "closing", "text": "Augustin played like a man with something prove, breaking open a close game by scoring 15 of his 28 points in the fourth quarter to help the Chicago Bulls hold off the Charlotte Bobcats 89-87 and get back above .500.\nThe Bulls (22-21) have won 10 of their last 13 games.\nAugustin hit 4 of 5 shots from the field in the fourth quarter, including three 3-pointers.\nIt was the third time in the last four games Augustin has scored at least 27 points.\nAugustin was drafted by the Bobcats in 2008 and spent four seasons in Charlotte before the Bobcats decided to go with Kemba Walker as their starting point guard.\n\"It's always fun playing against your old team,\" Augustin said. \"I'm with the Bulls now and that is all that matters.\"\nAugustin spent time with Indiana and Toronto last season before joining the Bulls this past offseason.\nChicago coach Tom Thibodeau called the 6-foot Augustin a \"huge pickup.\"\n\"We had a need and he had a need as well,\" Thibodeau said. \"It was good for him and it's been great for us and he's played better and better. He was ready when this opportunity came around. It's not only his individual performance, but what he's doing for our team.\"\nJoakim Noah added 11 points, 10 rebounds and eight assists for the Bulls, who have won 10 of their last 11 against the Bobcats. Taj Gibson had 13 points and seven rebounds, while Mike Dunleavy had 12 points and eight rebounds.\nAl Jefferson continued his hot play for the Bobcats (19-27) with 32 points and 13 rebounds. It was his ninth straight 20-point game.\n\"Nobody is playing better than Al over the last eight or nine games,\" Bobcats coach Steve Clifford said.\nJefferson said the discomfort from the ankle he sprained in the preseason is starting to subside.\n\"At the beginning of the season I wasn't healthy,\" Jefferson said. \"My ankle is feeling really good and I'm not surprised how I'm playing. I know I can play at a very high level when I'm 100 percent.\"\nBut the Bobcats aren't getting much production from other positions with Walker still out with an ankle injury. The starting frontcourt of Ramon Sessions and Gerald Henderson was a combined 9 of 26 from the field.\n\"They double-teamed me and did a good job of keeping the ball out of my hands. So tonight, Kemba would have been needed,\" Jefferson said. \"But it's an opportunity for some other guys to step up and make a name for themselves.\"\nChicago came in having defeated the Bobcats by an average of 27.5 points in the last four meetings in Charlotte, but this one was close throughout the first three quarters with 14 lead changes and neither team leading by more than six points.\nThe Bulls were up 55-54 going into the final period and quickly extended that lead to 11 sparked by eight quick points from Augustin and six from Tony Snell.\nThe lead would get to 12 before a frantic Bobcats comeback in the final minute, with Jannero Pargo knocking down a 26-footer with 3.4 seconds left to cut the lead to three. But Augustin made two free throws to seal the win.\nJefferson hit a one-handed heave from just beyond half court as time expired, although it wouldn't matter.\nChicago surrendered 112 point to the Los Angeles Clippers on Friday night -- the second-most they've allowed this season -- but the league's second-best defense returned to form against the Bobcats.\nThey held Charlotte to 42 percent shooting after allowing the Clippers to beat them with 59.3 percent shooting.\n\"We get knocked down but we always get back up and keep fighting,\" Augustin said. \"That is the motto of our team.\"\nGame notes\nWalker missed his fourth straight game with an ankle injury. ... Carlos Boozer has scored in double digits in nine straight games for the Bulls. ... Sessions had 11 assists for the Bobcats. ... The Bobcats had been outrebounded by 22 in the first two meetings, but held a 45-41 edge on the boards this time."}
