{"game_id": "0021701117", "chunk_id": "0021701117_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  The season may be dragging for some teams at the bottom of the NBA standings, though the Brooklyn Nets are making the most of it."}
{"game_id": "0021701117", "chunk_id": "0021701117_002", "order": 2, "role": "body", "text": "The Nets put seven players in double figures, including all five starters and ran away from the Orlando Magic in the fourth quarter en route to a 111-104 victory on Wednesday night."}
{"game_id": "0021701117", "chunk_id": "0021701117_003", "order": 3, "role": "body", "text": "\"Even though we lost the last few games, we've been playing the right way and we're inching over the hump,\" said Rondae Hollis-Jefferson, who had 14 points and nine rebounds."}
{"game_id": "0021701117", "chunk_id": "0021701117_004", "order": 4, "role": "body", "text": "D'Angelo Russell led the way for Brooklyn with 16 points and 12 assists. Caris LeVert also scored 16 and DeMarre Carroll had 14 points and 12 rebounds for the Nets, who had lost their three previous games, but finally outplayed an opponent in the fourth quarter."}
{"game_id": "0021701117", "chunk_id": "0021701117_005", "order": 5, "role": "body", "text": "\"Tonight was a good display of what we should be doing to finish games,\" said rookie Jarrett Allen, who contributed 15 points and eight rebounds."}
{"game_id": "0021701117", "chunk_id": "0021701117_006", "order": 6, "role": "body", "text": "The Nets outscored the Magic 17-2 to start the final period and build a 19-point lead that gave them plenty of cushion to rest on the final six minutes of the game."}
{"game_id": "0021701117", "chunk_id": "0021701117_007", "order": 7, "role": "body", "text": "\"We're going to be in the playoffs sooner rather than later,\" Russell said. \"It's sad that we're figuring things out right now, but the last few games, when everyone is making an effort to do what they do best, we're a good team.\""}
{"game_id": "0021701117", "chunk_id": "0021701117_008", "order": 8, "role": "body", "text": "The Nets led 85-81 going into the fourth quarter, after allowing the Magic to finish the third period with a 14-4 run. However, the Brooklyn defense rose to the occasion, forcing Orlando to go 0 for 11 from the field before Mario Hezonja made a layup with 5:57 left in the game."}
{"game_id": "0021701117", "chunk_id": "0021701117_009", "order": 9, "role": "body", "text": "\"After giving up 30 in the third period, I told the guys this would be a game of stops and I thought our guys locked in,\" Brooklyn coach Kenny Atkinson said. \"We've been pushing to get over the hump and we got over it tonight.\""}
{"game_id": "0021701117", "chunk_id": "0021701117_010", "order": 10, "role": "body", "text": "Just the opposite is happening for the Magic, who have lost nine of their last 11 games and look like they are playing out the string of their sixth straight losing season."}
{"game_id": "0021701117", "chunk_id": "0021701117_011", "order": 11, "role": "body", "text": "Nikola Vucevic led Orlando with 24 points and 15 rebounds and Hezonja had 23. Aaron Gordon added 15 points and D.J. Augustin 14, but none of them could rescue the offense during the final period drought."}
{"game_id": "0021701117", "chunk_id": "0021701117_012", "order": 12, "role": "body", "text": "It got so bad that coach Frank Vogel sent in bench players for the final four minutes of the game. They didn't cut the deficit under 10 until the final 35 seconds of the game."}
{"game_id": "0021701117", "chunk_id": "0021701117_013", "order": 13, "role": "body", "text": "\"These guys have been a tough matchup for us all year,\" said Vogel, whose team is 1/3 against Brooklyn this season. \"We knew this was going to be a challenge and we certainly didn't do a good enough job.\""}
{"game_id": "0021701117", "chunk_id": "0021701117_015", "order": 15, "role": "body", "text": "Nets: Brooklyn is 11-6 against the Southeast Division this season. . The Nets average 43.7 points off the bench, second in the NBA. Their bench contributed 39 against Orlando."}
{"game_id": "0021701117", "chunk_id": "0021701117_016", "order": 16, "role": "body", "text": "Magic: G Rodney Purvis got his first NBA start after signing a contract for the rest of the season. Purvis finished two 10-day contracts with Orlando. Purvis was 0 for 6 and scored two points. . It appears the season is over for SG Evan Fournier and SF Terrence Ross, who were both attempting to return from knee injuries."}
{"game_id": "0021701117", "chunk_id": "0021701117_018", "order": 18, "role": "body", "text": "Nets: Visit Miami on Saturday night."}
{"game_id": "0021701117", "chunk_id": "0021701117_019", "order": 19, "role": "closing", "text": "Magic: Host the Chicago Bulls on Friday."}
