{"game_id": "0021400172", "chunk_id": "0021400172_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Orlando Magic went small -- and came up big."}
{"game_id": "0021400172", "chunk_id": "0021400172_002", "order": 2, "role": "body", "text": "Struggling to find their way on offense, Magic coach Jacque Vaughn turned to a four-guard lineup late in the second half, sparking a huge comeback."}
{"game_id": "0021400172", "chunk_id": "0021400172_003", "order": 3, "role": "body", "text": "Evan Fournier scored 21 points, Tobias Harris had 17 points and 16 rebounds and the Magic erased a 23-point second-half deficit to hand the Charlotte Hornets their fourth straight loss 105-100 on Friday night."}
{"game_id": "0021400172", "chunk_id": "0021400172_004", "order": 4, "role": "body", "text": "At one point, the Magic had Fournier matched up on Charlotte's 7-foot power forward Cody Zeller."}
{"game_id": "0021400172", "chunk_id": "0021400172_005", "order": 5, "role": "body", "text": "\"When they went small it changed the momentum of the game,\" Hornets guard Gary Neal said. \"They drove the ball. When you have a lead and guys are coming down the floor and attacking, attacking and attacking, that's one of the hardest things to guard. And it seemed like they didn't miss any shots.\""}
{"game_id": "0021400172", "chunk_id": "0021400172_006", "order": 6, "role": "body", "text": "The Magic shot a blazing 71.4 percent (15 of 21) in the fourth quarter and outscored the Hornets 41-21."}
{"game_id": "0021400172", "chunk_id": "0021400172_007", "order": 7, "role": "body", "text": "It tied the third largest comeback in Orlando history."}
{"game_id": "0021400172", "chunk_id": "0021400172_008", "order": 8, "role": "body", "text": "\"It was pure magic,\" Harris said with a laugh."}
{"game_id": "0021400172", "chunk_id": "0021400172_009", "order": 9, "role": "body", "text": "The Magic trailed by 15 entering the fourth quarter, but Willie Green jumpstarted the offense by scoring all nine of his points at a crucial juncture in the final period. Fellow reserves Elfrid Payton had eight of his 16 points in the fourth quarter and Ben Gordon had all nine of his points in the final period."}
{"game_id": "0021400172", "chunk_id": "0021400172_010", "order": 10, "role": "body", "text": "Nikola Vucevic had 14 points and 10 rebounds for Orlando (6-8)."}
{"game_id": "0021400172", "chunk_id": "0021400172_011", "order": 11, "role": "body", "text": "\"There was no panic and we talked about that at halftime,\" Vaughn said. \"I told them we would get a chance to get back into the game. This was a great lesson for a lot of guys in the locker room.\""}
{"game_id": "0021400172", "chunk_id": "0021400172_012", "order": 12, "role": "body", "text": "It's the second time in 11 days the Hornets have surrendered a 23-point lead and lost."}
{"game_id": "0021400172", "chunk_id": "0021400172_013", "order": 13, "role": "body", "text": "Al Jefferson had 24 points and 11 rebounds, and Kemba Walker added 15 points and 12 rebounds for the struggling Hornets (4-9), who have lost six of their last seven games."}
{"game_id": "0021400172", "chunk_id": "0021400172_014", "order": 14, "role": "body", "text": "The Hornets pushed the lead to 23 points midway through the third quarter."}
{"game_id": "0021400172", "chunk_id": "0021400172_016", "order": 16, "role": "body", "text": "The 11-year NBA veteran hit back-to-back jumpers, Gordon connected on a 19-foot jump shot before Green swished another 19-foot jumper to tie the game at 93. Payton finally put the Magic ahead with 1:30 left when he hit a pull-up jump shot."}
{"game_id": "0021400172", "chunk_id": "0021400172_017", "order": 17, "role": "body", "text": "But the big play came with the game tied 97-97. Payton missed two free throws but the Hornets forgot to box out and Green grabbed an offensive rebound for an all-too-easy put back with 57 seconds left in the game to give Orlando the lead for good."}
{"game_id": "0021400172", "chunk_id": "0021400172_018", "order": 18, "role": "body", "text": "Walker said it was his job to box out Green and he didn't."}
{"game_id": "0021400172", "chunk_id": "0021400172_019", "order": 19, "role": "body", "text": "\"It's inexcusable,\" Hornets coach Steve Clifford said."}
{"game_id": "0021400172", "chunk_id": "0021400172_022", "order": 22, "role": "body", "text": "Magic: Rookie forward Aaron Gordon underwent successful surgery on the fractured bone in his left foot on Friday. He is out indefinitely."}
{"game_id": "0021400172", "chunk_id": "0021400172_023", "order": 23, "role": "body", "text": "Hornets: Neal returned after he missed the last two games with a concussion. ... Michael Kidd-Gilchrist (stress reaction) and P.J. Hairston (ankle sprain) remain out of action"}
{"game_id": "0021400172", "chunk_id": "0021400172_024", "order": 24, "role": "body", "text": "LONG DISTANCE STRUGGLE: The Magic came in shooting better than 45 percent from 3-point range over the last eight games, but failed to connect from beyond the arc in the first half. They finished 4 of 16."}
{"game_id": "0021400172", "chunk_id": "0021400172_025", "order": 25, "role": "body", "text": "ROY IN THE HOUSE: North Carolina coach Roy Williams took in the game from the front row. Williams's Tar Heels will play here on Saturday afternoon."}
{"game_id": "0021400172", "chunk_id": "0021400172_027", "order": 27, "role": "body", "text": "Magic: Host Miami on Saturday night."}
{"game_id": "0021400172", "chunk_id": "0021400172_028", "order": 28, "role": "closing", "text": "Hornets: Play at Miami on Sunday night."}
