{"game_id": "0021701200", "chunk_id": "0021701200_001", "order": 1, "role": "lead", "text": "TORONTO --  The Toronto Raptors gave two key players a breather -- and still had more than enough shooting to win their final home game of the regular season."}
{"game_id": "0021701200", "chunk_id": "0021701200_002", "order": 2, "role": "body", "text": "C.J. Miles scored 22 points, OG Anunoby had a career-high 21 and the Raptors beat the Orlando Magic 112-101 on Sunday night."}
{"game_id": "0021701200", "chunk_id": "0021701200_003", "order": 3, "role": "body", "text": "Serge Ibaka scored 13 points, and Jakob Poeltl and Delon Wright each had 12. The Raptors closed out their home schedule by extending their franchise records for wins (58) and home wins (34)."}
{"game_id": "0021701200", "chunk_id": "0021701200_004", "order": 4, "role": "body", "text": "\"We shot the ball confidently,\" Toronto's Kyle Lowry said. \"We needed that, heading into the next couple of weeks, shooting the ball confidently.\""}
{"game_id": "0021701200", "chunk_id": "0021701200_005", "order": 5, "role": "body", "text": "After clinching the top spot in the Eastern Conference on Friday night with a win over Indiana, the Raptors gave guard DeMar DeRozan and center Jonas Valanciunas the night off. Toronto will rest players again Monday night at Detroit, then return to full strength Wednesday night for the regular-season finale at Miami."}
{"game_id": "0021701200", "chunk_id": "0021701200_006", "order": 6, "role": "body", "text": "\"It's not like we totally need rest, but I think it's the prudent thing to do for our team,\" coach Dwane Casey said."}
{"game_id": "0021701200", "chunk_id": "0021701200_007", "order": 7, "role": "body", "text": "Lowry scored 11 points as the Raptors converted 39 of 78 field goal attempts. Anonoby made five of eight from 3-point range, while Miles hit 5 of 10. Toronto made 17 of 40 from beyond the arc."}
{"game_id": "0021701200", "chunk_id": "0021701200_008", "order": 8, "role": "body", "text": "\"We didn't guard the 3-point line well enough,\" Magic coach Frank Vogel said."}
{"game_id": "0021701200", "chunk_id": "0021701200_009", "order": 9, "role": "body", "text": "Aaron Gordon scored 16 points and Mario Hezonja had 14 for Orlando. The Magic lost for the eighth time in 11 games. Toronto has beaten Orlando twice in that stretch."}
{"game_id": "0021701200", "chunk_id": "0021701200_010", "order": 10, "role": "body", "text": "Magic rookie Khem Birch, who was born in Montreal, matched his career high with 12 points and added a career-high 12 rebounds in his first NBA game in Canada."}
{"game_id": "0021701200", "chunk_id": "0021701200_011", "order": 11, "role": "body", "text": "\"He just impacts the game in the right way,\" Vogel said. \"He was really good tonight.\""}
{"game_id": "0021701200", "chunk_id": "0021701200_012", "order": 12, "role": "body", "text": "Raptors center Lucas Nogueria made his third start of the season in place of Valanciunas but left midway through the first quarter with a sore left hamstring and did not return. Casey said Nogueira would undergo an MRI."}
{"game_id": "0021701200", "chunk_id": "0021701200_013", "order": 13, "role": "body", "text": "Norm Powell, who started in DeRozan's place, suffered a sprained left ankle in the first quarter but returned in the second. Powell finished with 13 points."}
{"game_id": "0021701200", "chunk_id": "0021701200_014", "order": 14, "role": "body", "text": "Guard Fred VanVleet left in the second quarter with a sore lower back and did not return, but Casey said VanVleet's injury was not considered serious."}
{"game_id": "0021701200", "chunk_id": "0021701200_015", "order": 15, "role": "body", "text": "\"If he'd had to have played, he'd have played,\" Casey said."}
{"game_id": "0021701200", "chunk_id": "0021701200_016", "order": 16, "role": "body", "text": "Orlando's Terrence Ross returned after missing more than four months because of injuries to his right knee and leg."}
{"game_id": "0021701200", "chunk_id": "0021701200_017", "order": 17, "role": "body", "text": "\"I felt good,\" Ross said. \"It didn't hurt at all. It was nice shaking off some of the rust.\""}
{"game_id": "0021701200", "chunk_id": "0021701200_018", "order": 18, "role": "body", "text": "Ross, who started his career with the Raptors, had been sidelined since Nov. 29. He scored three points in 10 minutes."}
{"game_id": "0021701200", "chunk_id": "0021701200_019", "order": 19, "role": "body", "text": "\"It's great to see him back out there,\" Vogel said. \"He can do a lot of things. He's going to help us when he's back next year and at full strength.\""}
{"game_id": "0021701200", "chunk_id": "0021701200_021", "order": 21, "role": "body", "text": "Magic: Vucevic (back) and Gordon (right calf) returned to the starting lineup after sitting out Friday's loss to Charlotte. Vucevic finished with 10 points and nine rebounds. . Orlando is 8-32 on the road."}
{"game_id": "0021701200", "chunk_id": "0021701200_022", "order": 22, "role": "body", "text": "Raptors: G Delon Wright thanked fans foe their support in a brief pregame address. ... Toronto's season-high for attempted 3-pointers is 44, set Oct. 21 against Philadelphia in the second game of the regular season."}
{"game_id": "0021701200", "chunk_id": "0021701200_024", "order": 24, "role": "body", "text": "Toronto and Houston both went 34-7 at home this season, tying for the best mark in the NBA."}
{"game_id": "0021701200", "chunk_id": "0021701200_026", "order": 26, "role": "body", "text": "The Raptors swept the season series against the Magic for the first time since 2015-15. Toronto has won 18 of its past 21 meetings with Orlando."}
{"game_id": "0021701200", "chunk_id": "0021701200_028", "order": 28, "role": "body", "text": "A moment of silence was held before the game in honor of the 15 members of the Saskatchewan junior hockey team killed when a semi-trailer hit its bus Friday."}
{"game_id": "0021701200", "chunk_id": "0021701200_030", "order": 30, "role": "body", "text": "Magic: At Milwaukee on Monday night. The Magic have lost nine of their past 10 road games in the series."}
{"game_id": "0021701200", "chunk_id": "0021701200_031", "order": 31, "role": "body", "text": "Raptors: At Detroit on Monday night. The Raptors have won five straight against the Pistons."}
{"game_id": "0021701200", "chunk_id": "0021701200_033", "order": 33, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
