{"game_id": "0021700551", "chunk_id": "0021700551_001", "order": 1, "role": "lead", "text": "PHOENIX --  The Phoenix Suns appeared headed for an ugly home loss to the Atlanta Hawks until the frantic final minutes."}
{"game_id": "0021700551", "chunk_id": "0021700551_002", "order": 2, "role": "body", "text": "That's when Devin Booker and Marquese Chriss came through."}
{"game_id": "0021700551", "chunk_id": "0021700551_003", "order": 3, "role": "body", "text": "Booker sank three free throws to put Phoenix ahead with 12.3 seconds to play, Chriss soared to block Taurean Prince's shot at the rim with 7 seconds to go and the Suns rallied to hand the Hawks another road loss, 104-103 on Tuesday night."}
{"game_id": "0021700551", "chunk_id": "0021700551_004", "order": 4, "role": "body", "text": "\"We played bad today, but that says a lot about a young team,\" Booker said. \"To be able to play bad like that, come back and get a win down late, that's big.\""}
{"game_id": "0021700551", "chunk_id": "0021700551_005", "order": 5, "role": "body", "text": "Booker scored eight of his 34 points in the final 37 seconds, starting with a 3-pointer that made it 101-99, as the Suns finished with a 15-4 run. T.J. Warren scored 31 and Chriss had 17 points, 11 rebounds and two blocks for Phoenix."}
{"game_id": "0021700551", "chunk_id": "0021700551_006", "order": 6, "role": "body", "text": "Booker, in his 13th 30-point game of the season, was 14 of 15 at the foul line, 11-for-11 in the second half."}
{"game_id": "0021700551", "chunk_id": "0021700551_007", "order": 7, "role": "body", "text": "Ersan Ilyasova scored 21 points for Atlanta. Kent Bazemore and Dennis Schroder added 20 apiece."}
{"game_id": "0021700551", "chunk_id": "0021700551_008", "order": 8, "role": "body", "text": "Bazemore made 7 of 8 shots, including 4 of 5 3-pointers, but he fouled Booker on a 3-point attempt with the Hawks clinging to a two-point lead."}
{"game_id": "0021700551", "chunk_id": "0021700551_009", "order": 9, "role": "body", "text": "Booker made all three to put the Suns on top 102-101. Prince took a lob from Schroder and was free for what looked to be an open layup, but Chriss came from the other side of the court to soar and block the shot."}
{"game_id": "0021700551", "chunk_id": "0021700551_010", "order": 10, "role": "body", "text": "\"I just had to run and try to catch up and he lofted the ball a little too much and I was able to get back,\" Chriss said. \"I think I have a chance for pretty much every block I go for.\""}
{"game_id": "0021700551", "chunk_id": "0021700551_011", "order": 11, "role": "body", "text": "Booker called it \"an x-factor play that only Marquese can make.\""}
{"game_id": "0021700551", "chunk_id": "0021700551_012", "order": 12, "role": "body", "text": "Booker made two more at the line with 6.5 seconds remaining to make it 104-101. With the Hawks needing a 3-pointer to tie it, Schroder instead drove for the layup to cut it to one, but by then there was just a half-second to play and the Suns handed Atlanta its seventh straight road loss."}
{"game_id": "0021700551", "chunk_id": "0021700551_013", "order": 13, "role": "body", "text": "\"It's tough, man,\" Bazemore said, \"any time you fight so hard and put yourself in a situation to win a game, and I question myself down the stretch.\""}
{"game_id": "0021700551", "chunk_id": "0021700551_014", "order": 14, "role": "body", "text": "Bazemore called Booker \"a great player and he was there when his team needed him.\""}
{"game_id": "0021700551", "chunk_id": "0021700551_015", "order": 15, "role": "body", "text": "As for that foul on the three-pointer, Bazemore said, \"I thought I made some really good plays down the stretch defensively and didn't get the benefit of the doubt. You control what you control.\""}
{"game_id": "0021700551", "chunk_id": "0021700551_016", "order": 16, "role": "body", "text": "Phoenix interim coach Jay Triano was not pleased with what he saw much of the night."}
{"game_id": "0021700551", "chunk_id": "0021700551_017", "order": 17, "role": "body", "text": "\"I thought we stayed in it and we gave ourselves a chance at the end, but throughout the game I did not like our energy level,\" he said. \"We were slow to the ball. ... The lineup at the end, they got into it, and we were a little bit better defensively, and as a result we gave ourselves into it.\""}
{"game_id": "0021700551", "chunk_id": "0021700551_018", "order": 18, "role": "body", "text": "Atlanta led by as many as 14 in the first half and was up 99-89 after Prince's inside basket with 2:53 to play."}
{"game_id": "0021700551", "chunk_id": "0021700551_019", "order": 19, "role": "body", "text": "\"That's a tough loss,\" Hawks coach Mike Budenholzer said. \"To have a lead and not make enough plays on both ends of the court, I think we'll learn from it. ... There are lots of mental mistakes from all of us. We all can get better.\""}
{"game_id": "0021700551", "chunk_id": "0021700551_021", "order": 21, "role": "body", "text": "Hawks: The Hawks haven't won in Phoenix since March of 2015. ... Atlanta is 3-16 on the road. ... The Hawks had won three of four. ... Prince has made a 3-pointer in 19 consecutive games. ... The Hawks have won two in a row only once this season."}
{"game_id": "0021700551", "chunk_id": "0021700551_022", "order": 22, "role": "body", "text": "Suns: First-round draft pick Josh Jackson did not play, the first time that's happened this season. ... The Suns have won four of six and six of nine. ... Booker scored 17 of Phoenix's first 30 points but didn't take a shot in a scoreless third quarter. ... The Suns are 21-4 against Atlanta at Talking Stick Resort Arena."}
{"game_id": "0021700551", "chunk_id": "0021700551_024", "order": 24, "role": "body", "text": "Hawks: At Portland on Friday night."}
{"game_id": "0021700551", "chunk_id": "0021700551_025", "order": 25, "role": "body", "text": "Suns: At Denver on Wednesday night."}
{"game_id": "0021700551", "chunk_id": "0021700551_027", "order": 27, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
