{"game_id": "0021701003", "chunk_id": "0021701003_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Russell Westbrook got the help he needed from co-stars Paul George and Carmelo Anthony."}
{"game_id": "0021701003", "chunk_id": "0021701003_002", "order": 2, "role": "body", "text": "George and Anthony each scored 21 points and Westbrook notched his 20th triple-double of the season to help the Oklahoma City Thunder beat the Sacramento Kings 106-101 on Monday night."}
{"game_id": "0021701003", "chunk_id": "0021701003_003", "order": 3, "role": "body", "text": "George and Anthony broke out of shooting slumps. George was 4 of 9 on 3-pointers and Anthony hit 5 of 7 to make the Kings pay for packing the paint."}
{"game_id": "0021701003", "chunk_id": "0021701003_004", "order": 4, "role": "body", "text": "\"I've been through it, through tough shooting nights,\" George said. \"Melo has been through tough shooting nights. That's the least of my concerns and the least of his concerns, I'm sure of it. That's all going to come. My job is just to continue to keep going. Continue to stay in attack mode. I'll get in a rhythm here eventually where I'll feel good on a nightly basis but I will continue to be aggressive out there.\""}
{"game_id": "0021701003", "chunk_id": "0021701003_005", "order": 5, "role": "body", "text": "Westbrook had 17 points, 10 rebounds and 11 assists in the 99th triple-double of his career for the Thunder, who moved into fourth place in the Western Conference standings. Oklahoma City is now a season-high 11 games above .500."}
{"game_id": "0021701003", "chunk_id": "0021701003_006", "order": 6, "role": "body", "text": "Thunder center Steven Adams left the game in the third quarter with a left hip contusion and did not return. Just two days earlier against San Antonio, he hurt his left ankle in the third quarter and did not return."}
{"game_id": "0021701003", "chunk_id": "0021701003_007", "order": 7, "role": "body", "text": "Bogdan Bogdanovic scored 19 points and Garrett Temple and Justin Jackson each added 15 for the Kings."}
{"game_id": "0021701003", "chunk_id": "0021701003_008", "order": 8, "role": "body", "text": "The Thunder held the Kings to 40.9 percent shooting overall, and 38.9 percent shooting in the fourth quarter."}
{"game_id": "0021701003", "chunk_id": "0021701003_009", "order": 9, "role": "body", "text": "\"Our defense has been huge,\" George said. \"Again, it's all a credit to our effort.\""}
{"game_id": "0021701003", "chunk_id": "0021701003_010", "order": 10, "role": "body", "text": "Oklahoma City led 46-40 at halftime. George had 14 points and Anthony 13. Temple's tip-in in the closing seconds of the third quarter gave Sacramento a 79-78 lead."}
{"game_id": "0021701003", "chunk_id": "0021701003_011", "order": 11, "role": "body", "text": "The Thunder led 88-85 in the fourth quarter when Westbrook checked back in after a brief rest. He got his 10th assist on a pass to Jerami Grant for a layup and his 10th rebound with just over 3 minutes to play. Westbrook's lob to Grant for a dunk put the Thunder up 102-92 with just under 3 minutes to play."}
{"game_id": "0021701003", "chunk_id": "0021701003_012", "order": 12, "role": "body", "text": "Sacramento cut its deficit to 104-101 on a pair of free throws by Bogdanovic with 23 seconds left, but Oklahoma City's Corey Brewer made two free throws with 17 seconds left to put it out of reach."}
{"game_id": "0021701003", "chunk_id": "0021701003_013", "order": 13, "role": "body", "text": "Westbrook made a game-winning 3-pointer against the Kings on Feb. 22. Temple said he thought the Kings did well to hang tough this time after losing at Denver the night before."}
{"game_id": "0021701003", "chunk_id": "0021701003_014", "order": 14, "role": "body", "text": "\"Coming off a back-to-back, playing against a pretty physical team, against a team who is obviously battling for a playoff spot and against a team who beat us at home in an emotional game -- it was real big for us to come in and battle the way we did defensively and offensively,\" Temple said."}
{"game_id": "0021701003", "chunk_id": "0021701003_016", "order": 16, "role": "body", "text": "Kings: Former Oklahoma star Buddy Hield came off the bench and scored three points in 15 minutes. ... The start of the second half was delayed because a wire was hanging down behind one of the backboards and needed to be taped."}
{"game_id": "0021701003", "chunk_id": "0021701003_017", "order": 17, "role": "body", "text": "Thunder: G Terrance Ferguson returned after missing Saturday's game against San Antonio while in concussion protocol. He played 11 minutes and scored three points. ... Anthony made three 3-pointers in the first three minutes of the game. ... Oklahoma City improved to 7-3 since the All-Star break. ... Brewer scored 16 points."}
{"game_id": "0021701003", "chunk_id": "0021701003_019", "order": 19, "role": "body", "text": "It was a rough shooting night for the season scoring leaders on both teams. Westbrook made just 7 of 19 shots. Zach Randolph scored 10 points on 5-for-18 shooting for the Kings."}
{"game_id": "0021701003", "chunk_id": "0021701003_021", "order": 21, "role": "body", "text": "Hield, with advice for Oklahoma star Trae Young ahead of the Sooners' NCAA Tournament opener Thursday against Rhode Island: \"Trae's got to be the player that we need to play well. Make plays for teammates, make shots and score the ball efficiently.\""}
{"game_id": "0021701003", "chunk_id": "0021701003_023", "order": 23, "role": "body", "text": "Kings: Host Miami Heat on Wednesday."}
{"game_id": "0021701003", "chunk_id": "0021701003_024", "order": 24, "role": "body", "text": "Thunder: Play at Atlanta Hawks on Tuesday."}
{"game_id": "0021701003", "chunk_id": "0021701003_026", "order": 26, "role": "body", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP"}
{"game_id": "0021701003", "chunk_id": "0021701003_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
