{"game_id": "0021400818", "chunk_id": "0021400818_001", "order": 1, "role": "lead", "text": "CHICAGO -- There is no doubt in Taj Gibson's mind the Chicago Bulls have the talent to win a title.\nThe question is: Do they have the focus?\nPau Gasol had 22 points and 14 rebounds and the Chicago Bulls beat the revamped Phoenix Suns 112-107 on Saturday night for their fifth victory in six games.\n\"The time is now,\" Gibson said. \"We've got no excuses. We have to make our adjustments now. Hopefully, tonight was one of those sparks.\"\nToo often, he said, the Bulls have been playing to their opponents' records. And that has resulted in some surprising losses.\nIn this one, they locked in at the end after it looked as if they might go down for the second time in two nights.\nJimmy Butler scored 19 points, Derrick Rose had 16, Mike Dunleavy Jr. 15, and Gibson and Aaron Brooks came on strong in the fourth quarter to finish with 12 points apiece.\n\"We're a versatile team,\" Gasol said. \"We're a flexible team that can be successful in different styles. But at the same time, we also have to understand what works best for us.\"\nP.J. Tucker led Phoenix with 20 points, and Marcus Morris had 17. Eric Bledsoe had 13 points, and so did Brandon Knight in his Suns debut, but Phoenix lost for the seventh time in eight games despite shooting over 53 percent.\n\"The game came kind of fast, just trying to recognize what the Suns are doing -- what we're doing as a group,\" said Knight, who was stunned he got dealt from Milwaukee.\nThe Suns cut it to 106-104 on Bledsoe's layup with 49.8 seconds left following a bad bounce pass by Joakim Noah to a cutting Rose that led to Tucker's steal. Gasol answered with a driving hook that bumped the lead to four.\nMarkieff Morris then made a 3 that pulled Phoenix to 108-107 with 25.9 seconds remaining. Rose hit two free throws after Marcus Morris got called for a foul with 15.5 seconds left. Following a missed pullup 3 by Bledsoe, Butler made two more foul shots and the Bulls opened a season-long seven-game homestand with the win after falling the previous night at Detroit.\nGibson scored 10 points in the fourth, Brooks had eight, and both players keyed a 10-point run early in the quarter that gave the Bulls a 91-85 lead.\nGibson hit a jumper and an alley-oop from Noah, and Brooks followed with two 3-pointers.\nFor the Suns, the loss comes on the heels of a major shakeup Thursday at the trade deadline. That was brought on by Goran Dragic insisting he would sign elsewhere in the offseason.\nPhoenix dealt Dragic and brother Zoran to Miami; Isaiah Thomas to Boston; and Tyler Ennis and Miles Plumlee to Milwaukee. Besides Knight, the Suns got Marcus Thornton from Boston. They joined the team Saturday after missing Friday night's loss at Minnesota.\n\"I was told literally right before the deadline,\" Knight said. \"I was very surprised. I can't lie to you about that. I definitely didn't think I'd be traded.\"\n---\nGIBSON HURTING\nGibson revealed he has been playing with a stage 2 ligament tear in his left hand the past four weeks. He said it is almost healed and that the time off during the All-Star break helped. Gibson also said doctors told him the pain in his left ankle that dates to an injury in last year's playoffs probably won't go away until after the season.\nTIP-INS\nSuns: Coach Jeff Hornacek said the Suns were surprised by the bad ending with Dragic, who on Wednesday told reporters that he no longer trusted management and was leaving after the season. \"When he went to All-Star break and sat with his agent or whatever he did, all of a sudden it seemed a different tone,\" Hornacek said.\nBulls: The Bulls are 1-5 when opponents shoot 50 percent or better. ... Chicago was 12 of 24 on 3-pointers, with Dunleavy and Brooks each hitting three. ... The Bulls finished with 17 turnovers -- just six in the second half -- after committing 20 the previous night. ... G Kirk Hinrich was sick and sat out the game.\nUP NEXT\nSuns: Host Boston on Monday night.\nBulls: Host Milwaukee on Monday night."}
