{"game_id": "0021201137", "chunk_id": "0021201137_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- Dwight Howard got in the way when Mike Conley drove the lane in the waning seconds, doing his delicate best to alter Conley's potential game-deciding shot without fouling."}
{"game_id": "0021201137", "chunk_id": "0021201137_002", "order": 2, "role": "body", "text": "When Conley couldn't score over Howard, the Los Angeles Lakers could exhale -- one more victory in their desperate playoff push."}
{"game_id": "0021201137", "chunk_id": "0021201137_003", "order": 3, "role": "body", "text": "Kobe Bryant had 24 points and nine assists, Pau Gasol added 19 points, and the Lakers stayed in the final playoff position in the Western Conference with an 86-84 victory over the Memphis Grizzlies on Friday night."}
{"game_id": "0021201137", "chunk_id": "0021201137_004", "order": 4, "role": "body", "text": "Howard hit a free throw with 4.1 seconds left before playing solid defense on Conley's final shot attempt, and the Lakers won their third straight in the final weeks of their push for a postseason spot. Los Angeles (40-36) barely leads Utah (40-37) -- and everybody on the Lakers' high-priced roster is aware of their situation."}
{"game_id": "0021201137", "chunk_id": "0021201137_005", "order": 5, "role": "body", "text": "\"This is the big push for us,\" Bryant said. \"We've got a very tough stretch, and we're excited. You want to be going into the playoffs feeling like you're playing good ball against tough opposition. It's been a lot of figuring out we had to do, but it's better late than never.\""}
{"game_id": "0021201137", "chunk_id": "0021201137_006", "order": 6, "role": "body", "text": "Howard had nine points and 10 rebounds, while Earl Clark and Antawn Jamison contributed 13 points apiece off the bench as the Lakers won without injured starters Steve Nash and Metta World Peace. Los Angeles also avoided getting swept in its season series with the Grizzlies, whose four-game winning streak ended."}
{"game_id": "0021201137", "chunk_id": "0021201137_007", "order": 7, "role": "body", "text": "But it wasn't over until Conley, who scored 21 points in a stellar performance, missed a potential go-ahead jumper with 5 seconds left and another layup before the buzzer. The playoff-bound Grizzlies couldn't score in the final 2 1/2 minutes, and they gave some of the credit to the Lakers' desperate defense."}
{"game_id": "0021201137", "chunk_id": "0021201137_008", "order": 8, "role": "body", "text": "\"We just didn't get a loose ball or rebound that we needed in the whole game, especially late in the fourth quarter,\" Memphis coach Lionel Hollins said."}
{"game_id": "0021201137", "chunk_id": "0021201137_009", "order": 9, "role": "body", "text": "Memphis' Marc Gasol had 11 points, eight rebounds and seven assists in a lively matchup with his brother. Zach Randolph added 15 points as the Grizzlies fell one game behind Denver for the fourth seed in the West."}
{"game_id": "0021201137", "chunk_id": "0021201137_010", "order": 10, "role": "body", "text": "Los Angeles' tumultuous season will come down to the final two weeks, with the high-powered Lakers hoping just to reach the playoffs as the eighth seed. To make the postseason for the 16th time in Bryant's 17 seasons, the Lakers must finish one game ahead of Utah, which kept pace with a 95-83 win over New Orleans earlier Friday night."}
{"game_id": "0021201137", "chunk_id": "0021201137_011", "order": 11, "role": "body", "text": "\"I don't want to be on the Laker team that didn't make the playoffs,\" said Clark, the first-year Lakers forward who had a second straight standout game. \"I don't want to be remembered that way, so I'm just coming out and giving it my all.\""}
{"game_id": "0021201137", "chunk_id": "0021201137_012", "order": 12, "role": "body", "text": "The Jazz appear to have an easier schedule down the stretch than the Lakers, who must visit the Clippers and Portland while also hosting playoff-bound San Antonio, Golden State and Houston."}
{"game_id": "0021201137", "chunk_id": "0021201137_013", "order": 13, "role": "body", "text": "Nash missed his second straight game with hamstring problems, while World Peace is out following knee surgery. Until the final seconds, Conley dominated his matchup with Nash's replacement, Steve Blake, who had six points and five turnovers."}
{"game_id": "0021201137", "chunk_id": "0021201137_014", "order": 14, "role": "body", "text": "The teams traded the lead down the stretch of a tense fourth quarter. Randolph's jumper with 2:32 left put the Grizzlies up 84-83, but Bryant fed Pau Gasol for a driving layup with 1:36 to play to put the Lakers back ahead."}
{"game_id": "0021201137", "chunk_id": "0021201137_015", "order": 15, "role": "body", "text": "After Jerryd Bayless missed an open shot, Los Angeles took roughly a full minute off the clock with an offensive rebound and another miss that went out of bounds off the Grizzlies. Bryant missed a 20-footer with 17 seconds left, but Conley missed an open jumper."}
{"game_id": "0021201137", "chunk_id": "0021201137_016", "order": 16, "role": "body", "text": "Howard grabbed a one-armed rebound while getting fouled, and the All-Star center made one of two free throws. Memphis went right back to Conley, but his twisting drive into the lane didn't produce any points or a foul."}
{"game_id": "0021201137", "chunk_id": "0021201137_017", "order": 17, "role": "body", "text": "\"We executed like we were supposed to and tried to get a shot up,\" Conley said. \"We tried to get some penetration and see what we can make out of it, but it just didn't work out.\""}
{"game_id": "0021201137", "chunk_id": "0021201137_018", "order": 18, "role": "body", "text": "Bryant sat out just 79 combined seconds of the previous two games while pushing the desperate Lakers to victories, even racking up his 19th triple-double Tuesday against Dallas. With an afternoon game against the Clippers looming Sunday, he played a mere 42:32 against the Grizzlies."}
{"game_id": "0021201137", "chunk_id": "0021201137_019", "order": 19, "role": "closing", "text": "Game notes With his first basket against Memphis, Bryant broke his sixth-place tie with Elvin Hayes in NBA history with the 10,977th field goal of his 17-season career. ... More than five years after his departure for Los Angeles, Pau Gasol is still the Grizzlies' franchise career leader in points, rebounds and blocked shots. ... Marc Gasol got a personal foul and a technical foul for arguing in the second quarter after he appeared to clip his brother in the head with an accidental elbow."}
