{"game_id": "0021701162", "chunk_id": "0021701162_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Giannis Antetokounmpo chased down the Boston Celtics' Jaylen Brown from behind and swatted what would have been a momentum-swinging layup against the backboard with 53 seconds left in a tight game."}
{"game_id": "0021701162", "chunk_id": "0021701162_002", "order": 2, "role": "body", "text": "An official first ruled goaltending. A replay review overturned the call into a blocked shot."}
{"game_id": "0021701162", "chunk_id": "0021701162_003", "order": 3, "role": "body", "text": "The Milwaukee Bucks held on for a 106-102 win on Tuesday night, getting a confidence boost against a short-handed opponent they could face in the first round of the playoffs."}
{"game_id": "0021701162", "chunk_id": "0021701162_004", "order": 4, "role": "body", "text": "\"I think we match up well with them,\" Antetokounmpo said. \"It doesn't matter really who we're going to see.\""}
{"game_id": "0021701162", "chunk_id": "0021701162_005", "order": 5, "role": "body", "text": "First, the Bucks need one more victory to clinch a second straight postseason berth. That could come as soon as Thursday against the 53-loss Brooklyn Nets."}
{"game_id": "0021701162", "chunk_id": "0021701162_006", "order": 6, "role": "body", "text": "The win on Tuesday improved Milwaukee to 42-36, clinching a winning record for a second straight season. This will be the first time that the Bucks will have back-to-back finishes over .500 since 1999-00 and 2000-01."}
{"game_id": "0021701162", "chunk_id": "0021701162_007", "order": 7, "role": "body", "text": "Miami also won on Tuesday while Washington lost, leaving the Bucks tied with those them with identical records to round out the top eight teams in the East."}
{"game_id": "0021701162", "chunk_id": "0021701162_008", "order": 8, "role": "body", "text": "Antetokounmpo finished with a game-high 29 points while Khris Middleton added 20."}
{"game_id": "0021701162", "chunk_id": "0021701162_009", "order": 9, "role": "body", "text": "Brown scored 24 points for the Celtics, who had their six-game winning streak snapped. But Boston remains the second seed and could face the Bucks next week."}
{"game_id": "0021701162", "chunk_id": "0021701162_010", "order": 10, "role": "body", "text": "Boston was forced to start two-way player Kadeem Allen with injuries sidelining yet another guard. This time, Terry Rozier didn't play because of sprained left ankle. Shane Larkin was already out because of illness. Guards Kyrie Irving and Marcus Smart have already missed extended time with injuries."}
{"game_id": "0021701162", "chunk_id": "0021701162_011", "order": 11, "role": "body", "text": "Yet the Celtics still posed a challenge deep into the fourth quarter with forwards Al Horford and Jayson Tatum, along with Brown, each assuming ball-handling duties at times."}
{"game_id": "0021701162", "chunk_id": "0021701162_012", "order": 12, "role": "body", "text": "\"It stinks that you have got to really limit your menu probably when you are not playing with anybody but Kadeem\" at point guard, coach Brad Stevens said. \"But that is part of it. Ultimately I thought our guys did a pretty good job of hanging around from an offensive perspective.\""}
{"game_id": "0021701162", "chunk_id": "0021701162_013", "order": 13, "role": "body", "text": "After Boston double-teamed Middleton and forced him to step out of bounds, Tatum bolted unchallenged down the lane to get the Celtics within 103-100 with 22 seconds left."}
{"game_id": "0021701162", "chunk_id": "0021701162_014", "order": 14, "role": "body", "text": "The Bucks used up nearly nine seconds on the ensuing inbounds play before Antetokounmpo was fouled. The All-Star forward hit free throws to seal the win."}
{"game_id": "0021701162", "chunk_id": "0021701162_015", "order": 15, "role": "body", "text": "The 6-foot-11 Antetokounmpo came up big on defense, too, with his block of Brown with 53 seconds left to keep the Bucks lead at five."}
{"game_id": "0021701162", "chunk_id": "0021701162_016", "order": 16, "role": "body", "text": "\"Tough? I've been doing it since I was a little kid, so I really didn't even think about it,\" Antetokounmpo said. \"Sometimes it can be (goaltending) and sometimes not. Thank God tonight it wasn't.\""}
{"game_id": "0021701162", "chunk_id": "0021701162_018", "order": 18, "role": "body", "text": "Celtics: Stevens said that Rozier was \"80 to 85 percent\" after shootaround earlier Tuesday. Stevens was being cautious with Rozier, with the availabilities of Irving (left knee) and Smart (right thumb) in question when the playoffs start next week."}
{"game_id": "0021701162", "chunk_id": "0021701162_019", "order": 19, "role": "body", "text": "Bucks: C Thon Maker (right groin) was available but did not play after missing four games. ... G Malcolm Brogdon appears to be inching closer to a return following a left quad injury that has kept him out since early February. He would be a valuable addition for the postseason."}
{"game_id": "0021701162", "chunk_id": "0021701162_020", "order": 20, "role": "body", "text": "\"The hard part is the rhythm and I think a lot of people will talk about the rhythm for him,\" coach Joe Prunty said about the challenge of acclimating Brogdon back into the lineup with four games left in the regular season. \"That is the balancing act though ... the fewer games, the harder it is. We will manage that as best as we can with the games that are available.\""}
{"game_id": "0021701162", "chunk_id": "0021701162_022", "order": 22, "role": "body", "text": "The sharpshooting Tatum finished with 20 points and hit a 3 just before the halftime buzzer to get Boston within 58-56. The bucket also gave Tatum his 102nd 3 of the season, a franchise rookie record."}
{"game_id": "0021701162", "chunk_id": "0021701162_023", "order": 23, "role": "body", "text": "\"Hopefully I can keep it going, push that number up. Records are meant to be broken, somebody will break it one day, Tatum said."}
{"game_id": "0021701162", "chunk_id": "0021701162_025", "order": 25, "role": "body", "text": "Another good sign for Milwaukee: runs of 11-3 and 16-4 during the game while Antetokounmpo was resting on the bench."}
{"game_id": "0021701162", "chunk_id": "0021701162_027", "order": 27, "role": "body", "text": "Celtics: Stevens wasn't sure if Rozier would be available for Boston's next game on Wednesday in Toronto."}
{"game_id": "0021701162", "chunk_id": "0021701162_028", "order": 28, "role": "body", "text": "Bucks: Host the Brooklyn Nets on Thursday."}
{"game_id": "0021701162", "chunk_id": "0021701162_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
