{"game_id": "0021700794", "chunk_id": "0021700794_001", "order": 1, "role": "lead", "text": "DENVER --  Michael Malone called Gary Harris one of the best young players in the NBA. The Denver guard then backed up his coach's praise with another strong game."}
{"game_id": "0021700794", "chunk_id": "0021700794_002", "order": 2, "role": "body", "text": "Harris scored an efficient 27 points, Nikola Jokic had 15 points and 16 rebounds, and the Nuggets beat the Charlotte Hornets 121-104 on Monday night."}
{"game_id": "0021700794", "chunk_id": "0021700794_003", "order": 3, "role": "body", "text": "Will Barton and Jamal Murray scored 18 apiece for Denver, which had seven players in double figures. Murray played 34 minutes and attempted a game-high 15 shots while playing with a bruised right thigh sustained Saturday against Golden State."}
{"game_id": "0021700794", "chunk_id": "0021700794_004", "order": 4, "role": "body", "text": "Malone said before the game Harris was one of the most consistent players on the team at both ends of the floor. The Michigan State product has gone from a fringe player as a rookie three years ago to signing an $84 million, four-year contract that kicks in next season."}
{"game_id": "0021700794", "chunk_id": "0021700794_005", "order": 5, "role": "body", "text": "\"When I got here there were questions, was Gary an NBA player?\" Malone said. \"We've rewarded him, he's a huge part of our future and a foundation, and people are starting to understand why.\""}
{"game_id": "0021700794", "chunk_id": "0021700794_006", "order": 6, "role": "body", "text": "Harris has always defended the opponent's best perimeter player, but this season his offense has jumped. He leads the team in scoring at 17.4 points per game. He went 5 of 7 on 3-pointers and finished 8 for 11 overall Monday but said he shot the ball better at the start of the season."}
{"game_id": "0021700794", "chunk_id": "0021700794_007", "order": 7, "role": "body", "text": "\"It was feeling really good to begin the season and I'm trying to get back to that,\" he said."}
{"game_id": "0021700794", "chunk_id": "0021700794_008", "order": 8, "role": "body", "text": "Harris got hot early and then the Nuggets used a big third quarter to pull away and win their third in a row. Jokic had 10 points and six rebounds in the period and Murray scored eight points in 1:03 to start a 14-6 run that gave Denver a 97-79 lead."}
{"game_id": "0021700794", "chunk_id": "0021700794_009", "order": 9, "role": "body", "text": "The bench extended the advantage to 19 midway through the fourth."}
{"game_id": "0021700794", "chunk_id": "0021700794_010", "order": 10, "role": "body", "text": "Kemba Walker led Charlotte with 20 points and Dwight Howard had 19 points and seven rebounds. The Hornets had won three straight and four of six."}
{"game_id": "0021700794", "chunk_id": "0021700794_011", "order": 11, "role": "body", "text": "Charlotte has allowed opponents to shoot better than 50 percent in five straight games. Denver hit 56.8 percent from the field."}
{"game_id": "0021700794", "chunk_id": "0021700794_012", "order": 12, "role": "body", "text": "\"In order to win in this league you have to get stops,\" Walker said. \"For us to win we have to get stops. We have to get better on that end of the floor.\""}
{"game_id": "0021700794", "chunk_id": "0021700794_013", "order": 13, "role": "body", "text": "Harris helped Denver get off to a quick start by shooting 5 of 6 on 3s in the first quarter. The Nuggets led by 14 early in the second, but the Hornets outscored them by 20 to take a 54-48 lead."}
{"game_id": "0021700794", "chunk_id": "0021700794_014", "order": 14, "role": "body", "text": "Denver closed the first half on a 15-8 run to take a one-point lead at the break and never trailed in the second half."}
{"game_id": "0021700794", "chunk_id": "0021700794_015", "order": 15, "role": "body", "text": "\"Our defensive intensity wasn't there from all of us,\" Howard said."}
{"game_id": "0021700794", "chunk_id": "0021700794_017", "order": 17, "role": "body", "text": "Hornets: Nicolas Batum had 15 points and Jeremy Lamb scored 14 off the bench. ... F Marvin Williams missed his fourth straight game with a sprained left ankle. Charlotte coach Steve Clifford said he hopes Williams will be available Thursday night in Portland. ... Walker has scored in double figures in 17 straight games and 51 of the 53 games he has played this season."}
{"game_id": "0021700794", "chunk_id": "0021700794_018", "order": 18, "role": "body", "text": "Nuggets: F Darrell Arthur (sore knee) and F Wilson Chandler (flu-like symptoms) were held out of the morning shootaround but were able to play. Chandler had two points in 21 minutes and Arthur scored 10 in 14 minutes off the bench. ... F Torrey Craig landed hard on his back after trying to block Cody Zeller's shot midway through the fourth. He stayed down for a few minutes but remained in the game."}
{"game_id": "0021700794", "chunk_id": "0021700794_020", "order": 20, "role": "body", "text": "Malone has given his players more days off recently to help them recharge and they have responded. Denver tied a season high with 18 made 3-pointers and has hit at least 10 in three straight games."}
{"game_id": "0021700794", "chunk_id": "0021700794_021", "order": 21, "role": "body", "text": "As Malone told reporters the players cite fewer practices for the improved shooting, veteran Richard Jefferson shouted, \"Yes, it's true!\""}
{"game_id": "0021700794", "chunk_id": "0021700794_023", "order": 23, "role": "body", "text": "Arthur, who has logged just 32 minutes all season, went up for a rare dunk to start the fourth quarter, bringing the Denver bench to its feet."}
{"game_id": "0021700794", "chunk_id": "0021700794_024", "order": 24, "role": "body", "text": "It was rare to see the nine-year veteran from Kansas attack the rim."}
{"game_id": "0021700794", "chunk_id": "0021700794_025", "order": 25, "role": "body", "text": "\"That was the Bud Light play of the game,\" Malone said. \"I asked the team in the locker room, `When was the last time anyone saw Darrell dunk in a game?' and Paul Millsap said, `When he was at Kansas.' It's been a while.\""}
{"game_id": "0021700794", "chunk_id": "0021700794_027", "order": 27, "role": "body", "text": "Hornets: At the Portland Trail Blazers on Thursday night."}
{"game_id": "0021700794", "chunk_id": "0021700794_028", "order": 28, "role": "body", "text": "Nuggets: At the Houston Rockets on Friday night."}
{"game_id": "0021700794", "chunk_id": "0021700794_030", "order": 30, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
