{"game_id": "0021401127", "chunk_id": "0021401127_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  The Indiana Pacers are desperate to make the playoffs. Against the Charlotte Hornets, they played desperate, too."}
{"game_id": "0021401127", "chunk_id": "0021401127_002", "order": 2, "role": "body", "text": "Rodney Stuckey scored 15 points off the bench to lead the Pacers to a 93-74 victory over the Hornets on Friday night."}
{"game_id": "0021401127", "chunk_id": "0021401127_003", "order": 3, "role": "body", "text": "C.J. Watson had 13 points and four steals, and C.J. Miles added 12 points and six rebounds for the Pacers, who snapped a two-game skid."}
{"game_id": "0021401127", "chunk_id": "0021401127_004", "order": 4, "role": "body", "text": "\"It was just a big sense of urgency,\" Miles said. \"They're a tough team, but we wanted to come out with a sense of urgency and get a good start.\""}
{"game_id": "0021401127", "chunk_id": "0021401127_005", "order": 5, "role": "body", "text": "Gerald Henderson had 12 points and seven rebounds, and Marvin Williams, Bismack Biyombo, and Lance Stephenson each finished with 10 points for the Hornets, who have lost five of their last seven games and 12 straight at Indiana."}
{"game_id": "0021401127", "chunk_id": "0021401127_006", "order": 6, "role": "body", "text": "Indiana and Charlotte are both making a push for the final spot in this year's playoffs."}
{"game_id": "0021401127", "chunk_id": "0021401127_007", "order": 7, "role": "body", "text": "\"We had a confidence against this group playing at home, understanding the ramifications of the game,\" Vogel said. \"We're just trying to stay in the fight and we executed the plan pretty well.\""}
{"game_id": "0021401127", "chunk_id": "0021401127_008", "order": 8, "role": "body", "text": "The Pacers used an 11-0 run late in the third quarter to pull away for good. Stuckey made a 3-pointer and Ian Mahinmi had a basket to give Indiana a 70-47 lead with under a minute remaining in the third."}
{"game_id": "0021401127", "chunk_id": "0021401127_009", "order": 9, "role": "body", "text": "Indiana has struggled since going on a season-best seven-game winning streak at the end of February and the first part of March -- a stretch that gave the Pacers high hopes for a spot in the playoffs later this month."}
{"game_id": "0021401127", "chunk_id": "0021401127_010", "order": 10, "role": "body", "text": "Since then, the Pacers have dropped nine of 11 before Indiana's third win over the Hornets this season."}
{"game_id": "0021401127", "chunk_id": "0021401127_011", "order": 11, "role": "body", "text": "Against Charlotte, the Pacers looked like they had it figured out. After giving up 100 or more points in eight of the previous 10 games, Indiana gave up its fewest points of the season. Now the Pacers are a spot closer to landing in the postseason and hold the tiebreaker over the Hornets, who slip to No. 11 in the Eastern Conference."}
{"game_id": "0021401127", "chunk_id": "0021401127_012", "order": 12, "role": "body", "text": "\"We didn't put up a good effort at all,\" Henderson said. \"We are in a tough playoff push right now and that's not really the type of effort you can give if you want to make the playoffs.\""}
{"game_id": "0021401127", "chunk_id": "0021401127_013", "order": 13, "role": "body", "text": "Henderson scored to give the Hornets a 28-23 lead early in the second quarter. Then, the Pacers outscored the Hornets 26-10 to close out the half."}
{"game_id": "0021401127", "chunk_id": "0021401127_014", "order": 14, "role": "body", "text": "The Pacers used an 11-0 spurt midway through the quarter to take a lead and pull away."}
{"game_id": "0021401127", "chunk_id": "0021401127_015", "order": 15, "role": "body", "text": "Watson scored the go ahead layup to put Indiana ahead 34-33 and, later, Miles made a pair of free throws to give the Pacers a 43-33 lead with 4:03 left in the first half."}
{"game_id": "0021401127", "chunk_id": "0021401127_016", "order": 16, "role": "body", "text": "The Pacers led by as much as 12 in the first half when Lavoy Allen scored a put-back basket to make it 47-35."}
{"game_id": "0021401127", "chunk_id": "0021401127_018", "order": 18, "role": "body", "text": "Hornets: Charlotte's nine points in the third quarter matched its season low for points scored in a quarter."}
{"game_id": "0021401127", "chunk_id": "0021401127_019", "order": 19, "role": "body", "text": "Pacers: The win was Vogel's 200th as a head coach. Vogel, in his fifth season at Indiana, has the most coaching wins in Pacers NBA franchise history."}
{"game_id": "0021401127", "chunk_id": "0021401127_021", "order": 21, "role": "body", "text": "Stephenson, who was with the Pacers the last four seasons, didn't receive a warm welcome back. He entered the game for the first time late in the third quarter and was booed by fans every time he touched the ball. Stephenson wasn't the only Hornets player returning to Indiana. Center Cody Zeller was a standout at Indiana University before he was drafted by Charlotte. Zeller was inactive for the eighth straight game with right shoulder soreness."}
{"game_id": "0021401127", "chunk_id": "0021401127_023", "order": 23, "role": "body", "text": "Former Indianapolis Colts wide receiver Reggie Wayne received a standing ovation when he was shown on the jumbo screen during a timeout. Fans chanted \"Reg-gie, Reg-gie\" as a \"thank you\" message was displayed on the screen. Wayne played 14 seasons for the Colts before the team announced they wouldn't resign him this offseason."}
{"game_id": "0021401127", "chunk_id": "0021401127_025", "order": 25, "role": "body", "text": "Hornets: Host Philadelphia on Saturday."}
