{"game_id": "0021700457", "chunk_id": "0021700457_001", "order": 1, "role": "lead", "text": "NEW YORK --  For a guy who doesn't jump very high, Zach Randolph sure has climbed up the rebounding list."}
{"game_id": "0021700457", "chunk_id": "0021700457_002", "order": 2, "role": "body", "text": "Randolph became the 20th player in NBA history with 18,000 points and 10,000 rebounds, helping the Sacramento Kings to a 104-99 victory over the Brooklyn Nets on Wednesday night."}
{"game_id": "0021700457", "chunk_id": "0021700457_003", "order": 3, "role": "body", "text": "At 6-foot-9 and 250 pounds, Randolph has never been a high flyer. But he hasn't needed to be during a 17-year career in which he's averaged 10.6 rebounds per game."}
{"game_id": "0021700457", "chunk_id": "0021700457_004", "order": 4, "role": "body", "text": "\"I tell the young guys, it's not about who jumps the highest and how strong you are,\" Randolph said. \"Rebounding's about positioning and having a knack for the ball and reading where the ball will come off, having a sense where the ball is going to bounce to. It's about a combination of things, it ain't just about athletic ability or just jumping up and down.\""}
{"game_id": "0021700457", "chunk_id": "0021700457_005", "order": 5, "role": "body", "text": "George Hill scored 22 points to lead the Kings in their first back-to-back sweep of the season. Randolph added 21 points and eight rebounds."}
{"game_id": "0021700457", "chunk_id": "0021700457_006", "order": 6, "role": "body", "text": "The Kings got off to a sizzling start following their victory in Philadelphia a night earlier, then held on after Brooklyn cut a 21-point lead to two with just over a minute to play."}
{"game_id": "0021700457", "chunk_id": "0021700457_007", "order": 7, "role": "body", "text": "The Nets missed a flurry of chances to tie before Hill finished it off with two free throws with 2.8 seconds remaining."}
{"game_id": "0021700457", "chunk_id": "0021700457_008", "order": 8, "role": "body", "text": "The Kings had been 0-5 this season on the second night of a back-to-back."}
{"game_id": "0021700457", "chunk_id": "0021700457_009", "order": 9, "role": "body", "text": "\"We're getting better,\" coach Dave Joerger said. \"Just each guy learning the nuances of the game.\""}
{"game_id": "0021700457", "chunk_id": "0021700457_010", "order": 10, "role": "body", "text": "Spencer Dinwiddie scored 16 points but was among the many Nets with poor-shooting nights. Brooklyn shot under 40 percent from the field in its fourth straight loss."}
{"game_id": "0021700457", "chunk_id": "0021700457_011", "order": 11, "role": "body", "text": "\"You know we've got to make shots, we can't turn the ball over, etcetera, etcetera,\" Dinwiddie said. \"But at the same time, if we play basketball the way we're supposed to like we did in the second half and they don't score 64 points in the first half, we're not in that situation.\""}
{"game_id": "0021700457", "chunk_id": "0021700457_012", "order": 12, "role": "body", "text": "Nets coach Kenny Atkinson said before the game his team needed to start better, but Brooklyn couldn't have done much worse. Sacramento made 16 of 21 shots and raced to a 36-20 lead after one quarter, which grew to 44-23 on Skal Labissiere's three-point play early in the second."}
{"game_id": "0021700457", "chunk_id": "0021700457_013", "order": 13, "role": "body", "text": "The lead was still 16 at halftime before the Nets finally got into the game, getting as close as 101-99 on Dinwiddie's three-point play with 1:10 left."}
{"game_id": "0021700457", "chunk_id": "0021700457_015", "order": 15, "role": "body", "text": "Kings: Rookie G De'Aaron Fox didn't play because of a bruised right thigh. ... Reserve G Buddy Hield missed his first six shots and three in row were blocked before he made a jumper in the fourth quarter."}
{"game_id": "0021700457", "chunk_id": "0021700457_016", "order": 16, "role": "body", "text": "Nets: Brooklyn has dropped two straight at home to Sacramento after winning the first four meetings at Barclays Center. ... Rondae Hollis-Jefferson finished with 14 points and 10 rebounds."}
{"game_id": "0021700457", "chunk_id": "0021700457_018", "order": 18, "role": "body", "text": "Randolph joined Pau Gasol and Dirk Nowitzki as the only active players with 18,000 points and 10,000 rebounds. Overall, he is the 39th player with 10,000 boards."}
{"game_id": "0021700457", "chunk_id": "0021700457_019", "order": 19, "role": "body", "text": "\"It felt good because I always dedicated myself, always thought I was one of the best rebounders in the league,\" Randolph said. \"So I really am proud about that. It's a blessing.\""}
{"game_id": "0021700457", "chunk_id": "0021700457_021", "order": 21, "role": "body", "text": "Jahlil Okafor sat out for the second straight game after making his lone appearance for the Nets since they acquired him from Philadelphia. He has not played in the other four games as the Nets try to get him into basketball shape after he was largely inactive with the 76ers."}
{"game_id": "0021700457", "chunk_id": "0021700457_022", "order": 22, "role": "body", "text": "\"He was not playing. You can do as much off-court stuff as you want and run lines and get on the treadmill, but basketball shape, basketball rhythm is a little different,\" Atkinson said. \"So we're working toward getting him up to speed there. He's working his tail off with the coaches and our performance team.\""}
{"game_id": "0021700457", "chunk_id": "0021700457_024", "order": 24, "role": "body", "text": "Kings: Host the San Antonio Spurs on Saturday."}
{"game_id": "0021700457", "chunk_id": "0021700457_025", "order": 25, "role": "body", "text": "Nets: Host the Washington Wizards on Friday."}
{"game_id": "0021700457", "chunk_id": "0021700457_027", "order": 27, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
