{"game_id": "0021300700", "chunk_id": "0021300700_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  With owner Tom Gores seated courtside, the Detroit Pistons looked at least somewhat like a team that could be tough to play against during the second half of the season."}
{"game_id": "0021300700", "chunk_id": "0021300700_002", "order": 2, "role": "body", "text": "Of course, they were facing the short-handed Philadelphia 76ers."}
{"game_id": "0021300700", "chunk_id": "0021300700_003", "order": 3, "role": "body", "text": "Andre Drummond had 22 points and 14 rebounds, and Detroit overwhelmed Philadelphia 113-96 Saturday night. Greg Monroe added 21 points and 12 rebounds. He and Drummond combined to go 18 of 21 from the field."}
{"game_id": "0021300700", "chunk_id": "0021300700_004", "order": 4, "role": "body", "text": "\"I would say that we're better than our record,\" said Gores, the California-based owner who has been at a handful of Detroit's home games this season. \"My focus right now is how to get this team to the next level.\""}
{"game_id": "0021300700", "chunk_id": "0021300700_005", "order": 5, "role": "body", "text": "The Pistons have won back-to-back games at The Palace for the first time since their first two home games of the season. Detroit is 9-15 at home and 19-27 overall."}
{"game_id": "0021300700", "chunk_id": "0021300700_006", "order": 6, "role": "body", "text": "Philadelphia was without rookie of the year candidate Michael Carter-Williams, who sat out with a sore right shoulder."}
{"game_id": "0021300700", "chunk_id": "0021300700_007", "order": 7, "role": "body", "text": "\"We decided to give him some time off and he needed it,\" 76ers coach Brett Brown said. \"Day to day is a fair assessment.\""}
{"game_id": "0021300700", "chunk_id": "0021300700_008", "order": 8, "role": "body", "text": "Tony Wroten led the 76ers with 18 points."}
{"game_id": "0021300700", "chunk_id": "0021300700_009", "order": 9, "role": "body", "text": "Brandon Jennings and Kyle Singler added 20 points apiece for Detroit."}
{"game_id": "0021300700", "chunk_id": "0021300700_010", "order": 10, "role": "body", "text": "The Pistons signed Josh Smith and traded for Jennings in the offseason, but with the team still struggling, there's been talk that another move could be coming. Monroe has been at the center of that speculation, since Detroit has a logjam of frontcourt players -- but he and Drummond were both outstanding Saturday, and Smith added nine points, nine rebounds, seven assists and four steals."}
{"game_id": "0021300700", "chunk_id": "0021300700_011", "order": 11, "role": "body", "text": "Gores indicated that the upcoming trade deadline is not a major focus -- or at least, it's no more important than a number of other aspects of team management."}
{"game_id": "0021300700", "chunk_id": "0021300700_012", "order": 12, "role": "body", "text": "\"We aren't focused on the deadline or anything like that. We are looking at getting the guys better,\" Gores said. \"We're doing a lot of homework, but our main job is to make sure our players are at their maximum.\""}
{"game_id": "0021300700", "chunk_id": "0021300700_013", "order": 13, "role": "body", "text": "Monroe and Drummond went a combined 9 for 9 in the first quarter, and Detroit led 32-22 after one thanks to that inside presence."}
{"game_id": "0021300700", "chunk_id": "0021300700_014", "order": 14, "role": "body", "text": "\"That was something that I think just happened in the flow of the game -- it's not something that we really talked about,\" Monroe said. \"Once it worked a few times, we kept going back to it.\""}
{"game_id": "0021300700", "chunk_id": "0021300700_015", "order": 15, "role": "body", "text": "Late in the second, Philadelphia's Evan Turner drew a foul on rookie Kentavious Caldwell-Pope, and Turner appeared to flip the ball back at a group of players under the basket. Jennings responded by throwing the ball at Turner, and both he and the Philadelphia forward were hit with technical fouls."}
{"game_id": "0021300700", "chunk_id": "0021300700_016", "order": 16, "role": "body", "text": "\"I lost my balance and as I was trying to catch the ball, I guess I hit him in the face with the ball,\" Turner said. \"It wasn't intentional. It was an unfortunate mistake.\""}
{"game_id": "0021300700", "chunk_id": "0021300700_017", "order": 17, "role": "body", "text": "The Pistons led 57-49 at halftime, and they broke the game open with a 16-2 run in the third quarter. Singler and Caldwell-Pope made back-to-back 3-pointers to make it 74-56, and another 3 by Singler capped the run and gave Detroit a 23-point lead."}
{"game_id": "0021300700", "chunk_id": "0021300700_018", "order": 18, "role": "body", "text": "\"I think we're still attacking, instead of trying to keep the lead and playing conservatively,\" Detroit guard Will Bynum said. \"I think we were attacking in the fourth quarter until we pretty much got the win.\""}
{"game_id": "0021300700", "chunk_id": "0021300700_019", "order": 19, "role": "body", "text": "The Pistons led by as many as 28. Drummond finished 10 of 11 from the field, and Monroe was 8 of 10."}
{"game_id": "0021300700", "chunk_id": "0021300700_020", "order": 20, "role": "body", "text": "Detroit was coming off a three-day layoff because its game at Atlanta on Wednesday was postponed because of bad weather in Georgia."}
{"game_id": "0021300700", "chunk_id": "0021300700_021", "order": 21, "role": "body", "text": "Singler had 10 rebounds, giving the Pistons three players with at least 20 points and 10 rebounds for the first time since Dec. 3, 1997. Grant Hill, Bison Dele and Lindsey Hunter all did it in that triple-overtime win over Phoenix."}
{"game_id": "0021300700", "chunk_id": "0021300700_022", "order": 22, "role": "closing", "text": "Game notes The Pistons had 22 offensive rebounds and outrebounded the 76ers 57-44 overall. ... Philadelphia had 64 points in the paint to Detroit's 60. They entered as the top two teams in the NBA in that department. ... The Pistons are 3-0 against the 76ers this season. ... Philadelphia is 3-22 when held under 100 points."}
