{"game_id": "0021400869", "chunk_id": "0021400869_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- After the Portland Trail Blazers overcame Russell Westbrook's third straight triple-double, Damian Lillard sensed his team was recapturing its form of earlier this season.\nOklahoma City can only hope it didn't lose Westbrook along with the game.\nLillard and LaMarcus Aldridge each scored 29 points, and Portland rallied to beat the Oklahoma City Thunder 115-112 on Friday night. Aldridge added 16 rebounds."}
{"game_id": "0021400869", "chunk_id": "0021400869_002", "order": 2, "role": "body", "text": "Westbrook, who fell and was hit in the face by the knee of onrushing teammate Andre Roberson in the final seconds, had 40 points, 13 rebounds and 11 assists. He became the first player to string together three triple-doubles since LeBron James in 2009.\nWestbrook, who had a noticeable imprint on his right cheek, did not speak to reporters following the game and was taken to a Portland-area medical facility for further evaluation. There was no immediate word on his condition.\n\"I think it was one of those games where we turned back into ourselves and late in the game we found a way to get stops. We made plays, made shots and we stayed the course over kind of a rough game,\" Lillard said.\nThe Blazers overcame a 15-point, third-quarter deficit and tied it on a tip shot by Aldridge with 4:33 to go.\nRookie Mitch McGary came off the bench for a season-high 20 points -- 12 in the third quarter alone -- for the Thunder.\nPortland took the lead with 3:56 left on Arron Afflalo's 3-pointer. Aldridge and Westbrook traded baskets down the stretch before Aldridge made a free throw to put Portland up 111-110 with 44 seconds to go.\nAfflalo's free throws made it 113-110, and Wesley Matthews' attempt to intentionally foul Westbrook was ruled a shooting foul on a 3-pointer. Westbrook missed the first, and Lillard made free throws with 1.4 seconds left for the final margin.\nThe Blazers, who earlier in the season led the Western Conference, are 9-2 at the Moda Center this season in games in which they've trailed in the third quarter.\nWestbrook was hit in the face in the scramble following his free throws.\n\"The guy has the heart of a champion,\" coach Scott Brooks said. \"He comes out every night. There are no excuses ever. He plays the game with everything he has.\"\nThe Thunder were coming off a 117-113 overtime loss the night before in Phoenix, snapping their seven-game winning streak. Westbrook had 39 points, 14 rebounds and 11 assists, and rolled his ankle late in that game."}
{"game_id": "0021400869", "chunk_id": "0021400869_003", "order": 3, "role": "closing", "text": "The Thunder were playing without Kevin Durant and Enes Kanter because of injuries. Brooks wasn't certain how long Kanter will be out, saying he believed the injury occurred in the second half of the loss to the Suns.\nWestbrook's facial injury, if serious, would be a devastating blow.\nTrailing the Thunder 59-47 at the break, the Blazers opened the second half with a 7-0 run to close within 59-54. Oklahoma City answered with a 10-0 run capped by Serge Ibaka's dunk to go up 69-54 and led 89-78 going into the final quarter.\n\"We never believe that we're out of it,\" Aldridge said. \"We understand that if we turn up our defense and we play at a different level that we're capable, anything is possible.\"\nTIP-INS\nThunder: Kyle Singler grew up in Medford, Oregon. He was on the South Medford High School team that won the 2007 state championship game against Lake Oswego High School and star Kevin Love.\nTrail Blazers: It was Portland center Meyers Leonard's 23rd birthday. ... Former Oregon Ducks quarterback Joey Harrington wore a Jerome Kersey jersey. Kersey died last week at age 52.\nWESTBROOK WOWS\nWestbrook entered the game averaging 30.4 points, 8.7 rebounds and 10.2 assists in February -- garnering him increasing MVP buzz.\n\"He's been doing that for years -- but obviously he's taking it to another level in February,\" said Brooks, who called Westbrook a \"walking triple-double.\"\nAFFLALO'S IMPACT\nThe Blazers acquired Afflalo at the trade deadline from Denver to do just what he did Friday night. Afflalo finished with 18 points, including 11 in the final quarter. His total was the most by a Blazers reserve this season.\n\"In games like this, you just play, you just play and let your basketball instincts kick in,\" he said afterward.\nUP NEXT\nThunder: Visit the Los Angeles Lakers on Sunday.\nTrail Blazers: Visit Sacramento on Sunday.\nThe Associated Press contributed to this report."}
