{"game_id": "0021700393", "chunk_id": "0021700393_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Goran Dragic and the Miami Heat got into a groove in the second half."}
{"game_id": "0021700393", "chunk_id": "0021700393_003", "order": 3, "role": "body", "text": "Dragic scored 19 points, and the Heat pulled away from the Memphis Grizzlies for a 107-82 victory on Monday night."}
{"game_id": "0021700393", "chunk_id": "0021700393_004", "order": 4, "role": "body", "text": "Miami had seven players score in double figures in its second straight win. Josh Richardson had 17 points, and reserves Tyler Johnson and Bam Adebayo finished with 14 apiece."}
{"game_id": "0021700393", "chunk_id": "0021700393_005", "order": 5, "role": "body", "text": "The Heat shot 65 percent from the field while outscoring the Grizzlies 62-40 in the second half. They went 11 for 14 in the final period."}
{"game_id": "0021700393", "chunk_id": "0021700393_006", "order": 6, "role": "body", "text": "\"In the past, we've had trouble in third quarters,\" Dragic said. \"But now, we are figuring things out. As long as we continue to play like that, we're going to win a lot of games.\""}
{"game_id": "0021700393", "chunk_id": "0021700393_007", "order": 7, "role": "body", "text": "Memphis lost for the 15th time in 16 games. Marc Gasol scored 19 points on 5-for-14 shooting and Andrew Harrison had 16."}
{"game_id": "0021700393", "chunk_id": "0021700393_008", "order": 8, "role": "body", "text": "\"We've got to find solutions somehow,\" Gasol said, adding that the tough defense that was part of Memphis' reputation for years is not part of the team's mentality. \"We always had a mindset here where we can have a tough night offensively, but if we don't score, you don't score.\""}
{"game_id": "0021700393", "chunk_id": "0021700393_009", "order": 9, "role": "body", "text": "That certainly wasn't the case Monday night."}
{"game_id": "0021700393", "chunk_id": "0021700393_010", "order": 10, "role": "body", "text": "The Heat carried a 70-60 lead into the fourth quarter and kept up the pressure in the final period. Johnson scored five straight points to run the advantage out to 18, and the lead ballooned to 27 in the closing minute."}
{"game_id": "0021700393", "chunk_id": "0021700393_011", "order": 11, "role": "body", "text": "\"The effort wasn't there,\" Memphis interim coach J.B. Bickerstaff said. \"To a man, the responsibility that we have to our teammates, to the organization, to the fans, we didn't give the fans what they deserve. We didn't give the organization what they deserve, and, we didn't give one another what we deserve.\""}
{"game_id": "0021700393", "chunk_id": "0021700393_013", "order": 13, "role": "body", "text": "Heat: C Hassan Whiteside missed his sixth straight game with a left knee injury. ... Miami did not register a second-chance point and grabbed only two offensive rebounds. ... Miami's 56.1 percent shooting for the game was a season high for a Memphis opponent. ... Richardson was 3 of 4 from outside the arc."}
{"game_id": "0021700393", "chunk_id": "0021700393_014", "order": 14, "role": "body", "text": "Grizzlies: G Tyreke Evans had 11 points on 5-for-17 shooting in his 500th career game. ... Memphis is winless in nine games against the Eastern Conference. ... Memphis went 18 for 27 at the free-throw line. ... Memphis is 1-14 since starting PG Mike Conley was shelved by left Achilles problems. ... Harrison's 16 points were a season high."}
{"game_id": "0021700393", "chunk_id": "0021700393_016", "order": 16, "role": "body", "text": "It was Miami's first trip to FedExForum since Memphis fired former Heat assistant David Fizdale as head coach last month. Miami coach Erik Spoelstra said he had lunch with his former assistant earlier in the day."}
{"game_id": "0021700393", "chunk_id": "0021700393_017", "order": 17, "role": "body", "text": "\"I still feel for Fizz, and what he, unfortunately, had to go through here. That's my brother, and you want him to have a fair shot at it,\" Spoelstra said, adding: \"He's going to get another opportunity.\""}
{"game_id": "0021700393", "chunk_id": "0021700393_019", "order": 19, "role": "body", "text": "When Miami center Kelly Olynyk got into foul trouble, Adebayo stepped up. Adebayo, a rookie out of Kentucky, was 5 for 6 from the field and also contributed four rebounds and two blocked shots."}
{"game_id": "0021700393", "chunk_id": "0021700393_020", "order": 20, "role": "body", "text": "\"He really used his technique, energy, multiple efforts and mental stability to be in a lot of places that were pretty disruptive,\" Spoelstra said."}
{"game_id": "0021700393", "chunk_id": "0021700393_021", "order": 21, "role": "body", "text": "Olynyk added: \"There's plays in practice all the time where you're like: `Man, this guy's a freak. Where did that even come from?' And he's starting to string more of those plays together every day.\""}
{"game_id": "0021700393", "chunk_id": "0021700393_023", "order": 23, "role": "body", "text": "Regarding the Grizzlies talking with each other about the overall problems, Gasol said: \"I don't think talk does much. It's doing. I always believe that talk is great, and we're going to say the right things, and we can sit down and sing `Kumbaya,' but it's more about grabbing it and taking ownership of the things we have to do.\""}
{"game_id": "0021700393", "chunk_id": "0021700393_025", "order": 25, "role": "body", "text": "Heat: Host Portland on Wednesday night."}
{"game_id": "0021700393", "chunk_id": "0021700393_026", "order": 26, "role": "body", "text": "Grizzlies: Visit Washington on Wednesday night."}
{"game_id": "0021700393", "chunk_id": "0021700393_028", "order": 28, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
