{"game_id": "0021400349", "chunk_id": "0021400349_001", "order": 1, "role": "lead", "text": "MIAMI --  Derrick Rose was fouled on a fast break, staggered off the court and kept going out a tunnel."}
{"game_id": "0021400349", "chunk_id": "0021400349_002", "order": 2, "role": "body", "text": "He came back unhurt, but the Chicago Bulls hardly needed him."}
{"game_id": "0021400349", "chunk_id": "0021400349_003", "order": 3, "role": "body", "text": "Mike Dunleavy led a balanced attack with 22 points and the Bulls overcame a sloppy start Sunday to beat the offensively challenged Miami Heat, 93-75."}
{"game_id": "0021400349", "chunk_id": "0021400349_004", "order": 4, "role": "body", "text": "The Bulls had their lowest-scoring game since Nov. 21 and still won easily, building a 26-point lead in the second half. Dunleavy said the makeup of the team lends itself to scoring consistency."}
{"game_id": "0021400349", "chunk_id": "0021400349_005", "order": 5, "role": "body", "text": "\"With what we have, there shouldn't be many nights where we struggle offensively,\" he said. \"If the outside shots aren't going, we have many ways to get inside, and we can push the ball. We've got a lot of options.\""}
{"game_id": "0021400349", "chunk_id": "0021400349_006", "order": 6, "role": "body", "text": "Jimmy Butler had 17 points, Taj Gibson 15 and Rose 14 for the Central Division-leading Bulls. They improved to 11-3 on the road, best in the Eastern Conference."}
{"game_id": "0021400349", "chunk_id": "0021400349_007", "order": 7, "role": "body", "text": "Miami leading scorer Chris Bosh (calf strain) missed a game for the first time this season, which left the Heat without enough punch or size to challenge Chicago. Miami shot a season-low 35 percent, including 4 for 22 from 3-point range."}
{"game_id": "0021400349", "chunk_id": "0021400349_008", "order": 8, "role": "body", "text": "\"A guy like Chris is irreplaceable,\" said Dwyane Wade, who had 17 points for Miami. \"All we ask for and hope for is he can get back as soon as he can when he's healthy.\""}
{"game_id": "0021400349", "chunk_id": "0021400349_009", "order": 9, "role": "body", "text": "The Heat's point total matched their season low."}
{"game_id": "0021400349", "chunk_id": "0021400349_010", "order": 10, "role": "body", "text": "Chicago pulled away in the third quarter thanks to Dunleavy. He was shut out in the first half but scored 19 points on eight shots in the third period, when Chicago outscored Miami 33-16."}
{"game_id": "0021400349", "chunk_id": "0021400349_011", "order": 11, "role": "body", "text": "Dunleavy finished 4 for 5 from 3-point range, while the Bulls shot 9 of 18 beyond the arc and 47 overall."}
{"game_id": "0021400349", "chunk_id": "0021400349_012", "order": 12, "role": "body", "text": "The teams slogged through an ugly first half in their first matchup this season. The Bulls committed 13 turnovers but led 39-32 because Miami shot only 29 percent."}
{"game_id": "0021400349", "chunk_id": "0021400349_013", "order": 13, "role": "body", "text": "\"It was your typical Sunday in Miami,\" Dunleavy said with a smile. \"It seems like everybody had a big Saturday night.\""}
{"game_id": "0021400349", "chunk_id": "0021400349_016", "order": 16, "role": "body", "text": "Heat: Bosh sat out with a slight strain in his left calf that began to bother him more before the game. No MRI is planned."}
{"game_id": "0021400349", "chunk_id": "0021400349_017", "order": 17, "role": "body", "text": "\"It's a day-by-day thing so far,\" Bosh said. \"I had some soreness there that really didn't let up, and it progressed over a day or so.\""}
{"game_id": "0021400349", "chunk_id": "0021400349_018", "order": 18, "role": "body", "text": "Forward Josh McRoberts missed his third game in a row because of a right knee bruise. Chris Andersen played 18 minutes after missing the previous nine games with a sprained right ankle."}
{"game_id": "0021400349", "chunk_id": "0021400349_019", "order": 19, "role": "body", "text": "Bulls: Rookie forward Doug McDermott is expected to be sidelined another four to six weeks after undergoing arthroscopic surgery Saturday on a right knee injury that has sidelined him all month. Joakim Noah missed his third straight game because of a sprained right ankle."}
{"game_id": "0021400349", "chunk_id": "0021400349_021", "order": 21, "role": "body", "text": "Dunleavy's third-quarter stats: 7 for 8 from the field, 3 for 3 from 3-point range and 2 for 2 from the free-throw line."}
{"game_id": "0021400349", "chunk_id": "0021400349_022", "order": 22, "role": "body", "text": "\"When you hit that zone, you let it fly and you know it's going in,\" he said. \"It's a great feeling to have.\""}
{"game_id": "0021400349", "chunk_id": "0021400349_024", "order": 24, "role": "body", "text": "Rose was limited to 27 minutes because of early foul trouble, but he scored 11 points in the fourth quarter to stymie any comeback bid by the Heat."}
{"game_id": "0021400349", "chunk_id": "0021400349_025", "order": 25, "role": "body", "text": "\"He sensed what we needed and knocked down a couple of huge shots for us,\" coach Tom Thibodeau said."}
{"game_id": "0021400349", "chunk_id": "0021400349_026", "order": 26, "role": "body", "text": "Rose said he tried not to think about the Bulls' fat lead."}
{"game_id": "0021400349", "chunk_id": "0021400349_027", "order": 27, "role": "body", "text": "\"No matter what the score is, I still have to be myself in the fourth quarter,\" Rose said. \"Tibs is always telling me I should always be more aggressive in the fourth.\""}
{"game_id": "0021400349", "chunk_id": "0021400349_029", "order": 29, "role": "body", "text": "Bulls: At Atlanta on Monday. The Bulls have won six in a row against the Hawks."}
