{"game_id": "0021700960", "chunk_id": "0021700960_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  The Rockets are still rolling."}
{"game_id": "0021700960", "chunk_id": "0021700960_002", "order": 2, "role": "body", "text": "Chris Paul scored 25 points, James Harden had 23 points and 11 assists, and Houston beat the Oklahoma City Thunder 122-112 on Tuesday night for its 16th straight victory."}
{"game_id": "0021700960", "chunk_id": "0021700960_003", "order": 3, "role": "body", "text": "The Rockets matched Boston for the longest win streak in the league this season and are on the second-longest win streak in franchise history. Harden was blunt when asked what those things meant to him."}
{"game_id": "0021700960", "chunk_id": "0021700960_004", "order": 4, "role": "body", "text": "\"Nothing,\" he said. \"Nothing at all. We just want to play well. We want to play well and have each other's back, no matter what, on both ends of the floor. It doesn't matter. Wins and losses will come.\""}
{"game_id": "0021700960", "chunk_id": "0021700960_005", "order": 5, "role": "body", "text": "Trevor Ariza scored 15 points and Eric Gordon added 14 for the Rockets."}
{"game_id": "0021700960", "chunk_id": "0021700960_006", "order": 6, "role": "body", "text": "Russell Westbrook scored 32 points and Carmelo Anthony added 23 for Oklahoma City, which is in a logjam of teams trying to fight their way into third place in the West."}
{"game_id": "0021700960", "chunk_id": "0021700960_007", "order": 7, "role": "body", "text": "Oklahoma City had beaten several of the league's top teams this season. The Thunder have two wins over Golden State, a victory over Toronto and a win over Cleveland this season. The Rockets avoided that fate by going 17 of 33 on 3-pointers and 29 of 34 on free throws."}
{"game_id": "0021700960", "chunk_id": "0021700960_008", "order": 8, "role": "body", "text": "\"We're so good offensively that every single night, teams are going to throw different coverages at us,\" Harden said. \"We've just got to figure out ways to attack them. Tonight was no different. Once we found something that we could go to, we used it. Guys got open shots and we just ride that wave out the entire game.\""}
{"game_id": "0021700960", "chunk_id": "0021700960_009", "order": 9, "role": "body", "text": "The Rockets led 54-45 at halftime as Harden posted 13 points, seven assists and five rebounds. Anthony had 19 points for the Thunder and Westbrook had 14, but All-Star Paul George went 1 for 7 from the field before the break."}
{"game_id": "0021700960", "chunk_id": "0021700960_010", "order": 10, "role": "body", "text": "The Thunder closed the gap to three in the opening minutes of the third quarter, but the Rockets dominated the rest of the way and led 87-74 at the end of the period. Houston made 7 of 10 3-pointers in the quarter."}
{"game_id": "0021700960", "chunk_id": "0021700960_011", "order": 11, "role": "body", "text": "\"You just have to keep playing,\" Thunder guard Corey Brewer said. \"They are going to make shots. You can't get down. You can't let their shot-making affect your game. I think tonight we got a little bit down when they made tough shots but that's what they do.\""}
{"game_id": "0021700960", "chunk_id": "0021700960_012", "order": 12, "role": "body", "text": "Houston extended its lead to 19 midway through the fourth quarter."}
{"game_id": "0021700960", "chunk_id": "0021700960_013", "order": 13, "role": "body", "text": "\"When a team like that is making 3s, it's tough out there because you're always in a scramble situation,\" Anthony said. \"But you know, those guys beat us tonight, and we have to accept that and move on and learn from it.\""}
{"game_id": "0021700960", "chunk_id": "0021700960_015", "order": 15, "role": "body", "text": "Rockets: Forced eight turnovers in the first quarter. ... Improved to 33-1 when Harden, Paul and Clint Capela all play in the same game. ... Lost to the Thunder on Christmas Day while Paul sat out with a groin strain."}
{"game_id": "0021700960", "chunk_id": "0021700960_016", "order": 16, "role": "body", "text": "Thunder: Anthony passed Jerry West to move into 20th in NBA history in scoring. ... Anthony returned after resting during Saturday's game at Portland."}
{"game_id": "0021700960", "chunk_id": "0021700960_018", "order": 18, "role": "body", "text": "Houston hasn't lost since Jan. 26 at New Orleans. The Rockets' last home loss was Jan. 4 against Golden State."}
{"game_id": "0021700960", "chunk_id": "0021700960_020", "order": 20, "role": "body", "text": "Ariza, on the Rockets getting open shots: \"We know our roles. We know what we have to do. We know we need to keep the floor spaced. When the floor is spaced, it's like reading a little A-B-C book.\""}
{"game_id": "0021700960", "chunk_id": "0021700960_022", "order": 22, "role": "body", "text": "Brewer made his Thunder home debut. The former Rocket finished with 10 points in just over 23 minutes. The guard played his first game with the Oklahoma City last Saturday in Portland."}
{"game_id": "0021700960", "chunk_id": "0021700960_023", "order": 23, "role": "body", "text": "\"It's only my second game and I've only had one practice, so you know it's only going to get better,\" he said."}
{"game_id": "0021700960", "chunk_id": "0021700960_025", "order": 25, "role": "body", "text": "Rockets: Play at the Milwaukee Bucks on Wednesday."}
{"game_id": "0021700960", "chunk_id": "0021700960_026", "order": 26, "role": "body", "text": "Thunder: Host the Phoenix Suns on Thursday."}
{"game_id": "0021700960", "chunk_id": "0021700960_028", "order": 28, "role": "body", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
{"game_id": "0021700960", "chunk_id": "0021700960_030", "order": 30, "role": "closing", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP"}
