{"game_id": "0021700717", "chunk_id": "0021700717_001", "order": 1, "role": "lead", "text": "CHICAGO --  Coach Luke Walton is curious to see if the Los Angeles Lakers' recent success at home will travel during a five-game road trip."}
{"game_id": "0021700717", "chunk_id": "0021700717_002", "order": 2, "role": "body", "text": "The answer in the opener Friday night was positive -- with a few tense moments along the way."}
{"game_id": "0021700717", "chunk_id": "0021700717_003", "order": 3, "role": "body", "text": "Brandon Ingram scored 25 points, including eight in the final 3:18, and the Lakers rallied late for a 108-103 victory over the Chicago Bulls after losing a 12-point, fourth-quarter lead."}
{"game_id": "0021700717", "chunk_id": "0021700717_004", "order": 4, "role": "body", "text": "Jordan Clarkson had 19 points and Brook Lopez added 17 for the Lakers, who have won four straight and eight of 10. Six of the eight wins were at home."}
{"game_id": "0021700717", "chunk_id": "0021700717_005", "order": 5, "role": "body", "text": "\"Coach told us the start of our road trip has to be really good for us to continue the success,\" Ingram said. \"We knew we had to come in here and take care of business and not just think of the games we won at home.\""}
{"game_id": "0021700717", "chunk_id": "0021700717_006", "order": 6, "role": "body", "text": "Los Angeles trailed 95-92 with less than four minutes to play before Ingram -- who also had nine rebounds and was 10 for 18 from the field -- started the rally with a pair of free throws."}
{"game_id": "0021700717", "chunk_id": "0021700717_007", "order": 7, "role": "body", "text": "\"Brandon was big down the stretch,\" Walton said. \"He seemed to get a little more aggressive.\""}
{"game_id": "0021700717", "chunk_id": "0021700717_008", "order": 8, "role": "body", "text": "Nikola Mirotic scored 14 of his 18 points in the fourth quarter, and Denzel Valentine and Bobby Portis had 16 apiece for Chicago, which has dropped three straight."}
{"game_id": "0021700717", "chunk_id": "0021700717_009", "order": 9, "role": "body", "text": "\"We did not get off to a good start tonight,\" coach Fred Hoiberg said. \"Our grit, toughness wasn't there. Give our guys credit for continuing to fight. Our second unit got us back into that game and got us back in it again in the fourth after falling behind double digits.\""}
{"game_id": "0021700717", "chunk_id": "0021700717_010", "order": 10, "role": "body", "text": "Los Angeles led by as much as 17 in the first half before Chicago rallied to tie the score at 68 early in the third quarter. The Lakers, though, answered with 11 straight points and led 84-72 entering the fourth."}
{"game_id": "0021700717", "chunk_id": "0021700717_011", "order": 11, "role": "body", "text": "The Bulls rallied again and took a 92-90 lead with 5 1/2 minutes remaining on Valentine's 3-pointer. It was Chicago's first lead since 3-2. Mirotic hit a 3-pointer to give the Bulls the 95-92 lead before Los Angeles took control."}
{"game_id": "0021700717", "chunk_id": "0021700717_012", "order": 12, "role": "body", "text": "Ingram's free throws started a 13-2 run that sealed the win."}
{"game_id": "0021700717", "chunk_id": "0021700717_013", "order": 13, "role": "body", "text": "\"We just stayed together,\" Ingram said. \"We all had a good attitude and a winning attitude and we all wanted to win. We just tried to make the right plays down the stretch, we utilized the time down the stretch and we made plays for each other.\""}
{"game_id": "0021700717", "chunk_id": "0021700717_015", "order": 15, "role": "body", "text": "Lakers: Rookie G Lonzo Ball missed his sixth straight game with a sore left knee. The second overall pick is averaging 10.2 points, 7.1 rebounds and 7.1 assists."}
{"game_id": "0021700717", "chunk_id": "0021700717_016", "order": 16, "role": "body", "text": "Bulls: Zach LaVine, playing in just his seventh game of the season following ACL surgery last February, played a season-high 26 minutes. His minutes restriction was lifted to 26-28 minutes before the game ... Chicago was 17 for 36 on 3-pointers and now has made at least 10 3s in each of its last 11 home games."}
{"game_id": "0021700717", "chunk_id": "0021700717_018", "order": 18, "role": "body", "text": "Chicago G Kris Dunn missed his fourth straight game with a concussion, and it's unclear when he might return."}
{"game_id": "0021700717", "chunk_id": "0021700717_019", "order": 19, "role": "body", "text": "\"The symptoms really haven't changed much,\" Hoiberg said. \"He's feeling a little bit better today, but he's still doing very limited physical activity.\""}
{"game_id": "0021700717", "chunk_id": "0021700717_020", "order": 20, "role": "body", "text": "Dunn, who suffered the concussion following a hard fall in a game on Jan. 17, still is experiencing headaches, fatigue and grogginess."}
{"game_id": "0021700717", "chunk_id": "0021700717_022", "order": 22, "role": "body", "text": "Brook Lopez got the better of his twin brother, Robin, who finished with eight points and four rebounds in 19 1/2 minutes."}
{"game_id": "0021700717", "chunk_id": "0021700717_023", "order": 23, "role": "body", "text": "\"It's pretty great,\" Brook said of getting the win. \"I didn't say a word to him. Like any other game.\""}
{"game_id": "0021700717", "chunk_id": "0021700717_025", "order": 25, "role": "body", "text": "Without Dunn, the Bulls have struggled down the stretch of close games."}
{"game_id": "0021700717", "chunk_id": "0021700717_026", "order": 26, "role": "body", "text": "\"He really had developed into our closer,\" Hoiberg said. \"We're obviously without him right now and you've seen what happened in the two close games.\""}
{"game_id": "0021700717", "chunk_id": "0021700717_028", "order": 28, "role": "body", "text": "Lakers: Visit the Toronto Raptors on Sunday."}
{"game_id": "0021700717", "chunk_id": "0021700717_029", "order": 29, "role": "closing", "text": "Bulls: Host the Milwaukee Bucks on Sunday."}
