{"game_id": "0021400104", "chunk_id": "0021400104_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  On a night when Kobe Bryant set the record for most missed field goals in an NBA career, the Memphis Grizzlies extended their winning streak at home."}
{"game_id": "0021400104", "chunk_id": "0021400104_002", "order": 2, "role": "body", "text": "Mike Conley scored 23 points and the Grizzlies finally got a strong effort from their struggling bench to turn away the Los Angeles Lakers 107-102 on Tuesday night."}
{"game_id": "0021400104", "chunk_id": "0021400104_003", "order": 3, "role": "body", "text": "It was the 17th straight regular-season home victory for Memphis, dating to last season."}
{"game_id": "0021400104", "chunk_id": "0021400104_004", "order": 4, "role": "body", "text": "The Lakers put together a furious rally after trailing by 17 in the fourth quarter, including 11 straight points. Los Angeles was down 105-102 with about 30 seconds left when Jordan Hill missed a 21-foot jumper, leading to an exasperated look from Bryant in the right corner."}
{"game_id": "0021400104", "chunk_id": "0021400104_005", "order": 5, "role": "body", "text": "After Hill's miss, Zach Randolph scored on a putback of Marc Gasol's shot that was blocked by Ed Davis with 5.2 seconds remaining, providing the final margin."}
{"game_id": "0021400104", "chunk_id": "0021400104_006", "order": 6, "role": "body", "text": "\"You've got to understand what's going on with the game and what's going on at that point in the situation,\" Lakers coach Byron Scott said."}
{"game_id": "0021400104", "chunk_id": "0021400104_007", "order": 7, "role": "body", "text": "The Lakers played without reserve guard Wayne Ellington, whose father was killed Sunday night in Philadelphia. Ellington was not with the team."}
{"game_id": "0021400104", "chunk_id": "0021400104_008", "order": 8, "role": "body", "text": "\"This is our livelihood, but this is still just a game,\" Scott said before the game. \"This thing that's happened to Wayne is real life. It kind of puts everything in perspective.\""}
{"game_id": "0021400104", "chunk_id": "0021400104_009", "order": 9, "role": "body", "text": "Bryant led the Lakers (1-6) with 28 points, but shot 10 of 26 from the field and surpassed Boston Celtics great John Havlicek for the most missed field goals in an NBA career."}
{"game_id": "0021400104", "chunk_id": "0021400104_010", "order": 10, "role": "body", "text": "\"He kind of got it going, but he went 10 for 26,\" said Memphis forward Tony Allen, who guarded Bryant most of the night."}
{"game_id": "0021400104", "chunk_id": "0021400104_011", "order": 11, "role": "body", "text": "Backup guard Beno Udrih had 16 points for Memphis. Courtney Lee scored 15 as six Grizzlies finished in double figures, including Randolph with 11 points and 10 rebounds."}
{"game_id": "0021400104", "chunk_id": "0021400104_012", "order": 12, "role": "body", "text": "Memphis has not dropped a regular-season home game since a February loss to Dallas."}
{"game_id": "0021400104", "chunk_id": "0021400104_013", "order": 13, "role": "body", "text": "Carlos Boozer scored 20 points for the Lakers. Wesley Johnson added 15, while Hill had 13 points and 14 rebounds. Bryant had six assists."}
{"game_id": "0021400104", "chunk_id": "0021400104_014", "order": 14, "role": "body", "text": "Bryant, who entered shooting 39 percent this season, didn't get off to a very good start, connecting on only one of his first five shots. At that point, the watch on Bryant reaching the NBA record for misses began to gain attention."}
{"game_id": "0021400104", "chunk_id": "0021400104_015", "order": 15, "role": "body", "text": "Memphis held a 56-52 advantage at halftime."}
{"game_id": "0021400104", "chunk_id": "0021400104_016", "order": 16, "role": "body", "text": "The Grizzlies led most of the way, with the 17-point advantage in the fourth marking their largest of the night before the final Los Angeles rally."}
{"game_id": "0021400104", "chunk_id": "0021400104_017", "order": 17, "role": "body", "text": "\"I guess it just kind of sums up our season thus far,\" said Lakers guard Jeremy Lin, who had 12 points. \"We did enough to learn and be there and didn't do enough to win.\""}
{"game_id": "0021400104", "chunk_id": "0021400104_020", "order": 20, "role": "body", "text": "Lakers: Havlicek missed 13,417 shots. Bryant now has 13,421. ... Los Angeles has several former Grizzlies on the roster: Davis, Xavier Henry and Ellington. ... The Lakers started a stretch of six games in nine days."}
{"game_id": "0021400104", "chunk_id": "0021400104_021", "order": 21, "role": "body", "text": "Grizzlies: Udrih had 10 points in the first half, becoming the first Memphis reserve to reach double figures this season. Kosta Koufos had 14 points in a backup role, as the Memphis bench outscored the Lakers' reserves 38-14."}
{"game_id": "0021400104", "chunk_id": "0021400104_023", "order": 23, "role": "body", "text": "Veteran NBA forward Kenyon Martin was at the game, sitting next to Grizzlies general manager Chris Wallace. Martin reportedly is in discussion with the team about a possible workout."}
{"game_id": "0021400104", "chunk_id": "0021400104_025", "order": 25, "role": "body", "text": "The game was Bryant's first in Memphis since he broke his left knee against the Grizzlies last December, ending his season. Despite being injured during that game, Bryant finished with 21 points. Asked how he continued to play through the injury, he replied: \"I figured if I'm going to be out for a while, I might as well finish this game.\""}
{"game_id": "0021400104", "chunk_id": "0021400104_027", "order": 27, "role": "body", "text": "Lakers: At New Orleans on Wednesday."}
{"game_id": "0021400104", "chunk_id": "0021400104_028", "order": 28, "role": "closing", "text": "Grizzlies: Home against Sacramento on Thursday."}
