{"game_id": "0021700283", "chunk_id": "0021700283_001", "order": 1, "role": "lead", "text": "DALLAS -- Russell Westbrook and the Oklahoma City Thunder didn't blow a lead this time. They barely had one.\nDirk Nowitzki scored a season-high 19 points , rookie Dennis Smith held his own against Westbrook on the rookie Dallas guard's 20th birthday and the suddenly surging Mavericks beat the Thunder 97-81 on Saturday night.\nThe Thunder fell behind for good in the first quarter a night after losing a 15-point lead in the second half of a one-point loss to Detroit that followed a dominant win over Kevin Durant and Golden State -- their only victory in the past five games.\n\"Everybody should be upset walking out of this locker room because you sure hate to lose,\" guard Raymond Felton said after the team with the Big Three of Westbrook, Carmelo Anthony and Paul George fell to 8-11.\n\"I know I do and I'm pretty sure everybody else on this team does, so that's why you see the faces. That's why you see the looks. We're all upset, but we're the ones who got to figure it out.\"\nSmith finished with 15 points and four assists while Westbrook had 28 points, 12 rebounds and nine assists a night after his sixth triple-double of the season.\nBut the star guard had just 12 points after a dominant first quarter as the Mavericks won their third in the past four games following a 2-14 start. At 5-15, Dallas still has the worst record in the Western Conference.\n\"We are making small gains,\" coach Rick Carlisle said. \"It's the first time we have won two in a row. It is a little bit of momentum, and it is precious.\"\nAnthony hit three of his four 3-pointers in the third quarter to help Oklahoma City close within 10, but got called for an offensive foul, his fourth, and then traveling the next time down. Yogi Ferrell's 3-pointer after the travel put Dallas up 70-53.\nAnthony finished with 16 points after sitting the entire fourth quarter, while George also sat the fourth and finished with just two points on 1-of-12 shooting with a game-high 10 assists for the Thunder, who shot 36 percent.\nIt was the fewest points for George since the finale in 2014-15, when he missed all but the final six games after breaking his right leg with Team USA the previous summer.\nNowitzki, the 39-year-old in his 20th season, hit his season high on a 3-pointer that gave the Mavericks their biggest lead at 26, 83-57, early in the fourth quarter. J.J. Barea had one of his six assists on that 3 as Dallas finished with 25 on 37 baskets.\nHarrison Barnes had 12 points and 12 rebounds in Dallas' first game since he banked in a 3-pointer at the buzzer off an inbounds pass with 0.5 seconds left, giving the Mavericks a 95-94 win in Memphis.\nTIP-INS\nThunder: Held to 13 points in the second quarter, fewest in any quarter this season. The previous low was 14 in the second quarter of a 96-87 loss to Utah on Oct. 21. ... The Thunder were outscored 53-31 in the second and third quarters, shooting 28 percent (11 of 39).\nMavericks: Nowitzki had a strange three-point play in the second quarter. Jerami Grant was given a technical for grabbing the rim when Nowitzki hit a layup. There was contact, and the Mavericks thought Nowitzki was fouled and would get three free throws. He made the one he got. ... The Mavericks weathered a 5-minute scoreless drought in the fourth quarter, with Ferrell hitting a 3 to get the lead back to 18.\nWHERE'S THE HELP\nGrant's two free throws with 50 seconds left in the third quarter were the first points by someone other than Westbrook or Anthony since a bucket by Steven Adams with 5:20 left in the second. Westbrook and Anthony were the only double-figure scorers, followed by Grant with nine.\nMARK YOUR CALENDAR\nSmith said he didn't notice he was facing Westbrook on his 20th birthday until he had to start planning what family might be around for the occasion. The ninth overall pick in the draft, Smith has drawn comparisons to Westbrook. \"I don't really try to compare myself,\" Smith said.\nUP NEXT\nThunder: At Orlando on Wednesday, with the first of two three-day breaks this season. That's their longest outside the All-Star break.\nMavericks: At San Antonio on Monday, the second of four in a season series that will be finished nine days before Christmas.\n---\nMore AP NBA: https://apnews.com/tag/NBAbasketball"}
