{"game_id": "0021700871", "chunk_id": "0021700871_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Russell Westbrook had a harder time trying to figure out the official score sheet than getting free for a 3-pointer at the buzzer."}
{"game_id": "0021700871", "chunk_id": "0021700871_002", "order": 2, "role": "body", "text": "Westbrook made a 3-pointer off an inbounds pass as time expired, lifting the Thunder to a 110-107 victory over the Sacramento Kings on Thursday night."}
{"game_id": "0021700871", "chunk_id": "0021700871_003", "order": 3, "role": "body", "text": "\"Got to find a way to get space with one second left,\" Westbrook said. \"They thought I was going for a lob. I just read the defender and tried to pop back and get some space.\""}
{"game_id": "0021700871", "chunk_id": "0021700871_004", "order": 4, "role": "body", "text": "The Thunder blew a 23-point lead and trailed 105-102 with 4  1/2 minutes remaining before closing the game on an 8-2 run."}
{"game_id": "0021700871", "chunk_id": "0021700871_005", "order": 5, "role": "body", "text": "Paul George scored 26 points, Carmelo Anthony had 23 and Westbrook finished with 17 to help Oklahoma City to its second win in three games against Sacramento this season."}
{"game_id": "0021700871", "chunk_id": "0021700871_006", "order": 6, "role": "body", "text": "Complete final statistics were unavailable after a computer glitch froze the Kings' system at the end of the third quarter. A team official later distributed copies of the official scorer's book to media and players."}
{"game_id": "0021700871", "chunk_id": "0021700871_007", "order": 7, "role": "body", "text": "Westbrook grabbed a copy and looked at it briefly before tossing it aside."}
{"game_id": "0021700871", "chunk_id": "0021700871_008", "order": 8, "role": "body", "text": "\"I used to be able to do those back in the day but I don't know (what) it looks like now,\" Westbrook said. \"I can't understand it.\""}
{"game_id": "0021700871", "chunk_id": "0021700871_009", "order": 9, "role": "body", "text": "Westbrook, who notched his 18th triple-double of the season, made three free throws sandwiched around a bucket in the paint by Steven Adams to put Oklahoma City up 107-105."}
{"game_id": "0021700871", "chunk_id": "0021700871_010", "order": 10, "role": "body", "text": "Justin Jackson's 6-foot jumper off an offensive rebound tied the game. After a timeout, the Thunder got the ball in front of Sacramento's bench and Anthony found Westbrook atop the 3-point line for the winner."}
{"game_id": "0021700871", "chunk_id": "0021700871_011", "order": 11, "role": "body", "text": "It came after Sacramento's Garrett Temple was screened away from Westbrook, leaving the All-Star guard open."}
{"game_id": "0021700871", "chunk_id": "0021700871_012", "order": 12, "role": "body", "text": "\"We at least got him a clear look and obviously he made a tough shot,\" Thunder coach Billy Donovan said. \"He missed a lot of shots in that second half but he just stuck with it and obviously when it counted and we needed one he made it.\""}
{"game_id": "0021700871", "chunk_id": "0021700871_013", "order": 13, "role": "body", "text": "Westbrook lifted the Thunder from what would have been a devastating loss after a fast start in their first game since the All-Star break. They set a season high with 44 points in the first quarter and made 12 3-pointers but still had to rally in the final minutes to win."}
{"game_id": "0021700871", "chunk_id": "0021700871_014", "order": 14, "role": "body", "text": "\"It was like I was watching in slow motion a little bit,\" Sacramento's Skal Labissiere said of Westbrook's winner. \"That's what he does. He works really hard and it pays off.\""}
{"game_id": "0021700871", "chunk_id": "0021700871_015", "order": 15, "role": "body", "text": "Anthony matched his season high of seven 3-pointers and George had three from beyond the arc, ending his five-game streak with five or more 3s. It was the second-longest streak in NBA history behind George McCloud's six-game streak in 1996."}
{"game_id": "0021700871", "chunk_id": "0021700871_016", "order": 16, "role": "body", "text": "The Thunder shot nearly 70 percent in the first quarter and made seven 3s, including three straight by Anthony. George had two of them and added a three-point play and two free throws to put Oklahoma City up 44-21."}
{"game_id": "0021700871", "chunk_id": "0021700871_017", "order": 17, "role": "body", "text": "It was the complete opposite for Donovan's club after that."}
{"game_id": "0021700871", "chunk_id": "0021700871_018", "order": 18, "role": "body", "text": "Sacramento went on a pair of big runs early in the second quarter and got within 64-60 before Anthony's fifth 3 of the first half briefly halted the onslaught and put Oklahoma City up by seven at halftime."}
{"game_id": "0021700871", "chunk_id": "0021700871_019", "order": 19, "role": "body", "text": "The Thunder led 85-74 midway through the third before the Kings made another surge. Vince Carter, the 41-year-old former dunk champion, had a three-point play and 3-pointer and Sacramento scored the final 16 points of the period to go up 90-85."}
{"game_id": "0021700871", "chunk_id": "0021700871_020", "order": 20, "role": "body", "text": "Zach Randolph scored 29 points to lead five Kings in double figures."}
{"game_id": "0021700871", "chunk_id": "0021700871_022", "order": 22, "role": "body", "text": "The Kings missed three shots in the final 55 seconds when they were down by two, including a pair of attempts close to the rim. \"Made some mistakes at the end, didn't finish,\" Sacramento coach Dave Joerger said."}
{"game_id": "0021700871", "chunk_id": "0021700871_024", "order": 24, "role": "body", "text": "Thunder: Oklahoma City went 11 for 11 on free throws in the first half. . The Thunder have scored 100 or more in four consecutive games and 14 of the previous 16."}
{"game_id": "0021700871", "chunk_id": "0021700871_025", "order": 25, "role": "body", "text": "Kings: Frank Mason scored six points in his first game since Dec. 31. Mason had been sidelined with a partially torn right facscia. . De'Aaron Fox (conjunctiveitis) and Kosta Koufos (ill) were held out."}
{"game_id": "0021700871", "chunk_id": "0021700871_027", "order": 27, "role": "body", "text": "Thunder: At Golden State on Saturday."}
{"game_id": "0021700871", "chunk_id": "0021700871_028", "order": 28, "role": "closing", "text": "Kings: Host the Lakers on Saturday."}
