{"game_id": "0021700513", "chunk_id": "0021700513_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Vince Carter delivered a big performance for the Sacramento Kings."}
{"game_id": "0021700513", "chunk_id": "0021700513_002", "order": 2, "role": "body", "text": "Cleveland coach Tyronn Lue wasn't surprised. Not one bit."}
{"game_id": "0021700513", "chunk_id": "0021700513_003", "order": 3, "role": "body", "text": "Carter scored a season-high 24 points, and the Kings handed the Cavaliers their second straight loss with a 109-95 victory on Wednesday night."}
{"game_id": "0021700513", "chunk_id": "0021700513_004", "order": 4, "role": "body", "text": "\"He's always been a guy, big stage, big moment, that's been his time to shine,\" said Lue, who faced Carter during his playing days. \"Couldn't stop him tonight. He had it going.\""}
{"game_id": "0021700513", "chunk_id": "0021700513_005", "order": 5, "role": "body", "text": "The 40-year-old Carter had missed the previous three games due to a rib injury and coach's decision. The former dunk king gave Cleveland all kinds of problems in his return, shooting 10 of 12 in 30 minutes."}
{"game_id": "0021700513", "chunk_id": "0021700513_006", "order": 6, "role": "body", "text": "It was the first time in NBA history that a 40-plus-year-old reserve scored at least 20 points in a game, according to the Kings."}
{"game_id": "0021700513", "chunk_id": "0021700513_007", "order": 7, "role": "body", "text": "\"The shot was falling tonight but it was our ball movement, and the ball found the open guy,\" Carter said. \"It just made it fun to watch. If we play that way we could be a pretty good basketball team.\""}
{"game_id": "0021700513", "chunk_id": "0021700513_008", "order": 8, "role": "body", "text": "Carter made a buzzer-beating 3-pointer to give Sacramento an 85-80 lead heading into the fourth quarter. He connected again from long range to make it 101-87 with 5:38 left, and then made a 16-foot double-pump shot over Jae Crowder before leaving to a standing ovation with 20.1 seconds left."}
{"game_id": "0021700513", "chunk_id": "0021700513_009", "order": 9, "role": "body", "text": "\"He had some bombs,\" Cleveland's LeBron James said. \"Once he got going, we couldn't slow him down.\""}
{"game_id": "0021700513", "chunk_id": "0021700513_010", "order": 10, "role": "body", "text": "James had 16 points, 10 rebounds and 14 assists for the Cavs, and Kevin Love scored 23 points."}
{"game_id": "0021700513", "chunk_id": "0021700513_011", "order": 11, "role": "body", "text": "Cleveland was coming off a 99-92 loss at Golden State on Christmas Day, stopping the Cavaliers' 26-game streak with 100 points or more. Cleveland had not dropped consecutive games since a four-game slide from Oct. 25-Nov. 1."}
{"game_id": "0021700513", "chunk_id": "0021700513_012", "order": 12, "role": "body", "text": "\"They out-scrapped us,\" Lue said. \"They changed their lineup. We didn't prepare for that but that's no excuse.\""}
{"game_id": "0021700513", "chunk_id": "0021700513_013", "order": 13, "role": "body", "text": "James cited the team's transition defense as the primary reason for its loss to Golden State. This time it was an inconsistent offense and a big night by Carter that did in the reigning Eastern Conference champs."}
{"game_id": "0021700513", "chunk_id": "0021700513_014", "order": 14, "role": "body", "text": "Cleveland has lost three of four after winning 18 of the previous 19."}
{"game_id": "0021700513", "chunk_id": "0021700513_015", "order": 15, "role": "body", "text": "\"We had zero rhythm,\" James said. \"Had some early in the first, had some in the third when we cut the lead but other than that we just didn't have rhythm.\""}
{"game_id": "0021700513", "chunk_id": "0021700513_016", "order": 16, "role": "body", "text": "Willie Cauley-Stein had 17 points and nine rebounds for Sacramento, and Bogdan Bogdanovic added 16 points and eight assists. Zach Randolph had 14 points and seven boards."}
{"game_id": "0021700513", "chunk_id": "0021700513_018", "order": 18, "role": "body", "text": "Isaiah Thomas' long-awaited debut for Cleveland was held off for at least for another game. The veteran point guard, who is coming back from a right hip injury, worked out before the loss and there was speculation he might play against the Kings before being ruled out. Lue left open the possibility that he could be activated for Saturday's game in Utah."}
{"game_id": "0021700513", "chunk_id": "0021700513_020", "order": 20, "role": "body", "text": "Carter wasn't the only Sacramento reserve that came up big. Cauley-Stein was a rebound shy of a double-double while Bogdanovic shot 6 of 9 with three 3s."}
{"game_id": "0021700513", "chunk_id": "0021700513_021", "order": 21, "role": "body", "text": "\"We had a lot more zip to us tonight,\" Kings coach Dave Joerger said. \"You don't beat a team like that without having everybody contribute, and they did.\""}
{"game_id": "0021700513", "chunk_id": "0021700513_023", "order": 23, "role": "body", "text": "Cavaliers: Cleveland had won five of the last six against the Kings. Unlike the first game between the teams this season when the Cavs rallied in the second half to win, Lue's team was outscored 47-40 in the second half."}
{"game_id": "0021700513", "chunk_id": "0021700513_024", "order": 24, "role": "body", "text": "Kings: Rookie Frank Mason scored four points in his first start of the season as part of Joerger's decision to go with a small lineup against the bigger Cavs. Malachi Richardson also made his first career start and also scored four points."}
{"game_id": "0021700513", "chunk_id": "0021700513_026", "order": 26, "role": "body", "text": "Cavaliers: Play in Utah on Saturday. Cleveland has lost three straight in Salt Lake City."}
{"game_id": "0021700513", "chunk_id": "0021700513_027", "order": 27, "role": "closing", "text": "Kings: Host Phoenix on Friday night."}
