{"game_id": "0021701140", "chunk_id": "0021701140_001", "order": 1, "role": "lead", "text": "BOSTON --  The race for the top seed in the Eastern Conference is getting more interesting."}
{"game_id": "0021701140", "chunk_id": "0021701140_002", "order": 2, "role": "body", "text": "Marcus Morris had 25 points and nine rebounds before getting ejected in the closing seconds, and the Boston Celtics rallied to beat the East-leading Toronto Raptors 110-99 on Saturday night."}
{"game_id": "0021701140", "chunk_id": "0021701140_003", "order": 3, "role": "body", "text": "Jayson Tatum added 24 points, six rebounds and four assists as Boston posted its sixth straight win and moved within two games of Toronto for the top seed in the East. Terry Rozier finished with 21 points and seven assists."}
{"game_id": "0021701140", "chunk_id": "0021701140_004", "order": 4, "role": "body", "text": "Both teams have six games remaining. They meet for the final time on Wednesday in Toronto."}
{"game_id": "0021701140", "chunk_id": "0021701140_005", "order": 5, "role": "body", "text": "\"We have to see them twice in a week, and we know it's going to be a battle,\" Rozier said. \"But I say we don't let the standings dictate anything. We just go out there and we play and we go to war. That's what happened tonight.\""}
{"game_id": "0021701140", "chunk_id": "0021701140_006", "order": 6, "role": "body", "text": "The Celtics got their 53rd win, matching their total from last season."}
{"game_id": "0021701140", "chunk_id": "0021701140_007", "order": 7, "role": "body", "text": "Things got heated in the final seconds, when four technical fouls were assessed between the teams. Morris was hit with two and was tossed. Toronto's C.J. Miles and Serge Ibaka received one each."}
{"game_id": "0021701140", "chunk_id": "0021701140_008", "order": 8, "role": "body", "text": "The kindling for the ejection came when Morris dribbled into the front court and was fouled with 10.9 seconds remaining. He then began jawing back and forth with Raptors players."}
{"game_id": "0021701140", "chunk_id": "0021701140_009", "order": 9, "role": "body", "text": "\"I just thought the game was over and just think the foul was a little too much, being down 10 with (10 seconds) left,\" Morris said. \"It got a little heated.\""}
{"game_id": "0021701140", "chunk_id": "0021701140_010", "order": 10, "role": "body", "text": "The ending did little to damper the performance of Morris or his teammates over the preceding 47 minutes."}
{"game_id": "0021701140", "chunk_id": "0021701140_011", "order": 11, "role": "body", "text": "For Morris, it was his fourth straight game with at least 20 points -- a career high."}
{"game_id": "0021701140", "chunk_id": "0021701140_012", "order": 12, "role": "body", "text": "DeMar DeRozan led Toronto with 32 points, seven rebounds and seven assists. Ibaka added 15 points and 10 rebounds."}
{"game_id": "0021701140", "chunk_id": "0021701140_013", "order": 13, "role": "body", "text": "After giving up 24 points in the paint in the first half, the Celtics mixed in some zone defensively in the second half to try to limit the Raptors' opportunities."}
{"game_id": "0021701140", "chunk_id": "0021701140_014", "order": 14, "role": "body", "text": "It was effective, and helped ignite a 10-0 Celtics run that gave them a 104-94 lead with 3:27 left on a layup by Tatum."}
{"game_id": "0021701140", "chunk_id": "0021701140_015", "order": 15, "role": "body", "text": "\"It had a lot (of effect),\" Raptors point guard Kyle Lowry said. \"We were stuck outside. They did a good job in the zone. We didn't make any plays. We had to figure it out. We just didn't figure it out quick enough.\""}
{"game_id": "0021701140", "chunk_id": "0021701140_016", "order": 16, "role": "body", "text": "There were 15 ties and 20 lead changes in a game that was played within 5 to 6 points most of the night."}
{"game_id": "0021701140", "chunk_id": "0021701140_017", "order": 17, "role": "body", "text": "\"Whatever they can do, we can do,\" Morris said. \"We just play hard. A couple guys stepped up. ... It was a good team win.\""}
{"game_id": "0021701140", "chunk_id": "0021701140_019", "order": 19, "role": "body", "text": "Raptors: DeRozan extended his franchise record for 30-point games to 92. ... Toronto's franchise-record streak of hitting at least 10 3-pointers came to an end at 17 games."}
{"game_id": "0021701140", "chunk_id": "0021701140_020", "order": 20, "role": "body", "text": "Celtics: Rozier has scored 10 or more points in 25 straight games. He is the seventh Celtics player since 2010 to have a streak that long. ... Aron Baynes' two 3-pointers were a career high. He entered the night 1 for 19 from beyond the arc. The one he made previously was in Boston on Nov. 30, 2014. ... Morris (right ankle sprain) and Al Horford (left ankle sprain) both returned after missing a game."}
{"game_id": "0021701140", "chunk_id": "0021701140_022", "order": 22, "role": "body", "text": "Celtics coach Brad Stevens said he got his first peek at Kyrie Irving since the All-Star had surgery last week to remove a tension wire in his left knee."}
{"game_id": "0021701140", "chunk_id": "0021701140_023", "order": 23, "role": "body", "text": "\"Saw him (Friday), spent a lot of time with him. His spirits are good,\" Stevens said. \"Bending (and) extending his knee on a training table. No on-court videos. No 360 dunks. Just extending his knee on a training table.\""}
{"game_id": "0021701140", "chunk_id": "0021701140_024", "order": 24, "role": "body", "text": "Irving is out at least for the remainder of the regular season. The team said recovery would take three to six weeks."}
{"game_id": "0021701140", "chunk_id": "0021701140_026", "order": 26, "role": "body", "text": "Playing the Celtics highlighted the Raptors' health. Toronto had its entire roster available, which coach Dwayne Casey said was \"huge\" for his team's prospects going forward."}
{"game_id": "0021701140", "chunk_id": "0021701140_027", "order": 27, "role": "body", "text": "\"That was one of the things coming into this year -- to make sure we cut back some minutes,\" Casey said. \"DeMar and Kyle (Lowry), keep their minutes back to make sure they didn't get those high-usage rates on their body. Knock on wood, it's not over yet.\""}
{"game_id": "0021701140", "chunk_id": "0021701140_029", "order": 29, "role": "body", "text": "Raptors: At Cleveland on Tuesday."}
{"game_id": "0021701140", "chunk_id": "0021701140_030", "order": 30, "role": "body", "text": "Celtics: At Milwaukee Tuesday."}
{"game_id": "0021701140", "chunk_id": "0021701140_032", "order": 32, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
