{"game_id": "0021700952", "chunk_id": "0021700952_001", "order": 1, "role": "lead", "text": "MIAMI --  Hassan Whiteside enjoyed an easy night, as did the Miami Heat."}
{"game_id": "0021700952", "chunk_id": "0021700952_002", "order": 2, "role": "body", "text": "And it was a rarity on both counts."}
{"game_id": "0021700952", "chunk_id": "0021700952_003", "order": 3, "role": "body", "text": "Whiteside had 24 points and 14 rebounds, Goran Dragic scored 17 and the Heat moved into the No. 7 spot in the Eastern Conference by topping the Phoenix Suns 125-103 on Monday night."}
{"game_id": "0021700952", "chunk_id": "0021700952_004", "order": 4, "role": "body", "text": "Whiteside had his highest-scoring game since Jan. 29, making 10 of his 13 shots."}
{"game_id": "0021700952", "chunk_id": "0021700952_005", "order": 5, "role": "body", "text": "\"He did it all,\" Heat guard Dwyane Wade said. \"I told him I felt this was his best game that I've seen him play, from afar when I wasn't here and since I've been here. It's not going to happen every night, but that Hassan right there is going to allow us to win a lot of games.\""}
{"game_id": "0021700952", "chunk_id": "0021700952_006", "order": 6, "role": "body", "text": "Kelly Olynyk scored 15 points for the Heat, who gave four of their starters -- Whiteside included -- the entire fourth quarter off and beat the Suns for the 18th time in their last 20 meetings."}
{"game_id": "0021700952", "chunk_id": "0021700952_007", "order": 7, "role": "body", "text": "Wade, Josh Richardson, Justise Winslow and Luke Babbitt each had 12 for the Heat, which had seven players in double figures and got just their second double-digit win in the last seven weeks."}
{"game_id": "0021700952", "chunk_id": "0021700952_008", "order": 8, "role": "body", "text": "Devin Booker scored 31 points for Phoenix, which got 19 from TJ Warren and 12 from Marquese Chriss. The Suns shot 48 percent, but allowed Miami to shoot 51 percent and got out-rebounded 51-39."}
{"game_id": "0021700952", "chunk_id": "0021700952_009", "order": 9, "role": "body", "text": "\"On a back-to-back, but that's part of the NBA so you can't make excuses,\" Booker said. \"I think we took a step back today. I think we were on the right path the four previous games with our energy level and we didn't have that tonight.\""}
{"game_id": "0021700952", "chunk_id": "0021700952_010", "order": 10, "role": "body", "text": "Miami is now five games clear of No. 9 Detroit in the East playoff race, both with 18 games remaining. The Heat (34-30) are tied with Milwaukee, but moved to seventh because they win the season-series tiebreaker with the Bucks."}
{"game_id": "0021700952", "chunk_id": "0021700952_011", "order": 11, "role": "body", "text": "The rest of the week is crucial for Miami in an East race where the gap between No. 3 Cleveland and No. 8 Milwaukee is only 3 1/2 games. The Heat visit No. 5 Washington (36-28) on Tuesday, host No. 6 Philadelphia (34-28) on Thursday and entertain the Wizards again on Saturday."}
{"game_id": "0021700952", "chunk_id": "0021700952_012", "order": 12, "role": "body", "text": "\"These are the moments that you ask for,\" Whiteside said. \"I wouldn't want it no other way.\""}
{"game_id": "0021700952", "chunk_id": "0021700952_014", "order": 14, "role": "body", "text": "Suns: The loss mathematically eliminated Phoenix from playoff contention. This is the eighth consecutive year where the Suns won't be going to the postseason, a span during which they've had 88 different players and five coaches. ... This game completed the 14th back-to-back of the season for the Suns, who have only one left -- at Cleveland and Orlando March 23 and 24."}
{"game_id": "0021700952", "chunk_id": "0021700952_015", "order": 15, "role": "body", "text": "Heat: Babbitt tried seven 3-pointers in the first quarter, the most by a Heat player in the opening 12 minutes of a regular-season game since Quentin Richardson also tried seven on March 12, 2010. ... Tyler Johnson (bruised quad) returned in a backup role after missing two games. Wayne Ellington (also a bruised quad) did his pregame on-court shooting regimen but missed his third straight game."}
{"game_id": "0021700952", "chunk_id": "0021700952_017", "order": 17, "role": "body", "text": "Amare Stoudemire, who started his NBA career with Phoenix and ended it with Miami, was sitting courtside. Also in attendance were Pro Football Hall of Famer Jim Kelly (wearing a shirt bearing the logo of his alma mater, the University of Miami) and Miami Marlins outfielder Monte Harrison -- brother of Suns guard Shaquille Harrison."}
{"game_id": "0021700952", "chunk_id": "0021700952_019", "order": 19, "role": "body", "text": "The Suns were great at the ends of all four quarters. Harrison scored with no time left in the first, Warren scored with 1.2 seconds left in the half, Marquese Chriss scored with 2.4 seconds left in the third -- and after he missed the free throw off an and-one opportunity, Warren tipped in the miss with 1.9 ticks on the clock. And the final basket was a tip-in by former Miami Hurricane Davon Reed, just before the closing buzzer."}
{"game_id": "0021700952", "chunk_id": "0021700952_021", "order": 21, "role": "body", "text": "Miami scored eight times off Phoenix's first nine turnovers -- turning them into 19 points, with three of those giveaways leading to Heat 3-pointers."}
{"game_id": "0021700952", "chunk_id": "0021700952_023", "order": 23, "role": "body", "text": "Suns: Visit Oklahoma City on Thursday."}
{"game_id": "0021700952", "chunk_id": "0021700952_024", "order": 24, "role": "body", "text": "Heat: Visit Washington on Tuesday."}
{"game_id": "0021700952", "chunk_id": "0021700952_026", "order": 26, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
