{"game_id": "0021701125", "chunk_id": "0021701125_001", "order": 1, "role": "lead", "text": "MIAMI --  No matter the opponent, there are two constant principles of the Miami Heat playoff philosophy."}
{"game_id": "0021701125", "chunk_id": "0021701125_004", "order": 4, "role": "body", "text": "There's no playoff berth to officially celebrate yet, but the Heat are getting into that postseason mode. Miami held Chicago to 37 percent shooting on the way to beating the Bulls 103-92 on Thursday night, pushing its home winning streak to a season-best eight games, and cutting the magic number for clinching a playoff spot to one."}
{"game_id": "0021701125", "chunk_id": "0021701125_005", "order": 5, "role": "body", "text": "\"I think we're pretty solid on defense right now,\" said Heat guard Josh Richardson, who led all scorers with 22 points. \"But it can be better.\""}
{"game_id": "0021701125", "chunk_id": "0021701125_006", "order": 6, "role": "body", "text": "Goran Dragic added 17 points for Miami, which got 13 from Justise Winslow and 11 from Kelly Olynyk. The Heat (41-35) moved within a half-game of Washington for the No. 6 spot in the Eastern Conference playoff race; the Wizards lost at Detroit earlier Thursday, an outcome that meant Miami will have to wait at least a couple more days to clinch."}
{"game_id": "0021701125", "chunk_id": "0021701125_007", "order": 7, "role": "body", "text": "\"I want to start the playoffs right away,\" Dragic said. \"But first, we need to take care of business and be professional.\""}
{"game_id": "0021701125", "chunk_id": "0021701125_008", "order": 8, "role": "body", "text": "The Heat need one more win or one more Detroit loss to wrap up their 20th postseason trip in 30 seasons. The Pistons are in New York on Saturday, in a game that should be over before the start of Miami's home game against Brooklyn."}
{"game_id": "0021701125", "chunk_id": "0021701125_009", "order": 9, "role": "body", "text": "Bulls center Robin Lopez was ejected after picking up a pair of technicals with 8:43 remaining, ending his 13-point, six-rebound night. The Bulls dropped their seventh straight, making this the third losing streak that lasted at least that long for Chicago this season."}
{"game_id": "0021701125", "chunk_id": "0021701125_010", "order": 10, "role": "body", "text": "Lopez had plenty to say to the officials as he walked off the floor, gesturing and pointing as he yelled his case."}
{"game_id": "0021701125", "chunk_id": "0021701125_011", "order": 11, "role": "body", "text": "\"I was emotional. I had a life reaction,\" Lopez said. \"I felt I was never given the time to cool down. I was making my way towards the bench and I was hit with that second T right away. I was a little caught off guard. ... It's not something I'm particularly ashamed of. I play with passion. If I do something I feel is wrong, I apologize for it. If not, I'll stand by it.\""}
{"game_id": "0021701125", "chunk_id": "0021701125_012", "order": 12, "role": "body", "text": "David Nwaba scored 15 points, Noah Vonleh added 14 points and 13 rebounds, and Bobby Portis ended up with 13 points and 16 rebounds for Chicago."}
{"game_id": "0021701125", "chunk_id": "0021701125_013", "order": 13, "role": "body", "text": "\"I thought we came out with greater effort,\" Bulls coach Fred Hoiberg said. \"We sustained it for the game. We did let it get away from us a little bit in the fourth quarter.\""}
{"game_id": "0021701125", "chunk_id": "0021701125_014", "order": 14, "role": "body", "text": "Miami led most of the way, trailing for only 14 seconds in the opening quarter. The Bulls didn't make it easy, getting within four late in the third and cutting what was a 19-point deficit down to 12 after Lopez's ejection."}
{"game_id": "0021701125", "chunk_id": "0021701125_015", "order": 15, "role": "body", "text": "But Olynyk answered with six straight points for Miami, part of a 48-point Heat bench effort."}
{"game_id": "0021701125", "chunk_id": "0021701125_016", "order": 16, "role": "body", "text": "Heat center Hassan Whiteside returned from a nine-game absence with a hip problem, scoring eight points and grabbing seven rebounds in just under 20 minutes."}
{"game_id": "0021701125", "chunk_id": "0021701125_017", "order": 17, "role": "body", "text": "\"It's just good to have him back,\" Heat coach Erik Spoelstra said."}
{"game_id": "0021701125", "chunk_id": "0021701125_019", "order": 19, "role": "body", "text": "Bulls: Rookie forward Lauri Markkanen (elbow) got the night off. The Bulls are thinking that he can play in Orlando on Friday. ... Justin Holiday scored 13 for the Bulls."}
{"game_id": "0021701125", "chunk_id": "0021701125_020", "order": 20, "role": "body", "text": "Heat: Tyler Johnson left in the first half with a sprained right ankle. ... Thursday was the 22nd anniversary of Alonzo Mourning's career-high 50-point game for Miami."}
{"game_id": "0021701125", "chunk_id": "0021701125_022", "order": 22, "role": "body", "text": "Miami came in averaging 11.2 makes from 3-point range per game. The Heat went 7 for 27 from deep Thursday, and are 16 for 56 in their last two games."}
{"game_id": "0021701125", "chunk_id": "0021701125_024", "order": 24, "role": "body", "text": "Chicago beat Miami on Thursday, and then Miami beat Chicago. A couple miles from AmericanAirlines Arena, the Cubs topped the Marlins 8-4 in an opening day game that preceded the Heat victory over the Bulls."}
{"game_id": "0021701125", "chunk_id": "0021701125_026", "order": 26, "role": "body", "text": "The Bulls won four playoff series in 1997-98, Michael Jordan's final season in Chicago. They've won five playoff series in the 20 seasons since."}
{"game_id": "0021701125", "chunk_id": "0021701125_028", "order": 28, "role": "body", "text": "Bulls: Visit Orlando on Friday."}
{"game_id": "0021701125", "chunk_id": "0021701125_029", "order": 29, "role": "closing", "text": "Heat: Host Brooklyn on Saturday."}
