{"game_id": "0021701007", "chunk_id": "0021701007_001", "order": 1, "role": "lead", "text": "ATLANTA --  Welcome to the club, Russell Westbrook."}
{"game_id": "0021701007", "chunk_id": "0021701007_004", "order": 4, "role": "body", "text": "Westbrook became the fourth player in NBA history to record 100 triple-doubles and sparked a 16-0 run down the stretch that carried the Oklahoma City Thunder to their fourth straight victory, 119-107 over the Atlanta Hawks on Tuesday night."}
{"game_id": "0021701007", "chunk_id": "0021701007_005", "order": 5, "role": "body", "text": "Westbrook scored 32 points, dished out 12 assists and grabbed 12 rebounds , joining an exclusive group that includes Oscar Robertson (181 triple-doubles), Magic Johnson (138) and Jason Kidd (107)."}
{"game_id": "0021701007", "chunk_id": "0021701007_006", "order": 6, "role": "body", "text": "\"Oh man, just an unbelievable blessing,\" Westbrook said. \"I give thanks to the man above just for allowing me to go out and play the game I love each and every night. I never take it for granted.\""}
{"game_id": "0021701007", "chunk_id": "0021701007_007", "order": 7, "role": "body", "text": "He became the third-fastest player to reach the milestone. Robertson needed just 277 games to get No. 100, while Magic Johnson accomplished the feat in his 656th game. Westbrook had played 736 games in his career."}
{"game_id": "0021701007", "chunk_id": "0021701007_008", "order": 8, "role": "body", "text": "\"The group of guys that's ahead are Hall of Famers,\" Westbrook said. \"I'm just happy to be a part of the crew with those guys.\""}
{"game_id": "0021701007", "chunk_id": "0021701007_009", "order": 9, "role": "body", "text": "Atlanta's Taurean Prince knocked down a 3-pointer to tie it at 103 with 5:15 remaining. Led by Westbrook and Jerami Grant, the Thunder dominated the rest of the way."}
{"game_id": "0021701007", "chunk_id": "0021701007_010", "order": 10, "role": "body", "text": "Westbrook scored seven points, getting to the line over and over again, while Grant knocked down a 3 and converted a three-point play -- both off assists by Westbrook. Carmelo Anthony capped the deciding run with his sixth 3-pointer of the game."}
{"game_id": "0021701007", "chunk_id": "0021701007_011", "order": 11, "role": "body", "text": "Westbrook received a big cheer from the Atlanta crowd when he grabbed his 10th rebound with 2:38 remaining, locking up the historic triple-double."}
{"game_id": "0021701007", "chunk_id": "0021701007_012", "order": 12, "role": "body", "text": "Anthony finished with 21 points, while Grant chipped in with 20, helping to make up for the loss of Paul George with a groin injury."}
{"game_id": "0021701007", "chunk_id": "0021701007_013", "order": 13, "role": "body", "text": "Having accepted a complementary role on a team that belongs to Westbrook, Anthony is reveling in the accomplishments of his teammate."}
{"game_id": "0021701007", "chunk_id": "0021701007_014", "order": 14, "role": "body", "text": "\"What it takes to do that on a night-in, night-out basis, the focus that you have to have, the intensity that you have to play with,\" Anthony said. \"For me, being able to be a part of that, be alongside him, it's a special moment. It's something that we should all appreciate, moments like this, and appreciate what we have and who we have.\""}
{"game_id": "0021701007", "chunk_id": "0021701007_015", "order": 15, "role": "body", "text": "Prince led the Hawks with 25 points."}
{"game_id": "0021701007", "chunk_id": "0021701007_016", "order": 16, "role": "body", "text": "But Atlanta, which lost its fourth straight game and remains tied with Orlando for the worst record in the Eastern Conference, had no answer for Westbrook."}
{"game_id": "0021701007", "chunk_id": "0021701007_017", "order": 17, "role": "body", "text": "\"We really wanted to show him a crowd, show him a lot of bodies,\" coach Mike Budenholzer said. \"When Carmelo started hitting those 3s, that hurt a lot, when he started teeing them up. Then you feel a little hesitant to show a crowd, and Westbrook's starting to get a little more penetration, getting more to the rim, getting to the free-throw line more. That's why they're a good team.\""}
{"game_id": "0021701007", "chunk_id": "0021701007_019", "order": 19, "role": "body", "text": "Thunder: George went down hard on a foul in the third quarter, landing awkwardly, and didn't play at all in the final period. Coach Billy Donovan said he will be re-evaluated on Wednesday to determine the extent of the groin injury, but stressed that the Thunder would be cautious with his treatment and recovery. George finished with 12 points. ... Center Steven Adams sat out the game with a left hip contusion. Dakari Johnson started in his place but played just seven minutes, scoring three points with two rebounds."}
{"game_id": "0021701007", "chunk_id": "0021701007_020", "order": 20, "role": "body", "text": "Hawks: Budenholzer received a technical foul for complaining about a no-call late in the first quarter. He took several steps onto the court, continuing to gripe, until referee Nick Buchert finally cut him off: \"Mike, you've made your point.\" ... The Hawks outrebounded the Thunder 47-38. ... Damion Lee had 13 points in his NBA debut after signing a 10-day contract earlier in the day. ... After trailing by 11 early in the game, Atlanta bounced back to lead 66-54 at halftime. But the Thunder erased the deficit in the first 4 1/2 minutes of the third quarter."}
{"game_id": "0021701007", "chunk_id": "0021701007_022", "order": 22, "role": "body", "text": "With the Hawks in the midst of a massive rebuilding job, it definitely helps to keep a roster handy."}
{"game_id": "0021701007", "chunk_id": "0021701007_023", "order": 23, "role": "body", "text": "That's about the only way to keep up with an ever-changing lineup."}
{"game_id": "0021701007", "chunk_id": "0021701007_024", "order": 24, "role": "body", "text": "At one point in the second quarter, the Hawks sent out a group that included three first-year players -- Lee, John Collins and Tyler Dorsey -- along with Isaiah Taylor, who had played all of four NBA games before this season. Dewayne Dedmon was the only experienced player on the court."}
{"game_id": "0021701007", "chunk_id": "0021701007_026", "order": 26, "role": "body", "text": "Thunder: Return home to face the Los Angeles Clippers on Friday."}
{"game_id": "0021701007", "chunk_id": "0021701007_027", "order": 27, "role": "body", "text": "Hawks: Host the Charlotte Hornets on Thursday before beginning a West Coast road trip."}
{"game_id": "0021701007", "chunk_id": "0021701007_029", "order": 29, "role": "body", "text": "Follow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 . His work can be found at https://apnews.com/search/paul%20newberry"}
{"game_id": "0021701007", "chunk_id": "0021701007_031", "order": 31, "role": "closing", "text": "For more AP NBA coverage: https://apnews.com/tag/NBAbasketball"}
