{"game_id": "0021400399", "chunk_id": "0021400399_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  The schedule maker hasn't been kind to the Los Angeles Clippers in December. Still, they have found a way to win some narrow victories against tough opponents."}
{"game_id": "0021400399", "chunk_id": "0021400399_002", "order": 2, "role": "body", "text": "Chris Paul scored nine of his 27 points in the final 4:04 and Blake Griffin added 24 to lead the Los Angeles Clippers to a 106-102 victory over the Milwaukee Bucks on Saturday night."}
{"game_id": "0021400399", "chunk_id": "0021400399_003", "order": 3, "role": "body", "text": "\"We've been struggling a little bit lately, so after a tough loss last night and then going on a tough road trip to San Antonio and Atlanta after this game, we really needed to get this one,\" Paul said."}
{"game_id": "0021400399", "chunk_id": "0021400399_004", "order": 4, "role": "body", "text": "\"We don't have time to practice. We don't have two days between games this entire month. But you've got to get through it, because the other teams aren't feeling sorry for us. Everybody's gunning for us, anyway. So we've got to impose our will early.\""}
{"game_id": "0021400399", "chunk_id": "0021400399_005", "order": 5, "role": "body", "text": "Griffin, coming off back-to-back 30-point games, picked up his third foul with 5:41 left in the half and the Clippers trailing 42-38. But he made a critical tip-in of Paul's missed 20-footer with 5 seconds to play."}
{"game_id": "0021400399", "chunk_id": "0021400399_006", "order": 6, "role": "body", "text": "There were eight lead changes in the fourth before Brandon Knight's 3-pointer tied it 102-102 with 1:29 to play. Paul regained the lead for the Clippers with two free throws, and Knight missed a 3-point shot at the other end. Former Clipper Jared Dudley grabbed the offensive rebound, and the Bucks took a timeout before Knight missed a 21-footer with 31 seconds to play."}
{"game_id": "0021400399", "chunk_id": "0021400399_007", "order": 7, "role": "body", "text": "Milwaukee had one more chance to pull it out after Griffin's clutch tip-in, but Khris Middleton missed a desperation 3-pointer as time expired."}
{"game_id": "0021400399", "chunk_id": "0021400399_008", "order": 8, "role": "body", "text": "\"The big thing is that we didn't go away. We kept fighting,\" coach Jason Kidd said. \"Guys were making plays for one another and sharing the ball. We just couldn't convert.\""}
{"game_id": "0021400399", "chunk_id": "0021400399_009", "order": 9, "role": "body", "text": "Giannis Antetokounmpo led Milwaukee with 18 points and nine rebounds. The Bucks got double-digit scoring from four of their reserves. Dudley and Jerryd Bayless each had 16 points as the Bucks' bench outscored the Clippers' bench 59-23."}
{"game_id": "0021400399", "chunk_id": "0021400399_010", "order": 10, "role": "body", "text": "\"Their bench played a lot of minutes,\" Clippers coach Doc Rivers said. \"When your bench players play more minutes than the starters, they are going to score more than the starters. Their bench was good, and they played 10 guys. It's fun to watch the Bucks play because they are very young, they run around and spread the floor.\""}
{"game_id": "0021400399", "chunk_id": "0021400399_011", "order": 11, "role": "body", "text": "Trailing by nine with 5:24 left in the third quarter, the Clippers entered the fourth down 83-82 after 3-pointers by Paul, Jamal Crawford and J.J. Redick during a 3:15 span. Redick finished with 23 points."}
{"game_id": "0021400399", "chunk_id": "0021400399_012", "order": 12, "role": "body", "text": "The Bucks led 52-50 at halftime, although no one had more than nine points. They Bucks took a 52-42 lead on Kendall Marshall's 17-footer with 1:12 left in the second quarter before the Clippers responded with seven straight points."}
{"game_id": "0021400399", "chunk_id": "0021400399_015", "order": 15, "role": "body", "text": "Bucks: O.J. Mayo, who played at USC, missed his first five shots and finished with three points in 23 minutes. ... C Larry Sanders scored 10 points. He missed Thursday's 108-107 win at Sacramento because of a one-game suspension for pushing Portland's Nicolas Batum from behind as he elevated toward the basket. ... No one on the team has had 10 assists in a game since opening night, when Knight had 13 in an overtime loss at Charlotte. ... Knight finished with eight points, ending his streak of four consecutive games with 20 or more -- one shy of his career best from December 2012. ... Bayless, who has made 50 of 51 free throws this season, did not get to the foul line. The seven-year veteran finished last season with a career-worst 79.7 percentage."}
{"game_id": "0021400399", "chunk_id": "0021400399_016", "order": 16, "role": "body", "text": "Clippers: C DeAndre Jordan 16 rebounds and nine points. He rejected an attempted layup by Mayo with 22 seconds left in the second quarter, extending his streak to 15 games with at least one blocked shot. ... Reserve C Spencer Hawes, who had a career-high 17 rebounds against Milwaukee on March 27, 2013 while playing for Philadelphia, missed his fifth straight game because of a because of a bruised left knee."}
{"game_id": "0021400399", "chunk_id": "0021400399_018", "order": 18, "role": "body", "text": "Bucks: Host Charlotte on Tuesday."}
{"game_id": "0021400399", "chunk_id": "0021400399_019", "order": 19, "role": "closing", "text": "Clippers: At San Antonio on Monday."}
