{"game_id": "0021700134", "chunk_id": "0021700134_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- The last time the Minnesota Timberwolves won four games in a row was five years ago, when Karl-Anthony Towns was just a junior in high school.\nThe Wolves are growing up fast, without much of the pains of past few seasons.\nTowns had 31 points and 12 rebounds, Andrew Wiggins added 23 points on 9-for-14 shooting and the Timberwolves used a season-high 33 assists to beat the floundering Dallas Mavericks 112-99 on Saturday night for their first four-game winning streak since Dec. 7-15, 2012.\n\"It's just one of many,\" Towns said, \"and hopefully four will seem like a little bit to us. It'll seem something like we're having a bad season if we're only getting four in a row at some point.\"\nHolding Mavericks star Harrison Barnes scoreless in the second half, the Wolves enjoyed a blowout for once after the margin of their previous five victories totaled just 17 points. They played so well they still won by 13 points despite lapsing in a fourth quarter won by the Mavericks 30-19 to make notoriously demanding coach Tom Thibodeau uncomfortable.\n\"Obviously, it's better than losing,\" he said, \"but the big thing is for us to concentrate on improving.\"\nEven Thibodeau had plenty of compliments afterward, though.\nComing off a career-low two points Wednesday at New Orleans, when foul trouble against bulwarks DeMarcus Cousins and Anthony Davis limited him to 22 minutes, Towns responded like the Timberwolves needed him to and thought he would. He had seven points and two rebounds during a 13-0 run late in the third quarter that pushed their lead to 25 points.\n\"The situation was more in my favor today,\" Towns said. \"I was able to go out there and play my game.\"\nBarnes finished with 17 points for the Mavericks, who have the worst record in the NBA and their first 1-10 start since the 1993-94 season when they staggered out of the gate at 1-23 and finished 13-69.\n\"They've got a lot of good defenders that they can put on him,\" said coach Rick Carlisle, who kept Barnes on the bench in the fourth. \"Look, we just didn't do a good job moving the ball to start the second half, either. So some of that's on us. Some of it's on me. I've got to get him some better looks.\"\nWith franchise cornerstone Dirk Nowitzki not the same as his younger self, the Mavericks been relying heavily on their bounty of point guards. Rookie Dennis Smith Jr. had 18 points and Devin Harris (15 points) and J.J. Barea (14 points) provided a few sparks off the bench, but there's just not enough production to be found. The Mavericks entered the game with the third-lowest scoring average in the league.\n\"We have to bear down, collectively, and come with the energy and effort,\" Barnes said. \"Our starts in the first and the third have been problematic for us all season.\"\nBUTLER DID IT\nThe Wolves improved to 6-1 with linchpin Jimmy Butler on the floor, having lost both games the tenacious, versatile small forward missed with a virus, and the upside to this one was he finished with a season-low four points. He had five rebounds and seven assists.\n\"When I feel like it's my time to shoot, I'll shoot it. But as of right now, my teammates are rolling,\" Butler said. \"Feed them. Let them get us going.\"\nWORK, BENCH\nTaj Gibson picked up some slack with 12 points and 10 rebounds, and Jeff Teague had 11 points and 10 assists. The reserves, playing as a five-man unit for long stretches, contributed often, too. Nemanja Bjelica and Tyus Jones each sank a pair of 3-pointers in the second quarter. Jamal Crawford used a shake-and-bake move for a 20-foot pull-up jumper he swished for a 90-62 lead that was the largest of the game for the Wolves.\nROUGH ROAD AHEAD\nThe Mavericks might have to wait a while longer for that next win. Their next 10 games include two matchups each with Oklahoma City and San Antonio and one against Cleveland, and all but one of them are against teams that made the playoffs last season. The Timberwolves, who visit Dallas on Nov. 17, are the only outlier.\nTIP-INS\nMavericks: Nowitzki had seven points on 3-for-8 shooting in 22 minutes. ... Salah Mejri started at center for the first time this season. The 7-foot-2 Tunisian, who had 13 rebounds and five blocks against the Pelicans, went scoreless in nine minutes while picking up three fouls.\nTimberwolves: Bjelica is second in the NBA in 3-point shooting, behind Oklahoma City's Raymond Felton. He's the only player on the team with at least one make from behind the arc in all nine games this season. ... The Wolves have attempted more free throws than their opponent in all nine games.\nUP NEXT\nMavericks: Travel to Washington to play the Wizards on Tuesday night, their only game in the next six days before hosting the defending Eastern Conference champion Cleveland Cavaliers next weekend.\nTimberwolves: Stay home for the second half of a back-to-back set, hosting the Charlotte Hornets on Sunday night before a road trip to face the defending NBA champion Golden State Warriors on Wednesday night.\n---\nFor more AP NBA coverage: https://apnews.com/tags/NBAbasketball"}
