{"game_id": "0021700666", "chunk_id": "0021700666_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Portland's home court was once one of the NBA's toughest for visitors -- but was a source of frustration for the Trail Blazers earlier this season."}
{"game_id": "0021700666", "chunk_id": "0021700666_002", "order": 2, "role": "body", "text": "But they appear to have their home mojo back, as the Blazers won their fifth consecutive home game Thursday night, beating the Indiana Pacers 100-86."}
{"game_id": "0021700666", "chunk_id": "0021700666_003", "order": 3, "role": "body", "text": "Damian Lillard scored 26 points and Jusuf Nurkic had 19 points and a season-high 17 rebounds to lead Portland (24-21). C.J. McCollum scored 16 points and Shabazz Napier 13 for the Blazers."}
{"game_id": "0021700666", "chunk_id": "0021700666_004", "order": 4, "role": "body", "text": "Just six weeks ago, the Blazers lost six consecutive games during a late-November, early December stretch. But starting Dec. 28 with a victory over Philadelphia, Portland has returned to its winning ways in Moda Center."}
{"game_id": "0021700666", "chunk_id": "0021700666_005", "order": 5, "role": "body", "text": "\"Overall our team has just locked in a little bit more,\" Lillard said. \"We had a rough stretch. We're not the first team or the last team that'll have that. The important thing when you have times like that is to stay together and stay with it. I think we're just in a better place on the floor as a group.\""}
{"game_id": "0021700666", "chunk_id": "0021700666_006", "order": 6, "role": "body", "text": "Several wins during this streak looked like Thursday's, a game in which Portland had most of the answers during the fourth quarter. Tied at 74 after three quarters, the Blazers outscored Indiana 26-12 during the final period to pull out the win."}
{"game_id": "0021700666", "chunk_id": "0021700666_007", "order": 7, "role": "body", "text": "\"In the third quarter, I thought we gave them a lot of opportunities,\" Portland coach Terry Stotts said. \"In the fourth quarter, it was good to see the lead expand without having very many mistakes.\""}
{"game_id": "0021700666", "chunk_id": "0021700666_008", "order": 8, "role": "body", "text": "Portland took control late in the third quarter, when the Blazers held Indiana scoreless for more than five minutes. It was part of Portland's 21-2 run, during which Shabazz Napier scored eight points to help erase a six-point deficit and give the Blazers an 89-76 lead midway through the fourth quarter."}
{"game_id": "0021700666", "chunk_id": "0021700666_009", "order": 9, "role": "body", "text": "Napier kick-started the rally during the final seconds of the third quarter, when he made a backcourt steal, then hit a corner 3-pointer as time expired to tie the game at 74."}
{"game_id": "0021700666", "chunk_id": "0021700666_010", "order": 10, "role": "body", "text": "Victor Oladipo and Darren Collison scored 23 points each for Indiana (24-21)."}
{"game_id": "0021700666", "chunk_id": "0021700666_011", "order": 11, "role": "body", "text": "Indiana coach Nate McMillan had an eye on the stat sheet in assessing what went wrong for the Pacers. Portland outrebounded Indiana 57-46, and scored 24 second-chance points to the Pacers' 10."}
{"game_id": "0021700666", "chunk_id": "0021700666_012", "order": 12, "role": "body", "text": "\"That's the hustle game you have to win,\" McMillan said. \"We have to give help to our bigs down in the paint. They outworked us, and won that game.\""}
{"game_id": "0021700666", "chunk_id": "0021700666_013", "order": 13, "role": "body", "text": "Nurkic had one of his most productive games as a Blazer, missing his career high by three rebounds. Nurkic got going early, hitting his first three shots during the first five minutes. Stotts said he didn't recall running plays for Nurkic, saying he was doing it all on effort."}
{"game_id": "0021700666", "chunk_id": "0021700666_014", "order": 14, "role": "body", "text": "\"When he got in the paint, he was finishing early,\" Lillard said of Nurkic. \"He played strong. Even on the defensive end, he was contesting shots at the rim. . When he plays that way on both ends, we're a much better team.\""}
{"game_id": "0021700666", "chunk_id": "0021700666_015", "order": 15, "role": "body", "text": "Indiana was without forward Myles Turner, the team's second-leading scorer this season. Turner has missed five consecutive games with a right elbow injury."}
{"game_id": "0021700666", "chunk_id": "0021700666_016", "order": 16, "role": "body", "text": "McCollum sprinted from the floor to the locker room early in the fourth quarter with a brief bout of nausea, but returned a few minutes later."}
{"game_id": "0021700666", "chunk_id": "0021700666_017", "order": 17, "role": "body", "text": "Portland led 52-47 at halftime, and the difference was a pair of buzzer-beaters: McCollum's 3-pointer at the end of the first quarter, and Lillard's desperation layup off a drive to finish the second quarter."}
{"game_id": "0021700666", "chunk_id": "0021700666_019", "order": 19, "role": "body", "text": "Pacers: The last time Indiana won in Portland was Nov. 28, 2007. ... Of the 12 games Turner has missed this season, two came against Portland. ... Lance Stephenson missed the team's morning shootaround with an illness, but played. He finished with no points on 0-of-6 shooting from the floor and missed both of his foul shots. ... Indiana is 2-1 on its current five-game road trip, having won at Phoenix and Utah."}
{"game_id": "0021700666", "chunk_id": "0021700666_020", "order": 20, "role": "body", "text": "Trail Blazers: Led by 12 boards from Nurkic, Portland outrebounded Indiana 29-18 in the first half. ... Nurkic had a double-double in the first half with 12 points and 12 rebounds. ... Portland swept the season series from Indiana for the third time in four seasons. The Blazers won 114-96 over the Pacers on Oct. 20. ... Al-Farouq Aminu is averaging 13 points and 10 rebounds in his last four games against Indiana."}
{"game_id": "0021700666", "chunk_id": "0021700666_022", "order": 22, "role": "body", "text": "Portland won despite shooting just 39.4 percent from the floor (37 of 94), and 31.2 percent from 3-point range (10 of 32). Only once has Portland shot worse and won a game this season."}
{"game_id": "0021700666", "chunk_id": "0021700666_023", "order": 23, "role": "body", "text": "The Blazers made up for it in other ways, like free throw shooting. They were 16 of 16, the third time they've been perfect from the line in a game this season, an NBA high. The Blazers also converted 14 offensive rebounds into 24 second-chance points."}
{"game_id": "0021700666", "chunk_id": "0021700666_025", "order": 25, "role": "body", "text": "Pacers: at Los Angeles Lakers on Friday night."}
{"game_id": "0021700666", "chunk_id": "0021700666_026", "order": 26, "role": "closing", "text": "Trail Blazers: home against Dallas on Saturday."}
