{"game_id": "0021200212", "chunk_id": "0021200212_001", "order": 1, "role": "lead", "text": "ATLANTA --  After an atrocious 1-for-10 night at the free-throw line last week, Al Horford decided to spend extra time working on his foul shots."}
{"game_id": "0021200212", "chunk_id": "0021200212_002", "order": 2, "role": "body", "text": "\"That's one of the things I always work on, and I got away from it a little bit,\" he said. \"I think it showed when I went in that little slump.\""}
{"game_id": "0021200212", "chunk_id": "0021200212_003", "order": 3, "role": "body", "text": "His recent effort seems to have paid off."}
{"game_id": "0021200212", "chunk_id": "0021200212_004", "order": 4, "role": "body", "text": "Horford scored 17 points and hit two clinching free throws to help the Atlanta Hawks win their sixth straight game with a 94-91 victory over the Charlotte Bobcats on Wednesday night."}
{"game_id": "0021200212", "chunk_id": "0021200212_005", "order": 5, "role": "body", "text": "Josh Smith and Lou Williams also had 17 points apiece for the Hawks."}
{"game_id": "0021200212", "chunk_id": "0021200212_006", "order": 6, "role": "body", "text": "Ben Gordon scored 20 of his 26 points in the fourth quarter and Ramon Sessions had 18 to lead Charlotte, which has lost two straight and three of four."}
{"game_id": "0021200212", "chunk_id": "0021200212_007", "order": 7, "role": "body", "text": "Gordon's straightaway 3-pointer with 29.1 seconds remaining cut Atlanta's lead to 92-91. The Bobcats got the ball back, but Sessions' inbounds pass from the left sideline was ruled a turnover after the officials watched replays and concluded neither Gordon nor Smith touched the ball, which bounced out of bounds on the other side of the court with 5.2 seconds to go."}
{"game_id": "0021200212", "chunk_id": "0021200212_008", "order": 8, "role": "body", "text": "\"I think if I would've touched the ball, it would've gone in a different direction, which it didn't,\" Smith said. \"It was a good call by the referees.\""}
{"game_id": "0021200212", "chunk_id": "0021200212_009", "order": 9, "role": "body", "text": "Horford, who finished with 11 rebounds, followed with two free throws 1.1 seconds later. Before hitting all three foul shots against Charlotte, Horford had missed 11 of his previous 12 attempts."}
{"game_id": "0021200212", "chunk_id": "0021200212_010", "order": 10, "role": "body", "text": "\"I've been working on a lot and watching myself the way I'm shooting it,\" he said. \"Now I feel confident, and tonight was big for me to make those shots.\""}
{"game_id": "0021200212", "chunk_id": "0021200212_011", "order": 11, "role": "body", "text": "In the fourth quarter, Gordon was 5 of 7 on 3s and hit all five free throws he attempted, but he wasn't able to give Charlotte the lead."}
{"game_id": "0021200212", "chunk_id": "0021200212_012", "order": 12, "role": "body", "text": "\"I just tried to be aggressive and force the issue a little bit,\" Gordon said. \"My teammates did a good job of finding me. That was pretty much it. It was a good night, but I much prefer to get the W.\""}
{"game_id": "0021200212", "chunk_id": "0021200212_013", "order": 13, "role": "body", "text": "With Gordon covered in the final seconds, Byron Mullens missed a 3 that would've tied the score at the buzzer. Horford was covering him tightly on the perimeter and challenged the shot."}
{"game_id": "0021200212", "chunk_id": "0021200212_014", "order": 14, "role": "body", "text": "\"The look was awesome, couldn't really ask for anything better,\" Mullens said. \"I knew I was guarded, but the shot felt great. It felt like I got hit a little bit on the arm, so I kind of over-pressed it and it hit the back iron.\""}
{"game_id": "0021200212", "chunk_id": "0021200212_015", "order": 15, "role": "body", "text": "The Bobcats were coming off 114-69 loss -- the worst in franchise history -- on Monday at Oklahoma City, but they led at the 2:34 mark of the second quarter when Michael Kidd-Gilchrist's layup ended an 18-2 run that put Charlotte up 42-35."}
{"game_id": "0021200212", "chunk_id": "0021200212_016", "order": 16, "role": "body", "text": "By the 7:11 mark of the third, the Hawks led for good after Horford's three-point play made it 52-51."}
{"game_id": "0021200212", "chunk_id": "0021200212_017", "order": 17, "role": "body", "text": "Smith, who finished with a game-high 13 rebounds, was the catalyst for most of the third, scoring 13 points on 5-for-7 shooting and getting four rebounds, two steals and a blocked shot."}
{"game_id": "0021200212", "chunk_id": "0021200212_018", "order": 18, "role": "body", "text": "\"Just being active, being around the basketball, creating plays for myself and others, being patient and then when the opportune time comes for me to be aggressive, I took advantage of it,\" Smith said. \"It wasn't necessarily play calls. It was just me being patient and playing to the flow of the offense.\""}
{"game_id": "0021200212", "chunk_id": "0021200212_019", "order": 19, "role": "body", "text": "Kemba Walker scored 15 points and Brendan Haywood pulled down 11 rebounds for the Bobcats."}
{"game_id": "0021200212", "chunk_id": "0021200212_020", "order": 20, "role": "body", "text": "Horford is pleased that the Hawks' reshaped roster, which includes the additions of veterans such as Williams, Kyle Korver, Devin Harris, DeShawn Stevenson and Anthony Morrow, isn't playing like recent Atlanta teams that often squandered games against less-talented opponents."}
{"game_id": "0021200212", "chunk_id": "0021200212_021", "order": 21, "role": "body", "text": "\"These games, in the past, one of them we would've dropped if we didn't come out with enough energy and little things like that,\" Horford said. \"I think this year we're doing a good job even though it's closer than we would like. But we're getting the wins.\""}
{"game_id": "0021200212", "chunk_id": "0021200212_022", "order": 22, "role": "closing", "text": "Game notes Korver left with back spasms in the third and didn't return. ... Bobcats C Bismack Biyombo, returning after missing the last two games with a bruise on his lower left leg, finished with six points and eight rebounds in 27 minutes. ... Harris, playing for the first time since spraining his left big toe in last Friday's win at Charlotte, had seven points and four assists."}
