{"game_id": "0021701070", "chunk_id": "0021701070_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Their playoff hopes fading after a deflating loss a night earlier, the Los Angeles Clippers were desperate for a win."}
{"game_id": "0021701070", "chunk_id": "0021701070_002", "order": 2, "role": "body", "text": "\"We've got to be one team, one unit and play with high energy and compete,\" Austin Rivers said. \"Let's play harder than the other team.\""}
{"game_id": "0021701070", "chunk_id": "0021701070_003", "order": 3, "role": "body", "text": "DeAndre Jordan had 25 points and 22 rebounds, Rivers scored 22 and made a key late 3-pointer, and the Clippers beat the Milwaukee Bucks 127-120 on Wednesday night."}
{"game_id": "0021701070", "chunk_id": "0021701070_004", "order": 4, "role": "body", "text": "Milwaukee lost All-Star forward Giannis Antetokounmpo to a sprained ankle in the first half. He appeared to get hurt when he tripped over teammate Shabazz Muhammad under Milwaukee's basket. He stayed in the game for a brief period, but hobbled around the court while grimacing. He went to the locker room with about four minutes remaining in the second quarter and did not return."}
{"game_id": "0021701070", "chunk_id": "0021701070_005", "order": 5, "role": "body", "text": "Bucks coach Joe Prunty said after the game that the team didn't have an update on Antetokounmpo's condition."}
{"game_id": "0021701070", "chunk_id": "0021701070_006", "order": 6, "role": "body", "text": "Lou Williams scored 19 points and Tobias Harris had 18 for Los Angeles, which had a players-only meeting after its 123-109 loss to Minnesota on Tuesday night."}
{"game_id": "0021701070", "chunk_id": "0021701070_007", "order": 7, "role": "body", "text": "\"We aren't going to go out like this,\" Rivers said. \"No more bickering. No more questioning each other and the coaches.\""}
{"game_id": "0021701070", "chunk_id": "0021701070_008", "order": 8, "role": "body", "text": "Coach Doc Rivers, Austin's father, said his team showed high energy from the outset."}
{"game_id": "0021701070", "chunk_id": "0021701070_009", "order": 9, "role": "body", "text": "The Clippers shot 60 percent and used a late 13-0 run to take a 38-24 lead after the first quarter. Jordan had 14 points and 10 rebounds in the quarter."}
{"game_id": "0021701070", "chunk_id": "0021701070_010", "order": 10, "role": "body", "text": "\"The first seven minutes of basketball was as well as we've played all year,\" Rivers said."}
{"game_id": "0021701070", "chunk_id": "0021701070_011", "order": 11, "role": "body", "text": "Khris Middleton paced Milwaukee with 23 points. Jabari Parker added a season-high 20 in 30 minutes, the most he's played since rejoining the team in early February after recovering from a second ACL tear in his left knee."}
{"game_id": "0021701070", "chunk_id": "0021701070_012", "order": 12, "role": "body", "text": "Antetokounmpo, who had 37 points in a loss at Cleveland on Monday, had 12 points before departing."}
{"game_id": "0021701070", "chunk_id": "0021701070_013", "order": 13, "role": "body", "text": "\"He's our main guy,\" Middleton said. \"We missed the attention he creates on the offensive end. We're a team, though, so when he goes out we can't give up. We know what we can do as a team and tonight we just didn't do it.\""}
{"game_id": "0021701070", "chunk_id": "0021701070_014", "order": 14, "role": "body", "text": "The Bucks trailed by seven at the half. Playing without Antetokounmpo, the deficit grew to 14 by the end of the third quarter as the Clippers built a 97-83 lead. Los Angeles shot 6 of 10 from 3-point range in the quarter."}
{"game_id": "0021701070", "chunk_id": "0021701070_015", "order": 15, "role": "body", "text": "The Clippers maintained a double-digit lead for most of the fourth quarter until Milwaukee clawed close late. A layup by Middleton and Thon Maker's dunk off a turnover cut the lead to four with 1:14 remaining. Rivers then nailed a contested 3-pointer from the corner with the shot clock winding down to extend the lead to seven."}
{"game_id": "0021701070", "chunk_id": "0021701070_016", "order": 16, "role": "body", "text": "The Bucks got no closer than five in the final minute."}
{"game_id": "0021701070", "chunk_id": "0021701070_018", "order": 18, "role": "body", "text": "Rivers is convinced that the Bucks will be a tough matchup in the playoffs, assuming Antetokounmpo returns to full strength."}
{"game_id": "0021701070", "chunk_id": "0021701070_019", "order": 19, "role": "body", "text": "\"Their record doesn't show it, but if I'm in the East, I don't think anyone would look forward to playing them,\" Rivers said. \"That will be a hard series with whoever they end up playing.\""}
{"game_id": "0021701070", "chunk_id": "0021701070_021", "order": 21, "role": "body", "text": "With the Bucks set to move into a new arena next season, Rivers made what was likely his last visit to the Bradley Center. When asked if he had any fond memories, Rivers was far from emotional: \"No. We lost a series here to the Bucks when we were the favorite when I was with the Hawks. Other than that, I don't remember any at all. I played in The Mecca. I have some good memories there, but not many here.\""}
{"game_id": "0021701070", "chunk_id": "0021701070_023", "order": 23, "role": "body", "text": "Clippers: Jordan, whose streak of 15 or more rebounds ended at 10 games Tuesday night, pulled down 16 first-half boards, equaling the Bucks' team total. ... Tobias Harris showed no ill effects after battling the flu, even though Rivers expressed regret about playing him in Tuesday's loss. \"The way we played, you second-guess,\" Rivers said. \"I wish we wouldn't have played him, but he says he feels better.\""}
{"game_id": "0021701070", "chunk_id": "0021701070_024", "order": 24, "role": "body", "text": "Bucks: G Brandon Jennings was signed to a second 10-day contract. Jennings, Milwaukee's first-round pick in the 2009 draft, appeared in each of the Bucks' four games after signing his first 10-day contract on March 11. ... C Tyler Zeller returned after missing two consecutive games with sore ribs."}
{"game_id": "0021701070", "chunk_id": "0021701070_026", "order": 26, "role": "body", "text": "Clippers: At Indiana on Friday in the teams' first meeting this season."}
{"game_id": "0021701070", "chunk_id": "0021701070_027", "order": 27, "role": "body", "text": "Bucks: At Chicago on Friday. Milwaukee has lost two of three games to the Bulls."}
{"game_id": "0021701070", "chunk_id": "0021701070_029", "order": 29, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
