{"game_id": "0021300166", "chunk_id": "0021300166_001", "order": 1, "role": "lead", "text": "ATLANTA --  Josh Smith was glad to get past his homecoming."}
{"game_id": "0021300166", "chunk_id": "0021300166_002", "order": 2, "role": "body", "text": "Smith's former Atlanta teammates were glad to hang on for an ugly win."}
{"game_id": "0021300166", "chunk_id": "0021300166_003", "order": 3, "role": "body", "text": "Paul Millsap, signed in the offseason to replace Smith, had 19 points to steal the spotlight in Smith's return to Atlanta, leading the Hawks to a 93-85 win over the Detroit Pistons on Wednesday night."}
{"game_id": "0021300166", "chunk_id": "0021300166_004", "order": 4, "role": "body", "text": "Smith, who signed with Detroit after nine seasons with the Hawks, had 11 points while shooting 5 of 15 from the field."}
{"game_id": "0021300166", "chunk_id": "0021300166_005", "order": 5, "role": "body", "text": "\"I'm glad I got this one under my belt,\" Smith said. \"Now we can move on and just focus on playing basketball.\""}
{"game_id": "0021300166", "chunk_id": "0021300166_006", "order": 6, "role": "body", "text": "There was a mixed response for Smith in pregame introductions but only applause following a \"Thanks Josh Smith\" message on the video board during the first timeout."}
{"game_id": "0021300166", "chunk_id": "0021300166_007", "order": 7, "role": "body", "text": "\"It was what I expected, kind of,\" Smith said. \"Some cheering, a little bit of boos, but it's all good.\""}
{"game_id": "0021300166", "chunk_id": "0021300166_008", "order": 8, "role": "body", "text": "Smith called his return to his hometown \"kind of a surreal moment\" before the game."}
{"game_id": "0021300166", "chunk_id": "0021300166_009", "order": 9, "role": "body", "text": "Al Horford, Smith's former teammate, said \"it was different\" to have Smith wearing the Pistons' blue uniform on the Hawks' home court."}
{"game_id": "0021300166", "chunk_id": "0021300166_010", "order": 10, "role": "body", "text": "\"Josh was a teammate of mine for a long time and I know he felt it,\" Horford said. \"I felt it, too. There was a little nostalgia, I think you could say. But it was good. He's trying to move forward and so are we, but it was just good to see him.\""}
{"game_id": "0021300166", "chunk_id": "0021300166_011", "order": 11, "role": "body", "text": "The Hawks pulled away after leading 66-64 through three quarters. Jeff Teague scored 18 points and DeMarre Carroll had 11 points and a career-high 12 rebounds."}
{"game_id": "0021300166", "chunk_id": "0021300166_012", "order": 12, "role": "body", "text": "Pistons coach Maurice Cheeks was ejected with 2:36 remaining after complaining to an official during a timeout. Cheeks wouldn't reveal what he said that drew the two technical fouls and ejection."}
{"game_id": "0021300166", "chunk_id": "0021300166_013", "order": 13, "role": "body", "text": "\"Nothing. Just got `em,\" Cheeks said. \"I don't need to get fined!\""}
{"game_id": "0021300166", "chunk_id": "0021300166_014", "order": 14, "role": "body", "text": "Brandon Jennings led Detroit with 21 points. Rodney Stuckey had 18 before fouling out in the fourth quarter."}
{"game_id": "0021300166", "chunk_id": "0021300166_015", "order": 15, "role": "body", "text": "Each team showed signs of playing the second of back-to-back nights."}
{"game_id": "0021300166", "chunk_id": "0021300166_016", "order": 16, "role": "body", "text": "\"It's important during the season to find a way to win some ugly games and I think our group tonight found a way to do that, to find some energy when it probably wasn't easy for either group,\" Hawks coach Mike Budenholzer said."}
{"game_id": "0021300166", "chunk_id": "0021300166_017", "order": 17, "role": "body", "text": "Added Horford: \"It wasn't the prettiest game. We just made enough plays to win the game.\""}
{"game_id": "0021300166", "chunk_id": "0021300166_018", "order": 18, "role": "body", "text": "Millsap started after missing the Hawks' loss at Miami on Tuesday night with a sore right elbow.  Millsap, who made eight of 14 shots, said he wasn't motivated by comparisons with Smith."}
{"game_id": "0021300166", "chunk_id": "0021300166_019", "order": 19, "role": "body", "text": "\"I'm not Josh Smith,\" Millsap said. \"It didn't faze me at all. It wasn't about me. It's not about me.\""}
{"game_id": "0021300166", "chunk_id": "0021300166_020", "order": 20, "role": "body", "text": "Instead, it was about Smith for many fans and perhaps for the forward who had three steals and blocked two shots."}
{"game_id": "0021300166", "chunk_id": "0021300166_021", "order": 21, "role": "body", "text": "\"My teammates know how important the game is to me,\" Smith said before the game."}
{"game_id": "0021300166", "chunk_id": "0021300166_022", "order": 22, "role": "body", "text": "Asked what he has missed about his Atlanta hometown, Smith said: \"My house. And my mother's home cooking.\""}
{"game_id": "0021300166", "chunk_id": "0021300166_023", "order": 23, "role": "body", "text": "Smith missed a jump hook on the Pistons' first possession and then missed two 3-pointers before making a layup for his first field goal."}
{"game_id": "0021300166", "chunk_id": "0021300166_024", "order": 24, "role": "body", "text": "Smith wasn't the only player to struggle with poor shooting early. Each team shot under 30 percent in the first quarter. The Pistons led 46-43 at halftime before Atlanta took a 66-64 advantage into the final period."}
{"game_id": "0021300166", "chunk_id": "0021300166_025", "order": 25, "role": "body", "text": "Mike Scott scored nine of his 11 points in the fourth quarter. Teague had eight points in the final period."}
{"game_id": "0021300166", "chunk_id": "0021300166_026", "order": 26, "role": "closing", "text": "Game notes Kyle Korver has made a 3-pointer in 85 consecutive games, four shy of matching the NBA record set by Dana Barros (1994-96). Korver left the game in the first period with a left eye laceration. The cut did not require stitches and he returned early in the second period to make his first of two 3s. ... The Pistons were without G Chauncey Billups (left knee tendinitis), G Will Bynum (sore left hamstring) and F Charlie Villanueva (back). ... The teams play again Friday night at Detroit."}
