{"game_id": "0021400088", "chunk_id": "0021400088_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- With the game on the line, Brandon Knight thought back to his boyhood dreams.\nKnight converted a three-point play with 1.1 seconds remaining Saturday night to rally the Milwaukee Bucks to a 93-92 victory over Memphis, handing the Grizzlies their first loss of the season in seven games.\n\"It's what you dream about as a kid, being able to shoot that game-winning free throw, and it happened tonight,\" Knight said. \"I was able to knock it down and get a win for our team.\"\nZach Randolph's layup put Memphis ahead 91-90 with 1:29 remaining. With 15.6 seconds left, Bucks center Larry Sanders had his shot from underneath the basket blocked by Marc Gasol, with the ball initially going out of bounds to Milwaukee. After an officials' review, however, the ball was awarded to Memphis.\nMike Conley was fouled with 8 seconds remaining, but missed the first free throw and made the second to make it 92-90.\nOn the ensuing possession, Knight went to work from the top of the lane and scored on a drive down the left side, drawing a foul from Courtney Lee. Knight then hit the winning free throw.\nLee's long jumper at the buzzer from beyond the top of the key was off the mark.\nKnight's decisive move arose out of necessity because Memphis smothered the primary options on the play.\n\"We drew up a couple options,\" Knight said. \"The main thing was looking for O.J. (Mayo) coming off the second side, misdirection, (Jared) Dudley coming across the first side and they did a great job covering it, so from that point I just went to playing basketball.\"\nGiannis Antetokounmpo took advantage of his quickness against Randolph and took the ball to the basket, scoring 12 of his career-high 18 points in the fourth quarter. Knight added 14 and rookie Jabari Parker had 13.\n\"It was tough. He's a lot stronger than me, bigger than me,\" Antetokounmpo said. \"He was a mismatch for me on the defensive end, but I was a mismatch for him on the offensive end because he's bigger than me and much slower. And, I'm faster than him so I can drive the ball.\"\nRandolph had 22 points and 14 rebounds, and Gasol scored 18 for Memphis (6-1), which was off to the best start in franchise history. The loss left Golden State (5-0) as the only unbeaten team in the NBA.\n\"No positives. Not with this game,\" Randolph said. \"Giving up a three-point play when they're down two; a lot of mental mistakes. We can get better. We just have to keep pushing, stick together and get ready for the next one.\"\nThe Bucks, who trailed 72-66 after three quarters, scored the first seven points of the fourth and took a 73-72 lead on two free throws by Antetokounmpo.\nAntetokounmpo scored on a drive to put the Bucks up 90-89 with 2:23 remaining, but failed to convert a three-point play when he missed the free throw. Randolph's layup put Memphis back on top 91-90 with 1:29 left.\n\"We're trying as a team to play hard every night and put ourselves in a position to win,\" first-year Bucks coach Jason Kidd said. \"We're learning late-game execution. Sometimes the ball goes in, sometimes it doesn't and that's just part of basketball. But tonight's another step forward of getting that stop when we needed to.\"\nThe Grizzlies once again were hampered by limited production from their bench. Memphis entered the game last in the NBA with 19.3 points per game from its reserves, while Milwaukee was second at 45.3 points off the bench.\nLed by Antetokounmpo, the Bucks' backups contributed 46 points, while the Grizzlies got just 27 off the bench.\n\"They beat us to too many basketballs,\" Memphis coach Dave Joerger said. \"We had to play our guys big minutes last night and we played them big minutes tonight. We missed some shots. We just didn't get enough from other places.\"\n---\nTIP-INS\nGrizzlies: Joerger realizes his team's strong start could have playoff implications far down the road. \"We are in the West, so every game matters whether it's in November or March,\" Joerger said before the game. \"We learned that last year, having to come from behind throughout the course of the season and make up ground.\"\nBucks: Kidd continued to tinker with his starting lineup, reinserting Dudley, who had started the first five games before coming off the bench Friday in a 98-95 loss at Detroit. Kendall Marshall, who started against the Pistons, did not play.\nUP NEXT\nGrizzlies: Tuesday night vs. Los Angeles Lakers.\nBucks: Tuesday night vs. Oklahoma City.\nSTREAK SNAPPED\nThe Bucks ended a seven-game skid against Memphis dating to March 28, 2010, when Milwaukee posted a 108-103 overtime win at home.\nWESTERN SUCCESS\nThe game was the first this season for the Bucks against a Western Conference opponent. Last season, the Bucks went 3-27 against the West and did not win their first game against a Western Conference foe until Dec. 31.\nCHARITY BEGINS AT HOME\nMemphis stayed close throughout thanks to an overwhelming edge on free throws. The Grizzlies were 31 of 34 from the line, while the Bucks went 8 of 11."}
