{"game_id": "0021401103", "chunk_id": "0021401103_001", "order": 1, "role": "lead", "text": "ATLANTA --  Kyle Korver was unstoppable for 65 seconds."}
{"game_id": "0021401103", "chunk_id": "0021401103_002", "order": 2, "role": "body", "text": "The rest of the night, DeMarre Carroll carried the Atlanta Hawks."}
{"game_id": "0021401103", "chunk_id": "0021401103_003", "order": 3, "role": "body", "text": "Carroll scored 23 points in a dazzling all-around display Monday, leading the Hawks past the Milwaukee Bucks 101-88 and showing the kind of effort the top seed in the Eastern Conference wants over the final two weeks of the regular season."}
{"game_id": "0021401103", "chunk_id": "0021401103_004", "order": 4, "role": "body", "text": "\"We're trying to get our mojo back, get our momentum back going to the playoffs,\" said Carroll, who made 9 of 13 shots, grabbed eight rebounds, dished out five assists and blocked a pair of shots. \"We're trying to do something special here.\""}
{"game_id": "0021401103", "chunk_id": "0021401103_005", "order": 5, "role": "body", "text": "Korver sure was special in the third quarter, though it happened in the blink of eye."}
{"game_id": "0021401103", "chunk_id": "0021401103_006", "order": 6, "role": "body", "text": "He made deep jumpers on four straight possessions -- three of them beyond the arc to push what had been a five-point edge to 67-51. That brief stretch accounted for all of his 11 points in the game."}
{"game_id": "0021401103", "chunk_id": "0021401103_007", "order": 7, "role": "body", "text": "\"I'm glad I was here to witness it, so I can tell my kids about it,\" Carroll quipped. \"I've never seen anything like that before.\""}
{"game_id": "0021401103", "chunk_id": "0021401103_008", "order": 8, "role": "body", "text": "Korver, who has seemed uncomfortable playing with a protective mask since breaking his nose March 15, missed his first four shots -- all of them 3-pointers."}
{"game_id": "0021401103", "chunk_id": "0021401103_009", "order": 9, "role": "body", "text": "Then, suddenly, he found the range."}
{"game_id": "0021401103", "chunk_id": "0021401103_010", "order": 10, "role": "body", "text": "\"That was just frustration,\" Korver said. \"I'm so tired of wearing this mask. I can't wait for it to be over.\""}
{"game_id": "0021401103", "chunk_id": "0021401103_011", "order": 11, "role": "body", "text": "The Bucks made one more run, ripping off nine straight points. But Atlanta led 72-64 heading to the fourth and Milwaukee never seriously challenged the rest of the way, losing for the second time in three days to a conference leader. The Bucks fell at home to West-leading Golden State 108-95 on Saturday."}
{"game_id": "0021401103", "chunk_id": "0021401103_012", "order": 12, "role": "body", "text": "Milwaukee coach Jason Kidd was not pleased with his team's effort in this one."}
{"game_id": "0021401103", "chunk_id": "0021401103_013", "order": 13, "role": "body", "text": "\"When you play against the best in the East, you have to compete,\" he said. \"We didn't do that tonight. Offensively and defensively, there was not enough energy. That's what we've built our foundation on, and we just had another no-show tonight.\""}
{"game_id": "0021401103", "chunk_id": "0021401103_014", "order": 14, "role": "body", "text": "Having clinched the No. 1 seed last week, the Hawks are trying to maintain their playing edge while staying healthy for the final eight games of the regular season. This wasn't pretty -- they put up five airballs -- but it was enough to improve to 56-18, one win away from tying the franchise record."}
{"game_id": "0021401103", "chunk_id": "0021401103_015", "order": 15, "role": "body", "text": "While Carroll normally specializes in defense, calling himself the \"Junkyard Dog,\" he's clearly got some offensive skills as well."}
{"game_id": "0021401103", "chunk_id": "0021401103_016", "order": 16, "role": "body", "text": "\"I don't focus on offense as much as I should,\" he said. \"But my teammates were getting me open shots.\""}
{"game_id": "0021401103", "chunk_id": "0021401103_017", "order": 17, "role": "body", "text": "Giannis Antetokounmpo scored 18 to lead five Milwaukee players in double figures. Al Horford had 18 points for Atlanta."}
{"game_id": "0021401103", "chunk_id": "0021401103_019", "order": 19, "role": "body", "text": "Bucks: F Jared Dudley remained at home instead of taking the brief road trip to Atlanta. Dudley has been having lower back problems, and Kidd figured it was better to get some extra rest with the playoffs approaching. \"We would love to have everybody,\" Kidd said, \"but we're taking the precaution of leaving Duds, with his back, and not putting him on the plane to travel for one game.\" The coach said Dudley would be back at practice Tuesday and hopes he will be able to make a trip to Boston on Friday."}
{"game_id": "0021401103", "chunk_id": "0021401103_020", "order": 20, "role": "body", "text": "Hawks: Jeff Teague returned to the lineup after missing two games with a sprained left ankle. In fact, all five Atlanta starters were back on the court after sitting out Saturday's loss at Charlotte. ... Facing another back-to-back, Budenholzer was weighing whether to rest some of his regulars again on Tuesday. \"There's a lot of discussion and debate about how to best do it,\" he said."}
{"game_id": "0021401103", "chunk_id": "0021401103_022", "order": 22, "role": "body", "text": "The Hawks are trying to stay as healthy as possible for the playoffs, but they've been plagued by nagging injuries. The latest was sustained by backup point guard Dennis Schroder, the speediest player on the team and a key member of the rotation."}
{"game_id": "0021401103", "chunk_id": "0021401103_023", "order": 23, "role": "body", "text": "He injured a toe on his left foot and did not return after leaving with 9 1/2 minutes to go in the second quarter."}
{"game_id": "0021401103", "chunk_id": "0021401103_024", "order": 24, "role": "body", "text": "Budenholzer said the second-year player won't make the trip to Detroit for Tuesday's game, but had no additional information on how long Schroder might be out."}
{"game_id": "0021401103", "chunk_id": "0021401103_026", "order": 26, "role": "body", "text": "Bucks: Host Chicago on Wednesday."}
{"game_id": "0021401103", "chunk_id": "0021401103_027", "order": 27, "role": "body", "text": "Hawks: Play at the Pistons on Tuesday."}
{"game_id": "0021401103", "chunk_id": "0021401103_029", "order": 29, "role": "closing", "text": "Follow Paul Newberry on Twitter at www.twitter.com/pnewberry1963"}
