{"game_id": "0021700057", "chunk_id": "0021700057_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Eric Gordon and Ryan Anderson kept an eye on the TV in the Houston locker room, which was appropriately showing the World Series."}
{"game_id": "0021700057", "chunk_id": "0021700057_002", "order": 2, "role": "body", "text": "\"Justin Verlander is a neighbor of mine,\" Anderson said. \"He's obviously a clutch guy. The city is lucky to have him.\""}
{"game_id": "0021700057", "chunk_id": "0021700057_003", "order": 3, "role": "body", "text": "The Rockets' own Mr. October was pretty clutch in the NBA's version of the bottom of the ninth."}
{"game_id": "0021700057", "chunk_id": "0021700057_004", "order": 4, "role": "body", "text": "Gordon pumped-faked a lunging Joel Embiid, took one dribble, and then buried a 3 at the horn over an outstretched Embiid that completed a furious rally and lifted the Rockets to a 105-104 win over the Philadelphia 76ers on Wednesday night."}
{"game_id": "0021700057", "chunk_id": "0021700057_005", "order": 5, "role": "body", "text": "\"You've got to be prepared to try and knock down shots like that,\" Gordon said. \"You miss it, you miss it.\""}
{"game_id": "0021700057", "chunk_id": "0021700057_007", "order": 7, "role": "body", "text": "Gordon's winner from the corner gave Houston its only lead over the final 18 minutes and shook a 76ers team that made a series of bad plays and bad decisions down the stretch."}
{"game_id": "0021700057", "chunk_id": "0021700057_008", "order": 8, "role": "body", "text": "Embiid, who scored 21 points, did not shoot over the final 3:44. He was whistled for a goaltending that cut Houston's gap to three, and the Sixers' attempt to run down the clock backfired when Jerryd Bayless -- and not Embiid or Ben Simmons -- missed a shot with the game in the balance."}
{"game_id": "0021700057", "chunk_id": "0021700057_009", "order": 9, "role": "body", "text": "\"I think that we let one slip. Some of it was luck,\" 76ers coach Brett Brown said."}
{"game_id": "0021700057", "chunk_id": "0021700057_010", "order": 10, "role": "body", "text": "The Rockets scored the final nine points and Gordon hit three 3s in the fourth. If luck was Brown's code word for bad D, he nailed it."}
{"game_id": "0021700057", "chunk_id": "0021700057_011", "order": 11, "role": "body", "text": "Gordon scored 29 points, James Harden had 27 and Clint Capela had 16 points and 20 rebounds."}
{"game_id": "0021700057", "chunk_id": "0021700057_012", "order": 12, "role": "body", "text": "J.J. Redick scored 22 points, and Robert Covington had 20 for the Sixers."}
{"game_id": "0021700057", "chunk_id": "0021700057_013", "order": 13, "role": "body", "text": "\"It's a learning experience,\" Embiid said. \"We're going to need that in the future. We're young. That's not an excuse, but we can all get better.\""}
{"game_id": "0021700057", "chunk_id": "0021700057_014", "order": 14, "role": "body", "text": "Embiid, the 7-foot center out of Cameroon, again had the Sixers playing like a playoff team and not pushovers when he's healthy and energized. His 3 off the glass from the top of the arc in the fourth gave the Sixers a nine-point lead. Embiid pointed toward the sky as he ran back on defense and his bucket about blew the roof off an arena packed with fans who have had little reason to cheer the last five years."}
{"game_id": "0021700057", "chunk_id": "0021700057_015", "order": 15, "role": "body", "text": "Harden and Gordon hit 3s that stunned the Sixers and cut the gap to three, starting a rally that lasted down to the final bucket."}
{"game_id": "0021700057", "chunk_id": "0021700057_016", "order": 16, "role": "body", "text": "Both teams played without key cogs to their offense: Chris Paul was out again for the Rockets because of an injured left knee, and Markelle Fultz, the No. 1 pick of the 2017 draft, missed the game with a sore right shoulder. Fultz will miss the next two games and will be evaluated next week."}
{"game_id": "0021700057", "chunk_id": "0021700057_017", "order": 17, "role": "body", "text": "The Sixers drew another big crowd -- 20,682 -- as fans have bought into \"The Process,\" and big plays had fans going wild. They were given souvenir signs that had a picture of Simmons, Embiid and Fultz, the trio expected to soon carry the Sixers into the playoffs."}
{"game_id": "0021700057", "chunk_id": "0021700057_018", "order": 18, "role": "body", "text": "Embiid, who sat out the second quarter, waved his arms and exhorted the crowd to get louder on a \"Trust the Process\" chant, and then hit a free throw for a 72-69 lead. He egged on the crowd on a \"Ref, you suck\" chant and soaked in the calls for \"MVP! MVP!\""}
{"game_id": "0021700057", "chunk_id": "0021700057_019", "order": 19, "role": "body", "text": "Simmons and Embiid have been a fantastic 1-2 punch and helped the Sixers win at Detroit on Monday night. Simmons, the No. 1 pick in the 2016 draft, struggled for most of Tuesday's game until he connected on a rim-rattling dunk off the break that kept the Sixers' lead at five."}
{"game_id": "0021700057", "chunk_id": "0021700057_021", "order": 21, "role": "body", "text": "\"For us to be a good team, we have to win in games like this,\" Gordon said."}
{"game_id": "0021700057", "chunk_id": "0021700057_023", "order": 23, "role": "body", "text": "Rockets: G Trevor Ariza will miss the three-game trip with a sprained left foot. He will be evaluated next week when the Rockets return home. ... C Nene sat out with a sore left Achilles."}
{"game_id": "0021700057", "chunk_id": "0021700057_024", "order": 24, "role": "body", "text": "76ers: Team president Bryan Colangelo said there had been \"no medical reason\" not to play Fultz this season and the shoulder had no structural damage. ... Fultz is shooting 33 percent, 50 percent from the free-throw line and has not attempted a 3-point shot all season, all as a reserve."}
{"game_id": "0021700057", "chunk_id": "0021700057_026", "order": 26, "role": "body", "text": "Rockets coach Mike D'Antoni said the offense remains \"uneven\" without Paul, who is week-to-week with his knee injury."}
{"game_id": "0021700057", "chunk_id": "0021700057_028", "order": 28, "role": "body", "text": "Houston and the 76ers each hit 12 3s. But the Rockets made 21 of 24 from the free-throw line while the Sixers were just 6 of 10."}
{"game_id": "0021700057", "chunk_id": "0021700057_033", "order": 33, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
