{"game_id": "0021701178", "chunk_id": "0021701178_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Brooklyn's long-range shooters dealt a blow to the Milwaukee Bucks' hopes of moving up in the Eastern Conference playoff race."}
{"game_id": "0021701178", "chunk_id": "0021701178_002", "order": 2, "role": "body", "text": "They hit 3s whether they were wide open or had a defender in their face. They hit them from the corners and the wings."}
{"game_id": "0021701178", "chunk_id": "0021701178_003", "order": 3, "role": "body", "text": "The Nets shot 48 percent from behind the arc in a 119-111 win Thursday night over the Bucks, though it seemed like they just couldn't miss. Allen Crabbe scored 25 points and led a 19-of-39 3-point shooting with two 3s in the closing minutes of a tight game."}
{"game_id": "0021701178", "chunk_id": "0021701178_004", "order": 4, "role": "body", "text": "This win over a playoff-bound team will serve as motivation for the Nets as they close out an otherwise disappointing regular season."}
{"game_id": "0021701178", "chunk_id": "0021701178_005", "order": 5, "role": "body", "text": "\"I keep saying `We're playing for a lot,\" coach Kenny Atkinson said. \"We're playing for our future, we're playing for our culture ... we're playing for our fans.\""}
{"game_id": "0021701178", "chunk_id": "0021701178_006", "order": 6, "role": "body", "text": "And making it a little tougher for the Bucks to climb up the East standings."}
{"game_id": "0021701178", "chunk_id": "0021701178_007", "order": 7, "role": "body", "text": "This isn't the way that Milwaukee wanted to play a night after clinching its third postseason berth in four years thanks to Detroit's loss to Philadelphia."}
{"game_id": "0021701178", "chunk_id": "0021701178_008", "order": 8, "role": "body", "text": "The Bucks and Washington Wizards are tied for seventh with identical 42-37 records, a game behind sixth-place Miami. But the Wizards have the tiebreaker with the Bucks because of a better conference record."}
{"game_id": "0021701178", "chunk_id": "0021701178_009", "order": 9, "role": "body", "text": "Washington lost at Cleveland on Thursday night, meaning the Bucks missed a golden opportunity to move up with the 53-loss Nets in town."}
{"game_id": "0021701178", "chunk_id": "0021701178_010", "order": 10, "role": "body", "text": "\"We've got to win and they've got to lose now,\" Bucks center John Henson said. \"That's why it's important to win games like this tonight because that matters at the end of the season.\""}
{"game_id": "0021701178", "chunk_id": "0021701178_011", "order": 11, "role": "body", "text": "Khris Middleton scored 31 points, while Giannis Antetokounmpo had 19 points and 10 rebounds for Milwaukee."}
{"game_id": "0021701178", "chunk_id": "0021701178_012", "order": 12, "role": "body", "text": "Undermanned in the frontcourt because of injuries, the Nets packed the paint to try to prevent the free-wheeling Antetokounmpo from having his way around the rim. Brooklyn center Jarrett Allen had a career high five blocks, and the Nets finished with 12 on the night."}
{"game_id": "0021701178", "chunk_id": "0021701178_013", "order": 13, "role": "body", "text": "\"He's got to be our paint-patroller, our rim-protector,\" Atkinson said about Allen. \"He was outstanding patrolling the paint tonight.\""}
{"game_id": "0021701178", "chunk_id": "0021701178_014", "order": 14, "role": "body", "text": "A hot night from 3-point territory made up for any other shortcomings."}
{"game_id": "0021701178", "chunk_id": "0021701178_015", "order": 15, "role": "body", "text": "Crabbe was clutch by hitting two of his five 3s over the final three minutes, the second coming with 1:18 left to give the Nets a six-point lead that sent Bucks fans to the exits."}
{"game_id": "0021701178", "chunk_id": "0021701178_016", "order": 16, "role": "body", "text": "D'Angelo Russell was 4 of 10 from the arc and finished with 22 points. Joe Harris was 3 of 5 and finished with 17 points."}
{"game_id": "0021701178", "chunk_id": "0021701178_017", "order": 17, "role": "body", "text": "\"The answer is we did not defend it pretty well,\" Bucks coach Joe Prunty said when asked to explain his team's perimeter defense. \"We defended it pretty poorly.\""}
{"game_id": "0021701178", "chunk_id": "0021701178_019", "order": 19, "role": "body", "text": "Nets: The frontcourt was beset by injuries with F DeMarre Carroll (left hip) and C Jahlil Okafor (right ankle) each missing the game after getting hurt in a loss Tuesday at Philadelphia. ... F Dante Cunningham did not dress because of back spasms."}
{"game_id": "0021701178", "chunk_id": "0021701178_020", "order": 20, "role": "body", "text": "Bucks: F Jabari Parker had a couple highlight-reel dunks but finished 6 of 21 from the field for 13 points. He added 10 rebounds. ... G Eric Bledsoe had 16 points and six assists."}
{"game_id": "0021701178", "chunk_id": "0021701178_022", "order": 22, "role": "body", "text": "The Nets tied a franchise record set last season with a 14th straight game of at least 10 3-pointers."}
{"game_id": "0021701178", "chunk_id": "0021701178_024", "order": 24, "role": "body", "text": "Brooklyn had the Bucks on their heels until Bledsoe's energetic play gave Milwaukee a spark on both ends of the floor. The speedy point guard had two steals during an 18-3 run in the third quarter, finishing the spurt with a corner 3 for a 75-71 lead with 2:22 left."}
{"game_id": "0021701178", "chunk_id": "0021701178_025", "order": 25, "role": "body", "text": "But the Bucks were just 5 of 20 overall from 3-point range."}
{"game_id": "0021701178", "chunk_id": "0021701178_026", "order": 26, "role": "body", "text": "\"We couldn't shoot it in the ocean, they got a chance to get them,\" Parker said."}
{"game_id": "0021701178", "chunk_id": "0021701178_028", "order": 28, "role": "body", "text": "Brooklyn's 23rd different starting lineup of the season had a hot first half. The quintet of center Allen, forwards Harris and Rondae Hollis-Jefferson along with guards Crabbe and Russell combined to shoot 57 percent in the first half and 44 percent (9 of 22) from the 3-point arc to take a 52-45 lead at halftime."}
{"game_id": "0021701178", "chunk_id": "0021701178_030", "order": 30, "role": "body", "text": "\"Everybody says (we've) got nothing to play for, so we might as well get as many wins as we can before the season ends.\" -- Crabbe."}
{"game_id": "0021701178", "chunk_id": "0021701178_032", "order": 32, "role": "body", "text": "Nets: At Chicago on Friday night."}
{"game_id": "0021701178", "chunk_id": "0021701178_033", "order": 33, "role": "body", "text": "Bucks: At New York on Friday night."}
{"game_id": "0021701178", "chunk_id": "0021701178_035", "order": 35, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
