{"game_id": "0021700266", "chunk_id": "0021700266_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Squaring off against fellow rookie Lonzo Ball for the first time in the NBA didn't mean nearly as much to the Kings' De'Aaron Fox as beating the Lakers."}
{"game_id": "0021700266", "chunk_id": "0021700266_002", "order": 2, "role": "body", "text": "Even though it's his first year in Sacramento, Fox is well aware of the long-standing rivalry between the two Pacific Division foes."}
{"game_id": "0021700266", "chunk_id": "0021700266_003", "order": 3, "role": "body", "text": "Zach Randolph had 22 points, seven rebounds and seven assists, Willie Cauley-Stein added 26 points and the Kings beat the Los Angeles Lakers 113-102 on Wednesday night."}
{"game_id": "0021700266", "chunk_id": "0021700266_004", "order": 4, "role": "body", "text": "Fox scored 13 points in his first game against Ball since both entered the NBA as top-five picks in June."}
{"game_id": "0021700266", "chunk_id": "0021700266_005", "order": 5, "role": "body", "text": "\"It was more sweet for the city just beating the Lakers,\" Fox said. \"I know about the rivalry. We came out knowing that this is a game we had to get.\""}
{"game_id": "0021700266", "chunk_id": "0021700266_006", "order": 6, "role": "body", "text": "Buddy Hield added 10 points for Sacramento, including a pair of 3-pointers during a 15-5 run to open the fourth quarter. Bogdan Bogdanovic scored 14 and Frank Mason added 11."}
{"game_id": "0021700266", "chunk_id": "0021700266_007", "order": 7, "role": "body", "text": "The Kings trailed briefly in the first quarter but took the lead on Randolph's up-and-under basket past Brook Lopez and slowly pulled away after that. Sacramento led by as many as 20 and dominated Los Angeles on the boards."}
{"game_id": "0021700266", "chunk_id": "0021700266_008", "order": 8, "role": "body", "text": "That continued a strange pattern for the Kings, who are 1-9 on the road but 4-4 at home. Those four wins have come against Oklahoma City, Philadelphia, Portland and Los Angeles."}
{"game_id": "0021700266", "chunk_id": "0021700266_009", "order": 9, "role": "body", "text": "\"That's one of the more complete games we've played, from start to finish,\" Sacramento coach Dave Joerger said. \"We withstood their runs, we got some loose balls and we kept them off the glass pretty effectively.\""}
{"game_id": "0021700266", "chunk_id": "0021700266_010", "order": 10, "role": "body", "text": "Kentavious Caldwell-Pope scored 20 points, Kyle Kuzma had 17 and Ball had 11 points, 11 assists and seven rebounds for the Lakers. Los Angeles was playing the second half of a back-to-back after rallying from 19 down to beat the Chicago Bulls on Tuesday."}
{"game_id": "0021700266", "chunk_id": "0021700266_011", "order": 11, "role": "body", "text": "\"When Sacramento started hitting some of their (shots) and made the little run they went on at the end of the first, it kind of felt like we fell apart and stopped trusting what we were doing,\" Lakers coach Luke Walton said. \"We were kind of scrambling to stay within striking distance.\""}
{"game_id": "0021700266", "chunk_id": "0021700266_012", "order": 12, "role": "body", "text": "The game was billed as a matchup between 19-year-old rookies Ball and Fox, the second and fifth overall picks who were playing against each other for the first time as pros after squaring off twice last season in college."}
{"game_id": "0021700266", "chunk_id": "0021700266_013", "order": 13, "role": "body", "text": "Both had their moments, though Ball's one-handed alley-oop dunk in the second quarter clearly stood out. He also made a 3-pointer late in the fourth that brought the Lakers within 106-92."}
{"game_id": "0021700266", "chunk_id": "0021700266_014", "order": 14, "role": "body", "text": "Ball finished 4 of 8 while Fox went 5 of 11."}
{"game_id": "0021700266", "chunk_id": "0021700266_015", "order": 15, "role": "body", "text": "\"It was a lot of fun playing against him. It's always fun,\" Ball said. \"The crowd loves it and all the fans and stuff, so it's good for basketball. He played great tonight.\""}
{"game_id": "0021700266", "chunk_id": "0021700266_016", "order": 16, "role": "body", "text": "Randolph got the Kings off to a fast start with 11 points in the opening 7 1/2 minutes, while Bogdanovic and Mason added six points apiece as part of a 16-2 run to close out the first quarter that put Sacramento up 31-19."}
{"game_id": "0021700266", "chunk_id": "0021700266_018", "order": 18, "role": "body", "text": "Lakers: Los Angeles was outrebounded 44-32. . Caldwell-Pope made 4 of 6 3-pointers. As a team the Lakers made 15 of 29 beyond the arc."}
{"game_id": "0021700266", "chunk_id": "0021700266_019", "order": 19, "role": "body", "text": "Kings: Fox missed five of his first seven shots, including two airballs. . Hield returned from an ankle injury, while Vince Carter also played after missing seven games with a kidney stone."}
{"game_id": "0021700266", "chunk_id": "0021700266_021", "order": 21, "role": "body", "text": "Los Angeles made a final push and trimmed the lead to single digits going into the fourth before the Kings pulled away behind Cauley-Stein's big fourth quarter. Sacramento's 7-footer scored 13 points over the final 10  1/2 minutes, when he went 5 of 5 from the floor. \"I think that gives us the best chance of winning or being in games, is if I'm playing super aggressive, putting a lot of pressure on the rim,\" Cauley-Stein said. \"It's a lot of fun to watch and it's a lot more fun to play that way.\""}
{"game_id": "0021700266", "chunk_id": "0021700266_023", "order": 23, "role": "body", "text": "On a night when it seemed like everyone made a dunk, Kuzma missed his. The Lakers rookie looked to be headed for an easy breakaway dunk in the third quarter but the ball hit the back of the rim and ricocheted near midcourt."}
{"game_id": "0021700266", "chunk_id": "0021700266_025", "order": 25, "role": "body", "text": "Lakers: Play the Los Angeles Clippers on Nov. 27."}
{"game_id": "0021700266", "chunk_id": "0021700266_026", "order": 26, "role": "closing", "text": "Kings: Host the Clippers on Saturday night. The Clippers have won nine straight in Sacramento, their last loss coming March 19, 2013."}
