{"game_id": "0021701080", "chunk_id": "0021701080_001", "order": 1, "role": "lead", "text": "CLEVELAND --  As his teammates circled around LeBron James before the opening tip, things looked different."}
{"game_id": "0021701080", "chunk_id": "0021701080_003", "order": 3, "role": "body", "text": "\"Our huddle was almost complete,\" James said."}
{"game_id": "0021701080", "chunk_id": "0021701080_004", "order": 4, "role": "body", "text": "After months of chaos, the Cavaliers may be coming together at just the right time."}
{"game_id": "0021701080", "chunk_id": "0021701080_005", "order": 5, "role": "body", "text": "James scored 27 points in just three quarters, Kevin Love added 20 and Cleveland welcomed back three players from injury during a 120-95 blowout Friday night over the sinking Phoenix Suns, who lost their 10th straight game."}
{"game_id": "0021701080", "chunk_id": "0021701080_006", "order": 6, "role": "body", "text": "James added nine assists and six rebounds before watching and cheering from the bench in the fourth while the Cavs, who have had their full quote of players for one game all season, rolled to an easy win with their healthiest roster in weeks."}
{"game_id": "0021701080", "chunk_id": "0021701080_007", "order": 7, "role": "body", "text": "Forwards Tristan Thompson, Larry Nance Jr. and Rodney Hood all returned from injuries, good news as Cleveland gears up for the playoffs."}
{"game_id": "0021701080", "chunk_id": "0021701080_008", "order": 8, "role": "body", "text": "The win soothed a week that began with coach Tyronn Lue stepping away for health reasons. The Cavs beat playoff-bound Milwaukee and then stunned Eastern Conference-leading Toronto."}
{"game_id": "0021701080", "chunk_id": "0021701080_009", "order": 9, "role": "body", "text": "\"We rallied around him,\" assistant coach Larry Drew said about Lue. \"We rallied around one another.\""}
{"game_id": "0021701080", "chunk_id": "0021701080_010", "order": 10, "role": "body", "text": "James and his teammates have pushed through every obstacle."}
{"game_id": "0021701080", "chunk_id": "0021701080_011", "order": 11, "role": "body", "text": "\"That's just what we're trying to do, just trying to find a way no matter what's been going on with our season,\" he said. \"Find a way. Stay composed. Stay even-keeled, that's always my motto.\""}
{"game_id": "0021701080", "chunk_id": "0021701080_012", "order": 12, "role": "body", "text": "Phoenix was without its top two scorers, Devin Booker (right hand sprain) and T.J. Warren (left knee inflammation). But even they might not have been able to stop the Suns from losing for the 25th time in 27 games."}
{"game_id": "0021701080", "chunk_id": "0021701080_013", "order": 13, "role": "body", "text": "Troy Daniels scored 20 points, and Marquese Chriss had 19 to pace Phoenix."}
{"game_id": "0021701080", "chunk_id": "0021701080_014", "order": 14, "role": "body", "text": "Seemingly disinterested early on, the Cavs found themselves trailing 30-23 after one quarter. But after missing their first seven 3-pointers, the Cavs found their range and knocked down four long shots in a row -- including a 28-footer by Love -- and went on a 32-7 run."}
{"game_id": "0021701080", "chunk_id": "0021701080_015", "order": 15, "role": "body", "text": "The Cavs outscored the Suns 39-18 in the second quarter, pushed their lead to 30 in the third and coasted to their seventh straight win over Phoenix."}
{"game_id": "0021701080", "chunk_id": "0021701080_016", "order": 16, "role": "body", "text": "Suns coach Jay Triano feared the Cavs might find their groove."}
{"game_id": "0021701080", "chunk_id": "0021701080_017", "order": 17, "role": "body", "text": "\"You hope not, but a big thing for us is we tried to dictate a little bit of the pace of the game,\" he said. \"The back-breaker for us is when we score and they score in transition. That's not something we want to give up. That kind of fuels them.\""}
{"game_id": "0021701080", "chunk_id": "0021701080_018", "order": 18, "role": "body", "text": "Although Nance was back, Drew stuck with his same starting lineup. That could change in the days ahead as Cleveland tinkers with a team that may be finally head in the right direction."}
{"game_id": "0021701080", "chunk_id": "0021701080_020", "order": 20, "role": "body", "text": "Nance finished with 15 points and 10 rebounds in 22 minutes. Hood had nine points in 21 minutes and Thompson nine rebounds in 16 minutes."}
{"game_id": "0021701080", "chunk_id": "0021701080_022", "order": 22, "role": "body", "text": "Booker, who has missed three straight games, tested his hand during pregame warmups before deciding not to play."}
{"game_id": "0021701080", "chunk_id": "0021701080_023", "order": 23, "role": "body", "text": "\"Can't catch the ball. Can't throw a pass,\" Triano said. \"Hopefully he'll be able to play tomorrow night. We've got a lot of guys who are tired.\""}
{"game_id": "0021701080", "chunk_id": "0021701080_025", "order": 25, "role": "body", "text": "James religiously takes naps as part of his pregame routine. His plan for Friday was to wake up while his alma mater, St. Vincent-St. Mary, was playing in a state semifinal game. He got up earlier than expected."}
{"game_id": "0021701080", "chunk_id": "0021701080_026", "order": 26, "role": "body", "text": "\"Well guess what, the inner (hash)IrishPride woke me up 2 mins before tipoff anyways! Let's go Irish,\" James tweeted."}
{"game_id": "0021701080", "chunk_id": "0021701080_027", "order": 27, "role": "body", "text": "The Fighting Irish advanced with a win over Lexington. James joked that when he's getting ready to sleep, nothing stops him."}
{"game_id": "0021701080", "chunk_id": "0021701080_028", "order": 28, "role": "body", "text": "\"It's really only my kids who can cut into my nap time, my wife as well, my mom if something is really needed,\" he said. \"They know once I go into that bedroom, it's really zero dark thirty. Leave me alone.\""}
{"game_id": "0021701080", "chunk_id": "0021701080_030", "order": 30, "role": "body", "text": "Suns: Warren has missed two games in a row and is unlikely to play Saturday. He's averaging 19.6 points. .... Veteran C Tyson Chandler has been limited to 46 games because of injuries and will be used sparingly over the final two weeks. \"We talked about his overall health more than anything,\" Triano said. \"He still practices, but he's obviously he's not 100 percent so it doesn't make sense to play him.\""}
{"game_id": "0021701080", "chunk_id": "0021701080_031", "order": 31, "role": "body", "text": "Cavaliers: James has scored at least 10 points in 863 straight games, three shy of tying Michael Jordan's NBA record. James is in line to tie the mark on Wednesday in Charlotte, potentially with Jordan in attendance. ... James did not have a turnover in his previous game and made 28 assists before his first one. ... F Jeff Green left with an illness after playing seven minutes in the first quarter and didn't return. ... Drew doesn't know if Lue will join the team on its upcoming trip to Brooklyn, Miami and Charlotte. Drew visited Lue at his home on Thursday and the two discussed how to integrate the players returning from injuries. ... F Kyle Korver won't return until next week. He's been away with his family following the death of his younger brother, Kirk."}
{"game_id": "0021701080", "chunk_id": "0021701080_034", "order": 34, "role": "closing", "text": "Cavaliers: At Brooklyn on Sunday."}
