{"game_id": "0021700907", "chunk_id": "0021700907_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Dwight Howard returned from a first quarter injury to lead Charlotte over the Bulls."}
{"game_id": "0021700907", "chunk_id": "0021700907_002", "order": 2, "role": "body", "text": "The Hornets center was hurt after playing 10 minutes in the opening quarter of a 118-103 win over Chicago on Tuesday night."}
{"game_id": "0021700907", "chunk_id": "0021700907_003", "order": 3, "role": "body", "text": "He first said it felt as if a rib \"popped out a little bit.\""}
{"game_id": "0021700907", "chunk_id": "0021700907_004", "order": 4, "role": "body", "text": "\"That happens a lot, it just comes out,\" Howard said. \"Really nothing I can do about it."}
{"game_id": "0021700907", "chunk_id": "0021700907_005", "order": 5, "role": "body", "text": "Howard wanted to make it clear that it wasn't a back issue. Charlotte's coach Steve Clifford said it was \"back spasms\" and the team called it a back strain."}
{"game_id": "0021700907", "chunk_id": "0021700907_006", "order": 6, "role": "body", "text": "\"There's nothing wrong with my back,\" he said. \"Just want to make sure I put that out there. I wasn't really concerned with it being my back. I haven't had a problem with that in the last two years; I knew it wasn't my back. I've taken some hard falls and some hard hits, and that's what happens.\""}
{"game_id": "0021700907", "chunk_id": "0021700907_007", "order": 7, "role": "body", "text": "He returned to start the second half, however, and his 16 third-quarter points and all-around dominant play. He finished with 24 in the game."}
{"game_id": "0021700907", "chunk_id": "0021700907_008", "order": 8, "role": "body", "text": "Kemba Walker led the Hornets with 31 points to help the Hornets win a season-best fifth straight game."}
{"game_id": "0021700907", "chunk_id": "0021700907_009", "order": 9, "role": "body", "text": "Zach LaVine led seven Bulls players in double-digits with 21 points as Chicago (20-41) dropped its fifth consecutive game."}
{"game_id": "0021700907", "chunk_id": "0021700907_010", "order": 10, "role": "body", "text": "The Hornets suddenly hot shooting helped them continue their push to make the playoffs as they sank 53.7 percent of their field-goal attempts, and 42.9 percent from 3-point range."}
{"game_id": "0021700907", "chunk_id": "0021700907_011", "order": 11, "role": "body", "text": "Walker hit 11-of-19 attempts -- including 6-of-10 of 3-pointers -- while Howard missed only two shots in 12 attempts. Nicolas Batum also added 10 points, 12 assists and seven rebounds."}
{"game_id": "0021700907", "chunk_id": "0021700907_012", "order": 12, "role": "body", "text": "The teams were tied 51-51 at halftime, and the young Bulls were encouraged."}
{"game_id": "0021700907", "chunk_id": "0021700907_013", "order": 13, "role": "body", "text": "\"We're playing some pretty good stretches, we're just not sustaining it right now,\" Chicago coach Fred Hoiberg said."}
{"game_id": "0021700907", "chunk_id": "0021700907_014", "order": 14, "role": "body", "text": "It was difficult to sustain against a Charlotte team inspired by the return of Howard. The 6-11 center walked straight to the locker room after exiting the game in the first quarter."}
{"game_id": "0021700907", "chunk_id": "0021700907_015", "order": 15, "role": "body", "text": "He did not re-emerge until just before the second half tipped off."}
{"game_id": "0021700907", "chunk_id": "0021700907_017", "order": 17, "role": "body", "text": "Bulls: Justin Holiday and Robin Lopez were healthy scratches Tuesday. ... Cristiano Felicio equaled his season-high of 12 points by halftime. He did not score in the second half. ... Chicago already has exceeded the team's previous record for most 3-pointers in a single season (651, set in 2015-16). The Bulls had 657 3-pointers entering Tuesday's game."}
{"game_id": "0021700907", "chunk_id": "0021700907_018", "order": 18, "role": "body", "text": "Hornets: Howard earned his 13th technical foul of the season in the third quarter. . Nicolas Batum's 12 assists were a season-high. ... With his first rebound against the Bulls, Howard moved into sole possession of 17th all-time in the NBA in rebounds. . Kemba Walker tied JR Reed for 10th-most career rebounds in franchise history with two rebounds against the Bulls."}
{"game_id": "0021700907", "chunk_id": "0021700907_020", "order": 20, "role": "body", "text": "When Clifford missed 21 games earlier this season for health issues that included persistent headaches related to a lack of sleep, one of the coaches who reached out immediately was Hoiberg."}
{"game_id": "0021700907", "chunk_id": "0021700907_021", "order": 21, "role": "body", "text": "The two had developed a bond earlier over shared heart problems both experienced: Clifford had two stents inserted into his heart in 2013; Hoiberg had valve replacement surgery in 2015 after open-heart surgery to repair an aortic aneurysm ended his playing career in 2005."}
{"game_id": "0021700907", "chunk_id": "0021700907_022", "order": 22, "role": "body", "text": "\"It's a small fraternity, this coaching group, and we're all very competitive and you want to go out there and beat the other guy, but more importantly, you understand what's at stake with all this,\" Hoiberg said. \"The high-pressure situation that all of us are in ..."}
{"game_id": "0021700907", "chunk_id": "0021700907_023", "order": 23, "role": "body", "text": "\"It's great to see him back on the sidelines. I think Steve Clifford's one of the best coaches, and one of the best Xs and Os guys in this league.\""}
{"game_id": "0021700907", "chunk_id": "0021700907_024", "order": 24, "role": "body", "text": "Said Clifford: \"He's just a good man. Good guy to talk to.\""}
{"game_id": "0021700907", "chunk_id": "0021700907_027", "order": 27, "role": "closing", "text": "Hornets: Play at Boston on Wednesday to start a three-game road trip."}
