{"game_id": "0021700616", "chunk_id": "0021700616_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- Blake Griffin says he's fully recovered from the concussion he suffered last weekend and marveled at how his Los Angeles Clippers have maneuvered their way around a series of injuries to key players this season.\nGriffin is just as impressed with how much the club has gotten from unheralded teammates like Tyrone Wallace, who spent most of the season in the G League before joining the Clippers for his NBA debut this month.\nWallace intercepted a pass at midcourt and drove in for a dunk with 10.9 seconds left, moments after what appeared to be a costly turnover by Lou Williams, and the Clippers held off the Sacramento Kings 121-115 on Thursday night after blowing a 14-point lead in the fourth quarter.\n\"Guys made big plays when we needed them,\" Griffin said. \"Guys that weren't even on an NBA roster at the beginning of the season are coming up and making big plays like they've been in the league for years. That's awesome to see.\"\nThe Clippers, who lost DeAndre Jordan to a sprained left ankle in the second quarter, won their third straight over the Kings this season and their 11th in a row at Sacramento.\n\"It's tough. You just keep dropping guys every game,\" Los Angeles coach Doc Rivers said. \"Every game someone is stepping in for us, too, and that's the blessing.\"\nWilliams finished with 30 points and six assists, one night after scoring a career-high 50 against defending champion Golden State. Griffin had 18 points, 12 rebounds and six assists in his return to the lineup, and Montrezl Harrell scored a season-best 25 -- including 16 in the second quarter when Los Angeles put up 43 points.\nThe Clippers led 106-92 early in the fourth before the Kings rallied to go ahead 113-112 on Bogdan Bogdanovich's layup with 2:10 remaining.\nGriffin followed with a 3-pointer and Williams later scored on a short jumper, but the Kings pulled to 117-115 on George Hill's free throw with 24.9 seconds left.\nWilliams then committed a turnover at midcourt when he threw a pass to Sacramento's Kosta Koufos, but Wallace saved his teammate when he stole the ball back and drove in for a dunk. Wesley Johnson added two free throws to seal the win.\n\"Normally bigs don't want to push the ball up so I kind of just sat there and waited a little behind the guard,\" Wallace said. \"I figured (Koufos) was going to look to pass it. He just turned and threw the ball without looking, so I knew I had an opportunity to get the steal. I had the whole court in front of me.\"\nBogdanovich scored 22 points, and Koufos had 14 points and 14 rebounds. Hill added 21 points but missed two free throws in the final 70 seconds.\n\"We've got to start games and play with a lot more effort, a lot more aggressiveness, a lot more motor,\" Kings coach Dave Joerger said.\nWilliams had 21 points in the first half, including nine in the final 1:33 of the second quarter after the Kings had trimmed a 14-point deficit to 60-58.\nThe Clippers also got a lift from Harrell, who made all seven of his shots in the period.\nThat was important after Jordan limped off the court with an ankle injury after scoring on a dunk with 5:15 left in the first half.\n\"That's par for the course for our team this year,\" Griffin said. \"One guy comes back, one guy has to go out.\"\nGRIFFIN'S HEALTH\nGriffin shot 5 of 14 and was 2 for 7 from beyond the arc in his return from a concussion he suffered last Saturday. \"Fine head-wise and all that,\" he said. \"I just felt like I was a little off rhythm-wise.\"\nTIP-INS\nClippers: Harrell's 16 points in the second quarter were two more than he had the entire game against Golden State.\nKings: Bogdanovich had four fouls in the first half. ... Frank Mason was diagnosed with a partial tear of the plantar fascia in his right foot. He is expected to miss four weeks. Mason was injured Dec. 31 against Memphis.\nUP NEXT\nClippers: Play at Houston on Saturday.\nKings: Play at Oklahoma City on Saturday.\n---\nMore NBA basketball: https://apnews.com/tag/NBAbasketball"}
