{"game_id": "0021200066", "chunk_id": "0021200066_001", "order": 1, "role": "lead", "text": "CHICAGO -- Oklahoma City went to Kevin Durant in the fourth quarter. Chicago was missing its best closer, so all the Bulls had to pitch in."}
{"game_id": "0021200066", "chunk_id": "0021200066_002", "order": 2, "role": "body", "text": "Durant & Co. were just too much to overcome."}
{"game_id": "0021200066", "chunk_id": "0021200066_003", "order": 3, "role": "body", "text": "The NBA scoring champion had 10 of his 24 points in the final period, and the Thunder beat the Bulls 97-91 on Thursday night."}
{"game_id": "0021200066", "chunk_id": "0021200066_004", "order": 4, "role": "body", "text": "\"It was one of those games you have to grind out,\" Durant said. \"We've been through so many. We know what it takes.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_005", "order": 5, "role": "body", "text": "Durant iced the game with an off-balance jumper off one foot with 35.1 seconds to play. He added another jumper a few seconds later and then finished his game-ending spree with a couple of free throws."}
{"game_id": "0021200066", "chunk_id": "0021200066_006", "order": 6, "role": "body", "text": "Oklahoma City outscored Chicago 31-19 in the fourth quarter, overcoming a six-point deficit."}
{"game_id": "0021200066", "chunk_id": "0021200066_007", "order": 7, "role": "body", "text": "\"That's winning time, fourth quarter,\" Durant said. \"In the fourth quarter, we really turned it up a lot. But if you want to be a really good team, you've got to do that from the beginning of the game.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_008", "order": 8, "role": "body", "text": "Serge Ibaka scored 15 of his 21 points in the first half and had a team-high nine rebounds for the Thunder, who beat the Bulls for the third time in their past four games at Chicago. Russell Westbrook finished with 16 points and 12 assists."}
{"game_id": "0021200066", "chunk_id": "0021200066_009", "order": 9, "role": "body", "text": "\"I told (Durant) be aggressive, just be aggressive, especially in the fourth quarter,\" Westbrook said. \"It was his time. Everybody knows that's his time. He took his time and got the shots he needed.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_010", "order": 10, "role": "body", "text": "Luol Deng led the Bulls with 27 points, and Richard Hamilton added 20 points and eight rebounds. Joakim Noah had nine points, 13 rebounds and a team-high six assists."}
{"game_id": "0021200066", "chunk_id": "0021200066_011", "order": 11, "role": "body", "text": "\"Overall, I thought we played hard but we turned the ball over a lot,\" Noah said. \"(Durant) hit some really tough shots.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_012", "order": 12, "role": "body", "text": "Hamilton made a tying jumper with 2:52 to play, but then Durant took over, making a floater from the top of the key over Deng to keep the Bulls at bay."}
{"game_id": "0021200066", "chunk_id": "0021200066_013", "order": 13, "role": "body", "text": "\"I was on him,\" Deng said. \"He's 6-9 (6-foot-9). A great player. Really tough shot.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_014", "order": 14, "role": "body", "text": "While Durant came up with some clutch baskets at one end, the Bulls had no one to answer with star point guard Derrick Rose sidelined with a knee injury that will keep him out of action into the new year."}
{"game_id": "0021200066", "chunk_id": "0021200066_015", "order": 15, "role": "body", "text": "\"Derrick Rose is an unbelievable player, don't get me wrong. He is Chicago,\" Durant said. \"But those guys are great complements to him. Once one of your best players is out, guys got to step up, and that's what they've been doing ever since he's been out.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_016", "order": 16, "role": "body", "text": "The teams combined for 43 turnovers. The 21 miscues by the Bulls were a hot topic after the game."}
{"game_id": "0021200066", "chunk_id": "0021200066_017", "order": 17, "role": "body", "text": "\"We have to sustain our defense and take care of the ball,\" Bulls coach Tom Thibodeau said. \"We did not sustain our effort and we need to have low turnovers.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_018", "order": 18, "role": "body", "text": "Durant was passive for much of the game and didn't attempt a free throw until the closing seconds. He has had just one game without a free throw attempt since the start of the 2010-11 season."}
{"game_id": "0021200066", "chunk_id": "0021200066_019", "order": 19, "role": "body", "text": "\"I like Kevin to be a playmaker,\" Thunder coach Scott Brooks said. \"That is what separates great players from good ones. The 19 shots like tonight are where I like him to be.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_020", "order": 20, "role": "body", "text": "The Thunder put together a 7-0 run to grab the lead with 8:34 to play. Nick Collison capped the surge with a layup off a pass from Eric Maynor."}
{"game_id": "0021200066", "chunk_id": "0021200066_021", "order": 21, "role": "body", "text": "Deng snapped the run with his third 3-pointer of the game. Deng entered the contest 1-for-11 from behind the arc. Chicago ranked last in the league in 3-point makes, attempts and percentage, but hit a season-high five 3s in the game."}
{"game_id": "0021200066", "chunk_id": "0021200066_022", "order": 22, "role": "body", "text": "\"Lu provides whatever you need,\" Thibodeau said. \"If you need him to score more, he can do that.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_023", "order": 23, "role": "body", "text": "The Thunder responded a six-point run, taking a five-point lead after Ibaka blocked a Deng shot from behind, igniting a fast break and Thabo Sefolosha's layup."}
{"game_id": "0021200066", "chunk_id": "0021200066_024", "order": 24, "role": "body", "text": "\"They are hard to guard,\" Thibodeau said. \"They made some tough plays and closed it out.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_025", "order": 25, "role": "body", "text": "Kirk Hinrich scored seven points to lead a third-quarter charge for the Bulls, hitting his second 3-pointer of the game and reaching double figures in scoring for the first time this season. Chicago led 72-66 entering the final period."}
{"game_id": "0021200066", "chunk_id": "0021200066_026", "order": 26, "role": "body", "text": "The Bulls jumped to an early eight-point lead, but the Thunder closed the opening period with a 9-2 run to tie the game. Durant scored the last six points of the quarter on two dunks and a jump shot."}
{"game_id": "0021200066", "chunk_id": "0021200066_027", "order": 27, "role": "body", "text": "Ibaka scored 11 points on 5-for-9 shooting in the opening quarter and increased that to 15 by the half, when the Thunder led 48-47."}
{"game_id": "0021200066", "chunk_id": "0021200066_028", "order": 28, "role": "body", "text": "Jimmy Butler helped Chicago stay close the second quarter, putting up six points, three rebounds and three assists in the period, while playing solid defense on fellow reserve Kevin Martin, who scored 15 points for the Thunder."}
{"game_id": "0021200066", "chunk_id": "0021200066_029", "order": 29, "role": "body", "text": "Hinrich finished with 12 points."}
{"game_id": "0021200066", "chunk_id": "0021200066_030", "order": 30, "role": "body", "text": "Deng sprained his left thumb during the fourth quarter after it appeared he got hit by Ibaka. He was icing the thumb after the game."}
{"game_id": "0021200066", "chunk_id": "0021200066_031", "order": 31, "role": "body", "text": "\"I jammed my thumb,\" Deng said. \"Just got to ice it, treat it, I have a jammed thumb.\""}
{"game_id": "0021200066", "chunk_id": "0021200066_032", "order": 32, "role": "body", "text": "Deng injured his left wrist last season, tearing a ligament. He decided to put off surgery on the injury and has noted several times over the past few months that he might not have to have surgery on the wrist at all depending on how it responds to treatment."}
{"game_id": "0021200066", "chunk_id": "0021200066_033", "order": 33, "role": "body", "text": "Game notes It was a season-high point total for Durant, who entered averaging 20.8 points after scoring a league-best 28 points per game last season. Durant had scored at least 25 points in his previous seven games against Chicago, but his high in Oklahoma City's first four games was just 23. ... The Bulls entered second in the league in defensive points allowed per possession. Chicago hadn't allowed a team to score more than 93 points in any of its first four games."}
{"game_id": "0021200066", "chunk_id": "0021200066_034", "order": 34, "role": "closing", "text": "The Associated Press and ESPNChicago.com's Nick Friedell contributed to this report."}
