{"game_id": "0021700628", "chunk_id": "0021700628_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  Being .500 is hardly a team's goal, although with the kind of injury-wracked season the Clippers are having, it's somewhat of an accomplishment."}
{"game_id": "0021700628", "chunk_id": "0021700628_002", "order": 2, "role": "body", "text": "Lou Williams scored 26 points in the Clippers' 126-105 win over the Sacramento Kings on Saturday, giving Los Angeles a 21-21 mark at the season's midpoint."}
{"game_id": "0021700628", "chunk_id": "0021700628_003", "order": 3, "role": "body", "text": "\"With all the guys that are out, we're just trying to hold the fort,\" coach Doc Rivers said."}
{"game_id": "0021700628", "chunk_id": "0021700628_004", "order": 4, "role": "body", "text": "Willie Reed added 14 points and 13 rebounds making his first start of the season in place of DeAndre Jordan, who has a sprained left ankle. Blake Griffin had 11 points and nine assists as one of eight Clippers in double figures."}
{"game_id": "0021700628", "chunk_id": "0021700628_005", "order": 5, "role": "body", "text": "\"Everyone can step up, it doesn't matter who it is,\" Reed said. \"I just try to be ready when the opportunity presents itself.\""}
{"game_id": "0021700628", "chunk_id": "0021700628_006", "order": 6, "role": "body", "text": "Their second game in three days against the last-place Kings was just what the doctor ordered for the Clippers."}
{"game_id": "0021700628", "chunk_id": "0021700628_007", "order": 7, "role": "body", "text": "Besides Jordan, they were without Austin Rivers and Danilo Gallinari. Patrick Beverley had season-ending knee surgery while C.J. Wilson is out indefinitely."}
{"game_id": "0021700628", "chunk_id": "0021700628_008", "order": 8, "role": "body", "text": "After the Kings scored the game's first four points, it was all Clippers. They shot 55 percent in building a 21-point lead in the first half, and were up 64-45 at the break."}
{"game_id": "0021700628", "chunk_id": "0021700628_009", "order": 9, "role": "body", "text": "Willie Cauley-Stein had 23 points and 13 rebounds for the Kings in their fourth straight loss. De'Aaron Fox added 17 points and 10 assists."}
{"game_id": "0021700628", "chunk_id": "0021700628_010", "order": 10, "role": "body", "text": "\"Sometimes when a team comes out and shoots the ball like the way they were doing, it's kind of difficult to bring that energy,\" Fox said, \"especially when we think we're playing good defense and then Lou hits the off-balance shot, but that's what he does.\""}
{"game_id": "0021700628", "chunk_id": "0021700628_011", "order": 11, "role": "body", "text": "The Kings picked up their scoring in the third, losing the quarter 28-23, but they still trailed 91-68 going into the fourth."}
{"game_id": "0021700628", "chunk_id": "0021700628_012", "order": 12, "role": "body", "text": "Reed and Griffin rested in the fourth, when the Clippers were outscored 37-35."}
{"game_id": "0021700628", "chunk_id": "0021700628_013", "order": 13, "role": "body", "text": "Los Angeles shot 56 percent from the floor for the game and outscored the Kings 60-50 in the paint."}
{"game_id": "0021700628", "chunk_id": "0021700628_015", "order": 15, "role": "body", "text": "Kings: They've lost five in a row to the Clippers and eight of the last nine. ... The Kings lost 121-115 when the teams played Thursday."}
{"game_id": "0021700628", "chunk_id": "0021700628_016", "order": 16, "role": "body", "text": "Clippers: Doc Rivers said he didn't think Jordan will be out long, but added, \"I can't guarantee it.\" ... Williams has scored 20 or more points off the bench in nine straight games, moving ahead of New Orleans' Jrue Holiday for the longest such streak among active players. ... Jordan's next game will tie him with Randy Smith for most played in franchise history at 715. ... Jordan is already the first player in franchise history to be with the team for 10 seasons."}
{"game_id": "0021700628", "chunk_id": "0021700628_018", "order": 18, "role": "body", "text": "The Kings fell to 13-29 and 6-16 on the road, and lost all four of their games against the Clippers this season."}
{"game_id": "0021700628", "chunk_id": "0021700628_019", "order": 19, "role": "body", "text": "\"Like, enough is enough,\" Cauley-Stein said. \"Coach (Dave Joerger) is at that point where he's not going to play you if you're not doing the right thing, and that's how it should be. Kind of like a college team. If you're not doing the job right, next man up and you'll get your turn when it comes back around.\""}
{"game_id": "0021700628", "chunk_id": "0021700628_021", "order": 21, "role": "body", "text": "Jordan sat out because of injury for the first time in his 10-year career. It was his first missed game of the season and just his second over the last two years."}
{"game_id": "0021700628", "chunk_id": "0021700628_023", "order": 23, "role": "body", "text": "Kings: At Oklahoma City on Monday."}
{"game_id": "0021700628", "chunk_id": "0021700628_024", "order": 24, "role": "body", "text": "Clippers: Host the Rockets on Monday in Chris Paul's return to Staples Center after being traded in June."}
{"game_id": "0021700628", "chunk_id": "0021700628_026", "order": 26, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
