{"game_id": "0021400828", "chunk_id": "0021400828_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- Marc Gasol felt the Memphis Grizzlies simply did what good teams do when down by double-digits: They come back.\nGasol scored 21 points, and Memphis overcame a 13-point deficit in the fourth quarter for a 98-92 victory over the Portland Trail Blazers on Sunday night.\n\"They got the big lead, but we kept playing, came out scoring well in the fourth and getting stops,\" he said. \"We kept scratching and clawing and getting closer and closer. Then we ended the game with a lot of stops.\"\nThe Grizzlies, off to the best start in franchise history at 40-14, were coming off a 10-day layoff because of the All-Star break.\nLaMarcus Aldridge was a late scratch for the Blazers because of a right thumb sprain. The four-time All-Star was injured during Friday's loss at Utah, but coach Terry Stotts said it wasn't serious.\nPortland carried a 77-64 lead into the final period, but Kosta Koufos connected on a hook shot and Gasol made a jumper to get Memphis within two at 85-83. Gasol hit another jumper before Tony Allen's dunk gave Memphis the lead with 4:13 left.\nNicolas Batum's 3-pointer put Portland ahead 90-89, but Courtney Lee answered for Memphis with a layup and a free throw. Damian Lillard missed a 3-pointer with 43.9 seconds left before Gasol's jumper helped secure the win for Memphis.\nLee had 19 points for the Grizzlies, who hadn't played since a 105-89 loss at Oklahoma City back on Feb. 11.\n\"We scored on 10 of our first 13 possessions in the fourth quarter, and then we got 15 stops on their last 18 possessions,\" Memphis coach Dave Joerger said. \"That's how we won the game.\"\nLillard had 18 points and seven assists for the Blazers, who were coming off a 92-76 loss at Utah on Friday night. Batum finished with 17 points and 10 rebounds.\n\"We let that one get away from us,\" Stotts said. \"A 13-point lead in the fourth quarter at home, you feel like you're in a good position to win the game.\"\nPortland's two new additions, Arron Afflalo and Alonzo Gee, joined the team for the first time since they were acquired in a trade with the Nuggets on Thursday at the deadline.\nThe Blazers sent guard Will Barton, forwards Thomas Robinson and Victor Claver and a conditional 2016 draft pick to Denver. The Nuggets waived Robinson and Claver on Sunday.\nAfflalo entered with just over five minutes left in the first quarter and the Grizzlies ahead. He hit a jumper with 4:43 to go and a short time later Batum hit a 3-pointer that gave the Blazers a 17-15 lead.\nMemphis made just one of its first nine shots in the second quarter to fall behind 32-21, but the Grizzlies responded with an 11-0 run capped by Mike Conley's tying layup. Jeff Green's dunk put Memphis up 36-33.\nThe teams went into the break tied at 38.\n\"We had a 13-point lead,\" Lillard said. \"One turnover led to another. We let them take us out of what we do.\"\nLast month, Aldridge injured ligaments in his left thumb and decided to undergo surgery, but then reversed himself 48 hours later and decided to play out the rest of the season.\nStotts said Aldridge should be able to play on Wednesday when the Blazers host the Spurs.\n\"L.A. is obviously the guy we go to when we're struggling -- the fact that we didn't have him in the fourth quarter, that's pretty obvious,\" Stotts said.\nTIP-INS\nGrizzlies: Memphis won the first two meetings with the Blazers this season; a 112-99 win in Portland on Nov. 28, and a 102-98 victory on Jan. 17 at Memphis.\nTrail Blazers: The Blazers honored the late Jerome Kersey, who played in Portland for 11 seasons in the 1980s and `90s, with 25 seconds of silence, in a nod to his jersey number. The team also showed a clip of him singing the national anthem in 1989 on the video scoreboard, which was met with thunderous applause at the Moda Center. Kersey, a fan favorite who made Portland his home, died suddenly on Wednesday at age 52.\nA LOOK AT THE CONFERENCE\nWith the win, Memphis remained in second place in the Western Conference behind Golden State. Portland dropped to fourth behind Houston.\n\"We need every win,\" Portland's Wesley Matthews said. \"Every game is important. Every game is even more so important when we are playing teams that are above us or next to us.\"\nUP NEXT\nGrizzlies: Visit the Los Angeles Clippers on Monday night.\nTrail Blazers: Host San Antonio on Wednesday night."}
