{"game_id": "0021201126", "chunk_id": "0021201126_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Miami Heat were without LeBron James, Dwyane Wade and Ray Allen on Friday night."}
{"game_id": "0021201126", "chunk_id": "0021201126_002", "order": 2, "role": "body", "text": "That didn't matter against the NBA-worst Charlotte Bobcats."}
{"game_id": "0021201126", "chunk_id": "0021201126_003", "order": 3, "role": "body", "text": "With a threesome averaging a combined 59 points per game sitting on the bench due to injuries, the Heat showed they can still win in a variety of ways -- which on this night meant perimeter shooting and stingy defense."}
{"game_id": "0021201126", "chunk_id": "0021201126_004", "order": 4, "role": "body", "text": "Mike Miller, who had played only sparingly up until two weeks ago, scored a season-high 26 points on seven 3-pointers as the injury-depleted Heat beat the Bobcats 89-79."}
{"game_id": "0021201126", "chunk_id": "0021201126_005", "order": 5, "role": "body", "text": "The 33-year-old Miller was 7 of 11 from beyond the 3-point arc, not bad for a guy who only scored a combined 41 points during January and February."}
{"game_id": "0021201126", "chunk_id": "0021201126_006", "order": 6, "role": "body", "text": "Chris Bosh chipped in with 18 points and eight rebounds, and Rashard Lewis added 14 points for Miami, which improved to 3-2 since Chicago snapped its 27-game winning streak."}
{"game_id": "0021201126", "chunk_id": "0021201126_007", "order": 7, "role": "body", "text": "\"Right now it's time for the guys who haven't been getting a lot of playing time to get a rhythm in case they need us in the playoffs,\" Miller said."}
{"game_id": "0021201126", "chunk_id": "0021201126_008", "order": 8, "role": "body", "text": "Heat coach Erik Spoelstra expects at some point the Heat will need Miller to make another run at an NBA title."}
{"game_id": "0021201126", "chunk_id": "0021201126_009", "order": 9, "role": "body", "text": "\"He is a big-time weapon that we have,\" Spoelstra said. \"He has absolutely bought into the sacrifice. You know the long season of an 82-game season, this is probably the healthiest he has ever been at this time of year and you see his value. He can strike it hot at any moment and go on a string of four, five, or six in a row.\""}
{"game_id": "0021201126", "chunk_id": "0021201126_010", "order": 10, "role": "body", "text": "The Heat held the Bobcats to 31.8 percent shooting from the field, their best defensive performance of the season."}
{"game_id": "0021201126", "chunk_id": "0021201126_011", "order": 11, "role": "body", "text": "The Bobcats scored just eight points in the third quarter on 3 of 18 shooting and the Heat opened a 13-point lead."}
{"game_id": "0021201126", "chunk_id": "0021201126_013", "order": 13, "role": "body", "text": "The Heat held Gerald Henderson and Kemba Walker, Charlotte's two hottest players, to a combined 5 of 31 shooting from the floor."}
{"game_id": "0021201126", "chunk_id": "0021201126_014", "order": 14, "role": "body", "text": "\"If you don't defend, you don't play on this team,\" said Miami's Shane Battier. \"We know what butters our bread. If you play hard on the defensive end, you get a three.\""}
{"game_id": "0021201126", "chunk_id": "0021201126_015", "order": 15, "role": "body", "text": "With the Heat having secured the No. 1 seed in the Eastern Conference playoffs, Spoelstra took no chances and rested James and Wade for a third straight game, as well as Allen, who tweaked his ankle earlier this week after tripping over a cameraman."}
{"game_id": "0021201126", "chunk_id": "0021201126_016", "order": 16, "role": "body", "text": "The Heat decided to win or lose with the 3-pointer, which played right into Miller's hands."}
{"game_id": "0021201126", "chunk_id": "0021201126_017", "order": 17, "role": "body", "text": "Although he looked at times like his legs were creaky and tired, Miller's shot remained as smooth as ever."}
{"game_id": "0021201126", "chunk_id": "0021201126_018", "order": 18, "role": "body", "text": "\"Mike can really stretch the floor,\" Bosh said. \"He's an underrated playmaker. He can hit guys and put them in scoring positions. He just knows how to play basketball. A lot of people forget sometimes because he is on a team that is very, very deep but when his number is called he is always ready. \""}
{"game_id": "0021201126", "chunk_id": "0021201126_019", "order": 19, "role": "body", "text": "Miami (59-16) is within three victories of setting a franchise record for wins in a regular season."}
{"game_id": "0021201126", "chunk_id": "0021201126_020", "order": 20, "role": "body", "text": "Rookie Michael Kidd-Gilchrist had 18 points and 14 rebounds for the Bobcats, who lost for only the second time in their last seven home games."}
{"game_id": "0021201126", "chunk_id": "0021201126_021", "order": 21, "role": "body", "text": "Henderson has been a catalyst for the Bobcats in recent weeks, averaging 22.9 points on 51 percent shooting over the past 14 games. He started out strong with eight points in the first quarter but quickly went cold and failed to score in the second and third quarters."}
{"game_id": "0021201126", "chunk_id": "0021201126_022", "order": 22, "role": "body", "text": "He got frustrated with the officiating, even drawing a technical foul in the second half. Henderson finished with 11 points on 2-of-16 shooting."}
{"game_id": "0021201126", "chunk_id": "0021201126_023", "order": 23, "role": "body", "text": "Walker had 12 points and shot 3 of 15."}
{"game_id": "0021201126", "chunk_id": "0021201126_024", "order": 24, "role": "body", "text": "\"They made me give the ball up,\" Walker said. \"I tried coming off ball screens but they were just always in the right spots. They collapsed on me. When I did get some shot opportunities I didn't get them to fall.\""}
{"game_id": "0021201126", "chunk_id": "0021201126_026", "order": 26, "role": "body", "text": "\"The first thing we always talk about every day and when we come into training camp is our defense,\" Bosh said. \"Especially with this group we have to play good defense to give ourselves a chance to win. I think we gave a good effort tonight and pretty much every night for that effort. We have locked up pretty well.\""}
{"game_id": "0021201126", "chunk_id": "0021201126_027", "order": 27, "role": "closing", "text": "Game notes Mario Chalmers returned for the Heat after missing the last three games with a sprained ankle and finished with six points and seven assists. ... This is the first time James has missed three consecutive games since signing with the Heat. ... Mike Hatchett Jr., a Bobcats fan from Columbia, S.C., won $7,777 when he swished a shot from halfcourt during a casino-sponsored promotion in the fourth quarter."}
