{"game_id": "0021700180", "chunk_id": "0021700180_001", "order": 1, "role": "lead", "text": "HOUSTON --  After beating Houston in the first two meetings this season, Memphis Grizzlies coach David Fizdale said he expected the Rockets to come out swinging on Saturday night."}
{"game_id": "0021700180", "chunk_id": "0021700180_002", "order": 2, "role": "body", "text": "Sure enough, the Rockets jumped out to a 9-0 lead by draining three straight 3s in the first two minutes of the game and never looked back in their 111-96 win over Memphis."}
{"game_id": "0021700180", "chunk_id": "0021700180_003", "order": 3, "role": "body", "text": "James Harden scored 38 points, and Houston hit 16 of 45 (35.6 percent) from beyond the arc, including 6 of 14 from Harden, who added eight assists and four rebounds. Eric Gordon added 26 points on 6 of 11 3-point shooting for Houston."}
{"game_id": "0021700180", "chunk_id": "0021700180_004", "order": 4, "role": "body", "text": "\"They had an edge tonight, which I expected,\" Fizdale said. \"They've got pride over there, and we had them 2-0 in the season series. We really expected them to come out hitting hard, but boy, they are tough when they're making shots like that.\""}
{"game_id": "0021700180", "chunk_id": "0021700180_005", "order": 5, "role": "body", "text": "Harden insisted Houston's intensity had nothing to do with their previous two losses against Memphis."}
{"game_id": "0021700180", "chunk_id": "0021700180_006", "order": 6, "role": "body", "text": "\"That's every game for us,\" Harden said. \"Offensively, we want to be aggressive, defensively, we want to be aggressive and create opportunities.\""}
{"game_id": "0021700180", "chunk_id": "0021700180_007", "order": 7, "role": "body", "text": "In their previous two meetings, Memphis held the Rockets to 90 and 89 points, the only two times the Rockets have been held under 100 points this season, and Houston's lowest two scoring efforts ever under head coach Mike D'Antoni."}
{"game_id": "0021700180", "chunk_id": "0021700180_008", "order": 8, "role": "body", "text": "The Rockets outdid their previous scoring against Memphis by the end of the third quarter, entering the fourth with a 93-70 lead. The Rockets hit at least 16 3s for a fifth straight game, matching an NBA record they set last season for the most consecutive games with 16 or more 3s."}
{"game_id": "0021700180", "chunk_id": "0021700180_009", "order": 9, "role": "body", "text": "Defensively, the Rockets had a season-high tying 14 steals while forcing 20 turnovers and improved to 5-1 in games where they recorded 10 or more steals."}
{"game_id": "0021700180", "chunk_id": "0021700180_010", "order": 10, "role": "body", "text": "In their 98-90 loss at home to Memphis on Oct. 23, the Rockets were outscored 20-2 in the final six minutes. On Saturday night, they were much more proactive about answering any upswing in Memphis' momentum."}
{"game_id": "0021700180", "chunk_id": "0021700180_011", "order": 11, "role": "body", "text": "\"It's not going to happen overnight, but as long as we're consistent and we know what the long-term goal is, we'll be all right,\" Harden said. \"There's going to be times when we get up big and let it slip away, but tonight was a really good job of, when they went on a run, we sustained it and built it back up.\""}
{"game_id": "0021700180", "chunk_id": "0021700180_012", "order": 12, "role": "body", "text": "Tyreke Evans led Memphis with 22 points in 29 minutes off the bench. Marc Gasol and Mike Conley struggled from the floor, scoring 15 and 12, respectively."}
{"game_id": "0021700180", "chunk_id": "0021700180_013", "order": 13, "role": "body", "text": "Ben McLemore made his season debut and Grizzlies debut, returning from an Aug. 8 surgery to repair a non-displaced fracture of the fifth metatarsal in his right foot. McLemore had four points and two rebounds in 18 minutes off the bench in his first game since joining the Grizzlies after four seasons in Sacramento."}
{"game_id": "0021700180", "chunk_id": "0021700180_014", "order": 14, "role": "body", "text": "The Rockets led 62-50 at halftime behind 22 first-half points from Harden."}
{"game_id": "0021700180", "chunk_id": "0021700180_016", "order": 16, "role": "body", "text": "Grizzlies: Memphis' bench outscored Houston's bench 50-19, led by Evans' 22 points and Chandler Parsons, who had 10. Memphis' bench entered Saturday outscoring opposing second units 483-281. The Grizzlies reserves have outscored their opposing counterparts in every game but one this season."}
{"game_id": "0021700180", "chunk_id": "0021700180_017", "order": 17, "role": "body", "text": "Rockets: Nene played seven minutes but sat out in the second half with ankle soreness. . Luc Mbah a Moute, who entered the game questionable with a left knee contusion, played 28 minutes. . Clint Capela had seven points, 14 rebounds and three blocks."}
{"game_id": "0021700180", "chunk_id": "0021700180_019", "order": 19, "role": "body", "text": "As part of Houston's new \"First Shot\" promotion where a local celebrity attempts a free-throw before tipoff for charity, retired astronaut and U.S. Navy Captain Mark Kelly clanked his shot off the backboard. Kelly sat courtside during the game with wife and former Congresswoman Gabrielle Giffords, Houston Police Chief Art Acevedo and Rockets owner Tilman Fertitta."}
{"game_id": "0021700180", "chunk_id": "0021700180_021", "order": 21, "role": "body", "text": "For the third straight home Rockets game since the Houston Astros won their first World Series, an Astros player was in attendance. This time, Astros utility player Marwin Gonzalez sat courtside next to Astros owner Jim Crane. When announced on the videoboard, Gonzalez received what sounded like the loudest ovation from the Toyota Center crowd of the night."}
{"game_id": "0021700180", "chunk_id": "0021700180_023", "order": 23, "role": "body", "text": "Grizzlies: Visit the Bucks on Monday night."}
{"game_id": "0021700180", "chunk_id": "0021700180_024", "order": 24, "role": "closing", "text": "Rockets: Visit the Pacers on Sunday night."}
