{"game_id": "0021200032", "chunk_id": "0021200032_001", "order": 1, "role": "lead", "text": "HOUSTON --  The way LaMarcus Aldridge was playing on Saturday night, Damian Lillard knew the Rockets would focus on the Trail Blazers' star in overtime."}
{"game_id": "0021200032", "chunk_id": "0021200032_002", "order": 2, "role": "body", "text": "When the rookie started getting more open looks, he delivered."}
{"game_id": "0021200032", "chunk_id": "0021200032_003", "order": 3, "role": "body", "text": "Lillard scored 20 points, including eight in overtime, and the Trail Blazers slowed down James Harden in a 95-85 win over Houston."}
{"game_id": "0021200032", "chunk_id": "0021200032_004", "order": 4, "role": "body", "text": "\"(Aldridge) had it rolling, he was dominating the game offensively, and I just wanted to make sure I was in the position to knock the shots down,\" Lillard said. \"(Aldridge) got going and I was able to get easier shots.\""}
{"game_id": "0021200032", "chunk_id": "0021200032_005", "order": 5, "role": "body", "text": "Aldridge finished with 27 points, 11 rebounds, six assists and two blocks for the Trail Blazers. All but four of Lillard's points came in the second half. He also had nine assists and six rebounds."}
{"game_id": "0021200032", "chunk_id": "0021200032_006", "order": 6, "role": "body", "text": "Lillard and Nicolas Batum each made a 3 to help Portland open an 87-81 lead in the extra session. Harden then made a pair of free throws before Lillard converted a reverse layup. His second 3 of overtime pushed Portland's lead to 93-85 with 1:25 remaining."}
{"game_id": "0021200032", "chunk_id": "0021200032_007", "order": 7, "role": "body", "text": "\"He made big shots for us, and that's what we need from him,\" Aldridge said of the first-round pick."}
{"game_id": "0021200032", "chunk_id": "0021200032_008", "order": 8, "role": "body", "text": "Harden led the Rockets with 24 points in his home debut, but he wasn't as dominant as he was in the first two games. He scored 37 and a career-high 45 points after he was acquired in a deal with Oklahoma City last week. The NBA's Sixth Man of the Year signed a five-year, $80 contract extension on Wednesday."}
{"game_id": "0021200032", "chunk_id": "0021200032_009", "order": 9, "role": "body", "text": "Batum had 17 points, Wesley Matthews scored 16 and J.J. Hickson added nine points and 12 rebounds for Portland."}
{"game_id": "0021200032", "chunk_id": "0021200032_010", "order": 10, "role": "body", "text": "Jeremy Lin had 13 points and seven assists in his home debut for the Rockets, who lost for the first time this season."}
{"game_id": "0021200032", "chunk_id": "0021200032_011", "order": 11, "role": "body", "text": "\"It wasn't the prettiest game today and I think both sides struggled to hit shots,\" Lin said. \"That's the way it goes sometimes.\""}
{"game_id": "0021200032", "chunk_id": "0021200032_012", "order": 12, "role": "body", "text": "The game was tied with 1:17 to go before Lin made a layup while being fouled by Hickson. He sunk the free throw to give Houston an 81-78 lead."}
{"game_id": "0021200032", "chunk_id": "0021200032_013", "order": 13, "role": "body", "text": "Matthews tied it again with a 3 with just under a minute left. He also guarded Harden most of the night."}
{"game_id": "0021200032", "chunk_id": "0021200032_014", "order": 14, "role": "body", "text": "\"When you put up 45 the night before, it kind of wears you out,\" Matthews said. \"We are friends, but when it's tipoff time there are no friends.\""}
{"game_id": "0021200032", "chunk_id": "0021200032_015", "order": 15, "role": "body", "text": "Houston had a chance to win it in regulation, but Portland knocked the ball out of Harden's hands seconds before the buzzer."}
{"game_id": "0021200032", "chunk_id": "0021200032_016", "order": 16, "role": "body", "text": "\"It was good defense,\" he said. \"I just lost the ball.\""}
{"game_id": "0021200032", "chunk_id": "0021200032_017", "order": 17, "role": "body", "text": "Portland led by five early in the fourth quarter before Marcus Morris hit consecutive 3-pointers to give Houston a 69-68 lead."}
{"game_id": "0021200032", "chunk_id": "0021200032_018", "order": 18, "role": "body", "text": "\"We didn't get quality shots,\" Houston coach Kevin McHale said. \"We got to get better at that.\""}
{"game_id": "0021200032", "chunk_id": "0021200032_019", "order": 19, "role": "body", "text": "Dozens of fake beards made to resemble Harden's trademark look dotted the sellout crowd of 18,140. The Rockets were selling them at the team store on Saturday night to take advantage of the excitement created by their newest acquisition. Houston's mascot Clutch even got in on the fun during a break in the third quarter and donned a fake beard, too."}
{"game_id": "0021200032", "chunk_id": "0021200032_020", "order": 20, "role": "body", "text": "Harden said he tweaked an ankle in the game and it slowed him a bit."}
{"game_id": "0021200032", "chunk_id": "0021200032_021", "order": 21, "role": "body", "text": "\"But I don't like to make excuses,\" he said. \"I had opportunities to make plays and to make shots and I just didn't.\""}
{"game_id": "0021200032", "chunk_id": "0021200032_022", "order": 22, "role": "body", "text": "Portland used a 12-4 run at the beginning of the second half to tie it at 49 as the Rockets struggled to find a rhythm in the third quarter."}
{"game_id": "0021200032", "chunk_id": "0021200032_023", "order": 23, "role": "body", "text": "Harden didn't score after halftime until he converted a three-point play with just over four minutes remaining in the third, giving Houston a 58-57 lead."}
{"game_id": "0021200032", "chunk_id": "0021200032_024", "order": 24, "role": "body", "text": "The Trail Blazers answered with seven straight points."}
{"game_id": "0021200032", "chunk_id": "0021200032_025", "order": 25, "role": "body", "text": "An alley-oop dunk by Morris got Houston rolling again and it trailed 64-63 entering the fourth quarter."}
{"game_id": "0021200032", "chunk_id": "0021200032_026", "order": 26, "role": "body", "text": "Harden grabbed a microphone and welcomed fans to the game before the national anthem, and got the team going by scoring Houston's first six points. He had 10 at the end of the first quarter to help the Rockets lead 19-17."}
{"game_id": "0021200032", "chunk_id": "0021200032_027", "order": 27, "role": "body", "text": "Houston opened the second quarter with a 10-0 run. The Trail Blazers' first points in the second came on a 3 by Matthews less than eight minutes before halftime."}
{"game_id": "0021200032", "chunk_id": "0021200032_028", "order": 28, "role": "body", "text": "That was the first of seven straight points for Portland before Lin got Houston going again by hitting a nifty one-handed layup and the foul shot."}
{"game_id": "0021200032", "chunk_id": "0021200032_029", "order": 29, "role": "body", "text": "The Rockets led 45-37 at halftime."}
{"game_id": "0021200032", "chunk_id": "0021200032_030", "order": 30, "role": "closing", "text": "Game notes Omer Asik, who had a career-high 19 rebounds on Friday, had 15 rebounds for Houston and Morris finished with 13 points. ...  Chandler Parsons had 12 rebounds for the Rockets. ... Aldridge has scored at least 20 points in each of his last nine regular-season games against Houston."}
