{"game_id": "0021700985", "chunk_id": "0021700985_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Garrett Temple's second big game against Orlando this season coincided with Sacramento teammate Kosta Koufos' first double-double in nearly a month."}
{"game_id": "0021700985", "chunk_id": "0021700985_002", "order": 2, "role": "body", "text": "With the Kings missing two key starters, the combination did just enough to make up for the absences and helped coach Dave Joerger earn his 200th career win."}
{"game_id": "0021700985", "chunk_id": "0021700985_003", "order": 3, "role": "body", "text": "Temple scored 23 points, Koufos had a season-high 18 points and 13 rebounds, and the Kings beat the Magic 94-88 on Friday night."}
{"game_id": "0021700985", "chunk_id": "0021700985_004", "order": 4, "role": "body", "text": "It was Temple's highest point total since Jan. 23 when he put up a career-best 34 points in Sacramento's 105-99 win over the Magic in Orlando."}
{"game_id": "0021700985", "chunk_id": "0021700985_005", "order": 5, "role": "body", "text": "\"Sometimes you just feel like you play well against certain teams, and Orlando's one of those teams,\" said Temple, who made 21 of 27 shots in the two wins over the Magic this season. \"One of their writers asked me that during shootaround. I don't know. It is what it is.\""}
{"game_id": "0021700985", "chunk_id": "0021700985_006", "order": 6, "role": "body", "text": "Vince Carter added 15 points and Skal Labissiere had eight points and seven rebounds for Sacramento before leaving with an injured left hip. The Kings have won three of five after losing their first four coming out of the All-Star break."}
{"game_id": "0021700985", "chunk_id": "0021700985_007", "order": 7, "role": "body", "text": "Koufos and Temple made rare starts with center Willie Cauley-Stein and rookie point guard De'Aaron Fox out nursing injuries and helped Sacramento complete a sweep of Orlando in a matchup of two struggling teams."}
{"game_id": "0021700985", "chunk_id": "0021700985_008", "order": 8, "role": "body", "text": "The duo shot a combined 16 of 22 and did most of their scoring in the second half when the Kings led by 15. Koufos had his first double-double since Feb. 11."}
{"game_id": "0021700985", "chunk_id": "0021700985_009", "order": 9, "role": "body", "text": "\"I've had Kosta for four years and I've been talking about how valuable and how good of a player he is,\" Joerger said. \"He took a knee in the thigh early in the second half and plays 38 minutes. Fantastic.\""}
{"game_id": "0021700985", "chunk_id": "0021700985_010", "order": 10, "role": "body", "text": "Carter, the 41-year-old former dunk king, pitched in with nine of his points in the fourth quarter to help Sacramento hold on."}
{"game_id": "0021700985", "chunk_id": "0021700985_011", "order": 11, "role": "body", "text": "Jonathon Simmons had 25 points and six assists for Orlando. Nikola Vucevic added 13 points and Mario Hezonja scored 11. The Magic have lost 10 of 12."}
{"game_id": "0021700985", "chunk_id": "0021700985_012", "order": 12, "role": "body", "text": "Orlando played its first game since losing Evan Fournier to a torn left MCL he suffered Wednesday in Los Angeles. Fournier has said he is optimistic about returning before the end of the regular season."}
{"game_id": "0021700985", "chunk_id": "0021700985_013", "order": 13, "role": "body", "text": "\"We weren't in sync and I didn't like that we didn't pay attention to details,\" Magic coach Frank Vogel said. \"We didn't make good decisions. We were just a little bit out of rhythm.\""}
{"game_id": "0021700985", "chunk_id": "0021700985_015", "order": 15, "role": "body", "text": "Magic: Orlando missed eight of its first night shots to begin the game. . D.J. Augustin was questionable before the game because of a sore right ankle but he started and had 12 points with seven assists in 28 minutes."}
{"game_id": "0021700985", "chunk_id": "0021700985_016", "order": 16, "role": "body", "text": "Kings: Bogdan Bogdanovic went more than six quarters without scoring before making a 19-foot jumper early in the third quarter. ... Fox was held out after suffering a lower back strain in the first quarter of Wednesday's loss to New Orleans. ... Cauley-Stein missed his fourth straight game with a lower back strain. . Two-way player and fan favorite Jack Cooley scored the team's first six points of the fourth quarter."}
{"game_id": "0021700985", "chunk_id": "0021700985_018", "order": 18, "role": "body", "text": "Labissiere suffered a bruised hip while attempting to dunk on a lob pass from Buddy Hield in the first quarter. Labisssiere was fouled from behind by Jonathon Simmons, crashed hard to the court and lay there for several moments while being attended to by a team trainer before being helped to his feet. He returned and played 7 1/2 minutes in the third before going to the bench for good."}
{"game_id": "0021700985", "chunk_id": "0021700985_019", "order": 19, "role": "body", "text": "\"That was a crash,\" Joerger said. \"Didn't look dirty to me but it was a violent landing.\""}
{"game_id": "0021700985", "chunk_id": "0021700985_021", "order": 21, "role": "body", "text": "The two teams combined for 36 points in the first quarter. By comparison, three Sacramento opponents have had 36 or more in the first quarter this season."}
{"game_id": "0021700985", "chunk_id": "0021700985_023", "order": 23, "role": "body", "text": "Magic: Travel to Los Angeles to play the Clippers on Saturday."}
{"game_id": "0021700985", "chunk_id": "0021700985_024", "order": 24, "role": "closing", "text": "Kings: Play at Denver on Sunday."}
