{"game_id": "0021200397", "chunk_id": "0021200397_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Those naysayers who don't believe the Portland Trail Blazers will have much success in a rebuilding season might have it all wrong, at least according to Damian Lillard."}
{"game_id": "0021200397", "chunk_id": "0021200397_002", "order": 2, "role": "body", "text": "The NBA's reigning Rookie of the Month had 25 points and seven assists as the Blazers pulled above .500 (13-12) with a 96-93 victory over the Phoenix Suns on Saturday night. Eighteen of Lillard's points came in the second half."}
{"game_id": "0021200397", "chunk_id": "0021200397_003", "order": 3, "role": "body", "text": "It was Portland's fifth straight win -- the team's longest streak since February 2011 when they won six in a row."}
{"game_id": "0021200397", "chunk_id": "0021200397_004", "order": 4, "role": "body", "text": "\"It lets us know we're going in the right direction,\" Lillard said. \"For us to be able to come from four games below .500 and be able to get on a winning streak and get it done, I think it says a lot about where we're headed.\""}
{"game_id": "0021200397", "chunk_id": "0021200397_005", "order": 5, "role": "body", "text": "J.J. Hickson had 19 points and 15 rebounds for his seventh straight double-double, and Nicolas Batum had 13 points, nine rebounds and eight assists. While it is only December, the Blazers are in the thick of the Western Conference race."}
{"game_id": "0021200397", "chunk_id": "0021200397_006", "order": 6, "role": "body", "text": "\"I'm not going to say we're that good but I think we're capable of being a playoff team as long as we keep doing what we're doing,\" Lillard said."}
{"game_id": "0021200397", "chunk_id": "0021200397_007", "order": 7, "role": "body", "text": "Sasha Pavlovic and Lillard made consecutive 3-pointers as Portland pulled in front 92-85 with 4:02 left. The Suns got to within 94-91 on Marcin Gortat's layup with 1:24 to go."}
{"game_id": "0021200397", "chunk_id": "0021200397_008", "order": 8, "role": "body", "text": "After Lillard's 19-foot, step-back jumper, Jared Dudley had a layup for the Suns to make it 96-93. Phoenix furiously tried to get off a shot in the final seconds, but Goran Dragic missed a 3-pointer, and Shannon Brown missed a short jumper."}
{"game_id": "0021200397", "chunk_id": "0021200397_009", "order": 9, "role": "body", "text": "\"We had a timeout left. We had an opportunity to go down, and I thought we could get a quick two with a timeout left,\" Suns coach Alvin Gentry said. \"Then we peeled off and started looking for a three, and just never got the timeout called.\""}
{"game_id": "0021200397", "chunk_id": "0021200397_010", "order": 10, "role": "body", "text": "Gortat had 18 points and nine rebounds for the Suns, who led by as many as 12 points in the first half. The loss snapped a four-game winning streak for Phoenix."}
{"game_id": "0021200397", "chunk_id": "0021200397_011", "order": 11, "role": "body", "text": "Portland welcomed back LaMarcus Aldridge, who leads the team with an average of 21 points and eight rebounds per game. The All-Star forward sprained his left ankle in the final minute of a win over New Orleans last Sunday and missed the Blazers' 101-93 victory over Denver on Thursday."}
{"game_id": "0021200397", "chunk_id": "0021200397_012", "order": 12, "role": "body", "text": "Shooting guard Wesley Matthews also started for the Blazers, despite ongoing hip pain, but played only a short time. Matthews said that had the game been scheduled for Friday, he wouldn't have been able to go."}
{"game_id": "0021200397", "chunk_id": "0021200397_013", "order": 13, "role": "body", "text": "Matthews came out of the game with 2:11 left in the first quarter and headed for the locker room. He didn't return, and the Blazers announced after the game that he would not accompany the team to Sacramento for Sunday night's game against the Kings."}
{"game_id": "0021200397", "chunk_id": "0021200397_014", "order": 14, "role": "body", "text": "Former Blazer Sebastian Telfair's steal led to a pull-up 3-pointer that gave the Suns a 41-35 lead midway through the second quarter. Another former Blazer, Jermaine O'Neal, pushed the lead to 47-35 with a jumper and a pair of free throws to cap a 14-2 Phoenix run."}
{"game_id": "0021200397", "chunk_id": "0021200397_015", "order": 15, "role": "body", "text": "Luis Scola's 19-foot jumper made it 53-44 for the Suns at the break, but Portland jumped out in the second half and got as close as 63-62 after a long jumper from Lillard."}
{"game_id": "0021200397", "chunk_id": "0021200397_016", "order": 16, "role": "body", "text": "The Suns answered with a 10-1 run to make it 73-63, but the Blazers again caught up. Lillard's hook shot tied it with 20 seconds left in the third quarter."}
{"game_id": "0021200397", "chunk_id": "0021200397_017", "order": 17, "role": "body", "text": "Lillard, the No. 6 pick in the NBA draft out of Weber State, went into the game leading rookies with 18.5 points per game. He has 14 games this season with at least 20 points."}
{"game_id": "0021200397", "chunk_id": "0021200397_018", "order": 18, "role": "body", "text": "Hickson's dunk and free throw to open the fourth quarter gave the Blazers a 78-75 lead. Ronnie Price's layup gave the Blazers an 84-83 edge with 6:28 left, and Lillard added a pair of free throws."}
{"game_id": "0021200397", "chunk_id": "0021200397_019", "order": 19, "role": "body", "text": "O'Neal is impressed by Lillard, who had 24 points against the Suns earlier this season."}
{"game_id": "0021200397", "chunk_id": "0021200397_020", "order": 20, "role": "body", "text": "\"It's funny because you can't read his face. Sometimes the light which is the glare of being a rookie in the NBA becomes so bright that you see it affect some of the guys emotionally or physically,\" O'Neal said. \"He does a great job keeping his demeanor. He loves the big shot, obviously, he took some big ones. I think he's definitely the future of this team.\""}
{"game_id": "0021200397", "chunk_id": "0021200397_021", "order": 21, "role": "body", "text": "The Suns were coming off a 121-104 victory over Charlotte on Wednesday night."}
{"game_id": "0021200397", "chunk_id": "0021200397_022", "order": 22, "role": "closing", "text": "Game notes Hickson's seven consecutive double-doubles are a career high. The last Blazers player with seven straight was Arvydas Sabonis, from Nov. 4-17, 1997. ... Portland has won seven consecutive regular-season home games against the Suns. ... The Suns beat the Blazers 114-87 earlier this season. ... Dudley had a career-high 10 assists."}
