{"game_id": "0021200442", "chunk_id": "0021200442_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Rudy Gay re-entered a close game with about five minutes left and ended the Denver Nuggets' hopes of earning a win on the second night of back-to-back games."}
{"game_id": "0021200442", "chunk_id": "0021200442_002", "order": 2, "role": "body", "text": "Gay scored eight of his 19 points down the stretch and Memphis' rested starters pulled away for an 81-72 victory on Saturday night."}
{"game_id": "0021200442", "chunk_id": "0021200442_003", "order": 3, "role": "body", "text": "\"His work was definitely showing tonight,\" Memphis guard Tony Allen said of Gay. \"He carried us down the stretch. He made the big boy baskets down the stretch.\""}
{"game_id": "0021200442", "chunk_id": "0021200442_004", "order": 4, "role": "body", "text": "Gay's rush was part of 10 straight points for Memphis, breaking open a 68-68 game with 4:45 left. His 18-footer on the baseline with 1:25 left gave Memphis a 10-point lead, helping the Grizzlies snap a two-game losing streak."}
{"game_id": "0021200442", "chunk_id": "0021200442_005", "order": 5, "role": "body", "text": "Zach Randolph had 12 points for Memphis, which won despite shooting 40 percent. The Grizzlies outscored the Nuggets 28-15 in the fourth, eventually building the lead to 11 points."}
{"game_id": "0021200442", "chunk_id": "0021200442_006", "order": 6, "role": "body", "text": "Andre Iguodala, Corey Brewer and JaVale McGee each had 12 points for Denver, which had its two-game winning streak end. Kenneth Faried had 11 points for the Nuggets, hitting 5 of 7 shots."}
{"game_id": "0021200442", "chunk_id": "0021200442_007", "order": 7, "role": "body", "text": "Danilo Gallinari, coming off a career-high 39 points Friday night against Dallas, was held to 7 points on 2-of-8 shooting."}
{"game_id": "0021200442", "chunk_id": "0021200442_008", "order": 8, "role": "body", "text": "\"We just ran out of gas, and ran out of bodies,\" Nuggets coach George Karl said. \"We didn't have anybody really playing a great game. We worked them as hard as we could. The fight was good, but then with the fourth quarter and turnovers, it just broke our hearts.\""}
{"game_id": "0021200442", "chunk_id": "0021200442_009", "order": 9, "role": "body", "text": "The back-to-back games and good play by Memphis' bench in the fourth quarter combined to pose problems for Denver in the closing minutes."}
{"game_id": "0021200442", "chunk_id": "0021200442_010", "order": 10, "role": "body", "text": "\"They had more energy than us in the fourth quarter,\" Brewer said. \"Their bench came in and played great for them. ...We are on the fourth (game) in five nights. It is tough.\""}
{"game_id": "0021200442", "chunk_id": "0021200442_011", "order": 11, "role": "body", "text": "The game was tied at 68 when Gay took over. He scored on a pair of layups, the second coming on a feed from Randolph. He hit a 12-foot fadeaway before Randolph scored inside."}
{"game_id": "0021200442", "chunk_id": "0021200442_012", "order": 12, "role": "body", "text": "Gay capped the 10-0 stretch with an 18-foot baseline jumper for a 78-68 lead with 1:25 left."}
{"game_id": "0021200442", "chunk_id": "0021200442_013", "order": 13, "role": "body", "text": "\"Rudy was great. He went in the game for us and made big shots,\" reserve guard Jerryd Bayless said. \"That is what Rudy is supposed to do. He is our guy, and we have to ride him as far as he can go.\""}
{"game_id": "0021200442", "chunk_id": "0021200442_014", "order": 14, "role": "body", "text": "Wayne Ellington's 3-pointer with 23 seconds remaining gave Memphis its largest lead, 81-70."}
{"game_id": "0021200442", "chunk_id": "0021200442_015", "order": 15, "role": "body", "text": "While the fourth-quarter rally fueled by Gay put the Grizzlies past the Nuggets down the stretch, a major component was Memphis' second unit playing extended minutes in the final period, staying close to the Nuggets. That helped the Memphis starters stay on the bench until coach Lionel Hollins sent Gay, then Randolph and point guard Mike Conley, back into the game on either side of the 5-minute mark."}
{"game_id": "0021200442", "chunk_id": "0021200442_016", "order": 16, "role": "body", "text": "\"I was fresh, because of the second group playing so well, and I could go out there and be in attack mode,\" Gay said."}
{"game_id": "0021200442", "chunk_id": "0021200442_017", "order": 17, "role": "body", "text": "Denver scored 48 points in the paint, while holding the Grizzlies to a season-low 30 points, but neither team shot well from 3-point range with Denver hitting 3 of 16, while Memphis managed 5 of 19."}
{"game_id": "0021200442", "chunk_id": "0021200442_018", "order": 18, "role": "body", "text": "Memphis held a seven-point lead in the first half, but needed a jumper from Bayless in the final second to hold a 37-36 advantage entering the locker room."}
{"game_id": "0021200442", "chunk_id": "0021200442_019", "order": 19, "role": "body", "text": "McGee gave the Nuggets their first lead of the game on a dunk with 8.1 seconds left in the half."}
{"game_id": "0021200442", "chunk_id": "0021200442_020", "order": 20, "role": "body", "text": "Gay led Memphis with 10 points at the break, but the game was rather sloppy as Memphis shot 39.5 percent from the field, compared to 45 percent for Denver. The two teams were a combined 3 of 15 from outside the arc."}
{"game_id": "0021200442", "chunk_id": "0021200442_021", "order": 21, "role": "body", "text": "No Denver players were in double figures at the half, and Gallinari, who had hit 14 of 23 against Dallas, was scoreless, missing all three of his shots."}
{"game_id": "0021200442", "chunk_id": "0021200442_022", "order": 22, "role": "body", "text": "That slump ended immediately at the start of the second half as Gallinari connected on a 3-pointer, but he would not score his other field goal until the closing seconds."}
{"game_id": "0021200442", "chunk_id": "0021200442_023", "order": 23, "role": "body", "text": "The game settled into a close affair after halftime with seven lead changes and five ties in the third quarter."}
{"game_id": "0021200442", "chunk_id": "0021200442_024", "order": 24, "role": "body", "text": "The night ended with 12 lead changes and nine ties."}
{"game_id": "0021200442", "chunk_id": "0021200442_025", "order": 25, "role": "body", "text": "With some expecting the Grizzlies and Nuggets to be jockeying for playoff positioning at the end of the season, the win was important for Memphis. Denver had won the two previous meetings this season and a third would have given the Nuggets the potential tiebreaker."}
{"game_id": "0021200442", "chunk_id": "0021200442_026", "order": 26, "role": "body", "text": "\"It was just important to get a win,\" Hollins said when asked about losing three to the Nuggets. \"I don't think (Denver) specifically mattered, they just happened to be the opponent. We had lost two in a row, and we needed to get back to playing our game.\""}
{"game_id": "0021200442", "chunk_id": "0021200442_027", "order": 27, "role": "closing", "text": "Game notes Gay returned after missing Memphis' last game on Wednesday with flight problems getting back to Memphis after the Christmas holiday. ... The Grizzlies play five of their next six games on the road. ... Memphis G/F Quincy Pondexter was carried off with an apparent knee injury late in the third quarter. He did not return. ... Even with the loss, Denver has won 14 of the last 20 in the series. ... Denver is now 13-3 when holding opponents under 100. .Marreese Speights led Memphis with 10 rebounds, including six off the offensive glass, the first time this season he has led the Grizzlies in rebounds."}
