{"game_id": "0021200860", "chunk_id": "0021200860_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Ty Lawson had George Karl's blessing to take over."}
{"game_id": "0021200860", "chunk_id": "0021200860_002", "order": 2, "role": "body", "text": "Lawson had 12 of his 30 points in the fourth quarter as the Denver Nuggets scrambled down the stretch but held off the Blazers 111-109 on Wednesday night."}
{"game_id": "0021200860", "chunk_id": "0021200860_003", "order": 3, "role": "body", "text": "\"I tried to get everyone involved, but as the game was coming down and we needed big shots. I just tried to take it to the hole,\" Lawson said. \"Today, I was knocking 'em down.\""}
{"game_id": "0021200860", "chunk_id": "0021200860_004", "order": 4, "role": "body", "text": "Denver, which led by as many as 12 points in the first half, lost the lead to the Blazers late in the third quarter but went ahead 96-95 on Lawson's layup with 4:54 left."}
{"game_id": "0021200860", "chunk_id": "0021200860_005", "order": 5, "role": "body", "text": "After rookie Damian Lillard's layup briefly put the Blazers back up 101-10, Andre Iguodala and Lawson scored to give  Denver a 106-101 lead. Wesley Matthews answered with a 3-pointer and LaMarcus Aldridge added a turnaround jumper that tied it at 106 with 33.8 seconds left."}
{"game_id": "0021200860", "chunk_id": "0021200860_006", "order": 6, "role": "body", "text": "But former Blazer Andre Miller's scoop under the basket with 24.9 seconds to go gave the Nuggets back the lead, and Aldridge missed a jumper on the other end. Lillard made a 3-pointer as time wound down and Miller made free throws for the final margin."}
{"game_id": "0021200860", "chunk_id": "0021200860_007", "order": 7, "role": "body", "text": "\"It was kind of funny, we were running a play and he (Lawson) swung it and we got a lousy shot,\" Karl said. \"So I just said to him, `We're not gonna run any more plays. You've got one option, go into the paint and find it. Find the shot, not someone else.\""}
{"game_id": "0021200860", "chunk_id": "0021200860_008", "order": 8, "role": "body", "text": "Iguodala matched his season high with 29 for the Nuggets, who snapped a six-game losing streak at the Rose Garden. Denver outscored the Blazers 32-27 and shot 59.1 percent from the field in the final quarter."}
{"game_id": "0021200860", "chunk_id": "0021200860_009", "order": 9, "role": "body", "text": "Lillard led Portland with 26 points and J.J. Hickson had his 31st double-double of the season with 18 points and 14 rebounds."}
{"game_id": "0021200860", "chunk_id": "0021200860_010", "order": 10, "role": "body", "text": "\"It's tough to come up short at the end of a game that we really needed to win,\" Lillard said."}
{"game_id": "0021200860", "chunk_id": "0021200860_011", "order": 11, "role": "body", "text": "The Nuggets were without starter Danilo Gallinari, the team's leading scorer with an average of 16.9 points per game, for the second straight game because of a left thigh bruise. Wilson Chandler started again in his place."}
{"game_id": "0021200860", "chunk_id": "0021200860_012", "order": 12, "role": "body", "text": "Even without Gallinari, the Nuggets defeated the Lakers 119-108 on Monday, their seventh straight win at home. Denver is currently sitting in fifth place in the Western Conference standings."}
{"game_id": "0021200860", "chunk_id": "0021200860_013", "order": 13, "role": "body", "text": "The Blazers were coming off a 92-86 victory over Boston on Sunday night that snapped a season-high seven-game losing streak."}
{"game_id": "0021200860", "chunk_id": "0021200860_014", "order": 14, "role": "body", "text": "Portland is still clinging to playoff hopes, but its chances are growing dim. Portland is four games back of Houston for the eighth and final spot in the West. The Lakers are 2½ games behind the Rockets."}
{"game_id": "0021200860", "chunk_id": "0021200860_015", "order": 15, "role": "body", "text": "\"It was our third good game in a row, we've just come up short in two out of the three,\" Blazers coach Terry Stotts said. \"I liked the way we competed in the second half. They're a talented team and they caused a lot of problems for us on the defensive end by what they do, but we stayed with it.\""}
{"game_id": "0021200860", "chunk_id": "0021200860_016", "order": 16, "role": "body", "text": "The Blazers went on an 8-0 run capped by Lillard's bank shot to pull within 43-37 midway through the second quarter, but the Nuggets led 58-50 at halftime, paced by Lawson's 16 points."}
{"game_id": "0021200860", "chunk_id": "0021200860_017", "order": 17, "role": "body", "text": "The Blazers kept threatening in the third quarter, but Denver kept holding them off. After Lillard's 3-pointer got Portland as close a 62-61, Kenneth Faried dunked and made a layup to stem the threat. Nicolas Batum's dunk got the Blazers to 72-70, but Iguodala answered with a 3-pointer."}
{"game_id": "0021200860", "chunk_id": "0021200860_018", "order": 18, "role": "body", "text": "Rookie Meyers Leonard finally gave Portland lead with a dunk that made it 80-79 with 53 seconds left in the third quarter. For good measure, he dunked again over Miller to extend it."}
{"game_id": "0021200860", "chunk_id": "0021200860_019", "order": 19, "role": "body", "text": "Leonard, who turned 21 on Wednesday, celebrated by flexing his muscles Incredible Hulk-style. He finished with a career-high 13 points."}
{"game_id": "0021200860", "chunk_id": "0021200860_020", "order": 20, "role": "body", "text": "Faried tied it at 92 with a dunk, and Lawson's layup gave Denver back the lead at 94-92 with just more than six minutes left in the game. Wesley Matthews gave the Blazers back the lead with a 3-pointer, but 19 turnovers hurt Portland."}
{"game_id": "0021200860", "chunk_id": "0021200860_021", "order": 21, "role": "body", "text": "\"This arena is so tough to play in,\" Lawson said. \"They (the Blazers) have so much energy and knock down big 3s. There's a lot of heartbreakers that went down in this building.\""}
{"game_id": "0021200860", "chunk_id": "0021200860_022", "order": 22, "role": "closing", "text": "Game notes Lillard was given his trophy for winning the NBA Skills Challenge at All-Star Weekend. Because the award is sponsored by Taco Bell, everybody at the Rose Garden was going to get a coupon for a free chalupa on the way out.  ... The teams split their two earlier meetings this season, with each team winning at home. ... Matthews has hit at least four 3-pointers in three straight games."}
