{"game_id": "0021400670", "chunk_id": "0021400670_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  The Memphis Grizzlies closed out their longest homestand of the season by dominating another struggling visitor from the Eastern Conference."}
{"game_id": "0021400670", "chunk_id": "0021400670_002", "order": 2, "role": "body", "text": "Zach Randolph had 24 points and 10 rebounds, Marc Gasol added 16 points and 10 boards, and Memphis beat the Orlando Magic 103-94 on Monday night. The victory, the Grizzlies' third straight, gave them a 4-1 record during the homestand."}
{"game_id": "0021400670", "chunk_id": "0021400670_003", "order": 3, "role": "body", "text": "Randolph was the catalyst early as the Grizzlies, who beat the Philadelphia 76ers 101-83 Saturday, were never really threatened. They had a double-digit advantage midway through the second period and built the lead to 20 before halftime."}
{"game_id": "0021400670", "chunk_id": "0021400670_004", "order": 4, "role": "body", "text": "\"He got it going early, and even played 15 minutes straight. Then still got mad when I took him out,\" Memphis coach Dave Joerger said of Randolph. \"I mean, he was rolling .The guy's fantastic.\""}
{"game_id": "0021400670", "chunk_id": "0021400670_005", "order": 5, "role": "body", "text": "Orlando did tighten things up in the fourth quarter, cutting the lead to nine twice, including the final margin, but never got closer, even though the Magic outscored Memphis 21-14 in the final frame."}
{"game_id": "0021400670", "chunk_id": "0021400670_006", "order": 6, "role": "body", "text": "\"Twenty-two points in the third and a 14-point fourth quarter (for Memphis), that will give you a chance to win games and compete,\" Magic coach Jacque Vaughn said. \"It's a willingness to get dirty, play together and not mind getting hit.\""}
{"game_id": "0021400670", "chunk_id": "0021400670_007", "order": 7, "role": "body", "text": "Beno Udrih added 15 points and Jeff Green finished with 12 for Memphis. Randolph also had six assists, leading to hopes of a triple-double that faded with limited minutes in the fourth."}
{"game_id": "0021400670", "chunk_id": "0021400670_008", "order": 8, "role": "body", "text": "\"I'm just playing,\" Randolph said. \"I'm feeling good and getting into rhythm and just playing.\""}
{"game_id": "0021400670", "chunk_id": "0021400670_009", "order": 9, "role": "body", "text": "Orlando, which dropped its sixth in a row, got 18 points and 12 rebounds from Nikola Vucevic. Victor Oladipo also had 18 points and Elfrid Payton had 12 points and six assists, but shot 5 of 14 from the field. Dewayne Dedmon had 10 points and 10 rebounds."}
{"game_id": "0021400670", "chunk_id": "0021400670_010", "order": 10, "role": "body", "text": "Both teams shot 47 percent for the game. The Magic outrebounded Memphis 44-39, and outscored the Grizzlies in the paint -- Memphis' strong suit -- 48-40."}
{"game_id": "0021400670", "chunk_id": "0021400670_011", "order": 11, "role": "body", "text": "\"To continue to fight back against a good Memphis team and cut the lead to 10, I think our confidence is pretty good,\" Vaughn said."}
{"game_id": "0021400670", "chunk_id": "0021400670_012", "order": 12, "role": "body", "text": "Memphis seemed in control in the fourth until Orlando cut it to 101-91, thwarting Joerger's plan to rest most of his starters for the bulk of the final period."}
{"game_id": "0021400670", "chunk_id": "0021400670_013", "order": 13, "role": "body", "text": "Inserting a couple of starters was enough to send Memphis to its eighth straight win over the Magic."}
{"game_id": "0021400670", "chunk_id": "0021400670_014", "order": 14, "role": "body", "text": "\"We were hoping (the reserves) could finish, but I think they did a real good job in the first half,\" Joerger said. \".We just had way too many turnovers. The little stuff is bothering me right now."}
{"game_id": "0021400670", "chunk_id": "0021400670_015", "order": 15, "role": "body", "text": "\"Did we get the win? Yes,\" Joerger added. \"And, by and large, we're playing pretty well.\""}
{"game_id": "0021400670", "chunk_id": "0021400670_018", "order": 18, "role": "body", "text": "MAGIC: The six-game losing streak matches Orlando's longest slide of the season. ... Vucevic has 27 double-doubles this season. ... Orlando reserve Tobias Harris finished with eight points, marking only the second time in 41 games he's played this season that he didn't reach double figures."}
{"game_id": "0021400670", "chunk_id": "0021400670_019", "order": 19, "role": "body", "text": "Grizzlies: G Tony Allen was inactive with a left ankle sprain. He was injured in Saturday's game against Philadelphia. ... Memphis has not lost a home game to the Magic since Jan. 23. 2008. ... It was Vince Carter's birthday, as the reserve 3-point shooter turned 38."}
{"game_id": "0021400670", "chunk_id": "0021400670_021", "order": 21, "role": "body", "text": "Randolph's double-double was the 15th consecutive game in which he played that he reached the mark. It's the longest stretch of consecutive double-doubles in his career. He now has 25 double-doubles on the season."}
{"game_id": "0021400670", "chunk_id": "0021400670_023", "order": 23, "role": "body", "text": "Memphis point guard Mike Conley did not play in the fourth quarter because of a sprained left wrist. His status for Tuesday in Dallas is uncertain. \"I just wanted to rest it,\" Conley said. \"It was painful in the second half. We'll see how it goes.\""}
{"game_id": "0021400670", "chunk_id": "0021400670_025", "order": 25, "role": "body", "text": "Magic: Host Milwaukee on Thursday."}
{"game_id": "0021400670", "chunk_id": "0021400670_026", "order": 26, "role": "closing", "text": "Grizzlies: At Dallas on Tuesday."}
