{"game_id": "0021700649", "chunk_id": "0021700649_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  With Bismack Biyombo and rookie Khem Birch providing boards and blocks, the Orlando Magic won for the first time in 2018."}
{"game_id": "0021700649", "chunk_id": "0021700649_002", "order": 2, "role": "body", "text": "The duo combined for 26 rebounds and nine blocked shots in Orlando's 108-102 victory over the Minnesota Timberwolves on Tuesday night."}
{"game_id": "0021700649", "chunk_id": "0021700649_003", "order": 3, "role": "body", "text": "Statistically the worst rebounding team in the NBA, the Magic had a 51-37 edge on the boards and broke a seven-game losing streak against a team that had won five straight."}
{"game_id": "0021700649", "chunk_id": "0021700649_004", "order": 4, "role": "body", "text": "\"Biyombo is a very hard-playing guy and Birch hurt us, so the rebounding was problematic,\" said Minnesota coach Tom Thibodeau. \"I thought we were in position to win but if you don't rebound the ball, you're putting yourself in a big hole.\""}
{"game_id": "0021700649", "chunk_id": "0021700649_005", "order": 5, "role": "body", "text": "Evan Fournier scored a season-high 32 points for the Magic, and D.J. Augustin added 11 points and three assists in a 35-point fourth quarter."}
{"game_id": "0021700649", "chunk_id": "0021700649_006", "order": 6, "role": "body", "text": "Magic guard Arron Afflalo and Timberwolves forward Nemanja Bjelica were ejected with 7:58 left in the second quarter when they got into a fight while the game was being played."}
{"game_id": "0021700649", "chunk_id": "0021700649_007", "order": 7, "role": "body", "text": "Afflalo threw at least one punch in the fight, which came four minutes after both players had been assessed technical fouls."}
{"game_id": "0021700649", "chunk_id": "0021700649_008", "order": 8, "role": "body", "text": "\"I don't want to feel like a victim here, that's part of the game,\" Bjelica said. \"But he took a swing at me, and I was just trying to protect myself, first of all, and to calm him down because he was wild."}
{"game_id": "0021700649", "chunk_id": "0021700649_009", "order": 9, "role": "body", "text": "\"I don't know what's wrong with that guy, but at that point I have to protect myself and my family.\""}
{"game_id": "0021700649", "chunk_id": "0021700649_010", "order": 10, "role": "body", "text": "Afflalo was unavailable for comment after the game."}
{"game_id": "0021700649", "chunk_id": "0021700649_011", "order": 11, "role": "body", "text": "Birch, who has spent much of the season going back and forth to the NBA G League, contributed 12 points, 10 rebounds and four blocks on less than 19 minutes."}
{"game_id": "0021700649", "chunk_id": "0021700649_012", "order": 12, "role": "body", "text": "\"It's hard to take out a player who plays hard, so that's what I did,\" said the 6-foot-9 rookie from UNLV. \"When you play limited minutes, you've got to go as hard as you can. You don't want to mess up the opportunity.\""}
{"game_id": "0021700649", "chunk_id": "0021700649_013", "order": 13, "role": "body", "text": "Birch finished the first quarter by making the first four free throws of his NBA career, and blocked a couple of shots in the second quarter to keep the Timberwolves from pulling away."}
{"game_id": "0021700649", "chunk_id": "0021700649_014", "order": 14, "role": "body", "text": "\"He's an NBA player, not a G League player,\" said Magic coach Frank Vogel. \"He really plays that role well, the role of shot-blocking and rebounding. And he's got good instincts on the defensive end.\""}
{"game_id": "0021700649", "chunk_id": "0021700649_015", "order": 15, "role": "body", "text": "Jimmy Butler had 28 points and seven rebounds for the Timberwolves, who had won their five preceding games by an average of 18.8 points."}
{"game_id": "0021700649", "chunk_id": "0021700649_016", "order": 16, "role": "body", "text": "\"I'm glad we (expletive) lost, coming in here on our high horse thinking we are a really good team and we haven't done anything yet,\" Butler said. \"Good for us, man. They played better than us.\""}
{"game_id": "0021700649", "chunk_id": "0021700649_017", "order": 17, "role": "body", "text": "Fournier and Augustin hit 3-pointers during a 14-4 fourth-quarter run that put Orlando ahead to stay, and Augustin's three free throws with 2:10 left gave the Magic a nine-point lead, the biggest of the game for either team."}
{"game_id": "0021700649", "chunk_id": "0021700649_018", "order": 18, "role": "body", "text": "Jeff Teague and Karl-Anthony Towns answered with 3-pointers to keep the Timberwolves in it, but Biyombo scored five straight Magic points to regain an eight-point lead with 50 seconds left."}
{"game_id": "0021700649", "chunk_id": "0021700649_019", "order": 19, "role": "body", "text": "A loss would have dropped Orlando (13-31) to the worst record in the NBA."}
{"game_id": "0021700649", "chunk_id": "0021700649_021", "order": 21, "role": "body", "text": "Timberwolves: Minnesota shot only 10 free throws. \"Very unusual for us,\" Thibodeau said. \"I want to take a look at as well.\" ... Now fourth in the Western Conference, the Wolves are 6-11 against teams from the East."}
{"game_id": "0021700649", "chunk_id": "0021700649_022", "order": 22, "role": "body", "text": "Magic: F Marreese Speights missed the game for personal reasons. ... With 10 points and seven rebounds in the first half, Birch exceeded his career totals in both categories. ... Biyombo had 10 rebounds and three blocks in the first quarter."}
{"game_id": "0021700649", "chunk_id": "0021700649_024", "order": 24, "role": "body", "text": "\"I think we were comfortable,\" Butler said. \"We didn't play hard, we didn't rebound, we didn't guard, we didn't execute, we didn't do anything. We were going through the motions out there. When you do that in this league, you can get beat by anybody.\""}
{"game_id": "0021700649", "chunk_id": "0021700649_026", "order": 26, "role": "body", "text": "Timberwolves: Visit Houston on Thursday night."}
{"game_id": "0021700649", "chunk_id": "0021700649_027", "order": 27, "role": "body", "text": "Magic: Visit Cleveland on Thursday night."}
{"game_id": "0021700649", "chunk_id": "0021700649_029", "order": 29, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
