{"game_id": "0021700827", "chunk_id": "0021700827_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  The Milwaukee Bucks got what they have come to expect from 23-year-old Giannis Antetokounmpo and an unexpected boost from 40-year-old Jason Terry"}
{"game_id": "0021700827", "chunk_id": "0021700827_002", "order": 2, "role": "body", "text": "Antetokounmpo scored 32 points and Terry came off the bench to score 11 points in the second half in the Bucks' 111-104 victory over the Orlando Magic on Saturday night."}
{"game_id": "0021700827", "chunk_id": "0021700827_003", "order": 3, "role": "body", "text": "A couple of 3-pointers by the 40-year-old Terry put the Bucks ahead to stay late in the third quarter, although the game stayed close until Antetokounmpo's three-point play made it 107-100 with 45.7 seconds left."}
{"game_id": "0021700827", "chunk_id": "0021700827_004", "order": 4, "role": "body", "text": "\"I'm not sure a lot of teams have a guy like Giannis,\" Milwaukee coach Joe Prunty said. \"You can go up and down the stat sheet and you know it's going to be filled."}
{"game_id": "0021700827", "chunk_id": "0021700827_005", "order": 5, "role": "body", "text": "The 6-foot-11 forward had a modest game by his standards, compiling five rebounds, five assists and a couple of blocks."}
{"game_id": "0021700827", "chunk_id": "0021700827_006", "order": 6, "role": "body", "text": "But the Bucks might not have won without the contribution of Terry, who put them ahead to stay with a couple of 3-pointers late in the third quarter."}
{"game_id": "0021700827", "chunk_id": "0021700827_007", "order": 7, "role": "body", "text": "\"This was a must-win for us. We were missing some guys and the bench had to come up big,\" said Terry, who had only nine 3-pointers for the season before adding three Saturday night. \"I can still come in and be a spark,\" he said. \"At this age you find ways to help your team if you're on the court.\""}
{"game_id": "0021700827", "chunk_id": "0021700827_008", "order": 8, "role": "body", "text": "Milwaukee stayed ahead by hitting 13 of 20 shots in the fourth quarter, winning for the eighth time in 10 games."}
{"game_id": "0021700827", "chunk_id": "0021700827_009", "order": 9, "role": "body", "text": "Mario Hezonja led Orlando with 23 points. Evan Fournier added 20, and Shelvin Mack had 19."}
{"game_id": "0021700827", "chunk_id": "0021700827_010", "order": 10, "role": "body", "text": "Khris Middleton had 21 points, nine rebounds and seven assists for Milwaukee."}
{"game_id": "0021700827", "chunk_id": "0021700827_011", "order": 11, "role": "body", "text": "The Bucks (31-24) won for the sixth straight time in the second game of a back-to-back."}
{"game_id": "0021700827", "chunk_id": "0021700827_012", "order": 12, "role": "body", "text": "The Magic (18-37) missed 14 straight 3-point shots and saw their three-game winning streak broken."}
{"game_id": "0021700827", "chunk_id": "0021700827_013", "order": 13, "role": "body", "text": "\"We were right there the whole game,\" said D.J. Augustin, who missed all four of his threes. \"I felt like we could have pulled away at the end, but Jason Terry came in and hit some big shots, like he's been doing his whole career.\""}
{"game_id": "0021700827", "chunk_id": "0021700827_014", "order": 14, "role": "body", "text": "Mack made all six of his shots in the first half in leading Orlando to a 54-50 halftime lead. But after Mack made a 3-pointer midway through the second quarter, Orlando missed 16 of its next 17."}
{"game_id": "0021700827", "chunk_id": "0021700827_015", "order": 15, "role": "body", "text": "Hezonja scored nine of Orlando's first 11 points, and a couple of free throws by Augustin with 3:31 left in the second quarter gave the Magic a nine-point lead, the biggest for either team until the Bucks matched it in the fourth quarter."}
{"game_id": "0021700827", "chunk_id": "0021700827_017", "order": 17, "role": "body", "text": "The Magic's failure to win a fourth straight game for the first time since December of 2015 did not discourage coach Frank Vogel. \"This is the standard of how we want to play. We want to build an extra-pass culture with a competitive spirit on the defensive end,\" Vogel said. It takes time for this stuff to develop but it looks pretty good right now.\""}
{"game_id": "0021700827", "chunk_id": "0021700827_019", "order": 19, "role": "body", "text": "Bucks: C John Henson did not play because of a sore right hamstring. ... F Jabari Parker, who has played 71 minutes in four games since returning from a knee injury, was inactive for the second game of a back-to-back. ... The Bucks are 9-3 in the second game of back-to-backs."}
{"game_id": "0021700827", "chunk_id": "0021700827_020", "order": 20, "role": "body", "text": "Magic: Four days after scoring a career-high 34 points against Cleveland, F Jonathon Simmons had nine on 4-for-14 shooting. ... F Aaron Gordon (seven games, strained left hip flexor) and C Nikola Vucevic (21 games, fractured left hand) are expected to return soon."}
{"game_id": "0021700827", "chunk_id": "0021700827_022", "order": 22, "role": "body", "text": "Bucks: Host Atlanta on Tuesday night."}
{"game_id": "0021700827", "chunk_id": "0021700827_023", "order": 23, "role": "closing", "text": "Magic: At Chicago on Monday night."}
