{"game_id": "0021100819", "chunk_id": "0021100819_001", "order": 1, "role": "lead", "text": "MIAMI --  Dwyane Wade knew during pregame warmups that the Miami Heat were going to have a long night. By the end of the first quarter, the Memphis Grizzlies let everyone else know that Wade was right."}
{"game_id": "0021100819", "chunk_id": "0021100819_002", "order": 2, "role": "body", "text": "Rudy Gay scored 17 points, Zach Randolph had 14 points and 14 rebounds off the bench, and the Grizzlies put seven players in double figures to snap Miami's 17-game home winning streak by beating the Heat 97-82 on Friday night."}
{"game_id": "0021100819", "chunk_id": "0021100819_003", "order": 3, "role": "body", "text": "Memphis led wire to wire, the first team to do that on Miami's home floor since Boston on Nov. 11, 2010."}
{"game_id": "0021100819", "chunk_id": "0021100819_004", "order": 4, "role": "body", "text": "\"A great team win from the beginning to the end,\" said Memphis guard Gilbert Arenas, who scored 12 points. \"We played hard. We outplayed them. They missed shots they normally make but we were there for every single one of them.\""}
{"game_id": "0021100819", "chunk_id": "0021100819_005", "order": 5, "role": "body", "text": "Mike Conley and Marreese Speights each scored 15, and Marc Gasol and O.J. Mayo added 10 apiece for the Grizzlies, who have won six of eight."}
{"game_id": "0021100819", "chunk_id": "0021100819_006", "order": 6, "role": "body", "text": "LeBron James finished with 21 points, six assists and six rebounds for the Heat, who failed in a bid to match the franchise's longest home win streak, set in the 2004-05 season. Miami committed 11 turnovers in the first quarter -- its most in any period since Feb. 14, 2006 -- and never recovered."}
{"game_id": "0021100819", "chunk_id": "0021100819_007", "order": 7, "role": "body", "text": "\"When we turn the ball over, we're not that good,\" James said. \"We understand that. We know that. We don't care when we have attack turnovers, guys getting into the lane and trying to make plays for others and make a turnover. We had a few careless ones. We had easy layups, a few crosscourt passes. Just careless.\""}
{"game_id": "0021100819", "chunk_id": "0021100819_008", "order": 8, "role": "body", "text": "Wade scored 20 points, Chris Bosh added 19 and Terrel Harris scored 10 for Miami, which last lost at home on Jan. 22 to Milwaukee."}
{"game_id": "0021100819", "chunk_id": "0021100819_009", "order": 9, "role": "body", "text": "Miami (39-15) fell three games behind Chicago (43-13) in the race for the No. 1 seed in the Eastern Conference. The Heat have 12 games left, the Bulls have 10, and the teams go head-to-head twice more before the postseason begins."}
{"game_id": "0021100819", "chunk_id": "0021100819_010", "order": 10, "role": "body", "text": "\"They just beat us,\" Heat coach Erik Spoelstra said. \"Really, the tale was that first quarter. ... The lack of concentration and focus in that first quarter, we couldn't make up for that.\""}
{"game_id": "0021100819", "chunk_id": "0021100819_011", "order": 11, "role": "body", "text": "The Heat struggled shooting the ball again, finishing at 40 percent."}
{"game_id": "0021100819", "chunk_id": "0021100819_012", "order": 12, "role": "body", "text": "It was the second time in two weeks that Memphis got seven players into double figures. Another good sign for the Grizzlies: Arenas had been 3 of 13 from 3-point range in his first six games with Memphis, but was 4 of 5 on Friday."}
{"game_id": "0021100819", "chunk_id": "0021100819_013", "order": 13, "role": "body", "text": "Memphis came into the night only two games out of fourth in the Western Conference, and coach Lionel Hollins talked beforehand about the importance of getting sharper heading into the postseason."}
{"game_id": "0021100819", "chunk_id": "0021100819_014", "order": 14, "role": "body", "text": "His team must have listened, because it came out flying."}
{"game_id": "0021100819", "chunk_id": "0021100819_015", "order": 15, "role": "body", "text": "\"The first time I looked up at the scoreboard we were up 15 points,\" Hollins said. \"We were playing well and we had a lot of people do a lot of good things.\""}
{"game_id": "0021100819", "chunk_id": "0021100819_016", "order": 16, "role": "body", "text": "The Grizzlies led 25-12 after the first quarter behind nine points from Gay. By halftime, the lead was 48-32, the second-lowest scoring first half for the Heat since the first game of the Big Three era, the opener at Boston last season."}
{"game_id": "0021100819", "chunk_id": "0021100819_017", "order": 17, "role": "body", "text": "\"They did a great job,\" said Wade, who noted he feared even during the pregame layup line that energy was going to be lacking. \"We beat ourselves as well. ... Just one of those nights.\""}
{"game_id": "0021100819", "chunk_id": "0021100819_018", "order": 18, "role": "body", "text": "Just about every number imaginable for the Heat in the early going was bad."}
{"game_id": "0021100819", "chunk_id": "0021100819_019", "order": 19, "role": "body", "text": "Wade missed two dunks in the first half, shooting 1 for 7. Midway through the second quarter, Bosh was shooting 4 for 5 and Harris 2 for 2 off the bench -- while everyone else in a Miami uniform was shooting 1 for 17 at that point."}
{"game_id": "0021100819", "chunk_id": "0021100819_020", "order": 20, "role": "body", "text": "There were chances in the third for Miami to get the lead into single digits, all of them thwarted."}
{"game_id": "0021100819", "chunk_id": "0021100819_021", "order": 21, "role": "body", "text": "The first one came when Conley stole the ball from Mario Chalmers, a sequence capped by Quincy Pondexter getting a dunk. And then about 3 minutes later, Miami endured maybe its most frustrating possession of the night."}
{"game_id": "0021100819", "chunk_id": "0021100819_022", "order": 22, "role": "body", "text": "James spun and tried a left-handed layup with 4:25 left in the third, the ball rimming out but Miami's possession extended when Joel Anthony was fouled going for the rebound. James then attacked the lane for a jumper that missed, with the Heat getting that rebound as well and Harris finding James underneath the rim."}
{"game_id": "0021100819", "chunk_id": "0021100819_023", "order": 23, "role": "body", "text": "His layup -- his third shot of the possession -- came up short, a microcosm of Miami's night."}
{"game_id": "0021100819", "chunk_id": "0021100819_024", "order": 24, "role": "body", "text": "\"I just absolutely missed it,\" James said. \"It was a (tale) of what type of game we were playing.\""}
{"game_id": "0021100819", "chunk_id": "0021100819_025", "order": 25, "role": "body", "text": "Arenas' fourth 3-pointer of the night came with 9:40 left, giving the Grizzlies an 81-64 lead. Mayo stretched the lead to 86-66 with another 3-pointer midway through the fourth, and the Grizzlies soon finished it off."}
{"game_id": "0021100819", "chunk_id": "0021100819_026", "order": 26, "role": "body", "text": "\"We knew they were going to make a run but we withstood it,\" Randolph said. \"We kept playing and got stops.\""}
{"game_id": "0021100819", "chunk_id": "0021100819_027", "order": 27, "role": "closing", "text": "Game notes Memphis' 13-point edge was the biggest lead by a visitor in Miami after the first quarter since San Antonio led 29-14 after the opening 12 minutes at the Heat on March 16, 2010. ... Memphis guard Tony Allen was not with the Grizzlies, out because of a facial laceration suffered in Dallas on Wednesday night. ... Harris, who has impressed the Heat of late, got first-quarter minutes for just the third time this season."}
