{"game_id": "0021300797", "chunk_id": "0021300797_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Giannis Antetokounmpo is the rookie who gets most of the attention for Milwaukee. It was another first-year player who made the biggest shot Tuesday night to give the Bucks a rare victory."}
{"game_id": "0021300797", "chunk_id": "0021300797_002", "order": 2, "role": "body", "text": "Nate Wolters hit a 3-pointer with 29 seconds left to give Milwaukee the lead for good in a 104-100 win over the Orlando Magic."}
{"game_id": "0021300797", "chunk_id": "0021300797_003", "order": 3, "role": "body", "text": "With an NBA-worst 10-43 record, Bucks coach Larry Drew is giving plenty of minutes to young players. Antetokounmpo and Wolters made key contributions both offensively and defensively in the final minutes against Orlando."}
{"game_id": "0021300797", "chunk_id": "0021300797_004", "order": 4, "role": "body", "text": "\"They hit a dagger, that shot Nate hit,\" Magic guard E'Twaun Moore said."}
{"game_id": "0021300797", "chunk_id": "0021300797_005", "order": 5, "role": "body", "text": "Wolters missed 26 of his first 29 attempts from 3-point range this season but is 5 for 11 in the team's last four games."}
{"game_id": "0021300797", "chunk_id": "0021300797_006", "order": 6, "role": "body", "text": "\"I'm feeling a lot better from 3. I'm going to shoot with confidence, and hopefully I can keep it up,\" he said. \"I've been playing so many minutes. Coach is giving me the opportunity, so I have to knock some shots down.\""}
{"game_id": "0021300797", "chunk_id": "0021300797_007", "order": 7, "role": "body", "text": "His 27-foot jumper with 6 seconds left on the shot clock helped Milwaukee snap a four-game losing streak."}
{"game_id": "0021300797", "chunk_id": "0021300797_008", "order": 8, "role": "body", "text": "\"I didn't have much time so I just decided to pull up and shoot it,\" Wolters said. \"Sometimes those are the easiest ones, when you know you have to shoot it. It's nice to get a win.\""}
{"game_id": "0021300797", "chunk_id": "0021300797_009", "order": 9, "role": "body", "text": "After Wolters gave the Bucks the lead, Antetokounmpo stole the ball from Arron Afflalo and was fouled, making one free throw for a 100-97 advantage."}
{"game_id": "0021300797", "chunk_id": "0021300797_010", "order": 10, "role": "body", "text": "\"I was focused tonight,\" Antetokounmpo said. \"For a rookie that means a lot to be focused down the stretch, especially being a little bit panicked.\""}
{"game_id": "0021300797", "chunk_id": "0021300797_011", "order": 11, "role": "body", "text": "Brandon Knight overcame a bizarre foot injury for the Bucks, scoring 18 points and making two free throws with 5.5 seconds left to seal the victory. He played 34 minutes despite slicing his foot open on a baseboard while stepping out of his bathroom shower Tuesday afternoon."}
{"game_id": "0021300797", "chunk_id": "0021300797_012", "order": 12, "role": "body", "text": "Knight, unavailable for comment after the game, missed 10 of 13 shots from the field but hit all 12 of his free throws. Before the game, he said he was unsure whether he could play. He started anyway."}
{"game_id": "0021300797", "chunk_id": "0021300797_013", "order": 13, "role": "body", "text": "The Bucks made 22 of 30 free throws, while the Magic went 9 of 16."}
{"game_id": "0021300797", "chunk_id": "0021300797_014", "order": 14, "role": "body", "text": "\"The free throws were the big thing,\" Orlando coach Jacque Vaughn said. \"Their ability to get in the bonus and get downhill and get into the lane was a big part of them winning.\""}
{"game_id": "0021300797", "chunk_id": "0021300797_015", "order": 15, "role": "body", "text": "Orlando fell to 3-24 on the road. Despite snapping their four-game skid, the Bucks have lost 19 of 22 overall."}
{"game_id": "0021300797", "chunk_id": "0021300797_016", "order": 16, "role": "body", "text": "Afflalo scored 21 points and Nikola Vucevic added 19 for Orlando."}
{"game_id": "0021300797", "chunk_id": "0021300797_017", "order": 17, "role": "body", "text": "After Antetokounmpo made the free throw that gave Milwaukee a 100-97 lead, Afflalo missed a 3-pointer. Ersan Ilyasova hit a pair of free throws for a 102-97 advantage."}
{"game_id": "0021300797", "chunk_id": "0021300797_018", "order": 18, "role": "body", "text": "Jameer Nelson made a 3 with 6 seconds to go to make it 102-100. Knight was fouled and made both free throws to clinch it."}
{"game_id": "0021300797", "chunk_id": "0021300797_019", "order": 19, "role": "body", "text": "Caron Butler, returning after missing four games with a sprained ankle, led the Bucks with 21 points on seven 3-pointers but didn't score in the fourth quarter."}
{"game_id": "0021300797", "chunk_id": "0021300797_020", "order": 20, "role": "body", "text": "Afflalo shot 9 of 15 to snap a mini-slump. The Magic guard had made only 15 of 44 shots in his past four games."}
{"game_id": "0021300797", "chunk_id": "0021300797_021", "order": 21, "role": "body", "text": "Vucevic took a pass from Nelson and made a 14-foot jumper to give Orlando (16-39) a 97-96 advantage with 50 seconds left, its first lead since 4 minutes remained in the third quarter."}
{"game_id": "0021300797", "chunk_id": "0021300797_022", "order": 22, "role": "body", "text": "Antetokounmpo capped Milwaukee's 8-2 run to open the fourth. He blocked a layup attempt by Kyle O'Quinn and hit John Henson for a dunk, giving the Bucks an 89-81 lead with 8:57 to go."}
{"game_id": "0021300797", "chunk_id": "0021300797_023", "order": 23, "role": "body", "text": "Orlando scored the next seven points to pull to 89-88 on Maurice Harkless' 3-pointer with 6:44 left."}
{"game_id": "0021300797", "chunk_id": "0021300797_024", "order": 24, "role": "body", "text": "Butler made six 3s and the Bucks led 53-47 at halftime. It was only the 10th time in 53 games that Milwaukee has led at halftime."}
{"game_id": "0021300797", "chunk_id": "0021300797_025", "order": 25, "role": "closing", "text": "Game notes Milwaukee F Khris Middleton left in the first quarter after twisting his ankle, but returned in the second. ... O.J. Mayo, who had missed nine consecutive games with what the Bucks termed \"illness/conditioning,\" was expected to play limited minutes but remained on the bench the entire game. Drew said he had hoped to play Mayo, but was unable to due to game circumstances."}
