{"game_id": "0021400150", "chunk_id": "0021400150_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Stan Van Gundy got to watch his kind of basketball Monday night."}
{"game_id": "0021400150", "chunk_id": "0021400150_002", "order": 2, "role": "body", "text": "Unfortunately for him it was his old team playing that style not his new one."}
{"game_id": "0021400150", "chunk_id": "0021400150_003", "order": 3, "role": "body", "text": "Nikola Vucevic had 25 points and 14 rebounds and the Orlando Magic hit 13 3-pointers in a 107-93 victory over the Detroit Pistons Monday night."}
{"game_id": "0021400150", "chunk_id": "0021400150_004", "order": 4, "role": "body", "text": "\"That's the way we've got to play,\" Vucevic said. \"We shared the ball, we moved it well and we were aggressive all the way around. No one cares who is scoring on this team, as long as we are making the right plays.\""}
{"game_id": "0021400150", "chunk_id": "0021400150_005", "order": 5, "role": "body", "text": "It was the first time Van Gundy had coached against the Magic since they fired him in 2012."}
{"game_id": "0021400150", "chunk_id": "0021400150_006", "order": 6, "role": "body", "text": "\"They shot the ball well, and we didn't defend,\" Van Gundy said. \"They played a nice game, but we never did anything to impact their offense.\""}
{"game_id": "0021400150", "chunk_id": "0021400150_007", "order": 7, "role": "body", "text": "Van Gundy's trademark has been to put shooters around a dominant inside player, and that's how Orlando played at the Palace. Vucevic was the only Magic player with more than five rebounds, but the other four starters combined to go 11 for 19 from the 3-point line."}
{"game_id": "0021400150", "chunk_id": "0021400150_008", "order": 8, "role": "body", "text": "\"That's how we want to play every game,\" Orlando coach Jacque Vaughn said. \"That's team basketball.\""}
{"game_id": "0021400150", "chunk_id": "0021400150_009", "order": 9, "role": "body", "text": "The Pistons, playing their fifth game in seven nights, were Caron Butler, who had 20 points and Brandon Jennings added 18.  But their frontcourt trio of Josh Smith, Andre Drummond and Greg Monroe combined for only 25 points on 10-of-28 shooting."}
{"game_id": "0021400150", "chunk_id": "0021400150_010", "order": 10, "role": "body", "text": "\"They beat us,\" Monroe said. \"That's my quote tonight. They beat us.\""}
{"game_id": "0021400150", "chunk_id": "0021400150_011", "order": 11, "role": "body", "text": "Detroit struggled from the floor in the first half, shooting only 42.5 percent, and weren't able to get the ball inside with any regularity. However, they dominated the glass, grabbing a third of their own misses and all but one of Orlando's, which let them take a 52-49 lead."}
{"game_id": "0021400150", "chunk_id": "0021400150_012", "order": 12, "role": "body", "text": "\"Drummond and Monroe are a handful down there, so we had to limit their touches,\" said Channing Frye. \"Coach had a good game plan for them.\""}
{"game_id": "0021400150", "chunk_id": "0021400150_013", "order": 13, "role": "body", "text": "The Magic started the third with a 10-0 run before Jennings hit his fourth 3-pointer of the game, and things got worse for Detroit when Drummond picked up three fouls in the first 4:32 of the half."}
{"game_id": "0021400150", "chunk_id": "0021400150_014", "order": 14, "role": "body", "text": "Butler came off the bench to score 13 points to help Detroit regain the lead late in the period. The Magic got hot again at the start of the fourth, scoring 10 points on their first four possessions to take an 88-80 lead. Harris had seven in the run, while Frye hit his fourth 3-pointer of the half."}
{"game_id": "0021400150", "chunk_id": "0021400150_015", "order": 15, "role": "body", "text": "The Pistons got back into the game, but couldn't stop Harris, who added another 3-pointer to make it 101-90 with three minutes left."}
{"game_id": "0021400150", "chunk_id": "0021400150_018", "order": 18, "role": "body", "text": "Orlando: Frye only played 11 minutes in the first half due to foul trouble, but hit three 3-pointers in Orlando's quick start to the third quarter. . The Magic outrebounded Detroit 24-15 in the second half."}
{"game_id": "0021400150", "chunk_id": "0021400150_019", "order": 19, "role": "body", "text": "Detroit: Pistons coach Stan Van Gundy showed his displeasure with Jonas Jerebko in the second quarter, grabbing him by the front of the jersey while barking at him during a timeout."}
{"game_id": "0021400150", "chunk_id": "0021400150_021", "order": 21, "role": "body", "text": "Orlando: Host the Clippers on Wednesday."}
{"game_id": "0021400150", "chunk_id": "0021400150_022", "order": 22, "role": "body", "text": "Detroit: Hosts the Suns on Wednesday."}
{"game_id": "0021400150", "chunk_id": "0021400150_023", "order": 23, "role": "closing", "text": "MISSING ROOKIES: Neither team's top draft pick played in the game. Orlando's Aaron Gordon, the fourth overall pick, broke his left foot Saturday in Washington and is out indefinitely. Detroit's second-round pick, Spencer Dinwiddie, has only played eight minutes this season. Dinwiddie was considered a first-round prospect until tearing his ACL in January, and is still not 100 percent."}
