{"game_id": "0021200053", "chunk_id": "0021200053_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- No matter how hard they tried, the Charlotte Bobcats couldn't stop Shannon Brown."}
{"game_id": "0021200053", "chunk_id": "0021200053_002", "order": 2, "role": "body", "text": "Brown hit six 3-pointers in the fourth quarter -- most of them with a defender's hand in his face -- and finished with 24 points to lead the Phoenix Suns over the Bobcats 117-110 on Wednesday night."}
{"game_id": "0021200053", "chunk_id": "0021200053_003", "order": 3, "role": "body", "text": "\"That felt good,\" Brown said. \"The one thing you don't want to do is mess the rhythm up, so I tried to keep my rhythm going and take my shots how I work on them in practice. They were falling for me.\""}
{"game_id": "0021200053", "chunk_id": "0021200053_005", "order": 5, "role": "body", "text": "Brown was 6 of 6 on 3-pointers in the fourth quarter and five of those were heavily contested, leaving Bobcats coach Mike Dunlap impressed."}
{"game_id": "0021200053", "chunk_id": "0021200053_006", "order": 6, "role": "body", "text": "\"I mean, those 3s came with guys on top of him,\" Dunlap said. \"It's not like we were coming back to the huddle and saying we didn't play effective defense. He made the some great 3s. That's about as well as he's going to do in any NBA game.\""}
{"game_id": "0021200053", "chunk_id": "0021200053_007", "order": 7, "role": "body", "text": "Brown, who played briefly with the Bobcats before being traded to the Los Angeles Lakers along with Adam Morrison on Feb. 7, 2009, helped break open an 87-all game early in the fourth quarter when he suddenly got hot and canned his first 3-pointer. Prior to that he was 1 of 4 from the field and had missed his previous two 3-pointers."}
{"game_id": "0021200053", "chunk_id": "0021200053_008", "order": 8, "role": "body", "text": "Brown said there was some added satisfaction in having a big game against a team that traded him, but said it was more important that the Suns earned a win."}
{"game_id": "0021200053", "chunk_id": "0021200053_009", "order": 9, "role": "body", "text": "\"I'm glad we're not going back 0-3 on this three-game road trip,\" Brown said. \"Hopefully, we can get a little bit of momentum going as we head back home.\""}
{"game_id": "0021200053", "chunk_id": "0021200053_010", "order": 10, "role": "body", "text": "Marcin Gortat was dominant inside for the Suns, finishing with 23 points, 10 rebounds and seven blocked shots. Michael Beasley chipped in with 21 points and 15 rebounds."}
{"game_id": "0021200053", "chunk_id": "0021200053_011", "order": 11, "role": "body", "text": "Brown's sharp shooting offset a terrific night for Charlotte's Byron Mullens, who made six 3-pointers and finished with 24 points and eight rebounds."}
{"game_id": "0021200053", "chunk_id": "0021200053_012", "order": 12, "role": "body", "text": "Kemba Walker added 17 points and eight assists for the Bobcats. Ramon Sessions had 17 points and nine assists."}
{"game_id": "0021200053", "chunk_id": "0021200053_013", "order": 13, "role": "body", "text": "\"Yeah, we made a really good run. But it all started in the first quarter,\" Mullens said. \"They got a lot of easy baskets on us. Gortat and Luis Scola just cut down the middle in front of my face. We just got too deep in the hole.\""}
{"game_id": "0021200053", "chunk_id": "0021200053_014", "order": 14, "role": "body", "text": "The 6-foot-4, 210-pound Brown came into the game averaging 11.5 points per game, the Suns' leading scorer off the bench. He entered the third quarter as a non-factor before hitting six 3s to put Phoenix ahead for good. He scored 18 points in the fourth."}
{"game_id": "0021200053", "chunk_id": "0021200053_015", "order": 15, "role": "body", "text": "\"I think he's very capable of doing that,\" Suns coach Alvin Gentry said. \"He can get on a roll. He had some games for us last year. I thought he did a great job. And I thought he did a pretty good job defensively, too.\""}
{"game_id": "0021200053", "chunk_id": "0021200053_016", "order": 16, "role": "body", "text": "The Bobcats trailed 60-46 at the break after shooting just 33 percent in the first half."}
{"game_id": "0021200053", "chunk_id": "0021200053_017", "order": 17, "role": "body", "text": "Charlotte bounced back to tie the game at 85 early in the fourth quarter after Mullens and Tyrus Thomas began to heat up from the outside. Thomas finished with 10 points and gave the Bobcats a lift off the bench."}
{"game_id": "0021200053", "chunk_id": "0021200053_018", "order": 18, "role": "body", "text": "But Charlotte couldn't get over the hump and take the lead."}
{"game_id": "0021200053", "chunk_id": "0021200053_019", "order": 19, "role": "body", "text": "Still, Dunlap liked the way his team fought back from 14 down in the third quarter."}
{"game_id": "0021200053", "chunk_id": "0021200053_020", "order": 20, "role": "body", "text": "\"We have a good push back in us and that's tagged to good character,\" Dunlap said. \"So the signs are there that that is going to be a positive -- that we don't let go of the game. We extended a lot of effort.\""}
{"game_id": "0021200053", "chunk_id": "0021200053_021", "order": 21, "role": "body", "text": "Dunlap came into the game worried about the Bobcats defending the paint and, sure enough, Gortat gave them fits inside in the early going as the Suns led by as many as 14 points. He dominated early on both ends of the court and hit 10 of 14 shots, almost all of those within a couple feet of the basket."}
{"game_id": "0021200053", "chunk_id": "0021200053_022", "order": 22, "role": "closing", "text": "Game notes Charlotte played without Gerald Henderson, who will be out two to four weeks with a sprained left foot. Jeffery Taylor, the team's second-round draft pick, started in Henderson's spot, giving the Bobcats two rookies on the floor for the opening tip. Taylor played 11 minutes and failed to score. ... Michael Kidd-Gilchrist, the No. 2 pick in the draft, had nine points and eight rebounds. ... The Suns had two players with double-doubles in Beasley and Gortat, the first time that has been accomplished by a pair of Phoenix players since Channing Frye and Gortat on March 22, 2011."}
