{"game_id": "0021700280", "chunk_id": "0021700280_001", "order": 1, "role": "lead", "text": "ATLANTA --  Coach Dwane Casey loves those rare nights when the Toronto Raptors have such a big lead that the second team gets as many minutes as the starters."}
{"game_id": "0021700280", "chunk_id": "0021700280_002", "order": 2, "role": "body", "text": "\"They're going to have nights when they don't look good, but the young guys came tonight and they were clicking,\" Casey said. \"They were playing together, screening for each other. The spacing was good. The passing was good.\""}
{"game_id": "0021700280", "chunk_id": "0021700280_003", "order": 3, "role": "body", "text": "Norman Powell scored 17 points, Jonas Valanciunas added 16 and the Raptors blew out the Atlanta Hawks 112-78 on Saturday night."}
{"game_id": "0021700280", "chunk_id": "0021700280_004", "order": 4, "role": "body", "text": "Toronto dominated the game so completely that it needed just 28 minutes from DeMar DeRozan, one of the NBA's most prolific scorers. DeRozan handed out a game-high eight assists and finished with just two points on 1-for-5 shooting before sitting out the fourth quarter with the other starters."}
{"game_id": "0021700280", "chunk_id": "0021700280_005", "order": 5, "role": "body", "text": "After the game he had his left knee iced in the locker room. DeRozan was hurt in the third quarter, but said he would've played if the game had been close."}
{"game_id": "0021700280", "chunk_id": "0021700280_006", "order": 6, "role": "body", "text": "\"It's a little sore, just a little swelling,\" DeRozan said. \"I want to be all the way right when I play again.\""}
{"game_id": "0021700280", "chunk_id": "0021700280_007", "order": 7, "role": "body", "text": "Kyle Lowry had 15 points and a career-high 13 rebounds as the Raptors snapped a two-game skid. Seven players finished in double figures for the Raptors."}
{"game_id": "0021700280", "chunk_id": "0021700280_008", "order": 8, "role": "body", "text": "Dennis Schroder scored 14 points and Taurean Prince and Marco Belinelli each had 10 for the Hawks. Atlanta was coming off Friday's rally to beat New York, but it had nothing left after leading by one point late in the first quarter."}
{"game_id": "0021700280", "chunk_id": "0021700280_009", "order": 9, "role": "body", "text": "The Hawks dropped to 4-16, second-worst in the Eastern Conference."}
{"game_id": "0021700280", "chunk_id": "0021700280_010", "order": 10, "role": "body", "text": "\"I felt like our defense -- not just in the paint but everywhere -- was not good enough for an NBA game tonight,\" coach Mike Budenholzer said."}
{"game_id": "0021700280", "chunk_id": "0021700280_011", "order": 11, "role": "body", "text": "Toronto, which improved to 12-7, scored 39 points in the second and faced no danger of another third-quarter meltdown that proved costly this week at New York and Indiana. The lead surged to 36 by the nine-minute mark of the third on Serge Ibaka's short jumper, and the Raptors went up a game-high 45 in the fourth."}
{"game_id": "0021700280", "chunk_id": "0021700280_012", "order": 12, "role": "body", "text": "\"Coach challenged the team,\" Lowry said.  \"He specifically said for me and DeMar to come out with a little more assertiveness after the third quarters we've had the last couple of games.\""}
{"game_id": "0021700280", "chunk_id": "0021700280_013", "order": 13, "role": "body", "text": "Toronto's bench outscored the Hawks' reserves 43-14 by halftime as Powell, Jakob Poeltl and Pascal Siakam each scored in double figures."}
{"game_id": "0021700280", "chunk_id": "0021700280_014", "order": 14, "role": "body", "text": "There were plenty of second-quarter highlights for Toronto, but the best came in the final minute when Lowry ripped the ball from John Collins and passed upcourt to DeRozan at the 3-point line. DeRozan immediately did a tip-pass for an alley-oop that Siakam slammed down for a 67-39 lead."}
{"game_id": "0021700280", "chunk_id": "0021700280_015", "order": 15, "role": "body", "text": "The victory set the Raptors up for what could be an easy next three weeks, as they play just one opponent that's currently over .500."}
{"game_id": "0021700280", "chunk_id": "0021700280_017", "order": 17, "role": "body", "text": "Raptors: DeRozan's streak of 113 consecutive games in double digits, one shy of Lowry's franchise-best mark, was snapped. ... In Friday's loss at Indiana, Lowry became the first Toronto player to have consecutive games in leading the team in points, rebounds and assists. ... F C.J. Miles missed his second straight game to stay home for his daughter's birth."}
{"game_id": "0021700280", "chunk_id": "0021700280_018", "order": 18, "role": "body", "text": "Hawks: C Miles Plumlee, acquired in the offseason trade that shipped Dwight Howard to Charlotte, finally made his Atlanta debut late in the fourth and went scoreless with no rebounds in nine minutes. The Hawks would like to get something more from Plumlee, who's in the second season of a four-year, $52 million contract, but has been sidelined recently with a strained quadriceps."}
{"game_id": "0021700280", "chunk_id": "0021700280_020", "order": 20, "role": "body", "text": "Raptors: Host Charlotte on Wednesday."}
{"game_id": "0021700280", "chunk_id": "0021700280_021", "order": 21, "role": "body", "text": "Hawks: Host Cleveland on Thursday."}
{"game_id": "0021700280", "chunk_id": "0021700280_023", "order": 23, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
