{"game_id": "0021200234", "chunk_id": "0021200234_001", "order": 1, "role": "lead", "text": "CLEVELAND --  Nicolas Batum's first attempt at making the game-winning shot didn't count. He got it right the second time."}
{"game_id": "0021200234", "chunk_id": "0021200234_002", "order": 2, "role": "body", "text": "Batum's 3-pointer with 0.2 seconds left in the second overtime gave the Portland Trail Blazers a 118-117 victory over the Cleveland Cavaliers on Saturday night."}
{"game_id": "0021200234", "chunk_id": "0021200234_003", "order": 3, "role": "body", "text": "An apparent game-winning basket by Batum in the first overtime was disallowed because it came after time expired. The basket was first ruled good, but the call was changed after a video review. Batum, who celebrated after making that shot, got a chance to do it again and this time it was the winner."}
{"game_id": "0021200234", "chunk_id": "0021200234_004", "order": 4, "role": "body", "text": "\"After the one in the first overtime was too late, I had to make sure this one counted,\" he said."}
{"game_id": "0021200234", "chunk_id": "0021200234_005", "order": 5, "role": "body", "text": "The game featured 16 lead changes and was tied 20 times."}
{"game_id": "0021200234", "chunk_id": "0021200234_006", "order": 6, "role": "body", "text": "\"I feel great,\" Batum said \"This was a good game to watch for all the fans.\""}
{"game_id": "0021200234", "chunk_id": "0021200234_007", "order": 7, "role": "body", "text": "Trailing 117-115 with 2.5 seconds remaining, Portland called time and inbounded near midcourt. Damian Lillard passed to Batum, who hit a fadeaway jumper from the right corner in front of Cleveland's bench."}
{"game_id": "0021200234", "chunk_id": "0021200234_008", "order": 8, "role": "body", "text": "\"It was a tough shot, but I practice it every day,\" Batum said."}
{"game_id": "0021200234", "chunk_id": "0021200234_009", "order": 9, "role": "body", "text": "\"Nic makes those shots all the time at practice and shootaround, so we weren't surprised,\" Lillard said."}
{"game_id": "0021200234", "chunk_id": "0021200234_010", "order": 10, "role": "body", "text": "Cleveland coach Byron Scott praised Batum for coming through in the clutch."}
{"game_id": "0021200234", "chunk_id": "0021200234_011", "order": 11, "role": "body", "text": "\"Hell of a shot,\" Scott said. \"He caught it and turned around. He was off-balance, threw it up and it went in.\""}
{"game_id": "0021200234", "chunk_id": "0021200234_012", "order": 12, "role": "body", "text": "With time only for a tip-in attempt, the Cavaliers couldn't get a shot off before time expired."}
{"game_id": "0021200234", "chunk_id": "0021200234_013", "order": 13, "role": "body", "text": "Lillard led Portland with 24 points while Batum added 22. Alonzo Gee paced the Cavaliers with 22 points, but missed a free throw that would have given them a three-point lead before Batum's shot."}
{"game_id": "0021200234", "chunk_id": "0021200234_014", "order": 14, "role": "body", "text": "Anderson Varejao had 19 points and 17 rebounds for his eighth straight double-double."}
{"game_id": "0021200234", "chunk_id": "0021200234_015", "order": 15, "role": "body", "text": "Portland put five players in double figures and improved to 1-4 on its seven-game eastern road trip. The Trail Blazers, who lost to Washington during the trip for the Wizards' only win of the season, have been in search for something positive."}
{"game_id": "0021200234", "chunk_id": "0021200234_016", "order": 16, "role": "body", "text": "\"Breaking the losing streak was really important, because losing can take its toll mentally, and I liked the way we played all night,\" said Portland coach Terry Stotts."}
{"game_id": "0021200234", "chunk_id": "0021200234_017", "order": 17, "role": "body", "text": "Cleveland, which placed eight players in double figures, has lost 11 of 13."}
{"game_id": "0021200234", "chunk_id": "0021200234_018", "order": 18, "role": "body", "text": "The first overtime began with the scored tied at 91 and featured five lead changes and three ties."}
{"game_id": "0021200234", "chunk_id": "0021200234_019", "order": 19, "role": "body", "text": "\"It shouldn't have went into the first overtime,\" Scott said. \"We had about 30 mistakes defensively and when you have that many it's going to be hard to win basketball games.\""}
{"game_id": "0021200234", "chunk_id": "0021200234_020", "order": 20, "role": "body", "text": "Batum scored to give Portland a brief lead in the second OT, but Gee's 3-pointer put Cleveland ahead 114-113. Lillard followed with a basket for the Trail Blazers, but Tyler Zeller's jumper with 52.3 seconds left put the Cavaliers ahead again."}
{"game_id": "0021200234", "chunk_id": "0021200234_021", "order": 21, "role": "body", "text": "Following turnovers by both teams, the Trail Blazers missed on two attempts and Gee was fouled. He missed the first shot and made the second."}
{"game_id": "0021200234", "chunk_id": "0021200234_022", "order": 22, "role": "body", "text": "Cavaliers guard Dion Waiters left the game in the second overtime with an ankle injury. Varejao, the NBA's leading rebounder, dislocated his right ring finger in the first quarter. X-rays were negative and he returned midway through the second period."}
{"game_id": "0021200234", "chunk_id": "0021200234_023", "order": 23, "role": "body", "text": "Gee's basket off a missed shot tied the game at 103 with 6.7 seconds left in the first overtime. After Lillard missed a 20-footer, the ball was tapped out near the top of the key. Batum put up a shot that went in and was originally ruled good and the Trail Blazers began celebrating. However, replay showed the ball was still in Batum's hand when time expired."}
{"game_id": "0021200234", "chunk_id": "0021200234_024", "order": 24, "role": "body", "text": "With the Blazers down two late in regulation, Lillard missed, but Aldridge grabbed the rebound and was fouled by Varejao on his put-back attempt. Tristan Thompson was called for goaltending on the shot, a ruling that was upheld by a video review. Aldridge missed the free throw and the game remained tied at 91 with 36.8 seconds remaining."}
{"game_id": "0021200234", "chunk_id": "0021200234_025", "order": 25, "role": "body", "text": "The Cavaliers were called for a shot clock violation on their next possession. Portland called timeout with 12.8 seconds remaining. Lillard drove to the basket, but his shot hit off the glass. Aldridge's tip-in came after the buzzer and the game went to overtime."}
{"game_id": "0021200234", "chunk_id": "0021200234_026", "order": 26, "role": "closing", "text": "Game notes Batum left the game in the first quarter after being hit in the face, but returned in the second period. ... The Trail Blazers finish their trip against Charlotte and Indiana ... The Cavaliers haven't won two in a row since March of last season. ... Cleveland plays at Detroit on Monday."}
