{"game_id": "0021700919", "chunk_id": "0021700919_001", "order": 1, "role": "lead", "text": "DALLAS --  Russell Westbrook didn't waste much time putting just his second single-digit scoring game of the season behind him."}
{"game_id": "0021700919", "chunk_id": "0021700919_002", "order": 2, "role": "body", "text": "The Oklahoma City star won it with the play that wrapped up his 20th game with at least 30 points."}
{"game_id": "0021700919", "chunk_id": "0021700919_003", "order": 3, "role": "body", "text": "Westbrook's go-ahead three-point play in the final minute of overtime put him at 30, and the Thunder beat the Dallas Mavericks 111-110 on Wednesday night."}
{"game_id": "0021700919", "chunk_id": "0021700919_004", "order": 4, "role": "body", "text": "Westbrook, who had 11 rebounds and seven assists, drove for the tying layup and made the free throw with 38 seconds left in OT to help the playoff-contending Thunder salvage a four-game split of the season series against a one-time postseason rival now among the NBA's worst teams."}
{"game_id": "0021700919", "chunk_id": "0021700919_005", "order": 5, "role": "body", "text": "The reigning MVP had 10 points on 5-of-6 shooting in the first quarter after scoring eight in a win over Orlando. Westbrook cooled off from there and missed all five of his 3-pointers, but scored seven of Oklahoma City's 11 points in overtime."}
{"game_id": "0021700919", "chunk_id": "0021700919_006", "order": 6, "role": "body", "text": "\"Just keep going, man,\" said Westbrook, who was 11 of 25 from the field and made eight of nine free throws. \"Regardless of missed or made shots, my mentality never changes throughout the game and I always continue to stay in attack mode.\""}
{"game_id": "0021700919", "chunk_id": "0021700919_007", "order": 7, "role": "body", "text": "Dwight Powell forced overtime at 100-all with a follow shot at the buzzer to match his career high with 21 points. It was the first points for Dallas since Powell's alley-oop dunk with 4 minutes remaining."}
{"game_id": "0021700919", "chunk_id": "0021700919_008", "order": 8, "role": "body", "text": "Harrison Barnes scored 26 points for the Mavericks, who beat the Thunder in the Western Conference finals in 2011 before getting swept in the first round by them as defending champions a year later."}
{"game_id": "0021700919", "chunk_id": "0021700919_009", "order": 9, "role": "body", "text": "\"People look at their record and think they aren't a very good team,\" Oklahoma City coach Billy Donovan said. \"They are a good basketball team. They have not been able to close out some games.\""}
{"game_id": "0021700919", "chunk_id": "0021700919_010", "order": 10, "role": "body", "text": "Dallas had a chance to win in overtime on an inbound play with 6 seconds left, but could only get a desperation jumper at the buzzer from rookie Dennis Smith Jr., who scored the first eight Dallas points in the extra period and finished with 17."}
{"game_id": "0021700919", "chunk_id": "0021700919_011", "order": 11, "role": "body", "text": "\"The last shot was a tough shot but a makeable shot,\" Smith said. \"Learn from it, learn from it. You can look at it as a loss or a lesson.\""}
{"game_id": "0021700919", "chunk_id": "0021700919_012", "order": 12, "role": "body", "text": "The Mavericks almost turned it over on the final possession of regulation but Wesley Matthews kept the play alive before missing a wild layup, with Powell grabbing the rebound on the other side of the basket and laying it in."}
{"game_id": "0021700919", "chunk_id": "0021700919_013", "order": 13, "role": "body", "text": "Carmelo Anthony had put the Thunder ahead with 1:23 to go on a layup after three offensive rebounds on the same possession, including two from Steven Adams."}
{"game_id": "0021700919", "chunk_id": "0021700919_014", "order": 14, "role": "body", "text": "Paul George had 23 points and 11 rebounds, and Adams had nine points and 12 boards."}
{"game_id": "0021700919", "chunk_id": "0021700919_016", "order": 16, "role": "body", "text": "Thunder: F Jerami Grant was called for a flagrant foul for a swipe at the head when Powell made a layup in the first half. ... The Thunder outrebounded the Mavericks 56-36, including a 19-8 edge on offensive rebounds."}
{"game_id": "0021700919", "chunk_id": "0021700919_017", "order": 17, "role": "body", "text": "Mavericks: Dirk Nowitzki, who is sixth on the NBA scoring list, reached 31,000 points with his patented one-legged fadeway in the middle of the second quarter. The 39-year-old German, in his 20th season, all with the Mavericks, finished with 12 points. ... Powell led Dallas with eight rebounds. ... J.J. Barea scored all 12 of his points in the fourth quarter and matched Westbrook with a game-high seven assists."}
{"game_id": "0021700919", "chunk_id": "0021700919_019", "order": 19, "role": "body", "text": "Dallas center Nerlens Noel had four points, three rebounds and four fouls in 16 minutes in his return after missing 42 games following surgery for a torn ligament in his left thumb. He was rusty, failing to get off a shot on two alley-oops and missing another attempt. He led Dallas with three first-half turnovers, but had a highlight in the second half with a block on a soaring Westbrook going for a layup."}
{"game_id": "0021700919", "chunk_id": "0021700919_020", "order": 20, "role": "body", "text": "Before the injury was announced in December, Noel had appeared to fall out of favor with coach Rick Carlisle. The first six of those 42 missed games were listed as coaching decisions. He's playing on a one-year contract after he couldn't agree on a long-term deal with the Mavericks, who acquired him at the trading deadline last season."}
{"game_id": "0021700919", "chunk_id": "0021700919_022", "order": 22, "role": "body", "text": "Westbrook has gone without a 3 in four of the past six games and is 2 of 24 (8 percent) from long range in that span. The slump has dropped the career 31 percent shooter from 3 to 28 percent for the season."}
{"game_id": "0021700919", "chunk_id": "0021700919_024", "order": 24, "role": "body", "text": "Thunder: At Phoenix on Friday."}
{"game_id": "0021700919", "chunk_id": "0021700919_025", "order": 25, "role": "body", "text": "Mavericks: At Chicago on Friday, the only road game in a stretch of seven games."}
{"game_id": "0021700919", "chunk_id": "0021700919_027", "order": 27, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
