{"game_id": "0021301083", "chunk_id": "0021301083_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Kevin Durant displayed his usual dominance as a scorer, and the Thunder supported him with one of their best defensive performances of the season."}
{"game_id": "0021301083", "chunk_id": "0021301083_002", "order": 2, "role": "body", "text": "Durant scored 29 points to help Oklahoma City beat the Sacramento Kings 94-81 on Friday night."}
{"game_id": "0021301083", "chunk_id": "0021301083_003", "order": 3, "role": "body", "text": "Durant's high-scoring ways have been wasted at times by the Thunder, who lost 128-119 at Dallas on Tuesday despite 43 points by the NBA's leading scorer."}
{"game_id": "0021301083", "chunk_id": "0021301083_004", "order": 4, "role": "body", "text": "This time, the Thunder held Sacramento to 51 points and 30 percent shooting through the first three quarters. Durant could have done more damage, but he sat for good with 1:25 left in the third and the Thunder firmly in control."}
{"game_id": "0021301083", "chunk_id": "0021301083_005", "order": 5, "role": "body", "text": "\"Lately, we've been much better defensively and offensively,\" he said. \"So, tonight was a good game. We put both sides of the floor together pretty well.\""}
{"game_id": "0021301083", "chunk_id": "0021301083_006", "order": 6, "role": "body", "text": "Durant has scored at least 25 points in 37 consecutive games, the longest streak since Michael Jordan's 40-game run for the Chicago Bulls during the 1986-87 season."}
{"game_id": "0021301083", "chunk_id": "0021301083_007", "order": 7, "role": "body", "text": "Russell Westbrook had 18 points and six assists and Jeremy Lamb added 13 points for the Thunder, who have won five of six. The Thunder have held their opponent to 96 or fewer points in four of the five wins."}
{"game_id": "0021301083", "chunk_id": "0021301083_008", "order": 8, "role": "body", "text": "\"We put ourselves in position, if we defend, to win every game,\" Westbrook said."}
{"game_id": "0021301083", "chunk_id": "0021301083_009", "order": 9, "role": "body", "text": "Ben McLemore scored 18 points and Travis Outlaw added 17 for the Kings."}
{"game_id": "0021301083", "chunk_id": "0021301083_010", "order": 10, "role": "body", "text": "DeMarcus Cousins, who entered the game ranked 10th in the league in scoring, finished with four points on 2-for-8 shooting while dealing with foul trouble. Rudy Gay, who averages 20 points per game, finished with seven on 3-for-11 shooting."}
{"game_id": "0021301083", "chunk_id": "0021301083_011", "order": 11, "role": "body", "text": "\"Not one guy could take credit for stopping Gay or Cousins, so we just try to do it together and rely on each other, and we did a good job,\" Durant said."}
{"game_id": "0021301083", "chunk_id": "0021301083_012", "order": 12, "role": "body", "text": "Sacramento point guard Isaiah Thomas missed his second straight game with a right quad contusion. In two games against the Thunder this season, he averaged 31 points and 4.5 assists while shooting 56 percent from the field."}
{"game_id": "0021301083", "chunk_id": "0021301083_013", "order": 13, "role": "body", "text": "Thomas scored a career-high 38 points against Oklahoma City on Jan. 19. Without him, the Kings shot 37 percent from the field in one of their worst offensive performances of the season."}
{"game_id": "0021301083", "chunk_id": "0021301083_014", "order": 14, "role": "body", "text": "\"The toughest position to lose is your point guard, just because he runs your team, and there were times tonight where obviously, we didn't look like an organized basketball team,\" Kings coach Michael Malone said."}
{"game_id": "0021301083", "chunk_id": "0021301083_015", "order": 15, "role": "body", "text": "Oklahoma City bolted to a 32-15 lead at the end of the first quarter after holding the Kings to 26 percent shooting, and the Thunder led 54-38 at halftime. Durant scored 16 points in the first half on just six shot attempts."}
{"game_id": "0021301083", "chunk_id": "0021301083_016", "order": 16, "role": "body", "text": "Sacramento's starters shot 7 for 28 from the field before the break. Cousins had two points on 1-for-3 shooting in the first half in just seven minutes because of foul trouble."}
{"game_id": "0021301083", "chunk_id": "0021301083_017", "order": 17, "role": "body", "text": "Durant surpassed 25 points on a 3-pointer in the third quarter, and then his lob to Westbrook for a dunk on Oklahoma City's next possession gave the Thunder a 77-51 lead. Oklahoma City led 82-51 at the end of the quarter."}
{"game_id": "0021301083", "chunk_id": "0021301083_018", "order": 18, "role": "body", "text": "\"We did a good job of focusing in,\" Westbrook said. \"We did a great job of just focusing on us and focusing on our team and trying not to worry about them so much.\""}
{"game_id": "0021301083", "chunk_id": "0021301083_019", "order": 19, "role": "body", "text": "No Kings player reached double figures in scoring until McLemore made two free throws with 10:27 remaining in the fourth."}
{"game_id": "0021301083", "chunk_id": "0021301083_020", "order": 20, "role": "body", "text": "\"We are undermanned, we don't have a lot of bodies, so the guys who are able to play need to play with more of a sense of urgency and greater effort,\" Malone said."}
{"game_id": "0021301083", "chunk_id": "0021301083_021", "order": 21, "role": "body", "text": "Game notes Thunder C Hasheem Thabeet inadvertently deflected a ball off the backboard and into the hoop for the Kings in the first quarter. ...  Westbrook scored 10 points in nine minutes in the first quarter. ... Westbrook was issued a technical foul in the second quarter for punching the ball and making it go out of bounds. Oklahoma City's Serge Ibaka got a technical in the first minute of the third quarter. ... Thunder G Reggie Jackson sat out with a mid-back sprain. ... Thunder G Reggie Williams played for the second time this season after recently signing a 10-day contract. ... Kings F Derrick Williams did not play due to illness. ... Kings rookie G Ray McCallum got his second career start in Thomas' place."}
{"game_id": "0021301083", "chunk_id": "0021301083_023", "order": 23, "role": "closing", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP"}
