{"game_id": "0021200057", "chunk_id": "0021200057_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- Zach Randolph and the Memphis Grizzlies did their damage down low."}
{"game_id": "0021200057", "chunk_id": "0021200057_002", "order": 2, "role": "body", "text": "Randolph had 18 points and 13 rebounds, and Memphis shot 53 percent from the floor in a 108-90 victory over the undersized Milwaukee Bucks on Wednesday night."}
{"game_id": "0021200057", "chunk_id": "0021200057_003", "order": 3, "role": "body", "text": "\"We felt that our big guys were a lot bigger than their frontcourt,\" Grizzlies guard Mike Conley said. \"We wanted to try to bang them inside and get low to get position and get easy buckets and head to the free throw line.\""}
{"game_id": "0021200057", "chunk_id": "0021200057_004", "order": 4, "role": "body", "text": "Rudy Gay added 17 points and Marreese Speights contributed 16 off the bench to help Memphis win its third straight after a season-opening loss. Marc Gasol had 14 points and nine rebounds."}
{"game_id": "0021200057", "chunk_id": "0021200057_005", "order": 5, "role": "body", "text": "\"Gasol is so smart, once he gets to the top of the key, he's able to make passes and shoot the jumper,\" Bucks guard Brandon Jennings said. \"If he doesn't have anything, he's just moving it. And Randolph down there is just a beast.\""}
{"game_id": "0021200057", "chunk_id": "0021200057_006", "order": 6, "role": "body", "text": "Milwaukee, which was looking to start 3-0 for the first time since the 2005-06 season, shot just 38.5 percent from the field. Jennings led the Bucks with 19 points, but he was only 6 of 20 from the field. Monta Ellis added 15 points on 5-of-18 shooting."}
{"game_id": "0021200057", "chunk_id": "0021200057_007", "order": 7, "role": "body", "text": "\"We were definitely outmatched tonight,\" Mike Dunleavy said."}
{"game_id": "0021200057", "chunk_id": "0021200057_008", "order": 8, "role": "body", "text": "The Grizzlies withstood a third-quarter rally and pulled away in the fourth."}
{"game_id": "0021200057", "chunk_id": "0021200057_009", "order": 9, "role": "body", "text": "\"We moved the ball, we got everybody involved,\" Gasol said. \"We played basketball.\""}
{"game_id": "0021200057", "chunk_id": "0021200057_010", "order": 10, "role": "body", "text": "Memphis went on a 13-4 run at the start of the third quarter to widen its lead to 69-47, but the Bucks used a 21-6 spurt to cut the lead to seven with about a minute left in the period. During the run, Speights was whistled for a flagrant foul on Jennings, who hit both free throws. Larry Sanders' basket capped the rally. The Grizzlies hit back-to-back 3-pointers to close out the quarter and increase the lead to 13."}
{"game_id": "0021200057", "chunk_id": "0021200057_011", "order": 11, "role": "body", "text": "\"We played really well,\" Memphis coach Lionel Hollins said. \"We shot the ball well, we shot 3s well and they did not shoot the ball well.\""}
{"game_id": "0021200057", "chunk_id": "0021200057_012", "order": 12, "role": "body", "text": "After missing his first three shots from the field, Jennings, the reigning Eastern Conference player of the week, nailed a 3-pointer to give the Bucks a 15-13 lead. A short time later, he made another 3 to put the Bucks back up 20-19."}
{"game_id": "0021200057", "chunk_id": "0021200057_013", "order": 13, "role": "body", "text": "Memphis turned the ball over six times in the opening period but held a 23-22 lead, scoring 10 points in the paint."}
{"game_id": "0021200057", "chunk_id": "0021200057_014", "order": 14, "role": "body", "text": "\"We withstood all that they had for tonight,\" Hollins said. \"They just didn't shoot the ball well. They had a lot of open looks.\""}
{"game_id": "0021200057", "chunk_id": "0021200057_015", "order": 15, "role": "body", "text": "The Grizzlies scored the first nine points of the second quarter, opening a 32-22 lead, before Jennings made a running shot, got fouled and made the free throw."}
{"game_id": "0021200057", "chunk_id": "0021200057_016", "order": 16, "role": "body", "text": "Ellis also got off to a rough start, missing his first seven shots from the field. He finished the first half making only three of 12 shots from the field. He and Sanders were whistled for technical fouls in the second quarter. Jennings finished the first half with 13 points but made just 4-of-12 shots."}
{"game_id": "0021200057", "chunk_id": "0021200057_017", "order": 17, "role": "body", "text": "\"We had a bad shooting night,\" Jennings said. \"We missed a lot of layups, especially myself. They were layups that I usually make. We also gave up a lot of second-chance shots.\""}
{"game_id": "0021200057", "chunk_id": "0021200057_018", "order": 18, "role": "body", "text": "Bucks coach Scott Skiles wasn't pleased with his team's performance on either end of the court."}
{"game_id": "0021200057", "chunk_id": "0021200057_019", "order": 19, "role": "body", "text": "\"Our defense wasn't good at all,\" he said. \"Other than a few minutes early in the game and a few minutes in the third, they pretty much owned us in every area. We must have missed 15 layups. (Memphis) had all the energy, they had all the toughness, they executed better, so they took it to us.\""}
{"game_id": "0021200057", "chunk_id": "0021200057_020", "order": 20, "role": "closing", "text": "Game notes Bucks backup point guard Beno Udrih was inactive after sustaining a deep thigh bruise during a collision with teammate Ersan Ilyasova at practice Tuesday. ... Rookie forward John Henson made his debut for the Bucks after being inactive for the first two games of the season due to a bone bruise and knee strain. The first-round draft pick out of North Carolina entered in the third quarter and finished with two points."}
