{"game_id": "0021700540", "chunk_id": "0021700540_001", "order": 1, "role": "lead", "text": "HOUSTON --  With James Harden in the locker room with a hamstring injury and the Houston Rockets desperate to end their losing streak, Chris Paul came to the rescue."}
{"game_id": "0021700540", "chunk_id": "0021700540_002", "order": 2, "role": "body", "text": "Harden scored 40 points before leaving with the injury late in the fourth quarter, and Paul scored 15 of his 28 points in overtime as the Rockets snapped a five-game skid with a 148-142 double-overtime win over the Los Angeles Lakers on Sunday night."}
{"game_id": "0021700540", "chunk_id": "0021700540_003", "order": 3, "role": "body", "text": "\"He just willed us to win, and great players can do that,\" coach Mike D'Antoni said. \"Certain guys can just say, `We're not losing,' and `Whatever it takes,' and that's what he said tonight and that's what he did.\""}
{"game_id": "0021700540", "chunk_id": "0021700540_004", "order": 4, "role": "body", "text": "Los Angeles led by as many as 17, but couldn't hold on as the team's season-long losing streak stretched to six games."}
{"game_id": "0021700540", "chunk_id": "0021700540_005", "order": 5, "role": "body", "text": "Paul made a pair of free throws to tie it at 142 with about a minute left in the second overtime before Tarik Black blocked Kyle Kuzma's shot on the other end to give Houston the ball back. P.J. Tucker grabbed a rebound on a miss by Paul and put it back up to put Houston on top."}
{"game_id": "0021700540", "chunk_id": "0021700540_006", "order": 6, "role": "body", "text": "Tucker blocked a 3-point attempt by Kuzma, and Paul added two more free throws to make it 146-142 with 3 seconds left. Paul made two more free throws after that to secure the win."}
{"game_id": "0021700540", "chunk_id": "0021700540_007", "order": 7, "role": "body", "text": "The Rockets had hoped to limit Paul's playing time in his second game back after missing three games with a groin injury. But with Harden out, he ended up playing 42 minutes."}
{"game_id": "0021700540", "chunk_id": "0021700540_008", "order": 8, "role": "body", "text": "\"We worked too hard to let that game go,\" Paul said. \"We had fought. Different guys had been in and out of the lineup. James carried us all game long and different guys had to step up and it's just will at that point. Let's just figure out a way to win it.\""}
{"game_id": "0021700540", "chunk_id": "0021700540_009", "order": 9, "role": "body", "text": "Julius Randle set season highs with 29 points and 15 rebounds, but fouled out with about three minutes left in the first overtime."}
{"game_id": "0021700540", "chunk_id": "0021700540_010", "order": 10, "role": "body", "text": "\"It's obviously frustrating but ... we're short-handed right now and it would've been a lot easier to kind of just pack it in and individually go out and try to put up big numbers until we get healthy or until we get to an easier part of the schedule,\" Lakers coach Luke Walton said. \"Our guys really came together tonight and really played well for most of the game.\""}
{"game_id": "0021700540", "chunk_id": "0021700540_011", "order": 11, "role": "body", "text": "Los Angeles was up by 4 in the second overtime before a dunk by Black followed by a 3-pointer from Trevor Ariza made it 140-139 with 2 1/2 minutes remaining. The Lakers scored the next three points before Paul's free throws tied it."}
{"game_id": "0021700540", "chunk_id": "0021700540_012", "order": 12, "role": "body", "text": "Ariza finished with a season-high 26 points."}
{"game_id": "0021700540", "chunk_id": "0021700540_013", "order": 13, "role": "body", "text": "Paul gave Houston its first lead since the second quarter with a 3-pointer that made it 127-125 with 2:40 remaining in the first overtime."}
{"game_id": "0021700540", "chunk_id": "0021700540_014", "order": 14, "role": "body", "text": "The Lakers got two free throws from Brandon Ingram, and Josh Hart added a basket on a goaltending call to make it 131-129 with about a minute to go in the first OT."}
{"game_id": "0021700540", "chunk_id": "0021700540_015", "order": 15, "role": "body", "text": "Black tied it up before Hart missed a 3-pointer to give Houston the ball back. Paul put Houston on top with a short jumper with four seconds remaining, but P.J. Tucker fouled Ingram and he made both free throws with 0.8 seconds left in the first overtime to tie it at 133-133."}
{"game_id": "0021700540", "chunk_id": "0021700540_016", "order": 16, "role": "body", "text": "Paul had a shot to win it, but he missed a 3-pointer at the buzzer."}
{"game_id": "0021700540", "chunk_id": "0021700540_017", "order": 17, "role": "body", "text": "Houston got a 3-pointer from Ariza followed by a three-point play from Harden to tie it at 119-all with about a minute left in the fourth. But Kuzma, who scored a career-high 38 points in his last game against Houston, made a 3-pointer a few seconds later to put the Lakers back on top."}
{"game_id": "0021700540", "chunk_id": "0021700540_018", "order": 18, "role": "body", "text": "Harden was injured when he missed a layup after that and was taken to the locker room."}
{"game_id": "0021700540", "chunk_id": "0021700540_019", "order": 19, "role": "body", "text": "Gerald Green tied it again with a 3-pointer with 17.7 seconds remaining."}
{"game_id": "0021700540", "chunk_id": "0021700540_020", "order": 20, "role": "body", "text": "Kuzma followed with a missed 3-pointer, and the Lakers got the ball back with 0.7 seconds left, but they didn't have time to get a shot off."}
{"game_id": "0021700540", "chunk_id": "0021700540_021", "order": 21, "role": "body", "text": "Houston center Clint Capela had seven points and seven rebounds in his return after missing two games with an orbital fracture. He wore a mask in the first half to protect the injured area, but it seemed to be bothering him and he took it off at halftime."}
{"game_id": "0021700540", "chunk_id": "0021700540_023", "order": 23, "role": "body", "text": "Lakers: Rookie Lonzo Ball missed his fourth straight game because of a sprained left shoulder. He did not make the trip, remaining in California for treatment. ... The Lakers' 72 first-half points were a season high. ... Ennis had a season-high 20 points."}
{"game_id": "0021700540", "chunk_id": "0021700540_024", "order": 24, "role": "body", "text": "Rockets: Capela, who is also dealing with a bruised heel, missed four of the previous five games. ... Gordon finished with 14 points."}
{"game_id": "0021700540", "chunk_id": "0021700540_026", "order": 26, "role": "body", "text": "Harden has a strained left hamstring and had a noticeable limp after the game, but he hopes he won't have to miss any time."}
{"game_id": "0021700540", "chunk_id": "0021700540_027", "order": 27, "role": "body", "text": "\"Hopefully it's not that serious,\" he said. \"Just a pull ... just got some treatment so hopefully day to day it gets better.\""}
{"game_id": "0021700540", "chunk_id": "0021700540_029", "order": 29, "role": "body", "text": "Sunday was Houston's first overtime game this season, and the Rockets have won six straight in double overtime dating to 2008. Five of those have been played at home."}
{"game_id": "0021700540", "chunk_id": "0021700540_031", "order": 31, "role": "body", "text": "Lakers: Visit Minnesota on Monday."}
{"game_id": "0021700540", "chunk_id": "0021700540_032", "order": 32, "role": "body", "text": "Rockets: Visit the Magic on Wednesday."}
{"game_id": "0021700540", "chunk_id": "0021700540_034", "order": 34, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
