{"game_id": "0021300636", "chunk_id": "0021300636_001", "order": 1, "role": "lead", "text": "BOSTON -- With both Kevin Durant and Russell Westbrook sitting out for the first time since the franchise set up shop in Oklahoma City, the Thunder needed about a half to figure things out.\nAnd then the Western Conference leaders put the lottery-bound Boston Celtics away.\n\"We take pride in playing hard no matter who's on the floor,\" coach Scott Brooks said after his team went on a 17-2 third-quarter run to beat Boston 101-83 on Friday night. \"Obviously, we're a better team with Kevin and Russell. But it doesn't make us not a team.\"\nDurant, the NBA scoring leader, missed his first game of the season, joining fellow All-Star Westbrook on the bench. That was only a minor setback, with Serge Ibaka scoring nine of his 21 points and adding five rebounds in the pivotal third quarter to lead Oklahoma City to its sixth straight victory."}
{"game_id": "0021300636", "chunk_id": "0021300636_002", "order": 2, "role": "closing", "text": "Jeremy Lamb came off the bench to score 19 points, and Reggie Jackson had 14 points and eight assists.\n\"Everybody's just got to do their job a little bit better and a little bit harder,\" said Thunder center Kendrick Perkins, a former Celtic, who had nine rebounds. \"It's our first time playing without both of them, so it was good.\"\nDurant was the franchise's first pick in 2007, its final year as the Seattle SuperSonics, and Westbrook was their first-round pick after the team moved to Oklahoma City for the following season. Together, they led the Thunder to the 2012 NBA Finals and were poised for another deep run last year before Westbrook was injured in the first round series against Houston.\nOklahoma City has managed to stay atop the West with Westbrook out since Christmas to recover from right knee surgery. And Durant has been the reason, going on a scoring tear with at least 30 points in nine consecutive games before sitting out Friday night.\nBut Durant watched this one from the bench in warmups, then was icing his right shoulder in the locker room after the game, joking around with Westbrook.\n\"They're a good team without him -- as you can see,\" Celtics guard Phil Pressey said.\nBrooks said he did not know if his star would return on Saturday night against Philadelphia.\n\"We'll see how he wakes up,\" the coach said.\nJeff Green scored 16 points and Gerald Wallace scored 12 of his 13 points in the first half, before the Thunder pulled away with a 17-2 run in the third quarter. Rajon Rondo had eight assists and five points in his fifth game since returning from reconstructive knee surgery.\nThe Celtics have lost 13 of 15 games.\n\"They're down Kevin Durant, and I think their team is thinking `OK, this is an opportunity for a lot of guys that don't play as much when he's playing minutes,\" Celtics center Kris Humphries said. \"Something happened. You guys all saw the game. It wasn't great. Thanks for staying for the whole game.\"\nThe Thunder allowed the Celtics to open a five-point lead early in the second quarter but then scored 18 of the next 22 points to take a nine-point lead.\nIt was a two-point game after Boston scored the first basket of the second half, but Oklahoma City opened a 60-53 lead and then scored 17 of the next 19 points.\nIn all, Oklahoma City outscored the Celtics 27-13 in the third.\nGame notes\nRondo became the sixth player in Celtics history to reach the 4,000-assist plateau. Bill Russell is next, with 4,100. ... The Thunder have the best record in Western Conference and are 6-0 on the road against Eastern Conference teams. They will try to remain perfect Saturday at Philadelphia... Celtics F Jared Sullinger dislocated his right index finger in the first half but returned to the game."}
