{"game_id": "0021700978", "chunk_id": "0021700978_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Two nights after arguably their ugliest effort of the season, the Pacers looked refreshed and were never seriously threatened."}
{"game_id": "0021700978", "chunk_id": "0021700978_002", "order": 2, "role": "body", "text": "Bojan Bogdanovic scored 21 points, Cory Joseph scored 10 of his 18 points in the opening quarter, and Indiana routed the Atlanta Hawks 112-87 on Friday night. The Pacers were coming off a lackluster 20-point home loss to Utah."}
{"game_id": "0021700978", "chunk_id": "0021700978_003", "order": 3, "role": "body", "text": "Joseph, starting at point guard while Darren Collison works his way back to full strength after left knee surgery, hit two of Indiana's five 3-pointers to help build a 34-15 lead after 12 minutes."}
{"game_id": "0021700978", "chunk_id": "0021700978_004", "order": 4, "role": "body", "text": "\"It always starts with the point guard, not just scoring-wise but getting everybody in the sets and playing hard on the defensive end,\" said Joseph, who has started the past 12 games. \"I'm just trying to go out there and start well for my team.\""}
{"game_id": "0021700978", "chunk_id": "0021700978_005", "order": 5, "role": "body", "text": "Collison, in his first game back, came off the bench and scored 17 points in 21 minutes."}
{"game_id": "0021700978", "chunk_id": "0021700978_006", "order": 6, "role": "body", "text": "\"If you hope for something, you hope for what he did tonight,\" Pacers coach Nate McMillan said of Collison. \"He didn't miss a beat coming back. It was good to have him on the floor.\""}
{"game_id": "0021700978", "chunk_id": "0021700978_007", "order": 7, "role": "body", "text": "Victor Oladipo and Myles Turner also scored 17 apiece for Indiana, which has won 12 of 15 home games since the start of the new year."}
{"game_id": "0021700978", "chunk_id": "0021700978_008", "order": 8, "role": "body", "text": "The Pacers led by as many as 21 in the second quarter and went ahead by 31 points in the third quarter. They finished 14 of 28 from 3-point range."}
{"game_id": "0021700978", "chunk_id": "0021700978_009", "order": 9, "role": "body", "text": "\"They made it look easier tonight,\" McMillan said. \"Our guys were knocking down shots.\""}
{"game_id": "0021700978", "chunk_id": "0021700978_010", "order": 10, "role": "body", "text": "Rookie reserve guard Tyler Dorsey scored all of his career-high 18 points in the second half for the Hawks, who dropped to a league-worst 5-27 on the road."}
{"game_id": "0021700978", "chunk_id": "0021700978_011", "order": 11, "role": "body", "text": "\"They jumped on us from the beginning and they were the more aggressive team,\" Dorsey said.  \"They were more aggressive on the defensive end and the offensive end. Give credit to them.\""}
{"game_id": "0021700978", "chunk_id": "0021700978_012", "order": 12, "role": "body", "text": "Hawks coach Mike Budenholzer said his team failed to match the Pacers' intensity."}
{"game_id": "0021700978", "chunk_id": "0021700978_013", "order": 13, "role": "body", "text": "\"They started well and we didn't,\" Budenholzer said. \"But I thought it was 48 minutes of that. The start certainly didn't help, but it was just an indicator of their mindset, how they came out ready and we just weren't as sharp or as physical or as aggressive as we needed to be to match that.\""}
{"game_id": "0021700978", "chunk_id": "0021700978_015", "order": 15, "role": "body", "text": "Hawks: Rank second in forcing turnovers (16 per game) as well as points off turnovers (18.7). ... The team's experience average of 1.6 years is the lowest in the league, according to Elias. The roster has 10 players with one year or less of experience. ... A 107-102 home win over the Pacers on Feb. 28 snapped a four-game losing streak to Indiana."}
{"game_id": "0021700978", "chunk_id": "0021700978_016", "order": 16, "role": "body", "text": "Pacers: Five 3-pointers in the first quarter surpassed the previous game's output, when Indiana shot just 3 of 23 beyond the arc. ... Bogdanovic has scored in double digits in 15 consecutive games, the longest such streak of his four-year career. ... Coach Nate McMillan's 558th career win moved him past former Golden State coach Al Attles for 26th place on the league's all-time list."}
{"game_id": "0021700978", "chunk_id": "0021700978_018", "order": 18, "role": "body", "text": "Collison won't regain his starting spot until he's considered full strength. He hit his first four shots, including a 3-pointer just before the first-quarter buzzer."}
{"game_id": "0021700978", "chunk_id": "0021700978_019", "order": 19, "role": "body", "text": "He was having the best all-around season of his 9-year career before the injury, averaging 12.8 points and 5.3 assists while shooting 49.5 percent. The Pacers were 7-4 without him."}
{"game_id": "0021700978", "chunk_id": "0021700978_021", "order": 21, "role": "body", "text": "Hawks point guard Dennis Schroder (19.3 points, 6.3 assists) is on pace to become just the fourth player in franchise history to average 19 points and 6 assists. The only other Hawks to finish a season with those totals were Lenny Wilkins, Pete Maravich (twice) and Joe Johnson. Schroder has scored 20 or more points in 31 games this season."}
{"game_id": "0021700978", "chunk_id": "0021700978_023", "order": 23, "role": "body", "text": "Hawks: Host Chicago on Sunday."}
{"game_id": "0021700978", "chunk_id": "0021700978_026", "order": 26, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
