{"game_id": "0021400962", "chunk_id": "0021400962_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  The Indiana Pacers outlasted the Milwaukee Bucks."}
{"game_id": "0021400962", "chunk_id": "0021400962_002", "order": 2, "role": "body", "text": "They might just do it in the Eastern Conference standings, too."}
{"game_id": "0021400962", "chunk_id": "0021400962_003", "order": 3, "role": "body", "text": "Rodney Stuckey scored 25 points and Luis Scola had 17 points and 15 rebounds to help Indiana beat Milwaukee 109-103 in overtime Thursday night. Since the All-Star break, the Pacers are NBA-best 9-1 and have pulled within 3 1/2 games of Milwaukee for the sixth seed."}
{"game_id": "0021400962", "chunk_id": "0021400962_004", "order": 4, "role": "body", "text": "Down by two points in overtime, the Pacers used a 9-0 run to take a 105-98 lead."}
{"game_id": "0021400962", "chunk_id": "0021400962_005", "order": 5, "role": "body", "text": "George Hill sealed the victory with two free throws with 16 seconds left, stretching the lead to six. Hill and C.J. Miles each finished with 17 points."}
{"game_id": "0021400962", "chunk_id": "0021400962_006", "order": 6, "role": "body", "text": "\"We took it as a playoff game. That's the way we wanted to come in,\" Miles said. \"It was a big win for us. (Milwaukee's) a team we're chasing in the standings. We were just able to make some plays down the stretch.\""}
{"game_id": "0021400962", "chunk_id": "0021400962_007", "order": 7, "role": "body", "text": "Indiana was on the verge of closing in the fourth quarter when David West's jumper with 2:45 left in regulation gave Indiana a five-point lead. Indiana failed to score again in regulation, and Milwaukee's Ersan Illyasova had five points in the final 2 minutes to send it to overtime."}
{"game_id": "0021400962", "chunk_id": "0021400962_008", "order": 8, "role": "body", "text": "Michael Carter-Williams led the Bucks with 28 points. Illyasova had 19 points and 10 rebounds, and Zaza Pachulia finished with 16 points and 12 rebounds."}
{"game_id": "0021400962", "chunk_id": "0021400962_009", "order": 9, "role": "body", "text": "\"Our guys fought tonight on a back-to-back,\" Bucks coach Jason Kidd said. \"Short-handed, guys stepped up. Everybody gave everything they had. There's a lot of good stuff on the road against a team that is playing extremely well.\""}
{"game_id": "0021400962", "chunk_id": "0021400962_010", "order": 10, "role": "body", "text": "Indiana never led in the first half and was down 12 in the first quarter. A strong third quarter sent the Pacers into the final period with an eight-point lead. The Pacers biggest lead was 10 points in the game that had eight lead changes and eight ties."}
{"game_id": "0021400962", "chunk_id": "0021400962_011", "order": 11, "role": "body", "text": "Indiana's backups outscored Milwaukee's reserves 52-10. Along with their effort and production off the bench, Pacers coach Frank Vogel was pleased with the offensive production despite 20 turnovers."}
{"game_id": "0021400962", "chunk_id": "0021400962_012", "order": 12, "role": "body", "text": "\"The Bucks are No. 1 in the league in forcing turnovers,\" Vogel said.\" We knew it was going to be a much more challenging night on the offensive end, in particular taking care of the basketball, and it was. We've got to be more disciplined. To our guy's credit, they grinded it out and got a win.\""}
{"game_id": "0021400962", "chunk_id": "0021400962_013", "order": 13, "role": "body", "text": "Indiana's Roy Hibbert missed the game because of an infection in his left elbow, giving Ian Mahinmi the start. Mahinmi fouled out after a flagrant-1 was called in overtime. He had eight rebounds and 10 points."}
{"game_id": "0021400962", "chunk_id": "0021400962_015", "order": 15, "role": "body", "text": "Bucks: The Bucks are 0-3 on the road in March. Milwaukee is 5-5 this season when scoring 30 or more points in the first quarter."}
{"game_id": "0021400962", "chunk_id": "0021400962_016", "order": 16, "role": "body", "text": "Pacers: Stuckey added six rebounds and six assists."}
{"game_id": "0021400962", "chunk_id": "0021400962_018", "order": 18, "role": "body", "text": "Bucks: At Memphis on Saturday night."}
{"game_id": "0021400962", "chunk_id": "0021400962_019", "order": 19, "role": "closing", "text": "Pacers: Host Boston on Saturday night."}
