{"game_id": "0021700222", "chunk_id": "0021700222_001", "order": 1, "role": "lead", "text": "CHICAGO --  Exhausted and elated following the birth of his daughter this week, new father Justin Holiday had enough left to give one of the best performances of his career."}
{"game_id": "0021700222", "chunk_id": "0021700222_002", "order": 2, "role": "body", "text": "Holiday scored 27 and the Chicago Bulls overcame a 47-point outburst by Kemba Walker to beat the skidding Charlotte Hornets 123-120 on Friday night, snapping a five-game losing streak."}
{"game_id": "0021700222", "chunk_id": "0021700222_003", "order": 3, "role": "body", "text": "\"It's been amazing, man,\" Holiday said. \"I'm just thankful and blessed to be able to have a child that's healthy and still have this job at the end of the day. I'm good.\""}
{"game_id": "0021700222", "chunk_id": "0021700222_004", "order": 4, "role": "body", "text": "Holiday finished two points shy of his career high, helping the Bulls pick up a rare win on a night when Walker simply dazzled for the Hornets."}
{"game_id": "0021700222", "chunk_id": "0021700222_005", "order": 5, "role": "body", "text": "The 2017 All-Star nearly matched his personal best of 52 points but missed a driving layup with Charlotte trailing by one in the closing seconds."}
{"game_id": "0021700222", "chunk_id": "0021700222_006", "order": 6, "role": "body", "text": "Lauri Markkanen then hit two free throws to make it 123-120 with 2.6 seconds left, securing the Bulls' third win in 13 games this season. Charlotte has dropped six straight."}
{"game_id": "0021700222", "chunk_id": "0021700222_007", "order": 7, "role": "body", "text": "\"I feel bad for Coach (Steve Clifford),\" Walker said. \"He's constantly taking the blame for a lot of our losses and it has nothing to do with him, man. He's doing the best job he can to put us in position to win games with his schemes and stuff. We're just messing everything up. It's bad. And you know, it starts with me. I have to be better defensively as well. I have to find a way to get my teammates going defensively and find a way for us to put together a full 48-minute game. It's been a while since we've done that.\""}
{"game_id": "0021700222", "chunk_id": "0021700222_008", "order": 8, "role": "body", "text": "Last in the NBA in scoring and field goal percentage, Chicago shot 52 percent and hit 17 of 34 3-pointers."}
{"game_id": "0021700222", "chunk_id": "0021700222_009", "order": 9, "role": "body", "text": "Holiday and Denzel Valentine, who had 18 points, each sank four from long range. Kris Dunn scored a career-high 22, Markkanen added 16 and the Bulls came out on top after a tense finish."}
{"game_id": "0021700222", "chunk_id": "0021700222_010", "order": 10, "role": "body", "text": "\"For the team, it does a lot,\" Dunn said. \"If we keep going out there playing hard together, keep building that chemistry ... I think we're going to carry it on to the next game.\""}
{"game_id": "0021700222", "chunk_id": "0021700222_012", "order": 12, "role": "body", "text": "Charlotte's Michael Kidd-Gilchrist rebounded a missed shot by Chicago's Robin Lopez with about 10 seconds left. After a timeout, Walker beat Dunn off a pick and got by Cristiano Felicio only to miss a driving layup as a rotating Markkanen bothered the shot ."}
{"game_id": "0021700222", "chunk_id": "0021700222_013", "order": 13, "role": "body", "text": "\"I just missed,\" Walker said. \"Had a good look. Kind of lost the ball a little bit. But I mean, I got what I wanted, just came up short.\""}
{"game_id": "0021700222", "chunk_id": "0021700222_015", "order": 15, "role": "body", "text": "Call that a super response from Superman."}
{"game_id": "0021700222", "chunk_id": "0021700222_016", "order": 16, "role": "body", "text": "Dwight Howard had an emphatic answer in the first quarter when a fan near the baseline yelled, \"Dwight Howard, you (stink)!\" He dunked, turned and winked at the guy."}
{"game_id": "0021700222", "chunk_id": "0021700222_018", "order": 18, "role": "body", "text": "Hornets: Nicolas Batum had nine points in 27 minutes after scoring 16 over 32 minutes in his season debut against Cleveland on Wednesday night. Batum missed the first 13 games because of a torn ligament in his left elbow. Clifford wanted to hold Batum to about 28 minutes in this one after he carried a heavier load than anticipated against the Cavaliers. ... Howard had 11 points and nine rebounds. ... Marvin Williams scored 13."}
{"game_id": "0021700222", "chunk_id": "0021700222_019", "order": 19, "role": "body", "text": "Bulls: Coach Fred Hoiberg on Houston scoring 90 points in the first half against Phoenix on Thursday: \"I'd pray to get 90 in a game.\" ... C David Nwaba (sprained right ankle) missed his fifth consecutive game. He participated in the shootaround and the Bulls hope to have him practice on Saturday. ... Markkanen led the Bulls with seven rebounds. ... Holiday also had three steals."}
{"game_id": "0021700222", "chunk_id": "0021700222_021", "order": 21, "role": "body", "text": "Hornets: Host the Los Angeles Clippers on Saturday."}
{"game_id": "0021700222", "chunk_id": "0021700222_022", "order": 22, "role": "body", "text": "Bulls: Visit the Phoenix Suns on Sunday."}
{"game_id": "0021700222", "chunk_id": "0021700222_024", "order": 24, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
