{"game_id": "0021400540", "chunk_id": "0021400540_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. -- The Atlanta Hawks certainly looked the part of Eastern Conference leaders for most of the first half -- and that was enough to extend their winning streak and snap Detroit's impressive run.\nBarely.\nAl Horford had 19 points and 16 rebounds, and the Hawks withstood a spirited rally by the Pistons on Friday night, holding on for a 106-103 victory. Atlanta has now won seven in a row and 21 of 23, while Detroit lost for the first time in eight games. The Pistons had been unbeaten since waiving high-priced forward Josh Smith last month.\n\"They had our full attention coming into the game, for sure. They've been playing some really great basketball,\" Atlanta's Kyle Korver said. \"You're coming up against a team like that, you've got to jump on them early.\"\nAtlanta did that, dominating the first two quarters and quieting a crowd at the Palace that was hoping to see more evidence of Detroit's sudden resurgence. The Hawks led by 23 in the second quarter, but the Pistons were able to make a game of it.\nDetroit had a chance to tie it when Kentavious Caldwell-Pope missed a 3-pointer at the buzzer. Caldwell-Pope scored 16 of his 20 points in the fourth quarter.\n\"Our shot selection was terrible all night, especially in the first half,\" Pistons coach Stan Van Gundy said. \"There are positives to take out of this, because they didn't give up on the game, and we made some plays to get back into it. We were down 23, but we gave ourselves a shot at the end. It was a desperate shot, but we at least had that chance.\"\nThe Pistons went 13-of-43 from 3-point range on a night when standout big men Greg Monroe and Andre Drummond were a combined 7-of-20 from the field.\nDetroit cut the lead to three on Monroe's dunk with 2 seconds left, then the Hawks turned the ball over near midcourt. After a lengthy replay review, the Pistons were given 1.2 seconds on the clock, which was enough time for Caldwell-Pope to get a shot off from the right corner, but it missed badly.\nCaldwell-Pope was 8-of-23 from the field and 4-of-16 from 3-point range, but toward the end the Pistons seemed to have little choice but to take 3s. Drummond was sick and played only 17 minutes. He missed a dunk on Detroit's first trip down the court in the second half, and he did not return after leaving the game with 7:51 left in the third.\nDetroit's turnaround of late has been remarkable -- the Pistons were 5-23 before their winning streak -- but Atlanta's sustained excellence has been one of the most impressive stories of the first half of this season. The Hawks (28-8) lead the East by three games.\nAtlanta went 6-of-11 from 3-point range in the second quarter, and the Hawks led 61-38 after a 10-3 run.\nThe Pistons trailed 64-45 at halftime. They cut the lead to nine on a few occasions in the second half, and they finally got closer when Monroe's free throws with 2:36 remaining made it 102-95. The Hawks missed a layup at the other end, but Monroe tried to make a quick pass, and it was stolen by DeMarre Carroll.\nKorver's 3-pointer pushed the lead back to 10.\nBALANCE\nPaul Millsap scored 17 points for the Hawks, who had six players in double figures. Jeff Teague had 14 points and Carroll added 13 -- although it was hard to remember how well Atlanta played after the big lead nearly slipped away.\n\"It's a game of runs,\" Korver said. \"That's why we talk so much about playing a 48-minute game, and why it's been so important to us. Luckily we had enough of a lead tonight for a while that we could withstand their run, but there's definitely a lot to learn from the film.\"\nBUZZ\nThe Pistons have gone through some dreadful seasons of late, so this recent stretch has been encouraging for Detroit fans. After the Pistons extended their winning streak to seven with victories at San Antonio and Dallas, an announced crowd of 18,859 turned out Friday. That was the team's largest home crowd since its home opener.\nTIP-INS\nHawks: Teague, who had scored at least 20 points in six straight games, was held below that mark but had 11 assists.\nPistons: Detroit was the fifth team in NBA history to have a seven-game winning streak in the same season as a 13-game losing streak, according to STATS. ... Detroit set a franchise record for 3-point attempts in a game, and Caldwell-Pope's 16 were the most by an NBA player this season.\nUP NEXT\nHawks: Host Washington on Sunday.\nPistons: Host Brooklyn on Saturday night."}
