{"game_id": "0021700169", "chunk_id": "0021700169_001", "order": 1, "role": "lead", "text": "DETROIT --  It has been over a decade since the Detroit Pistons started a season like this, and the question now is how they will handle their early success."}
{"game_id": "0021700169", "chunk_id": "0021700169_002", "order": 2, "role": "body", "text": "Coach Stan Van Gundy has his concerns, but even a poor second half couldn't keep Detroit from another victory."}
{"game_id": "0021700169", "chunk_id": "0021700169_003", "order": 3, "role": "body", "text": "Andre Drummond had 16 points, 20 rebounds and a career-high seven assists, and Reggie Jackson made a pair of 3-pointers in the final minute to lift the Pistons to a 111-104 victory over the Atlanta Hawks on Friday night. Detroit let a 19-point second-quarter lead slip away but recovered in time to earn its seventh win in eight games."}
{"game_id": "0021700169", "chunk_id": "0021700169_004", "order": 4, "role": "body", "text": "\"I don't want to sit here and just beat up on my guys to death, but I'm answering questions about the game. I can't sugarcoat the second half,\" Van Gundy said. \"We totally got outplayed in the second half.\""}
{"game_id": "0021700169", "chunk_id": "0021700169_005", "order": 5, "role": "body", "text": "The Central Division-leading Pistons (9-3) are off to their best start since 2005-06, when they went 10-2 to begin the season and ended up winning 64 games. Detroit outscored Atlanta 31-19 in the second quarter and led 57-41 at halftime, but couldn't shake the Hawks. Atlanta rallied and finally tied it at 94 when Kent Bazemore made back-to-back 3-pointers."}
{"game_id": "0021700169", "chunk_id": "0021700169_006", "order": 6, "role": "body", "text": "It was tight the rest of the way, and Jackson's 3-pointer with 52.5 seconds remaining put the Pistons up 103-100. He connected again from beyond the arc with 21.3 seconds left to make it 107-100 and help Detroit close out the win after an uneven performance."}
{"game_id": "0021700169", "chunk_id": "0021700169_007", "order": 7, "role": "body", "text": "\"I think the goal is to always learn, whether you're victorious or in a loss,\" Jackson said. \"Regardless of what our record is right now, playing well, we've been trying to go back to the drawing board each and every game just to be better than we were the day before.\""}
{"game_id": "0021700169", "chunk_id": "0021700169_008", "order": 8, "role": "body", "text": "Dennis Schroder had 17 points and 11 assists for Atlanta (2-10), which has the worst record in the Eastern Conference."}
{"game_id": "0021700169", "chunk_id": "0021700169_009", "order": 9, "role": "body", "text": "\"We've just got to smarten up,\" Bazemore said. \"They are a team that's been together for a while and they made some huge plays down the stretch and you've got to give them credit.\""}
{"game_id": "0021700169", "chunk_id": "0021700169_010", "order": 10, "role": "body", "text": "Drummond surpassed his previous career high of five assists by halftime, and he calmly made two free throws with 1:28 remaining to put the Pistons up 100-98. Drummond's foul shooting has improved noticeably this season, and he was 4 for 6 against the Hawks."}
{"game_id": "0021700169", "chunk_id": "0021700169_012", "order": 12, "role": "body", "text": "Drummond has had at least 12 rebounds in each of his first 12 games this season, matching Kevin Love's streak to start the 2011-12 season. The last player with a longer streak to start a season was Moses Malone with 16 games in 1978-79."}
{"game_id": "0021700169", "chunk_id": "0021700169_014", "order": 14, "role": "body", "text": "The Hawks have allowed at least 110 points in six straight games. It looked as if they might end that streak when they held Detroit to 19 in the third quarter, but the Pistons scored 35 in the fourth."}
{"game_id": "0021700169", "chunk_id": "0021700169_015", "order": 15, "role": "body", "text": "\"Hopefully we can build on the second half, the way we played,\" coach Mike Budenholzer said. \"It's really how we need to play for the whole game. Not good enough in the first half and dug ourselves a hole.\""}
{"game_id": "0021700169", "chunk_id": "0021700169_017", "order": 17, "role": "body", "text": "Hawks: Mike Muscala (sprained left ankle), DeAndre' Bembry (fractured right wrist), Miles Plumlee (strained right quad) and Ersan Ilyasova (bruised left knee) missed the game. ... Bazemore scored a team-high 22 points."}
{"game_id": "0021700169", "chunk_id": "0021700169_018", "order": 18, "role": "body", "text": "Pistons: Detroit was without Stanley Johnson (strained right hip flexor) and Jon Leuer (left ankle sprain). ... Jackson led the Pistons with 22 points and Avery Bradley scored 20."}
{"game_id": "0021700169", "chunk_id": "0021700169_020", "order": 20, "role": "body", "text": "Hawks: At Washington on Saturday night."}
{"game_id": "0021700169", "chunk_id": "0021700169_023", "order": 23, "role": "body", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
{"game_id": "0021700169", "chunk_id": "0021700169_025", "order": 25, "role": "closing", "text": "Follow Noah Trister at www.Twitter.com/noahtrister"}
