{"game_id": "0021401096", "chunk_id": "0021401096_001", "order": 1, "role": "lead", "text": "MIAMI --  Dwyane Wade was playing a day after having fluid drained from his left knee. Udonis Haslem is dealing with a slew of injuries, including problems with both ankles. An already decimated Miami Heat roster had two more players scratched at halftime."}
{"game_id": "0021401096", "chunk_id": "0021401096_003", "order": 3, "role": "body", "text": "Wade scored 19 of his 40 points in the fourth quarter, Haslem set season highs with 18 points and 13 rebounds, and the undermanned Heat enhanced their postseason hopes by beating the Detroit Pistons 109-102 on Sunday night."}
{"game_id": "0021401096", "chunk_id": "0021401096_004", "order": 4, "role": "body", "text": "\"Just being strong-willed,\" Wade said. \"We didn't have that many guys coming into the game, we lost two coming out of halftime ... but you have to do what you have to do.\""}
{"game_id": "0021401096", "chunk_id": "0021401096_005", "order": 5, "role": "body", "text": "James Ennis matched his season best with 16 points, Mario Chalmers scored 11 and Goran Dragic had 10 for the Heat, who won their fifth straight at home and strengthened their hold on the No. 7 spot in the Eastern Conference standings."}
{"game_id": "0021401096", "chunk_id": "0021401096_006", "order": 6, "role": "body", "text": "Andre Drummond had 32 points and 14 rebounds for the Pistons, who had won four in a row. Reggie Jackson had 31 points and nine assists."}
{"game_id": "0021401096", "chunk_id": "0021401096_007", "order": 7, "role": "body", "text": "\"The only two guys that played well for us offensively were Reggie and Andre,\" Pistons coach Stan Van Gundy said. \"Wade and Haslem played great for them. We had two guys play real well but they got more help.\""}
{"game_id": "0021401096", "chunk_id": "0021401096_008", "order": 8, "role": "body", "text": "Miami used seven players in the second half, after forwards Luol Deng (left knee) and Michael Beasley (right elbow) got hurt in the opening two quarters. Centers Hassan Whiteside (hand) and Chris Andersen (calf) were ruled out before the game, as was Shabazz Napier (hip)."}
{"game_id": "0021401096", "chunk_id": "0021401096_009", "order": 9, "role": "body", "text": "And the Heat have already lost Chris Bosh (blood clots) and Josh McRoberts (knee) for the season."}
{"game_id": "0021401096", "chunk_id": "0021401096_010", "order": 10, "role": "body", "text": "\"Our two co-captains really led us and set the tone,\" Heat coach Erik Spoelstra said."}
{"game_id": "0021401096", "chunk_id": "0021401096_011", "order": 11, "role": "body", "text": "Miami was up by as many as 17 in the third, but back-to-back 3-pointers from Jodie Meeks late in the quarter helped spark a Detroit run that got the Pistons within 71-65 going into the fourth."}
{"game_id": "0021401096", "chunk_id": "0021401096_012", "order": 12, "role": "body", "text": "But the Heat held on, with Wade going 11 for 11 from the line in the fourth quarter."}
{"game_id": "0021401096", "chunk_id": "0021401096_014", "order": 14, "role": "body", "text": "Miami didn't trail in the second half, with Wade getting a season-high 23 after the break."}
{"game_id": "0021401096", "chunk_id": "0021401096_015", "order": 15, "role": "body", "text": "\"That's Dwyane Wade,\" Jackson said. \"A great player, one of the greatest to play this game.\""}
{"game_id": "0021401096", "chunk_id": "0021401096_017", "order": 17, "role": "body", "text": "Pistons: Injured guard Brandon Jennings (Achilles) got a few shots up before the game, albeit in dress clothes and with a boot on his left foot. ... It was a homecoming for many Detroit players and coaches, including Van Gundy (former Heat assistant and head coach), former Heat-now-Piston players Caron Butler, Joel Anthony and Shawne Williams, and assistant coaches Tim Hardaway -- whose No. 10 is retired in Miami -- and Malik Allen."}
{"game_id": "0021401096", "chunk_id": "0021401096_018", "order": 18, "role": "body", "text": "Heat: Now 18-18 at home this season, Miami is at .500 there for the first time since Nov. 23. Miami has won eight of its last nine at home. ... Sundays are fundays for the Heat, who improved to 10-4 on that day this season. ... The Heat were so outmanned in the second half they had Walker guarding Drummond, despite giving up a mere five inches and 59 pounds to the Pistons' big man."}
{"game_id": "0021401096", "chunk_id": "0021401096_020", "order": 20, "role": "body", "text": "Sunday was the 12th anniversary of Wade's final win in college -- the 29-point, 11-rebound, 11-assist effort that led Marquette over Kentucky and sent his team to the Final Four. The Heat were off in Milwaukee that day, then-coach Pat Riley was watching the Marquette game while he worked out on a treadmill, and was duly impressed. The rest is history."}
{"game_id": "0021401096", "chunk_id": "0021401096_022", "order": 22, "role": "body", "text": "Van Gundy and Spoelstra are close friends, so perhaps they can commiserate on this point -- they're both looking at finishing with sub-.500 records for the first time. Detroit is already assured of Van Gundy's first losing record, and the Heat need to go 7-2 down the stretch to get Spoelstra to the break-even mark."}
{"game_id": "0021401096", "chunk_id": "0021401096_024", "order": 24, "role": "body", "text": "Pistons: Host Atlanta on Tuesday."}
{"game_id": "0021401096", "chunk_id": "0021401096_025", "order": 25, "role": "closing", "text": "Heat: Host San Antonio on Tuesday."}
