{"game_id": "0021200084", "chunk_id": "0021200084_001", "order": 1, "role": "lead", "text": "CHICAGO --  With the Chicago Bulls missing star Derrick Rose and two starters going without a basket, the team's revamped bench came through just like the old version did so many times over the last couple of years."}
{"game_id": "0021200084", "chunk_id": "0021200084_002", "order": 2, "role": "body", "text": "Nate Robinson scored 18 points off the bench, and the Bulls beat Minnesota 87-80 on Saturday night, ending the Timberwolves' three-game winning streak."}
{"game_id": "0021200084", "chunk_id": "0021200084_003", "order": 3, "role": "body", "text": "Robinson played 31 minutes after starting point guard Kirk Hinrich left the game with a right hip strain in the second quarter. Robinson sparked an 11-point run, helping Chicago beat Minnesota for the sixth straight time."}
{"game_id": "0021200084", "chunk_id": "0021200084_004", "order": 4, "role": "body", "text": "\"I just try to get my teammates involved and bring energy,\" Robinson said. \"Hopefully I did that.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_005", "order": 5, "role": "body", "text": "Joakim Noah added 17 points and seven rebounds, and Luol Deng chipped in with 16 points and seven rebounds, as the Bulls (4-2) bounced back from their second home loss in three outings."}
{"game_id": "0021200084", "chunk_id": "0021200084_006", "order": 6, "role": "body", "text": "\"We've got to just keep fighting for as many wins as possible,\" Noah said. \"It's always been like that.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_007", "order": 7, "role": "body", "text": "Nikola Pekovic led the short-handed Timberwolves (4-2) with 18 points and eight rebounds. Andrei Kirilenko added 11 points, 12 rebounds and seven assists. Minnesota's three-game streak matched its season high from last season."}
{"game_id": "0021200084", "chunk_id": "0021200084_008", "order": 8, "role": "body", "text": "\"We played good tonight,\" Pekovic said. \"Right to the end. But we had some bad moments.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_009", "order": 9, "role": "body", "text": "Hinrich went scoreless in 11 minutes before departing, and forward Carlos Boozer was limited to two points and failed to score a field goal in a game for the first time since Nov. 18, 2003."}
{"game_id": "0021200084", "chunk_id": "0021200084_010", "order": 10, "role": "body", "text": "\"Right now, the ball is just not going in for (Boozer),\" Bulls coach Tom Thibodeau said. \"He's gotten some good looks. It'll come around.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_011", "order": 11, "role": "body", "text": "Yet, Chicago had plenty to win with, as coach Tom Thibodeau likes to say, getting 11 points from Marco Belinelli, nine during a spree of three 3-pointers early in the fourth quarter."}
{"game_id": "0021200084", "chunk_id": "0021200084_012", "order": 12, "role": "body", "text": "\"That's part of my game,\" Belinelli said. \"I think it was important tonight, for me and for the team.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_013", "order": 13, "role": "body", "text": "Reserve Taj Gibson added eight points, eight rebounds and three blocks."}
{"game_id": "0021200084", "chunk_id": "0021200084_014", "order": 14, "role": "body", "text": "\"I thought our bench was terrific,\" Thibodeau said. \"I thought Marco was terrific. Taj was good. Nazr (Muhammed) was good.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_015", "order": 15, "role": "body", "text": "Belinelli's 3-point burst helped the Bulls establish a nine-point lead early fourth, breaking open a tight game. Chicago hit 6 for 13 from behind the arc, its season high for makes. The Bulls entered the game last in the NBA in 3-point makes and attempts."}
{"game_id": "0021200084", "chunk_id": "0021200084_016", "order": 16, "role": "body", "text": "\"We've got some guys who have shown throughout their career that they are good 3-point shooters,\" Thibodeau said. \"We still have to get our timing down and get a flow to what we're doing.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_017", "order": 17, "role": "body", "text": "The Bulls led by as many as 10 points down the stretch, going up by that margin when Deng hit a jumper from the corner with 3:53 remaining."}
{"game_id": "0021200084", "chunk_id": "0021200084_018", "order": 18, "role": "body", "text": "The Timberwolves closed within five points on Dante Cunningham's layup with 42.6 seconds to play, but the Bulls held on down the stretch."}
{"game_id": "0021200084", "chunk_id": "0021200084_019", "order": 19, "role": "body", "text": "Halfway through the fourth quarter, Minnesota's Chase Budinger left the floor with a twisted left knee and didn't return. After the game, the Timberwolves didn't seem too pleased with the Bulls' physical style of play."}
{"game_id": "0021200084", "chunk_id": "0021200084_020", "order": 20, "role": "body", "text": "\"They were fouling (Budinger) and just pushed him,\" Minnesota guard Luke Ridnour said. \"Gave him a little extra shove."}
{"game_id": "0021200084", "chunk_id": "0021200084_021", "order": 21, "role": "body", "text": "\"That's how they play. Lot of pushing. Lot of fouling. You've just got to play through it. We did and we had a chance to win the game in the fourth quarter.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_022", "order": 22, "role": "body", "text": "The severity of Budinger's injury was unknown, but his left leg was wrapped in ice after the game. The team said X-rays of Budinger's knee were negative and he will be re-evaluated on Sunday."}
{"game_id": "0021200084", "chunk_id": "0021200084_023", "order": 23, "role": "body", "text": "\"They've got big people who are very active and they challenge you,\" Minnesota coach Rick Adelman said. \"You've got to respond to it.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_024", "order": 24, "role": "body", "text": "Robinson's seven points helped Chicago grab a six-point lead with an 11-point run midway through the second quarter. The run was capped by Noah's feed to Taj Gibson on the baseline for a two-handed dunk."}
{"game_id": "0021200084", "chunk_id": "0021200084_025", "order": 25, "role": "body", "text": "\"I think our bench did a great job,\" Robinson said. \"We come to practice ready to play and we've got our starting five's back.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_026", "order": 26, "role": "body", "text": "The Bulls edged back in front with a 23-18 third quarter advantage, capped when rookie Marquis Teague drove the lane and scored with his left hand for his first career points. Teague, Chicago's first-round pick in June, hadn't appeared in a game since Nov. 2."}
{"game_id": "0021200084", "chunk_id": "0021200084_027", "order": 27, "role": "body", "text": "\"It felt good, get a bucket in, just to help my team,\" Teague said. \"I wasn't really overwhelmed. I felt like I was comfortable, ready to play.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_028", "order": 28, "role": "body", "text": "It's unknown if Hinrich will miss time because of his injury as he will be re-evaluated on Sunday. However, Thibodeau said he's confident that Teague will be ready to pick up the slack."}
{"game_id": "0021200084", "chunk_id": "0021200084_029", "order": 29, "role": "body", "text": "\"If he's in that locker room, he can play,\" Thibodeau said. \"I've been very pleased with what he's done in practice.\""}
{"game_id": "0021200084", "chunk_id": "0021200084_030", "order": 30, "role": "closing", "text": "Game notes The Timberwolves had just 11 players available even before Budinger's injury. Ricky Rubio (left knee surgery) and Kevin Love (fractured right hand) have been out all season. Jose Barea missed his second straight game with a sprained left foot, while Brandon Roy missed his first game of the campaign with a sore right knee. ... Chicago held its opponent under 100 points for the 15th straight games. ... Saturday marked the 23rd anniversary of the first win in Minnesota history, a 125-118 overtime win over Philadelphia. Thibodeau was a Timberwolves assistant at the time in his first NBA season."}
