{"game_id": "0021301146", "chunk_id": "0021301146_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Rodney Stuckey pulled the Pistons out of trouble."}
{"game_id": "0021301146", "chunk_id": "0021301146_002", "order": 2, "role": "body", "text": "Stuckey came off the bench to score 26 points and the Detroit reserves helped wipe out a 19-point deficit as the Pistons topped Boston 115-111. Stuckey's free throws with 57 seconds left broke a 111-all tie and gave Detroit the lead for good."}
{"game_id": "0021301146", "chunk_id": "0021301146_003", "order": 3, "role": "body", "text": "\"They got us back in with their energy,\" coach John Loyer said of his reserves, who helped the team end a two-game skid."}
{"game_id": "0021301146", "chunk_id": "0021301146_004", "order": 4, "role": "body", "text": "The Pistons trailed by 19 points in third quarter and were down 95-85 at the start of the fourth before embarking on a 15-4 run that gave them their first lead since early in the game. The teams traded the lead several times before Stuckey's free throws."}
{"game_id": "0021301146", "chunk_id": "0021301146_005", "order": 5, "role": "body", "text": "Boston's Jerryd Bayless tried for a go-ahead shot in the final seconds but his 3-point try rimmed out."}
{"game_id": "0021301146", "chunk_id": "0021301146_006", "order": 6, "role": "body", "text": "Greg Monroe had 21 points and Brandon Jennings added 20 for Detroit, which also got 19 and 20 rebounds from Andre Drummond, who tied the game at 111 on a tip with 1:52 to play. Thirteen of his caroms were on the offensive glass, giving him 402 this season and making him the most prolific single-season offensive rebounder since 2000."}
{"game_id": "0021301146", "chunk_id": "0021301146_007", "order": 7, "role": "body", "text": "\"I pride myself on getting offensive rebounds,\" Drummond said. \"That's how I get my points.\""}
{"game_id": "0021301146", "chunk_id": "0021301146_008", "order": 8, "role": "body", "text": "Jerryd Bayless had 25 points and Jeff Green added 22 for the Celtics, who lost their eighth straight and have dropped 12 in a row on the road."}
{"game_id": "0021301146", "chunk_id": "0021301146_009", "order": 9, "role": "body", "text": "Boston's lead was 82-63 midway through the third before Detroit rallied produced a handful of runs to keep the lead from getting past 20. Pistons reserve Jonas Jerebko had consecutive 3-pointers midway through the final period to give the Pistons a lead. Rookie Peyton Siva had all five of his career-best five assists in the fourth."}
{"game_id": "0021301146", "chunk_id": "0021301146_010", "order": 10, "role": "body", "text": "\"The reason we won the game was Peyton Siva,\" Drummond said. \"His energy in the fourth quarter was tremendous. He ran the show."}
{"game_id": "0021301146", "chunk_id": "0021301146_011", "order": 11, "role": "body", "text": "The Celtics looked sharp from the field in the first three quarters but had several droughts in the final period. They had just six field goals and 16 points in the fourth and did not score in the final three minutes."}
{"game_id": "0021301146", "chunk_id": "0021301146_012", "order": 12, "role": "body", "text": "\"I thought we let off the gas defensively a couple of times and all of a sudden, instead of a 19-point game, it's a 13- or 12-point game,\" Boston coach Brad Stevens said. \"We have seen that time and again in this league that those leads go quick.\""}
{"game_id": "0021301146", "chunk_id": "0021301146_013", "order": 13, "role": "body", "text": "Boston's Jared Sullinger, one of the worst 3-point shooters (.253 percent) in the league, made his first four tries from behind the arc. He scored 22 points and had 10 rebounds Saturday night in place of the injured Kris Humphries. Rookie Phil Pressey added a career-best 11 assists."}
{"game_id": "0021301146", "chunk_id": "0021301146_014", "order": 14, "role": "body", "text": "Boston guard Rajon Rondo, who had a triple double in Friday's loss to Philadelphia, did not play Saturday. He's missed the second game of back-to-back nights since he returned to the roster in January."}
{"game_id": "0021301146", "chunk_id": "0021301146_015", "order": 15, "role": "closing", "text": "Game notes Drummond's offensive rebound total is the most since New Jersey's Jayson Williams (443) and Chicago's Dennis Rodman (421) during the 1997-98 season. . Detroit's bench outscored Boston's 38-11. . Humphries missed the game after injuring his right patella tendon in the loss to Philadelphia. . The Celtics' last road win was Feb. 10 at Milwaukee. . Detroit hadn't won consecutive home games since mid-February."}
