{"game_id": "0021701154", "chunk_id": "0021701154_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  The celebration in the Trail Blazers' locker room after making the playoffs for the fifth straight season was one of relief more than excitement."}
{"game_id": "0021701154", "chunk_id": "0021701154_002", "order": 2, "role": "body", "text": "First goal accomplished. Now Portland heads out on the road with more work to do."}
{"game_id": "0021701154", "chunk_id": "0021701154_003", "order": 3, "role": "body", "text": "\"We're just looking to stay sharp, keep doing the things that's allowed us to have the success that we've had and try to finish it off and win the division, get home court,\" Damian Lillard said."}
{"game_id": "0021701154", "chunk_id": "0021701154_004", "order": 4, "role": "body", "text": "Lillard had 27 points and nine assists, and the Trail Blazers held off a late run by the Memphis Grizzlies for a 113-98 victory on Sunday night."}
{"game_id": "0021701154", "chunk_id": "0021701154_005", "order": 5, "role": "body", "text": "The Trail Blazers clinched their fifth straight playoff spot earlier in the evening when Utah won at Minnesota."}
{"game_id": "0021701154", "chunk_id": "0021701154_006", "order": 6, "role": "body", "text": "\"I told the team, one thing I like about Major League Baseball is when they clinch something, they celebrate. Unfortunately, we don't do that as much as we probably should,\" Blazers coach Terry Stotts said. \"Clinching the playoffs, being in the playoffs five straight years is a good accomplishment, is one of our goals at the beginning of the season. We still have some more goals to accomplish, but it's something everybody should be proud of.\""}
{"game_id": "0021701154", "chunk_id": "0021701154_007", "order": 7, "role": "body", "text": "CJ McCollum added 20 points and another nine assists for Portland, which is still holding on to third place in the Western Conference with five games remaining."}
{"game_id": "0021701154", "chunk_id": "0021701154_008", "order": 8, "role": "body", "text": "The Blazers, who have won four of their last five, embark on a four-game trip starting Tuesday night in Dallas."}
{"game_id": "0021701154", "chunk_id": "0021701154_009", "order": 9, "role": "body", "text": "Rookie Dillon Brooks had 28 points for Memphis, which sits second-to-last in the West. Brooks was one point shy of his season high."}
{"game_id": "0021701154", "chunk_id": "0021701154_010", "order": 10, "role": "body", "text": "\"Yeah, my teammates wanted me to get it,\" said Brooks, who played at Oregon. \"That was on me, I missed two open layups.\""}
{"game_id": "0021701154", "chunk_id": "0021701154_011", "order": 11, "role": "body", "text": "Portland led 103-80 in the fourth quarter, but the Grizzlies went on a 13-0 run capped by Brooks' jumper with 4:19 left, pulling within 10. That led Stotts to re-insert his starters."}
{"game_id": "0021701154", "chunk_id": "0021701154_012", "order": 12, "role": "body", "text": "Marquis Teague's basket got Memphis within eight points, but the Blazers took over with back-to-back 3-pointers from Evan Turner and Al-Farouq Aminu to extend Portland's lead to 113-95 with 1:12 left. That sent the starters back to the Blazers' bench for good."}
{"game_id": "0021701154", "chunk_id": "0021701154_013", "order": 13, "role": "body", "text": "Marc Gasol started for the Grizzlies, but his minutes were limited because of a left groin injury. He finished with seven points and five rebounds in 20 minutes."}
{"game_id": "0021701154", "chunk_id": "0021701154_014", "order": 14, "role": "body", "text": "MarShon Brooks, who had 21 points against the Blazers in a 108-103 victory in Memphis on Wednesday, was out with a left ankle injury. Coach J.B. Bickerstaff also sat JaMychal Green (knee soreness), Candler Parsons (rest) and Andrew Harrison, who missed this third game with a right wrist/left shoulder injury."}
{"game_id": "0021701154", "chunk_id": "0021701154_015", "order": 15, "role": "body", "text": "Portland's loss to the Grizzlies earlier this week spoiled a three-game road trip. But the Blazers were without Lillard, who didn't play because he was back in Portland awaiting the birth of his son. Damian Lillard Jr. was born Thursday morning."}
{"game_id": "0021701154", "chunk_id": "0021701154_016", "order": 16, "role": "body", "text": "The Blazers were without backup center Ed Davis, who rolled his ankle during the Blazers' 105-96 victory over the Clippers on Friday night. Portland said X-rays and an MRI on the ankle were both negative. Davis is expected to miss up to 14 days."}
{"game_id": "0021701154", "chunk_id": "0021701154_017", "order": 17, "role": "body", "text": "The Blazers led by 15 points in the first quarter, but Memphis closed the gap in the second. Ben McLemore hit a jumper to get the Grizzlies to 48-47, then had a layup for the lead."}
{"game_id": "0021701154", "chunk_id": "0021701154_018", "order": 18, "role": "body", "text": "Portland wrestled it back and went into halftime up 55-51. Lillard led all scorers with 13 points in the first two quarters."}
{"game_id": "0021701154", "chunk_id": "0021701154_019", "order": 19, "role": "body", "text": "McCollum's 3-pointer stretched the Blazers' lead to 72-61 midway through the third, and his dunk later made it 79-63."}
{"game_id": "0021701154", "chunk_id": "0021701154_020", "order": 20, "role": "body", "text": "Portland led 98-75 going into the final quarter, and Portland's starters, with the exception of McCollum, went to the bench."}
{"game_id": "0021701154", "chunk_id": "0021701154_021", "order": 21, "role": "body", "text": "\"For our guys to come back, cut the lead and force them to have to bring their starters back into the game, talks about the character of our guys and that young group. They didn't lay down, they continued to fight, I think that's where you start,\" Bickerstaff said. \"When you're trying to build a program and move forward, you need competitive guys and I think we're starting on the right track.\""}
{"game_id": "0021701154", "chunk_id": "0021701154_023", "order": 23, "role": "body", "text": "Grizzlies: Tyreke Evans was not with the team in Portland because of personal reasons. ... Brooks was greeted with warm applause during player introductions. \"This is a great state. Greats fans, people. They cheer for their Trail Blazers and they cheer for their Ducks. Feels great,\" he said afterward."}
{"game_id": "0021701154", "chunk_id": "0021701154_024", "order": 24, "role": "body", "text": "Trail Blazers: Portland's 43 third-quarter points tied the season high for points in a quarter. ... Turner and Aminu each had 14 points."}
{"game_id": "0021701154", "chunk_id": "0021701154_026", "order": 26, "role": "body", "text": "Grizzlies: Visit New Orleans on Wednesday night."}
{"game_id": "0021701154", "chunk_id": "0021701154_027", "order": 27, "role": "body", "text": "Trail Blazers: At Dallas on Tuesday night to open a four-game road trip."}
{"game_id": "0021701154", "chunk_id": "0021701154_029", "order": 29, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
