{"game_id": "0021400212", "chunk_id": "0021400212_003", "order": 3, "role": "body", "text": "have had much to be thankful for this NBA season."}
{"game_id": "0021400212", "chunk_id": "0021400212_004", "order": 4, "role": "body", "text": "They added to that list at the expense of the"}
{"game_id": "0021400212", "chunk_id": "0021400212_008", "order": 8, "role": "body", "text": "had 28 points, including six 3-pointers, as the Golden State Warriors rolled to a 111-96 victory over the Orlando Magic on Wednesday night."}
{"game_id": "0021400212", "chunk_id": "0021400212_009", "order": 9, "role": "body", "text": "Curry sat in the fourth quarter of Golden State's seventh straight victory overall and third consecutive win over the Magic. The Warriors led by as many as 27 in the second half."}
{"game_id": "0021400212", "chunk_id": "0021400212_010", "order": 10, "role": "body", "text": "\"Right now I think we have a pretty high level of tunnel vision to stay in the moment, cherish every opportunity to play,\" Curry said. \"We're winning in different styles, everybody's getting involved and you enjoy that as you go along.\""}
{"game_id": "0021400212", "chunk_id": "0021400212_012", "order": 12, "role": "body", "text": "added 16 points. Seven Warriors reached double figures."}
{"game_id": "0021400212", "chunk_id": "0021400212_013", "order": 13, "role": "body", "text": "Orlando, which has been bothered by a rash of recent injuries, lost its third straight game."}
{"game_id": "0021400212", "chunk_id": "0021400212_015", "order": 15, "role": "body", "text": "led the Magic with 16 points and 10 rebounds."}
{"game_id": "0021400212", "chunk_id": "0021400212_016", "order": 16, "role": "body", "text": "The Warriors hit their first five shots to take a 10-0 lead barely two minutes into the game."}
{"game_id": "0021400212", "chunk_id": "0021400212_017", "order": 17, "role": "body", "text": "Then Curry got going, connecting on all four 3-point attempts as part of a 14-point opening quarter. He finished the half with 25, going 5 for 5 from beyond arc."}
{"game_id": "0021400212", "chunk_id": "0021400212_018", "order": 18, "role": "body", "text": "\"I always think he's going to make every shot. That's what you expect. He's got the most beautiful rhythm to his shot that I've ever seen,\" Warriors coach Steve Kerr said."}
{"game_id": "0021400212", "chunk_id": "0021400212_019", "order": 19, "role": "body", "text": "Curry's sixth consecutive make from 3 early in the second half pushed Golden State's lead to 20. He didn't miss his first 3-pointer of the night until the 5:39 mark of the third quarter."}
{"game_id": "0021400212", "chunk_id": "0021400212_020", "order": 20, "role": "body", "text": "\"They dictated the pace the whole game,\" Harris said. \"Whatever they wanted to do out there, that's what they did.\""}
{"game_id": "0021400212", "chunk_id": "0021400212_021", "order": 21, "role": "body", "text": "Orlando entered Wednesday having seen its players miss a total of 43 games to injury or illness this season."}
{"game_id": "0021400212", "chunk_id": "0021400212_022", "order": 22, "role": "body", "text": "Five Magic players began the day on the injury report. Three of them --"}
{"game_id": "0021400212", "chunk_id": "0021400212_024", "order": 24, "role": "body", "text": "(right quad contusion, Harris (strained right calf), and"}
{"game_id": "0021400212", "chunk_id": "0021400212_026", "order": 26, "role": "body", "text": "(sprained left ankle) -- were all active against the Warriors. For O'Quinn it was his first action since the season-opener."}
{"game_id": "0021400212", "chunk_id": "0021400212_027", "order": 27, "role": "body", "text": "Despite Curry's shooting, the extra personnel provided Orlando an energy injection that helped the Magic keep pace for a while."}
{"game_id": "0021400212", "chunk_id": "0021400212_028", "order": 28, "role": "body", "text": "Orlando made a spurt early in the second quarter, briefly taking a two-point lead. But the Warriors outscored the Magic 29-14 the rest of the half."}
{"game_id": "0021400212", "chunk_id": "0021400212_030", "order": 30, "role": "body", "text": "Magic: C Nik Vucevic finished with 11 points and 13 rebounds, his 13th double-double of the season."}
{"game_id": "0021400212", "chunk_id": "0021400212_031", "order": 31, "role": "body", "text": "Warriors: Have made 25 3-pointers in their last two games. They improved to 4-0 against the Eastern Conference."}
{"game_id": "0021400212", "chunk_id": "0021400212_035", "order": 35, "role": "body", "text": ", general manager Rob Hennigan and Vaughn are joining other Magic staff, Levy Restaurants/Lee Wesley and the Coalition for the Homeless of Central Florida to serve Thanksgiving breakfast to more than 700 homeless men, women and children on Thursday. It marks the 22nd year of an annual Magic tradition that includes breakfast for Coalition residents and any members of the community who don't have the means to celebrate the holiday."}
{"game_id": "0021400212", "chunk_id": "0021400212_037", "order": 37, "role": "body", "text": "Former Magic No. 1 pick and four-time NBA champion Shaquille O'Neal sat courtside. Also in the building was fellow Orlando resident and PGA golfer Bubba Watson, 2014 Miss Universe Puerto Rico Gabriela Berrios and L.A. Dodgers second baseman Dee Gordon."}
{"game_id": "0021400212", "chunk_id": "0021400212_039", "order": 39, "role": "body", "text": "Magic: Begin a six-game road trip at Indiana on Friday."}
{"game_id": "0021400212", "chunk_id": "0021400212_040", "order": 40, "role": "body", "text": "Warriors: Continue their four-game road trip at Charlotte Friday."}
{"game_id": "0021400212", "chunk_id": "0021400212_042", "order": 42, "role": "closing", "text": "Follow Kyle Hightower on Twitter at http://www.twitter.com/khightower"}
