{"game_id": "0021401155", "chunk_id": "0021401155_001", "order": 1, "role": "lead", "text": "MIAMI --  Goran Dragic said he thought Tuesday carried Game 7 importance to the Miami Heat."}
{"game_id": "0021401155", "chunk_id": "0021401155_003", "order": 3, "role": "body", "text": "Dragic scored 11 of his 28 points in the fourth quarter, Luol Deng added 21 and the Heat helped their playoff chances with a 105-100 win over the Charlotte Hornets on Tuesday night."}
{"game_id": "0021401155", "chunk_id": "0021401155_004", "order": 4, "role": "body", "text": "Charlotte was down by 11 early in the fourth, then closed within three on three occasions in the final minutes. And every time, Dragic had the rebuttal that helped the Heat snap a four-game slide."}
{"game_id": "0021401155", "chunk_id": "0021401155_005", "order": 5, "role": "body", "text": "\"That's how tough it is to win in this league,\" Heat coach Erik Spoelstra said. \"You've got to make a lot of plays and play all the way to the end.\""}
{"game_id": "0021401155", "chunk_id": "0021401155_006", "order": 6, "role": "body", "text": "Dragic made 10 of 16 shots, his highest-scoring game since coming to Miami in a trade in February. His previous Heat high was 23."}
{"game_id": "0021401155", "chunk_id": "0021401155_007", "order": 7, "role": "body", "text": "\"We were talking before the game, this was a playoff game. ... Tonight was a must-win for us,\" Dragic said."}
{"game_id": "0021401155", "chunk_id": "0021401155_008", "order": 8, "role": "body", "text": "Dwyane Wade had 19 and Hassan Whiteside added 12 on 6-for-8 shooting for Miami, which moved within a half-game of eighth-place Boston for the final playoff spot in the Eastern Conference."}
{"game_id": "0021401155", "chunk_id": "0021401155_009", "order": 9, "role": "body", "text": "Gerald Henderson led the Hornets with 29 points. Kemba Walker scored 17, Mo Williams had 15, Bismack Biyombo had a 12-point, 12-rebound night, and Marvin Williams grabbed 13 rebounds for Charlotte."}
{"game_id": "0021401155", "chunk_id": "0021401155_010", "order": 10, "role": "body", "text": "\"Tonight was a big game,\" Henderson said. \"We've played all the teams that are in the mix there with us and we lost to them all. It's never good.\""}
{"game_id": "0021401155", "chunk_id": "0021401155_011", "order": 11, "role": "body", "text": "Charlotte's rally in the fourth came against a Heat team that wasted a 15-point late lead in what became a 99-98 loss at Detroit on Saturday."}
{"game_id": "0021401155", "chunk_id": "0021401155_012", "order": 12, "role": "body", "text": "The Heat hung on this time, getting big scores from Dragic and key moments from plenty of others -- like a rebound with 2:23 left by Tyler Johnson, a 6-foot-4 guard who went into a maze of Hornets to grab the ball and protect what was then a six-point lead, a play that Spoelstra said was one of the keys to the night."}
{"game_id": "0021401155", "chunk_id": "0021401155_013", "order": 13, "role": "body", "text": "\"Coach kept saying, Game 7-type mentality,\" Johnson said. \"Any possession could have shifted the way the game turned out.\""}
{"game_id": "0021401155", "chunk_id": "0021401155_014", "order": 14, "role": "body", "text": "The Hornets remained 11th in the East -- now two games back of Boston -- and won't have center Al Jefferson for at least one more game. Jefferson sat again Tuesday with right knee pain and has already been ruled out for Wednesday's home game with Toronto."}
{"game_id": "0021401155", "chunk_id": "0021401155_015", "order": 15, "role": "body", "text": "\"Like most teams, we had a busy March. We played 17 games in 30 days and he didn't want to sit out,\" Hornets coach Steve Clifford said. \"So I think it just progressively got worse. Now he's trying to rest it and see if he can go maybe this weekend.\""}
{"game_id": "0021401155", "chunk_id": "0021401155_016", "order": 16, "role": "body", "text": "Charlotte led by eight early, Miami answered with a 27-9 run that put the Heat on top by 10, and ultimately nothing was decided in the first half. The teams went into intermission knotted at 55, their 11th tie after a half that also included 10 lead changes."}
{"game_id": "0021401155", "chunk_id": "0021401155_017", "order": 17, "role": "body", "text": "Then the Hornets scored the first six of the third quarter but the Heat responded, going up by as many as 13 later in the third before taking an 82-75 lead into the fourth."}
{"game_id": "0021401155", "chunk_id": "0021401155_019", "order": 19, "role": "body", "text": "Hornets: Besides Jefferson, the Hornets were again without Cody Zeller (right shoulder) and Michael Kidd-Gilchrist (left ankle). The Hornets are 6-16 when Kidd-Gilchrist cannot play. ... Charlotte's remaining five games are home for Toronto, at Atlanta, at Detroit, home for Houston and at Toronto. ... The Hornets are 15-4 when holding opponents under 90, and 18-40 otherwise."}
{"game_id": "0021401155", "chunk_id": "0021401155_020", "order": 20, "role": "body", "text": "Heat: Miami is 16-0 when scoring at least 104 points. ... Deng made his 700th career start, the 28th active player to reach that plateau. ... It was the first of a four-game homestand for the Heat. Miami has only one more road game -- the finale next Wednesday at Philadelphia. ... Michael Beasley (illness) was not available Tuesday, and guard Mario Chalmers (flu) played despite needing two liters of intravenous fluid pregame."}
{"game_id": "0021401155", "chunk_id": "0021401155_022", "order": 22, "role": "body", "text": "With his 19 points, Wade is now 36 away from former Heat assistant coach and current scout Bob McAdoo (18,787) for 54th on the NBA's career scoring list. Wade started the season 72nd on that list."}
{"game_id": "0021401155", "chunk_id": "0021401155_024", "order": 24, "role": "body", "text": "Charlotte has now lost 13 consecutive games at Miami, including playoffs."}
{"game_id": "0021401155", "chunk_id": "0021401155_026", "order": 26, "role": "body", "text": "Hornets: Host Toronto on Wednesday."}
{"game_id": "0021401155", "chunk_id": "0021401155_027", "order": 27, "role": "closing", "text": "Heat: Host Chicago on Thursday."}
