{"game_id": "0021700425", "chunk_id": "0021700425_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  The Memphis Grizzlies avoided dropping into the Western Conference cellar by beating the worst team in the East."}
{"game_id": "0021700425", "chunk_id": "0021700425_002", "order": 2, "role": "body", "text": "And it took every last second to secure the win over the Atlanta Hawks."}
{"game_id": "0021700425", "chunk_id": "0021700425_003", "order": 3, "role": "body", "text": "Tyreke Evans scored 22 points, including the go-ahead layup with 1:03 left, as the Grizzlies snapped a five-game skid with a 96-94 victory over the Hawks on Friday night."}
{"game_id": "0021700425", "chunk_id": "0021700425_004", "order": 4, "role": "body", "text": "But there were a lot of deep breaths in the closing seconds."}
{"game_id": "0021700425", "chunk_id": "0021700425_005", "order": 5, "role": "body", "text": "The Hawks attempted three shots in the final 3.5 seconds, all of which misfired, including Andrew Harrison's deflection of Taurean Prince's attempt in the left corner with about 1.2 seconds left. The ball went into Kent Bazemore's hands and his 3-point attempt at the horn bounced off the front of the rim."}
{"game_id": "0021700425", "chunk_id": "0021700425_006", "order": 6, "role": "body", "text": "\"All I was thinking was don't let them get it up,\" Harrison said of his defense in the closing seconds."}
{"game_id": "0021700425", "chunk_id": "0021700425_007", "order": 7, "role": "body", "text": "Mario Chalmers added 16 points and had four steals for Memphis, while Marc Gasol scored 13 points."}
{"game_id": "0021700425", "chunk_id": "0021700425_008", "order": 8, "role": "body", "text": "The loss left the Hawks with the worst record in the NBA, while the win helped Memphis stay above the Dallas Mavericks, who sit at the bottom of the West."}
{"game_id": "0021700425", "chunk_id": "0021700425_009", "order": 9, "role": "body", "text": "\"Winning always feels better than losing,\" Memphis interim coach J.B. Bickerstaff said with relief, later adding: \"I think some plays went our way.\""}
{"game_id": "0021700425", "chunk_id": "0021700425_010", "order": 10, "role": "body", "text": "Bazemore led the Hawks with 19 points, while Dennis Schroder finished with 18 points and 11 assists. Prince contributed 17 points as Atlanta dropped its fourth straight."}
{"game_id": "0021700425", "chunk_id": "0021700425_011", "order": 11, "role": "body", "text": "\"Tough loss,\" Atlanta coach Mike Budenholzer said. \"I felt like we played well enough for more of the game, for 48 minutes, but we weren't able to come away with the win. We needed to make a few more plays down the stretch.\""}
{"game_id": "0021700425", "chunk_id": "0021700425_012", "order": 12, "role": "body", "text": "The first half was representative of a contest between two of the worst teams in the league, with a total of 24 turnovers and both shooting 44 percent. A few more made free throws for Atlanta and a couple of extra 3-pointers gave the Hawks a 47-40 lead at intermission."}
{"game_id": "0021700425", "chunk_id": "0021700425_013", "order": 13, "role": "body", "text": "Memphis trailed 89-81 with just over 6 minutes left when it reeled off eight straight, capped by Chalmers' 3-pointer to tie the game at 89."}
{"game_id": "0021700425", "chunk_id": "0021700425_014", "order": 14, "role": "body", "text": "Chalmers converted another 3-pointer with 1:45 to go, tying the game at 94, setting the stage for Evans' go-ahead basket."}
{"game_id": "0021700425", "chunk_id": "0021700425_015", "order": 15, "role": "body", "text": "\"We kind of weathered the storm,\" Bazemore said of the game. \"I think we took a step forward as a team. We didn't get the win, but there was a lot of good stuff.\""}
{"game_id": "0021700425", "chunk_id": "0021700425_017", "order": 17, "role": "body", "text": "Hawks: Schroder's 11 assists marked the second straight night he has reached at least 10. ... Ersan Ilyasova finished with nine points. He entered the game having scored at least 20 in three of last four games. ... Marco Belinelli finished with 14 points, converting 5 of 9 shots."}
{"game_id": "0021700425", "chunk_id": "0021700425_018", "order": 18, "role": "body", "text": "Grizzlies: Evans returned after missing Wednesday's game in Washington with right hip soreness. ... Memphis committed 14 turnovers in the first half, a season high. The Grizzlies' 22 turnovers for the game also were a season high. ... Gasol, who scored all 13 of his points in the third quarter, has reached double figures in all but one game this season, a victory over Houston on Oct. 28. ... JaMychal Green grabbed 12 rebounds, including four off the offensive glass."}
{"game_id": "0021700425", "chunk_id": "0021700425_020", "order": 20, "role": "body", "text": "Prince made a career-high five 3-pointers in the game. His previous high was four on Nov. 11 against the Wizards. \"We're really encouraging him to shoot 3s,\" Budenholzer said. \"I think that will open up his drive game and other things he can do. That's what we really want from him.\""}
{"game_id": "0021700425", "chunk_id": "0021700425_022", "order": 22, "role": "body", "text": "Memphis finished the game 12 of 25 from outside the arc, but the success fell to four players. Gasol made both of his 3-pointers, while Harrison converted all three of his. Evans and Chalmers missed only one 3-point shot each, Evans going 4 of 5 and Chalmers making 3 of 4."}
{"game_id": "0021700425", "chunk_id": "0021700425_024", "order": 24, "role": "body", "text": "Asked about what he was thinking during the flurry of Atlanta shots in the closing few seconds, Bickerstaff replied: \"There were some things going through my head that I don't want to say.\""}
{"game_id": "0021700425", "chunk_id": "0021700425_026", "order": 26, "role": "body", "text": "Hawks: Host the Miami Heat on Monday."}
{"game_id": "0021700425", "chunk_id": "0021700425_027", "order": 27, "role": "body", "text": "Grizzlies: Play the second night of a home back-to-back on Saturday against the Boston Celtics."}
{"game_id": "0021700425", "chunk_id": "0021700425_029", "order": 29, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
