{"game_id": "0021400510", "chunk_id": "0021400510_001", "order": 1, "role": "lead", "text": "BOSTON --  Kemba Walker knows there's a lot more riding on him because several key teammates are sidelined with injuries."}
{"game_id": "0021400510", "chunk_id": "0021400510_002", "order": 2, "role": "body", "text": "He certainly looked comfortable with that Monday night."}
{"game_id": "0021400510", "chunk_id": "0021400510_003", "order": 3, "role": "body", "text": "Walker scored 20 of his 33 points in the second half and Cody Zeller finished with a career-high 20 points in a perfect shooting performance, carrying the Charlotte Hornets to a 104-95 win over the Boston Celtics."}
{"game_id": "0021400510", "chunk_id": "0021400510_004", "order": 4, "role": "body", "text": "It was just the second win in seven games for the Hornets, who learned last week that leading scorer Al Jefferson will be out for about three more weeks with a left groin injury."}
{"game_id": "0021400510", "chunk_id": "0021400510_005", "order": 5, "role": "body", "text": "\"I know teams are going to throw multiple guys and try to make it tough on me,\" Walker said, sitting at his locker with both feet in an ice bucket. \"I just play in the flow of the game. My teammates are doing an unbelievable job for me.\""}
{"game_id": "0021400510", "chunk_id": "0021400510_006", "order": 6, "role": "body", "text": "One of those teammates who helped pick up some of the scoring slack was Zeller, the younger brother of Boston's Tyler Zeller."}
{"game_id": "0021400510", "chunk_id": "0021400510_007", "order": 7, "role": "body", "text": "Cody Zeller went 8 for 8 from the floor, hit all four of his free throws and improved to 6-0 against his big brother, who had just two points in 16 minutes."}
{"game_id": "0021400510", "chunk_id": "0021400510_008", "order": 8, "role": "body", "text": "\"I didn't even know that until they told me,\" Cody Zeller said, smiling. \"They were kidding me saying I should have shot more because I didn't miss at all.\""}
{"game_id": "0021400510", "chunk_id": "0021400510_009", "order": 9, "role": "body", "text": "Walker added five assists and five rebounds."}
{"game_id": "0021400510", "chunk_id": "0021400510_010", "order": 10, "role": "body", "text": "Jared Sullinger led Boston with 22 points and eight rebounds. Reserves Jae Crowder and James Young each had 13 points for the Celtics, who have dropped three straight and seven of eight."}
{"game_id": "0021400510", "chunk_id": "0021400510_011", "order": 11, "role": "body", "text": "\"I've got to figure out how to coach this team better,\" Boston's Brad Stevens said. \"I'm not doing a very good job. We're not playing well and we're playing almost -- it's not good basketball. We've got to do a better job of playing good basketball and figure out the rotations. ... It's on me.\""}
{"game_id": "0021400510", "chunk_id": "0021400510_012", "order": 12, "role": "body", "text": "Sullinger said the Celtics have a lot to work on."}
{"game_id": "0021400510", "chunk_id": "0021400510_013", "order": 13, "role": "body", "text": "\"Everything,\" he said. \"Defensively, offensively, executing the game plan. We've just got to do better.\""}
{"game_id": "0021400510", "chunk_id": "0021400510_014", "order": 14, "role": "body", "text": "The Celtics trailed 88-72 with just under eight minutes to play before scoring 10 unanswered points."}
{"game_id": "0021400510", "chunk_id": "0021400510_015", "order": 15, "role": "body", "text": "But Marvin Williams' three-point play and Walker's driving basket sandwiched around a free throw by Marcus Smart pushed the Hornets' lead back to double digits with 3:19 to play."}
{"game_id": "0021400510", "chunk_id": "0021400510_016", "order": 16, "role": "body", "text": "Charlotte led by 14 at halftime and increased it to 68-47 on Walker's 3-pointer from the top of the key, his second in just more than a minute."}
{"game_id": "0021400510", "chunk_id": "0021400510_017", "order": 17, "role": "body", "text": "Walker scored 12 of Charlotte's 16 points during a stretch from midway through the third quarter to the final minute, helping the Hornets maintain a comfortable lead."}
{"game_id": "0021400510", "chunk_id": "0021400510_018", "order": 18, "role": "body", "text": "Charlotte led 79-62 after three quarters."}
{"game_id": "0021400510", "chunk_id": "0021400510_019", "order": 19, "role": "body", "text": "In the first half, Charlotte opened a 46-32 lead on Zeller's layup late in the second quarter en route to a 50-36 halftime edge."}
{"game_id": "0021400510", "chunk_id": "0021400510_020", "order": 20, "role": "body", "text": "Boston's only lead came on the game's initial basket before the Hornets went on a 15-2 run."}
{"game_id": "0021400510", "chunk_id": "0021400510_023", "order": 23, "role": "body", "text": "Hornets: They were minus two key players again. Jefferson missed his fourth straight game and G Lance Stephenson his 11th due to a pelvic strain. Coach Steve Clifford said the team has had to change its approach offensively without Jefferson's low-post play. \"We were so reliant, probably more than any other team, on how we posted the ball with Al,\" Clifford said. \"Now we're more of a dribble, handoff, pick-and-roll team.\""}
{"game_id": "0021400510", "chunk_id": "0021400510_024", "order": 24, "role": "body", "text": "Celtics: G Jameer Nelson was sidelined with a sprained right ankle. ... It was \"Seats for Soldiers Night.\" ... The team held a pregame moment of silence for former ESPN anchor Stuart Scott, who died Sunday after a long battle with cancer."}
{"game_id": "0021400510", "chunk_id": "0021400510_026", "order": 26, "role": "body", "text": "Before the game, Stevens talked about how well Walker has been playing. \"He's a competitive, feisty, tough dude,\" the coach said. \"He plays that way every single night and I really respect that.\""}
{"game_id": "0021400510", "chunk_id": "0021400510_028", "order": 28, "role": "body", "text": "Young, a rookie forward, had scored just 11 points the entire season in only five games. He missed 26 with a shoulder injury."}
{"game_id": "0021400510", "chunk_id": "0021400510_030", "order": 30, "role": "body", "text": "Boston F Jeff Green made his first two shots on drives to the basket. He then went 1 for 11 from the floor."}
{"game_id": "0021400510", "chunk_id": "0021400510_032", "order": 32, "role": "body", "text": "Hornets: Host New Orleans on Wednesday."}
{"game_id": "0021400510", "chunk_id": "0021400510_033", "order": 33, "role": "closing", "text": "Celtics: At Brooklyn on Wednesday."}
