{"game_id": "0021700246", "chunk_id": "0021700246_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Portland is clamping down on defense and the effort is leading to recent success for the Trail Blazers."}
{"game_id": "0021700246", "chunk_id": "0021700246_002", "order": 2, "role": "body", "text": "The team has held seven of the last eight opponents under 100 points, including Memphis on Monday night as the Trail Blazers pulled away from the Grizzlies for a 100-92 win."}
{"game_id": "0021700246", "chunk_id": "0021700246_003", "order": 3, "role": "body", "text": "C. J. McCollum scored 24 points and Damian Lillard added 21 points as Portland sent Memphis to its fifth straight loss."}
{"game_id": "0021700246", "chunk_id": "0021700246_004", "order": 4, "role": "body", "text": "\"Defensively we were able to get some stops down the stretch,\" McCollum said of Portland's ability to pull away after the game was tied at 80 with 6:41 remaining. \"Noah (Vonleh) had some big baskets. Big rebounds. Different guys stepped up. Everybody did a little bit of everything.\""}
{"game_id": "0021700246", "chunk_id": "0021700246_005", "order": 5, "role": "body", "text": "Shabazz Napier added 16 points, while Noah Vonleh finished with 11 points and 18 rebounds for Portland, which won its second straight and fourth in the last five."}
{"game_id": "0021700246", "chunk_id": "0021700246_006", "order": 6, "role": "body", "text": "\"The other team was just missing a lot of shots, and I was just having a nose for the ball,\" Vonleh said. \"Boxing my guy out and going after it, that was my mindset.\""}
{"game_id": "0021700246", "chunk_id": "0021700246_007", "order": 7, "role": "body", "text": "Vonleh's rebounds were part of the Trail Blazers controlling the boards, outrebounding Memphis 60-35."}
{"game_id": "0021700246", "chunk_id": "0021700246_008", "order": 8, "role": "body", "text": "\"Crushed us on the glass,\" Memphis coach David Fizdale said. \"We finally got our defense activated again, and I felt like we were back somewhat looking like our early season self. But the glass just really killed us.\""}
{"game_id": "0021700246", "chunk_id": "0021700246_009", "order": 9, "role": "body", "text": "Mario Chalmers led Memphis with a season-high 21 points, while Tyreke Evans finished with 20. Marc Gasol had 19 points, seven assists and 12 rebounds, but was 7 of 20 from the floor, part of the Grizzlies shooting 38 percent for the game, and 27 percent from outside the arc."}
{"game_id": "0021700246", "chunk_id": "0021700246_010", "order": 10, "role": "body", "text": "The teams were tied at 80 with 6:47 left after Gasol split a pair of free throws. But Jusuf Nurkic, who had 10 points, converted a 3-point play and put the Trail Blazers ahead for good."}
{"game_id": "0021700246", "chunk_id": "0021700246_011", "order": 11, "role": "body", "text": "\"It's always difficult, it seems, to play here,\" Portland coach Terry Stotts said. \"Seems like the games are always a grind it out, low possession, low field goal percentage game.\""}
{"game_id": "0021700246", "chunk_id": "0021700246_013", "order": 13, "role": "body", "text": "Trail Blazers: The game was the first of a five-game road trip for Portland. . Portland lost to Grizzlies 98-97 earlier this month. .Vonleh's 18 rebounds were one short of his career-high 19 on April 12 last season against New Orleans. It was Vonleh's first double-double of the season. ... Napier, who was shooting 58 percent in his last six games, was 5 of 13 from the field."}
{"game_id": "0021700246", "chunk_id": "0021700246_014", "order": 14, "role": "body", "text": "Grizzlies: C/F Brandan Wright, who injured his right groin in Saturday's game against Houston, sat out, along with G Mike Conley, who continues to nurse a sore left Achilles tendon. ... Memphis has allowed 100 points in nine of the last 10 games. .Evans recorded at least 20 points off the bench for the seventh time this season."}
{"game_id": "0021700246", "chunk_id": "0021700246_016", "order": 16, "role": "body", "text": "Lillard turned his ankle with just under 3 minutes left before halftime after stepping on Gasol's foot. The Portland guard went down under the Trail Blazers basket, but eventually hobbled to the bench. He returned to start the second half. \"I knew if there was some way he could play, he's going to play,\" Stotts said. \"What he does, doesn't surprise me.\" Lillard was noticeably limping in the Trail Blazers locker room. He said trainers \"did all kinds of different tape jobs on it,\" at halftime, \"then we went back out there and tried it. I was able to, at least, get something done.\""}
{"game_id": "0021700246", "chunk_id": "0021700246_018", "order": 18, "role": "body", "text": "Memphis' losing streak has reflected the signs of a struggling team, particularly without Conley. While the Grizzlies were in the game midway through the fourth quarter, they were consistently trying to catch up throughout the game because of poor shooting. \"I do think if we could have made some of our open shots, it would have at least helped momentum and it also helps energize your defense when you make a couple of those,\" Fizdale said. \"But, ultimately, we've just got to keep plugging away."}
{"game_id": "0021700246", "chunk_id": "0021700246_020", "order": 20, "role": "body", "text": "Trail Blazers: Travel to Philadelphia for a Wednesday game against the 76ers"}
{"game_id": "0021700246", "chunk_id": "0021700246_021", "order": 21, "role": "closing", "text": "Grizzlies: Wrap up a four-game home stand on Wednesday, hosting the Dallas Mavericks"}
