{"game_id": "0021701086", "chunk_id": "0021701086_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Down 10 at the start of the fourth quarter, Boston's Marcus Morris and Al Horford assessed the situation against the Trail Blazers."}
{"game_id": "0021701086", "chunk_id": "0021701086_002", "order": 2, "role": "body", "text": "\"We had a little conversation at the start of the fourth and said to each other, `If we come out strong and get this (lead) down we've got a great chance to come back and win this game,\" Morris said."}
{"game_id": "0021701086", "chunk_id": "0021701086_004", "order": 4, "role": "body", "text": "Morris scored 30 points and the short-handed Celtics rallied to beat the Trail Blazers 105-100 on Friday night to deal Portland its second straight loss following a 13-game winning streak."}
{"game_id": "0021701086", "chunk_id": "0021701086_005", "order": 5, "role": "body", "text": "Terry Rozier added 16 points for the Celtics, who are second in the Eastern Conference behind Toronto but have had to deal with recent injuries to Kyrie Irving and Jaylen Brown."}
{"game_id": "0021701086", "chunk_id": "0021701086_006", "order": 6, "role": "body", "text": "Damian Lillard and CJ McCollum each finished with 26 points for the Blazers, who are third in the West behind the Rockets and the Warriors."}
{"game_id": "0021701086", "chunk_id": "0021701086_007", "order": 7, "role": "body", "text": "The Blazers led by as many as 12 points in the third quarter, but Boston closed within three points at 83-80 on Shane Larkin's pull-up jumper. The Celtics didn't pull in front until Morris' 3-pointer made it 85-84 with 6:30 to go."}
{"game_id": "0021701086", "chunk_id": "0021701086_008", "order": 8, "role": "body", "text": "McCollum went on a personal 5-0 run with a layup, free throw and pull-up jumper to give a 91-87 lead back to the Blazers, but Horford answered with a 3-pointer to close the gap."}
{"game_id": "0021701086", "chunk_id": "0021701086_009", "order": 9, "role": "body", "text": "Rookie Jayson Tatum's layup and Morris' 3-pointer gave the Celtics a 101-96 lead with 54.8 seconds to go, and his dunk extended the lead to 103-98."}
{"game_id": "0021701086", "chunk_id": "0021701086_010", "order": 10, "role": "body", "text": "McCollum's jumper got Portland within three at 103-100 with 28 seconds left. After a scramble, Rozier made two free throws with 3.2 seconds left. Lillard's 3-point attempt for Portland at the buzzer was off."}
{"game_id": "0021701086", "chunk_id": "0021701086_011", "order": 11, "role": "body", "text": "Morris was just one off his season high with the Celtics, set earlier this month against Washington."}
{"game_id": "0021701086", "chunk_id": "0021701086_012", "order": 12, "role": "body", "text": "\"He's healthy, he's confident and he's just playing very assertive right now. He's playing really great right now, he's in a good rhythm and just hitting big shot after big shot. Happy to see him have another really big game,\" said Horford, who finished with 11."}
{"game_id": "0021701086", "chunk_id": "0021701086_013", "order": 13, "role": "body", "text": "Lillard said the Blazers \"just let one slip.\""}
{"game_id": "0021701086", "chunk_id": "0021701086_014", "order": 14, "role": "body", "text": "Portland was coming off a 115-111 loss to the first-place Rockets, which snapped the Blazers' long winning streak that helped push them up the standings."}
{"game_id": "0021701086", "chunk_id": "0021701086_015", "order": 15, "role": "body", "text": "\"I wouldn't say `letdown,\" Lillard said about the two losses. \"Any time you can have a streak of 13 games, that means you did a lot of good things, the team is focused. And you also need a little bit of luck. You need things to go your way. When that is up -- we lost a tough one to Houston -- you've got to be able to deal with the times when it doesn't go in your favor.\""}
{"game_id": "0021701086", "chunk_id": "0021701086_016", "order": 16, "role": "body", "text": "Irving missed his fifth game with a left knee injury. He is scheduled to have a minimally invasive procedure on the knee on Saturday. There is no timetable for his return. Irving, who celebrated his 26th birthday on Friday, was averaging 24.4 points, 5.1 assists and 3.8 rebounds."}
{"game_id": "0021701086", "chunk_id": "0021701086_017", "order": 17, "role": "body", "text": "He was one of several key sidelined players for Boston, which is at Portland on Friday. He joins Brown (concussion protocol), Marcus Smart (thumb surgery), Daniel Theis (knee surgery, out for season) and Gordon Hayward (ankle surgery rehab). Brown missed his sixth game."}
{"game_id": "0021701086", "chunk_id": "0021701086_018", "order": 18, "role": "body", "text": "Portland's Shabazz Napier was a late scratch because of a left big toe injury."}
{"game_id": "0021701086", "chunk_id": "0021701086_019", "order": 19, "role": "body", "text": "Lillard closed the first half with a layup for a 52-47 lead. McCollum dunked in the third quarter to give Portland a 64-53 lead, its largest to that point."}
{"game_id": "0021701086", "chunk_id": "0021701086_020", "order": 20, "role": "body", "text": "The Celtics were coming off a 100-99 win at home over Oklahoma City in which Morris made a 3-pointer with 1.2 seconds left for the victory."}
{"game_id": "0021701086", "chunk_id": "0021701086_021", "order": 21, "role": "body", "text": "Boston also won the only other meeting between the teams this season. Horford hit a fadeaway to edge the Blazers 97-96 early last month."}
{"game_id": "0021701086", "chunk_id": "0021701086_023", "order": 23, "role": "body", "text": "Celtics: Coach Brad Stevens said Brown had participated in practice and could play Sunday in Sacramento. ... Stevens said he has not been involved in discussions to bring in another player because of the injuries. \"I think that there is the possibility of applying for an exception again because of all the knee injuries and the length of injuries,\" Stevens said. \"I don't know where we are with that, and I haven't talked to them about any particulars.\""}
{"game_id": "0021701086", "chunk_id": "0021701086_024", "order": 24, "role": "body", "text": "Trail Blazers: Lillard was awaiting the birth of his first child. Lillard's girlfriend was due Monday. Complicating matters was Portland's three-game road trip starting Sunday at Oklahoma City. The team was expected to depart on Saturday. Coach Terry Stotts said the team would help Lillard in any way he needed."}
{"game_id": "0021701086", "chunk_id": "0021701086_025", "order": 25, "role": "body", "text": "ROOKIE MOVES: Jayson Tatum finished with 10 points in the fourth quarter and 13 for the game, along with six rebounds."}
{"game_id": "0021701086", "chunk_id": "0021701086_026", "order": 26, "role": "body", "text": "\"He's really good,\" Stevens said. \"Well, there's a lot of guys that are turning 30 that can't do what he can. He's got a natural talent. He's got an ability. That's why he was picked where he was picked in the draft.\""}
{"game_id": "0021701086", "chunk_id": "0021701086_027", "order": 27, "role": "body", "text": "Tatum, 20, was the third overall pick in the draft out of Duke."}
{"game_id": "0021701086", "chunk_id": "0021701086_029", "order": 29, "role": "body", "text": "Celtics: play at the Sacramento Kings on Sunday."}
{"game_id": "0021701086", "chunk_id": "0021701086_030", "order": 30, "role": "closing", "text": "Blazers: visit the Thunder on Sunday."}
