{"game_id": "0021700061", "chunk_id": "0021700061_001", "order": 1, "role": "lead", "text": "DALLAS --  Dennis Smith Jr. took a major step forward in his fourth career game."}
{"game_id": "0021700061", "chunk_id": "0021700061_002", "order": 2, "role": "body", "text": "The 19-year-old point guard had 19 points and five assists to lead the Dallas Mavericks to their first win of the season, 103-94 over the Memphis Grizzlies on Wednesday night."}
{"game_id": "0021700061", "chunk_id": "0021700061_003", "order": 3, "role": "body", "text": "\"I've been waiting for this,\" Smith said. \"I got tired of losing.\""}
{"game_id": "0021700061", "chunk_id": "0021700061_004", "order": 4, "role": "body", "text": "Smith was at his best in the second half, with 14 points and four assists, as Dallas snapped a four-game losing streak."}
{"game_id": "0021700061", "chunk_id": "0021700061_005", "order": 5, "role": "body", "text": "\"Well, Smith's pretty clearly a gamer. He is unafraid,\" Mavericks coach Rick Carlisle said. \"Tonight was the biggest amount of responsibility that we have put on him.\""}
{"game_id": "0021700061", "chunk_id": "0021700061_006", "order": 6, "role": "body", "text": "Grizzlies guard Mike Conley, who went head-to-head with Smith, was also impressed by the rookie."}
{"game_id": "0021700061", "chunk_id": "0021700061_007", "order": 7, "role": "body", "text": "\"I love his game. I watched a lot of film on him. He plays with a great pace, very patient,\" Conley said. \"He's going to be something special in the league and they've got a good one. It's fun to compete against him.\""}
{"game_id": "0021700061", "chunk_id": "0021700061_008", "order": 8, "role": "body", "text": "Memphis had a season-opening three-game win streak come to an end in the opener of a home-and-home back-to-back between the teams."}
{"game_id": "0021700061", "chunk_id": "0021700061_009", "order": 9, "role": "body", "text": "Marc Gasol had 26 points for Memphis. Conley scored 21 points and Tyreke Evans had 13 off the bench for the Grizzlies."}
{"game_id": "0021700061", "chunk_id": "0021700061_010", "order": 10, "role": "body", "text": "Wesley Matthews added 16, Harrison Barnes had 15, J.J. Barea scored 14, and Dirk Nowitzki scored 13 points for Dallas."}
{"game_id": "0021700061", "chunk_id": "0021700061_011", "order": 11, "role": "body", "text": "\"I think the ball is moving better,\" Barea said. \"Everybody is touching it. We are more active on offense.\""}
{"game_id": "0021700061", "chunk_id": "0021700061_012", "order": 12, "role": "body", "text": "The Mavericks went ahead 8-7 with 8:30 remaining in the first quarter on a hook shot by Nerlens Noel and never surrendered the lead. Memphis pulled within three in the fourth quarter before Dallas went on a 9-0 run to regain control."}
{"game_id": "0021700061", "chunk_id": "0021700061_013", "order": 13, "role": "body", "text": "\"We couldn't get stops, it's simple,\" Gasol said. \"When you don't have enough stops, you won't be able to get over the hump. ... We didn't play enough good D and we were not disciplined enough in order for us to win.\""}
{"game_id": "0021700061", "chunk_id": "0021700061_014", "order": 14, "role": "body", "text": "Dallas led by as much as 19 in the first half, but Gasol helped drag his team back into the game in the third quarter. Gasol scored 12 points on 4-for-6 shooting in in the period, cutting the score to 79-72 before the fourth quarter."}
{"game_id": "0021700061", "chunk_id": "0021700061_015", "order": 15, "role": "body", "text": "Both teams struggled at the free-throw line. The normally reliable Grizzlies made 16 of 24 free throws, and Dallas went 20-for-29."}
{"game_id": "0021700061", "chunk_id": "0021700061_016", "order": 16, "role": "body", "text": "Devin Harris played his first game since the death of his brother on Oct. 19 and had six points. Before the game, Carlisle said Harris wouldn't travel to Memphis with the team on Thursday."}
{"game_id": "0021700061", "chunk_id": "0021700061_018", "order": 18, "role": "body", "text": "Grizzlies: F Chandler Parsons didn't play since he isn't yet medically cleared to play in back-to-back games. Parsons, a former Maverick, is expected to play Thursday. ... Memphis will play 16 back-to-backs this season."}
{"game_id": "0021700061", "chunk_id": "0021700061_019", "order": 19, "role": "body", "text": "Mavericks: Barea played in his 700th career game. ... Dallas' 32 points in the first quarter where a season-high. ... Nowitzki played in his 1,399th career game. He can become the seventh player in NBA history to reach 1,400 on Thursday."}
{"game_id": "0021700061", "chunk_id": "0021700061_021", "order": 21, "role": "body", "text": "Gasol went 3-for-8 from the line. He entered the game having converted on 26 of 27 free-throw attempts, including a 10-for-10 night."}
{"game_id": "0021700061", "chunk_id": "0021700061_023", "order": 23, "role": "body", "text": "The Mavericks have struggled with rebounding this season and had been outrebounded 211-160 in their first four games. The Grizzlies had a 36-35 edge in total rebounds, but Carlisle felt his team won the overall battle because Memphis collected a few rebounds late once the game had been decided."}
{"game_id": "0021700061", "chunk_id": "0021700061_025", "order": 25, "role": "body", "text": "Grizzlies: Have a chance to bounce back against the Mavericks on Thursday night."}
{"game_id": "0021700061", "chunk_id": "0021700061_026", "order": 26, "role": "body", "text": "Mavericks: Will try to win their third straight game in the all-time series against Memphis."}
{"game_id": "0021700061", "chunk_id": "0021700061_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
