{"game_id": "0021701000", "chunk_id": "0021701000_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  If this game was a Hollywood audition, the young Los Angeles Lakers certainly did well enough to impress budding entertainment mogul LeBron James."}
{"game_id": "0021701000", "chunk_id": "0021701000_002", "order": 2, "role": "body", "text": "The Lakers will have to wait until summer to find out whether they earned a callback -- or maybe even got the part."}
{"game_id": "0021701000", "chunk_id": "0021701000_003", "order": 3, "role": "body", "text": "Julius Randle had a career-high 36 points, 14 rebounds and seven assists, and the Lakers put on a show in front of James with a 127-113 victory over the Cleveland Cavaliers on Sunday night."}
{"game_id": "0021701000", "chunk_id": "0021701000_004", "order": 4, "role": "body", "text": "Isaiah Thomas had 20 points, nine assists and five rebounds against his former teammates as the Lakers roared away from the defending Eastern Conference champions in the second half with their exciting, energetic style under coach Luke Walton."}
{"game_id": "0021701000", "chunk_id": "0021701000_005", "order": 5, "role": "body", "text": "The Lakers looked hungry, exciting and full of potential. They hope that's attractive to James, who can be a free agent this summer."}
{"game_id": "0021701000", "chunk_id": "0021701000_006", "order": 6, "role": "body", "text": "\"Since Luke took over, they've improved every single season, I think,\" said James, who had 24 points, 10 rebounds and seven assists. \"They just try to implement that ball movement, that body movement that he got when he was in Golden State.\""}
{"game_id": "0021701000", "chunk_id": "0021701000_007", "order": 7, "role": "body", "text": "Although nobody on either side is able to talk about it yet, this game seemed to carry added importance for both the Lakers and James, who will be at a crossroads shortly in his incredible career."}
{"game_id": "0021701000", "chunk_id": "0021701000_008", "order": 8, "role": "body", "text": "Magic Johnson has spent the past year making moves -- including the trade that sent Larry Nance Jr. and Jordan Clarkson to Cleveland last month -- to get the Lakers into prime salary-cap position to chase elite free agents this summer. The top name on that list is likely to be James, who has a player option for next year."}
{"game_id": "0021701000", "chunk_id": "0021701000_009", "order": 9, "role": "body", "text": "The three-time NBA champion already has a $23 million mansion in Brentwood and a burgeoning career in entertainment production, so a move to LA could be a logical step. But James is unlikely to join a team that can't immediately contend for championships with his addition."}
{"game_id": "0021701000", "chunk_id": "0021701000_010", "order": 10, "role": "body", "text": "The Lakers' entire season has been designed to prove their young core of Lonzo Ball, Brandon Ingram, Kyle Kuzma and probably Randle could fit splendidly around James, Paul George or DeMarcus Cousins -- or failing that, the top free agents in the class of 2019."}
{"game_id": "0021701000", "chunk_id": "0021701000_011", "order": 11, "role": "body", "text": "The Lakers' exciting performance against Cleveland underlined that notion, for whatever it's worth in James' mind."}
{"game_id": "0021701000", "chunk_id": "0021701000_012", "order": 12, "role": "body", "text": "\"We're just connecting at both ends, and we're able to really establish the way that we want to play,\" Randle said. \"It's been great.\""}
{"game_id": "0021701000", "chunk_id": "0021701000_013", "order": 13, "role": "body", "text": "And Los Angeles didn't even show off the full scope of its young talent: Ball struggled with his shot on the way to seven assists and five points, while top scorer Ingram missed his fifth straight game with a groin strain and rookie Josh Hart remained out with a broken hand."}
{"game_id": "0021701000", "chunk_id": "0021701000_014", "order": 14, "role": "body", "text": "But James got an up-close look at Randle, who drew a one-on-one defensive matchup with James while the Lakers made their second-half surge. The Lakers would have to do some serious maneuvering to re-sign Randle while adding two max free agents, but it's possible."}
{"game_id": "0021701000", "chunk_id": "0021701000_015", "order": 15, "role": "body", "text": "\"I had the challenge of guarding the best player in the game, so you know I loved to take that challenge and take it personally,\" Randle said. \"But he's an amazing player. There's not much you can do.\""}
{"game_id": "0021701000", "chunk_id": "0021701000_016", "order": 16, "role": "body", "text": "Nance had 16 points and eight rebounds, and Clarkson added four points in their first game against the Lakers since they were traded for Thomas and Channing Frye on Feb. 8."}
{"game_id": "0021701000", "chunk_id": "0021701000_017", "order": 17, "role": "body", "text": "With its sixth win in eight games overall, Los Angeles (30-36) emphatically snapped a seven-game losing streak against Cleveland. Brook Lopez scored 22 points for the Lakers, and Kentavious Caldwell-Pope added 20."}
{"game_id": "0021701000", "chunk_id": "0021701000_018", "order": 18, "role": "body", "text": "The Cavs have lost four of six after getting swept at Staples Center by the Clippers and Lakers."}
{"game_id": "0021701000", "chunk_id": "0021701000_020", "order": 20, "role": "body", "text": "Cavaliers: Kyle Korver scored 12 points while playing with a bruised right foot. ... Cleveland dressed only 11 players with several long-term injuries. UCLA product Kevin Love remains sidelined with a broken hand."}
{"game_id": "0021701000", "chunk_id": "0021701000_021", "order": 21, "role": "body", "text": "Lakers: Ingram was re-evaluated Sunday. He is progressing well, but the Lakers expect him to miss at least two more games. ... Fans near courtside included Chargers coach Anthony Lynn, Chargers Pro Bowl receiver Keenan Allen, Rams All-Pro running back Todd Gurley, comedians Jerrod Carmichael and Marlon Wayans and former Lakers forward Lamar Odom."}
{"game_id": "0021701000", "chunk_id": "0021701000_022", "order": 22, "role": "body", "text": "OH HELLO: With the Lakers up 16 points in the fourth quarter, Magic spent a timeout greeting James' agent, Rich Paul, and his longtime manager, Maverick Carter, at their courtside seats."}
{"game_id": "0021701000", "chunk_id": "0021701000_023", "order": 23, "role": "body", "text": "JULIUS EARNING: The Cavs were no match for Randle as the bruising forward scored 23 points in the second half."}
{"game_id": "0021701000", "chunk_id": "0021701000_024", "order": 24, "role": "body", "text": "\"I thought he just out-toughed us,\" Cavs coach Tyronn Lue said. \"He bullied us the whole night, and we had no answer for him.\""}
{"game_id": "0021701000", "chunk_id": "0021701000_025", "order": 25, "role": "body", "text": "Randle went 14 for 18 from the field overall."}
{"game_id": "0021701000", "chunk_id": "0021701000_026", "order": 26, "role": "body", "text": "\"It was something I always knew I could do,\" Randle said. \"I'm not surprised, but it feels good.\""}
{"game_id": "0021701000", "chunk_id": "0021701000_027", "order": 27, "role": "body", "text": "I.T. PROFESSIONAL: Thomas also shone in his first game against the Cavs since they ended their brief attempt to replace Kyrie Irving with the undersized scoring machine."}
{"game_id": "0021701000", "chunk_id": "0021701000_028", "order": 28, "role": "body", "text": "Thomas' parting with Cleveland wasn't harmonious, and the 5-foot-9 dynamo took a few portentous looks in the direction of the Cavs' bench -- but he claimed he was only talking smack to Floyd Mayweather, his good friend sitting next to Jack Nicholson."}
{"game_id": "0021701000", "chunk_id": "0021701000_029", "order": 29, "role": "body", "text": "\"I don't need to show anybody anything,\" Thomas said. \"They know what I can do. I only played 15 games with them, so it's really not about showing them what I can do. The world knows what I can do.\""}
{"game_id": "0021701000", "chunk_id": "0021701000_031", "order": 31, "role": "body", "text": "Cavaliers: At the Phoenix Suns on Tuesday night."}
{"game_id": "0021701000", "chunk_id": "0021701000_032", "order": 32, "role": "body", "text": "Lakers: Host the Denver Nuggets on Tuesday night."}
{"game_id": "0021701000", "chunk_id": "0021701000_034", "order": 34, "role": "closing", "text": "More AP basketball: www.apnews.com/tags/NBAbasketball"}
