{"game_id": "0021700014", "chunk_id": "0021700014_001", "order": 1, "role": "lead", "text": "TORONTO -- Newcomer C.J. Miles got Toronto's bid to become a better 3-point shooting team off to a successful start.\nJonas Valanciunas had 23 points and 15 rebounds, Miles scored 22 points in his Toronto debut and the Raptors beat the short-handed Chicago Bulls 117-101 on Thursday night in the season opener for both teams.\nNorman Powell added 15 points, Delon Wright had 13, and Kyle Lowry 12.\nMiles went 6 for 9 from 3-point range and had five rebounds. Half of the former Indiana Pacers player's points came in the second quarter during a 22-2 run by Toronto's second unit.\n\"I want to be able to be that spark,\" Miles said, \"come in and communicate, bring energy.\"\nDeMar DeRozan found a lot to like in his first game with Miles as a teammate.\n\"It's great to have him on our team doing it with us instead of against us,\" DeRozan said.\nThe Raptors, who intend to boost their 3-point shooting and move the ball more this season, were 13 of 29 from long range and had 26 assists on 39 baskets. Lowry had nine assists, and DeRozan and Wright each had five.\n\"I loved the way the ball moved,\" coach Dwane Casey. \"We've got to play that way.\"\nPlaymaking proved an effective avenue for DeRozan on a night when he made just two of nine field goals and did not attempt a 3-pointer. DeRozan finished with 11 points, going 7 for 8 at the free throw line, and had six rebounds.\nChicago center Robin Lopez scored 18 points, rookie Lauri Markkanen had 17 points and eight rebounds in his NBA debut, and Justin Holiday scored 15.\n\"I thought Lauri was really good,\" Bulls coach Fred Hoiberg said. \"For his first performance, coming out here on the road in a hostile environment, to go out and put up 17 and eight in his first NBA game is pretty impressive.\"\nHoiberg said forward Nikola Mirotic is doing OK but is still sore two days after suffering facial fractures and a concussion in a practice fight with teammate Bobby Portis. Chicago suspended Portis for eight games following the altercation. Mirotic is expected to be out from four to six weeks.\nWith the Raptors up 25-23 after one quarter, Miles went 3 for 3 from 3-point range in Toronto's decisive second-quarter spurt.\n\"That was the key stretch of the game,\" Hoiberg said. \"They got in the paint, spread out, his shots.\"\nTIP INS\nBulls: G Zach LaVine (left knee) and G Kris Dunn (left index finger) both travelled to Toronto. Hoiberg said they are working out and participating in walk-throughs. ... Chicago also was without G Cameron Payne (right foot).\nRaptors: Powell started for Toronto with Miles coming off the bench. ... Coach Dwane Casey was about 30 minutes late for his pregame media session after getting caught in rush-hour traffic. ... Blue Jays right-hander Marcus Stroman sat in the front row opposite the Raptors bench.\nEMOTIONAL RETURN\nBulls G Quincy Pondexter played for the first time since April 2015. Pondexter missed the past two seasons following a series of left knee surgeries and a potentially life-threatening skin infection.\n\"I'm really, really happy for Quincy,\" Hoiberg said before the game. \"It's such a great story from where he was to get this opportunity to get back on the floor.'\nOG IMPRESSES\nRaptors rookie F OG Anunoby dunked over Pondexter for the first points of his career and finished with nine points in a strong debut. \"It was great,\" Miles said about Anunoby's first game. \"Way better than mine. I told him that on the floor.\"\nUP NEXT\nBulls: Chicago opens its home schedule against San Antonio on Saturday night. The Bulls have won six of their past 10 home games against the Spurs.\nRaptors: Toronto hosts Philadelphia on Saturday night. The Raptors have won nine straight home games against the 76ers.\n---\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball"}
