{"game_id": "0021400009", "chunk_id": "0021400009_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  The Grizzlies are 1-0 for the first time in a long, long time. In fact, all the way back to the team's days in Vancouver."}
{"game_id": "0021400009", "chunk_id": "0021400009_002", "order": 2, "role": "body", "text": "Marc Gasol scored a career-high 32 points, and the Grizzlies beat the Minnesota Timberwolves 105-101 on Wednesday night for the franchise's first victory in a season opener since 2000, the year before the team moved to Memphis."}
{"game_id": "0021400009", "chunk_id": "0021400009_003", "order": 3, "role": "body", "text": "\"We didn't talk about it as in like `We need this,' but moreso like `Man, can you believe we haven't won since they've been here?\" said point guard Mike Conley, who scored 16 points. \"It's an unbelievable thought.\""}
{"game_id": "0021400009", "chunk_id": "0021400009_004", "order": 4, "role": "body", "text": "Zach Randolph added 25 points and 13 rebounds for Memphis, which had dropped its last 13 openers. Gasol also had nine rebounds, and Courtney Lee finished with 14 points."}
{"game_id": "0021400009", "chunk_id": "0021400009_005", "order": 5, "role": "body", "text": "\"That was a good game to start the season,\" Memphis coach Dave Joerger said. \"We made some mistakes, but we fought and we fought and we fought.\""}
{"game_id": "0021400009", "chunk_id": "0021400009_006", "order": 6, "role": "body", "text": "Gasol and Randolph helped Memphis outscore Minnesota 58-34 in the paint, but the Timberwolves outrebounded the Grizzlies 47-33 in their first game since they traded star forward Kevin Love to Cleveland in the offseason. Minnesota's total included 19 offensive boards."}
{"game_id": "0021400009", "chunk_id": "0021400009_007", "order": 7, "role": "body", "text": "Thaddeus Young had 26 points in his first game with the Timberwolves, going 10 for 18 from the field. Mo Williams scored 18 points and Shabazz Muhammad finished with 13."}
{"game_id": "0021400009", "chunk_id": "0021400009_008", "order": 8, "role": "body", "text": "Ricky Rubio had 12 points and seven assists, but also committed seven of Minnesota's 23 turnovers."}
{"game_id": "0021400009", "chunk_id": "0021400009_009", "order": 9, "role": "body", "text": "\"We have to take care of the ball, especially me,\" Rubio said. \"I got maybe too crazy at the end of the third quarter.\""}
{"game_id": "0021400009", "chunk_id": "0021400009_010", "order": 10, "role": "body", "text": "The Timberwolves used a 9-0 run to take an 87-85 lead in the fourth quarter. Anthony Bennett scored five points and Muhammad had four in the spurt."}
{"game_id": "0021400009", "chunk_id": "0021400009_011", "order": 11, "role": "body", "text": "The game was close for the next couple minutes before Memphis created some space. Gasol made a 21-footer for a 101-96 lead with 1:23 left."}
{"game_id": "0021400009", "chunk_id": "0021400009_012", "order": 12, "role": "body", "text": "In the midst of that key stretch late in the game, there was an out of bounds call in front of the Minnesota bench with 2:20 left that went Memphis' way -- a decision with which the Timberwolves heartily disagreed."}
{"game_id": "0021400009", "chunk_id": "0021400009_013", "order": 13, "role": "body", "text": "\"I thought for sure that was off of (Randolph),\" Minnesota coach Flip Saunders said. \"That was kind of a momentum change because we had the game momentum.\""}
{"game_id": "0021400009", "chunk_id": "0021400009_014", "order": 14, "role": "body", "text": "The Timberwolves still were within one possession when Vince Carter, signed by Memphis in the offseason, converted two free throws for a 105-101 lead with 7.3 seconds to go."}
{"game_id": "0021400009", "chunk_id": "0021400009_015", "order": 15, "role": "body", "text": "\"If I can't make the shots, I might as well make the free throws that count,\" said Carter, who missed six of his seven shot from the field."}
{"game_id": "0021400009", "chunk_id": "0021400009_017", "order": 17, "role": "body", "text": "Grizzlies: Memphis extended its regular-season home winning streak to 15. ... Rapper Yo Gotti led the Grizzlies starters in for the introductions. ... Gasol's previous career high was 30 points against the Sixers in 2009."}
{"game_id": "0021400009", "chunk_id": "0021400009_018", "order": 18, "role": "body", "text": "Timberwolves: Andrew Wiggins, the No. 1 overall selection in this year's draft, got the start in his NBA debut after Kevin Martin was sidelined by an ankle injury. Wiggins scored six points in just under 19 minutes. \"I was nervous, but not crazy nervous,\" Wiggins said. \"I calmed down after the tip.\" ... With Wiggins and 2013 top pick Bennett, the Timberwolves became the first team in almost 30 years to open the season with the top picks from the previous two drafts. The last time was the 1984-85 season when the Houston Rockets had Hakeem Olajuwon and Ralph Sampson. ... The game marked the first time in 14 seasons Minnesota opened the season away from the Target Center."}
{"game_id": "0021400009", "chunk_id": "0021400009_020", "order": 20, "role": "body", "text": "Grizzlies controlling owner Robert Pera, who has made few appearances at games since buying the team two years ago, was on hand for the opener."}
{"game_id": "0021400009", "chunk_id": "0021400009_022", "order": 22, "role": "body", "text": "Timberwolves reserve center Gorgui Dieng injured his right thumb in the second quarter. X-rays were negative, and he returned in the second half with the thumb taped. ... In addition to Martin sitting, Ronny Turiaf missed the game with right hip soreness."}
{"game_id": "0021400009", "chunk_id": "0021400009_024", "order": 24, "role": "body", "text": "Grizzlies: At Indiana on Friday."}
{"game_id": "0021400009", "chunk_id": "0021400009_025", "order": 25, "role": "closing", "text": "Timberwolves: Home opener Thursday against Detroit Pistons."}
