{"game_id": "0021401101", "chunk_id": "0021401101_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Avery Bradley says despite a season of ups and downs, he never stopped believing the Boston Celtics were a playoff team."}
{"game_id": "0021401101", "chunk_id": "0021401101_002", "order": 2, "role": "body", "text": "If the Celtics continue to play the way they have in recent weeks, Bradley might be right."}
{"game_id": "0021401101", "chunk_id": "0021401101_003", "order": 3, "role": "body", "text": "Bradley had 30 points and eight rebounds, and the Celtics beat the Charlotte Hornets 116-104 on Monday night for an important Eastern Conference victory."}
{"game_id": "0021401101", "chunk_id": "0021401101_004", "order": 4, "role": "body", "text": "Boston (33-41) moved back into eighth place in the East, a few percentage points ahead of Brooklyn in the battle for the final playoff spot."}
{"game_id": "0021401101", "chunk_id": "0021401101_005", "order": 5, "role": "body", "text": "Evan Turner added 15 points, while Jae Crowder and Marcus Smart each had 14 as the Celtics won for the 10th time in the last 16 games."}
{"game_id": "0021401101", "chunk_id": "0021401101_006", "order": 6, "role": "body", "text": "But it was Bradley who carried his team on his shoulders, making 12 of 23 shots."}
{"game_id": "0021401101", "chunk_id": "0021401101_007", "order": 7, "role": "body", "text": "\"Avery was terrific on both ends of the floor,\" said Celtics coach Brad Stevens."}
{"game_id": "0021401101", "chunk_id": "0021401101_008", "order": 8, "role": "body", "text": "Charlotte's Kemba Walker led a furious fourth-quarter comeback that fell short, finishing with 28 points and 12 assists. Gerald Henderson added 17 points for the Hornets, who've dropped four of their last five games."}
{"game_id": "0021401101", "chunk_id": "0021401101_009", "order": 9, "role": "body", "text": "The Celtics built a 19-point, fourth-quarter lead that Hornets cut to six behind Walker. But the Celtics closed out the game with some clutch free throws to even the series with the Hornets at 2-2."}
{"game_id": "0021401101", "chunk_id": "0021401101_010", "order": 10, "role": "body", "text": "\"We knew we needed this game,\" Turner said. \"Every game is important, so we came and toughed it out.\""}
{"game_id": "0021401101", "chunk_id": "0021401101_011", "order": 11, "role": "body", "text": "Charlotte's loss clinched a second straight playoff berth for the Washington Wizards."}
{"game_id": "0021401101", "chunk_id": "0021401101_012", "order": 12, "role": "body", "text": "The Celtics led 56-44 at the half and pushed the lead to 22 behind Bradley's 15 third-quarter points."}
{"game_id": "0021401101", "chunk_id": "0021401101_013", "order": 13, "role": "body", "text": "The frustration of a disappointing season seemed to set in for the Hornets late in the third when Walker drove on a fast break and his layup was rejected. Upset there wasn't a foul called, Walker stopped in his tracks and didn't hustle back on defense. The Celtics made him pay on the other end as Bradley knocked down a 3-pointer to give Boston an 18-point lead."}
{"game_id": "0021401101", "chunk_id": "0021401101_014", "order": 14, "role": "body", "text": "And early in the fourth quarter, Henderson was called for a flagrant foul when he shoved Gerald Wallace in the back."}
{"game_id": "0021401101", "chunk_id": "0021401101_015", "order": 15, "role": "body", "text": "\"We just couldn't guard them,\" Hornets coach Steve Clifford said. \"Frankly, we just take too many plays off. ... You have to play the game like we played the fourth quarter. You have to be locked in.\""}
{"game_id": "0021401101", "chunk_id": "0021401101_016", "order": 16, "role": "body", "text": "Down 19 in the fourth quarter, Charlotte mounted one last challenge when Walker ignited the crowd with a long-distance 3 from the left wing to cut Boston's lead to nine with 3:03 left in the game."}
{"game_id": "0021401101", "chunk_id": "0021401101_017", "order": 17, "role": "body", "text": "Walker hit another 3-pointer and then grabbed his own rebound off a missed 3 and scored to cut the lead to 108-102 with 52 seconds remaining."}
{"game_id": "0021401101", "chunk_id": "0021401101_018", "order": 18, "role": "body", "text": "After two free throws by Brandon Bass, Walker scored on a driving layup and the Hornets forced a turnover on the ensuing inbounds pass with 34 seconds left."}
{"game_id": "0021401101", "chunk_id": "0021401101_019", "order": 19, "role": "body", "text": "But Walker missed a 3 from the right wing with a chance to make it a one-possession game, and the Celtics put it away with free throws."}
{"game_id": "0021401101", "chunk_id": "0021401101_020", "order": 20, "role": "body", "text": "\"I'm pretty disappointed, especially because we had to play catch-up throughout the whole game,\" Walker said. \"It was a huge game for us. It's definitely a little disappointing.\""}
{"game_id": "0021401101", "chunk_id": "0021401101_023", "order": 23, "role": "body", "text": "Celtics: Bradley has reached double figures in scoring in 12 of his last 13 games."}
{"game_id": "0021401101", "chunk_id": "0021401101_024", "order": 24, "role": "body", "text": "Hornets: Henderson has scored in double digits in 17 of his last 19 games. He was averaging nearly 15 points per game during that stretch."}
{"game_id": "0021401101", "chunk_id": "0021401101_026", "order": 26, "role": "body", "text": "The Hornets signed Lance Stephenson to a three-year, $27 million contract in the offseason in part because of his playoff experience. But in the most important game of the season to date, Stephenson didn't even play."}
{"game_id": "0021401101", "chunk_id": "0021401101_027", "order": 27, "role": "body", "text": "\"It's not in my hands. It's in Coach's hands,\" Stephenson said."}
{"game_id": "0021401101", "chunk_id": "0021401101_028", "order": 28, "role": "body", "text": "When asked if he was upset by the decision, Stephenson said, \"I mean, of course. I feel like I could help our team. I feel I could have helped tonight.\""}
{"game_id": "0021401101", "chunk_id": "0021401101_029", "order": 29, "role": "body", "text": "Said Clifford: \"I explained to him that I'm not saying it's his fault at all but we have struggled to find a group that has played well off the bench in these last few games.\""}
{"game_id": "0021401101", "chunk_id": "0021401101_031", "order": 31, "role": "body", "text": "Celtics: Host Indiana on Wednesday night."}
{"game_id": "0021401101", "chunk_id": "0021401101_032", "order": 32, "role": "closing", "text": "Hornets: Host Detroit on Wednesday night."}
