{"game_id": "0021700738", "chunk_id": "0021700738_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  The Indiana Pacers finally found a solution to their struggles Monday night."}
{"game_id": "0021700738", "chunk_id": "0021700738_002", "order": 2, "role": "body", "text": "Turn up the defensive intensity and share the ball."}
{"game_id": "0021700738", "chunk_id": "0021700738_003", "order": 3, "role": "body", "text": "The combination worked perfectly. Victor Oladipo scored 25 points, Myles Turner added 22 and the Pacers had just enough energy to make two late charges in a 105-96 victory over the Charlotte Hornets."}
{"game_id": "0021700738", "chunk_id": "0021700738_004", "order": 4, "role": "body", "text": "\"Everybody contributed,\" Oladipo said. \"It's a collective team thing. We had to do a great job of playing team defense, making them work -- I think we did a great job of that tonight.\""}
{"game_id": "0021700738", "chunk_id": "0021700738_005", "order": 5, "role": "body", "text": "Whether it was fatigue from playing their fourth game in six nights or the Hornets' slower, half-court style, the Pacers didn't look like themselves most of the night."}
{"game_id": "0021700738", "chunk_id": "0021700738_006", "order": 6, "role": "body", "text": "For more than three quarters, their preferred up-tempo style slowed down and their energy level seemed to be low."}
{"game_id": "0021700738", "chunk_id": "0021700738_007", "order": 7, "role": "body", "text": "All that changed in the fourth quarter when everyone started playing their part."}
{"game_id": "0021700738", "chunk_id": "0021700738_008", "order": 8, "role": "body", "text": "Six players scored in double figures, including Thaddeus Young with 16 points and Darren Collison with 13. Domantas Sabonis had his 12th double-double this season with 11 points and 10 rebounds. Collison had six assists, backup point guard Cory Joseph added five and, of course, Lance Stephenson provided a late burst of energy as he wound up with 10 points."}
{"game_id": "0021700738", "chunk_id": "0021700738_009", "order": 9, "role": "body", "text": "The result: Indiana won its second straight and fourth in five games."}
{"game_id": "0021700738", "chunk_id": "0021700738_010", "order": 10, "role": "body", "text": "\"We finally found our groove in the fourth and wore them down,\" Young said. \"Defensively, we got into them more, pushed up on the ball, got a few steals, forced them into some bad shots and just played with a lot of energy and passion.\""}
{"game_id": "0021700738", "chunk_id": "0021700738_012", "order": 12, "role": "body", "text": "Charlotte scored only 14 points over the final 10 minutes and 18 in the fourth quarter, losing its second in a row."}
{"game_id": "0021700738", "chunk_id": "0021700738_013", "order": 13, "role": "body", "text": "Kemba Walker led the Hornets with 23 points, making a trio of 3-pointers. Dwight Howard had 22 points and 11 rebounds but took only three shots in the second half. Nicolas Batum made five 3s and scored 22 points."}
{"game_id": "0021700738", "chunk_id": "0021700738_014", "order": 14, "role": "body", "text": "After Oladipo made a 19-footer with 9:50 to go, the Pacers didn't look back. Sabonis scored Indiana's next five points and when the 13-4 spurt ended with Sabonis' 20-footer, the Pacers led 94-86 with six minutes remaining."}
{"game_id": "0021700738", "chunk_id": "0021700738_015", "order": 15, "role": "body", "text": "Then Turner's 3 spurred a 7-0 run, giving the Pacers a 103-89 advantage with 2:46 left. Charlotte never recovered."}
{"game_id": "0021700738", "chunk_id": "0021700738_016", "order": 16, "role": "body", "text": "\"Their defense was really good and we didn't respond well,\" Hornets coach Steve Clifford said."}
{"game_id": "0021700738", "chunk_id": "0021700738_018", "order": 18, "role": "body", "text": "Hornets: Howard dominated the first half, scoring 18 points on 8-of-11 shooting and grabbing seven rebounds. He wound up with the 697th double-double of his career. ... The Hornets were outscored 40-21 off the bench and were just 9 of 31 on 3s. They also had 16 turnovers. ... Charlotte has lost three straight and 14 of its last 16 in Indianapolis."}
{"game_id": "0021700738", "chunk_id": "0021700738_019", "order": 19, "role": "body", "text": "Pacers: Young has scored in double figures in 12 consecutive games. ... Indiana shot 54.2 percent from the field and improved to 18-0 when shooting 50 percent or better this season. ... The Pacers had a 54-42 scoring advantage in the paint. Neither team led by more than six through the first three quarters."}
{"game_id": "0021700738", "chunk_id": "0021700738_021", "order": 21, "role": "body", "text": "Turner looked more comfortable Monday with a brace on his injured right elbow."}
{"game_id": "0021700738", "chunk_id": "0021700738_022", "order": 22, "role": "body", "text": "The numbers reflected it, too. He was 8 of 11 from the field, 4 of 6 on 3s, and had four rebounds and one block in his second game back. He missed the previous eight."}
{"game_id": "0021700738", "chunk_id": "0021700738_023", "order": 23, "role": "body", "text": "\"I just played,\" he said, noting he didn't get much of a chance Saturday because of foul trouble."}
{"game_id": "0021700738", "chunk_id": "0021700738_024", "order": 24, "role": "body", "text": "Batum also acknowledged he's rounding into form, too, after missing the first 12 games with a torn ligament in his left elbow."}
{"game_id": "0021700738", "chunk_id": "0021700738_025", "order": 25, "role": "body", "text": "\"Injuries have been tough for me, so it feels good to be getting my shooting back,\" Batum said after going 8 of 17."}
{"game_id": "0021700738", "chunk_id": "0021700738_027", "order": 27, "role": "body", "text": "Hornets: \"Individual stats don't matter,\" Howard said. \"Winning is all that matters.\""}
{"game_id": "0021700738", "chunk_id": "0021700738_028", "order": 28, "role": "body", "text": "Pacers: \"I love playing with Domantas,\" Turner said. \"I almost feel bad because he does all the dirty work and it kind of just leaves the easy stuff for me.\""}
{"game_id": "0021700738", "chunk_id": "0021700738_030", "order": 30, "role": "body", "text": "Hornets: At the Atlanta Hawks on Wednesday night, hoping to win their third straight in the series."}
{"game_id": "0021700738", "chunk_id": "0021700738_031", "order": 31, "role": "body", "text": "Pacers: Can sweep Memphis for the first time since 2012-13 with a win at home Wednesday night."}
{"game_id": "0021700738", "chunk_id": "0021700738_033", "order": 33, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball ."}
