{"game_id": "0021700739", "chunk_id": "0021700739_001", "order": 1, "role": "lead", "text": "ATLANTA --  Kent Bazemore's favorite play, a chase-down blocked shot, was even sweeter when the defensive gem followed his biggest shot of the game."}
{"game_id": "0021700739", "chunk_id": "0021700739_002", "order": 2, "role": "body", "text": "Bazemore scored 22 points, including a tiebreaking 3-pointer with 2:09 remaining, and the Atlanta Hawks rallied after trailing by 11 in the third quarter to beat the Minnesota Timberwolves 105-100 on Monday night."}
{"game_id": "0021700739", "chunk_id": "0021700739_003", "order": 3, "role": "body", "text": "The clutch 3 by Bazemore gave the Hawks a 99-96 lead they did not relinquish. The margin was only one when Bazemore chased down former teammate Jeff Teague for a blocked shot that stood following a replay review by officials."}
{"game_id": "0021700739", "chunk_id": "0021700739_004", "order": 4, "role": "body", "text": "\"By far my favorite play in the game of basketball is the chase-down block,\" Bazemore said."}
{"game_id": "0021700739", "chunk_id": "0021700739_005", "order": 5, "role": "body", "text": "Bazemore added a layup to stretch the lead back to three. He also had a chase-down block in the first half."}
{"game_id": "0021700739", "chunk_id": "0021700739_006", "order": 6, "role": "body", "text": "\"He fuels our team with great competitive spirit and great competitive energy,\" Hawks coach Mike Budenholzer said."}
{"game_id": "0021700739", "chunk_id": "0021700739_007", "order": 7, "role": "body", "text": "A layup by Taj Gibson cut Atlanta's lead to 101-100. Following a missed short jumper by Dennis Schroder, Minnesota called timeout with 14.5 seconds remaining. Unable to make the inbounds pass, Teague was whistled for a five-second violation before trying to call a timeout."}
{"game_id": "0021700739", "chunk_id": "0021700739_008", "order": 8, "role": "body", "text": "Schroder had 18 points, including four free throws in the final 11.3 seconds."}
{"game_id": "0021700739", "chunk_id": "0021700739_009", "order": 9, "role": "body", "text": "The Hawks began the night with the NBA's worst record but have won six straight home games against teams from the Western Conference."}
{"game_id": "0021700739", "chunk_id": "0021700739_010", "order": 10, "role": "body", "text": "Jimmy Butler had 24 points and Andrew Wiggins scored 18 for Minnesota."}
{"game_id": "0021700739", "chunk_id": "0021700739_011", "order": 11, "role": "body", "text": "Butler was sharp in his second game back after missing four with right knee soreness. He went 7 for 15 from the field and made each of his nine free throws."}
{"game_id": "0021700739", "chunk_id": "0021700739_012", "order": 12, "role": "body", "text": "Minnesota appeared to be on the verge of putting the game away when it led 71-60 in the third period. Atlanta quickly trimmed the margin back to single digits."}
{"game_id": "0021700739", "chunk_id": "0021700739_013", "order": 13, "role": "body", "text": "\"I felt like we could have put them away in that third quarter but we just didn't get it done,\" Gibson said. \"When you give a team like that confidence late in the game, it gets scary. They started hitting shots.\""}
{"game_id": "0021700739", "chunk_id": "0021700739_015", "order": 15, "role": "body", "text": "Timberwolves: Began the night one game behind San Antonio for the No. 3 seed in the Western Conference. ... Minnesota fell to 1-7 on the road in January. .. Gibson scored 17 points and Karl-Anthony Towns had 15 points and 13 rebounds. ... Teague shot only 1 of 12 from the field for two points with 10 assists."}
{"game_id": "0021700739", "chunk_id": "0021700739_016", "order": 16, "role": "body", "text": "Hawks: Had a 46-24 advantage in bench points. ... Dewayne Dedmon, the 7-foot backup center, sank both of his 3-point attempts in the first half -- one shy of his career high for a game. Dedmon had 10 points. Ersan Ilyasova also scored 10. ... The Hawks had a 44-35 advantage in rebounds, including 11 by rookie John Collins. ... Schroder had 11 assists for a double-double."}
{"game_id": "0021700739", "chunk_id": "0021700739_018", "order": 18, "role": "body", "text": "With the game tied at 90, Teague and Gibson each were called for a technical foul by official Lauren Holtkamp following Teague's offensive foul. Schroder made only one of two free throws."}
{"game_id": "0021700739", "chunk_id": "0021700739_019", "order": 19, "role": "body", "text": "\"All through the game Schroder kept cursing her out,\" Gibson said. \"He kept yelling at her the whole game. All I said to her was you've got to do the same thing on both sides. You can't let him talk to you any kind of way and when Jeff says a few words to you, you blow up on us. That's bad. She just gave me a tech. I've been going through that with her over the years. She has a short whistle.\""}
{"game_id": "0021700739", "chunk_id": "0021700739_020", "order": 20, "role": "body", "text": "Timberwolves coach Tom Thibodeau said: \"Sometimes we're not going to get calls on the road and we didn't. You can't react that way.\""}
{"game_id": "0021700739", "chunk_id": "0021700739_022", "order": 22, "role": "body", "text": "Budenholzer was surprised when told before the game of his team's streak at home against Western Conference opponents."}
{"game_id": "0021700739", "chunk_id": "0021700739_023", "order": 23, "role": "body", "text": "\"I had no idea that was the case,\" Budenholzer said. \"It'd be great to beat an Eastern Conference team, too. We play a lot more of them.\""}
{"game_id": "0021700739", "chunk_id": "0021700739_025", "order": 25, "role": "body", "text": "Timberwolves: At the Toronto Raptors on Tuesday night."}
{"game_id": "0021700739", "chunk_id": "0021700739_026", "order": 26, "role": "body", "text": "Hawks: Host the Charlotte Hornets on Wednesday night."}
{"game_id": "0021700739", "chunk_id": "0021700739_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
