{"game_id": "0021400218", "chunk_id": "0021400218_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Andrew Wiggins and Jabari Parker didn't exactly deliver the instant-classic game that fellow rookie Zach LaVine predicted for the first regular-season matchup between the top two picks from the June draft."}
{"game_id": "0021400218", "chunk_id": "0021400218_002", "order": 2, "role": "body", "text": "Instead, it was Milwaukee's defense that stood out, grinding down the undermanned Minnesota Timberwolves and putting yet another mark in the win column for the surprising Bucks."}
{"game_id": "0021400218", "chunk_id": "0021400218_003", "order": 3, "role": "body", "text": "Larry Sanders had 15 points, seven rebounds and five blocks to help the Bucks to a 103-86 victory over the Timberwolves on Wednesday night."}
{"game_id": "0021400218", "chunk_id": "0021400218_004", "order": 4, "role": "body", "text": "Brandon Knight scored 13 of his 15 points in the fourth quarter for the Bucks (9-7), who have won five of their last seven games in a spirited start under new coach Jason Kidd. Giannis Antetokounmpo had 13 points, eight rebounds and four assists, and Parker added 11 points and seven boards for Milwaukee, which held the Wolves to 38 percent shooting and turned 19 turnovers into 20 points."}
{"game_id": "0021400218", "chunk_id": "0021400218_005", "order": 5, "role": "body", "text": "\"I thought defensively, Larry, everyone that was one the floor was at a very high level,\" Kidd said."}
{"game_id": "0021400218", "chunk_id": "0021400218_006", "order": 6, "role": "body", "text": "Wiggins had 14 points, eight rebounds, four assists and two blocks for the Wolves, who had just 10 healthy players and third-stringer LaVine was their only available point guard. Corey Brewer added 19 points."}
{"game_id": "0021400218", "chunk_id": "0021400218_007", "order": 7, "role": "body", "text": "\"We've got a lot of guys playing roles they're not accustomed to playing,\" Wolves coach Flip Saunders said."}
{"game_id": "0021400218", "chunk_id": "0021400218_008", "order": 8, "role": "body", "text": "The future of the league was on display on Wednesday night with each team starting two 19-year-olds -- Wiggins and LaVine for Minnesota and Parker and Antetokounmpo for Milwaukee. It's the first time in NBA history that four teenagers have played in the same game, let alone started."}
{"game_id": "0021400218", "chunk_id": "0021400218_009", "order": 9, "role": "body", "text": "All eyes were on Wiggins and Parker, the top two picks in the draft. Wiggins was drafted by Cleveland ahead of Parker, but was traded to Minnesota in the package that brought All-Star Kevin Love to the Cavaliers. Both players have impressed early with their willingness to assimilate to the team concept as opposed trying to dominate the ball and take the bulk of the shots."}
{"game_id": "0021400218", "chunk_id": "0021400218_010", "order": 10, "role": "body", "text": "They rarely met eye-to-eye on Wednesday but Wiggins did swat Parker's layup attempt in the third quarter, bringing the crowd to its feet."}
{"game_id": "0021400218", "chunk_id": "0021400218_011", "order": 11, "role": "body", "text": "Thaddeus Young made his return to the lineup for the Wolves after missing the past five games to mourn the death of his mother. Young missed his first eight shots and finished with three points on 1-for-10 shooting. Mo Williams, who has been starting for injured point guard Ricky Rubio, missed the game with an illness."}
{"game_id": "0021400218", "chunk_id": "0021400218_012", "order": 12, "role": "body", "text": "With 6-foot-7 Robbie Hummel forced to play center on the second unit, the Bucks went hard to the rim in the fourth quarter to pull away. Sanders and Parker each turned dunks into three-point plays after getting fouled by the overmatched Hummel for an 84-78 lead and they never looked back."}
{"game_id": "0021400218", "chunk_id": "0021400218_013", "order": 13, "role": "body", "text": "\"Defensively we were able to get stops, really put some pressure on them and force some turnovers,\" said Knight, who had three steals. \"That's what I was (most) proud of.\""}
{"game_id": "0021400218", "chunk_id": "0021400218_015", "order": 15, "role": "body", "text": "Bucks: Knight was given a Flagrant-1 for a hard foul on a breakaway by Gorgui Dieng. ... All five Bucks starters scored in double figures and they also had 39 bench points."}
{"game_id": "0021400218", "chunk_id": "0021400218_016", "order": 16, "role": "body", "text": "Timberwolves: The Timberwolves honored Young's mother, Lula Hall, by wearing pink shoe laces during the game to raise awareness for breast cancer research. Hall died on Nov. 13 after an 18-month battle with the disease. ... The Wolves started their seventh different lineup in the last seven games."}
{"game_id": "0021400218", "chunk_id": "0021400218_018", "order": 18, "role": "body", "text": "There was considerable debate as to who belonged in that first spot in the draft, Wiggins or Parker. Both downplayed the individual portion of the game, but LaVine, who was the 13th pick, knew better."}
{"game_id": "0021400218", "chunk_id": "0021400218_019", "order": 19, "role": "body", "text": "\"How highly touted they were in high school, even in grade school coming up. They were both No. 1, No. 2 and just switching on and off their whole careers,\" LaVine said earlier this week. \"I feel like it might be like that even (in the NBA) because they're just going to be going at each other.\""}
{"game_id": "0021400218", "chunk_id": "0021400218_021", "order": 21, "role": "body", "text": "Parker, when asked if he stays in touch with Wiggins during the season: \"It's a long-distance relationship. I don't believe in those.\""}
{"game_id": "0021400218", "chunk_id": "0021400218_023", "order": 23, "role": "body", "text": "Bucks: Visit Detroit on Friday."}
{"game_id": "0021400218", "chunk_id": "0021400218_024", "order": 24, "role": "closing", "text": "Timberwolves: Visit Los Angeles Lakers on Friday."}
