{"game_id": "0021400479", "chunk_id": "0021400479_001", "order": 1, "role": "lead", "text": "CLEVELAND --  LeBron James had on street clothes, and the Milwaukee Bucks made the most of his absence."}
{"game_id": "0021400479", "chunk_id": "0021400479_002", "order": 2, "role": "body", "text": "Brandon Knight scored 26 points Wednesday night and Milwaukee led most of the way in a 96-80 win over the short-handed Cleveland Cavaliers, who played without James for the second straight game."}
{"game_id": "0021400479", "chunk_id": "0021400479_003", "order": 3, "role": "body", "text": "James was sidelined because of a sore left knee, an injury that also forced him to miss Tuesday's game against Atlanta. Kevin Love was out with back spasms, and the Cavaliers went on to their fourth loss in five games."}
{"game_id": "0021400479", "chunk_id": "0021400479_004", "order": 4, "role": "body", "text": "The Bucks seized on their opportunity."}
{"game_id": "0021400479", "chunk_id": "0021400479_005", "order": 5, "role": "body", "text": "\"We prepared for their main guys, but honestly, it made us a little more focused when we found out they weren't going to have LeBron,\" Knight said. \"We knew their other guys who come out and play extra hard. No matter who is on the court, our principles never change. Guys are always ready to play.\""}
{"game_id": "0021400479", "chunk_id": "0021400479_006", "order": 6, "role": "body", "text": "Cavaliers coach David Blatt admitted that playing without a full roster is a challenge, but added: \"No excuses. We've got to play and we've got to compete and do everything we can to win basketball games.\""}
{"game_id": "0021400479", "chunk_id": "0021400479_007", "order": 7, "role": "body", "text": "O.J. Mayo scored 15 points for the Bucks (17-16), and Giannis Antetokounmpo added 14 points, eight rebounds and five assists."}
{"game_id": "0021400479", "chunk_id": "0021400479_008", "order": 8, "role": "body", "text": "Kyrie Irving scored 25 points for Cleveland, and Tristan Thompson had 10 points and 13 rebounds. The Cavaliers scored seven points in the third quarter, a season low."}
{"game_id": "0021400479", "chunk_id": "0021400479_009", "order": 9, "role": "body", "text": "Milwaukee went ahead for good late in the first quarter and built a 17-point lead in the first half. Cleveland pulled within one late in the second quarter, but the Bucks led by five at the break and opened the third with a 13-2 run."}
{"game_id": "0021400479", "chunk_id": "0021400479_010", "order": 10, "role": "body", "text": "Milwaukee's lead reached 22 points in the fourth quarter. The Bucks, who won in overtime at Charlotte on Monday, improved to 7-7 on the road."}
{"game_id": "0021400479", "chunk_id": "0021400479_011", "order": 11, "role": "body", "text": "Knight was 11 of 19 from the field, including four 3-pointers, and had six assists. Zaza Pachulia and Khris Middleton each had nine points and eight rebounds."}
{"game_id": "0021400479", "chunk_id": "0021400479_012", "order": 12, "role": "body", "text": "James said before the game the knee has bothered him most of the season, and he didn't know if he would play Friday in Charlotte. He missed the Dec. 11 game against Oklahoma City and aggravated the knee when he jumped over a row of seats chasing a loose ball on Christmas at Miami."}
{"game_id": "0021400479", "chunk_id": "0021400479_013", "order": 13, "role": "body", "text": "James ranks second in the NBA with 25.2 points per game, and Love averages 16.7 points and 10.1 rebounds."}
{"game_id": "0021400479", "chunk_id": "0021400479_014", "order": 14, "role": "body", "text": "The Cavaliers (18-14) have been hit by a rash of injuries. Forward Shawn Marion missed his second straight game with a sprained left ankle. Center Anderson Varejao will miss the rest of the season after tearing his left Achilles tendon last week."}
{"game_id": "0021400479", "chunk_id": "0021400479_015", "order": 15, "role": "body", "text": "\"Obviously, when those guys aren't playing it's going to be a different game,\" Irving said. \"For us right now we've just to pick it up. I think we're ready to do so, but we need a little bit more. I'm going to have to give more. As a group we have to figure this out.\""}
{"game_id": "0021400479", "chunk_id": "0021400479_016", "order": 16, "role": "body", "text": "The Bucks, who finished an NBA-worst 15-67 last season, have split eight games since they announced that rookie forward Jabari Parker will miss the rest of the season with a knee injury."}
{"game_id": "0021400479", "chunk_id": "0021400479_017", "order": 17, "role": "body", "text": "\"We knew they were without LeBron, Kevin Love and Shawn Marion, but it didn't matter,\" Antetokounmpo said. \"We just tried to play our game and get the win. I like winning. I like winning as much as possible. Last year was tough. Coming into this year, we really didn't know what we had, but all the guys are playing hard.\""}
{"game_id": "0021400479", "chunk_id": "0021400479_019", "order": 19, "role": "body", "text": "The Bucks worked out free agent Kenyon Martin at a Cleveland-area gym on Tuesday. Coach Jason Kidd played with the 37-year-old forward with the Nets and New York Knicks. Martin has also worked out with Houston and Memphis. \"He's going to play shortly here with someone,\" Kidd said."}
{"game_id": "0021400479", "chunk_id": "0021400479_021", "order": 21, "role": "body", "text": "It's unclear when Cleveland's injured players will return. If James doesn't play Friday, he hopes to return Sunday when the Cavaliers host Dallas. Love's back locked up on him in the first half against Atlanta and he was limited to 24 minutes. Marion rolled his ankle last Sunday against the Pistons."}
{"game_id": "0021400479", "chunk_id": "0021400479_023", "order": 23, "role": "body", "text": "Bucks: C Larry Sanders (illness), who missed his fourth straight game, will be examined Thursday in Milwaukee. ... F Ersan Ilyasova (concussion) also missed his fourth straight game. ... G Jerryd Bayless (sore left knee) also didn't play."}
{"game_id": "0021400479", "chunk_id": "0021400479_024", "order": 24, "role": "body", "text": "Cavaliers: C Brendan Haywood, who appeared in seven of the first 31 games, started for the first time this season. ... Blatt made liberal use of his bench. All 11 players saw action and Irving, who played 43 minutes Tuesday, was given a rest in the first quarter."}
{"game_id": "0021400479", "chunk_id": "0021400479_026", "order": 26, "role": "body", "text": "Bucks: Host Indiana on Friday."}
{"game_id": "0021400479", "chunk_id": "0021400479_027", "order": 27, "role": "closing", "text": "Cavaliers: At Charlotte on Friday."}
