{"game_id": "0021701197", "chunk_id": "0021701197_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Domantas Sabonis had barely settled into his seat on the bench when coach Nate McMillan looked his way."}
{"game_id": "0021701197", "chunk_id": "0021701197_002", "order": 2, "role": "body", "text": "When Myles Turner picked up two early fouls, Sabonis was pressed into duty much earlier than usual."}
{"game_id": "0021701197", "chunk_id": "0021701197_003", "order": 3, "role": "body", "text": "\"By the time my heat packs came I had to go in, and I was like, `Uh oh,\" Sabonis said with a laugh."}
{"game_id": "0021701197", "chunk_id": "0021701197_004", "order": 4, "role": "body", "text": "But the 6-foot-10 forward from Lithuania responded with a career-high 30 points, helping the Indiana Pacers beat the Charlotte Hornets 123-117 on Sunday to keep alive their slim hopes of winning the Central Division title."}
{"game_id": "0021701197", "chunk_id": "0021701197_005", "order": 5, "role": "body", "text": "Victor Oladipo had 27 points on 12-of-15 shooting and Lance Stephenson, a former Hornet, had 10 rebounds, 10 assists and eight points for the Pacers, who have won seven of their last nine games."}
{"game_id": "0021701197", "chunk_id": "0021701197_006", "order": 6, "role": "body", "text": "Sabonis said he feels comfortable in the Pacers' system, where he is playing more center than he did earlier in the season."}
{"game_id": "0021701197", "chunk_id": "0021701197_007", "order": 7, "role": "body", "text": "\"I love it here,\" Sabonis said. \"It's a great system. We have a great group of guys who believe in it and we all want to win so that's been working for us.\""}
{"game_id": "0021701197", "chunk_id": "0021701197_008", "order": 8, "role": "body", "text": "McMillan said Sabonis has been solid all season, whether it has been in a starting role or reserve, or playing the four or five position."}
{"game_id": "0021701197", "chunk_id": "0021701197_009", "order": 9, "role": "body", "text": "\"He does a good job of getting the offense moving from side to side,\" McMillan said. \"He's made good decisions out there when he's played.\""}
{"game_id": "0021701197", "chunk_id": "0021701197_010", "order": 10, "role": "body", "text": "For Indiana (48-33) to win the Central and earn home-court advantage for the first round of the NBA playoffs, it needs to beat Charlotte on Tuesday night and have Cleveland (49-31) lose its final two games against the New York Knicks. The Pacers have the tiebreaker advantage over the Cavaliers after taking three of four in the season series, including a 124-107 win in November."}
{"game_id": "0021701197", "chunk_id": "0021701197_011", "order": 11, "role": "body", "text": "The Pacers jumped out to a 70-57 halftime lead after shooting 67 percent from the field, including 6 of 9 from 3-point range."}
{"game_id": "0021701197", "chunk_id": "0021701197_012", "order": 12, "role": "body", "text": "Charlotte rallied in the third quarter, but the Pacers took over and quickly built a 20-point lead even with Oladipo on the bench with four fouls."}
{"game_id": "0021701197", "chunk_id": "0021701197_013", "order": 13, "role": "body", "text": "Indiana shot 54 percent from the field for the game."}
{"game_id": "0021701197", "chunk_id": "0021701197_015", "order": 15, "role": "body", "text": "Pacers: Stephenson wore gold-colored shoes. ... Glenn Robinson III and Cory Joseph each had 13 points as the Pacers' reserves outscored the Hornets' backups, 72-60."}
{"game_id": "0021701197", "chunk_id": "0021701197_016", "order": 16, "role": "body", "text": "Hornets: Kemba Walker didn't score until there was 5 minutes left in the second quarter and finished with 12 points. ... The Hornets honored play-by-play announcer Steve Martin, who is retiring after 30 seasons with the franchise."}
{"game_id": "0021701197", "chunk_id": "0021701197_018", "order": 18, "role": "body", "text": "Malik Monk is finishing his rookie season with a flurry. After scoring a career-high 26 points in his previous game, Monk led the Hornets with 22 against the Pacers."}
{"game_id": "0021701197", "chunk_id": "0021701197_019", "order": 19, "role": "body", "text": "\"I've been watching Kemba a lot when I was sitting on the bench so I've been learning everything he's been doing and I've been trying to do that when I stepped on the court,\" Monk said."}
{"game_id": "0021701197", "chunk_id": "0021701197_020", "order": 20, "role": "body", "text": "Monk has improved in the pick-and-roll game."}
{"game_id": "0021701197", "chunk_id": "0021701197_021", "order": 21, "role": "body", "text": "\"Almost all of his baskets were off pick and rolls and it's not just his scoring,\" Hornets coach Steve Clifford said. \"The thing he's doing better is making plays for other people. That to me is as much of an indicator as anything of the growth he has made in terms of learning how to play.\""}
{"game_id": "0021701197", "chunk_id": "0021701197_023", "order": 23, "role": "body", "text": "McMillan said one of the team's goals this season was to finish above .500 on the road. It finished 21-20 in such games."}
{"game_id": "0021701197", "chunk_id": "0021701197_025", "order": 25, "role": "body", "text": "Pacers: Host Hornets on Tuesday."}
{"game_id": "0021701197", "chunk_id": "0021701197_026", "order": 26, "role": "body", "text": "Hornets: Visit Pacers on Tuesday."}
{"game_id": "0021701197", "chunk_id": "0021701197_028", "order": 28, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
