{"game_id": "0021701204", "chunk_id": "0021701204_001", "order": 1, "role": "lead", "text": "DETROIT --  On the second night of a back-to-back -- with first place in the Eastern Conference already wrapped up -- the Toronto Raptors easily could have packed it in after falling behind by 17 points."}
{"game_id": "0021701204", "chunk_id": "0021701204_002", "order": 2, "role": "body", "text": "That's not what coach Dwane Casey wanted."}
{"game_id": "0021701204", "chunk_id": "0021701204_003", "order": 3, "role": "body", "text": "\"We are taking these last games seriously, because now isn't the time to let any bad habits into our game,\" Casey said. \"This week is about sharpening your habits to be ready for next week.\""}
{"game_id": "0021701204", "chunk_id": "0021701204_004", "order": 4, "role": "body", "text": "Jonas Valanciunas scored 25 points, and the Raptors rallied for a 108-98 victory over the Detroit Pistons on Monday night. Toronto closed the second quarter on a 21-7 run, and the Raptors also scored the first 13 points of the fourth."}
{"game_id": "0021701204", "chunk_id": "0021701204_005", "order": 5, "role": "body", "text": "Detroit was without injured stars Andre Drummond and Blake Griffin for its home finale, but the Pistons still led 53-36 in the first half. But it was 60-57 at halftime, and Detroit managed only 38 points over the final two quarters."}
{"game_id": "0021701204", "chunk_id": "0021701204_006", "order": 6, "role": "body", "text": "\"I think we competed hard,\" said Eric Moreland, who started at center in place of Drummond. \"I think we competed on both ends tonight.\""}
{"game_id": "0021701204", "chunk_id": "0021701204_007", "order": 7, "role": "body", "text": "The short-handed Pistons are out of playoff contention, and Toronto had some key players out too in Fred VanVleet and Serge Ibaka. Although the result meant little, it was a tight, entertaining game through three quarters. The Raptors led 85-80 at the end of the third before breaking it open."}
{"game_id": "0021701204", "chunk_id": "0021701204_008", "order": 8, "role": "body", "text": "Toronto led 100-81 in the fourth, then Detroit went on a 14-2 run. Pistons rookie Luke Kennard took a 3-pointer that would have cut the deficit to four, but it rattled out."}
{"game_id": "0021701204", "chunk_id": "0021701204_009", "order": 9, "role": "body", "text": "Valanciunas didn't play at all in the fourth, but he'd done plenty already. He finished 11 of 13 from the field and made his only attempt from beyond the arc."}
{"game_id": "0021701204", "chunk_id": "0021701204_011", "order": 11, "role": "body", "text": "In addition to Drummond (sore Achilles tendon) and Griffin (right ankle contusion), the Pistons were also without Reggie Bullock (left knee swelling)."}
{"game_id": "0021701204", "chunk_id": "0021701204_012", "order": 12, "role": "body", "text": "VanVleet was out with lower back tightness, and Ibaka had the night off to rest for Toronto."}
{"game_id": "0021701204", "chunk_id": "0021701204_014", "order": 14, "role": "body", "text": "The game didn't mean much in terms of seeding in the East, but Toronto (59-22) now leads Golden State (58-23) by a game for home-court advantage in a possible NBA Finals matchup."}
{"game_id": "0021701204", "chunk_id": "0021701204_015", "order": 15, "role": "body", "text": "The Raptors are also hoping to win their regular-season finale at Miami and reach 60 victories."}
{"game_id": "0021701204", "chunk_id": "0021701204_016", "order": 16, "role": "body", "text": "\"We want sixty, because we know it would be a great achievement for our franchise,\" said guard Kyle Lowry, who scored 11 points Monday. \"The important thing, though, is what happens after the Miami game. We're ready. It doesn't matter who we play. We just have to play our game.\""}
{"game_id": "0021701204", "chunk_id": "0021701204_018", "order": 18, "role": "body", "text": "Detroit coach Stan Van Gundy shared his thoughts on Toronto's chances in the East."}
{"game_id": "0021701204", "chunk_id": "0021701204_019", "order": 19, "role": "body", "text": "\"I've said for a long time, I think they're the best team in the East, and the team to beat,\" Van Gundy said. \"So, we'll see what happens, but that's a really, really good team.\""}
{"game_id": "0021701204", "chunk_id": "0021701204_021", "order": 21, "role": "body", "text": "Raptors: DeMar DeRozan scored 16 points. ... Toronto outscored Detroit 60-38 in the paint. ... The Raptors completed a sweep of their back-to-back after beating Orlando on Sunday night."}
{"game_id": "0021701204", "chunk_id": "0021701204_022", "order": 22, "role": "body", "text": "Pistons: Kennard led Detroit with 20 points and Reggie Jackson scored 16 with nine assists. Ish Smith had 15 points on 7-of-8 shooting."}
{"game_id": "0021701204", "chunk_id": "0021701204_024", "order": 24, "role": "body", "text": "Raptors: Visit the Miami Heat on Wednesday night."}
{"game_id": "0021701204", "chunk_id": "0021701204_025", "order": 25, "role": "body", "text": "Pistons: Visit the Chicago Bulls on Wednesday night."}
{"game_id": "0021701204", "chunk_id": "0021701204_027", "order": 27, "role": "body", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
{"game_id": "0021701204", "chunk_id": "0021701204_029", "order": 29, "role": "closing", "text": "Follow Noah Trister at www.Twitter.com/noahtrister"}
