{"game_id": "0021400936", "chunk_id": "0021400936_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- Even against a fellow All-Star, Russell Westbrook's dominance continued.\nOklahoma City's dynamic point guard posted his fifth triple-double in six games to help the Thunder beat the Toronto Raptors 108-104 on Sunday night.\nWestbrook, the NBA's leading scorer, had 30 points, matched a career high with 17 assists and grabbed 11 rebounds for his seventh triple-double of the season and 15th of his career. He did much of the damage against Kyle Lowry, the starting point guard for the Eastern Conference All-Stars.\n\"He's playing unbelievable basketball right now,\" said Lowry, who finished with 14 points on 5-for-15 shooting. \"The man is unbelievable, and he's pretty much carrying their team right now.\"\nWestbrook, the All-Star MVP and reigning Western Conference player of the month, said he's aware of how special triple-doubles are.\n\"It crosses my mind when we win, which is the most important thing,\" he said.\nEnes Kanter had 21 points and 12 rebounds, and Serge Ibaka had 21 points and five blocks for the Thunder, who remained alone in eighth place in the Western Conference standings.\nThe Thunder shot 51 percent from the field and outrebounded the Raptors 49-33.\n\"It's not like we didn't play hard, but they took it to another level and we didn't meet it, especially in the paint with rebounding,\" Toronto coach Dwane Casey said.\nDeMar DeRozan scored 24 points and Terrence Ross added 20 for the Raptors, who lost their third straight.\n\"We've got to continue to get better,\" Casey said. \"We can't feel sorry for ourselves. Nobody is going to do that. We've got to put together 46, 47 minutes of good offense and good defense and continue as we go on with the season.\"\nA powerful dunk by DeRozan cut Oklahoma City's lead to 106-104 with 15.4 seconds to play. Westbrook made two free throws with 14.3 seconds remaining to make it a four-point lead. DeRozan missed a contested 3-pointer, and the Thunder held on.\nToronto led by seven in the second quarter before the Thunder rallied. A dunk by Ibaka on an assist by Westbrook cut the Raptors' lead to 59-58, but Toronto maintained a 61-58 lead heading into the break. DeRozan led the Raptors with 16 points in the first half. Oklahoma City shot 56 percent before the break but turned the ball over 10 times.\nWestbrook clinched the triple-double on a rebound with just more than a minute left in the third quarter. Steven Adams' jumper in the lane as time expired in the period gave the Thunder an 86-79 lead and Westbrook his 15th assist.\nThe Raptors felt they got caught playing Oklahoma City's game.\n\"We've got to understand when we play well like we did in the first half, other teams are going to make adjustments and something we tried in the first half may not work in the second half,\" DeRozan said. \"We should have been more aggressive getting to the basket, getting to the free throw line, and try to slow down the game that way.\"\nQUOTE OF THE NIGHT\nDeRozan on Westbrook: \"If you can find somebody who has slowed him down, let me know. But it's definitely tough. You've got to give him credit.\"\nSTAT LINES\nWestbrook is averaging 34.3 points, 10.2 rebounds and 11.4 assists since the All-Star break.\nON THE RISE\nKanter, the former Utah Jazz center the Thunder picked up at the trade deadline, has averaged 14.3 points and 9.3 rebounds since the deal. His 21 points were the most he's scored in eight games with Oklahoma City.\nTIP-INS\nRaptors: Toronto had just one turnover in the first quarter, four in the first half and eight in the game. ... Toronto made all nine of its free throws.\nThunder: Adams returned after missing eight games with a broken bone in his right hand. ... Oklahoma City wore its alternate uniforms with sleeves. ... Westbrook's seven turnovers in the first half tied for the most by a player in the first half of a game this season.\nUP NEXT:\nRaptors: at San Antonio on Tuesday.\nThunder: host Los Angeles Clippers on Wednesday."}
