{"game_id": "0021700565", "chunk_id": "0021700565_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  Russell Westbrook, doing his MVP thing back home. Paul George and Carmelo Anthony lighting it up."}
{"game_id": "0021700565", "chunk_id": "0021700565_003", "order": 3, "role": "body", "text": "But where did Terrance Ferguson come from?"}
{"game_id": "0021700565", "chunk_id": "0021700565_004", "order": 4, "role": "body", "text": "Oklahoma City might have found another potential star Wednesday night in Ferguson, a rookie who scored all 24 of his points in the second half to help the Thunder to a 133-96 victory over the skidding Los Angeles Lakers."}
{"game_id": "0021700565", "chunk_id": "0021700565_005", "order": 5, "role": "body", "text": "Ferguson shot 6 of 9 on 3-pointers and threw down several spectacular dunks as Oklahoma City handed the Lakers their eighth consecutive defeat. He finished 9 of 12 from the field overall."}
{"game_id": "0021700565", "chunk_id": "0021700565_006", "order": 6, "role": "body", "text": "\"Like throwing a pebble in the ocean,\" Ferguson said. \"Pretty good night.\""}
{"game_id": "0021700565", "chunk_id": "0021700565_007", "order": 7, "role": "body", "text": "It was the first NBA start for Ferguson, whose previous career high was seven points."}
{"game_id": "0021700565", "chunk_id": "0021700565_008", "order": 8, "role": "body", "text": "\"What you guys saw out there tonight, that's him,\" Anthony said. \"He's hardworking -- day in, day out. Listens, takes advice. Whatever the coach asks him, he gets it done. What you saw wasn't a coincidence.\""}
{"game_id": "0021700565", "chunk_id": "0021700565_009", "order": 9, "role": "body", "text": "George, thought to be interested in playing for his hometown Lakers at some point, matched Ferguson with 24 points. Anthony added 21 and Westbrook had 20 points, 12 assists and six rebounds in a successful homecoming."}
{"game_id": "0021700565", "chunk_id": "0021700565_010", "order": 10, "role": "body", "text": "The reigning league MVP was born in Long Beach and went to college at UCLA."}
{"game_id": "0021700565", "chunk_id": "0021700565_011", "order": 11, "role": "body", "text": "There was little of note for the Lakers to point to. After opening the game with a 10-0 run, they were thoroughly outplayed the rest of the night. The Thunder took control in the second quarter, outscoring Los Angeles 37-18."}
{"game_id": "0021700565", "chunk_id": "0021700565_012", "order": 12, "role": "body", "text": "\"I felt like we came out the way we have been playing all year, which is competitive, in the fight and taking it to them,\" Lakers coach Luke Walton said. \"Then it felt like we gave in.\""}
{"game_id": "0021700565", "chunk_id": "0021700565_013", "order": 13, "role": "body", "text": "The Lakers were led by rookie Kyle Kuzma's 18 points. They shot 41.3 percent from the field, while the Thunder shot 60.2 percent."}
{"game_id": "0021700565", "chunk_id": "0021700565_014", "order": 14, "role": "body", "text": "Oklahoma City led by as many as 39 in the second half as Ferguson began to put on his show."}
{"game_id": "0021700565", "chunk_id": "0021700565_015", "order": 15, "role": "body", "text": "\"We really gave up,\" Kuzma said. \"They took a little lead and we just went to being selfish on the floor. We didn't compete on defense and they killed us.\""}
{"game_id": "0021700565", "chunk_id": "0021700565_016", "order": 16, "role": "body", "text": "Oklahoma City finished with 36 assists."}
{"game_id": "0021700565", "chunk_id": "0021700565_018", "order": 18, "role": "body", "text": "Thunder: Despite the additions of George and Anthony this season, Westbrook leads the team in points, rebounds and assists. Oklahoma City coach Billy Donovan said Westbrook is no longer the young player who came up with Kevin Durant trying to establish himself. \"He is always trying to do what's best for the team. He didn't shoot the ball particularly well early (this season),\" Donovan said. \"He puts a tremendous about of responsibility and ownership on himself as a point guard -- that it's his job to get those guys involved. He was trying to get those guys involved.\""}
{"game_id": "0021700565", "chunk_id": "0021700565_019", "order": 19, "role": "body", "text": "Lakers: Julius Randle, thought to be somewhat undersized as a 6-foot-9 power forward, started his fourth consecutive game at center despite the return of Brook Lopez (ankle). Randle had been getting irregular playing time but in his first three starts averaged 20.7 points and 11.3 rebounds while shooting 60 percent from the field. \"Julius has been great all year. He probably deserves more playing time,\" Walton said. \"He's obviously been frustrated with me at times but he's done a really nice job of when he gets called on, does a great job. He produces when he's out there.\" ... Rookie point guard Lonzo Ball (shoulder) missed his sixth consecutive game. He is expected to return to practice Thursday."}
{"game_id": "0021700565", "chunk_id": "0021700565_021", "order": 21, "role": "body", "text": "George insisted Ferguson's big game was no fluke."}
{"game_id": "0021700565", "chunk_id": "0021700565_022", "order": 22, "role": "body", "text": "\"As soon as I got here, I noticed he was a huge talent,\" George said. \"He was very impressive. His work ethic with his natural talent -- the kid is really good. He reminds me of myself a lot early on in the league. Just a sponge trying to take everything in. He's special.\""}
{"game_id": "0021700565", "chunk_id": "0021700565_023", "order": 23, "role": "body", "text": "Ferguson was just trying to soak in his breakout night."}
{"game_id": "0021700565", "chunk_id": "0021700565_024", "order": 24, "role": "body", "text": "\"To have a game like that was pretty amazing,\" he said."}
{"game_id": "0021700565", "chunk_id": "0021700565_025", "order": 25, "role": "body", "text": "Ferguson, who opted to play in Australia for one year instead of going to college, said he hadn't had a game like that in a while."}
{"game_id": "0021700565", "chunk_id": "0021700565_026", "order": 26, "role": "body", "text": "\"It felt like I was back in high school,\" he said."}
{"game_id": "0021700565", "chunk_id": "0021700565_028", "order": 28, "role": "body", "text": "Thunder: Play at Staples Center again Thursday when they face the Los Angeles Clippers."}
{"game_id": "0021700565", "chunk_id": "0021700565_029", "order": 29, "role": "body", "text": "Lakers: Play the middle game of their three-game homestand Friday against Charlotte."}
{"game_id": "0021700565", "chunk_id": "0021700565_031", "order": 31, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
