{"game_id": "0021201059", "chunk_id": "0021201059_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Charlotte Bobcats don't have much to play for as the NBA season winds down."}
{"game_id": "0021201059", "chunk_id": "0021201059_002", "order": 2, "role": "body", "text": "They aren't going to the postseason."}
{"game_id": "0021201059", "chunk_id": "0021201059_003", "order": 3, "role": "body", "text": "They don't even have a shot to finish with a .500 record."}
{"game_id": "0021201059", "chunk_id": "0021201059_004", "order": 4, "role": "body", "text": "But if there is one reachable goal it's this: Don't finish as the NBA's worst team -- again."}
{"game_id": "0021201059", "chunk_id": "0021201059_005", "order": 5, "role": "body", "text": "The Bobcats took a step in the right direction Wednesday night as Gerald Henderson and Kemba Walker each scored 34 points, and Charlotte handed the injury-riddled Orlando Magic their eighth straight loss, 114-108."}
{"game_id": "0021201059", "chunk_id": "0021201059_006", "order": 6, "role": "body", "text": "The Bobcats still have the NBA's worst record at 17-54, but find themselves only a half-game behind the Magic (18-54) with 11 games to play in the race against futility."}
{"game_id": "0021201059", "chunk_id": "0021201059_007", "order": 7, "role": "body", "text": "\"If there is something we can play for it is that,\" said Henderson, who finished one point shy of his career-high."}
{"game_id": "0021201059", "chunk_id": "0021201059_008", "order": 8, "role": "body", "text": "\"We play with a lot of pride and we're obviously not going to make the playoffs. But I will play for that. You never want to be seen as the worst team, regardless of how your season has gone. Last year we were the undisputed worst team.\""}
{"game_id": "0021201059", "chunk_id": "0021201059_009", "order": 9, "role": "body", "text": "The Bobcats finished 7-59 a year ago and have a shot to triple that win total this season."}
{"game_id": "0021201059", "chunk_id": "0021201059_010", "order": 10, "role": "body", "text": "\"We want to finish off this season strong and get some confidence so we know what we can do for next season,\" Walker said. \"We have to start building. It starts right now for us.\""}
{"game_id": "0021201059", "chunk_id": "0021201059_011", "order": 11, "role": "body", "text": "The Bobcats erased a 19-point, first-quarter deficit behind the shooting of Henderson, who finished 12 of 18 from the field and 9 of 10 from the foul line. The former Duke star is averaging 22.5 points per game over the last 10 games while shooting close to 50 percent from the floor."}
{"game_id": "0021201059", "chunk_id": "0021201059_012", "order": 12, "role": "body", "text": "Walker is starting to feed off him."}
{"game_id": "0021201059", "chunk_id": "0021201059_013", "order": 13, "role": "body", "text": "The second-year point guard did a little bit of everything against the Magic, dishing out nine assists and grabbing seven rebounds as the Bobcats won for the fourth time in five games at home."}
{"game_id": "0021201059", "chunk_id": "0021201059_014", "order": 14, "role": "body", "text": "\"I saw a lot of heart from our team, especially this time of the year when you have no shot at the playoffs,\" Bobcats coach Mike Dunlap said. \"Our whole theme has been to improve and left our fans and everyone know that we're still fully engaged.\""}
{"game_id": "0021201059", "chunk_id": "0021201059_015", "order": 15, "role": "body", "text": "Tobias Harris had a career-high 29 points and nine rebounds, and rookie Kyle O'Quinn had a career-high 23 points and 11 rebounds for the Magic."}
{"game_id": "0021201059", "chunk_id": "0021201059_016", "order": 16, "role": "body", "text": "The Magic came in having lost 29 of their last 33 games, while the Bobcats had dropped 22 of 27."}
{"game_id": "0021201059", "chunk_id": "0021201059_017", "order": 17, "role": "body", "text": "Orlando came out strong, closing the first quarter with a 23-4 run to take a 39-20 lead after shooting a blistering 70 percent from the field."}
{"game_id": "0021201059", "chunk_id": "0021201059_018", "order": 18, "role": "body", "text": "But the Magic lead quickly disappeared."}
{"game_id": "0021201059", "chunk_id": "0021201059_019", "order": 19, "role": "body", "text": "Charlotte began chipping away and took a 73-71 lead with 5:52 left in the third quarter on a 17-footer from Walker."}
{"game_id": "0021201059", "chunk_id": "0021201059_020", "order": 20, "role": "body", "text": "Charlotte took the lead for good with 2:30 left in the game on an alley-oop dunk by Bismack Biyombo off a feed from Ben Gordon."}
{"game_id": "0021201059", "chunk_id": "0021201059_021", "order": 21, "role": "body", "text": "Henderson added a 19-footer to push the lead to four and the Bobcats put the game away for good on another alley-oop dunk from Gordon to Josh McRoberts with 17 seconds remaining."}
{"game_id": "0021201059", "chunk_id": "0021201059_022", "order": 22, "role": "body", "text": "Orlando failed to score on five of its last six possessions."}
{"game_id": "0021201059", "chunk_id": "0021201059_023", "order": 23, "role": "body", "text": "\"We started off pretty well,\" Magic coach Jacque Vaughn said. \"The recipe for us is a 48-minute game. That's a long time. A lot can happen.\""}
{"game_id": "0021201059", "chunk_id": "0021201059_024", "order": 24, "role": "body", "text": "Harris said the Magic have to learn to value every possession."}
{"game_id": "0021201059", "chunk_id": "0021201059_025", "order": 25, "role": "body", "text": "\"When we are up like that we have to keep the intensity up,\" said Harris, who was 10 of 20 from the field."}
{"game_id": "0021201059", "chunk_id": "0021201059_026", "order": 26, "role": "body", "text": "Maurice Harkless finished with 18 points on 7-of-12 shooting and Jameer Nelson had 13 points and 11 assists in the loss."}
{"game_id": "0021201059", "chunk_id": "0021201059_027", "order": 27, "role": "body", "text": "It was the first game back on the Orlando bench for forward Hedo Turkoglu, who finished serving a 20-game suspension by the NBA for testing positive for methenolone, an anabolic steroid. But he didn't play."}
{"game_id": "0021201059", "chunk_id": "0021201059_028", "order": 28, "role": "closing", "text": "Game notes The Magic were without Arron Afflalo, Glen Davis, Andrew Nicholson, Al Harrington and Nikola Vucevic due to injuries. Vaughn only used eight players and four of Orlando's starters played at least 42 minutes. ... Charlotte's bench outscored Orlando's reserves 23-12. ... The Bobcats held a 43-34 edge in rebounding. ... This is the third time in Bobcats history two players have scored at least 30 points in the same game."}
