{"game_id": "0021700644", "chunk_id": "0021700644_001", "order": 1, "role": "lead", "text": "CHICAGO --  Zach LaVine is making the most of his limited minutes."}
{"game_id": "0021700644", "chunk_id": "0021700644_002", "order": 2, "role": "body", "text": "The guard scored 18 points in his second game with Chicago as the Bulls ended the Miami Heat's seven-game winning streak with a 119-111 victory Monday."}
{"game_id": "0021700644", "chunk_id": "0021700644_003", "order": 3, "role": "body", "text": "\"I'm still a little tired, a little winded, but I feel good,\" LaVine said. \"It goes by really quick, I look up and like, man it's already seven minutes, but I try to make the most of the 20 minutes, and I think I'm doing a good job so far.\""}
{"game_id": "0021700644", "chunk_id": "0021700644_004", "order": 4, "role": "body", "text": "Justin Holiday made a career-best seven 3s and scored 25 points for the Bulls, who have won three straight and 14 of their last 21."}
{"game_id": "0021700644", "chunk_id": "0021700644_005", "order": 5, "role": "body", "text": "LaVine tore an ACL last season with Minnesota and was traded in a package for Jimmy Butler in the offseason. He scored 14 points in his Bulls debut Saturday against Detroit."}
{"game_id": "0021700644", "chunk_id": "0021700644_006", "order": 6, "role": "body", "text": "The Bulls are limiting LaVine to 20 minutes per game in his first week back. He scored 13 points in 12 minutes in the first half, and his four-point play with 0.9 seconds left before the break put the Bulls ahead 55-48 after a 14-2 run."}
{"game_id": "0021700644", "chunk_id": "0021700644_007", "order": 7, "role": "body", "text": "\"That was pretty disgusting basketball,\" Heat coach Erik Spoelstra said."}
{"game_id": "0021700644", "chunk_id": "0021700644_008", "order": 8, "role": "body", "text": "LaVine also had five rebounds, five assists and two steals."}
{"game_id": "0021700644", "chunk_id": "0021700644_009", "order": 9, "role": "body", "text": "\"He came with a lot of confidence shooting, and he's just so fast out there,\" Nikola Mirotic said."}
{"game_id": "0021700644", "chunk_id": "0021700644_010", "order": 10, "role": "body", "text": "The Bulls hit 16 of 39 3-pointers (41 percent), their eighth straight game with at least 10 3-pointers, a franchise record."}
{"game_id": "0021700644", "chunk_id": "0021700644_011", "order": 11, "role": "body", "text": "\"We weren't communicating very well,\" Heat guard Josh Richardson said. \"We knew the game plan coming in, we were going to have to make them drive it, or make thing tough on them from the 3-point line. We just didn't do that.\""}
{"game_id": "0021700644", "chunk_id": "0021700644_012", "order": 12, "role": "body", "text": "Holiday had four 3-pointers in the third quarter, including one that gave Chicago its first of two 19-point leads in the third, 82-63."}
{"game_id": "0021700644", "chunk_id": "0021700644_013", "order": 13, "role": "body", "text": "Mirotic scored all 18 of his points in the fourth quarter for the Bulls, holding off the Heat, who closed to a 105-100 deficit with 3:39 to play on James Johnson's 3-pointer."}
{"game_id": "0021700644", "chunk_id": "0021700644_014", "order": 14, "role": "body", "text": "Holiday made a jump shot and two free throws, and rookie Lauri Markkanen made a 3-pointer down the stretch. Markkanen had 17 points and nine rebounds."}
{"game_id": "0021700644", "chunk_id": "0021700644_015", "order": 15, "role": "body", "text": "\"They lit us up,\" Spoelstra said. \"They have been playing well for 20 games. It's not like they're sneaking up on us. They've been playing good basketball. They play hard. They compete.\""}
{"game_id": "0021700644", "chunk_id": "0021700644_016", "order": 16, "role": "body", "text": "Heat starter Tyler Johnson injured his left ankle in the third quarter. He was helped to the locker room and didn't return."}
{"game_id": "0021700644", "chunk_id": "0021700644_017", "order": 17, "role": "body", "text": "Goran Dragic scored 22 points to lead the Heat. Off the bench, Kelly Olynyk had 21 points and eight assists and Wayne Ellington had 20 points."}
{"game_id": "0021700644", "chunk_id": "0021700644_019", "order": 19, "role": "body", "text": "Spoestra said Johnson got X-rays on his ankle that were negative and should get an MRI on Tuesday."}
{"game_id": "0021700644", "chunk_id": "0021700644_020", "order": 20, "role": "body", "text": "\"We were all thinking the worst,\" Spoelstra said. \"Right now he just has it wrapped in tape so that's a good sign as well.\""}
{"game_id": "0021700644", "chunk_id": "0021700644_021", "order": 21, "role": "body", "text": "The Heat are already down guard Dion Waiters, who had season-ending ankle surgery."}
{"game_id": "0021700644", "chunk_id": "0021700644_023", "order": 23, "role": "body", "text": "Markkanen made his 100th career 3-pointer in his 41st game, the record for fastest to get to 100 in NBA history."}
{"game_id": "0021700644", "chunk_id": "0021700644_025", "order": 25, "role": "body", "text": "Hoiberg said LaVine will be on 20-minute restriction on Wednesday against Golden State and then re-evaluated for possible extended action after that."}
{"game_id": "0021700644", "chunk_id": "0021700644_027", "order": 27, "role": "body", "text": "Heat: At Milwaukee on Wednesday in the second of a five-game road trip."}
{"game_id": "0021700644", "chunk_id": "0021700644_028", "order": 28, "role": "closing", "text": "Bulls: Host Golden State on Wednesday to close a three-game homestand."}
