{"game_id": "0021300789", "chunk_id": "0021300789_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- The Clippers and Trail Blazers went back and forth for 48 minutes. When it was over, Los Angeles escaped with perhaps its most satisfying victory of the season -- and Portland was saddled with its second heartbreaking loss in 48 hours.\nBlake Griffin scored 36 points, Chris Paul had 20 points and 12 assists, and the Clippers beat the Trail Blazers 122-117 on Wednesday night in the final game for both teams before the All-Star break."}
{"game_id": "0021300789", "chunk_id": "0021300789_002", "order": 2, "role": "body", "text": "The Clippers, who set a franchise record for largest victory Sunday in their 45-point thrashing of Philadelphia, converted 16 Portland turnovers into 20 points during a nip-and-tuck affair that included 40 lead changes.\n\"We were up one, down one, up one,\" Paul said. \"I told them in the timeout: 'Fellas, we need to get a score and a stop.' I told B.G. if we get a score and a stop, it changes the whole game. It was frustrating because it was me making mistakes on defense, and they were getting shots. But all in all, it was a good win for us.\"\nThe Clippers won for the 14th time in 19 games since Jan. 4, when the Spurs handed them their worst loss of the season, 116-92 in San Antonio. Paul made 10 of 15 shots in his second game back after missing 18 with a separated right shoulder.\n\"It's definitely not (100 percent),\" he said. \"But as long as I'm not hindering my team and my teammates, I feel I can be effective out there.\"\nJamal Crawford added 25 points for the defending Pacific Division champions, who go into All-Star weekend 37-18 -- their second-best winning percentage at the break in franchise history. They were 39-17 last season, when they finished 56-26 and won their first division title.\nLos Angeles and Portland are each 5½ games behind Oklahoma City for the best record in the Western Conference.\n\"I'm in a great place, as far as our team going into the break,\" Paul said. \"It's one of the best feelings I've had about a team since I've been in the league, just strictly because of defense. The biggest thing with us is that everyone has bought into the defensive end. We understand that we can score every night, but it's going to be our defense that carries us.\"\nLaMarcus Aldridge scored 25 points and Damian Lillard had 21 for the Blazers, who are 5-8 since a five-game winning streak last month. The loss was their fifth straight to the Clippers at Staples Center."}
{"game_id": "0021300789", "chunk_id": "0021300789_003", "order": 3, "role": "closing", "text": "Clippers center DeAndre Jordan had a miserable time trying to guard Aldridge in the first quarter, as the 6-foot-11 power forward made six of seven shots -- one night after going 5 for 22 from the field and scoring 12 points in Portland's 98-95 home loss to Oklahoma City.\n\"It's tough, especially going into the break,\" Lillard said. \"You want to go into it with some momentum and on a good note. We played two good games, but we just weren't able to pull either game out.\"\nAll of Aldridge's first six baskets against the Clippers came from at least 17 feet away, including a 3-pointer that gave the Blazers a 30-25 lead with 1:42 left in the period.\n\"It's the NBA. You're not going to completely stop somebody from scoring,\" Jordan said. \"I think they lead the league in scoring, but we did our best job tonight and we got stops when it counted.\"\nLos Angeles then went on a 12-0 run to go ahead 37-30 with 10:50 left in the second quarter, as backup point guard Darren Collison capped the rally with a layup and two free throws. Less than 7½ minutes later, Griffin outleaped 7-1 center Meyers Leonard on a lob above the basket by Paul and finished the alley-oop for a 53-52 edge with 3:28 left in the half.\n\"Blake's dominance is something that we need. He's been our MVP all season long,\" Paul said. \"I keep telling him: 'I don't want to stop that. I don't want to hinder that. I just want to be a part of it.'\"\nGame notes\nJordan had six rebounds in 37 minutes, ending his double-digit streak at 31 games. The franchise record is 42 by Swen Nater in 1977-78. ... Portland came in averaging an NBA-best 107.7 points, and the Clippers were second with 106.7 per game. ... The Blazers are the only team in the league to have the same starting lineup in every game -- Aldridge, Lillard, Wesley Matthews, Nicolas Batum and Robin Lopez. They all scored in double figures. ... Paul, who will be playing in his seventh All-Star game, scored his 11,000th career point on a short running jumper with 5:52 remaining. His 113 double-doubles since the start of the 2010-11 season are the most by any point guard during that stretch. ... Seven of Portland's next eight games are at home, where the Blazers are 19-6."}
