{"game_id": "0021300272", "chunk_id": "0021300272_001", "order": 1, "role": "lead", "text": "Milwaukee --  Detroit Pistons point guard Brandon Jennings had tried to dismiss Wednesday night's matchup against his former team as simply another game on the team's schedule."}
{"game_id": "0021300272", "chunk_id": "0021300272_002", "order": 2, "role": "body", "text": "The closer it got to tipoff against the Milwaukee Bucks, the harder that became."}
{"game_id": "0021300272", "chunk_id": "0021300272_003", "order": 3, "role": "body", "text": "\"I was nervous in the beginning because I'm not used to being on the other side,\" Jennings said. \"There were a lot of emotions going on. The whole time I felt like it was just another game. But once it got closer to game time, my nerves were just going.\""}
{"game_id": "0021300272", "chunk_id": "0021300272_004", "order": 4, "role": "body", "text": "Jennings struggled considerably in the first half, but finished with 17 points and 11 assists in helping the Pistons to a 105-98 win over the Bucks in his return to Milwaukee."}
{"game_id": "0021300272", "chunk_id": "0021300272_005", "order": 5, "role": "body", "text": "\"Once the second half started, I settled down and just played basketball,\" Jennings said."}
{"game_id": "0021300272", "chunk_id": "0021300272_006", "order": 6, "role": "body", "text": "Andre Drummond had 24 points and 19 rebounds and the Pistons rode a strong second half to victory. Greg Monroe contributed 18 points and 17 rebounds for the Pistons, who had five players score 15 or more points."}
{"game_id": "0021300272", "chunk_id": "0021300272_007", "order": 7, "role": "body", "text": "\"Going into the game, we were really concerned about matchups,\" Bucks coach Larry Drew said. \"We felt they were just too big and we'd have to mix our defenses up and hopefully outrebound those guys. We just could not physically overcome that size.\""}
{"game_id": "0021300272", "chunk_id": "0021300272_008", "order": 8, "role": "body", "text": "Detroit hadn't had two players pull down at least 15 rebounds apiece since Feb. 10, 2005, when Ben Wallace and Rasheed Wallace accomplished the feat."}
{"game_id": "0021300272", "chunk_id": "0021300272_009", "order": 9, "role": "body", "text": "\"We're starting to jell, starting to find ourselves and an identity,\" Drummond said. \"The first half was tough for us. We let the fatigue get to us a little bit.\""}
{"game_id": "0021300272", "chunk_id": "0021300272_010", "order": 10, "role": "body", "text": "That led to a change of strategy in the second half."}
{"game_id": "0021300272", "chunk_id": "0021300272_011", "order": 11, "role": "body", "text": "\"We got it down low because we knew our jump shots weren't really going to fall because our legs were tired. So we drove to the hoop and got the foul calls,\" Drummond said."}
{"game_id": "0021300272", "chunk_id": "0021300272_012", "order": 12, "role": "body", "text": "Detroit shot 42 foul shots and Milwaukee had 22."}
{"game_id": "0021300272", "chunk_id": "0021300272_013", "order": 13, "role": "body", "text": "Jennings spent four seasons with the Bucks after the team drafted him 10th overall in 2009 out of Oak Hill Academy. He joined the Pistons in July after a sign-and-trade deal that sent Brandon Knight and Khris Middleton to the Bucks. A restricted free-agent at the time, Jennings inked a three-year, $24 million deal with the Pistons."}
{"game_id": "0021300272", "chunk_id": "0021300272_014", "order": 14, "role": "body", "text": "The sparse crowd at the BMO Harris Bradley Center booed loudly when Jennings was introduced before the game and each time he touched the ball early in the contest. Jennings missed all four of his shots from the field in the first quarter but had two early assists that led to dunks."}
{"game_id": "0021300272", "chunk_id": "0021300272_015", "order": 15, "role": "body", "text": "\"The boos didn't hurt,\" Jennings said. \"I still have a lot of fans here. At the end of the day, the fans supported us through the good and bad. It didn't bother me.\""}
{"game_id": "0021300272", "chunk_id": "0021300272_016", "order": 16, "role": "body", "text": "Jennings didn't score until sinking a 3-pointer from the top of the key with 3:03 remaining in the second quarter. He finished 4 of 16 from the field."}
{"game_id": "0021300272", "chunk_id": "0021300272_017", "order": 17, "role": "body", "text": "\"We tried to get him a basket early to kind of settle him down a little bit,\" Pistons coach Maurice Cheeks said. \"But he missed a couple shots that he normally makes.\""}
{"game_id": "0021300272", "chunk_id": "0021300272_018", "order": 18, "role": "body", "text": "In the first meeting between the teams on Nov. 25 in Detroit, Jennings had 15 points and 13 assists, including four of six from 3-point range, in sparking Detroit to a 113-94 win."}
{"game_id": "0021300272", "chunk_id": "0021300272_019", "order": 19, "role": "body", "text": "\"Brandon handled himself like a professional,\" Drummond said. \"He got booed, but it's all part of the game.\""}
{"game_id": "0021300272", "chunk_id": "0021300272_020", "order": 20, "role": "body", "text": "Ersan Ilyasova, who has been plagued by injuries that include a sore ankle, scored a season high 22 points, including 16 in the first half, and had 10 rebounds off the bench to lead the Bucks, who have lost 13 of 14. Middleton added 14 points for Milwaukee."}
{"game_id": "0021300272", "chunk_id": "0021300272_021", "order": 21, "role": "body", "text": "\"It's the first time I feel healthy. My ankle is getting better,\" Ilyasova said. We have to find a way to play much better. We have to come together and find a way to win games.\""}
{"game_id": "0021300272", "chunk_id": "0021300272_022", "order": 22, "role": "body", "text": "The Pistons trailed by five at the half, but used a 16-0 run midway through the third quarter to take a 10-point lead."}
{"game_id": "0021300272", "chunk_id": "0021300272_023", "order": 23, "role": "body", "text": "The Bucks got within five points on Knight's 3 with 1:36 remaining in the game, but that's as close as they would get."}
{"game_id": "0021300272", "chunk_id": "0021300272_024", "order": 24, "role": "body", "text": "Ekpe Udoh had five blocked shots in the second quarter for Milwaukee, tying his career high. He finished with six."}
{"game_id": "0021300272", "chunk_id": "0021300272_025", "order": 25, "role": "body", "text": "The Bucks used a 15-1 run to open a 38-31 second-quarter lead and held at 50-45 advantage at halftime. Detroit made just 33 percent of its shots over the first two quarters."}
{"game_id": "0021300272", "chunk_id": "0021300272_026", "order": 26, "role": "closing", "text": "Game notes Police issued municipal citations to Bucks center Larry Sanders for disorderly conduct and assault and battery stemming from a fight last month at a downtown Milwaukee nightclub. Drew had no comment when asked about the citations. Sanders had surgery on his right thumb on Nov. 11 after getting hurt during the scrum. He initially was expected to be out four to six weeks. Drew on Wednesday had no update on a timetable for Sanders' return. ... Pistons guard Chauncey Billups remained sidelined with left knee tendinitis and guard Will Bynum was inactive with an adductor strain."}
