{"game_id": "0021700476", "chunk_id": "0021700476_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  With Dwight Howard going out early, Kemba Walker did his best to give the Charlotte Hornets a chance to grab a road victory against the Milwaukee Bucks."}
{"game_id": "0021700476", "chunk_id": "0021700476_002", "order": 2, "role": "body", "text": "But when Walker went down with an apparent injury late in the fourth quarter, the Bucks capitalized, closing on a 9-0 run for a 109-104 victory Friday night."}
{"game_id": "0021700476", "chunk_id": "0021700476_003", "order": 3, "role": "body", "text": "\"This was a tough game,\" Bucks coach Jason Kidd said. \"There were a lot of emotions in the last game we played. Charlotte is playing extremely well and hard, especially with their coach out. ... They were right there and we found a way down the stretch to make plays on both ends.\""}
{"game_id": "0021700476", "chunk_id": "0021700476_004", "order": 4, "role": "body", "text": "After Walker gave Charlotte a 104-100 lead with 2:24 remaining, Milwaukee held the Hornets scoreless the rest of the way. The Bucks tied it on dunks by Giannis Antetokounmpo and Khris Middleton and took the lead on Eric Bledsoe's layup."}
{"game_id": "0021700476", "chunk_id": "0021700476_005", "order": 5, "role": "body", "text": "Middleton scored 28 points, Antetokounmpo had 26, and Bledsoe had 24 points and 10 assists in the first game of the home-and-home set."}
{"game_id": "0021700476", "chunk_id": "0021700476_006", "order": 6, "role": "body", "text": "Walker had 32 points before leaving with an apparent injury after losing the ball and falling to the floor with the game tied at 104 with 1:42 to play. He also went to the ground in pain in front of the Hornets bench just 39 seconds into the fourth quarter and did not return until there was 5:37 left."}
{"game_id": "0021700476", "chunk_id": "0021700476_007", "order": 7, "role": "body", "text": "\"That's tough for them,\" Middleton said. \"He's their leader, he's their fourth-quarter player and late-game player, makes big shots and big plays for them, so we got a little luck with him going out. We did a great job of taking advantage."}
{"game_id": "0021700476", "chunk_id": "0021700476_008", "order": 8, "role": "body", "text": "The Hornets did not provide an update as to why Walker left the game. Howard played just five minutes after dislocating his left ring finger in the first quarter."}
{"game_id": "0021700476", "chunk_id": "0021700476_009", "order": 9, "role": "body", "text": "Hornets interim coach Stephen Silas was unsure as to if either of his top two scorers would play when the two teams meet in Charlotte on Saturday."}
{"game_id": "0021700476", "chunk_id": "0021700476_010", "order": 10, "role": "body", "text": "\"Those are our two main guys,\" Silas said. \"If we could get healthy, and try to figure out the (Bucks) small lineup, I don't think we did a good job of that today.\""}
{"game_id": "0021700476", "chunk_id": "0021700476_011", "order": 11, "role": "body", "text": "Former University of Wisconsin star Frank Kaminsky added 16 points for Charlotte, and Marvin Williams had 15 points and 10 rebounds."}
{"game_id": "0021700476", "chunk_id": "0021700476_012", "order": 12, "role": "body", "text": "The Hornets opened a 75-64 lead with 5:50 left in the third quarter. Milwaukee then went on a 12-0 run to take a 76-75 advantage on Middleton's dunk with 3:16 left in the third."}
{"game_id": "0021700476", "chunk_id": "0021700476_013", "order": 13, "role": "body", "text": "Milwaukee took the lead twice in the final minute of the third quarter, but Walker answered with 3-pointers each time to give the Hornets an 85-83 lead heading to the fourth."}
{"game_id": "0021700476", "chunk_id": "0021700476_015", "order": 15, "role": "body", "text": "Hornets: Kaminsky received a loud ovation when he checked into the game for the first time. ... Guard Treveon Graham missed a third consecutive game due to back spasms."}
{"game_id": "0021700476", "chunk_id": "0021700476_016", "order": 16, "role": "body", "text": "Bucks: Guard Tony Snell returned to the starting lineup after coming off the bench in his first game back from left patellar tendinitis. ...  Signed to a two-way contract Monday, Sean Kilpatrick made his Bucks debut, scoring five points in 10 minutes."}
{"game_id": "0021700476", "chunk_id": "0021700476_018", "order": 18, "role": "body", "text": "Howard suffered the injury less than two minutes into the game and temporarily stayed in after having the finger taped during a timeout."}
{"game_id": "0021700476", "chunk_id": "0021700476_019", "order": 19, "role": "body", "text": "He exited with 7:24 left in the first quarter and did not return."}
{"game_id": "0021700476", "chunk_id": "0021700476_020", "order": 20, "role": "body", "text": "\"I have no idea what happened,\" Howard said. \"I went to take the ball out, I looked down and my finger was bent all the way to the side. They put it back in place, I went back in to play, but it just kept popping out.\""}
{"game_id": "0021700476", "chunk_id": "0021700476_022", "order": 22, "role": "body", "text": "Kidd was named a nominee for the Naismith Basketball Hall of Fame Class of 2018 on Thursday. Finalists will be announced during NBA All-Star Weekend in February, with the Class of 2018 unveiled at the NCAA Final Four in April."}
{"game_id": "0021700476", "chunk_id": "0021700476_024", "order": 24, "role": "closing", "text": "The teams meet again in Charlotte on Saturday night."}
