{"game_id": "0021400815", "chunk_id": "0021400815_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  It hardly took any time at all for Thaddeus Young to get comfortable playing with his new teammates, and vice versa."}
{"game_id": "0021400815", "chunk_id": "0021400815_002", "order": 2, "role": "body", "text": "Joe Johnson scored 23 points and reserve Brook Lopez added 22, leading Young and the Brooklyn Nets to a 114-105 victory over the skidding Los Angeles Lakers on Friday night."}
{"game_id": "0021400815", "chunk_id": "0021400815_003", "order": 3, "role": "body", "text": "Young had eight points in 12 minutes off the bench in his Nets debut after Thursday's trade that sent Kevin Garnett to Minnesota, where the 2004 NBA MVP and 15-time All-Star spent his first 12 seasons."}
{"game_id": "0021400815", "chunk_id": "0021400815_004", "order": 4, "role": "body", "text": "\"I think he's going to be great,\" Johnson said about Young. \"He just has to get familiar with the system, but he's definitely the kind of player that fits our mode. So he's definitely going to help us.\""}
{"game_id": "0021400815", "chunk_id": "0021400815_005", "order": 5, "role": "body", "text": "Young averaged 14.3 points in 48 starts with the Timberwolves after spending his first seven pro seasons with Philadelphia -- two of them as a reserve."}
{"game_id": "0021400815", "chunk_id": "0021400815_006", "order": 6, "role": "body", "text": "\"They kept it pretty simple for me -- all simple, basic basketball stuff. So it was fairly easy for me to just go out there and play with those guys,\" Young said. \"It's all about getting a feel for them and playing basketball. Over the course of time, being in this league, you become familiar with all the guys. We're all brothers, anyway.\""}
{"game_id": "0021400815", "chunk_id": "0021400815_007", "order": 7, "role": "body", "text": "Young, the 12th overall pick in the 2007 draft by the 76ers, was involved in a three-team trade last August in which Kevin Love was sent from Minnesota to Cleveland."}
{"game_id": "0021400815", "chunk_id": "0021400815_008", "order": 8, "role": "body", "text": "\"He didn't play extended minutes. But for not knowing any of the plays and not having a shootaround or a meeting with us, I thought he played really well,\" Nets point guard Deron Williams said. \"He looked good, and he's going to be great for us as he gets more acclimated to the team.\""}
{"game_id": "0021400815", "chunk_id": "0021400815_009", "order": 9, "role": "body", "text": "Williams had 15 assists and 12 points in his first start since Dec. 19, helping the Nets end a three-game slide midway through their eight-game road trip. It was the first game back for both teams following the All-Star break."}
{"game_id": "0021400815", "chunk_id": "0021400815_010", "order": 10, "role": "body", "text": "\"I just wanted to be aggressive,\" Williams said. \"I stopped being aggressive somewhere along the line this season, and trying to get back to that. It doesn't matter what happened in the first half of the season. This is a new half.\""}
{"game_id": "0021400815", "chunk_id": "0021400815_011", "order": 11, "role": "body", "text": "Jeremy Lin scored 11 of his 18 points in the fourth quarter, and Ed Davis had 16 points and 14 rebounds. Four others scored in double figures for the Lakers, who have dropped seven straight and 16 of 17. The only victory during that stretch was in double overtime against Chicago on Jan. 29 at Staples Center."}
{"game_id": "0021400815", "chunk_id": "0021400815_012", "order": 12, "role": "body", "text": "\"This is a game that we could have won. We should have won, but we had a lapse in the third quarter,\" Davis said. \"We have to keep fighting, stick together through these tough times and those tough stretches.\""}
{"game_id": "0021400815", "chunk_id": "0021400815_013", "order": 13, "role": "body", "text": "Los Angeles center Jordan Hill, who missed the previous five games with a hip flexor strain, came off the bench for the first time this season and had 12 points and 10 rebounds in 29 minutes."}
{"game_id": "0021400815", "chunk_id": "0021400815_014", "order": 14, "role": "body", "text": "The Lakers led 57-56 at halftime after shooting 51.1 percent, but Alan Anderson and Johnson hit 3-pointers 63 seconds apart to help the Nets open a 67-59 margin with 9:38 left in the third. They outscored Los Angeles 17-4 over the final 4:20 of the quarter before increasing their lead to 22 on Markel Brown's two free throws with 9:22 remaining."}
{"game_id": "0021400815", "chunk_id": "0021400815_015", "order": 15, "role": "body", "text": "\"We made shots. That was the main thing,\" Johnson said. \"We had great ball movement, guys were attacking and making plays, and we were knocking down shots. I had some great looks. I thought Deron did a great job of facilitating tonight, and I just took my time on my shots.\""}
{"game_id": "0021400815", "chunk_id": "0021400815_016", "order": 16, "role": "body", "text": "Lin answered with a 17-footer and teammate Nick Young added a 20-footer for his first field goal of the night after missing his first five shots. Those baskets triggered a 19-4 run that sliced Brooklyn's margin to 107-100 with 2:29 to play. But that was as close as the Lakers got, despite holding the Nets to two field goals over the final 8:03."}
{"game_id": "0021400815", "chunk_id": "0021400815_017", "order": 17, "role": "body", "text": "\"That's kind of been us all year -- having a big lead and letting teams back in it,\" Johnson said. \"They were home and they made a little push, but we were able to pull it out at the end.\""}
{"game_id": "0021400815", "chunk_id": "0021400815_020", "order": 20, "role": "body", "text": "Nets: The Nets lost 11 straight to the Lakers before beating them 108-102 in the previous meeting last Feb. 23. ... G Jarrett Jack missed the game because of a sore left hamstring, leaving F Mason Plumlee and Anderson as the only players to appear in all 53 games with the club this season."}
{"game_id": "0021400815", "chunk_id": "0021400815_021", "order": 21, "role": "body", "text": "Lakers: Byron Scott's first head coaching job in the NBA was with the Nets, who were 26-56 in his inaugural season before reaching the NBA Finals the next two years. ... Shooting guard Wayne Ellington was 0 for 7 from 3-point range. ... The Lakers have a rematch with the Nets on March 29 in Brooklyn."}
{"game_id": "0021400815", "chunk_id": "0021400815_024", "order": 24, "role": "closing", "text": "Lakers: Host Boston on Sunday."}
