{"game_id": "0021700336", "chunk_id": "0021700336_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  This is why Minnesota acquired Jimmy Butler in the offseason. And not just for the scoring, although that certainly helped Sunday night."}
{"game_id": "0021700336", "chunk_id": "0021700336_002", "order": 2, "role": "body", "text": "Butler scored 20 of his 33 points in the fourth quarter to help Minnesota outlast the Los Angeles Clippers 112-106. After the game, though, her spent more time bemoaning the defensive breakdowns -- a common sight in these parts for the past several years."}
{"game_id": "0021700336", "chunk_id": "0021700336_003", "order": 3, "role": "body", "text": "\"We've got to start guarding somebody,\" Butler said. \"It's really bad, it's really noticeable, and everybody capitalizes on it. But lucky enough, if your shot's falling you can still win. But good gracious, if it's not, I'd hate to see which way this game could've went.\""}
{"game_id": "0021700336", "chunk_id": "0021700336_004", "order": 4, "role": "body", "text": "Sounds an awful lot like his defensive-minded coach, Tom Thibodeau, who's trying to solve Minnesota's defensive woes as it looks to turn around a culture of losing. Thibodeau looked and sounded just as downcast as he has after losses."}
{"game_id": "0021700336", "chunk_id": "0021700336_005", "order": 5, "role": "body", "text": "\"The miscommunication, the awareness, we're talking to each other and they're racing the ball up the floor,\" he said of several breakdowns that led to easy Clippers baskets in the fourth quarter. \"The fourth quarter is so different, and we have a lot to do in that area.\""}
{"game_id": "0021700336", "chunk_id": "0021700336_006", "order": 6, "role": "body", "text": "The Wolves overcame a season-high 30 points from Austin Rivers, who matched his career best with seven 3-pointers. Rivers' final 3-pointer gave L.A. a 92-91 lead with 6:54 to play before Butler scored nine in a row to send the Clippers to their third straight loss."}
{"game_id": "0021700336", "chunk_id": "0021700336_007", "order": 7, "role": "body", "text": "Minnesota led for most of the game but couldn't manage a serious run, mostly due to Rivers' shooting. Rivers hit three 3-pointers in the final five minutes of the first half to keep the Clippers close. He had a career-high 20 points in the half."}
{"game_id": "0021700336", "chunk_id": "0021700336_008", "order": 8, "role": "body", "text": "\"I just got good looks early and once you see a couple go in, it goes from there,\" Rivers said. \"Once you make a couple, even the tough ones seem easy, or at least in my mind.\""}
{"game_id": "0021700336", "chunk_id": "0021700336_009", "order": 9, "role": "body", "text": "The back and forth continued for most of the second half, and a couple of Minnesota defensive lapses led to easy layups and a wide-open dunk by Montrezl Harrell to give Los Angeles an 84-83 lead with 9:12 to go."}
{"game_id": "0021700336", "chunk_id": "0021700336_010", "order": 10, "role": "body", "text": "Rivers' seventh 3-pointer gave the Clippers a one-point lead, but Butler took over from there, hitting a free throw, 3-pointer and short jumper before converting a 3-point play to give the Wolves some breathing room."}
{"game_id": "0021700336", "chunk_id": "0021700336_011", "order": 11, "role": "body", "text": "\"I mean, if I make a couple shots,\" Butler said, \"why not keep shooting the ball?\""}
{"game_id": "0021700336", "chunk_id": "0021700336_012", "order": 12, "role": "body", "text": "His teammates certainly didn't mind."}
{"game_id": "0021700336", "chunk_id": "0021700336_013", "order": 13, "role": "body", "text": "\"That shows you why he's such an elite player in this league,\" Karl-Anthony Towns said. \"I was glad to have the popcorn right there and have a front row seat for it because it was amazing.\""}
{"game_id": "0021700336", "chunk_id": "0021700336_015", "order": 15, "role": "body", "text": "Rookies Jamil Wilson and C.J. Williams made their first career starts. Wilson finished with nine points and Williams five. The Clippers were missing four of their opening-night starters, but it wasn't obvious from the close score. And L.A.'s bench outscored Minnesota's 43-23."}
{"game_id": "0021700336", "chunk_id": "0021700336_016", "order": 16, "role": "body", "text": "\"Overall, I'm upset\" coach Doc Rivers said. \"I mean, you want to win the game. But I loved how we played. It's amazing how much better we got in one night. That's what I would take.\""}
{"game_id": "0021700336", "chunk_id": "0021700336_018", "order": 18, "role": "body", "text": "Clippers: Doc Rivers said F Danilo Gallinari (strained left glute) would play 3-on-3 and could be close to returning. \"He'll play in the next couple, two to three games will be my guess,\" Rivers said. Gallinari, who's averaging 12.8 points, missed his 13th game due to the injury. ... Lou Williams had 23 points off the bench, and DeAndre Jordan had 17, including some big dunks in the fourth."}
{"game_id": "0021700336", "chunk_id": "0021700336_019", "order": 19, "role": "body", "text": "Timberwolves: Thibodeau reached 300 career victories. He's 300-200. ... Taj Gibson had 20 points, and Towns had 15 points and 12 rebounds for his NBA-leading 19th double-double. ... F Nemanja Bjelica missed his sixth straight game since spraining his left foot. He's dressed for the last four games. ... Jamal Crawford scored 12 points in his first game against his old team. Crawford played five seasons for the Clippers. ... The Wolves have beaten the Clippers three straight times."}
{"game_id": "0021700336", "chunk_id": "0021700336_021", "order": 21, "role": "body", "text": "Clippers: Host Minnesota on Wednesday night."}
{"game_id": "0021700336", "chunk_id": "0021700336_022", "order": 22, "role": "closing", "text": "Timberwolves: At Memphis on Monday night."}
