{"game_id": "0021200394", "chunk_id": "0021200394_001", "order": 1, "role": "lead", "text": "HOUSTON --  Houston coach Kevin McHale figured the best way to beat the Memphis Grizzlies was to get down the court before they could get their dominant defense set."}
{"game_id": "0021200394", "chunk_id": "0021200394_003", "order": 3, "role": "body", "text": "James Harden scored 31 points with eight assists, and the Rockets earned their third straight win, 121-96 over the Grizzlies on Saturday night."}
{"game_id": "0021200394", "chunk_id": "0021200394_004", "order": 4, "role": "body", "text": "Memphis entered the game allowing an NBA-low 89.2 points a game. But the Grizzlies had no answer for Harden. He did all his scoring in the first three quarters and reached at least 20 points for an eighth straight game."}
{"game_id": "0021200394", "chunk_id": "0021200394_005", "order": 5, "role": "body", "text": "\"It's easier getting them early than it is going against the defense and trying to get something in the last five seconds of the shot clock,\" McHale said. \"That's where they really get into you.\""}
{"game_id": "0021200394", "chunk_id": "0021200394_006", "order": 6, "role": "body", "text": "Houston used a big run midway through the second quarter to take the lead, and didn't trail after that to break a four-game winning streak by the Grizzlies."}
{"game_id": "0021200394", "chunk_id": "0021200394_007", "order": 7, "role": "body", "text": "\"We know how physical they are,\" Harden said. \"They like to pound the ball in the paint and get easy layups. It was our job to push the tempo, get stops, and get in transition.\""}
{"game_id": "0021200394", "chunk_id": "0021200394_008", "order": 8, "role": "body", "text": "Mike Conley had 16 points for the Grizzlies on a night when leading scorer Rudy Gay finished with a season-low six points."}
{"game_id": "0021200394", "chunk_id": "0021200394_009", "order": 9, "role": "body", "text": "\"We tried to play their game, and they are obviously better at it than us playing at that pace,\" Memphis center Marc Gasol said. \"They beat us in every aspect of the game.\""}
{"game_id": "0021200394", "chunk_id": "0021200394_010", "order": 10, "role": "body", "text": "Memphis hadn't allowed 100 points since the Clippers scored 101 in the season-opener -- an NBA-best streak of 23 games."}
{"game_id": "0021200394", "chunk_id": "0021200394_011", "order": 11, "role": "body", "text": "The Rockets needed just over three quarters to reach the mark, hitting it with a free throw by Jeremy Lin with 9½ minutes left that made it 100-80."}
{"game_id": "0021200394", "chunk_id": "0021200394_012", "order": 12, "role": "body", "text": "\"I think tonight we showed how explosive we can be offensively because we put 120 points on a team that hasn't allowed over 100 since the first game of the season,\" Lin said. \"This is just a testament to people moving and passing the ball.\""}
{"game_id": "0021200394", "chunk_id": "0021200394_013", "order": 13, "role": "body", "text": "It was the Rockets' 13th straight home victory over the Grizzlies. Memphis hasn't won in Houston since April 2006."}
{"game_id": "0021200394", "chunk_id": "0021200394_014", "order": 14, "role": "body", "text": "Lin added 15 points and a season-high tying 11 assists, and Marcus Morris scored 16 points."}
{"game_id": "0021200394", "chunk_id": "0021200394_015", "order": 15, "role": "body", "text": "The Rockets took advantage of their speed in this one, outscoring Memphis 33-3 on fast breaks in the Grizzlies' most lopsided loss of the season."}
{"game_id": "0021200394", "chunk_id": "0021200394_016", "order": 16, "role": "body", "text": "\"They were tired,\" Lin said of the Grizzlies, who beat Dallas on Friday night. \"So we wanted to make sure ... that we got the ball out and just run as fast as we can.\""}
{"game_id": "0021200394", "chunk_id": "0021200394_017", "order": 17, "role": "body", "text": "Memphis coach Lionel Hollins was disappointed in his team's effort."}
{"game_id": "0021200394", "chunk_id": "0021200394_018", "order": 18, "role": "body", "text": "\"We just had no juice, no energy, and were not mentally tough,\" he said. \"We just kind of packed it in early.\""}
{"game_id": "0021200394", "chunk_id": "0021200394_019", "order": 19, "role": "body", "text": "The Rockets led by 15 points late in the third quarter when Harden found Greg Smith in the lane for a dunk. Quincy Pondexter made a layup on the other end before Carlos Delfino knocked down a 3-pointer from 2 feet behind the line to extend the lead to 94-76."}
{"game_id": "0021200394", "chunk_id": "0021200394_020", "order": 20, "role": "body", "text": "Zach Randolph made a layup for Memphis to end the quarter with Houston up 94-78."}
{"game_id": "0021200394", "chunk_id": "0021200394_021", "order": 21, "role": "body", "text": "The Rockets had a six-point lead before Harden scored seven straight points to push Houston's lead to 77-64 with seven minutes left in the third quarter. He started the run with a three-point play before jumping in front of a pass and taking it the distance for a layup."}
{"game_id": "0021200394", "chunk_id": "0021200394_022", "order": 22, "role": "body", "text": "The Grizzlies led by three points with about nine minutes left in the second quarter before Houston used a 13-3 run powered by six points from Omer Asik to take a 48-41 lead."}
{"game_id": "0021200394", "chunk_id": "0021200394_023", "order": 23, "role": "body", "text": "Memphis cut its deficit to four later in the quarter. This time, the Rockets used a 12-6 spurt to extend their lead to 64-54 at halftime."}
{"game_id": "0021200394", "chunk_id": "0021200394_024", "order": 24, "role": "closing", "text": "Game notes The Rockets recalled G Scott Machado from the D-League Rio Grande Valley Vipers before the game. ... Asik had 14 points and 12 rebounds for his 12th double-double of the season. ...  Houston is 7-1 when Harden scores at least 30 points. ... Randolph finished with 10 points and 10 rebounds for his 21st double-double this season, which leads the league. ... Houston's 32 assists were a season-high."}
