{"game_id": "0021700166", "chunk_id": "0021700166_001", "order": 1, "role": "lead", "text": "HOUSTON --  James Harden was quick to say yes when asked if he's playing at as high of a level as he ever has."}
{"game_id": "0021700166", "chunk_id": "0021700166_002", "order": 2, "role": "body", "text": "The follow up question of why wasn't quite as easy for Houston's bearded star."}
{"game_id": "0021700166", "chunk_id": "0021700166_003", "order": 3, "role": "body", "text": "\"I don't know,\" he said before letting out an awkward laugh and looking around before continuing. \"Work. Try to study the game and get better. Listen to people around me that push me and motivate me and try to be the best I can be. It's pretty simple.\""}
{"game_id": "0021700166", "chunk_id": "0021700166_004", "order": 4, "role": "body", "text": "Harden had a triple-double of 35 points, 11 rebounds and 13 assists to help the Rockets beat the Cleveland Cavaliers 117-113 on Thursday night."}
{"game_id": "0021700166", "chunk_id": "0021700166_005", "order": 5, "role": "body", "text": "Harden also had five steals and a block as Houston extended its winning streak to four games."}
{"game_id": "0021700166", "chunk_id": "0021700166_006", "order": 6, "role": "body", "text": "LeBron James had 33 points for the Cavaliers, and Jeff Green added 27."}
{"game_id": "0021700166", "chunk_id": "0021700166_007", "order": 7, "role": "body", "text": "Houston led by seven after a layup by James with about 10 minutes left. The Rockets scored the next six points, capped by a 3-pointer by P.J. Tucker to make it 111-98. The Cavaliers used a 13-1 run, with five points from James, to cut the lead to 112-111 with 90 seconds left."}
{"game_id": "0021700166", "chunk_id": "0021700166_008", "order": 8, "role": "body", "text": "Harden missed a layup after that, but grabbed a rebound and threw an alley-oop to Clint Capela, who finished for Houston's first basket since Tucker's 3. He was fouled on the play and made the free throw to make it 115-11 with just over a minute remaining."}
{"game_id": "0021700166", "chunk_id": "0021700166_009", "order": 9, "role": "body", "text": "James made a layup on the other end, but Capela made another basket after a grabbing the rebound on a miss by Harden to put Houston back up by 4 with 10.7 seconds left."}
{"game_id": "0021700166", "chunk_id": "0021700166_010", "order": 10, "role": "body", "text": "Capela, who finished with 19 points, 13 rebounds and four blocks, blocked a shot by James in the final seconds to secure the win."}
{"game_id": "0021700166", "chunk_id": "0021700166_011", "order": 11, "role": "body", "text": "\"We expect him to do that,\" coach Mike D'Antoni said about Capela's solid performance. \"He's 23 years old. There's no reason why he can't keep getting better.\""}
{"game_id": "0021700166", "chunk_id": "0021700166_012", "order": 12, "role": "body", "text": "The Cavaliers have lost six of their last eight games, leaving James to answer question about why they're struggling."}
{"game_id": "0021700166", "chunk_id": "0021700166_013", "order": 13, "role": "body", "text": "\"We played a pretty good game, but I'm not here for moral victories,\" he said. \"That's not what I'm about.\""}
{"game_id": "0021700166", "chunk_id": "0021700166_014", "order": 14, "role": "body", "text": "Harden has scored 30 or more points in three of the last four games, highlighted by a 56-point performance in a win over the Jazz on Sunday. It's the second triple-double of the season for Harden and the 33rd of his career."}
{"game_id": "0021700166", "chunk_id": "0021700166_015", "order": 15, "role": "body", "text": "\"I thought our guys really scrapped and competed,\" Cleveland coach Tyronn Lue said. \"But Harden was Harden. He made some tough, contested 3s off the dribble, which we wanted. We contested all of them, but he made some big shots.\""}
{"game_id": "0021700166", "chunk_id": "0021700166_016", "order": 16, "role": "body", "text": "The Rockets made the first seven points of the second half thanks to a three-pointer by Eric Gordon and a four-point play by Trevor Ariza to take a 72-67 lead."}
{"game_id": "0021700166", "chunk_id": "0021700166_017", "order": 17, "role": "body", "text": "Cleveland got going soon after that and a layup by Iman Shumpert got the Cavaliers within 1 point soon after that. But Harden made two 3-pointers to power an 8-2 run that extended Houston's lead to 81-74 lead with about 7 1/2 minutes left in the quarter."}
{"game_id": "0021700166", "chunk_id": "0021700166_018", "order": 18, "role": "body", "text": "The Cavaliers scored five quick points, capped by a 3-pointer by Green, to tie it at 87-87 about three minutes later. A 3-point play by Gordon put Houston back on top and the Rockets had extended their lead to 100-93 entering the fourth quarter."}
{"game_id": "0021700166", "chunk_id": "0021700166_020", "order": 20, "role": "body", "text": "Cavaliers: G Derrick Rose sat out because of soreness in his left ankle. Rose missed four straight games after spraining his ankle on Oct. 20 before returning to play the last two. But the ankle was still bothering him, forcing him to sit out again on Thursday night. ...  Shumpert started in his place and finished with seven points. .. Love had 17 points before fouling out in the fourth quarter."}
{"game_id": "0021700166", "chunk_id": "0021700166_021", "order": 21, "role": "body", "text": "Rockets: F Luc Mbah a Moute missed because of a bruised left knee. ... Gordon added 20 points. ... Harden made 13 of 14 free throws."}
{"game_id": "0021700166", "chunk_id": "0021700166_023", "order": 23, "role": "body", "text": "World Series MVP George Springer, who led the Houston Astros to their first championship last week, was at the Toyota Center Thursday to take part in the Rockets' First Shot promotion. Before the tipoff of each game, a local celebrity shoots a free throw for charity. A made shot gets a $5,000 donation from new owner Tilman Fertitta and the Clutch City Foundation, while a miss earns the shooter's charity $1,000. While Springer didn't miss too many balls while hitting .379 with five homers and seven RBI during the World Series, he wasn't nearly as good on the basketball court as he missed Thursday's shot."}
{"game_id": "0021700166", "chunk_id": "0021700166_024", "order": 24, "role": "body", "text": "His shot earned some ribbing from Harden when Springer came into the locker room to meet him after the game."}
{"game_id": "0021700166", "chunk_id": "0021700166_025", "order": 25, "role": "body", "text": "\"What was up with that shot,\" Harden asked laughing."}
{"game_id": "0021700166", "chunk_id": "0021700166_026", "order": 26, "role": "body", "text": "Springer answered: \"I had zero touch.\""}
{"game_id": "0021700166", "chunk_id": "0021700166_028", "order": 28, "role": "body", "text": "The Rockets didn't have a shootaround Thursday morning as D'Antoni experiments with whether it's better for his team to rest before games instead of coming into the arena in the mornings. Teams often don't have shootaround on the second day of back-to-back games, but this different because Houston didn't play on Wednesday. They've skipped shootaround two other times this season, once in New York because of traffic and a second time against Utah. Both times Houston went on to blowout wins."}
{"game_id": "0021700166", "chunk_id": "0021700166_029", "order": 29, "role": "body", "text": "\"Those were two of our better outings so it kind of leads to don't do it again ... if we don't (play well) then we'll go back and have shootaround,\" D'Antoni said."}
{"game_id": "0021700166", "chunk_id": "0021700166_031", "order": 31, "role": "body", "text": "Cavaliers: At Dallas on Saturday night."}
{"game_id": "0021700166", "chunk_id": "0021700166_032", "order": 32, "role": "body", "text": "Rockets: Host Memphis on Saturday night."}
{"game_id": "0021700166", "chunk_id": "0021700166_034", "order": 34, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
