{"game_id": "0021700328", "chunk_id": "0021700328_001", "order": 1, "role": "lead", "text": "NEW YORK --  The Atlanta Hawks got pushed by the Brooklyn Nets in the fourth quarter, and they responded with a game-clinching run."}
{"game_id": "0021700328", "chunk_id": "0021700328_002", "order": 2, "role": "body", "text": "Not bad for a team playing without a couple of key post players."}
{"game_id": "0021700328", "chunk_id": "0021700328_003", "order": 3, "role": "body", "text": "Dennis Schroder scored 24 points, reserve Luke Babbitt had 20 and the short-handed Hawks beat the Brooklyn Nets 114-102 on Saturday."}
{"game_id": "0021700328", "chunk_id": "0021700328_004", "order": 4, "role": "body", "text": "\"It's been a grind for us. We're taking it one game at a time and trying to win each game,\" Babbitt said. \"You can't replace John Collins or Dewayne Dedmon. I thought as a collective group everyone pitched in a little bit more tonight.\""}
{"game_id": "0021700328", "chunk_id": "0021700328_005", "order": 5, "role": "body", "text": "Dedmon hurt his left leg Wednesday night, and the center is expected to miss three to six weeks. Collins, the 19th pick in the June draft, injured his left shoulder Thursday night and will be out for two to three weeks."}
{"game_id": "0021700328", "chunk_id": "0021700328_006", "order": 6, "role": "body", "text": "\"It's a good win for us, feels like we've been playing better,\" Atlanta coach Mike Budenholzer said. \"To actually finish a game and get a win is good for our group.\""}
{"game_id": "0021700328", "chunk_id": "0021700328_007", "order": 7, "role": "body", "text": "Atlanta (5-17) had five players score in double figures in its third road win of the season. DeAndre Bembry had 12 points, and Isaiah Taylor and Taurean Prince each had 11."}
{"game_id": "0021700328", "chunk_id": "0021700328_008", "order": 8, "role": "body", "text": "Spencer Dinwiddie had 15 points for Brooklyn, which has lost five of seven. Joe Harris scored 13, and Allen Crabbe, Sean Kilpatrick and Jarrett Allen each had 12 points."}
{"game_id": "0021700328", "chunk_id": "0021700328_009", "order": 9, "role": "body", "text": "\"I don't think we could really guard them,\" Nets coach Kenny Atkinson said. \"I felt like they were getting us in closeouts and driving us to the rim.\""}
{"game_id": "0021700328", "chunk_id": "0021700328_010", "order": 10, "role": "body", "text": "Allen's layup trimmed Atlanta's lead to 90-88 with 8:13 left. But the Hawks responded with an 18-3 run."}
{"game_id": "0021700328", "chunk_id": "0021700328_011", "order": 11, "role": "body", "text": "Kent Bazemore made a 3-pointer and Schroder and Babbitt each hit a jumper to make it 108-91 with 3:54 remaining."}
{"game_id": "0021700328", "chunk_id": "0021700328_013", "order": 13, "role": "body", "text": "Hawks: Ersan Ilyasova had nine points and 11 rebounds. ... After logging just 13 minutes in his first two games back from a quad injury, Mason Plumlee started at center. ... PF/C Mike Muscala was sidelined by a sprained left ankle."}
{"game_id": "0021700328", "chunk_id": "0021700328_014", "order": 14, "role": "body", "text": "Nets: Harris made four of Brooklyn's 17 3-pointers. The Nets were 17 for 42 from beyond the arc."}
{"game_id": "0021700328", "chunk_id": "0021700328_016", "order": 16, "role": "body", "text": "Budenholzer said Collins' time away from the Hawks could be beneficial for the 20-year-old rookie, who is averaging 11.5 points and 7.1 rebounds and had started four straight games before he got hurt."}
{"game_id": "0021700328", "chunk_id": "0021700328_017", "order": 17, "role": "body", "text": "Budenholzer thought back to the 2013-14 season, when former Hawk Al Horford hurt his shoulder late in December and missed the rest of the year. He then made the All-Star team the next two seasons."}
{"game_id": "0021700328", "chunk_id": "0021700328_018", "order": 18, "role": "body", "text": "\"Injuries are unfortunate, but you get to sit and watch and see things teammates are doing well. You see defensively and offensively places to be,\" Budenholzer said."}
{"game_id": "0021700328", "chunk_id": "0021700328_019", "order": 19, "role": "body", "text": "\"I think just watching the team play helped (Horford) that summer to decide to work on some things, and in how he came back and approached the next season.\""}
{"game_id": "0021700328", "chunk_id": "0021700328_021", "order": 21, "role": "body", "text": "Hawks: Host Brooklyn on Monday night."}
{"game_id": "0021700328", "chunk_id": "0021700328_022", "order": 22, "role": "closing", "text": "Nets: After visiting Atlanta, the Nets head to Mexico City for games against Oklahoma City on Thursday and Miami on Saturday."}
