{"game_id": "0021700377", "chunk_id": "0021700377_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Jordan Clarkson believes he's figured out the key to his NBA success: fried chicken and scary movies."}
{"game_id": "0021700377", "chunk_id": "0021700377_002", "order": 2, "role": "body", "text": "The 25-year-old Clarkson said he brought some food into a movie theater and just chilled out on his night off between games -- and it helped him immensely."}
{"game_id": "0021700377", "chunk_id": "0021700377_003", "order": 3, "role": "body", "text": "\"I've got to start eating more fried chicken the day before a game,\" he joked."}
{"game_id": "0021700377", "chunk_id": "0021700377_004", "order": 4, "role": "body", "text": "Whatever it was, Clarkson turned in one of his best games with the Los Angeles Lakers, scoring 14 of his 22 points in the fourth quarter of a 110-99 win over the fatigued and short-handed Charlotte Hornets on Saturday night."}
{"game_id": "0021700377", "chunk_id": "0021700377_005", "order": 5, "role": "body", "text": "Clarkson was so hot that he played the entire fourth period while rookie point guard Lonzo Ball sat out. Ball finished with five points and nine assists after turning in perhaps his most complete game Wednesday night against Philadelphia, when he had 10 points, eight rebounds, eight assists, three steals and four blocks in a 107-104 victory."}
{"game_id": "0021700377", "chunk_id": "0021700377_007", "order": 7, "role": "body", "text": "\"That's what the team is for,\" he said. \"JC came in and he was cooking tonight.\""}
{"game_id": "0021700377", "chunk_id": "0021700377_008", "order": 8, "role": "body", "text": "Brandon Ingram added 18 points and Kentavious Caldwell-Pope had 15 for the Lakers, who have won two straight after losing five in a row."}
{"game_id": "0021700377", "chunk_id": "0021700377_009", "order": 9, "role": "body", "text": "\"It doesn't matter who comes in, who finishes the game -- we support each other and throughout the game everyone made huge contributions,\" Lakers coach Luke Walton said. \"At the end, that group had it rolling. So I was planning on throwing `Zo and Brook (Lopez) back in the game but because of the way the momentum was going, we stuck with the group that was out there and they got the job done for us.\""}
{"game_id": "0021700377", "chunk_id": "0021700377_010", "order": 10, "role": "body", "text": "Kemba Walker scored 23 points and Dwight Howard had 21 points and 12 rebounds for the injury-riddled Hornets, who have lost seven of eight."}
{"game_id": "0021700377", "chunk_id": "0021700377_011", "order": 11, "role": "body", "text": "The Lakers led by one entering the fourth but went on a run midway through the quarter to push the margin to 15."}
{"game_id": "0021700377", "chunk_id": "0021700377_012", "order": 12, "role": "body", "text": "Clarkson beat Walker on a backdoor cut for a jam, Caldwell-Pope knocked down a 3-pointer and Julius Randle scored on a layup and drew a foul. Ingram's tip-in off his own missed layup and Clarkson's floater increased the Lakers' lead to 14 with four minutes remaining. The Hornets had no legs left to challenge."}
{"game_id": "0021700377", "chunk_id": "0021700377_013", "order": 13, "role": "body", "text": "The Lakers outscored Charlotte 28-17 in the final 9 1/2 minutes."}
{"game_id": "0021700377", "chunk_id": "0021700377_015", "order": 15, "role": "body", "text": "Lakers: Scored 28 points off fast breaks. ... Their bench outscored the Hornets' reserves 53-31. ... Shot 50.6 percent from the field. ... Walton was assessed a technical foul in the first half."}
{"game_id": "0021700377", "chunk_id": "0021700377_016", "order": 16, "role": "body", "text": "Hornets: Walker and Howard were both assessed technical fouls. ... Howard has 14 double-doubles this season. ... Johnny O'Bryant had 11 points and seven rebounds."}
{"game_id": "0021700377", "chunk_id": "0021700377_018", "order": 18, "role": "body", "text": "The Hornets played without three key reserves out due to injuries -- Cody Zeller (meniscus tear in knee), Frank Kaminsky (sprained ankle) and Jeremy Lamb (bruised shin) -- one night after four of their five starters played more than 40 minutes in an overtime loss to Chicago."}
{"game_id": "0021700377", "chunk_id": "0021700377_019", "order": 19, "role": "body", "text": "To make matters worse, starter Nic Batum re-aggravated his left elbow against the Lakers and left the game early."}
{"game_id": "0021700377", "chunk_id": "0021700377_020", "order": 20, "role": "body", "text": "\"The injury situation we have is pretty dire right now,\" said associate head coach Stephen Silas, who is filling in for coach Steve Clifford while he deals with a health issue. \"I mean, that's four of your top eight guys that are out there. So yeah, it was a tough one.\""}
{"game_id": "0021700377", "chunk_id": "0021700377_022", "order": 22, "role": "body", "text": "Walton was thrilled with the play of Kyle Kuzma, who had 12 points and 14 rebounds. He was able to play more of his natural power forward position than in previous games."}
{"game_id": "0021700377", "chunk_id": "0021700377_023", "order": 23, "role": "body", "text": "\"He was active on the rebounding glass and had a big block for us when we were making our run,\" Walton said. \"He's a rookie and we are throwing him between multiple positions, which down the road is going to be great for him that he knows how to play both positions. But for now it is already tough enough in this league and I think he feels more comfortable at the 4 right now.\""}
{"game_id": "0021700377", "chunk_id": "0021700377_025", "order": 25, "role": "body", "text": "Lakers: At the New York Knicks on Tuesday night."}
{"game_id": "0021700377", "chunk_id": "0021700377_026", "order": 26, "role": "body", "text": "Hornets: At the Oklahoma City Thunder on Monday night."}
{"game_id": "0021700377", "chunk_id": "0021700377_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
