{"game_id": "0021201041", "chunk_id": "0021201041_001", "order": 1, "role": "lead", "text": "MIAMI -- The world's best came out to see if Miami could do it again. Novak Djokovic, the top-ranked men's tennis player. Wladimir Klitschko, the world heavyweight boxing king. Rory McIlroy, who sits atop the golf rankings for at least one more night."}
{"game_id": "0021201041", "chunk_id": "0021201041_003", "order": 3, "role": "body", "text": "The Heat won their 26th straight game on Sunday, with LeBron James going for 32 points, 10 assists and eight rebounds in a 109-77 victory over the Charlotte Bobcats."}
{"game_id": "0021201041", "chunk_id": "0021201041_004", "order": 4, "role": "body", "text": "\"I think it's very humbling that you can have some of the greats from other sports come to see your team play, come to see you play,\" said James, who was 11 for 14 from the field in another surgical performance. \"You try to leave an impression on them, as a team and as an individual, absolutely. So it was great to have them in the building, for sure.\""}
{"game_id": "0021201041", "chunk_id": "0021201041_005", "order": 5, "role": "body", "text": "Chris Bosh and Norris Cole had 15 points apiece for the Heat, who played without Dwyane Wade, held from the lineup because of right knee soreness that the team believes is minor. And after yet another slow start, Miami is now seven victories shy of matching the 1971-72 Los Angeles Lakers for the league record of 33 in a row."}
{"game_id": "0021201041", "chunk_id": "0021201041_006", "order": 6, "role": "body", "text": "The show now goes on the road for a four-game trip that begins in Orlando on Monday, a swing that also will take the Heat to Chicago, New Orleans and San Antonio. And the Heat will start that trip 2½ games ahead of San Antonio in the race for the NBA's best record."}
{"game_id": "0021201041", "chunk_id": "0021201041_007", "order": 7, "role": "body", "text": "Charlotte led by 11 in the early going and was within five in the third quarter, but two huge spurts by the Heat were more than enough to put the game away. Miami used a 31-6 run in the first half to erase the deficit, and a 26-5 blitz in the second half finished the job."}
{"game_id": "0021201041", "chunk_id": "0021201041_008", "order": 8, "role": "body", "text": "\"It was a good, professional win, and obviously we had a lot of guys step up, guys that hadn't been getting regular minutes,\" Heat coach Erik Spoelstra said. \"That's good to see, because we will need it. ... Good team win.\""}
{"game_id": "0021201041", "chunk_id": "0021201041_009", "order": 9, "role": "body", "text": "Kemba Walker led Charlotte with 20 points, and Gerald Henderson had 18. Charlotte finished the night 5 for 25 from 3-point range, while the Heat were 13 for 30 beyond the arc."}
{"game_id": "0021201041", "chunk_id": "0021201041_010", "order": 10, "role": "body", "text": "\"We ran into some dry spells and we settled for way too many 3s,\" Bobcats coach Mike Dunlap said. \"At the end of the game we had 25, and that's not who we are.\""}
{"game_id": "0021201041", "chunk_id": "0021201041_011", "order": 11, "role": "body", "text": "James departed with about 8 minutes left, after perhaps the highlight of the night. Chris Andersen blocked a layup try by Walker, doing so with such force that the ball caromed right back into play and basically started a Miami fast break on its own. James capped the sequence with a spectacular dunk, his final points of the night."}
{"game_id": "0021201041", "chunk_id": "0021201041_012", "order": 12, "role": "body", "text": "Djokovic clapped and smiled. McIlroy -- who could lose his No. 1 ranking if Tiger Woods holds on and wins at Bay Hill on Monday -- turned toward Heat owner Micky Arison and grinned. Klitschko's facial expression was one of disbelief."}
{"game_id": "0021201041", "chunk_id": "0021201041_013", "order": 13, "role": "body", "text": "By then, the only order of business was for some fans to sing \"Happy Birthday\" to Bosh, which happened with about 3 minutes left. He turned 29 on Sunday."}
{"game_id": "0021201041", "chunk_id": "0021201041_014", "order": 14, "role": "body", "text": "The Heat's 26-game streak is tied for the second longest in American pro sports history, according to ESPN Stats & Information. The New York Giants hold the longest run in Major League Baseball, a 26-game streak in 1916 -- in which every contest was played at home."}
{"game_id": "0021201041", "chunk_id": "0021201041_015", "order": 15, "role": "body", "text": "The final score Sunday made it look easy for Miami, but there were a few frustrating minutes for the team."}
{"game_id": "0021201041", "chunk_id": "0021201041_016", "order": 16, "role": "body", "text": "On Friday night, after a third straight game of falling behind by double digits in the early going and not coming out with the sort of energy they've grown accustomed to displaying, the Heat said they had to improve on those fronts."}
{"game_id": "0021201041", "chunk_id": "0021201041_017", "order": 17, "role": "body", "text": "Maybe those improvements will happen Monday."}
{"game_id": "0021201041", "chunk_id": "0021201041_018", "order": 18, "role": "body", "text": "The Bobcats and Heat played three times during 2012, and Charlotte never led for a single second in any of those contests. The Bobcats did lead by five points when the teams played in Miami this past Feb. 4, but hadn't held a double-digit lead over the Heat since December 2011."}
{"game_id": "0021201041", "chunk_id": "0021201041_020", "order": 20, "role": "body", "text": "Just like Boston, Cleveland and Detroit did before them in the past week, the Bobcats were able to get the early jump on Miami. Charlotte hit eight of its first 14 shots, grabbed a 19-8 lead and had Spoelstra calling a quick timeout."}
{"game_id": "0021201041", "chunk_id": "0021201041_021", "order": 21, "role": "body", "text": "\"That's kind of been their M.O. lately, they've gotten off to slow starts,\" Henderson said. \"We wanted to come out and jump on them just like the other teams have. Once they got settled in, starting making plays, they got back into the game and we also when on a long drought where we couldn't score the ball.\""}
{"game_id": "0021201041", "chunk_id": "0021201041_022", "order": 22, "role": "body", "text": "Whatever Spoelstra said in that huddle seemed to be effective."}
{"game_id": "0021201041", "chunk_id": "0021201041_023", "order": 23, "role": "body", "text": "Miami closed the first quarter on a 15-0 run, taking the lead back on a 60-foot alley-oop by Cole to James, who pointed to the rim and then found a way to catch the long pass from the second-year guard. By the time the Heat burst was over, an 11-point deficit turned into a 39-25 lead -- making it a 31-6 swing for Miami, which forced the Bobcats into missing 20 of 22 shots during that stretch."}
{"game_id": "0021201041", "chunk_id": "0021201041_024", "order": 24, "role": "body", "text": "The outcome was never really in doubt again."}
{"game_id": "0021201041", "chunk_id": "0021201041_025", "order": 25, "role": "body", "text": "\"We've been having slow starts,\" James said. \"But it's not how we start. It's how we finish.\""}
{"game_id": "0021201041", "chunk_id": "0021201041_026", "order": 26, "role": "body", "text": "Game notes Ray Allen scored 14 points for Miami. ... Play was briefly delayed in the third quarter because of some power-outage issues involving the scoreboard and game clock. ... The Bobcats needed a police escort to get to the arena from their hotel, since that particular section of downtown Miami also had a large crowd of people clogging streets for an outdoor electronic music festival. ... Heat F Juwan Howard was in uniform, his first time on an active roster since Game 5 of last season's NBA Finals, and played the final three-plus minutes for the debut appearance of his 19th season. He made his only shot."}
{"game_id": "0021201041", "chunk_id": "0021201041_027", "order": 27, "role": "closing", "text": "Information from The Associated Press was used in this report."}
