{"game_id": "0021700167", "chunk_id": "0021700167_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Upset over being boxed out for a rebound by Joel Embiid with his team down by one in the final minutes of the fourth quarter, Sacramento center Willie Cauley-Stein immediately made up for it by blocking the Philadelphia big man's putback attempt."}
{"game_id": "0021700167", "chunk_id": "0021700167_002", "order": 2, "role": "body", "text": "De'Aaron Fox took over from there and, after a failed try driving the lane, made a shot that was just as big as Cauley-Stein's block."}
{"game_id": "0021700167", "chunk_id": "0021700167_003", "order": 3, "role": "body", "text": "Fox hit a 19-foot jumper with 13.4 seconds remaining to lift the Kings over Philadelphia 109-108 on Thursday night, ending a five-game winning streak for the 76ers that marked their longest in six years."}
{"game_id": "0021700167", "chunk_id": "0021700167_004", "order": 4, "role": "body", "text": "\"We stuck together, because I thought it was going to get away from us, but we got some hustle plays and we hung onto some loose balls,\" Sacramento coach Dave Joerger said. \"We hope that we can get this every night, but we are going to enjoy this one.\""}
{"game_id": "0021700167", "chunk_id": "0021700167_005", "order": 5, "role": "body", "text": "Cauley-Stein's block on Embiid set it up. The Kings' 7-footer also defended Embiid when he missed a shot from the free throw line as time expired."}
{"game_id": "0021700167", "chunk_id": "0021700167_006", "order": 6, "role": "body", "text": "\"My last thing was I had to block it,\" Cauley-Stein said. \"A score would have ended it. It was just instinctual.\""}
{"game_id": "0021700167", "chunk_id": "0021700167_007", "order": 7, "role": "body", "text": "Two nights after rallying from 17 points down to upset Oklahoma City and snap a seven-game skid, Sacramento (3-8) pulled off another stunner by closing with a 7-0 run."}
{"game_id": "0021700167", "chunk_id": "0021700167_008", "order": 8, "role": "body", "text": "The Kings led for most of the second half but fell behind late in the fourth quarter when they went nearly four minutes without a field goal. Fox ended the drought with a short jumper and Garrett Temple hit a 3-pointer before Fox's game-winner gave Sacramento its second consecutive win."}
{"game_id": "0021700167", "chunk_id": "0021700167_009", "order": 9, "role": "body", "text": "\"That's a shot that I'm extremely comfortable with,\" Fox said. \"That's what (they) gave me, so I took it.\""}
{"game_id": "0021700167", "chunk_id": "0021700167_010", "order": 10, "role": "body", "text": "Zach Randolph had 20 points and seven rebounds for the Kings. Justin Jackson scored 19, including 11 in the fourth quarter, and Fox finished with 11 points and seven assists."}
{"game_id": "0021700167", "chunk_id": "0021700167_011", "order": 11, "role": "body", "text": "Embiid had 22 points and 15 rebounds on an uneven night. He shot 7 of 20 and struggled in the paint against Randolph and Kosta Koufos."}
{"game_id": "0021700167", "chunk_id": "0021700167_012", "order": 12, "role": "body", "text": "\"We didn't deserve to win the game,\" 76ers coach Brett Brown said. \"We poked ourselves in the eye. There are some things that you can spin and blame on youth. This isn't one of them.\""}
{"game_id": "0021700167", "chunk_id": "0021700167_013", "order": 13, "role": "body", "text": "Robert Covington scored 24 points and sank six 3-pointers for Philadelphia (6-5). Ben Simmons added 18 points and six assists."}
{"game_id": "0021700167", "chunk_id": "0021700167_014", "order": 14, "role": "body", "text": "The 76ers trailed by as many as nine and looked out of rhythm most of the night before Simmons scored six straight points in the fourth quarter, including an emphatic, one-handed, driving dunk down the lane."}
{"game_id": "0021700167", "chunk_id": "0021700167_015", "order": 15, "role": "body", "text": "Dario Saric followed with a 3 and Covington's sixth shot from beyond the arc followed by a three-point play extended Philadelphia's lead to 108-102 before the Kings made their decisive push."}
{"game_id": "0021700167", "chunk_id": "0021700167_016", "order": 16, "role": "body", "text": "The game was close early on before Sacramento pulled away midway through the second quarter to lead 64-57 at halftime."}
{"game_id": "0021700167", "chunk_id": "0021700167_018", "order": 18, "role": "body", "text": "It was the first time Cauley-Stein and Embiid matched up as starters. The two 7-footers squared off last season when Cauley-Stein was a backup to DeMarcus Cousins. \"He's a great player and I've been wanting to see this matchup for a while,\" Cauley-Stein said. \"I'm happy I could just play with him. We both had a really good game and made it interesting.\""}
{"game_id": "0021700167", "chunk_id": "0021700167_020", "order": 20, "role": "body", "text": "76ers: Simmons failed to have a double-double for only the fourth time in 11 games. ... Philadelphia has made 10 or more 3-pointers in seven consecutive games. ... Jerryd Bayless remained sidelined with a bruised left wrist."}
{"game_id": "0021700167", "chunk_id": "0021700167_021", "order": 21, "role": "body", "text": "Kings: Vince Carter was inactive because of a kidney stone."}
{"game_id": "0021700167", "chunk_id": "0021700167_023", "order": 23, "role": "body", "text": "76ers: Make a short trip south to play at Golden State on Saturday."}
{"game_id": "0021700167", "chunk_id": "0021700167_024", "order": 24, "role": "body", "text": "Kings: Begin a three-game road trip Saturday against the Knicks. Sacramento lost both meetings with New York last season."}
{"game_id": "0021700167", "chunk_id": "0021700167_026", "order": 26, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
