{"game_id": "0021700418", "chunk_id": "0021700418_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Playing without two injured post players on Friday night against the Charlotte Hornets, the Miami Heat turned to perimeter shooting from its bench for scoring punch."}
{"game_id": "0021700418", "chunk_id": "0021700418_002", "order": 2, "role": "body", "text": "Tyler Johnson and Wayne Ellington delivered to lift Miami to a .500 record with a 104-98 victory."}
{"game_id": "0021700418", "chunk_id": "0021700418_003", "order": 3, "role": "body", "text": "Johnson and Ellington scored 16 points each in Miami's 24th win in its past 30 games against Charlotte (10-18), which opened a stretch of six of seven home games with a loss. Johnson and Ellington combined for 10-of-16 shooting on 3-pointers."}
{"game_id": "0021700418", "chunk_id": "0021700418_004", "order": 4, "role": "body", "text": "With center Hassan Whiteside and forward Justise Winslow back home with knee injuries, Johnson and Ellington routinely hit 3-pointers at points in the game the Hornets appeared poised to make a comeback."}
{"game_id": "0021700418", "chunk_id": "0021700418_005", "order": 5, "role": "body", "text": "\"It's very, very helpful to have that,\" said the Heat's Kelly Olynyk, who, along with Josh Richardson, James Johnson and Bam Adebayo, scored 11 points. \"That second unit is tough to guard. They're making guys pay.\""}
{"game_id": "0021700418", "chunk_id": "0021700418_006", "order": 6, "role": "body", "text": "Dion Waiters scored 12 for the Heat."}
{"game_id": "0021700418", "chunk_id": "0021700418_007", "order": 7, "role": "body", "text": "\"They showed their depth tonight,\" Hornets associate head coach Stephen Silas said. \"They had seven guys in double figures and no one over 16 points. When you play like that, it's a winning combination.\""}
{"game_id": "0021700418", "chunk_id": "0021700418_008", "order": 8, "role": "body", "text": "Kemba Walker led Charlotte with 23 points after aggravating a wrist injury and leaving the game in the first half. He returned to start the second half with his left wrist wrapped, and his 3-pointer with 3:16 left pulled Charlotte within 100-93 after trailing by 17."}
{"game_id": "0021700418", "chunk_id": "0021700418_009", "order": 9, "role": "body", "text": "\"As soon as Kemba Walker hit that one 3-pointer, I turned to the bench and said, `Uh-oh,\" said coach Erik Spoelstra, who tied Pat Riley's career win record for Miami. \"I like our guys having to go through all that stress and anxiety and have to execute under duress and under the pressure in context of a close game.\""}
{"game_id": "0021700418", "chunk_id": "0021700418_010", "order": 10, "role": "body", "text": "Walker drew a foul against Johnson, his fifth, with 2:02 left. His free throws closed the gap to 100-96, and Dwight Howard's driving layup brought the Hornets within 100-98. Waiters hit a fadeaway for Miami's first basket in more than 2 minutes and a 102-98 lead."}
{"game_id": "0021700418", "chunk_id": "0021700418_011", "order": 11, "role": "body", "text": "Miami pulled away with free throws from Goran Dragic for the final margin."}
{"game_id": "0021700418", "chunk_id": "0021700418_012", "order": 12, "role": "body", "text": "\"We have to find a way to be consistent and win these games,\" said Hornets guard Nicolas Batum, who struggled to a 2-for-7 shooting performance but finished with a season-high tying 10 assists. \"It's right there. We have to find a way to create for other guys.\""}
{"game_id": "0021700418", "chunk_id": "0021700418_013", "order": 13, "role": "body", "text": "Michael Kidd-Gilchrist shot 6 of 8 for 13 points for Charlotte, which has lost five of its past six. Howard recorded his fourth double-double in five games for Charlotte with 15 points and 16 rebounds. It was his 16th double-double this season."}
{"game_id": "0021700418", "chunk_id": "0021700418_015", "order": 15, "role": "body", "text": "Heat: Whiteside (knee), who has missed eight consecutive games, returned to practice on Thursday."}
{"game_id": "0021700418", "chunk_id": "0021700418_016", "order": 16, "role": "body", "text": "Hornets: The Hornets last won the series against Miami in 2009-2010. Miami leads the season series 2-0."}
{"game_id": "0021700418", "chunk_id": "0021700418_017", "order": 17, "role": "body", "text": "MICKEY'S DEVELOPMENT: F Jordan Mickey nearly gave Miami four double-digit scorers off the bench. Mickey, who has spent time working on skill development with Juwan Howard, shot 4 of 6 with seven rebounds in more than 15 minutes on the court."}
{"game_id": "0021700418", "chunk_id": "0021700418_018", "order": 18, "role": "body", "text": "\"He's in the best shape that he's been in this past week,\" Spoelstra said. \"All of his testing has been phenomenal and that is what you want of your young players. You never know when you're going to get an opportunity.\""}
{"game_id": "0021700418", "chunk_id": "0021700418_019", "order": 19, "role": "body", "text": "TROUBLE WITH THE 3: Miami (11 for 31, 35.5 percent) shot slightly lower than Charlotte (10 for 27, 37 percent) from 3-point range, but the timing made the difference. Heat shooters found open shots on defensive lapses off penetration all night."}
{"game_id": "0021700418", "chunk_id": "0021700418_020", "order": 20, "role": "body", "text": "\"We were biting on shot fakes, they were driving by us,\" Silas said. \"They had isolations, they were driving by us. It wasn't necessarily the rim protection, it was the drive and kicks. That's the problem that I see and it's a recurring issue that we've had.\""}
{"game_id": "0021700418", "chunk_id": "0021700418_022", "order": 22, "role": "body", "text": "Heat: Host Clippers on Saturday night."}
{"game_id": "0021700418", "chunk_id": "0021700418_023", "order": 23, "role": "body", "text": "Hornets: Host Trail Blazers on Saturday night."}
{"game_id": "0021700418", "chunk_id": "0021700418_025", "order": 25, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
