{"game_id": "0021100885", "chunk_id": "0021100885_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- The Dallas Mavericks built a big lead and then withstood the Portland Trail Blazers' furious comeback attempt in the fourth quarter."}
{"game_id": "0021100885", "chunk_id": "0021100885_002", "order": 2, "role": "body", "text": "Dirk Nowitzki had 24 points and nine rebounds, Delonte West added 21 points, seven assists and six rebounds, and Mavericks nearly lost a 24-point lead in a 97-94 win over Portland on Friday night."}
{"game_id": "0021100885", "chunk_id": "0021100885_003", "order": 3, "role": "body", "text": "\"We took care of business early and gave ourselves a little margin for error,\" Jason Terry said. \"In the end we finished the game.\""}
{"game_id": "0021100885", "chunk_id": "0021100885_004", "order": 4, "role": "body", "text": "Shawn Marion had 17 points and 14 rebounds for defending champion Dallas, which has a 1½-game lead over Denver and Houston for the sixth playoff spot in the Western Conference. Brandan Wright added 13 points and eight rebounds."}
{"game_id": "0021100885", "chunk_id": "0021100885_005", "order": 5, "role": "body", "text": "Nicolas Batum had 20 to lead the Blazers, Jamal Crawford scored 18, and Wesley Matthews had 15 points and seven rebounds."}
{"game_id": "0021100885", "chunk_id": "0021100885_006", "order": 6, "role": "body", "text": "\"I think the Mavericks won the game,\" Portland interim coach Kaleb Canales said. \"I don't think we gave them the game.\""}
{"game_id": "0021100885", "chunk_id": "0021100885_007", "order": 7, "role": "body", "text": "The Mavericks jumped out to an early lead and held Portland at a comfortable distance for 3½ quarters. Dallas was up by 24 points in the third and 16 points with less than four minutes to go in the game."}
{"game_id": "0021100885", "chunk_id": "0021100885_008", "order": 8, "role": "body", "text": "However, Portland was not dead. The Blazers suddenly put together a 12-0 run to pull to 93-89 and had the Rose Garden rocking with less than a minute left."}
{"game_id": "0021100885", "chunk_id": "0021100885_009", "order": 9, "role": "body", "text": "\"This team doesn't quit,\" Nowitzki said of the Blazers. \"Their fans are unbelievable. They get into the game like no other crowd in the NBA. The Blazers feed off their crowd. They got going and got back into the game.\""}
{"game_id": "0021100885", "chunk_id": "0021100885_010", "order": 10, "role": "body", "text": "But Nowitzki, who had scored just five points in the second half, rose to the occasion, too. He drew a foul and then knocked in two free throws. Wright finished a fast break with a dunk to put the game away."}
{"game_id": "0021100885", "chunk_id": "0021100885_011", "order": 11, "role": "body", "text": "Matthews made a meaningless 3-pointer at the buzzer."}
{"game_id": "0021100885", "chunk_id": "0021100885_012", "order": 12, "role": "body", "text": "Coming off a win at Golden State on Thursday night, the Mavericks have won the first two on their four-game road trip. With the playoffs approaching, Dallas' 39-year-old point guard, Jason Kidd, was inactive for the game to give him a rest."}
{"game_id": "0021100885", "chunk_id": "0021100885_013", "order": 13, "role": "body", "text": "Portland's playoff hopes have all but evaporated after the team announced Thursday that All-Star forward LaMarcus Aldridge would need arthroscopic surgery on his hip and would be shut down for the rest of the season. Aldridge was eighth in the league in scoring at 21.7 points per game. J.J. Hickson started in place of Aldridge for the second straight game, and had 13 points and 10 rebounds, his third double-double in three games."}
{"game_id": "0021100885", "chunk_id": "0021100885_014", "order": 14, "role": "body", "text": "Dallas jumped out to a 9-0 lead and held a 30-16 advantage after the first quarter. West scored to make it 38-18 early in the second. Batum scored 10 points in short order, keying a 21-7 Portland run to cut the lead to 45-39, but the Mavericks closed out the half with their own 11-2 run."}
{"game_id": "0021100885", "chunk_id": "0021100885_015", "order": 15, "role": "body", "text": "Dallas opened up the third on another run and eventually led 79-55."}
{"game_id": "0021100885", "chunk_id": "0021100885_016", "order": 16, "role": "closing", "text": "Game notes  The Mavericks have held opponents to 100 points or fewer in all but 14 games this season. \u0085 Portland finishes its regular-season home schedule Wednesday. The Blazers are 20-12 at the Rose Garden this season. \u0085 It was the Mavericks' first visit to Portland since Game 6 of the first round of the playoffs last year, which Dallas won to clinch the series en route to the NBA championship."}
