{"game_id": "0021301053", "chunk_id": "0021301053_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- This is what the Thunder had in mind when they picked up Caron Butler after the trade deadline.\nThe forward scored 23 points to help Oklahoma City defeat the Denver Nuggets 117-96 on Monday night. He made 10 of 19 shots in 29 minutes as a reserve and posted his highest points total since joining the team.\nKevin Durant, who had 27 points and eight assists, liked what the Thunder got from the 34-year-old Butler.\n\"That's what we want him to do,\" Durant said. \"He was aggressive, and that's what we need him to do for the rest of the year.\"\nButler said it felt good to get loose.\n\"I'm just getting into a rhythm,\" he said. \"My teammates are doing a great job of finding me in flow, and I'm starting to get a little more familiar with my game and understanding where I like the ball at.\"\nReggie Jackson had 16 points and a career-high 11 assists, and Serge Ibaka added 15 points and seven rebounds for the Thunder, who won their fourth straight.\nThe Thunder sat point guard Russell Westbrook so he could rest his surgically repaired right knee. Westbrook's knee took a hit from Toronto guard Kyle Lowry on Friday, but tests showed no further damage was done. The Thunder have been resting Westbrook for one game of back-to-backs, and Oklahoma City plays at Dallas on Tuesday. As usual, other players filled in successfully.\n\"You have a system that's functioning,\" Butler said. \"The only thing guys got to do is plug into that system and play a certain style and way and give a certain type of effort, and things just continue to move forward.\"\nJackson, who had struggled at times since Westbrook returned after the All-Star break, played one of his best games of the season.\n\"He's just playing free now,\" Durant said. \"You can just tell he's not getting in his own way, you know, thinking too much mentally and he's just going out there and playing.\"\nTy Lawson scored 25 points, Quincy Miller and Timofey Mozgov each scored 12 points, Kenneth Faried had 11 points and 11 rebounds and Randy Foye had 11 points and four assists for the Nuggets.\nDenver allowed the Thunder to shoot 51 percent.\n\"We didn't get into the ball defensively,\" Denver forward Darrell Arthur said. \"Our communication was off.\"\nThe Thunder matched their highest points total in a quarter this season, making six 3-pointers in the first to take a 41-24 lead. Oklahoma City kept the pressure on and led 72-58 at halftime. The Thunder shot 60 percent from the field and had their highest points total in any half this season. Durant had 22 points and six assists in the first half while Ibaka scored 15. Only one Thunder player shot worse than 50 percent in the first half.\n\"They came out strong, and we gave them a lot of easy shots,\" Lawson said. \"It felt like they weren't working for anything. Everything was pretty much easy in the first half, I think.\"\nOklahoma City made just six of 18 shots in the third quarter, but the Nuggets were an even worse 3-for-16, so the Thunder actually extended their lead to 90-73 by the end of the period.\n\"We got stops on the first two possessions (of the third quarter), so we could have cut the lead down to 10,\" Denver coach Brian Shaw said. \"Instead, we don't capitalize on those situations, and they come down and score after that and push it right back up to 18 or 20. It was just one of those kinds of nights.\"\nGame notes\nThunder C Kendrick Perkins (left groin strain) and G Thabo Sefolosha (left calf strain) are improving, but still are out. Both have missed about a month. ... Durant has scored 25 or more points in 35 consecutive games, the longest streak since Michael Jordan did it 40 consecutive times during the 1986-87 season. ... Nuggets F Wilson Chandler (left groin strain) and F Jan Vesely (left rib cage contusion) did not play. ... Thunder C Hasheem Thabeet missed the game for personal reasons. ... Oklahoma City's Adams scored in double figures for just the third time this season. ... Thunder G Mustafa Shakur played for just the third time this season. He was NBA D-League Player of the Month in February while playing for the Tulsa 66ers."}
