{"game_id": "0021201070", "chunk_id": "0021201070_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- Reggie Evans' Brooklyn teammates egged him on, making sure he knew just how many points and rebounds he had against the Trail Blazers."}
{"game_id": "0021201070", "chunk_id": "0021201070_002", "order": 2, "role": "body", "text": "In the end, Evans finished with a career-high 26 rebounds and matched his career best with 22 points, and Brooklyn beat Portland 111-93 on Wednesday night. Evans is the first NBA player to reach both those numbers in a game this season."}
{"game_id": "0021201070", "chunk_id": "0021201070_003", "order": 3, "role": "body", "text": "And to top it off, he was battling an infection that kept his right eye half-shut throughout the game."}
{"game_id": "0021201070", "chunk_id": "0021201070_004", "order": 4, "role": "body", "text": "\"I just wanted to win, that's it,\" Evans said. \"But after a while, your teammates get to tell you how many rebounds you got. Typical of my teammates: 'Oh, you got this many. You got this many. You got this many.' I just take whatever I can do.\""}
{"game_id": "0021201070", "chunk_id": "0021201070_005", "order": 5, "role": "body", "text": "Nets coach P.J. Carlesimo called Evans' performance \"absurd.\""}
{"game_id": "0021201070", "chunk_id": "0021201070_006", "order": 6, "role": "body", "text": "It was Brooklyn's 20th road win of the season, matching a franchise best. Brook Lopez added 28 points for the Nets, who built a big lead early and stretched it to as many as 30 points."}
{"game_id": "0021201070", "chunk_id": "0021201070_007", "order": 7, "role": "body", "text": "LaMarcus Aldridge led Portland with 24 points despite rolling his right ankle in the first half and briefly leaving the game."}
{"game_id": "0021201070", "chunk_id": "0021201070_008", "order": 8, "role": "body", "text": "Most of the Nets' starters had retreated to the bench before Portland pulled within 101-87 on Luke Babbitt's 3-pointer with six minutes remaining. The starters returned, and Portland couldn't get closer."}
{"game_id": "0021201070", "chunk_id": "0021201070_009", "order": 9, "role": "body", "text": "It was a costly loss for the Blazers, who are 33-38 and still fighting for a playoff spot in the Western Conference with just 11 games remaining. Portland dropped 3 1/2 games back of the Los Angeles Lakers for the eighth and final playoff spot."}
{"game_id": "0021201070", "chunk_id": "0021201070_010", "order": 10, "role": "body", "text": "The Nets (42-29) have already clinched their first playoff appearance since 2007 and are now jockeying for home-court advantage. They're 4-1 on their current eight-game road trip."}
{"game_id": "0021201070", "chunk_id": "0021201070_011", "order": 11, "role": "body", "text": "Brooklyn was without Joe Johnson for the second straight game because of right quad contusion he sustained in a loss at the Clippers on Saturday. There was talk Johnson -- who is averaging 16.4 points per game -- might return to face the Blazers but the Nets did not want to push him with the playoffs looming."}
{"game_id": "0021201070", "chunk_id": "0021201070_012", "order": 12, "role": "body", "text": "It was all Brooklyn from the start. The Nets went up 24-8 after Evans' basket with 4:41 left in the first quarter. Evans had collected nine points and 11 rebounds by the end of the period."}
{"game_id": "0021201070", "chunk_id": "0021201070_013", "order": 13, "role": "body", "text": "In the past 11 games, Evans has topped 20 rebounds four times. The last time he had 22 points came in 2006."}
{"game_id": "0021201070", "chunk_id": "0021201070_014", "order": 14, "role": "body", "text": "\"He rebounds -- it's not a surprise he got rebounds. Now 26, that's another story,\" Blazers coach Terry Stotts said. \"For him to get three offensive rebounds in the first two minutes of the game when everybody knows that's what he does. ... We didn't do too much to take that away.\""}
{"game_id": "0021201070", "chunk_id": "0021201070_015", "order": 15, "role": "body", "text": "Evans' eye infection started in his left but had spread to his right before the game. He said it bothered him during shootaround earlier Wednesday and he had to use drops before the game."}
{"game_id": "0021201070", "chunk_id": "0021201070_016", "order": 16, "role": "body", "text": "\"If it was golf, it would be a problem, but a basketball is a pretty big ball,\" Carlesimo said. \"He can see a basketball -- that's all he needs to see.\""}
{"game_id": "0021201070", "chunk_id": "0021201070_017", "order": 17, "role": "body", "text": "Andray Blatche's follow dunk pushed Brooklyn's lead to 42-17, and C.J. Watson's drive gave the team its biggest lead of the first half at 50-21. The Blazers narrowed the margin slightly with a 10-2 run but the Nets led 64-41 at the break."}
{"game_id": "0021201070", "chunk_id": "0021201070_018", "order": 18, "role": "body", "text": "\"They definitely punched us in the mouth first, and we didn't respond for the whole game,\" Blazers forward J.J. Hickson said."}
{"game_id": "0021201070", "chunk_id": "0021201070_019", "order": 19, "role": "body", "text": "Aldridge, who had missed practice for a couple of days because of illness, started for the Blazers but had to leave for a time with what the team said was a sprained right ankle. The injury didn't slow him too much, and he topped all scorers with 18 points after the first half."}
{"game_id": "0021201070", "chunk_id": "0021201070_020", "order": 20, "role": "body", "text": "Blazers rookie Damian Lillard, who is averaging just more than 19 points, didn't score before having 10 points in the third quarter. He finished with 15."}
{"game_id": "0021201070", "chunk_id": "0021201070_021", "order": 21, "role": "body", "text": "\"It was embarrassing,\" Lillard said. \"I don't know any other way to say it.\""}
{"game_id": "0021201070", "chunk_id": "0021201070_022", "order": 22, "role": "closing", "text": "Game notes Blazers forward Victor Claver, sidelined because of an ankle injury, made his first appearance since March 8. ... The Blazers' video scoreboard turned to the final seconds of Chicago's 101-97 victory over Miami, which snapped the Heat's 27-game winning streak. ... The victory snapped a four-game losing streak for the Nets at the Rose Garden. ... It was the second-worst defeat for the Blazers at home this season. ... Evans' 26 rebounds are the most for a player on either side of the all-time series between the Nets and the Blazers."}
