{"game_id": "0021700557", "chunk_id": "0021700557_001", "order": 1, "role": "lead", "text": "NEW YORK --  The Brooklyn Nets were well aware that Minnesota had been blowing teams off the starting line."}
{"game_id": "0021700557", "chunk_id": "0021700557_002", "order": 2, "role": "body", "text": "The Nets not only hung in at the beginning, they made the big plays at the end."}
{"game_id": "0021700557", "chunk_id": "0021700557_003", "order": 3, "role": "body", "text": "Spencer Dinwiddie made the go-ahead jumper with 10.1 seconds left and tied his career high with 26 points, leading Brooklyn to a 98-97 victory over the Timberwolves on Wednesday night."}
{"game_id": "0021700557", "chunk_id": "0021700557_004", "order": 4, "role": "body", "text": "The Wolves raced to a 17-0 lead against Indiana on Sunday and then 16-0 against the Lakers the next night, but the Nets never let them find an early flow."}
{"game_id": "0021700557", "chunk_id": "0021700557_005", "order": 5, "role": "body", "text": "\"When you spot a team that many points, it's always hard to come back and that's something we really didn't want to happen,\" Dinwiddie said, \"and obviously we didn't.\""}
{"game_id": "0021700557", "chunk_id": "0021700557_006", "order": 6, "role": "body", "text": "Jimmy Butler missed at the buzzer as the Timberwolves lost for just the second time in nine games."}
{"game_id": "0021700557", "chunk_id": "0021700557_007", "order": 7, "role": "body", "text": "\"I just think as a whole we didn't play that much good basketball and we get put in that situation which from the jump could have went either way,\" Butler said. \"At least we fought and got back in the game, but I didn't make a shot.\""}
{"game_id": "0021700557", "chunk_id": "0021700557_008", "order": 8, "role": "body", "text": "Dinwiddie added nine assists as the Nets improved to 2-0 in the new year -- more wins than they had all last January, when they were 1-15. Joe Harris came off the bench to score 17 points."}
{"game_id": "0021700557", "chunk_id": "0021700557_009", "order": 9, "role": "body", "text": "\"Really proud of how the team's progressing and just showing a resiliency that I felt that we didn't have last year,\" Nets coach Kenny Atkinson said. \"We felt last year we kind of crumbled in a situation like that where they made a run. We stayed together and really showed a lot of physical and mental toughness.\""}
{"game_id": "0021700557", "chunk_id": "0021700557_010", "order": 10, "role": "body", "text": "Butler finished with 30 points, mostly on the strength of 16-of-18 shooting at the foul line. Andrew Wiggins added 17 points and Karl-Anthony Towns had 16 points and 10 rebounds."}
{"game_id": "0021700557", "chunk_id": "0021700557_011", "order": 11, "role": "body", "text": "Dinwiddie had given the Nets a 96-94 lead on a jumper with 1:11 to play before three straight free throws from Butler put Minnesota back on top. The next Nets possession didn't seem to be going anywhere as the clock ran down, but Dinwiddie dribbled left away from Taj Gibson and lofted a floater that went in."}
{"game_id": "0021700557", "chunk_id": "0021700557_012", "order": 12, "role": "body", "text": "Butler then dribbled right while defended by DeMarre Carroll and got off a good look that missed."}
{"game_id": "0021700557", "chunk_id": "0021700557_013", "order": 13, "role": "body", "text": "The Nets led 24-22 after one quarter and held Minnesota to 39.5 percent shooting in the first half, taking a 48-43 lead on Dinwiddie's 3-pointer at the buzzer."}
{"game_id": "0021700557", "chunk_id": "0021700557_014", "order": 14, "role": "body", "text": "Brooklyn scored the first seven points of the third quarter to open a 55-43 lead before Minnesota finally got going, using a 23-7 run to build a 66-62 advantage. The Wolves were ahead 73-71 after three thanks to Wiggins' jumper at the buzzer."}
{"game_id": "0021700557", "chunk_id": "0021700557_015", "order": 15, "role": "body", "text": "\"The thing is, I told them this: `It may not be going our way early but then we've got to make it go our way,\" Timberwolves coach Tom Thibodeau said. \"I thought we showed some resiliency in the second half but we talked about how important it is to play for 48 minutes and sometimes you miss some shots.\""}
{"game_id": "0021700557", "chunk_id": "0021700557_017", "order": 17, "role": "body", "text": "Timberwolves: Minnesota fell to 4-9 against Eastern Conference teams. ... The Wolves had won 11 of the last 16 meetings."}
{"game_id": "0021700557", "chunk_id": "0021700557_018", "order": 18, "role": "body", "text": "Nets: Brooklyn played without Caris LeVert, who had been the only Nets player to appear in all 37 games, because of a left groin strain. Atkinson said the injury wasn't serious and hoped LeVert could play Saturday against Boston. ... Atkinson said the Nets couldn't call up Isaiah Whitehead from their G League affiliate to be the backup point guard in LeVert's absence because he was dealing with a knee injury."}
{"game_id": "0021700557", "chunk_id": "0021700557_020", "order": 20, "role": "body", "text": "The game matched two of the most improved teams in the NBA through the same number of games as last season. The Wolves came in 24-14, a league-best 12-game improvement over their 12-26 mark. Miami was improved by nine wins, while the Nets were tied for third with Philadelphia after improving by nine wins. The Nets entered 14-23 -- they were 8-29 after 37 games in 2016-17."}
{"game_id": "0021700557", "chunk_id": "0021700557_022", "order": 22, "role": "body", "text": "Jahlil Okafor had two points in 11 minutes, his second appearance for the Nets since they acquired him from Philadelphia last month. After the first stint, the team decided to get him back into playing shape before putting him in games again. Okafor had sat out almost all season after falling out of the Sixers' rotation."}
{"game_id": "0021700557", "chunk_id": "0021700557_024", "order": 24, "role": "body", "text": "Timberwolves: Visit the Boston Celtics on Friday."}
{"game_id": "0021700557", "chunk_id": "0021700557_025", "order": 25, "role": "body", "text": "Nets: Host the Celtics on Saturday."}
{"game_id": "0021700557", "chunk_id": "0021700557_027", "order": 27, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
