{"game_id": "0021701158", "chunk_id": "0021701158_001", "order": 1, "role": "lead", "text": "MIAMI --  There was no raucous celebration. The Miami Heat hope one of those comes later this spring."}
{"game_id": "0021701158", "chunk_id": "0021701158_002", "order": 2, "role": "body", "text": "For now, briefly enjoying a clincher is enough."}
{"game_id": "0021701158", "chunk_id": "0021701158_003", "order": 3, "role": "body", "text": "Goran Dragic had 22 points and 10 rebounds, Josh Richardson blocked a potential go-ahead shot in the final moments, and the Heat closed on an 11-0 run to beat the Atlanta Hawks 101-98 on Tuesday. The win assured Miami of its 20th playoff berth in 30 seasons, and meant an often-lackluster night ended happily."}
{"game_id": "0021701158", "chunk_id": "0021701158_004", "order": 4, "role": "body", "text": "\"There's only one way with this group,\" a relieved Heat coach Erik Spoelstra said. \"And it's the hard way.\""}
{"game_id": "0021701158", "chunk_id": "0021701158_005", "order": 5, "role": "body", "text": "Last year, 41 wins meant the Heat finished one game out of the postseason -- while Dwyane Wade and Chicago got the last spot."}
{"game_id": "0021701158", "chunk_id": "0021701158_006", "order": 6, "role": "body", "text": "This year, the 42nd win meant the Heat are playoff-bound, and Wade is already telling teammates of what that means in Miami."}
{"game_id": "0021701158", "chunk_id": "0021701158_007", "order": 7, "role": "body", "text": "\"The energy in this building is amazing,\" Wade said. \"A lot of people around the NBA have tried to copy our vibe that we set in this building. It's flattering. Our fans take a lot of flak from the outside about being late and all these things, but when our fans are in this building it's still one of the loudest places to play in and you feed off of it.\""}
{"game_id": "0021701158", "chunk_id": "0021701158_008", "order": 8, "role": "body", "text": "They won't start at home; Miami will open on the road either April 14 or 15."}
{"game_id": "0021701158", "chunk_id": "0021701158_009", "order": 9, "role": "body", "text": "Hassan Whiteside's tip-in with a minute left put Miami up for good, part of an 18-point, 12-rebound night in his first game since angrily saying he wanted more playing time. Tyler Johnson scored 12, Wade had 11 and James Johnson finished with 10 for the Heat."}
{"game_id": "0021701158", "chunk_id": "0021701158_010", "order": 10, "role": "body", "text": "\"Happy we got it clinched,\" Whiteside said."}
{"game_id": "0021701158", "chunk_id": "0021701158_011", "order": 11, "role": "body", "text": "John Collins had 19 points and 10 rebounds for the Hawks, who got 18 points from Tyler Dorsey and 16 from Damion Lee. Isaiah Taylor added 15 and Mike Muscala scored 13 for Atlanta."}
{"game_id": "0021701158", "chunk_id": "0021701158_012", "order": 12, "role": "body", "text": "\"Really, really pleased with the guys' effort,\" coach Mike Budenholzer said. \"To come here and compete against this team in this environment ... a lot of positives tonight. We just quite couldn't get it done at the end.\""}
{"game_id": "0021701158", "chunk_id": "0021701158_013", "order": 13, "role": "body", "text": "Collins made three 3-pointers; he needed a fourth to tie it, but his shot at the buzzer was well short."}
{"game_id": "0021701158", "chunk_id": "0021701158_014", "order": 14, "role": "body", "text": "\"We played our hearts out tonight,\" Collins said."}
{"game_id": "0021701158", "chunk_id": "0021701158_015", "order": 15, "role": "body", "text": "Wade opened the final quarter with a basket to break a 78-all tie, only to have it answered by an 11-0 run for Atlanta. Dorsey made a pair of 3s during the spurt, Muscala made another to cap the burst and just like that the Hawks were up 89-80."}
{"game_id": "0021701158", "chunk_id": "0021701158_016", "order": 16, "role": "body", "text": "But the Heat had just enough at the end, and now can finally think about the postseason."}
{"game_id": "0021701158", "chunk_id": "0021701158_017", "order": 17, "role": "body", "text": "\"We know, as it looks right now, it's going to be either Toronto, Boston or Cleveland,\" Wade said. \"And they are all very, very good teams. So it doesn't matter who we match up with. We're going to have our work cut out for us. But obviously, other matchups have more story lines than other ones.\""}
{"game_id": "0021701158", "chunk_id": "0021701158_019", "order": 19, "role": "body", "text": "Hawks: Collins, who grew up playing in nearby Palm Beach County, is essentially assured of having the best field-goal percentage for a rookie in Hawks history. He's now at 58.3 percent this season; the best shooting year by an Atlanta rookie was Antoine Carr's 52.8-percent clip in 1984-85. ... Dewayne Dedmon was ruled out with a sore rib, meaning the Hawks had six players out with injuries."}
{"game_id": "0021701158", "chunk_id": "0021701158_020", "order": 20, "role": "body", "text": "Heat: Rookie C Bam Adebayo didn't play for the second consecutive game. ... The Heat were 8 for 33 from 3-point range. ... Wayne Ellington is now within two of tying Eric Gordon's record for 3-pointers by a reserve in a season. Gordon had 206 off the bench a year ago."}
{"game_id": "0021701158", "chunk_id": "0021701158_022", "order": 22, "role": "body", "text": "Wade's fourth assist of the night came late in the first half, going to Whiteside -- and giving the guard 5,000 assists in a Heat uniform. He's the ninth player to score 20,000 points and collect 5,000 assists with one team, joining Karl Malone, Kobe Bryant, Michael Jordan, LeBron James, Larry Bird, John Havlicek, Oscar Robertson and Jerry West."}
{"game_id": "0021701158", "chunk_id": "0021701158_024", "order": 24, "role": "body", "text": "Only four teams haven't had longer than a two-game winning streak this season -- Atlanta, Sacramento, Phoenix and Brooklyn. The Hawks are now 3-19 in games following a win."}
{"game_id": "0021701158", "chunk_id": "0021701158_026", "order": 26, "role": "closing", "text": "The Heat visit the Hawks in Atlanta on Wednesday night, a game that wraps up the final back-to-back of the season for both clubs."}
