{"game_id": "0021700626", "chunk_id": "0021700626_001", "order": 1, "role": "lead", "text": "PHOENIX --  Houston didn't need James Harden to roll past the Phoenix Suns."}
{"game_id": "0021700626", "chunk_id": "0021700626_002", "order": 2, "role": "body", "text": "There were plenty of contributions from just about everyone else to make it a 112-95 Rocket romp on Friday night."}
{"game_id": "0021700626", "chunk_id": "0021700626_003", "order": 3, "role": "body", "text": "Chris Paul scored 25 points to lead six Houston players in double figures and the Rockets improved to 4-2 since losing Harden with a hamstring injury."}
{"game_id": "0021700626", "chunk_id": "0021700626_004", "order": 4, "role": "body", "text": "\"We are just holding it down, holding it down until we get the whole crew back,\" Paul said. \"Ain't nobody going to feel sorry for ourselves and we ain't going to feel sorry for ourselves. We are just going to go out there and keep competing.\""}
{"game_id": "0021700626", "chunk_id": "0021700626_005", "order": 5, "role": "body", "text": "Houston led by 18 in the second quarter, 22 at the end of the third and 27 in the fourth in its sixth consecutive victory over Phoenix."}
{"game_id": "0021700626", "chunk_id": "0021700626_006", "order": 6, "role": "body", "text": "Clint Capela scored 17 points and grabbed 16 rebounds for the Rockets, who dominated the boards 53-38. Ryan Anderson and Trevor Ariza added 18 points apiece and Eric Gordon 14."}
{"game_id": "0021700626", "chunk_id": "0021700626_007", "order": 7, "role": "body", "text": "Devin Booker scored 27 and T.J. Warren 21 for the Suns, who were coming off a home win over Oklahoma City four days earlier. Booker, playing more these days at point guard, had nine assists but nine of his team's 19 turnovers."}
{"game_id": "0021700626", "chunk_id": "0021700626_008", "order": 8, "role": "body", "text": "Houston had a 14-4 advantage on the offensive boards."}
{"game_id": "0021700626", "chunk_id": "0021700626_009", "order": 9, "role": "body", "text": "\"I think we're number one in the league in getting an offensive rebound and kicking it out for a 3, so that's great,\" Rockets coach Mike D'Antoni said. \"And obviously Chris had some mismatches and he started doing some short 15-foot game. He's awesome. Everybody contributed here and there.\""}
{"game_id": "0021700626", "chunk_id": "0021700626_010", "order": 10, "role": "body", "text": "Phoenix got off to a fast start, scoring 10 straight points, capped by Dragan Bender's 3-pointer, to lead 21-10."}
{"game_id": "0021700626", "chunk_id": "0021700626_011", "order": 11, "role": "body", "text": "Then things turned sour for the home team."}
{"game_id": "0021700626", "chunk_id": "0021700626_012", "order": 12, "role": "body", "text": "The Rockets outscored the Suns 37-8 over the final 5:05 of the first quarter and first 6:47 of the second, when Anderson's two free throws put Houston on top 47-29 with 5:13 left in the first half. The Rockets led 57-44 at the break, despite Booker's 18 points."}
{"game_id": "0021700626", "chunk_id": "0021700626_013", "order": 13, "role": "body", "text": "Houston scored the first four points of the second half and Phoenix never got closer than 15 after that."}
{"game_id": "0021700626", "chunk_id": "0021700626_014", "order": 14, "role": "body", "text": "The Rockets went with a small lineup and spaced the floor, leading to open shots."}
{"game_id": "0021700626", "chunk_id": "0021700626_015", "order": 15, "role": "body", "text": "\"Well, they space everybody out,\" Phoenix interim coach Jay Triano said. \"They're going to shoot a lot and that makes it tough when you're out there on the 3-point line and you try to challenge shots and turning around to go chase rebounds. That can be difficult. I thought they were probably a little quicker to the ball.\""}
{"game_id": "0021700626", "chunk_id": "0021700626_017", "order": 17, "role": "body", "text": "Rockets: At 30-11, the Rockets have their fourth-best record at a season's midpoint in franchise history. ... The Rockets have won in Phoenix nine straight times and have beaten the Suns 13 of last 15 overall. ... Capela's career high in rebounds is 20. ... Houston won its 15th road game, third-most in NBA behind Boston (16) and Golden State (18)."}
{"game_id": "0021700626", "chunk_id": "0021700626_018", "order": 18, "role": "body", "text": "Suns: Forwards Marquese Chriss and Josh Jackson missed the game, both with hip injuries. Isaiah Canaan was out with a left abductor strain. ... Chriss ended a streak of 124 consecutive games to begin his career. It was longest streak by a Sun since Kyle Macy played in the first 329 games of his pro career from 1980-84. ... Tyson Chandler grabbed 11 rebounds and needs 11 more to be the 40th player in NBA history with 10,000."}
{"game_id": "0021700626", "chunk_id": "0021700626_020", "order": 20, "role": "body", "text": "The Suns, who haven't made the playoffs in six seasons, commemorated the 25th anniversary of their 1992-93 Western Conference champion team at halftime. Charles Barkley, Tom Chambers, Dan Majerle, Kevin Johnson, coach Paul Westphal, and then-CEO and general manager Jerry Colangelo were among the participants. That team lost to the Bulls and Michael Jordan in the NBA Finals. Barkley, of course, got the biggest cheers."}
{"game_id": "0021700626", "chunk_id": "0021700626_022", "order": 22, "role": "body", "text": "Rockets: Visit Clippers on Monday night."}
{"game_id": "0021700626", "chunk_id": "0021700626_023", "order": 23, "role": "body", "text": "Suns: Host Pacers on Sunday night."}
{"game_id": "0021700626", "chunk_id": "0021700626_025", "order": 25, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
