{"game_id": "0021701100", "chunk_id": "0021701100_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  The Thunder could regret this missed opportunity."}
{"game_id": "0021701100", "chunk_id": "0021701100_002", "order": 2, "role": "body", "text": "CJ McCollum scored 34 points to help the Portland Trail Blazers beat Oklahoma City 108-105 on Sunday night. Portland doubled its lead to two games over the Thunder for third place in the Western Conference."}
{"game_id": "0021701100", "chunk_id": "0021701100_003", "order": 3, "role": "body", "text": "The Thunder had several chances to win. Oklahoma City got possession trailing by two with 18.5 seconds remaining. Oklahoma City's Carmelo Anthony got trapped in the corner and forced his way through before turning the ball over. Oklahoma City's Russell Westbrook then fouled Portland's Al-Farouq Aminu with 7 seconds to play and fouled out. Aminu made the first free throw and missed the second to give the Thunder a chance to force overtime, but Anthony missed a 3-pointer as time expired."}
{"game_id": "0021701100", "chunk_id": "0021701100_004", "order": 4, "role": "body", "text": "Thunder coach Billy Donovan felt Anthony was the right person to take the final shot with Westbrook out, despite the fact that he had made just 3 of 12 shots before taking that last jumper."}
{"game_id": "0021701100", "chunk_id": "0021701100_005", "order": 5, "role": "body", "text": "\"Carmelo is a proven scorer in this league and has made shots -- big shots -- for a large portion of his career,\" Donovan said. \"I've got confidence in him. So we'll go with him in that situation. That's just how I felt.\""}
{"game_id": "0021701100", "chunk_id": "0021701100_006", "order": 6, "role": "body", "text": "The arena had the energy of a playoff game, especially in the second half. McCollum liked the way the Trail Blazers had to scrape and claw to get the win in a hostile environment."}
{"game_id": "0021701100", "chunk_id": "0021701100_007", "order": 7, "role": "body", "text": "\"Being down and having to compete, going on runs, coming back and just having to get stops down the stretch,\" he said. \"They are a good team and made the game very difficult. We executed well on offense to come away with a win.\""}
{"game_id": "0021701100", "chunk_id": "0021701100_008", "order": 8, "role": "body", "text": "Damian Lillard scored 24 points, and Jusuf Nurkic added 17 points and 12 rebounds for the Trail Blazers, who swept all four games with the Thunder this season."}
{"game_id": "0021701100", "chunk_id": "0021701100_009", "order": 9, "role": "body", "text": "Westbrook led the Thunder with 23 points, nine assists and eight rebounds. Steven Adams had 18 points and 10 rebounds, and Jerami Grant added 17 points."}
{"game_id": "0021701100", "chunk_id": "0021701100_010", "order": 10, "role": "body", "text": "Oklahoma City trailed 44-29 in the second quarter before going on a 16-0 run to take the lead. Portland regrouped and led 57-52 at halftime."}
{"game_id": "0021701100", "chunk_id": "0021701100_011", "order": 11, "role": "body", "text": "In the third quarter, Portland's Ed Davis came down on Oklahoma City guard Terrance Ferguson's back, and Davis shoved him as the two fell toward the ground. Ferguson got up quickly and went after Davis, and a skirmish followed. Four technical fouls were issued -- to Evan Turner and Davis for Portland and to Ferguson and Westbrook for the Thunder. Shortly after that, Oklahoma City's Paul George hit a 3 to give the Thunder a 75-74 lead. Portland's Maurice Harkless made a 3-pointer as the third quarter expired to put the Trail Blazers up 82-80."}
{"game_id": "0021701100", "chunk_id": "0021701100_012", "order": 12, "role": "body", "text": "\"I thought it was a hell of a basketball game,\" Portland coach Terry Stotts said. \"You can tell this meant a lot to both teams. I thought we made a lot of good plays defensively. We were very good when we needed to be.\""}
{"game_id": "0021701100", "chunk_id": "0021701100_014", "order": 14, "role": "body", "text": "Trail Blazers: Held the Thunder to 29 percent shooting in the first quarter to lead 34-17. ... Outrebounded Oklahoma City 49-39."}
{"game_id": "0021701100", "chunk_id": "0021701100_015", "order": 15, "role": "body", "text": "Thunder: Shot 14 or 21 from the field in the second quarter. ... Westbrook didn't score until just under six minutes remained in the second quarter. ... Fell to 7-2 with G Corey Brewer in the starting lineup. ... Westbrook fouled out for the first time this season."}
{"game_id": "0021701100", "chunk_id": "0021701100_017", "order": 17, "role": "body", "text": "Anthony and George shot a combined 7 for 28 overall and 0 for 12 from 3-point range."}
{"game_id": "0021701100", "chunk_id": "0021701100_019", "order": 19, "role": "body", "text": "Lillard on how Portland played down the stretch: \"We just continued to make the right plays. We continued to hustle for those loose balls and those extra possessions. On the defensive end, we got some fouls and they scored some points, but it was hard work for them. We made them earn everything, and it came down to that team that was going to make that one extra play.\""}
{"game_id": "0021701100", "chunk_id": "0021701100_021", "order": 21, "role": "body", "text": "Trail Blazers: At New Orleans on Tuesday night."}
{"game_id": "0021701100", "chunk_id": "0021701100_022", "order": 22, "role": "body", "text": "Thunder: At San Antonio on Thursday night."}
{"game_id": "0021701100", "chunk_id": "0021701100_024", "order": 24, "role": "body", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP ."}
{"game_id": "0021701100", "chunk_id": "0021701100_026", "order": 26, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
