{"game_id": "0021701110", "chunk_id": "0021701110_001", "order": 1, "role": "lead", "text": "MIAMI --  Dwyane Wade is completely convinced LeBron James is still the best basketball player in the world."}
{"game_id": "0021701110", "chunk_id": "0021701110_002", "order": 2, "role": "body", "text": "And the Miami Heat accepted the challenge of slowing him down."}
{"game_id": "0021701110", "chunk_id": "0021701110_003", "order": 3, "role": "body", "text": "Kelly Olynyk scored a game-high 19 points, Wade blocked a pair of shots by James as part of a stifling defensive effort by Miami, and the Heat had little trouble on the way to beating the Cleveland Cavaliers 98-79 on Tuesday night."}
{"game_id": "0021701110", "chunk_id": "0021701110_004", "order": 4, "role": "body", "text": "Wade finished with four blocks, two of them from behind to thwart James, and afterward the close friends got together and laughed like always."}
{"game_id": "0021701110", "chunk_id": "0021701110_005", "order": 5, "role": "body", "text": "\"That's one thing about us -- we don't brag about what we do against each other,\" James said. \"We talk about what we do against everybody else.\""}
{"game_id": "0021701110", "chunk_id": "0021701110_006", "order": 6, "role": "body", "text": "Josh Richardson and James Johnson each scored 15 points for Miami, which led 54-34 at halftime and has won 10 of its last 11 home games. Wade finished with 12 against the team he spent part of this season with before getting traded back to Miami."}
{"game_id": "0021701110", "chunk_id": "0021701110_007", "order": 7, "role": "body", "text": "\"We did a great job,\" Wade said. \"One of our best defensive games since I've been here, for sure.\""}
{"game_id": "0021701110", "chunk_id": "0021701110_008", "order": 8, "role": "body", "text": "The Heat held Cleveland to a season-low point total, a shocking number when considering the Cavs had scored 120 in each of their previous four games. James finished with 18 points for the Cavaliers, who were without Kevin Love in the second half because of what was initially diagnosed as a loose tooth and then changed to concussion-like symptoms."}
{"game_id": "0021701110", "chunk_id": "0021701110_009", "order": 9, "role": "body", "text": "Love, who was hurt 1:22 into the game after taking an elbow from Heat center Jordan Mickey, will be evaluated again Wednesday to see if he needs to enter the NBA's concussion protocol."}
{"game_id": "0021701110", "chunk_id": "0021701110_010", "order": 10, "role": "body", "text": "\"What hurt us more was our rotation was in disarray,\" James said. \"We have a great rotation thing down the last few games and for a guy to go down that early it kind of messed that up.\""}
{"game_id": "0021701110", "chunk_id": "0021701110_011", "order": 11, "role": "body", "text": "James finished with 18 points for the Cavaliers, whose previous season low for points was 88. The Cavs are 1-13 this season when held under 100; they're 43-17 when scoring more than 100."}
{"game_id": "0021701110", "chunk_id": "0021701110_012", "order": 12, "role": "body", "text": "It was the 865th consecutive regular-season game in which James scored at least 10 points, putting him one shy of tying Michael Jordan for the longest such streak in NBA history. James can tie the mark in Charlotte -- against the Jordan-owned Hornets -- on Wednesday."}
{"game_id": "0021701110", "chunk_id": "0021701110_013", "order": 13, "role": "body", "text": "\"We missed shots early and we allowed their pressure to take us out of some of the stuff that we wanted to do,\" Cavs interim coach Larry Drew said."}
{"game_id": "0021701110", "chunk_id": "0021701110_014", "order": 14, "role": "body", "text": "Rodney Hood added 15 points for Cleveland. It was Miami's 14th consecutive home win over the Cavaliers, including a 4-0 mark when James plays in Miami since leaving the Heat after the 2014 NBA Finals."}
{"game_id": "0021701110", "chunk_id": "0021701110_015", "order": 15, "role": "body", "text": "\"This shows the type of defensive team we can be,\" Heat guard Goran Dragic said."}
{"game_id": "0021701110", "chunk_id": "0021701110_016", "order": 16, "role": "body", "text": "Cleveland came in averaging 31 points per quarter over its last five games, then managed only 34 in the first half against the Heat."}
{"game_id": "0021701110", "chunk_id": "0021701110_017", "order": 17, "role": "body", "text": "Cleveland showed life in the third, getting within 13 late in the quarter. But Miami was still up 75-59 going into the fourth, after Wade -- moments after checking in for the first time in about an hour of real time -- connected on a step-back jumper with 17 seconds left in the third."}
{"game_id": "0021701110", "chunk_id": "0021701110_018", "order": 18, "role": "body", "text": "\"That's why he is who he is,\" Heat coach Erik Spoelstra said."}
{"game_id": "0021701110", "chunk_id": "0021701110_020", "order": 20, "role": "body", "text": "Cavaliers: James has played in all 74 Cavs games, matching his total from last season. It was his first time playing at Miami since March 19, 2016. ... Cleveland changed its starting lineup, with Jeff Green in for Larry Nance Jr. ... Kyle Korver remained away from the team, one day after the funeral for his brother. Korver is expected back soon, though the team has not revealed if an exact comeback date has been determined."}
{"game_id": "0021701110", "chunk_id": "0021701110_021", "order": 21, "role": "body", "text": "Heat: Spoelstra was back with the team, two days after he and his wife Nikki's first child -- Santiago Ray Spoelstra -- was born. ... Miami was down two centers -- Hassan Whiteside (left hip) remains out, and Bam Adebayo missed the game with a sprained ankle that the Heat think will be better in a few days."}
{"game_id": "0021701110", "chunk_id": "0021701110_023", "order": 23, "role": "body", "text": "In three games against Miami this season, the Cavaliers used a total of 20 players. The only Cavs to play in all three meetings were James, J.R. Smith and Tristan Thompson."}
{"game_id": "0021701110", "chunk_id": "0021701110_025", "order": 25, "role": "body", "text": "Miami's next five games are all against teams well out of the playoff picture, with the next three of those games -- against Chicago, Brooklyn and Atlanta -- all at home. After road games at Atlanta and New York, the Heat then finish at home against Oklahoma City and Toronto."}
{"game_id": "0021701110", "chunk_id": "0021701110_027", "order": 27, "role": "body", "text": "Cavaliers: Visit Charlotte on Wednesday."}
{"game_id": "0021701110", "chunk_id": "0021701110_028", "order": 28, "role": "body", "text": "Heat: Host Chicago on Thursday."}
{"game_id": "0021701110", "chunk_id": "0021701110_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
