{"game_id": "0021400478", "chunk_id": "0021400478_001", "order": 1, "role": "lead", "text": "HOUSTON --  When James Harden's shooting percentage was down early in the season, Houston coach Kevin McHale felt he would figure it out."}
{"game_id": "0021400478", "chunk_id": "0021400478_002", "order": 2, "role": "body", "text": "Sure enough. Harden turned it around in December."}
{"game_id": "0021400478", "chunk_id": "0021400478_003", "order": 3, "role": "body", "text": "Harden scored 36 points, and the Rockets bounced back from consecutive losses with a 102-83 win over the Charlotte Hornets on Wednesday night."}
{"game_id": "0021400478", "chunk_id": "0021400478_004", "order": 4, "role": "body", "text": "\"James is just a hell of a basketball player,\" McHale said. \"I told him earlier in the year: `The best news that we had was that we were winning games and he wasn't shooting particularly well.\""}
{"game_id": "0021400478", "chunk_id": "0021400478_005", "order": 5, "role": "body", "text": "Harden shot just under 47.8 percent this month after shooting 40.9 percent in November and just 37.1 percent in the opening month of the season."}
{"game_id": "0021400478", "chunk_id": "0021400478_006", "order": 6, "role": "body", "text": "The performance against the Hornets was the NBA-leading 14th 30-point game this season for Harden, who leads the league in scoring. He made eight 3-pointers and also had six assists and seven rebounds."}
{"game_id": "0021400478", "chunk_id": "0021400478_007", "order": 7, "role": "body", "text": "\"James Harden did a great job,\" teammate Dwight Howard said. \"He was on fire. He did a great job of attacking the basket and hitting those 3s.\""}
{"game_id": "0021400478", "chunk_id": "0021400478_008", "order": 8, "role": "body", "text": "A big run to start the third quarter put the Rockets well ahead, and Harden put it away when he scored eight straight points to push the advantage to 99-79 with 2 1/2 minutes remaining and send the starters to the bench."}
{"game_id": "0021400478", "chunk_id": "0021400478_009", "order": 9, "role": "body", "text": "\"I felt real comfortable,\" said Harden, who was 12 for 19 from the field. \"My shot felt good the entire night and I had confidence to shoot it.\""}
{"game_id": "0021400478", "chunk_id": "0021400478_010", "order": 10, "role": "body", "text": "The loss extends Charlotte's skid to four games. The Hornets played without leading scorer Al Jefferson, who is out with a left groin strain."}
{"game_id": "0021400478", "chunk_id": "0021400478_011", "order": 11, "role": "body", "text": "Charlotte has dropped eight straight against Houston."}
{"game_id": "0021400478", "chunk_id": "0021400478_012", "order": 12, "role": "body", "text": "Michael Kidd-Gilchrist and Gerald Henderson scored 16 points apiece for the Hornets."}
{"game_id": "0021400478", "chunk_id": "0021400478_013", "order": 13, "role": "body", "text": "\"Turnovers were the difference in the game,\" coach Steve Clifford said. \"That's what got them going and they're good at it. We had 18 turnovers mostly due to their good defense and they converted those to easy baskets.\""}
{"game_id": "0021400478", "chunk_id": "0021400478_014", "order": 14, "role": "body", "text": "Patrick Beverley added 14 points for Houston, and Howard had 11 points and eight rebounds."}
{"game_id": "0021400478", "chunk_id": "0021400478_015", "order": 15, "role": "body", "text": "A 9-2 run by Houston extended its lead to 85-72 midway through the fourth quarter. With Harden and Howard on the bench getting a rest, Donatas Motiejunas scored four points in that stretch and Josh Smith capped the run with a 3-pointer."}
{"game_id": "0021400478", "chunk_id": "0021400478_016", "order": 16, "role": "body", "text": "Marvin Williams hit a 3 for Charlotte with less than a minute to go in the third, but Harden answered with a 3-pointer to make it 76-68 entering the fourth quarter."}
{"game_id": "0021400478", "chunk_id": "0021400478_017", "order": 17, "role": "body", "text": "Houston had a slim 47-45 lead at the break, but opened the second half with a 13-4 run. Beverley had the first eight points of the run, including a pair of 3s."}
{"game_id": "0021400478", "chunk_id": "0021400478_018", "order": 18, "role": "body", "text": "Howard collected his fourth foul on a charge late in the third and went to the bench for the rest of the quarter and the first minutes of the fourth."}
{"game_id": "0021400478", "chunk_id": "0021400478_019", "order": 19, "role": "body", "text": "Joey Dorsey replaced him and drew his fourth foul early in the fourth on a charge where he knocked Williams to the ground. Williams hit his head hard on the court and left the game with what appeared to be a cut on the right side of the back of his head. He was attended to on the bench for a couple of minutes before being escorted to the locker room holding some gauze on the injured area."}
{"game_id": "0021400478", "chunk_id": "0021400478_020", "order": 20, "role": "body", "text": "Clifford didn't provide an update on Williams after the game."}
{"game_id": "0021400478", "chunk_id": "0021400478_023", "order": 23, "role": "body", "text": "Hornets: Jannero Pargo (lower back soreness) and Lance Stephenson (pelvic strain) were both out. ... The Hornets have lost 10 in a row in Houston."}
{"game_id": "0021400478", "chunk_id": "0021400478_024", "order": 24, "role": "body", "text": "Rockets: Houston practiced on Tuesday, something it rarely does after back-to-back games. But McHale needed the practice time to help new additions Corey Brewer and Smith get up to speed. ... The Rockets played on New Year's Eve for the 13th straight year and improved to 10-3 in those games. ... Terrence Jones (left leg nerve inflammation) remains out."}
{"game_id": "0021400478", "chunk_id": "0021400478_026", "order": 26, "role": "body", "text": "The Hornets said Tuesday that Jefferson, who leads the team with 18 points and 8.2 rebounds a game, will be out for four weeks with a left groin strain. But Clifford said Wednesday the center could be out for a longer period."}
{"game_id": "0021400478", "chunk_id": "0021400478_027", "order": 27, "role": "body", "text": "\"They don't really know,\" Clifford said. \"It's going to be when he feels better.\""}
{"game_id": "0021400478", "chunk_id": "0021400478_028", "order": 28, "role": "body", "text": "Clifford said Jefferson has been playing through the injury for a while and that if it were up to the player, he would try to play through it."}
{"game_id": "0021400478", "chunk_id": "0021400478_029", "order": 29, "role": "body", "text": "\"He just can't pivot off that one foot which is such a big part of his game,\" Clifford said. \"So we want to have it get back to the point that he can play pain free (and) that's what we're going to do.\""}
{"game_id": "0021400478", "chunk_id": "0021400478_031", "order": 31, "role": "body", "text": "Hornets: Visit New Orleans on Friday."}
{"game_id": "0021400478", "chunk_id": "0021400478_032", "order": 32, "role": "closing", "text": "Rockets: Visit Cleveland on Friday."}
