{"game_id": "0021700272", "chunk_id": "0021700272_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Miami had seen its early lead slip away in Minnesota after a nearly perfect start shooting the ball."}
{"game_id": "0021700272", "chunk_id": "0021700272_002", "order": 2, "role": "body", "text": "A 14-point advantage had dwindled to one. Wayne Ellington came off the bench and hit a 3-pointer, then another, and the Heat found their spark."}
{"game_id": "0021700272", "chunk_id": "0021700272_003", "order": 3, "role": "body", "text": "Ellington scored 21 points and made six 3-pointers off the bench, Goran Dragic added 20 points and the Miami rode a season-best shooting performance from behind the arc to a 109-97 victory over the Timberwolves on Friday night."}
{"game_id": "0021700272", "chunk_id": "0021700272_004", "order": 4, "role": "body", "text": "\"He's ignitable and he always has been,\" Heat coach Erik Spoelstra said. \"He hits two then he's going for three and the whole team is looking for him. He has that kind of feel, but he exudes that energy. It's hard to explain. Guys know and feel when somebody's ignitable and you look for him.\""}
{"game_id": "0021700272", "chunk_id": "0021700272_005", "order": 5, "role": "body", "text": "Dragic was 5 of 8 from 3 as Miami hit a season-high 19 3-pointers on a season-high 39 attempts. Dion Waiters added 17 points, including a 3-of-8 mark from deep."}
{"game_id": "0021700272", "chunk_id": "0021700272_006", "order": 6, "role": "body", "text": "\"I feel like it's contagious kind of, you know?\" Ellington said. \"Once you see that ball go in there from long range, it's like guys want to join the party.\""}
{"game_id": "0021700272", "chunk_id": "0021700272_007", "order": 7, "role": "body", "text": "Jimmy Butler, Andrew Wiggins and Karl-Anthony Towns each had 18 points for Minnesota, which has lost three of its past four games."}
{"game_id": "0021700272", "chunk_id": "0021700272_008", "order": 8, "role": "body", "text": "Even after holding on for a 124-118 win on Wednesday against Orlando, the defense troubled Wolves coach Tom Thibodeau. Friday was more of the same as Minnesota couldn't handle Miami's screens to get shooters open."}
{"game_id": "0021700272", "chunk_id": "0021700272_009", "order": 9, "role": "body", "text": "The 19 3-pointers were the most allowed by the Wolves this season."}
{"game_id": "0021700272", "chunk_id": "0021700272_010", "order": 10, "role": "body", "text": "\"We haven't guarded anybody all year long,\" Butler said, adding: \"We've got to eventually figure it out and want to play defense, stop trying to outscore the opposing team. That starts with me and goes all the way down the line.\""}
{"game_id": "0021700272", "chunk_id": "0021700272_011", "order": 11, "role": "body", "text": "With Hassan Whiteside controlling the paint, Miami has taken the rest of its offense out to the arc this season. The Heat entered the game fifth in the league with 31.6 3-point attempts per game and were tied for seventh in 11.1 made 3s per game."}
{"game_id": "0021700272", "chunk_id": "0021700272_012", "order": 12, "role": "body", "text": "Miami is averaging its most points from 3-pointers in franchise history, entering play with 33.2 percent of its total coming from beyond the arc."}
{"game_id": "0021700272", "chunk_id": "0021700272_013", "order": 13, "role": "body", "text": "\"We can live with those shots,\" Dragic said of the ball movement leading to open 3s on Friday. \"Even if you miss, it's a good, open shot. As long as we get the trigger on the pick-and-roll and try to move the ball, then those are good shots because your feet are set.\""}
{"game_id": "0021700272", "chunk_id": "0021700272_014", "order": 14, "role": "body", "text": "The Heat opened the game hitting 10 of their first 13 attempts from the floor, including 4 of 6 from 3."}
{"game_id": "0021700272", "chunk_id": "0021700272_016", "order": 16, "role": "body", "text": "Heat: Six players hit 3-pointers. The Heat's previous season high was 15 3s against Denver on Nov. 3. ... Ellington's season and career high for 3s in a game is seven on Nov. 19. ... Whiteside had 16 points and 10 rebounds for his eighth double-double of the season."}
{"game_id": "0021700272", "chunk_id": "0021700272_017", "order": 17, "role": "body", "text": "Wolves: Aaron Brooks started in place of PG Jeff Teague. It was Brooks' first start since April 5, 2015, for Chicago. Tyus Jones started the second half at point guard and played a career-high 32 minutes with eight points, six rebounds and six assists. ... The Wolves were also without reserve forward Nemanja Bjelica due to a left mid-foot sprain."}
{"game_id": "0021700272", "chunk_id": "0021700272_019", "order": 19, "role": "body", "text": "Teague was ruled out minutes before the game with a right Achilles injury. Teague is averaging 14.0 points and 7.5 assists this season and is coming off playing 37 minutes on Wednesday. Thibodeau said Teague's status is day to day and he'll be re-evaluated Saturday."}
{"game_id": "0021700272", "chunk_id": "0021700272_021", "order": 21, "role": "body", "text": "Towns finished with 18 points, but 16 came in the fourth quarter after Miami had pulled away."}
{"game_id": "0021700272", "chunk_id": "0021700272_022", "order": 22, "role": "body", "text": "Instead of using the 7-foot Whiteside, Spoelstra had 6-foot-7 Justice Winslow defend the 7-foot Towns from the opening tip. Winslow's tenacity and movement made it difficult for Towns to find any room, with Winslow denying Towns the ball by fronting the big man."}
{"game_id": "0021700272", "chunk_id": "0021700272_023", "order": 23, "role": "body", "text": "\"He'll battle,\" Spoelstra said of Winslow. \"He set the tone at the beginning with his speed, his quickness, his physicality. Getting him off the block but also pressuring him up top.\""}
{"game_id": "0021700272", "chunk_id": "0021700272_024", "order": 24, "role": "body", "text": "Towns was scoreless in the first half on 0-for-5 shooting."}
{"game_id": "0021700272", "chunk_id": "0021700272_025", "order": 25, "role": "body", "text": "\"They're looking for him,\" Thibodeau said. \"If he stands stationary you're not going to get the ball. You've got to keep moving. And you have to execute. He scored some at the end, but it was meaningless.\""}
{"game_id": "0021700272", "chunk_id": "0021700272_027", "order": 27, "role": "body", "text": "Heat: Continue their four-game road trip at Chicago on Sunday."}
{"game_id": "0021700272", "chunk_id": "0021700272_028", "order": 28, "role": "body", "text": "Wolves: Host Phoenix on Sunday."}
{"game_id": "0021700272", "chunk_id": "0021700272_030", "order": 30, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
