{"game_id": "0021700906", "chunk_id": "0021700906_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Karl-Anthony Towns recorded yet another double-double in what has become a common occurrence for the first-time All-Star, and Minnesota got a much better defensive effort in the second half to pull away for a second straight lopsided win."}
{"game_id": "0021700906", "chunk_id": "0021700906_002", "order": 2, "role": "body", "text": "Turns out life without Jimmy Butler isn't as bad as for the Timberwolves as some expected it would be."}
{"game_id": "0021700906", "chunk_id": "0021700906_003", "order": 3, "role": "body", "text": "Towns had 26 points and 17 rebounds, his 54th double-double in 64 games this season, and Minnesota beat the Sacramento Kings 118-100 on Monday night."}
{"game_id": "0021700906", "chunk_id": "0021700906_004", "order": 4, "role": "body", "text": "\"Everyone has to step up,\" said Andrew Wiggins, who scored 22 points. \"Everyone has to do their job and more if we want to get to where we want to get to. We just have to keep it going. We're in a good spot right now and we have to keep it going and finish strong.\""}
{"game_id": "0021700906", "chunk_id": "0021700906_005", "order": 5, "role": "body", "text": "Jeff Teague added 20 points and Taj Gibson had 15 points to help the Timberwolves sweep the three-game season series between the two teams."}
{"game_id": "0021700906", "chunk_id": "0021700906_006", "order": 6, "role": "body", "text": "All five starters and six players overall scored in double figures for the Minnesota."}
{"game_id": "0021700906", "chunk_id": "0021700906_007", "order": 7, "role": "body", "text": "\"The unselfishness has been there all year,\" coach Tom Thibodeau said. \"We have to continue to do that. Defensively, we have got to keep working at it. We understand how important that is.\""}
{"game_id": "0021700906", "chunk_id": "0021700906_008", "order": 8, "role": "body", "text": "More importantly, Minnesota improved to 2-0 since losing Butler to a torn right meniscus last week heading into one of its toughest stretches of the season. The Timberwolves leading scorer, Butler is hoping to return for the playoffs."}
{"game_id": "0021700906", "chunk_id": "0021700906_009", "order": 9, "role": "body", "text": "\"Everyone has to step up,\" Wiggins said. \"Everyone has to do their job and more if we want to get to where we want to get to. We just have to keep it going. We're in a good spot right now and we have to keep it going and finish strong.\""}
{"game_id": "0021700906", "chunk_id": "0021700906_010", "order": 10, "role": "body", "text": "Thibodeau's team, which began the day in third place in the West and is off to the fourth-best start in franchise history, plays its next eight games against teams with winning records beginning with back-to-backs at Portland and Utah."}
{"game_id": "0021700906", "chunk_id": "0021700906_011", "order": 11, "role": "body", "text": "\"Without Jimmy we have to tighten up a whole lot more,\" Minnesota center Taj Gibson said. \"We're just putting the pressure on different guys in our lineup to step up because we have a tough road ahead of us.\""}
{"game_id": "0021700906", "chunk_id": "0021700906_012", "order": 12, "role": "body", "text": "The Timberwolves scored only 21 points in the fourth quarter but it hardly mattered after they outscored the Kings 34-17 in the third to pull away after a back-and-forth first half."}
{"game_id": "0021700906", "chunk_id": "0021700906_013", "order": 13, "role": "body", "text": "Towns took one shot in the first quarter before finding his stroke in the second when he scored 14 points on 5-of-6 shooting. He had four free throws during that stretch and finished 8-of-8 from the stripe."}
{"game_id": "0021700906", "chunk_id": "0021700906_014", "order": 14, "role": "body", "text": "Skal Labissiere scored 20 points, Willie Cauley-Stein added 17 and Buddy Hield had 16 for Sacramento, The Kings have lost four straight and six of seven."}
{"game_id": "0021700906", "chunk_id": "0021700906_015", "order": 15, "role": "body", "text": "\"They got in the paint too much, shrunk up the court, bottled us up and we fouled them too much,\" Sacramento coach Dave Joerger said. \"Their physicality was a lot.\""}
{"game_id": "0021700906", "chunk_id": "0021700906_016", "order": 16, "role": "body", "text": "Towns was one rebound shy of a double-double in the first half and Minnesota led by as much as 10 before De'Aaron Fox capped a late Sacramento surge with a layup to pull the Kings within 63-60 at halftime."}
{"game_id": "0021700906", "chunk_id": "0021700906_017", "order": 17, "role": "body", "text": "Teague and Wiggins combined for 15 points in the third quarter and Tyus Jones made two free throws and a short jumper to extend the Timberwolves lead to 97-77."}
{"game_id": "0021700906", "chunk_id": "0021700906_019", "order": 19, "role": "body", "text": "Minnesota held a big advantage on free throws, going 33 of 36 from the stripe. Sacramento was 12 of 13."}
{"game_id": "0021700906", "chunk_id": "0021700906_020", "order": 20, "role": "body", "text": "\"When we're able to get to the line we get some rest and we get the chance to put the defense in different situations,\" Towns said. \"We're doing a great job of getting to the line and putting ourselves in position to not get to the line but just making good offensive plays and getting some easy buckets.\""}
{"game_id": "0021700906", "chunk_id": "0021700906_022", "order": 22, "role": "body", "text": "Timberwolves: Towns' double-double is the 168th of his career. ... Minnesota went 14-for-14 from the free throw line in the first half."}
{"game_id": "0021700906", "chunk_id": "0021700906_023", "order": 23, "role": "body", "text": "Kings: Bruno Cabocio had four points, three rebounds and three fouls in 18 minutes of his Sacramento debut. Cabocio was part of the trade that sent Malachi Richardson to Toronto."}
{"game_id": "0021700906", "chunk_id": "0021700906_025", "order": 25, "role": "body", "text": "Timberwolves: Play at Portland on Thursday."}
{"game_id": "0021700906", "chunk_id": "0021700906_026", "order": 26, "role": "closing", "text": "Kings: Play at Portland on Tuesday."}
