{"game_id": "0021301160", "chunk_id": "0021301160_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- With Kevin Durant on the bench to start the fourth quarter, his Oklahoma City Thunder teammates put together a run that helped end one of the most impressive scoring streaks in NBA history.\nAnd Durant says nobody is happier it's over than him.\nCaron Butler made all six of his 3-point attempts to finish with 23 points, and the Thunder began the fourth quarter on a 16-0 spurt to pull away for a 107-92 victory over the Sacramento Kings on Tuesday night.\nDurant finished with 23 points but was never needed in the final quarter, stopping his streak of scoring at least 25 points in 41 consecutive games.\nOnly Oscar Robertson (46 straight games in 1963-64) and Wilt Chamberlain (all 80 regular-season games in the 1961-62 season) have longer such streaks.\n\"I was getting so many texts after every game. I'm glad that's over with and we can just focus on the team,\" said Durant, who shot 8 for 13 in 31 minutes.\n\"If we played well and I had 25 points, that took away from how well the team was playing, so I didn't like that. If we lost, it was all about me scoring 25 points and I didn't like that either. I'm glad we can just talk about the team now.\"\nComing off losses at Memphis and Phoenix, Oklahoma City certainly has plenty of bigger things to play for during the season's final two weeks.\nSerge Ibaka added 19 points and four rebounds for the Thunder, who rested Russell Westbrook ahead of Wednesday night's game at the Los Angeles Clippers. Oklahoma City (56-21) is 1 1/2 games ahead of the Clippers (55-23) for the Western Conference's No. 2 playoff seed.\nEven still, Durant said he was aware of how many points he had but never thought of asking coach Scott Brooks to go back in the game.\nBrooks insisted it never crossed his mind, either, saying the most impressive thing about Durant's streak is that he didn't even realize it ended because Durant has been the \"trademark for consistency.\"\n\"He's about team,\" Brooks said. \"If he wasn't, he would have played golf and tried to chase (Jack) Nicklaus' record of 18 majors.\"\nDeMarcus Cousins had 24 points and 14 rebounds, and Travis Outlaw scored 24 points in Sacramento's third straight loss. Even with three regulars out with injuries, the Kings made the Thunder work through the first three quarters.\nOklahoma City built double-digits leads throughout the game only to watch Sacramento surge back each time.\nBut with Durant on the bench to open the fourth, the Thunder finally created a lead big enough to stick. The Thunder held Sacramento scoreless for nearly 6 minutes to go ahead 101-77.\n\"We had some guys that played with no energy,\" frustrated Kings coach Michael Malone said. \"It looked they didn't even want to be out there, to be honest.\"\nWith the matchup in Los Angeles looming large, Brooks decided to rest Westbrook -- as he has done during one game of back-to-back sets since Westbrook returned Feb. 20 following right knee surgery.\nThe Thunder got some relief with Thabo Sefolosha playing for the first time since injuring his left calf against Memphis on Feb. 28. He finished with two points and three rebounds in 16 minutes.\nSacramento, already among the conference's worst teams, played even more short-handed. Kings big man Reggie Evans and forward Rudy Gay sat out with back injuries, and point guard Isaiah Thomas missed his eighth straight game with a bruised right quadriceps.\nOklahoma City looked every bit like the better and deeper team at the start.\nThe Thunder surged ahead 9-0 in the first two minutes before Cousins brought the Kings back with his perimeter shot, slicing Oklahoma City's lead to 30-27 at the end of the first quarter.\nThe Thunder began to pull away again with a 17-4 run in the second quarter propelled by Butler, who made all four of his 3-point attempts in the first half. Oklahoma City led 61-49 at intermission and didn't have a turnover until the second half.\nDurant credited the communication and ball movement for pulling away late, and he said he hopes the focus can shift from his scoring streak to his team's improved play.\n\"When I sit back after the season's over that's when I reflect on everything that I've done, that the team's done, and I'm sure I'll appreciate (the streak) then,\" Durant said. \"But now, I'm just focusing on game to game and how we can get better as a group and how I can help the team get better.\"\nGame notes\nThe Thunder swept the four-game season series against the Kings. ... Oklahoma City has won 10 straight and 16 of 17 over Sacramento. ... A fan made a shot from half court during a timeout in the first half to win a car."}
