{"game_id": "0021400146", "chunk_id": "0021400146_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- Dirk Nowitzki takes a lot of pride in his most recent milestone.\nThe Dallas Mavericks 7-foot center became the fourth player in NBA history to eclipse 27,000 career points with the same franchise, joining a prestigious group that includes current Hornets owner Michael Jordan, Karl Malone and Kobe Bryant.\nMonta Ellis scored 18 points, Chandler Parsons added 17 and Nowitzki had 13 as the Mavericks made light work of the Charlotte Hornets on Monday night for their fourth straight win 107-80.\n\"It means a lot to me that I was able to do it for one franchise with not knowing what to expect when I got there a long time ago,\" Nowitzki said. \"It's been a great ride. People were great to me from the beginning. When I was struggling my first year everyone supported me. Obviously Cubes (owner Mark Cuban) bought the team and he was loyal to me and I count it as my new home. I'm proud of that and hopefully there are many more baskets to come.\"\nThe Mavericks came in leading the NBA in scoring, averaging more than 109 points per game and the Hornets offered little resistance as the Mavericks routinely scored on uncontested alley-oops dunks, layups and 3-pointers.\nTyson Chandler was 7 of 7 from the field for 14 points, and Jameer Nelson had 11 points and eight assists for Dallas (8-3).\nGerald Henderson had a season-high 18 points for Charlotte (4-7). Al Jefferson was limited to six points on 3 of 12 shooting, snapping a string of 35 straight games of scoring in double digits.\nThis game was all Dallas from the start.\nThe Mavericks opened a 67-43 lead at halftime after outshooting the Hornets 62 to 32 percent from the field -- many of those coming on uncontested shots.\nChandler, who entered the game shooting 67 percent from the field this season, hit all six if his shots before the break. Of Dallas' 26 field goals in the first half, 24 of them were dunks, layups or 3-pointers.\n\"The Hornets are a tired team,\" Carlisle said. \"They are coming off a back-to-back on the West Coast and that is a hard thing.\"\nThe Hornets couldn't do anything right.\nEven a simple chest pass from Brian Roberts to Cody Zeller sailed harmlessly into the second row when Zeller wasn't looking.\n\"We just didn't have the fight and against team like that you have to be on it, and disciplined, together and willing to fight for every possession,\" Hornets coach Steve Clifford said. \"We weren't there tonight.\"\nJefferson said that was a disappointment and refused blame the poor outing on jetlag from the West Coast road swing.\n\"I'm sure not happy,\" Jefferson said. \"It's very disappointing. But I guess you get it out early.\"\n---\nTIP-INS\nMavericks: Raymond Felton began serving his four-game suspension on Monday night for his guilty plea to gun charges in New York from last season. Felton was suspended in August, but was not allowed to serve the suspension until he was healthy enough to begin playing.\nHornets: Power forward Marvin Williams has started all 11 games for the Hornets and logged more than 270 minutes, but has yet to attempt a free throw this season.\nBALANCED SCORING: The Mavericks have had at least five players score in double figures in nine of their 11 games this season, including Monday night when they had six.\nANOTHER INJURY: The Hornets, who are already missing Michael Kidd-Gilchrist and Gary Neal due to injuries and are without Jeffery Taylor due to legal problems, lost rookie guard P.J. Hairston in the second half to a sprained right ankle. The extent of the injury was not immediately known.\nUP NEXT\nHawks: Play at Washington on Wednesday night.\nHornets: Play at Indiana on Wednesday night."}
