{"game_id": "0021300918", "chunk_id": "0021300918_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  When Michael Jordan speaks, people still listen."}
{"game_id": "0021300918", "chunk_id": "0021300918_002", "order": 2, "role": "body", "text": "The Charlotte Bobcats owner praised his team during a pregame locker room speech Friday night, but warned his players it's only going to get tougher from here on out."}
{"game_id": "0021300918", "chunk_id": "0021300918_003", "order": 3, "role": "body", "text": "Jordan spoke directly about the Bobcats potentially making the playoffs -- something that seemed inconceivable five months ago for a team that was 7-59 and 21-61 the previous two seasons."}
{"game_id": "0021300918", "chunk_id": "0021300918_004", "order": 4, "role": "body", "text": "\"He talked to them about the progress that he had seen and praised them for their attitude and togetherness as a team,\" coach Steve Clifford said. \"And he let them know, which I thought was perfect, the toughest part is ahead. We made our first step and it now gets tougher. It was a great message.\""}
{"game_id": "0021300918", "chunk_id": "0021300918_005", "order": 5, "role": "body", "text": "A message that apparently inspired the Bobcats, currently seventh in the Eastern Conference."}
{"game_id": "0021300918", "chunk_id": "0021300918_006", "order": 6, "role": "body", "text": "Al Jefferson scored 28 points, Kemba Walker had 20 points and 14 assists, and the Bobcats (29-33) defeated the Cleveland Cavaliers 101-92 for their sixth straight win at home, surpassing their win total from the previous two seasons combined."}
{"game_id": "0021300918", "chunk_id": "0021300918_007", "order": 7, "role": "body", "text": "It was an important win for the Bobcats, who improved to 3-0 this season against the Cavaliers and now own the tiebreaker against both Detroit and Cleveland, the ninth- and 10th-place teams in the East."}
{"game_id": "0021300918", "chunk_id": "0021300918_008", "order": 8, "role": "body", "text": "\"If that don't motivate you, I don't know what will,\" Jefferson said of Jordan addressing the team."}
{"game_id": "0021300918", "chunk_id": "0021300918_009", "order": 9, "role": "body", "text": "Clifford said he asked Jordan to speak to the players before the game and he gladly accepted the invitation. He said players were \"locked in\" to every word Jordan spoke."}
{"game_id": "0021300918", "chunk_id": "0021300918_010", "order": 10, "role": "body", "text": "\"Let's face it, if you're coaching anywhere, he would be the first guy that you would say, `Would you mind coming to talk to our team?\" Clifford said. \"I'm saying he's our owner and, shoot, you are always looking for a little edge. I thought it was perfect.\""}
{"game_id": "0021300918", "chunk_id": "0021300918_011", "order": 11, "role": "body", "text": "Said Jefferson: \"He told us he was proud of us, but we have a long way to go. We can't be happy with what we have done so far. We have to continue to grow and get better.\""}
{"game_id": "0021300918", "chunk_id": "0021300918_012", "order": 12, "role": "body", "text": "It was a huge loss for Cleveland."}
{"game_id": "0021300918", "chunk_id": "0021300918_013", "order": 13, "role": "body", "text": "Dion Waiters and Luol Deng each scored 19 points for the Cavaliers, who began the night 3 1/2 games behind Atlanta for the final playoff spot in the East. They now trail Charlotte by 5 1/2 games."}
{"game_id": "0021300918", "chunk_id": "0021300918_014", "order": 14, "role": "body", "text": "\"It hurts,\" Cavaliers coach Mike Brown said. \"Especially knowing where we're sitting and where they're sitting right now, it's a tough loss.\""}
{"game_id": "0021300918", "chunk_id": "0021300918_015", "order": 15, "role": "body", "text": "Jefferson shot 12 of 18 from the field and reached 20 points for the 22nd time in his last 24 games. Chris Douglas-Roberts added 14 points, including four 3-pointers, and a season-high nine rebounds."}
{"game_id": "0021300918", "chunk_id": "0021300918_016", "order": 16, "role": "body", "text": "Charlotte's six-game home winning streak is its longest since a seven-game run in March 2010."}
{"game_id": "0021300918", "chunk_id": "0021300918_017", "order": 17, "role": "body", "text": "\"There are 20 games left and it's time to start talking about the playoffs -- about not just qualifying but getting our team game-ready for the playoffs and guys getting their individual games ready,\" Clifford said."}
{"game_id": "0021300918", "chunk_id": "0021300918_018", "order": 18, "role": "body", "text": "The Bobcats defeated the Cavaliers by six points in each of the two previous meetings this season without Jefferson, who sat out both games with a sprained ankle."}
{"game_id": "0021300918", "chunk_id": "0021300918_019", "order": 19, "role": "body", "text": "Jefferson had 38 points against Miami and 34 in a win over Indiana this week, and was a big factor from the outset against the Cavaliers. He used a series of pump fakes and up-and-under moves to fool the Cavaliers, and continued to knock down his mid-range jump shot."}
{"game_id": "0021300918", "chunk_id": "0021300918_020", "order": 20, "role": "body", "text": "The 6-foot-10 center scored 18 points in the first half on 8-of-10 shooting to help Charlotte build a 55-50 lead at the break despite the Cavaliers shooting 55 percent from the field."}
{"game_id": "0021300918", "chunk_id": "0021300918_021", "order": 21, "role": "body", "text": "Cleveland took an 81-80 lead on a pair of free throws by Waiters with 7 minutes left in the game. But Walker matched that with two free throws of his own and knocked down a jumper to spark a 15-5 run that put Charlotte safely ahead."}
{"game_id": "0021300918", "chunk_id": "0021300918_022", "order": 22, "role": "body", "text": "The Cavaliers shot just 32 percent in the second half, and Charlotte held Kyrie Irving to 13 points on 5-of-17 shooting. Irving came in averaging 24.5 points in his previous four games in Charlotte."}
{"game_id": "0021300918", "chunk_id": "0021300918_023", "order": 23, "role": "body", "text": "Waiters said it's not too late for the Cavaliers to make a playoff push."}
{"game_id": "0021300918", "chunk_id": "0021300918_024", "order": 24, "role": "body", "text": "But they'll need to play much better than they did Friday night."}
{"game_id": "0021300918", "chunk_id": "0021300918_025", "order": 25, "role": "body", "text": "\"We have a chance and a shot, so why not? Why not us?\" Waiters said. \"We've got to have a sense of urgency. The clock is ticking. The games are running out. Making the playoffs is right there and we've got a great opportunity.\""}
{"game_id": "0021300918", "chunk_id": "0021300918_026", "order": 26, "role": "closing", "text": "Game notes Bobcats guard Gerald Henderson missed his third straight game with a right calf strain. ... Anderson Varejao (back) and C.J. Miles (ankle) were back at practice this week but didn't make the trip to Charlotte, which meant Spencer Hawes and Tristan Thompson were left to defend Jefferson. ... Josh McRoberts added 11 points and seven assists for the Bobcats."}
