{"game_id": "0021701213", "chunk_id": "0021701213_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Coach Nate McMillan wanted the Indiana Pacers rested and ready for the playoffs -- even if the strategy cost them their regular-season finale."}
{"game_id": "0021701213", "chunk_id": "0021701213_002", "order": 2, "role": "body", "text": "So McMillan rested three starters and watched the Charlotte Hornets knock down 18 3-pointers and eventually pull away for a 119-93 victory Tuesday night."}
{"game_id": "0021701213", "chunk_id": "0021701213_003", "order": 3, "role": "body", "text": "\"My message to them, it really shouldn't look any different as far as how we play even though we have a number of guys out of uniform,\" he said. \"We wanted to give some guys an opportunity to get minutes. We were able to do that.\""}
{"game_id": "0021701213", "chunk_id": "0021701213_004", "order": 4, "role": "body", "text": "It wasn't the same -- not even close."}
{"game_id": "0021701213", "chunk_id": "0021701213_005", "order": 5, "role": "body", "text": "Frank Kaminsky matched his career high with 24 points, Dwight Howard finished with 14 points and 17 rebounds and the struggling Hornets came up one 3 short of tying their season high."}
{"game_id": "0021701213", "chunk_id": "0021701213_006", "order": 6, "role": "body", "text": "Charlotte won for only the second time in its last seven games and ended a three-game losing streak in Indy."}
{"game_id": "0021701213", "chunk_id": "0021701213_007", "order": 7, "role": "body", "text": "But it was little solace for a team that has now missed the playoffs three times in four seasons and could be headed for a major offseason overhaul with new general manager and president of basketball operations Mitch Kupchak already in place."}
{"game_id": "0021701213", "chunk_id": "0021701213_008", "order": 8, "role": "body", "text": "\"When you're eliminated from the playoffs, you want to finish the season on a positive note,\" Marvin Williams said after scoring 15 points and tying his career high with five 3s. \"Coach (Steve Clifford) getting sick was a huge blow for us. Losing Cody (Zeller) was a big loss. When you lose guys who are significant, it is tough to bounce back.\""}
{"game_id": "0021701213", "chunk_id": "0021701213_009", "order": 9, "role": "body", "text": "Indiana faced a similar dilemma last summer after being forced to trade four-time All-Star Paul George."}
{"game_id": "0021701213", "chunk_id": "0021701213_010", "order": 10, "role": "body", "text": "Somehow, McMillan took a young team that most expected to be in this year's lottery, led it to 48 wins and the No. 5 seed in the Eastern Conference playoffs."}
{"game_id": "0021701213", "chunk_id": "0021701213_011", "order": 11, "role": "body", "text": "With nothing significant at stake Tuesday, McMillan put Bojan Bogdanovic, Victor Oladipo and Thaddeus Young on the bench and carefully monitored the minutes of other key players."}
{"game_id": "0021701213", "chunk_id": "0021701213_012", "order": 12, "role": "body", "text": "The result: Darren Collison, T.J. Leaf and Glenn Robinson III each scored 13 points in a game that was never really close."}
{"game_id": "0021701213", "chunk_id": "0021701213_013", "order": 13, "role": "body", "text": "\"You grow up watching the NBA in the postseason. That's where you want to play your best basketball,\" Collison said. \"There's no greater feeling going with a team you enjoy playing with.\""}
{"game_id": "0021701213", "chunk_id": "0021701213_014", "order": 14, "role": "body", "text": "Williams made four 3s in the first quarter to help Charlotte take a 37-25 lead and it was 63-55 at halftime."}
{"game_id": "0021701213", "chunk_id": "0021701213_015", "order": 15, "role": "body", "text": "Charlotte then used an 11-4 run to make it 79-63 midway through the third quarter and the Pacers never got closer than 12 the rest of the game."}
{"game_id": "0021701213", "chunk_id": "0021701213_017", "order": 17, "role": "body", "text": "Hornets: Howard finished the season with a franchise-record 53 double-doubles and joined Kareem Abdul-Jabbar and Wilt Chamberlain as the only players to hold single-season records with two teams. ... Howard also is one of six players to average a double-double in each of his first 13 seasons in the league. ... Malik Monk had 17 points and Nicolas Batum had 14 points, four rebounds and six assists."}
{"game_id": "0021701213", "chunk_id": "0021701213_018", "order": 18, "role": "body", "text": "Pacers: Domantas Sabonis had 10 points and 10 rebounds while Lance Stephenson wound up with nine points, 13 rebounds and four assists. ... The Pacers played on Fan Appreciation Night in their \"Hickory\" uniforms and Stephenson signed his No. 1 jersey and tossed it into the crowd afterward. ... Play was stopped briefly during the fourth quarter when a T-shirt landed on the court during play."}
{"game_id": "0021701213", "chunk_id": "0021701213_020", "order": 20, "role": "body", "text": "Oladipo and Collison must wait one more day to find out if they can win league titles for steals and 3-point percentage."}
{"game_id": "0021701213", "chunk_id": "0021701213_021", "order": 21, "role": "body", "text": "Collison was 3 of 5 from beyond the arc, improving his percentage to 46.8 percent. That gives him Indiana's NBA single-season record, breaking Chris Mullin's previous mark of 46.5 percent set in 1998-99."}
{"game_id": "0021701213", "chunk_id": "0021701213_022", "order": 22, "role": "body", "text": "Oladipo, who sat out with a sore right foot, started the night with the highest steals total (177) and the highest average (2.36) since Ricky Rubio (2.32) in 2013-14."}
{"game_id": "0021701213", "chunk_id": "0021701213_024", "order": 24, "role": "body", "text": "Just how did McMillan decide who to play?"}
{"game_id": "0021701213", "chunk_id": "0021701213_025", "order": 25, "role": "body", "text": "\"I talked with the trainers, I talked with (president of basketball operations) Kevin (Pritchard) and I talked to our guys,\" McMillan said. \"Vic has a little tweak. Bogie has been playing for almost a year now, going back to last summer and Thaddeus has probably played more minutes than any forward in the league. So we needed to get those guys some rest.\""}
{"game_id": "0021701213", "chunk_id": "0021701213_028", "order": 28, "role": "body", "text": "Pacers: A trip to Philadelphia or Cleveland for a best-of-seven, first-round series."}
{"game_id": "0021701213", "chunk_id": "0021701213_030", "order": 30, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
