{"game_id": "0021200427", "chunk_id": "0021200427_001", "order": 1, "role": "lead", "text": "NEW YORK --  Mikhail Prokhorov saw the draining team spirit, the missing will to fight, and decided change was needed."}
{"game_id": "0021200427", "chunk_id": "0021200427_002", "order": 2, "role": "body", "text": "The Brooklyn Nets owner had to like the results in the first game under P.J. Carlesimo."}
{"game_id": "0021200427", "chunk_id": "0021200427_003", "order": 3, "role": "body", "text": "The Nets gave their interim coach a victory in his debut and the Charlotte Bobcats a 17th straight loss, getting 26 points and 11 rebounds from Brook Lopez in a 97-81 rout Friday night."}
{"game_id": "0021200427", "chunk_id": "0021200427_004", "order": 4, "role": "body", "text": "A day after firing Avery Johnson, the Nets played as they did last month, when they were 11-4 and Johnson was Eastern Conference coach of the month. They are just 4-10 in December, a slump that cost Johnson his job, but got back over .500 with ease."}
{"game_id": "0021200427", "chunk_id": "0021200427_005", "order": 5, "role": "body", "text": "\"It's hard to be confident when you're not enjoying success. So I think you have to play your way out of it, shoot your way out of it and I thought we did that tonight,\" Carlesimo said."}
{"game_id": "0021200427", "chunk_id": "0021200427_006", "order": 6, "role": "body", "text": "Deron Williams added 17 of his 19 points in the first half and Joe Johnson had 16 for the Nets, who led by 29 points and won for just the second time in seven games."}
{"game_id": "0021200427", "chunk_id": "0021200427_007", "order": 7, "role": "body", "text": "Hakim Warrick scored 13 points and Ramon Sessions had 12 for the Bobcats (7-22), who shot 38 percent and haven't won since tying last season's total with their seventh victory."}
{"game_id": "0021200427", "chunk_id": "0021200427_008", "order": 8, "role": "body", "text": "Of course, nobody is expecting the Bobcats to be any good. Prokhorov believes his team is, and he acted quickly when he didn't like the team's spirit."}
{"game_id": "0021200427", "chunk_id": "0021200427_009", "order": 9, "role": "body", "text": "The Russian billionaire cut short a ski vacation to Canada and revealed at halftime he had decided to fire Johnson last week, even before the lackluster performance on national TV against Boston on Christmas that preceded a dismal showing Wednesday in Milwaukee. The Nets fired Johnson on Thursday and promoted Carlesimo, his assistant, to interim coach."}
{"game_id": "0021200427", "chunk_id": "0021200427_010", "order": 10, "role": "body", "text": "\"I think we have very talented players but they are capable of much more than what we have seen in the recent weeks,\" Prokhorov said. \"I respect Avery and really I wish him well, but sometimes chemistry just isn't right. It happens.\""}
{"game_id": "0021200427", "chunk_id": "0021200427_011", "order": 11, "role": "body", "text": "Though names such as Phil Jackson and other top coaches have already been mentioned as replacements, Prokhorov stressed that he supports Carlesimo for the time being and is not focused on a more high-profile replacement. Lopez said that's easy for the Nets to support their interim coach."}
{"game_id": "0021200427", "chunk_id": "0021200427_012", "order": 12, "role": "body", "text": "\"He helped us focus tonight,\" Lopez said. \"He was there for us and you know we support him and he supports us."}
{"game_id": "0021200427", "chunk_id": "0021200427_013", "order": 13, "role": "body", "text": "Prokhorov has said he believes the Nets can reach the conference championship and is keeping the expectations high. Williams thinks the Nets can still achieve them."}
{"game_id": "0021200427", "chunk_id": "0021200427_014", "order": 14, "role": "body", "text": "\"I felt we're a good team all year and we just hit a rough patch,\" he said. \"We've got to fight our way out of it, so we made a step in the right direction tonight and we just keep going.\""}
{"game_id": "0021200427", "chunk_id": "0021200427_015", "order": 15, "role": "body", "text": "Carlesimo last coached his own team when he was fired by the Oklahoma City Thunder after a 1-12 start to the 2008-09 season. He previously had stints in Portland and Golden State, but said before the game he was a little more apprehensive than normal for his return to running his own club."}
{"game_id": "0021200427", "chunk_id": "0021200427_016", "order": 16, "role": "body", "text": "\"Your head's spinning a little bit, you're trying to think of all the things that were second nature,\" Carlesimo said. \"Hopefully I haven't forgotten. I'm old, but hopefully I haven't forgotten.\""}
{"game_id": "0021200427", "chunk_id": "0021200427_017", "order": 17, "role": "body", "text": "It was quickly obvious he had nothing to worry about."}
{"game_id": "0021200427", "chunk_id": "0021200427_018", "order": 18, "role": "body", "text": "The Bobcats missed 13 of their first 16 shots, making it easy for the Nets. Brooklyn scored nine straight in the middle of the first quarter to open a 12-point lead, extended it to 18 later in the period, and were ahead 33-15 headed to the second."}
{"game_id": "0021200427", "chunk_id": "0021200427_019", "order": 19, "role": "body", "text": "\"It's tough. We can't put ourselves in that kind of position,\" Bobcats guard Kemba Walker said. \"We don't have a lot of depth on our team to come back against great teams, but we do every once in a while, but we can't do that all the time. We dig ourselves in holes we can't get out of.\""}
{"game_id": "0021200427", "chunk_id": "0021200427_020", "order": 20, "role": "body", "text": "Williams, who missed Wednesday's game with a bruised right wrist and came into the game shooting under 40 percent for the season, was 7 of 14 from the field. Williams, who said recently that he preferred his old offense in Utah to Johnson's, acknowledged his confidence was down as he struggled to play the style that best suited the Nets."}
{"game_id": "0021200427", "chunk_id": "0021200427_021", "order": 21, "role": "body", "text": "\"We came out with a lot more energy,\" Williams said. \"I think we had to. I think our backs are against the wall right now.\""}
{"game_id": "0021200427", "chunk_id": "0021200427_022", "order": 22, "role": "body", "text": "The Bobcats have bigger problems. When it became obvious they had no hope of winning, coach Mike Dunlap lowered the team's goals."}
{"game_id": "0021200427", "chunk_id": "0021200427_023", "order": 23, "role": "body", "text": "\"In the fourth quarter, just the fact that we had some guys that played hard. We played a little bit of zone and that for whatever reason stopped them and broke their rhythm,\" he said. \"I just set a goal to keep them under 100 and then field goal percentage-wise, regardless of who was on the floor, I wanted them inside of 47 percent. Those were two short-term goals, even though the game appeared to be out of reach.\""}
{"game_id": "0021200427", "chunk_id": "0021200427_024", "order": 24, "role": "body", "text": "The Nets finished at 45 percent."}
{"game_id": "0021200427", "chunk_id": "0021200427_025", "order": 25, "role": "body", "text": "Lopez, the starting center whose seven-game absence with a foot injury started the Nets' downward spiral, was 9 of 12 and made all eight free throws."}
{"game_id": "0021200427", "chunk_id": "0021200427_026", "order": 26, "role": "body", "text": "Walker shot 2 of 10 and No. 2 overall pick Michael Kidd-Gilchrist was 1 of 6 for the Bobcats."}
{"game_id": "0021200427", "chunk_id": "0021200427_027", "order": 27, "role": "body", "text": "Game notes Prokhorov said he plans to meet with Carlesimo on Saturday. The Nets host Cleveland on Saturday night. ... Charlotte lost its last 23 games in last season's 7-59 season."}
{"game_id": "0021200427", "chunk_id": "0021200427_028", "order": 28, "role": "closing", "text": "Information from The Associated Press and ESPN.com NBA writer Brian Windhorst contributed to this report."}
