{"game_id": "0021400164", "chunk_id": "0021400164_001", "order": 1, "role": "lead", "text": "NEW YORK -- As shocked as they looked to still be playing, Brandon Knight's teammates didn't give up on him after his missed layup to end the first overtime.\nInstead, they gave him the ball when they needed a big shot in the second one.\nKnight made the tying 3-pointer in the second overtime and the clinching free throws with 5.6 seconds to go in the third, and the Milwaukee Bucks outlasted the Nets 122-118 on Wednesday night in coach Jason Kidd's return to Brooklyn."}
{"game_id": "0021400164", "chunk_id": "0021400164_002", "order": 2, "role": "body", "text": "\"My teammates trusted me to make the next shot to force a third overtime, so that's really what it's all about,\" Knight said, \"and we stuck through it as a team.\"\nRookie Jabari Parker scored a season-high 23 points, O.J. Mayo added 21, and Knight and Giannis Antetokounmpo each had 18 for the Bucks, who won their third straight.\nBrook Lopez scored a season-best 26 points for the Nets, who have dropped five in a row.\n\"We've got to find some ways somehow to get a win,\" Nets guard Joe Johnson said. \"When you're in a rut like this, it's tough. You've got to do all the little things. When you do get that win, it won't be certainly easy.\"\nErsan Ilyasova and Khris Middleton each made two baskets in the third overtime for the Bucks, whose players celebrated with hugs for Knight, who still looked a little dazed when it ended.\n\"He made it a little bit exciting for everybody to watch,\" Parker said.\nKnight finished 5-of-20 from the field, including the miss that had blown up on video long before the game ended. With the game tied at 105, he intercepted Johnson's pass with 2.9 seconds left in the first extra period and dribbled down the court a step ahead of the nearest Nets player but somehow missed the easiest shot in basketball, leaving Kidd and players on the Milwaukee bench in disbelief.\n\"It's a situation where you wish you could just go ahead and make it and send it home, but like I said, we still did it in a different way, and I'm happy about that,\" Knight said."}
{"game_id": "0021400164", "chunk_id": "0021400164_003", "order": 3, "role": "closing", "text": "He knocked down the 3-pointer with 19 seconds remaining in the second OT, and the Bucks went on to improve to 7-5 in Kidd's first season.\nKidd was booed and taunted as a traitor in the arena where his retired jersey hangs in the rafters by fans who haven't forgiven him for leaving the Nets after one season to take the Bucks job.\n\"I have bad hearing anyways. So I thought whatever the greeting was, it's about the players,\" Kidd said. \"People don't pay to come see the coach; they come to see the guys play.\"\nBojan Bogdanovic scored 19 points, and Deron Williams and Johnson each finished with 18 for the Nets.\nMayo made the tying basket with 30 seconds left in regulation but couldn't get a good shot up on the Bucks' last possession before the buzzer, and they went to overtime tied at 95.\nTIP-INS\nBucks: Larry Sanders started at center after missing Tuesday's game with a bruised left thigh. He scored four points in 15 minutes. ... Antetokounmpo stayed in the game after stepping on Knight's foot and twisting his ankle in overtime. He finished with 12 rebounds, four assists and three steals while playing tough defense on Johnson.\nNets: There was a video tribute in the first half for former Nets center Jason Collins, who announced his retirement Wednesday. He became the first openly gay player in one of the major North American team sports when he signed with the team in February. He also played on the Nets' back-to-back Eastern Conference championship teams in 2002-03. Collins sat courtside across from the Milwaukee bench.\nLONG LOSSES\nThe Nets fell to 2-4 in triple-overtime games. They had won their previous one, beating Toronto in London on March 5, 2011. This was the longest game in the NBA this season.\nSTREAK SNAPPED\nThe Nets had won the previous five meetings in what had been their longest active winning streak against an opponent. Before that, Milwaukee had won the previous 13 in the series.\nUP NEXT\nBucks: At Toronto on Friday.\nNets: At Oklahoma City on Friday."}
