{"game_id": "0021400154", "chunk_id": "0021400154_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- Taj Gibson stole the ball from Jamal Crawford and passed to Jimmy Butler, who sank a 17-footer, got fouled and made the free throw with two-tenths of a second left in the first half.\nJust like that, the Bulls had erased all but two of a 14-point deficit, and they sent the Clippers into a tailspin they never recovered from.\nButler led six players in double figures with 22 points in a 105-89 win Monday night, helping Chicago improve to 6-0 on the road for the first time since 1996-97. And the Bulls did it without Derrick Rose and Pau Gasol."}
{"game_id": "0021400154", "chunk_id": "0021400154_002", "order": 2, "role": "closing", "text": "With those two injured starters on the bench, the Bulls got contributions from nearly everyone else to remain the NBA's only undefeated road team while opening a season-long, seven-game trip.\n\"You tame 'em one at a time,\" coach Tom Thibodeau said. \"In this league, when you start feeling good about yourself, that's usually when you get knocked down. So we've got to keep that edge.\"\nGibson had 20 points starting in place of Gasol, Mike Dunleavy Jr. added 19 points, and Joakim Noah had 11 points and 16 rebounds.\n\"We just proved what we've proven time and again with this team -- it's a pretty resilient group,\" Dunleavy said. \"It doesn't matter who's out there for us. We're going to come out and compete and give it everything we've got.\"\nThe Bulls closed the second quarter with a 16-4 spurt to trail 50-48 at the half, highlighted by Gibson's steal and Butler's three-point play.\n\"I don't know how I was able to get a steal on him (Crawford) because his dribble is so good,\" Gibson said. \"I'm just happy Jimmy was aware I was able to make the steal.\"\nButler was coming off a career-high 32 points in a loss to Indiana. He made nine of 10 free throws, and had eight assists and six rebounds.\n\"He's having an All-Star season,\" Clippers coach Doc Rivers said of Butler, a fellow Marquette alum.\nCrawford led the Clippers with 24 points off the bench, and Blake Griffin added 19 points and 10 rebounds. DeAndre Jordan had 10 points and 17 rebounds. Griffin was just 5-of-10 from the free throw line, where the Clippers were 10-of-22.\n\"We tried to force things,\" Griffin said. \"I don't think it was a selfish thing. We were just searching. We just didn't have it going and we pressed a little bit too hard.\"\nThe Bulls enjoyed a double-digit lead throughout the fourth that reached 18 points on a basket by Aaron Brooks. The Clippers got within seven with four minutes to go, but the Bulls got consecutive 3-pointers from Dunleavy and held Los Angeles to just one field goal in the final 3:32.\n\"We take a lot of pride in going on the road and getting wins because you have to defend and rebound to do that,\" Dunleavy said. \"That's our calling card.\"\nTIP-INS\nBulls: Rose missed his second straight game with a left hamstring injury. ... Gasol, who has a left calf strain, leads the team with six double-doubles and is averaging 18.6 points and 10.6 rebounds per game.\nClippers: Glen Davis' jumper in the second quarter was his 1,500th career field goal. ... Former Clippers coach Mike Dunleavy was on hand to see his son Mike Jr. start for the Bulls. ... Former Clipper Baron Davis, former Angel Gary Matthews Jr., Billy Crystal, Penny Marshall and Rev. Jesse Jackson attended.\nSTRAINED PAU\nGasol missed his first game back in Los Angeles since leaving the Lakers.\n\"It's definitely strange,\" he said about being back in the city where he was the subject of trade rumors the last few years. \"I knew this was going to happen eventually, but I'm glad the first time is against the Clippers.\"\nThe Bulls return to play the Lakers on Jan. 29.\nUP NEXT\nBulls: At Sacramento on Thursday.\nClippers: At Orlando on Wednesday."}
