{"game_id": "0021700759", "chunk_id": "0021700759_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  CJ McCollum had inspiration for his 50-point game: His 92-year-old great aunt was visiting Portland for the first time."}
{"game_id": "0021700759", "chunk_id": "0021700759_003", "order": 3, "role": "body", "text": "McCollum scored a franchise-record 28 points in the first quarter before finishing with a career-high 50 through three, and the Portland Trail Blazers took advantage of the short-handed Chicago Bulls for a 124-108 victory Wednesday night."}
{"game_id": "0021700759", "chunk_id": "0021700759_004", "order": 4, "role": "body", "text": "\"During the game I was thinking, she probably thinks this is a really good game to come to,\" he said, laughing."}
{"game_id": "0021700759", "chunk_id": "0021700759_005", "order": 5, "role": "body", "text": "McCollum's 28 points in the opening quarter were the most by an NBA player this season. His final tally was nine points shy of the team record set by Damian Lillard last season."}
{"game_id": "0021700759", "chunk_id": "0021700759_006", "order": 6, "role": "body", "text": "\"I'm not into chasing records, man. I just want to win,\" McCollum said. \"Even throughout the game, I looked up and I was like, I can get 40. And then Ed (Davis) was like, `No, you need 50.' And Dame was like, `Get 50.' So I was like, `OK, I'll get 50 if you guys want me to.\""}
{"game_id": "0021700759", "chunk_id": "0021700759_007", "order": 7, "role": "body", "text": "Lillard also sat out the final period after adding 13 points and seven assists for the Blazers, who led by as many as 29. It was Portland's fourth straight win overall, a season high, and the club's eighth in a row at home."}
{"game_id": "0021700759", "chunk_id": "0021700759_008", "order": 8, "role": "body", "text": "Zach LaVine had a season-best 23 points in Chicago's fifth consecutive loss."}
{"game_id": "0021700759", "chunk_id": "0021700759_009", "order": 9, "role": "body", "text": "Lauri Markkanen was not with the Bulls because he was attending to a personal issue, the team said. The rookie is averaging 15.3 points and 7.7 rebounds per game. Paul Zipser started in his place."}
{"game_id": "0021700759", "chunk_id": "0021700759_010", "order": 10, "role": "body", "text": "Kris Dunn, averaging 13.7 points and 6.4 assists, missed his sixth straight game after a concussion."}
{"game_id": "0021700759", "chunk_id": "0021700759_011", "order": 11, "role": "body", "text": "The Bulls decided to sit forward Nikola Mirotic while he reportedly seeks a trade. Coach Fred Hoiberg said before the game that the 6-foot-10 forward remained back at the team hotel. Meanwhile, rumors swirled that the Bulls had a deal with the Pelicans but it fell apart."}
{"game_id": "0021700759", "chunk_id": "0021700759_012", "order": 12, "role": "body", "text": "Portland shot 74 percent in the first quarter paced by McCollum, who made four 3-pointers in the period and finished with six for the game."}
{"game_id": "0021700759", "chunk_id": "0021700759_013", "order": 13, "role": "body", "text": "\"I don't know what the right word is, but a very impressive outing for CJ,\" Trail Blazers coach Terry Stotts said. \"What he did in the first quarter was amazing. It was fun to sit back and watch that.\""}
{"game_id": "0021700759", "chunk_id": "0021700759_014", "order": 14, "role": "body", "text": "Pat Connaughton's 3-pointer put the Blazers up 54-28. McCollum punctuated the first half with a dunk, and the Blazers went into the break with a 67-44 lead."}
{"game_id": "0021700759", "chunk_id": "0021700759_015", "order": 15, "role": "body", "text": "McCollum finished the half with 32 points, one shy of Lillard's franchise record."}
{"game_id": "0021700759", "chunk_id": "0021700759_016", "order": 16, "role": "body", "text": "\"I thought we had some good looks early, we didn't make them, and then you have to guard. That's kind of been the story of these slow starts, letting teams get comfortable and in a rhythm,\" Hoiberg said. \"Our game plan was to come out, try to blitz him (McCollum). He was splitting our double teams and obviously made tough shots. Give him credit for coming out of the game and setting the tone.\""}
{"game_id": "0021700759", "chunk_id": "0021700759_017", "order": 17, "role": "body", "text": "After he sat down in the third quarter, McCollum smiled when the crowd chanted \"We want CJ!\""}
{"game_id": "0021700759", "chunk_id": "0021700759_018", "order": 18, "role": "body", "text": "\"I was thinking, I hope I don't have to go back in,\" McCollum said. \"That means we're not playing the way we should be playing. There was a lot of love tonight, and I appreciate it.\""}
{"game_id": "0021700759", "chunk_id": "0021700759_019", "order": 19, "role": "body", "text": "The Blazers did lose center Jusuf Nurkic in the fourth quarter to injury. Afterward, they said it was a bruised left quad."}
{"game_id": "0021700759", "chunk_id": "0021700759_020", "order": 20, "role": "body", "text": "Lillard went into the game needing 25 points to reach 10,000. He'll be the seventh Blazers player to reach the mark, joining Clyde Drexler, LaMarcus Aldridge, Terry Porter, Cliff Robinson, Jerome Kersey and Jim Paxson."}
{"game_id": "0021700759", "chunk_id": "0021700759_021", "order": 21, "role": "body", "text": "Portland was coming off a 104-96 victory over the Clippers at Staples Center the night before."}
{"game_id": "0021700759", "chunk_id": "0021700759_023", "order": 23, "role": "body", "text": "Bulls: Markkanen could rejoin the team on the road trip. ... Robin Lopez was greeted by warm applause at the Moda Center. Lopez was a fan favorite during his time with the Blazers from 2013-15. ... The Bulls were coming off a 110-96 loss at home to Milwaukee on Sunday."}
{"game_id": "0021700759", "chunk_id": "0021700759_024", "order": 24, "role": "body", "text": "Trail Blazers: Wore their black \"City\" uniforms for the first time. The uniforms feature a plaid pattern in a nod to Dr. Jack Ramsay, who coached the 1977 NBA championship team and had a penchant for plaid. ... McCollum's huge quarter surpassed the previous team record of 26 points set by Lillard."}
{"game_id": "0021700759", "chunk_id": "0021700759_026", "order": 26, "role": "body", "text": "McCollum joined this group of 50-point Blazers: Lillard, Damon Stoudamire, Brandon Roy, Andre Miller, Clyde Drexler and Geoff Petrie."}
{"game_id": "0021700759", "chunk_id": "0021700759_027", "order": 27, "role": "body", "text": "McCollum also joined Houston star James Harden as the only players with 50 points in three quarters this season."}
{"game_id": "0021700759", "chunk_id": "0021700759_029", "order": 29, "role": "body", "text": "Stotts said he didn't really consider playing McCollum in the fourth with a sizable lead."}
{"game_id": "0021700759", "chunk_id": "0021700759_030", "order": 30, "role": "body", "text": "\"Too risky,\" he said. \"We were up 25 and I would have left him in to get 50, but 50 is a good number.\""}
{"game_id": "0021700759", "chunk_id": "0021700759_032", "order": 32, "role": "body", "text": "The Bulls play Saturday night at the Los Angeles Clippers before finishing their three-game road trip in Sacramento."}
{"game_id": "0021700759", "chunk_id": "0021700759_033", "order": 33, "role": "body", "text": "The Trail Blazers visit Toronto on Friday."}
{"game_id": "0021700759", "chunk_id": "0021700759_035", "order": 35, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
