{"game_id": "0021700491", "chunk_id": "0021700491_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  Portland Trail Blazers coach Terry Stotts was saluting the bench players responsible for ending his team's three-game losing streak when he realized he had made one glaring omission."}
{"game_id": "0021700491", "chunk_id": "0021700491_002", "order": 2, "role": "body", "text": "Stotts left out Maurice Harkless, who scored 13 points in the fourth quarter -- including the go-ahead three-point play with 21.4 seconds remaining."}
{"game_id": "0021700491", "chunk_id": "0021700491_003", "order": 3, "role": "body", "text": "\"I knew I was missing somebody,\" Stotts said."}
{"game_id": "0021700491", "chunk_id": "0021700491_004", "order": 4, "role": "body", "text": "Harkless scored 22 points and the Blazers extended their winning streak over the Los Angeles Lakers to 14 games with a 95-92 victory Saturday night."}
{"game_id": "0021700491", "chunk_id": "0021700491_005", "order": 5, "role": "body", "text": "Harkless followed up CJ McCollum's miss and scored through contact after Lonzo Ball hit a 3-pointer to tie it at 91 with 1:45 remaining. Shabazz Napier added 21 points and McCollum had 17 for Portland."}
{"game_id": "0021700491", "chunk_id": "0021700491_006", "order": 6, "role": "body", "text": "But it was the Blazers' bench led by Harkless and Zach Collins that made up for the absence of injured star Damian Lillard, who missed his second straight game with a strained right hamstring."}
{"game_id": "0021700491", "chunk_id": "0021700491_007", "order": 7, "role": "body", "text": "Harkless and Collins combined for the Trail Blazers' first 11 points to open the fourth quarter, with Collins' turnaround leaner putting Portland ahead 74-73 with 10:17 left. Collins finished with 11 points and six rebounds."}
{"game_id": "0021700491", "chunk_id": "0021700491_008", "order": 8, "role": "body", "text": "\"The four guys off the bench really made a great contribution, and I was really happy for Mo. He hasn't been playing much and came through with a lot of big plays,\" Stotts said."}
{"game_id": "0021700491", "chunk_id": "0021700491_009", "order": 9, "role": "body", "text": "Kyle Kuzma and Jordan Clarkson each scored 18 for the Lakers, who were missing ailing forward Brandon Ingram. Ball had 10 points, eight rebounds and 11 assists."}
{"game_id": "0021700491", "chunk_id": "0021700491_010", "order": 10, "role": "body", "text": "Kentavious Caldwell-Pope missed a 3 with seven seconds remaining for Los Angeles."}
{"game_id": "0021700491", "chunk_id": "0021700491_011", "order": 11, "role": "body", "text": "\"They just had a little more grit than us,\" said Lakers guard Josh Hart, who had 11 points and 10 rebounds."}
{"game_id": "0021700491", "chunk_id": "0021700491_012", "order": 12, "role": "body", "text": "Portland used a 10-2 run over the final 1:38 of the third quarter to tie the game. Napier hit a 3-pointer with 4.5 seconds left to make it 70-all and missed a shot at the buzzer after stealing the ball from Julius Randle."}
{"game_id": "0021700491", "chunk_id": "0021700491_013", "order": 13, "role": "body", "text": "\"We just let them hang around too long,\" Ball said. \"We had opportunities to blow the game out and we never took those opportunities\""}
{"game_id": "0021700491", "chunk_id": "0021700491_015", "order": 15, "role": "body", "text": "Trail Blazers: McCollum and Napier combed for 17 points in the second after making all seven shots from the field. . F Noah Vonleh was inactive with a right hand injury."}
{"game_id": "0021700491", "chunk_id": "0021700491_016", "order": 16, "role": "body", "text": "Lakers: Kuzma was 6 of 19 from the field after shooting 58 percent (47 for 81) in his previous five games. ... C Brook Lopez missed his third consecutive game with a sprained right ankle."}
{"game_id": "0021700491", "chunk_id": "0021700491_018", "order": 18, "role": "body", "text": "Trail Blazers C Jusuf Nurkic was inadvertently backhanded by Randle on a layup in the first quarter. Nurkic was down on the court for several minutes holding his face. He had four points, two rebounds and one assist before exiting, and did not score again despite returning late in the second quarter."}
{"game_id": "0021700491", "chunk_id": "0021700491_019", "order": 19, "role": "body", "text": "Ball went to the locker room late in the second quarter with a shoulder injury, but was able to play though it. He said he felt a \"pop\" but expects to be available on Christmas."}
{"game_id": "0021700491", "chunk_id": "0021700491_021", "order": 21, "role": "body", "text": "Ingram didn't play because of a bruised right quadriceps and tendinitis in his left quadriceps, and Lakers coach Luke Walton said the second-year forward was day to day."}
{"game_id": "0021700491", "chunk_id": "0021700491_022", "order": 22, "role": "body", "text": "Ingram played 35 1/2 minutes against the Golden State Warriors on Friday, his lightest workload during a busy eight-day stretch. Los Angeles also played road games at New York and Cleveland, a home game against Golden State and a game at Houston before playing in Oakland."}
{"game_id": "0021700491", "chunk_id": "0021700491_023", "order": 23, "role": "body", "text": "\"He's been playing a lot of minutes and putting on a heavy load for us, so part of our responsibility is to do injury prevention with our guys,\" Walton said."}
{"game_id": "0021700491", "chunk_id": "0021700491_025", "order": 25, "role": "body", "text": "Trail Blazers: Host the Philadelphia 76ers on Thursday."}
{"game_id": "0021700491", "chunk_id": "0021700491_026", "order": 26, "role": "body", "text": "Lakers: Host the Minnesota Timberwolves on Monday."}
{"game_id": "0021700491", "chunk_id": "0021700491_028", "order": 28, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
