{"game_id": "0021400770", "chunk_id": "0021400770_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  At the end of an up-and-down road stretch, the Chicago Bulls trudged into the final stop of their six-game trip hoping to sustain a bit of momentum with the All-Star break fast approaching."}
{"game_id": "0021400770", "chunk_id": "0021400770_002", "order": 2, "role": "body", "text": "Mission accomplished -- thanks to some late-game assistance from the Orlando Magic."}
{"game_id": "0021400770", "chunk_id": "0021400770_003", "order": 3, "role": "body", "text": "Pau Gasol dunked in the rebound of Derrick Rose's missed layup with 9.4 seconds left, and the Bulls rallied for a 98-97 victory over the Magic on Sunday night."}
{"game_id": "0021400770", "chunk_id": "0021400770_004", "order": 4, "role": "body", "text": "Jimmy Butler led the Bulls with 27 points, and Gasol finished with 25 points and 15 rebounds. Joakim Noah added 18 points and nine rebounds."}
{"game_id": "0021400770", "chunk_id": "0021400770_005", "order": 5, "role": "body", "text": "Chicago led by as many as 16 points, before finding itself in a six-point hole with just over 2 minutes to play."}
{"game_id": "0021400770", "chunk_id": "0021400770_006", "order": 6, "role": "body", "text": "\"Today we started out like we want to play, like we were going to take another step (forward), but it was almost a step back,\" Gasol said. \"Let's face it -- we got away with one.\""}
{"game_id": "0021400770", "chunk_id": "0021400770_007", "order": 7, "role": "body", "text": "The Magic had two opportunities to win the game in the closing seconds. But Nik Vucevic's hook rolled off the rim, and Tobias Harris overshot a potential game-winning tip-in as time expired."}
{"game_id": "0021400770", "chunk_id": "0021400770_008", "order": 8, "role": "body", "text": "\"You want to be a good team, you're going to have to find different ways to win, and that's what I did like about tonight,\" Bulls coach Tom Thibodeau said."}
{"game_id": "0021400770", "chunk_id": "0021400770_009", "order": 9, "role": "body", "text": "Victor Oladipo led six Orlando players in double figures with 18 points. Harris added 15, and Vucevic 14."}
{"game_id": "0021400770", "chunk_id": "0021400770_010", "order": 10, "role": "body", "text": "After playing catch-up for most of the second half, Orlando benefited from a frenetically played fourth quarter."}
{"game_id": "0021400770", "chunk_id": "0021400770_011", "order": 11, "role": "body", "text": "Elfrid Payton scored his sixth consecutive point on a driving layup to put the Magic in front 92-91 with 3:43 remaining."}
{"game_id": "0021400770", "chunk_id": "0021400770_012", "order": 12, "role": "body", "text": "That was followed by a steal and 3-pointer from Channing Frye, and layup by Oladipo that extended that lead to 97-91."}
{"game_id": "0021400770", "chunk_id": "0021400770_013", "order": 13, "role": "body", "text": "The Bulls came up empty on their next offensive trip, but Butler stepped in front of Oladipo's pass as Orlando came down the floor, forcing Harris to grab him and commit a clear-path foul."}
{"game_id": "0021400770", "chunk_id": "0021400770_014", "order": 14, "role": "body", "text": "Butler hit both free throws, then on the ensuing possession found Rose free for a 3-pointer at the top of the key to pull Chicago within 97-96."}
{"game_id": "0021400770", "chunk_id": "0021400770_015", "order": 15, "role": "body", "text": "Orlando's Evan Fournier then got caught in a trap at halfcourt and was called for a backcourt violation with 15.5 seconds left."}
{"game_id": "0021400770", "chunk_id": "0021400770_016", "order": 16, "role": "body", "text": "Coming out of a timeout, Rose drove around Kyle O'Quinn in the corner, and nearly rolled in a floater. But Gasol was there for what turned out to be the game-winner."}
{"game_id": "0021400770", "chunk_id": "0021400770_017", "order": 17, "role": "body", "text": "\"Winning doesn't just happen. You've got to execute. It's a 48-minute game,\" Magic interim coach James Borrego said. \"We didn't execute well enough down the stretch to get the win tonight.\""}
{"game_id": "0021400770", "chunk_id": "0021400770_019", "order": 19, "role": "body", "text": "Bulls: Chicago had 27 assists on 37 made field goals. ... Mike Dunleavy (right ankle) missed his 19th straight game. Kirk Hinrich sat out with a left turf toe injury he sustained against New Orleans on Saturday."}
{"game_id": "0021400770", "chunk_id": "0021400770_020", "order": 20, "role": "body", "text": "Magic: Orlando committed 18 turnovers that led to 24 Chicago points. ... The Magic recalled rookie G Devyn Marble from his Feb. 2 assignment to the D-League Erie BayHawks. It was Marble's second stint in Erie. He has played four games there this season, averaging 17 points and 5.8 rebounds."}
{"game_id": "0021400770", "chunk_id": "0021400770_022", "order": 22, "role": "body", "text": "Gasol notched his 12th double-double in a row, extending a career high. He leads the NBA with 33 this season. In 2010-11, he set a career high with 43 double-doubles. He tied Memphis' Zach Randolph for the longest streak in the NBA this year. Among Bulls players in the last 35 seasons, his streak is second only to Michael Jordan, who had 15 in 1988-89."}
{"game_id": "0021400770", "chunk_id": "0021400770_024", "order": 24, "role": "body", "text": "Bulls: Host Sacramento on Tuesday."}
{"game_id": "0021400770", "chunk_id": "0021400770_025", "order": 25, "role": "body", "text": "Magic: Visit Washington on Monday"}
{"game_id": "0021400770", "chunk_id": "0021400770_027", "order": 27, "role": "closing", "text": "Follow Kyle Hightower on Twitter at http://www.twitter.com/khightower"}
