{"game_id": "0021400557", "chunk_id": "0021400557_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  LaMarcus Aldridge scored 25 points and the Portland Trail Blazers handed the Orlando Magic their sixth consecutive loss, 103-92 on Saturday night."}
{"game_id": "0021400557", "chunk_id": "0021400557_002", "order": 2, "role": "body", "text": "Orlando's Nikola Vucevic scored a career-high 34 points and grabbed 16 rebounds to lead the Magic (13-27)."}
{"game_id": "0021400557", "chunk_id": "0021400557_003", "order": 3, "role": "body", "text": "Aldridge hit 10 of 22 shots to help the Blazers (29-8) tie Golden State for most wins in the NBA this season."}
{"game_id": "0021400557", "chunk_id": "0021400557_004", "order": 4, "role": "body", "text": "Wesley Matthews scored 18 points, including two free throws that gave the Blazers the lead for good at 87-85 with 3:56 remaining. Portland had five players in double figures."}
{"game_id": "0021400557", "chunk_id": "0021400557_005", "order": 5, "role": "body", "text": "Victor Oladipo had 18 points and eight rebounds for Orlando."}
{"game_id": "0021400557", "chunk_id": "0021400557_006", "order": 6, "role": "body", "text": "The Magic out-rebounded Portland 49-43. The Blazers lead the NBA in rebounding at 46.7 per game."}
{"game_id": "0021400557", "chunk_id": "0021400557_007", "order": 7, "role": "body", "text": "Portland threatened to make it a rout at the outset, rolling to a 24-9 lead late in the first quarter. The Magic couldn't make shots, hitting only 5 of 22 during the opening quarter."}
{"game_id": "0021400557", "chunk_id": "0021400557_008", "order": 8, "role": "body", "text": "The Blazers led by as many as 19 during the first half before Orlando caught fire midway through the second quarter. Vucevic, who had 15 points and 10 rebounds during the first half, scored three consecutive baskets to help the Magic finish the first half on a 12-2 run, cutting the halftime deficit to 46-41."}
{"game_id": "0021400557", "chunk_id": "0021400557_009", "order": 9, "role": "body", "text": "Portland led 72-70 after three quarters, surviving a flurry from Orlando. Oladipo scored six points during an 11-0 run as the Magic grabbed a 52-48 lead three minutes into the third. The teams traded the lead 10 times during the remainder of the quarter, with Aldridge giving Portland the edge heading into the fourth on two free throws."}
{"game_id": "0021400557", "chunk_id": "0021400557_010", "order": 10, "role": "body", "text": "The Magic scored five consecutive points to tie the game at 85-85 on two free throws by Vucevic. Matthews and Lillard then hit two more each, followed by a reverse layup by Matthews for a 91-85 Portland lead. Matthews' 3-pointer with 1:10 remaining put the Blazers in front 96-89."}
{"game_id": "0021400557", "chunk_id": "0021400557_012", "order": 12, "role": "body", "text": "Magic: F Tobias Harris (ankle) and G Evan Fournier (knee) both sat out against the Blazers. They both suffered injuries during Friday's game against the Los Angeles Lakers. ... G Devyn Marble made his first NBA career start. ... The Magic's six-game losing streak is a season high."}
{"game_id": "0021400557", "chunk_id": "0021400557_013", "order": 13, "role": "body", "text": "Trail Blazers: G Allen Crabbe strained his left knee during Thursday's win over Miami, and will miss at least two games. ... Portland went 6-1 on its seven-game home stand, losing only the East Division-leading Atlanta. ... The Blazers won its NBA-best 19th home game."}
{"game_id": "0021400557", "chunk_id": "0021400557_015", "order": 15, "role": "body", "text": "Magic: Visit Chicago on Monday"}
{"game_id": "0021400557", "chunk_id": "0021400557_016", "order": 16, "role": "closing", "text": "Trail Blazers: Visit Los Angeles Lakers on Sunday"}
