{"game_id": "0021200717", "chunk_id": "0021200717_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- Goran Dragic was slowed by illness during the first three quarters against Memphis. He managed to put together a strong fourth quarter and helped Phoenix get a win."}
{"game_id": "0021200717", "chunk_id": "0021200717_002", "order": 2, "role": "body", "text": "Dragic scored 15 of his 17 points in the final period to lead the Suns to a 96-90 victory over the Grizzlies on Tuesday night."}
{"game_id": "0021200717", "chunk_id": "0021200717_003", "order": 3, "role": "body", "text": "After scoring just two points on 1-of-6 shooting through three quarters, Dragic was 5-of-6 in the fourth -- including three three-point plays to help the Suns snap a two-game losing streak."}
{"game_id": "0021200717", "chunk_id": "0021200717_004", "order": 4, "role": "body", "text": "\"I was trying to stay in the game, then got a couple of steals and (three-point plays) that gave me the momentum,\" Dragic said. \"My confidence went up. I always try to help my team and play as hard as possible.\""}
{"game_id": "0021200717", "chunk_id": "0021200717_005", "order": 5, "role": "body", "text": "After the score was tied at 88, Dragic scored six straight points to put the game away. The fourth-quarter performance was even more impressive when he said he had \"some kind of virus\" that weakened him. He said it affected his game through the first three periods and afterward said: \"Right now, I feel awful.\""}
{"game_id": "0021200717", "chunk_id": "0021200717_006", "order": 6, "role": "body", "text": "While Dragic struggled early, Marcin Gortat carried the offense and finished with 20 points on 8-of-10 shooting from the field to lead the Suns. Jermaine O'Neal had 14 points, while Kendall Marshall added 11 points and Luis Scola finished with 10."}
{"game_id": "0021200717", "chunk_id": "0021200717_007", "order": 7, "role": "body", "text": "\"(Gortat) played a good game,\" Scola said. \"In the second half, Goran took over. ... Jermaine came in and was big the whole game. I think we had a good game overall.\""}
{"game_id": "0021200717", "chunk_id": "0021200717_008", "order": 8, "role": "body", "text": "Jerryd Bayless scored a season-high 29 points on 11-of-15 shooting, including going 3-of-4 on 3-pointers, to lead the Grizzlies. Zach Randolph had 21 points and 13 rebounds, and Tayshaun Prince scored 11 points."}
{"game_id": "0021200717", "chunk_id": "0021200717_009", "order": 9, "role": "body", "text": "But down the stretch, Memphis was out of sync. The Grizzlies, like the Suns, committed seven turnovers in the fourth period, but three of Memphis' came in the final 3 minutes after Phoenix had taken the lead it would not surrender."}
{"game_id": "0021200717", "chunk_id": "0021200717_010", "order": 10, "role": "body", "text": "\"That's what we focus on,\" said Suns interim coach Lindsey Hunter, who is now 4-4 since taking over for Alvin Gentry on Jan. 20. \"That is what we are going to hang our hats on night in and night out. We don't always shoot the ball well, but one thing we can control is how we defend, and that is something we really, really stress.\""}
{"game_id": "0021200717", "chunk_id": "0021200717_011", "order": 11, "role": "body", "text": "Phoenix, which outscored Memphis 31-19 in the fourth, was able to hang on despite committing a season-high 22 turnovers, partly offset by shooting 51 percent. In addition to Gortat, O'Neal was 5-of-7 from the field, and Dragic finished 6-for-12."}
{"game_id": "0021200717", "chunk_id": "0021200717_012", "order": 12, "role": "body", "text": "\"The disappointing part is they outscored us in the paint 52-40, and they got 11 offensive rebounds for 16 second-chance points,\" Memphis coach Lionel Hollins said. \"Then we made some sloppy turnovers coming down the stretch for no reason.\""}
{"game_id": "0021200717", "chunk_id": "0021200717_013", "order": 13, "role": "body", "text": "The start of the second half was full of poor shooting. The Suns started 1-of-8, and Memphis was 2-of-17 during one stretch -- with many of those rebound tips that rolled off the rim."}
{"game_id": "0021200717", "chunk_id": "0021200717_014", "order": 14, "role": "body", "text": "The shooting percentages, which were so good in the first half, decreased to a more normal number."}
{"game_id": "0021200717", "chunk_id": "0021200717_015", "order": 15, "role": "body", "text": "Neither team was able to get much of a buffer, but Memphis did make a push behind Bayless late in the third period, and a tip-in by Prince at the horn provided Memphis with a 71-65 lead entering the fourth."}
{"game_id": "0021200717", "chunk_id": "0021200717_016", "order": 16, "role": "body", "text": "\"I just tried to get through the first three quarters,\" said Dragic, who was dealing with foul issues in addition to the virus. \"In the fourth quarter, I got my confidence up.\""}
{"game_id": "0021200717", "chunk_id": "0021200717_017", "order": 17, "role": "body", "text": "Memphis' lead didn't hold up as Dragic converted consecutive three-point plays near the midpoint of the fourth, putting Phoenix up 80-79."}
{"game_id": "0021200717", "chunk_id": "0021200717_018", "order": 18, "role": "body", "text": "Dragic converted another three-point play when he was fouled on a 10-footer in the lane for an 86-82 lead. Bayless, meanwhile, was still connecting from the top of the key, and despite Dragic's production, the Suns' lead never reached more than six."}
{"game_id": "0021200717", "chunk_id": "0021200717_019", "order": 19, "role": "body", "text": "But Memphis' turnovers stymied any chance the Grizzlies had of another run. There was a backcourt violation, a bad pass by guard Mike Conley, and then Prince and Bayless failed to connect on the inbounds pass with about 50 seconds left."}
{"game_id": "0021200717", "chunk_id": "0021200717_020", "order": 20, "role": "body", "text": "\"We had a chance to win the game, but we had too many turnovers in the fourth and didn't get any opportunities,\" said Conley, who finished with nine points on 3-of-11 shooting and handed out five assists."}
{"game_id": "0021200717", "chunk_id": "0021200717_021", "order": 21, "role": "body", "text": "Conley's drive with 3 seconds remaining gave the Grizzlies a 52-50 lead at halftime."}
{"game_id": "0021200717", "chunk_id": "0021200717_022", "order": 22, "role": "body", "text": "Gortat hit his first seven shots, part of Phoenix hitting 60 percent until the latter stages of the half. The Suns ended the half at 53 percent, Gortat going 8-of-10 from the field."}
{"game_id": "0021200717", "chunk_id": "0021200717_023", "order": 23, "role": "closing", "text": "Game notes Suns F Jermaine O'Neal returned to the lineup after missing the previous seven games due to personal medical reasons. ... Officials reviewed a last-second tip-in by Prince at the end of the third before finally ruling that it came before the buzzer. The review was so close that all three officials looked at the shot on replay all the way through the break between the third and the fourth periods. ... Jared Dudley, who averages 12.2 points, third-best on the Suns, was scoreless in 17 minutes, missing all five of his shots. ... Bayless' previous season high was 23 at Oklahoma City on Jan. 31. ...Prince, obtained last week in a three-team trade that sent Rudy Gay to Toronto, was in the Grizzlies' starting lineup after coming off the bench for his first game with Memphis. ... Phoenix is now 5-20 on the road this season. ... The Suns' 22 turnovers were the most by a Grizzlies opponent since Dec. 21, when Dallas committed 24."}
