{"game_id": "0021700787", "chunk_id": "0021700787_001", "order": 1, "role": "lead", "text": "TORONTO --  After Toronto's bench players started the fourth quarter with a bang, Raptors coach Dwane Casey let them keep playing until the final buzzer."}
{"game_id": "0021700787", "chunk_id": "0021700787_002", "order": 2, "role": "body", "text": "Delon Wright scored 15 points, DeMar DeRozan and Fred VanVleet each had 13 and the Raptors pulled away in the fourth to beat Memphis 101-86 on Sunday, their fifth straight home win over the slumping Grizzlies."}
{"game_id": "0021700787", "chunk_id": "0021700787_003", "order": 3, "role": "body", "text": "Toronto outscored Memphis 52-19 in bench points."}
{"game_id": "0021700787", "chunk_id": "0021700787_004", "order": 4, "role": "body", "text": "\"Our young guys, they brought the energy,\" Casey said. \"They did what they were supposed to do.\""}
{"game_id": "0021700787", "chunk_id": "0021700787_005", "order": 5, "role": "body", "text": "DeRozan said he was grateful for the effort from the bench, especially because of the rare noon tip-off time."}
{"game_id": "0021700787", "chunk_id": "0021700787_006", "order": 6, "role": "body", "text": "\"I made a joke saying the old guys can't get up this early in the morning for the game,\" DeRozan said. \"They came up with a lot of energy.\""}
{"game_id": "0021700787", "chunk_id": "0021700787_007", "order": 7, "role": "body", "text": "Jonas Valanciunas scored 12 points, Kyle Lowry had 11 and Pascal Siakam 10 as the Raptors improved to 21-4 at home, the best record in the NBA."}
{"game_id": "0021700787", "chunk_id": "0021700787_008", "order": 8, "role": "body", "text": "Toronto's reserves opened the fourth with a 12-4 run, turning a two-point edge into a double-digit lead with 7  1/2 minutes remaining."}
{"game_id": "0021700787", "chunk_id": "0021700787_009", "order": 9, "role": "body", "text": "\"Every time we come in with the lead we always say we're not coming out, we're going to try to take the lead up,\" Wright said. \"Coach trusted us today and we were able to finish the game and get the win.\""}
{"game_id": "0021700787", "chunk_id": "0021700787_010", "order": 10, "role": "body", "text": "Toronto is 14-3 when VanVleet scores 10 or more points. He matched his career high with seven rebounds and had eight assists."}
{"game_id": "0021700787", "chunk_id": "0021700787_011", "order": 11, "role": "body", "text": "\"We'll take any minutes we can get,\" VanVleet said of the opportunity to play the full fourth quarter. \"I think we earned it in that situation.\""}
{"game_id": "0021700787", "chunk_id": "0021700787_012", "order": 12, "role": "body", "text": "Marc Gasol scored 20 points and Andrew Harrison had 16 for the Grizzlies, who have lost six straight road games."}
{"game_id": "0021700787", "chunk_id": "0021700787_013", "order": 13, "role": "body", "text": "\"We were always chasing our tail,\" Gasol said of a fourth quarter in which the Grizzlies were outscored 25-12."}
{"game_id": "0021700787", "chunk_id": "0021700787_014", "order": 14, "role": "body", "text": "Dillon Brooks scored 12 points and JaMychal Green had 11 as Memphis lost for the sixth time in eight games."}
{"game_id": "0021700787", "chunk_id": "0021700787_015", "order": 15, "role": "body", "text": "Memphis shot 3 for 22 in the fourth, and half its points in the quarter came at the free throw line."}
{"game_id": "0021700787", "chunk_id": "0021700787_016", "order": 16, "role": "body", "text": "\"We got bogged down a little bit, couldn't find a way to create any easy baskets and we struggled to score,\" Grizzlies interim coach J.B. Bickerstaff said."}
{"game_id": "0021700787", "chunk_id": "0021700787_017", "order": 17, "role": "body", "text": "The Raptors shot 3 for 26 from 3-point range through the first three quarters but went 3 for 9 from long range in the fourth. Toronto finished 6 for 35, its lowest percentage from 3-point range this season (17.1 percent)."}
{"game_id": "0021700787", "chunk_id": "0021700787_019", "order": 19, "role": "body", "text": "Grizzlies: G Tyreke Evans missed his third straight game. Evans is away from the team amid speculation he will soon be traded. ... Memphis is 5-19 on the road. ... The Grizzlies had 19 turnovers. Their season high is 24."}
{"game_id": "0021700787", "chunk_id": "0021700787_020", "order": 20, "role": "body", "text": "Raptors: CJ Miles returned after missing the previous three games because of a sore right knee. ... Valanciunas has scored 10 or more points in seven straight games, a season-high stretch."}
{"game_id": "0021700787", "chunk_id": "0021700787_022", "order": 22, "role": "body", "text": "Lowry, who is from Philadelphia, was set to fly to Minneapolis following the game, where he planned to attend the Super Bowl between the Eagles and New England Patriots. Lowry left the arena while Casey was giving his postgame press conference, leaving a note on the chair at his locker that read \"Super Bowl Bound. Go Eagles? KLOW7.\""}
{"game_id": "0021700787", "chunk_id": "0021700787_024", "order": 24, "role": "body", "text": "Brooks, who was born in the Toronto suburb of Mississauga, made his first NBA appearance in his home country. Some 50 friends and family attended the game."}
{"game_id": "0021700787", "chunk_id": "0021700787_025", "order": 25, "role": "body", "text": "\"It's just a dream come true to play at Air Canada Centre, where you're from, where you watched since you were seven years old,\" Brooks said."}
{"game_id": "0021700787", "chunk_id": "0021700787_027", "order": 27, "role": "body", "text": "Grizzlies: Wrap up a four-game road trip at Atlanta on Tuesday."}
{"game_id": "0021700787", "chunk_id": "0021700787_028", "order": 28, "role": "body", "text": "Raptors: Host Boston on Tuesday. Toronto has won four straight home meetings with the Celtics."}
{"game_id": "0021700787", "chunk_id": "0021700787_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
