{"game_id": "0021400473", "chunk_id": "0021400473_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- While LaMarcus Aldridge might not have been at his best physically, he did have the advantage of being well-rested when the Trail Blazers took the Raptors to overtime.\nPortland's All-Star forward, who had missed three of the previous four games because of a respiratory illness, had 23 points and 13 rebounds in the 102-97 victory over Toronto on Tuesday night.\n\"I was kind of feeling it out in the first half because they hadn't played with me in two or three games,\" Aldridge said about his teammates. \"In the second half, I was trying to be more aggressive going to the basket, just trying to find my shot.\"\nThe Blazers, the first team in the NBA to 26 wins, have won four straight and nine of their past 10.\nAldridge kidded that he still had energy at the end because he'd been able to sit out of a few games, but coach Terry Stotts admired Aldridge's will after he was pressed into additional minutes because of the close game.\n\"Coming back from an illness that sapped him of a lot of energy, he showed a lot of moxie,\" Stotts said.\nDamian Lillard added 26 points and nine assists, while Wesley Matthews finished with 19 points, including five 3-pointers.\nThe Blazers rallied in the fourth quarter after trailing by 13 points, but Amir Johnson's short jumper for the Raptors tied the game 87-all and sent it to overtime.\nPortland took a 96-90 lead in the extra period on consecutive 3-pointers from Lillard, Matthews and Nicolas Batum. Kyle Lowry's layup got the Raptors within 96-94, but Greivis Vasquez was called for a clear-path foul on Batum, who made one of a pair of free throws to keep Portland in front 97-94.\nLillard made a pair of free throws with 19.4 second left, and the Raptors couldn't catch up.\n\"We just had to stay the course, we knew they were one of the better teams in the league this season, top of the Eastern Conference and they've played well against Western Conference teams,\" Lillard said. \"We knew it was going to be a fight coming in.\"\nLowry finished with 25 points while James Johnson had 14 points and 11 rebounds for his first double-double of the season for Toronto.\nThe Raptors had won the first two games of their six-game road trip, including a 116-102 victory at Denver on Sunday.\nPortland was coming off a 101-79 rout of the New York Knicks on Sunday.\n\"They're one of the best teams in the NBA,\" Lowry said of the Blazers. \"They've got two All-Stars over there. They're a complete team.\"\nKnown for their 3-point shooting, the Blazers were uncharacteristically 2-for-17 from beyond the arc in the first half. Portland had 16 or more 3-pointers in each of the previous three games.\nAfter taking a 45-38 lead into the break, the Raptors extended their lead to 56-45 on James Johnson's tip shot in the third quarter.\nThe Blazers showed some spark at the end of the third quarter when Lillard nailed a 3-pointer to narrow Toronto's lead to 70-63.\nThe Blazers chipped away, and Lillard's layup narrowed it to 83-82 with 4:23 left. Aldridge tied it, making one of two free throws, but Terrence Ross answered with a reverse dunk for the Raptors.\nPortland took its first lead since the game's opening minutes on Aldridge's jumper with 1:36 to go.\nLowry missed an open jumper from the baseline, then his layup with 10 second left was blocked by Joel Freeland. But Amir Johnson's jumper with 4.7 seconds left tied it.\nLillard missed a layup as time ran out in regulation.\n\"I love the way we competed in a hostile environment,\" Raptors coach Dwane Casey said. \"If you can compete in that environment, the way we did tonight, you can compete in a lot of places.\"\nTIP INS\nRaptors: Raptors' guard Terrence Ross went to Portland's Jefferson High School. ...... Landry Fields has missed four games because of a concussion.\nTrail Blazers: Before the game, the Blazers put center Meyers Leonard on the inactive list with a left shoulder strain. ... Portland had won the previous 10 of 11 against the Raptors.\nPUT A BOW ON 2014\nStotts is giving the Blazers the next two days off, including the New Year's Day.\n\"I'm pleased. I think anybody would have taken this record going into 2015,\" he said. \"The most important thing is that we've still got 49 games to go. We're not even halfway through. But it's good to be where we are.\"\nUP NEXT\nThe Raptors visit the Golden State Warriors on Friday.\nThe Trail Blazers host the Atlanta Hawks on Saturday."}
