{"game_id": "0021701132", "chunk_id": "0021701132_001", "order": 1, "role": "lead", "text": "HOUSTON --  Gerald Green was born and raised in Houston and represents the city to the fullest, from the large block letters that spell out the name of the city on his left forearm to the intricate braids in his hair that form the `H' from the Houston Astros logo."}
{"game_id": "0021701132", "chunk_id": "0021701132_002", "order": 2, "role": "body", "text": "So the veteran, who joined the Rockets in December, relished his buzzer-beating shot that gave them a win over the Phoenix Suns on Friday night a little more than any of the other big shots in his career because it came in his hometown."}
{"game_id": "0021701132", "chunk_id": "0021701132_003", "order": 3, "role": "body", "text": "\"I think what makes it more fun is I'm from here,\" said Green, who made his first start of the season. \"Never really got a chance to do that in front of my mom and my dad before so I think that was more special to me.\""}
{"game_id": "0021701132", "chunk_id": "0021701132_004", "order": 4, "role": "body", "text": "Green's shot capped Houston's rally from a 21-point, second-half deficit to get the 104-103 victory."}
{"game_id": "0021701132", "chunk_id": "0021701132_005", "order": 5, "role": "body", "text": "The win was Houston's 11th straight and extended Phoenix's skid to 14 games, which ties a franchise record."}
{"game_id": "0021701132", "chunk_id": "0021701132_006", "order": 6, "role": "body", "text": "James Harden hit a 3-pointer to tie it at 101-all with 12 seconds left before rookie Josh Jackson put Phoenix on top with a basket with 1.4 seconds remaining."}
{"game_id": "0021701132", "chunk_id": "0021701132_007", "order": 7, "role": "body", "text": "After a timeout, Trevor Ariza found Green in the corner and he knocked down the shot to extend Houston's streak. Green's teammates mobbed him after the shot and he ended up on his back on the court with a huge grin on his face."}
{"game_id": "0021701132", "chunk_id": "0021701132_008", "order": 8, "role": "body", "text": "\"That right there I just felt like a kid again,\" he said. \"One of those moments you dream about when you were little.\""}
{"game_id": "0021701132", "chunk_id": "0021701132_009", "order": 9, "role": "body", "text": "Houston rested Chris Paul, Eric Gordon and Nene after clinching the No. 1 seed in the Western Conference on Thursday with Golden State's loss to Milwaukee. The Rockets that did play looked uninspired early against the team with the NBA's worst record, and Houston trailed by 17 at halftime."}
{"game_id": "0021701132", "chunk_id": "0021701132_010", "order": 10, "role": "body", "text": "\"I feel like I really didn't get a rhythm, we didn't have a rhythm and they were playing much harder than us,\" Harden said. \"So we just had to pick our intensity up defensively and then we finally got some shots to fall.\""}
{"game_id": "0021701132", "chunk_id": "0021701132_011", "order": 11, "role": "body", "text": "They began chipping away at the lead in the third, but never led in the second half until Green's game-winner."}
{"game_id": "0021701132", "chunk_id": "0021701132_012", "order": 12, "role": "body", "text": "Harden had 28 points, 10 assists and eight rebounds. P.J. Tucker added 18 points and made a career-high five 3-pointers."}
{"game_id": "0021701132", "chunk_id": "0021701132_013", "order": 13, "role": "body", "text": "Jackson had 27 points for the Suns, who haven't won since Feb. 28, and Troy Daniels added 23."}
{"game_id": "0021701132", "chunk_id": "0021701132_014", "order": 14, "role": "body", "text": "Suns coach Jay Triano hopes that games like these will help his team down the road."}
{"game_id": "0021701132", "chunk_id": "0021701132_015", "order": 15, "role": "body", "text": "\"There's no better way of learning than being in these games and going through an experience like that,\" he said."}
{"game_id": "0021701132", "chunk_id": "0021701132_016", "order": 16, "role": "body", "text": "The Suns were up by four with about a minute left after a basket by Daniels. Harden missed two free throws soon after that and Tucker made one of two to cut the lead to 101-98 with 46 seconds remaining."}
{"game_id": "0021701132", "chunk_id": "0021701132_017", "order": 17, "role": "body", "text": "Phoenix was up by 11 to start the fourth and remained up by that margin with about 8 minutes left before Houston scored seven points in a row to cut the lead to 89-85."}
{"game_id": "0021701132", "chunk_id": "0021701132_018", "order": 18, "role": "body", "text": "Jackson made a layup after that, but Houston scored the next five points, capped by a 3 from Tucker, to get within one with about 5 1/2 minutes left."}
{"game_id": "0021701132", "chunk_id": "0021701132_019", "order": 19, "role": "body", "text": "The Suns were up by 17 at halftime and had a 14-point lead early in the third when Daniels made three 3-pointers to power a 9-2 run and push the lead to 71-50 with about 8 minutes left in the quarter."}
{"game_id": "0021701132", "chunk_id": "0021701132_020", "order": 20, "role": "body", "text": "The Rockets finally found a bit of rhythm after that, using a 10-2 spurt to get within 73-60 midway through the quarter."}
{"game_id": "0021701132", "chunk_id": "0021701132_021", "order": 21, "role": "body", "text": "Joe Johnson scored the last four points of the third to cut Phoenix's lead to 86-75 entering the fourth."}
{"game_id": "0021701132", "chunk_id": "0021701132_023", "order": 23, "role": "body", "text": "Suns: Devin Booker missed his seventh straight game with a sprained right hand. ... Alex Len sat out for the second straight game with a sprained left ankle. ... Phoenix had 17 turnovers."}
{"game_id": "0021701132", "chunk_id": "0021701132_024", "order": 24, "role": "body", "text": "Rockets: Luc Mbah a Moute returned after missing the last three games with a sore left knee. ... Houston signed Tim Quarterman for the rest of the season on Friday. He appeared in 11 games for the Clippers' G League team this season. ...  Green finished with 15 points."}
{"game_id": "0021701132", "chunk_id": "0021701132_026", "order": 26, "role": "body", "text": "Tucker on Houston's ability to bounce back and win games where the team has started poorly: \"We've done it all year. We've had games where we've been terrible ... and turn it on for four or five minutes and win games. As bad as it is, it's still good to win.\""}
{"game_id": "0021701132", "chunk_id": "0021701132_028", "order": 28, "role": "body", "text": "Jackson has scored 15 or more points in nine straight games to join Walter Davis and Alvan Adams as the only rookies in franchise history to have such a streak. He's averaging 21.1 points in that span, highlighted by a career-high 36 against Golden State on March 17."}
{"game_id": "0021701132", "chunk_id": "0021701132_030", "order": 30, "role": "body", "text": "Suns: Visit Warriors on Sunday."}
{"game_id": "0021701132", "chunk_id": "0021701132_031", "order": 31, "role": "closing", "text": "Rockets: Visit Spurs on Sunday."}
