{"game_id": "0021700901", "chunk_id": "0021700901_001", "order": 1, "role": "lead", "text": "TORONTO --  A big start to the second half helped the Toronto Raptors hand the slumping Detroit Pistons another loss."}
{"game_id": "0021700901", "chunk_id": "0021700901_002", "order": 2, "role": "body", "text": "DeMar DeRozan and Kyle Lowry each scored 20 points, Serge Ibaka had 19 and the Raptors routed the Pistons 123-94 on Monday night for their seventh win in eight games."}
{"game_id": "0021700901", "chunk_id": "0021700901_003", "order": 3, "role": "body", "text": "Pascal Siakam added 11 points as the Raptors improved to 25-5 at home, the best record in the NBA."}
{"game_id": "0021700901", "chunk_id": "0021700901_004", "order": 4, "role": "body", "text": "The Eastern Conference leaders bounced back from Friday's overtime loss against Milwaukee, using spurts at the start of the second and third quarters to hand the Pistons their third straight defeat and sixth in seven games."}
{"game_id": "0021700901", "chunk_id": "0021700901_005", "order": 5, "role": "body", "text": "After Detroit scored 12 of the final 18 points of the first half to trail 59-53 at the break, Raptors coach Dwane Casey encouraged his team to come out strong at the start of the third, knowing the Pistons would be tired after losing at Charlotte on Sunday night."}
{"game_id": "0021700901", "chunk_id": "0021700901_006", "order": 6, "role": "body", "text": "\"We knew that they had played last night so we wanted to make sure we used our speed and kept the pace,\" Casey said."}
{"game_id": "0021700901", "chunk_id": "0021700901_007", "order": 7, "role": "body", "text": "The plan worked perfectly as Ibaka scored seven points in a 19-4 run that turned the tide in Toronto's favor."}
{"game_id": "0021700901", "chunk_id": "0021700901_008", "order": 8, "role": "body", "text": "\"We battled hard to get back in the game in the second quarter and then the first six minutes of the third quarter we were bad and it was over from there,\" Pistons coach Stan Van Gundy said."}
{"game_id": "0021700901", "chunk_id": "0021700901_009", "order": 9, "role": "body", "text": "Andre Drummond had 18 points and 18 rebounds but Detroit lost its fourth consecutive meeting with Toronto. Ish Smith scored 16 points, Reggie Bullock had 14, and Blake Griffin and Dwight Buycks added 12 apiece for the Pistons, who fell three games behind idle Miami for the final playoff spot in the East."}
{"game_id": "0021700901", "chunk_id": "0021700901_010", "order": 10, "role": "body", "text": "\"We have to get it rolling,\" Bullock said. \"It's a frustrating time for us. We have to try to get it rolling before it's pretty much over.\""}
{"game_id": "0021700901", "chunk_id": "0021700901_011", "order": 11, "role": "body", "text": "James Ennis scored 10 points for the Pistons, who never led after the first quarter."}
{"game_id": "0021700901", "chunk_id": "0021700901_012", "order": 12, "role": "body", "text": "All six of Lowry's field goals were 3-pointers. He finished 6 for 8 from long range and missed two attempts from inside the arc. Toronto made 17 3-pointers and became the third straight opponent to hit at least 16 against the Pistons."}
{"game_id": "0021700901", "chunk_id": "0021700901_013", "order": 13, "role": "body", "text": "\"We are just not doing a good job of closing out to people at all,\" Van Gundy said."}
{"game_id": "0021700901", "chunk_id": "0021700901_014", "order": 14, "role": "body", "text": "DeRozan scored 11 points in the first and Toronto led 30-26 after one."}
{"game_id": "0021700901", "chunk_id": "0021700901_015", "order": 15, "role": "body", "text": "After Buycks scored the opening basket of the second, Toronto responded with a 10-0 run, taking a 40-28 lead with 9:30 left in the half. Bullock scored eight points in the second as the Pistons closed the half with a 12-6 run, cutting it to 59-53 at the break."}
{"game_id": "0021700901", "chunk_id": "0021700901_016", "order": 16, "role": "body", "text": "Ibaka had nine in the third and Lowry added eight as Toronto took a 93-75 lead into the fourth."}
{"game_id": "0021700901", "chunk_id": "0021700901_018", "order": 18, "role": "body", "text": "Pistons: Van Gundy said G Reggie Jackson (sprained right ankle) is expected to resume practicing before a six-game Western Conference road trip that begins March 13. ... Drummond had nine rebounds in the first quarter. ... Detroit is 9-19 on the road."}
{"game_id": "0021700901", "chunk_id": "0021700901_019", "order": 19, "role": "body", "text": "Raptors: DeRozan went 10 for 11 at the free throw line. He was the only Toronto player to miss a free throw, as the Raptors finished 22 for 23. ... Ibaka had nine rebounds."}
{"game_id": "0021700901", "chunk_id": "0021700901_021", "order": 21, "role": "body", "text": "Toronto had 31 assists, the fourth time in six games they've had 30 or more. The Raptors are 36-10 when they record at least 20 assists."}
{"game_id": "0021700901", "chunk_id": "0021700901_023", "order": 23, "role": "body", "text": "Toronto C Jakob Poeltl had the dunk of the game, a one-handed slam over Drummond in the fourth."}
{"game_id": "0021700901", "chunk_id": "0021700901_025", "order": 25, "role": "body", "text": "Pistons: Host Milwaukee on Wednesday. Detroit has lost two of three meetings with the Bucks this season."}
{"game_id": "0021700901", "chunk_id": "0021700901_026", "order": 26, "role": "body", "text": "Raptors: Begin a two-game road trip at Orlando on Wednesday."}
{"game_id": "0021700901", "chunk_id": "0021700901_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
