{"game_id": "0021301129", "chunk_id": "0021301129_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- Early in the second half the Memphis Grizzlies found a way to change the momentum and ended up with a key win.\nMemphis turned up the defensive intensity, overtook Denver in the third quarter and stayed in postseason contention with a 100-92 victory over the Nuggets on Friday night.\n\"I thought we did a much better job coming out of the locker room in the third quarter,\" said Memphis center Marc Gasol, who led the Grizzlies with 24 points.\n\"We were more us, especially defensively. Offensively things may go well; may not. But defensively, we feed off that. We need that energy defensively.\"\nMike Conley was a key factor in Memphis' second-half burst, scoring 19 of his 21 points after the break. Memphis, which trailed 47-43 at halftime, outscored the Nuggets 57-45 in the final two quarters and forced 13 Denver turnovers in the second half.\n\"I was happy with the way we responded after they came back at us at the end of the first half,\" Conley said, acknowledging he was angry with the way Memphis closed the second quarter.\n\"We came back in the third quarter and guys were focused and guys had a lot of energy.\"\nZach Randolph added 20 points and grabbed 15 rebounds. Tayshaun Prince scored 12 before leaving with an ankle injury in the first half and Courtney Lee scored 10 for Memphis, which won its 11th straight home game.\nRandy Foye led the Nuggets, while Kenneth Faried finished with 17 points and 12 rebounds for Denver, which lost its fifth in the past six.\nTy Lawson, who didn't start for disciplinary reasons, scored 16 points, while Timofey Mozgov had 13 points. Aaron Brooks scored 11.\nBut Lawson also left the arena in a boot, suffering left ankle sprain with about 3 minutes left.\n\"That is just, unfortunately, been the story of our season,\" Nuggets coach Brian Shaw said of the Lawson injury.\nMemphis entered the game a half-game behind Dallas for the seventh playoff spot and tied with the Phoenix Suns for eighth. Dallas and Phoenix played later Friday night.\nMemphis, which was coming off a five-game road trip, struggled at times, and the Nuggets took advantage by erasing a double-digit first-half lead.\nNeither team shot well for the game, Memphis connected on 39 percent of its shots, compared to 36 percent for the Nuggets. There were some ugly individual stats as Darrell Arthur was 1 of 9 for the Nuggets, including 1 of 5 from outside the arc.\nConley scored 21 points, but was 5 of 14 and missed six of seven from 3-point range. There were 53 fouls in the game to slow the pace.\n\"It was kind of an ugly game,\" Shaw said.\nMemphis took the lead midway through the third quarter and built the advantage to 14 on a 3-pointer from Conley topped off by a free throw when Shaw was given a technical with 4:43 left.\n\"(The Grizzlies) are scrapping,\" Shaw said. \"They want to solidify a spot in the playoffs. Obviously, we're just trying to play hard and doing what we can to get the win.\"\nDenver dominated the second quarter after Memphis took an early 12-point lead. The Nuggets guards had little problem getting to the rim as Lawson, who didn't start after missing the team breakfast Friday, scored 15 points in the half leading Denver.\nMemphis was 5 of 6 to start the game, but was 11 of 42 the rest of the half for a 33 percent shooting performance. Denver was only slightly better, hitting 36 percent.\n\"We had a good start to the game,\" Memphis coach Dave Joerger said. \"We were crisp, executed well and got stops. ... We were lax after that (in the second quarter).\"\nBut the Grizzlies opened the second half with much more energy and, led by 10 points from Conley in the third, were able to retake the lead, carrying a 69-65 lead into the fourth.\n\"In the second half, we had three stops in a row seven times,\" Joerger said. \"That was very positive for us. We came out with a good defensive mindset. I know outside of the second quarter, I was very impressed with our performance defensively.\"\nGame notes\nThe game was the first at home for Memphis since March 24. The Grizzlies went 2/3 on a road trip since then. ... The Nuggets are 3-27 this season when they don't reach 100."}
