{"game_id": "0021200993", "chunk_id": "0021200993_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Andrew Bynum's season is over. So are Philadelphia's playoff hopes."}
{"game_id": "0021200993", "chunk_id": "0021200993_002", "order": 2, "role": "body", "text": "The 76ers just refuse to fade away."}
{"game_id": "0021200993", "chunk_id": "0021200993_003", "order": 3, "role": "body", "text": "Spencer Hawes had 18 points and 13 rebounds, and Jrue Holiday scored 27 points to lead the Sixers to a 101-100 victory over the Portland Trail Blazers on Monday night."}
{"game_id": "0021200993", "chunk_id": "0021200993_004", "order": 4, "role": "body", "text": "The Sixers got a needed victory after they finally announced Bynum, their 7-foot center, will have season-ending arthroscopic surgery on both knees Tuesday. Bynum has not played this season because of bone bruises in both of his knees."}
{"game_id": "0021200993", "chunk_id": "0021200993_005", "order": 5, "role": "body", "text": "Bynum's status has been uncertain since training camp, a constant string of optimism and speculation that ended with a whimper. The 25-year-old Bynum is an unrestricted free agent and he may never play for the Sixers."}
{"game_id": "0021200993", "chunk_id": "0021200993_006", "order": 6, "role": "body", "text": "With their sky-high preseason expectations dashed, the Sixers have tried not think about what might have been."}
{"game_id": "0021200993", "chunk_id": "0021200993_007", "order": 7, "role": "body", "text": "\"We never played with him, so it's just speculation from there,\" Hawes said. \"We know how bad he wants to get back out there. But sitting around doing that is not going to bring him back any quicker.\""}
{"game_id": "0021200993", "chunk_id": "0021200993_008", "order": 8, "role": "body", "text": "The Sixers wasted a 14-point lead and Portland took the lead late in the fourth. Holiday, though, rallied the Sixers and stretched the lead to 101-97 on a pair of free throws."}
{"game_id": "0021200993", "chunk_id": "0021200993_009", "order": 9, "role": "body", "text": "Damian Lillard hit a 3-pointer to cut it to 101-100. Holiday fell on the inbound pass and the ball sailed into the Sixers bench, giving Portland the ball with 7.1 seconds left. LaMarcus Aldridge missed the potential winner on a turnaround over Hawes."}
{"game_id": "0021200993", "chunk_id": "0021200993_010", "order": 10, "role": "body", "text": "Aldridge had 32 points and 14 rebounds, and Lillard scored 27 points."}
{"game_id": "0021200993", "chunk_id": "0021200993_011", "order": 11, "role": "body", "text": "After Portland rallied for the lead, Holiday, Hawes and Thaddeus Young hit three straight shots for a 97-92 advantage with 1:07 left. Aldridge's 3-pointer with 17 seconds remaining cut it to 99-97. Holiday then hit two free throws for a five-point cushion."}
{"game_id": "0021200993", "chunk_id": "0021200993_012", "order": 12, "role": "body", "text": "Portland seemed to catch a break after Philadelphia's inbounds pass was a turnover. Aldridge had dominated Hawes for most of the game but his last-chance shot hit off the back of the rim."}
{"game_id": "0021200993", "chunk_id": "0021200993_013", "order": 13, "role": "body", "text": "\"The play was made for it to get to me,\" Aldridge said. \"I backed him in, got real deep in the paint, turned to the baseline and I thought it was in. I'll make that nine times out of 10. But it was just in and out.\""}
{"game_id": "0021200993", "chunk_id": "0021200993_014", "order": 14, "role": "body", "text": "Young scored 19 points and Dorell Wright had 16 for the Sixers."}
{"game_id": "0021200993", "chunk_id": "0021200993_015", "order": 15, "role": "body", "text": "Bynum was shut down in training camp as a precaution and the Sixers originally hoped he'd be ready by opening night Oct. 31. Bynum said since training camp he would play this season. But after he experienced swelling in his right knee after a 5-on-5 scrimmage late last month, he acknowledged a return might not be possible."}
{"game_id": "0021200993", "chunk_id": "0021200993_016", "order": 16, "role": "body", "text": "\"It's sad,\" coach Doug Collins said. \"It's been a tough year for our franchise, it's been a tough year for Andrew.\""}
{"game_id": "0021200993", "chunk_id": "0021200993_017", "order": 17, "role": "body", "text": "No other Trail Blazer hit double digits. Lillard shot 5 of 7 on 3-pointers."}
{"game_id": "0021200993", "chunk_id": "0021200993_018", "order": 18, "role": "body", "text": "The Trail Blazers wiped out a 14-point deficit when Eric Maynor and Lillard hit 3-pointers on consecutive possessions to tie the game at 82."}
{"game_id": "0021200993", "chunk_id": "0021200993_019", "order": 19, "role": "body", "text": "Holiday, Philadelphia's All-Star guard, hit his third 3 of the game to help the Sixers take the lead back."}
{"game_id": "0021200993", "chunk_id": "0021200993_020", "order": 20, "role": "body", "text": "Wesley Matthews tied it on a layup after Hawes lost control of the ball. Luke Babbit at last put the Trail Blazers ahead with a 3 for a 90-87 lead."}
{"game_id": "0021200993", "chunk_id": "0021200993_021", "order": 21, "role": "body", "text": "But the lead didn't last. With the Sixers' postseason hopes long over because Bynum's crushing injury, they haven't folded. The beat Brooklyn, Indiana and Portland, and took the Heat down to the wire in a 3-1 homestand."}
{"game_id": "0021200993", "chunk_id": "0021200993_022", "order": 22, "role": "body", "text": "\"We have a lot of guys real comfortable in their roles right now, which can be the most important thing,\" Hawes said."}
{"game_id": "0021200993", "chunk_id": "0021200993_023", "order": 23, "role": "body", "text": "Now, the bad news for the Sixers. They play 12 of their final 16 games on the road. The Sixers have dropped 13 in a row on the road since beating the Los Angeles Lakers on Jan. 1 and are 6-23 overall."}
{"game_id": "0021200993", "chunk_id": "0021200993_024", "order": 24, "role": "body", "text": "Portland hoped to make up ground in the playoff race as it opened a five-game road trip. The Trail Blazers entered only 3 1/2 games behind Los Angeles for eighth place in the Western Conference. Up ahead: games at Milwaukee, Chicago, Atlanta and Oklahoma City."}
{"game_id": "0021200993", "chunk_id": "0021200993_025", "order": 25, "role": "body", "text": "All those teams are pointed toward the postseason, so they couldn't afford to slip up in Philadelphia. But they did."}
{"game_id": "0021200993", "chunk_id": "0021200993_026", "order": 26, "role": "body", "text": "\"We just came up short,\" coach Terry Stotts said. \"I thought our energy picked up defensively for the whole second half. And we played better, but they made tough shots down the stretch.\""}
{"game_id": "0021200993", "chunk_id": "0021200993_027", "order": 27, "role": "body", "text": "Aldridge, coming off a 31-point game against Detroit, did his part to keep Portland in the hunt in the first half. He went straight over Hawes on just about every possession and scored 18 points in the half. Portland made seven straight field goals in the first quarter to take a 58-50 lead into halftime."}
{"game_id": "0021200993", "chunk_id": "0021200993_028", "order": 28, "role": "closing", "text": "Game notes The Sixers made 10 of 13 free throws and Portland was only 12 of 14. ... Holiday hit three 3s. ... The Sixers shot 50 percent from the field (43 of 86)."}
