{"game_id": "0021400078", "chunk_id": "0021400078_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- Even without injured stars Kevin Durant and Russell Westbrook, Oklahoma City made the latest chapter of its rivalry with Memphis look like many of the previous ones.\nOklahoma City's Serge Ibaka missed what would have been a game-winning 3-pointer at the buzzer, and Memphis held on for a 91-89 win Friday night to remain unbeaten."}
{"game_id": "0021400078", "chunk_id": "0021400078_002", "order": 2, "role": "body", "text": "The Thunder won last season's first-round playoff series 4-3, and four of the games went to overtime. The Grizzlies expected the same kind of game, even with the Thunder short-handed.\n\"It's just the OKC-Memphis rivalry,\" said Mike Conley, who led the Grizzlies with 20 points. \"It's always going to be close, no matter who's out there.\"\nConley's 3-pointer with 38.3 seconds left gave Memphis the lead for good.\n\"It was a good look,\" he said. \"We moved the ball well that possession. It seemed like me and Courtney (Lee) were playing buddy ball there, trying to figure out who's going to take the shot. We got a good look, and we just happened to stick to it and make it.\"\nOklahoma City had a chance to take the lead with 5.9 seconds remaining, but the Thunder were called for a five-second violation. Oklahoma City then fouled Lee, who made one of two free throws. That gave the Thunder the ball, down two, with 2.4 seconds to go.\nIbaka's shot from beyond the top of the key just missed.\n\"Serge put it up,\" teammate Reggie Jackson said. \"From where I was it looked like it had a good chance. Unfortunately, it didn't go in.\"\nLee scored 17 points and Zach Randolph added 16 for the Grizzlies (6-0).\nJackson had 22 points, eight assists and seven rebounds. Jeremy Lamb scored 17 points, Ibaka scored 16 and Steven Adams added 13 points and 11 rebounds for the Thunder (1-5)."}
{"game_id": "0021400078", "chunk_id": "0021400078_003", "order": 3, "role": "closing", "text": "Memphis led 49-40 at halftime, then scored the first four points of the second half before the Thunder called a timeout.\nOklahoma City charged back when Ibaka and Jackson hit back-to-back 3s to cut Memphis' lead to two and get the crowd back into the game. Memphis took a 66-62 lead into the fourth quarter.\nThe Grizzlies began the final period on an 8-3 run to pull ahead 74-65, but a two-handed jam by Ibaka cut it to 78-76 with just more than 5 minutes to play. Lamb hit a 3-pointer that tied it with just over 4 minutes remaining.\nThat's when Memphis' experience kicked in.\n\"Fortunately, we're a team that doesn't win by a lot of points,\" Conley said. \"Big wins are 10, 11 points for us. So we're used to playing in late-game situations -- being down two, being down one, going down to the last minute.\"\nTIP-INS\nGrizzlies: Memphis committed only three turnovers in the first half. ... Leading scorer Marc Gasol was held to two points on 1-for-5 shooting in the first half. He finished with eight. ... Memphis made 14 of 17 free throws, while Oklahoma City hit just 3 of 11.\nThunder: Lamb played for the first time this season after missing the first five games with a lower back strain. ... The Thunder announced earlier in the day that they signed G Ish Smith. He entered with 4:14 left in the second quarter and played 5 minutes. ... Lance Thomas, a training camp invitee, got his second start.\nINJURY BUG\nDurant, Westbrook, Grant Jerrett (left ankle surgery), Mitch McGary (broken left foot), Anthony Morrow (left MCL sprain), Andre Roberson (left foot sprain) and Perry Jones (bruised right knee) all sat out for the Thunder.\nUNFAMILIAR TERRITORY\nThe Thunder started just one player, Ibaka, who was a starter during last season's first-round series, eliminating much of the familiarity that came from three playoff matchups in four years.\nQUOTE OF THE NIGHT\n\"We expected them to come out and play with nothing to lose,\" Conley said of the Thunder. \"Those guys are NBA players. A lot of those guys have played on a lot of other teams. We expected them to come out and show what they've got.\"\nUP NEXT\nMemphis visits Milwaukee on Saturday.\nOklahoma City hosts Sacramento on Sunday."}
