{"game_id": "0021700067", "chunk_id": "0021700067_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  The Milwaukee Bucks wanted to play a game in the aging arena where the team got its start to celebrate the franchise's half-century in existence."}
{"game_id": "0021700067", "chunk_id": "0021700067_002", "order": 2, "role": "body", "text": "Al Horford and the Boston Celtics spoiled the party."}
{"game_id": "0021700067", "chunk_id": "0021700067_003", "order": 3, "role": "body", "text": "Horford had 27 points and nine rebounds, held league scoring leader Giannis Antetokounmpo in check for long stretches and sank back-to-back 3-pointers late in the third quarter as the Celtics beat the Bucks 96-89 on Thursday night."}
{"game_id": "0021700067", "chunk_id": "0021700067_004", "order": 4, "role": "body", "text": "\"He was great on both ends of the floor,\" Celtics coach Brad Stevens said. \"He guarded Giannis a large part of the night and I thought did a great job on him and then he obviously hit the big 3s.\""}
{"game_id": "0021700067", "chunk_id": "0021700067_005", "order": 5, "role": "body", "text": "Kyrie Irving added 24 points and seven assists for Boston, which avenged a loss to Milwaukee in Boston earlier this month."}
{"game_id": "0021700067", "chunk_id": "0021700067_006", "order": 6, "role": "body", "text": "The game was played at the UW-Milwaukee Panther Arena, formerly known as the MECCA, which served as the Bucks' home from 1968 until the team moved into the Bradley Center in 1988. The Bucks chose to play one game this season at the 11,000-seat arena to mark the team's 50th anniversary. The Bucks will move into a new arena next season."}
{"game_id": "0021700067", "chunk_id": "0021700067_007", "order": 7, "role": "body", "text": "Antetokounmpo had 28 points. Khris Middleton and Malcolm Brogdon added 15 apiece."}
{"game_id": "0021700067", "chunk_id": "0021700067_008", "order": 8, "role": "body", "text": "Antetokounmpo, who came into the game leading the league with nearly 37 points per game, scored just 11 in the first half before matching that total in the third quarter as the Bucks built a seven-point lead midway through the period."}
{"game_id": "0021700067", "chunk_id": "0021700067_009", "order": 9, "role": "body", "text": "\"(Antetokounmpo) is a guy that wills his way to the paint, and the big challenge for me was to stay between him and the basket and make him shoot over me,\" Horford said."}
{"game_id": "0021700067", "chunk_id": "0021700067_010", "order": 10, "role": "body", "text": "Horford held Antetokounmpo in check until the third quarter."}
{"game_id": "0021700067", "chunk_id": "0021700067_011", "order": 11, "role": "body", "text": "\"In the first half, I couldn't make plays for my team because there was a lot of people in the paint,\" Antetokounmpo said. \"In the second half, things opened up a little bit. I was trying to be aggressive and make something happen.\""}
{"game_id": "0021700067", "chunk_id": "0021700067_012", "order": 12, "role": "body", "text": "The Celtics grabbed control in the fourth, building a 12-point lead midway through the period before Tony Snell sank back-to-back 3-pointers, bringing the capacity crowd to its feet and forcing a timeout. The Celtics quickly built the lead back to double digits, but the Bucks briefly rallied again. Brogdon's layup brought Milwaukee within five points with just under 4 minutes remaining but the Bucks would get no closer."}
{"game_id": "0021700067", "chunk_id": "0021700067_013", "order": 13, "role": "body", "text": "The Celtics jumped out to a 10-point lead early in the first quarter and led 28-23 after the period, led by Irving's nine points. The Bucks led 44-43 at the half on a late running dunk by Middleton. Irving had 16 first-half points."}
{"game_id": "0021700067", "chunk_id": "0021700067_015", "order": 15, "role": "body", "text": "Celtics: G Marcus Smart, who sat out the previous two games with a sprained left ankle, returned to action, scoring eight points in 26 minutes. ... F Daniel Theis made his first career start."}
{"game_id": "0021700067", "chunk_id": "0021700067_016", "order": 16, "role": "body", "text": "Bucks: Brogdon returned after missing one game with a left ankle sprain. ... DeAndre Liggins received a technical foul after blocking Terry Rozier's shot, then standing over him after he fell to the floor."}
{"game_id": "0021700067", "chunk_id": "0021700067_018", "order": 18, "role": "body", "text": "The game was played on a replica of the colorful MECCA court, designed by pop artist Robert Indiana in 1977. \"It's a little cozy,\" Bucks coach Jason Kidd said of the arena."}
{"game_id": "0021700067", "chunk_id": "0021700067_019", "order": 19, "role": "body", "text": "Stevens made several trips to the arena while coaching in college at Butler University, a one-time Horizon League member along with the University of Wisconsin-Milwaukee, which plays its home games there. \"It's fun to be part of these types of games, when you talk about the history of this building and what it has meant to Milwaukee and the NBA,\" Stevens said."}
{"game_id": "0021700067", "chunk_id": "0021700067_020", "order": 20, "role": "body", "text": "The Bucks wore uniforms designed after those from their inaugural season in 1968. Jon McGlocklin, known as \"Mr. Buck,\" addressed the crowd before the game. McGlocklin played on the first team, scored the first basket in team history and started on the 1971 championship squad. He's a long-time television analyst for the team."}
{"game_id": "0021700067", "chunk_id": "0021700067_022", "order": 22, "role": "body", "text": "\"It was great to see the intimacy of those seats out there, as well as the fans kind of being right on top of us,\" Irving said."}
{"game_id": "0021700067", "chunk_id": "0021700067_023", "order": 23, "role": "body", "text": "Bucks guard Matthew Dellavedova, who was born two years after Milwaukee played its last game at the arena, enjoyed the experience. \"It was a cool experience playing here and hearing a lot of stories from local people in Milwaukee when they attended games here.\""}
{"game_id": "0021700067", "chunk_id": "0021700067_024", "order": 24, "role": "body", "text": "Milwaukee center John Henson described the conditions on the court as \"chilly,\" but he appreciated the opportunity, nonetheless. \"I thought the floor was nice. It was cool just to see the colors.\""}
{"game_id": "0021700067", "chunk_id": "0021700067_026", "order": 26, "role": "body", "text": "Celtics: Visit Miami on Saturday night."}
{"game_id": "0021700067", "chunk_id": "0021700067_027", "order": 27, "role": "closing", "text": "Bucks: Visit Atlanta on Sunday to start a six-game road trip."}
