{"game_id": "0021700182", "chunk_id": "0021700182_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Fatigued after a hard-fought road win the previous night, Giannis Antetokounmpo recognized the importance of following up with a win at home."}
{"game_id": "0021700182", "chunk_id": "0021700182_002", "order": 2, "role": "body", "text": "\"It was tough. A lot of us were tired,\" Antetokounmpo said after the Milwaukee Bucks defeated the Los Angeles Lakers 98-90 on Saturday night."}
{"game_id": "0021700182", "chunk_id": "0021700182_003", "order": 3, "role": "body", "text": "The Bucks won in San Antonio 94-87 on Friday night."}
{"game_id": "0021700182", "chunk_id": "0021700182_004", "order": 4, "role": "body", "text": "\"We played hard last night, but to validate last night's win we needed to win tonight,\" Antetokounmpo said."}
{"game_id": "0021700182", "chunk_id": "0021700182_005", "order": 5, "role": "body", "text": "Antetokounmpo scored 33 points and had a season-high 15 rebounds to help Milwaukee overcome Lonzo Ball's historic triple-double."}
{"game_id": "0021700182", "chunk_id": "0021700182_006", "order": 6, "role": "body", "text": "Ball became the youngest player in NBA history to record a triple-double when he had 17 points, 13 assists and 12 rebounds. At 20 years and 15 days, he bested LeBron James by four days to become the youngest to accomplish the feat."}
{"game_id": "0021700182", "chunk_id": "0021700182_007", "order": 7, "role": "body", "text": "The accomplishment meant little to Ball, given the outcome."}
{"game_id": "0021700182", "chunk_id": "0021700182_008", "order": 8, "role": "body", "text": "\"I really don't care,\" Ball said. \"I just wanted to win tonight. I thought we put ourselves in a good position to get it, but it didn't happen.\""}
{"game_id": "0021700182", "chunk_id": "0021700182_009", "order": 9, "role": "body", "text": "Ball had struggled mightily in the early going this season getting shots to fall until finding a groove against the Bucks."}
{"game_id": "0021700182", "chunk_id": "0021700182_010", "order": 10, "role": "body", "text": "\"He was really good tonight,\" Lakers coach Luke Walton said. \"Obviously, it helps when you get some of those shots to go in. I thought he did a great job of playing at a pace, creating for others, constantly being the aggressor on the offensive end, keeping the defense on their heels.\""}
{"game_id": "0021700182", "chunk_id": "0021700182_011", "order": 11, "role": "body", "text": "Milwaukee used a 9-2 run at the end of the third quarter to grab a 77-67 lead."}
{"game_id": "0021700182", "chunk_id": "0021700182_012", "order": 12, "role": "body", "text": "The Bucks maintained a double-digit lead throughout most of the fourth. After the Lakers pulled within seven with just over five minutes left, Antetokounmpo threw down a dunk while being fouled. He made the free throw to grow the Bucks' lead back to 10 points. He followed with a twisting layup on the next possession as the Bucks gained control."}
{"game_id": "0021700182", "chunk_id": "0021700182_013", "order": 13, "role": "body", "text": "Bucks coach Jason Kidd credited his team's effort."}
{"game_id": "0021700182", "chunk_id": "0021700182_014", "order": 14, "role": "body", "text": "\"Guys were tired there at the end, but it just showed the maturity of us understanding what was at stake,\" Kidd said."}
{"game_id": "0021700182", "chunk_id": "0021700182_015", "order": 15, "role": "body", "text": "Ball had 11 points, 10 assists and six rebounds in the first half. He made just three of 12 shots in a loss at Washington on Thursday, but finished 7-for-12 and made 3-of-5 shots from three-point range against the Bucks."}
{"game_id": "0021700182", "chunk_id": "0021700182_016", "order": 16, "role": "body", "text": "\"I told you, I am going to keep shooting,\" Ball said. \"They fell tonight.\""}
{"game_id": "0021700182", "chunk_id": "0021700182_018", "order": 18, "role": "body", "text": "Kidd, who had a storied career as a point guard, had high praise for Ball's performance. \"He got off to a great start shooting the ball,\" Kidd said. \"His strengths are finding his teammates and rebounding the ball, making the game easy for his teammates. He did that at a very high level tonight.\""}
{"game_id": "0021700182", "chunk_id": "0021700182_020", "order": 20, "role": "body", "text": "After an impressive game on Friday night, Eric Bledsoe's home debut got off to a rough start. Acquired from Phoenix earlier in the week, the 6-foot-1 guard missed his first four shots. He finished with 11 points on 4-for-13 shooting. Kidd likes the added dimension Bledsoe brings to the Bucks offense.  \"He brings a dynamic we haven't had since Brandon Knight, and that's speed,\" he said."}
{"game_id": "0021700182", "chunk_id": "0021700182_022", "order": 22, "role": "body", "text": "After surrendering 124 points in a loss to Cleveland on Nov. 7, the Bucks have held their last two opponents to 90 points or less. \"Defense wins games,\" Kidd said. \"I thought the guys did a great job of focusing on the defensive end, rebounding the ball, taking care of the ball.\""}
{"game_id": "0021700182", "chunk_id": "0021700182_024", "order": 24, "role": "body", "text": "Lakers: Coming off a game in which he made just one of seven three-point attempts, Ball began by draining both of his 3-point attempts in the first quarter. ... The near-capacity crowd booed Ball nearly every time he touched the ball early in the game. ... G Vander Blue, last year's D-League MVP, entered the game in the second quarter, seeing action at the Bradley Center for the first time since playing for Marquette University in the 2012-13 season."}
{"game_id": "0021700182", "chunk_id": "0021700182_025", "order": 25, "role": "body", "text": "Bucks: Mirza Teletovic missed a second consecutive game with left knee soreness. Coach Jason Kidd said he doesn't expect Teletovic to return to practice until Wednesday. .Milwaukee played its third set of back-to-back games this season."}
{"game_id": "0021700182", "chunk_id": "0021700182_027", "order": 27, "role": "body", "text": "Lakers: At Phoenix on Monday night."}
{"game_id": "0021700182", "chunk_id": "0021700182_028", "order": 28, "role": "closing", "text": "Bucks: Host Memphis on Monday night."}
