{"game_id": "0021700746", "chunk_id": "0021700746_001", "order": 1, "role": "lead", "text": "TORONTO --  The Toronto Raptors stiffened up after a sloppy first half to extend their streak of home dominance over the Minnesota Timberwolves"}
{"game_id": "0021700746", "chunk_id": "0021700746_002", "order": 2, "role": "body", "text": "DeMar DeRozan scored 23 points, Jonas Valanciunas had 18 points and 11 rebounds and the Raptors rallied from a 13-point deficit in to beat the Timberwolves 109-104 on Tuesday night."}
{"game_id": "0021700746", "chunk_id": "0021700746_003", "order": 3, "role": "body", "text": "Kyle Lowry and Serge Ibaka each scored 15 points and Jakob Poeltl had six of his 12 points in the fourth quarter as the Raptors won their 14th straight home meeting with Minnesota, building on the longest home winning streak against a single opponent in team history."}
{"game_id": "0021700746", "chunk_id": "0021700746_004", "order": 4, "role": "body", "text": "Toronto outscored Minnesota 58-47 in the second half, holding the Timberwolves to 18 for 44 shooting after Minnesota shot 24 for 41 in the first and second quarters."}
{"game_id": "0021700746", "chunk_id": "0021700746_005", "order": 5, "role": "body", "text": "\"We were more physical,\" Raptors coach Dwane Casey said. \"In the first half we were soft as tissue.\""}
{"game_id": "0021700746", "chunk_id": "0021700746_006", "order": 6, "role": "body", "text": "DeRozan scored 19 points after halftime, including eight in the final quarter."}
{"game_id": "0021700746", "chunk_id": "0021700746_007", "order": 7, "role": "body", "text": "\"We picked it up,\" he said. \"We were a lot more aggressive, especially defensively.\""}
{"game_id": "0021700746", "chunk_id": "0021700746_008", "order": 8, "role": "body", "text": "Toronto is 19-4 at home this season, the second-best record in the NBA behind San Antonio (21-4)."}
{"game_id": "0021700746", "chunk_id": "0021700746_009", "order": 9, "role": "body", "text": "Jimmy Butler scored 25 points, Wiggins had 15 and Jeff Teague and Gorgiu Dieng each finished with 14 but the Timberwolves lost for the fourth time in five games."}
{"game_id": "0021700746", "chunk_id": "0021700746_010", "order": 10, "role": "body", "text": "Taj Gibson scored 12 points and Karl-Anthony Towns had 11 points and 10 rebounds for Minnesota."}
{"game_id": "0021700746", "chunk_id": "0021700746_011", "order": 11, "role": "body", "text": "The Timberwolves went 1-8 on the road in January. An 8-0 mark at home gave them a 9-8 record overall in their NBA-leading 17 games this month."}
{"game_id": "0021700746", "chunk_id": "0021700746_012", "order": 12, "role": "body", "text": "Wiggins said he's glad the busy month is coming to an end."}
{"game_id": "0021700746", "chunk_id": "0021700746_013", "order": 13, "role": "body", "text": "\"Definitely,\" he said. \"Looking forward to a new month.\""}
{"game_id": "0021700746", "chunk_id": "0021700746_014", "order": 14, "role": "body", "text": "Towns said changing the calendar won't be enough to change Minnesota's fortunes."}
{"game_id": "0021700746", "chunk_id": "0021700746_015", "order": 15, "role": "body", "text": "\"It doesn't matter what month it is, what day it is, what year it is,\" Towns said. \"When we step on the court as the Minnesota Timberwolves, we've got to find ways to win. We didn't do that tonight.\""}
{"game_id": "0021700746", "chunk_id": "0021700746_016", "order": 16, "role": "body", "text": "Trailing 80-78 to begin the fourth, Toronto tied it on a fast break dunk by Norman Powell. Wiggins replied with a layup, but Poeltl's layup sparked a 12-2 Raptors run over the next three minutes, putting Toronto up 92-84 with 7:46 remaining."}
{"game_id": "0021700746", "chunk_id": "0021700746_017", "order": 17, "role": "body", "text": "Wiggins made his first 3 with 1:01 left, capping a 7-0 Minnesota spurt that cut the gap to two, 103-101. Following a Toronto timeout, DeRozan's short jumper pushed the lead back to four points."}
{"game_id": "0021700746", "chunk_id": "0021700746_018", "order": 18, "role": "body", "text": "Wiggins missed a 3 with 21 seconds left and DeRozan was fouled after grabbing the rebound. He and Valanciunas each made a pair of free throws in the final seconds."}
{"game_id": "0021700746", "chunk_id": "0021700746_019", "order": 19, "role": "body", "text": "Making his lone appearance of the season in his home city, Wiggins missed his first six shots and finished 7 for 22, going 1 for 6 from 3-point range and coming up empty on a dunk in the fourth."}
{"game_id": "0021700746", "chunk_id": "0021700746_020", "order": 20, "role": "body", "text": "\"If I'm in a shooting slump, I just keep shooting,\" he said."}
{"game_id": "0021700746", "chunk_id": "0021700746_022", "order": 22, "role": "body", "text": "Timberwolves: Dieng made his first six shots before missing. ... Butler has scored 20 or more in six straight games. .... Towns recorded his NBA-leading 45th double-double."}
{"game_id": "0021700746", "chunk_id": "0021700746_023", "order": 23, "role": "body", "text": "Raptors: F C.J. Miles (right knee) was not available. ... Toronto has 18 assists on 19 first-half baskets. ... Lowry led the Raptors with nine assists."}
{"game_id": "0021700746", "chunk_id": "0021700746_025", "order": 25, "role": "body", "text": "Minnesota has not won in Toronto since Jan. 21, 2004, when current Timberwolves star Andrew Wiggins was eight years old."}
{"game_id": "0021700746", "chunk_id": "0021700746_027", "order": 27, "role": "body", "text": "Raptors G Fred VanVleet flew home to Rockford, Illinois, following Sunday's home win over the Lakers to attend the birth of his first child, a girl. VanVleet was excused from practice Monday and rejoined the team about an hour before game time Tuesday. He finished with 10 points."}
{"game_id": "0021700746", "chunk_id": "0021700746_028", "order": 28, "role": "body", "text": "\"Going from Daddy mode to playing a game, I thought he played a heck of a game,\" Casey said."}
{"game_id": "0021700746", "chunk_id": "0021700746_030", "order": 30, "role": "body", "text": "Timberwolves: Host the Bucks on Thursday. Minnesota lost at Milwaukee earlier this season."}
{"game_id": "0021700746", "chunk_id": "0021700746_031", "order": 31, "role": "closing", "text": "Raptors: Visit Washington on Thursday. Toronto has won seven straight road meetings with the Wizards."}
