{"game_id": "0021700123", "chunk_id": "0021700123_001", "order": 1, "role": "lead", "text": "ATLANTA --  The Houston Rockets overwhelmed the woeful Atlanta Hawks with fast-break baskets and 3-point shooting."}
{"game_id": "0021700123", "chunk_id": "0021700123_002", "order": 2, "role": "body", "text": "James Harden scored 21 of his 29 points in Houston's high-scoring first half, and the Rockets handed the Hawks their eighth straight loss with a 119-104 victory Friday night."}
{"game_id": "0021700123", "chunk_id": "0021700123_003", "order": 3, "role": "body", "text": "The Rockets scored 28 fast-break points, almost doubling their previous high of 15."}
{"game_id": "0021700123", "chunk_id": "0021700123_004", "order": 4, "role": "body", "text": "\"We don't want to hold the ball,\" Houston coach Mike D'Antoni said. \"And we want to make quick decisions. ... I just think we did a lot of good things.\""}
{"game_id": "0021700123", "chunk_id": "0021700123_005", "order": 5, "role": "body", "text": "Houston led 69-51 at halftime with its highest-scoring half of the season. The Rockets went 11 for 22 from 3-point range in the first half and 16 for 47 from beyond the arc for the game."}
{"game_id": "0021700123", "chunk_id": "0021700123_006", "order": 6, "role": "body", "text": "\"We haven't been shooting the 3-ball all that great this year,\" said Eric Gordon, who made three 3s and had 20 points. \"... Once we start shooting 3s we'll be hard to stop.\""}
{"game_id": "0021700123", "chunk_id": "0021700123_007", "order": 7, "role": "body", "text": "Luc Mbah a Moute also scored 20 points to help Houston improve to 6-1 on the road. The Southwest Division-leading Rockets (7-3) closed a stretch where they played five of six games away from Houston, including back-to-back road wins against the Knicks and Hawks."}
{"game_id": "0021700123", "chunk_id": "0021700123_008", "order": 8, "role": "body", "text": "\"A good two games for us, but it's got to be not just two games or 10 games, it's got to be an entire season to get where we want to go,\" Harden said."}
{"game_id": "0021700123", "chunk_id": "0021700123_009", "order": 9, "role": "body", "text": "Kent Bazemore scored 18 points for the Hawks (1-8), who have not won since their season-opening victory at Dallas."}
{"game_id": "0021700123", "chunk_id": "0021700123_010", "order": 10, "role": "body", "text": "Bazemore had the difficult task of defending Harden."}
{"game_id": "0021700123", "chunk_id": "0021700123_011", "order": 11, "role": "body", "text": "\"They just shoot the crap out of the ball,\" Bazemore said. \"You can be six inches from it and they let it go. ... When a team like that comes in, it's going to be a tough challenge. You have to play about flawless.\""}
{"game_id": "0021700123", "chunk_id": "0021700123_012", "order": 12, "role": "body", "text": "Dennis Schroder and Taurean Prince each had 16 points for Atlanta. Luke Babbitt scored 12 points on four 3-pointers, and rookie John Collins had eight points and 12 rebounds."}
{"game_id": "0021700123", "chunk_id": "0021700123_014", "order": 14, "role": "body", "text": "Rockets: It was Houston's first win over Atlanta since Nov. 27, 2013, snapping a streak of seven straight losses in the series. ... Harden had 11 assists for his fourth double-double of the season. ... Clint Capela, who had 12 points, answered a 10-0 run by Atlanta in the second period with three straight jams. The center's third dunk, a two-hander, led to an Atlanta timeout."}
{"game_id": "0021700123", "chunk_id": "0021700123_015", "order": 15, "role": "body", "text": "Hawks: In a halftime ceremony, the Hawks retired a ceremonial jersey to honor Atlanta mayor Kasim Reed, who helped keep the team in its downtown location. The city is providing $142.5 million of the $192.5 million in the two-year renovation of Philips Arena. The Hawks agreed to an 18-year lease extension to remain at the city-owned arena through 2046. ... G Malcolm Delaney (ankle) did not play. ... Coach Mike Budenholzer was called for a technical foul in the second period."}
{"game_id": "0021700123", "chunk_id": "0021700123_017", "order": 17, "role": "body", "text": "Asked when All-Star point guard Chris Paul will return from a left knee injury, D'Antoni said: \"I hope tomorrow, but it's not gonna be.\" After that tease, D'Antoni said he expects Paul to miss another two weeks. \"But we're going to be cautious with it so it could stretch a few more days,\" he said."}
{"game_id": "0021700123", "chunk_id": "0021700123_018", "order": 18, "role": "body", "text": "Paul was with the team in Atlanta while missing his ninth straight game."}
{"game_id": "0021700123", "chunk_id": "0021700123_020", "order": 20, "role": "body", "text": "Point guard Isaiah Taylor, who played four games with Houston last season, continues to earn substantial playing time after signing with the Hawks on Oct. 17. He had 12 points and a team-high five assists in about 25 minutes against his former team."}
{"game_id": "0021700123", "chunk_id": "0021700123_021", "order": 21, "role": "body", "text": "\"His speed is what makes him special,\" Budenholzer said. \"Everybody sees how he can get to the paint, get to the rim. He makes people play fast with him. ... He's made a good first impression.\""}
{"game_id": "0021700123", "chunk_id": "0021700123_023", "order": 23, "role": "body", "text": "Rockets: Host Utah on Sunday in the first of three straight home games."}
{"game_id": "0021700123", "chunk_id": "0021700123_024", "order": 24, "role": "body", "text": "Hawks: Visit Cleveland on Sunday."}
{"game_id": "0021700123", "chunk_id": "0021700123_026", "order": 26, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
