{"game_id": "0021400345", "chunk_id": "0021400345_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Mike Conley fired an errant pass straight into a women's lap, knocking over a beer and spilling the suds onto the court."}
{"game_id": "0021400345", "chunk_id": "0021400345_002", "order": 2, "role": "body", "text": "He was much more on target aiming for the net."}
{"game_id": "0021400345", "chunk_id": "0021400345_003", "order": 3, "role": "body", "text": "Conley hit the tying 3-pointer to send the game into overtime and scored a career-high 36 points, leading the Memphis Grizzlies past the Philadelphia 76ers, 120-115 on Saturday night."}
{"game_id": "0021400345", "chunk_id": "0021400345_004", "order": 4, "role": "body", "text": "\"I lined it up pretty good,\" Conley said. \"I was able to get a good look.\""}
{"game_id": "0021400345", "chunk_id": "0021400345_005", "order": 5, "role": "body", "text": "Conley had plenty of good looks in the fourth and sparked a Grizzlies rally from 18 points down over the final 7 minutes of regulation to keep the Sixers winless at home. Conley scored 16 points in the fourth and kept Memphis in the hunt for best record in the Western Conference."}
{"game_id": "0021400345", "chunk_id": "0021400345_006", "order": 6, "role": "body", "text": "Zach Randolph had 24 points and 11 rebounds. Conley was 13 of 22 from the floor, hit five 3-pointers and had nine assists."}
{"game_id": "0021400345", "chunk_id": "0021400345_007", "order": 7, "role": "body", "text": "Michael Carter-Williams had an empty triple-double for the Sixers with 16 points, 11 assists and 11 rebounds. But a handful of turnovers and poor shot selection helped doom the Sixers in the fourth and OT."}
{"game_id": "0021400345", "chunk_id": "0021400345_008", "order": 8, "role": "body", "text": "The Sixers are the only winless team at home in the NBA at 0-12."}
{"game_id": "0021400345", "chunk_id": "0021400345_009", "order": 9, "role": "body", "text": "Actor Will Smith, who owns a small stake in the 76ers, sat courtside."}
{"game_id": "0021400345", "chunk_id": "0021400345_010", "order": 10, "role": "body", "text": "The Fresh Prince wasn't around at the end for this one, and neither was the 76ers' lead."}
{"game_id": "0021400345", "chunk_id": "0021400345_011", "order": 11, "role": "body", "text": "The Sixers led 95-77 with 7:39 left in the fourth when the Grizzlies started to storm back."}
{"game_id": "0021400345", "chunk_id": "0021400345_012", "order": 12, "role": "body", "text": "Conley buried a 3 to make it 102-97 and Beno Udrih hit one to keep the Grizzlies within six. Conley struck again with another 3-pointer with 45 seconds left and it was suddenly 107-104."}
{"game_id": "0021400345", "chunk_id": "0021400345_013", "order": 13, "role": "body", "text": "Like most bad teams, the Sixers unraveled down the stretch. Carter-Williams was whistled for a push-off and Hollis Thompson was called for goaltending to help the Grizzlies pull within one."}
{"game_id": "0021400345", "chunk_id": "0021400345_014", "order": 14, "role": "body", "text": "Thompson, who scored 21 points, appeared to seal the rare win with a pair of free throws."}
{"game_id": "0021400345", "chunk_id": "0021400345_015", "order": 15, "role": "body", "text": "But Conley was left open to bury the 25-footer and tie the game at 109. Conley made 4 of 5 3-pointers in the fourth and scored 16 points without attempting a free throw."}
{"game_id": "0021400345", "chunk_id": "0021400345_016", "order": 16, "role": "body", "text": "Conley delivered in OT, too. His 3 with 23 seconds left pushed the lead to 119-112 and thwarted any last-gasp effort of a Sixers rally."}
{"game_id": "0021400345", "chunk_id": "0021400345_017", "order": 17, "role": "body", "text": "\"Lot of teams would have looked at the scoreboard and said a lot of things aren't going our way,\" he said. \"But we fought through it.\""}
{"game_id": "0021400345", "chunk_id": "0021400345_018", "order": 18, "role": "body", "text": "Both teams were on the back end of a back-to-back. The 76ers lost at Brooklyn on Friday and the Grizzlies won in double overtime against Charlotte."}
{"game_id": "0021400345", "chunk_id": "0021400345_019", "order": 19, "role": "body", "text": "\"Mike Conley just said, `Hey, I'm not tired. I want to win. Leave me in. I'll do whatever it takes,' so I got him enough minutes,\" coach David Joerger said. \"It's been a tough two games to be 2-0 when we could wake up tomorrow and be 0-2 on this stretch.\""}
{"game_id": "0021400345", "chunk_id": "0021400345_020", "order": 20, "role": "body", "text": "Carter-Williams had five of his six turnovers in the fourth quarter and overtime."}
{"game_id": "0021400345", "chunk_id": "0021400345_021", "order": 21, "role": "body", "text": "\"I was trying to do too much,\" Carter-Williams said."}
{"game_id": "0021400345", "chunk_id": "0021400345_022", "order": 22, "role": "body", "text": "The Philly fans roared when Smith, wearing a Phillies cap, was introduced to the crowd. The fans sang along to the team anthem \"Here Come The Sixers.\" And they all stood for an overdue ovation when the Sixers walked off the court up 12 in the third."}
{"game_id": "0021400345", "chunk_id": "0021400345_023", "order": 23, "role": "body", "text": "Thompson snapped a tie game with a tip-in midway through the third and the Sixers appeared in control. Thompson buried a 3-pointer from the corner in the fourth for an 88-71 lead."}
{"game_id": "0021400345", "chunk_id": "0021400345_024", "order": 24, "role": "body", "text": "\"I want to stand here and tell everybody that it's a great learning experience, and there's some truth to that,\" coach Brett Brown said. \"But the truth of the matter is, that's a gut-wrenching loss. That's a fact. I feel for those guys.\""}
{"game_id": "0021400345", "chunk_id": "0021400345_026", "order": 26, "role": "body", "text": "Grizzlies: Memphis shot 2 of 12 from 3-point range through the first three quarters and 9 of 14 in the fourth quarter and overtime."}
{"game_id": "0021400345", "chunk_id": "0021400345_027", "order": 27, "role": "body", "text": "76ers: The 76ers had 71 points with 3:32 left in the third quarter. They scored only 70 in Friday's loss at Brooklyn. ... Carter-Williams has had at least six rebounds and six assists in each of the last nine games. ... With the addition this week of forward Ronald Roberts, the 76ers have had 11 undrafted players on their roster this season."}
{"game_id": "0021400345", "chunk_id": "0021400345_029", "order": 29, "role": "body", "text": "Brown knew before the game the talent didn't necessarily match up on paper. \"To think we're going to beat them apples to apples, we're not,\" Brown said. \"They've got better apples.\""}
{"game_id": "0021400345", "chunk_id": "0021400345_031", "order": 31, "role": "body", "text": "Grizzlies: Host Golden State on Tuesday."}
