{"game_id": "0021401043", "chunk_id": "0021401043_001", "order": 1, "role": "lead", "text": "BOSTON --  The Detroit Pistons' playoff hopes likely faded away a couple of weeks ago. They can still have a say on who might get there."}
{"game_id": "0021401043", "chunk_id": "0021401043_002", "order": 2, "role": "body", "text": "Andre Drummond had 18 points and 22 rebounds, Kentavious Caldwell-Pope scored seven of his 27 points in overtime and the Pistons beat the Boston Celtics 105-97 on Sunday."}
{"game_id": "0021401043", "chunk_id": "0021401043_003", "order": 3, "role": "body", "text": "Reggie Jackson added 17 points, 11 assists and nine rebounds for the Pistons, who won for the third time in four games after a 10-game losing streak."}
{"game_id": "0021401043", "chunk_id": "0021401043_004", "order": 4, "role": "body", "text": "Evan Turner had 23 points and Jae Crowder 19 for Boston, which lost its third straight. With the loss, the Celtics fell out of the final position in a tight race for the Eastern Conference's eighth and last playoff spot."}
{"game_id": "0021401043", "chunk_id": "0021401043_005", "order": 5, "role": "body", "text": "\"Totally cliche when you are as far back as we are with 12 games to go to talk about playoffs,\" Pistons coach Stan Van Gundy said. \"We'd have to go on a huge run and probably win 11 of 12, so we are just worried about the next game.\""}
{"game_id": "0021401043", "chunk_id": "0021401043_006", "order": 6, "role": "body", "text": "Detroit snapped an eight-game road losing streak, sending Boston to just its second home loss in its last 11 games."}
{"game_id": "0021401043", "chunk_id": "0021401043_007", "order": 7, "role": "body", "text": "\"Yeah. These are the ones that hurt,\" Crowder said. \"We have to have these games. Those guys are really playing for nothing. Even though they are in the hunt, they're really not playing for anything as of late. Those are the teams that can harm you the most.\""}
{"game_id": "0021401043", "chunk_id": "0021401043_008", "order": 8, "role": "body", "text": "The Pistons wiped out a deficit late in regulation, then scored on their first two possessions of overtime and opened with a 7-0 run."}
{"game_id": "0021401043", "chunk_id": "0021401043_009", "order": 9, "role": "body", "text": "Caldwell-Pope had a driving basket and Jodie Meeks nailed a 3-pointer from the left corner. Caldwell-Pope then capped the spree with a 3-pointer, making it 95-88."}
{"game_id": "0021401043", "chunk_id": "0021401043_010", "order": 10, "role": "body", "text": "Trailing by four with under 2 minutes left in regulation, Detroit scored the next five points, the last coming on Tayshaun Prince's 3-pointer from the right corner, making it 86-85 with 1:15 left."}
{"game_id": "0021401043", "chunk_id": "0021401043_011", "order": 11, "role": "body", "text": "Crowder then had a three-point play before Jackson's bank shot tied it at 88-all."}
{"game_id": "0021401043", "chunk_id": "0021401043_012", "order": 12, "role": "body", "text": "Following Jackson's miss and a Celtics timeout, Turner lost control before he could get a shot off, sending the game to OT."}
{"game_id": "0021401043", "chunk_id": "0021401043_013", "order": 13, "role": "body", "text": "The Pistons trailed by six after three quarters and opened the fourth with a 16-9 run to take their first lead since early in the second quarter."}
{"game_id": "0021401043", "chunk_id": "0021401043_014", "order": 14, "role": "body", "text": "\"We were flying around the first three quarters,\" Boston coach Brad Stevens said. \"I thought we slowed down a little in the fourth.\""}
{"game_id": "0021401043", "chunk_id": "0021401043_015", "order": 15, "role": "body", "text": "Boston had pulled to a 10-point edge midway into the third quarter on Avery Bradley's 3-pointer from the right corner, but the Pistons started to continually pound it inside to Drummond, forcing Boston's overmatched inside players to collect fouls on a number of possessions."}
{"game_id": "0021401043", "chunk_id": "0021401043_016", "order": 16, "role": "body", "text": "\"The big fella did a great job of stealing all those rebounds,\" Pistons forward Caron Butler said."}
{"game_id": "0021401043", "chunk_id": "0021401043_017", "order": 17, "role": "body", "text": "Detroit couldn't take advantage of it, though, because Drummond was just 2 for 7 from the line."}
{"game_id": "0021401043", "chunk_id": "0021401043_018", "order": 18, "role": "body", "text": "The Celtics led 47-41 at halftime."}
{"game_id": "0021401043", "chunk_id": "0021401043_021", "order": 21, "role": "body", "text": "Pistons: Butler was hit on the head battling for a rebound late in the second quarter and walked to the bench slowly, rubbing the top of his head. He returned to action in the second half. ... Drummond matched Boston's team total with eight rebounds in the first quarter. The rest of his teammates had five. ... Drummond missed his first seven free throws before swishing two straight. He ended up 2 for 11."}
{"game_id": "0021401043", "chunk_id": "0021401043_022", "order": 22, "role": "body", "text": "Celtics: G Marcus Smart sat out Sunday, suspended one game for punching San Antonio's Matt Bonner in the groin on Friday. ... Stevens said G Isaiah Thomas would not be back Monday. Thomas missed his seventh straight Sunday with a bruised lower back."}
{"game_id": "0021401043", "chunk_id": "0021401043_024", "order": 24, "role": "body", "text": "Caldwell-Pope scored 20 or more points for the third time in four games."}
{"game_id": "0021401043", "chunk_id": "0021401043_026", "order": 26, "role": "body", "text": "Butler nailed a 3 from the left wing early in the second half. It was the Pistons' 583rd of the season, setting a club record. The old mark of 582 was set in 1996-97."}
{"game_id": "0021401043", "chunk_id": "0021401043_028", "order": 28, "role": "body", "text": "Brandon Bass nailed a 3-pointer, making him 9 for 26 this season. He was just 2 for 21 in his career before this season."}
{"game_id": "0021401043", "chunk_id": "0021401043_030", "order": 30, "role": "body", "text": "Pistons: Host Toronto on Tuesday."}
{"game_id": "0021401043", "chunk_id": "0021401043_031", "order": 31, "role": "closing", "text": "Celtics: At Brooklyn on Monday."}
