{"game_id": "0021300129", "chunk_id": "0021300129_001", "order": 1, "role": "lead", "text": "CLEVELAND --  Michael Kidd-Gilchrist and the Charlotte Bobcats kept playing, even when they trailed by double digits in the third quarter."}
{"game_id": "0021300129", "chunk_id": "0021300129_002", "order": 2, "role": "body", "text": "They eventually found a way to get past the Cleveland Cavaliers."}
{"game_id": "0021300129", "chunk_id": "0021300129_003", "order": 3, "role": "body", "text": "Kidd-Gilchrist scored 16 points and the Bobcats used a strong fourth quarter to defeat the Cavaliers 86-80 on Friday night."}
{"game_id": "0021300129", "chunk_id": "0021300129_004", "order": 4, "role": "body", "text": "\"It's a new season, new guys, a new staff, new everything,\" Kidd-Gilchrist said. \"I'll take this win. I'll take any win we can get this season. One step at a time.\""}
{"game_id": "0021300129", "chunk_id": "0021300129_005", "order": 5, "role": "body", "text": "While it's only November, the Bobcats are feeling good about themselves. Charlotte is 5-4 after finishing 21-61 last season."}
{"game_id": "0021300129", "chunk_id": "0021300129_006", "order": 6, "role": "body", "text": "\"A lot of it just comes down to how badly the guys in the locker room want to win,\" first-year coach Steve Clifford said. \"It's a great win, a win on the road against a physical team that plays good defense.\""}
{"game_id": "0021300129", "chunk_id": "0021300129_007", "order": 7, "role": "body", "text": "Kyrie Irving, wearing a mask to protect a nasal fracture, had 18 points and 10 assists for Cleveland, which lost for the first time in four games at home."}
{"game_id": "0021300129", "chunk_id": "0021300129_008", "order": 8, "role": "body", "text": "The Cavaliers (3-7) have lost three straight and five of six. Cleveland's wins have come by four, one and two points."}
{"game_id": "0021300129", "chunk_id": "0021300129_009", "order": 9, "role": "body", "text": "\"We just didn't play with any sense of urgency at all defensively,\" coach Mike Brown said. \"We didn't do anything we were supposed to do.\""}
{"game_id": "0021300129", "chunk_id": "0021300129_010", "order": 10, "role": "body", "text": "The Cavaliers are 0-6 on the road and play in Washington on Saturday."}
{"game_id": "0021300129", "chunk_id": "0021300129_011", "order": 11, "role": "body", "text": "The Bobcats outscored the Cavaliers 29-22 in the final period to win for only the second time in 16 games at Quicken Loans Arena."}
{"game_id": "0021300129", "chunk_id": "0021300129_012", "order": 12, "role": "body", "text": "The Bobcats trailed 53-41 midway through the third quarter, but cut the lead to 58-57 going into the fourth quarter. Anthony Tolliver's 3-pointer put Charlotte ahead 60-58 for its first lead of the game and the Bobcats never trailed again."}
{"game_id": "0021300129", "chunk_id": "0021300129_013", "order": 13, "role": "body", "text": "Kidd-Gilchrist had eight points in the fourth, including a three-point play that gave Charlotte an 81-70 lead with 6:08 remaining. Ramon Sessions and Kemba Walker hit 3-pointers and Cody Zeller added a three-point play to spark the Bobcats' run."}
{"game_id": "0021300129", "chunk_id": "0021300129_014", "order": 14, "role": "body", "text": "Cleveland trailed 82-76 before Josh McRoberts' 3-pointer from the corner with 1:02 remaining sealed the win."}
{"game_id": "0021300129", "chunk_id": "0021300129_015", "order": 15, "role": "body", "text": "McRoberts scored 13 points while Sessions and Walker added 12 apiece. Jeff Taylor scored 11 points for Charlotte, which won 89-83 in Boston on Wednesday."}
{"game_id": "0021300129", "chunk_id": "0021300129_016", "order": 16, "role": "body", "text": "Charlotte cut a 10-point deficit to four at halftime, but the Cavaliers began the third quarter on a 16-8 spurt."}
{"game_id": "0021300129", "chunk_id": "0021300129_017", "order": 17, "role": "body", "text": "Irving was hit in the face by an elbow from Minnesota's Corey Brewer on Wednesday. The All-Star point guard has a bruise under his right eye and will wear the mask for an undetermined period of time."}
{"game_id": "0021300129", "chunk_id": "0021300129_018", "order": 18, "role": "body", "text": "\"The mask was awful, but I've got to play through it,\" said Irving, who was 5 of 16 from the field. \"Hopefully, it will help me shoot better.\""}
{"game_id": "0021300129", "chunk_id": "0021300129_019", "order": 19, "role": "body", "text": "Tristan Thompson and Earl Clark each scored 15 points for the Cavaliers."}
{"game_id": "0021300129", "chunk_id": "0021300129_020", "order": 20, "role": "body", "text": "Bobcats center Al Jefferson missed the game because of the sore right ankle that's bothered him since training camp. He played in Charlotte's last two games after missing its previous five. He's averaging team highs of 15 points and 8.7 rebounds. Jefferson also missed the Bobcats' 90-84 win over the Cavaliers in Charlotte on Nov. 1."}
{"game_id": "0021300129", "chunk_id": "0021300129_021", "order": 21, "role": "body", "text": "Cleveland played its second straight game without center Andrew Bynum, who was excused by the team to address a family medical matter. Bynum is expected to return for Saturday's game."}
{"game_id": "0021300129", "chunk_id": "0021300129_022", "order": 22, "role": "body", "text": "Cavaliers forward Anthony Bennett, the No. 1 pick in the NBA draft, scored two points and is 4 for 35 from the field this season."}
{"game_id": "0021300129", "chunk_id": "0021300129_023", "order": 23, "role": "closing", "text": "Game notes Cavaliers G Dion Waiters didn't play because of the flu and won't travel to Washington. C.J. Miles started at shooting guard. Clark started at small forward in place of Alonzo Gee. ... McRoberts started after missing Wednesday's game in Boston because of a personal matter. ... Charlotte, which has lost 12 straight to Miami, hosts the Heat on Saturday. ... Bismack Biyombo replaced Jefferson in the starting lineup. He was scoreless but had 12 rebounds. ... A youngster participating in a YMCA game at halftime hit a half-court shot at the buzzer, which drew one of the biggest cheers of the night."}
