{"game_id": "0021300365", "chunk_id": "0021300365_001", "order": 1, "role": "lead", "text": "CLEVELAND -- The Portland Trail Blazers kept it real simple with the game on the line. Just get the ball to Damian Lillard, and get out of the way.\nNo need for any fancy calls when Lillard's on the court.\nThe point guard made a tiebreaking 3-pointer with 0.4 seconds remaining, lifting Portland to a 119-116 win over the Cleveland Cavaliers on Tuesday night."}
{"game_id": "0021300365", "chunk_id": "0021300365_002", "order": 2, "role": "body", "text": "\"There is no explaining it,\" Blazers coach Terry Stotts said. \"Damian had it going, so we ran it through him.\"\nLillard had a career-high eight 3-pointers while scoring 36 points. The 2013 NBA Rookie of the Year also had a fadeaway jumper as time expired to give Portland a 111-109 overtime victory over Detroit on Sunday.\n\"That was cold-blooded,\" Cleveland guard Dion Waiters said. \"We knew Lillard was getting the ball. That was a big-time shot.\"\nAnderson Varejao's tying basket for Cleveland with 7.1 seconds left prompted a Portland timeout. Lillard took the pass at mid-court, dribbled to the top of the key and buried the winning shot over Alonzo Gee from about 26 feet out.\n\"He's more capable of dribble-driving by you and finishing,\" Cleveland coach Mike Brown said. \"Their last game he drove by somebody and shot a pull-up. So you pick your poison.\"\nLillard had enough time to drive to the basket, but he decided to shoot from beyond the arc.\n\"I didn't want to get in too deep because they've got some giants in there,\" Lillard said. \"And Alonzo Gee is a great athlete, so I didn't want to drive on him. I gave him a move to get him off balance, and I wanted to be ready when I froze him.\"\nPortland (22-4) has the best record in the NBA and is 11-0 against the Eastern Conference. The Blazers have won five straight and are 12-2 on the road.\nKyrie Irving's bid for a tying 3-pointer from about 35 feet bounced off the back of the rim at the buzzer. Irving and Waiters scored 25 points apiece for Cleveland.\nMiami Heat superstar LeBron James took to Twitter to praise both teams."}
{"game_id": "0021300365", "chunk_id": "0021300365_003", "order": 3, "role": "body", "text": "One of the best games this year so far if not the best. Cavs vs Blazers\n— LeBron James (@KingJames) December 18, 2013"}
{"game_id": "0021300365", "chunk_id": "0021300365_004", "order": 4, "role": "closing", "text": "LaMarcus Aldridge had 26 points and 15 rebounds for Portland.\nLillard's 3-pointer with 5:47 remaining gave Portland a 104-101 lead. Lillard then found Wesley Matthews for another 3, and Aldridge's jumper pushed the lead to 109-101 with 4:16 to play.\nMatthews made a 3-pointer and Aldridge scored to make it 114-104 with 2:15 remaining.\nIrving then scored nine straight points for the Cavaliers, including a three-point play with 33.8 seconds left that cut the lead to 116-114. After Aldridge missed in the lane, the Cavaliers called timeout with 16.5 seconds remaining. Irving drove into the lane and found Varejao, who tied the game.\n\"That was an offensive shootout by both teams,\" Stotts said. \"They made a great comeback to tie the game, but we keep finding a way to win. Obviously, Damian was fantastic.\"\nWaiters scored 11 points in the fourth quarter. He missed the morning shootaround after banging knees with teammate Tyler Zeller in practice Monday.\nLillard hit three 3-pointers within a span of 1:09 in the third quarter as the Blazers scored nine straight points to overcome a 69-61 deficit.\nThe Blazers began their four-game trip with a 35-point win in Philadelphia on Saturday in which they hit 21 3-pointers and followed that with two dramatic victories. They went 15 for 33 from long range against the Cavs.\nCleveland scored the first nine points of the fourth quarter to take a 97-92 lead. Six points by Waiters and a 3-pointer by Earl Clark accounted for the run.\nThe game featured two of the hottest players in the league. Irving was named Eastern Conference Player of the Week on Monday after averaging 29 points in three games last week. Aldridge was named the West's top player for the third time this season after averaging 25.5 points in the Blazers' four wins last week.\nCleveland has lost to Miami and Portland by a total of 10 points in its last two games.\nGame notes\nTuesday marked the second career matchup between Irving and Lillard. The two faced off in Portland in January when Irving scored 31 points and Lillard was held to 13 in Cleveland's 93-88 win. ... The Cavaliers scored 59 points in the first half, the most they have totaled in the first two quarters this season. ... The Blazers end their trip Wednesday against Minnesota. ... Portland rookie G C.J. McCollum, a Canton native, hasn't played this season because of a broken left foot."}
