{"game_id": "0021400566", "chunk_id": "0021400566_001", "order": 1, "role": "lead", "text": "CHICAGO -- The Orlando Magic used their offense to earn a sorely needed win. Nikola Vucevic and Victor Oladipo each played a big role.\nVucevic had 33 points and 11 rebounds, and the Magic snapped a six-game losing streak with a 121-114 victory over the Chicago Bulls on Monday night.\nOrlando (14-27) shot a season-high 59 percent from the field in its first win in Chicago since an 83-82 victory on Dec. 16, 2013. The Magic had lost three in a row and 12 of 15 against the Bulls since the start of the 2010-11 season."}
{"game_id": "0021400566", "chunk_id": "0021400566_002", "order": 2, "role": "closing", "text": "Oladipo also scored 33 points in Orlando's highest-scoring game of the season, and rookie Elfrid Payton added 10 points and seven assists.\n\"I guess the worm turned,\" said Magic coach Jacque Vaughn, whose team failed to score more than 98 points in any game during the losing streak. \"We were very aggressive with our approach. Our pace was great.\"\nVucevic was 16-for-24 from the field in his NBA-best 23rd double-double of the season. The terrific performance for the 7-foot center included a drive and left-handed dunk over forward Pau Gasol late in third period.\n\"I just wanted to get to the rim and finish strong,\" Vucevic said. \"I got up high enough and I wanted to dunk it. I don't do it very often, so I'm sure they were surprised.\"\nThe Bulls (26-13) lost for the seventh time against teams currently with sub-.500 records. Five of those losses were at home.\n\"Part of it is concentration, playing with a sense of urgency and an edge, just allowing teams to take off early in the game and having to fight back,\" Gasol said.\nWhile the Bulls have displayed a more efficient offense this season, coach Tom Thibodeau thinks they often lose sight of what makes them a playoff contender.\n\"If we're just going to try to outscore people, we're not going anywhere,\" Thibodeau said. \"I know what doesn't work. We're going to have to bring a lot of intensity, and the only way to bring more intensity is to work harder. It's really that simple.\"\nGasol paced Chicago with 28 points and 14 rebounds, and Derrick Rose had 18 points and seven assists. Jimmy Butler finished with 17 points.\nRose was 8-for-15 from the field in his return to the lineup after missing Saturday night's 95-87 victory over Milwaukee with left knee soreness.\n\"You can tell (Thibodeau) is frustrated, which he has every right to be,\" Rose said. \"I wouldn't say the guys are frustrated, but it's irritating to lose these games and make these games harder than they (should be).\"\nOrlando carried a 93-78 lead into the fourth quarter but managed only one free throw in the next 3 1/2 minutes. Reserves Taj Gibson and Nikola Mirotic led a Chicago comeback that got the Bulls within three with 2:16 to play. But Joakim Noah missed two free throws for Chicago, and Oladipo followed with a layup.\nThe Magic jumped to a 63-55 halftime lead. They shot 61 percent in each of the first two quarters against the usually stout Bulls, who had ranked fourth in the NBA in field goal percentage defense.\nChicago had no answer for Vucevic, who had 12 points, six rebounds and three assists in the first half. Orlando received a considerable boost from its bench, which scored 25 points in that span.\nOFF BY A HAIR\nIt was Rose's best shooting game since he was 7-for-14 from the field in a 113-93 victory over the Los Angeles Lakers on Christmas. He shot 28 percent (36-for-129) in his previous seven games.\n\"I got a new haircut, so who knows?\" he said when asked about the turnaround. \"I've just been missing shots. It got nothin' to do with (health). No excuses. I just been missing shots.\"\nTIP-INS\nMagic: Ex-Bulls G Ben Gordon returned to Chicago, where he spent the first five seasons of his career. \"Played in some big games, hit some big shots,\" said Gordon, who still has friends and family in the area. \"I've got a lot more good memories here than bad ones.\" ... Evan Fournier (sprained right knee), forward Aaron Gordon (fractured left foot) and Tobias Harris (sprained left ankle) were not available.\nBulls: F Mike Dunleavy reported improvement in his sore right ankle but still had not resumed running exercises. He isn't likely to return until this weekend at the earliest. Tony Snell started in his place for the second consecutive game. ... Rookie forward Doug McDermott (right knee surgery) also was inactive.\nUP NEXT\nMagic: Host Houston on Wednesday night.\nBulls: Host Washington on Wednesday night."}
