{"game_id": "0021700174", "chunk_id": "0021700174_001", "order": 1, "role": "lead", "text": "PHOENIX --  Forward Aaron Gordon has added shooting range to his abundant athleticism, and his strong start has gone hand in hand with Orlando's."}
{"game_id": "0021700174", "chunk_id": "0021700174_002", "order": 2, "role": "body", "text": "Gordon had 22 points and seven rebounds, and he made both his 3-point attempts to take over the NBA league in 3-point percentage in the Magic's 128-112 victory over the Phoenix Suns on Friday night."}
{"game_id": "0021700174", "chunk_id": "0021700174_003", "order": 3, "role": "body", "text": "Gordon, 6-foot-9, has made 25 of 42 3s, 59.5 percent. He shot 28.8 percent from distance last season, his career percentage."}
{"game_id": "0021700174", "chunk_id": "0021700174_004", "order": 4, "role": "body", "text": "\"It's still early. Just shooting the ball the way I know I can,\" said Gordon, averaging 19.6 points a game. \"Confidently. Looking for the right looks, and continue to shoot the ball."}
{"game_id": "0021700174", "chunk_id": "0021700174_005", "order": 5, "role": "body", "text": "\"It's just making the right basketball plays. They are leaving me open and I am stepping up and knocking it down.\""}
{"game_id": "0021700174", "chunk_id": "0021700174_006", "order": 6, "role": "body", "text": "Among players who have made at least 25 threes, Portland's CJ McCollum is second at 54.4 percent."}
{"game_id": "0021700174", "chunk_id": "0021700174_007", "order": 7, "role": "body", "text": "\"I'm happy for him, because that has been the knock on him throughout his career,\" Orlando coach Frank Vogel said. \"He seems to have turned that around.\""}
{"game_id": "0021700174", "chunk_id": "0021700174_008", "order": 8, "role": "body", "text": "Nikola Vucevic added 19 points, reserve Jonathon Simmons and Terrence Ross scored 17 points apiece and Evan Fournier had 14 for the Magic."}
{"game_id": "0021700174", "chunk_id": "0021700174_009", "order": 9, "role": "body", "text": "They have won two straight to reach 8-4, their best start in five seasons."}
{"game_id": "0021700174", "chunk_id": "0021700174_010", "order": 10, "role": "body", "text": "The Magic led 64-63 at halftime but outscored the Suns by 15 after a halftime talk from Vogel. Orlando led by as many as 25 in the fourth quarter."}
{"game_id": "0021700174", "chunk_id": "0021700174_011", "order": 11, "role": "body", "text": "\"I did raise my voice about our transition defense,\" Vogel said about his halftime message. \"There are some things we are supposed to execute that have nothing to do with urgency. It just has to do with being smart, which we weren't doing.\""}
{"game_id": "0021700174", "chunk_id": "0021700174_012", "order": 12, "role": "body", "text": "TJ Warren had 20 points and rookie forward Josh Jackson had a career-high 18 points for the Suns. They have lost five straight to drop to 4-9."}
{"game_id": "0021700174", "chunk_id": "0021700174_013", "order": 13, "role": "body", "text": "\"We said to our guys at halftime, first team that platys defense is going to win this game,\" Suns coach Frank Vogel said."}
{"game_id": "0021700174", "chunk_id": "0021700174_014", "order": 14, "role": "body", "text": "Gordon also impressed Vogel with his extra pass to Shelvin Mack that resulted in a 3-pointer."}
{"game_id": "0021700174", "chunk_id": "0021700174_015", "order": 15, "role": "body", "text": "\"He played a wonderful basketball game,\" Vogel said. \"Not just making shots when the ball swings to him. His lack of forcing, which has also been an issue early in his career. He had opportunities to take some heat-check shots and he made that extra pass to the corner. That was one of the best plays of our season.\""}
{"game_id": "0021700174", "chunk_id": "0021700174_016", "order": 16, "role": "body", "text": "Gordon: \"I love passing. Assisting is fun. Assisting and scoring are on the same level to me. Making that pass it just as rewarding as getting a bucket.\""}
{"game_id": "0021700174", "chunk_id": "0021700174_017", "order": 17, "role": "body", "text": "Suns scoring leader Devin Booker, covered most of the game by Ross, scored nine points on 3-of-10 shooting, tying a season low in scoring. He was averaging 22.3 points."}
{"game_id": "0021700174", "chunk_id": "0021700174_018", "order": 18, "role": "body", "text": "\"Trying to make him uncomfortable,\" Ross said. \"Be a little physical with him. Try to be there when he gets the ball in his hands and try to limit his touches. Just take him out of his rhythm. It was a team effort.\""}
{"game_id": "0021700174", "chunk_id": "0021700174_019", "order": 19, "role": "body", "text": "Alex Len had 21 points and 13 rebounds, and Michael James scored 18 points for Phoenix."}
{"game_id": "0021700174", "chunk_id": "0021700174_021", "order": 21, "role": "body", "text": "Magic: A pass-first approach has helped the Magic to 40.6 percent shooting from three-point range entering the game, second in the NBA and a huge jump from 32.8 percent last season. \"That's our ticket to success this season,\" Vogel said. \"The pass makes the game easy.\" ... G D.J. Augustin (hamstring) and F Adreian Payne (fractured finger) did not dress. ... The Magic have three more games on their four-game, six-day trip that includes stops in Denver and Golden State and concludes in Portland on Wednesday."}
{"game_id": "0021700174", "chunk_id": "0021700174_022", "order": 22, "role": "body", "text": "Suns: F Jared Dudley suffered a right knee sprain when teammate Josh Jackson fell into him on a play under the Magic basket. Dudley immediately left the game and went to the Suns' locker room. ... C Greg Monroe (calf) reported to the Suns on Friday but is likely to remain out for another week, coach Jay Triano said. Monroe was acquired from Milwaukee with two draft picks for G Eric Bledsoe this week, has been dealing with the injury for two weeks. ... Len made his second straight start with Tyson Chandler (back spasms) out. . Triano, on practice plans moving forward: \"We're using our shoot-arounds as practices. Trying to put in a lot of things that maybe we should have covered We're basically conducting training camp right now, and we probably will be for the next two months.\""}
{"game_id": "0021700174", "chunk_id": "0021700174_024", "order": 24, "role": "body", "text": "Magic: At Denver on Saturday night."}
{"game_id": "0021700174", "chunk_id": "0021700174_025", "order": 25, "role": "body", "text": "Suns: Host Minnesota on Saturday night."}
{"game_id": "0021700174", "chunk_id": "0021700174_027", "order": 27, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
