{"game_id": "0021401067", "chunk_id": "0021401067_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Jordan Clarkson took a step back before helping the Los Angeles Lakers take one forward."}
{"game_id": "0021401067", "chunk_id": "0021401067_002", "order": 2, "role": "body", "text": "Clarkson shot 6 of 16 and had six turnovers. But the rookie, who spent time earlier this season in the NBA Development League, hit two free throws with 0.3 seconds left in overtime to send Los Angeles to a 101-99 win over the Minnesota Timberwolves on Wednesday night."}
{"game_id": "0021401067", "chunk_id": "0021401067_003", "order": 3, "role": "body", "text": "Clarkson scored eight points in the extra time and finished with 20 a night after scoring a season-high 30 points in a loss at Oklahoma City. Jeremy Lin added 19 points for the Lakers (19-51), who snapped a five-game road losing streak and won for the second time in three games."}
{"game_id": "0021401067", "chunk_id": "0021401067_004", "order": 4, "role": "body", "text": "Clarkson has been a surprise for a Lakers team playing without injured superstar Kobe Bryant, starting 27 games and averaging 10.2 points per game. He has scored in double figures in 13 of his last 15 games."}
{"game_id": "0021401067", "chunk_id": "0021401067_005", "order": 5, "role": "body", "text": "\"I think I took a few steps back,\" Clarkson said. \"I didn't take care of the ball well, held the ball a little too much on the offensive end. I've just got to keep growing, man, go back and watch the film, learn from it.\""}
{"game_id": "0021401067", "chunk_id": "0021401067_006", "order": 6, "role": "body", "text": "In crunch time, Clarkson answered the challenge. He connected on all six of his free throws in overtime and added a driving layup with 34.5 seconds left to put the Lakers ahead 99-97."}
{"game_id": "0021401067", "chunk_id": "0021401067_007", "order": 7, "role": "body", "text": "Minnesota's Gorgui Dieng tied the game 99-all with a jumper, but Clarkson finished the game at the line. He snared an offensive rebound and was fouled by Timberwolves rookie Zach LaVine while trying to put up a desperate last-second shot."}
{"game_id": "0021401067", "chunk_id": "0021401067_008", "order": 8, "role": "body", "text": "LaVine -- who had 18 points for Minnesota -- didn't think he committed a foul. His coach saw it differently."}
{"game_id": "0021401067", "chunk_id": "0021401067_009", "order": 9, "role": "body", "text": "\"He fouled him,\" Timberwolves coach Flip Saunders said."}
{"game_id": "0021401067", "chunk_id": "0021401067_010", "order": 10, "role": "body", "text": "Like Clarkson, the young Timberwolves are learning on the fly."}
{"game_id": "0021401067", "chunk_id": "0021401067_011", "order": 11, "role": "body", "text": "Andrew Wiggins, the leading candidate for rookie of the year, had 27 points for Minnesota (16-55), which had won two of its past three games in overtime."}
{"game_id": "0021401067", "chunk_id": "0021401067_012", "order": 12, "role": "body", "text": "\"The good thing about us is we're young, so we don't get tired easily,\" said Wiggins, who played more than 48 minutes for the second straight game."}
{"game_id": "0021401067", "chunk_id": "0021401067_013", "order": 13, "role": "body", "text": "Chase Budinger scored a season-high 22 and sent the game into overtime with a 3-pointer with 6.6 seconds left in regulation as the Timberwolves erased a 13-point, second-half deficit."}
{"game_id": "0021401067", "chunk_id": "0021401067_014", "order": 14, "role": "body", "text": "\"Is it good we're able to find a way to get back in and we've won some games that had opportunities? Yeah,\" Saunders said. \"This might have been a little bit of a learning experience for Zach in that situation.\""}
{"game_id": "0021401067", "chunk_id": "0021401067_015", "order": 15, "role": "body", "text": "Los Angeles is trying to finish the season strong without Bryant and without Steve Nash, who recently announced his retirement. Even without Carlos Boozer and Jordan Hill, the Lakers outrebounded Minnesota 48-40."}
{"game_id": "0021401067", "chunk_id": "0021401067_016", "order": 16, "role": "body", "text": "\"I don't think nothing about that,\" acting Lakers coach Paul Pressey said when asked if winning hurts the team's draft position. \"I think about wins, you know, as many as you can get.\""}
{"game_id": "0021401067", "chunk_id": "0021401067_018", "order": 18, "role": "body", "text": "Lakers: Coach Byron Scott missed his second straight game after the death of his mother. Pressey stood in for Scott, who could return to the team in Toronto. ... Rookie F Ryan Kelly drew his second straight start as Hill and Boozer were held out. ...Played in a league-leading eight overtime games this season."}
{"game_id": "0021401067", "chunk_id": "0021401067_019", "order": 19, "role": "body", "text": "Timberwolves: 27 of 30 from the free-throw line. Minnesota has shot 81.0 percent from the line since Jan. 1, the second-best percentage in the NBA. ... C Justin Hamilton returned after missing four games because of headaches. ... Budinger has now scored in double-figures in seven straight games."}
{"game_id": "0021401067", "chunk_id": "0021401067_021", "order": 21, "role": "body", "text": "Minnesota remained shorthanded but could be close to getting some help. G Kevin Martin (strained left hamstring) was deemed a game-time decision by coach Flip Saunders but didn't play. Kevin Garnett, Ricky Rubio, Nikola Pekovic, Robbie Hummel, Anthony Bennett, Shabazz Muhammad and Gary Neal were out of uniform because of injuries."}
{"game_id": "0021401067", "chunk_id": "0021401067_022", "order": 22, "role": "body", "text": "Saunders said before the game that he expects Garnett (sore left knee) and Rubio (sore right ankle) will play again this season."}
{"game_id": "0021401067", "chunk_id": "0021401067_024", "order": 24, "role": "body", "text": "Garnett and Bryant didn't play Wednesday but Saunders intimated the two were almost teammates. Garnett started the trend of high school players jumping to the NBA when he was the fifth overall pick by Minnesota in 1995. A year later, Bryant was the star prep player heading to the NBA."}
{"game_id": "0021401067", "chunk_id": "0021401067_025", "order": 25, "role": "body", "text": "Saunders, the Timberwolves coach at the time, said the team had discussed selecting Bryant, too."}
{"game_id": "0021401067", "chunk_id": "0021401067_026", "order": 26, "role": "body", "text": "\"We were in a situation probably having had taken a high school player, we teetered on the idea of taking another one because we had success with KG,\" Saunders said. \"But we just kind of balked thinking it might be too much having two of those guys young at that time because we were still in the process of developing KG as a young player.\""}
{"game_id": "0021401067", "chunk_id": "0021401067_027", "order": 27, "role": "body", "text": "Minnesota ended up picking Ray Allen with the fifth pick and trading him to Milwaukee for Stephon Marbury, who went one pick earlier. Bryant lasted until the 13th pick where he was drafted by the Charlotte Hornets and later traded to the Lakers."}
{"game_id": "0021401067", "chunk_id": "0021401067_029", "order": 29, "role": "body", "text": "Lakers: Visit the Toronto Raptors on Friday"}
{"game_id": "0021401067", "chunk_id": "0021401067_030", "order": 30, "role": "closing", "text": "Timberwolves: Visit the Houston Rockets on Friday"}
