{"game_id": "0021200520", "chunk_id": "0021200520_001", "order": 1, "role": "lead", "text": "CHICAGO --  Brandon Jennings stretched out his arms and held his hands just over the ground as he glided toward center court, celebrating another big 3-pointer with one of Nate Robinson's usual moves."}
{"game_id": "0021200520", "chunk_id": "0021200520_002", "order": 2, "role": "body", "text": "Yup, Jennings was listening to Robinson's trash talk, and he had the perfect response."}
{"game_id": "0021200520", "chunk_id": "0021200520_003", "order": 3, "role": "body", "text": "The speedy point guard scored 20 of his 35 points in the third quarter, and the Milwaukee Bucks beat the Chicago Bulls 104-96 on Wednesday night for their second consecutive victory under interim coach Jim Boylan."}
{"game_id": "0021200520", "chunk_id": "0021200520_004", "order": 4, "role": "body", "text": "Robinson scored 13 of his 19 points in the first period, but was unable to stop Jennings once he got going in the third."}
{"game_id": "0021200520", "chunk_id": "0021200520_005", "order": 5, "role": "body", "text": "\"A little trash talking before the second half,\" Jennings said. \"I guess he felt like he had it going, he was getting the best of me. I really don't take trash talking too kindly because I don't really do a lot of trash talking. I warned him, so, hey, it happens.\""}
{"game_id": "0021200520", "chunk_id": "0021200520_006", "order": 6, "role": "body", "text": "Mike Dunleavy had 16 points and Monta Ellis finished with 14 for Milwaukee, which made 10 of 22 3-point attempts. Larry Sanders grabbed 12 rebounds and blocked seven shots."}
{"game_id": "0021200520", "chunk_id": "0021200520_007", "order": 7, "role": "body", "text": "\"I think the whole team played well, but obviously Brandon, offensively, really got it going,\" Boylan said. \"I thought our defense got a little more active, coming up with loose balls. Larry's presence around the basket is intimidating. Guys go in there and they're looking for him.\""}
{"game_id": "0021200520", "chunk_id": "0021200520_008", "order": 8, "role": "body", "text": "Carlos Boozer had 22 points and 11 rebounds for the Bulls, who have dropped their last two games against Milwaukee at United Center. The Bulls blew a 27-point lead in the third quarter as Milwaukee snapped a nine-game losing streak against Chicago with a 93-92 victory on Nov. 26."}
{"game_id": "0021200520", "chunk_id": "0021200520_009", "order": 9, "role": "body", "text": "\"Just second half, I think they made a lot of tough shots,\" Boozer said. \"Brandon was amazing. We missed some shots we usually make, and that was the game.\""}
{"game_id": "0021200520", "chunk_id": "0021200520_010", "order": 10, "role": "body", "text": "Boozer has recorded a double-double in six consecutive games while playing some of his best basketball in three seasons with the Bulls. It's the best such streak for Chicago since Joakim Noah also had a double-double in six straight games in 2009."}
{"game_id": "0021200520", "chunk_id": "0021200520_011", "order": 11, "role": "body", "text": "The Bucks parted ways with Scott Skiles on Monday in what was called a mutual decision, and turned to his top assistant for at least the rest of the season. Boylan also served as an interim coach in Chicago when Skiles was let go during the 2007-08 season."}
{"game_id": "0021200520", "chunk_id": "0021200520_012", "order": 12, "role": "body", "text": "\"I told the guys that I'm just gonna have fun with this,\" Boylan said. \"Coach as well as I can coach, motivate these guys, and that's what I'm gonna do.\""}
{"game_id": "0021200520", "chunk_id": "0021200520_013", "order": 13, "role": "body", "text": "It was a lot of fun against Chicago, especially when Jennings got on a roll in the third. He was 4 for 7 from long range in the period, including two 3s during a quick 8-0 burst that gave the Bucks a 72-64 lead with 4:48 left."}
{"game_id": "0021200520", "chunk_id": "0021200520_014", "order": 14, "role": "body", "text": "\"Teams go in stretches where they score and score and score,\" Robinson said. \"It's like you can't do nothing about it. But tonight we beat ourselves. Brandon Jennings got hot. It happens.\""}
{"game_id": "0021200520", "chunk_id": "0021200520_015", "order": 15, "role": "body", "text": "Robinson also downplayed his running conversation with Jennings."}
{"game_id": "0021200520", "chunk_id": "0021200520_016", "order": 16, "role": "body", "text": "\"A couple of dirty plays exchanged, but, you know, nothing to complain about,\" he said. \"It's basketball.\""}
{"game_id": "0021200520", "chunk_id": "0021200520_017", "order": 17, "role": "body", "text": "Jennings added a key floater in the fourth as the Bucks won for only the seventh time in their last 27 games against the Bulls."}
{"game_id": "0021200520", "chunk_id": "0021200520_018", "order": 18, "role": "body", "text": "Luol Deng scored 18 points for Chicago, which was seeking a season-best fourth consecutive victory."}
{"game_id": "0021200520", "chunk_id": "0021200520_019", "order": 19, "role": "body", "text": "Robinson got the start in place of Kirk Hinrich, who was sidelined with a right elbow injury. It was the fifth start of the season for the streaky guard, who made three 3-pointers in the first quarter to help Chicago grab a 33-23 lead after one."}
{"game_id": "0021200520", "chunk_id": "0021200520_020", "order": 20, "role": "body", "text": "The Bulls still held a 10-point lead in the final seconds of the first half when Jennings connected from long range, slicing Chicago's advantage to 57-50 at the break."}
{"game_id": "0021200520", "chunk_id": "0021200520_021", "order": 21, "role": "closing", "text": "Game notes Bulls C Nazr Mohammed was preparing for the second half when a giant inflatable Benny the Bull landed on him near the free-throw line. The operator quickly got the mascot away from Mohammed, who just smiled as he continued to warm up. ... Hinrich has been hampered by a slew of injuries this season. He missed three games in December with a bruised left knee and a game in November because of an injured right hip. ... Boylan said before the game he thinks Skiles will coach again. ... The crowd roared when Bears CB Charles Tillman was shown on the overhead videoboard before the final period. ... Jennings has made at least one 3-pointer in a career-best 22 straight games."}
