{"game_id": "0021201000", "chunk_id": "0021201000_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  The Memphis Grizzlies let the baggage from a four-game road trip linger only slightly before turning up the defense to snap their losing streak."}
{"game_id": "0021201000", "chunk_id": "0021201000_002", "order": 2, "role": "body", "text": "The Grizzlies, returning home from a four-game West Coast swing last week during which they lost the final two, got 20 points and six assists from Mike Conley in a 92-77 victory over the Minnesota Timberwolves on Monday night."}
{"game_id": "0021201000", "chunk_id": "0021201000_003", "order": 3, "role": "body", "text": "For the Grizzlies, it was a nice homecoming after losing at Denver on Friday and Utah on Saturday. Early against the Timberwolves, there seemed to be a lack of intensity lingering from the trip, but it was short-lived."}
{"game_id": "0021201000", "chunk_id": "0021201000_004", "order": 4, "role": "body", "text": "\"It kind of happens after a long road trip,\" said Grizzlies center Marc Gasol, who finished with 16 points, eight rebounds, five assists and four blocks. \"The first quarter is always a little weird. But we reacted pretty good. We weren't clicking offensively like we want to. We were not making the shots we normally make, but defensively, I think we picked it up real well.\""}
{"game_id": "0021201000", "chunk_id": "0021201000_005", "order": 5, "role": "body", "text": "Conley was 8 of 14 from the field and connected on 3 of 6 from beyond the arc to help Memphis earn its 10th straight win in the series. Jerryd Bayless added 15 points, and Zach Randolph had 14 points and 10 rebounds. Tayshaun Prince scored 12 points and grabbed a season-high 14 rebounds."}
{"game_id": "0021201000", "chunk_id": "0021201000_006", "order": 6, "role": "body", "text": "Alexey Shved led the Timberwolves with 12 points, and Mickael Gelabale and J.J. Barea finished with 11 apiece. The Timberwolves' reserves scored 44 points as no Minnesota starter finished in double figures."}
{"game_id": "0021201000", "chunk_id": "0021201000_007", "order": 7, "role": "body", "text": "Timberwolves guard Ricky Rubio left the game after coming down awkwardly on a fast break with about 3 minutes left in the third quarter. He went to the locker room briefly with a minor groin strain. He was available, but did not return to the game. He finished with two points and two assists."}
{"game_id": "0021201000", "chunk_id": "0021201000_008", "order": 8, "role": "body", "text": "\"He said he could have played, but I wasn't going to put him back in there,\" Minnesota coach Rick Adelman said. \"It wasn't worth it.\""}
{"game_id": "0021201000", "chunk_id": "0021201000_009", "order": 9, "role": "body", "text": "Minnesota, which defeated New Orleans 97-95 on Sunday, shot 34 percent and was outscored 50-28 in the paint."}
{"game_id": "0021201000", "chunk_id": "0021201000_010", "order": 10, "role": "body", "text": "\"We just played very poorly offensively and never really gave ourselves a chance to win,\" Adelman said. \"We shot low 30 percent and didn't move the ball very well. I don't know if it's as much to do with them as it is to do with ourselves."}
{"game_id": "0021201000", "chunk_id": "0021201000_011", "order": 11, "role": "body", "text": "\"I did think we ran out of gas. At the start of the third quarter, it was like we had nothing left.\""}
{"game_id": "0021201000", "chunk_id": "0021201000_012", "order": 12, "role": "body", "text": "Memphis, as it has for about the last 10 games, pulled away with a quick start in the third quarter. The Grizzlies opened the period with nine straight points to start a 13-2 run that gave them their largest lead to that point at 58-41."}
{"game_id": "0021201000", "chunk_id": "0021201000_013", "order": 13, "role": "body", "text": "Minnesota managed to convert only one of its first nine attempts, while Memphis connected on six straight."}
{"game_id": "0021201000", "chunk_id": "0021201000_014", "order": 14, "role": "body", "text": "The Grizzlies' lead continued to swell, reaching 20 near the midway point of the period."}
{"game_id": "0021201000", "chunk_id": "0021201000_015", "order": 15, "role": "body", "text": "The Grizzlies outscored Minnesota 29-14 in the quarter, upping their lead to as many as 25 points. Memphis hit 13 of 19 shots, while the Timberwolves were 4 of 21."}
{"game_id": "0021201000", "chunk_id": "0021201000_016", "order": 16, "role": "body", "text": "\"We were playing good in the first half,\" Rubio said, \"but they were coming out more aggressive in the third quarter than we were.\""}
{"game_id": "0021201000", "chunk_id": "0021201000_017", "order": 17, "role": "body", "text": "Minnesota center Nikola Pekovic added that while they played pretty well in the first half, \"the first 6 or 7 minutes of the third quarter, they just jumped on us, and we never really responded the right way.\""}
{"game_id": "0021201000", "chunk_id": "0021201000_018", "order": 18, "role": "body", "text": "The Timberwolves would not have a player reach double figures until Shved's 3-point play with 10:03 to play in the game."}
{"game_id": "0021201000", "chunk_id": "0021201000_019", "order": 19, "role": "body", "text": "That cut the Grizzlies' lead to 79-63, but the Timberwolves would never threaten the rest of the way."}
{"game_id": "0021201000", "chunk_id": "0021201000_020", "order": 20, "role": "body", "text": "\"We came out slow in the first quarter,\" Memphis coach Lionel Hollins said. \"We were dragging a little bit, but then we got it going. We actually played pretty good.\""}
{"game_id": "0021201000", "chunk_id": "0021201000_021", "order": 21, "role": "body", "text": "The Grizzlies led 45-39 at the break behind 11 points from Gasol. Derrick Williams and Pekovic had eight points each for the Timberwolves."}
{"game_id": "0021201000", "chunk_id": "0021201000_022", "order": 22, "role": "body", "text": "Neither team shot particularly well, Memphis doing best with 44 percent, but the Grizzlies converted only one of six shots from outside the arc."}
{"game_id": "0021201000", "chunk_id": "0021201000_023", "order": 23, "role": "body", "text": "Minnesota was 4 of 13 from outside in the half."}
{"game_id": "0021201000", "chunk_id": "0021201000_024", "order": 24, "role": "closing", "text": "Game notes Minnesota has not won consecutive games since a four-game winning streak in December. ... Memphis F Darrell Arthur missed his eighth game with neck and back soreness. ... Conley recorded a steal in the first quarter and now has 57 straight games with a steal. His two steals in the game gave him 146 for the season, a franchise record. ... Minnesota's road record now is 7-26, including eight consecutive losses away from home. ... Gelabale had seven rebounds matching his season-best."}
