{"game_id": "0021400682", "chunk_id": "0021400682_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Michael Carter-Williams got winded sooner than he usually does and had difficulty breathing well throughout the game."}
{"game_id": "0021400682", "chunk_id": "0021400682_003", "order": 3, "role": "body", "text": "Carter-Williams had 14 points and 10 assists, Robert Covington scored 19 points and the Philadelphia 76ers snapped a six-game losing streak with an 89-69 win over the Detroit Pistons on Wednesday night."}
{"game_id": "0021400682", "chunk_id": "0021400682_004", "order": 4, "role": "body", "text": "Carter-Williams, back after missing the Sixers' last game due to an upper-respiratory infection, finished one rebound shy of a triple-double."}
{"game_id": "0021400682", "chunk_id": "0021400682_005", "order": 5, "role": "body", "text": "\"I'm a little stuffed up, but as soon I was out there, all that really is blocked out,\" Carter-Williams said. \"I got a little fatigued and (backup point guard Larry Drew) came in and did a great job.\""}
{"game_id": "0021400682", "chunk_id": "0021400682_006", "order": 6, "role": "body", "text": "JaKarr Sampson had a career-high 13 points and Luc Mbah a Moute added 12 for the Sixers (9-37), who had six players score in double figures."}
{"game_id": "0021400682", "chunk_id": "0021400682_007", "order": 7, "role": "body", "text": "Greg Monroe led the Pistons (17-30) with 20 points and 11 rebounds, and Jodie Meeks scored 19 on 4-for-16 shooting off the bench. Detroit shot just 2 of 20 from 3-point range in a matchup of slumping squads missing their top scorers."}
{"game_id": "0021400682", "chunk_id": "0021400682_008", "order": 8, "role": "body", "text": "The Pistons have lost four straight, and three since leading scorer Brandon Jennings ruptured his left Achilles in a 101-86 loss to Milwaukee on Saturday. Before Jennings' season-ending injury, Detroit had won 12 of 15 behind the play of their star point guard."}
{"game_id": "0021400682", "chunk_id": "0021400682_009", "order": 9, "role": "body", "text": "\"We weren't ready to play,\" Pistons coach Stan Van Gundy said. \"I don't think I've ever coached a game where one team's effort was that much better than my team's effort. I mean, it was a joke.\""}
{"game_id": "0021400682", "chunk_id": "0021400682_010", "order": 10, "role": "body", "text": "Sixers guard Tony Wroten, who partially tore his ACL two weeks ago, said before the game that he plans to have knee surgery and will likely miss the remainder of the season. But playing their ninth straight game without their leading scorer, the Sixers held a comfortable lead throughout against the equally short-handed Pistons."}
{"game_id": "0021400682", "chunk_id": "0021400682_011", "order": 11, "role": "body", "text": "Detroit tried to mount a comeback in the third quarter, slicing Philly's lead to 59-50 on five straight points from Jonas Jerebko. But Carter-Williams drained a big 3-pointer before Jerebko was posterized on a highlight-reel jam from Jerami Grant."}
{"game_id": "0021400682", "chunk_id": "0021400682_012", "order": 12, "role": "body", "text": "The Pistons cut it to nine twice more early in the fourth quarter, but that was as close as they would come as the Sixers closed on a 17-6 run."}
{"game_id": "0021400682", "chunk_id": "0021400682_013", "order": 13, "role": "body", "text": "\"You try to teach these young guys to never take their foot off the pedal,\" Sixers coach Brett Brown said. \"We have no right to be complacent at any point.\""}
{"game_id": "0021400682", "chunk_id": "0021400682_014", "order": 14, "role": "body", "text": "The Sixers took control early, going on an 18-0 run to take a 24-4 lead with 5:39 left in the first quarter. Rookie K.J. McDaniels capped the spurt by picking off an errant pass by Anthony Tolliver and coasting uncontested down the floor for a thunderous dunk."}
{"game_id": "0021400682", "chunk_id": "0021400682_015", "order": 15, "role": "body", "text": "Sampson, making his first start since Dec. 30, kickstarted the spurt with a 3-pointer. The undrafted rookie finished shot 5 for 6 from the field and finished with a career-high eight rebounds."}
{"game_id": "0021400682", "chunk_id": "0021400682_016", "order": 16, "role": "body", "text": "\"His energy, his toughness and athleticism really complemented the starting group,\" Brown said."}
{"game_id": "0021400682", "chunk_id": "0021400682_017", "order": 17, "role": "body", "text": "The Pistons closed the first quarter on an 8-0 run to slice Philly's lead to 28-16, and Monroe hit two straight buckets inside to bring Detroit within 48-37 at the half."}
{"game_id": "0021400682", "chunk_id": "0021400682_018", "order": 18, "role": "body", "text": "But the Pistons shot just 30.7 percent from the field and committed 17 turnovers in a game they were never in -- and one their coach would quickly like to forget."}
{"game_id": "0021400682", "chunk_id": "0021400682_019", "order": 19, "role": "body", "text": "\"It was embarrassing and humiliating, and I told them in there that I'm embarrassed as a coach that I did that poor of a job,\" Van Gundy said. \"And if they're not embarrassed, they don't belong in the NBA.\""}
{"game_id": "0021400682", "chunk_id": "0021400682_021", "order": 21, "role": "body", "text": "Pistons: Detroit has dropped four straight on the road, matching a season high. ... The Pistons missed two of their first 19 shots and 12 straight during one stretch in the first quarter. ... Detroit was 1 for 10 from 3-point range in both the first and the second halves."}
{"game_id": "0021400682", "chunk_id": "0021400682_022", "order": 22, "role": "body", "text": "76ers: Carter-Williams and Nerlens Noel were both selected for the Rising Stars Challenge during All-Star weekend, marking the second time in team history that Philadelphia had two representatives in the event. ... Philadelphia has won five of its last seven home games against Detroit. ... The Sixers shot 51.1 percent from the field in the first half."}
{"game_id": "0021400682", "chunk_id": "0021400682_024", "order": 24, "role": "body", "text": "When Carter-Williams returned to the locker room, his teammates told him that he was only one rebound shy of a triple-double. The second-year point guard only wished they had told him sooner -- like during the game."}
{"game_id": "0021400682", "chunk_id": "0021400682_025", "order": 25, "role": "body", "text": "\"I didn't even know,\" he laughed. \"They didn't tell me. It's crazy.\""}
{"game_id": "0021400682", "chunk_id": "0021400682_027", "order": 27, "role": "body", "text": "The Sixers were well aware that the Pistons were playing their fourth game in five days, and they tried to use that to their advantage by running like crazy up and down the floor."}
{"game_id": "0021400682", "chunk_id": "0021400682_028", "order": 28, "role": "body", "text": "\"We wanted to turn this into a track meet as much as we could,\" Brown said."}
{"game_id": "0021400682", "chunk_id": "0021400682_030", "order": 30, "role": "body", "text": "Pistons: Host Houston on Saturday."}
{"game_id": "0021400682", "chunk_id": "0021400682_031", "order": 31, "role": "closing", "text": "76ers: Host Minnesota on Friday."}
