{"game_id": "0021300930", "chunk_id": "0021300930_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  The Memphis Grizzlies turned up their offense in the second half, and the Charlotte Bobcats were too tired to keep pace."}
{"game_id": "0021300930", "chunk_id": "0021300930_002", "order": 2, "role": "body", "text": "Mike Conley scored 20 points, Zach Randolph added 16 and the Grizzlies beat the Bobcats 111-89 on Saturday night."}
{"game_id": "0021300930", "chunk_id": "0021300930_003", "order": 3, "role": "body", "text": "\"From a team standpoint, I think we played well,\" said reserve center Kosta Koufos, who had 11 of his 12 points in the fourth quarter and grabbed 10 boards. \"We all executed on the offensive end. Defensively, (the bigs) were up on the screens, and our guards did a heck of a job in the passing lanes.\""}
{"game_id": "0021300930", "chunk_id": "0021300930_004", "order": 4, "role": "body", "text": "Marc Gasol added 14 points and nine rebounds as the Grizzlies won a season-best sixth straight home game."}
{"game_id": "0021300930", "chunk_id": "0021300930_005", "order": 5, "role": "body", "text": "Al Jefferson scored 17 for Charlotte, shooting just 7 of 17 from the field. Chris Douglas-Roberts finished with 15 points, his fourth straight game in double figures, but Kemba Walker had just 11 -- all in the first half -- on 3-of-13 shooting. Charlotte shot 40 percent for the game."}
{"game_id": "0021300930", "chunk_id": "0021300930_006", "order": 6, "role": "body", "text": "The Bobcats were playing their fifth game in seven days against some of the NBA's best teams, including Miami, Oklahoma City and Indiana. The fatigue showed through much of the game, but really emerged in the second half."}
{"game_id": "0021300930", "chunk_id": "0021300930_007", "order": 7, "role": "body", "text": "\"We lacked the energy that we needed,\" Charlotte coach Steve Clifford said. \"The second thing would be the physicality to play them. They have bruising in there, and if you aren't ready to fight in the paint, you're going to be in trouble.\""}
{"game_id": "0021300930", "chunk_id": "0021300930_008", "order": 8, "role": "body", "text": "Memphis, which has won four of its last five, dominated the interior, outscoring Charlotte 60-46 in the paint and winning the rebound battle 51-40."}
{"game_id": "0021300930", "chunk_id": "0021300930_009", "order": 9, "role": "body", "text": "\"We just played a great team that had a great game plan for us,\" Jefferson said. \"I think we kind of got away from what we do. A little fatigue played into it, too.\""}
{"game_id": "0021300930", "chunk_id": "0021300930_010", "order": 10, "role": "body", "text": "Memphis broke the game open after halftime, outscoring Charlotte 59-45 in the final two quarters."}
{"game_id": "0021300930", "chunk_id": "0021300930_011", "order": 11, "role": "body", "text": "Charlotte is a top-five defensive team, entering the game allowing 97.2 points per game. The Bobcats had held opponents under 100 points in 40 of the first 62 games."}
{"game_id": "0021300930", "chunk_id": "0021300930_012", "order": 12, "role": "body", "text": "Memphis outscored Charlotte 27-17 in the third quarter as the Grizzlies connected on 11 of 21 shots. Meanwhile, Charlotte's shooting struggles continued as the Bobcats hit only 8 of 25 in the period."}
{"game_id": "0021300930", "chunk_id": "0021300930_013", "order": 13, "role": "body", "text": "Memphis took a 79-61 lead at the end of the third and extended it to as many as 26 as Koufos consistently got to the rim early in the fourth."}
{"game_id": "0021300930", "chunk_id": "0021300930_014", "order": 14, "role": "body", "text": "Both teams then sent in the reserves to finish it out."}
{"game_id": "0021300930", "chunk_id": "0021300930_015", "order": 15, "role": "body", "text": "\"I thought (it) was a really good, professional win,\" Memphis coach Dave Joerger said. \"I thought our guys were focused and ready to play."}
{"game_id": "0021300930", "chunk_id": "0021300930_016", "order": 16, "role": "body", "text": "\"I thought we played pretty well in the first half, and even better in the second half.\""}
{"game_id": "0021300930", "chunk_id": "0021300930_017", "order": 17, "role": "body", "text": "Memphis carried a 52-44 lead into halftime behind 11 points from Conley and 10 from Randolph."}
{"game_id": "0021300930", "chunk_id": "0021300930_018", "order": 18, "role": "body", "text": "Memphis controlled Jefferson, who entered the game averaging 31-plus points in his last four games. He had eight points at the break on 3-of-9 shooting."}
{"game_id": "0021300930", "chunk_id": "0021300930_019", "order": 19, "role": "body", "text": "Gasol just kind of shook his head when asked about stopping Jefferson, who was 2 of 13 for only six points when Charlotte won the first meeting 92-89 on Feb. 22."}
{"game_id": "0021300930", "chunk_id": "0021300930_020", "order": 20, "role": "body", "text": "\"He has so many weapons, it's not about what you can do,\" Gasol said. \"You can make it tough on him a little bit."}
{"game_id": "0021300930", "chunk_id": "0021300930_021", "order": 21, "role": "body", "text": "\"Al is probably the toughest guy (to guard) because he has so many counters and different things he can do. Plus they run about 68 plays a game for him.\""}
{"game_id": "0021300930", "chunk_id": "0021300930_022", "order": 22, "role": "closing", "text": "Game notes Memphis entered the game having a different leading scorer in the last seven games. The streak ended with Conley scoring 20. Earlier this season, the Grizzlies went eight straight with a different high scorer. ... Jefferson's 17 points ended his string of four straight games scoring at least 25. ... Charlotte had lost the last three games in Memphis by a combined 74 points. ... Memphis reserve G/F Mike Miller left the floor in the second quarter after twisting his ankle, but returned in the second half."}
