{"game_id": "0021701227", "chunk_id": "0021701227_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Russell Westbrook needed rebounds to reach a milestone, so Paul George took care of the points."}
{"game_id": "0021701227", "chunk_id": "0021701227_002", "order": 2, "role": "body", "text": "George scored 40 points, Westbrook clinched a triple-double average for the second straight season and the Oklahoma City Thunder defeated the Memphis Grizzlies 137-123 on Wednesday night."}
{"game_id": "0021701227", "chunk_id": "0021701227_003", "order": 3, "role": "body", "text": "Westbrook entered the game 16 rebounds shy of becoming the first player to average a triple-double for a season more than once. He reached that total with just over nine minutes left in the third quarter and received a standing ovation. He finished with just six points, but had a career-high 20 rebounds and 19 assists."}
{"game_id": "0021701227", "chunk_id": "0021701227_004", "order": 4, "role": "body", "text": "\"I'm very, very thankful and blessed, man, to go out and compete,\" Westbrook said. \"Like I've said many, many times, I don't take this game for granted. I don't take going out on the floor and competing for granted.\""}
{"game_id": "0021701227", "chunk_id": "0021701227_005", "order": 5, "role": "body", "text": "George made 13 of 20 shots, including eight of 14 3-pointers."}
{"game_id": "0021701227", "chunk_id": "0021701227_006", "order": 6, "role": "body", "text": "\"I just caught a rhythm early,\" George said. \"It's just sticking with it, staying with the process and just putting work in -- a lot of work in. It paid off tonight.\""}
{"game_id": "0021701227", "chunk_id": "0021701227_007", "order": 7, "role": "body", "text": "With a loss, the Thunder would have been a No. 8 seed and forced to play No. 1 seed Houston in the first round. Instead, Oklahoma City will play Utah."}
{"game_id": "0021701227", "chunk_id": "0021701227_008", "order": 8, "role": "body", "text": "Steven Adams scored 24 points and Corey Brewer added 17 for the Thunder, who matched a franchise record with 20 made 3-pointers."}
{"game_id": "0021701227", "chunk_id": "0021701227_009", "order": 9, "role": "body", "text": "Dillon Brooks scored a career-high 36 points for Memphis."}
{"game_id": "0021701227", "chunk_id": "0021701227_010", "order": 10, "role": "body", "text": "Westbrook had one of the most unusual first halves of his career to help the Thunder take a 20-point lead. He had 12 assists and 11 rebounds, yet only scored one point and took two shots. George scored 26 points on 9-of-10 shooting, including 5 of 5 on 3-pointers in the first half to help Oklahoma City score a season-high 77 points in the first half."}
{"game_id": "0021701227", "chunk_id": "0021701227_011", "order": 11, "role": "body", "text": "Brooks scored 16 points in the third quarter to help the Grizzlies trim their deficit to 105-96 at the end of the third quarter. The Grizzlies scored 39 points in the period."}
{"game_id": "0021701227", "chunk_id": "0021701227_012", "order": 12, "role": "body", "text": "Memphis hung tough in the fourth quarter before back-to-back 3-pointers by Terrance Ferguson and George pushed Oklahoma City's lead to 133-116."}
{"game_id": "0021701227", "chunk_id": "0021701227_013", "order": 13, "role": "body", "text": "\"Obviously, I thought we had plays where we could have prevented points, but for the most part, they (Memphis) just played really well tonight,\" George said. \"I thought we did a great job of not falling into just being complacent. I thought we played phenomenal tonight. It just so happened that they played well as well. It's like that sometimes. It's just great that we played well enough to win.\""}
{"game_id": "0021701227", "chunk_id": "0021701227_015", "order": 15, "role": "body", "text": "Grizzlies: Marc Gasol (rest), Tyreke Evans (personal reasons), JaMychal Green (knee soreness), Wayne Selden Jr. (right knee soreness), Andrew Harrison (right wrist/left shoulder) and Jarell Martin (left ankle) all sat out."}
{"game_id": "0021701227", "chunk_id": "0021701227_016", "order": 16, "role": "body", "text": "Thunder: Westbrook brought F Nick Collison out to midcourt with him before the game. Westbrook said he wasn't sure if it would be the 37-year-old Collison's last regular-season game, but he wanted the crowd to acknowledge Collison's contribution to the franchise. ... G Alex Abrines (concussion protocol) did not play. ... Westbrook had seven assists in the first quarter. ... Brewer was fouled on a 3-pointer in the fourth quarter and left the game for good with a knee sprain."}
{"game_id": "0021701227", "chunk_id": "0021701227_018", "order": 18, "role": "body", "text": "Westbrook matched a season low with two field goals made and set a season low with nine field goal attempts."}
{"game_id": "0021701227", "chunk_id": "0021701227_020", "order": 20, "role": "body", "text": "Westbrook didn't shoot well, but the other four starters shot a combined 33 for 55 from the field."}
{"game_id": "0021701227", "chunk_id": "0021701227_022", "order": 22, "role": "body", "text": "Bickerstaff on the team's 22-60 finish: \"When you go through these types of times, everybody who is involved's true character comes out. It's easy when things are roses and sunshine to be a good player, a good teammate, to be a positive coach, whatever it may be. But these times, who are you? Hopefully everybody involved learned from it.\""}
{"game_id": "0021701227", "chunk_id": "0021701227_025", "order": 25, "role": "body", "text": "Thunder: Will open the playoffs this weekend."}
{"game_id": "0021701227", "chunk_id": "0021701227_027", "order": 27, "role": "body", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP"}
{"game_id": "0021701227", "chunk_id": "0021701227_029", "order": 29, "role": "closing", "text": "For more AP NBA coverage: https://apnews.com/tag/NBAbasketball"}
