{"game_id": "0021700469", "chunk_id": "0021700469_001", "order": 1, "role": "lead", "text": "PHOENIX --  Troy Daniels knew his shot was going in the moment it left his hands, and he knew exactly where he was on the court -- right in front of his former team's bench."}
{"game_id": "0021700469", "chunk_id": "0021700469_002", "order": 2, "role": "body", "text": "Troy Daniels hit a 3-pointer with 17.6 seconds to play to give Phoenix the lead, and the Suns held off the Grizzlies 97-95 on Thursday night for their third victory in four games."}
{"game_id": "0021700469", "chunk_id": "0021700469_003", "order": 3, "role": "body", "text": "\"We work each and every day for moments like this and I just happened to hit the shot,\" Daniels said. \"It feels great, I'll tell you that. I rather for it to be on them (the Grizzlies) then anyone else.\""}
{"game_id": "0021700469", "chunk_id": "0021700469_004", "order": 4, "role": "body", "text": "T.J. Warren led the Suns with 27 points, and Daniels -- acquired from the Grizzlies in September -- added 14 off the bench. Phoenix won at home for the first time since Nov. 19 against Chicago."}
{"game_id": "0021700469", "chunk_id": "0021700469_005", "order": 5, "role": "body", "text": "Tyreke Evans led Memphis with 23 points, and Marc Gasol added 13 points, 11 rebounds, five assists and three blocked shots. The Grizzlies have lost eight of nine games and nine straight on the road."}
{"game_id": "0021700469", "chunk_id": "0021700469_006", "order": 6, "role": "body", "text": "\"It's a matter of who makes the most plays and who makes the least mistakes,\" Memphis coach J.B. Bickerstaff said, \"and tonight they made one more play then we did.\""}
{"game_id": "0021700469", "chunk_id": "0021700469_007", "order": 7, "role": "body", "text": "The teams traded baskets and leads for much of the fourth quarter, and there were three ties. Neither team scored from the 3:45 mark of the fourth quarter until Daniels' key 3."}
{"game_id": "0021700469", "chunk_id": "0021700469_008", "order": 8, "role": "body", "text": "Memphis had two chances to tie or take the lead, but Evans' 26-footer at the buzzer missed."}
{"game_id": "0021700469", "chunk_id": "0021700469_009", "order": 9, "role": "body", "text": "I thought I could have got to the basket but I kind of stepped back and shot the 3,\" Evans said. \"It shouldn't have came down to that. We had the early lead in the game.\""}
{"game_id": "0021700469", "chunk_id": "0021700469_010", "order": 10, "role": "body", "text": "Greg Monroe rebounded a miss and saved the ball to Daniels for his shot. Monroe had 12 rebounds."}
{"game_id": "0021700469", "chunk_id": "0021700469_011", "order": 11, "role": "body", "text": "\"I just wanted to make sure I stayed in bounds,\" Monroe said. \"If I could just get it to him, I knew he had an open shot.\""}
{"game_id": "0021700469", "chunk_id": "0021700469_012", "order": 12, "role": "body", "text": "The Grizzlies used a 15-2 run to grab a 21-9 lead in the first quarter. But Phoenix outscored Memphis 17-4 over the final four minutes of the quarter to take a 26-25 lead going into the second."}
{"game_id": "0021700469", "chunk_id": "0021700469_013", "order": 13, "role": "body", "text": "Evans scored 11 of his points in the opening 12 minutes."}
{"game_id": "0021700469", "chunk_id": "0021700469_014", "order": 14, "role": "body", "text": "\"It was a struggle all night, really,\" Suns coach Jay Triano said. \"From the opening tip, five of their first baskets where straight-on drives to the basket.\""}
{"game_id": "0021700469", "chunk_id": "0021700469_015", "order": 15, "role": "body", "text": "The Suns took a 53-44 lead on Warren's 3-pointer with 2:40 left in the second. Then Warren scored and was fouled, making it 56-46."}
{"game_id": "0021700469", "chunk_id": "0021700469_016", "order": 16, "role": "body", "text": "Warren had 17 of his points at halftime, and the Suns led 60-51 at halftime."}
{"game_id": "0021700469", "chunk_id": "0021700469_017", "order": 17, "role": "body", "text": "The Grizzlies erased a 12-point third quarter deficit and took a 76-75 lead on Evans' layup, then Kobi Simmons got a steal and layup for a three-point Grizzlies lead with 2:25 left in the third."}
{"game_id": "0021700469", "chunk_id": "0021700469_018", "order": 18, "role": "body", "text": "Memphis took an 81-79 lead into the fourth quarter."}
{"game_id": "0021700469", "chunk_id": "0021700469_020", "order": 20, "role": "body", "text": "Midway through the third quarter, Suns guard Isaiah Canaan accidentally dusted a fan sitting courtside with the rosin that players put on their hands before checking into the game. It led to a brief exchange in which Canaan apologized and the two smiled."}
{"game_id": "0021700469", "chunk_id": "0021700469_022", "order": 22, "role": "body", "text": "Grizzlies: Bickerstaff was asked about speculation that the team is losing games on purpose. \"Everyone is entitled to their own opinion,\" he said. \"We are going to stay positive with our group, stay competitive and let it fall where it may.\"... Gasol is the Grizzlies' leader in points, rebounds, assists and blocked shots this season and is one of two NBA players to lead his team in all four categories, along with Giannis Antetokounmpo of Milwaukee. ... F Chandler Parsons returned after resting the past two games, and F-C Brandan Wright saw his first action since Dec. 1, returning from a groin injury."}
{"game_id": "0021700469", "chunk_id": "0021700469_023", "order": 23, "role": "body", "text": "Suns: Injured star Devin Booker, out since Dec. 6 with a groin injury, could return to practice as soon as this weekend. He took some shots in pregame warmups on Thursday. ... Phoenix hosts Memphis the day after Christmas, at the same time as the Cactus Bowl a couple of blocks away at nearby Chase Field. ... The Suns ended a four-game Grizzlies' win streak in the series."}
{"game_id": "0021700469", "chunk_id": "0021700469_025", "order": 25, "role": "body", "text": "Grizzlies: Host the Los Angeles Clippers on Saturday night."}
{"game_id": "0021700469", "chunk_id": "0021700469_026", "order": 26, "role": "closing", "text": "Suns: Host Minnesota on Saturday night."}
