{"game_id": "0021301190", "chunk_id": "0021301190_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- Steve Clifford isn't exactly singing his team's praises after the Bobcats won for the sixth time in seven games.\nIn fact, the first-year head coach said he's a little concerned about his team's focus as the playoffs approach.\n\"We haven't been the same team the last two games,\" Clifford said. \"Whether we exhaled after clinching [a playoff spot], or whatever it is, I don't know. Whatever it is, we have two games to get it back.\""}
{"game_id": "0021301190", "chunk_id": "0021301190_002", "order": 2, "role": "closing", "text": "The Bobcats held on to beat the Philadelphia 76ers 111-105 on Saturday behind 29 points and 12 rebounds from Al Jefferson, but it was far from an impressive victory.\nThe win came on the heels of a costly loss at Boston Friday night that dropped the Bobcats back to seventh place in the Eastern Conference standings.\nCharlotte (41-39) remains one game behind Washington in the race for the sixth seed with two games left. The Wizards defeated Milwaukee 104-91 on Saturday night.\nJefferson said the Bobcats need to find their mojo with two tough games coming up to close the season -- at Atlanta on Monday night and at home against Chicago on Wednesday.\n\"I thought [the loss to Boston] would wake us up for this game, but I don't know whether it was a back-to-back, three games in four nights or what,\" Jefferson said. \"... You could tell we were low energy. But we found a way to win, so that's the positive side of it.\"\nYou can't blame Jefferson for the team's sudden funk.\nHe has at least 20 points and 10 rebounds in each of the past six games, a franchise record.\nLuke Ridnour, starting in place of injured point guard Kemba Walker, had 12 points and eight assists in his first start for Charlotte.\nClifford said he expects Walker to return from a groin injury Monday night. But he expressed plenty of confidence in Ridnour to handle the role when needed.\n\"We're organized when Luke is in there,\" Clifford said. \"He gets guys into their right spots. He has a high basketball IQ and he knows the NBA game.\"\nMichael Carter-Williams had 23 points and eight assists to lead the 76ers, who have lost 16 of their past 17 games on the road.\nThe same problem that haunted the Bobcats in their loss to Boston -- poor defensive effort -- hurt them early on against the 76ers.\nPhiladelphia took a 59-56 lead at the break despite the Bobcats shooting 62 percent from the field in the first half.\nCharlotte would begin to take control late in the third quarter, opening a double-digit lead behind a pair of 3-pointers from Ridnour and Chris Douglas-Roberts and some solid inside play from Cody Zeller.\nBut ultimately the game came down to Philadelphia's inability to stop Jefferson in the low post.\nJefferson is averaging 26.1 points and 13 rebounds over the past six games and he showed again why he's an All-NBA team candidate.\nJefferson had his way early on, scoring 21 points in the first half on 10-of-13 shooting. He used his old-school style of play to make defenders Henry Sims and Byron Mullens look foolish at times by getting them to leave their feet with pump fakes, leading to easy up-and-under layups.\n\"He's got one of the best head fakes in the game, so it's tough to defend him,\" Mullens said.\nPhiladelphia got 16 points from Thaddeus Young and 15 from Sims, but it wasn't enough for the league's second-worst team.\nStill, it was a better showing than last week when the 76ers lost by 30 to the Bobcats on their home floor. At one point, the 76ers fell behind by 16, but closed to within four in the final minute -- but were unable to take the lead.\n\"It was entirely different,\" coach Brett Brown said. \"When you look at the last time we played this team, it was as good an effort as anybody has played on our home court. They shot it and they guarded. Tonight we blinked a little in the third, but we found a way to get back in it in the fourth.\"\nGame notes\nPhiladelphia's Jarvis Varnado was a late scratch with a right heel injury. ... The Bobcats have won 24 games at home, the second-most in franchise history. .. The Bobcats are 18-9 since the All-Star break, including 14-6 in their past 20 games."}
