{"game_id": "0021701039", "chunk_id": "0021701039_001", "order": 1, "role": "lead", "text": "CHICAGO --  As he exited the court, LeBron James brought a young fan to tears."}
{"game_id": "0021701039", "chunk_id": "0021701039_002", "order": 2, "role": "body", "text": "The Cavaliers' superstar made the boy's night by tossing him his sweat-soaked arm sleeve on the way to the locker room. As for the Bulls? All he gave them was more misery."}
{"game_id": "0021701039", "chunk_id": "0021701039_003", "order": 3, "role": "body", "text": "James scored 33 points as part of a triple-double, Jordan Clarkson had a tiebreaking four-point play with 1:27 left and Cleveland beat Chicago 114-109 on Saturday night."}
{"game_id": "0021701039", "chunk_id": "0021701039_004", "order": 4, "role": "body", "text": "James had 12 rebounds and 12 assists for his 15th triple-double of the season. He passed to Clarkson on the four-point play and had another big exchange with that boy when he exited the court."}
{"game_id": "0021701039", "chunk_id": "0021701039_005", "order": 5, "role": "body", "text": "\"Sometimes, the eyes do all the talking,\" James said. \"I'm just trying to be an inspiration to them and leave an impression, other than of me playing basketball.\""}
{"game_id": "0021701039", "chunk_id": "0021701039_006", "order": 6, "role": "body", "text": "Jeff Green added 21 points, and Clarkson scored 19 to help the Cavaliers salvage a split on their season-high six-game trip."}
{"game_id": "0021701039", "chunk_id": "0021701039_007", "order": 7, "role": "body", "text": "Denzel Valentine scored a career-best 34 points to lead Chicago, hitting 8 of 11 from long range, and Bobby Portis added 15 points and a season-high 15 rebounds. The Bulls wiped out a 17-point halftime deficit even though they held out banged-up core players Lauri Markkanen, Zach LaVine and Kris Dunn, only to come up short in the closing minutes."}
{"game_id": "0021701039", "chunk_id": "0021701039_008", "order": 8, "role": "body", "text": "\"It shows we have a great young core, no matter who's out there,\" Valentine said. \"KD, Lauri and Zach were hurt so we've got to pick it up. Guys played hard and we fought to the end. Best player on the planet just put the team on his back and got a win.\""}
{"game_id": "0021701039", "chunk_id": "0021701039_010", "order": 10, "role": "body", "text": "Cleveland coach Tyronn Lue spent the second half in the locker room with an illness, another hit for an already short-handed team. It was the second time this season Lue left a game because he wasn't feeling well, and he also sat one out against Chicago at home in December. Associate head coach Larry Drew filled in for him in the second half."}
{"game_id": "0021701039", "chunk_id": "0021701039_011", "order": 11, "role": "body", "text": "The Cavaliers let a 69-52 halftime lead shrink to four heading into the fourth quarter. They got it back up to 11, only to have the Bulls tie it at 99 on Valentine's 3 from atop the key with 4:13 remaining."}
{"game_id": "0021701039", "chunk_id": "0021701039_012", "order": 12, "role": "body", "text": "James made a fadeaway shot and hit a jumper after Portis got blocked down low. James then fed Green for an alley-oop to put Cleveland back on top 105-99 with just over three minutes left."}
{"game_id": "0021701039", "chunk_id": "0021701039_013", "order": 13, "role": "body", "text": "The Bulls tied it again on 3-pointers by Paul Zipser and Cameron Payne. But Clarkson converted a four-point play after getting fouled by Valentine in the corner, and James hit a pull-up jumper to make it 111-105 with 39 seconds remaining."}
{"game_id": "0021701039", "chunk_id": "0021701039_015", "order": 15, "role": "body", "text": "Though he played at Michigan State, Valentine has a keen interest in what Loyola-Chicago is accomplishing in the NCAA Tournament. That's because his brother Drew is an assistant for the Ramblers."}
{"game_id": "0021701039", "chunk_id": "0021701039_016", "order": 16, "role": "body", "text": "Loyola-Chicago beat Tennessee to advance to the Sweet 16 for the first time since 1985. The Ramblers had not played in the tournament since a loss to Patrick Ewing and Georgetown that year."}
{"game_id": "0021701039", "chunk_id": "0021701039_017", "order": 17, "role": "body", "text": "\"We didn't know it was going to happen this way, he was going to be coaching and I was going to be playing for the Bulls,\" Denzel Valentine said. \"We saw greatness in our future. We just work extremely hard in whatever we're doing. We try to do the right thing and have faith in everything.\""}
{"game_id": "0021701039", "chunk_id": "0021701039_019", "order": 19, "role": "body", "text": "Cavaliers: The Cavaliers completed their first four-game sweep against Chicago since 2005-06. ... Lue wouldn't say if the Cavaliers are targeting a specific game next week for Kevin Love's return from a broken left hand. They host Milwaukee, Toronto and Phoenix. Love hasn't played since Jan. 30."}
{"game_id": "0021701039", "chunk_id": "0021701039_020", "order": 20, "role": "body", "text": "Bulls: Markkanen (lower back spasms) missed his third straight, though coach Fred Hoiberg said he is \"significantly better.\" LaVine's surgically repaired left knee was sore, and Dunn developed a toe problem in Thursday's game against Memphis. Those three have made just 12 starts together since the blockbuster trade for Jimmy Butler with Minnesota on draft night. \"I'm confident we'll get everything (chemistry-wise) in the offseason right with those three guys,\" Hoiberg said. \"I'm really excited about that opportunity this offseason. Hopefully to get those guys ready and get a step ahead going into training camp.\" ... C Robin Lopez was inactive."}
{"game_id": "0021701039", "chunk_id": "0021701039_022", "order": 22, "role": "body", "text": "Cavaliers: Host Milwaukee on Monday."}
{"game_id": "0021701039", "chunk_id": "0021701039_023", "order": 23, "role": "body", "text": "Bulls: Visit New York on Monday."}
{"game_id": "0021701039", "chunk_id": "0021701039_025", "order": 25, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
