{"game_id": "0021701157", "chunk_id": "0021701157_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  The focused 76ers have their eyes and hearts set on home-court advantage in the playoffs."}
{"game_id": "0021701157", "chunk_id": "0021701157_002", "order": 2, "role": "body", "text": "J.J. Redick scored 19 points and Ben Simmons had 15 points and 12 rebounds to lead Philadelphia to its 11th straight victory, 121-95 over the Brooklyn Nets on Tuesday night. That kept the 76ers in fourth place in the Eastern Conference with five games remaining."}
{"game_id": "0021701157", "chunk_id": "0021701157_003", "order": 3, "role": "body", "text": "\"We don't hide from our goal,\" Philadelphia coach Brett Brown said. \"We want home court.\""}
{"game_id": "0021701157", "chunk_id": "0021701157_004", "order": 4, "role": "body", "text": "If the playoffs started on Wednesday, the 76ers would host a first-round series. They remained a half-game behind third-place Cleveland and in front of fifth-place Indiana, which began Tuesday a half-game behind Philadelphia. The 76ers have five games remaining, including Friday's home contest against the Cavaliers."}
{"game_id": "0021701157", "chunk_id": "0021701157_005", "order": 5, "role": "body", "text": "Redick said that goal helped Philadelphia easily dispatch the Nets, who merely are playing out the string."}
{"game_id": "0021701157", "chunk_id": "0021701157_006", "order": 6, "role": "body", "text": "\"It's tough when you're not playing for anything,\" Redick said. \"We have to take advantage of teams that aren't playing for anything. We really imposed our will defensively and the force we played with offensively.\""}
{"game_id": "0021701157", "chunk_id": "0021701157_007", "order": 7, "role": "body", "text": "The veteran guard even got some welcomed rest."}
{"game_id": "0021701157", "chunk_id": "0021701157_008", "order": 8, "role": "body", "text": "Neither Simmons nor Redick played in the fourth quarter for Philadelphia, which won its third consecutive contest without All-Star center Joel Embiid. Embiid had surgery on Saturday after suffering an orbital fracture in his left eye in Wednesday's 118-101 win over the Knicks. Embiid will be out for the remainder of the regular season and is slated to return for the playoffs, although his exact return date is not known."}
{"game_id": "0021701157", "chunk_id": "0021701157_009", "order": 9, "role": "body", "text": "Marco Belinelli added 17 points for the 76ers (47-30), who also didn't have starter Dario Saric (cellulitis right elbow)."}
{"game_id": "0021701157", "chunk_id": "0021701157_010", "order": 10, "role": "body", "text": "Spencer Dinwiddie had 16 points for the Nets (25-53)."}
{"game_id": "0021701157", "chunk_id": "0021701157_011", "order": 11, "role": "body", "text": "Brooklyn coach Kenny Atkinson was displeased with the effort."}
{"game_id": "0021701157", "chunk_id": "0021701157_012", "order": 12, "role": "body", "text": "\"From a physical and mental standpoint, we weren't focused and ready to play,\" he said. \"It was evident. We were not engaged physically or mentally and that's what happens. It was a layupathon.\""}
{"game_id": "0021701157", "chunk_id": "0021701157_013", "order": 13, "role": "body", "text": "The 76ers were up 61-49 at the half and took control in the third quarter. Philadelphia scored 11 of the first 12 points of the period, capped by Redick's fast-break layup with 8:36 left that made it 72-50. They went on to outscore the Nets 32-22 in the period to take a 93-71 advantage into the fourth."}
{"game_id": "0021701157", "chunk_id": "0021701157_015", "order": 15, "role": "body", "text": "Nets: Atkinson said he wants rookie Jarrett Allen to focus on improving his rebounding this offseason by bulking up and developing a more \"assertive\" mentality. ... Brooklyn lost the rebounding battle 56-36."}
{"game_id": "0021701157", "chunk_id": "0021701157_016", "order": 16, "role": "body", "text": "76ers: The 76ers unveiled a sculpture of Hall of Famer Julius \"Dr. J\" Erving on Tuesday at their practice facility in Camden, New Jersey. Erving rang the ceremonial Liberty Bell prior to tipoff. ... Brown said it's unlikely that guards Markelle Fultz and Simmons would see the court together during the playoffs, explaining that he needs to surround both with shooters. The duo did see time together in the third quarter against the Nets."}
{"game_id": "0021701157", "chunk_id": "0021701157_018", "order": 18, "role": "body", "text": "Atkinson is trying to model the Nets' rebuild after the 76ers. \"I observed closely their whole process and how they built this,\" he said before the game."}
{"game_id": "0021701157", "chunk_id": "0021701157_020", "order": 20, "role": "body", "text": "Nets F DeMarre Carroll (left hip strain) limped to the locker room 3  1/2 minutes into the second half and didn't return. He finished with 10 points in 18 minutes. Atkinson didn't have an update afterward. Brooklyn G Allen Crabbe (illness) didn't play. Joe Harris replaced him in the starting lineup and had 13 points."}
{"game_id": "0021701157", "chunk_id": "0021701157_021", "order": 21, "role": "body", "text": "G Isaiah Whitehead had season-ending surgery on Tuesday to repair a ligament injury in his right wrist. Whitehead averaged 6.3 points in 16 games for Brooklyn."}
{"game_id": "0021701157", "chunk_id": "0021701157_022", "order": 22, "role": "body", "text": "Saric won't make the trip to Detroit for Wednesday's game against the Pistons. Brown expects him to return for Friday's home contest against Cleveland."}
{"game_id": "0021701157", "chunk_id": "0021701157_024", "order": 24, "role": "body", "text": "Nets: At Milwaukee on Thursday night."}
{"game_id": "0021701157", "chunk_id": "0021701157_025", "order": 25, "role": "closing", "text": "76ers: Host Detroit on Wednesday night."}
