{"game_id": "0021700885", "chunk_id": "0021700885_001", "order": 1, "role": "lead", "text": "MIAMI --  After three consecutive narrow defeats and 17 close games in a row, the Miami Heat were in the market for a laugher."}
{"game_id": "0021700885", "chunk_id": "0021700885_002", "order": 2, "role": "body", "text": "Bring on the Memphis Grizzlies."}
{"game_id": "0021700885", "chunk_id": "0021700885_003", "order": 3, "role": "body", "text": "Tyler Johnson scored 23 points to lead six players in double figures, and the Heat beat the reeling Grizzlies 115-89 on Saturday night."}
{"game_id": "0021700885", "chunk_id": "0021700885_004", "order": 4, "role": "body", "text": "The Grizzlies lost their ninth game in a row, the longest active streak in the NBA, and their second in as many nights."}
{"game_id": "0021700885", "chunk_id": "0021700885_005", "order": 5, "role": "body", "text": "Miami snapped a three-game losing streak, with the defeats coming by a total of six points. The Heat had a single-digit margin in their past 17 games, three shy of the NBA record, and lost 12 of those."}
{"game_id": "0021700885", "chunk_id": "0021700885_006", "order": 6, "role": "body", "text": "\"We were actually talking about it today -- being the team with the most clutch games,\" forward Justise Winslow said. \"The bottom line is we got a win, which we really needed to get this thing going in the right direction.\""}
{"game_id": "0021700885", "chunk_id": "0021700885_007", "order": 7, "role": "body", "text": "The victory was the Heat's most lopsided of the season. Their biggest margin previously was 25 points on Dec. 11 -- also against Memphis."}
{"game_id": "0021700885", "chunk_id": "0021700885_008", "order": 8, "role": "body", "text": "Winslow scored a season-high 17 points. Reserve Wayne Ellington went 5 for 10 from 3-point range and scored 15."}
{"game_id": "0021700885", "chunk_id": "0021700885_009", "order": 9, "role": "body", "text": "Miami's Dwyane Wade was limited to 18 minutes by foul trouble and scored six points. But the Heat, scrambling for a playoff berth, still managed to win for only the second time in the past 10 games."}
{"game_id": "0021700885", "chunk_id": "0021700885_010", "order": 10, "role": "body", "text": "\"We didn't start off the game great, but once we got into it we played a great game,\" Wade said."}
{"game_id": "0021700885", "chunk_id": "0021700885_011", "order": 11, "role": "body", "text": "Andrew Harrison scored 17 points for the Grizzlies, who played without leading scorer Tyreke Evans and center Marc Gasol."}
{"game_id": "0021700885", "chunk_id": "0021700885_012", "order": 12, "role": "body", "text": "Evans will undergo a precautionary MRI Sunday on his injured right ribs. Gasol was rested and missed only his second game."}
{"game_id": "0021700885", "chunk_id": "0021700885_013", "order": 13, "role": "body", "text": "The Grizzlies fell behind for good at 28-26. By the end of the third quarter they trailed 92-70."}
{"game_id": "0021700885", "chunk_id": "0021700885_014", "order": 14, "role": "body", "text": "\"We didn't stick together again, started getting frustrated, started trying to come back all on one play, started trying to come back on our own,\" Harrison said. \"It was everybody.\""}
{"game_id": "0021700885", "chunk_id": "0021700885_015", "order": 15, "role": "body", "text": "Miami outscored Memphis 50-30 in the paint, 13-2 on fast breaks and 26-8 off turnovers."}
{"game_id": "0021700885", "chunk_id": "0021700885_016", "order": 16, "role": "body", "text": "\"We've been in so many close games,\" Johnson said. \"It's good to finally be able to exhale a little bit.\""}
{"game_id": "0021700885", "chunk_id": "0021700885_017", "order": 17, "role": "body", "text": "Grizzlies coach J.B. Bickerstaff praised the Heat's effort."}
{"game_id": "0021700885", "chunk_id": "0021700885_018", "order": 18, "role": "body", "text": "\"They compete for 48 minutes, and they can smell blood,\" he said. \"They just decide they're going to out-work you for a five-minute period of time, and then they continue it. And if you don't match that energy, you end up getting beat the way we got beat.\""}
{"game_id": "0021700885", "chunk_id": "0021700885_020", "order": 20, "role": "body", "text": "Heat: Kelly Olynyk (shoulder) missed his sixth consecutive game."}
{"game_id": "0021700885", "chunk_id": "0021700885_021", "order": 21, "role": "body", "text": "Grizzlies: F Chandler Parsons (illness) sat out, and his availability against Boston is uncertain. ... Gasol will be back in the lineup Monday at Boston, Bickerstaff said."}
{"game_id": "0021700885", "chunk_id": "0021700885_023", "order": 23, "role": "body", "text": "Heat: Johnson, who had been averaging only 9.7 points since returning from an ankle injury, said he regrouped mentally during the All-Star break. \"I had to take a long look at myself over the break -- what was working, what wasn't working,\" he said. \"I was just settling for too many jumpers, trying to shoot my way out of a funk instead of doing what I do best, which is being an attacker.\""}
{"game_id": "0021700885", "chunk_id": "0021700885_024", "order": 24, "role": "body", "text": "Grizzlies: Fell to 0-9 on the road since Jan. 1, and 0-9 on the road against the Eastern Conference this season. They are 3-18 against the East overall. ... They fell to 3-35 when trailing to start the fourth quarter."}
{"game_id": "0021700885", "chunk_id": "0021700885_026", "order": 26, "role": "body", "text": "The Heat paid tribute to the victims of the Florida school shooting with a scoreboard video, and Wade praised the students campaigning for gun safety. \"You are our nation's inspiration,\" he said. \"We salute you and we support you.\""}
{"game_id": "0021700885", "chunk_id": "0021700885_028", "order": 28, "role": "body", "text": "Heat: Host Philadelphia on Tuesday in the second game of a five-game homestand."}
{"game_id": "0021700885", "chunk_id": "0021700885_029", "order": 29, "role": "body", "text": "Grizzlies: Visit Boston on Monday."}
{"game_id": "0021700885", "chunk_id": "0021700885_031", "order": 31, "role": "closing", "text": "More AP NBA: apnews.com/tag/NBAbasketball"}
