{"game_id": "0021700456", "chunk_id": "0021700456_001", "order": 1, "role": "lead", "text": "BOSTON --  Kelly Olynyk was honored by the Boston Celtics and showered with cheers by their fans."}
{"game_id": "0021700456", "chunk_id": "0021700456_002", "order": 2, "role": "body", "text": "Then he went out and beat his old team."}
{"game_id": "0021700456", "chunk_id": "0021700456_003", "order": 3, "role": "body", "text": "Olynyk scored a career-high 32 points in his rousing return to Boston, and the undermanned Miami Heat hung on Wednesday for a 90-89 victory over the Celtics."}
{"game_id": "0021700456", "chunk_id": "0021700456_004", "order": 4, "role": "body", "text": "On a night when the Celtics celebrated their former forward in his first game back, the popular Olynyk received a standing ovation from the Boston crowd and led the Heat (16-15) to another win against the top team in the Eastern Conference."}
{"game_id": "0021700456", "chunk_id": "0021700456_005", "order": 5, "role": "body", "text": "When it was over, he took photos with fans."}
{"game_id": "0021700456", "chunk_id": "0021700456_006", "order": 6, "role": "body", "text": "\"It's special. Just all the love and support they've given me, from the organization, from the team, to the city, to the fans,\" said Olynyk, who signed with Miami as a free agent last offseason. \"It's special to come back here and play in front of them. It's something that's special. For them to recognize you and honor you like that, that's something that doesn't always happen.\""}
{"game_id": "0021700456", "chunk_id": "0021700456_007", "order": 7, "role": "body", "text": "Josh Richardson had 19 points and six assists for Miami, which took two of three in the season series."}
{"game_id": "0021700456", "chunk_id": "0021700456_008", "order": 8, "role": "body", "text": "The Heat ended Boston's 16-game winning streak earlier this season with a victory at home."}
{"game_id": "0021700456", "chunk_id": "0021700456_009", "order": 9, "role": "body", "text": "\"We had nine guys,\" Miami coach Erik Spoelstra said. \"We were running out of bodies, guys were starting to get tired. I knew guys were going to have to play probably 20 minutes in the second half. Sometimes desperate times call for desperate measures in this league.\""}
{"game_id": "0021700456", "chunk_id": "0021700456_010", "order": 10, "role": "body", "text": "Kyrie Irving paced the Celtics (26-8) with 33 points, but missed a jumper from the right wing that bounced off the rim at the buzzer. Jaylen Brown scored 16 and Marcus Smart had 15."}
{"game_id": "0021700456", "chunk_id": "0021700456_011", "order": 11, "role": "body", "text": "\"We still had a chance to steal one tonight,\" Irving said. \"Just came up short.\""}
{"game_id": "0021700456", "chunk_id": "0021700456_012", "order": 12, "role": "body", "text": "Boston shot only 37.5 percent, and nearly halfway into the final quarter had only five baskets in the entire second half."}
{"game_id": "0021700456", "chunk_id": "0021700456_013", "order": 13, "role": "body", "text": "\"Just because they don't have all of their players, we've still got to come out and play,\" Smart said. \"If this isn't a wakeup call for us, I don't know what is.\""}
{"game_id": "0021700456", "chunk_id": "0021700456_014", "order": 14, "role": "body", "text": "Boston big man Al Horford went 2 for 10 from the floor with eight rebounds and fouled out with 8:14 to play."}
{"game_id": "0021700456", "chunk_id": "0021700456_015", "order": 15, "role": "body", "text": "Miami led 87-76 with 2 1/2 minutes left before Irving sparked a 13-3 run with nine points."}
{"game_id": "0021700456", "chunk_id": "0021700456_016", "order": 16, "role": "body", "text": "Miami pulled out to a 71-60 lead when Olynyk drained consecutive 3-pointers in front of Boston's bench with just under 10 minutes to go."}
{"game_id": "0021700456", "chunk_id": "0021700456_017", "order": 17, "role": "body", "text": "The Celtics sliced it to 79-75, but Richardson converted a three-point play and Olynyk nailed a 3 on consecutive possessions with less than five minutes left."}
{"game_id": "0021700456", "chunk_id": "0021700456_018", "order": 18, "role": "body", "text": "The Heat went on a 15-2 run midway through the third quarter, taking their first lead and building a 58-51 advantage on Bam Adebayo's one-handed flip in the lane."}
{"game_id": "0021700456", "chunk_id": "0021700456_020", "order": 20, "role": "body", "text": "Heat: Olynyk's previous high was 30 points on Dec. 15, 2014. ... G Goran Dragic missed his second straight game with a sore left elbow and F Justise Winslow sat out his fourth in a row with strained left knee. It was the second consecutive game in which the Heat were missing six players due to injuries. ... The Heat were called for delay of game because they weren't on the court quickly enough to start the second half."}
{"game_id": "0021700456", "chunk_id": "0021700456_021", "order": 21, "role": "body", "text": "Celtics: Jayson Tatum dislocated his right pinkie when it was stepped on after he dove for a loose ball in the opening minutes. He went straight to the locker room, but returned late in the first quarter. ... F Daniel Theis played with a mask after surgery for a broken nose Tuesday. ... F Guerschon Yabusele pretends to shoot an arrow and does a \"dab\" after he hits a 3."}
{"game_id": "0021700456", "chunk_id": "0021700456_023", "order": 23, "role": "body", "text": "The Celtics honored Olynyk as the \"Hero Among Us\" for doing more than 100 community appearances and helping raise thousands of dollars for their charity when he was with the team."}
{"game_id": "0021700456", "chunk_id": "0021700456_024", "order": 24, "role": "body", "text": "\"I think it's a fun way to honor. It's bigger than what you do on the court,\" Boston coach Brad Stevens said before the game. \"He embraced that, and I thought he lived that out well. It wasn't just talk when the cameras were on. He was out all the time.\""}
{"game_id": "0021700456", "chunk_id": "0021700456_025", "order": 25, "role": "body", "text": "There was a brief video of Olynyk doing events and he was given a standing ovation early in the second quarter."}
{"game_id": "0021700456", "chunk_id": "0021700456_027", "order": 27, "role": "body", "text": "The teams combined to miss 24 shots in the second quarter -- with both under 39 percent -- and went long stretches without a basket."}
{"game_id": "0021700456", "chunk_id": "0021700456_029", "order": 29, "role": "body", "text": "Heat: Host the Dallas Mavericks on Friday in the opener of a four-game homestand."}
{"game_id": "0021700456", "chunk_id": "0021700456_030", "order": 30, "role": "body", "text": "Celtics: At the New York Knicks on Thursday."}
{"game_id": "0021700456", "chunk_id": "0021700456_032", "order": 32, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
