{"game_id": "0021201085", "chunk_id": "0021201085_001", "order": 1, "role": "lead", "text": "DALLAS --  Dirk Nowitzki said the ball felt flat coming out of his hand."}
{"game_id": "0021201085", "chunk_id": "0021201085_002", "order": 2, "role": "body", "text": "It turned out to be the perfect trajectory for the Dallas Mavericks."}
{"game_id": "0021201085", "chunk_id": "0021201085_003", "order": 3, "role": "body", "text": "Nowitzki hit a 3-pointer with 2.9 seconds left, and the Mavericks rallied to beat the Chicago Bulls 100-98 on Saturday."}
{"game_id": "0021201085", "chunk_id": "0021201085_004", "order": 4, "role": "body", "text": "\"This game was kind of like the story of our season,\" said Nowitzki, who finished with a season-high 35 points. \"Every time someone writes us off, we find a way to come back.\""}
{"game_id": "0021201085", "chunk_id": "0021201085_005", "order": 5, "role": "body", "text": "The Mavericks trailed by 12 in the fourth quarter, but Nowitzki scored Dallas' last eight points in a 15-1 run over the final 3 1/2 minutes of the game."}
{"game_id": "0021201085", "chunk_id": "0021201085_006", "order": 6, "role": "body", "text": "After Jimmy Butler missed two free throws with 15.9 seconds remaining, Vince Carter drove down the lane and kicked a pass out to Nowitzki, who stepped into a 3-pointer with Luol Deng running at him."}
{"game_id": "0021201085", "chunk_id": "0021201085_007", "order": 7, "role": "body", "text": "Nowitzki raised both hands in the air and yelled as he headed toward the Dallas bench. Chicago's Nate Robinson then missed a jumper at the buzzer that would have tied it."}
{"game_id": "0021201085", "chunk_id": "0021201085_008", "order": 8, "role": "body", "text": "\"It didn't feel great,\" Nowitzki said."}
{"game_id": "0021201085", "chunk_id": "0021201085_009", "order": 9, "role": "body", "text": "Dallas (36-37) crept within a game of the Los Angeles Lakers and the Utah Jazz for the final playoff spot in the West. The Jazz hosted Brooklyn on Saturday night and the Lakers were at Sacramento."}
{"game_id": "0021201085", "chunk_id": "0021201085_010", "order": 10, "role": "body", "text": "The Mavericks, who bounced back from a 25-point loss to Indiana, open a four-game road trip against the Lakers on Tuesday night."}
{"game_id": "0021201085", "chunk_id": "0021201085_011", "order": 11, "role": "body", "text": "\"All these are must-win for us,\" Dallas center Brandan Wright said. \"We couldn't afford to lose two in a row.\""}
{"game_id": "0021201085", "chunk_id": "0021201085_012", "order": 12, "role": "body", "text": "Robinson scored 14 of his 25 points in the fourth in Chicago's first game since ending the Miami Heat's 27-game winning streak. The reserve guard made all seven of his 3-point attempts."}
{"game_id": "0021201085", "chunk_id": "0021201085_013", "order": 13, "role": "body", "text": "Carlos Boozer and Deng also had 25 points for the Bulls, who hit a season-high 12 3-pointers."}
{"game_id": "0021201085", "chunk_id": "0021201085_014", "order": 14, "role": "body", "text": "\"This was definitely a tough loss,\" Chicago guard Kirk Hinrich said. \"We just didn't finish it out. They have a lot of guys with lots of experience and I give them credit.\""}
{"game_id": "0021201085", "chunk_id": "0021201085_015", "order": 15, "role": "body", "text": "The Mavericks trailed 97-85 after Deng hit the Bulls' sixth 3-pointer of the final period."}
{"game_id": "0021201085", "chunk_id": "0021201085_016", "order": 16, "role": "body", "text": "Nowitzki made a 3 to cut Dallas' deficit to 97-95 with 53.9 seconds left. The Bulls, who missed 3-of-4 foul shots in the final minute, got a free throw from Boozer with 41.2 seconds remaining."}
{"game_id": "0021201085", "chunk_id": "0021201085_017", "order": 17, "role": "body", "text": "Nowitzki then hit a step-back jumper to get Dallas within one and Carter fouled Butler, who was open on a cut near the basket."}
{"game_id": "0021201085", "chunk_id": "0021201085_018", "order": 18, "role": "body", "text": "Butler missed two free throws, and the Mavericks grabbed the rebound and headed up the court. Carter looked to have a good look at the last shot, but instead passed to Nowitzki for the game-winner."}
{"game_id": "0021201085", "chunk_id": "0021201085_019", "order": 19, "role": "body", "text": "Nowitzki hit his first eight shots and finished 14 of 17 from the floor."}
{"game_id": "0021201085", "chunk_id": "0021201085_020", "order": 20, "role": "body", "text": "Robinson's jumper was well off and the Bulls were denied their season-high fourth straight victory."}
{"game_id": "0021201085", "chunk_id": "0021201085_021", "order": 21, "role": "body", "text": "Carter and Wright each scored 17 points for the Mavericks, who finished 4-2 on a six-game homestand."}
{"game_id": "0021201085", "chunk_id": "0021201085_022", "order": 22, "role": "body", "text": "Dallas closed the third with a 12-1 run to tie it at 75."}
{"game_id": "0021201085", "chunk_id": "0021201085_023", "order": 23, "role": "body", "text": "Robinson scored all of Chicago's points in an 11-2 run to start the fourth. The 5-foot-9 guard then hit a 32-footer to beat the shot clock, putting the Bulls up 91-83 midway through the quarter."}
{"game_id": "0021201085", "chunk_id": "0021201085_024", "order": 24, "role": "body", "text": "\"He was on fire,\" Nowitzki said of Robinson. \"It was like a video game.\""}
{"game_id": "0021201085", "chunk_id": "0021201085_025", "order": 25, "role": "body", "text": "All-Star center Joakim Noah (right foot) was sidelined for the fourth straight game for Chicago, and guard Marco Belinelli (abdominal strain) missed his third straight. The Bulls also were without Richard Hamilton (lower back), who hasn't played since Feb. 26."}
{"game_id": "0021201085", "chunk_id": "0021201085_026", "order": 26, "role": "closing", "text": "Game notes Bulls point guard Derrick Rose, who hasn't played this season after injuring his left knee in the playoffs last year, worked out on the court before the game. Coach Tom Thibodeau did not provide a timetable for Rose's return. \"As long as he continues to improve, that's all we're concerned with,\" Thibodeau said. \"When he's comfortable, he'll get out there.\" ... Dallas G O.J. Mayo went 1 of 13 with an injured left shoulder. Mayo had an MRI on Friday which revealed a sprained AC joint. He started the game wearing a harness, but played without it after the first quarter. ... The Mavericks recalled G Jared Cunningham from the Texas Legends of the NBA Development League after the game. He averaged two points in eight games with Dallas earlier this season."}
