{"game_id": "0021200034", "chunk_id": "0021200034_001", "order": 1, "role": "lead", "text": "DALLAS --  After Vince Carter pumped up the crowd, O.J. Mayo kept knocking down shots."}
{"game_id": "0021200034", "chunk_id": "0021200034_002", "order": 2, "role": "body", "text": "Mayo scored 30 points, including a career-high seven 3-pointers, and Carter got the fans going in Dallas' home opener with a powerful dunk and high-flying block to help the Mavericks remain unbeaten against Charlotte with a 126-99 victory on Saturday night."}
{"game_id": "0021200034", "chunk_id": "0021200034_003", "order": 3, "role": "body", "text": "\"He was locked in,\" Carter said of Mayo. \"He was worried about his shot a couple of days ago, and even early in the game. And I just said, 'Just shoot. Just shoot it like you're 5 for 5 instead of 1 for 5.' \""}
{"game_id": "0021200034", "chunk_id": "0021200034_004", "order": 4, "role": "body", "text": "Mayo fed off Carter, too. He had a three-point play and his first 3-pointer less than a minute after Carter's emphatic first-quarter dunk -- reminiscent of his \"Vinsanity\" days -- over Bobcats center Bismack Biyombo."}
{"game_id": "0021200034", "chunk_id": "0021200034_005", "order": 5, "role": "body", "text": "Carter then brought fans to their feet again by chasing down Kemba Walker and sending his breakaway layup attempt into the stands in the second quarter."}
{"game_id": "0021200034", "chunk_id": "0021200034_006", "order": 6, "role": "body", "text": "Dallas, which improved to 16-0 all-time against Charlotte, trailed 53-52 when Mayo put the Mavericks ahead for good on a 3-pointer with 1:01 left in the first half. Shawn Marion followed with a three-point play, and Darren Collison hit a running 34-footer at the buzzer for a 61-53 lead."}
{"game_id": "0021200034", "chunk_id": "0021200034_007", "order": 7, "role": "body", "text": "Collison started the second half with another 3-pointer, and Mayo finished the 24-8 run with a 3 that made it 76-61. The Mavericks scored 36 points in the third quarter after getting outscored by Utah 37-13 in that period in their first loss Thursday."}
{"game_id": "0021200034", "chunk_id": "0021200034_008", "order": 8, "role": "body", "text": "\"Once we got on the plane, a couple of us popped in the film and saw that our energy, effort, we were so casual during the entire third quarter, so we wanted to come out with an attack mentality and really just get after it,\" Mayo said."}
{"game_id": "0021200034", "chunk_id": "0021200034_009", "order": 9, "role": "body", "text": "Carter had 18 points, and the 14-year veteran was 4 of 8 from 3-point range. The Mavs had 16 3-pointers as Rick Carlisle became the third coach to win 200 games with Dallas. Don Nelson (339) and original Mavericks coach Dick Motta (329) are the others."}
{"game_id": "0021200034", "chunk_id": "0021200034_010", "order": 10, "role": "body", "text": "\"You make 16 3s, you're not going to lose many games, and it was a bit of a deodorant for some of our other transgressions,\" Carlisle said. \"We look to make strides, mild as they may be, and get better.\""}
{"game_id": "0021200034", "chunk_id": "0021200034_011", "order": 11, "role": "body", "text": "Ramon Sessions led Charlotte with 22 points. Former Mavericks center Brendan Haywood had 14 points and 11 rebounds."}
{"game_id": "0021200034", "chunk_id": "0021200034_012", "order": 12, "role": "body", "text": "Dallas center Chris Kaman made his debut as a reserve. He got off to a slow start after missing two weeks with a strained right calf, but he was a different player in the second half. He made all five of his shots in the third quarter, including an alley-oop dunk on one of Collison's 10 assists, and finished with 16 points on 8-of-9 shooting."}
{"game_id": "0021200034", "chunk_id": "0021200034_013", "order": 13, "role": "body", "text": "\"I missed the last four preseason games and the first two, so I'm kind of like a new player out there,\" said Kaman, expected to be a critical component as the Mavericks try to hold on until injured star Dirk Nowitzki returns. \"I'm just trying to fit in where I can and do what I can do.\""}
{"game_id": "0021200034", "chunk_id": "0021200034_015", "order": 15, "role": "body", "text": "Former Charlotte coach Larry Brown, now at SMU after he was fired by the Bobcats two years ago, watched courtside as the Bobcats fell behind 31-19 after the first quarter before going on a 17-4 run for a 36-35 lead. Sessions had eight points during the spurt, including the go-ahead bucket."}
{"game_id": "0021200034", "chunk_id": "0021200034_016", "order": 16, "role": "body", "text": "\"It was a wonderful first half,\" Charlotte coach Mike Dunlap said. \"But unfortunately in the third quarter we gave up 36 points, so we hang our hat on our defense so we know where to start.\""}
{"game_id": "0021200034", "chunk_id": "0021200034_017", "order": 17, "role": "body", "text": "Carlisle wasted no time going to Kaman, calling on him less than two minutes into the game. Carter's entrance about five minutes later had a much bigger impact. After his big dunk, he hit a 3-pointer in the final seconds of the first quarter."}
{"game_id": "0021200034", "chunk_id": "0021200034_018", "order": 18, "role": "body", "text": "\"I think they just move the ball,\" Dunlap said of the Mavericks. \"There are three or four teams that we show film of and the Mavericks is one of them. They call it their flow offense. They do a great job of moving the ball to find the open shooter.\""}
{"game_id": "0021200034", "chunk_id": "0021200034_019", "order": 19, "role": "body", "text": "Walker had 10 points and was held to 10 shots a night after scoring a career-high 30 to lead the Bobcats past Indiana in their opener."}
{"game_id": "0021200034", "chunk_id": "0021200034_020", "order": 20, "role": "body", "text": "\"They played him different, so what he did was he adjusted his game,\" Dunlap said. \"I really like the way he played. He didn't force things.\""}
{"game_id": "0021200034", "chunk_id": "0021200034_021", "order": 21, "role": "closing", "text": "Game notes Mavericks G Rodrigue Beaubois was inactive after twisting his left ankle in practice Friday. ... Marion had two blocks on Haywood in the first quarter. The Mavericks used the amnesty clause to dump Haywood in the offseason. ... Bobcats G Gerald Henderson left in the third quarter with a left foot sprain and didn't return. ... Mavericks TV announcer Mark Followill is out indefinitely after getting injured in a bike accident Saturday in Dallas. He's been with the Mavericks for 12 seasons. ... Dallas is the only NBA team that hasn't lost to Charlotte."}
