{"game_id": "0021701106", "chunk_id": "0021701106_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Jeff Teague didn't mince words."}
{"game_id": "0021701106", "chunk_id": "0021701106_002", "order": 2, "role": "body", "text": "The Minnesota Timberwolves' 101-93 loss to the lowly Memphis Grizzlies on Monday night was devastating."}
{"game_id": "0021701106", "chunk_id": "0021701106_003", "order": 3, "role": "body", "text": "\"This is the worst loss, by far,\" Teague said. \"This was a must-win for us. Every game down the stretch is a must-win. Against a team, take nothing from them, but they're not playing for anything right now. They're playing for heart and pride, and they came out and kicked us.\""}
{"game_id": "0021701106", "chunk_id": "0021701106_004", "order": 4, "role": "body", "text": "Wayne Selden scored 23 points as Memphis snapped its 17-game road losing streak. Marc Gasol added 20 points, 10 rebounds and six assists, helping the Grizzlies deal a blow to Minnesota's playoff hopes."}
{"game_id": "0021701106", "chunk_id": "0021701106_005", "order": 5, "role": "body", "text": "Selden and Gasol each hit four 3-pointers as Memphis went 15 of 31 from beyond the arc. JaMychal Green had 11 points and 10 rebounds."}
{"game_id": "0021701106", "chunk_id": "0021701106_006", "order": 6, "role": "body", "text": "\"I feel like we take a lot of pride, especially after losing a big one, we really buckled down,\" Selden said. \"I think we were losing focus a little bit, I think we really buckled down, and we want to focus on these last games.\""}
{"game_id": "0021701106", "chunk_id": "0021701106_007", "order": 7, "role": "body", "text": "Teague had 25 points and seven assists for the Timberwolves, who lost their second straight game and dropped to 6-7 since All-Star Jimmy Butler was lost to a knee injury. Karl-Anthony Towns had his league-leading 62nd double-double with 15 points and 12 rebounds."}
{"game_id": "0021701106", "chunk_id": "0021701106_008", "order": 8, "role": "body", "text": "Minnesota (42-33) dropped to eighth in the Western Conference standings, a half-game back of idle Utah."}
{"game_id": "0021701106", "chunk_id": "0021701106_009", "order": 9, "role": "body", "text": "\"Hard to explain,\" coach Tom Thibodeau said of the loss."}
{"game_id": "0021701106", "chunk_id": "0021701106_010", "order": 10, "role": "body", "text": "Having dropped 23 of its previous 24 games, Memphis showed early on it wasn't going to roll over for the playoff-hopeful Wolves."}
{"game_id": "0021701106", "chunk_id": "0021701106_011", "order": 11, "role": "body", "text": "The Grizzlies shot 63.6 percent in the second quarter on their way to a 59-all tie at the break."}
{"game_id": "0021701106", "chunk_id": "0021701106_012", "order": 12, "role": "body", "text": "Teague keyed an 8-0 run in the third as the Timberwolves opened an 82-76 lead. But Selden hit three 3s in the fourth as Memphis outscored Minnesota 23-11 in the final period."}
{"game_id": "0021701106", "chunk_id": "0021701106_013", "order": 13, "role": "body", "text": "Andrew Wiggins, who finished with 18 points, was 3 of 6 from the field in the fourth. The rest of the Wolves shot 0 for 11."}
{"game_id": "0021701106", "chunk_id": "0021701106_014", "order": 14, "role": "body", "text": "\"It wasn't just that fourth quarter,\" Minnesota forward Taj Gibson said. \"It was the whole game. They came out. We were playing with fire from the beginning. I felt it.\""}
{"game_id": "0021701106", "chunk_id": "0021701106_016", "order": 16, "role": "body", "text": "Grizzlies: Tyreke Evans missed his second straight game for personal reasons. ... F Chandler Parsons returned after missing the past two games with knee soreness. Parsons had three points and five assists. ... Led by Selden, the Grizzlies got 46 points from their reserves."}
{"game_id": "0021701106", "chunk_id": "0021701106_017", "order": 17, "role": "body", "text": "Timberwolves: Cole Aldrich missed the game with an illness. Derrick Rose missed his third straight game with a sprained right ankle. ... Jamal Crawford scored 10 points but was 3-of-12 shooting. ... The inaugural class of the Minnesota High School Basketball Hall of Fame was honored at halftime. The team includes former NBA players Kevin McHale, Randy Breuer, Khalid El-Amin, Ron Johnson and Mark Olberding, along with WNBA point guard Lindsay Whalen."}
{"game_id": "0021701106", "chunk_id": "0021701106_019", "order": 19, "role": "body", "text": "Memphis' previous road win was Dec. 31 against Sacramento. It was the team's longest road losing streak since dropping 18 in a row from Jan. 4-March 19, 2008. The Grizzlies are 6-30 on the road this season."}
{"game_id": "0021701106", "chunk_id": "0021701106_020", "order": 20, "role": "body", "text": "\"It was well-deserved by our guys,\" Memphis interim coach J.B. Bickerstaff said. \"They continue to compete. They put themselves in position to win games. The other night we had a great first half and had a letdown in the second half, but tonight we were able to carry it out for 48 minutes, so I give those guys a ton of credit for battling, fighting through the ups and downs of the season, not giving in, and competing.\""}
{"game_id": "0021701106", "chunk_id": "0021701106_022", "order": 22, "role": "body", "text": "When Butler was injured against Houston on Feb. 23, Minnesota was in position to have home-court advantage in the playoffs after missing the postseason for 13 straight years."}
{"game_id": "0021701106", "chunk_id": "0021701106_023", "order": 23, "role": "body", "text": "Now, the Wolves have a 1 1/2-game advantage on ninth-place Denver (40-34), which lost at Philadelphia on Monday night."}
{"game_id": "0021701106", "chunk_id": "0021701106_024", "order": 24, "role": "body", "text": "\"That's what Jimmy brings,\" Thibodeau said of the team's toughness without Butler. \"Taj, I thought Taj and Jeff were terrific. They gave us a lot of fight. But, we need everyone. When you're short-handed the way we are, you need toughness. You need toughness. You need skill and you need fight.\""}
{"game_id": "0021701106", "chunk_id": "0021701106_026", "order": 26, "role": "body", "text": "Grizzlies: Host Portland on Wednesday."}
{"game_id": "0021701106", "chunk_id": "0021701106_027", "order": 27, "role": "body", "text": "Timberwolves: Host Atlanta on Wednesday."}
{"game_id": "0021701106", "chunk_id": "0021701106_029", "order": 29, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
