{"game_id": "0021700861", "chunk_id": "0021700861_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Despite a 28-point performance from Paul George and another triple-double by Russell Westbrook, the Oklahoma City Thunder still needed a last-minute push to gain a win."}
{"game_id": "0021700861", "chunk_id": "0021700861_002", "order": 2, "role": "body", "text": "The Thunder almost squandered a 22-point, second-half lead before scoring the final six points to escape with a 121-114 victory over the Memphis Grizzlies on Wednesday night. The win was only Oklahoma City's third in the last nine."}
{"game_id": "0021700861", "chunk_id": "0021700861_003", "order": 3, "role": "body", "text": "\"The first half we were great and generated really good shots,\" Thunder coach Billy Donovan said. \"I thought we came out in the third quarter with the right mindset, but we struggled to put the ball in the basket. That made us a little stagnant, and we were never able to find that rhythm like we had in the first half.\""}
{"game_id": "0021700861", "chunk_id": "0021700861_004", "order": 4, "role": "body", "text": "Westbrook finished with 15 assists and 13 rebounds in his 17th triple-double of the season. Carmelo Anthony added 19 points."}
{"game_id": "0021700861", "chunk_id": "0021700861_005", "order": 5, "role": "body", "text": "Oklahoma City had a 22-point advantage early in the third, but Memphis outscored the Thunder 31-19 in the quarter to cut it to 92-84. The Grizzlies eventually cut it to 115-114 on a step-back 3-pointer from Tyreke Evans that banked in with 47 seconds left."}
{"game_id": "0021700861", "chunk_id": "0021700861_006", "order": 6, "role": "body", "text": "But Anthony answered with a 3-pointer -- the Thunder's 17th of the game -- with 26 seconds remaining to seal the victory. The 17 3-pointers is a record for the team since they came to Oklahoma City. The bulk of those came through the first three quarters as the Thunder built their lead."}
{"game_id": "0021700861", "chunk_id": "0021700861_007", "order": 7, "role": "body", "text": "\"I just thought we got hot,\" said George, who was 6 of 9 from outside the arc. \"We moved the ball and we just made the game easy.\""}
{"game_id": "0021700861", "chunk_id": "0021700861_008", "order": 8, "role": "body", "text": "Andrew Harrison led the Grizzlies with a career-high 28 points, while Evans finished with 23 points and nine rebounds. Jarell Martin had 17 points and eight rebounds as Memphis lost its seventh straight."}
{"game_id": "0021700861", "chunk_id": "0021700861_009", "order": 9, "role": "body", "text": "Interim coach J.B. Bickerstaff praised his team for not quitting when they trailed 73-53 at halftime in the Grizzlies' last game before the All-Star break."}
{"game_id": "0021700861", "chunk_id": "0021700861_010", "order": 10, "role": "body", "text": "\"They could've easily laid down, packed it in and got ready for vacation. But you see time and time again, that's not their makeup,\" Bickerstaff said. \"That's not who they are.\""}
{"game_id": "0021700861", "chunk_id": "0021700861_012", "order": 12, "role": "body", "text": "Thunder: Have won eight of the last nine in the series. ... The 73 first-half points were three short of Oklahoma City's high for a half this season. . Oklahoma City is 12-5 when Westbrook records a triple-double. . George has led the Thunder in scoring in five straight. .The Thunder were 11 of 18 from the field, including 8 of 12 from outside the arc in the second quarter, while outscoring Memphis 39-20 in the frame."}
{"game_id": "0021700861", "chunk_id": "0021700861_013", "order": 13, "role": "body", "text": "Grizzlies: Are 7-7 against teams on the second night of a back-to-back. Oklahoma City lost to Cleveland on Tuesday night. ... F Chandler Parsons returned after an extended absence with right knee soreness. He played 12 minutes, scoring five points. ... At 18-38, Memphis is at its lowest percentage of wins before an All-Star break since the 2008-09 season, when it was 15-37."}
{"game_id": "0021700861", "chunk_id": "0021700861_014", "order": 14, "role": "body", "text": "YOU GET A T, AND YOU GET A T, AND."}
{"game_id": "0021700861", "chunk_id": "0021700861_015", "order": 15, "role": "body", "text": "The Grizzlies were whistled for four technical fouls in the game, including one for Bickerstaff and another for Evans. Harrison actually was disqualified from the game twice, first for drawing his sixth foul with 5 seconds left in the game, then getting a technical as he left -- his second of the game. He was whistled for the first early in the third quarter."}
{"game_id": "0021700861", "chunk_id": "0021700861_017", "order": 17, "role": "body", "text": "Harrison reached a career high in points for the second time in the last three games -- a stretch that started after a nine-point performance with four turnovers against Atlanta on Feb. 6. Bickerstaff noted there was \"a hard conversation\" with Harrison before the guard eclipsed his previous career best with 23 points against Utah. \"Tonight, you saw the confidence and the belief in himself,\" Bickerstaff said. \"You saw the shots he was making down the stretch. He just has to be that guy over and over and over again.\""}
{"game_id": "0021700861", "chunk_id": "0021700861_019", "order": 19, "role": "body", "text": "Thunder: All-Star break. Return Feb. 22 for a road game against Sacramento"}
{"game_id": "0021700861", "chunk_id": "0021700861_020", "order": 20, "role": "body", "text": "Grizzlies: All-Star break. Return Feb. 23 to host the Cleveland Cavaliers."}
{"game_id": "0021700861", "chunk_id": "0021700861_022", "order": 22, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
