{"game_id": "0021401102", "chunk_id": "0021401102_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- Byron Scott still has a lot to learn about Jordan Clarkson.\nThe Lakers coach is already sure of one thing: Clarkson isn't the type to wilt under pressure.\n\"He's not afraid of the moment,\" Scott said. \"You've got to like to that.\""}
{"game_id": "0021401102", "chunk_id": "0021401102_002", "order": 2, "role": "body", "text": "Clarkson scored 26 points and made the tiebreaking basket with 0.7 seconds left in overtime to lift Los Angeles past the Philadelphia 76ers, 113-111 on Monday night in a matchup of two of the NBA's worst teams.\nThe rookie guard helped the Lakers pull out a game both teams had incentive to lose. The Sixers currently hold the league's third-worst record and the Lakers the fourth-worst mark. Philadelphia will get the Lakers' first-round pick through a previous trade if it falls out of the top five.\nBut Scott brushed aside any talk of lottery balls and what Monday's win could mean for the draft.\n\"I don't care about that stuff,\" he said. \"It's all about trying to get better as a basketball team and trying to win games.\"\nJabari Brown finished with a career-high 22 points for the Lakers (20-53). Wayne Ellington added seven of his 20 points in OT, including a 3-pointer that put the Lakers up 111-105 with 1:25 left.\nEllington, a Philly native, also fed Clarkson for the go-ahead layup, drawing a double team and finding him wide open under the basket right before time expired.\n\"I was trying to get myself in a good position to rebound the ball and Wayne got space to shoot it,\" Clarkson said. \"I guess he just saw me under the basket cutting. And I just made the play.\""}
{"game_id": "0021401102", "chunk_id": "0021401102_003", "order": 3, "role": "closing", "text": "Rookie Nerlens Noel led the 76ers (18-57) with 19 points and 14 rebounds for his ninth double-double of the month and his fourth in the past five games. He scored six points in the final minute of overtime to tie the game at 111.\n\"He wants the ball,\" Sixers coach Brett Brown said. \"I'm at a stage personally where I have confidence that he's going to step up and not be intimidated by the moment.\"\nPhiladelphia point guard Isaiah Canaan scored 18 points, including 10 in the fourth quarter. Ish Smith added 17, hitting a go-ahead layup with 31 seconds left in regulation that put Philly up 100-98.\nBut Clarkson tied the game three times in the final minute of regulation: at 98 with a running layup with 49 seconds remaining, at 100 with two free throws with 22 seconds left and at 102 with two more free throws with 11.1 seconds to play.\n\"If I fail, I know I'm going to come back up the next day,\" said Clarkson, who added 11 assists. \"I didn't have a good game against these guys at home, so I wanted to come out here and play hard. It just turned out to be one of those games.\"\nSmith missed a running layup at the buzzer, sending the game into overtime.\nBoth teams were playing short-handed. The Sixers were missing Jerami Grant (upper respiratory infection), Luc Mbah a Moute (left shoulder soreness) and Jason Richardson (left knee swelling), while Jeremy Lin sat out his second straight game for the Lakers because he wasn't feeling well.\nLin was averaging 21.2 points in his last four games before getting sick, including a 29-point outing in the Lakers' 101-87 win over the Sixers on March 22.\n---\nTIP-INS\nLakers: The Lakers have won in their last three trips to Philadelphia. ... Carlos Boozer was active but did not play for the fifth straight game. He had been dealing with an upper respiratory infection.\n76ers: The Sixers have lost five of their last six. ... Joel Embiid was dressed during warmups but didn't play. The third overall pick in the 2014 draft has yet to make his NBA debut because of a stress fracture in his right foot.\nWHAT CAN BROWN DO FOR YOU?\nBrown, an undrafted rookie on his second 10-day contract with the Lakers, is trying to stick in the NBA. Games like this will certainly help. The guard out of Missouri shot 7 for 10 from the field, 3 for 4 from 3-point range and 5 for 5 from the foul line. \"He's got a good feel for the game,\" Scott said. \"Each game, it just seems like he's gotten better for us. It's good to see a young man with an opportunity taking full advantage of it.\"\nUP NEXT\nLakers: Host New Orleans on Wednesday\n76ers: At Washington on Wednesday"}
