{"game_id": "0021100368", "chunk_id": "0021100368_001", "order": 1, "role": "lead", "text": "BOSTON -- Paul Pierce knew what was on the line with every shot."}
{"game_id": "0021100368", "chunk_id": "0021100368_002", "order": 2, "role": "body", "text": "The pressure was quite clear to Pierce and anyone else in the arena as he stood on the verge of passing Larry Bird for No. 2 on Boston's career scoring list. He needed only 10 points to overtake Bird when the Celtics hosted Charlotte on Tuesday night and those final three seemed as if they would never come."}
{"game_id": "0021100368", "chunk_id": "0021100368_003", "order": 3, "role": "body", "text": "They did early in the third quarter, then Pierce and the Celtics celebrated the milestone by increasing their season-best winning streak to five with a 94-84 win over the Bobcats."}
{"game_id": "0021100368", "chunk_id": "0021100368_004", "order": 4, "role": "body", "text": "\"It was a relief. So much was hanging over me the last couple of days. Just hearing about it and knowing that you've got a game to play,\" said Pierce, who finished with 15 points. \"Just to be mentioned with him, with this organization, is a great honor.\""}
{"game_id": "0021100368", "chunk_id": "0021100368_005", "order": 5, "role": "body", "text": "Pierce now stands alone at No. 2 -- and it is quite a list -- with 21,797 points, six more than Bird's total of 21,791. Only John Havlicek has scored more in team history with 26,395 points."}
{"game_id": "0021100368", "chunk_id": "0021100368_006", "order": 6, "role": "body", "text": "Pierce didn't even try to calculate the gap or how long it could take him to reach Havlicek."}
{"game_id": "0021100368", "chunk_id": "0021100368_007", "order": 7, "role": "body", "text": "\"I think the fans would really appreciate another championship more than me passing Hondo,\" Pierce said."}
{"game_id": "0021100368", "chunk_id": "0021100368_008", "order": 8, "role": "body", "text": "Pierce nearly celebrated with a triple-double, coming up just short with nine assists and eight rebounds."}
{"game_id": "0021100368", "chunk_id": "0021100368_009", "order": 9, "role": "body", "text": "Rajon Rondo added 14 assists and 10 points, Kevin Garnett scored 22 and Ray Allen finished with 17 points on a night that clearly belonged to the team captain known as \"The Truth\" -- which Mickael Pietrus had written in big letters on a towel he waved for Pierce."}
{"game_id": "0021100368", "chunk_id": "0021100368_010", "order": 10, "role": "body", "text": "\"I thought they tried so hard in the first half. I thought it was never going to happen,\" Boston coach Doc Rivers said. \"I mean, it was unbelievable how our guys were passing out shots. They were doing everything to try to get this thing.\""}
{"game_id": "0021100368", "chunk_id": "0021100368_011", "order": 11, "role": "body", "text": "Derrick Brown went 10 for 10 from the field for 20 points for Charlotte, but the biggest shooter Tuesday was Pierce on what normally would have been an off shooting night for him."}
{"game_id": "0021100368", "chunk_id": "0021100368_012", "order": 12, "role": "body", "text": "He had seven points at halftime, then got his big moment out of the way with 10:23 left in the third on a 3-pointer from the top of the key."}
{"game_id": "0021100368", "chunk_id": "0021100368_013", "order": 13, "role": "body", "text": "\"I'm not going to lie. It was hanging over my head too much,\" Pierce said. \"You kind of just felt it. It was hard to really ignore it and just focus on the game.\""}
{"game_id": "0021100368", "chunk_id": "0021100368_014", "order": 14, "role": "body", "text": "Reggie Williams scored 21 for the Bobcats, who lost their 12th straight despite staying within 11 points through the first three quarters. Kemba Walker had 16 points and seven assists for the Bobcats, who kept it close before Boston opened the fourth quarter with a 13-2 run."}
{"game_id": "0021100368", "chunk_id": "0021100368_015", "order": 15, "role": "body", "text": "\"When you have to play your main guys for as long as we do, it gets kind of tough,\" Charlotte coach Paul Silas said. \"We've just got to keep battling.\""}
{"game_id": "0021100368", "chunk_id": "0021100368_016", "order": 16, "role": "body", "text": "The outcome never seemed in doubt and fans focused on Pierce making history for a franchise loaded with it. There was no announcement -- or need for one -- as everyone seemed to know what Pierce's shot from the top of the key meant in addition to giving the Celtics a 48-40 lead early in the third quarter."}
{"game_id": "0021100368", "chunk_id": "0021100368_017", "order": 17, "role": "body", "text": "Pierce knew he had it, raising his arms as Boston fans gave him a standing ovation. The applause lasted for several minutes as teammate Garnett waved the crowd on for more."}
{"game_id": "0021100368", "chunk_id": "0021100368_018", "order": 18, "role": "body", "text": "The official announcement finally came during a time out with 5:14 left in the third and Pierce went to midcourt, blew a few kisses and bowed during another round of applause. There was one more when Pierce -- a Celtic his entire NBA career -- went to the bench with 3:57 left in the period."}
{"game_id": "0021100368", "chunk_id": "0021100368_019", "order": 19, "role": "body", "text": "\"Paul had a chance to leave us when we were bad and instead of moaning that he wanted to go to a championship team, he stayed,\" Rivers said. \"And he said, `I simply want to be a Celtic and I trust that we're going to win a title someday.\""}
{"game_id": "0021100368", "chunk_id": "0021100368_020", "order": 20, "role": "body", "text": "Brandon Bass scored 13 and Garnett added seven rebounds for the Celtics."}
{"game_id": "0021100368", "chunk_id": "0021100368_021", "order": 21, "role": "body", "text": "Boston led 45-38 at halftime and after an even third quarter, the Celtics pulled away in the fourth, leading by as much as 18 against the weary Bobcats."}
{"game_id": "0021100368", "chunk_id": "0021100368_022", "order": 22, "role": "body", "text": "With Kobe Bryant and the Los Angeles Lakers coming to town Thursday, the Celtics were especially relieved to have Pierce's accomplishment out of the way."}
{"game_id": "0021100368", "chunk_id": "0021100368_023", "order": 23, "role": "body", "text": "\"You've got to play some amazing basketball,\" Rivers said. \"Passing Larry Bird -- that's impressive.\""}
{"game_id": "0021100368", "chunk_id": "0021100368_024", "order": 24, "role": "closing", "text": "Game notes Boston's five-game winning streak is its longest of the season. ... Rondo played his third straight game after missing eight with a sore right wrist. ... Charlotte last won on Jan. 14, beating Golden State 112-100. ... Charlotte (3-22) has the worst record in the NBA and fell to 1-14 on the road."}
