{"game_id": "0021400372", "chunk_id": "0021400372_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Chandler Parsons hasn't adjusted to the Dallas Mavericks as quickly as he would have liked."}
{"game_id": "0021400372", "chunk_id": "0021400372_002", "order": 2, "role": "body", "text": "Wednesday, though, he took a step in the right direction."}
{"game_id": "0021400372", "chunk_id": "0021400372_003", "order": 3, "role": "body", "text": "Parsons, who signed with Dallas this summer, scored a season-high 32 points as the Mavericks beat the Detroit Pistons 117-106."}
{"game_id": "0021400372", "chunk_id": "0021400372_004", "order": 4, "role": "body", "text": "\"The more I play with these guys, the more comfortable I feel,\" he said. \"I'm just finding my rhythm right now, and we're starting to roll.\""}
{"game_id": "0021400372", "chunk_id": "0021400372_005", "order": 5, "role": "body", "text": "Parsons fell two points short of his career high as he helped the Mavericks win a second road game in two nights. Monta Ellis added 25 points and Dirk Nowitzki contributed 18 points and 10 rebounds, including seven points to help stem a late Detroit rally."}
{"game_id": "0021400372", "chunk_id": "0021400372_006", "order": 6, "role": "body", "text": "\"We were struggling a little in the third quarter, but Parsons hit a lot of big shots and Monta took over the game with some 1-on-1 stuff,\" Mavericks coach Rick Carlisle said. \"We needed every point and we needed every rebound.\""}
{"game_id": "0021400372", "chunk_id": "0021400372_007", "order": 7, "role": "body", "text": "Andre Drummond had 19 points and 24 rebounds, but couldn't help the Pistons end an 11-game losing streak at home."}
{"game_id": "0021400372", "chunk_id": "0021400372_008", "order": 8, "role": "body", "text": "\"That was probably Andre's best game of the season, and it is definitely the hardest he has played all year,\" Pistons coach Stan Van Gundy said. \"He was getting up and down the floor and he was active on defense.\""}
{"game_id": "0021400372", "chunk_id": "0021400372_009", "order": 9, "role": "body", "text": "Detroit's last win at the Palace came on Nov. 7 against Milwaukee."}
{"game_id": "0021400372", "chunk_id": "0021400372_010", "order": 10, "role": "body", "text": "\"This is definitely embarrassing,\" said Kyle Singler, who struggled badly against Parsons. \"We've got to learn from this and find a way to win at home. You can't lose every game in your own building like this.\""}
{"game_id": "0021400372", "chunk_id": "0021400372_011", "order": 11, "role": "body", "text": "Drummond dominated the first half with 11 points and 13 rebounds, although he missed five of his six free-throw attempts. His teammates only shot 40.5 percent from the floor, but that was enough to keep Detroit within 53-51 at the half."}
{"game_id": "0021400372", "chunk_id": "0021400372_012", "order": 12, "role": "body", "text": "\"I was amazed,\" Carlisle said. \"He jumps and he just hangs in the air until he gets his hand on the ball. I've never seen a guy get his hands on so many lobs, shots -- everything.\""}
{"game_id": "0021400372", "chunk_id": "0021400372_013", "order": 13, "role": "body", "text": "The Mavericks scored 32 points in the first quarter, but couldn't keep it going in the second quarter, hitting only five shots. Ellis had 14 in the half, but Dallas only led because it was able to keep everyone other than Drummond off the boards."}
{"game_id": "0021400372", "chunk_id": "0021400372_014", "order": 14, "role": "body", "text": "Dallas was finally able to create some room late in the third quarter, as Parsons keyed a 14-2 run that made it 83-70. With Josh Smith and Singler both on the bench with foul trouble, Parsons was able to take advantage with 15 points in the quarter."}
{"game_id": "0021400372", "chunk_id": "0021400372_015", "order": 15, "role": "body", "text": "\"I knew this was going to happen -- it was just a matter of time,\" Parsons said. \"I'm getting used to playing with these guys and they are starting to understand where I like the ball.\""}
{"game_id": "0021400372", "chunk_id": "0021400372_016", "order": 16, "role": "body", "text": "The Mavericks were still up by 10 at period's end, and boosted the lead to 17 early in the fourth. The Pistons got as close as 105-100 with 2:35 to play, but Parsons and Nowitzki answered with back-to-back 3-pointers to put away the game."}
{"game_id": "0021400372", "chunk_id": "0021400372_017", "order": 17, "role": "body", "text": "\"We played pretty good defense at Phoenix and at Sacramento, and we won both of those games,\" Van Gundy said. \"But that's the best offense in the league, at least according to the numbers, and we needed to pick it up another level. We didn't do that.\""}
{"game_id": "0021400372", "chunk_id": "0021400372_019", "order": 19, "role": "body", "text": "Mavericks: Dallas is 5-1 on the second half of a back-to-back. ... The Mavericks have won six straight against Detroit and 13 of the last 15."}
{"game_id": "0021400372", "chunk_id": "0021400372_020", "order": 20, "role": "body", "text": "Pistons: Fans in the sparse crowd at the Palace got an unwelcome reminder of how the franchise got to this spot, as Mavericks reserve Charlie Villanueva spent much of the halftime break chatting with Smith and Brandon Jennings. Along with Ben Gordon, they make up the four free-agent signings that doomed Joe Dumars' tenure as team president."}
{"game_id": "0021400372", "chunk_id": "0021400372_022", "order": 22, "role": "body", "text": "Mavericks: Host San Antonio on Saturday."}
{"game_id": "0021400372", "chunk_id": "0021400372_023", "order": 23, "role": "closing", "text": "Pistons: Host Toronto on Friday."}
