{"game_id": "0021400934", "chunk_id": "0021400934_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Michael Kidd-Gilchrist hardly had the kind of game Sunday night that jumps out in the boxscore."}
{"game_id": "0021400934", "chunk_id": "0021400934_002", "order": 2, "role": "body", "text": "In a high-scoring game, he put up 10 points and six rebounds without an assist. But he might have been the biggest reason the Charlotte Hornets picked up a key 108-101 win over the Detroit Pistons."}
{"game_id": "0021400934", "chunk_id": "0021400934_003", "order": 3, "role": "body", "text": "Charlotte trailed 62-54 at halftime, thanks in large part to Mo Williams' inability to stop Reggie Jackson from getting to the rim. Jackson scored 21 points in the half and was able to drive at will against Charlotte's point guards."}
{"game_id": "0021400934", "chunk_id": "0021400934_004", "order": 4, "role": "body", "text": "At halftime, though, coach Steve Clifford put Kidd-Gilchrist on Jackson, and the game turned. Jackson scored only four points in the second half on 2-of-9 shooting."}
{"game_id": "0021400934", "chunk_id": "0021400934_005", "order": 5, "role": "body", "text": "\"We couldn't keep them out of the paint all night, but Mike did a great job against Reggie in the second half,\" Clifford said. \"That was huge because we had energy on the defensive end, but other than Mike, we didn't have much detail.\""}
{"game_id": "0021400934", "chunk_id": "0021400934_006", "order": 6, "role": "body", "text": "Kentavious Caldwell-Pope and Jodie Meeks couldn't take advantage of the matchup with Williams, combining for 12 second-half points on 3-of-15 shooting."}
{"game_id": "0021400934", "chunk_id": "0021400934_007", "order": 7, "role": "body", "text": "\"You can't blame our threes, because we don't give them a lot of shots,\" Pistons coach Stan Van Gundy said. \"But we needed our twos to step up. Jodie has been playing well but had a bad night and Pope is really struggling.\""}
{"game_id": "0021400934", "chunk_id": "0021400934_008", "order": 8, "role": "body", "text": "The Hornets have won five straight to strengthen their bid for a postseason berth, while Detroit has dropped six in a row."}
{"game_id": "0021400934", "chunk_id": "0021400934_009", "order": 9, "role": "body", "text": "\"This is a big win for us,\" Gerald Henderson said. \"That's a tough team that we struggled with the last time we met them, and we really picked it up in the second half and got better.\""}
{"game_id": "0021400934", "chunk_id": "0021400934_010", "order": 10, "role": "body", "text": "Williams had 19 points and nine assists for the Hornets, and Henderson added 13 points, nine assists and six rebounds. All five Charlotte starters scored in double figures for the fifth time in six games."}
{"game_id": "0021400934", "chunk_id": "0021400934_011", "order": 11, "role": "body", "text": "Greg Monroe added 18 points and 11 rebounds but Detroit continued to struggle from outside, going 3 of 14 on 3-pointers."}
{"game_id": "0021400934", "chunk_id": "0021400934_012", "order": 12, "role": "body", "text": "\"What this team does is that if we miss shots, we get in a situation where we become stagnant,\" Tayshaun Prince said. \"That was the case in the third quarter and that's been the case in this losing streak. The quicker we can get out of those spells, the better it will be.\""}
{"game_id": "0021400934", "chunk_id": "0021400934_013", "order": 13, "role": "body", "text": "In a twist from the 1970s, the game was played with only two officials. J.T. Orr fell ill before the game, leaving Ronnie Garretson and Pat Fraher to call the action. The NBA switched to three-man crews in 1978."}
{"game_id": "0021400934", "chunk_id": "0021400934_014", "order": 14, "role": "body", "text": "Along with Jackson's shooting spree, Detroit also outscored Charlotte 32-24 in the paint in the first half despite both Andre Drummond and Anthony Tolliver being limited by foul trouble."}
{"game_id": "0021400934", "chunk_id": "0021400934_015", "order": 15, "role": "body", "text": "Jefferson had 10 points as Charlotte pulled to 72-71 midway through the third, eight of them on mid-range jumpers. The Hornets led by as many as four, but Detroit rallied when Jefferson went to the bench and led 84-78 at the end of the quarter."}
{"game_id": "0021400934", "chunk_id": "0021400934_016", "order": 16, "role": "body", "text": "\"They turned up the intensity in the second half, and we never did,\" Van Gundy said. \"We might have played 4 good minutes at the end of the third quarter, but that's 4 out of 48.\""}
{"game_id": "0021400934", "chunk_id": "0021400934_017", "order": 17, "role": "body", "text": "The Hornets, though, started the fourth with a 20-6 run to take a 98-90 lead with 5 minutes to play. Lance Stephenson, who hadn't scored in the first three quarters, had nine points during the surge."}
{"game_id": "0021400934", "chunk_id": "0021400934_018", "order": 18, "role": "body", "text": "\"The fourth quarter was really the only time all night that we kept them out of the paint,\" Clifford said. \"They are third in the league in points in the paint and first in offensive rebounding, so they are a handful. But we did a nice job in the fourth.\""}
{"game_id": "0021400934", "chunk_id": "0021400934_021", "order": 21, "role": "body", "text": "Hornets: Williams has reached double figures in each of his nine games since joining the Hornets at the trade deadline. In those nine games, he is averaging 21.7 points and 8.7 assists. ... Jason Maxiell, who played for Detroit from 2005-13, drew a loud round of applause when he checked into the game in the second half."}
{"game_id": "0021400934", "chunk_id": "0021400934_022", "order": 22, "role": "body", "text": "Pistons: Joel Anthony (groin) missed his second straight game, so Shawne Williams was pressed into early service when Drummond and Tolliver each picked up two fouls in the first 6 minutes."}
{"game_id": "0021400934", "chunk_id": "0021400934_024", "order": 24, "role": "body", "text": "Hornets: Host the Washington Wizards on Monday."}
{"game_id": "0021400934", "chunk_id": "0021400934_025", "order": 25, "role": "closing", "text": "Pistons: At the Los Angeles Lakers on Tuesday."}
