{"game_id": "0021700404", "chunk_id": "0021700404_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Paul George struggled on homecoming night."}
{"game_id": "0021700404", "chunk_id": "0021700404_002", "order": 2, "role": "body", "text": "He still left town with the crown."}
{"game_id": "0021700404", "chunk_id": "0021700404_003", "order": 3, "role": "body", "text": "On a night the four-time All-Star was repeatedly booed and couldn't seem to make a shot, he finally sunk two free throws with 10.7 seconds left Wednesday to seal Oklahoma City's 100-95 victory at Indiana."}
{"game_id": "0021700404", "chunk_id": "0021700404_004", "order": 4, "role": "body", "text": "\"Yeah, I'm happy this circus is over with. Everybody can move on,\" George said. \"I understood what the environment was going to be, so it wasn't a surprise.\""}
{"game_id": "0021700404", "chunk_id": "0021700404_005", "order": 5, "role": "body", "text": "Everything from finding the visiting locker room to dealing with the fans was different, and it seemed to take a toll."}
{"game_id": "0021700404", "chunk_id": "0021700404_006", "order": 6, "role": "body", "text": "George went 3 of 14 from the field, 2 of 7 on 3-pointers, had two rebounds and four turnovers. But spurned fans who are still upset George's camp went public with his free agent intentions last summer made sure the box score was the most pleasant part of George's night."}
{"game_id": "0021700404", "chunk_id": "0021700404_007", "order": 7, "role": "body", "text": "When first he walked onto the court for warmups, one fan shouted \"traitor!\" During player introductions, the boos reached a crescendo and every time he touched the ball, the boo-birds returned with full force. The only cheers came when George made a mistake or drew a foul."}
{"game_id": "0021700404", "chunk_id": "0021700404_008", "order": 8, "role": "body", "text": "Fortunately, George's friends helped him out."}
{"game_id": "0021700404", "chunk_id": "0021700404_009", "order": 9, "role": "body", "text": "Steven Adams finished with 23 points and 13 rebounds while reigning MVP Russell Westbrook recorded his ninth triple-double of the season -- 10 points, 17 rebounds and 12 assists."}
{"game_id": "0021700404", "chunk_id": "0021700404_010", "order": 10, "role": "body", "text": "And when George came up with the final steal of the game, he pumped his arms and his teammates savored the moment as much as he did."}
{"game_id": "0021700404", "chunk_id": "0021700404_011", "order": 11, "role": "body", "text": "\"I thought he had incredible poise tonight,\" Thunder coach Billy Donovan said. \"Everybody was asking how is he and I hadn't really noticed anything different. I thought his defense -- certainly on the side out of bounds play -- was really critical for us.\""}
{"game_id": "0021700404", "chunk_id": "0021700404_012", "order": 12, "role": "body", "text": "The trade for Victor Oladipo and Domantas Sabonis was widely panned as below market value, but has turned out pretty well so far for the Pacers."}
{"game_id": "0021700404", "chunk_id": "0021700404_013", "order": 13, "role": "body", "text": "Oladipo led Indiana with 19 points and nearly brought them all the way back from an 11-point deficit with 5:16 left. The Pacers got to 96-94 with 1:07 to go and had a chance to tie it when they got the ball with 15.2 seconds left and down 98-95."}
{"game_id": "0021700404", "chunk_id": "0021700404_014", "order": 14, "role": "body", "text": "Instead, George came up with the steal and made the free throws to seal the win, silence the crowd, end the Pacers' four-game winning streak and leave town as the king of the night."}
{"game_id": "0021700404", "chunk_id": "0021700404_015", "order": 15, "role": "body", "text": "\"That team showed us that when you're playing against these elite teams, it's going to be a physical game and we didn't match that tonight,\" Pacers coach Nate McMillan said."}
{"game_id": "0021700404", "chunk_id": "0021700404_017", "order": 17, "role": "body", "text": "Thunder: Westbrook was 3 of 17 from the field, 1 of 3 on 3-pointers and 3 of 7 at the free-throw line. ... Oklahoma City is 4-10 on the road. ... Oklahoma City got its first series split with the Pacers since 2012-13. ... Oklahoma City had 17 offensive rebounds and was 13 of 29 on 3-pointers."}
{"game_id": "0021700404", "chunk_id": "0021700404_018", "order": 18, "role": "body", "text": "Pacers: Bojan Bogdanovic had 15 points while Thaddeus Young had 11 points, 10 rebounds and seven steals. ... Sabonis wound up with eight points and six rebounds. ... Indiana made 11 3s but fell to 14-3 when making 10 or more 3-pointers in a game this season. ... Myles Turner had three blocks, his 12th game this season with three or more. ... Former Colts coach Tony Dungy attended the game. He's in town for Thursday night's NFL game between the Colts and Broncos."}
{"game_id": "0021700404", "chunk_id": "0021700404_020", "order": 20, "role": "body", "text": "The Pacers got a win before they even took the floor."}
{"game_id": "0021700404", "chunk_id": "0021700404_021", "order": 21, "role": "body", "text": "A little less than three hours before tip, NBA Commissioner Adam Silver announced Indiana would host the 2021 All-Star Game. It will be the first time the Pacers have hosted the marquee event since 1985."}
{"game_id": "0021700404", "chunk_id": "0021700404_022", "order": 22, "role": "body", "text": "The move comes seven months after Larry Bird hand-delivered the formal proposal at the league's New York headquarters in an IndyCar."}
{"game_id": "0021700404", "chunk_id": "0021700404_024", "order": 24, "role": "body", "text": "Thunder: \"Let's put all this to rest,\" George said. \"I had an amazing seven years here. I was blessed to play in front of a great Indiana fan base -- which, as you saw, showed up and showed out tonight. I'm grateful to have played in this organization, but ultimately I didn't achieve what I wanted to do here, so I moved on. Both sides moved on. So, let's all move on.\""}
{"game_id": "0021700404", "chunk_id": "0021700404_025", "order": 25, "role": "body", "text": "Pacers: \"It was the first time I've had a defender guard me like that since I've been on this team,\" Oladipo said after going 9 of 26 from the field. \"They were just trying to deny me and he (George) can move his feet.\""}
{"game_id": "0021700404", "chunk_id": "0021700404_027", "order": 27, "role": "body", "text": "Thunder: Faces Philadelphia on Friday, trying to improve to 17-1 in the series since moving to Oklahoma City."}
{"game_id": "0021700404", "chunk_id": "0021700404_028", "order": 28, "role": "body", "text": "Pacers: Host Detroit on Friday, seeking a seventh straight home win in the series."}
{"game_id": "0021700404", "chunk_id": "0021700404_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
