{"game_id": "0021300638", "chunk_id": "0021300638_001", "order": 1, "role": "lead", "text": "CLEVELAND -- The Cleveland Cavaliers needed a breather. They got one Friday night.\nAnderson Varejao scored 16 points and Kyrie Irving had 10 points and 10 assists, leading the Cavaliers to a 93-78 win over the Milwaukee Bucks.\nA visit from the worst team in basketball helped Cleveland's cause. The Cavaliers used a 17-0 run in the second quarter and a 12-2 spurt in the third to win going away.\n\"I'd take this every game,\" Cleveland coach Mike Brown said. \"We obviously haven't had many of those.\"\nVarejao scored eight points to spark a 12-2 run that gave Cleveland a 64-46 lead late in the third quarter. Irving, selected an All-Star starter for the first time Thursday, had seven assists in the second half.\nKhris Middleton led Milwaukee with 13 points. Brandon Knight, who leads the Bucks with a 15.9 average, was held to eight points and went 4 of 12 from the field.\nThe Bucks (8-34) have lost 10 of 11. Milwaukee snapped a nine-game losing streak Wednesday against Detroit, but couldn't build on the momentum from that win, a fact that disappointed coach Larry Drew.\n\"We didn't play with a sense of urgency and, clearly, that's my responsibility,\" he said. \"It is disappointing -- take nothing away from this Cleveland Cavalier team -- but I was expecting our guys to have a little bit more firepower. They were clearly the aggressor from start to finish.\"\nThe game capped a couple of good days for Irving, who had no turnovers in 28 minutes. The third-year guard has also been chosen for the USA Basketball player pool. Irving plans on defending his 3-point title during All-Star weekend and said he would like to become the first player to win the contest three years in a row.\n\"We started off a little sluggish, but we definitely picked it up,\" he said. \"We forced them into some tough shots and got on our run.\"\nIrving is looking forward to next month's All-Star festivities and the basketball world championships in the summer.\n\"I'm just really happy,\" he said. \"I wouldn't be able to be a star without the fans and also my teammates just encourage me every single game. It's a great honor to be part of USA roster and All-Star.\"\nTristan Thompson scored 14 points and had 10 rebounds while Dion Waiters added 13 points for Cleveland. The Cavaliers lost the first two games of a five-game homestand after going 3-2 on a West Coast trip.\n\"It was a good performance, especially after the two losses,\" Brown said. \"Our guys stepped up. We had a lot of good individual performances that turned into a good team performance.\"\nCleveland was leading 54-44 when Varejao hit three jumpers and a running hook shot that helped push the lead to 18 points. Irving scored on a reverse layup and Thompson added a three-point play.\nThe Cavaliers used a 17-0 run in the first quarter to take a 23-11 lead. Irving scored five points while Luol Deng and Thompson added four apiece. The Bucks went 5:21 without scoring, a stretch that was finally broken on Middleton's 3-pointer at the 2:56 mark. Milwaukee ended the quarter on a 12-1 run and trailed 24-23.\nWaiters scored all 10 of his first-half points in the second quarter and Cleveland led 46-37 at halftime.\nThe Bucks haven't won two in a row since March 17-19 of last season.\n\"It's happened all year,\" said forward Ersan Ilyasova. \"We always give up separation (on the scoreboard) and can't come back. We always find a way to give up the game.\"\nThe Cavaliers are 5-4 since acquiring Deng, who scored nine points, from Chicago on Jan. 7.\nGiannis Antetokounmpo scored 10 points for the Bucks. Ekpe Udoh, Milwaukee's starting center, left the game late in the second quarter with a sprained left ankle and didn't return. Larry Sanders took his place in the third quarter.\nCavaliers forward Anthony Bennett, the No. 1 pick in the draft, played the final 5:14 after seeing no action in the previous five games. He hit two free throws with 26 seconds to play and had three rebounds.\nGame notes\nBrown said \"we haven't discussed in depth\" sending Bennett to the NBA Development League. Brown thinks it will benefit Bennett more to remain with the team than it would to be sent down. \"He's not just our top pick, he's the No. 1 pick in the draft, so he's going to get plenty of opportunity, but as you guys can see I'm not going to give him a free pass,\" Brown said. ... Sanders (head cold) and G O.J. Mayo (virus) returned after not playing against Detroit. ... Milwaukee G Luke Ridnour picked up two fouls in 14 seconds in the first quarter. ... Cavaliers C Tyler Zeller had eight points, nine rebounds and three blocked shots in 22 minutes."}
