{"game_id": "0021700897", "chunk_id": "0021700897_001", "order": 1, "role": "lead", "text": "ATLANTA --  Good ball movement meant impressive scoring balance for Brandon Ingram and the Lakers."}
{"game_id": "0021700897", "chunk_id": "0021700897_002", "order": 2, "role": "body", "text": "Ingram had 21 points and 10 rebounds, leading nine Los Angeles scorers in double figures, and the Lakers beat the Atlanta Hawks 123-104 on Monday night for their third straight win."}
{"game_id": "0021700897", "chunk_id": "0021700897_003", "order": 3, "role": "body", "text": "\"We played the right way today,\" Ingram said. \"We always talk about finding the best shot for our team and just trying to move it the right way.\""}
{"game_id": "0021700897", "chunk_id": "0021700897_004", "order": 4, "role": "body", "text": "Julius Randle added 19 points and 10 rebounds as the Lakers overcame 23 turnovers to keep their lead in double figures throughout the second half."}
{"game_id": "0021700897", "chunk_id": "0021700897_005", "order": 5, "role": "body", "text": "Lonzo Ball had 13 points, seven rebounds and five of the Lakers' 28 assists."}
{"game_id": "0021700897", "chunk_id": "0021700897_006", "order": 6, "role": "body", "text": "\"We're just moving the ball, playing together,\" Ball said. \"It's that simple.\""}
{"game_id": "0021700897", "chunk_id": "0021700897_007", "order": 7, "role": "body", "text": "The Lakers (26-34) matched their win total from last season, when they finished 26-56, though they are only 11th in the Western Conference."}
{"game_id": "0021700897", "chunk_id": "0021700897_008", "order": 8, "role": "body", "text": "Kentavious Caldwell-Pope, who scored a season-high 34 points in a 113-108 win over the Kings on Saturday night, had 14 rebounds but was held to only 10 points while making only 4 of 12 shots -- including a 3-pointer in the final minute."}
{"game_id": "0021700897", "chunk_id": "0021700897_009", "order": 9, "role": "body", "text": "Taurean Prince had 24 points in Atlanta's fourth straight loss. Dennis Schroder added 20 points."}
{"game_id": "0021700897", "chunk_id": "0021700897_010", "order": 10, "role": "body", "text": "Before the game, the Hawks announced they requested waivers on veteran forward Ersan Ilyasova. It was another step to clear playing time for younger players, including rookie John Collins, who started. Atlanta released veteran guard Marco Belinelli in a similar move on Feb. 9."}
{"game_id": "0021700897", "chunk_id": "0021700897_011", "order": 11, "role": "body", "text": "The Hawks began the night one-half game behind Phoenix in the race for the NBA's worst record and appear to be bound for one of the top picks in the draft."}
{"game_id": "0021700897", "chunk_id": "0021700897_012", "order": 12, "role": "body", "text": "\"It's tough when you're wanting to have team success and everything, but I think we're growing, really, even though tonight didn't feel like it,\" Hawks coach Mike Budenholzer said."}
{"game_id": "0021700897", "chunk_id": "0021700897_013", "order": 13, "role": "body", "text": "The Hawks can hope for an immediate impact similar to what's been provided by Ball and Kyle Kuzma, two of five rookies on the Lakers' roster. Kuzma had 10 points, all in the first half."}
{"game_id": "0021700897", "chunk_id": "0021700897_015", "order": 15, "role": "body", "text": "Lakers: Ball logged 24 minutes off the bench as he continues to play under a minutes cap in his return from a left knee injury that caused him to miss 15 games. Ball was held out of Saturday's win over the Kings after playing 17 minutes on Friday night against Dallas. ... The Lakers scored the first seven points of each half. ... Josh Hart scored 14 points. Isaiah Thomas had 13. Brook Lopez had 11 and Ivica Zubac had 10. ... Los Angeles claimed a 59-41 advantage in rebounds."}
{"game_id": "0021700897", "chunk_id": "0021700897_016", "order": 16, "role": "body", "text": "Hawks: F DeAndre Bembry (abdominal strain) and G Malcolm Delaney (right knee strain) were held out. Budenholzer said Delaney is \"close\" to playing. ... F Miles Plumlee, in his sixth year, is the team's most experienced player following the release of Ilyasova. ... Isaiah Taylor had 16 points off the bench."}
{"game_id": "0021700897", "chunk_id": "0021700897_018", "order": 18, "role": "body", "text": "The Lakers overcame 14 first-half turnovers by making 10 of 18 3s to lead 64-46 at the break. For the game, they made 15 of 33 3s. Lopez, Hart, Kuzma and Ball each made three 3s."}
{"game_id": "0021700897", "chunk_id": "0021700897_020", "order": 20, "role": "body", "text": "The Lakers finished three turnovers away from their season high of 26 against the Kings on Jan. 9. They also committed 23 fouls, helping Atlanta claim a 34-19 advantage in free-throw attempts."}
{"game_id": "0021700897", "chunk_id": "0021700897_021", "order": 21, "role": "body", "text": "\"A good win but we've got to be a lot better,\" coach Luke Walton said. \"It was just more sloppy than I'd like.\""}
{"game_id": "0021700897", "chunk_id": "0021700897_023", "order": 23, "role": "body", "text": "The Hawks struggled to defend Ingram, especially during a third-quarter stretch when he scored six consecutive points. After scoring on two straight drives to the basket, Ingram stole the ball from Schroder, scored and was fouled by Prince. Ingram missed the free throw. Minutes later, Ingram dunked over Mike Muscala, who was called for a foul. That time, Ingram completed the three-point play."}
{"game_id": "0021700897", "chunk_id": "0021700897_025", "order": 25, "role": "body", "text": "Lakers: Visit the Heat on Thursday."}
{"game_id": "0021700897", "chunk_id": "0021700897_026", "order": 26, "role": "body", "text": "Hawks: Host the Pacers on Wednesday."}
{"game_id": "0021700897", "chunk_id": "0021700897_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
