{"game_id": "0021400358", "chunk_id": "0021400358_001", "order": 1, "role": "lead", "text": "ATLANTA -- The Atlanta Hawks have shown they can beat up on the NBA's weaker teams.\nThis time, they took down one with a more impressive resume.\nAl Horford scored 21 points, including a huge jumper with just under a minute remaining, and the streaking Hawks won for the 10th time in 11 games with a 93-86 victory over the Chicago Bulls on Monday night."}
{"game_id": "0021400358", "chunk_id": "0021400358_002", "order": 2, "role": "closing", "text": "Atlanta had a nine-game winning streak -- its longest since 1997 -- until Orlando hit a buzzer-beating shot Saturday night for a 100-99 victory.\nBut that run, as impressive as it was, came with a very large asterisk: None of the teams the Hawks beat had a winning record.\nThat wasn't the case with the Bulls, who came in with three straight wins and just behind Atlanta in the Eastern Conference standings.\n\"Each night we want to have the same expectations, the same standards, no matter who we're playing,\" Atlanta coach Mike Budenholzer said. \"But it's always good to be tested by some of the teams we're going to be playing now.\"\nThe Hawks led most of the way, yet never by more than 10 points. After Taj Gibson's dunk with 1:13 remaining brought the Bulls to 87-84, Horford got loose for a 19-footer on the wing and knocked it down.\n\"It was about time,\" Horford said with a smile. \"I missed a few of them around the elbow area that I normally make. They kept going in and out, in and out. Percentages, I guess. I was due to hit one. It was a big shot for us.\"\nPau Gasol put back his own miss to make it 89-86 with 23.7 seconds left, giving the Bulls one more chance. Jimmy Butler made a huge defensive play, leaping high in the air to stuff an attempted crosscourt pass from Kyle Korver, who had a couple of teammates wide open near the basket. The Atlanta player recovered from his miscue, getting his hands on the ball, too, as both players tumbled to the court to force a jump ball.\nEven though Butler won the tip, Paul Millsap swooped in to snatch the ball away for Atlanta.\nThe Hawks sealed the victory at the foul line, ending Chicago's three-game winning streak. The Bulls had won six straight over the Hawks, including a sweep of all four games last season.\nMillsap added 17 points for Atlanta.\nButler led Chicago with 22 and Gibson added 15, but Derrick Rose was held to 14 points on 6-of-21 shooting. The Hawks focused on keeping the Bulls star from penetrating the lane, forcing him to settle for jumpers.\nIt wasn't his night.\n\"Shots I normally hit, tonight they were flat,\" Rose said. \"I just didn't have any lift to them. I guarantee you next game that won't happen.\"\n---\nTIP INS\nBulls: Joakim Noah sat out his fourth straight game with an injured right ankle. ... Rose missed his first five shots. He finally made the scoresheet on a drive with 7:09 left in the second quarter. ... The Bulls had won their last six games against the Hawks by an average of 15.8 points. ... The teams meet two more times this season, both in Chicago.\nHawks: Atlanta had to go without backup center Pero Antic, who was sidelined with flu-like symptoms. ... With Antic out, 35-year-old Elton Brand was one of the first guys off the bench. He had eight points and two rebounds in 13 1/2 minutes. ... DeMarre Carroll picked up a technical foul early in the second quarter for griping about a foul call while defending the baseline. ... The Hawks had 26 assists, the 22nd time in 24 games they've dished out at least 20.\nQUOTABLE\n\"We put ourselves in the hole. We should have had the lead a long time ago. Don't get me wrong, they're a great team. But we should have made sure we came out a little more aggressive at the beginning of the game.\" -- Rose on the Hawks, who grabbed the lead for good with 6:53 left in the opening quarter.\nUP NEXT\nBulls: Host the New York Knicks on Thursday.\nHawks: Play at the Cleveland Cavaliers on Wednesday."}
