{"game_id": "0021700297", "chunk_id": "0021700297_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  The Clippers' third win in a row for the first time since opening the season 4-0 came at a price."}
{"game_id": "0021700297", "chunk_id": "0021700297_002", "order": 2, "role": "body", "text": "Blake Griffin fell down under the basket and clutched his left knee with 3:53 left in a 120-115 victory over the Los Angeles Lakers on Monday night."}
{"game_id": "0021700297", "chunk_id": "0021700297_003", "order": 3, "role": "body", "text": "The team said he's day-to-day and will be examined on Tuesday. A grim-faced Griffin dressed and left the locker room without speaking to reporters."}
{"game_id": "0021700297", "chunk_id": "0021700297_004", "order": 4, "role": "body", "text": "\"It didn't look good, obviously,\" coach Doc Rivers said."}
{"game_id": "0021700297", "chunk_id": "0021700297_005", "order": 5, "role": "body", "text": "Griffin was going for a loose ball in the paint with teammate Austin Rivers and Lakers rookie Lonzo Ball. It appeared Rivers fell on Griffin, whose knee got twisted as he landed on his back. Griffin got up, but soon left the game and the court."}
{"game_id": "0021700297", "chunk_id": "0021700297_006", "order": 6, "role": "body", "text": "\"Lonzo knocked someone into Blake and it was a trigger effect,\" the elder Rivers said. \"Blake said he was OK. Then he just couldn't move. He's hoping it was just a bang.\""}
{"game_id": "0021700297", "chunk_id": "0021700297_007", "order": 7, "role": "body", "text": "The Clippers are already missing three key players, including guard Patrick Beverley, who is out for the season after having right knee surgery last week. Forward Danilo Gallinari and guard Milos Teodosic are hurt, too."}
{"game_id": "0021700297", "chunk_id": "0021700297_008", "order": 8, "role": "body", "text": "Lou Williams scored a season-high 42 points, helping the Clippers rally from an eight-point deficit in the fourth quarter to earn their 11th straight home victory against their Staples Center co-tenant."}
{"game_id": "0021700297", "chunk_id": "0021700297_009", "order": 9, "role": "body", "text": "\"He saved us,\" Rivers said. \"We needed every point Lou gave us.\""}
{"game_id": "0021700297", "chunk_id": "0021700297_010", "order": 10, "role": "body", "text": "Griffin added 26 points and 11 rebounds."}
{"game_id": "0021700297", "chunk_id": "0021700297_011", "order": 11, "role": "body", "text": "The elder Rivers and Williams both thought Griffin got fouled on the play."}
{"game_id": "0021700297", "chunk_id": "0021700297_012", "order": 12, "role": "body", "text": "\"The referees acknowledged he got hit,\" Williams said. \"But I guess there were some other things that went on during that play.\""}
{"game_id": "0021700297", "chunk_id": "0021700297_013", "order": 13, "role": "body", "text": "Kentavious Caldwell-Pope hit an open 18-footer that left the Lakers trailing 116-115 with 48 seconds to go."}
{"game_id": "0021700297", "chunk_id": "0021700297_014", "order": 14, "role": "body", "text": "Williams answered with a layup before Brandon Ingram missed a corner jumper for the Lakers. Williams got fouled and made both, completing a 14 of 14 free throw performance that closed out the game."}
{"game_id": "0021700297", "chunk_id": "0021700297_015", "order": 15, "role": "body", "text": "\"That was a gutty win for us,\" Rivers said."}
{"game_id": "0021700297", "chunk_id": "0021700297_016", "order": 16, "role": "body", "text": "Pope led the Lakers with 29 points. Ingram and Jordan Clarkson added 17 points each."}
{"game_id": "0021700297", "chunk_id": "0021700297_017", "order": 17, "role": "body", "text": "Ball finished with three points on 1 of 7 shooting for the Lakers, who were coming off a four-day break after dropping six of nine games. Ball returned for the game's final five minutes, tossing the ball out of bounds and missing two 3-pointers."}
{"game_id": "0021700297", "chunk_id": "0021700297_018", "order": 18, "role": "body", "text": "\"We didn't make enough shots,\" Ball said. \"We played hard enough to win the game. We just kind of beat ourselves.\""}
{"game_id": "0021700297", "chunk_id": "0021700297_019", "order": 19, "role": "body", "text": "The Lakers opened a 103-95 lead in the fourth, with Kyle Kuzma and Clarkson combining to score 12 of their first 14 points."}
{"game_id": "0021700297", "chunk_id": "0021700297_020", "order": 20, "role": "body", "text": "The Clippers answered with a 15-2 run to take a 110-104 lead. Williams hit a 3-pointer and got fouled on another attempt, making three free throws, before Griffin's one-handed baseline jam."}
{"game_id": "0021700297", "chunk_id": "0021700297_021", "order": 21, "role": "body", "text": "The Lakers have dropped seven of 10."}
{"game_id": "0021700297", "chunk_id": "0021700297_022", "order": 22, "role": "body", "text": "Williams scored 15 points in the third quarter for the Clippers, who trailed 89-87 going into the fourth."}
{"game_id": "0021700297", "chunk_id": "0021700297_023", "order": 23, "role": "body", "text": "Pope hit his fifth 3-pointer and Julius Randle followed with four straight points in a 7-0 run that gave the Lakers their largest lead, 86-80, of the third."}
{"game_id": "0021700297", "chunk_id": "0021700297_024", "order": 24, "role": "body", "text": "Neither team led by more than nine points in the first half, when the Clippers shot 56 percent and trailed 62-60 at the break."}
{"game_id": "0021700297", "chunk_id": "0021700297_026", "order": 26, "role": "body", "text": "Williams had a dunk and DeAndre Jordan noticed. \"We may not see that again until next year,\" he said."}
{"game_id": "0021700297", "chunk_id": "0021700297_028", "order": 28, "role": "body", "text": "Kuzma is back on the Lakers bench with the return of Larry Nance Jr. The forward had 30 points and 10 rebounds against Phoenix on Nov. 17, making him the first Lakers rookie with at least 30 and 10 since Magic Johnson in February 1980. Kuzma's double-double was a single-game high for an NBA rookie this season. During Nance's 11-game absence, Kuzma was the Lakers' leading scorer with a 16.8-point average. \"The total number of minutes won't be the same,\" Walton said. \"There's another player out there now that's going to be taking some of those minutes.\" Nance said he has no problem with his left hand. \"For the past three weeks I've been dreaming of this, I missed it.\""}
{"game_id": "0021700297", "chunk_id": "0021700297_030", "order": 30, "role": "body", "text": "\"He's not going to be good, he's going to be great.\" -- Rivers on Ball."}
{"game_id": "0021700297", "chunk_id": "0021700297_032", "order": 32, "role": "body", "text": "Lakers: F Larry Nance Jr. returned after missing 11 straight games with a broken bone in his left hand. ... LaVar Ball and youngest Ball brother LaMelo sat next to the Clippers bench."}
{"game_id": "0021700297", "chunk_id": "0021700297_033", "order": 33, "role": "body", "text": "Clippers: Their 11-game streak against the Lakers is the longest home winning streak against them in franchise history. ... The Clippers have won 20 of the last 22 matchups."}
{"game_id": "0021700297", "chunk_id": "0021700297_035", "order": 35, "role": "body", "text": "Lakers: Host the defending NBA champion Warriors on Wednesday."}
{"game_id": "0021700297", "chunk_id": "0021700297_036", "order": 36, "role": "body", "text": "Clippers: Host Utah on Thursday. The Clippers won the first meeting at home, 102-84."}
{"game_id": "0021700297", "chunk_id": "0021700297_038", "order": 38, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
