{"game_id": "0021700579", "chunk_id": "0021700579_001", "order": 1, "role": "lead", "text": "NEW YORK --  With a couple big wins behind them and a long plane ride ahead, the Boston Celtics knew they were in for a rough game."}
{"game_id": "0021700579", "chunk_id": "0021700579_002", "order": 2, "role": "body", "text": "\"I think everybody had to push through,\" rookie Jayson Tatum said."}
{"game_id": "0021700579", "chunk_id": "0021700579_003", "order": 3, "role": "body", "text": "Tatum did most of the pushing at the end."}
{"game_id": "0021700579", "chunk_id": "0021700579_004", "order": 4, "role": "body", "text": "He had a driving dunk and a 3-pointer on consecutive possessions, pulling the Celtics out of a late hole and leading them to an 87-85 victory over the Brooklyn Nets on Saturday night."}
{"game_id": "0021700579", "chunk_id": "0021700579_005", "order": 5, "role": "body", "text": "Playing without Al Horford because of a sore left knee, Boston won its sixth straight heading into its trip to London to face Philadelphia on Thursday."}
{"game_id": "0021700579", "chunk_id": "0021700579_006", "order": 6, "role": "body", "text": "The Celtics were trailing by one when Tatum got the ball and drove for a powerful slam that gave them an 84-83 lead. Kyrie Irving missed on Boston's next possession but wrestled the ball away from DeMarre Carroll and got it to Tatum in the corner near the Boston bench, and his 3 made it 87-83 with 45 seconds to play."}
{"game_id": "0021700579", "chunk_id": "0021700579_007", "order": 7, "role": "body", "text": "\"He is not scared of the moment,\" coach Brad Stevens said about the No. 3 pick. \"Never has been.\""}
{"game_id": "0021700579", "chunk_id": "0021700579_008", "order": 8, "role": "body", "text": "The Nets cut it two on Joe Harris' tip and had a bunch of chances to tie in the final seconds, but missed a series of shots near the basket, with DeMarre Carroll appearing to be injured during the sequence."}
{"game_id": "0021700579", "chunk_id": "0021700579_009", "order": 9, "role": "body", "text": "Irving finished with 21 points, and Tatum added 14."}
{"game_id": "0021700579", "chunk_id": "0021700579_010", "order": 10, "role": "body", "text": "Both teams shot under 40 percent, with the Celtics perhaps worn out after a draining week in which they beat Cleveland on Wednesday and Minnesota on Friday in nationally televised games at home. But they played their usual rock-solid defense, limiting the Nets to 33 percent shooting from the field and 19 percent from 3-point range."}
{"game_id": "0021700579", "chunk_id": "0021700579_011", "order": 11, "role": "body", "text": "\"For us as a young, developing group to really will ourselves to that win, of course there are some games where we're not necessarily going to score over 90 points,\" Irving said. \"But on the flip side, we can hold teams to under 90 points so we'll always give ourselves a great chance to win if we're playing at a high level on the defensive end.\""}
{"game_id": "0021700579", "chunk_id": "0021700579_012", "order": 12, "role": "body", "text": "Spencer Dinwiddie had 20 points for the Nets, who were bidding for their first three-game winning streak of the season."}
{"game_id": "0021700579", "chunk_id": "0021700579_013", "order": 13, "role": "body", "text": "They're also trying to earn respect, and Dinwiddie feels they aren't getting it yet from referees."}
{"game_id": "0021700579", "chunk_id": "0021700579_014", "order": 14, "role": "body", "text": "\"When you approach somebody and they shush you or they wave you off like you're not a man, you know what I'm saying, or something of that nature,\" Dinwiddie said, \"that's also frustrating to already be in a position of feeling like you're not getting the same respect.\""}
{"game_id": "0021700579", "chunk_id": "0021700579_015", "order": 15, "role": "body", "text": "Harris had 10 points and 12 rebounds in his first career double-double."}
{"game_id": "0021700579", "chunk_id": "0021700579_017", "order": 17, "role": "body", "text": "Celtics: The Celtics missed their first five free throws before Irving made the second of his two attempts in the second quarter. Jaylen Brown was 0 for 4 in the first half. Boston finished 8 for 15. ... The Celtics have won the last eight meetings, including three close games this season."}
{"game_id": "0021700579", "chunk_id": "0021700579_018", "order": 18, "role": "body", "text": "Nets: Jahlil Okafor had 12 points in 13 minutes, going 5 for 12 from the field in his second straight appearance. ... With backup guard Caris LeVert out for a second straight game with a left groin strain and Isaiah Whitehead unavailable, Milton Doyle made his third appearance of the season and second at home. The rookie guard is on a two-way contract and has spent much of his time with the Nets' G League affiliate."}
{"game_id": "0021700579", "chunk_id": "0021700579_020", "order": 20, "role": "body", "text": "Horford said his knee began hurting in the second quarter of the Celtics' victory over Minnesota on Friday night, though he didn't recall any specific moment. He said the knee felt better after treatment overnight and Saturday and was optimistic he could play, but said the knee just didn't feel right after his pregame workout on the court. He said he hoped to play Thursday."}
{"game_id": "0021700579", "chunk_id": "0021700579_022", "order": 22, "role": "body", "text": "Carroll shot 3 for 12 and scored 10 points and had to be helped from the floor by teammates after the final flurry near the basket. He came into the game batting rib soreness. Coach Kenny Atkinson said Carroll wanted to keep playing, but he's going to be hurting while he does. \"I think it's very painful,\" Atkinson said. \"I think if you've ever had a rib, I think those are painful but I do think it's something that can't get worse, so it's what pain level can you tolerate.\""}
{"game_id": "0021700579", "chunk_id": "0021700579_024", "order": 24, "role": "body", "text": "Celtics: Play Philadelphia on Thursday in London."}
{"game_id": "0021700579", "chunk_id": "0021700579_025", "order": 25, "role": "body", "text": "Nets: Host Toronto on Monday night."}
{"game_id": "0021700579", "chunk_id": "0021700579_027", "order": 27, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
