{"game_id": "0021400274", "chunk_id": "0021400274_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  LaMarcus Aldridge missed 14 of his 21 field-goal attempts, but still ended up with 18 points and 13 rebounds. It was just one of those games."}
{"game_id": "0021400274", "chunk_id": "0021400274_002", "order": 2, "role": "body", "text": "Aldridge's fourth consecutive double-double helped push the Trail Blazers to an 88-82 victory over the Indiana Pacers on Thursday night."}
{"game_id": "0021400274", "chunk_id": "0021400274_003", "order": 3, "role": "body", "text": "\"That was one of those grind-it-out, ugly wins. Both teams missed shots, 3s, everything. But a win's a win,\" he said."}
{"game_id": "0021400274", "chunk_id": "0021400274_004", "order": 4, "role": "body", "text": "Damian Lillard led all scorers with 23 points for the Blazers, who have won three straight and 12 of their last 13. Lillard jammed his finger during the game and appeared to be in a lot of pain, but X-rays afterward were clear."}
{"game_id": "0021400274", "chunk_id": "0021400274_005", "order": 5, "role": "body", "text": "The game was more about defense for the Blazers, who held the Pacers to their second-lowest point total of the season. It was Portland's lowest offensive output this season."}
{"game_id": "0021400274", "chunk_id": "0021400274_006", "order": 6, "role": "body", "text": "\"When you get to the post season, every game is grind it out,\" Aldridge said. \"Win these games now and it's good for us.\""}
{"game_id": "0021400274", "chunk_id": "0021400274_007", "order": 7, "role": "body", "text": "Rodney Stuckey had 16 points for the Pacers, who have lost three straight to open a four-game road trip."}
{"game_id": "0021400274", "chunk_id": "0021400274_008", "order": 8, "role": "body", "text": "\"Any loss is frustrating,\" Pacers coach Frank Vogel said. \"But we grew on the defensive end. We gave up 116 points in Phoenix the other night. We wanted to get back to who we are, dominating with defense and rebounding, and we took a step toward that.\""}
{"game_id": "0021400274", "chunk_id": "0021400274_009", "order": 9, "role": "body", "text": "The Pacers tied the score at 64 early in the fourth quarter, but Portland built a 75-66 lead after Nicolas Batum's 3-pointer and Lillard's jumper. Stuckey hit a jumper that pulled the Pacers to 83-80 with 53 seconds left, but they couldn't get any closer."}
{"game_id": "0021400274", "chunk_id": "0021400274_010", "order": 10, "role": "body", "text": "The game was marked by heightened security when a large group of protesters converged on the Moda Center. The group was marching against a New York grand jury's decision not to indict a white police officer in the chokehold death of an unarmed black man."}
{"game_id": "0021400274", "chunk_id": "0021400274_011", "order": 11, "role": "body", "text": "Security at the arena shut down several entrances during the game and there was a large police presence both inside and outside the facility."}
{"game_id": "0021400274", "chunk_id": "0021400274_012", "order": 12, "role": "body", "text": "The Pacers toyed with their lineup before the game, moving Stuckey to the point guard position and Donald Sloan to the bench. Forward Chris Copeland also got a starting nod."}
{"game_id": "0021400274", "chunk_id": "0021400274_013", "order": 13, "role": "body", "text": "A disabled motorized blimp in the arena that got stuck received much of the attention in the first quarter, providing a distraction from the slow start for both teams."}
{"game_id": "0021400274", "chunk_id": "0021400274_014", "order": 14, "role": "body", "text": "The Blazers shot just 6 for 24 (25 percent) and led 16-14 at the end of the first quarter. The Pacers were 7 for 21 (33 percent). It was a season low for points for the quarter for both teams."}
{"game_id": "0021400274", "chunk_id": "0021400274_015", "order": 15, "role": "body", "text": "Portland went up 32-24 midway through the second on Batum's long jumper. But the Pacers closed the gap, pulling to 32-31 with 3:04 left before the half."}
{"game_id": "0021400274", "chunk_id": "0021400274_016", "order": 16, "role": "body", "text": "The Blazers never surrendered the lead and led 38-33 at the break."}
{"game_id": "0021400274", "chunk_id": "0021400274_017", "order": 17, "role": "body", "text": "The game got chippy in the third quarter when David West appeared to shove Robin Lopez, and teammates stepped in to separate the two. West was whistled for a technical foul."}
{"game_id": "0021400274", "chunk_id": "0021400274_018", "order": 18, "role": "body", "text": "Batum dunked to give the Blazers a 51-44 lead halfway through the third. Portland stretched the lead to as many as 10 points, but Luis Scola's layup tied the game at 64."}
{"game_id": "0021400274", "chunk_id": "0021400274_019", "order": 19, "role": "body", "text": "Portland's 10 home wins are the most in the NBA."}
{"game_id": "0021400274", "chunk_id": "0021400274_021", "order": 21, "role": "body", "text": "Pacers: The Pacers spent Wednesday night team bonding by watching Chris Rock's new movie \"Top Five.\""}
{"game_id": "0021400274", "chunk_id": "0021400274_022", "order": 22, "role": "body", "text": "Trail Blazers: Former Blazers star Terry Porter has rejoined the organization as an ambassador. The former All-Star who played 10 years with Portland had been an assistant coach with the Minnesota Timberwolves for the past three seasons. ... The in-arena motorized blimp malfunctioned and had to be squeezed through one of the tunnels to the concourse. Its fate was unclear."}
{"game_id": "0021400274", "chunk_id": "0021400274_024", "order": 24, "role": "body", "text": "Aldridge passed Mychal Thompson for third on the Blazers' all-time rebounding list with 4,885. \"It's an honor. I've worked hard for it,\" Aldridge said. \"This organization has believed in me since day one.\""}
{"game_id": "0021400274", "chunk_id": "0021400274_026", "order": 26, "role": "body", "text": "Trail Blazers: At the New York Knicks on Sunday."}
{"game_id": "0021400274", "chunk_id": "0021400274_027", "order": 27, "role": "closing", "text": "Pacers: At Sacramento on Friday night."}
