{"game_id": "0021700079", "chunk_id": "0021700079_001", "order": 1, "role": "lead", "text": "CHICAGO --  Russell Westbrook had yet another triple-double milestone to accomplish."}
{"game_id": "0021700079", "chunk_id": "0021700079_002", "order": 2, "role": "body", "text": "Westbrook had recorded a triple-double against every NBA opponent except for the Chicago Bulls. He marked that team off his list at last."}
{"game_id": "0021700079", "chunk_id": "0021700079_003", "order": 3, "role": "body", "text": "Westbrook had 12 points, 13 rebounds and 13 assists to lead the Oklahoma City Thunder to a 101-69 rout of the Bulls on Saturday night. He became the first player in league history to record a triple-double against 29 different opponents."}
{"game_id": "0021700079", "chunk_id": "0021700079_004", "order": 4, "role": "body", "text": "Westbrook has even done it against his own team."}
{"game_id": "0021700079", "chunk_id": "0021700079_005", "order": 5, "role": "body", "text": "\"He had one against us in practice,\" Carmelo Anthony said with a smile."}
{"game_id": "0021700079", "chunk_id": "0021700079_006", "order": 6, "role": "body", "text": "Anthony scored 21 points and Paul George had 20 for the Thunder, who won their first road game in three attempts after losing three of their last four games overall. Steven Adams and Raymond Felton had 12 points apiece for the Thunder."}
{"game_id": "0021700079", "chunk_id": "0021700079_007", "order": 7, "role": "body", "text": "Lauri Markkanen scored 15 points to lead the rebuilding Bulls, who were coming off their first win in four games this season after beating the Atlanta Hawks 91-86 on Thursday. Justin Holiday added 11 points and Robin Lopez had 10 for Chicago, which shot 28.2 percent from the field."}
{"game_id": "0021700079", "chunk_id": "0021700079_008", "order": 8, "role": "body", "text": "\"We took a step in the wrong direction tonight,\" coach Fred Hoiberg said. \"We didn't compete. We didn't stay together. We didn't fight through adversity as a team. We were careless. We were stagnant.\""}
{"game_id": "0021700079", "chunk_id": "0021700079_009", "order": 9, "role": "body", "text": "The Thunder shot 44.3 percent from the field in completing a back-to-back after losing to the Minnesota Timberwolves 119-116 on Friday night. Oklahoma City improved to 3-0 when Westbrook has a triple-double."}
{"game_id": "0021700079", "chunk_id": "0021700079_010", "order": 10, "role": "body", "text": "\"Defense, that's my main thing coming into this year, finding ways to impact the game defensively, how I know I can,\" said Westbrook, who had an NBA record 42 triple-doubles last season."}
{"game_id": "0021700079", "chunk_id": "0021700079_011", "order": 11, "role": "body", "text": "The Bulls made 6 of 11 3-point attempts to trail 26-23 after the first quarter before missing all eight of their 3-point attempts in the second quarter. The Thunder went on an 18-2 run to start the quarter and outscored the Bulls 24-8 in the period."}
{"game_id": "0021700079", "chunk_id": "0021700079_012", "order": 12, "role": "body", "text": "The Bulls went 10 for 37 beyond the arc after making a franchise-high 42 3s in their first four games."}
{"game_id": "0021700079", "chunk_id": "0021700079_013", "order": 13, "role": "body", "text": "\"Anyone here will tell you that we didn't compete from the beginning,\" Lopez said. \"That's something we can't afford -- short lapses let alone for an entire 48-minute game.\""}
{"game_id": "0021700079", "chunk_id": "0021700079_015", "order": 15, "role": "body", "text": "Thunder: Oklahoma City was leading the league with 10.6 steals per game and finished with a season-high 16. . The Thunder had dropped four of their six previous games against Chicago."}
{"game_id": "0021700079", "chunk_id": "0021700079_016", "order": 16, "role": "body", "text": "Bulls: PG Kris Dunn (left index finger dislocation) made his Bulls debut off the bench and aggravated his finger but is expected to be OK. He was injured during an Oct. 6 preseason game. Dunn had eight points and five fouls. . F Paul Zipser (knee contusion) returned after missing one game. . G Cameron Payne (right foot surgery) is expected to meet with doctors Friday. Hoiberg said he hopes Payne returns around Jan. 1."}
{"game_id": "0021700079", "chunk_id": "0021700079_018", "order": 18, "role": "body", "text": "Some Thunder players posted photos on social media showing the dented nose of the charter flight they took to Chicago on early Saturday. According to Delta Air Lines, the flight from Minneapolis apparently encountered a bird when it landed."}
{"game_id": "0021700079", "chunk_id": "0021700079_019", "order": 19, "role": "body", "text": "\"You never take anything for granted, just be thankful and blessed they we were able to land the plane and everything was OK,\" Westbrook said. \"Seeing stuff like that just shows you how you need to cherish life and understand the important things in life and embrace every moment.\""}
{"game_id": "0021700079", "chunk_id": "0021700079_020", "order": 20, "role": "body", "text": "Coach Billy Donovan said the plane encountered turbulence about halfway through the flight, which landed safely."}
{"game_id": "0021700079", "chunk_id": "0021700079_021", "order": 21, "role": "body", "text": "\"The plane dropped a little bit,\" Donovan said. \"Then they just basically told us they were trying to get to a lower altitude because they maybe were concerned about the cabin pressure.\""}
{"game_id": "0021700079", "chunk_id": "0021700079_023", "order": 23, "role": "body", "text": "Hoiberg said his team would have its \"hardest practice of the year\" Monday."}
{"game_id": "0021700079", "chunk_id": "0021700079_025", "order": 25, "role": "body", "text": "Thunder: At Milwaukee on Tuesday."}
