{"game_id": "0021700216", "chunk_id": "0021700216_001", "order": 1, "role": "lead", "text": "PHOENIX --  James Harden looked up at the halftime totals Thursday night and couldn't believe what he saw, despite how well he and the Houston Rockets had shot the ball."}
{"game_id": "0021700216", "chunk_id": "0021700216_002", "order": 2, "role": "body", "text": "\"I thought there was something wrong with the score,\" he said."}
{"game_id": "0021700216", "chunk_id": "0021700216_003", "order": 3, "role": "body", "text": "There wasn't. Harden scored 23 of his 48 points in the second quarter and the Rockets put up 90 in the first half on the way to a 142-116 rout of the Phoenix Suns."}
{"game_id": "0021700216", "chunk_id": "0021700216_004", "order": 4, "role": "body", "text": "Houston dominated with Chris Paul back in the lineup after he missed 14 games because of a knee injury. The Rockets made 61 percent of their first-half shots to match the second-most points in a first half in NBA history."}
{"game_id": "0021700216", "chunk_id": "0021700216_005", "order": 5, "role": "body", "text": "\"Everybody was psyched up to get Chris back,\" Rockets coach Mike D'Antoni said. \"Just one of those nights where we played well offensively. ... Chris played really well.\""}
{"game_id": "0021700216", "chunk_id": "0021700216_006", "order": 6, "role": "body", "text": "Houston finished 14 points shy of the franchise record for points in a game and improved to 8-1 on the road this season. The Rockets knocked down 21 of 44 3-point attempts, and Harden made all 18 of his free throws."}
{"game_id": "0021700216", "chunk_id": "0021700216_007", "order": 7, "role": "body", "text": "He is 37 for 37 from the foul line over the past two games, an NBA record."}
{"game_id": "0021700216", "chunk_id": "0021700216_008", "order": 8, "role": "body", "text": "Harden, the league's leading scorer, had 33 points at halftime. Houston used a 13-1 run over the final 3:08 of the first quarter to take control and was never threatened after that, leading 45-23 going into the second."}
{"game_id": "0021700216", "chunk_id": "0021700216_009", "order": 9, "role": "body", "text": "Paul, who hadn't played since the season opener, got the start and didn't miss a beat, scoring 11 points and handing out 10 assists in limited action."}
{"game_id": "0021700216", "chunk_id": "0021700216_010", "order": 10, "role": "body", "text": "\"I know I was gassed, especially early, but it was fun to get back out there with the guys,\" he said."}
{"game_id": "0021700216", "chunk_id": "0021700216_011", "order": 11, "role": "body", "text": "D'Antoni said before the game that getting the two stars, Harden and Paul, in sync will \"take care of itself over the next week or so.\" D'Antoni planned to play Paul for 20 minutes -- the point guard got 21 minutes of action and sat out most of the fourth quarter."}
{"game_id": "0021700216", "chunk_id": "0021700216_012", "order": 12, "role": "body", "text": "\"The 20-minute restriction, first and foremost, I hate it,\" Paul said, \"but I know they're trying to protect me.\""}
{"game_id": "0021700216", "chunk_id": "0021700216_013", "order": 13, "role": "body", "text": "Ryan Anderson added 24 points for the Rockets, who have won seven of eight."}
{"game_id": "0021700216", "chunk_id": "0021700216_014", "order": 14, "role": "body", "text": "The Suns also shot well in the first half, getting 65 points before the break. They got the lead down to 14 with one of Troy Daniels' six 3-pointers in the second quarter, but the Rockets repeatedly scored with ease at the other end."}
{"game_id": "0021700216", "chunk_id": "0021700216_015", "order": 15, "role": "body", "text": "Daniels tied a Suns record for 3s in a quarter and led Phoenix with 23 points. Devin Booker added 18 points and 10 assists."}
{"game_id": "0021700216", "chunk_id": "0021700216_016", "order": 16, "role": "body", "text": "\"I felt like it was a good experience for us to see what a high-caliber team looks like up close and personal,\" Booker said. \"But we were on the wrong end of that.\""}
{"game_id": "0021700216", "chunk_id": "0021700216_017", "order": 17, "role": "body", "text": "The Suns have lost seven of eight."}
{"game_id": "0021700216", "chunk_id": "0021700216_019", "order": 19, "role": "body", "text": "The Denver Nuggets scored 90 points in the first half of a game against San Antonio on Nov. 7, 1990. Three days later, they gave up 107 in the first half against Phoenix, the most ever."}
{"game_id": "0021700216", "chunk_id": "0021700216_021", "order": 21, "role": "body", "text": "As the first half came to a close, a fan yelled at D'Antoni from the stands. \"Sit down Mike, you're up 40!\" D'Antoni, a former Suns coach, turned and deadpanned, \"It's 25. You can't count.\""}
{"game_id": "0021700216", "chunk_id": "0021700216_023", "order": 23, "role": "body", "text": "Phoenix center Greg Monroe made his Suns debut, starting and playing 26 minutes. Monroe, acquired from Milwaukee in the trade for guard Eric Bledsoe on Nov. 7, was dealing with a left calf strain when he arrived."}
{"game_id": "0021700216", "chunk_id": "0021700216_024", "order": 24, "role": "body", "text": "Monroe finished with 20 points and 11 rebounds. He played amid speculation that he could be traded or have his contract bought out."}
{"game_id": "0021700216", "chunk_id": "0021700216_025", "order": 25, "role": "body", "text": "\"The only guy in our lineup with four years of experience, and he just knows how to play the game and lets the game come to him,\" Suns interim coach Jay Triano said."}
{"game_id": "0021700216", "chunk_id": "0021700216_027", "order": 27, "role": "body", "text": "Rockets: F Luc Mbah a Moute (illness) did not play. ... C Nene returned from a right foot sprain that kept him out the past two games and scored 10 points in 15 minutes. ... F P.J. Tucker faced his former team for the first time in Phoenix since he was traded to Toronto in February last season. Tucker spent five seasons with the Suns, and a video tribute to him aired in the arena during a first-quarter timeout."}
{"game_id": "0021700216", "chunk_id": "0021700216_028", "order": 28, "role": "body", "text": "Suns: C Tyson Chandler (illness) and F Jared Dudley (bruised right knee) did not play. ... The Suns wrapped up a 1-5 homestand, their longest of the season. ... Arizona Cardinals star WR Larry Fitzgerald sat courtside."}
{"game_id": "0021700216", "chunk_id": "0021700216_030", "order": 30, "role": "body", "text": "Rockets: At the Memphis Grizzlies on Saturday night."}
{"game_id": "0021700216", "chunk_id": "0021700216_031", "order": 31, "role": "body", "text": "Suns:  At the Los Angeles Lakers on Friday night."}
{"game_id": "0021700216", "chunk_id": "0021700216_033", "order": 33, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
