{"game_id": "0021700753", "chunk_id": "0021700753_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Myles Turner returned to the Pacers' starting lineup merely hoping to put together a performance he could build on."}
{"game_id": "0021700753", "chunk_id": "0021700753_002", "order": 2, "role": "body", "text": "But with 34 seconds left in the game, Turner found himself at the foul line putting an exclamation point on his best game of the season."}
{"game_id": "0021700753", "chunk_id": "0021700753_003", "order": 3, "role": "body", "text": "\"I'm not missing,\" Turner said he thought to himself."}
{"game_id": "0021700753", "chunk_id": "0021700753_004", "order": 4, "role": "body", "text": "The third-year big man made both free throws, giving Indiana the lead Wednesday night in a 105-101 victory over the Memphis Grizzlies."}
{"game_id": "0021700753", "chunk_id": "0021700753_005", "order": 5, "role": "body", "text": "Turner had his fourth double-double of the season with 15 points and 11 rebounds. He also blocked three shots against a Memphis team that only had nine players available."}
{"game_id": "0021700753", "chunk_id": "0021700753_006", "order": 6, "role": "body", "text": "The win was Indiana's third straight and fifth in six games."}
{"game_id": "0021700753", "chunk_id": "0021700753_007", "order": 7, "role": "body", "text": "\"You've got to commend the Grizzlies with the way they played,\" Turner said. \"But at the same time, we've got to be able to put our foot down, put our foot on the gas, get going from the jump on a team like that. You've got to jump out on teams. It's good to get this win, but you want to build off this one and learn from this one as well.\""}
{"game_id": "0021700753", "chunk_id": "0021700753_008", "order": 8, "role": "body", "text": "Turner has missed 16 games due to injury this season, including nine straight in January. Once he got healthy, he came off the bench for two games before returning to the starting lineup against the Grizzlies."}
{"game_id": "0021700753", "chunk_id": "0021700753_009", "order": 9, "role": "body", "text": "He jumped out aggressively from the start, scoring seven points in the first quarter and pulling down six rebounds."}
{"game_id": "0021700753", "chunk_id": "0021700753_010", "order": 10, "role": "body", "text": "All five Pacers starters ended up scoring in double digits. Bojan Bogdanovic and Darren Collison each had 21 points, Victor Oladipo added 13 and Thaddeus Young had 10."}
{"game_id": "0021700753", "chunk_id": "0021700753_011", "order": 11, "role": "body", "text": "The teams traded the lead nine times in the first half, with Indiana taking a 55-53 lead into halftime. The Pacers opened the second half with a 9-3 run, but Memphis wouldn't go away. Trailing 100-95, the Grizzlies went on a 6-0 spurt to regain the lead with 1:57 to play."}
{"game_id": "0021700753", "chunk_id": "0021700753_012", "order": 12, "role": "body", "text": "After Turner's late free throws gave the Pacers a 102-101 lead, Memphis had multiple opportunities to answer back. Marc Gasol's 11-foot jumper with 15 seconds left was rebounded by Grizzlies teammate Wayne Selden. With less than three seconds remaining, Selden drove the lane and attempted a floater in heavy traffic. More than two Pacers were there when Selden went up for the shot, but it was partially blocked by Cory Joseph and the Pacers grabbed the rebound and sealed the game at the foul line."}
{"game_id": "0021700753", "chunk_id": "0021700753_013", "order": 13, "role": "body", "text": "Gasol finished with 23 points and nine rebounds. Selden led the Grizzlies with 24 points but was ejected with 0.7 seconds remaining after arguing he was fouled on his missed shot. Memphis coach J.B. Bickerstaff came onto the floor to join Selden in his altercation with officials."}
{"game_id": "0021700753", "chunk_id": "0021700753_014", "order": 14, "role": "body", "text": "\"It's frustrating. (I was) looking for some consistency,\" Bickerstaff said. \"He attacks the basket, puts himself in a position to be fouled, goes strong to the basket, didn't get the whistle.\""}
{"game_id": "0021700753", "chunk_id": "0021700753_015", "order": 15, "role": "body", "text": "Still, Bickerstaff was pleased with his team."}
{"game_id": "0021700753", "chunk_id": "0021700753_016", "order": 16, "role": "body", "text": "\"You can't take anything away from their effort,\" he said. \"This was just another example of the fight that's in that group.\""}
{"game_id": "0021700753", "chunk_id": "0021700753_018", "order": 18, "role": "body", "text": "Grizzlies: Haven't defeated an Eastern Conference team on the road this season and will face three more before returning to Memphis next Wednesday to take on Utah. ... Memphis is 5-17 away from home this season. ... The Grizzlies allow the sixth-most points in the NBA, with opponents averaging 102.5 per game. ... Memphis is 3-24 when shooting a lower field goal percentage than its opponent. ... The Grizzlies are 11-27 this season when Mike Conley sits out due to injury."}
{"game_id": "0021700753", "chunk_id": "0021700753_019", "order": 19, "role": "body", "text": "Pacers: Indiana is 10-10 against Western Conference teams, including three straight wins. ... Since falling back to .500 (19-19) after losing their fifth straight game on Jan. 3, the Pacers are 10-4. ... Indiana has won five of its last 10 by 13 or more points. ... The Pacers swept the season series against Memphis for the first time since 2012-13. ... Indiana coach Nate McMillan won't be with the team during practice on Thursday and in Charlotte on Friday night because of personal reasons. He will rejoin the Pacers on Saturday."}
{"game_id": "0021700753", "chunk_id": "0021700753_021", "order": 21, "role": "body", "text": "Young reached double digits in scoring for the 13th consecutive game. Prior to the streak, Young had only scored in double figures one time. Through 52 games this season, he has three double-doubles and is averaging 12.2 points and nearly six rebounds per game."}
{"game_id": "0021700753", "chunk_id": "0021700753_023", "order": 23, "role": "body", "text": "Grizzlies guard Tyreke Evans was not with the team. Evans' absence only adds to speculation that Memphis might be trying to trade the eight-year veteran before the Feb. 8 deadline. Evans is averaging 19.5 points, five assists and five rebounds this season for Memphis."}
{"game_id": "0021700753", "chunk_id": "0021700753_025", "order": 25, "role": "body", "text": "Grizzlies: Visit the Detroit Pistons on Thursday."}
{"game_id": "0021700753", "chunk_id": "0021700753_026", "order": 26, "role": "body", "text": "Pacers: Visit the Charlotte Hornets on Friday."}
{"game_id": "0021700753", "chunk_id": "0021700753_028", "order": 28, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
