{"game_id": "0021400537", "chunk_id": "0021400537_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- It was a perfect setup for Portland. The Trail Blazers needed a big third quarter to get back into the game, and Miami has been all-too-generous of late in that period.\nThe result was a dominant second half by Portland, as LaMarcus Aldridge had 24 points and 12 rebounds in a 99-83 win over the Heat.\nWesley Matthews scored 18 points, Damian Lillard 16 and Chris Kaman 10 for Portland. The Blazers (28-8) tied Golden State for most wins in the NBA this season."}
{"game_id": "0021400537", "chunk_id": "0021400537_002", "order": 2, "role": "closing", "text": "Portland trailed 48-43 at halftime after getting beat in nearly every statistical category and shooting 2 of 14 from 3-point range. The Blazers needed a boost, and found a willing participant in the Heat, who haven't fared well during third quarters this season, particularly the past few weeks.\nPortland outscored Miami 33-16 in the third, jumping on the Heat (15-21) by starting the period on a 17-6 run. Matthews and Lillard hit back-to-back 3-pointers during the first 3 minutes, then Kaman scored six consecutive points -- all on layups.\nThe Blazers, outrebounded 26-22 in the first half, beat Miami 13-3 on the boards during the third quarter.\n\"I think we got back to our tempo. In the first half, we kind of played at their pace,\" Matthews said.\nPortland coach Terry Stotts said he went with a bigger lineup in the second half.\n\"We just came out with a little more energy, a little more focus,\" Stotts said. \"We played a very good defensive second half. Obviously the third quarter made a big difference. We got a rhythm to our shots, got out and played in the flow a little bit. ... The second half was the way we needed to play.\"\nThe third quarter performance left Miami coach Eric Spoelstra frustrated, but not surprised. In their last three losses, the Heat have been outscored 102-46 in the third.\n\"It's simply not enough. We need a breakthrough in those moments. We have to find a way. Tonight it was simply a matter of not playing hard enough during those minutes when they made their run,\" Spoelstra said.\n\"Look, we've seen this movie. We can play with anyone, anywhere, in any building for 42 minutes. That ain't enough in this league.\"\nDwyane Wade led Miami with 23 points. Chris Bosh had 18 and Hassan Whiteside 10 for the Heat.\nPortland was buoyed by a season-low seven turnovers.\n\"The past few games we've been seeing how many holes we can dig ourselves out of, so we were taking better care of the ball tonight,\" Matthews said.\nLeading 74-62 heading into the fourth quarter, the Blazers broke it open when Matthews and Allen Crabbe hit consecutive 3-pointers to key an 8-0 run that gave Portland an 86-69 lead. The Blazers led by as many as 23 points.\nTIP-INS\nHeat: G Shabazz Napier rejoined the Heat after playing three games with the Sioux Fall Skyforce of the NBA Development League. Napier averaged 18.6 points and four assists with the Skyforce. He was scoreless in 5 minutes against Portland. ... Also returning was C Justin Hamilton, who missed the past nine games because of a concussion.\nTrail Blazers: Portland announced it has extended the contract of general manager Neil Olshey through the 2018-19 season. Olshey, hired in 2012, was also named president of basketball operations. ... The Blazers have held eight of their past 11 opponents to fewer than 100 points. Portland is 21-2 when opponents fail to score 100 this season.\nMATTHEWS BOUNCES BACK\nMatthews was questionable for the game after hyperextending his left knee in Monday's win over the Los Angeles Lakers. Matthews ended up starting and playing 30 minutes against the Heat, shooting 6 of 10 with two rebounds and five assists. \"If you hadn't known that he had an issue last game, I wouldn't have said I noticed anything,\" Stotts said.\nBIG NUMBERS\nLillard became the first player since LeBron James and Wade (2004-06) with at least 4,000 points and 1,200 assists in his first 200 NBA games. Lillard is the fifth player to accomplish that feat since 1985.\nUP NEXT\nHeat: Sunday at Los Angeles Clippers.\nTrail Blazers: Saturday at home against Orlando."}
