{"game_id": "0021401118", "chunk_id": "0021401118_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- If the Bucks and Bulls wind up meeting in the first round of the playoffs, Milwaukee just gave Chicago something to think about.\nMichael Carter-Williams had 21 points and 10 rebounds to lead Milwaukee to a rare 95-91 victory at home over Chicago on Wednesday night.\nThe Bucks (37-38), who lost their previous nine home games against the Bulls, also got 16 points from Ersan Ilyasova.\nMilwaukee won for only the third time in 11 games and maintained a 2 1/2-game lead over Miami and Brooklyn for sixth place in the Eastern Conference."}
{"game_id": "0021401118", "chunk_id": "0021401118_002", "order": 2, "role": "closing", "text": "\"Any win, no matter at what point here or there, can help,\" Bucks coach Jason Kidd said.\nChicago's seven-game winning streak against Milwaukee ended despite 25 points and seven rebounds from Jimmy Butler.\nPau Gasol added 14 points and 11 rebounds for the Bulls, who have lost seven of nine on the road. Chicago dropped into a tie with Toronto for the No. 3 seed in the East.\n\"It doesn't matter who we'll see,\" said Milwaukee big man John Henson, who scored six of his 11 points in the final quarter. \"We've just got to be ready. We've got to be ready for anything.\"\nBulls guard Kirk Hinrich took a charge and injured his left knee with 4:35 left in the third quarter. He limped to the locker room and did not return.\nChicago coach Tom Thibodeau said X-rays were negative and Hinrich will be re-evaluated Thursday.\n\"You're always concerned,\" Thibodeau said. \"You're concerned about everything.\"\nChicago committed 13 of its 20 turnovers in the second half. The team shot 64.9 percent from the free throw line (24 for 37) and 19.2 percent from 3-point range (5 of 26) while giving up 20 offensive rebounds.\n\"We didn't win. That's all that matters,\" Butler said. \"No matter how many times you turn the ball over -- yada, yada, yada -- you've got to win the game.\"\nConsecutive jumpers from Khris Middleton and O.J. Mayo gave Milwaukee a 92-88 lead with 2:56 to go.\nAfter a layup by E'Twaun Moore and a free throw by Gasol cut the deficit to 92-91, Milwaukee's Giannis Antetokounmpo blocked a layup attempt by Moore with 1:25 to go.\nMilwaukee answered at the other end on a tip-in by Ilyasova for a 94-91 lead with 1:07 left.\nChicago missed a trio of 3-pointers on its next two possessions before Antetokounmpo sank a free throw for a 95-91 lead with 5.8 seconds to go.\n---\nTIP-INS\nBulls: Chicago's three-game winning streak was halted. The last time the team won four in a row was Feb. 7-12. ... The Bulls are 25-9 in the last 34 games against the Bucks, including 3-1 this season.\nBucks: The previous time Milwaukee won a home game against Chicago was Feb. 26, 2011. ... Carter-Williams totaled 12 points in his previous two games, including four in a loss at Atlanta on Monday.\nGETTING CLOSE\nGasol leads the NBA with 49 double-doubles this season, a career high. The last Bulls player to have at least 50 in a season was Charles Oakley with 53 in 1986-87.\nHIT THE ROAD\nMilwaukee will try to snap a season-high, 11-game road losing streak Friday. It is the Bucks' first game in Boston this season.\nNO FOOLING\nAfter a couple of weeks of speculation that Milwaukee would reveal a new logo and color scheme for next season, fans were told there would be a special announcement at halftime. But after a short video that hinted the new colors would be green, cream and blue, Bucks mascot Bango waved a giant flag that read \"April Fool's Day.\" However, the scoreboard then told fans they can \"See the Future\" on April 13.\nUP NEXT\nBulls: Friday vs. Detroit.\nBucks: Friday at Boston."}
