{"game_id": "0021700048", "chunk_id": "0021700048_001", "order": 1, "role": "lead", "text": "PHOENIX --  On his way out of Phoenix's locker room Monday night, Devin Booker popped his head into the coaches' office to congratulate interim coach Jay Triano."}
{"game_id": "0021700048", "chunk_id": "0021700048_002", "order": 2, "role": "body", "text": "The Suns had a perfect response to a rough time for the franchise."}
{"game_id": "0021700048", "chunk_id": "0021700048_003", "order": 3, "role": "body", "text": "Booker scored 22 points, including two free throws with 9.8 seconds to play, and Phoenix beat the Sacramento Kings 117-115 for its first win of the season in its first game under Triano."}
{"game_id": "0021700048", "chunk_id": "0021700048_004", "order": 4, "role": "body", "text": "Booker called Monday a must-win game. Phoenix fired coach Earl Watson on Sunday and guard Eric Bledsoe was sent home Monday morning after he sent out a tweet over the weekend that left the impression he no longer wanted to play for the Suns."}
{"game_id": "0021700048", "chunk_id": "0021700048_005", "order": 5, "role": "body", "text": "\"Everything that happened in the last 24 hours should have been eye-opening to us,\" Booker said. \"I'm proud of the team how we responded. Came out and fought.\""}
{"game_id": "0021700048", "chunk_id": "0021700048_006", "order": 6, "role": "body", "text": "Phoenix shot 54.5 percent from the field and held on after Sacramento rallied in the final period. Marquese Chriss scored 19 points, and Mike James finished with 18 in his first career start."}
{"game_id": "0021700048", "chunk_id": "0021700048_007", "order": 7, "role": "body", "text": "\"I'm happy for our players,\" Triano said."}
{"game_id": "0021700048", "chunk_id": "0021700048_008", "order": 8, "role": "body", "text": "The Kings have dropped three of four to begin the season. Garrett Temple matched a career high with 23 points, and rookie De'Aaron Fox had 19."}
{"game_id": "0021700048", "chunk_id": "0021700048_009", "order": 9, "role": "body", "text": "The Suns led by double digits for much of the fourth quarter, but Temple hit back-to-back 3-pointers to make it 112-110 with 1:20 to play. Then Fox tied it with a layup."}
{"game_id": "0021700048", "chunk_id": "0021700048_010", "order": 10, "role": "body", "text": "James looped a high-arching left-handed layup over two defenders with 14.8 seconds to go, putting the Suns back in front. Temple drew a foul at the other end but made one of two free throws, and the Suns' Troy Daniels made a foul shot with 5.1 seconds left."}
{"game_id": "0021700048", "chunk_id": "0021700048_011", "order": 11, "role": "body", "text": "\"I work on that a lot actually, like every day,\" James said of his shot."}
{"game_id": "0021700048", "chunk_id": "0021700048_012", "order": 12, "role": "body", "text": "The Kings had one last chance, but Temple missed a 3 at the buzzer."}
{"game_id": "0021700048", "chunk_id": "0021700048_013", "order": 13, "role": "body", "text": "\"I felt it was in. I felt I rushed it a little more than I should have,\" Temple said. \"I had a little more time left. You make some, you miss some.\""}
{"game_id": "0021700048", "chunk_id": "0021700048_014", "order": 14, "role": "body", "text": "With Triano directing the team from the sideline, the Suns raced out to a 22-point lead, making 14 of 20 first-quarter shots."}
{"game_id": "0021700048", "chunk_id": "0021700048_015", "order": 15, "role": "body", "text": "\"They came out firing, we knew they would,\" Kings coach Dave Joerger said."}
{"game_id": "0021700048", "chunk_id": "0021700048_016", "order": 16, "role": "body", "text": "Chriss scored 10 points in the first 12 minutes. But the Kings got as close as five in the second quarter and trailed 59-51 at halftime, with former Suns draft pick Bogdan Bogdanovic scoring all 12 of his points in the second in his NBA debut."}
{"game_id": "0021700048", "chunk_id": "0021700048_018", "order": 18, "role": "body", "text": "Triano changed up what had been the Suns' starting five for the first three games under Watson. Booker, T.J. Warren and Tyson Chandler remained in while Chriss and James made their first starts of the season."}
{"game_id": "0021700048", "chunk_id": "0021700048_019", "order": 19, "role": "body", "text": "\"I just want to be on the floor, period,\" Chriss said. \"Being able to get in my flow early helped me.\""}
{"game_id": "0021700048", "chunk_id": "0021700048_020", "order": 20, "role": "body", "text": "Triano said he hadn't slept much and was running on adrenaline."}
{"game_id": "0021700048", "chunk_id": "0021700048_021", "order": 21, "role": "body", "text": "\"We're going to learn on the fly and I'm going to stop the game,\" he said. \"If I use all timeouts to teach, I'm going to use all timeouts to teach.\""}
{"game_id": "0021700048", "chunk_id": "0021700048_023", "order": 23, "role": "body", "text": "Kings: Joerger said he has known Triano for some time via basketball circles. \"He's an incredible basketball mind,\" Joerger said. ... G-F Vince Carter became the sixth NBA player to play against the Suns in his 20th season or later. ... Sacramento got 78 points from its reserves."}
{"game_id": "0021700048", "chunk_id": "0021700048_024", "order": 24, "role": "body", "text": "Suns: Triano got a quick embrace from Carter just before tipoff. The two were together in Toronto 14 seasons ago. ... F Jared Dudley saw his first action of the season, playing five minutes."}
{"game_id": "0021700048", "chunk_id": "0021700048_026", "order": 26, "role": "body", "text": "Kings: Host New Orleans on Thursday."}
{"game_id": "0021700048", "chunk_id": "0021700048_027", "order": 27, "role": "closing", "text": "Suns: Host Utah on Wednesday night."}
