{"game_id": "0021700608", "chunk_id": "0021700608_001", "order": 1, "role": "lead", "text": "HOUSTON --  With James Harden injured, the Houston Rockets are figuring out different ways to make up for the offense the league's leading scorer normally provides."}
{"game_id": "0021700608", "chunk_id": "0021700608_002", "order": 2, "role": "body", "text": "On Wednesday night, that meant Chris Paul took 29 shots and finished with a season-high 37 points to help the Rockets to a 121-112 win over the Portland Trail Blazers."}
{"game_id": "0021700608", "chunk_id": "0021700608_003", "order": 3, "role": "body", "text": "Paul tied his career high for field-goal attempts in a regulation game. He took 33 shots and scored 42 points in a double-overtime game with New Orleans in 2008."}
{"game_id": "0021700608", "chunk_id": "0021700608_004", "order": 4, "role": "body", "text": "His 37 points were the most by a Rocket besides Harden since Jeremy Lin had 38 against San Antonio on Dec. 10, 2012."}
{"game_id": "0021700608", "chunk_id": "0021700608_005", "order": 5, "role": "body", "text": "Paul, who made 13 field goals, was asked if he realized he'd come close to taking the most shots in his career."}
{"game_id": "0021700608", "chunk_id": "0021700608_006", "order": 6, "role": "body", "text": "\"I don't know,\" he said. \"It kind of felt like it. Like goodness. I missed a lot, too. That's what I'm mad about.\""}
{"game_id": "0021700608", "chunk_id": "0021700608_007", "order": 7, "role": "body", "text": "Portland coach Terry Stotts said Paul was tough to stop."}
{"game_id": "0021700608", "chunk_id": "0021700608_008", "order": 8, "role": "body", "text": "\"He was exceptional,\" Stotts said. \"He really controlled the game, like he can do. His shot-making was as good as I've seen.\""}
{"game_id": "0021700608", "chunk_id": "0021700608_009", "order": 9, "role": "body", "text": "Eric Gordon added 30 points as the Rockets withstood a late run to win their second straight."}
{"game_id": "0021700608", "chunk_id": "0021700608_010", "order": 10, "role": "body", "text": "The Blazers used a big run to cut a 14-point deficit to three with about three minutes left. Houston responded with a 6-2 run, capped by a 3-pointer from Paul, to make it 111-104 about a minute later."}
{"game_id": "0021700608", "chunk_id": "0021700608_011", "order": 11, "role": "body", "text": "Damian Lillard made a layup on the other end, but Paul cut through three defenders to make an off-balance layup to push the lead to 113-106."}
{"game_id": "0021700608", "chunk_id": "0021700608_012", "order": 12, "role": "body", "text": "The Blazers couldn't get the ball in after a timeout, Houston got the ball back and Clint Capela added two free throws to secure the victory."}
{"game_id": "0021700608", "chunk_id": "0021700608_013", "order": 13, "role": "body", "text": "The Rockets won their second straight and improved to 3-2 in five games without Harden, who is out for at least two weeks with a hamstring injury."}
{"game_id": "0021700608", "chunk_id": "0021700608_014", "order": 14, "role": "body", "text": "Lillard scored 29 after missing the last two games with a strained right calf, and C.J. McCollum added 24 points as the Blazers saw a three-game winning streak snapped."}
{"game_id": "0021700608", "chunk_id": "0021700608_015", "order": 15, "role": "body", "text": "Paul had 11 assists, seven rebounds and three steals, and Capela added 13 points with eight rebounds."}
{"game_id": "0021700608", "chunk_id": "0021700608_016", "order": 16, "role": "body", "text": "Gerald Green scored all of Houston's points in a 5-2 run that extended the lead to 103-89 midway through the fourth period. He finished with 12 points and has scored in double digits in seven straight games for the first time since 2015."}
{"game_id": "0021700608", "chunk_id": "0021700608_017", "order": 17, "role": "body", "text": "\"We're having to manufacture points in different ways,\" Paul said. \"Gerald continues to be great and be aggressive. ... James averages 30 and we're just doing it by committee.\""}
{"game_id": "0021700608", "chunk_id": "0021700608_018", "order": 18, "role": "body", "text": "Lillard scored the first seven points of an 11-0 spurt that got the Trail Blazers within 103-100 with about 3 1/2 minutes left."}
{"game_id": "0021700608", "chunk_id": "0021700608_019", "order": 19, "role": "body", "text": "Paul received a technical in that span for arguing about a foul called on P.J. Tucker."}
{"game_id": "0021700608", "chunk_id": "0021700608_020", "order": 20, "role": "body", "text": "The Rockets led by nine entering the fourth quarter and were up by 11 with about 7 1/2 minutes remaining after Gordon scored four points. He made a layup before missing a shot on the next possession, only to grab it with one hand and finish with a dunk that made it 98-87."}
{"game_id": "0021700608", "chunk_id": "0021700608_021", "order": 21, "role": "body", "text": "Portland's Ed Davis was called for a flagrant foul late in the third when he hit Tarik Black in the right eye as Black dunked. Black remained on the court for a couple of minutes before being helped to his feet and escorted to the locker room, holding a towel over his right eye. The team said he had an abrasion to his right eye and he'll miss Friday's game."}
{"game_id": "0021700608", "chunk_id": "0021700608_022", "order": 22, "role": "body", "text": "Paul made the free throw on that play, and Tucker added a layup after that to extend the lead to 84-74."}
{"game_id": "0021700608", "chunk_id": "0021700608_023", "order": 23, "role": "body", "text": "The Rockets led 55-45 at halftime."}
{"game_id": "0021700608", "chunk_id": "0021700608_025", "order": 25, "role": "body", "text": "Trail Blazers: Lillard had eight assists and five rebounds and made 10 of 12 free throws. ... Portland had six blocks, led by Jusuf Nurkic's three."}
{"game_id": "0021700608", "chunk_id": "0021700608_026", "order": 26, "role": "body", "text": "Rockets: Black tied a season high with 13 points. ... Nene missed his fourth straight game with a bruised right knee. ... Gordon has scored 20 or more points in 21 games this season after doing so in only 19 games last season."}
{"game_id": "0021700608", "chunk_id": "0021700608_028", "order": 28, "role": "body", "text": "Gordon's teammates were impressed with his dunk in the fourth quarter. Paul called it \"sick.\""}
{"game_id": "0021700608", "chunk_id": "0021700608_029", "order": 29, "role": "body", "text": "\"I surprise myself sometimes,\" Gordon said with a laugh. \"When I saw it floating in the air, I just went after it.\""}
{"game_id": "0021700608", "chunk_id": "0021700608_031", "order": 31, "role": "body", "text": "Lillard on being unable to combat Houston's runs: \"When you're dealing with a team that shoots 3s as much as them and as well, you can't give them extra possessions and I thought we did that on too many occasions.\""}
{"game_id": "0021700608", "chunk_id": "0021700608_033", "order": 33, "role": "body", "text": "Trail Blazers: Visit New Orleans on Friday."}
{"game_id": "0021700608", "chunk_id": "0021700608_034", "order": 34, "role": "body", "text": "Rockets: Visit Phoenix on Friday."}
{"game_id": "0021700608", "chunk_id": "0021700608_036", "order": 36, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
