{"game_id": "0021700034", "chunk_id": "0021700034_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  After scoring a career-high 44 points, Giannis Antetokounmpo wrote a note on the game ball."}
{"game_id": "0021700034", "chunk_id": "0021700034_002", "order": 2, "role": "body", "text": "\"This is for daddy. We got a win tonight,\" the 22-year-old Milwaukee Bucks player said, remembering his father, Charles, who died last month at age 54."}
{"game_id": "0021700034", "chunk_id": "0021700034_003", "order": 3, "role": "body", "text": "Antetokounmpo scored 17 points in the fourth quarter, including a dunk that put Milwaukee ahead 111-110 with 11 seconds to go."}
{"game_id": "0021700034", "chunk_id": "0021700034_004", "order": 4, "role": "body", "text": "After a timeout, Damian Lillard found Jusuf Nurkic running open down the lane, but Antetokounmpo blocked his shot at the basket, sending the 7-foot center crashing to the floor."}
{"game_id": "0021700034", "chunk_id": "0021700034_005", "order": 5, "role": "body", "text": "Antetokounmpo, starting his fifth NBA season, made 17 of 23 shots with eight rebounds and four assists as Milwaukee kept pace with a Portland team that had dominated its first two opponents. The Bucks star is averaging 38.3 points through three games, up from 22.9 last year, 16.9 in 2015-16 and 12.7 in 2014-15."}
{"game_id": "0021700034", "chunk_id": "0021700034_006", "order": 6, "role": "body", "text": "\"Seventy-nine more. This is just the beginning,\" he said, thinking about how many regular-season games remain."}
{"game_id": "0021700034", "chunk_id": "0021700034_007", "order": 7, "role": "body", "text": "After Nurkic was rejected at the basket, Khris Middleton was fouled and made both free throws."}
{"game_id": "0021700034", "chunk_id": "0021700034_008", "order": 8, "role": "body", "text": "\"They committed two guys to Dame, so somebody was going to be open,\" Portland coach Terry Stotts said, referring to Lillard. \"Turned out to be Nurk but they made a really good defensive play.\""}
{"game_id": "0021700034", "chunk_id": "0021700034_009", "order": 9, "role": "body", "text": "Lillard scored 26 points, including 16 in the fourth quarter. CJ McCollum also scored 26, and Nurkic had 17 points and 11 rebounds. Tony Snell scored 17 points and Middleton added 16 for Milwaukee."}
{"game_id": "0021700034", "chunk_id": "0021700034_010", "order": 10, "role": "body", "text": "Portland trailed 108-101 when Nurkic sparked a 9-1 run with a pair of baskets. Lillard made a 3-pointer and then a pair of free throws to put the Blazers ahead 110-109 with 57 seconds left."}
{"game_id": "0021700034", "chunk_id": "0021700034_011", "order": 11, "role": "body", "text": "\"I wish I could replay it, but it's tough when you lose,\" Nurkic said."}
{"game_id": "0021700034", "chunk_id": "0021700034_012", "order": 12, "role": "body", "text": "Milwaukee used an 11-4 run midway through the fourth quarter to open a 106-99 lead on Malcolm Brogdon's fast-break layup off a bounce pass from Antetokounmpo."}
{"game_id": "0021700034", "chunk_id": "0021700034_014", "order": 14, "role": "body", "text": "Portland's Evan Turner spent much of his 32 minutes on the court attempting to guard Antetokounmpo. \"I was comfortable with everything,\" Turner said. \"If I made him take 10 dribbles in the post, made him spin two or three times and he makes the shot, there's nothing you can ask for. He got on a roll, hit some jumpers, had a great night. I guarded him the same way every time.\""}
{"game_id": "0021700034", "chunk_id": "0021700034_016", "order": 16, "role": "body", "text": "The game had 10 lead changes and was tied 15 times."}
{"game_id": "0021700034", "chunk_id": "0021700034_018", "order": 18, "role": "body", "text": "Portland made 11 of 27 3-point attempts. Milwaukee had 54 points in the paint to the Blazers' 26."}
{"game_id": "0021700034", "chunk_id": "0021700034_020", "order": 20, "role": "body", "text": "Trail Blazers: Stotts was the Bucks' coach from 2005-07 and was an assistant from 1998-02."}
{"game_id": "0021700034", "chunk_id": "0021700034_021", "order": 21, "role": "body", "text": "Bucks: C Greg Monroe's foul on Cleveland G Derrick Rose on Friday night was upgraded by the league to a flagrant 1 from a common foul."}
{"game_id": "0021700034", "chunk_id": "0021700034_023", "order": 23, "role": "body", "text": "Trail Blazers: Portland plays its home opener Tuesday against New Orleans."}
{"game_id": "0021700034", "chunk_id": "0021700034_024", "order": 24, "role": "body", "text": "Bucks: Milwaukee is home against Charlotte on Monday."}
{"game_id": "0021700034", "chunk_id": "0021700034_026", "order": 26, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
