{"game_id": "0021300015", "chunk_id": "0021300015_001", "order": 1, "role": "lead", "text": "PHOENIX --  The double-point guard backcourt got off to a fast start for the Phoenix Suns and sent Jeff Hornacek away a winner in his first game as an NBA coach."}
{"game_id": "0021300015", "chunk_id": "0021300015_002", "order": 2, "role": "body", "text": "Goran Dragic scored 26 points and Eric Bledsoe added 22, leading the Phoenix Suns to a 104-91 victory over the Portland Trail Blazers Wednesday night."}
{"game_id": "0021300015", "chunk_id": "0021300015_003", "order": 3, "role": "body", "text": "\"We always thought that was an advantage, having those two guys,\" Hornacek said. \"One guy is not going, we put the other guy in the pick and roll. Obviously, they both played great.\""}
{"game_id": "0021300015", "chunk_id": "0021300015_004", "order": 4, "role": "body", "text": "The Suns' Miles Plumlee, who scored a total of 13 points in 55 minutes on the court as a rookie for Indiana last season, had 18 points and 15 rebounds in his first NBA start."}
{"game_id": "0021300015", "chunk_id": "0021300015_005", "order": 5, "role": "body", "text": "\"Things kind of went my way to begin,\" he said, \"and the confidence just kept going.\""}
{"game_id": "0021300015", "chunk_id": "0021300015_006", "order": 6, "role": "body", "text": "P.J. Tucker also scored 18, all but two in the second half, for Phoenix."}
{"game_id": "0021300015", "chunk_id": "0021300015_007", "order": 7, "role": "body", "text": "Damian Lillard scored 32 points, including 6 of 12 3-pointers, for the Trail Blazers. LaMarcus Aldridge added 28."}
{"game_id": "0021300015", "chunk_id": "0021300015_008", "order": 8, "role": "body", "text": "\"They came out and they kind of shocked us,\" Lillard said. \"They played at a real fast pace and their guards finished some tough shots."}
{"game_id": "0021300015", "chunk_id": "0021300015_009", "order": 9, "role": "body", "text": "\"They kind of got us out of position with that pace they played at. It was tough to guard them and it wasn't a help that we got off to a slow offensive start.\""}
{"game_id": "0021300015", "chunk_id": "0021300015_010", "order": 10, "role": "body", "text": "Portland fell behind by 16 in the first half and 17 in the second before getting within five with 3:15 left."}
{"game_id": "0021300015", "chunk_id": "0021300015_011", "order": 11, "role": "body", "text": "Lillard made his final 3 of the night, then after a Phoenix turnover Robin Lopez made one of two free throws to cut Phoenix's lead to 96-91, but Dragic made a pair of jumpers and the Suns pulled away, scoring the final eight points of the game."}
{"game_id": "0021300015", "chunk_id": "0021300015_012", "order": 12, "role": "body", "text": "\"I got a little worried there when it got down to five, especially with a young team to see how they react,\" Hornacek said, \"but they made a couple of nice stops. That is key for us. When we get tops, we are able to fast break.\""}
{"game_id": "0021300015", "chunk_id": "0021300015_013", "order": 13, "role": "body", "text": "Dragic and Bledsoe combined for 48 points, 15 assists and 13 rebounds."}
{"game_id": "0021300015", "chunk_id": "0021300015_014", "order": 14, "role": "body", "text": "\"He had it going, I had it going and whoever was closest to the ball was going to get it,\" Bledsoe said."}
{"game_id": "0021300015", "chunk_id": "0021300015_015", "order": 15, "role": "body", "text": "Phoenix has just four players from last season's 25-57 team. Bledsoe came in the trade that sent Jared Dudley to the Los Angeles Clippers. Plumlee was part of the Luis Scola trade with Indiana."}
{"game_id": "0021300015", "chunk_id": "0021300015_016", "order": 16, "role": "body", "text": "The Suns used an early 14-2 run to go up 25-12. A goaltending call on Dragic's layup after a Portland turnover made it 29-15."}
{"game_id": "0021300015", "chunk_id": "0021300015_017", "order": 17, "role": "body", "text": "Gerald Green's 17-footer for the first basket of the second quarter gave Phoenix a 32-16 lead."}
{"game_id": "0021300015", "chunk_id": "0021300015_018", "order": 18, "role": "body", "text": "Lillard finished the quarter with three straight 3s, the last at the buzzer, in a 9-2 spurt that reduced the Suns' advantage to 50-46 at the break."}
{"game_id": "0021300015", "chunk_id": "0021300015_019", "order": 19, "role": "body", "text": "Portland cut it to 52-51 on Nicolas Batum's basket with 9:54 left in the third quarter, but 3s by Channing Frye and Dragic ignited a 12-0 run, with all five Suns players scoring, to increase the lead to 64-51 on Bledsoe's layup after Frye's steal."}
{"game_id": "0021300015", "chunk_id": "0021300015_020", "order": 20, "role": "body", "text": "Consecutive baskets by Marcus Morris gave Phoenix its biggest lead, 81-64, with 1:01 left in the third."}
{"game_id": "0021300015", "chunk_id": "0021300015_021", "order": 21, "role": "body", "text": "Dragic was called for a foul on Dorell Wright's 3-point attempt with 5.4 seconds left in the quarter. Wright made all three, so Phoenix was up 81-69 entering the fourth."}
{"game_id": "0021300015", "chunk_id": "0021300015_022", "order": 22, "role": "body", "text": "\"All the things that we've been working on, we had a setback today,\" Trail Blazers coach Terry Stotts said. \"Transition defense, we were slow reacting to that. Their guards did a good job of penetrating and we gave up too many shots at the end.\""}
{"game_id": "0021300015", "chunk_id": "0021300015_023", "order": 23, "role": "body", "text": "Frye got the start because Markieff Morris was suspended for the game for throwing an elbow at Serge Ibaka in a preseason game."}
{"game_id": "0021300015", "chunk_id": "0021300015_024", "order": 24, "role": "body", "text": "Frye missed all of last season because of an enlarged heart. He was in foul trouble much of the night and finished with seven points."}
{"game_id": "0021300015", "chunk_id": "0021300015_025", "order": 25, "role": "closing", "text": "Game notes Frye hit the Suns' first 3-pointer of the season in the third quarter after they had missed their first nine. ... Portland will be without first-round draft pick C.J. McCollum for several weeks after he underwent foot surgery. The Blazers' other first-round pick, Allen Crabbe, did not play. ... Plumlee's career high at Duke was 19 points. ... Portland plays at Denver on Friday, then plays its home opener Saturday against San Antonio."}
