{"game_id": "0021401038", "chunk_id": "0021401038_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- The best part of Russell Westbrook's game on Sunday might have been his defense on Dwyane Wade. And that says a lot about his work on Wade.\nWestbrook had 12 points, 10 rebounds and 17 assists for his second consecutive triple-double, leading the Oklahoma City Thunder to a 93-75 victory over the Miami Heat.\nEnes Kanter had 27 points and 12 rebounds for Oklahoma City, which has won three in a row. Rookie Mitch McGary scored 14 points, and Anthony Morrow had 12."}
{"game_id": "0021401038", "chunk_id": "0021401038_002", "order": 2, "role": "closing", "text": "Kanter was expected to miss his second straight game with an ankle injury. But he was cleared to play after morning shootaround, and then got off to a fast start with 15 points in the first quarter.\n\"I really wanted to play this one. It was hurting and I wasn't a 100 percent,\" Kanter said. \"The scoring was nice, but I think the defense was the key. We're communicating better and the pick and roll coverage is so much better than it has been.\"\nWestbrook committed six turnovers in his 10th triple-double of the season, but also had four steals and blocked two shots. The 17 assists matched a career high for the All-Star, one of the leading contenders for the NBA MVP award.\nWestbrook also helped shut down Wade after he made his first four shots. Wade finished with 12 points on 6-for-15 shooting.\n\"Just denying, making it tough for him,\" Westbrook said. \"He got going early, but as a team we did a good job after that of making him shoot tough shots.\"\nThe Thunder held Miami to a season-low point total, while failing to score 100 points themselves for the first time since January 31.\nThe Heat had five players score in double figures. Hassan Whiteside had 13 points, all in the first half, and Goran Dragic and Mario Chalmers each scored 12.\nMiami had won three in a row.\n\"It was just the level of competition. They kept coming in waves,\" Heat coach Eric Spoelstra said. \"You have two teams in an urgent situation and they played like it and we didn't.\"\nThe Thunder carried a 66-58 lead into the fourth quarter, and then outscored the Heat 27-17 in the final period. Kanter had four points in a 13-2 run that made it 79-62 with 7:49 left.\nMiami shot 39.5 percent from the field, compared to 44 percent for Oklahoma City. The Heat also were outrebounded 52-40.\n\"This team just played more desperate than us,\" Wade said. \"They played at a playoff level and we played at a regular-season level and that's the difference of the game.\"\nCAN'T WAIT\nOklahoma City star Kevin Durant is recovering from a foot injury and is supposed to avoid all basketball-related activities. But during several timeouts, Durant stepped onto the court in street clothes, shooting layups and working on his dribbling with the game ball.\nNO ROAD HEAT\nMiami has dropped four straight road games. It is 15-19 on the road this season.\nTIP-INS\nHeat: Miami's reserves were a combined 10 for 34 from the floor. ... Whiteside was 5 for 5 in the first half, but missed his only shot of the second half and was hampered by foul trouble for much of the final two periods.\nThunder: G Andre Roberson sprained his left ankle in the first quarter and did not return.\nUP NEXT\nHeat: Visit the Bucks on Tuesday.\nThunder: Host the Lakers on Tuesday."}
