{"game_id": "0021701053", "chunk_id": "0021701053_001", "order": 1, "role": "lead", "text": "NEW YORK --  The Brooklyn Nets proved supreme in another showdown with one of the NBA's worst teams."}
{"game_id": "0021701053", "chunk_id": "0021701053_002", "order": 2, "role": "body", "text": "Allen Crabbe and Caris LeVert each scored 22 points and the Nets beat the Memphis Grizzlies 118-115 on Monday night."}
{"game_id": "0021701053", "chunk_id": "0021701053_003", "order": 3, "role": "body", "text": "Rondae Hollis-Jefferson had 16 points and 12 rebounds, and DeMarre Carroll scored nine of his 18 points in the fourth quarter for the Nets, who have two straight wins for the first time since Jan. 19-21. They won Saturday over Dallas."}
{"game_id": "0021701053", "chunk_id": "0021701053_004", "order": 4, "role": "body", "text": "\"He's just a tough winner. It's just who he is,\" said Nets coach Kenny Atkinson of Carroll's effort."}
{"game_id": "0021701053", "chunk_id": "0021701053_005", "order": 5, "role": "body", "text": "\"He's not a take-over-the-game guy. He does what it necessary to win a ballgame. I thought his will helped us.\""}
{"game_id": "0021701053", "chunk_id": "0021701053_006", "order": 6, "role": "body", "text": "Andrew Harrison, who missed Memphis' last nine games due to a right wrist injury, scored 14 of his 19 points in the second half but missed a potential tying 3-pointer before the final buzzer. The Grizzlies have lost 20 of 21."}
{"game_id": "0021701053", "chunk_id": "0021701053_007", "order": 7, "role": "body", "text": "\"I should have pushed the ball up,\" said Harrison, who was playing for the first time since Feb. 28. \"It's all one me. All on me.\""}
{"game_id": "0021701053", "chunk_id": "0021701053_008", "order": 8, "role": "body", "text": "Brionte Webber had a career-high 15 points for the Grizzlies, who were without Marc Gasol due to flu-like symptoms. The team has lost 15 straight games on the road since a New Year's Eve victory at Sacramento."}
{"game_id": "0021701053", "chunk_id": "0021701053_009", "order": 9, "role": "body", "text": "Brooklyn trailed 94-87 heading into the fourth quarter before turning it around against the Grizzlies, who dropped to 19-51, one game behind league-worst Phoenix, who had the night off."}
{"game_id": "0021701053", "chunk_id": "0021701053_010", "order": 10, "role": "body", "text": "Carroll capped a string of three straight 3s to tie it at 97 with 8:45 remaining in the final period. After a three-second defensive technical free throw by Harrison gave the Grizzlies a 101-100 lead with 6:54 left, the Nets scored nine straight points highlighted by LeVert's dunk with 4:07 left to lead 109-101."}
{"game_id": "0021701053", "chunk_id": "0021701053_011", "order": 11, "role": "body", "text": "Crabbe increased Brooklyn's advantage 116-108 with 38 seconds left, but Memphis made it interesting despite having a bevy of guys on the floor that might not have had the opportunity if not for the team's current state."}
{"game_id": "0021701053", "chunk_id": "0021701053_012", "order": 12, "role": "body", "text": "\"You can watch all the film that you want to, you can watch all the NBA basketball you want,\" interim coach J.B. Bickertstaff said. \"But until you're in that moment and the pressure is on you and you feel your heart beat a little bit faster, the game is moving a little bit faster, until you learn how to play in those moments and slow those moments down in your mind, until you go through it, you won't learn. So, it's invaluable the education our guys are getting.\""}
{"game_id": "0021701053", "chunk_id": "0021701053_013", "order": 13, "role": "body", "text": "Wayne Selden Jr., who scored 17 points off the bench, hit a 3, and JaMychal Green made a layup to make it 117-115 with 12 seconds left. Spencer Dinwiddie then hit a free throw to extend the Nets' lead to 118-115 with 11 seconds to go before Harrison missed a potential tying 3 with 0.4 seconds remaining."}
{"game_id": "0021701053", "chunk_id": "0021701053_015", "order": 15, "role": "body", "text": "Grizzlies: Tyreke Evans (inactive) did not play. He was replaced by Harrison in the starting lineup. ... Deyonta Davis started at center in place of Gasol. It was just his third start of the season. ... Green had a double-double with 14 points and 16 rebounds. . Memphis had seven players score in double figures. Dillon Brooks had 15 points and Chandler Parsons added 13. Ivan Rabb had 10 points."}
{"game_id": "0021701053", "chunk_id": "0021701053_016", "order": 16, "role": "body", "text": "Nets: Crabbe moved into second place for the most 3-pointers in a season by a player in franchise history. His first 3-pointer of the night gave him 163, passing Joe Johnson. The 25-year-old is now three shy of Deron Williams' record of 169 set during the 2012-13 season."}
{"game_id": "0021701053", "chunk_id": "0021701053_018", "order": 18, "role": "body", "text": "Grizzlies: Continue their three-game trip at Philadelphia on Wednesday night."}
{"game_id": "0021701053", "chunk_id": "0021701053_019", "order": 19, "role": "body", "text": "Nets: Host Charlotte on Wednesday night to close their three-game homestand."}
{"game_id": "0021701053", "chunk_id": "0021701053_021", "order": 21, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
