{"game_id": "0021700439", "chunk_id": "0021700439_001", "order": 1, "role": "lead", "text": "NEW YORK --  Indiana Pacers coach Nate McMillan came into the season trying to figure out just what kind of contribution he would get from Victor Oladipo after he arrived in a trade for one the NBA's best two-way players in Paul George."}
{"game_id": "0021700439", "chunk_id": "0021700439_002", "order": 2, "role": "body", "text": "The second overall pick in the 2013 draft has met McMillan's expectations after spending the previous two seasons in Orlando and Oklahoma City."}
{"game_id": "0021700439", "chunk_id": "0021700439_003", "order": 3, "role": "body", "text": "Oladipo scored 26 points, reserve Domantas Sabonis had 17 and the Pacers beat the Brooklyn Nets 109-97 on Sunday night."}
{"game_id": "0021700439", "chunk_id": "0021700439_004", "order": 4, "role": "body", "text": "\"He's a guy we're trying to develop into a franchise player. He's come in with a lot of confidence,\" McMillan said. \"This year is really about developing our young guys and seeing what these guys are capable of doing. He's doing some good things.\""}
{"game_id": "0021700439", "chunk_id": "0021700439_005", "order": 5, "role": "body", "text": "Myles Turner added 16 points, Cory Joseph chipped in 15 and Darren Collison scored 14 for the Pacers."}
{"game_id": "0021700439", "chunk_id": "0021700439_006", "order": 6, "role": "body", "text": "The Nets' Allen Crabbe shook off his recent struggles, scoring 17 points in the first half on 5-for-7 shooting, including four 3s. He took only one shot and didn't score in the second half."}
{"game_id": "0021700439", "chunk_id": "0021700439_007", "order": 7, "role": "body", "text": "\"I don't think they did anything differently defensively. I don't know,\" Crabbe said of his quiet second half."}
{"game_id": "0021700439", "chunk_id": "0021700439_008", "order": 8, "role": "body", "text": "Trailing by one at the end of the opening quarter, the Pacers got a jolt from Oladipo, the team's leading scorer at 24.5 points per game."}
{"game_id": "0021700439", "chunk_id": "0021700439_009", "order": 9, "role": "body", "text": "After Crabbe's 3-pointer cut the lead to 51-45 with 2:25 left in the first half, Oladipo reeled off eight straight points for a 59-48 advantage at the end of the second period."}
{"game_id": "0021700439", "chunk_id": "0021700439_010", "order": 10, "role": "body", "text": "When Brooklyn drew within five points in the beginning of the fourth quarter, Indiana's summer acquisition capped a 10-3 run with five consecutive points, landing an alley-oop dunk that drew the attention of the Barclays Center crowd."}
{"game_id": "0021700439", "chunk_id": "0021700439_011", "order": 11, "role": "body", "text": "Indiana snapped a two-game losing streak, including a 100-95 loss in George's return on Wednesday."}
{"game_id": "0021700439", "chunk_id": "0021700439_012", "order": 12, "role": "body", "text": "\"I think we did a good job of getting stops, finishing possessions with rebounds and then doing our plays. We've got to do it in that order,\" Oladipo said. \"The past couple of games we've kind of been doing one step before the other. I think we did a great job of settling down, playing our pace, and getting stops down the stretch.\""}
{"game_id": "0021700439", "chunk_id": "0021700439_013", "order": 13, "role": "body", "text": "Quincy Acy, Caris LeVert and Joe Harris each had 14 points in Brooklyn's third straight loss."}
{"game_id": "0021700439", "chunk_id": "0021700439_014", "order": 14, "role": "body", "text": "Nets coach Kenny Atkinson thought his team was outworked as it was in those previous two games."}
{"game_id": "0021700439", "chunk_id": "0021700439_015", "order": 15, "role": "body", "text": "\"I just felt like the whole game ... whatever that `it' is in terms of energy and physicality, it hasn't been there,\" Atkinson said."}
{"game_id": "0021700439", "chunk_id": "0021700439_016", "order": 16, "role": "body", "text": "The second meeting of the season between these teams lacked the offensive spark of their first matchup, which Indiana won 140-131."}
{"game_id": "0021700439", "chunk_id": "0021700439_017", "order": 17, "role": "body", "text": "The Pacers led by 14 with 7:08 remaining in the fourth quarter before Rondae Hollis-Jefferson and LeVert combined for a 6-0 run in little over a minute to close the gap to 94-86."}
{"game_id": "0021700439", "chunk_id": "0021700439_018", "order": 18, "role": "body", "text": "Indiana then bounced back with eight straight points, including a basket by Joseph that led to a technical foul on Atkinson."}
{"game_id": "0021700439", "chunk_id": "0021700439_020", "order": 20, "role": "body", "text": "Brooklyn native Lance Stephenson, who broke into the league along with George in 2010, has enjoyed seeing the growth Oladipo has shown in 29 games."}
{"game_id": "0021700439", "chunk_id": "0021700439_021", "order": 21, "role": "body", "text": "\"Vic is playing amazing. He's living up to the high expectations,\" said the Lincoln High School product, who was chosen by the Pacers in the second round of the draft."}
{"game_id": "0021700439", "chunk_id": "0021700439_022", "order": 22, "role": "body", "text": "\"He's here early for practice. He's being a leader. He's showing it on and off the court.\""}
{"game_id": "0021700439", "chunk_id": "0021700439_024", "order": 24, "role": "body", "text": "Pacers: Have won their last five games against Brooklyn. ... Indiana has won 13 of its last 17 regular-season games against the Nets dating to 2013."}
{"game_id": "0021700439", "chunk_id": "0021700439_025", "order": 25, "role": "body", "text": "Nets: Brooklyn waived guard Yakuba Outtara. He was signed to a two-way contract on July 21. ... According to various reports, the Nets are expected to sign guard Milton Doyle to their vacant two-way contract spot on their roster. Doyle was waived before the season but has been playing for the Long Island Nets, the team's G-League affiliate. He's averaged 21.3 points and shot 43.3 percent from the field in 17 games."}
{"game_id": "0021700439", "chunk_id": "0021700439_027", "order": 27, "role": "body", "text": "Pacers: Host the Boston Celtics on Monday night."}
{"game_id": "0021700439", "chunk_id": "0021700439_028", "order": 28, "role": "body", "text": "Nets: Host the Sacramento Kings on Wednesday night."}
{"game_id": "0021700439", "chunk_id": "0021700439_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
