{"game_id": "0021700060", "chunk_id": "0021700060_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Paul George scored just 10 points against his former team, and it was the kind of game he had longed for."}
{"game_id": "0021700060", "chunk_id": "0021700060_002", "order": 2, "role": "body", "text": "Russell Westbrook's triple-double picked up the slack and helped the Oklahoma City Thunder beat the Indiana Pacers 114-96 on Wednesday night."}
{"game_id": "0021700060", "chunk_id": "0021700060_003", "order": 3, "role": "body", "text": "The Pacers traded George to Oklahoma City after it became public knowledge that he didn't plan on staying with the team long-term. George, a four-time All-Star while he was with the Pacers, savored being able to have an off night while his team still won comfortably. Westbrook finished with 28 points, 16 assists and 10 rebounds and Carmelo Anthony had 28 points and 10 rebounds for the Thunder to take the pressure off George."}
{"game_id": "0021700060", "chunk_id": "0021700060_004", "order": 4, "role": "body", "text": "\"That hasn't happened often in my career,\" George said. \"Fortunate to have those guys carry me. They know how big this game was for me, and they went out and got it for me.\""}
{"game_id": "0021700060", "chunk_id": "0021700060_005", "order": 5, "role": "body", "text": "George rarely fouls out, but he committed his sixth with 6:15 remaining after playing just 19 minutes."}
{"game_id": "0021700060", "chunk_id": "0021700060_006", "order": 6, "role": "body", "text": "\"It's a coincidence, right?\" George said. \"I don't know what was the cause. It was an agenda tonight.\""}
{"game_id": "0021700060", "chunk_id": "0021700060_007", "order": 7, "role": "body", "text": "Steven Adams added 17 points and 11 rebounds for the Thunder, who snapped a two-game skid."}
{"game_id": "0021700060", "chunk_id": "0021700060_008", "order": 8, "role": "body", "text": "Victor Oladipo and Domantas Sabonis, who were sent from Oklahoma City to Indiana as part of the George deal, both started against their former team. Oladipo scored 35 points on 11 for 18 shooting."}
{"game_id": "0021700060", "chunk_id": "0021700060_009", "order": 9, "role": "body", "text": "Oladipo downplayed facing the Thunder."}
{"game_id": "0021700060", "chunk_id": "0021700060_010", "order": 10, "role": "body", "text": "\"Yeah, just another game, man,\" Oladipo said. \"We have to go out and try to win. Unfortunately we came up short.\""}
{"game_id": "0021700060", "chunk_id": "0021700060_011", "order": 11, "role": "body", "text": "Oladipo increased his scoring average to 26 points per game. He has thrived in coach Nate McMillan's up-tempo offense."}
{"game_id": "0021700060", "chunk_id": "0021700060_012", "order": 12, "role": "body", "text": "\"Vic's been playing really well for us,\" said Pacers guard Darren Collison, who scored 18 points. \"He has a good flow. It's good to have a player like that, that can get it going the way he's been getting it going. Hopefully we get some wins with that and make us productive.\""}
{"game_id": "0021700060", "chunk_id": "0021700060_013", "order": 13, "role": "body", "text": "The Thunder led 54-48 at halftime behind 15 points from Anthony and 11 points and 10 assists from Westbrook. Oladipo scored 21 points before the break."}
{"game_id": "0021700060", "chunk_id": "0021700060_014", "order": 14, "role": "body", "text": "Oklahoma City got it going early in the second half. A 3-pointer by Josh Huestis put the Thunder ahead 70-57. A driving layup by Westbrook expanded the lead to 82-66 with about three minutes left in the period."}
{"game_id": "0021700060", "chunk_id": "0021700060_015", "order": 15, "role": "body", "text": "Westbrook had eight rebounds when he sat down to rest late in the third. He returned in the fourth period and grabbed his 10th rebound with just under five minutes remaining."}
{"game_id": "0021700060", "chunk_id": "0021700060_016", "order": 16, "role": "body", "text": "\"He was great tonight,\" Thunder coach Billy Donovan said. \"Overall, I felt like he surveyed and managed the game and the floor, moving guys around. He did an exceptional job.\""}
{"game_id": "0021700060", "chunk_id": "0021700060_018", "order": 18, "role": "body", "text": "Pacers: The Oklahoma City crowd greeted Oladipo and Sabonis warmly during pregame introductions. ... Sabonis got his fourth straight start at center in place of Myles Turner, who was out again with a concussion and a sore neck. Sabonis finished with four points. ... Indiana was coming off a 130-107 win at Minnesota on Tuesday night. ... McMillan was issued a technical foul early in the fourth period."}
{"game_id": "0021700060", "chunk_id": "0021700060_019", "order": 19, "role": "body", "text": "Thunder: Anthony made a layup at the buzzer to end the first period. ... Rookie G Terrance Ferguson played in the fourth period. He sat out Sunday's game against Minnesota with a sprained left ankle."}
{"game_id": "0021700060", "chunk_id": "0021700060_021", "order": 21, "role": "body", "text": "Oladipo, when asked if he was comfortable at Chesapeake Energy Arena: \"I'm comfortable on this team.\""}
{"game_id": "0021700060", "chunk_id": "0021700060_023", "order": 23, "role": "body", "text": "Adams has made 24 of 36 shots this season after having ranked among the league leaders in field goal percentage last season. He is averaging 13.8 points and 8.5 rebounds per game."}
{"game_id": "0021700060", "chunk_id": "0021700060_025", "order": 25, "role": "body", "text": "Pacers: Indiana hosts the San Antonio Spurs on Sunday."}
{"game_id": "0021700060", "chunk_id": "0021700060_026", "order": 26, "role": "body", "text": "Thunder: Visits the Minnesota Timberwolves on Friday. Minnesota's Andrew Wiggins banked in a buzzer beater from near half-court to beat the Thunder 115-113 last Sunday."}
{"game_id": "0021700060", "chunk_id": "0021700060_028", "order": 28, "role": "body", "text": "Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP"}
{"game_id": "0021700060", "chunk_id": "0021700060_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
