{"game_id": "0021701049", "chunk_id": "0021701049_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  Maurice Harkless thinks he sees something pleasantly repetitive about the Portland Trail Blazers' 13-game winning streak."}
{"game_id": "0021701049", "chunk_id": "0021701049_002", "order": 2, "role": "body", "text": "\"Every time a team tries to go on a run, we always bounce back,\" Harkless said."}
{"game_id": "0021701049", "chunk_id": "0021701049_003", "order": 3, "role": "body", "text": "There was more of that Sunday night, with the Blazers jumping out to double-digits leads and the desperate Los Angeles Clippers trying to put a run together, only for Portland to bounce back and roll to a 122-109 victory."}
{"game_id": "0021701049", "chunk_id": "0021701049_004", "order": 4, "role": "body", "text": "Even Portland stars Damian Lillard (23 points) and CJ McCollum (21) can sense a change among the Blazers."}
{"game_id": "0021701049", "chunk_id": "0021701049_005", "order": 5, "role": "body", "text": "\"In the past when teams have made a run, I've tried to go out there and will us in the right way, or CJ will try,\" Lillard said. \"But this year, we're leaning on each other. We trust in each other and guys are coming through. We're getting guys hitting big shots, big steals, big defense, hitting big free throws. We're just trusting in it more and more.\""}
{"game_id": "0021701049", "chunk_id": "0021701049_006", "order": 6, "role": "body", "text": "Portland's dynamic guard duo led five Blazers players in double-figures, with Harkless scoring 21 points, Jusuf Nurkic 17 along with 12 rebounds and Al-Farouq Aminu adding 16 points."}
{"game_id": "0021701049", "chunk_id": "0021701049_007", "order": 7, "role": "body", "text": "It was all too much for a Clippers team that dropped a third consecutive game and fell two games back of the final playoff spot in the Western Conference. The Clippers have 13 games remaining."}
{"game_id": "0021701049", "chunk_id": "0021701049_008", "order": 8, "role": "body", "text": "\"They played last night and you couldn't tell,\" Clippers coach Doc Rivers said of the Blazers. \"They played hard. I thought they played better than us, which I don't say very often. We got attacked all night on both ends of the court and then everybody made shots for them.\""}
{"game_id": "0021701049", "chunk_id": "0021701049_009", "order": 9, "role": "body", "text": "Lou Williams led the Clippers with 30 points. Montrezl Harrell had 24 points and DeAndre Jordan had 16 rebounds for Los Angeles. Austin Rivers' 15 points was the best of any Clippers starter."}
{"game_id": "0021701049", "chunk_id": "0021701049_010", "order": 10, "role": "body", "text": "\"Sometimes you've just got to have a sense of urgency and understand that if you drop a couple more games, now you're cutting it close,\" Austin Rivers said. \"We have 13 games left, so there's not too many more games that we can drop.\""}
{"game_id": "0021701049", "chunk_id": "0021701049_011", "order": 11, "role": "body", "text": "Portland went on a 12-0 run late in the second quarter, only for the Clippers to pull back within four points before trailing 58-52 at the half."}
{"game_id": "0021701049", "chunk_id": "0021701049_012", "order": 12, "role": "body", "text": "The Blazers put together a 10-0 run early in the third quarter and led 91-81 going into the fourth quarter. A jumper by Williams cut the lead to eight, but the Blazers led by double-digits the rest of the way, and the streak was 13."}
{"game_id": "0021701049", "chunk_id": "0021701049_013", "order": 13, "role": "body", "text": "\"I appreciate it,\" Portland coach Terry Stotts said. \"Enjoying it is tough. You get ready for the next game. You don't want to get comfortable. I think that's been one of our strengths as a team, coaches and players. We understand what time of year (it is) and what has to be done.\""}
{"game_id": "0021701049", "chunk_id": "0021701049_015", "order": 15, "role": "body", "text": "Trail Blazers: There were some grumblings by some on the Detroit side after Portland's win Sunday that the Blazers were playing a tad on the rough side, which amused Stotts: \"That could be the first time in my tenure that one of my teams has been accused of being overly physical. So I was pleased with those comments.\""}
{"game_id": "0021701049", "chunk_id": "0021701049_016", "order": 16, "role": "body", "text": "Clippers: F Danilo Gallinari remained out with a fractured right hand. There has been no medical update in a week, since the team said he had resumed running. He has also battled leg injuries and played in only 19 games this season. In a season when the Clippers have been ravaged with injury, Doc Rivers said his loss has been the most significant: \"Overall, of the guys we've missed, it's Gallo. It's not even close.\""}
{"game_id": "0021701049", "chunk_id": "0021701049_018", "order": 18, "role": "body", "text": "Trail Blazers: Return home to play Houston on Tuesday."}
{"game_id": "0021701049", "chunk_id": "0021701049_019", "order": 19, "role": "body", "text": "Clippers: Start a four-game road trip on Tuesday in Minnesota."}
{"game_id": "0021701049", "chunk_id": "0021701049_021", "order": 21, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
