{"game_id": "0021400446", "chunk_id": "0021400446_001", "order": 1, "role": "lead", "text": "MIAMI --  There were 11 instances in the second half where Memphis' once-burgeoning lead was almost gone, with Miami having closed within one or two points."}
{"game_id": "0021400446", "chunk_id": "0021400446_003", "order": 3, "role": "body", "text": "Bending but never breaking, the Grizzlies dug deep to snap their four-game slide. Mike Conley scored 24 points, Marc Gasol added 22 points and 10 rebounds, and the Grizzlies never trailed in a 103-95 win over the Heat on Saturday night."}
{"game_id": "0021400446", "chunk_id": "0021400446_004", "order": 4, "role": "body", "text": "\"Every time they got to one or two, I thought we executed pretty well,\" Memphis coach David Joerger said. \"We got stops when we needed to. ... If we play that way, we're going to win some games.\""}
{"game_id": "0021400446", "chunk_id": "0021400446_005", "order": 5, "role": "body", "text": "Beno Udrih scored 11 for the Grizzlies, who led by 19 early in the second half."}
{"game_id": "0021400446", "chunk_id": "0021400446_006", "order": 6, "role": "body", "text": "Dwyane Wade scored 25 points for Miami, which fell to 6-11 at home. Danny Granger scored a season-high 18 off the bench for the Heat, who got 16 from Luol Deng and 13 from Chris Andersen."}
{"game_id": "0021400446", "chunk_id": "0021400446_007", "order": 7, "role": "body", "text": "\"That's when you can grow the most, when you embrace the struggle, learn from it and get over that struggle,\" Heat coach Erik Spoelstra said. \"We're not quite there yet.\""}
{"game_id": "0021400446", "chunk_id": "0021400446_008", "order": 8, "role": "body", "text": "Tony Allen, Courtney Lee and Tayshaun Prince each scored 10 for Memphis."}
{"game_id": "0021400446", "chunk_id": "0021400446_009", "order": 9, "role": "body", "text": "The last few seconds before halftime couldn't have gone more to Memphis' liking."}
{"game_id": "0021400446", "chunk_id": "0021400446_010", "order": 10, "role": "body", "text": "Already up by 12, the Grizzlies got possession on a play where Wade dove to corral a loose ball near midcourt, his momentum taking him over the line for a backcourt violation. Spoelstra got a technical for arguing that Wade was fouled on the play, which led to a free throw from Conley."}
{"game_id": "0021400446", "chunk_id": "0021400446_011", "order": 11, "role": "body", "text": "And on the ensuing possession, Conley hit a 30-footer to beat the clock and send the Grizzlies into the break ahead 57-41."}
{"game_id": "0021400446", "chunk_id": "0021400446_012", "order": 12, "role": "body", "text": "\"We had to earn this,\" Conley said. \"This team wasn't going to go away. They played very well especially at home. They have a great group of guys over there and they're well-coached so we knew it was going to be a dogfight.\""}
{"game_id": "0021400446", "chunk_id": "0021400446_013", "order": 13, "role": "body", "text": "Conley hit another 3 to open the second half and stretch the lead to 19, but the remainder of the quarter was all Miami."}
{"game_id": "0021400446", "chunk_id": "0021400446_014", "order": 14, "role": "body", "text": "Deng had 10 points in the period, Wade was 3 for 3 with four assists, and the Heat outscored Memphis 23-5 over a stretch of just under 6 minutes to cut it to 65-64 -- starting the trend of Miami getting close, but never getting the lead."}
{"game_id": "0021400446", "chunk_id": "0021400446_015", "order": 15, "role": "body", "text": "\"We gave ourselves a chance to win,\" Wade said. \"That's all we can do.\""}
{"game_id": "0021400446", "chunk_id": "0021400446_017", "order": 17, "role": "body", "text": "Grizzlies: Gasol has scored 20 or more points 17 times this season -- matching his best for any full season. ... Memphis F Zach Randolph missed his fourth consecutive game with right knee soreness. ... Vince Carter played against Miami for the 55th time, Prince for the 53rd time."}
{"game_id": "0021400446", "chunk_id": "0021400446_018", "order": 18, "role": "body", "text": "Heat: Miami will go into the new year with a losing record, the first time that'll happen since 2008. The Heat are 14-17 with two games left before 2015. ... Wade reached the career 18,000-point mark. ... Heat C Chris Bosh (strained right calf) missed his eighth straight game."}
{"game_id": "0021400446", "chunk_id": "0021400446_020", "order": 20, "role": "body", "text": "Memphis took 37 free throws to Miami's 21. It was the fourth time a Heat opponent got at least 33 free throws in a Miami home game this season."}
{"game_id": "0021400446", "chunk_id": "0021400446_022", "order": 22, "role": "body", "text": "Granger's 18 points matched the most he's scored in his last 72 games -- not counting the 152 games he missed with injuries in that span."}
{"game_id": "0021400446", "chunk_id": "0021400446_024", "order": 24, "role": "body", "text": "Grizzlies: Host San Antonio on Tuesday."}
