{"game_id": "0021200168", "chunk_id": "0021200168_001", "order": 1, "role": "lead", "text": "PHOENIX --  Suns coach Alvin Gentry retooled his starting lineup with the hope he'd get a little more scoring from his top unit."}
{"game_id": "0021200168", "chunk_id": "0021200168_003", "order": 3, "role": "body", "text": "Marcin Gortat scored 22 points in only three quarters and the Suns routed the Portland Trail Blazers 114-87 on Wednesday night to snap a three-game losing streak."}
{"game_id": "0021200168", "chunk_id": "0021200168_004", "order": 4, "role": "body", "text": "\"We came out ready to play,\" Gortat said. \"We had two new guys in the starting lineup and we were a little bit better defensively. It's a great win but we need to forget about it really fast.\""}
{"game_id": "0021200168", "chunk_id": "0021200168_005", "order": 5, "role": "body", "text": "Gortat had told a reporter for Polish newspaper Przeglad Sportowy after the Suns' loss to the Lakers on Friday that he didn't believe he was \"even an option for (Suns coach Alvin) Gentry.\""}
{"game_id": "0021200168", "chunk_id": "0021200168_006", "order": 6, "role": "body", "text": "But against the Blazers, Gortat was a key component of a Phoenix offense that shot 60 percent from the field in the first half en route to a 57-44 lead and a season-best 59.7 percent for the game. Gortat was 11 of 14 from the floor and added seven rebounds."}
{"game_id": "0021200168", "chunk_id": "0021200168_007", "order": 7, "role": "body", "text": "\"Honestly, we can't get excited about that game because Portland didn't play their best game,\" Gortat said."}
{"game_id": "0021200168", "chunk_id": "0021200168_008", "order": 8, "role": "body", "text": "The new starters, Markieff Morris and Shannon Brown, were productive for the Suns."}
{"game_id": "0021200168", "chunk_id": "0021200168_009", "order": 9, "role": "body", "text": "Morris had 19 points and seven rebounds, and Brown added 10, including a pair of 3-pointers as Phoenix rallied from a four-point deficit in the opening minutes to take the lead for good with 7:23 left in the first quarter."}
{"game_id": "0021200168", "chunk_id": "0021200168_010", "order": 10, "role": "body", "text": "\"I didn't want to put too much pressure on myself so I just came out and played hard,\" Morris said."}
{"game_id": "0021200168", "chunk_id": "0021200168_011", "order": 11, "role": "body", "text": "The Suns have been playing from behind nearly the entire season, trailing by double digits in each of their past six games and in all but one this season coming in. Gentry had been mulling a change for the past week."}
{"game_id": "0021200168", "chunk_id": "0021200168_012", "order": 12, "role": "body", "text": "\"We never dug ourselves a hole so when we made those runs tonight we went from being up to putting the game in a pretty good position,\" Gentry said. \"We weren't making up 10, 15 points and getting to where we were back to even.\""}
{"game_id": "0021200168", "chunk_id": "0021200168_013", "order": 13, "role": "body", "text": "Jermaine O'Neal added 17 points off the bench and Goran Dragic had 15 points and eight assists for Phoenix."}
{"game_id": "0021200168", "chunk_id": "0021200168_014", "order": 14, "role": "body", "text": "Damian Lillard had 24 points and three assists for the Blazers, who had won three straight. Wesley Matthews and Nicolas Batum had 13 points apiece for Portland, which was without starting center J.J. Hickson, out with a left shoulder sprain."}
{"game_id": "0021200168", "chunk_id": "0021200168_015", "order": 15, "role": "body", "text": "\"All that matters to me is we got blown out,\" Lillard said."}
{"game_id": "0021200168", "chunk_id": "0021200168_016", "order": 16, "role": "body", "text": "The Trail Blazers committed 20 turnovers, received only 13 points from their reserves -- seven in the fourth quarter and was outscored 54-24 in the paint."}
{"game_id": "0021200168", "chunk_id": "0021200168_017", "order": 17, "role": "body", "text": "\"That is a strength of theirs and not necessarily our strength so I did probably anticipate a differential but not 30,\" said Blazers coach Terry Stotts. \"It's not all effort. It's being mentally engaged.\""}
{"game_id": "0021200168", "chunk_id": "0021200168_018", "order": 18, "role": "body", "text": "The Blazers rallied briefly in the third quarter, cutting a deficit that had ballooned to 21 points to 11, 73-62, on a 3-pointer by Lillard with 5:38 left in the period."}
{"game_id": "0021200168", "chunk_id": "0021200168_019", "order": 19, "role": "body", "text": "But Dragic and Morris scored consecutive baskets and the Suns went on a 16-5 run to take an 86-67 lead with 1:26 to go in the third."}
{"game_id": "0021200168", "chunk_id": "0021200168_020", "order": 20, "role": "closing", "text": "Game notes The Suns won their second game against a team with a .500-plus record. ... Batum, who has been fighting a severe cold, was a game-time decision. ... Dragic has had double-digit steals in a career-best seven straight games. ... Blazers rookie center Meyers Leonard, starting in place of Hickson, scored 12 points on 6 of 9 shooting and added five rebounds. ... Phoenix had not shot better than 50 percent since April 16, also against Portland. ... Portland has not won in Phoenix since December 10, 2010. The Blazers are 2-12 at US Airways Center since the start of the 2004-05 season. ... The Suns had not shot more than 50 percent from the field yet this season."}
