{"game_id": "0021700420", "chunk_id": "0021700420_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  The Portland Trail Blazers quietly have been one of the best defensive teams in the NBA this season, something they have reminded opponents of the last two games."}
{"game_id": "0021700420", "chunk_id": "0021700420_002", "order": 2, "role": "body", "text": "Portland limited Orlando to 38.6 percent shooting and made enough plays in the final minute to hold on for a 95-88 victory on Friday night."}
{"game_id": "0021700420", "chunk_id": "0021700420_003", "order": 3, "role": "body", "text": "Damian Lillard led the winners with 21 points and C.J. McCollum had 20. Al-Farouq Aminu added 15 points and Jusuf Nurkic had nine points and 11 rebounds."}
{"game_id": "0021700420", "chunk_id": "0021700420_004", "order": 4, "role": "body", "text": "\"We had certain games where the defense wasn't good, but the second half against Miami (Wednesday) and tonight it was pretty solid throughout,\" Portland coach Terry Stotts said."}
{"game_id": "0021700420", "chunk_id": "0021700420_005", "order": 5, "role": "body", "text": "It was the second straight game that Portland held the opponent under 100 points. Those two victories followed a five-game losing streak during which opponents averaged 113.4 points against the Trail Blazers."}
{"game_id": "0021700420", "chunk_id": "0021700420_006", "order": 6, "role": "body", "text": "\"Every year, for every team, adversity hits at some point and I feel like it was just hitting for us,\" Lillard said. \"We hadn't been defending well, we hadn't been playing good offensively.\""}
{"game_id": "0021700420", "chunk_id": "0021700420_007", "order": 7, "role": "body", "text": "Nikola Vucevic led Orlando with 26 points and 14 rebounds. Johnathon Simmons had 15 points for the Magic, who have lost four straight and 15 of their last 18."}
{"game_id": "0021700420", "chunk_id": "0021700420_008", "order": 8, "role": "body", "text": "Aaron Gordon, who was returning to the Magic lineup after missing two games with a concussion, limped off the court with 7:45 left in the game and the Magic trailing 85-69. He strained his calf after colliding with Trail Blazers rookie Zach Collins. He finished with 13 points and six rebounds."}
{"game_id": "0021700420", "chunk_id": "0021700420_009", "order": 9, "role": "body", "text": "Orlando trailed by 17 with just over seven minutes left in the game, but cut it to five with three minutes to go before the rally petered out."}
{"game_id": "0021700420", "chunk_id": "0021700420_010", "order": 10, "role": "body", "text": "\"We had some droughts early in the game and then you're fighting uphill and need the fourth quarter to be almost perfect,\" Magic coach Frank Vogel said. \"We had some good possessions, played the right way and just didn't get the payoff. We've got to finish better.\""}
{"game_id": "0021700420", "chunk_id": "0021700420_011", "order": 11, "role": "body", "text": "Lillard had 13 points in the third quarter when Portland slipped away from the Magic. The point guard was too quick for Orlando's Elfrid Payton and created all four of his field goals off the dribble and got Payton to foul him on a 3-pointer."}
{"game_id": "0021700420", "chunk_id": "0021700420_012", "order": 12, "role": "body", "text": "But the Blazers couldn't put enough distance between themselves and the Magic even after running off 11 straight points to take an 86-69 lead with 7:28 left in the game."}
{"game_id": "0021700420", "chunk_id": "0021700420_013", "order": 13, "role": "body", "text": "Orlando responded by scoring 12 straight points, the last basket a layup by Vucevic that made it 86-81 with just over 3 minutes to go. The Magic took advantage of five Portland turnovers during the final quarter."}
{"game_id": "0021700420", "chunk_id": "0021700420_014", "order": 14, "role": "body", "text": "\"Obviously that stretch was a little unsettling,\" Stotts said. \"We had a lot of poor offensive possessions. Give (Orlando) a little bit of credit defensively, but we were turning the ball over.\""}
{"game_id": "0021700420", "chunk_id": "0021700420_015", "order": 15, "role": "body", "text": "Nurkic ended a nearly five-minute drought for Portland by powering inside for a layup that gave the Trail Blazers a seven-point lead."}
{"game_id": "0021700420", "chunk_id": "0021700420_016", "order": 16, "role": "body", "text": "The teams traded baskets the rest of the way, with Orlando never getting closer than five. Aminu settled the matter with an uncontested dunk with 23 seconds to go."}
{"game_id": "0021700420", "chunk_id": "0021700420_018", "order": 18, "role": "body", "text": "TRAIL BLAZERS: Aminu is 18 of 31 on 3-pointers in his last five games. ... Nurkic returned after missing three games with an ankle sprain. He played 25 minutes."}
{"game_id": "0021700420", "chunk_id": "0021700420_019", "order": 19, "role": "body", "text": "MAGIC: The Magic haven't won a game this season (0-9) when they score less than 100 points. ...  Rookie Johnathan Isaac practiced Thursday, but was held out of the game by team doctors. Isaac has missed 17 games with an ankle injury. ... Evan Fournier (ankle), Terrence Ross (knee) and Aaron Afflalo (back) were inactive."}
{"game_id": "0021700420", "chunk_id": "0021700420_021", "order": 21, "role": "body", "text": "TRAIL BLAZERS: At Charlotte on Saturday."}
{"game_id": "0021700420", "chunk_id": "0021700420_022", "order": 22, "role": "body", "text": "MAGIC:  At Detroit on Sunday to face former coach Stan Van Gundy."}
{"game_id": "0021700420", "chunk_id": "0021700420_024", "order": 24, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
