{"game_id": "0021700088", "chunk_id": "0021700088_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  General manager Rich Cho's decision to pair Kemba Walker with Dwight Howard is off to a rousing start in Charlotte."}
{"game_id": "0021700088", "chunk_id": "0021700088_002", "order": 2, "role": "body", "text": "The Hornets' All-Star point guard is meshing extremely well with an eight-time All-Star center looking to jumpstart his NBA career while playing for his third team in three seasons."}
{"game_id": "0021700088", "chunk_id": "0021700088_003", "order": 3, "role": "body", "text": "Walker had 34 points and 10 assists, Howard had 22 points and 10 rebounds, and the Hornets defeated Orlando 120-113 on Sunday night to snap the Magic's three-game win streak."}
{"game_id": "0021700088", "chunk_id": "0021700088_004", "order": 4, "role": "body", "text": "On two occasions, Walker found Howard for an alley-oop dunk -- and the pick-and-roll has opened more avenues for Walker to score."}
{"game_id": "0021700088", "chunk_id": "0021700088_005", "order": 5, "role": "body", "text": "Walker credits the duo's early success to constant communication with Howard, saying they talk at length after every game and practice. Walker also said they text constantly during off days."}
{"game_id": "0021700088", "chunk_id": "0021700088_006", "order": 6, "role": "body", "text": "\"We are trying to make sure we are on the same page,\" Walker said. \"I tell him I am going to be learning ways to get him the basketball and just be patient with me. And that is what he has been doing. And he's opening up so many other aspects of my game. He attracts so much attention and gets other people open.\""}
{"game_id": "0021700088", "chunk_id": "0021700088_007", "order": 7, "role": "body", "text": "The Hornets are 3-3 despite starting the season without injured Nic Batum, the team's highest-paid player."}
{"game_id": "0021700088", "chunk_id": "0021700088_008", "order": 8, "role": "body", "text": "Howard likes that he and Walker are cut from the same competitive cloth."}
{"game_id": "0021700088", "chunk_id": "0021700088_009", "order": 9, "role": "body", "text": "\"It's good that both of the leaders on the team have that chemistry together -- and it's only building,\" Howard said."}
{"game_id": "0021700088", "chunk_id": "0021700088_010", "order": 10, "role": "body", "text": "Orlando entered averaging 118 points per game -- second-most in the NBA behind Golden State -- and having scored at least 100 in all five games."}
{"game_id": "0021700088", "chunk_id": "0021700088_011", "order": 11, "role": "body", "text": "Charlotte was just better, though."}
{"game_id": "0021700088", "chunk_id": "0021700088_012", "order": 12, "role": "body", "text": "The Hornets led by as many as 16 in the second half, but Orlando cut the lead to 95-92 with nine minutes remaining."}
{"game_id": "0021700088", "chunk_id": "0021700088_013", "order": 13, "role": "body", "text": "That's when Walker took over, knocking down a 3-pointer and scoring -- plus a foul -- on a drive past former teammate Bismack Biyombo. Walker then drove into the lane and dished to Marvin Williams for an easy score to push the lead back to nine. Williams finished with 13 points and 11 rebounds."}
{"game_id": "0021700088", "chunk_id": "0021700088_014", "order": 14, "role": "body", "text": "Walker later scored off a drive and knocked down another 3 to quell another Magic rally."}
{"game_id": "0021700088", "chunk_id": "0021700088_015", "order": 15, "role": "body", "text": "\"We just weren't physical enough and we didn't take him out of his rhythm,\" Magic guard Terrence Ross said. \"He kind of got to his sweet spots and that kind of hurt us and he got going once he got more comfortable.\""}
{"game_id": "0021700088", "chunk_id": "0021700088_016", "order": 16, "role": "body", "text": "The Hornets outrebounded the Magic 59-40."}
{"game_id": "0021700088", "chunk_id": "0021700088_017", "order": 17, "role": "body", "text": "\"The sense of urgency, I don't think it was there for us this night,\" Orlando's Aaron Gordon said. \"Just lackadaisical. We weren't finding our man, we were letting them get too many second-chance points and that'll kill you. We just weren't doing the little stuff.\""}
{"game_id": "0021700088", "chunk_id": "0021700088_018", "order": 18, "role": "body", "text": "Jonathan Simmons led the Magic with 27 points off the bench on 9-of-15 shooting. Evan Fournier added 23 points, while Ross and Gordon each had 17."}
{"game_id": "0021700088", "chunk_id": "0021700088_020", "order": 20, "role": "body", "text": "Magic: It was a tough night for point guard D.J. Augustin, held scoreless on 0-for-7 shooting. ... Orlando shot 26.3 percent in the first half from 3-point range. ... Adreian Payne (hand) and Elfrid Payton (hamstring) did not play. ... Orlando shot 42.3 percent from the field."}
{"game_id": "0021700088", "chunk_id": "0021700088_021", "order": 21, "role": "body", "text": "Hornets: Walker also grabbed six rebounds and became the first Hornets player since Raymond Felton to have at least 30 points, 10 assists and five boards in a game."}
{"game_id": "0021700088", "chunk_id": "0021700088_023", "order": 23, "role": "body", "text": "Jeremy Lamb had 20 points, marking his sixth straight game with at least 15 while filling in for Batum. \"I'm trying to be aggressive and do the things to help my team win,\" Lamb said. \"I'm playing off the guys and taking my shots.\""}
{"game_id": "0021700088", "chunk_id": "0021700088_025", "order": 25, "role": "body", "text": "Magic coach Frank Vogel wasn't thrilled with his team's ball movement."}
{"game_id": "0021700088", "chunk_id": "0021700088_026", "order": 26, "role": "body", "text": "\"Our guys were trying,\" Vogel said. \"They tried to play really fast but you have to get open. Charlotte does a good job of making you work for everything and then you get in the paint and they're swarming and sprinting out to the perimeter. And they're a good defensive team.\""}
{"game_id": "0021700088", "chunk_id": "0021700088_028", "order": 28, "role": "body", "text": "After the game, the Hornets announced they exercised their fourth-year option on Frank Kaminsky, who did not play because of an illness."}
{"game_id": "0021700088", "chunk_id": "0021700088_030", "order": 30, "role": "body", "text": "Despite the win, Hornets coach Steve Clifford was concerned about the lack of production he's getting from his bench. \"The starters can't play 30-something minutes every night,\" he said."}
{"game_id": "0021700088", "chunk_id": "0021700088_032", "order": 32, "role": "body", "text": "Magic: At New Orleans on Monday night."}
{"game_id": "0021700088", "chunk_id": "0021700088_033", "order": 33, "role": "closing", "text": "Hornets: At Memphis on Monday night."}
