{"game_id": "0021701182", "chunk_id": "0021701182_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  Rookie Malik Monk had the best night of his young career and it didn't matter to him that it came against a Magic team that featured almost as many G League players as NBA regulars."}
{"game_id": "0021701182", "chunk_id": "0021701182_002", "order": 2, "role": "body", "text": "Monk scored a season-high 26 points, Frank Kaminsky added 21 and the Charlotte Hornets routed outmanned Orlando 137-100 on Friday night."}
{"game_id": "0021701182", "chunk_id": "0021701182_003", "order": 3, "role": "body", "text": "Monk, the Hornets' backup point guard, also tied his career high with eight assists against a makeshift Magic team that gave prominent roles in the game to four call-ups from its G League team."}
{"game_id": "0021701182", "chunk_id": "0021701182_004", "order": 4, "role": "body", "text": "\"I'm going out there to play like I don't have a spot every time I step on the court,\" Monk said."}
{"game_id": "0021701182", "chunk_id": "0021701182_005", "order": 5, "role": "body", "text": "\"I don't think it's ever going to get any better than that. You know they had G League guys because of the scouting report, but I'm going out there to play like it's LeBron (James), Russell Westbrook, anybody like that.\""}
{"game_id": "0021701182", "chunk_id": "0021701182_006", "order": 6, "role": "body", "text": "Marvin Williams scored 18 points and Dwight Howard had 16 points and 17 rebounds for the Hornets, who stopped a four-game losing streak. Charlotte led by 24 points two minutes into the second quarter and pushed the advantage to as many as 45 in the second half despite benching all starters for the final period."}
{"game_id": "0021701182", "chunk_id": "0021701182_007", "order": 7, "role": "body", "text": "\"Malik was really cooking in terms of decision making . eight assists, one turnover and he easily could have had three or four more assists,\" Charlotte coach Steve Clifford said. \"We shot the ball so well and when you shoot like that, it makes everything else look better, too.\""}
{"game_id": "0021701182", "chunk_id": "0021701182_008", "order": 8, "role": "body", "text": "D.J. Augustin led Orlando with 19 points and Marreese Speights had 14 for the Magic, who prominently featured four players off their G League roster in the game. Three of them, Khem Birch, Jamel Artis and Rodney Purvis, each had 12 points."}
{"game_id": "0021701182", "chunk_id": "0021701182_009", "order": 9, "role": "body", "text": "The Magic were down by double digits seven minutes into the game and never got the deficit under 10 the rest of the game."}
{"game_id": "0021701182", "chunk_id": "0021701182_010", "order": 10, "role": "body", "text": "\"Very difficult, disappointing performance by us,\" Magic coach Frank Vogel said. \"Our four young guys got opportunities to play extended minutes and earn jobs and they didn't take advantage of that opportunity. We didn't play well by a long shot.\""}
{"game_id": "0021701182", "chunk_id": "0021701182_011", "order": 11, "role": "body", "text": "The Hornets' regular roster had a field day against Orlando's makeshift rotation. Charlotte's NBA regulars were crisp in their offensive execution and coordinated in defending against a Magic starting five that hadn't played together this season."}
{"game_id": "0021701182", "chunk_id": "0021701182_012", "order": 12, "role": "body", "text": "Charlotte led 51-27 after Kaminsky drained a 3-pointer with 10:14 left in the second period. The Hornets had their pick of shots on nearly every possession against the confused Magic defenders."}
{"game_id": "0021701182", "chunk_id": "0021701182_013", "order": 13, "role": "body", "text": "Charlotte shot 56.5 percent from the field in the first half and hit half of its 16 3-point shots."}
{"game_id": "0021701182", "chunk_id": "0021701182_014", "order": 14, "role": "body", "text": "Howard, who started his career in Orlando, had 12 points and nine rebounds in 16 minutes of the first half against his former team. All four of Howard's first-half field goals were dunks over Magic big men Bismack Biyombo and Birch."}
{"game_id": "0021701182", "chunk_id": "0021701182_016", "order": 16, "role": "body", "text": "Hornets: The 43 points the Hornets scored in the first quarter were the second-most points they've scored in any quarter this season. . Charlotte had given up 118.5 points in its previous five games."}
{"game_id": "0021701182", "chunk_id": "0021701182_017", "order": 17, "role": "body", "text": "Magic: F Artis got his first NBA start and shot 5 of 12. . Leading scorer Aaron Gordon (calf) and leading rebounder Nikola Vucevic (back) sat out the game. . The Magic have not beaten division rival Charlotte since Dec. 15, 2015, a stretch of 11 games."}
{"game_id": "0021701182", "chunk_id": "0021701182_019", "order": 19, "role": "body", "text": "Clifford said that before the season, he thought this was his most talented team but the Hornets haven't lived up to it. \"I thought we could be a top-five defensive team, but instead, this has been our worst defensive team,\" Clifford said. \"I thought we could be top-five defensive and top 12 on offense and that usually would be about 45 or 46 wins. We'll be close to that offensively, but our defense hasn't been anywhere close to where it was in other years.\""}
{"game_id": "0021701182", "chunk_id": "0021701182_021", "order": 21, "role": "body", "text": "Vogel all but confirmed that Jonathan Isaac, the sixth pick in last summer's NBA Draft, is done for the season. Vogel said Isaac has swelling and discomfort in his left ankle. Isaac has missed 52 games this season because of ankle injuries. \"Unless he turns a corner, there is a good chance he doesn't play again this year,\" Vogel said. \"The emphasis of his offseason will be to strengthen his lower extremities.\" Isaac averaged 5.4 points and 3.7 rebounds in the 27 games he did play. \"I wasn't out the entire season,\" Isaac said. \"I was still able to contribute and help the team win some games. To me, that's better than not doing it at all.\""}
{"game_id": "0021701182", "chunk_id": "0021701182_022", "order": 22, "role": "body", "text": "Hornets: Host Indiana Sunday afternoon."}
{"game_id": "0021701182", "chunk_id": "0021701182_023", "order": 23, "role": "closing", "text": "Magic: Travel to Toronto Sunday night."}
