{"game_id": "0021400444", "chunk_id": "0021400444_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Tobias Harris said once the Orlando Magic had a lead, they didn't want to give it up. Hard to blame him given the way things have gone in recent weeks."}
{"game_id": "0021400444", "chunk_id": "0021400444_002", "order": 2, "role": "body", "text": "\"That has been a killer for us -- having the lead and not sustaining it,\" Harris said."}
{"game_id": "0021400444", "chunk_id": "0021400444_003", "order": 3, "role": "body", "text": "Orlando led for the final three quarters and withstood a career-high 42 points from Kemba Walker to beat the Charlotte Hornets 102-94 on Saturday night."}
{"game_id": "0021400444", "chunk_id": "0021400444_004", "order": 4, "role": "body", "text": "Nikola Vucevic had 22 points and 11 rebounds, Harris scored 21 points and the Magic beat the Hornets for the second time this season in Charlotte."}
{"game_id": "0021400444", "chunk_id": "0021400444_005", "order": 5, "role": "body", "text": "Victor Oladipo scored 13 points, Evan Fournier had 12, and Ben Gordon and Elfrid Payton each had 11 for the Magic (12-21) in a balanced scoring attack."}
{"game_id": "0021400444", "chunk_id": "0021400444_006", "order": 6, "role": "body", "text": "\"In the past, we haven't been able to hold on to the lead,\" Vucevic said. \"They made some runs but they never made the big run to tie the game and we were able to hold them off.\""}
{"game_id": "0021400444", "chunk_id": "0021400444_007", "order": 7, "role": "body", "text": "Walker scored a Charlotte-record 35 in the second half and finished 15 of 30 from the field with five 3-pointers. It's the seventh time in the last 10 games Walker has scored at least 20 points."}
{"game_id": "0021400444", "chunk_id": "0021400444_008", "order": 8, "role": "body", "text": "\"I had a career night, a great game but it just wasn't enough,\" Walker said. \"... Our problem wasn't offensively, it was defensively. We didn't execute our game plan on defense and they crushed us.\""}
{"game_id": "0021400444", "chunk_id": "0021400444_009", "order": 9, "role": "body", "text": "Hornets coach Steve Clifford wasn't happy with his team's overall effort, outside of Walker's performance that he called phenomenal."}
{"game_id": "0021400444", "chunk_id": "0021400444_010", "order": 10, "role": "body", "text": "\"He can be a cornerstone player for teams that go deep into the playoffs because of his competitiveness,\" Clifford said. \"He just has a competitive spirit that is contagious to me. He played 42 minutes back-to-back and did not want to come out (of the game). He kept us in the game.\""}
{"game_id": "0021400444", "chunk_id": "0021400444_011", "order": 11, "role": "body", "text": "The Magic led 52-42 at halftime after outscoring the Hornets 28-18 in the paint."}
{"game_id": "0021400444", "chunk_id": "0021400444_012", "order": 12, "role": "body", "text": "Walker had 19 points on 7-of-9 shooting in the third quarter, but the Hornets weren't able to cut into Orlando's double-digit lead until late in the game."}
{"game_id": "0021400444", "chunk_id": "0021400444_013", "order": 13, "role": "body", "text": "Charlotte got within six with 30 seconds left, but Walker's 3-point attempt from the top of the key rattled out."}
{"game_id": "0021400444", "chunk_id": "0021400444_014", "order": 14, "role": "body", "text": "Vucevic added two free throws with 22 seconds remaining to help seal the victory."}
{"game_id": "0021400444", "chunk_id": "0021400444_015", "order": 15, "role": "body", "text": "Vucevic was the key for Orlando."}
{"game_id": "0021400444", "chunk_id": "0021400444_016", "order": 16, "role": "body", "text": "He stepped out and knocked down jump shots early against Al Jefferson, forcing the Hornets to guard him. When they did, he found teammates in the passing lanes and helped open up the offense."}
{"game_id": "0021400444", "chunk_id": "0021400444_017", "order": 17, "role": "body", "text": "\"I feel like I've always been a good passer and can read the defenses pretty well,\" Vucevic said. \"The last two games, whenever I've caught it, defenses make moves and people cut and I find them going to the basket. I'm just trying to find the open spaces.\""}
{"game_id": "0021400444", "chunk_id": "0021400444_018", "order": 18, "role": "body", "text": "Jefferson, who is battling a groin injury, had 14 points and nine rebounds after being held to four by Oklahoma City on Friday night."}
{"game_id": "0021400444", "chunk_id": "0021400444_021", "order": 21, "role": "body", "text": "Magic: Harris has scored in double figures in all 31 games he has played this season, the longest streak of his career."}
{"game_id": "0021400444", "chunk_id": "0021400444_022", "order": 22, "role": "body", "text": "Hornets: Lance Stephenson missed his sixth straight game with a groin injury. Clifford said Stephenson likely will likely miss Monday night's game against Milwaukee."}
{"game_id": "0021400444", "chunk_id": "0021400444_024", "order": 24, "role": "body", "text": "Players from the Louisville and Georgia college football teams were attendance at the game. Those teams will meet here in Charlotte on Tuesday night in the Belk Bowl."}
{"game_id": "0021400444", "chunk_id": "0021400444_026", "order": 26, "role": "body", "text": "Magic: Visit Miami on Monday night."}
{"game_id": "0021400444", "chunk_id": "0021400444_027", "order": 27, "role": "closing", "text": "Hornets: Host Milwaukee on Monday night."}
