{"game_id": "0021400387", "chunk_id": "0021400387_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. -- The Toronto Raptors felt right at home at the Palace of Auburn Hills on Friday night.\nThe Raptors overcame a slow start to pull away in the second half and beat Detroit 110-100 on a night the Pistons' home arena was dominated by Canadian flags and chants of \"We The North\" and \"Let's Go Raptors.\"\n\"That was incredible by our fans,\" said Jonas Valanciunas, who led a balanced Raptors offense with 17 points. \"We can't thank them enough, because it was like playing a home game tonight.\"\nIt was a stunning night at a building that was one of the toughest places to win for visiting teams during each of Detroit's two extended runs as a league powerhouse.\n\"I've seen it before,\" Pistons coach Stan Van Gundy said. \"It happened in Miami when I was coaching there and the Knicks fans would come in and take over our building.\"\nThe loss was Detroit's 12th straight home game, extending its single-season franchise record, and moving within seven of the NBA record set by the 1993-94 Dallas Mavericks. In their last three games, two at home, the Pistons have given up at least 110 points -- the only three times that has happened this season.\n\"The story of this game is that we showed absolutely no defensive will or resolve whatsoever,\" Van Gundy said. \"We gave up 60 points in the paint, and didn't show any inclination to stop them. Our last three games have been against good teams, and it is very accurate to say our defense has been exposed.\"\nBrandon Jennings scored 22 points to lead Detroit, Kentavious Caldwell-Pope had 18 and Greg Monroe added 17.\nKyle Lowry and Lou Williams had 15 points each, James Johnson scored 12, and Patrick Patterson and Terrence Ross added 11 each for the Raptors.\nThe score was tied at 52 at halftime before Toronto pulled away in the third quarter. Detroit turned the ball over four times in the first 2 minutes, allowing the Raptors to take a six-point lead. The Raptors extended the lead to 15 later in the period as their fans got louder before Detroit pulled to 81-70 at the end of the period.\nJohnson's dunk on Andre Drummond made it 95-75 midway through the fourth and on Toronto's next possession, Drummond smashed into Johnson with a forearm and hip smash. That set off a melee that saw Drummond get a flagrant foul and four technicals called. At least one Raptors fan was ejected at the same time after a verbal altercation with the Pistons' Josh Smith.\n\"That was nasty, but that's basketball,\" said Johnson. \"I don't expect anything less from anybody that's trying to win. Frustration sets in when you want to win -- no hard feelings.\"\nThe Pistons dominated most of the first half, leading by as many as 11 points as Toronto missed its first 10 jump shots, but the Raptors put together a run at the end of the second quarter. Lowry missed a floater at the halftime buzzer that would have given Toronto its first lead, leaving the game tied at 52.\nThe teams combined to miss 18 of 22 3-point attempts in the half, leaving most of the points coming at the rim. The Pistons had a 38-32 edge on points in the paint, and only turned the ball over twice.\nTIP INS\nRaptors: The game was delayed for several minutes in the third quarter after Landry Fields flipped over Kyle Singler and hit the back of his head on the floor. Fields needed eight stitches to the back of his head, but passed all concussion tests.\nPistons: The Pistons have now gone six weeks without a win at the Palace. They are 2-13 at home this season, with the last win coming Nov. 7 against Milwaukee. ... The Pistons lost 13 straight at home bridging the 1979-80 and 1980-81 seasons.\nJOHNSON LANDMARK\nAmir Johnson played in his 400th career game with the Raptors, moving him into seventh place in franchise history. Johnson, the last player to be drafted directly out of high school, started his career with the Pistons before being traded for Fabricio Oberto.\nNEXT UP\nRaptors: Host New York on Sunday.\nPistons: At Brooklyn on Sunday."}
