{"game_id": "0021300691", "chunk_id": "0021300691_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  The Memphis Grizzlies are making a move in the Western Conference and are doing it on the road."}
{"game_id": "0021300691", "chunk_id": "0021300691_002", "order": 2, "role": "body", "text": "Zach Randolph had 26 points and 12 rebounds and Memphis overcame another strong effort by Kevin Love to beat the Minnesota Timberwolves 94-90 Friday night."}
{"game_id": "0021300691", "chunk_id": "0021300691_003", "order": 3, "role": "body", "text": "Courtney Lee added 16 points for the Grizzlies, who have won five straight games and 10 of their last 11. Memphis has won six straight away from home, including a sweep of a three-game trip to Portland, Sacramento and Minnesota."}
{"game_id": "0021300691", "chunk_id": "0021300691_004", "order": 4, "role": "body", "text": "\"It feels good, we are still getting to where we want to get,\" Randolph said."}
{"game_id": "0021300691", "chunk_id": "0021300691_005", "order": 5, "role": "body", "text": "One-half game behind Dallas for eighth place in the Western Conference, the Grizzlies are 13-7 on the road and 12-13 at home."}
{"game_id": "0021300691", "chunk_id": "0021300691_006", "order": 6, "role": "body", "text": "\"This is huge for us, especially for the goals we have as far as making that playoff push,\" Lee said. \"It definitely builds momentum.\""}
{"game_id": "0021300691", "chunk_id": "0021300691_007", "order": 7, "role": "body", "text": "The win could be costly because Memphis played the final 6:37 without starting guard Mike Conley, who sprained his right ankle when he landed on J.J. Barea's foot. Conley had 12 points on 4-of-14 shooting after scoring a combined 46 in his last two outings. He is to be re-evaluated Saturday."}
{"game_id": "0021300691", "chunk_id": "0021300691_008", "order": 8, "role": "body", "text": "\"I can put weight on it now,\" Conley said. \"Tomorrow is looking iffy, but hopefully after some treatment tonight and the next day we will go from there.\""}
{"game_id": "0021300691", "chunk_id": "0021300691_009", "order": 9, "role": "body", "text": "Memphis hosts Milwaukee Saturday."}
{"game_id": "0021300691", "chunk_id": "0021300691_010", "order": 10, "role": "body", "text": "Playing on a sore left ankle throughout the second half, Love led Minnesota with 28 points and 16 rebounds. Kevin Martin had 14 points for the Timberwolves, who lost for just the second time in seven games."}
{"game_id": "0021300691", "chunk_id": "0021300691_011", "order": 11, "role": "body", "text": "\"We had our chances in the end and had some really, really great looks. We just didn't convert,\" Love said."}
{"game_id": "0021300691", "chunk_id": "0021300691_013", "order": 13, "role": "body", "text": "He scored six points during a 9-2 Memphis run that turned a one-point deficit into a 91-85 lead with 59.6 seconds to play and later added two free throws."}
{"game_id": "0021300691", "chunk_id": "0021300691_014", "order": 14, "role": "body", "text": "\"He's the man, he's the go-to player. He's a proud man, he's an extremely competitive man,\" said Memphis coach David Joerger. \"Think of all the banging those guys take night in and night out, year in and year out. When he got down there and got it done going 11 of 20 with some offensive rebounds, makes big free throws. I'm really proud of him, really happy.\""}
{"game_id": "0021300691", "chunk_id": "0021300691_015", "order": 15, "role": "body", "text": "With Minnesota trailing by one, Love scored on a fadeaway jumper and on a layup after a feed from Barea for an 83-80 lead midway through the fourth quarter."}
{"game_id": "0021300691", "chunk_id": "0021300691_016", "order": 16, "role": "body", "text": "Love hurt his left ankle when he collided with Marc Gasol on a drive with 2 minutes to play in the first half and landed on the foot of another Memphis player, yet gutted it out until halftime."}
{"game_id": "0021300691", "chunk_id": "0021300691_017", "order": 17, "role": "body", "text": "\"When I was moving it felt fine and I continued to keep it moving,\" Love said. \"But right now it doesn't feel so good. We just need to do all we can before tomorrow night and hopefully be ready to go.\" Minnesota is at Atlanta on Saturday."}
{"game_id": "0021300691", "chunk_id": "0021300691_018", "order": 18, "role": "body", "text": "Love's gimping was gone to start the second half much to the dismay of Memphis."}
{"game_id": "0021300691", "chunk_id": "0021300691_019", "order": 19, "role": "body", "text": "With the Timberwolves trailing 59-43 early in the third quarter, Love scored 14 points during an 18-4 run to get them within two. His jumper with 12.8 seconds left in the quarter gave Minnesota its first lead of the game at 67-66. Love outscored the Grizzlies 18-16 in the frame."}
{"game_id": "0021300691", "chunk_id": "0021300691_020", "order": 20, "role": "body", "text": "Ricky Rubio helped lead the comeback in the third with six assists, but did not get off the bench in the fourth as coach Rick Adelman thought Barea \"was the best option for us to win.\""}
{"game_id": "0021300691", "chunk_id": "0021300691_021", "order": 21, "role": "body", "text": "Rubio finished with six points on 2-of-7 shooting."}
{"game_id": "0021300691", "chunk_id": "0021300691_022", "order": 22, "role": "body", "text": "\"It's coach's decision and I respect it. He always does what he thinks is best for the team. Of course I wish I could play, but I respect my teammates and my coaches and what he decides,\" Rubio said."}
{"game_id": "0021300691", "chunk_id": "0021300691_023", "order": 23, "role": "body", "text": "Early on, Memphis took advantage of Minnesota playing its second straight game without bruising center Nikola Pekovic, who is out indefinitely with bursitis in his right ankle. Memphis had 36 points in the paint in the first half, and finished with 56."}
{"game_id": "0021300691", "chunk_id": "0021300691_024", "order": 24, "role": "body", "text": "Gasol and Lee each had nine points in the first quarter as the Grizzlies shot 63.6 percent from the field, and had 22 points in the paint in building a 30-22 lead."}
{"game_id": "0021300691", "chunk_id": "0021300691_025", "order": 25, "role": "body", "text": "A putback by Randolph and a two-handed dunk by Ed Davis off a Minnesota turnover increased Memphis' lead to 42-28 midway through the second quarter."}
{"game_id": "0021300691", "chunk_id": "0021300691_026", "order": 26, "role": "closing", "text": "Game notes Minnesota's 37 first-half points were a season low. ... Memphis F Mike Miller, who was questionable after spraining his right thumb Wednesday, finished with five points. ... Minnesota's Gorgui Dieng blocked Davis twice in a 58-second span early in second. ... Joerger grew up in Staples, Minn."}
