{"game_id": "0021700611", "chunk_id": "0021700611_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Taj Gibson and his teammates knew the Minnesota Timberwolves' four-game homestand was going to be tough."}
{"game_id": "0021700611", "chunk_id": "0021700611_002", "order": 2, "role": "body", "text": "After all, New Orleans, Cleveland, Oklahoma City and New York were coming to town. Well, three games in, Minnesota has answered the challenge and demonstrated how much it has grown this season."}
{"game_id": "0021700611", "chunk_id": "0021700611_003", "order": 3, "role": "body", "text": "Jimmy Butler scored 26 points, grabbed seven rebounds and had eight assists for the Timberwolves in a 104-88 win against the Oklahoma City Thunder on Wednesday night."}
{"game_id": "0021700611", "chunk_id": "0021700611_004", "order": 4, "role": "body", "text": "\"We were shaking our heads and just hoping that we can do well,\" Gibson said. \"But the way we've been playing, we have a lot of confidence.\""}
{"game_id": "0021700611", "chunk_id": "0021700611_005", "order": 5, "role": "body", "text": "Andrew Wiggins added 19 points, and Karl-Anthony Towns had 18 points and 12 rebounds as Minnesota pulled away in the second half to win its third game in a row and 10th in its last 13 overall."}
{"game_id": "0021700611", "chunk_id": "0021700611_006", "order": 6, "role": "body", "text": "Taking the season series 3-1 from division foe Oklahoma City capped a stretch in which the Timberwolves beat New Orleans by 18 points and Cleveland by 28. Minnesota led by at least 34 in each of those games."}
{"game_id": "0021700611", "chunk_id": "0021700611_007", "order": 7, "role": "body", "text": "Wednesday proved to be a bit tougher against the physical Thunder, but the Wolves outscored Oklahoma City 29-19 in the third and led by as many as 16 in the fourth."}
{"game_id": "0021700611", "chunk_id": "0021700611_008", "order": 8, "role": "body", "text": "\"Guess we're, I don't know, growing a little bit,\" Butler said. \"For us to go out there and guard the way we did, do what we talked about in shootaround and the day before in practice, it's huge for us. We're growing as a unit.\""}
{"game_id": "0021700611", "chunk_id": "0021700611_009", "order": 9, "role": "body", "text": "Russell Westbrook had 38 points and 10 rebounds, but the rest of the Thunder had a tough time shooting. Westbrook was 15 of 23 from the field, while his teammates were 17 of 56 (30.3 percent)."}
{"game_id": "0021700611", "chunk_id": "0021700611_010", "order": 10, "role": "body", "text": "Carmelo Anthony scored 15 points on 5-of-19 shooting, while Paul George finished 5 of 14 for 13 points for Oklahoma City, which has lost five of seven."}
{"game_id": "0021700611", "chunk_id": "0021700611_011", "order": 11, "role": "body", "text": "\"We've got to lock in and get a win,\" Westbrook said. \"That's all I can say.\""}
{"game_id": "0021700611", "chunk_id": "0021700611_012", "order": 12, "role": "body", "text": "George scored just two points in the first half."}
{"game_id": "0021700611", "chunk_id": "0021700611_013", "order": 13, "role": "body", "text": "\"We were getting good looks,\" George said. \"I thought we got shots that we'd been shooting all season. A lot of catch-and-shoot opportunities. It's like that. I think personally, I should've tried to play around the basket a little more, just to get something early, see the ball go down and work my way up.\""}
{"game_id": "0021700611", "chunk_id": "0021700611_014", "order": 14, "role": "body", "text": "The Thunder shot 28.6 percent in the third quarter (6 of 21). Meanwhile, the Wolves hit 62.5 percent (10 of 16) to take control."}
{"game_id": "0021700611", "chunk_id": "0021700611_016", "order": 16, "role": "body", "text": "The first three games between the teams were decided by a combined nine-point margin. Minnesota won the first two games by a total of five points. Oklahoma City came back with a four-point win at home on Dec. 1 as George scored 36 points."}
{"game_id": "0021700611", "chunk_id": "0021700611_017", "order": 17, "role": "body", "text": "\"I think both teams are probably a lot different today than when we faced all the way back in the beginning of December,\" Thunder coach Billy Donovan said. \"I think maybe early in the year, they were maybe not as great defensively and now they're getting better. I thought tonight they played well.\""}
{"game_id": "0021700611", "chunk_id": "0021700611_019", "order": 19, "role": "body", "text": "Thunder: G Andre Roberson missed his sixth straight game with left patellar tendinitis and coach Billy Donovan said he would also miss Saturday's game. ... Oklahoma City tied a season high with 20 turnovers. ... In the first three meetings, Thunder C Steven Adams was 27 of 33 from the field for a combined 64 points. He scored eight on 2-of-5 shooting on Wednesday."}
{"game_id": "0021700611", "chunk_id": "0021700611_020", "order": 20, "role": "body", "text": "Timberwolves: Minnesota held its opponent under 100 points for the seventh straight game. The last time the Wolves have held teams under 100 in seven consecutive games was Jan. 5-Feb. 8, 2007. ... Minnesota had its fifth consecutive sellout, the first time for the franchise since March 21-April 4, 2004. The Wolves won their sixth straight home game, the longest streak since the team won 14 in a row from Dec. 16, 2003-Feb. 6, 2004."}
{"game_id": "0021700611", "chunk_id": "0021700611_022", "order": 22, "role": "body", "text": "Minnesota point guard Jeff Teague returned after missing seven games with a sprained MCL in his left knee. Teague played 26 minutes and scored eight points with four rebounds and three assists."}
{"game_id": "0021700611", "chunk_id": "0021700611_023", "order": 23, "role": "body", "text": "Including a four-game absence for a sore right Achilles, Teague has missed 11 games this season. The Wolves are 6-5 without Teague and 20-11 with him in the lineup."}
{"game_id": "0021700611", "chunk_id": "0021700611_024", "order": 24, "role": "body", "text": "In his first season in Minnesota, Teague entered the night averaging 13.4 points and a team-high 7.3 assists per game."}
{"game_id": "0021700611", "chunk_id": "0021700611_026", "order": 26, "role": "body", "text": "Thunder: Play at Charlotte on Saturday."}
{"game_id": "0021700611", "chunk_id": "0021700611_027", "order": 27, "role": "body", "text": "Timberwolves: Host the New York Knicks on Friday."}
{"game_id": "0021700611", "chunk_id": "0021700611_029", "order": 29, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
