{"game_id": "0021700627", "chunk_id": "0021700627_001", "order": 1, "role": "lead", "text": "DALLAS --  With a matinee game in the middle of a road trip, Dallas native Julius Randle had a rare opportunity to enjoy a night off in his hometown."}
{"game_id": "0021700627", "chunk_id": "0021700627_002", "order": 2, "role": "body", "text": "He already had a good afternoon."}
{"game_id": "0021700627", "chunk_id": "0021700627_003", "order": 3, "role": "body", "text": "Randle had 23 points and 15 rebounds, including a follow shot late in overtime that helped the Los Angeles Lakers seal a 107-101 victory over the Mavericks on Saturday."}
{"game_id": "0021700627", "chunk_id": "0021700627_004", "order": 4, "role": "body", "text": "\"Yeah, I'm going to enjoy it for sure,\" Randle said. \"I've got my little man here, got my wife here, my family. I'm going to enjoy this night.\""}
{"game_id": "0021700627", "chunk_id": "0021700627_005", "order": 5, "role": "body", "text": "With his team leading 104-101, Randle grabbed a rebound on Lonzo Ball's missed jump shot and scored on the rebound with 18 seconds remaining, giving the Lakers a five-point lead they preserved to extend their winning streak to a season-best four games."}
{"game_id": "0021700627", "chunk_id": "0021700627_006", "order": 6, "role": "body", "text": "\"That's a tough place to win, so it's a good job getting this win on the road,\" Randle said."}
{"game_id": "0021700627", "chunk_id": "0021700627_007", "order": 7, "role": "body", "text": "The Lakers (15-27) trailed by double digits in the fourth quarter, but battled back for their first win against the Mavericks in 15 tries and their first victory in Dallas since Feb. 24, 2013."}
{"game_id": "0021700627", "chunk_id": "0021700627_008", "order": 8, "role": "body", "text": "\"We just didn't want to lose,\" guard Jordan Clarkson said."}
{"game_id": "0021700627", "chunk_id": "0021700627_009", "order": 9, "role": "body", "text": "Clarkson added 19 points, Kyle Kuzma had 18, and Kentavious Caldwell-Pope scored 17."}
{"game_id": "0021700627", "chunk_id": "0021700627_010", "order": 10, "role": "body", "text": "Rookie Dennis Smith Jr. had 23 points, 17 in the first half, as the Mavericks (15-29) had a two-game win streak snapped. Harrison Barnes and Wesley Matthews each had 17 points for Dallas."}
{"game_id": "0021700627", "chunk_id": "0021700627_011", "order": 11, "role": "body", "text": "Randle scored six points in overtime, including a fadeaway shot with 2:35 remaining that gave the Lakers a 102-99 lead."}
{"game_id": "0021700627", "chunk_id": "0021700627_012", "order": 12, "role": "body", "text": "\"He was just being a beast tonight,\" Smith said. \"Using his power all game, he was relentless. So it worked out pretty well for them.\""}
{"game_id": "0021700627", "chunk_id": "0021700627_013", "order": 13, "role": "body", "text": "Each team had a chance to win the game in final seconds of regulation."}
{"game_id": "0021700627", "chunk_id": "0021700627_014", "order": 14, "role": "body", "text": "Barnes made a pull-up jumper in the paint to tie the game at 95 with 5.9 seconds remaining. The Lakers called a timeout but couldn't get off a clean shot before the buzzer."}
{"game_id": "0021700627", "chunk_id": "0021700627_015", "order": 15, "role": "body", "text": "\"I told them going into overtime, `All right, it's time to regroup now,\" Lakers coach Luke Walton said. \"They made some tough shots (at the end of regulation), and now it's time to refocus. We've been in overtime games before, and let's take it possession by possession.\""}
{"game_id": "0021700627", "chunk_id": "0021700627_016", "order": 16, "role": "body", "text": "There were six ties and 12 lead changes in the game, and the Lakers turned it into a close game when they orchestrated a 15-3 run in the fourth quarter, erasing the 80-70 lead that Dallas had taken early in the fourth quarter on a 3-pointer by Dirk Nowitzki."}
{"game_id": "0021700627", "chunk_id": "0021700627_017", "order": 17, "role": "body", "text": "\"We gave up the 10-point lead in the fourth, we obviously lost some defensive edge there,\" Mavericks coach Rick Carlisle said. \"We just weren't able to stop them. That was really it.\""}
{"game_id": "0021700627", "chunk_id": "0021700627_018", "order": 18, "role": "body", "text": "Los Angeles played most of the game without Brandon Ingram, who had four points in the first half before a sprained left ankle pulled him from the game."}
{"game_id": "0021700627", "chunk_id": "0021700627_019", "order": 19, "role": "body", "text": "\"It's a mild ankle sprain, day-to-day. I think they took him back to get some X-rays. I don't know that part of it, but he's day-to-day right now,\" Walton said. \"We're obviously hopeful that he'll be able to get back with us because we need what he does out there on the court.\""}
{"game_id": "0021700627", "chunk_id": "0021700627_021", "order": 21, "role": "body", "text": "Lakers: The Lakers' four-game win streak comes after a season-worst, nine-game skid."}
{"game_id": "0021700627", "chunk_id": "0021700627_022", "order": 22, "role": "body", "text": "Mavericks: G Kyle Collingsworth was signed to a 10-day contract on Saturday. Collingsworth was originally signed to a two-way contract by Dallas on Dec. 19 but had been waived on Jan. 10 after playing in four games."}
{"game_id": "0021700627", "chunk_id": "0021700627_024", "order": 24, "role": "body", "text": "Kuzma had his 10th double-double of the season with 18 points and 10 rebounds. Kuzma also had three assists and a steal in 36 minutes off the bench."}
{"game_id": "0021700627", "chunk_id": "0021700627_026", "order": 26, "role": "body", "text": "Nowitzki passed former Laker Jerry West with his 7,161st career free throw made in the second quarter, taking sole possession of sixth in NBA history. Nowitzki finished 3 for 4 from the line and now has 7,163 makes in his career. Michael Jordan ranks fifth all-time with 7,327 made free throws."}
{"game_id": "0021700627", "chunk_id": "0021700627_028", "order": 28, "role": "body", "text": "Lakers: Visit the Memphis Grizzlies on Monday."}
{"game_id": "0021700627", "chunk_id": "0021700627_029", "order": 29, "role": "body", "text": "Mavericks: Visit the Denver Nuggets on Tuesday."}
{"game_id": "0021700627", "chunk_id": "0021700627_031", "order": 31, "role": "body", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
{"game_id": "0021700627", "chunk_id": "0021700627_033", "order": 33, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
