{"game_id": "0021700548", "chunk_id": "0021700548_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  A mix of younger players and veterans is working quite nicely for the streaking Minnesota Timberwolves."}
{"game_id": "0021700548", "chunk_id": "0021700548_002", "order": 2, "role": "body", "text": "Jimmy Butler scored 28 points and Minnesota started fast and held off the struggling Los Angeles Lakers 114-96 on Monday night."}
{"game_id": "0021700548", "chunk_id": "0021700548_003", "order": 3, "role": "body", "text": "Karl-Anthony Towns recorded his 30th double-double of the season with 16 points and 13 rebounds to help Minnesota win for the seventh time in eight games and 10th in 13."}
{"game_id": "0021700548", "chunk_id": "0021700548_004", "order": 4, "role": "body", "text": "\"We're striving to be good, we just got to continue to keep growing, continue to be great and don't get bored with the process,\" Towns said. \"We're finding some success right now. Don't get too comfortable with it.\""}
{"game_id": "0021700548", "chunk_id": "0021700548_005", "order": 5, "role": "body", "text": "Butler and Taj Gibson were brought to Minnesota in large part to help players like Towns and Andrew Wiggins continue to develop."}
{"game_id": "0021700548", "chunk_id": "0021700548_006", "order": 6, "role": "body", "text": "\"There's a lot of players that end up with stats in this league and they don't win. So maybe you sacrifice some of the individual stuff, but you're impacting winning in a far greater way,\" coach Tom Thibodeau said."}
{"game_id": "0021700548", "chunk_id": "0021700548_007", "order": 7, "role": "body", "text": "\"Guys are cutting a lot better now. They know if they're open Jimmy will find them. I think KAT is starting to see things. He's making a lot of great plays. Wigs is starting to see things and that's great for our team.\""}
{"game_id": "0021700548", "chunk_id": "0021700548_008", "order": 8, "role": "body", "text": "Wiggins scored 21 points and grabbed a season-high nine rebounds."}
{"game_id": "0021700548", "chunk_id": "0021700548_009", "order": 9, "role": "body", "text": "\"Doing whatever I can to help the team,\" he said."}
{"game_id": "0021700548", "chunk_id": "0021700548_010", "order": 10, "role": "body", "text": "Jordan Clarkson scored 20 points off the bench for the Lakers, who've lost seven in a row and 10 of 11. Los Angeles was again missing three starters: center Brook Lopez (ankle), and guards Kentavious Caldwell-Pope (legal) and Lonzo Ball (shoulder)."}
{"game_id": "0021700548", "chunk_id": "0021700548_011", "order": 11, "role": "body", "text": "Julius Randle had 15 points and 12 rebounds, and Brandon Ingram had 14 points for Los Angeles. Kyle Kuzma, the team's leading scorer at 17.9 points per game, played just 18 minutes and scored all of his six points in the third quarter."}
{"game_id": "0021700548", "chunk_id": "0021700548_012", "order": 12, "role": "body", "text": "\"I've been banged up the past four games. It's a reoccurrence,\" he said. \"It's my thigh . been getting hit same part every game.\""}
{"game_id": "0021700548", "chunk_id": "0021700548_013", "order": 13, "role": "body", "text": "With its early commanding lead whittled to as little as five points early in the third quarter, the Timberwolves went on a 13-0 run late in the quarter to rebuild a big lead."}
{"game_id": "0021700548", "chunk_id": "0021700548_014", "order": 14, "role": "body", "text": "After scoring the first 17 points in Sunday's win in Indiana, a franchise best, Minnesota nearly broke the record."}
{"game_id": "0021700548", "chunk_id": "0021700548_015", "order": 15, "role": "body", "text": "Wiggins scored nine points as the Timberwolves jumped to a 16-0 lead. He also added an alley-oop feed for a dunk by Butler and grabbed a couple rebounds."}
{"game_id": "0021700548", "chunk_id": "0021700548_016", "order": 16, "role": "body", "text": "\"I think a lot of times early, we were winning, but we were just winning on talent. I think these last two games we've done a great job winning with execution,\" Towns said."}
{"game_id": "0021700548", "chunk_id": "0021700548_017", "order": 17, "role": "body", "text": "Los Angeles, which had eight of its 24 turnovers in the opening 12 minutes, got within 30-18 by quarter's end. All the Lakers' points came from the bench after the starters were pulled 3:36 into the game."}
{"game_id": "0021700548", "chunk_id": "0021700548_018", "order": 18, "role": "body", "text": "\"The turnovers are the most frustrating part,\" said coach Luke Walton. \"I can't blame just turnovers on them going up 16-0 and us not playing with energy, and us not putting pressure on the defense even though that was the whole message going into the game.\""}
{"game_id": "0021700548", "chunk_id": "0021700548_020", "order": 20, "role": "body", "text": "Lakers: Los Angeles wore its light blue throwback uniforms with MPLS on front. ... Ball (left shoulder sprain) missed his fifth straight game. ... Caldwell-Pope likely missed his last road game due to a legal travel restriction stemming from a March 2017 incident. The Lakers are not away from Staples Center until Jan. 13."}
{"game_id": "0021700548", "chunk_id": "0021700548_021", "order": 21, "role": "body", "text": "Timberwolves: Butler has at least 20 points in eight straight games. . C Gorgui Dieng had 17 points off the bench. . Towns had four fouls -- three offensive. ... Minnesota is 11-1 at Target Center against Western Conference foes; 2-5 vs. Eastern Conference teams."}
{"game_id": "0021700548", "chunk_id": "0021700548_023", "order": 23, "role": "body", "text": "The announced crowd was 18,978, Minnesota's second straight sellout and just the fifth this season. Entering the night, Minnesota averaged 15,864 fans, fourth-worst in the NBA."}
{"game_id": "0021700548", "chunk_id": "0021700548_024", "order": 24, "role": "body", "text": "The last time Minnesota had consecutive full houses was when Kevin Garnett returned to the team Feb. 25-28, 2015."}
{"game_id": "0021700548", "chunk_id": "0021700548_026", "order": 26, "role": "body", "text": "Lakers: Open a five-game homestand Wednesday against Oklahoma City."}
{"game_id": "0021700548", "chunk_id": "0021700548_027", "order": 27, "role": "body", "text": "Timberwolves: At Brooklyn Wednesday."}
{"game_id": "0021700548", "chunk_id": "0021700548_029", "order": 29, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
