{"game_id": "0021701177", "chunk_id": "0021701177_001", "order": 1, "role": "lead", "text": "HOUSTON --  Chris Paul didn't have a great game Tuesday after missing five of the previous six games to rest while dealing with minor injuries."}
{"game_id": "0021701177", "chunk_id": "0021701177_002", "order": 2, "role": "body", "text": "The nine-time All-Star was back to his old self Thursday night."}
{"game_id": "0021701177", "chunk_id": "0021701177_003", "order": 3, "role": "body", "text": "Paul hit an off-balance layup with 0.8 seconds left to lift the Houston Rockets to a 96-94 win over the Portland Trail Blazers, who were without start Damian Lillard."}
{"game_id": "0021701177", "chunk_id": "0021701177_004", "order": 4, "role": "body", "text": "Paul scored 27 points to help Houston get its second straight victory since a loss to San Antonio. The Rockets swept their four-game season series with Portland."}
{"game_id": "0021701177", "chunk_id": "0021701177_005", "order": 5, "role": "body", "text": "The performance came after he finished with just eight points on 3-of-11 shooting in Houston's last game."}
{"game_id": "0021701177", "chunk_id": "0021701177_006", "order": 6, "role": "body", "text": "\"There was no doubt that he was going to get back in his game,\" coach Mike D'Antoni said. \"This is really good for him.\""}
{"game_id": "0021701177", "chunk_id": "0021701177_007", "order": 7, "role": "body", "text": "Paul said a strength of this team is that they have so many different options when they need a big play, like they did Thursday night."}
{"game_id": "0021701177", "chunk_id": "0021701177_008", "order": 8, "role": "body", "text": "\"James (Harden) can take it, I can take it, we've got other guys ... so you've got to make a choice,\" he said."}
{"game_id": "0021701177", "chunk_id": "0021701177_009", "order": 9, "role": "body", "text": "The Rockets led by 24 in the second quarter and still had a big lead with about five minutes left before the Trail Blazers went on a 19-2 run to tie it at 94 with 6.1 seconds left. James Harden, who finished with 24 points, missed two free throws with 13.3 seconds left before Pat Connaughton tied it with a short basket."}
{"game_id": "0021701177", "chunk_id": "0021701177_010", "order": 10, "role": "body", "text": "Paul made the winner before crashing to the court. It gave Houston its first points since Harden made a basket with just less than four minutes left. Portland had a chance to win it at the buzzer, but C.J. McCollum's 3-point attempt was off."}
{"game_id": "0021701177", "chunk_id": "0021701177_011", "order": 11, "role": "body", "text": "\"I was pleased with the way we finished the game ... it was too bad we couldn't go to overtime or win it,\" Portland coach Terry Stotts said."}
{"game_id": "0021701177", "chunk_id": "0021701177_012", "order": 12, "role": "body", "text": "Lillard sat out after spraining his left ankle Tuesday against Dallas. Stotts didn't set a return date but did say he expects to see him in a game before the playoffs begin."}
{"game_id": "0021701177", "chunk_id": "0021701177_013", "order": 13, "role": "body", "text": "McCollum led the Trail Blazers with 16 points, and Jusuf Nurkic had 14 points and 11 rebounds."}
{"game_id": "0021701177", "chunk_id": "0021701177_014", "order": 14, "role": "body", "text": "Portland scored the first seven points of the second half and cut a 22-point halftime deficit to 13 at the beginning of the fourth. The Trail Blazers were down by 18 late in the third quarter before capping it with a five straight points to cut it to 84-71 entering the fourth."}
{"game_id": "0021701177", "chunk_id": "0021701177_015", "order": 15, "role": "body", "text": "A basket by Shabazz Napier got the Trail Blazers within 85-75 with about 10 minutes left before both teams began struggling offensively. The teams combined to miss 10 shots over the next three minutes before Clint Capela ended Houston's drought with a dunk. That started a 7-0 run for the Rockets that made it 92-75."}
{"game_id": "0021701177", "chunk_id": "0021701177_016", "order": 16, "role": "body", "text": "Harden was shaken up when Wade Baldwin pushed him in the torso as he attempted a layup with about 3 1/2 minutes left in the second quarter. He fell to his knees and stayed on the court for a minute before talking to a trainer and remaining in the game."}
{"game_id": "0021701177", "chunk_id": "0021701177_017", "order": 17, "role": "body", "text": "The Rockets led 66-44 at halftime behind 20 points from Paul and 15 points from Harden."}
{"game_id": "0021701177", "chunk_id": "0021701177_019", "order": 19, "role": "body", "text": "Trail Blazers: Portland had 18 turnovers. ... They made 7 of 22 3-pointers. ... Baldwin had 14 points off the bench."}
{"game_id": "0021701177", "chunk_id": "0021701177_020", "order": 20, "role": "body", "text": "Rockets: Ryan Anderson sat out with a sprained left ankle. ... Eric Gordon missed the game because of a foot injury. ... Capela had 11 points and 10 rebounds."}
{"game_id": "0021701177", "chunk_id": "0021701177_022", "order": 22, "role": "body", "text": "Several celebrities sat on the front row near Rockets owner Tilman Fertitta. Houston Astros ace Justin Verlander and wife/model Kate Upton were fashionably late, strolling in with Astros owner Jim Crane and wife Whitney during the second quarter. Verlander was wearing the World Series championship ring he received Tuesday night and proudly displayed it when he was introduced to the crowd in the third quarter. Houston Texans quarterback Deshaun Watson arrived early, taking in pregame warmups with rapper Travis Scott. The two received a loud ovation when the arena played one of Scott's hits and showed them on the Jumbotron in the first half."}
{"game_id": "0021701177", "chunk_id": "0021701177_024", "order": 24, "role": "body", "text": "During a timeout in the fourth quarter, Crane presented Fertitta with a World Series ring. The Astros owner said: \"I wanted to give you a little bit of our luck and good fortune and give you a championship ring.\" After presenting it to him, he added that he would be expecting Fertitta to return the favor if the Rockets win it all this season."}
{"game_id": "0021701177", "chunk_id": "0021701177_025", "order": 25, "role": "body", "text": "Crane was very generous with the rings following Houston's first World Series win last season and is handing out more than 1,300 to players, coaches, staff and even seasonal employees this week."}
{"game_id": "0021701177", "chunk_id": "0021701177_027", "order": 27, "role": "body", "text": "Trail Blazers: Visit San Antonio on Saturday."}
{"game_id": "0021701177", "chunk_id": "0021701177_028", "order": 28, "role": "body", "text": "Rockets: Host Oklahoma City on Saturday."}
{"game_id": "0021701177", "chunk_id": "0021701177_030", "order": 30, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
