{"game_id": "0021700785", "chunk_id": "0021700785_001", "order": 1, "role": "lead", "text": "NEW YORK --  Giannis Antetokounmpo was planning to come back in, though his coach seemed to have other ideas."}
{"game_id": "0021700785", "chunk_id": "0021700785_002", "order": 2, "role": "body", "text": "Eric Bledsoe and the Bucks made it a moot point."}
{"game_id": "0021700785", "chunk_id": "0021700785_003", "order": 3, "role": "body", "text": "Bledsoe scored 28 points, John Henson had season highs with 19 points and 18 rebounds, and Milwaukee easily extended its winning streak over the Brooklyn Nets to 10 games with a 109-94 victory Sunday."}
{"game_id": "0021700785", "chunk_id": "0021700785_004", "order": 4, "role": "body", "text": "Antetokounmpo twisted his right ankle with about 7  1/2 minutes remaining, not long after the Nets had cut what had been a 28-point deficit to seven. But the Bucks got the next two baskets after his departure to finish an 8-0 run and push the lead back to 15."}
{"game_id": "0021700785", "chunk_id": "0021700785_005", "order": 5, "role": "body", "text": "\"Giannis is a big piece of our team but we got other guys that can step up, especially down the stretch, and took on that role,\" Bledsoe said. \"We just stayed together and hopefully he's all right.\""}
{"game_id": "0021700785", "chunk_id": "0021700785_006", "order": 6, "role": "body", "text": "Antetokounmpo, who said he stepped on a Nets player's foot, was standing along the baseline near the bench after coming out, trying to get loose in case he was called on to return."}
{"game_id": "0021700785", "chunk_id": "0021700785_007", "order": 7, "role": "body", "text": "\"I knew that if the game was close I would definitely be back in,\" the All-Star forward said."}
{"game_id": "0021700785", "chunk_id": "0021700785_009", "order": 9, "role": "body", "text": "\"We had talked and we were pretty sure he wasn't going to be coming back,\" coach Joe Prunty said of his discussion with medical staff. \"At the end of the day, it was the trainer lets me know and we make a decision from there. But as the lead gets (bigger), yeah, there was no reason to.\""}
{"game_id": "0021700785", "chunk_id": "0021700785_010", "order": 10, "role": "body", "text": "Antetokounmpo and Khris Middleton each had 16 points for the Bucks, who improved to 6-1 since firing Jason Kidd and moved a season-best six games over .500 at 29-23."}
{"game_id": "0021700785", "chunk_id": "0021700785_011", "order": 11, "role": "body", "text": "DeMarre Carroll and Caris LeVert each scored 15 for the Nets, who lost for the sixth time in seven games."}
{"game_id": "0021700785", "chunk_id": "0021700785_012", "order": 12, "role": "body", "text": "The Bucks scored six straight points in the first 81 seconds to prompt a Nets timeout, pushed the lead into double digits later in the first quarter and led 36-22 at the end of the period."}
{"game_id": "0021700785", "chunk_id": "0021700785_013", "order": 13, "role": "body", "text": "\"Somehow, some reason, not ready. We weren't ready,\" Nets coach Kenny Atkinson said. \"I don't understand. I don't understand how that happens. A little upset with our group that we weren't ready mentally, physically.\""}
{"game_id": "0021700785", "chunk_id": "0021700785_014", "order": 14, "role": "body", "text": "Milwaukee led 62-41 at the break. The Bucks opened the second half with seven straight points as the lead peaked at 69-41 on Antetokounmpo's dunk."}
{"game_id": "0021700785", "chunk_id": "0021700785_015", "order": 15, "role": "body", "text": "With their length and athleticism, the Bucks looked like high schoolers playing against middle schoolers. They had seven blocked shots, including one by Antetokounmpo on Jarrett Allen to trigger a fast break in the third quarter, which ended with an alley-oop from Middleton to Henson."}
{"game_id": "0021700785", "chunk_id": "0021700785_016", "order": 16, "role": "body", "text": "The Nets finished the period with a flurry and trailed only 83-72 heading to the fourth."}
{"game_id": "0021700785", "chunk_id": "0021700785_018", "order": 18, "role": "body", "text": "Bucks: Jabari Parker had 11 points in 17 minutes off the bench in his second game since returning from ACL surgery. ... Milwaukee opened a four-game road trip and hangs around New York for a couple days before visiting the Knicks on Tuesday. Prunty was an assistant to Kidd in Brooklyn during the 2013-14 season"}
{"game_id": "0021700785", "chunk_id": "0021700785_019", "order": 19, "role": "body", "text": "Nets: Allen, who averaged 16 points on 82.6 percent shooting in first three starts, scored 14 on 7-of-11 shooting. ... D'Angelo Russell fouled out with nearly 11 minutes to play and finished with three points off the bench."}
{"game_id": "0021700785", "chunk_id": "0021700785_021", "order": 21, "role": "body", "text": "Prunty said backup G Matthew Dellavedova also hurt his ankle and both he and Antetokounmpo would be re-evaluated."}
{"game_id": "0021700785", "chunk_id": "0021700785_022", "order": 22, "role": "body", "text": "\"I've twisted it twice in the last five games, but I've just got to play through it,\" Antetokounmpo said. \"We've got a great medical staff that's going to take care of me and Delly and hopefully I can be ready to go on Tuesday against the Knicks.\""}
{"game_id": "0021700785", "chunk_id": "0021700785_024", "order": 24, "role": "body", "text": "Injured Nets guard Jeremy Lin, who played at Harvard, sat on bench wearing a Patriots sweatshirt under his jacket. Injured forward Rondae Hollis-Jefferson, from Chester, Pennsylvania, had an Eagles hooded sweatshirt under his jacket."}
{"game_id": "0021700785", "chunk_id": "0021700785_026", "order": 26, "role": "body", "text": "Bucks: Visit New York on Tuesday."}
{"game_id": "0021700785", "chunk_id": "0021700785_027", "order": 27, "role": "closing", "text": "Nets: Host Houston on Tuesday."}
