{"game_id": "0021401164", "chunk_id": "0021401164_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Isaiah Thomas had a season-high 34 points as the Boston Celtics picked up a key victory and eliminated Detroit from playoff contention, beating the Pistons 113-103 Wednesday night."}
{"game_id": "0021401164", "chunk_id": "0021401164_002", "order": 2, "role": "body", "text": "Thomas needed only 17 shots to put up his huge numbers, going 10 for 17 from the floor. He hit four of his eight 3-pointers, and went 10 for 11 from the line."}
{"game_id": "0021401164", "chunk_id": "0021401164_003", "order": 3, "role": "body", "text": "The victory moved Boston into a tie for seventh with Brooklyn in the Eastern Conference after the Nets lost to Atlanta."}
{"game_id": "0021401164", "chunk_id": "0021401164_004", "order": 4, "role": "body", "text": "Detroit's Stan Van Gundy, who had already been guaranteed the first losing season of his coaching career, will also miss the postseason for the first time."}
{"game_id": "0021401164", "chunk_id": "0021401164_005", "order": 5, "role": "body", "text": "Jae Crowder added 17 for Boston, while Reggie Jackson had 21 points and 15 assists. Greg Monroe had 19 points and 10 rebounds for the Pistons, and Andre Drummond added 22 points and 14 rebounds."}
{"game_id": "0021401164", "chunk_id": "0021401164_006", "order": 6, "role": "body", "text": "Monroe returned after missing 11 games with a knee sprain, and looked good with two early baskets, including a dunk."}
{"game_id": "0021401164", "chunk_id": "0021401164_007", "order": 7, "role": "body", "text": "That was the only good news early for Detroit, though, as the Celtics scored the last 18 points of the quarter to take a 30-16 lead. Thomas, who has a famous name at the Palace -- even though the first-name spelling is different from the one in the rafters -- had nine points in the quarter, including a 3-pointer at the buzzer."}
{"game_id": "0021401164", "chunk_id": "0021401164_008", "order": 8, "role": "body", "text": "The Pistons rallied in the second period, hitting seven of their first eight shots, but Boston still had a 55-47 lead at the intermission. Monroe led Detroit with 12 points and five rebounds, while Thomas had 11 points for Boston and Brandon Bass added 11."}
{"game_id": "0021401164", "chunk_id": "0021401164_009", "order": 9, "role": "body", "text": "Having Monroe back also seemed to solve Detroit's recent defensive-rebounding problems. Still, Boston had a 14-6 edge in points off turnovers and an 18-4 advantage in free throws."}
{"game_id": "0021401164", "chunk_id": "0021401164_010", "order": 10, "role": "body", "text": "Van Gundy benched Drummond early in the third quarter after he allowed an easy dunk by Kelly Olynyk. The move seemed to spark the Pistons, who got within a point, but three-point plays by Thomas and Crowder helped Boston pull back away."}
{"game_id": "0021401164", "chunk_id": "0021401164_011", "order": 11, "role": "body", "text": "This time, the Celtics finished the quarter with a 19-4 run, including 13 from Thomas, to take a 91-74 lead into the fourth."}
{"game_id": "0021401164", "chunk_id": "0021401164_012", "order": 12, "role": "body", "text": "Thomas made sure the Pistons never made a serious run down the stretch."}
{"game_id": "0021401164", "chunk_id": "0021401164_014", "order": 14, "role": "body", "text": "Celtics: Jonas Jerebko got a loud ovation when checking into the game late in the first period. Jerebko was drafted by Detroit in 2009, and was the team's longest-serving player when he was sent to Boston in a trading-deadline deal for Tayshaun Prince."}
{"game_id": "0021401164", "chunk_id": "0021401164_015", "order": 15, "role": "body", "text": "Pistons: Jackson averaged 20.9 points and 10.8 assists while Monroe was out, taking advantage of less traffic in the paint to put up a 20/20 game and two triple-doubles. That could easily be the situation next season, with Monroe expected to leave as an unrestricted free agent, but they worked well together on Wednesday."}
{"game_id": "0021401164", "chunk_id": "0021401164_017", "order": 17, "role": "body", "text": "Celtics: At the Cavaliers on Friday."}
{"game_id": "0021401164", "chunk_id": "0021401164_018", "order": 18, "role": "closing", "text": "Pistons: Host the Pacers on Friday."}
