{"game_id": "0021200838", "chunk_id": "0021200838_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  The Oklahoma City Thunder went from being disappointed in their defense to making the Chicago Bulls embarrassed about their offense."}
{"game_id": "0021200838", "chunk_id": "0021200838_002", "order": 2, "role": "body", "text": "Russell Westbrook scored 23 points, Kevin Durant and Serge Ibaka both contributed double-doubles and the Thunder held Chicago to the worst shooting performance in the NBA this season, beating the Bulls 102-72 on Sunday night."}
{"game_id": "0021200838", "chunk_id": "0021200838_003", "order": 3, "role": "body", "text": "The Thunder, who had allowed an average of 113 points over their previous four games, broke out of a rough defensive patch by limiting Chicago to 29.1 percent shooting."}
{"game_id": "0021200838", "chunk_id": "0021200838_004", "order": 4, "role": "body", "text": "\"We made them miss tonight. We got a hand up, we clogged the paint. We just made the second and third efforts, and once we do that, we're a pretty good defensive team,\" Durant said."}
{"game_id": "0021200838", "chunk_id": "0021200838_005", "order": 5, "role": "body", "text": "The Bulls also had their worst shooting performance of last season in Oklahoma City, when they connected on just 33 percent, but this one was far worse. Midway through the third quarter, Chicago had missed 44 of its 55 shots and was on pace for the worst shooting night in franchise history."}
{"game_id": "0021200838", "chunk_id": "0021200838_006", "order": 6, "role": "body", "text": "\"The way we competed was just embarrassing,\" said Joakim Noah, who had eight points and nine rebounds. \"The way we competed was bad."}
{"game_id": "0021200838", "chunk_id": "0021200838_007", "order": 7, "role": "body", "text": "\"It's not time to feel sorry for ourselves.\""}
{"game_id": "0021200838", "chunk_id": "0021200838_008", "order": 8, "role": "body", "text": "Durant had 19 points, 16 rebounds and six assists, and Ibaka had 17 points, 10 rebounds and three blocks as Oklahoma City won its second straight after losing three in a row for the first time this season. The Thunder also had the previous best defensive performance of the season by holding Charlotte to 29.11 percent shooting in a 114-69 blowout in November."}
{"game_id": "0021200838", "chunk_id": "0021200838_009", "order": 9, "role": "body", "text": "Chicago's final percentage of 29.06, on 25 for 86 shooting, was a smidgen worse."}
{"game_id": "0021200838", "chunk_id": "0021200838_010", "order": 10, "role": "body", "text": "\"We did a lot of good things, but at the same time, it's the NBA. Maybe they had a night off or something like this,\" Oklahoma City defensive stopper Thabo Sefolosha said. \"Credit to the way we prepared this game mentally, the way we came out, but at the same time, we can't see ourselves as too good."}
{"game_id": "0021200838", "chunk_id": "0021200838_011", "order": 11, "role": "body", "text": "\"We did a lot of good things but we've got to keep it up.\""}
{"game_id": "0021200838", "chunk_id": "0021200838_012", "order": 12, "role": "body", "text": "Nate Robinson, who was 2 for 14 from the field, and Luol Deng had 13 points apiece to lead Chicago. Carlos Boozer had just two points, making one of his five shots. Curiously, the Bulls also are responsible for the best shooting percentage by a team this season -- making 63.8 percent against Cleveland in November."}
{"game_id": "0021200838", "chunk_id": "0021200838_013", "order": 13, "role": "body", "text": "\"You have to do what's best for the team, not necessarily what's best for yourself to get yourself going,\" said Bulls coach Tom Thibodeau said, blaming his team for taking the wrong shots and having a quick trigger. \"You can't get stuck in whatever problems you're having individually. You have to do your job for the team first.\""}
{"game_id": "0021200838", "chunk_id": "0021200838_014", "order": 14, "role": "body", "text": "The Bulls played without point guards Derrick Rose (knee) and Kirk Hinrich (elbow) and went with the 5-foot-9 Robinson at the point against Westbrook, an All-Star. Their offense never got going."}
{"game_id": "0021200838", "chunk_id": "0021200838_015", "order": 15, "role": "body", "text": "\"We've got enough. We have to do our jobs. We've shown when we do that, we're capable of beating anyone,\" Thibodeau said. \"We have to be mentally tougher, we have to be stronger. When you face a little bit of adversity with whatever, when you're short-handed, you have to dig down and get the job done.\""}
{"game_id": "0021200838", "chunk_id": "0021200838_016", "order": 16, "role": "body", "text": "Noah said no matter who's on the court, the execution has to be better."}
{"game_id": "0021200838", "chunk_id": "0021200838_017", "order": 17, "role": "body", "text": "Chicago spent most of the first half shooting less than 20 percent from the field but stayed in the game by forcing the Thunder into turnovers. Oklahoma City created some cushion with an 8-0 run featuring transition layups by Westbrook and Sefolosha to go up 46-27 with 2 minutes left before halftime."}
{"game_id": "0021200838", "chunk_id": "0021200838_018", "order": 18, "role": "body", "text": "The Bulls answered back with their highest-scoring stretch of the half, piecing together nine straight points -- seven on free throws -- to get back within 10 before Sefolosha's three-point play made it 49-36 at halftime."}
{"game_id": "0021200838", "chunk_id": "0021200838_019", "order": 19, "role": "body", "text": "Oklahoma City then used a 16-4 run highlighted by Westbrook's soaring right-handed slam to go up 68-34 midway through the third quarter."}
{"game_id": "0021200838", "chunk_id": "0021200838_020", "order": 20, "role": "body", "text": "\"I thought the defense was OK in the first half. Our offense hurt us. I thought we had a shot to get back in it at the end of the second quarter. We started off the third quarter with low energy, tough shots, no defense and game over,\" Thibodeau said."}
{"game_id": "0021200838", "chunk_id": "0021200838_021", "order": 21, "role": "body", "text": "Each of the Thunder's previous four opponents had made at least 46 percent from the field against a team that prides itself on being among the NBA's best defenses -- in addition to being the highest-scoring team. Oklahoma City was able to avoid giving up at least 100 points in a fifth straight game for the first time since January 2011."}
{"game_id": "0021200838", "chunk_id": "0021200838_022", "order": 22, "role": "body", "text": "\"It's a long season and anything can happen,\" Ibaka said. \"The most important (thing) for us is every time when we've lost our defensive mindset, we know that it's not our basketball, so we try to get it back every time.\""}
{"game_id": "0021200838", "chunk_id": "0021200838_023", "order": 23, "role": "closing", "text": "Game notes Ronnie Brewer, acquired by Oklahoma City in a trade deadline deal with New York on Thursday, attended the game but did not play against his former Bulls teammates. \"When I was in Chicago, it was a close-knit group. We thought we were so close to winning a championship,\" Brewer said. Thunder coach Scott Brooks said he still hasn't figured out how Brewer will fit into the team's rotation. ... Bulls reserve Taj Gibson sprained his left knee in the fourth quarter and did not return. ... Chicago's franchise-worst shooting percentage is 23.4 in a game against Miami in 1999."}
