{"game_id": "0021700950", "chunk_id": "0021700950_001", "order": 1, "role": "lead", "text": "CLEVELAND --  As Larry Nance Sr. waited in the hallway following the best game of his son's career, the former All-Star was approached by a young Cavaliers fan."}
{"game_id": "0021700950", "chunk_id": "0021700950_002", "order": 2, "role": "body", "text": "\"I'm not Larry Nance Sr.,\" he said, reaching down to shake hands with the youngster. \"I'm Larry Nance Jr.'s father.\""}
{"game_id": "0021700950", "chunk_id": "0021700950_003", "order": 3, "role": "body", "text": "And a proud papa. His kid put on quite a show."}
{"game_id": "0021700950", "chunk_id": "0021700950_004", "order": 4, "role": "body", "text": "Nance posted career highs with 22 points and 15 rebounds in his first start for Cleveland, and the Cavaliers closed a disappointing five-game homestand on a positive note with a 112-90 win Monday night over the Detroit Pistons, who haven't won on the road in nearly two months."}
{"game_id": "0021700950", "chunk_id": "0021700950_005", "order": 5, "role": "body", "text": "LeBron James scored 31 points before taking a seat on the bench after the Cavs outscored the Pistons 36-21 in the third quarter to blow it open."}
{"game_id": "0021700950", "chunk_id": "0021700950_007", "order": 7, "role": "body", "text": "With Cleveland missing three big men -- All-Star Kevin Love, Tristan Thompson and Jeff Green -- because of injuries, the Cavs needed someone to step up and Nance came through. Wearing the same No. 22 his father had retired by Cleveland, the 25-year-old Nance had the best game of his young career."}
{"game_id": "0021700950", "chunk_id": "0021700950_008", "order": 8, "role": "body", "text": "\"It just kind of felt easy,\" Nance said. \"The guys were giving me all the opportunity in the world to make my shots, and I just happened to be making them.\""}
{"game_id": "0021700950", "chunk_id": "0021700950_009", "order": 9, "role": "body", "text": "It was only one game, but Cleveland's latest look was encouraging. The Cavs have been in a funk lately as they try to integrate four new players, but they got a win before embarking on a two-week, six-game trip."}
{"game_id": "0021700950", "chunk_id": "0021700950_010", "order": 10, "role": "body", "text": "Cavs coach Tyronn Lue will stick with Nance as a starter while Thompson recovers from a sprained right ankle that will keep him out at least two weeks. And beyond that, it's possible Lue could keep Nance in his first five."}
{"game_id": "0021700950", "chunk_id": "0021700950_011", "order": 11, "role": "body", "text": "Since joining Cleveland in a trade last month, Nance has shown he can consistently make a mid-range jumper that he rarely tried with the Lakers."}
{"game_id": "0021700950", "chunk_id": "0021700950_012", "order": 12, "role": "body", "text": "\"I didn't know he could shoot it,\" Lue said. \"He never shot it in L.A. But coming here, just watching him shoot, he has 3-point range also, which I didn't know. If he can continue to make that shot, it helps our offense out tremendously.\""}
{"game_id": "0021700950", "chunk_id": "0021700950_013", "order": 13, "role": "body", "text": "Nance said the new surroundings have freed him up to show more of his game."}
{"game_id": "0021700950", "chunk_id": "0021700950_014", "order": 14, "role": "body", "text": "\"Whatever it was, I just wasn't that comfortable shooting them in L.A.,\" he said. \"But whether it's the coaching staff or the guys, they have the utmost confidence in me shooting that shot and I feel great shooting it, too.\""}
{"game_id": "0021700950", "chunk_id": "0021700950_015", "order": 15, "role": "body", "text": "James was his usual brilliant self, making 5 of 7 3-pointers and adding seven rebounds and seven assists. With the Cavs comfortably ahead, James sat the entire fourth quarter, a rarity in this odd season."}
{"game_id": "0021700950", "chunk_id": "0021700950_016", "order": 16, "role": "body", "text": "Blake Griffin scored 25 to lead Detroit, which has lost nine straight away from home. The Pistons haven't won on the road since Jan. 10. Andre Drummond scored 15 but didn't reach double-digit rebounds for the first time in 19 games."}
{"game_id": "0021700950", "chunk_id": "0021700950_017", "order": 17, "role": "body", "text": "James led the way, but it was Nance who helped negate Drummond and Detroit's size advantage with several big plays. By halftime, Nance had matched his career best with 18 points."}
{"game_id": "0021700950", "chunk_id": "0021700950_018", "order": 18, "role": "body", "text": "Griffin credited Nance with fueling the Cavs."}
{"game_id": "0021700950", "chunk_id": "0021700950_019", "order": 19, "role": "body", "text": "\"Just his energy alone, forget the points, his second-chance rebounds, his hustle plays were a difference maker,\" Griffin said. \"He plays very, very hard. He's talented. He's got a high ceiling.\""}
{"game_id": "0021700950", "chunk_id": "0021700950_021", "order": 21, "role": "body", "text": "For the second straight game, Nance upstaged James with a sensational dunk."}
{"game_id": "0021700950", "chunk_id": "0021700950_022", "order": 22, "role": "body", "text": "J.R. Smith scooped a pass toward the rim that Nance grabbed with one hand and slammed home, triggering another eruption from the crowd and his teammates on the bench."}
{"game_id": "0021700950", "chunk_id": "0021700950_023", "order": 23, "role": "body", "text": "\"It was a heck of a pass,\" Nance said. \"It was right on the money.\""}
{"game_id": "0021700950", "chunk_id": "0021700950_025", "order": 25, "role": "body", "text": "Detroit fell to 2-9 since Feb. 9 and is 6-9 since Griffin arrived in a blockbuster trade. Drummond and Griffin were both assessed technicals against the Cavs."}
{"game_id": "0021700950", "chunk_id": "0021700950_026", "order": 26, "role": "body", "text": "\"We aren't giving ourselves much of a chance to win because we're playing so frustrated right now -- frustrated with the referees, frustrated even more by the ball not going in the basket,\" coach Stan Van Gundey said. \"It's very hard to play like that.\""}
{"game_id": "0021700950", "chunk_id": "0021700950_028", "order": 28, "role": "body", "text": "Pistons: Van Gundy doesn't have a timetable for G Reggie Jackson's return. He's been out since Dec. 26 with a sprained right ankle. The Pistons are 10-21 since his injury. \"There's nothing imminent with him,\" Van Gundy said. \"He did a little bit of one-on-one against one of the video guys today, but that's as far along as he is.\""}
{"game_id": "0021700950", "chunk_id": "0021700950_029", "order": 29, "role": "body", "text": "Cavaliers: J.R. Smith had another head-scratching game, failing to score in 22 minutes. He scored 19 in the second half Saturday after not attempting a shot in the first half. ... Green (sore lower back) moved with ease while doing drills following the morning shootaround. He felt good enough Sunday to go roller skating along with Smith and James, who posted video of the outing on Instagram."}
{"game_id": "0021700950", "chunk_id": "0021700950_031", "order": 31, "role": "body", "text": "Pistons: Host Toronto on Wednesday."}
{"game_id": "0021700950", "chunk_id": "0021700950_032", "order": 32, "role": "body", "text": "Cavaliers: Begin a six-game road trip in Denver on Wednesday."}
{"game_id": "0021700950", "chunk_id": "0021700950_034", "order": 34, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
