{"game_id": "0021701187", "chunk_id": "0021701187_001", "order": 1, "role": "lead", "text": "TORONTO -- There's a new regular-season champion in the Eastern Conference.\nSerge Ibaka scored a season-high 25 points, DeMar DeRozan had 12 and the Toronto Raptors beat the Indiana Pacers 92-73 on Friday night, clinching the top seed in the East for the first time in team history.\n\"There's gratification, but you're not satisfied,\" Raptors coach Dwane Casey said. \"We haven't got to our ultimate goal, but it's a feeling of gratification.\""}
{"game_id": "0021701187", "chunk_id": "0021701187_002", "order": 2, "role": "closing", "text": "Jakob Poeltl scored 10 points as the Raptors set franchise records for wins in a season (57) and home wins (33).\n\"We've got home-court advantage throughout the [East] playoffs,\" DeRozan said, \"so let's use that to our advantage.\"\nThe Raptors have lost to LeBron James and the Cavaliers in each of the past two postseasons, including a conference finals defeat two years ago and a second-round exit last spring.\nToronto is the seventh different team in as many years to finish first in the East, following Chicago, Miami, Indiana, Atlanta, Cleveland and Boston. Still, James' team has represented the East in the NBA Finals in each of those years.\nKyle Lowry had nine points and nine assists, and Jonas Valanciunas added 12 rebounds for Toronto, which never trailed in its ninth consecutive home victory over the Pacers. Toronto also locked up its fourth Atlantic Division title in the past five years.\n\"The journey is not over,\" Lowry said.\nThe Pacers have not won north of the border since March 1, 2013.\nIndiana came in after completing a season sweep of reigning NBA champion Golden State with a 126-106 home victory on Thursday night. However, the Pacers fell behind in a poor-shooting first quarter and never seriously challenged in this one.\n\"They pressured us -- they pushed the tempo,\" Pacers coach Nate McMIllan said. \"We just didn't have any legs.\"\nGlenn Robinson III scored 12 points and Trevor Booker had 11 for the Pacers. Indiana shot 26-for-87 (29.9 percent) and set season lows in points, made field goals and field goal percentage.\n\"They're a tough team,\" Casey said. \"We caught them at a good time.\"\nAfter Bojan Bogdanovic made a jump shot with 8:28 left in the first, the Pacers missed 10 straight shots over the next five minutes before Domantas Sabonis snapped the slump with layup at 3:09. Indiana missed 18 of its first 21 shot attempts before ending the first with back-to-back 3-pointers.\nIbaka scored 10 points in the opening quarter and Toronto led 26-14 after one.\nBooker made a pair of free throws as Indiana cut it to 32-28 with 5:04 left in the half, but Toronto regained control with an 8-0 run. The Raptors led 45-33 at halftime.\nIbaka made all five shots he attempted in the third, including a pair of 3-pointers, to help Toronto take a 72-49 lead into the fourth.\nTIP-INS\nPacers: Victor Oladipo extended his streak of consecutive games with a steal to 63, tying him with Gary Payton for the fifth-longest streak in NBA history. ... The Pacers have lost 12 of their past 15 regular-season meetings with the Raptors. ... Indiana is 20-20 on the road.\nRaptors: Ibaka matched a career best with five made 3-pointers. ... Toronto had 20 rebounds in the first quarter. ... The Raptors won 56 games in 2015-16, when they had 32 home victories. ... Toronto had 23 turnovers, a season worst. ... The Raptors set a season best for points allowed.\nUPWARD TREND\nCasey is the third coach in NBA history to improve his team's win total in six of seven seasons. The others were Boston's Red Auerbach (1955-56 to 1961-62) and Phoenix's John MacLeod (1974-75 to 1980-81).\nPOWER SERGE\nToronto is 8-0 when Ibaka scores 20 or more.\nDOUBLE TROUBLE\nIndiana didn't have a double-digit scorer until Booker made a free throw with 9:32 left in the fourth.\nSTRUGGLE FOR STARTERS\nIndiana's starting five combined for 18 points, shooting 8-for-36.\nUP NEXT\nPacers: Visit Charlotte on Sunday. Indiana has lost four straight road games in the series.\nRaptors: Host Orlando on Sunday. Toronto has won its past three meetings with the Magic."}
