{"game_id": "0021401195", "chunk_id": "0021401195_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  If this was Greg Monroe's last home game at the Palace, he and his teammates certainly made the most of it."}
{"game_id": "0021401195", "chunk_id": "0021401195_002", "order": 2, "role": "body", "text": "Monroe scored 17 points, and Andre Drummond added 15 points and 19 rebounds to help the Detroit Pistons turn their home finale into a rout, 116-77 over the Charlotte Hornets on Sunday. Monroe is set to become an unrestricted free agent after the season."}
{"game_id": "0021401195", "chunk_id": "0021401195_003", "order": 3, "role": "body", "text": "Monroe played only 33 minutes, and that was the most by any Detroit starter in a game that was out of hand early. He downplayed the possibility that this was his Auburn Hills swan song."}
{"game_id": "0021401195", "chunk_id": "0021401195_004", "order": 4, "role": "body", "text": "\"It's crossed my mind, but I try to stay in the moment,\" Monroe said. \"This was a good win for me and my teammates.\""}
{"game_id": "0021401195", "chunk_id": "0021401195_005", "order": 5, "role": "body", "text": "Monroe said he hasn't thought about his next move yet."}
{"game_id": "0021401195", "chunk_id": "0021401195_006", "order": 6, "role": "body", "text": "\"I can't do anything until it's time,\" he said. \"We still have games on the schedule.\""}
{"game_id": "0021401195", "chunk_id": "0021401195_007", "order": 7, "role": "body", "text": "Noah Vonleh scored 16 points for the short-handed Hornets, who were eliminated from playoff contention Friday."}
{"game_id": "0021401195", "chunk_id": "0021401195_008", "order": 8, "role": "body", "text": "Drummond was dominant early, helping Detroit to a 30-10 lead after the first quarter, and the Pistons stretched it in the second. A jumper by John Lucas III made it 53-19 with 4:28 left in the half."}
{"game_id": "0021401195", "chunk_id": "0021401195_009", "order": 9, "role": "body", "text": "At that point, the Hornets were 5 of 30 from the field."}
{"game_id": "0021401195", "chunk_id": "0021401195_010", "order": 10, "role": "body", "text": "Jodie Meeks had 24 points for the Pistons, who finished 18-23 at home, while Anthony Tolliver added 17. Reggie Jackson had 13 assists."}
{"game_id": "0021401195", "chunk_id": "0021401195_011", "order": 11, "role": "body", "text": "Monroe was drafted by the Pistons with the seventh pick in 2010, and he's been a steady contributor ever since, but Detroit has been unable to make the playoffs in that span, and this has been another mediocre season."}
{"game_id": "0021401195", "chunk_id": "0021401195_012", "order": 12, "role": "body", "text": "A restricted free agent last offseason, Monroe signed a one-year qualifying offer to stay with Detroit. That move set him up to become an unrestricted free agent in 2015."}
{"game_id": "0021401195", "chunk_id": "0021401195_013", "order": 13, "role": "body", "text": "If the Pistons lose Monroe, they will still have one of the game's most promising young big men in the 21-year-old Drummond. He posted his fifth consecutive double-double and 47th of the season."}
{"game_id": "0021401195", "chunk_id": "0021401195_014", "order": 14, "role": "body", "text": "Drummond made an acrobatic play in the first quarter Sunday. He was fouled on an alley-oop pass from Jackson, but still managed to tip the pass into the basket. The Pistons closed the quarter on an 11-2 run to lead by 20."}
{"game_id": "0021401195", "chunk_id": "0021401195_016", "order": 16, "role": "body", "text": "Like Monroe, Detroit's Tayshaun Prince is entering free agency. Prince was traded back to the Pistons in February, returning to the place he played the first decade of his career. Prince didn't play Sunday, but there was a nice montage of his highlights on the video board during the second quarter, and the 35-year-old forward waved to the crowd."}
{"game_id": "0021401195", "chunk_id": "0021401195_017", "order": 17, "role": "body", "text": "\"To see that tribute, it pays that respect of what I've been able to accomplish,\" Prince said. \"I'm very appreciative for it.\""}
{"game_id": "0021401195", "chunk_id": "0021401195_019", "order": 19, "role": "body", "text": "Charlotte was without Al Jefferson (right knee soreness), Michael Kidd-Gilchrist (left ankle sprain), Lance Stephenson (right toe sprain) and Cody Zeller (right shoulder soreness)."}
{"game_id": "0021401195", "chunk_id": "0021401195_020", "order": 20, "role": "body", "text": "\"There's disappointment in not making the playoffs. We've got to put more into this game,\" Hornets coach Steve Clifford said. \"With the injuries, we're a little bit out-manned -- that doesn't mean we can't win.\""}
{"game_id": "0021401195", "chunk_id": "0021401195_022", "order": 22, "role": "body", "text": "Hornets: Despite the poor start, this was not Charlotte's lowest-scoring game of the season. The Hornets have been held under 70 points three times."}
{"game_id": "0021401195", "chunk_id": "0021401195_023", "order": 23, "role": "body", "text": "Pistons: Detroit won its 31st game of the season, its most since going 39-43 in 2008-09. It was the most lopsided victory of 2014-15 for the Pistons, and the fewest points they've allowed."}
{"game_id": "0021401195", "chunk_id": "0021401195_025", "order": 25, "role": "body", "text": "Hornets: Host Houston on Monday night."}
{"game_id": "0021401195", "chunk_id": "0021401195_026", "order": 26, "role": "closing", "text": "Pistons: At Cleveland on Monday night."}
