{"game_id": "0021701152", "chunk_id": "0021701152_001", "order": 1, "role": "lead", "text": "DENVER --  The Denver Nuggets are starting to master overtime. It might lead to their first postseason berth in five years."}
{"game_id": "0021701152", "chunk_id": "0021701152_002", "order": 2, "role": "body", "text": "Nikola Jokic had 35 points and 13 rebounds, Jamal Murray scored 18 of his 27 points after the third quarter and the Nuggets rallied from eight down in the final minute of regulation to beat the Milwaukee Bucks 128-125 in overtime Sunday night."}
{"game_id": "0021701152", "chunk_id": "0021701152_003", "order": 3, "role": "body", "text": "It was the second straight game Denver rallied in the final minute force overtime and pull out a win. The Nuggets did it in Oklahoma City on Friday night to close out a seven-game road trip."}
{"game_id": "0021701152", "chunk_id": "0021701152_004", "order": 4, "role": "body", "text": "Paul Millsap had 26 points and 13 rebounds for Denver, which took over in the extra period to strengthen its playoff chances."}
{"game_id": "0021701152", "chunk_id": "0021701152_005", "order": 5, "role": "body", "text": "\"That's why you keep playing until there's all zeros on the clock,\" Murray said. \"If you want to be a championship team, you have to play until the end.\""}
{"game_id": "0021701152", "chunk_id": "0021701152_006", "order": 6, "role": "body", "text": "The Nuggets (42-35) moved within a game of eighth-place New Orleans, which lost its fourth straight Sunday, and 1 1/2 games of Minnesota, which also lost. Two of Denver's last five games are against the Timberwolves, and it holds the tiebreaker on the Pelicans."}
{"game_id": "0021701152", "chunk_id": "0021701152_007", "order": 7, "role": "body", "text": "\"You always want to control your own destiny,\" coach Michael Malone said."}
{"game_id": "0021701152", "chunk_id": "0021701152_008", "order": 8, "role": "body", "text": "Jabari Parker scored 35 points and grabbed 10 rebounds, both season highs, and Eric Bledsoe had 31 points for Milwaukee (41-36). The Bucks' magic number for clinching a playoff spot in the Eastern Conference remains at two."}
{"game_id": "0021701152", "chunk_id": "0021701152_009", "order": 9, "role": "body", "text": "Milwaukee led by 18 midway through the fourth and was in control when Giannis Antetokounmpo, who had 18 points and 12 rebounds, fouled out on a charge with 3:43 left in regulation and the Bucks leading 107-97."}
{"game_id": "0021701152", "chunk_id": "0021701152_010", "order": 10, "role": "body", "text": "\"One of the toughest plays was Giannis getting called,\" Milwaukee coach Joe Prunty said. \"That really swung the momentum of the game. It should have been, I thought, a basket and Giannis is still in the game.\""}
{"game_id": "0021701152", "chunk_id": "0021701152_011", "order": 11, "role": "body", "text": "Ahead 111-108, the Bucks had a chance to ice it in the final seconds, but Murray stole Khris Middleton's inbound pass and was fouled by Jason Terry on a 3-point try with 2.8 seconds left. He made three free throws to tie it, and after Bledsoe turned it over, Jokic missed a shot at the buzzer."}
{"game_id": "0021701152", "chunk_id": "0021701152_012", "order": 12, "role": "body", "text": "Denver scored the first five points of overtime and led by seven with 35 seconds left but needed two free throws from little-used Malik Beasley with 7.1 seconds left after the Bucks cut it to one. He drained them both after missing a pair with 16.8 seconds left."}
{"game_id": "0021701152", "chunk_id": "0021701152_013", "order": 13, "role": "body", "text": "\"I knew he was going to make the next two,\" Millsap said. \"I didn't know what to expect from the first two.\""}
{"game_id": "0021701152", "chunk_id": "0021701152_014", "order": 14, "role": "body", "text": "Parker missed an off-balance 3-pointer at the end."}
{"game_id": "0021701152", "chunk_id": "0021701152_016", "order": 16, "role": "body", "text": "Bucks: G Brandon Jennings signed a multiyear deal with the team, the Bucks announced Sunday. Jennings had been playing under consecutive 10-day contracts. ... C Thon Maker missed his fourth straight game with a right groin strain. ... C John Henson returned after missing one game with a sprained right finger."}
{"game_id": "0021701152", "chunk_id": "0021701152_017", "order": 17, "role": "body", "text": "Nuggets: Gary Harris (right knee strain) missed his eighth straight game, and F Wilson Chandler (nasal fracture) was also out. ... The Nuggets attempted 22 free throws in the second period. It was the most by them in one period since shooting 25 in the fourth quarter in Utah on March 3, 2011, according to the Elias Sports Bureau."}
{"game_id": "0021701152", "chunk_id": "0021701152_019", "order": 19, "role": "body", "text": "Murray didn't need to guess when he stole the ball at the end of regulation. He had some inside info to help him pull off the game-saving play."}
{"game_id": "0021701152", "chunk_id": "0021701152_020", "order": 20, "role": "body", "text": "\"Jason Terry kind of gave it away,\" Murray said. \"I heard him saying he was going to go up and I kind of stayed on his high side. I was able to get into the passing lane.\""}
{"game_id": "0021701152", "chunk_id": "0021701152_021", "order": 21, "role": "body", "text": "Murray is the team's best free-throw shooter at 90 percent, and he calmly drained all three attempts."}
{"game_id": "0021701152", "chunk_id": "0021701152_022", "order": 22, "role": "body", "text": "\"I didn't see none of them,\" Millsap said. \"I had my head down on the free-throw line the whole time but I knew he was going to make them.\""}
{"game_id": "0021701152", "chunk_id": "0021701152_024", "order": 24, "role": "body", "text": "Denver's 22 free-throw attempts in the second quarter were nearly as many as Milwaukee had for the game (27)."}
{"game_id": "0021701152", "chunk_id": "0021701152_025", "order": 25, "role": "body", "text": "\"That would be one of the biggest things is because every point counts you got to really look at the free throws, like each possession matters,\" Prunty said. \"We had a tough time defending the free-throw line tonight, that's obvious.\""}
{"game_id": "0021701152", "chunk_id": "0021701152_027", "order": 27, "role": "body", "text": "Bucks: Host Boston on Tuesday night."}
{"game_id": "0021701152", "chunk_id": "0021701152_028", "order": 28, "role": "body", "text": "Nuggets: Host Indiana on Tuesday night."}
{"game_id": "0021701152", "chunk_id": "0021701152_030", "order": 30, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
