{"game_id": "0021300193", "chunk_id": "0021300193_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Al Jefferson muscled his way through the Bucks' defense."}
{"game_id": "0021300193", "chunk_id": "0021300193_002", "order": 2, "role": "body", "text": "Then he cooled off by sticking the right ankle that had been bothering him in a bucket of ice."}
{"game_id": "0021300193", "chunk_id": "0021300193_003", "order": 3, "role": "body", "text": "The Charlotte Bobcats are picking things up quickly with Jefferson in the middle again after the injury that had forced him out of the lineup."}
{"game_id": "0021300193", "chunk_id": "0021300193_004", "order": 4, "role": "body", "text": "Jefferson scored 19 points, Gerald Henderson added 17 and the Bobcats handed the Milwaukee Bucks their eighth straight loss in a 96-72 win Saturday night."}
{"game_id": "0021300193", "chunk_id": "0021300193_005", "order": 5, "role": "body", "text": "Jefferson, in his second game back from an ankle injury, added seven rebounds for Charlotte, which has won two of three to pull back to .500 (7-7)."}
{"game_id": "0021300193", "chunk_id": "0021300193_006", "order": 6, "role": "body", "text": "\"My first game back, I was a little rusty,\" Jefferson said while icing down the ankle."}
{"game_id": "0021300193", "chunk_id": "0021300193_007", "order": 7, "role": "body", "text": "The Bobcats lost to Phoenix 98-91 on Friday night, when Jefferson finished with nine points in his first action after missing four games."}
{"game_id": "0021300193", "chunk_id": "0021300193_008", "order": 8, "role": "body", "text": "\"But it never fails the second game. It like clicked,\" Jefferson said while snapping his fingers. \"And that's what we did better than last night.\""}
{"game_id": "0021300193", "chunk_id": "0021300193_009", "order": 9, "role": "body", "text": "Reserve Khris Middleton (20 points) led the Bucks, who shot just 35 percent. Milwaukee's losing streak is its longest since closing out the 2007-8 season with eight consecutive losses."}
{"game_id": "0021300193", "chunk_id": "0021300193_010", "order": 10, "role": "body", "text": "Coach Larry Drew was optimistic before the game that his team would bounce back from a 115-107 loss in overtime to Philadelphia on Friday night."}
{"game_id": "0021300193", "chunk_id": "0021300193_011", "order": 11, "role": "body", "text": "Instead, the Bucks struggled again. At 2-10, they're the worst team in the Eastern Conference."}
{"game_id": "0021300193", "chunk_id": "0021300193_012", "order": 12, "role": "body", "text": "\"I owe the fans a big, big apology for the performance of this team tonight. Very, very disappointed,\" Drew said. \"A team that I really thought after last night's loss would come out and play with some energy, with some passion and they did not do that.\""}
{"game_id": "0021300193", "chunk_id": "0021300193_013", "order": 13, "role": "body", "text": "Middleton outscored the Bucks' starting five of Caron Butler, Ersan Ilyasova, Zaza Pachulia, O.J. Mayo and Luke Ridnour, who combined for 16 points on 8-of-28 shooting."}
{"game_id": "0021300193", "chunk_id": "0021300193_014", "order": 14, "role": "body", "text": "Charlotte led the entire way, building on a 46-39 halftime lead. A smattering of boos came down for the Bucks with Charlotte up 23 after three quarters."}
{"game_id": "0021300193", "chunk_id": "0021300193_015", "order": 15, "role": "body", "text": "\"I told the guys after the game that there will be changes in our starting lineup,\" Drew said. \"If they're not on the same page with it, so be it, but there will be changes.\""}
{"game_id": "0021300193", "chunk_id": "0021300193_016", "order": 16, "role": "body", "text": "The Bobcats outmuscled the Bucks to pull away. Jeff Adrien added 10 rebounds off the bench for Charlotte, which had decisive edges on the boards (52-36) and points in the paint (48-28)."}
{"game_id": "0021300193", "chunk_id": "0021300193_017", "order": 17, "role": "body", "text": "Charlotte was briefly threatened in the second quarter, when the Bucks narrowed an early 12-point edge to 36-35. But Milwaukee had a 2-of-18 shooting stretch from late in the second quarter to late in the third."}
{"game_id": "0021300193", "chunk_id": "0021300193_018", "order": 18, "role": "body", "text": "\"The biggest thing was energy,\" Henderson said about the defensive effort. \"We're coming off a tough loss at home. Then you come off a back-to-back. Milwaukee. It's cold. You've just got to come with energy on the road.\""}
{"game_id": "0021300193", "chunk_id": "0021300193_019", "order": 19, "role": "body", "text": "The Bucks, struggling with injuries, are slowly getting healthy. An injury list that once numbered about a half-dozen players was down to just two on Saturday night in Larry Sanders (thumb) and Carlos Delfino (foot). Point guard Brandon Knight returned to the floor after missing time with a hamstring injury."}
{"game_id": "0021300193", "chunk_id": "0021300193_020", "order": 20, "role": "body", "text": "It still wasn't enough for the Bucks, who looked disjointed on the offensive end."}
{"game_id": "0021300193", "chunk_id": "0021300193_021", "order": 21, "role": "body", "text": "Charlotte capitalized coming out of the half. Josh McRoberts (12 points, nine rebounds) hit a 3 from the wing with the shot clock winding down, leaving Ilyasova to hang his head in frustration as he jogged back up the floor."}
{"game_id": "0021300193", "chunk_id": "0021300193_022", "order": 22, "role": "body", "text": "Mayo missed a quick jumper and the Bobcats came racing down in transition after a rebound by McRoberts. Jefferson drove the lane and got fouled, but missed the second of two foul shots."}
{"game_id": "0021300193", "chunk_id": "0021300193_023", "order": 23, "role": "body", "text": "Then the 6-foot-10, 289-pound Jefferson showed exactly why Charlotte signed him to a three-year, $41 million contract in the offseason, grabbing the offensive board and getting fouled again. This time, Jefferson made both foul shots for an 11-point lead with 11:12 left in the third quarter."}
{"game_id": "0021300193", "chunk_id": "0021300193_024", "order": 24, "role": "body", "text": "\"There's not many guys that can play him effectively,\" coach Steve Clifford said. \"He's an elite low-post scorer down there.\""}
{"game_id": "0021300193", "chunk_id": "0021300193_025", "order": 25, "role": "body", "text": "John Henson had 10 points and nine boards for Milwaukee."}
{"game_id": "0021300193", "chunk_id": "0021300193_026", "order": 26, "role": "body", "text": "Game notes Knight missed five games because of the injury. He had three points and seven assists in 25 minutes. Ridnour started at the point. ... The No. 2 Duke women's basketball team watched from the stands, ahead of the Blue Devils' game Sunday against Marquette. Duke post player Amber Henson is Henson's sister."}
{"game_id": "0021300193", "chunk_id": "0021300193_028", "order": 28, "role": "closing", "text": "Follow Genaro Armas at http://twitter.com/GArmasAP"}
