{"game_id": "0021300659", "chunk_id": "0021300659_001", "order": 1, "role": "lead", "text": "DALLAS --  Dirk Nowitzki's sore left knee isn't holding him back and Devin Harris is progressing just fine after offseason toe surgery."}
{"game_id": "0021300659", "chunk_id": "0021300659_002", "order": 2, "role": "body", "text": "Nowitzki scored 28 points, Harris had a season-high 14 for the second straight game and the Dallas Mavericks beat the Detroit Pistons 116-106 Sunday night."}
{"game_id": "0021300659", "chunk_id": "0021300659_003", "order": 3, "role": "body", "text": "With Monta Ellis struggling to take care of the ball -- he had eight of Dallas' 17 turnovers -- Harris offered a steady hand in just his fifth game of the season after a setback in recovery cost him an extra month."}
{"game_id": "0021300659", "chunk_id": "0021300659_004", "order": 4, "role": "body", "text": "\"I'm making the most of my experience on the floor, trying to get used to playing with different guys in different situations,\" said Harris, who led Dallas with seven assists while making just one turnover. \"I'm using this as kind of my training camp.\""}
{"game_id": "0021300659", "chunk_id": "0021300659_005", "order": 5, "role": "body", "text": "Brandon Jennings had 26 points and seven assists to lead the Pistons, who lost their fourth straight. Josh Smith had 25 points and eight rebounds, while Greg Monroe had 20 points and nine boards."}
{"game_id": "0021300659", "chunk_id": "0021300659_006", "order": 6, "role": "body", "text": "Jose Calderon scored 17 points on 7-of-8 shooting for Dallas, including a jumper that put the lead back in double digits for good with 2:37 remaining."}
{"game_id": "0021300659", "chunk_id": "0021300659_007", "order": 7, "role": "body", "text": "Nowitzki was 10 of 16 from the field in his second straight game wearing a sleeve on his sore left knee after sitting out a loss in Toronto. It's not the knee that required surgery and sidelined him the first 27 games last season."}
{"game_id": "0021300659", "chunk_id": "0021300659_008", "order": 8, "role": "body", "text": "The 7-footer had a pair of 3s and eight points in the fourth, including one that pushed the lead back to 13 during a stretch of three straight buckets assisted by Harris."}
{"game_id": "0021300659", "chunk_id": "0021300659_009", "order": 9, "role": "body", "text": "Nowitzki scored five straight points in the final 2 minutes after the Pistons had earlier pulled within eight, and he led Dallas with nine rebounds and threw in four assists."}
{"game_id": "0021300659", "chunk_id": "0021300659_010", "order": 10, "role": "body", "text": "\"We know Dirk,\" Detroit coach Maurice Cheeks said. \"We've known it for a long time. He can make a play for himself or give it to somebody else. He makes those 3s at the right time.\""}
{"game_id": "0021300659", "chunk_id": "0021300659_011", "order": 11, "role": "body", "text": "Harris scored five straight points in the final minute of the third quarter to break a 79-all tie, hitting a long jumper and the pulling up for a 3-pointer in transition. His other 3 early in the fourth capped a 15-2 run for a 94-81 Dallas lead."}
{"game_id": "0021300659", "chunk_id": "0021300659_012", "order": 12, "role": "body", "text": "\"On a night when Monta couldn't get it going, it's a godsend to have a guy like Devin available,\" coach Rick Carlisle said. \"He's an experienced NBA player who's really done everything.\""}
{"game_id": "0021300659", "chunk_id": "0021300659_013", "order": 13, "role": "body", "text": "The Pistons got within five midway through the fourth, but Vince Carter hit a layup to start an 8-0 run as the Mavericks answered consecutive losses on an East Coast trip by winning the opener of a four-game homestand that includes a pair of two-day breaks."}
{"game_id": "0021300659", "chunk_id": "0021300659_014", "order": 14, "role": "body", "text": "After Carter's bucket, Brandan Wright had one of his three fourth-quarter blocks on a drive by Kyle Singler, and Calderon hit a layup in transition at the other end."}
{"game_id": "0021300659", "chunk_id": "0021300659_015", "order": 15, "role": "body", "text": "\"We were close several times in the game to kind of blowing the top off and we got sloppy with the ball,\" said Wright, whose three blocks were matched by Sam Dalembert. \"But we stuck with it.\""}
{"game_id": "0021300659", "chunk_id": "0021300659_016", "order": 16, "role": "body", "text": "The Pistons opened the second half with a 12-2 run to get even at 58-all."}
{"game_id": "0021300659", "chunk_id": "0021300659_017", "order": 17, "role": "body", "text": "Jennings scored seven straight Detroit points and had 12 in the third quarter, including a 3-pointer that gave Detroit its first lead since late in the first quarter. Jennings' go-ahead bucket triggered a stretch of four lead changes and four ties in the third."}
{"game_id": "0021300659", "chunk_id": "0021300659_018", "order": 18, "role": "body", "text": "\"We made a nice run,\" Cheeks said. \"I thought Brandon played well in the third quarter. He was the difference in why we came back.\""}
{"game_id": "0021300659", "chunk_id": "0021300659_019", "order": 19, "role": "body", "text": "The Mavericks made 10 of their first 12 shots, but had seven turnovers in the first 9 minutes."}
{"game_id": "0021300659", "chunk_id": "0021300659_020", "order": 20, "role": "body", "text": "DeJuan Blair's layup finished an 8-0 run that gave Dallas its biggest lead of the first half at 49-37, but Detroit answered with seven straight points capped by Kentavious Caldwell-Pope's layup after a bad pass from Nowitzki, one of Dallas' 11 first-half turnovers."}
{"game_id": "0021300659", "chunk_id": "0021300659_021", "order": 21, "role": "closing", "text": "Game notes Carlisle said before the game he thinks Nowitzki will make the All-Star game as a reserve. His 11-year All-Star streak ended last season. All-Star reserves are announced Thursday. ... Pistons C Andre Drummond had four points and six rebounds two nights after his first career game with at least 20 points and 20 rebounds against New Orleans. He had an 11-game streak of at least 11 rebounds snapped. ... The Mavericks shot 61 percent in the first half despite going 1 of 9 from 3-point range."}
