{"game_id": "0021400200", "chunk_id": "0021400200_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  The Portland Trail Blazers didn't take the winless 76ers lightly following a lackluster first half."}
{"game_id": "0021400200", "chunk_id": "0021400200_002", "order": 2, "role": "body", "text": "LaMarcus Aldridge had 15 of his 33 points during the pivotal third quarter to help the Trail Blazers defeat Philadelphia 114-104 on Monday night, sending the 76ers to their 14th straight loss to open the season."}
{"game_id": "0021400200", "chunk_id": "0021400200_003", "order": 3, "role": "body", "text": "Wesley Matthews added 17 points, Damian Lillard had 16 and Robin Lopez chipped in 12 for Portland (11-3), which won its eighth in a row after coming back from a two-point halftime deficit."}
{"game_id": "0021400200", "chunk_id": "0021400200_004", "order": 4, "role": "body", "text": "\"They came out with a lot of energy; we came out a little sluggish,\" Aldridge said. \"They woke us up.\""}
{"game_id": "0021400200", "chunk_id": "0021400200_005", "order": 5, "role": "body", "text": "Michael Carter-Williams led Philadelphia (0-14) with 24 points."}
{"game_id": "0021400200", "chunk_id": "0021400200_006", "order": 6, "role": "body", "text": "The 76ers moved within one loss of matching the franchise mark for consecutive losses to begin a season and will look to avoid an 0-15 opening when they host Brooklyn on Wednesday. They also are just four losses from tying the 2009-10 Nets, who set an NBA record by beginning the season 0-18. If the losing continues, Philadelphia could break the NBA record for losses to start the season on Dec. 5 when hosting Oklahoma City."}
{"game_id": "0021400200", "chunk_id": "0021400200_007", "order": 7, "role": "body", "text": "\"Nobody is rolling over or pointing fingers,\" 76ers coach Brett Brown said. \"This locker room is great. You go home and sleep OK. It wasn't that bad. There were a lot of positives tonight.\""}
{"game_id": "0021400200", "chunk_id": "0021400200_008", "order": 8, "role": "body", "text": "After taking a halftime lead for just the fifth time this season, Philadelphia upped its two-point advantage to its biggest of the game when consecutive layups by Carter-Williams and Henry Sims made it 56-50 early in the third quarter. And Philadelphia's lead again was six, 58-52, on Carter-Williams' two free throws with 10:33 remaining in the period."}
{"game_id": "0021400200", "chunk_id": "0021400200_009", "order": 9, "role": "body", "text": "But it was all Portland from that point. The Blazers went in front on Aldridge's drive that made it 63-62 with 8:10 left in the period and then continued to pour it on. Nicolas Batum's dunk with 4:02 remaining in the third gave Portland its largest lead to that point, 80-68, and capped a 6:31 stretch in which the Trail Blazers outscored Philadelphia 28-10."}
{"game_id": "0021400200", "chunk_id": "0021400200_010", "order": 10, "role": "body", "text": "\"The biggest lesson is how hard you have to play to win,\" Portland coach Terry Stotts said. \"Every night is a challenge. To be able to come back against a team playing with desperation means a lot.\""}
{"game_id": "0021400200", "chunk_id": "0021400200_011", "order": 11, "role": "body", "text": "Aldridge had three straight baskets during the run, including an alley-oop dunk on Steve Blake's pass. Aldridge was 5 for 5 from the field in the period to help Portland enter the fourth with an 89-80 lead. Aldridge ended 13 for 20 from the field"}
{"game_id": "0021400200", "chunk_id": "0021400200_012", "order": 12, "role": "body", "text": "\"That's my job,\" Aldridge said. \"If things stall, I try to get things going.\""}
{"game_id": "0021400200", "chunk_id": "0021400200_013", "order": 13, "role": "body", "text": "Sims finished with 22 points and Tony Wroten added 20 for the 76ers, who went 0 for 8 from 3-point range."}
{"game_id": "0021400200", "chunk_id": "0021400200_014", "order": 14, "role": "body", "text": "A pair of Carter-Williams free throws with 6.6 seconds left before intermission gave Philadelphia a 52-50 halftime lead. Wroten led Philadelphia with 10 points at the break."}
{"game_id": "0021400200", "chunk_id": "0021400200_015", "order": 15, "role": "body", "text": "The Trail Blazers also helped Philadelphia with 14 first-half turnovers, but they committed just three in the second half."}
{"game_id": "0021400200", "chunk_id": "0021400200_017", "order": 17, "role": "body", "text": "Trail Blazers: Portland's winning streak is the best since winning 11 in a row from Nov. 8-25, 2013.. . Portland, which entered second in the NBA in made 3-pointers per game (10.1), was 2 for 12 from the arc at the break and finished 7 for 27."}
{"game_id": "0021400200", "chunk_id": "0021400200_018", "order": 18, "role": "body", "text": "76ers: Philadelphia's worst start in franchise history was set during the 1972-73 season when they also finished with the worst, 82-game record in league history at 9-73. . Fans behind the basket used boxes of macaroni and cheese as noisemakers on a night when those who brought a box to the game received a free ticket to a future contest."}
{"game_id": "0021400200", "chunk_id": "0021400200_020", "order": 20, "role": "body", "text": "By failing to hit a 3-pointer, Philadelphia snapped a streak of 209 straight games with a made 3-pointer."}
{"game_id": "0021400200", "chunk_id": "0021400200_022", "order": 22, "role": "body", "text": "Aldridge added 11 rebounds to his point total, giving him five double-doubles on the season. It also was the 27th time since the 2011-11 season that he has recorded a double-double while scoring at least 30 points."}
{"game_id": "0021400200", "chunk_id": "0021400200_024", "order": 24, "role": "body", "text": "Portland plays at Charlotte on Wednesday."}
{"game_id": "0021400200", "chunk_id": "0021400200_025", "order": 25, "role": "closing", "text": "Philadelphia hosts Brooklyn on Wednesday."}
