{"game_id": "0021700207", "chunk_id": "0021700207_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  LeBron James and the Cleveland Cavaliers made the plays they needed to extend their dominance of the Charlotte Hornets."}
{"game_id": "0021700207", "chunk_id": "0021700207_002", "order": 2, "role": "body", "text": "The most significant ones came when the Hornets had the ball."}
{"game_id": "0021700207", "chunk_id": "0021700207_003", "order": 3, "role": "body", "text": "\"Our defense was phenomenal,\" said James, who scored 31 points in Cleveland's 115-107 victory Wednesday night. \"We had a great game plan and we were just in tune. We executed it.\""}
{"game_id": "0021700207", "chunk_id": "0021700207_004", "order": 4, "role": "body", "text": "Five of the Hornets' 13 turnovers came in the fourth quarter, and Cleveland finally pulled away in a game that was tight for three quarters."}
{"game_id": "0021700207", "chunk_id": "0021700207_005", "order": 5, "role": "body", "text": "\"They showed -- you can say whatever you want -- they're the best team in the East, when they want to (be),\" Hornets guard Nic Batum said."}
{"game_id": "0021700207", "chunk_id": "0021700207_006", "order": 6, "role": "body", "text": "The Cavaliers have won seven straight against the Hornets and 11 of 12. James is 40-6 in the regular season against Charlotte."}
{"game_id": "0021700207", "chunk_id": "0021700207_007", "order": 7, "role": "body", "text": "Kyle Korver's 3-pointer with 1:06 left in the third quarter put the Cavaliers ahead for good at 86-84. They extended the lead to 10 points three times in the fourth quarter, first when James drove into the lane and hit a stepback baseline jumper to make it 105-95."}
{"game_id": "0021700207", "chunk_id": "0021700207_008", "order": 8, "role": "body", "text": "Cleveland's Kevin Love had 22 points and 10 rebounds, Jeff Green added 13, Korver had 11 and J.R. Smith 10. The Cavaliers have won three straight and four of five."}
{"game_id": "0021700207", "chunk_id": "0021700207_009", "order": 9, "role": "body", "text": "The loss was Charlotte's fifth in a row since a five-point win at Milwaukee on Nov. 1."}
{"game_id": "0021700207", "chunk_id": "0021700207_010", "order": 10, "role": "body", "text": "\"It's easy to hang your head and give up when things get hard, but that's not who we are as a team,\" said Hornets center Dwight Howard. \"The guys in this locker room are built better than that.\""}
{"game_id": "0021700207", "chunk_id": "0021700207_011", "order": 11, "role": "body", "text": "Michael Kidd-Gilchrist shot 10 of 14 from the field and led Charlotte with a season-high 22 points, three shy of his career best. Point guard Kemba Walker had 20."}
{"game_id": "0021700207", "chunk_id": "0021700207_012", "order": 12, "role": "body", "text": "Batum played his first game of the season after a tearing a ligament in his left elbow last month. He started and scored 16 points in 32 minutes, including seven straight in the second half as the Hornets took a 58-52 lead."}
{"game_id": "0021700207", "chunk_id": "0021700207_013", "order": 13, "role": "body", "text": "Jeremy Lamb added 13 points off the bench."}
{"game_id": "0021700207", "chunk_id": "0021700207_014", "order": 14, "role": "body", "text": "Howard, who entered averaging 14.4 points and 13.1 rebounds, was limited by foul trouble and played just 23 minutes. He finished with eight points and five rebounds and fouled out with 24.5 seconds left."}
{"game_id": "0021700207", "chunk_id": "0021700207_016", "order": 16, "role": "body", "text": "Cavaliers: Derrick Rose (left ankle sprain), Isaiah Thomas (right hip) and Tristan Thompson (left calf strain) did not play. ... James went to the bench with his fourth foul at the 3:31 mark of the third quarter after being called for two charges in less than a minute. Walker drew the first one, Kidd-Gilchrist the second. The Hornets led 82-79 at that juncture. ... James scored in double figures for the 806th straight game. It was his 404th career 30-point game. ... J.R. Smith hit his 1,800th career 3-pointer in the first half."}
{"game_id": "0021700207", "chunk_id": "0021700207_017", "order": 17, "role": "body", "text": "Hornets: Charlotte's Treveon Graham (right quad) and Julyan Stone (strained hamstring) did not play. ... Carolina Panther players Devin Funchess and Thomas Davis and coach Ron Rivera were seated courtside. Former Hornet Muggsy Bogues also was in attendance."}
{"game_id": "0021700207", "chunk_id": "0021700207_019", "order": 19, "role": "body", "text": "James was on the bench when the Cavaliers took the lead for good and re-entered with the Cavaliers leading 95-88 with 8:58 to play. James said it was great feeling to see his teammates be successful."}
{"game_id": "0021700207", "chunk_id": "0021700207_020", "order": 20, "role": "body", "text": "\"When I came back in, I just wanted to try to close it out for them, and I was able to do that,\" said James. \"They were exceptional. My teammates were unbelievable tonight.\""}
{"game_id": "0021700207", "chunk_id": "0021700207_022", "order": 22, "role": "body", "text": "Defensive switches left Howard guarding James on the perimeter numerous times. Howard was asked what goes through his mind in those moments."}
{"game_id": "0021700207", "chunk_id": "0021700207_023", "order": 23, "role": "body", "text": "\"I have three trophies that say defensive player of the year,\" he said."}
{"game_id": "0021700207", "chunk_id": "0021700207_024", "order": 24, "role": "body", "text": "\"So I'm not afraid to guard anybody, no matter if it's the best player in the world or my mom. I treat them the same way.\""}
{"game_id": "0021700207", "chunk_id": "0021700207_026", "order": 26, "role": "body", "text": "The Hornets wore their classic teal pinstriped uniforms for the first time in 15 years. The uniforms harken to the original days of the franchise and were worn from 1988 to 1997. The jerseys included blue, purple and green pinstripes, and the shorts included the original Hornets logo at the waist. Charlotte will also wear its classic uniforms in home games against Milwaukee on Dec. 23 and Oklahoma City Jan. 13."}
{"game_id": "0021700207", "chunk_id": "0021700207_028", "order": 28, "role": "body", "text": "Cavaliers: Host the Los Angeles Clippers on Friday night."}
{"game_id": "0021700207", "chunk_id": "0021700207_029", "order": 29, "role": "body", "text": "Hornets: At Chicago on Friday night."}
{"game_id": "0021700207", "chunk_id": "0021700207_031", "order": 31, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
