{"game_id": "0021200584", "chunk_id": "0021200584_001", "order": 1, "role": "lead", "text": "BOSTON --  In the midst of a boisterous Bulls locker room, players talked about what a crazy game it was. It was only fitting that they won it on a tough, unconventional shot."}
{"game_id": "0021200584", "chunk_id": "0021200584_002", "order": 2, "role": "body", "text": "Marco Belinelli made an off-balance fadeaway with 3.1 seconds left, Jimmy Butler scored six points in overtime and Chicago extended its Friday night road show by beating the Boston Celtics 100-99."}
{"game_id": "0021200584", "chunk_id": "0021200584_003", "order": 3, "role": "body", "text": "\"That's natural. I know it's a crazy shot, the fallaway. The ball went in,\" said Belinelli, who was given an ice bucket shower by teammate Taj Gibson."}
{"game_id": "0021200584", "chunk_id": "0021200584_004", "order": 4, "role": "body", "text": "Looking as though they were finally going to get beat in a Friday road game, Chicago pushed the game to overtime when it forced a jump ball before Kirk Hinrich hit a jumper with 2 seconds to play in the fourth quarter."}
{"game_id": "0021200584", "chunk_id": "0021200584_005", "order": 5, "role": "body", "text": "Then it was Butler who carried the Bulls, scoring six straight points. Jason Terry's jumper had put Boston ahead 99-98 in OT before Belinelli's game-winner just to the left of the foul line."}
{"game_id": "0021200584", "chunk_id": "0021200584_006", "order": 6, "role": "body", "text": "\"It was really fun being out there with my guys. It's crazy they have me out there,\" Butler said, with teammate Richard Hamilton yelling, \"Way to go Jimbo!\" in the background."}
{"game_id": "0021200584", "chunk_id": "0021200584_007", "order": 7, "role": "body", "text": "\"They had faith in me,\" Butler said. \"Whenever I scored a basket they kept yelling, 'Keep going Jimmy!\""}
{"game_id": "0021200584", "chunk_id": "0021200584_008", "order": 8, "role": "body", "text": "Butler finished with 13 points."}
{"game_id": "0021200584", "chunk_id": "0021200584_009", "order": 9, "role": "body", "text": "Carlos Boozer had 19 points and 20 rebounds, and Joakim Noah added 14 points and 13 boards as the Bulls won their 14th straight road game on a Friday. They haven't lost since April 2011."}
{"game_id": "0021200584", "chunk_id": "0021200584_010", "order": 10, "role": "body", "text": "\"It was a crazy game. It was a roller-coaster,\" Hamilton said. \"We made plays and thought we had it. They made plays and thought they had it.\""}
{"game_id": "0021200584", "chunk_id": "0021200584_011", "order": 11, "role": "body", "text": "Rajon Rondo scored a season-high 30 points for Boston before fouling out with 1:16 to play in overtime."}
{"game_id": "0021200584", "chunk_id": "0021200584_012", "order": 12, "role": "body", "text": "Kevin Garnett had 16 points and Paul Pierce passed former Celtics star Robert Parish for 22nd on the NBA's career scoring list by chipping in 13. Pierce has 23,342 points and Parish 23,334."}
{"game_id": "0021200584", "chunk_id": "0021200584_013", "order": 13, "role": "body", "text": "\"We had the game in our hands a couple of times and it just slipped through our fingers both times,\" Pierce said. \"Just the little things. It just goes to show you that little things can prove costly in this league if you are not on point throughout the whole game. They beat us tonight.\""}
{"game_id": "0021200584", "chunk_id": "0021200584_014", "order": 14, "role": "body", "text": "Brandon Bass added 13 points for Boston, which lost for the second time in eight games."}
{"game_id": "0021200584", "chunk_id": "0021200584_015", "order": 15, "role": "body", "text": "Hamilton had 20 points for the Bulls, who have won four of five."}
{"game_id": "0021200584", "chunk_id": "0021200584_016", "order": 16, "role": "body", "text": "The teams traded leads twice in the opening 3 minutes of overtime before Terry's 3-pointer from the right corner gave Boston a 93-92 lead with 1:57 to play. Butler had a basket on the other end to move the Bulls back in front and, after Boston missed on the offensive end, Rondo was called for a loose ball foul, sending Butler to the line. He nailed both, making it 96-93 with 1:16 left."}
{"game_id": "0021200584", "chunk_id": "0021200584_017", "order": 17, "role": "body", "text": "The Bulls had another three-point lead, 98-95, after Belinelli's two free throws with 51 seconds to go. Pierce hit two from the line and Boston forced a 24-second violation -- when Belinelli fired a corner jumper off the top of the backboard, setting it up for Terry's go-ahead jumper with 12.5 seconds to play."}
{"game_id": "0021200584", "chunk_id": "0021200584_018", "order": 18, "role": "body", "text": "But Belinelli nailed his off-balance shot and Courtney Lee's long shot at the buzzer caromed off the backboard as the horn sounded."}
{"game_id": "0021200584", "chunk_id": "0021200584_019", "order": 19, "role": "body", "text": "In regulation, Rondo's long jumper from the right wing gave Boston an 86-84 edge, but Boozer hit one free throw after being fouled by Pierce on a baseline drive with 23 seconds left."}
{"game_id": "0021200584", "chunk_id": "0021200584_020", "order": 20, "role": "body", "text": "Garnett then nailed two free throws with 20.1 seconds remaining and Hinrich hit one, cutting it to 88-86."}
{"game_id": "0021200584", "chunk_id": "0021200584_021", "order": 21, "role": "body", "text": "The Bulls forced the jump ball on the defensive end with 9.4 seconds left and gained possession before tying it on Hinrich's jumper."}
{"game_id": "0021200584", "chunk_id": "0021200584_022", "order": 22, "role": "body", "text": "Garnett airballed a long fadeaway as the horn sounded, sending the game to OT."}
{"game_id": "0021200584", "chunk_id": "0021200584_023", "order": 23, "role": "body", "text": "\"We talked about it -- you knew they were going to trap,\" Boston coach Doc Rivers said, \"and you've got to do whatever you can do not to get tied up.\""}
{"game_id": "0021200584", "chunk_id": "0021200584_024", "order": 24, "role": "body", "text": "Rondo scored five points in Boston's 6-0 run, giving the Celtics their first lead at 80-79 with 4 1/2 minutes to go."}
{"game_id": "0021200584", "chunk_id": "0021200584_025", "order": 25, "role": "body", "text": "Hamilton's layup gave the Bulls an 81-80 edge on the next possession before the teams started to trade trips to the foul line that led to pair of ties over the next 3 minutes, the last before the end of regulation when Garnett made one of two free throws to tie it at 84 with 2:20 left."}
{"game_id": "0021200584", "chunk_id": "0021200584_026", "order": 26, "role": "body", "text": "The Celtics tied it again at 79 on Rondo's two free throws a little over a minute later."}
{"game_id": "0021200584", "chunk_id": "0021200584_027", "order": 27, "role": "body", "text": "Bulls forward Luol Deng appeared to aggravate his sore right hamstring, injured in Wednesday's win at Toronto, when he came up limping after a fast-break drive to the basket late in the third quarter. He left the game for a substitute when play stopped."}
{"game_id": "0021200584", "chunk_id": "0021200584_028", "order": 28, "role": "body", "text": "After the game, Deng said he wasn't sure if he could play Saturday."}
{"game_id": "0021200584", "chunk_id": "0021200584_029", "order": 29, "role": "body", "text": "\"It's pretty swollen,\" he said."}
{"game_id": "0021200584", "chunk_id": "0021200584_030", "order": 30, "role": "body", "text": "Boston guard Avery Bradley missed the game with a rib injury sustained in Wednesday's loss to New Orleans."}
{"game_id": "0021200584", "chunk_id": "0021200584_031", "order": 31, "role": "body", "text": "Noah had his double-double after three quarters, collecting 12 points and 10 boards. Boozer had 17 points and 15 rebounds after three."}
{"game_id": "0021200584", "chunk_id": "0021200584_032", "order": 32, "role": "body", "text": "Rondo had a highlight three-point play late in the third quarter that cut the Bulls' lead to 62-59. He was dribbling to the right of the lane when he lost his balance, falling to the floor, but kept his dribble going before getting up and driving in for a basket and a foul."}
{"game_id": "0021200584", "chunk_id": "0021200584_033", "order": 33, "role": "closing", "text": "Game notes Chicago G Derrick Rose, expected back in late February from knee surgery, participated in the team's shootaround. Deng didn't take part, but started the game. ... The Bulls play the first of four straight at home Saturday against Memphis. ... Rivers and his former assistant, Bulls coach Tom Thibodeau, had dinner Thursday night to celebrate Thibodeau's 55th birthday. \"We went to dinner last night and the first thing I told him was, 'By the way, your team is pretty good without Derrick, that's No. 1,\" Rivers said. ... Garnett and Noah were each given a technical late in the fourth."}
