{"game_id": "0021400710", "chunk_id": "0021400710_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- Zach Randolph and the streaking Memphis Grizzlies pushed aside the Oklahoma City Thunder.\nRandolph had his 12th straight double-double with 21 points and 18 rebounds to help the Grizzlies beat the Thunder 85-74 on Saturday night.\n\"I'm just playing,\" Randolph said about the streak that began after he missed nine games with a sore right knee. \"I'm feeling good out there. Guys are just giving me the ball. I feel like I'm still in my prime.\"\nFrontcourt mate Marc Gasol added 15 points and 12 rebounds for Memphis, which won its sixth straight. Ten of Randolph's rebounds came on the offensive glass. Mike Conley, returning after missing two games with a sprained left wrist, added 10 points.\nThe victory marked the second straight game Memphis held an opponent to fewer than 75 points. The Grizzlies beat the Denver Nuggets 99-69 on Thursday night and are re-establishing their defensive identity.\n\"There's an incredible energy right now,\" Conley said. \"We've set a standard. You've got to play to a certain level defensively as a group. If one guy falls below that line, they feel out of place. They feel like the outcast.\"\nKevin Durant, a game-time decision after missing the previous two games with a sprained big toe, led the Thunder with 15 points. Russell Westbrook had 14 points, and Serge Ibaka added 13 points and 10 rebounds.\nNeither team shot particularly well. Memphis hit 37 percent of its field goal attempts to 35 percent for the Thunder.\nIn addition to their shooting woes, the Thunder were hindered by 18 turnovers, 11 in the second half.\n\"The turnovers were huge,\" Thunder coach Scott Brooks said. \"They got a lot of deflections. We had to take care of the ball to give ourselves a chance against a very good team.\"\nDurant and Westbrook offered little about the game. Asked about the Memphis rebounding, Durant replied: \"That was it. They got offensive rebounds, steals and more possessions.\"\nOn the shooting, Westbrook said: \"We just missed some open shots, and they got some offensive rebounds.\"\nThe game was an intense affair similar to the playoff series featuring these teams in recent years. Play was physical and fast-paced.\n\"I knew coming in it was going to be like that,\" Randolph said.\nAfter Memphis carried a 45-40 lead into halftime, Randolph began to make his presence felt in the third. He reached his 12th consecutive double-double by the middle of the period. Even when Steven Adams blocked his shot on one possession, Randolph gathered it in for a putback that pushed Memphis' lead to double digits.\nRandolph had 14 points and three rebounds in the third, and when Memphis rattled off an 11-2 run opening the fourth quarter, the Grizzlies' lead had reached its largest of the night and never shrunk to fewer than 11 the rest of the way.\n\"We played our brand,\" Memphis coach Dave Joerger said. \"We defended. We tried to make everything tough. ... I thought we did a really good job.\"\nTIP-INS\nThunder: Oklahoma City closed out a stretch with seven of eight games on the road. ... Durant entered averaging 28.5 points per game against the Grizzlies, the highest mark of any player in NBA history against them. ... Oklahoma City is 14-7 this season when Durant is available the entire game.\nGrizzlies: A significant crowd was waiting when the doors opened at the FedExForum, as the Grizzlies gave out miniature championship wrestling belts to the first 3,000 fans. Wrestling stars Ric Flair and Jerry Lawler and former announcers Dave Brown and Lance Russell also appeared. ... The Grizzlies played their first game without Vince Carter since he sustained a tendon injury in his left foot Thursday against the Nuggets.\nFAMILIAR FOES: Entering the game, the teams had split the past 38 games, each winning 19. Only the Heat and Pacers have played more over the six-year span, facing each other 40 times.\nUP NEXT\nThunder: Host Orlando on Monday night.\nGrizzlies: Visit Phoenix on Monday night."}
