{"game_id": "0021700415", "chunk_id": "0021700415_001", "order": 1, "role": "lead", "text": "CLEVELAND --  Lonzo Ball got an up-close look at the biggest baller of them all."}
{"game_id": "0021700415", "chunk_id": "0021700415_002", "order": 2, "role": "body", "text": "LeBron James recorded his 59th career triple-double in front of Ball and his brothers, Kevin Love scored 28 points and the Cleveland Cavaliers won for the 16th time in 17 games, 121-112 over the Los Angeles Lakers on Thursday night."}
{"game_id": "0021700415", "chunk_id": "0021700415_003", "order": 3, "role": "body", "text": "James finished with 25 points, 12 rebounds and 12 assists to move into a tie with Larry Bird for sixth place on the career triple-doubles list. James also put the Lakers away in the final minutes with a dunk and short runner, leading Cleveland to its 10th straight home win."}
{"game_id": "0021700415", "chunk_id": "0021700415_004", "order": 4, "role": "body", "text": "For Ball, his first on-court encounter with James was eye-opening."}
{"game_id": "0021700415", "chunk_id": "0021700415_005", "order": 5, "role": "body", "text": "\"Watching him doesn't do him justice,\" Ball said. \"He has that size, that speed. I'd say he's the best player in the world right now.\""}
{"game_id": "0021700415", "chunk_id": "0021700415_006", "order": 6, "role": "body", "text": "James, who has been complimentary of the 20-year-old Ball in the past, met with the Lakers highly touted rookie on the floor following the game. As cameras recorded the moment, James and Ball, whose all-around games and backgrounds are very similar, covered their mouths so the world couldn't listen in on their conversation."}
{"game_id": "0021700415", "chunk_id": "0021700415_007", "order": 7, "role": "body", "text": "James said he was humbled to learn the former UCLA star patterned his game after him. James has become a fan of Ball's game."}
{"game_id": "0021700415", "chunk_id": "0021700415_008", "order": 8, "role": "body", "text": "\"It's always team,\" James said when asked what he admires most about Ball. \"He passes the ball. Pushes the ball up the floor. Someone you want to play with. This is a team game. Everyone gets so caught up in this whole individual thing and it's, the whole team game gets overlooked, but then, I'm not going to go there.\""}
{"game_id": "0021700415", "chunk_id": "0021700415_009", "order": 9, "role": "body", "text": "Love scored 13 in the third quarter, when the Cavs opened an 11-point lead. Jose Calderon added a season-high 17 points for Cleveland."}
{"game_id": "0021700415", "chunk_id": "0021700415_010", "order": 10, "role": "body", "text": "Brandon Ingram scored 26 for the Lakers and Ball had 13 points, 10 assists and eight rebounds."}
{"game_id": "0021700415", "chunk_id": "0021700415_011", "order": 11, "role": "body", "text": "The first game between James and Ball had the buildup of a playoff game as the world's best player matched up against a budding star."}
{"game_id": "0021700415", "chunk_id": "0021700415_012", "order": 12, "role": "body", "text": "Ball's father, LaVar, did not attend the game but his brothers, LiAngelo and LaMelo, sat behind L.A's bench. LaVar Ball launched his \"Big Baller Brand\" to promote his three talented sons. James gave the family a lesson in the business of basketball."}
{"game_id": "0021700415", "chunk_id": "0021700415_013", "order": 13, "role": "body", "text": "Of course, James' impending free agency has led to speculation he may sign with the Lakers. Because of his connections to Los Angeles (he owns a film production company, and recently bought another home there) and some Twitter posts he's made about Ball, the Lakers are believed to be a potential landing spot for the three-time NBA champion, who scoffed at the conjecture about his future or his relationship with Ball."}
{"game_id": "0021700415", "chunk_id": "0021700415_014", "order": 14, "role": "body", "text": "\"I see all the stupid noise that happens,\" he said. \"You know I can't buy a home in L.A., I can't live in L.A. It's funny noise. But I don't get involved in it. When I post things I don't look at comments because I'm so far removed from the white noise and the noise doesn't matter to me.\""}
{"game_id": "0021700415", "chunk_id": "0021700415_016", "order": 16, "role": "body", "text": "Lakers: C Brook Lopez shot consecutive air balls from the foul line in the second quarter, drawing a huge cheer from the crowd. ... Rookie G Josh Hart made his first career start in place of Kentavious Caldwell-Pope, who was scratched for personal reasons. ... Coach Luke Walton has been impressed with how well Ball has adapted to the pros. \"He plays the hardest position in the NBA,\" Walton said. \"He's 20 years old and he's doing it in a huge market and one of the greatest organizations in sports. He's handled all that, good press, bad press, people talking about his shot, people talking about this and that. He's been solid. Teammates love him.\""}
{"game_id": "0021700415", "chunk_id": "0021700415_017", "order": 17, "role": "body", "text": "Cavaliers: F Tristan Thompson was a late scratch after he experienced soreness in his left calf while warming up. Thompson returned on Tuesday and played six minutes in his first game since Nov. 1. ... Coach Tyronn Lue did not have any update on G Isaiah Thomas, nearing a return from a hip injury that has delayed his Cleveland debut. The All-Star recently started taking contact and playing 4-on-4. ... Thomas will have his No. 2 jersey retired by Washington on Feb. 15. ... With his second 3-pointer, J.R. Smith passed Chauncey Billups (1,830) for 11th place on the career list. ... Cleveland made 15 3-pointers and has made at least 10 in a club-record 18 straight games."}
{"game_id": "0021700415", "chunk_id": "0021700415_019", "order": 19, "role": "body", "text": "James was humbled to move into the same company as Bird."}
{"game_id": "0021700415", "chunk_id": "0021700415_020", "order": 20, "role": "body", "text": "\"He's one of the greatest players to ever play the game,\" James said. \"Kid from French Lick (Indiana). Boston. He just played until he literally couldn't play the game no more. He gave everything he had. And for young guys that don't know him, they think of Larry Bird as a jump shooter. But he was so much more than that. He was a passer. He averaged double-digit rebounds. He defended. He took charges. And it's just straight up complete basketball player and me as a small forward, Scottie (Pippen), Bird, Doc (Julius Erving), George Gervin, the guys I kind of looked up to being a small forward."}
{"game_id": "0021700415", "chunk_id": "0021700415_021", "order": 21, "role": "body", "text": "\"I've always been a fan of Larry Bird and if I'm linked with any of the greats, especially like him, it's pretty cool.\""}
{"game_id": "0021700415", "chunk_id": "0021700415_023", "order": 23, "role": "body", "text": "Lakers: Host Golden State on Monday."}
{"game_id": "0021700415", "chunk_id": "0021700415_024", "order": 24, "role": "body", "text": "Cavaliers: Host Utah on Saturday."}
{"game_id": "0021700415", "chunk_id": "0021700415_026", "order": 26, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
