{"game_id": "0021200083", "chunk_id": "0021200083_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Michael Kidd-Gilchrist is learning his way around the NBA, and the rookie took another big step forward on Saturday night."}
{"game_id": "0021200083", "chunk_id": "0021200083_002", "order": 2, "role": "body", "text": "Kidd-Gilchrist had a career-high 25 points and 12 rebounds to help the Charlotte Bobcats snap a 16-game losing streak against the Dallas Mavericks with a 101-97 overtime victory."}
{"game_id": "0021200083", "chunk_id": "0021200083_003", "order": 3, "role": "body", "text": "The former Kentucky star and No. 2 overall draft pick was 8 of 12 from the field and had a pair of crucial offensive rebounds off missed foul shots late in the game."}
{"game_id": "0021200083", "chunk_id": "0021200083_004", "order": 4, "role": "body", "text": "\"I think everybody that has been watching all of our games say that MKG gets a little bit better and then all of a sudden he had what you would call a breakout game,\" coach Mike Dunlap said."}
{"game_id": "0021200083", "chunk_id": "0021200083_005", "order": 5, "role": "body", "text": "\"I think realistic expectations are that he can do what he is doing on the boards. He is a very good defender. The third part of his game is indescribable. He just does little intangibles, passes the ball in close quarters, gets an extra hand on the ball to keep it alive on the offensive glass.\""}
{"game_id": "0021200083", "chunk_id": "0021200083_006", "order": 6, "role": "body", "text": "Teammate Kemba Walker called MKG \"unbelievable.\""}
{"game_id": "0021200083", "chunk_id": "0021200083_007", "order": 7, "role": "body", "text": "\"He wasn't a rookie tonight at all,\" said Walker, who had 26 points and seven assists in another huge game at home."}
{"game_id": "0021200083", "chunk_id": "0021200083_008", "order": 8, "role": "body", "text": "Ramon Sessions also gave the Bobcats a lift, making some big shots down the stretch and in overtime while scoring 12 points. He hit two free throws with 6.3 seconds left in the extra session to help seal the win."}
{"game_id": "0021200083", "chunk_id": "0021200083_009", "order": 9, "role": "body", "text": "Walker drew praise from Dunlap as well, who compared him to Carolina Panthers quarterback Cam Newton, who plays his games just across town."}
{"game_id": "0021200083", "chunk_id": "0021200083_010", "order": 10, "role": "body", "text": "\"He's finding his voice, running things, taking responsibility for our playbook and calling certain things instead of me calling him,\" Dunlap said. \"That is all his development.\""}
{"game_id": "0021200083", "chunk_id": "0021200083_011", "order": 11, "role": "body", "text": "Dallas lost for the second straight night on the road after a 3-0 start."}
{"game_id": "0021200083", "chunk_id": "0021200083_012", "order": 12, "role": "body", "text": "O.J. Mayo scored 22 points and Vince Carter had 19 points for the Mavericks. Carter, who was 5 for 8 from 3-point range, missed an opportunity to win the game at the end of regulation when his fallaway jumper was short."}
{"game_id": "0021200083", "chunk_id": "0021200083_013", "order": 13, "role": "body", "text": "Kidd-Gilchrist attacked the basket with vigor and confidence."}
{"game_id": "0021200083", "chunk_id": "0021200083_014", "order": 14, "role": "body", "text": "The 6-foot-7 small forward ignited the crowd on one second-half fast break when he lost his shoe at half court, dribbled through two defenders for a layup and drew a foul to complete a three-point play."}
{"game_id": "0021200083", "chunk_id": "0021200083_015", "order": 15, "role": "body", "text": "But it was his two huge rebounds after missed foul shots that really helped lift the surprising Bobcats to the victory."}
{"game_id": "0021200083", "chunk_id": "0021200083_016", "order": 16, "role": "body", "text": "Dallas led by seven in the fourth quarter when Sessions powered an 8-0 run, converting two drives to the basket to help the Bobcats grab an 85-84 lead with 2:30 left. Carter followed with a 3-pointer and Mayo hit a pair of foul shots to put the Mavs back up by four with 26.6 seconds remaining."}
{"game_id": "0021200083", "chunk_id": "0021200083_017", "order": 17, "role": "body", "text": "Brendan Haywood came back with a slam dunk off a set play and was fouled. He missed the foul shot, but Kidd-Gilchrist grabbed the rebound and Sessions drove to the basket to tie it at 91 with 2.8 seconds left. Carter's jumper as time expired fell short."}
{"game_id": "0021200083", "chunk_id": "0021200083_018", "order": 18, "role": "body", "text": "Haywood tied it at 93 in the extra session and drew another foul."}
{"game_id": "0021200083", "chunk_id": "0021200083_020", "order": 20, "role": "body", "text": "Haywood missed the free throw again and Kidd-Gilchrist was there to keep it alive. That led to a Byron Mullens dunk, giving the Bobcats the lead with 2:21 left."}
{"game_id": "0021200083", "chunk_id": "0021200083_021", "order": 21, "role": "body", "text": "The Bobcats outrebounded the Mavericks 18-2 on the offensive glass in the second half and overtime, none bigger than the two by Kidd-Gilchrist."}
{"game_id": "0021200083", "chunk_id": "0021200083_022", "order": 22, "role": "body", "text": "\"Those are the ones that are really just inexcusable,\" Mavs center Brandan Wright said. \"You have to get a body on the guys. This one was a tough one to swallow.\""}
{"game_id": "0021200083", "chunk_id": "0021200083_023", "order": 23, "role": "body", "text": "Said Kidd-Gilchrist: \"I'm just getting more comfortable I think as the season is going on. I think I'm starting to get everything. I really like my coaching. I'm just learning day by day.\""}
{"game_id": "0021200083", "chunk_id": "0021200083_024", "order": 24, "role": "body", "text": "Dallas coach Rick Carlisle stressed ball security coming in after the Mavericks turned it over 20 times in Friday night's 104-94 loss to the New York Knicks. But the Mavericks looked shaky early on, committing five turnovers in the first seven minutes to fall behind 22-9. They finished with 19 turnovers."}
{"game_id": "0021200083", "chunk_id": "0021200083_025", "order": 25, "role": "body", "text": "\"We pretty much gave this one away,\" Wright said."}
{"game_id": "0021200083", "chunk_id": "0021200083_026", "order": 26, "role": "body", "text": "After a slow start, Mayo began to heat up, Carter hit three 3-pointers and the Mavericks opened a 55-44 lead at halftime. The Mavericks got a huge boost from their reserves, who outscored their counterparts 25-7."}
{"game_id": "0021200083", "chunk_id": "0021200083_027", "order": 27, "role": "body", "text": "Dallas' lead might have been even larger had it not been for Walker, who had 17 first-half points on 7-of-10 shooting."}
{"game_id": "0021200083", "chunk_id": "0021200083_028", "order": 28, "role": "body", "text": "Dunlap said breaking the losing streak against Dallas was huge for his team's confidence moving forward."}
{"game_id": "0021200083", "chunk_id": "0021200083_029", "order": 29, "role": "body", "text": "\"There are a lot of first in terms of taking care of some things and we take full responsibility in terms of some of the things people see as a negative,\" Dunlap said. \"We should be able to beat other teams that have had long winning streaks against us and we expect to beat them the hard way. We have to earn it.\""}
{"game_id": "0021200083", "chunk_id": "0021200083_030", "order": 30, "role": "closing", "text": "Game notes Haywood returned to the starting lineup after missing Friday's night game at New Orleans to deal with a family matter. ... Carlisle offered no update on when Dirk Nowitzki (knee) or Shawn Marion (knee) will return from their injuries. ... The Bobcats outrebounded the Mavs 36-20 in the second half and overtime."}
