{"game_id": "0021300706", "chunk_id": "0021300706_001", "order": 1, "role": "lead", "text": "PHOENIX --  The sore left elbow Phoenix Suns guard Goran Dragic is dealing with might sting less than the All-Star snub he got earlier this week."}
{"game_id": "0021300706", "chunk_id": "0021300706_002", "order": 2, "role": "body", "text": "Dragic isn't letting either affect his play."}
{"game_id": "0021300706", "chunk_id": "0021300706_003", "order": 3, "role": "body", "text": "He scored 25 points and the Suns made almost 57 percent of their shots through three quarters Saturday night in a 105-95 victory over the Charlotte Bobcats."}
{"game_id": "0021300706", "chunk_id": "0021300706_004", "order": 4, "role": "body", "text": "\"I was kind of sad, mad, just full of emotions when I found out (about not being named an All-Star reserve), but that's the way it is,\" Dragic said. \"It doesn't matter. I just want to play hard and be with my teammates and make the playoffs.\""}
{"game_id": "0021300706", "chunk_id": "0021300706_005", "order": 5, "role": "body", "text": "Marcus Morris added 15 points for the Suns, who have won five straight games and seven of their last eight. It's the second time the Suns have won five in a row, matching their longest winning streak of the season."}
{"game_id": "0021300706", "chunk_id": "0021300706_006", "order": 6, "role": "body", "text": "Phoenix held Charlotte to 14 second-quarter points, the lowest total in that quarter for an opponent this season. The Bobcats had played the night before in Los Angeles."}
{"game_id": "0021300706", "chunk_id": "0021300706_007", "order": 7, "role": "body", "text": "\"You can't have many nights like that. We just didn't try,\" Bobcats coach Steve Clifford said. \"We had no effort to start the game. If you are not ready to play or defend then you have no chance. The guys who came off the bench were worse than the starters.\""}
{"game_id": "0021300706", "chunk_id": "0021300706_008", "order": 8, "role": "body", "text": "The Suns limited Al Jefferson, Charlotte's leading scorer, to just 10 points after he'd logged three straight 30-point games. He was 4 of 15 from the field and didn't play in the fourth quarter."}
{"game_id": "0021300706", "chunk_id": "0021300706_009", "order": 9, "role": "body", "text": "\"Guys were just fighting and made it tough on him,\" Suns coach Jeff Hornacek said of Jefferson, whom he coached as an assistant with the Utah Jazz. \"He'll shake his head and say `Why do you keep trapping me all the time?' That's the kind of player he is, where we have to do that to him all the time.\""}
{"game_id": "0021300706", "chunk_id": "0021300706_010", "order": 10, "role": "body", "text": "Markieff Morris threw down a dunk with 3.4 seconds left in the third quarter to give the Suns a 90-63 lead. He finished with 13 points and nine rebounds."}
{"game_id": "0021300706", "chunk_id": "0021300706_011", "order": 11, "role": "body", "text": "The Bobcats cut the Suns' lead to 99-86 with just under four minutes left in the fourth quarter but couldn't sustain the run."}
{"game_id": "0021300706", "chunk_id": "0021300706_012", "order": 12, "role": "body", "text": "Reserve Anthony Tolliver led Charlotte with 14 points and Jannero Pargo added 12 points and six assists."}
{"game_id": "0021300706", "chunk_id": "0021300706_013", "order": 13, "role": "body", "text": "Ish Smith's floater with 7:05 left in the first half gave the Suns a 47-35 lead, and his driving right-hand layup made it 50-36 with 5:59 left. Marcus Morris hit a 3 off a feed from Dragic to make it 55-41, and Dragic scored the final four points of the half as the Suns closed it out on a 9-0 run."}
{"game_id": "0021300706", "chunk_id": "0021300706_014", "order": 14, "role": "body", "text": "Dragic hit 10 of 14 shots in 27 minutes of action and has 20 or more points in four straight games."}
{"game_id": "0021300706", "chunk_id": "0021300706_015", "order": 15, "role": "body", "text": "\"I'm more relaxed,\" Dragic said. \"I know how the opponent is going to guard me. . It feels like I'm playing basketball with my friends back home, no pressure and I just go there and do my job, I get great support from my teammates and it's just fun.\""}
{"game_id": "0021300706", "chunk_id": "0021300706_016", "order": 16, "role": "body", "text": "The Bobcats failed to score for the final five-plus minutes of the first half. The Suns' defense on Jefferson was a major factor as they double-teamed the big man at times or sent a player over to stab at the ball as soon as he caught it."}
{"game_id": "0021300706", "chunk_id": "0021300706_017", "order": 17, "role": "body", "text": "\"We didn't have the energy that we needed, we weren't making shots, no excuses,\" Jefferson said."}
{"game_id": "0021300706", "chunk_id": "0021300706_018", "order": 18, "role": "body", "text": "The Bobcats had won their last two games, the first stops of a four-game western road swing."}
{"game_id": "0021300706", "chunk_id": "0021300706_019", "order": 19, "role": "closing", "text": "Game notes The Bobcats were without guard Kemba Walker, whose 18.7 points and five assists per game were missed. Walker has been out with a sprained left ankle for two weeks and is expected to return soon. ... Saturday was Fan Appreciation Night at the US Airways Center. About half the crowd received \"Go Suns\" foam fingers. ... Injured Suns guard Eric Bledsoe has been out since Jan. 2, but he is the featured player on bobblehead dolls that will be given to fans at the next Suns home game, Tuesday against the Chicago Bulls. ... The balls used for Saturday's game were among the first ones to bear the signature of new NBA Commissioner Adam Silver. ... The two teams wore warm-up shirts bearing the Twitter hashtag \"(hash)NBABHM\" in honor of Black History Month."}
