{"game_id": "0021700529", "chunk_id": "0021700529_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  An uncomfortable pattern has emerged the first half of the season for the Los Angeles Clippers. They cannot seem to approach being a healthy team."}
{"game_id": "0021700529", "chunk_id": "0021700529_002", "order": 2, "role": "body", "text": "On a night they got Blake Griffin back for the first time in a month from a knee injury in their 121-106 victory Friday over the slumping Los Angeles Lakers, they lost guard Austin Rivers to an Achilles strain."}
{"game_id": "0021700529", "chunk_id": "0021700529_003", "order": 3, "role": "body", "text": "Griffin returned to lead all scorers with 24 points, but Rivers injured his right Achilles in the third quarter and left the arena on crutches."}
{"game_id": "0021700529", "chunk_id": "0021700529_004", "order": 4, "role": "body", "text": "They already lost guard Patrick Beverley for the season to a knee injury. Forward Danilo Gallinari is out for the second time with a glute injury. They only recently got starting point guard Milos Teodosic back from a plantar fascia injury. Like Griffin, all our starters."}
{"game_id": "0021700529", "chunk_id": "0021700529_005", "order": 5, "role": "body", "text": "\"Now it looks like Austin,\" said Clippers coach Doc Rivers, Austin's dad. \"We just keep rolling. It doesn't matter who is on the floor. We play like a team, we play hard, we defend hard. Our job is to figure it out each game until we get everybody back.\""}
{"game_id": "0021700529", "chunk_id": "0021700529_006", "order": 6, "role": "body", "text": "The Lakers have their own problems. The loss was their fifth straight and eighth and their last nine games."}
{"game_id": "0021700529", "chunk_id": "0021700529_007", "order": 7, "role": "body", "text": "They fell behind 19-3 to open the game, for the second consecutive game making only one of their first 10 shots, and never could recover. Their defense lacking early, the Clippers never did trail."}
{"game_id": "0021700529", "chunk_id": "0021700529_008", "order": 8, "role": "body", "text": "\"To me that's the No.1 thing we have to fix,\" said Lakers coach Luke Walton. \"It's what we've been able to hang our hat on all year. We get after it on defense, we get stops and we get out and run. Tonight we scored but we didn't play any defense.\""}
{"game_id": "0021700529", "chunk_id": "0021700529_009", "order": 9, "role": "body", "text": "Griffin hit only 6 of 15 field goal attempts, but connected on 11 of 12 free throws and added six rebounds and six assists. More importantly, he reported no issues with his knee."}
{"game_id": "0021700529", "chunk_id": "0021700529_010", "order": 10, "role": "body", "text": "\"It felt good,\" he said. \"I didn't have any second thoughts, any moments when I didn't trust it. That was important.\""}
{"game_id": "0021700529", "chunk_id": "0021700529_011", "order": 11, "role": "body", "text": "Lou Williams, who will likely take over Austin Rivers' starting role, had 23 points off the bench for the Clippers and DeAndre Jordan had 16 rebounds."}
{"game_id": "0021700529", "chunk_id": "0021700529_012", "order": 12, "role": "body", "text": "Jordan Clarkson led the Lakers with 20 points and Brandon Ingram and Julius Randle added 18 points each."}
{"game_id": "0021700529", "chunk_id": "0021700529_014", "order": 14, "role": "body", "text": "Clippers: Rivers said before the game that Griffin (sprained left medial collateral ligament) would not be on a minutes limit in his first game back since Nov. 11. Said Rivers: \"Not really, I think it's a lung restriction. He'll probably get tired. Other than that, it's not anything we're worried about.\" Griffin was originally expected to be out eight weeks. . F Wes Johnson (foot) also returned after missing three games."}
{"game_id": "0021700529", "chunk_id": "0021700529_015", "order": 15, "role": "body", "text": "Lakers: Instead of practicing Thursday, the struggling Lakers held a team meeting. Walton called it a good meeting, but warned against placing too much significance to it. Said Walton: \"I've been on a championship team where we had meetings in the middle of the season, so this is nothing new in sports and I think every athlete knows that.\" ... F Kyle Kuzma suffered a bruised right quad Wednesday but was cleared to play. . G Lonzo Ball (shoulder) missed his third consecutive game and Walton said would not play Sunday."}
{"game_id": "0021700529", "chunk_id": "0021700529_017", "order": 17, "role": "body", "text": "Randle, normally a 6-9 forward, started at center Friday. Clarkson, who had started for Ball in the Lakers last game, came off the bench Josh Hart started."}
{"game_id": "0021700529", "chunk_id": "0021700529_018", "order": 18, "role": "body", "text": "\"We've been losing games and Julius has been great all year for us,\" Walton said. \"I wanted to give him a chance in there. If we'd won five out of six, we probably would have kept it how it is.\""}
{"game_id": "0021700529", "chunk_id": "0021700529_020", "order": 20, "role": "body", "text": "Clippers:  Will host Charlotte on Sunday."}
{"game_id": "0021700529", "chunk_id": "0021700529_021", "order": 21, "role": "body", "text": "Lakers: Travel to Houston on Sunday to meet the Rockets, who have unexpectedly lost four straight."}
{"game_id": "0021700529", "chunk_id": "0021700529_023", "order": 23, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
