{"game_id": "0021400168", "chunk_id": "0021400168_001", "order": 1, "role": "lead", "text": "DENVER --  Wilson Chandler stood out on the court for reasons way beyond his salmon-colored shoes with neon green soles."}
{"game_id": "0021400168", "chunk_id": "0021400168_002", "order": 2, "role": "body", "text": "Although, those sneakers -- from the Kevin Durant line, by the way -- were definitely hard to miss."}
{"game_id": "0021400168", "chunk_id": "0021400168_003", "order": 3, "role": "body", "text": "Chandler had 21 points, including a key 3-pointer late in the game, and Timofey Mozgov finished with a season-high 17 to lift the Denver Nuggets over the Oklahoma City Thunder 107-100 Wednesday night."}
{"game_id": "0021400168", "chunk_id": "0021400168_004", "order": 4, "role": "body", "text": "Ty Lawson added 15 points and 15 assists for the Nuggets, who returned home following a 2-1 trip that included a win over LeBron James and the Cleveland Cavaliers."}
{"game_id": "0021400168", "chunk_id": "0021400168_005", "order": 5, "role": "body", "text": "\"Confidence breeds confidence,\" said Arron Afflalo, who had 13 points. \"The more victories you get, the more of that feeling you want."}
{"game_id": "0021400168", "chunk_id": "0021400168_006", "order": 6, "role": "body", "text": "\"Just wanted to keep it moving.\""}
{"game_id": "0021400168", "chunk_id": "0021400168_007", "order": 7, "role": "body", "text": "Serge Ibaka had 22 points and 13 rebounds for Oklahoma City, with reigning NBA MVP Durant (broken right foot) and All-Star guard Russell Westbrook (broken right hand) on the bench in suits. The Thunder have dropped four straight, including Tuesday night in Utah."}
{"game_id": "0021400168", "chunk_id": "0021400168_008", "order": 8, "role": "body", "text": "\"Defensively, it wasn't good for us tonight,\" Thunder coach Scott Brooks said. \"I know Denver is a very difficult team to guard. Their point guard is as fast as any guard in the league and he was getting by our guy too easily and kicking out for open shots.\""}
{"game_id": "0021400168", "chunk_id": "0021400168_009", "order": 9, "role": "body", "text": "Down by 16 early in the fourth quarter, the Thunder cut it to 101-98 with 3:19 to play on a 3-pointer by Ibaka. Chandler and Afflalo, however, hit back-to-back 3s in a 45-second span to extend the lead with 1:42 remaining."}
{"game_id": "0021400168", "chunk_id": "0021400168_010", "order": 10, "role": "body", "text": "Chandler then had a key block to help secure the win."}
{"game_id": "0021400168", "chunk_id": "0021400168_012", "order": 12, "role": "body", "text": "\"The ball just found me. That's all,\" Chandler said with a casual shrug. \"They really didn't have anything to lose. Teams like that are dangerous.\""}
{"game_id": "0021400168", "chunk_id": "0021400168_013", "order": 13, "role": "body", "text": "Denver gained some separation in the third behind Lawson, who had six points and seven assists in the quarter."}
{"game_id": "0021400168", "chunk_id": "0021400168_014", "order": 14, "role": "body", "text": "The Nuggets caught a break as they built their lead to 15 when Kenneth Faried charged down the lane and floated in a shot as he collided with Nick Collison. At first, Faried was whistled for a charge, negating the basket. But the officials huddled and switched it to a blocking foul."}
{"game_id": "0021400168", "chunk_id": "0021400168_015", "order": 15, "role": "body", "text": "Faried, who turned 25 on Wednesday, sank the free throw to make it 75-60."}
{"game_id": "0021400168", "chunk_id": "0021400168_016", "order": 16, "role": "body", "text": "\"I thought we came out flat in the third quarter,\" Brooks said. \"That is unacceptable. We have to come out with a mindset that we are a defensive team and we kept on just trying to score."}
{"game_id": "0021400168", "chunk_id": "0021400168_017", "order": 17, "role": "body", "text": "\"You do that against Denver, you are not going to have a chance to beat them.\""}
{"game_id": "0021400168", "chunk_id": "0021400168_018", "order": 18, "role": "body", "text": "Faried also had a thunderous dunk in the third that drew a roar from the crowd."}
{"game_id": "0021400168", "chunk_id": "0021400168_019", "order": 19, "role": "body", "text": "It was quite a departure from the last time the Nuggets played at home, when fans booed them off the court following a rout by Portland. Denver coach Brian Shaw understood their disappointment."}
{"game_id": "0021400168", "chunk_id": "0021400168_020", "order": 20, "role": "body", "text": "\"To the fans, it looks like we're not putting out any energy, not giving them what they paid for,\" Shaw said. \"You turn it around by giving that energy and effort.\""}
{"game_id": "0021400168", "chunk_id": "0021400168_023", "order": 23, "role": "body", "text": "Thunder: Reserve G Sebastian Telfair had 18 points, hitting all seven shots he took. He was 4 of 4 from 3-point range. ... G Reggie Jackson grew up about 60 miles from the Pepsi Center in Colorado Springs. He finished with 16 points. ... Andre Roberson was back on the floor after being sidelined with a sprained left foot. The former University of Colorado standout scored three points in limited minutes. ... Brooks said he learned how to manage a short bench while he was an assistant in Denver under George Karl. \"He's had a lot of wins playing with seven or eight guys,\" Brooks said."}
{"game_id": "0021400168", "chunk_id": "0021400168_024", "order": 24, "role": "body", "text": "Nuggets: In a pregame ceremony, the Nuggets commemorated the gold medal Faried won with Team USA at the Basketball World Cup this summer. The team presented Faried with a painting of himself. ... Shaw has been on the hot seat due to Denver's slow start. \"I can take the criticism with the best of them,\" he said. ...  The Nuggets lost to the Thunder 102-91 on Nov. 1."}
{"game_id": "0021400168", "chunk_id": "0021400168_026", "order": 26, "role": "body", "text": "Thunder: Host Brooklyn on Friday."}
{"game_id": "0021400168", "chunk_id": "0021400168_027", "order": 27, "role": "closing", "text": "Nuggets: Host New Orleans on Friday."}
