{"game_id": "0021700576", "chunk_id": "0021700576_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Damian Lillard believes Portland's offense is finally finding a flow after an early season focus on defense."}
{"game_id": "0021700576", "chunk_id": "0021700576_002", "order": 2, "role": "body", "text": "\"It takes time,\" he said. \"Typically we were a really good offensive team, and we were not a great defensive team. This year we came in and we've been really good on defense. I think our offense has been set back, I guess, and it's taken a little bit longer to find that rhythm and for guys to understand what plays need to be made, when to make the extra pass, who to make that extra pass to. But we're figuring it out.\""}
{"game_id": "0021700576", "chunk_id": "0021700576_003", "order": 3, "role": "body", "text": "CJ McCollum led Portland with 20 points and Lillard added 14 in a 110-89 victory over the Atlanta Hawks on Friday night."}
{"game_id": "0021700576", "chunk_id": "0021700576_004", "order": 4, "role": "body", "text": "Al-Farouq Aminu also had 14 and the Blazers snapped a three-game losing streak to the Hawks at the Moda Center. Seven of Portland's players were in double figures and the team had a season-high 30 assists."}
{"game_id": "0021700576", "chunk_id": "0021700576_005", "order": 5, "role": "body", "text": "Dennis Schroder had 14 points for the Hawks, who trailed by as many as 25 points in fourth quarter. Atlanta has lost three of its last four games."}
{"game_id": "0021700576", "chunk_id": "0021700576_006", "order": 6, "role": "body", "text": "It was not known whether Lillard would play against the Hawks because of a calf injury, but he started. He had missed four games with a sore right hamstring before playing 33 minutes and scoring 25 points in a 127-110 loss at Cleveland on Tuesday."}
{"game_id": "0021700576", "chunk_id": "0021700576_007", "order": 7, "role": "body", "text": "\"He gave them a spark at certain times,\" Atlanta's Taurean Prince said. \"He didn't score 30 or anything but the things that he did helped his teammates. He's a good player so we expected him to make a difference.\""}
{"game_id": "0021700576", "chunk_id": "0021700576_008", "order": 8, "role": "body", "text": "Lillard, who sat the fourth quarter, finished with six assists, as did McCollum. Coach Terry Stotts said ball movement has been key."}
{"game_id": "0021700576", "chunk_id": "0021700576_009", "order": 9, "role": "body", "text": "\"It's three games in a row where our passing has been improved and we've just got to continue that. Our passing has been below average for most of the season, so it's encouraging between Chicago and Cleveland and tonight, that we're making some passes,\" Stotts said."}
{"game_id": "0021700576", "chunk_id": "0021700576_010", "order": 10, "role": "body", "text": "The Blazers went on a 12-2 run to take an early 20-12 lead. Portland led by as many as 12 points in the opening half, but Atlanta got back within 45-43 on Schroder's layup."}
{"game_id": "0021700576", "chunk_id": "0021700576_011", "order": 11, "role": "body", "text": "After a brief dustup where words were exchanged between Prince and Jusuf Nurkic, the Blazers went on to a 52-46 lead at halftime. McCollum led all scorers with 16 points."}
{"game_id": "0021700576", "chunk_id": "0021700576_012", "order": 12, "role": "body", "text": "Prince had a 3-pointer in the first half to extend his streak to 20 straight games with a 3."}
{"game_id": "0021700576", "chunk_id": "0021700576_013", "order": 13, "role": "body", "text": "Aminu's driving layup gave the Blazers an 80-63 lead late in the third quarter."}
{"game_id": "0021700576", "chunk_id": "0021700576_014", "order": 14, "role": "body", "text": "\"They played well but I think we've got to do more to make it hard on them, we've got to do more to make them uncomfortable,\" Hawks coach Mike Budenholzer said. \"I don't know what they shot in the third quarter, what they scored, but I just felt like we just didn't get any stops.\""}
{"game_id": "0021700576", "chunk_id": "0021700576_015", "order": 15, "role": "body", "text": "McCollum's 3-pointer and Pat Connaughton's layup pushed Portland's lead to 91-68 early in the fourth."}
{"game_id": "0021700576", "chunk_id": "0021700576_016", "order": 16, "role": "body", "text": "Stotts sent his all of his starters to the bench at the start of the fourth quarter except for McCollum, who played for just over five minutes before he took a seat as well."}
{"game_id": "0021700576", "chunk_id": "0021700576_017", "order": 17, "role": "body", "text": "Atlanta, in the midst of a five-game road trip, fell 104-103 to the Suns in Phoenix on Tuesday."}
{"game_id": "0021700576", "chunk_id": "0021700576_019", "order": 19, "role": "body", "text": "Hawks: Atlanta rookie Tyler Dorsey played for Oregon. ... The Hawks recalled forward DeAndre Bembry from the Erie Bay Hawks. He was expected to head to Atlanta for evaluation and treatment for a left groin strain."}
{"game_id": "0021700576", "chunk_id": "0021700576_020", "order": 20, "role": "body", "text": "Trail Blazers: Portland fell in the first game against the Hawks this season, 104-89 in Atlanta last Saturday. ... The Blazers improved their record to 9-10 at home. ... Evan Turner reached double figures for the third straight game and 16th game overall. ... Portland made 13 of 30 3-point attempts."}
{"game_id": "0021700576", "chunk_id": "0021700576_022", "order": 22, "role": "body", "text": "The Hawks visit the Lakers on Sunday."}
{"game_id": "0021700576", "chunk_id": "0021700576_023", "order": 23, "role": "body", "text": "The Trail Blazers host the San Antonio Spurs."}
{"game_id": "0021700576", "chunk_id": "0021700576_025", "order": 25, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
