{"game_id": "0021200736", "chunk_id": "0021200736_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- Even though Kobe Bryant and the Lakers were able to escape with a 100-93 win Friday night over the Charlotte Bobcats, the Los Angeles star was left feeling \"irritated\" after the game."}
{"game_id": "0021200736", "chunk_id": "0021200736_002", "order": 2, "role": "body", "text": "Irritated at his team's shot selection."}
{"game_id": "0021200736", "chunk_id": "0021200736_003", "order": 3, "role": "body", "text": "Irritated at his team's selfishness."}
{"game_id": "0021200736", "chunk_id": "0021200736_004", "order": 4, "role": "body", "text": "And especially irritated the Lakers needed to overcome a 20-point deficit to beat the NBA's worst team."}
{"game_id": "0021200736", "chunk_id": "0021200736_005", "order": 5, "role": "body", "text": "\"We have to play the right way,\" Bryant said. \"When we have shots available, we take them. If we don't, move the ball on. It can't be about individual touches. It can't be about that.\""}
{"game_id": "0021200736", "chunk_id": "0021200736_007", "order": 7, "role": "body", "text": "Bryant shrugged off a scoreless first half -- he attempted only two shots -- to finish with 20 points, eight assists and seven rebounds and the Lakers improved to 4-2 on their road trip heading into Sunday's game in Miami against the Heat."}
{"game_id": "0021200736", "chunk_id": "0021200736_008", "order": 8, "role": "body", "text": "Bryant didn't come out for warmups to start the second half."}
{"game_id": "0021200736", "chunk_id": "0021200736_009", "order": 9, "role": "body", "text": "But he was there to provide the spark the lackluster Lakers needed in the third quarter. He scored 14 of his points in the final period, including a driving layup with 40 seconds left to push the lead to five and help seal the win."}
{"game_id": "0021200736", "chunk_id": "0021200736_010", "order": 10, "role": "body", "text": "\"In the second half, I got in position where I could catch it and turn and shoot it a little bit,\" Bryant said. \"They were reluctant to double team because we started knocking down some shots. I think that makes the game a lot easier.\""}
{"game_id": "0021200736", "chunk_id": "0021200736_011", "order": 11, "role": "body", "text": "Steve Nash and Earl Clark each had 17 points and Dwight Howard had 12 points, all in the first half, and 11 rebounds for the Lakers (24-27)."}
{"game_id": "0021200736", "chunk_id": "0021200736_012", "order": 12, "role": "body", "text": "Howard played his second straight game despite nursing an injured right shoulder."}
{"game_id": "0021200736", "chunk_id": "0021200736_013", "order": 13, "role": "body", "text": "\"Continuity,\" Howard said when asked of the Lakers' offensive woes. \"We have to do a better job of spreading everything out and moving and getting everybody involved. When we do that, we are pretty good.\""}
{"game_id": "0021200736", "chunk_id": "0021200736_014", "order": 14, "role": "body", "text": "Byron Mullens and Gerald Henderson each had 20 points for the Bobcats, who have lost six straight."}
{"game_id": "0021200736", "chunk_id": "0021200736_015", "order": 15, "role": "body", "text": "Charlotte led 71-51 in the third quarter, but the Lakers stormed back behind a 9-0 run. They cut the lead to one on a driving layup by Bryant with 6:06 left in the game and Antawn Jamison gave the Lakers their first lead with 4:46 remaining on a left-handed finger roll in the lane."}
{"game_id": "0021200736", "chunk_id": "0021200736_016", "order": 16, "role": "body", "text": "The Lakers took the lead for good at 92-91 when Jodie Meeks made a 3-pointer with 3:02 left in the game."}
{"game_id": "0021200736", "chunk_id": "0021200736_017", "order": 17, "role": "body", "text": "Lakers coach Mike D'Antoni wasn't pleased with the overall effort, but liked that his team bounced back after a 116-95 loss to the Boston Celtics the night before."}
{"game_id": "0021200736", "chunk_id": "0021200736_018", "order": 18, "role": "body", "text": "\"We just got to be able to put our earplugs in, or mufflers on, or blinders on,\" D'Antoni said. \"It's like the Kentucky Derby with horses, just get those blinders on and just get out there and run."}
{"game_id": "0021200736", "chunk_id": "0021200736_019", "order": 19, "role": "body", "text": "\"We have so much stuff going on out here that every little thing is blown to bits and whether it is right or wrong or blown out of proportion it is. But, it affects us. It is a distraction. It saps energy. We got to be able to just close that out somehow.\""}
{"game_id": "0021200736", "chunk_id": "0021200736_020", "order": 20, "role": "body", "text": "The Lakers have been unpredictable this season, particularly on the road where they were 8-17 coming into this game."}
{"game_id": "0021200736", "chunk_id": "0021200736_021", "order": 21, "role": "body", "text": "Before Friday night's game against Charlotte, D'Antoni was asked if the Bobcats were a dangerous opponent for his team."}
{"game_id": "0021200736", "chunk_id": "0021200736_022", "order": 22, "role": "body", "text": "\"We're playing, aren't we? (Then) there's a danger,\" D'Antoni said with a laugh. \"If they play the national anthem, we're in danger.\""}
{"game_id": "0021200736", "chunk_id": "0021200736_024", "order": 24, "role": "body", "text": "The Lakers started slow, looking out of sync just as they have for a good portion of the season as pick and rolls turned into turnovers and layups on the other end."}
{"game_id": "0021200736", "chunk_id": "0021200736_025", "order": 25, "role": "body", "text": "Nash had four early turnovers and Howard threw a pass across court that hit the side of the backboard."}
{"game_id": "0021200736", "chunk_id": "0021200736_026", "order": 26, "role": "body", "text": "The Lakers turned the ball over five times in the game's first eight minutes and fell behind 20-9."}
{"game_id": "0021200736", "chunk_id": "0021200736_027", "order": 27, "role": "body", "text": "Bryant missed his only two shots in the first half, his slowest start since March 31, 2012, when he went three quarters without scoring a point before beating the New Orleans Hornets on a game-winning shot."}
{"game_id": "0021200736", "chunk_id": "0021200736_028", "order": 28, "role": "body", "text": "The game was similar to earlier this season when the Bobcats led by 18 in Los Angeles only to squander the lead."}
{"game_id": "0021200736", "chunk_id": "0021200736_029", "order": 29, "role": "body", "text": "\"We had them down pretty much the whole game,\" Bobcats guard Kemba Walker said. \"You know, they made a really good run. Kobe made a lot of good plays, made the right passes and guys just made shots.\""}
{"game_id": "0021200736", "chunk_id": "0021200736_030", "order": 30, "role": "closing", "text": "Game notes Bobcats rookie Michael Kidd-Gilchrist returned to action Friday after missing two games with a concussion. ... At halftime Bryant had five rebounds, two assists and no points. ... The Bobcats had been one of three teams with a .500 or better record all-time against the Lakers, but fell to 8-9 with Friday night's loss."}
