{"game_id": "0021700748", "chunk_id": "0021700748_001", "order": 1, "role": "lead", "text": "HOUSTON --  James Harden knew he'd have to do a little more on Tuesday night with the Houston Rockets missing key players."}
{"game_id": "0021700748", "chunk_id": "0021700748_002", "order": 2, "role": "body", "text": "Even he couldn't have imagined he'd do this much."}
{"game_id": "0021700748", "chunk_id": "0021700748_003", "order": 3, "role": "body", "text": "Harden became the first player in NBA history to score 60 points as part of a triple-double and the short-handed Rockets beat the Orlando Magic 114-107."}
{"game_id": "0021700748", "chunk_id": "0021700748_004", "order": 4, "role": "body", "text": "\"I just gave it all I had tonight,\" Harden said. \"We all did. We all fought for 48 minutes, we got key stops when we needed to and we made big shots.\""}
{"game_id": "0021700748", "chunk_id": "0021700748_005", "order": 5, "role": "body", "text": "Harden scored 18 points in the fourth quarter to eclipse the 57 points Calvin Murphy scored in 1978 to break Houston's single-game scoring record. After Harden broke the record, cameras in the arena showed a shot of Murphy, who works on the television broadcast team, smiling and clapping for the Beard, who also had 10 rebounds and 11 assists."}
{"game_id": "0021700748", "chunk_id": "0021700748_006", "order": 6, "role": "body", "text": "The game was tied at 107 after a basket by Marreese Speights with just under four minutes to play. Neither team scored for more than two minutes after that before Harden took over, scoring the next six points to make it 113-107 with 45 seconds left."}
{"game_id": "0021700748", "chunk_id": "0021700748_007", "order": 7, "role": "body", "text": "He set the scoring mark when he stepped back and made a 3-pointer before crashing to the court after being fouled by Mario Hezonja. He then made the free throw to give him 60 points and bringing the crowd to its feet."}
{"game_id": "0021700748", "chunk_id": "0021700748_008", "order": 8, "role": "body", "text": "\"Amazing (and) topped it off with a four-point play at the end,\" coach Mike D'Antoni said. \"But we had to have every minute from him.\""}
{"game_id": "0021700748", "chunk_id": "0021700748_009", "order": 9, "role": "body", "text": "Harden, who also had four steals and a block, grabbed his 10th rebound a few seconds later to give him his third triple double this season. He made 17 of 18 free throws and was 19 of 30 from the floor with five 3 pointers."}
{"game_id": "0021700748", "chunk_id": "0021700748_010", "order": 10, "role": "body", "text": "He said he didn't realize he was the first player with 60 points in a triple-double."}
{"game_id": "0021700748", "chunk_id": "0021700748_011", "order": 11, "role": "body", "text": "\"It's a good feeling, I guess,\" he said. \"Just try to go out there and make an impact every single night on the game, however I can. Whether it's scoring, rebounding, assists, steals, whatever it is. And tonight I guess I was doing everything.\""}
{"game_id": "0021700748", "chunk_id": "0021700748_012", "order": 12, "role": "body", "text": "Hezonja and Speights scored 17 points each for the Magic, who dropped their third straight."}
{"game_id": "0021700748", "chunk_id": "0021700748_013", "order": 13, "role": "body", "text": "The Rockets started the game without Chris Paul, who has a sore groin, and Trevor Ariza, who is dealing with a strained hamstring. They lost another player when Eric Gordon, who is second on the team in scoring with 19.5 points a game, left early in the second quarter with lower back stiffness."}
{"game_id": "0021700748", "chunk_id": "0021700748_014", "order": 14, "role": "body", "text": "\"I looked at coach and said: `Eric can't go,\" Harden said \"He said go get `em and after that I didn't come out of the game.\""}
{"game_id": "0021700748", "chunk_id": "0021700748_015", "order": 15, "role": "body", "text": "Harden's big night came as he played 46 minutes and 26 seconds, which was a career-high for a regulation game, with Houston missing so many players."}
{"game_id": "0021700748", "chunk_id": "0021700748_016", "order": 16, "role": "body", "text": "\"I was shocked to see that,\" Speights said of Harden not getting worn out by playing so many minutes. \"He didn't really get subbed out and that shows the growth in his game and the maturity in his game.\""}
{"game_id": "0021700748", "chunk_id": "0021700748_017", "order": 17, "role": "body", "text": "It was his fourth 50-point game this season and Tuesday's performance bested his previous career-high of 56 points set in November against Utah."}
{"game_id": "0021700748", "chunk_id": "0021700748_018", "order": 18, "role": "body", "text": "\"I have never seen a performance like that,\" teammate Gerald Green said. \"I caught myself just being a true fan throughout the whole game ... what he did today was remarkable.\""}
{"game_id": "0021700748", "chunk_id": "0021700748_019", "order": 19, "role": "body", "text": "Orlando led by two points with about 9 1/2 minutes left before the Rockets used a 10-4 run to make it 101-97 with about seven minutes to go. Harden made two 3-pointers in that stretch, and wowed the crowd on the second one that he came as the shot clock was about to expire and with Shelvin Mack right in his face."}
{"game_id": "0021700748", "chunk_id": "0021700748_020", "order": 20, "role": "body", "text": "Houston didn't lead for long though, as Speights was fouled while making a 3-pointer and added the free throw to tie it seconds later."}
{"game_id": "0021700748", "chunk_id": "0021700748_021", "order": 21, "role": "body", "text": "The Magic had a 2-point lead with about 5 1/2 minutes left before Houston used a 6-2 run, with all its points from Harden, to take a 107-105 lead with about four minutes left."}
{"game_id": "0021700748", "chunk_id": "0021700748_022", "order": 22, "role": "body", "text": "Harden piled up 16 points in the first quarter and had 24 by halftime despite his early 3-point shooting woes. Orlando led 55-54 at halftime."}
{"game_id": "0021700748", "chunk_id": "0021700748_024", "order": 24, "role": "body", "text": "Magic: Aaron Gordon missed the game with an injury to his left hip that he suffered on Saturday night. He will likely sit out Wednesday as well.  ... Simmons and Mack added 15 points each."}
{"game_id": "0021700748", "chunk_id": "0021700748_025", "order": 25, "role": "body", "text": "Rockets: Ariza injured his left hamstring on Sunday. ... Coach Mike D'Antoni said he doesn't expect Paul to miss much time with his injury. ... Clint Capela finished with 12 points and 13 rebounds."}
{"game_id": "0021700748", "chunk_id": "0021700748_027", "order": 27, "role": "body", "text": "Magic coach Frank Vogel on Harden's performance: \"That was a heck of a performance when your second, third and fourth options are out. He's likely the MVP of this year's season. He did what he had to do to get a win."}
{"game_id": "0021700748", "chunk_id": "0021700748_029", "order": 29, "role": "body", "text": "Cleveland star LeBron James gave Harden some love on Twitter after the game , tweeting in part: \"That's insane G! 60 point Triple Dub. Sheesh!!!\" The four-time MVP added five fire emojis after his comment to show how impressed he was with Harden's game."}
{"game_id": "0021700748", "chunk_id": "0021700748_031", "order": 31, "role": "body", "text": "Magic: Host Lakers on Wednesday night."}
{"game_id": "0021700748", "chunk_id": "0021700748_032", "order": 32, "role": "closing", "text": "Rockets: Visit San Antonio Thursday night."}
