{"game_id": "0021700673", "chunk_id": "0021700673_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  They were missing three injured starters and made two free throws all night. Hard to imagine the Los Angeles Lakers could find a more unlikely way to win."}
{"game_id": "0021700673", "chunk_id": "0021700673_002", "order": 2, "role": "body", "text": "Reserve guard Jordan Clarkson sparked an undermanned team with 33 points, seven assists and seven rebounds, leading Los Angeles to a 99-86 victory Friday night over the Indiana Pacers."}
{"game_id": "0021700673", "chunk_id": "0021700673_003", "order": 3, "role": "body", "text": "The Lakers won for the first time in nine games this season without rookie point guard Lonzo Ball. And they did it despite going 2 for 14 from the foul line, a franchise low at 14.3 percent."}
{"game_id": "0021700673", "chunk_id": "0021700673_004", "order": 4, "role": "body", "text": "\"It was defense,\" coach Luke Walton said. \"Our defense was awesome tonight. That was the challenge all day to the guys. It doesn't matter who's out, how many guys are out, if we defend the way we're capable and compete on that end of the floor.\""}
{"game_id": "0021700673", "chunk_id": "0021700673_005", "order": 5, "role": "body", "text": "The Lakers held Indiana to 38.1 percent shooting, including a miserable 2 of 25 from 3-point range."}
{"game_id": "0021700673", "chunk_id": "0021700673_006", "order": 6, "role": "body", "text": "\"We missed shots, turned the ball over and they made shots,\" Pacers coach Nate McMillan said. \"That was really the game.\""}
{"game_id": "0021700673", "chunk_id": "0021700673_007", "order": 7, "role": "body", "text": "The Lakers first grabbed control in the second quarter. Players took turns aggressively slashing through the lane and then Clarkson got hot, scoring nine points as Los Angeles outscored the Pacers 29-14 in the period."}
{"game_id": "0021700673", "chunk_id": "0021700673_008", "order": 8, "role": "body", "text": "\"I was just hooping today,\" Clarkson said. \"I was comfortable, not thinking too much.\""}
{"game_id": "0021700673", "chunk_id": "0021700673_009", "order": 9, "role": "body", "text": "Walton said in his experience, players have breakout offensive games when they're not thinking about scoring."}
{"game_id": "0021700673", "chunk_id": "0021700673_010", "order": 10, "role": "body", "text": "\"To me, guys normally have nights like that when they stop thinking about offense,\" Walton said. \"You kind of get lost in doing other things when you're as gifted as he is offensively. That's when you have nights like that.\""}
{"game_id": "0021700673", "chunk_id": "0021700673_011", "order": 11, "role": "body", "text": "The Lakers shot 55 percent from the floor. But at the foul line, Clarkson made two of his three free throws; the rest of the team was 0 for 11."}
{"game_id": "0021700673", "chunk_id": "0021700673_012", "order": 12, "role": "body", "text": "\"It's like a virus or something,\" Clarkson said."}
{"game_id": "0021700673", "chunk_id": "0021700673_013", "order": 13, "role": "body", "text": "Victor Oladipo led Indiana with 25 points, but most of his teammates struggled offensively. Darren Collison shot 1 of 9 and Lance Stephenson was 1 for 12."}
{"game_id": "0021700673", "chunk_id": "0021700673_014", "order": 14, "role": "body", "text": "It marked the first time this season the Pacers, the NBA's third-best shooting team, finished under 40 percent in consecutive games."}
{"game_id": "0021700673", "chunk_id": "0021700673_015", "order": 15, "role": "body", "text": "\"They just didn't go in,\" Oladipo said. \"We were getting open looks, too, and they weren't going in. It's part of the game.\""}
{"game_id": "0021700673", "chunk_id": "0021700673_017", "order": 17, "role": "body", "text": "Pacers: Three former UCLA players returned to Los Angeles with Indiana, including two rookies making their first appearances as pros: forward TJ Leaf (18th overall draft pick) and C Ike Anigbogu (47th). Both have struggled to earn playing time, while Collison has become a fixture at point guard. ... C Myles Turner missed his sixth consecutive game with a strained right elbow."}
{"game_id": "0021700673", "chunk_id": "0021700673_018", "order": 18, "role": "body", "text": "Lakers: Maybe it's Staples Center. The Lakers played without three regulars in Ball (knee), F Brandon Ingram (ankle) and G Kentavious Caldwell-Pope (strained Achilles). So all five players on the court for the opening tip were not typically starters. Their arena-mates, the Clippers, have been playing down at least three starters for most of the season."}
{"game_id": "0021700673", "chunk_id": "0021700673_020", "order": 20, "role": "body", "text": "Although the rookie point guard is not a big-time scorer, Ball leads the Lakers in assists and defensive rebounds. And until Friday, the Lakers had been winless without him. But against the Pacers, they had 26 assists and moved the ball well. \"Our guys were making the right play all night long,\" Walton said. \"That led to good shots and that led to assists. It's that simple.\""}
{"game_id": "0021700673", "chunk_id": "0021700673_022", "order": 22, "role": "body", "text": "Pacers: Travel to San Antonio, where they've lost their last three, to face the Spurs on Sunday."}
{"game_id": "0021700673", "chunk_id": "0021700673_023", "order": 23, "role": "body", "text": "Lakers: Host the New York Knicks on Sunday afternoon."}
{"game_id": "0021700673", "chunk_id": "0021700673_025", "order": 25, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
