{"game_id": "0021701101", "chunk_id": "0021701101_001", "order": 1, "role": "lead", "text": "HOUSTON --  In a season where Houston is singularly focused on winning its first championship since taking two straight in 1994 and 1995, the Rockets paused for a moment to savor the accomplishment of reaching 60 wins for the first time in franchise history by downing the Atlanta Hawks on Sunday night."}
{"game_id": "0021701101", "chunk_id": "0021701101_002", "order": 2, "role": "body", "text": "\"It's hard and it's a pretty special season to get 60,\" coach Mike D'Antoni said."}
{"game_id": "0021701101", "chunk_id": "0021701101_003", "order": 3, "role": "body", "text": "James Harden had a triple-double with 18 points, 15 assists and 10 rebounds in three quarters and the Rockets beat the Hawks 118-99."}
{"game_id": "0021701101", "chunk_id": "0021701101_004", "order": 4, "role": "body", "text": "\"It's pretty cool to get 60 wins ... it's just a good feeling,\" Harden said. \"That means you're doing something right, the chemistry is there, you're sharing the ball, being unselfish and playing for each other.\""}
{"game_id": "0021701101", "chunk_id": "0021701101_005", "order": 5, "role": "body", "text": "It was the second straight game where the Rockets never trailed after a rout of New Orleans on Saturday night that set a franchise record for wins in a season."}
{"game_id": "0021701101", "chunk_id": "0021701101_006", "order": 6, "role": "body", "text": "The NBA-leading Rockets have won nine straight and became the 18th team in NBA history to reach 60 wins in the 74th game of the season."}
{"game_id": "0021701101", "chunk_id": "0021701101_007", "order": 7, "role": "body", "text": "\"Sixty -- you very rarely see it, only one or two teams a year do it,\" Eric Gordon said. \"So it's a special year. But the crazy part about it is you still have eight games to go.\""}
{"game_id": "0021701101", "chunk_id": "0021701101_008", "order": 8, "role": "body", "text": "Houston was up by 24 at halftime and the Hawks cut into the lead with a solid third quarter, but never really threatened, allowing Harden to watch the final quarter from the bench for the second night in a row."}
{"game_id": "0021701101", "chunk_id": "0021701101_009", "order": 9, "role": "body", "text": "Taurean Prince scored 28 and Isaiah Taylor had 26 for the Hawks, who have lost three in a row and nine of their last 10."}
{"game_id": "0021701101", "chunk_id": "0021701101_010", "order": 10, "role": "body", "text": "\"They test us in every way,\" coach Mike Budenholzer said. \"The good thing is the way we played the second half, I thought we got better.\""}
{"game_id": "0021701101", "chunk_id": "0021701101_011", "order": 11, "role": "body", "text": "Harden, who had 12 assists by halftime, had his fourth triple-double this season and the 35th of his career."}
{"game_id": "0021701101", "chunk_id": "0021701101_012", "order": 12, "role": "body", "text": "Gerald Green had 25 points, and Gordon added 22 for the Rockets with Chris Paul out for the third straight game with a sore left hamstring."}
{"game_id": "0021701101", "chunk_id": "0021701101_013", "order": 13, "role": "body", "text": "Atlanta got within 16 after four straight points by Taylor midway through the fourth, but Green hit a 3-pointer seconds later to push Houston's lead to 108-89."}
{"game_id": "0021701101", "chunk_id": "0021701101_014", "order": 14, "role": "body", "text": "The Rockets led 25 after a 3-pointer by Gordon early in the third quarter when the Hawks went on a 7-2 run to cut the lead to 74-54 with about 8 1/2 minutes left in the period."}
{"game_id": "0021701101", "chunk_id": "0021701101_015", "order": 15, "role": "body", "text": "The Hawks used a 15-6 spurt later in the third to get within 85-71 with about two minutes remaining in the quarter. Prince had five points in that span and capped the run with a 3-pointer."}
{"game_id": "0021701101", "chunk_id": "0021701101_016", "order": 16, "role": "body", "text": "But Houston used a 9-3 run to wrap up the quarter and take a 94-74 lead into the fourth quarter. Harden scored four points in that stretch and found Green for a 3-pointer to cap it."}
{"game_id": "0021701101", "chunk_id": "0021701101_017", "order": 17, "role": "body", "text": "The Rockets raced out to an 11-5 lead early and were up 33-20 at the end of the first quarter."}
{"game_id": "0021701101", "chunk_id": "0021701101_018", "order": 18, "role": "body", "text": "Houston led by 10 early in the second quarter before scoring the next 11 points, with eight from Green, to make it 44-23 eight minutes before halftime."}
{"game_id": "0021701101", "chunk_id": "0021701101_019", "order": 19, "role": "body", "text": "The Rockets didn't let up after that, leading 69-45 at halftime."}
{"game_id": "0021701101", "chunk_id": "0021701101_021", "order": 21, "role": "body", "text": "Hawks: Dennis Schroder missed the game with a sprained right ankle. ... John Collins finished with 10 rebounds. ... DeAndre' Bembry sat out with an abdominal strain."}
{"game_id": "0021701101", "chunk_id": "0021701101_022", "order": 22, "role": "body", "text": "Rockets: Ryan Anderson got a night off to rest. ... Coach Mike D'Antoni said Paul could have played if it were the playoffs and that he should return on Tuesday. ... With 20 3-pointers on Sunday, the Rockets have made 15 or more in five of their last six games."}
{"game_id": "0021701101", "chunk_id": "0021701101_024", "order": 24, "role": "body", "text": "Green had his best game since scoring 29 and 27 points in his first two games after signing with Houston as a free agent in January. The 32-year-old, who has played for eight teams, said he loves playing for his hometown team and feels lucky to be part of the group."}
{"game_id": "0021701101", "chunk_id": "0021701101_025", "order": 25, "role": "body", "text": "\"I'm just really happy to be here,\" he said. \"I think this is what you see when somebody is happy to be at a place and they can play however. Of all the teams I've played with I've never been this happy before.\""}
{"game_id": "0021701101", "chunk_id": "0021701101_027", "order": 27, "role": "body", "text": "Trevor Ariza on Houston maintaining their intensity despite playing non-contending teams the past two games: \"That's the type of thing I think championship teams do.\""}
{"game_id": "0021701101", "chunk_id": "0021701101_029", "order": 29, "role": "body", "text": "Hawks: At Minnesota on Wednesday night."}
{"game_id": "0021701101", "chunk_id": "0021701101_030", "order": 30, "role": "closing", "text": "Rockets: Host Chicago on Tuesday night."}
