{"game_id": "0021400639", "chunk_id": "0021400639_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Evan Turner was confident from the moment the shot left his hands."}
{"game_id": "0021400639", "chunk_id": "0021400639_002", "order": 2, "role": "body", "text": "With just 1.9 seconds left and trailing the Portland Trail Blazers 89-87, Turner launched a shot from about 23 feet out. It fell, giving the Boston Celtics the 90-89 victory on Thursday night."}
{"game_id": "0021400639", "chunk_id": "0021400639_003", "order": 3, "role": "body", "text": "The victory snapped a three-game losing streak for the Celtics, who had four starters in double figures paced by Avery Bradley with 18 points. Jared Sullinger added 17 points and nine rebounds."}
{"game_id": "0021400639", "chunk_id": "0021400639_004", "order": 4, "role": "body", "text": "\"I was able to shoot it high enough so it felt good,\" Turner said of the game-winner. \"I kind of prayed to make a big shot and it happened.\""}
{"game_id": "0021400639", "chunk_id": "0021400639_005", "order": 5, "role": "body", "text": "Boston's victory also snapped a four-game losing streak to the Blazers."}
{"game_id": "0021400639", "chunk_id": "0021400639_006", "order": 6, "role": "body", "text": "Damian Lillard had 21 points and seven assists to lead Portland, which has lost five of their last six as the team struggles with injuries to their front line. Already without center Robin Lopez and forward LaMarcus Aldridge, fellow starting forward Nicolas Batum left the game with a wrist injury that has been nagging him."}
{"game_id": "0021400639", "chunk_id": "0021400639_007", "order": 7, "role": "body", "text": "\"Everybody knows what Nic can bring and what LA brings, so we have to figure out diffident ways of scoring and sometimes different ways of playing,\" said Blazers coach Terry Stotts. \"The differences are fairly obvious.\""}
{"game_id": "0021400639", "chunk_id": "0021400639_008", "order": 8, "role": "body", "text": "Lillard's 3-pointer put Portland up 87-81 with 4:44 left, but the Celtics answered, pulling within 87-85 on Bradley's pull-up jumper before Sullinger's put-back layup tied it."}
{"game_id": "0021400639", "chunk_id": "0021400639_009", "order": 9, "role": "body", "text": "Wesley Matthews missed one of two free throws to give the Blazers the edge, and a turnover gave Portland the ball on the other end. But the Blazers struggled to score and settled for Thomas Robinson's free throw to lead 89-87 with 26.6 seconds left."}
{"game_id": "0021400639", "chunk_id": "0021400639_010", "order": 10, "role": "body", "text": "Scrambling on the floor, Sullinger flipped the ball to Turner for the go-ahead 3-pointer, and Lillard couldn't get a shot off before the buzzer."}
{"game_id": "0021400639", "chunk_id": "0021400639_011", "order": 11, "role": "body", "text": "Turner said he loves taking those critical shots."}
{"game_id": "0021400639", "chunk_id": "0021400639_012", "order": 12, "role": "body", "text": "\"Oh yeah, for sure,\" he said. \"I like them even more when they go in. I've missed a couple this year, but I'm glad this one went in and most importantly I'm glad we won.\""}
{"game_id": "0021400639", "chunk_id": "0021400639_013", "order": 13, "role": "body", "text": "The Blazers were hit before the game with the news that Aldridge had torn a ligament in his left thumb and would need surgery. The 6-foot-11 power forward is expected to miss from six to eight weeks."}
{"game_id": "0021400639", "chunk_id": "0021400639_014", "order": 14, "role": "body", "text": "Aldridge was injured in Monday's 98-94 victory over the Sacramento Kings. He leads Portland with averages of 23.5 points, 10.4 rebounds and 1.18 blocks per game."}
{"game_id": "0021400639", "chunk_id": "0021400639_015", "order": 15, "role": "body", "text": "\"It's tough,\" Aldridge told reporters in Portland's locker room before the game. \"I definitely didn't want to have anything like this going on right now.\""}
{"game_id": "0021400639", "chunk_id": "0021400639_016", "order": 16, "role": "body", "text": "The injury is blow to the Blazers, who were already without Lopez because of a fractured right hand and center Joel Freeland with a right shoulder strain."}
{"game_id": "0021400639", "chunk_id": "0021400639_017", "order": 17, "role": "body", "text": "The Celtics shook up their lineup, starting Brandon Bass instead of Tyler Zeller. Coach Brad Stevens said before the game he wanted to see Bass and Sullinger play together."}
{"game_id": "0021400639", "chunk_id": "0021400639_018", "order": 18, "role": "body", "text": "\"We're not accomplished enough to say we have to have on starting lineup right now,\" Stevens said pregame."}
{"game_id": "0021400639", "chunk_id": "0021400639_019", "order": 19, "role": "body", "text": "Matthews said of the loss, \"We blew it. We had possessions, we had chances, we had opportunities.\""}
{"game_id": "0021400639", "chunk_id": "0021400639_021", "order": 21, "role": "body", "text": "Celtics: It was the second game of a six-game road trip. ... Boston has won just five games on the road this season. .... It was just the third time in 23 tries that Boston had come back when trailing after three quarters."}
{"game_id": "0021400639", "chunk_id": "0021400639_022", "order": 22, "role": "body", "text": "Trail Blazers: Lopez has switched from a hard cast to a brace. His return is unclear, although general manager Neil Olshey, speaking on Sirius XM Radio, said the team hopes to have the 7-foot center back by the All-Star break. ... The Blazers were coming off a 118-113 loss to the Suns in Phoenix on Wednesday night. Portland falls to 8-3 on second games of back-to-backs."}
{"game_id": "0021400639", "chunk_id": "0021400639_023", "order": 23, "role": "body", "text": "SULLINGER'S SAVE: Stevens praised Sullinger for his mad scramble for the ball that he got to Turner for the winning shot."}
{"game_id": "0021400639", "chunk_id": "0021400639_024", "order": 24, "role": "body", "text": "\"He made a really heads-up play. He dove on the floor,\" Stevens said."}
{"game_id": "0021400639", "chunk_id": "0021400639_026", "order": 26, "role": "body", "text": "The Celtics visit the Denver Nuggets on Friday night."}
{"game_id": "0021400639", "chunk_id": "0021400639_027", "order": 27, "role": "closing", "text": "The Trail Blazers host the Washington Wizards on Saturday night."}
