{"game_id": "0021400600", "chunk_id": "0021400600_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Lance Stephenson was back at his trash-talking best -- this time against his old team."}
{"game_id": "0021400600", "chunk_id": "0021400600_002", "order": 2, "role": "body", "text": "Stephenson jawed most of the game with former teammate Roy Hibbert and even intentionally knocked the 7-foot-2, 275-pound center to the floor as the two were running up the court."}
{"game_id": "0021400600", "chunk_id": "0021400600_003", "order": 3, "role": "body", "text": "Both later downplayed the shove."}
{"game_id": "0021400600", "chunk_id": "0021400600_004", "order": 4, "role": "body", "text": "In the end, Stephenson got the best of his former teammates, as the Charlotte Hornets defeated the Indiana Pacers 80-71 in overtime on Saturday night. Gerald Henderson had 20 points to lead the Hornets while Stephenson, in his second game since returning from a pelvic sprain, added 13 off the bench."}
{"game_id": "0021400600", "chunk_id": "0021400600_005", "order": 5, "role": "body", "text": "The shove came with two minutes remaining in the third quarter after Hibbert blocked Stephenson on a drive to the hole. After Stephenson argued for a foul that wasn't called, he body-checked Hibbert to the floor."}
{"game_id": "0021400600", "chunk_id": "0021400600_006", "order": 6, "role": "body", "text": "Officials had already retreated to the opposite end and didn't see what happened. No foul was called."}
{"game_id": "0021400600", "chunk_id": "0021400600_007", "order": 7, "role": "body", "text": "\"I didn't hit (Hibbert) that hard,\" Stephenson said with a laugh. \"He flopped. You know I can't knock down big Roy, c'mon now.\""}
{"game_id": "0021400600", "chunk_id": "0021400600_008", "order": 8, "role": "body", "text": "Hibbert joked after the game that it appears Stephenson has been lifting a lot of weights."}
{"game_id": "0021400600", "chunk_id": "0021400600_009", "order": 9, "role": "body", "text": "\"He got a lot stronger,\" Hibbert said."}
{"game_id": "0021400600", "chunk_id": "0021400600_010", "order": 10, "role": "body", "text": "He said there are no hard feelings and that he and Stephenson used to jaw at each other all of the time in practice. Stephenson spent four years in Indiana before signing with the Hornets this past offseason."}
{"game_id": "0021400600", "chunk_id": "0021400600_011", "order": 11, "role": "body", "text": "\"It wasn't anything malicious or anything,\" Hibbert said. \"He's a good friend. Please don't blow it up. Seriously, it's nothing.\""}
{"game_id": "0021400600", "chunk_id": "0021400600_012", "order": 12, "role": "body", "text": "Other than the shove, the game itself was fairly forgettable -- and at times tough to watch."}
{"game_id": "0021400600", "chunk_id": "0021400600_013", "order": 13, "role": "body", "text": "The combined 151 points were the fewest in an overtime game in the shot-clock era, according to STATS. The Hornets won shooting 30.7 percent and the Pacers had 20 turnovers."}
{"game_id": "0021400600", "chunk_id": "0021400600_014", "order": 14, "role": "body", "text": "\"That obviously won't be on ESPN Classic,\" Hornets coach Steve Clifford said."}
{"game_id": "0021400600", "chunk_id": "0021400600_015", "order": 15, "role": "body", "text": "Still, it was a big win for the Hornets, who are battling for a playoff spot in the Eastern Conference despite a 16-25 record."}
{"game_id": "0021400600", "chunk_id": "0021400600_016", "order": 16, "role": "body", "text": "Charlotte also showed it could win despite playing without its top two scorers in Al Jefferson and Kemba Walker."}
{"game_id": "0021400600", "chunk_id": "0021400600_017", "order": 17, "role": "body", "text": "The Hornets clearly missed Walker running the point."}
{"game_id": "0021400600", "chunk_id": "0021400600_018", "order": 18, "role": "body", "text": "He was red hot before being sidelined with a cyst in his left knee, averaging 29.8 points per game over the last six. Charlotte struggled getting into its offensive sets and looked out of sync under the direction of point guard Brian Roberts."}
{"game_id": "0021400600", "chunk_id": "0021400600_019", "order": 19, "role": "body", "text": "Charlotte has won six of its last seven games despite also being without Jefferson, who has missed eight games because of a groin injury and is still a couple of weeks away from returning."}
{"game_id": "0021400600", "chunk_id": "0021400600_020", "order": 20, "role": "body", "text": "David West had 19 points for the Pacers, who were 1 of 9 from the field in overtime."}
{"game_id": "0021400600", "chunk_id": "0021400600_021", "order": 21, "role": "body", "text": "Henderson missed a 20-footer at the end of regulation that would have won the game."}
{"game_id": "0021400600", "chunk_id": "0021400600_022", "order": 22, "role": "body", "text": "But it was all Hornets in overtime, as they outscored the Pacers 12-3 and held them scoreless for more than four minutes."}
{"game_id": "0021400600", "chunk_id": "0021400600_023", "order": 23, "role": "body", "text": "Clifford took Stephenson out of the game with 6:34 left in regulation and the Hornets trailing 61-55 -- even though he was leading the team in scoring at the time with 13."}
{"game_id": "0021400600", "chunk_id": "0021400600_024", "order": 24, "role": "body", "text": "With Stephenson on one knee beside the bench urging his team on, the Hornets stormed back to the take the lead 68-66 when Williams buried a 3-pointer from the top of the key with 51 seconds left in regulation."}
{"game_id": "0021400600", "chunk_id": "0021400600_025", "order": 25, "role": "body", "text": "\"I definitely wanted to win because we lost at their house earlier this year,\" Stephenson said."}
{"game_id": "0021400600", "chunk_id": "0021400600_026", "order": 26, "role": "body", "text": "He has been the subject of repeated trade rumors in recent weeks."}
{"game_id": "0021400600", "chunk_id": "0021400600_027", "order": 27, "role": "body", "text": "\"I have tried to keep a level head and don't worry about that and just play hard,\" Stephenson said."}
{"game_id": "0021400600", "chunk_id": "0021400600_029", "order": 29, "role": "body", "text": "Pacers: Hibbert had 12 points and 14 rebounds for the 100th double-double of his career."}
{"game_id": "0021400600", "chunk_id": "0021400600_030", "order": 30, "role": "body", "text": "Hornets: Michael Kidd-Gilchrist had 16 rebounds for Charlotte and Bismack Biyombo had 14."}
{"game_id": "0021400600", "chunk_id": "0021400600_032", "order": 32, "role": "body", "text": "Clifford said Walker's knee injury is something that could linger. \"It is one of those things (where) it's the ultimate day-to-day,\" Clifford said. \"It's something that he'd had for a while. From what I understand, he can come in (Sunday) and be fine or it could be longer. I don't think there is any real way to determine that.\""}
{"game_id": "0021400600", "chunk_id": "0021400600_034", "order": 34, "role": "body", "text": "Pacers: Visit Houston on Monday."}
{"game_id": "0021400600", "chunk_id": "0021400600_035", "order": 35, "role": "closing", "text": "Hornets: Host Minnesota on Monday."}
