{"game_id": "0021700095", "chunk_id": "0021700095_001", "order": 1, "role": "lead", "text": "HOUSTON --  The Houston Rockets allowed Philadelphia 76ers point guard Ben Simmons to take jump shots on Monday night and he made them pay."}
{"game_id": "0021700095", "chunk_id": "0021700095_002", "order": 2, "role": "body", "text": "In Philadelphia's 115-107 win in Houston, Simmons made 10 of 15 shots, many of them from mid-range, to score a career-high 24 points, adding nine assists and seven rebounds. When asked why he took more jumpers than he had in his first six games, Simmons' teammate Amir Johnson answered from behind the group of reporters."}
{"game_id": "0021700095", "chunk_id": "0021700095_003", "order": 3, "role": "body", "text": "\"People don't know he can shoot,\" Johnson said. \"Buckets.\""}
{"game_id": "0021700095", "chunk_id": "0021700095_004", "order": 4, "role": "body", "text": "Philadelphia head coach Brett Brown said Simmons' ability to reliably make jump shots will complement his ability to drive or use his length in the paint even more effective."}
{"game_id": "0021700095", "chunk_id": "0021700095_005", "order": 5, "role": "body", "text": "\"I'm really leaving the whole evolution of his jump shot -- when he wants to shoot it, when he feels comfortable shooting it -- with him,\" Brown said. \"When he feels the confidence to shoot things and people sag off of him, he's going to shoot it. If he doesn't, so be it, he'll go find another way to impact the game. It's coming.\""}
{"game_id": "0021700095", "chunk_id": "0021700095_006", "order": 6, "role": "body", "text": "Simmons, the 2016 first-overall pick, is shooting 51 percent through his first seven games but has struggled at times outside of the paint and has missed all four 3-point attempts."}
{"game_id": "0021700095", "chunk_id": "0021700095_007", "order": 7, "role": "body", "text": "\"I'm comfortable taking them,\" Simmons said of jump shots. \"I've got to start doing that more often.\""}
{"game_id": "0021700095", "chunk_id": "0021700095_008", "order": 8, "role": "body", "text": "After losing 105-104 on a buzzer-beating 3-pointer from Eric Gordon in Philadelphia on Oct. 18, the 76ers snapped an eight-game losing streak against the Rockets, winning in Houston for the first time since Feb. 16, 2011."}
{"game_id": "0021700095", "chunk_id": "0021700095_009", "order": 9, "role": "body", "text": "The Rockets missed nine of their last 10 shots, scoring just four points in the final 3:28 and dropped consecutive games for the first time this season."}
{"game_id": "0021700095", "chunk_id": "0021700095_010", "order": 10, "role": "body", "text": "Brown credited his team's defense, particularly on the perimeter, down the stretch for getting late stops against Houston."}
{"game_id": "0021700095", "chunk_id": "0021700095_011", "order": 11, "role": "body", "text": "\"That's what won us the game,\" Brown said. \"Because if you blink or you're a step short on a switch, you get punished badly with this team because of their ability to shoot and to shoot 3s.\""}
{"game_id": "0021700095", "chunk_id": "0021700095_012", "order": 12, "role": "body", "text": "James Harden scored 29 points and Gordon had 25. The Rockets shot just 39.8 percent from the floor. Last season, they were 1-7 when shooting below 40 percent."}
{"game_id": "0021700095", "chunk_id": "0021700095_013", "order": 13, "role": "body", "text": "\"I would never put a lot of stock into that,\" Rockets head coach Mike D'Antoni said of the poor shooting. \"They make them, they don't make them, whatever. The defense, the ball movement and running the floor is going to be constant, and that requires an effort that I don't think we're there yet.\""}
{"game_id": "0021700095", "chunk_id": "0021700095_014", "order": 14, "role": "body", "text": "Harden called the team's energy \"terrible, terrible,\" and said the defense allowed too many easy points in the first and third quarters."}
{"game_id": "0021700095", "chunk_id": "0021700095_015", "order": 15, "role": "body", "text": "\"We can't have those mental lapses on the defensive end, they get momentum,\" Harden said. \"They start making shots they probably normally don't make.\""}
{"game_id": "0021700095", "chunk_id": "0021700095_016", "order": 16, "role": "body", "text": "The 76ers led 58-56 at halftime."}
{"game_id": "0021700095", "chunk_id": "0021700095_018", "order": 18, "role": "body", "text": "76ers: SG JJ Redick missed his third straight game with lower back tightness. ... PG Markelle Fultz (shoulder) missed his fourth straight game. Fultz is out indefinitely and will be reevaluated in three weeks, the 76ers said Sunday."}
{"game_id": "0021700095", "chunk_id": "0021700095_019", "order": 19, "role": "body", "text": "Rockets: Nene entered the game questionable with left Achilles soreness but played 10 minutes in the game, getting seven points, three rebounds and a block off the bench. ...  After shooting 17-for-35 (48.5 percent) in a three-game road trip, PF Ryan Anderson shot 2-for-9 from beyond the arc."}
{"game_id": "0021700095", "chunk_id": "0021700095_021", "order": 21, "role": "body", "text": "The 76ers arrived in Houston a day early on Sunday to attend Game 5 of the MLB World Series at Minute Maid Park in downtown Houston, blocks away from the Toyota Center. The players represented both the Dodgers and Astros with a mix of customized jerseys with their names and numbers on the back."}
{"game_id": "0021700095", "chunk_id": "0021700095_023", "order": 23, "role": "body", "text": "Houston-native rapper Slim Thug was the celebrity guest shooter for Houston's new \"First Shot,\" promotion. The 6-foot-6 rapper swished his free throw before tipoff, ensuring a $5,000 donation from the Rockets to charity. His shot followed banked shots off the glass from both Texans WR DeAndre Hopkins and Blue October lead singer Justin Furstenfeld in the first two games."}
{"game_id": "0021700095", "chunk_id": "0021700095_025", "order": 25, "role": "body", "text": "Joel Embiid had 22 points, nine rebounds and five assists with two steals in 25 minutes. Dating back to 1983-84, it is just the third time a player has posted those numbers in 25 minutes of play or less. Pau Gasol did it in 2015 for Chicago and Fat Lever did it in 1990 for Denver."}
{"game_id": "0021700095", "chunk_id": "0021700095_027", "order": 27, "role": "body", "text": "76ers: Host the Hawks on Wednesday night."}
{"game_id": "0021700095", "chunk_id": "0021700095_028", "order": 28, "role": "closing", "text": "Rockets: Visit the Knicks on Wednesday night."}
