{"game_id": "0021401143", "chunk_id": "0021401143_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  After watching his team claw its way to a fourth-quarter lead, a fired-up Orlando Magic coach James Borrego got hit with the first technical foul of his career."}
{"game_id": "0021401143", "chunk_id": "0021401143_002", "order": 2, "role": "body", "text": "\"I was just inspired by the way they were playing. How hard, the intensity. It got me fired up out there,\" Borrego said. \"I'm just proud to be part of a group like this that's fighting and staying together. I just wanted to be right in the mix with them.\""}
{"game_id": "0021401143", "chunk_id": "0021401143_003", "order": 3, "role": "body", "text": "Tobias Harris had 23 points and 10 rebounds, Nikola Vucevic scored 20 points, and the Magic beat the Milwaukee Bucks 97-90 Saturday night."}
{"game_id": "0021401143", "chunk_id": "0021401143_004", "order": 4, "role": "body", "text": "Borrego's passion got his players' attention as Orlando got its second road win in two nights after losing 12 straight away from home."}
{"game_id": "0021401143", "chunk_id": "0021401143_005", "order": 5, "role": "body", "text": "\"That's a good guy. He's all we got right now and we're fighting for him,\" Aaron Gordon said."}
{"game_id": "0021401143", "chunk_id": "0021401143_006", "order": 6, "role": "body", "text": "Harris credits Borrego for showing a lot of fire for the team since taking over as  coach after Jacque Vaughn was fired in February."}
{"game_id": "0021401143", "chunk_id": "0021401143_007", "order": 7, "role": "body", "text": "\"He wants us to win as much as we want to win,\" Harris said. \"He got a tech and that fired us up and we just kept bringing it down the stretch of the fourth quarter.\""}
{"game_id": "0021401143", "chunk_id": "0021401143_008", "order": 8, "role": "body", "text": "Victor Oladipo added 15 points and Harris made a career-best five 3-pointers on nine attempts."}
{"game_id": "0021401143", "chunk_id": "0021401143_009", "order": 9, "role": "body", "text": "\"I thought we left Tobias open a lot,\" the Bucks' Jared Dudley said."}
{"game_id": "0021401143", "chunk_id": "0021401143_010", "order": 10, "role": "body", "text": "Harris' repeated open looks irked Milwaukee coach Jason Kidd."}
{"game_id": "0021401143", "chunk_id": "0021401143_011", "order": 11, "role": "body", "text": "\"When you leave guys wide open in the corner in this league, they can knock them down,\" Kidd said."}
{"game_id": "0021401143", "chunk_id": "0021401143_012", "order": 12, "role": "body", "text": "Ersan Ilyasova scored 18 points and Khris Middleton added 15 for Milwaukee. Point guard Michael Carter-Williams had 10 rebounds and nine assists."}
{"game_id": "0021401143", "chunk_id": "0021401143_013", "order": 13, "role": "body", "text": "Milwaukee led 73-72 heading to the fourth. The lead changed hands on five consecutive possession midway through the quarter, before the Magic grabbed a 94-90 lead with less than 2 minutes left on back-to-back 3-pointers by Harris and Oladipo. A falling-down jumper by Oladipo extended the lead to six, and he added a free throw for the final margin."}
{"game_id": "0021401143", "chunk_id": "0021401143_014", "order": 14, "role": "body", "text": "\"In the fourth quarter, I felt we were more physical and we kept them off the glass. We were locked in defensively,\" Harris said."}
{"game_id": "0021401143", "chunk_id": "0021401143_015", "order": 15, "role": "body", "text": "The Bucks jumped out to an early 12 point lead and led 31-22 after the first quarter. Ilyasova had 11 points in the opening period. Milwaukee made all four of its 3-pointers in the quarter."}
{"game_id": "0021401143", "chunk_id": "0021401143_016", "order": 16, "role": "body", "text": "Harris scored 11 second-quarter points to spark an Orlando rally, although Milwaukee held a 53-51 advantage at the half."}
{"game_id": "0021401143", "chunk_id": "0021401143_017", "order": 17, "role": "body", "text": "The Bucks extended the lead by an additional point before the second-half tip when Khris Middleton made a technical foul shot. Orlando's Elfrid Payton was whistled for the technical as the teams left the court at halftime."}
{"game_id": "0021401143", "chunk_id": "0021401143_018", "order": 18, "role": "body", "text": "Two of Milwaukee's top offensive threats struggled in the first half. Giannis Antetokounmpo missed his first six shots from the field. Carter-Williams missed all eight of his first-half shots."}
{"game_id": "0021401143", "chunk_id": "0021401143_021", "order": 21, "role": "body", "text": "Magic: Borrego said the foot injury suffered by Gordon, which required surgery and forced him to miss 32 games earlier this season, interrupted the rookie's development. \"He had to take a step back and observe from the sideline. But through that adversity you grow and learn,\" Borrego said. \"He's a little bit more patient right now.\""}
{"game_id": "0021401143", "chunk_id": "0021401143_022", "order": 22, "role": "body", "text": "Bucks: Antetokounmpo suffered a nasal contusion less than three minutes into the game but returned late in the first quarter. ... Dudley, who has been battling back issues, played 21 minutes after logging 23 minutes at Boston on Friday night."}
{"game_id": "0021401143", "chunk_id": "0021401143_024", "order": 24, "role": "body", "text": "Kidd has no intention of shortening the Bucks' rotation as the team heads toward a likely playoff berth. \"Everybody has played this season and everybody will continue to play,\" he said."}
{"game_id": "0021401143", "chunk_id": "0021401143_026", "order": 26, "role": "body", "text": "Magic: Host Chicago on Wednesday."}
{"game_id": "0021401143", "chunk_id": "0021401143_027", "order": 27, "role": "closing", "text": "Bucks: Host Cleveland on Wednesday."}
