{"game_id": "0021700302", "chunk_id": "0021700302_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Giannis Antetokounmpo wasn't the least bit surprised that Milwaukee's most lopsided win of the season coincided with one of the Bucks' best defensive games."}
{"game_id": "0021700302", "chunk_id": "0021700302_002", "order": 2, "role": "body", "text": "The NBA's most improved player last year also issued a warning of sorts to his teammates."}
{"game_id": "0021700302", "chunk_id": "0021700302_003", "order": 3, "role": "body", "text": "\"We can't hide now,\" Antetokounmpo said after scoring 19 of his 32 points in the third quarter of Millwaukee's 112-87 win over the Sacramento Kings on Tuesday night. \"We did it today, we played really hard defensively so we have to keep doing that. No excuses as a team.\""}
{"game_id": "0021700302", "chunk_id": "0021700302_004", "order": 4, "role": "body", "text": "The Bucks have been erratic at times on both ends of the court this season and had dropped three of four before jumping on the Kings early."}
{"game_id": "0021700302", "chunk_id": "0021700302_005", "order": 5, "role": "body", "text": "Milwaukee coach Jason Kidd credited his team's defense but also praised the offense. The Bucks shot 59 percent with 26 assists."}
{"game_id": "0021700302", "chunk_id": "0021700302_006", "order": 6, "role": "body", "text": "\"There was nothing that was forced,\" Kidd said. \"The ball moved, we didn't hold it, we didn't back down, we didn't dribble 10 times to take a shot. Our guys trusted one another.\""}
{"game_id": "0021700302", "chunk_id": "0021700302_007", "order": 7, "role": "body", "text": "Eric Bledsoe had 21 points, five assists and five rebounds for the Bucks, who won for the second time in five games. Khris Middleton scored 12 points."}
{"game_id": "0021700302", "chunk_id": "0021700302_008", "order": 8, "role": "body", "text": "Milwaukee led by as many as 36 and won despite not scoring a second-chance point."}
{"game_id": "0021700302", "chunk_id": "0021700302_009", "order": 9, "role": "body", "text": "Antetokounmpo scored 11 points in the first quarter, but was at his best coming out of halftime. He went 6 for 8 from the field in the third, including a rare 3-pointer."}
{"game_id": "0021700302", "chunk_id": "0021700302_010", "order": 10, "role": "body", "text": "It was Antetokounmpo's eighth 30-point game this season."}
{"game_id": "0021700302", "chunk_id": "0021700302_011", "order": 11, "role": "body", "text": "\"When the ball moves everybody's got energy,\" Antetokounmpo said. \"Whenever we move the ball like that as a team it's easy to find one another. It looks good and that's what we have to keep doing.\""}
{"game_id": "0021700302", "chunk_id": "0021700302_012", "order": 12, "role": "body", "text": "Milwaukee has won three straight against Sacramento."}
{"game_id": "0021700302", "chunk_id": "0021700302_013", "order": 13, "role": "body", "text": "The Bucks were crisp early, but they didn't pull away until a 20-3 run midway through the second quarter. Bledsoe scored 11 during the run, and Middleton made two free throws to put Milwaukee up 61-34 at halftime."}
{"game_id": "0021700302", "chunk_id": "0021700302_014", "order": 14, "role": "body", "text": "Garrett Temple scored 18 for the Kings, and Buddy Hield added 13 points. Willie Cauley-Stein had 10 points and 10 rebounds."}
{"game_id": "0021700302", "chunk_id": "0021700302_015", "order": 15, "role": "body", "text": "Sacramento came out flat and never recovered, one day after rallying in the fourth quarter to beat the short-handed Golden State Warriors."}
{"game_id": "0021700302", "chunk_id": "0021700302_016", "order": 16, "role": "body", "text": "Even after Jason Kidd emptied his bench in the fourth quarter, Sacramento struggled to get the lead under 30."}
{"game_id": "0021700302", "chunk_id": "0021700302_017", "order": 17, "role": "body", "text": "The Kings committed 11 turnovers in the first half and repeatedly allowed Antetokounmpo to get into the paint for easy buckets."}
{"game_id": "0021700302", "chunk_id": "0021700302_018", "order": 18, "role": "body", "text": "\"That was not a game,\" Sacramento coach Dave Joerger said. \"We struggled right from the jump. They are extremely athletic and they gave us problems with their length, and they made shots tonight.\""}
{"game_id": "0021700302", "chunk_id": "0021700302_019", "order": 19, "role": "body", "text": "Jason Terry, who spent a few brief moments with the Kings in 2014 before being traded to Houston, was booed every time he touched the ball. He made a 3-pointer that put the Bucks up 92-56."}
{"game_id": "0021700302", "chunk_id": "0021700302_021", "order": 21, "role": "body", "text": "Bucks: Middleton was a game-time decision because of illness. ... Antetokounmpo `s 3-pointer was only his second make from beyond the arc in the past nine games. ... John Henson was charged with a technical foul after hanging onto the rim following a dunk in the first quarter."}
{"game_id": "0021700302", "chunk_id": "0021700302_022", "order": 22, "role": "body", "text": "Kings: Sacramento missed seven of its first 12 free-throw attempts. ... The Kings are 0-4 on the second night of back-to-backs. ... Rookie De'Aaron Fox shot 2 of 10 and missed all three of his 3-point attempts."}
{"game_id": "0021700302", "chunk_id": "0021700302_024", "order": 24, "role": "body", "text": "The Bucks most lopsided win since beating Washington 123-96 on Dec. 23, 2016 allowed Kidd to get most of his starters plenty of rest. Tony Snell logged 29 minutes while Antetokounmpo played 26 and Middleton played 23. \"It's always good to see Giannis not at 38 and Khris at 40 or even Tony at 40,\" Kidd said. \"The guys were really professional, took care of business.\""}
{"game_id": "0021700302", "chunk_id": "0021700302_026", "order": 26, "role": "body", "text": "While Milwaukee was celebrating its defensive effort, Sacramento was grumbling about its defense which allowed the Bucks multiple uncontested shots. \"We didn't do the things we needed to do to make it a close game,\" Kings guard Frank Mason said. \"They got anywhere they wanted on the court, a lot of easy lay-ups, uncontested shots, things like that.\""}
{"game_id": "0021700302", "chunk_id": "0021700302_028", "order": 28, "role": "body", "text": "Bucks: Play at Portland on Thursday."}
{"game_id": "0021700302", "chunk_id": "0021700302_029", "order": 29, "role": "closing", "text": "Kings: Begin a four-game road trip against Chicago on Friday."}
