{"game_id": "0021300037", "chunk_id": "0021300037_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Rudy Gay finally put the Toronto Raptors on sure footing against the Milwaukee Bucks."}
{"game_id": "0021300037", "chunk_id": "0021300037_002", "order": 2, "role": "body", "text": "Gay had 18 points and 15 rebounds, and DeMar DeRozan added 17 points and a few key baskets down the stretch to spoil Milwaukee's home opener, 97-90 on Saturday night."}
{"game_id": "0021300037", "chunk_id": "0021300037_003", "order": 3, "role": "body", "text": "\"With Rudy rebounding the way he did, his length, his athleticism -- he did an excellent job with that tonight,\" Raptors coach Dwane Casey said."}
{"game_id": "0021300037", "chunk_id": "0021300037_004", "order": 4, "role": "body", "text": "Gay had another poor game from the field, going 4 of 14 to follow an ugly 6-of-23 performance Friday night in a loss to Atlanta."}
{"game_id": "0021300037", "chunk_id": "0021300037_005", "order": 5, "role": "body", "text": "He found other ways to contribute, like hitting 8 of 10 from the free throw line and having his big game on the glass."}
{"game_id": "0021300037", "chunk_id": "0021300037_006", "order": 6, "role": "body", "text": "\"I'm just trying not to be one-dimensional,\" Gay said. \"I still wanted to make an effort on defense and the glass ... just make myself be part of the game.\""}
{"game_id": "0021300037", "chunk_id": "0021300037_007", "order": 7, "role": "body", "text": "Toronto snapped a 10-game losing streak to the Bucks, which was the longest winning streak Milwaukee held over any opponent. Toronto's last win was 91-87 on Nov. 1, 2008."}
{"game_id": "0021300037", "chunk_id": "0021300037_008", "order": 8, "role": "body", "text": "The teams reunited just over a week after an exhibition game between the teams was called off in the first quarter because of slick court conditions."}
{"game_id": "0021300037", "chunk_id": "0021300037_009", "order": 9, "role": "body", "text": "The Raptors nearly let this win slip away after leading by 12 points to start the fourth quarter."}
{"game_id": "0021300037", "chunk_id": "0021300037_010", "order": 10, "role": "body", "text": "O.J. Mayo had 16 points off the bench for the Bucks, including a 3-pointer that tied the game at 85 with 5:53 left."}
{"game_id": "0021300037", "chunk_id": "0021300037_011", "order": 11, "role": "body", "text": "They just couldn't convert on late opportunities, however, including a stretch of 1-of-6 shooting from the free throw line in a 4-minute stretch after tying the game. They also missed two 3s in that span."}
{"game_id": "0021300037", "chunk_id": "0021300037_012", "order": 12, "role": "body", "text": "\"I really felt if we just hung around hopefully we could probably try to steal it, but we just didn't make the plays down the stretch,\" coach Larry Drew said."}
{"game_id": "0021300037", "chunk_id": "0021300037_013", "order": 13, "role": "body", "text": "But the Raptors did, including a step-back jumper by DeRozan to make it 89-85 with 4 minutes left."}
{"game_id": "0021300037", "chunk_id": "0021300037_014", "order": 14, "role": "body", "text": "Then after missing two free throws, DeRozan was fouled again after corralling the rebound, making both this time with 2:09 left for a five-point lead."}
{"game_id": "0021300037", "chunk_id": "0021300037_015", "order": 15, "role": "body", "text": "The Raptors controlled the paint early and outrebounded the Bucks 60-38, and 18-6 on the offensive end. They had a 21-4 edge in second-chance points."}
{"game_id": "0021300037", "chunk_id": "0021300037_016", "order": 16, "role": "body", "text": "And time and time again, Toronto made it a point to drive the lane and get good ball movement."}
{"game_id": "0021300037", "chunk_id": "0021300037_017", "order": 17, "role": "body", "text": "\"Everybody made a concerted effort to try to get the ball from side-to-side and get everybody involved early,\" said guard Kyle Lowry, who finished with 14 points."}
{"game_id": "0021300037", "chunk_id": "0021300037_018", "order": 18, "role": "body", "text": "After the ball whipped around the perimeter, DeRozan hit an open 3 from the corner to help build a 77-65 to start the fourth."}
{"game_id": "0021300037", "chunk_id": "0021300037_019", "order": 19, "role": "body", "text": "But that deficit is nothing for the Bucks, who fell behind by 20 points in each of their first two games on the road, including a rousing 105-98 win earlier in the week in Boston."}
{"game_id": "0021300037", "chunk_id": "0021300037_020", "order": 20, "role": "body", "text": "True to early season form, Milwaukee stormed back behind frontcourt reserves John Henson (13 points) and Khris Middleton (six), and a 3 from Mayo that tied it at 85 with 5:53 to go."}
{"game_id": "0021300037", "chunk_id": "0021300037_021", "order": 21, "role": "body", "text": "The buckets stopped falling from there and the defense trailed off."}
{"game_id": "0021300037", "chunk_id": "0021300037_022", "order": 22, "role": "body", "text": "\"Tonight, I thought defensively we weren't tied into together that last four minutes,\" said Mayo, who said he didn't start after arriving late for practice, and apologized for his tardiness."}
{"game_id": "0021300037", "chunk_id": "0021300037_023", "order": 23, "role": "body", "text": "Caron Butler, a Wisconsin native playing his first home game since being traded to Milwaukee in the offseason, added 12 points and six rebounds."}
{"game_id": "0021300037", "chunk_id": "0021300037_024", "order": 24, "role": "body", "text": "The game featured all the typical theatrics of a home opener, with a pulsing bass rattling the arena stands and the Bucks walking individually out of the tunnel with the lights dimmed. The team introduced its new coach and 11 new players."}
{"game_id": "0021300037", "chunk_id": "0021300037_025", "order": 25, "role": "body", "text": "But all that fun was spoiled by the Raptors."}
{"game_id": "0021300037", "chunk_id": "0021300037_026", "order": 26, "role": "body", "text": "Nate Wolters, a second-round draft pick, made his first career start at the point because of a hamstring injury to Brandon Knight. He finished with seven points and 10 assists."}
{"game_id": "0021300037", "chunk_id": "0021300037_027", "order": 27, "role": "body", "text": "Game notes Besides Knight, the Bucks were also without PG Luke Ridnour (back spasms). ... Raptors G Steve Novak missed his homecoming with a sore back. The seventh-year sharpshooter from the Milwaukee suburb of Brown Deer went to Marquette. He was a freshman on the 2003 team that went to the Final Four."}
{"game_id": "0021300037", "chunk_id": "0021300037_029", "order": 29, "role": "closing", "text": "Follow Genaro Armas at http://twitter.com/GArmasAP"}
