{"game_id": "0021700755", "chunk_id": "0021700755_001", "order": 1, "role": "lead", "text": "ATLANTA --  Dwight Howard's strong start helped Charlotte build a lead."}
{"game_id": "0021700755", "chunk_id": "0021700755_002", "order": 2, "role": "body", "text": "Kemba Walker's historic shooting kept the Hornets ahead."}
{"game_id": "0021700755", "chunk_id": "0021700755_003", "order": 3, "role": "body", "text": "Walker set franchise and career highs with nine 3-pointers and scored 38 points, Howard added 20 points, and Charlotte dominated the Atlanta Hawks 123-110 on Wednesday night."}
{"game_id": "0021700755", "chunk_id": "0021700755_004", "order": 4, "role": "body", "text": "Walker had 18 points in the third quarter."}
{"game_id": "0021700755", "chunk_id": "0021700755_005", "order": 5, "role": "body", "text": "\"The ball was just falling,\" Walker said. \"I got great looks and I was able to just knock them down.\""}
{"game_id": "0021700755", "chunk_id": "0021700755_006", "order": 6, "role": "body", "text": "Charlotte never trailed while building double-digit leads in each half."}
{"game_id": "0021700755", "chunk_id": "0021700755_007", "order": 7, "role": "body", "text": "Howard scored the game's first two baskets in his first return to Atlanta after one season with his hometown Hawks."}
{"game_id": "0021700755", "chunk_id": "0021700755_008", "order": 8, "role": "body", "text": "\"We got out to a good lead ... and they were never able to fully recover from that,\" Howard said."}
{"game_id": "0021700755", "chunk_id": "0021700755_009", "order": 9, "role": "body", "text": "It was Howard's second double-double in less than a week against the Hawks. He had 18 points and 15 rebounds in Charlotte's 121-110 win over the Hawks on Friday."}
{"game_id": "0021700755", "chunk_id": "0021700755_010", "order": 10, "role": "body", "text": "Nicolas Batum had 10 points, 11 rebounds and 10 assists for Charlotte."}
{"game_id": "0021700755", "chunk_id": "0021700755_011", "order": 11, "role": "body", "text": "The Hawks couldn't slow Walker's scoring."}
{"game_id": "0021700755", "chunk_id": "0021700755_012", "order": 12, "role": "body", "text": "\"I think he just got them every way,\" Hawks coach Mike Budenholzer said."}
{"game_id": "0021700755", "chunk_id": "0021700755_013", "order": 13, "role": "body", "text": "Charlotte made 17 of 32 3s, including 9 of 13 by Walker."}
{"game_id": "0021700755", "chunk_id": "0021700755_014", "order": 14, "role": "body", "text": "\"When the game got going up and down, he was unbelievable,\" Charlotte coach Steve Clifford said."}
{"game_id": "0021700755", "chunk_id": "0021700755_015", "order": 15, "role": "body", "text": "Charlotte's biggest lead in the first half was 15 points, last held at 62-47. Kent Bazemore had 12 of his 25 points in the third quarter to help Atlanta cut into the deficit."}
{"game_id": "0021700755", "chunk_id": "0021700755_016", "order": 16, "role": "body", "text": "Dennis Schroder's jumper shrunk the Hornets' lead to 77-76. Walker answered with a 3-pointer that started his scoring streak that carried through the end of the third period."}
{"game_id": "0021700755", "chunk_id": "0021700755_017", "order": 17, "role": "body", "text": "The Hornets' lead was back to 13 points entering the fourth."}
{"game_id": "0021700755", "chunk_id": "0021700755_018", "order": 18, "role": "body", "text": "The win was already decided when Howard added powerful jams over Ersan Ilyasova and Mike Muscala in the fourth."}
{"game_id": "0021700755", "chunk_id": "0021700755_020", "order": 20, "role": "body", "text": "Hornets: F Marvin Williams (left ankle sprain) was held out. X-rays were negative after he left the fourth quarter of Monday night's loss to Indiana. Frank Kaminsky started for Williams, who may miss another game. ... The Hornets wore their black \"Buzz City\" alternate uniforms. ... Charlotte has won the first three games of the four-game season series."}
{"game_id": "0021700755", "chunk_id": "0021700755_021", "order": 21, "role": "body", "text": "Hawks: Marco Belinelli, who had 22 points, made his first four 3-pointers before three misses. ... Budenholzer said F DeAndre Bembry (left abductor strain) was making progress but there was no change in his status. ... Muscala started the second half instead of Miles Plumlee and hit a 3-pointer on the team's first possession following the break."}
{"game_id": "0021700755", "chunk_id": "0021700755_023", "order": 23, "role": "body", "text": "During the first timeout, fans had a mixed reaction to a tribute to Howard. There were boos and some cheers when the Hawks posted an image of Howard on the video board with the message \"Thanks for being true to Atlanta.\" There was another mixed reaction when the PA announcer urged fans to \"give it up for Dwight Howard.\""}
{"game_id": "0021700755", "chunk_id": "0021700755_024", "order": 24, "role": "body", "text": "There were a few boos during Howard's pregame introduction."}
{"game_id": "0021700755", "chunk_id": "0021700755_026", "order": 26, "role": "body", "text": "Schroder had his right shoulder wrapped as he sat on the bench at the end of the third quarter, but he returned about four minutes into the final period and had 13 points and nine assists."}
{"game_id": "0021700755", "chunk_id": "0021700755_027", "order": 27, "role": "body", "text": "There was continued discomfort following the game. He apparently hurt the shoulder in the first half."}
{"game_id": "0021700755", "chunk_id": "0021700755_028", "order": 28, "role": "body", "text": "\"I don't know how it happened,\" Schroder said. \"I'm going to check it with the trainers and see what's going on.\""}
{"game_id": "0021700755", "chunk_id": "0021700755_030", "order": 30, "role": "body", "text": "Official Eric Lewis called an unusual technical foul on Budenholzer in the second quarter. Budenholzer complained when no foul was called as Bazemore had his shot denied. Budenholzer had no more to say when the action moved to the other end of the floor, where Batum scored. Lewis then called the technical foul on Budenholzer, who reacted with shock, and another technical foul on Bazemore."}
{"game_id": "0021700755", "chunk_id": "0021700755_032", "order": 32, "role": "body", "text": "Hornets: Host Indiana on Friday night."}
{"game_id": "0021700755", "chunk_id": "0021700755_033", "order": 33, "role": "body", "text": "Hawks: Visit Boston on Friday night."}
{"game_id": "0021700755", "chunk_id": "0021700755_035", "order": 35, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
