{"game_id": "0021400751", "chunk_id": "0021400751_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  On a night when Detroit's 3-point attempts were missing the mark, Greg Monroe helped the Pistons cruise to an easy victory anyway."}
{"game_id": "0021400751", "chunk_id": "0021400751_002", "order": 2, "role": "body", "text": "Monroe had 21 points and a career-high 21 rebounds, and Detroit beat the slumping Denver Nuggets 98-88 on Friday night. It was the first 20-20 game of Monroe's career, and it came on a night when the Pistons shot 4 of 24 from beyond the arc."}
{"game_id": "0021400751", "chunk_id": "0021400751_003", "order": 3, "role": "body", "text": "\"Greg was fabulous tonight. He dominated,\" Detroit coach Stan Van Gundy said. \"They tried to play him with smaller people. They did a good job on their double-teams, but they didn't have anyone that could guard him 1-on-1.\""}
{"game_id": "0021400751", "chunk_id": "0021400751_004", "order": 4, "role": "body", "text": "D.J. Augustin added 22 points and 11 assists, and Andre Drummond had 13 points and 13 rebounds for Detroit. The Pistons led by as many as 22 in the third quarter but scored only 18 points in the fourth."}
{"game_id": "0021400751", "chunk_id": "0021400751_005", "order": 5, "role": "body", "text": "Ty Lawson had 20 points and nine assists for the Nuggets, who have dropped 12 of 13."}
{"game_id": "0021400751", "chunk_id": "0021400751_006", "order": 6, "role": "body", "text": "\"We talked before the game about the fact that we needed to keep those two big guys off the boards, and then we let Greg Monroe have a career-high rebounding night. So that didn't exactly work,\" Denver coach Brian Shaw said. \"We didn't start playing until the second half, and that's what got us beat.\""}
{"game_id": "0021400751", "chunk_id": "0021400751_007", "order": 7, "role": "body", "text": "The Pistons led 56-42 at halftime, and although Denver cut into the lead a bit, Detroit answered with a 3-pointer by Kentavious Caldwell-Pope and two more by Augustin, part of a 14-0 run that put the Pistons up 74-52."}
{"game_id": "0021400751", "chunk_id": "0021400751_008", "order": 8, "role": "body", "text": "Monroe and Drummond came into the game as the only two teammates in the NBA averaging double-doubles. The Pistons have tried to surround those two big men with 3-point threats, but for the most part, Detroit was off target from long range in this one."}
{"game_id": "0021400751", "chunk_id": "0021400751_009", "order": 9, "role": "body", "text": "It didn't matter. The Pistons were up 28-21 after the first quarter and outscored the Nuggets by that same tally in the second."}
{"game_id": "0021400751", "chunk_id": "0021400751_010", "order": 10, "role": "body", "text": "\"We got back to the things that Stan has been talking about for the last few games, defensively,\" Monroe said. \"Whenever we're playing defensively like that, we believe in our scoring ability.\""}
{"game_id": "0021400751", "chunk_id": "0021400751_011", "order": 11, "role": "body", "text": "Monroe said his performance was particularly meaningful because his grandmother, Althea Dixon, died Friday morning. He reached 20 rebounds for the third time in his career."}
{"game_id": "0021400751", "chunk_id": "0021400751_014", "order": 14, "role": "body", "text": "Detroit lost its season opener at Denver on Oct. 29, scoring only 79 points in the process, but the Pistons are a much different team than they were then. They're now on the edge of a playoff spot in the Eastern Conference, with a pair of big men who can put up big numbers on any given night and perimeter players who seem to be settling into their roles."}
{"game_id": "0021400751", "chunk_id": "0021400751_015", "order": 15, "role": "body", "text": "\"We're just playing defense, rebounding and pushing the ball,\" Augustin said. \"We keep doing that and scoring easy transition baskets, we don't have to shoot 3s.\""}
{"game_id": "0021400751", "chunk_id": "0021400751_017", "order": 17, "role": "body", "text": "Denver didn't quit, forcing eight turnovers in the fourth quarter and cutting the lead to single digits."}
{"game_id": "0021400751", "chunk_id": "0021400751_018", "order": 18, "role": "body", "text": "Detroit led 80-62 after three quarters. It was 88-82 with just more than a minute to play, but the Pistons remained in control until the end."}
{"game_id": "0021400751", "chunk_id": "0021400751_019", "order": 19, "role": "body", "text": "Denver's Arron Afflalo coughed his way through a postgame interview and said the Nuggets had a number of people playing sick."}
{"game_id": "0021400751", "chunk_id": "0021400751_020", "order": 20, "role": "body", "text": "\"You just have to give it everything you've got,\" he said. \"We've got to start playing harder at the beginning of games. We were desperate in the second half and we were playing with intensity, but that's not happening at the start of games, and we keep digging ourselves into holes.\""}
{"game_id": "0021400751", "chunk_id": "0021400751_022", "order": 22, "role": "body", "text": "Nuggets: Jameer Nelson (left Achilles strain) and JaVale McGee (flu-like symptoms) sat out."}
{"game_id": "0021400751", "chunk_id": "0021400751_023", "order": 23, "role": "body", "text": "Pistons: Caldwell-Pope (sore Achilles) was in the starting lineup after playing only 3:29 in a loss at Indiana on Wednesday. He scored nine points against Denver."}
{"game_id": "0021400751", "chunk_id": "0021400751_025", "order": 25, "role": "body", "text": "Nuggets: Host Oklahoma City on Monday night."}
{"game_id": "0021400751", "chunk_id": "0021400751_026", "order": 26, "role": "closing", "text": "Pistons: Host Minnesota on Sunday night."}
