{"game_id": "0021401066", "chunk_id": "0021401066_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- The Cleveland Cavaliers' recent dominance carried over to a trouncing of one of the best teams in the Western Conference.\nThe Cavaliers built a 29-point lead in the third quarter, maintained the cushion through the fourth and defeated Memphis 111-89 on Wednesday night, handing the Grizzlies their biggest home loss of the season.\nKyrie Irving scored 24 points, and Kevin Love added 22 points and 10 rebounds for Cleveland, which won its fourth straight and eighth in the past nine. Since Jan. 15, Cleveland is 28-6, and it holds the Eastern Conference's second seed by a three-game cushion over Chicago."}
{"game_id": "0021401066", "chunk_id": "0021401066_002", "order": 2, "role": "closing", "text": "\"We came to play,\" Cavaliers coach David Blatt said. \"We were focused on having a defensive presence in the first quarter, and I thought we had that right from the get-go.\"\nLeBron James finished with 20 points and Timofey Mozgov added 14 for Cleveland. J.R. Smith had 13 points for the Cavaliers, who shot 51 percent and were 14-of-34 from 3-point range.\nMarc Gasol led Memphis with 18 points, while Beno Udrih scored 15. Jeff Green had 11 points for Memphis, which had its three-game winning streak snapped.\nThe Grizzlies, who hold the second seed in the West, saw their advantage over third-place Houston shrink to 1 1/2 games after the Rockets defeated the New Orleans Pelicans 95-93 on Wednesday night.\nThe game was not in doubt after the big third quarter from the Cavaliers, who outscored Memphis 36-24 in the frame.\n\"It makes you have a sickness in your stomach because you know you're better than that,\" said Memphis forward Zach Randolph, who was limited to five points and three rebounds.\nCleveland controlled the boards with a 49-32 advantage. And while Memphis outscored Cleveland 50-38 in the paint, the Grizzlies converted only 25 of 49 shots in close.\n\"I thought we missed a lot of shots, and they were able to play free and loose, playing from the lead for most of the game,\" Memphis coach Dave Joerger said.\nThe game completely got away from Memphis in the third when Cleveland connected on 11 of its first 13 shots in the quarter, including three of four from 3-point range. The Cavaliers would convert 14 of 19 shots in the third, contributing to Cleveland extending its 13-point halftime lead to a 91-66 advantage entering the fourth -- a lead so substantial Joerger left his starters on the bench for the final period.\n\"Everyone really stepped up in the third quarter,\" Love said. \"So it was really, really good basketball.\"\nThe Cavaliers were able to convert because Memphis appeared to simply be going through the motions on both ends of the floor after halftime. The Grizzlies' defense, which is among the best in the league, was virtually nonexistent as Cleveland converted on dunks and jumpers.\n\"We obviously know how great they are defensively, especially in this building,\" James said. \"For us to move the ball and share the ball like we did in the facet that we did was very impressive.\"\nTIP-INS\nCavaliers: The game was Cleveland's last in the regular season against a Western Conference opponent. ... The Cavaliers entered having lost the previous five in Memphis. Cleveland's last road win in the series was during the 2008-09 season. ... Cleveland improved to 38-5 when scoring at least 100.\nGrizzlies: Memphis G Courtney Lee returned to the starting lineup after missing two games with a sprained right hand. ... Tony Allen connected on his 10th 3-pointer. He has made one in three of the past four games. ... Memphis recorded its 13th sellout of the season.\nWHAT DID YOU SAY?\nMemphis reserve guard Vince Carter was ejected early in the third quarter for arguing a non-call when Memphis thought Gasol was fouled. The two quick technicals came during the ensuing timeout after the play. Carter was not in the game at the time.\nDOMINANCE OVER WEST\nCleveland won 14 of its final 15 games over Western Conference opponents.\nUP NEXT\nCavaliers: Visit Nets on Friday.\nGrizzlies: Host Warriors on Friday."}
