{"game_id": "0021401037", "chunk_id": "0021401037_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  A dunk from LeBron James started a decisive run for the lethargic Cleveland Cavaliers."}
{"game_id": "0021401037", "chunk_id": "0021401037_002", "order": 2, "role": "body", "text": "From there, the Central Division leaders overpowered the young Milwaukee Bucks."}
{"game_id": "0021401037", "chunk_id": "0021401037_003", "order": 3, "role": "body", "text": "James scored 28 points, J.R. Smith had 23 and Cleveland began a three-game road trip with a 108-90 win on Sunday in Milwaukee."}
{"game_id": "0021401037", "chunk_id": "0021401037_004", "order": 4, "role": "body", "text": "The Cavaliers trailed by nine at halftime and 11 in the third quarter. The Bucks seemed rejuvenated on their home floor while looking to end a long losing streak."}
{"game_id": "0021401037", "chunk_id": "0021401037_006", "order": 6, "role": "body", "text": "First, he called out his teammates at halftime."}
{"game_id": "0021401037", "chunk_id": "0021401037_007", "order": 7, "role": "body", "text": "\"I was frustrated with our play,\" James said. \"I know when to press the button when need be and tonight was one of those nights when I needed to press the button.\""}
{"game_id": "0021401037", "chunk_id": "0021401037_008", "order": 8, "role": "body", "text": "Smith made three consecutive 3s to cap the 26-5 run that started with James' dunk, helping Cleveland to a 93-78 lead with 6:19 left. The final 3 came off a bad pass by John Henson that led to one of the Bucks' 23 turnovers."}
{"game_id": "0021401037", "chunk_id": "0021401037_009", "order": 9, "role": "body", "text": "\"For any team, not just LeBron, when you give those guys free opportunities like that ... they're going to make you pay for it and they did,\" Bucks coach Jason Kidd said."}
{"game_id": "0021401037", "chunk_id": "0021401037_010", "order": 10, "role": "body", "text": "James' dunk off a blocked shot pulled the Cavs within 73-69 with 1:19 left in the third quarter and started the big run. He stared down the Bucks after the bucket."}
{"game_id": "0021401037", "chunk_id": "0021401037_011", "order": 11, "role": "body", "text": "James outscored the Bucks on his own from that point, 19-17."}
{"game_id": "0021401037", "chunk_id": "0021401037_012", "order": 12, "role": "body", "text": "\"I think our communication ramped up. We were just flying around and helping one another,\" said James, who was 10 of 17 from the field and grabbed 10 boards."}
{"game_id": "0021401037", "chunk_id": "0021401037_014", "order": 14, "role": "body", "text": "Milwaukee has dropped six in a row."}
{"game_id": "0021401037", "chunk_id": "0021401037_015", "order": 15, "role": "body", "text": "Giannis Antetokounmpo had 15 points and nine rebounds for the Bucks. The lanky forward muscled his way to the bucket against James early in the game to help Milwaukee build an 11-point lead."}
{"game_id": "0021401037", "chunk_id": "0021401037_016", "order": 16, "role": "body", "text": "But turnovers doomed Milwaukee. Michael Carter-Williams had 19 points, five assists and six turnovers, while Khris Middleton finished with 15 points, seven assists and five turnovers."}
{"game_id": "0021401037", "chunk_id": "0021401037_017", "order": 17, "role": "body", "text": "\"That puts our defense in a bad situation, and a lot of pressure on your defense,\" Kidd said about the miscues."}
{"game_id": "0021401037", "chunk_id": "0021401037_019", "order": 19, "role": "body", "text": "After his third straight 3 in the fourth quarter in front of the Milwaukee bench, Smith shook his head from side to side as he jogged back up the court."}
{"game_id": "0021401037", "chunk_id": "0021401037_020", "order": 20, "role": "body", "text": "Smith was 7 for 9 from 3-point range."}
{"game_id": "0021401037", "chunk_id": "0021401037_021", "order": 21, "role": "body", "text": "\"It surprised me because I had just hit three in a row, and then to leave me wide open, I was just like `What did you think was going to happen?' They called a time out and then we just ran away with it,\" Smith said."}
{"game_id": "0021401037", "chunk_id": "0021401037_023", "order": 23, "role": "body", "text": "Antetokounmpo, a second-year player, looked fearless at times against James. The 6-foot-11 forward had 11 points and six rebounds in the first half to help Milwaukee carry a nine-point lead into the break."}
{"game_id": "0021401037", "chunk_id": "0021401037_024", "order": 24, "role": "body", "text": "\"Milwaukee's length and ability to get their hands on balls and steal the ball bothers every team,\" Cleveland coach David Blatt said. \"That's a big part of their game. It disturbed us.\""}
{"game_id": "0021401037", "chunk_id": "0021401037_026", "order": 26, "role": "body", "text": "Cavaliers: Blatt, who also coached in Europe, said he didn't feel the need to campaign for James for the NBA MVP race, though he wouldn't be shy about talking about James either. Stumping for awards, though, wasn't common in Europe."}
{"game_id": "0021401037", "chunk_id": "0021401037_027", "order": 27, "role": "body", "text": "Bucks: Milwaukee fell to 4-13 since a trade deadline deal that shipped Brandon Knight to Phoenix and netted Carter-Williams from Philadelphia. Still, the Bucks remain in sixth place in the Eastern Conference playoff race. \"We take one game at a time, and I think this is a perfect time for this team, for coaches and players to be put in,\" Kidd said before the game. \"No one thought we were going to be here.\" ... Hall of Famer Oscar Robertson, a former Buck, watched courtside. He received a standing ovation after being introduced during a second-quarter break."}
{"game_id": "0021401037", "chunk_id": "0021401037_029", "order": 29, "role": "body", "text": "Cavaliers: At Memphis on Wednesday."}
