{"game_id": "0021400384", "chunk_id": "0021400384_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  What Kemba Walker started, Al Jefferson made sure to finish."}
{"game_id": "0021400384", "chunk_id": "0021400384_002", "order": 2, "role": "body", "text": "Walker scored a season-high 30 points, Jefferson added 16 of his 20 in the second half, and the Charlotte Hornets snapped a four-game losing streak with a 109-91 win over the Philadelphia 76ers on Friday night."}
{"game_id": "0021400384", "chunk_id": "0021400384_003", "order": 3, "role": "body", "text": "\"I didn't start off well at all,\" Jefferson said. \"But Kemba led the way. I figured I had to be the one to end it.\""}
{"game_id": "0021400384", "chunk_id": "0021400384_004", "order": 4, "role": "body", "text": "Tony Wroten and Robert Covington scored 19 apiece for the Sixers, who dropped to 0-14 at home this season. They're closing in on the NBA record for the most home losses to start a season, which is held by the 1993-94 Dallas Mavericks at 19."}
{"game_id": "0021400384", "chunk_id": "0021400384_005", "order": 5, "role": "body", "text": "Philadelphia point guard Michael Carter-Williams had 14 points and 10 assists, but the Sixers committed 24 turnovers that led to 35 Charlotte points"}
{"game_id": "0021400384", "chunk_id": "0021400384_006", "order": 6, "role": "body", "text": "\"They sniffed blood,\" 76ers coach Brett Brown said. \"They knew they wanted to come in here and get a win.\""}
{"game_id": "0021400384", "chunk_id": "0021400384_007", "order": 7, "role": "body", "text": "The Hornets (7-19) had lost 14 of 16 coming into the game but dominated the rebuilding Sixers (2-23)."}
{"game_id": "0021400384", "chunk_id": "0021400384_008", "order": 8, "role": "body", "text": "Despite playing without starting guard Lance Stephenson, who missed his first game of the season because of a pelvic sprain, Charlotte jumped on the Sixers early, closing the first quarter on an 11-2 run to open an 11-point lead."}
{"game_id": "0021400384", "chunk_id": "0021400384_009", "order": 9, "role": "body", "text": "Charlotte extended its lead to 17 midway through the second quarter before scoring the final nine points of the half to take a 66-46 advantage into the break."}
{"game_id": "0021400384", "chunk_id": "0021400384_010", "order": 10, "role": "body", "text": "Walker made the final basket in both the first and second quarter, and finished 13 for 23 from the field and 3 of 4 from 3-point range. He added five assists and four rebounds."}
{"game_id": "0021400384", "chunk_id": "0021400384_011", "order": 11, "role": "body", "text": "\"When he's going, he leads us and we follow him,\" Jefferson said. \"He's the leader of this team. He's got a heart of a giant.\""}
{"game_id": "0021400384", "chunk_id": "0021400384_012", "order": 12, "role": "body", "text": "Walker acknowledged he tried to attack the Philadelphia defense and play more aggressively -- but not because Jefferson struggled in the first half or Stephenson was out."}
{"game_id": "0021400384", "chunk_id": "0021400384_013", "order": 13, "role": "body", "text": "\"That's me, just being aggressive,\" Walker said. \"That's what got me this far. That's my game -- always being in attack mode.\""}
{"game_id": "0021400384", "chunk_id": "0021400384_014", "order": 14, "role": "body", "text": "Paying more attention to Walker after the break, the Sixers cut the Hornets' lead to 13 midway through the third quarter. But that's when Jefferson took over, scoring a few quick inside buckets to stop Philadelphia from gaining any momentum."}
{"game_id": "0021400384", "chunk_id": "0021400384_015", "order": 15, "role": "body", "text": "Jefferson finished with 12 rebounds and Philadelphia-area native Gerald Henderson added 11 points for the Hornets, who shot 43.9 percent from the field and 41.7 percent from 3-point range."}
{"game_id": "0021400384", "chunk_id": "0021400384_016", "order": 16, "role": "body", "text": "Charlotte got 35 points from its bench, with Gary Neal leading the way with 10 and Marvin Williams scoring nine, including back-to-back 3s in the first quarter."}
{"game_id": "0021400384", "chunk_id": "0021400384_017", "order": 17, "role": "body", "text": "\"Most teams are going to double me or send help,\" Jefferson said. \"My teammates have to make them pay. That's what we have to do.\""}
{"game_id": "0021400384", "chunk_id": "0021400384_018", "order": 18, "role": "body", "text": "The win was a much-needed one for the slumping Hornets, who have a quick turnaround as they return home to face Utah on Saturday."}
{"game_id": "0021400384", "chunk_id": "0021400384_019", "order": 19, "role": "body", "text": "\"We just needed to win, period,\" Walker said. \"I'm glad we came in here and executed. Hopefully we can carry this momentum into the future.\""}
{"game_id": "0021400384", "chunk_id": "0021400384_020", "order": 20, "role": "body", "text": "The Sixers won't get another chance to snap their home losing streak until Jan. 5 when they welcome LeBron James and the Cavaliers. Before then, they have a seven-game road swing while Disney on Ice moves into the Wells Fargo Center."}
{"game_id": "0021400384", "chunk_id": "0021400384_021", "order": 21, "role": "body", "text": "While they're on the road, Brown knows the 76ers can't continue to fall way behind from the opening tip the way they did against Charlotte."}
{"game_id": "0021400384", "chunk_id": "0021400384_022", "order": 22, "role": "body", "text": "\"I thought the start of the game influenced the rest of it,\" the Sixers' coach said. \"They scored freely. Some of it, we give them credit. Some of it is on us. That's a physical team -- a man's team that played in the playoffs last year.\""}
{"game_id": "0021400384", "chunk_id": "0021400384_025", "order": 25, "role": "body", "text": "Hornets: It was Charlotte's second road victory this season. The Hornets' only other win away from home came in Phoenix on Nov. 14. ... The Hornets shot 7 for 12 from 3-point range in the first half -- the same totals as Philadelphia. They also shot 50 percent from the field and 90 percent from the free throw line before the break."}
{"game_id": "0021400384", "chunk_id": "0021400384_026", "order": 26, "role": "body", "text": "76ers: Four days after making his Sixers debut, Turkish forward Furkan Aldemir was sidelined because of right foot plantar fasciitis. ... The Sixers got 40 points from their bench and had 10 different players log at least 10 minutes."}
{"game_id": "0021400384", "chunk_id": "0021400384_028", "order": 28, "role": "body", "text": "During the game, the Sixers announced that they acquired Houston's 2015 second-round draft pick, Ronny Turiaf and the rights to Sergei Lishouk in exchange for guard Alexey Shved."}
{"game_id": "0021400384", "chunk_id": "0021400384_029", "order": 29, "role": "body", "text": "Shved, averaging 9.9 points this season, was not in uniform or listed on the roster for Friday's game."}
{"game_id": "0021400384", "chunk_id": "0021400384_030", "order": 30, "role": "body", "text": "Afterward, Brown said losing someone that was part of the rotation without much notice simply comes with the territory."}
{"game_id": "0021400384", "chunk_id": "0021400384_031", "order": 31, "role": "body", "text": "\"It's a challenge,\" he said. \"But it's all part of the plan to navigate the future. That's just the way it is.\""}
{"game_id": "0021400384", "chunk_id": "0021400384_033", "order": 33, "role": "body", "text": "The Hornets host Utah on Saturday."}
{"game_id": "0021400384", "chunk_id": "0021400384_034", "order": 34, "role": "closing", "text": "The 76ers play at Orlando on Sunday."}
