{"game_id": "0021400653", "chunk_id": "0021400653_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  The Bucks made their coach proud with the way they moved the ball against the Detroit Pistons."}
{"game_id": "0021400653", "chunk_id": "0021400653_002", "order": 2, "role": "body", "text": "With a season-high 33 assists on 41 baskets, former All-Star point guard Jason Kidd loved the way that Milwaukee got open looks in a 101-86 victory on Saturday night."}
{"game_id": "0021400653", "chunk_id": "0021400653_003", "order": 3, "role": "body", "text": "\"You know guys turned down a good shot to get a better shot for a teammate,\" Kidd said. \"Make or miss that's what good teams do.\""}
{"game_id": "0021400653", "chunk_id": "0021400653_004", "order": 4, "role": "body", "text": "O.J. Mayo scored 20 points and Khris Middleton had 16 points, seven rebounds and four assists in a rare easy victory."}
{"game_id": "0021400653", "chunk_id": "0021400653_005", "order": 5, "role": "body", "text": "The Bucks went 11 for 17 from 3-point range, including a 4-for-5 performance from Mayo. The reserve guard made three 3s in a 47-second span of the second quarter to spark an 18-2 run that gave Milwaukee a 54-40 lead with 4:27 left in the second quarter."}
{"game_id": "0021400653", "chunk_id": "0021400653_006", "order": 6, "role": "body", "text": "Milwaukee also opened the second half with a 17-2 run. The Bucks played a near-flawless game in the second and third quarters before letting up in the fourth, allowing the Pistons to cut 30-point lead in half."}
{"game_id": "0021400653", "chunk_id": "0021400653_007", "order": 7, "role": "body", "text": "\"I thought for three quarters the pace was good. That fourth quarter was awful,\" Kidd said."}
{"game_id": "0021400653", "chunk_id": "0021400653_008", "order": 8, "role": "body", "text": "At least the Bucks go into Sunday night's tough road game at San Antonio with a confidence boost."}
{"game_id": "0021400653", "chunk_id": "0021400653_009", "order": 9, "role": "body", "text": "The Pistons will be without guard Brandon Jennings when they take on the Raptors in Toronto on Sunday night. He scored 16 points before leaving late in the third with a lower left leg injury."}
{"game_id": "0021400653", "chunk_id": "0021400653_010", "order": 10, "role": "body", "text": "The Pistons said Jennings would undergo further evaluation after the guard needed help getting to the locker room. Jennings was on the floor in pain for several seconds after planting off his left leg while guarding an inbounds pass."}
{"game_id": "0021400653", "chunk_id": "0021400653_011", "order": 11, "role": "body", "text": "\"It doesn't look good,\" coach Stan Van Gundy said. \"It is a major, major loss.\""}
{"game_id": "0021400653", "chunk_id": "0021400653_012", "order": 12, "role": "body", "text": "The Pistons have lost two straight on the road after tying a franchise record with seven straight wins away from Detroit."}
{"game_id": "0021400653", "chunk_id": "0021400653_013", "order": 13, "role": "body", "text": "\"It wouldn't matter if we had Brandon or not,\" Van Gundy said. \"If we are going to play like that, we are not beating anybody.\""}
{"game_id": "0021400653", "chunk_id": "0021400653_015", "order": 15, "role": "body", "text": "Jennings got hurt while playing against the team that drafted him in the first round in 2009. Van Gundy said D.J. Augustin will have to play a bigger role with Jennings out for the forseeable future."}
{"game_id": "0021400653", "chunk_id": "0021400653_016", "order": 16, "role": "body", "text": "\"It is always a scary situation, especially when you are talking about a non-contact foul,\" teammate Greg Monroe said."}
{"game_id": "0021400653", "chunk_id": "0021400653_018", "order": 18, "role": "body", "text": "The game was essentially over when the Pistons fell flat coming out at halftime."}
{"game_id": "0021400653", "chunk_id": "0021400653_019", "order": 19, "role": "body", "text": "Mayo's hot shooting in the second quarter helped give the Bucks to their big cushion. He hit a straightaway 3 before getting another 3 on a fall-away jumper from the left corner."}
{"game_id": "0021400653", "chunk_id": "0021400653_020", "order": 20, "role": "body", "text": "Each time he hit a shot, the public address announcer would yell Mayo's nickname, \"Juice!\""}
{"game_id": "0021400653", "chunk_id": "0021400653_021", "order": 21, "role": "body", "text": "\"He has come in plenty of games and just gave us a big scoring lift, a lot of energy,\" guard Brandon Knight said in describing Mayo's play this season. \"When you've got somebody that can do that and keep it rolling and keep the energy up, that's big time.\""}
{"game_id": "0021400653", "chunk_id": "0021400653_022", "order": 22, "role": "body", "text": "Anthony Tolliver was then whistled for stepping on the end line on the next inbounds play for a turnover. Mayo hit another 3 to give Milwaukee a 14-point lead."}
{"game_id": "0021400653", "chunk_id": "0021400653_023", "order": 23, "role": "body", "text": "The Pistons shot 36 percent (31 of 86) for the night."}
{"game_id": "0021400653", "chunk_id": "0021400653_025", "order": 25, "role": "body", "text": "Pistons: Monroe matched his season average of 10 rebounds per game by halftime. He finished with 16 boards in 28 minutes. ... Jennings had four assists after dishing out a career-high and NBA season-high 21 on Wednesday against the Magic."}
{"game_id": "0021400653", "chunk_id": "0021400653_026", "order": 26, "role": "body", "text": "Bucks: Knight, who was traded from Detroit for Jennings before the 2013-14 season, finished with 14 points. ... The Bucks welcomed former player Vin Baker back to the Bradley Center. Baker, the eighth-overall pick in the 1993 NBA draft, averaged 18.3 points and 9.5 rebounds in four seasons with Milwaukee."}
{"game_id": "0021400653", "chunk_id": "0021400653_028", "order": 28, "role": "body", "text": "Pistons: Visit Toronto on Sunday night."}
{"game_id": "0021400653", "chunk_id": "0021400653_029", "order": 29, "role": "closing", "text": "Bucks: Visit San Antonio on Sunday night."}
