{"game_id": "0021701113", "chunk_id": "0021701113_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Dallas Mavericks forward Harrison Barnes didn't see the group of protesters making their way to Golden1 Center for a second round of protests Tuesday. He only heard they were coming -- and he was perfectly fine with it."}
{"game_id": "0021701113", "chunk_id": "0021701113_002", "order": 2, "role": "body", "text": "Outside the arena, demonstrators gathered to protest the March 18 fatal police shooting of Stephon Clark, an unarmed 22-year-old black man who was in his grandparents' backyard. Most fans were prevented from entering Golden1 Center and the team later released a statement saying refunds would be given."}
{"game_id": "0021701113", "chunk_id": "0021701113_003", "order": 3, "role": "body", "text": "It was the second time in six days that protesters forced a lockdown at Golden1 Center."}
{"game_id": "0021701113", "chunk_id": "0021701113_004", "order": 4, "role": "body", "text": "Barnes is hopeful the protests stir debate that he believes is long overdue, not just in Sacramento but around the country."}
{"game_id": "0021701113", "chunk_id": "0021701113_005", "order": 5, "role": "body", "text": "\"If they were doing this somewhere else in the city, would they still be garnering the same attention?\" Barnes asked following the Mavericks' 103-97 win over the Kings. \"Would it be at the front of every opposing team that's coming in here? Would it be national news that the Sacramento Kings are locking fans out of their stadium? Why are they locking fans out of the stadium? Oh, because this young man was killed. Then the dialogue keeps going that way."}
{"game_id": "0021701113", "chunk_id": "0021701113_006", "order": 6, "role": "body", "text": "\"There's never an easy way that's easy for everyone who's involved to accept it and be on board, but the point is to bring attention to something, to start a debate, and that's what they're doing.\""}
{"game_id": "0021701113", "chunk_id": "0021701113_007", "order": 7, "role": "body", "text": "The Mavericks ended their five-game losing streak behind strong performances from Barnes (20 points, six assists, five rebounds) and Dennis Smith Jr. (19 points, six assists), but the focus remained on the protests."}
{"game_id": "0021701113", "chunk_id": "0021701113_008", "order": 8, "role": "body", "text": "Some fans who arrived early were let in and allowed to move down into the lower bowl of the arena. Although no official attendance was given, the crowd was estimated at around 4,000."}
{"game_id": "0021701113", "chunk_id": "0021701113_009", "order": 9, "role": "body", "text": "That was twice the number of people who were allowed in last Thursday when protesters formed a human chain around the arena and forced the start of the game to be delayed."}
{"game_id": "0021701113", "chunk_id": "0021701113_010", "order": 10, "role": "body", "text": "\"Hopefully (the protests) keep the discussion going in all sorts of communities, not only here,\" Mavericks veteran Dirk Nowitzki said. \"It's just unfortunately that things like this continue to happen. Communities need all the help they can get.\""}
{"game_id": "0021701113", "chunk_id": "0021701113_011", "order": 11, "role": "body", "text": "The Kings have home games slated for Thursday, the same day as Clark's funeral, and Saturday when a march is scheduled."}
{"game_id": "0021701113", "chunk_id": "0021701113_012", "order": 12, "role": "body", "text": "\"Despite what's going on, we've still got to do our jobs and come in here and hoop,\" Sacramento's Willie Cauley-Stein said."}
{"game_id": "0021701113", "chunk_id": "0021701113_013", "order": 13, "role": "body", "text": "Smith played well in his second game back from an ankle injury. Doug McDermott scored seven of his 15 points during a big run in the fourth quarter, and Aaron Harrison and Johnathan Motley had 10 points apiece for the Mavericks."}
{"game_id": "0021701113", "chunk_id": "0021701113_014", "order": 14, "role": "body", "text": "Dallas led by 18 with 3:44 remaining before Sacramento went on a 17-4 run. Buddy Hield had six points as part of the spurt and Frank Mason made two free throws to pull the Kings to 102-97 with 21.9 seconds left."}
{"game_id": "0021701113", "chunk_id": "0021701113_015", "order": 15, "role": "body", "text": "Kyle Collinsworth made one of two free throws for the Mavericks to seal the win."}
{"game_id": "0021701113", "chunk_id": "0021701113_016", "order": 16, "role": "body", "text": "Skal Labissiere had 19 points and eight rebounds, and Kosta Koufos scored 15 for Sacramento."}
{"game_id": "0021701113", "chunk_id": "0021701113_018", "order": 18, "role": "body", "text": "Mavericks: Dwight Powell didn't play because of bursitis in his left knee. ... Nowitzki scored five points on 2-of-9 shooting. He went 1 for 7 on 3s. ... JJ Barea did not make the trip due to personal reasons. Nerlens Noel and Dorian Finney-Smith were also held out."}
{"game_id": "0021701113", "chunk_id": "0021701113_019", "order": 19, "role": "body", "text": "Kings: Koufos took advantage of Powell's absence and scored 15 of Sacramento's first 29 points. Koufos entered averaging 6.6 points per game. ... Garrett Temple (sprained left ankle) missed his third straight game."}
{"game_id": "0021701113", "chunk_id": "0021701113_021", "order": 21, "role": "body", "text": "Barnes' six assists tied his career high set against Brooklyn last Nov. 29. All six came in the first half."}
{"game_id": "0021701113", "chunk_id": "0021701113_022", "order": 22, "role": "body", "text": "\"Guys weren't making shots (in the second half),\" Barnes said, joking. \"No, I just thought we had good movement tonight. Guys were making shots, getting into the flow of things.\""}
{"game_id": "0021701113", "chunk_id": "0021701113_024", "order": 24, "role": "body", "text": "McDermott scored on a pair of layups in the fourth quarter, one after Collinsworth made a behind-the-back bounce pass. \"Kyle hit him on one of those Mark Cuban's premier club behind-the-back bounce passes,\" Mavericks coach Rick Carlisle said."}
{"game_id": "0021701113", "chunk_id": "0021701113_026", "order": 26, "role": "body", "text": "Mavericks: Play at the Los Angeles Lakers on Wednesday."}
{"game_id": "0021701113", "chunk_id": "0021701113_027", "order": 27, "role": "body", "text": "Kings: Host the Indiana Pacers on Thursday."}
{"game_id": "0021701113", "chunk_id": "0021701113_029", "order": 29, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
