{"game_id": "0021201149", "chunk_id": "0021201149_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Marc Gasol was scoreless in the fourth quarter. Yet he wound up being the key player for the Memphis Grizzlies, blocking a pair of shots in the final seven seconds to preserve the victory."}
{"game_id": "0021201149", "chunk_id": "0021201149_002", "order": 2, "role": "body", "text": "Mike Conley scored 25 points, making the go-ahead basket with 30 seconds left and leading the Grizzlies to an 89-87 victory over the struggling Sacramento Kings on Sunday night."}
{"game_id": "0021201149", "chunk_id": "0021201149_003", "order": 3, "role": "body", "text": "Memphis made some big plays in the game's final minute for its fifth victory in six games. The win gave the Grizzlies a four-game sweep of the Kings for the first time in franchise history."}
{"game_id": "0021201149", "chunk_id": "0021201149_004", "order": 4, "role": "body", "text": "It should come as no surprise that the Grizzlies won the game at the defensive end. Second in the NBA in fewest points allowed, the Grizzlies held the Kings to just under 36 percent shooting and blocked 12 shots."}
{"game_id": "0021201149", "chunk_id": "0021201149_005", "order": 5, "role": "body", "text": "The final block, Gasol's fifth of the game, was the most important. With the clock running down, Kings guard Marcus Thornton tried to launch a 3-pointer with 1 second left for the victory, but Gasol stepped up to block the shot. Gasol also blocked a drive to the basket by DeMarcus Cousins with 7 seconds left."}
{"game_id": "0021201149", "chunk_id": "0021201149_006", "order": 6, "role": "body", "text": "Gasol was on Cousins and made the switch to Thornton, who tried to launch the 25-footer over the Grizzlies' 7-foot-1 center."}
{"game_id": "0021201149", "chunk_id": "0021201149_007", "order": 7, "role": "body", "text": "\"He pump-faked and I didn't jump,\" Gasol said. \"I'm not much of a jumper anyway. The switch worked out.\""}
{"game_id": "0021201149", "chunk_id": "0021201149_008", "order": 8, "role": "body", "text": "Coach Keith Smart was hoping the Kings would penetrate on the final play and not go for the game-winning 3-point."}
{"game_id": "0021201149", "chunk_id": "0021201149_009", "order": 9, "role": "body", "text": "\"You have to drive that; you have to turn the ball and go,\" Smart said. \"Marcus needed to turn the corner and get himself into the paint. We didn't need a winner. They were obviously going to switch any pick-and-roll that came together. For that, you take the ball to the basket and try to create something.\""}
{"game_id": "0021201149", "chunk_id": "0021201149_010", "order": 10, "role": "body", "text": "Trailing by one point, Conley penetrated the lane and tossed in a runner to give Memphis an 86-85 lead with 30 seconds left."}
{"game_id": "0021201149", "chunk_id": "0021201149_011", "order": 11, "role": "body", "text": "With a chance to retake the lead, Cousins drove to the basket and Gasol partially blocked his shot, with Quincy Pondexter grabbing the rebound."}
{"game_id": "0021201149", "chunk_id": "0021201149_012", "order": 12, "role": "body", "text": "The emotional Cousins briefly argued that he was fouled, but Gasol said no way."}
{"game_id": "0021201149", "chunk_id": "0021201149_013", "order": 13, "role": "body", "text": "\"I know I got the ball; I got lucky,\" said Gasol, who also contributed 15 points and 10 rebounds. \"Cousins is strong and has a lot of weapons. He can shoot, drive and pass the ball.\""}
{"game_id": "0021201149", "chunk_id": "0021201149_014", "order": 14, "role": "body", "text": "Pondexter tied his career high with 17 points and Tony Allen scored 12 for the Grizzlies, who have five games left and currently are in fifth place in the Western Conference."}
{"game_id": "0021201149", "chunk_id": "0021201149_015", "order": 15, "role": "body", "text": "The Grizzlies (52-25) have set a franchise record this season for victories and are headed to the postseason for a third straight season and for the sixth time in franchise history."}
{"game_id": "0021201149", "chunk_id": "0021201149_016", "order": 16, "role": "body", "text": "The Grizzlies are 19-7 following the All-Star break, which is the third-best record in the league. They've also won 23 of their last 32 games since trading away leading scorer Rudy Gay to the Toronto Raptors."}
{"game_id": "0021201149", "chunk_id": "0021201149_017", "order": 17, "role": "body", "text": "\"We're gearing up for the playoffs,\" Pondexter said. \"We're happy with this win. This is the NBA. Getting any win is tough in this league. We executed down the stretch and grinded this one out.\""}
{"game_id": "0021201149", "chunk_id": "0021201149_018", "order": 18, "role": "body", "text": "Cousins had 22 points and nine rebounds for the Kings, who have dropped four straight. Isaiah Thomas had 18 points, eight assists and six rebounds. Toney Douglas scored 14 points and Jimmer Fredette added 13."}
{"game_id": "0021201149", "chunk_id": "0021201149_019", "order": 19, "role": "body", "text": "\"It came down to execution,\" Kings reserve Chuck Hayes said. \"They got a block and Conley hit a floater. You can tell they are getting ready for the playoffs and they are in playoff form.\""}
{"game_id": "0021201149", "chunk_id": "0021201149_020", "order": 20, "role": "body", "text": "Cousins, the Kings' leading scorer and rebounder, was back in the starting lineup after being relegated to a reserve Friday night against Dallas, when he had six points in nine minutes. It was the first time in 69 games this season that Cousins wasn't in the starting lineup."}
{"game_id": "0021201149", "chunk_id": "0021201149_021", "order": 21, "role": "body", "text": "Although no reason was given for the benching, Cousins seemed motivated offensively in the opening quarter, when he had 11 points and four rebounds."}
{"game_id": "0021201149", "chunk_id": "0021201149_022", "order": 22, "role": "body", "text": "After Memphis took an eight-point lead, the Kings scored seven straight, cutting the margin to 84-83 with 1:25 left on Cousins' two free throws. On the Kings' next possession with the shot clock running down, Cousins hit a 21-footer to give the Kings an 85-84 lead."}
{"game_id": "0021201149", "chunk_id": "0021201149_023", "order": 23, "role": "body", "text": "After his shot was blocked by Gasol, Cousins fouled Pondexter, who made both free throws for an 88-85 Memphis lead. Thomas scored on a layup for the Kings, but Conley made 1-of-2 free throws to make it 89-87."}
{"game_id": "0021201149", "chunk_id": "0021201149_024", "order": 24, "role": "body", "text": "It was a rough game offensively for Memphis forwards Zach Randolph and Tayshaun Prince. Randolph shot 4 of 13 and had nine points, and Prince shot poorly as well and finished with three points."}
{"game_id": "0021201149", "chunk_id": "0021201149_025", "order": 25, "role": "body", "text": "Following a subpar second quarter defensively, the Grizzlies returned to what they do best -- making it tough for teams to score. Gasol had eight points in the third when the Grizzlies had a 25-20 advantage and took a four-point lead into the fourth."}
{"game_id": "0021201149", "chunk_id": "0021201149_026", "order": 26, "role": "body", "text": "After a poor opening quarter, the Kings outscored the Grizzlies 28-18 in the second. Fredette scored 10 points and Douglas had eight in the period. Cousins had 11 first-half points, helping the Kings to a 44-43 lead."}
{"game_id": "0021201149", "chunk_id": "0021201149_027", "order": 27, "role": "closing", "text": "Game notes Memphis reserve guards Keyon Dooling and Tony Wroten were back with the team after playing Saturday with the NBA Development League's Reno Bullhorns. Wroten scored 30 points in the final game this season for Reno. ... Cousins shot 5 of 7 in the opening quarter, while the rest of the Kings shot a combined 1 of 12. ... Kings reserve forward Patrick Patterson didn't play due to a sore lower back."}
