{"game_id": "0021200113", "chunk_id": "0021200113_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  As they've risen simultaneously into Western Conference contenders, the Oklahoma City Thunder and Memphis Grizzlies have quickly learned to dislike each other."}
{"game_id": "0021200113", "chunk_id": "0021200113_002", "order": 2, "role": "body", "text": "In their latest slugfest, it was the Thunder who came out swinging but Zach Randolph and the Grizzlies got the win."}
{"game_id": "0021200113", "chunk_id": "0021200113_003", "order": 3, "role": "body", "text": "Rudy Gay scored a season-high 28 points, Randolph added 20 points and 11 rebounds before getting ejected along with Oklahoma City's Kendrick Perkins during a late-game altercation and Memphis beat the Thunder 107-97 on Wednesday night."}
{"game_id": "0021200113", "chunk_id": "0021200113_004", "order": 4, "role": "body", "text": "Despite notching wins against defending champion Miami and runner-up Oklahoma City during their current six-game winning streak, Randolph said the Grizzlies aren't claiming to have made any statements early on and are still fueled by an underdog mentality."}
{"game_id": "0021200113", "chunk_id": "0021200113_005", "order": 5, "role": "body", "text": "\"This is one of the best teams in the West,\" Randolph said. \"We're trying to get where they're at.\""}
{"game_id": "0021200113", "chunk_id": "0021200113_006", "order": 6, "role": "body", "text": "Maybe that's why every meeting between the two seems to turn into a knock-down, drag-out fight. This one saw Perkins and Randolph confronting each other between Russell Westbrook's free throw attempts, drawing each an ejection from referee Ken Mauer with 2:05 left in the game."}
{"game_id": "0021200113", "chunk_id": "0021200113_007", "order": 7, "role": "body", "text": "The two tried to approach each other while being restrained by teammates before finally heading out tunnels at opposite ends of Chesapeake Energy Arena."}
{"game_id": "0021200113", "chunk_id": "0021200113_008", "order": 8, "role": "body", "text": "After the game, Randolph said all was settled between him and Perkins."}
{"game_id": "0021200113", "chunk_id": "0021200113_009", "order": 9, "role": "body", "text": "\"There's a lot of bluffing going on on the court, that's all,\" Randolph said. \"And I don't bluff.\""}
{"game_id": "0021200113", "chunk_id": "0021200113_010", "order": 10, "role": "body", "text": "By the time the ejections took place, the Grizzlies had all but put the game away -- with Randolph and fellow big man Marc Gasol answering an Oklahoma City comeback bid punctuated by Perkins' two-handed slam that cut the deficit to 97-89 with 4:18 to play."}
{"game_id": "0021200113", "chunk_id": "0021200113_011", "order": 11, "role": "body", "text": "Coach Lionel Hollins called for a timeout and sent his team back out with Gasol isolated against Perkins, and Gasol twisted his way in for a layup. After a missed jumper by Serge Ibaka at the other end, Gasol set up Randolph for a layup off a designed play."}
{"game_id": "0021200113", "chunk_id": "0021200113_012", "order": 12, "role": "body", "text": "That all but sealed the latest round for Memphis, which won its second straight in Oklahoma City's home gym to add more fuel to the budding rivalry."}
{"game_id": "0021200113", "chunk_id": "0021200113_013", "order": 13, "role": "body", "text": "\"That's what makes it fun,\" Gay said."}
{"game_id": "0021200113", "chunk_id": "0021200113_014", "order": 14, "role": "body", "text": "Memphis ended up losing a seven-game series that featured a couple overtime thrillers two seasons ago against Oklahoma City and has been trying to claw its way ahead of the Thunder, who have been one step ahead in their progression so far."}
{"game_id": "0021200113", "chunk_id": "0021200113_015", "order": 15, "role": "body", "text": "Sometimes the clawing gets a little too realistic."}
{"game_id": "0021200113", "chunk_id": "0021200113_016", "order": 16, "role": "body", "text": "\"It is an emotional game and we didn't play well and I think the referees were just trying to control the game. Throw both of them out so nothing happens,\" Thunder coach Scott Brooks said. \"I can appreciate that because with a game like that, you don't want anything crazy to happen.\""}
{"game_id": "0021200113", "chunk_id": "0021200113_017", "order": 17, "role": "body", "text": "Kevin Durant scored a season-high 34 points and Westbrook had 17 points and 13 assists as both Oklahoma City All-Stars logged more than 42 minutes for the second straight game while trying to lead a fourth-quarter comeback from a double-digit deficit."}
{"game_id": "0021200113", "chunk_id": "0021200113_018", "order": 18, "role": "body", "text": "Each played 44 minutes in a come-from-behind win Monday at Detroit, contributing to a 13-0 run to start the fourth quarter and dig out of an 11-point hole."}
{"game_id": "0021200113", "chunk_id": "0021200113_020", "order": 20, "role": "body", "text": "\"Every game is important for us. That's how we always view our games. We have 82 big games a year. We have to give everything we have each game and not worry about saving anything for the next game,\" Brooks said."}
{"game_id": "0021200113", "chunk_id": "0021200113_021", "order": 21, "role": "body", "text": "Marc Gasol chipped in 14 points as the Grizzlies continued the best start in franchise history and moved to 7-1. They took control by outscoring Oklahoma City by 21 in the second quarter, and never gave it up."}
{"game_id": "0021200113", "chunk_id": "0021200113_022", "order": 22, "role": "body", "text": "Quincy Pondexter contributed 13 points and Jerryd Bayless scored 12 as Memphis came out ahead in a tussle between teams with retooled benches. The Grizzlies let O.J. Mayo leave in free agency and the Thunder traded Sixth Man of the Year James Harden to Houston."}
{"game_id": "0021200113", "chunk_id": "0021200113_023", "order": 23, "role": "body", "text": "Kevin Martin, who's filling Harden's old role, had a season-low seven points on just four shots."}
{"game_id": "0021200113", "chunk_id": "0021200113_024", "order": 24, "role": "body", "text": "Pondexter and the second unit brought the Grizzlies back after they'd fallen behind 30-20 after the first quarter, getting held to just 32 percent from the field. Pondexter hit a pair of 3-pointers and a couple free throws during a 16-6 burst to start the second quarter, and Memphis kept rolling as the starters rotated back in."}
{"game_id": "0021200113", "chunk_id": "0021200113_025", "order": 25, "role": "body", "text": "Another Pondexter 3 put Memphis ahead 44-41 and the Grizzlies scored the final 10 points of the half, including a two-handed dunk by Gay off of Pondexter's alley-oop, to go up 56-45."}
{"game_id": "0021200113", "chunk_id": "0021200113_026", "order": 26, "role": "body", "text": "In all, the Thunder were outscored 36-15 in the second quarter while taking their turn making just 32 percent of their shots."}
{"game_id": "0021200113", "chunk_id": "0021200113_027", "order": 27, "role": "body", "text": "Memphis led by as much as 16 in the first 3 minutes of the second half."}
{"game_id": "0021200113", "chunk_id": "0021200113_028", "order": 28, "role": "body", "text": "\"We're doing it by committee, the whole entire team. Not just the bench, not just the starters. I think collectively we're doing a really good job right now,\" Pondexter said. \"We just have to keep this going."}
{"game_id": "0021200113", "chunk_id": "0021200113_029", "order": 29, "role": "body", "text": "\"I think everyone on this team is really all in, all focused and that's just helping us out right now.\""}
{"game_id": "0021200113", "chunk_id": "0021200113_030", "order": 30, "role": "closing", "text": "Game notes Gasol also got a technical in the third quarter for taking the ball out of the net and raking it across Westbrook's face after a basket by Westbrook. ... The Grizzlies had just one turnover in the first half -- when Bayless failed to connect with Gasol on a pass into the lane and Ibaka came away with it. ... Oklahoma City reserve Hasheem Thabeet spent a few moments at halftime chatting with ex-teammates and staff on the Memphis sideline. \"I'm happy that he's still in the league and happy that he's doing well,\" Hollins said."}
