{"game_id": "0021700896", "chunk_id": "0021700896_001", "order": 1, "role": "lead", "text": "DENVER --  The Houston Rockets had not been in many close games lately, though they showed they're capable of winning those, too."}
{"game_id": "0021700896", "chunk_id": "0021700896_002", "order": 2, "role": "body", "text": "James Harden had 41 points and eight rebounds, Chris Paul scored 23 points and the Rockets beat the Nuggets 119-114 on Sunday night for their 12th straight victory."}
{"game_id": "0021700896", "chunk_id": "0021700896_003", "order": 3, "role": "body", "text": "Harden had 27 in the first half and seven in the fourth quarter, when the Rockets held off a late Denver rally. Harden has scored 40 or more points nine times this season. He finished with seven assists."}
{"game_id": "0021700896", "chunk_id": "0021700896_004", "order": 4, "role": "body", "text": "\"We haven't been in too many close games but it was cool to have that feel,\" Paul said."}
{"game_id": "0021700896", "chunk_id": "0021700896_005", "order": 5, "role": "body", "text": "The Rockets are 21-4 since Dec. 29 and own the best record (46-13) in the NBA. They are outscoring teams by an average of 12.5 points during the 12-game winning streak. The five-point win Sunday was their closest game during the streak, although Houston was up big early in the fourth."}
{"game_id": "0021700896", "chunk_id": "0021700896_006", "order": 6, "role": "body", "text": "\"Having a 17-point lead in the fourth quarter, we've got to finish games off like that,\" Harden said. \"It was a good thing we finished the game off the right way down the stretch. We got stops when we needed to and we made shots.\""}
{"game_id": "0021700896", "chunk_id": "0021700896_007", "order": 7, "role": "body", "text": "Nikola Jokic had 21 points and 14 rebounds for Denver, which had its four-game winning streak snapped. Will Barton added 25 points."}
{"game_id": "0021700896", "chunk_id": "0021700896_008", "order": 8, "role": "body", "text": "\"Obviously the first two times we played that team the game was not even close, so to make it a game and to fight all the way to the end was great to see,\" Nuggets coach Michael Malone said. \"I thought the game was decided in the last two minutes of the first quarter.\""}
{"game_id": "0021700896", "chunk_id": "0021700896_009", "order": 9, "role": "body", "text": "That was when Harden took over. He scored 14 points in the last 2:47 of the period and assisted on Houston's other two baskets to end the period, when the Rockets extended the lead from five to 13."}
{"game_id": "0021700896", "chunk_id": "0021700896_010", "order": 10, "role": "body", "text": "Houston led by as many as 18 but Denver rallied in the fourth. Jokic's tip with 2:12 left made it 110-106 and after Joe Johnson missed from the corner, Gary Harris had a chance to cut it to a point with a 3-pointer. But the Nuggets' leading scorer, who finished with six points on 2-of-12 shooting, misfired and Harden hit two more free throws to make it 112-106 with 1:17 left."}
{"game_id": "0021700896", "chunk_id": "0021700896_011", "order": 11, "role": "body", "text": "His step-back jumper with 46 seconds left clinched it for Houston."}
{"game_id": "0021700896", "chunk_id": "0021700896_012", "order": 12, "role": "body", "text": "\"Those guys play hard, they play really well here, too,\" Paul said. \"Mike does a great job of letting those guys play. They play free, they play hard and they play together. That's why the game was the way it was.\""}
{"game_id": "0021700896", "chunk_id": "0021700896_014", "order": 14, "role": "body", "text": "Rockets: Harden was fouled three times on 3-point attempts and converted one four-point play. ... G Eric Gordon missed his second straight game due to illness and third overall. ... C Nene did not play against his former team. Nene is being rested on back-to-back games and will play Monday in Utah."}
{"game_id": "0021700896", "chunk_id": "0021700896_015", "order": 15, "role": "body", "text": "Nuggets: Jamal Murray had 19 points. ... Jokic was two assists shy of his fourth consecutive triple-double. ... G Devin Harris had four fouls in four minutes of the first half. The Rockets scored 12 points on those plays. ... F Torrey Craig missed his second straight game a left hamstring strain and hasn't played in the last four overall."}
{"game_id": "0021700896", "chunk_id": "0021700896_016", "order": 16, "role": "body", "text": "DIFFERENT DEFENSE, SAME RESULT"}
{"game_id": "0021700896", "chunk_id": "0021700896_017", "order": 17, "role": "body", "text": "The Nuggets lost by 25 and 30 points in Houston earlier this season, so they changed how they guarded the Rockets on Sunday by switching more on defense. Harden found himself going against the 7-foot Jokic and 6-11 Mason Plumlee a lot of the night. The new look didn't bother him."}
{"game_id": "0021700896", "chunk_id": "0021700896_018", "order": 18, "role": "body", "text": "\"We've seen a lot of defenses, and no matter who they put on James it's a pretty good chance he's going to score,\" Trevor Ariza said. \"We give him the ball and let him make plays. It's been working out for us.\""}
{"game_id": "0021700896", "chunk_id": "0021700896_020", "order": 20, "role": "body", "text": "With Houston ahead 106-99 and 4:51 left, Ariza tried to save a ball off Harden's miss as it went into the crowd, but a fan sitting courtside grabbed the ball before he could get to it. Ariza pleaded with the referee that he had a chance to save it and then had a lighthearted exchange with the fan."}
{"game_id": "0021700896", "chunk_id": "0021700896_021", "order": 21, "role": "body", "text": "\"I think I probably could have gotten to it but he got to it first,\" Ariza said with a laugh. \"It was all in good fun. He probably didn't think I was going to go after it.\""}
{"game_id": "0021700896", "chunk_id": "0021700896_022", "order": 22, "role": "body", "text": "The man got a cheer from the sellout crowd and a hand slap from Jokic as the center walked by."}
{"game_id": "0021700896", "chunk_id": "0021700896_024", "order": 24, "role": "body", "text": "Rockets: At Utah on Monday night."}
{"game_id": "0021700896", "chunk_id": "0021700896_025", "order": 25, "role": "closing", "text": "Nuggets: Host the L.A. Clippers on Tuesday night."}
