{"game_id": "0021700254", "chunk_id": "0021700254_001", "order": 1, "role": "lead", "text": "CLEVELAND --  LeBron James got stitches and then sliced Brooklyn open by himself."}
{"game_id": "0021700254", "chunk_id": "0021700254_002", "order": 2, "role": "body", "text": "James scored 23 of his 33 points in the fourth quarter -- including 18 straight for Cleveland -- and the Cavaliers won their sixth straight, 119-109 over the Nets on Wednesday night."}
{"game_id": "0021700254", "chunk_id": "0021700254_003", "order": 3, "role": "body", "text": "After he was accidentally \"head-butted\" by Brooklyn's Tyler Zeller in the third quarter, James went to the locker room, where Cleveland's medical staff closed the gash above his lip."}
{"game_id": "0021700254", "chunk_id": "0021700254_004", "order": 4, "role": "body", "text": "James punched back in the fourth."}
{"game_id": "0021700254", "chunk_id": "0021700254_005", "order": 5, "role": "body", "text": "\"Just trying to make plays, be assertive, help my team win,\" he said when asked what got into him. \"Blessed to be able to make a couple down the stretch.\""}
{"game_id": "0021700254", "chunk_id": "0021700254_006", "order": 6, "role": "body", "text": "He hardly missed, going 7 of 8 from the field in the final 12 minutes."}
{"game_id": "0021700254", "chunk_id": "0021700254_007", "order": 7, "role": "body", "text": "Kevin Love broke a 99-all tie on a free throw with 4:50 left and James took over, delivering a one-man show with an assortment of shots, power moves and clutch jumpers."}
{"game_id": "0021700254", "chunk_id": "0021700254_008", "order": 8, "role": "body", "text": "James began the dominating run with a pair of free throws and followed with a couple left-handed shots and then drained two 3-pointers -- the last a step-back with 55 seconds left to give Cleveland a 118-107 lead."}
{"game_id": "0021700254", "chunk_id": "0021700254_009", "order": 9, "role": "body", "text": "James said it wasn't his intent to take over. It just happened."}
{"game_id": "0021700254", "chunk_id": "0021700254_010", "order": 10, "role": "body", "text": "\"You can't force it,\" said James, who missed a wide-open dunk in the first half. \"You've got to let it come to you. It's times when you wish you can do it and sometimes the ball just doesn't go in. But I put a lot of work into my craft and I believe that every shot I take is going to go in.\""}
{"game_id": "0021700254", "chunk_id": "0021700254_011", "order": 11, "role": "body", "text": "The sublime solo performance enabled the Cavs to avenge a 112-107 loss in Brooklyn last month, an upset that began a four-game slide for Cleveland and led to questions about whether the Eastern Conference champions were finished."}
{"game_id": "0021700254", "chunk_id": "0021700254_012", "order": 12, "role": "body", "text": "Love and Dwyane Wade added 18 points apiece for Cleveland, which moved four games over .500."}
{"game_id": "0021700254", "chunk_id": "0021700254_013", "order": 13, "role": "body", "text": "When James gets in a zone like he did, Love said there's one thing to do."}
{"game_id": "0021700254", "chunk_id": "0021700254_014", "order": 14, "role": "body", "text": "\"Sometimes it's being aggressive and picking your spots and other times it's, `Get the hell out of the way,\" he said. \"That was a special fourth-quarter performance, but it seems like he's always done that. But this year in particular he's done an incredible job of doing that for us.\""}
{"game_id": "0021700254", "chunk_id": "0021700254_015", "order": 15, "role": "body", "text": "Rondae Hollis-Jefferson scored 20 and Joe Harris 18 for the Nets, who could do nothing in the final 12 minutes to stop James."}
{"game_id": "0021700254", "chunk_id": "0021700254_016", "order": 16, "role": "body", "text": "\"LeBron really took over,\" Nets coach Kenny Atkinson said. \"There's no other way to put it. We didn't ever find a solution to stop him in the fourth quarter. We were trying different stuff. I guess we could have trapped him, but he's such a great passer we didn't want to give up 3s. We tried different things. We tried playing our normal defense and then we tried switching. He kind of picks out the guy he wants to go at.\""}
{"game_id": "0021700254", "chunk_id": "0021700254_018", "order": 18, "role": "body", "text": "Nets: C Trevor Booker (sprained left ankle) did not play. He was injured Sunday against Golden State. ... G Spencer Dinwiddie started his fourth straight game in place of injured G D'Angelo Russell (left knee surgery). ... Brooklyn has lost nine straight in Cleveland."}
{"game_id": "0021700254", "chunk_id": "0021700254_019", "order": 19, "role": "body", "text": "Cavaliers: When he left to get stitched up, James only had eight points and his streak of double-digit games appeared in jeopardy. But he scored on a layup in the third, giving him 809 straight regular-season games with at least 10s. Michael Jordan has the record with 866. ... Coach Tyronn Lue said the team is targeting Monday's game in Philadelphia for G Iman Shumpert (sore left knee) to return. He's missed the last two games. ... James became the 26th player to make 1,500 3-pointers."}
{"game_id": "0021700254", "chunk_id": "0021700254_021", "order": 21, "role": "body", "text": "Cleveland built a nine-point lead in the first quarter and seemed ready to build on it when James made a surprising mistake."}
{"game_id": "0021700254", "chunk_id": "0021700254_022", "order": 22, "role": "body", "text": "Alone in the frontcourt for a dunk, James tried to showboat and rocketed the ball off the back of the rim, a miss that stunned him and 20,000-plus fans. James forced a long 3 on Cleveland's next possession and the Cavs went into an overall funk."}
{"game_id": "0021700254", "chunk_id": "0021700254_023", "order": 23, "role": "body", "text": "Lue said the blow to James' face woke up the superstar."}
{"game_id": "0021700254", "chunk_id": "0021700254_024", "order": 24, "role": "body", "text": "\"It was good because he was messing around,\" Lue said."}
{"game_id": "0021700254", "chunk_id": "0021700254_026", "order": 26, "role": "body", "text": "The Isaiah Thomas comeback is getting closer."}
{"game_id": "0021700254", "chunk_id": "0021700254_027", "order": 27, "role": "body", "text": "The All-Star point guard took some contact during a rigorous workout at the team's morning shootaround. Thomas has been ramping up his activity, running harder and appears to be ahead of schedule to make his debut with Cleveland. Originally, the Cavs forecast he would be playing in games by the end of December but there's a sense it could be sooner."}
{"game_id": "0021700254", "chunk_id": "0021700254_029", "order": 29, "role": "body", "text": "Nets: Host Portland on Friday."}
{"game_id": "0021700254", "chunk_id": "0021700254_030", "order": 30, "role": "body", "text": "Cavaliers: Host Charlotte on Friday. Cleveland has won seven straight over the Hornets."}
{"game_id": "0021700254", "chunk_id": "0021700254_032", "order": 32, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
