{"game_id": "0021200188", "chunk_id": "0021200188_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Richard Hamilton and Carlos Boozer were back on the court during the fourth quarter, and it paid off for the Chicago Bulls."}
{"game_id": "0021200188", "chunk_id": "0021200188_002", "order": 2, "role": "body", "text": "Hamilton scored a season-high 22 points, Boozer had 22 points and 19 rebounds, and the veterans helped the Bulls hold off the Milwaukee Bucks 93-86 to break a three-game losing streak."}
{"game_id": "0021200188", "chunk_id": "0021200188_003", "order": 3, "role": "body", "text": "The win by the Bulls was the ninth straight over the Bucks and the fifth straight at the Bradley Center. The last time Milwaukee beat Chicago was on April 10, 2010, in Chicago."}
{"game_id": "0021200188", "chunk_id": "0021200188_004", "order": 4, "role": "body", "text": "\"It was nice to be out there and help this team get a win,\" said Hamilton, who scored 18 in the first half. \"It was a lot of fun out there tonight. It was a game we needed to win.\""}
{"game_id": "0021200188", "chunk_id": "0021200188_005", "order": 5, "role": "body", "text": "Boozer grabbed eight offensive rebounds to help the Bulls outrebound the Bucks 54-40. He had scored a total of 17 points in his last two games."}
{"game_id": "0021200188", "chunk_id": "0021200188_006", "order": 6, "role": "body", "text": "\"We hung in there tonight and really did a good job in the fourth quarter of getting some stops,\" he said. \"We were hustling tonight and that was the key to getting a lot of our second opportunities.\""}
{"game_id": "0021200188", "chunk_id": "0021200188_007", "order": 7, "role": "body", "text": "Boozer has not been on the court lately in the fourth quarter, but said that was OK with him."}
{"game_id": "0021200188", "chunk_id": "0021200188_008", "order": 8, "role": "body", "text": "\"I just go with the flow,\" he said. \"It's his (coach Tom Thibodeau's) show. He runs it.\""}
{"game_id": "0021200188", "chunk_id": "0021200188_009", "order": 9, "role": "body", "text": "Despite his team's recent success against the Bucks, Thibodeau said the matchups are always tough games."}
{"game_id": "0021200188", "chunk_id": "0021200188_010", "order": 10, "role": "body", "text": "\"When we play them, these games can go either way,\" he said. \"They're hard-fought and tough. We've been fortunate to come out this way, but they're really good.\""}
{"game_id": "0021200188", "chunk_id": "0021200188_011", "order": 11, "role": "body", "text": "For Milwaukee, the loss was the third straight after opening the season by winning six of its first eight games. The team also received a scare when star guard Brandon Jennings went down late in the game with an ankle injury."}
{"game_id": "0021200188", "chunk_id": "0021200188_012", "order": 12, "role": "body", "text": "Afterward, Jennings said he rolled his ankle and sprained it, but it was not broken. He hopes to play Monday when the Bucks play the Bulls again in Chicago."}
{"game_id": "0021200188", "chunk_id": "0021200188_013", "order": 13, "role": "body", "text": "\"It's really sore,\" he said as he looked down at the ice bag on his ankle. \"It is the same one I had surgery on so I was nervous. But I think everything will be OK.\""}
{"game_id": "0021200188", "chunk_id": "0021200188_014", "order": 14, "role": "body", "text": "Jennings led the Bucks with 23 points. He said he was getting frustrated with the fact that the Bucks can't beat the Bulls in recent meetings."}
{"game_id": "0021200188", "chunk_id": "0021200188_015", "order": 15, "role": "body", "text": "\"It seems to always come down to the last few possessions and we just can't get it done,\" he said. \"We have to turn that around on Monday.\""}
{"game_id": "0021200188", "chunk_id": "0021200188_016", "order": 16, "role": "body", "text": "The Bucks were just 3 of 17 from 3-point range."}
{"game_id": "0021200188", "chunk_id": "0021200188_017", "order": 17, "role": "body", "text": "\"It was kind of a grind-it-out game and when it really came time to grind it out, they did it to us,\" Bucks coach Scott Skiles said. \"They got all the boards and pushed us around. They took it from us.\""}
{"game_id": "0021200188", "chunk_id": "0021200188_019", "order": 19, "role": "body", "text": "Down six midway through the fourth quarter, the Bucks fought back and Ellis hit 16-foot jumper with 5:22 remaining to tie it at 81."}
{"game_id": "0021200188", "chunk_id": "0021200188_020", "order": 20, "role": "body", "text": "Nate Robinson and Boozer scored to give the Bulls an 85-81 lead with 4:07 remaining. Larry Sanders dunked to cut the lead to two with 3:46 remaining."}
{"game_id": "0021200188", "chunk_id": "0021200188_021", "order": 21, "role": "body", "text": "Luol Deng tipped in a missed shot, but Mike Dunleavy scored on a layup to cut the score to 87-85 with 1:56 remaining."}
{"game_id": "0021200188", "chunk_id": "0021200188_022", "order": 22, "role": "body", "text": "Ellis missed an 11-foot jumper with 52 seconds remaining. But Boozer grabbed a missed layup by Joakim Noah and dunked the ball to give the Bulls an 89-85 lead with 29 seconds remaining."}
{"game_id": "0021200188", "chunk_id": "0021200188_023", "order": 23, "role": "body", "text": "Jennings then lost the ball as he drove to the basket and it was grabbed by Noah. Jennings hurt his ankle on the play. The Bulls hit four free throws down the stretch to close out the game."}
{"game_id": "0021200188", "chunk_id": "0021200188_024", "order": 24, "role": "closing", "text": "Game notes Skiles inserted center Joel Przybilla into the starting lineup for the first time this season. Przybilla, who had not played in seven of the Bucks' first 10 games this season, replaced Samuel Dalembert. Bulls forward Jimmy Butler, who played for Marquette University, received a nice ovation when he entered the game in the second quarter. Butler scored six points and grabbed seven rebounds...The Bulls outscored the Bucks in second-chance points 25-5."}
