{"game_id": "0021700967", "chunk_id": "0021700967_001", "order": 1, "role": "lead", "text": "CHICAGO --  The Chicago Bulls envision Lauri Markkanen, Zach LaVine and Kris Dunn leading them to tight wins -- someday in bigger spots than this."}
{"game_id": "0021700967", "chunk_id": "0021700967_002", "order": 2, "role": "body", "text": "Markkanen scored 22 points, LaVine and Dunn added 21 apiece, and Chicago hung on to hand the Memphis Grizzlies their 15th straight loss, 119-110 on Wednesday night."}
{"game_id": "0021700967", "chunk_id": "0021700967_003", "order": 3, "role": "body", "text": "The Bulls had a 21-point lead whittle to one but came away with their fourth win in 18 games."}
{"game_id": "0021700967", "chunk_id": "0021700967_004", "order": 4, "role": "body", "text": "\"Everybody wants to see, `Are these guys for real? Are they capable of playing at a high level each and every night?\" Dunn said."}
{"game_id": "0021700967", "chunk_id": "0021700967_005", "order": 5, "role": "body", "text": "Dunn scored 11 in the fourth quarter and made four free throws in the final 33.7 seconds to help Chicago come out on top."}
{"game_id": "0021700967", "chunk_id": "0021700967_006", "order": 6, "role": "body", "text": "Bobby Portis had 15 points and 10 rebounds. Justin Holiday scored 14 points in 17 minutes -- going 5 for 5 from the field and nailing four 3-pointers -- after the NBA prodded the Bulls to start playing him and Robin Lopez again."}
{"game_id": "0021700967", "chunk_id": "0021700967_007", "order": 7, "role": "body", "text": "Memphis' Dillon Brooks scored 20 of his 29 points in the fourth quarter. Marc Gasol and Ben McLemore added 17 apiece, but the Grizzlies couldn't snap the NBA's longest skid this season."}
{"game_id": "0021700967", "chunk_id": "0021700967_008", "order": 8, "role": "body", "text": "\"I was trying to do everything in my power to bring the team back,\" said Brooks, who got screamed at by coach J.B. Bickerstaff at halftime. \"We were right there. We just got to make better plays for each other, smart plays, careful passes. We just had too many turnovers and we dug ourselves a big hole.\""}
{"game_id": "0021700967", "chunk_id": "0021700967_010", "order": 10, "role": "body", "text": "Grizzlies: The Grizzlies did not use Gasol in the fourth quarter and went with Deyonta Davis instead. Bickerstaff said he \"didn't want to disrupt the rhythm\" of the group that led Memphis back into the game. Gasol, who has expressed frustration lately, walked out of the locker room whistling with his headphones on and did not make himself available to reporters. ... F Chandler Parsons missed the game for personal reasons. ... Memphis has dropped 13 in a row on the road since winning at Sacramento on Dec. 31."}
{"game_id": "0021700967", "chunk_id": "0021700967_011", "order": 11, "role": "body", "text": "Bulls: Dunn had nine assists and three steals. ... Chicago outscored Memphis in second-chance points (17-12), fast-break points (16-13) and points in the paint (56-44) -- the fifth time this season the Bulls led in all three categories."}
{"game_id": "0021700967", "chunk_id": "0021700967_013", "order": 13, "role": "body", "text": "The Bulls led by 21 midway through the third quarter and were up by 15 going into the fourth before the Grizzlies went on a run."}
{"game_id": "0021700967", "chunk_id": "0021700967_014", "order": 14, "role": "body", "text": "Back-to-back 3-pointers by Brooks cut it to 94-93. He then nailed a fadeaway jumper after Portis drove for a layup, making it 96-95 with 6:46 remaining."}
{"game_id": "0021700967", "chunk_id": "0021700967_015", "order": 15, "role": "body", "text": "The Bulls answered with a 10-2 run. Brooks hit a floater and two 3-pointers to pull the Grizzlies back within one with just under three minutes left, but the Bulls hung on."}
{"game_id": "0021700967", "chunk_id": "0021700967_016", "order": 16, "role": "body", "text": "David Nwaba grabbed the rebound after Memphis' Xavier Rathan-Mayes missed a potential tying 3, and Dunn drove for a layup to bump the lead to 113-108 with 1:31 to play."}
{"game_id": "0021700967", "chunk_id": "0021700967_018", "order": 18, "role": "body", "text": "While Lopez sat out his seventh straight game, Holiday made an immediate impact after being held out of five of the previous six. He scored nine points in the game's first 8 1/2 minutes, making all three 3-pointers before Denzel Valentine replaced him."}
{"game_id": "0021700967", "chunk_id": "0021700967_019", "order": 19, "role": "body", "text": "\"I just wanted to try to come out and be aggressive,\" he said."}
{"game_id": "0021700967", "chunk_id": "0021700967_020", "order": 20, "role": "body", "text": "Coach Fred Hoiberg said Holiday and Lopez will start Friday at Detroit."}
{"game_id": "0021700967", "chunk_id": "0021700967_022", "order": 22, "role": "body", "text": "The Bulls had some high-ranking visitors, with No. 4 Michigan State in town during a lull in the schedule."}
{"game_id": "0021700967", "chunk_id": "0021700967_023", "order": 23, "role": "body", "text": "With the school on spring break and the Big Ten tournament last week, the Spartans worked out at Chicago's practice facility and took in the game on Wednesday."}
{"game_id": "0021700967", "chunk_id": "0021700967_024", "order": 24, "role": "body", "text": "Hoiberg's son Jack is a freshman walk-on. He said he was the only Bulls official allowed by the NBA to watch practice."}
{"game_id": "0021700967", "chunk_id": "0021700967_025", "order": 25, "role": "body", "text": "\"To be honest I wasn't in there much, just a little in the beginning and then I went into my office and finished my prep for tonight's game,\" Hoiberg said."}
{"game_id": "0021700967", "chunk_id": "0021700967_026", "order": 26, "role": "body", "text": "Valentine and Memphis backup C Deyonta Davis played at Michigan State."}
{"game_id": "0021700967", "chunk_id": "0021700967_028", "order": 28, "role": "body", "text": "Grizzlies: Host Utah on Friday."}
{"game_id": "0021700967", "chunk_id": "0021700967_029", "order": 29, "role": "body", "text": "Bulls: Visit Detroit on Friday."}
{"game_id": "0021700967", "chunk_id": "0021700967_031", "order": 31, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
