{"game_id": "0021701188", "chunk_id": "0021701188_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Sacramento Kings guard Bogdan Bogdanovic acknowledged he didn't have a very good night against the Memphis Grizzlies."}
{"game_id": "0021701188", "chunk_id": "0021701188_002", "order": 2, "role": "body", "text": "Until the game's closing seconds."}
{"game_id": "0021701188", "chunk_id": "0021701188_003", "order": 3, "role": "body", "text": "Bogdanovic knocked down a 16-footer with just over a second remaining, then tipped the ensuing Memphis inbounds pass to help Sacramento escape with a 94-93 victory Friday night."}
{"game_id": "0021701188", "chunk_id": "0021701188_004", "order": 4, "role": "body", "text": "Bogdanovic saved the Kings from blowing a double-digit lead in the final four minutes and salvaged a night where the rookie guard from Serbia was 4 of 11 from the field, including missing all five of his 3-pointers for eight points."}
{"game_id": "0021701188", "chunk_id": "0021701188_005", "order": 5, "role": "body", "text": "\"It felt good, honestly, especially when you have a bad night like I had in terms of trying to find a rhythm on offense,\" Bogdanovic said of the final shot, later adding: \"I've been working on these shots, so sometimes you make it, sometimes not.\""}
{"game_id": "0021701188", "chunk_id": "0021701188_006", "order": 6, "role": "body", "text": "Bogdanovic's jumper capped a close game between two teams near the bottom of the Western Conference standings -- a game that saw four lead changes in the final minute. Dillon Brooks had given Memphis a 93-92 lead 6 seconds before Bogdanovic's game-winner, and after a corner 3-pointer from Justin Jackson with 17 seconds left."}
{"game_id": "0021701188", "chunk_id": "0021701188_007", "order": 7, "role": "body", "text": "\"I think the guys defended it well,\" Memphis interim coach J.B. Bickerstaff said, adding that both shots were contested, \"but you've got to give them credit, they made good offensive plays.\""}
{"game_id": "0021701188", "chunk_id": "0021701188_008", "order": 8, "role": "body", "text": "Willie Cauley-Stein led the Kings with 18 points, Buddy Hield finished with 14, and De'Aaron Fox and Jackson each scored 13."}
{"game_id": "0021701188", "chunk_id": "0021701188_009", "order": 9, "role": "body", "text": "MarShon Brooks had 23 points for Memphis, while Dillon Brooks added 16."}
{"game_id": "0021701188", "chunk_id": "0021701188_010", "order": 10, "role": "body", "text": "Memphis, which trailed 87-77 with about 4 minutes left, clicked off 10 straight points to tie the game. The teams exchanged leads the rest of the way until Bogdanovic's winner."}
{"game_id": "0021701188", "chunk_id": "0021701188_011", "order": 11, "role": "body", "text": "\"Not a real pretty game, but the last two minutes were a lot of fun to be part of,\" Kings coach Dave Joerger said. \"Certainly, it was exciting with both teams making shots. . It was shot-for-shot coming down the stretch.\""}
{"game_id": "0021701188", "chunk_id": "0021701188_013", "order": 13, "role": "body", "text": "Kings: Cauley-Stein hit his first five shots in the game. He has reached double figures in the last six games. . Missed all six of their 3-pointers in the first half and finished 6 of 24 from outside the arc. .The victory was only the second for Sacramento in the last 16 road games against the Grizzlies."}
{"game_id": "0021701188", "chunk_id": "0021701188_014", "order": 14, "role": "body", "text": "Grizzlies: Brooks entered the game averaging 23.3 points in his three games since signing a 10-day contract with the team. He signed a multiyear deal with Memphis earlier Friday. ... Rookie C Ivan Rabb had 12 points and 11 rebounds, recording his second double-double. ... Played with eight players sitting out, including Marc Gasol (rest), Tyreke Evans (not with team/personal reasons) among others. ... Used their 34th starting lineup of the season."}
{"game_id": "0021701188", "chunk_id": "0021701188_016", "order": 16, "role": "body", "text": "Kings F Zach Randolph missed his eighth straight game, the last four listed as personal reasons. However, he did come to the Kings bench about 2 minutes into the game, drawing applause from Memphis fans. Randolph played seven years with the Grizzlies before signing with Sacramento in the off season. He spent several timeouts meeting with former teammates Mike Conley Jr. and Marc Gasol, neither of whom played Friday night, while waving and shaking hands with fans."}
{"game_id": "0021701188", "chunk_id": "0021701188_018", "order": 18, "role": "body", "text": "The Kings outrebounded Memphis 42-38, including a 22-13 advantage in the second half. Sacramento converted 6 of 18 shots from outside the arc after intermission, and, while not great, it was better than Memphis making 3 of 13."}
{"game_id": "0021701188", "chunk_id": "0021701188_020", "order": 20, "role": "body", "text": "Kings: Play their final road game of the season on Monday at San Antonio."}
{"game_id": "0021701188", "chunk_id": "0021701188_021", "order": 21, "role": "body", "text": "Grizzlies: Host the Detroit Pistons in their home finale on Sunday."}
{"game_id": "0021701188", "chunk_id": "0021701188_023", "order": 23, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
