{"game_id": "0021700923", "chunk_id": "0021700923_001", "order": 1, "role": "lead", "text": "CLEVELAND --  First, the billboards. Now, the scoreboard."}
{"game_id": "0021700923", "chunk_id": "0021700923_002", "order": 2, "role": "body", "text": "The Philadelphia 76ers are giving LeBron James an eyeful and even more to think about."}
{"game_id": "0021700923", "chunk_id": "0021700923_003", "order": 3, "role": "body", "text": "J.J. Redick scored 22 points, Joel Embiid had 17 points and 14 rebounds, and the 76ers delivered an in-person sales pitch to James by beating the Cleveland Cavaliers 108-97 on Thursday night to end an 11-game losing streak against the Eastern Conference champions."}
{"game_id": "0021700923", "chunk_id": "0021700923_004", "order": 4, "role": "body", "text": "Rookie Ben Simmons scored 18 and Dario Saric 16, including a critical 3-pointer in the closing minutes, for the rising Sixers, who are 8-2 since Feb. 6."}
{"game_id": "0021700923", "chunk_id": "0021700923_005", "order": 5, "role": "body", "text": "James finished with 30 points, nine rebounds and eight assists, but the superstar couldn't rally the Cavs in the final minutes."}
{"game_id": "0021700923", "chunk_id": "0021700923_006", "order": 6, "role": "body", "text": "Earlier this week, three billboards urging the three-time champion to sign as a free agent this summer with Philadelphia were unveiled on a busy highway outside Cleveland. The large signs, which were paid for by a Pennsylvania company, are intended to entice James to leave home and join a Sixers team brimming with young talent and potential."}
{"game_id": "0021700923", "chunk_id": "0021700923_007", "order": 7, "role": "body", "text": "Simmons is sure James knows what's going on in Philly."}
{"game_id": "0021700923", "chunk_id": "0021700923_008", "order": 8, "role": "body", "text": "\"He knows,\" Simmons said. \"He knows. He's a very smart guy. His IQ on the court is amazing.\""}
{"game_id": "0021700923", "chunk_id": "0021700923_009", "order": 9, "role": "body", "text": "And if the rumors weren't enough, Embiid posted a photo on Twitter of him and James with the comment: \"Trust The Process??? Always a great time playing against one of the best to ever play the game (hash)summer2018goals.\""}
{"game_id": "0021700923", "chunk_id": "0021700923_010", "order": 10, "role": "body", "text": "Philadelphia nearly blew a 13-point lead in the fourth quarter as the Cavs, who never led, got within 95-94 on Kyle Korver's 3-pointer with 2:25 left. However, the Sixers showed poise down the stretch by scoring the next eight points to seal an impressive win."}
{"game_id": "0021700923", "chunk_id": "0021700923_011", "order": 11, "role": "body", "text": "\"We're proud of the win,\" coach Brett Brown said. \"Any time you can beat a team LeBron James plays on you must have done something fairly decent. Saric's 3 really was the back-breaker.\""}
{"game_id": "0021700923", "chunk_id": "0021700923_012", "order": 12, "role": "body", "text": "Tempers flared in the closing seconds when Saric dunked and Cleveland's Jordan Clarkson threw the ball off his back. Clarkson was ejected, but that didn't stop players from jawing at each other."}
{"game_id": "0021700923", "chunk_id": "0021700923_013", "order": 13, "role": "body", "text": "Clarkson defended his actions."}
{"game_id": "0021700923", "chunk_id": "0021700923_014", "order": 14, "role": "body", "text": "\"If anybody say different, that they wouldn't have did that, that they'd have did something different, or anything else, they lying,\" he said. \"Especially if it was at that (part) of the game. They know what's up. That's it.\""}
{"game_id": "0021700923", "chunk_id": "0021700923_015", "order": 15, "role": "body", "text": "Saric insists he wasn't trying to embarrass the Cavs."}
{"game_id": "0021700923", "chunk_id": "0021700923_016", "order": 16, "role": "body", "text": "\"I was surprised,\" he said of Clarkson's reaction. \"We're NBA players. To be mad about something like that, for me, is a little bit weird, but I want to apologize to the organization, to them and to the fans.\""}
{"game_id": "0021700923", "chunk_id": "0021700923_017", "order": 17, "role": "body", "text": "After the final horn, James walked to Philadelphia's end of the floor and to hug both Simmons and Embiid, embraces that had to make Cleveland fans cringe."}
{"game_id": "0021700923", "chunk_id": "0021700923_018", "order": 18, "role": "body", "text": "James was asked what kind of a matchup problem is the 6-foot-10 Simmons, who added nine rebounds and eight assists."}
{"game_id": "0021700923", "chunk_id": "0021700923_019", "order": 19, "role": "body", "text": "\"The same one I bring,\" he said. \"Power, speed, quickness, size, court awareness. Same one I bring.\""}
{"game_id": "0021700923", "chunk_id": "0021700923_021", "order": 21, "role": "body", "text": "James had a jaw-dropping, behind-the-back dribble in traffic that went between Tristan Thompson's legs before he scored and was fouled. James looked up and watched the replay before shooting his free throw, but he didn't know all the details of the play until halftime."}
{"game_id": "0021700923", "chunk_id": "0021700923_022", "order": 22, "role": "body", "text": "\"One of my guys from the NBA showed me and I was like, `OK, yeah, that's probably one of the best plays I've had in my career,\" he said."}
{"game_id": "0021700923", "chunk_id": "0021700923_024", "order": 24, "role": "body", "text": "The Cavs played without starting guard J.R. Smith, who was suspended one game by the team for detrimental conduct. Smith attended the team's morning shootaround, but coach Tyronn Lue indicated something happened after the workout that led to the one-game ban. Lue expects Smith to practice Friday and play Saturday against Denver."}
{"game_id": "0021700923", "chunk_id": "0021700923_026", "order": 26, "role": "body", "text": "Cavs All-Star forward Kevin Love remains weeks away from his return, but he's making steady, significant progress. On Thursday, he did some on-court work while wearing a padded glove to protect the fracture he sustained on Jan. 29."}
{"game_id": "0021700923", "chunk_id": "0021700923_027", "order": 27, "role": "body", "text": "The Cavs have not changed their timetable on Love, who is not expected back until the final week in March. He's averaging 17.9 points and 9.4 rebounds."}
{"game_id": "0021700923", "chunk_id": "0021700923_029", "order": 29, "role": "body", "text": "In response to the (hash)PhillyWantsLeBron signs, a Cleveland marketing agency put up a digital billboard across the street from Quicken Loans Arena. The billboard says: \"Hey Philly\" written above a picture of a golden crown symbolizing James' royal \"King James\" nickname."}
{"game_id": "0021700923", "chunk_id": "0021700923_031", "order": 31, "role": "body", "text": "Sixers: Simmons was named the Eastern Conference's top rookie for February after averaging 16 points, 7.3 rebounds and 7.7 assists. He was the only rookie to average at least 16 points, seven rebounds and seven assists per game in the month, joining James, Russell Westbrook and Nikola Jokic as the only players to do it league-wide. ... F Ersan Ilyasova played 18 minutes after re-signing with Philadelphia on Wednesday. Ilyasova reached a contract buyout with Atlanta, clearing his return to the Sixers."}
{"game_id": "0021700923", "chunk_id": "0021700923_032", "order": 32, "role": "body", "text": "Cavaliers: Rodney Hood started for Smith and scored 11 on 5-of-14 shooting. ... James (927) moved past Michael Jordan (926) into fourth place for the fourth-most 20-point games. ..."}
{"game_id": "0021700923", "chunk_id": "0021700923_034", "order": 34, "role": "body", "text": "Sixers: Host Charlotte on Friday."}
{"game_id": "0021700923", "chunk_id": "0021700923_035", "order": 35, "role": "closing", "text": "Cavaliers: Host Nuggets on Saturday."}
