{"game_id": "0021400198", "chunk_id": "0021400198_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- Chris Paul said he spoke with Blake Griffin recently about getting back to what the Los Angeles Clippers do best.\nFor the team's two superstars, that means working the pick and roll.\n\"This is our fourth year together and obviously your game changes and evolves and stuff like that, but we both realize our bread and butter used to be when I would attack downhill and he was rolling to the basket,\" Paul said. \"So we are trying to mix that in more.\"\nGriffin had 22 points and a season-high 16 rebounds, Paul had 22 points and a season-high 15 assists as the Clippers handed the Charlotte Hornets their sixth straight loss 113-92 on Monday night.\nGriffin finished one assist shy of a triple-double and Paul moved past Jerry West into 25th place all-time in NBA annals in assists.\n\"I thought Blake and Chris set the tone for us on both ends and I thought that was the difference,\" said Clippers coach Doc Rivers.\nThe Clippers (8-5) outscored the Hornets by 39 points from beyond the 3-point arc.\nJamal Crawford had 21 points and J.J. Redick added 17, combining to shoot 9 of 17 from 3-point range. As a team the Clippers were 15 of 32 on 3-point attempts; the Hornets were just 2 of 20.\n\"When you see J.J. and those guys getting open 3s like that it's not because I did anything special, it's because our bigs did a great job rolling,\" Paul said.\nCody Zeller led the way for Charlotte with a career-high 17 points. Al Jefferson had 16 points and Kemba Walker 15 for the Hornets (4-11), who have lost eight of their last nine games.\nLance Stephenson, Charlotte's big free agent acquisition, was a non-factor with three points and six assists. He did not play in the fourth quarter even after Gary Neal left the game with a shoulder injury. Coach Steve Clifford said Stephenson's lack of ball movement is one of the reasons he took him out of the game.\nPaul and Walker played a game within a game, each trying to get the better of each other on various possessions.\nPaul had six assists in the opening quarter and showed off his skills in the low post by posting up Walker and scoring on a pair of turnaround jump shots over the fellow point guard.\nThat seemed to ignite Walker, who responded with a nifty crossover move that left Paul stumbling to regain his balance as he drained a step-back jumper from 17 feet. Paul didn't seem to take kindly to being shown up, knocking down an 18-footer on the ensuing possession.\nClifford said the Hornets need to keep plugging despite the losing streak.\n\"We can't lose our spirit,\" Clifford said. \"To be a good team in this league it takes a lot of things but your best players have to be prideful and hard players. Al and Kemba tonight showed again they're going to fight for this and they're going to try hard to get this turned around.\"\n---\nTIP-INS\nClippers: Matt Barnes sat out with a calf injury and Rivers said his starting forward could miss the team's next game as well.\nHornets: Forward Michael Kidd-Gilchrist remains out with a stress reaction in his foot and Clifford said he's nowhere near being close to ready to return.\nKOBE VS. MICHAEL: With Kobe Bryant approaching Michael Jordan on the all-time scoring list, Rivers was asked to weigh in who is better. \"We still have to play Kobe, so I will make my opinion when they're all out (of the league) and they can't hurt you,\" Rivers said with a laugh. \"Right now Kobe can hurt me, so I say nothing. But Michael is Michael. I mean c'mon, Michael is Michael. I saw a lot of him and like him better in a suit and tie.\"\nSTATISTICAL ODDITY: Hornets forward Marvin Williams started all 15 games and played more than 360 minutes this season before attempting his first two free throws on Monday night. He made both.\nUP NEXT\nClippers: Play at Detroit on Wednesday night.\nHornets: Host Portland on Wednesday night."}
