{"game_id": "0021401105", "chunk_id": "0021401105_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  The Memphis Grizzlies were delighted to snap out of their recent losing spell, no matter what opponent they dispatched."}
{"game_id": "0021401105", "chunk_id": "0021401105_002", "order": 2, "role": "body", "text": "Mike Conley scored 18 points, Jeff Green added 16 and the Grizzlies ended their three-game skid with a 97-83 victory over the Sacramento Kings on Monday night."}
{"game_id": "0021401105", "chunk_id": "0021401105_003", "order": 3, "role": "body", "text": "The Grizzlies moved back into the second spot in the Western Conference playoff race by a half-game over the Houston Rockets, who lost 99-96 at Toronto."}
{"game_id": "0021401105", "chunk_id": "0021401105_004", "order": 4, "role": "body", "text": "\"It's good to win. It makes things a lot easier to digest,\" said center Marc Gasol, who had eight points and 11 rebounds."}
{"game_id": "0021401105", "chunk_id": "0021401105_005", "order": 5, "role": "body", "text": "Zach Randolph added 15 points for Memphis, while Courtney Lee scored 10. Kosta Koufos grabbed a season-high 12 boards and Memphis recorded a season-high 11 blocks, including three by Koufos."}
{"game_id": "0021401105", "chunk_id": "0021401105_006", "order": 6, "role": "body", "text": "Gasol had six assists as Memphis dished out 23 on 38 field goals."}
{"game_id": "0021401105", "chunk_id": "0021401105_007", "order": 7, "role": "body", "text": "\"When you move the ball like that, it gives everybody a chance to get a feel,\" Gasol added. \"You're a lot less predictable. It gets contagious. It's the way we should always play.\""}
{"game_id": "0021401105", "chunk_id": "0021401105_008", "order": 8, "role": "body", "text": "Rudy Gay led the Kings with 24 points before leaving in the third quarter with a head injury. Ray McCallum had 12 points and Derrick Williams finished with 10."}
{"game_id": "0021401105", "chunk_id": "0021401105_009", "order": 9, "role": "body", "text": "The Kings played without leading scorer DeMarcus Cousins, who was rested by the team."}
{"game_id": "0021401105", "chunk_id": "0021401105_010", "order": 10, "role": "body", "text": "The Grizzlies had lost to Cleveland, Golden State and the Spurs, all by double digits, and the loss at San Antonio on Sunday cost them their hold on the No. 2 seed."}
{"game_id": "0021401105", "chunk_id": "0021401105_011", "order": 11, "role": "body", "text": "This time, Memphis was in a different position than during the losing streak, carrying a 56-43 lead into halftime. Memphis built at the start of the second quarter, hitting its first five shots, including a pair of 3-pointers, to build the advantage to as many as 16 before halftime."}
{"game_id": "0021401105", "chunk_id": "0021401105_012", "order": 12, "role": "body", "text": "\"We played Memphis Grizzlies basketball, which is defense,\" Koufos said. \"The bigs were up on screens and guards got through screens. That's what (helped) our offense.\""}
{"game_id": "0021401105", "chunk_id": "0021401105_013", "order": 13, "role": "body", "text": "Memphis maintained the double-digit lead through much of the third quarter, Sacramento cutting the deficit to nine only once."}
{"game_id": "0021401105", "chunk_id": "0021401105_014", "order": 14, "role": "body", "text": "The Grizzlies carried a 75-64 lead into the fourth period and regrouped after the Kings, who never led oin the game, cut the lead to eight early in the fourth."}
{"game_id": "0021401105", "chunk_id": "0021401105_015", "order": 15, "role": "body", "text": "\"We were behind from the beginning,\" Williams said. \"We kept it close until the last couple of minutes.\""}
{"game_id": "0021401105", "chunk_id": "0021401105_016", "order": 16, "role": "body", "text": "Sacramento coach George Karl acknowledged it was hard to challenge a team like Memphis with his two top players, Cousins and eventually Gay, out of the game."}
{"game_id": "0021401105", "chunk_id": "0021401105_017", "order": 17, "role": "body", "text": "\"Every time it looked like we had an opportunity, we'd bite ourselves in the butt with a bad pass or a bad decision,\" Karl said."}
{"game_id": "0021401105", "chunk_id": "0021401105_020", "order": 20, "role": "body", "text": "Kings: Sacramento has lost 10 straight road games to Memphis. ... Sacramento F/C Jason Thompson is the only player who was on the Kings roster the last time Sacramento won in Memphis in February 2009. ... Karl said resting Cousins was based on a remark from the starting center that his body was beat up. Reggie Evans started his sixth game of the season in place of Cousins."}
{"game_id": "0021401105", "chunk_id": "0021401105_021", "order": 21, "role": "body", "text": "Grizzlies: Memphis G Tony Allen missed his second game with a strained left hamstring. Coach Dave Joerger said \"there is no timetable for his return.\" ... Randolph left the game late in the fourth quarter stretching his right arm. He said afterward he hyperextended the elbow. ... Gasol missed a jumper in the first quarter and ripped his shirt at the collar like wrestler Hulk Hogan."}
{"game_id": "0021401105", "chunk_id": "0021401105_023", "order": 23, "role": "body", "text": "Gay left the game with 2:23 left in the third after an inadvertent elbow from Gasol. Gay said afterward he was all right. \"I took a shot though,\" he said. Karl said Gay must clear some tests before returning. \"I think the preliminary is he has a concussion and will have to be under concussion protocol,\" Karl said. \"I, personally, don't know what that means.\""}
{"game_id": "0021401105", "chunk_id": "0021401105_025", "order": 25, "role": "body", "text": "Kings: Visit Houston on Wednesday."}
{"game_id": "0021401105", "chunk_id": "0021401105_026", "order": 26, "role": "closing", "text": "Grizzlies: Host Oklahoma City on Friday."}
