{"game_id": "0021200711", "chunk_id": "0021200711_001", "order": 1, "role": "lead", "text": "MIAMI --  LeBron James enjoyed a career-best shooting night to help the Miami Heat keep up their dominance at home."}
{"game_id": "0021200711", "chunk_id": "0021200711_002", "order": 2, "role": "body", "text": "James scored 31 points on 13-of-14 shooting to lead Miami past Charlotte 99-94 Monday night, giving the Heat their 10th consecutive victory against the Bobcats."}
{"game_id": "0021200711", "chunk_id": "0021200711_003", "order": 3, "role": "body", "text": "According to STATS, James' effort tied for the league's third-best shooting performance with at least that many attempts in the last 18 years. Shaquille O'Neal was 15 for 16 for the Heat against Seattle on Feb. 25, 2006, and Dwight Howard was 14 for 15 for Orlando against Philadelphia on April 14, 2007."}
{"game_id": "0021200711", "chunk_id": "0021200711_004", "order": 4, "role": "body", "text": "\"I didn't plan it that way, I was just attacking when I could, got into the paint and was able to make some shots,\" said James, who made nine shots from 2 feet or closer."}
{"game_id": "0021200711", "chunk_id": "0021200711_005", "order": 5, "role": "body", "text": "Chris Bosh added 23 points and Dwyane Wade had 20 points and a season-high 12 rebounds for Miami, which has won nine of its last 10 at home. The Heat improved to 19-3 on their home floor."}
{"game_id": "0021200711", "chunk_id": "0021200711_006", "order": 6, "role": "body", "text": "\"I got a lot of my own misses, too. I was missing a lot of chippies, but I was just trying to be aggressive,\" said Wade, who tied his career-high with six offensive boards. \"When your shots aren't falling you have to find some way to affect the basketball game and give your team a chance to win.\""}
{"game_id": "0021200711", "chunk_id": "0021200711_007", "order": 7, "role": "body", "text": "Ramon Sessions scored 18 points for Charlotte, which lost its fourth in a row and 12th in the last 14. Ben Gordon had 16 points as six Bobcats players scored in double digits."}
{"game_id": "0021200711", "chunk_id": "0021200711_008", "order": 8, "role": "body", "text": "Neither team shot well on 3-pointers as Miami was 1 for 12 and Charlotte 8 of 25."}
{"game_id": "0021200711", "chunk_id": "0021200711_009", "order": 9, "role": "body", "text": "James said he \"felt a little sleepy\" but \"didn't feel tired\" when he arrived at the arena. The Heat had returned to South Florida at around 3 a.m. Monday after watching the Super Bowl in Toronto following Sunday's win against the Raptors."}
{"game_id": "0021200711", "chunk_id": "0021200711_010", "order": 10, "role": "body", "text": "His only miss was a 4-foot jumper late in the third quarter."}
{"game_id": "0021200711", "chunk_id": "0021200711_011", "order": 11, "role": "body", "text": "\"I got fouled on it, but that never stopped me before,\" James said."}
{"game_id": "0021200711", "chunk_id": "0021200711_012", "order": 12, "role": "body", "text": "James also finished with eight rebounds and eight assists. It was the 67th time in LeBron's career (including playoffs) that he's put up at least 31, 8 and 8, according to STATS."}
{"game_id": "0021200711", "chunk_id": "0021200711_013", "order": 13, "role": "body", "text": "\"If he knows and feels he's close to a triple double, he doesn't let that affect his game,\" Heat coach Erik Spoelstra said. \"He's not going to be one of those guys that will throw it off the backboard and try to get a rebound.\""}
{"game_id": "0021200711", "chunk_id": "0021200711_014", "order": 14, "role": "body", "text": "The Bobcats scored nine straight points to take a 72-69 lead with 8:30 left. Miami countered with a 14-2 run -- with James scoring six points -- to go ahead 83-74 with 4:59 remaining."}
{"game_id": "0021200711", "chunk_id": "0021200711_015", "order": 15, "role": "body", "text": "Sessions made two free throws to pull the Bobcats to 89-87 with 1:38 left, but James passed to Bosh for a dunk to make it 91-87 with 1:13 on the clock."}
{"game_id": "0021200711", "chunk_id": "0021200711_016", "order": 16, "role": "body", "text": "Following a timeout, Kemba Walker missed a 3-pointer and James grabbed a rebound, then drove for a layup to give Miami a six-point lead with 37 seconds left. Charlotte got no closer than five points the rest of the way."}
{"game_id": "0021200711", "chunk_id": "0021200711_017", "order": 17, "role": "body", "text": "\"They've been in those moments more than we we've had,\" Sessions said. \"They made the plays and we couldn't make the stops we needed in the end.\""}
{"game_id": "0021200711", "chunk_id": "0021200711_018", "order": 18, "role": "body", "text": "Charlotte played without rookie small forward Michael Kidd-Gilchrist, who suffered a concussion against Houston on Saturday night. Kidd-Gilchrist will need to pass the NBA's post-concussion protocol before he'll be cleared to play."}
{"game_id": "0021200711", "chunk_id": "0021200711_019", "order": 19, "role": "closing", "text": "Game notes Charlotte's Byron Mullens had 12 points and nine rebounds in his return from an ankle injury that forced him to miss 19 games. \"I'm still kind of concerned jumping off of it and getting hurt again.,\" he said, \"but I just have to go out there and play with full confidence and not worry about it.\" ... Heat forward Shane Battier dunked for the first time in four years early in the second quarter. \"I might release a DVD on that,\" he said. ... The Heat returned home to begin a five-game homestand after playing 10 of 12 on the road. ... James and Walker entered the game leading their respective team in scoring, assists and steals. The only other NBA players to lead their team in those categories were Golden State's Stephen Curry, Phoenix's Goran Dragic and Cleveland's Kyrie Irving."}
