{"game_id": "0021700405", "chunk_id": "0021700405_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  The Los Angeles Clippers needed someone to provide points and Lou Williams filled that role."}
{"game_id": "0021700405", "chunk_id": "0021700405_002", "order": 2, "role": "body", "text": "Williams scored 31 points Wednesday night to lead the Clippers to a 106-95 victory over the Orlando Magic."}
{"game_id": "0021700405", "chunk_id": "0021700405_003", "order": 3, "role": "body", "text": "\"We've had some guys go down with injuries and somebody has to step in and fill that scoring void,\" Williams said. \"I've been able to do it.\""}
{"game_id": "0021700405", "chunk_id": "0021700405_004", "order": 4, "role": "body", "text": "DeAndre Jordan added 16 points and 20 rebounds and the Clippers opened a four-game road trip with their third straight victory. The Clippers shot 54 percent in the second half in a matchup of injury-riddled teams."}
{"game_id": "0021700405", "chunk_id": "0021700405_005", "order": 5, "role": "body", "text": "Much of the scoring power of both teams was sidelined by injuries, and guard Austin Rivers was added to the Clippers' injury list with a concussion."}
{"game_id": "0021700405", "chunk_id": "0021700405_006", "order": 6, "role": "body", "text": "\"We don't have the luxury of talent where we're going to out-talent the other team. Every night we find somebody to help us score. Tonight Sam (Dekker) helped us. Lou was Lou,\" Clippers coach Doc Rivers said."}
{"game_id": "0021700405", "chunk_id": "0021700405_007", "order": 7, "role": "body", "text": "Jonathon Simmons scored 20 points for the Magic, who have lost 14 of 17. Mario Hezonja added 17 points and nine rebounds in his second start of the season."}
{"game_id": "0021700405", "chunk_id": "0021700405_008", "order": 8, "role": "body", "text": "Making only eight of their first 30 shots, the Clippers fell behind by 12 points midway through the second quarter. But Williams connected on three 3-pointers and Austin Rivers added one during a 14-0 run, and the Clippers (11-15) outscored Orlando 24-7 over the final seven minutes of the first half."}
{"game_id": "0021700405", "chunk_id": "0021700405_009", "order": 9, "role": "body", "text": "\"I tend to earn the trust of my coaches,\" said Williams, who made 11 of 22 shots and added eight assists. \"This is my 13th year. I'm a veteran guy. Teams that sign me understand what they're getting and I don't think it's any different for Doc.\""}
{"game_id": "0021700405", "chunk_id": "0021700405_010", "order": 10, "role": "body", "text": "Nikola Vucevic hit a mid-range jumper to put the Magic (11-18) up 55-54 midway through the third quarter, but Williams answered quickly with a basket to regain the lead for the Clippers permanently."}
{"game_id": "0021700405", "chunk_id": "0021700405_011", "order": 11, "role": "body", "text": "\"We got up 10 or 12, then didn't play with enough energy,\" said Vucevic, who had 14 points and 12 rebounds. \"There wasn't much excitement, there wasn't much going on. It was just flat out there. We could never get a good flow or good rhythm. Even if we get a block, we wouldn't run it down the court the way we can.\""}
{"game_id": "0021700405", "chunk_id": "0021700405_012", "order": 12, "role": "body", "text": "The shooting of Williams and Dekker, both of whom came off the bench, helped the Clippers expand their lead to 16 points with three minutes left."}
{"game_id": "0021700405", "chunk_id": "0021700405_013", "order": 13, "role": "body", "text": "Austin Rivers left the game in the final seconds of the first half after running into the elbow of Simmons. He did not return and will not play in the Clippers' next game."}
{"game_id": "0021700405", "chunk_id": "0021700405_015", "order": 15, "role": "body", "text": "Clippers: F Danilo Gallinari is not on the road trip due to a left glute contusion. ... F Blake Griffin missed his seventh straight game with a left MCL strain."}
{"game_id": "0021700405", "chunk_id": "0021700405_016", "order": 16, "role": "body", "text": "Magic: With F Aaron Gordon (concussion) and G Arron Afflalo (back spasms) out, the active roster included four players from the G League's Lakeland Magic. One was rookie F Wes Iwundu, who made his first NBA start. ... Rookie F Jonathan Isaac hopes to return to practice Thursday after missing 17 games with a sprained right ankle."}
{"game_id": "0021700405", "chunk_id": "0021700405_018", "order": 18, "role": "body", "text": "\"The one thing when you have all these injuries: Every game is different,\" said Doc Rivers. \"You can't plan on being the team you're going to be the next night. You've just got to figure it out during the game, play combinations you thought you'd never play and just try to steal the game.\""}
{"game_id": "0021700405", "chunk_id": "0021700405_020", "order": 20, "role": "body", "text": "Clippers: Visit Washington on Friday."}
{"game_id": "0021700405", "chunk_id": "0021700405_021", "order": 21, "role": "body", "text": "Magic: Host Portland on Friday."}
{"game_id": "0021700405", "chunk_id": "0021700405_023", "order": 23, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
