{"game_id": "0021301212", "chunk_id": "0021301212_001", "order": 1, "role": "lead", "text": "PHOENIX -- The Memphis Grizzlies are back in the playoffs and the upstart Phoenix Suns are staying home.\nMike Conley and Zach Randolph made the critical plays in the final 68 seconds and the Grizzlies pulled out a 97-91 victory over Phoenix that clinched the last playoff spot in the West and eliminated the Suns from postseason competition.\nRandolph scored 32 points to lead the inside power game that was just enough for Memphis to beat the Suns for the fourth time in four games this season.\nThere were 15 lead changes in an intense fourth quarter, with Memphis scoring the final seven after Phoenix took a 91-90 lead on Miles Plumlee's tip-in with 1:27 to play.\nConley, taking a pass from Randolph, followed with a 3-pointer that put the Grizzlies up 93-91 with 1:08 to go. It was the first go-ahead 3 of Conley's career with two minutes or less remaining in a game.\nDragic threw the ball away on Phoenix's next possession and Randolph scored the final two of his 32 points to give Memphis a 95-91 cushion with 47.4 seconds to go.\n\"It's stressful, being in a game that both teams are going back and forth,\" Conley said. \"Every time we made a play, they made a play. Give them credit, they played their hearts out. We were just able to make enough plays down the stretch.\"\nMemphis weathered 19 turnovers to win its fourth straight, a streak that began with a win over Miami.\n\"We've needed every game basically since February it seems like,\" Conley said. \"We've played every game like a playoff game. It's been fun to be part of a group that comes in and stays focused and to get back in the playoffs. It's huge from where we started off this season.\"\nThe Grizzlies were 10-15 after a loss to Dallas on Dec. 18.\n\"This is a culmination of not just this week or not just March or April, this is a culmination of everything we've been through since December,\" first-year Memphis coach David Joerger said. \"For these guys, it's a happy locker room, a relieved locker room and just a bunch of very proud guys with great chemistry.\"\nMike Miller added 21 points, Marc Gasol 17 and Conley 13 for the Grizzlies, in the playoffs for the fourth straight season.\nMarkieff Morris had 21 points, and Channing Frye scored 14. So did Dragic, playing on a sore ankle.\nThe Grizzlies can move ahead of Dallas for the No. 7 spot with a victory at home over the Mavericks in their regular-season finale Wednesday night.\nThe Suns lost their third straight to come up just short of the playoffs in a remarkable turnaround season under first-year coach Jeff Hornacek, winning 22 more games than a year ago, with one to play, after going 25-57 in 2013.\n\"It's really tough to say something positive right now,\" Dragic said. \"Nobody expected us to play so good. We built some good chemistry with this team. A lot of new faces, a lot of young guys, new coaching staff, new GM, so I think we're headed in the right direction.\n\"When you are so close to the playoffs, you always want some little bit more.\"\nPhoenix is only the fifth team in NBA history to win 47 games and not make the playoffs.\n\"These are the hardest games to win,\" Hornacek said, recalling his days as a player. \"You have to do everything right. You can't have bad stretches.\"\nThe last of Miller's five 3-pointers -- in six attempts -- put the Grizzlies 86-85 with 3:10 to go. Miles Plumlee made a 16-footer and Phoenix led 87-86, then Gasol scored on a driving layup and Memphis was on top 88-87 with 2:23 left.\nBledsoe's 15-footer gave the lead back to Phoenix, then Conley sank a 20-footer, a hint of what was about to come, to make it 90-89 Memphis. Then came Plumlee's tip-in and Phoenix's final lead.\nAn early 15-4 run put the Grizzlies up 22-11 and it was 24-14 at the end of the first quarter.\nMemphis took its biggest lead, 44-31, when Randolph converted a three-point play with 2:54 to play in the second quarter. But the Grizzlies didn't score again in the half.\nBledsoe ended the Suns' string of eight straight missed 3-pointers and Phoenix scored the final nine points of the half to cut it to 46-42 at the beak. It could have been closer. Bledsoe missed a free throw what could have been a 3-point play and, after a Memphis turnover, P.J. Tucker took an off-balance shot before the halftime buzzer when Bledsoe was wide open for a layup.\nThe Suns' run continued in the third quarter, when Phoenix outscored Memphis 11-4 to start the period and took a 53-50 lead on Channing Frye's 16-foooter. Nobody led by more than six points the rest of the quarter, with Tony Allen going coast-to-coast in the final seconds for a layup that tied it at 67 entering the fourth.\nGame notes\nThe Suns haven't made the playoffs since 2010. ... The Suns conclude their season at Sacramento on Wednesday night. ... Of Memphis' potential first-round foes, the Grizzles were 0-4 this season against San Antonio, 1-2 against Oklahoma City."}
