{"game_id": "0021200543", "chunk_id": "0021200543_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- Playing without their top offensive player, Indiana seemed assured of a low-scoring game against the Charlotte Bobcats. It appeared more certain when the Pacers missed their first 10 shots."}
{"game_id": "0021200543", "chunk_id": "0021200543_002", "order": 2, "role": "body", "text": "However, George Hill scored 19 points, D.J. Augustin had a season high-tying 18 and Indiana rallied to beat the Bobcats 96-88 Saturday night for its fourth straight win. Lance Stephenson added 17 points and David West had 14 points, 12 rebounds and a career-high 10 assists for his first triple-double."}
{"game_id": "0021200543", "chunk_id": "0021200543_003", "order": 3, "role": "body", "text": "\"That was a really good win,\" Pacers coach Frank Vogel said. \"A lot of guys stepped up, in particular David West with a triple-double.\""}
{"game_id": "0021200543", "chunk_id": "0021200543_004", "order": 4, "role": "body", "text": "The Central Division-leading Pacers, missing leading scorer Paul George (illness), won for the sixth time in seven games."}
{"game_id": "0021200543", "chunk_id": "0021200543_005", "order": 5, "role": "body", "text": "The Pacers, the NBA's second-lowest scoring offense coming in, struggled at the start as the Bobcats jumped out to a 10-1 lead with Gerald Henderson knocking down a pair of midrange jumpers."}
{"game_id": "0021200543", "chunk_id": "0021200543_006", "order": 6, "role": "body", "text": "\"We struggled to score early, but give them credit, they're a competitive team,\" Vogel said. \"They were doubling David every time he touched the ball, so we knew that would open up some 3s.\""}
{"game_id": "0021200543", "chunk_id": "0021200543_007", "order": 7, "role": "body", "text": "Ben Gordon scored a game-high 21 points to lead the Bobcats, and Kemba Walker had 16 on 5-for-9 shooting. Hakim Warrick added 13 points and seven rebounds while Henderson had 12 points on 6-for-12 shooting."}
{"game_id": "0021200543", "chunk_id": "0021200543_008", "order": 8, "role": "body", "text": "Gordon also got off to a good start, scoring nine points on 3-for-3 shooting and two free throws in the first quarter. Charlotte shot 52 percent from the field in the opening period."}
{"game_id": "0021200543", "chunk_id": "0021200543_009", "order": 9, "role": "body", "text": "Stephenson also had nine points in the first quarter for Indiana, shooting 4 for 5, to pull the Pacers to 24-23 after 12 minutes."}
{"game_id": "0021200543", "chunk_id": "0021200543_010", "order": 10, "role": "body", "text": "The Pacers shot 33 percent from the field in the first half, but had six 3-pointers while trailing 45-43 at halftime. Gerald Green hit two 3s, including one in transition, Orlando Johnson knocked one down from the right wing, and Augustin -- shooting 28.8 percent from behind the arc coming in -- made two."}
{"game_id": "0021200543", "chunk_id": "0021200543_011", "order": 11, "role": "body", "text": "Six of the Pacers' seven second-quarter field goals came from 3-point range."}
{"game_id": "0021200543", "chunk_id": "0021200543_012", "order": 12, "role": "body", "text": "\"We just did our best to fill in with Paul George out,\" West said."}
{"game_id": "0021200543", "chunk_id": "0021200543_013", "order": 13, "role": "body", "text": "Warrick's 17-footer with 5.8 seconds left gave Charlotte the two-point edge at the break."}
{"game_id": "0021200543", "chunk_id": "0021200543_014", "order": 14, "role": "body", "text": "Bismack Biyombo and Warrick led the way for the Broncos early in the third as they pushed the lead to 56-51. Indiana, however, answered with a 13-2 run to go up 64-56, and the Pacers didn't trail again."}
{"game_id": "0021200543", "chunk_id": "0021200543_015", "order": 15, "role": "body", "text": "Michael Kidd-Gilchrist knocked down a short jumper to pull the Bobcats within three points when the Pacers went on a 11-3 run that included a one-handed power dunk from Stephenson and a 3 in the corner from Hill."}
{"game_id": "0021200543", "chunk_id": "0021200543_016", "order": 16, "role": "body", "text": "Stephenson put the crowd on their feet for a final ovation with a fast-break dunk in the final seconds."}
{"game_id": "0021200543", "chunk_id": "0021200543_017", "order": 17, "role": "body", "text": "\"I was pleased, in particular, with our defense in the first half,\" Bobcats coach Mike Dunlap said. \"We played them pretty evenly on the boards. But the disparity in the offensive rebounds was the difference in the game.\""}
{"game_id": "0021200543", "chunk_id": "0021200543_018", "order": 18, "role": "body", "text": "The Pacers have relied on the league's best defense as the offense finds its way. The Bobcats became the sixth opponent in seven games Indiana held to fewer than 90 points."}
{"game_id": "0021200543", "chunk_id": "0021200543_019", "order": 19, "role": "body", "text": "\"They were able to hit a lot of tough shots,\" Gordon said. \"We played them down to the stretch and they were making some tough baskets, and we weren't able to get the stops we needed in the crunch.\""}
{"game_id": "0021200543", "chunk_id": "0021200543_020", "order": 20, "role": "closing", "text": "Game notes The Pacers had 17 offensive rebounds while the Bobcats had nine. ... Newly signed forward Dominic McGuire started in place of George."}
