{"game_id": "0021300675", "chunk_id": "0021300675_001", "order": 1, "role": "lead", "text": "MIAMI -- Down by 18 points midway through the opening quarter, Kevin Durant and the Oklahoma City Thunder looked well on their way to witnessing a rout.\nThat's exactly what happened.\nAnd they enjoyed every moment.\nDurant remained sizzling with 33 points, Serge Ibaka added 22 and the Thunder roared back from an abysmal start -- they trailed 22-4 early -- to embarrass the Miami Heat 112-95 on Wednesday night, erasing that big deficit out of the gate by outscoring the two-time defending champions by 43 points over a 33-minute span.\n\"They were ready for us to come in and play,\" Durant said. \"They hit some tough shots early on, a few 3's, and we didn't panic. We just tried to stay together and that's what we did. Our bench was great in getting us back in that game.\""}
{"game_id": "0021300675", "chunk_id": "0021300675_002", "order": 2, "role": "body", "text": "The Thunder led by as many as 25, and shot 16 for 27 from 3-point range. Miami was 3 for 19 from beyond the arc.\nDurant has now scored at least 30 points in 12 straight games, matching the league's longest such streak since Tracy McGrady did it in 14 consecutive outings in the 2002-03 season. The Thunder extended their winning streak to nine, inching them closer to Indiana in the race for the league's best record.\nAnd the Oklahoma City bench outscored Miami's reserves 39-21, with Jeremy Lamb scoring 18 and Derek Fisher going 5 for 5 from 3-point range for his 15 points.\n\"There's no running away from it,\" Heat coach Erik Spoelstra said. \"Other than the first eight minutes of the game they outclassed us tonight. They absolutely deserved this win.\"\nLeBron James scored 34 points for Miami, his 1-on-1 duel with Durant not really amounting to much on a night in which the Heat allowed 25 points off turnovers and blew an 18-point lead for just the fourth time since he, Dwyane Wade and Chris Bosh became teammates nearly four years ago.\nBosh scored 18 points and Wade added 15 for Miami.\n\"We played well to start the game,\" James said. \"We played well all the way until like the second quarter. From that point on they did what they want to do.\"\nMuch of the buzz going into the night was about the MVP race, and how this might be the season that Durant finally catches James for the league's top individual award.\nHead-to-head, they weren't separated by much. But for just the fourth time in 17 meetings between their teams, Durant came out on top."}
{"game_id": "0021300675", "chunk_id": "0021300675_003", "order": 3, "role": "closing", "text": "\"It would have been fun to clear the court and watch them go 1-on-1,\" Thunder coach Scott Brooks said.\nIbaka opened the scoring with a jumper, and the Heat answered with an immediate 18-0 run, not even needing 5 minutes to get what appeared to be complete control. With 6:20 left in the opening quarter, Bosh made a pair of free throws to make it 22-4.\nThat pretty much ended the Heat highlights for the evening.\nBy the end of the first, the Thunder were within nine. Lamb scored 13 in the second quarter alone, helping Oklahoma City take a 55-50 lead into the break, with the Thunder already having scored 19 points off turnovers.\nThe third quarter, Durant and the Thunder put it away.\nDurant and James seemed to be playing a little game of `Can you top this?' in that period, both finishing with 12 points in the 12 minutes. The difference was, Durant was getting plenty of help, and James wasn't getting much.\n\"Rucker Park, that's what was going through my head,\" Durant said, referring to the New York basketball landmark where he scored 66 points in a game during the summer of 2011. \"It was fun. ... I'm sure the fans got what they wanted to see with that one.\"\nSaid James: \"It's fun competition. It's been a while since I was able to do something like that.\"\nFisher connected on a 3-pointer to end the quarter, pushing Oklahoma City's margin to 16, and the Heat had no answers in the fourth.\n\"We have some work to do,\" Spoelstra said. \"We're like everybody else in the league. Nobody is infallible. We have some things to improve on. We know the things we have to improve on. We're not there yet.\"\nGame notes\nFisher made five 3-pointers, total, when the Heat faced the Thunder in the 2012 NBA Finals. ... Shug McGaughey, who trained last year's Kentucky Derby winner Orb, was part of the sellout crowd, along with Detroit Tigers slugger Miguel Cabrera. ... Oklahoma City shot 14 free throws in the third quarter, the most by any Heat opponent in that period all season. ... The Heat fell to 7-12 this season when allowing more than 100 points. They're 25-1 when holding teams under 100. ... The Thunder are 8-0 on the road against Eastern Conference opponents."}
