{"game_id": "0021401112", "chunk_id": "0021401112_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Marvin Williams says the Charlotte Hornets aren't ready to concede a playoff spot."}
{"game_id": "0021401112", "chunk_id": "0021401112_003", "order": 3, "role": "body", "text": "Williams scored 18 points and the Hornets cruised to a 102-78 win over the Detroit Pistons on Wednesday night."}
{"game_id": "0021401112", "chunk_id": "0021401112_004", "order": 4, "role": "body", "text": "Kemba Walker had 17 points and Gerald Henderson added 14 as the Hornets won for only the third time in 10 games to keep pace in the Eastern Conference playoff race. They are two games behind Brooklyn and Miami, who are tied for seventh place, with eight remaining."}
{"game_id": "0021401112", "chunk_id": "0021401112_005", "order": 5, "role": "body", "text": "The top eight teams make the postseason."}
{"game_id": "0021401112", "chunk_id": "0021401112_006", "order": 6, "role": "body", "text": "\"Guys still feel good and are staying positive,\" Williams said. \"Coach is staying positive and encouraging guys who are playing through injuries. We're really trying to push for the eighth and seventh spot and we think we can get there at the end of the day.\""}
{"game_id": "0021401112", "chunk_id": "0021401112_007", "order": 7, "role": "body", "text": "Jodie Meeks led Detroit with 15 points. Andre Drummond was in early foul trouble and finished with 13 points and nine rebounds. The Pistons, who had won five of six, shot 35.2 percent from the field and were 5 of 22 from 3-point range."}
{"game_id": "0021401112", "chunk_id": "0021401112_008", "order": 8, "role": "body", "text": "The Hornets opened the game playing with plenty of emotion and energy, something they lacked in a 12-point loss to Boston on Monday night."}
{"game_id": "0021401112", "chunk_id": "0021401112_009", "order": 9, "role": "body", "text": "Walker scored all 17 of his points in the first half, draining pull-up jumpers, 3-pointers and driving layups as the Hornets built a 20-point lead in the second quarter."}
{"game_id": "0021401112", "chunk_id": "0021401112_010", "order": 10, "role": "body", "text": "The Hornets got a break when Drummond picked up his third foul with 8:12 remaining in the second quarter and sat out the remainder of the first half."}
{"game_id": "0021401112", "chunk_id": "0021401112_011", "order": 11, "role": "body", "text": "\"The start was one of our main priorities -- to start fast and try to maintain it,\" said Walker, who has reached double figures in scoring nine times in 12 games since returning from left knee surgery."}
{"game_id": "0021401112", "chunk_id": "0021401112_012", "order": 12, "role": "body", "text": "Said Detroit guard John Lucas: \"They came out and hit us with the first punch. The energy, I felt like, wasn't there. We're down about it because that's a game we needed.\""}
{"game_id": "0021401112", "chunk_id": "0021401112_013", "order": 13, "role": "body", "text": "The Pistons are all but out of playoff contention at 29-46, 5 1/2 games out of eighth place."}
{"game_id": "0021401112", "chunk_id": "0021401112_014", "order": 14, "role": "body", "text": "\"We were bad,\" coach Stan Van Gundy said. \"When you're not ready to play -- and it wasn't just one player, it was everybody -- it's going to be a long night.\""}
{"game_id": "0021401112", "chunk_id": "0021401112_015", "order": 15, "role": "body", "text": "Before the game, Hornets center Al Jefferson had his right knee drained for the third time in eight days but decided to gut it out and play. He finished with 11 points, nine rebounds and several nice passes out of double teams in the low post before sitting out the fourth quarter."}
{"game_id": "0021401112", "chunk_id": "0021401112_016", "order": 16, "role": "body", "text": "Jefferson isn't nearly as mobile as he was this time a year ago when he was en route to being selected third-team all-NBA."}
{"game_id": "0021401112", "chunk_id": "0021401112_017", "order": 17, "role": "body", "text": "He said he can play about three minutes before the knee starts to get stiff."}
{"game_id": "0021401112", "chunk_id": "0021401112_018", "order": 18, "role": "body", "text": "\"It's tough, but I still can play and bring something to the table to help my team win,\" Jefferson said. \"I'm playing with a hurt knee but teams are still double-teaming me. I've got to suck it up and I feel like I can play. I've just got to do it.\""}
{"game_id": "0021401112", "chunk_id": "0021401112_019", "order": 19, "role": "body", "text": "The Pistons didn't put up much of a challenge."}
{"game_id": "0021401112", "chunk_id": "0021401112_020", "order": 20, "role": "body", "text": "They had trimmed the lead to eight with 8 minutes left when Drummond scored on an alley-oop dunk and drew a foul. But he missed the free throw, and the Hornets seemed to seize the momentum. Charlotte went on a tear, pushing the lead to 23 behind a 3-pointer from Williams and an up-and-under move from Jefferson."}
{"game_id": "0021401112", "chunk_id": "0021401112_021", "order": 21, "role": "body", "text": "Mo Williams added 13 points and rookie P.J. Hairston had 12 off the bench for Charlotte (32-42)."}
{"game_id": "0021401112", "chunk_id": "0021401112_022", "order": 22, "role": "body", "text": "Reggie Jackson, a catalyst for the Pistons in recent weeks, was held to nine points -- snapping a streak of 11 straight double-figure scoring games."}
{"game_id": "0021401112", "chunk_id": "0021401112_023", "order": 23, "role": "body", "text": "\"They just got after it,\" Jackson said of the Hornets. \"They really beat us up on the offensive boards to start. They made us pay early and it was really tough to play catch-up the rest of the game.\""}
{"game_id": "0021401112", "chunk_id": "0021401112_026", "order": 26, "role": "body", "text": "Pistons: Detroit's reserves outscored its starters 28-17 in the first half."}
{"game_id": "0021401112", "chunk_id": "0021401112_027", "order": 27, "role": "body", "text": "Hornets: Lance Stephenson, the team's top free-agent pickup this past offseason, didn't play for the second straight game. ... The Hornets outscored Detroit 16-6 on fast-break points and forced 14 turnovers."}
{"game_id": "0021401112", "chunk_id": "0021401112_029", "order": 29, "role": "body", "text": "Jefferson took an elbow to the face from Drummond less than two minutes into the game that sent the 289-pounder to the floor. Jefferson remained in the game, and Drummond was given a flagrant 1 foul."}
{"game_id": "0021401112", "chunk_id": "0021401112_031", "order": 31, "role": "body", "text": "Pistons: At Chicago on Friday night."}
{"game_id": "0021401112", "chunk_id": "0021401112_032", "order": 32, "role": "closing", "text": "Hornets: At Indiana on Friday night."}
