{"game_id": "0021401086", "chunk_id": "0021401086_001", "order": 1, "role": "lead", "text": "PHOENIX --  History and a tepid shooting performance were working against the Portland Trail Blazers."}
{"game_id": "0021401086", "chunk_id": "0021401086_002", "order": 2, "role": "body", "text": "But, they also had LaMarcus Aldridge."}
{"game_id": "0021401086", "chunk_id": "0021401086_003", "order": 3, "role": "body", "text": "The All-Star forward made shots on five straight possessions late in the fourth quarter, finishing with 27 points in the Blazers' 87-81 win Friday night over the Phoenix Suns."}
{"game_id": "0021401086", "chunk_id": "0021401086_004", "order": 4, "role": "body", "text": "Portland made just 36 of 89 shots for the game and had not won in Phoenix since December 2010, a streak of seven straight losses. The Blazers, though, used a 15-2 run over 4:45 of the fourth quarter to grab an 85-76 lead, with Aldridge knocking down turnaround jumpers over double teams. He had 10 points in the last 3:26, and finished with nine rebounds."}
{"game_id": "0021401086", "chunk_id": "0021401086_005", "order": 5, "role": "body", "text": "\"I was just trying to find a rhythm, and then I made one shot, and then kind of played off of that,\" Aldridge said. \"My teammates kept looking for me. I was just trying to make shots for us.\""}
{"game_id": "0021401086", "chunk_id": "0021401086_006", "order": 6, "role": "body", "text": "Former Sun Robin Lopez added 12 points and 10 rebounds for Northwest Division-leading Portland, which has won two straight after a five-game losing streak."}
{"game_id": "0021401086", "chunk_id": "0021401086_007", "order": 7, "role": "body", "text": "Coach Terry Stotts said that while Aldridge helped turn the tide of a game the Blazers trailed by eight early in the fourth quarter, defense was also key."}
{"game_id": "0021401086", "chunk_id": "0021401086_008", "order": 8, "role": "body", "text": "\"I'm really proud of the way we continued to compete,\" Stotts said."}
{"game_id": "0021401086", "chunk_id": "0021401086_009", "order": 9, "role": "body", "text": "Marcus Morris led the Suns with 19 points and 12 rebounds, and twin brother Markieff added 15 and nine, respectively, but the Suns lost ground in Oklahoma City for the final playoff spot in the Western Conference. Phoenix is 3 1/2 games behind the Thunder."}
{"game_id": "0021401086", "chunk_id": "0021401086_010", "order": 10, "role": "body", "text": "Portland won despite an 8-for-18 free-throw performance, but Phoenix made just 32 of 87 shots overall and leading scorer Eric Bledsoe was 5 of 20."}
{"game_id": "0021401086", "chunk_id": "0021401086_011", "order": 11, "role": "body", "text": "\"I thought they were good shots. They just didn't fall,\" Bledsoe said. \"Everybody got good looks at the rim, but we were missing. Especially me.\""}
{"game_id": "0021401086", "chunk_id": "0021401086_012", "order": 12, "role": "body", "text": "Bledsoe gave the Suns a 62-56 lead, their largest of the game at the time, with 4:41 left in the third quarter after he dunked and drew a foul on the Blazers' Nicolas Batum."}
{"game_id": "0021401086", "chunk_id": "0021401086_013", "order": 13, "role": "body", "text": "The Blazers went more than six minutes without a point in the third, with Aldridge missing three of four free throws in the quarter. The Suns took a 66-60 lead into the fourth, with Portland's 13 third-quarter points a season low."}
{"game_id": "0021401086", "chunk_id": "0021401086_014", "order": 14, "role": "body", "text": "Damian Lillard's first basket of the game, a 3-pointer early in the first quarter, gave him 1,500-plus points in his first three seasons, joining Sidney Wicks as the only Blazers player to have achieved the milestone. Kevin Durant of Oklahoma City was the last NBA player to do so."}
{"game_id": "0021401086", "chunk_id": "0021401086_015", "order": 15, "role": "body", "text": "Aldridge scored 12 of his points in the first quarter, hitting four consecutive shots during one stretch and 6 of 8 overall. The Blazers led by as many as 10 in the quarter and 11 in the second, but went cold after leading 41-30 at the 8-minute mark."}
{"game_id": "0021401086", "chunk_id": "0021401086_016", "order": 16, "role": "body", "text": "Portland made just eight of 27 second-quarter shots after hitting 13 of 22 in the first quarter, and the Suns used a 13-2 run to pull into a 43-43 tie on Gerald Green's 3-pointer with 3:43 left."}
{"game_id": "0021401086", "chunk_id": "0021401086_017", "order": 17, "role": "body", "text": "Green energized the Suns with 12 points off the bench, screaming for the ball at one point early in the fourth quarter."}
{"game_id": "0021401086", "chunk_id": "0021401086_018", "order": 18, "role": "body", "text": "Bledsoe's 15-foot pull-up with 1.4 seconds left tied it at 47 at halftime."}
{"game_id": "0021401086", "chunk_id": "0021401086_019", "order": 19, "role": "body", "text": "\"I thought the end of the third quarter, the beginning of the fourth quarter we missed five or six wide-open, easy shots,\" Suns coach Jeff Hornacek said. \"We make those, we build it up to 10 or 12 points and maybe a different story.\""}
{"game_id": "0021401086", "chunk_id": "0021401086_021", "order": 21, "role": "body", "text": "Trail Blazers: C Chris Kaman returned after missing the past three games with a shoulder injury. ... Portland recently ended a five-game losing streak, and Stotts said one thing the Blazers took from the losses was the need to defend better. \"The most important thing is that has to be a constant for us,\" Stotts said."}
{"game_id": "0021401086", "chunk_id": "0021401086_022", "order": 22, "role": "body", "text": "Suns: G Brandon Knight had been working his way to a return, but was deemed unable to play Friday, missing his eighth straight game with a left ankle injury."}
{"game_id": "0021401086", "chunk_id": "0021401086_024", "order": 24, "role": "body", "text": "Hot Rod Hundley, for 35 years the voice of the New Orleans/Utah Jazz on radio, died in his Phoenix-area home Friday. Before joining the Jazz, he was a Suns broadcaster for four years."}
{"game_id": "0021401086", "chunk_id": "0021401086_025", "order": 25, "role": "body", "text": "The following was part of a statement released after Friday's game by the Suns on Hundley's passing: \"Suns fans were fortunate to be on the other end of Hot Rod's famous calls for four seasons at the beginning of his illustrious career, and his fun-loving personality made him a friend to many during his trips back to the Valley over the years.\""}
{"game_id": "0021401086", "chunk_id": "0021401086_027", "order": 27, "role": "body", "text": "Trail Blazers: Host Denver on Saturday."}
{"game_id": "0021401086", "chunk_id": "0021401086_028", "order": 28, "role": "closing", "text": "Suns: Host Oklahoma City on Sunday."}
