{"game_id": "0021300695", "chunk_id": "0021300695_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- Make no bones about it. Coach Mike D'Antoni's skeleton roster was no match for the opportunistic Charlotte Bobcats and Al Jefferson's dominating presence in the paint.\nJefferson tied a career high with 40 points, 16 of them in the fourth quarter, and grabbed 18 rebounds to help the Bobcats send the floundering Los Angeles Lakers to their sixth straight defeat with a 110-100 victory Friday night.\n\"I have those moments,\" Jefferson said. \"They kept running plays for me, and I kept scoring. In the first quarter, they weren't going down for me, but I just kept staying with it because I knew sooner or later it would start going down for me.\""}
{"game_id": "0021300695", "chunk_id": "0021300695_002", "order": 2, "role": "closing", "text": "Jefferson set a franchise record with his 11th straight game of 20 or more points, eclipsing the mark set by Jason Richardson in 2007-08. It was the 13th game this season in which an opposing player scored at least 30 against the Lakers, something that happened in 18 games last season -- and there are still 35 games remaining.\nJefferson is averaging 19.9 points and 10.7 boards per game but wasn't selected for the All-Star Game and has yet to play in one in his 10 years in the league.\n\"I've been disappointed with the All-Star Games, man, for many years. So I don't listen to the hype,\" Jefferson said.\nGerald Henderson added 20 points for the Bobcats. Starting point guard Kemba Walker missed his sixth straight game since a sprained left ankle ended his career-opening consecutive-game streak of 190. Ramon Sessions, who has started every game at the point during Walker's absence, had 13 assists and nine points.\nSessions, along with starting power forward Josh McRoberts and reserve guard Jannero Pargo -- all former Lakers -- combined for 26 points, and the Bobcats snapped a string of five straight defeats against Los Angeles.\nCharlotte shot 52.3 percent from the field, improving to 5-0 when shooting at least 50 percent. The victory was the Bobcats' ninth on the road, four more than all of last season.\nStill missing Kobe Bryant, Steve Nash, Steve Blake, Jordan Farmar and Xavier Henry because of injuries, the Lakers lost for the 18th time in 21 games and are only a half-game ahead of last-place Sacramento in the Western Conference standings just four seasons after winning their 16th NBA title. Pau Gasol had 24 points for Los Angeles, and Nick Young added 21 off the bench.\nThe Lakers have given up 100 or more points in 14 consecutive games, matching the club's longest such streak since a 17-game stretch in 1986-87.\nTrailing by as many as 20 points after a pair of free throws by Jefferson with 4:21 left in the third quarter, the Lakers sliced the margin to 86-73 on a four-point play by Ryan Kelly.\nLos Angeles got it down to 86-78 on a layup by Robert Sacre with 11:01 to play, but that was as close as the Lakers got. Jefferson scored the Bobcats' first eight points of the final quarter to help keep the Lakers at bay.\n\"He's been doing this to a lot of people,\" D'Antoni said. \"We tried a little bit of everything. We dug. We tried to play him a little bit straight up, at first. We tried to double-team him.\"\nJefferson, who signed a three-year, $41 million contract with the Bobcats in July, powered them to a 62-49 halftime lead with 18 points and eight rebounds. Charlotte shot 58 percent in the half and never trailed after Jefferson's finger roll gave the Bobcats a 26-25 lead with 1:37 left in the first quarter.\nIn the other meeting this season, the Lakers beat the Bobcats 88-85 at Charlotte with a game-ending 13-4 run and 21 points by Kobe Bryant -- one of only six games the NBA's fourth-leading scorer has played in this season because of a torn Achilles tendon and a fracture in his left knee. Jefferson was held to 14 points that night.\nGame notes\nThe game ball was being sent to New York to mark the final day of NBA commissioner David Stern's tenure. He is retiring Saturday on the 30th anniversary of his first day on the job. ... Stern saw the Lakers win eight league championships, make 12 trips to the Finals and record eight 60-win seasons during his reign. ... Stern presented the Lakers with their championship rings on seven occasions. The only exception was in October 2001, following the Sept. 11 terrorist attacks."}
