{"game_id": "0021701041", "chunk_id": "0021701041_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- The Milwaukee Bucks pushed the pace and kept their composure late in the fourth quarter. The Atlanta Hawks struggled to regain their footing in the closing minutes after their best ball-handler fouled out.\nGiannis Antetokounmpo and his teammates capitalized for a 122-117 win on Saturday.\nAntetokounmpo had 33 points and 12 rebounds, and Khris Middleton added 23 points for Milwaukee, which finished off the worst team in the Eastern Conference with a game-ending 11-5 run.\n\"We just trust one another, and we focused on our strengths,\" Antetokounmpo said. \"Then we were able to make some shots and then get multiple stops in a row.\"\nTwo key stops late ended with lob passes downcourt to point guard Eric Bledsoe, who handed off the ball each time to teammates for easy transition buckets.\nThe Hawks didn't have an answer after Dennis Schroder fouled out with 2:46 left. To make matters worse for Atlanta, Schroder was called for a technical foul after exchanging words with an official on the way to the sideline.\nMiddleton hit the free throw that started the run. The Hawks looked rushed on their next two possessions with a turnover and a blocked shot.\nTrailing by 13 at one point, Atlanta put up a spirited fight before losing its 50th game of the year.\n\"It's (Dennis') sixth foul, it's a shooting foul. You compound it with getting a technical,\" coach Mike Budenholzer said. \"Just giving up points when it's that close, when it's that tight. It's hard. It's a learning experience for all of us.\"\nTaurean Prince tied a career high with 38 points on 13-of-26 shooting, while Schroder finished with 18 points.\nBut his technical foul turned out to be a turning point in the game.\n\"It can't happen. I've just got to be quiet and go to the bench and be better,\" Schroder said.\nThe Bucks needed this victory to keep up in the crowded Eastern Conference playoff race after an ugly loss on Wednesday at 49-loss Orlando, with the Cleveland Cavaliers up next on Monday.\n\"That's important at the end of the day, closing the game out and getting the win,\" coach Joe Prunty said.\nMilwaukee had the early comeback, rallying from an 11-point deficit to take a 56-50 halftime lead after figuring out Atlanta's effective pick-and-roll game.\nTIP-INS\nHawks: Second in the league in forcing 15.6 turnovers a game, Atlanta got Milwaukee to cough up just 12 on the night. ... Prince had averaged 28.3 points over his previous three games. ... F John Collins left in the third quarter with a sprained left ankle.\nBucks: C Tyler Zeller missed the game with lingering back soreness. ... G Brandon Jennings played 17 minutes and scored two points in his first home game since being signed by his former team to a 10-day contract last week. ... Jabari Parker was assessed a technical foul late in the second quarter after appearing to get in the face of Atlanta's John Collins after dunking over the forward. Parker had 11 points off the bench in the first half on 5-of-9 shooting.\nFLAGRANT FOUL\nCollins got hurt after landing on Antetokounmpo's right leg while attempting a 3. Officials called a flagrant foul on Antetokounmpo, who said after the game there was no intent on his part. Antetokounmpo had his back turned on Collins to watch the ball, and he did not appear to move when Collins landed on Antetokounmpo's right foot.\n\"I think it's just the rule this year, when you are going to contest,\" Budenholzer said. \"I don't think it was anything intentional by Giannis. It's just one of those unfortunate plays.\"\nJUST JABARI\nParker added 15 points off the bench for Milwaukee and tormented the Hawks with two thunderous dunks in the first half. Five weeks after returning from a knee injury, the fourth-year forward is showing that he can once again serve as Antetokounmpo's frontcourt running mate.\n\"I'm just playing like I'm practicing,\" Parker said. \"Right now, I know where my shots are going to be. ... It hasn't been easy, but it has been working.\"\nUP NEXT\nHawks: The second stop of a six-game trip takes them to Utah on Tuesday.\nBucks: Visit the Cleveland Cavaliers on Monday.\n---\nMore NBA basketball: https://apnews.com/tag/NBAbasketball"}
