{"game_id": "0021700235", "chunk_id": "0021700235_001", "order": 1, "role": "lead", "text": "MIAMI --  Myles Turner made almost every shot he took in Indiana's biggest win of the season, and even got a chance for a brief postgame chat with actor Matthew McConaughey."}
{"game_id": "0021700235", "chunk_id": "0021700235_002", "order": 2, "role": "body", "text": "Everything went great for the Pacers."}
{"game_id": "0021700235", "chunk_id": "0021700235_003", "order": 3, "role": "body", "text": "Everything went wrong for the Miami Heat."}
{"game_id": "0021700235", "chunk_id": "0021700235_004", "order": 4, "role": "body", "text": "Bojan Bogdanovic scored 26 points, Turner added 25 on 11 of 14 shooting and the Pacers embarrassed the Heat in the second half on the way to a 120-95 rout Sunday night."}
{"game_id": "0021700235", "chunk_id": "0021700235_005", "order": 5, "role": "body", "text": "\"We moved the ball and guys were knocking down shots,\" Pacers coach Nate McMillan said."}
{"game_id": "0021700235", "chunk_id": "0021700235_006", "order": 6, "role": "body", "text": "He made it sound so easy. What awaits the Heat at practice Monday is going to be very difficult."}
{"game_id": "0021700235", "chunk_id": "0021700235_007", "order": 7, "role": "body", "text": "Heat coach Erik Spoelstra had no answers and would have probably preferred no questions after the game, making it very clear that what went on Sunday -- and has gone on from time to time this season -- is going to end."}
{"game_id": "0021700235", "chunk_id": "0021700235_008", "order": 8, "role": "body", "text": "\"One way or another, we're going to get down to the bottom of it,\" Spoelstra said. \"I need to look at the film, assess and find some solutions. I don't have answers right now for why we give up 120 points and have an uninspiring play. ... We'll find a solution. We'll find a way to play Miami Heat basketball, one way or another.\""}
{"game_id": "0021700235", "chunk_id": "0021700235_009", "order": 9, "role": "body", "text": "Heat players offered similar sentiment."}
{"game_id": "0021700235", "chunk_id": "0021700235_010", "order": 10, "role": "body", "text": "\"It sucks,\" center Hassan Whiteside said."}
{"game_id": "0021700235", "chunk_id": "0021700235_011", "order": 11, "role": "body", "text": "\"Terrible game, from the first minute to the last,\" point guard Goran Dragic said."}
{"game_id": "0021700235", "chunk_id": "0021700235_012", "order": 12, "role": "body", "text": "\"Embarrassing performance by us,\" said shooting guard Wayne Ellington, who led Miami with 21 points on seven 3-pointers."}
{"game_id": "0021700235", "chunk_id": "0021700235_013", "order": 13, "role": "body", "text": "Turner made 11 of 14 shots for the Pacers, who won their third straight game overall and got their first win in Miami since Nov. 12, 2014. Each of the last 11 regular-season games in the series were won by the home team, until the Pacers emphatically changed that in this one."}
{"game_id": "0021700235", "chunk_id": "0021700235_014", "order": 14, "role": "body", "text": "\"I definitely haven't won here before,\" said Turner, who played in four previous games in Miami -- all losses. \"Maybe it's the weather.\""}
{"game_id": "0021700235", "chunk_id": "0021700235_015", "order": 15, "role": "body", "text": "Victor Oladipo scored 15, Darren Collison had 12 points and 10 assists and Thaddeus Young added 12 for Indiana. The Pacers outscored Miami 69-40 in the game's final 25 minutes and shot 60 percent for the game."}
{"game_id": "0021700235", "chunk_id": "0021700235_016", "order": 16, "role": "body", "text": "\"We needed to come out and have a great start at the beginning of the second half,\" Oladipo said. \"We did a good job of that.\""}
{"game_id": "0021700235", "chunk_id": "0021700235_017", "order": 17, "role": "body", "text": "Whiteside and Josh Richardson each scored 15 and James Johnson added 10 for the Heat."}
{"game_id": "0021700235", "chunk_id": "0021700235_018", "order": 18, "role": "body", "text": "Dion Waiters was scoreless for Miami, missing all 10 of his shots. Miami's starters were outscored by Indiana's 90-44 --  a huge disappointment on the heels of a road win in Washington two nights earlier."}
{"game_id": "0021700235", "chunk_id": "0021700235_019", "order": 19, "role": "body", "text": "\"Look, I don't have an answer to our unreliability right now,\" Spoelstra said."}
{"game_id": "0021700235", "chunk_id": "0021700235_021", "order": 21, "role": "body", "text": "Pacers: Indiana improved to 18-37 all-time in regular-season games at Miami. Home teams always have a huge edge in this series; the Pacers are 44-9 in regular season games against the Heat in Indianapolis. ... This was the start of the fifth back-to-back for Indiana this season, and the Pacers now have a chance for their second sweep. ... Indiana led by as many as 30, its largest lead of the season."}
{"game_id": "0021700235", "chunk_id": "0021700235_022", "order": 22, "role": "body", "text": "Heat: Udonis Haslem played the final 3:26, his first appearance of the season -- and officially making him a 15-year member of the Heat. ... The shooting woes weren't exclusive to Waiters. Dragic and James Johnson were both 3 for 8."}
{"game_id": "0021700235", "chunk_id": "0021700235_024", "order": 24, "role": "body", "text": "The 25-point margin was Indiana's largest win of the season (previous best being 23 at Minnesota on Oct. 24), and the biggest Miami loss of the season (previous worst being 17 twice, most recently at Golden State on Nov. 6)."}
{"game_id": "0021700235", "chunk_id": "0021700235_026", "order": 26, "role": "body", "text": "Both of Indiana's trips to Miami this season are now out of the way. In a weird quirk, six of the last seven Pacers-Heat games have been played in Miami. The Heat go to Indianapolis on Jan. 10 and March 25."}
{"game_id": "0021700235", "chunk_id": "0021700235_028", "order": 28, "role": "body", "text": "Pacers: Visit Orlando on Monday night, closing a two-day Florida swing."}
{"game_id": "0021700235", "chunk_id": "0021700235_029", "order": 29, "role": "body", "text": "Heat: Host Boston on Wednesday night, wrapping up a two-game homestand."}
{"game_id": "0021700235", "chunk_id": "0021700235_031", "order": 31, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
