{"game_id": "0021400195", "chunk_id": "0021400195_001", "order": 1, "role": "lead", "text": "MIAMI -- So much intrigue, crammed into 14 seconds. A pair of former Connecticut stars, going 1-on-1 as if they were willing to decide it themselves. A one-point game, one team about to end a losing streak and a tip-in try that added more drama with every bounce off the rim.\n\"Definitely an experience,\" Luol Deng said.\nFor the Miami Heat, a welcomed one.\nDeng scored 26 points, Chris Bosh and Mario Chalmers each added 20 and the Heat watched Charlotte miss three potential go-ahead shots in the final seconds on the way to beating the Hornets 94-93 on Sunday night and snapping a three-game home slide.\n\"It was a good step,\" Heat coach Erik Spoelstra said.\nChalmers had 10 assists for his second double-double of the season and Shabazz Napier scored 14 for the Heat.\nAl Jefferson finished with 22 points and 12 rebounds for Charlotte, which got 17 points from Lance Stephenson and 16 from Kemba Walker but wound up seeing its skid reach five games. The Hornets trailed by nine at the half and then led by as many as eight in the fourth, before Miami rallied.\n\"The stretch of games we've played has definitely taken their toll on our confidence,\" Hornets coach Steve Clifford said.\nWorking from the right side of the lane, Bosh spun free from Cody Zeller and scored from the right baseline to give Miami a 94-93 lead with 31 seconds remaining.\nThat's when the fun started.\nWalker missed with 26 seconds left and Charlotte down by one. The Heat got the rebound and the Hornets appeared to be trying to foul Chalmers near midcourt.\nNo foul was called, the ball got knocked away and after a deflection out of bounds the Hornets had possession with 14 seconds remaining. Walker went at Napier -- UConn great vs. UConn great -- and missed a short jumper, Jefferson got a good try at the tip, and the ball bounced off the rim as the horn sounded.\n\"I got a pretty good look,\" Walker said.\nSaid Bosh: \"I'm just glad we won. For real.\"\nCharlotte's lead was eight midway through the fourth, and the Heat were mired in a stretch where they had two field goals in more than 9 minutes. But Miami put together a flurry, setting up the back-and-forth finish.\nBosh hit a 3-pointer, Napier had a pair of free throws after a steal and then -- off a drive-and-dish by Chalmers -- Napier added a 3-pointer to cap an eight-point, 43-second burst and give Miami an 87-86 lead.\nThere were four more lead changes from there.\n\"We had our shots,\" Jefferson said. \"We had the shots we wanted. We just didn't make them.\"\nTIP-INS\nHornets: Stephenson isn't exactly a fan favorite in Miami, given his role in the Pacers-Heat rivalry in recent seasons. \"They hate me everywhere,\" he told fans sitting courtside during a fourth-quarter stoppage. ... Charlotte isn't planning on having F Michael Kidd-Gilchrist (right foot) back anytime soon, and G P.J. Hairston (ankle) is also likely out for \"a few more days,\" Clifford said.\nHeat: G Dwyane Wade (left hamstring) missed his sixth straight game. ... G Norris Cole (dislocated finger) sat for the second straight game and F Chris Andersen departed with 2:59 left in the first quarter with a right ankle sprain. ... Houston Astros draft pick Bryan Radziewski, a former University of Miami star left-hander, was part of the sold-out crowd.\nBIG THIRD\nCharlotte opened the second half on an 11-2 run, on the way to outscoring Miami 28-14 in the first 12 minutes following intermission. The Heat won despite shooting 38 percent in the second half.\nCLOSING UNIT\nPartly because of injuries, partly because the unit was working, Spoelstra didn't make a single substitution in the final 7:28. Chalmers got to the foul line 10 times in the fourth quarter and Miami got 15 free throws to Charlotte's three in the final period.\nUP NEXT\nHornets: Host the Los Angeles Clippers on Monday.\nHeat: Host Golden State on Tuesday."}
