{"game_id": "0021701092", "chunk_id": "0021701092_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Kyle Kuzma wasn't interested in seeing Los Angeles extend its losing streak."}
{"game_id": "0021701092", "chunk_id": "0021701092_002", "order": 2, "role": "body", "text": "Kuzma scored 15 of his 25 points in the fourth quarter and had 10 rebounds, and the Los Angeles Lakers overcame a slow start to beat the Memphis Grizzlies 100-93 on Saturday night."}
{"game_id": "0021701092", "chunk_id": "0021701092_003", "order": 3, "role": "body", "text": "\"The fourth quarter, we just didn't want to lose,\" Kuzma said. \"The first three quarters, I didn't really shoot the ball very well. So, I just tried to lock in.\""}
{"game_id": "0021701092", "chunk_id": "0021701092_004", "order": 4, "role": "body", "text": "Kuzma was part of an offensive burst that led to the Lakers outscoring Memphis 48-36 in the second half. It took until the third quarter for Los Angeles to recover from a quick Memphis start that contributed to a 17-point first-quarter lead for the Grizzlies. Memphis earned the advantage by scoring inside, 18 of its 28 first-quarter points coming in the paint."}
{"game_id": "0021701092", "chunk_id": "0021701092_005", "order": 5, "role": "body", "text": "\"In the second half, we did a better job of keeping them out of the paint,\" said Lakers forward Julius Randle, who finished with 20 points and 11 rebounds, adding: \"It's the same formula all year. We defend and we win games.\""}
{"game_id": "0021701092", "chunk_id": "0021701092_006", "order": 6, "role": "body", "text": "Kuzma said it was a matter of shifting the defensive focus to protect the paint. \"Just making a collective effort to make them shoot (outside).\""}
{"game_id": "0021701092", "chunk_id": "0021701092_007", "order": 7, "role": "body", "text": "Kentavious Caldwell-Pope scored 18 points, and Lonzo Ball had 12 points and 10 assists."}
{"game_id": "0021701092", "chunk_id": "0021701092_008", "order": 8, "role": "body", "text": "Andrew Harrison led the Grizzlies with 20 points and nine assists. Marc Gasol had 18 points, and JaMychal Green added 17 points and matched his season high with 16 rebounds. Memphis, which lost its fourth straight, was stymied by converting only 5 of 29 shots from outside the arc."}
{"game_id": "0021701092", "chunk_id": "0021701092_009", "order": 9, "role": "body", "text": "\"They're not a really good 3-point shooting team, so we played percentages,\" Kuzma said."}
{"game_id": "0021701092", "chunk_id": "0021701092_010", "order": 10, "role": "body", "text": "Los Angeles took the lead with an 11-2 run in the fourth, as Kuzma scored seven straight points. The rally helped the Lakers take an 84-79 lead, and Memphis would never get the lead back."}
{"game_id": "0021701092", "chunk_id": "0021701092_011", "order": 11, "role": "body", "text": "Gasol said the Grizzlies effort changed after building the early advantage."}
{"game_id": "0021701092", "chunk_id": "0021701092_012", "order": 12, "role": "body", "text": "\"We started off playing with energy and moving the ball, cutting, sacrificing for one another,\" the Memphis center said. \"Then we got a little stagnant with the ball. We were not moving as fast.\""}
{"game_id": "0021701092", "chunk_id": "0021701092_013", "order": 13, "role": "body", "text": "That change in approach led to the Lakers steadily whittling into the Memphis advantage as the Grizzlies suffered with poor shooting after making 57 percent of their shots in the opening frame."}
{"game_id": "0021701092", "chunk_id": "0021701092_014", "order": 14, "role": "body", "text": "\"(The Lakers) were able to just shrink the floor and crowd the ball,\" Memphis interim coach J.B. Bickerstaff said. \"We didn't do the things necessary off the ball to help one another. We stopped cutting, we stopped moving the ball quickly and playing off the catch.\""}
{"game_id": "0021701092", "chunk_id": "0021701092_016", "order": 16, "role": "body", "text": "Lakers: Caldwell-Pope, who missed his first five shots, had a 4-point play in the fourth quarter to start the Lakers 11-2 rally. .Isaiah Thomas sat out with a sore hip. .Ended a seven-game losing streak in the series. Had not won a road game in the series since Dec. 17, 2013. ... Only eight players saw action for Los Angeles."}
{"game_id": "0021701092", "chunk_id": "0021701092_017", "order": 17, "role": "body", "text": "Grizzlies: Called up Marquis Teague from their G-League team (Memphis Hustle) on Friday. .Green also had 16 rebounds Monday at Brooklyn."}
{"game_id": "0021701092", "chunk_id": "0021701092_019", "order": 19, "role": "body", "text": "The Lakers were fully aware that Memphis was coming off a 61-point loss to Charlotte on Thursday -- the biggest loss in franchise history. And they were prepared for a fast Grizzlies start. \"It was our main focus,\" Caldwell-Pope said. \"No one gets beat by 61, and then comes out plays flat the next game. I hope not.\""}
{"game_id": "0021701092", "chunk_id": "0021701092_021", "order": 21, "role": "body", "text": "Despite the Grizzlies losing 23 of their last 24 and limping to the end with one of the worst records in the league, Gasol said he's not necessarily looking forward to the end of the season. There's still strides to make. \"You want to go into the offseason with a different feeling,\" Gasol said. \"You want to have at least a baseline and understanding of what you're trying to do and trying to accomplish as a team.\""}
{"game_id": "0021701092", "chunk_id": "0021701092_023", "order": 23, "role": "body", "text": "Lakers: Wrap up a four-game trip Monday night against the Pistons"}
{"game_id": "0021701092", "chunk_id": "0021701092_024", "order": 24, "role": "body", "text": "Grizzlies: At Minnesota on Monday night."}
{"game_id": "0021701092", "chunk_id": "0021701092_026", "order": 26, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
