{"game_id": "0021300135", "chunk_id": "0021300135_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  After having his worst game in a Detroit Pistons uniform earlier in the week, free agent Josh Smith erased that memory with his best game Friday night."}
{"game_id": "0021300135", "chunk_id": "0021300135_002", "order": 2, "role": "body", "text": "Smith had 21 points, eight rebounds and seven assists for the struggling Pistons, who snapped a four-game skid with a 97-90 victory over the Sacramento Kings."}
{"game_id": "0021300135", "chunk_id": "0021300135_003", "order": 3, "role": "body", "text": "The Pistons built a 10-point advantage after three quarters and their lead remained in double figures for much of the fourth as Detroit won its first road game of the season."}
{"game_id": "0021300135", "chunk_id": "0021300135_004", "order": 4, "role": "body", "text": "Smith also contributed on the defensive end with five steals and four blocks. He was coming off a two-point game in a lopsided loss at Golden State on Tuesday, when the veteran forward made 1 of 6 shots in 19 minutes."}
{"game_id": "0021300135", "chunk_id": "0021300135_005", "order": 5, "role": "body", "text": "Against the Kings, Smith had a fast start at the offensive end and stayed active throughout. He made 6 of 11 shots, hit two 3-pointers, and connected on 7 of 10 free throws."}
{"game_id": "0021300135", "chunk_id": "0021300135_006", "order": 6, "role": "body", "text": "\"That's the way Josh plays. He scored, rebounded and had four blocks,\" Pistons coach Maurice Cheeks said. \"That's the way we need Josh to play. He was spectacular tonight.\""}
{"game_id": "0021300135", "chunk_id": "0021300135_007", "order": 7, "role": "body", "text": "Smith was active right away, getting five points, but more importantly, five assists in igniting the Pistons' running game and building a 27-21 lead after one quarter. Detroit had started slow in its previous two games, especially in the loss to Golden State, which led by 19 points heading into the second quarter."}
{"game_id": "0021300135", "chunk_id": "0021300135_008", "order": 8, "role": "body", "text": "\"It was vital to our success to start the tempo early,\" Smith said. \"We knew it would be a loud crowd out there and we wanted to set the tone early.\""}
{"game_id": "0021300135", "chunk_id": "0021300135_009", "order": 9, "role": "body", "text": "Andre Drummond was also a major factor for Detroit. In a game-long battle with Kings center DeMarcus Cousins, Drummond fared well, getting 15 points and tieing a career-high with 18 rebounds."}
{"game_id": "0021300135", "chunk_id": "0021300135_010", "order": 10, "role": "body", "text": "Drummond, who teams with Greg Monroe to give Detroit a strong inside game, was active at both ends of the court. He made 7 of 13 shots and had eight offensive rebounds and two steals."}
{"game_id": "0021300135", "chunk_id": "0021300135_011", "order": 11, "role": "body", "text": "Cousins had a strong game as well with 26 points and 13 rebounds."}
{"game_id": "0021300135", "chunk_id": "0021300135_012", "order": 12, "role": "body", "text": "\"DeMarcus Cousins is a heck of a player,\" Drummond said. \"I knew what I was getting myself into tonight. He's one of the best centers in the league, but I think I did a pretty good job against him.\""}
{"game_id": "0021300135", "chunk_id": "0021300135_013", "order": 13, "role": "body", "text": "Isaiah Thomas had 18 points and seven assists and Greivis Vasquez had 13 points for the Kings, who have lost six of seven. Sacramento entered the game averaging the fewest turnovers per game in the NBA, but committed 17 against an aggressive Detroit defense."}
{"game_id": "0021300135", "chunk_id": "0021300135_014", "order": 14, "role": "body", "text": "\"You can't win games if you consistently beat yourself,\" Kings coach Michael Malone said. \"This is one of the few games this year that we turned the ball over at a high rate. The worst part about it was they seemed to score on every turnover we committed.\""}
{"game_id": "0021300135", "chunk_id": "0021300135_015", "order": 15, "role": "body", "text": "Rodney Stuckey scored 16 points for Detroit, which concludes a four-game trip Sunday against the Lakers. Brandon Jennings had 11 points and nine assists, and Kyle Singler added 11 points."}
{"game_id": "0021300135", "chunk_id": "0021300135_016", "order": 16, "role": "body", "text": "A jumper by Stuckey and a basket by Drummond gave the Pistons a 95-82 lead with 3:02 remaining. The Kings, who have a habit of rallying in the fourth quarter and making games close, were unable to put together a significant run in the fourth to the disappointment of a sellout crowd that stayed around until the final seconds."}
{"game_id": "0021300135", "chunk_id": "0021300135_017", "order": 17, "role": "body", "text": "\"We didn't focus on (the crowd) and we didn't talk about this being an ESPN game and all that was going on,\" Cheeks said."}
{"game_id": "0021300135", "chunk_id": "0021300135_018", "order": 18, "role": "body", "text": "The Pistons went ahead by 14 points on a 3 by Smith early in the fourth quarter."}
{"game_id": "0021300135", "chunk_id": "0021300135_019", "order": 19, "role": "body", "text": "Drummond and Smith had seven points apiece in the third quarter and the Pistons scored the final six points of the period to take an 80-70 lead into the fourth. The Pistons outscored the Kings 26-19 in the third."}
{"game_id": "0021300135", "chunk_id": "0021300135_020", "order": 20, "role": "body", "text": "\"We gave them too many second chances by giving the ball away and offensive rebounds,\" said Vasquez, who had eight turnovers. \"We've got to give them credit. They played better at the end and they got the win.\""}
{"game_id": "0021300135", "chunk_id": "0021300135_021", "order": 21, "role": "closing", "text": "Game notes Inspired by Sacramento's only scheduled nationally televised TV game, a raucous sellout crowd at Sleep Train Arena set a Guinness world record for loudest noise at an indoor arena at 126.0 decibels. ... The Kings had a season-high seven turnovers in the first quarter and trailed 27-21. . Veteran Pistons guard Chauncey Billups missed the game due to a sore knee. He is day to day. Rookie Kentavious Caldwell-Pope made his first start of the season in Billups' place. ... Kings reserve forward Patrick Patterson left the game in the opening half with knee contusion and didn't return. . Malone got his first technical of the season in the second quarter for arguing a no-call against Cousins."}
