{"game_id": "0021700776", "chunk_id": "0021700776_001", "order": 1, "role": "lead", "text": "DETROIT --  Blake Griffin's first few days with the Detroit Pistons were a bit of a whirlwind."}
{"game_id": "0021700776", "chunk_id": "0021700776_002", "order": 2, "role": "body", "text": "Detroit was able to win two close games with him, but coach Stan Van Gundy sees a lot of room for improvement."}
{"game_id": "0021700776", "chunk_id": "0021700776_003", "order": 3, "role": "body", "text": "\"I've got to get it figured out offensively,\" Van Gundy said. \"I'm not helping him or us a lot. You could actually see today in the early fourth quarter, we were actually a lot smoother when he was out because we were just playing."}
{"game_id": "0021700776", "chunk_id": "0021700776_004", "order": 4, "role": "body", "text": "\"I've got this great player now, and so we're just sort of playing to him all the time, and the defense is all loaded up.\""}
{"game_id": "0021700776", "chunk_id": "0021700776_005", "order": 5, "role": "body", "text": "Andre Drummond had 23 points and 20 rebounds, and Griffin made a key 3-pointer in the final minute to lift the Pistons to a 111-107 victory over the Miami Heat on Saturday night. Whatever Van Gundy's issues were with the offense, they didn't prevent Detroit from scoring 35 points in the final quarter."}
{"game_id": "0021700776", "chunk_id": "0021700776_006", "order": 6, "role": "body", "text": "Ish Smith added 25 points for the Pistons, including a late 3-pointer of his own. Detroit has won three in a row, the last two with Griffin in the lineup after acquiring him in a trade ."}
{"game_id": "0021700776", "chunk_id": "0021700776_007", "order": 7, "role": "body", "text": "Griffin's 3-pointer with 44 seconds to play put the Pistons ahead 108-101, but Goran Dragic responded with a four-point play, making a 3-pointer while being fouled with 32 seconds left. Detroit ran the clock down on the next possession, and Smith sank his only 3-point attempt of the game, from the right corner with 14 seconds to play."}
{"game_id": "0021700776", "chunk_id": "0021700776_008", "order": 8, "role": "body", "text": "\"We played that the way we wanted, but Griffin made the pass and Smith stepped up and hit the 3,\" Heat coach Erik Spoelstra said. \"It doesn't matter if he's not known as a 3-point shooter, he made that one when they really needed it.\""}
{"game_id": "0021700776", "chunk_id": "0021700776_009", "order": 9, "role": "body", "text": "Dragic scored 33 points for the Heat, who have lost three in a row. Miami was without center Hassan Whiteside, who was out with an illness."}
{"game_id": "0021700776", "chunk_id": "0021700776_010", "order": 10, "role": "body", "text": "Smith, who has struggled at times while trying to replace injured point guard Reggie Jackson, went 11 of 14 from the field and finished three points shy of his career high. His previous season high was 19 points."}
{"game_id": "0021700776", "chunk_id": "0021700776_011", "order": 11, "role": "body", "text": "Griffin had 16 points, nine rebounds and seven assists."}
{"game_id": "0021700776", "chunk_id": "0021700776_012", "order": 12, "role": "body", "text": "\"Just a little more tired today -- the adrenaline wore off a little bit, just the toll of the week,\" Griffin said. \"It's amazing to see all these guys step up and play so well.\""}
{"game_id": "0021700776", "chunk_id": "0021700776_014", "order": 14, "role": "body", "text": "Heat: Olynyk and Josh Richardson scored 19 points for the Heat, and James Johnson added 18."}
{"game_id": "0021700776", "chunk_id": "0021700776_015", "order": 15, "role": "body", "text": "Pistons: Langston Galloway scored 13 points, surpassing 2,000 for his career. ... Detroit was without G Luke Kennard (foot) and G Dwight Buycks (illness)."}
{"game_id": "0021700776", "chunk_id": "0021700776_017", "order": 17, "role": "body", "text": "Drummond had at least 20 points and 20 rebounds for the sixth time this season. He has 19 20-20 games since 2012-13."}
{"game_id": "0021700776", "chunk_id": "0021700776_018", "order": 18, "role": "body", "text": "He also had four steals, four blocks and six turnovers. He was the first player with at least 20 points, 20 rebounds, four steals and four blocks since Hakeem Olajuwon on Dec. 22, 1989."}
{"game_id": "0021700776", "chunk_id": "0021700776_020", "order": 20, "role": "body", "text": "Drummond and Griffin had nearly as many rebounds as the entire Miami team, and the Pistons finished with a 49-33 advantage in that category."}
{"game_id": "0021700776", "chunk_id": "0021700776_021", "order": 21, "role": "body", "text": "\"They are really tough, because they've got two of the best rebounders in the league, especially Drummond,\" Olynyk said. \"You have to stop him, and then you've got to stop Griffin, who has all that strength and that vertical leap. You have to find a way, but it isn't easy.\""}
{"game_id": "0021700776", "chunk_id": "0021700776_023", "order": 23, "role": "body", "text": "Heat: Host the Orlando Magic on Monday night."}
{"game_id": "0021700776", "chunk_id": "0021700776_024", "order": 24, "role": "body", "text": "Pistons: Host the Portland Trail Blazers on Monday night."}
{"game_id": "0021700776", "chunk_id": "0021700776_026", "order": 26, "role": "body", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
{"game_id": "0021700776", "chunk_id": "0021700776_028", "order": 28, "role": "closing", "text": "Follow Noah Trister at www.Twitter.com/noahtrister"}
