{"game_id": "0021700093", "chunk_id": "0021700093_001", "order": 1, "role": "lead", "text": "MIAMI --  It's never been easy for Andrew Wiggins in Miami, and Monday was no exception."}
{"game_id": "0021700093", "chunk_id": "0021700093_002", "order": 2, "role": "body", "text": "That's what made the win even sweeter."}
{"game_id": "0021700093", "chunk_id": "0021700093_003", "order": 3, "role": "body", "text": "Jeff Teague scored 23 points, Wiggins scored 22 -- 13 of them coming after halftime, including a pair of huge baskets late in regulation -- and the Minnesota Timberwolves scored the first six points of overtime before holding on to beat the Miami Heat 125-122."}
{"game_id": "0021700093", "chunk_id": "0021700093_004", "order": 4, "role": "body", "text": "\"We have a lot of people who know how to win, know how to close out games,\" Wiggins said."}
{"game_id": "0021700093", "chunk_id": "0021700093_005", "order": 5, "role": "body", "text": "That was evident. The Timberwolves never trailed in the final 11 1/2 minutes, yet still needed to see Dion Waiters' 35-footer as time expired clang helplessly off the rim before they could escape."}
{"game_id": "0021700093", "chunk_id": "0021700093_006", "order": 6, "role": "body", "text": "\"We've got some guys on this team that can really play,\" Teague said. \"Down the stretch, Wig was huge.\""}
{"game_id": "0021700093", "chunk_id": "0021700093_007", "order": 7, "role": "body", "text": "Karl-Anthony Towns scored 20 points and grabbed 12 rebounds for the Timberwolves, who got 16 from Jimmy Butler and 13 from Jamal Crawford."}
{"game_id": "0021700093", "chunk_id": "0021700093_008", "order": 8, "role": "body", "text": "Waiters tied a career-high by scoring 33 for Miami, 14 of those coming in the fourth quarter including a layup that sent the game to overtime. But the Heat dropped their third straight -- all at home."}
{"game_id": "0021700093", "chunk_id": "0021700093_009", "order": 9, "role": "body", "text": "\"It doesn't mean (anything) if we don't get the win,\" Waiters said."}
{"game_id": "0021700093", "chunk_id": "0021700093_010", "order": 10, "role": "body", "text": "Kelly Olynyk scored 23 points and Goran Dragic added 18 for Miami -- which was again without center Hassan Whiteside, out for a fifth consecutive game with a bruised left knee. Bam Adebayo started again in his place and had the best game of his rookie season, finishing with 13 points and 13 rebounds."}
{"game_id": "0021700093", "chunk_id": "0021700093_011", "order": 11, "role": "body", "text": "\"It was great to see,\" Heat coach Erik Spoelstra said of the rookie's stat line, which came against a star in Towns."}
{"game_id": "0021700093", "chunk_id": "0021700093_012", "order": 12, "role": "body", "text": "Wiggins got to the line with 43 seconds left after missing a dunk on a play where Justise Winslow was called for a foul that left the Heat arguing otherwise -- but replays suggested was indeed correct. He made both free throws to put Minnesota up by four, and the Heat would eventually get back within one on a 3-pointer by Waiters with 5.1 seconds left."}
{"game_id": "0021700093", "chunk_id": "0021700093_013", "order": 13, "role": "body", "text": "Teague made a pair of free throws, and Miami's desperation heave from Waiters was off."}
{"game_id": "0021700093", "chunk_id": "0021700093_014", "order": 14, "role": "body", "text": "\"There's a lot of work for us to do defensively,\" Timberwolves coach Tom Thibodeau said."}
{"game_id": "0021700093", "chunk_id": "0021700093_015", "order": 15, "role": "body", "text": "Wiggins had both Minnesota baskets in the final 1:01 of regulation, a putback of his own miss and an emphatic dunk for a four-point lead. He's had some good scoring games against the Heat -- at least 22 in four of seven contests -- but he's earned it all. After shooting 7 for 23 Monday, he's now 46 for 125 (36.8 percent) against the Heat."}
{"game_id": "0021700093", "chunk_id": "0021700093_016", "order": 16, "role": "body", "text": "He had a chance to put the Timberwolves up four again with 12 seconds left in regulation, but missed a layup. Winslow got the rebound for Miami and on the ensuing possession Waiters blew past Butler for a layup to tie it at 110."}
{"game_id": "0021700093", "chunk_id": "0021700093_017", "order": 17, "role": "body", "text": "Minnesota scored the next six, and found a way from there."}
{"game_id": "0021700093", "chunk_id": "0021700093_018", "order": 18, "role": "body", "text": "\"We did things necessary to win at the end,\" Thibodeau said."}
{"game_id": "0021700093", "chunk_id": "0021700093_020", "order": 20, "role": "body", "text": "Timberwolves: Minnesota's first six 3-pointers came from six different players. ... Towns took only 11 shots from the floor, perhaps a bit of a surprise since Miami was without Whiteside. ... The Timberwolves can get their first three-game winning streak since January with a win on Wednesday."}
{"game_id": "0021700093", "chunk_id": "0021700093_021", "order": 21, "role": "body", "text": "Heat: Miami missed more free throws in the first quarter (three) than in its two previous games combined (two). ... Okaro White gave the Heat a big boost late in the third, scoring five points on a putback dunk and 3-pointer that cut Minnesota's six-point lead to one. ... Miami was cold from 3-point range again, shooting 7 for 27 from beyond the arc."}
{"game_id": "0021700093", "chunk_id": "0021700093_023", "order": 23, "role": "body", "text": "Dragic came out sizzling, and that's been a trend. He was 5 for 5 in the first quarter, the second time he's done that in the last three games. Dragic is shooting 20 for 29 (69 percent) in first quarters this season, and 16 for 20 (80 percent) in the opening periods of his last four games."}
{"game_id": "0021700093", "chunk_id": "0021700093_025", "order": 25, "role": "body", "text": "Minnesota was 32 for 35 from the line, a huge factor in the game. Miami was 17 for 25."}
{"game_id": "0021700093", "chunk_id": "0021700093_027", "order": 27, "role": "body", "text": "Timberwolves: Visit New Orleans on Wednesday, the finale of a two-game trip."}
{"game_id": "0021700093", "chunk_id": "0021700093_028", "order": 28, "role": "closing", "text": "Heat: Host Chicago on Wednesday, ending a six-game homestand."}
