{"game_id": "0021700719", "chunk_id": "0021700719_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Giannis Antetokounmpo took eight days off and missed back-to-back games to manage chronic pain in his right knee."}
{"game_id": "0021700719", "chunk_id": "0021700719_002", "order": 2, "role": "body", "text": "\"I definitely felt lost because this is what I love to do, to play games,\" Antetokounmpo said."}
{"game_id": "0021700719", "chunk_id": "0021700719_003", "order": 3, "role": "body", "text": "The All-Star forward returned to the lineup Friday night, scoring 41 points and adding 13 rebounds to help the Milwaukee Bucks beat the Brooklyn Nets 116-91."}
{"game_id": "0021700719", "chunk_id": "0021700719_004", "order": 4, "role": "body", "text": "He sealed it late, dribbling between his legs before hitting a jumper over Quincy Acy and drawing a foul. Antetokounmpo made the free throw, and hit a 3-pointer on the next possession."}
{"game_id": "0021700719", "chunk_id": "0021700719_005", "order": 5, "role": "body", "text": "\"If I'm open I'm going to shoot it,\" Antetokounmpo said. \"I'm going to go with the flow of the game.\""}
{"game_id": "0021700719", "chunk_id": "0021700719_006", "order": 6, "role": "body", "text": "Khris Middleton added 21 points for the Bucks in their second game since coach Jason Kidd was fired Monday. They also beat the Nets for the ninth consecutive time."}
{"game_id": "0021700719", "chunk_id": "0021700719_007", "order": 7, "role": "body", "text": "\"We're growing. We're out here having fun,\" Middleton said. \"As long as we play unselfishly, we're a very dangerous team.\""}
{"game_id": "0021700719", "chunk_id": "0021700719_008", "order": 8, "role": "body", "text": "DeMarre Carroll and D'Angelo Russell had 14 points apiece for Brooklyn."}
{"game_id": "0021700719", "chunk_id": "0021700719_009", "order": 9, "role": "body", "text": "\"Total domination by the Bucks,\" Brooklyn coach Kenny Atkinson said. \"I thought they were better at every position.\""}
{"game_id": "0021700719", "chunk_id": "0021700719_010", "order": 10, "role": "body", "text": "Milwaukee built a 28-point first-half lead. Brooklyn, which had just 35 points at the half, scored 37 in the third quarter and got within seven points late in the period."}
{"game_id": "0021700719", "chunk_id": "0021700719_011", "order": 11, "role": "body", "text": "\"Energy and enthusiasm has to be there and we need it every game,\" Milwaukee coach Joe Prunty said. \"In the third quarter, we had a little bit of a lull.\""}
{"game_id": "0021700719", "chunk_id": "0021700719_012", "order": 12, "role": "body", "text": "The Nets, coming off a one-point loss to Oklahoma City on Tuesday night, struggled offensively throughout the first half, connecting on just 26 percent of their shots, including 4 of 20 from 3-point range. Milwaukee led 58-35 at the half."}
{"game_id": "0021700719", "chunk_id": "0021700719_013", "order": 13, "role": "body", "text": "\"I'm disappointed. I felt that after Oklahoma City we'd come in here and give a better effort,\" Atkinson said. \"That wasn't the case. I thought our shot selection was, quit honestly, very poor. We weren't sharing the ball.\""}
{"game_id": "0021700719", "chunk_id": "0021700719_014", "order": 14, "role": "body", "text": "The Bucks opened on a 16-2 run and led 33-15 after the quarter, led by Antetokounmpo with 11 points."}
{"game_id": "0021700719", "chunk_id": "0021700719_016", "order": 16, "role": "body", "text": "Police officers used a stun gun on Bucks rookie guard Sterling Brown and arrested the 22-year-old Friday after a confrontation at a pharmacy parking lot. \"It's a personal issue I'm dealing with right now,\" Brown said before the game. Brown had what appeared to be a bruise and scratches on the right side of his face. Officers contacted a man believed to be Brown after seeing a vehicle parked across two handicapped parking spots while doing a business check at about 2 a.m. Asked if there could be any discipline for Brown, coach Joe Prunty said: \"We believe it will be resolved quickly.\" Brown entered the game midway through the first quarter. He scored four points in 27 minutes."}
{"game_id": "0021700719", "chunk_id": "0021700719_017", "order": 17, "role": "body", "text": "\"I thought Sterling did a nice job in terms of focus,\" Prunty said. \"Came here and did his job and competed.\""}
{"game_id": "0021700719", "chunk_id": "0021700719_019", "order": 19, "role": "body", "text": "After missing 31 games with a knee injury before returning to action last week, D'Angelo Russell showed signs of his old form. \"He got in a good stretch there,\" Atkinson said. \"He looked like he did in the beginning of the year for us.\" Russell made consecutive 3-pointers from about 28 feet late in the third quarter. \"Seeing the ball go through the net is definitely a good feeling,\" Russell said."}
{"game_id": "0021700719", "chunk_id": "0021700719_021", "order": 21, "role": "body", "text": "Nets: Brooklyn shot just 22 percent in the first quarter, including 2 of 13 from 3-point range. ... Rondae Hollis-Jefferson limped off the court midway the second quarter with a strained right groin and didn't return. \"That was a big blow to our defense,\" Atkinson said. ... Brooklyn made buzzer-beating 3-pointers at the end of the first and second quarters."}
{"game_id": "0021700719", "chunk_id": "0021700719_022", "order": 22, "role": "body", "text": "Bucks: G Malcolm Brogdon missed the game due to right calf soreness. ... Former Milwaukee player Vin Baker has been hired as an assistant coach. Baker most recently served as a pre- and postgame analyst for Bucks telecasts and served as a volunteer coaching assistant. ... Milwaukee Brewers players Josh Hader, Brett Phillips and Jacob Barnes sat courtside."}
{"game_id": "0021700719", "chunk_id": "0021700719_024", "order": 24, "role": "body", "text": "Nets: At Minnesota on Saturday night."}
