{"game_id": "0021300519", "chunk_id": "0021300519_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  One swish after another, Damian Lillard pulled Portland closer."}
{"game_id": "0021300519", "chunk_id": "0021300519_002", "order": 2, "role": "body", "text": "One or two more, and he might've pulled off one of the NBA's most improbable comebacks this season."}
{"game_id": "0021300519", "chunk_id": "0021300519_003", "order": 3, "role": "body", "text": "DeMarcus Cousins tied a season-high with 35 points to go with 13 rebounds, Rudy Gay scored 32 points and the Sacramento Kings held off a furious rally by Lillard to beat the Trail Blazers 123-119 on Tuesday night."}
{"game_id": "0021300519", "chunk_id": "0021300519_004", "order": 4, "role": "body", "text": "\"That's the craziest game I've ever been a part of,\" Cousins said. \"I could not wait until the end. I don't ever want to be in a situation with the ball in Damian Lillard's hands. I'm glad we got the win, but that was a scary thing.\""}
{"game_id": "0021300519", "chunk_id": "0021300519_005", "order": 5, "role": "body", "text": "Cousins and Gay provided the spark for a 32-12 run at the end of the third and beginning of the fourth quarters that put Sacramento ahead by 19 points. Gay fouled out with 4:12 remaining, and the Blazers nearly rallied back."}
{"game_id": "0021300519", "chunk_id": "0021300519_006", "order": 6, "role": "body", "text": "After scoring just 13 points in the third quarter, Portland had 46 points in the final period."}
{"game_id": "0021300519", "chunk_id": "0021300519_007", "order": 7, "role": "body", "text": "Lillard alone scored 26 of his career-high 41 points in the fourth to power Portland within two in the final minute, breaking the franchise record for points in a quarter. Terry Porter scored 25 points against Golden State on Nov. 14, 1992."}
{"game_id": "0021300519", "chunk_id": "0021300519_008", "order": 8, "role": "body", "text": "But the Kings made just enough free throws hold off Lillard and the Blazers, who have lost four of their last six games."}
{"game_id": "0021300519", "chunk_id": "0021300519_009", "order": 9, "role": "body", "text": "\"That clock was moving very, very slow,\" Kings coach Michael Malone said. \"Damian just kept on coming.\""}
{"game_id": "0021300519", "chunk_id": "0021300519_010", "order": 10, "role": "body", "text": "LaMarcus Aldridge added 24 points and eight rebounds, and Nicolas Batum finished with 11 points, 11 rebounds and five assists while playing with a fractured left middle finger in Portland's latest loss."}
{"game_id": "0021300519", "chunk_id": "0021300519_011", "order": 11, "role": "body", "text": "The Kings had dropped two straight after beating top contenders Miami and Houston. Sacramento held a players-only meeting on Sunday, and the Kings emerged to knock off another one of the NBA's best."}
{"game_id": "0021300519", "chunk_id": "0021300519_012", "order": 12, "role": "body", "text": "Gay made consecutive 3-pointers, a three-point play and a layup during Sacramento's surge in the fourth. Cousins also put back a rebound and hit a jumper to help the Kings go ahead 102-83 with 7:54 remaining."}
{"game_id": "0021300519", "chunk_id": "0021300519_013", "order": 13, "role": "body", "text": "Sacramento led 117-105 with 1:12 to play when Lillard turned into a one-man wrecking crew."}
{"game_id": "0021300519", "chunk_id": "0021300519_014", "order": 14, "role": "body", "text": "The reigning NBA Rookie of the Year made three 3-pointers, a fast-break layup and was fouled shooting another from beyond the arc -- which just rimmed out. He made all three free throws to slice Sacramento's lead to 121-119 with 16.5 seconds left."}
{"game_id": "0021300519", "chunk_id": "0021300519_015", "order": 15, "role": "body", "text": "\"Once I make a few, I can get going,\" Lillard said."}
{"game_id": "0021300519", "chunk_id": "0021300519_016", "order": 16, "role": "body", "text": "Isaiah Thomas hit two free throws before Lillard missed from long range to all but end the comeback. Lillard shot 13 of 24 from the floor and added seven rebounds and four assists."}
{"game_id": "0021300519", "chunk_id": "0021300519_017", "order": 17, "role": "body", "text": "\"He's a competitor and at no time does he ever think he's out of a game,\" Blazers coach Terry Stotts said. \"He's done that a lot in the two years he's been here. He's a special player.\""}
{"game_id": "0021300519", "chunk_id": "0021300519_018", "order": 18, "role": "body", "text": "In a matchup between one of the best and one of the worst teams in the West, Sacramento flipped the script on a Blazers team that had cruised through most of its schedule."}
{"game_id": "0021300519", "chunk_id": "0021300519_019", "order": 19, "role": "body", "text": "The Blazers also had beaten the Kings on consecutive nights in November, winning 104-91 in Portland and 96-85 in Sacramento. The Kings started three players who did not start in the two previous games against Portland -- most notably Gay, who was acquired from Toronto in a seven-player trade in early December."}
{"game_id": "0021300519", "chunk_id": "0021300519_020", "order": 20, "role": "body", "text": "That included Marcus Thornton moving back in the starting lineup for Sacramento, replacing seventh overall pick Ben McLemore. Thornton finished with three points and eight rebounds, and McLemore had two points and two assists."}
{"game_id": "0021300519", "chunk_id": "0021300519_021", "order": 21, "role": "body", "text": "The Blazers still outscored Sacramento 35-24 in the first quarter and seemed ready to go 3-0 against the Kings this season. Portland shot 63.2 percent from the floor and made 10 of 11 free throws in the period."}
{"game_id": "0021300519", "chunk_id": "0021300519_022", "order": 22, "role": "body", "text": "Instead, the Kings opened the second quarter on a 14-5 run led by mostly reserves. The teams traded baskets for the remainder of the half, and the Blazers held a 60-55 lead at the break."}
{"game_id": "0021300519", "chunk_id": "0021300519_023", "order": 23, "role": "body", "text": "Thomas, who had 22 points and eight assists, hit a pair of 3s to highlight a 13-2 spurt for Sacramento to start the third quarter. Portland's topsy-turvy second half just wasn't enough to rally behind Lillard."}
{"game_id": "0021300519", "chunk_id": "0021300519_024", "order": 24, "role": "body", "text": "\"I just didn't want to lose the game,\" Lillard said. \"We had some good spurts on offense, then some bad spurts on defense, then bad spurts on offense, and then good defense. We just need to be more consistent. But when it came down to it we still had a chance to win the game. That's all I was thinking about.\""}
{"game_id": "0021300519", "chunk_id": "0021300519_025", "order": 25, "role": "body", "text": "Game notes Lillard's previous career high was 37 points against the Warriors last year. ... C.J. McCollum, the 10th overall pick in the NBA draft out of Lehigh, was in Portland's active lineup for the first time this season after fracturing his left foot in training camp. He did not play. \"I just didn't think tonight was the night,\" Stotts said  ... The Blazers and Kings meet for the final time this season April 9 in Portland."}
{"game_id": "0021300519", "chunk_id": "0021300519_027", "order": 27, "role": "closing", "text": "Antonio Gonzalez can be reached at: www.twitter.com/agonzalezAP"}
