{"game_id": "0021100528", "chunk_id": "0021100528_001", "order": 1, "role": "lead", "text": "TORONTO -- As usual, a trip to Toronto brought out the best in Rudy Gay."}
{"game_id": "0021100528", "chunk_id": "0021100528_002", "order": 2, "role": "body", "text": "Gay had 23 points and 12 rebounds, Mike Conley and Marc Gasol each scored 21 and the Memphis Grizzlies beat Toronto 102-99 Friday night, their sixth straight victory over the Raptors."}
{"game_id": "0021100528", "chunk_id": "0021100528_003", "order": 3, "role": "body", "text": "\"We won one by our chinny chin chin,\" Grizzlies coach Lionel Hollins said."}
{"game_id": "0021100528", "chunk_id": "0021100528_004", "order": 4, "role": "body", "text": "Gay clinched the win for Memphis on his previous visit north of the border, hitting the game-winning jump shot with less than a second left in a 100-98 victory on Jan. 24, 2011."}
{"game_id": "0021100528", "chunk_id": "0021100528_005", "order": 5, "role": "body", "text": "He was just as vital in this one, connecting on a go-ahead jumper with 26 seconds left to put Memphis up 100-99."}
{"game_id": "0021100528", "chunk_id": "0021100528_006", "order": 6, "role": "body", "text": "\"I don't know what it is about (Toronto),\" Gay said. \"I just like it. Everybody has those places where they play well and this has been mine.\""}
{"game_id": "0021100528", "chunk_id": "0021100528_007", "order": 7, "role": "body", "text": "O.J. Mayo scored 16 points and Dante Cunningham added 11 as the Grizzlies won for the seventh time in eight games."}
{"game_id": "0021100528", "chunk_id": "0021100528_008", "order": 8, "role": "body", "text": "\"The biggest thing for us is our chemistry,\" Conley said. \"The way we're moving the ball and communicating on defense has just been phenomenal.\""}
{"game_id": "0021100528", "chunk_id": "0021100528_009", "order": 9, "role": "body", "text": "Gay agreed, saying this Grizzlies team is \"on another level\" when it comes to focus and preparation."}
{"game_id": "0021100528", "chunk_id": "0021100528_010", "order": 10, "role": "body", "text": "\"I've been on enough teams where we're just playing to play and this team isn't like that,\" Gay said. \"We're actually trying to go out there and be aggressive and get Ws.\""}
{"game_id": "0021100528", "chunk_id": "0021100528_011", "order": 11, "role": "body", "text": "Jerryd Bayless had 18 points and James Johnson 14 for the Raptors, who have lost nine of 12."}
{"game_id": "0021100528", "chunk_id": "0021100528_012", "order": 12, "role": "body", "text": "Five of Toronto's past eight defeats have been by three points or fewer. The Raptors haven't lost by more than seven points since a 100-64 blowout at Boston on Feb. 1."}
{"game_id": "0021100528", "chunk_id": "0021100528_013", "order": 13, "role": "body", "text": "That string of late-game losses and failed execution is starting to grate on Raptors coach Dwane Casey."}
{"game_id": "0021100528", "chunk_id": "0021100528_014", "order": 14, "role": "body", "text": "\"Somewhere the basketball gods are waiting for us to make those plays, to be good to us,\" Casey said. \"Right now, and I've seen a lot of NBA games, we're doing everything to win the games except winning games.\""}
{"game_id": "0021100528", "chunk_id": "0021100528_015", "order": 15, "role": "body", "text": "Leandro Barbosa scored 13 points, Linas Kleiza had 12 and Amir Johnson and Jose Calderon each had 10 for Toronto."}
{"game_id": "0021100528", "chunk_id": "0021100528_016", "order": 16, "role": "body", "text": "Calderon shared his coach's frustration at coming up short again."}
{"game_id": "0021100528", "chunk_id": "0021100528_017", "order": 17, "role": "body", "text": "\"We fought and gave it everything we had,\" Calderon said. \"We just couldn't finish at the end.\""}
{"game_id": "0021100528", "chunk_id": "0021100528_018", "order": 18, "role": "body", "text": "Barbosa scored seven points as Toronto opened the fourth with an 11-2 run, turning a 77-75 deficit into an 86-79 lead with 9:45 left. Gasol sandwiched two baskets around a fast-break layup by Conley as the Grizzlies cut the gap to 86-85 with 7:41 to go."}
{"game_id": "0021100528", "chunk_id": "0021100528_019", "order": 19, "role": "body", "text": "After a Toronto timeout, Kleiza scored three straight baskets for the Raptors, giving them a 93-87 edge with 6:17 left. Conley hit a jumper, Mayo made one of two from the line, Cunningham added a dunk and Gay completed a three-point play as Memphis took a 95-93 lead with 3:19 remaining."}
{"game_id": "0021100528", "chunk_id": "0021100528_020", "order": 20, "role": "body", "text": "James Johnson ended Toronto's 4:39 scoreless streak with a three-point play at 1:38, but Gasol answered with a jumper. Calderon drove for a layup and was fouled but missed his free throw, putting the Raptors up one. Cunningham was fouled at the other end and made one of two, knotting the score at 98-98 with 52 seconds left."}
{"game_id": "0021100528", "chunk_id": "0021100528_021", "order": 21, "role": "body", "text": "Toronto's Aaron Gray made one of two from the line with 40 seconds left before Gay put Memphis in front with a jumper from the wing, holding his finger to his lips as he ran back down the court."}
{"game_id": "0021100528", "chunk_id": "0021100528_022", "order": 22, "role": "body", "text": "\"They were in zone,\" Gay said. \"Marc drew a couple of defenders and I was one-on-one with Aaron Gray. He gave me a little bit of space and I just saw an opening.\""}
{"game_id": "0021100528", "chunk_id": "0021100528_023", "order": 23, "role": "body", "text": "Conley said the Grizzlies \"expected\" Gay to make the decisive shot."}
{"game_id": "0021100528", "chunk_id": "0021100528_024", "order": 24, "role": "body", "text": "\"That's what we drew up for him,\" Conley said. \"He made one here last year and we were hoping he'd do the same thing.\""}
{"game_id": "0021100528", "chunk_id": "0021100528_025", "order": 25, "role": "body", "text": "After Kleiza missed for Toronto, Mayo's long outlet pass found Tony Allen for a fast-break layup. Allen was fouled on the play but missed his free throw, and Toronto called timeout trailing 102-99 with less than eight seconds to go."}
{"game_id": "0021100528", "chunk_id": "0021100528_026", "order": 26, "role": "body", "text": "Toronto had a chance to tie, but Calderon's 3-point attempt bounced off the rim with four seconds left."}
{"game_id": "0021100528", "chunk_id": "0021100528_027", "order": 27, "role": "body", "text": "\"It looked pretty good, it just went long,\" Gasol said of Calderon's effort. \"Probably a couple inches long, that's all.\""}
{"game_id": "0021100528", "chunk_id": "0021100528_028", "order": 28, "role": "body", "text": "Conley was fouled on the rebound and missed both free throws, but Toronto ran out of time before getting off another shot."}
{"game_id": "0021100528", "chunk_id": "0021100528_029", "order": 29, "role": "body", "text": "The Raptors led 13-4 midway through the first before the Grizzlies battled back, ending the first quarter with a 9-2 run to lead 23-21 after one."}
{"game_id": "0021100528", "chunk_id": "0021100528_030", "order": 30, "role": "body", "text": "A three-point play by Ed Davis restored Toronto's nine-point advantage, putting the Raptors up 39-30 with 6:48 left in the second. This time they held on to the lead, thanks to 10 second-quarter points from Bayless, taking a 52-45 edge into halftime."}
{"game_id": "0021100528", "chunk_id": "0021100528_031", "order": 31, "role": "body", "text": "Conley scored five points and Gay added four as Memphis reeled off an 11-0 run over the first 3:13 of the third quarter to lead 56-52."}
{"game_id": "0021100528", "chunk_id": "0021100528_032", "order": 32, "role": "body", "text": "Toronto fell behind by seven before reclaiming the lead with an 8-0 run, but four straight free throws by Mayo put Memphis back on top. Barbosa made a driving layup with just over a second left in the third, and Toronto trailed 77-75 heading into the fourth."}
{"game_id": "0021100528", "chunk_id": "0021100528_033", "order": 33, "role": "closing", "text": "Game notes Gay's career high in rebounds is 13, set three times. ... Memphis is 10-0 when scoring 100 points or more. ... The Raptors had just four offensive rebounds, matching a season low. ... Toronto's Andrea Bargnani (left calf) missed his 17th straight game. Bargnani has missed 23 of the past 25 games. ... This was the first of four home games in six nights for the Raptors. They host Golden State on Sunday, Orlando on Monday and Houston on Wednesday. ... Calderon had nine assists."}
