{"game_id": "0021700892", "chunk_id": "0021700892_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Something has changed for the Hornets' bench in the last three game. Cody Zeller calls it \"rhythm.\" Frank Kaminsky calls it \"flow.\""}
{"game_id": "0021700892", "chunk_id": "0021700892_002", "order": 2, "role": "body", "text": "No matter what name this newfound chemistry goes by, it has added up to the best play of the season from Charlotte reserves. And Sunday, it meant the difference as the Hornets beat the Detroit Pistons 114-98 for a season-best fourth straight win."}
{"game_id": "0021700892", "chunk_id": "0021700892_003", "order": 3, "role": "body", "text": "Dwight Howard led the Hornets with 17 points and 12 rebounds, while Kemba Walker also recorded 17 points for Charlotte. But it was the Hornets' bench outscoring Detroit's reserves 51-28 that gave Charlotte the biggest edge."}
{"game_id": "0021700892", "chunk_id": "0021700892_004", "order": 4, "role": "body", "text": "\"This is maybe the best 3-4 games we've played all season just because we're starting to put it together, especially on the defensive end,\" Zeller said. \"Everyone is tied together.\""}
{"game_id": "0021700892", "chunk_id": "0021700892_005", "order": 5, "role": "body", "text": "The Hornets improved to 27-33 while making a push toward the No. 8 seed in the Eastern Conference for the playoffs. The Pistons have 28 wins, and there are eight teams in the conference with at least 31 victories."}
{"game_id": "0021700892", "chunk_id": "0021700892_006", "order": 6, "role": "body", "text": "The Hornets used a 14-0 run, sparked entirely by the bench, to outscore Detroit 38-27 in the second quarter. In that big stretch, reserve forward Kaminsky had six points while backup center Zeller and forward Traveon Graham each had four."}
{"game_id": "0021700892", "chunk_id": "0021700892_007", "order": 7, "role": "body", "text": "\"Everyone's being aggressive, moving the ball well and playing good defense,\" Kaminsky said. \"That's where we struggled for a lot of the season, is figuring out each other, how we're playing defense with each other. I think we've started to figure it out.\""}
{"game_id": "0021700892", "chunk_id": "0021700892_008", "order": 8, "role": "body", "text": "For Kaminsky, it wasn't only a chemistry issue with his fellow reserves, but a matter of obtaining much-needed rest during the All-Star break. In three games since returning from the break, Kaminsky is averaging 13.3 points on 44.8 percent shooting, including 62.5 percent from 3-point range."}
{"game_id": "0021700892", "chunk_id": "0021700892_009", "order": 9, "role": "body", "text": "\"I needed a little bit of a break,\" Kaminsky admitted. \"Get away mentally, get away physically. It was good for not only me, but it feels like it was good for everybody.\""}
{"game_id": "0021700892", "chunk_id": "0021700892_010", "order": 10, "role": "body", "text": "The Pistons, on the other hand, haven't fared as well since the break. They lost their second straight, and for the fifth time in the last six games."}
{"game_id": "0021700892", "chunk_id": "0021700892_011", "order": 11, "role": "body", "text": "Blake Griffin led the Pistons with 20 points on 10-for-18 shooting, while Andre Drummond had 14 points and 14 rebounds."}
{"game_id": "0021700892", "chunk_id": "0021700892_012", "order": 12, "role": "body", "text": "And among regular bench players, only James Ennis III (nine points) was not held scoreless."}
{"game_id": "0021700892", "chunk_id": "0021700892_013", "order": 13, "role": "body", "text": "\"We're just having so much trouble when we go to the bench,\" Pistons coach Stan Van Gundy said."}
{"game_id": "0021700892", "chunk_id": "0021700892_014", "order": 14, "role": "body", "text": "Van Gundy attempted to tweak his lineup with a new rotation, resting both Griffin and Drummond for stretches."}
{"game_id": "0021700892", "chunk_id": "0021700892_015", "order": 15, "role": "body", "text": "\"I intend to stagger it more,\" Van Gundy said. \"We were playing decent and I decided to just go along with it.\""}
{"game_id": "0021700892", "chunk_id": "0021700892_016", "order": 16, "role": "body", "text": "Still, by halftime, Charlotte held a 70-46 advantage, as all 10 players who got in the game scored. In the end, seven Hornets players scored in double-digits."}
{"game_id": "0021700892", "chunk_id": "0021700892_017", "order": 17, "role": "body", "text": "Howard had 10 points and five rebounds while Nicolas Batum had six assists in the first quarter as the Hornets jumped to a quick 32-19 advantage."}
{"game_id": "0021700892", "chunk_id": "0021700892_019", "order": 19, "role": "body", "text": "Pistons: Griffin drew a technical foul in the fourth quarter after being called for an offensive foul and shoving Zeller after the whistle. ... Anthony Tolliver had a Flagrant 1 foul in the fourth quarter. ... Detroit has forced 10 or more turnovers in 58 of 59 games this season, and in 46 consecutive games. That marks the longest streak in the NBA and the longest streak by a Pistons team since 2007 (49). The Hornets had 18 turnovers."}
{"game_id": "0021700892", "chunk_id": "0021700892_020", "order": 20, "role": "body", "text": "Hornets: With their second win over the Pistons this season, the Hornets clinched a playoff tiebreaker over Detroit. The two teams faced each other for the third and final time Sunday. ... The Hornets neared the franchise record of 77 first-half points, set Jan. 17 against Washington. ... Charlotte held its largest lead of the season -- 32 points -- with 7:34 remaining at 109-77. ... Charlotte shot 16 of 35 on 3-pointers. Detroit was 4 of 18."}
{"game_id": "0021700892", "chunk_id": "0021700892_022", "order": 22, "role": "body", "text": "Howard drew his 12th technical foul Friday at Washington, leaving the Charlotte center four shy of an automatic one-game suspension. That's a total that is shy of only Golden State's Draymond Green, who earned his league-leading 15th technical foul Saturday."}
{"game_id": "0021700892", "chunk_id": "0021700892_023", "order": 23, "role": "body", "text": "Hornets coach Steve Clifford said he's made his big man aware of how much he wants Howard to refrain from receiving many more in the final 22 games of the season."}
{"game_id": "0021700892", "chunk_id": "0021700892_024", "order": 24, "role": "body", "text": "\"Obviously he's got to be careful,\" Clifford said. \"I'll just leave it at that. Obviously we don't want to play any games without him. He knows that.\""}
{"game_id": "0021700892", "chunk_id": "0021700892_026", "order": 26, "role": "body", "text": "Pistons: Play at Toronto on Monday."}
{"game_id": "0021700892", "chunk_id": "0021700892_027", "order": 27, "role": "closing", "text": "Hornets: Host Chicago on Tuesday."}
