{"game_id": "0021200502", "chunk_id": "0021200502_001", "order": 1, "role": "lead", "text": "PHOENIX --  When Zach Randolph found his shooting stroke Sunday night, the Memphis Grizzlies took off."}
{"game_id": "0021200502", "chunk_id": "0021200502_002", "order": 2, "role": "body", "text": "Randolph scored 21 points and Rudy Gay added 20 to lead the Memphis Grizzlies to a 92-81 victory over the Phoenix Suns."}
{"game_id": "0021200502", "chunk_id": "0021200502_003", "order": 3, "role": "body", "text": "\"Zach got going in the post and so we had a few options to run with,\" said Grizzlies coach Lionel Hollins. \"It was a solid win.\""}
{"game_id": "0021200502", "chunk_id": "0021200502_004", "order": 4, "role": "body", "text": "Randolph had been dominant in the team's first two meetings, averaging 16 rebounds and 28 points on 66.7 percent shooting. Though his numbers were slightly lower this time around -- he had only eight rebounds, none on the offensive end -- they were more than enough."}
{"game_id": "0021200502", "chunk_id": "0021200502_005", "order": 5, "role": "body", "text": "Randolph upped his shooting percentage against Phoenix, connecting on 9 of 11 shots from the field and was 3 of 5 on free throws. He also had a steal in 36 minutes."}
{"game_id": "0021200502", "chunk_id": "0021200502_006", "order": 6, "role": "body", "text": "\"It was a good game for us from both ends,\" Randolph said. \"We got stops and everybody chipped in.\""}
{"game_id": "0021200502", "chunk_id": "0021200502_007", "order": 7, "role": "body", "text": "Tony Allen scored 11 and Marc Gasol had 10 points and 12 rebounds for the Grizzlies, who have won three of their last five games."}
{"game_id": "0021200502", "chunk_id": "0021200502_008", "order": 8, "role": "body", "text": "P.J. Tucker scored a career-high 17 points and Marcin Gortat added 12 points and eight rebounds for the Suns. Guards Goran Dragic and Sebastian Telfair combined for just 12 points and seven assists."}
{"game_id": "0021200502", "chunk_id": "0021200502_009", "order": 9, "role": "body", "text": "\"We wanted to kick it in defensively and if their main guys get stopped, we'd get a win,\" Gay said. \"Those guys don't score, most times they lose.\""}
{"game_id": "0021200502", "chunk_id": "0021200502_010", "order": 10, "role": "body", "text": "Phoenix has lost eight of nine and 15 of 20 dating to November 28."}
{"game_id": "0021200502", "chunk_id": "0021200502_011", "order": 11, "role": "body", "text": "\"We're in a bad spot right now,\" said Suns coach Alvin Gentry. \"Number one, we've got to stay together. We can't fragment right now. That's the easiest thing to do. Number two, we've got to play better. And number three, we've got to believe in ourselves. We're not going to play out the season or anything like that.\""}
{"game_id": "0021200502", "chunk_id": "0021200502_012", "order": 12, "role": "body", "text": "Despite shooting in the mid-30 percent range for the bulk of the game, Phoenix trailed only 71-65 when Markieff Morris converted a three-point play 31 seconds into the fourth quarter."}
{"game_id": "0021200502", "chunk_id": "0021200502_013", "order": 13, "role": "body", "text": "But Gasol scored four points, including a fallaway 17-footer, and Gay added a 21-foot jumper to key a 10-3 run that put the Grizzlies ahead 81-68."}
{"game_id": "0021200502", "chunk_id": "0021200502_014", "order": 14, "role": "body", "text": "\"I thought, 'here we go,' that we were going to make a fourth-quarter run but we couldn't get any baskets,\" Tucker said. \"We were right there. We're always right there. But we couldn't get any baskets.\""}
{"game_id": "0021200502", "chunk_id": "0021200502_015", "order": 15, "role": "body", "text": "The Suns shot 78 percent in the first quarter of a loss Friday to Utah, but struggled from the beginning against Memphis, the NBA's top team in opponent scoring. Phoenix missed its first seven shots and 11 of its first 13 on the way to a 23.8 percent shooting quarter and a 32.5 percent first half."}
{"game_id": "0021200502", "chunk_id": "0021200502_016", "order": 16, "role": "body", "text": "Yet the Grizzlies held only a five-point lead after the first and a 41-38 advantage at half, largely due to eight turnovers and 0-for-3 shooting from beyond the 3-point line."}
{"game_id": "0021200502", "chunk_id": "0021200502_017", "order": 17, "role": "body", "text": "\"We've got to fight,\" Gortat said. \"Right now, there's only one guy who fights to the end and that's P.J. Tucker. If we all fought like he does we'd be doing much better.\""}
{"game_id": "0021200502", "chunk_id": "0021200502_018", "order": 18, "role": "closing", "text": "Game notes Memphis became the first team in the series to win on the road since the Grizzlies won in Phoenix on December 8, 2010. ... The Suns had one fast-break point. ... Phoenix remained stuck on 1,999 franchise victories. ... Memphis is 7-28 in Phoenix. ... Suns guard Wesley Johnson played in the first half for just the seventh time in 35 games, scoring his six points on a pair of 3-pointers. ... The Suns' 38 first-half points were one more than the team's season low. ... Gay is nine minutes short of becoming the franchise leader in minutes played."}
