{"game_id": "0021400240", "chunk_id": "0021400240_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Missing three starters, the Houston Rockets turned to its most dominant player and an aging veteran for help against the Milwaukee Bucks on Saturday night."}
{"game_id": "0021400240", "chunk_id": "0021400240_002", "order": 2, "role": "body", "text": "Both James Harden and 37-year-old Jason Terry came through with big games, and ended the Bucks modest three-game winning streak."}
{"game_id": "0021400240", "chunk_id": "0021400240_003", "order": 3, "role": "body", "text": "Harden had 19 of his game-high 34 points in the decisive third quarter and the Rockets beat the Bucks 117-103 on Saturday night."}
{"game_id": "0021400240", "chunk_id": "0021400240_004", "order": 4, "role": "body", "text": "\"When we got it rollin' like that, it's hard to guard us, and when we're playing defense it's even tougher,\" Harden said."}
{"game_id": "0021400240", "chunk_id": "0021400240_005", "order": 5, "role": "body", "text": "\"We're playing at a high level and the ball is moving, there's no defense for that,\" he said."}
{"game_id": "0021400240", "chunk_id": "0021400240_006", "order": 6, "role": "body", "text": "The Rockets were playing their sixth consecutive game without Dwight Howard (knee strain) and also were missing two other starters and backup point guard Isaiah Canaan."}
{"game_id": "0021400240", "chunk_id": "0021400240_007", "order": 7, "role": "body", "text": "Canaan was hurt in the Rockets Friday night loss to the Los Angeles Clippers, so Houston turned to Terry, who started for the first time this season. The veteran scored a season-high 18 points with six rebounds and five assists in 34 minutes."}
{"game_id": "0021400240", "chunk_id": "0021400240_008", "order": 8, "role": "body", "text": "\"The sky's the limit, we're just scratching the surface of what we can be,\" Terry said. \"We've done it in stretches, now is the fact that we can do it consistently and we have to get healthy."}
{"game_id": "0021400240", "chunk_id": "0021400240_009", "order": 9, "role": "body", "text": "\"Once we're healthy then you can really see what this team has,\" he said."}
{"game_id": "0021400240", "chunk_id": "0021400240_010", "order": 10, "role": "body", "text": "Terry was traded by the Brooklyn Nets to Sacramento in February, but never played for the Kings while rehabilitating his left knee."}
{"game_id": "0021400240", "chunk_id": "0021400240_011", "order": 11, "role": "body", "text": "\"If I'm needed, my number's called, I've got to step up,\" Terry said. \"I have to do it more consistently. I haven't played basketball since February of last year and I'm still getting my legs under me. There's more to come down the road.\""}
{"game_id": "0021400240", "chunk_id": "0021400240_012", "order": 12, "role": "body", "text": "Rookie Jabari Parker scored 19 points and Ersan Ilyasova added 18 for Milwaukee, which had its three-game winning streak snapped."}
{"game_id": "0021400240", "chunk_id": "0021400240_013", "order": 13, "role": "body", "text": "Harden and Bucks center Larry Sanders jostled near center court with 3:19 left in the game with Houston leading handily. Sanders was protecting 19-year-old Giannis Antetokounmpo, who had been elbowed and shoved by Harden in the fourth quarter."}
{"game_id": "0021400240", "chunk_id": "0021400240_014", "order": 14, "role": "body", "text": "Harden, Sanders and Antetokounmpo all were given technical fouls after the referees reviewed the video."}
{"game_id": "0021400240", "chunk_id": "0021400240_015", "order": 15, "role": "body", "text": "\"It just got a little physical, that is my little brother,\" Sanders said of Antetokounmpo. \"This is my family. I just tried to come in and talk to Harden a little bit, make sure the situation was calm. It kind of got blown out of proportion a little bit. It is OK. We are on good terms, so it is all good.\""}
{"game_id": "0021400240", "chunk_id": "0021400240_016", "order": 16, "role": "body", "text": "The game was no longer in doubt when the theatrics occurred, and Harden was the key player in Houston's seventh road win in eight games this year."}
{"game_id": "0021400240", "chunk_id": "0021400240_017", "order": 17, "role": "body", "text": "After playing 38 minutes Friday night, Harden scored 17 of the Rockets final 21 points in the third quarter as Houston extended a seven-point halftime lead to 85-72 going into the fourth quarter. Milwaukee never got within single digits in the fourth."}
{"game_id": "0021400240", "chunk_id": "0021400240_018", "order": 18, "role": "body", "text": "Harden was 9 of 14 from the field, and made 12-of-13 free throws with eight assists and six rebounds in 45 minutes."}
{"game_id": "0021400240", "chunk_id": "0021400240_019", "order": 19, "role": "body", "text": "Donatas Motiejunas had 20 points for Houston."}
{"game_id": "0021400240", "chunk_id": "0021400240_020", "order": 20, "role": "body", "text": "Harden had 12 points in the first half and Houston led, 53-46 at halftime."}
{"game_id": "0021400240", "chunk_id": "0021400240_023", "order": 23, "role": "body", "text": "Rockets: Trevor Ariza has made only 20-of-64 shots in his last five games. He was 5 for 18 Saturday with 14 points and 10 rebounds."}
{"game_id": "0021400240", "chunk_id": "0021400240_024", "order": 24, "role": "body", "text": "Bucks: Zaza Pachulia (personal reasons) and John Henson (sprained left foot) missed the game. . O.J. Mayo had his third consecutive poor shooting night, making only 2 of 10 from the field. In his last three games, he is 9 for 32."}
{"game_id": "0021400240", "chunk_id": "0021400240_026", "order": 26, "role": "body", "text": "Rockets: Host the Grizzlies on Wednesday."}
{"game_id": "0021400240", "chunk_id": "0021400240_028", "order": 28, "role": "body", "text": "TURNING POINT: The Rockets dominated the boards, 44-32, and it was never more evident than early in the third quarter during the decisive Houston run. Donatas Motiejunas and Tarik Black each grabbed offensive rebounds on one Houston possession, and Harden made the team's third shot count, hitting a 3-pointer, getting fouled by Mayo and converting the free throw. The possession extended Houston's lead to 68-52 and Milwaukee never seriously threatened the rest of the way."}
{"game_id": "0021400240", "chunk_id": "0021400240_029", "order": 29, "role": "closing", "text": "KNOWN GAMEPLAN: Bucks coach Jason Kidd before the game said the Houston gameplan was easy to figure out. \"Their philosophy is 3s, layups and free throws. It's no secret. That's where they shoot it from.\" But it didn't matter that Milwaukee knew what was coming. Houston scored 52 points in the paint and 45 points on 3-pointers (15-of-38)."}
