{"game_id": "0021200593", "chunk_id": "0021200593_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- The Sacramento Kings were determined Saturday night to make amends after one of their most embarrassing defeats of the season just 24 hours earlier."}
{"game_id": "0021200593", "chunk_id": "0021200593_003", "order": 3, "role": "body", "text": "Marcus Thornton scored 18 points off the bench, Tyreke Evans came up big down the stretch, and the Kings held on to beat the Charlotte Bobcats 97-93 for their third win in four games."}
{"game_id": "0021200593", "chunk_id": "0021200593_004", "order": 4, "role": "body", "text": "After scoring just 69 points in a 16-point loss to Memphis, the Kings made sure there would not be another offensive letdown."}
{"game_id": "0021200593", "chunk_id": "0021200593_005", "order": 5, "role": "body", "text": "They led most of the way but needed a late burst from Evans, who scored six of the team's last nine points in the final four minutes. He finished with 16 for the game."}
{"game_id": "0021200593", "chunk_id": "0021200593_006", "order": 6, "role": "body", "text": "DeMarcus Cousins added 17 points and 10 rebounds, and James Johnson chipped in with nine points and a season-high nine rebounds for the Kings (16-25)."}
{"game_id": "0021200593", "chunk_id": "0021200593_007", "order": 7, "role": "body", "text": "\"This was a great win for us,\" Johnson said. \"We're struggling a little bit, especially after last night. Memphis had their way with us and we looked like a team that gave up -- and that's not us. We wanted to get back to our fundamentals and outplay them and outrun them.\""}
{"game_id": "0021200593", "chunk_id": "0021200593_008", "order": 8, "role": "body", "text": "Cousins said: \"Now hopefully we can come out Monday against New Orleans and do the same thing.\""}
{"game_id": "0021200593", "chunk_id": "0021200593_009", "order": 9, "role": "body", "text": "Kemba Walker had a chance to tie the game but shot an airball on a 3-point attempt with 3 seconds left as Charlotte lost its 14th straight game at home. Walker had 14 points and 10 assists."}
{"game_id": "0021200593", "chunk_id": "0021200593_010", "order": 10, "role": "body", "text": "Ramon Sessions scored 16 points for Charlotte (10-30) while Gerald Henderson chipped in with 15."}
{"game_id": "0021200593", "chunk_id": "0021200593_011", "order": 11, "role": "body", "text": "\"Our guys did a good job of moving the ball and making that extra pass tonight,\" Kings coach Keith Smart said of his team's 24 assists."}
{"game_id": "0021200593", "chunk_id": "0021200593_012", "order": 12, "role": "body", "text": "The Kings led most of the game and took a 78-76 lead into the fourth quarter."}
{"game_id": "0021200593", "chunk_id": "0021200593_013", "order": 13, "role": "body", "text": "After being on the verge of taking the lead most of the quarter, the Bobcats finally jumped ahead with 3:35 left on a transition layup by Henderson off a nice feed from Walker."}
{"game_id": "0021200593", "chunk_id": "0021200593_014", "order": 14, "role": "body", "text": "That's about when the Bobcats began to meltdown."}
{"game_id": "0021200593", "chunk_id": "0021200593_015", "order": 15, "role": "body", "text": "Charlotte had a chance to push the lead to four but was called for a shot clock violation at the worst time possible."}
{"game_id": "0021200593", "chunk_id": "0021200593_016", "order": 16, "role": "body", "text": "Evans tied the game with a pair of free throws on the other end."}
{"game_id": "0021200593", "chunk_id": "0021200593_017", "order": 17, "role": "body", "text": "Both teams went more than two minutes during an ugly stretch of turnover-filled basketball before Evans took advantage of Hakim Warrick's turnover and scored an easy layup on a fast break for a 92-90 lead with 1:19 left to put the Kings ahead for good."}
{"game_id": "0021200593", "chunk_id": "0021200593_018", "order": 18, "role": "body", "text": "After Warrick missed a turnaround layup, Evans scored again inside on a spin move to make it 94-90."}
{"game_id": "0021200593", "chunk_id": "0021200593_019", "order": 19, "role": "body", "text": "A three-point play by Sessions cut the Sacramento lead to one with 40 seconds left, but Isaiah Thomas pushed the lead 96-93 with a pair of free throws with 18.4 seconds left."}
{"game_id": "0021200593", "chunk_id": "0021200593_020", "order": 20, "role": "body", "text": "The Bobcats set up for a 3-point shot, but Walker missed everything on a play that never developed. Thomas put the game away by making the second of his two free throws with 2.4 seconds left."}
{"game_id": "0021200593", "chunk_id": "0021200593_021", "order": 21, "role": "body", "text": "\"They gave me pretty good pressure, but I thought I had an open shot,\" Walker said. \"I kind of hesitated. I could've shot it right away, because I thought I was open. But I hesitated. It'll be like that sometimes.\""}
{"game_id": "0021200593", "chunk_id": "0021200593_022", "order": 22, "role": "body", "text": "For Charlotte, finishing games continues to be a huge problem."}
{"game_id": "0021200593", "chunk_id": "0021200593_023", "order": 23, "role": "body", "text": "The Kings held to Bobcats to only three points in the final 3:33 of the game. During that span, the Bobcats missed four shots, turned the ball over twice and were called for a goaltending."}
{"game_id": "0021200593", "chunk_id": "0021200593_024", "order": 24, "role": "body", "text": "\"Composure is big,\" Smart said. \"Our young guys did a great job. They came down, managed the plays we needed to get. The combination of them running what needed to be run at that particular time was critical.\""}
{"game_id": "0021200593", "chunk_id": "0021200593_025", "order": 25, "role": "body", "text": "The Bobcats didn't help themselves at the free throw line, converting only 26 of 38 attempts (68 percent)."}
{"game_id": "0021200593", "chunk_id": "0021200593_026", "order": 26, "role": "body", "text": "They haven't won at home since Nov. 21."}
{"game_id": "0021200593", "chunk_id": "0021200593_027", "order": 27, "role": "body", "text": "\"We've just got to come out ready to play next time,\" Walker said. \"It's tough. We've been losing some pretty close games, and we definitely need a home win. It's been a long time.\""}
{"game_id": "0021200593", "chunk_id": "0021200593_028", "order": 28, "role": "body", "text": "Added Bobcats coach Mike Dunlap: \"It's just something that we have to get better at. I'm on that and so are the players. They understand. They want to give these fans a win, too.\""}
{"game_id": "0021200593", "chunk_id": "0021200593_029", "order": 29, "role": "closing", "text": "Game notes Kings rookie first-round draft pick Thomas Robinson played only minute before being taken to the locker room after getting elbowed in the mouth by Sessions. Robinson said after the game he had 10 stitches, but expects to play Monday night at New Orleans. ... Brendan Haywood had a season-high five blocked shots for the Bobcats. ... Thomas tied a season-high seven assists for the Kings and tied a season-high with five rebounds."}
