{"game_id": "0021200530", "chunk_id": "0021200530_001", "order": 1, "role": "lead", "text": "TORONTO --  The thing Alan Anderson likes most about the Toronto Raptors' recent run of success is the way efficient ball movement has spread the offense around."}
{"game_id": "0021200530", "chunk_id": "0021200530_002", "order": 2, "role": "body", "text": "Of course, that can make keeping track of the top scorer a little tricky."}
{"game_id": "0021200530", "chunk_id": "0021200530_003", "order": 3, "role": "body", "text": "Anderson scored 16 points against his former team, Jose Calderon had 15 and the Toronto Raptors won for the 10th time in 13 games Friday night, beating the Charlotte Bobcats 99-78."}
{"game_id": "0021200530", "chunk_id": "0021200530_004", "order": 4, "role": "body", "text": "\"Any night, it could be anybody,\" Anderson said of Toronto's balanced scoring. \"I don't know who it was tonight.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_005", "order": 5, "role": "body", "text": "Uh, Alan, better check the boxscore. It was you."}
{"game_id": "0021200530", "chunk_id": "0021200530_007", "order": 7, "role": "body", "text": "Calderon, who along with Kyle Lowry had a game-high six assists, said he's enjoying Toronto's generous style."}
{"game_id": "0021200530", "chunk_id": "0021200530_008", "order": 8, "role": "body", "text": "\"Everybody was looking for the open guy,\" he said. \"Sharing is fun when you do that. It was great to see everybody scoring and moving the ball.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_009", "order": 9, "role": "body", "text": "Anderson had four of Toronto's 12 3-pointers, while Calderon and Lowry each made three."}
{"game_id": "0021200530", "chunk_id": "0021200530_010", "order": 10, "role": "body", "text": "Amir Johnson had 13 points and eight rebounds while Ed Davis had 12 points and eight boards for the Raptors, who led by as many as 24."}
{"game_id": "0021200530", "chunk_id": "0021200530_011", "order": 11, "role": "body", "text": "Raptors coach Dwane Casey call Johnson, \"The heart and soul of our team.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_012", "order": 12, "role": "body", "text": "\"He brings it every night,\" Casey said. \"He has a bum ankle. Most guys with an ankle like his would be out for two or three months. He's a warrior.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_013", "order": 13, "role": "body", "text": "Toronto has not trailed in each of its past three victories, including home wins over Portland on Jan. 2 and Philadelphia on Wednesday."}
{"game_id": "0021200530", "chunk_id": "0021200530_014", "order": 14, "role": "body", "text": "\"We did not let up,\" Casey said. \"I liked out businesslike approach in the second half.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_015", "order": 15, "role": "body", "text": "Starting for the second straight game, Toronto's Landry Fields matched his season high with 11 rebounds."}
{"game_id": "0021200530", "chunk_id": "0021200530_016", "order": 16, "role": "body", "text": "Michael Kidd-Gilchrist, Kemba Walker and Ben Gordon each scored 12 points as Charlotte's modest streak of two straight road victories came to an end."}
{"game_id": "0021200530", "chunk_id": "0021200530_017", "order": 17, "role": "body", "text": "The Bobcats lost for the third time in five games since snapping their 18-game losing streak. Charlotte has fallen behind early in the past two defeats, something Gordon called their \"Achilles heel.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_018", "order": 18, "role": "body", "text": "\"We've got to give ourselves a better chance to compete early in the game. We can't start out by spotting teams double digit figures and then trying to climb back. It's too hard to do and we don't have that kind of team.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_019", "order": 19, "role": "body", "text": "Ramon Sessions scored 11 for the Bobcats, and rookie Jeff Taylor had 10."}
{"game_id": "0021200530", "chunk_id": "0021200530_020", "order": 20, "role": "body", "text": "Bobcats coach Mike Dunlap said he's considering lineup changes when his team visits Indiana on Saturday night."}
{"game_id": "0021200530", "chunk_id": "0021200530_021", "order": 21, "role": "body", "text": "\"Absolutely,\" Dunlap said. \"We just have to find guys who can start us and get us going, especially on the defensive end.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_022", "order": 22, "role": "body", "text": "Charlotte came in having won 10 of their past 13 meetings with the Raptors, including three of the past four in Toronto, but were never in this one, trailing by double digits from the midpoint of the first quarter onward."}
{"game_id": "0021200530", "chunk_id": "0021200530_023", "order": 23, "role": "body", "text": "The Bobcats missed seven of their first eight shots and, for the second straight game, never held a lead. Charlotte also trailed throughout in Wednesday's home loss to Utah."}
{"game_id": "0021200530", "chunk_id": "0021200530_024", "order": 24, "role": "body", "text": "Calderon scored 10 points in the opening quarter, including a pair of 3-pointers, as the Raptors surged out to a 29-16 lead after one."}
{"game_id": "0021200530", "chunk_id": "0021200530_025", "order": 25, "role": "body", "text": "Anderson said Toronto's starters \"just blitzed them right out of the gate.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_026", "order": 26, "role": "body", "text": "Dunlap called his team's first-quarter performance \"inexcusable.\""}
{"game_id": "0021200530", "chunk_id": "0021200530_027", "order": 27, "role": "body", "text": "Kidd-Gilchrist and Walker combined for seven of Charlotte's nine free throws in the second quarter, but Toronto used seven points from rookie Terrence Ross to take a 53-39 lead at the half."}
{"game_id": "0021200530", "chunk_id": "0021200530_028", "order": 28, "role": "body", "text": "Anderson scored eight points in the third and Davis had six as the Raptors took a commanding 76-58 lead into the fourth."}
{"game_id": "0021200530", "chunk_id": "0021200530_029", "order": 29, "role": "closing", "text": "Game notes Toronto made a season-high 15 3-pointers in a 123-88 win at Orlando on Dec. 29. ... Anderson played for the Bobcats in the 2005-06 and 2006-07 seasons, appearing in 53 games. ... The Raptors are 8-0 when holding their opponent below 90 points. ... Charlotte surrendered a season-high 22 second chance points. ... Ross returned after missing Wednesday's win over Philadelphia with a sore left ankle. ... The Raptors conclude a season-long six-game homestand on Sunday when they host Milwaukee."}
