{"game_id": "0021301087", "chunk_id": "0021301087_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- Desperate to see a victory again, Philadelphia fans wouldn't even wait for the end, standing to cheer as time was running out in the third quarter.\nBy then it was clear: The 76ers were going to win for the first time in two months, and they were going to do it with ease.\nThe 76ers snapped their NBA record-tying, 26-game losing streak, routing the Detroit Pistons 123-98 on Saturday night to avoid establishing the longest skid in U.S. major pro sports history."}
{"game_id": "0021301087", "chunk_id": "0021301087_002", "order": 2, "role": "body", "text": "\"It's not something I want to be a part of,\" 76ers guard Michael Carter-Williams said, \"so it's great that we got this win.\"\nCarter-Williams and Thaddeus Young each scored 21 points for the 76ers, who won for the first time since beating Boston exactly two months ago and did it impressively, leading by as many as 32 points. They also ended an 18-game home losing streak, which was one shy of another NBA record.\nBeaten badly a number of times during their skid, the 76ers got to experience life on the other side, ringing up a season-high 70 points in the first half.\nTheir 26 straight losses equaled the 2010-11 Cleveland Cavaliers and also the NFL's Tampa Bay Buccaneers, who dropped 26 straight from Sept. 12, 1976-Dec. 4, 1977.\n\"We were just happy to get a win,\" Young said. \"I don't think it was for the streak or anything like that, we just wanted to go out there and win a basketball game and continue to just play.\""}
{"game_id": "0021301087", "chunk_id": "0021301087_003", "order": 3, "role": "body", "text": "Henry Sims added 16 points for the Sixers, who hadn't won before their home crowd since beating Charlotte on Jan. 15. Fans in the crowd of 17,438 were into it from the start and grew louder throughout, standing and cheering in the final seconds of the third and then getting up again to deliver a standing ovation for the final 45 seconds of the game.\nGreg Monroe had 20 points and 10 rebounds for the Pistons, who lost for the 11th time in 13 games. Blown out a night earlier by Miami, they made the 76ers look as good as the Heat with a sloppy effort that included 18 turnovers, many after starting point guard Brandon Jennings was ejected in the first quarter.\n\"They came out and competed tonight. They wanted it more than we did,\" Pistons guard Rodney Stuckey said.\nThe Sixers were expected to be among the NBA's worst teams, though they briefly fooled everyone when they opened the season by beating Miami and Chicago during a 3-0 start. But they look nothing like that team now, having traded three of their top players before February's trade deadline and replacing them with what coach Brett Brown said is the youngest team in league history, one that has been unprepared or perhaps just unqualified to win NBA games."}
{"game_id": "0021301087", "chunk_id": "0021301087_004", "order": 4, "role": "closing", "text": "There is young talent on the roster, with Carter-Williams the possible Rookie of the Year and Nerlens Noel, still out recovering from a torn ACL, also a lottery pick in last year's draft. Brown doesn't question the Sixers' plans or his decision to leave San Antonio to come coach here, insisting the team was headed in the right direction and that all this losing \"will be a distant memory in September.\"\n\"Our judgment day isn't today and it won't be tomorrow,\" Brown said before the game. \"We're on a three- to five-year plan.\"\nThe present was finally fun on Saturday.\nThe 76ers opened a 10-point lead after one, capitalizing on some free throws when Jennings picked up two technical fouls arguing a call that wasn't even against him and was ejected with 1:18 left. A 9-0 run made it 55-38 with about 5½ minutes left in the half, and when Detroit crept within 10 with 1:32 remaining, Philadelphia closed with another 9-0 spurt to open a 70-51 cushion at the break.\nThe 76ers extended it to 32 late in the third, and Brown pulled his five starters together with 5:13 left and a 30-point bulge. There was no visible celebration, though there was surely some relief.\n\"There was some emotion,\" Carter-Williams said. \"Of course we were happy to win again, it's a great thing to be on the winning side.\"\nGame notes\nThe Dallas Mavericks lost 19 straight home games during the 1993-94 season. ... Monroe played in his 300th NBA game. ... Philadelphia's previous high was 68 points in the first half of a 114-102 victory at Denver on New Year's Day."}
