{"game_id": "0021301064", "chunk_id": "0021301064_001", "order": 1, "role": "lead", "text": "AUBURN HILLS --  The Cleveland Cavaliers aren't ready to throw in the towel."}
{"game_id": "0021301064", "chunk_id": "0021301064_002", "order": 2, "role": "body", "text": "With only 10 healthy players, the Cavaliers overcame a 16-point fourth-quarter deficit to beat the Detroit Pistons on Dion Waiters' baseline jumper as time expired. With nine games left, Cleveland remains in 10th place in the Eastern Conference, three games behind No. 8 Atlanta and a half-game behind the Knicks."}
{"game_id": "0021301064", "chunk_id": "0021301064_003", "order": 3, "role": "body", "text": "The Pistons led 82-66 going into the fourth quarter, but the NBA's worst fourth-quarter team collapsed once again down the stretch."}
{"game_id": "0021301064", "chunk_id": "0021301064_004", "order": 4, "role": "body", "text": "Jarrett Jack hit a 3-pointer to pull the Cavaliers within 96-90 with 2:49 left, and his short jumper made it a four-point game with 90 seconds to play. After a bad Brandon Jennings miss, Jack drove the lane and hit a floater while being fouled. His free throw made it 96-95 with 53.8 seconds left and completed a personal 8-0 run."}
{"game_id": "0021301064", "chunk_id": "0021301064_005", "order": 5, "role": "body", "text": "Cleveland coach Mike Brown wasn't ready to give one player credit for the rally."}
{"game_id": "0021301064", "chunk_id": "0021301064_006", "order": 6, "role": "body", "text": "\"For us to come back and keep our composure -- that's what championship teams do,\" he said. \"Don't get me wrong, we are nowhere near that level, but to see these signs of life is a great thing as a coach.\""}
{"game_id": "0021301064", "chunk_id": "0021301064_007", "order": 7, "role": "body", "text": "The Pistons weren't done. Josh Smith dribbled himself into trouble and missed a desperation shot as the 24-second clock expired, but Kyle Singler knocked the rebound off Waiters to give the Pistons another chance. Jennings ran the clock down to 3.2 seconds, but missed a jumper to give Cleveland a chance to win."}
{"game_id": "0021301064", "chunk_id": "0021301064_008", "order": 8, "role": "body", "text": "That's when Brown and Pistons coach John Loyer matched up in a duel of wits, calling four straight timeouts before the ball was put in play."}
{"game_id": "0021301064", "chunk_id": "0021301064_009", "order": 9, "role": "body", "text": "\"We knew they were going to call one of two or three plays at the end, and the first time, they ran the play we expected, so we called time out,\" Loyer said. \"The last time, they ran one of the other plays we had discussed, so we were ready.\""}
{"game_id": "0021301064", "chunk_id": "0021301064_010", "order": 10, "role": "body", "text": "Unfortunately, for the Pistons, so was Waiters. He took Luol Deng's pass in the right corner and calmly knocked down the winning 20-footer with Jennings' hand in his face."}
{"game_id": "0021301064", "chunk_id": "0021301064_011", "order": 11, "role": "body", "text": "\"Luol told me that he was going to come to me, so I needed to get separation and be ready,\" Waiters said. \"I got the separation, and I knew it was good as soon as I let it go. That's the best feeling in the world.\""}
{"game_id": "0021301064", "chunk_id": "0021301064_012", "order": 12, "role": "body", "text": "Rookie Matthew Dellavedova led Cleveland with a career-high 21 points, while Waiters had 18 and Jack 17."}
{"game_id": "0021301064", "chunk_id": "0021301064_013", "order": 13, "role": "body", "text": "\"I was just trying to bring some energy and keep us going,\" Dellavedova said. \"We knew if we could just get a couple stops and put a run on them, we were going to have a shot at the end.\""}
{"game_id": "0021301064", "chunk_id": "0021301064_014", "order": 14, "role": "body", "text": "Smith finished with 24 for Detroit, which has lost 16 of 21 since Loyer replaced Maurice Cheeks as coach."}
{"game_id": "0021301064", "chunk_id": "0021301064_015", "order": 15, "role": "body", "text": "\"Our guys played their hearts out, and it is tough when you are one shot away from winning the game,\" Loyer said. \"But we didn't do the little things that it takes to win these games. \""}
{"game_id": "0021301064", "chunk_id": "0021301064_016", "order": 16, "role": "body", "text": "Detroit dominated early, and looked ready for a rare blowout victory. They led by as many as 14 in the first quarter, but it didn't last. The Cavaliers rallied after three Pistons starters picked up two quick fouls, and Detroit needed a buzzer-beating 3-pointer by Singler to lead 51-50 at the intermission."}
{"game_id": "0021301064", "chunk_id": "0021301064_017", "order": 17, "role": "body", "text": "Singler and Jennings both had 11 points in the half, while Anderson Varejao came off the bench to get eight points and 10 rebounds for the Cavaliers."}
{"game_id": "0021301064", "chunk_id": "0021301064_018", "order": 18, "role": "body", "text": "The Pistons got off to another quick start in the third, once again controlling the game with Varejao on the sidelines. Smith and Greg Monroe combined for 18 points in the quarter, as the Pistons were able to pound the ball inside, and Jennings hit a 3-pointer with 1.5 seconds left to give Detroit the 16-point lead going into the fourth."}
{"game_id": "0021301064", "chunk_id": "0021301064_019", "order": 19, "role": "body", "text": "\"We had things the way we wanted them, but they got more aggressive against our pick-and-roll, and we started rushing things,\" said Jennings, who went 0-4 in the fourth."}
{"game_id": "0021301064", "chunk_id": "0021301064_020", "order": 20, "role": "closing", "text": "Game notes Andre Drummond and Tyler Zeller were called for double technicals after a minor confrontation in the second quarter. ... Drummond missed all four of his first-half free throws, including an air ball that was wide left by nearly a foot. Smith made it a rare double by air-balling a free throw in the third quarter. ... Cleveland was missing five players due to injuries, including Kyrie Irving and Anthony Bennett."}
