{"game_id": "0021700114", "chunk_id": "0021700114_001", "order": 1, "role": "lead", "text": "DENVER --  Nikola Jokic received some playful ribbing for his errant, behind-the-back pass on a fast break late in the first half."}
{"game_id": "0021700114", "chunk_id": "0021700114_002", "order": 2, "role": "body", "text": "On this night, that was about all that went wrong for the Denver Nuggets."}
{"game_id": "0021700114", "chunk_id": "0021700114_003", "order": 3, "role": "body", "text": "Jamal Murray scored 16 of his 24 points in a decisive third-quarter spurt, Jokic added 16 rebounds and 10 assists while narrowly missing a triple-double, and the Nuggets beat the Toronto Raptors 129-111 on Wednesday."}
{"game_id": "0021700114", "chunk_id": "0021700114_004", "order": 4, "role": "body", "text": "\"We moved the ball and were unselfish, made a lot of cuts, made the defense work,\" said Murray, who has scored at least 20 in three straight games. \"We kept playing our game and they tried to play to our pace.\""}
{"game_id": "0021700114", "chunk_id": "0021700114_005", "order": 5, "role": "body", "text": "Paul Millsap added 20 points in his best offensive output since joining the Nuggets. He signed a three-year, $90 million deal with Denver in July, but has recently struggled with his jumper."}
{"game_id": "0021700114", "chunk_id": "0021700114_006", "order": 6, "role": "body", "text": "Millsap had 13 points in the first quarter, including two 3-pointers, to jump-start the Nuggets early."}
{"game_id": "0021700114", "chunk_id": "0021700114_007", "order": 7, "role": "body", "text": "\"He was really aggressive,\" Jokic said of his fellow big man. \"We just continued to play aggressive.\""}
{"game_id": "0021700114", "chunk_id": "0021700114_008", "order": 8, "role": "body", "text": "Now, about that pass to Wilson Chandler just before halftime: Jokic was dribbling down the court, had a defender on him and tried to loft it behind his back to Chandler for a highlight-reel dunk."}
{"game_id": "0021700114", "chunk_id": "0021700114_010", "order": 10, "role": "body", "text": "\"I thought he could jump. He's an athletic guy,\" Jokic teased in the locker room."}
{"game_id": "0021700114", "chunk_id": "0021700114_011", "order": 11, "role": "body", "text": "\"My fault,\" Chandler quickly responded."}
{"game_id": "0021700114", "chunk_id": "0021700114_012", "order": 12, "role": "body", "text": "Murray broke loose in the third to help turn a 60-51 lead into a 36-point advantage in a matter of minutes. The 43 points in the third marked the biggest quarter for the Nuggets this season."}
{"game_id": "0021700114", "chunk_id": "0021700114_013", "order": 13, "role": "body", "text": "Jokic finished with eight points and didn't play over the final 7:41. Not that he minded missing out on his seventh career triple-double."}
{"game_id": "0021700114", "chunk_id": "0021700114_014", "order": 14, "role": "body", "text": "\"I couldn't make shots today,\" said Jokic, who was 4 of 10 from the field. \"I didn't force it. I tried to do some other stuff.\""}
{"game_id": "0021700114", "chunk_id": "0021700114_015", "order": 15, "role": "body", "text": "Norman Powell led the Raptors with 14 points as they made their fifth stop on a six-game road swing, their longest of the season."}
{"game_id": "0021700114", "chunk_id": "0021700114_016", "order": 16, "role": "body", "text": "\"That was an embarrassing performance by all of us, from coaches to players,\" Raptors coach Dwane Casey said. \"One thing we said:  You've got to come in here and compete and play hard, play a physical game, and we didn't do either one on either end of the floor.\""}
{"game_id": "0021700114", "chunk_id": "0021700114_017", "order": 17, "role": "body", "text": "Murray was briefly checked out by trainers in the first quarter after flying into the courtside seats while trying to steal a pass. He landed about three rows back and in the vicinity of Colorado Avalanche forward Matt Duchene."}
{"game_id": "0021700114", "chunk_id": "0021700114_018", "order": 18, "role": "body", "text": "In the process, Murray also spilled a beer and had to make a quick trip into the locker room to change jerseys."}
{"game_id": "0021700114", "chunk_id": "0021700114_019", "order": 19, "role": "body", "text": "\"I smelled like Heineken,\" he said."}
{"game_id": "0021700114", "chunk_id": "0021700114_021", "order": 21, "role": "body", "text": "Raptors: Delon Wright had 12 points off the bench. ... Kyle Lowry finished with nine points."}
{"game_id": "0021700114", "chunk_id": "0021700114_022", "order": 22, "role": "body", "text": "Nuggets: F Juancho Hernangomez missed a sixth straight game with mononucleosis. \"I do not anticipate him being back for a few weeks,\" coach Michael Malone said. .... Broncos LB Von Miller showed up wearing an Avalanche hockey sweater bearing his No. 58. ... Denver connected on 16 3-pointers to start a six-game homestand."}
{"game_id": "0021700114", "chunk_id": "0021700114_024", "order": 24, "role": "body", "text": "Malone called DeMar DeRozan the \"king of the mid-range jumper.\" DeRozan shot 4 of 10 to finish with a season-low 10 points for Toronto."}
{"game_id": "0021700114", "chunk_id": "0021700114_025", "order": 25, "role": "body", "text": "\"DeMar does it in a different way,\" Casey said. \"He still gets to the free throw line. He gets a three the old-fashioned way.\""}
{"game_id": "0021700114", "chunk_id": "0021700114_027", "order": 27, "role": "body", "text": "Casey said Jokic's game reminds him of Dallas standout Dirk Nowitzki."}
{"game_id": "0021700114", "chunk_id": "0021700114_028", "order": 28, "role": "body", "text": "\"As far as his range and size, the way he gets the ball up on his shot. You can't get to it,\" Casey said. \"You have to have extraordinary reach to get to his shot. They do some special things to try to create space for him.\""}
{"game_id": "0021700114", "chunk_id": "0021700114_030", "order": 30, "role": "body", "text": "Malone wasn't pleased with his team allowing 40 points in the fourth quarter even if the game was well in hand."}
{"game_id": "0021700114", "chunk_id": "0021700114_031", "order": 31, "role": "body", "text": "\"Unacceptable,\" he said. \"I don't care what the score is, how much you're up. Our defense the last six minutes was embarrassing.\""}
{"game_id": "0021700114", "chunk_id": "0021700114_033", "order": 33, "role": "body", "text": "Raptors: At Utah on Friday. Currently 2/3 on their trip."}
{"game_id": "0021700114", "chunk_id": "0021700114_034", "order": 34, "role": "body", "text": "Nuggets: Host Miami on Friday and Golden State on Saturday in a home back-to-back."}
{"game_id": "0021700114", "chunk_id": "0021700114_036", "order": 36, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
