{"game_id": "0021400723", "chunk_id": "0021400723_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Russell Westbrook wasn't worried about individual accomplishments as he approached a triple-double."}
{"game_id": "0021400723", "chunk_id": "0021400723_002", "order": 2, "role": "body", "text": "When Oklahoma City's All-Star point guard was asked if he knew he was closing in on the rare feat late in the third quarter against Orlando, he said: \"I knew we were winning.\""}
{"game_id": "0021400723", "chunk_id": "0021400723_003", "order": 3, "role": "body", "text": "Westbrook's second triple-double of the season and 10th of his career helped the Thunder defeat the Magic 104-97 on Monday night without the injured Kevin Durant. Westbrook had 25 points, 14 assists and 11 rebounds."}
{"game_id": "0021400723", "chunk_id": "0021400723_004", "order": 4, "role": "body", "text": "\"It was a special game for him,\" Thunder coach Scott Brooks said. \"He was attacking, he was making plays, guys were making shots for him and he was rebounding the ball.\""}
{"game_id": "0021400723", "chunk_id": "0021400723_005", "order": 5, "role": "body", "text": "Durant sat out with a sprained big toe on his left foot. He has played in just 22 games this season, having missed time earlier in the season with a sprained right ankle and a broken bone in his right foot."}
{"game_id": "0021400723", "chunk_id": "0021400723_006", "order": 6, "role": "body", "text": "Durant's absence made Westbrook's accomplishment more impressive. Durant, the reigning league MVP and four-time scoring champion, played in eight of Westbrook's previous nine triple-double games and averaged 34.8 points in those games, giving a major boost to Westbrook's assist numbers. Without him, Westbrook still found teammates at will."}
{"game_id": "0021400723", "chunk_id": "0021400723_007", "order": 7, "role": "body", "text": "\"For us to win, my job is to be able to make sure everybody is getting the ball and make sure everybody is in the position to score, and that was one of those nights,\" Westbrook said."}
{"game_id": "0021400723", "chunk_id": "0021400723_008", "order": 8, "role": "body", "text": "Dion Waiters scored 24 points and Serge Ibaka added 16 for the Thunder, who snapped a two-game skid and evened their record at 24-24."}
{"game_id": "0021400723", "chunk_id": "0021400723_009", "order": 9, "role": "body", "text": "Victor Oladipo scored 22 points and Nikola Vucevic scored 20 points for the Magic, who lost their ninth straight."}
{"game_id": "0021400723", "chunk_id": "0021400723_010", "order": 10, "role": "body", "text": "Westbrook had 12 points, five assists, three rebounds and three steals in the first quarter to help the Thunder take a 29-22 lead at the end of the period. He had five more assists in the second quarter to help Oklahoma City take a 61-50 lead at halftime."}
{"game_id": "0021400723", "chunk_id": "0021400723_011", "order": 11, "role": "body", "text": "Westbrook stole the ball, then found Andre Roberson on the break for a dunk that gave the Thunder a 70-50 lead. Oklahoma City held the Magic scoreless for the first 5:19 of the third quarter."}
{"game_id": "0021400723", "chunk_id": "0021400723_012", "order": 12, "role": "body", "text": "\"I thought we did a great job of knowing our personnel and getting some good stops,\" Westbrook said."}
{"game_id": "0021400723", "chunk_id": "0021400723_013", "order": 13, "role": "body", "text": "Westbrook chased down his ninth rebound, then sped down the court for a layup that put the Thunder up 79-60. He snagged his 10th rebound in the final minute of the third quarter to clinch the triple-double, and the Thunder led 82-67 heading into the fourth."}
{"game_id": "0021400723", "chunk_id": "0021400723_014", "order": 14, "role": "body", "text": "Back-to-back 3-pointers by Willie Green trimmed Oklahoma City's lead to eight, but Westbrook calmly hit a jumper from near the free-throw line with just under a minute to play to keep the Thunder in control."}
{"game_id": "0021400723", "chunk_id": "0021400723_015", "order": 15, "role": "body", "text": "\"Well, he's a premier athlete,\"  Orlando coach Jacque Vaughn said of Westbrook, \"and his ability just to change gears and get to the rim -- we were focused on him, and that shows you his ability and athleticism -- to still get to the rim, finish and get to the free-throw line.\""}
{"game_id": "0021400723", "chunk_id": "0021400723_017", "order": 17, "role": "body", "text": "Magic: Oladipo, who sat out the previous game Saturday against Dallas with a sore right Achilles, started. ... Aaron Gordon had six rebounds in the first quarter, matching his career high for an entire game. He finished with eight. ... Orlando had 11 offensive rebounds and 16 second-chance points in the first half. ... Orlando made just 7 of 22 shots in the third quarter."}
{"game_id": "0021400723", "chunk_id": "0021400723_018", "order": 18, "role": "body", "text": "Thunder: F Perry Jones sat out with an ankle injury. ... Waiters got his first start for the Thunder since he was acquired from Cleveland last month, and he registered his highest point total in an Oklahoma City uniform. ... The Thunder made all 14 of their free throws in the first half."}
{"game_id": "0021400723", "chunk_id": "0021400723_020", "order": 20, "role": "body", "text": "Vaughn, on Waiters' performance: \"He's just very good with the basketball -- he plays in space, he can get to the rim, you have to respect his shooting, and he's crafty with the basketball.\""}
{"game_id": "0021400723", "chunk_id": "0021400723_022", "order": 22, "role": "body", "text": "Westbrook finally is on the league's leaders charts. A player must compete in 70 percent of his team's games to qualify, and he reached the necessary number of games last Saturday against Memphis. He entered Monday's action ranked No. 3 in scoring, No. 1 in steals and No. 7 in assists."}
{"game_id": "0021400723", "chunk_id": "0021400723_025", "order": 25, "role": "body", "text": "Thunder: At Pelicans on Wednesday."}
{"game_id": "0021400723", "chunk_id": "0021400723_027", "order": 27, "role": "closing", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP"}
