{"game_id": "0021401087", "chunk_id": "0021401087_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Charlotte Hornets needed a little pick-me-up after a tough -- and potential costly -- double-overtime loss to the Washington Wizards on Friday night."}
{"game_id": "0021401087", "chunk_id": "0021401087_002", "order": 2, "role": "body", "text": "The Atlanta Hawks seemed happy to oblige."}
{"game_id": "0021401087", "chunk_id": "0021401087_003", "order": 3, "role": "body", "text": "Kemba Walker scored 21 points and the Hornets beat a Hawks team missing all five starters, 115-100 on Saturday night."}
{"game_id": "0021401087", "chunk_id": "0021401087_004", "order": 4, "role": "body", "text": "The Hawks gave DeMarre Carroll, Kyle Korver, Al Horford and Paul Millsap the night off to rest and Jeff Teague sat out with a sprained ankle, one night after Atlanta clinched the top seed in the Eastern Conference."}
{"game_id": "0021401087", "chunk_id": "0021401087_005", "order": 5, "role": "body", "text": "Gerald Henderson scored 20 points on 9-of-10 shooting, and Mo Williams hit four 3-pointers and had 18 points as the Hornets snapped a three-game losing streak."}
{"game_id": "0021401087", "chunk_id": "0021401087_006", "order": 6, "role": "body", "text": "Marvin Williams chipped in with 17 points for Charlotte (31-41), which moved back within a game of eighth place in the tight Eastern Conference."}
{"game_id": "0021401087", "chunk_id": "0021401087_007", "order": 7, "role": "body", "text": "\"We just had to put it behind us,\" Henderson said of the loss to the Wizards. \"Obviously that was a tough game to lose, going into double overtime. We just came out and found that energy and beat a good team.\""}
{"game_id": "0021401087", "chunk_id": "0021401087_008", "order": 8, "role": "body", "text": "Or a good team's backups, that is."}
{"game_id": "0021401087", "chunk_id": "0021401087_009", "order": 9, "role": "body", "text": "Kent Bazemore scored a season-high 20 points to lead the Hawks. Mike Muscala had 18 points and 10 rebounds, and Dennis Schroder added 17 points and 11 assists as the Hawks lost for the third time in the last four meetings to their Interstate-85 foes."}
{"game_id": "0021401087", "chunk_id": "0021401087_010", "order": 10, "role": "body", "text": "\"I did get some pull-up jumpers to go down and shot some 3s,\" said Bazemore, who was 3 of 7 on 3-pointers. \"For me, coming off the injuries and the long year I've had, it's pretty encouraging.\""}
{"game_id": "0021401087", "chunk_id": "0021401087_011", "order": 11, "role": "body", "text": "The Hawks lost despite shooting 15 of 30 from 3-point range."}
{"game_id": "0021401087", "chunk_id": "0021401087_012", "order": 12, "role": "body", "text": "Hawks coach Mike Budenholzer was pleased with the overall play of his second and third units."}
{"game_id": "0021401087", "chunk_id": "0021401087_013", "order": 13, "role": "body", "text": "\"Defensively was where there was the most slippage, but they played the way we want to play and did a lot of things,\" Budenholzer said."}
{"game_id": "0021401087", "chunk_id": "0021401087_014", "order": 14, "role": "body", "text": "The Hornets built a 57-52 halftime lead behind 10 points off the bench from rookie P.J. Hairston, who was 4 of 4 from the field before the break, including a pair of 3-pointers."}
{"game_id": "0021401087", "chunk_id": "0021401087_015", "order": 15, "role": "body", "text": "Charlotte pushed the lead to 14 behind nine points from Walker in the third quarter, including scores on three straight possessions, and kept Atlanta from making a meaningful run in the fourth to win for only the third time in the last 11 games."}
{"game_id": "0021401087", "chunk_id": "0021401087_016", "order": 16, "role": "body", "text": "Al Jefferson, who played 40 minutes and scored 31 points and had 10 rebounds in the loss to Washington, seemed completely worn out. He scored two points on 1-of-5 shooting, played only 18 minutes."}
{"game_id": "0021401087", "chunk_id": "0021401087_018", "order": 18, "role": "body", "text": "\"Obviously we caught a break with them resting their guys,\" Hornets coach Steve Clifford said. \"But you can see that we're fatigued. I thought our guys did a good job wanting to win and playing through a lot of fatigue. We struggled to guard them. They hit a lot of 3s. But any win in this league is a good win, especially in the middle of this 17 (games) in 33 days deal.\""}
{"game_id": "0021401087", "chunk_id": "0021401087_019", "order": 19, "role": "body", "text": "Clifford said he's giving the Hornets the day off on Sunday to recover."}
{"game_id": "0021401087", "chunk_id": "0021401087_022", "order": 22, "role": "body", "text": "Hawks: Korver will have to wait another night to pass Mookie Blaylock for third on the Hawks' list for 3-pointers made in a season. He has made 199."}
{"game_id": "0021401087", "chunk_id": "0021401087_023", "order": 23, "role": "body", "text": "Hornets: The Hornets led at the end of the first quarter for only the second time in the last 12 games."}
{"game_id": "0021401087", "chunk_id": "0021401087_025", "order": 25, "role": "body", "text": "The Hornets played without forward Michael Kidd-Gilchrist, who is expected to miss seven to 10 days with a sprained left ankle."}
{"game_id": "0021401087", "chunk_id": "0021401087_027", "order": 27, "role": "body", "text": "Charlotte's win sets up a big game Monday night at home against Boston. The Hornets lead the series with the Celtics 2-1 and could use the tiebreaker advantage."}
{"game_id": "0021401087", "chunk_id": "0021401087_028", "order": 28, "role": "body", "text": "\"It's important if it ever came down with us and them,\" Clifford said. \"And it's also important with the conference record. Our conference record is pretty good. Our problem has been the West. It's a conference and obviously the head-to-head.\""}
{"game_id": "0021401087", "chunk_id": "0021401087_030", "order": 30, "role": "body", "text": "Hawks: Host Milwaukee on Monday night."}
{"game_id": "0021401087", "chunk_id": "0021401087_031", "order": 31, "role": "closing", "text": "Hornets: Host Boston on Monday night."}
