{"game_id": "0021200798", "chunk_id": "0021200798_001", "order": 1, "role": "lead", "text": "TORONTO --  Rudy Gay's reunion with the Memphis Grizzlies was the kind of intense, high-energy basketball game more commonly played in late May, not late February."}
{"game_id": "0021200798", "chunk_id": "0021200798_002", "order": 2, "role": "body", "text": "Zach Randolph had 17 points and 18 rebounds, Mike Conley scored 17 points and the Grizzlies won their fifth straight game Wednesday, beating Gay and the Toronto Raptors 88-82."}
{"game_id": "0021200798", "chunk_id": "0021200798_003", "order": 3, "role": "body", "text": "\"Exciting basketball game,\" Grizzlies coach Lionel Hollins said. \"There was a lot of emotion, there was a lot of intensity from both sides. It was really like a playoff game."}
{"game_id": "0021200798", "chunk_id": "0021200798_004", "order": 4, "role": "body", "text": "\"It's a long season and there's a lot of games that are just hum-haw, but this here was a barn burner,\" Hollins added."}
{"game_id": "0021200798", "chunk_id": "0021200798_005", "order": 5, "role": "body", "text": "Much of that was due to the widely held desire to show who came out ahead in the Jan. 30, three-team trade that had the Grizzlies trade Gay to Toronto."}
{"game_id": "0021200798", "chunk_id": "0021200798_006", "order": 6, "role": "body", "text": "\"There was a lot of emotion in this game,\" said Ed Davis, one of the two Raptors acquired in the deal. \"A lot of people wanted this win on both sides.\""}
{"game_id": "0021200798", "chunk_id": "0021200798_007", "order": 7, "role": "body", "text": "In the end, Gay came up short as the Raptors had their five-game winning streak ended. Gay had 13 points and nine rebounds but struggled with his shooting, making just five of 15 attempts. He also had a game-high five turnovers."}
{"game_id": "0021200798", "chunk_id": "0021200798_008", "order": 8, "role": "body", "text": "\"It's obviously a team I'm very familiar with and I know how scrappy they are,\" Gay said of the Grizzlies. \"Tonight they were just a little scrappier than us.\""}
{"game_id": "0021200798", "chunk_id": "0021200798_009", "order": 9, "role": "body", "text": "Raptors coach Dwane Casey credited Memphis for keeping Gay in check with solid defense."}
{"game_id": "0021200798", "chunk_id": "0021200798_010", "order": 10, "role": "body", "text": "\"They weren't going to let Rudy get going,\" Casey said. \"They were double-teaming him on pick-and-rolls, sending help quickly. They made it tough on him. I felt for him because I knew he wanted to do well.\""}
{"game_id": "0021200798", "chunk_id": "0021200798_011", "order": 11, "role": "body", "text": "Conley said it was \"weird\" to face Gay as an opponent for the first time, but he found a way to enjoy it."}
{"game_id": "0021200798", "chunk_id": "0021200798_012", "order": 12, "role": "body", "text": "\"We were talking trash back and forth to each other, just making the game fun,\" Conley said."}
{"game_id": "0021200798", "chunk_id": "0021200798_013", "order": 13, "role": "body", "text": "Tony Allen scored 12 points and Tayshaun Prince had 11 as the Grizzlies won for the eighth time in nine meetings with the Raptors and posted their fourth straight victory in Toronto."}
{"game_id": "0021200798", "chunk_id": "0021200798_014", "order": 14, "role": "body", "text": "Gay called Randolph \"a monster on the boards,\" and Allen praised his All-Star teammate for his leadership."}
{"game_id": "0021200798", "chunk_id": "0021200798_015", "order": 15, "role": "body", "text": "\"We'll go as far as he goes,\" Allen said. \"I tell him that he's got to carry us and he knows that.\""}
{"game_id": "0021200798", "chunk_id": "0021200798_016", "order": 16, "role": "body", "text": "Alan Anderson scored 15 of his 19 points in the fourth quarter as the Raptors erased a nine-point deficit to tie the game, but couldn't take the lead."}
{"game_id": "0021200798", "chunk_id": "0021200798_017", "order": 17, "role": "body", "text": "Amir Johnson scored 16 points and Kyle Lowry had 12 for Toronto."}
{"game_id": "0021200798", "chunk_id": "0021200798_018", "order": 18, "role": "body", "text": "Back-to-back 3-pointers by Anderson brought the Raptors within four at 70-66 with 9:26 left, and he hit another at 8:02 to make it 73-71."}
{"game_id": "0021200798", "chunk_id": "0021200798_019", "order": 19, "role": "body", "text": "\"Alan Anderson got ultra-hot,\" Hollins said. \"He was en fuego. He brought them back into the basketball game.\""}
{"game_id": "0021200798", "chunk_id": "0021200798_020", "order": 20, "role": "body", "text": "Memphis responded with consecutive layups by Darrell Arthur and Quincy Pondexter, putting them up 77-71, but Anderson hit another 3 and was fouled by Randolph, converting the four-point play to make it 77-75 with 6:33 left."}
{"game_id": "0021200798", "chunk_id": "0021200798_021", "order": 21, "role": "body", "text": "No one scored again until 4:09, when Johnson tied it at 77-all on a driving layup."}
{"game_id": "0021200798", "chunk_id": "0021200798_022", "order": 22, "role": "body", "text": "Just over a minute later, Randolph restored the lead by making a pair of free throws. Conley stole the ball from Gay on the next possession and Randolph was fouled again, making one of two to put Memphis up 80-77 with 2:25 left."}
{"game_id": "0021200798", "chunk_id": "0021200798_023", "order": 23, "role": "body", "text": "After a missed shot by Gay, Conley made a 3 to increase the lead to six at 83-77."}
{"game_id": "0021200798", "chunk_id": "0021200798_024", "order": 24, "role": "body", "text": "Lowry gave the Raptors hope, cutting it to 85-82 on a four-point play with 20 seconds left. But Prince rebounded a missed free throw by Conley and Allen sealed it with a pair at the line."}
{"game_id": "0021200798", "chunk_id": "0021200798_025", "order": 25, "role": "body", "text": "\"It was very much like a playoff game with the way the attitudes were and the emotions out there,\" Conley said. \"Both sides played very hard and the crowd was into it. It was a big game.\""}
{"game_id": "0021200798", "chunk_id": "0021200798_026", "order": 26, "role": "body", "text": "The Grizzlies missed their first eight field goal attempts of the game, but it was Toronto who struggled most with its shooting in the opening quarter, making just four of 20 shots. Gay missed all four of his attempts in the first against his former team as Memphis led 19-14 after one."}
{"game_id": "0021200798", "chunk_id": "0021200798_027", "order": 27, "role": "body", "text": "Randolph had six points in the second and Jerryd Bayless and Prince added five each as Memphis took a 43-32 lead after two. The half ended with a frustrated DeMar DeRozan hurling the ball skyward, only to have it get stuck inside the scoreboard hanging over center court."}
{"game_id": "0021200798", "chunk_id": "0021200798_028", "order": 28, "role": "body", "text": "Johnson had 10 points in the third, including an emphatic dunk over Randolph, and Gay added seven for the Raptors, but Conley scored six points for the Grizzlies and Memphis took a 66-57 lead into the final quarter."}
{"game_id": "0021200798", "chunk_id": "0021200798_029", "order": 29, "role": "closing", "text": "Game notes Both teams are 6-3 since the Jan. 30 trade. ... Toronto matched a season-low for first-quarter points. The Raptors also had 14 in a Feb. 13 win at New York. ... Casey said he would like to add a third point guard before Thursday's trade deadline."}
