{"game_id": "0021300060", "chunk_id": "0021300060_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Gerald Henderson didn't tinker with his shot after making just 31 percent from the field in his first four games this season."}
{"game_id": "0021300060", "chunk_id": "0021300060_002", "order": 2, "role": "body", "text": "\"I started out the first three games horribly shooting-wise, but looking at my shots with Coach, I shot all good shots -- shots that I regularly shoot -- they just weren't falling,\" Henderson said."}
{"game_id": "0021300060", "chunk_id": "0021300060_003", "order": 3, "role": "body", "text": "That all changed Wednesday night."}
{"game_id": "0021300060", "chunk_id": "0021300060_004", "order": 4, "role": "body", "text": "Henderson broke out of his mini-slump with a season-high 23 points, and the surprising Charlotte Bobcats defeated the Toronto Raptors 92-90."}
{"game_id": "0021300060", "chunk_id": "0021300060_005", "order": 5, "role": "body", "text": "Henderson had made only 15 of 49 shots in the first four games since signing an $18 million, three-year contract in the offseason. But he hit six of his first seven against Toronto and finished 10 of 17 from the field."}
{"game_id": "0021300060", "chunk_id": "0021300060_006", "order": 6, "role": "body", "text": "Bobcats coach Steve Clifford never lost faith in Henderson."}
{"game_id": "0021300060", "chunk_id": "0021300060_007", "order": 7, "role": "body", "text": "\"Everything he does on the floor makes sense to me, on both ends of the floor,\" Clifford said. \"He's a prideful guy and he wants to win. He's not going to blow a set. Everything he's supposed to do, he does.\""}
{"game_id": "0021300060", "chunk_id": "0021300060_008", "order": 8, "role": "body", "text": "Michael Kidd-Gilchrist scored 14 points to help the Bobcats win on back-to-back nights. They beat the Knicks in New York on Tuesday."}
{"game_id": "0021300060", "chunk_id": "0021300060_009", "order": 9, "role": "body", "text": "Second-year guard Jeffery Taylor continued to give the Bobcats (3-2) quality minutes off the bench, scoring 13 points. Josh McRoberts added 13 points and five assists."}
{"game_id": "0021300060", "chunk_id": "0021300060_010", "order": 10, "role": "body", "text": "Rudy Gay led the Raptors with 20 points. Jonas Valanciunas had 12 points and 10 rebounds."}
{"game_id": "0021300060", "chunk_id": "0021300060_011", "order": 11, "role": "body", "text": "The Raptors had a chance to steal this one."}
{"game_id": "0021300060", "chunk_id": "0021300060_012", "order": 12, "role": "body", "text": "They were trailing 92-90 when DeMar DeRozan drove the lane, but his shot was rejected by Bismack Biyombo and the Bobcats grabbed the loose ball with 27 seconds remaining."}
{"game_id": "0021300060", "chunk_id": "0021300060_013", "order": 13, "role": "body", "text": "\"I should have tried to be more aggressive,\" DeRozan said. \"At least tried to make the ref make the call. I'll take that. I'm kind of upset at myself for that decision, that I tried to kind of shy away from the contact.\""}
{"game_id": "0021300060", "chunk_id": "0021300060_014", "order": 14, "role": "body", "text": "Toronto didn't foul the Bobcats on their final possession, and when Henderson's long 3-pointer hit off the rim there wasn't enough time for Toronto to corral the loose ball and call timeout."}
{"game_id": "0021300060", "chunk_id": "0021300060_015", "order": 15, "role": "body", "text": "\"Yeah, I was surprised\" they didn't call timeout, Henderson said."}
{"game_id": "0021300060", "chunk_id": "0021300060_016", "order": 16, "role": "body", "text": "The Bobcats have won five straight home games dating to last season."}
{"game_id": "0021300060", "chunk_id": "0021300060_017", "order": 17, "role": "body", "text": "Charlotte shot 75 percent from the field in the first quarter to build a 32-18 lead. Henderson led the way, knocking down six jumpers in the opening 10 minutes, most of those around the top of the key."}
{"game_id": "0021300060", "chunk_id": "0021300060_018", "order": 18, "role": "body", "text": "The Raptors appeared to be playing off Henderson, daring him to shoot. The former Duke star responded again and again, going 7 of 10 from the floor in the first half."}
{"game_id": "0021300060", "chunk_id": "0021300060_019", "order": 19, "role": "body", "text": "\"Our approach in the first quarter was very unlike us,\" Raptors coach Dwane Casey said. \"We did not play the way we did the last three quarters. This is a great learning lesson for us. Never leave winning the game to the last couple of possessions.\""}
{"game_id": "0021300060", "chunk_id": "0021300060_020", "order": 20, "role": "body", "text": "Charlotte cooled off considerably in the second quarter and the Raptors fought back to tie it 53-all at halftime behind nine points from Tyler Hansbrough and a pair of 3-pointers from DeRozan."}
{"game_id": "0021300060", "chunk_id": "0021300060_021", "order": 21, "role": "body", "text": "With Kidd-Gilchrist on the bench with five fouls, Taylor and McRoberts picked up the slack in the third. After blowing a 16-point first-half lead, Charlotte got a boost from McRoberts, who turned the momentum of the game with a solid stretch that included a dunk, a 3-pointer and two no-look passes for easy baskets."}
{"game_id": "0021300060", "chunk_id": "0021300060_022", "order": 22, "role": "body", "text": "The Raptors struggled at times with turnovers, committing 13 that led to 18 Bobcats points."}
{"game_id": "0021300060", "chunk_id": "0021300060_023", "order": 23, "role": "body", "text": "Kemba Walker, who came in averaging more than 18 points per game, had a quiet night."}
{"game_id": "0021300060", "chunk_id": "0021300060_024", "order": 24, "role": "body", "text": "He played after an MRI on his shoulder Wednesday revealed no damage from a collision Tuesday night with Metta World Peace. Walker finished 2 of 13 from the field for five points but said after the game his shoulder felt fine."}
{"game_id": "0021300060", "chunk_id": "0021300060_025", "order": 25, "role": "body", "text": "\"Anytime you can win a back-to-back in this league, that's never easy,\" Clifford said. \"This is a good win.\""}
{"game_id": "0021300060", "chunk_id": "0021300060_026", "order": 26, "role": "closing", "text": "Game notes The Bobcats played again without center Al Jefferson, their top free-agent pickup. He is nursing an ankle injury. ... Henderson has scored in double digits in 28 of his last 29 games for the Bobcats. ... Gay has reached double digits in all five games this season. ... It was Charlotte's sixth straight win at home against the Raptors."}
