{"game_id": "0021700855", "chunk_id": "0021700855_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Even though they were without All-Star Joel Embiid and down 24 points, the 76ers never lost hope."}
{"game_id": "0021700855", "chunk_id": "0021700855_002", "order": 2, "role": "body", "text": "Ben Simmons had a triple-double, J.J. Redick hit a crucial 19-foot, off-balanced jumper from the baseline with 19.4 seconds left and short-handed Philadelphia came back from a 24-point second-half deficit to defeat the Miami Heat 104-102 on Wednesday night."}
{"game_id": "0021700855", "chunk_id": "0021700855_003", "order": 3, "role": "body", "text": "Dario Saric added 19 points and Marco Belinelli scored 17 in his first game with the 76ers, who won their fifth straight and 11th in a row on their home court."}
{"game_id": "0021700855", "chunk_id": "0021700855_004", "order": 4, "role": "body", "text": "\"It just shows what kind of team we are,\" said Simmons, who finished with 18 points, 12 rebounds and 10 assists. \"Fighting back, staying with it.\""}
{"game_id": "0021700855", "chunk_id": "0021700855_005", "order": 5, "role": "body", "text": "Embiid sat because of soreness in his right ankle. Scheduled to start for the Eastern Conference in the All-Star game this weekend, Embiid is averaging 23.7 points, 11.1 rebounds and 1.8 blocks."}
{"game_id": "0021700855", "chunk_id": "0021700855_006", "order": 6, "role": "body", "text": "\"Knowing he's out, I had to be more aggressive and get my teammates involved,\" Simmons said. \"Everybody played well.\""}
{"game_id": "0021700855", "chunk_id": "0021700855_007", "order": 7, "role": "body", "text": "Well, at least in the second half."}
{"game_id": "0021700855", "chunk_id": "0021700855_008", "order": 8, "role": "body", "text": "Philadelphia trailed by 23 at halftime and the Heat looked like they were going to coast to a victory when Luke Babbitt made a corner 3-pointer to make it 68-44 2:49 into the third quarter. But the 76ers outscored Miami 29-13 the rest of the third period and closed within 84-82 with 8:44 left in the game when Belinelli opened the fourth period with three consecutive 3-pointers."}
{"game_id": "0021700855", "chunk_id": "0021700855_009", "order": 9, "role": "body", "text": "Philadelphia surged into the lead on Simmons' alley-oop finish after Redick's pass that made it 92-90 with 5:14 to play, and the 76ers took their biggest lead on Belinelli's layup that put them up 100-94 with 2:25 left."}
{"game_id": "0021700855", "chunk_id": "0021700855_010", "order": 10, "role": "body", "text": "Redick's off-balance jumper made it 102-99 with 19.4 seconds left. Wayne Ellington's tying attempt with 15 seconds remaining missed, and Philadelphia looked like it had the game won when Robert Covington made a pair of free throws with 13.1 ticks left."}
{"game_id": "0021700855", "chunk_id": "0021700855_011", "order": 11, "role": "body", "text": "But Tyler Johnson hit a 3 with 4.1 remaining to pull the Heat within 104-102, and then the 76ers turned it over on their next possession."}
{"game_id": "0021700855", "chunk_id": "0021700855_012", "order": 12, "role": "body", "text": "Dwyane Wade had a chance to win it at the buzzer, but his 3-point attempt rimmed out."}
{"game_id": "0021700855", "chunk_id": "0021700855_013", "order": 13, "role": "body", "text": "\"We needed everyone,\" Philadelphia coach Brett Brown said. \"The level of desperation we needed to show to come back from that massive of a deficit.The execution at the end was great.\""}
{"game_id": "0021700855", "chunk_id": "0021700855_014", "order": 14, "role": "body", "text": "James Johnson had 22 points and Goran Dragic added 18 for the Heat, who have lost seven of eight. Hassan Whiteside added a double-double with 16 points and 10 rebounds for Miami."}
{"game_id": "0021700855", "chunk_id": "0021700855_015", "order": 15, "role": "body", "text": "Heat coach Erik Spoelstra remained positive after the defeat."}
{"game_id": "0021700855", "chunk_id": "0021700855_016", "order": 16, "role": "body", "text": "\"We're capable of getting over this hump and I believe we will,\" he said."}
{"game_id": "0021700855", "chunk_id": "0021700855_018", "order": 18, "role": "body", "text": "The 76ers remained in seventh place in the Eastern Conference, one spot ahead of the Heat. Miami is 1 1/2 games in front of ninth-placed Detroit for the final playoff spot in the East."}
{"game_id": "0021700855", "chunk_id": "0021700855_020", "order": 20, "role": "body", "text": "Heat: Kelly Olynyk (shoulder) missed his fourth straight game. . Wade had eight points in his third game back with the Heat since being traded from Cleveland. . Prior to the game, Spoelstra expressed his sympathy and extended his prayers for the victims of the Parkland shooting."}
{"game_id": "0021700855", "chunk_id": "0021700855_021", "order": 21, "role": "body", "text": "76ers: Justin Anderson (right ankle sprain) didn't play after getting hurt in the second quarter of Monday's 108-92 win over the Knicks. . Richaun Holmes, who didn't play in five of the previous six games, had 11 points and nine rebounds. ... The last time the Sixers came back from 20-plus points to win was Dec. 23, 2014 at Miami when they came back from 23 down to win 91-87."}
{"game_id": "0021700855", "chunk_id": "0021700855_023", "order": 23, "role": "body", "text": "The contest was the final game before the All-Star break for both teams."}
{"game_id": "0021700855", "chunk_id": "0021700855_024", "order": 24, "role": "body", "text": "Heat: At New Orleans, Feb. 23."}
