{"game_id": "0021700241", "chunk_id": "0021700241_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Dwight Howard is doing anything he can to eliminate the pressure he feels shooting free throws -- even if that means thinking about the Unabomber."}
{"game_id": "0021700241", "chunk_id": "0021700241_002", "order": 2, "role": "body", "text": "Howard said he let his mind wander Monday night to a recent show he's been watching on Netflix about the hunt for the Unabomber. The big man went 9 of 14 at the foul line and finished with 25 points and 20 rebounds in the Charlotte Hornets' 118-102 win over the Minnesota Timberwolves."}
{"game_id": "0021700241", "chunk_id": "0021700241_003", "order": 3, "role": "body", "text": "\"I guess it works,\" Howard said. \"I just stay away from my own brain.\""}
{"game_id": "0021700241", "chunk_id": "0021700241_004", "order": 4, "role": "body", "text": "Free throw shooting has been an adventure for Howard this season. He was making only 40.3 percent coming into the game, but shot 6 of 10 in the fourth quarter when the Timberwolves were intentionally fouling him in an attempt to erase a double-digit deficit."}
{"game_id": "0021700241", "chunk_id": "0021700241_005", "order": 5, "role": "body", "text": "Howard said he shoots about 200 foul shots every day and swears he makes more than 90 percent of them on a consistent basis in practice."}
{"game_id": "0021700241", "chunk_id": "0021700241_006", "order": 6, "role": "body", "text": "But he added that he tends to freeze up during games -- even after 13 seasons in the NBA -- and worries about being taken out down the stretch because of his failure to convert them."}
{"game_id": "0021700241", "chunk_id": "0021700241_007", "order": 7, "role": "body", "text": "He said now he is taking a \"who cares\" approach."}
{"game_id": "0021700241", "chunk_id": "0021700241_008", "order": 8, "role": "body", "text": "\"That's what I have been focusing on is not being so tense at the line,\" Howard said. \"I'm so passionate in the game that when I step up to the line my emotions are still running so high that I don't know how to bring my shoulders down. ... I have to deflate my shoulders and make my shots.\""}
{"game_id": "0021700241", "chunk_id": "0021700241_009", "order": 9, "role": "body", "text": "Howard, acquired in an offseason trade from Atlanta, was 8 for 10 from the field and added four blocks. It was his 49th 20-20 game, the most among active NBA players."}
{"game_id": "0021700241", "chunk_id": "0021700241_010", "order": 10, "role": "body", "text": "He outplayed Timberwolves big man Karl-Anthony Towns, who had 18 points and 12 rebounds as Minnesota lost on back-to-back nights."}
{"game_id": "0021700241", "chunk_id": "0021700241_011", "order": 11, "role": "body", "text": "\"He controlled the paint at both ends of the floor, so he was a force in the paint on offense and his pick-and-roll defense,\" Hornets coach Steve Clifford said. \"His team defense was terrific. He controlled the game.\""}
{"game_id": "0021700241", "chunk_id": "0021700241_012", "order": 12, "role": "body", "text": "Said Timberwolves forward Taj Gibson: \"We tried to get a body on him but he was real active tonight. We tried to match it, but their whole group collectively did well moving the ball and had us strung out.\""}
{"game_id": "0021700241", "chunk_id": "0021700241_014", "order": 14, "role": "body", "text": "Timberwolves: Andrew Wiggins got a technical foul after disputing a charge call against him in the third quarter."}
{"game_id": "0021700241", "chunk_id": "0021700241_015", "order": 15, "role": "body", "text": "Hornets: Came in having committed the fewest turnovers in the league but gave the ball away 11 times in the first half. ... Howard was charged with a flagrant foul when he threw a high elbow toward the upper body of Towns in the third quarter."}
{"game_id": "0021700241", "chunk_id": "0021700241_017", "order": 17, "role": "body", "text": "Charlotte forward Frank Kaminsky provided a huge spark off the bench, scoring nine of his 24 points in the fourth quarter. He shot 9 of 15 overall, including 4 of 5 from beyond the arc."}
{"game_id": "0021700241", "chunk_id": "0021700241_018", "order": 18, "role": "body", "text": "The Hornets led by four entering the fourth before Kaminsky took over and helped build a double-digit advantage with a pair of 3-pointers."}
{"game_id": "0021700241", "chunk_id": "0021700241_019", "order": 19, "role": "body", "text": "\"The ball was going in,\" Kaminsky said. \"Just wanted to attack. We've had some lulls in energy in the second half so I just want to come out and play with some heart.\""}
{"game_id": "0021700241", "chunk_id": "0021700241_021", "order": 21, "role": "body", "text": "The Timberwolves shot 6 of 27 from 3-point range, including 1 of 14 in the first half."}
{"game_id": "0021700241", "chunk_id": "0021700241_022", "order": 22, "role": "body", "text": "Jamal Crawford led Minnesota with 19 points, and Jeff Teague added 18. Wiggins struggled from the field, going 5 of 14 and finishing with 11 points."}
{"game_id": "0021700241", "chunk_id": "0021700241_023", "order": 23, "role": "body", "text": "Playing its third game in four nights might have contributed to Minnesota's poor shooting."}
{"game_id": "0021700241", "chunk_id": "0021700241_024", "order": 24, "role": "body", "text": "\"You don't ever want to make excuses and obviously we have work to do and we're still a work in progress,\" Crawford said. \"We're a long way from being where we will be, but I think that's a good thing. We have something to work toward.\""}
{"game_id": "0021700241", "chunk_id": "0021700241_026", "order": 26, "role": "body", "text": "Cody Zeller capped the scoring with a 3-pointer from the top of the key -- his first attempt of the season."}
{"game_id": "0021700241", "chunk_id": "0021700241_027", "order": 27, "role": "body", "text": "\"I think I'm leading the league in 3-point percentage,\" Zeller joked."}
{"game_id": "0021700241", "chunk_id": "0021700241_029", "order": 29, "role": "body", "text": "Timberwolves: Host the Orlando Magic on Wednesday night."}
{"game_id": "0021700241", "chunk_id": "0021700241_030", "order": 30, "role": "body", "text": "Hornets: Host the Washington Wizards on Wednesday night."}
{"game_id": "0021700241", "chunk_id": "0021700241_032", "order": 32, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
