{"game_id": "0021700382", "chunk_id": "0021700382_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Even struggling from the field, Russell Westbrook managed to record a triple-double, and he converted two game-winning free throws in overtime."}
{"game_id": "0021700382", "chunk_id": "0021700382_002", "order": 2, "role": "body", "text": "Westbrook's free throws with 5.2 seconds left gave him 20 points on the night to go with 14 assists and 11 rebounds as the Oklahoma City Thunder rallied for a 102-101 victory over the Memphis Grizzlies on Saturday night."}
{"game_id": "0021700382", "chunk_id": "0021700382_003", "order": 3, "role": "body", "text": "The Thunder overcame a 20-point first-half deficit, the second consecutive game that the Grizzlies have squandered a big lead in a losing effort. Memphis led by 17 against Toronto on Friday night before losing to the Raptors."}
{"game_id": "0021700382", "chunk_id": "0021700382_004", "order": 4, "role": "body", "text": "\"It was the extra kind of urgency,\" said Thunder center Steven Adams, who along with Carmelo Anthony led Oklahoma City with 21 points and nine rebounds each. \"We tried to speed up the game as well with tempo. We were just playing too slow, allowing them to get into their defense. The change of tempo was good.\""}
{"game_id": "0021700382", "chunk_id": "0021700382_005", "order": 5, "role": "body", "text": "After chipping into the 20-point Memphis lead, the Thunder still trailed 57-46 at intermission. The change of pace and a defense that allowed the Grizzlies only nine points in the third quarter, helped erase the Memphis lead."}
{"game_id": "0021700382", "chunk_id": "0021700382_006", "order": 6, "role": "body", "text": "The teams were tied at 92 after regulation as Andrew Harrison blocked Westbrook's 3-point attempt at the end of the fourth."}
{"game_id": "0021700382", "chunk_id": "0021700382_007", "order": 7, "role": "body", "text": "Alex Abrines, starting for the injured Paul George, made two 3-pointers in the early stages of overtime to keep Oklahoma City tied with Memphis. Abrines would match Westbrook's 20 points to lead the Thunder -- the 20 points was Abrines' career-high. He converted 6 of 8 from outside the arc."}
{"game_id": "0021700382", "chunk_id": "0021700382_008", "order": 8, "role": "body", "text": "\"I just felt confident this morning,\" Abrines said, \"and I hit the first three (3-pointers) I shot, so that gave me a lot of confidence.\""}
{"game_id": "0021700382", "chunk_id": "0021700382_009", "order": 9, "role": "body", "text": "Tyreke Evans led Memphis with 29 points and 13 rebounds, while Marc Gasol finished with 22 points. Ben McLemore contributed a season-best 17 points as the Grizzlies lost their third straight and 14th of the last 15."}
{"game_id": "0021700382", "chunk_id": "0021700382_010", "order": 10, "role": "body", "text": "\"We had our chances. Over and over again, we had our chances,\" Memphis interim coach J. B. Bickerstaff said. \"We can't afford to let these games slip."}
{"game_id": "0021700382", "chunk_id": "0021700382_011", "order": 11, "role": "body", "text": "\"We had our opportunities. We let it slip away from us.\""}
{"game_id": "0021700382", "chunk_id": "0021700382_013", "order": 13, "role": "body", "text": "Thunder: George did not play because of a right calf injury. Abrines started his second game of the season. ... Adams has reached double figures in five straight games. . Westbrook has eight triple-doubles on the season. . The Thunder are 3-10 on the road this season."}
{"game_id": "0021700382", "chunk_id": "0021700382_014", "order": 14, "role": "body", "text": "Grizzlies: F Chandler Parsons did not play, resting on the second night of a back-to-back. ... The 20-point lead in the first half was the largest this season for Memphis. ... Memphis scored nine points in the third quarter, a season-low for any period this season."}
{"game_id": "0021700382", "chunk_id": "0021700382_016", "order": 16, "role": "body", "text": "Oklahoma City cut into Memphis leads with strong final minutes in the second and third quarters. After Memphis took its 20-point lead in the second, the Thunder reeled off 13 straight points to get back in the game before the break. Then, in the third, the Thunder used a 12-3 run to erase an 8-point Memphis lead."}
{"game_id": "0021700382", "chunk_id": "0021700382_018", "order": 18, "role": "body", "text": "The 20-point lead, the biggest of the season for Memphis, disappeared quickly, and despite hanging on for overtime, the Grizzlies again didn't take advantage of the early performance. \"Basketball happened. They made runs,\" Gasol said."}
{"game_id": "0021700382", "chunk_id": "0021700382_020", "order": 20, "role": "body", "text": "The Grizzlies frustration is in full force. \"We have to figure out a way to close out these games. It's frustrating. Hard to sleep.\" -Harrison."}
{"game_id": "0021700382", "chunk_id": "0021700382_022", "order": 22, "role": "body", "text": "Thunder: Face Charlotte at home on Monday."}
{"game_id": "0021700382", "chunk_id": "0021700382_023", "order": 23, "role": "body", "text": "Grizzlies: Play their third home game in four days when the Miami Heat visit on Monday."}
{"game_id": "0021700382", "chunk_id": "0021700382_025", "order": 25, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
