{"game_id": "0021701221", "chunk_id": "0021701221_001", "order": 1, "role": "lead", "text": "MIAMI --  Here were the two primary goals for the Miami Heat on the final night of the regular season: Beat the No. 1 seed in the Eastern Conference, and get Wayne Ellington into the team record book."}
{"game_id": "0021701221", "chunk_id": "0021701221_003", "order": 3, "role": "body", "text": "Ellington scored a career-high 32 points while setting Miami's single-season record for 3-pointers, and the Heat wrapped up the No. 6 seed in the Eastern Conference playoffs by beating the Toronto Raptors 116-109 in overtime Wednesday night."}
{"game_id": "0021701221", "chunk_id": "0021701221_004", "order": 4, "role": "body", "text": "\"It's just absolutely fitting that it would come down to an overtime game with this group,\" Heat coach Erik Spoelstra said. \"It was a heck of a regular season. Now we're on to the second act.\""}
{"game_id": "0021701221", "chunk_id": "0021701221_005", "order": 5, "role": "body", "text": "That starts this weekend, when the Heat go to Philadelphia and take on the third-seeded 76ers in Game 1 of the Eastern Conference quarterfinals."}
{"game_id": "0021701221", "chunk_id": "0021701221_006", "order": 6, "role": "body", "text": "Kelly Olynyk, Dwyane Wade, Justise Winslow, James Johnson and Tyler Johnson each scored 11 points for the Heat, who got 10 each from Hassan Whiteside and Bam Adebayo."}
{"game_id": "0021701221", "chunk_id": "0021701221_007", "order": 7, "role": "body", "text": "Ellington needed six 3s to beat the record of 225 that Damon Jones set in the 2004-05 season. He finished the season with 227, and now gets to go to his hometown to start the postseason."}
{"game_id": "0021701221", "chunk_id": "0021701221_008", "order": 8, "role": "body", "text": "\"A big-time overtime win,\" Ellington said. \"We feel like if you put us up against anybody in seven games, we can beat them. That's the kind of team we feel like we are. It's going to be a dogfight no matter what.\""}
{"game_id": "0021701221", "chunk_id": "0021701221_009", "order": 9, "role": "body", "text": "Kyle Lowry scored 28 points for Toronto, which already had the top seed in the East wrapped up -- but played its regulars in this one anyway. The Raptors will meet No. 8 Washington in the first round."}
{"game_id": "0021701221", "chunk_id": "0021701221_010", "order": 10, "role": "body", "text": "DeMar DeRozan had 19 points, Jakob Poeltl had 16 and Jonas Valanciunas scored 12 for the Raptors, who were outscored 11-4 in overtime."}
{"game_id": "0021701221", "chunk_id": "0021701221_011", "order": 11, "role": "body", "text": "\"We had a goal set out that we would win 60 games before these 82 were up,\" DeRozan said. \"That didn't happen. Time to clear that. None of that matters now. Get ready for this weekend.\""}
{"game_id": "0021701221", "chunk_id": "0021701221_012", "order": 12, "role": "body", "text": "Even with nothing standings-wise to play for, the Raptors had no qualms about using their starters. Lowry, DeRozan, Valanciunas and Serge Ibaka combined to play more than 120 minutes."}
{"game_id": "0021701221", "chunk_id": "0021701221_013", "order": 13, "role": "body", "text": "The Raptors were 22-60 in 2010-11, the season before coach Dwane Casey came to Toronto. They ended this season 59-23."}
{"game_id": "0021701221", "chunk_id": "0021701221_014", "order": 14, "role": "body", "text": "\"It's taken us a while to build our program, to get it where it is,\" said Casey, a coach of the year candidate this season. \"This (Heat) program has multiple championships and we're trying to get to that level organically. And it takes time. You're just not going to wave a magic wand and turn a player into Magic Johnson or Larry Bird or anybody like that. It's part of the process, and that's something I know our organization is proud of.\""}
{"game_id": "0021701221", "chunk_id": "0021701221_015", "order": 15, "role": "body", "text": "Ellington's 3-pointer with 18.8 seconds left in regulation put Miami up two, and Poeltl tied it with a tip-in. But Miami scored the first five points of the extra session and didn't look back."}
{"game_id": "0021701221", "chunk_id": "0021701221_016", "order": 16, "role": "body", "text": "A year ago on the last night of the season, the Heat were left teary-eyed and with a sour taste in their mouths after missing the playoffs."}
{"game_id": "0021701221", "chunk_id": "0021701221_017", "order": 17, "role": "body", "text": "This time, Wade and Udonis Haslem toasted each other with flutes of fancy champagne to celebrate their 15th NBA season."}
{"game_id": "0021701221", "chunk_id": "0021701221_018", "order": 18, "role": "body", "text": "\"It really means something, every time you complete a season especially as you get up there,\" Wade said. \"So both of us are a little tipsy.\""}
{"game_id": "0021701221", "chunk_id": "0021701221_020", "order": 20, "role": "body", "text": "Raptors: Key reserve Fred VanVleet left with 1:32 remaining in regulation after apparently getting hurt while trying to fight through a screen. He stayed down for several seconds near the Toronto bench before getting helped off the floor. ... Toronto went 25-16 on the road, and 40-12 against East opponents."}
{"game_id": "0021701221", "chunk_id": "0021701221_021", "order": 21, "role": "body", "text": "Heat: All-Star point guard Goran Dragic missed the game with soreness in his right knee. The Heat are not concerned about his availability for Game 1 of the playoffs. ... Miami finished 26-15 at home."}
{"game_id": "0021701221", "chunk_id": "0021701221_023", "order": 23, "role": "body", "text": "Tony Fiorentino, one of the Heat original employees who started as an assistant coach in the team's inaugural season 30 years ago before transitioning to broadcasting, was honored in a halftime ceremony. Fiorentino has spent the last 15 season as the Heat television analyst, and will assume a team-ambassador position when Miami's playoff run ends."}
{"game_id": "0021701221", "chunk_id": "0021701221_025", "order": 25, "role": "body", "text": "To say Poeltl is going into the postseason on a hot streak is an understatement. Poeltl ended the regular season having made 34 of his last 39 shots in the final eight games. Poeltl is also the only Raptors player who appeared in all 82 regular-season contests."}
{"game_id": "0021701221", "chunk_id": "0021701221_027", "order": 27, "role": "body", "text": "Raptors: Face Washington in Eastern Conference quarterfinals."}
{"game_id": "0021701221", "chunk_id": "0021701221_028", "order": 28, "role": "body", "text": "Heat: Face Philadelphia in Eastern Conference quarterfinals."}
{"game_id": "0021701221", "chunk_id": "0021701221_030", "order": 30, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
