{"game_id": "0021400806", "chunk_id": "0021400806_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. -- Spencer Dinwiddie spent Thursday afternoon preparing for another weekend in the D-League.\nA day later, everything had changed.\nAfter a pair of trades left the Pistons short-handed, the rookie point guard was thrust into the starting lineup Friday night and outplayed Derrick Rose in Detroit's 100-91 victory over the Chicago Bulls.\n\"I was getting ready to head to Grand Rapids for the weekend, and then all the crazy stuff started happening at the trade deadline,\" Dinwiddie said. \"I was just trying to keep up with who was going where, and all of a sudden they told me that my plans had changed.\n\"I thought they meant I had gotten traded, too. Luckily, I just didn't have to go to the D-League.\"\nThe Pistons traded two starters, including point guard D.J. Augustin, to Oklahoma City for Reggie Jackson. But when the three-team deal wasn't finalized by Friday night, coach Stan Van Gundy was left with only John Lucas III and Dinwiddie at the point.\nLucas was the obvious choice, but Van Gundy went with a hunch.\n\"We had two hard practices the last two days, and everyone on the team noticed how well Spencer was playing,\" he said. \"He's always been a poised player, but he still does too much at a jogging pace. In the last two days, he had really picked up the tempo.\"\nDinwiddie made it work, putting up career highs of 12 points and nine assists while Rose only had eight points and two assists in 31 minutes.\n\"I had butterflies about starting the game, but it was something else to play against Derrick,\" Dinwiddie said. \"I've always loved his game, and he came back from an ACL tear, just like I've had to do, so it meant even more.\"\nThe Pistons dressed only 10 players due to the trades for Jackson and Tayshaun Prince. Jackson was on Detroit's bench, cheering wildly, but didn't get clearance in time to play. Prince won't arrive until Saturday.\n\"That was a lot of fun,\" Jackson said. \"We've got big guys who can bang, we've got shooters and we've got guys hustling all over the floor. I can't wait to be out there.\"\nJimmy Butler had 30 points for Chicago, and Joakim Noah added 10 points and 14 rebounds. Rose, Mike Dunleavy and Pau Gasol went a combined 6 for 24 from the field.\n\"I was just missing shots, I guess,\" Rose said. \"I didn't touch the ball for a couple days, and coming back, I just couldn't catch a rhythm. They were aggressive and I couldn't find my game. Thank God we've got another game tomorrow, because this one hurt.\"\nAndre Drummond finished with 18 points and 20 rebounds for Detroit, aided greatly by one wild sequence. He grabbed a blocked shot, missed the putback, then tipped the ball four more times before getting it into the basket. He was credited with five offensive rebounds and five field-goal attempts in 5 seconds.\n\"That was actually a great play,\" Van Gundy said. \"Obviously, you'd rather he put it in on the first try, but that showed an incredible amount of effort to keep getting to the ball and keeping it alive until he put it in. You love seeing that from a 21-year-old kid.\"\nChicago led at halftime, but the Pistons started the second half with a 24-7 run that included seven points from Caron Butler and six more from Drummond. Detroit outscored the Bulls 32-15 in the period, giving the Pistons a nine-point edge.\nChicago took advantage of Detroit's undermanned bench, scoring the first six points of the fourth to pull to 77-74. Van Gundy, however, put his makeshift starting lineup back on the floor and the Pistons were able to hold on from the free throw line.\nTIP-INS\nBulls: Chicago had won 22 of 24 against the Pistons, including an 18-game winning streak that ended in 2013. ... Taj Gibson had 13 points on 6-of-11 shooting in the first half, but only tried two shots in 13 second-half minutes.\nPistons: Greg Monroe and Caron Butler each scored 20 points. ... With the Pistons playing again Sunday afternoon, Jackson will only get a light workout with his new teammates before his first game, while Prince won't even get that. \"The guys had tomorrow off, but we're going to bring them in for a short practice just so Reggie can work with them,\" Van Gundy said. \"Tayshaun won't even get here in time for that, so all he will get is a quick walkthrough in the morning.\"\nUP NEXT\nBulls: Host Phoenix on Saturday.\nPistons: Host Washington on Sunday."}
