{"game_id": "0021400604", "chunk_id": "0021400604_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  With all of the Memphis Grizzlies' firepower, it was reserve point guard Beno Udrih who came up with not one, but two key baskets to preserve a win."}
{"game_id": "0021400604", "chunk_id": "0021400604_002", "order": 2, "role": "body", "text": "Udrih's second basket with 8.7 seconds left helped Memphis hold off a Portland rally, and the Grizzlies won their fourth straight 102-98 over the Trail Blazers on Saturday night."}
{"game_id": "0021400604", "chunk_id": "0021400604_003", "order": 3, "role": "body", "text": "\"I looked at the clock and it was a low clock,\" Udrih said of the final basket. \"I didn't want to put somebody else in a position to shoot a desperate shot, so I just got to my spot. I was feeling pretty good the whole game, so I just knocked it down.\""}
{"game_id": "0021400604", "chunk_id": "0021400604_004", "order": 4, "role": "body", "text": "The 22-footer completed a perfect 7-for-7 night shooting for Udrih, who was playing for injured starter Mike Conley."}
{"game_id": "0021400604", "chunk_id": "0021400604_005", "order": 5, "role": "body", "text": "Zach Randolph had 20 points and 15 rebounds, Jeff Green and Courtney Lee matched Udrih's 17 points and Marc Gasol finished with 15 points, eight rebounds, six assists and three blocks for the Grizzlies."}
{"game_id": "0021400604", "chunk_id": "0021400604_006", "order": 6, "role": "body", "text": "Memphis led by as many as 20 in the second half, but saw that dwindle to 95-93 when Portland's Damian Lillard connected on a 3-pointer with 1:06 left. Udrih's 20-footer as the shot clock expired on the next possession helped Memphis maintain the lead."}
{"game_id": "0021400604", "chunk_id": "0021400604_007", "order": 7, "role": "body", "text": "Lillard connected on another 3-pointer with 27 seconds left, but then Udrih made his 22-footer."}
{"game_id": "0021400604", "chunk_id": "0021400604_008", "order": 8, "role": "body", "text": "\"I was pleased with our effort in the second half,\" Portland coach Terry Stotts said. \"Beno made two jumpers that obviously made a difference. We put ourselves in a position to win a game on the road against a good team and just fell a little short in the second half.\""}
{"game_id": "0021400604", "chunk_id": "0021400604_009", "order": 9, "role": "body", "text": "LaMarcus Aldridge led Portland with 32 points, 18 in the second half, while Wesley Matthews finished with 25 points. Lillard, who struggled through three quarters, scored 23, including 10 in the fourth as Portland made its comeback."}
{"game_id": "0021400604", "chunk_id": "0021400604_010", "order": 10, "role": "body", "text": "The loss gave Portland its first three-game losing streak this season."}
{"game_id": "0021400604", "chunk_id": "0021400604_011", "order": 11, "role": "body", "text": "\"If I knew the answer, I would fix it,\" Aldridge said when asked about execution. \"So, I don't know. I think we've got to look in the mirror and see what we're doing.\""}
{"game_id": "0021400604", "chunk_id": "0021400604_012", "order": 12, "role": "body", "text": "Portland only converted a third of its shots through much of the first three quarters. That allowed Memphis to extend its advantage to 20. The Trail Blazers were able to trim the Memphis lead to 78-70 after three."}
{"game_id": "0021400604", "chunk_id": "0021400604_013", "order": 13, "role": "body", "text": "Matthews and Aldridge keyed a 12-2 rally in the middle of the fourth. Aldridge backed down whatever defender the Grizzlies rotated to him."}
{"game_id": "0021400604", "chunk_id": "0021400604_014", "order": 14, "role": "body", "text": "Portland got no closer than three points in the final minute thanks to Udrih's baskets -- both coming late in the shot clock."}
{"game_id": "0021400604", "chunk_id": "0021400604_015", "order": 15, "role": "body", "text": "\"I thought the fourth quarter was as close to playoff intensity as you can get in game 40,\" Memphis coach Dave Joerger said."}
{"game_id": "0021400604", "chunk_id": "0021400604_017", "order": 17, "role": "body", "text": "Trail Blazers: Nicolas Batum scored three points, and has reached double figures only once in the last seven games. ...Portland has lost seven of the last eight games against Memphis. ...After Portland's leading three scorers, no other player had more than five points."}
{"game_id": "0021400604", "chunk_id": "0021400604_018", "order": 18, "role": "body", "text": "Grizzlies: Former Grizzly Shane Battier, part of the announcing crew for the afternoon University of Memphis and Central Florida game at FedExForum, attended the game and tried to sneak onto the floor for a shooting contest during a timeout. ...Randolph grabbed his eighth rebound of the game in the second quarter, passing Pau Gasol as the top rebounder in Grizzlies franchise history."}
{"game_id": "0021400604", "chunk_id": "0021400604_020", "order": 20, "role": "body", "text": "Conley warmed up before the game, but said he thought he needed rest on his sore right ankle, missing his second straight game. Indications are he could return Monday against the Mavericks."}
{"game_id": "0021400604", "chunk_id": "0021400604_022", "order": 22, "role": "body", "text": "Green and backup point guard Russ Smith, obtained in the three-team deal last week, appeared at their first home game for the Grizzlies. Green received a standing ovation when he entered in first quarter. Smith did not play."}
{"game_id": "0021400604", "chunk_id": "0021400604_024", "order": 24, "role": "body", "text": "Trail Blazers: Host Kings on Monday"}
{"game_id": "0021400604", "chunk_id": "0021400604_025", "order": 25, "role": "closing", "text": "Grizzlies: Host Mavericks on Monday"}
