{"game_id": "0021200067", "chunk_id": "0021200067_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- Chris Paul joked that the Trail Blazers' near-comeback against the Clippers made for good television."}
{"game_id": "0021200067", "chunk_id": "0021200067_002", "order": 2, "role": "body", "text": "\"You always gotta make it interesting,\" he said with a smile."}
{"game_id": "0021200067", "chunk_id": "0021200067_004", "order": 4, "role": "body", "text": "The Clippers built a 25-point lead in the first half, then held off a second-half rally by the Blazers for a 103-90 victory Thursday night. Jamal Crawford scored 25 points off the bench, while Paul and DeAndre Jordan had 21 apiece."}
{"game_id": "0021200067", "chunk_id": "0021200067_005", "order": 5, "role": "body", "text": "\"We all knew what we were supposed to do. We came out a little flat defensively in the third quarter, so we all got on each other,\" Jordan said. \"We knew in the fourth quarter we had to come out and play.\""}
{"game_id": "0021200067", "chunk_id": "0021200067_006", "order": 6, "role": "body", "text": "Nicolas Batum had 23 points and nine rebounds for the Blazers, who ultimately couldn't catch up."}
{"game_id": "0021200067", "chunk_id": "0021200067_007", "order": 7, "role": "body", "text": "Rookie Damian Lillard's pull-up jumper and Batum's 3-pointer helped Portland trim Los Angeles' lead to 75-69 late in the third quarter. Batum's driving layup at the buzzer made it 77-71 heading into the final period."}
{"game_id": "0021200067", "chunk_id": "0021200067_008", "order": 8, "role": "body", "text": "Portland closed to 86-82 on Meyers Leonard's alley-oop dunk from Batum, but the rally fizzled and Paul sent fans streaming for the doors when his jumper with 2:51 left extended the lead to 98-85."}
{"game_id": "0021200067", "chunk_id": "0021200067_009", "order": 9, "role": "body", "text": "\"We can't wait until we're down 20 points to say, 'Man, we've got to play now,'\" said Batum, who had success in the second half when he was put on Paul."}
{"game_id": "0021200067", "chunk_id": "0021200067_010", "order": 10, "role": "body", "text": "Clippers star Blake Griffin had 10 rebounds and seven points while playing with a sleeve covering his right arm for the third straight game because of fluid in his elbow."}
{"game_id": "0021200067", "chunk_id": "0021200067_011", "order": 11, "role": "body", "text": "\"I wouldn't really say it's affecting my play. Once you're out there, it's just a matter of playing,\" Griffin said. \"It's gotten better each day, so a few days off will be good for it, but it's not something I'm worried about.\""}
{"game_id": "0021200067", "chunk_id": "0021200067_012", "order": 12, "role": "body", "text": "Los Angeles improved to 4-2 in its first game away from Staples Center. The Clippers had a road win over the rival Lakers last Friday."}
{"game_id": "0021200067", "chunk_id": "0021200067_013", "order": 13, "role": "body", "text": "The victory over Portland came on the second night of back-to-back games. The Clippers handed San Antonio its first loss with a 106-84 victory Wednesday night."}
{"game_id": "0021200067", "chunk_id": "0021200067_014", "order": 14, "role": "body", "text": "The Blazers (2-3) were coming off a 1-2 road trip that concluded with a 114-91 loss at Dallas on Monday."}
{"game_id": "0021200067", "chunk_id": "0021200067_015", "order": 15, "role": "body", "text": "Lillard said the fact that the Blazers came back from such a deficit was encouraging."}
{"game_id": "0021200067", "chunk_id": "0021200067_016", "order": 16, "role": "body", "text": "\"We know when we play like that, with a lot of energy and when we're flying around, playing hard and moving the ball, we know that we can play with one of the best teams in the league,\" he said. \"At the same time, we can't put ourselves in that hole, because we're not that level of team to be able to fight back every time.\""}
{"game_id": "0021200067", "chunk_id": "0021200067_017", "order": 17, "role": "body", "text": "Willie Green hit a 3-pointer to give the Clippers a 24-16 lead in the first quarter, and it quickly got ugly."}
{"game_id": "0021200067", "chunk_id": "0021200067_018", "order": 18, "role": "body", "text": "The Clippers grabbed a 43-28 lead on Matt Barnes' fast-break basket. Portland struggled offensively, and Los Angeles led 53-30 after a 22-2 run -- much of it with Griffin taking a break on the bench."}
{"game_id": "0021200067", "chunk_id": "0021200067_019", "order": 19, "role": "body", "text": "Luke Babbitt hit a 3-pointer for the Blazers at the halftime buzzer, but it didn't make much of a difference and the Clippers led 60-39 at the break."}
{"game_id": "0021200067", "chunk_id": "0021200067_020", "order": 20, "role": "body", "text": "Portland's reserves, averaging an NBA-low 12.8 points per game, had just eight points in the first half. Their Clippers counterparts scored 25."}
{"game_id": "0021200067", "chunk_id": "0021200067_021", "order": 21, "role": "body", "text": "The Blazers outscored the Clippers 32-17 in the third quarter, shooting 71 percent from the floor. Batum led the way with 12 points in the quarter."}
{"game_id": "0021200067", "chunk_id": "0021200067_022", "order": 22, "role": "body", "text": "For the game, Los Angeles shot 53 percent and Portland shot just less than 43 percent."}
{"game_id": "0021200067", "chunk_id": "0021200067_023", "order": 23, "role": "body", "text": "\"The first half skewed the whole thing,\" Blazers coach Terry Stotts said. \"The shooting percentages in the first half were very disparate. The third quarter obviously made up for a lot of that in the final tally, but on the whole, we didn't offer much resistance in the first half.\""}
{"game_id": "0021200067", "chunk_id": "0021200067_024", "order": 24, "role": "body", "text": "Stotts said before the game that he anticipated an interesting matchup between perennial All-Star Paul and rookie Lillard, the \"old guard and the new guard.\""}
{"game_id": "0021200067", "chunk_id": "0021200067_025", "order": 25, "role": "body", "text": "Lillard, quickly building a reputation for his poise in his first year, finished with 16 points. He said Paul spoke to him at times during the game, but it wasn't trash talk; Paul complimented him."}
{"game_id": "0021200067", "chunk_id": "0021200067_026", "order": 26, "role": "body", "text": "\"He can play,\" Paul said of Lillard after the game. \"Portland better hold on to him because they definitely have a prized possession for the future.\""}
{"game_id": "0021200067", "chunk_id": "0021200067_027", "order": 27, "role": "closing", "text": "Game notes The Trail Blazers collected donations for the Red Cross to aid victims of Hurricane Sandy. Fans donated more than $10,500, while Wells Fargo and the Paul G. Allen foundation each pledged $10,000 for a total of $30,500.  ... The Clippers have won seven of their 32 games in Portland. ... The Clippers have won three straight against Portland."}
