{"game_id": "0021700625", "chunk_id": "0021700625_001", "order": 1, "role": "lead", "text": "DENVER --  Missing their top scorer, the Denver Nuggets leaned on their defense to end a three-game losing streak."}
{"game_id": "0021700625", "chunk_id": "0021700625_002", "order": 2, "role": "body", "text": "Will Barton scored 17 points, Trey Lyles had 16 and the Nuggets overcame a slow start to beat the Memphis Grizzlies 87-78 on Friday night."}
{"game_id": "0021700625", "chunk_id": "0021700625_003", "order": 3, "role": "body", "text": "Denver took control of the game by holding Memphis to 13 points in the third quarter, and the Grizzlies finished with a season low in scoring by a Nuggets opponent."}
{"game_id": "0021700625", "chunk_id": "0021700625_004", "order": 4, "role": "body", "text": "\"Our defense stayed the course,\" Nuggets coach Michael Malone said. \"Tonight, a lot of guys struggled to make shots but they never deterred from the defensive end of the floor. This was a game we had to have and I am proud of our guys for going out there and getting the job done.\""}
{"game_id": "0021700625", "chunk_id": "0021700625_005", "order": 5, "role": "body", "text": "Nikola Jokic added 14 points and nine rebounds for Denver, which played without star guard Gary Harris, who was excused for personal reasons. It was the first game that Harris, who averages 16.9 points, has missed this season. Barton started in his place."}
{"game_id": "0021700625", "chunk_id": "0021700625_006", "order": 6, "role": "body", "text": "\"It's always tough, not having Gary Harris, who does everything,\" Barton said. \"He's one of our top defenders, one of our top scorers. But our mentality is always next man up and everyone stepped up and played well and we got the win.\""}
{"game_id": "0021700625", "chunk_id": "0021700625_007", "order": 7, "role": "body", "text": "Barton said the Nuggets' defense was a constant."}
{"game_id": "0021700625", "chunk_id": "0021700625_008", "order": 8, "role": "body", "text": "\"We were making those guys work and getting after them and trying to make them uncomfortable,\" he said."}
{"game_id": "0021700625", "chunk_id": "0021700625_009", "order": 9, "role": "body", "text": "Marc Gasol had 22 points and 11 rebounds for Memphis, his 18th double-double this season. Tyreke Evans and James Ennis III added 12 points each."}
{"game_id": "0021700625", "chunk_id": "0021700625_010", "order": 10, "role": "body", "text": "\"Defensively, they were able to run a lot more and they got to the free throw line more often,\" Gasol said. \"And they controlled the pace in the second half.\""}
{"game_id": "0021700625", "chunk_id": "0021700625_011", "order": 11, "role": "body", "text": "Trailing 54-50 midway through the third quarter, the Nuggets went on an 8-0 run, taking their first lead since the game's opening minutes on a driving layup by Jokic. Denver had a 67-60 advantage -- its biggest lead to that point -- heading into the fourth quarter."}
{"game_id": "0021700625", "chunk_id": "0021700625_012", "order": 12, "role": "body", "text": "Memphis pulled within three, but the Nuggets scored 10 of the next 12 points, taking a 77-66 lead on Mason Plumlee's dunk off Malik Beasley's alley-oop pass with 6:15 remaining."}
{"game_id": "0021700625", "chunk_id": "0021700625_013", "order": 13, "role": "body", "text": "Memphis could not make significant inroads on Denver's lead the rest of the way."}
{"game_id": "0021700625", "chunk_id": "0021700625_014", "order": 14, "role": "body", "text": "Denver pulled within 47-43 at halftime after a lackluster first quarter in which Memphis went on a 15-0 run for a 23-8 lead before settling for a 10-point advantage at the close of the period."}
{"game_id": "0021700625", "chunk_id": "0021700625_016", "order": 16, "role": "body", "text": "Grizzlies: G Mike Conley (left heel) and F Chandler Parsons (sore right knee) were not with the team but continue to make progress in their rehabilitation. Conley has been playing some 3-on-3 games and Parsons has participated in shooting drills. \"We will be cautious with those guys because they are important to us,\" Grizzlies interim coach J.B. Bickerstaff said. \"They are making steps in the right direction.\""}
{"game_id": "0021700625", "chunk_id": "0021700625_017", "order": 17, "role": "body", "text": "Nuggets: F Paul Millsap, sidelined since mid-November with a ligament injury in his left wrist, has begun light workouts and may be able to return shortly after the All-Star break in mid-February, though no firm date has been set. ... Retired Broncos quarterback Peyton Manning watched the game from a courtside seat."}
{"game_id": "0021700625", "chunk_id": "0021700625_019", "order": 19, "role": "body", "text": "The Grizzlies were held to 39 percent shooting (30 for 77). The Nuggets have won 18 of their last 19 when holding the opposition at or below 39 percent from the field. The only loss in that span was to Memphis two years ago."}
{"game_id": "0021700625", "chunk_id": "0021700625_021", "order": 21, "role": "body", "text": "Grizzlies: Open a three-game homestand Monday against the Los Angeles Lakers."}
{"game_id": "0021700625", "chunk_id": "0021700625_022", "order": 22, "role": "body", "text": "Nuggets: Travel to San Antonio to face the Spurs on Saturday night."}
{"game_id": "0021700625", "chunk_id": "0021700625_024", "order": 24, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
