{"game_id": "0021700158", "chunk_id": "0021700158_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- Zach Randolph chuckled at the thought that he is too old to still log major minutes in the NBA. The veteran big man has a different perspective on his game.\n\"I'm in my prime,\" Randolph said with a wide grin.\nLooked pretty good Tuesday night.\nRandolph scored each of his 18 of his points in the second half, Buddy Hield had 21 points and the Sacramento Kings rallied for a 94-86 victory over the Oklahoma City Thunder.\n\"Just kept battling,\" Randolph said. \"We have to stick with it. It's a long season. Anything can happen. We have a good team. We can compete with anybody. It's a confidence thing and a believing thing.\"\nSacramento stopped a seven-game losing streak with its first win since Oct. 20. The Kings (2-8) were limited to 10 points in the first quarter and trailed by as many as 17, but they stormed back to take the lead going into halftime and never trailed in the second half.\nThe 36-year-old Randolph was 8 for 15 from the field and also contributed eight rebounds. The Kings signed him in the offseason primarily to fill a mentor role on a team filled with young players.\n\"He's like a pillar for us,\" teammate Justin Jackson said. \"Just having him on the court, everybody has to pay attention to him. Whenever they start doing that, that frees us up a little bit more.\"\nRussell Westbrook had 20 points, 12 rebounds and six assists for Oklahoma City, which has dropped three in a row. The Thunder shot 33.7 percent (29 for 86) from the field, committed three shot clock violations in the third quarter alone and finished with 17 turnovers.\nCarmelo Anthony added 16 points and seven rebounds in his first game since he was ejected in Oklahoma City's 103-99 loss at Portland on Sunday.\n\"At times we had some possessions that were not great but I also thought we had a lot of really good looks at times that didn't go down,\" Thunder coach Billy Donovan said. \"We just didn't make enough shots or play well enough on offense.\"\nThis one will sting the Thunder for a while.\nOklahoma City led 25-8 late in the first quarter and appeared headed for a lopsided win before Sacramento quickly erased the deficit and went in front for good.\n\"It starts with me\" Westbrook said. \"Part of my job is to do that and make sure my guys are ready to play. I take ownership in that. It's part of my job to get us back on a roll.\"\nRandolph was held scoreless in the first half but scored 12 in the third and six in the fourth, including a layup that made it 89-83 with 1:18 remaining.\nWestbrook's 3-pointer trimmed the gap to 89-86 but Sacramento made three free throws and Jackson added an emphatic dunk with one second left.\nJackson had 16 points for the Kings, and De'Aaron Fox finished with 10 points and eight assists.\nSteven Adams scored 14 points for Oklahoma City, and Paul George had 12.\nWHAT A RELIEF\nWith the starting five struggling, Sacramento's reserves scored the team's first 29 points -- an NBA record, according to Elias Sports Bureau. The previous record was 23 set by Milwaukee against Orlando on April 5, 2011.\n\"We beat a good team with good players, good coaching and a great front office and everybody had a part in it,\" Sacramento coach Dave Joerger said. \"I'd love to give a bunch of `Atta boys' out but that was a total team effort.\"\nTIP-INS\nThunder: Westbrook assisted on Oklahoma City's first four baskets, including three to Adams, but didn't get another until early in the fourth quarter. The six-time All-Star also was called for a Flagrant 1 penalty in the third quarter after hitting Bogdan Bogdanovic in the face with his left hand while attempting a shot. ... Anthony was called for a technical foul in the fourth.\nKings: Sacramento missed its first 11 shots.\nUP NEXT\nThunder: Plays on the road for the sixth time in seven games Thursday at Denver.\nKings: Hosts Philadelphia on Thursday. The two teams split two games last season, each winning at home."}
