{"game_id": "0021400771", "chunk_id": "0021400771_001", "order": 1, "role": "lead", "text": "HOUSTON -- The Portland Trail Blazers were not about to let the same thing happen to them two nights in a row.\nA night after leading by 11 with two minutes left before falling in overtime at Dallas, they had another double-digit lead evaporate before taking charge late and holding on for a 109-98 victory over the Houston Rockets on Sunday.\n\"It was important,\" LaMarcus Aldridge said of bouncing back. \"We felt like last night we didn't play confident down the stretch and we weren't ourselves. So tonight we just wanted to keep doing the things that we do and be confident.\"\nAldridge scored 24 and Damian Lillard added 23.\nJames Harden tied a season high with 45 points for the Rockets, who are playing without star center Dwight Howard because of knee swelling and fell behind early.\n\"We can't put ourselves in that situation,\" Harden said. \"We played really well in the second half and we played much harder. Against a good team like Portland, we've got to do that for all four quarters.\"\nThe Trail Blazers led by 17 in the second half, but a big third quarter helped Houston to a slim lead early in the fourth. Portland scored seven straight points to break a tie and take a 92-85 lead midway through the period, with five points from Meyers Leonard in that stretch.\n\"We had great effort from everybody top to bottom that came into the game, and that was a huge part of why we were able to win,\" Lillard said.\nHouston cut the lead to four points twice in the last 2½ minutes, but Portland answered both times, and a 3-pointer by Nicolas Batum that made it 103-96 with 96 seconds left sent fans heading for the exits.\nIt was the fifth 40-point game and 23rd with at least 30 this season for Harden, who leads the NBA in scoring. He had 44 points in a win over the Trail Blazers earlier this season in a game Aldridge missed with an illness.\nHarden, who finished with nine rebounds and eight assists, scored 16 in Houston's 32-point third quarter that cut the lead to one entering the fourth.\nPortland had pushed the lead up to 15 when Houston really got going, using a 15-4 run, powered by three 3-pointers, to get within 77-73 with four minutes left in the third quarter. Two turnovers and a series of poor shots by the Trail Blazers helped Houston cut the deficit.\nA highlight of that run came when Harden drove into the lane and tripped, but regained his footing in time to hit an off-balance layup which made it 75-68.\nThe game was tied about nine minutes before halftime when Portland used a 13-2 spurt to take a 48-37 lead four minutes later. C.J. McCollum led the way in that span with nine points.\nTIP-INS\nRockets: Harden was presented with his All-Star jersey in a ceremony before the game. ... Harden made 19 of 23 free throws.\nBlazers: Lillard was added to the All-Star roster on Sunday in place of Clippers forward Blake Griffin, who will have surgery for a staph infection in his right elbow. ... Leonard finished with 12 points.\nHOWARD'S HEALTH\nHoward spoke to the media on Sunday for the first time since the team announced that he was out indefinitely because of swelling in his right knee caused by fluid in the bone. Howard had a bone marrow aspirate injection on Wednesday, and team physician Dr. Walt Lowe said Sunday that he could be out 6-8 weeks but that he could return sooner if he's \"pain-free.\"\n\"This season trying to play with it I just wasn't there, and I could feel it every single night,\" said Howard, who is averaging 16.3 points and 11 rebounds. \"Some nights I would feel really, really good and there were a lot of those nights where I just felt like I couldn't perform to my best ability.\"\n\"It's tough to sit out, but I would rather sit out and get healthy than try to play through something that could cause me to miss more games or possibly shorten my career,\" he said. \"I do not want that to happen.\"\nUP NEXT\nRockets: Visit Phoenix on Tuesday.\nBlazers: Host the Lakers on Wednesday."}
