{"game_id": "0021400845", "chunk_id": "0021400845_001", "order": 1, "role": "lead", "text": "CHICAGO --  Joakim Noah's emotions after he heard Derrick Rose will have yet another knee surgery could be summed up in two words."}
{"game_id": "0021400845", "chunk_id": "0021400845_003", "order": 3, "role": "body", "text": "The news that Rose is out again hit the Chicago Bulls hard. And they didn't get much relief from the Hornets."}
{"game_id": "0021400845", "chunk_id": "0021400845_004", "order": 4, "role": "body", "text": "Michael Kidd-Gilchrist had 18 points and 12 rebounds, Mo Williams scored 17 and Charlotte beat Chicago 98-86 Wednesday night."}
{"game_id": "0021400845", "chunk_id": "0021400845_005", "order": 5, "role": "body", "text": "Al Jefferson added 16 points to help the Hornets snap a five-game losing streak. But all that was overshadowed by the news that Rose needs another operation."}
{"game_id": "0021400845", "chunk_id": "0021400845_006", "order": 6, "role": "body", "text": "\"For them, I would think that, mentally, there's no question it will take a few games to get used to playing without him,\" Charlotte coach Steve Clifford said."}
{"game_id": "0021400845", "chunk_id": "0021400845_007", "order": 7, "role": "body", "text": "The Bulls revealed Tuesday night that their star point guard has a torn meniscus in his right knee, a big blow to the franchise and its fan base. That fueled more doubts about whether the 2011 NBA MVP will ever be the same, let alone lead Chicago to its first championship since the Michael Jordan-Scottie Pippen era."}
{"game_id": "0021400845", "chunk_id": "0021400845_008", "order": 8, "role": "body", "text": "A similar injury limited Rose to 10 games last season and cut short his long-awaited comeback. He sat out the 2012-13 season recuperating from a torn ACL in his left knee. It's not clear exactly when he will have surgery or how much time he will miss."}
{"game_id": "0021400845", "chunk_id": "0021400845_009", "order": 9, "role": "body", "text": "\"We all were affected by it,\" Pau Gasol said. \"They might have been through this before, but it's the third time it's happened.\""}
{"game_id": "0021400845", "chunk_id": "0021400845_010", "order": 10, "role": "body", "text": "It's an all-too-familiar feeling for Chicago, which dropped into a tie with Cleveland for the Central Division lead. The Bulls had won six of seven, but clearly, there was a hangover from the news about their point guard."}
{"game_id": "0021400845", "chunk_id": "0021400845_011", "order": 11, "role": "body", "text": "Gasol, who came to Chicago hoping to make a run at a championship after winning two with the Lakers, led the Bulls with 25 points and 13 rebounds for his league-leading 38th double-double. He also had four blocks."}
{"game_id": "0021400845", "chunk_id": "0021400845_012", "order": 12, "role": "body", "text": "Jimmy Butler scored 14. Aaron Brooks, starting for Rose, was off target in a 12-point performance. He was 4 of 12 from the field, including 1 of 5 on 3-pointers, and 3 for 8 at the free throw line. The Bulls were 3 of 17 from long range and 15 of 23 at the foul line."}
{"game_id": "0021400845", "chunk_id": "0021400845_013", "order": 13, "role": "body", "text": "Kidd-Gilchrist capped a seven-point spurt with a pair of dunks, making it 85-74 midway through the fourth quarter. Jefferson scored six in an 8-0 run that boosted the lead to 95-78 with 2:25 left."}
{"game_id": "0021400845", "chunk_id": "0021400845_014", "order": 14, "role": "body", "text": "\"We've got a good group of guys,\" Williams said. \"The coaching staff has been great, and my teammates have been great. I enjoy playing with these guys, and they enjoy playing with me. I can tell winning is a priority, and that makes things more significant and fun.\""}
{"game_id": "0021400845", "chunk_id": "0021400845_017", "order": 17, "role": "body", "text": "The Hornets had 17 fast-break points. One more and each player would have received $100 from the fine pool, Clifford said. \"We haven't gotten 18 yet,\" he said. \"Tonight we had 17, so that was the one disappointing thing.\""}
{"game_id": "0021400845", "chunk_id": "0021400845_019", "order": 19, "role": "body", "text": "Hornets: C Bismack Biyombo (bruised right knee) is expected to resume contract drills shortly but is doubtful for the game at Boston on Friday night. He sat out a 10th consecutive game Wednesday. \"From what I saw (Tuesday), maybe trying to get (him back) in Orlando (on Sunday) would be a more realistic goal,\" Clifford said."}
{"game_id": "0021400845", "chunk_id": "0021400845_020", "order": 20, "role": "body", "text": "Bulls: F Taj Gibson and G Kirk Hinrich were back after being sidelined by illness. Gibson missed one game and Hinrich sat out two. ... Coach Tom Thibodeau indicated any signings the Bulls make with Rose out probably won't impact the rotation much. He said the Bulls still have a versatile rotation, which \"helps a lot.\""}
{"game_id": "0021400845", "chunk_id": "0021400845_022", "order": 22, "role": "body", "text": "Hornets: Visit Boston on Friday."}
{"game_id": "0021400845", "chunk_id": "0021400845_023", "order": 23, "role": "closing", "text": "Bulls: Host Minnesota on Friday."}
