{"game_id": "0021701051", "chunk_id": "0021701051_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- Victor Oladipo reverted to his form from the first half of the season Monday night -- driving and defending.\nThe Indiana Pacers looked a lot more like themselves, too.\nOladipo scored 13 of his 20 points in the second half, Myles Turner added 21 points and seven rebounds and the Pacers rallied for a 110-100 victory over the Los Angeles Lakers. The win ended a two-game losing streak, allowing Indiana to keep pace with Cleveland in a tight Central Division race.\n\"It's tough when (the whole team is) going,\" Lakers coach Luke Walton said. \"Someone that has (Oladipo's) skill level and his skill set and his ability to break down a defense makes it challenging.\"\nIt was a needed win for the Pacers. Indiana faces six teams currently in playoff position in its final 11 games and must play seven road games.\nOver the previous few games, the young Pacers looked like they might be wearing down. When they gave up 37 points to the Lakers in the first quarter, it seemed as if it would be more of the same.\nInstead, with Oladipo leading the way, Indiana dug down, defended and finally flipped the game just in time to give the Lakers their third consecutive loss and fifth straight in Indianapolis.\nCoach Nate McMillan couldn't have dreamed up a more convincing finish.\n\"We did a better job defensively getting back and keeping them in front of us,\" he said. \"We were making shots and that helps, too.\"\nThe start certainly didn't follow McMillan's script.\nKyle Kuzma finished with 27 points and eight rebounds, and Brook Lopez had 23 points and eight rebounds for Los Angeles. They were the catalysts in the Lakers' strong start, helping build a 28-19 lead that held for most of the first half.\nEverything changed in the second half when Oladipo took control.\nHe and Darren Collison got Indiana going with back-to-back 3-pointers midway through the third quarter for a 77-70 lead. After Julius Randle put in a layup, Collison answered with a 20-footer, and when the 14-4 flurry ended, Indiana led 85-74 late in the third.\nThe Lakers never seriously challenged after that.\nTIP-INS\nLakers: Kuzma was 3 of 10 on 3s, extending the franchise record for a rookie to 135. ... The Lakers lead the league with 52.7 points in the paint per game but only managed to match the Pacers 46-46 in that category. ... Randle finished with 21 points and nine rebounds. ... Lonzo Ball had four points and eight assists.\nPacers: Backup center Domantas Sabonis missed his third straight game with a sprained left ankle and will miss the Pacers next game as well, coach Nate McMillan said before the game. ... Oladipo extended his streak of consecutive games with a steal to 54, breaking a tie with Ron Harper for No. 8 in league history. ... Thaddeus Young had 18 points, nine rebounds and four assists while Lance Stephenson had 16 points and five rebounds.\nCOLLISON'S BACK\nCollison returned to the starting lineup for the first time since having knee surgery in early February. He wound up with 15 points and eight assists.\n\"It felt good, just getting used to playing with the first unit again\" he said.\nFREE-THROW ADVICE\nThe Lakers were 16 of 23 from the free-throw line, the latest chapter in a season-long struggle.\nOne thing that has helped, Walton said, was meditation. But plenty of people from all walks of life also have chimed in about possible solutions.\n\"There's a lot of people who know how to fix free throws,\" Walton said.\nWhat about shooting under-handed Rick Barry style?\n\"If it works I'd be totally fine with our guys doing that,\" he said.\nUP NEXT\nLakers: Visit New Orleans on Thursday night, the second stop on a five-game road trip.\nPacers: Will try to earn a series split at New Orleans on Wednesday night."}
