{"game_id": "0021700413", "chunk_id": "0021700413_001", "order": 1, "role": "lead", "text": "ATLANTA --  Leading the NBA's worst club by 21 points midway through the fourth quarter, Pistons coach Stan Van Gundy took no chances."}
{"game_id": "0021700413", "chunk_id": "0021700413_003", "order": 3, "role": "body", "text": "\"It's been two weeks of hell,\" Van Gundy said. \"I said, `We're going to make sure we get this one.' \""}
{"game_id": "0021700413", "chunk_id": "0021700413_004", "order": 4, "role": "body", "text": "Andre Drummond had 12 points, 19 rebounds and a career-high nine assists, Tobias Harris added 19 points and Detroit snapped a seven-game slide with a 105-91 victory over the Atlanta Hawks on Thursday night."}
{"game_id": "0021700413", "chunk_id": "0021700413_005", "order": 5, "role": "body", "text": "Avery Bradley finished with 18 points and Langston Galloway scored 17 as Detroit won for the first time since beating Phoenix on Nov. 29."}
{"game_id": "0021700413", "chunk_id": "0021700413_006", "order": 6, "role": "body", "text": "Ersan Ilyasova had 23 points, rookie John Collins scored 15 and Dennis Schroder had 10 assists for Atlanta, which dropped to 6-22 and has lost three in a row."}
{"game_id": "0021700413", "chunk_id": "0021700413_007", "order": 7, "role": "body", "text": "The Pistons never trailed after Galloway's 3-pointer early in the second quarter. They led by 13 at halftime when Galloway hit a 20-footer in the closing seconds and went up by 22 on Reggie Bullock's floater midway through the third."}
{"game_id": "0021700413", "chunk_id": "0021700413_008", "order": 8, "role": "body", "text": "Van Gundy knew Drummond needed just one assist for his first career triple-double, but said he didn't want to risk an injury to the 6-foot-11, 279-pound center and pulled him out with 1:59 remaining. Drummond was fine with the decision."}
{"game_id": "0021700413", "chunk_id": "0021700413_009", "order": 9, "role": "body", "text": "\"I tried to get one more, but obviously the flow of the game didn't go that way,\" Drummond said. \"But a career night for me, so I'm pretty excited about that.\""}
{"game_id": "0021700413", "chunk_id": "0021700413_010", "order": 10, "role": "body", "text": "Detroit recovered from a 103-84 home loss Tuesday to Denver, a performance Van Gundy called one of the worst \"I've ever had to coach\" in over 850 career games."}
{"game_id": "0021700413", "chunk_id": "0021700413_011", "order": 11, "role": "body", "text": "Bullock was promoted to the starting lineup after Sunday's 10-point home loss to Boston. He finished with 10 points in 24 minutes against Atlanta."}
{"game_id": "0021700413", "chunk_id": "0021700413_012", "order": 12, "role": "body", "text": "Collins returned after missing the last six games with a sprained left shoulder. The first-round draft pick from Wake Forest is one of the few reasons for Hawks fans to cheer."}
{"game_id": "0021700413", "chunk_id": "0021700413_013", "order": 13, "role": "body", "text": "\"He brings an athleticism,\" Atlanta coach Mike Budenholzer said. \"He brings a pop. Going to the offensive boards, the ability to put pressure on the rim, the pick-and-roll game and defensively, for his first game back, I'm really pleased with how he played.\""}
{"game_id": "0021700413", "chunk_id": "0021700413_015", "order": 15, "role": "body", "text": "Pistons: F Stanley Johnson, demoted in favor of Bullock, had two points and two rebounds in 15 minutes. He played 8 minutes in the first half, but returned in the fourth in Bullock's spot as Van Gundy decided to play his starters. ... Drummond had 16 points, 20 rebounds and seven assists in a 111-104 win over Atlanta on Nov. 10. .... After breaking his nose against the Nuggets, F Anthony Tolliver wore a protective mask and had six points and two rebounds in 15 minutes."}
{"game_id": "0021700413", "chunk_id": "0021700413_016", "order": 16, "role": "body", "text": "Hawks: With a left tibia stress fracture sidelining C Dewayne Dedmond for a seventh straight game, Miles Plumlee went scoreless, took no shots and had four boards. The sixth-year veteran has averaged just 3.6 points and 3.3 rebounds in nine games. Acquired in the offseason trade that sent Dwight Howard to Charlotte, Plumlee showed up to training camp out of shape, strained his right quadriceps before the opener and didn't make his Atlanta debut until the end of a blowout loss to Toronto on Nov. 25. .. Rookie Tyler Cavanaugh started at center in Tuesday's loss at Cleveland. He didn't get in Thursday's game until midway through the fourth but still finished with nine points in eight minutes."}
{"game_id": "0021700413", "chunk_id": "0021700413_018", "order": 18, "role": "body", "text": "Pistons: Visit Indiana on Friday. Detroit has lost six straight road games in the series."}
{"game_id": "0021700413", "chunk_id": "0021700413_019", "order": 19, "role": "body", "text": "Hawks: Visit Memphis on Friday."}
{"game_id": "0021700413", "chunk_id": "0021700413_021", "order": 21, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
