{"game_id": "0021400423", "chunk_id": "0021400423_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  The Charlotte Hornets may have found the formula for success -turning up the defensive pressure. It worked against the Milwaukee Bucks on Tuesday night and led to their fourth straight victory."}
{"game_id": "0021400423", "chunk_id": "0021400423_002", "order": 2, "role": "body", "text": "Kemba Walker scored 27 points and Gerald Henderson added 16 as Charlotte took advantage of 20 turnovers to hold off the Bucks 108-101, extending the Hornets winning streak to a season-high of four games."}
{"game_id": "0021400423", "chunk_id": "0021400423_003", "order": 3, "role": "body", "text": "\"We just turned the ball over too many times and then we didn't get stops,\" said Bucks coach Jason Kidd. \"That was pretty much the game.\""}
{"game_id": "0021400423", "chunk_id": "0021400423_004", "order": 4, "role": "body", "text": "Brandon Knight had a season-high 34 points for the Bucks, who were prevented from matching last season's victory total of 15, the lowest in franchise history."}
{"game_id": "0021400423", "chunk_id": "0021400423_005", "order": 5, "role": "body", "text": "The Hornets won despite being outscored 25-2 in points off the fast break and being outshot 47.6 percent to 43.9 percent from the field."}
{"game_id": "0021400423", "chunk_id": "0021400423_006", "order": 6, "role": "body", "text": "\"They beat us in transition. But, in the fourth quarter, when they needed to be, our defense was good,\" said Hornets coach Steve Clifford."}
{"game_id": "0021400423", "chunk_id": "0021400423_007", "order": 7, "role": "body", "text": "Charlotte outscored the Bucks 34-24 in the third quarter -- making 11 of 17 shots  -- to take an 88-80 lead into the final period. The Hornets extended the lead to 96-84 as the Bucks went 3:39 without scoring."}
{"game_id": "0021400423", "chunk_id": "0021400423_008", "order": 8, "role": "body", "text": "Michael Kidd-Gilchrist scored on a put back to put the Hornets up 102-91 with 2:46 left, but Knight scored Milwaukee's next eight points, pulling the Bucks within 103-99 on a 3-pointer with 25.9 remaining."}
{"game_id": "0021400423", "chunk_id": "0021400423_009", "order": 9, "role": "body", "text": "The Hornets held on with five free throws down the stretch as the Bucks fell to 4-12 when allowing 100 or more points."}
{"game_id": "0021400423", "chunk_id": "0021400423_010", "order": 10, "role": "body", "text": "\"We just got stops,\" said Walker, who has scored 20 or more points in each of his last four games against the Bucks."}
{"game_id": "0021400423", "chunk_id": "0021400423_011", "order": 11, "role": "body", "text": "\"It was a point where both teams really didn't score. We continued to get stops and we stuck with the game and at one point we were able to score and continue to get stops.\""}
{"game_id": "0021400423", "chunk_id": "0021400423_012", "order": 12, "role": "body", "text": "In addition to the turnovers, the Hornets also attempted a season-high 36 free throws, making 28, while the Bucks were 15 of 20 from the line."}
{"game_id": "0021400423", "chunk_id": "0021400423_013", "order": 13, "role": "body", "text": "\"We're making progress and, in this league, that's what good teams do,\" Clifford said. \"The last three or four games we've been moving the ball well.\""}
{"game_id": "0021400423", "chunk_id": "0021400423_014", "order": 14, "role": "body", "text": "The Bucks opened a 49-43 lead with 4:57 left in the half on a jumper by Jerryd Bayless, but Walker scored nine consecutive points, capping the run with a 3-pointer to put the Hornets up 52-49. Knight scored the final five points of the half to put Milwaukee back in front 56-54."}
{"game_id": "0021400423", "chunk_id": "0021400423_015", "order": 15, "role": "body", "text": "The Bucks, coming off a split of a four-game West Coast road trip, held a players-only meeting for 50 minutes after the game."}
{"game_id": "0021400423", "chunk_id": "0021400423_016", "order": 16, "role": "body", "text": "\"Just trying to figure things out,\" said Bucks forward Khris Middleton. \"Nothing drastic. No fights, no arguments. Just in there talking trying to get better.\""}
{"game_id": "0021400423", "chunk_id": "0021400423_019", "order": 19, "role": "body", "text": "Hornets: With Tuesday night's win, Charlotte has beaten Milwaukee seven consecutive times."}
{"game_id": "0021400423", "chunk_id": "0021400423_020", "order": 20, "role": "body", "text": "Bucks: Injured rookie forward Jabari Parker, the No. 2 overall pick in the NBA draft, said no date has been set for surgery on his injured left knee. \"There's no timetable because I have to get the swelling off before I get surgery,\" Parker said prior to Tuesday night's game. Parker, mentioned as a Rookie of the Year candidate prior to his injury, started the first 25 games, averaging  12.3 points and 5.5 rebounds in 29.5 minutes per game."}
{"game_id": "0021400423", "chunk_id": "0021400423_022", "order": 22, "role": "body", "text": "Hornets: Friday night at Oklahoma City"}
{"game_id": "0021400423", "chunk_id": "0021400423_023", "order": 23, "role": "body", "text": "Bucks: Friday night at Atlanta"}
{"game_id": "0021400423", "chunk_id": "0021400423_025", "order": 25, "role": "body", "text": "Dozens of demonstrators marched around the BMO Harris Bradley Center prior to the game to protest the death of Dontre Hamilton, who was fatally shot by a Milwaukee police officer in April. Protests have escalated following the decision Monday by the Milwaukee County district attorney not to charge the former police officer involved in the shooting.  Law enforcement personnel shielded arena entrances, allowing ticket holders to enter. The organized demonstration consisted mostly of chants directed at police. There were no reported physical confrontations and protesters dispersed just prior to game time."}
{"game_id": "0021400423", "chunk_id": "0021400423_027", "order": 27, "role": "closing", "text": "Bucks forward Ersan Ilyasova returned after missing nine games and wore a plastic mask to protect his broken nose, suffered Dec. 2 at Cleveland. Ilyasova played 16 minutes, scoring four points on 2-of-8 shooting and had four rebounds."}
