{"game_id": "0021700710", "chunk_id": "0021700710_001", "order": 1, "role": "lead", "text": "MIAMI --  Forgetting De'Aaron Fox is a mistake that Miami will remember."}
{"game_id": "0021700710", "chunk_id": "0021700710_002", "order": 2, "role": "body", "text": "Fox's rebound dunk with 3 seconds left capped a huge closing rally by the Sacramento Kings, who erased a 12-point, fourth-quarter deficit to stun the Heat 89-88 on Thursday night."}
{"game_id": "0021700710", "chunk_id": "0021700710_003", "order": 3, "role": "body", "text": "It was Sacramento's first win at Miami since 2001, and the Kings closed it with a 17-4 run in the final 5:46."}
{"game_id": "0021700710", "chunk_id": "0021700710_004", "order": 4, "role": "body", "text": "\"I just went to crash the glass and I just showed my athleticism,\" Fox said."}
{"game_id": "0021700710", "chunk_id": "0021700710_005", "order": 5, "role": "body", "text": "Buddy Hield scored 24 points for Sacramento, which got 14 from Fox, 11 from Bogdan Bogdanovic and 10 from Zach Randolph. The Kings improved to 4-26 all-time at Miami."}
{"game_id": "0021700710", "chunk_id": "0021700710_006", "order": 6, "role": "body", "text": "\"Not a pretty game, but we played really hard,\" Kings coach Dave Joerger said. \"Both teams kind of had to grind it out so it's a good win for us at a place we don't get a lot of wins.\""}
{"game_id": "0021700710", "chunk_id": "0021700710_007", "order": 7, "role": "body", "text": "Goran Dragic scored 23 points for Miami, and he was the only Heat starter to finish in double figures. Wayne Ellington had 20 and Justise Winslow added 11 for the Heat -- who used an 11-0 run to take a 12-point lead midway through the fourth."}
{"game_id": "0021700710", "chunk_id": "0021700710_008", "order": 8, "role": "body", "text": "Miami gave the game away in the fourth, and fell apart in the final moments. Hassan Whiteside fouled out with 21 seconds left while trying to set a screen for Dragic, and the Kings -- down one -- decided to run the clock down as much as they could on the ensuing possession. Bogdanovic missed a jumper, and all the Heat had to do was secure one last rebound."}
{"game_id": "0021700710", "chunk_id": "0021700710_010", "order": 10, "role": "body", "text": "Fox wasn't boxed out by anyone, so he had an unimpeded lane to the rim. There were three Heat players nearby -- Dragic jumped for the rebound, Bam Adebayo and James Johnson never left the floor, and even if they had it probably wouldn't have mattered since Fox timed his leap perfectly to catch and slam home what became the game-winner."}
{"game_id": "0021700710", "chunk_id": "0021700710_011", "order": 11, "role": "body", "text": "\"We didn't get a blockout and we didn't jump,\" Heat coach Erik Spoelstra said. \"That probably summed up the evening as much as anything. One guy went for it and the rest of us spectated. That's not how you win NBA games.\""}
{"game_id": "0021700710", "chunk_id": "0021700710_012", "order": 12, "role": "body", "text": "Miami's Josh Richardson missed a wild jumper as time expired, the capper to his 2-for-13 shooting night. His teammates weren't much better: The Heat shot 38 percent, compared with 47 percent by the Kings."}
{"game_id": "0021700710", "chunk_id": "0021700710_013", "order": 13, "role": "body", "text": "\"Couldn't get stops,\" Dragic lamented."}
{"game_id": "0021700710", "chunk_id": "0021700710_014", "order": 14, "role": "body", "text": "Kings guard George Hill did not play. He's been prominent in trade rumors in recent days, with reports suggesting that Sacramento and Cleveland are discussing a deal that could send the veteran to the Cavaliers."}
{"game_id": "0021700710", "chunk_id": "0021700710_016", "order": 16, "role": "body", "text": "Kings: The last time the Kings won in Miami, Vlade Divac started for Sacramento -- and he turns 50 next week. ... Hield has reached double digits in 10 of his last 11 games. ... Sacramento isn't leaving Miami until Friday, taking advantage of having two full days off before it plays again."}
{"game_id": "0021700710", "chunk_id": "0021700710_017", "order": 17, "role": "body", "text": "Heat: Dragic was 8 for 14 from the field; the rest of Miami's starters were 7 for 31. ... The Heat had won their last four at home. ... Udonis Haslem was not with the team for personal reasons."}
{"game_id": "0021700710", "chunk_id": "0021700710_019", "order": 19, "role": "body", "text": "Joerger, asked pregame of what he's seen on tape of the Heat: \"Haven't watched them, to be honest with you.\""}
{"game_id": "0021700710", "chunk_id": "0021700710_021", "order": 21, "role": "body", "text": "The Heat have great respect for Sacramento's Vince Carter, the NBA's oldest active player. \"He has a class about him, and is somebody that's been able to reinvent himself many times over,\" Spoelstra said. \"To be a superstar, to be a starting role player, to be a bench role player, to be a bench mentor ... it takes a unique kind of guy with character to be able to do that.\" Carter has taken the floor at Miami 33 times, but got no minutes Thursday."}
{"game_id": "0021700710", "chunk_id": "0021700710_023", "order": 23, "role": "body", "text": "Miami broke out its \"Vice\" uniforms, trimmed in fuchsia and blue and paying homage to the city in the 1980s. \"I think they're the hottest uniforms in NBA history. I love them,\" Dragic said. The uniforms will be worn 14 more times."}
{"game_id": "0021700710", "chunk_id": "0021700710_025", "order": 25, "role": "body", "text": "Kings: Visit San Antonio on Sunday."}
{"game_id": "0021700710", "chunk_id": "0021700710_026", "order": 26, "role": "body", "text": "Heat: Host Charlotte on Saturday."}
{"game_id": "0021700710", "chunk_id": "0021700710_028", "order": 28, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
