{"game_id": "0021400025", "chunk_id": "0021400025_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- Rudy Gay knew he could play better and turned the trick Friday night, treating his teammates and the fans to a superb all-around performance.\nGay scored 40 points -- one off his career high -including a pair of key 3-pointers, and the Sacramento Kings surprised the Portland Trail Blazers 103-94 on Friday night.\n\"I haven't had a good game this preseason and season, and I just wanted to be aggressive,\" Gay said. \"I calmed down and tried to make plays better.\"\nDeMarcus Cousins added 17 points and nine rebounds for the Kings, who rebounded from a sloppy season-opening loss to the Golden State Warriors on Wednesday night.\nDarren Collison added 17 points, eight assists and eight rebounds. Omri Casspi had 10 points.\n\"I was waiting for a game like that from Rudy,\" Kings coach Michael Malone said. \"To step up the way he did, getting to the foul line, was great.\"\nLaMarcus Aldridge scored 22 points to lead the Trail Blazers, who were coming off a season-opening victory over the Oklahoma City Thunder. Damian Lillard added 20 points, while Wesley Matthews had 16 and Chris Kaman 12.\nAn intentional foul call went against Nicolas Batum, putting Gay on the line. He converted both free throws and then added a 3-pointer on the ensuing possession to spark a Kings 13-0 run midway through the final period.\n\"That was a big call,\" Gay said. \"The biggest part of that play was that I could jump out for the 3 because I had help.\"\nSteve Blake and Matthews hit consecutive 3-pointers to start the fourth quarter and give the Trail Blazers a 77-73 lead.\nThe Kings opened an 11-point lead midway through the third quarter, riding Gay's torrid shooting. He sank his first five shots of the period, including the 3-pointer that gave the Kings their double-digit lead.\n\"Sacramento did a great job of doing a lot of the dirty work,\" Portland coach Terry Stotts said. \"They got the loose balls and the rebounds.\"\nThe Kings also committed 10 turnovers, 17 fewer than they gave up against the Warriors.\n\"It's amazing what happens when you don't beat yourself,\" Malone said. \"Our ball movement and execution was much better.\"\nPortland eventually played its way back and tied the game at 71 entering the final quarter.\nGay, 5-for-15 against the Warriors on Wednesday, also made his first five shots to help the Kings open an early lead.\nThe game was tied at 48 at halftime.\nPIVOTAL MOMENT\nThe Trail Blazers were making a run in the final five minutes of the contest. With 3:18 remaining to play, Gay came up with a steal that led to an alley-oop pass for Ben McLemore to slam home, putting the exclamation point on the win.\nSTATS OF THE NIGHT\nDuring the Kings' 13-0 run in the fourth quarter, the Trail Blazers went nearly seven minutes without scoring. The Kings turned 11 Portland turnovers into 21 points while the Trail Blazers managed 12 points on 10 Sacramento turnovers.\nTIP-INS\nTrail Blazers: All five Portland starters averaged double figures against the Warriors last season. Portland had won the first meeting in each of the previous seven seasons against the Kings. Matthews missed his first five 3-point attempts after hitting five of nine against the Thunder.\nKings: Have lost seven straight against the Clippers in Los Angeles. Cousins had 53 double-doubles last season and opened the season with another one. He got into foul trouble early in the third quarter and did not get a rebound in about five minutes. He grabbed five in the final period, leaving him one rebound short of another double-double.\nWHAT'S NEXT\nTrail Blazers: Host the Golden State Warriors on Sunday.\nKings: Travel to the Los Angeles Clippers on Sunday."}
