{"game_id": "0021400587", "chunk_id": "0021400587_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  The Detroit Pistons keep winning and Brandon Jennings' hot hand has been a big part."}
{"game_id": "0021400587", "chunk_id": "0021400587_002", "order": 2, "role": "body", "text": "Detroit has picked up victories in 10 of their last 12 games and Jennings has averaged 21.6 points in that run. Friday night, he scored a season-high 37 points to lead Detroit to a 98-96 road win against the struggling Indiana Pacers."}
{"game_id": "0021400587", "chunk_id": "0021400587_003", "order": 3, "role": "body", "text": "\"If I see couple shots falling, everyone knows I'm going to keep shooting,\" Jennings said. \"I was able to get into a rhythm and also find guys, so everything kind of worked out.\""}
{"game_id": "0021400587", "chunk_id": "0021400587_004", "order": 4, "role": "body", "text": "Jennings made eight 3-pointers to tie his career high, but it was his missed layup that set up the win."}
{"game_id": "0021400587", "chunk_id": "0021400587_005", "order": 5, "role": "body", "text": "With 23.9 seconds left and the score tied, Detroit (15-25) called a timeout. Jennings took the inbounds pass and held for the last shot. He drove to the bucket but missed. Andre Drummond was there for the tip-in with 0.3 seconds to go."}
{"game_id": "0021400587", "chunk_id": "0021400587_006", "order": 6, "role": "body", "text": "\"We set it up for Brandon to get to his left hand and for me to really set myself up for an opportunity to tip the ball,\" Drummond said. \"Brandon did a good job of dragging Roy Hibbert out to try to block the shot. (Jennings) told me he was going to shoot it high so I put myself in the right position to get my hands on it.\""}
{"game_id": "0021400587", "chunk_id": "0021400587_007", "order": 7, "role": "body", "text": "Drummond finished with a 16-point, 16-rebound night."}
{"game_id": "0021400587", "chunk_id": "0021400587_008", "order": 8, "role": "body", "text": "The 6-foot-11 center had struggled of late scoring just 7.2 points in the last five games, which led to a talk with Pistons' coach Stan Van Gundy."}
{"game_id": "0021400587", "chunk_id": "0021400587_009", "order": 9, "role": "body", "text": "\"I don't think my talk had anything to do with it,\" Van Gundy said. \"We talked, we showed (him) some things (on film). I had nothing to do with it.\""}
{"game_id": "0021400587", "chunk_id": "0021400587_010", "order": 10, "role": "body", "text": "With Drummond and Greg Monroe, who finished with 11 points, finding success in the paint, Jennings took advantage of shooting opportunities. That was especially true in the pivotal third quarter, when he scored 19 of Detroit's 30 points to give the Pistons a 79-76 lead heading to the final period."}
{"game_id": "0021400587", "chunk_id": "0021400587_011", "order": 11, "role": "body", "text": "With just under six minutes to play in the third, Drummond converted the old-fashion 3-point play to start a 10-0 run that drew Detroit even with Indiana at 68. Jennings scored the other seven."}
{"game_id": "0021400587", "chunk_id": "0021400587_012", "order": 12, "role": "body", "text": "It was the second consecutive game that the Pacers' opposing point guard had season-best games. On Tuesday, Minnesota's Mo Williams scored 52."}
{"game_id": "0021400587", "chunk_id": "0021400587_013", "order": 13, "role": "body", "text": "\"We played against some tough point guards,\" Hibbert said. \"Me, myself, has to do a better job of containing the guards and not letting a guy like Jennings get off.\""}
{"game_id": "0021400587", "chunk_id": "0021400587_014", "order": 14, "role": "body", "text": "The center led Indiana (15-26) with 14 points and had the opportunity to score the go-ahead bucket, but was called for the offensive foul to set up Detroit to have the ball with the shot clock turned off."}
{"game_id": "0021400587", "chunk_id": "0021400587_015", "order": 15, "role": "body", "text": "\"Games have been like that for us lately, but we're learning how to close them out,\" Jennings said. \"We're learning how to get stops at the end and we're learning how to convert.\""}
{"game_id": "0021400587", "chunk_id": "0021400587_017", "order": 17, "role": "body", "text": "Pistons: Has won seven straight road games to tie the franchise record. ...They have won consecutive games over the Pacers for the first time since they won eight straight from January 2007-December 2008."}
{"game_id": "0021400587", "chunk_id": "0021400587_018", "order": 18, "role": "body", "text": "Pacers: Despite losing four of five, bench play continues to be a positive. With 50 points, the Pacers reserves have scored 30 or more points in 36 of the teams 41 games."}
{"game_id": "0021400587", "chunk_id": "0021400587_020", "order": 20, "role": "body", "text": "Pistons host Philadelphia on Saturday"}
{"game_id": "0021400587", "chunk_id": "0021400587_021", "order": 21, "role": "closing", "text": "Pacers visit Charlotte on Saturday"}
