{"game_id": "0021400297", "chunk_id": "0021400297_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  The Detroit Pistons hadn't won since beating the Oklahoma City Thunder last month on the road."}
{"game_id": "0021400297", "chunk_id": "0021400297_002", "order": 2, "role": "body", "text": "For much of Sunday night, it looked like they were going to do it again."}
{"game_id": "0021400297", "chunk_id": "0021400297_003", "order": 3, "role": "body", "text": "Josh Smith, though, missed a potential winning 3-pointer with 1.1 seconds to play, and the Thunder held on for a 96-94 victory."}
{"game_id": "0021400297", "chunk_id": "0021400297_004", "order": 4, "role": "body", "text": "\"Obviously, I was going for the win, or I wouldn't have shot a 3,\" Smith said. \"I had a great look, but it just didn't go down.\""}
{"game_id": "0021400297", "chunk_id": "0021400297_005", "order": 5, "role": "body", "text": "The Pistons have lost 12 straight, two short of the franchise record. Detroit's last win came on Nov. 14, a game that both Kevin Durant and Russell Westbrook missed due to injury."}
{"game_id": "0021400297", "chunk_id": "0021400297_006", "order": 6, "role": "body", "text": "This time, Westbrook and Durant were healthy, and combined for 50 points, 15 rebounds and 11 assists."}
{"game_id": "0021400297", "chunk_id": "0021400297_007", "order": 7, "role": "body", "text": "Serge Ibaka added 13 points, 13 rebounds and four blocks for the Thunder, while Kentavious Caldwell-Pope led Detroit with 19 points."}
{"game_id": "0021400297", "chunk_id": "0021400297_008", "order": 8, "role": "body", "text": "\"I thought Serge was tremendous,\" Durant said. \"He was chasing down all of those rebounds and scoring when we were kicking them out to him. We had possessions where we had three great shots and three offensive rebounds. We're doing a good job of rebounding the ball.\""}
{"game_id": "0021400297", "chunk_id": "0021400297_009", "order": 9, "role": "body", "text": "Westbrook had a chance to clinch the game with 10 seconds to play, but missed a jumper, and Brandon Jennings and Smith led a fast break."}
{"game_id": "0021400297", "chunk_id": "0021400297_010", "order": 10, "role": "body", "text": "Jennings drove the ball into the lane, but was facing Ibaka and chose to dish to Smith, who had stopped outside the arc. Despite only hitting 26.4 percent of his 3-pointers in his 98 games as a Piston, he let fly, only to see the ball bounce off the rim and out of bounds."}
{"game_id": "0021400297", "chunk_id": "0021400297_011", "order": 11, "role": "body", "text": "\"We only needed a 2,\" Van Gundy said when asked about Smith's decision not to keep moving into the lane. \"So go to the basket or move in. You'd like to move it into a range where he shoots a higher percentage.\""}
{"game_id": "0021400297", "chunk_id": "0021400297_012", "order": 12, "role": "body", "text": "The Thunder led 77-75 going into the fourth, then scored the first seven points of the fourth, including another four-shot possession. Oklahoma City ended up pulling down 86 percent of Detroit's missed shots in the second half, and 45 percent of its own."}
{"game_id": "0021400297", "chunk_id": "0021400297_013", "order": 13, "role": "body", "text": "\"The first half, we kind of slowed things down by putting them on the free throw line, and we let them get into a rhythm,\" Durant said. \"In the second half, we were physical without fouling. That's a balance you have to have, and we did a better job of it.\""}
{"game_id": "0021400297", "chunk_id": "0021400297_014", "order": 14, "role": "body", "text": "The Pistons pulled back within 93-92 on Kyle Singler's 3-pointer with 2:18 to play, but Durant answered with his first 3-pointer of the game."}
{"game_id": "0021400297", "chunk_id": "0021400297_015", "order": 15, "role": "body", "text": "Andre Drummond's dunk made it a two-point game with 31 seconds left, but the Pistons couldn't take advantage of Westbrook's miss."}
{"game_id": "0021400297", "chunk_id": "0021400297_016", "order": 16, "role": "body", "text": "Detroit led 55-48 at the half, bouncing back from Saturday's loss to the 76ers, when it went 0 for 11 from the floor in overtime."}
{"game_id": "0021400297", "chunk_id": "0021400297_017", "order": 17, "role": "body", "text": "Things changed drastically in the third quarter, as Oklahoma City began to dominate at the rim. The Thunder had one five-shot possession that ended with Andre Roberson's tip-in, and took a 70-69 lead on Westbrook's 3-pointer late in the quarter."}
{"game_id": "0021400297", "chunk_id": "0021400297_019", "order": 19, "role": "body", "text": "THUNDER: Forward Mitch McGary was called up before the game from the Thunder's D-League affiliate in Oklahoma City, but was inactive. McGary, who has yet to make his NBA debut due to injuries, is still enormously popular in Detroit because of his college career at Michigan, where he helped lead the Wolverines to the 2013 NCAA title game."}
{"game_id": "0021400297", "chunk_id": "0021400297_020", "order": 20, "role": "body", "text": "PISTONS: With Drummond and Smith both in foul trouble in the first half, Stan Van Gundy gave Jonas Jerebko 13 minutes before the intermission, a change to the normal rotation. In recent games, Jerebko has gotten most of his limited playing time in the second half.  . The Pistons had 14-game losing streaks in both 1979-80 and 1993-94."}
{"game_id": "0021400297", "chunk_id": "0021400297_022", "order": 22, "role": "body", "text": "THUNDER: Host Milwaukee on Tuesday."}
{"game_id": "0021400297", "chunk_id": "0021400297_023", "order": 23, "role": "closing", "text": "PISTONS: Host Portland on Tuesday."}
