{"game_id": "0021400285", "chunk_id": "0021400285_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Kendall Marshall and the rest of the Milwaukee Bucks reserves were too much for the Miami Heat"}
{"game_id": "0021400285", "chunk_id": "0021400285_002", "order": 2, "role": "body", "text": "Marshall came off the bench and tied his career-high with 20 points on 7 of 8 from the floor, including three big 3-pointers in the fourth quarter, as the Milwaukee Bucks beat the Miami Heat 109-85 on Friday night."}
{"game_id": "0021400285", "chunk_id": "0021400285_003", "order": 3, "role": "body", "text": "In beating Miami for the second time this season, the Bucks' bench outscored the Heat's bench 60-18, which was led by Khris Middleton's 14 points, Jerryd Bayless' 12 and Jared Dudley's eight."}
{"game_id": "0021400285", "chunk_id": "0021400285_004", "order": 4, "role": "body", "text": "Milwaukee's starters helped out, too, as the team snapped a three-game losing streak. Jabari Parker and Giannis Antetokounmpo each had 14 points and Brandon Knight added 13."}
{"game_id": "0021400285", "chunk_id": "0021400285_005", "order": 5, "role": "body", "text": "\"We played well,\" Marshall said. \"We have to find a way to do that for 48 minutes consistently. That's what the great teams do in this league and that's what we're striving to be.\""}
{"game_id": "0021400285", "chunk_id": "0021400285_006", "order": 6, "role": "body", "text": "Marshall took over for Knight who picked up his fourth foul early in the fourth."}
{"game_id": "0021400285", "chunk_id": "0021400285_007", "order": 7, "role": "body", "text": "\"Again tonight, when Knight gets in trouble, Kendall steps right in and helps us find a way to win,\" Bucks coach Jason Kidd said."}
{"game_id": "0021400285", "chunk_id": "0021400285_008", "order": 8, "role": "body", "text": "Dwyane Wade matched his season-high with 28 points, but scored only seven in the second half. Chris Bosh had 13 of his 21 points in the first two quarters as the Heat opened their five-game road trip with a third straight loss."}
{"game_id": "0021400285", "chunk_id": "0021400285_009", "order": 9, "role": "body", "text": "The Heat was without starters Norris Cole and Luol Deng and reserve Chris Anderson. Milwaukee was missing Ersan Ilysova (broken nose) and John Henson (sprained left foot)."}
{"game_id": "0021400285", "chunk_id": "0021400285_010", "order": 10, "role": "body", "text": "The Bucks started the fourth with a nine-point lead and pushed it to 89-72 on the first of Marshall's 3-pointers with 8:04 left to play. Milwaukee kept up its attack and capitalized on the Heats' inability to score."}
{"game_id": "0021400285", "chunk_id": "0021400285_011", "order": 11, "role": "body", "text": "\"Offensively, we couldn't score the basketball,\" Wade said. \"You got to put the ball in the basket to win games, and we went for a long time without scoring.\""}
{"game_id": "0021400285", "chunk_id": "0021400285_012", "order": 12, "role": "body", "text": "Miami, which shot 44 percent from the field, missed its first five shots and didn't score from the floor until Mario Chalmers' 3-pointer at 7:26. By then, it was too late as Marshall and the Bucks pulled away for the win and their biggest margin of victory this season."}
{"game_id": "0021400285", "chunk_id": "0021400285_013", "order": 13, "role": "body", "text": "\"It really starts on the defensive end,\" Marshall said. \"We were able to get stops and get out in transition. That makes the offense a lot easier.\""}
{"game_id": "0021400285", "chunk_id": "0021400285_014", "order": 14, "role": "body", "text": "Milwaukee had 15 of its 24 fast break points in the first half to Miami's four of six."}
{"game_id": "0021400285", "chunk_id": "0021400285_015", "order": 15, "role": "body", "text": "Heat coach Erik Spolestra said it was too early to make changes in the lineup."}
{"game_id": "0021400285", "chunk_id": "0021400285_016", "order": 16, "role": "body", "text": "\"Right now, I can't say if there will be any adjustments,\" he said. \"I have to get into the film and look at everything. We'll go from there.\""}
{"game_id": "0021400285", "chunk_id": "0021400285_019", "order": 19, "role": "body", "text": "The Heat: Wade has scored at least 20 points for eight consecutive games, his longest such streak since going 13 straight from Feb. 23 to March 17 in 2013. . Forward Josh McRoberts made his second consecutive start this season while Norris Cole missed his second straight."}
{"game_id": "0021400285", "chunk_id": "0021400285_020", "order": 20, "role": "body", "text": "The Bucks: Parker scored 12 points going 6 of 9 from the field in the first half. . Through the third quarter, the Bucks had 22 fast-break points to the Heat's four. . Thinking he might be without all his big men, coach Jason Kidd said, \"We'll play all the point guards, if we have to. We'll play all the Smurfs.\""}
{"game_id": "0021400285", "chunk_id": "0021400285_022", "order": 22, "role": "body", "text": "Miami plays at Memphis on Sunday."}
{"game_id": "0021400285", "chunk_id": "0021400285_023", "order": 23, "role": "body", "text": "Milwaukee is at Dallas on Sunday."}
{"game_id": "0021400285", "chunk_id": "0021400285_025", "order": 25, "role": "body", "text": "Wade provided a gift of $195,000 over three years to Marquette University's Ralph C. Hartman Literacy and Learning Center on Friday afternoon. The gift through his Wade's World Foundation helps launch the Dwyane Wade Live to Dream summer reading program in order to shrink the area's literacy gap among inner-city children. Wade attended Marquette from 2000 to 2003."}
{"game_id": "0021400285", "chunk_id": "0021400285_027", "order": 27, "role": "closing", "text": "Milwaukee grabbed 45 rebounds to Miami's 20, the fewest by any NBA team this season, and held the Heat to three offensive boards, an opponent season low."}
