{"game_id": "0021300527", "chunk_id": "0021300527_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  The last time Nicolas Batum had a triple-double, it came because of a casually tossed buzzer-beating 3-pointer in a rout of San Antonio earlier this season. The Trail Blazers forward was embarrassed and said he never meant to disrespect the Spurs, so it didn't count."}
{"game_id": "0021300527", "chunk_id": "0021300527_003", "order": 3, "role": "body", "text": "Batum had 14 points, 10 rebounds and a career-high 14 assists for his fourth career triple-double in Portland's 110-94 victory over the Orlando Magic on Wednesday night."}
{"game_id": "0021300527", "chunk_id": "0021300527_004", "order": 4, "role": "body", "text": "And he did it with a fractured finger."}
{"game_id": "0021300527", "chunk_id": "0021300527_005", "order": 5, "role": "body", "text": "\"I've said it many times about Nic -- he's very versatile and he does a lot of things,\" Blazers coach Terry Stotts said. \"When he stays aggressive, good things happen.\""}
{"game_id": "0021300527", "chunk_id": "0021300527_006", "order": 6, "role": "body", "text": "LaMarcus Aldridge kept Portland in it despite a sluggish start and finished with 36 points and nine rebounds. The Blazers, who came in having lost four of their last six, avoided a season-high three-game losing streak."}
{"game_id": "0021300527", "chunk_id": "0021300527_007", "order": 7, "role": "body", "text": "After struggling to pull ahead in the third quarter, Mo Williams hit a 3-pointer and Thomas Robinson made a layup to give the Blazers 90-82 with just over six minutes left."}
{"game_id": "0021300527", "chunk_id": "0021300527_008", "order": 8, "role": "body", "text": "Aldridge made consecutive jumpers, Damian Lillard added a 3-pointer and Portland took a 97-87 lead. Batum extended it with a 19-foot-jumper."}
{"game_id": "0021300527", "chunk_id": "0021300527_009", "order": 9, "role": "body", "text": "Batum got his 10th rebound with less than a minute left and many in the crowd gave him a standing ovation. His first triple-double this season came in a 115-105 victory over San Antonio on Nov. 2 -- but that was the one he doesn't count."}
{"game_id": "0021300527", "chunk_id": "0021300527_010", "order": 10, "role": "body", "text": "\"I have to do a lot of things on the court especially on offense and defense to do my job,\" he said. \"I know my job. I know my role.\""}
{"game_id": "0021300527", "chunk_id": "0021300527_011", "order": 11, "role": "body", "text": "Batum sustained an avulsion fracture of his left middle finger, meaning a fragment pulled away from the bone, in a loss to Philadelphia on Saturday night. He has been playing with a splint."}
{"game_id": "0021300527", "chunk_id": "0021300527_012", "order": 12, "role": "body", "text": "Portland was coming off a 123-119 loss at Sacramento on Tuesday night. Lillard had a career-high 41 points in the defeat, but was held to 11 against the Magic."}
{"game_id": "0021300527", "chunk_id": "0021300527_013", "order": 13, "role": "body", "text": "\"I was (tired), just a little bit,\" Lillard said. \"But Nico was making a lot of the plays, so that's what was working for us.\""}
{"game_id": "0021300527", "chunk_id": "0021300527_014", "order": 14, "role": "body", "text": "Arron Afflalo had 22 points for the Magic, who lost their fifth straight. Orlando was coming off a 101-81 loss at the Los Angeles Clippers on Monday night to open a five-game road trip."}
{"game_id": "0021300527", "chunk_id": "0021300527_015", "order": 15, "role": "body", "text": "\"I thought our intensity was good in the first half,\" Afflalo said. \"We just got off course in the second half.\""}
{"game_id": "0021300527", "chunk_id": "0021300527_016", "order": 16, "role": "body", "text": "Orlando was without 7-foot center Nikola Vucevic, who sustained a concussion in the loss to the Clippers and is listed as day-to-day. The Magic shifted their lineup to make room for rookie Victor Oladipo, who made his 17th start of the season to the delight of a big contingent of Indiana fans who were at the game."}
{"game_id": "0021300527", "chunk_id": "0021300527_017", "order": 17, "role": "body", "text": "Portland led by as many as eight points early, but the Magic closed the gap and the score was knotted at 24 going into the second quarter."}
{"game_id": "0021300527", "chunk_id": "0021300527_018", "order": 18, "role": "body", "text": "Afflalo hit consecutive 3-pointers to cap a 16-2 run and the Magic took a 46-34 lead. Portland answered with an 11-3 run to pull within 49-45, but Afflalo's 18-foot jumper gave the Magic a 51-45 lead at the break."}
{"game_id": "0021300527", "chunk_id": "0021300527_019", "order": 19, "role": "body", "text": "Stotts addressed the Blazers sternly during halftime."}
{"game_id": "0021300527", "chunk_id": "0021300527_020", "order": 20, "role": "body", "text": "\"It was the first time I've seen that much emotion from him,\" said guard Wesley Matthews, who finished with 17 points. \"I can't repeat any of it, and it was one of those things where he almost didn't even have to do it, but it was good that he did. We thrived off that.\""}
{"game_id": "0021300527", "chunk_id": "0021300527_021", "order": 21, "role": "body", "text": "Aldridge led all scorers with 21 points in the first half, and his layup and free throw evened it at 53 early in the third quarter. But the Blazers couldn't pull in front and the Magic answered by scoring the next eight points."}
{"game_id": "0021300527", "chunk_id": "0021300527_022", "order": 22, "role": "body", "text": "Aldridge hit a jumper from the top of the key to narrow it to 66-63 before Lillard hit a 3-pointer to tie it for the Blazers again with 2:40 left in the third quarter."}
{"game_id": "0021300527", "chunk_id": "0021300527_023", "order": 23, "role": "body", "text": "Again, the Blazers couldn't get ahead until Matthews' basket made it 76-75 with 10:45 left."}
{"game_id": "0021300527", "chunk_id": "0021300527_024", "order": 24, "role": "body", "text": "\"We fought the entire game,\" Orlando coach Jacque Vaughn said. \"We're short-handed and guys really pulled for each other. We contained the 3-point shooting in the first three quarters and they end up making 3s in the fourth. You give them a lot of credit. That's a good team.\""}
{"game_id": "0021300527", "chunk_id": "0021300527_025", "order": 25, "role": "body", "text": "Robinson, who had only been played sparingly lately, was a spark off the bench for the Blazers in the fourth quarter and finished with six points and three rebounds in 11 minutes."}
{"game_id": "0021300527", "chunk_id": "0021300527_026", "order": 26, "role": "closing", "text": "Game notes The Blazers activated rookie guard C.J. McCollum, who made his NBA debut late in the first quarter. McCollum, the 10th overall pick in last year's draft out of Lehigh, fractured his left foot before the start of the season. He was activated earlier this week, but did not play at Sacramento. He finished with four points and two rebounds in 13 minutes. ... In addition to his triple-double, it was Batum's third consecutive double-double, a career first. ... Batum joins Rajon Rondo, Kevin Durant and LeBron James as the only players with four triple-doubles in the past two seasons."}
