{"game_id": "0021300024", "chunk_id": "0021300024_001", "order": 1, "role": "lead", "text": "BOSTON --  The World Series trophy was in the building. Bill Russell was courtside. And the next Boston Celtics championship seems so very far away."}
{"game_id": "0021300024", "chunk_id": "0021300024_002", "order": 2, "role": "body", "text": "The Celtics opened the season at home on Friday night without Kevin Garnett, Paul Pierce or Doc Rivers -- or Rajon Rondo, for that matter -- and gave away a 22-point second half lead as the Milwaukee Bucks won 105-98 for their first victory of the season."}
{"game_id": "0021300024", "chunk_id": "0021300024_003", "order": 3, "role": "body", "text": "The loss spoiled the home debut of new Celtics coach Brad Stevens and dampened the cheer in the city following the Red Sox victory in the World Series on Wednesday."}
{"game_id": "0021300024", "chunk_id": "0021300024_004", "order": 4, "role": "body", "text": "Zaza Pachulia had 20 points and nine rebounds, making two free throws with 44 seconds left to give the Bucks their first lead since the opening basket. It was the second straight night Milwaukee fell behind early, having spotted the New York Knicks to a 25-point lead before coming back to tie it -- and then lose -- on Wednesday."}
{"game_id": "0021300024", "chunk_id": "0021300024_005", "order": 5, "role": "body", "text": "\"We have to figure this out, getting off to such a bad start,\" said Bucks coach Larry Drew, who earned his first victory after taking over for Jim Boylan. \"I've got to get my finger on it. Two straight games where we just got off to bad starts. It hasn't been great execution. We're just putting too pressure on ourselves defensively.\""}
{"game_id": "0021300024", "chunk_id": "0021300024_006", "order": 6, "role": "body", "text": "Red Sox owners John Henry and Tom Werner took the court before the game with the World Series trophy, and Russell was also courtside a few hours after a statue of him was unveiled near City Hall. The 11-time NBA champion was honored during a first-half timeout, and Stevens made sure his team watched."}
{"game_id": "0021300024", "chunk_id": "0021300024_007", "order": 7, "role": "body", "text": "\"There are things that are bigger than the game, although right now I don't feel good about life,\" the former Butler coach said. \"To honor Bill Russell and to have us be in a huddle while they're honoring Bill Russell wouldn't be right.\""}
{"game_id": "0021300024", "chunk_id": "0021300024_008", "order": 8, "role": "body", "text": "John Henson had 14 points and nine rebounds for the Bucks, who scored the last 10 points of the game. In its opener on Wednesday, Milwaukee rallied to take a lead with 3:13 left before giving up 10 of the last 12 points."}
{"game_id": "0021300024", "chunk_id": "0021300024_009", "order": 9, "role": "body", "text": "\"The second time, same (bad start)\" Pachulia said. \"In New York, we just couldn't finish out the game. We have to fix the mistakes we make.\""}
{"game_id": "0021300024", "chunk_id": "0021300024_010", "order": 10, "role": "body", "text": "Vitor Faverani scored 12 points with 18 rebounds for Boston. Brandon Bass and Jeff Green each had nine rebounds for the Celtics, who scored 20 of the first 26 points in the game and led 72-50 with 19 minutes to play."}
{"game_id": "0021300024", "chunk_id": "0021300024_011", "order": 11, "role": "body", "text": "But Milwaukee scored 11 of the last 14 points in the third quarter and then tied it 93-all with a 20-10 run to start the fourth. After Gerald Wallace hit a 3-pointer to give Boston back the lead, the teams traded free throws and then the Bucks scored the next 10 points."}
{"game_id": "0021300024", "chunk_id": "0021300024_012", "order": 12, "role": "body", "text": "Milwaukee made 10 straight free throws to end the game, including two by Pachulia that made it 99-98."}
{"game_id": "0021300024", "chunk_id": "0021300024_013", "order": 13, "role": "body", "text": "\"We can't play like that. It all starts with me,\" Green said. \"We've got to get it going in the right direction and I take responsibility for that. We can't lose -- not the way we played in the first half.\""}
{"game_id": "0021300024", "chunk_id": "0021300024_014", "order": 14, "role": "body", "text": "It was the first regular-season home game for the Celtics, who traded Pierce and Garnett to the Brooklyn Nets over the summer and sent Rivers to the Los Angeles Clippers. Stevens replaced Rivers, making his NBA debut about a week after his 37th birthday."}
{"game_id": "0021300024", "chunk_id": "0021300024_015", "order": 15, "role": "body", "text": "Injured point guard Rajon Rondo took over Pierce's usual role of speaking to the fans before the opener. Wearing a suit and tie and a fake beard -- a tribute to the Red Sox -- Rondo welcomed the fans before taking a seat on the bench for the rest of the game."}
{"game_id": "0021300024", "chunk_id": "0021300024_016", "order": 16, "role": "body", "text": "Rondo, who is recovering from a torn ACL in his right knee, is not expected to play for at least a month. The Celtics aren't expected to be competitive until he returns, which is OK with the fans who want them to earn a high pick in what is said to be the deepest NBA draft in years."}
{"game_id": "0021300024", "chunk_id": "0021300024_017", "order": 17, "role": "body", "text": "Boston came out and scored 16 of the first 20 points in the game and never led by less than seven points until the fourth-quarter collapse, when they were outscored 34-15. Faverani had 11 rebounds at halftime and Green had 11 points."}
{"game_id": "0021300024", "chunk_id": "0021300024_018", "order": 18, "role": "closing", "text": "Game notes Celtics PG Avery Bradley was evaluated for a concussion on Friday but was cleared to play. ... Bucks PG Brandon Knight, who strained his right hamstring 2 minutes into Milwaukee's opener, did not play. ... Russell sat courtside. ... Boston's Jared Sullinger returned from a one-game suspension after he was charged with domestic violence. The charges were dismissed by a judge."}
