{"game_id": "0021700615", "chunk_id": "0021700615_001", "order": 1, "role": "lead", "text": "TORONTO --  LeBron James isn't enjoying the view lately, watching the end of blowout losses from the Cleveland Cavaliers' bench."}
{"game_id": "0021700615", "chunk_id": "0021700615_002", "order": 2, "role": "body", "text": "James and his struggling Cavaliers absorbed their most-lopsided rout of the season, overwhelmed by the Toronto Raptors 133-99 on Thursday night."}
{"game_id": "0021700615", "chunk_id": "0021700615_003", "order": 3, "role": "body", "text": "The Cavaliers have dropped six of eight dating to a Christmas Day defeat at defending champion Golden State. James scored 26 points in this loss while Isaiah Thomas missed his first 11 shots."}
{"game_id": "0021700615", "chunk_id": "0021700615_004", "order": 4, "role": "body", "text": "\"I don't know where it kind of went wrong or what happened,\" James said. \"We've got to try to pick it back up and find it.\""}
{"game_id": "0021700615", "chunk_id": "0021700615_005", "order": 5, "role": "body", "text": "After losing to Minnesota 127-99 on Monday, the Cavaliers fell by an even bigger margin. Toronto's 133 points were the most by any Cavaliers opponent this season, and marked the third straight game that Cleveland has allowed at least 127."}
{"game_id": "0021700615", "chunk_id": "0021700615_006", "order": 6, "role": "body", "text": "So, what has been James' biggest beef with Cleveland's last two losses?"}
{"game_id": "0021700615", "chunk_id": "0021700615_007", "order": 7, "role": "body", "text": "\"That I haven't played in the fourth quarter,\" he said, adding his team is getting \"tore up.\""}
{"game_id": "0021700615", "chunk_id": "0021700615_008", "order": 8, "role": "body", "text": "Kevin Love, who scored 10 points, said he's confident the Cavs can turn it around in time to reach the finals for a fourth straight season."}
{"game_id": "0021700615", "chunk_id": "0021700615_009", "order": 9, "role": "body", "text": "\"We have enough talent here to get over that hump and make a lot of good things happen,\" Love said. \"Right now it's just tough to see the light at the end of the tunnel but it is there. We will get out of it and we will get better.\""}
{"game_id": "0021700615", "chunk_id": "0021700615_010", "order": 10, "role": "body", "text": "Fred VanVleet scored a career-high 22 points, Jonas Valanciunas had 15 points and a season-high 18 rebounds and the Raptors overcame the absences of two starters."}
{"game_id": "0021700615", "chunk_id": "0021700615_011", "order": 11, "role": "body", "text": "C.J.Miles scored 16 points, Pascal Siakam and Norm Powell each had 14 and DeMar DeRozan 13 for the Raptors, who were without point guard Kyle Lowry (bruised tailbone) and forward Serge Ibaka (suspension). Jakob Poeltl had 12 points and 12 rebounds for the Raptors."}
{"game_id": "0021700615", "chunk_id": "0021700615_012", "order": 12, "role": "body", "text": "VanVleet made six of eight 3-point attempts as the Raptors connected on a season-high 18 shots from beyond the arc."}
{"game_id": "0021700615", "chunk_id": "0021700615_013", "order": 13, "role": "body", "text": "\"I was really proud of the way he came to play,\" Raptors coach Dwane Casey said."}
{"game_id": "0021700615", "chunk_id": "0021700615_014", "order": 14, "role": "body", "text": "Toronto's 12-game home winning streak was snapped in Tuesday's loss to Miami, but the Raptors bounced back in their first meeting with Cleveland since the Cavaliers swept the Raptors out of the second round of the playoffs last May."}
{"game_id": "0021700615", "chunk_id": "0021700615_015", "order": 15, "role": "body", "text": "Thomas connecting on a short jumper at 7:22 of the third quarter for his first basket. He finished 2 for 15 and went 0 for 6 from 3-point range. Playing for the fourth time this season as he returns from a right hip injury, Thomas scored four points in 24 minutes."}
{"game_id": "0021700615", "chunk_id": "0021700615_016", "order": 16, "role": "body", "text": "\"He'll be fine,\" Cavs coach Tyronn Lue said. \"He's going to have to work out some kinks, but he'll be fine.\""}
{"game_id": "0021700615", "chunk_id": "0021700615_017", "order": 17, "role": "body", "text": "Lowry missed his second straight game after he was injured in a heavy fall in overtime of Monday's win at Brooklyn. Lowry participated in shootaround Thursday morning but is still too sore to play."}
{"game_id": "0021700615", "chunk_id": "0021700615_018", "order": 18, "role": "body", "text": "Ibaka served a one-game suspension for throwing a punch at Miami's James Johnson in Tuesday's home loss to the Heat."}
{"game_id": "0021700615", "chunk_id": "0021700615_019", "order": 19, "role": "body", "text": "Leading 30-24 after one quarter, the Raptors extended their lead in the second thanks to their bench. Siakam scored 10 points and VanVleet had eight as Toronto led 65-40 at halftime."}
{"game_id": "0021700615", "chunk_id": "0021700615_021", "order": 21, "role": "body", "text": "Cavaliers: Thomas missed all 10 of his field goal attempts in the first half. ... G Derrick Rose who has been out since Nov. 7 with an ankle injury, will not play Friday at Indiana. G Iman Shumpert, out since Nov. 20 with a knee injury, is also expected to miss Friday's game. ... Cleveland is 11-11 on the road."}
{"game_id": "0021700615", "chunk_id": "0021700615_022", "order": 22, "role": "body", "text": "Raptors: Outscored Cleveland 76-48 in bench points. ... Outrebounded the Cavs 63-35."}
{"game_id": "0021700615", "chunk_id": "0021700615_024", "order": 24, "role": "body", "text": "Toronto's 29 wins through 40 games are the most in franchise history. The Raptors started 28-13 in 2016-17."}
{"game_id": "0021700615", "chunk_id": "0021700615_026", "order": 26, "role": "body", "text": "Thomas failed to make at least one 3-pointer for the first time in 60 games. It had been the second-longest streak in the NBA behind Golden State's Klay Thompson (95)."}
{"game_id": "0021700615", "chunk_id": "0021700615_028", "order": 28, "role": "body", "text": "Cavaliers: Thomas is expected to rest when Cleveland concludes a back-to-back by visiting Indiana on Friday. The Pacers have won both meetings with the Cavs this season."}
{"game_id": "0021700615", "chunk_id": "0021700615_029", "order": 29, "role": "body", "text": "Raptors: Host Golden State on Saturday. Toronto has lost seven straight to the Warriors."}
{"game_id": "0021700615", "chunk_id": "0021700615_031", "order": 31, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
