{"game_id": "0021200883", "chunk_id": "0021200883_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- The Memphis Grizzlies haven't taken games lightly against losing teams this season."}
{"game_id": "0021200883", "chunk_id": "0021200883_002", "order": 2, "role": "body", "text": "They didn't come close to disrupting that trend against the struggling Orlando Magic."}
{"game_id": "0021200883", "chunk_id": "0021200883_003", "order": 3, "role": "body", "text": "Tayshaun Prince had 14 points and Marc Gasol added 12 points and 11 assists as Memphis cruised to a 108-82 victory on Sunday night."}
{"game_id": "0021200883", "chunk_id": "0021200883_004", "order": 4, "role": "body", "text": "The Grizzlies, who have won nine of their last 10 games, led by as many as 32 points and had six players in double figures. Memphis played the first of five straight games against teams with losing records."}
{"game_id": "0021200883", "chunk_id": "0021200883_005", "order": 5, "role": "body", "text": "Coming off a tough loss at Miami, Grizzlies swingman Quincy Pondexter said it was exactly the kind of effort he has come to expect from his teammates as they jockey for position in the Western Conference."}
{"game_id": "0021200883", "chunk_id": "0021200883_006", "order": 6, "role": "body", "text": "\"A lot of times those tough losses steamroll into a few more. We came out, we were professionals today and we executed and got the win,\" he said. \"We took care of business.\""}
{"game_id": "0021200883", "chunk_id": "0021200883_007", "order": 7, "role": "body", "text": "Memphis played without forward Zach Randolph, who rested the left ankle he sprained in last Friday's loss to Miami. But the Grizzlies didn't miss him. They never trailed and got contributions from everyone that played, including 49 points from the bench."}
{"game_id": "0021200883", "chunk_id": "0021200883_008", "order": 8, "role": "body", "text": "\"Obviously, we were looking to get the ball up the court a little faster and make plays,\" Prince said. \"Thirty-one assists (as a team) is great and we shot the ball well from the perimeter. That helped us out a lot.\""}
{"game_id": "0021200883", "chunk_id": "0021200883_009", "order": 9, "role": "body", "text": "Arron Afflalo and E'Twaun Moore each added 12 points to lead a Magic team that has lost 17 of 19 on its home floor."}
{"game_id": "0021200883", "chunk_id": "0021200883_010", "order": 10, "role": "body", "text": "Orlando is now just 4-31 since Dec. 20, and begins a two-game road trip Monday at New Orleans."}
{"game_id": "0021200883", "chunk_id": "0021200883_011", "order": 11, "role": "body", "text": "The Grizzlies entered Sunday with the fourth-best record in the Western Conference and trailing third-place Los Angeles Clippers by just a game in the loss column. That gap closed with the Clippers losing to Oklahoma City earlier Sunday."}
{"game_id": "0021200883", "chunk_id": "0021200883_012", "order": 12, "role": "body", "text": "Memphis is now in prime position to gain even more ground in the playoff race this week, thanks to a break in the schedule among playoff contenders. It includes meetings with Cleveland and New Orleans -- who are both in last place in their respective divisions -- and two games against struggling Portland."}
{"game_id": "0021200883", "chunk_id": "0021200883_013", "order": 13, "role": "body", "text": "The Grizzlies never trailed and pulled their starters early in the fourth quarter, having never seen their lead threatened over the final 24 minutes."}
{"game_id": "0021200883", "chunk_id": "0021200883_014", "order": 14, "role": "body", "text": "\"It was a good win for us. We came out, had a game plan and we stuck to it,\" Memphis coach Lionel Hollins said. \"We just played fluid and together, we got in a flow and caused them some problems.\""}
{"game_id": "0021200883", "chunk_id": "0021200883_015", "order": 15, "role": "body", "text": "But they did have another scary moment on the injury front against the Magic. Randolph's replacement in the starting lineup, forward Darrell Arthur, was shaken up midway through the second quarter when he landed awkwardly on his back and hit his head against the floor after a hard foul by Orlando's Al Harrington."}
{"game_id": "0021200883", "chunk_id": "0021200883_016", "order": 16, "role": "body", "text": "Referees reviewed the play, but didn't deem it to be a flagrant foul. Arthur stayed in the game and hit his ensuing free throws, but went to the bench a few minutes later and didn't return."}
{"game_id": "0021200883", "chunk_id": "0021200883_017", "order": 17, "role": "body", "text": "Hollins said after the game that Arthur was fine."}
{"game_id": "0021200883", "chunk_id": "0021200883_018", "order": 18, "role": "body", "text": "The Grizzlies finished the half strong without him and led 60-35 at halftime."}
{"game_id": "0021200883", "chunk_id": "0021200883_019", "order": 19, "role": "body", "text": "Memphis shot just under 60 percent in the half (25 for 42) and scored 14 points off nine Orlando turnovers to help build its advantage."}
{"game_id": "0021200883", "chunk_id": "0021200883_020", "order": 20, "role": "body", "text": "The Magic also helped the cause by missing all eight of their 3-point attempts."}
{"game_id": "0021200883", "chunk_id": "0021200883_021", "order": 21, "role": "body", "text": "That included a poor shooting half for forward Tobias Harris, a trade-deadline acquisition who came into Sunday averaging 20 points in his first four games with Orlando."}
{"game_id": "0021200883", "chunk_id": "0021200883_022", "order": 22, "role": "body", "text": "\"I thought they might have been keying in a little bit,\" he said. \"But as a player that when you have to adapt to what the other team is doing. You just have to find a way out there.\""}
{"game_id": "0021200883", "chunk_id": "0021200883_023", "order": 23, "role": "body", "text": "Prince said that the Grizzlies don't plan on taking any games of during their upcoming stretch."}
{"game_id": "0021200883", "chunk_id": "0021200883_024", "order": 24, "role": "body", "text": "Particularly with matchups with teams very much in the postseason chase still to come."}
{"game_id": "0021200883", "chunk_id": "0021200883_025", "order": 25, "role": "body", "text": "\"It's definitely important to take care of those games,\" he said. \"When you lose games like that it puts you in a tough situation. You want to take care of those wins. We've been playing some great basketball of late, even though we haven't been playing the teams with great records yet."}
{"game_id": "0021200883", "chunk_id": "0021200883_026", "order": 26, "role": "body", "text": "\"But this is helping us build some kind of momentum for when we do play those teams.\""}
{"game_id": "0021200883", "chunk_id": "0021200883_027", "order": 27, "role": "closing", "text": "Game notes Memphis improved to 10-1 when it shoots at least 50 percent from the field. ... Orlando dropped to 5-24 when its opponent scores at least 100 points. ... Magic PG Jameer Nelson missed his sixth consecutive game with a left patella tendon contusion. He remains day-to-day."}
