{"game_id": "0021700533", "chunk_id": "0021700533_001", "order": 1, "role": "lead", "text": "ATLANTA --  Dennis Schroder knows his strength -- take the ball to the rim as often as possible."}
{"game_id": "0021700533", "chunk_id": "0021700533_002", "order": 2, "role": "body", "text": "\"Whenever I see an advantage for me to attack, I try to do that,\" he said. \"I'm pretty fast. That's what I've been doing the last four years. I feel pretty comfortable now.\""}
{"game_id": "0021700533", "chunk_id": "0021700533_003", "order": 3, "role": "body", "text": "Schroder scored 18 of his 22 points in the second half, Marco Belinelli added 14 points and the Atlanta Hawks beat the Portland Trail Blazers 104-89 on Saturday night."}
{"game_id": "0021700533", "chunk_id": "0021700533_004", "order": 4, "role": "body", "text": "Shabazz Napier finished with 21 points and CJ McCollum had 18 for Portland, which was coming off arguably its best win of the season, rallying Thursday from 18 down in the third quarter to beat Philadelphia."}
{"game_id": "0021700533", "chunk_id": "0021700533_005", "order": 5, "role": "body", "text": "The Blazers led Atlanta, the NBA's worst team, by 11 early in the third, but coach Terry Stotts called timeout at 3:47 mark of the period after Schroder's 3 put the Hawks up 67-66."}
{"game_id": "0021700533", "chunk_id": "0021700533_006", "order": 6, "role": "body", "text": "Atlanta didn't trail again, mostly because Schroder, the Hawks' rangy point guard from Germany, kept the Blazers on their heels the rest of the night. He played a team-high 33 minutes despite a left quad contusion."}
{"game_id": "0021700533", "chunk_id": "0021700533_007", "order": 7, "role": "body", "text": "\"You've got to pick your spots and keep them guessing,\" Schroder said. \"I've gotten comfortable doing it now. Every time I do it, I try to do it with force.\""}
{"game_id": "0021700533", "chunk_id": "0021700533_008", "order": 8, "role": "body", "text": "The lead swelled to 12 on John Collins' three-point play and to 13 on Ersan Ilyasova's 3 before Schroder's three-point play made it 95-80 with 4:51 remaining."}
{"game_id": "0021700533", "chunk_id": "0021700533_009", "order": 9, "role": "body", "text": "Stotts pulled all of his starters except Napier, who's filling in for leading scorer Damian Lillard, for the final three-plus minutes."}
{"game_id": "0021700533", "chunk_id": "0021700533_010", "order": 10, "role": "body", "text": "The Blazers needed more consistency from McCollum, who went just 8 for 21 from the field. He scored 34 against Philadelphia."}
{"game_id": "0021700533", "chunk_id": "0021700533_011", "order": 11, "role": "body", "text": "\"I think he was trying to draw some fouls that he wasn't able to get,\" Stotts said. \"It was a rough night for him offensively. He's been doing it for a while now, so there's not much I can tell him. Just needs to be strong with the ball and make good decisions.\""}
{"game_id": "0021700533", "chunk_id": "0021700533_012", "order": 12, "role": "body", "text": "Ilyasova and Tyler Cavanaugh had 13 points apiece, and Kent Bazemore and Taurean Prince each scored 12 for the Hawks (10-26). Atlanta became the last team to reach double digits in wins."}
{"game_id": "0021700533", "chunk_id": "0021700533_013", "order": 13, "role": "body", "text": "Portland (18-17) dropped to 10-7 on the road."}
{"game_id": "0021700533", "chunk_id": "0021700533_015", "order": 15, "role": "body", "text": "Trail Blazers: Lillard, who averages 25.2 points, missed his fourth straight game with a right hamstring injury. ... Portland had nothing to show for outscoring Atlanta 46-28 in the paint and a 24-14 advantage in second-chance points. ... Two nights after putting up a season-high 42 points in the fourth quarter, the Blazers had just 37 points in the second half. ... The bench was outscored 41-23."}
{"game_id": "0021700533", "chunk_id": "0021700533_016", "order": 16, "role": "body", "text": "Hawks: Atlanta has won three straight at home for the first time this season. ... Belinelli's teammates had a good laugh when he missed two dunks in the second half instead of going for easy layups. \"In the future I'm going to try to (draw) a foul,\" he said. \"That would be more smart, I think.\" ... After scoring a career-high 30 points in a lopsided loss at Toronto, Prince finished with 12 points and took just eight shots in 31 minutes. Prince went 4 of 7 beyond the arc and had 10 rebounds."}
{"game_id": "0021700533", "chunk_id": "0021700533_018", "order": 18, "role": "body", "text": "Hawks coach Mike Budenholzer said he and Raptors coach Dwane Casey have settled their differences after they argued at the end of Atlanta's 111-98 loss Friday at Toronto."}
{"game_id": "0021700533", "chunk_id": "0021700533_019", "order": 19, "role": "body", "text": "With the Hawks dribbling out the clock, Budenholzer was annoyed when Raptors rookie OG Anunoby stole the ball and dunked with 17 seconds left. He yelled at Anunoby, Casey yelled at Budenholzer and Budenholzer yelled back at Casey with the coaches exchanging profanities. They refused to speak after the game, but Budenhozler was satisfied to settle the situation Saturday."}
{"game_id": "0021700533", "chunk_id": "0021700533_020", "order": 20, "role": "body", "text": "\"I've exchanged texts with Dwane,\" Budenholzer said. \"I've apologized. They play hard. I have a lot of respect for Dwane. It's really kind of a non-issue, to be honest with you.\""}
{"game_id": "0021700533", "chunk_id": "0021700533_022", "order": 22, "role": "body", "text": "Trail Blazers: Visit Chicago on Monday and Cleveland on Tuesday."}
{"game_id": "0021700533", "chunk_id": "0021700533_023", "order": 23, "role": "body", "text": "Hawks: Begin a five-game West Coast trip Tuesday at Phoenix."}
{"game_id": "0021700533", "chunk_id": "0021700533_025", "order": 25, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
