{"game_id": "0021700243", "chunk_id": "0021700243_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  It might have been Victor Oladipo's best all-around game at the arena where he played his first three NBA seasons."}
{"game_id": "0021700243", "chunk_id": "0021700243_002", "order": 2, "role": "body", "text": "Oladipo had 29 points, nine rebounds and seven steals to lead the Indiana Pacers to their fourth straight win, 105-97 over the Orlando Magic on Monday night."}
{"game_id": "0021700243", "chunk_id": "0021700243_003", "order": 3, "role": "body", "text": "The venue and the opponent had very little to do with it, according to the Pacers guard."}
{"game_id": "0021700243", "chunk_id": "0021700243_004", "order": 4, "role": "body", "text": "\"Honestly, this year every night fuels me,\" Oladipo said. \"We've got to go out and compete in the NBA against the best of the best. That competitive juice, that competitive edge is already running through my veins.\""}
{"game_id": "0021700243", "chunk_id": "0021700243_005", "order": 5, "role": "body", "text": "Oladipo and Bojan Bogdanovic combined for 40 points in the second half, 14 of them during a 16-3 third-quarter run that put the Pacers in command."}
{"game_id": "0021700243", "chunk_id": "0021700243_006", "order": 6, "role": "body", "text": "Oladipo's seven steals were a season-high and he also had five assists."}
{"game_id": "0021700243", "chunk_id": "0021700243_007", "order": 7, "role": "body", "text": "\"He's taking that leader role,\" teammate Lance Stephenson said. \"He's bringing it every night and being that guy that we need him to be.\""}
{"game_id": "0021700243", "chunk_id": "0021700243_008", "order": 8, "role": "body", "text": "Bogdanovic scored 24 of his 26 points in the second half, making five of six 3-pointers."}
{"game_id": "0021700243", "chunk_id": "0021700243_009", "order": 9, "role": "body", "text": "\"He was red-hot for us,\" said coach Nate McMillan. \"Part of the reason we've gone to an eight-man rotation is to try to get him minutes at the four position.\""}
{"game_id": "0021700243", "chunk_id": "0021700243_010", "order": 10, "role": "body", "text": "Nikola Vucevic had 25 points and 13 rebounds for the Magic, who lost their fifth straight."}
{"game_id": "0021700243", "chunk_id": "0021700243_011", "order": 11, "role": "body", "text": "The Magic finished with 22 turnovers and shot 33 percent in the second half to fall below .500 for the first time this season."}
{"game_id": "0021700243", "chunk_id": "0021700243_012", "order": 12, "role": "body", "text": "After a dunk by Aaron Gordon late in the first quarter, the Magic were down 23-22 despite making nine of their first 12 shots, including four of five 3-pointers. They never regained their shooting touch."}
{"game_id": "0021700243", "chunk_id": "0021700243_013", "order": 13, "role": "body", "text": "\"Somewhere in the third quarter we lost our rhythm, started over-dribbling, got stagnant,\" Vucevic said. \"I don't know why because it was working so well for us (in the first half). Then we started forcing stuff.\""}
{"game_id": "0021700243", "chunk_id": "0021700243_014", "order": 14, "role": "body", "text": "Two straight Orlando turnovers helped Indiana take a six-point lead before the Magic closed the first half with 11 straight points for a 55-50 advantage."}
{"game_id": "0021700243", "chunk_id": "0021700243_015", "order": 15, "role": "body", "text": "Oladipo and Bogdanovic scored 22 points in the third quarter. A 3-pointer by Bogdanovic gave Indiana its first double-digit lead with 4:11 left in the game."}
{"game_id": "0021700243", "chunk_id": "0021700243_016", "order": 16, "role": "body", "text": "A couple of 3-pointers by Evan Fournier and a 12-foot bank by Gordon pulled the Magic to within three in the final minute, but Oladipo set up Bogdanovic for a 3-pointer that put the Pacers up by six with 16.8 seconds left."}
{"game_id": "0021700243", "chunk_id": "0021700243_018", "order": 18, "role": "body", "text": "The Magic's five straight losses have been by an average of 16 points."}
{"game_id": "0021700243", "chunk_id": "0021700243_019", "order": 19, "role": "body", "text": "\"We're trying,\" coach Frank Vogel said. \"Nobody's happy with how we're playing, and we know we've got to dig ourselves a little bit out of a rut here.\""}
{"game_id": "0021700243", "chunk_id": "0021700243_021", "order": 21, "role": "body", "text": "Pacers: After making 11 of 23 attempts at Miami on Sunday, Indiana came into the game as the NBA's best 3-point shooting team (.404). They made 8 of 20 Monday night."}
{"game_id": "0021700243", "chunk_id": "0021700243_022", "order": 22, "role": "body", "text": "Magic: Rookie forward Jonathan Isaac missed a fourth straight game with a sprained right ankle. ... The Magic outrebounded the Pacers 50-48 after coming into the game with the NBA's worst rebounding percentage."}
{"game_id": "0021700243", "chunk_id": "0021700243_024", "order": 24, "role": "body", "text": "Pacers: After a three-day break, the Pacers will play Toronto Friday night in the first of three straight home games."}
{"game_id": "0021700243", "chunk_id": "0021700243_025", "order": 25, "role": "body", "text": "Magic: Wednesday night's game at Minnesota will open a four-game trip."}
{"game_id": "0021700243", "chunk_id": "0021700243_027", "order": 27, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
