{"game_id": "0021300922", "chunk_id": "0021300922_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  The Minnesota Timberwolves can't afford any more lazy starts like the one that got them beat two nights ago. They can't afford any more losses to teams with inferior records. Their one last, desperate playoff push begins right now."}
{"game_id": "0021300922", "chunk_id": "0021300922_002", "order": 2, "role": "body", "text": "The Detroit Pistons are in the same boat. But they sure aren't playing like it."}
{"game_id": "0021300922", "chunk_id": "0021300922_003", "order": 3, "role": "body", "text": "Kevin Love had 28 points, 14 rebounds and five assists, and the Timberwolves led by 31 points in the third quarter en route to a 114-101 victory over the Pistons on Friday night."}
{"game_id": "0021300922", "chunk_id": "0021300922_004", "order": 4, "role": "body", "text": "Kevin Martin scored 24 points and Ricky Rubio added 11 points, nine assists and eight rebounds for the Timberwolves, who trail the Dallas Mavericks by five games for the eighth and final playoff spot in the West with 21 games to go."}
{"game_id": "0021300922", "chunk_id": "0021300922_005", "order": 5, "role": "body", "text": "\"We have to have more discipline in what we do,\" said coach Rick Adelman, referring to the Wolves letting the Pistons back into the game in the fourth. \"I don't care what the score is. We have to learn. It's hurt us in the past and it will hurt us again if we don't know the time and score.\""}
{"game_id": "0021300922", "chunk_id": "0021300922_006", "order": 6, "role": "body", "text": "Greg Monroe had 20 points and 15 rebounds, and Will Bynum scored all 17 of his points in the fourth quarter for the Pistons. But Detroit shot 40 percent and lost for the ninth time in 11 games, yet another demoralizing performance for a team that started the night just three games back of eighth-place Atlanta in the East."}
{"game_id": "0021300922", "chunk_id": "0021300922_007", "order": 7, "role": "body", "text": "\"Tonight our lack of defense, especially in that first half, dictated our offense,\" Pistons coach John Loyer said. \"It's pretty hard to really have great pace and play with offensive pace if you're so lackadaisical on the defensive end, which we were.\""}
{"game_id": "0021300922", "chunk_id": "0021300922_008", "order": 8, "role": "body", "text": "Nikola Pekovic had 17 points and nine rebounds for Minnesota (31-30), which matched its win total of last season and led by 28 when the final quarter opened."}
{"game_id": "0021300922", "chunk_id": "0021300922_009", "order": 9, "role": "body", "text": "But Bynum got going in the fourth, and his driving layup cut the lead to 112-101 with a minute to play. But the deficit proved too big for the Pistons to overcome."}
{"game_id": "0021300922", "chunk_id": "0021300922_010", "order": 10, "role": "body", "text": "\"Sometimes coach has to make a hockey substitution and put all five (starters) back in,\" Martin said with a smile. \"We're just happy we got a win.\""}
{"game_id": "0021300922", "chunk_id": "0021300922_011", "order": 11, "role": "body", "text": "The Timberwolves came home from an 11-day West Coast road trip that included four wins in five games to move them one game above .500 and 4 1/2 out of the eighth and final playoff spot in the demanding Western Conference. A four-game homestand against struggling opponents had them cautiously optimistic that they could sneak back into the mix."}
{"game_id": "0021300922", "chunk_id": "0021300922_012", "order": 12, "role": "body", "text": "But they opened the crucial stretch with a clunker, falling behind 15-2 en route to losing on to the woeful New York Knicks on Wednesday night. The loss stung even more when Phoenix, Dallas and Memphis, the three teams right ahead of them in the playoff chase, all lost before the Wolves hit the floor."}
{"game_id": "0021300922", "chunk_id": "0021300922_013", "order": 13, "role": "body", "text": "\"We learned our lesson, we played aggressive tonight and everyone did a good job,\" Rubio said."}
{"game_id": "0021300922", "chunk_id": "0021300922_014", "order": 14, "role": "body", "text": "With almost no margin for error the rest of the way, the Wolves jumped on the Pistons from the get-go. After struggling mightily from the field and playing tentatively in his previous two games, Martin came out very aggressive in the first quarter. He hit three of his first four shots and attacked the basket with a layup that gave the Wolves a 29-11 lead."}
{"game_id": "0021300922", "chunk_id": "0021300922_015", "order": 15, "role": "body", "text": "The battle under the boards between two of the most physical, tenacious rebounding front lines in the league never materialized. Monroe picked up two quick fouls and a technical in the first quarter that limited his effectiveness early and Andre Drummond, who was averaging 13.0 rebounds per game and leads the league in offensive rebounds, had just two points and one rebound while playing 15 minutes over the first three quarters due to foul trouble."}
{"game_id": "0021300922", "chunk_id": "0021300922_016", "order": 16, "role": "body", "text": "Drummond finished with six points and seven rebounds before fouling out."}
{"game_id": "0021300922", "chunk_id": "0021300922_017", "order": 17, "role": "body", "text": "\"There are a lot of young guys and a lot of players on this team that haven't been able to experience the postseason,\" said Pistons forward Josh Smith, who had 13 points on 4-for-14 shooting. \"They won't understand it until they get in and they get that feeling. That's when that addiction starts to creep in.\""}
{"game_id": "0021300922", "chunk_id": "0021300922_018", "order": 18, "role": "closing", "text": "Game notes Brandon Jennings had 17 points, five assists and five rebounds for the Pistons, but did not play in the fourth quarter. ... Wolves backup PG J.J. Barea, the subject of boos from the home crowd against the Knicks, had another rough game, with four points on 2-for-8 shooting. ... The rock band Arcade Fire, including basketball aficionado Win Butler, was in attendance."}
