{"game_id": "0021401148", "chunk_id": "0021401148_001", "order": 1, "role": "lead", "text": "CLEVELAND -- Kyrie Irving heard LeBron James scream to shoot, so he shot.\nBuzzer. Swish.\nHis prayer was answered, and it wasn't the only one for the Cavaliers on Sunday.\nIrving casually dropped a 52-foot 3-pointer, J.R. Smith made eight 3s -- highlighted by a desperation one to end the first half -- and James recorded his first triple-double with the Cavs in five years as Cleveland won its 18th straight at home, 99-94 over the Chicago Bulls.\nThe Cavs made 16 3-pointers, three as time was draining from either the game or shot clock.\n\"I've been doing this a long time,\" Cleveland coach David Blatt said, shaking his head. \"I've never seen three like that in one game.\""}
{"game_id": "0021401148", "chunk_id": "0021401148_002", "order": 2, "role": "closing", "text": "The Bulls haven't either.\n\"The basketball gods were on their side today,\" Joakim Noah said.\nIrving scored 27 points, but it was his dramatic shot in the third quarter that helped the Cavs move closer to a Central Division title and securing the No. 2 seed in the Eastern Conference playoffs.\nWith the Cavs leading 70-60, Irving caught the inbounds pass thinking there were still 22 seconds left on the 24-shot clock. James, who was setting a screen, yelled to Irving and his long shot hit nothing but net.\n\"It was a crazy play,\" he said. \"Luckily it went in. There was no skill there. I was just throwing it up at the rim and hopefully it goes in.\"\nBoth Irving and James had similar reactions, shrugging and throwing their hands in the air. It was that kind of game for the Cavs, who attempted 37 3-pointers, three of them in nearly hopeless situations.\n\"I told him to just throw it up there and see what happens, and it went in,\" James said of Irving's deepest 3. \"I told him to just cast it, and it definitely was the difference in the game.\"\nIrving ended the first quarter by making a fadeaway 3-pointer from the left corner just before the horn, and Smith dropped an off-balance 40-footer before falling into one of the expensive courtside seats.\nThere wasn't much the Bulls could do.\n\"Some I thought were defended well, some weren't,\" Chicago coach Tom Thibodeau said. \"They had three heaves that went in.\"\nMike Dunleavy scored 24 and Aaron Brooks 17 for the Bulls, who could have star guard Derrick Rose back in the next few days.\nJames finished with 20 points, 12 assists and 10 rebounds, his first triple-double in a Cleveland uniform since May 13, 2010, two months before he left as a free agent for Miami.\nThe Cavs notched win No. 50 and improved to a league-best 31-7 since Jan. 15.\nSmith scored all 24 points from long range as the Cavs improved to 3-1 this season against the Bulls, a team they could face in the postseason. By then, Rose may be back following knee surgery, which would spice up a series that doesn't need any hype. James' teams have eliminated the Bulls three times in the past five seasons and the four-time MVP has a running feud with Noah.\nThe two exchanged words Sunday and could soon see each other with more on the line.\nThat would be fine with Noah.\n\"It would be great to play them in the playoffs,\" Noah said. \"That would be very, very exciting. That's something I really hope happens.\"\nDespite the Cavs' long-range antics, the Bulls were within striking distance late before Kevin Love's 3 with 1:14 left gave the Cavs a 96-87 lead.\nROSE UPDATE\nThe Bulls were without their starting backcourt as Kirk Hinrich (hyperextended knee) joined Rose on the bench. Rose, recently cleared for full contact, did on-court drills before the game and is nearing a return from surgery on his right knee.\nThibodeau hopes Rose, who had surgery on Feb. 27, will return this week. The Bulls play at Orlando and Miami.\n\"Ideally, the sooner the better, but he has to be comfortable enough to play,\" Thibodeau said. \"We're not going to play him the amount of minutes he was playing before he got injured.\"\nROUGH STUFF\nJames was called for a flagrant foul in the first half and he was on the receiving end of a hard foul by Noah.\n\"It's April,\" he said, explaining the game's physical nature.\nTIP-INS\nBulls: Because of injuries, Chicago has had its starting lineup -- Rose, Dunleavy, Noah, Jimmy Butler and Pau Gasol -- just 19 times this season. The Bulls are 15-4 in those games. ... Thibodeau said Rose's presence alone makes the Bulls better. \"Just Derrick on the floor helps our team,\" he said. \"We don't expect him to be playing 35 minutes a night or scoring a ton of points. Just give us what you have.\"\nCavaliers: Smith has made at least eight 3s 12 times in his career, an NBA record. ... James was stripped of a triple-double earlier this season against New Orleans. The NBA took away an assist after reviewing the Nov. 10 game. ... During the home winning streak, all five Cavs starters have averaged double figures.\nUP NEXT\nBulls: At Orlando on Wednesday.\nCavaliers: At Milwaukee on Wednesday."}
