{"game_id": "0021700322", "chunk_id": "0021700322_001", "order": 1, "role": "lead", "text": "CHICAGO --  The slumping Chicago Bulls may have seemed like the more desperate team, but Zach Randolph thought the Sacramento Kings needed a win just as badly."}
{"game_id": "0021700322", "chunk_id": "0021700322_002", "order": 2, "role": "body", "text": "Randolph had 25 points and 13 rebounds, Bogdan Bogdanovic scored 19 points and the Kings beat the Bulls 107-106 on Friday night, extending Chicago's losing streak to eight games."}
{"game_id": "0021700322", "chunk_id": "0021700322_003", "order": 3, "role": "body", "text": "\"Everybody's desperate right now -- especially us,\" Randolph said."}
{"game_id": "0021700322", "chunk_id": "0021700322_004", "order": 4, "role": "body", "text": "It was the third road win this season for the Kings (7-15)."}
{"game_id": "0021700322", "chunk_id": "0021700322_005", "order": 5, "role": "body", "text": "\"It's tough getting road wins,\" Randolph said. \"Any team it's tough, trying to go into their place to get a win."}
{"game_id": "0021700322", "chunk_id": "0021700322_006", "order": 6, "role": "body", "text": "\"It was a good win, a team win. Everybody contributed.\""}
{"game_id": "0021700322", "chunk_id": "0021700322_007", "order": 7, "role": "body", "text": "Randolph was 12 for 19 from the field. Garrett Temple had 13 points and Willie Cauley-Stein added 10 points and four blocks for the Kings."}
{"game_id": "0021700322", "chunk_id": "0021700322_008", "order": 8, "role": "body", "text": "Jerian Grant had 17 points, while rookie Lauri Markkanen, Robin Lopez and Paul Zipser scored 14 points apiece for Chicago, which dropped to an NBA-worst 3-18."}
{"game_id": "0021700322", "chunk_id": "0021700322_009", "order": 9, "role": "body", "text": "It was the second straight night the Bulls lost by a point, although Friday's game ended with a meaningless 3-pointer at the buzzer. Chicago's last win was a 123-120 decision against Charlotte on Nov. 17."}
{"game_id": "0021700322", "chunk_id": "0021700322_010", "order": 10, "role": "body", "text": "\"It's pretty tough,\" Denzel Valentine (six points) said. \"I think tonight we just didn't play with the same edge. I don't know whether it was travel. We weren't aggressive. We didn't have the same edge as last night, so that's what we get.\""}
{"game_id": "0021700322", "chunk_id": "0021700322_011", "order": 11, "role": "body", "text": "Chicago kept it close throughout the fourth quarter. Randolph hit what turned out to be the key basket, giving Sacramento a 103-99 lead with 51.5 seconds left."}
{"game_id": "0021700322", "chunk_id": "0021700322_012", "order": 12, "role": "body", "text": "Cauley-Stein also contributed with tough defense on Markkanen down the stretch as the Bulls came up empty on three straight possessions in the final 2 1/2 minutes."}
{"game_id": "0021700322", "chunk_id": "0021700322_014", "order": 14, "role": "body", "text": "The Kings and Bulls are rebuilding with a host of athletic high flyers, but Randolph, the old-school big man, controlled things with his ground game."}
{"game_id": "0021700322", "chunk_id": "0021700322_015", "order": 15, "role": "body", "text": "\"How about a 36-year-old that goes and gets 25 and 13 and has one free throw,\" Sacramento coach Dave Joerger said. \"That's amazing. That's fantastic work by Zach, and we did a good job of playing off of him, too.\""}
{"game_id": "0021700322", "chunk_id": "0021700322_017", "order": 17, "role": "body", "text": "With the losses piling up, the Bulls' biggest challenge might be to avoid focusing solely on the streak."}
{"game_id": "0021700322", "chunk_id": "0021700322_018", "order": 18, "role": "body", "text": "\"That's the thing we talk about with this group all the time,\" coach Fred Hoiberg said. \"It's not about looking at the wins and losses. It's about taking steps in the right direction every day. It's about going out and competing every night and giving ourselves a chance."}
{"game_id": "0021700322", "chunk_id": "0021700322_019", "order": 19, "role": "body", "text": "\"If you can look at your teammate and say you were the harder-playing team at the end of the night, whatever happens -- win, loss -- you can live with it.\""}
{"game_id": "0021700322", "chunk_id": "0021700322_021", "order": 21, "role": "body", "text": "Kings: Rookie F Justin Jackson and second-year players C Georgios Papagiannis and G Malachi Richardson were assigned to the Reno Bighorns of the G League. \"It's a developmental tool for them to be able to play,\" Joerger said."}
{"game_id": "0021700322", "chunk_id": "0021700322_022", "order": 22, "role": "body", "text": "Bulls: F Bobby Portis (right arm) was scratched just before game time. ... F Nikola Mirotic -- sidelined with a facial fracture following a preseason fight with Portis -- practiced with the Windy City Bulls of the G League for a second straight day on Friday and could be activated on Monday. \"A lot will depend on how he feels (on Saturday),\" Hoiberg said. \"He'll come in and get some shooting (on Saturday) and, hopefully, we give him a good workout on Sunday, and we'll take it from there.\" ... G Zach LaVine (knee surgery) also practiced with Windy City on Friday. His return date remains uncertain."}
{"game_id": "0021700322", "chunk_id": "0021700322_024", "order": 24, "role": "body", "text": "Kings: Visit Milwaukee on Saturday night."}
{"game_id": "0021700322", "chunk_id": "0021700322_025", "order": 25, "role": "body", "text": "Bulls: Host Cleveland on Monday night."}
{"game_id": "0021700322", "chunk_id": "0021700322_027", "order": 27, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
