{"game_id": "0021701067", "chunk_id": "0021701067_001", "order": 1, "role": "lead", "text": "NEW YORK --  One of Dwight Howard's close friends wasn't too enthused with the center's effort at halftime. So, he sent him a text message to let him know."}
{"game_id": "0021701067", "chunk_id": "0021701067_002", "order": 2, "role": "body", "text": "It pushed the Charlotte Hornets star to one of the most dominant performances in NBA history."}
{"game_id": "0021701067", "chunk_id": "0021701067_003", "order": 3, "role": "body", "text": "Howard had 32 points and a franchise-record 30 rebounds, becoming just the eighth player in league history with a 30-30 game, and the Hornets stormed back to beat Brooklyn 111-105 on Wednesday night."}
{"game_id": "0021701067", "chunk_id": "0021701067_004", "order": 4, "role": "body", "text": "\"I just thought that my energy and effort wasn't where it needed to be for our team to be successful,\" Howard said. \"Got a text at halftime from somebody and it kind of got me motivated and gave me some extra energy.\""}
{"game_id": "0021701067", "chunk_id": "0021701067_005", "order": 5, "role": "body", "text": "Howard is the first NBA player with a 30-point, 30-rebound game since Kevin Love did it for Minnesota on Nov. 12, 2010."}
{"game_id": "0021701067", "chunk_id": "0021701067_006", "order": 6, "role": "body", "text": "\"Never been part of something like that,\" Hornets teammate Kemba Walker said. \"It was incredible. Yeah, it was incredible to see those kinds of numbers and be a part of it. Yeah, it was crazy.\""}
{"game_id": "0021701067", "chunk_id": "0021701067_007", "order": 7, "role": "body", "text": "Howard also became the first player with a 30-30 game against the Nets since Kareem Abdul-Jabbar did it for the Los Angeles Lakers on Feb. 3, 1978, when he had 37 points and 30 rebounds."}
{"game_id": "0021701067", "chunk_id": "0021701067_008", "order": 8, "role": "body", "text": "\"I mean that's great to be named with someone like Kareem,\" Howard said. \"It's one of the guys I looked up to growing up, him and Wilt Chamberlain.\""}
{"game_id": "0021701067", "chunk_id": "0021701067_009", "order": 9, "role": "body", "text": "Walker scored 10 of his 24 points in the fourth quarter for the Hornets, who trailed by as many 23 points in the second half but rallied to win in front of an announced crowd of 10,231 at Barclay Center while a heavy snowfall outside blanketed the New York City area."}
{"game_id": "0021701067", "chunk_id": "0021701067_010", "order": 10, "role": "body", "text": "Trailing 105-102 after a pair of free throws from D'Angelo Russell with 2:14 left in regulation, the Hornets tightened up on defense and went on a 9-0 run to pull off the impressive comeback."}
{"game_id": "0021701067", "chunk_id": "0021701067_011", "order": 11, "role": "body", "text": "Jeremy Lamb, who had 17 points to help end Charlotte's two-game losing streak, made a layup to cut the deficit to 105-104. The Hornets then called a timeout after a miss by Caris LeVert with 23 seconds left."}
{"game_id": "0021701067", "chunk_id": "0021701067_012", "order": 12, "role": "body", "text": "Brooklyn missed its last five shots of the game."}
{"game_id": "0021701067", "chunk_id": "0021701067_013", "order": 13, "role": "body", "text": "Despite having made just five of his first 24 shots on the night, on the ensuing possession, Walker got the green light from Hornets coach Steve Clifford. The Bronx native, who starred at Rice High School in Harlem, spun around Quincy Acy and capped a three-point play to put Charlotte up 107-105, the Hornets' first lead of the night since a 16-15 advantage with 5:46 in the opening quarter."}
{"game_id": "0021701067", "chunk_id": "0021701067_014", "order": 14, "role": "body", "text": "\"I'd been struggling the whole night, but guys are confident in me and that's all that matters,\" Walker said. \"Coach still wanted me to be the one to take the shot.\""}
{"game_id": "0021701067", "chunk_id": "0021701067_015", "order": 15, "role": "body", "text": "LeVert then missed a chance to tie it when he was met by Howard under the basket. Howard then hit a pair of free throws to make it 109-105."}
{"game_id": "0021701067", "chunk_id": "0021701067_016", "order": 16, "role": "body", "text": "Russell scored 19 points and LeVert added 11 for the Nets, whose two-game winning streak was snapped. They have yet to have won three consecutive this season."}
{"game_id": "0021701067", "chunk_id": "0021701067_017", "order": 17, "role": "body", "text": "\"We've done a great job the last two games locking down in the fourth quarter and tonight we didn't,\" Brooklyn coach Kenny Atkinson said."}
{"game_id": "0021701067", "chunk_id": "0021701067_018", "order": 18, "role": "body", "text": "Brooklyn used a stellar defensive effort to take a 62-43 lead into halftime before everything fell apart in the last 18 minutes of the game. The Hornets were limited to 16-for-44 shooting from the field and committed 10 turnovers."}
{"game_id": "0021701067", "chunk_id": "0021701067_019", "order": 19, "role": "body", "text": "The Nets led 82-59 after Carroll's layup with 6:13 left in the third quarter before the Hornets started to chip away as Howard had nine points to pace a 16-5 run to head into the fourth quarter trailing 87-75."}
{"game_id": "0021701067", "chunk_id": "0021701067_020", "order": 20, "role": "body", "text": "Charlotte then outscored the Nets 36-18 the rest of the way."}
{"game_id": "0021701067", "chunk_id": "0021701067_022", "order": 22, "role": "body", "text": "Chamberlain leads the career list with 124 games of at least 30 points and 30 rebounds, according to the Elias Sports Bureau. It has been done 32 times by a select list of players that includes Love, Abdul-Jabbar, Moses Malone and Robert Parish."}
{"game_id": "0021701067", "chunk_id": "0021701067_024", "order": 24, "role": "body", "text": "Hornets: Cody Zeller remained out due to left knee soreness. He has missed his last six games. ... Nicolas Batum missed his second straight game because of tendinitis in his left Achilles. Lamb again started in his place."}
{"game_id": "0021701067", "chunk_id": "0021701067_025", "order": 25, "role": "body", "text": "Nets: Rondae Hollis-Jefferson had 13 points."}
{"game_id": "0021701067", "chunk_id": "0021701067_027", "order": 27, "role": "body", "text": "Hornets: Host Memphis on Thursday night."}
{"game_id": "0021701067", "chunk_id": "0021701067_028", "order": 28, "role": "closing", "text": "Nets: Visit Toronto on Friday night."}
