{"game_id": "0021100021", "chunk_id": "0021100021_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  With two wins in two nights, Marcus Camby joked that he and the Portland Trail Blazers were ready to play again the next day."}
{"game_id": "0021100021", "chunk_id": "0021100021_002", "order": 2, "role": "body", "text": "LaMarcus Aldridge was having none of it."}
{"game_id": "0021100021", "chunk_id": "0021100021_003", "order": 3, "role": "body", "text": "\"He can play by himself,\" Aldridge said. \"I need a day off.\""}
{"game_id": "0021100021", "chunk_id": "0021100021_004", "order": 4, "role": "body", "text": "Aldridge was only half-kidding after scoring 24 points and grabbing eight rebounds as the Trail Blazers beat the Sacramento Kings 101-79 Tuesday night."}
{"game_id": "0021100021", "chunk_id": "0021100021_005", "order": 5, "role": "body", "text": "Gerald Wallace had 25 points, eight rebounds and five assists for the Blazers. Nicolas Batum added 15 points and five rebounds off the bench. Portland gets a day off before concluding its three-game homestand Thursday against Denver."}
{"game_id": "0021100021", "chunk_id": "0021100021_006", "order": 6, "role": "body", "text": "The Kings led for much of the first half but made just 9 of 38 shots after halftime. Sacramento had just 14 points in the final quarter."}
{"game_id": "0021100021", "chunk_id": "0021100021_007", "order": 7, "role": "body", "text": "\"We had our moments in the first 16, 18, 20 minutes then we fell apart,\" Sacramento coach Paul Westphal said. \"This was a step in our development that was painful. We got taught by a more experienced team that is far above us now.\""}
{"game_id": "0021100021", "chunk_id": "0021100021_008", "order": 8, "role": "body", "text": "DeMarcus Cousins led the way for Sacramento (1-1) with 16 points and 11 rebounds. Marcus Thornton added 14 points and Jason Thompson had 11. The Kings committed 23 fouls and 20 turnovers for the game."}
{"game_id": "0021100021", "chunk_id": "0021100021_009", "order": 9, "role": "body", "text": "The Kings have the youngest opening-day roster in the NBA with an average age of 24.347 years. Ten of the Kings have played two seasons or less in the NBA."}
{"game_id": "0021100021", "chunk_id": "0021100021_010", "order": 10, "role": "body", "text": "Both teams were playing after opening their seasons on Monday. The Kings beat the Los Angeles Lakers 100-91 behind Thornton's 27 points. Portland managed a 107-103 win over Philadelphia."}
{"game_id": "0021100021", "chunk_id": "0021100021_011", "order": 11, "role": "body", "text": "\"I felt kind of sluggish in the beginning, kinda had dead legs,\" Aldridge said. \"I just played through it and I felt really good in the second half.\""}
{"game_id": "0021100021", "chunk_id": "0021100021_012", "order": 12, "role": "body", "text": "The Kings were in control early, getting baskets from seven of eight players in the opening quarter and leading by as many as 10 in the second. However, the Blazers erased the gap with a 16-6 run and went into halftime tied at 46."}
{"game_id": "0021100021", "chunk_id": "0021100021_013", "order": 13, "role": "body", "text": "The Blazers took a 76-65 lead on the first basket of the fourth. Batum finished a fast-break with a layup to make it 88-73 with 4:38 remaining."}
{"game_id": "0021100021", "chunk_id": "0021100021_014", "order": 14, "role": "body", "text": "\"We moved the ball way better in the first half,\" Thompson said. \"We didn't move it around in the second half, and sometimes when we didn't have things going they started to build a lead on us.\""}
{"game_id": "0021100021", "chunk_id": "0021100021_015", "order": 15, "role": "closing", "text": "Game notes Portland has won 10 of its last 11 against the Kings. ... The Kings made only 3 of 16 3-pointers while Portland was just 3 of 18. ... Sacramento reserve J.J Hickson, picked up in a deal with Cleveland, had 10 points and five rebounds."}
