{"game_id": "0021700388", "chunk_id": "0021700388_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  After alternating wins and losses over the previous 10 games, the Minnesota Timberwolves were simply satisfied to pull out a victory against the Mavericks that stopped the back-and-forth swing."}
{"game_id": "0021700388", "chunk_id": "0021700388_002", "order": 2, "role": "body", "text": "Dallas lamented missed opportunities and a chance to continue its improved play of late."}
{"game_id": "0021700388", "chunk_id": "0021700388_003", "order": 3, "role": "body", "text": "Karl-Anthony Towns had 28 points, Jimmy Butler scored 10 of his 22 in the fourth quarter and Minnesota held on for a 97-92 win Sunday night."}
{"game_id": "0021700388", "chunk_id": "0021700388_004", "order": 4, "role": "body", "text": "\"Just win, win the game,\" Timberwolves coach Tom Thibodeau said. \"Dallas has played well. If you watch their games, you would know how tough they've been playing. So I knew it was going to be a hard-fought game.\""}
{"game_id": "0021700388", "chunk_id": "0021700388_005", "order": 5, "role": "body", "text": "Towns added 12 rebounds, including four on the offensive end, for his NBA-leading 21st double-double of the season. Minnesota committed 18 turnovers but hit four free throws at the end to pull away in a game in which no team led by more than six points."}
{"game_id": "0021700388", "chunk_id": "0021700388_006", "order": 6, "role": "body", "text": "Jamal Crawford had 16 points off the bench for the Timberwolves (16-11), who won back-to-back games for the first time since Nov. 15-17."}
{"game_id": "0021700388", "chunk_id": "0021700388_007", "order": 7, "role": "body", "text": "\"They're not always going to be pretty wins,\" Crawford said. \"When you go through tough stretches and still find a way to win, I think that says a lot about your group.\""}
{"game_id": "0021700388", "chunk_id": "0021700388_008", "order": 8, "role": "body", "text": "Harrison Barnes scored 19 and Maxi Kleber tied a career high with 16 points for Dallas, which has lost three in a row. The Mavericks, who had won four of six before the skid, shot 41 percent in the second half despite going 8 of 19 on 3-pointers."}
{"game_id": "0021700388", "chunk_id": "0021700388_009", "order": 9, "role": "body", "text": "\"We can't complain with the shots,\" Barnes said. \"We had layups, we had open 3s, open 2s. Our shots didn't fall. From an execution standpoint we did everything we're supposed to do.\""}
{"game_id": "0021700388", "chunk_id": "0021700388_010", "order": 10, "role": "body", "text": "J.J. Barea sparked Dallas with 14 of his 16 in the second half, including a driving bank shot with two minutes left to give the Mavericks their final lead at 90-89. Butler followed with a turnaround jumper to put Minnesota back in front."}
{"game_id": "0021700388", "chunk_id": "0021700388_011", "order": 11, "role": "body", "text": "Barea added a pair of free throws with 24.9 seconds left to pull Dallas to 93-92. But Crawford and Taj Gibson each hit a pair of free throws to secure the victory for Minnesota, its third in the past four games."}
{"game_id": "0021700388", "chunk_id": "0021700388_012", "order": 12, "role": "body", "text": "\"The best part is we found a way to win, so we'll take the positives as they are,\" Towns said."}
{"game_id": "0021700388", "chunk_id": "0021700388_014", "order": 14, "role": "body", "text": "Mavericks: Dirk Nowitzki played his 65th regular-season game against Minnesota, the most for any player. Nowitzki scored 10 points in 25:22. It was the 1,421st game of his career, leaving him three behind Kevin Willis for sixth on the NBA's all-time list. ... Six players scored in double figures for Dallas. ... Antonius Cleveland was the first player off the bench for the Mavericks and played a career-high 17:51. He helped hold Andrew Wiggins to 1-of-9 shooting early."}
{"game_id": "0021700388", "chunk_id": "0021700388_015", "order": 15, "role": "body", "text": "Timberwolves: Reserve F Nemanja Bjelica missed his ninth straight game with a left mid-foot sprain. ... Minnesota opened a five-game homestand. The Wolves are 13-5 at home this season, including 7-0 against Western Conference teams. ... Wiggins came through with two big buckets late in the fourth quarter after his slow start. He finished with 10 points. He's been held to single digits just one time this season."}
{"game_id": "0021700388", "chunk_id": "0021700388_017", "order": 17, "role": "body", "text": "Dennis Smith Jr. missed his second straight game with a left hip strain, and Mavericks coach Rick Carlisle didn't have a timeframe on when his rookie point guard might be able to return. Smith is going back to Dallas to see a doctor."}
{"game_id": "0021700388", "chunk_id": "0021700388_018", "order": 18, "role": "body", "text": "\"He's getting a little better each day, but I'm not going to give you any timetables right now,\" Carlisle said. \"Him being 100 percent healthy is the No. 1 priority. That's what's got to be our focus.\""}
{"game_id": "0021700388", "chunk_id": "0021700388_019", "order": 19, "role": "body", "text": "Smith, the No. 9 pick in the draft, is averaging 14.4 points and 4.0 assists per game."}
{"game_id": "0021700388", "chunk_id": "0021700388_021", "order": 21, "role": "body", "text": "Towns went down hard and was favoring his right leg before coming out with 3:04 remaining. He was checked by team trainers and returned later."}
{"game_id": "0021700388", "chunk_id": "0021700388_022", "order": 22, "role": "body", "text": "\"It don't matter,\" Towns said. \"I'll see you guys on Tuesday. The streak continues.\""}
{"game_id": "0021700388", "chunk_id": "0021700388_024", "order": 24, "role": "body", "text": "Mavericks: Return home against San Antonio on Tuesday."}
{"game_id": "0021700388", "chunk_id": "0021700388_025", "order": 25, "role": "body", "text": "Timberwolves: Host the Philadelphia 76ers on Tuesday."}
{"game_id": "0021700388", "chunk_id": "0021700388_027", "order": 27, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
