{"game_id": "0021400490", "chunk_id": "0021400490_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  When the Indiana Pacers lost to the Milwaukee Bucks in November, C.J. Miles failed to score, missing all eight of his shots."}
{"game_id": "0021400490", "chunk_id": "0021400490_002", "order": 2, "role": "body", "text": "He had a much better time in their second game of the season."}
{"game_id": "0021400490", "chunk_id": "0021400490_003", "order": 3, "role": "body", "text": "Miles scored 22 points and Roy Hibbert had 18, leading Indiana to a 94-91 win at Milwaukee on Friday night."}
{"game_id": "0021400490", "chunk_id": "0021400490_004", "order": 4, "role": "body", "text": "The Pacers had five players score in double figures in their fifth win in seven games. Luis Scola had 14 points, and Rodney Stuckey finished with 11."}
{"game_id": "0021400490", "chunk_id": "0021400490_005", "order": 5, "role": "body", "text": "Miles was 6 for 9 from 3-point range. He was averaging 11.5 points coming into the night."}
{"game_id": "0021400490", "chunk_id": "0021400490_006", "order": 6, "role": "body", "text": "\"Being able to step up and make shots like that, that's the fun part,\" Miles said. \"One of them was in transition and the other was nearing the end of the shot clock and I knew I was going to have to create something. I just took advantage of my height.\""}
{"game_id": "0021400490", "chunk_id": "0021400490_007", "order": 7, "role": "body", "text": "Donald Sloan added 10 points, eight rebounds and six assists for Indiana, which lost 87-81 to Milwaukee on Nov. 4."}
{"game_id": "0021400490", "chunk_id": "0021400490_008", "order": 8, "role": "body", "text": "\"We have some guys out so you have to have that next-man-up mentality and some guys have to play more,\" Pacers coach Frank Vogel said. \"That makes those wins more fun. They mean more, they're more enjoyable. This is one of them.\""}
{"game_id": "0021400490", "chunk_id": "0021400490_009", "order": 9, "role": "body", "text": "Indiana trailed by seven at the break, but held Milwaukee to 15 points in the third and went ahead to stay in the final period."}
{"game_id": "0021400490", "chunk_id": "0021400490_010", "order": 10, "role": "body", "text": "The Bucks pulled within three with 5.2 seconds remaining, but Solomon Hill made two foul shots to help the Pacers hold on."}
{"game_id": "0021400490", "chunk_id": "0021400490_011", "order": 11, "role": "body", "text": "Brandon Knight had 20 points for Milwaukee, and John Henson finished with 14. Zaza Pachulia had 12 points and 14 rebounds."}
{"game_id": "0021400490", "chunk_id": "0021400490_012", "order": 12, "role": "body", "text": "The Bucks hit 65 percent of their shots while outscoring the Pacers 32-23 in the second quarter for a 53-46 halftime lead."}
{"game_id": "0021400490", "chunk_id": "0021400490_013", "order": 13, "role": "body", "text": "Milwaukee led by two after three quarters, but Sloan's 3-pointer put Indiana in front 73-72 early in the fourth. Lavoy Allen made a jumper and Hibbert connected on two foul shots to make it 85-78 with 2:32 remaining."}
{"game_id": "0021400490", "chunk_id": "0021400490_015", "order": 15, "role": "body", "text": "Pacers: Starting point guard George Hill, who returned on Dec. 23 after being sidelined since the start of the season with knee and quadriceps injuries, sat out with a groin strain. Vogel said Hill's long layoff could have contributed to the injury. The team is awaiting results of an MRI. ... Backup point guard C.J. Watson also sat out with a foot injury."}
{"game_id": "0021400490", "chunk_id": "0021400490_016", "order": 16, "role": "body", "text": "Bucks: Forward Ersan Ilyasova remained sidelined with a concussion. \"He's out for a while. He's progressing. He's riding a bike, but he's got a ways to go,\" coach Jason Kidd said. ... Guard Jerryd Bayless returned after missing one game with knee soreness."}
{"game_id": "0021400490", "chunk_id": "0021400490_018", "order": 18, "role": "body", "text": "Bucks center Larry Sanders missed his fifth consecutive game. The team had been insisting that Sanders was dealing with an undisclosed illness, but Kidd said Friday during his pregame availability that Sanders was out due to \"personal reasons.\""}
{"game_id": "0021400490", "chunk_id": "0021400490_019", "order": 19, "role": "body", "text": "\"It's just personal. There's nothing I can give you. That's the way the question will be answered,\" Kidd said."}
{"game_id": "0021400490", "chunk_id": "0021400490_020", "order": 20, "role": "body", "text": "Kidd said there is no timetable for Sanders' return. He also said Sanders hasn't been participating in any team activities."}
{"game_id": "0021400490", "chunk_id": "0021400490_021", "order": 21, "role": "body", "text": "Pachulia, whose has a locker next to Sanders, said he didn't have much information to share about his teammate."}
{"game_id": "0021400490", "chunk_id": "0021400490_022", "order": 22, "role": "body", "text": "\"Whenever Larry comes back, his locker is still here,\" he said. \"It's up to him.\""}
{"game_id": "0021400490", "chunk_id": "0021400490_024", "order": 24, "role": "body", "text": "Milwaukee's reserves have played well this season, but Indiana's backups matched their counterparts with 42 points, due in large part to Miles' performance."}
{"game_id": "0021400490", "chunk_id": "0021400490_025", "order": 25, "role": "body", "text": "\"Usually, our bench comes in and dominates,\" Bucks forward Jared Dudley said."}
{"game_id": "0021400490", "chunk_id": "0021400490_027", "order": 27, "role": "body", "text": "Pacers: Visit the Los Angeles Lakers on Sunday."}
{"game_id": "0021400490", "chunk_id": "0021400490_028", "order": 28, "role": "closing", "text": "Bucks: Visit the New York Knicks on Sunday."}
