{"game_id": "0021400119", "chunk_id": "0021400119_001", "order": 1, "role": "lead", "text": "TORONTO -- Derrick Rose was in Chicago's starting lineup for the second straight game. He finished it on the bench, nursing another leg injury.\nPau Gasol had a season-high 27 points and 11 rebounds, Rose scored 20 points before leaving with a sore left hamstring, and the Bulls beat the Toronto Raptors 100-93 on Thursday night.\n\"I think it's minor,\" said Rose, who was injured when he slipped and fell on a drive late in the fourth quarter.\n\"I just overstepped. I probably stretched out a little bit more with my left leg and I probably got a cramp in it.\"\nRose, who said he'll treat the injury with ice and muscle stimulation, also said it was too early to say whether he'd be ready for Saturday's home game against Indiana.\n\"He'll be evaluated when we get back (to Chicago),\" Bulls coach Tom Thibodeau said. \"They'll make sure everything is good. He says he just tweaked it and everything is fine.\"\nJimmy Butler scored 21 and Mike Dunleavy had 14 as the Bulls won for the sixth time in seven games, and snapped Toronto's five-game winning streak in the matchup of teams with the best records in the Eastern Conference. Both teams are 7-2.\n\"Jimmy played a terrific game,\" Thibodeau said.\nChicago's coach was just as happy with Gasol, who posted his sixth double-double in nine games.\n\"You can't say enough about him, just the way he sets the tone for the team,\" Thibodeau said.\nStarting his second straight game after missing four of the previous five with a pair of sprained ankles, Rose was replaced by Dunleavy with 1:53 left, taking a seat at the end of the bench.\n\"We were up a decent amount of points at that time,\" Rose said. \"I kind of didn't force it, I listened to the staff and sat out.\"\nKyle Lowry scored 20 and James Johnson had 16 against his former team, but the Raptors lost for the first time in six home games this season.\nRaptors guard DeMar DeRozan struggled with his shooting for the second straight game. DeRozan, who shot 4 for 15 in Tuesday's win over Orlando, went 3 for 17 against Chicago.\nToronto trailed by as many as 18 before Amir Johnson's fast-break dunk cut the gap to 93-88 with 1:44 to go.\nButler stopped the run with a jumper, James Johnson answered with a reverse layup, but Terrence Ross fouled Dunleavy on a 3-pointer with less than a minute left. Dunleavy made two of three to give Chicago a 97-90 lead.\nChicago led 25-24 after one, but Toronto's reserves started the second quarter with an 11-2 run, spurred by eight points from James Johnson, to lead 35-27. Johnson scored 12 points in the second but Gasol had 13 for the Bulls. The Raptors led 52-45 at halftime.\n\"James Johnson hurt us badly,\" Thibodeau said.\nThe Bulls opened the third with a 13-4 run, and a 3 by Dunleavy with 7:29 remaining gave Chicago a 58-56 lead. The Bulls made 12 of 18 field goal attempts in the third, outscoring the Raptors 35-14, to take an 80-66 lead into the fourth.\n\"The third quarter did us in,\" Raptors coach Dwane Casey said.\n---\nTIP-INS\nBulls: The road team has won the past six meetings between the two teams. ... Chicago improved to 5-0 on the road. ... The Bulls outrebounded Toronto 48-38. ... Chicago reached 100 points for the seventh time in nine games.\nRaptors: DeRozan passed Andrea Bargnani for third place on Toronto's career scoring list. He trails Vince Carter and Chris Bosh. ... Tyler Hansbrough left the game with a sore lower back after falling heavily in a collision with Joakim Noah early in the fourth. ... F Landry Fields missed his second straight game with flu-like symptoms. Rookie C Lucas Nogueira dressed in place of Fields.\nPREACHING PATIENCE\nBefore the game, Thibodeau said it's unfair to criticize Rose's plan to manage his injury-ravaged body. \"He's navigating through coming back off of 2 1/2 years off,\" Thibodeau said. \"It's a lot. I think everyone has to take a step back and be patient and let him go through this process. He's going to be special again, just be patient.\"\nFAMOUS FACES\nActor Donald Sutherland and Toronto Maple Leafs forward Phil Kessel attended the game.\nUP NEXT\nBulls: Host Indiana on Saturday.\nRaptors: Host Utah on Saturday"}
