{"game_id": "0021700724", "chunk_id": "0021700724_001", "order": 1, "role": "lead", "text": "DETROIT --  Carmelo Anthony made a free throw for his 25,000th point, and although there was no real reaction from the crowd in Detroit, the Oklahoma City star slapped hands with teammates and raised his right hand with pride."}
{"game_id": "0021700724", "chunk_id": "0021700724_002", "order": 2, "role": "body", "text": "\"It's a special moment,\" Anthony said. \"To kind of know what it took to get to this point and the amount of work that was put in to get to this point, the teammates that I've played with over the years, and for me to still be at a point in my career where I still have a lot more to go.\""}
{"game_id": "0021700724", "chunk_id": "0021700724_003", "order": 3, "role": "body", "text": "Anthony became the 21st NBA player to reach the 25,000-point mark , and Russell Westbrook added 31 points, 13 assists and 11 rebounds to lift the surging Thunder to a 121-108 victory over the Detroit Pistons on Saturday night. Although it was a night of triumph for Anthony, Oklahoma City lost guard Andre Roberson to what looked like a serious leg injury in the third quarter."}
{"game_id": "0021700724", "chunk_id": "0021700724_004", "order": 4, "role": "body", "text": "Anthony scored his 25,000th point with 8:30 left in the third. He would add four more points and finish the game with 21. Paul George, who was named to the All-Star team Saturday, scored 26 points, and Westbrook was impressive throughout."}
{"game_id": "0021700724", "chunk_id": "0021700724_005", "order": 5, "role": "body", "text": "\"That's a really good basketball team, and when those three get rolling, it is hard to stop them,\" Detroit's Tobias Harris said. \"We had a chance going into the second half, but we were stagnant against a really good defense, and then we couldn't get a stop, so we were always taking the ball out of the net.\""}
{"game_id": "0021700724", "chunk_id": "0021700724_006", "order": 6, "role": "body", "text": "Anthony's milestone moment was part of a 15-0 run for the Thunder at the start of the second half that pushed their lead to 27, but Roberson was taken off on a stretcher later in the third after landing hard on the court. His left leg seemed to give way as he was beginning to jump for an alley-oop, and he sailed through the air and appeared to land on his tailbone or lower back."}
{"game_id": "0021700724", "chunk_id": "0021700724_007", "order": 7, "role": "body", "text": "Coach Billy Donovan said it's a patellar tendon injury, and the Thunder would find out more after returning to Oklahoma. The scary injury put a damper on Oklahoma City's seventh straight victory. It's the NBA's longest current winning streak."}
{"game_id": "0021700724", "chunk_id": "0021700724_008", "order": 8, "role": "body", "text": "A group of five Detroit backups helped cut the deficit to nine around the midway point of the fourth, but Oklahoma City was able to hold on."}
{"game_id": "0021700724", "chunk_id": "0021700724_009", "order": 9, "role": "body", "text": "\"I think Dre's situation probably took a lot out of us,\" Donovan said. \"We lost a little bit there, and rightfully so.\""}
{"game_id": "0021700724", "chunk_id": "0021700724_010", "order": 10, "role": "body", "text": "Detroit has dropped seven in a row, the league's longest current skid. The Pistons now face back-to-back games against LeBron James and the Cavaliers."}
{"game_id": "0021700724", "chunk_id": "0021700724_012", "order": 12, "role": "body", "text": "Detroit's reserves actually outscored Oklahoma City's 64-25, but the Thunder's starters outscored Detroit's 96-44."}
{"game_id": "0021700724", "chunk_id": "0021700724_013", "order": 13, "role": "body", "text": "\"Their starters just dominated us,\" Pistons coach Stan Van Gundy said. \"When those three are playing like that, you aren't going to be able to stop them, but we had to do a much better job of doing the things we could control. We didn't do a good job of getting back on defense and we didn't do a good job on the boards.\""}
{"game_id": "0021700724", "chunk_id": "0021700724_015", "order": 15, "role": "body", "text": "The Pistons infamously picked Darko Milicic over Anthony in the 2003 draft, and Anthony hasn't forgotten."}
{"game_id": "0021700724", "chunk_id": "0021700724_016", "order": 16, "role": "body", "text": "\"I was thinking about it after the game, the irony of me getting 25,000 points here in Detroit, knowing after that '03 draft, what things could have been,\" he said."}
{"game_id": "0021700724", "chunk_id": "0021700724_018", "order": 18, "role": "body", "text": "Thunder: It was the 15th triple-double of the season for Westbrook and the 94th of his career."}
{"game_id": "0021700724", "chunk_id": "0021700724_019", "order": 19, "role": "body", "text": "Pistons: F Reggie Bullock (right thumb sprain) returned after a one-game absence and scored 16 points. Harris led Detroit with 21."}
{"game_id": "0021700724", "chunk_id": "0021700724_021", "order": 21, "role": "body", "text": "Thunder: Host the Philadelphia 76ers on Sunday night."}
{"game_id": "0021700724", "chunk_id": "0021700724_022", "order": 22, "role": "body", "text": "Pistons: Visit the Cavaliers on Sunday night."}
{"game_id": "0021700724", "chunk_id": "0021700724_024", "order": 24, "role": "body", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
{"game_id": "0021700724", "chunk_id": "0021700724_026", "order": 26, "role": "closing", "text": "Follow Noah Trister at www.Twitter.com/noahtrister"}
