{"game_id": "0021400434", "chunk_id": "0021400434_001", "order": 1, "role": "lead", "text": "ATLANTA -- Jared Dudley's shooting was perfect, even if his coach wouldn't quite say his game was.\nDudley made all 10 shots, including four 3-pointers, and scored a season-high 24 points Friday night to lead the Milwaukee Bucks to a 107-77 victory over the Atlanta Hawks.\nDudley matched Brooklyn's Jarrett Jack for the best-shooting night in the NBA this season.\n\"I can't say it was a perfect game because as a coach you always want more, but it was as close to a no-hitter as you can come to,\" Bucks coach Jason Kidd. \"I thought he was great tonight on both ends.\"\nAccording to the Elias Sports Bureau, Dudley is the first player in NBA history to shoot 100 percent from the field with at least 10 field goal attempts, including at least three 3-point attempts.\nBrandon Knight added 16 points for Milwaukee, which snapped Atlanta's five-game winning streak.\nThe Hawks had won 14 of 15 but were routed in front of a rare sellout crowd at home, where they entered with a 13-2 record that was the best in the Eastern Conference.\nAfter Dudley made back-to-back 3-pointers for a 21-18 Milwaukee lead with 2:51 left in the first quarter, the Bucks led the rest of the way and went ahead by 30 in the final period.\nMilwaukee (15-15) had lost three of four, seven straight to Atlanta and five straight in Philips Arena, yet dominated most of a night.\nPerhaps the Bucks' players-only meeting before the game helped.\n\"I think, yeah, any time the guys are disappointed in their performance, that shows you a team that cares,\" said Dudley, who added a season-high four of Milwaukee's 15 steals. \"I want to say nine of them were open (shots).\n\"I had good looks, I made them, my teammates kept looking for me. ... I don't know if I'll ever shoot that again but it was good to be able to say I did it.\"\nPaul Millsap led the Hawks with 22 points and 11 rebounds. Atlanta was coming off successive victories over Chicago, Cleveland, Houston, Dallas and the Los Angeles Clippers.\nThe teams meet again Saturday night in Milwaukee.\nAtlanta's 77 points were a season low, and the Hawks committed a season-high 23 turnovers that led to 30 Milwaukee points.\nThe Bucks led 58-42 at halftime, and the Hawks never came closer than 14 points in the second half. They trailed by as many as 32 in the fourth quarter.\n\"I think you've got to give Milwaukee a lot of credit tonight. They shot the ball really well, and did some different things,\" Atlanta coach Mike Budenholzer said after the Hawks shot just 40.8 percent and allowed the Bucks to shoot 50.6.\nMilwaukee's bench continued its recent strong play in the second period, as Dudley, Jerryd Bayless, O.J. Mayo and John Henson outscored Atlanta's subs 32-7 in the first half.\nOther than Millsap, who made all eight of his shots in the first half to score 18, the rest of the Hawks shot 9-for-30 (30 percent).\nTIP-INS\nBucks: Milwaukee is 4-0 with Zaza Pachulia in the starting lineup. He scored all of his 14 points in the second half. ... Kidd believes Mayo plays better with Milwaukee's second unit. ... Ersan Ilyasova missed the game after suffering a concussion in Tuesday's loss to the Hornets. That was his first game after missing nine straight following a Dec. 2 nasal fracture and then undergoing surgery.\nHawks: Atlanta's 77 points were a season low by 10. ... After scoring a career-high 25 points in the Hawks' win over the Clippers on Tuesday, forward DeMarre Carroll missed all six of his shots and went scoreless. ... Jeff Teague returned to the starting lineup after missing three games with a hamstring pull, and then coming off the bench behind Dennis Schroder in Tuesday's win.\nROOKIE ROUNDUP\nRookie forward/center Adrien Payne made his NBA debut for Atlanta, grabbing three rebounds and scoring two points. The Hawks drafted him 15th overall in June. The 6-foot-10 former Michigan State star missed his first five NBA games with plantar fasciitis and was assigned to the NBA D-League three times, averaging 13.4 points, 8.8 rebounds and 2.3 assists in 11 games.\n\"Adrien's been working hard, and his length and his activity, his ability to do things around the basket and step away ..  is going to be something that can help us,\" Budenholzer said.\nUP NEXT\nBucks: Host Atlanta on Saturday.\nHawks: Visit Milwaukee on Saturday.\nThe Associated Press contributed to this report."}
