{"game_id": "0021700378", "chunk_id": "0021700378_001", "order": 1, "role": "lead", "text": "ATLANTA --  Ersan Ilyasova was flawless almost from start to finish Saturday night, and Kent Bazemore was perfect in the final minute for the Atlanta Hawks. They needed it to overcome Nikola Vucevic's first career triple-double."}
{"game_id": "0021700378", "chunk_id": "0021700378_002", "order": 2, "role": "body", "text": "Pretty as it was to watch Ilyasova score 26 points while making all nine of his shots, including five 3-pointers, Bazemore stole the show in scoring six points in an 18-second span in the final minute -- four on dunks after steals -- in Atlanta's 117-110 vicrtory over Orlando."}
{"game_id": "0021700378", "chunk_id": "0021700378_003", "order": 3, "role": "body", "text": "The game was tied at 110 before Bazemore, a forward known for his defense, did his thing. Twice he picked off Magic passes and quickly threw them down."}
{"game_id": "0021700378", "chunk_id": "0021700378_004", "order": 4, "role": "body", "text": "\"We made winning plays in the last 90 seconds,\" said Hawks coach Mike Budenholzer. \"Kent Bazemore . . . his activity, his competitiveness. ... Obviously, the steal in the middle of the court, but the activity, length, and arms on the inbounds makes it difficult (on the Magic).\""}
{"game_id": "0021700378", "chunk_id": "0021700378_005", "order": 5, "role": "body", "text": "The Hawks (6-19) needed something special to win for the second time in six games, even though the Magic (12-17) lacked their two leading scorers."}
{"game_id": "0021700378", "chunk_id": "0021700378_006", "order": 6, "role": "body", "text": "Aaron Gordon (18.5 points per game) suffered a concussion in Friday's loss to the Nuggets, and Evan Fournier (18.3) remained sidelined with a sprained ankle."}
{"game_id": "0021700378", "chunk_id": "0021700378_007", "order": 7, "role": "body", "text": "Still, Orlando took the lead three times in the fourth quarter and the Hawks -- with three injured big men inactive -- had no answer for Vucevic as he registered game highs with 31 points, 13 rebounds and 10 assists. The 7-foot center made 4 of 6 3-pointers."}
{"game_id": "0021700378", "chunk_id": "0021700378_008", "order": 8, "role": "body", "text": "Plus, Johnathan Simmons added a career-high 29 points for Orlando."}
{"game_id": "0021700378", "chunk_id": "0021700378_009", "order": 9, "role": "body", "text": "Ilyasova scored 10 of Atlanta's first 14 points and had 13 in the first period."}
{"game_id": "0021700378", "chunk_id": "0021700378_010", "order": 10, "role": "body", "text": "He was irked about missing 2-of-4 free throws in the fourth quarter. Ilyasova made his only free throw before that, added four assists and three rebounds and did not turn the ball over."}
{"game_id": "0021700378", "chunk_id": "0021700378_011", "order": 11, "role": "body", "text": "\"Not really,\" Ilyasova said when asked if he had a special feeling going into the game. \"It was one of those nights, I guess. Obviously, everybody came out with a lot of energy. You have to give them credit; the Magic obviously (had) a back-to-back."}
{"game_id": "0021700378", "chunk_id": "0021700378_012", "order": 12, "role": "body", "text": "\"We kind of knew we had to go at them at the beginning of the game . . . those free throws, I was kind of disappointed.\""}
{"game_id": "0021700378", "chunk_id": "0021700378_013", "order": 13, "role": "body", "text": "Atlanta shot 51.2 percent in the game, and tied a season high with 17 made 3-pointers on 33 attempts."}
{"game_id": "0021700378", "chunk_id": "0021700378_014", "order": 14, "role": "body", "text": "Bazemore (19 points) made three 3-pointers, and point guard Dennis Schroeder added 18 points with seven assists."}
{"game_id": "0021700378", "chunk_id": "0021700378_015", "order": 15, "role": "body", "text": "Schroeder tied the game with a pair of free throws at the 56-second mark."}
{"game_id": "0021700378", "chunk_id": "0021700378_017", "order": 17, "role": "body", "text": "He stole a pass from Simmons to Vucevic and took it two-thirds of the court to dunk for the lead with 36 seconds remaining."}
{"game_id": "0021700378", "chunk_id": "0021700378_018", "order": 18, "role": "body", "text": "\"Bazemore made huge plays; a lot of credit to them,\" Vucevic said. \"That was a big play by him, to time that right.\""}
{"game_id": "0021700378", "chunk_id": "0021700378_019", "order": 19, "role": "body", "text": "After he was fouled following his rebound of an airball by former Hawk Shelvin Mack, Bazemore added a pair of free throws with 21 seconds left, and Orlando head coach Frank Vogel called timeout."}
{"game_id": "0021700378", "chunk_id": "0021700378_020", "order": 20, "role": "body", "text": "Next, Bazemore stole Mack's inbounds pass from the sideline, and again raced for a dunk with 18 seconds left to put away the Magic."}
{"game_id": "0021700378", "chunk_id": "0021700378_022", "order": 22, "role": "body", "text": "Magic: Vucevic on back-to-back nights combined for 52 points and 30 rebounds after scoring 21 points and grabbing a season-high 17 rebounds in a loss to Denver. . . . In Gordon's place, 6-foot-8 guard/forward Mario Hezonja made his first start. The native of Croatia scored seven points and on 3-of-9 shooting. . . . Orlando had a season-high 39 assists."}
{"game_id": "0021700378", "chunk_id": "0021700378_023", "order": 23, "role": "body", "text": "Hawks: Once again without injured big men Mike Muscala (left ankle sprain), John Collins (sprained shoulder) and Dewayne Dedmon (left tibia stress reaction), the Hawks started Miles Plumlee at center. He finished with three points and three rebounds. . . . Reserve forwards Marco Belinelli (13 points) and rookie Tyler Cavanaugh (14 points) each made three 3-pointers."}
{"game_id": "0021700378", "chunk_id": "0021700378_025", "order": 25, "role": "body", "text": "Magic head coach Frank Vogel surely wasn't happy about the disparity at the free throw line, where the Hawks made 18 of 25 to his team's 7 of 8. \"No comment,\" he said. \"Look, we played hard and played the right way. I'm proud of the effort.\""}
{"game_id": "0021700378", "chunk_id": "0021700378_027", "order": 27, "role": "body", "text": "Magic: Host Los Angeles Clippers on Wednesday night."}
{"game_id": "0021700378", "chunk_id": "0021700378_028", "order": 28, "role": "body", "text": "Hawks: At New York on Sunday night."}
{"game_id": "0021700378", "chunk_id": "0021700378_030", "order": 30, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
