{"game_id": "0021300692", "chunk_id": "0021300692_001", "order": 1, "role": "lead", "text": "NEW YORK -- Finally, somebody stopped Kevin Durant: his coach.\nNot that Durant cared. The only streak he cares about is still intact.\nDurant's 30-point run ended at 12 games when he scored 26 in just 30 minutes, but the Oklahoma City Thunder won their 10th in a row with a 120-95 victory over the Brooklyn Nets on Friday night."}
{"game_id": "0021300692", "chunk_id": "0021300692_002", "order": 2, "role": "body", "text": "\"That's the most important streak,\" Durant said.\nSerge Ibaka made all 12 shots and added 25 points and nine rebounds for the Thunder, who were so good that Durant sat the entire fourth quarter, the only way to slow him down right now.\nDurant came out with 1:15 left in the third quarter. Coach Scott Brooks didn't bother asking the NBA's leading scorer if he wanted to keep playing to extend the streak, saying he knew what the answer would be.\n\"If he cared about the streak, he should've never missed the two shots. That's on him. Can't blame it on me,\" Brooks said.\nDurant finished 10 of 12 from the field, though his scoring average during his sensational January dropped from 36.6 to 35.9. He had been streaking toward Tracy McGrady, who had the last longer streak when he scored 30 in 14 in a row in 2003.\n\"The streak was good while it lasted, but that's the least of my concerns,\" Durant said. \"It's easy for me to try to force it to keep the streak alive, but we needed this win because they beat us last time.\"\nOklahoma City shot 63.6 percent, highest in the league this season, and outrebounded Brooklyn 41-17. The Nets' rebound total was the lowest in NBA history.\nShaun Livingston scored 16 points while drawing the impossible assignment of defending Durant for the Nets, who dropped their final two games to finish 10-3 in January.\nThey started the month by holding Durant to 24 points in a victory at Oklahoma City, but Brooklyn was never in this game."}
{"game_id": "0021300692", "chunk_id": "0021300692_003", "order": 3, "role": "closing", "text": "Reggie Jackson and Thabo Sefolosha scored 14 for the Thunder, on their longest winning streak since a 12-game run early in the 2012-13 season. They dominated the final three quarters in their 112-95 victory at Miami and picked up right where they left off in this one before a sellout crowd of 17,732 that included former President Bill Clinton.\nThey call this a landslide in his field.\nOklahoma City closed the first quarter with the final 13 points, eight from Ibaka and the rest from Durant, for a 30-16 lead. An 11-0 spurt in the second -- with just two points from Durant and Ibaka -- extended it to 45-24, and one more surge late in the period put it away.\nDurant had a jumper and 3-pointer around Jackson's three-point play to extend it to 28, and Durant made a turnaround jumper and another 3-pointer on consecutive possessions late in the half for a 61-30 cushion. Ibaka capped his perfect half with a follow dunk and Oklahoma City led 63-35 at the break.\nBut Durant got only three shots in the second half, making two on alley-oops, before taking a seat for good to get a little extra rest before returning to his hometown Saturday to face Washington.\nThe Nets played without versatile forward Andrei Kirilenko, who would've been one of their best hopes of defending Durant, because of strained right calf. Backup center Andray Blatche left in the second half with a bruised left hip.\nGame notes\nThe Thunder have won six straight road games. ... The Nets visit Indiana on Saturday, facing both conference leaders in a 24-hour span. ... Marquis Teague, acquired from Chicago on Jan. 21, made his Nets debut in the fourth quarter and scored seven points."}
