{"game_id": "0021301205", "chunk_id": "0021301205_001", "order": 1, "role": "lead", "text": "TORONTO --  The Toronto Raptors keep piling up accomplishments."}
{"game_id": "0021301205", "chunk_id": "0021301205_002", "order": 2, "role": "body", "text": "But they realize they have more to do this season."}
{"game_id": "0021301205", "chunk_id": "0021301205_003", "order": 3, "role": "body", "text": "Greivis Vasquez scored 25 points, Kyle Lowry had 24 and the Raptors set a franchise record with their 48th win, beating the Milwaukee Bucks 110-100 on Monday night."}
{"game_id": "0021301205", "chunk_id": "0021301205_004", "order": 4, "role": "body", "text": "\"This is probably the best team I've ever been on,\" Vasquez said."}
{"game_id": "0021301205", "chunk_id": "0021301205_005", "order": 5, "role": "body", "text": "It may well be, but the true measure of Toronto's success will come in their postseason performance."}
{"game_id": "0021301205", "chunk_id": "0021301205_006", "order": 6, "role": "body", "text": "\"We can't just be happy,\" Vasquez said. \"We've got to continue to get better and make a run in the playoffs.\""}
{"game_id": "0021301205", "chunk_id": "0021301205_007", "order": 7, "role": "body", "text": "Toronto remains tied with Chicago, which beat Orlando on Monday, with one game remaining, but the Raptors hold the tiebreaker over the Bulls."}
{"game_id": "0021301205", "chunk_id": "0021301205_008", "order": 8, "role": "body", "text": "If Toronto wins at New York or Chicago loses at Charlotte in Wednesday's season finale, the Raptors will finish as the third seed in the East."}
{"game_id": "0021301205", "chunk_id": "0021301205_009", "order": 9, "role": "body", "text": "\"I know it's ringing hollow but we still have to continue to work to get better,\" Raptors coach Dwane Casey said. \"We're not where we need to be defensively or offensively for the playoffs.\""}
{"game_id": "0021301205", "chunk_id": "0021301205_010", "order": 10, "role": "body", "text": "Before the game, the Raptors gathered at center court, where All-Star guard DeMar DeRozan made a brief address to the crowd before unveiling Toronto's Atlantic Division championship banner."}
{"game_id": "0021301205", "chunk_id": "0021301205_011", "order": 11, "role": "body", "text": "\"It means a lot,\" DeRozan said. \"With all the struggles that I've been through here, the losing. To see everything get turned around and be up there winning a division is definitely big. It's something that can never be taken away.\""}
{"game_id": "0021301205", "chunk_id": "0021301205_012", "order": 12, "role": "body", "text": "That was the end of DeRozan's involvement for the evening, as he got the night off to rest. Vasquez took DeRozan's spot in the starting lineup and made it count, finishing one point off his season high."}
{"game_id": "0021301205", "chunk_id": "0021301205_013", "order": 13, "role": "body", "text": "\"He did a great job,\" Casey said of Vasquez."}
{"game_id": "0021301205", "chunk_id": "0021301205_014", "order": 14, "role": "body", "text": "Jonas Valanciunas added 14 points and 13 rebounds and Tyler Hansbrough had 12 points and 11 rebounds as the Raptors won for the sixth time in seven games and completed the first season sweep of Milwaukee in franchise history."}
{"game_id": "0021301205", "chunk_id": "0021301205_015", "order": 15, "role": "body", "text": "\"They're a playoff team for a reason,\" Bucks forward Khris Middleton said of the Raptors. \"From one through 15, those guys can step in and they are always ready.\""}
{"game_id": "0021301205", "chunk_id": "0021301205_016", "order": 16, "role": "body", "text": "Toronto had dropped 11 consecutive games against the Bucks coming into this season, but has since won four straight."}
{"game_id": "0021301205", "chunk_id": "0021301205_017", "order": 17, "role": "body", "text": "Ramon Sessions scored 21 points, Jeff Adrien had 19 points and Brandon Knight 18 as the Bucks lost their 14th straight road game, matching a record for futility set in the 2004-05 season."}
{"game_id": "0021301205", "chunk_id": "0021301205_018", "order": 18, "role": "body", "text": "Milwaukee has not won away from home since beating Philadelphia on Feb. 24. They finished 5-36 on the road."}
{"game_id": "0021301205", "chunk_id": "0021301205_019", "order": 19, "role": "body", "text": "The loss guaranteed that the Bucks (15-66) will finish with the worst record in the NBA. Milwaukee came in trailing Philadelphia by two games in the standings."}
{"game_id": "0021301205", "chunk_id": "0021301205_020", "order": 20, "role": "body", "text": "\"We fell behind, we tried to fight back,\" Milwaukee coach Larry Drew said. \"We got it under 10, but we just couldn't get over the hump.\""}
{"game_id": "0021301205", "chunk_id": "0021301205_021", "order": 21, "role": "body", "text": "Knight, Milwaukee's leading scorer, returned to the lineup after sitting out Saturday's loss at Washington with a sore right hip."}
{"game_id": "0021301205", "chunk_id": "0021301205_022", "order": 22, "role": "body", "text": "The short-handed Bucks, who have five players injured and another suspended (center Larry Sanders), had just nine healthy bodies available against Toronto."}
{"game_id": "0021301205", "chunk_id": "0021301205_023", "order": 23, "role": "body", "text": "Sessions and Knight both hit 3-pointers as Milwaukee used a 12-1 run to cut its deficit to six points, 92-86, with 6:53 remaining."}
{"game_id": "0021301205", "chunk_id": "0021301205_024", "order": 24, "role": "body", "text": "That was as close as Milwaukee got, however. Vasquez made a free throw after Sessions was called for a technical, Lowry added a driving layup and Valanciunas added a pair from the free throw line, putting Toronto up 99-88 at 5:51."}
{"game_id": "0021301205", "chunk_id": "0021301205_025", "order": 25, "role": "body", "text": "\"It probably wasn't the best time to get a technical foul,\" Drew said. \"It's an emotional game and he got a little bit emotional and said something to the officials.\""}
{"game_id": "0021301205", "chunk_id": "0021301205_026", "order": 26, "role": "body", "text": "Vasquez made an impact right away, hitting three of Toronto's six 3-pointers in the first quarter, as the Raptors built a 32-19 lead after one."}
{"game_id": "0021301205", "chunk_id": "0021301205_027", "order": 27, "role": "body", "text": "Vasquez had two more 3-pointers in the second, getting eight points and four assists as Toronto took a 59-46 lead at halftime."}
{"game_id": "0021301205", "chunk_id": "0021301205_028", "order": 28, "role": "body", "text": "Lowry, who didn't score in the second, had 10 points in the third as the Raptors took an 84-79 lead into the final quarter."}
{"game_id": "0021301205", "chunk_id": "0021301205_029", "order": 29, "role": "closing", "text": "Game notes The Raptors won 47 games in the 2006-07 and 2000-01 seasons. ... ... Toronto finished its home schedule at 26-16. The Raptors play their final regular season game at New York on Wednesday. ... The Bucks host Atlanta in their final game Wednesday. ... Brendan Shanahan, who was introduced earlier in the day as president of the Toronto Maple Leafs, watched from a courtside seat."}
