{"game_id": "0021700026", "chunk_id": "0021700026_001", "order": 1, "role": "lead", "text": "PHOENIX -- In his second NBA game, Lonzo Ball earned his first victory and almost got a triple-double to boot.\nBall, the No. 2 overall draft pick who doesn't turn 20 until next Friday, had 29 points, 11 rebounds and nine assists in the Los Angeles Lakers' 132-130 victory over the Phoenix Suns on Friday night.\n\"The last game I shot six shots,\" he said. \"That didn't work out so well. Figured I'd try something else.\"\nSo he took 27 shots and made 12, finishing 4 of 9 on 3-pointers to go with his cache of assists and rebounds.\nBall's career high in college was 24 points during his lone season at UCLA.\n\"Today I just had to do what I had to do to get the win. I had to shoot a few more shots. It doesn't take me long to learn,\" Ball said. \"It was my first time. Everybody is going to criticize me regardless of what I do, but the more I play, the more comfortable I get.\"\nThe Suns had a chance to tie it with 1.2 seconds to play, but T.J. Warren missed the first of two free throws. That meant he had to miss the second intentionally and hope for a rebound, but the Suns couldn't get a decent shot off before the buzzer.\nBall took over down the stretch, scoring eight points in a 2 1/2-minute span. His final basket during that run, a floating layup, put Los Angeles ahead 130-122 with 1:35 to play.\nVeteran Phoenix center Tyson Chandler was impressed.\n\"He gets the ball down quick regardless of whether it's scores or misses, which puts a lot of pressure on the defense as far as getting back,\" Chandler said. \"He has a great feel as a young player for the game.\"\nBut the Suns came roaring back behind Eric Bledsoe and Devin Booker, who sank a 3-pointer with 6.4 seconds left to cut it to 131-130. Brandon Ingram made one of two free throws to give Phoenix one last chance, and Warren was fouled by Ingram on an inbounds play.\nThe free throw was off the back of the rim, though, and the Lakers held on.\nBledsoe scored 29 points, 17 in the fourth quarter. Booker also flirted with what would have been his first career triple-double, finishing with 25 points, 11 rebounds and eight assists. Warren added 24 points, 17 in the second quarter.\nIngram scored 25 points for Los Angeles.\nBoth teams were coming off season-opening blowout losses.\nThe Lakers lost to the Los Angeles Clippers 108-92, and Phoenix was routed by Portland 124-79, the most one-sided loss in Suns history and most one-sided season opener ever in the NBA.\nFrom the opening tip Friday, it was a fast-paced, often sloppy game with not much attention to defense.\n\"The hustle and fight from all of them, you've got to commend them,\" Suns coach Earl Watson said. \"But if these two programs are the future of the NBA, there's no defense in the future.\"\nBooker was called for a flagrant one when he fouled Brewer hard on a layup with 6:02 left in the third quarter. Larry Nance Jr. jumped into the fray and put a shoulder into Booker, who responded with a shove. Booker and Nance both were assessed technical fouls.\nThe play came during a 13-2 Lakers outburst that put Los Angeles on top 95-85 after Nance stole the ball from Booker with both players on the floor and flipped the ball to Brook Lopez for a layup with 3:03 to play in the third quarter.\nThe Lakers boosted the lead to 111-99 on Jordan Clarkson's basket with 10:28 to go.\n\"A lot to learn from that and great experience for our guys and obviously happy we came out with the win,\" Los Angeles coach Luke Walton said. \"It feels good. Let them feel some of that. With the hard work they're putting in, you want to get rewarded once in a while.\"\nTIP-INS\nLakers: Luol Deng, who started Thursday's opener, was inactive. ... Ball had three points, nine assists and four steals in his debut Thursday night against the Clippers. ... The Lakers locked arms as they stood for the national anthem.\nSuns: In the second quarter, Warren was 6 for 7 from the field and 5 for 6 from the foul line. ... Booker was flattened under the Phoenix basket by Lopez in the second quarter. Booker was slow to get up but stayed in the game.\nUP NEXT\nLakers: Host New Orleans on Sunday night.\nSuns: At the Los Angeles Clippers on Saturday night.\n---\nMore AP NBA: https://apnews.com/tag/NBAbasketball"}
