{"game_id": "0021400754", "chunk_id": "0021400754_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  It's been a long, frustrating three months for Ricky Rubio. His injured left ankle did not heal as quickly as he wanted it to, and the Minnesota Timberwolves sunk to the bottom of the NBA without him and two of his veteran teammates."}
{"game_id": "0021400754", "chunk_id": "0021400754_002", "order": 2, "role": "body", "text": "Three games into his comeback, his ankle was hurting again and the Timberwolves were on their way to another loss."}
{"game_id": "0021400754", "chunk_id": "0021400754_003", "order": 3, "role": "body", "text": "Not this time. Not Friday night."}
{"game_id": "0021400754", "chunk_id": "0021400754_004", "order": 4, "role": "body", "text": "Rubio shook off an ankle injury in the fourth quarter, scoring eight points in the final 1:47 to rally the Timberwolves from a seven-point deficit and stun the Memphis Grizzlies, 90-89."}
{"game_id": "0021400754", "chunk_id": "0021400754_005", "order": 5, "role": "body", "text": "Rubio appeared to re-injure the same ankle that kept him out for 42 games earlier in the season on a driving layup with six minutes to play. After howling in frustration, he jogged to the back of the arena, ran a couple of laps in the hallway to loosen it up and returned a minute later to bury the surging Grizzlies."}
{"game_id": "0021400754", "chunk_id": "0021400754_006", "order": 6, "role": "body", "text": "With the long-suffering home crowd roaring, Rubio hit two big 3-pointers and then knocked down a pair of free throws with 10.2 seconds to play that put the Wolves (10-40) in front and snapped the Grizzlies' eight-game winning streak."}
{"game_id": "0021400754", "chunk_id": "0021400754_007", "order": 7, "role": "body", "text": "\"Moments like that, it gives all the hard work I've been putting on my rehab, it's all worth it,\" said Rubio, who finished with 17 points, five assists and five steals. \"I'm back playing. That's all I'm asking. I'm healthy. When I work hard, I work for these kind of moments, to be playing and enjoying the basketball. This is why I love basketball, for moments and games like that.\""}
{"game_id": "0021400754", "chunk_id": "0021400754_008", "order": 8, "role": "body", "text": "Andrew Wiggins added 18 points and six rebounds and Thaddeus Young had 14 points and eight boards for the Wolves, who have won back-to-back games for the first time all season."}
{"game_id": "0021400754", "chunk_id": "0021400754_009", "order": 9, "role": "body", "text": "Mike Conley had 15 points and seven assists for the Grizzlies, who led 87-80 with less than two minutes to play."}
{"game_id": "0021400754", "chunk_id": "0021400754_010", "order": 10, "role": "body", "text": "They had the ball with a chance to win in the closing seconds, but Rubio poked it away from Conley to seal the victory for Minnesota."}
{"game_id": "0021400754", "chunk_id": "0021400754_011", "order": 11, "role": "body", "text": "The Grizzlies shot 52 percent, but star forward Zach Randolph had a season-low six points on 3-for-7 shooting and the Wolves turned 18 Memphis turnovers into 24 points. Memphis was out-rebounded 43-30 and had just two offensive rebounds in the game."}
{"game_id": "0021400754", "chunk_id": "0021400754_012", "order": 12, "role": "body", "text": "\"They wanted it more,\" Grizzlies coach Dave Joerger said. \"They deserved to win because they played hard. We stood around and watched, and they went and got loose balls and made plays. We stood around and watched. We did that the whole game.\""}
{"game_id": "0021400754", "chunk_id": "0021400754_013", "order": 13, "role": "body", "text": "The Wolves got quite a scare in the fourth quarter when Rubio crashed to the floor on a layup and tweaked his left ankle. A minute later he was back at the scorer's table, and it turned out he was just getting started."}
{"game_id": "0021400754", "chunk_id": "0021400754_014", "order": 14, "role": "body", "text": "He knocked down a 3 to make it 87-83 and another with 34.8 seconds to go that made it 89-88 Memphis. He was fouled in the backcourt after corralling a loose ball, and calmly knocked down two free throws to put the Wolves in front for good."}
{"game_id": "0021400754", "chunk_id": "0021400754_015", "order": 15, "role": "body", "text": "\"When you've got a game where you've got the lead, and just take care of the ball and execute and get stops and you walk away with the win easy, and you let that slip away, that hurts,\" Grizzlies guard Courtney Lee said. \"These are games that we've got to get.\""}
{"game_id": "0021400754", "chunk_id": "0021400754_017", "order": 17, "role": "body", "text": "Grizzlies: Marc Gasol had 15 points and just three rebounds. ... F JaMychal Green got his first action since signing a 10-day contract. He had eight points in nine minutes."}
{"game_id": "0021400754", "chunk_id": "0021400754_018", "order": 18, "role": "body", "text": "Timberwolves: Saunders said F Shabazz Muhammad (oblique) may return on Monday against Atlanta. ... PG Lorenzo Brown signed his second 10-day contract. Once that expires, the Wolves will either have to sign him for the rest of the regular season or let him become a free agent."}
{"game_id": "0021400754", "chunk_id": "0021400754_020", "order": 20, "role": "body", "text": "Joerger returned to Target Center for the first time since this summer, when he was surprisingly allowed to interview for the Timberwolves coaching vacancy. Joerger interviewed with president Flip Saunders, owner Glen Taylor and GM Milt Newton and there appeared to be momentum toward a deal before Grizzlies owner Robert Pera stepped in and extended Joerger's contract to keep him in Memphis. Saunders eventually took over as Wolves coach."}
{"game_id": "0021400754", "chunk_id": "0021400754_021", "order": 21, "role": "body", "text": "Joerger, who is from Staples, Minnesota, said he didn't feel any awkwardness in his return."}
{"game_id": "0021400754", "chunk_id": "0021400754_022", "order": 22, "role": "body", "text": "\"I'm excited about their team. I'm happy for Flip, happy for Mr. Taylor. They're great people. They treated me nicely. We were friends before. We will continue to be friends. I love them to death. There's not weirdness. It's cool. They are great people.\""}
{"game_id": "0021400754", "chunk_id": "0021400754_024", "order": 24, "role": "body", "text": "Grizzlies: host Atlanta on Sunday."}
{"game_id": "0021400754", "chunk_id": "0021400754_025", "order": 25, "role": "closing", "text": "Timberwolves: visit Detroit on Sunday."}
