{"game_id": "0021700518", "chunk_id": "0021700518_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  The Milwaukee Bucks silenced the boos with a big victory."}
{"game_id": "0021700518", "chunk_id": "0021700518_002", "order": 2, "role": "body", "text": "Eric Bledsoe scored 26 points and Giannis Antetokounmpo added 22 points and 10 rebounds to help the Bucks rally from a 20-point deficit and win back their crowd with a 102-96 victory over the Minnesota Timberwolves on Thursday night."}
{"game_id": "0021700518", "chunk_id": "0021700518_003", "order": 3, "role": "body", "text": "\"I didn't hear the boos, but I don't hear the cheers either,\" Bucks coach Jason Kidd said. \"That's what the fans come to see. The game is about runs.\""}
{"game_id": "0021700518", "chunk_id": "0021700518_004", "order": 4, "role": "body", "text": "None were bigger than Bledsoe's final push."}
{"game_id": "0021700518", "chunk_id": "0021700518_005", "order": 5, "role": "body", "text": "Bledsoe had six points and two key assists down the stretch and the Bucks found their missing defense, holding the Timberwolves to a season-low 12 points in the fourth quarter. Minnesota went cold over the last 4:21 and had its five-game winning streak snapped."}
{"game_id": "0021700518", "chunk_id": "0021700518_006", "order": 6, "role": "body", "text": "Bledsoe took a pass from Antetokounmpo and made an open 3-pointer from the corner to give the Bucks their first lead of the game at 95-93 with 2:25 to go. Bledsoe followed with a three-point play and then found Antetokounmpo under the basket for an easy two points, pushing the lead to 100-93 with 1:04 left."}
{"game_id": "0021700518", "chunk_id": "0021700518_007", "order": 7, "role": "body", "text": "Khris Middleton and John Henson added 14 apiece for Milwaukee."}
{"game_id": "0021700518", "chunk_id": "0021700518_008", "order": 8, "role": "body", "text": "Minnesota perhaps wore down a night after a 128-125 overtime victory over Denver and had a four-game road winning streak snapped."}
{"game_id": "0021700518", "chunk_id": "0021700518_009", "order": 9, "role": "body", "text": "Jamal Crawford, who scored 11 points, didn't think that was the case."}
{"game_id": "0021700518", "chunk_id": "0021700518_010", "order": 10, "role": "body", "text": "\"I won't make excuses to be honest with you,\" he said. \"You can say that, but we still built a big enough lead where we should have finished that game.\""}
{"game_id": "0021700518", "chunk_id": "0021700518_011", "order": 11, "role": "body", "text": "Karl-Anthony Towns scored 22 points and tied his season high with four 3-pointers for Minnesota. Andrew Wiggins, who was sidelined briefly in the third after turning his ankle, finished with 21."}
{"game_id": "0021700518", "chunk_id": "0021700518_012", "order": 12, "role": "body", "text": "Towns' driving layup gave the Timberwolves a 74-54 lead in the third, but the Bucks used a 21-10 run to end the quarter trailing by five points. The Bucks opened the fourth with a 13-4 run and tied it at 88 on a 3 by Middleton with 7:06 to play."}
{"game_id": "0021700518", "chunk_id": "0021700518_013", "order": 13, "role": "body", "text": "The Timberwolves were without point guard Jeff Teague and had some other bumps and bruises in the second half."}
{"game_id": "0021700518", "chunk_id": "0021700518_014", "order": 14, "role": "body", "text": "\"Once we had the lead up to 20, (Wiggins) sprained his ankle, so that hurt us some,\" Timberwolves coach Tom Thibodeau said. \"We had a stretch where Tyrus (Jones) dislocated his finger. So, we didn't play well down the stretch.\""}
{"game_id": "0021700518", "chunk_id": "0021700518_015", "order": 15, "role": "body", "text": "Jimmy Butler, who had a season-high 39 points against the Nuggets, finished with 20 points and seven assists. Jones made his fourth start of the season at point guard, filling in for the injured Teague."}
{"game_id": "0021700518", "chunk_id": "0021700518_016", "order": 16, "role": "body", "text": "Teague missed the game with a sprained left knee. He got caught in a scramble of players in the final seconds against the Nuggets and limped off the court."}
{"game_id": "0021700518", "chunk_id": "0021700518_018", "order": 18, "role": "body", "text": "Timberwolves: F Nemanja Bjelica played his third straight game after missing the previous 15 with a sprained foot. He was scoreless. ... Minnesota, one of only four Western Conference teams with a winning road record, slipped to 3-8 against the Eastern Conference and 0-4 against the Central Division."}
{"game_id": "0021700518", "chunk_id": "0021700518_019", "order": 19, "role": "body", "text": "Bucks: The Bucks had six turnovers in the first quarter and four more in the second. ... Milwaukee extended its season-best streak of scoring 100-plus points to 17 games."}
{"game_id": "0021700518", "chunk_id": "0021700518_021", "order": 21, "role": "body", "text": "The Bucks outscored the Timberwolves 62-32 in the paint."}
{"game_id": "0021700518", "chunk_id": "0021700518_022", "order": 22, "role": "body", "text": "\"That is their strength,\" Crawford said. \"It's getting to the hole. We should have made them make more outside shots. That falls on us. We knew that going into it. We got to do a better job of that.\""}
{"game_id": "0021700518", "chunk_id": "0021700518_024", "order": 24, "role": "body", "text": "\"Sometimes you feel you're on the brink of being embarrassed,\" Kidd said. \"So, you tend to turn it up. The guys stayed together. The best part of the night was they kept talking to each other.\""}
{"game_id": "0021700518", "chunk_id": "0021700518_026", "order": 26, "role": "body", "text": "The victory was Milwaukee's biggest comeback win of the season. The previous was 14 points down against the Los Angeles Lakers on Nov. 11."}
{"game_id": "0021700518", "chunk_id": "0021700518_028", "order": 28, "role": "body", "text": "Timberwolves: At Indiana on Sunday."}
{"game_id": "0021700518", "chunk_id": "0021700518_029", "order": 29, "role": "body", "text": "Bucks: At Oklahoma City on Friday."}
{"game_id": "0021700518", "chunk_id": "0021700518_031", "order": 31, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
