{"game_id": "0021700005", "chunk_id": "0021700005_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  The Orlando Magic were about to squander a 17-point fourth-quarter lead, giving their season opener a familiar feel."}
{"game_id": "0021700005", "chunk_id": "0021700005_002", "order": 2, "role": "body", "text": "Then Evan Fournier helped get 2017-18 off on a different foot."}
{"game_id": "0021700005", "chunk_id": "0021700005_003", "order": 3, "role": "body", "text": "Fournier made three clutch shots to slow the hard-charging Miami Heat, and the Magic held on for a 116-109 win on Wednesday night -- its first season-opening victory since 2012."}
{"game_id": "0021700005", "chunk_id": "0021700005_004", "order": 4, "role": "body", "text": "Last year, Orlando often lost confidence and poise in late, tight situations. But when Miami pulled within two points with 2:39 remaining, Fournier went to work, scoring seven of his team-high 23 points in the final 2:27."}
{"game_id": "0021700005", "chunk_id": "0021700005_005", "order": 5, "role": "body", "text": "\"Obviously I was still confident, but I think two or three years ago that's a game we would have lost,\" Fournier said. \"It shows growth from us players.\""}
{"game_id": "0021700005", "chunk_id": "0021700005_006", "order": 6, "role": "body", "text": "Prior to Fournier's surge, the Magic were reeling. Orlando went more than three minutes without a point after Jonathon Simmons' two free throws with 5:39 remaining."}
{"game_id": "0021700005", "chunk_id": "0021700005_007", "order": 7, "role": "body", "text": "In between, Miami staged an 11-0 run and moved within 105-103 on Goran Dragic's two free throws with 2:39 left."}
{"game_id": "0021700005", "chunk_id": "0021700005_008", "order": 8, "role": "body", "text": "Then Fournier hit his 3, cutting off Miami's rally."}
{"game_id": "0021700005", "chunk_id": "0021700005_009", "order": 9, "role": "body", "text": "\"That's good but I wish we would have killed the game when we were up 17,\" Fournier said. \"It's hard to tell right now what happened, maybe we were too confident. But when you are up 17, you have to kill the game.\""}
{"game_id": "0021700005", "chunk_id": "0021700005_010", "order": 10, "role": "body", "text": "Second-year Magic coach Frank Vogel was pleased Fournier stepped up. James Johnson, Dion Waiters and Dragic had been pushing Miami hard while Orlando missed shots during the 11-0 stretch."}
{"game_id": "0021700005", "chunk_id": "0021700005_011", "order": 11, "role": "body", "text": "\"The best way to stop a run is to score the ball,\" Vogel said. \"Evan kept us in the game and sealed the game for us by continuing to play good offensive basketball. You need a guy like that to carry the load. He was terrific tonight.\""}
{"game_id": "0021700005", "chunk_id": "0021700005_012", "order": 12, "role": "body", "text": "Orlando center Nikola Vucevic had 19 points, 13 rebounds and two blocks. Miami was led by Hassan Whiteside, who dominated the paint in the second half. Whiteside finished with 26 points and 22 rebounds."}
{"game_id": "0021700005", "chunk_id": "0021700005_013", "order": 13, "role": "body", "text": "Heat coach Erik Spoelstra was disappointed his team couldn't find a way to complete the comeback."}
{"game_id": "0021700005", "chunk_id": "0021700005_014", "order": 14, "role": "body", "text": "\"If we want to get where we want to get with this group, we're going to really have to commit to those tough things, those physical things,\" Spoelstra said. \"All of those these things we're capable of, and we've shown flashes of it.\""}
{"game_id": "0021700005", "chunk_id": "0021700005_016", "order": 16, "role": "body", "text": "Heat: All five of Miami's starters scored in double figures. Kelly Olynyk had 10 points in his first game with the Heat and Waiters had 15. ... Whiteside had 10 rebounds in the first half."}
{"game_id": "0021700005", "chunk_id": "0021700005_017", "order": 17, "role": "body", "text": "Magic: Rookie Jonathan Isaac, the No. 6 overall pick in June's NBA Draft, converted his first NBA attempt on a put-back late in the first quarter. ... Gordon took a hard hit from Whiteside on a baseline drive late in the second quarter. Gordon remained on the floor momentarily before getting up. The play was reviewed and ruled a common foul."}
{"game_id": "0021700005", "chunk_id": "0021700005_019", "order": 19, "role": "body", "text": "Isaac said he was so nervous Wednesday that he forgot to put his jersey on under his warmups prior to the game. He said it was about five minutes into the game before he finally got his jersey. He didn't go in until 3:10 remained in the first quarter."}
{"game_id": "0021700005", "chunk_id": "0021700005_021", "order": 21, "role": "body", "text": "Heat: Host Indiana on Saturday night."}
{"game_id": "0021700005", "chunk_id": "0021700005_022", "order": 22, "role": "body", "text": "Magic: Play at Brooklyn on Friday night."}
{"game_id": "0021700005", "chunk_id": "0021700005_024", "order": 24, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
