{"game_id": "0021700943", "chunk_id": "0021700943_001", "order": 1, "role": "lead", "text": "ATLANTA --  Taurean Prince knew the Atlanta Hawks had the perfect setup for a dramatic 3-pointer."}
{"game_id": "0021700943", "chunk_id": "0021700943_002", "order": 2, "role": "body", "text": "Get Miles Plumlee to set a screen close to the arc, and Prince would take care of the rest."}
{"game_id": "0021700943", "chunk_id": "0021700943_003", "order": 3, "role": "body", "text": "\"It's a great feeling,\" Prince said. \"Hopefully, I'll put up more.\""}
{"game_id": "0021700943", "chunk_id": "0021700943_004", "order": 4, "role": "body", "text": "Prince hit the go-ahead 3 with 7.6 seconds remaining and finished with 22 points, helping the Hawks hold off the Phoenix Suns 113-112 on Sunday."}
{"game_id": "0021700943", "chunk_id": "0021700943_005", "order": 5, "role": "body", "text": "Devin Booker's potential winner for Phoenix, a 15-foot shot from the right baseline, bounced off the rim with Tyler Dorsey defending as time expired."}
{"game_id": "0021700943", "chunk_id": "0021700943_006", "order": 6, "role": "body", "text": "\"I got the shot I wanted,\" Booker said. \"I picked a point on the floor. I got to it. I just missed it.\""}
{"game_id": "0021700943", "chunk_id": "0021700943_007", "order": 7, "role": "body", "text": "T.J. Warren scored 35 points, and Elfrid Payton had 11 points, 10 rebounds and a season-high 14 assists for the Suns. Booker finished with 20 points, ending a streak of four straight games in which he had at least 30."}
{"game_id": "0021700943", "chunk_id": "0021700943_008", "order": 8, "role": "body", "text": "In a matchup of two struggling teams, neither led by more than seven points. Prince's basket marked the 24th lead change."}
{"game_id": "0021700943", "chunk_id": "0021700943_009", "order": 9, "role": "body", "text": "Phoenix has lost 22 of its last 26 games, dropping to 19-46, second-worst in the Western Conference. Atlanta, which had lost five of six, improved to 20-44, worst in the East."}
{"game_id": "0021700943", "chunk_id": "0021700943_010", "order": 10, "role": "body", "text": "Dennis Schroder had 21 points for Atlanta but did not play in the closing minutes because of what appeared to be a leg injury after he fell hard to the floor on his right side in the third. Schroder said after the game that he felt fine. Hawks coach Mike Budenholzer played Jaylen Morris the rest of the way."}
{"game_id": "0021700943", "chunk_id": "0021700943_011", "order": 11, "role": "body", "text": "\"Just happy a lot of those guys stepped up in situations they're not in a lot,\" Budenholzer said. \"A lot of good stuff for the whole game. We got better.\""}
{"game_id": "0021700943", "chunk_id": "0021700943_012", "order": 12, "role": "body", "text": "Warren's layup with 20 seconds remaining gave Phoenix a 112-110 lead. After Prince scored, Suns coach Jay Triano called a timeout and set up a clear-out play for Booker."}
{"game_id": "0021700943", "chunk_id": "0021700943_013", "order": 13, "role": "body", "text": "\"If you bring a screen, they'd probably trap it,\" Triano said. \"But we got the look we wanted on the clear side.\""}
{"game_id": "0021700943", "chunk_id": "0021700943_014", "order": 14, "role": "body", "text": "Phoenix finished with 33 assists and outscored the Hawks by 20 in the paint, thanks in part to 17 points from Marquese Chriss."}
{"game_id": "0021700943", "chunk_id": "0021700943_015", "order": 15, "role": "body", "text": "Atlanta tied a season-high with 17 3s. Prince went 6 for 8 beyond the arc."}
{"game_id": "0021700943", "chunk_id": "0021700943_017", "order": 17, "role": "body", "text": "Suns: C Tyson Chandler, starting after he missed the last six games with a sore neck, had six points and five rebounds. The 17-year veteran showed his sense of humor midway through the third, flexing his muscles after Schroder, who's 1 foot shorter and almost 70 pounds lighter, fouled him in the lane. Chandler missed the ensuing free throw."}
{"game_id": "0021700943", "chunk_id": "0021700943_018", "order": 18, "role": "body", "text": "Hawks: Teams can't say publicly they're vying for a bad record and more chances in the NBA lottery, but G Kent Bazemore, Atlanta's second-leading scorer, had a rest day for the second time in the last six games. Bazemore hasn't otherwise missed a game this season. He was coming off a career-high 29 points in Friday's home loss to Golden State. ... Dorsey started in Bazemore's spot and scored 12 points. ... Malcolm Delaney had 12 points but hurt his ankle late in the game and didn't return."}
{"game_id": "0021700943", "chunk_id": "0021700943_020", "order": 20, "role": "body", "text": "Tempers flared with 2:14 left in the game after Prince was called for goaltending against Jackson. Jackson shoved Prince in the chest, and Prince responded with the same. They were quickly separated by official Matt Boland near the baseline when Hawks reserve guard Isaiah Taylor, coming from behind Jackson, bumped him shoulder to shoulder. Jackson then shoved Prince again. Players on the floor for both teams closed in, but the benches did not empty. After order was restored and lead official Bill Kennedy watched the replay, Jackson and Payton were ejected while Jackson and Prince were assessed technical fouls."}
{"game_id": "0021700943", "chunk_id": "0021700943_022", "order": 22, "role": "body", "text": "Booker's streak was the franchise's longest since Amare Stoudemire scored at least 30 in four straight games in 2004. Booker was vying to tie Charlie Scott and Charles Barkley for the team's longest streak of at least 30 points. In Friday's loss to Oklahoma City, the 21-year-old Booker became the third-youngest NBA player to reach 4,000 career points, topped only by LeBron James and Kevin Durant."}
{"game_id": "0021700943", "chunk_id": "0021700943_024", "order": 24, "role": "body", "text": "Suns: At Miami on Monday night."}
{"game_id": "0021700943", "chunk_id": "0021700943_025", "order": 25, "role": "body", "text": "Hawks: At Toronto on Tuesday night."}
{"game_id": "0021700943", "chunk_id": "0021700943_027", "order": 27, "role": "closing", "text": "More AP NBA coverage: https://apnews.com/tag/NBAbasketball"}
