{"game_id": "0021301122", "chunk_id": "0021301122_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- With bags under their eyes as big as the ones they had to pack for a rugged five-game road trip, the weary Memphis Grizzlies trudged into Target Center knowing they had one more fight before they could get back to the comforts of home.\nThe Minnesota Timberwolves gave them all of that and more and sent the Grizzlies packing with a costly defeat.\nKevin Love had 24 points, 16 rebounds and 10 assists for his third career triple-double in Minnesota's 102-88 victory over Memphis on Wednesday night.\n\"A lot of time zones. A lot of traveling. A lot of battles,\" said Grizzlies point guard Mike Conley, who had just seven points on 3-for-15 shooting.\nRicky Rubio had 14 points, seven assists and three steals and Kevin Martin scored 21 points for the Timberwolves, who are trying to play spoiler down the stretch of what has been a disappointing season.\n\"We wanted to find some sense of motivation and that's what we found tonight,\" Love said. \"We just wanted to knock off a team that is fighting right now.\"\nMarc Gasol had 18 points, seven rebounds and four assists for the Grizzlies. But Zach Randolph had just four points on 1-for-8 shooting and Memphis dropped a game that coach Dave Joerger called a must-win before tipoff.\nThe Grizzlies (44-31) entered in seventh place in the jam-packed Western Conference, but with Phoenix (44-30) and Dallas (44-31) all in the mix for the last two spots.\n\"We were just kind of running in mud the whole night,\" Joerger said. \"You're going to have games like that, where you're very heavy-legged. We've been playing with a playoff focus. Each game has meant so much since like Christmas. You're starting to see the effects of it now.\"\nRonny Turiaf had 11 points, seven rebounds and three blocks in his first game since Feb. 19 and the Timberwolves shot 53 percent despite missing Nikola Pekovic with a sore right ankle.\nThe Grizzlies were a tired bunch when they arrived in Minnesota after splitting the first four games of the road trip. With three teams essentially fighting for two spots, they just don't have time to be tired right now.\nThe Wolves led by seven at halftime, and Rubio attacked Memphis right out of the second-half gates. He had six points, a steal and an assist in the first 4 minutes and kept the pressure coming. He drew three fouls on Conley to force him to the bench midway through the period, hit a 3-pointer and fired a 50-foot outlet pass to Kevin Martin for a layup during a flurry that helped build an 18-point lead.\nRubio left the game briefly with a sprained left ankle after a spill under the basket, but the damage was already done. A 12-2 run in the fourth pushed Minnesota's lead to 100-80 with 3 minutes to go.\n\"Everybody else has something on the line,\" Wolves coach Rick Adelman said. \"So we want to go out and play as well as we can and spoil it for them and see if we can't be a factor in it.\"\nRandolph, Conley and Tayshaun Prince combined to shoot 7 for 32 and the Grizzlies gave in to a team that appeared to have given up on this season after falling out of contention in the hyper competitive West. Randolph finished with single digits in scoring for just the fourth time this season and first since Jan. 15.\nThe Grizzlies now return home to face the Nuggets before going to San Antonio and hosting Miami in a tough three-game stretch. The Suns get the Clippers, Trail Blazers and Thunder this week while the Mavericks start a four-game road trip.\n\"You've got to put this one behind us,\" Randolph said. \"We've just got to forget about it. We know this ain't us. We know we can play better.\"\nGame notes\nWolves C Gorgui Dieng had eight points and nine rebounds and received a big ovation before the game when it was announced that he was named Western Conference rookie of the month. ... Memphis F Jon Leuer, a Minnesota native, finished with four points in 3 minutes. ... The Grizzlies only turned the ball over 11 times, but it led to 19 points for Minnesota."}
