{"game_id": "0021300947", "chunk_id": "0021300947_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- For about a three-minute stretch of the second half, Milwaukee's Brandon Knight just could not be stopped.\nA quick first step to get to the hoop for a layup. A rousing dunk on the break off a high outlet pass saved by teammate Ramon Sessions. A back-breaking 3 from the wing.\nKnight scored 11 straight points during a stretch between the third and fourth quarters to help the Bucks erase an 18-point deficit and defeat the Orlando Magic 105-98 on Monday night.\nThe Bucks fed off their lead guard once Knight got going.\n\"He was attacking, finishing, finding guys and making plays for us,\" said Khris Middleton, who added 21 points and three crucial 3s in the fourth quarter.\nMaurice Harkless had 14 points to lead seven players in double figures Orlando, which got guard Victor Oladipo back after the rookie missed two games with left ankle soreness. Oladipo finished with 12 on 5-of-6 shooting off the bench.\nThe Magic just had no answer for Knight.\n\"I thought his aggression as far as attacking the basket was a huge plus,\" coach Larry Drew said.\nA game between two of the worst teams in the league -- the Bucks and Magic had combined for 95 losses coming into the night -- turned into an entertaining affair down the stretch that saw the Bucks snap a three-game skid.\nSeveral times early in the contest, it looked as though the Magic would hold on for their fifth road victory of the year. But the stretch run belonged to Knight, who had an emphatic answer to start the fourth quarter to answer two buckets by Oladipo that ended the third.\n\"NBA games are extremely long and an 18-point lead in the first half doesn't mean a lot,\" Orlando coach Jacque Vaughn said.\nKnight nearly singlehandedly blew past Orlando to start the fourth.\nA layup with 11:21 left gave Milwaukee a 72-71 lead, its first advantage since the quarter.\nThen came Knight's dunk. Rookie Giannis Antetokounmpo threw a high pass downcourt back to Sessions, who jumped with one arm outstretched and got the ball to the streaking Knight for the throwdown.\nAfter another missed Magic shot, Knight hurt Orlando again with a 3 from the wing for a 77-71 lead with 10:30 left.\n\"It's real frustrating. We were playing basketball the right way. But we stopped playing team ball,\" said Tobias Harris, who scored all 11 of his points during a 13-0 run in the first half that allowed the Magic to build a 31-13 lead.\nKnight's hustling play was in stark contrast to a lethargic Bucks squad that couldn't hit shots and appeared to be just standing around the hoop defensively during Orlando's early spurt.\n\"I just wanted to come out and be aggressive, come out and be strong and attack the basket,\" Knight said. \"We were able to get out and get a lot of easy baskets, so that got us in a good rhythm and we were able to steamroll from there.\nNot quite, even if Middleton added three fourth-quarter 3s to help the Bucks build its own double-digit lead.\nThe lead swelled to 95-81 with 2:49 left before Orlando mounted its own late charge to get within three off a 3 from Jameer Nelson with 35 seconds left.\nBut the Bucks hit their foul shots late and Orlando was hurt after Nikola Vucevic was whistled for an offensive foul with 22 seconds left.\nNelson finished with 13. Sessions had 16 points and eight assists and went 6 of 6 from the line. Sessions combined with Knight to effectively lead the Bucks' up-tempo attack in the second half.\nEven Oladipo's return couldn't help Orlando. The rookie said after the game he wasn't working out or shooting for about a week because of his sore foot, so Vaughn eased Oladipo back into the rotation Monday.\n\"I felt like I was kind of slow with my reaction time because I haven't played in a while. Still no excuse,\" Oladipo said. \"I feel like I let my team down a little bit today but I've just got to keep growing and getting better.\"\nGame notes\nThe Magic fell to a league-worst 4-30 on the road. ... Vucevic finished with a double-double off 12 points and 12 rebounds. ... Knight extended his career-best streak of scoring in double-digits to 18 straight games. ... The Bucks play seven of their next eight games on the road."}
