{"game_id": "0021301050", "chunk_id": "0021301050_001", "order": 1, "role": "lead", "text": "CHICAGO -- Bulls center Joakim Noah believes the Eastern Conference is more than a two-team race.\nHis message: Don't dismiss Chicago just yet.\nFollowing an 89-77 victory over first-place Indiana on Monday night, Noah said the Bulls think they are capable of competing with anyone in the East, be it the Pacers or defending champion Miami Heat.\n\"We feel like we can go at anybody, we can beat anybody, when we're hungry. Stay humble and keep grinding,\" Noah said. \"I said right after the game, 'I'm excited about having an opportunity to play these guys again.' \"\nThe season series with the Pacers is over -- the teams split four games and the home team won each one -- so another meeting would have to come in the playoffs.\n\"It was real physical; my body is sore right now,\" Bulls forward Taj Gibson said. \"That's the kind of games we play against our rivals, playoff basketball. That's going to happen.\"\nGibson, bouncing back from a subpar performance and postgame rant when the teams played last Friday in Indiana, scored 23 points to lead five Bulls in double figures.\nKirk Hinrich had 18 points on 7-for-13 shooting, Mike Dunleavy scored 13, Jimmy Butler 12 and Noah added 10 points, eight rebounds and eight assists.\nGibson, who was 9 for 15 from the field, also had eight rebounds in 32 minutes off the bench.\nThe Bulls (40-31) pulled within 2 percentage points of Toronto (39-30) for third place in the Eastern Conference, a rise that wasn't considered realistic when star guard Derrick Rose was injured and Luol Deng was traded.\nThe win also prevented Indiana from clinching the Central Division title on Chicago's home court. The Pacers are looking to win consecutive division crowns for the second time since joining the NBA (1998-99 and 1999-2000).\nThe Pacers, who were led by Paul George's 21 points, have dropped three straight and six of eight on the road. They've lost four of five at the United Center, including both visits this season.\n\"Give them credit, as their defense is elite,\" George said. \"You need quick strikes and fast breaks to beat it.\"\nThat didn't happen too often Monday night and it hasn't been happening enough of late for the Pacers as they continue to struggle.\n\"It's just the type of stuff where people can't get into a rhythm,\" said center Roy Hibbert, who had just three points and five rebounds. \"It's just a lot of 1-on-1 basketball.\"\nThe Pacers earned a 91-79 victory over the Bulls on Friday night at Indiana on the strength of a 19-0 third-quarter run. This time, the Bulls turned the tables, starting the second half with a 16-5 surge to take a 49-39 lead.\nA few minutes later, Indiana had cut the lead to 55-49 and George had the ball on a fast break ahead of the field. Hinrich, though, caught him from behind and looked as if he was going to give an intentional foul. Instead, Hinrich stripped the ball and the Bulls headed in the opposite direction as George complained that he was fouled.\nThe Bulls completed the four-point swing on Gibson's dunk to make it 57-49 with just more than 4 minutes left in the third quarter.\nThe Bulls took a 64-56 lead into the fourth and were never seriously threatened down the stretch.\n\"We made a lot of defensive adjustments,\" said Gibson, who fouled out of the previous meeting and accused the Pacers of flopping. \"We played with a lot more intensity, a lot more aggressiveness, and it showed.\"\nGame notes\nBulls coach Tom Thibodeau was asked if there was a chance Rose could return for the playoffs. \"No,\" he said. \"He's doing a little bit more, he's coming along (and) doing some things in practice. But he's out for the year.\" ... Pacers coach Frank Vogel when asked if Hibbert was the NBA Defensive Player of the Year: \"Hands down. He's the best rim-protector on the best defense in the league. I think that's who the award should go to. I'll be very disappointed if he doesn't get the award this year.\" Hibbert's main competition could be Noah, who received the endorsement of Rockets coach Kevin McHale a couple of weeks ago. ... Former Bull C.J. Watson missed the game with a right hamstring strain."}
