{"game_id": "0021300677", "chunk_id": "0021300677_001", "order": 1, "role": "lead", "text": "ATLANTA -- Jeff Teague was in no mood to talk after the Atlanta Hawks missed a chance to win their third straight game.\n\"There was a letdown,\" he said. \"We lost. We should've taken care of business.\"\nRodney Stuckey scored 29 points, Greg Monroe and Andre Drummond each had a double-double and the Detroit Pistons snapped a 10-game skid in Atlanta with a 102-95 victory over the Hawks on Tuesday night.\nAtlanta has five games left in the regular season and a 1 1/2-game advantage over New York for the eighth and final Eastern Conference playoff spot. Paul Millsap had 24 points and 12 rebounds for the Hawks.\nMonroe finished with 21 points and 13 rebounds and Drummond had 19 points and 17 rebounds for the Pistons, who were eliminated from playoff contention when the Hawks won Sunday at Indiana.\nDetroit has won two straight after dropping five of six. Drummond has 53 double-doubles, most in the Eastern Conference this season. Monroe has 34.\nAtlanta trailed by three when Drummond blocked Millsap's jumper in the lane and tipped in Kyle Singler's missed fast-break layup to put the Pistons up 96-91 with 1:36 remaining.\n\"They're just big on the inside,\" said Teague, who finished with 15 points and nine assists. \"They're athletes, and it's going to be tough to get layups. We've just got to make our shots. We had some open looks.\"\nThe Pistons were up by 13 twice in the second quarter, the latter coming on Peyton Siva's 3-pointer at the 8:47 mark, but Atlanta cut the lead to four on Kyle Korver's 3 in the final minute of the period.\nDetroit played without leading scorer Josh Smith, who was sidelined by patella tendinitis in his left knee. Stuckey replaced the former Atlanta star in the starting lineup and had 15 points in the first half.\nKorver overcame a turnover midway through the third by hitting a 3 on Atlanta's ensuing possession to force a 67-all tie.\nThe Hawks took their first lead of the game on their next possession as DeMarre Carroll took on outlet pass from Teague and hit a fast-break layup at the 6:24 mark.\nBut after three more lead changes, Detroit began the fourth ahead 81-78 and never trailed again as the Hawks failed to keep Monroe and Drummond from dominating in the paint.\nThe Pistons outscored Atlanta 26-9 in second-chance points.\n\"We just kept playing,\" Monroe said. \"I just think we did what we needed to come back and take control of the game. Teams are always going make runs in this league. We took our hit and we came back.\"\nAtlanta gets another chance to pad its lead over New York on Wednesday when Boston visits Philips Arena. The Knicks' next game is Friday at Toronto.\n\"We were hoping to build off the (Indiana) game when we came out very focused and on fire with attention to detail,\" Korver said. \"Tonight, especially on the defensive end, we weren't very sharp. They had 35 in the first quarter.\"\nGame notes\nThe game was originally scheduled for Jan. 29, but was postponed because of a snowstorm. ... Smith missed his first game since signing a four-year, $54 million contract as a free agent. He has started 76 of 77 games. ... Detroit won in Atlanta for the first time since Feb. 12, 2008. ... The Hawks missed 26 of 35 attempts beyond the arc. ... Stuckey, who made his second start in 70 games, gave the Pistons their first double-digit lead by hitting a 3 to make it 40-29 with 10:20 left in the second. ... Hawks reserve G Lou Williams was in uniform, but he sat out for a second straight with a sore left hamstring. ... The Hawks dropped to 22-16 at home. ... Detroit improved to 13-27 on the road. ... John Loyer improved to 8-20 as Detroit's interim coach."}
