{"game_id": "0021701219", "chunk_id": "0021701219_001", "order": 1, "role": "lead", "text": "BOSTON --  Most of Boston's regulars got a chance to watch some basketball -- both on and off the court."}
{"game_id": "0021701219", "chunk_id": "0021701219_002", "order": 2, "role": "body", "text": "After watching some teammates on the court, they found themselves sitting or standing in front of TVs in the dressing room after the game waiting to see their upcoming playoff opponent."}
{"game_id": "0021701219", "chunk_id": "0021701219_003", "order": 3, "role": "body", "text": "Following an easy season-ending 110-97 win over the Brooklyn Nets on Wednesday night, their plans finally could turn to the \"Greek Freak\" and the Milwaukee Bucks."}
{"game_id": "0021701219", "chunk_id": "0021701219_004", "order": 4, "role": "body", "text": "Aron Baynes led a short-handed Boston lineup with a career-best 26 points and 14 rebounds, carrying the Celtics in their regular season finale."}
{"game_id": "0021701219", "chunk_id": "0021701219_005", "order": 5, "role": "body", "text": "\"Nice that we have the Vegas Knights-Kings game on,\" Boston coach Brad Stevens joked when he looked up at a TV during his postgame press conference before the Celtics' playoff opponent was determined."}
{"game_id": "0021701219", "chunk_id": "0021701219_006", "order": 6, "role": "body", "text": "Boston's players had to wait a little while longer to see who they would be playing after Miami needed overtime to clinch the Eastern Conference's sixth seed."}
{"game_id": "0021701219", "chunk_id": "0021701219_007", "order": 7, "role": "body", "text": "The Celtics, the No. 2 seed in the East, will face seventh-seeded Milwaukee -- led by Giannis Antetokounmpo -- in the opening round of the playoffs beginning this weekend."}
{"game_id": "0021701219", "chunk_id": "0021701219_008", "order": 8, "role": "body", "text": "Jonathan Gibson scored 18 points, Guerschon Yabusele had 16 and Shane Larkin added 12 points, 10 assists and seven rebounds for the Celtics (55-27)."}
{"game_id": "0021701219", "chunk_id": "0021701219_009", "order": 9, "role": "body", "text": "Nik Stauskas scored 18 points for the Nets (28-54) who had their three-game winning streak snapped. Allen Crabbe had 16 points."}
{"game_id": "0021701219", "chunk_id": "0021701219_010", "order": 10, "role": "body", "text": "\"Disappointed in tonight, but I'm going to look at the positive and look at the way we finished the season playing much better,\" Nets coach Kenny Atkinson said. \"Definitely trending upwards. Obviously, Boston's program is a little ahead of us right now.\""}
{"game_id": "0021701219", "chunk_id": "0021701219_011", "order": 11, "role": "body", "text": "The Celtics rested Al Horford, Jaylen Brown, Jayson Tatum, Terry Rozier and Marcus Morris. Tatum and assistant coach Jim Larranaga were watching to see if Boston would play the Heat. Brown was watching another screen to see if Denver or Minnesota would be the final team out West."}
{"game_id": "0021701219", "chunk_id": "0021701219_012", "order": 12, "role": "body", "text": "\"We had a lot of young players on the court. We played together,\" Yabusele said. \"We came (out) aggressive, and we just imposed our game. We played pretty well.\""}
{"game_id": "0021701219", "chunk_id": "0021701219_013", "order": 13, "role": "body", "text": "Baynes was the only regular in the starting lineup for the Celtics and he helped them take charge by scoring six points during a 9-0 run midway into the third quarter that pushed them ahead 66-47."}
{"game_id": "0021701219", "chunk_id": "0021701219_014", "order": 14, "role": "body", "text": "The 6-foot-10 Baynes had a double-double (18 points, 10 rebounds) at halftime."}
{"game_id": "0021701219", "chunk_id": "0021701219_015", "order": 15, "role": "body", "text": "Boston led 83-70 entering the final quarter."}
{"game_id": "0021701219", "chunk_id": "0021701219_016", "order": 16, "role": "body", "text": "Entering the playoffs as the No. 2 seed, the Celtics hardly look like the team that was projected to go deep into the postseason."}
{"game_id": "0021701219", "chunk_id": "0021701219_017", "order": 17, "role": "body", "text": "Star guard Kyrie Irving was lost for the remainder of the season after left knee surgery last weekend and key reserve guard Marcus Smart is likely sidelined for most -- if not all -- of the opening round. That comes after Boston lost prize offseason free agent acquisition Gordon Hayward to a gruesome ankle injury on opening night."}
{"game_id": "0021701219", "chunk_id": "0021701219_018", "order": 18, "role": "body", "text": "\"I just look at this as an opportunity for other people,\" Stevens said."}
{"game_id": "0021701219", "chunk_id": "0021701219_019", "order": 19, "role": "body", "text": "The Nets, meanwhile, headed into their third straight offseason without a playoff berth."}
{"game_id": "0021701219", "chunk_id": "0021701219_021", "order": 21, "role": "body", "text": "NETS: The loss was their ninth straight against the Celtics and was their 11th consecutive time they've ended a regular season by losing."}
{"game_id": "0021701219", "chunk_id": "0021701219_022", "order": 22, "role": "body", "text": "Celtics: Stevens said Rozier injured his left pinkie finger against the Wizards on Tuesday night, but could have played. ... Stevens said of the lineup filled with mostly reserves and former G-League players: \"This is a big night for some of those guys. I think we all owe it, guys that aren't playing, coaches, to be really locked in and to bring everything we've got. This is their opportunity.\""}
{"game_id": "0021701219", "chunk_id": "0021701219_024", "order": 24, "role": "body", "text": "Atkinson feels like the Celtics' defense will be tough for any playoff opponent."}
{"game_id": "0021701219", "chunk_id": "0021701219_025", "order": 25, "role": "body", "text": "\"No disrespect to the other teams, this is the best defensive team in the league,\" he said before the game. \"I don't care who they are throwing out there, they are very good defensively.\""}
{"game_id": "0021701219", "chunk_id": "0021701219_027", "order": 27, "role": "closing", "text": "Crabbe hit five 3-pointers, extending his Nets' single-season record to 201. Deron Williams is next on the list with 169 in 2012-13."}
