{"game_id": "0021201150", "chunk_id": "0021201150_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  The Detroit Pistons' season ends in four games, but they still could have some effect on the Chicago Bulls' playoff path."}
{"game_id": "0021201150", "chunk_id": "0021201150_002", "order": 2, "role": "body", "text": "Brandon Knight scored 20 points Sunday night to help the Pistons snap an 18-game losing streak against the Bulls with a 99-85 victory. The loss dropped Chicago two games behind Brooklyn in the race for the fourth seed and a chance to host a first-round series in the Eastern Conference playoffs."}
{"game_id": "0021201150", "chunk_id": "0021201150_003", "order": 3, "role": "body", "text": "Jonas Jerebko added 17 points and a season-high nine rebounds for the Pistons, who also ended an eight-game home skid."}
{"game_id": "0021201150", "chunk_id": "0021201150_004", "order": 4, "role": "body", "text": "The Bulls led by as many as 11 points in the first quarter but Detroit gradually caught up and took the lead in the second after starting the period on a 12-4 run."}
{"game_id": "0021201150", "chunk_id": "0021201150_005", "order": 5, "role": "body", "text": "\"From that point on, we started to get stops and get out in transition,\" coach Lawrence Frank said. \"We made a lot of winning-type plays and played with a lot of intensity.\""}
{"game_id": "0021201150", "chunk_id": "0021201150_006", "order": 6, "role": "body", "text": "The Pistons took a 50-46 lead to intermission and pushed it to as many as 10 in the third quarter. Knight scored a dozen points in the period, including a 3-pointer that killed Chicago's last good chance at getting close. Detroit scored the first four points of the fourth and never let the Bulls get closer than 10 points the rest of the night."}
{"game_id": "0021201150", "chunk_id": "0021201150_007", "order": 7, "role": "body", "text": "\"It felt good,\" said Knight, who'd seen the Pistons drop the first three games of the series against Chicago by a combined eight points."}
{"game_id": "0021201150", "chunk_id": "0021201150_008", "order": 8, "role": "body", "text": "\"We were the team to not make mistakes and capitalized on their mistakes.\""}
{"game_id": "0021201150", "chunk_id": "0021201150_009", "order": 9, "role": "body", "text": "Jerebko and Charlie Villanueva (12 points) sparked a bench that outscored Chicago's 33-12."}
{"game_id": "0021201150", "chunk_id": "0021201150_010", "order": 10, "role": "body", "text": "Rodney Stuckey, starting in place of injured point guard Jose Calderon, had 14 points and rookie Andre Drummond, who shot airballs on two late free throws in a one-point loss at Chicago on March 31, added 10 rebounds for Detroit."}
{"game_id": "0021201150", "chunk_id": "0021201150_011", "order": 11, "role": "body", "text": "Carlos Boozer had 21 points and 10 rebounds for the Bulls, who played without leading scorer Luol Deng. Coach Tom Thibodeau wasn't feeling sorry for his team, which has been missing former league MVP Derrick Rose all season."}
{"game_id": "0021201150", "chunk_id": "0021201150_012", "order": 12, "role": "body", "text": "\"You can't use that as an excuse,\" he said. \"Whoever is out there, we have to go out and get the job done.\""}
{"game_id": "0021201150", "chunk_id": "0021201150_013", "order": 13, "role": "body", "text": "Nate Robinson added 18 points and Jimmy Butler scored 14 as Chicago's two-game winning streak ended. Two of the Bulls' last six games are against playoff-bound teams, the same number Brooklyn faces."}
{"game_id": "0021201150", "chunk_id": "0021201150_014", "order": 14, "role": "body", "text": "The teams will not see each other before the postseason."}
{"game_id": "0021201150", "chunk_id": "0021201150_015", "order": 15, "role": "body", "text": "Deng, the Bulls' leading scorer and the NBA's leader in minutes per game, missed the game with a sore hip. Thibodeau said the decision to bench him was \"precautionary.\""}
{"game_id": "0021201150", "chunk_id": "0021201150_016", "order": 16, "role": "body", "text": "Chicago's Joakim Noah, who missed eight games with an injured right foot, and Marco Belinelli, who was out seven with an abdominal strain, each returned Sunday night. Noah finished with 13 points and seven boards."}
{"game_id": "0021201150", "chunk_id": "0021201150_017", "order": 17, "role": "body", "text": "The Bulls were aiming to match the franchise record for consecutive victories over an opponent, which also was against the Pistons. Michael Jordan's 1990s teams won 19 in a row against Detroit."}
{"game_id": "0021201150", "chunk_id": "0021201150_018", "order": 18, "role": "body", "text": "The Pistons treated home fans to their first win since the All-Star break. They hadn't won at the Palace of Auburn Hills since Feb. 13."}
{"game_id": "0021201150", "chunk_id": "0021201150_019", "order": 19, "role": "closing", "text": "Game notes Calderon, who had started all 28 games since Detroit acquired him in a Jan. 30 trade, missed the game with a right triceps strain. ... Chicago's last loss to the Pistons was Dec. 23, 2008. ... The Bulls used their 13th different starting lineup."}
