{"game_id": "0021300819", "chunk_id": "0021300819_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  It was one of the most spectacular plays of a dreary season for the Detroit Pistons: Andre Drummond knocked a pass away near midcourt, took off toward the basket and threw down an emphatic one-handed dunk while being fouled by Atlanta's Elton Brand."}
{"game_id": "0021300819", "chunk_id": "0021300819_002", "order": 2, "role": "body", "text": "\"I knew I didn't have a chance,\" Brand said."}
{"game_id": "0021300819", "chunk_id": "0021300819_003", "order": 3, "role": "body", "text": "Drummond's dunk propelled the Pistons to a 115-107 win over the Hawks on Friday night that snapped Detroit's three-game losing streak and handed Atlanta its eighth straight loss."}
{"game_id": "0021300819", "chunk_id": "0021300819_004", "order": 4, "role": "body", "text": "The Hawks shot 17 of 20 from the field during a 41-point second quarter, but the Pistons rallied from an 11-point halftime deficit."}
{"game_id": "0021300819", "chunk_id": "0021300819_005", "order": 5, "role": "body", "text": "\"We came together at halftime. We asked each other if we really want this,\" Drummond said. \"We looked each other in the eyes as men and we all came together and decided we wanted to do this. So we came out firing.\""}
{"game_id": "0021300819", "chunk_id": "0021300819_006", "order": 6, "role": "body", "text": "Atlanta was without guard Jeff Teague, who was out with a sprained ankle. Al Horford was lost for the season in December with a torn pectoral muscle."}
{"game_id": "0021300819", "chunk_id": "0021300819_007", "order": 7, "role": "body", "text": "Paul Millsap had 23 points for the Hawks."}
{"game_id": "0021300819", "chunk_id": "0021300819_008", "order": 8, "role": "body", "text": "\"We had that huge second quarter, but they must have gotten a huge pep talk at halftime, because they really came out for the third with a lot of energy,\" Atlanta's Kyle Korver said."}
{"game_id": "0021300819", "chunk_id": "0021300819_009", "order": 9, "role": "body", "text": "Drummond's dunk on Brand gave the Pistons a 93-88 lead with 10:00 to play. Brand was a good sport about it, smiling a bit and even appearing to look up at the scoreboard for a replay."}
{"game_id": "0021300819", "chunk_id": "0021300819_010", "order": 10, "role": "body", "text": "Drummond finished 10 of 11 from the field, but the Hawks finally started fouling him intentionally. The Detroit big man finished 0 for 8 on free throws, and the Pistons eventually took him out for the final 3:40."}
{"game_id": "0021300819", "chunk_id": "0021300819_011", "order": 11, "role": "body", "text": "\"Obviously, we're trying to get back into the game, and it helped,\" Hawks coach Mike Budenholzer said. \"We didn't score every time that we tried it, but it gave us a chance. It also helps that he's a great young player and we got him off the floor for a couple minutes.\""}
{"game_id": "0021300819", "chunk_id": "0021300819_012", "order": 12, "role": "body", "text": "It was tied at 104 when Detroit's Kyle Singler made a 3-pointer from the right wing, and Will Bynum doubled the lead with a driving three-point play with 1:06 to go. A 3-pointer by Singler with 30 seconds left made it 113-106."}
{"game_id": "0021300819", "chunk_id": "0021300819_013", "order": 13, "role": "body", "text": "Greg Monroe had 22 points and 15 rebounds for the Pistons, who stood pat at the trade deadline Thursday. Detroit is now 2 1/2 games behind Atlanta and Charlotte, who are in a virtual tie for seventh place in the Eastern Conference."}
{"game_id": "0021300819", "chunk_id": "0021300819_014", "order": 14, "role": "body", "text": "The Hawks looked unstoppable on offense in the second quarter, scoring at will while going the entire period without a turnover. But the Pistons outscored Atlanta 34-20 in the third."}
{"game_id": "0021300819", "chunk_id": "0021300819_015", "order": 15, "role": "body", "text": "It wasn't a perfect second half by any means for Detroit, but the Pistons did show some urgency. Brandon Jennings, who was having a poor shooting game for Detroit, was fouled twice while shooting 3-pointers."}
{"game_id": "0021300819", "chunk_id": "0021300819_016", "order": 16, "role": "body", "text": "After Jennings missed badly from 3-point range, Josh Smith blocked Millsap at the other end, and Jennings was waiting behind the defense for a layup that gave the Pistons an 82-79 lead."}
{"game_id": "0021300819", "chunk_id": "0021300819_017", "order": 17, "role": "body", "text": "\"We made two or three hustle plays that winning teams make,\" Detroit interim coach John Loyer said. \"Two and three bodies on the floor, couple guys going out of bounds. You guys all watch the NBA. The better teams do that.\""}
{"game_id": "0021300819", "chunk_id": "0021300819_018", "order": 18, "role": "body", "text": "Jennings finished with 12 points and 14 assists, although he didn't play at all in the fourth. Detroit went with Bynum instead, and he finished with nine points and seven assists."}
{"game_id": "0021300819", "chunk_id": "0021300819_019", "order": 19, "role": "body", "text": "\"Brandon is a scorer. Brandon has been a great facilitator for us,\" Loyer said. \"He started to attack in the third quarter and Will came in and finished it. That's what teammates do.\""}
{"game_id": "0021300819", "chunk_id": "0021300819_020", "order": 20, "role": "closing", "text": "Game notes Atlanta shot 85 percent in the second quarter, one of the top marks for one quarter in the NBA this season. Denver shot 87 percent (13 for 15) in the fourth quarter at Toronto on Dec. 1, according to STATS. ... The Pistons outscored the Hawks 66-34 in the paint. ... Kyle Korver was 2 for 4 from 3-point range, extending his NBA record to 123 consecutive games with a 3."}
