{"game_id": "0021700718", "chunk_id": "0021700718_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Lou Williams was doing his part to keep Los Angeles' offense flowing, and coach Doc Rivers gave the scorer a little extra incentive to make sure the Clippers kept the pressure on the Memphis Grizzlies."}
{"game_id": "0021700718", "chunk_id": "0021700718_002", "order": 2, "role": "body", "text": "\"I told him in the middle of the third (quarter): `If we don't win, we've got practice (Saturday),\" Rivers recounted after the Clippers' 109-100 victory over the Grizzlies on Friday night. \"From that point on, Lou was phenomenal.\""}
{"game_id": "0021700718", "chunk_id": "0021700718_003", "order": 3, "role": "body", "text": "As often happens, Williams got rolling early and kept on going, ending up with 40 points and 10 assists, overshadowing a triple-double by Memphis center Marc Gasol."}
{"game_id": "0021700718", "chunk_id": "0021700718_004", "order": 4, "role": "body", "text": "\"I'm a scorer, but just the opportunity to be out on the floor with what's expected of me,\" said Williams, who played 34 minutes. \"It's unique. ... Usually, I'd play to 25 minutes a game. I think I have more of a leadership role now.\""}
{"game_id": "0021700718", "chunk_id": "0021700718_005", "order": 5, "role": "body", "text": "Williams was 12 of 19 from the field and the Clippers shot 49 percent, going 10 of 27 from outside the arc, to snap a three-game skid. Milos Teodosic added a career-high 18 points, DeAndre Jordan had 15 points and nine rebounds, and Blake Griffin finished with 14 points."}
{"game_id": "0021700718", "chunk_id": "0021700718_006", "order": 6, "role": "body", "text": "Williams scored 22 points as the Clippers took a 58-50 lead at halftime, then closed out the game with 11 in the fourth quarter after Rivers' warning about practice."}
{"game_id": "0021700718", "chunk_id": "0021700718_007", "order": 7, "role": "body", "text": "Gasol triple-double included 13 points, 12 rebounds and 10 assists. Memphis was hindered by 20 turnovers leading to 22 Clippers points. Grizzlies interim coach J.B. Bickerstaff, who is having to use younger players right now because of injuries, noted the Grizzlies handed out 31 assists on 39 field goals, but that was only half the equation."}
{"game_id": "0021700718", "chunk_id": "0021700718_008", "order": 8, "role": "body", "text": "\"We need to continue to be unselfish with the ball, continue to assist our teammates,\" Bickerstaff said, \"but we have to be sure with our passes. Be sure that we're completing our passes to our teammates.\""}
{"game_id": "0021700718", "chunk_id": "0021700718_009", "order": 9, "role": "body", "text": "Mario Chalmers had 17 points and 10 assists for the Grizzlies. Jarell Martin also had 17 points, and Dillon Brooks contributed 15 points."}
{"game_id": "0021700718", "chunk_id": "0021700718_010", "order": 10, "role": "body", "text": "After the Clippers' lead reached 14 early in the fourth, Memphis did get the deficit to eight points on two occasions in the final 4:35 only to have Williams score again each time to prevent the Grizzlies from getting any closer."}
{"game_id": "0021700718", "chunk_id": "0021700718_011", "order": 11, "role": "body", "text": "\"You just don't put teams away,\" Rivers said. \"I thought we had too many opportunities to do it, we just couldn't get away from them.\""}
{"game_id": "0021700718", "chunk_id": "0021700718_013", "order": 13, "role": "body", "text": "Clippers: Jordan played his 716th game as a Clipper, passing Randy Smith for most games as a Clipper in franchise history. ... Williams has scored at least 20 points off the bench in 11 straight games. ... Williams has four games this season with at least 40 points. ...The victory gave the Clippers a split in the season series. .Are 8-2 when Teodosic reaches double figures"}
{"game_id": "0021700718", "chunk_id": "0021700718_014", "order": 14, "role": "body", "text": "Grizzlies: Played without G Mike Conley. The Grizzlies are 10-26 without Conley, who continues to recover from a left heel injury. ... Gasol's triple-double was the fourth of his career. No other player in franchise history has more than two. .Chalmers double-double was his first of the season."}
{"game_id": "0021700718", "chunk_id": "0021700718_016", "order": 16, "role": "body", "text": "The game was the 100th meeting between the Grizzlies and Clippers, including playoffs. The victory gave the Clippers a 51-49 advantage in the series."}
{"game_id": "0021700718", "chunk_id": "0021700718_018", "order": 18, "role": "body", "text": "Travis Walton, an assistant coach with the Agua Caliente Clippers -- the Clippers' G-League team -- was placed on administrative leave by the organization earlier in the day, \"pending further investigation.\" Walton, who played at Michigan State, was accused of assault in two incidents in 2010, according to an \"Outside the Lines\" report on ESPN. Clippers officials did not elaborate on the situation beyond the release announcing Walton's status."}
{"game_id": "0021700718", "chunk_id": "0021700718_020", "order": 20, "role": "body", "text": "Williams, who was part of the Houston package traded to the Clippers for Chris Paul last summer, has been a surprise even to Rivers. \"We liked getting him in the deal,\" Rivers said, adding: \"We didn't know we were going to get a guy that was going to get 40 (points) and 10 (assists) for us, I can tell you that.\""}
{"game_id": "0021700718", "chunk_id": "0021700718_022", "order": 22, "role": "body", "text": "Clippers: At New Orleans on Sunday"}
{"game_id": "0021700718", "chunk_id": "0021700718_023", "order": 23, "role": "body", "text": "Grizzlies: Host Phoenix on Monday night."}
{"game_id": "0021700718", "chunk_id": "0021700718_025", "order": 25, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
