{"game_id": "0021700729", "chunk_id": "0021700729_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Kicked back in the office chair at his locker, Jimmy Butler put his feet up on another chair and called reporters over."}
{"game_id": "0021700729", "chunk_id": "0021700729_002", "order": 2, "role": "body", "text": "Following his first game back after a four-game absence, Butler's first comments about himself regarded his 4-of-14 shooting. The Minnesota Timberwolves know Butler's impact goes well beyond his shooting, and it showed again against Brooklyn."}
{"game_id": "0021700729", "chunk_id": "0021700729_003", "order": 3, "role": "body", "text": "Butler scored 21 points, Karl-Anthony Towns had 16 points and 19 rebounds for his NBA-leading 43rd double-double and Minnesota beat the Nets 111-97 on Saturday night."}
{"game_id": "0021700729", "chunk_id": "0021700729_004", "order": 4, "role": "body", "text": "\"Like a bum,\" Butler said of his return. \"I couldn't buy a basket. But, hey, there's other ways to change the game. So, I'll be all right. Go get some work in tomorrow, come out firing again.\""}
{"game_id": "0021700729", "chunk_id": "0021700729_005", "order": 5, "role": "body", "text": "Butler added six rebounds and five assists after missing four games with right knee soreness. Andrew Wiggins scored 21 points and Jamal Crawford added 16 to help the Timberwolves snap a two-game skid."}
{"game_id": "0021700729", "chunk_id": "0021700729_006", "order": 6, "role": "body", "text": "\"The intensity is so much different,\" Minnesota coach Tom Thibodeau said of Butler being on the court. \"I thought first game back, a lot of big plays. When the game was in the balance, he made big play after big play.\""}
{"game_id": "0021700729", "chunk_id": "0021700729_007", "order": 7, "role": "body", "text": "Jahlil Okafor scored 21 points, and Nick Stauskas added 15 for a short-handed Brooklyn squad that has lost six of eight games. Nets coach Kenny Atkinson was ejected in the fourth quarter after coming out on the court to argue a call. Players and coaches had to restrain the enraged Atkinson."}
{"game_id": "0021700729", "chunk_id": "0021700729_008", "order": 8, "role": "body", "text": "\"Guys are a little fatigued,\" Atkinson said. \"This is a tough road trip. I'm glad we didn't give in. This team doesn't give in. The majority of the time I've been here, the attitude's been excellent. I knew they weren't going to give up. Even after I got thrown out, they still kept fighting for the old man.\""}
{"game_id": "0021700729", "chunk_id": "0021700729_009", "order": 9, "role": "body", "text": "After a lopsided loss in Milwaukee on Friday night, Brooklyn struggled mightily in the first quarter. The Nets shot 33.3 percent and had nine turnovers in the quarter. The Wolves built the lead to 26 early in the second before Brooklyn found some footing with its reserves in Okafor and Stauskas."}
{"game_id": "0021700729", "chunk_id": "0021700729_010", "order": 10, "role": "body", "text": "The lead would close to five early in the third before Towns made his impact."}
{"game_id": "0021700729", "chunk_id": "0021700729_011", "order": 11, "role": "body", "text": "Towns, who was elected to his first All-Star Game, was scoreless until 3:46 in the first half. He attacked the offensive glass, grabbing a career-high nine offensive rebounds. He had eight points in the third as Minnesota quickly countered Brooklyn's run."}
{"game_id": "0021700729", "chunk_id": "0021700729_012", "order": 12, "role": "body", "text": "\"Karl had a great offensive rebounding game, and overall rebounding game,\" Thibodeau said. \"I thought he had great impact on the game. We didn't close out that second quarter well, but he had some big-time offensive rebounds and that really put us over the top.\""}
{"game_id": "0021700729", "chunk_id": "0021700729_014", "order": 14, "role": "body", "text": "Atkinson said his reaction was regarding a call against Joe Harris, but the coach declined to get into specifics. Harris said the frustration could be mounting."}
{"game_id": "0021700729", "chunk_id": "0021700729_015", "order": 15, "role": "body", "text": "\"You can't necessarily put it all on one game,\" Harris said. \"Especially, we're at the end of a long road trip where we lost some tough games, been in some close ones. Kenny's just trying to fight for his guys.\""}
{"game_id": "0021700729", "chunk_id": "0021700729_017", "order": 17, "role": "body", "text": "In the four games Butler missed, Wiggins stepped up his scoring with 25.8 points per game. He scored at least 20 points for the fourth time in five games and has tied or been the team's leading scorer in four of five games after doing so just once over the previous 24 games."}
{"game_id": "0021700729", "chunk_id": "0021700729_019", "order": 19, "role": "body", "text": "Nets: Rondae Hollis-Jefferson (right groin strain) and Caris Levert (sore left groin) were out of the lineup for Brooklyn. Hollis-Jefferson was injured in Friday's game in Milwaukee and Atkinson wasn't sure if he will return for the next game. Levert was a late scratch. ... D'Angelo Russell was also held out for the second game of the back-to-back with the team managing his return from knee surgery. ... G Isaiah Whitehead was recalled from the Long Island Nets of the G League earlier in the day. ... Stauskas scored double-figures for the fourth time this season and the first time since he had 21 points on Dec. 27."}
{"game_id": "0021700729", "chunk_id": "0021700729_020", "order": 20, "role": "body", "text": "Timberwolves: Butler has missed six games for Minnesota this season. The Wolves are 2-4 without him in the lineup. ... Minnesota has lost back-to-back games six times this season, but hasn't had a three-game losing streak. ... The 11 points allowed in the first was the fewest by Minnesota this season and the 30-11 advantage was the largest lead after the first this season."}
{"game_id": "0021700729", "chunk_id": "0021700729_022", "order": 22, "role": "body", "text": "Nets: At New York Knicks on Tuesday night."}
{"game_id": "0021700729", "chunk_id": "0021700729_023", "order": 23, "role": "body", "text": "Timberwolves: At Atlanta on Monday night."}
{"game_id": "0021700729", "chunk_id": "0021700729_025", "order": 25, "role": "body", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
{"game_id": "0021700729", "chunk_id": "0021700729_027", "order": 27, "role": "closing", "text": "This story has been corrected to Nets instead of Knicks in scoreline."}
