{"game_id": "0021700436", "chunk_id": "0021700436_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Boston saw a lead that once reached 21 points, slip away in the third quarter, but the Celtics made sure they didn't trail for long."}
{"game_id": "0021700436", "chunk_id": "0021700436_002", "order": 2, "role": "body", "text": "On the short end of a 73-71 score after three, Boston opened the final frame with 16 straight points to pull away from the Memphis Grizzlies for a 102-93 victory on Saturday night."}
{"game_id": "0021700436", "chunk_id": "0021700436_003", "order": 3, "role": "body", "text": "\"We just stayed composed and went out and executed,\" said Celtics forward Al Horford, who scored 15 points. \"We got some stops on defense. On the offensive end, we moved the ball pretty well. I think that was the difference. We opened up the game after that.\""}
{"game_id": "0021700436", "chunk_id": "0021700436_004", "order": 4, "role": "body", "text": "Kyrie Irving scored 20 points, Jayson Tatum had 19 points and nine rebounds, part of six Celtics reaching double figures. The Celtics shot 49 percent, including 14 of 30 (46.7 percent) from outside the arc."}
{"game_id": "0021700436", "chunk_id": "0021700436_005", "order": 5, "role": "body", "text": "Marc Gasol led Memphis with 30 points and 10 rebounds. Tyreke Evans added 25 points, and Dillon Brooks had 14 points, hitting a season-best four 3-pointers."}
{"game_id": "0021700436", "chunk_id": "0021700436_006", "order": 6, "role": "body", "text": "Boston led by 21 in the first half, but Memphis used a 21-point third quarter by Gasol to take a 73-71 lead after three. And the Memphis crowd, which has suffered through the team losing 17 of its last 19, rose in enthusiasm with the comeback."}
{"game_id": "0021700436", "chunk_id": "0021700436_007", "order": 7, "role": "body", "text": "The excitement was short-lived as Boston went on its rally to open the fourth."}
{"game_id": "0021700436", "chunk_id": "0021700436_008", "order": 8, "role": "body", "text": "\"Obviously, Gasol got it going. You're going to take a team's shot like that, but you have to weather that storm and stay the course,\" Boston coach Brad Stevens said."}
{"game_id": "0021700436", "chunk_id": "0021700436_009", "order": 9, "role": "body", "text": "There was little doubt about the way the game turned in the early minutes of the fourth, and Memphis expended a lot of energy getting back even with the Celtics before that point."}
{"game_id": "0021700436", "chunk_id": "0021700436_010", "order": 10, "role": "body", "text": "\"When you play a team like this with guys that can shoot and create the way that they can, they make you pay for mistakes,\" Memphis interim coach J.B. Bickerstaff said. \"And you've got to give them credit, they created a lot of those mistakes.\""}
{"game_id": "0021700436", "chunk_id": "0021700436_012", "order": 12, "role": "body", "text": "Celtics: Rookie F Daniel Theis, who broke his nose in Friday's loss to Utah, was back in action against the Grizzlies, wearing a mask. ... Tatum, who entered the game, leading the league in 3-point shooting at 50 percent (48 of 96), made both of his shots from outside the arc in the game."}
{"game_id": "0021700436", "chunk_id": "0021700436_013", "order": 13, "role": "body", "text": "Grizzlies: The Celtics outscored Memphis 31-12 in the first quarter, marking the 14th time in the last 18 games that the Grizzlies were outscored in a quarter by at least nine points. ... Gasol's 21 points in the third were one shy of a Memphis franchise record for points in a quarter. ... Ten of the last 12 Memphis opponents have shot 40 percent or better from outside the arc."}
{"game_id": "0021700436", "chunk_id": "0021700436_015", "order": 15, "role": "body", "text": "The Celtics play the Philadelphia 76ers in London on Jan. 11, and Stevens sees it as an opportunity to showcase the Boston franchise. \"As a coach, you look at it, and see challenges that come along with it,\" he said. \"But it's a great experience for our players and our organization.\" He added that previous trips abroad in Madrid and Milan \"kind of opened your eyes to the Celtics and the following overseas.\""}
{"game_id": "0021700436", "chunk_id": "0021700436_017", "order": 17, "role": "body", "text": "Tatum, the rookie forward from Duke, played in his 32nd game Saturday night, about the amount of a regular season college game. And, he acknowledged, he can tell the difference. \"It's tough,\" he said. \"The traveling, playing back-to-backs. It's still an adjustment. I'm still trying to get used to it. I'm just trying to rest as much as possible.\""}
{"game_id": "0021700436", "chunk_id": "0021700436_019", "order": 19, "role": "body", "text": "\"He only made four 3-pointers but it felt like 15.\" -- Stevens on Memphis center Marc Gasol's shooting in the fourth quarter."}
{"game_id": "0021700436", "chunk_id": "0021700436_021", "order": 21, "role": "body", "text": "Gasol on if there is a point in the season when he panics over results: \"I don't work that way. Every morning, I take my positive vitamins and do my Zen or yoga or whatever I need to do to block everything out.\""}
{"game_id": "0021700436", "chunk_id": "0021700436_023", "order": 23, "role": "body", "text": "Celtics: At Indiana on Monday night"}
{"game_id": "0021700436", "chunk_id": "0021700436_024", "order": 24, "role": "body", "text": "Grizzlies: At Golden State on Wednesday night."}
{"game_id": "0021700436", "chunk_id": "0021700436_026", "order": 26, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
