{"game_id": "0021701194", "chunk_id": "0021701194_001", "order": 1, "role": "lead", "text": "HOUSTON --  The Oklahoma City Thunder adopted a simple mantra for Saturday's game against the Houston Rockets with their playoff fate still up in the air."}
{"game_id": "0021701194", "chunk_id": "0021701194_002", "order": 2, "role": "body", "text": "\"We just better not lose,\" Paul George said."}
{"game_id": "0021701194", "chunk_id": "0021701194_003", "order": 3, "role": "body", "text": "For one night at least, it worked."}
{"game_id": "0021701194", "chunk_id": "0021701194_004", "order": 4, "role": "body", "text": "George and Russell Westbrook each scored 24 points, and Oklahoma City snapped Houston's 20-game home winning streak with a 108-102 victory."}
{"game_id": "0021701194", "chunk_id": "0021701194_005", "order": 5, "role": "body", "text": "The Thunder were down one with about seven minutes left before scoring the next 11 points."}
{"game_id": "0021701194", "chunk_id": "0021701194_006", "order": 6, "role": "body", "text": "Oklahoma City (46-34) is tied with San Antonio and New Orleans for fifth in the loaded Western Conference, a half-game behind idle Utah. The Thunder can clinch a playoff spot with a victory at Miami on Monday."}
{"game_id": "0021701194", "chunk_id": "0021701194_007", "order": 7, "role": "body", "text": "\"This game was important but the Monday game is just as important as this game because if we don't take care of business Monday then this game doesn't really mean anything,\" said Carmelo Anthony, who had 22 points."}
{"game_id": "0021701194", "chunk_id": "0021701194_008", "order": 8, "role": "body", "text": "The Thunder took two of three in the season series against the NBA-best Rockets."}
{"game_id": "0021701194", "chunk_id": "0021701194_009", "order": 9, "role": "body", "text": "James Harden had 26 points for Houston, and Chris Paul added 17."}
{"game_id": "0021701194", "chunk_id": "0021701194_010", "order": 10, "role": "body", "text": "\"I thought we tasted the playoff atmosphere because these guys are fighting for their lives and we're not,\" Houston coach Mike D'Antoni said. \"It's human nature, there's no reward in winning.\""}
{"game_id": "0021701194", "chunk_id": "0021701194_011", "order": 11, "role": "body", "text": "Paul hit a step-back jumper and Gerald Green scored to give the Rockets a 92-91 lead with 7:09 left. But Westbrook scored five quick points to start an 11-0 run by Oklahoma City that made it 102-92 with about four minutes remaining."}
{"game_id": "0021701194", "chunk_id": "0021701194_012", "order": 12, "role": "body", "text": "Houston went scoreless for more than four minutes, missing seven shots and committing three turnovers as Oklahoma City pulled away. The Thunder also blocked three shots in that span."}
{"game_id": "0021701194", "chunk_id": "0021701194_013", "order": 13, "role": "body", "text": "\"Just doing what you've got to do to win, honestly,\" Westbrook said."}
{"game_id": "0021701194", "chunk_id": "0021701194_014", "order": 14, "role": "body", "text": "The Rockets scored five straight points with less than a minute left to get within five, but George made two free throws to help secure the win."}
{"game_id": "0021701194", "chunk_id": "0021701194_015", "order": 15, "role": "body", "text": "Anthony made three of the Thunder's 10 3-pointers. He said it was important for them to be in attack mode right from the start."}
{"game_id": "0021701194", "chunk_id": "0021701194_016", "order": 16, "role": "body", "text": "\"It was one of those days, understanding the situation that we're in and just trying to be aggressive out there on both ends and go after it from the beginning,\" he said."}
{"game_id": "0021701194", "chunk_id": "0021701194_017", "order": 17, "role": "body", "text": "The Thunder led by as many as 11 in the first half, but Houston used a 5-1 spurt take a 62-61 lead at halftime."}
{"game_id": "0021701194", "chunk_id": "0021701194_019", "order": 19, "role": "body", "text": "Thunder: Westbrook also had 10 assists. ... Oklahoma City had five blocked shots, including two from Jerami Grant. ... Steven Adams added 12 points."}
{"game_id": "0021701194", "chunk_id": "0021701194_020", "order": 20, "role": "body", "text": "Rockets: Paul received a technical foul in the second quarter after arguing after being called for an offensive foul. ... Ryan Anderson missed his second straight game with a sprained left ankle. ... Eric Gordon also sat out for the second straight game with a sore left ankle."}
{"game_id": "0021701194", "chunk_id": "0021701194_022", "order": 22, "role": "body", "text": "Harden on if the Rockets are where they want to be with the playoffs starting in a week: \"We're good. We're in a great place right now. We have two more games to close it out and be ready for the playoffs.\""}
{"game_id": "0021701194", "chunk_id": "0021701194_024", "order": 24, "role": "body", "text": "Saturday was just the third time this season where Houston has lost when Harden, Paul and Clint Capela all played. The Rockets are 41-3 when each member of the trio plays and their three losses have come by a total of 11 points."}
{"game_id": "0021701194", "chunk_id": "0021701194_026", "order": 26, "role": "body", "text": "Thunder: Visit Heat on Monday night."}
{"game_id": "0021701194", "chunk_id": "0021701194_027", "order": 27, "role": "closing", "text": "Rockets: Visit Lakers on Tuesday night."}
