{"game_id": "0021700238", "chunk_id": "0021700238_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Detroit got a bit of everything down the stretch. A gutty performance from Andre Drummond after hurting his elbow. A tough shot from Reggie Jackson over Karl-Anthony Towns. Two big free throws from Tobias Harris."}
{"game_id": "0021700238", "chunk_id": "0021700238_002", "order": 2, "role": "body", "text": "But Stan Van Gundy knew his Pistons needed just a tiny bit more to outlast Minnesota on Sunday night."}
{"game_id": "0021700238", "chunk_id": "0021700238_003", "order": 3, "role": "body", "text": "\"You've still got to get lucky,\" the coach said."}
{"game_id": "0021700238", "chunk_id": "0021700238_004", "order": 4, "role": "body", "text": "That luck came in the closing seconds when Jimmy Butler missed the third of three free throws and a 3-point attempt as time expired, and the Pistons escaped Minnesota with a 100-97 victory."}
{"game_id": "0021700238", "chunk_id": "0021700238_005", "order": 5, "role": "body", "text": "Drummond had 20 points and 16 rebounds, Harris and Avery Bradley added 18 points each and the Pistons snapped their two-game skid and Minnesota's three-game streak."}
{"game_id": "0021700238", "chunk_id": "0021700238_006", "order": 6, "role": "body", "text": "\"I didn't want to lose,\" Drummond said. \"I mean, I have that mentality every night. But this game, I didn't want to go 0-3 on the road. We were trying to get this one and we needed it going into tomorrow. We fought hard.\""}
{"game_id": "0021700238", "chunk_id": "0021700238_007", "order": 7, "role": "body", "text": "The Pistons trailed by as many as 11, and Minnesota led 93-92 with 1:45 to go after Wiggins went 1 for 2 from the line. But Jackson hit a floater and a layup to give Detroit the lead for good."}
{"game_id": "0021700238", "chunk_id": "0021700238_008", "order": 8, "role": "body", "text": "Jackson hit a 19-footer with 7-footer Towns in his face to make it 98-95 with 19.7 seconds to play. But the Wolves found hope when Bradley fouled Butler from the 3-point line with 6.2 to go."}
{"game_id": "0021700238", "chunk_id": "0021700238_009", "order": 9, "role": "body", "text": "He made the first two, but then Jackson appeared to mess with Butler's rhythm by yelling to his teammates and delaying the final shot. Butler missed it."}
{"game_id": "0021700238", "chunk_id": "0021700238_010", "order": 10, "role": "body", "text": "\"He had nothing to do with that, I just missed one,\" Butler said."}
{"game_id": "0021700238", "chunk_id": "0021700238_012", "order": 12, "role": "body", "text": "\"Not going to lie. ... He's one of the closers in this league and everybody knows it,\" Jackson said. \"The ball bounced our way fortunately tonight, but I definitely expected him to make it.\""}
{"game_id": "0021700238", "chunk_id": "0021700238_013", "order": 13, "role": "body", "text": "Harris's free throws finished off Detroit's final 16-7 run, and Butler's last-second 3-point attempt rattled out to draw a loud groan from the crowd."}
{"game_id": "0021700238", "chunk_id": "0021700238_014", "order": 14, "role": "body", "text": "Butler led the Wolves with 26 points and 10 rebounds, and Andrew Wiggins had 24."}
{"game_id": "0021700238", "chunk_id": "0021700238_016", "order": 16, "role": "body", "text": "Jackson scored nine of his 16 points in the fourth, and had two rebounds and an assist to Drummond in the final two minutes. Van Gundy credited Jackson's decision making and passes."}
{"game_id": "0021700238", "chunk_id": "0021700238_017", "order": 17, "role": "body", "text": "\"To me, that's his best finish of the year,\" Van Gundy said. \"He got a lot of credit in the Atlanta game, he made some good shots. That was great point guard play down the stretch.\""}
{"game_id": "0021700238", "chunk_id": "0021700238_018", "order": 18, "role": "body", "text": "Jackson finished the night 7 of 11 from the floor and led the Pistons with eight assists."}
{"game_id": "0021700238", "chunk_id": "0021700238_019", "order": 19, "role": "body", "text": "\"Reggie Jackson was being Reggie Jackson,\" Drummond said. \"Under five minutes, just get that man the basketball and let him play. He did an amazing job of getting guys open. ... He got me a hook shot in the paint, and he scored the rest of the way. You couldn't ask for a better momentum swing.\""}
{"game_id": "0021700238", "chunk_id": "0021700238_021", "order": 21, "role": "body", "text": "Detroit outscored Minnesota 29-17 in the fourth quarter, and Butler's last-second three was officially his only attempt of the period. Towns, meanwhile, went 1 of 4 from the floor, and the Wolves went 6 of 17 as a team. Still, players insisted they ran the offense they wanted."}
{"game_id": "0021700238", "chunk_id": "0021700238_022", "order": 22, "role": "body", "text": "\"We executed them pretty well, we just missed some shots,\" Towns said."}
{"game_id": "0021700238", "chunk_id": "0021700238_024", "order": 24, "role": "body", "text": "Pistons: Drummond had his 12th double-double of the season. He briefly sat out midway through the third after coming down hard on his left elbow, and had to be helped to the bench. ... Detroit had 25 assists on 39 field goals. ... Jon Leuer missed his seventh straight game, and Van Gundy said the forward would have another MRI on Monday to evaluate his sprained left ankle. \"Just hasn't progressed the way we thought,\" Van Gundy said. :We certainly thought he'd be back, even at the beginning of this trip, and it just hasn't materialized. So we'll get in there and see what's going on and see if there's anything major, or if he just needs some more time.\""}
{"game_id": "0021700238", "chunk_id": "0021700238_025", "order": 25, "role": "body", "text": "Timberwolves: Towns had 16 points. ... Butler hit a season-high 10 field goals, and had his sixth 20-point game of the season. He has scored 20 in four of his last five games. ... Wiggins had his ninth 20-point night of the season."}
{"game_id": "0021700238", "chunk_id": "0021700238_027", "order": 27, "role": "body", "text": "Pistons: Hosts Cleveland on Monday night."}
{"game_id": "0021700238", "chunk_id": "0021700238_028", "order": 28, "role": "body", "text": "Timberwolves: At Charlotte on Monday night."}
{"game_id": "0021700238", "chunk_id": "0021700238_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
