{"game_id": "0021700446", "chunk_id": "0021700446_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  The Minnesota Timberwolves needed a spark at the end of a so-so homestand."}
{"game_id": "0021700446", "chunk_id": "0021700446_002", "order": 2, "role": "body", "text": "Jimmy Butler picked them up and carried them on his ailing back."}
{"game_id": "0021700446", "chunk_id": "0021700446_003", "order": 3, "role": "body", "text": "Butler powered through a recent bout of back spasms to score 37 points, sinking two free throws that gave the Timberwolves the lead with 2.5 seconds left in a 108-107 comeback victory over the Portland Trail Blazers on Monday night."}
{"game_id": "0021700446", "chunk_id": "0021700446_004", "order": 4, "role": "body", "text": "\"I ride for everybody in this locker room. I'm going to battle with them as long as I can walk,\" Butler said."}
{"game_id": "0021700446", "chunk_id": "0021700446_005", "order": 5, "role": "body", "text": "Jamal Crawford pitched in a season-high 23 points in 23 minutes, with 16 in the fourth quarter to spur the rally from 10 points down with 7 1/2 minutes remaining. The Wolves completed their third comeback win this season from a double-digit deficit, with Butler and Crawford combining for their final 21 points."}
{"game_id": "0021700446", "chunk_id": "0021700446_006", "order": 6, "role": "body", "text": "\"We needed to get some passion going,\" said Crawford, whose steal near midcourt set up a fast-break feed to Butler for a crowd-cajoling dunk that brought the Wolves within 97-95 with 5:31 to go."}
{"game_id": "0021700446", "chunk_id": "0021700446_007", "order": 7, "role": "body", "text": "Crawford's three-point play with 2:49 left pulled the Wolves to 105-104, and Blazers star C.J. McCollum missed his next two shots. Defense has been a recurring problem for Minnesota this season, but Andrew Wiggins stuffed a shot by Al-Farouq Aminu along the baseline with 1:06 left to cause a critical turnover."}
{"game_id": "0021700446", "chunk_id": "0021700446_008", "order": 8, "role": "body", "text": "Butler made two foul shots on the other end to put the Wolves in front again at 106-105, with the fans at Target Center chanting \"MVP! MVP!\" McCollum's pull-up jumper gave the Blazers the lead back. After misses by Butler and Lillard, Aminu fouled Butler at the end of his drive to the basket to put him at the line."}
{"game_id": "0021700446", "chunk_id": "0021700446_009", "order": 9, "role": "body", "text": "Butler went 12 for 21 from the floor and 11 for 12 from the line, finishing one point off his season high for a squad that needed the jolt with just one set of consecutive wins over the last month. The Wolves had already blown fourth-quarter leads to Philadelphia and Phoenix, neither winning teams, on this five-game stretch at home."}
{"game_id": "0021700446", "chunk_id": "0021700446_010", "order": 10, "role": "body", "text": "\"He's changed everything for us,\" coach Tom Thibodeau said."}
{"game_id": "0021700446", "chunk_id": "0021700446_011", "order": 11, "role": "body", "text": "McCollum scored 20 points for the Blazers, whose three-game winning streak ended when Damian Lillard's 3-point heave at the buzzer fell short. Jusuf Nurkic had 20 points and Lillard added 17 points and 13 assists, but the Blazers had 17 turnovers and squandered their chance to finish 4-1 on a five-game road trip for a second time this season."}
{"game_id": "0021700446", "chunk_id": "0021700446_012", "order": 12, "role": "body", "text": "\"Maybe we've just got to be stronger with the ball and make smarter plays,\" Lillard said."}
{"game_id": "0021700446", "chunk_id": "0021700446_014", "order": 14, "role": "body", "text": "Blazers: Lillard notched his fifth double-double of the season, his second in a row. ... The Blazers went 10 for 24 from 3-point range, their sixth game in the last eight outings with double-digit makes from long range."}
{"game_id": "0021700446", "chunk_id": "0021700446_015", "order": 15, "role": "body", "text": "Wolves: This was Butler's fourth 30-plus point game of the season. ... It was the team's fourth straight game with 10 or fewer turnovers."}
{"game_id": "0021700446", "chunk_id": "0021700446_017", "order": 17, "role": "body", "text": "Aminu added 13 points for the Blazers, who shot a season-best 54.8 percent from the field. They were awarded only five throws, none in the first half, a discrepancy that had them steamed afterward."}
{"game_id": "0021700446", "chunk_id": "0021700446_018", "order": 18, "role": "body", "text": "\"I got hit in the face one time, and it's like in shooting motion,\" Lillard said. \"It's a clear, easy play, and it's impacting the game, man.\""}
{"game_id": "0021700446", "chunk_id": "0021700446_019", "order": 19, "role": "body", "text": "Lillard also argued for a call that never came as he tried to set up for his final attempt."}
{"game_id": "0021700446", "chunk_id": "0021700446_020", "order": 20, "role": "body", "text": "\"The guy's just hugging me from the back, literally hugging me,\" Lillard said. \"It's three referees out there. Somebody's got to see it.\""}
{"game_id": "0021700446", "chunk_id": "0021700446_021", "order": 21, "role": "body", "text": "Whether they were fouling or not was irrelevant to the Wolves. For once, they displayed some intensity on defense down the stretch."}
{"game_id": "0021700446", "chunk_id": "0021700446_022", "order": 22, "role": "body", "text": "\"Now if we can do it every possession, it'd be some beautiful basketball,\" Butler said. \"We've yet to see that, though.\""}
{"game_id": "0021700446", "chunk_id": "0021700446_024", "order": 24, "role": "body", "text": "Butler was lying on the floor in the locker room in pain on Saturday after Minnesota's 108-106 loss to Phoenix on Saturday, putting his status for this game in question. He played as if there was never any doubt about his condition, with 10 of the team's first 14 points in the first five minutes of the game."}
{"game_id": "0021700446", "chunk_id": "0021700446_025", "order": 25, "role": "body", "text": "\"He's a special player,\" Thibodeau said."}
{"game_id": "0021700446", "chunk_id": "0021700446_027", "order": 27, "role": "body", "text": "Shabazz Napier had 15 points in 19 minutes for the Blazers, while Shabazz Muhammad watched from the Wolves bench during his fifth straight healthy scratch. Napier and Muhammad are the only players in NBA history with the first name Shabazz, according to the Basketball Reference website."}
{"game_id": "0021700446", "chunk_id": "0021700446_029", "order": 29, "role": "body", "text": "Blazers: Return home to face San Antonio on Wednesday."}
{"game_id": "0021700446", "chunk_id": "0021700446_030", "order": 30, "role": "body", "text": "Wolves: Play at Denver on Wednesday, starting a stretch of five out of six games on the road to finish 2017."}
{"game_id": "0021700446", "chunk_id": "0021700446_032", "order": 32, "role": "closing", "text": "For more AP NBA coverage: https://apnews.com/tag/NBAbasketball"}
