{"game_id": "0021701082", "chunk_id": "0021701082_001", "order": 1, "role": "lead", "text": "TORONTO --  The Raptors weren't feeling too good about themselves after a fourth-quarter rally gave Toronto its 12th straight win over the Brooklyn Nets."}
{"game_id": "0021701082", "chunk_id": "0021701082_002", "order": 2, "role": "body", "text": "Kyle Lowry had 25 points, 12 assists and 10 rebounds in his 10th triple-double with Toronto, Jonas Valanciunas scored 23 and the Eastern Conference leaders beat Brooklyn 116-112 on Friday night."}
{"game_id": "0021701082", "chunk_id": "0021701082_003", "order": 3, "role": "body", "text": "\"We were not sharp whatsoever,\" Raptors coach Dwane Casey said. \"We did not deserve to win that game.\""}
{"game_id": "0021701082", "chunk_id": "0021701082_004", "order": 4, "role": "body", "text": "DeMar DeRozan scored 12 of his 21 points in the fourth quarter. Fred VanVleet had 16 and Pascal Siakam 11 as the Raptors bounced back from Wednesday's loss at Cleveland."}
{"game_id": "0021701082", "chunk_id": "0021701082_005", "order": 5, "role": "body", "text": "\"For us to come out and play like we did, it was terrible,\" DeRozan said. \"We can't have lapses like that.\""}
{"game_id": "0021701082", "chunk_id": "0021701082_006", "order": 6, "role": "body", "text": "D'Angelo Russell had 18 points, 13 assists and 11 rebounds for his first career triple-double, but the Nets lost their second straight. Brooklyn, which let a 23-point lead slip away in Wednesday's loss to Charlotte, couldn't maintain a 14-point cushion over the Raptors."}
{"game_id": "0021701082", "chunk_id": "0021701082_007", "order": 7, "role": "body", "text": "\"We're not into moral victories but I did like our compete,\" coach Kenny Atkinson said."}
{"game_id": "0021701082", "chunk_id": "0021701082_008", "order": 8, "role": "body", "text": "Russell's triple-double was the first for the Nets since Terrence Williams had one against Chicago on April 9, 2010."}
{"game_id": "0021701082", "chunk_id": "0021701082_009", "order": 9, "role": "body", "text": "\"He had command of that game,\" Atkinson said of Russell. \"I think he took one bad shot the whole night, which he heard about.\""}
{"game_id": "0021701082", "chunk_id": "0021701082_010", "order": 10, "role": "body", "text": "Serge Ibaka scored 10 points for the Raptors, who improved to 30-6 at home -- the best record in the NBA."}
{"game_id": "0021701082", "chunk_id": "0021701082_011", "order": 11, "role": "body", "text": "Rondae Hollis-Jefferson and Allen Crabbe each scored 18 points, DeMarre Carroll had 14 and Jarrett Allen 13 for the Nets."}
{"game_id": "0021701082", "chunk_id": "0021701082_012", "order": 12, "role": "body", "text": "Brooklyn led 91-84 through three quarters but DeRozan scored eight points in a 9-2 spurt that cut it to 95-94 with 8:30 left."}
{"game_id": "0021701082", "chunk_id": "0021701082_013", "order": 13, "role": "body", "text": "Lowry gave Toronto its first lead of the second half with four straight free throws, putting the Raptors up 100-99 with 4:50 remaining."}
{"game_id": "0021701082", "chunk_id": "0021701082_014", "order": 14, "role": "body", "text": "Allen answered with a pair at the line before VanVleet hit a 3-pointer, giving Toronto the lead for good. Lowry followed with a layup and Valanciunas added a pair of free throws."}
{"game_id": "0021701082", "chunk_id": "0021701082_015", "order": 15, "role": "body", "text": "Carroll's 3 with 34 seconds left cut it to 112-109, and an errant pass by Valanciunas gave the Nets the ball at the Raptors end of the floor, but Brooklyn was called for a five-second violation on the inbounds pass."}
{"game_id": "0021701082", "chunk_id": "0021701082_016", "order": 16, "role": "body", "text": "\"We've got to play hard out of the gate, not be in a dogfight coming down to the last couple of possessions,\" DeRozan said."}
{"game_id": "0021701082", "chunk_id": "0021701082_017", "order": 17, "role": "body", "text": "Toronto called a timeout at 8:13 of the third after a 3 by Crabbe capped a 10-1 run that put Brooklyn up 78-67. Casey responded by benching four starters, with only Lowry staying on the floor."}
{"game_id": "0021701082", "chunk_id": "0021701082_018", "order": 18, "role": "body", "text": "\"I don't want to embarrass players like that,\" Casey said, \"but I owe it to the organization, I owe it to our fans to make sure we get guys out there that are going to compete.\""}
{"game_id": "0021701082", "chunk_id": "0021701082_019", "order": 19, "role": "body", "text": "Lowry shot 5 for 6 from 3-point range, giving him 215 3s this season and breaking his own team record of 212 set in 2015-16."}
{"game_id": "0021701082", "chunk_id": "0021701082_021", "order": 21, "role": "body", "text": "Nets: All five starters scored in double figures. ... The Nets have scored 30 or more points in six straight first quarters. ... Dante Cunningham returned after missing three games, the first two because of a concussion. Cunningham was available Wednesday but did not play in Brooklyn's loss to Charlotte."}
{"game_id": "0021701082", "chunk_id": "0021701082_022", "order": 22, "role": "body", "text": "Raptors: F C.J. Miles (illness) missed his second straight game. ... Former Rockets teammates Charles Barkley and Kevin Willis watched from courtside seats."}
{"game_id": "0021701082", "chunk_id": "0021701082_024", "order": 24, "role": "body", "text": "Things started poorly for the Nets when Russell threw the ball away on the game's opening possession. The play ended with Lowry feeding OG Anunoby for an alley-oop dunk."}
{"game_id": "0021701082", "chunk_id": "0021701082_026", "order": 26, "role": "body", "text": "The game was briefly halted in the third quarter because Lowry complained that the rim Toronto was shooting on was uneven. An arena worker mounted a ladder and checked the rim using a spirit level before play resumed. \"For some reason, it did seem off,\" DeRozan said."}
{"game_id": "0021701082", "chunk_id": "0021701082_028", "order": 28, "role": "body", "text": "Nets: Visit the Cleveland Cavaliers on Sunday. Brooklyn won the first meeting of the season but has lost the past two."}
{"game_id": "0021701082", "chunk_id": "0021701082_029", "order": 29, "role": "body", "text": "Raptors: Host the Los Angeles Clippers on Sunday. Toronto has won three straight home games in the series."}
{"game_id": "0021701082", "chunk_id": "0021701082_031", "order": 31, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
