{"game_id": "0021300386", "chunk_id": "0021300386_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. -- Al Jefferson found a groove just in time for the Charlotte Bobcats.\nJefferson scored 15 of his 24 points in the fourth quarter, and the Bobcats overtook the Detroit Pistons for a 116-106 victory Friday night. Charlotte trailed by 20 in the second quarter and by 14 heading into the fourth.\n\"I don't know what was going on in the first half,\" Jefferson said. \"It just got to a point where I'd had enough. I just had to go out there and do what I can do.\"\nKemba Walker scored 34 points for Charlotte and Gerald Henderson added 22, but the fourth quarter belonged to Jefferson. With Detroit up 99-94, the 6-foot-10 center scored six straight points for the game's first and only lead change.\nThen Walker added a 3-pointer from in front of the Detroit bench to make it 103-99. Jefferson scored Charlotte's next seven points on a jumper, a three-point play and a 20-footer that made it 110-102.\nBrandon Jennings had 26 points for Detroit, which rallied from a 21-point deficit to beat Boston on Wednesday but blew a big lead two nights later.\n\"When Al gets into that kind of rhythm, with his offensive game, I'm not sure anyone is going to stop him,\" Pistons coach Maurice Cheeks said. \"We really struggled with their dribble penetration. That had been getting better, but they were able to get their guards to the basket too easily. After that, they just started going to Jefferson in the post and steamrolled us.\"\nDown 89-75, the Bobcats scored the first nine points of the fourth quarter to get back in the game. Charlotte ended up with 72 points in the second half and outscored the Pistons 41-17 in the final quarter.\nThe Pistons lost despite shooting 12 of 23 from 3-point range.\nCharlotte won even though forward Jeff Taylor played less than a minute before going down with a right Achilles injury. Taylor left the game after only 37 seconds. He stayed down for a while after the injury to his right leg and could be heard groaning in pain before he was eventually helped off the court.\nTaylor is expected to undergo further testing Saturday.\nThe Bobcats have won three straight. Jefferson equaled a season high in scoring that he'd set in an overtime win over Toronto on Wednesday.\n\"He played great tonight,\" Charlotte's Cody Zeller said. \"He made some tough shots and carried us in the fourth quarter. He was able to play his game tonight and got good looks down in the post.\"\nJosh Smith scored 18 points for Detroit, and Josh Harrellson scored all 12 of his in the second quarter.\nThe 6-foot-10 Harrellson looked like he was auditioning for a blooper video when he missed three straight layups during one sequence in the final minute of the first quarter. Those ended up being his only misses of the first half.\nKyle Singler and Chauncey Billups made 3-pointers to start the second quarter, giving the Pistons a 37-22 lead. Harrellson added a 16-footer moments later, the first of five consecutive shots he would make in the quarter, including two 3-pointers.\nDetroit led 52-32 after an alley-oop from Will Bynum to Andre Drummond, but there was enough time for the Bobcats not only to win -- but in convincing fashion.\n\"It's real big, especially for a team like us, trying to prove ourselves,\" Jefferson said. \"We came back from 20 points down and we just kept fighting, and stayed together.\"\nGame notes\nDetroit G Rodney Stuckey (sore right shoulder) did not play. ... The Bobcats are still without F Michael Kidd-Gilchrist (broken left hand). ... Charlotte went 25 of 28 on free throws. ... The last team to rally from at least 20 points behind for a victory -- then blow a lead of at least 20 for a loss in the next game was Orlando in 2001, according to STATS. The Magic came back from a 20-point deficit to beat Chicago on Jan. 15, 2001, then blew a 22-point lead in a loss to Dallas three days later."}
