{"game_id": "0021401139", "chunk_id": "0021401139_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  One night after getting a pep talk from his coach, Reggie Jackson came up big for the Detroit Pistons."}
{"game_id": "0021401139", "chunk_id": "0021401139_002", "order": 2, "role": "body", "text": "Jackson scored 15 of his 29 points in the fourth quarter, including the winning layup with 5 seconds remaining, and the Pistons rallied to beat the Miami Heat 99-98 on Saturday night."}
{"game_id": "0021401139", "chunk_id": "0021401139_003", "order": 3, "role": "body", "text": "In the midst of a rough stretch with four games in five days, Detroit coach Stan Van Gundy called Jackson into his office after a loss to Chicago on Friday night."}
{"game_id": "0021401139", "chunk_id": "0021401139_004", "order": 4, "role": "body", "text": "\"(He said) `You gotta go. There's no excuses,\" Jackson said. \"This is something I have been asking for my entire life, something I have always wanted. I want to be the man, and you have to go be special. ... Everything is kind of on my shoulders. We go as I go, so just continue to be aggressive, attack and make the right plays. You have to go chase it.\""}
{"game_id": "0021401139", "chunk_id": "0021401139_005", "order": 5, "role": "body", "text": "Van Gundy was glad to see Jackson come through after their talk."}
{"game_id": "0021401139", "chunk_id": "0021401139_006", "order": 6, "role": "body", "text": "\"Reggie really stepped up,\" Van Gundy said. \"We had a talk about him wanting to have the opportunity to be `the guy.' Well, `the guy' can't be tired. I thought he ... was not the least bit afraid to take the game on his shoulders tonight.\""}
{"game_id": "0021401139", "chunk_id": "0021401139_007", "order": 7, "role": "body", "text": "Andre Drummond had 11 points and 17 rebounds for his 44th double-double, Kentavious Caldwell-Pope scored 19 points and Anthony Tolliver added 15 for the Pistons. Detroit rallied from 15 down in the fourth and closed with a 21-6 run over the final 5:36 to get the win."}
{"game_id": "0021401139", "chunk_id": "0021401139_008", "order": 8, "role": "body", "text": "\"My staff was saying it was the best win of the year,\" Van Gundy said. \"Our guys kept fighting. There are a lot of things you can criticize us for, but through everything that has gone on this year, this group has continued to fight.\""}
{"game_id": "0021401139", "chunk_id": "0021401139_009", "order": 9, "role": "body", "text": "Dwyane Wade scored 24 points and Goran Dragic had 21 for the Heat. Luol Deng added 13 points and Hassan Whiteside had 13 points and 12 rebounds. Miami shot 48 percent (37 for 77) from the field, led by Wade's 11-for-18 effort."}
{"game_id": "0021401139", "chunk_id": "0021401139_010", "order": 10, "role": "body", "text": "Jackson also shot 11 for 18 as the Pistons finished at 49 percent (36 for 73)."}
{"game_id": "0021401139", "chunk_id": "0021401139_011", "order": 11, "role": "body", "text": "James Ennis' dunk gave Miami a 93-78 lead with 7:02 remaining and the Heat appeared headed for an easy win. However, Jackson's three-point play 90 seconds later started the Pistons' wild closing finish."}
{"game_id": "0021401139", "chunk_id": "0021401139_012", "order": 12, "role": "body", "text": "Jackson had 12 points during the game-winning run, and Caldwell-Pope had five -- including a 27-foot 3-pointer with 1:08 remaining that pulled Detroit to 98-97."}
{"game_id": "0021401139", "chunk_id": "0021401139_013", "order": 13, "role": "body", "text": "After Wade missed a 10-footer with 10 seconds to go, Jackson raced up the court and flipped in the go-ahead bucket."}
{"game_id": "0021401139", "chunk_id": "0021401139_014", "order": 14, "role": "body", "text": "\"I really don't remember a defensive stop other than the second-to-last play in the last five minutes,\" Heat coach Erik Spoelstra said.  \"(Jackson) made every big play and we just couldn't get a relief stop or a relief bucket down the stretch.\""}
{"game_id": "0021401139", "chunk_id": "0021401139_015", "order": 15, "role": "body", "text": "The Pistons made their first seven field goals, including three 3-pointers, to take an 18-11 lead in the first 4 minutes. Over the next 20 minutes, though, the Heat defense clamped down, forcing 10 turnovers and holding Detroit to 33 percent shooting during that span."}
{"game_id": "0021401139", "chunk_id": "0021401139_016", "order": 16, "role": "body", "text": "Miami trailed by five after one quarter, but used a 22-6 run to take a 46-35 lead miway through the second. Shawne Williams' buzzer-beating 3 pulled the Pistons to 55-50 at halftime."}
{"game_id": "0021401139", "chunk_id": "0021401139_019", "order": 19, "role": "body", "text": "Pistons: After scoring seven points against the Heat, Tayshaun Prince pulled within 11 of 10,000 as a member of the Pistons. Prince, a Pistons first-round pick in the 2002 draft, was dealt to Memphis in January 2013 and returned to Detroit in February. ...  Shawne Williams was 1-of-21 from 3-point range for the Pistons this season before his buzzer-beater just before halftime. ... This was the third and final regular-season matchup between the two teams. Detroit beat Miami, 108-91, in February and the Heat won 109-102 in March."}
{"game_id": "0021401139", "chunk_id": "0021401139_020", "order": 20, "role": "body", "text": "Heat: Udonis Haslem returned to the lineup after missing two games with a stomach illness and scored the first bucket of the game. He finished with six points and four rebounds."}
{"game_id": "0021401139", "chunk_id": "0021401139_022", "order": 22, "role": "body", "text": "Miami has now dropped three games in a row and six of their eight, including four losses by double digits. With six games left, the Heat (34-42) are guaranteed to finish below .500 for the first time since 2007-08."}
{"game_id": "0021401139", "chunk_id": "0021401139_023", "order": 23, "role": "body", "text": "\"It's going to be tough to get over this game,\" Wade said. \"It's a terrible loss. ... There's no way we should lose this game.\""}
{"game_id": "0021401139", "chunk_id": "0021401139_025", "order": 25, "role": "body", "text": "Drummond was tasked with slowing down Whiteside, Miami's 7-foot big man. Although he may not have lit up the scoreboard, Drummond was a big boost for the Pistons, getting another double-double and playing smart with his fouls down the stretch. He picked up his fifth with 7 minutes to go and still finished out the game."}
{"game_id": "0021401139", "chunk_id": "0021401139_027", "order": 27, "role": "body", "text": "Pistons: Host Boston on Wednesday."}
