{"game_id": "0021700694", "chunk_id": "0021700694_001", "order": 1, "role": "lead", "text": "DENVER --  Jamal Murray showed he can be the closer the Denver Nuggets have been looking for all season."}
{"game_id": "0021700694", "chunk_id": "0021700694_002", "order": 2, "role": "body", "text": "The second-year guard scored a career-high 38 points, including a go-ahead three-point play in the final minute, and Denver beat the Portland Trail Blazers 104-101 on Monday night."}
{"game_id": "0021700694", "chunk_id": "0021700694_003", "order": 3, "role": "body", "text": "After a solid rookie season, Murray has emerged as a leader this year on a team that lacks a go-to player in the fourth quarter. He embraced that role Monday in a game the Nuggets needed."}
{"game_id": "0021700694", "chunk_id": "0021700694_004", "order": 4, "role": "body", "text": "\"Jamal Murray's a guy that can make (shots) throughout the game but he can also make big plays down the stretch,\" Denver coach Michael Malone said. \"It's great to see a young, 20-year-old guard, second year in the NBA, who's not afraid of the moment.\""}
{"game_id": "0021700694", "chunk_id": "0021700694_005", "order": 5, "role": "body", "text": "Nikola Jokic had 16 points and 12 rebounds, and Will Barton hit four free throws in the final 10 seconds to secure the win and spoil Jusuf Nurkic's return to Denver."}
{"game_id": "0021700694", "chunk_id": "0021700694_006", "order": 6, "role": "body", "text": "The Nuggets had lost six of eight."}
{"game_id": "0021700694", "chunk_id": "0021700694_007", "order": 7, "role": "body", "text": "\"We needed this win,\" Murray said. \"It was a division game and we had lost a few in a row. To come out here at home and get this W, it's going to get us back started again.\""}
{"game_id": "0021700694", "chunk_id": "0021700694_008", "order": 8, "role": "body", "text": "Nurkic had 19 points, 12 rebounds and three blocks in his first game back at Pepsi Center. Damian Lillard had 25 points and seven assists for Portland."}
{"game_id": "0021700694", "chunk_id": "0021700694_009", "order": 9, "role": "body", "text": "Nurkic played two-plus seasons with the Nuggets to begin his career, and was playing his first game in Denver since getting dealt to Portland last season. He received a smattering of boos when he was introduced as a starter and a few during the game."}
{"game_id": "0021700694", "chunk_id": "0021700694_010", "order": 10, "role": "body", "text": "He said it didn't feel special to be back."}
{"game_id": "0021700694", "chunk_id": "0021700694_011", "order": 11, "role": "body", "text": "\"It was just another game,\" he said."}
{"game_id": "0021700694", "chunk_id": "0021700694_012", "order": 12, "role": "body", "text": "He nearly had a happy return, but the Trail Blazers couldn't hold a late lead."}
{"game_id": "0021700694", "chunk_id": "0021700694_013", "order": 13, "role": "body", "text": "Lillard gave Portland a 93-86 advantage with a 3-pointer, but the Nuggets rallied to take a 97-95 lead on Mason Plumlee's dunk. CJ McCollum made two free throws and Lillard hit a running bank shot to give Portland a 99-97 lead with 41.7 seconds left."}
{"game_id": "0021700694", "chunk_id": "0021700694_014", "order": 14, "role": "body", "text": "He was fouled on the play but missed the free throw."}
{"game_id": "0021700694", "chunk_id": "0021700694_015", "order": 15, "role": "body", "text": "\"What bothers me the most is I've got to make that free throw,\" Lillard said. \"We were in position to win. Everybody contributed to us being in that position and I've got to be able to shut the door on them.\""}
{"game_id": "0021700694", "chunk_id": "0021700694_016", "order": 16, "role": "body", "text": "Murray's three-point play with 33.6 seconds remaining gave Denver back the lead. The Trail Blazers had two chances to go back in front but couldn't convert. Barton hit two free throws, and after Nurkic's dunk, sealed it with two more foul shots with 1.8 seconds left."}
{"game_id": "0021700694", "chunk_id": "0021700694_017", "order": 17, "role": "body", "text": "Nurkic got going in the third quarter on both ends of the floor. He had 11 points, six rebounds and blocked Jokic's shot near the basket. Later in the possession he stole the ball from his former teammate, which led to a Portland fast break."}
{"game_id": "0021700694", "chunk_id": "0021700694_019", "order": 19, "role": "body", "text": "Trail Blazers: Lillard was selected the Western Conference player of the week by the NBA on Monday. He averaged 29.3 points and eight assists as Portland swept its three games last week. ... The Trail Blazers had more steals (eight) than fouls (seven) in the first half. ... Portland has scored 100 or more points in 12 straight games."}
{"game_id": "0021700694", "chunk_id": "0021700694_020", "order": 20, "role": "body", "text": "Nuggets: Murray's previous career high was 32 points. ... F Wilson Chandler came off the bench after starting all 42 games in which he had played this season. ... F Kenneth Faried was inactive with left ankle soreness."}
{"game_id": "0021700694", "chunk_id": "0021700694_022", "order": 22, "role": "body", "text": "Denver caught a break when the officials reversed themselves and decided to review a ruling that the Nuggets knocked the ball out of Lillard's hands with 9.2 seconds left."}
{"game_id": "0021700694", "chunk_id": "0021700694_023", "order": 23, "role": "body", "text": "\"They told me they weren't going to review, so I called timeout,\" Portland coach Terry Stotts said. \"Then once I called timeout, they said they were going to review it. I probably shouldn't have called timeout.\""}
{"game_id": "0021700694", "chunk_id": "0021700694_024", "order": 24, "role": "body", "text": "Lillard said he was fouled on the play, but that non-call was not reversible."}
{"game_id": "0021700694", "chunk_id": "0021700694_025", "order": 25, "role": "body", "text": "\"When they went to review it I knew we were going to be on the wrong side because they can't go back and change it to a foul,\" he said."}
{"game_id": "0021700694", "chunk_id": "0021700694_027", "order": 27, "role": "body", "text": "Trail Blazers: Host the Minnesota Timberwolves on Wednesday night."}
{"game_id": "0021700694", "chunk_id": "0021700694_028", "order": 28, "role": "body", "text": "Nuggets: Host the New York Knicks on Thursday night."}
{"game_id": "0021700694", "chunk_id": "0021700694_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
