{"game_id": "0021400504", "chunk_id": "0021400504_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. -- For once, the Detroit Pistons aren't playing like a team in disarray.\nThe Pistons routed the Sacramento Kings 114-95 Sunday, giving them their first five-game winning streak in more than five years.\nThe Kings, on the other hand, look as if they have significant problems.\n\"We're not the team we were -- that's clear,\" said DeMarcus Cousins, referring to the Kings' 3-7 record since Michael Malone was fired as coach. \"Our problems go well beyond anything between the lines, but we can't continue to make excuses. Regardless who the man is on the bench, we're the ones playing, and we have to stop feeling for ourselves.\"\nAt the same time, the Pistons have been rejuvenated since releasing Josh Smith in late December. The Pistons are 5-0 without the player that was signed to restore the franchise to glory only 18 months ago.\nThe difference on the floor is obvious. The offense is now running through Brandon Jennings instead of Smith, and the point guard responded with 35 points against the Kings.\n\"It isn't just me, the whole team looks comfortable right now,\" he said. \"We're sharing the ball, and everyone is making plays. When they made a run and got within four, and that's where we have struggled last year and this year. Tonight, we just made some stops and took off.\"\nAndre Drummond had 15 points and 14 rebounds and Greg Monroe had 14 points 11 rebounds for Detroit\nCousins led the Kings with 18 points and 15 rebounds.\n\"We almost need to learn how to play basketball again,\" said Rudy Gay, who combined with Cousins to hit just 10 of 33 shots.\nThe Pistons held the Kings to 46 points on 53 possessions in the first half to build a nine-point lead. Sacramento had zero second-chance points in the half -- it only had two offensive rebounds -- and didn't make a 3-pointer.\n\"That team came into the game as the second-best offensive-rebounding team in the NBA by percentage, so that was a key focus,\" said Pistons coach Stan Van Gundy. \"Tonight, we held them to five offensive rebounds and one second-chance point, so that was huge.\"\nDetroit, whose winning streak has been sparked by improved shooting, made 10 jumpers in the half, including six 3-pointers.\nSacramento, cut the margin to four at the start of the third quarter, but couldn't get any closer until Derrick Williams had a three-point play to pull the Kings to 78-77 in the last minute of the period.\nJennings, though, hit a 3-pointer at the end of the quarter. The Pistons kept hitting shots and getting stops in the fourth quarter, and pulled away for the easy win.\n\"I'm not going to say that teams are afraid to play us -- there are several teams in the NBA who scare people more than we do,\" Van Gundy said. \"But we're playing very well right now.\"\nHOMECOMING\nAs has been common over the past two seasons, the Palace crowd gave a loud ovation to Nik Stauskas when he entered the game for the first time. Like Trey Burke, Tim Hardaway Jr. and Glenn Robinson III, who have all gotten the same response, Stauskas is still popular in Detroit for his part in leading Michigan to the 2013 NCAA championship game.\nTIP-INS\nKings: Rookie forward Eric Moreland underwent shoulder surgery on Saturday in Fremont, California, and is expected to be ready to play for the Kings in the summer league. Moreland only played three games this season and saw limited action in the D-League before tearing the labrum in his left shoulder.\nPistons: The crowd was small due to bad weather and the game being played at the same time as the Lions-Cowboys game, but there was a big cheer when Matt Prater was shown on the videoboard making a field goal to put Detroit up 20-7.\nUP NEXT\nKings: host the Thunder on Wednesday.\nPistons: visit the Spurs on Tuesday."}
