{"game_id": "0021700224", "chunk_id": "0021700224_001", "order": 1, "role": "lead", "text": "DALLAS --  Cross another Texas losing streak off the list for the surging Minnesota Timberwolves."}
{"game_id": "0021700224", "chunk_id": "0021700224_002", "order": 2, "role": "body", "text": "Jimmy Butler led a balanced set of starters with 21 points and the Timberwolves ended a five-game skid in Dallas with a 111-87 victory over the Mavericks on Friday night."}
{"game_id": "0021700224", "chunk_id": "0021700224_003", "order": 3, "role": "body", "text": "Andrew Wiggins added 19 points for the Timberwolves. They won in Dallas for the first time since March 19, 2014, two nights after getting their first win over San Antonio since just about the same time -- April 8, 2014. The losing streak against the Spurs was 12 games."}
{"game_id": "0021700224", "chunk_id": "0021700224_004", "order": 4, "role": "body", "text": "Northwest Division-leading Minnesota rallied from 14 points down early in the third quarter, outscoring lowly Dallas 68-32 in the second half to win for the eighth time in 10 games."}
{"game_id": "0021700224", "chunk_id": "0021700224_005", "order": 5, "role": "body", "text": "Naturally, Butler was asked what the halftime message was from coach Tom Thibodeau."}
{"game_id": "0021700224", "chunk_id": "0021700224_006", "order": 6, "role": "body", "text": "\"You want it quote for quote?\" Butler asked, before relaying some of the expletive-laden speech."}
{"game_id": "0021700224", "chunk_id": "0021700224_007", "order": 7, "role": "body", "text": "\"For the most part, we already knew what we had to do,\" said Butler, who was 3 of 5 from 3-point range and had eight rebounds. \"He came in here and he let us have it a little bit, but when we go out and play with energy like we're supposed to, we'll win.\""}
{"game_id": "0021700224", "chunk_id": "0021700224_008", "order": 8, "role": "body", "text": "The Mavericks allowed a season-low 43 points in the first half, but then had a season low in scoring for a half themselves after halftime. The 68 points allowed in the second half matched a season high for Dallas."}
{"game_id": "0021700224", "chunk_id": "0021700224_009", "order": 9, "role": "body", "text": "Harrison Barnes led the Mavericks with 18 points, but had just three after halftime as Dallas shot 31 percent in the second half in falling to an NBA-worst 2-14."}
{"game_id": "0021700224", "chunk_id": "0021700224_010", "order": 10, "role": "body", "text": "Dirk Nowitzki, the 39-year-old in his 20th season for Dallas, had 15 points while being joined in the starting lineup by another native of Wurzburg, Germany, in Maxi Kleber. The 25-year-old rookie went scoreless in his first start."}
{"game_id": "0021700224", "chunk_id": "0021700224_011", "order": 11, "role": "body", "text": "The Timberwolves got back in the game in the third quarter with a 27-6 run capped by a four-point play from Butler for a 70-63 lead after he was fouled on a 3-pointer by Wesley Matthews."}
{"game_id": "0021700224", "chunk_id": "0021700224_012", "order": 12, "role": "body", "text": "\"I need to look at the film and see what happened in the third,\" Dallas coach Rick Carlisle said. \"We just can't allow that to happen. I know we are stronger than that.\""}
{"game_id": "0021700224", "chunk_id": "0021700224_013", "order": 13, "role": "body", "text": "A 23-2 run in the fourth quarter put the game out of reach as Karl Anthony-Towns and Taj Gibson had matching double-doubles -- 15 points and 11 rebounds for Towns, 10 points and 11 rebounds for Gibson. Jeff Teague, the other starter, had 15 points and 10 assists."}
{"game_id": "0021700224", "chunk_id": "0021700224_014", "order": 14, "role": "body", "text": "The Mavericks held the Timberwolves to 32 percent shooting while taking a 55-43 halftime lead. But Minnesota made 11 of its first 13 shots in the second half and shot 63 percent after halftime."}
{"game_id": "0021700224", "chunk_id": "0021700224_016", "order": 16, "role": "body", "text": "Timberwolves: On the same night that Wiggins (22) became the eighth-youngest NBA player to reach 5,000 career points Wednesday against San Antonio, Jamal Crawford (37) became the fourth-oldest player to appear in a game for Minnesota. ... Crawford was the sixth double-figure scorer against the Mavericks with 12. ... The Wolves have shot more free throws than the opponent in all 15 games. They were 20 of 23 to 15 of 17 for Dallas."}
{"game_id": "0021700224", "chunk_id": "0021700224_017", "order": 17, "role": "body", "text": "Mavericks: Signed guard/forward Antonius Cleveland to a two-way contract. Cleveland played for Golden State's G League team, averaging 14.2 points. He made his NBA debut in the final seconds of the third quarter, preventing Wiggins from getting the final shot. ... The Mavericks waived G Gian Clavell. ... G Devin Harris returned after missing two games with bruised ribs. ... Nowitzki passed Hakeem Olajuwon for eighth on the career field goals list when he hit No. 10,750 in the first half."}
{"game_id": "0021700224", "chunk_id": "0021700224_019", "order": 19, "role": "body", "text": "Thibodeau's version of his halftime message started with one word: \"Try.\" But he did elaborate. \"The biggest adjustment wasn't schematic. It was bringing the right intensity to the game. We got energy into our defense, which led to energy into our offense.\""}
{"game_id": "0021700224", "chunk_id": "0021700224_021", "order": 21, "role": "body", "text": "Wiggins was coming off a poor shooting night against the Spurs and was 2 of 8 before halftime against the Mavericks. But the fourth-year guard made 5 of 7 in the second half, scoring 13 of his points. He was 2 of 3 from 3-point range."}
{"game_id": "0021700224", "chunk_id": "0021700224_023", "order": 23, "role": "body", "text": "Rookie Dennis Smith Jr. and Matthews had eight points apiece while making just six of 23 from the field (26 percent). They combined for just two points after halftime on 1-of-10 shooting with four assists and three turnovers. The 19-year-old Smith had a solid first half but opened the second half with a couple of ill-advised drives when the Timberwolves were on their run to take the lead."}
{"game_id": "0021700224", "chunk_id": "0021700224_025", "order": 25, "role": "body", "text": "Timberwolves: Home against Detroit on Sunday looking for their first win over the Pistons since Feb. 8, 2015, a span of five games."}
{"game_id": "0021700224", "chunk_id": "0021700224_026", "order": 26, "role": "body", "text": "Mavericks: Home against Milwaukee on Saturday to wrap up their fifth back-to-back in first 17 games. Dallas doesn't have another one until Dec. 22-23."}
{"game_id": "0021700224", "chunk_id": "0021700224_028", "order": 28, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
