{"game_id": "0021300233", "chunk_id": "0021300233_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. -- Josh Smith drove to the basket -- and the Los Angeles Lakers finally defended it.\nSmith was called for an offensive foul with 2.7 seconds left and Detroit down two, and the Lakers held on for a 106-102 victory over the Pistons on Friday night. Los Angeles trailed by 10 at the start of the fourth quarter but rallied past a Detroit team that dominated the paint for almost the entire game.\nThe Pistons needed one more layup, as it turned out, and Nick Young was there for Los Angeles to draw the charge on Smith."}
{"game_id": "0021300233", "chunk_id": "0021300233_002", "order": 2, "role": "closing", "text": "\"I told Nick after the game that I was about to be the first NBA coach to ever say that he had won a game with his defense,\" Lakers coach Mike D'Antoni said. \"We joke about it, but he's really worked hard on that part of his game since he came to camp, and it shows. He watches tape and he's doing what he can to get better.\"\nWesley Johnson scored 27 points for the Lakers, and Jordan Farmar led the fourth-quarter comeback. The Pistons outscored the Lakers 76-28 in the paint, but Los Angeles went 14-of-31 from 3-point range, with Johnson and Shawne Williams connecting six times each from beyond the arc.\nDetroit did not make a field goal from outside the paint until about midway through the third quarter.\n\"Obviously, at some point we've got to make shots,\" Pistons coach Maurice Cheeks said. \"The way they played, they have four or five shooters around, and they made shots. They live on the outside; we live on the inside. At some point, we will make those shots.\"\nDown 99-91, the Lakers went on a 12-0 run to take the lead late in the fourth. Farmar scored five straight points, and Williams tied it from beyond the arc.\nFarmer's shot from just inside the 3-point line on the right wing gave the Lakers a 101-99 lead, and Young extended the lead to four with a drive to the basket.\nLos Angeles was ahead 104-101 when Detroit's Brandon Jennings was fouled by Farmar while shooting a 3-pointer. But instead of tying the game, he made only one free throw with 16.7 seconds left.\n\"I kind of put that on myself, missing those two free throws down the stretch,\" Jennings said. \"That's something I live for. I'm a guy that's been known to knock them down. To see two of them rattle in and out, that hurts.\"\nFarmar missed two free throws for the Lakers, giving Detroit another chance. But the Pistons, who had scored so effortlessly for much of the night, couldn't tie it, losing to a Los Angeles team that is still without the injured Kobe Bryant and Steve Nash.\nRodney Stuckey's miss was knocked out of bounds by the Lakers with eight seconds left. Detroit was out of timeouts but got a free one when officials reviewed the play for a while at the monitor. The call stood, but Smith was called for an offensive foul when he ran over Young on a drive to the hoop.\n\"I saw him use the pump fake to get a step, so I knew he was coming to the basket,\" Young said. \"He's a big guy, but I just got set and waited for him. After I went down, I knew I was way outside the circle, but I was afraid they were going to call a block. When I saw the ref put his hand behind his head, that was just awesome.\"\nWilliams finished with 20 points. Farmar and Pau Gasol had 13 each.\nStuckey led the Pistons with 22 points, and Smith had eight points, 19 rebounds and eight assists. Detroit attempted 100 field goals, 20 more than the Lakers, and the Pistons had 22 offensive rebounds. Their 76 points in the paint set an NBA season high -- but only eight of them came in the fourth quarter.\nThe Pistons finished the game 1-for-7 from 3-point range.\nJennings hit a shot from near midcourt at the end of the half, but it didn't count because he had been called for traveling with 1.3 seconds left. The Lakers then pulled off an alley-oop to Johnson that put them ahead by a point at the half.\nJohnson scored 18 points in the first half. He didn't score in the fourth quarter, but without him, the Lakers might have been blown out.\nAfter two quarters, the Pistons had scored all 55 of their points in the paint or at the free throw line.\n\"I think we roped-a-doped them,\" D'Antoni said. \"They got tired from killing us inside all game. We didn't make any adjustments; our guys just stepped up.\"\nGame notes\nThere were 15 lead changes and 12 ties. ... Neither team shot well from the free throw line. The Lakers were 20-of-30, and the Pistons went 13-of-25. ... Philadelphia had 74 points in the paint against Washington on Nov. 1."}
