{"game_id": "0021400975", "chunk_id": "0021400975_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  The Trail Blazers didn't have to scramble to finish against the Detroit Pistons, and that was a good thing with a looming five-game road trip."}
{"game_id": "0021400975", "chunk_id": "0021400975_002", "order": 2, "role": "body", "text": "Damian Lillard had 28 points, including five 3-pointers, and Portland built a big lead in the first half and cruised to a 118-99 victory over Detroit on Friday night, handing the Pistons their ninth straight loss."}
{"game_id": "0021400975", "chunk_id": "0021400975_003", "order": 3, "role": "body", "text": "LaMarcus Aldridge added 22 points for the Blazers, who have won two of three since losing starter Wesley Matthews to a ruptured Achilles tendon. Portland led by as many as 23 points and sat its starters with four minutes left in the game."}
{"game_id": "0021400975", "chunk_id": "0021400975_004", "order": 4, "role": "body", "text": "\"It was good to have one of those games,\" Portland coach Terry Stotts said. \"To have everybody play under 30 minutes, you need one of those every once in a while.\""}
{"game_id": "0021400975", "chunk_id": "0021400975_005", "order": 5, "role": "body", "text": "Andre Drummond, who ranks second in the league in rebounds, had 16 points and 17 boards for the Pistons, who clinched the team's seventh straight losing season. Greg Monroe added 19 points in Detroit's fifth straight loss on the road."}
{"game_id": "0021400975", "chunk_id": "0021400975_006", "order": 6, "role": "body", "text": "\"They were just making shots, they were just doing what they're doing,\" Monroe said. \"They didn't do anything out of the ordinary, they just moved the ball well and made their shots.\""}
{"game_id": "0021400975", "chunk_id": "0021400975_007", "order": 7, "role": "body", "text": "The game got chippy in the end, with Portland's Joel Freeland and Detroit's Shawne Williams exchanging words and butting heads with a little more than a minute left. Both players were ejected."}
{"game_id": "0021400975", "chunk_id": "0021400975_008", "order": 8, "role": "body", "text": "Portland sits atop the Northwest Division and is a game up on Houston for third in the Western Conference standings. The Blazers were coming off a 105-100 victory at home over the Rockets, which clinched the head-to-head tiebreaker."}
{"game_id": "0021400975", "chunk_id": "0021400975_009", "order": 9, "role": "body", "text": "The Pistons were coming off a competitive 105-98 loss to Golden State on Wednesday."}
{"game_id": "0021400975", "chunk_id": "0021400975_010", "order": 10, "role": "body", "text": "Paced by Lillard's 13 points and four assists, Portland took a 35-24 lead into the second quarter. Robin Lopez had a short jumper before a layup and a free throw to extend the lead to 54-38."}
{"game_id": "0021400975", "chunk_id": "0021400975_011", "order": 11, "role": "body", "text": "Portland led 64-46 at the half, with Lillard, Aldridge and Arron Afflalo all in double figures. Aldridge, who leads the Blazers with 23.3 points and 10.6 rebounds per game, rested the entire fourth quarter."}
{"game_id": "0021400975", "chunk_id": "0021400975_012", "order": 12, "role": "body", "text": "Lillard finished with nine assists."}
{"game_id": "0021400975", "chunk_id": "0021400975_013", "order": 13, "role": "body", "text": "\"I think our team as a whole just played well offensively, the way we moved the ball, the way we executed,\" Lillard said. \"A lot of the shots that I got were good looks. It helps when you're executing and moving the ball the way we did.\""}
{"game_id": "0021400975", "chunk_id": "0021400975_014", "order": 14, "role": "body", "text": "Still adjusting to the loss of Matthews for the remainder of the season, the Blazers were also without reserve guard Alonzo Gee, out because of oral surgery."}
{"game_id": "0021400975", "chunk_id": "0021400975_015", "order": 15, "role": "body", "text": "The Blazers have won five straight overall against Detroit and seven straight at the Moda Center."}
{"game_id": "0021400975", "chunk_id": "0021400975_016", "order": 16, "role": "body", "text": "Still, Pistons coach Stan Van Gundy said he saw positives."}
{"game_id": "0021400975", "chunk_id": "0021400975_017", "order": 17, "role": "body", "text": "\"I thought we made offensive improvement tonight against a good defensive team,\" Van Gundy said. \"I thought our pace and ball movement were better. There was offensive improvement but we couldn't find a way to stop them at all.\""}
{"game_id": "0021400975", "chunk_id": "0021400975_020", "order": 20, "role": "body", "text": "Pistons: The NBA earlier in the day announced it had taken away two rebounds from Drummond's total from the game against Golden State, giving him 25 instead of 27 -- which would have been a career high. The league reviews each game."}
{"game_id": "0021400975", "chunk_id": "0021400975_021", "order": 21, "role": "body", "text": "Trail Blazers: Afflalo, acquired with Gee in a trade at the deadline with Denver, started for the third straight game in Matthews' place. ... The Blazers improved to 20-6 against the Eastern Conference. ... Meyers Leonard had a season-high 15 points."}
{"game_id": "0021400975", "chunk_id": "0021400975_023", "order": 23, "role": "body", "text": "Blazers guard Steve Blake played for 15 minutes and had 0s across his line on the stat sheet -- except for seven assists. \"I've never seen a line like that,\" Stotts said."}
{"game_id": "0021400975", "chunk_id": "0021400975_025", "order": 25, "role": "body", "text": "The skirmish late in the game between Freeland and Williams was precipitated by Williams' confrontation with Leonard under the basket. Freeland and Leonard are good pals."}
{"game_id": "0021400975", "chunk_id": "0021400975_026", "order": 26, "role": "body", "text": "The way fans saw it, Freeland was defending Leonard. While the head-butting was reviewed, the crowd at the Moda Center gave Freeland a wild ovation. Robin Lopez reached over to raise Freeland's hand like a prizefighter."}
{"game_id": "0021400975", "chunk_id": "0021400975_027", "order": 27, "role": "body", "text": "\"It's not the best thing in the world, coming in for two minutes and getting ejected,\" Freeland said. \"But it happened.\""}
{"game_id": "0021400975", "chunk_id": "0021400975_029", "order": 29, "role": "body", "text": "Pistons: At the Utah Jazz on Saturday."}
{"game_id": "0021400975", "chunk_id": "0021400975_030", "order": 30, "role": "closing", "text": "Trail Blazers: At the Toronto Raptors on Sunday."}
