{"game_id": "0021700983", "chunk_id": "0021700983_001", "order": 1, "role": "lead", "text": "DENVER --  Paul Millsap provided Denver with veteran plays to get the Nuggets a much-need win. Jamal Murray gave the Lakers fuel for a rematch in four days."}
{"game_id": "0021700983", "chunk_id": "0021700983_002", "order": 2, "role": "body", "text": "Millsap scored 21 points and hit a key 3-pointer in the final minutes, and the Nuggets beat Los Angeles 125-116 on Friday night."}
{"game_id": "0021700983", "chunk_id": "0021700983_003", "order": 3, "role": "body", "text": "Millsap missed 44 games with a left wrist injury before returning Feb. 27 against the Clippers. Friday was his sixth game back and his best performance, which included six rebounds and three blocked shots."}
{"game_id": "0021700983", "chunk_id": "0021700983_004", "order": 4, "role": "body", "text": "\"I'm starting to get my rhythm back a little bit,\" Millsap said. \"I knew it wasn't going to happen the first few games.\""}
{"game_id": "0021700983", "chunk_id": "0021700983_005", "order": 5, "role": "body", "text": "Millsap's night was overshadowed by Murray, who finished with 22 points and drew the ire of the Lakers for the second time this season. His verbal sparring in the final minute Friday came three months after he dribbled around Lonzo Ball in the waning seconds of a win in December."}
{"game_id": "0021700983", "chunk_id": "0021700983_006", "order": 6, "role": "body", "text": "Murray acknowledged after that game he might have taken things too far. Friday, his talking was a sore point with the Lakers."}
{"game_id": "0021700983", "chunk_id": "0021700983_007", "order": 7, "role": "body", "text": "\"I felt like for the second time that we played here, Murray was a little disrespectful at the end of the game,\" Lakers coach Luke Walton said. \"Some of the trash talking to our guys.\""}
{"game_id": "0021700983", "chunk_id": "0021700983_008", "order": 8, "role": "body", "text": "It adds drama for Tuesday's game in Los Angeles."}
{"game_id": "0021700983", "chunk_id": "0021700983_009", "order": 9, "role": "body", "text": "\"That's the type of player he is but we got another shot at them Tuesday, so I look forward to it,\" Lakers rookie Kyle Kuzma said."}
{"game_id": "0021700983", "chunk_id": "0021700983_010", "order": 10, "role": "body", "text": "Murray said he was just playing hard in a must-win game for Denver."}
{"game_id": "0021700983", "chunk_id": "0021700983_011", "order": 11, "role": "body", "text": "\"We can't afford to lose this game,\" Murray said. \"I went out there and played with the fire that everybody loves to watch me play with and I can't control what the other team's going to feel. I'm going to go out there and hoop.\""}
{"game_id": "0021700983", "chunk_id": "0021700983_012", "order": 12, "role": "body", "text": "Nikola Jokic also scored 21 to help the Nuggets end a three-game home losing streak and stay in the thick of the playoff race."}
{"game_id": "0021700983", "chunk_id": "0021700983_013", "order": 13, "role": "body", "text": "Brook Lopez led Los Angeles with 29 points. Kentavious Caldwell-Pope had 17 points and nine rebounds, and Ball had 15 points, eight rebounds and eight assists. The Lakers had their four-game road winning streak snapped."}
{"game_id": "0021700983", "chunk_id": "0021700983_014", "order": 14, "role": "body", "text": "\"Our guys fought and gave ourselves a chance,\" Walton said. \"But if you give 30 points away from turnovers on the road against a playoff-caliber team, that's going to be a tough one to win.\""}
{"game_id": "0021700983", "chunk_id": "0021700983_015", "order": 15, "role": "body", "text": "The Lakers trailed by 13 in the first half but took the lead at the end of the third quarter with a 12-2 run. It set up a fourth quarter that had seven lead changes."}
{"game_id": "0021700983", "chunk_id": "0021700983_016", "order": 16, "role": "body", "text": "Millsap's three-point play with 4:24 left made it 112-110 and was the last time the lead changed hands. Murray's two free throws stretched it to six and after the Lakers got within two, Millsap drained a 3-pointer with 1:43 left and blocked Ball's layup with 34 seconds remaining to seal it."}
{"game_id": "0021700983", "chunk_id": "0021700983_017", "order": 17, "role": "body", "text": "Things got chippy at the end when Caldwell-Pope delivered a hard foul to Murray along the sideline after Millsap's block. Murray hit both free throws and two more to end the game."}
{"game_id": "0021700983", "chunk_id": "0021700983_018", "order": 18, "role": "body", "text": "\"They're losing, fourth quarter, it's a tight game,\" Murray said. \"It was a foul. Ref didn't call nothing so let's play on.\""}
{"game_id": "0021700983", "chunk_id": "0021700983_020", "order": 20, "role": "body", "text": "Lakers: The Lakers signed F Derrick Williams to a 10-day contract on Friday. ... G Brandon Ingram missed his fourth straight game with a left groin strain. Coach Luke Walton said Ingram is feeling better but did not say when the guard would return."}
{"game_id": "0021700983", "chunk_id": "0021700983_021", "order": 21, "role": "body", "text": "Nuggets: F Wilson Chandler was inactive with a hip injury. \"The hip has been giving him a lot of trouble,\" coach Michael Malone said. ... Devin Harris' 12 points were his most with Denver since being acquired from Dallas on Feb. 10. ... Colorado Gov. John Hickenlooper was in attendance."}
{"game_id": "0021700983", "chunk_id": "0021700983_023", "order": 23, "role": "body", "text": "Millsap was signed in the offseason to provide veteran leadership for Denver's young players, but he is comfortable letting Jokic being the catalyst for the team. He told Jokic before Wednesday's loss to Cleveland not to worry about deferring to him."}
{"game_id": "0021700983", "chunk_id": "0021700983_024", "order": 24, "role": "body", "text": "\"He told me, `Just be you, don't worry about how I'm going to fit with you guys,\" Jokic said. \"That says a lot about that guy. He doesn't want any attention, he just wants to fit in with the team and he knows we're going to find him.\""}
{"game_id": "0021700983", "chunk_id": "0021700983_026", "order": 26, "role": "body", "text": "Lakers: Host Cleveland on Sunday night."}
{"game_id": "0021700983", "chunk_id": "0021700983_027", "order": 27, "role": "closing", "text": "Nuggets: Host Sacramento on Sunday afternoon."}
