{"game_id": "0021700606", "chunk_id": "0021700606_001", "order": 1, "role": "lead", "text": "NEW YORK --  Andre Drummond and Tobias Harris carried Detroit to an easy road win in Brooklyn."}
{"game_id": "0021700606", "chunk_id": "0021700606_002", "order": 2, "role": "body", "text": "Drummond scored 22 points and grabbed 20 rebounds, Harris had 22 points, and the Pistons beat the Nets 114-80 on Wednesday night."}
{"game_id": "0021700606", "chunk_id": "0021700606_003", "order": 3, "role": "body", "text": "\"I'm not a real creative offensive guy, as you guys all know,\" Pistons coach Stan Van Gundy joked after the game. \"If we find something that's working, I tend to just keep going to it. Tobias got off to a great start. I thought Andre Drummond was outstanding all night.\""}
{"game_id": "0021700606", "chunk_id": "0021700606_004", "order": 4, "role": "body", "text": "Dwight Buycks added 17 points for the Pistons."}
{"game_id": "0021700606", "chunk_id": "0021700606_005", "order": 5, "role": "body", "text": "\"I thought from the jump we got good defensive stops,\" Harris said. \"We were able to get out in transition. Andre was a big focus, especially for them, so we were able to get some open looks and just capitalize off that.\""}
{"game_id": "0021700606", "chunk_id": "0021700606_006", "order": 6, "role": "body", "text": "Allen Crabbe scored 20 points and Rondae Hollis-Jefferson had 15 points for the Nets, who have lost three in a row."}
{"game_id": "0021700606", "chunk_id": "0021700606_007", "order": 7, "role": "body", "text": "\"They were just the aggressor, more physical,\" Crabbe said. \"They made us turn the ball over. They basically had control of the game for the majority of the game. Trying to play catch up in this league is not easy. They kept their foot on the gas and we just couldn't win through the storm.\""}
{"game_id": "0021700606", "chunk_id": "0021700606_008", "order": 8, "role": "body", "text": "Detroit took a 90-61 lead heading into the fourth quarter and led by as many as 40 points, 104-64, with 8:20 remaining."}
{"game_id": "0021700606", "chunk_id": "0021700606_009", "order": 9, "role": "body", "text": "Drummond led Detroit with 18 points and 13 rebounds at the half as the Pistons took a 63-41 lead into the locker room. Crabbe paced Brooklyn with 14 points at the half."}
{"game_id": "0021700606", "chunk_id": "0021700606_010", "order": 10, "role": "body", "text": "Harris led Detroit with 14 points in the first quarter as the Pistons took a 34-26 lead."}
{"game_id": "0021700606", "chunk_id": "0021700606_012", "order": 12, "role": "body", "text": "Pistons: Van Gundy praised Buycks' recent play in the past five games after being inactive for the first 32 games of the season. \"I think he's played well,\" Van Gundy said. \"He's attacked, he's played aggressively and he can score the ball.\" ... Jon Leuer (sprained left ankle) and Reggie Jackson (sprained right ankle) were out."}
{"game_id": "0021700606", "chunk_id": "0021700606_013", "order": 13, "role": "body", "text": "Nets: Coach Kenny Atkinson was asked about Brooklyn earning the respect from officials after several controversial calls recently. \"I think you earn respect with your play,\" he said. \"It's like when you were a seventh grader and you go to the playground, and the big kids are pushing you around or maybe making all the calls. As you get better, as you improve your game somehow that turns the other way. We've got to earn our respect through our play. That's the way we feel.\" . DeMarre Carroll (right knee sprain), D'Angelo Russell (left knee surgery), Isaiah Whitehead (G-League assignment) and Jeremy Lin (ruptured patella tendon, right knee) were out."}
{"game_id": "0021700606", "chunk_id": "0021700606_015", "order": 15, "role": "body", "text": "Pistons: Visit Chicago on Saturday. It's the final game of a three-game road trip for Detroit."}
{"game_id": "0021700606", "chunk_id": "0021700606_016", "order": 16, "role": "closing", "text": "Nets: Visit Atlanta on Friday. It's the start of a two-game road trip for Brooklyn."}
