{"game_id": "0021700708", "chunk_id": "0021700708_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Damian Lillard figured Portland's 43-point third quarter against Minnesota might be the best span for the Blazers in recent memory."}
{"game_id": "0021700708", "chunk_id": "0021700708_002", "order": 2, "role": "body", "text": "Lillard had 31 points a day after getting his third All-Star nod and the Trail Blazers beat the Timberwolves 123-114 on Wednesday night."}
{"game_id": "0021700708", "chunk_id": "0021700708_003", "order": 3, "role": "body", "text": "He called that third quarter a \"showcase.\" It was the most points Portland has had in a single quarter all season."}
{"game_id": "0021700708", "chunk_id": "0021700708_004", "order": 4, "role": "body", "text": "\"When we watch film and when we're in training camp and stuff like that, if we could just watch that whole quarter, they'd say, `This is how we want to play, this is how the ball needs to move, this is how we need to screen, this is the pace we need to have. And what's going to allow us to do that is defending the way we did,\" said Lillard, who had 13 of his points during the period."}
{"game_id": "0021700708", "chunk_id": "0021700708_005", "order": 5, "role": "body", "text": "CJ McCollum added 28 points in Portland's seventh straight win at home, longest streak of the season. Lillard made six 3-pointers and the Blazers had 17 3s in the game, one shy of their season high."}
{"game_id": "0021700708", "chunk_id": "0021700708_006", "order": 6, "role": "body", "text": "Andrew Wiggins had 24 points for the Timberwolves, who had won seven of their last nine games but trailed by 19 points early in the fourth quarter."}
{"game_id": "0021700708", "chunk_id": "0021700708_007", "order": 7, "role": "body", "text": "Lillard was named as an All-Star reserve Tuesday. He also spoke to reporters before the game about making the team after being snubbed in past years."}
{"game_id": "0021700708", "chunk_id": "0021700708_008", "order": 8, "role": "body", "text": "\"It's not my first All-Star game. But I did have to make this one happen. Everybody knows that the last two years I felt like I should have made it and I didn't. But I just had to keep on playing, stay with it and stay positive,\" he said."}
{"game_id": "0021700708", "chunk_id": "0021700708_009", "order": 9, "role": "body", "text": "Minnesota didn't have Jimmy Butler, who missed a third straight game with a sore right knee. Jamal Crawford returned after missing two games with a strained big toe on his left foot."}
{"game_id": "0021700708", "chunk_id": "0021700708_010", "order": 10, "role": "body", "text": "\"We've got to be able to play through any situation,\" Karl-Anthony Towns said. \"Jimmy's an amazing player, one of the best in the league so when you lose him it puts a huge task at hand for us bit we've got to be able to go out there next man up and get the job done.\""}
{"game_id": "0021700708", "chunk_id": "0021700708_011", "order": 11, "role": "body", "text": "The Timberwolves were coming off a 126-118 victory over the Clippers in Los Angeles on Monday night. Wiggins scored a season-high 40 points in the win that snapped a four-game road skid."}
{"game_id": "0021700708", "chunk_id": "0021700708_012", "order": 12, "role": "body", "text": "The Trail Blazers lost 104-101 in Denver on Tuesday, snapping a three-game winning streak."}
{"game_id": "0021700708", "chunk_id": "0021700708_013", "order": 13, "role": "body", "text": "Minnesota led by eight points early, but Lillard's 3-pointer got the Blazers within 27-25 late in the opening quarter. Portland finally caught up with the Timberwolves at the end of the half, pulling into a 54-all tie after Al-Farouq Aminu's 3-pointer and a pair of free throws from Lillard."}
{"game_id": "0021700708", "chunk_id": "0021700708_014", "order": 14, "role": "body", "text": "Lillard and Aminu each hit 3-pointers to push Portland's lead to 63-60. Aminu's dunk extended it to 76-68 midway through the third quarter. Lillard's two 3s put the Blazers up 88-74."}
{"game_id": "0021700708", "chunk_id": "0021700708_015", "order": 15, "role": "body", "text": "\"We played the kind of game we wanted to play, from the effort standpoint and focus,\" Lillard said."}
{"game_id": "0021700708", "chunk_id": "0021700708_016", "order": 16, "role": "body", "text": "The Timberwolves won the first two meetings of this season's series, both at home."}
{"game_id": "0021700708", "chunk_id": "0021700708_017", "order": 17, "role": "body", "text": "\"When you're on the road and you're short-handed you've got to play with great intensity the whole time,\" Minnesota coach Tom Thibodeau said. \"If you let up at all you're going to be in trouble."}
{"game_id": "0021700708", "chunk_id": "0021700708_019", "order": 19, "role": "body", "text": "Timberwolves: With a 3-pointer and free throw in the second quarter, Crawford added to his career four-point play total with 52, an ongoing NBA record. ... Minnesota's Butler and Towns were also named reserves."}
{"game_id": "0021700708", "chunk_id": "0021700708_020", "order": 20, "role": "body", "text": "Trail Blazers: Portland has won 11 of its last 12 games against the Timberwolves at the Moda Center. ... Jusuf Nurkic sustained a left elbow contusion but returned. ... Lillard was also the Western Conference player of the week."}
{"game_id": "0021700708", "chunk_id": "0021700708_021", "order": 21, "role": "body", "text": "WHAT RUSS SAID: Lillard also addressed Russell Westbrook's comment Tuesday night that players are \"Talking about getting snubbed until they get in.\" Some thought the comments were directed at Lillard."}
{"game_id": "0021700708", "chunk_id": "0021700708_022", "order": 22, "role": "body", "text": "\"Because he's played against me, he's played against our team, he knows what I've accomplished,\" Lillard said. \"Not just this year, but over my career. So it was a little bit disappointing, but I know that I earned my spot this year.\""}
{"game_id": "0021700708", "chunk_id": "0021700708_023", "order": 23, "role": "body", "text": "CONNAUGHTON'S NIGHT: Portland's Pat Connaughton came off the bench with 12 points, including three dunks and two 3-pointers. \"That's a nice combination,\" Terry Stotts said."}
{"game_id": "0021700708", "chunk_id": "0021700708_025", "order": 25, "role": "body", "text": "The Timberwolves were playing the first of a back-to-back, they head south to play the Golden State Warriors on Thursday."}
{"game_id": "0021700708", "chunk_id": "0021700708_026", "order": 26, "role": "body", "text": "The Trail Blazers visit the Mavericks on Friday night."}
{"game_id": "0021700708", "chunk_id": "0021700708_028", "order": 28, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
