{"game_id": "0021701104", "chunk_id": "0021701104_001", "order": 1, "role": "lead", "text": "DETROIT --  Reggie Jackson is rounding into form for the Detroit Pistons."}
{"game_id": "0021701104", "chunk_id": "0021701104_002", "order": 2, "role": "body", "text": "Monday night was a positive sign."}
{"game_id": "0021701104", "chunk_id": "0021701104_003", "order": 3, "role": "body", "text": "Jackson had 20 points in his fourth game back from an ankle sprain, helping the Pistons to a 112-106 victory over Julius Randle and the Los Angeles Lakers."}
{"game_id": "0021701104", "chunk_id": "0021701104_004", "order": 4, "role": "body", "text": "Detroit (34-40) won for the fourth time in five games, but trails idle Miami by five games for the final Eastern Conference playoff spot."}
{"game_id": "0021701104", "chunk_id": "0021701104_005", "order": 5, "role": "body", "text": "With Blake Griffin reduced to 24 minutes due to foul trouble, reserve Anthony Tolliver added 15 points as the Pistons put six players in double figures. Andre Drummond had 15 points and 18 rebounds and Griffin finished with 15 points."}
{"game_id": "0021701104", "chunk_id": "0021701104_006", "order": 6, "role": "body", "text": "\"I don't know if we're going to see all of it in these last two weeks, but I know that with Reggie, Blake and Andre, we have the pieces to be really good,\" coach Stan Van Gundy said."}
{"game_id": "0021701104", "chunk_id": "0021701104_007", "order": 7, "role": "body", "text": "Jackson played 28 minutes -- the most action he has seen since his return."}
{"game_id": "0021701104", "chunk_id": "0021701104_008", "order": 8, "role": "body", "text": "\"I could barely breathe in the second half, but that's all right -- my legs are getting better every game,\" he said. \"Once I get my legs back under me, I'll be able to play the way I'm used to playing, but tonight was enough to help us get a win.\""}
{"game_id": "0021701104", "chunk_id": "0021701104_009", "order": 9, "role": "body", "text": "Randle had 22 points and 11 rebounds for Los Angeles, and Lonzo Ball finished with 15 points, 11 assists and eight rebounds. Kyle Kuzma had 20 points and 11 boards."}
{"game_id": "0021701104", "chunk_id": "0021701104_010", "order": 10, "role": "body", "text": "\"We were competitive again, and we gave ourselves another chance to win,\" Lakers coach Luke Walton said. \"That's what we ask from these guys. We just came up a little short.\""}
{"game_id": "0021701104", "chunk_id": "0021701104_011", "order": 11, "role": "body", "text": "The Pistons led early, but the Lakers rallied behind Kuzma, a Flint native who was supported by a large contingent from his hometown about an hour north of Detroit."}
{"game_id": "0021701104", "chunk_id": "0021701104_012", "order": 12, "role": "body", "text": "\"That was fun,\" he said. \"It was great to see my family and friends. It was tough to lose, but that was a plus.\""}
{"game_id": "0021701104", "chunk_id": "0021701104_013", "order": 13, "role": "body", "text": "Randle and Griffin each picked up three first-half fouls, so they were on the bench when Ish Smith hit a buzzer-beating 3-pointer to pull the Pistons to 55-53 at the break."}
{"game_id": "0021701104", "chunk_id": "0021701104_014", "order": 14, "role": "body", "text": "Griffin picked up his fourth foul early in the third quarter and headed back to the sideline. But the Lakers weren't able to take advantage of his absence."}
{"game_id": "0021701104", "chunk_id": "0021701104_015", "order": 15, "role": "body", "text": "Tolliver replaced Griffin and scored eight points in the period as Detroit built an 81-76 lead."}
{"game_id": "0021701104", "chunk_id": "0021701104_016", "order": 16, "role": "body", "text": "Tolliver started the fourth with a 3-pointer to put the Pistons up by eight. Griffin was whistled for a fifth foul, but he returned to hit a 3-pointer that made it 102-93 with 3:32 left."}
{"game_id": "0021701104", "chunk_id": "0021701104_018", "order": 18, "role": "body", "text": "Lakers: Isaiah Thomas (hip) and Brandon Ingram (groin) were sidelined by injuries. The Lakers had G-Leaguers Thomas Bryant and Gary Payton II active for the game."}
{"game_id": "0021701104", "chunk_id": "0021701104_019", "order": 19, "role": "body", "text": "Pistons: The Pistons held a moment of silence before the game for Grand Rapids Drive guard Zeke Upshaw, who died earlier Monday after collapsing late in a game on Saturday. Grand Rapids is Detroit's G-League affiliate."}
{"game_id": "0021701104", "chunk_id": "0021701104_021", "order": 21, "role": "body", "text": "Van Gundy wasn't happy with Drummond's first-half defense, but acknowledged he picked it up in the second half, including a spectacular play where he stole the ball from Randle on a lob."}
{"game_id": "0021701104", "chunk_id": "0021701104_022", "order": 22, "role": "body", "text": "\"In the first half, he made Ivica Zubac look like Usain Bolt, but he picked it up down the stretch,\" Van Gundy said. \"There aren't too many players in this league who can make the play he made against Randle.\""}
{"game_id": "0021701104", "chunk_id": "0021701104_024", "order": 24, "role": "body", "text": "Lakers: Return home to play the Dallas Mavericks on Wednesday."}
{"game_id": "0021701104", "chunk_id": "0021701104_025", "order": 25, "role": "closing", "text": "Pistons: Host the Washington Wizards on Thursday."}
