{"game_id": "0021200748", "chunk_id": "0021200748_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  The 76ers' arena has breezed through four names in its history. Jeremy Pargo gave it an unofficial fifth."}
{"game_id": "0021200748", "chunk_id": "0021200748_002", "order": 2, "role": "body", "text": "After Pargo's debut, fans posted on Twitter that the Wells Fargo Center should be renamed the Wells Pargo Center."}
{"game_id": "0021200748", "chunk_id": "0021200748_003", "order": 3, "role": "body", "text": "\"I'd love for that to be the real name,\" a smiling Pargo said. \"That means I'd be doing well.\""}
{"game_id": "0021200748", "chunk_id": "0021200748_005", "order": 5, "role": "body", "text": "Lavoy Allen had 14 points and a career-high 22 rebounds, Jrue Holiday scored 20 points and Pargo had 12 to lead the Philadelphia 76ers to an 87-76 win over the Charlotte Bobcats on Saturday night."}
{"game_id": "0021200748", "chunk_id": "0021200748_006", "order": 6, "role": "body", "text": "The Sixers improved to 5-2 on their eight-game homestand that ends Monday against the Los Angeles Clippers. The solid showing at home has helped the Sixers inch closer to the eighth seed in the Eastern Conference."}
{"game_id": "0021200748", "chunk_id": "0021200748_007", "order": 7, "role": "body", "text": "No one could have guessed at the start they'd have Pargo to thank. Pargo signed a 10-day contract this week after he was waived by Cleveland."}
{"game_id": "0021200748", "chunk_id": "0021200748_008", "order": 8, "role": "body", "text": "Wearing No. 0, Pargo was a pleasant surprise, playing 29 minutes and injecting a needed dose of fun and energy off the bench."}
{"game_id": "0021200748", "chunk_id": "0021200748_010", "order": 10, "role": "body", "text": "Pargo had started 11 of his 25 games played with the Cavaliers and averaged 7.8 points. He even scored a career-high 28 against the Sixers in November."}
{"game_id": "0021200748", "chunk_id": "0021200748_011", "order": 11, "role": "body", "text": "\"I forgive him after tonight,\" Allen said. \"I was a little mad at the time.\""}
{"game_id": "0021200748", "chunk_id": "0021200748_012", "order": 12, "role": "body", "text": "With only a 10-day contract to prove his worth, Pargo hit a string of big baskets over the third and fourth, shooting 4-of-9 overall and adding six assists."}
{"game_id": "0021200748", "chunk_id": "0021200748_013", "order": 13, "role": "body", "text": "He had the play of the game when he drove the length of the court for a right-handed layup and a foul. He gave a playful smile and a wink to fans on the baseline, then sank the free throw for a 16-point lead."}
{"game_id": "0021200748", "chunk_id": "0021200748_014", "order": 14, "role": "body", "text": "\"Y'all caught that? It was just in the moment,\" a laughing Pargo said."}
{"game_id": "0021200748", "chunk_id": "0021200748_015", "order": 15, "role": "body", "text": "Pargo wowed the crowd again in the fourth with a one-handed reverse that kept the lead at double-digits. The 6-foot-2 guard out of Gonzaga was cheered late each time he touched the ball."}
{"game_id": "0021200748", "chunk_id": "0021200748_016", "order": 16, "role": "body", "text": "He did get whistled for a technical foul in the fourth, which comes with a fine -- a hit to the wallet a player on a 10-day deal might not want."}
{"game_id": "0021200748", "chunk_id": "0021200748_017", "order": 17, "role": "body", "text": "\"I told the ref, 'He's throwing the ball,' \" he said. \"That was completely it. I don't know if he got mad at me from something earlier.\""}
{"game_id": "0021200748", "chunk_id": "0021200748_018", "order": 18, "role": "body", "text": "Before the game, Allen noted he's had three teammates this season in the locker next to him. Maalik Wayns and Shelvin Mack couldn't stick. More games such as this and Pargo just might find a home in Philadelphia for the rest of the season."}
{"game_id": "0021200748", "chunk_id": "0021200748_019", "order": 19, "role": "body", "text": "Evan Turner had 16 points and 10 rebounds, and Spencer Hawes added 17 points and nine rebounds to help the Sixers crush the Bobcats 60-40 on the boards. Allen split his rebound total."}
{"game_id": "0021200748", "chunk_id": "0021200748_020", "order": 20, "role": "body", "text": "\"I was a monster on the boards at Temple,\" Allen deadpanned. \"It really was my game. All-time leading rebounder at Temple, by the way. Just want to throw that out there.\""}
{"game_id": "0021200748", "chunk_id": "0021200748_021", "order": 21, "role": "body", "text": "Even with Allen attacking the glass, the Sixers needed Pargo driving the lane for buckets. They missed 14-of-16 3-point attempts and hit almost nothing from any spot outside the paint."}
{"game_id": "0021200748", "chunk_id": "0021200748_022", "order": 22, "role": "body", "text": "That helped keep the game close for the Bobcats, playing a night after they blew a 20-point lead in a loss to the Los Angeles Lakers."}
{"game_id": "0021200748", "chunk_id": "0021200748_023", "order": 23, "role": "body", "text": "Ramon Sessions scored 20 points, Byron Mullens had 16 and Gerald Henderson 13 as the NBA-worst Bobcats lost their seventh straight. The Bobcats shot 31 percent from the floor. They also missed 14 of 16 3s."}
{"game_id": "0021200748", "chunk_id": "0021200748_024", "order": 24, "role": "body", "text": "\"One of the things our young guys have to learn is, front up off a glamour game like the Lakers,\" coach Mike Dunlap said. \"They just get can't excited for one game and not the other. What we're trying to teach them is how to be a pro.\""}
{"game_id": "0021200748", "chunk_id": "0021200748_025", "order": 25, "role": "body", "text": "The Sixers opened the third on a 12-2 run to break open a one-point game at the break. The Bobcats closed within seven late in the fourth until Holiday pushed them back with a 16-footer. He had a driving layup late to make it an 11-point game and send the Bobcats to their latest defeat."}
{"game_id": "0021200748", "chunk_id": "0021200748_026", "order": 26, "role": "body", "text": "\"We always find ways to be in games and fight our way back,\" Henderson said. \"At this point, we just need to find ways to win.\""}
{"game_id": "0021200748", "chunk_id": "0021200748_027", "order": 27, "role": "closing", "text": "Game notes Two Charlotte assistants have Temple connections. Rick Brunson starred for the Owls in the 1990s and Dan Leibovitz was an assistant under John Chaney. ... 76ers coach Doug Collins said he had a hard time figuring out his inconsistent team. \"Any little change affects this team. It knocks us out of sync,\" he said. Why? \"I don't know. It's just their personality.\""}
