{"game_id": "0021201190", "chunk_id": "0021201190_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- While the Milwaukee Bucks are in the playoffs for the first time in three seasons, getting out of the first round will be a huge challenge given their recent poor play and a difficult opponent."}
{"game_id": "0021201190", "chunk_id": "0021201190_002", "order": 2, "role": "body", "text": "By virtue of Saturday night's 95-85 loss to the NBA-worst Charlotte Bobcats -- their ninth straight defeat on the road and their 11th in the last 14 games overall -- the Bucks will face the defending champion Miami Heat in the first round of the Eastern Conference playoffs."}
{"game_id": "0021201190", "chunk_id": "0021201190_003", "order": 3, "role": "body", "text": "Few will give the Bucks a chance to win even a game in the best-of-seven series. Heck, even Bucks swingman Mike Dunleavy called it a \"monumental task.\""}
{"game_id": "0021201190", "chunk_id": "0021201190_004", "order": 4, "role": "body", "text": "If there's any bit of good news for the Bucks it's that they hope to get Larry Sanders and Brandon Jennings back for the postseason. Both sat out again against the Bobcats."}
{"game_id": "0021201190", "chunk_id": "0021201190_005", "order": 5, "role": "body", "text": "\"We'll try to keep our guys fresh and keep them playing enough that they're feeling in a rhythm and ready to compete,\" Bucks coach Jim Boylan said. \"I don't want to sit them out completely, but at the same time we want to be cautious.\""}
{"game_id": "0021201190", "chunk_id": "0021201190_006", "order": 6, "role": "body", "text": "Their absence was felt Saturday night."}
{"game_id": "0021201190", "chunk_id": "0021201190_007", "order": 7, "role": "body", "text": "Kemba Walker had 21 points, Josh McRoberts nearly had a triple-double and the Bobcats won for only the third time in their last 12 games."}
{"game_id": "0021201190", "chunk_id": "0021201190_008", "order": 8, "role": "body", "text": "McRoberts had a season-high 18 points, nine rebounds and a career-high nine assists."}
{"game_id": "0021201190", "chunk_id": "0021201190_009", "order": 9, "role": "body", "text": "Bismack Biyombo, the team's improving second-year center, chipped in 13 points and tied a career-high with 17 rebounds as the NBA-worst Bobcats dominated the Bucks 52-36 on the boards."}
{"game_id": "0021201190", "chunk_id": "0021201190_010", "order": 10, "role": "body", "text": "As he left the court, Biyombo had a wide smile on his face, clearly soaking in a rare win for the Bobcats (19-61)."}
{"game_id": "0021201190", "chunk_id": "0021201190_011", "order": 11, "role": "body", "text": "\"It's been a tough season for all of us in this locker room,\" Biyombo said. \"We come in every day and we work hard. The season isn't going as expected, but over time things are getting better. It's a long way to go. But we're young and we have a bright future ahead of us here.\""}
{"game_id": "0021201190", "chunk_id": "0021201190_012", "order": 12, "role": "body", "text": "Dunleavy had 19 points and Monta Ellis added 16 to lead the Bucks."}
{"game_id": "0021201190", "chunk_id": "0021201190_013", "order": 13, "role": "body", "text": "Charlotte led by five at the break and pushed the lead to 17 entering the fourth quarter."}
{"game_id": "0021201190", "chunk_id": "0021201190_014", "order": 14, "role": "body", "text": "The Bucks got within six with 23 seconds left, but the lead was never really in danger. Gerald Henderson made a pair of free throws and Biyombo sealed the win with a rim-rattling dunk with 10 seconds left."}
{"game_id": "0021201190", "chunk_id": "0021201190_015", "order": 15, "role": "body", "text": "Charlotte entered the game with its own struggles, but led the entire first half as Walker scored 13 points on 5-of-9 shooting."}
{"game_id": "0021201190", "chunk_id": "0021201190_016", "order": 16, "role": "body", "text": "Charlotte dominated on the glass in the opening half, outrebounding the Bucks 27-15 before the break. Biyombo, who has stepped up his play in recent weeks, came up with eight early rebounds to set the tone for the Bobcats early on."}
{"game_id": "0021201190", "chunk_id": "0021201190_017", "order": 17, "role": "body", "text": "The Bobcats played through McRoberts on offense."}
{"game_id": "0021201190", "chunk_id": "0021201190_018", "order": 18, "role": "body", "text": "The big man, acquired in a trade from Orlando late in the season, routinely found teammates for open shots. He has been a workhorse for the Bobcats recently, averaging more than 39 minutes per game over the past eight games."}
{"game_id": "0021201190", "chunk_id": "0021201190_019", "order": 19, "role": "body", "text": "\"I'm just getting an opportunity to handle the ball and I'm making plays for other guys,\" McRoberts said. \"That's what I'm more comfortable with. I'm never going to be a guy who is going to score 30 points a night. But I think I can help make other guys better.\""}
{"game_id": "0021201190", "chunk_id": "0021201190_020", "order": 20, "role": "body", "text": "Said Bobcats coach Mike Dunlap: \"Josh brings a grittiness to our team.\""}
{"game_id": "0021201190", "chunk_id": "0021201190_021", "order": 21, "role": "body", "text": "Ellis, who had a career-high 17 assists Friday night at Atlanta, scored Milwaukee's first eight points of the second half to help the Bucks make a run. But that was short-lived as Biyombo took over inside and scored eight of his points in the third quarter, most of those coming in the paint."}
{"game_id": "0021201190", "chunk_id": "0021201190_022", "order": 22, "role": "closing", "text": "Game notes Jeff Adrien had four steals for the Bobcats and now has six over the past two games. He had just 12 the entire season before Friday night. ... The Bucks' nine-game road losing streak is their longest since Dec. 5-31, 2007. ... J.J. Redick was 2 of 11 from 3-point range in the loss. ... Walker has tied the franchise record for steals in a season with 157."}
