{"game_id": "0021700911", "chunk_id": "0021700911_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Damian Lillard did not hesitate when asked about how well the Portland Trail Blazers have been playing recently."}
{"game_id": "0021700911", "chunk_id": "0021700911_002", "order": 2, "role": "body", "text": "\"It's the best place I think we've been in years,\" he said."}
{"game_id": "0021700911", "chunk_id": "0021700911_003", "order": 3, "role": "body", "text": "Lillard had 26 points and 12 assists, and the Blazers won their fourth straight with a 116-99 victory over the Sacramento Kings on Tuesday night."}
{"game_id": "0021700911", "chunk_id": "0021700911_004", "order": 4, "role": "body", "text": "Jusuf Nurkic added 17 points and nine rebounds for Portland, which sits in fifth place in the Western Conference -- a game back of San Antonio -- after winning five of its last six games. The current four-game winning streak matched the team's longest of the season."}
{"game_id": "0021700911", "chunk_id": "0021700911_005", "order": 5, "role": "body", "text": "\"We can't be satisfied with where we are and what we've been doing,\" Lillard said. \"It's got to be on to the next thing, and keep trying to take it to the next level.\""}
{"game_id": "0021700911", "chunk_id": "0021700911_006", "order": 6, "role": "body", "text": "Zach Randolph had 20 points for the Kings, who lost their fifth straight overall. Sacramento has dropped 10 straight games at Portland's Moda Center."}
{"game_id": "0021700911", "chunk_id": "0021700911_007", "order": 7, "role": "body", "text": "With just 18 wins, Sacramento is in second-to-last place in the West, above only the Phoenix Suns. The Kings have lost four straight and six of their last seven."}
{"game_id": "0021700911", "chunk_id": "0021700911_008", "order": 8, "role": "body", "text": "\"We gave ourselves a chance multiple times tonight but when you have a team that's played with each other for a while, when things get chaotic and you need to settle down they know where to get the ball and they do a great job of that,\" Kings veteran Vince Carter said."}
{"game_id": "0021700911", "chunk_id": "0021700911_009", "order": 9, "role": "body", "text": "The Kings were playing the second of a back-to-back, after losing to Minnesota 118-100 on Monday night. Randolph sat out that game but returned against the Blazers. Randolph played six seasons in Portland."}
{"game_id": "0021700911", "chunk_id": "0021700911_010", "order": 10, "role": "body", "text": "Lillard had scored 197 points in the past five games, the most points for a Blazer over a five-game stretch in franchise history."}
{"game_id": "0021700911", "chunk_id": "0021700911_011", "order": 11, "role": "body", "text": "He had 15 points and five assists in the opening quarter against the Kings, including three 3-pointers, to give Portland a 36-26 lead. He was up to 19 points by the half, when the Blazers led 66-53. None of the Kings players were in double figures."}
{"game_id": "0021700911", "chunk_id": "0021700911_012", "order": 12, "role": "body", "text": "The Blazers led by as many as 17 points in the first half, but the Kings closed the gap in the third quarter, closing within 88-80 to start the fourth."}
{"game_id": "0021700911", "chunk_id": "0021700911_013", "order": 13, "role": "body", "text": "But CJ McCollum' jumper from out front extended the lead for Portland to 105-88 with 6:40 left. The Blazers led by as many as 19 points down the stretch."}
{"game_id": "0021700911", "chunk_id": "0021700911_014", "order": 14, "role": "body", "text": "Shabazz Napier had 20 points off the bench for Portland."}
{"game_id": "0021700911", "chunk_id": "0021700911_015", "order": 15, "role": "body", "text": "\"I thought we had good energy, our ball movement was good, defensively we were physical, we got our hands on some balls. But I think most important we were just connected,\" Lillard said. \"For the start of the game we were all on the same page once again -- just knew what we needed to get done. And we got it done.\""}
{"game_id": "0021700911", "chunk_id": "0021700911_016", "order": 16, "role": "body", "text": "When he reached 17 points, Lillard clinched the highest-scoring average for any month in Portland history. He passed Geoff Petrie who averaged 30.4 points in March, 1971. Lillard averaged 31.4 points for the month."}
{"game_id": "0021700911", "chunk_id": "0021700911_017", "order": 17, "role": "body", "text": "Lillard had 40 points in the Portland's 106-104 victory over the Suns on Saturday."}
{"game_id": "0021700911", "chunk_id": "0021700911_019", "order": 19, "role": "body", "text": "Kings: It was the fourth meeting between the two teams. Sacramento's lone win came in the first. ... Willie Cauley-Stein had 17 points and 10 rebounds."}
{"game_id": "0021700911", "chunk_id": "0021700911_020", "order": 20, "role": "body", "text": "Trail Blazers: Lillard has made a 3-pointer in 43 straight games. ... Blazers coach Terry Stotts is the reigning Western Conference Coach of the Month. ... Portland had a season-high 20 fast-break points."}
{"game_id": "0021700911", "chunk_id": "0021700911_021", "order": 21, "role": "body", "text": "PRAISE: \"Coach Stotts is a mastermind with how he runs his offense. He gets his guys to buy into their role. Once they get rolling they're a tough team to stop so you kinda have to pick your poison for what you're going to stop because they're going to score,\" Carter said."}
{"game_id": "0021700911", "chunk_id": "0021700911_023", "order": 23, "role": "body", "text": "The Kings host the Brooklyn Nets on Thursday."}
{"game_id": "0021700911", "chunk_id": "0021700911_024", "order": 24, "role": "closing", "text": "The Trail Blazers host the Timberwolves on Thursday."}
