{"game_id": "0021700999", "chunk_id": "0021700999_001", "order": 1, "role": "lead", "text": "NEW YORK --  Brett Brown sensed another mood swing building from his young 76ers team prone to mistakes, some of which were exposed during their four-game road trip."}
{"game_id": "0021700999", "chunk_id": "0021700999_002", "order": 2, "role": "body", "text": "The coach then called for a pair of timeouts during a key 3  1/2-minute stretch midway through the third quarter, quelling any worries from his squad that has Philadelphia bound for the playoffs for the first time since the spring of 2012."}
{"game_id": "0021700999", "chunk_id": "0021700999_003", "order": 3, "role": "body", "text": "Joel Embiid scored 21 points, Robert Covington added 19, and the 76ers went on to rout the Brooklyn Nets 120-97 on Sunday night."}
{"game_id": "0021700999", "chunk_id": "0021700999_004", "order": 4, "role": "body", "text": "\"I think we're learning,\" Brown said. \"I feel these games, as much as we want to win and we do, we're trying to move up the food chain, we're trying to move up as far as we can.\""}
{"game_id": "0021700999", "chunk_id": "0021700999_005", "order": 5, "role": "body", "text": "Dario Saric scored 18 points and Ben Simmons had 11 points, six assists and six rebounds for the 76ers, who were able to avenge a disappointing loss to the Nets at Barclays Center in January."}
{"game_id": "0021700999", "chunk_id": "0021700999_006", "order": 6, "role": "body", "text": "Philadelphia closed out its road trip at 2-2."}
{"game_id": "0021700999", "chunk_id": "0021700999_007", "order": 7, "role": "body", "text": "D'Angelo Russell had 26 points for the Nets, who have lost 13 of their last 15 games."}
{"game_id": "0021700999", "chunk_id": "0021700999_008", "order": 8, "role": "body", "text": "\"I just feel like we've got to treat every team like Golden State. When we came out ready to play, everybody stepped up,\" Russell said. \"It wasn't 48 minutes, but we started the game and gave ourselves a chance. I feel like today we didn't really give ourselves a chance.\""}
{"game_id": "0021700999", "chunk_id": "0021700999_009", "order": 9, "role": "body", "text": "Philadelphia led by as many as 19 points in the first half before the Nets cut it to six on consecutive baskets by Russell early in the third quarter to make it 74-68 with 8:20 remaining."}
{"game_id": "0021700999", "chunk_id": "0021700999_010", "order": 10, "role": "body", "text": "Brown then called a timeout and the 76ers responded with a 6-0 run and two key steals to go up 80-68 with 6:40 left in the period."}
{"game_id": "0021700999", "chunk_id": "0021700999_011", "order": 11, "role": "body", "text": "A 3-pointer by Brooklyn's Allen Crabbe cut the lead to 86-77 and forced Brown to take another timeout with 4:45 to go."}
{"game_id": "0021700999", "chunk_id": "0021700999_012", "order": 12, "role": "body", "text": "Something then clicked, although both teams trading baskets, with the last one in the quarter coming from Nets reserve forward Rondae Hollis-Jefferson's dunk with 1:22 remaining, cutting the deficit to 96-83. With a strong contingent of fans that started a chant for the Super Bowl champion Philadelphia Eagles, it was as close at the Nets would get."}
{"game_id": "0021700999", "chunk_id": "0021700999_013", "order": 13, "role": "body", "text": "The 76ers' defense tightened up in the fourth quarter and didn't allow a Brooklyn basket until 2:22 left in regulation. Its offense went on to blitz the Nets off the floor in the opening moments of the final period with a 7-0 run that pushed the lead to 103-83."}
{"game_id": "0021700999", "chunk_id": "0021700999_014", "order": 14, "role": "body", "text": "After a pair of free throws from DeMarre Carroll ended a scoring drought of almost seven minutes, Marco Belinelli answered by making back-to-back baskets to put the Sixers up by 109-85."}
{"game_id": "0021700999", "chunk_id": "0021700999_015", "order": 15, "role": "body", "text": "\"Energy. We were on lockdown,\" Embiid said. \"We locked in and we did a better job. We were aggressive rebounding the ball. We gave up less offensive rebounds.\""}
{"game_id": "0021700999", "chunk_id": "0021700999_017", "order": 17, "role": "body", "text": "The Sixers didn't go out and add a big name to bolster their roster at the trade deadline, but they were able to land two key pieces that make them a better product than they were back in February, according to Brown."}
{"game_id": "0021700999", "chunk_id": "0021700999_018", "order": 18, "role": "body", "text": "Since joining Philadelphia, Belinelli has averaged 11.3 points, while Ersan Ilyasova has given them 9.4 points and 4.0 assists per game."}
{"game_id": "0021700999", "chunk_id": "0021700999_019", "order": 19, "role": "body", "text": "\"I think that they give you a far greater chance to try to win in the playoffs,\" Brown said. \"I felt like the group that we had, we were right there. I think that they tip it. I think that they provide a veteran sort of presence.\""}
{"game_id": "0021700999", "chunk_id": "0021700999_021", "order": 21, "role": "body", "text": "76ers: Philadelphia had four other players score in double figures. Starter JJ Reddick added 12 points. Ersan Ilyasova came off the bench with 11 points and 13 rebounds, with Justin Anderson chipping in 11. T.J. McConnell filled up the stats sheet by tallying 10 points, six assists, four steals and four boards."}
{"game_id": "0021700999", "chunk_id": "0021700999_022", "order": 22, "role": "body", "text": "Nets: Russell is averaging 15.6 points, 5.9 assists and 3.6 rebounds in eight games since the All-Star break."}
{"game_id": "0021700999", "chunk_id": "0021700999_024", "order": 24, "role": "body", "text": "76ers: host Indiana on Tuesday night."}
{"game_id": "0021700999", "chunk_id": "0021700999_025", "order": 25, "role": "closing", "text": "Nets: host the Eastern Conference-leading Toronto Raptors on Tuesday night."}
