{"game_id": "0021301217", "chunk_id": "0021301217_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- The Atlanta Hawks got a confidence boost before the playoffs. The Milwaukee Bucks found out they were being sold.\nIt turned out to be a big night for two teams headed in different directions with the regular season coming to a close.\nMike Scott scored 17 points to lead Atlanta in a 111-103 win Wednesday, hours after Milwaukee owner Herb Kohl announced he was selling his team.\nMike Muscala added 15 points on 6-of-8 shooting for the Hawks, who rallied from a 12-point deficit in the first half.\n\"I think the defense after the first quarter really picked up. It was where we want it to be and need it to be,\" coach Mike Budenholzer said.\nAtlanta is locked into the eighth seed in the Eastern Conference playoffs and a first-round date with the Indiana Pacers. Scott started for forward Paul Millsap, who was rested to get ready for the postseason.\n\"We feel like we are playing about as well as we have played all year for the most part. So the regular season is done, we will take a couple days and get ready for Indiana,\" forward Kyle Korver said.\nBrandon Knight scored 31 points to lead the Bucks, who finished an NBA-worst 15-67. Their dismal season is over, though there is more certainty about the team's future after the prospective new owners said they wanted to build a new arena in Milwaukee.\nKohl came into the locker room and addressed the team before the game. Coach Larry Drew thinks his team may have been a little distracted, on top of playing the last game of the year.\n\"I would like to think that the concentration was there, but I think I would be lying if I said it was,\" he said. \"This was a big day with all that has happened.\"\nThe NBA is expected to approve the estimated $550 million sale to New York investment firm executives Marc Lasry and Wesley Edens, who also committed $100 million toward a new arena to replace the BMO Harris Bradley Center. Kohl, a former U.S. senator, also promised to fork over $100 million for a new facility.\nWearing a dark green suit to match the Bucks' dominant team color, Kohl received a standing ovation and watched about four rows from the floor at center court as his team went out and scored 39 points in the first quarter, a season-high for the opening period.\nBut Atlanta took control in the second half, even if the team didn't have much at stake. The top goal was to stay sharp but injury-free, and Budenholzer limited the minutes for key players Korver, DeMarre Carroll and Jeff Teague on top of having Millsap sit out.\nThe contest had the up-and-down feel of a playground pickup game at times, especially during a first half in which the Bucks shot 63 percent to the Hawks' 60. Atlanta trailed by as much as 12 in the first half before going up by double digits in the fourth quarter.\n\"We just wanted to end the season playing good basketball,\" Korver said.\nAtlanta's second unit seemed to have more energy down the stretch in pulling past the Bucks.\nAt one point, Ramon Sessions had his pass deflected in the backcourt and bounce past teammate Jeff Adrien, who momentarily froze. It was enough time for Cartier Martin to track down the loose ball and coast in for an uncontested layup during a 15-4 run that helped Hawks take a 97-87 lead with 6:54 left.\nAnother second half during which the Bucks ran out of steam -- a season-long issue.\n\"We had some rough nights. This is a humbling experience,\" said forward John Henson, who had 19 points. \"I think for me and everybody on this team, I'm pretty sure nobody imagined this could have happened.\"\nKhris Middleton finished with 16 points and seven rebounds for Milwaukee. Six players scored in double figures for the Hawks.\nGame notes\nThe Hawks entered Wednesday having won six straight against the Bucks. ... Teague finished with 11 points, extending his career-best streak of scoring in double figures to 12 straight games. ... Atlanta has reached the playoffs for seven straight years, the longest active streak in the East. ... Drew was the Hawks' head coach from 2010-13. ... G O.J. Mayo sat out the finale with a sprained left ankle.\n--\nFollow Genaro Armas at http://twitter.com/GArmasAP"}
