{"game_id": "0021300379", "chunk_id": "0021300379_001", "order": 1, "role": "lead", "text": "HOUSTON -- Dwight Howard is happy and healthy in Houston, and coach Kevin McHale is pleased with how his superstar center has played so far this season.\nHoward scored 23 points, James Harden and Chandler Parsons each had 19, and the Rockets used a big third-quarter run to pull away for a 109-94 win over the Chicago Bulls on Wednesday night.\n\"He's just got a nice rhythm,\" McHale said of Howard. \"When he goes fast, there is a reason to go fast. When he goes slow, he's setting guys up. Basketball is such a game of rhythm, and he's in a nice flow right now.\""}
{"game_id": "0021300379", "chunk_id": "0021300379_002", "order": 2, "role": "closing", "text": "Howard joined the Rockets in July after one tumultuous season with the Lakers. He said he is feeling good but has been spending extra time after practice working on his post moves in an attempt to improve.\n\"I love it here,\" he said. \"It's a great place to be. We're having some early success, but we're not happy with where we're at. We want to continue to get better. We don't want to get satisfied.\"\nThe Rockets are 17-9 and in second place in the Southwest Division behind San Antonio.\nThe Bulls trailed by three with 5½ minutes left in the third before their offense went cold. Houston took advantage of the scoring drought, using a 15-1 spurt to make it 83-66 entering the final period.\n\"That was tremendous,\" Harden said. \"We've been striking out these last couple of games in closing quarters, and Coach has been preaching to us to make sure we go on a little run to close every quarter out. Tonight we did it, and we've got to be consistent with that.\"\nChicago missed six shots and had five turnovers in that decisive stretch, while Omri Casspi scored seven points to power Houston's offense.\nThe Rockets picked up the victory in the return of McHale, who had missed the previous three games following the death of his mother.\nJimmy Butler's 20 points tied his season high and led the Bulls, who have dropped three in a row and 12 of 15.\n\"We're losing, so mentally it's tough,\" Chicago's Joakim Noah said. \"When you lose, it's not fun, but we have to keep battling. The games keep coming and nobody feels sorry for us and we can't feel sorry for ourselves.\"\nHarden started despite spraining his left ankle Sunday night. He had scored at least 25 points in five consecutive games.\nHarden said he got stepped on again Wednesday night and was very sore after the game. He figures he'll feel worse Thursday.\n\"Probably,\" he said. \"I try not to think about it. We'll wait until tomorrow and see how it feels.\"\nHoward had nine rebounds, and Harden had six assists and three steals.\nBulls point guard Kirk Hinrich missed his third consecutive game because of back stiffness. D.J. Augustin, signed Friday, made his first start for Chicago in Hinrich's place. He finished with eight points and nine assists.\nLuol Deng scored 18 points for Chicago. Carlos Boozer had 17, and Taj Gibson added 14.\n\"At the end of the day it comes down to the fact that we have to get guys healthy,\" Boozer said. \"It seems like we are always missing somebody, but we'll do the best we can to fight through it.\"\nWith 11½ minutes left in the fourth quarter, Deng scored Chicago's first basket since there were more than five minutes left in the third. Casspi scored four points soon after that to extend Houston's lead to 89-70.\nPatrick Beverley had 15 points, Casspi added 11 and Terrence Jones had a career-high six assists for Houston.\nThe Bulls used a 10-4 run to cut the lead to 68-65 with about 5½ minutes left in the third. Augustin scored five points in that stretch, and Butler added a 3-pointer.\nCasspi ended the run with a 3, and Howard tacked on a dunk a minute after that to start Houston's big surge.\nDeng got Chicago within eight points late in the second quarter, but Beverley extended Houston's lead to 57-46 at halftime when Deng fell and he sank an off-balance 3 at the buzzer. Officials at first said it didn't count, but a review showed he got it off in time.\nNOTES: Houston PG Jeremy Lin missed his second straight game with back spasms. ... Bulls coach Tom Thibodeau said he doesn't expect Hinrich to be out for an extended period."}
