{"game_id": "0021700013", "chunk_id": "0021700013_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Just imagine what these Houston Rockets might look like months from now, when James Harden has a healthy Chris Paul alongside him in the backcourt and Mike D'Antoni's rotations become more consistent."}
{"game_id": "0021700013", "chunk_id": "0021700013_002", "order": 2, "role": "body", "text": "Beginning the season with a tough back-to-back in Northern California hardly made for an easy start, and Houston is an impressive 2-0."}
{"game_id": "0021700013", "chunk_id": "0021700013_003", "order": 3, "role": "body", "text": "Harden had 27 points and nine assists, and the Rockets made it a perfect two-game road trip despite playing this one without Paul, beating the Sacramento Kings 105-100 on Wednesday night to spoil another home team's opener."}
{"game_id": "0021700013", "chunk_id": "0021700013_004", "order": 4, "role": "body", "text": "\"Obviously this road trip was going to be tough, but we did a really good job, especially tonight, of not letting up and just playing four quarters,\" Harden said. \"We say it all the time: We might not knock you out in the first, second or third quarter, but fourth quarter if we keep playing the way we need to play we've always got a chance.\""}
{"game_id": "0021700013", "chunk_id": "0021700013_005", "order": 5, "role": "body", "text": "While he didn't shoot especially well, Harden hit a trio of dagger 3-pointers with 8:13, 6:00 and 5:13 left -- the second of which put Houston ahead 89-79. He also had a key left-handed layup late and finished 8 for 21 and 4 of 14 from 3-point range."}
{"game_id": "0021700013", "chunk_id": "0021700013_006", "order": 6, "role": "body", "text": "Sacramento forced the Rockets into a shot clock violation and the Kings got the ball back with just less than a minute remaining and down 96-92. Willie Cauley-Stein made one of two free throws with 41 seconds left and Harden found Clint Capela for an alley-oop dunk moments later."}
{"game_id": "0021700013", "chunk_id": "0021700013_007", "order": 7, "role": "body", "text": "After the Kings stole the inbounds pass from Eric Gordon with 25 seconds left and down 98-95, it was initially ruled Sacramento ball but the play went to replay review and a foul was issued to George Hill instead. Gordon converted two free throws."}
{"game_id": "0021700013", "chunk_id": "0021700013_008", "order": 8, "role": "body", "text": "Capela had 22 points and matched his career high with 17 rebounds. Paul sat out with a bruised left knee that limited him during Houston's stunning comeback 122-121 win at Golden State on Tuesday after the Warriors held their championship ring ceremony."}
{"game_id": "0021700013", "chunk_id": "0021700013_009", "order": 9, "role": "body", "text": "Gordon started for Paul and scored 25 points with four 3-pointers, a night after missing all six of his tries from long range but still winding up with 24 points in 29 minutes."}
{"game_id": "0021700013", "chunk_id": "0021700013_010", "order": 10, "role": "body", "text": "Buddy Hield scored 10 of his 19 points in the third quarter for Sacramento and tied the game at 68 on a 3-pointer with 3:33 left in the period. Cauley-Stein had 21 points on 10-for-15 shooting, 10 rebounds and three blocked shots."}
{"game_id": "0021700013", "chunk_id": "0021700013_011", "order": 11, "role": "body", "text": "The Rockets looked sluggish at times in the second game of a season-opening back-to-back. Yet Houston had enough to win its sixth straight in the series after winning all four games last season."}
{"game_id": "0021700013", "chunk_id": "0021700013_012", "order": 12, "role": "body", "text": "\"To validate yesterday we had to win today or we wouldn't validate yesterday,\" D'Antoni said. \"They had that in mind. At the same time, a back-to-back on the opening two nights, especially it's so emotional, that takes more out of you.\""}
{"game_id": "0021700013", "chunk_id": "0021700013_013", "order": 13, "role": "body", "text": "Zach Randolph missed making his Kings debut a day after undergoing oral surgery, but Vince Carter and Hill provided a veteran presence for the new-look Kings as they move forward beginning the season without DeMarcus Cousins after he was traded to New Orleans last February. Hill scored 16 points and Carter six in 14 minutes."}
{"game_id": "0021700013", "chunk_id": "0021700013_014", "order": 14, "role": "body", "text": "\"We saw a lot of things we were proud about,\" coach Dave Joerger said. \"The No. 1 thing is if we compete that hard we are going to give ourselves a chance in games.\""}
{"game_id": "0021700013", "chunk_id": "0021700013_016", "order": 16, "role": "body", "text": "D'Antoni isn't counting on Paul being back Saturday for the home opener against Dallas."}
{"game_id": "0021700013", "chunk_id": "0021700013_017", "order": 17, "role": "body", "text": "\"It's not a concern, it's just nagging,\" D'Antoni said. \"We'll sit him until the training staff thinks he's ready to go and try to get over it totally.\""}
{"game_id": "0021700013", "chunk_id": "0021700013_018", "order": 18, "role": "body", "text": "Paul had four points and shot 2 for 9 at Golden State but was limited by soreness in the knee. He led the Rockets with 11 assists and also grabbed eight rebounds, while playing 33 minutes in his regular-season debut with Houston after being traded by the Clippers during the offseason."}
{"game_id": "0021700013", "chunk_id": "0021700013_020", "order": 20, "role": "body", "text": "Rockets: The Rockets were 13-3 in the second game of back-to-backs last season. The have 14 such sets, 13 remaining. ... Trevor Ariza was held to two points on free throws, shooting 0 for 6 and missing all five of his 3s. ... Houston's schedule includes seven of its first 10 games on the road. ... P.J. Tucker had just six points while dealing with foul trouble after scoring 20 points in his Rockets debut at Golden State."}
{"game_id": "0021700013", "chunk_id": "0021700013_021", "order": 21, "role": "body", "text": "Kings: Rookie De'Aaron Fox out of Kentucky drew big cheers when he checked in for his debut late in the first and finished with 14 points, five assists and four rebounds in 23 minutes. ... Second-year Golden 1 Center hosted its first season opener after the Kings began on the road last season."}
{"game_id": "0021700013", "chunk_id": "0021700013_023", "order": 23, "role": "body", "text": "Rockets: Host Dallas on Saturday in home opener."}
{"game_id": "0021700013", "chunk_id": "0021700013_024", "order": 24, "role": "body", "text": "Kings: At Dallas on Friday to start a three-game road trip."}
{"game_id": "0021700013", "chunk_id": "0021700013_026", "order": 26, "role": "closing", "text": "More AP NBA coverage: https://apnews.com/tag/NBAbasketball"}
