{"game_id": "0021700549", "chunk_id": "0021700549_001", "order": 1, "role": "lead", "text": "CLEVELAND --  Isaiah Thomas had one last wait."}
{"game_id": "0021700549", "chunk_id": "0021700549_002", "order": 2, "role": "body", "text": "Sitting on the scorer's table, Thomas could see the end of his seventh-month odyssey in front of him. And when the buzzer finally sounded and the Cleveland crowd erupted for a player it barely knows, Thomas took the last few steps onto the court and completed a trip he hopes to never take again."}
{"game_id": "0021700549", "chunk_id": "0021700549_004", "order": 4, "role": "body", "text": "Thomas showed flashes of what made him an All-Star in his long-awaited debut for the Cavaliers, who snapped a three-game losing streak by beating the Portland Trail Blazers 127-110 on Tuesday night."}
{"game_id": "0021700549", "chunk_id": "0021700549_005", "order": 5, "role": "body", "text": "\"It's been a long journey for me,\" Thomas said. \"I couldn't really see the light at the end of the tunnel. For that day to come the first couple days of 2018, it's going to be a special year.\""}
{"game_id": "0021700549", "chunk_id": "0021700549_006", "order": 6, "role": "body", "text": "It was a special night for Thomas, who scored 17 points and played 19 minutes in his first game in seven months, an impressive return to action for the dynamic point guard traded to Cleveland last summer. He added three 3-pointers and three assists before leaving with 8:10 remaining and the Cavs up by 12."}
{"game_id": "0021700549", "chunk_id": "0021700549_007", "order": 7, "role": "body", "text": "Before leaving the floor, Thomas got a hug from LeBron James and one from Cavs coach Tyronn Lue, who pulled him close and offered two perfect words."}
{"game_id": "0021700549", "chunk_id": "0021700549_009", "order": 9, "role": "body", "text": "James scored 24 points, Kevin Love had 19 and Jae Crowder added 15 for the Cavs, who were coming off losses at Golden State, Sacramento and Utah."}
{"game_id": "0021700549", "chunk_id": "0021700549_010", "order": 10, "role": "body", "text": "Damian Lillard scored 25 for the Blazers after missing five games with a hamstring injury. Jusuf Nurkic added 23 and CJ McCollum had 19 for Portland."}
{"game_id": "0021700549", "chunk_id": "0021700549_011", "order": 11, "role": "body", "text": "Thomas hadn't played since May 19 because of a torn labrum in his hip that ended his 2017 postseason with Boston and threatened to derail his career. But the 5-foot-9 playmaker, who inspired the Celtics and an entire city last year by playing in the immediate aftermath of his sister's death, patiently stuck with his rehab."}
{"game_id": "0021700549", "chunk_id": "0021700549_012", "order": 12, "role": "body", "text": "And with 4:33 left in the first quarter, Thomas checked in to a loud ovation as fans cheered for a player they believe can help the Cavs win another title."}
{"game_id": "0021700549", "chunk_id": "0021700549_013", "order": 13, "role": "body", "text": "\"It was a special moment,\" he said. \"I haven't played in a game and you would think I was here for a few years and playing and battling in the Finals with this team. But it was special for my family to be here, my wife and kids to see that, that's genuine love right there.\""}
{"game_id": "0021700549", "chunk_id": "0021700549_014", "order": 14, "role": "body", "text": "This was the first chance for James and the rest of the Cavs to play with Thomas, who will sit out Wednesday's homecoming in Boston. He's not an enemy, but family."}
{"game_id": "0021700549", "chunk_id": "0021700549_015", "order": 15, "role": "body", "text": "\"What I like most about him is he has a chip on his shoulder for life,\" James said. \"That's just who he is. When a guy's got a chip on his shoulder for life, he's never going to not work hard. Not going to never give it his all. Not going to never disappoint you.\""}
{"game_id": "0021700549", "chunk_id": "0021700549_016", "order": 16, "role": "body", "text": "The Cavs were unable to separate from the Blazers until Thomas and Dwyane Wade teamed up in the fourth."}
{"game_id": "0021700549", "chunk_id": "0021700549_017", "order": 17, "role": "body", "text": "Thomas knocked down a jumper and then fired a pass toward the baseline to a cutting Wade, who made a reverse layup. On Cleveland's next possession, Thomas spotted up in the corner and buried a 3-pointer to give the Cavs a 100-91 lead."}
{"game_id": "0021700549", "chunk_id": "0021700549_018", "order": 18, "role": "body", "text": "\"This is obviously our first time playing together, but you can see moments where he added a dynamic that we need, especially if we want to get to where we want to be,\" Wade said. \"Happy that he's back on the court and glad he's on our side.\""}
{"game_id": "0021700549", "chunk_id": "0021700549_020", "order": 20, "role": "body", "text": "Lue will keep close tabs on Thomas' minutes over the next few weeks while he builds up stamina and confidence. Initially, Thomas won't play in any back-to-back games."}
{"game_id": "0021700549", "chunk_id": "0021700549_022", "order": 22, "role": "body", "text": "Wednesday's game will be the second matchup between the Celtics and Cavs, who have developed a rivalry in recent years."}
{"game_id": "0021700549", "chunk_id": "0021700549_023", "order": 23, "role": "body", "text": "\"It's not one of 82 because they're the No. 1 seed and we have some history with them obviously,\" James said. \"But it's not more than that. We want to go in there and play well.\""}
{"game_id": "0021700549", "chunk_id": "0021700549_025", "order": 25, "role": "body", "text": "Thomas took a couple hard falls, good tests for his hip."}
{"game_id": "0021700549", "chunk_id": "0021700549_026", "order": 26, "role": "body", "text": "Driving the lane past Shabazz Napier, Thomas dropped in a left-handed scoop shot while being fouled and crashed to the floor. He got up and shook off the contact, clearing another important hurdle in his comeback."}
{"game_id": "0021700549", "chunk_id": "0021700549_028", "order": 28, "role": "body", "text": "Lillard played 33 minutes in his first game since Dec. 20. He made six 3-pointers and had six assists, but was unhappy with seven turnovers."}
{"game_id": "0021700549", "chunk_id": "0021700549_029", "order": 29, "role": "body", "text": "\"My conditioning was pretty good,\" he said. \"My timing was a little bit off with some of my passes but everything else, I felt pretty good.\""}
{"game_id": "0021700549", "chunk_id": "0021700549_031", "order": 31, "role": "body", "text": "Blazers: Were outscored 36-23 in the fourth. ... Portland went 3-2 without Lillard. ... Nurkic, a 7-footer, went down hard when he appeared to be hit by James on a drive in the second quarter. However, replays showed that James barely grazed the big man."}
{"game_id": "0021700549", "chunk_id": "0021700549_032", "order": 32, "role": "body", "text": "Cavaliers: Won their 13th straight at home. ... Have made at least 10 3s in franchise record 26 straight games. ... Thomas expects a warm welcome from Boston fans. \"I know it will be all love,\" he said. \"I gave that city everything I had and they showed me genuine love back and I think that love is going to last forever. So, there are no hard feelings. This ain't no revenge game.\""}
{"game_id": "0021700549", "chunk_id": "0021700549_034", "order": 34, "role": "body", "text": "Blazers: Home against Atlanta on Friday."}
{"game_id": "0021700549", "chunk_id": "0021700549_035", "order": 35, "role": "body", "text": "Cavaliers: Begin a five-game trip against the Celtics."}
{"game_id": "0021700549", "chunk_id": "0021700549_037", "order": 37, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
