{"game_id": "0021700310", "chunk_id": "0021700310_001", "order": 1, "role": "lead", "text": "DALLAS --  Demarre Carroll wasn't happy about the way the Brooklyn Nets started the third quarter in a 109-104 victory over the Dallas Mavericks on Wednesday night."}
{"game_id": "0021700310", "chunk_id": "0021700310_002", "order": 2, "role": "body", "text": "\"We looked lackadaisical,\" Carroll said. \"Nobody was being aggressive, so I just decided to be aggressive.\""}
{"game_id": "0021700310", "chunk_id": "0021700310_004", "order": 4, "role": "body", "text": "Carroll scored 15 of his 22 points in the third quarter, hitting three 3-pointers and shooting 5 of 6 from the floor."}
{"game_id": "0021700310", "chunk_id": "0021700310_005", "order": 5, "role": "body", "text": "\"I just feel like a lot of guys look up to me and try to see what I'm going to do,\" Carroll said. \"So I just try to come out and do whatever I need to do to help this team win.\""}
{"game_id": "0021700310", "chunk_id": "0021700310_006", "order": 6, "role": "body", "text": "Trevor Booker had 16 points and 10 rebounds, Spencer Dinwidde added 19 points, and Caris Levert had 13 for the Nets."}
{"game_id": "0021700310", "chunk_id": "0021700310_007", "order": 7, "role": "body", "text": "Harrison Barnes had 17 points for Dallas, Maxi Kleber added a career-high 16, and Dwight Powell had 14."}
{"game_id": "0021700310", "chunk_id": "0021700310_008", "order": 8, "role": "body", "text": "Carroll put the Nets ahead for good at 78-76 on a 3-pointer with 2:03 remaining in the third quarter."}
{"game_id": "0021700310", "chunk_id": "0021700310_009", "order": 9, "role": "body", "text": "Brooklyn led by as much as nine points in the fourth quarter, taking a 106-97 advantage with 1:32 remaining on Joe Harris' 3-pointer. Dallas responded with a 7-0 run, cutting it to 106-104, before the Nets finally iced it with a pair of rebounds in the final 10.5 seconds."}
{"game_id": "0021700310", "chunk_id": "0021700310_010", "order": 10, "role": "body", "text": "Harris split a pair of free throws with 10.5 seconds remaining, but Brooklyn kept possession after the rebound went off a Mavericks player and out of bounds. Dinwiddie then missed a pair of free throws with 7.4 seconds left, but Booker grabbed a rebound, and Dinwiddie redeemed himself with a pair of free throws to complete the scoring with 5.2 seconds remaining."}
{"game_id": "0021700310", "chunk_id": "0021700310_011", "order": 11, "role": "body", "text": "It was a missed opportunity for the Mavericks."}
{"game_id": "0021700310", "chunk_id": "0021700310_012", "order": 12, "role": "body", "text": "\"It's lack of execution,\" Mavericks coach Rick Carlisle said. \"It's on me, I had the wrong in the game. I've got to get guys in there that can go and get the ball. In the second half they beat us to multiple loose balls.\""}
{"game_id": "0021700310", "chunk_id": "0021700310_013", "order": 13, "role": "body", "text": "Brooklyn struggled at the free-throw line, going 14 of 25 attempts."}
{"game_id": "0021700310", "chunk_id": "0021700310_014", "order": 14, "role": "body", "text": "\"It might be mental at this point,\" Carroll said. \"We can't be a really good team missing free throws like that and I think we will, but we got to get in the gym, take it upon ourselves individually to knock down free throws.\""}
{"game_id": "0021700310", "chunk_id": "0021700310_017", "order": 17, "role": "body", "text": "Nets: Dinwiddie made his eighth straight start in place of D'Angelo Russell, who sustained a knee injury Nov. 11. ... Brooklyn led 48-47 at halftime."}
{"game_id": "0021700310", "chunk_id": "0021700310_018", "order": 18, "role": "body", "text": "Mavericks: G Yogi Ferrell played 10 games for Brooklyn during the 2016-17 season before getting release and signing a contract with Dallas. Ferrell had eight points."}
{"game_id": "0021700310", "chunk_id": "0021700310_020", "order": 20, "role": "body", "text": "Carlisle was frustrated during his postgame media availability and was disappointed that his team had to have a league-mandated day off on Thursday"}
{"game_id": "0021700310", "chunk_id": "0021700310_021", "order": 21, "role": "body", "text": "\"Just to prove that in the NBA no bad deed goes punished,\" Carlisle said. \"We play like this and our players get a day off. We've got a lot of thinking to do about how we want to finish this homestand.\""}
{"game_id": "0021700310", "chunk_id": "0021700310_023", "order": 23, "role": "body", "text": "The Nets won two of three games on their road trip, and had a strong showing in a loss to the Houston Rockets. For coach Kenny Atkinson it was a big step in the right direction after entering the trip with a 2-7 record on the road."}
{"game_id": "0021700310", "chunk_id": "0021700310_024", "order": 24, "role": "body", "text": "\"You hate to say there are big games in an NBA season because it's so long, but we talked about getting two on this trip,\" Atkinson said. \"We knew it was going to be a tough trip. The fact that we got two and had a good fight in Houston, that's real positive for us going forward.\""}
{"game_id": "0021700310", "chunk_id": "0021700310_026", "order": 26, "role": "body", "text": "Nets: Host Atlanta on Saturday."}
{"game_id": "0021700310", "chunk_id": "0021700310_027", "order": 27, "role": "body", "text": "Mavericks: Host the Los Angeles Clippers on Saturday."}
{"game_id": "0021700310", "chunk_id": "0021700310_029", "order": 29, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
