{"game_id": "0021200480", "chunk_id": "0021200480_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- Kyrie Irving feels he's at his best when the fourth quarter begins."}
{"game_id": "0021200480", "chunk_id": "0021200480_002", "order": 2, "role": "body", "text": "He certainly was Friday night."}
{"game_id": "0021200480", "chunk_id": "0021200480_003", "order": 3, "role": "body", "text": "Irving scored 16 of his game-high 33 points in the final period, including a pull-up jumper from the foul line with one second left, to help the Cleveland Cavaliers defeat the Charlotte Bobcats 106-104 and snap a three-game losing streak."}
{"game_id": "0021200480", "chunk_id": "0021200480_004", "order": 4, "role": "body", "text": "Irving scored 16 of his team's final 18 points in the fourth quarter."}
{"game_id": "0021200480", "chunk_id": "0021200480_005", "order": 5, "role": "body", "text": "\"I kind of got in a zone and kept it going,\" Irving said. \"And they kept feeding me.\""}
{"game_id": "0021200480", "chunk_id": "0021200480_006", "order": 6, "role": "body", "text": "With the game tied and 16 seconds left, everyone in the crowd knew who was going to take the last shot for the Cavaliers."}
{"game_id": "0021200480", "chunk_id": "0021200480_007", "order": 7, "role": "body", "text": "\"Those are the moments I kind of live for,\" Irving said."}
{"game_id": "0021200480", "chunk_id": "0021200480_008", "order": 8, "role": "body", "text": "Bobcats coach Mike Dunlap chose to defend Irving with rookie Jeffery Taylor, a 6-foot-7 forward known for his defense. Taylor stayed with him at first, cautiously giving him room before Irving stutter-stepped and pulled back to launch a jumper from the right elbow."}
{"game_id": "0021200480", "chunk_id": "0021200480_009", "order": 9, "role": "body", "text": "Irving said he didn't know what move he'd try to make, but when the shot left his hands there was no doubt in his mind it was going in."}
{"game_id": "0021200480", "chunk_id": "0021200480_010", "order": 10, "role": "body", "text": "\"I just read the defense,\" Irving said. \"He's taller than me but he won't stop me from getting where I need to go. I just created space and shot my pull-up.\""}
{"game_id": "0021200480", "chunk_id": "0021200480_011", "order": 11, "role": "body", "text": "Irving finished 10 of 21 from the field and converted all 10 free throws to go along with six assists, five rebounds and a career-high three blocked shots."}
{"game_id": "0021200480", "chunk_id": "0021200480_012", "order": 12, "role": "body", "text": "Tristan Thompson added 19 points and C.J. Miles added 18 for the Cavaliers."}
{"game_id": "0021200480", "chunk_id": "0021200480_013", "order": 13, "role": "body", "text": "\"He has that look in his eye every fourth quarter,\" Miles said of Irving. \"In the Brooklyn game he walked into the huddle and told us 'The fourth quarter is mine.' What am I going to say, 'No?' But he's been a fourth-quarter guy since he's been in the league. He has a mental thing where he has another level, another gear which helps him make big shots.\""}
{"game_id": "0021200480", "chunk_id": "0021200480_014", "order": 14, "role": "body", "text": "Charlotte's Gerald Henderson said it's difficult to stop Irving in that type of game-winning situation."}
{"game_id": "0021200480", "chunk_id": "0021200480_015", "order": 15, "role": "body", "text": "\"It's tough because you never know what shot he is going to take,\" Henderson said. \"He can make any shot. So, you know how good he is off the dribble so you want to give him a little cushion, but you can't really give him that much because you know he can shoot the lights out of the ball."}
{"game_id": "0021200480", "chunk_id": "0021200480_016", "order": 16, "role": "body", "text": "\"You just have to toy with him and move your feet and guess a little bit and also rely on help from your teammates but he is special. He really is special because he can score in so many ways.\""}
{"game_id": "0021200480", "chunk_id": "0021200480_017", "order": 17, "role": "body", "text": "Ben Gordon led Charlotte's second-half charge, finishing with 27 points."}
{"game_id": "0021200480", "chunk_id": "0021200480_018", "order": 18, "role": "body", "text": "Ramon Sessions added 20 points and Henderson had 17, including a career-high four 3-pointers for the Bobcats, who have lost 19 of 20."}
{"game_id": "0021200480", "chunk_id": "0021200480_019", "order": 19, "role": "body", "text": "The Cavs led by as many as 18 in the third quarter but the Bobcats battled back to take the lead at 91-90 with 4:43 left when Gordon knocked down a step-back jumper and a floater and Sessions hit a pair of free throws."}
{"game_id": "0021200480", "chunk_id": "0021200480_020", "order": 20, "role": "body", "text": "Irving answered seconds later with a 3-pointer to give the Cavaliers the lead back."}
{"game_id": "0021200480", "chunk_id": "0021200480_022", "order": 22, "role": "body", "text": "He knocked down another 3-pointer on the next possession and put his finger to his lip to silence the crowd."}
{"game_id": "0021200480", "chunk_id": "0021200480_023", "order": 23, "role": "body", "text": "The Bobcats rallied and Henderson tied the game with a turnaround jumper in the lane with 16 seconds left."}
{"game_id": "0021200480", "chunk_id": "0021200480_024", "order": 24, "role": "body", "text": "After Irving's jumper, Henderson got a good look on the ensuing inbounds play, but his desperation 3-pointer hit the rim and fell away."}
{"game_id": "0021200480", "chunk_id": "0021200480_025", "order": 25, "role": "body", "text": "\"Our guys never seem to make it easy on us,\" Cavaliers coach Byron Scott said. \"You know that is one thing I told them, we have to figure out how to have a killer instinct when you have a team down like that, don't relax and just allow them to get back in the game. I thought that is what we did.\""}
{"game_id": "0021200480", "chunk_id": "0021200480_026", "order": 26, "role": "body", "text": "The Bobcats came in looking for their first two-game win streak since Nov. 21 after snapping an 18-game losing streak Monday night with a 91-81 win against the Chicago Bulls."}
{"game_id": "0021200480", "chunk_id": "0021200480_027", "order": 27, "role": "body", "text": "Charlotte committed 10 turnovers in the first half leading to eight Cavaliers points and fell behind 62-48 at the break."}
{"game_id": "0021200480", "chunk_id": "0021200480_028", "order": 28, "role": "body", "text": "\"The lesson learned here is we can't come out flat as a tack and give up those kind of points early,\" Dunlap said."}
{"game_id": "0021200480", "chunk_id": "0021200480_029", "order": 29, "role": "closing", "text": "Game notes Charlotte forward Tyrus Thomas returned after missing the past 23 games with a left calf strain. He played 12 minutes and scored four points. ... The Cavaliers only played eight players and Charlotte's bench outscored Cleveland's 59-19. It was only the third time in franchise history two players scored 20-plus points off the bench. ... It was the third time this season Irving has had 30 or more points in a game."}
