{"game_id": "0021700914", "chunk_id": "0021700914_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  The Toronto Raptors have been on a tear offensively the past month. They paused for a few minutes of defense and it made the difference against Orlando."}
{"game_id": "0021700914", "chunk_id": "0021700914_002", "order": 2, "role": "body", "text": "DeMar DeRozan scored 21 points and Kyle Lowry added 17 points, 11 assists and seven rebounds to lead the Raptors to a 117-104 victory over the Magic on Wednesday night for their 11th win in the last 13 games."}
{"game_id": "0021700914", "chunk_id": "0021700914_003", "order": 3, "role": "body", "text": "Pascal Siakam had 14 points, Jakob Poeltl added 13 and Fred VanVleet scored 12."}
{"game_id": "0021700914", "chunk_id": "0021700914_004", "order": 4, "role": "body", "text": "The Raptors have averaged 116.4 points during the 13-game stretch and were blistering at that end of the floor, but it was a short window of defense in the fourth quarter, with mostly reserves on the floor, that turned Wednesday's game."}
{"game_id": "0021700914", "chunk_id": "0021700914_005", "order": 5, "role": "body", "text": "Leading 97-96 with 7:12 left, the Raptors limited the Magic to a pair of free throws over the next five minutes, outscoring them 13-2. Siakam, VanVleet, CJ Miles and Deion Wright, all reserves, scored all the points in that stretch."}
{"game_id": "0021700914", "chunk_id": "0021700914_006", "order": 6, "role": "body", "text": "\"We didn't match Orlando's intensity until the fourth quarter,\" Lowry said. \"We found the next level at the end of the game, but it took us a long time to get there.\""}
{"game_id": "0021700914", "chunk_id": "0021700914_007", "order": 7, "role": "body", "text": "Siakam's fast-break layup finished off the run and gave Toronto a 110-98 cushion for the final two minutes of the game. The second-year reserve had 10 of his 14 points in the final five minutes of the game."}
{"game_id": "0021700914", "chunk_id": "0021700914_008", "order": 8, "role": "body", "text": "\"The most important thing was being out there at the end of the game and knowing the coaches trust us,\" Siakam said. \"When the second unit comes in, we have to come in with energy make the game go a little faster.\""}
{"game_id": "0021700914", "chunk_id": "0021700914_009", "order": 9, "role": "body", "text": "Down the hall, the Magic were lamenting their seventh straight loss and how familiar it felt."}
{"game_id": "0021700914", "chunk_id": "0021700914_010", "order": 10, "role": "body", "text": "\"We kind of lose the same way every night,\" Fournier said."}
{"game_id": "0021700914", "chunk_id": "0021700914_011", "order": 11, "role": "body", "text": "\"Defense is where the game was lost,\" Magic coach Frank Vogel said, finishing off the thought."}
{"game_id": "0021700914", "chunk_id": "0021700914_012", "order": 12, "role": "body", "text": "Fournier and reserve forward Mario Hezonja led Orlando with 17 points apiece. Nikola Vucevic added 14 points and Aaron Gordon had 11 points and 10 rebounds for the Magic, who had seven players score in double figures, but still came up short."}
{"game_id": "0021700914", "chunk_id": "0021700914_013", "order": 13, "role": "body", "text": "\"We're doing some really positive things at the offensive end, but we just don't show enough resistance defending the paint, keeping our man in front of us and it's been costly,\" Vogel said. \"Neither the starting group nor the bench group defended at a high enough level for us to win tonight.\""}
{"game_id": "0021700914", "chunk_id": "0021700914_015", "order": 15, "role": "body", "text": "RAPTORS: F OG Anunoby sprained his ankle in the second quarter and didn't return. . The Raptors made their first five 3-pointers and had two four-point opportunities in the first 13 minutes of the game. . PF Serge Ibaka played his first game in Orlando since being traded to Toronto just before the trade deadline last season. . Poeltl has blocked a shot in 10 straight games. . Lowry, an 86.3 percent free throw shooter, missed his first four free throw attempts."}
{"game_id": "0021700914", "chunk_id": "0021700914_016", "order": 16, "role": "body", "text": "MAGIC: Orlando shot 76.2 percent (16 of 21) in the first quarter, including five of seven on 3-pointers and still trailed 42-37. . The Magic have given up an average of 113.2 during the seven-game losing streak. . Marreese Speights returned after missing two games for personal reasons. He did not play."}
{"game_id": "0021700914", "chunk_id": "0021700914_018", "order": 18, "role": "body", "text": "Raptors: Visit Washington on Friday."}
{"game_id": "0021700914", "chunk_id": "0021700914_019", "order": 19, "role": "closing", "text": "Magic:  Host former coach Stan Van Gundy and the Detroit Pistons on Friday."}
