{"game_id": "0021400435", "chunk_id": "0021400435_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Maybe putting all the focus on defense during practice after allowing 100 points for three straight games was just what Detroit needed to get its offense going."}
{"game_id": "0021400435", "chunk_id": "0021400435_002", "order": 2, "role": "body", "text": "Greg Monroe had 19 points and 15 rebounds, Andre Drummond scored 20 points and the Pistons ended a four-game skid with a 119-109 victory over the Indiana Pacers on Friday night."}
{"game_id": "0021400435", "chunk_id": "0021400435_003", "order": 3, "role": "body", "text": "\"What speaks to my coaching, better than anything, is we spent three days working on almost nothing but defense, give up 109 points, and our offense was fantastic,\" Stan Van Gundy said with a smile. \"That tells you how good my teaching was, right there.\""}
{"game_id": "0021400435", "chunk_id": "0021400435_004", "order": 4, "role": "body", "text": "Brandon Jennings scored 14 and Kentavious Caldwell-Pope added 15 for the Pistons."}
{"game_id": "0021400435", "chunk_id": "0021400435_005", "order": 5, "role": "body", "text": "Roy Hibbert paced Indiana with 19 points, but foul trouble sent him to the bench in the third quarter, and the Pistons took advantage. They outscored the Pacers 36-29 in the period to take an 11-point lead into the fourth."}
{"game_id": "0021400435", "chunk_id": "0021400435_006", "order": 6, "role": "body", "text": "Hibbert fouled out at 5:53 of the fourth quarter, putting a damper on Indiana's comeback bid. Solomon Hill and C.J. Watson both added 14 points in the losing effort."}
{"game_id": "0021400435", "chunk_id": "0021400435_007", "order": 7, "role": "body", "text": "\"I was a little tentative, and that ultimately bit me,\" Hibbert said. \"I could have done a better job.\""}
{"game_id": "0021400435", "chunk_id": "0021400435_008", "order": 8, "role": "body", "text": "The Pistons came out strong, netting 32 points in the first quarter and leading 57-53 at halftime -- the team's second-highest first-half output of the season. The Pistons also set a season high with 36 points in the third quarter."}
{"game_id": "0021400435", "chunk_id": "0021400435_009", "order": 9, "role": "body", "text": "\"I think the ball just moved,\" Monroe said. \"Guys were aggressive, but they were smart at the same time. We just took good shots.\""}
{"game_id": "0021400435", "chunk_id": "0021400435_010", "order": 10, "role": "body", "text": "The usually stalwart Indiana defense, which ranks No. 1 in the NBA in opponents' points per game (96.1), allowed the Pistons to shoot 54.7 percent from the field on the night, well above their season average of 41.3 percent (30th in the league)."}
{"game_id": "0021400435", "chunk_id": "0021400435_011", "order": 11, "role": "body", "text": "The Pistons hadn't shot better than 49.3 percent all year. They topped their best scoring output of the season 7:30 remaining."}
{"game_id": "0021400435", "chunk_id": "0021400435_012", "order": 12, "role": "body", "text": "\"It's definitely a sign of how we should play, but it's only one game,\" Jennings said."}
{"game_id": "0021400435", "chunk_id": "0021400435_013", "order": 13, "role": "body", "text": "Indiana shot 50.6 percent, but never could get the lead after Detroit tied it at 15 with 5:54 to go in the first quarter."}
{"game_id": "0021400435", "chunk_id": "0021400435_014", "order": 14, "role": "body", "text": "\"They're a good team,\" Hibbert said of the Pistons. \"They have a lot of pieces that have been there for a while. I didn't think it would take them long to get the chemistry going again.\""}
{"game_id": "0021400435", "chunk_id": "0021400435_016", "order": 16, "role": "body", "text": "Pistons: Picked up Anthony Tolliver from the Suns on Tuesday, but he wasn't available vs. the Pacers while waiting for a physical from the league. ... Three of Detroit's starters (Drummond, Kyle Singler and Caldwell-Pope) are in their first or second year in the NBA."}
{"game_id": "0021400435", "chunk_id": "0021400435_017", "order": 17, "role": "body", "text": "Pacers: Snapped a two-game winning streak after losing 11 of 12 from Nov. 29 to Dec 20. Indiana has not won more than two consecutive games all season. ... This was the first game between the two teams this season. They will play again in Indianapolis on Jan. 16 and Feb. 4 and in Detroit on April 10."}
{"game_id": "0021400435", "chunk_id": "0021400435_019", "order": 19, "role": "body", "text": "This was the Pistons' first game without Josh Smith, who was waived on Dec. 22 despite being in the middle of a four-year, $54 million contract."}
{"game_id": "0021400435", "chunk_id": "0021400435_020", "order": 20, "role": "body", "text": "Van Gundy dismissed any critics who may look at the Pistons' performance vs. the Pacers and blame Smith for the team's struggles."}
{"game_id": "0021400435", "chunk_id": "0021400435_021", "order": 21, "role": "body", "text": "\"We have won one game, and now we're going to jump on, `Josh Smith was the problem?\" Van Gundy said. \"I am not going there. I said that from the trade: That wasn't the problem. What happened tonight was we had a lot of guys play really well. It had absolutely nothing to do with Josh not being here.\""}
{"game_id": "0021400435", "chunk_id": "0021400435_023", "order": 23, "role": "body", "text": "After playing the first seven seasons of his career for the Pistons, Rodney Stuckey returned to Detroit for the first signing with the Pacers in the offseason. He was met with warm cheer from the Palace of Auburn Hills crowd and finished with nine points. He left the game with swelling above his eye."}
{"game_id": "0021400435", "chunk_id": "0021400435_024", "order": 24, "role": "body", "text": "\"He seems pretty relaxed about the situation,\" Frank Vogel said before the game. \"There are not a lot bad feelings, when you talk to him about his time here. He really enjoyed his time here.\""}
{"game_id": "0021400435", "chunk_id": "0021400435_026", "order": 26, "role": "body", "text": "Pistons: Travel to the Cavaliers on Sunday."}
{"game_id": "0021400435", "chunk_id": "0021400435_027", "order": 27, "role": "closing", "text": "Wizards: Travel to the Nets on Saturday."}
