{"game_id": "0021401033", "chunk_id": "0021401033_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  It isn't easy to win an NBA game after getting outscored 36-14 in the second quarter and trailing by 19 points in the third."}
{"game_id": "0021401033", "chunk_id": "0021401033_002", "order": 2, "role": "body", "text": "Doing that without the best player on the team and with two veterans playing out of position is nearly impossible."}
{"game_id": "0021401033", "chunk_id": "0021401033_003", "order": 3, "role": "body", "text": "Detroit not only did all that Saturday night, it won going away. The Pistons, using Joel Anthony and Tayshaun Prince at power forward, outscored Chicago 54-19 in the final 19 minutes of a 107-91 victory."}
{"game_id": "0021401033", "chunk_id": "0021401033_004", "order": 4, "role": "body", "text": "\"That was just a tremendous victory, and it only happened because we got contributions from so many players,\" coach Stan Van Gundy said. \"Everyone who played tonight played a big part in that win.\""}
{"game_id": "0021401033", "chunk_id": "0021401033_005", "order": 5, "role": "body", "text": "On paper, the stars of the comeback were point guards Reggie Jackson and Spencer Dinwiddie, who combined for 27 points and 13 assists in the second half. Jackson had 17 points and seven assists in the third, starting Detroit's comeback, and Dinwiddie finished it off with 10 points and six assists in the fourth."}
{"game_id": "0021401033", "chunk_id": "0021401033_006", "order": 6, "role": "body", "text": "\"My teammates made it easy for me,\" Jackson said. \"They did a great job on defense, we got some stops and I was able to get out in transition. All the big guys were setting screens and that let me attack downhill.\""}
{"game_id": "0021401033", "chunk_id": "0021401033_007", "order": 7, "role": "body", "text": "What made the rally possible, though, was the defensive effort by Anthony and Prince. With Greg Monroe (knee) and Shawne Williams (illness) unavailable and Anthony Tolliver in foul trouble, Van Gundy didn't have a power forward to put on the floor."}
{"game_id": "0021401033", "chunk_id": "0021401033_008", "order": 8, "role": "body", "text": "He started out with Anthony playing next to Andre Drummond -- a combination that was made up on the fly."}
{"game_id": "0021401033", "chunk_id": "0021401033_009", "order": 9, "role": "body", "text": "\"Those two have not only never played together before, they've never even practiced together,\" Van Gundy said. \"We just gave it a try and they made it work.\""}
{"game_id": "0021401033", "chunk_id": "0021401033_010", "order": 10, "role": "body", "text": "When Drummond needed a rest, Anthony moved back to center and Prince came in at power forward. That combination had been completely ineffective in the lopsided second quarter, but Prince had two steals and nine rebounds in the fourth."}
{"game_id": "0021401033", "chunk_id": "0021401033_011", "order": 11, "role": "body", "text": "\"Guys like Joel and Tayshaun have been around for a long time, and they know how to adjust when their teams need it,\" Kentavious Caldwell-Pope said. \"That was huge for us.\""}
{"game_id": "0021401033", "chunk_id": "0021401033_012", "order": 12, "role": "body", "text": "It also helped that Chicago's offense disappeared in the second half. Pau Gasol had 17 second-half points on 5-of-8 shooting, but his teammates managed only 18 while going 7 for 30."}
{"game_id": "0021401033", "chunk_id": "0021401033_013", "order": 13, "role": "body", "text": "\"That was just a lot of sloppy play down the stretch,\" Joakim Noah said. \"We were tired, and when you are tired, you have to play smart. We didn't do that. That's a game we should have had, and we let it slip away.\""}
{"game_id": "0021401033", "chunk_id": "0021401033_014", "order": 14, "role": "body", "text": "Gasol finished with 27 points and 10 rebounds. Aaron Brooks scored 15 of his 19 in the first half."}
{"game_id": "0021401033", "chunk_id": "0021401033_015", "order": 15, "role": "body", "text": "\"We were 19 with about six minutes left in the third, and they went on a run and we couldn't stop it,\" Chicago coach Tom Thibodeau said. \"The game isn't over if you start giving them easy scores and don't get back on defense. You have to keep playing, and we didn't.\""}
{"game_id": "0021401033", "chunk_id": "0021401033_016", "order": 16, "role": "body", "text": "The Pistons led 30-20 after the first quarter, but with Prince in his first stint at power forward, the Bulls went on a 26-6 run to start the second period. Detroit missed 13 of 15 shots during one stretch, even after bringing its starters back in."}
{"game_id": "0021401033", "chunk_id": "0021401033_017", "order": 17, "role": "body", "text": "The Bulls ended up outscoring the Pistons 36-14 in the quarter to take a 56-44 halftime lead. Chicago outshot Detroit 53.8 percent to 40.4 percent in the half, but things were vastly different in the final 19 minutes."}
{"game_id": "0021401033", "chunk_id": "0021401033_020", "order": 20, "role": "body", "text": "Bulls: Taj Gibson was a game-time decision due to a left ankle injury, but playing against the depleted Pistons frontcourt turned out to be a good move. Gibson scored eight points in his first 8 minutes, including three straight dunks to start Chicago's second-quarter surge."}
{"game_id": "0021401033", "chunk_id": "0021401033_021", "order": 21, "role": "body", "text": "Pistons: Drummond was presented with his World Cup championship ring by a Team USA representative in a pregame ceremony. In his first international experience, Drummond was the team's 12th man in Spain last summer, averaging 3.0 points and 2.5 rebounds in 5.7 minutes."}
{"game_id": "0021401033", "chunk_id": "0021401033_023", "order": 23, "role": "body", "text": "Bulls: Host the Hornets on Monday."}
{"game_id": "0021401033", "chunk_id": "0021401033_024", "order": 24, "role": "closing", "text": "Pistons: Visit the Celtics on Sunday."}
