{"game_id": "0021700424", "chunk_id": "0021700424_001", "order": 1, "role": "lead", "text": "TORONTO --  With Kyle Lowry one rebound from a triple-double, Raptors coach Dwane Casey gave his point guard two minutes of fourth-quarter court time to complete the feat."}
{"game_id": "0021700424", "chunk_id": "0021700424_002", "order": 2, "role": "body", "text": "In the end, Lowry got the job done in 98 seconds."}
{"game_id": "0021700424", "chunk_id": "0021700424_003", "order": 3, "role": "body", "text": "Lowry had his 11th career triple-double, DeMar DeRozan scored 31 points and Toronto won its ninth straight meeting with Brooklyn by routing the Nets 120-87 on Friday night."}
{"game_id": "0021700424", "chunk_id": "0021700424_004", "order": 4, "role": "body", "text": "Toronto led 91-64 through three quarters, but Lowry convinced his coach to let him keep playing a little longer."}
{"game_id": "0021700424", "chunk_id": "0021700424_005", "order": 5, "role": "body", "text": "\"If he hadn't gotten it in two minutes, he wasn't going to do it,\" Casey said. \"I don't want to do anything to mess with the game or try to disrespect Brooklyn.\""}
{"game_id": "0021700424", "chunk_id": "0021700424_006", "order": 6, "role": "body", "text": "Lowry grabbed the ball after Norman Powell's missed layup at 10:22 of the fourth, leading to a rousing celebration on Toronto's bench."}
{"game_id": "0021700424", "chunk_id": "0021700424_007", "order": 7, "role": "body", "text": "\"He really wanted it and I'm glad he got what he wanted,\" DeRozan said."}
{"game_id": "0021700424", "chunk_id": "0021700424_008", "order": 8, "role": "body", "text": "It was the second triple-double of the season for Lowry, who finished with 10 points, 10 rebounds and 12 assists. Lowry's previous triple-double came against the Los Angeles Lakers on Oct. 27."}
{"game_id": "0021700424", "chunk_id": "0021700424_009", "order": 9, "role": "body", "text": "\"As long as it comes with a win, that's all that matters,\" Lowry said."}
{"game_id": "0021700424", "chunk_id": "0021700424_010", "order": 10, "role": "body", "text": "Serge Ibaka scored 18 points and Jonas Valanciunas had 14 as Toronto won its eighth consecutive home game and improved its NBA-best home record to 10-1."}
{"game_id": "0021700424", "chunk_id": "0021700424_011", "order": 11, "role": "body", "text": "\"We want to make this a tough place to play,\" Casey said. \"We want people to talk about not wanting to come to Toronto and play.\""}
{"game_id": "0021700424", "chunk_id": "0021700424_012", "order": 12, "role": "body", "text": "Nik Stauskas scored 22 points in his Brooklyn debut and Isaiah Whitehead had 13 for the Nets in their most lopsided defeat of the season. Brooklyn's previous worst loss was a 107-86 blowout at New York on Oct. 27. The Nets lost by more than 14 points for the second time."}
{"game_id": "0021700424", "chunk_id": "0021700424_013", "order": 13, "role": "body", "text": "Toronto scored a season-high 74 points in the paint."}
{"game_id": "0021700424", "chunk_id": "0021700424_014", "order": 14, "role": "body", "text": "\"They were in the paint all night,\" Nets coach Kenny Atkinson said. \"It was drives and we didn't protect the rim at all.\""}
{"game_id": "0021700424", "chunk_id": "0021700424_015", "order": 15, "role": "body", "text": "Norman Powell and Jakob Poeltl each scored 11 points for the Raptors, who played without forward C.J. Miles (sore left shoulder)."}
{"game_id": "0021700424", "chunk_id": "0021700424_016", "order": 16, "role": "body", "text": "Nets guard Allen Crabbe (sore left knee) and forward DeMarre Carroll (rest) both got the night off. Brooklyn was playing the second game of a back-to-back, and its third in four days."}
{"game_id": "0021700424", "chunk_id": "0021700424_017", "order": 17, "role": "body", "text": "With Carroll and Crabbe unavailable, Brooklyn's recently acquired duo of Jahlil Okafor and Stauskas made their debuts. Both arrived in a Dec. 8 trade with Philadelphia."}
{"game_id": "0021700424", "chunk_id": "0021700424_018", "order": 18, "role": "body", "text": "Stauskas made five of his seven 3-point attempts, but the rest of the Nets shot 2 for 16 from long range."}
{"game_id": "0021700424", "chunk_id": "0021700424_019", "order": 19, "role": "body", "text": "Okafor had 10 points and four rebounds in 23 minutes on his 22nd birthday. He had played just 25 minutes all season before Friday."}
{"game_id": "0021700424", "chunk_id": "0021700424_020", "order": 20, "role": "body", "text": "\"I felt rusty, had some cobwebs on me, but just to be able to get out there, run up and down and play basketball, was great,\" Okafor said."}
{"game_id": "0021700424", "chunk_id": "0021700424_021", "order": 21, "role": "body", "text": "Stauskas scored 12 points on three 3-pointers and a three-point play as the Nets took a brief lead with a 14-0 run to begin the second, but Toronto closed the quarter with a 19-4 spurt to lead 58-44 at halftime."}
{"game_id": "0021700424", "chunk_id": "0021700424_022", "order": 22, "role": "body", "text": "\"That starting group came in and it went from two points to 16 real quick,\" Atkinson said. \"That was kind of lights out and then they dominated us from there.\""}
{"game_id": "0021700424", "chunk_id": "0021700424_024", "order": 24, "role": "body", "text": "Nets: Committed 24 turnovers, one shy of their season worst. Toronto scored 35 points off Brooklyn's miscues. ... Crabbe and Carroll are both expected to return for Sunday's game against Indiana."}
{"game_id": "0021700424", "chunk_id": "0021700424_025", "order": 25, "role": "body", "text": "Raptors: Lowry has nine of the 21 triple-doubles in Raptors history, more than any other player. ... G Delon Wright returned after missing the previous 12 games because of a dislocated right shoulder and scored seven points in 16 minutes."}
{"game_id": "0021700424", "chunk_id": "0021700424_027", "order": 27, "role": "body", "text": "Toronto has just three road games remaining against Western Conference opponents, all of them in the Central time zone. The Raptors visit Dallas on Dec. 26 and Oklahoma City on Dec. 27, then travel to Minnesota on Jan. 20. Toronto is 8-4 on the road against the West so far."}
{"game_id": "0021700424", "chunk_id": "0021700424_029", "order": 29, "role": "body", "text": "Nets: Host Indiana on Sunday. Brooklyn has lost four straight meetings with the Pacers."}
{"game_id": "0021700424", "chunk_id": "0021700424_030", "order": 30, "role": "body", "text": "Raptors: Host Sacramento on Sunday. Toronto snapped an eight-game losing streak in Sacramento by beating the Kings 102-87 last Sunday."}
{"game_id": "0021700424", "chunk_id": "0021700424_032", "order": 32, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
