{"game_id": "0021700933", "chunk_id": "0021700933_001", "order": 1, "role": "lead", "text": "PHOENIX --  The Phoenix Suns have been real pests against Oklahoma City the last couple of seasons, beating the Thunder three straight times."}
{"game_id": "0021700933", "chunk_id": "0021700933_002", "order": 2, "role": "body", "text": "Russell Westbrook made sure it didn't happen again."}
{"game_id": "0021700933", "chunk_id": "0021700933_003", "order": 3, "role": "body", "text": "The reigning MVP had 43 points, including the go-ahead 3-pointer with 56 seconds to play, and the Thunder scored the final 10 points of the game to escape with a 124-116 victory over the Suns on Friday night."}
{"game_id": "0021700933", "chunk_id": "0021700933_004", "order": 4, "role": "body", "text": "\"They always play us tough, especially here,\" Westbrook said. \"We stayed with it and made big plays down the stretch.\""}
{"game_id": "0021700933", "chunk_id": "0021700933_005", "order": 5, "role": "body", "text": "Paul George scored 20 points for Oklahoma City. Westbrook also had 14 rebounds and eight assists."}
{"game_id": "0021700933", "chunk_id": "0021700933_006", "order": 6, "role": "body", "text": "\"His passion, his energy that he brings every night is unbelievable,\" Phoenix guard Devin Booker said."}
{"game_id": "0021700933", "chunk_id": "0021700933_007", "order": 7, "role": "body", "text": "Booker scored 39 points, his career high for a home game. At 21 years, 123 days old, he became the third-youngest player in NBA history to reach 4,000 career points. Only LeBron James and Kevin Durant were younger."}
{"game_id": "0021700933", "chunk_id": "0021700933_008", "order": 8, "role": "body", "text": "Booker said he's grown to admire Westbrook more and more."}
{"game_id": "0021700933", "chunk_id": "0021700933_009", "order": 9, "role": "body", "text": "\"You know he's going to bring it every night and that's something our team should look at,\" Booker said, \"look for his passion for the game, how he cares about it and how he brings it every night, all 82 to 100 games, however many they play. He brings that energy. So I think us as a team know that and we try to go out and match that.\""}
{"game_id": "0021700933", "chunk_id": "0021700933_010", "order": 10, "role": "body", "text": "Josh Jackson and T.J. Warren scored 19 apiece for the Suns, who broke their 10-game losing streak at Memphis on Wednesday night. Elfrid Payton had 18 points, 10 rebounds and eight assists."}
{"game_id": "0021700933", "chunk_id": "0021700933_011", "order": 11, "role": "body", "text": "Booker's baseline 12-footer at the shot-clock buzzer put Phoenix up 115-114 with 2:37 to play and Alex Len hit one of two free throws to make it 116-114 with 1:40 to go."}
{"game_id": "0021700933", "chunk_id": "0021700933_012", "order": 12, "role": "body", "text": "Westbrook tied it on a driving layup with 1:32 left and made just his second 3 of the night to put the Thunder ahead for good, 119-116. He added two free throws and a breakaway dunk after that in his second-highest scoring game of the season."}
{"game_id": "0021700933", "chunk_id": "0021700933_013", "order": 13, "role": "body", "text": "\"We executed well, took good shots and obviously Russell took over,\" Thunder coach Billy Donovan said. \"He was terrific.\""}
{"game_id": "0021700933", "chunk_id": "0021700933_014", "order": 14, "role": "body", "text": "The Suns shot 56 percent and the Thunder 49 percent in an up-and-down first half that ended with Phoenix up 67-60."}
{"game_id": "0021700933", "chunk_id": "0021700933_015", "order": 15, "role": "body", "text": "Booker had 21 points, eight assists and four rebounds in the half. Westbrook countered with 19 points, seven rebounds and four assists. Jackson had 15 points in 10 minutes off the bench."}
{"game_id": "0021700933", "chunk_id": "0021700933_016", "order": 16, "role": "body", "text": "But the Suns wore down in the second half."}
{"game_id": "0021700933", "chunk_id": "0021700933_017", "order": 17, "role": "body", "text": "\"The first half our defense was not there. We gave up entirely too many points,\" Donovan said. \"We started out OK in the third. The second unit came in and did a really nice job closing out the third and the start of the fourth.\""}
{"game_id": "0021700933", "chunk_id": "0021700933_018", "order": 18, "role": "body", "text": "Booker scored Phoenix's first 11 points of the second half, the last nine on 3s, and the Suns led by 13 early in the third quarter. But then Westbrook led a 14-2 run, capped by his two free throws that cut the Phoenix lead to 92-91 with 3:18 to go in the period. Phoenix led 99-97 entering the fourth."}
{"game_id": "0021700933", "chunk_id": "0021700933_019", "order": 19, "role": "body", "text": "The Thunder opened the final quarter with a 10-2 run to lead 107-101 on Raymond Felton's 3. Booker's 14-footer at the shot-clock buzzer tied it at 110 with 4:48 remaining."}
{"game_id": "0021700933", "chunk_id": "0021700933_020", "order": 20, "role": "body", "text": "\"I think we probably fatigued a little bit,\" Phoenix interim coach Jay Triano said. \"I don't know if our guys are used to playing at that level for that long of a period of time, but that's what we'll get to.\""}
{"game_id": "0021700933", "chunk_id": "0021700933_022", "order": 22, "role": "body", "text": "Thunder: It was Westbrook's highest-scoring game since he had a season-best 46 points against Washington on Jan. 25. ... Oklahoma City won at Phoenix for the first time since Feb. 8, 2016. ... Carmelo Anthony was the fourth-youngest player to reach 4,000 career points."}
{"game_id": "0021700933", "chunk_id": "0021700933_023", "order": 23, "role": "body", "text": "Suns: Booker scored 15 consecutive Phoenix points -- four at the end of the first half, 11 to start the second. He has scored at least 30 in a career-best four straight games, the first Suns player to do so since Amar'e Stoudemire from Dec. 20-28, 2004. ... C Tyson Chandler (neck) missed his fifth straight game."}
{"game_id": "0021700933", "chunk_id": "0021700933_025", "order": 25, "role": "body", "text": "Thunder: At the Portland Trail Blazers on Saturday night."}
{"game_id": "0021700933", "chunk_id": "0021700933_026", "order": 26, "role": "body", "text": "Suns: At the Atlanta Hawks on Sunday."}
{"game_id": "0021700933", "chunk_id": "0021700933_028", "order": 28, "role": "closing", "text": "More AP NBA coverage: https://apnews.com/tag/NBAbasketball"}
