{"game_id": "0021700490", "chunk_id": "0021700490_001", "order": 1, "role": "lead", "text": "PHOENIX --  The scoring was balanced but there was no doubt who led the Minnesota Timberwolves over the Phoenix Suns."}
{"game_id": "0021700490", "chunk_id": "0021700490_002", "order": 2, "role": "body", "text": "\"Jimmy Butler was not going to let us lose that game,\" Timberwolves coach Tom Thibodeau said. \"You can't say enough about what he has done for this team. He has changed everything for us.\""}
{"game_id": "0021700490", "chunk_id": "0021700490_003", "order": 3, "role": "body", "text": "Butler scored 32 points to lead six Minnesota players in double figures and the Timberwolves never trailed in a 115-106 victory over the Suns on Saturday night."}
{"game_id": "0021700490", "chunk_id": "0021700490_004", "order": 4, "role": "body", "text": "\"I don't like to lose,\" Butler said. \"I feel like I am in a rhythm right now. I feel like whenever we guard as a team we share the ball, but whenever I need to shoot it I have to. I've got to be prepared to play and make plays for everybody, including myself.\""}
{"game_id": "0021700490", "chunk_id": "0021700490_005", "order": 5, "role": "body", "text": "Northwest Division-leading Minnesota has won three of four and six of eight and, at 20-13, is off to its best start after 33 games since opening 22-11 in 2003-04."}
{"game_id": "0021700490", "chunk_id": "0021700490_006", "order": 6, "role": "body", "text": "But the Suns have given the Timberwolves trouble this season, beating them twice, including just a week ago in Minnesota."}
{"game_id": "0021700490", "chunk_id": "0021700490_007", "order": 7, "role": "body", "text": "They eventually made this one interesting, too."}
{"game_id": "0021700490", "chunk_id": "0021700490_008", "order": 8, "role": "body", "text": "The Suns cut a 22-point deficit to two late in the third quarter, but the Timberwolves used a 12-0 run to end the third and the start the fourth and held Phoenix off from there."}
{"game_id": "0021700490", "chunk_id": "0021700490_009", "order": 9, "role": "body", "text": "Andrew Wiggins added 17 points and Karl-Anthony Towns had 16 points and 14 rebounds."}
{"game_id": "0021700490", "chunk_id": "0021700490_010", "order": 10, "role": "body", "text": "T.J. Warren scored 24 points for the Suns in their ninth and probably final game before Devin Booker returns from injury. Troy Daniels added 18 for the Suns, going 6 of 12 on 3-pointers. Isaiah Canaan had 15 points and nine assists off the bench for Phoenix in just his fifth game joining the team."}
{"game_id": "0021700490", "chunk_id": "0021700490_011", "order": 11, "role": "body", "text": "The Timberwolves, winners of four of five and six of their last eight, led by as many as 16 in the first quarter and 22 in the second. Minnesota was up 64-43 at the break."}
{"game_id": "0021700490", "chunk_id": "0021700490_012", "order": 12, "role": "body", "text": "The Suns, who had won three of four, opened the third quarter with a 22-6 outburst to cut the Minnesota lead to 70-65 on Warren's driving layup with 5:25 to play. The Timberwolves responded with a 9-2 run, Butler starting it with a three-point play and ending it with a dunk that had the Minnesota up 79-67 with 3:34 left."}
{"game_id": "0021700490", "chunk_id": "0021700490_013", "order": 13, "role": "body", "text": "Then came a flurry of 3s -- two by Daniels, one by Canaan -- and Dragan Bender's two free throws with 1:30 left sliced the Timberwolves' lead to 80-78. The teams traded baskets before Minnesota scored the final four of the quarter, Crawford's driving layup sending the Timberwolves into the final quarter leading 86-80."}
{"game_id": "0021700490", "chunk_id": "0021700490_014", "order": 14, "role": "body", "text": "Butler began the fourth with an 18-footer, Gorgui Dieng and Tyus Jones sank 3s and Minnesota led 94-80. The Suns never got closer than five again."}
{"game_id": "0021700490", "chunk_id": "0021700490_015", "order": 15, "role": "body", "text": "\"They didn't do anything strategic other than give it to their all-star players and say go one-on-one, and we're going to struggle with that for a little bit,\" Phoenix interim coach Jay Triano said. \"But I didn't think we put up a lot of fight. We addressed it at halftime and we played better in the second half, but we dug too big a whole.\""}
{"game_id": "0021700490", "chunk_id": "0021700490_017", "order": 17, "role": "body", "text": "Barring any setbacks, Phoenix scoring leader Booker is expected to return when the Suns are home against Memphis on Tuesday night. Booker has missed nine games with a left adductor sprain. He's averaging 24. 3 points per game and scored at least 30 in 10 of his last 20 games before he was hurt. Phoenix has gone 3-6 in his absence."}
{"game_id": "0021700490", "chunk_id": "0021700490_019", "order": 19, "role": "body", "text": "Timberwolves: Minnesota's 20-13 start is tied for third-best after 33 games in franchise history. Only 24-9 in 2001-02 and 22-11 in '03-04 were better. ... Butler's season high is 38 against Philadelphia on Dec. 12."}
{"game_id": "0021700490", "chunk_id": "0021700490_020", "order": 20, "role": "body", "text": "Suns: With Canaan taking his playing time, point guard Mike Smith was waived by Phoenix. ... Triano needs one more victory to reach 100 as an NBA head coach. ... Suns erased double-digit deficits to win three of their previous four games. ... Phoenix didn't make a field goal until game was 5:10 old.  .... Suns had their highest-scoring third quarter of the season (37) after scoring 43 in the first half."}
{"game_id": "0021700490", "chunk_id": "0021700490_022", "order": 22, "role": "body", "text": "Timberwolves: At Los Angeles Lakers on Christmas night."}
{"game_id": "0021700490", "chunk_id": "0021700490_023", "order": 23, "role": "body", "text": "Suns: Host Memphis on Tuesday night."}
{"game_id": "0021700490", "chunk_id": "0021700490_025", "order": 25, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
