{"game_id": "0021701183", "chunk_id": "0021701183_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  LeBron James pulled Ben Simmons in for a hug, and smiled and laughed in a brief chat with Joel Embiid."}
{"game_id": "0021701183", "chunk_id": "0021701183_002", "order": 2, "role": "body", "text": "Allen Iverson watched the scene with a big grin and high-fived a few fans."}
{"game_id": "0021701183", "chunk_id": "0021701183_003", "order": 3, "role": "body", "text": "The 76ers of the past and present sure loved LeBron -- but is that appreciation enough to make him a Sixer in the future?"}
{"game_id": "0021701183", "chunk_id": "0021701183_004", "order": 4, "role": "body", "text": "Simmons topped James in a triple-double battle to lead the 76ers to their 13th straight win in their biggest game in six years, 132-130 over the Cleveland Cavaliers on Friday night."}
{"game_id": "0021701183", "chunk_id": "0021701183_005", "order": 5, "role": "body", "text": "With a buzz in the city over the Sixers that hasn't been felt since the pre-Process days, they romped to a 30-point lead in the first half and scored 78 points at the break."}
{"game_id": "0021701183", "chunk_id": "0021701183_006", "order": 6, "role": "body", "text": "\"You get down 30 in the postseason, that can lose you a series,\" James said."}
{"game_id": "0021701183", "chunk_id": "0021701183_008", "order": 8, "role": "body", "text": "Simmons had 27 points, 15 rebounds and 13 assists and James, one of his mentors, had 44 points (17-of-29 shooting), 11 assists and 11 rebounds, bringing the Cavaliers to the brink of an epic comeback."}
{"game_id": "0021701183", "chunk_id": "0021701183_009", "order": 9, "role": "body", "text": "\"He's a student of the game. He wants to be great,\" James said."}
{"game_id": "0021701183", "chunk_id": "0021701183_010", "order": 10, "role": "body", "text": "The Sixers (49-30) moved into third place in the Eastern Conference over the Cavaliers (49-31)."}
{"game_id": "0021701183", "chunk_id": "0021701183_011", "order": 11, "role": "body", "text": "Perhaps the Cavs were fatigued from rallying from 17-points down to win Thursday against Washington. Whatever the reason, they were in a funk from the start -- James even missed a dunk."}
{"game_id": "0021701183", "chunk_id": "0021701183_012", "order": 12, "role": "body", "text": "James suddenly remembered in the second half he needed to audition his stuff for his potential summer suitor. He had a chance to tie the game when he was fouled on a 3-point attempt with 1.9 seconds left. He made the first, missed the second and his intentional miss on the third failed to go in on a Cavs tip at the horn."}
{"game_id": "0021701183", "chunk_id": "0021701183_013", "order": 13, "role": "body", "text": "He scored 21 points in the third and hit successive 3-pointers in the fourth that helped pull Cleveland to 111-109. James had a monster slam that kept it a three-point game only for JJ Redick to come down and bury a 3."}
{"game_id": "0021701183", "chunk_id": "0021701183_014", "order": 14, "role": "body", "text": "James started yapping at the refs, the crowd howled as he complained, and the arena felt like a Game 7."}
{"game_id": "0021701183", "chunk_id": "0021701183_016", "order": 16, "role": "body", "text": "Simmons kicked out to Redick for a 3 from the corner that brought Iverson out of his seat and pumping his fist in celebration."}
{"game_id": "0021701183", "chunk_id": "0021701183_017", "order": 17, "role": "body", "text": "The seeding takes on added importance with both teams chances at making a long postseason run increasing once Boston lost Kyrie Irving for the season."}
{"game_id": "0021701183", "chunk_id": "0021701183_018", "order": 18, "role": "body", "text": "\"They completely understand that it's now April and we're going to blink and be playing in the playoffs,\" 76ers coach Brett Brown said. \"You see them trending in a very competitive winning way.\""}
{"game_id": "0021701183", "chunk_id": "0021701183_019", "order": 19, "role": "body", "text": "The Sixers, who already clinched their first playoff berth since 2012, won for the fifth straight game without Embiid. The All-Star center was at the game for the first time since he suffered a concussion and needed surgery to repair a fractured orbital bone. There is no timetable for Embiid's return."}
{"game_id": "0021701183", "chunk_id": "0021701183_020", "order": 20, "role": "body", "text": "\"This was big, beating a team like that without an All-Star,\" Simmons said. \"I think everyone is coming together as a team. We are playing well.\""}
{"game_id": "0021701183", "chunk_id": "0021701183_021", "order": 21, "role": "body", "text": "An Embiid-James-Simmons trio is tantalizing in Philly."}
{"game_id": "0021701183", "chunk_id": "0021701183_022", "order": 22, "role": "body", "text": "James can opt out of his contract this summer -- he has a $35.6 option -- with Cleveland and become a free agent. With a glut of young talent and spacious room under the salary cap, Philadelphia has been frequently mentioned as a landing spot for James. Three billboards, paid for by a Pennsylvania company, popped up recently in Ohio urging James to sign with the 76ers this summer."}
{"game_id": "0021701183", "chunk_id": "0021701183_023", "order": 23, "role": "body", "text": "Sixers' Twitter even seemed divided on how to handle James -- boo him or woo him with kindness?"}
{"game_id": "0021701183", "chunk_id": "0021701183_024", "order": 24, "role": "body", "text": "It's Philly. Take a guess which reaction won."}
{"game_id": "0021701183", "chunk_id": "0021701183_025", "order": 25, "role": "body", "text": "James was booed each time he touched the ball and signs were spotted in the stands that read \"Keep Cryin' in Cleveland\" and \"We Don't Want You.\""}
{"game_id": "0021701183", "chunk_id": "0021701183_026", "order": 26, "role": "body", "text": "He brought the sellout crowd to their feet on his missed dunk."}
{"game_id": "0021701183", "chunk_id": "0021701183_027", "order": 27, "role": "body", "text": "The Sixers had them standing and roaring on almost every possession."}
{"game_id": "0021701183", "chunk_id": "0021701183_028", "order": 28, "role": "body", "text": "James certainly noticed the enthusiasm."}
{"game_id": "0021701183", "chunk_id": "0021701183_029", "order": 29, "role": "body", "text": "\"You add in Villanova, you add in the Eagles, obviously that helps as well,\" James said. \"It's always been kind of rowdy coming here.\""}
{"game_id": "0021701183", "chunk_id": "0021701183_030", "order": 30, "role": "body", "text": "The only way the Sixers could have possibly rubbed it in more in the first half was if Iverson left his courtside seat and stepped over Cavaliers coach Tyronn Lue just for old times' sake."}
{"game_id": "0021701183", "chunk_id": "0021701183_032", "order": 32, "role": "body", "text": "Cavaliers: G Rodney Hood left with a sore left Achilles' tendon. ... G Jose Calderon (left hamstring) did not play."}
{"game_id": "0021701183", "chunk_id": "0021701183_033", "order": 33, "role": "body", "text": "76ers: The 78 points were the most the Sixers had scored in any half since they had 80 on Feb. 11, 1992, vs. Miami."}
{"game_id": "0021701183", "chunk_id": "0021701183_035", "order": 35, "role": "body", "text": "Brown said he kept in touch with Embiid through FaceTime and remained optimistic the big man would be a factor in the playoffs."}
{"game_id": "0021701183", "chunk_id": "0021701183_036", "order": 36, "role": "body", "text": "\"I hope it's a good thing for him to stay with us, stay engaged, listen to his coach,\" Brown said. \"What I feel more than anything is there is a genuine excitement and belief that he will be back for us.\""}
{"game_id": "0021701183", "chunk_id": "0021701183_038", "order": 38, "role": "body", "text": "Lue said he felt good in his second game back following a medical absence that cost him nine games."}
{"game_id": "0021701183", "chunk_id": "0021701183_039", "order": 39, "role": "body", "text": "\"I got some good sleep, rested well,\" he said."}
{"game_id": "0021701183", "chunk_id": "0021701183_041", "order": 41, "role": "body", "text": "Cavaliers: Get a needed two days off before playing Monday at New York."}
{"game_id": "0021701183", "chunk_id": "0021701183_042", "order": 42, "role": "body", "text": "Sixers: Host Dallas on Sunday."}
{"game_id": "0021701183", "chunk_id": "0021701183_044", "order": 44, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
