{"game_id": "0021401107", "chunk_id": "0021401107_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- A playoff spot secured, next up for the Portland Trail Blazers is the Northwest Division title.\nThe Trail Blazers haven't won the division since 2008-09, when they shared it with the Denver Nuggets. Portland's last outright title came in the 1991-92 season.\n\"I'm not even sure the last time we even won a division title,\" All-Star guard Damian Lillard said. \"I'm sure it's been tough having OKC around. If any year there was a great opportunity, it's this year. We just need to keep playing, focus on ourselves, and everything will work out like it's supposed to.\"\nThe Blazers clinched a playoff berth Monday night with a 109-86 victory over the Phoenix Suns. The victory cut the Blazers' magic number for winning the division to two.\nLillard scored 19 points, and LaMarcus Aldridge added 17 points and seven rebounds. The Blazers rested all of their starters in the fourth quarter after building a 92-65 lead. Portland led by as many as 31 points.\nThe Suns have lost four straight, and while they are mathematically still in the playoff picture, the chances are dwindling. Phoenix plays six of its last eight games on the road.\nGerald Green and T.J. Warren came off the bench to score 13 points. Eric Bledsoe added 12 in the Suns' seventh loss by 20 or more points this season.\n\"We played hard but they're a good team,\" Bledsoe said. \"At the end of the day, that's why they're in the position they're in, trying to fight for a high seed.\"\nThe Blazers also clinched the season series against the Suns for the first time since the 2010-11 season, winning 3-1.\nPhoenix was without guard Brandon Knight, who tweaked his sprained left ankle in a 109-97 loss at home to Oklahoma City on Sunday night. Knight had just returned after missing eight games because of the injury.\nThe Suns were further hurt in the second half when center Alex Len left the game after a collision with Portland center Chris Kaman. The Suns said afterward that X-rays showed Len had a broken nose.\nPortland was coming off a 120-114 victory at home over Denver on Saturday.\nThe Suns jumped in front 15-8 early in the game, but Nicolas Batum's long jumper and 3-pointer pulled Portland ahead 21-17, and the Blazers led 31-22 after the first quarter.\nRobin Lopez's tip put the Blazers ahead 53-37, but Green punctuated the first half with a dunk for the Suns to close within 55-49.\nBatum hit a 3-pointer that capped a 17-4 run to open the second half and pushed Portland's lead to 72-53. The Blazers outscored the Suns 37-16 in the third quarter.\n\"We came out lackadaisical,\" Suns coach Jeff Hornacek said. \"No intensity, no real emotion. That's your chance. You come out in that third quarter and make it a little tough on them, then maybe the tide turns.\"\nBatum finished with 16 points, including four 3-pointers.\nFollowing the game, the reaction in Portland's locker room was muted. Lillard said Aldridge commented, \"I'm happy I'm going to the playoffs with y'all,\" but that was about it.\n\"I mean, it wasn't like it was earth-shattering,\" coach Terry Stotts said. \"Honestly, our goal is beyond just to make the playoffs. ... It's nice to clinch a spot, but we've still got a few games to go that are important to us.\"\nIt is Portland's 31st playoff appearance in franchise history. The Blazers (48-25) moved within a half-game of the Clippers (49-25) for the fourth-best record in the Western Conference and home-court advantage in the first round.\nTIP-INS\nSuns: The Suns are 8-27 when trailing after three quarters, including 5-17 on the road. ... Marcus and Markieff Morris each had 11 points.\nTrail Blazers: Portland improved to 30-7 at home. .... The Blazers signed D-League guard Tim Frazier for the rest of the season. Frazier, who plays for the Maine Red Claws, recently finished a pair of 10-day contracts with the Philadelphia 76ers, where he averaged 5.7 points, 3.2 rebounds, 7.2 assists in six games.\nANOTHER MILESTONE\nIt was Stotts' 250th career NBA win and 135th victory with Portland.\n\"I didn't even know it until someone texted me after the game,\" he said.\nUP NEXT\nSuns: Visit Golden State on Thursday.\nTrail Blazers: Host the Los Angeles Clippers on Wednesday."}
