{"game_id": "0021700939", "chunk_id": "0021700939_001", "order": 1, "role": "lead", "text": "HOUSTON --  The Houston Rockets know people understand how good they are on offense."}
{"game_id": "0021700939", "chunk_id": "0021700939_002", "order": 2, "role": "body", "text": "They hope games like this one showcase that they can play pretty good defense, too."}
{"game_id": "0021700939", "chunk_id": "0021700939_003", "order": 3, "role": "body", "text": "Eric Gordon scored 29 points off the bench, James Harden had 26 points and 10 assists, and the Rockets outlasted the Boston Celtics 123-120 on Saturday night to extend their winning streak to a season-high 15 games."}
{"game_id": "0021700939", "chunk_id": "0021700939_004", "order": 4, "role": "body", "text": "\"Defensively we are very equipped to get stops,\" Trevor Ariza said. \"So we have a lot in this locker room.\""}
{"game_id": "0021700939", "chunk_id": "0021700939_005", "order": 5, "role": "body", "text": "Houston trailed by six before using a 10-2 run, with the last five points coming from Ariza, to take a 117-115 lead with 1:16 remaining. Ariza made a 3-pointer before stealing the ball from Kyrie Irving and finishing with a basket on the other end to cap the run."}
{"game_id": "0021700939", "chunk_id": "0021700939_006", "order": 6, "role": "body", "text": "Al Horford missed shots on Boston's next two possessions before Chris Paul made two free throws with 15 seconds left to push the lead to four. Irving hit a layup seconds later, but Harden made one of two free throws with 7.4 seconds left to make it 120-117."}
{"game_id": "0021700939", "chunk_id": "0021700939_007", "order": 7, "role": "body", "text": "Irving and Paul hit two free throws each before Irving made one and purposely missed the second with 2.8 seconds left. Gordon made one of two free throws to make it 123-120 with 2.3 seconds remaining, and Marcus Smart's 3-point attempt bounced off the rim at the buzzer to give Houston the win."}
{"game_id": "0021700939", "chunk_id": "0021700939_008", "order": 8, "role": "body", "text": "\"Defense (is) what it boiled down to,\" Gordon said. \"In the first half it was a little too easy for them ... and the reason why we won was fourth-quarter defense.\""}
{"game_id": "0021700939", "chunk_id": "0021700939_009", "order": 9, "role": "body", "text": "Houston's winning streak ties the second-longest in franchise history, accomplished twice during Hakeem Olajuwon's tenure in the 1990s, and trails only a 22-game run the Rockets had in the 2007-08 season. It's their second long winning streak of the season after the NBA-leading Rockets won 14 in a row from Nov. 16 to Dec. 18."}
{"game_id": "0021700939", "chunk_id": "0021700939_010", "order": 10, "role": "body", "text": "Marcus Morris had 21 points off the bench for the Celtics, who had won four in a row since the All-Star break."}
{"game_id": "0021700939", "chunk_id": "0021700939_011", "order": 11, "role": "body", "text": "\"I just thought they maximized more possessions than we did,\" Boston coach Brad Stevens said. \"Those were two good teams playing and both teams deserve a lot of credit for how they played.\""}
{"game_id": "0021700939", "chunk_id": "0021700939_012", "order": 12, "role": "body", "text": "Paul, who sat out with an injury in the last matchup with the Celtics, added 15 points and Ariza had 21. Gordon tied a season high with seven 3s and has made 12 of 25 over the last two games after missing the previous four due to an injury and an illness."}
{"game_id": "0021700939", "chunk_id": "0021700939_013", "order": 13, "role": "body", "text": "\"Eric Gordon was huge,\" Houston coach Mike D'Antoni said. \"I think we forget how good he is defensively and (with) everything he does.\""}
{"game_id": "0021700939", "chunk_id": "0021700939_014", "order": 14, "role": "body", "text": "Boston took the first meeting this season by rallying from a 26-point deficit for a 99-98 win on Dec. 28."}
{"game_id": "0021700939", "chunk_id": "0021700939_015", "order": 15, "role": "body", "text": "The Celtics led by three entering the fourth and were up by the same margin early in the quarter before Houston used a 6-2 run to take a 96-95 lead with about 9 1/2 minutes left."}
{"game_id": "0021700939", "chunk_id": "0021700939_016", "order": 16, "role": "body", "text": "Morris got to work after that, hitting consecutive 3s to put the Celtics back on top. Gordon got hot for Houston, hitting two 3-pointers in less than 30 seconds to power a 6-2 run that got Houston to 103-102 with about eight minutes remaining."}
{"game_id": "0021700939", "chunk_id": "0021700939_017", "order": 17, "role": "body", "text": "But Morris scored five straight points after that to push Boston's lead to 108-102 and prompt D'Antoni to call a timeout with about 6 1/2 minutes left."}
{"game_id": "0021700939", "chunk_id": "0021700939_018", "order": 18, "role": "body", "text": "Houston scored five straight points, highlighted by a 3-pointer from P.J. Tucker, to cut the lead to three with about 8 1/2 minutes left in the third quarter. But the Celtics scored the next four points to make it 74-67."}
{"game_id": "0021700939", "chunk_id": "0021700939_019", "order": 19, "role": "body", "text": "Boston's offense went cold after that, and the Celtics didn't score for more than three minutes as Houston scored nine points in a row to take a 76-74 lead with less than five minutes remaining in the third."}
{"game_id": "0021700939", "chunk_id": "0021700939_020", "order": 20, "role": "body", "text": "Gordon and Ariza got things going during that stretch by hitting consecutive 3s."}
{"game_id": "0021700939", "chunk_id": "0021700939_021", "order": 21, "role": "body", "text": "The game was tied later in the third when the Celtics got a delay-of-game warning before Stevens received a technical foul. Harden made a free throw on the technical and Nene added a basket soon after that to put Houston up 84-81."}
{"game_id": "0021700939", "chunk_id": "0021700939_022", "order": 22, "role": "body", "text": "Boston used an 8-2 spurt, with four points each from Greg Monroe and Smart, to take an 89-86 lead into the fourth quarter."}
{"game_id": "0021700939", "chunk_id": "0021700939_024", "order": 24, "role": "body", "text": "Celtics: Irving finished with 18 points and six assists. ... Boston made 13 of 24 3-pointers. ... Terry Rozier had 17 points and Monroe had 18."}
{"game_id": "0021700939", "chunk_id": "0021700939_025", "order": 25, "role": "body", "text": "Rockets: Ryan Anderson missed his third straight game with a sore left hip. D'Antoni said he expects Anderson to return sometime next week. ... Paul received a technical for arguing a foul in the second quarter. ... Clint Capela had eight points and 17 rebounds."}
{"game_id": "0021700939", "chunk_id": "0021700939_027", "order": 27, "role": "body", "text": "The Rockets have scored 120 points or more in six of their last 12 games and improved to 46-1 when scoring at least 120 dating back to last season."}
{"game_id": "0021700939", "chunk_id": "0021700939_029", "order": 29, "role": "body", "text": "Harden on if Saturday's game felt like a playoff game: \"Yeah, every game from here on out is going to be a playoff game, playoff atmosphere, playoff intensity, physicality, everything. So, we're going to treat it like it is.\""}
{"game_id": "0021700939", "chunk_id": "0021700939_031", "order": 31, "role": "body", "text": "Celtics: Visit the Chicago Bulls on Monday."}
{"game_id": "0021700939", "chunk_id": "0021700939_032", "order": 32, "role": "body", "text": "Rockets: Begin a four-game road trip at Oklahoma City on Tuesday."}
{"game_id": "0021700939", "chunk_id": "0021700939_034", "order": 34, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
