{"game_id": "0021300939", "chunk_id": "0021300939_001", "order": 1, "role": "lead", "text": "HOUSTON -- Coach Kevin McHale said it first and then player after player echoed his sentiment: Early in the season Houston wouldn't have won the type of game they did Sunday night.\nJames Harden scored 41 points, Jeremy Lin had 26 and the Rockets rallied for a 118-113 overtime win against the Portland Trail Blazers.\n\"There's no way we win this game early on in the year,\" Chandler Parsons said. \"So I think that shows a lot about our growth and maturity and just how much we're coming together and how well we're playing right now.\"\nThe Trail Blazers led by 3 in overtime after two free throws by Wesley Matthews. Houston took over from there, using an 8-2 run with a 3 from Harden and four points from Lin to make it 116-113 with 35.4 seconds left. Lin added two free throws after that to help the Rockets secure their fifth straight win.\n\"We didn't have a lot of zip in us tonight ... but the guys just kept battling and kept fighting,\" McHale said. \"Sometimes you just have to go out there and gut your way through a win.\"\nHouston trailed by double digits in the fourth quarter before using a big spurt to close the gap. Portland regained the lead 106-103 before Harden hit a 3-pointer with seconds left in regulation to send it to overtime.\n\"The first three quarters we were basically just out there running around,\" Harden said. \"The last quarter we got more physical and created some opportunities for our defense.\"\nLaMarcus Aldridge led the Trail Blazers with 28 points and 12 rebounds, but managed just two points in OT. It's the second straight loss for Portland, following a 103-98 defeat at Dallas on Friday.\n\"There are a lot of angry faces because we should've had that game,\" Aldridge said. \"We've had two tough losses on the road and we definitely felt like we didn't do everything we could tonight, so of course guys are angry right now.\"\nDwight Howard added 17 points with 12 rebounds and Parsons had 16 points for Houston. Harden also had 10 rebounds, six assists and six steals.\nAfter the win, a couple of Rockets said they feel like they are as good as any team in the league right now. But Howard, who at 28 is one of the team's oldest players, cautioned against getting too confident.\n\"You just want to hold up that trophy come June,\" he said. \"You've just got to stay humble. That's the message. Stay humble and stay hungry and continue to do the small things to help us win games.\"\nDamian Lillard opened overtime with a 3-pointer for Portland, but picked up his sixth foul on a charge a few seconds later. A basket by Parsons cut the lead to 1 before Patrick Beverley fouled out, too, leaving both teams without their starting point guards.\nHarden knocked down a 3-pointer from the corner off the inbounds pass with 8 seconds left in the fourth and Matthews in his face to tie it. A turnover by Nicolas Batum gave Houston a chance to win it in regulation, but Beverley's jump shot clanged off the rim at the buzzer.\nMatthews had 26 points for Portland and Lillard 21.\nHouston trailed by 11 points with about eight minutes left in the fourth before going on a 12-3 run, powered by nine points from Harden, to get within 97-95 with about 3½ minutes left. The only thing that slowed Harden during that span was an offensive foul that erased one his buckets.\nLin got Houston within 1 on a layup with two minutes left in the fourth before a free throw by Robin Lopez. Lin gave Houston its first lead of the game -- 102-101 -- with a 3-pointer with 1:25 remaining.\nLillard's basket put Portland on top after that and Harden's turnover led to a pair of free throws by Matthews on the other end. Lin made one of two free throws to make it 105-103 before another free throw by Matthews.\nPortland was up by 12 points in the third quarter before a 5-1 spurt, with a 3-pointer by Matthews, extended the lead to 77-61. Houston got its offense going a little bit after that, scoring five straight points. But Aldridge made four quick points to push the lead up to 81-66.\nPortland got off to a quick start, building a 10-0 lead with five points from Lillard. Houston missed four shots and had two turnovers as the Trail Blazers built the lead.\nGame notes\nMcHale received a technical for arguing a foul call in the second quarter, and Williams and Hamilton also received technical fouls later in the second. ... Aldridge, who is from Dallas and played at the University of Texas, has scored at least 20 points in each of his last 12 regular-season trips to Houston."}
