{"game_id": "0021700194", "chunk_id": "0021700194_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  After being torched for 65 points in the first half, the Milwaukee Bucks turned up the defensive pressure against the Memphis Grizzlies."}
{"game_id": "0021700194", "chunk_id": "0021700194_002", "order": 2, "role": "body", "text": "Milwaukee held Memphis to 12 points in the third quarter to get back into the game and pulled away late in the fourth for a 110-103 victory."}
{"game_id": "0021700194", "chunk_id": "0021700194_003", "order": 3, "role": "body", "text": "\"In the first half, it was a shoot-around,\" Bucks coach Jason Kidd said. \"I thought in the second half we focused on the defensive end.\""}
{"game_id": "0021700194", "chunk_id": "0021700194_004", "order": 4, "role": "body", "text": "Giannis Antetokounmpo had 27 points and nine rebounds to lead the Bucks."}
{"game_id": "0021700194", "chunk_id": "0021700194_005", "order": 5, "role": "body", "text": "\"We want to be a defensive team,\" Antetokounmpo said. \"Sometimes we make mistakes and forget who we are.\""}
{"game_id": "0021700194", "chunk_id": "0021700194_006", "order": 6, "role": "body", "text": "Memphis coach David Fizdale said the Grizzlies lacked intensity in the third quarter."}
{"game_id": "0021700194", "chunk_id": "0021700194_007", "order": 7, "role": "body", "text": "\"We try to pride ourselves on our toughness and I didn't think we held up our end of the bargain tonight,\" Fizdale said. \"That third quarter, we just didn't come out ready to compete. That was the big difference in the game.\""}
{"game_id": "0021700194", "chunk_id": "0021700194_008", "order": 8, "role": "body", "text": "Khris Middleton and John Henson had 17 points apiece as Milwaukee won a season-high third straight. Henson made eight of 10 shots in his highest-scoring game this season."}
{"game_id": "0021700194", "chunk_id": "0021700194_009", "order": 9, "role": "body", "text": "Tyreke Evans scored 14 of his 27 points in the fourth quarter for Memphis, and Dillon Brooks added 19 points."}
{"game_id": "0021700194", "chunk_id": "0021700194_010", "order": 10, "role": "body", "text": "After the Bucks threatened to pull away late in the third, Evans scored nine consecutive points to pull Memphis into an 84-all tie early in the fourth quarter. Memphis pulled ahead on Dillon Brooks' 3-pointer with about nine minutes left. Milwaukee tied it on Tony Snell's corner 3. A soft drop-in by Antetokounmpo put the Bucks ahead 100-96 with just under five minutes remaining, a lead they wouldn't relinquish."}
{"game_id": "0021700194", "chunk_id": "0021700194_011", "order": 11, "role": "body", "text": "\"Normally that game gets away from us,\" Kidd said. \"When we came back with the starters, we went on a run, but it started on the defensive end.\""}
{"game_id": "0021700194", "chunk_id": "0021700194_012", "order": 12, "role": "body", "text": "The Bucks got off to a strong start, shooting 65 percent from the field in the first quarter, including 6 for 6 on 3-pointers, to take a 34-29 lead."}
{"game_id": "0021700194", "chunk_id": "0021700194_013", "order": 13, "role": "body", "text": "\"It was confidence boost to see shots go down,\" Middleton said."}
{"game_id": "0021700194", "chunk_id": "0021700194_014", "order": 14, "role": "body", "text": "Memphis hit 10 of its first 11 shots in the second quarter to take a 10-point lead with 4:24 left in the half. Milwaukee made just one of six shots from long-range in the quarter, but pulled to 65-60 at the break, led by Antetokounmpo's 12 points in the period."}
{"game_id": "0021700194", "chunk_id": "0021700194_016", "order": 16, "role": "body", "text": "Fizdale said he is taking a positive approach with point guard Mike Conley, who has struggled with his shooting this season. He made 2 of 12 shots against the Bucks after entering the game shooting 40 percent from the field and 31 percent from 3-point range."}
{"game_id": "0021700194", "chunk_id": "0021700194_017", "order": 17, "role": "body", "text": "\"Be positive. There's no beating the players up over struggles,\" Fizdale said. \"It's not the way to get them out of it, and it's never been my approach. Mike has had a nagging injury and can't control that.\""}
{"game_id": "0021700194", "chunk_id": "0021700194_019", "order": 19, "role": "body", "text": "Fizdale believes the Bucks improved considerably with the recent acquisition of Eric Bledsoe from the Phoenix Suns."}
{"game_id": "0021700194", "chunk_id": "0021700194_020", "order": 20, "role": "body", "text": "\"You add Eric Bledsoe to anybody's team and you are going to be way more concerned,\" Fizdale said. \"Obviously, there's the pace and the speed that he brings to the game. His tenacity, his toughness, his ability to get to the rim. They are going to be something to reckon with this year with him.\""}
{"game_id": "0021700194", "chunk_id": "0021700194_022", "order": 22, "role": "body", "text": "Grizzlies: Wrapped up a five-game trip with a 2/3 record. Chalmers fouled out with 2:19 remaining."}
{"game_id": "0021700194", "chunk_id": "0021700194_023", "order": 23, "role": "body", "text": "Bucks: Middleton, who entered the game shooting 26 percent from 3-point range, hit his first three attempts from beyond the arc. ... Bledsoe started but was a game-time decision with a knee contusion. \"He got hit. It was sore,\" Bucks coach Jason Kidd said. \"He was good yesterday. This morning he woke up and it was a little sore.\" ... F Mirza Teletovic missed his third straight game with left knee soreness."}
{"game_id": "0021700194", "chunk_id": "0021700194_025", "order": 25, "role": "body", "text": "Grizzlies: Host Indiana on Wednesday night in the first of four consecutive home games."}
{"game_id": "0021700194", "chunk_id": "0021700194_026", "order": 26, "role": "body", "text": "Bucks: Host Detroit on Wednesday night to wrap up a three-game homestand."}
{"game_id": "0021700194", "chunk_id": "0021700194_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
