{"game_id": "0021701193", "chunk_id": "0021701193_001", "order": 1, "role": "lead", "text": "CHICAGO --  Quincy Acy is often an emotional leader for the Brooklyn Nets."}
{"game_id": "0021701193", "chunk_id": "0021701193_002", "order": 2, "role": "body", "text": "On a record night against the Bulls, he led them on the scoresheet, too."}
{"game_id": "0021701193", "chunk_id": "0021701193_003", "order": 3, "role": "body", "text": "Acy helped the Nets set a franchise mark with 24 3-pointers in a 124-96 victory over the Chicago Bulls."}
{"game_id": "0021701193", "chunk_id": "0021701193_004", "order": 4, "role": "body", "text": "The Nets finished one 3-pointer shy of the NBA record set last season by Cleveland. Acy had career highs with six 3-pointers and 21 points, and Allen Crabbe added five from behind the arc and 20 points."}
{"game_id": "0021701193", "chunk_id": "0021701193_005", "order": 5, "role": "body", "text": "\"When we're hot, I feel like we can run with anybody in the gym,\" Acy said. \"And tonight, we got hot.\""}
{"game_id": "0021701193", "chunk_id": "0021701193_006", "order": 6, "role": "body", "text": "Acy's season has been hot and cold following offseason ankle surgery, but he looked plenty comfortable letting it fly Saturday. He took 13 of his 14 shots from deep."}
{"game_id": "0021701193", "chunk_id": "0021701193_007", "order": 7, "role": "body", "text": "\"He's our bench leader, a great guy,\" Nets coach Kenny Atkinson said. \"I think he hasn't been fully healthy and he's played through a lot.\""}
{"game_id": "0021701193", "chunk_id": "0021701193_008", "order": 8, "role": "body", "text": "Brooklyn got its fourth road win in its last five games. It was Brooklyn's second straight victory over the Bulls, something the Nets haven't done since February 2008. The win clinched the season series for the first time since 2009-10."}
{"game_id": "0021701193", "chunk_id": "0021701193_009", "order": 9, "role": "body", "text": "The Nets had a season-high 36 assists, led by nine from Spencer Dinwiddie and eight from Caris LeVert, both off the bench."}
{"game_id": "0021701193", "chunk_id": "0021701193_010", "order": 10, "role": "body", "text": "\"(The shooting) comes from our thrust at the rim and how we get there, and how we set the defense after that, and made good passes,\" Atkinson said."}
{"game_id": "0021701193", "chunk_id": "0021701193_011", "order": 11, "role": "body", "text": "Sean Kilpatrick led Chicago with 20 points, and Bobby Portis had 18 points and eight rebounds."}
{"game_id": "0021701193", "chunk_id": "0021701193_012", "order": 12, "role": "body", "text": "\"Tonight was obviously a debacle,\" Bulls coach Fred Hoiberg said. \"We were stuck in mud from the beginning of that game.\""}
{"game_id": "0021701193", "chunk_id": "0021701193_013", "order": 13, "role": "body", "text": "Portis scored 13 points in the first quarter to help erase an early 16-7 Nets lead."}
{"game_id": "0021701193", "chunk_id": "0021701193_014", "order": 14, "role": "body", "text": "In the second quarter, baskets by Rondae Hollis-Jefferson bookended a 14-1 run for the Nets which opened a 61-47 lead with 1:11 left until halftime."}
{"game_id": "0021701193", "chunk_id": "0021701193_015", "order": 15, "role": "body", "text": "Crabbe knocked down four of the Nets' nine 3-pointers in the third as Brooklyn pushed the lead past 20 points, cruising the rest of the way."}
{"game_id": "0021701193", "chunk_id": "0021701193_016", "order": 16, "role": "body", "text": "\"It's pretty tough, man,\" Portis said of defending Brooklyn. \"It's like playing the Rockets. They shoot a lot of 3s. They shoot a lot of contested shots. That's what their coach preaches.\""}
{"game_id": "0021701193", "chunk_id": "0021701193_017", "order": 17, "role": "body", "text": "Brooklyn made 19 3-pointers Thursday in a win against Milwaukee. Its previous season high was 21 in a Feb. 10 loss to New Orleans."}
{"game_id": "0021701193", "chunk_id": "0021701193_018", "order": 18, "role": "body", "text": "Joe Harris made four 3-pointers and scored 16 points for the Nets, who were 24 for 55 from deep."}
{"game_id": "0021701193", "chunk_id": "0021701193_020", "order": 20, "role": "body", "text": "Nets: F Dante Cunningham (back spasms) returned after missing Thursday's win against Milwaukee. ... F DeMarre Carroll (left hip) and C Jahlil Okafor (right ankle) were held out for the second straight game, although Atkinson said Okafor was available to play."}
{"game_id": "0021701193", "chunk_id": "0021701193_021", "order": 21, "role": "body", "text": "Bulls: Rookie F Lauri Markkanen was held out of the game as he has not been playing back-to-back games recently due to back and elbow injuries. Markkanen scored 20 points in 23 minutes in Friday's loss to Boston, his third consecutive game with at least 20 points, all of which were achieved in 25 minutes or less. ... F Noah Vonleh (calf strain) missed his second straight game and C Robin Lopez (rest) was held out of his third straight game."}
{"game_id": "0021701193", "chunk_id": "0021701193_023", "order": 23, "role": "body", "text": "The teams are both 27-53 with two games remaining and will meet again Monday in Brooklyn in another crucial game for draft positioning."}
{"game_id": "0021701193", "chunk_id": "0021701193_024", "order": 24, "role": "body", "text": "The Nets' first-round pick is owned by Cleveland after being moved via Boston in the Kyrie Irving trade last August."}
{"game_id": "0021701193", "chunk_id": "0021701193_026", "order": 26, "role": "body", "text": "Brooklyn's 24 3-pointers pushed them over 1,000 for the season, ending the game with a franchise record 1,012."}
{"game_id": "0021701193", "chunk_id": "0021701193_027", "order": 27, "role": "body", "text": "The previous season high was 877 last year."}
{"game_id": "0021701193", "chunk_id": "0021701193_028", "order": 28, "role": "body", "text": "The Nets trail only Houston for 3-pointers made league-wide. The Rockets entered Saturday with an NBA-record 1,213."}
{"game_id": "0021701193", "chunk_id": "0021701193_029", "order": 29, "role": "body", "text": "It was Brooklyn's 15th straight game with double-digit 3-pointers made, setting a franchise record."}
{"game_id": "0021701193", "chunk_id": "0021701193_031", "order": 31, "role": "body", "text": "The Loyola men's basketball team was honored at the game after their surprising recent Final Four run in the NCAA Tournament."}
{"game_id": "0021701193", "chunk_id": "0021701193_032", "order": 32, "role": "body", "text": "Former Ramblers star Milton Doyle, a Nets rookie from Chicago, proudly watch his team make the run as an 11-seed."}
{"game_id": "0021701193", "chunk_id": "0021701193_033", "order": 33, "role": "body", "text": "\"It was just like watching my family, enjoying all the success,\" Doyle said. \"It was great seeing everything that was going on and them getting all the praises and all the shout-outs from the big stars.\""}
{"game_id": "0021701193", "chunk_id": "0021701193_035", "order": 35, "role": "body", "text": "Kilpatrick had at least 20 points for the third straight game, matching the longest streak of his career. He has scored double digits in six of the seven games he has played for Chicago since signing on March 26."}
{"game_id": "0021701193", "chunk_id": "0021701193_037", "order": 37, "role": "body", "text": "Nets: The teams will meet again Monday in Brooklyn, then the Nets will close the season Wednesday in Boston."}
{"game_id": "0021701193", "chunk_id": "0021701193_038", "order": 38, "role": "body", "text": "Bulls: After Monday's rematch, the Bulls will close their season Wednesday against visiting Detroit."}
{"game_id": "0021701193", "chunk_id": "0021701193_040", "order": 40, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
