{"game_id": "0021400233", "chunk_id": "0021400233_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- The Marc and Mike show is sweeping the West.\nMarc Gasol had 26 points and nine assists, while Mike Conley added 21 points and 10 rebounds, and the Memphis Grizzlies held off the Trail Blazers 112-99 on Friday night to snap a nine-game Portland winning streak.\nConley fell one assist short of a triple double and the Grizzles remained unbeaten in 10 games against Western Conference foes. Memphis has lost just two of 16 games this season for the NBA's best overall record (14-2).\n\"We really know each other,\" Gasol said about Conley. \"We've pretty much seen any kind of defense you can throw at us, so we pretty much have counters for everything. Once we make a couple of jumpers you have to totally change your scheme and play us a different way.\"\nConley echoes the sentiment.\n\"Me and the big fella have known each other for a long time,\" he said. \"We know how each other love to play and he's so unselfish, he's fun to play with. I know where he wants the ball and he knows where I want the ball so we don't even have to speak to each other.\"\nWesley Matthews scored 26 points for the Blazers, who lost just their second game at home. LaMarcus Aldridge added 19 points and 10 rebounds.\n\"It's just one game. We can't let this set us back like it's the end of the world.\" Matthews said. \"The Beauty of the NBA? In 48 hours we've got another game.\"\nThe Grizzlies led by as many as 15 points. But Matthews nailed a 3-pointer to narrow it before Chris Kaman's layup cut the Grizzlies' lead to 89-85 with 7:26 to go.\nTony Allen's layup put Memphis up 94-85. He added a 3-pointer that extended the lead to 108-93 with 1:37 left to seal it.\nZach Randolph had 14 points and 13 rebounds for Memphis, which has won eight of its last nine games.\nPortland (12-4) jumped out to an early 18-6 lead, but the Grizzlies closed the gap and tied it 25-25 on Beno Udrih's pull-up jumper. Jon Leuer hit a 3-pointer that put Memphis ahead 41-37 midway tough the second. Randolph's layup and Conley's floater put Memphis in front 52-43 at the half.\nCourtney Lee's 3-pointer extended the Grizzlies' lead to 59-47 early in the third. But Matthews hit a 3-pointer that pulled the Blazers back within 65-58.\n\"This was one of those games where you can't dig out of that hole,\" said Damian Lillard, who had 20 points and nine assists for the Blazers.\nBoth teams got Thanksgiving off.\nThe Grizzlies were coming off a 99-93 victory over the Los Angeles Lakers on Wednesday night.\nPortland was back home after a brief three-game road trip capped by a 105-97 victory over Charlotte on Wednesday night.\nThe Grizzlies hit 50 percent of their 3-point shots, compared to just 29 percent for the Blazers.\n\"The biggest strength we have is our mental toughness as a group,\" Conley said. \"We have some ups and downs during games but we always find a way to win.\"\nTIP INS\nGrizzlies: The Sacramento Kings were denied their appeal of a last-second lost to the Memphis two weeks ago. The Kings had argued that Courtney Lee's game-winning shot that gave the Grizzlies a 111-110 victory actually came after time had expired. The league said in a statement Friday that Commissioner Adam Silver determined the officials' call was correct \"and not a misapplication of the playing rules.\"\nTrail Blazers: Blazers center Robin Lopez Tweeted to the Portland Police on Friday: \"Please dont pull me over for watchin the #StarWarsVII teaser on the way to shootaround @PortlandPolice ill bust some crooks heads i swear.\" The Police responded as only Yoda would: \"@rolopez42 Stop you we won't. Beat the @memgrizz, or do not. There is no try. #PORvsMEM.\"\nKAMAN'S BIG NIGHT\nBlazers center Chris Kaman had a season-best 16 points and 11 rebounds, for his second double-double of the season. Fans at the Moda Center gave him a standing ovation when he fouled out in the final quarter, recognizing the spark he brought off the bench. Kaman has led Portland's reserves in scoring in 13 of 16 games.\nSTAR SIGHTING:\nElizabeth Banks, who plays Effie Trinket in the Hunger Games movies, was at the game.\nZACH'S BACK\nRandolph played six seasons in Portland after he was selected with the 19th pick in the 2001 NBA draft. Friday night's game marked his 415th career double-double. He ranks sixth among active players.\nUP NEXT\nThe Grizzlies visit the Kings on Sunday\nThe Trail Blazers host the Timberwolves on Sunday."}
