{"game_id": "0021700202", "chunk_id": "0021700202_001", "order": 1, "role": "lead", "text": "HOUSTON --  The Toronto Raptors have struggled to close out games against good teams this season."}
{"game_id": "0021700202", "chunk_id": "0021700202_002", "order": 2, "role": "body", "text": "They solved that Tuesday night, getting 27 points from DeMar DeRozan while holding off the Rockets 129-113 despite a couple late runs by Houston."}
{"game_id": "0021700202", "chunk_id": "0021700202_003", "order": 3, "role": "body", "text": "Just as important, DeRozan thinks he knows the key for Toronto holding leads going forward."}
{"game_id": "0021700202", "chunk_id": "0021700202_004", "order": 4, "role": "body", "text": "\"Liking this feeling,\" he said. \"You've got to love this feeling so you don't got to go out there having too many of them close games that you lost, feeling upset, got to wait until the next game. You've got to want to continue to have this feeling and that should work out everything else.\""}
{"game_id": "0021700202", "chunk_id": "0021700202_005", "order": 5, "role": "body", "text": "Toronto led by 12 at halftime and had to repeatedly shut down rally attempts from the Rockets."}
{"game_id": "0021700202", "chunk_id": "0021700202_006", "order": 6, "role": "body", "text": "\"Consistency in this league is a hard thing to grab, and that's what we've got to reach for, grab for each and every night,\" Toronto coach Dwane Casey said. \"If we could bottle tonight, the energy, the toughness, the togetherness we had tonight, it (would be) special.\""}
{"game_id": "0021700202", "chunk_id": "0021700202_007", "order": 7, "role": "body", "text": "James Harden had 38 points and made 19 of 19 foul shots for the Rockets, who ended a six-game winning streak."}
{"game_id": "0021700202", "chunk_id": "0021700202_008", "order": 8, "role": "body", "text": "\"We weren't sharp,\" Houston coach Mike D'Antoni said. \"Sometimes you let down and it's hard to turn it back on. We tried, we got close in the second half, but we just didn't have enough.\""}
{"game_id": "0021700202", "chunk_id": "0021700202_009", "order": 9, "role": "body", "text": "Houston scored six straight points, including three free throws from Harden, to make it 108-103 with about 7 1/2 minutes left."}
{"game_id": "0021700202", "chunk_id": "0021700202_010", "order": 10, "role": "body", "text": "Delon Wright made a free throw for the Raptors soon after that, and OG Anunoby connected for Toronto's first field goal in more than three minutes on a 3-pointer with 6:25 remaining. After Wright's layup, Kyle Lowry stole the ball from Harden, and DeRozan finished on the other end with a dunk to make it 116-103."}
{"game_id": "0021700202", "chunk_id": "0021700202_011", "order": 11, "role": "body", "text": "Harden got Houston going again with a four-point play. The free throw was his 19th, setting a franchise record for most foul shots without a miss in a game."}
{"game_id": "0021700202", "chunk_id": "0021700202_012", "order": 12, "role": "body", "text": "DeRozan and Serge Ibaka had back-to-back dunks after Harden's big play to make it 120-107 with about three minutes left and send many of the home fans toward the exits."}
{"game_id": "0021700202", "chunk_id": "0021700202_013", "order": 13, "role": "body", "text": "Harden had 11 assists and six rebounds. He has scored at least 20 points and had seven or more assists in every game this season."}
{"game_id": "0021700202", "chunk_id": "0021700202_014", "order": 14, "role": "body", "text": "The Raptors scored the first five points of the second half to make it 81-64 and pushed their lead to 19 points midway through the third on Lowry's 3-pointer."}
{"game_id": "0021700202", "chunk_id": "0021700202_015", "order": 15, "role": "body", "text": "Toronto led by 21 before Houston made five straight points, capped by a 3-point play by Tarik Black. That was the start of a nice run for the Rockets, and they used a 9-3 spurt after that to cut the lead to 97-87. Harden made four points in that span, and Eric Gordon capped it with a layup."}
{"game_id": "0021700202", "chunk_id": "0021700202_016", "order": 16, "role": "body", "text": "Houston led by eight points during the first half, but the Raptors used a 45-point second quarter to take a 76-64 edge into halftime."}
{"game_id": "0021700202", "chunk_id": "0021700202_018", "order": 18, "role": "body", "text": "Raptors: Norman Powell sat out after leaving Sunday's game at Boston with a hip pointer. ...  Lowry, a former Rocket, added 19 points and 10 assists. ... Anunoby scored 16 points."}
{"game_id": "0021700202", "chunk_id": "0021700202_019", "order": 19, "role": "body", "text": "Rockets: Nene missed his second straight game with a sprained right foot. ... Harden received a technical after a shot in the first quarter when he complained about the lack of a foul call. ... Trevor Ariza finished with 20 points and eight rebounds. ... P.J. Tucker got two technical fouls and was ejected in the third quarter."}
{"game_id": "0021700202", "chunk_id": "0021700202_021", "order": 21, "role": "body", "text": "Raptors: Visit New Orleans on Wednesday night."}
{"game_id": "0021700202", "chunk_id": "0021700202_022", "order": 22, "role": "body", "text": "Rockets: Visit Phoenix on Thursday night."}
{"game_id": "0021700202", "chunk_id": "0021700202_024", "order": 24, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
