{"game_id": "0021700956", "chunk_id": "0021700956_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  When Damian Lillard starts knocking down shots, no deficit is insurmountable for the Portland Trail Blazers."}
{"game_id": "0021700956", "chunk_id": "0021700956_002", "order": 2, "role": "body", "text": "Down 11 to the Los Angeles Lakers with 5:26 remaining? No problem."}
{"game_id": "0021700956", "chunk_id": "0021700956_003", "order": 3, "role": "body", "text": "Lillard scored 19 of his 39 points in the fourth quarter and the Trail Blazers won their 15th consecutive game over the Lakers, 108-103 on Monday night."}
{"game_id": "0021700956", "chunk_id": "0021700956_004", "order": 4, "role": "body", "text": "\"Damian Lillard is special,\" Portland head coach Terry Stotts said. \"If it's not obvious, I'll say it.\""}
{"game_id": "0021700956", "chunk_id": "0021700956_005", "order": 5, "role": "body", "text": "Lillard scored 15 in a row for the Trail Blazers down the stretch, giving them a 104-103 lead with 1:08 remaining by hitting 1 of 2 free throws."}
{"game_id": "0021700956", "chunk_id": "0021700956_006", "order": 6, "role": "body", "text": "\"I've seen a lot of great basketball in my life, but today I was like wow. He made it look so easy, effortless,\" Shabazz Napier said. \"I just saw it in his eyes. He wanted the ball every single time, he wanted to take the shot. He definitely willed us today.\""}
{"game_id": "0021700956", "chunk_id": "0021700956_007", "order": 7, "role": "body", "text": "CJ McCollum had 22 points, and Jusuf Nurkic added 16 points and 16 rebounds. The Trail Blazers have won seven straight and nine of their last 10, climbing to third place in the Western Conference."}
{"game_id": "0021700956", "chunk_id": "0021700956_008", "order": 8, "role": "body", "text": "Julius Randle had 21 points and nine rebounds for the Lakers, who had their five-game winning streak ended. Kentavious Caldwell-Pope had 16 points, and Lonzo Ball had 10 points, two rebounds and two assists."}
{"game_id": "0021700956", "chunk_id": "0021700956_009", "order": 9, "role": "body", "text": "Isaiah Thomas had a chance to tie it in the closing seconds but was stripped by Napier, who then made two free throws. Thomas finished with 19 points."}
{"game_id": "0021700956", "chunk_id": "0021700956_010", "order": 10, "role": "body", "text": "The Lakers led 97-86 when Lillard took over. He knocked down four straight 3-pointers, including a step-back to tie the game at 97 with 3:37 remaining. He was 5 of 7 from the floor and 4 of 5 from 3-point range in the fourth quarter, and added a critical offensive rebound with 32.8 seconds remaining to extend a possession while up 106-103."}
{"game_id": "0021700956", "chunk_id": "0021700956_011", "order": 11, "role": "body", "text": "\"I figured we had to just get really aggressive, start attacking and try to make a run for it,\" Lillard said."}
{"game_id": "0021700956", "chunk_id": "0021700956_012", "order": 12, "role": "body", "text": "It was a dramatic reversal from the third quarter when Lillard had three points and was 1 of 6 from the field. Portland shot 21.7 percent in the third, making 5 of 23 shots, and Los Angeles led by as many as 12."}
{"game_id": "0021700956", "chunk_id": "0021700956_013", "order": 13, "role": "body", "text": "\"We tried to get a blitz on him, but a lot of times he was just attacking before the screen even got there,\" Lakers coach Luke Walton said. \"But our execution down the stretch on offense and defense, that was the frustrating part.\""}
{"game_id": "0021700956", "chunk_id": "0021700956_014", "order": 14, "role": "body", "text": "It was the second time in three games Lillard scored 19 in the fourth quarter, after engineering a 15-point comeback in a 106-104 win at Phoenix on Feb. 24."}
{"game_id": "0021700956", "chunk_id": "0021700956_016", "order": 16, "role": "body", "text": "Trail Blazers: Lillard was 12 of 25 for the game, including 6 of 11 from 3. He also had five rebounds and six assists. ... Portland has won eight straight road games against the Lakers."}
{"game_id": "0021700956", "chunk_id": "0021700956_017", "order": 17, "role": "body", "text": "Lakers: Los Angeles lost at home for the first time since Jan. 5, ending a nine-game winning streak at Staples Center. ... Six Lakers finished in double figures, including 14 points for Brook Lopez and 11 for Kyle Kuzma. ... F Brandon Ingram (groin strain) is out for one week."}
{"game_id": "0021700956", "chunk_id": "0021700956_019", "order": 19, "role": "body", "text": "Randle gashed the Trail Blazers with nine points in the third quarter but was contained by Al-Farouq Aminu in the fourth. Randle made his only shot and had one rebound, and Stotts said limiting his impact was critical to the rally."}
{"game_id": "0021700956", "chunk_id": "0021700956_020", "order": 20, "role": "body", "text": "\"Randle gave us a bunch of trouble,\" Stotts said. \"He had his way with us.\""}
{"game_id": "0021700956", "chunk_id": "0021700956_022", "order": 22, "role": "body", "text": "Trail Blazers: Host the New York Knicks on Tuesday."}
{"game_id": "0021700956", "chunk_id": "0021700956_023", "order": 23, "role": "body", "text": "Lakers: Host the Orlando Magic on Wednesday."}
{"game_id": "0021700956", "chunk_id": "0021700956_025", "order": 25, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
