{"game_id": "0021700522", "chunk_id": "0021700522_001", "order": 1, "role": "lead", "text": "TORONTO --  DeMar DeRozan washed away the sting of back-to-back road losses by leading the Toronto Raptors to another home victory."}
{"game_id": "0021700522", "chunk_id": "0021700522_002", "order": 2, "role": "body", "text": "DeRozan scored 25 points, Jonas Valanciunas had 13 points and 11 rebounds, and the Raptors beat the Atlanta Hawks 111-98 on Friday night for their 11th straight win at Air Canada Centre."}
{"game_id": "0021700522", "chunk_id": "0021700522_003", "order": 3, "role": "body", "text": "\"It's always great to bounce back after one loss, especially two in a row, to come back home, get back in our groove of things and get that feeling of winning back,\" DeRozan said."}
{"game_id": "0021700522", "chunk_id": "0021700522_004", "order": 4, "role": "body", "text": "Toronto is 13-1 at home this season, best in the NBA. The Raptors are one win away from matching the longest home winning streak in franchise history, set between Jan. 18 and Mar. 6, 2016."}
{"game_id": "0021700522", "chunk_id": "0021700522_005", "order": 5, "role": "body", "text": "\"It just means everything when we can be able to continue to do what we've been doing at home,\" DeRozan said. \"We've got to use that as our backbone.\""}
{"game_id": "0021700522", "chunk_id": "0021700522_006", "order": 6, "role": "body", "text": "Kyle Lowry scored 12 points, Delon Wright had 13 and Jakob Poeltl added 10 rebounds as Toronto finished December at 11-3, its best record ever in the month."}
{"game_id": "0021700522", "chunk_id": "0021700522_007", "order": 7, "role": "body", "text": "Toronto snapped a two-game skid despite the absence of forward Serge Ibaka, who the Raptors suspended for one game following an altercation with a team staff member after Wednesday's loss at Oklahoma City. The Raptors lost at Dallas on Tuesday."}
{"game_id": "0021700522", "chunk_id": "0021700522_008", "order": 8, "role": "body", "text": "Casey would not share details of the incident involving Ibaka but said the player and staffer had apologized to one another. Casey said the situation had been \"resolved.\""}
{"game_id": "0021700522", "chunk_id": "0021700522_009", "order": 9, "role": "body", "text": "\"It went over the limit and we've handled it,\" Casey said before the game."}
{"game_id": "0021700522", "chunk_id": "0021700522_010", "order": 10, "role": "body", "text": "The Raptors have lost consecutive games three times this season but have yet to lose three in a row."}
{"game_id": "0021700522", "chunk_id": "0021700522_011", "order": 11, "role": "body", "text": "\"That's what good teams do,\" Lowry said. \"You don't let a couple losses set you back from your long-term goal.\""}
{"game_id": "0021700522", "chunk_id": "0021700522_012", "order": 12, "role": "body", "text": "Hawks coach Mike Budenholzer said the Raptors looked hungry for a win."}
{"game_id": "0021700522", "chunk_id": "0021700522_013", "order": 13, "role": "body", "text": "\"I think they picked up their energy and their aggressiveness,\" Budenholzer said."}
{"game_id": "0021700522", "chunk_id": "0021700522_014", "order": 14, "role": "body", "text": "Taurean Prince had a career-high 30 points and 10 rebounds, but Atlanta's two-game winning streak ended. The Hawks posted consecutive victories for the first time this season by beating Dallas on Dec. 23 and Washington on Dec. 27."}
{"game_id": "0021700522", "chunk_id": "0021700522_015", "order": 15, "role": "body", "text": "\"You're always disappointed when you lose but I think we competed for most of the game,\" Atlanta guard Dennis Schroder said."}
{"game_id": "0021700522", "chunk_id": "0021700522_016", "order": 16, "role": "body", "text": "Schroder and Marco Belinelli each scored 14 points, and John Collins had 11."}
{"game_id": "0021700522", "chunk_id": "0021700522_017", "order": 17, "role": "body", "text": "Lowry scored the first five points in a 14-3 run to end the first quarter that gave the Raptors a 30-22 lead."}
{"game_id": "0021700522", "chunk_id": "0021700522_018", "order": 18, "role": "body", "text": "The Hawks made eight turnovers in the second quarter, allowing Toronto to widen its lead. OG Anunoby had a pair of dunks, one of them a reverse jam off a steal, giving the Raptors a 62-47 lead at halftime."}
{"game_id": "0021700522", "chunk_id": "0021700522_019", "order": 19, "role": "body", "text": "Prince scored 12 points in the third, but Toronto led 88-69 heading to the fourth."}
{"game_id": "0021700522", "chunk_id": "0021700522_021", "order": 21, "role": "body", "text": "Hawks: Prince matched a career high with five 3-pointers and extended his career-high streak of games with at least one 3-pointer to 17. ... Atlanta is 3-15 on the road, tied with Utah for worst in the league. Atlanta has lost six straight on the road since winning at Brooklyn on Dec. 2."}
{"game_id": "0021700522", "chunk_id": "0021700522_022", "order": 22, "role": "body", "text": "Raptors: CJ Miles made his second start of the season in Ibaka's place. ... This was the first of seven straight against Eastern Conference opponents. ... Toronto is 9-2 when DeRozan makes multiple 3-pointers."}
{"game_id": "0021700522", "chunk_id": "0021700522_024", "order": 24, "role": "body", "text": "Budenholzer and Casey exchanged words following the final buzzer after the Hawks coach took exception to Anunoby's steal and dunk with 17 seconds left in the fourth."}
{"game_id": "0021700522", "chunk_id": "0021700522_025", "order": 25, "role": "body", "text": "\"We weren't trying to run the score up,\" Casey said. \"I'm willing to stick up for my players every time.\""}
{"game_id": "0021700522", "chunk_id": "0021700522_027", "order": 27, "role": "body", "text": "Hawks: Conclude their ninth back-to-back of the season by hosting Portland on Saturday night."}
{"game_id": "0021700522", "chunk_id": "0021700522_028", "order": 28, "role": "body", "text": "Raptors: Host Milwaukee on Monday night. It's the first meeting of the season between the teams. Toronto eliminated the Bucks in the first round of the playoffs last season."}
{"game_id": "0021700522", "chunk_id": "0021700522_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
