{"game_id": "0021700598", "chunk_id": "0021700598_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  C.J. Williams took a shot coach Doc Rivers didn't want him to take, and Rivers could only laugh. Just as he's prone to do with these Clippers."}
{"game_id": "0021700598", "chunk_id": "0021700598_002", "order": 2, "role": "body", "text": "Williams hit a 3-pointer from the left wing with nine seconds left to lift Los Angeles over the Atlanta Hawks 108-107 on Monday night."}
{"game_id": "0021700598", "chunk_id": "0021700598_003", "order": 3, "role": "body", "text": "\"I've made that shot before. It was just a rhythm dribble to my left,\" Williams said. \"Once we got the offensive rebound, I felt the momentum and I felt the excitement of the moment, so I wanted to take the 3. I took that dribble and I shot it with confidence. As soon as I let it go I knew it was in.\""}
{"game_id": "0021700598", "chunk_id": "0021700598_004", "order": 4, "role": "body", "text": "Lou Williams led Los Angeles with 34 points but missed a late 3 that resulted in a long rebound by Wesley Johnson. He passed the ball out to C.J. Williams for a shot that snapped the Clippers' two-game skid."}
{"game_id": "0021700598", "chunk_id": "0021700598_005", "order": 5, "role": "body", "text": "\"The thing about Doc is he didn't necessarily want the 3, but he lets you play,\" C.J. Williams said. \"I was in rhythm. As soon as I took the dribble it felt good. I didn't want to take it all the way to the basket and take a chance of getting my shot blocked.\""}
{"game_id": "0021700598", "chunk_id": "0021700598_006", "order": 6, "role": "body", "text": "With his team down 107-105, Rivers wanted the Clippers to go for a two-point basket to tie it, only to be overruled by his rookie in the final seconds."}
{"game_id": "0021700598", "chunk_id": "0021700598_007", "order": 7, "role": "body", "text": "\"I was actually yelling, `We don't need a 3,\" Rivers said. \"But you could see he was comfortable and he wanted it."}
{"game_id": "0021700598", "chunk_id": "0021700598_008", "order": 8, "role": "body", "text": "\"I've said I love coaching this team,\" he added. \"They play hard. We laugh a lot. We have to with some of the things we do out there on the floor. We make some crazy mistakes at times. But with this group you've just got to laugh it off and move on to the next play.\""}
{"game_id": "0021700598", "chunk_id": "0021700598_009", "order": 9, "role": "body", "text": "Atlanta set up its defense to keep Lou Williams from taking the Clippers' last shot."}
{"game_id": "0021700598", "chunk_id": "0021700598_010", "order": 10, "role": "body", "text": "\"We didn't want him to make the last shot, but he was able to get one off,\" coach Mike Budenholzer said. \"Long rebound and Wesley Johnson comes up with it and kicks it to C.J. Williams, who makes a tough 3. That's just a bad break for us.\""}
{"game_id": "0021700598", "chunk_id": "0021700598_011", "order": 11, "role": "body", "text": "On the final possession, Atlanta got the ball to Kent Bazemore, who was guarded by Johnson. He forced Bazemore to pass across to Taurean Prince, who missed a 15-foot jumper with three seconds remaining."}
{"game_id": "0021700598", "chunk_id": "0021700598_012", "order": 12, "role": "body", "text": "\"Wes saved us with the switch,\" Rivers said. \"When Prince got the ball, he was shooting over Lou and I was dying over there.\""}
{"game_id": "0021700598", "chunk_id": "0021700598_013", "order": 13, "role": "body", "text": "DeAndre Jordan added 25 points and 18 rebounds as Los Angeles won despite blowing a 13-point lead in the third quarter. The Clippers played without leading scorer Blake Griffin, who suffered a concussion Saturday against Golden State."}
{"game_id": "0021700598", "chunk_id": "0021700598_014", "order": 14, "role": "body", "text": "Prince scored 20 points, Dennis Schroder added 18 and Kent Bazemore and Ersan Ilyasova had 13 apiece for Atlanta, which lost its fourth straight."}
{"game_id": "0021700598", "chunk_id": "0021700598_015", "order": 15, "role": "body", "text": "With the score tied at 105, Lou Williams missed a short shot and Bazemore made two free throws after being fouled in the lane with 23 seconds to play, putting Atlanta up 107-105."}
{"game_id": "0021700598", "chunk_id": "0021700598_016", "order": 16, "role": "body", "text": "After C.J. Williams hit a floater from the left baseline with 3:35 left, tying the score at 99, Bazemore followed up a layup with a 3-pointer to give Atlanta a 104-100 lead with 2:11 to play. After Lou Williams committed a turnover, Bazemore was fouled by Jordan and hit one of two free throws for a 105-99 advantage."}
{"game_id": "0021700598", "chunk_id": "0021700598_017", "order": 17, "role": "body", "text": "The Hawks then decided to foul Jordan on three consecutive possessions. He made five of six free throws to pull Los Angeles to 105-104 with 1:08 left."}
{"game_id": "0021700598", "chunk_id": "0021700598_018", "order": 18, "role": "body", "text": "The Clippers forced an Atlanta turnover on the ensuing inbounds play, and Juwan Evans made the first of two free throws. Johnson was called for basket interference as the second shot hung on the rim, giving Atlanta the ball with the score tied at 105."}
{"game_id": "0021700598", "chunk_id": "0021700598_019", "order": 19, "role": "body", "text": "\"They were just flying up and down the court, scoring in transition in the first half,\" Budenholzer said. \"Then we got our transition defense in a better place in the second half, and make them play in the half court. If you do that you at least give yourself a chance.\""}
{"game_id": "0021700598", "chunk_id": "0021700598_021", "order": 21, "role": "body", "text": "Griffin was inactive against the Hawks, but did ride an exercise bike during the Clippers' workout earlier in the day and continues to progress toward a return that Rivers expects to be at least three or four days away."}
{"game_id": "0021700598", "chunk_id": "0021700598_022", "order": 22, "role": "body", "text": "\"He's passed a couple of tests already,\" the coach said. \"The whole (concussion) protocol thing now, you have to go through the entire protocol. I think he has another couple of tests to pass, and we'll just have to wait.\""}
{"game_id": "0021700598", "chunk_id": "0021700598_024", "order": 24, "role": "body", "text": "Hawks: Prince was a game-time decision, as the Hawks wanted to see how he felt about his dislocated right ring finger after pregame warmups. Prince was injured in the first quarter against the Lakers the night before. ... Fifth-year center Duane Dedmon was on a minutes restriction in his first game after missing 19 with a left tibia stress reaction, Budenholzer said."}
{"game_id": "0021700598", "chunk_id": "0021700598_025", "order": 25, "role": "body", "text": "Clippers: Los Angeles played without four of its five opening-night starters (Griffin, Patrick Beverley, Danilo Gallinari and Milos Teodosic), and the first man off the bench in that game, Austin Rivers. Jordan was the only opening-night starter to play against the Hawks. ... Jordan, a career 43 percent free throw shooter, made 21 of his 25 free throws over the previous four games."}
{"game_id": "0021700598", "chunk_id": "0021700598_027", "order": 27, "role": "body", "text": "Hawks: At the Denver Nuggets on Wednesday night."}
{"game_id": "0021700598", "chunk_id": "0021700598_028", "order": 28, "role": "body", "text": "Clippers: At the Golden State Warriors on Wednesday night."}
{"game_id": "0021700598", "chunk_id": "0021700598_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
