{"game_id": "0021700515", "chunk_id": "0021700515_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  Tyreke Evans started his career by being voted the NBA's Rookie of the Year in 2010 after averaging 20.1 points for Sacramento."}
{"game_id": "0021700515", "chunk_id": "0021700515_002", "order": 2, "role": "body", "text": "The next six years were difficult. He battled knee problems and missed games, and his scoring average plummeted to 10.3 points per game last season."}
{"game_id": "0021700515", "chunk_id": "0021700515_003", "order": 3, "role": "body", "text": "But Evans is finding his game again with Memphis, which the Lakers could attest to after he scored 32 points Wednesday night to lead the Grizzlies to a 109-99 victory over Los Angeles."}
{"game_id": "0021700515", "chunk_id": "0021700515_004", "order": 4, "role": "body", "text": "\"He's really good,\" said Grizzlies interim coach J.B. Bickerstaff. \"He's been given an opportunity here that he hasn't been given in a while, probably not since his rookie year in Sacramento."}
{"game_id": "0021700515", "chunk_id": "0021700515_005", "order": 5, "role": "body", "text": "\"We're depending on him to do everything. We all know he has the ability to score but his playmaking is huge because it gives his teammates confidence.\""}
{"game_id": "0021700515", "chunk_id": "0021700515_006", "order": 6, "role": "body", "text": "Evans has taken over the starting point guard spot for the injured Mike Conley, and Wednesday he added seven assists and seven rebounds."}
{"game_id": "0021700515", "chunk_id": "0021700515_007", "order": 7, "role": "body", "text": "Jarell Martin added 20 points for the Grizzlies, who had lost four of five and were coming off their loss in Phoenix a night earlier on Tyson Chandler's dunk with 0.4 seconds left. Andrew Harrison scored 15 and Deyonta Davis had 14."}
{"game_id": "0021700515", "chunk_id": "0021700515_008", "order": 8, "role": "body", "text": "The Lakers, who were again playing without rookie point guard Lonzo Ball, lost their fourth straight."}
{"game_id": "0021700515", "chunk_id": "0021700515_009", "order": 9, "role": "body", "text": "Brandon Ingram scored 23 points, but the Lakers shot only 37.6 from the field and were just 21 of 33 from the free throw line."}
{"game_id": "0021700515", "chunk_id": "0021700515_010", "order": 10, "role": "body", "text": "\"I just didn't feel like we were making the extra pass consistently and Memphis did a really good job of being physical with us and they clogged up the paint,\" said Lakers coach Luke Walton."}
{"game_id": "0021700515", "chunk_id": "0021700515_011", "order": 11, "role": "body", "text": "The Grizzlies blocked nine shots. Marc Gasol had three alone with his 11 points, nine rebounds and five assists as Memphis bounced back from the loss in Phoenix."}
{"game_id": "0021700515", "chunk_id": "0021700515_012", "order": 12, "role": "body", "text": "\"It's just the way it is, you have no choice,\" Gasol said. \"You kind of lick your wounds and move on to the next game.\""}
{"game_id": "0021700515", "chunk_id": "0021700515_014", "order": 14, "role": "body", "text": "Grizzlies: F Chandler Parsons, who's been battling a sore back and hasn't been playing in back-to-back games, was held out of Wednesday's game in Phoenix but played against the Lakers. ... Bickerstaff said he wasn't concerned how his team would respond after losing to the Suns on the late lob: \"It's frustration, but this team is resilient. It's a tough group mentally.\""}
{"game_id": "0021700515", "chunk_id": "0021700515_015", "order": 15, "role": "body", "text": "Lakers: Ingram was cleared to play after missing the past two games with a right quad bruise and left quad tendinitis. With Ball missing his second consecutive game with a left shoulder sprain, Walton was grateful to get Ingram back. Said Walton: \"He's the best we have at putting pressure on the rim.\""}
{"game_id": "0021700515", "chunk_id": "0021700515_017", "order": 17, "role": "body", "text": "He has started in his last 15 games and now leads the Grizzlies with a 19.4 scoring average."}
{"game_id": "0021700515", "chunk_id": "0021700515_018", "order": 18, "role": "body", "text": "\"The coach tells me to be aggressive and it helps to look for your teammates, and that's what I was trying to do every chance I got,\" Evans said. \"I was going downhill, attacking and finding open guys.\""}
{"game_id": "0021700515", "chunk_id": "0021700515_020", "order": 20, "role": "body", "text": "Rookie Kyle Kuzma had been on an offensive roll. He scored 31 points on Christmas against the Timberwolves, connecting on 6 of 11 3-pointers."}
{"game_id": "0021700515", "chunk_id": "0021700515_021", "order": 21, "role": "body", "text": "But against the Grizzlies, he was just 4 of 24 from the field, going 1 of 11 from 3-point range."}
{"game_id": "0021700515", "chunk_id": "0021700515_022", "order": 22, "role": "body", "text": "\"He shot short some of the threes,\" Gasol said. \"Most of them were good looks for him, I guess. It happens. It's part of the NBA. You have better shooting nights, worse shooting nights, and you just have to be OK with the shots you've taken.\""}
{"game_id": "0021700515", "chunk_id": "0021700515_024", "order": 24, "role": "body", "text": "Grizzlies: Visit Golden State on Saturday."}
{"game_id": "0021700515", "chunk_id": "0021700515_025", "order": 25, "role": "body", "text": "Lakers: Return to Staples Center on Friday as the designated home team against the Clippers."}
{"game_id": "0021700515", "chunk_id": "0021700515_027", "order": 27, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
