{"game_id": "0021700915", "chunk_id": "0021700915_001", "order": 1, "role": "lead", "text": "ATLANTA --  The Atlanta Hawks, with little more on the line than their spot near the top of the next NBA draft, outhustled an Indiana team playing to improve its position in the playoffs."}
{"game_id": "0021700915", "chunk_id": "0021700915_002", "order": 2, "role": "body", "text": "For Pacers coach Nate McMillan, that's not acceptable."}
{"game_id": "0021700915", "chunk_id": "0021700915_003", "order": 3, "role": "body", "text": "Dennis Schroder scored seven of Atlanta's final eight points to finish with 14, and the Hawks held off a late Indiana comeback to beat the Pacers 107-102 on Wednesday night."}
{"game_id": "0021700915", "chunk_id": "0021700915_004", "order": 4, "role": "body", "text": "\"Once again, we got out-worked tonight,\" McMillan said, referring to what he said was a similarly discouraging effort in a loss at Dallas on Monday."}
{"game_id": "0021700915", "chunk_id": "0021700915_005", "order": 5, "role": "body", "text": "McMillan said the strong effort from the lowly Hawks should be a warning to his players about the competition they can expect in the final weeks of the regular season."}
{"game_id": "0021700915", "chunk_id": "0021700915_006", "order": 6, "role": "body", "text": "\"You are getting a taste of what it's going to be like going down the stretch,\" he said."}
{"game_id": "0021700915", "chunk_id": "0021700915_007", "order": 7, "role": "body", "text": "Schroder set the pace with his defensive leadership in the first half and his scoring in the final minutes."}
{"game_id": "0021700915", "chunk_id": "0021700915_008", "order": 8, "role": "body", "text": "\"I put the team on my back and it started with defense,\" Schroder said. \"I think that everybody sees that and everybody played with me. It was one of our best games defensively.\""}
{"game_id": "0021700915", "chunk_id": "0021700915_009", "order": 9, "role": "body", "text": "Schroder had five of Atlanta's 13 steals. The Hawks blocked 11 shots, including four by Dewayne Dedmon."}
{"game_id": "0021700915", "chunk_id": "0021700915_010", "order": 10, "role": "body", "text": "The Pacers committed 24 turnovers. Victor Oladipo said that was the key statistic."}
{"game_id": "0021700915", "chunk_id": "0021700915_011", "order": 11, "role": "body", "text": "\"Ain't no way around it,\" said Oladipo, who had 22 points."}
{"game_id": "0021700915", "chunk_id": "0021700915_012", "order": 12, "role": "body", "text": "Bojan Bogdanovic led Indiana with 26 points while making four 3-pointers in the final period. His third 3 of the period cut the Atlanta lead to 97-91. A follow shot by Domantas Sabonis, who had 14 points, pulled the Pacers to 101-99."}
{"game_id": "0021700915", "chunk_id": "0021700915_013", "order": 13, "role": "body", "text": "Schroder answered with a layup with 44 seconds remaining, and then added another driving layup following an Indiana turnover."}
{"game_id": "0021700915", "chunk_id": "0021700915_014", "order": 14, "role": "body", "text": "\"We wanted to be the aggressors but they came out harder than us,\" Sabonis said."}
{"game_id": "0021700915", "chunk_id": "0021700915_015", "order": 15, "role": "body", "text": "The Pacers began the night fifth in the Eastern Conference playoff standings."}
{"game_id": "0021700915", "chunk_id": "0021700915_016", "order": 16, "role": "body", "text": "John Collins had 16 points for the Hawks, who ended their four-game losing streak."}
{"game_id": "0021700915", "chunk_id": "0021700915_017", "order": 17, "role": "body", "text": "Taurean Prince had 15 points, all in the first half, and Dedmon also scored 15."}
{"game_id": "0021700915", "chunk_id": "0021700915_018", "order": 18, "role": "body", "text": "Atlanta led 55-50 at halftime before outscoring the Pacers 30-15 in the third quarter to extend the lead to 85-65. The Hawks scored the first 10 points of the second half."}
{"game_id": "0021700915", "chunk_id": "0021700915_019", "order": 19, "role": "body", "text": "Lance Stephenson, who had 18 points, and Sabonis made back-to-back 3-pointers to start the Pacers' comeback."}
{"game_id": "0021700915", "chunk_id": "0021700915_021", "order": 21, "role": "body", "text": "Pacers: Indiana will host Atlanta on March 9 to complete the four-game season series. ... The Pacers are 13-16 on the road. They finished 13-28 away from home last season. ... Indiana had a season-high 57 rebounds in a 116-93 home win over Atlanta on Friday, part of a streak of five straight games with at least 50 rebounds. This time, the Pacers were outrebounded 49-43."}
{"game_id": "0021700915", "chunk_id": "0021700915_022", "order": 22, "role": "body", "text": "Hawks: Isaiah Taylor had 13 points. ... G Malcolm Delaney (right knee strain) had four points in his return after missing two games. ... F DeAndre Bembry (abdominal strain) missed his second straight game."}
{"game_id": "0021700915", "chunk_id": "0021700915_024", "order": 24, "role": "body", "text": "Veteran forward Trevor Booker indicated on his Twitter account that he's headed to the Pacers -- even if the team is not yet ready to announce a deal. Booker was expected to sign with Indiana when he clears waivers after being released by the Philadelphia 76ers, who needed to clear a roster spot for former Hawks forward-center Ersan Ilyasova. Booker tweeted \"Indy, let's work!!!!\" on Wednesday afternoon."}
{"game_id": "0021700915", "chunk_id": "0021700915_026", "order": 26, "role": "body", "text": "After signing a 10-day contract earlier in the day, Hawks Jaylen Morris made his NBA debut with 4 minutes remaining in the first period and quickly scored his first NBA points on his follow-up of a miss by Miles Plumlee. Morris was averaging 12.6 points with the Hawks' G League Erie affiliate."}
{"game_id": "0021700915", "chunk_id": "0021700915_029", "order": 29, "role": "body", "text": "Hawks: Host Warriors on Friday"}
{"game_id": "0021700915", "chunk_id": "0021700915_031", "order": 31, "role": "closing", "text": "More AP NBA: apnews.com/tag/NBAbasketball"}
