{"game_id": "0021400316", "chunk_id": "0021400316_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Al Jefferson finally quit thinking about what he wanted to do with the ball on the court, and just started doing it."}
{"game_id": "0021400316", "chunk_id": "0021400316_002", "order": 2, "role": "body", "text": "That showed in the fourth quarter against the Boston Celtics, as Jefferson scored 11 of his game-high 23 points and the Charlotte Hornets held off a late rally for a 96-87 victory Wednesday night."}
{"game_id": "0021400316", "chunk_id": "0021400316_003", "order": 3, "role": "body", "text": "Kemba Walker added 18 points and Lance Stephenson 13 for Charlotte, which led by as many as 12 points in the third quarter and were up 87-79 with 8:05 left."}
{"game_id": "0021400316", "chunk_id": "0021400316_004", "order": 4, "role": "body", "text": "However, Boston -- led by Marcus Thornton's 13 fourth-quarter points -- pulled to 87-85 with 4:31 remaining. But Walker's three-point play and back-to-back baskets by Jefferson pushed the Hornets' lead back to 94-85 with 1:19 left."}
{"game_id": "0021400316", "chunk_id": "0021400316_005", "order": 5, "role": "body", "text": "\"We just had to get some stops,\" said Jefferson, who also had 14 rebounds as Charlotte posted back-to-back wins for the second time this season. \"We knew they could get hot fast. We just had to step up our defense."}
{"game_id": "0021400316", "chunk_id": "0021400316_006", "order": 6, "role": "body", "text": "\"This is two games in a row that we've been able to close it out. I was thinking too much in the first half. I just had to be myself and relax, and that's what I did in the second half.\""}
{"game_id": "0021400316", "chunk_id": "0021400316_007", "order": 7, "role": "body", "text": "Rajon Rondo had a triple-double with 12 points, 10 rebounds and 10 assists for the Celtics. Jeff Green and Thornton led Boston with 16 points each, Tyler Zeller scored 13 and Brandon Bass 10."}
{"game_id": "0021400316", "chunk_id": "0021400316_008", "order": 8, "role": "body", "text": "\"We made a little bit of a run at the start of the fourth (quarter), but we couldn't quite get over the hump,\" Celtics coach Brad Stevens said. \"We missed some opportunities, and they just played better than us.\""}
{"game_id": "0021400316", "chunk_id": "0021400316_009", "order": 9, "role": "body", "text": "The Hornets trailed by five points entering the third quarter, but opened the period with an 11-4 run. Gerald Henderson hit a jumper to tie the score at 49-49 with 8:37 left, and his 3-pointer with 7:37 left put Charlotte ahead to stay at 54-51."}
{"game_id": "0021400316", "chunk_id": "0021400316_010", "order": 10, "role": "body", "text": "The Hornets took their biggest lead of the game late in the third quarter, with Walker's jumper with 1:38 remaining capping a 17-8 run for a 71-59 advantage."}
{"game_id": "0021400316", "chunk_id": "0021400316_011", "order": 11, "role": "body", "text": "The Celtics had mounted a similar rally in the first half, coming back from an eight-point deficit early in the second quarter to lead 45-40 at the break."}
{"game_id": "0021400316", "chunk_id": "0021400316_012", "order": 12, "role": "body", "text": "The Hornets were ahead 26-18 on Gary Neal's jumper with 11:02 left in the second quarter, but Boston went on a 20-6 run over the next 8 minutes. Rondo's jumper with 4:29 remaining gave the Celtics their biggest lead of the half, 38-32."}
{"game_id": "0021400316", "chunk_id": "0021400316_014", "order": 14, "role": "body", "text": "Celtics: Boston shot 21.7 percent from 3-point range, making just 5 of 23 attempts. However, that wasn't a season low for the Celtics -- they made just 1 of 25 against Houston (4.0 percent) on Nov. 1."}
{"game_id": "0021400316", "chunk_id": "0021400316_015", "order": 15, "role": "body", "text": "Hornets: Forward Michael Kidd-Gilchrist, who had missed the last 12 games with a stress reaction in his right foot, finished with nine points and six rebounds in 18 minutes Wednesday."}
{"game_id": "0021400316", "chunk_id": "0021400316_017", "order": 17, "role": "body", "text": "While the Celtics actually made more field goals Wednesday (38 of 87, compared to Charlotte's 35 of 84), the Hornets enjoyed a decisive advantage at the free-throw line -- 23 of 29, while Boston made just 6 of 10. The Celtics also turned the ball over 15 times, leading to 14 Hornets points."}
{"game_id": "0021400316", "chunk_id": "0021400316_019", "order": 19, "role": "body", "text": "\"I think you could tell when you walked into the locker room that guys are happy. I think they know that the way they played tonight was a byproduct of how they've practiced. You know, after 20 games, there's a lot of groups that don't want to practice three times. They just want to play the games. But our guys were good. They had good practices, and hopefully that'll set a tone for this next stretch of games.\" -- Hornets coach Steve Clifford."}
{"game_id": "0021400316", "chunk_id": "0021400316_021", "order": 21, "role": "body", "text": "Rookie guard P.J. Hairston didn't dress out for Wednesday's game after taking what Clifford said was \"an unexcused absence\" from Tuesday's practice. Clifford said Hairston, the 26th overall pick in the 2014 NBA Draft, would suit up for Friday's game against the Memphis Grizzlies."}
{"game_id": "0021400316", "chunk_id": "0021400316_023", "order": 23, "role": "body", "text": "Celtics: Host New York on Friday."}
{"game_id": "0021400316", "chunk_id": "0021400316_024", "order": 24, "role": "closing", "text": "Hornets: At Memphis on Friday."}
