{"game_id": "0021700298", "chunk_id": "0021700298_001", "order": 1, "role": "lead", "text": "CLEVELAND -- LeBron James lost his cool. Kevin Love and Cavaliers stayed just as hot.\nIncensed at not getting a foul called on a drive to the basket, James was ejected for the first time in his illustrious career on Tuesday night, tossed in the third quarter of Cleveland's 108-97 win over the Miami Heat.\nLove scored 32 of his 38 points in the first half and James added 21 as the Cavaliers extended their winning streak to nine.\nWith the Cavs leading by 23, James, who had attempted just one free throw at that point, drove the length of the floor and drew contact from Miami's James Johnson and Dion Waiters. When he didn't hear a whistle, James screamed and gestured toward referee Kane Fitzgerald, who quickly called a technical and pointed for the three-time champion to leave the floor.\nIt was the first time James had been thrown out in 1,082 career NBA games, and he said it was a first since he started playing basketball as a boy in Akron.\n\"On that particular play I got fouled all the way up the court, from the time that I stripped him (Johnson) all the way until I got to the rim, and so that's what it's about,\" James said. \"I said what I had to say and I moved on, but he (Fitzgerald) thought that I should get two of them, so it is ... we got the win and that's most important.\"\nJames has long complained about not getting calls near the basket, and hinted that his eruption may have been caused by pent-up frustration.\n\"I'm one of the league leaders in points in the paint,\" he said. \"I drive just as much as anybody. At this point, it's almost like they're trying to turn me into a jump shooter. I can't be a jump shooter. I'm not a jump shooter. I watch games every single night and I see jump shooters going to the line multiple, double-digit times every night.\n\"I'm not a jump shooter and I get fouled just as much as everybody else, so it's going to the line one time, three times or four times, that's not what it's about.\"\nFitzgerald said he couldn't let James' actions go unpunished.\n\"It was a culmination of a couple different acts,\" he told a pool reporter. \"Immediately after the no-call, he turned and threw an air punch directly at me and then he aggressively charged at me and then he used vulgarity in my ear a few times.\"\nLove had his way with every defender Miami put on him, finishing 10 of 16 from the field and 14 of 17 on free throws. He scored 22 in the first quarter and the Cavs opened a 27-point lead before halftime.\nDwyane Wade added 17 points for Cleveland, which has shaken off a slow start and is again playing like the team to beat in the Eastern Conference.\nWade said he has seen James that mad before.\n\"I just ain't never seen him get ejected,\" Wade said. \"But I've definitely seen him that mad before. He only got one ejection -- 15 years, that's pretty good.\"\nWaiters scored 21 and Bam Adebayo had 19 for the Heat, who had won three in a row. Goran Dragic finished with just seven points -- 12 below his team-leading scoring average.\nThe Heat closed to 93-76 early in the fourth, but Wade scored six straight points and fed Kyle Korver for a 3-pointer to give Cleveland a 102-79 lead.\n\"Felt that I needed to do something to help this team keep our lead,\" Wade said. \"Just got in an aggressive mindset, got a couple shots to fall and had a nice assist to Kyle for a long three-ball.\"\nWHOLE LOTTA LOVE\nAt the end of the first quarter, Miami had 24 points to Love's 22 and there didn't seem to be anything Heat coach Erik Spoelstra could do to stop Cleveland's All-Star center. Love was able to pull Heat shot-swatter Hassan Whiteside away from the basket, and he was too physical for Kelly Olynyk, who went to the bench with early foul trouble.\n\"I just like that he was aggressive,\" Cavs coach Tyronn Lue said. \"When they put smalls on him he posted up and got to the free-throw line. When he had 5s on him he was able to stretch out and make shots on the perimeter. All around big game to have 38 points and nine rebounds in 25 minutes. It's huge.\"\nBASKETBALL BROTHERS\nFollowing the game, Wade swapped jerseys with Udonis Haslem, his long-time Miami teammate.\n\"I get a lot of credit for all the things I did in Miami, but No. 40 was right next to me along the way,\" Wade said. \"He talked me off the ledge a lot of times. I talked him off the ledge a lot. We're brothers away from the game of basketball and he was one of the first men that I told I love him.\"\nTIP-INS\nHeat: Trailed by 34 in the first half. ... Spoelstra isn't surprised that Wade has embraced his role coming off the bench for Cleveland. \"Any role that has to do with winning suits him,\" Spoelstra said. \"That's what he's been about his whole career.\"\nCavaliers: Cleveland has made at least 10 3-pointers in 10 straight games. ... Lue said the next step for G Isaiah Thomas in his comeback from a serious hip injury is to play 2-on-2 and 3-on-3. That hasn't happened yet, and Lue does not know if Thomas will make his debut earlier than the team's original projection of the end of December. ... G Iman Shumpert was not available after playing seven minutes in Monday's win at Philadelphia. Shumpert has been sidelined with a swollen left knee.\nUP NEXT\nHeat: Finish four-game trip on Wednesday in New York.\nCavaliers: At Atlanta on Thursday."}
