{"game_id": "0021700153", "chunk_id": "0021700153_001", "order": 1, "role": "lead", "text": "TORONTO --  Bobby Portis gave the Chicago Bulls a boost in his first game back from suspension. Just not enough to top DeMar DeRozan and the Toronto Raptors."}
{"game_id": "0021700153", "chunk_id": "0021700153_002", "order": 2, "role": "body", "text": "DeRozan scored 24 points, Jonas Valanciunas had 21 points and 10 rebounds, and the Raptors beat Chicago 119-114 on Tuesday night for their first three-game winning streak over the Bulls since 2009."}
{"game_id": "0021700153", "chunk_id": "0021700153_003", "order": 3, "role": "body", "text": "Portis had 21 points and 13 rebounds in his return after sitting out Chicago's first eight games."}
{"game_id": "0021700153", "chunk_id": "0021700153_004", "order": 4, "role": "body", "text": "\"Bobby gave us a great lift out there,\" coach Fred Hoiberg said. \"He played with great emotion. He went out there and gave us energy when we needed it.\""}
{"game_id": "0021700153", "chunk_id": "0021700153_005", "order": 5, "role": "body", "text": "The Bulls suspended Portis after he punched teammate Nikola Mirotic during a preseason practice. Mirotic, who suffered facial fractures and a concussion, is expected to miss four to six weeks."}
{"game_id": "0021700153", "chunk_id": "0021700153_006", "order": 6, "role": "body", "text": "\"I got my dream taken away from me for three weeks,\" Portis said. \"I don't want my dream taken away from me anymore.\""}
{"game_id": "0021700153", "chunk_id": "0021700153_007", "order": 7, "role": "body", "text": "DeRozan called Portis \"a solid player\" after watching the third-year forward make 8 of 13 field goal attempts."}
{"game_id": "0021700153", "chunk_id": "0021700153_008", "order": 8, "role": "body", "text": "\"He's got a great touch on his jump shot,\" DeRozan said. \"He came out and played well for them tonight.\""}
{"game_id": "0021700153", "chunk_id": "0021700153_009", "order": 9, "role": "body", "text": "Before the game, Portis said Mirotic did not reply to his phone and text messages following the incident, adding that the two have not yet spoken."}
{"game_id": "0021700153", "chunk_id": "0021700153_010", "order": 10, "role": "body", "text": "Kyle Lowry scored 17 points and Serge Ibaka had 16 for the Raptors, who had lost 11 straight meetings with the Bulls before the current streak began with an overtime victory on March 21. Toronto beat Chicago 117-100 on Oct. 19, the opening game of the season for both teams."}
{"game_id": "0021700153", "chunk_id": "0021700153_011", "order": 11, "role": "body", "text": "Robin Lopez scored 20 points and Justin Holiday had 15 as Chicago lost for the fourth time in five games."}
{"game_id": "0021700153", "chunk_id": "0021700153_012", "order": 12, "role": "body", "text": "Toronto led by as many as 23 but Chicago cut the deficit to 115-112 following a hook shot by Portis with 41 seconds left. DeRozan answered with a turnaround jump shot with 20 seconds left, leading to a Bulls timeout."}
{"game_id": "0021700153", "chunk_id": "0021700153_013", "order": 13, "role": "body", "text": "\"They kept playing and we let up a little bit,\" DeRozan said."}
{"game_id": "0021700153", "chunk_id": "0021700153_015", "order": 15, "role": "body", "text": "Bulls: Hoiberg said Mirotic is responding well to having his activity level increased daily, but has yet to resume running. ... Chicago had held its three previous opponents below 100 points. ... The Bulls are 1-4 on the road."}
{"game_id": "0021700153", "chunk_id": "0021700153_016", "order": 16, "role": "body", "text": "Raptors: Toronto recorded more than 20 assists for the seventh time in their first 10 games, finishing with 22. ... The five-point margin of victory was the smallest of the season for the Raptors, who had won by nine points or more in their five previous wins. ... Toronto matched a season-high with 13 made 3-pointers. All five starters made at least one. ... The Raptors assigned F Bruno Caboclo to its G-League team, Raptors 905."}
{"game_id": "0021700153", "chunk_id": "0021700153_018", "order": 18, "role": "body", "text": "Hoiberg said he tore into his team at halftime after what he called an \"awful\" defensive performance in the first two quarters. Toronto ended the second with a 16-4 run."}
{"game_id": "0021700153", "chunk_id": "0021700153_019", "order": 19, "role": "body", "text": "\"They got anything they wanted in the first half,\" Hoiberg said. \"We didn't take anything away from them. It was too easy.\""}
{"game_id": "0021700153", "chunk_id": "0021700153_021", "order": 21, "role": "body", "text": "A moment of silence was held before the national anthems in honor of former Blue Jays pitcher Roy Halladay, who died in a plane crash Tuesday. \"It's sad,\" Casey said. \"He was huge here in Toronto over the years. I used to keep up with him all the time and watch him pitch.\""}
{"game_id": "0021700153", "chunk_id": "0021700153_023", "order": 23, "role": "body", "text": "Bulls: Chicago hosts Indiana on Friday night, their first meeting with the Pacers this season. The teams split four meetings last season."}
{"game_id": "0021700153", "chunk_id": "0021700153_024", "order": 24, "role": "body", "text": "Raptors: Toronto will be seeking its fifth straight victory over New Orleans when it hosts the Pelicans on Thursday night."}
{"game_id": "0021700153", "chunk_id": "0021700153_026", "order": 26, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
