{"game_id": "0021700884", "chunk_id": "0021700884_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Philadelphia 76ers coach Brett Brown was sticking with his subs no matter what."}
{"game_id": "0021700884", "chunk_id": "0021700884_002", "order": 2, "role": "body", "text": "With 5:45 left in their 116-105 victory over the Orlando Magic on Saturday, the Sixers led by 22 points."}
{"game_id": "0021700884", "chunk_id": "0021700884_003", "order": 3, "role": "body", "text": "With 1:25 left, the lead was down to nine, and the Magic had the ball. But Mario Hezonja's 3 spilled out, and the Sixers held on for their season-high seventh straight win."}
{"game_id": "0021700884", "chunk_id": "0021700884_004", "order": 4, "role": "body", "text": "\"We talked about that in the locker room. What if Hezonja's shot went in?\" Brown said. \"I wasn't going to do it. I was going to go with those guys. Again, some of it's just gut feel. Maybe some of it is stubbornness. But we have to grow our bench. We have to give those guys confidence that they can close out games, and they did.\""}
{"game_id": "0021700884", "chunk_id": "0021700884_005", "order": 5, "role": "body", "text": "As they have done so often this season, the Sixers' starters built a substantial lead."}
{"game_id": "0021700884", "chunk_id": "0021700884_006", "order": 6, "role": "body", "text": "With 28 points and 14 rebounds, Joel Embiid was one of six 76ers in double-figures. Ben Simmons had 17 points and seven assists, and 3-point specialist JJ Redick added 16 points on 6-for-8 shooting -- and just one 3-pointer. Robert Covington had 12 and Dario Saric scored 11."}
{"game_id": "0021700884", "chunk_id": "0021700884_007", "order": 7, "role": "body", "text": "Marco Belinelli, who had 15 points, was signed earlier this month to bolster the bench. Brown also made a point to play young big man Richaun Holmes instead of veteran Amir Johnson."}
{"game_id": "0021700884", "chunk_id": "0021700884_008", "order": 8, "role": "body", "text": "Midway through the first quarter, Philadelphia had more turnovers (three) than field goals (two) and trailed 15-6. Holmes replaced Embiid, forced a turnover on former Sixer Nik Vucevic and threw down a thunderous alley-oop dunk to spark a 21-3 run that put Philadelphia up 27-18 after a quarter."}
{"game_id": "0021700884", "chunk_id": "0021700884_009", "order": 9, "role": "body", "text": "Holmes, who has played in only 29 games this season, finished with four points, four assists, eight rebounds and a block in 21 minutes."}
{"game_id": "0021700884", "chunk_id": "0021700884_010", "order": 10, "role": "body", "text": "\"My motivation right now is, I know Richaun has value,\" Brown said. \"I know he has things that he can bring to the table. And I respect how he's handled himself when he wasn't playing that much. I know it's my job to keep him alive. Tonight was an example of that, and I thought he did very, very well.\""}
{"game_id": "0021700884", "chunk_id": "0021700884_011", "order": 11, "role": "body", "text": "Aaron Gordon led Orlando with 20 points, including four 3s, to go with seven rebounds and seven assists. Evan Fournier scored 16 points, and Vucevic had 15 points and nine rebounds for the Magic, who have lost five straight."}
{"game_id": "0021700884", "chunk_id": "0021700884_012", "order": 12, "role": "body", "text": "\"I thought they just played harder,\" Fournier said. \"It took us basically a quarter and a half to respond ... and we lost our rhythm.\""}
{"game_id": "0021700884", "chunk_id": "0021700884_013", "order": 13, "role": "body", "text": "Philadelphia led 58-40 at halftime and 71-49 in the third when Orlando used an 11-2 burst, capped by a Gordon 3-pointer, to close within 13."}
{"game_id": "0021700884", "chunk_id": "0021700884_014", "order": 14, "role": "body", "text": "But the Sixers put on a show to finish the quarter."}
{"game_id": "0021700884", "chunk_id": "0021700884_015", "order": 15, "role": "body", "text": "Embiid overpowered a few Magic defenders for a slam and then gestured to the crowd after being fouled while soaring to the hoop on a dunk attempt. After Embiid and Trevor Booker swatted consecutive shots in the final seconds, T.J. McConnell used a crossover move to finish a drive at the buzzer and give the Sixers an 87-71 lead entering the fourth."}
{"game_id": "0021700884", "chunk_id": "0021700884_016", "order": 16, "role": "body", "text": "Then Brown decided to test the bench."}
{"game_id": "0021700884", "chunk_id": "0021700884_017", "order": 17, "role": "body", "text": "\"In the playoffs you need a bench to come in and keep it up for the starters to finish it,\" Embiid said."}
{"game_id": "0021700884", "chunk_id": "0021700884_019", "order": 19, "role": "body", "text": "Embiid, who entered the night averaging 3.9 turnovers per game, had zero."}
{"game_id": "0021700884", "chunk_id": "0021700884_020", "order": 20, "role": "body", "text": "\"Coming back from the break, that's an area I really wanted to focus on,\" Embiid said. \"Got to make the simple play.\""}
{"game_id": "0021700884", "chunk_id": "0021700884_022", "order": 22, "role": "body", "text": "Orlando head coach Frank Vogel wore an Eagles Super Bowl champions T-shirt during his pregame media availability. A native of Wildwood, New Jersey, Vogel makes sure to get a taste of home when he returns to the Philadelphia area."}
{"game_id": "0021700884", "chunk_id": "0021700884_023", "order": 23, "role": "body", "text": "\"Cheesesteaks, Tastykakes, Yuengling beer if we beat the Sixers,\" Vogel said. \"Wawa coffee, but I get Wawa in Orlando now. I did get a cheesesteak today.\""}
{"game_id": "0021700884", "chunk_id": "0021700884_024", "order": 24, "role": "body", "text": "Eagles quarterback Carson Wentz rang the ceremonial Liberty Bell before the game."}
{"game_id": "0021700884", "chunk_id": "0021700884_025", "order": 25, "role": "body", "text": "\"I think it's awesome,\" Brown said. \"He can come over and ring as many bells as he chooses.\""}
{"game_id": "0021700884", "chunk_id": "0021700884_027", "order": 27, "role": "body", "text": "Magic: Jonathan Simmons, who turned his ankle in Thursday's loss to the Knicks, finished with nine points in 32 minutes. ... Rookie Jonathan Isaac, Orlando's first-round pick last year, continues to work his way back from an ankle injury that has sidelined him for the last 23 games and 41 of the last 44. He had eight points, three rebounds, three steals and five turnovers for Lakeland in a G League game Saturday night against Grand Rapids."}
{"game_id": "0021700884", "chunk_id": "0021700884_028", "order": 28, "role": "body", "text": "76ers: The last time Philadelphia won seven straight was Jan. 6-17, 2009. The Sixers have now won 10 straight at home, their longest streak since Oct. 30-Dec. 4, 2002. ... Simmons has scored in double figures 50 times season to lead all rookies."}
{"game_id": "0021700884", "chunk_id": "0021700884_030", "order": 30, "role": "body", "text": "Magic: At Oklahoma City on Monday."}
{"game_id": "0021700884", "chunk_id": "0021700884_031", "order": 31, "role": "body", "text": "76ers: At Washington on Sunday."}
{"game_id": "0021700884", "chunk_id": "0021700884_033", "order": 33, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
