{"game_id": "0021401000", "chunk_id": "0021401000_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Stan Van Gundy doesn't know why Reggie Jackson broke out of his slump in such a big way Tuesday night."}
{"game_id": "0021401000", "chunk_id": "0021401000_003", "order": 3, "role": "body", "text": "Jackson had 23 points and a career-high 20 assists as the Detroit Pistons ended a 10-game skid with a 105-95 comeback victory over the Memphis Grizzlies."}
{"game_id": "0021401000", "chunk_id": "0021401000_004", "order": 4, "role": "body", "text": "\"I have no idea what was different tonight,\" the coach said. \"All I know is that he was finding open guys when we needed that and he was getting to the rim when we needed that. It was a phenomenal game.\""}
{"game_id": "0021401000", "chunk_id": "0021401000_005", "order": 5, "role": "body", "text": "The Pistons trailed by 15 points at halftime, but Jackson dominated Beno Udrih, who was starting at point guard in place of injured Mike Conley (ankle). Jackson had 11 points and 13 assists in the second half to pick up Detroit's second 20-point, 20-assist game of the season."}
{"game_id": "0021401000", "chunk_id": "0021401000_006", "order": 6, "role": "body", "text": "\"We just attacked the basket in the second half, and we played a lot harder on defense,\" he said. \"Once we started getting some stops and started holding them to one shot, we were able to get out and run. That's what changed the game.\""}
{"game_id": "0021401000", "chunk_id": "0021401000_007", "order": 7, "role": "body", "text": "Jeff Green led Memphis with 21 points, and Marc Gasol had 17 points and 11 rebounds before fouling out. Andre Drummond finished with 16 points and 16 rebounds for Detroit."}
{"game_id": "0021401000", "chunk_id": "0021401000_008", "order": 8, "role": "body", "text": "Gasol and Zach Randolph combined for 24 points and 11 rebounds in the first half as the Grizzlies built a 54-39 lead.  In the second half, though, they finished with just six points and five rebounds."}
{"game_id": "0021401000", "chunk_id": "0021401000_009", "order": 9, "role": "body", "text": "\"This is on all of us,\" said Randolph. \"They hit shots, we stopped playing defense and Reggie got going. This is disappointing, especially when we know what we are trying to do. We've got to do something to get tougher.\""}
{"game_id": "0021401000", "chunk_id": "0021401000_010", "order": 10, "role": "body", "text": "Jackson, who had 12 points and seven assists in the half, was the only reason the Pistons weren't being blown out by the intermission."}
{"game_id": "0021401000", "chunk_id": "0021401000_011", "order": 11, "role": "body", "text": "Detroit starting making jumpers in the second half, and a pair of Caldwell-Pope 3-pointers tied the game at 73 in the final minute of the third. Jackson had nine assists in the quarter, giving him a career-high 16 with 12 minutes to play, but Vince Carter's 3-pointer gave Memphis a 76-75 lead heading into the fourth."}
{"game_id": "0021401000", "chunk_id": "0021401000_012", "order": 12, "role": "body", "text": "\"They got into a rhythm and they kept going,\" Green said. \"From there, their confidence just kept going. They did a great job of going out there, having fun and playing loose.\""}
{"game_id": "0021401000", "chunk_id": "0021401000_013", "order": 13, "role": "body", "text": "Jackson came out early in the fourth, but rookie Spencer Dinwiddie, who struggled in the first half, held his own. He scored five points and grabbed a pair of rebounds in a six-minute stretch. The Pistons took an 88-87 lead on Jodie Meeks' four-point play midway through the fourth."}
{"game_id": "0021401000", "chunk_id": "0021401000_014", "order": 14, "role": "body", "text": "Jackson returned with a three-point play followed by a driving layup, putting Detroit ahead 95-90 with 3:45 left. He finished off the 20/20 game with a lob pass to Drummond with seven seconds to play."}
{"game_id": "0021401000", "chunk_id": "0021401000_016", "order": 16, "role": "body", "text": "Grizzlies: Zach Randolph got a big hand from the Palace crowd during pregame introductions, as he has since entering the NBA. Randolph starred at Michigan State, teaming up with Jason Richardson to lead the Spartans to the Final Four in 2001."}
{"game_id": "0021401000", "chunk_id": "0021401000_017", "order": 17, "role": "body", "text": "Pistons: Drummond (concussion) and Tayshaun Prince (hip) both recovered from injuries sustained in Saturday's loss at Utah in order to play against Memphis, and Pistons coach Stan Van Gundy said that he does not expect Greg Monroe (knee) to miss much time with his injury. Monroe strained his right knee in Monday's practice, and is questionable for Wednesday's game in Philadelphia."}
{"game_id": "0021401000", "chunk_id": "0021401000_019", "order": 19, "role": "body", "text": "Grizzlies: visit the Mavericks on Friday."}
{"game_id": "0021401000", "chunk_id": "0021401000_020", "order": 20, "role": "closing", "text": "Pistons: visit the Sixers on Wednesday."}
