{"game_id": "0021700506", "chunk_id": "0021700506_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Rookie Jayson Tatum said he is beginning to feel more comfortable with the NBA game. It's beginning to show, too."}
{"game_id": "0021700506", "chunk_id": "0021700506_002", "order": 2, "role": "body", "text": "Tatum scored 10 of his 18 points in the fourth quarter, helping the Boston Celtics beat the Charlotte Hornets 102-91 on Wednesday night."}
{"game_id": "0021700506", "chunk_id": "0021700506_003", "order": 3, "role": "body", "text": "\"Tatum stepped up for us,\" said Al Horford, who had 20 points and 11 rebounds. \"He's not afraid of the moment. One thing that helps him is he stays poised, very focused. It doesn't matter how the game has been going up until that point. He seems to make the right plays down the stretch.\""}
{"game_id": "0021700506", "chunk_id": "0021700506_004", "order": 4, "role": "body", "text": "Tatum had two fast-breaks dunks and a nifty baseline drive in which he blew past Dwight Howard before drawing a foul as the Celtics broke open a tight game in the fourth."}
{"game_id": "0021700506", "chunk_id": "0021700506_005", "order": 5, "role": "body", "text": "\"It comes with the amount games we've played,\" Tatum said. \"Each and every day I'm getting more comfortable and getting into a rhythm.\""}
{"game_id": "0021700506", "chunk_id": "0021700506_006", "order": 6, "role": "body", "text": "Kyrie Irving led Boston with 21 points. The Celtics had dropped three of four, including a 111-103 loss to visiting Washington on Christmas Day."}
{"game_id": "0021700506", "chunk_id": "0021700506_007", "order": 7, "role": "body", "text": "Kemba Walker scored 24 points and Howard had 12 points and 17 rebounds for the Hornets, who are in the midst of a freefall down the Eastern Conference standings. Charlotte has lost 13 of 17 ahead of a four-game West Coast trip beginning Friday night at Golden State."}
{"game_id": "0021700506", "chunk_id": "0021700506_008", "order": 8, "role": "body", "text": "With Boston leading by four early in the fourth quarter, Tatum scored on an alley-oop dunk on a fast break. A few possessions later he scored on a reverse layup, and then added a block at the other end."}
{"game_id": "0021700506", "chunk_id": "0021700506_009", "order": 9, "role": "body", "text": "Tatum was able to pick his spots because the Hornets shifted their focus in the fourth quarter to blitzing Irving when he had the ball."}
{"game_id": "0021700506", "chunk_id": "0021700506_010", "order": 10, "role": "body", "text": "\"Kyrie is drawing a ton of attention in that moment and Al draws a lot of attention, so a couple of Jayson's baskets were off of that,\" Boston coach Brad Stevens said."}
{"game_id": "0021700506", "chunk_id": "0021700506_011", "order": 11, "role": "body", "text": "Irving said Tatum has tremendous patience."}
{"game_id": "0021700506", "chunk_id": "0021700506_012", "order": 12, "role": "body", "text": "\"Understanding what we're trying to accomplish and knowing that when the game has to slow down, the spots that he needs to be in, the spots that he can take advantage of and being able to have the confidence to be put in that position,\" said Irving, who had eight assists. \"He's taking full advantage of it.\""}
{"game_id": "0021700506", "chunk_id": "0021700506_013", "order": 13, "role": "body", "text": "The Hornets trailed by as many as 20 in the first half, but cut the lead to one entering the fourth quarter after holding the Celtics to 7-of-23 shooting in the third."}
{"game_id": "0021700506", "chunk_id": "0021700506_015", "order": 15, "role": "body", "text": "Terry Rozier, who had 15 points, knocked down a 3-point to start the fourth and Horford scored inside to give the Celtics some breathing room."}
{"game_id": "0021700506", "chunk_id": "0021700506_016", "order": 16, "role": "body", "text": "Aron Baynes played a pivotal role on defense, helping hold Howard to 3-of-10 shooting from the field. Baynes consistently pushed Howard away from the low block, forcing him to take difficult shots and finished with nine rebounds."}
{"game_id": "0021700506", "chunk_id": "0021700506_018", "order": 18, "role": "body", "text": "Celtics: Have beaten the Hornets in six straight meetings and 10 of the last 11 dating to February 2015. ... Had 15 fast-break points to Charlotte's eight."}
{"game_id": "0021700506", "chunk_id": "0021700506_019", "order": 19, "role": "body", "text": "Hornets: Walker has scored at least 20 points in 19 games this season. ... Outrebounded the Celtics 52-43. ... Shot 36.8 percent from the field."}
{"game_id": "0021700506", "chunk_id": "0021700506_021", "order": 21, "role": "body", "text": "The Hornets allowed 60 points in the first half, but only 42 in the second."}
{"game_id": "0021700506", "chunk_id": "0021700506_022", "order": 22, "role": "body", "text": "\"I talked to the guys in the locker room after the game about waiting too long and waiting until we get down to actually start playing the way we know how to play,\" said associate head coach Stephen Silas, who has been filling in for Steve Clifford."}
{"game_id": "0021700506", "chunk_id": "0021700506_024", "order": 24, "role": "body", "text": "The Hornets face the Warriors, Clippers, Kings and Lakers on their upcoming road trip. Charlotte is just 2-12 away from home this season."}
{"game_id": "0021700506", "chunk_id": "0021700506_025", "order": 25, "role": "body", "text": "\"It hasn't been the most friendly out there on the road for us,\" forward Marvin Williams said. \"We've got a lot of ground to make up. It doesn't get any easier for us so we're going to have to start taking it one game at a time.\""}
{"game_id": "0021700506", "chunk_id": "0021700506_027", "order": 27, "role": "body", "text": "Celtics: Host Houston on Thursday night."}
{"game_id": "0021700506", "chunk_id": "0021700506_028", "order": 28, "role": "body", "text": "Hornets: Visit Golden State on Friday night."}
{"game_id": "0021700506", "chunk_id": "0021700506_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
