{"game_id": "0021700927", "chunk_id": "0021700927_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Ersan Ilyasova's return to Philadelphia came in time to key a comeback against the Hornets."}
{"game_id": "0021700927", "chunk_id": "0021700927_002", "order": 2, "role": "body", "text": "The \"Trust the Process!\" chants rang out in the final minute and the 76ers -- who won just 10 times in 2015-16 -- won the type of game that proved why they might make some noise in the playoffs."}
{"game_id": "0021700927", "chunk_id": "0021700927_003", "order": 3, "role": "body", "text": "Ilyasova scored 11 of his 18 points in the fourth quarter in his first home game since he rejoined the Sixers, Joel Embiid had 23 points and 15 rebounds, and Philadelphia beat Charlotte 110-99 on Friday night."}
{"game_id": "0021700927", "chunk_id": "0021700927_004", "order": 4, "role": "body", "text": "\"I told him, `Let's do whatever we had going on last year,\" Embiid said. \"He played great. Everybody had a great second half. But I was excited to have him back.\""}
{"game_id": "0021700927", "chunk_id": "0021700927_005", "order": 5, "role": "body", "text": "Ilyasova played 53 games for the Sixers last season before he was traded to Atlanta. The Hawks waived him this week and he was enticed to reunite with a familiar organization ready to make a run at the postseason."}
{"game_id": "0021700927", "chunk_id": "0021700927_007", "order": 7, "role": "body", "text": "So were the Sixers, once Ilyasova delivered a flawless fourth (4 for 4 from the floor, sank both free throws) that compensated for Embiid's scoreless quarter. Embiid had been otherwise dominant in a lopsided matchup against Dwight Howard."}
{"game_id": "0021700927", "chunk_id": "0021700927_008", "order": 8, "role": "body", "text": "The Sixers won their 13th straight game at the Wells Fargo Center."}
{"game_id": "0021700927", "chunk_id": "0021700927_009", "order": 9, "role": "body", "text": "\"I think, for me, I need that energy,\" Embiid said. \"We've got to put on a show. It's great, especially if we make the playoffs, it'll be louder than usual.\""}
{"game_id": "0021700927", "chunk_id": "0021700927_010", "order": 10, "role": "body", "text": "The Sixers were coming off an impressive 108-97 win over the Cleveland Cavaliers on Thursday night that ended an 11-game losing streak against the Eastern Conference champions. Coach Brett Brown said playing the second of a back-to-back at home against a Hornets team badly in need of victories would be a nice test."}
{"game_id": "0021700927", "chunk_id": "0021700927_011", "order": 11, "role": "body", "text": "\"We're closer than we've ever been to achieving a pretty significant goal. We don't feel like we're there at all, and I don't see complacency creeping in there,\" Brown said. \"We're playing a team in desperation mode.\""}
{"game_id": "0021700927", "chunk_id": "0021700927_012", "order": 12, "role": "body", "text": "Led by Kemba Walker and Frank Kaminsky, the determined Hornets charged to a 14-point lead and seemed poised to snatch a needed road win."}
{"game_id": "0021700927", "chunk_id": "0021700927_013", "order": 13, "role": "body", "text": "The 76ers stole the win right back."}
{"game_id": "0021700927", "chunk_id": "0021700927_014", "order": 14, "role": "body", "text": "Dario Saric and Ilyasova hit consecutive 3-pointers for a 91-89 lead in the fourth that sent a stout crowd that had trudged through a storm to get to the Wells Fargo Center into a frenzy."}
{"game_id": "0021700927", "chunk_id": "0021700927_015", "order": 15, "role": "body", "text": "The only thing that could derail the Sixers at this point would be a serious injury to Embiid or Rookie of the Year candidate Ben Simmons."}
{"game_id": "0021700927", "chunk_id": "0021700927_016", "order": 16, "role": "body", "text": "Embiid, playing with four fouls, crashed to the court on a hard foul in the third and instantly grabbed his lower back. Embiid was slow to rise but did and made two free throws. He brushed off his discomfort and stormed down the court on the next possession for a bucket that cut the Sixers' deficit to 80-74 through three."}
{"game_id": "0021700927", "chunk_id": "0021700927_017", "order": 17, "role": "body", "text": "Walker scored 31 points and Kaminsky 19 for the Hornets. Nicolas Batum had 14 points, 13 rebounds and eight assists."}
{"game_id": "0021700927", "chunk_id": "0021700927_018", "order": 18, "role": "body", "text": "The Hornets entered four games out of the final playoff spot in the Eastern Conference and still need to leap Detroit to reach eighth. They completely unraveled in the fourth and coach Steve Clifford was hit with a technical foul in the final seconds."}
{"game_id": "0021700927", "chunk_id": "0021700927_019", "order": 19, "role": "body", "text": "\"We made so many mistakes and they capitalized,\" Walker said. \"We've got to play better. We've got to finish games better.\""}
{"game_id": "0021700927", "chunk_id": "0021700927_020", "order": 20, "role": "body", "text": "While Embiid dominated, the Hornets got nothing out Howard. He picked up three fouls in the first quarter and played only 10 minutes for the half. He heard one of the loudest ovations of the night when he clanged two consecutive free throws in the third quarter and earned fans a free dessert from a fast-food joint."}
{"game_id": "0021700927", "chunk_id": "0021700927_022", "order": 22, "role": "body", "text": "Hornets: F Cody Zeller sat out with a sore left knee and Michael Kidd-Gilchrist scored nine points after he missed a game with a sore hamstring."}
{"game_id": "0021700927", "chunk_id": "0021700927_023", "order": 23, "role": "body", "text": "Sixers: Brown said reaction to Saric's dunk in the closing seconds in the win over the Cavs was \"overblown.\" \"It was not meant to be done disrespectfully,\" Brown said. ... Team owner Josh Harris was linked to the White House this week when it was reported he met multiple times with Jared Kushner, the son-in-law of President Donald Trump. Of Harris' connection to the White House, Brown said, \"I haven't given it one bit of thought.\""}
{"game_id": "0021700927", "chunk_id": "0021700927_025", "order": 25, "role": "body", "text": "Clifford compared Simmons' size and athleticism to a young LeBron James. Simmons and James are friends and the two embraced following Philadelphia's win over the Cavs."}
{"game_id": "0021700927", "chunk_id": "0021700927_026", "order": 26, "role": "body", "text": "\"His ability to get the ball going toward the basket into the paint, and then deliver really any pass, which was LeBron's big strength also when he was younger,\" Clifford said."}
{"game_id": "0021700927", "chunk_id": "0021700927_028", "order": 28, "role": "body", "text": "Hornets: Play Sunday at Toronto."}
{"game_id": "0021700927", "chunk_id": "0021700927_029", "order": 29, "role": "closing", "text": "Sixers: Play Sunday at Milwaukee."}
