{"game_id": "0021700797", "chunk_id": "0021700797_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  After another embarrassing defeat and two days before the trade deadline, LeBron James let it be known he's not going anywhere, at least for now."}
{"game_id": "0021700797", "chunk_id": "0021700797_002", "order": 2, "role": "body", "text": "\"I'm here for this season right now to try and figure out a way we can still compete,\" James said after his Cleveland Cavaliers blew a 21-point lead in a 116-98 loss to the Orlando Magic. \"I owe it to my teammates to finish this season out no matter how it ends up. I would never waive my no-trade clause.\""}
{"game_id": "0021700797", "chunk_id": "0021700797_003", "order": 3, "role": "body", "text": "The Cavaliers fell apart in the second half and lost for the 14th time in 21 games. They have given up an average of 122.4 points in their last five losses."}
{"game_id": "0021700797", "chunk_id": "0021700797_004", "order": 4, "role": "body", "text": "\"I couldn't give up on my teammates like that. I just couldn't do it,\" James said after scoring 25 points. \"We put too much into the game every single day."}
{"game_id": "0021700797", "chunk_id": "0021700797_005", "order": 5, "role": "body", "text": "\"This is no time to be ashamed about our season,\" he added. \"We've got quite a few games left. If we're still serious about the season, then we've got to play some good ball at some point.\""}
{"game_id": "0021700797", "chunk_id": "0021700797_006", "order": 6, "role": "body", "text": "Jonathon Simmons scored 22 of his career-high 34 points in the third quarter for the Magic, who broke a nine-game home-court losing streak against Cleveland."}
{"game_id": "0021700797", "chunk_id": "0021700797_007", "order": 7, "role": "body", "text": "The Cavaliers scored 43 points in the first quarter, but then went almost 6 1/2 minutes without scoring in the fourth. They played the second half without coach Tyronn Lue, who went to the locker room in the second quarter with what the team said was an illness."}
{"game_id": "0021700797", "chunk_id": "0021700797_008", "order": 8, "role": "body", "text": "\"It's like right now, when we hit adversity, we go our separate ways,\" guard Isaiah Thomas said. \"And that's just how I feel and it looks like that as well.\""}
{"game_id": "0021700797", "chunk_id": "0021700797_009", "order": 9, "role": "body", "text": "The Magic made their first 10 shots of the second half and won consecutive games for the first time since Nov. 8-10."}
{"game_id": "0021700797", "chunk_id": "0021700797_010", "order": 10, "role": "body", "text": "James did not have a rebound or an assist in a foul-plagued second half."}
{"game_id": "0021700797", "chunk_id": "0021700797_011", "order": 11, "role": "body", "text": "\"I gave my teammates some opportunities to knock `em down, but they just didn't go. You can't get assists when they don't go down, but that doesn't stop me from finding my guys on the floor,\" he said. \"At this point it's not what you say, it's what you do. We've got to go out and play well as a collective group, everyone hitting at the right time on all cylinders, and right now we're not doing that.\""}
{"game_id": "0021700797", "chunk_id": "0021700797_012", "order": 12, "role": "body", "text": "Simmons made seven of eight shots in his 22-point quarter, finishing the period with a 3-point buzzer shot in a game in which he almost did not play because of a sprained right ankle."}
{"game_id": "0021700797", "chunk_id": "0021700797_013", "order": 13, "role": "body", "text": "\"To be honest, adrenaline was just going and I didn't even realize what was going on,\" Simmons said. \"I was just trying to play hard and trying not to have another setback.\""}
{"game_id": "0021700797", "chunk_id": "0021700797_014", "order": 14, "role": "body", "text": "J.R. Smith made three 3-pointers in the first four minutes to help the Cavaliers (30-22) take a 15-4 lead, and they led by 21 points late in the first half."}
{"game_id": "0021700797", "chunk_id": "0021700797_015", "order": 15, "role": "body", "text": "Jeff Green dunked to put the Cavaliers up 61-40 with 4:50 left in the half, but they went scoreless for almost four minutes while the Magic (17-36) sliced nine points off the lead."}
{"game_id": "0021700797", "chunk_id": "0021700797_016", "order": 16, "role": "body", "text": "James opened the second half with a couple of 3-pointers to regain a 16-point lead for Cleveland, but Simmons scored 12 points during the Magic's 19-2 run that gave them their first lead of the game at 78-77 with 5:33 left in the third quarter."}
{"game_id": "0021700797", "chunk_id": "0021700797_017", "order": 17, "role": "body", "text": "James was called for his fourth foul just 17 seconds later and sat for more than seven minutes."}
{"game_id": "0021700797", "chunk_id": "0021700797_018", "order": 18, "role": "body", "text": "When he re-entered the game with 10:10 remaining in the fourth quarter, the Magic ran off 14 straight points to lead 108-92."}
{"game_id": "0021700797", "chunk_id": "0021700797_019", "order": 19, "role": "body", "text": "Dwyane Wade banked in a 3-pointer for Cleveland's only points in the first 7:25 of the fourth quarter."}
{"game_id": "0021700797", "chunk_id": "0021700797_021", "order": 21, "role": "body", "text": "Cavaliers: Wade missed the morning shootaround with an illness but played 22 minutes."}
{"game_id": "0021700797", "chunk_id": "0021700797_022", "order": 22, "role": "body", "text": "Magic: Simmons' 22-point quarter was three points short of the franchise record set by Tracy McGrady in 2003. ... F Aaron Gordon missed a fifth straight game with a strained left hip flexor and has withdrawn from the Slam Dunk Contest at NBA All-Star Weekend."}
{"game_id": "0021700797", "chunk_id": "0021700797_024", "order": 24, "role": "body", "text": "Cavaliers: Host Minnesota on Wednesday."}
{"game_id": "0021700797", "chunk_id": "0021700797_025", "order": 25, "role": "body", "text": "Magic: Host Atlanta on Thursday."}
{"game_id": "0021700797", "chunk_id": "0021700797_027", "order": 27, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
