{"game_id": "0021700455", "chunk_id": "0021700455_001", "order": 1, "role": "lead", "text": "ATLANTA --  Victor Oladipo didn't quite approach 40 points this time. He didn't have to."}
{"game_id": "0021700455", "chunk_id": "0021700455_002", "order": 2, "role": "body", "text": "Oladipo scored 23 points to lead the Indiana Pacers over the Atlanta Hawks 105-95 Wednesday night, two days after scoring 38 points in a loss to Boston."}
{"game_id": "0021700455", "chunk_id": "0021700455_003", "order": 3, "role": "body", "text": "Oladipo made 8 of 15 shots Wednesday, including 3 of 5 3-pointers, and Indiana built a 20-point fourth-quarter lead before the Hawks scored the final 10 points."}
{"game_id": "0021700455", "chunk_id": "0021700455_004", "order": 4, "role": "body", "text": "Oladipo, acquired in an offseason trade that sent Indiana star Paul George to the Thunder, is averaging career highs in points (24.8) and 3-point shooting percentage (43.2). And yet, he said defense was the key against Atlanta."}
{"game_id": "0021700455", "chunk_id": "0021700455_005", "order": 5, "role": "body", "text": "\"That was the difference. Now, we just have to learn how to do that for 48 minutes,\" he said. \"I think defensively we turned it up and that's the reason why we did so well down the stretch.\""}
{"game_id": "0021700455", "chunk_id": "0021700455_006", "order": 6, "role": "body", "text": "Indiana led just 53-51 at halftime."}
{"game_id": "0021700455", "chunk_id": "0021700455_007", "order": 7, "role": "body", "text": "The Pacers mucked up the motion offense of Atlanta coach Mike Budenholzer, whose team made just 16 of 41 shots in the second half."}
{"game_id": "0021700455", "chunk_id": "0021700455_008", "order": 8, "role": "body", "text": "The Hawks have yet to win consecutive games his season, and they were done in by their starters, who were outscored 77-49."}
{"game_id": "0021700455", "chunk_id": "0021700455_009", "order": 9, "role": "body", "text": "Atlanta's reserves outscored Indiana's subs 46-28 with rookie reserve center/forward John Collins leading the way with 18 points and nine rebounds. Marco Belinelli pitched in 13 points."}
{"game_id": "0021700455", "chunk_id": "0021700455_010", "order": 10, "role": "body", "text": "\"We came out of the gate with a lot of energy, played hard, played fast, played the way Coach wanted us to play,\" Collins said. \"Then, in the second half we kind of (slowed) down a little bit, kind of let off the gas.\""}
{"game_id": "0021700455", "chunk_id": "0021700455_011", "order": 11, "role": "body", "text": "The Pacers gradually grew their lead through the second half, peaking when young center Myles Turner (20 points, six rebounds) hit a 3-pointer for a 105-85 edge with 2:55 left."}
{"game_id": "0021700455", "chunk_id": "0021700455_012", "order": 12, "role": "body", "text": "Pacers coach Nate McMillan was pleased with his team's offense most of the night, especially after forward Bojan Bogdanovic added 19 points. He'd rather not wait on defense."}
{"game_id": "0021700455", "chunk_id": "0021700455_013", "order": 13, "role": "body", "text": "\"We've gotten off to somewhat of a slow start defensively,\" McMillan said. \"We don't need to pace ourselves. It seems like at times we're pacing ourselves. ... We want to try to get away from these slow starts.\""}
{"game_id": "0021700455", "chunk_id": "0021700455_015", "order": 15, "role": "body", "text": "Pacers: Indiana turned the ball over on two of its first three possessions but finished with a season-low nine turnovers. ... Indiana failed to make at least 10 3-pointers (7-of-21) for the fourth consecutive game after making 10 or more in five straight."}
{"game_id": "0021700455", "chunk_id": "0021700455_016", "order": 16, "role": "body", "text": "Hawks: Coach Mike Budenholzer said the team hopes to have forward/center Mike Muscala (ankle) play a couple games with Erie of the G-League before he returns to the team. Muscala has missed 21 of 30 games with a sprained left ankle. ... Atlanta entered third in the NBA shooting 38.3 percent on 3-pointers, but on Wednesday the Hawks made just 8 of 29 (27.6 percent). ... Center Miles Plumlee scored a season-high 10 points with four dunks. ... Belinelli made both of his free throws and has hit 26 straight. He leads the NBA at 95.4 percent."}
{"game_id": "0021700455", "chunk_id": "0021700455_018", "order": 18, "role": "body", "text": "Pacers: Will play host to the Nets on Saturday night."}
{"game_id": "0021700455", "chunk_id": "0021700455_019", "order": 19, "role": "body", "text": "Hawks: Visit Thunder on Friday night."}
{"game_id": "0021700455", "chunk_id": "0021700455_021", "order": 21, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
