{"game_id": "0021400312", "chunk_id": "0021400312_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- Kevin Durant is taking nothing for granted these days.\nThe reigning MVP missed the first 17 games this season with a broken bone in his right foot, and then played three road games before making his home debut Tuesday night. He got a rousing welcome back from the crowd, and scored 23 points to help the Thunder to a 114-101 victory over the Milwaukee Bucks.\n\"Just to play here is a blessing,\" he said. \"I've been saying that for a while, but to be out for so long and finally get a chance to play in front of our home crowd -- I felt good getting my name called in the starting lineup.\"\nDurant was 7 for 11 from the field and 8 for 8 at the line. He also had nine rebounds and seven assists in 29 minutes.\nRussell Westbrook scored 28 points for the Thunder, who have won five of six after starting the season with a 3-12 record.\n\"We're still trying to work some things out,\" Durant said. \"You know, I'm sure a lot of people are expecting us to be back to playoff-type of basketball right now, but we're just like any other team, just trying to continue to just build and keep getting better.\"\nO.J. Mayo had 18 points and Giannis Antetokounmpo added 17 for the Bucks, who have lost five of six.\n\"We let those guys get in the lane, get in our paint, and we fouled a lot tonight,\" Mayo said.\nDurant missed his first two shots, but drained his third, a 3-pointer with 8:08 left in the first quarter. He took a break after scoring seven points in the first 4:51.\nWestbrook's powerful one-handed putback on a missed 3-pointer by Reggie Jackson put the Thunder up 61-52 at halftime. Oklahoma City shot 60 percent in the second quarter after a sluggish first.\nDurant gave the fans another thrill early in the fourth quarter. He pulled in a defensive rebound, brought the ball up court and then used a pick by Kendrick Perkins to get free for an easy two-handed slam that gave the Thunder a 93-82 lead.\nDurant added a jumper and a no-look bounce pass to Serge Ibaka for a dunk that gave the Thunder a 103-88 lead. Durant left for good with 3:36 remaining and the Thunder holding a 109-90 lead.\n\"He's getting back into rhythm,\" Westbrook said. \"He's getting back in the swing of things.\"\nTIP-INS\nThunder: Oklahoma City was called for a clear path foul after Durant threw a poor pass that was intercepted, and Anthony Morrow had to foul to prevent an easy hoop in the closing seconds of the first quarter. ... Perkins was issued a technical foul with 8:56 left in the second quarter.\nBucks: Milwaukee shot 52 percent in the first quarter to take a 31-26 lead, but shot 36 percent the rest of the game. ... G Brandon Knight, the Bucks' leading scorer for the season with nearly 18 points per game, finished with nine points on 2-for-10 shooting.\nFINDING THE GROOVE\nOklahoma City scored a season-high 114 points and shot better than 50 percent from the field for just the second time this season. Oklahoma City scored at least 100 points for the fourth time in five games after scoring 100 or more just four times in its first 16.\nFALLING APART\nThe Bucks have allowed at least 107 points in four of their past five games. Their opponent shot at least 50 percent in all four of those games, all losses.\n\"We are a young team, so we are going to make mistakes, and make more mistakes the next game,\" coach Jason Kidd said. \"We just have to learn from them and correct them. We have to see them before they happen so that we can help one another.\"\nQUOTE OF THE NIGHT\n\"I just try to feel the game out. I'm not trying to worry about doing so much in so little time, I guess, and the last few games, I'm just going out there and playing, and whatever happens happens.\" -- Durant.\nUP NEXT\nBucks: Host the Los Angeles Clippers on Saturday.\nThunder: Host Cleveland on Thursday.\n---\nFollow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP"}
