{"game_id": "0021700585", "chunk_id": "0021700585_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  After preaching patience most of the season, Vince Carter is seeing signs of growth from his young Sacramento teammates."}
{"game_id": "0021700585", "chunk_id": "0021700585_002", "order": 2, "role": "body", "text": "It certainly helps when the 40-year-old eight-time All-Star can be a part of things, too."}
{"game_id": "0021700585", "chunk_id": "0021700585_003", "order": 3, "role": "body", "text": "Carter scored 10 of his 12 points in the fourth quarter and the Kings held off the Denver Nuggets 106-98 on Saturday night."}
{"game_id": "0021700585", "chunk_id": "0021700585_004", "order": 4, "role": "body", "text": "De'Aaron Fox had 18 points and seven assists, Willie Cauley-Stein added 17 points and Buddy Hield had 14."}
{"game_id": "0021700585", "chunk_id": "0021700585_005", "order": 5, "role": "body", "text": "\"We have a lot of talent around here, it's just patience,\" Carter said. \"They have to learn how to play this game and have to go through all the different scenarios that you could possibly face in an NBA game, and you won't see that until the second part of the season."}
{"game_id": "0021700585", "chunk_id": "0021700585_006", "order": 6, "role": "body", "text": "\"Everybody wants to see that growth, they want to see it now, and it doesn't happen that way.\""}
{"game_id": "0021700585", "chunk_id": "0021700585_007", "order": 7, "role": "body", "text": "Sacramento was up 13 early in the fourth, but Denver rallied and Trey Lyles' layup pulled the Nuggets to 92-89 with 5:22 remaining."}
{"game_id": "0021700585", "chunk_id": "0021700585_008", "order": 8, "role": "body", "text": "Cauley-Stein made back-to-back layups for the Kings and, after Will Barton made a 3-pointer for the Nuggets, Hield made a short jumper and Coleman hit a 3-pointer to help Sacramento pull away."}
{"game_id": "0021700585", "chunk_id": "0021700585_009", "order": 9, "role": "body", "text": "The Kings had dropped four straight, including both matchups this season."}
{"game_id": "0021700585", "chunk_id": "0021700585_010", "order": 10, "role": "body", "text": "\"We're not a finished product but it's a step in the right direction,\" Sacramento coach Dave Joerger said."}
{"game_id": "0021700585", "chunk_id": "0021700585_011", "order": 11, "role": "body", "text": "Lyles led Denver with 19 points, Jamal Murray added 18, and Will Barton and Gary Harris had 17 apiece."}
{"game_id": "0021700585", "chunk_id": "0021700585_012", "order": 12, "role": "body", "text": "The loss capped a frustrating night for Denver, which was playing the second half of a back-to-back. The Nuggets committed a season-high 26 turnovers, missed four consecutive free throws down the stretch and coach Mike Malone -- who previously coached in Sacramento -- was hit with a technical foul. Sacramento capitalized on almost every mistake Denver made and scored 40 points off turnovers."}
{"game_id": "0021700585", "chunk_id": "0021700585_013", "order": 13, "role": "body", "text": "That wasn't the type of performance Malone was looking for two days before playing the Golden State Warriors."}
{"game_id": "0021700585", "chunk_id": "0021700585_014", "order": 14, "role": "body", "text": "\"Bottom line is you gave a team that had three days off life by giving them 40 points off of your mistakes,\" Malone said. \"If you do that in a couple nights in Oakland, you'll get beat by 50.\""}
{"game_id": "0021700585", "chunk_id": "0021700585_015", "order": 15, "role": "body", "text": "The Nuggets erased most of an early 12-point deficit but fell apart after going scoreless for 5 1/2 minutes while missing their first nine shots in the second. Denver's frustrations boiled over when Malone, who spent one-plus seasons coaching in Sacramento, picked up a technical foul."}
{"game_id": "0021700585", "chunk_id": "0021700585_016", "order": 16, "role": "body", "text": "Things didn't get much better in the third. The Nuggets, who had 15 turnovers in the first half, made another to open the second half when Cauley-Stein intercepted the inbounds pass at midcourt and drove in for a dunk."}
{"game_id": "0021700585", "chunk_id": "0021700585_018", "order": 18, "role": "body", "text": "The Kings fired scouting director and former assistant general manager Mike Bratz, who was previously an assistant coach in Sacramento under Rick Adelman and Eddie Jordan. \"We agreed to part ways and appreciate all of his contributions to the Kings,\" the team said in a statement. \"We wish him nothing but the best.\""}
{"game_id": "0021700585", "chunk_id": "0021700585_020", "order": 20, "role": "body", "text": "Cauley-Stein led the Kings' defensive charge with a career-best seven steals that also matches the most in the NBA this season. Overall Sacramento had 16 steals. \"Just being ready and active, being in the right spots on defense,\" Cauley-Stein said. \"That'll happen. It's big. It feels good.\""}
{"game_id": "0021700585", "chunk_id": "0021700585_022", "order": 22, "role": "body", "text": "Nuggets: Denver shot 46.1 percent, slightly better than Sacramento, but never led. Barton didn't score until 1:28 remained in the third. . Kenneth Faried sat out his fourth consecutive game because of coach's decision."}
{"game_id": "0021700585", "chunk_id": "0021700585_023", "order": 23, "role": "body", "text": "Kings: Carter had a season-high eight rebounds. . It's the first time this season Sacramento has led the entire game. . Center Zach Randolph (oral surgery) and guard George Hill (personal reasons) did not play."}
{"game_id": "0021700585", "chunk_id": "0021700585_025", "order": 25, "role": "body", "text": "Nuggets: At Golden State on Monday night."}
{"game_id": "0021700585", "chunk_id": "0021700585_026", "order": 26, "role": "body", "text": "Kings: Host San Antonio on Monday night."}
{"game_id": "0021700585", "chunk_id": "0021700585_028", "order": 28, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
