{"game_id": "0021700546", "chunk_id": "0021700546_001", "order": 1, "role": "lead", "text": "TORONTO --  DeMar DeRozan spent his New Year's Day watching basketball history and making some, too."}
{"game_id": "0021700546", "chunk_id": "0021700546_002", "order": 2, "role": "body", "text": "DeRozan scored a franchise-record 52 points, and the Toronto Raptors beat the Milwaukee Bucks 131-127 in overtime on Monday night, matching the team record with their 12th consecutive home victory."}
{"game_id": "0021700546", "chunk_id": "0021700546_003", "order": 3, "role": "body", "text": "DeRozan said he spent some time earlier in the day watching the final few minutes of Game 6 of the 1998 NBA Finals, in which Hall of Famer Michael Jordan beat the Utah Jazz with a late jump shot, giving the Chicago Bulls their sixth title in eight seasons."}
{"game_id": "0021700546", "chunk_id": "0021700546_004", "order": 4, "role": "body", "text": "\"I remember being a kid and wishing to be in moments like that,\" DeRozan said. \"When you come out here and you're in those moments, you've got to make the best out of them.\""}
{"game_id": "0021700546", "chunk_id": "0021700546_005", "order": 5, "role": "body", "text": "DeRozan sure did, becoming the third player in Raptors history to score 50 or more in a single game. The others are Vince Carter and Terrence Ross, who each had 51."}
{"game_id": "0021700546", "chunk_id": "0021700546_006", "order": 6, "role": "body", "text": "\"I for sure wanted to beat T-Ross,\" DeRozan joked about eclipsing his former teammate."}
{"game_id": "0021700546", "chunk_id": "0021700546_007", "order": 7, "role": "body", "text": "DeRozan scored the first nine points of the game and had 21 in the first, the most by a Raptors player in a single quarter this season."}
{"game_id": "0021700546", "chunk_id": "0021700546_008", "order": 8, "role": "body", "text": "\"He was playing with a lot of juice,\" coach Dwane Casey said. \"You could see the bounce in his step. Tonight, DeMar DeRozan played like a superstar.\""}
{"game_id": "0021700546", "chunk_id": "0021700546_009", "order": 9, "role": "body", "text": "DeRozan made 17 of 29 field-goal attempts and went 13 for 13 at the free-throw line. His five 3-pointers were one shy of his career high."}
{"game_id": "0021700546", "chunk_id": "0021700546_010", "order": 10, "role": "body", "text": "\"He's dangerous any time he puts on a uniform,\" Bucks coach Jason Kidd said. \"Now to be able to expand his range out to the 3-point line just makes the game easier for him.\""}
{"game_id": "0021700546", "chunk_id": "0021700546_011", "order": 11, "role": "body", "text": "Kyle Lowry had 26 points and Serge Ibaka added 11 for the Raptors, who also won 12 straight at Air Canada Centre between Jan. 18 and March 6, 2016. Toronto is an NBA-best 14-1 at home."}
{"game_id": "0021700546", "chunk_id": "0021700546_012", "order": 12, "role": "body", "text": "Eric Bledsoe scored 29 points, including 11 in overtime, and Giannis Antetokounmpo had 26 for the Bucks, who had won their previous two. Khris Middleton finished with 18 points in the entertaining rematch between first-round playoff opponents from last season, a series Toronto won in six."}
{"game_id": "0021700546", "chunk_id": "0021700546_013", "order": 13, "role": "body", "text": "Fred VanVleet gave Toronto the lead for good with a 3-pointer at 3:51 of overtime, and DeRozan followed with a jump shot, making it 121-117 Raptors."}
{"game_id": "0021700546", "chunk_id": "0021700546_014", "order": 14, "role": "body", "text": "DeRozan made a pair of free throws to tie it at 114 with 37 seconds left in regulation, and Toronto got the ball back when Lowry stripped Matthew Dellavedova. Lowry's 3-point attempt with the shot clock winding down missed the rim, giving the Bucks 3.2 seconds to try to win it. With DeRozan defending him, Malcolm Brogdon couldn't get a shot off before the buzzer sounded, sending it to overtime."}
{"game_id": "0021700546", "chunk_id": "0021700546_015", "order": 15, "role": "body", "text": "\"We were looking at Khris and Giannis,\" Kidd said. \"We had two options and Malcolm was the safety. We knew they were going to switch, we just didn't make the right read.\""}
{"game_id": "0021700546", "chunk_id": "0021700546_017", "order": 17, "role": "body", "text": "Bucks: Milwaukee assigned F Jabari Parker to their G-League team, the Wisconsin Herd. Parker, who also practiced with the Herd last month, has not played this season as he recovers from left knee surgery. ... Brogdon had 15 points. ... Dellavedova had a season-high 10 assists."}
{"game_id": "0021700546", "chunk_id": "0021700546_018", "order": 18, "role": "body", "text": "Raptors: Lowry holds the Raptors record for points in a quarter, scoring 22 in the fourth during a win at Atlanta on Dec. 2, 2015. ... Toronto has won nine straight against Eastern Conference opponents."}
{"game_id": "0021700546", "chunk_id": "0021700546_020", "order": 20, "role": "body", "text": "A smiling Jonas Valanciunas interrupted DeRozan's postgame scrum by standing behind his teammate and holding up a hand-lettered sign reading \"52.\""}
{"game_id": "0021700546", "chunk_id": "0021700546_022", "order": 22, "role": "body", "text": "After blocking Bledsoe's fast-break layup attempt in the first, Ibaka celebrated by pointing at the Milwaukee bench."}
{"game_id": "0021700546", "chunk_id": "0021700546_024", "order": 24, "role": "body", "text": "Bucks: Host Indiana on Wednesday. It's the first of four meetings this season between the Central Division rivals."}
{"game_id": "0021700546", "chunk_id": "0021700546_025", "order": 25, "role": "body", "text": "Raptors: Visit the Bulls on Wednesday. Toronto has lost six straight in Chicago, last winning there on Dec. 31, 2013."}
{"game_id": "0021700546", "chunk_id": "0021700546_027", "order": 27, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
