{"game_id": "0021300861", "chunk_id": "0021300861_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- A broad smile lit up Will Barton's face when he was asked what he thought about the fans chanting his name in Portland's 124-80 rout of Brooklyn.\n\"I like to think I'm the people's champ,\" Barton joked after scoring had a season-high 20 points and grabbing a career-high 11 rebounds off the bench in an inspired victory for the short-handed Trail Blazers.\n\"I had a lot of fun tonight,\" he said. \"We got a win, a big-time win. We had a lot of guys down (with injuries) so this win was huge for us.\"\nPortland won its fourth straight game despite missing forward LaMarcus Aldridge. The team's top scorer and rebounder has been out five straight games with a left groin sprain.\nJason Collins, who became the NBA's first openly gay player when he signed a 10-day contract with the Nets on Sunday, entered the game without much fan reaction and played a pair of scoreless stretches in the fourth quarter when coach Jason Kidd had taken out his starters.\nDeron Williams had 12 points for the Nets, who suffered their third-worst margin of defeat in franchise history. It was the team's lowest point total this season.\nKidd said the Nets looked listless.\n\"Our energy was not there,\" he said. \"On the offensive end, we missed shots and we kind of felt sorry for ourselves -- which carried over to the defensive end, and we didn't make stops.\"\nMo Williams scored 21 points and Nicolas Batum had 19 in three quarters to lead seven Trail Blazers in double figures. Portland coach Terry Stotts also pulled his starters in the fourth quarter.\nThe Blazers were hurting up front. In addition to Aldridge, Portland also was without forward Joel Freeland, who was missing his sixth game with a right knee sprain, and second-year center Myers Leonard, who was out with a right ankle sprain.\nThe Blazers also announced just before the game that forward Thomas Robinson, a key reserve in Aldridge's absence, injured his left knee in Portland's 100-95 victory over the Denver Nuggets on Tuesday night. Results of an MRI on Wednesday were negative.\nThe Blazers started Dorell Wright in place of Aldridge, who leads the Blazers with an average of 23.9 points and 11.4 rebounds.\n\"We didn't have anything to lose,\" guard Wesley Matthews said. \"We look like an AAU team out there. We don't have any size other than RoLo (center Robin Lopez). No one is playing their true positions. We're just playing off ball movement, off chemistry and it's working for us.\"\nThe Nets saw the return of starting guard Shaun Livingston.\n\"That was an ugly night,\" said Livingston, who did not play in Brooklyn's 108-102 victory over the Los Angeles Lakers on Sunday because of a bruised tailbone.\nThe Blazers opened with an 11-2 run, which was countered by a 10-2 run by the Nets that gave Brooklyn a 16-15 lead. Portland answered with a 12-2 run to go up 29-20 going into the second quarter.\nBarton's alley-oop dunk from Williams put Portland up 33-22. His jumper extended the lead to 45-30, and then a 3-pointer and his dunk pushed it to 58-34 at the break. Barton scored 12 points in the second quarter as the Blazers finished off the first half on a 19-4 run.\nPortland extended its lead to as many as 34 points in the third quarter. Portland's margin of victory was the largest for either team in the history of the series\n\"Well, I didn't see that coming,\" Stotts said. \"It was a good effort by everyone who played.\"\nHours after Collins signed on Sunday he was on the court for the Nets, playing 11 minutes with two rebounds and a steal against the Lakers. He also had five fouls.\nAgainst the Blazers, Collins played seven total minutes and attempted a field goal. The Nets signed him to help in the absence of center Brook Lopez, who is out for the season because of a broken right foot.\nThe Nets will play again Thursday night in Denver. The Blazers have a break until Saturday night, when they host the Nuggets.\nGame notes\nPortland won the only other meeting between the teams this season, 108-98 at the Barclay's Center. ... Portland got a scare in the first quarter when starting guard Matthews fell after getting tangled up with Paul Pierce and briefly retreated to the locker room. Matthews later returned to hearty applause from the fans. ... Brooklyn's 34 points was a first-half low for a Portland opponent."}
