{"game_id": "0021300144", "chunk_id": "0021300144_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Jolted by a two-game losing streak, the Oklahoma City Thunder turned to Serge Ibaka and their defense to stop the slide."}
{"game_id": "0021300144", "chunk_id": "0021300144_002", "order": 2, "role": "body", "text": "Ibaka equaled a career high with 20 rebounds, adding four blocked shots and 15 points as the Thunder smothered the Milwaukee Bucks' offense in a 92-79 victory Saturday night."}
{"game_id": "0021300144", "chunk_id": "0021300144_003", "order": 3, "role": "body", "text": "\"Serge's performance was outstanding, the way he was blocking and altering shots and his rebounds,\" Thunder coach Scott Brooks said. \"His 15 and 20 was one of his best games. He's standing out as a guy that can get 10 rebounds a night and he's been pretty consistent. That's what makes you a very good pro, that consistency.\""}
{"game_id": "0021300144", "chunk_id": "0021300144_004", "order": 4, "role": "body", "text": "Russell Westbrook scored 26 points and Kevin Durant added 24 for the Thunder, who were coming off back-to-back road losses to the Los Angeles Clippers and Golden State Warriors."}
{"game_id": "0021300144", "chunk_id": "0021300144_005", "order": 5, "role": "body", "text": "O.J. Mayo scored 22 points for the Bucks, losers of five straight who continue to play short-handed because of injuries."}
{"game_id": "0021300144", "chunk_id": "0021300144_006", "order": 6, "role": "body", "text": "Milwaukee played good enough defense to keep it close, but had too many offensive lulls. The Bucks shot 22.2 percent in the fourth quarter."}
{"game_id": "0021300144", "chunk_id": "0021300144_007", "order": 7, "role": "body", "text": "\"We didn't make shots, but defensively, we were really good,\" Durant said. \"They hit some 3s, which they do, but we contested them all night. Overall, defensively we played well.\""}
{"game_id": "0021300144", "chunk_id": "0021300144_008", "order": 8, "role": "body", "text": "Bucks coach Larry Drew says his team gets into trouble when it stops moving the ball on offense -- lapses that allowed the Thunder's defense to pounce."}
{"game_id": "0021300144", "chunk_id": "0021300144_009", "order": 9, "role": "body", "text": "\"When you play against a team like OKC, (when) you keep the ball on one side of the floor, they load up that side of the floor,\" Drew said. \"You become very easy to guard, because they do such a good job in their rotations. It's very obvious. When we hit those bad spells, that basketball stops moving and it doesn't jump around.\""}
{"game_id": "0021300144", "chunk_id": "0021300144_010", "order": 10, "role": "body", "text": "At least some of that credit goes to Ibaka."}
{"game_id": "0021300144", "chunk_id": "0021300144_011", "order": 11, "role": "body", "text": "\"He's a physical player,\" Bucks forward Ekpe Udoh said. \"He's athletic, gets off his feet. . He's talented. Hit a couple of shots on me.\""}
{"game_id": "0021300144", "chunk_id": "0021300144_012", "order": 12, "role": "body", "text": "The Thunder also welcomed back center Kendrick Perkins, who was away from the team for two games following his grandfather's death. Before the game, Brooks emphasized Perkins' critical role on defense -- particularly on pick-and-rolls."}
{"game_id": "0021300144", "chunk_id": "0021300144_013", "order": 13, "role": "body", "text": "Oklahoma City took control with an 11-4 run to end the third quarter -- playing with reserves for much of that stretch -- and led 72-65 going into the fourth."}
{"game_id": "0021300144", "chunk_id": "0021300144_014", "order": 14, "role": "body", "text": "Milwaukee was held scoreless for more than four minutes to start the fourth, but went on a quick 8-0 run, cutting the lead to 77-73 on a 3-pointer by Mayo with 6:10 remaining."}
{"game_id": "0021300144", "chunk_id": "0021300144_015", "order": 15, "role": "body", "text": "But Westbrook hit a jumper, Ibaka swatted away a putback attempt by Udoh, and Ibaka hit a shot on the other end to give the Thunder an 81-73 lead with 4:28 left."}
{"game_id": "0021300144", "chunk_id": "0021300144_016", "order": 16, "role": "body", "text": "The Bucks continue to struggle with injuries -- although they weren't as short-handed on Saturday as they were in a loss at Orlando on Wednesday, when they had only eight healthy players."}
{"game_id": "0021300144", "chunk_id": "0021300144_017", "order": 17, "role": "body", "text": "\"We know Milwaukee is banged up right now, but we wanted to come in and play a solid defensive game and I thought we did,\" Brooks said. \"We made them take tough shots. We did a good job defensively.\""}
{"game_id": "0021300144", "chunk_id": "0021300144_018", "order": 18, "role": "body", "text": "Mayo sees better things coming for the Bucks when they get healthy."}
{"game_id": "0021300144", "chunk_id": "0021300144_019", "order": 19, "role": "body", "text": "\"We'll be a lot better for sure,\" he said. \"Heck yeah, man. As we get more and more healthy, more of the seasoned guys back in, it'll strengthen our first unit.\""}
{"game_id": "0021300144", "chunk_id": "0021300144_020", "order": 20, "role": "body", "text": "Milwaukee went into halftime with the score tied at 40, holding Oklahoma City to 31.3 percent shooting from the floor in the first half."}
{"game_id": "0021300144", "chunk_id": "0021300144_021", "order": 21, "role": "body", "text": "Bucks rookie Giannis Antetokounmpo provided several highlights in the first half for Milwaukee, including a flying dunk on an alley-oop from Luke Ridnour, two blocked shots and a handful of other deflections."}
{"game_id": "0021300144", "chunk_id": "0021300144_022", "order": 22, "role": "closing", "text": "Game notes Drew said he does not have a timeline for the return of forward Ersan Ilyasova, who continues to sit out with a sore right ankle. ... Drew was optimistic that Caron Butler (left shoulder) and Brandon Knight (right hamstring) would return soon. ... Durant recovered from a cold start, shooting 3 for 10 from the floor in the first half."}
