{"game_id": "0021400928", "chunk_id": "0021400928_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  The Portland Trail Blazers knew they were going to miss Wesley Matthews. It didn't take long for Minnesota to show them how much."}
{"game_id": "0021400928", "chunk_id": "0021400928_002", "order": 2, "role": "body", "text": "Kevin Martin scored 29 points and Ricky Rubio hit a big 3-pointer with a minute left to help the Timberwolves snap a four-game skid with a 121-113 victory over the Trail Blazers on Saturday night."}
{"game_id": "0021400928", "chunk_id": "0021400928_003", "order": 3, "role": "body", "text": "Matthews went down with a ruptured Achilles on Thursday night, a big blow to the Blazers' chances in the powerful Western Conference. He is the team's best perimeter defender and an extremely versatile offensive player as well, and Portland missed him dearly in its first game without him."}
{"game_id": "0021400928", "chunk_id": "0021400928_004", "order": 4, "role": "body", "text": "The Wolves' two shooting guards combined for 56 points and made 19 of 32 shots. Martin hit 11 of 21 and Gary Neal scored 27 off the bench on 8-of-11 shooting."}
{"game_id": "0021400928", "chunk_id": "0021400928_005", "order": 5, "role": "body", "text": "Rubio added 13 points, 15 assists and eight rebounds, and Andrew Wiggins scored 18 while playing in front of a sellout crowd for the third time in five home games since Minnesota reacquired Kevin Garnett in a trade with Brooklyn."}
{"game_id": "0021400928", "chunk_id": "0021400928_006", "order": 6, "role": "body", "text": "\"It's different,\" Blazers star LaMarcus Aldridge said of playing without Matthews. \"I probably talk to him more than anybody, so it's definitely different. But we've got guys out there that can go compete still.\""}
{"game_id": "0021400928", "chunk_id": "0021400928_007", "order": 7, "role": "body", "text": "Damian Lillard had 32 points, eight assists and seven rebounds for Portland, which had won five straight. Aldridge added 21 points and eight boards for the Blazers (41-20), who started the night in the third seed, just ahead of Houston and the Clippers."}
{"game_id": "0021400928", "chunk_id": "0021400928_008", "order": 8, "role": "body", "text": "Arron Afflalo had 14 points on 5-for-12 shooting in his first start in place of Matthews, one of Portland's emotional leaders."}
{"game_id": "0021400928", "chunk_id": "0021400928_009", "order": 9, "role": "body", "text": "The Blazers are missing one of the most dependable and consistent cogs from a starting five that complements each other so well. Matthews is one of the team's best 3-point shooters, can create major problems for a defense with his ability to post up smaller guards and is a staunch defender on the perimeter with a rare combination of size, quickness and instincts."}
{"game_id": "0021400928", "chunk_id": "0021400928_010", "order": 10, "role": "body", "text": "On top of it all, he was one of the most durable Blazers, having played in 142 straight games before sitting out Saturday night. To put it simply, he's just always there for Portland."}
{"game_id": "0021400928", "chunk_id": "0021400928_011", "order": 11, "role": "body", "text": "\"I think Wes is one of the underrated shooting guards in this league,\" Neal said. \"He does it all. He can defend, he can post up, he can knock down the open 3. They're definitely going to miss him.\""}
{"game_id": "0021400928", "chunk_id": "0021400928_012", "order": 12, "role": "body", "text": "Now that Matthews is done for the season, the Blazers are working on getting the recently acquired Afflalo up to speed. Afflalo has a similar skill set to Matthews, though he doesn't shoot quite as many 3s. But the biggest challenge for Afflalo is finding his role in a starting group that had such good chemistry."}
{"game_id": "0021400928", "chunk_id": "0021400928_013", "order": 13, "role": "body", "text": "The Wolves opened the third quarter on an 18-7 run to turn a four-point deficit into a six-point lead. Wiggins and Martin did all the scoring, with the rookie putting up 10 points during the burst that got Minnesota rolling."}
{"game_id": "0021400928", "chunk_id": "0021400928_014", "order": 14, "role": "body", "text": "\"You don't have Wes Matthews, you know he was a huge part of our team,\" Lillard said. \"But at the same time I believe we've got guys that can come in and step up and still help us be an elite team.\""}
{"game_id": "0021400928", "chunk_id": "0021400928_017", "order": 17, "role": "body", "text": "Trail Blazers: Lillard scored 11 points in the final 48 seconds as the Wolves gave him free runs to the hoop while preventing 3-pointers. ... The Blazers' bench was outscored by Minnesota's 46-22."}
{"game_id": "0021400928", "chunk_id": "0021400928_018", "order": 18, "role": "body", "text": "Timberwolves: Garnett tied Kevin Willis for fifth on the career games played list with 1,424. ... Neal had a scare at practice on Thursday when he left with an injury the team thought was a broken hand. But X-rays showed only a bruise and he scored 11 straight at one point in the fourth quarter."}
{"game_id": "0021400928", "chunk_id": "0021400928_020", "order": 20, "role": "body", "text": "Portland went 14 of 27 on 3s to just 4 of 7 for the Wolves, but Rubio's shot was the biggest."}
{"game_id": "0021400928", "chunk_id": "0021400928_021", "order": 21, "role": "body", "text": "The Blazers had trimmed a seven-point deficit to four on a putback from Robin Lopez with 1:21 to play. But with the shot clock winding down and his defender sagging off him, Rubio drilled the jumper from the left wing, and the Wolves held on."}
{"game_id": "0021400928", "chunk_id": "0021400928_022", "order": 22, "role": "body", "text": "\"I've been working on that shot,\" Rubio said. \"Great situation in a great moment and I took it.\""}
{"game_id": "0021400928", "chunk_id": "0021400928_024", "order": 24, "role": "body", "text": "Trail Blazers: Host Houston on Wednesday."}
{"game_id": "0021400928", "chunk_id": "0021400928_025", "order": 25, "role": "closing", "text": "Timberwolves: Visit the Los Angeles Clippers on Monday."}
