{"game_id": "0021700859", "chunk_id": "0021700859_001", "order": 1, "role": "lead", "text": "CHICAGO --  The Toronto Raptors rolled into the All-Star break knowing the toughest part is yet to come. They'll take where they are at the moment -- staring down at the rest of the Eastern Conference."}
{"game_id": "0021700859", "chunk_id": "0021700859_002", "order": 2, "role": "body", "text": "Kyle Lowry had 20 points and 10 assists, Serge Ibaka also scored 20 points and the Raptors cruised into the break with their seventh straight victory, 122-98 over the Chicago Bulls on Wednesday night."}
{"game_id": "0021700859", "chunk_id": "0021700859_003", "order": 3, "role": "body", "text": "\"We just have to keep it going,\" coach Dwane Casey said. \"We haven't done anything. ... It's even harder from here on out, and that's why (we're) not jumping up and down. We have a goal. We haven't finished it yet.\""}
{"game_id": "0021700859", "chunk_id": "0021700859_004", "order": 4, "role": "body", "text": "Lowry made four 3-pointers, and he and Ibaka each had seven rebounds."}
{"game_id": "0021700859", "chunk_id": "0021700859_005", "order": 5, "role": "body", "text": "Jonas Valanciunas added 14 points and nine rebounds to help the Raptors complete a four-game sweep against Chicago even though they only got seven points from four-time All-Star DeMar DeRozan. But Toronto dished out a season-high 38 assists and shot just over 52 percent against a weak defense, sending the Bulls to their ninth loss in 11 games."}
{"game_id": "0021700859", "chunk_id": "0021700859_006", "order": 6, "role": "body", "text": "\"We're heading in the right direction,\" DeRozan said. \"But at the same time, we still understand how much we need to clean up on the defensive end and the offensive end. As long as we keep that mindset anytime we step out there, whether it's a practice or a game. We understand we're trying to get better. It kind of carries us.\""}
{"game_id": "0021700859", "chunk_id": "0021700859_007", "order": 7, "role": "body", "text": "Bobby Portis scored 18 points for Chicago, and Lauri Markkanen had 14. The Bulls were simply overmatched by the Eastern Conference leaders, even though they had point guard Kris Dunn back in the lineup. He finished with eight points and three assists in 20 minutes after missing 11 games because of a concussion."}
{"game_id": "0021700859", "chunk_id": "0021700859_008", "order": 8, "role": "body", "text": "\"Poor effort,\" coach Fred Hoiberg said. \"I talked to the guys, win or lose you got to walk in the locker room after the game and look each other in the eye and say you were the harder playing team. We were not tonight.\""}
{"game_id": "0021700859", "chunk_id": "0021700859_010", "order": 10, "role": "body", "text": "The Raptors took a 61-49 lead to the locker room after outscoring the Bulls by 18 in the second quarter."}
{"game_id": "0021700859", "chunk_id": "0021700859_011", "order": 11, "role": "body", "text": "DeRozan ended a quiet first half with a neat 12-footer, faking David Nwaba and Justin Holiday while leaning in for the basket as time expired."}
{"game_id": "0021700859", "chunk_id": "0021700859_012", "order": 12, "role": "body", "text": "The Raptors continued to pull away in the third. Lowry converted a four-point play and answered a three-point play by Markkanen by nailing another 3 to make it 75-57 three minutes into the quarter."}
{"game_id": "0021700859", "chunk_id": "0021700859_014", "order": 14, "role": "body", "text": "\"It's one of those things that's honestly like a dream come true. I'm pretty sure once I get around the whole atmosphere and see what it's like, it's going to be (special).\" -- DeRozan on playing the All-Star game in his hometown, Los Angeles."}
{"game_id": "0021700859", "chunk_id": "0021700859_016", "order": 16, "role": "body", "text": "Dunn gave his conditioning \"about a C-plus,\" which was what he expected in his first game since Jan. 17."}
{"game_id": "0021700859", "chunk_id": "0021700859_017", "order": 17, "role": "body", "text": "He said his legs were \"a little heavy,\" and he'll work on that over the break. He is also looking forward to playing in the Rising Stars Challenge during All-Star weekend, particularly since he struggled as a rookie with Minnesota last season."}
{"game_id": "0021700859", "chunk_id": "0021700859_018", "order": 18, "role": "body", "text": "\"It's a blessing,\" he said. \"From where I was last year to be able to fight back and work hard and to be recognized. For my family to be there, to fly out to Cali with me, it's just a blessing. I appreciate everybody, my teammates and coaching staff.\""}
{"game_id": "0021700859", "chunk_id": "0021700859_019", "order": 19, "role": "body", "text": "Acquired with Zach LaVine and Markkanen in the trade that sent Jimmy Butler to the Timberwolves, Dunn is averaging 13.5 points and 6.3 assists."}
{"game_id": "0021700859", "chunk_id": "0021700859_021", "order": 21, "role": "body", "text": "Raptors: The Raptors swept Chicago for the first time since the 2001-02 season and won their fifth straight against the Bulls.  ... Lowry has 16 double-doubles. ... Ibaka has seven games with 20 or more points."}
{"game_id": "0021700859", "chunk_id": "0021700859_022", "order": 22, "role": "body", "text": "Bulls: Markkanen has scored in double figures in 21 straight games. ... The Bulls were 4 of 24 on 3-pointers after making at least eight in a franchise-record 24 straight games. ... Bulls reserves were outscored 56-47."}
{"game_id": "0021700859", "chunk_id": "0021700859_024", "order": 24, "role": "body", "text": "Raptors: Host Milwaukee on Feb. 23."}
{"game_id": "0021700859", "chunk_id": "0021700859_025", "order": 25, "role": "body", "text": "Bulls: Host Philadelphia on Feb. 22."}
{"game_id": "0021700859", "chunk_id": "0021700859_027", "order": 27, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
