{"game_id": "0021700639", "chunk_id": "0021700639_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Just as the Philadelphia 76ers were letting yet another big lead slip away, a leak in their locker room sent water spilling into the hallway."}
{"game_id": "0021700639", "chunk_id": "0021700639_002", "order": 2, "role": "body", "text": "Sixers employees stopped the stream before it reached the court, and the players prevented a fourth-quarter gusher from washing away another sure win."}
{"game_id": "0021700639", "chunk_id": "0021700639_003", "order": 3, "role": "body", "text": "Joel Embiid had 34 points and 11 rebounds and Philadelphia held off the cold-shooting Toronto Raptors 117-111 on Monday."}
{"game_id": "0021700639", "chunk_id": "0021700639_004", "order": 4, "role": "body", "text": "\"Look at some of the things we ended up doing at the end of the game. All we really had to do was dribble it out and instead we're playing volleyball,\" Sixers coach Brett Brown said before lamenting his team's seven fourth-quarter turnovers. \"That's the stuff that keeps me up really, really late at night.\""}
{"game_id": "0021700639", "chunk_id": "0021700639_005", "order": 5, "role": "body", "text": "T.J. McConnell added a career-high 18 points and eight assists and JJ Redick scored 15 before leaving with a left leg injury for the Sixers, who never trailed and shook off Ben Simmons' foul trouble to win for the fifth time in six games."}
{"game_id": "0021700639", "chunk_id": "0021700639_006", "order": 6, "role": "body", "text": "The Sixers blew a 22-point lead in a loss to Boston in London in their last game and coughed up a 22-point lead in a loss in Toronto's previous visit last month."}
{"game_id": "0021700639", "chunk_id": "0021700639_007", "order": 7, "role": "body", "text": "\"We've been in this type of position a lot this year,\" Embiid said."}
{"game_id": "0021700639", "chunk_id": "0021700639_008", "order": 8, "role": "body", "text": "Embiid and his teammates were forced to take a different tunnel to the dressing room after the game, and the room was off-limits to reporters. But the Sixers did just enough to make the players less grumpy about the hassle."}
{"game_id": "0021700639", "chunk_id": "0021700639_009", "order": 9, "role": "body", "text": "They saw a 21-point lead cut to 102-101 on DeMar DeRozan's 3-pointer with 3:01 left. Simmons responded with a driving layup and Dario Saric hit a 3 on the next possession to get the lead back to six."}
{"game_id": "0021700639", "chunk_id": "0021700639_010", "order": 10, "role": "body", "text": "Embiid hit four free throws in the final 25.3 seconds to put it away as he motioned for the crowd to get to its feet."}
{"game_id": "0021700639", "chunk_id": "0021700639_011", "order": 11, "role": "body", "text": "\"The big fella was great,\" McConnell said."}
{"game_id": "0021700639", "chunk_id": "0021700639_012", "order": 12, "role": "body", "text": "DeRozan scored 24 points and Kyle Lowry struggled in his return from a three-game absence because of a bruised tailbone. The Raptors lost backup guard Fred VanVleet to a right knee injury early in the fourth quarter in their second straight loss."}
{"game_id": "0021700639", "chunk_id": "0021700639_013", "order": 13, "role": "body", "text": "\"A tough game,\" said Lowry, who had 13 points on 3-of-16 shooting."}
{"game_id": "0021700639", "chunk_id": "0021700639_014", "order": 14, "role": "body", "text": "The Raptors missed their first 10 3-point attempts, and shot 40 percent from the field, two days after a narrow loss to Golden State followed a blowout win over Cleveland."}
{"game_id": "0021700639", "chunk_id": "0021700639_015", "order": 15, "role": "body", "text": "\"We have to get our motors going no matter who we play. It can't just be Cleveland or Golden State,\" Raptors coach Dwane Casey said."}
{"game_id": "0021700639", "chunk_id": "0021700639_016", "order": 16, "role": "body", "text": "Lowry and Simmons, who had 12 points and six turnovers, were ejected with 6.5 seconds left after a dustup near midcourt. No punches were thrown in the game that included six technical fouls."}
{"game_id": "0021700639", "chunk_id": "0021700639_017", "order": 17, "role": "body", "text": "\"I don't play around,\" Simmons said. \"I'm not going to take (crap) from anybody.\""}
{"game_id": "0021700639", "chunk_id": "0021700639_018", "order": 18, "role": "body", "text": "The Sixers led 59-43 before the Raptors closed a dismal first half on a 6-0 run. Unable to stop Embiid (18 points) and unable to shoot from the outside (0 of 7 from 3-point range), the Raptors couldn't take advantage of Simmons missing the final seven minutes with three fouls."}
{"game_id": "0021700639", "chunk_id": "0021700639_019", "order": 19, "role": "body", "text": "Simmons picked up his fourth foul 24 seconds into the third quarter but stayed in, and the Sixers built a 21-point lead with the help of technical fouls against VanVleet and Casey."}
{"game_id": "0021700639", "chunk_id": "0021700639_020", "order": 20, "role": "body", "text": "\"Consistency in our league unbelievable,\" Casey said of the officiating. \"We've got to get that under control because one night it's one thing and another night it's another thing.\""}
{"game_id": "0021700639", "chunk_id": "0021700639_021", "order": 21, "role": "body", "text": "VanVleet crashed to the floor under the basket early in the fourth quarter and didn't return."}
{"game_id": "0021700639", "chunk_id": "0021700639_023", "order": 23, "role": "body", "text": "Raptors: Lowry told the team he was ready to play after pregame warmups. ... DeRozan and McConnell each received technical fouls in the second quarter. McConnell jumped up after DeRozan's hard foul and the two had to be separated."}
{"game_id": "0021700639", "chunk_id": "0021700639_024", "order": 24, "role": "body", "text": "76ers: Embiid had seven of the Sixers' 21 turnovers. It was his seventh 30-point game of the season. ... There was no update on Redick, who came up lame after he caught a pass and limped to the locker room. ... Reserve C Richaun Holmes (illness) didn't dress. ... The Sixers after the game signed G Demetrius Jackson to a two-way contract and waived F James Michael McAdoo."}
{"game_id": "0021700639", "chunk_id": "0021700639_026", "order": 26, "role": "body", "text": "A taped tribute to Dr. Martin Luther King Jr. from former Sixers great Julius Erving was shown during the first timeout."}
{"game_id": "0021700639", "chunk_id": "0021700639_028", "order": 28, "role": "body", "text": "Raptors: Host Detroit on Wednesday night."}
{"game_id": "0021700639", "chunk_id": "0021700639_029", "order": 29, "role": "body", "text": "76ers: Visit Boston on Thursday night."}
{"game_id": "0021700639", "chunk_id": "0021700639_031", "order": 31, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
