{"game_id": "0021201123", "chunk_id": "0021201123_001", "order": 1, "role": "lead", "text": "NEW YORK --  Down five key players. Down 16 points. A lot for any team to overcome."}
{"game_id": "0021201123", "chunk_id": "0021201123_002", "order": 2, "role": "body", "text": "These Chicago Bulls are used to it."}
{"game_id": "0021201123", "chunk_id": "0021201123_003", "order": 3, "role": "body", "text": "\"We fight to the end,\" forward Carlos Boozer said. \"We've got some resilient guys in here.\""}
{"game_id": "0021201123", "chunk_id": "0021201123_004", "order": 4, "role": "body", "text": "Boozer had 29 points and 18 rebounds, Nate Robinson made the go-ahead basket with 22 seconds left, and the Bulls rallied to beat the Brooklyn Nets 92-90 on Thursday night in a potential preview of a first-round playoff series."}
{"game_id": "0021201123", "chunk_id": "0021201123_005", "order": 5, "role": "body", "text": "Jimmy Butler had 16 points and 10 rebounds, Luol Deng scored 18 points, and Robinson finished with 12 as the Bulls shook off the absences of the injured players to keep Indiana from clinching the Central Division title they've won the last two years."}
{"game_id": "0021201123", "chunk_id": "0021201123_006", "order": 6, "role": "body", "text": "Chicago pulled into a tie for fifth place with Atlanta and climbed within 1 ½ games of the Nets for the No. 4 seed and home-court advantage in the first round."}
{"game_id": "0021201123", "chunk_id": "0021201123_007", "order": 7, "role": "body", "text": "And the Bulls did it without Derrick Rose, Joakim Noah, Taj Gibson, Richard Hamilton and Marco Belinelli, all starters or key members of their rotation. Plus, they lost starting point guard Kirk Hinrich to fouls with 3:38 remaining."}
{"game_id": "0021201123", "chunk_id": "0021201123_008", "order": 8, "role": "body", "text": "But they made more clutch plays down the stretch to pull out a game they never led until the final period."}
{"game_id": "0021201123", "chunk_id": "0021201123_009", "order": 9, "role": "body", "text": "\"For us, it's big,\" Robinson said. \"Kirk fouled out. You got Marco out. Rip out. D-Rose out. Taj out. Guys are just stepping up, man, and that's what teams do. You got Jo out and (Nazr Mohammed) stepping in for him. These guys are coming in and it's like old school wrestling. Tag team. You know when one guy goes in, tag him, the other guy go out. Back and forth. We just got to keep playing and keep doing that, we'll be OK.\""}
{"game_id": "0021201123", "chunk_id": "0021201123_010", "order": 10, "role": "body", "text": "Deron Williams had 30 points and 10 assists for the Nets, who had a disappointing return home from an eight-game road trip. Brook Lopez finished with 28 points, but he had a turnover and two misses in the final minute, including a corner jumper that went in and out that would have forced overtime."}
{"game_id": "0021201123", "chunk_id": "0021201123_011", "order": 11, "role": "body", "text": "\"It's tough, just because our team was playing so well for the majority of the game and I contributed a lot to how the final score ended up and that's definitely not something I'm happy about,\" Lopez said."}
{"game_id": "0021201123", "chunk_id": "0021201123_012", "order": 12, "role": "body", "text": "The Nets took a 67-65 lead into the fourth when Hinrich fouled Williams behind the 3-point line with 0.3 seconds left in the third, an inexcusable way to pick up his fifth, and Williams made two of the three free throws."}
{"game_id": "0021201123", "chunk_id": "0021201123_013", "order": 13, "role": "body", "text": "Chicago finally took its first lead at 69-67 on Deng's basket 1:16 into the fourth and it was a four-point game either way from there. Williams gave the Nets a three-point lead with 52 seconds remaining, but Deng made a long jumper from the corner and Robinson turned Lopez's bad pass into a floater that put Chicago ahead 91-90 with 22 seconds left."}
{"game_id": "0021201123", "chunk_id": "0021201123_014", "order": 14, "role": "body", "text": "Lopez missed and Daequan Cook made a free throw to make it 92-90 with 5.5 seconds to play. Williams drove into the lane on the Nets' final possession and kicked it to a wide-open Lopez, but his jumper bounced out."}
{"game_id": "0021201123", "chunk_id": "0021201123_015", "order": 15, "role": "body", "text": "Joe Johnson, back in the starting lineup after missing five games with a sore left heel, scored 12 points in the Nets' first home game since March 17. They went 5-3 on their road trip and seemed headed toward an easy victory in their return home."}
{"game_id": "0021201123", "chunk_id": "0021201123_016", "order": 16, "role": "body", "text": "\"It's tough. This is a game that we desperately needed considering where we are in the standings at this point, and in the first half we were pretty good,\" Johnson said. \"And in the second half I just didn't think we pushed the ball as much as we did in the first and play as loose as we did in the first and it hurt us.\""}
{"game_id": "0021201123", "chunk_id": "0021201123_017", "order": 17, "role": "body", "text": "The Nets scored the first eight points, six by Lopez, and increased it to 18-4 as Chicago missed 10 of its first 12 shots. Lopez made his first six shots, was 8 of 9 for 18 points in the first quarter, and Brooklyn was ahead 26-13. He was only 1 of 4 in the second as the Bulls' defense tightened, and the Nets took a 47-36 lead to halftime."}
{"game_id": "0021201123", "chunk_id": "0021201123_018", "order": 18, "role": "body", "text": "Chicago kept chipping away in the third, finally tying it at 65 on Butler's 3-pointer with 3.6 seconds left in the third."}
{"game_id": "0021201123", "chunk_id": "0021201123_019", "order": 19, "role": "body", "text": "Seemingly always battling injuries, the Bulls reported some good news Thursday when coach Tom Thibodeau said Gibson's knee injury from Tuesday in Washington was just a slight sprain. Gibson had recently missed 10 games with a sprained ligament and felt similar pain when he was hurt Tuesday, but Thibodeau said he is day to day."}
{"game_id": "0021201123", "chunk_id": "0021201123_020", "order": 20, "role": "body", "text": "He also said Rose looks better and more comfortable on the court, and is just waiting for when the former league MVP feels he is ready to go after missing all season while recovering from major knee surgery."}
{"game_id": "0021201123", "chunk_id": "0021201123_021", "order": 21, "role": "body", "text": "The Bulls remain tough to beat even without him."}
{"game_id": "0021201123", "chunk_id": "0021201123_022", "order": 22, "role": "closing", "text": "Game notes Chicago won the season series 3-1 and is a game behind the Nets in the loss column for the fourth spot. ... Gerald Wallace was back in the Nets' lineup after missing one game with a sore left foot, scoring four points."}
