{"game_id": "0021400847", "chunk_id": "0021400847_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Michael Carter-Williams ran into a wall of taller defenders on a drive into the lane and curled a pass into the corner to an open teammate."}
{"game_id": "0021400847", "chunk_id": "0021400847_002", "order": 2, "role": "body", "text": "Khris Middleton drained a 3-pointer -- just the kind of play the Milwaukee Bucks were hoping to get when they traded for the promising point guard from the Philadelphia 76ers."}
{"game_id": "0021400847", "chunk_id": "0021400847_003", "order": 3, "role": "body", "text": "John Henson scored 21 points, Carter-Williams had seven points and eight assists in his Milwaukee debut and the Bucks beat Philadelphia 104-88 on Wednesday night."}
{"game_id": "0021400847", "chunk_id": "0021400847_004", "order": 4, "role": "body", "text": "\"I think I did pretty good. The minutes I was in there I found the open guy, took care of the ball and just tried to find these guys and get them open shots,\" Carter-Williams said."}
{"game_id": "0021400847", "chunk_id": "0021400847_005", "order": 5, "role": "body", "text": "Middleton added 19 points for Milwaukee, which led by as many as 29. Jason Richardson scored 16 for the 76ers, who lost their fifth straight game."}
{"game_id": "0021400847", "chunk_id": "0021400847_006", "order": 6, "role": "body", "text": "It's not going to get any easier without Carter-Williams."}
{"game_id": "0021400847", "chunk_id": "0021400847_007", "order": 7, "role": "body", "text": "\"I spent quality time with him and saw him grow on many levels,\" Sixers coach Brett Brown said about a pregame meeting with the guard. \"To come here and see him in a different uniform was awkward.\""}
{"game_id": "0021400847", "chunk_id": "0021400847_008", "order": 8, "role": "body", "text": "Carter-Williams went from one of the NBA's worst teams to a surprising upstart vying for the playoffs. The 6-foot-6 floor general broke down defenders and used his long arms to guard on the perimeter."}
{"game_id": "0021400847", "chunk_id": "0021400847_009", "order": 9, "role": "body", "text": "\"I didn't think he forced anything. I think he let the game come to him,\" coach Jason Kidd said."}
{"game_id": "0021400847", "chunk_id": "0021400847_010", "order": 10, "role": "body", "text": "The addition of Carter-Williams also moved Jerryd Bayless back to his regular role as a spark off the bench. Bayless, who finished with 13 points, and Henson were instrumental reserves in a 32-point second quarter that ended with the Bucks leading 61-32 at halftime."}
{"game_id": "0021400847", "chunk_id": "0021400847_013", "order": 13, "role": "body", "text": "Philadelphia looked lost early in its final stop on a three-game road trip before rallying late at a listless Bradley Center. Fans were lulled by a sloppy game that was never close after the opening minutes."}
{"game_id": "0021400847", "chunk_id": "0021400847_014", "order": 14, "role": "body", "text": "The Sixers couldn't recover from a first quarter in which they shot 5 of 20 and committed nine turnovers."}
{"game_id": "0021400847", "chunk_id": "0021400847_015", "order": 15, "role": "body", "text": "\"You are playing against a really good defensive team that is extremely long,\" Brown said. \"You get a bunch of new guys crashing into each other. So you turn it over.\""}
{"game_id": "0021400847", "chunk_id": "0021400847_016", "order": 16, "role": "body", "text": "Carter-Williams and rangy 6-foot-11 forward Giannis Antetokounmpo each had two steals in the opening 6-plus minutes to set the early defensive tone for Milwaukee."}
{"game_id": "0021400847", "chunk_id": "0021400847_018", "order": 18, "role": "body", "text": "Philadelphia started a backcourt of Isaiah Canaan and Richardson in facing its former point guard, with the duo combining for eight assists -- matching Carter-Williams' total through three quarters."}
{"game_id": "0021400847", "chunk_id": "0021400847_019", "order": 19, "role": "body", "text": "Carter-Williams, returning from a six-game absence for a strained right foot, played 17 minutes and sat out the fourth quarter. The Bucks acquired him at the trade deadline in part for his heady play and potential as a distributor."}
{"game_id": "0021400847", "chunk_id": "0021400847_020", "order": 20, "role": "body", "text": "He must have made Kidd, a former All-Star point guard, proud when he drove past defenders into the lane before finding Middleton for a 3 and a 69-44 lead with about 6:40 left in the third quarter."}
{"game_id": "0021400847", "chunk_id": "0021400847_021", "order": 21, "role": "body", "text": "\"Being 23 years old, he was leading his guys, talking to them throughout the game. All good stuff,\" Kidd said."}
{"game_id": "0021400847", "chunk_id": "0021400847_022", "order": 22, "role": "body", "text": "Carter-Williams showed flashes of emotion. He shouted \"Let's go!\" and pumped his arms after his second dunk of the first quarter."}
{"game_id": "0021400847", "chunk_id": "0021400847_024", "order": 24, "role": "body", "text": "76ers: F Thomas Robinson played his first game with Philadelphia since being signed off waivers Monday. Denver had acquired Robinson in a trade-deadline deal with Portland. Brown said about two hours before the game that he would use the latest addition to Philadelphia's ever-changing roster even if Robinson hadn't arrived at the Bradley Center yet from the airport. \"We're not bashful,\" Brown said. Robinson finished with seven points and six rebounds in 13 minutes."}
{"game_id": "0021400847", "chunk_id": "0021400847_025", "order": 25, "role": "body", "text": "Bucks: Brown said the Bucks were \"very fortunate\" to get Carter-Williams. He planned to speak with his former point guard on the floor before the game, likening it to \"seeing your old girlfriend.\" ... Henson had nine points on 4-of-5 shooting and five rebounds in the opening 8-plus minutes of the decisive second quarter."}
{"game_id": "0021400847", "chunk_id": "0021400847_027", "order": 27, "role": "body", "text": "76ers: Host Washington on Friday."}
{"game_id": "0021400847", "chunk_id": "0021400847_028", "order": 28, "role": "closing", "text": "Bucks: At the Los Angeles Lakers on Friday."}
