{"game_id": "0021701015", "chunk_id": "0021701015_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  The Los Angeles Lakers dropped their previous two games against the Denver Nuggets."}
{"game_id": "0021701015", "chunk_id": "0021701015_002", "order": 2, "role": "body", "text": "This time, they closed with a flourish."}
{"game_id": "0021701015", "chunk_id": "0021701015_003", "order": 3, "role": "body", "text": "Isaiah Thomas scored 12 of his 23 points in the fourth quarter, and the Lakers rallied to beat the Nuggets 112-103 on Tuesday night."}
{"game_id": "0021701015", "chunk_id": "0021701015_004", "order": 4, "role": "body", "text": "\"It was a tough, physical game and we were the tougher team,\" Thomas said. \"We definitely took that from them.\""}
{"game_id": "0021701015", "chunk_id": "0021701015_005", "order": 5, "role": "body", "text": "Julius Randle and Kyle Kuzma each had 26 points and 13 rebounds for Los Angeles, which trailed by as many as 13. Kuzma had only two points in the first half."}
{"game_id": "0021701015", "chunk_id": "0021701015_006", "order": 6, "role": "body", "text": "Kuzma sprained his right ankle in the final seconds of the third quarter and left the game to get it re-taped. But he returned in time to help the Lakers to their third win in four games, including a 127-113 victory over LeBron James and Cleveland on Sunday night."}
{"game_id": "0021701015", "chunk_id": "0021701015_007", "order": 7, "role": "body", "text": "\"He showed a lot of toughness,\" Lakers coach Luke Walton said. \"He sprained the ankle and kept telling me, `Coach, I'm ready to go, I'm ready to go.' I put him back eventually and he helped us close out that game.\""}
{"game_id": "0021701015", "chunk_id": "0021701015_008", "order": 8, "role": "body", "text": "Wilson Chandler had 26 points and 10 rebounds for Denver, which beat Los Angeles 125-116 on Friday night. Jamal Murray finished with 18 points, six rebounds and four assists."}
{"game_id": "0021701015", "chunk_id": "0021701015_009", "order": 9, "role": "body", "text": "Chandler's layup with 2:21 left in the third gave Denver an 80-67 lead, but the Nuggets couldn't hold on."}
{"game_id": "0021701015", "chunk_id": "0021701015_010", "order": 10, "role": "body", "text": "\"I thought we had some guys out there in that end of the third quarter that were not ready to play,\" Nuggets coach Mike Malone said. \"That hurt us to close that quarter in a big way.\""}
{"game_id": "0021701015", "chunk_id": "0021701015_011", "order": 11, "role": "body", "text": "Thomas' 3-pointer trimmed Denver's advantage to 84-83 with 9:45 to go. Thomas made two free throws with 8:24 remaining, sparking a key 9-0 run for Los Angeles."}
{"game_id": "0021701015", "chunk_id": "0021701015_012", "order": 12, "role": "body", "text": "After Chandler's 3 got the Nuggets within three with 2:38 remaining, Randle responded with a layup off a pass from Lonzo Ball. Thomas scored again and Randle had a big dunk to extend the lead to 108-99 with 1:09 left."}
{"game_id": "0021701015", "chunk_id": "0021701015_014", "order": 14, "role": "body", "text": "Ball had nine rebounds and a game-high eight assists, but finished with just five points on 2-for-11 shooting. He was 1 for 7 from 3-point range."}
{"game_id": "0021701015", "chunk_id": "0021701015_015", "order": 15, "role": "body", "text": "It was Ball's second consecutive poor shooting performance. He shot 2 of 11 against the Cavaliers, and made only one of his six 3-point attempts."}
{"game_id": "0021701015", "chunk_id": "0021701015_017", "order": 17, "role": "body", "text": "The Staples Center crowd booed Murray when he was introduced at the start of the game and every time he touched the ball. The crowd engaged in an anti-Murray chant late in the night."}
{"game_id": "0021701015", "chunk_id": "0021701015_018", "order": 18, "role": "body", "text": "The Lakers had run-ins with Murray in the previous two games they played in Denver. Back in December, Murray dribbled around Ball as time expired. On Friday, Walton had words for Murray after he displayed what the coach called \"disrespectful\" behavior."}
{"game_id": "0021701015", "chunk_id": "0021701015_019", "order": 19, "role": "body", "text": "Malone said before the game he told the team to not get caught up in any \"nonsense\" or \"shenanigans.\""}
{"game_id": "0021701015", "chunk_id": "0021701015_020", "order": 20, "role": "body", "text": "\"If we're worried about what's gonna happen tonight, then we're not focusing on the task at hand,\" Malone said. \"We have a job to do. Regardless of what their motivation is tonight, we have a job to do. We can't let them deter us from that.\""}
{"game_id": "0021701015", "chunk_id": "0021701015_022", "order": 22, "role": "body", "text": "Nuggets: Tied the Lakers at 44 in points in the paint. ... Nikola Jokic added 15 points, nine rebound and five assists."}
{"game_id": "0021701015", "chunk_id": "0021701015_023", "order": 23, "role": "body", "text": "Lakers: Brook Lopez and Randle scored the first 19 points for the Lakers. Lopez finished with 17. ... Kuzma made five of Los Angeles' 15 3-pointers."}
{"game_id": "0021701015", "chunk_id": "0021701015_025", "order": 25, "role": "body", "text": "Nuggets: Host the Detroit Pistons on Friday."}
{"game_id": "0021701015", "chunk_id": "0021701015_026", "order": 26, "role": "closing", "text": "Lakers: At the Golden State Warriors on Thursday in the second night of a back-to-back."}
