{"game_id": "0021700599", "chunk_id": "0021700599_001", "order": 1, "role": "lead", "text": "TORONTO --  Wayne Ellington leads Miami in 3-pointers, which made Tuesday's game-winning basket a bit of a surprise."}
{"game_id": "0021700599", "chunk_id": "0021700599_002", "order": 2, "role": "body", "text": "Ellington converted a go-ahead driving layup with less than a second remaining, and the Heat stopped Toronto's 12-game home winning streak with a 90-89 victory over the Raptors."}
{"game_id": "0021700599", "chunk_id": "0021700599_003", "order": 3, "role": "body", "text": "\"That's probably the last thing anybody would think that he would do is put the ball on the floor,\" Heat coach Erik Spoelstra said. \"I think it caught everybody by surprise, including me.\""}
{"game_id": "0021700599", "chunk_id": "0021700599_004", "order": 4, "role": "body", "text": "It was the only basket of the second half for Ellington, who finished with 15 points."}
{"game_id": "0021700599", "chunk_id": "0021700599_005", "order": 5, "role": "body", "text": "Ellington said he considered shooting after catching the inbounds pass from Goran Dragic, but decided to drive along the baseline past Toronto's Pascal Siakam before laying the ball in off the glass."}
{"game_id": "0021700599", "chunk_id": "0021700599_006", "order": 6, "role": "body", "text": "\"I looked at the rim and I saw him just charging hard,\" Ellington said. \"Obviously, that's what they wanted to take away from me, was that 3-ball in the corner. I was able to get loose, man, and get around him.\""}
{"game_id": "0021700599", "chunk_id": "0021700599_007", "order": 7, "role": "body", "text": "Like his coach, Dragic also was surprised when Ellington didn't launch a 3."}
{"game_id": "0021700599", "chunk_id": "0021700599_008", "order": 8, "role": "body", "text": "\"I thought he was going to shoot it but he made a great read,\" Dragic said."}
{"game_id": "0021700599", "chunk_id": "0021700599_009", "order": 9, "role": "body", "text": "Dragic had 24 points and matched his career high with 12 rebounds as Miami extended its season-best winning streak to five. Bam Adebayo had 16 points and a career-high 15 rebounds and Hassan Whiteside collected 13 points and 15 boards for the Heat, who had dropped their previous five visits to Toronto."}
{"game_id": "0021700599", "chunk_id": "0021700599_010", "order": 10, "role": "body", "text": "The Raptors were without point guard Kyle Lowry after the three-time All-Star bruised his tailbone during Monday's overtime win at Brooklyn."}
{"game_id": "0021700599", "chunk_id": "0021700599_011", "order": 11, "role": "body", "text": "DeMar DeRozan scored 25 points as the Raptors lost for the first time in six games and failed to break the franchise record for consecutive home victories. Serge Ibaka finished with 11 after he was ejected in the second half."}
{"game_id": "0021700599", "chunk_id": "0021700599_012", "order": 12, "role": "body", "text": "\"We let them get easy points,\" DeRozan said."}
{"game_id": "0021700599", "chunk_id": "0021700599_013", "order": 13, "role": "body", "text": "It was Toronto's first home loss since Nov. 5 against Washington, a game in which Lowry was ejected early in the second quarter. The Raptors are 14-2 at home."}
{"game_id": "0021700599", "chunk_id": "0021700599_014", "order": 14, "role": "body", "text": "Ibaka and Miami's James Johnson were ejected after trading punches at 7:50 of the third quarter. The skirmish began when the two started shoving one another while waiting for the ball to be inbounded under the Miami basket. Officials reviewed the incident before giving both players technical fouls and ejections."}
{"game_id": "0021700599", "chunk_id": "0021700599_015", "order": 15, "role": "body", "text": "\"It certainly felt like there was something at stake from the very tip, and that's the way it should be in this league,\" Spoelstra said. \"There was a physicality, an edge to the game.\""}
{"game_id": "0021700599", "chunk_id": "0021700599_016", "order": 16, "role": "body", "text": "Tempers flared again after the final whistle, with DeRozan appearing to yell at Dragic as the teams left the court."}
{"game_id": "0021700599", "chunk_id": "0021700599_017", "order": 17, "role": "body", "text": "\"Nothing special,\" Dragic said. \"Just exchanged some words. No big deal.\""}
{"game_id": "0021700599", "chunk_id": "0021700599_018", "order": 18, "role": "body", "text": "Miami guard Tyler Johnson, who had started the previous 10 games, was unavailable after he strained his left shoulder at shootaround. His status for Wednesday's game at Indiana was not known."}
{"game_id": "0021700599", "chunk_id": "0021700599_020", "order": 20, "role": "body", "text": "Heat: Miami outrebounded Toronto 64-37. ... Improved to 14-3 when holding opponents below 100 points. ... Ellington had three of Miami's four 3-pointers."}
{"game_id": "0021700599", "chunk_id": "0021700599_021", "order": 21, "role": "body", "text": "Raptors: The Raptors also won 12 straight at home from Jan. 18 to Mar 4, 2016. ... The loss ended Toronto's streak of 12 straight wins over Eastern Conference opponents."}
{"game_id": "0021700599", "chunk_id": "0021700599_023", "order": 23, "role": "body", "text": "It was Miami's second straight one-point win. The Heat beat Utah 103-102 on Sunday thanks to Josh Richardson's layup with five seconds left. Miami's previous win was an overtime victory over the Knicks."}
{"game_id": "0021700599", "chunk_id": "0021700599_025", "order": 25, "role": "body", "text": "Heat: Visit Indiana on Wednesday. The Heat have lost 10 straight road games against the Pacers"}
{"game_id": "0021700599", "chunk_id": "0021700599_026", "order": 26, "role": "body", "text": "Raptors: Begin a two-game stretch against recent NBA finalists by hosting Cleveland on Thursday. Golden State will visit Toronto on Saturday."}
{"game_id": "0021700599", "chunk_id": "0021700599_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
