{"game_id": "0021201102", "chunk_id": "0021201102_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Larry Sanders' latest career night led to a big scoring night for the Milwaukee Bucks."}
{"game_id": "0021201102", "chunk_id": "0021201102_002", "order": 2, "role": "body", "text": "Sanders had a career-high 24 points and 13 rebounds as Milwaukee cruised to a 131-102 victory over the Charlotte Bobcats on Monday night for the Bucks' highest total in more than four years."}
{"game_id": "0021201102", "chunk_id": "0021201102_003", "order": 3, "role": "body", "text": "\"It's working out pretty well,\" said Sanders, who had set his previous career scoring high of 21 on Thursday in a win over the Los Angeles Lakers. \"I am just trying to stay active. My teammates are doing a great job of finding me down there, trusting me to finish plays, and I'm shooting the ball when I'm open.\""}
{"game_id": "0021201102", "chunk_id": "0021201102_004", "order": 4, "role": "body", "text": "Monta Ellis had 19 points, a career-high 14 assists and six steals to help Milwaukee pull 1 1/2 games behind seventh-place Boston in the Eastern Conference playoff race. The Celtics lost to Minnesota on Monday."}
{"game_id": "0021201102", "chunk_id": "0021201102_005", "order": 5, "role": "body", "text": "Ersan Ilyasova added 22 points for the Bucks, and J.J. Redick scored 20, 16 in the second half. Brandon Jennings had 19, as Milwaukee, which had lost five of six, remained solidly in the eighth position in the East, with a six-game lead over idle Philadelphia."}
{"game_id": "0021201102", "chunk_id": "0021201102_006", "order": 6, "role": "body", "text": "Kemba Walker scored 27 points to lead the Bobcats, and Gerald Henderson had 17."}
{"game_id": "0021201102", "chunk_id": "0021201102_007", "order": 7, "role": "body", "text": "Charlotte came in allowing 47.3 percent shooting and 103.1 points per game -- second-worst in the league in both categories -- and it showed."}
{"game_id": "0021201102", "chunk_id": "0021201102_008", "order": 8, "role": "body", "text": "The Bucks never trailed after early in the first quarter, led 69-60 at halftime and 100-84 after the third quarter en route to their largest scoring output since a 133-99 win over Dallas on Jan. 21, 2009."}
{"game_id": "0021201102", "chunk_id": "0021201102_009", "order": 9, "role": "body", "text": "Charlotte has lost five of six and dropped to 1-15 all-time at the BMO Harris Bradley Center."}
{"game_id": "0021201102", "chunk_id": "0021201102_010", "order": 10, "role": "body", "text": "\"We made shots too easy for them,\" Henderson said. \"Obviously, they've got some really quick guards who can get into the lane, and that's what they were doing and either finishing or kicking out for 3s."}
{"game_id": "0021201102", "chunk_id": "0021201102_011", "order": 11, "role": "body", "text": "\"We just couldn't play any defense. You ain't gonna beat nobody giving up 130 points.\""}
{"game_id": "0021201102", "chunk_id": "0021201102_012", "order": 12, "role": "body", "text": "Offense came easy for both teams."}
{"game_id": "0021201102", "chunk_id": "0021201102_013", "order": 13, "role": "body", "text": "Sanders had 16 in the first half, as the Bucks shot 54 percent (28 of 52). Milwaukee outscored Charlotte 40-35 in the second quarter."}
{"game_id": "0021201102", "chunk_id": "0021201102_014", "order": 14, "role": "body", "text": "Jennings and Ilyasova each had 15 points in the half."}
{"game_id": "0021201102", "chunk_id": "0021201102_015", "order": 15, "role": "body", "text": "The Bobcats trailed despite shooting 63 percent (22 of 35) in the first two quarters. Gordon, coming off a scoreless game against Philadelphia on Saturday, had all 14 of his points in the second quarter. Walker also had 14 in the period for Charlotte."}
{"game_id": "0021201102", "chunk_id": "0021201102_016", "order": 16, "role": "body", "text": "It was much the same in the second half, as the Bucks tallied 31 in both the third and fourth quarters and shot 51 percent (51 of 100) for the game with 32 assists. Milwaukee led by 33 in the fourth quarter."}
{"game_id": "0021201102", "chunk_id": "0021201102_017", "order": 17, "role": "body", "text": "\"It was just one of those nights where everything was clicking for us,\" Ellis said. \"Hopefully we can continue that.\""}
{"game_id": "0021201102", "chunk_id": "0021201102_018", "order": 18, "role": "body", "text": "Ellis had 16 points in the second half."}
{"game_id": "0021201102", "chunk_id": "0021201102_019", "order": 19, "role": "body", "text": "\"When he got to the lane, he found his guys and they made shots,\" Walker said. \"He pretty much dominated the game.\""}
{"game_id": "0021201102", "chunk_id": "0021201102_020", "order": 20, "role": "body", "text": "Bucks coach Jim Boylan called Ellis' performance \"unbelievable.\""}
{"game_id": "0021201102", "chunk_id": "0021201102_021", "order": 21, "role": "body", "text": "\"His intensity level is extremely high,\" Boylan said. \"He's playing as hard as he can play and he's doing a whole bunch of things at both ends of the floor. You can't really ask a guy to give you much more than he's giving you right now.\""}
{"game_id": "0021201102", "chunk_id": "0021201102_022", "order": 22, "role": "body", "text": "The same could be said of Sanders."}
{"game_id": "0021201102", "chunk_id": "0021201102_023", "order": 23, "role": "body", "text": "\"He is rolling to the basket more,\" Ellis said. \"He is setting a screen and getting off of it. He is just taking his opportunity.\""}
{"game_id": "0021201102", "chunk_id": "0021201102_025", "order": 25, "role": "body", "text": "Charlotte played without forward Michael Kidd-Gilchrist, who had \"to take care of some personal business at home,\" Charlotte coach Mike Dunlap said before the game."}
{"game_id": "0021201102", "chunk_id": "0021201102_026", "order": 26, "role": "body", "text": "Kidd-Gilchrist, the second overall pick in the 2012 NBA draft, was coming off one of his better nights as a pro, with 21 points on 9-of-11 shooting and nine rebounds against Philadelphia on Saturday. Also, center Byron Mullens missed his third straight game with a sore left ankle, center Brendan Haywood missed his ninth straight with a left foot stress reaction, and guard Ramon Sessions missed his 13th with a sprained medial collateral ligament in his left knee."}
{"game_id": "0021201102", "chunk_id": "0021201102_027", "order": 27, "role": "body", "text": "Milwaukee was without forward Luc Richard Mbah a Moute, who missed the game due to an undisclosed illness."}
{"game_id": "0021201102", "chunk_id": "0021201102_028", "order": 28, "role": "body", "text": "Jennings didn't play in the fourth quarter, but he said he wasn't upset about it."}
{"game_id": "0021201102", "chunk_id": "0021201102_029", "order": 29, "role": "body", "text": "\"It's cool, I guess,\" Jennings said of the Bucks' high-scoring night. \"From where I was looking at, it looked like it was fun. Monta was out there really getting guys involved, and we were able to knock down shots tonight. . It was a fast-paced game. We had 100 points at the end of the third. Everybody was getting kind of easy buckets.\""}
{"game_id": "0021201102", "chunk_id": "0021201102_030", "order": 30, "role": "closing", "text": "Game notes The Bucks' magic number for clinching a playoff berth moved to three games. \"I don't really look at the standings, the seeds and all that,\" Sanders said. \"Keep playing well, and we'll be in the playoffs.\" ... Ilyasova, who scored 29 points against Oklahoma City on Saturday, has scored at least 20 in three straight and six of his last eight games. ... Milwaukee's 69 first-half points were its most in a first half this season and equaled the most points Charlotte has allowed in a first half this year. ... The game got off to an odd start, as referee Bill Kennedy took an inadvertent elbow to the head from Sanders during the opening tipoff. He stayed in the game after going to one knee for a couple of minutes."}
