{"game_id": "0021700732", "chunk_id": "0021700732_001", "order": 1, "role": "lead", "text": "HOUSTON --  James Harden wasn't sure if Houston's first afternoon game of the season was to blame for the Rockets' lack of energy."}
{"game_id": "0021700732", "chunk_id": "0021700732_002", "order": 2, "role": "body", "text": "\"I don't know, but it was pretty ugly,\" Harden said. \"We won, but it wasn't pretty.\""}
{"game_id": "0021700732", "chunk_id": "0021700732_003", "order": 3, "role": "body", "text": "Harden had 27 points and 10 rebounds to lead the Rockets to a 113-102 victory over the Phoenix Suns on Sunday. Harden fell two assists shy of his third triple-double of the season."}
{"game_id": "0021700732", "chunk_id": "0021700732_004", "order": 4, "role": "body", "text": "The Rockets beat the Suns for the 14th time in their past 16 meetings, including seven straight. But after struggling to find a flow, making just 11 of 37 3-pointers (29.7 percent) and committing 12 turnovers, the Rockets knew something was off."}
{"game_id": "0021700732", "chunk_id": "0021700732_005", "order": 5, "role": "body", "text": "\"We just didn't play well, spirit-wise, energy-wise,\" Houston coach Mike D'Antoni said. \"Hopefully, we'll learn a little bit from it, but these are the dog days right now, and they've got to find within themselves to be able to concentrate for 48 minutes and get `Ws.\""}
{"game_id": "0021700732", "chunk_id": "0021700732_006", "order": 6, "role": "body", "text": "Rockets guard Gerald Green said D'Antoni kept reminding the team throughout the game that they were playing with fire against the Suns, who came in 17-32."}
{"game_id": "0021700732", "chunk_id": "0021700732_007", "order": 7, "role": "body", "text": "\"Luckily, we didn't get burned,\" Green said. \"We can't do those things if we want to be a good team.\""}
{"game_id": "0021700732", "chunk_id": "0021700732_008", "order": 8, "role": "body", "text": "Houston led 60-53 at halftime and outscored the Suns 32-24 in the third quarter to provide enough of a lead to hand Phoenix a fourth straight loss."}
{"game_id": "0021700732", "chunk_id": "0021700732_009", "order": 9, "role": "body", "text": "Rockets forward Trevor Ariza injured his left leg early in the first quarter after colliding under the basket with Marquese Chriss on a dunk attempt and landing awkwardly. Ariza was slow to get up, made both free throws and then, after jogging down the court in apparent pain, committed a foul to stop play and check himself out of the game to head to the locker room."}
{"game_id": "0021700732", "chunk_id": "0021700732_010", "order": 10, "role": "body", "text": "D'Antoni said Ariza injured his hamstring and would be re-evaluated on Monday."}
{"game_id": "0021700732", "chunk_id": "0021700732_011", "order": 11, "role": "body", "text": "Houston had another scary moment late in the fourth quarter when Harden was slow to shake off an apparent leg injury sustained during a jump-ball tangle with Josh Jackson. Harden, who missed seven games earlier this month with a hamstring strain, finished the game."}
{"game_id": "0021700732", "chunk_id": "0021700732_012", "order": 12, "role": "body", "text": "Chris Paul added 17 points and five assists for Houston, making all nine free throws. Paul played just 27 minutes and less than two minutes in the fourth quarter."}
{"game_id": "0021700732", "chunk_id": "0021700732_013", "order": 13, "role": "body", "text": "\"We just didn't look in sync today,\" Paul said. \"I don't know if it's because of our first afternoon game or what it is, but no excuses.\""}
{"game_id": "0021700732", "chunk_id": "0021700732_014", "order": 14, "role": "body", "text": "Devin Booker had 31 points and 10 assists for Phoenix, shooting 5 for 9 from beyond the arc. He scored 21 points in the second half to keep the Suns close. Booker was playing at the point guard position for a second straight game and said although it's not his natural position, he's working to make adjustments and better learn the position."}
{"game_id": "0021700732", "chunk_id": "0021700732_015", "order": 15, "role": "body", "text": "Booker said he injured his ribs and hip and will have an X-ray evaluation on Monday in Memphis."}
{"game_id": "0021700732", "chunk_id": "0021700732_016", "order": 16, "role": "body", "text": "\"It was a tough fall, but I'll bounce back,\" Booker said."}
{"game_id": "0021700732", "chunk_id": "0021700732_017", "order": 17, "role": "body", "text": "T.J. Warren added 24 points for the Suns."}
{"game_id": "0021700732", "chunk_id": "0021700732_018", "order": 18, "role": "body", "text": "Phoenix center Tyson Chandler returned to action after missing two of the three previous games due to illness. Chandler had 11 points and 15 rebounds in 30 minutes, picking up his first double-double of 2018. His last double-double came on Dec. 31 in a 123-110 loss to Philadelphia."}
{"game_id": "0021700732", "chunk_id": "0021700732_019", "order": 19, "role": "body", "text": "Suns center Greg Monroe was ejected late in the third quarter after picking up two technical fouls for arguing with an official following an offensive foul called on him. Monroe was given the first technical and appeared to continue talking to the official while the teams were walking to the other end of the court."}
{"game_id": "0021700732", "chunk_id": "0021700732_020", "order": 20, "role": "body", "text": "It was the second straight game a Suns player was ejected. Booker was tossed in a loss to the Knicks on Friday."}
{"game_id": "0021700732", "chunk_id": "0021700732_022", "order": 22, "role": "body", "text": "Suns: Phoenix center Alex Len missed his second straight game with an ankle injury and will be a game-time decision for Monday night's game in Memphis. In his place, Dragan Bender played 25 minutes off the bench, getting five points and four rebounds."}
{"game_id": "0021700732", "chunk_id": "0021700732_023", "order": 23, "role": "body", "text": "Rockets: Luc Mbah a Moute had 13 points in 32 minutes off the bench. Mbah a Moute, usually known for his versatile defense, has scored in double figures in three of his past four games. Houston is 9-1 when Mbah a Moute scores in double figures."}
{"game_id": "0021700732", "chunk_id": "0021700732_025", "order": 25, "role": "body", "text": "Green was called for goaltending on a block where his offhand appeared to graze the net and rim. He received a technical after arguing with officials."}
{"game_id": "0021700732", "chunk_id": "0021700732_026", "order": 26, "role": "body", "text": "\"I told the ref, `I jump extremely high so I have to be able to control myself to keep my neck from hitting the rim,\" he said."}
{"game_id": "0021700732", "chunk_id": "0021700732_028", "order": 28, "role": "body", "text": "The Rockets welcomed pilot and former U.S. Air Force general officer Chuck Yeager, who was the first pilot to break the sound barrier in 1947. The pilot, who turns 95 on Feb. 13, received a standing ovation by the Toyota Center crowd and posed with D'Antoni after the game."}
{"game_id": "0021700732", "chunk_id": "0021700732_030", "order": 30, "role": "body", "text": "Suns: Visit Memphis on Monday night for their third game in four days."}
{"game_id": "0021700732", "chunk_id": "0021700732_031", "order": 31, "role": "body", "text": "Rockets: Host Orlando on Tuesday night."}
{"game_id": "0021700732", "chunk_id": "0021700732_033", "order": 33, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
