{"game_id": "0021200134", "chunk_id": "0021200134_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Memphis Grizzlies are on top of the NBA for the first time in the franchise's 17-year history, and they showed why Saturday night."}
{"game_id": "0021200134", "chunk_id": "0021200134_002", "order": 2, "role": "body", "text": "Mike Conley scored 20 points and the Grizzlies beat the Charlotte Bobcats 94-87 for their eighth consecutive victory."}
{"game_id": "0021200134", "chunk_id": "0021200134_003", "order": 3, "role": "body", "text": "Zach Randolph added 18 points and 12 rebounds, and three other players scored in double figures for the Grizzlies, who own the league's best record at 8-1. Rudy Gay had 16 points and Marc Gasol and Tony Allen scored 12 apiece."}
{"game_id": "0021200134", "chunk_id": "0021200134_004", "order": 4, "role": "body", "text": "\"I think these last two games have really distinguished what kind of personality this team has right now,\" Conley said. \"We're really playing together as a team.\""}
{"game_id": "0021200134", "chunk_id": "0021200134_005", "order": 5, "role": "body", "text": "Byron Mullens scored 18 points and Kemba Walker added 17 for the Bobcats, who cut the Grizzlies' lead to five points three times in the final period, the last at 92-87 on Bismack Biyombo's dunk with 13 seconds remaining."}
{"game_id": "0021200134", "chunk_id": "0021200134_006", "order": 6, "role": "body", "text": "Charlotte had won three straight."}
{"game_id": "0021200134", "chunk_id": "0021200134_007", "order": 7, "role": "body", "text": "\"You have to give them credit -- they are a very good team and their record shows it,\" Mullens said."}
{"game_id": "0021200134", "chunk_id": "0021200134_008", "order": 8, "role": "body", "text": "In its last three games, Memphis has double-digit wins over the defending NBA champion Miami Heat, the Oklahoma City Thunder, last year's Western Conference champs; and the New York Knicks, formerly the league's only undefeated team."}
{"game_id": "0021200134", "chunk_id": "0021200134_009", "order": 9, "role": "body", "text": "Saturday's game was particularly tough on Memphis, which had a late finish to its nationally televised game against the Knicks on Friday night. The Grizzlies' flight didn't arrive in Charlotte until early Saturday morning."}
{"game_id": "0021200134", "chunk_id": "0021200134_010", "order": 10, "role": "body", "text": "\"We had a tough game last night, and then to get in here at four in the morning and battle a young, pesky team that's improving is a testament to our mental toughness,\" Memphis coach Lionel Hollings said."}
{"game_id": "0021200134", "chunk_id": "0021200134_011", "order": 11, "role": "body", "text": "\"We've been playing extremely well and defending as a team. That was the key to us winning tonight. We were tired out there, but we got the win. We passed and we defended.\""}
{"game_id": "0021200134", "chunk_id": "0021200134_012", "order": 12, "role": "body", "text": "The pesky Bobcats committed 18 turnovers and shot 37.6 percent from the field, but managed to battle back from a 17-point deficit and give Memphis problems down the stretch."}
{"game_id": "0021200134", "chunk_id": "0021200134_013", "order": 13, "role": "body", "text": "The Grizzlies increased a nine-point halftime lead to 77-60 on Randolph's layup with 10:52 remaining in the fourth quarter. But Walker scored 11 consecutive points over the next 3 1/2 minutes to get the Bobcats back in the game. His layup with 6:54 left got Charlotte within six at 77-71."}
{"game_id": "0021200134", "chunk_id": "0021200134_014", "order": 14, "role": "body", "text": "\"When we are down, we are not going to put our heads down,\" said Walker, who also had eight assists. \"We are going to try our best to close the game out and try to keep pushing. We don't want to give up.\""}
{"game_id": "0021200134", "chunk_id": "0021200134_015", "order": 15, "role": "body", "text": "Despite their own shooting problems -- 38.8 percent from the field -- the Grizzlies ran the lead back out to double digits again, with Quincy Pondexter's layup with 2:39 left making it 88-77. But Ramon Sessions converted a pair of layups and rookie Michael Kidd-Gilchrist followed with a basket to cut Memphis' lead to 88-83 with 47 seconds remaining."}
{"game_id": "0021200134", "chunk_id": "0021200134_016", "order": 16, "role": "body", "text": "Charlotte pulled within five points twice more in the final 30 seconds, but couldn't complete the comeback."}
{"game_id": "0021200134", "chunk_id": "0021200134_017", "order": 17, "role": "body", "text": "Memphis opened a 47-31 lead on Allen's jumper with 1:02 left in the second quarter. The Bobcats then closed out the first half with a 7-0 run. Mullens had a three-point play, Ben Gordon drove for a layup off a steal and Walker hit a pair of free throws."}
{"game_id": "0021200134", "chunk_id": "0021200134_018", "order": 18, "role": "body", "text": "Charlotte had a chance to extend the second-quarter run but Mullens missed a long 3-pointer off a steal at the buzzer."}
{"game_id": "0021200134", "chunk_id": "0021200134_019", "order": 19, "role": "closing", "text": "Game notes Gordon returned after missing the last two games for what team officials said were \"personal reasons.\" He was 4 for 10 from the field and finished with 10 points, but he did not score in the final two quarters. ... F Hakim Warrick, acquired in a trade with New Orleans for G Matt Carroll, made his debut with the Bobcats. He came into the game late in the third quarter, and finished with five points and four rebounds in just under 10 minutes. ... Sessions and Kidd-Gilchrist each finished with 12 points. ... Charlotte F Tyrus Thomas strained his left calf midway through the fourth quarter. He was seen leaving the locker room wearing a protective boot and on crutches. His status for the Bobcats' next game Monday against Milwaukee. ... The Grizzlies' win over Charlotte was their last road game for nearly two weeks. Memphis will play its next five games at home, beginning Monday against the Denver Nuggets. ... Saturday's game began a four-game homestand for the Bobcats, who also face Toronto on Wednesday and Atlanta on Friday."}
