{"game_id": "0021700412", "chunk_id": "0021700412_001", "order": 1, "role": "lead", "text": "HOUSTON --  With the way Mike D'Antoni has handled Houston's rotation lately, there are times nine-time All-Star Chris Paul is left to run Houston's offense against second-team defenses."}
{"game_id": "0021700412", "chunk_id": "0021700412_002", "order": 2, "role": "body", "text": "That combination proved the difference on Wednesday night when Paul led the Rockets to a huge run in the first half that helped them extend their NBA-best winning streak to 11 games with a 108-96 victory over the Charlotte Hornets."}
{"game_id": "0021700412", "chunk_id": "0021700412_003", "order": 3, "role": "body", "text": "Paul scored a season-high 31 points and James Harden added 21 to help Houston to its 17th win in 18 games and improve to 22-4, the best record in the league."}
{"game_id": "0021700412", "chunk_id": "0021700412_004", "order": 4, "role": "body", "text": "After allowing the Pelicans to stick around before putting them away late in their last game, the Rockets made sure this one was decided early. Houston led by one late in the first before scoring 25 straight points over the end of that quarter and the beginning of the second to make it 49-23 and cruise to the easy win."}
{"game_id": "0021700412", "chunk_id": "0021700412_005", "order": 5, "role": "body", "text": "\"Chris comes in fresh (and) if I'm not mistaken something like 2:50 to go in the first quarter we go on a (25) to zip run. Game's over,\" D'Antoni said."}
{"game_id": "0021700412", "chunk_id": "0021700412_006", "order": 6, "role": "body", "text": "With Harden on the bench, the Rockets scored the last 14 points of the first quarter, with the last nine from Paul, to turn a one-point lead into a 38-23 advantage entering the second quarter."}
{"game_id": "0021700412", "chunk_id": "0021700412_007", "order": 7, "role": "body", "text": "Houston continued to pile on to start the second, scoring the first 11 points of the period to extend its run to 25-0 and make it 49-23 with 9:45 left in the half. The Rockets made six 3-pointers during that run, with three from Paul and one from Eric Gordon."}
{"game_id": "0021700412", "chunk_id": "0021700412_008", "order": 8, "role": "body", "text": "Paul acknowledged that he looks to be more aggressive when he's without Harden."}
{"game_id": "0021700412", "chunk_id": "0021700412_009", "order": 9, "role": "body", "text": "\"I sort of control the pace with that group,\" he said. \"Early in the game it's both me and James and we both pick our spots. With that second unit I sort of dictate the tempo. So I just take whatever's there.\""}
{"game_id": "0021700412", "chunk_id": "0021700412_010", "order": 10, "role": "body", "text": "Harden enjoyed watching the show Paul put on from the bench."}
{"game_id": "0021700412", "chunk_id": "0021700412_011", "order": 11, "role": "body", "text": "\"We got stops and Chris got hot,\" he said. \"He was extremely aggressive. We just kind of rode that wave throughout the entire game.\""}
{"game_id": "0021700412", "chunk_id": "0021700412_012", "order": 12, "role": "body", "text": "The Hornets finally ended their scoring drought when Jeremy Lamb made a pair of free throws, but they didn't make a field goal until Kemba Walker hit a jumper with about eight minutes left in the second that made it 50-27."}
{"game_id": "0021700412", "chunk_id": "0021700412_013", "order": 13, "role": "body", "text": "Dwight Howard tied a season high with 26 points and had 18 rebounds and three blocks as the Hornets continued to struggle on the road, where they've dropped nine of their last 10 dating to Oct. 30."}
{"game_id": "0021700412", "chunk_id": "0021700412_014", "order": 14, "role": "body", "text": "\"There was that one stretch where we really struggled,\" interim coach Stephen Silas said. \"I think beyond that stretch we played pretty well and I think the score was actually our way. But it's been tough going on the road trying to win games and we're trying to figure it out.\""}
{"game_id": "0021700412", "chunk_id": "0021700412_015", "order": 15, "role": "body", "text": "Houston made 17 3-pointers and held the Hornets to just four."}
{"game_id": "0021700412", "chunk_id": "0021700412_016", "order": 16, "role": "body", "text": "The Rockets had a 14-point lead at halftime and used a 9-2 run, with five points from Harden, to open the third quarter and make it 72-51."}
{"game_id": "0021700412", "chunk_id": "0021700412_017", "order": 17, "role": "body", "text": "Charlotte scored eight straight points to cut the lead to 79-65 with about 3 1/2 remaining in the third. But Houston outscored the Hornets 12-4 to wrap up the quarter and take a 91-69 lead into the fourth. Harden and Paul each made a 3-pointer in that stretch and Gordon added two more."}
{"game_id": "0021700412", "chunk_id": "0021700412_018", "order": 18, "role": "body", "text": "The Rockets led 63-49 at halftime."}
{"game_id": "0021700412", "chunk_id": "0021700412_020", "order": 20, "role": "body", "text": "Hornets: Nicolas Batum returned after missing the last game with a sore left elbow. He had nine points and nine rebounds. ... Michael Carter-Williams received a technical at the end of the first quarter. ... Michael Kidd-Gilchrist added 18 points and 11 rebounds."}
{"game_id": "0021700412", "chunk_id": "0021700412_021", "order": 21, "role": "body", "text": "Rockets: Trevor Ariza played despite dealing with a sore left foot. He had 13 points and six rebounds. ... Luc Mbah a Moute injured his left shoulder crashing to the court after a shot just before halftime and didn't return. D'Antoni said he'd have an MRI on Thursday. ... Paul added 11 assists and seven rebounds."}
{"game_id": "0021700412", "chunk_id": "0021700412_023", "order": 23, "role": "body", "text": "Harden on if he thinks there's still room for the Rockets to improve: \"Of course. Even though we went on a 25-0 run, we allowed them to get confidence going into halftime so we've just got to be consistent. We can't give any teams hope, especially when we've got them down like that.\""}
{"game_id": "0021700412", "chunk_id": "0021700412_025", "order": 25, "role": "body", "text": "Houston's Clint Capela had four blocks on Wednesday to give him three or more in 10 games this season after only doing it six times in 65 games last season. He ranks fifth in the NBA with 1.88 blocks a game and has also improved on offense this season. He leads the NBA in field goal percentage at 68 percent."}
{"game_id": "0021700412", "chunk_id": "0021700412_027", "order": 27, "role": "body", "text": "Hornets: Host Miami on Friday night."}
{"game_id": "0021700412", "chunk_id": "0021700412_028", "order": 28, "role": "closing", "text": "Rockets: Host San Antonio on Friday night."}
