{"game_id": "0021700256", "chunk_id": "0021700256_001", "order": 1, "role": "lead", "text": "ATLANTA --  After the Clippers lost games for more than three weeks and lost a player Wednesday, Blake Griffin had seen enough."}
{"game_id": "0021700256", "chunk_id": "0021700256_002", "order": 2, "role": "body", "text": "\"The best part about tonight was just how we got the win,\" he said. \"We were banged up. We got awful news today, but guys just focused and did the little things we needed to do to get a win.\""}
{"game_id": "0021700256", "chunk_id": "0021700256_003", "order": 3, "role": "body", "text": "Griffin had 26 points, 10 rebounds and 10 assists, Wesley Johnson scored a season-high 24 points and Los Angeles snapped a nine-game skid with a 116-103 victory over the Atlanta Hawks."}
{"game_id": "0021700256", "chunk_id": "0021700256_004", "order": 4, "role": "body", "text": "The Clippers had dropped 11 of 12 and learned before the game that starting guard Patrick Beverley is likely to miss the rest of the season with a knee injury. But they overcame a monthlong struggle of closing out opponents, taking the lead for good on a pair of free throws by Lou Williams with 4:11 left in the third quarter."}
{"game_id": "0021700256", "chunk_id": "0021700256_005", "order": 5, "role": "body", "text": "Los Angeles handed out a season-high 30 assists."}
{"game_id": "0021700256", "chunk_id": "0021700256_006", "order": 6, "role": "body", "text": "\"I loved it -- 30 assists,\" coach Doc Rivers said. \"We talked about it before the game. Without a point guard the team had the spirit of the pass. The ball was finding the open guy. I thought they did it all night.\""}
{"game_id": "0021700256", "chunk_id": "0021700256_007", "order": 7, "role": "body", "text": "Atlanta matched its biggest lead at seven on Dennis Schroder's 3-pointer with 7:49 left in the third. But the Hawks fell apart against the more talented Clippers, losing their third straight to drop to 3-15, worst in the Eastern Conference."}
{"game_id": "0021700256", "chunk_id": "0021700256_008", "order": 8, "role": "body", "text": "Marco Belinelli finished with 20 points and Schroder added 19."}
{"game_id": "0021700256", "chunk_id": "0021700256_009", "order": 9, "role": "body", "text": "\"A lot of their guys played well, but we have to do more to be disruptive, more to make it difficult for them,\" Hawks coach Mike Budenholzer said. \"We have to do a better job on that end of the court.\""}
{"game_id": "0021700256", "chunk_id": "0021700256_010", "order": 10, "role": "body", "text": "Johnson hit six of his first seven 3-point attempts and went 8 for 10 from the field. Williams finished with 20 points, and Austin Rivers added 18. DeAndre Jordan had 14 points and 16 rebounds."}
{"game_id": "0021700256", "chunk_id": "0021700256_011", "order": 11, "role": "body", "text": "The closest Atlanta got in the fourth was within five points on Dewayne Dedmon's 3 with 5:53 remaining. Less than 3 minutes later, Griffin hit a 3 to put the Clippers up by 15."}
{"game_id": "0021700256", "chunk_id": "0021700256_012", "order": 12, "role": "body", "text": "Johnson has stepped up his performance over the last four games, but he credited this outing to the team's collective energy in looking for the open man."}
{"game_id": "0021700256", "chunk_id": "0021700256_013", "order": 13, "role": "body", "text": "\"I think that was the main thing,\" Johnson said. \"The ball was moving. I think we started out defensively the way we wanted to, but I think we picked it up in the second half.\""}
{"game_id": "0021700256", "chunk_id": "0021700256_015", "order": 15, "role": "body", "text": "Clippers: G Lou Williams, a productive sixth man for most of his career, made just his second start since he played for the Lakers in 2015-16. In 13 seasons, Williams has scored 8,599 points as a reserve, second only to Jamal Crawford among active players."}
{"game_id": "0021700256", "chunk_id": "0021700256_016", "order": 16, "role": "body", "text": "Hawks: Rookie F John Collins, the 19th overall draft pick, made his first career start and finished with 14 points and team highs with 10 rebounds and 38 minutes. Collins got the nod with back tightness still bothering Luke Babbitt, but he could hold the job the rest of the season given that he's shooting over 58 percent from the field and consistently plays above the rim."}
{"game_id": "0021700256", "chunk_id": "0021700256_018", "order": 18, "role": "body", "text": "Beverley underwent a procedure Wednesday in Houston to repair a lateral meniscus. Beverley appeared in 11 games since arriving in the Chris Paul trade, averaging 12.2 points, 4.1 rebounds, 2.9 assists, 1.73 steals and 30.3 minutes."}
{"game_id": "0021700256", "chunk_id": "0021700256_019", "order": 19, "role": "body", "text": "\"It's a tough blow for the team, but it's worse for Patrick,\" Rivers said. \"We thought it would probably be just meniscus, but it turns out to be a lot more.\""}
{"game_id": "0021700256", "chunk_id": "0021700256_021", "order": 21, "role": "body", "text": "Clippers: Visit Sacramento on Saturday."}
{"game_id": "0021700256", "chunk_id": "0021700256_022", "order": 22, "role": "body", "text": "Hawks: Host New York on Friday."}
{"game_id": "0021700256", "chunk_id": "0021700256_024", "order": 24, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
