{"game_id": "0021700714", "chunk_id": "0021700714_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Kemba Walker likes the Charlotte Hornets' chances with Dwight Howard altering shots in the lane."}
{"game_id": "0021700714", "chunk_id": "0021700714_002", "order": 2, "role": "body", "text": "Walker scored 29 points and made two key 3-pointers down the stretch that helped Charlotte beat the Atlanta Hawks 121-110 on Friday night."}
{"game_id": "0021700714", "chunk_id": "0021700714_003", "order": 3, "role": "body", "text": "Howard was key in turning back the Hawks' rally. He finished with 18 points, 15 rebounds and a season-high seven blocks."}
{"game_id": "0021700714", "chunk_id": "0021700714_004", "order": 4, "role": "body", "text": "\"(Dwight) just has to do it,\" Walker said. \"We just have to do it. He always tells us when guys are going to the basket he's going to try and block it. That is what he is there for.\""}
{"game_id": "0021700714", "chunk_id": "0021700714_005", "order": 5, "role": "body", "text": "Nicolas Batum and Michael Kidd-Gilchrist each added 19 points as Charlotte rallied to regain a lead it maintained since the second period, but surrendered halfway through the fourth."}
{"game_id": "0021700714", "chunk_id": "0021700714_006", "order": 6, "role": "body", "text": "Howard has two games of at least six blocks in his past three."}
{"game_id": "0021700714", "chunk_id": "0021700714_007", "order": 7, "role": "body", "text": "\"It's very important that we all do the little things, getting deflections,\" said Howard, who registered his 29th double-double this season. \"Everybody's stepping in, taking away somebody rolling to the basket, and then running out and making sure guys don't get open 3s.\""}
{"game_id": "0021700714", "chunk_id": "0021700714_008", "order": 8, "role": "body", "text": "Jeremy Lamb scored 12 points for Charlotte, which tied its season high with 13 steals."}
{"game_id": "0021700714", "chunk_id": "0021700714_009", "order": 9, "role": "body", "text": "Marvin Williams finished with 11 points for the Hornets, who closed with a 12-0 run for their fourth consecutive home victory against Atlanta."}
{"game_id": "0021700714", "chunk_id": "0021700714_010", "order": 10, "role": "body", "text": "\"Giving up 121 points, it's going to be tough to win,\" said Kent Bazemore, who led Atlanta with 26 points. \"Kemba made some great plays down the stretch. With Nic Batum, those guys are seasoned vets, and they work well together.\""}
{"game_id": "0021700714", "chunk_id": "0021700714_011", "order": 11, "role": "body", "text": "Taurean Prince added 21 for Atlanta, including a steal and dunk to put the Hawks ahead 105-104 with less than 4 minutes to play."}
{"game_id": "0021700714", "chunk_id": "0021700714_012", "order": 12, "role": "body", "text": "Mike Muscala helped Atlanta take a fourth-quarter lead with 14 points, but the Hawks fell to 0-2 in the season series. Ersan Ilyasova and Dennis Schroder scored 11 points apiece for Atlanta."}
{"game_id": "0021700714", "chunk_id": "0021700714_013", "order": 13, "role": "body", "text": "John Collins shot 4 for 5 for 10 points for the Hawks, who have the NBA's worst record."}
{"game_id": "0021700714", "chunk_id": "0021700714_014", "order": 14, "role": "body", "text": "\"It (stinks) for us to be down at half and work our way back, to have (Bazemore) do what he does, then have it all go down the drain,\" Collins said. \"Always tough to see that happen. It has been the Achilles' heel of our story.\""}
{"game_id": "0021700714", "chunk_id": "0021700714_015", "order": 15, "role": "body", "text": "With 4:34 left until halftime, Walker went hard to the court after slipping on a drive to the basket and appearing to hit his head on Collins' knee. He did not leave the game."}
{"game_id": "0021700714", "chunk_id": "0021700714_017", "order": 17, "role": "body", "text": "Hawks: The Hawks have lost six of seven. ... Collins attended a game at his alma mater, Wake Forest, against Duke, on the trip. He got a video tribute and warm reception at the game."}
{"game_id": "0021700714", "chunk_id": "0021700714_018", "order": 18, "role": "body", "text": "Hornets: All five starters scored in double digits. . Charlotte wore its black Buzz City uniforms."}
{"game_id": "0021700714", "chunk_id": "0021700714_020", "order": 20, "role": "body", "text": "Howard made a few headlines with a quote Friday that he wanted to \"kill\" the Hawks. Atlanta traded Howard to Charlotte in the offseason."}
{"game_id": "0021700714", "chunk_id": "0021700714_021", "order": 21, "role": "body", "text": "\"I think they kind of took it and ran with it,\" Howard said. \"I was just talking to a couple of the UFC fighters before I did the interview and I was talking about fighting and stuff like that. . Killing them is not always scoring a million points, but doing all the little things that matter.\""}
{"game_id": "0021700714", "chunk_id": "0021700714_023", "order": 23, "role": "body", "text": "With his parents in attendance on his father's birthday, Bazemore missed his career high by two points. He said he had extra motivation from their presence, despite the team's status at the bottom of the NBA."}
{"game_id": "0021700714", "chunk_id": "0021700714_024", "order": 24, "role": "body", "text": "\"We give the effort every night regardless of our record,\" Bazemore said. \"That's a great foundation to becoming one of those playoff teams.\""}
{"game_id": "0021700714", "chunk_id": "0021700714_026", "order": 26, "role": "body", "text": "Hawks: Visit Washington on Saturday night."}
{"game_id": "0021700714", "chunk_id": "0021700714_027", "order": 27, "role": "closing", "text": "Hornets: Visit Miami on Saturday night."}
