{"game_id": "0021701147", "chunk_id": "0021701147_001", "order": 1, "role": "lead", "text": "ATLANTA --  When Atlanta's Isaiah Taylor made a free throw to complete a three-point play less than three minutes into the game, no one could have known it would be the Hawks' only visit to the line."}
{"game_id": "0021701147", "chunk_id": "0021701147_002", "order": 2, "role": "body", "text": "The Hawks didn't attempt another free throw the remainder of the game, and that reflected Orlando's indifference on defense."}
{"game_id": "0021701147", "chunk_id": "0021701147_003", "order": 3, "role": "body", "text": "Tyler Dorsey scored a career-high 19 points, including back-to-back baskets after Orlando trimmed Atlanta's lead to five points late in the game, and the Hawks beat the Magic 94-88 on Sunday in a matchup of the Eastern Conference's worst records."}
{"game_id": "0021701147", "chunk_id": "0021701147_004", "order": 4, "role": "body", "text": "With its third straight loss, Orlando (22-54) moved closer to Atlanta (22-55) at the bottom of the East. Both teams trail Phoenix in the race for the league's worst record."}
{"game_id": "0021701147", "chunk_id": "0021701147_005", "order": 5, "role": "body", "text": "The Magic defended as if intent on grabbing that last-place spot in the conference from the Hawks -- and better odds for the top pick in the NBA draft."}
{"game_id": "0021701147", "chunk_id": "0021701147_006", "order": 6, "role": "body", "text": "\"We didn't guard the whole night,\" Orlando coach Frank Vogel said."}
{"game_id": "0021701147", "chunk_id": "0021701147_007", "order": 7, "role": "body", "text": "\"We don't want to put the other team on the free-throw line, but there were several plays around the rim we could have made them earn it on the free-throw line and we didn't.\""}
{"game_id": "0021701147", "chunk_id": "0021701147_008", "order": 8, "role": "body", "text": "Orlando sometimes didn't defend on the perimeter as well, including late in the game."}
{"game_id": "0021701147", "chunk_id": "0021701147_009", "order": 9, "role": "body", "text": "Shelvin Mack hit two free throws with 2:16 remaining to cut Atlanta's lead to 89-84. Dorsey answered with a 3-pointer over Mack and added a layup on Atlanta's next possession to stretch the lead back to double digits at 94-84."}
{"game_id": "0021701147", "chunk_id": "0021701147_010", "order": 10, "role": "body", "text": "\"I saw I had a mismatch,\" Dorsey said of his 3-pointer. \"His hands were down and I just let it fly. I work on that shot a lot.\""}
{"game_id": "0021701147", "chunk_id": "0021701147_011", "order": 11, "role": "body", "text": "Dorsey played 22 minutes off the bench."}
{"game_id": "0021701147", "chunk_id": "0021701147_012", "order": 12, "role": "body", "text": "\"When he gets a little bit of confidence, he has different ways of scoring,\" Hawks coach Mike Budenholzer said. \"He has a knack for scoring. It was great to see that from him.\""}
{"game_id": "0021701147", "chunk_id": "0021701147_013", "order": 13, "role": "body", "text": "Dewayne Dedmon had 17 points and 10 rebounds to lead three Atlanta players with double-doubles. Rookie John Collins had 10 points and 11 rebounds and Mike Muscala had 13 points and 10 rebounds."}
{"game_id": "0021701147", "chunk_id": "0021701147_014", "order": 14, "role": "body", "text": "The Hawks snapped a five-game losing streak."}
{"game_id": "0021701147", "chunk_id": "0021701147_015", "order": 15, "role": "body", "text": "D.J. Augustin led Orlando with 20 points, and rookie Jonathan Isaac had a career-high 15."}
{"game_id": "0021701147", "chunk_id": "0021701147_016", "order": 16, "role": "body", "text": "Orlando made only 34.4 percent of its shots from the field. Center Nikola Vucevic had 10 points on 3-for-19 shooting but led the Magic with 14 rebounds."}
{"game_id": "0021701147", "chunk_id": "0021701147_017", "order": 17, "role": "body", "text": "The Hawks took a big first-half lead of 15 points and led 56-43 at halftime."}
{"game_id": "0021701147", "chunk_id": "0021701147_019", "order": 19, "role": "body", "text": "Magic: Isaac, who made three 3-pointers, scored in double figures for the third time. His previous career high was 11 points at Phoenix on Nov. 10. ... After missing two games with an upper respiratory infection, rookie F Wes Iwundu started and had five points in 28 minutes. ... F Jonathon Simmons (right wrist contusion) missed his sixth straight game."}
{"game_id": "0021701147", "chunk_id": "0021701147_020", "order": 20, "role": "body", "text": "Hawks: Atlanta claimed a 47-30 advantage in rebounds. ... F DeAndre Bembry had four points in 14 minutes in his return after missing 16 consecutive games with an abdominal strain. Including 18 games missed with a groin/adductor strain injury, Bembry had played only three games since Dec. 22. Bembry played the final three minutes of the first period, launched an air ball on his first shot and then made his next two shots in the half."}
{"game_id": "0021701147", "chunk_id": "0021701147_022", "order": 22, "role": "body", "text": "Aaron Gordon, who had 10 points while making 4 of 13 shots from the field, said the Magic abandoned their transition game."}
{"game_id": "0021701147", "chunk_id": "0021701147_023", "order": 23, "role": "body", "text": "\"We have to get out in transition,\" Gordon said. \"It kills 75 percent of our offense if we don't get out in transition. ... It seemed a little out of rhythm out there.\""}
{"game_id": "0021701147", "chunk_id": "0021701147_025", "order": 25, "role": "body", "text": "Atlanta's one free-throw attempt tied an NBA record for fewest attempts by a team in a game, according to the Hawks. Memphis also went 1 for 1 from the line against Atlanta on Feb. 8, 2014. Cleveland had two attempts against Golden State on Nov. 26, 1994."}
{"game_id": "0021701147", "chunk_id": "0021701147_027", "order": 27, "role": "body", "text": "Magic: Visit Knicks on Tuesday."}
{"game_id": "0021701147", "chunk_id": "0021701147_028", "order": 28, "role": "body", "text": "Hawks: Visit Heat on Tuesday before hosting Miami on Wednesday."}
{"game_id": "0021701147", "chunk_id": "0021701147_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
