{"game_id": "0021200446", "chunk_id": "0021200446_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  From scoring to rebounding to passing to defense, Nicolas Batum did it all for the Portland Trail Blazers."}
{"game_id": "0021200446", "chunk_id": "0021200446_002", "order": 2, "role": "body", "text": "Batum had 22 points, eight assists and seven rebounds, Damian Lillard added 20 points and the Blazers beat the Philadelphia 76ers 89-85 on Saturday night for their eighth straight victory at home."}
{"game_id": "0021200446", "chunk_id": "0021200446_003", "order": 3, "role": "body", "text": "\"He's doing what the team needs,\" Portland coach Terry Stotts said of Batum, \"whether it's facilitating or scoring or rebounding.\""}
{"game_id": "0021200446", "chunk_id": "0021200446_004", "order": 4, "role": "body", "text": "Batum also shut down Jrue Holiday, who led Philadelphia with 29 points but went 1 of 5 from the field after Batum was switched onto him defensively."}
{"game_id": "0021200446", "chunk_id": "0021200446_005", "order": 5, "role": "body", "text": "Batum had already silenced Evan Turner (2-of-7 shooting for four points) when he asked Stotts to put him on Holiday in the fourth quarter."}
{"game_id": "0021200446", "chunk_id": "0021200446_006", "order": 6, "role": "body", "text": "\"I kept saying to Coach, 'Let me guard Jrue. He won't get those shots on me. He will not post me up,\" Batum said."}
{"game_id": "0021200446", "chunk_id": "0021200446_007", "order": 7, "role": "body", "text": "Holiday also had nine assists and nine rebounds for Sixers, who have lost eight of 10. Thaddeus Young, who added 17 points, was his only teammate to have a consistently good night."}
{"game_id": "0021200446", "chunk_id": "0021200446_008", "order": 8, "role": "body", "text": "Portland led 84-76 late in the game, but Young made two big baskets, including a three-point play to cut the lead to three. Spencer Hawes and Dorell Wright missed 3-pointers for the Sixers, however, and Batum hit three of four free throws to seal it."}
{"game_id": "0021200446", "chunk_id": "0021200446_009", "order": 9, "role": "body", "text": "Portland was playing for the second consecutive night and was coming off a 104-78 loss at the Los Angeles Lakers. The Sixers were also on a back-to back, having lost 96-89 to Golden State."}
{"game_id": "0021200446", "chunk_id": "0021200446_010", "order": 10, "role": "body", "text": "\"We have to have a game where we're the team that jumps on early and survives a couple runs,\" Hawes said. \"It takes more energy to be on the bottom side of a run trying to come back than it does to hold it.\""}
{"game_id": "0021200446", "chunk_id": "0021200446_011", "order": 11, "role": "body", "text": "Portland led by as many as nine in the first half and was ahead 49-44 at halftime but came out flat in the third quarter, missing seven of its first 10 shots. Meanwhile, Holiday scored 13 points in the quarter to push the Sixers into the lead. He hit a 3-pointer and then a jumper to put Philadelphia up 57-56."}
{"game_id": "0021200446", "chunk_id": "0021200446_012", "order": 12, "role": "body", "text": "Batum picked up the slack for Portland. He made two free throws and two 3s to take the lead back for the Blazers, who went into the fourth quarter up 70-67. Portland then opened the fourth with a 7-0 run to take a 10-point advantage."}
{"game_id": "0021200446", "chunk_id": "0021200446_013", "order": 13, "role": "body", "text": "\"We haven't been a team that's come back in the fourth quarter yet this year,\" Sixers coach Doug Collins said. \"I think we've won one game when we were behind after three quarters.\""}
{"game_id": "0021200446", "chunk_id": "0021200446_014", "order": 14, "role": "body", "text": "J.J. Hickson had 16 points and 13 rebounds for Portland. LaMarcus Aldridge added 16 points."}
{"game_id": "0021200446", "chunk_id": "0021200446_015", "order": 15, "role": "closing", "text": "Game notes Portland has won four of the last five matchups between the teams, including 107-103 over Philadelphia in their lone meeting last season. ... Blazers rookie C Meyers Leonard had to be helped to the locker room with ankle injury. ... Philadelphia G Jason Richardson returned to action after missing two games with a strained back. He scored five points. ... Blazers G Wesley Matthews missed his fourth straight game with a strained hip."}
