{"game_id": "0021700076", "chunk_id": "0021700076_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- DeMar DeRozan has stuck with the Toronto Raptors for 600 games because of exactly what he did to the Lakers.\nDeRozan scored 17 of his 24 points in the second half and the Raptors rallied late for the first victory on their six-game road trip, 101-92 over Los Angeles on Friday night.\nWhile extending his franchise record for games played, DeRozan seized control of his own landmark game midway through the fourth quarter. The Compton native checked in and promptly put up a six-point flurry, including the tiebreaking jumper with 6:10 left to put Toronto up for good.\nJust like that, the Raptors were in control after the lead had changed hands 15 times in the second half.\n\"My mentality is to go out there and close the game,\" DeRozan said. \"I just try to go out there and do my job.\"\nDeRozan is one of 11 active players with at least 600 games with their current club. He spent one year at USC before the draft sent him in 2009 to Toronto, where he has become a basketball fixture.\n\"That's crazy,\" DeRozan said of his Toronto tenure. \"That's definitely an honor. I can believe it, but it's a crazy thing when I think about it.\"\nKyle Lowry added 11 points, 12 assists and 10 rebounds in his eighth triple-double for the Raptors, who beat the Lakers for the fifth straight time. Serge Ibaka had 18 points and eight rebounds, and Pascal Siakam added 18 points for Toronto.\nTwo days after taking a tough late loss at Golden State and falling to 0-2 on their West Coast trip, the Raptors held off the young Lakers with gritty play from their starting unit.\n\"A team like Toronto loses back-to-back games, they're going to come out locked in, and they did,\" Lakers coach Luke Walton said. \"You could see the look in their eyes.\"\nLonzo Ball had five points, six assists and seven rebounds on his 20th birthday for the Lakers, who haven't beaten Toronto since 2014. Brook Lopez led the Lakers to a 17-point lead in the first half, but the Raptors erased it in roughly seven minutes spanning halftime.\n\"I think we lost our intensity, to be honest,\" Ball said. \"We need to stick to what's working. We got away from it. We started playing conservatively a little bit, and when our defense goes down, so does our offense.\"\nJulius Randle scored 18 points for Los Angeles, while rookie Kyle Kuzma had 15 and Lopez added 13. The Lakers went 3 for 23 on 3-pointers, undercutting the ball movement and pace stressed by Walton's offense.\nTIP-INS\nRaptors: C Jonas Valanciunas missed his third straight game with a sprained left ankle. ... Lucas Nogueira missed his second consecutive game, also with a sprained left ankle. ... Starting forward Norman Powell is a San Diego native who attended UCLA.\nLakers: All four University of Utah products currently in the NBA were at this game: Kuzma and Andrew Bogut for Los Angeles, and Toronto's Jakob Poeltl and Delon Wright. ... Los Angeles Rams LT Andrew Whitworth watched the game at courtside. So did 94-year-old comic book creator Stan Lee.\nSLOW START\nToronto coach Dwane Casey expected a strong effort from his players coming off two road defeats, but had to wait to see it.\n\"We didn't show up the first half, for whatever reason,\" Casey said. \"We found a way to pull together, but the Lakers did a good job of punching us in the mouth there.\"\nJUMPING IN\nSiakam continued to take advantage of extensive playing time made available by the injury absences of Valanciunas and Nogueira. After scoring 20 points against the Warriors on Wednesday, Siakam went 8 for 10 from the field and grabbed five rebounds.\nUP NEXT\nRaptors: At the Portland Trail Blazers on Monday.\nLakers: At the Utah Jazz on Saturday.\n---\nMore AP NBA: https://apnews.com/tag/NBAbasketball"}
