{"game_id": "0021400253", "chunk_id": "0021400253_001", "order": 1, "role": "lead", "text": "CLEVELAND -- As Mike Miller slung his backpack over his shoulder and headed toward the locker room door wearing a \"God Loves Cleveland\" T-shirt, a voice from the far corner stopped the Cleveland Cavaliers' veteran swingman.\nMiller didn't have to turn around to know who it was.\n\"My hero,\" LeBron James yelled.\nMiller came off the bench and provided Cleveland with a much-needed spark in the second half Tuesday night, helping the Cavaliers to their fourth straight win, 111-108 over the young-and-hungry Milwaukee Bucks."}
{"game_id": "0021400253", "chunk_id": "0021400253_002", "order": 2, "role": "closing", "text": "Kyrie Irving scored 28 points, Kevin Love had 27 and James finished with 26 points and 10 assists for the Cavs, who have quickly turned things around following a four-game losing streak.\nThe \"Big 3\" combined for 81 points, but it was Miller, a 15-year veteran best known for his 3-point shooting, who made several big plays in the second half to help put away the Bucks.\nMiller didn't play in Cleveland's previous three wins, but when coach David Blatt turned to him in the third quarter, the 34-year-old responded.\n\"We were in trouble and we had to do something,\" Blatt said. \"Mike answered the call.\"\nMiller made two 3-pointers, grabbed seven rebounds and made a crucial block in 18 minutes -- all in the second half.\n\"He sort of stabilized us, gave the others confidence and that's what a veteran should do,\" Blatt said. \"I gotta give him a lot of credit. He hasn't played in the last several games and we threw him into a very tough situation and he answered the call in a big way.\"\nJames, who won two titles with Miller in Miami, wasn't surprised.\n\"I've played with him for so long that I know exactly how he can be effective,\" James said. \"He's going to be very important to our team.\"\nBrandon Knight scored 24 and 19-year-old rookie Jabari Parker, the No. 2 overall pick in this year's draft, had 22 points for Milwaukee.\nThe Cavs trailed 89-86 when Love hit a tying 3-pointer with 4:44 left. Milwaukee pushed the ball up the floor and 6-foot-11 Giannis Antetokounmpo seemed to have a mismatch on a drive, but he had his baseline shot blocked by the 6-foot-8 Miller, who has creaky knees and not the vertical jump he once had.\nAsked to describe the game's biggest play, Miller grinned.\n\"It's what I do,\" he deadpanned, drawing laughter from reporters. \"I made my career on that.\"\nFollowing the block, Irving made a twisting layup and was fouled. His three-point play made it 92-89, and after Parker missed a jumper, James scored on a driving layup to put the Cavs up five with 3:48 left.\nStill, the Bucks stayed close and were within four on Knight's 3-pointer with 15 seconds to go. However, James made eight free throws in the final 33 seconds to put Milwaukee away.\nFACIAL INJURY\nBucks forward Ersan Ilyasova will be kept in the Cleveland Clinic overnight after sustaining a facial bruise in the first half. He scored nine points before getting hurt.\n\"That hurt us,\" coach Jason Kidd said of losing Ilyasova. \"We didn't have anyone who could knock down the open shot for us.\"\nSTAR POWER\nMajor league All-Star pitchers CC Sabathia and Justin Verlander sat in the front row, and Verlander was accompanied by his supermodel girlfriend, Kate Upton. On the other side of the floor was Browns rookie quarterback Johnny Manziel, who received a huge roar from the crowd when he was shown on the scoreboard.\nTIP-INS\nBucks: Parker made the game's most sensational play, beating Anderson Varejao with a crossover dribble and delivering a vicious, left-handed dunk. Parker finished one point shy of his season high, but he wasn't concerned about anything other than the loss. \"It doesn't matter,\" Parker said. \"If we lose it's out the window. That's all I care about. I don't care about stats. You've got to get the win. That's all that counts.\"\nCavaliers: James was impressed with Parker. \"He's excellent,\" he said. \"The talent is there. He's explosive, can shoot and can rebound.\" ... Cleveland has reportedly submitted a bid to host the 2018 NBA All-Star Game. James was aware of the possibility, joking it could be a personal nightmare. \"It would be too much for me,\" he cracked. \"I think it would be great for us to host it, but hopefully I'm no good in that year. Family and friends, I don't want it. Too much.\"\nUP NEXT\nBucks: Host Dallas on Wednesday.\nCavaliers: At New York on Thursday."}
