{"game_id": "0021701032", "chunk_id": "0021701032_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Five starts, five wins for Corey Brewer with the Oklahoma City Thunder."}
{"game_id": "0021701032", "chunk_id": "0021701032_002", "order": 2, "role": "body", "text": "The recent addition scored 22 points and matched a career high with six steals to help the Thunder beat the Los Angeles Clippers 121-113 on Friday night."}
{"game_id": "0021701032", "chunk_id": "0021701032_003", "order": 3, "role": "body", "text": "The 32-year-old Brewer was bought out by the Los Angeles Lakers late last month, allowing Oklahoma City to pick him up as a free agent. As a starter with the Thunder, he is averaging 14.8 points in the shooting guard spot vacated when Andre Roberson ruptured his left patellar tendon and had season-ending surgery."}
{"game_id": "0021701032", "chunk_id": "0021701032_004", "order": 4, "role": "body", "text": "Brewer said it has been easy to fit in because he played college ball for Thunder coach Billy Donovan at the University of Florida."}
{"game_id": "0021701032", "chunk_id": "0021701032_005", "order": 5, "role": "body", "text": "\"I won't say it's surprising,\" Brewer said. \"It's a comfort level. I keep telling everybody, coach Donovan makes me feel really comfortable. I won two national championships with the guy. It's just his demeanor and the faith he has in me that makes the game easier.\""}
{"game_id": "0021701032", "chunk_id": "0021701032_006", "order": 6, "role": "body", "text": "Oklahoma City's Russell Westbrook had 16 points, 10 rebounds and 11 assists for his 22th triple-double of the season and the 101st of his career. Brewer said playing Westbrook's up-tempo style has been fun."}
{"game_id": "0021701032", "chunk_id": "0021701032_007", "order": 7, "role": "body", "text": "\"Yeah, I love to run,\" Brewer said. \"That's my game. I can run all day, so having Russell Westbrook pushing on the break just running to get a layup -- it's easy.\""}
{"game_id": "0021701032", "chunk_id": "0021701032_008", "order": 8, "role": "body", "text": "Paul George scored 19 points and Steven Adams added 18 points and 14 rebounds for the Thunder, who swept all three games from the Clippers this season."}
{"game_id": "0021701032", "chunk_id": "0021701032_009", "order": 9, "role": "body", "text": "Oklahoma City, one of several teams in the race for the No. 3 seed in the Western Conference playoffs, won its fifth straight and clinched a winning season. It was the start of a difficult closing stretch against mostly teams in playoff contention."}
{"game_id": "0021701032", "chunk_id": "0021701032_010", "order": 10, "role": "body", "text": "Adams created problems for the Clippers all night."}
{"game_id": "0021701032", "chunk_id": "0021701032_011", "order": 11, "role": "body", "text": "\"He's a good basketball player,\" Clippers coach Doc Rivers said. \"I almost think that's a slap just to call him and energy player because he is a skilled basketball player with high IQ and is just extremely physical. It seems like every time we got a big stop, he got it back for them, so you just have to give him credit.\""}
{"game_id": "0021701032", "chunk_id": "0021701032_012", "order": 12, "role": "body", "text": "Tobias Harris scored 24 points and Austin Rivers added 23 for the Clippers, but the Thunder scored 31 points off Los Angeles' 23 turnovers. DeAndre Jordan had 11 points and 21 rebounds."}
{"game_id": "0021701032", "chunk_id": "0021701032_013", "order": 13, "role": "body", "text": "\"They are fifth in the league for fast breaks,\" Clippers coach Doc Rivers said. \"You don't turn the ball over. You turn the ball over that many times, you're going to lose the game.\""}
{"game_id": "0021701032", "chunk_id": "0021701032_014", "order": 14, "role": "body", "text": "Brewer and Adams carried the load in the first half, scoring 14 points each to help the Thunder take a 63-56 lead."}
{"game_id": "0021701032", "chunk_id": "0021701032_015", "order": 15, "role": "body", "text": "Terrance Ferguson got a 3-pointer to rattle in early in the fourth quarter to give the Thunder a 94-87 lead. He later caught a pass in midair around his waist, and then kicked his legs out and hesitated before making a reverse layup to bump the lead to 96-88."}
{"game_id": "0021701032", "chunk_id": "0021701032_016", "order": 16, "role": "body", "text": "Westbrook clinched the triple-double on a rebound in the fourth quarter. His mid-range jumper gave the Thunder a 116-107 lead and forced a Clippers timeout, and Oklahoma City maintained control from there."}
{"game_id": "0021701032", "chunk_id": "0021701032_018", "order": 18, "role": "body", "text": "Clippers: Reserve G Jawun Evans played his college ball at Oklahoma State. He finished with two assists and did not score in 8:59. ... Jordan was called for a technical foul late in the second quarter. ... Austin Rivers was issued a technical foul in the third quarter."}
{"game_id": "0021701032", "chunk_id": "0021701032_019", "order": 19, "role": "body", "text": "Thunder: Westbrook notched his 100th career triple-double Tuesday in Atlanta. He got a standing ovation in his first home game since the achievement. ... Oklahoma City included Tom Benson, the New Orleans Pelicans owner who died Thursday, in its pregame prayer. ... The Thunder had 17 steals. ... George played through a pelvic strain and Adams had a left hip contusion."}
{"game_id": "0021701032", "chunk_id": "0021701032_021", "order": 21, "role": "body", "text": "Ferguson on his acrobatic layup: \"I'm not sure what happened. It was one of those in-the-moment things.\""}
{"game_id": "0021701032", "chunk_id": "0021701032_023", "order": 23, "role": "body", "text": "Clippers: Host the Portland Trail Blazers on Sunday."}
{"game_id": "0021701032", "chunk_id": "0021701032_024", "order": 24, "role": "body", "text": "Thunder: Play at the Toronto Raptors on Sunday."}
{"game_id": "0021701032", "chunk_id": "0021701032_026", "order": 26, "role": "body", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP ."}
{"game_id": "0021701032", "chunk_id": "0021701032_028", "order": 28, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball ."}
