{"game_id": "0021400257", "chunk_id": "0021400257_001", "order": 1, "role": "lead", "text": "CHICAGO -- Normally, taking 35 shots to score 38 points is not a production level that any NBA coach would embrace.\nBut no one in the Dallas Mavericks' locker room had a problem with Monta Ellis' line in the boxscore Tuesday night.\n\"His shooting numbers were a little unusual, but every time we needed a big shot or a big play, he made it,\" Mavericks coach Rick Carlisle said.\nEllis hit three free throws with 1.2 seconds left in the fourth quarter to tie it, then made his only 3-point shot of the game for a go-ahead basket in the second overtime that lifted the Mavericks past the Chicago Bulls 132-129."}
{"game_id": "0021400257", "chunk_id": "0021400257_002", "order": 2, "role": "closing", "text": "Ellis finished with 38 points, including his trio of free throws to make it 108-all. He was fouled by the Bulls' Kirk Hinrich soon after crossing half-court, and kept the Mavs in the game.\n\"I saw out of the corner of my eye that he was about to do it, so I went into shooting mode,\" Ellis said. \"He ended up grabbing me and they called a foul.\"\nBecause the Mavericks had no timeouts at the end of regulation, the Bulls wanted to foul intentionally -- just not in that spot.\n\"That was my fault,\" Bulls coach Tom Thibodeau said. \"I wasn't real clear on where we wanted the foul. With them having no timeouts, we wanted to foul in the backcourt. It gets real tricky when he's taking it to a scoring area and the guy's facing you.\"\nEllis, though, still had to make the free throws.\n\"One of the hardest things in basketball is to stand up there and make three consecutive free throws with basically the game on the line and little or no time left,\" Carlisle said. \"He stayed in his routine and just trusted it.\"\nChicago's Derrick Rose banked in a 3-pointer at the overtime buzzer to force double OT.\nEllis' 3 put the Mavericks up 130-129, and Chandler Parsons added two foul shots. Rose missed a 3-point try as time expired.\nDirk Nowitzki added 22 despite shooting just 8 for 22 as Dallas won its fourth in row.\nPau Gasol led the Bulls with 29 points and 14 rebounds. Jimmy Butler had 23 points, Mike Dunleavy 20 and Rose 18.\nThe Bulls had won two in a row. They dropped to 2-4 at the United Center in their first home game since Nov. 15 following a seven-game road trip.\n\"Of course, we want to win at home, but we're going to get things clicking,\" Rose said. \"We're not holding our heads down. It's just a learning experience.\"\nEllis, who was 16 of 35 from the field and 5 for 5 from the free-throw line, was asked if it was fun to hoist that many shots.\n\"If you come out with the win, yes,\" he said.\nTIP-INS\nMavericks: One of the reasons for the fast start has been the play of Tyson Chandler, who was reacquired during the offseason from the New York Knicks. Chandler was averaging 11.3 points and 11.3 rebounds.\n\"He brings a lot of energy to the team,\" Carlisle said. \"He's a better player than he was the last time he was here, because he's refined some of his skills, he's more knowledgeable, because he's been with another franchise and played in a lot of big games the last three years.\"\nBulls: Doug McDermont missed his first game of the season with a sore right knee. The rookie said the knee swelled up during the plane ride back to Chicago on Sunday following the conclusion of the seven-game road trip. \"If I feel better tomorrow, I'll play. It's nothing serious at all.\" ... Taj Gibson missed his fifth straight game with a sprained left ankle. Although he is listed as day-to-day, he's unlikely to play Wednesday at Charlotte because he hasn't done any work with the team.\nUP NEXT\nThe Mavericks are at the Milwaukee Bucks on Wednesday.\nThe Bulls are back on the road Wednesday for a game against the Hornets.\nBACK-TO-BACKS\nRose didn't finish consecutive games until Sunday at Brooklyn. After missing six games and parts of others with minor leg injuries, he now has completed three straight and the Bulls plan to play him Wednesday at Charlotte despite a season-high 36 1/2 minutes on Tuesday. Gasol (50 minutes) and Joakim Noah (36) also are expected to play after dealing with injuries recently.\n\"I don't see why not,\" Thibodeau said when asked about the trio. \"We'll see how they feel tomorrow.\""}
