{"game_id": "0021700767", "chunk_id": "0021700767_001", "order": 1, "role": "lead", "text": "BOSTON --  Terry Rozier's second act as an NBA starter was just as impressive as his first."}
{"game_id": "0021700767", "chunk_id": "0021700767_002", "order": 2, "role": "body", "text": "Rozier had a career-high 31 points and seven rebounds in his second career start, Jayson Tatum added a career-high 27 points and the short-handed Boston Celtics beat the Atlanta Hawks 119-110 on Friday night."}
{"game_id": "0021700767", "chunk_id": "0021700767_003", "order": 3, "role": "body", "text": "Rozier started in place of the injured Kyrie Irving. The third-year guard became the second player in league history with a triple-double in his first start, totaling 17 points, 11 rebounds and 10 assists in Wednesday's blowout of the Knicks."}
{"game_id": "0021700767", "chunk_id": "0021700767_004", "order": 4, "role": "body", "text": "\"Both (starts had) just the same feeling,\" Rozier said. \"Just wanting to come out aggressive, do what I can on the offensive and defensive end. My teammates made it so easy for me because they play so hard. We just play hard collectively as a group.\""}
{"game_id": "0021700767", "chunk_id": "0021700767_005", "order": 5, "role": "body", "text": "Irving missed his second straight game with a right quad contusion that he suffered in Monday's win at Denver and was one of four Boston players who sat with injuries on Friday."}
{"game_id": "0021700767", "chunk_id": "0021700767_006", "order": 6, "role": "body", "text": "Rozier will soon have to yield his starting backcourt spot to Irving -- and he's fine with that."}
{"game_id": "0021700767", "chunk_id": "0021700767_007", "order": 7, "role": "body", "text": "\"Kyrie's probably one of my biggest supporters, outside of my family, through this little process,\" Rozier said. \"I know he's happy for me, and when he comes back we're just going to pick it up.\""}
{"game_id": "0021700767", "chunk_id": "0021700767_008", "order": 8, "role": "body", "text": "Jaylen Brown scored 19 points and Al Horford had 17 with seven assists to help lead Boston to its fourth win in five tries."}
{"game_id": "0021700767", "chunk_id": "0021700767_009", "order": 9, "role": "body", "text": "Taruean Prince had a career-high 31 points and eight rebounds to lead the Hawks, who have lost five of six. Dennis Schroder added 25 points and Marco Belinelli had 15."}
{"game_id": "0021700767", "chunk_id": "0021700767_010", "order": 10, "role": "body", "text": "Trailing 55-53 at halftime, Boston opened a 19-point lead heading into the fourth quarter after outscoring Atlanta 41-20 in the third."}
{"game_id": "0021700767", "chunk_id": "0021700767_011", "order": 11, "role": "body", "text": "\"They got off to a quick start (in the third),\" Prince said. \"We kind of lagged defensively. I can blame myself for that one. ... They were hitting a lot of good shots, too.\""}
{"game_id": "0021700767", "chunk_id": "0021700767_012", "order": 12, "role": "body", "text": "Rozier passed his previous career best of 23 points on a pair of free throws with 1:10 remaining in the third. He eclipsed 30 points with a 3-pointer at 6:10 of the final period. Irving is the only other Celtics player with a 30-point game this season."}
{"game_id": "0021700767", "chunk_id": "0021700767_013", "order": 13, "role": "body", "text": "Schroder's jumper with 7:19 left brought the Hawks within 10 at 103-93, but Atlanta wouldn't come any closer until the final minute with the game out of reach."}
{"game_id": "0021700767", "chunk_id": "0021700767_014", "order": 14, "role": "body", "text": "Atlanta led 32-26 after one quarter."}
{"game_id": "0021700767", "chunk_id": "0021700767_015", "order": 15, "role": "body", "text": "\"Pretty good (first) half of basketball,\" Hawks coach Mike Budenholzer said. \"It felt like we could have had more of a cushion. Six- to eight-point lead, and it's two at the half. Just a huge third quarter for them.\""}
{"game_id": "0021700767", "chunk_id": "0021700767_017", "order": 17, "role": "body", "text": "Only 10 players suited up for Boston as Irving, F Marcus Morris (bruised left hip), Gs Shane Larkin (right knee soreness) and Marcus Smart (right hand laceration) were sidelined with injuries."}
{"game_id": "0021700767", "chunk_id": "0021700767_018", "order": 18, "role": "body", "text": "\"It speaks a lot (about) the guys here,\" Horford said."}
{"game_id": "0021700767", "chunk_id": "0021700767_020", "order": 20, "role": "body", "text": "Prince was named as an injury replacement for Milwaukee's Malcolm Brogdon in the Rising Stars game during All-Star Weekend. Prince will join Hawks rookie forward John Collins on the U.S. team roster."}
{"game_id": "0021700767", "chunk_id": "0021700767_021", "order": 21, "role": "body", "text": "\"Kind of excited, kind of relieved because I felt like I did enough work this summer to be able to be in the game from the jump, but God has his own route,\" said Prince, who is Atlanta's third-leading scorer, averaging 12.3 points per game. \"That's the reason I had a little fire to me tonight.\""}
{"game_id": "0021700767", "chunk_id": "0021700767_023", "order": 23, "role": "body", "text": "The Celtics have not announced their reported signing of recently bought-out C Greg Monroe, but that didn't stop Morris from weighing in on the potential addition."}
{"game_id": "0021700767", "chunk_id": "0021700767_024", "order": 24, "role": "body", "text": "\"I think that's a great pick-up for us,\" Morris said. \"Veteran player, knows how to play the game, been around the league for a while, so I think he'd be an add to our size down low, (our) scoring ability.\""}
{"game_id": "0021700767", "chunk_id": "0021700767_026", "order": 26, "role": "body", "text": "Hawks: Schroder played after being listed as questionable with a right shoulder strain. ... F DeAndre' Bembry (left adductor strain) missed his 20th straight game."}
{"game_id": "0021700767", "chunk_id": "0021700767_027", "order": 27, "role": "body", "text": "Celtics: All five Boston starters scored in double figures for the first time Dec. 23. ... Coach Brad Stevens said Irving is feeling \"a little bit better\" and is considered day-to-day. ... Morris said he will be questionable to play Sunday. ... Smart will likely miss an additional 10 to 14 days, Stevens said."}
{"game_id": "0021700767", "chunk_id": "0021700767_029", "order": 29, "role": "body", "text": "Hawks: Complete a two-game trip Sunday against the Knicks."}
{"game_id": "0021700767", "chunk_id": "0021700767_030", "order": 30, "role": "body", "text": "Celtics: Host Portland on Sunday to wrap up a three-game homestand."}
{"game_id": "0021700767", "chunk_id": "0021700767_032", "order": 32, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
