{"game_id": "0021400792", "chunk_id": "0021400792_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Brandon Knight certainly looked like an All-Star."}
{"game_id": "0021400792", "chunk_id": "0021400792_002", "order": 2, "role": "body", "text": "Many believe the Milwaukee guard had a strong case for inclusion in this weekend's All-Star game in New York. He scored 20 points -- including the Bucks' last 10 in a third-quarter surge -- leading Milwaukee to a 111-103 victory over a Sacramento Kings team on the brink of yet another coaching change on Wednesday night."}
{"game_id": "0021400792", "chunk_id": "0021400792_003", "order": 3, "role": "body", "text": "\"B-Knight's playing at an All-Star level,\" Bucks coach Jason Kidd said. \"When he has the ball, we always feel like something good's going to happen.\""}
{"game_id": "0021400792", "chunk_id": "0021400792_004", "order": 4, "role": "body", "text": "There are no such good feelings these days for the Kings. DeMarcus Cousins had 28 points and 19 rebounds for a team about to make its second coaching change of the season."}
{"game_id": "0021400792", "chunk_id": "0021400792_005", "order": 5, "role": "body", "text": "Before the game, the Kings and George Karl agreed to the framework of a deal for him to take over as coach, according to a person familiar with the negotiations. The person spoke to The Associated Press on condition of anonymity because the discussions were private."}
{"game_id": "0021400792", "chunk_id": "0021400792_006", "order": 6, "role": "body", "text": "With all the turmoil surrounding the team, Cousins said he wasn't focused on his upcoming All-Star game appearance."}
{"game_id": "0021400792", "chunk_id": "0021400792_007", "order": 7, "role": "body", "text": "\"There is so much other stuff going on I really haven't gotten the opportunity to appreciate the fact that I made it for the first time,\" Cousins said. \"There's been a lot of stuff circling around this team. It's been a big distraction. I look forward to the weekend and this break.\""}
{"game_id": "0021400792", "chunk_id": "0021400792_008", "order": 8, "role": "body", "text": "That meant the game was the last for coach Tyrone Corbin. Karl will be Sacramento's third coach this season, as the Kings fired Michael Malone in December."}
{"game_id": "0021400792", "chunk_id": "0021400792_009", "order": 9, "role": "body", "text": "Cousins didn't share Corbin's final postgame message: \"It's something that's between us but just know they we appreciated him and the whole coaching staff.\""}
{"game_id": "0021400792", "chunk_id": "0021400792_010", "order": 10, "role": "body", "text": "It was a rough end to Corbin's suddenly shorter-than-expected tenure."}
{"game_id": "0021400792", "chunk_id": "0021400792_011", "order": 11, "role": "body", "text": "\"I've been around this league a long time, and I've seen a lot of crazy things happen,\" Corbin said before the game. \"It's not an easy situation to be in. But you have to move forward, and I have to make sure I'm an example.\""}
{"game_id": "0021400792", "chunk_id": "0021400792_012", "order": 12, "role": "body", "text": "O.J. Mayo scored 21 points off the bench and Khris Middleton added 15 points and 10 rebounds for the Bucks, who go into the All-Star break having won nine of their last 11 and six straight at home. According to the Elias Sports Bureau, the Bucks are the first team in NBA history to double their previous season's win total (15) before the All-Star break."}
{"game_id": "0021400792", "chunk_id": "0021400792_013", "order": 13, "role": "body", "text": "Suddenly, the Bucks aren't just talking playoffs -- they're talking seeding."}
{"game_id": "0021400792", "chunk_id": "0021400792_014", "order": 14, "role": "body", "text": "\"We can't use this week to kind of sit down and be happy,\" John Henson said. \"We've got to push. We keep making a run, and Cleveland and Chicago lose a few more games, we could be in the mix for that.\""}
{"game_id": "0021400792", "chunk_id": "0021400792_015", "order": 15, "role": "body", "text": "Told that Miami Heat star Dwyane Wade lobbied for Knight's inclusion after Wade pulled out of the All-Star game, Knight seemed to be flattered. But if he was frustrated about the snub, he didn't let it show. Knight is scheduled to participate in the All-Star skills challenge."}
{"game_id": "0021400792", "chunk_id": "0021400792_016", "order": 16, "role": "body", "text": "\"That means a lot,\" Knight said. \"But for me, it's a team (focused) motivation.\""}
{"game_id": "0021400792", "chunk_id": "0021400792_018", "order": 18, "role": "body", "text": "Kings: Corbin didn't say whether the team's management had told him anything about his status. ... G Darren Collison missed his fourth straight game with a right hip flexor strain."}
{"game_id": "0021400792", "chunk_id": "0021400792_019", "order": 19, "role": "body", "text": "Bucks: Bucks G Jerryd Bayless left the game with a right hip flexor strain in the first half and did not return. ... The Bucks announced that they'll retire the No. 10 jersey of former player Bob Dandridge in a halftime ceremony during their March 7 game against Washington."}
{"game_id": "0021400792", "chunk_id": "0021400792_021", "order": 21, "role": "body", "text": "Bucks C Larry Sanders, who was suspended by the NBA Jan. 16 for a violation of the league's drug policy, was listed as \"not with team -- personal\" on Wednesday -- an indication that his suspension has ended."}
{"game_id": "0021400792", "chunk_id": "0021400792_022", "order": 22, "role": "body", "text": "Kidd left the door open for Sanders to return to the team after the All-Star break."}
{"game_id": "0021400792", "chunk_id": "0021400792_023", "order": 23, "role": "body", "text": "\"That'll be determined during the break,\" Kidd said. \"We'll get together and talk and get him back in the fold with the family, if that's what's needed, and we'll go from there.\""}
{"game_id": "0021400792", "chunk_id": "0021400792_025", "order": 25, "role": "body", "text": "Lobbying for Dandridge's jersey retirement came from a perhaps an unexpected source. During a Pearl Jam concert in Milwaukee last October, bassist Jeff Ament \"raised\" a No. 10 Bucks jersey into the lighting fixtures at the top of the band's stage."}
{"game_id": "0021400792", "chunk_id": "0021400792_026", "order": 26, "role": "body", "text": "Dandridge's jersey is the eighth to be retired in Bucks franchise history, and the first since Kareem Abdul-Jabbar's 33 was on April 24, 1993."}
{"game_id": "0021400792", "chunk_id": "0021400792_028", "order": 28, "role": "body", "text": "Kings: Home against Boston on Feb. 20."}
{"game_id": "0021400792", "chunk_id": "0021400792_029", "order": 29, "role": "closing", "text": "Bucks: Home against Denver on Feb. 20."}
