{"game_id": "0021400326", "chunk_id": "0021400326_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- The Cleveland Cavaliers found out before Thursday's game that they would be without LeBron James.\nThey couldn't have found a less sympathetic opponent. Oklahoma City, which struggled without injured stars Russell Westbrook and Kevin Durant the first month of the season, took advantage of the short-handed Cavaliers with a 103-94 victory.\nJames sat out with left knee soreness, and without him, Cleveland's winning streak ended at eight games. Cavaliers coach David Blatt said before the game that James' injury wasn't too serious, and he would be day-to-day.\nOklahoma City still expected a tough game because Kyrie Irving and Kevin Love are capable players."}
{"game_id": "0021400326", "chunk_id": "0021400326_002", "order": 2, "role": "body", "text": "\"We told them right from the start they're a good team,\" Thunder coach Scott Brooks said. \"They've got two All-Stars on the court that are really good, and they're going to have an opportunity to have the ball in their hands even more. We knew they were going to compete. We weren't taking them lightly.\"\nOklahoma City's now-healthy dynamic duo took control as Westbrook scored 26 points on 12-for-24 shooting with eight assists and seven rebounds, and Durant scored 19 points.\nIrving scored 20 points for Cleveland, but he made just 7 of 21 shots while struggling to finish against the ultra-athletic Westbrook.\nThe Thunder have won six of seven after a 3-12 start.\n\"We're growing,\" Durant said. \"Every single game, you can see defensively, offensively, we're starting to catch a stride. We've just got to continue to do it.\"\nLove had 18 points and 16 rebounds, and Tristan Thompson added 14 points and 13 rebounds for the Cavaliers.\nCleveland had another injury scare in the first half. With 1:31 left in the second quarter, Irving jumped to contest a shot by Westbrook, and his knee connected with Westbrook's knee on the way down. A lot went through Blatt's head as he watched Irving writhe on the floor in front of the Thunder bench.\n\"Fear. Worry. Concern. And hope, which ultimately won the day,\" Blatt said. \"There's a great saying in Russian ... 'Hope dies last.' Thank goodness he got up and he was able to play.\"\nIrving expects to play at New Orleans on Friday.\n\"It will definitely stiffen up on me, without a doubt, but I plan on playing tomorrow,\" he said. \"It just depends on how it feels in the morning. But as of right now, I'm going to gut it out, no matter what.\""}
{"game_id": "0021400326", "chunk_id": "0021400326_003", "order": 3, "role": "closing", "text": "A 10-0 run by the Thunder, featuring 3-pointers by Serge Ibaka and Anthony Morrow, gave Oklahoma City a 67-57 lead in the third quarter.\nDurant, who had been quiet for most of the game, found Morrow for a 3-pointer, then made a 3 himself to help Oklahoma City take a 78-66 lead into the fourth quarter. A step-back jumper, then a 3 by Jackson bumped Oklahoma City's lead to 83-66.\nCleveland made a final push to make it close in the final minutes. A tip-in by Thompson cut Oklahoma City's lead to 95-91 with two minutes to play before Oklahoma City held on.\nTIP-INS\nThunder: Westbrook made 5 of 7 shots in the first quarter while his teammates made 3 of 15. ... Durant, last year's scoring champion, went scoreless in the first quarter. ... F Perry Jones, who has been battling a right knee contusion, did not play. ... Ibaka fouled out with seven points.\nCavaliers: Matthew Dellavedova started in James' spot. He finished with 14 points and made 4 of 6 3-pointers. ... Cleveland made 10 of 22 shots in the first quarter, but just 21 of 63 the rest of the game.\nPIVOTAL MOMENT\nOklahoma City's 20-point second second-half lead was trimmed to four with two minutes to play before Durant dunked on a post-up, then hit a fade-away to push the lead back out to eight with 1:14 to play. He scored eight points in the final 1:45.\n\"That's what he does,\" Westbrook said. \"I mean, he's been doing that, and that's why he's the MVP. He does that every night, and tonight, you could see he was getting his rhythm back, and he closed the game for us.\"\nSURPRISE VISIT\nJames made a stop in Oklahoma City's locker room after the game to talk to Durant. He asked security permission for entry, then left out a back exit. Media was allowed into the locker room after about 5 minutes. When asked if he could describe the conversation, Durant simply said, \"No.\"\nUP NEXT\nThunder: At Minnesota on Friday.\nCavaliers: At New Orleans on Friday."}
