{"game_id": "0021700437", "chunk_id": "0021700437_001", "order": 1, "role": "lead", "text": "TORONTO --  After a high-scoring first half, the Sacramento Kings suddenly found themselves struggling to put points on the board against the Toronto Raptors."}
{"game_id": "0021700437", "chunk_id": "0021700437_002", "order": 2, "role": "body", "text": "DeMar DeRozan scored 21 points, Jonas Valanciunas had 13 points and a season-high 16 rebounds and Toronto held Sacramento to 30 second-half points Sunday, beating the Kings 108-93."}
{"game_id": "0021700437", "chunk_id": "0021700437_003", "order": 3, "role": "body", "text": "Kyle Lowry added 16 points and Norman Powell had 14 for the Raptors, who won their ninth straight home game. Toronto is an NBA-best 11-1 at home."}
{"game_id": "0021700437", "chunk_id": "0021700437_004", "order": 4, "role": "body", "text": "DeRozan gave the Raptors a 61-60 lead with a pull-up jump shot with less than two seconds remaining in the second quarter, but George Hill banked in a 46-foot 3-pointer from midcourt at the buzzer, giving Sacramento a 63-61 edge at the intermission. The Kings shot 61.9 percent in the first half, making 26 of 42 field goal attempts."}
{"game_id": "0021700437", "chunk_id": "0021700437_005", "order": 5, "role": "body", "text": "Sacramento scored 14 points in the third quarter, making five of 18 shots, then followed up with 16 points in the fourth."}
{"game_id": "0021700437", "chunk_id": "0021700437_006", "order": 6, "role": "body", "text": "\"I thought we played a little bit slower in the second half,\" Kings coach Dave Joerger said. \"I think both teams were in there saying `Man, we can't give up 60 points by halftime.' Maybe we got a little slow. I credit their defense.\""}
{"game_id": "0021700437", "chunk_id": "0021700437_007", "order": 7, "role": "body", "text": "Toronto won for the ninth time in its past 10 and improved to 11-4 against Western Conference opponents."}
{"game_id": "0021700437", "chunk_id": "0021700437_008", "order": 8, "role": "body", "text": "\"Any team in this league, you let them shoot 61 percent, it's way too high,\" Raptors coach Dwane Casey said. \"We held them to 31 percent in the second half, which is admirable, but we can't play with fire.\""}
{"game_id": "0021700437", "chunk_id": "0021700437_009", "order": 9, "role": "body", "text": "Lowry said the Raptors \"tightened the screws a little bit\" on defense in the third and fourth quarters."}
{"game_id": "0021700437", "chunk_id": "0021700437_010", "order": 10, "role": "body", "text": "Sacramento trailed 96-88 after a jump shot by Bogdan Bogdanovic with 2:28 remaining, but a step-back 3-pointer by Fred VanVleet with the shot clock expiring gave Toronto a 99-88 edge with 1:38 left."}
{"game_id": "0021700437", "chunk_id": "0021700437_011", "order": 11, "role": "body", "text": "\"It was big,\" DeRozan said of VanVleet's shot. \"We needed a bucket at that time. It shifted the momentum to kind of seal it for us and run away with it after that.\""}
{"game_id": "0021700437", "chunk_id": "0021700437_012", "order": 12, "role": "body", "text": "After a Kings timeout, and a missed 3-pointer by Hill, Lowry made it a 14-point lead with his fourth 3-pointer."}
{"game_id": "0021700437", "chunk_id": "0021700437_013", "order": 13, "role": "body", "text": "Bogdanovic and Garrett Temple each scored 18 points and Hill had 16 for the Kings, who are 4-13 away from home, tied with Atlanta for the most road losses in the league."}
{"game_id": "0021700437", "chunk_id": "0021700437_014", "order": 14, "role": "body", "text": "The Raptors, who snapped an eight-game losing streak in Sacramento with a 102-87 road win last Sunday, swept the Kings for the first time since 2014-15."}
{"game_id": "0021700437", "chunk_id": "0021700437_015", "order": 15, "role": "body", "text": "Sacramento, which lost for the fifth time in seven games, was without leading scorer and rebounder Zach Randolph (rest) and guard De'Aaron Fox, who sat for the first time this season because of a bruised right thigh sustained in Thursday's loss at Minnesota."}
{"game_id": "0021700437", "chunk_id": "0021700437_016", "order": 16, "role": "body", "text": "Raptors forward Serge Ibaka was not available (left knee), but C.J. Miles returned after missing Friday's game because of a sore left shoulder. Miles started for the first time this season."}
{"game_id": "0021700437", "chunk_id": "0021700437_017", "order": 17, "role": "body", "text": "Sacramento made seven turnovers in the third, two of them during a 10-2 Toronto run late in the quarter that gave the Raptors an 83-77 lead heading to the fourth."}
{"game_id": "0021700437", "chunk_id": "0021700437_019", "order": 19, "role": "body", "text": "Kings: Shot a season-low eight free throws, compared to 28 for Toronto. Sacramento's six made free throws were also a season-low. ... Vince Carter led the Kings with three blocks."}
{"game_id": "0021700437", "chunk_id": "0021700437_020", "order": 20, "role": "body", "text": "Raptors: All five starters scored in double figures. ... Six of Toronto's first field goal attempts were 3-pointers. They made four."}
{"game_id": "0021700437", "chunk_id": "0021700437_022", "order": 22, "role": "body", "text": "A five-time All-Star in his seven seasons with the Raptors, Carter was cheered during pregame introductions and every time he checked in at what could be his final game in Toronto. Fans stood and cheered when Carter was replaced late in the fourth, and he acknowledged the crowd with a wave. Toronto has embraced Carter in recent years after treating him with disdain for more than a decade following his departure from Toronto."}
{"game_id": "0021700437", "chunk_id": "0021700437_023", "order": 23, "role": "body", "text": "Carter, who finished with four points, said the change in reception hasn't changed the way he feels about his first NBA home."}
{"game_id": "0021700437", "chunk_id": "0021700437_024", "order": 24, "role": "body", "text": "\"I still love being here,\" he said. \"There's nothing like it. I've been on two different sides of `there's nothing like it' but it's still a place that's near and dear to me.\""}
{"game_id": "0021700437", "chunk_id": "0021700437_026", "order": 26, "role": "body", "text": "Kings: Visit Philadelphia on Tuesday. It's the first game of a back-to-back for Sacramento, which wraps up a four-game road trip at Brooklyn on Wednesday."}
{"game_id": "0021700437", "chunk_id": "0021700437_027", "order": 27, "role": "body", "text": "Raptors: Visit the Hornets on Wednesday. Toronto is 11-25 all time in Charlotte."}
{"game_id": "0021700437", "chunk_id": "0021700437_029", "order": 29, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
