{"game_id": "0021400144", "chunk_id": "0021400144_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- The Houston Rockets prepared for Monday night's showdown with the gritty Memphis Grizzlies with one of the NBA's ugliest games in years.\nJames Harden scored 19 points, and the Rockets beat the Oklahoma City Thunder 69-65 on Sunday night.\nThe last time a team won with 69 or fewer points was Detroit's 64-62 victory over Utah on March 13, 2005, according to STATS. Both teams shot below 30 percent from the field -- the last time that happened was Oct. 29, 2003, when Denver beat San Antonio 80-72."}
{"game_id": "0021400144", "chunk_id": "0021400144_002", "order": 2, "role": "body", "text": "Houston shot just 28.8 percent. The last time an NBA team won with a lower percentage was on Feb. 19, 2000, when Chicago shot 28.6 percent and beat the Los Angeles Clippers 74-72.\n\"That game will not go in the NBA Hall of Fame,\" Rockets coach Kevin McHale said.\nHouston escaped, and now, the Rockets travel to Memphis for a matchup of 9-1 teams that share the NBA's best record.\n\"Same kind of game, probably,\" Harden said. \"A slow, grinding game, and we just need to rebuild our mental toughness, so it's going to be another great challenge for us.\"\nDwight Howard had 12 points and nine rebounds for Houston, and Patrick Beverley added 12 points and eight boards.\nWith the score tied at 65, Harden hit a 3-pointer with Jeremy Lamb in his face with 1:19 to play. With the Rockets still leading 68-65, Harden missed another contested 3 against Lamb, giving the Thunder a chance to tie.\nOklahoma City's Reggie Jackson missed a deep 3-pointer, and Harden made one of two free throws with 4.7 seconds left to put the game away.\nJackson had 15 points and 11 rebounds for the Thunder, and Lance Thomas added 15 points.\nThe Rockets led 42-33 at halftime. Oklahoma City blocked 11 shots for the team's highest total in a half since moving from Seattle for the 2008-09 season. Steven Adams had a career-high six blocks before the break, but the Thunder couldn't take advantage because of 25 percent shooting.\nThomas' long jumper gave the Thunder their first lead at 51-49 late in the third quarter, but Harden's two free throws with 3.1 seconds left made it a tie game heading into the fourth.\nNick Collison was called for a Flagrant-1 foul against Howard. He made one of the two free throws, and then Francisco Garcia made a 3-pointer to give the Rockets a 55-54 lead, and the game was close the rest of the way.\nThe game featured four technical fouls, a flagrant 1 and a lot of exchanged words.\n\"I don't think there was bad blood. I think it was just competitive,\" Adams said. \"I think we're just two highly competitive teams, and we just want to go after it, really.\"\n---\nQUOTE OF THE NIGHT\n\"We weren't very sharp, and we found a way to win,\" McHale said. \"That's what it's all about -- going out there and just grinding out a win.\""}
{"game_id": "0021400144", "chunk_id": "0021400144_003", "order": 3, "role": "body", "text": "BLOCK PARTY\nThe Thunder blocked 15 shots, two short of their franchise record. Adams had six, Serge Ibaka had five and Kendrick Perkins finished with three."}
{"game_id": "0021400144", "chunk_id": "0021400144_004", "order": 4, "role": "body", "text": "LOCKDOWN D\nBeverley and Trevor Ariza combined to slow Jackson, who was averaging 22.4 points coming into the night. Jackson missed all six of his shots in the first half and went 3 of 11 for the game."}
{"game_id": "0021400144", "chunk_id": "0021400144_005", "order": 5, "role": "body", "text": "TIP-INS\nRockets: The Rockets held the Thunder to 22 percent shooting and no points in the paint in the first quarter. ... Beverley made a tip-in with less than a second remaining in the first half. ... The Rockets made just 16 of 30 free throws. ... Howard and Harden combined to make just nine of 31 field-goal attempts.\nThunder: Exactly one month after surgery on his broken right foot, reigning MVP Kevin Durant put up some shots during pregame warmups. Coach Scott Brooks said Durant is getting to the point where he can shoot off his toes. ... Brooks said F Perry Jones (right knee contusion) and F Mitch McGary (left foot fracture) are still not ready to return. ... Adams took a blow to the head in the third quarter, but he returned in the fourth."}
{"game_id": "0021400144", "chunk_id": "0021400144_006", "order": 6, "role": "closing", "text": "UP NEXT\nRockets: Visit Memphis on Monday.\nThunder: Visit Utah on Tuesday."}
