{"game_id": "0021400298", "chunk_id": "0021400298_001", "order": 1, "role": "lead", "text": "DALLAS --  Chandler Parsons did some extra work on his shooting in the morning, then made 11 of 14 shots on Sunday night."}
{"game_id": "0021400298", "chunk_id": "0021400298_002", "order": 2, "role": "body", "text": "Parsons' 28 points helped the Dallas Mavericks roll to a 125-102 victory over the Milwaukee Bucks."}
{"game_id": "0021400298", "chunk_id": "0021400298_003", "order": 3, "role": "body", "text": "\"He is just really working at it,\" Mavericks coach Rick Carlisle said. \"We canceled shootaround, but he came in and wanted to shoot, so we shot for 20-30 minutes.\""}
{"game_id": "0021400298", "chunk_id": "0021400298_004", "order": 4, "role": "body", "text": "The Mavericks built a 13-point lead with a 12-0 run in the first quarter and didn't trail again in their second victory in five days over the Bucks."}
{"game_id": "0021400298", "chunk_id": "0021400298_005", "order": 5, "role": "body", "text": "Parsons had seven points in that run and nine in the opening period."}
{"game_id": "0021400298", "chunk_id": "0021400298_006", "order": 6, "role": "body", "text": "\"I wanted to work with (Carlisle). I wasn't the only one here, but I just wanted to come in not asleep and be groggy,\" he said."}
{"game_id": "0021400298", "chunk_id": "0021400298_007", "order": 7, "role": "body", "text": "\"I don't think one extra shooting session's going to help or hurt you, but it's always good to get extra work in.\""}
{"game_id": "0021400298", "chunk_id": "0021400298_008", "order": 8, "role": "body", "text": "Dallas made 49 of 84 field goal attempts (58 percent)."}
{"game_id": "0021400298", "chunk_id": "0021400298_009", "order": 9, "role": "body", "text": "\"When you don't put any energy and effort into it, guys are going to get wide-open shots and knock them down,\" Bucks coach Jason Kidd said. \"They did that.\""}
{"game_id": "0021400298", "chunk_id": "0021400298_010", "order": 10, "role": "body", "text": "Dirk Nowitzki, who was rested for the game at Milwaukee on Wednesday and scored a season-low 10 points Friday, bounced back with 21 and Monta Ellis added 19. Ellis has averaged 26.8 points in his last six, including three of 30-plus."}
{"game_id": "0021400298", "chunk_id": "0021400298_011", "order": 11, "role": "body", "text": "\"I thought we shared the ball and we made some shots and attacked the basket,\" Nowitzki said."}
{"game_id": "0021400298", "chunk_id": "0021400298_012", "order": 12, "role": "body", "text": "Parsons' 28 points were one off his season high, and he didn't play in the fourth quarter."}
{"game_id": "0021400298", "chunk_id": "0021400298_013", "order": 13, "role": "body", "text": "\"When you make your first couple, it changes the whole game, makes everything a little easier,\" Parsons said."}
{"game_id": "0021400298", "chunk_id": "0021400298_014", "order": 14, "role": "body", "text": "All five Bucks starters and backup center Zaza Pachulia scored in double figures, led by Giannis Antetokounmpo's 18 points."}
{"game_id": "0021400298", "chunk_id": "0021400298_015", "order": 15, "role": "body", "text": "\"They came out tonight on fire. They were ready to roll,\" said Milwaukee's O.J. Mayo, who scored 12 points."}
{"game_id": "0021400298", "chunk_id": "0021400298_016", "order": 16, "role": "body", "text": "The Bucks pulled within six four times in the second quarter, but Dallas scored the last four points of the first half to build a 59-46 lead."}
{"game_id": "0021400298", "chunk_id": "0021400298_017", "order": 17, "role": "body", "text": "The Mavericks outscored Milwaukee 17-4 over the last 5 1/2 minutes of the quarter to lead 90-71 after three."}
{"game_id": "0021400298", "chunk_id": "0021400298_019", "order": 19, "role": "body", "text": "Bucks: Milwaukee had made 59 percent of its 3-point shots (16 for 27) in the two previous games, including 7 for 11 (64 percent) at home Wednesday in a 107-105 loss to Dallas. Milwaukee was only 4 for 15 (27 percent) Sunday. ... C Larry Sanders returned to the starting lineup. He had played just 19 minutes off the bench in Friday's win at Miami because of an illness."}
{"game_id": "0021400298", "chunk_id": "0021400298_020", "order": 20, "role": "body", "text": "Mavericks: C Tyson Chandler had seven rebounds, giving him 107 in his last seven games (15.3 average). ... Dallas didn't play as much zone defense as in Wednesday's game at Milwaukee. When asked the difference between the current Mavericks' and the 2010-11 NBA champions' zone, Carlisle said, \"Jason Kidd was on that team. He was a great zone player.\" ... Owner Mark Cuban said he hoped G Raymond Felton (sprained right ankle), who has missed all season, would be able to play before Christmas. ... Cuban also said he had made a proposal to the Big 12 a few years ago for an annual conference championship football game."}
{"game_id": "0021400298", "chunk_id": "0021400298_022", "order": 22, "role": "body", "text": "At the end of the first quarter, Milwaukee's Jared Dudley put in a shot from beyond midcourt, about 55 feet from the basket. Officials ruled the shot came after the buzzer, so it didn't count."}
{"game_id": "0021400298", "chunk_id": "0021400298_024", "order": 24, "role": "body", "text": "The Mavericks hosted the 10th anniversary of \"Seats for Soldiers,\" in which season ticket holders give up their front-row seats to military personnel. It was also the 73rd anniversary of the bombing of Pearl Harbor. Edward Guthrie, 94, who was serving in the Navy at Pearl Harbor on Dec. 7, 1941, was among those honored. Dallas is 9-1 on \"Seats for Soldiers\" Night, started by Cuban's brother-in-law, Neal Hawks."}
{"game_id": "0021400298", "chunk_id": "0021400298_026", "order": 26, "role": "body", "text": "Bucks: Visit Oklahoma City on Tuesday."}
{"game_id": "0021400298", "chunk_id": "0021400298_027", "order": 27, "role": "closing", "text": "Mavericks: Visit Memphis on Tuesday."}
