{"game_id": "0021700590", "chunk_id": "0021700590_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  For nine games, the Los Angeles Lakers couldn't figure out how to get their defense back on track. That changed against the Atlanta Hawks."}
{"game_id": "0021700590", "chunk_id": "0021700590_002", "order": 2, "role": "body", "text": "The Lakers mae 13 steals and scored 26 points off turnovers Sunday night en route to a 132-113 victory to end a nine-game losing streak."}
{"game_id": "0021700590", "chunk_id": "0021700590_003", "order": 3, "role": "body", "text": "\"It was good to kind of see the guys get back to that mode where defense anchors what we do offensively instead of the other way around,\" Lakers coach Luke Walton said."}
{"game_id": "0021700590", "chunk_id": "0021700590_004", "order": 4, "role": "body", "text": "Brandon Ingram had 20 points and seven assists while Lonzo Ball finished with 13 points, 10 assists and six rebounds. Julius Randle had 15 points and nine rebounds in his sixth straight start."}
{"game_id": "0021700590", "chunk_id": "0021700590_005", "order": 5, "role": "body", "text": "Nine Lakers made at least one steal. Brook Lopez had four on his own."}
{"game_id": "0021700590", "chunk_id": "0021700590_006", "order": 6, "role": "body", "text": "\"Everybody was on a string together,\" Ingram said. \"We trusted each other, whether it was individual defense, whether it was help-side defense, transition defense. I think we all trusted each other.\""}
{"game_id": "0021700590", "chunk_id": "0021700590_007", "order": 7, "role": "body", "text": "Dennis Schroder led the Hawks with 27 points on 10-of-23 shooting. Kent Bazemore and John Collins added 15 points apiece."}
{"game_id": "0021700590", "chunk_id": "0021700590_008", "order": 8, "role": "body", "text": "Los Angeles led by as many as 26 points -- its biggest margin this season -- and enjoyed a strong shooting night. The Lakers made 55.8 percent of their field goals, and shot 44 percent from 3-point range."}
{"game_id": "0021700590", "chunk_id": "0021700590_009", "order": 9, "role": "body", "text": "Even free throws went in for the Lakers, who came into Sunday as the worst team in the league in that category. Los Angeles made 20 of 25."}
{"game_id": "0021700590", "chunk_id": "0021700590_010", "order": 10, "role": "body", "text": "The Hawks, on the other hand, shot 44 percent from the field."}
{"game_id": "0021700590", "chunk_id": "0021700590_011", "order": 11, "role": "body", "text": "Los Angeles went on a 16-3 run in the opening minutes of the second quarter that culminated in a transition 3-pointer by Ball and a basket by Larry Nance Jr. off a pass from Josh Hart. The lead quickly ballooned to 20 after another 3 by Ball and a layup by Kyle Kuzma."}
{"game_id": "0021700590", "chunk_id": "0021700590_012", "order": 12, "role": "body", "text": "In all, the Lakers outscored the Hawks 37-21 in the second period."}
{"game_id": "0021700590", "chunk_id": "0021700590_013", "order": 13, "role": "body", "text": "\"They were out and running on the fast break, making 3s, making layups,\" Hawks coach Mike Budenholzer said. \"I think it started with good defense on their part. We weren't executing offensively.\""}
{"game_id": "0021700590", "chunk_id": "0021700590_014", "order": 14, "role": "body", "text": "The Hawks closed within 13 with 10:09 remaining in the fourth quarter, but a long pass from Kuzma led to a one-handed dunk by Ball, giving the Lakers a 17-point lead. Hart's 3-pointer with 5:33 left in the game gave Los Angeles its biggest lead."}
{"game_id": "0021700590", "chunk_id": "0021700590_015", "order": 15, "role": "body", "text": "The Hawks started the game on a 10-2 run, but the Lakers recovered. Kuzma's basket on a strong drive gave Los Angeles a 29-27 lead just before the first-quarter buzzer."}
{"game_id": "0021700590", "chunk_id": "0021700590_017", "order": 17, "role": "body", "text": "Lakers: Won for the first time at home since Nov. 21 against the Chicago Bulls. ... Beat the Hawks 46 years earlier to the day for an NBA-record 33rd straight win. ... Eight Lakers scored in double figures."}
{"game_id": "0021700590", "chunk_id": "0021700590_018", "order": 18, "role": "body", "text": "Hawks: Budenholzer picked up a technical foul in the first quarter. ... Taurean Prince dislocated his right ring finger in the first quarter but returned to the game."}
{"game_id": "0021700590", "chunk_id": "0021700590_020", "order": 20, "role": "body", "text": "Walton said earlier Sunday he wasn't bothered by LaVar Ball's comment to ESPN that he had lost control of the team. The coach added that his only concern is his relationship with Lonzo Ball. Walton said he'd received messages of support from coaches who advised him to \"not be concerned with parents and what other people outside the organization think.\""}
{"game_id": "0021700590", "chunk_id": "0021700590_022", "order": 22, "role": "body", "text": "The Lakers scored 42 fast-break points, tying a franchise record. It was their largest such total since 2001. Los Angeles outscored Atlanta in transition 28-0 in the first half alone."}
{"game_id": "0021700590", "chunk_id": "0021700590_023", "order": 23, "role": "body", "text": "\"That's what we're great at,\" Larry Nance Jr. said. \"When we have Zo, we're a beast when it comes to running. He's so good at finding it, pushing it and hitting open guys that it's contagious and then everybody gets involved.\""}
{"game_id": "0021700590", "chunk_id": "0021700590_025", "order": 25, "role": "body", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
{"game_id": "0021700590", "chunk_id": "0021700590_027", "order": 27, "role": "closing", "text": "This story has been corrected to show reference to record streak came 46 years ago."}
