{"game_id": "0021300648", "chunk_id": "0021300648_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- Kevin Durant went from a game off to a game to remember.\nDurant had 32 points, 14 rebounds and 10 assists in his return from a shoulder injury to lead the Oklahoma City Thunder to their seventh straight win, a 103-91 victory over the Philadelphia 76ers on Saturday night.\nDurant was scratched from the Thunder's win over Boston on Friday with a sprained right shoulder. Against the Sixers, Durant was one of the first Thunder to hit the court for pregame warm-ups. He dunked several times, even hanging on the rim for several seconds after one, and was fit to play."}
{"game_id": "0021300648", "chunk_id": "0021300648_002", "order": 2, "role": "closing", "text": "\"I hate sitting out,\" Durant said, \"but it was best for me and my shoulder. I guess that day off was needed.\"\nDurant and the Thunder let the Sixers hang around before putting the finishing touches on their ninth straight win over Philadelphia. The Sixers trimmed Oklahoma City's lead to four in the third quarter before Durant keyed a 14-5 run to open up a comfortable lead.\nDurant, the NBA's leading scorer, has scored at least 30 points in his last 10 games.\nSerge Ibaka had 25 points and 11 rebounds for the Thunder.\nJames Anderson led the Sixers with 19 points. Thaddeus Young had 13 points, 10 rebounds and eight steals.\nOklahoma City has managed to stay atop the West with Russell Westbrook out since Christmas recovering from right knee surgery. They entered the night with the best record in the Western Conference, one-half game ahead of the San Antonio Spurs.\nWithout Durant, the Thunder still managed to beat Boston 101-83 on Friday night. With him, they had enough to pull away from a plucky Sixers team that already has wins over Miami, Chicago and Portland this season.\n\"We will do our best with some basic things to guard him,\" Sixers coach Brett Brown said before the game.\nDurant toyed with the basic defense and hardly missed, throwing down dunks and knocking down easy buckets in the paint, and looked every bit an All-Star. Durant, averaging 38.2 points over his last 12 games, made 12 of 17 shots for his fifth career triple-double.\nOklahoma City coach Scott Brooks watched from the baseline when Durant warmed up. Durant answered a series of questions from the training staff after every few shots and was soon listed in the starting lineup. The Sixers had one of their largest crowds of the season and the stands were dotted with fans in Durant jerseys who surely would have been crushed had he not played.\nThe Sixers must have wished he sat this one out.\n\"Everybody's scared because he's Kevin Durant and he scores in such a variety of ways,\" Brown said. \"He is the NBA's hottest player. He's always been an incredibly difficult guard. You blink and he's got a triple-double.\"\nDurant sank his only 3 of the game from the top of the arc over Michael Carter-Williams for a 43-34 lead. Carter-Williams had one of the few rough nights of his stellar rookie season. Ibaka stuffed him twice early in the game, setting an early tone for Oklahoma City's toughness.\n\"Carter-Williams, he really doesn't know what Serge does,\" Durant said.\nHe does know.\nSpencer Hawes and the Sixers flirted with an upset after a big rally in the third. Hawes hit a 3, had a big dunk over Thabo Sefolosha and a floating jumper in succession to help trim the gap to 69-65. Durant's driving dunk put the Thunder back on track and en route to their fourth win in five nights.\n\"We don't make an excuse,\" Brooks said, \"but it is tough. But these guys, they step up every night.\"\nGame notes\n76ers G Tony Wroten returned from a three-game absence because of a sprained right ankle and scored nine points. ... Oklahoma City won its 12th straight road game against the Eastern Conference, and is 13-2 against the East this season. ... Durant's triple-double came a night after the 76ers allowed one to Toronto G Kyle Lowry."}
