{"game_id": "0021700339", "chunk_id": "0021700339_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  A well-rested Kemba Walker was too much for an Orlando Magic team playing on the second night of a back-to-back."}
{"game_id": "0021700339", "chunk_id": "0021700339_002", "order": 2, "role": "body", "text": "Walker returned to the starting lineup after missing two games with a shoulder injury and provided instant energy to a Hornets team mired in a four-game losing streak."}
{"game_id": "0021700339", "chunk_id": "0021700339_003", "order": 3, "role": "body", "text": "Walker had 29 points and seven assists, Dwight Howard reached a rebounding milestone and Charlotte defeated the Orlando Magic 104-94 on Monday."}
{"game_id": "0021700339", "chunk_id": "0021700339_004", "order": 4, "role": "body", "text": "\"I feel like when I'm not around things are different, and when I come back it changes,\" Walker said. \"That's the kind of guy I am. I'm the leader of this team and my team goes as I go. Depending on my mood, my attitude, it kind of trickles down to everybody else. If I'm upset, a lot of the guys get upset. When I'm out there enjoying the game and having fun and I'm intense, my teammates follow.\""}
{"game_id": "0021700339", "chunk_id": "0021700339_005", "order": 5, "role": "body", "text": "Walker became the first player in franchise history with 200 career 20-point games. He made all 14 free throw attempts, tying a career high."}
{"game_id": "0021700339", "chunk_id": "0021700339_006", "order": 6, "role": "body", "text": "Howard had 12 points and nine rebounds, moving past former Charlotte coach Paul Silas and Dikembe Mutombo for 19th on the all-time NBA rebounding list."}
{"game_id": "0021700339", "chunk_id": "0021700339_007", "order": 7, "role": "body", "text": "\"It's an amazing accomplishment,\" Howard said. \"Being 14 seasons in, I'm very thankful and blessed to be able to play this game, so I'm always thanking God for giving me this opportunity to play and I just want to keep it going.\""}
{"game_id": "0021700339", "chunk_id": "0021700339_008", "order": 8, "role": "body", "text": "The game turned early in the fourth when Orlando's Marreese Speights lost his cool."}
{"game_id": "0021700339", "chunk_id": "0021700339_009", "order": 9, "role": "body", "text": "Speights received a flagrant foul when he shoved Cody Zeller to the ground following a dunk by Frank Kaminsky, giving the Hornets two foul shots and the ball. Zeller made both and Jeremy Lamb was fouled on the ensuing possession and made both free throws, allowing the Hornets to take a double-digit lead."}
{"game_id": "0021700339", "chunk_id": "0021700339_010", "order": 10, "role": "body", "text": "\"It's a six-point possession,\" Magic coach Frank Vogel said. \"So that was definitely the turning point. But if we don't turn the ball over as much as we did, we don't have to worry about that.\""}
{"game_id": "0021700339", "chunk_id": "0021700339_011", "order": 11, "role": "body", "text": "Orlando had 20 turnovers that resulted in 29 points for the Hornets."}
{"game_id": "0021700339", "chunk_id": "0021700339_012", "order": 12, "role": "body", "text": "Walker made sure the Hornets didn't fall apart down the stretch. On one play he went 1-on-4 on a transition opportunity, but still found his way to the basket for a layup while drawing a foul."}
{"game_id": "0021700339", "chunk_id": "0021700339_014", "order": 14, "role": "body", "text": "Magic: Evan Fournier led the Magic with 18 points. ... Orlando was outrebounded 52-40."}
{"game_id": "0021700339", "chunk_id": "0021700339_015", "order": 15, "role": "body", "text": "Hornets: Shot only 3 of 17 from 3-point range. ... Kaminsky had 14 points off the bench. ... Michael Kidd-Gilchrist had 11 points and eight rebounds."}
{"game_id": "0021700339", "chunk_id": "0021700339_017", "order": 17, "role": "body", "text": "Vogel wasn't thrilled with the discrepancy in free throws. Charlotte attempted 40 foul shots; Orlando just 14."}
{"game_id": "0021700339", "chunk_id": "0021700339_018", "order": 18, "role": "body", "text": "\"It was impossible to not be ... frustrated with the way the game was called,\" Vogel said."}
{"game_id": "0021700339", "chunk_id": "0021700339_020", "order": 20, "role": "body", "text": "\"When you are on the road you are really playing against six people -- or eight people -- so it's up to us to play through it,\" Speights said. \"Tonight we tried to but it was hard.\""}
{"game_id": "0021700339", "chunk_id": "0021700339_022", "order": 22, "role": "body", "text": "The Hornets were coached by assistant Stephen Silas after head coach Steve Clifford came down with an illness."}
{"game_id": "0021700339", "chunk_id": "0021700339_023", "order": 23, "role": "body", "text": "\"He just said, `You'll do a great job,\" Silas explained. \"He just let me do my thing. I did the substitutions on my own and all the play calls and all the after-timeout plays and all that. He just let me do it. He sent me a text after the game, so I was happy to do it for him because he's a great man.\""}
{"game_id": "0021700339", "chunk_id": "0021700339_024", "order": 24, "role": "body", "text": "Silas' father, Paul, watched the news conference."}
{"game_id": "0021700339", "chunk_id": "0021700339_026", "order": 26, "role": "body", "text": "After going 14 of 14 at the foul line, Walker is shooting a career-high 87.1 percent from the stripe."}
{"game_id": "0021700339", "chunk_id": "0021700339_027", "order": 27, "role": "body", "text": "\"I put my work in, man,\" Walker said. \"That's really it. I try to keep it consistent. I shoot a lot of free throws and it's something that was a goal of mine to be a great free throw shooter this year. I just want to continue it.\""}
{"game_id": "0021700339", "chunk_id": "0021700339_028", "order": 28, "role": "body", "text": "Walker's goal is to shoot 90 percent."}
{"game_id": "0021700339", "chunk_id": "0021700339_030", "order": 30, "role": "body", "text": "Magic: Host the Atlanta Hawks on Wednesday night."}
{"game_id": "0021700339", "chunk_id": "0021700339_031", "order": 31, "role": "body", "text": "Hornets: Host the Golden State Warriors on Wednesday night."}
{"game_id": "0021700339", "chunk_id": "0021700339_033", "order": 33, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
