{"game_id": "0021200396", "chunk_id": "0021200396_001", "order": 1, "role": "lead", "text": "DENVER --  The Denver Nuggets' inside game was at its best on Saturday night."}
{"game_id": "0021200396", "chunk_id": "0021200396_002", "order": 2, "role": "body", "text": "Kosta Koufos scored a season-high 16 points, and Kenneth Faried and Andre Iguodala added 15 points apiece as the Nuggets beat Charlotte 110-88 and sent the Bobcats to their 15th consecutive loss."}
{"game_id": "0021200396", "chunk_id": "0021200396_003", "order": 3, "role": "body", "text": "JaVale McGee added 14 points, and Danilo Gallinari had 12 for Denver, which won its sixth in a row at home behind a fast-paced offense fueled by 36 assists and 78 points in the paint, both season highs."}
{"game_id": "0021200396", "chunk_id": "0021200396_004", "order": 4, "role": "body", "text": "\"We moved the ball very well,\" Nuggets coach George Karl said. \"We were unselfish from the beginning, and the defense got us in the open court.\""}
{"game_id": "0021200396", "chunk_id": "0021200396_005", "order": 5, "role": "body", "text": "Koufos (8 of 10), McGee (7 of 8), Faried (6 of 10), and Iguodala (6 of 9) were a combined 27 of 37 from the floor. They took feeds from teammates, finished fastbreaks, and put up high-percentage shots primarily from up close."}
{"game_id": "0021200396", "chunk_id": "0021200396_006", "order": 6, "role": "body", "text": "\"It was because of the guards,\" Koufos said. \"They drove into the lane and established themselves very well. They just dumped it off when we were there. I just played within the system, continued to play hard every possession. When the ball comes to me, I just try to finish. If not, do other things defensively.\""}
{"game_id": "0021200396", "chunk_id": "0021200396_007", "order": 7, "role": "body", "text": "Charlotte, playing the second of a back-to-back set on the road, was without injured guards Gerald Henderson and Ben Gordon. Henderson sustained a bruised shin during the second half of a 115-100 loss at Golden State on Friday. Gordon missed a second consecutive game because of soreness in his right knee."}
{"game_id": "0021200396", "chunk_id": "0021200396_008", "order": 8, "role": "body", "text": "Ramon Sessions had 23 points to lead Charlotte. Byron Mullens added 16 before he went down with a left ankle sprain in the final moments after getting his feet tangled in traffic near the basket."}
{"game_id": "0021200396", "chunk_id": "0021200396_009", "order": 9, "role": "body", "text": "\"It was a tough one for us,\" said Kemba Walker, who had eight points for the Bobcats. \"We've had four games in five nights. We struggled with energy. We just needed a little bit of energy tonight, but we really couldn't find a rhythm. They played tough. They played well.\""}
{"game_id": "0021200396", "chunk_id": "0021200396_010", "order": 10, "role": "body", "text": "Walker said the Bobcats are hurt by inexperience."}
{"game_id": "0021200396", "chunk_id": "0021200396_011", "order": 11, "role": "body", "text": "\"We're a young team,\" he said. \"We've got a few vets, but our core group is really young. Losing is one of the hardest things you can ever go through, especially losing as many as we've lost. But at the same time, you've got to keep your chin up. You've got to know that these losses will turn into wins one day.\""}
{"game_id": "0021200396", "chunk_id": "0021200396_012", "order": 12, "role": "body", "text": "Denver lost guard Ty Lawson to a left Achilles strain during the second quarter. He was held out the rest of the game for precautionary reasons, the team said."}
{"game_id": "0021200396", "chunk_id": "0021200396_013", "order": 13, "role": "body", "text": "The Nuggets, who missed an NBA-record 22 3-point attempts in Thursday night's 101-93 loss at Portland, missed their first six against the Bobcats. Jordan Hamilton finally found the range to give the Nuggets a 40-31 lead with 8:02 left in the second quarter."}
{"game_id": "0021200396", "chunk_id": "0021200396_014", "order": 14, "role": "body", "text": "That seemed to break the Nuggets' long-distance cold spell, complementing their sizzling inside game that was paced by the Nuggets' transition offense."}
{"game_id": "0021200396", "chunk_id": "0021200396_015", "order": 15, "role": "body", "text": "After a driving layup by Sessions pulled the Bobcats to within 44-39, the Nuggets went on a 15-3 run that included a pair of 3-pointers by Gallinari and Iguodala. That stretched Denver's lead to 59-44 with 45.2 seconds left in the second quarter."}
{"game_id": "0021200396", "chunk_id": "0021200396_016", "order": 16, "role": "body", "text": "Gallinari hit another 3-pointer just before the halftime buzzer to put Denver in front 64-46, the Nuggets' biggest lead to that point."}
{"game_id": "0021200396", "chunk_id": "0021200396_017", "order": 17, "role": "body", "text": "By the end of the third quarter, the Nuggets stretched their advantage to 88-65 following a tip shot by McGee, who finished with 14 points. Denver began substituting freely the rest of the way, and the undermanned Bobcats didn't threaten."}
{"game_id": "0021200396", "chunk_id": "0021200396_018", "order": 18, "role": "closing", "text": "Game notes Charlotte hasn't won since Nov. 24, a 108-106 victory at Washington in double overtime. ... Since the 2009-10 season, visiting teams to Denver are 7-39 when playing the second of a back-to-back set. ... The Nuggets have scored at least 60 points in the paint eight times this season. ... Koufos led the Nuggets in scoring for the first time in his nearly three years with Denver."}
