{"game_id": "0021700338", "chunk_id": "0021700338_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  The way Chris Paul sees it, this is only the beginning for the Houston Rockets."}
{"game_id": "0021700338", "chunk_id": "0021700338_002", "order": 2, "role": "body", "text": "James Harden scored 36 points, Eric Gordon added 22 off the bench and the Rockets blew past the Los Angeles Lakers 118-95 on Sunday night for their seventh consecutive victory -- all by at least 14 points."}
{"game_id": "0021700338", "chunk_id": "0021700338_003", "order": 3, "role": "body", "text": "\"We're capable of a lot more,\" Paul said."}
{"game_id": "0021700338", "chunk_id": "0021700338_004", "order": 4, "role": "body", "text": "The winning streak coincides with Paul's arrival after sitting out the first 14 games of the season with a knee injury. But the Rockets have won six straight on the road (all by 15 points or more) and 13 of 14 overall. They lead the Western Conference at 18-4."}
{"game_id": "0021700338", "chunk_id": "0021700338_005", "order": 5, "role": "body", "text": "\"In my opinion, they're playing the best basketball in the NBA right now,\" Lakers coach Luke Walton said."}
{"game_id": "0021700338", "chunk_id": "0021700338_006", "order": 6, "role": "body", "text": "The Lakers (8-15), meanwhile, are going in the opposite direction. Sunday marked their season-worst fifth loss in a row, and their next four games are on the road, where they are 2-8."}
{"game_id": "0021700338", "chunk_id": "0021700338_007", "order": 7, "role": "body", "text": "\"We knew this was going to be a testing time of the season,\" Walton said."}
{"game_id": "0021700338", "chunk_id": "0021700338_008", "order": 8, "role": "body", "text": "\"This is the time of the year that can really break teams down. I think we will stick together, keep getting better and grinding.\""}
{"game_id": "0021700338", "chunk_id": "0021700338_009", "order": 9, "role": "body", "text": "Paul had 21 points and six assists for Houston. Harden handed out nine assists, and Gordon scored 20 points in the first half."}
{"game_id": "0021700338", "chunk_id": "0021700338_010", "order": 10, "role": "body", "text": "Houston outscored the Lakers 34-19 in the second quarter to take a 61-46 lead at halftime. Los Angeles mounted one last charge to start the third quarter, pulling within three before the Rockets rolled off nine consecutive points. They were never threatened again."}
{"game_id": "0021700338", "chunk_id": "0021700338_011", "order": 11, "role": "body", "text": "Houston led by as many as 24 in the fourth."}
{"game_id": "0021700338", "chunk_id": "0021700338_012", "order": 12, "role": "body", "text": "\"As soon as we have a breakdown or go through a dry spell for a period, their lead would go right back up,\" Walton said."}
{"game_id": "0021700338", "chunk_id": "0021700338_013", "order": 13, "role": "body", "text": "The Lakers got 22 points from rookie Kyle Kuzma -- 16 in the fourth quarter. Brandon Ingram had 18 points and nine rebounds."}
{"game_id": "0021700338", "chunk_id": "0021700338_014", "order": 14, "role": "body", "text": "Kentavious Caldwell-Pope scored 16 and Larry Nance Jr. added 15 for the Lakers, but it was hardly enough to stay with the NBA's second-highest scoring team."}
{"game_id": "0021700338", "chunk_id": "0021700338_015", "order": 15, "role": "body", "text": "\"Our goal is to be great defensively every night,\" Harden said. \"We have enough offense that we're going to score.\""}
{"game_id": "0021700338", "chunk_id": "0021700338_017", "order": 17, "role": "body", "text": "Houston's defense was plenty effective against the Lakers. The Rockets forced 21 turnovers and converted them into 27 points. \"The turnovers killed us,\" Walton said."}
{"game_id": "0021700338", "chunk_id": "0021700338_019", "order": 19, "role": "body", "text": "Harden, the league's leading scorer at 31.5 points per game, went 13 of 22 from the field and 4 of 9 from 3-point range. \"James probably missed his first 3 and then got like seven in row,\" Rockets coach Mike D'Antoni said. \"He's ridiculous.\""}
{"game_id": "0021700338", "chunk_id": "0021700338_021", "order": 21, "role": "body", "text": "Lakers rookie point guard Lonzo Ball struggled again. He missed all four shots from the field, finishing with two points and three assists. He played only 22 minutes."}
{"game_id": "0021700338", "chunk_id": "0021700338_022", "order": 22, "role": "body", "text": "\"A lot of what we try to do depends on him, which is a lot of pressure to put on a young rookie,\" Walton said. \"Tonight we just didn't get that much out of him.\""}
{"game_id": "0021700338", "chunk_id": "0021700338_024", "order": 24, "role": "body", "text": "Rockets: Have made an NBA-high 340 3-pointers, 50 more than second-place Golden State. D'Antoni said he wouldn't be upset if a Rockets player was by himself on a fast break and pulled up for a 3. \"No, not if he made it. I'd say, `Good shot.' Nah, players wouldn't do that. It would be crazy,\" he said. ... F Ryan Anderson played only 12 minutes due to back tightness."}
{"game_id": "0021700338", "chunk_id": "0021700338_025", "order": 25, "role": "body", "text": "Lakers: Ball had a slight limp after Saturday's game in Denver, the result of left calf tightness. He participated in the morning shootaround and was cleared to play Sunday night. In his first 20 NBA games, Ball is averaging 9.0 points, 7.1 assists and 7.1 rebounds while shooting 31.8 percent."}
{"game_id": "0021700338", "chunk_id": "0021700338_027", "order": 27, "role": "body", "text": "Rockets: Play the second of three consecutive road games Thursday in Utah. Have lost four of the past six to the Jazz."}
{"game_id": "0021700338", "chunk_id": "0021700338_028", "order": 28, "role": "body", "text": "Lakers: Open a four-game road trip in Philadelphia on Thursday. The 76ers won the first meeting 115-109 three weeks ago."}
{"game_id": "0021700338", "chunk_id": "0021700338_030", "order": 30, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
