{"game_id": "0021400763", "chunk_id": "0021400763_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Brandon Knight scored just two of his game-high 26 points in the fourth quarter. He couldn't have picked a better time for those two points, though."}
{"game_id": "0021400763", "chunk_id": "0021400763_002", "order": 2, "role": "body", "text": "Knight hit a jumper from the top of the key with 6.7 seconds left to help the Milwaukee Bucks hold off the Boston Celtics 96-93 on Saturday night for their sixth win in seven games."}
{"game_id": "0021400763", "chunk_id": "0021400763_003", "order": 3, "role": "body", "text": "\"He was great for us all night,\" Bucks coach Jason Kidd said. \"He had a lot of energy. He was finding open guys and on top of that he was finding shots early and then the big one there in the fourth quarter. That definitely was a big shot and you see he had a lot of confidence.\""}
{"game_id": "0021400763", "chunk_id": "0021400763_004", "order": 4, "role": "body", "text": "Milwaukee went more than three minutes without scoring -- missing eight consecutive shots -- before John Henson made a half-hook in the lane with 2:04 remaining to put the Bucks up 94-91. But at the other end, Henson was called for goaltending with 29.4 seconds to go to make it a one-point game."}
{"game_id": "0021400763", "chunk_id": "0021400763_005", "order": 5, "role": "body", "text": "The Bucks then ran the clock down and Knight buried a jumper over Brandon Bass from the top left to make it 96-93."}
{"game_id": "0021400763", "chunk_id": "0021400763_006", "order": 6, "role": "body", "text": "\"It was a phenomenal shot, well defended,\" said Boston coach Brad Stevens. \"I thought Brandon Bass did a phenomenal job guarding. That is what the guys do in those moments. So hats off to him.\""}
{"game_id": "0021400763", "chunk_id": "0021400763_007", "order": 7, "role": "body", "text": "Boston pushed the ball up court, but the Bucks forced a tough shot and Jae Crowder missed from the right corner with the clock winding down. Crowder thought he was outside the arc, but the officials called it a two-point shot."}
{"game_id": "0021400763", "chunk_id": "0021400763_008", "order": 8, "role": "body", "text": "Giannis Antetokounmpo added 14 points and 11 rebounds for the Bucks, his fourth double-double in the last five games, compared with five for his entire career prior to that. Over the five-game span, the 20-year-old Antetokounmpo is averaging 17.6 points and 10.8 rebounds, while shooting 63 percent from the field."}
{"game_id": "0021400763", "chunk_id": "0021400763_009", "order": 9, "role": "body", "text": "Jared Sullinger had 17 points and Marcus Smart added 13 for Boston, which fell to 3-25 when trailing after three quarters."}
{"game_id": "0021400763", "chunk_id": "0021400763_010", "order": 10, "role": "body", "text": "The Bucks scored the final seven points of the first half for a 53-46 lead. Milwaukee extended the lead to 66-52, but Boston cut it to 80-75 entering the final quarter."}
{"game_id": "0021400763", "chunk_id": "0021400763_011", "order": 11, "role": "body", "text": "\"We had opportunities late, we just didn't capitalize on it,\" said Crowder, who played at the same arena in college for Marquette, where he was the Big East player of the year as a senior. \"But, we can't dig ourselves a 14-point hole on a back-to-back on the road. Nine times out of 10, that's a tough game to come out of with a win.\""}
{"game_id": "0021400763", "chunk_id": "0021400763_012", "order": 12, "role": "body", "text": "Milwaukee also was playing a back-to-back, coming off a 117-113 loss at Houston on Friday, which snapped a five-game winning streak."}
{"game_id": "0021400763", "chunk_id": "0021400763_013", "order": 13, "role": "body", "text": "\"We started off a little bit slow, but I wouldn't say it was too bad,\" said Knight, who had 18 points in the first half, including four 3-pointers. \"You're going to have runs throughout a game where you're not making shots, but the thing about us is that we're always going to continue to play hard and continue playing the right way. That's what we did last night and that's what we did tonight as well.\""}
{"game_id": "0021400763", "chunk_id": "0021400763_015", "order": 15, "role": "body", "text": "Celtics: Forward Tayshaun Prince, who missed the previous four games with a hip flexor injury, played 18 minutes, scoring eight points."}
{"game_id": "0021400763", "chunk_id": "0021400763_016", "order": 16, "role": "body", "text": "Bucks: Signed Jorge Gutierrez to a second 10-day contract Saturday. Gutierrez appeared in four games with the Bucks during his first 10-day contract, averaging 4.5 points and 2.5 rebounds in 14.8 minutes per game. ... Forward Kenyon Martin, signed for the rest of the season after a pair of 10-day contracts, missed his third consecutive game with an ankle injury."}
{"game_id": "0021400763", "chunk_id": "0021400763_018", "order": 18, "role": "body", "text": "Milwaukee improved to 6-1 this season in games in which Henson has started. Henson has blocked a shot in 16 consecutive games, which is the second-longest streak of his career. His longest streak is 21 straight games."}
{"game_id": "0021400763", "chunk_id": "0021400763_020", "order": 20, "role": "body", "text": "Celtics: host Atlanta on Wednesday night."}
{"game_id": "0021400763", "chunk_id": "0021400763_021", "order": 21, "role": "closing", "text": "Bucks: host Brooklyn on Monday night."}
