{"game_id": "0021701034", "chunk_id": "0021701034_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  One little floater for Goran Dragic lifted the Miami Heat to a big win."}
{"game_id": "0021701034", "chunk_id": "0021701034_002", "order": 2, "role": "body", "text": "Dragic scored 30 points, including a go-ahead jumper in the final seconds, and the Heat snapped a nine-game road losing streak with a 92-91 victory over the Los Angeles Lakers on Friday night."}
{"game_id": "0021701034", "chunk_id": "0021701034_003", "order": 3, "role": "body", "text": "Miami trailed 91-90 after Kyle Kuzma made a 3-pointer for Los Angeles with 1:23 left. But Dragic got the lead back for the Heat with a 10-foot floater in the lane. Isaiah Thomas then missed a fallaway jumper for the Lakers, and the Heat grabbed the rebound to close it out."}
{"game_id": "0021701034", "chunk_id": "0021701034_004", "order": 4, "role": "body", "text": "\"It was a tough stretch, but finally tonight the basketball gods were on our side,\" Dragic said."}
{"game_id": "0021701034", "chunk_id": "0021701034_005", "order": 5, "role": "body", "text": "Kelly Olynyk scored 17 points for Miami, which was coming off an overtime loss at Sacramento on Wednesday night. James Johnson had 12 points, and Bam Adebayo added 11 points and eight rebounds."}
{"game_id": "0021701034", "chunk_id": "0021701034_006", "order": 6, "role": "body", "text": "The road win left the Heat 15 1/2 games back in the Eastern Conference, in a virtual tie with Milwaukee for seventh. Miami (37-33) has played two more games than the Bucks."}
{"game_id": "0021701034", "chunk_id": "0021701034_007", "order": 7, "role": "body", "text": "\"We thought it was very fitting that this road trip ended on a defensive stop,\" Heat coach Erik Spoelstra said. \"That's all we talked about the last 48 hours.\""}
{"game_id": "0021701034", "chunk_id": "0021701034_008", "order": 8, "role": "body", "text": "Miami got some help Friday when the officials reviewed a shot by Dragic that they originally said missed the rim. The Heat called timeout, and the shot clock showed 0.5 seconds remaining. When the replay showed the shot had nicked the rim, the Heat got a full 24 seconds to set up Dragic's winning shot."}
{"game_id": "0021701034", "chunk_id": "0021701034_009", "order": 9, "role": "body", "text": "\"We were definitely fortunate,\" Spoelstra said."}
{"game_id": "0021701034", "chunk_id": "0021701034_010", "order": 10, "role": "body", "text": "Julius Randle led the Lakers with 25 points and 12 rebounds. Brook Lopez added 18 points, and Kuzma and Travis Wear each had 11."}
{"game_id": "0021701034", "chunk_id": "0021701034_011", "order": 11, "role": "body", "text": "Thomas went 1 for 9 from the field."}
{"game_id": "0021701034", "chunk_id": "0021701034_013", "order": 13, "role": "body", "text": "Heat: With G Dwyane Wade out for a third consecutive game with a sore left hamstring, Miami recalled Derrick Jones Jr. from its G-League affiliate. He has three days of eligibility on his two-way contract and the development league season ends March 24, so he could remain with the Heat for the duration of the season."}
{"game_id": "0021701034", "chunk_id": "0021701034_014", "order": 14, "role": "body", "text": "Lakers: Kuzma returned after missing the previous game with a sore ankle. ... Lopez was a game-time decision with back tightness. ... F Brandon Ingram, who has missed the last eight games with a sore groin, has been updated to day to day."}
{"game_id": "0021701034", "chunk_id": "0021701034_016", "order": 16, "role": "body", "text": "Salvaging the final game of their three-game road trip lifted the Heat's spirits ahead of their return to Miami, where they are 20-13 this season."}
{"game_id": "0021701034", "chunk_id": "0021701034_017", "order": 17, "role": "body", "text": "\"Every game has playoff implications for us,\" Olynyk said. \"We have to treat every game like a playoff game."}
{"game_id": "0021701034", "chunk_id": "0021701034_018", "order": 18, "role": "body", "text": "\"We really have to go home and take care of business.\""}
{"game_id": "0021701034", "chunk_id": "0021701034_020", "order": 20, "role": "body", "text": "Heat: Return home to play Denver on Monday."}
{"game_id": "0021701034", "chunk_id": "0021701034_021", "order": 21, "role": "body", "text": "Lakers: Begin a four-game road trip Monday in Indiana."}
{"game_id": "0021701034", "chunk_id": "0021701034_023", "order": 23, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
