{"game_id": "0021400092", "chunk_id": "0021400092_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Reggie Jackson has been vocal about his desire for a greater role with the Thunder."}
{"game_id": "0021400092", "chunk_id": "0021400092_002", "order": 2, "role": "body", "text": "He's usually behind Russell Westbrook on the point guard depth chart, but with Westbrook and Kevin Durant out with injuries, Jackson took advantage of his chance to be the man Sunday night. He scored 11 of his 22 points in the fourth quarter to help Oklahoma City beat the Sacramento Kings 101-93."}
{"game_id": "0021400092", "chunk_id": "0021400092_003", "order": 3, "role": "body", "text": "Jackson scored eight points in the final 2:17, going 6 of 7 from the free throw line. He said it's a scenario he's dreamed of."}
{"game_id": "0021400092", "chunk_id": "0021400092_004", "order": 4, "role": "body", "text": "\"I always do my best and try to prepare myself for moments like this,\" he said. \"I just try to stay ready.\""}
{"game_id": "0021400092", "chunk_id": "0021400092_005", "order": 5, "role": "body", "text": "Jeremy Lamb scored 17 points, Serge Ibaka had 14 points, nine rebounds and four blocks, and Sebastian Telfair added 14 points for the Thunder (2-5), who improved to 2-1 at home. The Thunder entered the game as the lowest-scoring team in the league, but they shot 46 percent from the field."}
{"game_id": "0021400092", "chunk_id": "0021400092_006", "order": 6, "role": "body", "text": "\"One thing I love about the group is that we are undermanned, but they are not using that as an excuse,\" Thunder coach Scott Brooks said."}
{"game_id": "0021400092", "chunk_id": "0021400092_007", "order": 7, "role": "body", "text": "Rudy Gay had 23 points, 10 rebounds and six assists, and DeMarcus Cousins and Ben McLemore each added 16 points for the Kings (5-2)."}
{"game_id": "0021400092", "chunk_id": "0021400092_008", "order": 8, "role": "body", "text": "Jackson's 3-pointer at the end of the first half gave the Thunder a 52-39 lead. The Thunder held the Kings to 37 percent shooting and outrebounded Sacramento 25-15 before the break."}
{"game_id": "0021400092", "chunk_id": "0021400092_009", "order": 9, "role": "body", "text": "A dunk by Ibaka pushed Oklahoma City's lead to 56-39 and led to a timeout by the Kings."}
{"game_id": "0021400092", "chunk_id": "0021400092_010", "order": 10, "role": "body", "text": "Sacramento finally settled down and went on a 13-0 run. The Thunder went scoreless for more than five minutes while missing eight consecutive shots and turning the ball over four times. The Kings got as close as a point, but the Thunder hung on and took a 67-65 lead into the fourth quarter."}
{"game_id": "0021400092", "chunk_id": "0021400092_011", "order": 11, "role": "body", "text": "Oklahoma City opened the final period on a 5-0 run. A three-point play by Ish Smith and a dunk by Nick Collison gave the Thunder a 72-65 edge."}
{"game_id": "0021400092", "chunk_id": "0021400092_012", "order": 12, "role": "body", "text": "Collison hit two 3-pointers in a 2-minute span to help the Thunder push the lead back up to 82-73 with just over 7 minutes remaining."}
{"game_id": "0021400092", "chunk_id": "0021400092_013", "order": 13, "role": "body", "text": "Sacramento cut Oklahoma City's lead to two with 2:32 remaining, but Jackson's step-back jumper with the shot clock winding down bumped the Thunder lead back up to 94-89 with 1:10 remaining, and Oklahoma City remained in control from there."}
{"game_id": "0021400092", "chunk_id": "0021400092_014", "order": 14, "role": "body", "text": "\"We dug ourselves a hole, man,\" Gay said. \"It's a good learning experience for us -- no matter who we're playing, we can't come out playing like that.\""}
{"game_id": "0021400092", "chunk_id": "0021400092_017", "order": 17, "role": "body", "text": "Kings: Gay was called for a technical foul in the third quarter after throwing down a nasty alley-oop dunk on Smith and staring him down. ... The Kings made 10 of 18 shots in the third quarter to trim a 13-point deficit to two."}
{"game_id": "0021400092", "chunk_id": "0021400092_018", "order": 18, "role": "body", "text": "Thunder: Brooks said before the game that Perry Jones (right knee contusion) and Anthony Morrow (left MCL sprain) are close to returning. ... Oklahoma City, which made just 3 of 11 free throws in Friday's loss to Memphis, made 23 of 27 against the Kings."}
{"game_id": "0021400092", "chunk_id": "0021400092_020", "order": 20, "role": "body", "text": "Ish Smith, a recent free-agent pickup for the Thunder, scored his first points with the team on Sunday night. He finished with seven points and an assist in 7:53."}
{"game_id": "0021400092", "chunk_id": "0021400092_022", "order": 22, "role": "body", "text": "\"Reggie is comfortable with the ball, he's comfortable in those late game situations, and we're lucky to have a deep roster and to have a lot of guys capable of playing with this many guys out,\" Oklahoma City's Nick Collison said. \"To have a guy like that on the team is a huge advantage.\""}
{"game_id": "0021400092", "chunk_id": "0021400092_024", "order": 24, "role": "body", "text": "Oklahoma City's 2/3 zone defense has bothered teams because it's rarely used in the NBA. It contributed to the Kings making just 6 of 24 3-pointers."}
{"game_id": "0021400092", "chunk_id": "0021400092_025", "order": 25, "role": "body", "text": "\"The guys see zone and they panic,\" Kings coach Michael Malone said. \"You're an NBA player, you see zone, and you play basketball.\""}
{"game_id": "0021400092", "chunk_id": "0021400092_027", "order": 27, "role": "body", "text": "Kings: Visit Dallas on Tuesday."}
{"game_id": "0021400092", "chunk_id": "0021400092_028", "order": 28, "role": "body", "text": "Thunder: Visits Milwaukee on Tuesday."}
{"game_id": "0021400092", "chunk_id": "0021400092_030", "order": 30, "role": "closing", "text": "Follow Cliff Brunt on Twitter: www.twitter.com/CliffBruntAP ."}
