{"game_id": "0021700769", "chunk_id": "0021700769_001", "order": 1, "role": "lead", "text": "TORONTO --  DeMar DeRozan's big night from beyond the arc spoiled Damian Lillard's milestone moment."}
{"game_id": "0021700769", "chunk_id": "0021700769_002", "order": 2, "role": "body", "text": "DeRozan scored 35 points, Jonas Valanciunas had 18 and the Toronto Raptors beat Portland 130-105 on Friday night, their sixth straight win over the Trail Blazers."}
{"game_id": "0021700769", "chunk_id": "0021700769_003", "order": 3, "role": "body", "text": "Fred VanVleet scored 16 points, Kyle Lowry had 15 and Pascal Siakam 13 as the Raptors improved their home record to 20-4, best in the NBA."}
{"game_id": "0021700769", "chunk_id": "0021700769_004", "order": 4, "role": "body", "text": "DeRozan made 11 of 22 shots and matched his career-high by making six 3-pointers. He finished 6 for 10 from long range."}
{"game_id": "0021700769", "chunk_id": "0021700769_005", "order": 5, "role": "body", "text": "\"We didn't really force much and we got shots that we wanted,\" DeRozan said."}
{"game_id": "0021700769", "chunk_id": "0021700769_006", "order": 6, "role": "body", "text": "Lillard scored 32 points, becoming the fastest player in franchise history to reach 10,000 for his career, but Portland's four-game winning streak was snapped. The Blazers have lost five of their past seven on the road."}
{"game_id": "0021700769", "chunk_id": "0021700769_007", "order": 7, "role": "body", "text": "\"It's something I'm really happy about,\" Lillard said of 10,000 points. \"Now I've just got to keep on moving up.\""}
{"game_id": "0021700769", "chunk_id": "0021700769_008", "order": 8, "role": "body", "text": "The Raptors made a season high 19 3-pointers. Toronto shot 19 for 40 from behind the arc, with nine players making at least one 3-pointer."}
{"game_id": "0021700769", "chunk_id": "0021700769_009", "order": 9, "role": "body", "text": "\"The 3-point line was a huge factor tonight,\" Blazers coach Terry Stotts said."}
{"game_id": "0021700769", "chunk_id": "0021700769_010", "order": 10, "role": "body", "text": "CJ McCollum scored 21 points and Jusuf Nurkic had 20, but no other Portland player had more than five through the first three quarters."}
{"game_id": "0021700769", "chunk_id": "0021700769_011", "order": 11, "role": "body", "text": "After winning an NBA-high 11 games in January, the Blazers opened their February schedule on a losing note."}
{"game_id": "0021700769", "chunk_id": "0021700769_012", "order": 12, "role": "body", "text": "\"I thought the Raptors played very well and we didn't have many answers for them,\" Stotts said."}
{"game_id": "0021700769", "chunk_id": "0021700769_013", "order": 13, "role": "body", "text": "Lillard came in 12 points away from 10,000. He reached the milestone on a driving layup with 45 seconds left in the first quarter, then passed it with a 3 at 9:06 of the second."}
{"game_id": "0021700769", "chunk_id": "0021700769_014", "order": 14, "role": "body", "text": "DeRozan scored 16 points and Valanciunas had 11 as the Raptors led 37-18 after one. Lillard was the only Portland player to deliver offensively in the opening quarter, scoring 12 points and making 4 of 5 shots. The rest of the Blazers combined to shoot 2 for 13."}
{"game_id": "0021700769", "chunk_id": "0021700769_015", "order": 15, "role": "body", "text": "\"We dug ourselves a hole early,\" Lillard said."}
{"game_id": "0021700769", "chunk_id": "0021700769_017", "order": 17, "role": "body", "text": "Trail Blazers: Lillard scored Portland's first nine points. ... McCollum, who scored 28 points in the first quarter of his 50-point performance Wednesday, did not score in the opening quarter against Toronto, missing all three of his shots. ... Lillard led the Blazers with 10 assists. ... Portland has scored 100 or more points in 17 straight games."}
{"game_id": "0021700769", "chunk_id": "0021700769_018", "order": 18, "role": "body", "text": "Raptors: F C.J. Miles (right knee) missed his third straight game. ... DeRozan's 26-points first half matched his highest-scoring half of the season. ... Toronto outscored Portland 26-7 in second-chance points. ... The Raptors have scored 120 or more points 16 times this season, second only to Golden State (23)."}
{"game_id": "0021700769", "chunk_id": "0021700769_020", "order": 20, "role": "body", "text": "Lillard is the eighth player to get 10,000 points and 2,500 assists in his first six seasons. The others are Michael Jordan, LeBron James, Larry Bird, Nate Archibald, Pete Maravich, Dave Bing and Oscar Robertson."}
{"game_id": "0021700769", "chunk_id": "0021700769_021", "order": 21, "role": "body", "text": "\"It's a quite a list,\" Stotts said. \"All Hall of Famers except for LeBron, and I think he has a chance to get in, too.\""}
{"game_id": "0021700769", "chunk_id": "0021700769_023", "order": 23, "role": "body", "text": "Lillard said DeRozan's newfound ability from long range makes him even more difficult to defend."}
{"game_id": "0021700769", "chunk_id": "0021700769_024", "order": 24, "role": "body", "text": "\"He was already a handful with his size and athleticism and how crafty he is,\" Lillard said. \"Now you're chasing him over the top of screens and he's pulling up from 3 off the dribble, raising up and shooting it like that's always been his shot.\""}
{"game_id": "0021700769", "chunk_id": "0021700769_026", "order": 26, "role": "body", "text": "Lillard is one of four active players to reach 10,000 points in his first six seasons. The others are Carmelo Anthony, Kevin Durant, and James."}
{"game_id": "0021700769", "chunk_id": "0021700769_028", "order": 28, "role": "body", "text": "Trail Blazers: Visit Boston on Sunday, their first meeting of the season with the Celtics. The teams split last season, each winning on the other's home court."}
{"game_id": "0021700769", "chunk_id": "0021700769_029", "order": 29, "role": "body", "text": "Raptors: A season-long four game homestand continues Sunday against Memphis. The Raptors have won four straight home meetings with the Grizzlies."}
{"game_id": "0021700769", "chunk_id": "0021700769_031", "order": 31, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
