{"game_id": "0021700891", "chunk_id": "0021700891_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  During a five-minute span in the third quarter, everyone in the Golden 1 Center knew where the ball was going when the visiting Los Angeles Lakers were on offense. That didn't mean the Sacramento Kings could do anything to stop Kentavious Caldwell-Pope from putting on a one-man shooting show."}
{"game_id": "0021700891", "chunk_id": "0021700891_002", "order": 2, "role": "body", "text": "Caldwell-Pope scored 17 of his season-high 34 points in the third and the Lakers snapped a three-game road losing streak with a 113-108 win Saturday night against the Kings."}
{"game_id": "0021700891", "chunk_id": "0021700891_003", "order": 3, "role": "body", "text": "Caldwell-Pope hit eight 3-pointers and the Lakers had 17 overall. Isaiah Thomas added 17 points off the bench in his fifth game since Los Angeles acquired him in a trade with the Cleveland Cavaliers."}
{"game_id": "0021700891", "chunk_id": "0021700891_004", "order": 4, "role": "body", "text": "\"It's been a while since I've been that hot,\" said Caldwell-Pope, who is in his first season with the Lakers after spending his first four NBA seasons with Detroit."}
{"game_id": "0021700891", "chunk_id": "0021700891_005", "order": 5, "role": "body", "text": "Buddy Hield and Bogdan Bogdanovic each had 21 points to lead the Kings, who have lost eight of their last nine home games. Willie Cauley-Stein added 18 points and 15 rebounds."}
{"game_id": "0021700891", "chunk_id": "0021700891_006", "order": 6, "role": "body", "text": "The Kings took a 64-54 lead with two minutes gone in the third quarter, but Caldwell-Pope then hit five 3s in a five-minute span to lead the Lakers on a 33-19 run for the rest of the period."}
{"game_id": "0021700891", "chunk_id": "0021700891_007", "order": 7, "role": "body", "text": "\"He got a couple in transition, but he's 6-foot-6 and he just shot it over the top of us,\" Kings coach Dave Joerger said. \"So once he got a catch, he could just get it up and he sent it over the top.\""}
{"game_id": "0021700891", "chunk_id": "0021700891_008", "order": 8, "role": "body", "text": "The teams traded the lead early in the fourth before the Lakers took control, though the Kings pulled within a point in the final minute. Thomas and Josh Hart each hit a pair of free throws in the final 12 seconds to seal it."}
{"game_id": "0021700891", "chunk_id": "0021700891_009", "order": 9, "role": "body", "text": "\"Those are easy points. I'm always willing to be that guy who takes those free shots,\" Thomas said."}
{"game_id": "0021700891", "chunk_id": "0021700891_010", "order": 10, "role": "body", "text": "Lakers rookie guard Lonzo Ball was held out after returning to the lineup and playing 17 minutes Friday night against Dallas. He had missed the previous 15 games with a sore left knee."}
{"game_id": "0021700891", "chunk_id": "0021700891_012", "order": 12, "role": "body", "text": "Lakers: Caldwell-Pope's eight 3s were his most in a game this season and tied his career high. He also hit eight while scoring a career-best 38 points against New Orleans last season."}
{"game_id": "0021700891", "chunk_id": "0021700891_013", "order": 13, "role": "body", "text": "Kings: Sacramento is struggling at home over the last seven weeks, winning just once there during that stretch to fall to 8-19 at the Golden 1 Center this season. The Kings are 10-22 on the road."}
{"game_id": "0021700891", "chunk_id": "0021700891_015", "order": 15, "role": "body", "text": "Even though the Kings and Lakers had some epic Western Conference playoff battles a decade and a half ago, the Lakers have dominated the series since both teams landed in their current homes, with the Lakers now holding a 94-45 advantage."}
{"game_id": "0021700891", "chunk_id": "0021700891_017", "order": 17, "role": "body", "text": "Kings rookie point guard De'Aaron Fox returned after missing a game with conjunctivitis. He started and played 30 minutes, scoring 13 points and handing out six assists without committing a turnover."}
{"game_id": "0021700891", "chunk_id": "0021700891_019", "order": 19, "role": "body", "text": "Lakers: Play at Atlanta on Monday. Los Angeles won its only previous game against the Hawks this season, 132-113 on Jan. 7 at home."}
{"game_id": "0021700891", "chunk_id": "0021700891_020", "order": 20, "role": "body", "text": "Kings: Wrap up a three-game homestand against Minnesota on Monday. Sacramento has lost its two previous games this season against the Timberwolves, both of which were played in Minneapolis."}
{"game_id": "0021700891", "chunk_id": "0021700891_022", "order": 22, "role": "closing", "text": "More AP NBA: apnews.com/tag/NBAbasketball"}
