{"game_id": "0021400560", "chunk_id": "0021400560_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Marc Gasol struggled through regulation and the first overtime before finally getting untracked."}
{"game_id": "0021400560", "chunk_id": "0021400560_002", "order": 2, "role": "body", "text": "Gasol scored the first seven points of the second overtime, Zach Randolph had 27 points and 17 rebounds and the Memphis Grizzlies outlasted the Phoenix Suns 122-110 on Sunday night."}
{"game_id": "0021400560", "chunk_id": "0021400560_003", "order": 3, "role": "body", "text": "Gasol was 2 of 10 from the field before the second overtime."}
{"game_id": "0021400560", "chunk_id": "0021400560_005", "order": 5, "role": "body", "text": "\"The ball went in,\" Gasol said."}
{"game_id": "0021400560", "chunk_id": "0021400560_006", "order": 6, "role": "body", "text": "Gasol finished with 12 points. Mike Conley added 25 points and eight assists and Courtney Lee had 18 points."}
{"game_id": "0021400560", "chunk_id": "0021400560_007", "order": 7, "role": "body", "text": "While Gasol didn't elaborate on his play, others provided credit to the center."}
{"game_id": "0021400560", "chunk_id": "0021400560_008", "order": 8, "role": "body", "text": "\"Marc was huge,\" Conley said. \"Early on, it seemed like he wasn't as aggressive, and finally, it clicked. He wanted the ball.\""}
{"game_id": "0021400560", "chunk_id": "0021400560_009", "order": 9, "role": "body", "text": "Isaiah Thomas led Phoenix with 20 points, but had a costly turnover trying to get the ball into the front court with the Suns leading late in the first overtime -- one of seven turnovers for Thomas."}
{"game_id": "0021400560", "chunk_id": "0021400560_010", "order": 10, "role": "body", "text": "The miscue led to a pair of free throws from Lee to tie it at 108, sending it into the second overtime where Memphis missed only one of seven shots compared to the Suns hitting only one of 11 shots."}
{"game_id": "0021400560", "chunk_id": "0021400560_011", "order": 11, "role": "body", "text": "Markieff Morris added 17 points for Phoenix, while Alex Len had 14 points and 13 rebounds. P.J. Tucker, Eric Bledsoe and Marcus Morris had 11 points apiece."}
{"game_id": "0021400560", "chunk_id": "0021400560_012", "order": 12, "role": "body", "text": "Bledsoe had a chance to win it in the first overtime, but his off-balance shot in the lane banged off the front of the rim at the buzzer."}
{"game_id": "0021400560", "chunk_id": "0021400560_013", "order": 13, "role": "body", "text": "\"He went in with a little pump fake, but it looked like he slipped, and he couldn't get off a decent shot,\" Suns coach Jeff Hornacek said."}
{"game_id": "0021400560", "chunk_id": "0021400560_014", "order": 14, "role": "body", "text": "Phoenix has lost two straight."}
{"game_id": "0021400560", "chunk_id": "0021400560_015", "order": 15, "role": "body", "text": "The Grizzlies were without forward Tayshaun Prince and swingman Quincy Pondexter, awaiting the completion of a three-team trade. On Saturday night, a person familiar with the deal said the Grizzlies, Boston Celtics and New Orleans Pelicans have agreed on a five-player trade that would send forward Jeff Green from Boston to Memphis. The person spoke to The Associated Press on condition of anonymity because the trade hasn't been announced and formal approval by the NBA isn't expected until Monday."}
{"game_id": "0021400560", "chunk_id": "0021400560_016", "order": 16, "role": "body", "text": "Prince would go from Memphis to Boston and Pondexter from Memphis to New Orleans."}
{"game_id": "0021400560", "chunk_id": "0021400560_017", "order": 17, "role": "body", "text": "The Suns trailed by 16 in the second half and 14 early in the fourth quarter. Tucker's layup tied it 101 with 5.9 left in regulation. The Grizzlies begged for basket interference, saying Bledsoe pulled the net as the ball was bouncing on the rim."}
{"game_id": "0021400560", "chunk_id": "0021400560_018", "order": 18, "role": "body", "text": "Bledsoe's 3-pointer with 33.3 seconds left in the first overtime gave the Suns a 108-106 lead. The Suns stopped the Grizzlies on the next possession, but Thomas gave away the ball and Lee -- fouled by Goran Dragic -- made two free throws with 16.2 left. Bledsoe then missed at the buzzer, forcing the second extra period."}
{"game_id": "0021400560", "chunk_id": "0021400560_020", "order": 20, "role": "body", "text": "Suns: Phoenix has lost six straight in the series. ... Brandan Wright, obtained from the Celtics on Friday, made his first appearance for the Suns, entering the game in the first quarter. He finished with seven points, hitting three of four shots. ... The Suns are 0-4 in overtime this season."}
{"game_id": "0021400560", "chunk_id": "0021400560_021", "order": 21, "role": "body", "text": "Grizzlies: Randolph made six of his first seven shots and had 18 points in the first half. He had his second straight double-double after missing nine games because of soreness in his right knee. ... Memphis' last two opponents -- Atlanta and New Orleans -- were a combined 23 of 45 from 3-point range. The Suns were 8 of 35."}
{"game_id": "0021400560", "chunk_id": "0021400560_023", "order": 23, "role": "body", "text": "The Suns found themselves in foul trouble in the second overtime. Goran Dragic fouled out in the first overtime on Thomas' turnover. On the first play on the second overtime, Len fouled out on Gasol's field goal. Then Markieff Morris was called for his sixth foul with just over 2 minutes left."}
{"game_id": "0021400560", "chunk_id": "0021400560_025", "order": 25, "role": "body", "text": "Even though the trade is not official, Memphis players were not bashful about their feelings. \"It always affects you when a player gets traded or you've got rumor talk\" Randolph said. \"It's part of being human.\""}
{"game_id": "0021400560", "chunk_id": "0021400560_027", "order": 27, "role": "body", "text": "Suns: Host Cleveland on Tuesday night."}
{"game_id": "0021400560", "chunk_id": "0021400560_028", "order": 28, "role": "closing", "text": "Grizzlies: Visit Brooklyn on Wednesday night."}
