{"game_id": "0021700922", "chunk_id": "0021700922_001", "order": 1, "role": "lead", "text": "MIAMI --  Julius Randle got the Los Angeles Lakers started. Isaiah Thomas finished the job."}
{"game_id": "0021700922", "chunk_id": "0021700922_002", "order": 2, "role": "body", "text": "And there is playoff talk in Lakerland."}
{"game_id": "0021700922", "chunk_id": "0021700922_003", "order": 3, "role": "body", "text": "Thomas scored a season-high 29 points, Randle added 25 and the Lakers continued their improbable surge by shredding the Miami defense on the way to a 131-113 win over the Heat on Thursday night."}
{"game_id": "0021700922", "chunk_id": "0021700922_004", "order": 4, "role": "body", "text": "The Lakers are still six games back of the No. 8 spot in the West -- but Thomas wants them to think big."}
{"game_id": "0021700922", "chunk_id": "0021700922_005", "order": 5, "role": "body", "text": "\"I want this team to think we're going to win,\" Thomas said. \"We have the talent to win. We have the players in this locker room to win and the only thing we should be thinking about is trying to take that next step -- and that's get to the playoffs.\""}
{"game_id": "0021700922", "chunk_id": "0021700922_006", "order": 6, "role": "body", "text": "They keep playing like this, who knows what can happen."}
{"game_id": "0021700922", "chunk_id": "0021700922_007", "order": 7, "role": "body", "text": "Brandon Ingram added 19 before leaving with a leg injury that didn't initially sound too serious, Kentavious Caldwell-Pope had 18 and Kyle Kuzma finished with 16 for the Lakers, who won in Miami for the first time since Feb. 10, 2008. The Lakers shot 59 percent and were 16 of 29 from 3-point range."}
{"game_id": "0021700922", "chunk_id": "0021700922_008", "order": 8, "role": "body", "text": "It was the most points allowed by the Heat this season."}
{"game_id": "0021700922", "chunk_id": "0021700922_009", "order": 9, "role": "body", "text": "\"We are much, much better than we showed tonight defensively,\" Heat coach Erik Spoelstra said."}
{"game_id": "0021700922", "chunk_id": "0021700922_010", "order": 10, "role": "body", "text": "Thomas, whose previous season best was 24, connected on 11 of 20 shots and 6 of 11 3-point tries. Randle had 21 points in the first half for the Lakers, who are 16-7 since an 11-27 start -- and at 27-34, have now passed last season's win total."}
{"game_id": "0021700922", "chunk_id": "0021700922_011", "order": 11, "role": "body", "text": "\"We were sharing the ball,\" Lakers coach Luke Walton said. \"We were pushing it and playing at the pace we like to play at and then we were making the simple extra pass instead of trying to hold for quick shots or try to make spectacular passes.\""}
{"game_id": "0021700922", "chunk_id": "0021700922_012", "order": 12, "role": "body", "text": "Dwyane Wade scored 25 points for Miami. Goran Dragic had 19, Justise Winslow scored 17 and Josh Richardson and Bam Adebayo each added 15."}
{"game_id": "0021700922", "chunk_id": "0021700922_013", "order": 13, "role": "body", "text": "There were three big runs in the first half -- two of them by the Lakers, who took control quickly, then ceded it briefly before grabbing it again."}
{"game_id": "0021700922", "chunk_id": "0021700922_014", "order": 14, "role": "body", "text": "A 12-0 spurt in the opening minutes put the Lakers up 20-7 before the game was 4 1/2 minutes old, but the Heat immediately answered with a 17-2 run of their own to go up 24-22."}
{"game_id": "0021700922", "chunk_id": "0021700922_015", "order": 15, "role": "body", "text": "Miami ended the opening quarter leading 36-33. From there, it was all Lakers."}
{"game_id": "0021700922", "chunk_id": "0021700922_016", "order": 16, "role": "body", "text": "\"They ran us out of the gym,\" Dragic said. \"We cannot allow a team to score 130-something.\""}
{"game_id": "0021700922", "chunk_id": "0021700922_017", "order": 17, "role": "body", "text": "Los Angeles scored 21 of the next 25 points to take a 54-40 lead, wound up taking a 73-62 lead into halftime and stretched the margin to 16 on a pair of free throws by Randle midway through the third."}
{"game_id": "0021700922", "chunk_id": "0021700922_018", "order": 18, "role": "body", "text": "From there, the margin was never in doubt. The Lakers went up by 22 in the fourth, and the lead wasn't trimmed below 13 the rest of the way."}
{"game_id": "0021700922", "chunk_id": "0021700922_020", "order": 20, "role": "body", "text": "Lakers: The 73 first-half points was a season high, one more than the Lakers had at Houston on Dec. 31. ... The Lakers have won three straight on the road, a season-best. ... Channing Frye (appendectomy) was again out. He's taken one shot since joining the Lakers last month. ... This is the Lakers' fourth different four-game winning streak of the season."}
{"game_id": "0021700922", "chunk_id": "0021700922_021", "order": 21, "role": "body", "text": "Heat: Derrick Jones Jr. was recalled from Sioux Falls before the game, but his flight through Chicago was delayed and he was inactive. Thursday won't count toward the 45-day allotment on his two-way contract. ... Wade made his first six shots, meaning he was 17 of 23 in a stretch of about seven quarters going back to Saturday."}
{"game_id": "0021700922", "chunk_id": "0021700922_023", "order": 23, "role": "body", "text": "Lakers rookie guard Josh Hart isn't guaranteed a return this season, now that he's dealing with a broken bone in his left hand. He was hurt in practice Wednesday, returned to Los Angeles and won't be evaluated for another 2/3 weeks. \"If he is healthy and ready to play with a couple weeks left, then we will get him back on the court,\" Walton said."}
{"game_id": "0021700922", "chunk_id": "0021700922_025", "order": 25, "role": "body", "text": "Miami was without guards Tyler Johnson and Wayne Ellington, both of whom suffered left quadriceps contusions in Tuesday's win over Philadelphia."}
{"game_id": "0021700922", "chunk_id": "0021700922_027", "order": 27, "role": "body", "text": "Lakers: Visit San Antonio on Saturday."}
{"game_id": "0021700922", "chunk_id": "0021700922_028", "order": 28, "role": "closing", "text": "Heat: Host Detroit on Saturday."}
