{"game_id": "0021200618", "chunk_id": "0021200618_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Atlanta Hawks found the perfect remedy for their struggles on the road -- a game against the Charlotte Bobcats."}
{"game_id": "0021200618", "chunk_id": "0021200618_002", "order": 2, "role": "body", "text": "Josh Smith had 30 points and 13 rebounds as Hawks snapped a six-game road losing streak with a 104-92 win Wednesday night over their division foes. Kyle Korver added 21 points on 5-of-6 shooting from beyond the 3-point arc and Ivan Johnson chipped in with 12 points and 15 rebounds in place of the injured Al Horford."}
{"game_id": "0021200618", "chunk_id": "0021200618_003", "order": 3, "role": "body", "text": "Home, sweet home? Not for the Bobcats, who've now lost 16 straight games at home, three shy of the NBA record."}
{"game_id": "0021200618", "chunk_id": "0021200618_004", "order": 4, "role": "body", "text": "Smith made sure that streak wouldn't end, finishing two assists shy of a triple-double."}
{"game_id": "0021200618", "chunk_id": "0021200618_005", "order": 5, "role": "body", "text": "\"I just wanted to play aggressive but also play in the flow of the offense,\" Smith said. \"I didn't want to feel like I had to put pressure on myself on both ends of the court. I was just wanted to keep playing aggressive, but also play under control.\""}
{"game_id": "0021200618", "chunk_id": "0021200618_006", "order": 6, "role": "body", "text": "Smith said the Hawks didn't think much about the road losing streak."}
{"game_id": "0021200618", "chunk_id": "0021200618_007", "order": 7, "role": "body", "text": "In fact, he said it wasn't even been discussed in the locker room or during the trip to Charlotte."}
{"game_id": "0021200618", "chunk_id": "0021200618_008", "order": 8, "role": "body", "text": "\"I don't think we noticed it,\" Smith said. \"When I heard that at the beginning of the game I was surprised. But we didn't want to have any added pressure on hands. Our main focus was to get back on track.\""}
{"game_id": "0021200618", "chunk_id": "0021200618_010", "order": 10, "role": "body", "text": "The win gave the Hawks (24-18) a four-game sweep of the season series and extended their overall winning streak to seven against the Bobcats."}
{"game_id": "0021200618", "chunk_id": "0021200618_011", "order": 11, "role": "body", "text": "Korver said ball movement was the key to the win."}
{"game_id": "0021200618", "chunk_id": "0021200618_012", "order": 12, "role": "body", "text": "\"We're not a good 1-on-1 team,\" Korver said. \"When we move the ball we have shooting, we have speed and we have athleticism.\""}
{"game_id": "0021200618", "chunk_id": "0021200618_013", "order": 13, "role": "body", "text": "Ramon Sessions led the Bobcats with a season-high 27 points. Kemba Walker, who had a career-high 35 points on Monday, was limited to 11 on 4-of-11 shooting. Ben Gordon added 15 points."}
{"game_id": "0021200618", "chunk_id": "0021200618_014", "order": 14, "role": "body", "text": "Suiting up only 10 players because of injuries, the Hawks were forced to play their starters more than usual. Atlanta was missing Horford, Devin Harris, Zaza Pachulia, Lou Williams and Anthony Morrow."}
{"game_id": "0021200618", "chunk_id": "0021200618_015", "order": 15, "role": "body", "text": "Hawks coach Larry Drew called it a good win for his club considered the team was so short-handed."}
{"game_id": "0021200618", "chunk_id": "0021200618_016", "order": 16, "role": "body", "text": "\"Obviously with no Al Horford I was a little concerned about our big man play but that was answered tonight,\" Drew said. \"I thought Ivan Johnson stepped in and did a phenomenal job. He was a presence on the floor. He scored. He rebounded the ball. He took a charge. He came in and gave us a big, big lift tonight.\""}
{"game_id": "0021200618", "chunk_id": "0021200618_017", "order": 17, "role": "body", "text": "The Hawks led most of the way by a comfortable margin, although Charlotte did cut the lead to seven with 5:40 left. That's when Johan Petro knocked down a 3-pointer and Smith hit a long jumper to keep the Bobcats at bay."}
{"game_id": "0021200618", "chunk_id": "0021200618_018", "order": 18, "role": "body", "text": "Charlotte never mounted another challenge after that."}
{"game_id": "0021200618", "chunk_id": "0021200618_019", "order": 19, "role": "body", "text": "The Bobcats have not won at home since Nov. 21."}
{"game_id": "0021200618", "chunk_id": "0021200618_020", "order": 20, "role": "body", "text": "The Hawks led by seven at halftime but quickly stretched that lead to 17 midway through the third quarter as Smith took control inside."}
{"game_id": "0021200618", "chunk_id": "0021200618_021", "order": 21, "role": "body", "text": "When he wasn't scoring on jump shots or drives to the basket, Smith was passing to Korver, who continued to knock down shots. Korver was 8 of 11 from the field and seemed to shatter the Bobcats' hopes every time they appeared poised to make a run."}
{"game_id": "0021200618", "chunk_id": "0021200618_022", "order": 22, "role": "body", "text": "\"When Josh plays that type of game he is one of the best all-around players in this league,\" Sessions said. \"You know he can post up, make passes and hit jump shots. He was playing well tonight from all aspects of the floor. He is tough to guard when he is like that because he is really a small forward but he can also post up so he is a tough matchup.\""}
{"game_id": "0021200618", "chunk_id": "0021200618_023", "order": 23, "role": "body", "text": "Bobcats coach Mike Dunlap accepted responsibility for his team's recent struggles at home."}
{"game_id": "0021200618", "chunk_id": "0021200618_024", "order": 24, "role": "body", "text": "\"The frustration is high,\" Dunlap said. \"When you're in charge, and I'm in charge, that frustration has to be handled the right way.\""}
{"game_id": "0021200618", "chunk_id": "0021200618_025", "order": 25, "role": "body", "text": "Dunlap said that's why he doesn't show much emotion. He knows it's all about building for the future, which means developing young players."}
{"game_id": "0021200618", "chunk_id": "0021200618_026", "order": 26, "role": "body", "text": "\"We're doing certain things here and unfortunately we're going to have nights like this,\" Dunlap said."}
{"game_id": "0021200618", "chunk_id": "0021200618_027", "order": 27, "role": "closing", "text": "Game notes Jeff Teague had 10 points for Atlanta, finishing in double figures for the 30th time this season. ... The Bobcats continue to struggle to get balanced scoring production from their starters. In fact, their five starters barely outscored Smith, combining for just 31 points. ... Charlotte's big men, Hakim Warrick, Bismack Biyombo and Jeff Adrien, combined for just 12 points, while Gana Diop and Tyrus Thomas didn't even play."}
