{"game_id": "0021200846", "chunk_id": "0021200846_001", "order": 1, "role": "lead", "text": "CHICAGO --  Dion Waiters scored on jumpers, turnarounds and an assortment of moves in the lane. Shaun Livingston made a couple of a big plays in a rare start, and Wayne Ellington provided some scoring punch when the reserves were in the game."}
{"game_id": "0021200846", "chunk_id": "0021200846_002", "order": 2, "role": "body", "text": "Even without Kyrie Irving, the improving Cleveland Cavaliers had too much talent for the banged-up Chicago Bulls."}
{"game_id": "0021200846", "chunk_id": "0021200846_003", "order": 3, "role": "body", "text": "Waiters scored 25 points, Livingston added 15 in the same state where he starred in high school and the Cavs held on for a 101-98 victory on Tuesday night that snapped an 11-game losing streak against the Bulls."}
{"game_id": "0021200846", "chunk_id": "0021200846_004", "order": 4, "role": "body", "text": "\"Without Kyrie, we knew it was going to be tough, period,\" Cleveland coach Byron Scott said. \"But I thought guys stepped up big time.\""}
{"game_id": "0021200846", "chunk_id": "0021200846_005", "order": 5, "role": "body", "text": "While Irving rested a sore right knee in street clothes on the sideline, Waiters converted a fadeaway jumper and a layup before Tyler Zeller drove along the baseline for a layup that helped Cleveland open an 87-78 lead with 7:33 left in the game."}
{"game_id": "0021200846", "chunk_id": "0021200846_006", "order": 6, "role": "body", "text": "The Bulls were down two when they got the ball back with 37.8 seconds left, but Luol Deng missed a long jumper and Livingston hit two free throws to make it 100-96. Luke Walton then forced a turnover to get the ball back for the Cavs."}
{"game_id": "0021200846", "chunk_id": "0021200846_007", "order": 7, "role": "body", "text": "Ellington finished with 13 points as Cleveland held on for its third win in the last four games, bouncing back from a difficult 109-105 loss at Miami on Sunday."}
{"game_id": "0021200846", "chunk_id": "0021200846_008", "order": 8, "role": "body", "text": "\"We've been playing some very solid basketball last month, month-and-a-half,\" Walton said. \"We still struggle down the stretch once in a while, here and there. But we're grinding and we're learning and we're definitely a much better team right now than we were at the beginning of the season.\""}
{"game_id": "0021200846", "chunk_id": "0021200846_009", "order": 9, "role": "body", "text": "Carlos Boozer scored 27 points and Deng had 26 for Chicago, which has dropped five of seven. Kirk Hinrich returned to the lineup after missing three consecutive games with a lingering right elbow issue and finished with 11 points, 11 assists and six rebounds."}
{"game_id": "0021200846", "chunk_id": "0021200846_010", "order": 10, "role": "body", "text": "\"Until we get the level of intensity up and play with high energy on both ends of the floor, play for 48 minutes, the results are not going to be good,\" Bulls coach Tom Thibodeau said. \"You get what you deserve in this league and we're getting what we deserve right now, so until we change that we're going to have problems.\""}
{"game_id": "0021200846", "chunk_id": "0021200846_011", "order": 11, "role": "body", "text": "The Bulls played their first game of the season without reserve forward Taj Gibson, who sprained his left knee when he stepped on the foot of Oklahoma City guard Reggie Jackson in the fourth quarter of Sunday's 102-72 loss to the Thunder. Gibson is expected to miss at least two weeks in another devastating injury for Chicago."}
{"game_id": "0021200846", "chunk_id": "0021200846_012", "order": 12, "role": "body", "text": "Derrick Rose has missed the entire season while he recovers from major left knee surgery, and Hinrich also has missed a bunch of games due to a myriad of injuries."}
{"game_id": "0021200846", "chunk_id": "0021200846_013", "order": 13, "role": "body", "text": "\"We have to find a way,\" said Bulls center Joakim Noah, who has been playing with a right foot injury. \"We have to play with more urgency and play together. I think that is disappointing right now. It's been a long stretch where we haven't been playing great basketball.\""}
{"game_id": "0021200846", "chunk_id": "0021200846_014", "order": 14, "role": "body", "text": "Alonzo Gee finished with 11 points for the Cavaliers, who open a five-game homestand against Toronto on Wednesday. Tristan Thompson added 10 points and eight rebounds."}
{"game_id": "0021200846", "chunk_id": "0021200846_015", "order": 15, "role": "body", "text": "Chicago and Cleveland handed the lead back and forth for much of the third quarter. Three consecutive charging calls on the Bulls helped the Cavaliers open a 72-67 advantage on Walton's long jumper with two minutes left in the period, but Noah found Deng inside to help Chicago get within one."}
{"game_id": "0021200846", "chunk_id": "0021200846_016", "order": 16, "role": "body", "text": "The Bulls had a chance to go in front in the final seconds of the third, but Marco Belinelli's 3-point attempt was blocked by Livingston, and Ellington hit a 3 as time expired to lift Cleveland to a 75-71 lead."}
{"game_id": "0021200846", "chunk_id": "0021200846_017", "order": 17, "role": "body", "text": "Waiters was 10 for 16 from the field and is averaging 19.8 points in his last five games. The rookie, who was the No. 4 overall pick in last year's draft, had 26 points in the loss to Miami."}
{"game_id": "0021200846", "chunk_id": "0021200846_018", "order": 18, "role": "body", "text": "\"Just being patient, letting the game come to me, and just taking what the defense gives me,\" Waiters said. \"That's what I'm trying to do is just be aggressive, looking to attack, keep the defense on their heels.\""}
{"game_id": "0021200846", "chunk_id": "0021200846_019", "order": 19, "role": "closing", "text": "Game notes Rose and Irving have never faced each other in an NBA game. \"Well, I think we're all looking forward to that,\" Scott said. \"My greatest hope is that No. 1 that Derrick Rose comes back and he's back to being the old Derrick Rose. If that happens and they get a chance to go against each other, I think that would be very interesting.\" ... Livingston played his prep ball at Peoria Central H.S. ... Chicago's 115-86 win at Cleveland on Nov. 2 is the worst loss of the season for the Cavaliers."}
