{"game_id": "0021700851", "chunk_id": "0021700851_001", "order": 1, "role": "lead", "text": "DALLAS --  American Airlines Center was once the most hostile road arena for the Sacramento Kings."}
{"game_id": "0021700851", "chunk_id": "0021700851_003", "order": 3, "role": "body", "text": "Zach Randolph scored 22 points, Bogdan Bogdanovich added 19 and the Kings used a big first half to beat the Dallas Mavericks 114-109 on Tuesday night."}
{"game_id": "0021700851", "chunk_id": "0021700851_004", "order": 4, "role": "body", "text": "Sacramento has won four of five in Dallas after losing 22 in a row here from 2003 to 2016."}
{"game_id": "0021700851", "chunk_id": "0021700851_005", "order": 5, "role": "body", "text": "\"We were sharing the ball,\" Randolph said. \"Once we were moving the ball, we were getting attacks. That's what good teams do -- move the ball.\""}
{"game_id": "0021700851", "chunk_id": "0021700851_006", "order": 6, "role": "body", "text": "While the Kings were taking charge early, the Mavs played like a team that was starting the All-Star break one game early."}
{"game_id": "0021700851", "chunk_id": "0021700851_007", "order": 7, "role": "body", "text": "Randolph scored 18 in the first half, helping Sacramento to a 65-44 lead at the break. The Kings dominated the paint in the first two quarters, scoring 40 points, while the Mavericks shot just 35 percent."}
{"game_id": "0021700851", "chunk_id": "0021700851_008", "order": 8, "role": "body", "text": "At one point in the second quarter, coach Rick Carlisle replaced his entire lineup, only to see the Kings beat the Mavs to two offensive rebounds that resulted in a Garrett Temple 3-pointer that made it 46-28."}
{"game_id": "0021700851", "chunk_id": "0021700851_009", "order": 9, "role": "body", "text": "\"Bad first half, good second half, have a great break,\" Carlisle said to open his postgame press conference. He then walked away from the podium before coming back to answer a few more questions, saying, \"Our job is to compete, and we didn't compete in the first half, and that's a problem.\""}
{"game_id": "0021700851", "chunk_id": "0021700851_010", "order": 10, "role": "body", "text": "J.J. Barea led the Mavericks with 19 points, and Harrison Barnes and Dwight Powell each scored 18."}
{"game_id": "0021700851", "chunk_id": "0021700851_011", "order": 11, "role": "body", "text": "The Kings had a 26-point lead early in the third quarter before the Mavericks put together a 17-3 run fueled by four 3-pointers. But Sacramento had an 88-71 advantage after three, and then opened the final quarter with a 9-0 run to match its largest lead."}
{"game_id": "0021700851", "chunk_id": "0021700851_012", "order": 12, "role": "body", "text": "The Mavericks kept chipping away for the entire quarter and closed with a 30-11 run to make the final score close."}
{"game_id": "0021700851", "chunk_id": "0021700851_013", "order": 13, "role": "body", "text": "\"The season got off to a little bit of a tough start, but we've been fighting and staying together,\" Barea said. \"We've got to help the young guys out, get better as a team and finish the season as best as we can.\""}
{"game_id": "0021700851", "chunk_id": "0021700851_015", "order": 15, "role": "body", "text": "The only Mavericks player attending All-Star weekend is rookie point guard Dennis Smith Jr., who will play in the Rising Stars game on Friday night and then join three others for the Verizon Slam Dunk contest Saturday."}
{"game_id": "0021700851", "chunk_id": "0021700851_016", "order": 16, "role": "body", "text": "\"I always wanted to be in the All-Star Game, not so much the dunk contest,\" Smith said. \"But to be in it is a blessing and I'm looking forward to it.\""}
{"game_id": "0021700851", "chunk_id": "0021700851_017", "order": 17, "role": "body", "text": "Smith scored 17 points against Sacramento, but it was a former dunk contest winner, 41-year-old Vince Carter, who put down the night's most emphatic slam after he stole the ball and went in uncontested in the second quarter."}
{"game_id": "0021700851", "chunk_id": "0021700851_019", "order": 19, "role": "body", "text": "Kings: Finished with 56 points in the paint. \"I thought we did a good job finishing around the rim,\" coach Dave Joerger said. \"Certainly our bigs were terrific.\" Post players Randolph, Willie Cauley-Stein and Kosta Koufos shot 19 for 28. ... Eight minutes into the game, Randolph had outscored the cold-shooting Mavericks all by himself, 11-8. ... Carlisle said Carter's longevity was \"beyond belief. ... He's still playing at a good level. You've got to guard him.\" Carter played for the Mavericks from 2011-14."}
{"game_id": "0021700851", "chunk_id": "0021700851_020", "order": 20, "role": "body", "text": "Mavericks: Dirk Nowitzki, Wesley Matthews and Barea returned after missing Sunday night's loss to Houston due to various minor injuries. ... Matthews became the seventh Dallas player to hit 500 3-pointers with the team with his two in the first half."}
{"game_id": "0021700851", "chunk_id": "0021700851_022", "order": 22, "role": "body", "text": "Kings: At Houston on Wednesday for the second half of a back-to-back."}
{"game_id": "0021700851", "chunk_id": "0021700851_023", "order": 23, "role": "closing", "text": "Mavericks: Nine days off before visiting the Lakers on Feb. 23."}
