{"game_id": "0021700028", "chunk_id": "0021700028_001", "order": 1, "role": "lead", "text": "CLEVELAND --  The Orlando Magic certainly know how to end a long losing streak."}
{"game_id": "0021700028", "chunk_id": "0021700028_002", "order": 2, "role": "body", "text": "Nikola Vucevic scored 23 points and the Magic snapped a 17-game skid against the Cleveland Cavaliers, routing the defending Eastern Conference champions 114-93 on Saturday night."}
{"game_id": "0021700028", "chunk_id": "0021700028_003", "order": 3, "role": "body", "text": "Orlando's players knew their first win over Cleveland since Nov. 23, 2012, was more than your typical early regular-season victory."}
{"game_id": "0021700028", "chunk_id": "0021700028_004", "order": 4, "role": "body", "text": "\"This game had lots of positives, one of the most positives we've had in a long time,\" Vucevic said. \"I'm really happy for this team because we haven't had success against them for a while.\""}
{"game_id": "0021700028", "chunk_id": "0021700028_005", "order": 5, "role": "body", "text": "The Magic never trailed and built a 21-point lead late in the first quarter. Orlando led 36-18 after the first, hitting 14 of 24 from the field -- eight of them 3-pointers. Orlando made 17 of 35 3-pointers in all, and took their biggest lead, 106-69, midway through the fourth when both teams cleared their benches."}
{"game_id": "0021700028", "chunk_id": "0021700028_006", "order": 6, "role": "body", "text": "LeBron James scored 14 points in the first quarter and finished with 22 as the Cavaliers lost for the first time in three games."}
{"game_id": "0021700028", "chunk_id": "0021700028_007", "order": 7, "role": "body", "text": "\"They came out and gave us one from the beginning of the game and they kept it going,\" James said. \"We were a couple steps behind and they made us pay.\""}
{"game_id": "0021700028", "chunk_id": "0021700028_008", "order": 8, "role": "body", "text": "Cavaliers coach Tyronn Lue called timeout less than five minutes into the game when Orlando took a 15-4 lead. The Magic continued to build the margin, which reached 42-20 early in the second quarter on Bismack Biyombo's tip-in."}
{"game_id": "0021700028", "chunk_id": "0021700028_009", "order": 9, "role": "body", "text": "They outplayed us,\" Lue said. \"They kicked our butt.\""}
{"game_id": "0021700028", "chunk_id": "0021700028_010", "order": 10, "role": "body", "text": "Cleveland trailed 56-45 at halftime and cut the lead to 65-58 midway through the third when James blocked D.J. Augustin's drive and Dwyane Wade hit a 3-pointer. The Magic answered with a 12-0 run, including a banked-in 30-footer from Augustin and two baskets by Vucevic."}
{"game_id": "0021700028", "chunk_id": "0021700028_011", "order": 11, "role": "body", "text": "\"Last year, we probably would've crumbled when they got the lead down,\" Augustin said. \"We've got a lot of goals in mind this season, but we're staying humble.\""}
{"game_id": "0021700028", "chunk_id": "0021700028_012", "order": 12, "role": "body", "text": "Vucevic, a night after scoring a career-high 41 points in a loss to Brooklyn, was 11 of 16 from the field."}
{"game_id": "0021700028", "chunk_id": "0021700028_013", "order": 13, "role": "body", "text": "Jonathon Simmons scored 19 points while Evan Fournier added 13 for Orlando. Iman Shumpert scored 21 points, including 15 in the fourth quarter, and Kevin Love had 18 for Cleveland."}
{"game_id": "0021700028", "chunk_id": "0021700028_014", "order": 14, "role": "body", "text": "Derrick Rose missed the game for Cleveland with a sprained left ankle after being fouled by Milwaukee's Greg Monroe on Friday."}
{"game_id": "0021700028", "chunk_id": "0021700028_015", "order": 15, "role": "body", "text": "\"They were far from their best and we understand that,\" Orlando coach Frank Vogel said. \"We need to keep that in perspective.\""}
{"game_id": "0021700028", "chunk_id": "0021700028_017", "order": 17, "role": "body", "text": "Vogel called timeout after the Cavaliers cut the lead to seven in the third quarter. He joked his speech in the huddle keyed Orlando's surge that put the game away."}
{"game_id": "0021700028", "chunk_id": "0021700028_018", "order": 18, "role": "body", "text": "\"I just inspired them during that stretch,\" he said. \"It was all me, really.\""}
{"game_id": "0021700028", "chunk_id": "0021700028_020", "order": 20, "role": "body", "text": "The 7-foot Vucevic hit 6 of 8 3s on Friday and added another against Cleveland."}
{"game_id": "0021700028", "chunk_id": "0021700028_021", "order": 21, "role": "body", "text": "\"A guy makes six threes, you have to respect that,\" Lue said. \"If you put a smaller guy on him he can go to the block. If you put bigger guys on him he's able to pop and get off shots.\""}
{"game_id": "0021700028", "chunk_id": "0021700028_023", "order": 23, "role": "body", "text": "Magic: F Aaron Gordon (sore left ankle) did some work on the court before the game, but sat out for the second night in a row. ... G Elfrid Payton (strained left hamstring) did not play after being injured Friday at Brooklyn. An MRI revealed a mild to moderate strain. No timetable was given for his return."}
{"game_id": "0021700028", "chunk_id": "0021700028_024", "order": 24, "role": "body", "text": "Cavaliers: Rose's injury moved Jose Calderon, the only other true point guard on the roster, into the starting lineup. The veteran was pulled five minutes into the game after missing two shots and didn't start the third quarter when Shumpert ran the offense. Calderon returned in the fourth quarter."}
{"game_id": "0021700028", "chunk_id": "0021700028_026", "order": 26, "role": "body", "text": "Magic: Host Brooklyn on Tuesday."}
{"game_id": "0021700028", "chunk_id": "0021700028_027", "order": 27, "role": "body", "text": "Cavaliers: Host Chicago on Tuesday."}
{"game_id": "0021700028", "chunk_id": "0021700028_029", "order": 29, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
