{"game_id": "0021300650", "chunk_id": "0021300650_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  The Milwaukee Bucks came along just in time to help the Atlanta Hawks rebound from a tough loss with a big victory."}
{"game_id": "0021300650", "chunk_id": "0021300650_002", "order": 2, "role": "body", "text": "Paul Millsap scored 20 points to lead six Hawks in double figures and key the decisive surge that helped Atlanta rebound from a 26-point home loss for a 112-87 win over Milwaukee on Saturday night."}
{"game_id": "0021300650", "chunk_id": "0021300650_003", "order": 3, "role": "body", "text": "\"We know if we don't put it behind us, we know what can happen,\" Millsap said. \"So, we had to move on to the next team -- especially if you want to win in this league.\""}
{"game_id": "0021300650", "chunk_id": "0021300650_004", "order": 4, "role": "body", "text": "Millsap scored 14 points during a 24-5 run that started at the end of the second quarter and put Atlanta ahead 73-47 with 8:24 left in the third. The margin grew to 96-64 heading into the fourth and Atlanta beat Milwaukee for the eighth time in their last nine games."}
{"game_id": "0021300650", "chunk_id": "0021300650_005", "order": 5, "role": "body", "text": "\"Our focus was to come out and get back to competing,\" Millsap said. \"Guys worked pretty hard out there and the defense was good.\""}
{"game_id": "0021300650", "chunk_id": "0021300650_006", "order": 6, "role": "body", "text": "That's what head coach Mike Budenholzer thought after his team won for the third time in four games."}
{"game_id": "0021300650", "chunk_id": "0021300650_007", "order": 7, "role": "body", "text": "\"We didn't play last night, but our team didn't hang their heads,\" he said. \"They moved forward.\""}
{"game_id": "0021300650", "chunk_id": "0021300650_008", "order": 8, "role": "body", "text": "Reserve Louis Williams added 18 points for the Hawks."}
{"game_id": "0021300650", "chunk_id": "0021300650_009", "order": 9, "role": "body", "text": "Shelvin Mack scored nine points starting at point guard for Jeff Teague, who sprained his left ankle during the Hawks' 105-79 loss to San Antonio on Friday. It was their season-low in points."}
{"game_id": "0021300650", "chunk_id": "0021300650_010", "order": 10, "role": "body", "text": "Williams alternated with Mack running the offense on Saturday."}
{"game_id": "0021300650", "chunk_id": "0021300650_011", "order": 11, "role": "body", "text": "Brandon Knight scored 27 points for the Bucks, who lost for the 11th time in 12 games. Ersan Ilyasova and Khris Middleton added 11 apiece."}
{"game_id": "0021300650", "chunk_id": "0021300650_012", "order": 12, "role": "body", "text": "While the Hawks worked hard, the Bucks simply didn't."}
{"game_id": "0021300650", "chunk_id": "0021300650_013", "order": 13, "role": "body", "text": "Milwaukee coach Larry Drew, who faced the Hawks for the first time this season after being fired by Atlanta last season, closed the locker room and challenged the Bucks' lackadaisical style."}
{"game_id": "0021300650", "chunk_id": "0021300650_014", "order": 14, "role": "body", "text": "\"This was a totally, totally unacceptable performance,\" he said of his 21-minute message. \"Do we have anything inside that will allow us to go out and compete at a high level?\""}
{"game_id": "0021300650", "chunk_id": "0021300650_015", "order": 15, "role": "body", "text": "John Henson and Caron Butler came off the bench to score 10 points, but it came with the game already decided."}
{"game_id": "0021300650", "chunk_id": "0021300650_016", "order": 16, "role": "body", "text": "\"I'm going to have to go with the guys that play hard,\" Drew said. \"You're not going to play hard? You're not going to play.\""}
{"game_id": "0021300650", "chunk_id": "0021300650_017", "order": 17, "role": "body", "text": "Henson downplayed the tone of the message."}
{"game_id": "0021300650", "chunk_id": "0021300650_018", "order": 18, "role": "body", "text": "\"He just said we got to keep fighting, man,\" Henson said. \"He said he's been in the league for 37 some years and he's seen it all. So, we just got to find that fire in us, to have that pride for the name on the front  and the back of our jerseys\"."}
{"game_id": "0021300650", "chunk_id": "0021300650_019", "order": 19, "role": "body", "text": "Teague hurt his ankle when he landed on Tim Duncan's foot late in the second quarter on Friday."}
{"game_id": "0021300650", "chunk_id": "0021300650_020", "order": 20, "role": "body", "text": "Atlanta regained its shooting touch from 3-point range, making 13 of 24 3s after hitting only 2 of 13 attempts against San Antonio. Williams made two of the Hawks' four 3-pointers during a 16-9 run late in the first quarter and Mike Scott's 3 capped an 11-3 surge just before the half for a 60-45 lead."}
{"game_id": "0021300650", "chunk_id": "0021300650_021", "order": 21, "role": "body", "text": "DeMarre Carroll scored 12 points in his return to the starting lineup after missing the game against the Spurs with a left hamstring strain."}
{"game_id": "0021300650", "chunk_id": "0021300650_022", "order": 22, "role": "body", "text": "\"Once I'm on the court, I'm on the court,\" he said. \"My mind goes to junkyard dog mode, and I just grind it out. I have to give credit to the training staff. I got treatment like three or four times today.\""}
{"game_id": "0021300650", "chunk_id": "0021300650_023", "order": 23, "role": "body", "text": "Scott finished with 14 points, Kyle Korver 12 and Elton Brand 10 as the Hawks beat Milwaukee for the fifth consecutive time, the first time they've done that since a taking six straight from March 8, 1996, to March 7, 1997. Atlanta swept the four-game series last season."}
{"game_id": "0021300650", "chunk_id": "0021300650_024", "order": 24, "role": "body", "text": "\"We just tried to come out and compete,\" Carroll said. \"When we let our defense do the talking, our offense flows easily. We were playing unselfish.\""}
{"game_id": "0021300650", "chunk_id": "0021300650_025", "order": 25, "role": "body", "text": "Giannis Antetokounmpo, playing with a sore back, scored five points for NBA-worst Milwaukee (8-35)."}
{"game_id": "0021300650", "chunk_id": "0021300650_026", "order": 26, "role": "body", "text": "Rookie Pero Antic (stress fracture in right ankle) and Carroll already were out before Teague's injury left the Hawks with just 10 players on Friday. Antic had replaced starting center Al Horford, out for the season with a torn right pectoral."}
{"game_id": "0021300650", "chunk_id": "0021300650_027", "order": 27, "role": "closing", "text": "Game notes Korver was 3 of 4 from beyond the arc, extending his NBA record to 112 consecutive games with a 3-pointer. . Referee Josh Tiven called a technical on the Bucks' John Henson for hanging on the net in the first quarter. ... Atlanta was 8 of 16 from 3-point range in the first half."}
