{"game_id": "0021700482", "chunk_id": "0021700482_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Victor Oladipo dug the Indiana Pacers out of a hole again."}
{"game_id": "0021700482", "chunk_id": "0021700482_002", "order": 2, "role": "body", "text": "He scored 38 points and was perfect from the free-throw line, helping the Indiana Pacers escape with a 123-119 overtime victory over the Brooklyn Nets on Saturday night."}
{"game_id": "0021700482", "chunk_id": "0021700482_003", "order": 3, "role": "body", "text": "\"For whatever reason, it was tough for us in the first half,\" Oladipo said. \"In the second half, things started going our way. We picked it up and played at a high level on both ends.\""}
{"game_id": "0021700482", "chunk_id": "0021700482_004", "order": 4, "role": "body", "text": "Myles Turner had 23 points and nine rebounds and tied his career high with six blocks, and Bojan Bogdanovic finished with 17 points and six rebounds for the Pacers (19-14), who came back from down 19 to take an 85-84 lead on Lance Stephenson's free throw with 8:29 remaining in regulation."}
{"game_id": "0021700482", "chunk_id": "0021700482_005", "order": 5, "role": "body", "text": "Spencer Dinwiddle led the Nets (12-20) and tied his career high with 26 points. He made three free throws with 19 seconds left in the fourth quarter to tie the game at 111 and force overtime."}
{"game_id": "0021700482", "chunk_id": "0021700482_006", "order": 6, "role": "body", "text": "DeMarre Carroll finished with 20 points and 13 rebounds and made a 3-pointer to tie it at 119 with 45 seconds left in overtime. Oladipo made four free throws in two trips to the line in the final 29 seconds to seal the win."}
{"game_id": "0021700482", "chunk_id": "0021700482_007", "order": 7, "role": "body", "text": "\"Oladipo, gotta give the guy credit,\" Nets coach Kenny Atkinson said. \"He is playing elite, elite basketball. He's one of the best players in the league right now. (And) they were just the more aggressive team to start the third quarter.\""}
{"game_id": "0021700482", "chunk_id": "0021700482_008", "order": 8, "role": "body", "text": "An 11-2 run in the second quarter put the Nets ahead by 19 -- their largest lead of the game -- and Brooklyn led 57-41 by halftime."}
{"game_id": "0021700482", "chunk_id": "0021700482_009", "order": 9, "role": "body", "text": "Indiana went on an 11-0 run to open the second half. Later, Darren Collison made a 3-pointer to cap off a 10-0 run and put the Pacers ahead for the first time since early in the first quarter."}
{"game_id": "0021700482", "chunk_id": "0021700482_010", "order": 10, "role": "body", "text": "Indiana's slow starts and struggles at home have become a trend. The win snapped a three-game losing streak at home, where the Pacers are 11-7 this season."}
{"game_id": "0021700482", "chunk_id": "0021700482_011", "order": 11, "role": "body", "text": "\"We've got to figure it out,\" Oladipo said. \"We've just got to do a better job at home. We're less comfortable at home than we are on the road, honestly. This team's not perfect and we've got a lot of room to grow. But we're figuring it out. It's a long season.\""}
{"game_id": "0021700482", "chunk_id": "0021700482_012", "order": 12, "role": "body", "text": "The Pacers are having little trouble with Brooklyn, though. Indiana has won six straight against the Nets, including three this season. The two teams meet for the final game of the four-game regular-season series on Feb. 14 in Brooklyn."}
{"game_id": "0021700482", "chunk_id": "0021700482_014", "order": 14, "role": "body", "text": "Nets: Brooklyn made 16 3-pointers. ... The Nets won the rebounding battle, 51-41. ... Rondae Hollis-Jefferson had 18 points and eight rebounds."}
{"game_id": "0021700482", "chunk_id": "0021700482_015", "order": 15, "role": "body", "text": "Pacers: Indiana shot 52.2 percent from the field. ... Oladipo had six assists. ... Collison finished with 14 points and nine assists, and Stephenson scored 11 points off the bench."}
{"game_id": "0021700482", "chunk_id": "0021700482_017", "order": 17, "role": "body", "text": "Turner has blocked a shot in all but one game this season and leads the league with 2.5 blocks per game."}
{"game_id": "0021700482", "chunk_id": "0021700482_019", "order": 19, "role": "body", "text": "Nets center Tyler Zeller grew up and played high school basketball in Washington, Indiana. Zeller started the game and created a spark, scoring all six of his points to help the Nets take a 13-7 lead early in the first quarter."}
{"game_id": "0021700482", "chunk_id": "0021700482_021", "order": 21, "role": "body", "text": "Nets: Visit San Antonio for the second of a five-game trip."}
{"game_id": "0021700482", "chunk_id": "0021700482_022", "order": 22, "role": "body", "text": "Pacers: Visit Detroit on Tuesday."}
{"game_id": "0021700482", "chunk_id": "0021700482_024", "order": 24, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
