{"game_id": "0021700403", "chunk_id": "0021700403_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  From the moment he signed with the Kings last offseason, Zach Randolph fully embraced his role as a veteran mentor in the locker room for a mostly young team."}
{"game_id": "0021700403", "chunk_id": "0021700403_002", "order": 2, "role": "body", "text": "Sacramento's 36-year-old power forward is still getting it done on the court, too. And in crunch time, no less."}
{"game_id": "0021700403", "chunk_id": "0021700403_003", "order": 3, "role": "body", "text": "Randolph scored 11 of his 17 points in the fourth quarter to spark a big run, and the Kings rallied past the slumping Phoenix Suns 99-92 on Tuesday night."}
{"game_id": "0021700403", "chunk_id": "0021700403_004", "order": 4, "role": "body", "text": "\"Just trying to get good shots,\" Randolph said. \"I missed a couple easy shots. Didn't really get (anything) going until the end. Just tried to get something going in the paint.\""}
{"game_id": "0021700403", "chunk_id": "0021700403_005", "order": 5, "role": "body", "text": "Randolph missed seven of his first 10 shots but was perfect on four attempts in the fourth quarter, all of them coming after the Kings fell behind 85-80 with six minutes remaining. Sacramento scored the next 13 points to take control."}
{"game_id": "0021700403", "chunk_id": "0021700403_006", "order": 6, "role": "body", "text": "The Kings' big man, who had seven rebounds and five assists, made a three-point play with 44.9 seconds remaining to secure the win after getting fouled by Tyson Chandler."}
{"game_id": "0021700403", "chunk_id": "0021700403_007", "order": 7, "role": "body", "text": "\"That's what you pay big stud muffins like that for, to go deliver the mail,\" Sacramento coach Dave Joerger said. \"We didn't play great but we played hard and gave ourselves a chance coming down the stretch.\""}
{"game_id": "0021700403", "chunk_id": "0021700403_008", "order": 8, "role": "body", "text": "George Hill had 18 points and seven rebounds in his return to the starting lineup. Buddy Hield scored 14 points and Willie Cauley-Stein added 13 points and six rebounds to help the Kings win for the second time in five games."}
{"game_id": "0021700403", "chunk_id": "0021700403_009", "order": 9, "role": "body", "text": "\"(Hill is) a big part of this,\" Randolph said. \"Without him on top of his game, it's going to be hard for us. We need G to play like that every game.\""}
{"game_id": "0021700403", "chunk_id": "0021700403_010", "order": 10, "role": "body", "text": "The late scoring flurry was a departure from the rest of the game, when both teams struggled to score with much consistency."}
{"game_id": "0021700403", "chunk_id": "0021700403_011", "order": 11, "role": "body", "text": "Phoenix built an early 10-point lead in the first half but went scoreless for more than five minutes in the fourth quarter and lost its fourth straight."}
{"game_id": "0021700403", "chunk_id": "0021700403_012", "order": 12, "role": "body", "text": "The Suns, who have dropped nine of 11, fell to 0-3 since losing leading scorer Devin Booker to a left adductor strain."}
{"game_id": "0021700403", "chunk_id": "0021700403_013", "order": 13, "role": "body", "text": "\"They made shots down the stretch,\" Phoenix coach Jay Triano said. \"We missed a couple of good shots and they made theirs. That's the difference in the game.\""}
{"game_id": "0021700403", "chunk_id": "0021700403_014", "order": 14, "role": "body", "text": "TJ Warren scored 18 points for Phoenix. Mike James added 17 points and five assists."}
{"game_id": "0021700403", "chunk_id": "0021700403_015", "order": 15, "role": "body", "text": "The teams combined for 15 lead changes before Sacramento pulled away behind Randolph."}
{"game_id": "0021700403", "chunk_id": "0021700403_016", "order": 16, "role": "body", "text": "Warren scored two quick buckets early in the fourth quarter and Dragan Bender made a 3-pointer to put the Suns up 85-80."}
{"game_id": "0021700403", "chunk_id": "0021700403_017", "order": 17, "role": "body", "text": "Randolph hit back-to-back baskets then fed Hill for a reverse layup. After a 3 by Hield, Randolph made two free throws and then scored down low to put the Kings up 93-85."}
{"game_id": "0021700403", "chunk_id": "0021700403_018", "order": 18, "role": "body", "text": "Tyler Ulis and James scored to cut the gap to 93-89 before Randolph's three-point play."}
{"game_id": "0021700403", "chunk_id": "0021700403_020", "order": 20, "role": "body", "text": "The Suns missed 15 of their 17 attempts from 3-point range in the second half and finished 7 of 32 from beyond the arc. \"We just have to be better at shooting the 3-ball,\" Triano said. \"The game is trending that way and we've got to be able to make more than 2 for 17.\""}
{"game_id": "0021700403", "chunk_id": "0021700403_022", "order": 22, "role": "body", "text": "Joerger praised his team's defense after the King held the Suns to 0-for-12 shooting during their scoring drought in the fourth quarter. \"We were a little bit more aggressive,\" Joerger said. \"When our defense was set, we were much more effective over the course of the game.\""}
{"game_id": "0021700403", "chunk_id": "0021700403_024", "order": 24, "role": "body", "text": "Suns: James, Troy Daniels, Josh Jackson and Bender made consecutive 3s without a miss as part of a 12-2 run in the second quarter."}
{"game_id": "0021700403", "chunk_id": "0021700403_025", "order": 25, "role": "body", "text": "Kings: Sacramento committed nine turnovers. ... Hill returned to the starting lineup after sitting out one game for personal reasons. ... Cauley-Stein had missed three games with a lower back strain."}
{"game_id": "0021700403", "chunk_id": "0021700403_027", "order": 27, "role": "body", "text": "Suns: Host the Toronto Raptors on Wednesday in the second half of a back-to-back."}
{"game_id": "0021700403", "chunk_id": "0021700403_028", "order": 28, "role": "body", "text": "Kings: At the Minnesota Timberwolves on Thursday."}
{"game_id": "0021700403", "chunk_id": "0021700403_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
