{"game_id": "0021700742", "chunk_id": "0021700742_001", "order": 1, "role": "lead", "text": "DALLAS -- Hassan Whiteside had an impressive response after a long conversation with Eric Spoelstra, and the Miami Heat completed another season sweep of the Dallas Mavericks.\nWhiteside scored 25 points with 14 rebounds in the Heat's 95-88 victory Monday night, a day after the center and his coach spoke for about an hour.\n\"I sat on it, I slept on it, and I thought about it a whole lot,\" Whiteside said.\nAsked the gist of the conversation, Whiteside responded: \"Just different things and different challenges he had for me, both from what we've seen out there.\"\nThe Heat never trailed after Goran Dragic made a steal that led to Tyler Johnson's tiebreaking 3-pointer to make it 38-35 with just under 4 1/2 minutes left in the first half. Their lead went to double digits again after Whiteside had consecutive baskets midway through the third quarter.\n\"He had some great games like this where he's really put his fingerprints on the competition to impact winning,\" Spoelstra said. \"You felt his presence from the very get-go, and it's all now about the consistency night in and night out.\"\nThis is the 14th time in their 30 seasons that the Heat, who beat Dallas 113-101 at home on Dec. 22, have swept the regular-season series. These teams met twice in the NBA Finals, with Miami getting its first championship in 2006 and the Mavs winning their only title in 2011.\nHarrison Barnes had 20 points and Wesley Matthews 19 for the Mavericks (16-35), who have dropped four games in a row and seven of eight overall.\nMiami (29-21) led 51-41 when Josh Richardson hit a 3-pointer with 41 seconds left in the first half. But the Mavs trimmed that in half when rookie Dennis Smith Jr. made a defended buzzer-beating 3-pointer from about 27 feet to make it 51-46. James Johnson had a hand up in front of Smiths' face with Whiteside coming from the side.\nRichardson had 14 points for the Heat, while Dragic had 13 and Kelly Olynyk 12.\nSmith scored 14 for Dallas, and Dirk Nowitzki 10.\nTIP-INS\nHeat: Whiteside had his 18th double-double this season. ... For the second game in a row, Miami won to complete a season sweep. The Heat beat Charlotte on Saturday night to wrap up a four-game series sweep. ... The only team the Heat have swept more in the regular season is Sacramento at 15 times. Miami lost to the Kings already this season.\nMavericks: Nowitzki has played 49,941 career minutes, 59 shy of becoming the sixth player in NBA history with 50,000. Elvin Hayes played exactly 50,000 minutes, and former Mavericks guard Jason Kidd is fourth on the list at 50,111. \"It's a very staggering accomplishment and done with such grace and such little hype that it's probably very much taken for granted,\" coach Rick Carlisle said. ... G J.J. Barea missed his second straight game because of a left oblique strain. ... Devin Harris was back after missing four games because of a concussion and personal reasons. He was 1-of-7 shooting in 16 1/2 minutes.\nDOWN THE STRETCH\nThe Mavericks got within three in the final minute after being down 17 with six minutes to go. \"We have to play like that the whole game,\" Carlisle said. \"I am pretty upbeat about a lot of things, but I don't think you make a living in this league with moral victories, about, `Hey, we did some good things down the stretch.' It's not going to get you there.\"\nAs Barnes said, \"Look at the other 44 minutes, that's the biggest thing for us right now. ... We're showing that we can have these comebacks. But that's not the issue. It's what we're doing before that to put ourselves in that position.\"\nIN FRONT OF THE FOLKS\nRichardson's parents drove down from Oklahoma City to see the Heat and their son play. \"It's always dope to see them in the crowd, see your parents sitting there and cheering you on because it doesn't really happen as much in the NBA,\" Richardson said.\nUP NEXT\nMiami, which has three stops left on its four-game trip, plays Cleveland on Wednesday night.\nThe Mavericks hit the road for four games over nine nights, starting Wednesday at Phoenix.\n---\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball"}
