{"game_id": "0021300801", "chunk_id": "0021300801_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- Al Jefferson is happy he didn't make the All-Star game.\nKemba Walker said it might be a huge blessing for the Charlotte Bobcats that the big man got a few days off to rest his 29-year-old legs for the stretch run, particularly with four games in five nights coming out of the break.\n\"I'm glad he didn't make it either,\" Walker said with a laugh. \"He's fresh now. And you don't have to make the All-Star game to be an All-Star. I know he's a great player and unguardable in the post.\"\nJefferson dominated the Pistons for the third time this season Wednesday night, and Walker played his best game since returning from an ankle injury to lead the Bobcats to back-to-back wins over Detroit, 116-98. Jefferson scored 29 points, while Walker had 24 points and a career-high 16 assists.\nThe win gives the Bobcats (25-30) a sweep of the season three-game series and a 2 1/2-game lead over the Pistons in the race for the eighth playoff spot in the Eastern Conference.\n\"We had a bad reputation around this league for a long time, at least since I've been here,\" Walker said. \"Coach (Steve Clifford) has done a great job of changing the culture. We just want to win. We don't want to be those Bobcats where guys come in here and beat us up every night.\"\nThe 6-foot-10, 289-pound Jefferson, who had 32 points, 12 rebounds and seven assists in Tuesday's 108-96 win at Detroit, went 12 of 20 from the field and grabbed eight rebounds. He has scored at least 20 points in 16 of the last 18 games and barely missed his seventh 30-point game in the last 10 games.\nJefferson said the Bobcats (25-30) are playing their best basketball of the season as they gear up for the stretch run and a shot at the franchise's second career playoff appearance.\n\"We have been a top 10 on defense all year,\" Jefferson said. \"But now our offense is picking up and we're learning how to play with each other.\"\nFrustration seems to be setting in for the Pistons, who have lost nine of 14.\nBrandon Jennings had 20 points for Detroit before being ejected from the game with 1:13 left after picking up his second technical foul for arguing a call.\nJennings did not speak to the media after the game.\n\"We definitely have to do a better job as a team of keeping our composure, especially in tough games like this,\" teammate Greg Monroe said. \"Down the stretch these games mean a lot. You know, keeping a level head and playing hard, as a team is something we're going to have to do.\"\nCoach John Loyer said it's not too late to regroup.\n\"It's two games,\" Loyer said. \"Granted it's two that we wanted to get, two we needed to get, but we didn't get them. You move on. You figure out your next plan and you just try to go win the next game.\"\nJosh McRoberts chipped in with 15 points for the Bobcats and Ramon Sessions had 10 points and 10 assists off the bench.\nBut it's Jefferson who is setting the tone.\n\"We are just getting acclimated to Al,\" Walker said. \"It took a little while but we know how to play with him and play off him. He makes all the right plays. All we have to do is get him the basketball in the right spots all we have to do is make shots.\"\nThe Bobcats led by six at halftime, but opened the second half with a 17-3 tear to take a 70-50 lead behind 3-pointers from Walker, McRoberts and Gerald Henderson. The Pistons got within nine in the fourth quarter, but McRoberts buried a pair of 3-pointers and Walker hit a jumper to put the Bobcats safely ahead.\nLoyer stressed before the game the importance of starting fast, but Monroe and Josh Smith combined to miss their first 14 shots.\nMeanwhile the Bobcats got off to a fast start for the second straight night, hitting 7 of 9 shots to start the game and build a double-digit first quarter lead.\nCody Zeller brought immediate energy and production off the bench for the Bobcats with a career-high three blocked shots.\nGame notes\nFormer South Carolina Gamecocks defensive end and top NFL draft prospect Jadeveon Clowney attended the game. ... Charlotte had lost five straight games at home to Detroit prior to Wednesday night. ... The more aggressive Bobcats dominated on the boards, outrebounding the Pistons 49-31."}
