{"game_id": "0021700458", "chunk_id": "0021700458_001", "order": 1, "role": "lead", "text": "CHICAGO --  The Chicago Bulls' offense has exploded with Nikola Mirotic back in the lineup."}
{"game_id": "0021700458", "chunk_id": "0021700458_002", "order": 2, "role": "body", "text": "Denzel Valentine had 16 points and 10 rebounds, Mirotic had 15 points and 10 rebounds, and the Bulls beat the Orlando Magic 112-94 on Wednesday night for their seventh straight win."}
{"game_id": "0021700458", "chunk_id": "0021700458_003", "order": 3, "role": "body", "text": "Chicago had lost 10 straight without Mirotic prior to his return from a facial fracture Dec. 8 and hasn't lost since to improve to 10-20. Behind a season-high 31 assists, the Bulls matched their longest winning streak in three years and sent Orlando to a sixth straight loss."}
{"game_id": "0021700458", "chunk_id": "0021700458_004", "order": 4, "role": "body", "text": "Nikola Vucevic scored 18 points for the Magic."}
{"game_id": "0021700458", "chunk_id": "0021700458_005", "order": 5, "role": "body", "text": "\"We're improving the communication we didn't have before,\" said Mirotic, who missed the start of the season after teammate Bobby Portis punched him in October."}
{"game_id": "0021700458", "chunk_id": "0021700458_006", "order": 6, "role": "body", "text": "\"Offensively playing finally the way we have to play, scoring a lot of points and sharing the ball, especially on fast breaks. It's been a lot of fun.\""}
{"game_id": "0021700458", "chunk_id": "0021700458_007", "order": 7, "role": "body", "text": "The excitement began early for Chicago, which started on a 12-0 run. Facing the league's fourth-worst scoring defense, the Bulls' strong ball movement resulted in easy looks inside and out, and the team had assists on 10 of its first 15 shots."}
{"game_id": "0021700458", "chunk_id": "0021700458_008", "order": 8, "role": "body", "text": "Robin Lopez connected on his first four attempts for a team averaging 111.1 points per contest since Mirotic returned to the lineup -- up from 95.7 points in 23 games without the forward."}
{"game_id": "0021700458", "chunk_id": "0021700458_009", "order": 9, "role": "body", "text": "Chicago took a 30-point lead with 8:17 left in the fourth quarter -- its largest advantage of the season."}
{"game_id": "0021700458", "chunk_id": "0021700458_010", "order": 10, "role": "body", "text": "\"The start was key,\" Bulls coach Fred Hoiberg said. \"I was really pleased with the way the guys came out of the gate."}
{"game_id": "0021700458", "chunk_id": "0021700458_011", "order": 11, "role": "body", "text": "\"But the thing that pleases you most is the unselfishness.\""}
{"game_id": "0021700458", "chunk_id": "0021700458_012", "order": 12, "role": "body", "text": "Chicago had six players score in double figures, including Kris Dunn with 15 points and Portis with 14."}
{"game_id": "0021700458", "chunk_id": "0021700458_013", "order": 13, "role": "body", "text": "Injury-riddled Orlando, which played without leading scorers Evan Fournier and Aaron Gordon, struggled to keep pace. The Magic shot only 39 percent, including 5-of-27 on 3-point tries, en route to their 17th loss in 20 games."}
{"game_id": "0021700458", "chunk_id": "0021700458_014", "order": 14, "role": "body", "text": "\"We've got to play really above ourselves right now to get a win,\" Orlando coach Frank Vogel said. \"We didn't play a great basketball game and the result is what it is.\""}
{"game_id": "0021700458", "chunk_id": "0021700458_016", "order": 16, "role": "body", "text": "Magic: Fournier and Gordon were out of action yet again. Each is tied for the team lead with an 18.3-point per game average. Fournier missed his sixth straight game with a sprained right ankle while Gordon didn't play for the fourth time in five contests because of a right calf strain. Guard Terrance Ross missed a 10th straight game due to a sprained right knee."}
{"game_id": "0021700458", "chunk_id": "0021700458_017", "order": 17, "role": "body", "text": "Bulls: Guard Zach LaVine, who is rehabbing from a February surgery to repair a torn ACL in his left knee, has been held out of several practices due to back spasms but should return soon. \"Zach's doing great,\" Hoiberg said. \"He's back to really feeling good again and, hopefully, we'll get him back on the practice court whenever our next practice is.\""}
{"game_id": "0021700458", "chunk_id": "0021700458_019", "order": 19, "role": "body", "text": "Already short-handed, Orlando only got 13:50 of playing time from guard Jonathan Isaac before he re-injured a right ankle that previously kept him out of action for 17 games. Isaac, who averages 5.7 points per game, just returned in Sunday's loss at Detroit."}
{"game_id": "0021700458", "chunk_id": "0021700458_020", "order": 20, "role": "body", "text": "\"Hopefully, it's not too bad,\" Vogel said. \"X-rays were negative and we'll see how he is tomorrow.\""}
{"game_id": "0021700458", "chunk_id": "0021700458_022", "order": 22, "role": "body", "text": "Chicago's seventh straight win is the longest-active winning streak in the Eastern Conference and is the best for the franchise since it rolled off seven in a row from Dec. 18-27, 2014."}
{"game_id": "0021700458", "chunk_id": "0021700458_023", "order": 23, "role": "body", "text": "\"We lost 10 straight,\" Portis said. \"We had a chip on our shoulder. We were so close to winning some of the games, we lost by one and two. We kind of found a way to start winning those games down the stretch.\""}
{"game_id": "0021700458", "chunk_id": "0021700458_025", "order": 25, "role": "body", "text": "Magic: Hosts New Orleans on Friday night."}
{"game_id": "0021700458", "chunk_id": "0021700458_026", "order": 26, "role": "body", "text": "Bulls: At Cleveland on Thursday night."}
{"game_id": "0021700458", "chunk_id": "0021700458_028", "order": 28, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
