{"game_id": "0021201012", "chunk_id": "0021201012_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- Marc Gasol and the Memphis Grizzlies finally put away Oklahoma City with their final shot."}
{"game_id": "0021201012", "chunk_id": "0021201012_002", "order": 2, "role": "body", "text": "In a matchup of Western Conference contenders that had a playoff feel to it, Gasol tipped in Zach Randolph's miss with less than a second left in overtime Wednesday night to give Memphis a 90-89 win over the Thunder."}
{"game_id": "0021201012", "chunk_id": "0021201012_003", "order": 3, "role": "body", "text": "Gasol was so excited about the winning basket that he dropped a not-suitable-for-television expletive in the live postgame interview."}
{"game_id": "0021201012", "chunk_id": "0021201012_004", "order": 4, "role": "body", "text": "\"I saw Zach going baseline and just went for the rebound and got lucky with the tip,\" Gasol said. \"It's an emotional game. It's a team that we like playing against, and a team that knows us very well. It was a gritty game.\""}
{"game_id": "0021201012", "chunk_id": "0021201012_005", "order": 5, "role": "body", "text": "The excitement carried over into the Grizzlies' locker room, from which whoops and hollers could be heard in the hallway."}
{"game_id": "0021201012", "chunk_id": "0021201012_006", "order": 6, "role": "body", "text": "Gasol would have never had a chance at the winning tip if not for Jerryd Bayless connecting on a 3-pointer from the top of the key for Memphis with 3.7 seconds left in regulation to send the teams into overtime tied at 83. Bayless scored 10 of his 20 points in the fourth quarter."}
{"game_id": "0021201012", "chunk_id": "0021201012_007", "order": 7, "role": "body", "text": "After Gasol's tip put the Grizzlies ahead with 0.9 seconds left, Russell Westbrook's desperation shot from past half court was off the mark and Memphis walked away with its 16th victory in 19 games."}
{"game_id": "0021201012", "chunk_id": "0021201012_008", "order": 8, "role": "body", "text": "\"We win in a variety of ways. It's never pretty,\" said Mike Conley, who led the Grizzlies with a season-high 24 points. \"That's that grit-and-grind motto right there. We just find a way to win however it is. (This) was one of those wins.\""}
{"game_id": "0021201012", "chunk_id": "0021201012_009", "order": 9, "role": "body", "text": "Randolph added 15 points and 18 rebounds, giving him 7,001 career rebounds, while Gasol had 14 points and 15 rebounds."}
{"game_id": "0021201012", "chunk_id": "0021201012_010", "order": 10, "role": "body", "text": "Kevin Durant led the Thunder with 32 points, including 15 in the third quarter to help Oklahoma City take its first lead. Westbrook scored 20 on 7-of-25 shooting from the field. Kevin Martin added 17 points, but no other Thunder player had more than seven."}
{"game_id": "0021201012", "chunk_id": "0021201012_011", "order": 11, "role": "body", "text": "\"It was just one of those games, probably 10 of them a year, where nobody deserves to lose the game, but we were on the bad side of that,\" Thunder coach Scott Brooks said."}
{"game_id": "0021201012", "chunk_id": "0021201012_012", "order": 12, "role": "body", "text": "Oklahoma City, coming off a 114-110 loss to Denver on Tuesday, scored the first two points in overtime on a pair of free throws from Thabo Sefolosha. Memphis then scored five straight, including three from Gasol. The other points came on a tip-in by Tony Allen with 2:42 left. Officials initially ruled basket interference on Allen but gave him the points after a replay review showed the ball was outside the cylinder."}
{"game_id": "0021201012", "chunk_id": "0021201012_013", "order": 13, "role": "body", "text": "The Thunder answered the Memphis push with a 6-footer in the lane from Durant and a layup by Westbrook with 13.6 seconds left for an 89-88 lead."}
{"game_id": "0021201012", "chunk_id": "0021201012_014", "order": 14, "role": "body", "text": "That set the stage for Gasol's final tip-in when Randolph missed a 7-footer."}
{"game_id": "0021201012", "chunk_id": "0021201012_015", "order": 15, "role": "body", "text": "\"I don't think it was anything defensively,\" Westbrook said of the final play. \"They got a tip-in, and, unfortunately, it was (less than a second) on the clock.\""}
{"game_id": "0021201012", "chunk_id": "0021201012_016", "order": 16, "role": "body", "text": "\"We had chances to win, to fight back, the whole game,\" Durant said, later adding: \"They hit a big shot. Two big shots.\""}
{"game_id": "0021201012", "chunk_id": "0021201012_017", "order": 17, "role": "body", "text": "The teams have been rivals since the second round of the Western Conference playoffs two seasons ago, when the Thunder dispatched Memphis in seven games, including a triple-overtime win at FedExForum."}
{"game_id": "0021201012", "chunk_id": "0021201012_018", "order": 18, "role": "body", "text": "\"It reminded me a lot of the triple-overtime game,\" Conley said of the intensity. \"Guys were hitting big shots back and forth, having different guys step up. The intensity, the crowd, all of that. It had the same kind of atmosphere. It came down to the end, and we got the win.\""}
{"game_id": "0021201012", "chunk_id": "0021201012_019", "order": 19, "role": "body", "text": "The game featured physical play, disputed calls and technicals. Westbrook got a technical early for griping; Randolph got one late in the fourth when he thought he was fouled under the Memphis basket."}
{"game_id": "0021201012", "chunk_id": "0021201012_020", "order": 20, "role": "body", "text": "The physical play was coupled with defensive pressure that resulted in low shooting percentages. The Thunder ended the night at a season-low 35.7 percent from the field, while Memphis managed to shoot only slightly better at 36 percent. Oklahoma City, which entered the game as one of the NBA's best 3-point shooting teams at 38.3 percent, managed only 2-of-18 shooting from outside the arc."}
{"game_id": "0021201012", "chunk_id": "0021201012_021", "order": 21, "role": "body", "text": "\"Both teams played extremely hard and physical, and you can tell,\" Brooks said. \"It was hard to get baskets; it was hard to get on offense.\""}
{"game_id": "0021201012", "chunk_id": "0021201012_022", "order": 22, "role": "body", "text": "There were four ties and 14 lead changes in the game."}
{"game_id": "0021201012", "chunk_id": "0021201012_023", "order": 23, "role": "body", "text": "The Grizzlies maintained their hold on third place in the Western Conference standings and pulled within three games of the Thunder for second."}
{"game_id": "0021201012", "chunk_id": "0021201012_024", "order": 24, "role": "body", "text": "Once Oklahoma City caught Memphis behind Durant's shooting late in the third quarter, the teams exchanged leads throughout the fourth, eventually leaving them deadlocked at the end of regulation."}
{"game_id": "0021201012", "chunk_id": "0021201012_025", "order": 25, "role": "body", "text": "\"It is a good matchup,\" Westbrook said of the rivalry. \"It was physical. It's intense. It was a playoff atmosphere. Unfortunately, we couldn't win.\""}
{"game_id": "0021201012", "chunk_id": "0021201012_026", "order": 26, "role": "body", "text": "Memphis shot well early to build a 10-point lead in the first half before carrying a 44-38 lead into halftime."}
{"game_id": "0021201012", "chunk_id": "0021201012_027", "order": 27, "role": "body", "text": "Durant and Martin had 10 points apiece at the break. Randolph had 12 for Memphis."}
{"game_id": "0021201012", "chunk_id": "0021201012_028", "order": 28, "role": "body", "text": "The defensive intensity continued through the early stages of the third period as the teams were a combined 4-of-22 through the first 6 minutes."}
{"game_id": "0021201012", "chunk_id": "0021201012_029", "order": 29, "role": "body", "text": "But the Thunder kept cutting into the lead as Durant took over offensively, scoring 15 in the quarter, including 13 straight points for the Thunder, eventually giving Oklahoma City its first lead at 57-56 late in the third."}
{"game_id": "0021201012", "chunk_id": "0021201012_030", "order": 30, "role": "body", "text": "Two free throws from Gasol gave Memphis the lead back at 58-57 entering the fourth."}
{"game_id": "0021201012", "chunk_id": "0021201012_031", "order": 31, "role": "body", "text": "\"I knew when we were not making shots early in the game, we would keep fighting, playing aggressive and give ourselves a chance to win,\" Brooks said. \"That's what we've done for a lot of years now, and that is not going to change.\""}
{"game_id": "0021201012", "chunk_id": "0021201012_032", "order": 32, "role": "closing", "text": "Game notes Thunder F Serge Ibaka played after taking some stitches in his head against Denver on Tuesday night. ... Memphis F Darrell Arthur missed his ninth straight game with neck and back soreness. ... The Grizzlies won the season series 2-1. ... Oklahoma City scored 15 points in the first quarter, a season low for the opening period. ... Memphis has lost only once in five overtime games. The Thunder dropped to 4-2. ... Oklahoma City had a season-low nine assists. The Grizzlies matched their season low with 11 assists."}
