{"game_id": "0021200148", "chunk_id": "0021200148_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Ramon Sessions wanted another chance to prove he had some ice left in his veins. He got that chance Monday night and took advantage of it."}
{"game_id": "0021200148", "chunk_id": "0021200148_002", "order": 2, "role": "body", "text": "Sessions scored nine of his 23 points in the fourth quarter, including a pair of free throws with 4.2 seconds left to seal the game, and the Charlotte Bobcats beat the Milwaukee Bucks 102-98."}
{"game_id": "0021200148", "chunk_id": "0021200148_003", "order": 3, "role": "body", "text": "The Bobcats trailed by 11 in the fourth but battled back, going 16 of 16 from the free throw line down the stretch."}
{"game_id": "0021200148", "chunk_id": "0021200148_004", "order": 4, "role": "body", "text": "Sessions' two free throws came after Monta Ellis missed a 3-point attempt with 5.9 seconds remaining, sending the Bucks to their first road loss of the season and lifting the surprising Bobcats (5-4) back above .500."}
{"game_id": "0021200148", "chunk_id": "0021200148_005", "order": 5, "role": "body", "text": "Sessions was 10 of 10 from the foul line and the Bobcats shot 90 percent (27 of 30) for the game."}
{"game_id": "0021200148", "chunk_id": "0021200148_006", "order": 6, "role": "body", "text": "Sessions missed two key free throws last week against Minnesota in the game's final seconds and the Bobcats needed a jumper from Kemba Walker with 0.7 seconds left to pull off an 89-87 win."}
{"game_id": "0021200148", "chunk_id": "0021200148_007", "order": 7, "role": "body", "text": "\"When I missed those two I wanted the chance to redeem myself,\" Sessions said. \"It's one of those things that comes around and I had to take advantage of it.\""}
{"game_id": "0021200148", "chunk_id": "0021200148_008", "order": 8, "role": "body", "text": "Walker and Byron Mullens each scored 19 points for the Bobcats, while rookie Michael Kidd-Gilchrist turned in another solid effort with 15 points and nine rebounds."}
{"game_id": "0021200148", "chunk_id": "0021200148_009", "order": 9, "role": "body", "text": "Ellis scored 31 points for the Bucks (6-3). Mike Dunleavy scored 16 points and Brandon Jennings was held to 10 points on 5-of-18 shooting."}
{"game_id": "0021200148", "chunk_id": "0021200148_010", "order": 10, "role": "body", "text": "The Bucks never led by more than four until the fourth quarter when Ellis began to turn it up a notch, scoring six quick points to help put Milwaukee up 11."}
{"game_id": "0021200148", "chunk_id": "0021200148_011", "order": 11, "role": "body", "text": "But the young Bobcats rallied."}
{"game_id": "0021200148", "chunk_id": "0021200148_012", "order": 12, "role": "body", "text": "Sessions hit a long 3-pointer to tie the game at 96 off a pretty feed from Mullens and Kidd-Gilchrist added two free throws to give the Bobcats the lead with 2:01 to go."}
{"game_id": "0021200148", "chunk_id": "0021200148_013", "order": 13, "role": "body", "text": "Trailing by two with under a minute to play, Samuel Dalembert missed badly on an awkward looking 13-footer off a pick and roll. Dalembert later called it an \"indecisive\" play."}
{"game_id": "0021200148", "chunk_id": "0021200148_014", "order": 14, "role": "body", "text": "\"I was about to go and drive, but when I saw a man coming I decided to shoot,\" Dalembert said."}
{"game_id": "0021200148", "chunk_id": "0021200148_015", "order": 15, "role": "body", "text": "The Bobcats had a chance to build on the lead, but couldn't get into an offensive play and Sessions turned the ball over at the top of the key with 19 seconds left. The Bucks had a chance to win it, but Ellis missed a 3-pointer from the left wing."}
{"game_id": "0021200148", "chunk_id": "0021200148_016", "order": 16, "role": "body", "text": "Charlotte is coming off the worst season in NBA history, finishing 7-59 while losing their final 23 games. It took the Bobcats 36 games last season before they won their fifth game, but this year's team looks nothing like last year's -- playing hard, physical basketball under new coach Mike Dunlap."}
{"game_id": "0021200148", "chunk_id": "0021200148_017", "order": 17, "role": "body", "text": "Charlotte came into the game in the top 10 in the NBA both in steals and blocks, one of only three teams with that distinction."}
{"game_id": "0021200148", "chunk_id": "0021200148_018", "order": 18, "role": "body", "text": "\"The one they're doing is really playing hard,\" Dunleavy said. \"They compete every night and they're not going to roll over. When you do that in this league you're going to win more than seven games. They're going to blow that mark away this year obviously. They're headed in the right direction.\""}
{"game_id": "0021200148", "chunk_id": "0021200148_019", "order": 19, "role": "body", "text": "Still Dalembert said the Bucks missed a golden opportunity to get a win."}
{"game_id": "0021200148", "chunk_id": "0021200148_020", "order": 20, "role": "body", "text": "\"No disrespect to Charlotte, but those are the games that we should be winning,\" Dalembert said."}
{"game_id": "0021200148", "chunk_id": "0021200148_021", "order": 21, "role": "body", "text": "But Bucks coach Scott Skiles said it's tough to win in the NBA when you're not focused."}
{"game_id": "0021200148", "chunk_id": "0021200148_022", "order": 22, "role": "body", "text": "\"I don't want to short-change their win. They deserved to win the game,\" Skiles said. \"... But our whole approach tonight was not good. We had great difficulty remembering plays and we were just mentally kind of out of it.\""}
{"game_id": "0021200148", "chunk_id": "0021200148_023", "order": 23, "role": "body", "text": "The Bobcats shot 53.5 percent from the field in the first half to take a 55-54 lead at the break."}
{"game_id": "0021200148", "chunk_id": "0021200148_024", "order": 24, "role": "body", "text": "Walker was on fire early, hitting 6 of 6 shots from the field in a 15-point first half, marking the ninth straight game he's reached double digits."}
{"game_id": "0021200148", "chunk_id": "0021200148_025", "order": 25, "role": "body", "text": "Charlotte is now 4-0 on games decided by four points or less."}
{"game_id": "0021200148", "chunk_id": "0021200148_026", "order": 26, "role": "body", "text": "\"There's nothing like a win to give us confidence to put another page in the blueprint on how to close games out,\" Dunlap said. \"We've had a lot of close games and won most of them. So that's a good sign for a young team.\""}
{"game_id": "0021200148", "chunk_id": "0021200148_027", "order": 27, "role": "closing", "text": "Game notes The Bobcats announced before the game that F Tyrus Thomas is expected to miss approximately two months with a torn muscle in his lower left leg. An MRI revealed a second-degree strain of his left calf muscle and a tear of the plantaris muscle, a smaller muscle that assists the calf in flexing the ankle. ... Charlotte's Ben Gordon left the game in the second half with a right knee contusion. ... Dunleavy had a season-high four blocked shots for the Bucks."}
