{"game_id": "0021700072", "chunk_id": "0021700072_001", "order": 1, "role": "lead", "text": "ATLANTA -- Denver paid big money to pry Paul Millsap from Atlanta because the Nuggets knew he'd be a trustworthy scorer in the clutch.\nMillsap provided a perfectly timed reminder in his Atlanta homecoming.\nMillsap scored seven of his 16 points in the fourth quarter, Nikola Jokic recorded a double-double with 18 points and 15 rebounds, and Denver beat Atlanta 105-100 on Friday night in the Hawks' home opener.\n\"When the game is in the balance in that fourth quarter, that's what your $30 million-a-year man has to do,\" Denver coach Michael Malone said of Millsap. \"This guy steps up and makes plays.\"\nMillsap was a four-time All-Star for the Hawks before signing a three-year, $90 million deal with Denver.\nMillsap helped Denver protect a close lead by scoring on layups in back-to-back possessions with less than four minutes remaining. He added another basket and free throw as Denver blocked Atlanta's comeback attempt.\nFollowing the game, Hawks forward Taurean Prince hugged Millsap and told him he appreciated Millsap's help in his career.\n\"I almost broke down in tears,\" Millsap said. \"It means a lot.\n\"I had a lot of memories. It's a great city. There's a lot of great people here.\"\nThe Hawks gave Millsap a video tribute during a first-quarter timeout. Millsap smiled and waved to cheering fans.\n\"He's a great player,\" Hawks coach Mike Budenholzer said after the game. \"A ton of respect for him and what he does. He makes winning plays.\"\nWill Barton and Gary Harris each scored 18 points, and Emmanuel Mudiay had 16 for Denver (2-3). It was the Nuggets' first win in Atlanta in six years.\nJokic, the third-year center from Serbia, helped Denver overcome Atlanta's 14 3-pointers.\nDennis Schroder, back in the lineup after missing two games with a sprained left ankle, led Atlanta with 20 points. Schroder's steal and layup cut Denver's lead to 101-98 with 1:22 remaining. Jokic answered with a jumper.\nPrince had 19 points, and Dewayne Dedmon had 13 points and 10 rebounds for Atlanta.\nTIP-INS\nNuggets: Denver's last win in Atlanta was March 16, 2011. ... Malone said he didn't worry about Millsap controlling his emotions in his Atlanta homecoming. \"I respect Paul's experiences and his maturity as a veteran,\" Malone said. \"He knows how to hold his own emotions.\" ... Jamal Murray was initially credited with making a 3-pointer from the corner before the buzzer sounded to end the first quarter. Following a video review, officials ruled time expired before the shot. ... Jokic has recorded double-doubles in back-to-back games, his first two of the season.\nHawks: Marco Belinelli made five 3s for 15 points. ... A huge \"Coming Soon\" banner covered what was a wall of luxury suites as the $192.5 million renovation of Philips Arena, which began this offseason, is scheduled to be completed following the season. Capacity is down from 18,047 to 15,711 for this season. ... The scoreboards did not work for much of the third quarter. ... Ersan Ilyasova had seven points after missing two games with a left knee strain.\nSTREAKING\nThe Hawks (1-5) have lost five straight since opening the season with a win at Dallas.\n\"We're battling,\" said Kent Bazemore, who had seven points. \"It's tough. ... The guys are fighting, trying to make the right plays, and we're growing. That's the encouraging thing.\"\nSECOND-CHANCE POINTS\nThe Hawks made 8 of 17 3-point attempts in the first half and 14-of-33 for the game. The Nuggets made only 4-of-20 from 3.\nDenver countered with a 16-8 advantage in second-chance points in the first half and a 24-13 advantage for the game.\nUP NEXT\nNuggets: Visit the Brooklyn Nets on Sunday night as Denver continues its four-game trip.\nHawks: Host Milwaukee on Sunday afternoon.\n---\nMore AP NBA coverage: https://apnews.com/tag/NBAbasketball"}
