{"game_id": "0021400952", "chunk_id": "0021400952_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- DeMarcus Cousins opened the door to the standup cooler in the locker room and tried to stuff as much of his 6-foot-11, 270-pound body as he could inside to cool down.\nPerhaps he was still hot from the fourth quarter.\nCousins was 4 for 4 from the field in the period and finished with 20 points and 14 rebounds, helping the Sacramento Kings snap a four-game losing streak with a 113-106 victory over the Charlotte Hornets on Wednesday night.\nHe got plenty of help from Ben McLemore, who scored 27 points, and Rudy Gay, who added 26, including several big shots down the stretch.\n\"We made some good plays down the stretch,\" Cousins said. \"We did a good job of reading their defense and making plays.\"\nCousins and Gay combined for 18 points on 6-of-6 shooting in the fourth quarter to squash the Hornets' comeback bid.\n\"When Ben is clicking, myself and Rudy, we're a good team,\" Cousins said.\nMcLemore shot 10 of 16.\n\"He was making some jump shots and ran the court pretty well,\" coach George Karl said. \"He has been getting some good looks but has been hitting the front of the rim. He's working on his game, the confidence is coming and tonight he was a guy who I couldn't take off the floor.\"\nThe loss proved costly to the Hornets -- and not just because they entered the night clinging to the eighth-best record in the Eastern Conference.\nJust as Charlotte was getting one star player back, another left with an injury.\nKemba Walker had six points in 16 minutes off the bench after missing 18 games following knee surgery, but Charlotte lost center Al Jefferson to a strained right calf late in the third quarter. Jefferson will be evaluated on a day-by-day basis.\n\"He heard something pop, so that's obviously concerning,\" Hornets coach Steve Clifford said.\nMichael Kidd-Gilchrist had 23 points on 9-of-12 shooting for the Hornets, who have lost back-to-back games at home. Mo Williams added 20 points and eight assists, and Gerald Henderson had 17 points and a career-high 11 assists for Charlotte.\nBut Clifford ripped into his team after the game.\n\"If we're going to play like this, forget the playoffs,\" Clifford said. \"We can't win like this. We can't win like this. You've got to know who you are and play to your game.\"\nThe Kings took control with about 5 minutes remaining in the game.\nWith Sacramento leading by one, Cousins made a pair of free throws and then knocked down a 6-footer and drew a foul to complete a three-point play. Cousins followed with an alley-oop dunk from Andre Miller to put the Kings up by 102-94 with 3:21 left.\nEvery time the Hornets tried to make a run, Cousins or Gay seemed to have an answer.\nCousins hit a 20-footer to push the lead back to four with a minute to go.\nAfter Charlotte cut the lead back to two, Gay drove the lane and drew a foul on Kidd-Gilchrist and scored, giving the Kings a 109-104 lead with 46 seconds left. And when Henderson scored on a driving layup, Gay answered by drilling a 21-footer over Henderson as the shot clock expired to push the lead back to five, essentially sealing the win.\n---\nTIP-INS\nKings: Cousins has scored in double digits in all 49 games he's played this season. ... Improved to 2-4 on their current eight-game road trip.\nHornets: Forward Cody Zeller missed the game with a shoulder injury and is also expected to sit out Friday night against the Bulls. ... Walker said he felt \"confident\" in his knee after the game and hopes to see more minutes moving forward.\nI'M NOT LEAVING\nA woman sitting behind the Hornets bench suffered a bloody nose when the ball hit her directly in the face off a tipped pass, knocking the glasses off her head. She needed a few tissues to stop the bleeding, but was a trooper and stayed in her seat to watch the rest of the game. Replays showed she was talking to the person next her as the play was developing and was unaware of the ball coming her way.\nUP NEXT\nKings: At Philadelphia on Friday night.\nHornets: Host Chicago on Friday night."}
