{"game_id": "0021700542", "chunk_id": "0021700542_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  Clippers guard Lou Williams was trouble for the Charlotte Hornets from the moment he left the bench, making his first four shots, including three 3-pointers, and scoring 11 points before he was on the floor four minutes."}
{"game_id": "0021700542", "chunk_id": "0021700542_002", "order": 2, "role": "body", "text": "Williams went on to score 40 points to lead Los Angeles to a 106-98 victory Sunday."}
{"game_id": "0021700542", "chunk_id": "0021700542_003", "order": 3, "role": "body", "text": "\"I always feel like I can get it going, but to see it early, it puts me in a different mindset, in an attack mode,\" Williams said. \"Once I get two or three early, that way I can just get everybody else involved.\""}
{"game_id": "0021700542", "chunk_id": "0021700542_004", "order": 4, "role": "body", "text": "In an offensive struggle for both teams, the Clippers outshot the Hornets 47 percent to 39 percent to win for the fifth time in six games."}
{"game_id": "0021700542", "chunk_id": "0021700542_005", "order": 5, "role": "body", "text": "\"We've gone through a lot this season with injuries,\" Clippers coach Doc Rivers said. \"I just love coaching this team, though. This team is a resilient team, they're tough-minded, they're very close and they grind out games.\""}
{"game_id": "0021700542", "chunk_id": "0021700542_006", "order": 6, "role": "body", "text": "Blake Griffin added 25 points in his second game back after missing 14 with a left MCL strain."}
{"game_id": "0021700542", "chunk_id": "0021700542_007", "order": 7, "role": "body", "text": "\"I play pretty well with Blake, especially in the two-man game, closing out quarters, closing out games,\" Williams said. \"We have good chemistry together.\""}
{"game_id": "0021700542", "chunk_id": "0021700542_008", "order": 8, "role": "body", "text": "DeAndre Jordan grabbed 15 rebounds to help the Clippers win their fifth in a row at home. The biggest surprise was Jordan, a career 44 percent free throw shooter, going 6 for 6 from the foul line."}
{"game_id": "0021700542", "chunk_id": "0021700542_009", "order": 9, "role": "body", "text": "\"I've really been working on the shot, obviously,\" Jordan said. \"And tonight I was just trying to shoot the ball the same way. My teammates gave me a lot of confidence.'"}
{"game_id": "0021700542", "chunk_id": "0021700542_010", "order": 10, "role": "body", "text": "Kemba Walker scored 30 points for the Hornets. They fell to 3-13 on the road."}
{"game_id": "0021700542", "chunk_id": "0021700542_011", "order": 11, "role": "body", "text": "\"Kemba was ready,\" acting Hornets coach Stephen Silas said. \"That happens in these 4 o'clock games. It's out of their routine and sometimes they come out flat. Not Kemba. He was Mr. Reliable.\""}
{"game_id": "0021700542", "chunk_id": "0021700542_012", "order": 12, "role": "body", "text": "Frank Kaminsky added 16 points and Dwight Howard had 10 rebounds for Charlotte, but was 1 for 9 from the field and had only four points."}
{"game_id": "0021700542", "chunk_id": "0021700542_013", "order": 13, "role": "body", "text": "The Clippers led 100-92 before Walker made back-to-back 3-pointers to pull Charlotte ton 102-98 with 49 seconds left. Griffin made two free throws with 43 seconds remaining, and Nicolas Batum missed a 3-pointer."}
{"game_id": "0021700542", "chunk_id": "0021700542_014", "order": 14, "role": "body", "text": "Williams clinched the victory with a driving layup for the final margin."}
{"game_id": "0021700542", "chunk_id": "0021700542_015", "order": 15, "role": "body", "text": "\"I was just playing with confidence,\" Williams said. \"I was able to get off to a good start, make your first few shots, and it just goes up from there.\""}
{"game_id": "0021700542", "chunk_id": "0021700542_016", "order": 16, "role": "body", "text": "Down by 14 points in the second quarter, the Clippers regained control by outscoring Charlotte 27-9, taking a 69-61 lead on a driving layup by Juwan Evans with 1:30 left in the third quarter. Griffin scored 12 points during the stretch."}
{"game_id": "0021700542", "chunk_id": "0021700542_018", "order": 18, "role": "body", "text": "Austin Rivers, who left Friday night's game against the Lakers on crutches, sat out against the Hornets with a sore right Achilles tendon. Results of an MRI taken Saturday revealed no soft tissue injury or structural damage. Coach Doc Rivers said Austin \"could play\" in the Clippers' next game Tuesday night against Memphis."}
{"game_id": "0021700542", "chunk_id": "0021700542_019", "order": 19, "role": "body", "text": "\"He's good,\" Doc Rivers said about son Austin. \"When you hear the word `Achilles' you never think anything positive, especially the way it looked. I thought (the injury) scared him, and that probably scared us.\""}
{"game_id": "0021700542", "chunk_id": "0021700542_021", "order": 21, "role": "body", "text": "The Hornets went against the Clippers coming off their best performance of the season, a surprise 111-100 road victory two nights earlier over the Golden State Warriors, only their third road victory of the season."}
{"game_id": "0021700542", "chunk_id": "0021700542_022", "order": 22, "role": "body", "text": "\"We talked about the fact it was Golden State. They're the best team, and it's easy to get up for them,\" Silas said. \"But we have to be in that mindset every game, especially in the position we're in. Not just having a Golden State attitude, we're looking to have an attitude about the way we play on the road.\""}
{"game_id": "0021700542", "chunk_id": "0021700542_024", "order": 24, "role": "body", "text": "Hornets: With the second unit leading the way, Charlotte outscored the Clippers 28-7 over the first 10 minutes of the second quarter, turning a 29-22 first-quarter deficit into a 50-36 lead on Walker's 15-footer with 1:56 left in the half. 42 halftime lead. The Hornets held the Clippers to 2-of-15 from the field during the stretch."}
{"game_id": "0021700542", "chunk_id": "0021700542_025", "order": 25, "role": "body", "text": "Clippers: After a dismal second quarter, the Clippers got back in the game by holding Charlotte to a single field goal over the first 6:18 of the third quarter, and continuing on a 27-9 run for a 69-61 lead. Their offensive highlight came with 6:40 left in the third quarter when Blake Griffin broke free for a driving, right-handed dunk that brought the crowd to its feet."}
{"game_id": "0021700542", "chunk_id": "0021700542_027", "order": 27, "role": "body", "text": "Hornets: At Sacramento on Tuesday night."}
{"game_id": "0021700542", "chunk_id": "0021700542_028", "order": 28, "role": "closing", "text": "Clippers: Host Memphis on Tuesday night."}
