{"game_id": "0021700527", "chunk_id": "0021700527_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  Phoenix coach Jay Triano's decision to move Devin Booker to point guard late in the fourth quarter worked out perfectly for the struggling Suns."}
{"game_id": "0021700527", "chunk_id": "0021700527_002", "order": 2, "role": "body", "text": "A big night from T.J. Warren helped too, especially when Booker's own shot was off most of the game."}
{"game_id": "0021700527", "chunk_id": "0021700527_003", "order": 3, "role": "body", "text": "Booker scored 13 of his 26 points over the final five minutes, Warren added a double-double and Phoenix came back to beat the Sacramento Kings 111-101 on Friday night."}
{"game_id": "0021700527", "chunk_id": "0021700527_004", "order": 4, "role": "body", "text": "Booker missed nine games with a left adductor strain before returning to score 32 against Memphis on Tuesday. He wasn't as crisp against the Kings, shooting 9 of 25 from the field, but helped rally the Suns with his late scoring flurry that keyed a 17-4 run."}
{"game_id": "0021700527", "chunk_id": "0021700527_005", "order": 5, "role": "body", "text": "\"Both of us are just natural scorers but in different ways,\" Booker said of he and Warren. \"Teams usually have one really good defender and sometimes they put it on me, sometimes they put it on him, and the other player gets to attack. It's a good 1-2 punch.\""}
{"game_id": "0021700527", "chunk_id": "0021700527_006", "order": 6, "role": "body", "text": "Warren had 26 points and 10 rebounds, Marquese Chriss added 14 points and seven rebounds while Tyson Chandler had six points and 11 rebounds for the Suns."}
{"game_id": "0021700527", "chunk_id": "0021700527_007", "order": 7, "role": "body", "text": "Triano said he put Booker at point guard to free him up more in Phoenix's offense."}
{"game_id": "0021700527", "chunk_id": "0021700527_008", "order": 8, "role": "body", "text": "\"I think he's going to take over anyway, and we want him to do that,\" Triano said. \"The idea is to put shooters around him and you could see how much space there was on the floor when (Troy Daniels) is on the floor and T.J.'s scoring the way that he was.\""}
{"game_id": "0021700527", "chunk_id": "0021700527_009", "order": 9, "role": "body", "text": "Phoenix led most of the game but fell behind early in the fourth after Sacramento scored nine consecutive points to go up 97-93."}
{"game_id": "0021700527", "chunk_id": "0021700527_010", "order": 10, "role": "body", "text": "Booker brought the Suns back and scored the final seven points for Phoenix, including a layup past 7-footer Willie Cauley-Stein, a buzzer-beating 15-footer and a 3-pointer."}
{"game_id": "0021700527", "chunk_id": "0021700527_011", "order": 11, "role": "body", "text": "\"He's a special player,\" Chandler said. \"You can see it. Just some players that come into this league that just have it. They're far and few in between, and he's one of those players.\""}
{"game_id": "0021700527", "chunk_id": "0021700527_012", "order": 12, "role": "body", "text": "Zach Randolph scored 14 points, Bogdan Bogdanovic had 13 and four others scored 12 apiece for the Kings."}
{"game_id": "0021700527", "chunk_id": "0021700527_013", "order": 13, "role": "body", "text": "Sacramento, which beat Cleveland 109-95 on Wednesday, fell to 2-22 when trailing after three quarters."}
{"game_id": "0021700527", "chunk_id": "0021700527_014", "order": 14, "role": "body", "text": "Phoenix closed the first quarter on a 14-2 run and Warren scored six consecutive points in the second to help the Suns to a 55-46 halftime lead. Warren made his first six shots and had 15 points in the first half."}
{"game_id": "0021700527", "chunk_id": "0021700527_015", "order": 15, "role": "body", "text": "\"I'm really impressed with T.J.'s game,\" Kings coach Dave Joerger said. \"He picks his spots out on the court and says, `I'm just bigger than you,\" and then he shoots up over the top.\""}
{"game_id": "0021700527", "chunk_id": "0021700527_016", "order": 16, "role": "body", "text": "After Sacramento closed within 71-68 on Hill's two free throws midway through the third, Isaiah Canaan hit a 3-pointer and scored on a layup, and Troy Daniels added a 3 to push Phoenix's lead to 10."}
{"game_id": "0021700527", "chunk_id": "0021700527_018", "order": 18, "role": "body", "text": "Randolph scored 11 points in the fourth quarter to rally Sacramento past Phoenix when the two teams played at Golden1 Center on Dec. 12 but was shut out over the final 12 minutes this time around while being defended most of the night by Chriss. \"Zach is a beast and we know that,\" Triano said. \"We need to make him work for every single touch, and Marquese did that.\""}
{"game_id": "0021700527", "chunk_id": "0021700527_020", "order": 20, "role": "body", "text": "Suns: Chriss, the Sacramento native who was drafted eighth overall by the Kings in 2016 and traded that night to Phoenix, shot 5 of 6 and made all three of his 3-point attempts. ... Chandler was called for a technical while on the bench in the third quarter. Josh Jackson picked up a technical in the second. . Booker missed six of his first eight shots and had one blocked."}
{"game_id": "0021700527", "chunk_id": "0021700527_021", "order": 21, "role": "body", "text": "Kings: Skal Labissiere made his 13th start of the season and first since Dec. 14 after sitting out the previous three games because of coach's decision. . Vince Carter, who scored a season-high 24 points against Cleveland on Wednesday, did not play."}
{"game_id": "0021700527", "chunk_id": "0021700527_023", "order": 23, "role": "body", "text": "Suns: Returns to Phoenix to play Philadelphia on Sunday."}
{"game_id": "0021700527", "chunk_id": "0021700527_024", "order": 24, "role": "closing", "text": "Kings: Host Memphis on Sunday."}
