{"game_id": "0021400065", "chunk_id": "0021400065_001", "order": 1, "role": "lead", "text": "PHOENIX --  When the Memphis Grizzlies impose their will on defense and slow down the game on offense, they cause problems for up-tempo teams."}
{"game_id": "0021400065", "chunk_id": "0021400065_002", "order": 2, "role": "body", "text": "Such was the case Wednesday night in the second half of a 102-91 win over the Phoenix Suns."}
{"game_id": "0021400065", "chunk_id": "0021400065_003", "order": 3, "role": "body", "text": "Mike Conley had 24 points and 11 assists, and the undefeated Grizzlies turned up the defense in the third quarter to slow down the Suns."}
{"game_id": "0021400065", "chunk_id": "0021400065_004", "order": 4, "role": "body", "text": "The Grizzlies, who won all four meetings between the teams last season, forced 10 turnovers in the third and turned an 11-point deficit in the second period into a five-point lead going into the fourth. Conley and fellow guard Courtney Lee, both coming off injuries, combined to score 17 of Memphis' 30 third-quarter points."}
{"game_id": "0021400065", "chunk_id": "0021400065_005", "order": 5, "role": "body", "text": "\"We just played with a lot more force. We rebounded better, our effort was a lot better and we got contributions from a lot of different places,\" Memphis coach Dave Joerger said. \"Courtney Lee came back and made some shots, but he did a lot of things that don't show up as far as his shooting numbers. Mike Conley being assertive and aggressive early put a lot of pressure on them.\""}
{"game_id": "0021400065", "chunk_id": "0021400065_006", "order": 6, "role": "body", "text": "Conley injured his ankle in the previous game but got the start. Lee missed the past two games with a concussion and also started, scoring 22 points with 4-of-5 shooting on 3-pointers."}
{"game_id": "0021400065", "chunk_id": "0021400065_007", "order": 7, "role": "body", "text": "Memphis (5-0) is off to the best start in franchise history."}
{"game_id": "0021400065", "chunk_id": "0021400065_008", "order": 8, "role": "body", "text": "\"I'm just happy to have a complete game,\" Conley said."}
{"game_id": "0021400065", "chunk_id": "0021400065_009", "order": 9, "role": "body", "text": "Eric Bledsoe made his first eight shots for Phoenix and finished with a season-high 23 points. He didn't miss until the fourth, and had a basket waved off after officials reviewed the play and determined the shot hit the rim after the 24-second clock expired."}
{"game_id": "0021400065", "chunk_id": "0021400065_010", "order": 10, "role": "body", "text": "Bledsoe made all five of his first-quarter shots plus three free throws to end the quarter with 14 points. Reserve guard Gerald Green picked up the scoring in the second quarter with nine of his 11 points, including a right baseline 3-pointer that gave the Suns a 41-32 lead."}
{"game_id": "0021400065", "chunk_id": "0021400065_011", "order": 11, "role": "body", "text": "Phoenix (3-2) took a 52-46 lead into halftime. But it didn't last long, as the Suns committed 18 turnovers for the game."}
{"game_id": "0021400065", "chunk_id": "0021400065_012", "order": 12, "role": "body", "text": "The Grizzlies trailed 43-32 after Isaiah Thomas' driving layup midway through the second quarter, but took a 60-59 lead after a 3-pointer from Conley and a jumper from Lee with 8:59 to play in the third."}
{"game_id": "0021400065", "chunk_id": "0021400065_013", "order": 13, "role": "body", "text": "The Grizzlies outscored Phoenix 18-5 over the first 5 minutes of the third quarter to take a 64-59 lead. They led by as many as eight in the quarter and 15 in the fourth."}
{"game_id": "0021400065", "chunk_id": "0021400065_014", "order": 14, "role": "body", "text": "\"I thought that game was lost in the third quarter,\" Suns coach Jeff Hornacek said."}
{"game_id": "0021400065", "chunk_id": "0021400065_015", "order": 15, "role": "body", "text": "Marc Gasol scored 10 of his 18 points in the fourth quarter for the Grizzlies."}
{"game_id": "0021400065", "chunk_id": "0021400065_016", "order": 16, "role": "body", "text": "\"I don't think we did a good job of executing. They did a great job of packing it in the paint,\" Bledsoe said. \"They were the better team.\""}
{"game_id": "0021400065", "chunk_id": "0021400065_017", "order": 17, "role": "body", "text": "Markieff Morris had 20 points and Thomas added 15 for the Suns."}
{"game_id": "0021400065", "chunk_id": "0021400065_018", "order": 18, "role": "body", "text": "Morris hit a 3 to cut the Memphis lead to 90-83 with 4:34 to play, but Lee connected from long range on the next possession. The Suns never got closer."}
{"game_id": "0021400065", "chunk_id": "0021400065_021", "order": 21, "role": "body", "text": "Suns: Hornacek said he wouldn't be surprised if the Grizzlies finish as Western Conference champions this season. \"They've got guys at all the positions. ... They're just a powerful team and they get you in their half-court game and make you grind it out,\" he said. ... Starting guard Goran Dragic, the reigning NBA Most Improved Player, struggled through a 3-for-9 shooting night and scored just six points. He'd been in double figures in the team's four previous games."}
{"game_id": "0021400065", "chunk_id": "0021400065_022", "order": 22, "role": "body", "text": "Grizzlies: Former Suns guard Vince Carter received a smattering of boos from the crowd upon entering in the first quarter. Carter scored four points. ... Conley has 36 double-doubles in his career."}
{"game_id": "0021400065", "chunk_id": "0021400065_025", "order": 25, "role": "body", "text": "Phoenix hosts Sacramento on Friday."}
{"game_id": "0021400065", "chunk_id": "0021400065_026", "order": 26, "role": "body", "text": "Memphis is at Oklahoma City on Friday."}
{"game_id": "0021400065", "chunk_id": "0021400065_029", "order": 29, "role": "body", "text": "\"I want to show those guys that they made a mistake, but at the same time it's about winning.\" -- Thomas on Friday's game against his former team, the Sacramento Kings."}
{"game_id": "0021400065", "chunk_id": "0021400065_032", "order": 32, "role": "closing", "text": "The Grizzlies shot 9 of 17 on 3-pointers (52.9 percent). ... Green was big in the second quarter, but shot only 2 of 8 for the game. ... Conley and Lee both went 9 for 14 from the field."}
