{"game_id": "0021400337", "chunk_id": "0021400337_001", "order": 1, "role": "lead", "text": "PHOENIX --  The Detroit Pistons downplayed a comment by Phoenix Suns forward Markieff Morris from the first time the teams met earlier this season."}
{"game_id": "0021400337", "chunk_id": "0021400337_002", "order": 2, "role": "body", "text": "But players were overheard shouting \"We knew he had heart,\" in the locker room while guard Kentavious Caldwell-Pope, the subject of Morris' remark, talked about his critical 3-pointer late in Friday's 105-103 win for the Pistons."}
{"game_id": "0021400337", "chunk_id": "0021400337_003", "order": 3, "role": "body", "text": "Caldwell-Pope hit a fadeaway 3-pointer in front of the Suns' bench with 1:13 to play. It gave put the Pistons ahead 100-97 -- a lead they wouldn't relinquish.  Morris had said Caldwell-Pope showed a lack of heart with a missed shot at the buzzer in the Suns' win last month."}
{"game_id": "0021400337", "chunk_id": "0021400337_004", "order": 4, "role": "body", "text": "\"I did kind of look at the bench just to let them know I do have a heart and I will take that shot every day,\" Caldwell-Pope, who finished with 14 points, said."}
{"game_id": "0021400337", "chunk_id": "0021400337_005", "order": 5, "role": "body", "text": "Andre Drummond sank a free throw with 2.5 seconds left, part of his 23 points, and the Suns turned the ball over on their last possession of the game to help Detroit seal the win and end a 13-game losing streak. The Pistons improved to 4-19, sending the struggling Suns to their fourth straight loss."}
{"game_id": "0021400337", "chunk_id": "0021400337_006", "order": 6, "role": "body", "text": "\"There were smiles on everybody's faces, but we have a game (Saturday in Sacramento) so we can't be too excited,\" Drummond said."}
{"game_id": "0021400337", "chunk_id": "0021400337_007", "order": 7, "role": "body", "text": "Drummond's 23 points and 14 rebounds led the Pistons, with Josh Smith adding 12 points and 11 rebounds."}
{"game_id": "0021400337", "chunk_id": "0021400337_008", "order": 8, "role": "body", "text": "Goran Dragic led the Suns with 18 points, including a layup with 15.9 seconds left in the game to make the score 102-101 Detroit. But the Suns (12-12) came up short."}
{"game_id": "0021400337", "chunk_id": "0021400337_009", "order": 9, "role": "body", "text": "Morris added 17 points, another of seven players to score in double figures."}
{"game_id": "0021400337", "chunk_id": "0021400337_010", "order": 10, "role": "body", "text": "\"We just have to act like we want to win. We can't play down to the level of the competition,\" Morris said."}
{"game_id": "0021400337", "chunk_id": "0021400337_011", "order": 11, "role": "body", "text": "The Pistons trailed by three midway through the fourth quarter, but scored five unanswered points to take a 91-89 lead with 5:13 left to play. During a Suns timeout, a Pistons fan seated a few rows behind the Suns bench heckled guard Eric Bledsoe, yelling loudly that Bledsoe was not worth his five-year, $70 million contract signed before this season."}
{"game_id": "0021400337", "chunk_id": "0021400337_012", "order": 12, "role": "body", "text": "That drew some choice words from Bledsoe at the fan, who never left his seat."}
{"game_id": "0021400337", "chunk_id": "0021400337_013", "order": 13, "role": "body", "text": "The two teams traded leads several times throughout the third quarter, but the Suns took a 76-75 into the fourth with Morris scoring 11 of his points in the third."}
{"game_id": "0021400337", "chunk_id": "0021400337_014", "order": 14, "role": "body", "text": "After making 50 percent of their shots in the first quarter, the Suns made just 9 of 23 attempts in the second and trailed by seven. An eight-foot runner in the key put the Pistons up 44-39 with 4:08 left in the first half --two of guard D.J. Augustin's nine second-quarter points."}
{"game_id": "0021400337", "chunk_id": "0021400337_015", "order": 15, "role": "body", "text": "Detroit led 55-52 at halftime. The Pistons' first basket of the second half was a dunk going down the lane from Caldwell-Pope."}
{"game_id": "0021400337", "chunk_id": "0021400337_016", "order": 16, "role": "body", "text": "Phoenix led by eight points in the first quarter, forcing an up-tempo style right away. Bledsoe and Dragic combined for 18 first-half points, and Miles Plumlee scored eight first-quarter points."}
{"game_id": "0021400337", "chunk_id": "0021400337_019", "order": 19, "role": "body", "text": "Pistons: Guard Jodie Meeks, out all season with a lower back injury, made his season debut Friday night and finished with 12 points in 22 minutes, including a pair of free throws with 8.9 seconds left to play. . The Pistons scored 28 points off 17 Suns turnovers."}
{"game_id": "0021400337", "chunk_id": "0021400337_020", "order": 20, "role": "body", "text": "Suns: Guard Isaiah Thomas played for the first time after missing the past eight games with a deep right ankle bruise. He scored 10 points in 28 minutes, including a game-tying layup with 2:06 to play, but his streak of consecutive made free throws ended at 50 with a fourth-quarter miss. . Phoenix made 10 of 31 3-point attempts."}
{"game_id": "0021400337", "chunk_id": "0021400337_022", "order": 22, "role": "body", "text": "Pistons: At Sacramento Saturday."}
{"game_id": "0021400337", "chunk_id": "0021400337_023", "order": 23, "role": "body", "text": "Suns: At Oklahoma City Sunday night."}
{"game_id": "0021400337", "chunk_id": "0021400337_025", "order": 25, "role": "body", "text": "-Drummond posted his 11th double-double of the season and has 79 games with double-digit rebounds since the start of last season, second only to DeAndre Jordan of the Los Angeles Clippers."}
{"game_id": "0021400337", "chunk_id": "0021400337_026", "order": 26, "role": "closing", "text": "-Friday's attendance of 17,007 at the US Airways Center was the highest since the season opener on Oct. 29."}
