{"game_id": "0021300969", "chunk_id": "0021300969_001", "order": 1, "role": "lead", "text": "ATLANTA -- With their season on the verge of slipping away, the Atlanta Hawks aren't going for style points, they're just glad to string together a couple of wins.\nKyle Korver scored 12 of his 15 points in the fourth quarter to help Atlanta beat the Milwaukee Bucks 102-97 Thursday night for the Hawks' first back-to-back victories in nearly six weeks.\nThe Hawks (28-35) expanded their lead over the surging Knicks (26-40) for the No. 8 and final playoff spot in the East to 3 1/2 games. Their victory over the team with the worst record in the NBA followed Monday's 104-102 victory over Utah, the team with the worst record in the Western Conference.\nLike the Bucks (13-52), the Hawks entered the game having lost 14 of 16, and their first home game after a six-game road trip had an odd feel.\n\"The last two haven't been pretty, but they're wins and it's two in a row so we're going to try to build on that,\" said Korver, who was 4 for 4 from the foul line and 3 for 4 from the field in the final period, including 2 for 3 on 3-pointers.\n\"The first game back after a (long) road trip is notoriously a trap game, and I think we fell for it a bit in the first half and didn't come out with the right energy and focus, at least I didn't.\"\nKorver's backcourt mate, Jeff Teague, scored 22 points with eight in a final period that saw 12 lead changes and four ties.\nThe Hawks took the lead for good when Korver's 3-pointer gave them a 90-89 edge with 2:15 left. That came moments after Korver missed from long distance, and reserve center Elton Brand grabbed the rebound and fired it back to the sharpshooter.\nThat play more than any ruined the Atlanta homecoming of Bucks coach Larry Drew, who was the Hawks' head coach from 2010-13. He was not asked to return for the final season of his contract, although Atlanta never officially fired him.\n\"If we come up with that rebound we're not in that position,\" Drew said. \"You can't leave a guy like that that open. Or even put him in that position, because Kyle is, if not the best shooter, he's one of the top three in our league.\"\nKorver's 3 triggered a 9-0 run that was punctuated by Teague's thunderous dunk with 27 second remaining for a 96-89 lead.\nErsan Ilyasova had 22 points and 10 rebounds for Milwaukee, and guard Brandon Knight added 20 points.\nEvery Atlanta starter, even center Pero Antic, made at least one 3-pointer. The Hawks were 13 for 29 from beyond the arc.\nMilwaukee had just eight turnovers and a modest 43-41 rebounding edge, but went 3 for 19 on 3-point attempts.\nTrailing 53-47 at halftime, the Hawks took a 68-67 lead by closing the third quarter with a 9-0 run during which they made four straight shots.\nMilwaukee shot 4 for 21 in the period, and scored one point over the final 4:08 of a 14-point quarter.\n\"Our defense picked us up and allowed us to get back in the game,\" Atlanta coach Mike Budenholzer said. \"We keep talking about being better defensively, and at some point we've got to carry it over to the court.\"\nBoth teams found energy in the final quarter, when the Hawks outscored the Bucks 34-30.\nTeague, who pitched in eight assists but also committed seven turnovers, was happy with the win because, he said, \"Nobody is bad in the NBA. On any given night, anybody can beat anybody.\"\nBudenholzer was more mindful of Atlanta's opponent. He did not consider his team to be back on track.\n\"No; not really. I think we're going to have to play a whole lot better than this going forward,\" Budenholzer said. \"Wins are important ... but I don't think anybody thinks we're settled.\"\nGame notes\nHawks center Al Horford, who has been out since tearing his right pectoral muscle Dec. 26 in an overtime win at Cleveland, said he will not return to play this seven even if Atlanta makes the playoffs. He returned after suffering a similar injury to his left pectoral in 2011-12. \"No. I think it would be hard. This injury, honestly, was a little more severe than the other one,\" he explained in his first meeting with reporters since the injury. \"And it's my right side, shooting arm, and I need to feel 100 percent confident with it, so I think it's going to be a little bit slower.\""}
