{"game_id": "0021300876", "chunk_id": "0021300876_001", "order": 1, "role": "lead", "text": "HOUSTON --  Houston is starting to make a habit of 40-point first quarters."}
{"game_id": "0021300876", "chunk_id": "0021300876_002", "order": 2, "role": "body", "text": "After not scoring 40 points in the opening quarter in the last five seasons, the Rockets have done it five times this season and twice in the last three games."}
{"game_id": "0021300876", "chunk_id": "0021300876_003", "order": 3, "role": "body", "text": "Terrence Jones had 22 points and 10 rebounds, and the Rockets opened a big early lead and beat the Detroit Pistons 118-110 on Saturday night for their third win in four games."}
{"game_id": "0021300876", "chunk_id": "0021300876_004", "order": 4, "role": "body", "text": "Jones finished 10 of 15 from the floor as Houston shot 50 percent for the game, including 61 percent in the first half. Houston scored 41 points in the first quarter and finished 11 of 33 from behind the arc."}
{"game_id": "0021300876", "chunk_id": "0021300876_005", "order": 5, "role": "body", "text": "\"We got a big halftime lead and didn't play well in the second half,\" Rockets coach Kevin McHale said. \"We came out and really moved the ball. We had it going up and down and just did a nice job of doing what we've been talking about doing, which is attacking early, getting inside to Dwight (Howard) and making some nice passes.\""}
{"game_id": "0021300876", "chunk_id": "0021300876_006", "order": 6, "role": "body", "text": "James Harden added 20 points and 12 assists, Patrick Beverley had 19 points and Howard chipped in 17 points and eight rebounds. Reserve Omri Casspi scored 16 points and Jordan Hamilton had 13."}
{"game_id": "0021300876", "chunk_id": "0021300876_007", "order": 7, "role": "body", "text": "While saying it was an important win before the Rockets begin a stretch against some of the top teams in the NBA on Tuesday against Miami, Howard did not like the way Houston came out in the second half."}
{"game_id": "0021300876", "chunk_id": "0021300876_008", "order": 8, "role": "body", "text": "\"I thought we should have really put the foot on the gas,\" Howard said. \"We didn't. We allowed them to get back into the game, and that is not what we need to do if we want to be a championship team.\""}
{"game_id": "0021300876", "chunk_id": "0021300876_009", "order": 9, "role": "body", "text": "Rodney Stuckey had 23 points on 10 of 17 shooting off the bench, and Josh Smith added 21 points for the Pistons, who dropped their fourth straight and seventh in eight games."}
{"game_id": "0021300876", "chunk_id": "0021300876_010", "order": 10, "role": "body", "text": "Andre Drummond had 16 points and 17 rebounds, Greg Monroe had 10 points and 14 rebounds, and Brandon Jennings chipped in 11 points and eight assists for Detroit, which shot 45 percent from the field."}
{"game_id": "0021300876", "chunk_id": "0021300876_011", "order": 11, "role": "body", "text": "\"In the first half, we didn't play with the energy, enthusiasm or desire you have to play at to play against any NBA team, let alone a high-level team like Houston,\" Detroit interim coach John Loyer said."}
{"game_id": "0021300876", "chunk_id": "0021300876_012", "order": 12, "role": "body", "text": "\"We came in here, and I told our guys we played harder in practice than the first 24 minutes. We had more juice, energy running a three-man weave than we did in the first half. There are two halves to a game, and fortunately, we played a much better second half.\""}
{"game_id": "0021300876", "chunk_id": "0021300876_013", "order": 13, "role": "body", "text": "Detroit fell four games out of the final Eastern Conference playoff spot. Drummond said the Pistons have enough time to make the playoffs."}
{"game_id": "0021300876", "chunk_id": "0021300876_014", "order": 14, "role": "body", "text": "\"We have enough time to do anything, and we're four games out, so it comes to what we do as a team,\" Drummond said. \"It can't be one or two people. We have to be as a collective group to want to buckle down and try to win games.\""}
{"game_id": "0021300876", "chunk_id": "0021300876_015", "order": 15, "role": "body", "text": "Trailing 102-84 with 10:33 remaining, Detroit outscored the Rockets 13-5 over the next 4:22 to cut the lead to 10 on Smith's free throws, but Beverley nailed back-to-back 3-pointers to push the lead back to 16 with four minutes remaining."}
{"game_id": "0021300876", "chunk_id": "0021300876_016", "order": 16, "role": "body", "text": "The Pistons closed within seven once more with a 10-1 run, capped by consecutive layups by Stuckey, but got no closer."}
{"game_id": "0021300876", "chunk_id": "0021300876_017", "order": 17, "role": "body", "text": "\"I think guys stopped playing a little bit because of the lead,\" Jones said. \"We just tried to make sure that we got back to it on the defensive end to make sure we got the win. I think we did that late in the fourth.\""}
{"game_id": "0021300876", "chunk_id": "0021300876_018", "order": 18, "role": "body", "text": "The Rockets, who never trailed, moved to 40-19. Only the 1993-94 team that started 40-15 got to 40 wins faster."}
{"game_id": "0021300876", "chunk_id": "0021300876_019", "order": 19, "role": "body", "text": "Houston used a 16-2 run over a three-minute stretch of the first quarter to open a 23-6 lead on Howard's two free throws 5 minutes into the game."}
{"game_id": "0021300876", "chunk_id": "0021300876_020", "order": 20, "role": "body", "text": "\"We did a good job of coming out with some aggression and getting some defensive stops and getting out in transition,\" Harden said."}
{"game_id": "0021300876", "chunk_id": "0021300876_021", "order": 21, "role": "body", "text": "Houston expanded its lead to 58-33 on Howard's free throw with 4:58 remaining in the first half. The Rockets led 69-46 at the break."}
{"game_id": "0021300876", "chunk_id": "0021300876_022", "order": 22, "role": "closing", "text": "Game notes Houston forward Chandler Parsons missed the game with an illness. . Rockets center Greg Smith underwent an exploratory arthroscopic knee surgery Wednesday to repair a medial meniscus tear and to examine changes to ligament structures in his right knee. Smith, who has missed 36 games this season, is out indefinitely. . Drummond leads the Eastern Conference with 43 double-doubles this season"}
