{"game_id": "0021400183", "chunk_id": "0021400183_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Injuries and a scuffle overshadowed another strong effort by Portland's Damian Lillard."}
{"game_id": "0021400183", "chunk_id": "0021400183_002", "order": 2, "role": "body", "text": "Lillard had 21 points and nine assists to help the Trail Blazers beat the short-handed Chicago Bulls 105-87 on Friday night."}
{"game_id": "0021400183", "chunk_id": "0021400183_003", "order": 3, "role": "body", "text": "However, Mike Dunleavy's flagrant foul on Lillard in the third quarter, followed by Taj Gibson's painful left ankle injury, marred Portland's sixth straight win."}
{"game_id": "0021400183", "chunk_id": "0021400183_004", "order": 4, "role": "body", "text": "Lillard was going up for a 3-pointer when Dunleavy barreled into him, knocking him down. Wesley Matthews ran over and pushed Dunleavy, and Aaron Brooks in turn shoved Matthews. LaMarcus Aldridge stepped in to separate the group."}
{"game_id": "0021400183", "chunk_id": "0021400183_005", "order": 5, "role": "body", "text": "Dunleavy was served with a flagrant foul, while Matthews and Brooks got offsetting technicals. Lillard made all three shots."}
{"game_id": "0021400183", "chunk_id": "0021400183_006", "order": 6, "role": "body", "text": "Afterward, Lillard called it a cheap play."}
{"game_id": "0021400183", "chunk_id": "0021400183_007", "order": 7, "role": "body", "text": "\"When I was shooting the ball I saw him coming at me and I thought, `He's not stopping,\" Lillard said. \"Anything could have happened.\""}
{"game_id": "0021400183", "chunk_id": "0021400183_008", "order": 8, "role": "body", "text": "Dunleavy called it an \"awkward moment.\""}
{"game_id": "0021400183", "chunk_id": "0021400183_009", "order": 9, "role": "body", "text": "\"I was going to intentionally foul him, but he went up to shoot,\" he said. \"What was I supposed to do?\""}
{"game_id": "0021400183", "chunk_id": "0021400183_010", "order": 10, "role": "body", "text": "Chicago lost Gibson in the third quarter when he sprained his left ankle. Gibson, who came down on Portland's Wesley Matthews, clutched his ankle and grimaced in pain before he was helped off the court. The 6-foot-9 forward was averaging 12.9 points and 5.9 rebounds coming into the game."}
{"game_id": "0021400183", "chunk_id": "0021400183_011", "order": 11, "role": "body", "text": "Coach Tom Thibodeau said he didn't think it was serious, but Gibson left the Moda Center in a boot and on crutches."}
{"game_id": "0021400183", "chunk_id": "0021400183_012", "order": 12, "role": "body", "text": "\"We'll see where he is tomorrow,\" Thibodeau said."}
{"game_id": "0021400183", "chunk_id": "0021400183_013", "order": 13, "role": "body", "text": "The Bulls were already limited without Derrick Rose, who missed his fourth straight game with a sore left hamstring. Pau Gasol missed his third game with a left calf strain."}
{"game_id": "0021400183", "chunk_id": "0021400183_014", "order": 14, "role": "body", "text": "They were also missing starting guard Kirk Hinrich, who left Thursday night's 103-88 loss to the Sacramento Kings with a chest contusion. X-rays were negative, but Thibodeau said before the game that Hinrich was day-to-day."}
{"game_id": "0021400183", "chunk_id": "0021400183_015", "order": 15, "role": "body", "text": "Rookie Nikola Mirotic came off the bench and had season highs with 24 points and 11 rebounds for the Bulls."}
{"game_id": "0021400183", "chunk_id": "0021400183_016", "order": 16, "role": "body", "text": "Aldridge added 16 points and nine rebounds for the Blazers, who got Nicolas Batum back after he missed four games with a right knee contusion."}
{"game_id": "0021400183", "chunk_id": "0021400183_017", "order": 17, "role": "body", "text": "Portland jumped out to an early 25-9 lead after Aldridge's 3-pointer. Lillard had seven assists in the first quarter alone and finished three short of matching his career high."}
{"game_id": "0021400183", "chunk_id": "0021400183_018", "order": 18, "role": "body", "text": "The Bulls closed the gap in the second quarter with an 8-0 run that pulled them to 39-35. The rally was short-lived and the Blazers went up 51-39 after a 10-0 run, capped by back-to-back 3-pointers from Lillard."}
{"game_id": "0021400183", "chunk_id": "0021400183_019", "order": 19, "role": "body", "text": "Portland led 61-42 at the half."}
{"game_id": "0021400183", "chunk_id": "0021400183_020", "order": 20, "role": "body", "text": "Aldridge passed to Robin Lopez for a dunk to put Portland up 70-45 before the Blazers sat their starters for the final period."}
{"game_id": "0021400183", "chunk_id": "0021400183_021", "order": 21, "role": "body", "text": "\"Obviously Chicago didn't have three of their main guys, but I liked our demeanor,\" coach Terry Stotts said. \"I liked our disposition, the way we came out of the gates. Our defense was solid.\""}
{"game_id": "0021400183", "chunk_id": "0021400183_022", "order": 22, "role": "body", "text": "Despite the drama, Lillard thought it was one of the Blazers' most complete games of the season."}
{"game_id": "0021400183", "chunk_id": "0021400183_023", "order": 23, "role": "body", "text": "\"We started the game really well and then they found their way back in -- and we picked it right back up,\" he said."}
{"game_id": "0021400183", "chunk_id": "0021400183_025", "order": 25, "role": "body", "text": "Bulls: Brooks, who went to the University of Oregon, got warm applause when he was announced as a starter. ... Thibodeau, who was an assistant coach on the U.S. national team that won the FIBA World Cup, said he has been impressed with Lillard.  \"He's terrific. There's nothing he can't do,\" Thibodeau said. Lillard did not make the final cut for the team, with Thibodeau called a tough choice."}
{"game_id": "0021400183", "chunk_id": "0021400183_026", "order": 26, "role": "body", "text": "Trail Blazers: Lillard's 33 3-pointers through the first 10 games were the most made over the opening 10-game stretch in Blazers' history. ... Lillard has had at least seven assists in seven straight games."}
{"game_id": "0021400183", "chunk_id": "0021400183_028", "order": 28, "role": "body", "text": "Aldridge had a pair of 3-pointers in the first quarter, the third time in his career he's had a game with multiple 3s.  \"It's there,\" Aldridge said about the 3 being part of his repertoire."}
{"game_id": "0021400183", "chunk_id": "0021400183_030", "order": 30, "role": "body", "text": "The Blazers have won seven straight against Chicago, their longest winning streak against any team in the league. The streak also ties the franchise high for wins against the Bulls."}
{"game_id": "0021400183", "chunk_id": "0021400183_032", "order": 32, "role": "body", "text": "\"You've got to keep moving forward because the games keep coming,\" the Bulls' Joakim Noah said. \"Nobody feels sorry for you so you've got to keep going and getting better. Hopefully Taj will be all right.\""}
{"game_id": "0021400183", "chunk_id": "0021400183_035", "order": 35, "role": "closing", "text": "Trail Blazers: At Boston on Sunday."}
