{"game_id": "0021200777", "chunk_id": "0021200777_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Paul George knew he needed to have a good game after the way he played Monday night."}
{"game_id": "0021200777", "chunk_id": "0021200777_002", "order": 2, "role": "body", "text": "George posted his first career triple-double with 23 points, 12 rebounds and a career-high 12 assists, and the Indiana Pacers snapped a two-game losing streak with a 101-77 rout of the Charlotte Bobcats on Wednesday night."}
{"game_id": "0021200777", "chunk_id": "0021200777_003", "order": 3, "role": "body", "text": "The All-Star forward bounced back after being limited to five points on 1-of-10 shooting in an 89-84 loss to the Brooklyn Nets two nights earlier."}
{"game_id": "0021200777", "chunk_id": "0021200777_004", "order": 4, "role": "body", "text": "\"It came in the course of me trying to do whatever I could, not only to win the game but to try to extend the lead,\" George said. \"I knew I needed a big game. I didn't play well at all (on Monday night) and didn't help, I thought, to win that game."}
{"game_id": "0021200777", "chunk_id": "0021200777_005", "order": 5, "role": "body", "text": "\"I wasn't having intentions of coming out and having a triple-double, but I knew I had to be more aggressive this game.\""}
{"game_id": "0021200777", "chunk_id": "0021200777_006", "order": 6, "role": "body", "text": "Tyler Hansbrough tied a season high with 19 points and grabbed 10 rebounds for the Pacers starting in place of David West, who was sidelined by an eye injury."}
{"game_id": "0021200777", "chunk_id": "0021200777_007", "order": 7, "role": "body", "text": "\"I feel like I can get a better rhythm coming straight from warm-ups,\" Hansbrough said. \"Also I think a little more focus. I'm not going in and trying to force things. Just relaxed and letting things come to me. I think relaxing and letting the game come to me is a big deal.\""}
{"game_id": "0021200777", "chunk_id": "0021200777_008", "order": 8, "role": "body", "text": "Pacers coach Frank Vogel was pleased with Hansbrough in his first start of the season."}
{"game_id": "0021200777", "chunk_id": "0021200777_009", "order": 9, "role": "body", "text": "\"Tyler Hansbrough is a starting power forward in this league,\" Vogel said. \"He proves every chance he gets what he can do.\""}
{"game_id": "0021200777", "chunk_id": "0021200777_010", "order": 10, "role": "body", "text": "Byron Mullens led the Bobcats with 19 points and Gerald Henderson chipped in 14."}
{"game_id": "0021200777", "chunk_id": "0021200777_011", "order": 11, "role": "body", "text": "The first quarter started as a shootout with Indiana and Charlotte combining for 59 points on 55.6 percent shooting. The Pacers held a 30-29 lead after the first before limiting the Bobcats to 23 percent shooting (14-for-61) over the final three quarters."}
{"game_id": "0021200777", "chunk_id": "0021200777_012", "order": 12, "role": "body", "text": "\"We had no running game,\" Henderson said. \"We didn't defend the ball that well, they got it into the paint a lot on us, their bigs are tough even though they didn't have David West tonight they're still a very physical team."}
{"game_id": "0021200777", "chunk_id": "0021200777_013", "order": 13, "role": "body", "text": "\"We feel like we are at our best when we get out in transition. We think we're improving in the half-court game. Tonight our shots just didn't fall for us.\""}
{"game_id": "0021200777", "chunk_id": "0021200777_014", "order": 14, "role": "body", "text": "George opened the game with a corner 3-pointer and finished the opening quarter with 11 points."}
{"game_id": "0021200777", "chunk_id": "0021200777_015", "order": 15, "role": "body", "text": "The Pacers stepped up on the defensive end in the second quarter, holding Charlotte without a field goal for nearly three minutes and to only 17 points in the quarter on 5-of-20 shooting. But Indiana's offense didn't fare any better with 19 points in the second."}
{"game_id": "0021200777", "chunk_id": "0021200777_016", "order": 16, "role": "body", "text": "Indiana closed the first half on a 9-2 run and started the third with an 12-6 stretch that included a tip-in from Roy Hibbert, a transition jumper from George Hill and a two-hand dunk by Hansbrough off a pass from Hill."}
{"game_id": "0021200777", "chunk_id": "0021200777_017", "order": 17, "role": "body", "text": "Orlando Johnson gave the Pacers their biggest lead of the game -- 70-60 -- on a free throw with eight seconds left in the third quarter. The Pacers ran away in the fourth quarter with little resistance from the Bobcats, who were outscored 52-31 after halftime."}
{"game_id": "0021200777", "chunk_id": "0021200777_018", "order": 18, "role": "body", "text": "\"You have a tale of two games ... in in the second half we had to keep our focus,\" Bobcats coach Mike Dunlap said. \"It isn't like we had to make major adjustments. So there were 50/50 balls, taking charges, and being attentive and alert."}
{"game_id": "0021200777", "chunk_id": "0021200777_019", "order": 19, "role": "body", "text": "\"So for me it was very disappointing being on that side of it.\""}
{"game_id": "0021200777", "chunk_id": "0021200777_020", "order": 20, "role": "closing", "text": "Game notes The Pacers were only 6-for-19 from 3-point range, but Hill was a perfect 3-for-3. ... Bismack Biyombo had 16 rebounds and four blocks for the Bobcats."}
