{"game_id": "0021700313", "chunk_id": "0021700313_001", "order": 1, "role": "lead", "text": "ATLANTA --  LeBron James' unusual midgame defensive switch was the hot topic after he helped Cleveland extend its winning streak."}
{"game_id": "0021700313", "chunk_id": "0021700313_002", "order": 2, "role": "body", "text": "James took command of a challenging defensive assignment and stuck around to see the end of the Cavaliers' 10th straight victory, 121-114 over the Atlanta Hawks on Thursday night."}
{"game_id": "0021700313", "chunk_id": "0021700313_003", "order": 3, "role": "body", "text": "James had 24 points and 12 assists, and Kevin Love finished with 25 points and 16 rebounds to help Cleveland hold off Atlanta to extend the NBA's longest active winning streak. It was James' 14th double-double in 22 games."}
{"game_id": "0021700313", "chunk_id": "0021700313_004", "order": 4, "role": "body", "text": "James had frequent exchanges with the officials but avoided serious confrontations following his first ejection in 1,082 career games Tuesday night in a home victory over Miami."}
{"game_id": "0021700313", "chunk_id": "0021700313_005", "order": 5, "role": "body", "text": "Dennis Schroder, who led Atlanta with 27 points, blew past Cavaliers guard Jose Calderon to score on three straight layups to give Atlanta a 67-58 lead late in the first half."}
{"game_id": "0021700313", "chunk_id": "0021700313_006", "order": 6, "role": "body", "text": "James (6-foot-8, 250 pounds) then took over primary defensive duties on Schroder (6-1, 172) to close the half and continued covering the super-quick guard in the second half."}
{"game_id": "0021700313", "chunk_id": "0021700313_007", "order": 7, "role": "body", "text": "\"He was kicking our butts in the first half,\" said James of Schroder."}
{"game_id": "0021700313", "chunk_id": "0021700313_008", "order": 8, "role": "body", "text": "\"My teammates asked me to take the challenge. I wanted the challenge.\""}
{"game_id": "0021700313", "chunk_id": "0021700313_009", "order": 9, "role": "body", "text": "James seemed to relish the chance to test his skills against the point guard."}
{"game_id": "0021700313", "chunk_id": "0021700313_010", "order": 10, "role": "body", "text": "\"I can't give that up,\" he said."}
{"game_id": "0021700313", "chunk_id": "0021700313_011", "order": 11, "role": "body", "text": "Cavaliers coach Tyronn Lue said the defensive switch \"was big time for us.\""}
{"game_id": "0021700313", "chunk_id": "0021700313_012", "order": 12, "role": "body", "text": "Even though James also guarded Schroder at times in Atlanta's 117-115 win at Cleveland on Nov. 4, Schroder said the defensive switch was still a shock."}
{"game_id": "0021700313", "chunk_id": "0021700313_013", "order": 13, "role": "body", "text": "\"It's amazing when the best player in the world tries to stop you and tries to guard you,\" Schroder said."}
{"game_id": "0021700313", "chunk_id": "0021700313_014", "order": 14, "role": "body", "text": "\"I still tried to be aggressive. It doesn't mean that I have to stop playing. He's a big body and it's tough to just go past him.\""}
{"game_id": "0021700313", "chunk_id": "0021700313_015", "order": 15, "role": "body", "text": "Schroder was held to 10 points in the second half while being shadowed by James."}
{"game_id": "0021700313", "chunk_id": "0021700313_016", "order": 16, "role": "body", "text": "\"I don't think anybody understands how tough that is,\" Cleveland's Dwyane Wade said about James' defensive challenge. \"But that's why LeBron's one of the greatest players to play the game.\""}
{"game_id": "0021700313", "chunk_id": "0021700313_017", "order": 17, "role": "body", "text": "The Cavaliers took the lead by outscoring the Hawks 36-23 in the third quarter. Love had 12 points while making three 3s in the period."}
{"game_id": "0021700313", "chunk_id": "0021700313_018", "order": 18, "role": "body", "text": "Cleveland stretched its lead to double figures for the first time at 90-79 on a 3-pointer by James. The Cavaliers led 99-90 entering the final period."}
{"game_id": "0021700313", "chunk_id": "0021700313_019", "order": 19, "role": "body", "text": "A basket by Ersan Ilyasova cut Cleveland's lead to 111-108. Cleveland's Jeff Green and Atlanta's Kent Bazemore traded jams before two free throws by Ilyasova cut it to 113-112."}
{"game_id": "0021700313", "chunk_id": "0021700313_020", "order": 20, "role": "body", "text": "The Cavaliers survived the crisis when James sank a 3-pointer over Bazemore and Wade added a short floater."}
{"game_id": "0021700313", "chunk_id": "0021700313_021", "order": 21, "role": "body", "text": "Ilyasova had 22 points while making four 3-pointers. Marco Belinelli had 18 points and rookie John Collins had 13."}
{"game_id": "0021700313", "chunk_id": "0021700313_023", "order": 23, "role": "body", "text": "Cavaliers: G Isaiah Thomas (hip) participated in pregame shooting but is not yet ready for full-speed drills. ... Wade had 19 points. Jae Crowder had 15 points and Green had 12. ... The Cavaliers ended a streak of three straight losses in the series. \"They've just always been a tough matchup for us,\" said Cleveland coach Tyronn Lue."}
{"game_id": "0021700313", "chunk_id": "0021700313_024", "order": 24, "role": "body", "text": "Hawks: G Isaiah Taylor returned after missing five games with a right retinal tear. Coach Mike Budenholzer said Taylor \"had a good practice\" after being cleared on Wednesday and would be Schroder's top backup barring more problems. ... F Luke Babbitt (lower back) started and scored eight points after missing three games."}
{"game_id": "0021700313", "chunk_id": "0021700313_026", "order": 26, "role": "body", "text": "Cleveland trailed 67-63 at halftime despite making 8 of 17 3-pointers. The Cavaliers made 18 of 39 3s overall, including four by Love, giving them 11 straight games with 10 or more long-range shots."}
{"game_id": "0021700313", "chunk_id": "0021700313_028", "order": 28, "role": "body", "text": "Cavaliers guard Iman Shumpert was set to have arthroscopic surgery on his left knee Friday morning in Cleveland after he was reevaluated by team physicians Dr. Richard Parker and Dr. James Rosneck. Shumpert is averaging 4.8 points and 3.1 rebounds in 13 games."}
{"game_id": "0021700313", "chunk_id": "0021700313_030", "order": 30, "role": "body", "text": "Cavaliers: Host Memphis on Saturday night."}
{"game_id": "0021700313", "chunk_id": "0021700313_031", "order": 31, "role": "body", "text": "Hawks: At Brooklyn on Saturday."}
{"game_id": "0021700313", "chunk_id": "0021700313_033", "order": 33, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
