{"game_id": "0021701014", "chunk_id": "0021701014_001", "order": 1, "role": "lead", "text": "PHOENIX --  After a couple of tough losses in Los Angeles, LeBron James and the Cleveland Cavaliers went to the desert and took care of Phoenix. The Suns offered little resistance."}
{"game_id": "0021701014", "chunk_id": "0021701014_002", "order": 2, "role": "body", "text": "In a performance that seemed almost effortless against an outmatched opponent, James earned his 69th career triple-double in a 129-107 victory that was never close after the first few minutes."}
{"game_id": "0021701014", "chunk_id": "0021701014_003", "order": 3, "role": "body", "text": "James, averaging a triple-double over his last 15 games, had 28 points, 13 rebounds and 11 assists. It was his second triple-double in 10 days and No. 14 this season."}
{"game_id": "0021701014", "chunk_id": "0021701014_004", "order": 4, "role": "body", "text": "\"I was playing all three facets and more,\" he said. \"I picked up a charge as well, a couple of blocks, a couple of steals, just being around the court and reliable for my teammates. Being able to clean glass, get my guys good looks where they are able to catch and shoot or catch it and lay it up, makes it a lot easier for me.\""}
{"game_id": "0021701014", "chunk_id": "0021701014_005", "order": 5, "role": "body", "text": "Jordan Clarkson scored 23 points and Kyle Korver had 22 for the Cavaliers, who bounced back from losses to the Clippers and Lakers with a dominating victory. Korver went 5 for 6 from 3-point range in his first start of the season."}
{"game_id": "0021701014", "chunk_id": "0021701014_006", "order": 6, "role": "body", "text": "\"I'm always trying to find the open spot,\" Korver said. \"(James) commands a lot of attention. We had a couple of sets where we tried to get up a couple of shots for me. A lot of it was just playing the game and readying the game.\""}
{"game_id": "0021701014", "chunk_id": "0021701014_007", "order": 7, "role": "body", "text": "T.J. Warren and Josh Jackson scored 19 apiece and Devin Booker added 17 for the Suns, losers of six straight and 21 of their last 23. Phoenix became the first team to lose 50 games this season."}
{"game_id": "0021701014", "chunk_id": "0021701014_008", "order": 8, "role": "body", "text": "Cleveland led from the opening basket. The Cavs scored nine straight to go up 23-8 on Larry Nance Jr.'s dunk, and Phoenix never got the lead to single digits again."}
{"game_id": "0021701014", "chunk_id": "0021701014_009", "order": 9, "role": "body", "text": "The Suns shot just 26 percent, including 1 of 9 on 3-pointers, and trailed 38-18 after one quarter."}
{"game_id": "0021701014", "chunk_id": "0021701014_010", "order": 10, "role": "body", "text": "The Cavs, who made 17 of 35 3-pointers, led by as many as 27 in the second half, with James delivering the biggest highlight on a breakaway, one-handed windmill dunk after a Phoenix turnover in the third quarter."}
{"game_id": "0021701014", "chunk_id": "0021701014_012", "order": 12, "role": "body", "text": "Cavaliers: Have beaten the Suns six straight times, longest streak in series history. ... Cleveland is 2-2 so far on a six-game trip. ... Nance had only four points, ending his career-best string of seven consecutive double-digit scoring games. ... Cleveland is just 12-14 against the Western Conference.  ... James has one other triple-double against Suns. ... The Cavs have scored at least 110 points in seven of last eight road games."}
{"game_id": "0021701014", "chunk_id": "0021701014_013", "order": 13, "role": "body", "text": "Suns: The Suns made 6 of 31 3s. They had been shooting 41 percent on 3s for the month. ... Booker failed to score at least 30 for only the second time in eight games. ... Booker's 22 30-point games this season are fourth-most in the NBA. ... Phoenix last beat Cleveland on Jan. 13, 2015. ... Jared Dudley grabbed a season-high nine rebounds."}
{"game_id": "0021701014", "chunk_id": "0021701014_015", "order": 15, "role": "body", "text": "Suns interim coach Jay Triano said James' exceptional passing is sometimes overlooked. James had a couple of rocket cross-court passes to Korver for 3-pointers in the first half."}
{"game_id": "0021701014", "chunk_id": "0021701014_016", "order": 16, "role": "body", "text": "\"I think that's the skill that is probably most elite of the NBA players that he has,\" Triano said. \"His ability to, not just share it, but how he delivers it. He throws the ball so hard and it's always on time and on target. We saw that years ago when Steve Nash played. He delivered the ball and everybody shot a better percentage when they played with him. Everybody who plays with LeBron shoots a much better percentage.\""}
{"game_id": "0021701014", "chunk_id": "0021701014_018", "order": 18, "role": "body", "text": "Cavaliers: At Portland on Thursday night."}
{"game_id": "0021701014", "chunk_id": "0021701014_019", "order": 19, "role": "body", "text": "Suns: At Utah on Thursday night."}
{"game_id": "0021701014", "chunk_id": "0021701014_021", "order": 21, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
