{"game_id": "0021700516", "chunk_id": "0021700516_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  The Orlando Magic got their first win in more than three weeks thanks to major contributions from some unlikely sources."}
{"game_id": "0021700516", "chunk_id": "0021700516_002", "order": 2, "role": "body", "text": "Point guard Elfrid Payton and reserve centers Bismack Biyombo and Marreese Speights teamed up to spark the Magic to a 102-89 victory over Detroit that ended a nine-game losing streak."}
{"game_id": "0021700516", "chunk_id": "0021700516_003", "order": 3, "role": "body", "text": "Payton had 19 points, eight assists and eight rebounds, while Biyombo and Speights combined for 28 points and 18 rebounds as subs for injured starting center Nikola Vucevic."}
{"game_id": "0021700516", "chunk_id": "0021700516_004", "order": 4, "role": "body", "text": "Evan Fournier scored 17 points and Aaron Gordon had 14 for Orlando, but it was the Magic's backup centers who made the difference in the game."}
{"game_id": "0021700516", "chunk_id": "0021700516_005", "order": 5, "role": "body", "text": "\"The last couple of games it's been about other guys trying to pick up the scoring load,\" Magic coach Frank Vogel said. \"Biz and Mo were both great tonight. We had our best passing game in a few weeks and it resulted in better shooting."}
{"game_id": "0021700516", "chunk_id": "0021700516_006", "order": 6, "role": "body", "text": "\"And that stretch toward the end of the third quarter and into the fourth where the ball was really moving, the guys were not looking to force things and we got the payoff.\""}
{"game_id": "0021700516", "chunk_id": "0021700516_007", "order": 7, "role": "body", "text": "Speights helped the Magic seize control of the game at the end of the third period and start of the fourth. He scored Orlando's last nine points in the third quarter, nailed a 3-pointer to start the fourth quarter, then handed out an assist D.J. Augustin for another 3-pointer as the Magic turned a five-point deficit into an 86-73 lead."}
{"game_id": "0021700516", "chunk_id": "0021700516_008", "order": 8, "role": "body", "text": "\"When you're in this league, you have to find something you're really good at and that's something I think I'm good at,\" Speights said after scoring 16 points and grabbing five rebounds. \"Now that (Vucevic) is out, I know I'm going to get the opportunity to play every night. So when you know you'll get to play, your routine can be good and you'll have confidence.\""}
{"game_id": "0021700516", "chunk_id": "0021700516_009", "order": 9, "role": "body", "text": "The Pistons, who rallied successfully from double-digit deficits early in the game, never got closer than eight points in the final nine minutes of the game."}
{"game_id": "0021700516", "chunk_id": "0021700516_010", "order": 10, "role": "body", "text": "Tobias Harris scored 21 points for Detroit, which had won five of six. Andre Drummond had 17 points and 18 rebounds, and Ish Smith contributed 13 points, seven rebounds and five assists."}
{"game_id": "0021700516", "chunk_id": "0021700516_011", "order": 11, "role": "body", "text": "But Detroit was slow at both ends of the court in the fourth quarter. The Pistons didn't cover the 3-point line at all and Orlando punished them with five 3-pointers in the final period."}
{"game_id": "0021700516", "chunk_id": "0021700516_012", "order": 12, "role": "body", "text": "At the offensive end, Detroit hit just five of 20 shots (25 percent) and got outscored 25-16. Detroit's reserves were just 3 for 22 from the field for the game."}
{"game_id": "0021700516", "chunk_id": "0021700516_013", "order": 13, "role": "body", "text": "\"We don't need everybody to have great nights, but we can't have that many guys have that bad a night and think we're going to get wins,\" Detroit coach Stan Van Gundy said. \"I didn't think many of the guys brought very good energy.\""}
{"game_id": "0021700516", "chunk_id": "0021700516_015", "order": 15, "role": "body", "text": "Pistons: PG Reggie Jackson, who had a season-high 13 assists in the win over Indiana on Tuesday, suffered a Grade 3 ankle sprain in the third quarter of that game and will miss six to eight weeks. Smith has replaced him in the lineup. ... The Pistons have lost four of their last five games against Orlando."}
{"game_id": "0021700516", "chunk_id": "0021700516_016", "order": 16, "role": "body", "text": "Magic: Gordon returned to the lineup after missing the last five games and seven of the last eight. ... Mario Hezonja hit 8 of 12 3-pointers the last time Orlando played Detroit. He is 4 of 17 from behind the line in the five games since. ... The Magic were 17 of 17 from the free throw line, a franchise record for most free throws in a game without a miss."}
{"game_id": "0021700516", "chunk_id": "0021700516_018", "order": 18, "role": "body", "text": "Pistons: Host San Antonio on Saturday night."}
{"game_id": "0021700516", "chunk_id": "0021700516_019", "order": 19, "role": "body", "text": "Magic: Host Miami on Saturday in a rematch of Tuesday's 107-89 Heat victory."}
{"game_id": "0021700516", "chunk_id": "0021700516_021", "order": 21, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
