{"game_id": "0021700198", "chunk_id": "0021700198_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Trail Blazers center Jusuf Nurkic appeared to draw some motivation in facing his old team."}
{"game_id": "0021700198", "chunk_id": "0021700198_002", "order": 2, "role": "body", "text": "\"He was aggressive,\" said former Denver Nuggets teammate Nikola Jokic, \"looking to score.\""}
{"game_id": "0021700198", "chunk_id": "0021700198_003", "order": 3, "role": "body", "text": "Nurkic had 17 points and Portland beat the Nuggets 99-82 on Monday night to snap a two-game losing streak."}
{"game_id": "0021700198", "chunk_id": "0021700198_004", "order": 4, "role": "body", "text": "Portland built an 86-66 lead early in the fourth quarter on Noah Vonleh's dunk and cruised the rest of the way. CJ McCollum also had 17 and Damian Lillard finished with 15 points and seven assists."}
{"game_id": "0021700198", "chunk_id": "0021700198_005", "order": 5, "role": "body", "text": "Portland led by as many as 23 points and found a way to shut down Jokic."}
{"game_id": "0021700198", "chunk_id": "0021700198_006", "order": 6, "role": "body", "text": "\"We tried to show tonight that we're a good defensive team and hold them below 80. We did a great job and we tried to show that,\" Nurkic said."}
{"game_id": "0021700198", "chunk_id": "0021700198_007", "order": 7, "role": "body", "text": "Paul Millsap led the Nuggets with 18 points, including a season-high five 3-pointers."}
{"game_id": "0021700198", "chunk_id": "0021700198_008", "order": 8, "role": "body", "text": "The win was a boost for the Blazers, who were coming off two straight close -- and disheartening -- losses at home. They fell to Memphis 98-97 before losing to Brooklyn 101-97 on Friday night."}
{"game_id": "0021700198", "chunk_id": "0021700198_009", "order": 9, "role": "body", "text": "The Nuggets were coming off a successful six-game home stand during which they went 5-1, including a 125-107 victory over Orlando on Saturday night."}
{"game_id": "0021700198", "chunk_id": "0021700198_010", "order": 10, "role": "body", "text": "But they were cold against the Blazers, shooting just 35 percent for the game to snap a three-game winning streak."}
{"game_id": "0021700198", "chunk_id": "0021700198_011", "order": 11, "role": "body", "text": "Denver was without starter Gary Harris because of right shoulder soreness. Will Barton got his second straight start in his place and had 12 points."}
{"game_id": "0021700198", "chunk_id": "0021700198_012", "order": 12, "role": "body", "text": "Jokic, who has had double-doubles in eight of the last 10 games, finished with six points and seven rebounds -- well off his season averages of 17.2 points and 12 rebounds going into the game."}
{"game_id": "0021700198", "chunk_id": "0021700198_013", "order": 13, "role": "body", "text": "\"He's a great player. He's had this year a lot of good games,\" Nurkic said. \"I know exactly what he's going to do. ... We stopped him really well.\""}
{"game_id": "0021700198", "chunk_id": "0021700198_014", "order": 14, "role": "body", "text": "Nurkic, who played just one minute in the fourth quarter of Friday night's loss to Brooklyn, played for the Nuggets for three seasons before he was traded to Portland in February. The Blazers were 14-6 with Nurkic in the lineup, a spark that helped propel the team into the playoffs."}
{"game_id": "0021700198", "chunk_id": "0021700198_015", "order": 15, "role": "body", "text": "Nurkic, who was obviously energized against his former team, went into the game averaging 15.6 points and 7.3 rebounds this season."}
{"game_id": "0021700198", "chunk_id": "0021700198_016", "order": 16, "role": "body", "text": "Blazers coach Terry Stotts tinkered with his starting lineup, giving rookie forward Caleb Swanigan his first career start, but he got into foul trouble early in the third quarter."}
{"game_id": "0021700198", "chunk_id": "0021700198_017", "order": 17, "role": "body", "text": "Swanigan said he found out on Sunday he's start."}
{"game_id": "0021700198", "chunk_id": "0021700198_018", "order": 18, "role": "body", "text": "\"Just come in and get a win,\" he said of his reaction. \"We had lost two in a row so the biggest thing for all of us was to come in focused and make sure we win this game.\""}
{"game_id": "0021700198", "chunk_id": "0021700198_019", "order": 19, "role": "body", "text": "Portland went on a 10-2 run for an early 35-25 lead. The Blazers went on to lead by as many as 14 points in the first half, led by Nurkic and Evan Turner with 10 points apiece. Portland's bench outscored Denver's 25-10."}
{"game_id": "0021700198", "chunk_id": "0021700198_020", "order": 20, "role": "body", "text": "Trailing 54-59 at the break, the Nuggets closed within 54-51 on a pair of free throws from Wilson Chandler. But CJ McCollum answered with a 3-pointer for the Blazers."}
{"game_id": "0021700198", "chunk_id": "0021700198_021", "order": 21, "role": "body", "text": "Portland pushed the lead to 82-66 on Vonleh's tip shot and Lillard added free throws to end the third quarter."}
{"game_id": "0021700198", "chunk_id": "0021700198_022", "order": 22, "role": "body", "text": "\"Maybe I was not as aggressive, but they are a good defensive group,\" Jokic said. \"They are a good team. That's why they made the playoffs last year.\""}
{"game_id": "0021700198", "chunk_id": "0021700198_023", "order": 23, "role": "body", "text": "It was Portland's ninth straight win at home over the Nuggets."}
{"game_id": "0021700198", "chunk_id": "0021700198_025", "order": 25, "role": "body", "text": "Nuggets: Starting guard Will Barton was drafted by Portland in 2012 with the 40th overall pick and played two-plus seasons with the Blazers. ...   Mason Plumlee was traded from Portland to Denver in the Nurkic deal. Both Plumlee and Barton were greeted with warm applause by fans at the Moda Center."}
{"game_id": "0021700198", "chunk_id": "0021700198_026", "order": 26, "role": "body", "text": "Trail Blazers: Meyers Leonard was active after missing the last eight games with a right ankle sprain but he did not play."}
{"game_id": "0021700198", "chunk_id": "0021700198_028", "order": 28, "role": "body", "text": "In addition to inserting Swanigan into the starting lineup, Stotts did not go with Lillard and McCollum to start the second and fourth quarters."}
{"game_id": "0021700198", "chunk_id": "0021700198_029", "order": 29, "role": "body", "text": "\"It was something I actually toyed around with going to the season, if we'd ever get to it or not,\" Stotts said. \"I wanted to give it a look, it worked out well tonight and we'll see how it does going forward.  \""}
{"game_id": "0021700198", "chunk_id": "0021700198_031", "order": 31, "role": "body", "text": "Nuggets: Denver hosts the Pelicans on Friday night."}
{"game_id": "0021700198", "chunk_id": "0021700198_032", "order": 32, "role": "closing", "text": "Trail Blazers: Portland hosts Orlando on Wednesday."}
