{"game_id": "0021301106", "chunk_id": "0021301106_001", "order": 1, "role": "lead", "text": "CHICAGO --  Having been burned by D.J. Augustin the previous night, the Boston Celtics clamped down on the Bulls' guard in the second game of their home-and-home series."}
{"game_id": "0021301106", "chunk_id": "0021301106_002", "order": 2, "role": "body", "text": "Boston succeeded in limiting Augustin to four points on 1-of-9 shooting, but that didn't affect the final outcome."}
{"game_id": "0021301106", "chunk_id": "0021301106_003", "order": 3, "role": "body", "text": "Mike Dunleavy had 22 points on 7-for-12 shooting and Augustin handed out 11 assists to help five Bulls score in double figures for a 94-80 win over the Celtics on Monday night."}
{"game_id": "0021301106", "chunk_id": "0021301106_004", "order": 4, "role": "body", "text": "\"From the beginning of the game I knew they were going to do that, adjust to me,\" Augustin said. \"I had to do some other things and find my teammates and they did a great job getting open.\""}
{"game_id": "0021301106", "chunk_id": "0021301106_005", "order": 5, "role": "body", "text": "Joakim Noah added 19 points, 11 rebounds and five assists, Jimmy Butler scored 18 points, Carlos Boozer 16 and Taj Gibson had 14 points and 11 rebounds for Chicago, which pulled away with a 13-0 run at the start of the fourth quarter."}
{"game_id": "0021301106", "chunk_id": "0021301106_006", "order": 6, "role": "body", "text": "The Bulls (42-32) moved into a tie with the Toronto Raptors -- who lost at Miami -- for third place in the Eastern Conference."}
{"game_id": "0021301106", "chunk_id": "0021301106_007", "order": 7, "role": "body", "text": "\"I think it's very important,\" Dunleavy said of the third seed. \"We want to get as high as we can. Not only with home-court advantage and avoiding the first seed in the second round, if we're fortunate enough to advance. We just want to get as high as we can.\""}
{"game_id": "0021301106", "chunk_id": "0021301106_008", "order": 8, "role": "body", "text": "Chicago swept the home-and-home series with the Celtics after winning 107-102 in Boston on Sunday."}
{"game_id": "0021301106", "chunk_id": "0021301106_009", "order": 9, "role": "body", "text": "The Celtics have lost 10 straight on the road to drop to 8-28 away from home. Their last road win was Feb. 10 at Milwaukee."}
{"game_id": "0021301106", "chunk_id": "0021301106_010", "order": 10, "role": "body", "text": "Brandon Bass and Jerryd Bayless scored 18 points apiece for the Celtics."}
{"game_id": "0021301106", "chunk_id": "0021301106_011", "order": 11, "role": "body", "text": "Rajon Rondo didn't play Monday after getting 17 points and 11 assists Sunday. He is still working his way back to full strength following reconstructive knee surgery and doesn't play in back-to-back games."}
{"game_id": "0021301106", "chunk_id": "0021301106_012", "order": 12, "role": "body", "text": "\"It wasn't just the fourth (quarter),\" Boston coach Brad Stevens said. \"The first five minutes of the third and the fourth we went into a drought. We looked heavy-legged the whole second half."}
{"game_id": "0021301106", "chunk_id": "0021301106_013", "order": 13, "role": "body", "text": "\"That's no excuse because they played last night, too.\""}
{"game_id": "0021301106", "chunk_id": "0021301106_014", "order": 14, "role": "body", "text": "The game was tight entering the fourth, but the Bulls went on a quick 9-0 run for an 80-70 lead with 9 1/2 minutes to play before Stevens called time out. The stoppage didn't curb the Bulls' momentum."}
{"game_id": "0021301106", "chunk_id": "0021301106_015", "order": 15, "role": "body", "text": "Gibson scored on vicious dunk off a nice feed from Butler to make it 82-70 and Noah capped the run of 13 straight with a post move for an 84-70 lead. Noah had six points during the spurt, including an 18-foot jumper before Boston's timeout."}
{"game_id": "0021301106", "chunk_id": "0021301106_016", "order": 16, "role": "body", "text": "\"They're a good team,\" Bayless said. \"We don't have a lot of room for error. We made a couple of bad plays in a row and they're too good and they got on the break and hit their shots. We have to pull it together for longer stretches of time.\""}
{"game_id": "0021301106", "chunk_id": "0021301106_017", "order": 17, "role": "body", "text": "Although Augustin didn't score in the fourth, he played a big role by dishing out six assists as Boston overplayed him."}
{"game_id": "0021301106", "chunk_id": "0021301106_018", "order": 18, "role": "body", "text": "\"That's the advantage we have with the finishing group,\" Bulls coach Tom Thibodeau said. \"The job of those guys is to read what the defense is doing.\""}
{"game_id": "0021301106", "chunk_id": "0021301106_019", "order": 19, "role": "body", "text": "The Bulls are 10 games over .500 for the first time this season."}
{"game_id": "0021301106", "chunk_id": "0021301106_020", "order": 20, "role": "body", "text": "\"I think we're playing pretty good basketball, but I think we can play better,\" Noah said. \"I think the mindset is good. Everybody is working, everybody is in the weight room, everybody is trying to find ways to get better.\""}
{"game_id": "0021301106", "chunk_id": "0021301106_021", "order": 21, "role": "closing", "text": "Game notes Home-and-home series on consecutive games used to be a regular occurrence in the NBA, but are rare these days. \"It's the same plays, so there's a tendency for the players to know what's coming,\" Thibodeau said. \"I think it's good preparation for what's coming down the road.\" ... Since he wasn't playing because of the back-to-back, Rondo spent part of the game working on the TV broadcast back to Boston. ... Celtics G Avery Bradley left the game in the first half because of a sore Achilles. . Noah had 13 assists in Sunday's game, the most ever by a visiting center in Boston. The previous high was 11 by Wilt Chamberlain in 1968."}
