{"game_id": "0021700680", "chunk_id": "0021700680_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  There was no Jimmy Butler, practically no Karl-Anthony Towns in the first half, and the visiting Toronto Raptors were shooting 54 percent."}
{"game_id": "0021700680", "chunk_id": "0021700680_002", "order": 2, "role": "body", "text": "These are the types of games the Minnesota Timberwolves of the last few years didn't win. This season's revamped team is showing the toughness needed to compete with the league's top teams."}
{"game_id": "0021700680", "chunk_id": "0021700680_003", "order": 3, "role": "body", "text": "Andrew Wiggins scored 29 points, Towns had all 22 of his points in the second half and the Wolves rallied from 11 down to beat the Toronto Raptors 115-109 on Saturday night."}
{"game_id": "0021700680", "chunk_id": "0021700680_004", "order": 4, "role": "body", "text": "\"We've got a lot of guys that know how to play,\" Wiggins said. \"That's the NBA for you. Someone's injured, the next person just steps up. We have a good team, a lot of guys that can step up and make plays.\""}
{"game_id": "0021700680", "chunk_id": "0021700680_005", "order": 5, "role": "body", "text": "With Butler out with a sore knee and Towns in foul trouble, Wiggins almost single-handedly kept the Wolves in it with 22 first-half points. In the second half, the Wolves got big minutes from Marcus Georges-Hunt (12 points), Gorgui Dieng and Tyus Jones (nine points apiece) and the seldom-used Shabazz Muhammad (seven points). The Wolves bench outscored Toronto's 37-39."}
{"game_id": "0021700680", "chunk_id": "0021700680_006", "order": 6, "role": "body", "text": "\"If you're in this league, you're a great player,\" coach Tom Thibodeau said. \"So when someone's out, it's an opportunity for someone else to step in. As long as we play hard, we feel like we're going to have a chance to win every night.\""}
{"game_id": "0021700680", "chunk_id": "0021700680_007", "order": 7, "role": "body", "text": "The Wolves snapped a two-game skid."}
{"game_id": "0021700680", "chunk_id": "0021700680_008", "order": 8, "role": "body", "text": "Kyle Lowry led Toronto with a season-high 40 points on 14-for-25 shooting, including 6 of 10 from behind the arc."}
{"game_id": "0021700680", "chunk_id": "0021700680_009", "order": 9, "role": "body", "text": "Towns had three early fouls and no shot attempts in eight first-half minutes, and the Raptors looked primed for their third straight win. But Towns finally got going after halftime, scoring 12 of the Timberwolves' first 21 points, and Minnesota outscored the Raptors 33-21 in the quarter en route to snapping their two-game winning streak."}
{"game_id": "0021700680", "chunk_id": "0021700680_010", "order": 10, "role": "body", "text": "Minnesota went 32 for 42 from the line, while Toronto went 19 of 21."}
{"game_id": "0021700680", "chunk_id": "0021700680_011", "order": 11, "role": "body", "text": "\"We didn't match their intensity coming out of the locker room in the second half,\" Raptors coach Dwane Casey said. \"We knew they were going to come. We just didn't move offensively. We were standing, watching the ball. We were trying to run our sets, but we played in mud.\""}
{"game_id": "0021700680", "chunk_id": "0021700680_012", "order": 12, "role": "body", "text": "Minnesota led by as many as 10 in the fourth before the Raptors answered with an 11-0 run to retake the lead. DeMar DeRozan's 3-pointer put Toronto up 106-104 with 3:12 left. But Wiggins and Towns hit back-to-back 3s and Georges-Hunt added three free throws to help give the Wolves their third straight home win over the Raptors."}
{"game_id": "0021700680", "chunk_id": "0021700680_014", "order": 14, "role": "body", "text": "Raptors: DeRozan scored 20 points. He entered averaging a career-high five assists per game. He had five by halftime but none in the second half. ... Fred VanVleet returned after missing two games with a bruised right knee. He scored eight points."}
{"game_id": "0021700680", "chunk_id": "0021700680_015", "order": 15, "role": "body", "text": "Timberwolves: Thibodeau said Butler didn't participate in the morning shootaround and was day-to-day. ... Jamal Crawford also sat out with a left great toe sprain. ... Wiggins shot 33.7 percent in his previous six games. He shot 11 for 21 Saturday night. His 29 points were a season high. ... The Wolves are 1-2 in games without Butler. ... Wiggins had two highlight-reel dunks in the first half over 7-foot Jakob Poeltl, bringing the Wolves bench to its feet both times."}
{"game_id": "0021700680", "chunk_id": "0021700680_017", "order": 17, "role": "body", "text": "The Raptors nearly wrapped up their first home-road back-to-back set of the season with impressive wins against two of the West's best teams. They beat San Antonio on Friday night at home. \"We've got to come out with a little bit more energy on the back-to-back, but it's no excuse,\" Lowry said."}
{"game_id": "0021700680", "chunk_id": "0021700680_019", "order": 19, "role": "body", "text": "Georges-Hunt had career highs in points (12) and minutes (29), including his three crucial free throws in the closing minutes. Afterward, Thibodeau lauded his mental toughness."}
{"game_id": "0021700680", "chunk_id": "0021700680_020", "order": 20, "role": "body", "text": "\"Just stay relaxed and just act like nobody's in the gym,\" Georges-Hunt said."}
{"game_id": "0021700680", "chunk_id": "0021700680_022", "order": 22, "role": "body", "text": "Raptors: At Atlanta on Wednesday night."}
{"game_id": "0021700680", "chunk_id": "0021700680_023", "order": 23, "role": "body", "text": "Timberwolves: At the Los Angeles Clippers on Monday night."}
{"game_id": "0021700680", "chunk_id": "0021700680_025", "order": 25, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
