{"game_id": "0021400500", "chunk_id": "0021400500_001", "order": 1, "role": "lead", "text": "DENVER --  Ty Lawson knocked down jumper after jumper. Rookie Jusuf Nurkic blocked shot after shot."}
{"game_id": "0021400500", "chunk_id": "0021400500_002", "order": 2, "role": "body", "text": "Quite possibly the benefits of some extra slumber."}
{"game_id": "0021400500", "chunk_id": "0021400500_003", "order": 3, "role": "body", "text": "To keep his team from sleepwalking through games -- like Denver has been known to do at times -- coach Brian Shaw recently started holding pregame shoot-around sessions during the afternoon instead of in the morning. He is hoping extra Zzzs translates into more Ws."}
{"game_id": "0021400500", "chunk_id": "0021400500_004", "order": 4, "role": "body", "text": "Lawson scored 25 points, Nurkic provided a lift inside by blocking a career-best five shots, and the Nuggets snapped a three-game losing streak with a 114-85 victory over the Memphis Grizzlies on Saturday night."}
{"game_id": "0021400500", "chunk_id": "0021400500_005", "order": 5, "role": "body", "text": "\"I'm not going to lie, I'm loving (the afternoon shoot-around),\" Lawson said. \"I don't understand getting up at 7:45 a.m. to do shoot-around when you're not going to remember it, and you're still tired. ... I'm liking this.\""}
{"game_id": "0021400500", "chunk_id": "0021400500_006", "order": 6, "role": "body", "text": "Shaw certainly liked how his team performed Saturday, handing the weary Grizzlies their worst loss of the season."}
{"game_id": "0021400500", "chunk_id": "0021400500_007", "order": 7, "role": "body", "text": "\"The guys are feeling pretty good about themselves,\" Shaw said. \"It's something we have to build on.\""}
{"game_id": "0021400500", "chunk_id": "0021400500_008", "order": 8, "role": "body", "text": "Arron Afflalo added 23 points and Kenneth Faried had 13 points and 13 rebounds as the Nuggets kept up their mastery of Memphis at home, improving to 32-5 all-time."}
{"game_id": "0021400500", "chunk_id": "0021400500_009", "order": 9, "role": "body", "text": "Lawson was 10 of 14 from the field. His New Year's resolution was to shoot more."}
{"game_id": "0021400500", "chunk_id": "0021400500_010", "order": 10, "role": "body", "text": "\"Just being more aggressive. Taking the open shots,\" said Lawson, who also had 11 assists. \"Because normally I pass them up.\""}
{"game_id": "0021400500", "chunk_id": "0021400500_011", "order": 11, "role": "body", "text": "Marc Gasol scored 18 points for the Grizzlies, who were running on fumes on the second night of a back-to-back. They held off the Lakers 109-106 in Los Angeles on Friday."}
{"game_id": "0021400500", "chunk_id": "0021400500_012", "order": 12, "role": "body", "text": "Memphis lost its cool in the third quarter, with coach Dave Joerger drawing two technical fouls, leading to his ejection, and Gasol receiving another."}
{"game_id": "0021400500", "chunk_id": "0021400500_013", "order": 13, "role": "body", "text": "Denver outscored Memphis 34-22 in the third to turn the game into a rout. Afflalo led the way with 14 points in the quarter."}
{"game_id": "0021400500", "chunk_id": "0021400500_014", "order": 14, "role": "body", "text": "Trying to spark his team in the third, Joerger argued a foul call, only to be sent to the locker room. Really, though, his anger was more out of frustration over a lack of whistles for Mike Conley and Gasol."}
{"game_id": "0021400500", "chunk_id": "0021400500_015", "order": 15, "role": "body", "text": "\"It just came out,\" Joerger said. \"It's very frustrating.\""}
{"game_id": "0021400500", "chunk_id": "0021400500_016", "order": 16, "role": "body", "text": "Gasol also drew a technical when he appeared to grow frustrated with the aggressive play of Nurkic, who was throwing around his 280 pounds all evening. The 20-year-old from Bosnia Herzegovina finished with 11 points, 10 rebounds and no fouls (Shaw called his lack of fouls a \"miracle in itself\")."}
{"game_id": "0021400500", "chunk_id": "0021400500_017", "order": 17, "role": "body", "text": "Nurkic and Gasol jawed at each other at the end of the third quarter after Gasol's shot was blocked."}
{"game_id": "0021400500", "chunk_id": "0021400500_018", "order": 18, "role": "body", "text": "\"I really respect him. Him and his brother (Pau), really good players in this league and in Europe,\" Nurkic said. \"But I never look who's playing on the court."}
{"game_id": "0021400500", "chunk_id": "0021400500_019", "order": 19, "role": "body", "text": "\"In this league, I just play how I need to for my team to win.\""}
{"game_id": "0021400500", "chunk_id": "0021400500_021", "order": 21, "role": "body", "text": "\"He's going to be a real good player,\" Gasol said."}
{"game_id": "0021400500", "chunk_id": "0021400500_022", "order": 22, "role": "body", "text": "The Grizzlies, who were missing Zach Randolph (sore right knee), had won three in a row. The team is 1-1 in 2015 after going a league-best 60-23 in the 2014 calendar year."}
{"game_id": "0021400500", "chunk_id": "0021400500_023", "order": 23, "role": "body", "text": "\"We're not a team that's perfected anything,\" Conley said. \"We're going to keep learning and keep figuring this thing out as the season goes on.\""}
{"game_id": "0021400500", "chunk_id": "0021400500_025", "order": 25, "role": "body", "text": "Grizzlies: Assistant Jeff Bzdelik coached the Nuggets from 2002-05. \"He's a high-character guy, a really, really good coach,\" Joerger said. ... Asked how close Randolph was to a return, Joerger simply responded, \"hard to tell.\"  ... Memphis was 2 of 14 from 3-point range."}
{"game_id": "0021400500", "chunk_id": "0021400500_026", "order": 26, "role": "body", "text": "Nuggets: Backup guard Nate Robinson sprained his right wrist when he fell to the floor after a hard foul by Vince Carter midway through the second quarter. Robinson made the layup and then took his foul shot -- along with another for a flagrant-1 call on Carter -- by shooting left handed. He missed both and didn't play the rest of the game."}
{"game_id": "0021400500", "chunk_id": "0021400500_028", "order": 28, "role": "body", "text": "Grizzlies: Host New York on Monday."}
{"game_id": "0021400500", "chunk_id": "0021400500_029", "order": 29, "role": "body", "text": "Nuggets: Visit Minnesota on Monday."}
{"game_id": "0021400500", "chunk_id": "0021400500_031", "order": 31, "role": "body", "text": "Before the game, Joerger gave Shaw a vote of confidence for his work this season with a banged-up roster. Shaw is missing forward Danilo Gallinari (right knee) and center JaVale McGee (strained lower left leg)."}
{"game_id": "0021400500", "chunk_id": "0021400500_032", "order": 32, "role": "closing", "text": "\"If you took the highest two paid players off of our roster right now, Marc and Zach, we'd look a lot different,\" Joerger said. \"I text Brian all the time. I think Brian's doing a good job.\""}
