{"game_id": "0021700168", "chunk_id": "0021700168_001", "order": 1, "role": "lead", "text": "DENVER --  In a tight game down the stretch, there was no letting up by Emmanuel Mudiay and the Denver Nuggets."}
{"game_id": "0021700168", "chunk_id": "0021700168_002", "order": 2, "role": "body", "text": "Mudiay scored 10 of his 21 points in the fourth quarter, including the go-ahead 3-pointer midway through the period, and the Nuggets beat the Oklahoma City Thunder 102-94 on Thursday night."}
{"game_id": "0021700168", "chunk_id": "0021700168_003", "order": 3, "role": "body", "text": "\"What I like about our team tonight, when we were up in that fourth quarter, we didn't play not to lose,\" Nuggets coach Michael Malone said. \"We stayed aggressive. We kept the pressure on. That's really big because I think when you get tentative down the stretch, that's when things kind of fall apart. And I think Emmanuel was a big part of that attack, him, Paul (Milsap), Gary (Harris), Nikola (Jokic), they were terrific on both ends of the floor.\""}
{"game_id": "0021700168", "chunk_id": "0021700168_004", "order": 4, "role": "body", "text": "Milsap added 17 points and Jokic had 15 points to go with 11 rebounds for Denver. The Nuggets snapped a five-game losing streak at home to the Thunder, including a 106-105 setback April 9 on a last-second 3-pointer by Russell Westbrook that eliminated Denver from playoff contention."}
{"game_id": "0021700168", "chunk_id": "0021700168_005", "order": 5, "role": "body", "text": "\"We had a hard time beating that team last year and we all know that,\" Malone said. \"So to pull a close game out against a talented team -- they're struggling right now but they're a talented team -- I don't know if we win that game last year. It was just a heck of a win with great defense.\""}
{"game_id": "0021700168", "chunk_id": "0021700168_006", "order": 6, "role": "body", "text": "Carmelo Anthony, who spent his first 7 1-2 years in the league in Denver before being traded to the New York Knicks in 2011, had 28 points to lead the Thunder, who acquired Anthony in a pre-season trade. Paul George and Westbrook each added 13 points for the Thunder, who lost their fourth in a row."}
{"game_id": "0021700168", "chunk_id": "0021700168_007", "order": 7, "role": "body", "text": "\"Every season you go through adversity and right now we're going through ours,\" Westbrook said."}
{"game_id": "0021700168", "chunk_id": "0021700168_008", "order": 8, "role": "body", "text": "Neither the Thunder nor the Nuggets were able to gain separation on the other in a tightly contested third quarter and the teams went into the final period tied at 75."}
{"game_id": "0021700168", "chunk_id": "0021700168_009", "order": 9, "role": "body", "text": "The game was tied at 82 when Mudiay connected on a 3-pointer with 7:35 remaining, triggering a 7-0 burst by Denver."}
{"game_id": "0021700168", "chunk_id": "0021700168_010", "order": 10, "role": "body", "text": "Oklahoma City fought back to within 93-90 but Milsap answered by converting a three-point play with 2:09 left to rebuild Denver's lead to six."}
{"game_id": "0021700168", "chunk_id": "0021700168_011", "order": 11, "role": "body", "text": "The Thunder got no closer than four points the rest of the way."}
{"game_id": "0021700168", "chunk_id": "0021700168_012", "order": 12, "role": "body", "text": "\"They did a good job of keeping us off the boards in the first half,\" Harris said. \"But we picked it up and we didn't turn the ball over as much in the second half and we were able to close out the game. Emmanuel came off the bench and he made some key shots in that second half that definitely pushed us over the edge.\""}
{"game_id": "0021700168", "chunk_id": "0021700168_013", "order": 13, "role": "body", "text": "Trailing by as many as 11 points earlier, the Nuggets closed to within 53-51 at the half on a driving layup by Milsap in the final seconds of the second quarter."}
{"game_id": "0021700168", "chunk_id": "0021700168_014", "order": 14, "role": "body", "text": "Anthony had 15 of his points in the first half to help the Thunder maintain their early edge."}
{"game_id": "0021700168", "chunk_id": "0021700168_016", "order": 16, "role": "body", "text": "The Thunder dropped to 0-6 against Western Conference teams this season. It's the longest drought against conference teams to start a season in the team's history. Said Anthony: \"It could go two ways: We could let this sit in our heads and think about it or put it behind and move forward. That's the beauty of this league and having so many games. I know we complain about back-to-backs but sometimes the back-to-backs are in our favor as players because you get to put that game behind you.\""}
{"game_id": "0021700168", "chunk_id": "0021700168_018", "order": 18, "role": "body", "text": "The Nuggets have won six of their last eight games and improved to 7-5 on the year. It's the first time in six years they're at least two games over .500 in the first 12 games of a season. They opened 8-4 in 2011-12."}
{"game_id": "0021700168", "chunk_id": "0021700168_020", "order": 20, "role": "body", "text": "Thunder: Westbrook was treated for a facial cut early in the game after taking an elbow to the face while guarding Jokic. The injury did not prevent him from continuing to play. ... Beyond his impact on the floor, Anthony has proven to be a steadying influence in the locker room. \"He's got a world of experience and a world of wisdom to share with our guys,\" coach Billy Donovan said prior to the game."}
{"game_id": "0021700168", "chunk_id": "0021700168_021", "order": 21, "role": "body", "text": "Nuggets: F Juancho Hernangomez remains sidelined indefinitely because of a bout of mononucleosis. He has missed the last 10 games."}
{"game_id": "0021700168", "chunk_id": "0021700168_023", "order": 23, "role": "body", "text": "Thunder: Head home to complete a back-to-back Friday night against the Los Angeles Clippers."}
{"game_id": "0021700168", "chunk_id": "0021700168_024", "order": 24, "role": "body", "text": "Nuggets: Wrap up a season-long six-game homestand on Saturday night when they host Orlando."}
{"game_id": "0021700168", "chunk_id": "0021700168_026", "order": 26, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
