{"game_id": "0021400917", "chunk_id": "0021400917_001", "order": 1, "role": "lead", "text": "HOUSTON -- James Harden has been so good this season that Houston Rockets coach Kevin McHale has come to expect performances like the one Harden had Friday night."}
{"game_id": "0021400917", "chunk_id": "0021400917_002", "order": 2, "role": "body", "text": "Harden had 38 points, 12 rebounds and 12 assists for his third triple-double this season, and the Rockets snapped a two-game skid with a 103-93 win over the Detroit Pistons.\n\"I think it's good when you're blasé about a night like this,\" McHale said.\nIt was the 27th 30-point game this season for Harden, who is second in the NBA in scoring. His three triple-doubles this season are the most by a Rocket since Clyde Drexler also had three in 1996-97.\nHarden has had a trying week that started with serving a one-game suspension for kicking LeBron James and included the league admitting it missed a call that would have sent him to the line in the final seconds of a two-point loss to Memphis on Wednesday.\n\"It was all about having fun, especially when your back is up against the wall after losing two tough games in a row,\" Harden said. \"You've got to get a win. So we go out there and have fun and execute, and we play together.\"\nRockets general manager Daryl Morey congratulated the MVP candidate on his \"distinguished game\" via Twitter, seemingly a response to Golden State coach Steve Kerr, who said Thursday that \"I don't think it's our job\" to promote Warriors star Stephen Curry in the award race:"}
{"game_id": "0021400917", "chunk_id": "0021400917_003", "order": 3, "role": "closing", "text": "A 14-2 run by Detroit with most of Houston's starters on the bench cut the deficit to 99-89 with 2 1/2 minutes left. Harden and crew returned, and Detroit got within eight on a dunk by Shawne Williams. But Harden made a pair of free throws before and after a dunk by Reggie Jackson to secure the victory.\nThe Pistons missed their first 11 shots of the fourth quarter and didn't score until a pair of free throws by Jackson with about eight minutes left.\nGreg Monroe had 19 points and Jackson had 17 for Detroit, which has lost five in a row.\n\"Our offense is just a major struggle right now,\" Detroit coach Stan Van Gundy said. \"We got better shots (Friday), but we just couldn't make anything.\"\nCorey Brewer scored five points in Houston's big run to open the fourth quarter, and Terrence Jones had blocks on back-to-back shots by Andre Drummond and Jodie Meeks in that stretch.\nHarden loved the way the team played at the end of the third quarter and beginning of the fourth.\n\"Definitely,\" he said. \"We were moving. We were cutting. We were playing our brand of basketball.\"\nThe Pistons went on an 8-2 run to cut the lead to 60-58 with about 7 1/2 minutes left in the third quarter. McHale called a timeout, and the Rockets responded with an 11-4 run, with seven points from Jones, to make it 71-62 about four minutes later. Detroit missed four 3-pointers in that span, including three in a row near the end of it.\nThe Pistons got going after that, using a 7-2 run, with 3s by Meeks and Tayshaun Prince, to get within four at 73-69. But Houston ended the quarter with seven straight points to make it 80-69 entering the fourth quarter.\nHarden capped it with five straight points, including a three-point play on which he crossed over Spencer Dinwiddie and hit a long 2-pointer before making the free throw as the home crowd chanted \"MVP, MVP.\"\nDetroit cut the lead to four on a reverse layup by Williams with three minutes left in the second quarter before Houston used an 8-2 run to push the lead to 54-44 with 30 seconds left in the first half.\nMonroe made a pair of free throws after that to make it 54-46 at halftime.\nTIP-INS\nPistons: Detroit has lost nine of the past 11 against Houston. ... Drummond had 21 rebounds.\nRockets: Jones sat out for a few minutes after injuring his right hip early in the second quarter but returned about a minute before halftime. ... Houston opens a four-game road trip Saturday and doesn't play at home again until March 17. ... Harden has five triple-doubles in his career.\nSMITH'S SUCCESS\nJosh Smith, signed by the Rockets in December after being released by the Pistons, had eight points and seven rebounds in the second meeting with his former team.\nVan Gundy was complimentary of Smith's work in Houston.\n\"I think that when they moved him to the bench, he's played very well in that role for them,\" Van Gundy said. \"Rebounding the ball, his shooting percentage has gone up, he's been more efficient. I think he's given them a good boost off the bench. ... It was a good pickup for them, and I think he's helped them.\"\nUP NEXT\nPistons: Host Charlotte on Sunday.\nRockets: Visit Denver on Saturday.\nThe Associated Press contributed to this report."}
