{"game_id": "0021700936", "chunk_id": "0021700936_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  Even without scoring a point, rookie Jonathan Isaac had his Orlando Magic teammates talking about his impact on Saturday night's win over the Memphis Grizzlies."}
{"game_id": "0021700936", "chunk_id": "0021700936_002", "order": 2, "role": "body", "text": "Evan Fournier broke a tie on a long 3-pointer with 22.5 seconds left, and Isaac helped preserve Orlando's lead with his third blocked shot in a 107-100 victory that stretched the Memphis Grizzlies' losing streak to 13 games."}
{"game_id": "0021700936", "chunk_id": "0021700936_003", "order": 3, "role": "body", "text": "\"It's really difficult to score over (Isaac),\" Fournier said of his 6-foot-10 teammate. \"If he stays in front of you, he's so long and he has a quick reaction time. It makes it difficult to get a shot off.\""}
{"game_id": "0021700936", "chunk_id": "0021700936_004", "order": 4, "role": "body", "text": "Fournier added two free throws with 8.2 seconds remaining to finish with 19 points. Nikola Vucevic also scored 19 for Orlando, which had six players in double figures. Isaac, who played 17 minutes and grabbed five rebounds, was not among them."}
{"game_id": "0021700936", "chunk_id": "0021700936_005", "order": 5, "role": "body", "text": "\"I'm not comfortable yet in terms of offense and all that,\" Isaac said. \"I'm still learning spacing and all these other things, but I'm comfortable defensively.\""}
{"game_id": "0021700936", "chunk_id": "0021700936_006", "order": 6, "role": "body", "text": "Isaac played in his second straight game after missing 24 with an ankle injury."}
{"game_id": "0021700936", "chunk_id": "0021700936_007", "order": 7, "role": "body", "text": "\"He impacted the game, and not just with his athleticism and length. There's a lot of long and athletic guys that get beat all the time,\" Magic coach Frank Vogel said. \"It's the instincts that make him special in my mind. Like we've been saying all along, he's NBA-ready right now.\""}
{"game_id": "0021700936", "chunk_id": "0021700936_008", "order": 8, "role": "body", "text": "Ben McLemore scored a game-high 20 for Memphis, which has the longest skid in the NBA this season. Jarell Martin added 19 points and 11 rebounds for a team that hasn't won since Jan. 29."}
{"game_id": "0021700936", "chunk_id": "0021700936_009", "order": 9, "role": "body", "text": "\"There's only so many moral victories that you can have,\" coach J.B. Bickerstaff said. \"At the end of the day this is results based, but it hurts them because they're giving so much.\""}
{"game_id": "0021700936", "chunk_id": "0021700936_010", "order": 10, "role": "body", "text": "Memphis led 84-77 early in the fourth quarter, the biggest lead for either team until Orlando (20-43) matched it in the final seconds."}
{"game_id": "0021700936", "chunk_id": "0021700936_011", "order": 11, "role": "body", "text": "A midcourt steal and dunk by Mario Hezonja with 8:10 to go sparked a Magic rally, and Aaron Gordon's layup with 3:17 left restored a one-point lead for Orlando. The lead changed hands six times in the final 3:03."}
{"game_id": "0021700936", "chunk_id": "0021700936_012", "order": 12, "role": "body", "text": "Memphis (18-44) entered as the NBA's lowest-scoring team (98.9 points per game) and played without its top three scorers."}
{"game_id": "0021700936", "chunk_id": "0021700936_014", "order": 14, "role": "body", "text": "The Grizzlies and Magic own half of this season's losing streaks of nine or more games. Memphis had an 11-game slide early in the season. Orlando has two nine-game skids and two seven-game losing streaks."}
{"game_id": "0021700936", "chunk_id": "0021700936_016", "order": 16, "role": "body", "text": "With a five-game trip out West coming up, the Magic faced the possibility of another long skid until winning Friday night against Detroit. \"We had lost seven straight, and if you lose these two games, then going out there on the West Coast feels a whole lot different than it does right now,\" Vogel observed."}
{"game_id": "0021700936", "chunk_id": "0021700936_018", "order": 18, "role": "body", "text": "Grizzlies: C Marc Gasol, who played 36 minutes in Friday night's loss to Denver, sat out along with G Mike Conley (left heel), C Deyonta Davis, G Tyreke Evans (right rib) and G Andrew Harrison (right wrist). ... G/F Wayne Selden Jr. (knee) was held out for the second game of a back-to-back."}
{"game_id": "0021700936", "chunk_id": "0021700936_019", "order": 19, "role": "body", "text": "Magic: Orlando is 10-7 when Isaac plays and 10-36 without him."}
{"game_id": "0021700936", "chunk_id": "0021700936_021", "order": 21, "role": "body", "text": "Grizzlies: At the San Antonio Spurs on Monday night."}
{"game_id": "0021700936", "chunk_id": "0021700936_022", "order": 22, "role": "body", "text": "Magic: At the Utah Jazz on Monday night."}
{"game_id": "0021700936", "chunk_id": "0021700936_024", "order": 24, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
