{"game_id": "0021200799", "chunk_id": "0021200799_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Brandon Knight carried the Detroit Pistons for three quarters, then watched as Greg Monroe and Jose Calderon closed it out."}
{"game_id": "0021200799", "chunk_id": "0021200799_002", "order": 2, "role": "body", "text": "Knight had 21 points before hyperextending his right knee late in the third quarter with the Pistons up by three."}
{"game_id": "0021200799", "chunk_id": "0021200799_003", "order": 3, "role": "body", "text": "Monroe stepped up and delivered, scoring 10 of his 19 points in the fourth quarter as the Pistons earned a much-needed 105-99 win over the Charlotte Bobcats on Wednesday night."}
{"game_id": "0021200799", "chunk_id": "0021200799_004", "order": 4, "role": "body", "text": "\"He had his momentum going down the stretch,\" said Bobcats guard Ramon Sessions. \"It's tough to stop a player like him when he's playing the way he did.\""}
{"game_id": "0021200799", "chunk_id": "0021200799_005", "order": 5, "role": "body", "text": "Calderon finished with 17 points, including two key free throws to seal the game with 21 seconds left."}
{"game_id": "0021200799", "chunk_id": "0021200799_006", "order": 6, "role": "body", "text": "Monroe and Calderon accounted for Detroit's final 15 points."}
{"game_id": "0021200799", "chunk_id": "0021200799_007", "order": 7, "role": "body", "text": "The Bobcats are now 20-100 since the start of the 2011-12 season."}
{"game_id": "0021200799", "chunk_id": "0021200799_008", "order": 8, "role": "body", "text": "The Pistons led 77-74 with 1:45 left in the third quarter when Knight was tripped up by Bobcats point guard Kemba Walker after Walker lost control of the ball in the lane. Walker was called for a foul and Knight remained on the court for several minutes before getting up and gingerly walking to the bench."}
{"game_id": "0021200799", "chunk_id": "0021200799_009", "order": 9, "role": "body", "text": "Knight would return briefly in the fourth quarter for one possession before injuring his ankle because he was overcompensating for his injured knee."}
{"game_id": "0021200799", "chunk_id": "0021200799_010", "order": 10, "role": "body", "text": "At that point, Knight walked to the bench with a noticeable limp and did not return."}
{"game_id": "0021200799", "chunk_id": "0021200799_011", "order": 11, "role": "body", "text": "Knight said he wanted to continue. He's uncertain if he'll play Friday night at Indiana."}
{"game_id": "0021200799", "chunk_id": "0021200799_012", "order": 12, "role": "body", "text": "\"You've got to listen to your body sometimes, but as a competitor when your team is in a close game, you always want to play, especially when you have an opportunity to put a team away,\" Knight said. \"As long as we won, I'm happy. That's what I'm most happy about.\""}
{"game_id": "0021200799", "chunk_id": "0021200799_013", "order": 13, "role": "body", "text": "The Pistons can thank Monroe for that."}
{"game_id": "0021200799", "chunk_id": "0021200799_014", "order": 14, "role": "body", "text": "The second-year center muscled his way into the lane for some key baskets late in the game against the less physical Bobcats."}
{"game_id": "0021200799", "chunk_id": "0021200799_015", "order": 15, "role": "body", "text": "\"We all stepped and played well tonight,\" Monroe said. \"We got into attack mode tonight. They drew up some plays for me in the post tonight. I just tried to make the right decision and took advantage of some one-on-one action and was able to make some plays at the rim.\""}
{"game_id": "0021200799", "chunk_id": "0021200799_016", "order": 16, "role": "body", "text": "Walker led all scorers with 24 points but had five turnovers."}
{"game_id": "0021200799", "chunk_id": "0021200799_017", "order": 17, "role": "body", "text": "Sessions had 18 points and eight assists off the bench for the Bobcats and Byron Mullens added 15 points."}
{"game_id": "0021200799", "chunk_id": "0021200799_018", "order": 18, "role": "body", "text": "The Bobcats cut the Pistons' 11-point lead to one late in the fourth quarter before Monroe scored on a spin move inside. Calderon put away the game with a pair of free throws with 21 seconds left after Mullens missed a jumper and Walker turned the ball over at the top of the key."}
{"game_id": "0021200799", "chunk_id": "0021200799_019", "order": 19, "role": "body", "text": "The Pistons were coming off a 14-point loss to the Memphis Grizzlies on Tuesday night, a defeat that coach Lawrence Frank called \"a real stinker.\""}
{"game_id": "0021200799", "chunk_id": "0021200799_020", "order": 20, "role": "body", "text": "He felt better about this one, calling it a \"gritty win.\""}
{"game_id": "0021200799", "chunk_id": "0021200799_021", "order": 21, "role": "body", "text": "\"It was a good result,\" Frank said. \"We got off to a good start, which always helps. We executed well down the stretch. Showing our execution down the stretch. Our patience, our poise and playing through a little bit of adversity.\""}
{"game_id": "0021200799", "chunk_id": "0021200799_022", "order": 22, "role": "body", "text": "The Bobcats entered the fourth quarter down 78-77 but the Pistons quickly built a double-digit lead after Kyle Singler scored off an offensive rebound with seven minutes left in the game."}
{"game_id": "0021200799", "chunk_id": "0021200799_023", "order": 23, "role": "body", "text": "The Bobcats clawed back behind a pair of 3-pointers from Mullens and two nasty dunks by rookie Michael Kidd-Gilchrist but couldn't seize the lead."}
{"game_id": "0021200799", "chunk_id": "0021200799_024", "order": 24, "role": "body", "text": "Charlotte dropped to 7-20 at home and 13-41 overall."}
{"game_id": "0021200799", "chunk_id": "0021200799_025", "order": 25, "role": "body", "text": "\"Our biggest problem was defensively, we weren't able to get stops,\" Walker said. \"We missed a lot of rotations and weren't talking to each other. We weren't in sync tonight. We've got to get that back.\""}
{"game_id": "0021200799", "chunk_id": "0021200799_026", "order": 26, "role": "body", "text": "Detroit hasn't looked sharp on the road, carrying a 6-18 record into the game. But the Pistons looked good early, jumping out to an 11-point first-quarter lead behind 11 points from Knight and three 3-pointers from Calderon."}
{"game_id": "0021200799", "chunk_id": "0021200799_027", "order": 27, "role": "body", "text": "Rodney Stuckey added 12 points and tied a season-high with seven rebounds off the bench for the Pistons."}
{"game_id": "0021200799", "chunk_id": "0021200799_028", "order": 28, "role": "closing", "text": "Game notes Carolina Panthers wide receiver Steve Smith took in Wednesday night's game. ... Tyrus Thomas, one of Charlotte's highest-paid players, was inactive for the fourth straight game. ... Walker has now topped 20 points in a game 18 times this season. ... Monroe tied a career high with three blocks."}
