{"game_id": "0021300684", "chunk_id": "0021300684_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- Memphis Grizzlies point guard Mike Conley is playing like an All-Star lately. Soon he'll find out if he gets to be one.\nConley had 27 points and 10 assists as the Grizzlies won their fourth straight by beating the slumping Sacramento Kings 99-89 on Wednesday night.\nOne night after outplaying Portland guard Damian Lillard in the Grizzlies' impressive 98-81 victory, Conley backed it up with an even better game against the Kings.\nConley, who will find out Thursday if he will be picked as one the Western Conference reserves, made 8 of 14 shots, hit two threes, and had two steals. He scored nine points in the fourth quarter.\n\"I won't let it bother me at all if I don't make it. It's something I can't control,\" Conley said. \"If it happens, it happens. I'm just playing ball right now. I'm playing at a high level and doing what my team needs me to do to do. I'm just playing to win.\"\nAnd the Grizzlies are doing plenty of that lately, winning for the ninth time in 10 games. They put their latest win away in the fourth quarter, getting six steals and converting several of them into easy layups.\nMemphis shot 11 of 18 and made 7 of 8 free throws in the fourth quarter in pulling away from the Kings, who cut the lead to four points at the 5:20 mark.\nThe Grizzlies had nine of their 24 assists in the fourth quarter.\nConley got plenty of help at the offensive end with Zach Randolph scoring six points and Tayshaun Prince getting six, all in the final three minutes.\n\"Our chemistry right now is as good as I've ever seen it,\" Memphis coach David Joerger said. \"Our confidence is high and we're really trying to stay in the moment.\"\nIsaiah Thomas scored 24 points and Rudy Gay had 23 for the Kings, who have lost five straight and seven of eight.\nDeMarcus Cousins, the Kings' leading scorer and rebounder, missed his fourth straight game with an ankle sprain. The Kings are hoping to have Cousins back for Friday's game in Dallas.\nGay, a former Memphis player, had missed the previous three games with an Achilles strain. He made a turnaround jumper in the fourth quarter to surpass 10,000 career points.\nHowever, Gay was limping some in the fourth quarter and also after the game in the locker room. But he expected to play against Dallas.\n\"I kind of tweaked my foot a little bit more. But it doesn't matter. I still feel that we could have won the game,\" Gay said. \"I was a little rusty. I'm not used to being out. I've actually been hurt one time in my career that actually made me miss more than one game.\n\"So it was a little tough on me. It's going to happen.\"\nKings coach Michael Malone has been critical of his team's defense for much of the season and Wednesday's game was no different.\n\"I told our team afterward that I am going to start playing guys who are willing to defend,\" Malone said. \"And if are not ready to defend ... I can no longer be a hypocrite. I've been a hypocrite the whole year. I got the job in June and I preached defense and that's what I believe in. We're one of the worst defensive teams in the league.\"\nRandolph had 18 points for the Grizzlies, who won their fifth straight road game and have a 12-7 record away from home. Marc Gasol had 12 points and Mike Miller scored 11.\nIt's no coincidence the Grizzlies' strong play has coincided with the return of Gasol, last year's Defensive Player of the Year who missed 23 games with a sprained knee. A protector of the rim, creative passer and reliable scorer, Gasol has been instrumental in the Grizzlies' 7-1 record since his return.\nIn the past two-plus week, the Grizzlies have beaten Phoenix, Houston twice, and Oklahoma City. Memphis finishes its three-game road trip Friday night in Minnesota.\n\"Ever since we got Marc back we've been playing better,\" Prince said. \"You can see our confidence coming back. He helps us so much on defense. He has a real presence back there. When he was out we couldn't get stops regularly like we are now.\"\nAfter making a corner jumper, Prince stole the ball from Gay and converted with a driving layup to give Memphis a 92-85 lead. A basket by Conley and a layup by Prince increased the lead to nine.\nRandolph came up with a loose ball and fed Davis for a dunk at the other end, concluding an 11-4 run and putting Memphis up 82-71. But the Kings came back and cut the lead to three on Thomas' 3-pointer at the 4:35 mark.\nConley had 11 points in the third quarter when the Grizzlies outscored Sacramento 21-17 and took a 69-63 lead into the fourth.\n\"I thought out defense was the key. There are very good offensive team that can score in bunches and has a lot of firepower,' Conley said. \"We're getting two, three, four stops in a row. We're not a high-octane team. But our defense is always consistent.\"\nGay had a strong second quarter with 10 points and was difficult to stop in the third as well. He came up with a loose ball near midcourt and sprinted toward the basket for an emphatic dunk that brought the crowd to its feet and put the Kings ahead 61-59.\nGasol scored eight points and the Grizzlies shot 52 percent and led 48-46 lead at intermission. Both Gay and Thomas had 12 points for the Kings.\nGame notes\nConley moved past Gay for the all-time franchise record for games played (480). ... Kings public address announcer Scott Moak was sick and missed his first game behind the mic in 12 years. His replacement was Jamie Coffee, a longtime Sacramento radio DJ. ... Memphis reserve forward Miller scored seven points in a 61-second span late in the second quarter."}
