{"game_id": "0021700656", "chunk_id": "0021700656_001", "order": 1, "role": "lead", "text": "TORONTO --  The Toronto Raptors have done a good job of avoiding lengthy losing streaks this season."}
{"game_id": "0021700656", "chunk_id": "0021700656_002", "order": 2, "role": "body", "text": "The struggling Detroit Pistons, meanwhile, are paying the price for making a habit of slow starts."}
{"game_id": "0021700656", "chunk_id": "0021700656_003", "order": 3, "role": "body", "text": "Jonas Valanciunas had 17 points and 16 rebounds, C.J. Miles scored 21 points and the Raptors beat the Pistons 96-91 Wednesday night."}
{"game_id": "0021700656", "chunk_id": "0021700656_004", "order": 4, "role": "body", "text": "Kyle Lowry scored 18 points and DeMar DeRozan had 17 to help the Raptors avoid their first three game losing streak of the season. Toronto lost at home to Golden State last Saturday before losing at Philadelphia on Monday."}
{"game_id": "0021700656", "chunk_id": "0021700656_005", "order": 5, "role": "body", "text": "\"We don't even want to lose two games in a row,\" DeRozan said. \"Tonight was one of those games where it could have made it three. We had to buckle down and understand we had to get back to protecting home court.\""}
{"game_id": "0021700656", "chunk_id": "0021700656_006", "order": 6, "role": "body", "text": "The Raptors improved to 16-3 at home, the second-best record in the league behind San Antonio (19-2). Toronto has not lost back-to-back games at Air Canada Centre since last Jan. 22 and 24, when they lost to Phoenix and the Spurs."}
{"game_id": "0021700656", "chunk_id": "0021700656_007", "order": 7, "role": "body", "text": "Andre Drummond had 25 points and 17 rebounds but the Pistons fell behind by 13 in the first quarter and lost for the seventh time in eight road games."}
{"game_id": "0021700656", "chunk_id": "0021700656_008", "order": 8, "role": "body", "text": "Avery Bradley scored 19 points, Tobias Harris had 12 and Langston Galloway 11 for the Pistons, who have lost seven of 10 overall."}
{"game_id": "0021700656", "chunk_id": "0021700656_009", "order": 9, "role": "body", "text": "\"In the last three quarters we fought hard but the first quarter counts, and there's just not very many times when we play a good defensive first quarter,\" Pistons coach Stan Van Gundy said. \"It's disappointing, you're working out of that hole.\""}
{"game_id": "0021700656", "chunk_id": "0021700656_010", "order": 10, "role": "body", "text": "The Raptors led by as many as 15 in the first half but trailed 79-75 early in the fourth quarter before rallying. Toronto took the lead for good on a layup by Miles at 6:43, the first basket in a 10-2 spurt that gave the Raptors a 90-83 lead with 4:47 left."}
{"game_id": "0021700656", "chunk_id": "0021700656_011", "order": 11, "role": "body", "text": "Van Gundy was frustrated by a pair of defensive miscues that gave Lowry and Miles 3-point opportunities during the pivotal stretch."}
{"game_id": "0021700656", "chunk_id": "0021700656_012", "order": 12, "role": "body", "text": "\"When it was winning time, we didn't do our job,\" Van Gundy said."}
{"game_id": "0021700656", "chunk_id": "0021700656_013", "order": 13, "role": "body", "text": "Bradley started for Detroit after missing Tuesday's practice because of a sore right groin, the same injury that kept him out of the final seven games in December. Following the game, Bradley said he is set to visit a specialist in Philadelphia on Thursday."}
{"game_id": "0021700656", "chunk_id": "0021700656_014", "order": 14, "role": "body", "text": "DeRozan scored 10 points in the first and Miles had seven as Toronto led 31-18 after one."}
{"game_id": "0021700656", "chunk_id": "0021700656_015", "order": 15, "role": "body", "text": "Detroit shot 6 for 20 in the first quarter and then made 14 of 25 attempts in the second and took advantage of nine Raptors turnovers to pull to 54-51 at halftime."}
{"game_id": "0021700656", "chunk_id": "0021700656_016", "order": 16, "role": "body", "text": "Drummond scored 11 of Detroit's 22 points in the third quarter. The score was tied 73-73 heading to the fourth."}
{"game_id": "0021700656", "chunk_id": "0021700656_017", "order": 17, "role": "body", "text": "\"We made it complicated on ourselves but we've got to give Detroit credit,\" Raptors coach Dwane Casey said. They were really getting into us, getting after us and doing something a little different defensively that threw our rhythm off a bit with their traps.\""}
{"game_id": "0021700656", "chunk_id": "0021700656_019", "order": 19, "role": "body", "text": "Pistons: F Stanley Johnson (strained right hip flexor) missed his third straight game. ... Guard Luke Kennard was available but did not play. Kennard missed Tuesday's practice because of a left thumb injury suffered in Monday's loss to Charlotte."}
{"game_id": "0021700656", "chunk_id": "0021700656_020", "order": 20, "role": "body", "text": "Raptors: G Fred VanVleet (right knee) was not available. ... Toronto has lost consecutive games four times this season. ... The Raptors had 21 turnovers, one shy of their season-worst."}
{"game_id": "0021700656", "chunk_id": "0021700656_022", "order": 22, "role": "body", "text": "The Raptors are 25-6 when recording 20 or more assists."}
{"game_id": "0021700656", "chunk_id": "0021700656_024", "order": 24, "role": "body", "text": "Drummond, who entered as the league's leading rebounder, has grabbed 10 or more boards in five straight games."}
{"game_id": "0021700656", "chunk_id": "0021700656_026", "order": 26, "role": "body", "text": "Detroit shot a season-worst 7 for 15 from the free-throw line, missing all three attempts in the fourth."}
{"game_id": "0021700656", "chunk_id": "0021700656_028", "order": 28, "role": "body", "text": "Pistons: Host Washington on Sunday. The Pistons have lost both meetings with the Wizards this season, and nine of the past 12 overall."}
{"game_id": "0021700656", "chunk_id": "0021700656_029", "order": 29, "role": "body", "text": "Raptors: Host San Antonio on Friday. Toronto has lost four straight against the Spurs."}
{"game_id": "0021700656", "chunk_id": "0021700656_031", "order": 31, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
