{"game_id": "0021700021", "chunk_id": "0021700021_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  LeBron James and Kevin Love took care of the paint. Once Kyle Korver got going from 3-point range, the Cleveland Cavaliers became nearly unstoppable."}
{"game_id": "0021700021", "chunk_id": "0021700021_002", "order": 2, "role": "body", "text": "James had 24 points and eight assists, Korver hit three straight 3s during a decisive third-quarter run and the Cavaliers beat the Bucks 116-97 on Friday night to spoil Milwaukee's home opener"}
{"game_id": "0021700021", "chunk_id": "0021700021_003", "order": 3, "role": "body", "text": "Love added 17 points and 12 rebounds for the Cavs. Their 15-5 spurt over the final 4:25 of the third quarter, sparked by Korver's long-range shooting, opened a 13-point lead. They led by double digits most of the rest the way."}
{"game_id": "0021700021", "chunk_id": "0021700021_004", "order": 4, "role": "body", "text": "\"Kyle, he came out and he really gave us a spark shooting the basketball,\" coach Tyronn Lue said. \"With his movement and him running around, he kind of throws defenses off.\""}
{"game_id": "0021700021", "chunk_id": "0021700021_005", "order": 5, "role": "body", "text": "And the Cavs handed Milwaukee its first loss of the season. The defending Eastern Conference champions opened with a second straight victory over an East contender after beating Boston in their home opener."}
{"game_id": "0021700021", "chunk_id": "0021700021_006", "order": 6, "role": "body", "text": "Milwaukee's Giannis Antetokounmpo had 34 points on 15-of-22 shooting, along with eight rebounds and eight assists. Malcolm Brogdon was the only other Buck in double digits with 16 points."}
{"game_id": "0021700021", "chunk_id": "0021700021_007", "order": 7, "role": "body", "text": "Antetokounmpo, as usual, wheeled his 6-foot-11 frame into the lane for an array of athletic buckets. But the Cavs limited nearly everyone else after doing a better job of closing out on 3-point shooters."}
{"game_id": "0021700021", "chunk_id": "0021700021_008", "order": 8, "role": "body", "text": "\"We executed the defensive plan that our coaches gave us. The results were us getting a big win on the road,\" James said."}
{"game_id": "0021700021", "chunk_id": "0021700021_009", "order": 9, "role": "body", "text": "The Cavs were 2 of 10 from 3-point range in the first half, but powered their way to a 55-49 halftime lead by attacking the basket. They were nearly unstoppable once they found their shot from long range."}
{"game_id": "0021700021", "chunk_id": "0021700021_010", "order": 10, "role": "body", "text": "\"Against good teams, you have to give up something, and the 2s weren't what hurt us. The 3s did,\" coach Jason Kidd said."}
{"game_id": "0021700021", "chunk_id": "0021700021_011", "order": 11, "role": "body", "text": "At one point, James hesitated for a couple seconds after being left alone at the top of the 3-point arc. Antetokounmpo then took a couple steps out from near the bucket before James hit the open look for a 101-86 lead with 6:19 left."}
{"game_id": "0021700021", "chunk_id": "0021700021_012", "order": 12, "role": "body", "text": "\"It's a lot tougher, we gave them a lot of open looks,\" Antetokounmpo said about defending the Cavs once they start hitting from 3. \"You're chasing guys to the 3-point line and the paint gets wide open so you get easy layups and it's hard to defend, it's harder to rebound.\""}
{"game_id": "0021700021", "chunk_id": "0021700021_014", "order": 14, "role": "body", "text": "Cavaliers: Six Cavs scored in double figures. ... After hitting at least 10 3s in all four meetings last season with Milwaukee, the Cavaliers finished 11 of 26 from behind the arc. They were 9 of 16 in the second half. ...  Cleveland missed its first eight 3-pointers before Korver hit two in a row in late in the second quarter. ... Love had an active first half with 13 points and six rebounds."}
{"game_id": "0021700021", "chunk_id": "0021700021_015", "order": 15, "role": "body", "text": "Bucks: Brogdon and Tony Snell (nine points) combined to start 3 of 5 from 3-point range in the first quarter, converting on open looks after defenders converged on driving teammates in the lane. The Bucks cooled off and went 3 of 16 the rest of the first half from behind the arc. ... The team signed F Joel Bolomboy to a two-way contract. The 6-foot-9 forward averaged 1.8 points and 1.4 rebounds as a rookie last season for Utah."}
{"game_id": "0021700021", "chunk_id": "0021700021_017", "order": 17, "role": "body", "text": "Lue is still figuring out the rotation with three new starters. Korver was one of the biggest beneficiaries after not taking a shot in 7 minutes in the opener against Boston. Korver finished with 17 points and was 5 of 6 from 3-point territory."}
{"game_id": "0021700021", "chunk_id": "0021700021_018", "order": 18, "role": "body", "text": "\"I hadn't had a shot yet. The season's got to start at some point, right?\" Korver asked rhetorically. \"Why not right now?\""}
{"game_id": "0021700021", "chunk_id": "0021700021_020", "order": 20, "role": "body", "text": "Cavs G Derrick Rose (12 points) had a sore ankle during a play in which he was fouled under the bucket by Bucks C Greg Monroe. Lue said that backup Jose Calderon would likely start on Saturday against Orlando."}
{"game_id": "0021700021", "chunk_id": "0021700021_022", "order": 22, "role": "body", "text": "The game marked the final opener in the Bucks' 30th season playing at the Bradley Center. A new arena on an adjacent lot is scheduled to open for next season."}
{"game_id": "0021700021", "chunk_id": "0021700021_024", "order": 24, "role": "body", "text": "Cavaliers: Host Orlando on Saturday night."}
{"game_id": "0021700021", "chunk_id": "0021700021_025", "order": 25, "role": "body", "text": "Bucks: Host Portland on Saturday night."}
{"game_id": "0021700021", "chunk_id": "0021700021_027", "order": 27, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
