{"game_id": "0021700571", "chunk_id": "0021700571_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  Banished to the bench with two fouls less than 90 seconds into the game, Jonas Valanciunas provided little help in the first half for the Toronto Raptors."}
{"game_id": "0021700571", "chunk_id": "0021700571_002", "order": 2, "role": "body", "text": "He sure made up for it in the third quarter."}
{"game_id": "0021700571", "chunk_id": "0021700571_003", "order": 3, "role": "body", "text": "Valanciunas scored all of his 20 points in the decisive third quarter and Toronto beat the Milwaukee Bucks for the second time this week, 129-110 on Friday night."}
{"game_id": "0021700571", "chunk_id": "0021700571_004", "order": 4, "role": "body", "text": "\"He was a beast down there, man,\" Milwaukee center John Henson said."}
{"game_id": "0021700571", "chunk_id": "0021700571_005", "order": 5, "role": "body", "text": "Toronto outscored Milwaukee 43-19 in the third quarter to win its fourth consecutive game, including a 131-127 overtime victory over the Bucks on Monday. The Raptors have won 10 of 12."}
{"game_id": "0021700571", "chunk_id": "0021700571_006", "order": 6, "role": "body", "text": "\"He didn't get off to a good start, but starting the second half he was masterful how he was getting position, using his size and strength in the paint and just doing a good job of rebounding the ball,\" Toronto coach Dwane Casey said of his 7-foot center."}
{"game_id": "0021700571", "chunk_id": "0021700571_007", "order": 7, "role": "body", "text": "Valanciunas picked up two fouls in the first 86 seconds of the game and was held scoreless without taking a shot in just five minutes during the first half. He played the entire third quarter, going 8 of 9 and grabbing nine of his 13 rebounds, as the Raptors extended a two-point halftime lead to 104-78."}
{"game_id": "0021700571", "chunk_id": "0021700571_008", "order": 8, "role": "body", "text": "\"It happens, you know, a quick two fouls,\" he said. \"I don't look for special motivation, I'm always motivated to play hard. That's what I did in the third quarter.\""}
{"game_id": "0021700571", "chunk_id": "0021700571_009", "order": 9, "role": "body", "text": "Despite sitting most of the first half, he had little trouble finding his rhythm to open the third quarter."}
{"game_id": "0021700571", "chunk_id": "0021700571_010", "order": 10, "role": "body", "text": "\"You've got to stay ready for 48 minutes,\" he said. \"When you're a pro, you can't relax and you can't look at what had happened. You have to look at where you can get an advantage and where you can do some damage. That's what I was thinking about.\""}
{"game_id": "0021700571", "chunk_id": "0021700571_011", "order": 11, "role": "body", "text": "Toronto made 17 of 25 shots in the quarter and outrebounded the Bucks, 18-2. The Raptors outscored Milwaukee 27-9 in the final six minutes of the quarter."}
{"game_id": "0021700571", "chunk_id": "0021700571_012", "order": 12, "role": "body", "text": "\"It just seemed like we took a step back when they turned it up,\" Milwaukee coach Jason Kidd said. \"We kind of like gave in.\""}
{"game_id": "0021700571", "chunk_id": "0021700571_013", "order": 13, "role": "body", "text": "Serge Ibaka scored 17 of his team-high 21 points in the first half, and DeMar DeRozan, who scored 52 points in the Raptors' win over Milwaukee on Monday, had 14 of his 20 in the third."}
{"game_id": "0021700571", "chunk_id": "0021700571_014", "order": 14, "role": "body", "text": "Valanciunas and DeRozan combined to make 14 of 16 shots and score 34 points in the third. DeRozan, Valanciunas and Kyle Lowry, who had 16 points, all rested in the fourth quarter."}
{"game_id": "0021700571", "chunk_id": "0021700571_015", "order": 15, "role": "body", "text": "Giannis Antetokounmpo scored 24 points for the Bucks. Malcolm Brogdon had 19 and Eric Bledsoe added 17."}
{"game_id": "0021700571", "chunk_id": "0021700571_016", "order": 16, "role": "body", "text": "Lowry hit a 27-footer to give Toronto the lead for good at 58-57 with 1:37 left in the second quarter. The Raptors led 61-59 at halftime."}
{"game_id": "0021700571", "chunk_id": "0021700571_018", "order": 18, "role": "body", "text": "The Bucks often double-teamed DeRozan to open the game after he scored a career high against them on Monday night. \"It was expected by me, by us as a team,\" DeRozan said. \"We made little adjustments once we felt it in the first quarter.\""}
{"game_id": "0021700571", "chunk_id": "0021700571_020", "order": 20, "role": "body", "text": "Kidd said Antetokounmpo leading the NBA in All-Star Game fan voting was \"well deserved. It shows all his hard work. He is a guy that everyone wants to see play, no matter whether you're in Milwaukee or on the road.\" Antetokounmpo had 836,416 votes in the first round of voting, just ahead of LeBron James, who had 856,080."}
{"game_id": "0021700571", "chunk_id": "0021700571_022", "order": 22, "role": "body", "text": "Raptors: It was Toronto's final trip to the BMO Harris Bradley Center. The team finished 17-25 in regular-season games. A new Bucks arena is set to open next season. ... Toronto had 18 second-chance points to Milwaukee's five."}
{"game_id": "0021700571", "chunk_id": "0021700571_023", "order": 23, "role": "body", "text": "Bucks: Toronto's 43 points in the third quarter were the most allowed by Milwaukee in a quarter this season."}
{"game_id": "0021700571", "chunk_id": "0021700571_025", "order": 25, "role": "body", "text": "Raptors: At Brooklyn on Monday."}
{"game_id": "0021700571", "chunk_id": "0021700571_026", "order": 26, "role": "body", "text": "Bucks: At Washington on Saturday."}
{"game_id": "0021700571", "chunk_id": "0021700571_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
