{"game_id": "0021200050", "chunk_id": "0021200050_001", "order": 1, "role": "lead", "text": "CHICAGO -- For nearly three quarters, the Orlando Magic looked like the team that has been the surprise of the young NBA season."}
{"game_id": "0021200050", "chunk_id": "0021200050_002", "order": 2, "role": "body", "text": "Then, the Chicago Bulls found the right mix."}
{"game_id": "0021200050", "chunk_id": "0021200050_003", "order": 3, "role": "body", "text": "Luol Deng scored 15 of his 23 points in the second half to lead the Chicago Bulls to a 99-93 win over Orlando on Tuesday night, the Magic's first loss of the season."}
{"game_id": "0021200050", "chunk_id": "0021200050_004", "order": 4, "role": "body", "text": "Deng and Nate Robinson keyed a 15-2 second-half burst in which Chicago turned a five-point deficit into an eight-point lead. Robinson hit two straight jumpers to put Chicago ahead 74-70 early in the fourth, the Bulls' first lead since midway through the third period."}
{"game_id": "0021200050", "chunk_id": "0021200050_005", "order": 5, "role": "body", "text": "\"We executed well,\" Deng said. \"I thought Nate did a good job of looking for his shot and running the plays we were calling.\""}
{"game_id": "0021200050", "chunk_id": "0021200050_006", "order": 6, "role": "body", "text": "Deng teamed with fellow starter Joakim Noah and three reserves for most of the run, with Robinson, Jimmy Butler and Taj Gibson making key contributions."}
{"game_id": "0021200050", "chunk_id": "0021200050_007", "order": 7, "role": "body", "text": "\"The guys we had in, Taj and Jimmy, gave us a big lift,\" Bulls coach Tom Thibodeau said. \"Nate also was really good out there. I thought in the second half, we played a lot harder.\""}
{"game_id": "0021200050", "chunk_id": "0021200050_008", "order": 8, "role": "body", "text": "Noah had 20 points, nine rebounds and five blocks for Chicago, while Robinson added 11 points and six assists off the bench. Robinson's layup with 2:35 to play put Chicago up 91-81, its biggest lead of the game."}
{"game_id": "0021200050", "chunk_id": "0021200050_009", "order": 9, "role": "body", "text": "\"(Winning is) all that counts, but we need to play better,\" Noah said. \"This isn't going to cut it against a better team. We've just got to keep fighting."}
{"game_id": "0021200050", "chunk_id": "0021200050_010", "order": 10, "role": "body", "text": "\"They're an underrated team. I feel like they've got a lot of offensive firepower, they spread the floor. It was a good win tonight.\""}
{"game_id": "0021200050", "chunk_id": "0021200050_011", "order": 11, "role": "body", "text": "Arron Afflalo led the Magic with 28 points, 19 in the second half. E'Twaun Moore added a career-high 17 points."}
{"game_id": "0021200050", "chunk_id": "0021200050_012", "order": 12, "role": "body", "text": "\"Our lull offensively gave them an opportunity to hit some shots in the fourth quarter,\" Afflalo said. \"It's unfortunate, because it was a game I thought we could have won.\""}
{"game_id": "0021200050", "chunk_id": "0021200050_013", "order": 13, "role": "body", "text": "Glen Davis, who entered the game fourth in the NBA with 25.5 points per game, scored 16 points but shot just 7 of 22 from the floor and fouled out."}
{"game_id": "0021200050", "chunk_id": "0021200050_014", "order": 14, "role": "body", "text": "\"The Bulls did a good job of getting us out of our stuff,\" Davis said. \"You have to give them credit. They're a great defensive team.\""}
{"game_id": "0021200050", "chunk_id": "0021200050_015", "order": 15, "role": "body", "text": "Nikola Vucevic had 16 points and 10 rebounds for the Magic, who had won three of their previous four in Chicago entering the game."}
{"game_id": "0021200050", "chunk_id": "0021200050_016", "order": 16, "role": "body", "text": "Orlando had started the season 2-0, surprising many around the league after the Magic traded star center Dwight Howard to the Los Angeles Lakers over the summer. The Magic came up short in their bid to go 3-0 for just the fourth time in franchise history."}
{"game_id": "0021200050", "chunk_id": "0021200050_017", "order": 17, "role": "body", "text": "\"We can't play one-on-one basketball,\" Orlando coach Jacque Vaughn said. \"When we shared the basketball, we got good looks. But when we turn it into a one-on-one contest, we're not going to get good looks.\""}
{"game_id": "0021200050", "chunk_id": "0021200050_018", "order": 18, "role": "body", "text": "The Magic led 70-65 when the Bulls started their decisive run late in the third quarter. Deng tied the game with a jumper with 10:58 to play. Later, Robinson capped the run with a layup in transition."}
{"game_id": "0021200050", "chunk_id": "0021200050_019", "order": 19, "role": "body", "text": "\"I think we wanted it more,\" Robinson said. \"I think at the end, we were more gritty. Coach said whatever it takes to get the win. So tonight, we had to gut it out.\""}
{"game_id": "0021200050", "chunk_id": "0021200050_020", "order": 20, "role": "body", "text": "Orlando trimmed the lead to four on Afflalo's 3 in the final minute, but Chicago held on down the stretch. Gibson's dunk and free throw with 39 seconds remaining iced it for the Bulls."}
{"game_id": "0021200050", "chunk_id": "0021200050_021", "order": 21, "role": "body", "text": "The Magic pushed the lead to seven in the second quarter behind seven points from Moore before Richard Hamilton closed the lead to 48-45 with a pull-up jumper in transition to close the first half."}
{"game_id": "0021200050", "chunk_id": "0021200050_022", "order": 22, "role": "body", "text": "J.J. Redick continued his hot shooting early with a 3-pointer and a midrange jumper during the spree. Redick hit 16 of 25 shots in Orlando's first two games."}
{"game_id": "0021200050", "chunk_id": "0021200050_023", "order": 23, "role": "body", "text": "After making his first two shots, Redick hit just one of the next seven before hitting a 3-pointer in the fourth quarter, with Butler sticking to him for most of the second half."}
{"game_id": "0021200050", "chunk_id": "0021200050_024", "order": 24, "role": "body", "text": "\"We just found a way,\" Noah said. \"We fought hard at the end. Jimmy (Butler) gave us a great spark.\""}
{"game_id": "0021200050", "chunk_id": "0021200050_025", "order": 25, "role": "body", "text": "The Bulls needed the win after losing to New Orleans on Saturday and with Oklahoma City visiting the United Center on Thursday. The Bulls have not lost two straight at home since a five-game skid from March 1 to March 19, 2010."}
{"game_id": "0021200050", "chunk_id": "0021200050_026", "order": 26, "role": "body", "text": "\"This was a tough game,\" Deng said. \"They're playing well, and we lost our last game. It's one of those we needed to win. You don't want to lose two, then we've got Oklahoma (City) coming in. The fourth quarter was really good for the team.\""}
{"game_id": "0021200050", "chunk_id": "0021200050_027", "order": 27, "role": "closing", "text": "Game notes Orlando point guard Jameer Nelson missed his second straight game because of a strained right hamstring and groin. He's day to day. ... While the game was announced as a sellout, there were many more empty seats than usual at the United Center. In addition to the elections and the absence of Bulls star Derrick Rose, the weather was cold and drizzly in Chicago. ... Bulls Hall of Famer Scottie Pippen sat courtside with his wife during the game after playing basketball with President Barack Obama earlier in the day. ... Despite the loss, Orlando was 8-for-19 from 3-point range. The Magic entered the game with a 53.8 percent mark behind the arc."}
