{"game_id": "0021701048", "chunk_id": "0021701048_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  For the Houston Rockets, finally facing a challenge from Minnesota and a hostile crowd on the road was a good test to prepare for the postseason."}
{"game_id": "0021701048", "chunk_id": "0021701048_002", "order": 2, "role": "body", "text": "The Timberwolves, meanwhile, are left holding on for dear life in a tightening playoff race."}
{"game_id": "0021701048", "chunk_id": "0021701048_003", "order": 3, "role": "body", "text": "James Harden had 34 points and 12 assists and helped the Rockets fend off a fourth-quarter rally and beat the Timberwolves 129-120 on Sunday night. The win was Houston's 26th in 28 games, and it dropped Minnesota into the eighth playoff spot in the Western Conference."}
{"game_id": "0021701048", "chunk_id": "0021701048_004", "order": 4, "role": "body", "text": "Houston led by as many as 25 before the Wolves, who started the day in a three-way tie for the West's fifth spot, pulled within five in the fourth. Harden had 11 points in the final 6:34, including a 3-pointer with 58 seconds left that effectively secured the win."}
{"game_id": "0021701048", "chunk_id": "0021701048_005", "order": 5, "role": "body", "text": "\"It's good for us, man,\" Harden said. \"We needed it. We needed to be in games like that. Obviously, having a big lead and losing it, we can't let it happen, but if it does we've got to make sure we can keep our composure and get a good shot every time.\""}
{"game_id": "0021701048", "chunk_id": "0021701048_006", "order": 6, "role": "body", "text": "Just another day for the West's top team, which also got 16 points apiece from Chris Paul and Clint Capela."}
{"game_id": "0021701048", "chunk_id": "0021701048_007", "order": 7, "role": "body", "text": "\"We get a little stagnant here and there, but we're figuring it out,\" Paul said. \"We haven't played too many close games all season long, so down the stretch we need that stuff.\""}
{"game_id": "0021701048", "chunk_id": "0021701048_008", "order": 8, "role": "body", "text": "If these two teams do end up facing each other in the first round, the Wolves will need a much more consistent effort."}
{"game_id": "0021701048", "chunk_id": "0021701048_009", "order": 9, "role": "body", "text": "\"We put ourselves in too big of a hole, you can't do that,\" said coach Tom Thibodeau, who bemoaned his team's lack of intensity in the first half. \"With where we are right now, the fight has to be greater.\""}
{"game_id": "0021701048", "chunk_id": "0021701048_010", "order": 10, "role": "body", "text": "Jeff Teague led Minnesota with 23 points, Andrew Wiggins had 21, and Karl-Anthony Towns and Jamal Crawford each added 20."}
{"game_id": "0021701048", "chunk_id": "0021701048_011", "order": 11, "role": "body", "text": "\"I know for me personally, I don't look at it every day because it's going to change 10 more times before the season is over with, and you'll drive yourself crazy,\" Crawford said of the playoff standings.  \"Especially when you can kind of control your own destiny. If you do what you have to do, you don't have to worry about what everyone else is doing.\""}
{"game_id": "0021701048", "chunk_id": "0021701048_012", "order": 12, "role": "body", "text": "The game was seemingly over by halftime. Houston shot 63 percent, hit 11 3-pointers and led by as many as 24 in the first half while turning the ball over only three times. Harden had 10 assists in the first half, when the Wolves were as close as three before Houston reeled off a 12-0 run and didn't allow Minnesota to recover."}
{"game_id": "0021701048", "chunk_id": "0021701048_013", "order": 13, "role": "body", "text": "Minnesota's 19-6 run made it 115-110 with 3:58 to play before Trevor Ariza hit a 3, and the Rockets were able to answer every Wolves bucket to hold off the rally."}
{"game_id": "0021701048", "chunk_id": "0021701048_014", "order": 14, "role": "body", "text": "\"We've got a team that's fighting for positioning in the playoffs, and they're going to come back and they're going to make a run,\" Harden said. \"We just held our composure and closed the game out.\""}
{"game_id": "0021701048", "chunk_id": "0021701048_016", "order": 16, "role": "body", "text": "The Wolves got a burst of energy after a fourth-quarter scuffle between Gorgui Dieng, Paul and Gerald Green. Green was ejected for coming to Paul's defense after a frustrated Dieng pushed him down after a foul. With the pumped-up crowd chanting \"Gor-Gui!\" Derrick Rose had back-to-back layups to pull the Wolves to 109-102. But Paul hit a jumper with Crawford in his face, and Harden easily drove past Dieng for a layup to give the Rockets some breathing room."}
{"game_id": "0021701048", "chunk_id": "0021701048_017", "order": 17, "role": "body", "text": "Dieng said Paul gave him a cheap shot. Green, though, sounded contrite. \"I learned my lesson, got ejected, try not to get that again and hopefully we're going to move forward from this,\" Green said."}
{"game_id": "0021701048", "chunk_id": "0021701048_019", "order": 19, "role": "body", "text": "Rose had his best performance since joining the Wolves on March 8. He finished with 14 points on 6-of-11 shooting in 19 minutes, and was matched up against Harden in the fourth. \"He's got to keep doing what he's doing,\" Thibodeau said."}
{"game_id": "0021701048", "chunk_id": "0021701048_021", "order": 21, "role": "body", "text": "Rockets: It wasn't Houston's first 70-point half against the Wolves this season. The Rockets scored 72 in the second half during last month's win in Minneapolis. ... Capela had 12 rebounds for his 36th double-double of the season and Harden had his 27th."}
{"game_id": "0021701048", "chunk_id": "0021701048_022", "order": 22, "role": "body", "text": "Timberwolves: All-Star Jimmy Butler, who hurt his knee in the last matchup with Houston on Feb. 23, spoke to reporters before the game for the first time since the injury and said he's targeting a return before the end of the regular season. He had meniscus surgery on Feb. 25, with an initial recovery timetable of four to six weeks. ... Towns had 18 rebounds and notched his league-leading 59th double-double of the season. ... Crawford had his fourth 20-point game of the season."}
{"game_id": "0021701048", "chunk_id": "0021701048_024", "order": 24, "role": "body", "text": "Rockets: at Portland on Tuesday night."}
{"game_id": "0021701048", "chunk_id": "0021701048_025", "order": 25, "role": "closing", "text": "Timberwolves: against the Los Angeles Clippers on Tuesday night."}
