{"game_id": "0021700973", "chunk_id": "0021700973_001", "order": 1, "role": "lead", "text": "MIAMI --  Hassan Whiteside walked off the court thrilled. Joel Embiid walked off vowing to remember."}
{"game_id": "0021700973", "chunk_id": "0021700973_002", "order": 2, "role": "body", "text": "Whiteside scored 26 points, Dwyane Wade added 16 and the Miami Heat moved a step closer to the playoffs by beating the Philadelphia 76ers 108-99 on Thursday night. The Heat stayed No. 7 in the Eastern Conference, moving within a game of No. 6 Philadelphia."}
{"game_id": "0021700973", "chunk_id": "0021700973_003", "order": 3, "role": "body", "text": "\"We weren't about to lose this one,\" Whiteside said."}
{"game_id": "0021700973", "chunk_id": "0021700973_004", "order": 4, "role": "body", "text": "The Heat and 76ers split four games this season, Miami outscoring Philadelphia 409-407. Josh Richardson scored 13 points, Tyler Johnson had 12 and Kelly Olynyk added 10 for Miami, which moved 5 1/2 games clear of ninth-place Detroit in the East race."}
{"game_id": "0021700973", "chunk_id": "0021700973_005", "order": 5, "role": "body", "text": "The Heat outplayed the 76ers when it mattered most, outscoring them 35-25 in the fourth quarter and shooting 13 for 18 to Philadelphia's 7 for 22."}
{"game_id": "0021700973", "chunk_id": "0021700973_006", "order": 6, "role": "body", "text": "\"This team understands,\" Wade said. \"I haven't been here for all of them, but this team has been in 40-something close games. This team knows what needs to be done. It's great when you have multiple guys late in games that you can go to.\""}
{"game_id": "0021700973", "chunk_id": "0021700973_007", "order": 7, "role": "body", "text": "While the finish wasn't to Philadelphia's liking, it was a third-quarter moment -- a play where Whiteside and Embiid tangled briefly, with the Heat center appearing to give the All-Star a shove in the back -- that had the 76ers' attention after the game."}
{"game_id": "0021700973", "chunk_id": "0021700973_008", "order": 8, "role": "body", "text": "\"He tried to hit me in the back, which is kind of dirty because of the fact that I've had back problems,\" Embiid said of Whiteside, who he's battled both on the court and on Twitter after past meetings. \"We're going to see about that. I won't forget about that. ... He hits pretty soft, so I didn't feel anything. But just the action of him trying to like do that, I think it's pretty messed up. \""}
{"game_id": "0021700973", "chunk_id": "0021700973_009", "order": 9, "role": "body", "text": "Dario Saric had 20 points and 10 rebounds for the 76ers, who got 19 points from JJ Redick, 17 from Embiid and 14 from Marco Belinelli."}
{"game_id": "0021700973", "chunk_id": "0021700973_010", "order": 10, "role": "body", "text": "\"We were in the game on the road against a team that's in a similar position as us -- fighting for their lives,\" Redick said. \"They're a physical team. They're going to be a tough out in the playoffs.\""}
{"game_id": "0021700973", "chunk_id": "0021700973_011", "order": 11, "role": "body", "text": "Miami controlled the fourth and led by 11 with 2:01 left, before the 76ers had one last gasp. Redick and Belinelli combined for six points in 37 seconds, getting Philly within 101-96."}
{"game_id": "0021700973", "chunk_id": "0021700973_012", "order": 12, "role": "body", "text": "The drama essentially ended there. Whiteside made two foul shots, and Wade slammed home a lob from Richardson with 50.6 seconds left for a nine-point edge."}
{"game_id": "0021700973", "chunk_id": "0021700973_013", "order": 13, "role": "body", "text": "\"He's filling his cup from the fountain of youth,\" Heat coach Erik Spoelstra said about Wade."}
{"game_id": "0021700973", "chunk_id": "0021700973_015", "order": 15, "role": "body", "text": "76ers: Robert Covington missed all 10 of his shots. In the last 50 years, only two 76ers have gone 0 for 11 in a game -- one of them being Covington, on Dec. 29, 2016. The other was Evan Turner, in 2013. ... Embiid's 5-for-17 night was his second-worst shooting effort of the season. His previous low was a 4-for-16 game against Boston on Oct. 20."}
{"game_id": "0021700973", "chunk_id": "0021700973_016", "order": 16, "role": "body", "text": "Heat: Miami's one player from Philadelphia -- Dion Waiters -- missed all four Heat-76ers games this season because of his ankle surgery. Waiters got his cast removed earlier this week. ... Wade is 23-4 in home games against Philadelphia. ... Whiteside made 9 of his 12 shots. ... Wayne Ellington (bruised leg) returned and was 3 for 3 in the fourth quarter from 3-point range."}
{"game_id": "0021700973", "chunk_id": "0021700973_018", "order": 18, "role": "body", "text": "Double-digit leads have meant almost nothing in this Heat-76ers season series. Miami let an early 12-point lead get away Thursday -- no big deal compared to the first three matchups. Philadelphia won a game where Miami led by 24, the Heat won a game where they trailed by 13, and the 76ers had to scramble to win a game by six -- after wasting most of a 28-point lead."}
{"game_id": "0021700973", "chunk_id": "0021700973_020", "order": 20, "role": "body", "text": "The 76ers have 18 games left, and at least 13 will be against opponents who aren't in the playoff picture. They still face Brooklyn three times, New York and Atlanta twice. And they have only seven road games remaining -- zero against teams with winning records."}
{"game_id": "0021700973", "chunk_id": "0021700973_023", "order": 23, "role": "closing", "text": "Heat: Host Washington on Saturday."}
