{"game_id": "0021700022", "chunk_id": "0021700022_001", "order": 1, "role": "lead", "text": "NEW YORK --  Jeremy Lin was in the hospital Friday, rather than joining his teammates for their home opener."}
{"game_id": "0021700022", "chunk_id": "0021700022_002", "order": 2, "role": "body", "text": "The Brooklyn Nets are going to miss him, but they showed they still have plenty of firepower without him."}
{"game_id": "0021700022", "chunk_id": "0021700022_003", "order": 3, "role": "body", "text": "D'Angelo Russell, Trevor Booker and DeMarre Carroll all scored 17 points, and the Nets beat the Orlando Magic 126-121."}
{"game_id": "0021700022", "chunk_id": "0021700022_004", "order": 4, "role": "body", "text": "Brooklyn had six players in double figures, three more with nine points and got 64 points from its reserves to bounce back after yielding 140 points Wednesday night in a season-opening loss to Indiana."}
{"game_id": "0021700022", "chunk_id": "0021700022_005", "order": 5, "role": "body", "text": "Lin ruptured the patella tendon in his right knee late in that game and had season-ending surgery Friday morning."}
{"game_id": "0021700022", "chunk_id": "0021700022_006", "order": 6, "role": "body", "text": "\"Honestly, that's our brother, so we don't want to forget that. You don't want to forget about him,\" Russell said. \"But going out there I feel like guys knew they had to step up and they did.\""}
{"game_id": "0021700022", "chunk_id": "0021700022_007", "order": 7, "role": "body", "text": "Coach Kenny Atkinson was frustrated with the Nets' play on both ends, though understood there would an adjustment as players got used to new rotations without their starting guard."}
{"game_id": "0021700022", "chunk_id": "0021700022_008", "order": 8, "role": "body", "text": "\"But still, I think we can do a better job than we did tonight,\" he said."}
{"game_id": "0021700022", "chunk_id": "0021700022_009", "order": 9, "role": "body", "text": "Booker added 11 rebounds and made the clinching free throws with 0.9 seconds left after Orlando's Evan Fournier missed a tying 3-point attempt."}
{"game_id": "0021700022", "chunk_id": "0021700022_010", "order": 10, "role": "body", "text": "Nikola Vucevic scored a career-high 41 points and grabbed 12 rebounds for the Magic, who beat Miami in their opener. Fournier finished with 22 points and nine rebounds, and said he should have made his shot with about 2 seconds left."}
{"game_id": "0021700022", "chunk_id": "0021700022_011", "order": 11, "role": "body", "text": "\"But we should have never been in that situation anyway,\" he said. \"We did too many mistakes defensively. We didn't get any stops down the stretch.\""}
{"game_id": "0021700022", "chunk_id": "0021700022_012", "order": 12, "role": "body", "text": "It was tied at 106 before Brooklyn's Joe Harris had consecutive baskets midway through the fourth quarter. The Nets stayed ahead from there, with Russell banking in a jumper while being fouled with 1:23 left after the Magic had closed within one."}
{"game_id": "0021700022", "chunk_id": "0021700022_013", "order": 13, "role": "body", "text": "Allen Crabbe started for Lin and had nine points. Spencer Dinwiddie came off the bench and scored 16, while Rondae Hollis-Jefferson had 15."}
{"game_id": "0021700022", "chunk_id": "0021700022_015", "order": 15, "role": "body", "text": "Magic: Starting guard Elfrid Payton did not play in the second half because of a strained left hamstring. Forward Aaron Gordon missed the game with a sore left ankle. \"They had maybe their best player out, too. So we can't use the fact that we had two injuries,\" Vucevic said. \"Obviously missed those guys, but the next guy's got to step up. ... Vucevic's previous career high was 37 points, set on April 13, 2015, at Minnesota."}
{"game_id": "0021700022", "chunk_id": "0021700022_016", "order": 16, "role": "body", "text": "Nets: The Nets said rookie Jarrett Allen was the second-youngest player to play for them at 19 years, 182 days. Derrick Favors, now with the Utah Jazz, was 19 years, 104 days when he debuted on Oct. 27, 2010. ... The game was the first of just 39 at Barclays Center this season. The Nets' other two home games will be in Mexico City, where they will face Oklahoma City on Dec. 7 and Miami on Dec. 9. ... The Nets are 5-1 in home openers since moving to Brooklyn in 2012."}
{"game_id": "0021700022", "chunk_id": "0021700022_018", "order": 18, "role": "body", "text": "Justine Skye took a knee at the end of her performance of the national anthem. Skye, who is black, was nearing the completion of the song when she went to one knee for the finish. A Nets spokeswoman said the team was not aware of Skye's plans."}
{"game_id": "0021700022", "chunk_id": "0021700022_020", "order": 20, "role": "body", "text": "Lin had surgery Friday morning at the Hospital for Special Surgery in New York . The Nets said the surgery was successful and Lin is expected to make a full recovery."}
{"game_id": "0021700022", "chunk_id": "0021700022_022", "order": 22, "role": "body", "text": "The Empire State Building's tower went with a white and black light pattern for the Nets' home opener."}
{"game_id": "0021700022", "chunk_id": "0021700022_024", "order": 24, "role": "body", "text": "Magic: At Cleveland on Saturday night."}
{"game_id": "0021700022", "chunk_id": "0021700022_025", "order": 25, "role": "body", "text": "Nets: Host Atlanta on Sunday night."}
{"game_id": "0021700022", "chunk_id": "0021700022_027", "order": 27, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
