{"game_id": "0021701202", "chunk_id": "0021701202_001", "order": 1, "role": "lead", "text": "BOSTON --  Jaylen Brown could see the fourth quarter well enough from the Boston bench to know he wasn't worried about the Celtics' recent stumbles."}
{"game_id": "0021701202", "chunk_id": "0021701202_002", "order": 2, "role": "body", "text": "\"If we would have played our normal rotation, we would have won that game,\" he said Sunday after coach Brad Stevens rested his starters and watched the subs blow a 13-point, fourth-quarter lead to the Atlanta Hawks. \"No doubt about it.\""}
{"game_id": "0021701202", "chunk_id": "0021701202_003", "order": 3, "role": "body", "text": "Taurean Prince made seven of eight 3-pointers to score 33 points, getting help from Isaiah Taylor and Dewayne Dedmon down the stretch to help the last-place Hawks beat the playoff-bound Celtics 112-106."}
{"game_id": "0021701202", "chunk_id": "0021701202_004", "order": 4, "role": "body", "text": "With the No. 2 spot in the Eastern Conference already locked up, Stevens left Brown, Al Horford, Jayson Tatum and Terry Rozier on the bench for the entire fourth quarter and Boston lost for the third time in four games."}
{"game_id": "0021701202", "chunk_id": "0021701202_005", "order": 5, "role": "body", "text": "\"I think Brad made a good call,\" Brown said. \"(The backups) got an opportunity and it was well-deserved.\""}
{"game_id": "0021701202", "chunk_id": "0021701202_006", "order": 6, "role": "body", "text": "Rozier had 10 points, nine assists and eight rebounds for Boston, which had beaten Atlanta in the other three meetings this season. Tatum scored 19, Horford had 16 and Greg Monroe scored 17 for the Celtics, who are without Kyrie Irving and Gordon Hayward for the rest of the season and Marcus Smart for the start of the playoffs."}
{"game_id": "0021701202", "chunk_id": "0021701202_007", "order": 7, "role": "body", "text": "\"Let young guys play in the fourth,\" Stevens said. \"Bench play is going to be huge for us going into the playoffs without a full roster.\""}
{"game_id": "0021701202", "chunk_id": "0021701202_008", "order": 8, "role": "body", "text": "Taylor and Dedmon scored nine straight points for the Hawks after they trailed 103-101 with 2 minutes remaining."}
{"game_id": "0021701202", "chunk_id": "0021701202_009", "order": 9, "role": "body", "text": "Prince added eight rebounds and five assists, and Damian Lee scored 14 with eight boards. Taylor had 13 points and Dedmon scored 10 for Atlanta, which has beaten playoff teams in consecutive games but still has the worst record in the Eastern Conference."}
{"game_id": "0021701202", "chunk_id": "0021701202_010", "order": 10, "role": "body", "text": "\"(It's) especially gratifying, knowing you have a couple impact players out and still be able to do what we do,\" Prince said, alluding to the injuries to Dennis Schroder and Kent Bazemore, two of the team's top three scorers. \"It's good to see what we're able to do, even without a full team.\""}
{"game_id": "0021701202", "chunk_id": "0021701202_012", "order": 12, "role": "body", "text": "The Celtics took a 20-8 lead in the first quarter and nursed it through most of the game before a four-point play on a clear-path foul by Tatum, followed by a Prince 3-pointer, helped turn a 73-63 deficit into a one-point game."}
{"game_id": "0021701202", "chunk_id": "0021701202_013", "order": 13, "role": "body", "text": "The Celtics opened the fourth with a 9-2 run to take a 91-78 lead. But Atlanta tied it 99-all on a four-point play by Mike Muscala with 5:32 to play. After taking a 101-99 lead, the Celtics made five straight trips down the floor without scoring before Monroe's tip-in made it 103-101 with just over two minutes left."}
{"game_id": "0021701202", "chunk_id": "0021701202_014", "order": 14, "role": "body", "text": "That's when Taylor and Dedmon took over."}
{"game_id": "0021701202", "chunk_id": "0021701202_015", "order": 15, "role": "body", "text": "Taylor tied it 103-all with a layup and, after Monroe made one of two free throws, Dedmon made a 3-pointer to give Atlanta its first lead since the score was 3-2. Jonathan Gibson made a 20-footer for Boston, then Dedmon's dunk gave the Hawks the lead for good. Taylor followed with a layup to make it a four-point game with 26 seconds left."}
{"game_id": "0021701202", "chunk_id": "0021701202_016", "order": 16, "role": "body", "text": "\"Of course, they didn't play their starters in the fourth quarter,\" Atlanta coach Mike Budenholzer said. \"I think they got a lot out of today; those (Celtics) played well for three quarters. I'm proud of the way our guys played for all four quarters. It's a good sign the way they're developing.\""}
{"game_id": "0021701202", "chunk_id": "0021701202_018", "order": 18, "role": "body", "text": "Stevens said Irving's surgery was a success and he should be ready to return next season. The point guard had two screws removed Saturday from his left knee, which had developed an infection. The screws were inserted after he broke his kneecap during the 2015 Finals."}
{"game_id": "0021701202", "chunk_id": "0021701202_019", "order": 19, "role": "body", "text": "Irving has not played since March 11. Rozier started at point guard on Sunday, the 11th time in 12 games he had been in the starting lineup after coming off the bench for all but three of the previous 67 games."}
{"game_id": "0021701202", "chunk_id": "0021701202_021", "order": 21, "role": "body", "text": "Prince scored 10 in the first quarter and had eight points and four rebounds in the fourth. ... Boston's Semi Ojeleye had a career-high 13 points. ... The Hawks' 13 turnovers led to 15 Boston points, but the Celtics' 12 turnovers led to 24 Atlanta points."}
{"game_id": "0021701202", "chunk_id": "0021701202_023", "order": 23, "role": "body", "text": "Hawks: Finish the season at home against Philadelphia on Tuesday."}
{"game_id": "0021701202", "chunk_id": "0021701202_024", "order": 24, "role": "body", "text": "Celtics: At Washington on Tuesday."}
{"game_id": "0021701202", "chunk_id": "0021701202_026", "order": 26, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
