{"game_id": "0021700539", "chunk_id": "0021700539_001", "order": 1, "role": "lead", "text": "BOSTON --  The Boston Celtics squandered several opportunities to put away the pesky Brooklyn Nets before Kyrie Irving ended the comebacks."}
{"game_id": "0021700539", "chunk_id": "0021700539_002", "order": 2, "role": "body", "text": "Irving scored 28 points, hitting a pair of free throws with 7.7 seconds left after his teammates struggled from the line, and the Celtics held off the Nets 108-105 on Sunday."}
{"game_id": "0021700539", "chunk_id": "0021700539_003", "order": 3, "role": "body", "text": "\"You've got to give credit to just how talented that team is. They play extremely hard for all 48 minutes,\" said Irving, who also had eight rebounds. \"We had to take the challenge on every single possession.\""}
{"game_id": "0021700539", "chunk_id": "0021700539_004", "order": 4, "role": "body", "text": "Al Horford had 10 points, 10 rebounds and three blocks, Marcus Morris added 15 points and Terry Rozier scored 14 as Boston closed 2017 by winning three straight and four of five."}
{"game_id": "0021700539", "chunk_id": "0021700539_005", "order": 5, "role": "body", "text": "Rondae Hollis-Jefferson had 22 points and 12 rebounds and Caris LeVert scored 16 for the Nets, who could not overcome 10 turnovers in the second half."}
{"game_id": "0021700539", "chunk_id": "0021700539_006", "order": 6, "role": "body", "text": "\"They're a team that's not going to give up,\" Rozier said. \"They've got a lot of shooters, which opens up a lot for them. They use it to their advantage. That's a tough team.\""}
{"game_id": "0021700539", "chunk_id": "0021700539_007", "order": 7, "role": "body", "text": "The Celtics won their seventh straight against the Nets, although Boston didn't have the game in hand until Irving made a pair of free throws with 7.7 seconds remaining. Boston went the final 4:27 without a field goal and struggled from the foul line, going 16 for 25 in the game, and missed several opportunities to put Brooklyn away."}
{"game_id": "0021700539", "chunk_id": "0021700539_008", "order": 8, "role": "body", "text": "\"We stayed poised to make a comeback,\" Hollis-Jefferson said. \"That's basketball. Sometimes it goes your way, sometimes it doesn't. But for us now we're definitely competing. It starts with the starting unit, we've got to come out that way. And I feel like the effort's there.\""}
{"game_id": "0021700539", "chunk_id": "0021700539_009", "order": 9, "role": "body", "text": "Hollis-Jefferson pulled the Nets within 103-95 on a dunk, and then converted a three-point play with 2:05 left to cut the margin to 103-98. Quincy Acy hit a 3-pointer with 18 seconds left after the Nets grabbed two offensive rebounds, and Brooklyn was within 105-103."}
{"game_id": "0021700539", "chunk_id": "0021700539_010", "order": 10, "role": "body", "text": "Marcus Smart made 1 of 2 free throws with 15.2 seconds left, and then Irving -- who went 4-for-4 from the foul line -- added two more to seal it."}
{"game_id": "0021700539", "chunk_id": "0021700539_011", "order": 11, "role": "body", "text": "Acy scored 14 for the Nets, DeMarre Carroll and Allen Crabbe scored 12 points apiece and Spencer Dinwiddie had 10 points and nine assists."}
{"game_id": "0021700539", "chunk_id": "0021700539_012", "order": 12, "role": "body", "text": "\"Sometimes you'll have a slip-up like we did at the beginning of the first quarter, but it's the overall outcome that you kind of want to base it on and we kind of stayed with it,\" Hollis-Jefferson said. \"Give them credit. Boston's a really good team.\""}
{"game_id": "0021700539", "chunk_id": "0021700539_014", "order": 14, "role": "body", "text": "Nets: Brooklyn outscored the Celtics 31-23 in the second quarter and had one turnover in the first half. ... Brooklyn won consecutive games only once in December. ... The Nets outscored the Celtics in the paint 50-34."}
{"game_id": "0021700539", "chunk_id": "0021700539_015", "order": 15, "role": "body", "text": "Celtics: Irving scored at least 20 points for the 11th straight game. ... Boston took a 38-28 lead on Terry Rozier's 3-pointer just before the buzzer at the end of the first period. ... Boston shot 69.6 percent (16 for 23) in the first quarter. ... The Celtics outrebounded the Nets 22-14 in the first half."}
{"game_id": "0021700539", "chunk_id": "0021700539_017", "order": 17, "role": "body", "text": "At 30-10, the Celtics reached the 30-win mark before January for the third time in franchise history. Only the 1964-65 team, which won its 30th on Dec. 28, and the 1959-60 club (Dec. 30) reached 30 wins earlier."}
{"game_id": "0021700539", "chunk_id": "0021700539_019", "order": 19, "role": "body", "text": "The Celtics open 2018 at home Wednesday against the Cleveland Cavaliers, their partners in the offseason trade that sent Irving to Boston. The Cavs beat the Celtics in the 2017 Eastern Conference finals and in the season opener in Cleveland."}
{"game_id": "0021700539", "chunk_id": "0021700539_020", "order": 20, "role": "body", "text": "\"They've had everybody's number in the East for a couple of years now and we're among that list,\" Boston coach Brad Stevens said."}
{"game_id": "0021700539", "chunk_id": "0021700539_022", "order": 22, "role": "body", "text": "Nets: Are back at home Monday night hosting Orlando after a five-game trip."}
{"game_id": "0021700539", "chunk_id": "0021700539_023", "order": 23, "role": "body", "text": "Celtics: Host the Cavaliers on Wednesday night."}
{"game_id": "0021700539", "chunk_id": "0021700539_025", "order": 25, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
