{"game_id": "0021400259", "chunk_id": "0021400259_001", "order": 1, "role": "lead", "text": "DENVER --  Given his choice, LaMarcus Aldridge would much rather hit a game-winning shot. But hey, this dishing out a winning assist isn't so bad, either."}
{"game_id": "0021400259", "chunk_id": "0021400259_002", "order": 2, "role": "body", "text": "Aldridge scored a season-high 39 points and set up the winning basket on a pass inside to Robin Lopez with 1.3 seconds left, helping the Portland Trail Blazers rally for a 105-103 win over the Denver Nuggets on Tuesday night."}
{"game_id": "0021400259", "chunk_id": "0021400259_003", "order": 3, "role": "body", "text": "Aldridge's first inclination was to take the mid-range jumper himself. But the play was designed to go to Lopez and since the center had J.J. Hickson sealed off with his hip, Aldridge tossed it inside for the easy layup."}
{"game_id": "0021400259", "chunk_id": "0021400259_004", "order": 4, "role": "body", "text": "\"Everybody in the arena thought I would shoot it if I touched it,\" Aldridge said. \"So I tried to throw it to (Lopez).\""}
{"game_id": "0021400259", "chunk_id": "0021400259_005", "order": 5, "role": "body", "text": "It wasn't an easy entry pass by any stretch. Aldridge had to put a little spin on the ball to get it to Lopez."}
{"game_id": "0021400259", "chunk_id": "0021400259_007", "order": 7, "role": "body", "text": "\"Never. I swear, never,\" Aldridge said. \"I'm in the post a lot. I know when I'm holding a guy off where I want the ball.\""}
{"game_id": "0021400259", "chunk_id": "0021400259_008", "order": 8, "role": "body", "text": "In addition to distributing the ball, Aldridge also tried his hand at reporter, ducking into the scrum and asking Lopez about his game winner."}
{"game_id": "0021400259", "chunk_id": "0021400259_009", "order": 9, "role": "body", "text": "\"I'm eyeing LaMarcus Aldridge. I'm eyeing Damian Lillard,\" Lopez responded. \"By the end of the season, the ball's going to be in my hands. Just letting you know.\""}
{"game_id": "0021400259", "chunk_id": "0021400259_010", "order": 10, "role": "body", "text": "Once Lopez hit the layup, there was a little work to do. But Danilo Gallinari's 3-pointer at the buzzer was well short as the Blazers won their seventh straight over Denver."}
{"game_id": "0021400259", "chunk_id": "0021400259_011", "order": 11, "role": "body", "text": "Aldridge also had 11 rebounds for his fifth double-double in six games. Lillard scored 17 points, and Wesley Matthews added 15."}
{"game_id": "0021400259", "chunk_id": "0021400259_012", "order": 12, "role": "body", "text": "Ty Lawson led Denver with 24 points and 13 assists on the second night of a back-to-back."}
{"game_id": "0021400259", "chunk_id": "0021400259_013", "order": 13, "role": "body", "text": "Lawson also had a crucial turnover with 27.2 seconds remaining when Matthews stole his pass."}
{"game_id": "0021400259", "chunk_id": "0021400259_014", "order": 14, "role": "body", "text": "After a timeout, Lillard dribbled and dribbled out front before driving to the basket. He missed a layup with around 4.3 seconds left, but the ball went out of bounds off a Nuggets player."}
{"game_id": "0021400259", "chunk_id": "0021400259_015", "order": 15, "role": "body", "text": "Given another chance, Aldridge beat Denver with a pass instead of a shot."}
{"game_id": "0021400259", "chunk_id": "0021400259_016", "order": 16, "role": "body", "text": "\"That one is hard to swallow,\" said Nuggets coach Brian Shaw, who watched his team squander a 14-point lead in the second half. \"It seemed like we controlled the game for the most part and to lose it the way we did at the end, I'll take the hit.\""}
{"game_id": "0021400259", "chunk_id": "0021400259_017", "order": 17, "role": "body", "text": "This game was quite a contrast to three weeks ago, when the Blazers routed the Nuggets 130-113. The Nuggets have gone 8-3 since that lopsided loss."}
{"game_id": "0021400259", "chunk_id": "0021400259_018", "order": 18, "role": "body", "text": "\"We knew it wouldn't be, because they were playing better basketball,\" Aldridge said. \"We knew it was going to be a lot tougher.\""}
{"game_id": "0021400259", "chunk_id": "0021400259_019", "order": 19, "role": "body", "text": "The Nuggets received a scare late in the second quarter when Gallinari went to the locker room with a strained right knee. But he returned after halftime."}
{"game_id": "0021400259", "chunk_id": "0021400259_020", "order": 20, "role": "body", "text": "Gallinari went through three surgeries and missed nearly 18 months after blowing out his left knee on April 4, 2013."}
{"game_id": "0021400259", "chunk_id": "0021400259_021", "order": 21, "role": "body", "text": "The Italian forward finished with nine points."}
{"game_id": "0021400259", "chunk_id": "0021400259_022", "order": 22, "role": "body", "text": "\"Hyperextended it. Nothing serious,\" Gallinari said. \"I'm good to go.\""}
{"game_id": "0021400259", "chunk_id": "0021400259_024", "order": 24, "role": "body", "text": "Before the game, Shaw said he recommended that Arron Afflalo appeal a $15,000 fine by the NBA for a hard foul against Utah's Alec Burks on Monday."}
{"game_id": "0021400259", "chunk_id": "0021400259_025", "order": 25, "role": "body", "text": "\"It wasn't a malicious play,\" Shaw said. \"Arron is not a dirty player by any means.\""}
{"game_id": "0021400259", "chunk_id": "0021400259_027", "order": 27, "role": "body", "text": "Once again, the Nuggets couldn't contain Aldridge, who always seems to have big games against the Nuggets. He had a career-high 44 points on Jan. 23."}
{"game_id": "0021400259", "chunk_id": "0021400259_028", "order": 28, "role": "body", "text": "\"I've been lucky to play well against them,\" Aldridge said."}
{"game_id": "0021400259", "chunk_id": "0021400259_030", "order": 30, "role": "body", "text": "Trail Blazers: Portland is 5-0 against Northwest Division opponents this season. ... Portland has won the last four games in Denver. Before this run, it was 2-23 at the Pepsi Center since 2000-01. ... Nicolas Batum had 13 assists. ... It was the fifth time that Aldridge had scored 39 or more points."}
{"game_id": "0021400259", "chunk_id": "0021400259_031", "order": 31, "role": "body", "text": "Nuggets: Asked which Nuggets player would be the best choice to cover Aldridge, Shaw responded, \"Dikembe Mutombo.\" The 7-foot-2 center blocked 1,486 shots while with the Nuggets. ... Wilson Chandler had 18 points and 10 rebounds.  ... The Nuggets held Portland to 50 points in the first half -- significant because the Blazers had 84 first-half points the last time they were in town on Nov. 12."}
{"game_id": "0021400259", "chunk_id": "0021400259_033", "order": 33, "role": "body", "text": "Trail Blazers: Host Indiana on Thursday."}
{"game_id": "0021400259", "chunk_id": "0021400259_034", "order": 34, "role": "closing", "text": "Nuggets: At Washington on Friday."}
