{"game_id": "0021700070", "chunk_id": "0021700070_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Houston Rockets coach Mike D'Antoni seemed genuinely disappointed his team only attempted 55 3-pointers against the Charlotte Hornets."}
{"game_id": "0021700070", "chunk_id": "0021700070_002", "order": 2, "role": "body", "text": "\"I don't know why we didn't shoot 60,\" D'Antoni quipped. \"We passed up about four.\""}
{"game_id": "0021700070", "chunk_id": "0021700070_003", "order": 3, "role": "body", "text": "James Harden had his first triple-double of the season with 27 points, 11 assists and 10 rebounds, and the Rockets finished 22 of 57 from beyond the 3-point arc in a 109-93 win Friday night."}
{"game_id": "0021700070", "chunk_id": "0021700070_004", "order": 4, "role": "body", "text": "Houston nearly broke its own NBA regular season records of 24 3-pointers and 61 3-pointers attempted set last December."}
{"game_id": "0021700070", "chunk_id": "0021700070_005", "order": 5, "role": "body", "text": "Eric Gordon and Ryan Anderson led the 3-point barrage. Gordon was 6 of 16 from beyond the arc and had 26 points, while Anderson was 6 of 15 and finished with 21 points."}
{"game_id": "0021700070", "chunk_id": "0021700070_006", "order": 6, "role": "body", "text": "\"As soon Eric and I got (to Houston) it felt natural within the offense (to shoot deep 3-pointers) to give James as much space as possible,\" Anderson said. \"When we catch the ball that far from the basket that is not a shot we're afraid to take.\""}
{"game_id": "0021700070", "chunk_id": "0021700070_007", "order": 7, "role": "body", "text": "Of course, the Rockets are known for their long-distance shooting."}
{"game_id": "0021700070", "chunk_id": "0021700070_008", "order": 8, "role": "body", "text": "This was the 15th time in NBA history a team has attempted at least 50 3-pointers. The Rockets account for 11 of those -- all since the start of last season."}
{"game_id": "0021700070", "chunk_id": "0021700070_009", "order": 9, "role": "body", "text": "\"We are going to take them. If that is what is available and it's a good shot then everybody has the green light,\" D'Antoni said. \"Maybe one or two guys shouldn't shoot them, but when we pass them up guys get mad at each other. So we're taking them.\""}
{"game_id": "0021700070", "chunk_id": "0021700070_011", "order": 11, "role": "body", "text": "\"We're going to continue to tell everyone to shoot the ball,\" Harden said. \"We create opportunities in space, shoot it.  Luc (Mbah a Moute) passed up a couple. PJ Tucker passed up a couple, even when Chris (Paul) gets back he's got to get used to shooting the ball more than he ever has.  It's going to take some time but the more games we get under our belt, they'll get a feel for it.\""}
{"game_id": "0021700070", "chunk_id": "0021700070_012", "order": 12, "role": "body", "text": "The Rockets hit some backbreaking clutch shots just before the shot clock expired, including Harden's 25-footer over Michael Kidd-Gilchrist from the top of the key in the third quarter."}
{"game_id": "0021700070", "chunk_id": "0021700070_013", "order": 13, "role": "body", "text": "Kidd-Gilchrist had worked extremely hard denying Harden a drive and a shot, only to watch the five-time NBA All-Star elevate and drain a jumper in his grill one second before the buzzer sounded."}
{"game_id": "0021700070", "chunk_id": "0021700070_014", "order": 14, "role": "body", "text": "\"Harden and Gordon both made a couple of shots where there was just nothing you could do -- but that's just part of playing them,\" Hornets coach Steve Clifford said."}
{"game_id": "0021700070", "chunk_id": "0021700070_015", "order": 15, "role": "body", "text": "The Rockets took advantage of the Hornets' cold shooting in the first half and built a 10-point lead at halftime. The Hornets started the second half on an 8-0 run but could never get the lead and the Rockets pulled away in the fourth quarter."}
{"game_id": "0021700070", "chunk_id": "0021700070_016", "order": 16, "role": "body", "text": "Kemba Walker led the Hornets with 26 points, and Dwight Howard had another strong game with 19 points and 16 rebounds against his former team. It's the fifth straight game Howard has recorded at least 15 rebounds, a new Hornets record."}
{"game_id": "0021700070", "chunk_id": "0021700070_018", "order": 18, "role": "body", "text": "Rockets: Outscored the Hornets 29-16 in the second quarter and held the Hornets to 4 of 22 shooting from the field. ... Paul, Nene and Trevor Ariza did not play due to injuries."}
{"game_id": "0021700070", "chunk_id": "0021700070_019", "order": 19, "role": "body", "text": "Hornets: Shot 31.3 percent from the field in the first half. ... Howard recorded his 670th career double-double. ... Nic Batum, Cody Zeller, Michael Carter-Williams, Treveon Graham and Julyan Stone did not play due to injuries."}
{"game_id": "0021700070", "chunk_id": "0021700070_021", "order": 21, "role": "body", "text": "Howard's poor free throw shooting -- he was 5 of 15 -- cost the Hornets points and momentum. Anderson admitted the Rockets fouled the big man on purpose in the fourth quarter. Howard is now 16 of 40 from the stripe this season, well below his career mark of 56.5 percent."}
{"game_id": "0021700070", "chunk_id": "0021700070_022", "order": 22, "role": "body", "text": "At one point in the second quarter Howard made both free throw attempts -- banking the second one off the glass -- and crowd erupted in a sarcastic cheer."}
{"game_id": "0021700070", "chunk_id": "0021700070_023", "order": 23, "role": "body", "text": "STAGNANT OFFENSE: Guard Jeremy Lamb, who is starting for Batum, felt like the Hornets got stagnant on offense."}
{"game_id": "0021700070", "chunk_id": "0021700070_024", "order": 24, "role": "body", "text": "\"Bigs, we have to do a better job of screening and creating action and creating indecision I guess on the defensive part,\" Lamb said. \"We didn't do a good job with the switching.\""}
{"game_id": "0021700070", "chunk_id": "0021700070_026", "order": 26, "role": "body", "text": "Rockets: At Memphis on Saturday night."}
{"game_id": "0021700070", "chunk_id": "0021700070_027", "order": 27, "role": "body", "text": "Hornets: Host Orlando on Sunday night."}
{"game_id": "0021700070", "chunk_id": "0021700070_029", "order": 29, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
