{"game_id": "0021700350", "chunk_id": "0021700350_001", "order": 1, "role": "lead", "text": "TORONTO --  The Phoenix Suns are heading home from their season-high six-game trip anxious about the health of star guard Devin Booker."}
{"game_id": "0021700350", "chunk_id": "0021700350_002", "order": 2, "role": "body", "text": "Booker injured his groin while the Toronto Raptors beat the Suns 126-113 on Tuesday night. Preliminary tests showed Booker strained his left adductor while playing defense with 2:40 left in the fourth quarter. Booker froze in place near midcourt, and trainers came out to examine him before two teammates carried him off the floor and into the locker room."}
{"game_id": "0021700350", "chunk_id": "0021700350_003", "order": 3, "role": "body", "text": "\"It's tough,\" Suns center Greg Monre said.\" He's obviously one of the great young players in this league. He's having an outstanding year right now, so you definitely don't want to see him get injured.\""}
{"game_id": "0021700350", "chunk_id": "0021700350_004", "order": 4, "role": "body", "text": "Booker, who shook off a 2-for-11 start to score a season-high 46 points Monday in a win at Philadelphia, shot 0 for 7 in the first half Tuesday. He finished 4 for 15 with 19 points, including 10 of 12 from the foul line."}
{"game_id": "0021700350", "chunk_id": "0021700350_005", "order": 5, "role": "body", "text": "A team staffer had to help Booker limp to his stall in the locker room after being examined. Booker declined to speak to reporters."}
{"game_id": "0021700350", "chunk_id": "0021700350_006", "order": 6, "role": "body", "text": "\"I'm sure they'll have to do an MRI or something to make sure we take care of him the right way,\" Suns interim coach Jay Triano said."}
{"game_id": "0021700350", "chunk_id": "0021700350_007", "order": 7, "role": "body", "text": "Phoenix is off Wednesday before hosting Washington Thursday."}
{"game_id": "0021700350", "chunk_id": "0021700350_008", "order": 8, "role": "body", "text": "Now in his third season, Booker came in averaging a team-high 24.5 points per game."}
{"game_id": "0021700350", "chunk_id": "0021700350_009", "order": 9, "role": "body", "text": "\"Any time you have to get carried off it's always a scare, especially someone like him and how valuable he is to our team,\" Suns forward Jared Dudley said"}
{"game_id": "0021700350", "chunk_id": "0021700350_010", "order": 10, "role": "body", "text": "Kyle Lowry had 20 points and 10 assists, DeMar DeRozan scored 20 points and Toronto improved its NBA-best home record to 9-1. Serge Ibaka scored 19 points and OG Anunoby matched his career high with 16 as Toronto won its fourth straight and seventh in a row at home."}
{"game_id": "0021700350", "chunk_id": "0021700350_011", "order": 11, "role": "body", "text": "Anunoby's four 3-pointers were a career-high."}
{"game_id": "0021700350", "chunk_id": "0021700350_012", "order": 12, "role": "body", "text": "\"He played excellent tonight,\" Raptors coach Dwane Casey said. \"Didn't try to do too much. He took what the game gave him.\""}
{"game_id": "0021700350", "chunk_id": "0021700350_013", "order": 13, "role": "body", "text": "The Raptors, who have scored 100 or more points in 10 consecutive games, almost reached triple digits in three quarters Tuesday. Toronto led 97-79 heading to the fourth and weren't seriously challenged in the final frame."}
{"game_id": "0021700350", "chunk_id": "0021700350_014", "order": 14, "role": "body", "text": "Monroe had 11 points and 10 rebounds as the weary Suns wrapped up a six-game, 10-day road trip with their seventh of 15 back-to-backs this season. Phoenix is 3-4 in the second game of back-to-backs."}
{"game_id": "0021700350", "chunk_id": "0021700350_016", "order": 16, "role": "body", "text": "Suns: F T.J. Warren was ejected after picking up two technical fouls in quick succession in the third. Marquese Chriss was also called for a technical shortly after Warren's ejection. ... Phoenix had seven turnovers in the first while the Raptors had none. ... One night after playing a season-high 37 minutes in a win at Philadelphia, C Tyson Chandler got the night off. Monroe started in his place. ... Len played despite a strained left ankle."}
{"game_id": "0021700350", "chunk_id": "0021700350_017", "order": 17, "role": "body", "text": "Raptors: Lowry also had six rebounds. ... DeRozan matched his season high with eight assists. ... G Delon Wright, who has missed the past eight games because of a dislocated right shoulder, took part in shooting drills at Monday's practice. ... The Raptors were outscored in a second quarter for the first time in 13 games."}
{"game_id": "0021700350", "chunk_id": "0021700350_019", "order": 19, "role": "body", "text": "Toronto held an opponent without an offensive rebound for the first time in franchise history."}
{"game_id": "0021700350", "chunk_id": "0021700350_021", "order": 21, "role": "body", "text": "Lowry drew two charges, increasing his NBA-leading total to 17. It's as many or more than 17 teams had entering play Tuesday."}
{"game_id": "0021700350", "chunk_id": "0021700350_023", "order": 23, "role": "body", "text": "Suns: Phoenix, which overcame a 22-point deficit to win in Washington last month, is seeking its first sweep since 2014-15."}
{"game_id": "0021700350", "chunk_id": "0021700350_024", "order": 24, "role": "body", "text": "Raptors: Visit Memphis on Friday, the opener of a four-game trip against Western Conference opponents."}
{"game_id": "0021700350", "chunk_id": "0021700350_026", "order": 26, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
