{"game_id": "0021400439", "chunk_id": "0021400439_001", "order": 1, "role": "lead", "text": "DALLAS -- Rajon Rondo is learning to play with his new Dallas teammates, and Dirk Nowitzki is trying to play through a stomach ailment that won't go away.\nThey both look forward to when things will be more comfortable.\nRondo scored a season-high 21 points in his fourth game with the Mavericks and Nowitzki added 14 to move up another spot on the NBA's scoring list in a 102-98 victory over the Los Angeles Lakers on Friday night."}
{"game_id": "0021400439", "chunk_id": "0021400439_002", "order": 2, "role": "closing", "text": "Rondo, traded from Boston last week, also had eight rebounds and seven assists in Dallas' franchise-best fifth straight win against the Lakers in the regular season.\n\"We basically just have to communicate on the floor,\" said Rondo, who topped his season high of 20 against Oklahoma City last month when he was still with the Celtics. \"The game is still the same.\"\nKobe Bryant missed his third straight game for Los Angeles to rest his sore body. He could return Sunday at home against Phoenix.\nThe NBA's No. 3 career scorer watched from the Lakers' bench while Nowitzki passed Elvin Hayes for eighth place, and 10th on the combined NBA-ABA list.\nThe 36-year-old hit a long jumper on the first possession of the third quarter to surpass Hayes and asked out less than 4 minutes later, apparently winded from the effects of the illness after coming up short on a pair of open shots.\n\"It's been up and down for last couple of weeks so had to get it checked out this morning,\" said Nowitzki, the highest-scoring foreigner in league history at 27,322 points, now nine ahead of Hayes.\n\"Just hope to feel better soon,\" said the 7-foot German, who also had eight rebounds.\nCarlos Boozer scored 18 points for the Lakers, who lost again on the second night of a back-to-back after beating NBA-leading Golden State in the first game without Bryant.\nBut they looked much better than the team that lost 140-106 last month in Dallas, when Bryant did play. It was the highest-scoring for the Mavericks in more than five years.\n\"We just want the win,\" Boozer said. \"There's no such thing as a moral victory in the NBA.\"\nTIP-INS\nLakers: G Wayne Ellington made his third straight start in Bryant's place and finished with 12 points, hitting a pair of 3-pointers to keep the outcome slightly in doubt in the final seconds. ... Los Angeles had three players with double-doubles in points and rebounds: Jordan Hill (12 points, 10 rebounds), Wesley Johnson (11 and 10) and Ed Davis (10 and 11).\nMavericks: Nowitzki tied old teammate and close friend Steve Nash by playing in his 1,217th career game, 27th on the career list. They played about 400 regular-season games together over six seasons in Dallas. The 40-year-old Nash is still with the Lakers but not expected to play in the final season of his contract because of back problems. ... Tyson Chandler had 15 points and 12 rebounds, his 14th double-double.\nWATCH OUT, KOBE\nBryant, who was in street clothes at the end of the bench, shared a brief moment with Nowitzki after the game. \"I told him I was going to catch him,\" Nowitzki said, drawing laughter in the locker room after the game. \"That's going to be tough.\"\nBryant passed Michael Jordan earlier this month. He's at 32,365 points. Nowitzki's in his 17th season, Bryant his 19th.\nLONG-RANGE RUNS\nNick Young, who had 15 points on five 3-pointers, hit a pair from long range about a minute apart to help the Lakers get within five midway through the fourth quarter.\nBut Dallas' Charlie Villanueva, enjoying an expanded role since the Rondo trade sent Brandan Wright to the Celtics, hit two big 3s to spark a fourth-quarter run that put away the game. The 10th-year player finished with 13 points.\nANOTHER AILMENT\nLike Nowitzki, Monta Ellis was questionable before the game. Playing with an unspecified illness, Ellis finished with 15 points, seven assists and three steals. \"He was sweating a little more than normal,\" coach Rick Carlisle said. \"You could just tell it was tougher for him. We needed him out there. It was as simple as that.\"\nUP NEXT\nLakers: Host Phoenix on Sunday.\nMavericks: Host Oklahoma City on Sunday."}
