{"game_id": "0021400193", "chunk_id": "0021400193_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- Marc Gasol's dominance is making one of the NBA's best frontcourts even better.\nGasol had 30 points and 12 rebounds to lead the Memphis Grizzlies to a 107-91 victory over the Los Angeles Clippers on Sunday night. It marked the second straight game Gasol has recorded at least 30 points.\nThe victory left Memphis with the league's best record (12-2) behind a more aggressive Gasol, who is complementing his jumper with moves to the basket this season.\n\"There was no doubt in my mind that Marc would be aggressive,\" point guard Mike Conley said, adding: \"Once you see the 12-2 start, we're going to tell him to go get 30 every night.\"\nGasol opened the game with a pair of jumpers, then began taking the ball to the basket. The result was 12 first-quarter points as Memphis erased the Clippers' only lead of the game and built the advantage to 25 by the fourth.\n\"When you make jumpers, it forces the defense to come out,\" Gasol said. \"It creates shots for other people, and I'm happy with that.\"\nSix Grizzlies reached double figures. Courtney Lee added 13 points for Memphis. Tony Allen had 12 points, while Beno Udrih and Quincy Pondexter had 11 points apiece off the Memphis bench. Zach Randolph had 10 points.\nThe Clippers, who won their first two on a seven-game road swing, didn't execute early, and didn't have an answer for Gasol.\n\"We really have to come out executing and aggressive and hit first,\" said Chris Paul, who led the Clippers with 22 points, five assists and four steals. \"We really have to do a better job of doing it consistently.\"\nJamal Crawford scored 19, and J.J. Redick finished with 15, going 3-of-6 from outside the arc.\nBlake Griffin scored 12 points, but was 5-of-17 from the field.\nLos Angeles, which was averaging 103.5 points, had its nine-game streak of scoring at least 100 points on the road end.\n\"Once they got the lead, it was hard to get back into the tempo of the game,\" Clippers coach Doc Rivers said. \"I thought the second half we lost our way a little bit.\"\nPaul tried to guide the Clippers back into the game after halftime, scoring 13 points in the third, and Los Angeles got within eight points. But Memphis rebuilt the lead to 25 points in the fourth as Rivers relied on his reserves to try and erase the deficit. The Los Angeles bench made a run to get within 15, but Memphis never let them get any closer.\nRivers recognized that a different Gasol has made the Grizzlies more dangerous.\n\"I don't know if he has been on a good diet, but he looks great and is playing great,\" Rivers said. \"The Grizzlies seem to have that edge. They aren't messing around.\"\n---\nTIP-INS:\nClippers: Los Angeles' seven-game road trip will cover 7,231 miles before the Clippers return home on Dec. 1 to face Minnesota. ... The Clippers' 25-point deficit in the second half was not their largest of the season. They trailed by 29 Nov. 5 against Golden State.\nGrizzlies: Reserve G Nick Calathes played for the first time this season after completing a 20-game suspension handed down at the start of the first round postseason series against Oklahoma City last spring for violating the league's banned substance policy. ... The victory gave the Grizzlies a 37-36 advantage in the overall series.\nVIRUS VANQUISHED: Memphis had its full complement of players for the first time in the last three games. Five players caught a stomach virus before last Wednesday's game in Toronto, and two more caught the bug before Friday's game against Boston.\nHE SAID IT: \"The first two games (of the road trip), I think our defense was a little bit better. (Sunday) we didn't move the ball as well. We really didn't push the pace.\" -- Crawford, on the Clippers' struggles.\nUP NEXT\nClippers: Visit Charlotte on Monday.\nGrizzlies: Visit Lakers on Wednesday."}
