{"game_id": "0021700991", "chunk_id": "0021700991_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  The game was looking scary for the Los Angeles Clippers, a team hanging on to a final playoff spot by the thinnest of margins."}
{"game_id": "0021700991", "chunk_id": "0021700991_002", "order": 2, "role": "body", "text": "The Orlando Magic, owners of the worst record in the Eastern Conference, led the Clippers by nine points midway in the third quarter. The Clippers, though, had a final push, controlling the fourth quarter and going on to a 113-105 victory over the Magic on Saturday night."}
{"game_id": "0021700991", "chunk_id": "0021700991_003", "order": 3, "role": "body", "text": "\"Tonight was a struggle, you could just see it,\" Clippers coach Doc Rivers said. \"We hung in there long enough, but then in the fourth quarter we got enough stops.\""}
{"game_id": "0021700991", "chunk_id": "0021700991_004", "order": 4, "role": "body", "text": "Lou Williams scored 10 of his 25 points in the fourth, including consecutive 3-pointers that finally gave the Clippers some room. Williams leads the NBA in fourth-quarter scoring (7.7 per game)."}
{"game_id": "0021700991", "chunk_id": "0021700991_005", "order": 5, "role": "body", "text": "\"Lou made some great plays down the end,\" Orlando's Shelvin Mack said. \"He's very aggressive. He's my good friend. I play with him all the time. He can go 0 for 20 and he still thinks he's going to make the next one. He just kept firing.\""}
{"game_id": "0021700991", "chunk_id": "0021700991_006", "order": 6, "role": "body", "text": "The Clippers outscored the Magic 26-16 in the fourth quarter to finally pull away. Tobias Harris added 21 points for the Clippers, and DeAndre Jordan had 15 rebounds and Milos Teodosic added 15 points and seven assists."}
{"game_id": "0021700991", "chunk_id": "0021700991_007", "order": 7, "role": "body", "text": "\"They played lights out,\" Magic coach Frank Vogel said. \"You've got to tip your cap to them, they're playing very well. Offensively, we couldn't stop them during that (fourth-quarter) stretch.\""}
{"game_id": "0021700991", "chunk_id": "0021700991_008", "order": 8, "role": "body", "text": "The Clippers have won four of their last five, while the Magic have lost 11 of their last 13. Orlando fell to 20-47 with the loss."}
{"game_id": "0021700991", "chunk_id": "0021700991_009", "order": 9, "role": "body", "text": "\"People look at the records in the NBA and think, `Oh, you're going to win,\" Rivers said. \"It just doesn't happen. You have to play well to win an NBA game. And we played just well enough."}
{"game_id": "0021700991", "chunk_id": "0021700991_010", "order": 10, "role": "body", "text": "\"Give Orlando credit. They're out of the playoffs, but they're making you play hard and not just rolling over.\""}
{"game_id": "0021700991", "chunk_id": "0021700991_011", "order": 11, "role": "body", "text": "The Clippers moved a half-game ahead of Denver and Utah in the race for the final Western Conference playoff spot with the win."}
{"game_id": "0021700991", "chunk_id": "0021700991_013", "order": 13, "role": "body", "text": "Magic: With F Aaron Gordon out for a second game with concussion symptoms, rookie Jonathan Isaac again started. Some of his teammates want to see him be more aggressive with open shots. \"We call them rhythm pass-ups,\" Vogel said. \"If you execute your offense, the defense is going to react to it, the ball is going to swing and it creates a rhythm shot. If you pass that up, it leads to a worse shot and a one-on-one situation.\""}
{"game_id": "0021700991", "chunk_id": "0021700991_014", "order": 14, "role": "body", "text": "Clippers: Williams leads the team in scoring, mostly as a bench player, but the man Rivers called \"lethal\" offensively, had oddly hit only 11 of his last 20 free throws entering Saturday. \"He's human,\" Rivers said. \"It won't last. I can guarantee that. And one guy who is not worried about it is Lou. I've never seen a more lethal, relaxed scorer than him. I mean, nothing fazes him. That's probably why he's good.\" ... The team announced it would return to Hawaii next summer for training camp."}
{"game_id": "0021700991", "chunk_id": "0021700991_016", "order": 16, "role": "body", "text": "The 30-year-old rookie from Europe did not start, but played 31 minutes and helped push the Clippers to victory."}
{"game_id": "0021700991", "chunk_id": "0021700991_017", "order": 17, "role": "body", "text": "\"The thing I love about Milos is, he's a winner,\" Rivers said. \"You can feel it. He's competitive. And in games like these, that's when he's at his best. We needed someone to be competitive tonight, and I thought Milos was that.\""}
{"game_id": "0021700991", "chunk_id": "0021700991_019", "order": 19, "role": "body", "text": "Magic: complete a five-game trip Tuesday in San Antonio."}
{"game_id": "0021700991", "chunk_id": "0021700991_020", "order": 20, "role": "body", "text": "Clippers: open three-game trip in Chicago on Tuesday."}
{"game_id": "0021700991", "chunk_id": "0021700991_022", "order": 22, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
