{"game_id": "0021201219", "chunk_id": "0021201219_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Charlotte Bobcats did not finish with the NBA's worst record."}
{"game_id": "0021201219", "chunk_id": "0021201219_002", "order": 2, "role": "body", "text": "Sure, it's not the same as winning an NBA championship, but for the Bobcats it's a step in the right direction after finishing last season 7-59."}
{"game_id": "0021201219", "chunk_id": "0021201219_003", "order": 3, "role": "body", "text": "The Bobcats defeated the Cleveland Cavaliers 105-98 on Wednesday night to match a season-high three-game win streak and finish 21-61, a game ahead of the Orlando Magic."}
{"game_id": "0021201219", "chunk_id": "0021201219_004", "order": 4, "role": "body", "text": "The Magic lost their season finale to the Miami Heat."}
{"game_id": "0021201219", "chunk_id": "0021201219_005", "order": 5, "role": "body", "text": "\"You never want to be dead last, so I'm happy about that,\" Charlotte first-year head coach Mike Dunlap said."}
{"game_id": "0021201219", "chunk_id": "0021201219_006", "order": 6, "role": "body", "text": "The Bobcats entered Wednesday night tied with Orlando for the worst record in the league, but Kemba Walker had 24 points and seven assists and Josh McRoberts added 20 points and eight rebounds."}
{"game_id": "0021201219", "chunk_id": "0021201219_007", "order": 7, "role": "body", "text": "Dunlap said he never expected a miraculous turnaround after inheriting a team that finished with the worst winning percentage (.106) in NBA history."}
{"game_id": "0021201219", "chunk_id": "0021201219_008", "order": 8, "role": "body", "text": "Still, the Bobcats became the first team to triple their win total from the previous season."}
{"game_id": "0021201219", "chunk_id": "0021201219_009", "order": 9, "role": "body", "text": "That progress, along with the fact the Bobcats will get another high draft pick and have as much as $21 million to spend under the salary cap, leaves Dunlap excited about the team's future."}
{"game_id": "0021201219", "chunk_id": "0021201219_010", "order": 10, "role": "body", "text": "\"I'm proud of the fact that we put the first brick down in the house and there's an uptick,\" Dunlap said. \"But what I'm happier about is the feel all the way through the building. People can spend the summer and say we got better and our young guys got better.\""}
{"game_id": "0021201219", "chunk_id": "0021201219_011", "order": 11, "role": "body", "text": "Said Walker: \"My excitement comes knowing that we finished off strong.\""}
{"game_id": "0021201219", "chunk_id": "0021201219_012", "order": 12, "role": "body", "text": "The Cavaliers can't say the same thing."}
{"game_id": "0021201219", "chunk_id": "0021201219_013", "order": 13, "role": "body", "text": "Kyrie Irving had 24 points and 10 assists for the Cavaliers, who finished with the third-worst record in the league (24-58) after losing 16 of their last 18 games, including their six straight to close the season."}
{"game_id": "0021201219", "chunk_id": "0021201219_014", "order": 14, "role": "body", "text": "Cavaliers coach Byron Scott's future with the team remains uncertain."}
{"game_id": "0021201219", "chunk_id": "0021201219_015", "order": 15, "role": "body", "text": "The Cavs are just 64-166 in three seasons under Scott following the departure of LeBron James."}
{"game_id": "0021201219", "chunk_id": "0021201219_016", "order": 16, "role": "body", "text": "Scott said the season has been \"frustrating\" because the Cavaliers \"haven't had our full complement of players. It is still a growing process. I think our guys are still getting better and next year I hope that we'll be healthy.\""}
{"game_id": "0021201219", "chunk_id": "0021201219_017", "order": 17, "role": "body", "text": "As for his future, Scott said earlier in the day, \"Yeah, I have a year on my contract, (so) unless they tell me otherwise I plan on being back.\""}
{"game_id": "0021201219", "chunk_id": "0021201219_018", "order": 18, "role": "body", "text": "By finishing last in the league the Magic have the best chance -- 25 percent -- to land the No. 1 pick in the upcoming NBA lottery."}
{"game_id": "0021201219", "chunk_id": "0021201219_019", "order": 19, "role": "body", "text": "The Bobcats jumped all over the Cavaliers early, taking a 34-16 lead after shooting 72 percent from the field in the first quarter."}
{"game_id": "0021201219", "chunk_id": "0021201219_020", "order": 20, "role": "body", "text": "The Bobcats appeared ready to blow out the Cavaliers after extending the lead to 24 in the second quarter, but Irving brought Cleveland back."}
{"game_id": "0021201219", "chunk_id": "0021201219_021", "order": 21, "role": "body", "text": "Irving scored 16 points in the first half on 6-of-9 shooting and the Cavaliers finished the half on an 18-5 run to cut the Charlotte lead to six heading into the break."}
{"game_id": "0021201219", "chunk_id": "0021201219_022", "order": 22, "role": "body", "text": "Cleveland took the lead with 9:30 left in the game when Dion Waiters scored on a driving layup for its only lead of the game at 77-76."}
{"game_id": "0021201219", "chunk_id": "0021201219_023", "order": 23, "role": "body", "text": "But Walker hit a long 3-pointer and Bismack Biyombo scored inside to ignite a 7-0 run giving the Bobcats a lead they'd never relinquish. Walker sealed the game with a pair of free throws with 15 seconds left to put the Bobcats up by five."}
{"game_id": "0021201219", "chunk_id": "0021201219_024", "order": 24, "role": "body", "text": "\"You take away the positives and negatives and what you need to work on for next season,\" Irving said. \"We'll come back collectively in September and come back a better ballclub. That's the main goal. (but) we're not going to win a lot of games if we continue to be the last place team in defensive field goal percentage.\""}
{"game_id": "0021201219", "chunk_id": "0021201219_025", "order": 25, "role": "closing", "text": "Game notes McRoberts was a solid acquisition since being acquired from Orlando, entering the game averaging 10.2 points, 8.3 rebounds and 3.2 assists in his previous 18 starts. ... Gerald Henderson scored in double digits in his final 24 games this season. ...  Omri Casspi had a season-high nine rebounds."}
