{"game_id": "0021701148", "chunk_id": "0021701148_001", "order": 1, "role": "lead", "text": "NEW YORK --  With one All-Star out injured and another banished to the locker room, the Detroit Pistons pulled it together to preserve their slim playoff hopes for at least another day."}
{"game_id": "0021701148", "chunk_id": "0021701148_002", "order": 2, "role": "body", "text": "Reggie Jackson scored 29 points, Stanley Johnson had 17 and the Pistons beat the Brooklyn Nets 108-96 on Sunday night."}
{"game_id": "0021701148", "chunk_id": "0021701148_003", "order": 3, "role": "body", "text": "\"Sometimes you have to figure out a way to win,\" said Anthony Tolliver, a nine-year veteran who has played on nine different teams, this his second stint with Detroit.  \"Whenever things are not going your way or you have some guys go out, be it by injury or whatever you just have to figure out a way to win.\""}
{"game_id": "0021701148", "chunk_id": "0021701148_004", "order": 4, "role": "body", "text": "Detroit, playing its third straight game without injured forward Blake Griffin, avoided elimination from postseason contention for at least one game. Griffin, acquired Jan. 30 from the Los Angeles Clippers, suffered a bone bruise in his right ankle during last Monday's win over the Lakers."}
{"game_id": "0021701148", "chunk_id": "0021701148_005", "order": 5, "role": "body", "text": "Ish Smith had 17 points, all in the first half, and Andre Drummond added 13 points and 14 rebounds for the Pistons before being ejected in the third quarter. Detroit has won five straight for the third time this season."}
{"game_id": "0021701148", "chunk_id": "0021701148_006", "order": 6, "role": "body", "text": "\"Our defense was good. Both teams were on fumes going down the stretch,\" Pistons coach Stan Van Gundy said. \"We were just walking the ball up the floor. We had nothing, but we just grinded it out. So, it's a good win.\""}
{"game_id": "0021701148", "chunk_id": "0021701148_007", "order": 7, "role": "body", "text": "The Pistons are four games behind Miami -- which holds the eighth and last playoff spot in the Eastern Conference -- with five games remaining for each team. The Pistons have not made the postseason since 2016, when they got swept by the Cleveland Cavaliers in the first round."}
{"game_id": "0021701148", "chunk_id": "0021701148_008", "order": 8, "role": "body", "text": "Brooklyn was led by reserve Joe Harris and Jarrett Allen, who each had 15 points."}
{"game_id": "0021701148", "chunk_id": "0021701148_009", "order": 9, "role": "body", "text": "Detroit started off the second half with a 14-point advantage and saw it increase to 20 on Drummond's alley-oop dunk with 3:56 left in the third quarter."}
{"game_id": "0021701148", "chunk_id": "0021701148_010", "order": 10, "role": "body", "text": "The Pistons then missed six straight shots as the Nets took off on a 12-0 run that bridged the end of the third quarter -- which included a minor shoving match between Drummond and Brooklyn forward Quincy Acy in which both got ejected with 18.6 seconds left- and the opening minutes of the fourth."}
{"game_id": "0021701148", "chunk_id": "0021701148_011", "order": 11, "role": "body", "text": "Drummond exited the visitor's locker room before the media was allowed in, but Acy wasn't too pleased with the All-Star center's antics after both players battled for a loose ball after a missed attempt by Smith."}
{"game_id": "0021701148", "chunk_id": "0021701148_012", "order": 12, "role": "body", "text": "Drummond swung his right elbow as both players got tangled up. Acy stepped toward him, and Drummond shoved the reserve forward back with his left arm. Referee David Guthrie stepped in to intervene but was pushed away by a furious Acy."}
{"game_id": "0021701148", "chunk_id": "0021701148_013", "order": 13, "role": "body", "text": "\"What, you think I swung on purpose?,\" said Acy. \"There was a lot of people around me.\""}
{"game_id": "0021701148", "chunk_id": "0021701148_014", "order": 14, "role": "body", "text": "After DeMarre Carroll capped the run with 3-pointer to make it 83-75 with 10:45 to go in the final period, Luke Kennard ended a streak of seven straight misses for the Pistons to make it 85-75. Jackson then made a pair of baskets that extended Detroit's lead 89-78."}
{"game_id": "0021701148", "chunk_id": "0021701148_015", "order": 15, "role": "body", "text": "The Nets managed to make a seven-point game on Caris LeVert's 3-pointer with 3:56 left in regulation, but Pistons used an 8-2 spurt highlighted by Anthony Tolliver's 3-point shot from the wing to increase the lead 101-89 and put the game out of reach."}
{"game_id": "0021701148", "chunk_id": "0021701148_017", "order": 17, "role": "body", "text": "The Pistons went 2-0 to conclude their brief weekend visit to the Big Apple. Detroit held on for a 115-109 victory over the New York Knicks at Madison Square Garden on Saturday night. The Pistons also beat Brooklyn earlier this season at Barclays Center."}
{"game_id": "0021701148", "chunk_id": "0021701148_019", "order": 19, "role": "body", "text": "Pistons: Tolliver had 10 points and 12 rebounds. . Reserve forward Eric Moreland played almost the entire fourth quarter with Drummond out of the game and picked up 6 of his 10 rebounds during that stretch along with two blocked shots."}
{"game_id": "0021701148", "chunk_id": "0021701148_020", "order": 20, "role": "body", "text": "Nets: The fell to 13-25 at Barclays Center this season and just have one more game at home, April 9 against Chicago. Brooklyn went 13-28 at home last season and 14-27 during the 2015-16 season after making the playoffs during their first three years at Barclays Center after moving from New Jersey."}
{"game_id": "0021701148", "chunk_id": "0021701148_022", "order": 22, "role": "body", "text": "Pistons: Host Philadelphia on Wednesday."}
{"game_id": "0021701148", "chunk_id": "0021701148_023", "order": 23, "role": "closing", "text": "Nets: Visit Philadelphia on Tuesday night to tip-off a three-game road trip."}
