{"game_id": "0021301056", "chunk_id": "0021301056_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- Doc Rivers and Larry Drew both got new coaching jobs this season. Needless to say, the Los Angeles Clippers dealt Rivers a much better hand than his counterpart received in Milwaukee.\nBlake Griffin had 27 points and 14 rebounds, and the Clippers made it consecutive 50-win seasons with a lackluster 106-98 victory over the NBA-worst Bucks on Monday night.\nThe Clippers became the ninth NBA franchise to have different head coaches guide the club to 50 victories in back-to-back seasons. They reached the mark five games earlier under Rivers than they did last season under Vinny Del Negro, when they set a club record with 56 wins and captured their first division title before losing to Memphis in the opening round of the playoffs.\n\"Vinny did some great things here, and I've had the luxury of molding us into something even better,\" said Rivers, who guided Boston to four straight 50-win seasons and one championship.\n\"Coming here was a good challenge for me, personally, and for our team and this group. I've been in this organization, and I just thought, wouldn't it be neat if we could do it? We've got a lot of work to do to do it, but at least we're on the road to it.\"\nGriffin had his 29th consecutive game with at least 20 points, the longest streak by a Clippers player since the franchise relocated from San Diego in 1984-85. Chris Paul had 14 points and seven assists, helping Los Angeles win for the 13th time in 14 games overall and extend its home winning streak to a season-best eight games.\nRamon Sessions had a season-high 28 points for the Bucks, who have lost eight in a row and are 13-58. They are 1-19 on the road since beating the Lakers by 15 points at Staples Center on New Year's Eve -- their only road win against a Western Conference team.\nThe Bucks have gone more than a year since the last time they won consecutive games -- March 17-19, 2013, when they beat Orlando and Portland. Both games were in Milwaukee.\n\"It's certainly been a big challenge, coming from the situation I had in Atlanta, and it's been tough,\" said Drew, who spent the previous three seasons coaching the Hawks. \"We've got a lot of new faces and a lot of young players. We were riddled with the injury bug very early, even before we got started, and it's been a constant throughout the season. But that's no excuse. That's the NBA, and everybody deals with injuries.\"\nEven if the Bucks split their 12 remaining games, they would finish with the worst record in the franchise's 46-year history.\nDrew experienced firsthand as a player what his Bucks are going through. During the first two seasons he played for the Clippers, they were 12-70 in 1986-87 and 17-65 the following season.\n\"It's been a struggle and continues to be. But the positive of the whole thing is that we've got a group of young guys that are willing to learn. So I see light at the end of the tunnel,\" he said.\nPower forward Ersan Ilyasova sat out on the second night of a back-to-back set because of a sore right ankle that has bothered him all season.\nDrew used his 26th starting lineup, inserting Jeff Adrien in Ilyasova's spot and Sessions at shooting guard because of rookie Nate Wolters' broken left hand. It was the first start for both players since they joined the Bucks in a Feb. 20 trade that sent Luke Ridnour and Gary Neal to Charlotte.\nSessions made his first six shots and finished 13-for-21 from the field, scoring 11 points during a 3:43 span down the stretch. Adrien had 14 points and seven rebounds. They were the 15th and 16th players to start a game for the Bucks this season.\nLos Angeles never trailed, extending its five-point halftime lead to 71-60 on Darren Collison's three-point play with 5:34 left in the third quarter.\nThe Bucks got as close as 82-80 on back-to-back dunks 28 seconds apart by John Henson, but Glen Davis responded with consecutive layups and Jamal Crawford scored seven points during a 3:52 stretch, including a 3-pointer that gave Los Angeles a 99-92 edge with 3:08 to play.\nGame notes\nLos Angeles came in with the league's best 3-point defense (33.1 percent), and Milwaukee had the worst (38.4 percent). The Clippers finished 8-for-18 behind the arc, and the Bucks were 5-for-13. ... The teams met for the first time since Jan. 27, when the Clippers ended their seven-game Grammy road trip with a 114-86 rout. Paul missed that game because of a separated shoulder. ... The Clippers are 31-5 at home, and the Bucks are 5-31 on the road. ... The Bucks have lost six straight and 13-of-14 to the Clippers in Los Angeles. ... The Clippers head out on a five-game trip before ending the regular season with five of six at Staples Center."}
