{"game_id": "0021700032", "chunk_id": "0021700032_001", "order": 1, "role": "lead", "text": "HOUSTON -- James Harden and Houston Rockets coach Mike D'Antoni stressed Saturday night the importance of establishing a consistent defensive presence.\nHarden scored 29 points to lead the Rockets to a 107-91 victory over the Dallas Mavericks in the team's home opener on Saturday night.\nWhile Houston's hot shooting certainly helped, holding the Mavericks to 20 points or less in each of the first three quarters gave the Rockets plenty of breathing room.\n\"From the beginning of the game, defensively, we were locked in, and offensively, we made shots,\" Harden said. \"That's going to be our blueprint is making shots.\"\nThe Rockets were 18-0 when holding opponents to less than 100 points last season. Through the first three games, they're allowing 104.0 points per game, down from an average of 109.6 points last season\n\"I think we're trying to build a good defensive base,\" D'Antoni said. \"We're trying to understand where we're at offensively. I wish Chris (Paul) would be here so we can keep getting better. I'm happy where we're at, but we've got a long ways to go. But 3-0 is 3-0.\"\nPlaying without Paul, who is week-to-week with a left knee injury, Harden frequently bulldozed his way into the paint for layups while also keeping hot from beyond the arc. Harden made six of 13 3-pointers and added seven assists in 29 minutes.\nHouston improved to 3-0 for the first time since the 2014-15 season when it started 6-0. Dallas fell to 0-3 for the first time since the 2011-12 season, which followed their NBA title run in 2010-11.\nWithout Paul, the Rockets started Harden and Eric Gordon in their backcourt, with Demetrius Jackson playing 18 minutes and scoring four points off the bench. Gordon had 18 points, while Clint Capela had 13 points and 10 rebounds, and Nene scored 14 points off the bench.\n\"We've got a long way to go, but this was a good start for us,\" Harden said. \"As we watch film, change thin-- gs and continue to get better, we'll move forward and figure out things we can get better at.\"\nFor the Mavericks, both Yogi Ferrell and J.J. Barea had 19 points, Harrison Barnes had 14 and Wesley Matthews 11. Dirk Nowitzki was held to just two points on 1-of-8 shooting in 19 minutes.\nWhile the Mavericks played mostly with a smaller, guard-heavy lineup, Houston played its lengthy, physical forwards and dominated the rebound category. Houston outrebounded Dallas 54-41, and the margin was much wider entering the fourth quarter once the game was out of reach.\n\"There's no excuse. We just have to go get the ball,\" Matthews said. \"Simple and plain we have to go get the ball. Nobody's walking through that door that's going to go grab us 25 rebounds a night. Collectively, we have to do it. It's as simple as that.\"\nNowitzki received a technical foul for shouting at an official early in the third quarter. Tasked with playing the role of the paint protector on defense, Nowitzki struggled at times to keep Houston from scoring inside. The Rockets outscored the Mavericks 50-30 in the paint.\nHouston outscored the Mavericks in each of the first three quarters by wide margins of 13, 10 and 11 points thanks in large part to red-hot shooting. The Rockets shot 47.6 percent from the field, going 13-for-31 (42 percent) from 3-point range.\nHouston led 62-39 at the half.\n\"We've got to regroup,\" Mavericks coach Rick Carlisle said. \"We have a day off tomorrow. We have to rest. On Monday, we have the World Champions coming in. It's not like it's getting any easier.\"\nTIP-INS\nMavericks: Rookie point guard Dennis Smith Jr. missed his second straight game with swelling in his left knee. Smith, the ninth pick in the NBA draft, had 16 points and 10 assists in his debut against Atlanta. ... The Mavericks were also missing guard Devin Harris, who was granted a leave of absence following the death of his brother Thursday.\nRockets: After a 4-0 sweep of the series last season, Houston has won five straight games against Dallas, the longest streak since 1999-2000. The Rockets have won 11 of the past 14 games against Dallas. ... Rookie Zhou Qi made his NBA debut, playing seven minutes in the fourth quarter and posting three rebounds and one block. The 7-foot-1 power forward from China was drafted 43rd overall by Houston in the 2016 draft.\nUP NEXT\nMavericks: Host Golden State on Monday night.\nRockets: Host Memphis on Monday night.\n---\nFor more NBA coverage: https://apnews.com/tag/NBAbasketball"}
