{"game_id": "0021400721", "chunk_id": "0021400721_001", "order": 1, "role": "lead", "text": "TORONTO --  Already short-handed when the game began, the Milwaukee Bucks lost another player before halftime. But they didn't lose their cool, and they didn't lose the game."}
{"game_id": "0021400721", "chunk_id": "0021400721_002", "order": 2, "role": "body", "text": "Khris Middleton scored 25 points, Giannis Antetokounmpo had 12 points and 12 rebounds, and the Bucks snapped a six-game losing streak against the Toronto Raptors with an 82-75 victory Monday night."}
{"game_id": "0021400721", "chunk_id": "0021400721_003", "order": 3, "role": "body", "text": "\"It was a good win,\" center John Henson said. \"We figured out a way to win with three or four guys down.\""}
{"game_id": "0021400721", "chunk_id": "0021400721_004", "order": 4, "role": "body", "text": "Jared Dudley scored 14 points and Henson had 12 for the Bucks, who never trailed despite playing the final 28 minutes with only eight players. They held on for their fourth consecutive win while scoring just nine points in the fourth quarter."}
{"game_id": "0021400721", "chunk_id": "0021400721_005", "order": 5, "role": "body", "text": "Reduced to nine players when guard Brandon Knight was ruled out before the game with a sore right quadriceps muscle, Milwaukee saw guard O.J. Mayo get ejected after picking up a double technical at 4:07 of the second."}
{"game_id": "0021400721", "chunk_id": "0021400721_006", "order": 6, "role": "body", "text": "\"He felt bad because he let his teammates down, but the nice thing is his teammates picked him up and found a way to win on the road,\" coach Jason Kidd said."}
{"game_id": "0021400721", "chunk_id": "0021400721_007", "order": 7, "role": "body", "text": "Mayo endured some nervous moments as he watched Milwaukee's 15-point lead disappear in the fourth quarter, but the Bucks didn't break."}
{"game_id": "0021400721", "chunk_id": "0021400721_008", "order": 8, "role": "body", "text": "\"I just prayed that we'd get the win,\" Mayo said. \"Obviously you want to be out there helping the guys, but a poor decision by me.\""}
{"game_id": "0021400721", "chunk_id": "0021400721_009", "order": 9, "role": "body", "text": "Middleton didn't score in the fourth quarter but had 12 points in the third."}
{"game_id": "0021400721", "chunk_id": "0021400721_010", "order": 10, "role": "body", "text": "\"Khris was great,\" Kidd said. \"He's been great. He's been playing at a really high level offensively and defensively.\""}
{"game_id": "0021400721", "chunk_id": "0021400721_011", "order": 11, "role": "body", "text": "Jonas Valanciunas had 12 points and 13 rebounds, DeMar DeRozan scored 16 and Lou Williams 12 for the Raptors, who had won six straight overall. Toronto's 75 points were a season low."}
{"game_id": "0021400721", "chunk_id": "0021400721_012", "order": 12, "role": "body", "text": "\"That was a stinker,\" coach Dwane Casey said. \"We didn't have any energy for whatever reason.\""}
{"game_id": "0021400721", "chunk_id": "0021400721_013", "order": 13, "role": "body", "text": "Toronto, which won back-to-back overtime games at Brooklyn and Washington on Friday and Saturday, was playing for the fifth time in seven days."}
{"game_id": "0021400721", "chunk_id": "0021400721_014", "order": 14, "role": "body", "text": "Kenyon Martin scored 9 seconds into the fourth quarter to give the Bucks a 75-60 lead, but they didn't score again for more than eight minutes."}
{"game_id": "0021400721", "chunk_id": "0021400721_015", "order": 15, "role": "body", "text": "\"No one panicked on our side, we just kept playing,\" Kidd said."}
{"game_id": "0021400721", "chunk_id": "0021400721_016", "order": 16, "role": "body", "text": "Back-to-back 3-pointers by Patrick Patterson and Greivis Vasquez brought Toronto to 75-68 at 8:24. Tyler Hansbrough tipped in a missed shot by Williams to tie it at 75 with 3:45 left before Antetokounmpo finally snapped Milwaukee's scoring drought by making one of two from the line at 3:26."}
{"game_id": "0021400721", "chunk_id": "0021400721_017", "order": 17, "role": "body", "text": "The Bucks missed 15 straight field goal attempts before Dudley's 3 at 2:08 gave them a 79-75 edge."}
{"game_id": "0021400721", "chunk_id": "0021400721_018", "order": 18, "role": "body", "text": "\"Dudley hit a big, big 3,\" Henson said."}
{"game_id": "0021400721", "chunk_id": "0021400721_019", "order": 19, "role": "body", "text": "Antetokounmpo added another free throw and, after a turnover by Kyle Lowry, Jerryd Bayless sealed it with a jumper."}
{"game_id": "0021400721", "chunk_id": "0021400721_022", "order": 22, "role": "body", "text": "Bucks: Milwaukee is 17-0 when holding its opponent below 90 points. ... Jorge Gutierrez started for Knight, who had started all 47 previous games this season. ... Besides Knight, the Bucks are also without rookie Jabari Parker (left knee), Ersan Ilyasova (right groin), Zaza Pachulia (right calf), Damien Inglis (right ankle) and Kendall Marshall (right knee). C Larry Sanders is serving a 10-game suspension for a drug violation."}
{"game_id": "0021400721", "chunk_id": "0021400721_023", "order": 23, "role": "body", "text": "Raptors: Forward James Johnson (right hamstring) missed his third straight game. ... Toronto matched a season low with 14 points in the first quarter. The Raptors also scored 14 against New Orleans on Jan. 18. ... This was the first of five straight home games leading into the All-Star break. Toronto is 18-8 at home. ... Valanciunas leads the Raptors with 16 double-doubles."}
{"game_id": "0021400721", "chunk_id": "0021400721_025", "order": 25, "role": "body", "text": "Kidd said Knight \"didn't feel good enough to go\" after taking part in shootaround. Knight will undergo treatment when the team returns home Tuesday and could be back to face the Lakers on Wednesday."}
{"game_id": "0021400721", "chunk_id": "0021400721_027", "order": 27, "role": "body", "text": "Henson had two blocks against the Raptors. He has blocked at least one shot in each of the past 13 games and 18 of his last 19."}
{"game_id": "0021400721", "chunk_id": "0021400721_029", "order": 29, "role": "body", "text": "Bucks: Host Lakers on Wednesday night."}
{"game_id": "0021400721", "chunk_id": "0021400721_030", "order": 30, "role": "closing", "text": "Raptors: Host Nets on Wednesday night."}
