{"game_id": "0021400049", "chunk_id": "0021400049_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Milwaukee's road skid is over, thanks to the Bucks' first victory in Indiana in four years."}
{"game_id": "0021400049", "chunk_id": "0021400049_002", "order": 2, "role": "body", "text": "Brandon Knight had 23 points and seven rebounds, making a key jumper with 22 seconds left, as the Bucks beat the Pacers 87-81 on Tuesday night to snap a 16-game road losing streak."}
{"game_id": "0021400049", "chunk_id": "0021400049_003", "order": 3, "role": "body", "text": "Giannis Antetokounmpo finished with 11 points for the Bucks, who hadn't won on the road since February and were eight away from matching the longest road skid in franchise history, set in 1992."}
{"game_id": "0021400049", "chunk_id": "0021400049_004", "order": 4, "role": "body", "text": "\"I think the guys in the locker room see the things we've gone through early, giving up leads, not finishing games and having turnovers on the road. Being able to address those, build on them, make it a positive and finally get a win on the road was great,\" Bucks coach Jason Kidd said."}
{"game_id": "0021400049", "chunk_id": "0021400049_005", "order": 5, "role": "body", "text": "Milwaukee hadn't won in Indianapolis since Nov. 5, 2010, but the Bucks' defense was too much for a Pacers team missing most of its best players."}
{"game_id": "0021400049", "chunk_id": "0021400049_006", "order": 6, "role": "body", "text": "\"We forced them to shoot a lot of perimeter shots. We forced them to take off-balance shots. We tried to make them drive and get extra help, force them to Larry (Sanders) and I thought we did a good job of that,\" Bucks rookie Jabari Parker said."}
{"game_id": "0021400049", "chunk_id": "0021400049_007", "order": 7, "role": "body", "text": "The Pacers shot 39.7 percent while playing without starters George Hill (bruised left knee), David West (sprained right ankle) and Paul George (fractured leg)."}
{"game_id": "0021400049", "chunk_id": "0021400049_008", "order": 8, "role": "body", "text": "\"We need to play better, we know that,\" center Roy Hibbert said. \"We haven't put together a full game yet. It's something we've got to learn from. We have the firepower to get back in the game. I just want to see everybody healthy.\""}
{"game_id": "0021400049", "chunk_id": "0021400049_009", "order": 9, "role": "body", "text": "Milwaukee led 43-38 at the half and opened the third quarter on a 10-0 run. The Bucks led by as many as 17. Chris Copeland scored 10 of his 19 points in the third quarter to help Indiana rally within 69-61."}
{"game_id": "0021400049", "chunk_id": "0021400049_010", "order": 10, "role": "body", "text": "The Bucks led by 11 in the fourth quarter but Indiana used a late 10-2 run to get within three on Copeland's 3-pointer with 42 seconds remaining. Knight answered with a 21-footer to put it away."}
{"game_id": "0021400049", "chunk_id": "0021400049_011", "order": 11, "role": "body", "text": "Hibbert had 16 points and seven rebounds but was limited to just four points in the second half."}
{"game_id": "0021400049", "chunk_id": "0021400049_014", "order": 14, "role": "body", "text": "Bucks: The Bucks beat the Pacers for the first time since Dec. 18, 2012. It was just their third victory over their Central Division foes since Dec. 8, 2010. ."}
{"game_id": "0021400049", "chunk_id": "0021400049_015", "order": 15, "role": "body", "text": "Pacers: The Pacers were 1 of 10 from 3-point range in the first half. . Indiana was held without any points in the paint in the first quarter . The Pacers turned the ball over 19 times, leading to 28 points."}
{"game_id": "0021400049", "chunk_id": "0021400049_017", "order": 17, "role": "body", "text": "Knight averaged 26 points in three games against the Pacers last season, which ranked seventh in the league."}
{"game_id": "0021400049", "chunk_id": "0021400049_019", "order": 19, "role": "body", "text": "Pacers guard C.J. Miles, starting in the injury-depleted backcourt, missed all eight shots in 29 minutes. He is 14 for 50 (28 percent) from the field this season. \"I'm not overpressing, I'm not doing anything outside of what I do,\" Miles said. \"My teammates have found me and I'm open, I've just got to knock them down. That's pretty much it. There's no secret to it, no science.\""}
{"game_id": "0021400049", "chunk_id": "0021400049_021", "order": 21, "role": "body", "text": "Bucks: Host Chicago on Wednesday."}
{"game_id": "0021400049", "chunk_id": "0021400049_022", "order": 22, "role": "closing", "text": "Pacers: Visit Washington on Wednesday."}
