{"game_id": "0021700783", "chunk_id": "0021700783_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. --  On a night when Dirk Nowitzki inched closer to another NBA milestone, his Dallas teammates also took a collective step forward in what has been a mostly disappointing season."}
{"game_id": "0021700783", "chunk_id": "0021700783_002", "order": 2, "role": "body", "text": "Baby steps, for certain, but a definite move in the right direction for a team that went into the game with the worst record in the West."}
{"game_id": "0021700783", "chunk_id": "0021700783_003", "order": 3, "role": "body", "text": "Yogi Ferrell made consecutive 3-pointers to spark a big run at the start of the fourth quarter and the Mavericks beat the Sacramento Kings 106-99 on Saturday night to snap a five-game losing streak."}
{"game_id": "0021700783", "chunk_id": "0021700783_004", "order": 4, "role": "body", "text": "Nowitzki had 15 points and seven rebounds, Harrison Barnes scored 18 points and Dwight Powell added 17 points and nine rebounds to help Dallas win in Sacramento for the first time in nearly three years."}
{"game_id": "0021700783", "chunk_id": "0021700783_005", "order": 5, "role": "body", "text": "\"We did a great job keeping our composure, battling,\" Barnes said. \"A lot of times we have lost our poise but tonight we did a great job of really bearing down, keeping our composure, not getting rattled and playing through calls.\""}
{"game_id": "0021700783", "chunk_id": "0021700783_006", "order": 6, "role": "body", "text": "Nowitzki played 26 minutes and needs six more to become sixth player in NBA history to reach 50,000 for his career, joining a list that includes Kareem Abdul-Jabbar, Karl Malone, Kevin Garnett, Jason Kidd and Elvin Hayes."}
{"game_id": "0021700783", "chunk_id": "0021700783_007", "order": 7, "role": "body", "text": "\"We've been pretty good if we hold opponents under 100 points and they were well on their way to score way over,\" Nowitzki said. \"It was a little too easy there at times. They had it going and finally in the fourth we picked it up a little bit.\""}
{"game_id": "0021700783", "chunk_id": "0021700783_008", "order": 8, "role": "body", "text": "The Mavericks trailed by as much as 10 in the second half and were down 85-81 heading into the fourth before opening the final period on a 16-0 run. Devin Harris followed Ferrell's back-to-back 3s with a pair of layups, including one off a midcourt steal. After Nowitzki connected from deep, Harris made a 3-pointer to put Dallas up 97-85."}
{"game_id": "0021700783", "chunk_id": "0021700783_009", "order": 9, "role": "body", "text": "Sacramento closed to 100-94 on a free throw by De'Aaron Fox with 2:45 remaining but Barnes made a driving one-handed dunk and a more traditional two-handed jam to help the Mavericks hold on."}
{"game_id": "0021700783", "chunk_id": "0021700783_010", "order": 10, "role": "body", "text": "\"We were two steps slow most of the night,\" Kings coach Dave Joerger said. \"Too many turnovers. We could create our own shots, but not at the rim. We just didn't knock some of them down. It's not enjoyable but we're trying.\""}
{"game_id": "0021700783", "chunk_id": "0021700783_011", "order": 11, "role": "body", "text": "Dallas won for the second time in 10 games."}
{"game_id": "0021700783", "chunk_id": "0021700783_012", "order": 12, "role": "body", "text": "\"This game was similar to the last game we played these guys, I think they were down going into the fourth,\" Mavericks coach Rick Carlisle said. \"Tonight we were down and we were able to turn it around. That run really gave us a cushion and an opportunity to finish the game.\""}
{"game_id": "0021700783", "chunk_id": "0021700783_013", "order": 13, "role": "body", "text": "Fox and Temple had 15 points apiece for Sacramento. The Kings had not lost at home to the Mavericks since Feb. 5, 2015."}
{"game_id": "0021700783", "chunk_id": "0021700783_014", "order": 14, "role": "body", "text": "Barnes and Nowitzki combined for the Mavericks' first 17 points of the game while making five 3-pointers, all of them uncontested."}
{"game_id": "0021700783", "chunk_id": "0021700783_015", "order": 15, "role": "body", "text": "Dallas got a lift from Powell early in the second and Barnes added a fourth 3, but Buddy Hield hit a 13-foot runner to beat the shot clock buzzer with 6.9 seconds left and pull the Kings within 56-54 at halftime."}
{"game_id": "0021700783", "chunk_id": "0021700783_017", "order": 17, "role": "body", "text": "Mavericks: Barnes' first 12 points came on 3-pointers. . Dallas is 13-10 when holding opponents under 100 points. . Powell had three dunks in the third quarter, including on back-to-back possessions."}
{"game_id": "0021700783", "chunk_id": "0021700783_018", "order": 18, "role": "body", "text": "Kings: Sacramento missed its first 10 shots in the fourth quarter. ... Kosta Koufos started the third quarter in place of Randolph. Koufos finished with eight points and seven rebounds. ... Jason Williams, who was a wildly popular player in Sacramento from 1998-2001, sat courtside next to owner Vivek Ranadive."}
{"game_id": "0021700783", "chunk_id": "0021700783_020", "order": 20, "role": "body", "text": "JJ Barea scored five points on 2-of-12 shooting but had 11 assists in 24 minutes in his return after missing the previous three games with a left oblique strain. \"He's got to be one of the smartest pick-and-roll players this league has,\" Nowitzki said. \"If you go under he usually shoots. If you go over, he kind of puts his defender in jail and plays cat-and-mouse with the big.\""}
{"game_id": "0021700783", "chunk_id": "0021700783_022", "order": 22, "role": "body", "text": "Mavericks: Play at the Los Angeles Clippers on Monday."}
{"game_id": "0021700783", "chunk_id": "0021700783_023", "order": 23, "role": "closing", "text": "Kings: Host the Chicago Bulls on Monday night."}
