{"game_id": "0021700685", "chunk_id": "0021700685_001", "order": 1, "role": "lead", "text": "DETROIT --  Spencer Dinwiddie hit the big shot against a familiar foe."}
{"game_id": "0021700685", "chunk_id": "0021700685_002", "order": 2, "role": "body", "text": "Dinwiddie's jumper with 0.9 seconds left lifted the Brooklyn Nets over Detroit 101-100 Sunday, the Pistons' fifth straight loss."}
{"game_id": "0021700685", "chunk_id": "0021700685_003", "order": 3, "role": "body", "text": "After a basket by Andre Drummond put the Pistons ahead with 4.7 seconds left, Dinwiddie took the inbounds pass, drove to 14 feet and drained a jumper against his former teammates."}
{"game_id": "0021700685", "chunk_id": "0021700685_004", "order": 4, "role": "body", "text": "The Pistons picked Dinwiddie in the second round of the 2014 draft, despite a knee injury, and he played 46 games for them over two seasons."}
{"game_id": "0021700685", "chunk_id": "0021700685_005", "order": 5, "role": "body", "text": "\"That was a heck of a shot,\" Nets coach Kenny Atkinson said. \"I'm happy for Spencer, because he was here, obviously, but I'm happier for the team. I wasn't sure we had the poise and understanding to get a win like this.\""}
{"game_id": "0021700685", "chunk_id": "0021700685_006", "order": 6, "role": "body", "text": "Pistons coach Stan Van Gundy blamed himself for the final basket, where Ish Smith, generously listed as six feet tall, was covering the 6-foot-6 Dinwiddie."}
{"game_id": "0021700685", "chunk_id": "0021700685_007", "order": 7, "role": "body", "text": "\"Ish did a great job of guarding him, but I probably should have had more size out there against him,\" Van Gundy said. \"Ish gave him a tough look, but Spencer was able to get above him and make a great shot.\""}
{"game_id": "0021700685", "chunk_id": "0021700685_008", "order": 8, "role": "body", "text": "Dinwiddie finished with 22 points. Tobias Harris led the Pistons with 20."}
{"game_id": "0021700685", "chunk_id": "0021700685_009", "order": 9, "role": "body", "text": "Caris LeVert split a pair of free throws with 13.7 seconds left, giving the Nets a 99-98 edge. It was the second time he missed a free throw in the final 42 seconds."}
{"game_id": "0021700685", "chunk_id": "0021700685_010", "order": 10, "role": "body", "text": "Langston Galloway misplayed the ensuing inbounds pass, but was able to knock the ball to Drummond. Detroit's center nearly traveled in a rare drive from outside the 3-point arc, and flipped in a go-ahead shot."}
{"game_id": "0021700685", "chunk_id": "0021700685_011", "order": 11, "role": "body", "text": "\"I felt like we were focused and locked in tonight,\" said Rondae Hollis-Jefferson, who finished with 21 points, eight rebounds and seven assists for the Nets. \"We were playing a really good team on their floor, but we trusted Spencer to make that last play.\""}
{"game_id": "0021700685", "chunk_id": "0021700685_012", "order": 12, "role": "body", "text": "On Jan. 10, the Pistons routed Brooklyn 114-80 behind 22 points and 20 rebounds from Drummond. That was Detroit's last victory, with three of the five defeats coming at Little Caesars Arena."}
{"game_id": "0021700685", "chunk_id": "0021700685_013", "order": 13, "role": "body", "text": "\"We don't play again until Wednesday, so I have some time to think about how to fix this,\" Van Gundy said. \"We just don't play hard on a consistent basis. We've fallen behind early, but even when we had a great start on Friday (against Washington), we didn't keep it going.\""}
{"game_id": "0021700685", "chunk_id": "0021700685_014", "order": 14, "role": "body", "text": "The Nets led 53-48 at halftime. The Pistons had one offensive rebound in the half, slowed by Drummond's three fouls."}
{"game_id": "0021700685", "chunk_id": "0021700685_015", "order": 15, "role": "body", "text": "\"I think the key was the way we started,\" Hollis-Jefferson said. \"That was big, and it is what you need to do to win games like this.\""}
{"game_id": "0021700685", "chunk_id": "0021700685_016", "order": 16, "role": "body", "text": "Drummond picked up his fourth foul early in the third quarter, sending him back to the bench. Brooklyn quickly moved the lead to 11 as Detroit struggled to get open shots."}
{"game_id": "0021700685", "chunk_id": "0021700685_017", "order": 17, "role": "body", "text": "Detroit trailed by nine going into the fourth quarter. Smith's 3-pointer with 2:58 left tied it at 92."}
{"game_id": "0021700685", "chunk_id": "0021700685_018", "order": 18, "role": "body", "text": "\"This was huge,\" said Joe Harris, who had 12 points for Brooklyn. \"We're getting into these games and we're finally starting to finish them.\""}
{"game_id": "0021700685", "chunk_id": "0021700685_020", "order": 20, "role": "body", "text": "Nets: D'Angelo Russell played 14 minutes in his second game back from a knee injury, finishing with three points and one assist. ... The win ended Brooklyn's four-game losing streak in Detroit."}
{"game_id": "0021700685", "chunk_id": "0021700685_021", "order": 21, "role": "body", "text": "Pistons: Johnson played his second game after missing three with a recurring hip problem, finishing with a season-high 18 points in 26 minutes. \"I though Stanley was really good defensively, and he played well on the offensive end, too,\" Van Gundy said."}
{"game_id": "0021700685", "chunk_id": "0021700685_023", "order": 23, "role": "body", "text": "The Nets are now 1-0 at Little Caesars Arena after going 8-44 in Detroit during the 29 seasons that the Pistons played at the Palace of Auburn Hills."}
{"game_id": "0021700685", "chunk_id": "0021700685_025", "order": 25, "role": "body", "text": "Nets: At Oklahoma City on Tuesday in the third game of a five-game road trip."}
{"game_id": "0021700685", "chunk_id": "0021700685_026", "order": 26, "role": "closing", "text": "Pistons: Host Utah on Wednesday."}
