{"game_id": "0021700682", "chunk_id": "0021700682_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Damian Lillard tried to make a final statement as the NBA All-Star roster deadline nears."}
{"game_id": "0021700682", "chunk_id": "0021700682_002", "order": 2, "role": "body", "text": "The Portland guard hit his first nine shots -- including seven 3-pointers -- and scored 31 points as the Trail Blazers beat the Dallas Mavericks 117-108 on Saturday night for their season-best sixth consecutive home win."}
{"game_id": "0021700682", "chunk_id": "0021700682_003", "order": 3, "role": "body", "text": "Lillard, who didn't miss a shot until late in the third quarter, went 10 of 15 from the floor and handed out nine assists to lead Portland. Backcourt mate CJ McCollum scored 26 points, while Evan Turner had 17 points and Al-Farouq Aminu 13."}
{"game_id": "0021700682", "chunk_id": "0021700682_004", "order": 4, "role": "body", "text": "Portland tied a season high with 18 3-pointers. Six Blazers made at least two each, led by Lillard's seven."}
{"game_id": "0021700682", "chunk_id": "0021700682_005", "order": 5, "role": "body", "text": "NBA All-Star reserves, voted by the coaches, will be announced Tuesday. Portland's next game isn't until Monday, and by then, many coaches will have already voted. Saturday's performance might have been Lillard's last All-Star statement."}
{"game_id": "0021700682", "chunk_id": "0021700682_006", "order": 6, "role": "body", "text": "Lillard didn't see Saturday's game as an All-Star audition, but rather, what he's supposed to do."}
{"game_id": "0021700682", "chunk_id": "0021700682_007", "order": 7, "role": "body", "text": "\"I gotta play at a certain way and perform at a certain level for us to be able to win games,\" he said. \"That's why my job is. I don't have anything else to say about it.\""}
{"game_id": "0021700682", "chunk_id": "0021700682_008", "order": 8, "role": "body", "text": "Turner spoke up on Lillard's behalf."}
{"game_id": "0021700682", "chunk_id": "0021700682_009", "order": 9, "role": "body", "text": "\"He's been playing at a high level,\" Turner said. \"An All-Star level. They screwed him the last two years, right? When's the make-up call? They owe him a couple. That's case enough.\""}
{"game_id": "0021700682", "chunk_id": "0021700682_010", "order": 10, "role": "body", "text": "Wesley Matthews led Dallas with 23 points. Dirk Nowitzki and Dennis Smith Jr. scored 21 points each, with Nowitzki setting a season high."}
{"game_id": "0021700682", "chunk_id": "0021700682_011", "order": 11, "role": "body", "text": "Portland led by 18 points in the second half but had trouble putting away the pesky Mavericks. Dallas whittled away at Portland's advantage during the fourth quarter, getting as close as five points with 36 seconds remaining. A dunk by the Blazers' Ed Davis with 17 seconds left put the Mavericks away."}
{"game_id": "0021700682", "chunk_id": "0021700682_012", "order": 12, "role": "body", "text": "Portland led 62-45 at halftime, after the Blazers shot 57 percent (24 of 42) during the first half."}
{"game_id": "0021700682", "chunk_id": "0021700682_013", "order": 13, "role": "body", "text": "\"First half, I thought was bad. Second half was very good. You've got to play both halves, so we've got to get a better start,\" Dallas coach Rick Carlisle said."}
{"game_id": "0021700682", "chunk_id": "0021700682_014", "order": 14, "role": "body", "text": "Portland led 33-20 after the first quarter, and its dominance was particularly evidence on the final two baskets. Shabazz Napier stripped J.J. Barea at midcourt and finished with a rare dunk. Seconds later, McCollum had a layup after blowing by Yogi Ferrell so quickly the Dallas guard fell to the ground."}
{"game_id": "0021700682", "chunk_id": "0021700682_016", "order": 16, "role": "body", "text": "Mavericks: Barea returned to the lineup after missing Tuesday's game at Denver. He scored 12 points. ... This is the second time this season Dallas has had a four-day break in between games. The Mavericks are 0-2 in that situation. ... Devin Harris suffered a head injury during the first half and didn't return."}
{"game_id": "0021700682", "chunk_id": "0021700682_017", "order": 17, "role": "body", "text": "Trail Blazers: Matthews left the Blazers for Dallas following the 2014-15 season, but he's still popular in Portland, as fans warmly cheered him during pregame introductions. ... Last season, Lillard averaged 28.3 points in three games against the Mavericks."}
{"game_id": "0021700682", "chunk_id": "0021700682_019", "order": 19, "role": "body", "text": "The game got chippy down the stretch, with three technical fouls during the final five minutes. The most prominent happened after Blazers' Jusuf Nurkic and Dallas' Salah Mejri became entangled under the basket. As the two released, Mejri flew to the ground. After consulting the television monitor, Nurkic was assessed a technical."}
{"game_id": "0021700682", "chunk_id": "0021700682_020", "order": 20, "role": "body", "text": "\"I thought he locked my arm and I didn't like that. So I let him know -- dirty plays -- I don't like that,\" Nurkic said. \"The refs are going to do what they're going to do. He got fouled and then he locked my arm on purpose. That's not good.\""}
{"game_id": "0021700682", "chunk_id": "0021700682_022", "order": 22, "role": "body", "text": "Mavericks: Monday night at home against Washington"}
{"game_id": "0021700682", "chunk_id": "0021700682_023", "order": 23, "role": "body", "text": "Trail Blazers: Monday night at Denver."}
{"game_id": "0021700682", "chunk_id": "0021700682_025", "order": 25, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
