{"game_id": "0021400629", "chunk_id": "0021400629_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  After another entertaining victory, the Detroit Pistons received a visit from grateful owner Tom Gores."}
{"game_id": "0021400629", "chunk_id": "0021400629_002", "order": 2, "role": "body", "text": "\"Tom came in and talked to the team after the game, and he's very excited,\" coach Stan Van Gundy said. \"He thanked them for not giving up on the season when it was 5-23, and he talked about how much that means to him and to the whole city. He talked to the coaches as well, and there wasn't a single time where he tried to take any of the credit. He's unselfish, but we all know that he's the catalyst for what we have started to do here.\""}
{"game_id": "0021400629", "chunk_id": "0021400629_003", "order": 3, "role": "body", "text": "Detroit has won 12 of 15 since that 5-23 start, and the latest victory was an exciting one. Brandon Jennings had 24 points and a career-high 21 assists, and the Pistons held off the Orlando Magic 128-118 on Wednesday night."}
{"game_id": "0021400629", "chunk_id": "0021400629_004", "order": 4, "role": "body", "text": "Andre Drummond added 26 points and 16 rebounds for the Pistons. Detroit nearly blew a 21-point third-quarter lead, but Jennings helped the Pistons close it out in the fourth."}
{"game_id": "0021400629", "chunk_id": "0021400629_005", "order": 5, "role": "body", "text": "\"Finding guys, guys are getting easy shots, guys are making shots,\" Jennings said. \"It was one of those nights where you're like, `I'm close to 19 (assists), I better get 20.\""}
{"game_id": "0021400629", "chunk_id": "0021400629_006", "order": 6, "role": "body", "text": "Gores took over as Detroit's owner in 2011, and this is the most encouraging stretch the team has had since then. He spoke with reporters at halftime."}
{"game_id": "0021400629", "chunk_id": "0021400629_007", "order": 7, "role": "body", "text": "\"I'm just happy really, honestly, for our fans, for the city of Detroit,\" Gores said. \"For me, I feel like I was brought in as a new owner to deliver something, and I feel like I'm at least delivering a part of what fans expect. I'm really proud of this team, the way they're fighting. I'm proud of Stan for not giving up.\""}
{"game_id": "0021400629", "chunk_id": "0021400629_008", "order": 8, "role": "body", "text": "Greg Monroe had 24 points and 10 rebounds for Detroit, which never trailed. The Pistons led by 11 after the first quarter and by 17 at halftime."}
{"game_id": "0021400629", "chunk_id": "0021400629_009", "order": 9, "role": "body", "text": "Nikola Vucevic led Orlando with 26 points. The Magic cut the lead to two in the fourth, but the Pistons went on a 14-2 run to regain a comfortable margin."}
{"game_id": "0021400629", "chunk_id": "0021400629_010", "order": 10, "role": "body", "text": "With the score 102-100, Jennings scored four straight points, and he later found Anthony Tolliver for a 3-pointer that made it 111-102."}
{"game_id": "0021400629", "chunk_id": "0021400629_011", "order": 11, "role": "body", "text": "A 3-pointer by Jodie Meeks -- off another assist by Jennings -- put the Pistons up by 14."}
{"game_id": "0021400629", "chunk_id": "0021400629_012", "order": 12, "role": "body", "text": "The Pistons jumped to a 26-12 lead and were ahead 35-24 after one. The Magic cut the lead to six before Detroit finished the half on a 13-2 run. Kyle Singler's 3-pointer at the buzzer made it 65-48."}
{"game_id": "0021400629", "chunk_id": "0021400629_013", "order": 13, "role": "body", "text": "Singler finished with 14 points for Detroit."}
{"game_id": "0021400629", "chunk_id": "0021400629_014", "order": 14, "role": "body", "text": "Orlando's Victor Oladipo scored 23 points, but the Magic wasted that effort with another poor defensive performance. This was the most points they've allowed all season, surpassing Sunday's 127-99 loss to Oklahoma City."}
{"game_id": "0021400629", "chunk_id": "0021400629_015", "order": 15, "role": "body", "text": "Jennings was the first player with at least 20 points and 20 assists in a game since Steve Nash had 21 points and 20 assists for Phoenix against Philadelphia on Nov. 9, 2009, according to STATS."}
{"game_id": "0021400629", "chunk_id": "0021400629_017", "order": 17, "role": "body", "text": "Orlando rookie Devyn Marble started and played 20 minutes against the team he grew up rooting for. Marble was born in nearby Southfield, Michigan."}
{"game_id": "0021400629", "chunk_id": "0021400629_018", "order": 18, "role": "body", "text": "\"I was happy to be back,\" Marble said. \"I wanted to come out here and try to get a `W' -- came up short, so it's on to the next one.\""}
{"game_id": "0021400629", "chunk_id": "0021400629_019", "order": 19, "role": "body", "text": "Marble's father Roy lives in Michigan and has been battling cancer. He was at the game Wednesday."}
{"game_id": "0021400629", "chunk_id": "0021400629_021", "order": 21, "role": "body", "text": "Jennings has been instrumental in Detroit's surge back into playoff contention, and he had 11 assists in the first half. His lob to Drummond for a one-handed dunk was a highlight of the third quarter and put the Pistons ahead 92-73. It was another alley-oop to Drummond that gave Jennings a career high with his 20th assist. That dunk made it 122-110."}
{"game_id": "0021400629", "chunk_id": "0021400629_022", "order": 22, "role": "body", "text": "\"(Jennings) was phenomenal tonight,\" Van Gundy said. \"He was getting to the lane and making plays. He was making his shots when he got them.\""}
{"game_id": "0021400629", "chunk_id": "0021400629_024", "order": 24, "role": "body", "text": "Magic: Tobias Harris missed all five of his shots in the first half, but he finished with 19 points in his return after missing five games with a sprained left ankle."}
{"game_id": "0021400629", "chunk_id": "0021400629_025", "order": 25, "role": "body", "text": "Pistons: Jennings had 19 assists for Milwaukee on March 2, 2013, in an overtime win over Toronto. ... Detroit's 128 points set a season high. The previous mark came in a 119-109 win over Indiana on Dec. 26 in what was the Pistons' first game after waiving forward Josh Smith."}
{"game_id": "0021400629", "chunk_id": "0021400629_027", "order": 27, "role": "body", "text": "Magic: Visit New York on Friday night."}
{"game_id": "0021400629", "chunk_id": "0021400629_028", "order": 28, "role": "closing", "text": "Pistons: Visit Milwaukee on Saturday night."}
