{"game_id": "0021700860", "chunk_id": "0021700860_001", "order": 1, "role": "lead", "text": "HOUSTON --  After extending their winning streak to 10 games with a victory over the Sacramento Kings on Wednesday night, the Houston Rockets were happy, though far from satisfied."}
{"game_id": "0021700860", "chunk_id": "0021700860_002", "order": 2, "role": "body", "text": "These Rockets, who are 44-13 entering the All-Star break after winning 17 of their last 19 games, have much bigger goals ahead of them."}
{"game_id": "0021700860", "chunk_id": "0021700860_003", "order": 3, "role": "body", "text": "Ask anyone on the team if they believe they can get better after the break and the answer comes quickly -- and often in one word."}
{"game_id": "0021700860", "chunk_id": "0021700860_004", "order": 4, "role": "body", "text": "\"Absolutely,\" Chris Paul said."}
{"game_id": "0021700860", "chunk_id": "0021700860_005", "order": 5, "role": "body", "text": "\"Of course,\" James Harden said, before the question was even done."}
{"game_id": "0021700860", "chunk_id": "0021700860_006", "order": 6, "role": "body", "text": "Harden had 28 points, nine rebounds and nine assists, and the Rockets fought off a late rally for the 100-91 win."}
{"game_id": "0021700860", "chunk_id": "0021700860_007", "order": 7, "role": "body", "text": "Houston led by as many as 17, but the Kings got within striking distance several times in the fourth quarter. They were down six late when Houston used a 7-2 run, capped by a 3-pointer from Harden, to make it 94-83 with just more than a minute left."}
{"game_id": "0021700860", "chunk_id": "0021700860_008", "order": 8, "role": "body", "text": "The Kings scored the next five points, with a 3-pointer from Garrett Temple, to cut it to six again with 30 seconds left. Joe Johnson, in his Houston debut, added two free throws before Bogdan Bogdanovic hit a 3-pointer to cut the lead to 96-91 with about 25 seconds left."}
{"game_id": "0021700860", "chunk_id": "0021700860_009", "order": 9, "role": "body", "text": "The Rockets made four free throws after that to secure the win."}
{"game_id": "0021700860", "chunk_id": "0021700860_010", "order": 10, "role": "body", "text": "\"We didn't have that energy and you could just see it,\" coach Mike D'Antoni said. \"But they have the confidence that they can get it done defensively or by any means, and we just finished it up. Not a whole lot to say other than workmanship.\""}
{"game_id": "0021700860", "chunk_id": "0021700860_011", "order": 11, "role": "body", "text": "Paul added 19 points and seven assists, and Clint Capela had 13 points and 11 rebounds."}
{"game_id": "0021700860", "chunk_id": "0021700860_012", "order": 12, "role": "body", "text": "Bogdanovic led the Kings with 20 points and Temple came off the bench to add 13."}
{"game_id": "0021700860", "chunk_id": "0021700860_013", "order": 13, "role": "body", "text": "\"We've got some young guys, and the older guys are always saying: `Come on you young guys,\" coach Dave Joerger said. \"We know (they're) going to be good but we've got to hurry up and accelerate this as much as possible.\""}
{"game_id": "0021700860", "chunk_id": "0021700860_014", "order": 14, "role": "body", "text": "Temple, who scored the last four points of the third quarter, opened the fourth with another basket to cut Houston's lead to seven. But Johnson made a 3-pointer on the next possession to make it 75-65."}
{"game_id": "0021700860", "chunk_id": "0021700860_015", "order": 15, "role": "body", "text": "A 6-2 run by Sacramento cut the lead to seven later in the quarter before Harden made a 3-pointer to make it 83-73 midway through the period."}
{"game_id": "0021700860", "chunk_id": "0021700860_016", "order": 16, "role": "body", "text": "Houston, which entered the game averaging an NBA-best 31.3 points in the first quarter, scored a season-low 20 points on Wednesday. The Rockets got going in the second quarter behind 17 points from Paul to lead 55-45 at halftime."}
{"game_id": "0021700860", "chunk_id": "0021700860_017", "order": 17, "role": "body", "text": "The Rockets made the first four points of the third quarter before Bogdanovic scored all of Sacramento's points in a 7-3 run to cut the lead to 62-52 with about seven minutes left."}
{"game_id": "0021700860", "chunk_id": "0021700860_018", "order": 18, "role": "body", "text": "Houston scored the next seven points, while Sacramento missed its next eight shots, to leave the Rockets up 69-52 with about three minutes left in the quarter."}
{"game_id": "0021700860", "chunk_id": "0021700860_019", "order": 19, "role": "body", "text": "The Kings ended a scoring drought of more than five minutes after that when JaKarr Sampson made one of two free throws. That was the start of the 7-3 run by Sacramento, with two 3-pointers from Buddy Hield, that got the Kings within 72-59 about a minute later."}
{"game_id": "0021700860", "chunk_id": "0021700860_021", "order": 21, "role": "body", "text": "Kings: Willie Cauley-Stein had 12 points, five assists and eight rebounds. ... The Kings made 10 of 32 3-pointers, led by four from Bogdanovic. ... Hield scored 12 points."}
{"game_id": "0021700860", "chunk_id": "0021700860_022", "order": 22, "role": "body", "text": "Rockets: Eric Gordon sat out after bruising his right knee on Tuesday night. ... Trevor Ariza missed his ninth straight game with a strained left hamstring. ... Capela had two blocks and has had at least two in eight of his last nine games."}
{"game_id": "0021700860", "chunk_id": "0021700860_024", "order": 24, "role": "body", "text": "The Rockets wasted no time putting Johnson to work. Johnson, who signed with the team on Wednesday afternoon, checked in with about four minutes left in the first quarter. The 36-year-old free agent spent 32 games with the Jazz this season. The move reunites him with D'Antoni, who he played for in Phoenix from 2002-05."}
{"game_id": "0021700860", "chunk_id": "0021700860_025", "order": 25, "role": "body", "text": "Johnson had nine points and three rebounds in 31 minutes and the Rockets are looking forward to seeing what he can contribute once he gets better acquainted with the team."}
{"game_id": "0021700860", "chunk_id": "0021700860_026", "order": 26, "role": "body", "text": "\"Joe's going to fit in great,\" D'Antoni said. \"He's going to be really good, smooth ... he can make plays. He's got some gas left.\""}
{"game_id": "0021700860", "chunk_id": "0021700860_028", "order": 28, "role": "body", "text": "Kings: Host Oklahoma City on Feb. 22."}
{"game_id": "0021700860", "chunk_id": "0021700860_029", "order": 29, "role": "body", "text": "Rockets: Host Minnesota on Feb. 23."}
{"game_id": "0021700860", "chunk_id": "0021700860_031", "order": 31, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
