{"game_id": "0021300134", "chunk_id": "0021300134_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- Zach Randolph and Marc Gasol were just too much for the injury-riddled Los Angeles Lakers to overcome in the fourth quarter of an ugly loss to the Memphis Grizzlies.\nRandolph scored 14 of his 28 points in the final period and grabbed 11 rebounds, Gasol had 18 points, eight boards and eight assists, and the Grizzlies eked out an 89-86 victory Friday night for their first road victory of the season.\n\"Everybody knows that we go as Zach goes. That's our horse, him and Marc. And we need them to continue that throughout the year,\" guard Tony Allen said. \"Everybody came here with their antennas up, and everybody just wanted to get this win more than the other team. And it showed. We played hard for 48 minutes.\""}
{"game_id": "0021300134", "chunk_id": "0021300134_002", "order": 2, "role": "closing", "text": "Mike Conley had 11 points and seven assists for the Grizzlies in the opener of a four-game California trip. Last season they finished with a winning road record for the first time at 24-17, third-best in the NBA.\n\"It felt good, especially being our first road win of the season,\" Randolph said. \"We had been up and down and inconsistent, so it was just good to get a win and build from here.\"\nReserve shooting guard Jodie Meeks had 25 points for the Lakers (4-7), who have lost four of their past five games without their injured starting backcourt of Kobe Bryant and Steve Nash. They are off to their worst start through 11 games since 2002-03, when they began 3-8 following their third straight championship.\n\"Kobe's not out there to bail us out, but we have good players on this team and everyone is confident in one another,\" Meeks said. \"I feel like we had a chance to win, but we couldn't for whatever reason. It's frustrating, but we're not panicking. There are 71 more games left.\"\nLakers center Pau Gasol had 10 points on 4-for-12 shooting and grabbed 13 rebounds playing against his younger brother, who was the NBA's defensive player of the year last season.\n\"We have to score more points and we have to make bigger plays,\" coach Mike D'Antoni said after the Lakers were held to fewer than 90 points for the third time. \"I felt that it was better tonight that we showed up at the rim more. But when you put everything together, we had some turnovers and some sloppy plays that led to fast breaks.\"\nForward Shawne Williams, one of seven new players on the Lakers' roster, hit back-to-back 3-pointers 39 seconds apart to give Los Angeles a 75-73 lead with 7:19 remaining. But Randolph responded with eight points during a 3:06 span, capping it on a fadeaway baseline jumper over Jordan Hill to give Memphis an 83-81 lead it would not relinquish.\n\"I was just trying to let it come to me and try to be aggressive,\" Randolph said.\nRandolph added a spinning layup and two free throws in the final 17 seconds after Lakers guard Steve Blake missed a 20-footer and a 3-point attempt at the other end.\nHill, who averaged 19.5 points in his first two starts of the season, put the Lakers in a bind after picking up two fouls 40 seconds apart and went to the bench with 8:12 left in the first quarter. Chris Kaman replaced him and missed his first five shots, including a layup that was blocked by Tayshaun Prince.\n\"It was real important to get Hill out of the game early,\" Randolph said. \"Like I told the kid, he's having a helluva season.\"\nNick Young provided a much-needed spark off the bench for the lethargic Lakers in the second quarter with 12 points, including a pair of jumpers in the final minute of the half to help them leave the court tied at 40-all after they trailed by as many as 10.\nGame notes\nKobe Bryant, sidelined indefinitely after surgery on his torn Achilles tendon in April, walked onto the court to a standing ovation at the end of the first quarter -- in his Lakers warm-ups -- and presented a $150,000 check from the club to representatives of the Philippine Red Cross following last week's deadly typhoon. ... The Lakers, whose streak of 320 consecutive home sellouts (including playoffs) ended Tuesday night when they came up 571 short of capacity in their win over New Orleans, announced a packed house of 18,997 for this one. ... Memphis is 7-10 against Los Angeles when the Gasols have played against each other. In the 16 previous head-to-head battles between them, Pau averaged 15.0 points, 9.8 rebounds and 47.9 percent from the field, while Marc averaged 10.6 points, 8.9 boards and 42.4 percent shooting."}
