{"game_id": "0021300908", "chunk_id": "0021300908_001", "order": 1, "role": "lead", "text": "NEW YORK -- Jason Kidd has a winning record for the first time in his coaching career.\n\"Doesn't matter,\" he said. \"It doesn't. We're playing better, that's all that matters.\"\nBetter than anybody in the Eastern Conference since the new year, in fact.\nJoe Johnson scored 21 points, Marcus Thornton came off the bench for 20, and the Nets powered their way above .500 for the first time this season by beating the Memphis Grizzlies 103-94 on Wednesday night.\nDeron Williams added 16 points and Paul Pierce 14 for the Nets (30-29), who have won four in a row overall and six straight at home in turning around a turbulent start.\nThey are still only sixth in the Eastern Conference, but look capable of climbing more after following a rout of Chicago on Monday by clobbering the Grizzlies for most of this one.\nThe matchup between two of the NBA's best teams in 2014 was a mismatch until the fourth quarter, when the Nets had already led by 30. Memphis fell to 21-9 since Jan. 1, while the Nets' 20-8 record is tops among East teams.\n\"It's not always how you start, it's going to be how you finish. And I think with the way we've been playing as of late, since the All-Star break, since the turn of the new year, this is the Nets team that I envisioned from the beginning of the season,\" Pierce said.\nJon Leuer scored 19 and Marc Gasol 18 for the Grizzlies, who were without Zach Randolph because of the flu and then turned in a sickly performance. Memphis never led and missed a chance to tie Phoenix for the West's eighth and final playoff spot.\n\"We look at the standings every day. I hear guys talking about who lost, who won. Just to come out with a performance like this is devastating,\" guard Tony Allen said. \"But we can't hold our heads down. We've got to keep pushing.\"\nLeading scorer Mike Conley missed all eight shots and had two points and six turnovers.\n\"It was a tough night,\" Memphis coach Dave Joerger said. \"We had some guys really, really struggle tonight. Give them credit. They came out and played with a much more forceful nature, attacking us, both being physical defensively and just the mentality that, you know `We're going to bring it to you.\"\nJason Collins played 17 scoreless minutes on the day he signed his second 10-day contract. The NBA's first openly gay player got a visit in the locker room before the game from Commissioner Adam Silver, but received just polite applause when he checked in during the second quarter after getting a standing ovation Monday during his home debut.\nRandolph sat in front of his locker before the game with his sweatshirt's hood pulled over his head, ultimately deciding he lacked the energy to play.\nPierce went right at his replacement, Ed Davis, and already had eight points by the time Davis was yanked with the Grizzlies trailing 13-2. James Johnson replaced him and quickly botched a fast-break layup as Memphis missed 10 of its first 11 shots. Andray Blatche's three-point play made it 26-5 with 3:30 left in the first, and Brooklyn led 54-44 at halftime.\nBrooklyn scored the first 11 of the second half to open a 19-point lead and kept pouring it on by making six 3-pointers in the third quarter. The lead hit 87-57 on Johnson's short jumper, but the Nets had to bring starters back when the Grizzlies sliced that in half by midway in the fourth.\nThe Nets were 10-21 after getting blown out at San Antonio on New Year's Eve, threatening to become the NBA's biggest flop after building a team that would cost more than $180 million in salary and taxes.\nBut they've kept rolling after losing leading scorer Brook Lopez for the season, and most recently playing without Kevin Garnett for the past three because of back spasms.\nThey picked up Thornton in a trade with Sacramento just before the trade deadline, a move that was all but ignored after they signed Collins a few days later. But he's scored 20 or more in two of his first five games with the Nets, and had 15 in the second quarter alone Wednesday.\nGame notes\nThe Nets are 9-3 against West teams since Jan. 1. ... The Grizzlies' Nick Calathes was chosen Wednesday as the Western Conference rookie of the month for February, when he averaged 10.7 points and 4.6 assists. ... Memphis had scored 110 in each of two previous games and was averaging 103.4 since the All-Star break."}
