{"game_id": "0021700118", "chunk_id": "0021700118_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  Damian Lillard didn't really need to gesture to his wrist. The crowd already knew it was Lillard Time."}
{"game_id": "0021700118", "chunk_id": "0021700118_002", "order": 2, "role": "body", "text": "The star guard made a 3-pointer with 0.7 seconds left and the Portland Trail Blazers extended their winning streak over the Los Angeles Lakers to 13 games with a 113-110 victory Thursday night."}
{"game_id": "0021700118", "chunk_id": "0021700118_003", "order": 3, "role": "body", "text": "Lillard finished with 32 points, and Portland snapped a two-game skid. Jusuf Nurkic added 28 points."}
{"game_id": "0021700118", "chunk_id": "0021700118_004", "order": 4, "role": "body", "text": "Lillard was 1 of 5 from 3-point range before the game-winner. The crowd roared when the shot fell, and Lillard nodded and pointed to his wrist."}
{"game_id": "0021700118", "chunk_id": "0021700118_005", "order": 5, "role": "body", "text": "\"I felt good. The ball was coming off my hands good all night, even the ones that I didn't make. In those moments, you don't think about what happened before. It's a chance to rise to the occasion. You're 0 for 0 in that moment,\" Lillard said. \"I go back to my very first game-winner against New Orleans my rookie year. I had a terrible shooting game but I was able to block that out. All that mattered was that moment. No different tonight.\""}
{"game_id": "0021700118", "chunk_id": "0021700118_006", "order": 6, "role": "body", "text": "Brook Lopez had 27 points and rookie Kyle Kuzma added a season-high 22 for the Lakers, who were short-handed after Larry Nance Jr. broke his left hand in the second half. Fellow rookie Lonzo Ball was 0 for 2 from the field with no points, four assists and three rebounds."}
{"game_id": "0021700118", "chunk_id": "0021700118_007", "order": 7, "role": "body", "text": "There were a few fans in the crowd wearing Ball's No. 2 jersey for his first appearance in Portland. But most fans booed him heartily during player introductions."}
{"game_id": "0021700118", "chunk_id": "0021700118_008", "order": 8, "role": "body", "text": "Nance was hurt late in the third quarter and went to the locker room. He did not play the rest of the way. Nance was averaging 11.1 points and 7.9 rebounds for the Lakers."}
{"game_id": "0021700118", "chunk_id": "0021700118_009", "order": 9, "role": "body", "text": "Afterward, the Lakers confirmed Nance broke a bone in his hand."}
{"game_id": "0021700118", "chunk_id": "0021700118_010", "order": 10, "role": "body", "text": "\"Obviously, I feel terrible for him. He's been playing so solid for us,\" coach Luke Walton said. \"It's tough but that's what team sports are about, and someone else has to step up.\""}
{"game_id": "0021700118", "chunk_id": "0021700118_011", "order": 11, "role": "body", "text": "Portland took a 106-105 lead on Lillard's free throws with 1:56 left. Kuzma made a hook shot on the other end, but Lillard answered with a layup before Nurkic made free throws for a 110-107 lead. The standing crowd chanted \"Beat LA! Beat LA!\""}
{"game_id": "0021700118", "chunk_id": "0021700118_012", "order": 12, "role": "body", "text": "But Kentavious Caldwell-Pope quieted the fans with a 3-pointer off an assist from Ball to tie it with 15.5 seconds left. Lillard hit the winner over the outstretched arm of Brandon Ingram."}
{"game_id": "0021700118", "chunk_id": "0021700118_013", "order": 13, "role": "body", "text": "Kuzma took the final shot, a missed 3-pointer from 28 feet out at the buzzer that would have tied it."}
{"game_id": "0021700118", "chunk_id": "0021700118_014", "order": 14, "role": "body", "text": "Lillard had missed a 3 the night before at the end of regulation in Portland's 112-103 overtime loss at Utah."}
{"game_id": "0021700118", "chunk_id": "0021700118_015", "order": 15, "role": "body", "text": "\"He made a good read last night and (Rudy) Gobert made a great play,\" Blazers coach Terry Stotts said. \"Tonight I think he had his mind made up to take the shot. It's what great players do.\""}
{"game_id": "0021700118", "chunk_id": "0021700118_016", "order": 16, "role": "body", "text": "The Blazers were without Al-Farouq Aminu, who injured his right ankle Wednesday against the Jazz. The team posted a photo of the 6-foot-9 forward on crutches before Thursday's game."}
{"game_id": "0021700118", "chunk_id": "0021700118_017", "order": 17, "role": "body", "text": "Aminu was averaging 9.4 points and 8.1 rebounds this season. Noah Vonleh, who returned the night before following a shoulder injury in camp, started in his place."}
{"game_id": "0021700118", "chunk_id": "0021700118_018", "order": 18, "role": "body", "text": "Portland led by 18 in the first half but the Lakers closed the gap to 66-62 at halftime. It was tight the rest of the way."}
{"game_id": "0021700118", "chunk_id": "0021700118_019", "order": 19, "role": "body", "text": "\"We have the game against Toronto, then you have a tough one last night against Utah. Maybe if we come back and have a blowout, maybe we don't have to look at ourselves as much,\" Lillard said. \"We come in here tonight and we had a dogfight on our hands. We really had to look at ourselves and make it happen. We had to trust ourselves and trust each other to get it done."}
{"game_id": "0021700118", "chunk_id": "0021700118_020", "order": 20, "role": "body", "text": "\"So I think a game like this and having to pull out a game like this does more for our team, character-wise.\""}
{"game_id": "0021700118", "chunk_id": "0021700118_022", "order": 22, "role": "body", "text": "Lakers: Los Angeles was 0 for 9 from 3-point range in the first half. ... The Lakers were coming off a 113-93 victory at home against the Pistons on Tuesday night."}
{"game_id": "0021700118", "chunk_id": "0021700118_023", "order": 23, "role": "body", "text": "Trail Blazers: Rookie big man Zach Collins started the second half in place of Vonleh, who had four fouls. Collins, a 7-footer out of Gonzaga, was acquired by the Blazers in a draft-day deal with Sacramento."}
{"game_id": "0021700118", "chunk_id": "0021700118_025", "order": 25, "role": "body", "text": "\"I thought he was a little too passive tonight,\" Walton said about his rookie point guard. \"The hardest thing for young players is consistency. He's so unselfish that sometimes we want him to be more aggressive with attacking the defenses.\""}
{"game_id": "0021700118", "chunk_id": "0021700118_026", "order": 26, "role": "body", "text": "Ball, for his part, recognized that."}
{"game_id": "0021700118", "chunk_id": "0021700118_027", "order": 27, "role": "body", "text": "\"I definitely could have been more aggressive,\" he said."}
{"game_id": "0021700118", "chunk_id": "0021700118_029", "order": 29, "role": "body", "text": "Lakers: Host the Brooklyn Nets on Friday night."}
{"game_id": "0021700118", "chunk_id": "0021700118_030", "order": 30, "role": "body", "text": "Trail Blazers: Host the Oklahoma City Thunder on Sunday night."}
{"game_id": "0021700118", "chunk_id": "0021700118_032", "order": 32, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
