{"game_id": "0021300408", "chunk_id": "0021300408_001", "order": 1, "role": "lead", "text": "CLEVELAND --  Don't ask Maurice Cheeks why his team is so successful away from home. The Detroit Pistons coach can't explain it."}
{"game_id": "0021300408", "chunk_id": "0021300408_002", "order": 2, "role": "body", "text": "\"I don't have any theories why that is,\" he said. \"I just don't know.\""}
{"game_id": "0021300408", "chunk_id": "0021300408_003", "order": 3, "role": "body", "text": "Josh Smith scored 25 points, Brandon Jennings added 21 and the Pistons continued their domimant play on the road with a 115-92 win over the Cleveland Cavaliers on Monday night."}
{"game_id": "0021300408", "chunk_id": "0021300408_004", "order": 4, "role": "body", "text": "The Pistons have won seven of their last eight away from home, including victories against defending NBA champion Miami and Indiana, which has the best record in the Eastern Conference."}
{"game_id": "0021300408", "chunk_id": "0021300408_005", "order": 5, "role": "body", "text": "While Cheeks can't come up with a reason, reserve guard Chauncey Billups, a veteran of 17 seasons, managed to put his finger on something."}
{"game_id": "0021300408", "chunk_id": "0021300408_006", "order": 6, "role": "body", "text": "\"On the road, all we have is us,\" he said. \"We know we have to stick together when their crowds get going and they go on runs.\""}
{"game_id": "0021300408", "chunk_id": "0021300408_007", "order": 7, "role": "body", "text": "The Pistons went on plenty of runs in their latest road success. Detroit went ahead for good midway through the first quarter and built a 21-point lead late in the first half. The margin reached 28 points in the fourth quarter as the Pistons rolled to their biggest win of the season."}
{"game_id": "0021300408", "chunk_id": "0021300408_008", "order": 8, "role": "body", "text": "Jennings also had 13 assists for Detroit, which placed seven players in double figures."}
{"game_id": "0021300408", "chunk_id": "0021300408_009", "order": 9, "role": "body", "text": "Kyrie Irving scored 21 points for Cleveland, which has lost four of five."}
{"game_id": "0021300408", "chunk_id": "0021300408_010", "order": 10, "role": "body", "text": "\"We got our butts handed to us tonight,\" said forward Tristan Thompson."}
{"game_id": "0021300408", "chunk_id": "0021300408_011", "order": 11, "role": "body", "text": "The Cavaliers had shown signs of progress earlier this month, winning three straight and five of six. Cleveland has struggled since, dropping close games to Miami and Portland and losing by 16 points to a short-handed Chicago team on Saturday."}
{"game_id": "0021300408", "chunk_id": "0021300408_012", "order": 12, "role": "body", "text": "\"Our sense of urgency the last two ballgames has been non-existent,\" Cleveland coach Mike Brown said."}
{"game_id": "0021300408", "chunk_id": "0021300408_013", "order": 13, "role": "body", "text": "Cavaliers center Andrew Bynum was scoreless in 22 minutes, missing all 11 shots from the field and getting seven rebounds."}
{"game_id": "0021300408", "chunk_id": "0021300408_014", "order": 14, "role": "body", "text": "Detroit is 6-10 on its own court and was coming off home losses to Charlotte and Houston, but took control early. Smith scored 10 points in the first quarter when Detroit shot 56 percent."}
{"game_id": "0021300408", "chunk_id": "0021300408_015", "order": 15, "role": "body", "text": "Smith hit 3-pointers on back-to-back possessions late in the second quarter that stretched the lead to 56-35. The Pistons were 22 of 41 from the field in the first half and took a 58-40 lead to the locker room."}
{"game_id": "0021300408", "chunk_id": "0021300408_016", "order": 16, "role": "body", "text": "Cleveland cut the lead to 10 points in the third quarter, but three baskets by Jennings, including two 3-pointers, five points by Smith and dunks by Andre Drummond on consecutive fast breaks extended the lead back to 89-64."}
{"game_id": "0021300408", "chunk_id": "0021300408_017", "order": 17, "role": "body", "text": "Smith was 10 of 18 from the field and had eight rebounds and three assists in 31 minutes."}
{"game_id": "0021300408", "chunk_id": "0021300408_018", "order": 18, "role": "body", "text": "\"Working in the paint is the strength in our game, so I'm making a conscious effort to not settle for shots,\" Smith said. \"I'm used to being a little selfish, but I can be a distributor when other guys get hot.\""}
{"game_id": "0021300408", "chunk_id": "0021300408_019", "order": 19, "role": "body", "text": "Jennings directed the offense with 13 assists. Drummond had 14 points and 11 rebounds while Greg Monroe scored 11 points and had 11 rebounds."}
{"game_id": "0021300408", "chunk_id": "0021300408_020", "order": 20, "role": "body", "text": "Reserves from both teams played most of the fourth quarter."}
{"game_id": "0021300408", "chunk_id": "0021300408_021", "order": 21, "role": "body", "text": "Thompson scored 17 points for the Cavaliers. Cleveland played without guard Dion Waiters, the team's second-leading scorer, for the third straight game because of tendinitis in his right wrist."}
{"game_id": "0021300408", "chunk_id": "0021300408_022", "order": 22, "role": "body", "text": "Brown is still searching for answers to get his team to play with more consistency. The loss was Cleveland's biggest at home since a 125-90 defeat against San Antonio on April 3, 2012."}
{"game_id": "0021300408", "chunk_id": "0021300408_023", "order": 23, "role": "body", "text": "\"I don't know if we mentally understand what it takes to keep doing this every time we step out on the floor,\" he said. \"We're getting hit in the mouth right now and I'm interested to see if we can respond the right way.\""}
{"game_id": "0021300408", "chunk_id": "0021300408_024", "order": 24, "role": "body", "text": "The Pistons have won seven in a row against the Cavaliers, including four straight in Cleveland."}
{"game_id": "0021300408", "chunk_id": "0021300408_025", "order": 25, "role": "body", "text": "Cheeks coached his 600th career game. He has also coached for Portland and Philadelphia."}
{"game_id": "0021300408", "chunk_id": "0021300408_026", "order": 26, "role": "closing", "text": "Game notes Drummond was given a flagrant foul for knocking Thompson to the floor while the Cavaliers forward drove in the lane in the first quarter. ... The Cavaliers were hit with three delay-of-game warnings in the first quarter, resulting in two technical fouls. ... Cavaliers rookie F Anthony Bennett -- the No. 1 overall pick in the draft -- returned after missing two games with the flu. He missed three shots and committed a turnover in six first quarter minutes. Bennett ended the game with seven points. ... Cleveland reserve C Tyler Zeller scored a season-high 13 points, all in the fourth quarter. ... Drummond recorded his 21st double-double of the season."}
