{"game_id": "0021700547", "chunk_id": "0021700547_001", "order": 1, "role": "lead", "text": "CHICAGO --  If C.J. McCollum finds a shot he likes, he won't hesitate to take it."}
{"game_id": "0021700547", "chunk_id": "0021700547_002", "order": 2, "role": "body", "text": "McCollum proved it Monday night when he scored 25 of his 32 points after halftime, including the tiebreaking basket with 56.5 seconds remaining in overtime, and the Portland Trail Blazers beat the Chicago Bulls 124-120."}
{"game_id": "0021700547", "chunk_id": "0021700547_003", "order": 3, "role": "body", "text": "\"I just tried to make plays,\" McCollum said. \"If I can get a good shot, take it. If not, make the right play. I think guys did a great job of making the game easier for me. If I can get 30 good shots, I'll take 30 more. If I can get 40 good shots ... I'll take 40.\""}
{"game_id": "0021700547", "chunk_id": "0021700547_004", "order": 4, "role": "body", "text": "Al-Farouq Aminu added a season-high 24 points and Evan Turner also had his season best with 22 for Portland, which was without leading scorer Damian Lilliard for a fifth straight game."}
{"game_id": "0021700547", "chunk_id": "0021700547_005", "order": 5, "role": "body", "text": "Kris Dunn scored 22 points and Nikola Mirotic had 18 points off the bench for Chicago, which blew a late lead for a second straight game. The Bulls lost for only the fourth time in 14 games since Mirotic returned to the lineup."}
{"game_id": "0021700547", "chunk_id": "0021700547_006", "order": 6, "role": "body", "text": "Though he missed his first seven shots, McCollum was pivotal as Portland rallied from a six-point deficit in the final 2 1/2 minutes of the fourth quarter. McCollum scored the final four points in regulation to tie the score at 112 and answered after Lauri Markannen, who finished with 19 points, made a jumper from the corner that tied it at 120 with 1:14 left in overtime."}
{"game_id": "0021700547", "chunk_id": "0021700547_007", "order": 7, "role": "body", "text": "McCollum then made his short floater and added a pair of late free throws."}
{"game_id": "0021700547", "chunk_id": "0021700547_008", "order": 8, "role": "body", "text": "\"(McCollum) is a shooter, he's a scorer and you've got to have that mentality,\" Portland coach Terry Stotts said. \"What I was pleased most about with C.J. was his assists."}
{"game_id": "0021700547", "chunk_id": "0021700547_009", "order": 9, "role": "body", "text": "\"In the fourth quarter and overtime he made good decisions.\""}
{"game_id": "0021700547", "chunk_id": "0021700547_010", "order": 10, "role": "body", "text": "Led by Mirotic and Bobby Portis, the Bulls' bench helped them overcome a sluggish start. Each had nine points in a second quarter in which Chicago's reserves outscored Portland's 18-7."}
{"game_id": "0021700547", "chunk_id": "0021700547_011", "order": 11, "role": "body", "text": "But both were on the bench for the final 7 1/2 minutes of the fourth quarter and all of overtime. Portis finished with 14 points, seven rebounds and four assists."}
{"game_id": "0021700547", "chunk_id": "0021700547_012", "order": 12, "role": "body", "text": "\"I just thought with (Jusuf) Nurkic out there we had to find a way to keep him off the glass,\" Bulls coach Fred Hoiberg said. \"He's too big and strong out there. I felt like we needed Robin (Lopez), who also was playing well.\""}
{"game_id": "0021700547", "chunk_id": "0021700547_013", "order": 13, "role": "body", "text": "\"The last two nights we haven't gotten the job done. It hurts, it stings, especially after having the seven in a row where we did close out a lot of those close games.\""}
{"game_id": "0021700547", "chunk_id": "0021700547_015", "order": 15, "role": "body", "text": "Trail Blazers: Lillard missed his fifth straight game with a right hamstring strain. Expected to be a game-time decision, Lillard, who hasn't played since Dec. 20, was ruled out early. Stotts isn't sure if Lillard would play on Tuesday at Cleveland."}
{"game_id": "0021700547", "chunk_id": "0021700547_016", "order": 16, "role": "body", "text": "\"When he's ready, he'll be ready, but it's hard to say,\" Stotts said."}
{"game_id": "0021700547", "chunk_id": "0021700547_017", "order": 17, "role": "body", "text": "Bulls: Zach LaVine's \"training camp\" has gone well so far, according to Hoiberg. Coming off February surgery to repair a torn ACL in his left knee, LaVine is halfway through a stretch of six consecutive days of full-contact practices. \"He's sore, as expected,\" Hoiberg said. \"He's in training camp mode right now, but he's handling the workload well and that's the important thing.\""}
{"game_id": "0021700547", "chunk_id": "0021700547_019", "order": 19, "role": "body", "text": "With Lillard's 25-point average out of the lineup, Aminu's offensive output was critical. He made 5-of-6 3-pointers and scored 17 points after halftime. The Blazers' 14 3-pointers were tied for the team's second-most made this season. They made 18 in a Dec. 9 loss at Houston."}
{"game_id": "0021700547", "chunk_id": "0021700547_020", "order": 20, "role": "body", "text": "\"It was good for us to have an offensive night,\" Stotts said. \"We needed every one of (Aminu's) 3s.\""}
{"game_id": "0021700547", "chunk_id": "0021700547_022", "order": 22, "role": "body", "text": "Turner, who grew up in nearby Oak Park, Illinois, made the most of his one trip to Chicago this season. He scored 14 first-half points and also hit a 3-pointer to open the scoring in overtime."}
{"game_id": "0021700547", "chunk_id": "0021700547_023", "order": 23, "role": "body", "text": "\"Ever since he had his first buck, I was saying, `E.T.'s home. He's at the crib,\" the Blazers' Pat Connaughton said. \"He kept it going.\""}
{"game_id": "0021700547", "chunk_id": "0021700547_025", "order": 25, "role": "body", "text": "Trail Blazers:  At the Cleveland Cavaliers on Tuesday night."}
{"game_id": "0021700547", "chunk_id": "0021700547_026", "order": 26, "role": "body", "text": "Bulls: Host the Toronto Raptors on Wednesday night."}
{"game_id": "0021700547", "chunk_id": "0021700547_028", "order": 28, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
