{"game_id": "0021701205", "chunk_id": "0021701205_001", "order": 1, "role": "lead", "text": "NEW YORK --  The rebuilding Brooklyn Nets have finally started to click over the season's final month."}
{"game_id": "0021701205", "chunk_id": "0021701205_002", "order": 2, "role": "body", "text": "Allen Crabbe is hoping it'll carry over to next season."}
{"game_id": "0021701205", "chunk_id": "0021701205_003", "order": 3, "role": "body", "text": "Crabbe scored 20 of his career-high 41 points in the first quarter and the Nets beat the Chicago Bulls 114-105 on Monday night for their first three-game winning streak this season."}
{"game_id": "0021701205", "chunk_id": "0021701205_004", "order": 4, "role": "body", "text": "The Nets have won seven of 12 games since March 17 after dropping 18 of 21."}
{"game_id": "0021701205", "chunk_id": "0021701205_005", "order": 5, "role": "body", "text": "\"Things are maybe turning that corner that we wanted to get a little early in the season, but it's better late than never,\" said Crabbe, who struggled at the beginning of the season before finding his 3-point stroke. He has a franchise-record 188 3-pointers in his first season with Brooklyn."}
{"game_id": "0021701205", "chunk_id": "0021701205_006", "order": 6, "role": "body", "text": "D'Angelo Russell had 21 points and 11 assists, and Spencer Dinwiddie scored 20 points for the Nets, who had not won three straight since April 1-4, 2017."}
{"game_id": "0021701205", "chunk_id": "0021701205_007", "order": 7, "role": "body", "text": "The Nets swept the three-game season series from Chicago for the first time since the 2004-05 season. Brooklyn assisted on 32 of its 41 baskets."}
{"game_id": "0021701205", "chunk_id": "0021701205_008", "order": 8, "role": "body", "text": "\"I try to pass the ball to whoever's open,\" said Russell, who also had six rebounds. \"Coach gives me that freedom. The more I'm here, the more the trust will slowly elevate but we got shot-makers around here.\""}
{"game_id": "0021701205", "chunk_id": "0021701205_009", "order": 9, "role": "body", "text": "Former Net Sean Kilpatrick was one of seven players for the Bulls to score in double figures, tallying 16 points. Cameron Payne had 15 for Chicago, which has lost its last three games."}
{"game_id": "0021701205", "chunk_id": "0021701205_010", "order": 10, "role": "body", "text": "Rookie Lauri Markkanen added 10 points and six rebounds to reach 500 boards this season. He's the first Bulls rookie to since Elton Brand to eclipse the 1,000-point, 500-rebound mark."}
{"game_id": "0021701205", "chunk_id": "0021701205_011", "order": 11, "role": "body", "text": "\"I take a lot of pride. I basically try to do basically as much as I can in rebounding,\" Markkanen said. \"I think it feels pretty cool to accomplish that, but I'm not satisfied.\""}
{"game_id": "0021701205", "chunk_id": "0021701205_012", "order": 12, "role": "body", "text": "Brooklyn hit 18 3-pointers in its first game since falling one shy of the NBA record with 24 in a rout of Chicago on Saturday."}
{"game_id": "0021701205", "chunk_id": "0021701205_013", "order": 13, "role": "body", "text": "Crabbe celebrated his 26th birthday by going 8 of 11 from deep Monday. He scored 14 straight points during his first quarter outburst and finished the first half with 29 points, including 6 of 6 from deep. The Nets led 62-55 at the break."}
{"game_id": "0021701205", "chunk_id": "0021701205_014", "order": 14, "role": "body", "text": "During his last three games, Crabbe has made 18 3-pointers and averaged 28.7 points."}
{"game_id": "0021701205", "chunk_id": "0021701205_015", "order": 15, "role": "body", "text": "\"I shook his hand after the game and it was still hot, still cooking,\" Nets coach Kenny Atkinson said. \"He's really finishing the season the way we're asking the team to finish, on a strong night.\""}
{"game_id": "0021701205", "chunk_id": "0021701205_016", "order": 16, "role": "body", "text": "The Nets led by 11 points during the third quarter before the Bulls cut the lead to three on Kilpatrick's 3-pointer with five seconds left."}
{"game_id": "0021701205", "chunk_id": "0021701205_017", "order": 17, "role": "body", "text": "Chicago got within four points on Kilpatrick's basket with 4:14 left in the fourth quarter, forcing the Nets to call a timeout."}
{"game_id": "0021701205", "chunk_id": "0021701205_018", "order": 18, "role": "body", "text": "Russell then hit a jumper at the elbow over Kilpatrick to start 6-0 run capped by his driving layup with 1:36 to play. That extended the lead to 112-102."}
{"game_id": "0021701205", "chunk_id": "0021701205_020", "order": 20, "role": "body", "text": "Bulls: Markkanen made a pair of 3-pointers. The 20-year-old from Finland is two shy of tying Kirk Hinrich's franchise rookie record of 144 set during the 2003-04 season. ... David Nwaba had 11 points and 10 rebounds"}
{"game_id": "0021701205", "chunk_id": "0021701205_021", "order": 21, "role": "body", "text": "Nets: Forwards Joe Harris (sprained left ankle) and Caris LeVert (right foot tendinitis) were held out. DeMarre Carroll was also a scratch due to a left hip strain."}
{"game_id": "0021701205", "chunk_id": "0021701205_023", "order": 23, "role": "body", "text": "Bulls: Conclude the season at home Wednesday night against Detroit."}
{"game_id": "0021701205", "chunk_id": "0021701205_024", "order": 24, "role": "body", "text": "Nets: Close out their season at Boston on Wednesday night."}
{"game_id": "0021701205", "chunk_id": "0021701205_026", "order": 26, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
