{"game_id": "0021200620", "chunk_id": "0021200620_001", "order": 1, "role": "lead", "text": "CHICAGO -- Devoid of energy and headed toward another head-scratching home loss, the Chicago Bulls needed an answer."}
{"game_id": "0021200620", "chunk_id": "0021200620_003", "order": 3, "role": "body", "text": "The spunky guard had 11 points and seven assists in 21 minutes off the bench, leading a furious fourth-quarter comeback that carried Chicago past the Detroit Pistons 85-82 on Wednesday night."}
{"game_id": "0021200620", "chunk_id": "0021200620_004", "order": 4, "role": "body", "text": "Joakim Noah sacrificed his body to save a loose ball, which Marco Belinelli converted into a game-winning basket with 7 seconds left. Tayshaun Prince and Rodney Stuckey each missed potential tying 3-pointers at the other end."}
{"game_id": "0021200620", "chunk_id": "0021200620_005", "order": 5, "role": "body", "text": "Robinson put the Bulls on his back, scoring nine straight points early in the fourth as Chicago overcame a 17-point deficit to beat Detroit for the 17th straight time. The comeback matched Chicago's largest of the season."}
{"game_id": "0021200620", "chunk_id": "0021200620_006", "order": 6, "role": "body", "text": "\"My biggest asset to the game is energy,\" Robinson said. \"We needed a lift and I just had to force the crowd to get out of their seats and give us a boost.\""}
{"game_id": "0021200620", "chunk_id": "0021200620_007", "order": 7, "role": "body", "text": "He hit a jumper with 10:25 left to cut the lead to eight, then was fouled in transition on the next possession. He rose from the floor and beckoned the sold-out crowd to get on its feet, which it did."}
{"game_id": "0021200620", "chunk_id": "0021200620_009", "order": 9, "role": "body", "text": "He made both free throws, then scored on the two ensuing possessions. Robinson also found Noah alone underneath the basket with eight minutes left to tie the score at 71."}
{"game_id": "0021200620", "chunk_id": "0021200620_010", "order": 10, "role": "body", "text": "\"I just felt like I was invincible, unstoppable,\" Robinson said. \"It's the Peter Pan theory -- you can't fly without happy thoughts.\""}
{"game_id": "0021200620", "chunk_id": "0021200620_011", "order": 11, "role": "body", "text": "The Bulls extended the lead, their first since the opening minutes, to six, but Detroit didn't fold, tying the game at 82 with 29.4 seconds left on Jason Maxiell's layup."}
{"game_id": "0021200620", "chunk_id": "0021200620_012", "order": 12, "role": "body", "text": "Belinelli missed a go-ahead 3, but the ball ricocheted off the rim toward the row of cameramen. Noah and his 7-foot frame barreled through to keep it alive."}
{"game_id": "0021200620", "chunk_id": "0021200620_013", "order": 13, "role": "body", "text": "\"The best play,\" Robinson said. \"The funny thing about it is we're over there celebrating and he's still knocked over by the cheerleaders.\""}
{"game_id": "0021200620", "chunk_id": "0021200620_014", "order": 14, "role": "body", "text": "Belinelli was fouled on his layup and converted the free throw to give Chicago a three-point lead."}
{"game_id": "0021200620", "chunk_id": "0021200620_015", "order": 15, "role": "body", "text": "\"That unit that finished the game really inspired us,\" Bulls coach Tom Thibodeau said. \"They erased the deficit and got the lead for us.\""}
{"game_id": "0021200620", "chunk_id": "0021200620_016", "order": 16, "role": "body", "text": "Coming from behind is not a new concept for the Bulls, who trailed by as many as 17 when the teams last met in December, a 108-104 Chicago win."}
{"game_id": "0021200620", "chunk_id": "0021200620_017", "order": 17, "role": "body", "text": "Noah, who posted career highs with 30 points and 23 boards in the December meeting, finished with 10 points and 18 rebounds this time around. Jimmy Butler added 18 points and nine boards while starting a third straight game in place of Chicago's leading scorer, Luol Deng, who is dealing with a right hamstring injury."}
{"game_id": "0021200620", "chunk_id": "0021200620_018", "order": 18, "role": "body", "text": "Brandon Knight led Detroit with 13 points and seven assists. Kyle Singler had 12 points and made several big shots in the second half to quell potential Bulls runs."}
{"game_id": "0021200620", "chunk_id": "0021200620_019", "order": 19, "role": "body", "text": "\"We have to match their energy for four quarters,\" Prince said. \"We only did it for 3½ tonight and you see what happens."}
{"game_id": "0021200620", "chunk_id": "0021200620_020", "order": 20, "role": "body", "text": "\"The last two or three times we have played them we had leads through three quarters. We should have had wins.\""}
{"game_id": "0021200620", "chunk_id": "0021200620_021", "order": 21, "role": "body", "text": "Detroit began the second half on an 8-0 run to extend its lead to 17, and forced 15 turnovers, but couldn't seal its first win at the United Center since Dec. 3, 2005, a 12-game span. The last time the Pistons beat the Bulls at all was Dec. 23, 2008."}
{"game_id": "0021200620", "chunk_id": "0021200620_022", "order": 22, "role": "body", "text": "\"We put ourselves into that position,\" Pistons coach Lawrence Frank said. \"We were passing up open shots, and allowed mistakes to let them back in the game.\""}
{"game_id": "0021200620", "chunk_id": "0021200620_023", "order": 23, "role": "body", "text": "Detroit (16-26) fell to 4-15 on the road. The Pistons had won nine of 13 overall."}
{"game_id": "0021200620", "chunk_id": "0021200620_024", "order": 24, "role": "body", "text": "Turnovers and atrocious shooting put the Bulls in an early hole. Fourteen of their 15 turnovers came in the first three quarters."}
{"game_id": "0021200620", "chunk_id": "0021200620_025", "order": 25, "role": "body", "text": "Carlos Boozer scored eight of the Bulls' 14 first-quarter points as the rest of the team went a combined 2 for 15 from the floor. By halftime, Chicago had missed all 10 3-point attempts and only Boozer had made more than two field goals."}
{"game_id": "0021200620", "chunk_id": "0021200620_026", "order": 26, "role": "closing", "text": "Game notes Chicago finished 3 for 14 from 3-point range. ... Butler's 18-points, nine rebounds and four assists all tied career highs. He is averaging 15.3 points, 8.3 rebounds and almost 46 minutes per game in Deng's absence. ... Pistons rookie Andre Drummond had eight points and seven rebounds, four on the offensive glass. He ranks second in the NBA in offensive rebounding percentage with 16.3 percent."}
