{"game_id": "0021700883", "chunk_id": "0021700883_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  The attention was supposed to be about the return of rookie Lonzo Ball. Apparently Julius Randle had his own ideas."}
{"game_id": "0021700883", "chunk_id": "0021700883_002", "order": 2, "role": "body", "text": "Randle had 18 points, 12 rebounds and 10 assists to overshadow Ball's triumphant return to the lineup, and the Los Angeles Lakers beat the Dallas Mavericks 124-102 on Friday night."}
{"game_id": "0021700883", "chunk_id": "0021700883_003", "order": 3, "role": "body", "text": "It was Randle's second triple-double this season and No. 5 for his career."}
{"game_id": "0021700883", "chunk_id": "0021700883_004", "order": 4, "role": "body", "text": "\"He's been getting much better at letting the game slow down for him,\" said Lakers coach Luke Walton. \"He's starting to get double-teamed in the last few games."}
{"game_id": "0021700883", "chunk_id": "0021700883_005", "order": 5, "role": "body", "text": "\"We've been working on him playing at a better pace once he gets into attack mode, recognizing the double-team and knowing where our shooters and cutters are going to be. I think he just did a really good job tonight of reading the defense.\""}
{"game_id": "0021700883", "chunk_id": "0021700883_006", "order": 6, "role": "body", "text": "Ball, who was sidelined 15 games with a knee injury, had nine points, seven rebounds and six assists in 17 minutes. Isaiah Thomas had 17 points and Kentavious Caldwell-Pope and Brandon Ingram scored 15 apiece to help Los Angeles stop a three-game slide."}
{"game_id": "0021700883", "chunk_id": "0021700883_007", "order": 7, "role": "body", "text": "Wesley Matthews and Harrison Barnes each scored 19 points for the Mavericks (18-41), who have dropped five of six."}
{"game_id": "0021700883", "chunk_id": "0021700883_008", "order": 8, "role": "body", "text": "The Lakers pounded the smaller Mavs on the glass, outrebounding Dallas 62-29."}
{"game_id": "0021700883", "chunk_id": "0021700883_009", "order": 9, "role": "body", "text": "\"We just didn't play hard enough, compete hard enough to win,\" forward Dirk Nowitzki said."}
{"game_id": "0021700883", "chunk_id": "0021700883_010", "order": 10, "role": "body", "text": "The Mavericks lost by 22 points despite going 19 of 42 on 3-pointers."}
{"game_id": "0021700883", "chunk_id": "0021700883_011", "order": 11, "role": "body", "text": "\"I've never seen a team make 19 3s and lose by over 20, so this is new for me,\" Mavs coach Rick Carlisle said. \"It has to be about more than making shots, and tonight we got outrebounded. They played with great force tonight and we just did not.\""}
{"game_id": "0021700883", "chunk_id": "0021700883_013", "order": 13, "role": "body", "text": "Mavericks: Rookie guard Dennis Smith Jr. was one of the players identified in the Yahoo Sports story on federal documents obtained in the FBI's investigation into college basketball corruption. It alleged Smith received $43,500 and was loaned another $73,500. Said Smith at the morning shootaround: \"I'm a firm believer in God and everything happens for a reason. Whether it's going to strengthen you or destroy you, you make that decision. But since I've been here, it's been a class organization from top to bottom, starting with Mark Cuban and all the way down to players like myself. It's been great, fantastic. I'm here to play basketball. Everything else to me is just noise and I have to block all that out.\""}
{"game_id": "0021700883", "chunk_id": "0021700883_014", "order": 14, "role": "body", "text": "Lakers: The Yahoo Sports report also said rookie forward Kyle Kuzma received $3,000 and $6,500 in loans. Kuzma would not say before the game whether the story was accurate. \"Hmm, I'm not going to say anything really,\" he said. \"Just gathering information about it and whatnot.\" He called it a legal matter, though he did not believe he was in jeopardy. \"I don't know. I don't think so,\" he said. \"That's why we're trying to gather information about everything. It is a federal investigation the NCAA is dealing with.\" Kuzma did say the story was a distraction. \"Yeah, for sure,\" he said. \"It's the NBA right now and we're focusing on trying to win games, and things like this come about, it's definitely a little distraction.\""}
{"game_id": "0021700883", "chunk_id": "0021700883_016", "order": 16, "role": "body", "text": "Nowitzki played only four minutes in the fourth quarter."}
{"game_id": "0021700883", "chunk_id": "0021700883_017", "order": 17, "role": "body", "text": "\"His back was tightening up a little bit,\" Carlisle said. \"I'm not exactly sure how he's doing. We will see how he's doing in the morning. It didn't sound like it was serious.\""}
{"game_id": "0021700883", "chunk_id": "0021700883_019", "order": 19, "role": "body", "text": "The rookie point guard did not start, and said the knee gave him little trouble."}
{"game_id": "0021700883", "chunk_id": "0021700883_020", "order": 20, "role": "body", "text": "\"It felt good to just be back on the court,\" Ball said. \"\"I was just out there playing, having fun. I wasn't even thinking about anything, just playing hard.\""}
{"game_id": "0021700883", "chunk_id": "0021700883_021", "order": 21, "role": "body", "text": "The Lakers plan to take his return slowly. Ball, who played all his minutes alongside Thomas, is not scheduled to play in the Lakers' next game."}
{"game_id": "0021700883", "chunk_id": "0021700883_023", "order": 23, "role": "body", "text": "Mavericks: Play on back-to-back nights when they travel to Utah on Saturday."}
{"game_id": "0021700883", "chunk_id": "0021700883_024", "order": 24, "role": "body", "text": "Lakers: Also play on consecutive nights, traveling to Sacramento on Saturday."}
{"game_id": "0021700883", "chunk_id": "0021700883_026", "order": 26, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
