{"game_id": "0021200607", "chunk_id": "0021200607_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Struggling with his jump shot, James Harden turned to his backup plan on offense."}
{"game_id": "0021200607", "chunk_id": "0021200607_002", "order": 2, "role": "body", "text": "Harden decided the best way to help the Houston Rockets snap a seven-game losing streak was to start taking the ball to the basket, draw contact and get to the foul line."}
{"game_id": "0021200607", "chunk_id": "0021200607_003", "order": 3, "role": "body", "text": "That strategy worked pretty well on Monday."}
{"game_id": "0021200607", "chunk_id": "0021200607_004", "order": 4, "role": "body", "text": "Harden scored 29 points and hit all 10 of his free throws in the fourth quarter as the Rockets rallied to beat the Charlotte Bobcats 100-94 in a Martin Luther King Jr. Day matinee."}
{"game_id": "0021200607", "chunk_id": "0021200607_005", "order": 5, "role": "body", "text": "Harden made just 5 of 20 field goals, but went 19 of 21 from the free throw line. He was perfect from the line when the Rockets overcame a seven-point deficit in the final period."}
{"game_id": "0021200607", "chunk_id": "0021200607_006", "order": 6, "role": "body", "text": "\"It felt like winning a championship,\" Harden said of snapping the losing streak. \"It feels good. We have had our losing ways and just to get this one off our back, go back home and get that confidence back is big. Maybe we can get our swagger back a little bit.\""}
{"game_id": "0021200607", "chunk_id": "0021200607_007", "order": 7, "role": "body", "text": "Kemba Walker was 6 of 7 on 3-pointers and had a career-high 35 points for the Bobcats, who set a franchise record with their 15th straight loss at home."}
{"game_id": "0021200607", "chunk_id": "0021200607_008", "order": 8, "role": "body", "text": "The longest home losing streak in NBA history is 19 straight by Dallas during the 1993-94 season."}
{"game_id": "0021200607", "chunk_id": "0021200607_009", "order": 9, "role": "body", "text": "Ramon Sessions added 19 points for the Bobcats."}
{"game_id": "0021200607", "chunk_id": "0021200607_010", "order": 10, "role": "body", "text": "But while Walker was phenomenal, it was Harden who took over when the game was on the line."}
{"game_id": "0021200607", "chunk_id": "0021200607_011", "order": 11, "role": "body", "text": "\"We got in the penalty really early, so we decided to get the line as much as we can,\" said Rockets coach Kevin McHale."}
{"game_id": "0021200607", "chunk_id": "0021200607_012", "order": 12, "role": "body", "text": "\"But 21 times is pretty amazing. James was what, 5 for 20 from the field, with 29 points. That's hard to do.\""}
{"game_id": "0021200607", "chunk_id": "0021200607_013", "order": 13, "role": "body", "text": "Marcus Morris had 21 points and tied a career high with eight rebounds for the Rockets. Carlos Delfino scored 16 points, including a 3-pointer from the right corner that put Houston ahead for good at 96-94 with 1:54 left."}
{"game_id": "0021200607", "chunk_id": "0021200607_014", "order": 14, "role": "body", "text": "Harden has led the Rockets in scoring in 22 of the past 23 games. He also finished with seven assists and seven rebounds while playing 42 minutes."}
{"game_id": "0021200607", "chunk_id": "0021200607_015", "order": 15, "role": "body", "text": "While McHale was thankful to get out of Charlotte with a win, he wasn't exactly thrilled with his team's overall sloppy play."}
{"game_id": "0021200607", "chunk_id": "0021200607_016", "order": 16, "role": "body", "text": "\"We've got to play better,\" McHale said. \"We were missing layups, bouncing the ball off our knee, you know, it was kind of like a comedy act there for a while. That happens. We've been in a funk and we've got to work our way out of it.\""}
{"game_id": "0021200607", "chunk_id": "0021200607_017", "order": 17, "role": "body", "text": "It looked for a while as if the Rockets losing ways might continue."}
{"game_id": "0021200607", "chunk_id": "0021200607_018", "order": 18, "role": "body", "text": "Houston couldn't find a flow on offense early and fell behind by 12 against the typically slow-starting Bobcats."}
{"game_id": "0021200607", "chunk_id": "0021200607_019", "order": 19, "role": "body", "text": "Harden was just 2 of 9 from the field in the first half and missed several easy shots, including a pair of driving layups. He also had three turnovers, including one where he inexplicably lost control of his dribble with no defender near him. He twice had his shot blocked in the first half."}
{"game_id": "0021200607", "chunk_id": "0021200607_020", "order": 20, "role": "body", "text": "Harden's shaky first half ended when his heave from half-court as time expired sailed about 10 feet wide of the backboard."}
{"game_id": "0021200607", "chunk_id": "0021200607_021", "order": 21, "role": "body", "text": "Meanwhile, Walker was just getting started."}
{"game_id": "0021200607", "chunk_id": "0021200607_022", "order": 22, "role": "body", "text": "He made all three 3-point attempts in the first half, helping the Bobcats take a 56-45 lead at the break. And Charlotte led by seven entering the fourth quarter after Walker knocked down two more 3s late in the third quarter."}
{"game_id": "0021200607", "chunk_id": "0021200607_023", "order": 23, "role": "body", "text": "\"He was just killing us,\" McHale said."}
{"game_id": "0021200607", "chunk_id": "0021200607_024", "order": 24, "role": "body", "text": "But as has been the problem most of the season, Charlotte had trouble closing out an opponent, shooting just 4 of 19 in the fourth quarter and scoring just 13 points."}
{"game_id": "0021200607", "chunk_id": "0021200607_025", "order": 25, "role": "body", "text": "Walker had seven of those points and Sessions had six, but no other Bobcats scored in the final period."}
{"game_id": "0021200607", "chunk_id": "0021200607_026", "order": 26, "role": "body", "text": "\"Kemba and Sessions got going but we really need that third scorer,\" Bobcats coach Mike Dunlap said. \"It's not an individual on our team, it's just finding who that third scorer is.\""}
{"game_id": "0021200607", "chunk_id": "0021200607_027", "order": 27, "role": "body", "text": "Walker said he's been working overtime on his jumper of late, but didn't feel much like talking about his career high after the game."}
{"game_id": "0021200607", "chunk_id": "0021200607_028", "order": 28, "role": "body", "text": "He was still miffed at yet another blown lead at home."}
{"game_id": "0021200607", "chunk_id": "0021200607_029", "order": 29, "role": "body", "text": "\"It's tough,\" Walker said. \"We're trying our hardest to win these games, but it's just not working out right now. Hopefully, things will work out for us. It gets tough in the fourth quarter. Teams adjust to what we've been doing. You have to execute. I thought we got some pretty good shots and just missed them.\""}
{"game_id": "0021200607", "chunk_id": "0021200607_030", "order": 30, "role": "closing", "text": "Game notes Bismack Biyombo tied a career high with seven blocked shots, four of those on Harden. ... Walker's six 3-pointers were a career best. ... Harden has scored at least 20 points in a career-high 23 straight games. ... Patrick Beverley scored a career-high 10 points for the Rockets."}
