{"game_id": "0021400908", "chunk_id": "0021400908_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- The Portland Trail Blazers were able to overcome one of Damian Lillard's worst shooting games with a huge performance from Nicolas Batum down the stretch.\nBatum hit a 3-pointer that forced overtime, then set up three alley-oop baskets and added a clinching 3 in the final minute to rally the Trail Blazers past the Los Angeles Clippers 98-93 on Wednesday night.\n\"Nobody's been harder on Nic than Nic,\" coach Terry Stotts said. \"He just wants to play well, and he's put a lot of pressure on himself to have a game like he just had against a quality team and to make big plays. He was able to be a facilitator, which is something that just makes us a deeper team.\"\nLaMarcus Aldridge had 29 points and Batum added 20 for the Northwest Division leaders, who have won four straight after a 6-11 stretch that began with a 100-94 loss to the Clippers on Jan. 14 in Portland."}
{"game_id": "0021400908", "chunk_id": "0021400908_002", "order": 2, "role": "closing", "text": "Batum tied it at 87 on a 3 with 25.1 seconds left in the fourth quarter after Portland trailed by 10 with 2:40 remaining.\n\"We all know that Lillard's a great scorer, and tonight just wasn't his night. But we found a way to make big plays, especially at the end of the fourth and overtime,\" Batum said. \"My job with this team the last three years has been to do a little bit of everything on the court. I can assist, rebound and score. We knew we had a good matchup on the pick-and-roll with LaMarcus and me, so we tried to take advantage of it.\"\nLillard was 1-for-13 from the field, finishing with five points, five turnovers and a career-high 18 rebounds in 43 minutes. The third-year guard missed his first 12 shots before making a layup off a lob pass from Batum to give the Blazers a 91-89 edge with 3:04 left in overtime.\n\"I didn't shoot the ball well, and I didn't shoot it much,\" Lillard said. \"They trapped me pretty hard, so to get a look would have been a tough look. So the better play was for me to draw two people and kick the ball out. I wasn't scoring the ball, so somebody else had to -- and Nico finished it out.\"\nLillard has played 223 regular-season games in the NBA and 11 more in the playoffs, and he has never gone through an entire one without a field goal. The two-time All-Star shot a career-worst 1-for-16 at Orlando on Feb. 10, 2013.\n\"The most important thing was that we played the type of basketball we needed to down the stretch to win the game, and I still found a way to impact the game,\" Lillard said.\nChris Paul had 36 points and 12 assists for the Clippers, who played short-handed again without Blake Griffin (right elbow), Jamal Crawford (bruised calf) and Matt Barnes (right hamstring strain).\nJ.J. Redick scored 26, and DeAndre Jordan grabbed 19 rebounds.\n\"We have to play better team defense, because down the stretch is where we let up,\" Paul said.\nPaul scored eight points during a 3:33 stretch to help the Clippers take an 83-75 lead with 4:27 to play. The Blazers started fouling Jordan in an attempt to get back in the game, and he missed his next six free throws before coach Doc Rivers took him out for the rest of regulation.\n\"With four minutes to go and being down 10, we just had to find a way to lengthen the game,\" Stotts said. \"It just changed the rhythm of the game and the rhythm of their offense. And they never got it back.\"\nThe Blazers narrowed the gap to 85-82 on Batum's two free throws, a 19-footer by Aldridge and a 3-pointer by Wesley Matthews with 1:06 to play. After Batum tied the score at 87, Paul missed a running back shot in the final second of regulation.\n\"We made a lot of mistakes down the stretch,\" Rivers said. \"We gave up a couple of bad 3-pointers. That can never happen. In the last few possessions of the game, we stopped defending.\"\nTIP-INS\nTrail Blazers: Lillard averaged 30 points in his previous two games, shooting a combined 21-for-42 against Oklahoma City and Sacramento. ... Portland outscored Los Angeles 19-3 on second-chance points going into the fourth. ... The Blazers have held an opponent to fewer than 100 points a league-leading 38 times (31-7) in 59 games. ... The Blazers had lost their previous five road games against the Clippers, including 106-102 on Nov. 8. ... Aldridge averaged 27.2 points in his previous five games against the Clippers, including a 37-point outburst in the last one Jan. 14.\nClippers: Rivers was a teammate of Bo Kimble's with the Clippers and New York Knicks. And on the 25th anniversary of the day Kimble's Loyola Marymount teammate and close friend, Hank Gathers, died of a heart attack during a West Coast Conference tournament game, Rivers said: \"I remember it quite vividly. That was a horrible day. I don't know if there's been anything sadder than that, basketball-wise, because it was so in your face. Being around Bo Kimble and hearing about it from him, you got a different vantage point on it.\"\nUP NEXT\nTrail Blazers: Host Dallas on Thursday.\nClippers: At Golden State on Sunday."}
