{"game_id": "0021700416", "chunk_id": "0021700416_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Karl-Anthony Towns put the blame for an overtime loss to Philadelphia squarely on his shoulders, saying he cost his team a win."}
{"game_id": "0021700416", "chunk_id": "0021700416_002", "order": 2, "role": "body", "text": "Towns wasn't going to let the same thing happen Thursday."}
{"game_id": "0021700416", "chunk_id": "0021700416_003", "order": 3, "role": "body", "text": "The 7-footer had 30 points and 14 rebounds in his league-leading 23rd double-double, Jimmy Butler added 21 points and nine assists and the Minnesota Timberwolves cruised to a 119-96 victory over the Sacramento Kings."}
{"game_id": "0021700416", "chunk_id": "0021700416_004", "order": 4, "role": "body", "text": "\"I came to be an assassin tonight, not a basketball player,\" Towns said. \"I wanted to try to be as active as possible and just disrupt the game as much as possible as well.\""}
{"game_id": "0021700416", "chunk_id": "0021700416_005", "order": 5, "role": "body", "text": "Andrew Wiggins scored 22 points for Minnesota (17-12), which has won three of four and is off to the third-best start in franchise history after 29 games."}
{"game_id": "0021700416", "chunk_id": "0021700416_006", "order": 6, "role": "body", "text": "Zach Randolph had 15 points and nine rebounds for Sacramento. George Hill scored 16 points for the Kings, who lost rookie point guard DeAaron Fox to an injury in the first quarter."}
{"game_id": "0021700416", "chunk_id": "0021700416_007", "order": 7, "role": "body", "text": "Kosta Koufos had 11 points and eight rebounds off the bench."}
{"game_id": "0021700416", "chunk_id": "0021700416_008", "order": 8, "role": "body", "text": "\"Tough night, we didn't play with enough force,\" Kings coach Dave Joerger said. \"They did pretty much anything they wanted to us so it was very frustrating for us.\""}
{"game_id": "0021700416", "chunk_id": "0021700416_009", "order": 9, "role": "body", "text": "Towns had 19 points and 16 rebounds in Tuesday's loss, but 76ers center Joel Embiid had 28 points, including two free throws to push the game to overtime after being fouled by Towns."}
{"game_id": "0021700416", "chunk_id": "0021700416_010", "order": 10, "role": "body", "text": "Towns took control early Thursday with 11 points in the first quarter and was active defensively throughout. He added season highs with five blocks and five assists."}
{"game_id": "0021700416", "chunk_id": "0021700416_011", "order": 11, "role": "body", "text": "Minnesota shot 64 percent in the first half and 56 percent for the game."}
{"game_id": "0021700416", "chunk_id": "0021700416_012", "order": 12, "role": "body", "text": "\"It was pretty easy for them,\" Joerger said."}
{"game_id": "0021700416", "chunk_id": "0021700416_013", "order": 13, "role": "body", "text": "\"Our turnovers kills us. We didn't check out enough, and they shot 65 percent in the first half because it was easy.\""}
{"game_id": "0021700416", "chunk_id": "0021700416_014", "order": 14, "role": "body", "text": "The Wolves used a 13-0 run in the third quarter, capping the stretch on a jumper by Butler for an 84-64 lead. Minnesota led by as many as 27 and coasted to the win after a string of close games. Their previous six games were all decided by six points or less."}
{"game_id": "0021700416", "chunk_id": "0021700416_015", "order": 15, "role": "body", "text": "\"Win is a win, but it's always good to win like this, especially at home after losing a close one to Philly the other day,\" Butler said. \"I think we did all right. We didn't give up points in transition. We guarded. Still some things we can definitely do better, but I'm happy the way that we won.\""}
{"game_id": "0021700416", "chunk_id": "0021700416_017", "order": 17, "role": "body", "text": "Kings: Sacramento's reserves outscored Minnesota's 54-24. The Kings lead the NBA in bench scoring and have outscored their opponents' reserves in 25 of 28 games this season. ... F Justin Jackson didn't play in the first half but started the second half. C Willie Cauley-Stein also started the second half after not starting the game. ... Sacramento is 4-12 on the road."}
{"game_id": "0021700416", "chunk_id": "0021700416_018", "order": 18, "role": "body", "text": "Timberwolves: G Marcus Georges-Hunt played a season-high 17 minutes, his first action since Nov. 29. After playing just eight players the past three games, coach Tom Thibodeau expanded his bench with Georges-Hunt seeing time in the first half. He had five points after scoring four total in nine previous games. ... The Wolves were outrebounded 42-39. They are 4-8 when getting outrebounded this season."}
{"game_id": "0021700416", "chunk_id": "0021700416_020", "order": 20, "role": "body", "text": "Towns also got into a back -and-forth with Embiid on social media in the days after Tuesday's loss. Embiid had posted an Instagram photo about the win in Minnesota and made mention of \"raising the cat.\""}
{"game_id": "0021700416", "chunk_id": "0021700416_021", "order": 21, "role": "body", "text": "Towns believed the comment was about him and responded to the post, writing that the caption was \"trash.\" Embiid responded that it was \"better\" than Towns' defense."}
{"game_id": "0021700416", "chunk_id": "0021700416_022", "order": 22, "role": "body", "text": "Towns commented on the exchange after Thursday's game."}
{"game_id": "0021700416", "chunk_id": "0021700416_023", "order": 23, "role": "body", "text": "\"Me and Joel are really good friends, so it was kind of like just brotherly badger,\" Towns said. \"It was fun to see. I forgot he's like the king of Instagram and Twitter. So it doesn't matter if he said a letter, it was going to be taken more highly regarded than my comeback. Like I told, I didn't think his caption was very good. At least respect me and give me a better caption than that.\""}
{"game_id": "0021700416", "chunk_id": "0021700416_025", "order": 25, "role": "body", "text": "Fox left the game in the first quarter with a left quadriceps injury and didn't return."}
{"game_id": "0021700416", "chunk_id": "0021700416_026", "order": 26, "role": "body", "text": "Fox, the No. 5 overall pick in this year's draft, was on the ground stretching with trainers before being declared out. Joerger didn't have an update on Fox's status after the game."}
{"game_id": "0021700416", "chunk_id": "0021700416_027", "order": 27, "role": "body", "text": "Fox entered the game averaging 10 points and a team-high 3.9 assists."}
{"game_id": "0021700416", "chunk_id": "0021700416_030", "order": 30, "role": "body", "text": "Timberwolves: Host Phoenix on Saturday."}
{"game_id": "0021700416", "chunk_id": "0021700416_032", "order": 32, "role": "closing", "text": "For more NBA coverage: https://apnews.com/tag/NBAbasketball"}
