{"game_id": "0021300371", "chunk_id": "0021300371_001", "order": 1, "role": "lead", "text": "TORONTO --  With four missed free throws in the final 20 seconds of overtime, the Charlotte Bobcats didn't make things easy on themselves Wednesday night."}
{"game_id": "0021300371", "chunk_id": "0021300371_002", "order": 2, "role": "body", "text": "Good thing they had Kemba Walker around to bail them out."}
{"game_id": "0021300371", "chunk_id": "0021300371_003", "order": 3, "role": "body", "text": "Walker hit a buzzer-beating jump shot in overtime and the Bobcats beat the Raptors 104-102 on Wednesday night, snapping a three-game losing streak in Toronto."}
{"game_id": "0021300371", "chunk_id": "0021300371_004", "order": 4, "role": "body", "text": "Walker had 29 points and Al Jefferson had 24 points and 11 rebounds as the Bobcats won their second straight."}
{"game_id": "0021300371", "chunk_id": "0021300371_005", "order": 5, "role": "body", "text": "Jefferson joked that Walker, who missed a pair from the line with 11 seconds left, had done so intentionally to set up the dramatic finish."}
{"game_id": "0021300371", "chunk_id": "0021300371_006", "order": 6, "role": "body", "text": "\"Kemba, he lives for those shots,\" Jefferson said. \"I really think he missed those free throws on purpose so we could be in that situation, because that's what he lives for. That's what he does. He's been doing that his whole life.\""}
{"game_id": "0021300371", "chunk_id": "0021300371_007", "order": 7, "role": "body", "text": "Walker, who was stripped on the final play of the fourth quarter before missing the key free throws in overtime, said he was eager for the chance at redemption."}
{"game_id": "0021300371", "chunk_id": "0021300371_008", "order": 8, "role": "body", "text": "\"I wanted the basketball,' he said. \"I wanted to make that shot. I was just happy to get the opportunity.\""}
{"game_id": "0021300371", "chunk_id": "0021300371_009", "order": 9, "role": "body", "text": "Josh McRoberts scored 13 points, Ramon Sessions and Gerald Henderson each had 11 and Anthony Tolliver had 10."}
{"game_id": "0021300371", "chunk_id": "0021300371_010", "order": 10, "role": "body", "text": "Jefferson had just five points in the first half, but was better after the break."}
{"game_id": "0021300371", "chunk_id": "0021300371_011", "order": 11, "role": "body", "text": "\"This was his best game by far,\" Bobcats coach Steve Clifford said. \"The second half he was terrific. He both rebounded and scored well in the second half.\""}
{"game_id": "0021300371", "chunk_id": "0021300371_012", "order": 12, "role": "body", "text": "DeMar DeRozan scored 30 points and Kyle Lowry had 17 for the Raptors. Amir Johnson fouled out with 10 points and 13 rebounds as Toronto's two-game winning streak was snapped."}
{"game_id": "0021300371", "chunk_id": "0021300371_013", "order": 13, "role": "body", "text": "After DeRozan made one of two free throws to tie it with one second left, Walker used a Jefferson screen to escape Lowry and hit a fadeaway jumper on the inbounds pass, giving Charlotte wins on consecutive nights for the first time since Nov. 5 and 6, when it beat New York and Toronto."}
{"game_id": "0021300371", "chunk_id": "0021300371_014", "order": 14, "role": "body", "text": "\"I guess there was a little confusion on the defensive end,\" Walker said. \"I just found myself pretty open. Josh made a great pass. I had a second so I had a chance to kind of turn around and set my feet and get a good shot up.\""}
{"game_id": "0021300371", "chunk_id": "0021300371_015", "order": 15, "role": "body", "text": "Lowry credited Charlotte for drawing up a \"great play,\" but said it hurt to lose such a close game."}
{"game_id": "0021300371", "chunk_id": "0021300371_016", "order": 16, "role": "body", "text": "\"You'd rather get blown out by 50 than lose on a buzzer beater,\" Lowry said. \"Hats off to them. Great shot by Kemba.\""}
{"game_id": "0021300371", "chunk_id": "0021300371_017", "order": 17, "role": "body", "text": "Raptors coach Dwane Casey said the defense had to be better on the final possession, when Jonas Valanciunas was late on the switch as Walker got free."}
{"game_id": "0021300371", "chunk_id": "0021300371_018", "order": 18, "role": "body", "text": "\"We need to be more precise and have more attention to detail,\" Casey said."}
{"game_id": "0021300371", "chunk_id": "0021300371_019", "order": 19, "role": "body", "text": "With 15 seconds left in a fourth quarter that had seven lead changes, Henderson made a pair of free throws to put Charlotte up 95-92, only to have Lowry promptly tie it with a 3."}
{"game_id": "0021300371", "chunk_id": "0021300371_020", "order": 20, "role": "body", "text": "After a timeout, Charlotte gave the ball to Walker for a potential game-winning shot, but he was stripped by DeRozan, sending it to overtime."}
{"game_id": "0021300371", "chunk_id": "0021300371_021", "order": 21, "role": "body", "text": "Charlotte led 102-99 with 19 seconds left in the extra session when Henderson missed a pair of free throws. After DeRozan cut it to one with a driving layup, Walker was fouled and also missed both. DeRozan was fouled while shooting at the other end, missing his first but tying the game by making the second."}
{"game_id": "0021300371", "chunk_id": "0021300371_022", "order": 22, "role": "body", "text": "\"We kind of got lucky,\" Walker said."}
{"game_id": "0021300371", "chunk_id": "0021300371_023", "order": 23, "role": "body", "text": "Walker made sure there wouldn't be another overtime by catching McRoberts' inbounds pass and making an open jumper for the win."}
{"game_id": "0021300371", "chunk_id": "0021300371_024", "order": 24, "role": "body", "text": "\"I, for one, am glad he made it, because I don't think I had enough wind for another overtime,\" Jefferson said."}
{"game_id": "0021300371", "chunk_id": "0021300371_025", "order": 25, "role": "body", "text": "Charlotte came in as the league's worst 3-point shooting team, but made eight from beyond the arc for the second straight night."}
{"game_id": "0021300371", "chunk_id": "0021300371_026", "order": 26, "role": "body", "text": "\"If we could make eight 3s every game, it would help a lot,\" Clifford said."}
{"game_id": "0021300371", "chunk_id": "0021300371_027", "order": 27, "role": "body", "text": "Both teams shot poorly in the opening quarter, but Henderson had seven points and Walker made a pair of 3-pointers as the Bobcats led 18-15 after one."}
{"game_id": "0021300371", "chunk_id": "0021300371_028", "order": 28, "role": "body", "text": "Toronto was much better in the second, making 12 of 18 field goal attempts. The Raptors took the lead with an 8-0 run to start the quarter, and DeRozan scored 11 points in the second as Toronto took a 47-37 lead into halftime."}
{"game_id": "0021300371", "chunk_id": "0021300371_029", "order": 29, "role": "body", "text": "Walker scored 11 points in the third and Jefferson had 10 as the Bobcats closed the gap, knotting the score at 70-70 heading into the fourth."}
{"game_id": "0021300371", "chunk_id": "0021300371_030", "order": 30, "role": "closing", "text": "Game notes The Raptors play five of their next six games on the road. ... F Chuck Hayes dressed for the first time since joining Toronto last week in the trade that sent Rudy Gay to Sacramento. ... Attendance was 15,201, a season low for Toronto."}
