{"game_id": "0021300666", "chunk_id": "0021300666_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- Kevin Durant played the fourth quarter Monday night with the intensity of an NBA Finals game.\nShowing plenty of emotion down the stretch and scowling at the Atlanta bench on multiple occasions, Durant scored 41 points to rally the Oklahoma City Thunder past the Hawks 111-109 for their eighth straight victory."}
{"game_id": "0021300666", "chunk_id": "0021300666_002", "order": 2, "role": "body", "text": "The star forward hit the game-winning jumper with 1.5 seconds left, capping Oklahoma City's comeback from a 14-point deficit in the second half.\n\"I know we play a lot of games and a lot of people say January doesn't mean anything,\" Durant said. \"But when you're playing this game with your heart and passion like we do, sometimes you've got to sit back and just enjoy it.\"\nDurant scored 13 in the fourth quarter, including a 16-foot, step-back jumper with 25.5 seconds remaining that put the Thunder ahead for the first time since the opening 2 minutes. Paul Millsap tied it for Atlanta before Durant knocked down the decisive 12-footer while being guarded by DeMarre Carroll.\n\"Coach just drew it out for me and I had to make a play,\" Durant said. \"It was an emotional game. It was up and down the whole game. My emotions were everywhere, so I just had to try to keep it together at the end of the game and make a play for my team.\"\nShelvin Mack tried to throw a pass to Millsap on the final play, but Thabo Sefolosha knocked it away. Millsap scored 23 points to lead the Hawks, who managed only one basket and two points in the final 3:50.\nOklahoma City is 6-0 at home this season when trailing going into the fourth quarter.\n\"I think that's a direct result from the competitive spirit we have,\" Thunder coach Scott Brooks said.\nDurant's 11-game streak of 30 or more points is the longest in the NBA since Tracy McGrady did it in 14 straight games in March and April 2003.\n\"He just hit some tough shots,\" Carroll said. \"The shots were contested and he hit them. I just think we really lost the game on our own. We missed two open threes. We got the shots that we wanted. We just missed them. We've got to learn from that but it was a hard-fought game.\""}
{"game_id": "0021300666", "chunk_id": "0021300666_003", "order": 3, "role": "closing", "text": "Durant had another efficient outing, shooting 15 of 25 from the field and 5 for 7 from 3-point range. During his streak, he has scored 40 or more five times, including a 54-point outing against Golden State.\nBrooks said he has run out of superlatives to describe what Durant is doing.\n\"There's nothing more to say,\" Brooks said. \"He's a special player. He's going to be an MVP candidate until he decides to retire. He's an amazing teammate, which I'm as proud of that, as he is as a player. He cares about the game. He cares about his team. He cares about Oklahoma City. He's just a great ambassador, not only to our team but the league and to the basketball world.\"\nReggie Jackson had 18 points for Oklahoma City (36-10), which takes the Western Conference's best record into a showdown Wednesday at Miami, the two-time defending NBA champion.\nThe Hawks led by 14 early in the third quarter and still held a double-digit advantage in the final minute of the period before Durant fueled the Thunder's rally. His layup with 2:11 left tied the score at 107.\nAtlanta started missing shots as Oklahoma City ramped up its defensive effort, which had been lacking for 3½ quarters.\n\"Our group really competed tonight,\" Hawks coach Mike Budenholzer said. \"I think their commitment to each other and their commitment to playing the way we want to play is excellent. Losing is very hard in this league and our guys are hurting.\"\nThe Hawks hit seven of their first nine 3-point attempts and led by as many as 14 points in the first half before settling for a 57-50 halftime lead.\nAtlanta opened the second half with a 10-3 run to extend its lead to 14. Oklahoma City scored the next nine points and drew to 67-62 after a 3-pointer by Jackson, but Kyle Korver hit two 3-pointers as the Hawks scored eight of the next 10 points to rebuild a double-digit advantage at 75-64.\nJeremy Lamb scored 14 points for Oklahoma City. Serge Ibaka managed only nine points but the NBA leader in blocked shots had a season-high six.\nSeven Hawks reached double figures in scoring. Mike Scott had 16 points, including 11 in the fourth quarter. Carroll and Mack added 15 points each, while Korver scored 14 and Lou Williams and Dennis Schroder had 10 apiece.\nNotes\nFor the fourth time this season, the Thunder have assigned G Andre Roberson to the Tulsa 66ers of the NBA Development League. Roberson has played in 19 games for the Thunder and he made four starts earlier this season. ... Dallas Cowboys quarterback Tony Romo and Cleveland Browns QB Brandon Weeden, who is from nearby Edmond, attended the game. ... Ibaka was called for a technical with 3:48 left in the first quarter after complaining about receiving a personal foul. ... Korver extended his NBA-record streak of hitting at least one 3-pointer to 113 games. ... The Thunder held their sixth annual Military Appreciation Night, with military personnel and their families attending thanks in part to more than 1,000 season-ticket holders who gave away seats for the game."}
