{"game_id": "0021400180", "chunk_id": "0021400180_001", "order": 1, "role": "lead", "text": "DALLAS --  Dirk Nowitzki and the rest of the Dallas starters left it to the reserves to finish off the highest point total for the Mavericks in more than five years."}
{"game_id": "0021400180", "chunk_id": "0021400180_002", "order": 2, "role": "body", "text": "Nowitzki scored 23 points before sitting the entire fourth quarter, and the Mavericks used the NBA's highest-scoring offense to roll to a 140-106 victory against the Los Angeles Lakers on Friday night."}
{"game_id": "0021400180", "chunk_id": "0021400180_003", "order": 3, "role": "body", "text": "The Mavericks won their sixth straight game overall and fourth in a row against the Lakers, who were swept by Dallas in the regular season for the first time in 2013-14."}
{"game_id": "0021400180", "chunk_id": "0021400180_004", "order": 4, "role": "body", "text": "Nowitzki, Monta Ellis and Chandler Parsons were a combined 23 of 33 from the field as the Mavericks set season highs in points, shooting percentage (62 percent) and assists (37). Parsons had 21 points and Ellis scored 20 to go with 10 assists."}
{"game_id": "0021400180", "chunk_id": "0021400180_005", "order": 5, "role": "body", "text": "\"We just moved the ball,\" Parsons said after the Mavericks scored their most points since beating Phoenix 140-116 on April 5, 2009. \"People had good shots. If someone had a better shot, we moved the ball.\""}
{"game_id": "0021400180", "chunk_id": "0021400180_006", "order": 6, "role": "body", "text": "Kobe Bryant wasn't playing last season when the Lakers gave up more than 140 points three times in a month. Now he's part of a defense allowing a league-high 112.5 points per game."}
{"game_id": "0021400180", "chunk_id": "0021400180_007", "order": 7, "role": "body", "text": "\"Man, they've got a lot of shooters,\" said Bryant, who missed his first eight shots and was 6 of 22 for 17 points. \"They blitzkrieg-ed us there.\""}
{"game_id": "0021400180", "chunk_id": "0021400180_008", "order": 8, "role": "body", "text": "Jeremy Lin had 18 points for the Lakers, who came in with their first two-game winning streak."}
{"game_id": "0021400180", "chunk_id": "0021400180_009", "order": 9, "role": "body", "text": "The starters for both teams sat out the final quarter in Dallas' most lopsided win over the Lakers since a 122-86 victory finished off a second-round sweep when the Mavericks won their only title in 2011."}
{"game_id": "0021400180", "chunk_id": "0021400180_010", "order": 10, "role": "body", "text": "The Mavericks were playing the first of a back-to-back before heading to Houston for Parsons' first game in the city since signing an offer sheet with Dallas that the Rockets declined to match."}
{"game_id": "0021400180", "chunk_id": "0021400180_011", "order": 11, "role": "body", "text": "\"We've just got to get to the plane quick, get there, get some rest and get ready,\" Dallas coach Rick Carlisle said. \"They're sitting there with two days' rest. There's an advantage for them, but I like how our team played tonight.\""}
{"game_id": "0021400180", "chunk_id": "0021400180_012", "order": 12, "role": "body", "text": "The Mavericks, who came in averaging a league-high 108.9 points per game, scored seven points in the final 5.9 seconds of the first quarter and put the game away with a 42-point third period, which ended with Dallas in front 110-83."}
{"game_id": "0021400180", "chunk_id": "0021400180_013", "order": 13, "role": "body", "text": "\"Maybe in that locker room, guys are satisfied with the last two wins and just took this one for granted and just started to look forward to going home,\" Lakers coach Byron Scott said. \"You can't do that if you want to be competitive in this league.\""}
{"game_id": "0021400180", "chunk_id": "0021400180_015", "order": 15, "role": "body", "text": "Lakers: Wayne Ellington played for the first time since Nov. 9 after the death of his father. ... Jordan Hill had 16 points and 10 rebounds. He was 7 of 7 from the field."}
{"game_id": "0021400180", "chunk_id": "0021400180_016", "order": 16, "role": "body", "text": "Mavericks: It's the first six-game winning streak for Dallas since February 2012. ... Dallas had eight players score in double figures for the second time this season. J.J. Barea led the under-20 scorers with 16. ... All four wins on the current franchise-best streak against the Lakers were by double digits."}
{"game_id": "0021400180", "chunk_id": "0021400180_018", "order": 18, "role": "body", "text": "Nowitzki was 8 of 10 from the field and made both of his 3-point attempts. He's shooting 53 percent overall and 47 percent from long range. If those numbers hold up, both would be career highs for the 7-footer in his 17th season."}
{"game_id": "0021400180", "chunk_id": "0021400180_020", "order": 20, "role": "body", "text": "Nowitzki hit two free throws to start the finishing flurry in the first, and Jae Crowder stole a bad inbounds pass from Robert Sacre, who compounded the problem by fouling Crowder as he made a layup. Richard Jefferson grabbed the rebound on Crowder's missed free throw and passed out to Barea, who hit a 3-pointer for a 38-27 lead with 0.1 seconds left."}
{"game_id": "0021400180", "chunk_id": "0021400180_022", "order": 22, "role": "body", "text": "Lakers: Host Denver on Sunday."}
{"game_id": "0021400180", "chunk_id": "0021400180_023", "order": 23, "role": "closing", "text": "Mavericks: At Rockets on Saturday."}
