{"game_id": "0021200595", "chunk_id": "0021200595_001", "order": 1, "role": "lead", "text": "CHICAGO -- The game plan was simple for the Grizzles in overtime: Utilize one of the most imposing front lines in the NBA."}
{"game_id": "0021200595", "chunk_id": "0021200595_002", "order": 2, "role": "body", "text": "Marc Gasol scored 19 points, Zach Randolph had 13 points and 19 rebounds, and Memphis beat the Chicago Bulls 85-82 on Saturday night."}
{"game_id": "0021200595", "chunk_id": "0021200595_003", "order": 3, "role": "body", "text": "Gasol and Randolph combined for seven of the nine overtime points for the Grizzlies."}
{"game_id": "0021200595", "chunk_id": "0021200595_004", "order": 4, "role": "body", "text": "\"When we got into overtime we went to our horses, Zach Randolph and Marc Gasol. We played an inside-outside game. Our All-Star bigs took over the game,\" the Grizzlies' Tony Allen said."}
{"game_id": "0021200595", "chunk_id": "0021200595_005", "order": 5, "role": "body", "text": "Memphis scored the first six points of the extra period, Gasol's putback making it 82-76. The Bulls cut it to 83-80 on Jimmy Butler's layup and had a chance to tie, but Nate Robinson missed a 3-pointer with 25 seconds left."}
{"game_id": "0021200595", "chunk_id": "0021200595_006", "order": 6, "role": "body", "text": "Robinson made a layup with 6.6 seconds left, but Jerryd Bayless scored with 4.8 seconds remaining to make it 85-82. Carlos Boozer missed a 3 as time expired."}
{"game_id": "0021200595", "chunk_id": "0021200595_007", "order": 7, "role": "body", "text": "Chicago, playing its third consecutive overtime game in four days, didn't have enough in overtime. The Bulls played without forward Luol Deng and had to fight back from a 17-point, third-quarter deficit."}
{"game_id": "0021200595", "chunk_id": "0021200595_008", "order": 8, "role": "body", "text": "Butler, starting in place of Deng, scored a career-high 18 points and Boozer added 17 as the Bulls had a three-game winning streak snapped."}
{"game_id": "0021200595", "chunk_id": "0021200595_009", "order": 9, "role": "body", "text": "\"It was nerve-wrecking at first. I was rushing things. Joakim (Noah) and Booz told me to calm down and play like you are coming off the bench,\" Butler said of his first career start."}
{"game_id": "0021200595", "chunk_id": "0021200595_010", "order": 10, "role": "body", "text": "The Bulls shot just 3 for 10 in overtime, but forward Taj Gibson didn't blame fatigue for the loss."}
{"game_id": "0021200595", "chunk_id": "0021200595_011", "order": 11, "role": "body", "text": "\"You just have to play through it. We had a chance to win this game in the fourth. We had a couple of times to take advantage in overtime,\" Gibson said. \"We had some bad shots in the game and we couldn't rebound the ball late. Even though we won the rebounding battle, we gave up too many offensive rebounds.\""}
{"game_id": "0021200595", "chunk_id": "0021200595_012", "order": 12, "role": "body", "text": "The Bulls are 3-1 in overtime this season. The three consecutive overtime games are the first in franchise history."}
{"game_id": "0021200595", "chunk_id": "0021200595_013", "order": 13, "role": "body", "text": "Chicago played without Noah in the fourth quarter and overtime."}
{"game_id": "0021200595", "chunk_id": "0021200595_014", "order": 14, "role": "body", "text": "\"That's just a coaching decision,\" Bulls coach Tom Thibodeau said."}
{"game_id": "0021200595", "chunk_id": "0021200595_015", "order": 15, "role": "body", "text": "It was one that surprised Randolph."}
{"game_id": "0021200595", "chunk_id": "0021200595_016", "order": 16, "role": "body", "text": "\"I was wondering why they kept Noah out,\" he said."}
{"game_id": "0021200595", "chunk_id": "0021200595_017", "order": 17, "role": "body", "text": "Noah left without talking to reporters."}
{"game_id": "0021200595", "chunk_id": "0021200595_018", "order": 18, "role": "body", "text": "Robinson banked in a 3 with 1:33 left in regulation to give Chicago a 75-72 lead, then Gasol scored four consecutive points to get Memphis the lead back at 75-74. Marco Belinelli split a pair of free throws to tie the game at 76 with 31.4 seconds to play. After Randolph missed an 18-footer with 4.9 seconds left, Robinson missed a 21-footer as time expired, sending the game into overtime."}
{"game_id": "0021200595", "chunk_id": "0021200595_019", "order": 19, "role": "body", "text": "\"Offensive rebounding ultimately got us the win. We were battling and battling. They made some tough defensive plays and then we finished off the possession with an offensive rebound and they couldn't finish it off with a defensive rebound,\" Grizzlies coach Lionel Hollins said."}
{"game_id": "0021200595", "chunk_id": "0021200595_020", "order": 20, "role": "body", "text": "After trailing by 17 early in the third quarter, the Bulls cut it to five early in the fourth quarter, but Memphis quickly answered. Allen made a pair of free throws and Mike Conley had a steal and a layup to make it 64-55 with 9:30 left before the Bulls rallied."}
{"game_id": "0021200595", "chunk_id": "0021200595_021", "order": 21, "role": "body", "text": "\"In the overtime, we moved the ball better. We created some open shots and we kept attacking the paint,\" Gasol said. \"I think they got too many easy buckets and that's why they got back in the game. Too many of those.\""}
{"game_id": "0021200595", "chunk_id": "0021200595_022", "order": 22, "role": "body", "text": "Memphis has won two straight after dropping three in a row."}
{"game_id": "0021200595", "chunk_id": "0021200595_023", "order": 23, "role": "body", "text": "Rudy Gay finished with 16 points and Conley had 13 points and nine assists."}
{"game_id": "0021200595", "chunk_id": "0021200595_024", "order": 24, "role": "body", "text": "Trailing 30-25 midway through the second quarter, the Grizzlies scored 13 unanswered points to take a 38-30 lead with 1:57 left in the half. Gay scored six straight points in the span."}
{"game_id": "0021200595", "chunk_id": "0021200595_025", "order": 25, "role": "body", "text": "Memphis led 44-34 at the half. Conley scored 10 points in the half and Gasol had nine. Boozer and Noah led the Bulls with 10 points apiece. Chicago was just 5-for-18 shooting in the second quarter and committed six turnovers."}
{"game_id": "0021200595", "chunk_id": "0021200595_026", "order": 26, "role": "body", "text": "\"In the second quarter we got in a big hole,\" Thibodeau said. \"That went into the third quarter and we could not get organized. The group that went in there battled back and we wanted to ride it to see if we could climb back into it.\""}
{"game_id": "0021200595", "chunk_id": "0021200595_027", "order": 27, "role": "body", "text": "After Boozer's basket opened up the third quarter, Allen capped off an 8-0 run with a dunk to extend the lead to 52-36. Gay's jumper gave Memphis a 54-37 lead, its largest of the game."}
{"game_id": "0021200595", "chunk_id": "0021200595_028", "order": 28, "role": "body", "text": "Randolph, who missed Friday's win over Sacramento with a sore back, played 41 minutes."}
{"game_id": "0021200595", "chunk_id": "0021200595_029", "order": 29, "role": "body", "text": "\"He got all of his work done without having to dominate the ball. He just did it all with dirty work. Offensive and defensive glass,\" said Conley."}
{"game_id": "0021200595", "chunk_id": "0021200595_030", "order": 30, "role": "body", "text": "Deng, averaging a team-high 17.4 points, tried to play through a sore right hamstring in Friday's overtime win at Boston but scored a season-low three points on 1-of-6 shooting before aggravating the injury and exiting late in the third quarter."}
{"game_id": "0021200595", "chunk_id": "0021200595_031", "order": 31, "role": "closing", "text": "He is listed day to day, and there are no plans for an MRI."}
