{"game_id": "0021200494", "chunk_id": "0021200494_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  Getting ready to play his fourth road game in five nights, Nicolas Batum said he felt sluggish during warmups Saturday night at Minnesota."}
{"game_id": "0021200494", "chunk_id": "0021200494_002", "order": 2, "role": "body", "text": "\"I was like, 'Let's play this game and get out of here,' \" he said. \"I was tired.\""}
{"game_id": "0021200494", "chunk_id": "0021200494_003", "order": 3, "role": "body", "text": "It was the Timberwolves, though, who looked and played how Batum felt."}
{"game_id": "0021200494", "chunk_id": "0021200494_004", "order": 4, "role": "body", "text": "Batum and Wesley Matthews each made five 3s and scored 26 points to lead the Portland Trail Blazers over the injury-depleted Timberwolves 102-97."}
{"game_id": "0021200494", "chunk_id": "0021200494_005", "order": 5, "role": "body", "text": "\"I got tired I think when I got 31 here a couple years ago,\" Batum said, recalling a 31-point performance at Minnesota in 2010 -- he had five 3s in that game as well."}
{"game_id": "0021200494", "chunk_id": "0021200494_007", "order": 7, "role": "body", "text": "Imagine if he had actually felt energized."}
{"game_id": "0021200494", "chunk_id": "0021200494_008", "order": 8, "role": "body", "text": "The Blazers tied a franchise record with 16 3-pointers and withstood a fourth-quarter rally by the Timberwolves to win for the 10th time in 13 games and finish their four-game road trip with a 3-1 record."}
{"game_id": "0021200494", "chunk_id": "0021200494_009", "order": 9, "role": "body", "text": "\"If you shoot the 3 that well, you should probably win by more than five,\" Portland coach Terry Stotts said."}
{"game_id": "0021200494", "chunk_id": "0021200494_010", "order": 10, "role": "body", "text": "Nikola Pekovic led the Wolves with 21 points but left the game in the third quarter because of a left hip strain. Only hours earlier, Minnesota learned it lost star forward Kevin Love to a broken right hand for the second time this season when an MRI confirmed the injury."}
{"game_id": "0021200494", "chunk_id": "0021200494_011", "order": 11, "role": "body", "text": "The banged-up Timberwolves -- who dressed only 10 players -- also played without point guard Ricky Rubio, who sat out with back spasms."}
{"game_id": "0021200494", "chunk_id": "0021200494_012", "order": 12, "role": "body", "text": "Afterward, coach Rick Adelman bemoaned his team's flat play in the first three quarters before suddenly coming to life in the end."}
{"game_id": "0021200494", "chunk_id": "0021200494_013", "order": 13, "role": "body", "text": "\"The league doesn't stop for you, there's nobody coming over the mountain for us, it's who we've got right now,\" Adelman said. \"And that's what we have to do, and everybody has to step up.\""}
{"game_id": "0021200494", "chunk_id": "0021200494_014", "order": 14, "role": "body", "text": "The Blazers led by as many as 22 before Derrick Williams fueled a 26-8 run with 18 points in the fourth quarter. His two-handed dunk with 1:19 to play cut Portland's lead to 96-94. Williams rebounded a miss from Damian Lillard on the ensuing possession, but J.J. Barea threw the ball out of bounds with 50 seconds left."}
{"game_id": "0021200494", "chunk_id": "0021200494_015", "order": 15, "role": "body", "text": "\"I think we all just took it a little personal,\" Williams said. \"We're down 20 points in the third quarter, and just a lot of guys playing with a lot of heart in the fourth quarter. We've just got to play like that all the time.\""}
{"game_id": "0021200494", "chunk_id": "0021200494_016", "order": 16, "role": "body", "text": "LaMarcus Aldridge followed the turnover with a 13-footer to make it 98-94. Williams appeared to score on a tip on the next possession, but the officials waved off the score saying he traveled."}
{"game_id": "0021200494", "chunk_id": "0021200494_017", "order": 17, "role": "body", "text": "Matthews and Batum each added a pair of free throws to seal the win."}
{"game_id": "0021200494", "chunk_id": "0021200494_018", "order": 18, "role": "body", "text": "\"I've been telling you guys this since the start of the year -- we're resilient, we can play,\" Matthews said. \"We're good. We can win. We're a playoff team.\""}
{"game_id": "0021200494", "chunk_id": "0021200494_019", "order": 19, "role": "closing", "text": "Game notes Portland last hit 16 3-pointers on April 15, 2011, at Sacramento ... Lillard had 20 points for the Blazers. ... Batum has hit at least three 3-pointers in 15 games this season. ... Love re-fractured his third metacarpal bone in the hand during the third quarter Thursday night at Denver. The Wolves said they expect to know more about a timetable for his return after he is examined by a hand specialist in New York. ... Pekovic had his fifth game with at least 20 points and 10 rebounds this season ... The Blazers had not had a winning record on a road trip of four games or longer since going 3-1 from Oct. 27-Nov. 2 in 2010. ... The Wolves scored a season-high 36 fourth-quarter points."}
