{"game_id": "0021301008", "chunk_id": "0021301008_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- Down and out or down to the wire, the 76ers are freefalling toward NBA history.\nD.J Augustin scored 20 points and Taj Gibson had 19 points and 13 rebounds to lead the Chicago Bulls to a 102-94 win over Philadelphia on Wednesday night, handing the 76ers their 22nd straight loss.\nThe Sixers are four losses shy of matching the NBA record for the longest single-season losing streak. The Cleveland Cavaliers set the record of 26 consecutive losses in the 2010-11 season. The Vancouver Grizzlies (1995-96), Denver Nuggets (1997-98) and Charlotte Bobcats (2011-12) each lost 23 straight."}
{"game_id": "0021301008", "chunk_id": "0021301008_002", "order": 2, "role": "closing", "text": "\"Winnable game,\" 76ers coach Brett Brown said. \"I say that because a group that's been losing ... still stays together. They still compete. I'm proud of them.\"\nThe Sixers also lost their 17th straight home game since beating Charlotte on Jan. 15. They were 8-11 at home at that point and had already defeated Miami, the Bulls, and Houston in Philadelphia.\nAfter the Sixers were 3-0 following a Nov. 2 win over Chicago, fans held signs that said, \"3-0. That's No Bull.\"\nThat seems like another season at times after the Sixers traded Evan Turner, Spencer Hawes and Lavoy Allen at the deadline for draft picks, a necessary step for a rebuilding franchise.\nUnlike most of the first 21 losses in the streak, the Sixers were competitive until the final possessions, never letting the Bulls lead by more than 11.\nSixers center Byron Mullens, who hadn't attempted a shot all game, hit consecutive 3s to pull the Sixers to 83-80. He made a nifty save on a ball headed out of bounds, leading to Henry Sims' bucket and a foul. With a chance to tie the game, Sims missed the free throw with 8:19 left.\nThaddeus Young bailed him out a possession later with a 3-pointer that made it 85-all.\nJoakim Noah buried a go-ahead 3 from the top of the arc and Augustin followed with one from the sideline to put the Bulls up 91-85.\nTony Wroten's 3 made it 93-90 but it was just more false hope. Carlos Boozer's emphatic dunk stretched the lead to six and the Bulls did enough to hang on and move to .500 on the road (17-17).\nThe Sixers have lost three of four by less than 10 points after losing each of the previous 10 games by double-digits.\n\"We knew it would be this type of game,\" Augustin said. \"We just tried to fight them until the end and it was a fight, a real fight.\"\nThe Sixers could make it 23 straight with a loss Friday to New York. Then three straight on the road at Chicago, San Antonio and Houston. If the Sixers lose all of those games, the potential record 27th loss would come March 29 vs. Detroit.\nYoung scored 24 points for the Sixers and Wroten had 17.\n\"We're going to get one soon,\" Wroten said.\nBoozer had 12 points and 11 rebounds for the Bulls and Noah added 14 points and 10 boards. The Sixers' solid 11-for-24 3-point shooting was undone by a 9 of 19 mark from the free-throw line.\n\"There is just no inch for error,\" Brown said. \"There's no wiggle room at all.\"\nThe Sixers stayed tight and chipped away in the third, making it 64-61 on Young's 3-pointer. Sims was 0 for 7 from the floor until his first basket cut it to 64-63.\nThe Sixers just couldn't make the clutch basket or two to finally take the lead. They'd get as close again as two points in the third and trailed only 75-69 at the end of the quarter.\n\"I think Brett's done a great job with them,\" Bulls coach Tom Thibodeau said. \"They've got a lot of moving parts. I give a guy like Young a lot of credit for his professionalism -- how hard he plays. They shot the ball well.\nThe Bulls played without Derrick Rose, the former MVP point guard who tore the meniscus in his right knee at Portland in November and was ruled out for the remainder of the season.\nThibodeau said Rose could could be ready to return if he gets the call to play this summer for Team USA at the world championships.\n\"I know he'd like to do it,\" Thibodeau said. \"I know how USA basketball feels about him. If he's cleared to do it, I'd love to see him do it.\"\nGame notes\nThe Sixers are 3-32 since a four-game winning streak ended Jan. 4. ... The Bulls have won seven of eight against the Sixers."}
