{"game_id": "0021400783", "chunk_id": "0021400783_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Detroit Pistons may be 11 games under .500, but they're starting to think about the postseason -- something that is a very real possibility when playing in the Eastern Conference."}
{"game_id": "0021400783", "chunk_id": "0021400783_002", "order": 2, "role": "body", "text": "\"We're in the hunt right now,\" forward Greg Monroe said. \"We're jockeying for position. There are a lot of games left but these are the games with people right in front of us that mean a lot. Every game we have to come knowing that we are jockeying for position.\""}
{"game_id": "0021400783", "chunk_id": "0021400783_003", "order": 3, "role": "body", "text": "Monroe had 23 points and 12 rebounds, D.J. Augustin added 18 points and Detroit handed the Charlotte Hornets their third straight loss 106-78 on Tuesday night."}
{"game_id": "0021400783", "chunk_id": "0021400783_004", "order": 4, "role": "body", "text": "The Pistons are 16-9 over their last 25 games."}
{"game_id": "0021400783", "chunk_id": "0021400783_005", "order": 5, "role": "body", "text": "Monroe, who had 14 double-doubles in January to tie a franchise record, was dominant inside and on the drive when the Pistons (21-32) built a 23-point lead at the end of the third quarter and were never challenged again."}
{"game_id": "0021400783", "chunk_id": "0021400783_006", "order": 6, "role": "body", "text": "Monroe has recorded at least 20 points and 10 rebounds 48 times since the 2011-12 season, the most 20-10 games in the Eastern Conference during that span. Andre Drummond had 14 points and nine rebounds as the Pistons outrebounded the Hornets 48-38."}
{"game_id": "0021400783", "chunk_id": "0021400783_007", "order": 7, "role": "body", "text": "Pistons coach Stan Van Gundy's game plan was to pack the low post and control Jefferson and make the Hornets beat them from the outside."}
{"game_id": "0021400783", "chunk_id": "0021400783_008", "order": 8, "role": "body", "text": "It appeared early on that strategy would backfire after the Hornets knocked down 8 of 11 3-pointers in the first half. Rookie P.J. Hairston had 16 points on four 3s."}
{"game_id": "0021400783", "chunk_id": "0021400783_009", "order": 9, "role": "body", "text": "\"At that point you're sitting there saying, `OK, great game plan.' You know?\" Van Gundy said. \"But we stayed with it and we did a better job and they probably got a little tired as the game wore on and missed some shots. It ended up working out.\""}
{"game_id": "0021400783", "chunk_id": "0021400783_010", "order": 10, "role": "body", "text": "The Hornets would only make 1 of 13 3-pointers after intermission, and Detroit pulled away in the third, outscoring Charlotte 29-14 in the quarter."}
{"game_id": "0021400783", "chunk_id": "0021400783_011", "order": 11, "role": "body", "text": "Jefferson was held to 6 of 14 shooting."}
{"game_id": "0021400783", "chunk_id": "0021400783_012", "order": 12, "role": "body", "text": "\"That was just a great team defensive night,\" Monroe said."}
{"game_id": "0021400783", "chunk_id": "0021400783_013", "order": 13, "role": "body", "text": "The Hornets had no answer for Monroe, who had 11 points in the third quarter."}
{"game_id": "0021400783", "chunk_id": "0021400783_014", "order": 14, "role": "body", "text": "The Pistons scored 50 points in the paint and got to the foul line 30 times. They made 27."}
{"game_id": "0021400783", "chunk_id": "0021400783_015", "order": 15, "role": "body", "text": "\"We were attacking the basket both on drives and post-ups,\" Van Gundy said. \"If you're in the paint all the time then you have a chance to get to the line.\""}
{"game_id": "0021400783", "chunk_id": "0021400783_016", "order": 16, "role": "body", "text": "Gerald Henderson had 17 points, and Al Jefferson added 13 points and 10 rebounds for the Hornets (22-30)."}
{"game_id": "0021400783", "chunk_id": "0021400783_017", "order": 17, "role": "body", "text": "Charlotte enters the All-Star break on a three-game skid and in dire need of rest to get some players healthy."}
{"game_id": "0021400783", "chunk_id": "0021400783_018", "order": 18, "role": "body", "text": "When they return, they will have Mo Williams running the offense. The veteran point guard was acquired from Minnesota on Tuesday along with Troy Daniels in exchange for Gary Neal and a second-round draft pick in 2019."}
{"game_id": "0021400783", "chunk_id": "0021400783_019", "order": 19, "role": "body", "text": "Williams will split time with Brandon Roberts while Kemba Walker continues to recover from knee surgery. The Hornets also expect to get Michael Kidd-Gilchrist and Bismack Biyombo back from injuries after the break."}
{"game_id": "0021400783", "chunk_id": "0021400783_020", "order": 20, "role": "body", "text": "\"When we get our full team back and get some of these guys back from injuries, we'll be feeling good,\" Jefferson said. \"But the guys who are here right here, right now got to do a good job and keep us in the mix until we get our full team back.\""}
{"game_id": "0021400783", "chunk_id": "0021400783_022", "order": 22, "role": "body", "text": "Pistons: Augustin has scored in double figures in six straight games and in eight of his last nine. ... Jodie Meeks was a perfect 10 of 10 from the foul line."}
{"game_id": "0021400783", "chunk_id": "0021400783_023", "order": 23, "role": "body", "text": "Hornets: Henderson has scored in double digits in 20 of the last 27 games. ... Jeffery Taylor started and had a season-high 12 points for the Hornets."}
{"game_id": "0021400783", "chunk_id": "0021400783_025", "order": 25, "role": "body", "text": "The Pistons built a big lead, which allowed them to rest several starters. Monroe was the only player to play more than 30 minutes. That's good news considering they were on the front end of a back-to-back and host San Antonio on Wednesday night."}
{"game_id": "0021400783", "chunk_id": "0021400783_026", "order": 26, "role": "body", "text": "\"It was good to just get that quarter off and get a little bit of extra rest going into tomorrow's game,\" Monroe said."}
{"game_id": "0021400783", "chunk_id": "0021400783_028", "order": 28, "role": "body", "text": "Pistons: Host San Antonio on Wednesday night."}
{"game_id": "0021400783", "chunk_id": "0021400783_029", "order": 29, "role": "closing", "text": "Hornets: Host Oklahoma City on Feb. 21."}
