{"game_id": "0021400073", "chunk_id": "0021400073_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- Mike Dunleavy had a hot hand and his unselfish teammates kept feeding him.\nDunleavy scored 12 of his season-high 27 points in the decisive third quarter and the Chicago Bulls held off a late Philadelphia rally in a 118-115 victory over the 76ers on Friday night.\nJimmy Butler added 23 points and Pau Gasol chipped in 17 points and 12 rebounds for the Bulls, whose 4-0 road start is their best since going 6-0 away from Chicago to start the 1996-97 season. The Bulls' Derrick Rose missed his third game in the last four after aggravating his sprained ankles in Wednesday's 95-86 win over Milwaukee when the former MVP had 13 points and seven assists in 31 minutes. He is day-to-day.\nDunleavy made 4 of 6 field goals, including 3 of 4 3-pointers in the third period.\n\"Our guys did a good job of recognizing he was going well,\" Bulls coach Tom Thibodeau said. \"That's what I like about our team; it's a very unselfish team.\"\nDunleavy said playing with this group is enjoyable.\n\"It's great when you have a bunch of unselfish guys, focused on sharing the ball and whatever it takes to win,\" he said. \"It's what every player wants.\"\nTony Wroten led four Sixers in double-figures with a career-high 31 points. Philadelphia fell to 0-6 -- their worst start to the season since losing their first 15 in 1972-73 when they set an NBA mark for futility by finishing 9-73.\nThe Bulls led by as many as 18 points after halftime. But the Sixers used a late 13-3 run to close within 116-115 with five seconds left when Chris Johnson made a 3-pointer after Kirk Hinrich missed two free throws on Chicago's previous possession. Hinrich followed Johnson's 3 by making a pair of free throws to put Chicago ahead by three with 2.1 seconds left. Johnson's shot from 43 feet that would have tied it at the buzzer wasn't close.\nCoach Brett Brown appreciated his team's resilience, as the Sixers continue to field a team more intent on setting up their future rather than winning in the present.\n\"We ask our guys often, `What would you want other teams to say about you?\" Brown said. \"We want respect. We want to work hard. We want to have a tenacity and a spirit that reflects the city and reflects a bunch of young guys.\"\nPhiladelphia rookie Nerlens Noel sat out after spraining his left ankle in Wednesday's 91-89 loss to Orlando. Henry Sims started in place of Noel and had 16 points and eight rebounds. Hollis Thompson also set a career-high with 21 points and Luc Mbah a Moute had 16 points and 11 boards for the Sixers.\nDunleavy's 3-pointer from the left wing capped a 14-5 Bulls spurt over the first 3:53 of the third quarter that gave Chicago its largest lead to that point, 71-62. Chicago ultimately outscored the Sixers 35-19 in the third quarter to take a decisive 92-76 advantage into the final period.\nIt didn't look like it would be close until Philadelphia's late surge.\n\"We found a way to win,\" Thibodeau said. \"And at the end of the day that's what you have to do, keep finding a way to scratch out wins.\"\nDunleavy shot 9-for-15 from the field, including 5-for-8 from the arc.\nThe Sixers led by as many as nine points in the first half that ended with the teams tied at 57. Wroten led Philadelphia at the break with 14 points.\nJoakim Noah returned to the lineup for the Bulls after missing the last two games with flu-like symptoms, finishing with five points and nine rebounds.\nTIPS INS:\nSixers: Philadelphia F Malcolm Thomas sat out with a left knee injury. . Sixers first-round pick Joel Embiid, who is expected to miss the entire season with a foot injury, was back on the team's bench after returning from his native Africa following the death of his younger brother. . Philadelphia Eagles wide receiver Jeremy Maclin watched the game from courtside seats. .\nBulls: Mike Dunleavy's brother, Baker, is an assistant coach at Villanova. Baker Dunleavy couldn't attend the game because of Villanova team function.\nUP NEXT:\nSixers: At Toronto on Sunday.\nChicago: Host Boston on Saturday."}
