{"game_id": "0021700908", "chunk_id": "0021700908_001", "order": 1, "role": "lead", "text": "CLEVELAND --  LeBron James had quite a February in a one-of-a-kind career."}
{"game_id": "0021700908", "chunk_id": "0021700908_002", "order": 2, "role": "body", "text": "He finished the month averaging a triple-double for the first time in his career after producing 31 points, 12 rebounds and 11 assists on Tuesday night in the Cleveland Cavaliers' 129-123 win over the Brooklyn Nets. James has 12 triple-double this season and 67 in his career."}
{"game_id": "0021700908", "chunk_id": "0021700908_003", "order": 3, "role": "body", "text": "\"Scoring has always been last for me,\" James said. \"I've never looked at myself as a scorer. But to know the history of the game and seeing the guys that put up triple-doubles on a regular (basis) from Jason Kidd to Magic Johnson to Oscar Robertson to Russell Westbrook, you can throw my name in there as well.\""}
{"game_id": "0021700908", "chunk_id": "0021700908_004", "order": 4, "role": "body", "text": "His 11th assist on Tuesday came late in the game and gave him 8,000 in his career. He's the first player in NBA history with 30,000 points, 8,000 rebounds and 8,000 assists."}
{"game_id": "0021700908", "chunk_id": "0021700908_005", "order": 5, "role": "body", "text": "\"With the long list of so many great players that have come through this league, in the history of this league, for me to be the only (person) in a category, I think it's pretty cool,\" James said. \"It's pretty cool.\""}
{"game_id": "0021700908", "chunk_id": "0021700908_006", "order": 6, "role": "body", "text": "James also became the first frontcourt player and the 11th overall in league history to reach 8,000 assists."}
{"game_id": "0021700908", "chunk_id": "0021700908_007", "order": 7, "role": "body", "text": "Rodney Hood's three-point play with 40 seconds remaining gave Cleveland a 123-121 lead. James and George Hill hit two free throws each in the final 16 seconds to seal the win."}
{"game_id": "0021700908", "chunk_id": "0021700908_008", "order": 8, "role": "body", "text": "Jarrett Allen's two free throws gave Brooklyn a 119-117 lead with 1:18 to play. Jordan Clarkson's 3-pointer put Cleveland ahead, but Allen Crabbe's runner in the lane put the Nets up 121-120."}
{"game_id": "0021700908", "chunk_id": "0021700908_009", "order": 9, "role": "body", "text": "Hood, one of four players acquired at the trade deadline, hit a jumper from the wing and made the foul shot that gave Cleveland a two-point lead."}
{"game_id": "0021700908", "chunk_id": "0021700908_010", "order": 10, "role": "body", "text": "\"The play kind of broke down,\" Hood said. \"He (Jarrett Allen) cut me off. I stepped back. It's a shot I work on all the time.\""}
{"game_id": "0021700908", "chunk_id": "0021700908_011", "order": 11, "role": "body", "text": "Nets forward Rondae Hollis-Jefferson, who scored 14 points, wasn't surprised about James' performance."}
{"game_id": "0021700908", "chunk_id": "0021700908_012", "order": 12, "role": "body", "text": "\"He's a superstar player and is super aggressive, and he just took over,\" he said. \"It came down to a lot of tough shots being made, and LeBron getting them.\""}
{"game_id": "0021700908", "chunk_id": "0021700908_013", "order": 13, "role": "body", "text": "The win could also help Cleveland position in the NBA draft. The Cavaliers own Brooklyn's No. 1 pick, acquired in a trade with Boston. The Nets have the seventh-worst record in the league, but have lost nine of 10."}
{"game_id": "0021700908", "chunk_id": "0021700908_014", "order": 14, "role": "body", "text": "Hill, also acquired at the trade deadline, scored a season-high 26 points and Cleveland placed six in double figures."}
{"game_id": "0021700908", "chunk_id": "0021700908_015", "order": 15, "role": "body", "text": "Russell led Brooklyn with 25 points. Caris LeVert scored 18 while DeMarre Carroll had 16. Brooklyn broke an eight-game losing streak Monday by beating Chicago."}
{"game_id": "0021700908", "chunk_id": "0021700908_017", "order": 17, "role": "body", "text": "James took a strong stance on the NCAA in light of the FBI's investigation into recruiting in college basketball."}
{"game_id": "0021700908", "chunk_id": "0021700908_018", "order": 18, "role": "body", "text": "\"The NCAA is corrupt, we know that,\" he said. \"Sorry, it's going to make headlines, but it's corrupt.\""}
{"game_id": "0021700908", "chunk_id": "0021700908_019", "order": 19, "role": "body", "text": "James was drafted by the Cavaliers out of high school in 2003. He laughed when asked about some of the offers he received in recruiting, but didn't give details."}
{"game_id": "0021700908", "chunk_id": "0021700908_020", "order": 20, "role": "body", "text": "\"Listen, man. I can't even talk about that,\" he said. \"Me and my mom was poor, I'll tell you that, and they expected me to step foot on a college campus and not to go to the NBA? We weren't going to be poor for long, I'll tell you that.\""}
{"game_id": "0021700908", "chunk_id": "0021700908_021", "order": 21, "role": "body", "text": "James would like to see the NBA expand the G-League into a farm system, an idea he wants to discuss with commissioner Adam Silver."}
{"game_id": "0021700908", "chunk_id": "0021700908_023", "order": 23, "role": "body", "text": "The game was tight throughout with nine ties and 25 lead changes."}
{"game_id": "0021700908", "chunk_id": "0021700908_024", "order": 24, "role": "body", "text": "\"Against an elite team like that, your margin of error is so small --  and one mistake could cost you the game,\" Nets coach Kenny Atkinson said. \"It's frustrating because we couldn't find a way to stop them. This was a tough one.\""}
{"game_id": "0021700908", "chunk_id": "0021700908_026", "order": 26, "role": "body", "text": "Cavaliers: F Jeff Green (sore lower back) missed his first game of the season. He played in the first 59 games, all off the bench. Green is averaging 10.6 points. ... Lakers G Isaiah Thomas said the Cavs were in \"panic mode\" when they traded him before the deadline. Asked for a reaction, Cleveland coach Tyronn Lue joked \"I'm panicking now.\""}
{"game_id": "0021700908", "chunk_id": "0021700908_027", "order": 27, "role": "body", "text": "Nets: LeVert (right knee) and Hollis-Jefferson (right groin) saw action for the second straight game after returning from injuries. . Brooklyn began a five-game, 10-day road trip that ends on March 8 in Charlotte."}
{"game_id": "0021700908", "chunk_id": "0021700908_029", "order": 29, "role": "body", "text": "Nets: Visit Sacramento on Thursday"}
{"game_id": "0021700908", "chunk_id": "0021700908_030", "order": 30, "role": "closing", "text": "Cavaliers: Host Philadelphia on Thursday."}
