{"game_id": "0021300812", "chunk_id": "0021300812_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- Kenneth Faried was called out for his timid play, dared to be more aggressive and take over games.\nThat challenge came not from his coaches or teammates, but from members of his family.\n\"My family came up to me and said, `Hey, do what you are paid to do and that is play basketball,\" Faried said. \"`Stop worrying about everybody else, stop being nervous, stop being timid and play your game.\"\nFaried's high-energy play has been the driving force behind his recent hot streak, including a 26-point performance to carry the Denver Nuggets past the Milwaukee Bucks 101-90 Thursday night.\nWilson Chandler scored 15 while J.J. Hickson added 14 points and 10 rebounds in a matchup of two teams left short-handed by deals they made before Thursday afternoon's trade deadline. But Faried made the difference for the Nuggets, who broke a five-game losing streak.\n\"It's good to feel what it's like to get a `W' again,\" Nuggets coach Brian Shaw said. \"It's been awhile for us.\"\nFaried, the No. 22 overall pick in the 2011 draft, has been impressive this February. Coming off a 21-point, 10-rebound performance against Phoenix, the forward also scored a career-high 28 against the Los Angeles Clippers earlier this month.\n\"My mother challenged me,\" Faried said. \"My father even stepped up and said, `Play your game and do what you do.\"\nFrom opponents, one word keeps coming up: motor, motor, motor.\n\"He has a 757 motor, man,\" Bucks guard O.J. Mayo said. \"He's not the tallest, but it comes down to energy and effort. He has one of those motors, man.\"\nAdded Bucks coach Larry Drew, \"If you don't match it, he'll gobble you up. And that's what happened tonight.\"\nCaron Butler scored 17 for the Bucks, who have not won two straight games all season. Ersan Ilyasova had 14 points and 11 rebounds.\n\"We just seemed like we never got into a rhythm,\" Drew said. \"I thought every time we seemed to try to put together a little bit of a push, we just never seemed to sustain a rhythm.\"\nWith Denver leading 78-67 going into the fourth quarter, Milwaukee got within five points on John Henson's dunk off an alley-oop from Giannis Antetokounmpo, plus a pair of jumpers by Caron Butler. But the Nuggets responded with a 12-2 run, including a powerful two-handed putback dunk by Faried, and put the game away.\n\"Motor,\" Bucks forward John Henson said of Faried. \"That's his game, that's how he gets his money. His motor.\"\nEarlier in the day, Denver sent disgruntled guard Andre Miller to Washington, getting back forward Jan Vesely from Washington in a three-team deal that also involved Philadelphia.\nMiller hasn't played since he got into a verbal altercation with Shaw earlier this year. Shaw said before the game that \"nobody wanted to have the situation come down to what it came to,\" and the deal would be better for both sides.\nThe Bucks sent guards Gary Neal and Luke Ridnour to Charlotte, getting guard Ramon Sessions and forward Jeff Adrien in return.\nLeft with remarkably short benches, the Nuggets used eight players in Thursday's game, and the Bucks used nine. Milwaukee played Antetokounmpo at point guard at times.\nMilwaukee even brought back O.J. Mayo, who had missed 10 games because of a combination of illness and conditioning issues. Mayo scored 11 points on 5-of-8 shooting in 23 minutes, but had an odd moment when he appeared to be caught tying his shoe on defense while the Nuggets had the ball in play.\n\"Sorry about that,\" Mayo said. \"Just trying to stay safe.\"\nOverall, Drew was pleased with the play of Mayo -- a player the Bucks will be counting on the rest of the season.\n\"I thought he did a really good job,\" Drew said. \"I saw some really good energy in him.\"\nGame notes\nShaw confirmed before the game that JaVale McGee had surgery. McGee sustained a stress fracture of his left tibia in November. . Bucks guard Brandon Knight was a game-time scratch because of a right heel laceration. . Shaw said before the game that he couldn't comment on a potential trade of forward Jordan Hamilton to Houston for guard Aaron Brooks."}
