{"game_id": "0021301173", "chunk_id": "0021301173_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- Oklahoma City has its starting five back together just in time for the playoffs. Their weeks apart didn't hurt their defense at all.\nRussell Westbrook scored 30 points in his return to the lineup, Kevin Durant added 27 and the Thunder held off the Los Angeles Clippers 107-101 on Wednesday night in a possible playoff preview.\nSerge Ibaka came up with a big block of J.J. Redick's 3-pointer with 10 seconds left and added 15 points for the Thunder, who had their starting lineup together for just the second time since Christmas Day."}
{"game_id": "0021301173", "chunk_id": "0021301173_002", "order": 2, "role": "closing", "text": "Westbrook had sat out two of the previous three games and has missed 34 games this season with a variety of injuries. He grabbed two key rebounds after Ibaka's block and made two free throws in the closing seconds.\n\"To win big games, you got to do the little things. We did all those things,\" Westbrook said. \"We're an older group. We've been together for some years. Once these guys get their legs under them, we're going to be in good shape.\"\nBlake Griffin had 30 points and 12 rebounds, and Chris Paul added 25 points and eight assists for the Clippers, who could have owned the tiebreaker over the Thunder if they had won. Instead, the teams split their season series 2-2.\n\"Every once in a while you want to win a game too bad, and you get in the way of yourselves,\" Clippers coach Doc Rivers said. \"I thought tonight we were in the way of ourselves a lot. That's fixable.\"\nLos Angeles rallied from a 15-point deficit in the fourth to twice get within a point, but the Clippers' only lead was by one point in the first quarter.\n\"We weathered the storm through our defense,\" Thunder coach Scott Brooks said. \"It's our identity. We've always been a defensive team that can score. Everybody chipped in and made big plays on both ends of the floor.\"\nThe Clippers' big run had them trailing 94-93, with Paul sandwiching 3-pointers around Griffin's free throw and DeAndre Jordan dunking off Darren Collison's miss to cap a 14-0 run with 5:03 to play. Jordan finished with 10 points and 12 rebounds.\nGriffin missed two free throws that would have tied the game at 97.\n\"We didn't play like us,\" Paul said. \"We've got to be able to not have so many runs, not have to fight back so much.\"\nWestbrook's putback dunk off Durant's miss kept the Thunder ahead 99-95. Durant's 3-pointer pushed their lead to 102-97 before Collison answered with a 3 to get the Clippers within two.\nMatt Barnes fouled Durant, who made both for a 104-100 lead. Paul missed the first and made the second free throw with 38 seconds left to keep the Clippers down by three.\n\"No matter who was on court, we communicated,\" Durant said. \"We closed up the paint. We simply played hard. We made championship plays, rebounded the ball.\"\nThe final 38 seconds were a free throw contest, with the Thunder making 3 of 4 to close out the win.\nThe Thunder are second in the West standings with four games remaining in the regular season; the Clippers are 2 1/2 games back in third with three to play. They could potentially meet in the second round of the playoffs.\n\"We have the talent, coaching staff and experience,\" Durant said. \"It's just a matter of us doing the small things.\"\nOklahoma City opened the third on a 14-4 run, with four players scoring in extending the lead to 73-58. Durant scored four in a row to push the Thunder's lead to 81-64.\nDefensively, the Thunder forced the Clippers into a mistake-prone, eight-minute stretch that included four turnovers -- two each by Griffin and Paul -- and a series of missed shots.\nLed by five points from Paul and three by Griffin, the Clippers ran off nine in a row to get within eight before Reggie Jackson's 3-pointer sent the Thunder into the fourth leading 85-73.\nThe Thunder led by 15 points when the Clippers' offense put together a 20-10 run to trail 59-54 at halftime. Jordan starred in his own highlight reel, dunking three times, twice off alley-oop passes. Griffin got in a slam of his own, and Hedo Turkoglu hit a 3-pointer that beat the shot clock and helped bring the Clippers back within single digits.\nGame notes\nThe Thunder improved to 8-6 in the second game of a back-to-back. They were playing their 14th such set this season. ... There's still no timetable for the return of Clippers F Danny Granger (strained left hamstring). Granger has missed six straight games. ... The Clippers are one win away from tying the franchise record of 56 wins in the regular season, set on the last day of the season a year ago. ... Rapper Drake and singer Rihanna, sitting separately, and former NBA guard Baron Davis attended the game."}
