{"game_id": "0021300917", "chunk_id": "0021300917_001", "order": 1, "role": "lead", "text": "CHICAGO -- From the tough defense to the rugged rebounding and passing big men, the Memphis Grizzlies and Chicago Bulls are practically mirror images.\nGive this one to Marc Gasol and the Grizzlies, who clamped down on Joakim Noah and the Bulls in the final minutes.\nGasol had 18 points and 10 rebounds, and Memphis used its stout defense to beat Chicago 85-77 Friday night.\n\"Our defense was pretty steady,\" Grizzlies coach Dave Joerger said. \"Thirty-nine in the first half, 38 in the second half. That was just solid for us. We kept them off the glass and they're a good offensive rebounding team. We contested shots and we pressured guys.\"\nMike Miller made four 3-pointers and finished with 14 points as the Grizzlies closed out a three-game road trip with their third victory in four games. Zach Randolph added 10 points and 11 rebounds after missing Wednesday's 103-94 loss at Brooklyn with the flu.\nTaj Gibson's rebound basket with 3:15 to go was Chicago's only score in the final 5:53 of the game. Mike Conley made two free throws to make it 83-77 with 2:14 remaining and Gasol closed out the scoring with a putback with 21.9 seconds left.\n\"At times it was tough to score on both ends of the court, but they got second-chance shots and hustle plays and that won the game for them, I think,\" Gibson said.\nGasol missed the Grizzlies' 95-91 loss to the Bulls in Memphis on Dec. 30 due to a sprained left knee. But the league's reigning Defensive Player of the Year made a difference in this one, blocking three shots and helping hold Noah and Carlos Boozer in check.\n\"I think especially in the second half we did a much better job of coming back and playing two sides of the floor and balancing when they swung the ball to the weak side, everybody moved,\" Gasol said.\nGibson had 18 points for Chicago, which had won 10 of 12. Playing with a sprained right thumb, Noah finished with 15 points, eight rebounds and six assists, but also had six of the Bulls' 13 turnovers.\nThe Bulls shot 41.3 percent (31 for 75), compared to 44.9 percent (35 for 78) for the Grizzlies. Gasol and Randolph also led Memphis to a 45-38 rebounding advantage.\n\"The rebounding was the name of the game,\" Chicago coach Tom Thibodeau said.\nMemphis (35-26) and Chicago (34-28) have used similar approaches to contend for the playoffs despite some injury issues.\nHeading into the weekend, the Bulls were the NBA's second-best defensive team at 92.3 points per game, followed by the Grizzlies at 95.2. Memphis was averaging 95.7 points, good for 25th in the 30-team NBA, with Chicago last in the league at 93.3 per game.\nThe Grizzlies and Bulls even had nearly identical records coming into the night. But due to the strength of their respective conferences, the Grizzlies were ninth in the West, one game out of a playoff spot, while the Bulls were fourth in the East.\nTrue to form, there were few open shots and the paint resembled a bumper-car ride for much of the night.\n\"We came in with the mindset understanding that that team was going to be physical,\" Memphis guard Tony Allen said. \"We knew that those guys were going to push, grab, scratch and claw.\n\"We kind have got a similar game to that team so we just had the intensity, that playing hard, playing together mentality.\"\nMemphis led 15-12 after one, holding Chicago to 22 percent shooting, but the Bulls started to heat up in the second quarter. D.J. Augustin scored 12 in the period and Noah had a late layup to help Chicago take a 39-35 advantage at the break.\nAugustin finished with 14 points, but Memphis' reserves outscored their counterparts 39-32. Kosta Koufos had 12 points and six rebounds for the Grizzlies.\nGame notes\nAsked at the morning shootaround about an ESPN.com report that he talked to New York Knicks star Carmelo Anthony during the All-Star break about coming to Chicago, Noah responded: \"You want me to address that? I don't feel like addressing it. I really have nothing to say about it.\" ... There was a pregame moment of silence for David Reinsdorf, the son of Bulls owner Jerry Reinsdorf who died Monday at age 51. The Bulls will wear a patch on their jerseys with David Reinsdorf's initials for the rest of the regular season. ... Conley finished with 12 points on 4-of-15 shooting. He also had seven assists and two steals."}
