{"game_id": "0021300228", "chunk_id": "0021300228_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  Al Jefferson joked that he feels he can score from anywhere on the court."}
{"game_id": "0021300228", "chunk_id": "0021300228_002", "order": 2, "role": "body", "text": "Bobcats coach Steve Clifford would prefer the man they call \"Big Al\" to set up shop close to the basket."}
{"game_id": "0021300228", "chunk_id": "0021300228_003", "order": 3, "role": "body", "text": "Jefferson, the franchise's highest-paid free agent acquisition ever, dug in deep in the low post Friday night and the Bobcats took advantage of the 6-foot-10, 289-pound center's strength and moves Friday night."}
{"game_id": "0021300228", "chunk_id": "0021300228_004", "order": 4, "role": "body", "text": "Jefferson posted season highs with 23 points and 12 rebounds, and the Bobcats handed the Milwaukee Bucks their 11th straight loss with a 92-76 victory."}
{"game_id": "0021300228", "chunk_id": "0021300228_005", "order": 5, "role": "body", "text": "\"We have to get him the ball deeper (in the paint) consistently if we're going to beat the best teams,\" Clifford said."}
{"game_id": "0021300228", "chunk_id": "0021300228_007", "order": 7, "role": "body", "text": "\"It helps the team and the offense when I do catch the ball a lot deeper because it makes it hard to double team and it helps with the spacing for other guys to get open,\" said Jefferson, who was 11 of 18 from the field. \"Coach has been showing me a lot of film of it. The film don't lie.\""}
{"game_id": "0021300228", "chunk_id": "0021300228_008", "order": 8, "role": "body", "text": "Jefferson took over in the fourth quarter in the paint, scoring 13 points with three \"and-one\" opportunities. He scored Charlotte's first 11 points of the quarter and put the game out of reach."}
{"game_id": "0021300228", "chunk_id": "0021300228_009", "order": 9, "role": "body", "text": "It's been an adjustment for the Bobcats learning how to play with a low post presence like Jefferson."}
{"game_id": "0021300228", "chunk_id": "0021300228_010", "order": 10, "role": "body", "text": "And it didn't help their chemistry that Jefferson missed most of the preseason and nine regular-season games with an ankle injury."}
{"game_id": "0021300228", "chunk_id": "0021300228_011", "order": 11, "role": "body", "text": "Jefferson said the ankle still isn't 100 percent, but it's getting better."}
{"game_id": "0021300228", "chunk_id": "0021300228_012", "order": 12, "role": "body", "text": "\"It's pain that I can tolerate,\" Jefferson said. \"As long as I'm not limping when I run. I still can't jump like I want to, but it's getting better and I have to play through it.\""}
{"game_id": "0021300228", "chunk_id": "0021300228_013", "order": 13, "role": "body", "text": "The dismal Bucks proved to be a perfect cure for the Bobcats' home woes. Charlotte had lost six of its past seven at home."}
{"game_id": "0021300228", "chunk_id": "0021300228_014", "order": 14, "role": "body", "text": "Gerald Henderson had another efficient game with 19 points on 7-of-13 shooting and Bismack Biyombo had a season-high 14 rebounds. The Bobcats outrebounded the Bucks 54-37 and outscored them 44-26 in the paint."}
{"game_id": "0021300228", "chunk_id": "0021300228_015", "order": 15, "role": "body", "text": "Brandon Knight scored 17 points for the Bucks (2-13), who have lost seven straight games on the road. O.J. Mayo came in averaging 15.3 points for Milwaukee but was held to 5 points on 2-of-11 shooting."}
{"game_id": "0021300228", "chunk_id": "0021300228_016", "order": 16, "role": "body", "text": "Charlotte built a 51-41 halftime lead after outscoring the Bucks 26-6 in the paint and shooting 58 percent from the field. Charlotte got some solid production early from its bench, which shot 10 of 12 from the field in the first half and scored 28 points."}
{"game_id": "0021300228", "chunk_id": "0021300228_017", "order": 17, "role": "body", "text": "\"Our bench play was probably as good as we've had all year,\" Clifford said."}
{"game_id": "0021300228", "chunk_id": "0021300228_018", "order": 18, "role": "body", "text": "Milwaukee got as close as six in the third quarter before the Bobcats went on an 11-1 tear to open a comfortable lead with Jefferson burying three short jump shots to push the lead back to a comfortable margin."}
{"game_id": "0021300228", "chunk_id": "0021300228_019", "order": 19, "role": "body", "text": "Biyombo had sat out two of Charlotte's last four games because of ineffectiveness, but made a difference in the lane."}
{"game_id": "0021300228", "chunk_id": "0021300228_020", "order": 20, "role": "body", "text": "\"He brought an intensity to the game,\" Clifford said. \"If he can learn how to do that every night then he puts himself in a different place. I say that to him about twice a week and he hates it when I say it, but that's what I believe. ... Play to his talents. He has to defend and rebound and that's what he can do well.\""}
{"game_id": "0021300228", "chunk_id": "0021300228_021", "order": 21, "role": "body", "text": "As if the Bucks didn't have enough problems, Caron Butler was a late scratch due to swelling in his knee and Ersan Ilyasova was limited in the second half because of a hamstring injury."}
{"game_id": "0021300228", "chunk_id": "0021300228_022", "order": 22, "role": "body", "text": "\"With no Caron and no Ersan, we were forced to go smaller,\" Bucks coach Larry Drew said. \"The big lineup didn't have much of an effect.\""}
{"game_id": "0021300228", "chunk_id": "0021300228_023", "order": 23, "role": "body", "text": "Drew said dealing with an 11-game losing streak isn't easy, but the Bucks need to keep playing through it and don't give up."}
{"game_id": "0021300228", "chunk_id": "0021300228_024", "order": 24, "role": "body", "text": "\"We've just got to be professional, we've got to be men and we've got to stand up,\" Drew said. \"This is the NBA, and this is life in the NBA. There's no time to feel sorry for ourselves. The only way we get out of this hole is if we make up our minds to go out there and get out of this hole.\""}
{"game_id": "0021300228", "chunk_id": "0021300228_025", "order": 25, "role": "closing", "text": "Game notes With Michael Kidd-Gilchrist out with plantar fasciitis in his right foot, Ben Gordon saw his first extensive playing time for Charlotte (8-9). ... Carolina Panthers coach Ron Rivera attended the game and sat a few seats down from Clifford. ... Bucks Larry Sanders, who is out with a thumb injury, was given a technical foul on the bench for arguing a call."}
