{"game_id": "0021700208", "chunk_id": "0021700208_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Darren Collison scored a season-high 30 points, and the Indiana Pacers almost let them go to waste."}
{"game_id": "0021700208", "chunk_id": "0021700208_002", "order": 2, "role": "body", "text": "After stretching their lead to 17 in the fourth quarter, the Pacers held on to beat the Memphis Grizzlies 116-113 on Wednesday night."}
{"game_id": "0021700208", "chunk_id": "0021700208_003", "order": 3, "role": "body", "text": "Indiana could breathe easy only after Marc Gasol's 3-point attempt with 3 seconds left bounced off. Memphis couldn't get off another shot from the ensuing scramble."}
{"game_id": "0021700208", "chunk_id": "0021700208_004", "order": 4, "role": "body", "text": "\"I think we've just got to do a better job of executing in the last five minutes if we want to be better,\" said Collison, who added eight assists. \"I don't know how much of it was them or more of us.\""}
{"game_id": "0021700208", "chunk_id": "0021700208_005", "order": 5, "role": "body", "text": "The Pacers seemed in control before Memphis ran off 10 straight points in the fourth. A 3-pointer from Bojan Bogdanovic stopped the string and ran the margin back to 10. From there Memphis chipped away, and a 3-point play from Gasol trimmed the Pacers' lead to 116-113 with 12.4 seconds left."}
{"game_id": "0021700208", "chunk_id": "0021700208_006", "order": 6, "role": "body", "text": "After that, there was drama but no scoring. An out-of-bounds call was reviewed and overturned, giving the Grizzlies the ball with 9.1 seconds left. Gasol, who led Memphis with 35 points and 13 rebounds, missed his 3-point attempt near the top of the key, and Memphis dropped its third straight."}
{"game_id": "0021700208", "chunk_id": "0021700208_007", "order": 7, "role": "body", "text": "\"I actually thought it was good,\" Collison said of Gasol's shot. \"I was preparing to go to overtime. He makes those shots, especially at the top of the key.\""}
{"game_id": "0021700208", "chunk_id": "0021700208_008", "order": 8, "role": "body", "text": "Victor Oladipo added 21 points for the Pacers, while Bogdanovic scored 16."}
{"game_id": "0021700208", "chunk_id": "0021700208_009", "order": 9, "role": "body", "text": "Memphis played without starting point guard Mike Conley, who has a sore left Achilles tendon. Despite shooting well at times, Memphis' offense seemed in disarray and committed fifteen turnovers."}
{"game_id": "0021700208", "chunk_id": "0021700208_010", "order": 10, "role": "body", "text": "Memphis coach David Fizdale said poor defense through three quarters put his team in a deep hole."}
{"game_id": "0021700208", "chunk_id": "0021700208_011", "order": 11, "role": "body", "text": "\"The first three quarters, I just had no answers because we just weren't locked in defensively for whatever reason,\" Fizdale said. \"Our defense is plummeting because of our lack of focus and lack of effort.\""}
{"game_id": "0021700208", "chunk_id": "0021700208_013", "order": 13, "role": "body", "text": "Pacers: Indiana's 67 first-half points were the most allowed in a half by Memphis this season."}
{"game_id": "0021700208", "chunk_id": "0021700208_014", "order": 14, "role": "body", "text": "Grizzlies: F JaMychal Green returned to action after missing 12 games for an ankle injury that occurred in the season opener. ... Memphis is winless in four games against the Eastern Conference this season. ... Reserve G Tyreke Evans finished with 18 points, snapping a string of six straight games scoring at least 20 off the bench."}
{"game_id": "0021700208", "chunk_id": "0021700208_016", "order": 16, "role": "body", "text": "Grizzlies forward Brandan Wright was headed to the rim for a dunk with about 43 seconds left, but Pacers center Myles Turner blocked the shot. Tyreke Evans got the ball but missed in close, and Turner grabbed the rebound."}
{"game_id": "0021700208", "chunk_id": "0021700208_017", "order": 17, "role": "body", "text": "\"That's a winning play,\" Indiana coach Nate McMillan said. \"That's what I'm talking about as far as defensively getting stops and making plays to give ourselves a chance to win.\""}
{"game_id": "0021700208", "chunk_id": "0021700208_019", "order": 19, "role": "body", "text": "Pacers: Host Detroit on Friday night."}
{"game_id": "0021700208", "chunk_id": "0021700208_020", "order": 20, "role": "body", "text": "Grizzlies: Host Houston on Saturday night -- the fourth and last time the two Southwest Division foes face each other in the regular season."}
{"game_id": "0021700208", "chunk_id": "0021700208_022", "order": 22, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
