{"game_id": "0021700501", "chunk_id": "0021700501_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  The Chicago Bulls have been a much better team since Nikola Mirotic got healthy."}
{"game_id": "0021700501", "chunk_id": "0021700501_003", "order": 3, "role": "body", "text": "The big forward came off the bench to score 24 points in 28 minutes as the resurgent Bulls won for the eighth time in 10 games, beating the Milwaukee Bucks 115-106 on Tuesday night."}
{"game_id": "0021700501", "chunk_id": "0021700501_004", "order": 4, "role": "body", "text": "Chicago's surge coincides with the return of Mirotic, who missed the beginning of the season after suffering facial fractures in an October fight with teammate Bobby Portis. Bulls coach Fred Hoiberg cited the return of Mirotic and guard David Nwaba for the team's recent success."}
{"game_id": "0021700501", "chunk_id": "0021700501_005", "order": 5, "role": "body", "text": "\"You look at our defense since Niko's come back and since David's come back and it's been a big difference for our team,\" Hoiberg said."}
{"game_id": "0021700501", "chunk_id": "0021700501_006", "order": 6, "role": "body", "text": "Giannis Antetokounmpo scored 28 points and Eric Bledsoe had 22 to pace the Bucks, but Antetokounmpo took only two shots and scored four points in the decisive fourth quarter."}
{"game_id": "0021700501", "chunk_id": "0021700501_007", "order": 7, "role": "body", "text": "\"You're not going to completely stop him but we were better in the fourth getting back in transition,\" Hoiberg said."}
{"game_id": "0021700501", "chunk_id": "0021700501_008", "order": 8, "role": "body", "text": "Kris Dunn rebounded from a 1-for-12 shooting game Saturday against Boston with 20 points and 12 assists in 33 minutes for the Bulls (11-22)."}
{"game_id": "0021700501", "chunk_id": "0021700501_009", "order": 9, "role": "body", "text": "\"Bad games happen to everybody,\" Dunn said. \"I'm not going to keep my head down. This team believes in me, the coaching staff believes in me, so I'll just keep playing my game and being aggressive.\""}
{"game_id": "0021700501", "chunk_id": "0021700501_010", "order": 10, "role": "body", "text": "Milwaukee coach Jason Kidd said expectations were \"a little bit too high\" for his team, which has lost five of seven."}
{"game_id": "0021700501", "chunk_id": "0021700501_011", "order": 11, "role": "body", "text": "\"At the end of the day, we're a young team,\" Kidd said. \"This is going to be a team that's going to go up and down.\""}
{"game_id": "0021700501", "chunk_id": "0021700501_012", "order": 12, "role": "body", "text": "Mirotic, averaging more than 18 points per game, led Chicago's bench in outscoring Milwaukee's reserves 54-25. It was the second time the Bulls won at Milwaukee in 12 days, including a 115-109 victory on Dec. 15."}
{"game_id": "0021700501", "chunk_id": "0021700501_013", "order": 13, "role": "body", "text": "Nwaba tipped in a rebound to cap an 8-2 run that gave the Bulls a 100-92 lead with 6:16 to go. The closest Milwaukee got the rest of the way was 109-104 with 1:11 left."}
{"game_id": "0021700501", "chunk_id": "0021700501_014", "order": 14, "role": "body", "text": "Chicago took the lead for good, 86-85, on a 3-pointer by Mirotic with 10:59 left."}
{"game_id": "0021700501", "chunk_id": "0021700501_015", "order": 15, "role": "body", "text": "\"That's what great players do -- they rise to the occasion,\" Bucks center John Henson said. \"He did that tonight.\""}
{"game_id": "0021700501", "chunk_id": "0021700501_017", "order": 17, "role": "body", "text": "Milwaukee allowed 11 offensive rebounds in the second half and was outrebounded 47-41 overall. \"That's just who we are; we can't rebound the ball,\" Kidd said. \"We just hope and pray that someone gets it. When that happens we're going to get killed, and we got killed again.\""}
{"game_id": "0021700501", "chunk_id": "0021700501_019", "order": 19, "role": "body", "text": "Dunn and Milwaukee's Khris Middleton got tangled up on the ground with 16 seconds to go. Both were assessed double technical fouls and ejected. \"I was protecting myself,\" Dunn said. \"We got tangled up and I'll leave it at that.\""}
{"game_id": "0021700501", "chunk_id": "0021700501_021", "order": 21, "role": "body", "text": "Kidd said the Bucks will take it day to day with Antetokounmpo's knee, saying he will \"just worry about today and then talk about tomorrow after the game.\" Antetokounmpo missed Milwaukee's 111-106 loss at Charlotte on Saturday."}
{"game_id": "0021700501", "chunk_id": "0021700501_023", "order": 23, "role": "body", "text": "Chicago G Zach LaVine (left ACL) was slated to practice with Windy City of the G League on Tuesday night. Hoiberg said LaVine, who sustained a minor back strain about a week ago, will practice with Chicago on Thursday and begin six straight days of practice with contact on Saturday. \"He's got a lot of hurdles to clear yet in the process, but it's going to be good to get him back with consecutive days of full-contact practice and we'll see how he responds,\" Hoiberg said."}
{"game_id": "0021700501", "chunk_id": "0021700501_025", "order": 25, "role": "body", "text": "Bulls: Rookie F Lauri Markkanen missed the Dec. 15 game in Milwaukee due to back spasms. He had three points and seven rebounds in 20 minutes Tuesday night."}
{"game_id": "0021700501", "chunk_id": "0021700501_026", "order": 26, "role": "body", "text": "Bucks: Antetokounmpo opened the game by making all five of his shots and a pair of free throws in the first 6:27, but picked up his second foul a minute later and went to the bench."}
{"game_id": "0021700501", "chunk_id": "0021700501_028", "order": 28, "role": "body", "text": "Bulls: Host the New York Knicks on Wednesday."}
{"game_id": "0021700501", "chunk_id": "0021700501_029", "order": 29, "role": "body", "text": "Bucks: Host the Minnesota Timberwolves on Thursday."}
{"game_id": "0021700501", "chunk_id": "0021700501_031", "order": 31, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
