{"game_id": "0021700112", "chunk_id": "0021700112_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Aaron Gordon wasn't the first option on the Orlando Magic's game-winning play, but he came through when he got the ball."}
{"game_id": "0021700112", "chunk_id": "0021700112_002", "order": 2, "role": "body", "text": "Gordon made a 3-pointer with 52 seconds left to erase Memphis' only lead of the fourth quarter as the Magic beat the Grizzlies 101-99 on Wednesday night."}
{"game_id": "0021700112", "chunk_id": "0021700112_003", "order": 3, "role": "body", "text": "The assist on the 23-footer that gave the Magic a 100-99 lead came from Evan Fournier, for whom the play initially was designed."}
{"game_id": "0021700112", "chunk_id": "0021700112_004", "order": 4, "role": "body", "text": "\"There was some sort of miscommunication on their part,\" Gordon said of the Grizzlies' defense that initially left him open under the basket. \"I saw Evan start to drive and I had to relocate. I got to the 3-point line and knocked it down.\""}
{"game_id": "0021700112", "chunk_id": "0021700112_005", "order": 5, "role": "body", "text": "Then Gordon had to endure watching Memphis rookie Dillon Brooks misfire on an open 3 with five seconds left."}
{"game_id": "0021700112", "chunk_id": "0021700112_006", "order": 6, "role": "body", "text": "\"I for sure thought that game was over. I thought they had won,\" Gordon said of Brooks' shot. \"You could pack it up. ... I for sure thought that ball was going to go straight to the rim, and that was going to be the end of the game.\""}
{"game_id": "0021700112", "chunk_id": "0021700112_007", "order": 7, "role": "body", "text": "Fournier led the Magic with 22 points, while Gordon finished with 19. Terrence Ross added 15 points to help Orlando win for the fifth time in six games."}
{"game_id": "0021700112", "chunk_id": "0021700112_008", "order": 8, "role": "body", "text": "Orlando held leads throughout the fourth quarter, by no more than five points after the first minutes of the period. But Memphis could only take the lead once -- at 99-97 -- on a floating bank shot by Marc Gasol with 1:04 left."}
{"game_id": "0021700112", "chunk_id": "0021700112_009", "order": 9, "role": "body", "text": "Gordon's game-winning 3 gave the Magic the lead back for good, although Orlando committed three of its 24 turnovers in the final 36.2 seconds."}
{"game_id": "0021700112", "chunk_id": "0021700112_010", "order": 10, "role": "body", "text": "\"We got very lucky down the stretch, but that's the game of basketball,\" Orlando coach Frank Vogel said."}
{"game_id": "0021700112", "chunk_id": "0021700112_011", "order": 11, "role": "body", "text": "Tyreke Evans led the Grizzlies with 32 points, while Gasol finished with 22 points and nine rebounds. James Ennis III scored 14 points for Memphis, which played without started point guard Mike Conley, who is nursing a sore left Achilles."}
{"game_id": "0021700112", "chunk_id": "0021700112_012", "order": 12, "role": "body", "text": "Despite taking the late lead and even having a chance to win, Memphis coach David Fizdale said his team deserved to lose for multiple reasons."}
{"game_id": "0021700112", "chunk_id": "0021700112_013", "order": 13, "role": "body", "text": "\"You cannot mess with the basketball gods. I deeply believe that,\" Fizdale said. \"Our huddles were a joke. Our communication was ridiculous. No one owned anything."}
{"game_id": "0021700112", "chunk_id": "0021700112_014", "order": 14, "role": "body", "text": "\"The most frustrating part about it was, that's a game we had in our grips.\""}
{"game_id": "0021700112", "chunk_id": "0021700112_016", "order": 16, "role": "body", "text": "Magic: Fournier connected on a 3-pointer in the first quarter and now has made a 3 in 33 straight games, third-longest active streak in the league. ... The Magic have made a 3-pointer in 828 consecutive games. ... G D.J. Augustin left late in the first half with a left hamstring strain and did not return. .Fournier has scored at least 20 points in seven of the Magic's eight games this season."}
{"game_id": "0021700112", "chunk_id": "0021700112_017", "order": 17, "role": "body", "text": "Grizzlies: Evans' 32 points, was his first 30-point performance since scoring 34 points against Golden State on December 14, 2014. ... Mario Chalmers started in Conley's spot, his first start of the season. ... Gasol, as he was in Monday's game against Charlotte, was listed as questionable with a left ankle problem, but played."}
{"game_id": "0021700112", "chunk_id": "0021700112_019", "order": 19, "role": "body", "text": "The win snapped Orlando's nine-game losing streak in Memphis. The Magic had not won on the Grizzlies' home floor since Jan. 23, 2008. Orlando is 3-14 in road games against the Grizzlies since the team moved from Vancouver."}
{"game_id": "0021700112", "chunk_id": "0021700112_021", "order": 21, "role": "body", "text": "An explanation may have emerged for Mike Conley's recent erratic play. The point guard is nursing a sore left Achilles. Conley has made only 13 of 51 shots over the previous three games, including 2 of 18 from outside the arc. \"He was trying to play through a lot of pain in that same area,\" Fizdale said. \"I just felt like, it's early in the season, and there's no need to push something like that.\""}
{"game_id": "0021700112", "chunk_id": "0021700112_023", "order": 23, "role": "body", "text": "MAGIC: Return home after a three-game road trip to face the Chicago Bulls on Friday."}
{"game_id": "0021700112", "chunk_id": "0021700112_024", "order": 24, "role": "body", "text": "GRIZZLIES: Begin a five-game road trip Saturday in Los Angeles before facing the Lakers on Sunday."}
{"game_id": "0021700112", "chunk_id": "0021700112_026", "order": 26, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
