{"game_id": "0021400438", "chunk_id": "0021400438_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- Thunder coach Scott Brooks was worried his team would be tired after a tough win in San Antonio a night earlier.\nNot a problem.\nRussell Westbrook scored 29 points to lead Oklahoma City to a 98-75 victory over Charlotte on Friday night, snapping the Hornets' season-high four-game win streak.\n\"We talk about playing a defensive brand every night and in back-to-back games to come back with a defensive effort for 48 minutes,\" Brooks said. \"I'm really proud of our effort. I thought that set the tone. We locked in defensively and throughout the game it was solid.\"\nCharlotte scored the game's first basket then the Thunder reeled off nine straight points to take a lead they never relinquished in winning for the second straight day.\nWestbrook scored 13 points in the first quarter, and Oklahoma City opened a 59-40 halftime lead. Serge Ibaka added 13 points, 14 rebounds and blocked four shots for the Thunder. Neither player saw action in the final period.\n\"It was good that we didn't come out flat and came out with some energy,\" Westbrook said. \"We were hungry.\"\nBrian Roberts came off the bench to lead the Hornets with 17 points, 11 in the final period.\nAl Jefferson, averaging 19.1 per game, didn't get his first basket until there were four minutes left in the first half and finished with just four points.\nThe Thunder played their fifth straight game without MVP Kevin Durant, who has a sprained ankle.\nWestbrook, coming off of a 34-point effort in Thursday's win at San Antonio, started the game shooting 7 of 9. He finished with his 11th straight game of 25 points or more.\nJefferson and Kemba Walker combined to shoot just 4 of 20 from the field. Walker had just six points.\n\"They're so good defensively, in the first quarter we just had a tough time making shots and everything was contested,\" said Hornets coach Steve Clifford. \"They are just so long and so big. That's why their defense has been good all year.\"\nTIP-INS\nHornets: Charlotte's season-best streak of five consecutive 100-point games ended. The Hornets shot 25 for 87 (28.7 percent) and hit just 5-of-24 three-pointers.\nThunder: Durant participated in morning shoot around and coach Scott Brooks declared during pregame that he looked good and could return soon, but no timetable has been set. ... Durant holds the league record with 41 straight games of 25 points or more.\nUP NEXT\nHornets: Host Orlando on Saturday.\nThunder: At Dallas on Sunday.\nDO OVER\nCharlotte is averaging the fewest turnovers per game in the league (11.0). They committed 15 against Oklahoma City.\nNOT BASHFUL\nThunder rookie Grant Jerrett played in just his second career NBA game and managed to get up five 3-point shots in less than eight minutes. He missed all five. Jerrett is 1 of 10 in his career and all of the shots have been 3s."}
