{"game_id": "0021400954", "chunk_id": "0021400954_001", "order": 1, "role": "lead", "text": "BOSTON --  The Boston Celtics endured a bruising inside and returned it when it mattered most."}
{"game_id": "0021400954", "chunk_id": "0021400954_002", "order": 2, "role": "body", "text": "Marcus Smart converted a go-ahead, three-point play with 52 seconds left, Avery Bradley added a clutch jumper with eight seconds remaining and the Celtics beat the Memphis Grizzlies 95-92 on Wednesday night."}
{"game_id": "0021400954", "chunk_id": "0021400954_003", "order": 3, "role": "body", "text": "The Grizzlies outscored the Celtics 50-36 in the paint and finished with a 41-36 rebounding advantage, but couldn't finish off Boston in a back-and-forth fourth quarter that came down to the final possessions."}
{"game_id": "0021400954", "chunk_id": "0021400954_004", "order": 4, "role": "body", "text": "\"If we lose the game tonight by outside shots, we tip our hat to them. That's not what they do. They want to bruise you up inside and get offensive rebounds and putbacks,\" said Jae Crowder, who hit a pair of 3-pointers in the fourth quarter and finished with 16 points."}
{"game_id": "0021400954", "chunk_id": "0021400954_005", "order": 5, "role": "body", "text": "Bradley scored 17 points for the Celtics, who won their second in a row as they chase a playoff spot in the Eastern Conference."}
{"game_id": "0021400954", "chunk_id": "0021400954_006", "order": 6, "role": "body", "text": "Bradley, one of the longest-tenured players on a roster that's been full of changes, said the Celtics are in contention because of coach Brad Stevens."}
{"game_id": "0021400954", "chunk_id": "0021400954_007", "order": 7, "role": "body", "text": "\"It shows that we're making strides and we're continuing to be a better team,\" Bradley said. \"Brad is getting us all together, having us believe in one another. We're like a family out here. We're a lot closer than we were and it shows on the court.\""}
{"game_id": "0021400954", "chunk_id": "0021400954_008", "order": 8, "role": "body", "text": "Smart put Boston ahead 91-90 with the last of 14 lead changes in the game, which ended when Mike Conley missed a deep 3-pointer for Memphis just before the buzzer."}
{"game_id": "0021400954", "chunk_id": "0021400954_009", "order": 9, "role": "body", "text": "Conley led Memphis with 20 points despite missing time in the second half with a twisted ankle. Tony Allen added 16 and Zach Randolph scored 14, pulled down eight rebounds and added five assists."}
{"game_id": "0021400954", "chunk_id": "0021400954_010", "order": 10, "role": "body", "text": "\"Man, they don't quit,\" Conley said. \"They're a team that fights. They're going to play through every possession.\""}
{"game_id": "0021400954", "chunk_id": "0021400954_011", "order": 11, "role": "body", "text": "Kelly Olynyk scored 12 of his 15 points in the second half. Tyler Zeller and Brandon Bass had 12 points apiece. Zeller also led Boston with nine turnovers but hit a pair of foul shots with 40 seconds left to put Boston up 93-90."}
{"game_id": "0021400954", "chunk_id": "0021400954_012", "order": 12, "role": "body", "text": "The Grizzlies made all of their 13 foul shots but could not overcome 21 turnovers."}
{"game_id": "0021400954", "chunk_id": "0021400954_013", "order": 13, "role": "body", "text": "Olynyk scored nine in the third period, including an 18-foot jumper at the buzzer that gave the Celtics a 64-63 lead."}
{"game_id": "0021400954", "chunk_id": "0021400954_014", "order": 14, "role": "body", "text": "Conley's 3-pointer with 5:18 left gave Memphis an 80-78 lead, which the teams traded throughout the fourth until coming down to the last possessions."}
{"game_id": "0021400954", "chunk_id": "0021400954_015", "order": 15, "role": "body", "text": "After Crowder's 3-pointer for Boston tied it at 88-all, Randolph hit a layup to restore the Grizzlies' lead at 90-88. Boston went back up when Evan Turner threw a long inbound pass for an alley-oop layup by Smart, who was fouled and converted the three-point play to give Boston a 91-90 lead with 52 seconds left."}
{"game_id": "0021400954", "chunk_id": "0021400954_018", "order": 18, "role": "body", "text": "Grizzlies: Conley had 12 points at halftime and was the only player to score in double figures in the first half for the Grizzlies. ... F Jeff Green was playing his first game in Boston since joining the Grizzlies in a three-team deal involving the Celtics, Grizzlies and Pelicans."}
{"game_id": "0021400954", "chunk_id": "0021400954_019", "order": 19, "role": "body", "text": "Celtics: Phil Pressey hit a buzzer-beater from about 10 feet beyond the 3-point line to give Boston a 23-18 lead after the first period. ... G Isaiah Thomas sat out with a bruised lower back. Stevens said Thomas is likely out for the weekend and hopes to have him back Monday when Philadelphia visits."}
{"game_id": "0021400954", "chunk_id": "0021400954_021", "order": 21, "role": "body", "text": "The Grizzlies are still No. 2 in the Western Conference standings and lead the Southwest Division despite falling to 1-2 on a four-game road trip, which concludes Thursday at Washington."}
{"game_id": "0021400954", "chunk_id": "0021400954_022", "order": 22, "role": "body", "text": "\"We came out and we walked around,\" coach David Joerger said. \"We were casual and it happens over and over and over, and we haven't learned our lesson.\""}
{"game_id": "0021400954", "chunk_id": "0021400954_024", "order": 24, "role": "body", "text": "Conley said he left in the second half because of a twisted right ankle, which has had problems since last season. He still managed score eight in the fourth quarter."}
{"game_id": "0021400954", "chunk_id": "0021400954_025", "order": 25, "role": "body", "text": "\"Anything on the right side is, you know, it hurts double. That was tough, but we went back there and did some treatment, took some medicine, was able to dull the pain a little bit,\" he said."}
{"game_id": "0021400954", "chunk_id": "0021400954_028", "order": 28, "role": "body", "text": "Grizzlies: At Washington on Thursday."}
{"game_id": "0021400954", "chunk_id": "0021400954_029", "order": 29, "role": "closing", "text": "Celtics: Host Orlando on Friday."}
