{"game_id": "0021700119", "chunk_id": "0021700119_001", "order": 1, "role": "lead", "text": "DETROIT --  The best ovation yet for the Detroit Pistons at Little Caesars Arena came as a result of Andre Drummond's free throw shooting."}
{"game_id": "0021700119", "chunk_id": "0021700119_002", "order": 2, "role": "body", "text": "Surprising, yes, but coach Stan Van Gundy didn't view Drummond's performance as a fluke."}
{"game_id": "0021700119", "chunk_id": "0021700119_003", "order": 3, "role": "body", "text": "\"Obviously, their idea was, `We'll just let him catch the ball, and then we'll hammer him,\" Van Gundy said. \"I don't think that strategy's going to work this year.\""}
{"game_id": "0021700119", "chunk_id": "0021700119_004", "order": 4, "role": "body", "text": "Drummond scored 24 points, going 14 of 16 at the free throw line, and the Pistons took over sole possession of first place in the Central Division with a 105-96 win over the Milwaukee Bucks on Friday night. Drummond scored 14 during a third quarter in which he made 10 of 12 foul shots, quite a showing for a player who is under 40 percent from the line in his career."}
{"game_id": "0021700119", "chunk_id": "0021700119_005", "order": 5, "role": "body", "text": "It was the most free throws Drummond has made in a game in his career, and he's shooting 78 percent (28 of 36) from the line this season."}
{"game_id": "0021700119", "chunk_id": "0021700119_006", "order": 6, "role": "body", "text": "\"It's just a mental toughness thing,\" Drummond said. \"Being ready all the time to shoot the same shot.\""}
{"game_id": "0021700119", "chunk_id": "0021700119_007", "order": 7, "role": "body", "text": "Avery Bradley scored 19 of his 23 points in the first half for the Pistons, who went on a 21-5 run late in the second quarter and led 59-48 at halftime. The lead was 17 early in the third, and Drummond helped hold off the Bucks for the rest of that period."}
{"game_id": "0021700119", "chunk_id": "0021700119_008", "order": 8, "role": "body", "text": "\"Obviously, he really helps the Pistons when he's making free throws,\" Bucks coach Jason Kidd said. \"He's worked hard on it and he's done a nice job of improving that part of his game. He can keep a run going from the line or he can stop an opponent's run, and that's a huge factor given everything else he can do.\""}
{"game_id": "0021700119", "chunk_id": "0021700119_009", "order": 9, "role": "body", "text": "Detroit went on a 9-1 spurt to start the fourth and led 91-73."}
{"game_id": "0021700119", "chunk_id": "0021700119_010", "order": 10, "role": "body", "text": "Giannis Antetokounmpo scored 29 points for Milwaukee."}
{"game_id": "0021700119", "chunk_id": "0021700119_011", "order": 11, "role": "body", "text": "\"I thought we defended him really well, and then I get the boxscore: 29 points ... four blocked shots,\" Van Gundy said. \"I mean, the guy's just a great, great player.\""}
{"game_id": "0021700119", "chunk_id": "0021700119_012", "order": 12, "role": "body", "text": "There have been a surprising number of empty seats in the first season for the Pistons at Little Caesars Arena, and that was the case again Friday. But there were enough fans to create a lively atmosphere, especially as Drummond made free throw after free throw in the third."}
{"game_id": "0021700119", "chunk_id": "0021700119_013", "order": 13, "role": "body", "text": "In the final seconds of the period, he stole the ball near midcourt and dribbled all the way to the basket before drawing a foul. He waved his hand to ask for more noise, and the crowd obliged."}
{"game_id": "0021700119", "chunk_id": "0021700119_015", "order": 15, "role": "body", "text": "Detroit, which entered the game tied with Indiana for first place in the Central Division, has won four of five. This was the first game back home for the Pistons after a road trip that included a win at Golden State , and they moved a game ahead of the Pacers."}
{"game_id": "0021700119", "chunk_id": "0021700119_017", "order": 17, "role": "body", "text": "Detroit's bench outscored Milwaukee's 28-14. Only two subs scored for the Bucks, and Kidd said afterward that the starters can't play 48 minutes."}
{"game_id": "0021700119", "chunk_id": "0021700119_018", "order": 18, "role": "body", "text": "\"We have to get better off the bench, but everyone has to start playing better defense,\" backup guard Jason Terry said. \"We have a few days off coming up, and that's important, because we've lost our defensive principles. We'll start hitting those shots, but you can't win if you don't play defense.\""}
{"game_id": "0021700119", "chunk_id": "0021700119_020", "order": 20, "role": "body", "text": "Bucks: Khris Middleton, coming off a 43-point performance Wednesday against Charlotte , scored 16. ... Milwaukee was without Greg Monroe, sidelined because of a left calf strain."}
{"game_id": "0021700119", "chunk_id": "0021700119_021", "order": 21, "role": "body", "text": "Pistons: Detroit played without Jon Leuer due to a left ankle sprain."}
{"game_id": "0021700119", "chunk_id": "0021700119_023", "order": 23, "role": "body", "text": "Bucks: At Cleveland on Tuesday night."}
{"game_id": "0021700119", "chunk_id": "0021700119_024", "order": 24, "role": "body", "text": "Pistons: Host Sacramento on Saturday night."}
{"game_id": "0021700119", "chunk_id": "0021700119_026", "order": 26, "role": "body", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
{"game_id": "0021700119", "chunk_id": "0021700119_028", "order": 28, "role": "closing", "text": "Follow Noah Trister at www.Twitter.com/noahtrister"}
