{"game_id": "0021400013", "chunk_id": "0021400013_001", "order": 1, "role": "lead", "text": "PHOENIX -- The shots were falling from all over the court for the Phoenix Suns in their home opener Wednesday night.\nKobe Bryant was a one-man show for the Los Angeles Lakers.\nThe result was a 119-99 Suns blowout.\nIsaiah Thomas scored 23 points in his Phoenix debut, Marcus Morris matched his career high with five 3-pointers and the Suns dominated the night despite Bryant's 31 points.\nGoran Dragic scored 12 of his 18 points in the third quarter, when the Suns outscored the Lakers 39-24 and led by as many as 29.\nPhoenix's Eric Bledsoe had 16 points and nine assists before he drew his second technical foul and was ejected with 30 seconds left in the third quarter.\nThe Lakers were blown out for the second night in a row, dropping their opener at home to Houston 108-90 on Tuesday night, losing first-round draft pick Julius Randle for the season with a broken leg in the process.\n\"I told them we have to hang in there and stay together as a team,\" Lakers coach Byron Scott said. \"It is only two games.\"\nMarcus Morris scored 21 points. Twin brother Markieff added 12.\nThe high-energy Suns, who won a surprising 48 games last season but failed to make the playoffs in the tough Western Conference, made 16 3-pointers, one more than their high of last season.\n\"That's what coach wants us to do,\" Thomas said, \"play to our strengths, attack, be aggressive, score as early as possible and shoot a lot of 3s.\"\nBryant, 11 of 25 from the field, didn't play in the fourth quarter.\n\"I told you guys from the beginning I am back to myself,\" said Bryant, who missed nearly all of last season with a knee injury. \"I feel completely fine.\"\nEd Davis scored 14 points and Wayne Ellington 13 for Los Angeles.\n\"Kobe, he can score 30 points, but he took a lot of shots,\" Dragic said. \"I think the percentage was not so good. That's what we wanted to do.\"\nThe Lakers trailed only 61-55 after Jordan Hill's two free throws with 11:15 left in the third quarter. But Dragic led the Suns on a 34-11 outburst and Phoenix was up 95-66 after Marcus Morris' 3-pointer with 2:22 left in the period.\nBledsoe's second technical came after Bledsoe collided with Bryant going for a rebound. Bledsoe was bleeding from the face when he left the court.\n\"You know Eric and Goran, these guys deserve some respect from the calls,\" Hornacek said. \"When these guys are getting s lapped in the face and they're not calling it, then I don't mind a guy getting upset like that.\"\nThe Suns shot out to an 18-point first-quarter lead but the Lakers, with Bryant on the bench, used a 13-1 run to get back in it.\nTIP-INS\nLakers: Ellington was back after missing the opener with a concussion.... Forward Ryan Kelly missed his second game with a sore right hamstring.\nSuns: Marcus Morris was starting in place of forward P.J. Tucker, who is serving a three-game suspension that resulted from his offseason DUI arrest. ... First-round draft pick Tyler Ennis, the Suns' fourth point guard, played the final quarter.\nRANDLE AFTERMATH\nIn the aftermath of Randle's injury, Scott said before the game that the team was \"a little bit shocked by it, disappointed, hurt, all those things are probably going through our minds.\"\n\"I know I didn't get a lot of sleep just thinking about the young fella,\" Scott said.\nKEY STATS\nThe Suns improved to 17-0 when Dragic and Bledsoe each score at least 16 points. ... Bryant has a technical foul in each of the Lakers' games. ... The Lakers' Carlos Boozer had eight turnovers.\nUP NEXT\nLakers: Host the Los Angeles Clippers on Friday night.\nSuns: Host the reigning NBA champion San Antonio Spurs on Friday night."}
