{"game_id": "0021400277", "chunk_id": "0021400277_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- Now healthy, the Oklahoma City Thunder have some ground to make up, and they got going against the hapless 76ers.\nRussell Westbrook had 27 points to lead the Thunder to a 103-91 victory over Philadelphia on Friday night.\nIt was the first win for the Thunder (6-13) with stars Kevin Durant and Westbrook healthy and back in the lineup together.\n\"It's a good time of the year for us,\" Westbrook said. \"I think it's important that we stick together, take one day at a time and find a way to get wins.\"\nDurant, the NBA's reigning MVP, had 10 points while playing in his second game since missing the first 17 because of a fractured right foot.\n\"We've just got to take it a day at a time and keep getting better,\" Durant said. \"We're doing a decent job. We've just got to keep putting it together, keep grinding away.\"\nAfter scoring 27 points on 9-for-18 shooting in his return to the court in Tuesday's 112-104 loss at New Orleans, Durant was in jeopardy of failing to reach double-figures in scoring for the first time since 2009 before making a layup with 2:41 remaining.\n\"He's not going to have 30 points every night,\" Thunder coach Scott Brooks said. \"What you see now is a player who hasn't played in six or seven weeks. He's going to continue to improve and the rhythm is going to come back around.\"\nDurant is trying to get comfortable after missing so much time.\n\"I'm just trying to adjust,\" he said. \"Certain things I'm not used to. I'm just trying to adjust, be aggressive, play my game -- attack at certain times but also play off my teammates and get them involved as well.\"\nWestbrook, playing in his third game after returning from a broken hand, made 8 of 14 shots. He was involved in a sometimes heated verbal battle with Philadelphia second-year point guard Michael Carter-Williams.\n\"Young dudes in this league tend to bark a lot,\" Durant said. \"I think he put him in his place and let him know who the best point guard in the league is.\"\nSerge Ibaka scored 19 points and Jeremy Lamb added 15 for the Thunder, who won their 11th straight against Philadelphia.\nRobert Covington had 21 points and Carter-Williams contributed 16 points and 14 assists for the 76ers, who were playing their first game since ending a 17-game losing streak to start the season.\nPhiladelphia coach Brett Brown wasn't discouraged by yet another defeat.\n\"They know they're going to continue to get better and we're going to sneak up on some people,\" he said. \"It's the same old, same old. We're just going to bang out great days and they will add up.\"\nThe Thunder broke the game open with a 13-3 run to start the second half, capped by Ibaka's 3-pointer that made it 70-50 with 8:17 left in the third quarter. Ibaka rebounded from scoring a season-low six points on Tuesday.\nPhiladelphia got as close as 93-86 on Luc Mbah a Moute's layup with 3:12 left, but the Thunder scored eight straight to go in front 101-86 with 1:37 left.\nTIP-INS\nThunder: Oklahoma City improved to 2-8 on the road. The other win was a 109-84 victory at Boston on Nov. 12. ... Durant last scored under 10 points on Feb. 27, 2009, when he had six in a 110-108 loss at Dallas.\n76ers: Tony Wroten, who leads Philadelphia in scoring (17.9 ppg), missed his fourth straight game with a right knee injury. ... Alexey Shved (hip) was out for the second consecutive game. ... Philadelphia signed G Malcolm Lee from the Delaware 87ers, its D-League affiliate and waived Drew Gordon.\nUP NEXT\nThe Thunder play at Detroit on Sunday.\nPhiladelphia plays at Detroit Saturday.\nWILT STAMP\nThe 76ers held a ceremony to dedicate a stamp depicting Hall of Famer Wilt Chamberlain during halftime.\nThe Wilt Chamberlain Limited Edition Forever stamps, featuring the `'Big Dipper\" in action with the Philadelphia Warriors and Los Angeles Lakers, became available on Friday morning. Chamberlain is the first NBA player to appear on a U.S. postage stamp.\nHis stamps are just over two inches tall, or a third to twice the size of a typical commemorative stamp, according to the United States Postal Service. The word `'Wilt\" is on the corner of each stamp.\nWESTBROOK VS. MCW\nCarter-Williams said the verbal sparring with Westbrook is just part of the game.\n\"It gets competitive with chit-chat back and forth,\" he said. \"It's part of the game. I have nothing against him. It just gets intense. There's pride involved. After the game, it's all good. During the game, it is what it is. It's part of the game, it's fun and I enjoy it.\""}
