{"game_id": "0021700958", "chunk_id": "0021700958_001", "order": 1, "role": "lead", "text": "TORONTO --  For three quarters, the Toronto Raptors looked listless against the Atlanta Hawks."}
{"game_id": "0021700958", "chunk_id": "0021700958_002", "order": 2, "role": "body", "text": "Finally, in the fourth, the Raptors turned in an effort worthy of the top team in the Eastern Conference."}
{"game_id": "0021700958", "chunk_id": "0021700958_003", "order": 3, "role": "body", "text": "DeMar DeRozan scored 25 points, Jonas Valanciunas had 15 and the Raptors used a big fourth quarter to beat the Hawks 106-90 on Tuesday night, their fifth straight win."}
{"game_id": "0021700958", "chunk_id": "0021700958_004", "order": 4, "role": "body", "text": "C.J. Miles scored eight of his 14 points in the final quarter, and Delon Wright and Serge Ibaka each finished with 10 as the East leaders won for the 12th time in 13 games and completed their first season sweep of the Hawks since 2001-02."}
{"game_id": "0021700958", "chunk_id": "0021700958_005", "order": 5, "role": "body", "text": "Trailing 77-76 through three, Toronto outscored Atlanta 30-13 in the fourth. The Hawks shot 6 for 18 in the quarter and committed eight turnovers."}
{"game_id": "0021700958", "chunk_id": "0021700958_006", "order": 6, "role": "body", "text": "\"If you don't play, hustle is going to beat talent,\" Raptors coach Dwane Casey said. \"It shouldn't take us three quarters to figure that out.\""}
{"game_id": "0021700958", "chunk_id": "0021700958_007", "order": 7, "role": "body", "text": "DeRozan said the Raptors stepped up their aggressiveness in the final frame."}
{"game_id": "0021700958", "chunk_id": "0021700958_008", "order": 8, "role": "body", "text": "\"Whenever we get a chance to get stops and just get out and play, we're at our best,\" DeRozan said. \"It took until the fourth quarter for us to bring that out.\""}
{"game_id": "0021700958", "chunk_id": "0021700958_009", "order": 9, "role": "body", "text": "The Raptors are 27-5 at home, the best record in the NBA. Toronto improved to 4-16 when behind after three."}
{"game_id": "0021700958", "chunk_id": "0021700958_010", "order": 10, "role": "body", "text": "\"For three quarters it was some of the most competitive, best basketball we've played on both ends,\" Hawks coach Mike Budenholzer said. \"We just kind of hit a wall in the fourth.\""}
{"game_id": "0021700958", "chunk_id": "0021700958_011", "order": 11, "role": "body", "text": "Kent Bazemore and John Collins each scored 15 points and Dewayne Dedmon had 12 points and 10 rebounds, but the Hawks lost for the sixth time in eight games."}
{"game_id": "0021700958", "chunk_id": "0021700958_012", "order": 12, "role": "body", "text": "\"The fourth quarter was kind of tough,\" guard Dennis Schroder said. \"They made shots and got a couple of stops.\""}
{"game_id": "0021700958", "chunk_id": "0021700958_014", "order": 14, "role": "body", "text": "The Hawks trailed 88-85 after a basket by Collins with 6:43 remaining, but Wright sandwiched baskets around a long 3-pointer by Miles as the Raptors took a 95-85 lead with 4:15 to go. After an Atlanta timeout, Toronto's Jakob Poeltl scored back-to-back baskets to put the Raptors up 99-85."}
{"game_id": "0021700958", "chunk_id": "0021700958_015", "order": 15, "role": "body", "text": "\"Second half he really played,\" Casey said of Poeltl."}
{"game_id": "0021700958", "chunk_id": "0021700958_017", "order": 17, "role": "body", "text": "Hawks: Bazemore returned to the starting lineup after sitting out Sunday's win over Phoenix. ... The Hawks made 22 turnovers, leading to 25 points for Toronto. Atlanta's season high in turnovers is 24, set in a Nov. 11 loss at Washington."}
{"game_id": "0021700958", "chunk_id": "0021700958_018", "order": 18, "role": "body", "text": "Raptors: F OG Anunoby (sprained right ankle) missed his third straight game, with Malcolm Miller making his second start in Anunoby's place. ... Toronto signed F Nigel Hayes to a 10-day contract. Hayes averaged 16.1 points and 6.6 rebounds in 38 games with Westchester in the G League. ... DeRozan shot 12 for 14 at the free throw line."}
{"game_id": "0021700958", "chunk_id": "0021700958_020", "order": 20, "role": "body", "text": "DeRozan, who recently opened up about his struggles with depression, said he was touched by an admission from Kevin Love in a piece on The Players' Tribune that the Cavaliers star had a panic attack during a game."}
{"game_id": "0021700958", "chunk_id": "0021700958_021", "order": 21, "role": "body", "text": "\"It made me feel great,\" DeRozan said. \"That was my whole intent of me speaking out. I understand it's hard to step up and do a thing like that.\""}
{"game_id": "0021700958", "chunk_id": "0021700958_023", "order": 23, "role": "body", "text": "Kyle Lowry and DeRozan each picked up technical fouls in the final 35 seconds of the first half, with Lowry penalized for his angry outburst after being called for a foul on Atlanta's Mike Muscala. Lowry was later called for a flagrant foul in the third."}
{"game_id": "0021700958", "chunk_id": "0021700958_025", "order": 25, "role": "body", "text": "Toronto has swept its season series with nine opponents. The Raptors are 4-0 against Atlanta, Charlotte and Chicago, and 2-0 against the Lakers, Memphis, New Orleans, Phoenix, Portland, and Sacramento."}
{"game_id": "0021700958", "chunk_id": "0021700958_027", "order": 27, "role": "body", "text": "Hawks: Visit Indiana on Friday."}
{"game_id": "0021700958", "chunk_id": "0021700958_028", "order": 28, "role": "body", "text": "Raptors: Visit Detroit on Wednesday. Toronto has won four straight meetings."}
{"game_id": "0021700958", "chunk_id": "0021700958_030", "order": 30, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
