{"game_id": "0021700909", "chunk_id": "0021700909_001", "order": 1, "role": "lead", "text": "MIAMI --  This was vintage Dwyane Wade, and he knew exactly what he was doing."}
{"game_id": "0021700909", "chunk_id": "0021700909_002", "order": 2, "role": "body", "text": "He intentionally fouled Ben Simmons in the final seconds of a tie game, usually an absolute no-no. He didn't give the ball up on the ensuing possession with his team down by one, choosing instead to decide the outcome himself."}
{"game_id": "0021700909", "chunk_id": "0021700909_005", "order": 5, "role": "body", "text": "Wade scored 15 of Miami's final 17 points, finished with a season-high 27 and his jumper with 5.9 seconds remaining lifted the Heat to a 102-101 victory over the Philadelphia 76ers on Tuesday night. And yes, he punctuated the gamewinner with the \"this is my house\" signal and yell to the crowd, as if there was any doubt that he somehow lost the deed to the building during his stints in Chicago and Cleveland."}
{"game_id": "0021700909", "chunk_id": "0021700909_006", "order": 6, "role": "body", "text": "\"There's something about Dwyane Wade when you put that Miami Heat jersey on and play in front of these fans,\" Heat coach Erik Spoelstra said. \"He becomes somebody very special.\""}
{"game_id": "0021700909", "chunk_id": "0021700909_007", "order": 7, "role": "body", "text": "Goran Dragic scored 21 for the Heat, who got 16 points from Tyler Johnson and 15 points and 11 rebounds from Hassan Whiteside."}
{"game_id": "0021700909", "chunk_id": "0021700909_008", "order": 8, "role": "body", "text": "Joel Embiid scored 23 points for Philadelphia, which got 21 from Dario Saric. The 76ers led by as many as 10 in the fourth and had a chance to win at the buzzer, but JJ Redick's wide-open 3-point try bounced off the rim."}
{"game_id": "0021700909", "chunk_id": "0021700909_009", "order": 9, "role": "body", "text": "\"D-Wade down the stretch was amazing,\" Redick said."}
{"game_id": "0021700909", "chunk_id": "0021700909_010", "order": 10, "role": "body", "text": "He needed to be, since Philadelphia led for 96 percent of the second half -- and lost, because Wade wouldn't allow any other outcome."}
{"game_id": "0021700909", "chunk_id": "0021700909_011", "order": 11, "role": "body", "text": "Wade got fouled on a 3-point try with 29 seconds left and the Heat down by three. The plan that Spoelstra laid out was for the Heat to foul Simmons -- a 57 percent foul shooter -- if Wade missed one of the three foul shots. Wade made all three, but fouled Simmons anyway."}
{"game_id": "0021700909", "chunk_id": "0021700909_012", "order": 12, "role": "body", "text": "Spoelstra picked up the idea from watching Dragic play in Slovenia over the last two summers; fouling to get the ball back, even late in tie games, is more prevalent in European games."}
{"game_id": "0021700909", "chunk_id": "0021700909_013", "order": 13, "role": "body", "text": "In the end, it worked out anyway."}
{"game_id": "0021700909", "chunk_id": "0021700909_014", "order": 14, "role": "body", "text": "\"That's the difference between a head coach enjoying his glass of wine or staying up all night second-guessing every single decision,\" Spoelstra said."}
{"game_id": "0021700909", "chunk_id": "0021700909_015", "order": 15, "role": "body", "text": "Wade didn't seem aware of the plan to foul only if he missed one of the three."}
{"game_id": "0021700909", "chunk_id": "0021700909_016", "order": 16, "role": "body", "text": "\"I wanted to foul,\" Wade said. \"I had confidence in myself that I was going to make all three. They kept running (the same) pick and roll, and it was killing us and I just felt playing the numbers ... I wanted the young fella to see, in this environment, what he's going to do.\""}
{"game_id": "0021700909", "chunk_id": "0021700909_017", "order": 17, "role": "body", "text": "Simmons missed the first, made the second. Wade brought the ball downcourt, dribbled left, went behind his back, then to the right, then eventually found his spot to fire over Simmons for what became the gamewinner."}
{"game_id": "0021700909", "chunk_id": "0021700909_018", "order": 18, "role": "body", "text": "\"That's what he does,\" 76ers coach Brett Brown said. \"That's who he is. That's who he's always been. He just sort of grabbed the team and put it on his back.\""}
{"game_id": "0021700909", "chunk_id": "0021700909_019", "order": 19, "role": "body", "text": "Philadelphia used a 16-3 run to open a 33-20 lead in the first half, and Miami answered with an 18-2 run to go up 38-35. From there, a 12-minute stretch of back-and-forth commenced with neither team ever leading by more than three."}
{"game_id": "0021700909", "chunk_id": "0021700909_020", "order": 20, "role": "body", "text": "The 76ers eventually broke through, going up nine late in the third. But they saw the margin cut to 75-73 going into the fourth, after Wade hit a step-back 3 to end the quarter. In the fourth, Philadelphia went up again, this time by 10 -- and Miami clawed back again, using an 11-1 run to knot the game on a layup by Wade with 4:57 left."}
{"game_id": "0021700909", "chunk_id": "0021700909_021", "order": 21, "role": "body", "text": "And in the end, Wade came through in the biggest way. In his house, the Heat got a needed win."}
{"game_id": "0021700909", "chunk_id": "0021700909_022", "order": 22, "role": "body", "text": "\"It was good tonight to be back in that position,\" Wade said."}
{"game_id": "0021700909", "chunk_id": "0021700909_024", "order": 24, "role": "body", "text": "76ers: Philadelphia got fouled three times on 3-point tries and made the utmost of the chances, converting them into 10 points. Marco Belinelli made three free throws, and Redick turned one into a four-point play, and made three more when hit again beyond the arc with 1:47 left. ... Redick scored 15, Belinelli had 13 and Simmons finished with 11."}
{"game_id": "0021700909", "chunk_id": "0021700909_025", "order": 25, "role": "body", "text": "Heat: It was the 24th time in Miami's last 26 games that the winning margin was less than 10 points. ... Wade's previous season high was 25, when he was with Cleveland."}
{"game_id": "0021700909", "chunk_id": "0021700909_027", "order": 27, "role": "body", "text": "Most of the second half was played with only two referees on the floor. Rodney Mott left the game early in the third quarter, accompanied by Heat athletic trainer Jay Sabol. Bill Spooner and Lauren Holtkamp finished the game."}
{"game_id": "0021700909", "chunk_id": "0021700909_029", "order": 29, "role": "body", "text": "76ers: Visit Cleveland on Thursday."}
{"game_id": "0021700909", "chunk_id": "0021700909_030", "order": 30, "role": "body", "text": "Heat: Host the L.A. Lakers on Thursday."}
{"game_id": "0021700909", "chunk_id": "0021700909_032", "order": 32, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
