{"game_id": "0021700874", "chunk_id": "0021700874_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Thaddeus Young just wanted to supply the Indiana Pacers with energy. He ended up giving them plenty of points, too."}
{"game_id": "0021700874", "chunk_id": "0021700874_002", "order": 2, "role": "body", "text": "Young scored 16 of his 20 points in the first half and the Pacers never trailed in a 116-93 rout of the hapless Atlanta Hawks on Friday night."}
{"game_id": "0021700874", "chunk_id": "0021700874_003", "order": 3, "role": "body", "text": "The 11th-year pro had 10 points by the end of the opening quarter and the Pacers led by 17 by halftime. They were ahead 83-66 entering the final quarter."}
{"game_id": "0021700874", "chunk_id": "0021700874_004", "order": 4, "role": "body", "text": "\"I just wanted to be the engine for the guys,\" Young said. \"It wasn't so much looking for the offensive (success), it just kind of happened.\""}
{"game_id": "0021700874", "chunk_id": "0021700874_005", "order": 5, "role": "body", "text": "The Pacers (34-25) won their fourth in a row and improved to 15-6 since Jan. 6, the league's best winning percentage (.714) in that span."}
{"game_id": "0021700874", "chunk_id": "0021700874_006", "order": 6, "role": "body", "text": "\"There's a lot more season left and we've got to go out there and compete at a high level,\" said Pacers guard Victor Oladipo. \"I thought we did a good job of that today for 48 minutes.\""}
{"game_id": "0021700874", "chunk_id": "0021700874_007", "order": 7, "role": "body", "text": "The Hawks (18-42), who have the NBA's worst record, are 5-25 on the road and have dropped three in a row overall."}
{"game_id": "0021700874", "chunk_id": "0021700874_008", "order": 8, "role": "body", "text": "\"We just wanted to go out there and compete,\" Hawks guard Kent Bazemore said. \"We didn't do that.\""}
{"game_id": "0021700874", "chunk_id": "0021700874_009", "order": 9, "role": "body", "text": "Young shot 7 of 13 and made a pair of 3-pointers in the first half. It's just the sixth time he's scored 20 points this season, the previous occasion a home win against Orlando on Jan. 27."}
{"game_id": "0021700874", "chunk_id": "0021700874_010", "order": 10, "role": "body", "text": "Backup forward Domantas Sabonis led the Pacers with 21 points and 13 rebounds for his 13th double-double of the season. Six Pacers scored in double digits."}
{"game_id": "0021700874", "chunk_id": "0021700874_011", "order": 11, "role": "body", "text": "\"I think everybody has missed each other,\" Sabonis said of the first game in nine days due to the All-Star break."}
{"game_id": "0021700874", "chunk_id": "0021700874_012", "order": 12, "role": "body", "text": "Hawks reserve guard Isaiah Taylor scored 17 points in just his second NBA game."}
{"game_id": "0021700874", "chunk_id": "0021700874_013", "order": 13, "role": "body", "text": "\"A lot of credit to Indiana, the way they play is impressive,\" Hawks coach Mike Budenholzer said. \"I liked our team better in the second half, I thought we were more competitive, more together -- but you can't wait until halftime to get to that mindset.\""}
{"game_id": "0021700874", "chunk_id": "0021700874_015", "order": 15, "role": "body", "text": "Hawks: Failed to score at least 100 points after seven consecutive games over the century mark, the best such stretch since a streak of nine games in 2016. . F/C John Collins has 143 offensive rebounds, which leads all NBA rookies. The next closest player is Philadelphia's Ben Simmons at 100. . G Dennis Schroder, the team's leading scorer at 19.5 points per game, is one of just three players in the league to amass at least 90 steals and 40 blocks. The Pacers' Victor Oladipo and Simmons are the other two."}
{"game_id": "0021700874", "chunk_id": "0021700874_016", "order": 16, "role": "body", "text": "Pacers: Improved to 21-11 at Bankers Life Fieldhouse and assured themselves of a winning record at home for the 29th consecutive season, the longest such streak in the NBA. . New Indianapolis Colts head coach Frank Reich, hired 12 days ago, was in attendance and received rousing applause when he was shown on the arena's video screens. . Oladipo extended his franchise-record steal streak to 42 games with an opening-quarter theft. Ron Artest (2002-03) held the previous mark at 40. Oladipo averages 2.1 steals, which ranks third in the league. . PG Darren Collison missed his fifth consecutive game as he recovers from arthroscopic surgery on his left knee."}
{"game_id": "0021700874", "chunk_id": "0021700874_018", "order": 18, "role": "body", "text": "Pacers reserve G/F Glenn Robinson III was understandably amped up for his season debut after undergoing extensive rehabilitation from left ankle surgery. The fourth-year pro was so excited, he shot an airball on an initial 19-foot jumper."}
{"game_id": "0021700874", "chunk_id": "0021700874_019", "order": 19, "role": "body", "text": "About 90 seconds later, Robinson faked a defender out of position and swished a 21-foot pull-up shot. As he jogged down the court, Sabonis acknowledged the moment by tapping an appreciative Robinson on the back of the head. Robinson had four points and two rebounds in 19 minutes."}
{"game_id": "0021700874", "chunk_id": "0021700874_021", "order": 21, "role": "body", "text": "The Hawks have nine players on their 15-man roster with one year or less of NBA experience, an average of 2.3 years of service as the league's youngest team, according to Elias."}
{"game_id": "0021700874", "chunk_id": "0021700874_023", "order": 23, "role": "body", "text": "Hawks: Host the Los Angeles Lakers on Monday."}
{"game_id": "0021700874", "chunk_id": "0021700874_024", "order": 24, "role": "body", "text": "Pacers: Visit Dallas on Monday."}
{"game_id": "0021700874", "chunk_id": "0021700874_026", "order": 26, "role": "closing", "text": "More AP NBA: https://apnews.com/tag/NBAbasketball"}
