{"game_id": "0021200453", "chunk_id": "0021200453_001", "order": 1, "role": "lead", "text": "CHICAGO --  Squandering a healthy lead is nothing new to the Charlotte Bobcats -- hanging onto one is."}
{"game_id": "0021200453", "chunk_id": "0021200453_002", "order": 2, "role": "body", "text": "Kemba Walker had 18 points and eight rebounds, and the Bobcats ended an 18-game losing streak with a 91-81 win over the Chicago Bulls on Monday."}
{"game_id": "0021200453", "chunk_id": "0021200453_003", "order": 3, "role": "body", "text": "Gerald Henderson added 16 points and reserve Ben Gordon had 15 to help Charlotte snap the second-longest skid in team history. It was the Bobcats' first win in their last 10 road games."}
{"game_id": "0021200453", "chunk_id": "0021200453_004", "order": 4, "role": "body", "text": "\"We're a desperate team right now,\" Henderson said. \"This losing streak has been very tough on us.\""}
{"game_id": "0021200453", "chunk_id": "0021200453_005", "order": 5, "role": "body", "text": "Luol Deng scored 20 points and grabbed 12 rebounds for Chicago. Carlos Boozer also had a double-double with 19 points and 14 boards."}
{"game_id": "0021200453", "chunk_id": "0021200453_006", "order": 6, "role": "body", "text": "Charlotte fended off several rallies by the Bulls, who never held a lead, to win for the first time since Nov. 24."}
{"game_id": "0021200453", "chunk_id": "0021200453_007", "order": 7, "role": "body", "text": "Tied at 65 heading into the fourth quarter, Bobcats coach Mike Dunlap decided to try something different."}
{"game_id": "0021200453", "chunk_id": "0021200453_008", "order": 8, "role": "body", "text": "\"I put the playbook in the freezer and just let our guys go at them,\" he said."}
{"game_id": "0021200453", "chunk_id": "0021200453_009", "order": 9, "role": "body", "text": "Charlotte went on a 10-0 run to pad its lead as boos began raining down from the irritated Bulls faithful, who have endured inconsistency as they await the return of former MVP Derrick Rose, who is recovering from knee surgery."}
{"game_id": "0021200453", "chunk_id": "0021200453_010", "order": 10, "role": "body", "text": "The Bulls had chipped away at a 12-point deficit in the third quarter, eventually tying the game on Richard Hamilton's second-chance jumper with 39 seconds left, but Chicago went ice-cold from the field in the fourth, shooting 23.1 percent."}
{"game_id": "0021200453", "chunk_id": "0021200453_011", "order": 11, "role": "body", "text": "Chicago (16-13) shot 35.1 percent overall and hit just four of 16 3-point attempts."}
{"game_id": "0021200453", "chunk_id": "0021200453_012", "order": 12, "role": "body", "text": "\"You can deal with the shots. Some nights you're going to shoot better than others,\" Bulls coach Tom Thibodeau said. \"But the defense and rebounding is not where it needs to be.\""}
{"game_id": "0021200453", "chunk_id": "0021200453_013", "order": 13, "role": "body", "text": "Charlotte led by as many as 21 in the first half Saturday against New Orleans, eventually losing 98-95."}
{"game_id": "0021200453", "chunk_id": "0021200453_014", "order": 14, "role": "body", "text": "It looked to be the same old story for the Bobcats heading into the fourth, but the 10-0 run to start the quarter gave the Bobcats enough momentum to stop a seemingly never-ending losing streak."}
{"game_id": "0021200453", "chunk_id": "0021200453_015", "order": 15, "role": "body", "text": "The new year couldn't come quick enough for Charlotte (8-23), which narrowly avoided posting a 0-16 calendar month for the second time in 2012. The Bobcats went 0-16 in April to end last season on a franchise-worst 23-game losing streak."}
{"game_id": "0021200453", "chunk_id": "0021200453_016", "order": 16, "role": "body", "text": "The eight wins already surpasses Charlotte's seven wins all of last season."}
{"game_id": "0021200453", "chunk_id": "0021200453_017", "order": 17, "role": "body", "text": "\"When you go through an entire month without a win, it really eats at you,\" Dunlap said. \"It's especially hard for our young guys who need to build confidence.\""}
{"game_id": "0021200453", "chunk_id": "0021200453_018", "order": 18, "role": "body", "text": "Ramon Sessions scored 11 first-half points to give Charlotte a five-point advantage at the break. He finished with 15."}
{"game_id": "0021200453", "chunk_id": "0021200453_019", "order": 19, "role": "body", "text": "The Bobcats shot over 50 percent from the field in the first half, but struggled from the free throw line, hitting just six of 15 attempts to keep Chicago in the game."}
{"game_id": "0021200453", "chunk_id": "0021200453_020", "order": 20, "role": "body", "text": "The Bulls began intentionally putting Charlotte on the line in hopes of mounting a comeback, to no avail."}
{"game_id": "0021200453", "chunk_id": "0021200453_021", "order": 21, "role": "body", "text": "\"They weren't shooting free throws well,\" Thibodeau said. \"You're just searching for anything that can get you going.\""}
{"game_id": "0021200453", "chunk_id": "0021200453_022", "order": 22, "role": "body", "text": "The Bobcats finished 21 of 38 from the stripe -- worse than mediocre, but enough to get the job done."}
{"game_id": "0021200453", "chunk_id": "0021200453_023", "order": 23, "role": "body", "text": "Chicago has lost three of its last four."}
{"game_id": "0021200453", "chunk_id": "0021200453_024", "order": 24, "role": "body", "text": "\"We're in a funk right now, we've been up and down this season,\" said Taj Gibson, who had eight points and nine rebounds. \"Tonight, we let down a lot on defense and we just have to find our way out of it.\""}
{"game_id": "0021200453", "chunk_id": "0021200453_025", "order": 25, "role": "closing", "text": "Game notes Bulls G Kirk Hinrich was ruled out before the game due to `'a compilation of things,\" according to coach Tom Thibodeau. He is considered day-to-day. ... Thibodeau said he was \"sad\" to hear about the firing of Chicago Bears head coach Lovie Smith. `'You hate to see anyone lose their job, but that's the nature of the beast,\" he said. ... Bobcats F Michael Kidd-Gilchrist (scratched right cornea) did not play after being poked in the eye during a 98-95 loss to New Orleans on Saturday."}
