{"game_id": "0021200817", "chunk_id": "0021200817_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- Memphis coach Lionel Hollins scolded his team during the first half and then again at halftime."}
{"game_id": "0021200817", "chunk_id": "0021200817_002", "order": 2, "role": "body", "text": "The Grizzlies eventually got the message."}
{"game_id": "0021200817", "chunk_id": "0021200817_003", "order": 3, "role": "body", "text": "Hollins' team turned up the defensive pressure in the second half and beat the short-handed Orlando Magic 88-82 on Friday night for its sixth consecutive victory."}
{"game_id": "0021200817", "chunk_id": "0021200817_004", "order": 4, "role": "body", "text": "\"I thought once Coach called that first timeout and told us what he told us -- which I don't want to say -- we responded and came out there and was able to play better in the second quarter and get the lead,\" guard Tony Allen said. \"At halftime, he gave us another scolding, and we responded.\""}
{"game_id": "0021200817", "chunk_id": "0021200817_005", "order": 5, "role": "body", "text": "Marc Gasol had 19 points and 13 rebounds, while Zach Randolph added 16 points and 14 boards for the Grizzlies, who picked up steam following a lackluster start."}
{"game_id": "0021200817", "chunk_id": "0021200817_006", "order": 6, "role": "body", "text": "The Magic had only seven players available because of injuries and trades from Thursday, including a multiplayer swap with Milwaukee. The returning players were not available."}
{"game_id": "0021200817", "chunk_id": "0021200817_007", "order": 7, "role": "body", "text": "\"I was extremely proud,\" Orlando coach Jacque Vaughn said. \"Just the effort and the competitiveness. The things we've been talking about. It was just good to see it from start to finish."}
{"game_id": "0021200817", "chunk_id": "0021200817_008", "order": 8, "role": "body", "text": "\"It was a collective spirit. It was guys pulling for each other.\""}
{"game_id": "0021200817", "chunk_id": "0021200817_009", "order": 9, "role": "body", "text": "Mike Conley finished with 14 points and seven assists for Memphis.  Ed Davis scored 10."}
{"game_id": "0021200817", "chunk_id": "0021200817_010", "order": 10, "role": "body", "text": "\"We did enough to win, and it wasn't pretty,\" Hollins said."}
{"game_id": "0021200817", "chunk_id": "0021200817_011", "order": 11, "role": "body", "text": "Arron Afflalo had 20 points, six rebounds and seven assists for Orlando. Moe Harkless scored 19, and Andrew Nicholson added 14 points. E'Twaun Moore scored 12 points and handed out seven assists as the Magic dropped their fourth straight and 16th in their past 17."}
{"game_id": "0021200817", "chunk_id": "0021200817_012", "order": 12, "role": "body", "text": "Memphis outrebounded the Magic 52-42, including 14 offensive boards. Memphis' biggest shortfall was at the free throw line, where the Grizzlies were 17-of-29. The Magic went to the line only nine times in the game, converting seven of them."}
{"game_id": "0021200817", "chunk_id": "0021200817_013", "order": 13, "role": "body", "text": "There were 15 lead changes and five ties but those came in the first half."}
{"game_id": "0021200817", "chunk_id": "0021200817_014", "order": 14, "role": "body", "text": "\"We have to play better basketball,\" Gasol said. \"We have to play more consistent, more disciplined on both ends.\""}
{"game_id": "0021200817", "chunk_id": "0021200817_015", "order": 15, "role": "body", "text": "The Magic dropped off the pace when they were outscored 24-15 in the third. The lead reached as many as 13 in the quarter as Memphis' defense disrupted the Orlando offense."}
{"game_id": "0021200817", "chunk_id": "0021200817_016", "order": 16, "role": "body", "text": "Quincy Pondexter's 3-pointer in the closing seconds of the third extended the lead to 67-53. Randolph had eight in the quarter for Memphis."}
{"game_id": "0021200817", "chunk_id": "0021200817_017", "order": 17, "role": "body", "text": "\"We were trying to pick them up and heckle them a little bit and make them have to use a lot of energy,\" Conley said. \"Make their legs tired. Do as much as we could. Down the stretch, I think it started wearing on them.\""}
{"game_id": "0021200817", "chunk_id": "0021200817_018", "order": 18, "role": "body", "text": "The Grizzlies' opening basket of the fourth ran the lead to 16, but Orlando answered with eight straight points. The Magic also put together a 16-3 surge that trimmed Memphis' lead to 72-69 with 5:19 to play."}
{"game_id": "0021200817", "chunk_id": "0021200817_019", "order": 19, "role": "body", "text": "But Orlando's rally fizzled when Nikola Vucevic fouled out with about 8 minutes to play, and Nicholson fouled out less than 4 minutes later. Then all the players available for the Magic had to play out the rest of the game."}
{"game_id": "0021200817", "chunk_id": "0021200817_020", "order": 20, "role": "body", "text": "\"I asked myself: 'Who else is there? How many do I have left?'\" Vaughn said. \"I was kidding with coach (Laron) Profit. I told him that I was going to send him to the back and put a jersey on him.\""}
{"game_id": "0021200817", "chunk_id": "0021200817_021", "order": 21, "role": "body", "text": "Tayshaun Prince, Randolph and Gasol scored consecutive baskets to finally give Memphis enough of a buffer to extend its winning streak."}
{"game_id": "0021200817", "chunk_id": "0021200817_022", "order": 22, "role": "body", "text": "Orlando stayed close in the first half, but the Grizzlies scored the final eight points of the second to carry a 43-38 lead into the break."}
{"game_id": "0021200817", "chunk_id": "0021200817_023", "order": 23, "role": "body", "text": "Gasol had 11 points at intermission, while Harkless and Afflalo each scored nine points for Orlando."}
{"game_id": "0021200817", "chunk_id": "0021200817_024", "order": 24, "role": "body", "text": "\"We went out there and played hard against a real good team,\" Harkless said. \"We made it a good game to the end. Unfortunately, we didn't come out with the win, but we definitely fought hard.\""}
{"game_id": "0021200817", "chunk_id": "0021200817_025", "order": 25, "role": "closing", "text": "Game notes The Magic were without J.J. Redick, Gustavo Ayon and Ish Smith, who were traded at Thursday's deadline, and the players they got in return -- Tobias Harris, Doron Lamb and Beno Udrih -- were not with the team yet. ... The Grizzlies have now held 46 of 54 opponents to fewer than 100 points. ... Randolph recorded his 33rd double-double, Gasol his 11th. ... The Magic have dropped 10 straight on the road. ... Harkless' 19 points were one short of his career best, which he recorded in Orlando's previous game -- a loss to Dallas on Wednesday. ... Conley had two steals, leaving him two short of surpassing Rudy Gay as the franchise leader in the category."}
