{"game_id": "0021400465", "chunk_id": "0021400465_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  Jodie Meeks got loose on the perimeter for nine 3-pointers Tuesday night. And with Andre Drummond dominating inside, that was more than enough for the Detroit Pistons to roll to their third straight victory."}
{"game_id": "0021400465", "chunk_id": "0021400465_002", "order": 2, "role": "body", "text": "Meeks scored a season-high 34 points off the bench, shooting 9 for 11 from behind the arc, and Drummond added 17 points and 22 rebounds in a 109-86 win over the Orlando Magic."}
{"game_id": "0021400465", "chunk_id": "0021400465_003", "order": 3, "role": "body", "text": "Meeks finished 11 for 16 overall in posting the highest-scoring game for any Pistons player this season."}
{"game_id": "0021400465", "chunk_id": "0021400465_004", "order": 4, "role": "body", "text": "\"I just took what was open,\" Meeks said. \"Tonight it was me, but ... this is how the offense is supposed to be run. Maybe we had success one game and now we're going to do it. We're playing well right now.\""}
{"game_id": "0021400465", "chunk_id": "0021400465_005", "order": 5, "role": "body", "text": "Drummond, the NBA's No. 2 rebounder, sat out the final 14 minutes after coming within three rebounds of the league's season high. He was the only Detroit starter to score in double figures."}
{"game_id": "0021400465", "chunk_id": "0021400465_006", "order": 6, "role": "body", "text": "Reserve guard D.J. Augustin had 11 points and 10 assists for the Pistons (8-23), who have won three straight for the first time since February last season."}
{"game_id": "0021400465", "chunk_id": "0021400465_007", "order": 7, "role": "body", "text": "Victor Oladipo led the Magic, who were also seeking a third straight win, with 16 points. Tobias Harris added 15 points and eight rebounds."}
{"game_id": "0021400465", "chunk_id": "0021400465_008", "order": 8, "role": "body", "text": "After Meeks made all six of his 3s in the second quarter and scored 20 points in the period, the Pistons opened an 18-point lead in the third quarter. The Magic never again got the deficit under nine."}
{"game_id": "0021400465", "chunk_id": "0021400465_009", "order": 9, "role": "body", "text": "Meeks' first points came on a 3 early in the second quarter that cut Orlando's lead to 25-24. His next field goal, another 3, put the Pistons ahead to stay at 31-29."}
{"game_id": "0021400465", "chunk_id": "0021400465_010", "order": 10, "role": "body", "text": "\"I think when I hit one, I feel like I'm hot,\" he said. \"I think a couple shots I knocked down and I tried to hit another one and it went in.\""}
{"game_id": "0021400465", "chunk_id": "0021400465_011", "order": 11, "role": "body", "text": "The Magic (13-22) never recovered from Meeks' big second quarter."}
{"game_id": "0021400465", "chunk_id": "0021400465_012", "order": 12, "role": "body", "text": "\"He shot the light out,\" Harris said. \"It makes them even harder to guard because their big guys are rolling to the basket and we've got to try and stop them, then he keeps making 3s. It's tough.\""}
{"game_id": "0021400465", "chunk_id": "0021400465_015", "order": 15, "role": "body", "text": "Stan Van Gundy, who coached the Magic for five seasons, said his current position as president and head coach of the Pistons will prove to be his last job. \"I've got five years and I'll be 60 and I've promised my wife, seriously, (that he will retire). I wanted one more shot at it, but I've got a great owner, a great situation with great tradition and I should be able to get it turned around in the time that he's given me. If I don't, I don't.\""}
{"game_id": "0021400465", "chunk_id": "0021400465_017", "order": 17, "role": "body", "text": "Pistons: It was the fourth time this season Drummond had 20 or more rebounds. ... After going 17 of 31 on 3s in a win at Cleveland on Sunday, the Pistons went 14 for 33 against Orlando, including 9 of 16 in the first half."}
{"game_id": "0021400465", "chunk_id": "0021400465_018", "order": 18, "role": "body", "text": "Magic: Orlando beat the Pistons 107-93 in their previous meeting on Nov. 17 in Detroit. ... After winning only four road games last season, the Magic are 4-10 at home and 9-12 on the road."}
{"game_id": "0021400465", "chunk_id": "0021400465_020", "order": 20, "role": "body", "text": "Pistons: Friday night at New York."}
{"game_id": "0021400465", "chunk_id": "0021400465_021", "order": 21, "role": "closing", "text": "Magic: Friday night at home against Brooklyn."}
