{"game_id": "0021400309", "chunk_id": "0021400309_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. -- LaMarcus Aldridge might never become the leading scorer in Portland Trail Blazers history.\nHe's got a real chance to put second place out of reach, though.\nAldridge scored 23 points in Portland's 98-86 victory over the Detroit Pistons on Tuesday night, including a crucial pair of baskets to end Detroit's fourth-quarter rally. He now has 11,347 career points, 17 more than Terry Porter.\n\"It's a big honor to pass Terry, because he was a big-time player for this franchise and a big-time player in this league,\" Aldridge said after helping Portland win its fifth straight. \"He means a lot to the city of Portland, and to pass him means that all the hard work is paying off.\n\"It also means I've been with this franchise for a long time.\"\nAt 29, Aldridge isn't likely to pick up the 6,693 points he needs to catch Clyde Drexler, so he's settling on short-term goals.\n\"Right now, I'm just focused on getting these wins on the road,\" he said. \"This has been one of our tougher road trips, and the next one is tough as well.\"\nDetroit lost its 13th in a row, one short of the franchise record set in 1979-80 and tied in 1993-94. Those were both aging teams, with the second group marking the end of the Bad Boys era at the Palace. The current Pistons haven't had a winning season or won a playoff game in seven years.\n\"I'm not a patient, understanding man, and I've never been in this situation,\" said Pistons coach Stan Van Gundy, who has never had a losing season or missed the playoffs in his NBA coaching career. \"But I have to try to be a little understanding, because most of these guys have never been in a situation like this, either. Confidence is low right now and getting worse every game.\"\nGreg Monroe had 22 points and 10 rebounds for Detroit, which only got 40 points from its starting lineup.\n\"We've got two days off, and a lot of assessing to do,\" Van Gundy said. \"We need some serious adjustments into the way we play and who we play. When you've lost 13 in a row, everyone and everything is on the table.\"\nThe pattern of the game was established early, as Portland was able to convert most possessions into good scoring opportunities, while the Pistons struggled to finish at the rim. Detroit, one of the worst teams at scoring inside despite the presence of Josh Smith, Andre Drummond and Monroe, shot 44 percent in the paint in the first half.\nPortland's defense slowly took control in the third quarter, holding the Pistons to 22 percent shooting (4 for 18) and expanding the lead to as many as 17 points. It was 76-62 going into the fourth, but the Pistons finally put together enough baskets and stops to make a run.\nMonroe's layup pulled Detroit within 81-77 with 7:12 to play, but Aldridge hit two straight baskets and Damian Lillard rattled home a 3-pointer to keep the Pistons at bay.\n\"It was disappointing that Detroit made that run at the end, but I liked the way we finished the game and took care of our business,\" said Trail Blazers coach Terry Stotts.\nTIP-INS\nBLAZERS: Portland has beaten Detroit four straight times, and has won in five of its last seven visits to the Palace.\nPISTONS: Detroit had three previous 13-game losing streaks, including one each in the 1979-80 and 1993-94 seasons after the 14-game skid. The third came in 2009-10, which also featured an 11-game losing streak. ... Jodie Meeks, who has missed the entire season with a stress fracture in his back, is expected to resume practicing this week and could play on Detroit's upcoming three-game road trip.\nCOMING HOME: Chris Kaman, a native Michigander who played his college basketball at Central Michigan, was 6 of 8 in the first half for 12 points. He finished with 14 points in 21 minutes.\n\"Right now, we're letting teams stick around a little too much, but we're digging the games out at the end,\" he said.\nUP NEXT\nBLAZERS: Host Minnesota on Wednesday.\nPISTONS: Visit Phoenix on Friday."}
