{"game_id": "0021701171", "chunk_id": "0021701171_001", "order": 1, "role": "lead", "text": "TORONTO --  The Toronto Raptors turned up the defensive pressure and tightened their grip on first place in the Eastern Conference."}
{"game_id": "0021701171", "chunk_id": "0021701171_002", "order": 2, "role": "body", "text": "DeMar DeRozan scored 16 points, Fred VanVleet and Serge Ibaka each had 15 and the Raptors moved closer to clinching the top seed in the East by beating the Boston Celtics 96-78 on Wednesday night."}
{"game_id": "0021701171", "chunk_id": "0021701171_003", "order": 3, "role": "body", "text": "\"We had to rely on our defense tonight,\" DeRozan said. \"We missed a lot of shots but, with that, we played extremely hard defensively and made up for the low percentage that we shot from the field.\""}
{"game_id": "0021701171", "chunk_id": "0021701171_004", "order": 4, "role": "body", "text": "Toronto, which made 40 of 92 attempts, increased its lead over second-place Boston to three games. Both teams have four games remaining."}
{"game_id": "0021701171", "chunk_id": "0021701171_005", "order": 5, "role": "body", "text": "\"We didn't score the way we needed to but we played defense the way we needed to,\" Toronto's Kyle Lowry said."}
{"game_id": "0021701171", "chunk_id": "0021701171_006", "order": 6, "role": "body", "text": "Lowry scored 13 points as the Raptors earned a split in the season series and clinched the tiebreaker over Boston, based on each team's record in conference play. Toronto is 37-11 against the East, while Boston is 31-17."}
{"game_id": "0021701171", "chunk_id": "0021701171_007", "order": 7, "role": "body", "text": "\"Obviously these guys are well into the driver's seat on the one (seed),\" Boston coach Brad Stevens said."}
{"game_id": "0021701171", "chunk_id": "0021701171_008", "order": 8, "role": "body", "text": "With its 56th win of the season, Toronto matched the franchise record set in 2015-16."}
{"game_id": "0021701171", "chunk_id": "0021701171_009", "order": 9, "role": "body", "text": "Still, Raptors coach Dwane Casey wasn't celebrating."}
{"game_id": "0021701171", "chunk_id": "0021701171_010", "order": 10, "role": "body", "text": "\"We're not excited,\" Casey said. \"We still have some things to get better at.\""}
{"game_id": "0021701171", "chunk_id": "0021701171_011", "order": 11, "role": "body", "text": "Delon Wright had eight points, eight assists and nine rebounds for the Raptors, who entered having lost five of their previous eight, including the past two. Toronto lost at Boston on Saturday and again at Cleveland on Tuesday."}
{"game_id": "0021701171", "chunk_id": "0021701171_012", "order": 12, "role": "body", "text": "Marcus Morris scored 21 points, Greg Monroe had 17 and Al Horford 16 for the Celtics, who were held to their lowest point total of the season. Boston scored 80 in a Jan. 18 loss to Philadelphia."}
{"game_id": "0021701171", "chunk_id": "0021701171_013", "order": 13, "role": "body", "text": "\"You always talk on offense about owning your space and they owned our space all night,\" Stevens said. \"They were very physical, they were very good.\""}
{"game_id": "0021701171", "chunk_id": "0021701171_014", "order": 14, "role": "body", "text": "Boston made 25 of 75 shot attempts, including 3 of 22 from 3-point range, its fewest made 3-pointers of the season. Boston's previous low was six, set twice."}
{"game_id": "0021701171", "chunk_id": "0021701171_015", "order": 15, "role": "body", "text": "The Celtics lost Tuesday in Milwaukee and have dropped consecutive games after winning six in a row."}
{"game_id": "0021701171", "chunk_id": "0021701171_016", "order": 16, "role": "body", "text": "\"It's vital that we get back on a good roll and go into the playoffs with some type of momentum,\" Morris said."}
{"game_id": "0021701171", "chunk_id": "0021701171_017", "order": 17, "role": "body", "text": "Terry Rozier started for Boston after sitting out Tuesday because of a sprained left ankle. He scored two points in 28 minutes and shot 1 of 9."}
{"game_id": "0021701171", "chunk_id": "0021701171_018", "order": 18, "role": "body", "text": "\"It didn't bother me,\" Rozier said of his ankle. \"It might have looked like it bothered me but it didn't bother me.\""}
{"game_id": "0021701171", "chunk_id": "0021701171_019", "order": 19, "role": "body", "text": "Jaylen Brown and Monroe each scored five points in the first as Boston led 20-14 after one. Toronto made six of 23 attempts in the opening quarter, going 2 of 11 from 3-point range, and didn't score over the final 3:29 in its lowest-scoring first quarter of the season."}
{"game_id": "0021701171", "chunk_id": "0021701171_020", "order": 20, "role": "body", "text": "Boston made nine turnovers in the second, leading to 17 points for Toronto, as the Raptors rallied behind six points from Wright to lead 43-33 at halftime. The Celtics had more turnovers in the first half (14) than made baskets (13)."}
{"game_id": "0021701171", "chunk_id": "0021701171_021", "order": 21, "role": "body", "text": "\"The only reason we were down at halftime was the turnovers,\" Stevens said."}
{"game_id": "0021701171", "chunk_id": "0021701171_022", "order": 22, "role": "body", "text": "After making eight of 19 field goal attempts in the first quarter, Boston shot 5 for 18 in the second and 5 for 19 in the third. DeRozan scored eight points in the third as Toronto took a 67-53 lead into the fourth."}
{"game_id": "0021701171", "chunk_id": "0021701171_024", "order": 24, "role": "body", "text": "Celtics: Rozier led Boston with nine rebounds. ... G Shane Larkin (illness) did not travel to Toronto. Larkin has missed three straight games. ... Boston finished with 17 turnovers, three shy of its season-worst. Toronto scored 29 points off turnovers."}
{"game_id": "0021701171", "chunk_id": "0021701171_025", "order": 25, "role": "body", "text": "Raptors: Toronto avoided its first three-game losing streak since Feb. 8-14, 2017. ... The Raptors outscored the Celtics 54-34 on points in the paint."}
{"game_id": "0021701171", "chunk_id": "0021701171_027", "order": 27, "role": "body", "text": "The home team won all four meetings in the series this season."}
{"game_id": "0021701171", "chunk_id": "0021701171_029", "order": 29, "role": "body", "text": "Rozier failed to reach double digits in scoring for the first time in 26 games."}
{"game_id": "0021701171", "chunk_id": "0021701171_031", "order": 31, "role": "body", "text": "Boston's starters combined for 35 points, 16 of them from Horford."}
{"game_id": "0021701171", "chunk_id": "0021701171_033", "order": 33, "role": "body", "text": "Toronto's eight attempted free throws matched a season-low. The Raptors also shot eight free throws against Atlanta on Dec. 29."}
{"game_id": "0021701171", "chunk_id": "0021701171_035", "order": 35, "role": "body", "text": "Celtics: Host Chicago on Friday. Boston has won five straight home games against the Bulls."}
{"game_id": "0021701171", "chunk_id": "0021701171_036", "order": 36, "role": "body", "text": "Raptors: Host Indiana on Friday. Toronto has won eight straight home games against the Pacers."}
{"game_id": "0021701171", "chunk_id": "0021701171_038", "order": 38, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
