{"game_id": "0021700972", "chunk_id": "0021700972_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  The Brooklyn Nets may not have much left to play for this season."}
{"game_id": "0021700972", "chunk_id": "0021700972_002", "order": 2, "role": "body", "text": "The same can't be said about Allen Crabbe."}
{"game_id": "0021700972", "chunk_id": "0021700972_003", "order": 3, "role": "body", "text": "Crabbe made his first six 3-pointers and had 29 points and eight rebounds and Brooklyn beat the listless Charlotte Hornets 125-111 on Thursday night to snap a four-game losing streak."}
{"game_id": "0021700972", "chunk_id": "0021700972_004", "order": 4, "role": "body", "text": "Crabbe has 159 3-pointers this season, 10 shy of the team record set by Deron Williams in 2013."}
{"game_id": "0021700972", "chunk_id": "0021700972_005", "order": 5, "role": "body", "text": "\"I think it's cool, but the bigger picture for us is to develop as a team and that's all it about and it wouldn't be possible if it wasn't for my teammates and everyone played a part in helping me get there,\" Crabbe said."}
{"game_id": "0021700972", "chunk_id": "0021700972_006", "order": 6, "role": "body", "text": "Coach Kenny Atkinson said Crabbe is getting back to being aggressive -- really aggressive, he said -- and that his teammates are giving him a big assist."}
{"game_id": "0021700972", "chunk_id": "0021700972_007", "order": 7, "role": "body", "text": "\"We screened for him. You have to screen for great shooters,\" Atkinson said. \"And then our point guards Deangelo (Russell), and Spencer (Dinwiddie), and Caris (Levert), they found him for shots. It's all got to work together for him to play well.\""}
{"game_id": "0021700972", "chunk_id": "0021700972_008", "order": 8, "role": "body", "text": "Levert scored 16 of his 22 points in the second half, and Rondae Hollis-Jefferson had 18 points and 12 rebounds to provide a spark off the bench for the Nets. They entered the game tied for the worst record in the Eastern Conference."}
{"game_id": "0021700972", "chunk_id": "0021700972_009", "order": 9, "role": "body", "text": "Kemba Walker had 21 points on 7-of-11 shooting for the Hornets. They've lost five straight games."}
{"game_id": "0021700972", "chunk_id": "0021700972_010", "order": 10, "role": "body", "text": "The Nets took control in the second quarter behind Crabbe, who made his first seven shots from the field, including six from beyond the 3-point arc."}
{"game_id": "0021700972", "chunk_id": "0021700972_011", "order": 11, "role": "body", "text": "The Hornets cut a 16-point deficit in half with 7:30 left after Walker scored six straight points, including an and-one off a 3-point jumper. But Crabbe scored on a drive and Levert knocked down a 3 from the left wing to ignite an 11-0 run to put the game away."}
{"game_id": "0021700972", "chunk_id": "0021700972_012", "order": 12, "role": "body", "text": "For a team that prides itself on defense, the Hornets can't seem to stop anyone lately. They have allowed at least 125 points in three of their last six games."}
{"game_id": "0021700972", "chunk_id": "0021700972_014", "order": 14, "role": "body", "text": "Nets: Twelve of their 31 third quarter points came off seven Charlotte turnovers. ... Outrebounded the Hornets 43-36. ... Dinwiddle had 10 assists."}
{"game_id": "0021700972", "chunk_id": "0021700972_015", "order": 15, "role": "body", "text": "Hornets: Cody Zeller picked up a flagrant one foul for swinging an elbow while setting a screen. ... Rookie Malik Monk had 13 points on 14 shots."}
{"game_id": "0021700972", "chunk_id": "0021700972_016", "order": 16, "role": "body", "text": "CLIFFORD TAKES BLAME: Hornets coach Steve Clifford said his team's effort the last two games -- they also played poorly in a 14-point loss to the Philadelphia 76ers on Tuesday night -- has been \"unacceptable\" and that owner Michael Jordan deserves a better effort."}
{"game_id": "0021700972", "chunk_id": "0021700972_017", "order": 17, "role": "body", "text": "\"Every one of these guys is here, at least in some part, because of me,\" Clifford said. \"And I am responsible for getting them ready to play and it's not happening. That is two bad games in a row and that starts with me.\""}
{"game_id": "0021700972", "chunk_id": "0021700972_018", "order": 18, "role": "body", "text": "Clifford said that doesn't absolve players though, saying \"the great ones find a way 82 times to get themselves ready to play. One of the biggest things you learn as you get older is how you handle success, how you handle disappointment and frustration in your life is everything -- and we are not doing that well right now.\""}
{"game_id": "0021700972", "chunk_id": "0021700972_019", "order": 19, "role": "body", "text": "PLAYING GUYS: With the Hornets playoff hopes all but over, Clifford said he would like to play rookies Malik Monk and Dwayne Bacon, Willy Hernangomez and Cody Zeller more down the stretch. He said it's important for Zeller, who missed most of the season with an injury, to get into a rhythm."}
{"game_id": "0021700972", "chunk_id": "0021700972_020", "order": 20, "role": "body", "text": "PASSING LAST YEAR: The Nets have now surpassed last year's win total -- and they still have 16 games remaining."}
{"game_id": "0021700972", "chunk_id": "0021700972_021", "order": 21, "role": "body", "text": "\"I think it speaks to the combined collective effort of management, performance staff, coaching staff and obviously the players as well to be able to go out there and improve upon last year,\" Dinwiddle said. \"We want to finish out strong and continue to try to get as many wins as possible.\""}
{"game_id": "0021700972", "chunk_id": "0021700972_023", "order": 23, "role": "body", "text": "Nets: Host Philadelphia on Sunday night."}
{"game_id": "0021700972", "chunk_id": "0021700972_024", "order": 24, "role": "closing", "text": "Hornets: Host Phoenix on Saturday."}
