{"game_id": "0021400786", "chunk_id": "0021400786_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. --  Memphis Grizzlies fans gave Lionel Hollins an enthusiastic standing ovation. The team even showed a video tribute to the coach."}
{"game_id": "0021400786", "chunk_id": "0021400786_002", "order": 2, "role": "body", "text": "Then the current version of the team he once led to the Western Conference Finals jumped to an early lead and maintained a double-digit advantage through much of a 95-86 victory Tuesday night over the his new squad, the Brooklyn Nets."}
{"game_id": "0021400786", "chunk_id": "0021400786_003", "order": 3, "role": "body", "text": "\"It was great,\" Hollins said of the admiration. \"I enjoyed it from a standpoint of the respect that they showed and the admiration for the work I've done here. But it was about trying to win a game.\""}
{"game_id": "0021400786", "chunk_id": "0021400786_004", "order": 4, "role": "body", "text": "That hope slipped away early as Memphis built an early lead and barely relinquished the double-digit advantage the rest of the night."}
{"game_id": "0021400786", "chunk_id": "0021400786_005", "order": 5, "role": "body", "text": "Zach Randolph had 19 points to lead the Grizzlies, while Marc Gasol added 14 and 11 rebounds, part of six Grizzlies reaching double figures as Memphis won its 14th in the last 16."}
{"game_id": "0021400786", "chunk_id": "0021400786_006", "order": 6, "role": "body", "text": "The Nets lost for the seventh time in their last 10."}
{"game_id": "0021400786", "chunk_id": "0021400786_007", "order": 7, "role": "body", "text": "\"We have some scoring lulls,\" said Nets center Mason Plumlee. \"If you don't score, it doesn't matter how good your defense is.\""}
{"game_id": "0021400786", "chunk_id": "0021400786_008", "order": 8, "role": "body", "text": "Plumlee and Alan Anderson each had 15 points for the Nets, with Plumlee also grabbing 14 rebounds. Jarrett Jack and Brook Lopez had 12 points apiece and Joe Johnson scored 11."}
{"game_id": "0021400786", "chunk_id": "0021400786_009", "order": 9, "role": "body", "text": "The Nets tightened it up in the fourth quarter, but didn't have enough to overtake Memphis, which led by as many as 22."}
{"game_id": "0021400786", "chunk_id": "0021400786_010", "order": 10, "role": "body", "text": "\"We fought back and gave ourselves a chance,\" Plumlee said of cutting the lead to seven. \"But we don't have the firepower to get behind 20 points and come back.\""}
{"game_id": "0021400786", "chunk_id": "0021400786_011", "order": 11, "role": "body", "text": "The Nets never recovered from a poor-shooting first quarter. The Nets normally shoot well in the opening frame -- at a clip just under 50 percent. But they were limited to 33 percent, leading to an early 19-point deficit."}
{"game_id": "0021400786", "chunk_id": "0021400786_012", "order": 12, "role": "body", "text": "There were times Brooklyn made little runs at the deficit, but only when the Grizzlies became careless with big leads."}
{"game_id": "0021400786", "chunk_id": "0021400786_013", "order": 13, "role": "body", "text": "\"You kind of just hope they go away,\" Memphis coach Dave Joerger said, \"but we should know better than that with Lionel's teams.\""}
{"game_id": "0021400786", "chunk_id": "0021400786_014", "order": 14, "role": "body", "text": "Brooklyn never got close enough to make Grizzlies fans feel threatened."}
{"game_id": "0021400786", "chunk_id": "0021400786_015", "order": 15, "role": "body", "text": "\"We somewhat kept getting it down to 10 or 11, but then finally cut it to nine or eight,\" Johnson said. \".We just couldn't compete at the end.\""}
{"game_id": "0021400786", "chunk_id": "0021400786_016", "order": 16, "role": "body", "text": "Only a handful of Grizzlies remain with the team from the 2013 season when Memphis, with Hollins at the helm, made it to the Western Conference Finals and lost to the San Antonio Spurs. All expressed appreciation for the former coach, whose contract wasn't renewed after that season after an ownership change."}
{"game_id": "0021400786", "chunk_id": "0021400786_017", "order": 17, "role": "body", "text": "\"I was surprised he didn't cry with all the fans showing love,\" said Tony Allen, who made all five of his shots for 12 points. \"It was great to have him back in the building and just to see him in all those sharp suits he's wearing.\""}
{"game_id": "0021400786", "chunk_id": "0021400786_019", "order": 19, "role": "body", "text": "Nets: Johnson, who had hit better than half his shots in six of the previous seven, was 3 of 9 from the field. ... Lopez had only two rebounds off the defensive glass, leaving him seven behind Keith Van Horn for seventh in franchise history."}
{"game_id": "0021400786", "chunk_id": "0021400786_020", "order": 20, "role": "body", "text": "Grizzlies: Memphis is now 10-1 at home against the Eastern Conference. ... Memphis won its 39th game, and still has a chance to reach 40 wins by the All-Star break. ... Memphis tied season-highs with 14 steals and nine blocks."}
{"game_id": "0021400786", "chunk_id": "0021400786_022", "order": 22, "role": "body", "text": "Hollins' return was the talk of the city earlier in the day and the Nets coach acknowledged before the game it would be emotional. \"You know I'm probably going to cry a little bit,\" he said, \"so get your little phone camera out.\""}
{"game_id": "0021400786", "chunk_id": "0021400786_024", "order": 24, "role": "body", "text": "The Nets won't play again until after the All-Star break. \"Hopefully it will give guys a chance to take a step back, clear their minds and get ready to make a push these last 30 games,\" Plumlee said."}
{"game_id": "0021400786", "chunk_id": "0021400786_027", "order": 27, "role": "closing", "text": "Grizzlies: Visit Thunder on Wednesday."}
