{"game_id": "0021400692", "chunk_id": "0021400692_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. --  For the first time in more than a decade, the Milwaukee Bucks could celebrate after a game in Orlando."}
{"game_id": "0021400692", "chunk_id": "0021400692_002", "order": 2, "role": "body", "text": "Jerryd Bayless scored 19 points, Jared Dudley and Khris Middleton had 17 apiece and the Bucks ended a 17-game losing streak in Orlando with a 115-100 victory on Thursday night."}
{"game_id": "0021400692", "chunk_id": "0021400692_003", "order": 3, "role": "body", "text": "The Bucks never trailed and placed seven players in double figures, including all five starters. Brandon Knight had 16 points and eight assists, and O.J. Mayo scored 13 points in Milwaukee's first road victory in the series since Dec. 29, 2004."}
{"game_id": "0021400692", "chunk_id": "0021400692_004", "order": 4, "role": "body", "text": "Milwaukee had 29 assists on 45 field goals and shot 51.7 percent for the game, including 12 of 25 from behind the 3-point line."}
{"game_id": "0021400692", "chunk_id": "0021400692_005", "order": 5, "role": "body", "text": "\"I think our players take pride in moving the ball, making the next pass,\" Bucks coach Jason Kidd said. \"I think they really enjoy playing with one another. That is why you see the ball move. They take pride in being part of the play.\""}
{"game_id": "0021400692", "chunk_id": "0021400692_006", "order": 6, "role": "body", "text": "Starting center Zaza Pachulia, who could miss a week with a calf injury, joined fellow starters Jabari Parker (knee) and Larry Sanders (suspension) on the sideline. His replacement, John Henson, has 12 points and 11 rebounds in his first start this season."}
{"game_id": "0021400692", "chunk_id": "0021400692_007", "order": 7, "role": "body", "text": "\"Obviously we miss those guys,\" Bayless said. \"We really do need them, but everybody stepped up their play and did the best they could to help the team win.\""}
{"game_id": "0021400692", "chunk_id": "0021400692_008", "order": 8, "role": "body", "text": "The Magic have lost seven straight and 13 of their last 15 games. Victor Oladipo led Orlando with 21 points. Nik Vucevic added 17 points and 14 rebounds."}
{"game_id": "0021400692", "chunk_id": "0021400692_009", "order": 9, "role": "body", "text": "\"I thought our focus and energy going into the game was really good. I'm really surprised by the results of tonight's game,\" Magic coach Jacque Vaughn said. \"I thought our group felt really good going into the game, but that's basketball. One team loses and guys feel frustrated. They want to win and we aren't right now.\""}
{"game_id": "0021400692", "chunk_id": "0021400692_010", "order": 10, "role": "body", "text": "The Bucks led 59-44 halftime and then blew open the game in the third period."}
{"game_id": "0021400692", "chunk_id": "0021400692_011", "order": 11, "role": "body", "text": "Vucevic scored 11 in the first 5 minutes of the period to cut Orlando's deficit to 72-60. Milwaukee responded with a 24-5 run as Knight had 14 points in the quarter, including nine straight during the game-deciding run."}
{"game_id": "0021400692", "chunk_id": "0021400692_012", "order": 12, "role": "body", "text": "The Bucks had an 11-0 advantage in fast-break points in the first 9 minutes. Bayless had 13 points in the second quarter while the Magic struggled at both ends."}
{"game_id": "0021400692", "chunk_id": "0021400692_013", "order": 13, "role": "body", "text": "Orlando, which has allowed 11 straight opponents to score more than 100 points, gave the Bucks a good head start on that by turning the ball over 13 times in the first half that resulted in 18 points for Milwaukee."}
{"game_id": "0021400692", "chunk_id": "0021400692_014", "order": 14, "role": "body", "text": "\"They had it going, they shot the cover off the ball,\" Oladipo said. \"Teams get hot like that, we've got to learn to deal with it and figure out a way to win.\""}
{"game_id": "0021400692", "chunk_id": "0021400692_015", "order": 15, "role": "body", "text": "Orlando made one run in the second half, but it died quickly."}
{"game_id": "0021400692", "chunk_id": "0021400692_016", "order": 16, "role": "body", "text": "Mayo finished the 4 minutes of one-sided basketball during the big run with a 10-footer that made it 94-65 and brought out the boo birds from what was left of the Magic crowd."}
{"game_id": "0021400692", "chunk_id": "0021400692_017", "order": 17, "role": "body", "text": "The Bucks led by as many as 29 in the second half before Orlando outscored Milwaukee 29-19 in the fourth quarter, when Willie Green scored 13 of his 16, including three 3-pointers."}
{"game_id": "0021400692", "chunk_id": "0021400692_020", "order": 20, "role": "body", "text": "Bucks: Milwaukee has had 25 or more assists in five straight games. . The Bucks bench, which outscored Miami 54-13 Tuesday, was dead even with the Magic reserves, each scoring 43 points."}
{"game_id": "0021400692", "chunk_id": "0021400692_021", "order": 21, "role": "body", "text": "Magic: Oladipo is shooting 47 percent (72 of 153) while averaging 21 points over the last nine games.  . F Devyn Marble, who started seven straight games before going to the bench two games, was placed on the inactive list."}
{"game_id": "0021400692", "chunk_id": "0021400692_023", "order": 23, "role": "body", "text": "\"A lot of guys were putting the ball in the basket,\" Mayo said. \"We don't depend on one guy to come out and get us 20 points. And we've had injuries pretty much all year, so every guy usually plays whether it's a full roster or not. Everyone stays ready to step up.\""}
{"game_id": "0021400692", "chunk_id": "0021400692_025", "order": 25, "role": "body", "text": "Bucks: Host Portland on Saturday."}
{"game_id": "0021400692", "chunk_id": "0021400692_026", "order": 26, "role": "closing", "text": "Magic: Host Dallas on Saturday."}
