{"game_id": "0021200762", "chunk_id": "0021200762_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. --  All in all, Monday proved to be a painful night for the Boston Celtics."}
{"game_id": "0021200762", "chunk_id": "0021200762_002", "order": 2, "role": "body", "text": "Not only did the Celtics have their seven-game losing streak snapped at the hands of the NBA's worst team, but they might have suffered yet another costly injury in their 94-91 loss to the Charlotte Bobcats."}
{"game_id": "0021200762", "chunk_id": "0021200762_003", "order": 3, "role": "body", "text": "Backup guard Leandro Barbosa, who has seen increased playing time since the season-ending injury to Rajon Rondo, injured his left knee late in the third quarter and had to be carried to the locker room by a trainer and teammate."}
{"game_id": "0021200762", "chunk_id": "0021200762_004", "order": 4, "role": "body", "text": "Coach Doc Rivers said Barbosa will have an MRI on Tuesday."}
{"game_id": "0021200762", "chunk_id": "0021200762_005", "order": 5, "role": "body", "text": "\"It doesn't look great but we'll see,\" Rivers said."}
{"game_id": "0021200762", "chunk_id": "0021200762_006", "order": 6, "role": "body", "text": "In the seven games since Rondo's injury Barbosa had averaged nine points while playing an average of 22.5 minutes. The Celtics had won all seven games."}
{"game_id": "0021200762", "chunk_id": "0021200762_007", "order": 7, "role": "body", "text": "All of that came crashing down Monday night."}
{"game_id": "0021200762", "chunk_id": "0021200762_008", "order": 8, "role": "body", "text": "This night belonged to Charlotte's unheralded big man, Byron Mullens."}
{"game_id": "0021200762", "chunk_id": "0021200762_009", "order": 9, "role": "body", "text": "The four-year NBA veteran turned in a career game with 25 points and 18 rebounds as the Bobcats snapped a seven-game losing streak."}
{"game_id": "0021200762", "chunk_id": "0021200762_010", "order": 10, "role": "body", "text": "The 7-foot Mullens hit 10 of 16 shots from the field, including 4 of 5 from 3-point range. Ramon Sessions had 19 points for the Bobcats, including the go-ahead jumper from 18 feet with 25.7 seconds left. Kemba Walker had 18 points, six assists and six rebounds, and Gerald Henderson chipped in with 16 points."}
{"game_id": "0021200762", "chunk_id": "0021200762_011", "order": 11, "role": "body", "text": "Mullens was playing his fifth game after missing 19 with an ankle injury."}
{"game_id": "0021200762", "chunk_id": "0021200762_012", "order": 12, "role": "body", "text": "\"It's big time,\" Walker said of Mullens' effort. \"We need that from him. We need that from Byron and he can do it. We know he can do it every night. He is very capable. When he has big games like that, you know, I think that gives us a much better chance.\""}
{"game_id": "0021200762", "chunk_id": "0021200762_013", "order": 13, "role": "body", "text": "Mullens said he was more pleased with his rebounding than his scoring \"because that is not what I'm known for."}
{"game_id": "0021200762", "chunk_id": "0021200762_014", "order": 14, "role": "body", "text": "\"I just have to show the league and this organization that I can rebound,\" he said."}
{"game_id": "0021200762", "chunk_id": "0021200762_015", "order": 15, "role": "body", "text": "Kevin Garnett had 16 points and 13 rebounds for the Celtics, but missed a key 18-footer that would have given Boston the lead late in the game. Paul Pierce and Avery Bradley had chances to send the game into overtime in the final seconds, but missed open 3-pointers."}
{"game_id": "0021200762", "chunk_id": "0021200762_016", "order": 16, "role": "body", "text": "Jeff Green had 18 points for the Celtics and Pierce finished with 13 points, eight assists and eight rebounds."}
{"game_id": "0021200762", "chunk_id": "0021200762_017", "order": 17, "role": "body", "text": "\"We had a win streak going and we had momentum going,\" Celtics guard Courtney Lee said. \"We wanted finish out the rest of these games going into the (All-Star) break. So it's definitely a letdown. This one hurts more because we had the lead with one minute to go.\""}
{"game_id": "0021200762", "chunk_id": "0021200762_018", "order": 18, "role": "body", "text": "It was a back-and-forth game throughout."}
{"game_id": "0021200762", "chunk_id": "0021200762_019", "order": 19, "role": "body", "text": "After Henderson gave the Bobcats an 85-84 lead with 3:58 remaining, Jason Terry made a 3 from the wing and Garnett followed with a turnaround jumper in the lane to push the Boston lead to four."}
{"game_id": "0021200762", "chunk_id": "0021200762_020", "order": 20, "role": "body", "text": "It appeared as though the Bobcats were on their way to another fourth quarter collapse."}
{"game_id": "0021200762", "chunk_id": "0021200762_021", "order": 21, "role": "body", "text": "But trailing by four, Henderson hit a 3-point with 1:01 left. After Bradley missed an open jumper, Sessions came free off a screen and knocked down an 18-footer to give the Bobcats the lead with 25.7 seconds remaining."}
{"game_id": "0021200762", "chunk_id": "0021200762_022", "order": 22, "role": "body", "text": "The Celtics called timeout but Garnett missed from the left wing. Mullens grabbed his 18th rebound and then Walker made a pair of key free throws to give the Bobcats a three-point lead with 14.8 seconds left."}
{"game_id": "0021200762", "chunk_id": "0021200762_023", "order": 23, "role": "body", "text": "Boston set up an inbounds play and Pierce got an open look but missed. He grabbed his own rebound and dished out to the wing for Bradley, but he missed a 3 as time expired."}
{"game_id": "0021200762", "chunk_id": "0021200762_024", "order": 24, "role": "body", "text": "Boston's loss came after a triple overtime win against Denver on Thursday night, but the Celtics refused to use fatigue as an excuse."}
{"game_id": "0021200762", "chunk_id": "0021200762_025", "order": 25, "role": "body", "text": "\"We put that one behind us,\" Green said."}
{"game_id": "0021200762", "chunk_id": "0021200762_026", "order": 26, "role": "body", "text": "As he'd planned to do before the game, Rivers went deep into his bench in the first half with 10 players seeing at least 10 minutes of action."}
{"game_id": "0021200762", "chunk_id": "0021200762_027", "order": 27, "role": "body", "text": "The Bobcats battled back in the third quarter behind 12 points from Mullens to take a 75-72 lead into the fourth. Mullens, who scored Charlotte's first 10 points of the game, did most of his damage from outside, knocking down 3-pointers and turnaround jumpers, showing great touch for a big man."}
{"game_id": "0021200762", "chunk_id": "0021200762_028", "order": 28, "role": "body", "text": "\"Byron was as good as you can get in the NBA statistically in many ways,\" Bobcats coach Mike Dunlap said. \"He's still young. He's growing. ... He's a different player because he was able to take a res. He's got live legs and he's able to see the game.\""}
{"game_id": "0021200762", "chunk_id": "0021200762_029", "order": 29, "role": "closing", "text": "Game notes Pierce scored in double figures for the 50th game this season. ... Bobcats center Bismack Biyombo was a force inside on the defensive end blocking four shots and grabbing seven defensive rebounds."}
