{"game_id": "0021301203", "chunk_id": "0021301203_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- After a rough start to the season, Mike Conley was thinking of winning some games, not making the playoffs.\nWhat a difference a few months has made.\nThe Memphis Grizzlies beat the Los Angeles Lakers 102-90 on Sunday night to move a game ahead of idle Phoenix in the race for the final Western Conference playoff berth.\n\"It's amazing we're in this position,\" said Conley, who scored 24 points.\nMarc Gasol added 18 points and 15 rebounds and Mike Miller had 13 points for the Grizzlies, who head to Phoenix for a showdown with the Suns on Monday night.\n\"They're playing very well,\" Conley said of the Suns. \"These are the games we get up for.\"\nThe Grizzlies are 2-0 against the Suns this season, winning by 19 points at home and by eight in Phoenix.\n\"It's going to be a good test to go to Phoenix and play a team that is fighting for the same goal and can get hot really quick,\" Gasol said.\nJodie Meeks led the Lakers with 20 points in their last home game of a miserable season that has included a franchise-worst 55 losses with two games remaining.\n\"It's just a tough year,\" Lakers coach Mike D'Antoni said. \"Obviously it went off the rails when everybody was going down with injuries and trades and different things. Management will be on it this summer to get a good roster. They'll do a good job and hopefully people will stay well and then we'll see what happens.\"\nThe Lakers lost their seventh in a row overall and fifth straight at Staples Center. Wesley Johnson added 15 points and 15 rebounds, and Jordan Hill had 10 points and 10 rebounds.\nTied at 61 in the third, the Grizzlies pulled away on a 26-8 run to lead 87-69 going into the fourth. Conley scored six points, Tayshaun Prince had seven and Gasol added six in the spurt that produced their first double-digit lead of the game. Memphis shot 68 percent in the period.\n\"I don't know how many stops in a row we had at the end of the third, but we came out and guarded,\" Gasol said. \"We were pressuring the ball, we got on our defensive lines, and we rebounded. That most times takes care of a lot of things.\"\nNick Young, who finished with 14 points off the bench, had the Lakers' only field goal over the final 5 1/2 minutes of the third, when they shot 29 percent and were outrebounded 14-6.\nMemphis led by 22 points early in the fourth, when the Lakers got no closer than 12.\n\"This was a good sign on how we finished out the game,\" Prince said. \"I hope we can carry it over to tomorrow.\"\nThe Lakers kept it close in the first half, leading by nine before trailing 53-52 at the break.\nGame notes\nGasol hugged his brother Pau after the game; Pau has been out for the Lakers with vertigo. ... The Grizzlies improved to 22-18 on the road overall and 13-12 against West opponents away from home. ... After traveling to Phoenix, the Grizzlies end the regular season at Dallas, which is a half-game ahead of Memphis for the seventh seed. ... As has been his custom lately, injured Kobe Bryant wasn't on the bench during the game. ... Young addressed the crowd before the game, thanking fans for \"sticking in with us and supporting us all season long.\"... The Lakers end the season with games at Utah and San Antonio."}
