{"game_id": "0021300151", "chunk_id": "0021300151_001", "order": 1, "role": "lead", "text": "CHICAGO --  Luol Deng and the Chicago Bulls found a way to win, so this ugly game looked just fine to them."}
{"game_id": "0021300151", "chunk_id": "0021300151_002", "order": 2, "role": "body", "text": "Deng scored 21 points and the Bulls overcame a rough shooting night to beat the Charlotte Bobcats 86-81 on Monday for their fifth straight victory."}
{"game_id": "0021300151", "chunk_id": "0021300151_003", "order": 3, "role": "body", "text": "\"As I told our guys, it got choppy, particularly in the second quarter, and they do that to you. They're very good defensively,\" Bulls coach Tom Thibodeau said. \"I thought in the second half we did a better job of getting the ball to the second side, which you have to do.\""}
{"game_id": "0021300151", "chunk_id": "0021300151_004", "order": 4, "role": "body", "text": "Carlos Boozer had 12 points and 17 rebounds for Chicago, which is on its longest winning streak since taking eight in a row from Feb. 20-March 7, 2012. Jimmy Butler had 14 points and Derrick Rose finished with 12."}
{"game_id": "0021300151", "chunk_id": "0021300151_005", "order": 5, "role": "body", "text": "Deng's 3-pointer with 27.1 seconds remaining gave the Bulls an 85-81 lead. Gerald Henderson then missed for the Bobcats, and Rose had a free throw to help Chicago wrap it up."}
{"game_id": "0021300151", "chunk_id": "0021300151_006", "order": 6, "role": "body", "text": "The Bulls went 26 for 31 at the foul line, compared to 8 for 16 for the Bobcats."}
{"game_id": "0021300151", "chunk_id": "0021300151_007", "order": 7, "role": "body", "text": "\"We fought hard. Obviously, the difference in the game was the difference in free throws,\" Bobcats coach Steve Clifford said. \"You come here and they're a great team, they're well prepared. You can't get outscored by 18 at the free-throw line. That's the game in a nutshell.\""}
{"game_id": "0021300151", "chunk_id": "0021300151_008", "order": 8, "role": "body", "text": "Rose, who hit a career-high six 3-pointers in the Bulls' 110-94 win Saturday over Indiana, went 4 for 13 from the field. The Bulls shot 27 of 75 (36 percent) overall."}
{"game_id": "0021300151", "chunk_id": "0021300151_009", "order": 9, "role": "body", "text": "\"We'll take it,\" said Rose, who played 31 minutes in his second game back after missing Chicago's win at Toronto on Friday with a sore right hamstring."}
{"game_id": "0021300151", "chunk_id": "0021300151_010", "order": 10, "role": "body", "text": "Butler missed part of the game with a right toe injury but came back with 6:35 left in the fourth."}
{"game_id": "0021300151", "chunk_id": "0021300151_011", "order": 11, "role": "body", "text": "Charlotte was looking for its fourth consecutive road victory and third in four games overall, but it was unable to take advantage of the Bulls' poor shooting. Once again, the Bobcats struggled from the floor despite a strong effort in the paint."}
{"game_id": "0021300151", "chunk_id": "0021300151_012", "order": 12, "role": "body", "text": "The Bobcats were shooting a league-worst 40.2 percent from the field coming into the day, and they were 28th from 3-point range at 29.3 percent. On Monday, they shot 36.3 percent despite outscoring the Bulls 38-28 in the paint."}
{"game_id": "0021300151", "chunk_id": "0021300151_013", "order": 13, "role": "body", "text": "\"We played hard the whole game,\" said Henderson, who made two free throws with 51.3 seconds left to cut the Bulls' lead to one. \"We came out a little sluggish. We played them hard. We just didn't come up with the plays at the end of the game, defensively.\""}
{"game_id": "0021300151", "chunk_id": "0021300151_014", "order": 14, "role": "body", "text": "Jeffery Taylor led Charlotte with a career-high 20 points and Henderson had 16 in a game that featured two of the league's top defensive teams. Entering Monday, the Bulls were third in opponents' scoring at 90.0 points per game, while the Bobcats were fourth at 93.6."}
{"game_id": "0021300151", "chunk_id": "0021300151_015", "order": 15, "role": "body", "text": "\"They're great defensively,\" Thibodeau said. \"Steve's a hell of a coach. He's doing an unbelievable job. I'm happy for him that he's finally gotten an opportunity and the job that he's doing.\""}
{"game_id": "0021300151", "chunk_id": "0021300151_016", "order": 16, "role": "body", "text": "That defense helped Charlotte stay in the game without one of its best scorers."}
{"game_id": "0021300151", "chunk_id": "0021300151_017", "order": 17, "role": "body", "text": "Bobcats center Al Jefferson missed his third consecutive game with a bone bruise in his right ankle. Clifford said he hopes Jefferson can play Wednesday against Brooklyn, but he will more likely play Friday against Phoenix."}
{"game_id": "0021300151", "chunk_id": "0021300151_018", "order": 18, "role": "body", "text": "Jefferson, who signed a three-year, $40.5 million contract with the Bobcats in July, has played in three of Charlotte's 11 games and is averaging 15 points and 8.7 rebounds."}
{"game_id": "0021300151", "chunk_id": "0021300151_019", "order": 19, "role": "body", "text": "Without him, Charlotte had a chance to win in the final minutes in Chicago, but couldn't find a way past the Bulls."}
{"game_id": "0021300151", "chunk_id": "0021300151_020", "order": 20, "role": "body", "text": "\"It was a long summer. We haven't played in a while, all together. I think we're starting to get a rhythm,\" Deng said. \"Our offense, it still can get a lot better.\""}
{"game_id": "0021300151", "chunk_id": "0021300151_021", "order": 21, "role": "closing", "text": "Game notes It was the Bulls' last home game before they host New Orleans on Dec. 2. Their next six are away from Chicago as they go on their annual circus trip. ... Clifford and Thibodeau were on the New York Knicks' coaching staff from 2001-2003 and in Houston from 2003-2007. ... Charlotte plays five of its next six at home. ... Chicago mayor Rahm Emanuel, former Houston Rockets center Yao Ming, Bulls Hall of Famer Scottie Pippen and NBA deputy commissioner Adam Silver were in attendance."}
