{"game_id": "0021700497", "chunk_id": "0021700497_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  The Minnesota Timberwolves got their first-ever Christmas victory, and with the way things are coming together, it could be the first of many showcase wins."}
{"game_id": "0021700497", "chunk_id": "0021700497_002", "order": 2, "role": "body", "text": "Jimmy Butler scored 23 points, Karl-Anthony Towns had 21 points and 10 rebounds and the Timberwolves beat the Los Angeles Lakers 121-104 on Monday night."}
{"game_id": "0021700497", "chunk_id": "0021700497_003", "order": 3, "role": "body", "text": "\"I'm happy to be part of history for the franchise, but this won't be the first and the only one that we ever win,\" Towns said. \"We'll have a lot more opportunities I'm banking on to do this again and again and again.\""}
{"game_id": "0021700497", "chunk_id": "0021700497_004", "order": 4, "role": "body", "text": "Former Southern California standout Taj Gibson had 23 points and nine rebounds for the Timberwolves, who have won four straight. Jamal Crawford added 19 points off the bench."}
{"game_id": "0021700497", "chunk_id": "0021700497_005", "order": 5, "role": "body", "text": "Lakers rookie Kyle Kuzma scored 31 points, joining LeBron James in 2003 as the only first-year players to score at least 30 points on Christmas Day in the last 30 seasons."}
{"game_id": "0021700497", "chunk_id": "0021700497_006", "order": 6, "role": "body", "text": "Jordan Clarkson had 17 points, seven assists and six rebounds, and Julius Randle had 16 points and seven rebounds for the Lakers, who have lost three in a row and six of seven."}
{"game_id": "0021700497", "chunk_id": "0021700497_007", "order": 7, "role": "body", "text": "Minnesota pulled away when Towns and Crawford combined to score all 16 points during a 16-1 run after Randle put Los Angeles up 84-83 with 11:14 to play."}
{"game_id": "0021700497", "chunk_id": "0021700497_008", "order": 8, "role": "body", "text": "The Lakers cut the deficit to 105-99 with 4:30 remaining, but Gibson knocked down a hook shot and 3-pointer on consecutive possessions to restore a double-digit lead."}
{"game_id": "0021700497", "chunk_id": "0021700497_009", "order": 9, "role": "body", "text": "\"He just has a knack of coming up with big plays when you need it the most,\" Minnesota coach Tom Thibodeau said. \"What he has brought to the team and what Jimmy has brought to the team has really changed everything for us.\""}
{"game_id": "0021700497", "chunk_id": "0021700497_010", "order": 10, "role": "body", "text": "While the Timberwolves have been able to jumpstart their development with the addition of Butler, Gibson and Crawford, the Lakers showed their potential, even without Brandon Ingram and Lonzo Ball. Ball sprained his left shoulder against Portland on Saturday, and Ingram missed his second straight game with quad injuries."}
{"game_id": "0021700497", "chunk_id": "0021700497_011", "order": 11, "role": "body", "text": "Kuzma scored 10 of the Lakers' first 14 points, and kept a short-handed bunch in the mix. The Timberwolves led by 10 with 7:42 left in the second quarter, but the Lakers closed the half on a 22-13 run. Kuzma hit a 3 with 1:07 left to give Los Angeles its first lead before Butler hit a spinning layup to put Minnesota in front 53-52 at the break."}
{"game_id": "0021700497", "chunk_id": "0021700497_012", "order": 12, "role": "body", "text": "\"I like what he's about, how he likes to compete,\" Lakers coach Luke Walton said of Kuzma, who is averaging 30 points during his last five games. \"For us and the way we want to play, we want it to come organically to him, so we're not just running plays for him every time.\""}
{"game_id": "0021700497", "chunk_id": "0021700497_014", "order": 14, "role": "body", "text": "Timberwolves: Towns had 18 points in the second half. ... F Nemanja Bjelica had one point and two rebounds in six minutes after missing 15 games with a sprained left foot."}
{"game_id": "0021700497", "chunk_id": "0021700497_015", "order": 15, "role": "body", "text": "Lakers: Los Angeles missed out on a chance to break a tie with the New York Knicks for most wins on Christmas Day, dropping to 22-22. The Lakers played on Christmas Day for the 19th consecutive season."}
{"game_id": "0021700497", "chunk_id": "0021700497_017", "order": 17, "role": "body", "text": "Even without Ingram and Ball, the Lakers' youth invited comparisons to where the Timberwolves were last season. Thibodeau understands why the parallels are being made and expects Los Angeles to be even more of a pest as the season goes on."}
{"game_id": "0021700497", "chunk_id": "0021700497_018", "order": 18, "role": "body", "text": "\"I've watched their Warrior games, they're all hard-fought games,\" Thibodeau said. \"I think the future is bright, and when you have young guys it takes a little bit of time. A big part of learning is the trial and error of going through games.\""}
{"game_id": "0021700497", "chunk_id": "0021700497_020", "order": 20, "role": "body", "text": "Despite barbs from analyst Charles Barkley and the TNT crew about their methodical tempo on offense, the Timberwolves scored 38 points in the fourth quarter."}
{"game_id": "0021700497", "chunk_id": "0021700497_021", "order": 21, "role": "body", "text": "\"We pushed the pace. They were really pushing their pace on us early on and we weren't playing with the energy that we needed,\" Towns said."}
{"game_id": "0021700497", "chunk_id": "0021700497_023", "order": 23, "role": "body", "text": "Timberwolves: Host Memphis on Wednesday night."}
{"game_id": "0021700497", "chunk_id": "0021700497_024", "order": 24, "role": "body", "text": "Lakers: Host Denver on Wednesday night."}
{"game_id": "0021700497", "chunk_id": "0021700497_026", "order": 26, "role": "closing", "text": "More AP basketball: https://apnews.com/tag/NBAbasketball"}
