{"game_id": "0021301207", "chunk_id": "0021301207_001", "order": 1, "role": "lead", "text": "ATLANTA -- One team was motivated by the goal of dodging the Miami Heat in the first round of the playoffs. The other team's goal was resting its starters.\nThe result was predictable.\nChris Douglas-Roberts dribbled into the lane and sank a short jumper as time expired, and the Charlotte Bobcats overcame a 15-point deficit in the final period to beat the Atlanta Hawks 95-93 on Monday night.\nAl Jefferson had 27 points and 15 rebounds for Charlotte, which remained one game behind Washington in the race for the sixth spot in the Eastern Conference playoffs. Gary Neal had 17.\n\"Great shot,\" said Jefferson of Douglas-Robert's game-winner. \"Great play. Great finish. Great win.\"\nAdded Jefferson, referring to his role in the play: \"Great pick!\"\nJefferson's turnaround jumper gave the Bobcats a 93-91 lead before Lou Williams answered with a tying jumper for Atlanta with 2.6 seconds remaining.\nFollowing a timeout, Douglas-Roberts penetrated and lobbed the soft jumper as the buzzer sounded.\nBobcats coach Steve Clifford said Douglas-Roberts \"made a great shot.\"\nEven so, the coach wasn't satisfied, especially with his team's defense.\nCharlotte has won seven of eight, but Clifford isn't satisfied his team is playing at the level he wants for the playoffs.\n\"We didn't get the defense we needed out of the starters,\" Clifford said. \"The big thing is to be playing well, which we're not.\"\nThe Hawks rested starters Kyle Korver, Paul Millsap and DeMarre Carroll the full game, and also held out starters Jeff Teague and Pero Antic the final quarter when the Bobcats made their charge.\n\"Some of our young guys got great opportunities,\" Hawks coach Mike Budenholzer said. \"I think there's a lot to take from tonight.\"\nMike Scott led Atlanta with 20 points. Shelvin Mack and Williams each had 13, and Teague 11.\nThe Hawks' spot as the eighth seed in the Eastern Conference already was set, so Budenholzer was playing to protect his top players.\n\"I think when you're in our situation, health and all of those things are a priority,\" Budenholzer said.\nAdded veteran Elton Brand: \"We felt like we let it slip away, but guys got a lot of experience and that is important for us, too.\"\nBy contrast, Charlotte still had much to play for. The reward for sixth is avoiding Miami in the first round. Washington beat Miami 114-93 on Monday night to protect its lead over Charlotte in the race for sixth and secure first in the conference for Indiana. The Hawks will face the Pacers in the first round.\nDouglas-Roberts had five points as part of the Bobcats' productive bench.\n\"We have a job to do,\" Douglas-Roberts said. \"We did a great job of getting back into this game. Gary Neal and Luke Ridnour basically carried us up until that point. ... I feel like that's the least I can do to help these guys, the way they carried us the whole quarter.\"\nAtlanta led 50-44 at halftime and 80-65 entering the final period.\nThe Bobcats opened the fourth period with a 19-4 run, capped by 14 consecutive points, to pull even at 84. Ridnour had all of his 10 points in the run, including the tying jumper with 6:07 remaining.\nThree free throws by Neal gave Charlotte its first lead of the half at 87-86. The Bobcats led 91-86 before Mack's back-to-back baskets -- a 3-pointer and short jumper -- tied the game at 91.\nKemba Walker had five points and seven assists in his returned for the Bobcats after missing two games with a sore right groin.\nGame notes\nThe Bobcats salvaged one win in the four-game season series. ... Former Turner Entertainment Networks president Steve Koonin was introduced in the day as the Hawks' CEO and co-owner. Koonin will direct business operations and represent the owners in league meetings. ... Jefferson posted his eighth straight double-double. ... A young fan sitting on the front row and wearing a Hawks jersey was bowled over by Charlotte's Anthony Tolliver. The boy appeared to be shaken up but quickly regrouped as he received high-fives and fist-bumps from Hawks players. During a timeout minutes later, he was presented player-sized athletic shoes which were too big to remain in his lap."}
