{"game_id": "0021400971", "chunk_id": "0021400971_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- After yet another triple-double, Russell Westbrook was nitpicking.\nThe electric point guard collected his sixth triple-double in eight games and scored 15 of his 29 points in the fourth quarter, helping the Oklahoma City Thunder pull away for a 113-99 victory over the Minnesota Timberwolves on Friday night.\nHe also had eight turnovers, something he addressed unprompted after the game.\n\"I do know one thing, I need to stop turning the ball over, I can tell you that much,\" he said. \"It's frustrating trying to make passes and turning it over, but at the same time, we're winning. I'll go back to the drawing board and take care of it.\""}
{"game_id": "0021400971", "chunk_id": "0021400971_002", "order": 2, "role": "closing", "text": "All Thunder coach Scott Brooks sees is success.\n\"He is just displaying his all-around game and doing it at a consistent level,\" Brooks said. \"It seems like every night, he is right at those numbers, and those are signs of a very special player.\"\nWestbrook checked out with 2:13 remaining, seemingly a rebound short of the feat, but a scoring change gave him his 10th rebound to go with 12 assists.\nHe has eight triple-doubles this season and 16 in his career.\n\"I just take notes of what he's doing and what it takes to get to where he's at right now,\" said Minnesota rookie Andrew Wiggins, who scored 19 points. \"He works hard. He's competitive. He's a great player . I just truly watch him. He's always in attack mode. He never takes a play off. He's always improving his game.\"\nEnes Kanter had 23 points and 15 rebounds, while Dion Waiters and Mitch McGary added 12 points apiece for the Thunder.\nGorgui Dieng had 21 points and 14 rebounds, and Justin Hamilton had 17 points and 10 boards for the Timberwolves, who have lost seven of eight.\nMinnesota point guard Ricky Rubio left the game with an ankle injury in the third quarter and did not return.\nThe Timberwolves hung tough until the middle of the fourth quarter, when Westbrook's pullup 3-pointer gave the Thunder a 95-82 lead. Westbrook drained a long 3-pointer and was fouled, then made the free throw to give the Thunder a 106-90 advantage with 3:31 remaining.\nWestbrook was relatively quiet in the first half until his 32-footer as time expired in the first half gave the Thunder a 55-49 edge. Kanter had 13 points and 11 rebounds in the first half, while Dieng had 11 points and 10 rebounds for the Timberwolves.\nWestbrook got his 10th assist in the third quarter, and Kanter continued his strong play to help the Thunder take a 79-72 lead into the fourth. Westbrook went 5-for-7 from the field in the fourth to help the Thunder create distance.\n\"Overall, we did well (against Westbrook) until the end,\" Minnesota coach Flip Saunders said. \"I think we got tired, but he had 16 (actually 14) points going into the fourth quarter, and he has been getting 40, so you've got to feel pretty good about that. He had an impact on other parts of the game.\"\nTIP-INS\nTimberwolves: C Nikola Pekovic sat out with a sore right ankle. ... F Kevin Garnett missed the game with a sore knee. ... The Timberwolves had one assist as a team in the first quarter.\nThunder: F Serge Ibaka sat out with a sore right knee. ... McGary, a rookie, got his first career start in Ibaka's place. ... Waiters started in place of Kyle Singler, who had started all 10 games since he was acquired at the trade deadline.\nON THE RISE\nKanter had the most points and rebounds he's produced since the Thunder acquired him at the trade deadline.\nQUOTE OF THE NIGHT\nMcGary, on Kanter's success: \"He's an ox,\" he said. \"Tonight, I don't know what he had stat wise, but he's crashing the boards, he's finishing everything around the rim. He had a great game tonight.\"\nUP NEXT\nTimberwolves: At San Antonio on Sunday.\nThunder: Host Chicago on Sunday."}
