{"game_id": "0021300521", "chunk_id": "0021300521_001", "order": 1, "role": "lead", "text": "TORONTO --  Sloppy, selfish play in the second half of games is becoming a big problem for the Pistons."}
{"game_id": "0021300521", "chunk_id": "0021300521_002", "order": 2, "role": "body", "text": "The Raptors were more than happy to take advantage of Detroit's troubles."}
{"game_id": "0021300521", "chunk_id": "0021300521_003", "order": 3, "role": "body", "text": "Kyle Lowry had 21 points and nine assists, Jonas Valanciunas had 16 points and 11 rebounds, and Toronto beat Detroit 112-91 Wednesday night to hand the slumping Pistons their sixth consecutive loss."}
{"game_id": "0021300521", "chunk_id": "0021300521_004", "order": 4, "role": "body", "text": "\"My main focus and the thing I've been trying to preach the most is sacrificing for each other, being able to play unselfishly, hit the open man when he's open,\" Detroit's Josh Smith said. \"We just worry about playing together and not trying to figure out anything else, that's when our luck will start to change.\""}
{"game_id": "0021300521", "chunk_id": "0021300521_005", "order": 5, "role": "body", "text": "Until then, Pistons coach Maurice Cheeks acknowledged, the losing skid is \"testing our will a little bit.\""}
{"game_id": "0021300521", "chunk_id": "0021300521_006", "order": 6, "role": "body", "text": "\"We've just have to hang together and keep fighting and it will turn for us,\" Cheeks said."}
{"game_id": "0021300521", "chunk_id": "0021300521_007", "order": 7, "role": "body", "text": "DeMar DeRozan shook off a slow start to finish with 19 points and Terrence Ross had 17 for the Raptors, who went 31 for 34 from the free throw line to snap a two-game skid and win for the sixth time in eight games."}
{"game_id": "0021300521", "chunk_id": "0021300521_008", "order": 8, "role": "body", "text": "\"The defensive intensity is what changed the game in the second half,\" Raptors coach Dwane Casey said."}
{"game_id": "0021300521", "chunk_id": "0021300521_009", "order": 9, "role": "body", "text": "Amir Johnson had 10 points and 11 rebounds for Toronto, which leads the Atlantic Division."}
{"game_id": "0021300521", "chunk_id": "0021300521_010", "order": 10, "role": "body", "text": "Brandon Jennings had 22 points and Rodney Stuckey returned after missing the previous three games with a sore right shoulder to score 14 for Detroit, which has not won since a 115-92 victory at Cleveland on Dec. 23. The Pistons have dropped eight of nine overall."}
{"game_id": "0021300521", "chunk_id": "0021300521_011", "order": 11, "role": "body", "text": "\"The confidence is still there,\" Detroit's Greg Monroe said. \"Of course guys are upset, they're mad because we know we should be winning more games. We have to continue to work together to find a way to win.\""}
{"game_id": "0021300521", "chunk_id": "0021300521_012", "order": 12, "role": "body", "text": "Smith and Kentavious Caldwell-Pope had 13 apiece for the Pistons, while Monroe added 11 points and 11 rebounds."}
{"game_id": "0021300521", "chunk_id": "0021300521_013", "order": 13, "role": "body", "text": "Stuckey said poor play in the second half of games has been \"a killer\" for the Pistons."}
{"game_id": "0021300521", "chunk_id": "0021300521_014", "order": 14, "role": "body", "text": "\"We play phenomenal in the first half, but the second half comes around, we just stop playing basketball, stop sharing the ball, stop helping each other,\" Stuckey said."}
{"game_id": "0021300521", "chunk_id": "0021300521_015", "order": 15, "role": "body", "text": "Smith agreed that better teamwork is the key to altering Detroit's trajectory."}
{"game_id": "0021300521", "chunk_id": "0021300521_016", "order": 16, "role": "body", "text": "\"When we won games, we've helped each other out on the defensive end. It's because we played unselfishly and that's what we've got to get back to,\" Smith said."}
{"game_id": "0021300521", "chunk_id": "0021300521_017", "order": 17, "role": "body", "text": "DeRozan had nine points in a fourth quarter during which Toronto led by double digits throughout, rebounding after he missed all nine shots he took in the opening half."}
{"game_id": "0021300521", "chunk_id": "0021300521_018", "order": 18, "role": "body", "text": "\"Just being more aggressive, that was my goal,\" DeRozan said. \"I knew my shot wasn't falling for me, so I just tried to do other things, be aggressive and try to create for my teammates.\""}
{"game_id": "0021300521", "chunk_id": "0021300521_019", "order": 19, "role": "body", "text": "DeRozan made a season-high 13 free throws and matched his career-high with 16 attempts from the line. He was the only Raptors player to miss a free throw."}
{"game_id": "0021300521", "chunk_id": "0021300521_020", "order": 20, "role": "body", "text": "Monroe scored eight points in the first quarter and Caldwell-Pope and Smith each had six, but Ross scored 11 to give Toronto a 26-25 edge after one."}
{"game_id": "0021300521", "chunk_id": "0021300521_021", "order": 21, "role": "body", "text": "Caldwell-Pope and Jennings each had seven in the second as the Pistons answered a 13-2 Toronto run with a 14-0 spurt of their own to lead 54-50 at halftime."}
{"game_id": "0021300521", "chunk_id": "0021300521_022", "order": 22, "role": "body", "text": "The Raptors shot just 6 for 23 from the field in the second and 16 for 48 in the opening half, numbers that were dragged down by DeRozan (0 for 9) and Amir Johnson (0 for 7)."}
{"game_id": "0021300521", "chunk_id": "0021300521_023", "order": 23, "role": "body", "text": "Things went better for Toronto in the third. Ross sandwiched 3's around a layup by DeRozan as the Raptors took the lead by opening the quarter with an 8-0 run."}
{"game_id": "0021300521", "chunk_id": "0021300521_024", "order": 24, "role": "body", "text": "\"We never really recovered after that,\" Cheeks said."}
{"game_id": "0021300521", "chunk_id": "0021300521_025", "order": 25, "role": "body", "text": "Valanciunas scored eight points in the third, including three huge dunks, and DeRozan also had eight, as Toronto took an 84-74 lead into the fourth. Ross and Lowry both scored six for the Raptors, who shot 11 for 22 in the third and outscored Detroit 34-20."}
{"game_id": "0021300521", "chunk_id": "0021300521_026", "order": 26, "role": "closing", "text": "Game notes Raptors F Tyler Hansbrough (left ankle) missed his fourth straight game. ... Detroit G Chauncey Billups got the night off after playing eight minutes in Tuesday's loss at New York. ... Andre Drummond had 16 rebounds for the Pistons. ... Detroit made 19 of 35 free throw attempts. ... Toronto began a stretch that sees them play five of six at home."}
