{"game_id": "0021700839", "chunk_id": "0021700839_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY --  Paul George scored 33 points to help the Oklahoma City Thunder beat the Memphis Grizzlies 110-92 on Sunday night without fellow stars Russell Westbrook and Carmelo Anthony."}
{"game_id": "0021700839", "chunk_id": "0021700839_002", "order": 2, "role": "body", "text": "The All-Star forward carried more of the load than usual with Westbrook and Anthony sidelined. Westbrook missed the game with a sprained left ankle and Carmelo Anthony sat out with a sprained right ankle. George responded by making 10 of 24 shots and adding eight assists."}
{"game_id": "0021700839", "chunk_id": "0021700839_003", "order": 3, "role": "body", "text": "Alex Abrines scored 16 points and Raymond Felton, Jerami Grant and Patrick Patterson each added 14 for the Thunder. They had lost five of six and were falling in the Western Conference standings."}
{"game_id": "0021700839", "chunk_id": "0021700839_004", "order": 4, "role": "body", "text": "Marc Gasol scored 18 points, and JaMychal Green added 14 for the Grizzlies. They have lost six in a row."}
{"game_id": "0021700839", "chunk_id": "0021700839_005", "order": 5, "role": "body", "text": "The Thunder had one of their most productive offensive halves of the season to lead 74-54 at the break. George scored 22 points and Abrines added 16 as Oklahoma City shot 59 percent from the floor and made 12 of 17 3-pointers in the first half."}
{"game_id": "0021700839", "chunk_id": "0021700839_006", "order": 6, "role": "body", "text": "The Thunder bolted out of the gate with an 8-0 run to start the second half that included 3-pointers by George and Felton. Oklahoma City pushed its lead to 28 in the third quarter and took a 95-80 advantage into the fourth quarter. A lob from Felton for a dunk by rookie Terrance Ferguson pushed Oklahoma City's edge to 102-80."}
{"game_id": "0021700839", "chunk_id": "0021700839_008", "order": 8, "role": "body", "text": "Grizzlies: Missed all five of their 3-point shots in the first quarter and made just 6 for 28 on the night. ... G Mario Chalmers was issued a technical in the first quarter. ... G Andrew Harrison picked up his third foul with 8:43 left in the second quarter. ... F Dillon Brooks was called for a Flagrant 1 for elbowing Thunder G Josh Huestis in the second quarter."}
{"game_id": "0021700839", "chunk_id": "0021700839_009", "order": 9, "role": "body", "text": "Thunder: Had just three turnovers in the first half and 10 overall. ... Scored 74 points in the first half, but just four on fast breaks. ... Abrines started in place of Huestis, who had started the previous two games. Oklahoma City is still trying to figure out who will fill the void left by G Andre Roberson, who recently had season-ending left patellar tendon surgery."}
{"game_id": "0021700839", "chunk_id": "0021700839_011", "order": 11, "role": "body", "text": "Grizzlies: Host the Thunder on Wednesday night."}
{"game_id": "0021700839", "chunk_id": "0021700839_012", "order": 12, "role": "body", "text": "Thunder: Host Cleveland on Tuesday night."}
{"game_id": "0021700839", "chunk_id": "0021700839_014", "order": 14, "role": "closing", "text": "More NBA basketball: https://apnews.com/tag/NBAbasketball"}
