{"game_id": "0021300545", "chunk_id": "0021300545_001", "order": 1, "role": "lead", "text": "AUBURN HILLS, Mich. --  Josh Smith was annoyed with himself earlier in the week, when his jumper with the game on the line missed badly and Detroit went on to lose to the New York Knicks."}
{"game_id": "0021300545", "chunk_id": "0021300545_002", "order": 2, "role": "body", "text": "So when Smith had the ball in the final seconds again Saturday night, he went straight to the basket."}
{"game_id": "0021300545", "chunk_id": "0021300545_003", "order": 3, "role": "body", "text": "\"I wanted to be aggressive,\" Smith said. \"When I caught it, I didn't want to settle.\""}
{"game_id": "0021300545", "chunk_id": "0021300545_004", "order": 4, "role": "body", "text": "Smith's driving, left-handed bank shot with 1.2 seconds left gave the Pistons a 110-108 win over the Phoenix Suns on Saturday night. Smith finished with 25 points and 11 rebounds, and Brandon Jennings had 18 assists, the most in the NBA this season, to go with eight points and eight rebounds."}
{"game_id": "0021300545", "chunk_id": "0021300545_005", "order": 5, "role": "body", "text": "Smith was involved in a few big plays in the final half-minute -- both good and bad. His 3-pointer as the shot clock expired put Detroit ahead 108-105 with 26.8 seconds left. Then he fouled Gerald Green while the Phoenix guard was shooting a 3-pointer. Green made all three free throws to tie it with 4.3 seconds remaining."}
{"game_id": "0021300545", "chunk_id": "0021300545_006", "order": 6, "role": "body", "text": "The ensuing inbounds pass went to Smith near the top of the key. He drove to the right and then switched hands, making a tough shot while being tightly defended by Channing Frye."}
{"game_id": "0021300545", "chunk_id": "0021300545_007", "order": 7, "role": "body", "text": "Green's 3-pointer at the buzzer from in front of the Detroit bench missed badly."}
{"game_id": "0021300545", "chunk_id": "0021300545_008", "order": 8, "role": "body", "text": "\"This is a great game for us, to be able to see how mentally strong we can be,\" Smith said. \"We've just got to be able to reflect on these games and apply it to the games that we have in front of us.\""}
{"game_id": "0021300545", "chunk_id": "0021300545_009", "order": 9, "role": "body", "text": "Frye led Phoenix with 21 points."}
{"game_id": "0021300545", "chunk_id": "0021300545_010", "order": 10, "role": "body", "text": "The Suns tied the game with a 13-3 run to start the fourth quarter, but Detroit responded with a 7-0 run. It was 105-97 before Phoenix scored eight straight points, tying it on a 3-pointer by P.J. Tucker with 51.2 seconds left."}
{"game_id": "0021300545", "chunk_id": "0021300545_011", "order": 11, "role": "body", "text": "\"We had one game this year where we came from 21 back, and we usually fight hard,\" Tucker said."}
{"game_id": "0021300545", "chunk_id": "0021300545_012", "order": 12, "role": "body", "text": "The Pistons barely got a shot off on their next possession, but Smith was able to free himself on the left wing and connect from 3-point range."}
{"game_id": "0021300545", "chunk_id": "0021300545_013", "order": 13, "role": "body", "text": "It was his first of two big shots at the end."}
{"game_id": "0021300545", "chunk_id": "0021300545_014", "order": 14, "role": "body", "text": "\"Those were two tough shots that Josh made,\" Suns coach Jeff Hornacek said. \"We let him get to the basket at the end, but he was going in the wrong direction and still knocked that down. Before that, we play great defense, they lose the ball and they manage to bat it out to him and he hits the 3. That's just a bad break for us.\""}
{"game_id": "0021300545", "chunk_id": "0021300545_015", "order": 15, "role": "body", "text": "Jennings equaled team records held by Isiah Thomas with 11 assists in the first quarter and 16 in the first half."}
{"game_id": "0021300545", "chunk_id": "0021300545_016", "order": 16, "role": "body", "text": "But Jennings didn't have any points, rebounds or assists in the fourth quarter. Backup Will Bynum picked up the slack a bit, scoring eight of his 16 points in the final period."}
{"game_id": "0021300545", "chunk_id": "0021300545_017", "order": 17, "role": "body", "text": "\"Sometimes in those fourth quarters Brandon was alone out there as far as creating and that's kind of tough on him,\" Bynum said. \"So when we're out there we help him out a lot and that spreads the court out.\""}
{"game_id": "0021300545", "chunk_id": "0021300545_018", "order": 18, "role": "body", "text": "Detroit has been a disappointment after signing Smith and trading for Jennings in the offseason, but those two looked sharp for most of the night Saturday. In the first quarter, the Pistons looked as smooth and cohesive as they have all season, repeatedly beating the transition-oriented Suns down the court for easy baskets."}
{"game_id": "0021300545", "chunk_id": "0021300545_019", "order": 19, "role": "body", "text": "Jennings tossed an alley-oop off the backboard to Andre Drummond for a 12-3 lead, and later in the quarter his alley-oop to Smith gave him 10 assists. Jennings then found Kyle Singler for a dunk that made it 35-19."}
{"game_id": "0021300545", "chunk_id": "0021300545_020", "order": 20, "role": "body", "text": "The Pistons finished the quarter with 16 assists on 17 field goals -- and a 35-21 lead."}
{"game_id": "0021300545", "chunk_id": "0021300545_021", "order": 21, "role": "body", "text": "Even when Jennings shot an airball at the end of the second quarter Drummond was there to tip it in at the buzzer for a 64-51 lead. Detroit had 50 points in the paint in the first half. The Pistons finished with 68."}
{"game_id": "0021300545", "chunk_id": "0021300545_022", "order": 22, "role": "body", "text": "The last player with 16 assists in a half was Jason Kidd, who did it April 5, 2009, for Dallas, according to STATS. That was also against Phoenix."}
{"game_id": "0021300545", "chunk_id": "0021300545_023", "order": 23, "role": "body", "text": "The last player with at least 11 assists in a quarter was Steve Blake, who had 14 for Portland in 2009."}
{"game_id": "0021300545", "chunk_id": "0021300545_024", "order": 24, "role": "body", "text": "Phoenix was without guard Eric Bledsoe, who had surgery Friday on his right knee."}
{"game_id": "0021300545", "chunk_id": "0021300545_025", "order": 25, "role": "closing", "text": "Game notes Thomas had 16 assists in a half against Dallas on Feb. 13, 1985. He tied the team record with 25 assists in that game. He twice reached 11 assists in a quarter. ... Ty Lawson, Kendall Marshall and Chris Paul (twice) have all had 17-assist games this season. Jennings surpassed that before the end of the third quarter."}
