{"game_id": "0021700362", "chunk_id": "0021700362_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  Karl-Anthony Towns and the Minnesota Timberwolves were challenged by the Los Angeles Clippers in the fourth quarter."}
{"game_id": "0021700362", "chunk_id": "0021700362_003", "order": 3, "role": "body", "text": "Towns had 21 points, 12 rebounds and four blocked shots, and the Timberwolves edged the sliding Clippers 113-107 on Wednesday night."}
{"game_id": "0021700362", "chunk_id": "0021700362_004", "order": 4, "role": "body", "text": "Minnesota, which recently blew a couple of double-digit leads, went up by 19 early in the third quarter. The Clippers pulled within four in the fourth, but the Timberwolves responded."}
{"game_id": "0021700362", "chunk_id": "0021700362_005", "order": 5, "role": "body", "text": "\"Obviously you don't want to see a lead like we had go away that way,\" Towns said. \"We knew we needed to stop the bleeding as soon as possible. We did a great job of staying at an eight-point lead and taming them down and stalemating it.\""}
{"game_id": "0021700362", "chunk_id": "0021700362_006", "order": 6, "role": "body", "text": "Jimmy Butler and Jeff Teague each scored 19 points for the Timberwolves (15-11), who placed six players in double figures. Andrew Wiggins and Taj Gibson had 16 apiece, and Jamal Crawford finished with 11 points."}
{"game_id": "0021700362", "chunk_id": "0021700362_007", "order": 7, "role": "body", "text": "\"They kept coming, and because of the way they can score, you are always concerned,\" Timberwolves coach Tom Thibodeau said. \"Just finding a way to win was probably the most important thing.\""}
{"game_id": "0021700362", "chunk_id": "0021700362_008", "order": 8, "role": "body", "text": "Los Angeles dropped its fourth straight game despite an impressive performance by DeAndre Jordan, who had 18 points and 21 rebounds. Lou Williams and Austin Rivers each scored 23 points for the Clippers (8-15)."}
{"game_id": "0021700362", "chunk_id": "0021700362_009", "order": 9, "role": "body", "text": "\"It's very difficult,\" Rivers said. \"It's frustrating. Nobody likes to lose. We're losing a lot of games.\""}
{"game_id": "0021700362", "chunk_id": "0021700362_010", "order": 10, "role": "body", "text": "Danilo Gallinari returned for Los Angeles and scored seven points on 2-for-13 shooting. Gallinari had been sidelined since Nov. 5 due to a glute injury."}
{"game_id": "0021700362", "chunk_id": "0021700362_012", "order": 12, "role": "body", "text": "Timberwolves: F Nemanja Bjelica remained out with a sprained left foot. He has missed eight straight games. ... Wednesday marked Crawford's first game back at Staples Center since leaving the Clippers. Said Crawford: \"You see these people every day for five years. It's just weird. Some of those relationships will last a lifetime.\""}
{"game_id": "0021700362", "chunk_id": "0021700362_013", "order": 13, "role": "body", "text": "Clippers: G Milos Teodosic (plantar fascia) remained out, but coach Doc Rivers said he is close to returning."}
{"game_id": "0021700362", "chunk_id": "0021700362_015", "order": 15, "role": "body", "text": "Gallinari had only two rebounds and no assists in 26 minutes."}
{"game_id": "0021700362", "chunk_id": "0021700362_016", "order": 16, "role": "body", "text": "\"I wanted to be better,\" he said. \"I didn't expect to shoot the ball that bad. I was expecting to be better already, but I wasn't. I'll be better next game.\""}
{"game_id": "0021700362", "chunk_id": "0021700362_018", "order": 18, "role": "body", "text": "Timberwolves: Open a five-game homestand Sunday night against Dallas. Minnesota has won its last three against the Mavs."}
{"game_id": "0021700362", "chunk_id": "0021700362_019", "order": 19, "role": "body", "text": "Clippers: Host Washington on Saturday."}
{"game_id": "0021700362", "chunk_id": "0021700362_021", "order": 21, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
