{"game_id": "0021701209", "chunk_id": "0021701209_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS --  The Minnesota Timberwolves picked up another important win to keep pace in this relentless Western Conference race."}
{"game_id": "0021701209", "chunk_id": "0021701209_002", "order": 2, "role": "body", "text": "Their quest to end the franchise's 14-year absence from the playoffs still isn't finished."}
{"game_id": "0021701209", "chunk_id": "0021701209_003", "order": 3, "role": "body", "text": "Karl-Anthony Towns slammed his way to 24 points and grabbed 18 rebounds for the Timberwolves, who toughed out a 113-94 victory over the Memphis Grizzlies on Monday night to move one step closer to the postseason."}
{"game_id": "0021701209", "chunk_id": "0021701209_004", "order": 4, "role": "body", "text": "\"We had to play as if we had that kind of desperation in us,\" said Towns, who had five dunks to help ignite the crowd."}
{"game_id": "0021701209", "chunk_id": "0021701209_005", "order": 5, "role": "body", "text": "They haven't always displayed that attitude down the stretch, which is why they weren't able to clinch that long-sought spot before their 82nd game. They'll have to beat surging Denver on Wednesday night to get in, because the Nuggets won their sixth straight game to stay tied with the Wolves in eighth place. Denver's victory over Portland ended about an hour after Minnesota's, but the players expressed nonchalance about following along as they left the arena."}
{"game_id": "0021701209", "chunk_id": "0021701209_006", "order": 6, "role": "body", "text": "\"I'm not going to check my phone. I'm going to go eat,\" Jimmy Butler said wryly, after scoring 15 points in 23 minutes, his second game back from the knee injury."}
{"game_id": "0021701209", "chunk_id": "0021701209_007", "order": 7, "role": "body", "text": "Jeff Teague added 24 points for the Timberwolves, who trailed by 10 points early before taking over against a depleted Grizzlies team that beat them 101-93 exactly two weeks ago in one of their worst losses of the season."}
{"game_id": "0021701209", "chunk_id": "0021701209_008", "order": 8, "role": "body", "text": "Teague missed six of his first eight shots, but he helped the Wolves pull away with a four-point play in the early portion of the third quarter. His lob found Andrew Wiggins for a soaring dunk about three minutes later. Gorgui Dieng sank his second 3-pointer of the night soon after for a 75-63 lead. Butler gave the Wolves a 98-83 lead midway through the fourth quarter with a hustle to finish a fast break with a layup."}
{"game_id": "0021701209", "chunk_id": "0021701209_009", "order": 9, "role": "body", "text": "The Wolves brought energy and crisp ball movement, but they clearly carried some pressure with them during an ugly start filled with turnovers and misfires. They made only four of their first 16 shots from the field, and boos circulated in the arena as Omari Johnson's jumper put the Grizzles in front 24-14. Butler missed a short bank shot as he was fouled and bricked the first free throw, too, causing him to growl in disgust as he reached the bench early in the second quarter."}
{"game_id": "0021701209", "chunk_id": "0021701209_010", "order": 10, "role": "body", "text": "The Wolves, though, used a 20-4 run to lighten the mood a little in the arena. Derrick Rose (13 points), Dieng (11 points) and Tyus Jones (eight points) combined to produce a solid output from the second unit."}
{"game_id": "0021701209", "chunk_id": "0021701209_011", "order": 11, "role": "body", "text": "\"We were just playing soft. We tend to do that from time to time,\" Butler said. \"Whenever we play hard, a lot of good things happen.\""}
{"game_id": "0021701209", "chunk_id": "0021701209_013", "order": 13, "role": "body", "text": "The Wolves lost power forward Taj Gibson in the first quarter to a neck injury he suffered in the previous game and tried to play through. He left for the locker room without returning to the bench."}
{"game_id": "0021701209", "chunk_id": "0021701209_014", "order": 14, "role": "body", "text": "\"It's tough when you can't even turn your neck from right to left when you look around,\" Gibson said. \"Just try to get as much treatment as possible.\""}
{"game_id": "0021701209", "chunk_id": "0021701209_016", "order": 16, "role": "body", "text": "Ben McLemore had 18 points for the Grizzlies, who moved one loss closer to a prime lottery pick and fell to 6-34 on the road."}
{"game_id": "0021701209", "chunk_id": "0021701209_017", "order": 17, "role": "body", "text": "The Grizzlies, whose streak of seven straight postseason appearances was snapped long ago, were sapped by the summer departures of stalwarts Zach Randolph, Tony Allen and Vince Carter. Mike Conley, Tyreke Evans and Chandler Parsons have missed a combined 143 games. Even Marc Gasol, who bested Towns for 20 points and 10 rebounds in the last matchup, sat out to rest. The starting lineup for this game had only one holdover, Dillon Brooks, from the March 26 meeting."}
{"game_id": "0021701209", "chunk_id": "0021701209_018", "order": 18, "role": "body", "text": "The Grizzlies would match the franchise's worst record (22-60) since the move to Memphis if they lose their final game."}
{"game_id": "0021701209", "chunk_id": "0021701209_019", "order": 19, "role": "body", "text": "\"It's disrespectful to say that guys are tanking and trying to lose, because those guys that are on the floor every night have something to prove,\" interim coach J.B. Bickerstaff said, adding: \"Every single night they're giving their best effort. So you've got to give the guys that are out there on the court more respect than I think people give them credit for.\""}
{"game_id": "0021701209", "chunk_id": "0021701209_021", "order": 21, "role": "body", "text": "Grizzlies: MarShon Brooks, who averaged nearly 24 points over his first five games with the team since joining last month fresh from the Chinese league, missed 12 of 16 shots against tough defense from Butler and finished with 14 points."}
{"game_id": "0021701209", "chunk_id": "0021701209_022", "order": 22, "role": "body", "text": "\"Just going out there playing hard, making them work for everything,\" Brooks said."}
{"game_id": "0021701209", "chunk_id": "0021701209_023", "order": 23, "role": "body", "text": "Timberwolves: Backup center Cole Aldrich, who has logged just 49 minutes all season, was honored before the game with the Flip Saunders Legacy Award for community service in honor of the team's late executive and coach. Aldrich had an assist in the final minute."}
{"game_id": "0021701209", "chunk_id": "0021701209_025", "order": 25, "role": "body", "text": "Grizzlies: Play at Oklahoma City on Wednesday to wrap up the franchise's 23rd season, the 17th in Memphis."}
{"game_id": "0021701209", "chunk_id": "0021701209_026", "order": 26, "role": "body", "text": "Timberwolves: Take on Denver on Wednesday, after losing 100-96 on the road last week."}
{"game_id": "0021701209", "chunk_id": "0021701209_028", "order": 28, "role": "closing", "text": "For more AP NBA coverage: https://apnews.com/tag/NBAbasketball"}
