{"game_id": "0021300891", "chunk_id": "0021300891_001", "order": 1, "role": "lead", "text": "NEW YORK -- Jason Collins started walking from the bench to the scorer's table, fans rising out of their seats all around Barclays Center.\nHe committed a foul five seconds after entering. His only shot barely hit the rim.\nCollins' performance may not have been pretty, but everything else was great."}
{"game_id": "0021300891", "chunk_id": "0021300891_002", "order": 2, "role": "closing", "text": "Collins played the final minutes of a winning home debut with the Brooklyn Nets, who cooled off the Chicago Bulls with a 96-80 victory Monday night.\n\"It was cool. It was a lot of fun to go into the game,\" Collins said. \"The most important thing was that we got the win. Chicago's been playing really well as of late and for us to come out and really be -- I think we played more physical than they did tonight.\"\nFinally playing at home more than a week after returning to the NBA as the league's first openly gay player, Collins checked in to a standing ovation from a sellout crowd of 17,732 that included former NBA commissioner David Stern with 2:41 remaining. He grabbed a rebound and had one of the Nets' NBA season high-tying 19 steals in their third straight victory.\nDeron Williams scored 20 points and Joe Johnson had 19 for the Nets (29-29), who got back to .500 for the first time since they were 2-2 after beating Utah on Nov. 5.\nD.J. Augustin scored 16 points off the bench for the sloppy Bulls, who turned it over 28 times, leading to 30 Nets points, and had their four-game winning streak snapped.\nThe Bulls had a franchise-low three turnovers in their 109-90 victory over the New York Knicks on Sunday and had won nine of 10.\nBut the Nets were too good in this one, building a series of comfortable leads and making the only intrigue down the stretch whether Collins would get in during his first home appearance for the Nets since Jan. 29, 2008, against Milwaukee in East Rutherford, N.J.\nA chant of \"Jason Collins! Jason Collins!\" broke out while Williams was shooting a free throw with the Nets leading 90-73 with 3:27 remaining. Fans finally got their wish less than a minute later -- though not because coach Jason Kidd was listening to them.\n\"No, the game was out of hand, so I wanted to get those guys some rest,\" he said. \"D-Will was shooting free throws. Couldn't put Twin in at that time, so I told him after the free throws that he would come in.\"\nCollins' original 10-day contract will expire Tuesday and the Nets plan to sign him to a second deal on Wednesday. A Nets player from 2001-08, he has appeared in all five games since he signed on Feb. 23.\nPaul Pierce and Shaun Livingston each scored 14 points for the Nets, who were without starting center Kevin Garnett for a second straight game because of back spasms.\n\"Mentally, the Bulls have really had our numbers,\" Pierce said. \"To be honest, if I was them I'd feel like when they come play the Nets, they feel like they could beat us every time. I think the guys really had pride tonight to say, `You know we're tired of getting pushed around by the Bulls.\"\nJoakim Noah managed just 10 points, six rebounds and one assist for the Bulls, a day after finishing with 13 points, 14 assists and 12 rebounds in his fifth career triple-double. The All-Star center rolled his right ankle early in the second half of that game and said it hurt after the game, but he was determined to play Monday in his hometown.\nThe Bulls had dominated the first two meetings and beaten the Nets four straight times, but Brooklyn controlled this one most of the way in improving to 12-2 at home since Chicago's rout here on Christmas Day.\n\"We smashed them in the mouth twice, it's never going to be easy to come in to tough-minded team and do it again,\" Bulls forward Taj Gibson said.\nThe Nets scored the first eight points, the last one on Williams' free throw after Bulls coach Tom Thibodeau screamed his way to a technical foul after calling time. Their lead grew to 15, but the Bulls trimmed it to 27-18 by the end of the first quarter.\nBrooklyn led 50-42 at halftime, and Chicago started the second half just as bad as the first. The Nets scored the first seven to take a 57-42 lead when Williams set up Mason Plumlee for a dunk.\n\"I think we had all intentions to play hard, but like I say, it didn't show,\" Augustin said. \"Being down early, you can't come start the game down, you can't start the second half down, so that was our big mistakes, and then the turnovers killed us.\"\nGame notes\nThe Nets' 19 steals were their most since finishing with 20 against Indiana on March 21, 1989. ... Brooklyn hadn't scored more than 23 points in a period against Chicago this season and surpassed that in both the first (27) and third (26)."}
