{"game_id": "0021400160", "chunk_id": "0021400160_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  Solomon Hill saw Rodney Stuckey with the ball and knew where he had to be."}
{"game_id": "0021400160", "chunk_id": "0021400160_002", "order": 2, "role": "body", "text": "Hill got to the right spot and tipped in Stuckey's shot with 0.7 seconds remaining, giving the Indiana Pacers an 88-86 victory over the Charlotte Hornets on Wednesday night."}
{"game_id": "0021400160", "chunk_id": "0021400160_003", "order": 3, "role": "body", "text": "With 3 seconds remaining Stuckey's 17-foot jumper was tipped by former Pacer Lance Stephenson and the ball sailed to the left of the rim. Hill came from underneath Indiana's basket and tipped the ball in."}
{"game_id": "0021400160", "chunk_id": "0021400160_004", "order": 4, "role": "body", "text": "\"Once I knew Stuck was taking it, I just wanted to get as close as possible to the rim and have a chance for a tip-in,\" Hill said. \"Usually in a situation like that, everybody's kind of ball-watching It's the last shot of the game, a potential game-winner. Guys turned their head, and I took advantage.\""}
{"game_id": "0021400160", "chunk_id": "0021400160_005", "order": 5, "role": "body", "text": "Hill finished with six points. Roy Hibbert had 18 points and 11 rebounds, and Luis Scola had 15 points and seven rebounds. Donald Sloan added 11 points, nine rebounds and six assists while Stuckey scored 11 points off the bench for the Pacers."}
{"game_id": "0021400160", "chunk_id": "0021400160_006", "order": 6, "role": "body", "text": "What I was proud of in a game like this, we were shooting horribly, but we found a way to do other things,\" Pacers coach Frank Vogel said. \"(We) found a way to win.\""}
{"game_id": "0021400160", "chunk_id": "0021400160_007", "order": 7, "role": "body", "text": "Indiana spoiled Stephenson's first trip back to Indianapolis after he signed with Charlotte during free agency in July."}
{"game_id": "0021400160", "chunk_id": "0021400160_008", "order": 8, "role": "body", "text": "Indiana was leading 17-10 in the first quarter when the Hornets went on a 28-8 run over an eight-minute span. But Indiana closed the deficit to six points at halftime, trailing 49-43."}
{"game_id": "0021400160", "chunk_id": "0021400160_009", "order": 9, "role": "body", "text": "Indiana trailed by one heading into the fourth quarter. The Pacers stayed ahead of Charlotte by two or four points for most of the fourth quarter until the Hornets tied it with under a minute left."}
{"game_id": "0021400160", "chunk_id": "0021400160_010", "order": 10, "role": "body", "text": "Despite injuries, Indiana is gaining momentum. It has won two consecutive games over Eastern Conference opponents. It was the seventh time in 12 games Hibbert finished with double digits in scoring and he had his fourth double-double of the season. He also added two blocks."}
{"game_id": "0021400160", "chunk_id": "0021400160_011", "order": 11, "role": "body", "text": "Pacers fans welcomed back Stephenson with a mixture of cheers and boos when he was introduced, but every time Stephenson touched the ball he was booed. It was the fifth time in seven games Stephenson finished in double figures in scoring."}
{"game_id": "0021400160", "chunk_id": "0021400160_012", "order": 12, "role": "body", "text": "\"It was emotional,\" Stephenson said. \"Seeing my old teammates, seeing the fans, and seeing the people I normally see when I come into the building. (My) Introduction was good, but I knew that once the game started they'd be booing me, and they did.\""}
{"game_id": "0021400160", "chunk_id": "0021400160_013", "order": 13, "role": "body", "text": "Stephenson had 10 points, eight rebounds and seven assists. Al Jefferson added 28 points and eight rebounds. Kemba Walker was the only other Hornet in double figures with 12 points."}
{"game_id": "0021400160", "chunk_id": "0021400160_014", "order": 14, "role": "body", "text": "Former Indiana Hoosier, Cody Zeller, didn't have an ideal homecoming, either. Zeller scored just seven points in 21 minutes."}
{"game_id": "0021400160", "chunk_id": "0021400160_015", "order": 15, "role": "body", "text": "Indiana's David West remained inactive with a right ankle sprain while George Hill was also still out with a left knee contusion."}
{"game_id": "0021400160", "chunk_id": "0021400160_017", "order": 17, "role": "body", "text": "Hornets: Al Jefferson scored in double figures for the first time since snapping a 35-game streak of scoring double figures Monday night. ... Gerald Henderson was held scoreless for the fourth time this season."}
{"game_id": "0021400160", "chunk_id": "0021400160_018", "order": 18, "role": "body", "text": "Pacers: Roy Hibbert is second in blocked shots in the NBA with 37. ... The Pacers have outrebounded 10 of their 12 opponents this season . Indiana has won 10 straight home meetings over Charlotte."}
{"game_id": "0021400160", "chunk_id": "0021400160_020", "order": 20, "role": "body", "text": "Pacers: hosts Phoenix on Saturday."}
{"game_id": "0021400160", "chunk_id": "0021400160_021", "order": 21, "role": "closing", "text": "Hornets: plays at Orlando on Friday."}
