{"game_id": "0021700271", "chunk_id": "0021700271_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS --  When Victor Oladipo went out, Lance Stephenson stepped up."}
{"game_id": "0021700271", "chunk_id": "0021700271_002", "order": 2, "role": "body", "text": "Stephenson scored 13 of his 18 points in the fourth quarter to help the Indiana Pacers win their fifth straight, 107-104 over the Toronto Raptors on Friday night."}
{"game_id": "0021700271", "chunk_id": "0021700271_003", "order": 3, "role": "body", "text": "Oladipo scored a team-high 21 points before exiting the game with a knee injury midway through the fourth quarter. He entered the game as Indiana's leading scorer with 22.9 points per game. Stephenson averaged 6.2 points through the first month of the season,"}
{"game_id": "0021700271", "chunk_id": "0021700271_004", "order": 4, "role": "body", "text": "\"It worked out,\" Indiana coach Nate McMillan said of the impromptu substitution. \"Victor's knee was bothering him and Lance was playing well. Victor wanted to go back in but he didn't seem confident. He was feeling soreness and wanted to give it a try, but Lance was playing good basketball so I decided to make that decision for him and stay with Lance.\""}
{"game_id": "0021700271", "chunk_id": "0021700271_005", "order": 5, "role": "body", "text": "Stephenson played sparingly throughout the first three quarters, but was extremely efficient, shooting 7 for 9 from the field, including 4 for 4 from 3-point range. He hit back-to-back 3-pointers to give Indiana a 103-92 lead with 4:06 remaining."}
{"game_id": "0021700271", "chunk_id": "0021700271_006", "order": 6, "role": "body", "text": "\"Whatever the coach calls me to do, I am ready for the mission,\" Stephenson said. \"That's just being ready ... Just being patient and being ready at all times. Just be that spark off the bench.\""}
{"game_id": "0021700271", "chunk_id": "0021700271_007", "order": 7, "role": "body", "text": "Indiana outscored the Raptors 31-20 in the third quarter to take a one-point lead, and Stephenson took over from there. He connected on six of his final seven field goal attempts, including the back-to-back 3-pointers, which electrified the home crowd and gave Indiana its largest lead of the half."}
{"game_id": "0021700271", "chunk_id": "0021700271_008", "order": 8, "role": "body", "text": "\"I get my energy from the crowd,\" Stephenson said. \"When the crowd tells me `let's go, get it going,' I just feel like the power is in me.\""}
{"game_id": "0021700271", "chunk_id": "0021700271_009", "order": 9, "role": "body", "text": "Kyle Lowry scored 12 of his 24 points in the second quarter as Toronto outscored Indiana 35-21, giving the Raptors a 60-50 halftime lead."}
{"game_id": "0021700271", "chunk_id": "0021700271_010", "order": 10, "role": "body", "text": "Toronto coach Dwane Casey criticized the Raptors' slow start to the second half, which has plagued the team in recent weeks."}
{"game_id": "0021700271", "chunk_id": "0021700271_011", "order": 11, "role": "body", "text": "\"The third quarter has been our Achilles heel and it was again tonight,\" Casey said. \"We have to figure out something to get started again. We played too well in the first half to not sustain it and for whatever reason we come out with that approach like we think the game is over and we can't do that.\""}
{"game_id": "0021700271", "chunk_id": "0021700271_012", "order": 12, "role": "body", "text": "Toronto had a chance to tie after Myles Turner missed the second of two free throw attempts with six seconds remaining, but Fred VanVleet's 3-pointer at the buzzer clanked off the backboard."}
{"game_id": "0021700271", "chunk_id": "0021700271_013", "order": 13, "role": "body", "text": "Turner finished seven points and a team-best 10 rebounds, and VanVleet had a career-high 16 points to go with five rebounds and four assists in 29 minutes off the bench."}
{"game_id": "0021700271", "chunk_id": "0021700271_014", "order": 14, "role": "body", "text": "Indiana opened the game shooting 9 for 13 from the field, including 5 for 8 from 3-point range, but a string of turnovers and poor transition defense allowed Toronto to close the quarter on an 11-2 run."}
{"game_id": "0021700271", "chunk_id": "0021700271_015", "order": 15, "role": "body", "text": "Bojan Bogdonavic added 19 points for Indiana, which had six players reach double figures."}
{"game_id": "0021700271", "chunk_id": "0021700271_017", "order": 17, "role": "body", "text": "Raptors: Forward CJ Miles did not travel with the team after his wife gave birth to a girl Thursday evening. ... Toronto outrebounded Indiana 42-41 and shot nearly 50 percent from the field, but struggled from 3-point range, making just 9 of 30 attempts..."}
{"game_id": "0021700271", "chunk_id": "0021700271_018", "order": 18, "role": "body", "text": "Pacers: Indiana entered the game leading the NBA in 3-point percentage, shooting 40.4 percent from behind the arc. ... Domantis Sobonis added 13 points and six rebounds despite a poor shooting night. Sabonis shot just 2 for 10 from the field, but was 9 for 12 from the free throw line. ... Indiana improved to 9-2 when making at least 10 3-pointers. The Pacers were 11 for 26 behind the arc."}
{"game_id": "0021700271", "chunk_id": "0021700271_020", "order": 20, "role": "body", "text": "Raptors: Close out a three-game road trip at Atlanta on Saturday."}
{"game_id": "0021700271", "chunk_id": "0021700271_021", "order": 21, "role": "closing", "text": "Pacers: Host Boston on Saturday."}
