{"game_id": "0021401172", "chunk_id": "0021401172_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. --  All the Trail Blazers can do is try to win their final four games. The playoffs will sort themselves out, coach Terry Stotts said."}
{"game_id": "0021401172", "chunk_id": "0021401172_002", "order": 2, "role": "body", "text": "\"What will be will be,\" Stotts said following Portland's 116-91 rout of the Minnesota Timberwolves on Wednesday night."}
{"game_id": "0021401172", "chunk_id": "0021401172_003", "order": 3, "role": "body", "text": "Portland has already captured the Northwest Division title but continue to battle for home-court advantage in the playoffs. They sit 1 1/2 games behind the Clippers and the Spurs for fourth place in the conference standings, and the four teams with the best records get home-court advantage."}
{"game_id": "0021401172", "chunk_id": "0021401172_004", "order": 4, "role": "body", "text": "\"We know that the more games we win we give ourselves a better chance of having home court, so we wanted to come out and attack the game,\" said Damian Lillard, who finished with 17 points. \"I thought we did a great job of that.\""}
{"game_id": "0021401172", "chunk_id": "0021401172_005", "order": 5, "role": "body", "text": "LaMarcus Aldridge led the Blazers with 24 points and 13 rebounds before sitting out the fourth quarter. Robin Lopez added 18 points."}
{"game_id": "0021401172", "chunk_id": "0021401172_006", "order": 6, "role": "body", "text": "Andrew Wiggins had 29 points for the injury-depleted Timberwolves, who have lost eight straight and remain in the basement of the Western Conference."}
{"game_id": "0021401172", "chunk_id": "0021401172_007", "order": 7, "role": "body", "text": "Portland led by as many as 28 points and the Timberwolves, with just nine players available and playing the second of back-to-back games, were simply overwhelmed."}
{"game_id": "0021401172", "chunk_id": "0021401172_008", "order": 8, "role": "body", "text": "\"They've got a lot of depth, we don't have much depth, so it was a combination of things,\" Minnesota coach Flip Saunders said. \"We couldn't withstand when they had runs.\""}
{"game_id": "0021401172", "chunk_id": "0021401172_009", "order": 9, "role": "body", "text": "Portland had rested Aldridge, Nicolas Batum and Chris Kaman on Monday at Brooklyn, where it lost 106-96. It was a one-game East Coast road trip to make up a game originally for Jan. 26 that was postponed by bad weather."}
{"game_id": "0021401172", "chunk_id": "0021401172_010", "order": 10, "role": "body", "text": "Minnesota was coming off a 111-116 loss at Sacramento on Tuesday."}
{"game_id": "0021401172", "chunk_id": "0021401172_011", "order": 11, "role": "body", "text": "The Timberwolves had a long list of inactives for the game, including center Gorgui Dieng, guard Ricky Rubio, guard Gary Neal, center Nikola Pekovic, forward Shabazz Muhammad, and forward Anthony Bennett."}
{"game_id": "0021401172", "chunk_id": "0021401172_012", "order": 12, "role": "body", "text": "Kevin Garnett was listed as questionable with a sore right knee but did not play. He has missed 15 games."}
{"game_id": "0021401172", "chunk_id": "0021401172_013", "order": 13, "role": "body", "text": "Aldridge's layup gave the Blazers an early 23-13 lead, and he finished the first quarter with 15 points and seven rebounds. Lillard's 3-pointer extended the lead to 39-26."}
{"game_id": "0021401172", "chunk_id": "0021401172_014", "order": 14, "role": "body", "text": "Meyers Leonard's 3-pointer gave Portland 771 3-pointers this season to break a franchise record. The Blazers had 779 at game's end."}
{"game_id": "0021401172", "chunk_id": "0021401172_015", "order": 15, "role": "body", "text": "Portland led 55-36 at the half, and maintained an 84-62 lead going into the fourth quarter. Lillard also sat for the final quarter, as did Batum."}
{"game_id": "0021401172", "chunk_id": "0021401172_016", "order": 16, "role": "body", "text": "Lillard said he hasn't been scoreboard watching lately, despite the looming playoffs and Portland's still-uncertain home-court status."}
{"game_id": "0021401172", "chunk_id": "0021401172_017", "order": 17, "role": "body", "text": "\"At first, I was watching it a lot, but now it's at the point where the season is coming to an end, and we just focus on ourselves and playing the right type of basketball we want to play going into the playoffs.\""}
{"game_id": "0021401172", "chunk_id": "0021401172_019", "order": 19, "role": "body", "text": "Timberwolves: Garnett has as much NBA experience as the rest of the active roster combined, 19 years. ... Pekovic had surgery Wednesday in North Carolina on his right Achilles. He is sidelined indefinitely. ... Wiggins has had four straight games with 20 or more points."}
{"game_id": "0021401172", "chunk_id": "0021401172_020", "order": 20, "role": "body", "text": "Trail Blazers: Portland head athletic trainer Geoff Clark was honored before the game with the Joel O'Toole Award as the NBA athletic trainer of the year. ... The Blazers have won eight straight at home against the TWolves."}
{"game_id": "0021401172", "chunk_id": "0021401172_022", "order": 22, "role": "body", "text": "The Trail Blazers went old-school and had an organ player providing some of the music for the game. Aldridge didn't notice, but Lopez and Kaman did. \"I thought it was cool,\" Lopez said."}
{"game_id": "0021401172", "chunk_id": "0021401172_024", "order": 24, "role": "body", "text": "Minnesota rookie Zach Lavine learned from playing Portland: \"We want to get where they are. I feel like when you step on the court you respect who you're playing, but you don't give them too much respect because you are trying to go at them at the same time.\""}
{"game_id": "0021401172", "chunk_id": "0021401172_026", "order": 26, "role": "body", "text": "Timberwolves: At Lakers on Friday night."}
{"game_id": "0021401172", "chunk_id": "0021401172_027", "order": 27, "role": "closing", "text": "Trail Blazers: Visit Golden State on Thursday night."}
