{"game_id": "0021400766", "chunk_id": "0021400766_001", "order": 1, "role": "lead", "text": "CLEVELAND -- LeBron James sent a cryptic message to Kevin Love off the floor, then connected with him directly on the court.\nLove scored a season-high 32 points, James flirted with a triple-double and the Cleveland Cavaliers bounced back quickly from a road loss with a 120-105 victory over the Los Angeles Lakers on Sunday.\nThe Cavs had their 12-game winning streak snapped at Indiana on Friday, a run that started when they beat the Lakers on Jan. 15. Love helped get them back on track, making five 3-pointers in the second quarter and two in the third as Cleveland opened a 26-point lead."}
{"game_id": "0021400766", "chunk_id": "0021400766_002", "order": 2, "role": "closing", "text": "James scored 22 with 10 rebounds and eight assists -- two on 3-pointers by Love in a 30-second span -- in three quarters. All-Star guard Kyrie Irving added 28 points and 10 assists.\nIt was the type of performance the Cavs have wanted more regularly from Love, who scored just five points and took only eight shots in Cleveland's loss to the Pacers. He also spent much of the fourth quarter that night on the bench. A few days earlier, Love scored five in a win over Philadelphia and went onto the floor afterward to work on his touch.\nOn Saturday, James sent out a tweet that many suspected was for Love. It said: \"Stop trying to find a way to FIT-OUT and just FIT-IN. Be a part of something special! Just my thoughts.\"\nJames was asked if the tweet was for someone in particular.\n\"It was more about people in general,\" James told a large media group. \"It was a general thought I had. Obviously, whatever thought I have people try to encrypt it and Da Vinci code it. People are always trying to fit out instead of fit in and be part of something special. That's what it's all about.\"\nIn October, Love said he was trying \"not to fit in so much\" with the Cavs, adding new teammates had encouraged him to \"fit out. Just be myself.\"\nLater, to a smaller group of reporters, James indicated the tweet was aimed at Love.\n\"It's not a coincidence, man,\" he said.\nRookie Jordan Clarkson scored a career-high 20 for the Lakers, who matched a franchise record with their 10th straight road loss. Los Angeles hasn't won away from Staples Center since Dec. 30. The Lakers also lost 10 in a row on the road in 1957-58 and 1963-64.\n\"I'm happy it's over,\" coach Byron Scott said. \"I thought our guys were soft. We allowed them to do whatever they wanted. You can't play that way.\"\nLove finished 11 of 18 from the field and added 10 rebounds. He was the last Cleveland player in the locker room, addressing the media long after James and others had left.\nHe sat in a chair at his locker and stared at the floor while answering questions. One of them was if he thought the Lakers would be an attractive option this summer, when he can opt out of his contract.\n\"I'm a Cleveland Cavalier,\" he said.\nJames didn't show any signs of being slowed by a nagging ankle or wrist injury, and the large lead allowed coach David Blatt to rest his best player for the entire fourth quarter.\nHIGHLIGHT REEL\nCleveland's most sensational play of the first half came on a lobbed inbounds pass from Irving to Iman Shumpert, who outmuscled Lakers forward Carlos Boozer for the ball and delivered a contest-worthy dunk. The play was not drawn up that way.\n\"He made a great play,\" Blatt said of Irving. \"When your kids do something great, you always want to take credit for it but sometimes they're just doing good stuff.\"\nTIP-INS\nLakers: Scott spent three years with the Cavs before he was fired after the 2012-13 season. He said returning to Cleveland \"reminds me of how cold it was. Being back in L.A. for two years, I guess your blood gets a little thin again and you forget how cold it can be in other places.\" ... G Jeremy Lin finished with 11 points in 20 minutes. He had been questionable with the stomach flu.\nCavaliers: Cleveland has won eight straight over Western Conference teams. ... A moment of silence was observed for legendary North Carolina coach Dean Smith, who died Saturday. C Brendan Haywood was recruited by Smith, who retired before the big man's freshman season. \"He was about developing you as a man,\" Haywood said. \"I couldn't be here without him.\"\nYOUNG MISTAKE\nScott benched Nick Young after the guard picked up a technical in the second quarter.\n\"He's got to learn to keep his composure a lot better than that,\" Scott said of Young, who finished with eight points. \"That's something I expect from somebody who's 21 or 22, not in the league seven or eight years.\"\nUP NEXT\nLakers: Host Denver on Tuesday.\nCavaliers: Host Miami on Wednesday"}
