{"game_id": "0021700137", "chunk_id": "0021700137_001", "order": 1, "role": "lead", "text": "LOS ANGELES --  For most of the fourth quarter Sunday, the Miami Heat looked capable of blowing a game they led by as many as 25 points in the second half."}
{"game_id": "0021700137", "chunk_id": "0021700137_002", "order": 2, "role": "body", "text": "They did not score their first basket in the period until more than five minutes had passed. They turned the ball over seven times to the Clippers, who suddenly got hot and opened the quarter with a 16-0 run."}
{"game_id": "0021700137", "chunk_id": "0021700137_003", "order": 3, "role": "body", "text": "The Clippers stormed all the way back to take the lead, but the Heat made the key free throws in the final seconds that Los Angeles could not, hanging on for a 104-101 victory."}
{"game_id": "0021700137", "chunk_id": "0021700137_004", "order": 4, "role": "body", "text": "After Austin Rivers failed to make two free throws with 17.1 seconds left for the Clippers, James Johnson hit two for Miami to put the Heat back up by one."}
{"game_id": "0021700137", "chunk_id": "0021700137_005", "order": 5, "role": "body", "text": "The Clippers' final chance found the ball in Blake Griffin's hands, guarded on a switch by Miami's Hassan Whiteside."}
{"game_id": "0021700137", "chunk_id": "0021700137_006", "order": 6, "role": "body", "text": "Griffin missed a 3-point attempt with 3 seconds left and Josh Richardson hit two final three throws for Miami."}
{"game_id": "0021700137", "chunk_id": "0021700137_007", "order": 7, "role": "body", "text": "Heat coach Erik Spoelstra seemed almost excited by the final Whiteside-Griffin matchup."}
{"game_id": "0021700137", "chunk_id": "0021700137_008", "order": 8, "role": "body", "text": "\"That's what you want out of a Defensive Player of the Year candidate going against an MVP-level candidate,\" he said. \"You don't see too many of those in today's game where it's just `mano y mano.' \""}
{"game_id": "0021700137", "chunk_id": "0021700137_009", "order": 9, "role": "body", "text": "Whiteside led the Heat with 21 points and 17 rebounds, while Griffin led the Clippers with 23 points -- but three shy of what he wanted."}
{"game_id": "0021700137", "chunk_id": "0021700137_010", "order": 10, "role": "body", "text": "\"We don't want to be in that position, but if we are it's a shot I'm willing to take,\" Griffin said. \"Unfortunately, it didn't go in.\""}
{"game_id": "0021700137", "chunk_id": "0021700137_011", "order": 11, "role": "body", "text": "The Heat dominated play early. They led 34-20 at the end of the first quarter and 62-49 at the half, before pushing their lead to as big as 89-64 near the end of the third quarter."}
{"game_id": "0021700137", "chunk_id": "0021700137_012", "order": 12, "role": "body", "text": "\"I'm more upset about falling behind by 25,\" Griffin said. \"Coming back shows a lot of heart . but you shouldn't put yourself in that position in the first place.\""}
{"game_id": "0021700137", "chunk_id": "0021700137_013", "order": 13, "role": "body", "text": "Miami got strong bench play. Tyler Johnson had 19 points and Wayne Ellington 17. The Heat were 14 of 36 on 3-pointers."}
{"game_id": "0021700137", "chunk_id": "0021700137_014", "order": 14, "role": "body", "text": "The Clippers got 22 from Lou Williams off the bench, 13 coming in the fourth quarter when he led Los Angeles' initial comeback with reserves."}
{"game_id": "0021700137", "chunk_id": "0021700137_015", "order": 15, "role": "body", "text": "\"The second unit saved us,\" said Clippers coach Doc Rivers. \"They were spectacular.\""}
{"game_id": "0021700137", "chunk_id": "0021700137_017", "order": 17, "role": "body", "text": "Heat: Starting guard Dion Waiters was not with the team. He returned to Miami for the birth of his daughter -- Dior Raina Waiters was born Sunday morning. Waiters is expected to rejoin the Heat later this week as their six-game road trip continues."}
{"game_id": "0021700137", "chunk_id": "0021700137_018", "order": 18, "role": "body", "text": "Clippers: Recalled forward Brice Johnson from their NBA G League in Ontario, California. In Ontario's first two games, Johnson averaged 17.5 points and 10.5 rebounds."}
{"game_id": "0021700137", "chunk_id": "0021700137_020", "order": 20, "role": "body", "text": "Griffin was originally guarded on the final play by Johnson, but was screened by Clippers center DeAndre Jordan, leaving Whiteside to defend him on the final play."}
{"game_id": "0021700137", "chunk_id": "0021700137_021", "order": 21, "role": "body", "text": "\"When DeAndre Jordan came and set the screen on me, I heard a loud `pull switch,' \" Johnson said. \"I had all the confidence in the world that our big fella was going to get that stop.\""}
{"game_id": "0021700137", "chunk_id": "0021700137_023", "order": 23, "role": "body", "text": "The point guard blamed himself for the loss after missing his two last free throws and the Clippers up by one."}
{"game_id": "0021700137", "chunk_id": "0021700137_024", "order": 24, "role": "body", "text": "\"Those are the situations I dream of being in,\" he said."}
{"game_id": "0021700137", "chunk_id": "0021700137_025", "order": 25, "role": "body", "text": "\"It's just really disappointing and frustrating. I feel like it's my fault we lost the game.\""}
{"game_id": "0021700137", "chunk_id": "0021700137_027", "order": 27, "role": "body", "text": "Clippers starting forward Danilo Gallinari sat out the second half with a left hip contusion. Gallinari will go on the Clippers' three-game road trip, but limped out of the arena after the game."}
{"game_id": "0021700137", "chunk_id": "0021700137_028", "order": 28, "role": "body", "text": "Gallinari said he originally injured the hip a week ago, but aggravated it Sunday."}
{"game_id": "0021700137", "chunk_id": "0021700137_029", "order": 29, "role": "body", "text": "\"I've been having pain the last two or three games and now it's getting to the point where I'm having problems walking,\" he said. \"I've got to take care of it.\""}
{"game_id": "0021700137", "chunk_id": "0021700137_031", "order": 31, "role": "body", "text": "Heat: Visit Golden State on Monday."}
{"game_id": "0021700137", "chunk_id": "0021700137_032", "order": 32, "role": "body", "text": "Clippers: Visit San Antonio on Tuesday."}
{"game_id": "0021700137", "chunk_id": "0021700137_034", "order": 34, "role": "closing", "text": "More AP NBA: www.apnews.com/tags/NBAbasketball"}
