{"game_id": "0021700996", "chunk_id": "0021700996_001", "order": 1, "role": "lead", "text": "DENVER --  Although Paul Millsap took his lumps -- courtesy of teammate Nikola Jokic's chin -- his team only delivered them."}
{"game_id": "0021700996", "chunk_id": "0021700996_002", "order": 2, "role": "body", "text": "\"Long overdue for a blowout like that,\" Millsap said."}
{"game_id": "0021700996", "chunk_id": "0021700996_003", "order": 3, "role": "body", "text": "Jokic had 20 points , 11 rebounds and 10 assists for his seventh triple-double of the season, Gary Harris added 21 points and the Denver Nuggets cruised to a 130-104 victory over the Sacramento Kings on Sunday."}
{"game_id": "0021700996", "chunk_id": "0021700996_004", "order": 4, "role": "body", "text": "Denver led by as many as 36 points while staying in the thick of the playoff chase. The Nuggets now enter a difficult stretch in their schedule -- eight of their next nine games are on the road."}
{"game_id": "0021700996", "chunk_id": "0021700996_005", "order": 5, "role": "body", "text": "Led by Harris and Will Barton, the Nuggets turned up the tempo in the second quarter to pull away. Denver was in such control that most of its starters -- all but Harris -- got the fourth quarter off."}
{"game_id": "0021700996", "chunk_id": "0021700996_006", "order": 6, "role": "body", "text": "\"It's great when you can build the lead and sustain that lead,\" Nuggets coach Michael Malone said. \"We were able to do that tonight and obviously for what we have in mind, what our goals are, to be a playoff team, you need to do that.\""}
{"game_id": "0021700996", "chunk_id": "0021700996_007", "order": 7, "role": "body", "text": "Jokic made his presence felt. Then again, that's been the case since Malone had a talk with him after Jokic's clunker of a game at Dallas last week. Malone's message was straight to the point: Be more aggressive."}
{"game_id": "0021700996", "chunk_id": "0021700996_008", "order": 8, "role": "body", "text": "It's sinking in. Jokic has scored 36, 21 and now 20 since that conversation."}
{"game_id": "0021700996", "chunk_id": "0021700996_009", "order": 9, "role": "body", "text": "\"I don't want to be there doing nothing,\" Jokic said. \"I want to hit the boards, get an assist, score, just to be aggressive and be in the game.\""}
{"game_id": "0021700996", "chunk_id": "0021700996_010", "order": 10, "role": "body", "text": "Sacramento big man Zach Randolph had high praise for Jokic."}
{"game_id": "0021700996", "chunk_id": "0021700996_011", "order": 11, "role": "body", "text": "\"Jokic, man, he's special,\" Randolph said. \"He's a future All-Star.\""}
{"game_id": "0021700996", "chunk_id": "0021700996_012", "order": 12, "role": "body", "text": "Everything went smoothly for the Nuggets before Millsap and Jokic were dinged up in a collision midway through the third quarter. Millsap's head banged into the chin of Jokic when they were covering Randolph. They remained in the game."}
{"game_id": "0021700996", "chunk_id": "0021700996_013", "order": 13, "role": "body", "text": "\"You can't tell by my hair, but I have a nice lump under there,\" Millsap said. \"I thought (Jokic) was going to bleed after that. He's got a strong chin. He can take a punch.\""}
{"game_id": "0021700996", "chunk_id": "0021700996_014", "order": 14, "role": "body", "text": "Buddy Hield scored 18 points, while former Nuggets player Kosta Koufos chipped in 14 points and 10 rebounds for the Kings."}
{"game_id": "0021700996", "chunk_id": "0021700996_015", "order": 15, "role": "body", "text": "\"Either you're going to hit people or you're going to be hit,\" Kings coach Dave Joerger said. \"We got hit and they just kept going.\""}
{"game_id": "0021700996", "chunk_id": "0021700996_017", "order": 17, "role": "body", "text": "Kings: F Skal Labissiere missed the game with a bruised left hip. ... C Willie Cauley-Stein and G De'Aaron Fox returned to the lineup after missing time with back ailments. Both Cauley-Stein and Fox scored 12 points."}
{"game_id": "0021700996", "chunk_id": "0021700996_018", "order": 18, "role": "body", "text": "Nuggets: F Juancho Hernangomez was inactive with F Wilson Chandler back on the court after missing a game with hip soreness. Chandler had 16 points. ... The Nuggets had a season-high 26 turnovers in a loss at Sacramento on Jan. 6. This time, Denver turned the ball over just eight times. ... G Jamal Murray added 20 points."}
{"game_id": "0021700996", "chunk_id": "0021700996_020", "order": 20, "role": "body", "text": "Malone spoke with Murray after the guard got under the skin of Los Angeles coach Luke Walton and the Lakers with his late-game trash talk in a 125-116 win Friday."}
{"game_id": "0021700996", "chunk_id": "0021700996_021", "order": 21, "role": "body", "text": "\"Jamal plays with emotion,\" Malone said. \"I didn't have any issues with Jamal's play or antics out there.\""}
{"game_id": "0021700996", "chunk_id": "0021700996_023", "order": 23, "role": "body", "text": "Murray was surprised that Jokic has just seven triple-doubles this season."}
{"game_id": "0021700996", "chunk_id": "0021700996_024", "order": 24, "role": "body", "text": "\"It seems like he has like 20 at this point,\" Murray said."}
{"game_id": "0021700996", "chunk_id": "0021700996_026", "order": 26, "role": "body", "text": "Passing by Murray's interview, veteran Richard Jefferson couldn't help but comment on a well-dressed Murray."}
{"game_id": "0021700996", "chunk_id": "0021700996_027", "order": 27, "role": "body", "text": "\"This is a prime example of what Deion Sanders once said: `When you dress good, you feel good. When you feel good, you play good. When you play good, they pay good,\" Jefferson said, laughing, as he exited the locker room."}
{"game_id": "0021700996", "chunk_id": "0021700996_029", "order": 29, "role": "body", "text": "Kings: Finish a two-game trip at Oklahoma City on Monday. The Kings are 4-9 on the second night of a back-to-back this season."}
{"game_id": "0021700996", "chunk_id": "0021700996_030", "order": 30, "role": "closing", "text": "Nuggets: At the Los Angeles Lakers on Tuesday. It could be testy, given Murray's verbal sparring coming three months after he dribbled around Lonzo Ball in the waning seconds of a win in December."}
