{"game_id": "0021400778", "chunk_id": "0021400778_001", "order": 1, "role": "lead", "text": "MILWAUKEE --  After slogging through a poor-shooting first half, the Milwaukee Bucks found their rhythm after halftime."}
{"game_id": "0021400778", "chunk_id": "0021400778_002", "order": 2, "role": "body", "text": "Defense and the transition game set the tone for coach Jason Kidd's young team."}
{"game_id": "0021400778", "chunk_id": "0021400778_003", "order": 3, "role": "body", "text": "Khris Middleton scored 12 of his 18 points in the third quarter, and Milwaukee rallied from a 17-point deficit to beat the Brooklyn Nets 103-97 on Monday night."}
{"game_id": "0021400778", "chunk_id": "0021400778_004", "order": 4, "role": "body", "text": "Jared Dudley had 19 points for Milwaukee, which won its fifth straight home game. Giannis Antetokounmpo added 12 points, nine rebounds, eight assists and three steals."}
{"game_id": "0021400778", "chunk_id": "0021400778_005", "order": 5, "role": "body", "text": "The Bucks forced eight turnovers while outscoring the Nets 32-16 in the third."}
{"game_id": "0021400778", "chunk_id": "0021400778_006", "order": 6, "role": "body", "text": "\"The way we started the third quarter, we really took control of the game and being able to finish the way we did, it's a real good home win,\" Kidd said."}
{"game_id": "0021400778", "chunk_id": "0021400778_007", "order": 7, "role": "body", "text": "Jarrett Jack had 26 points for the Nets on 10-of-15 shooting. Joe Johnson finished with 19 points and six assists."}
{"game_id": "0021400778", "chunk_id": "0021400778_008", "order": 8, "role": "body", "text": "But mistakes doomed Brooklyn. It closed to 89-84 midway through the fourth quarter, but Mason Plumlee's turnover turned into an easy transition layup for Middleton that put the Bucks back up by nine with 3:14 left."}
{"game_id": "0021400778", "chunk_id": "0021400778_009", "order": 9, "role": "body", "text": "\"They're long, athletic guys out there. They switched a lot of stuff. They were double-teaming us, threw us off our rhythm a little bit,\" Nets guard Deron Williams said. \"And then anytime we turned the ball over, they turned it into the fast-break opportunities.\""}
{"game_id": "0021400778", "chunk_id": "0021400778_010", "order": 10, "role": "body", "text": "The young Bucks swarmed the veteran Nets in the backcourt and filled passing lanes. Middleton had three steals in the third quarter and used his soft baseline jumper to dent Brooklyn for easy buckets."}
{"game_id": "0021400778", "chunk_id": "0021400778_011", "order": 11, "role": "body", "text": "\"I had smaller guys guarding me at the shooting guard position,\" the 6-foot-7 Middleton said. \"My shot wasn't falling, so I tried to put them in a bind by going in the post to see what they would do. I was able to take advantage of it.\""}
{"game_id": "0021400778", "chunk_id": "0021400778_013", "order": 13, "role": "body", "text": "The Bucks were so good in the third that it was hard to believe that they struggled so much earlier in the evening."}
{"game_id": "0021400778", "chunk_id": "0021400778_014", "order": 14, "role": "body", "text": "A 0-for-12 drought spanning the first and second quarters left the Bucks trailing 41-24 with 7:45 left. Brooklyn found success inside, going 11 of 15 on shots in the paint in the first half."}
{"game_id": "0021400778", "chunk_id": "0021400778_015", "order": 15, "role": "body", "text": "The Bucks slowly chipped away in spite of shooting 33 percent in the first half. Antetokounmpo and Dudley kept the Bucks in the game, with Dudley going 4 of 4 from 3-point range in the first half to help them get within 52-47 at halftime."}
{"game_id": "0021400778", "chunk_id": "0021400778_016", "order": 16, "role": "body", "text": "\"I had a lot of wide-open looks early on, made `em,\" Dudley said. \"Finally felt good, in a nice rhythm the whole time they left me (open) a couple times.\""}
{"game_id": "0021400778", "chunk_id": "0021400778_018", "order": 18, "role": "body", "text": "Nets coach Lionel Hollins wanted his team to set the tone and not let the Bucks beat them in a track meet. It worked for Brooklyn -- but only for about the first 16 minutes of the game. Milwaukee pulled away from that point."}
{"game_id": "0021400778", "chunk_id": "0021400778_019", "order": 19, "role": "body", "text": "\"I said before the game to the players that we have to keep scoring. We can't have those lulls,\" Hollins said. \"Coming down the stretch we had three or four wide-open 3s that we don't make. That was pretty much the ballgame.\""}
{"game_id": "0021400778", "chunk_id": "0021400778_021", "order": 21, "role": "body", "text": "Milwaukee is 29-23 and in firm position for a playoff spot heading into the All-Star break. The Bucks' win total is already nearly double the number they had for all of their 15-win campaign in 2013-14."}
{"game_id": "0021400778", "chunk_id": "0021400778_022", "order": 22, "role": "body", "text": "\"For us, it's finishing strong before the break. We know what's in front of us and we're almost there,\" Dudley said."}
{"game_id": "0021400778", "chunk_id": "0021400778_024", "order": 24, "role": "body", "text": "Nets:  Williams played 22 minutes after being listed as questionable with an illness. He was scoreless and missed all five of his shot attempts. ... Brooklyn shot 70 percent (12 of 17) in the first quarter to take a 30-24 lead."}
{"game_id": "0021400778", "chunk_id": "0021400778_025", "order": 25, "role": "body", "text": "Bucks: Antetokounmpo was named Eastern Conference Player of the Week after averaging 19.5 points and 11 rebounds in his previous four games, which included three double-doubles. ... Center Zaza Pachulia played 16 minutes after sitting out six games with a strained right calf."}
{"game_id": "0021400778", "chunk_id": "0021400778_028", "order": 28, "role": "closing", "text": "Bucks: Host Sacramento on Wednesday."}
