{"game_id": "0021300971", "chunk_id": "0021300971_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- The Charlotte Bobcats are turning into a difficult team to beat down the stretch, particularly at home.\nThe Bobcats extended their home winning streak to eight games Friday night with a 105-93 win over the Minnesota Timberwolves, continuing to inch closer to clinching their second playoff appearance in franchise history.\n\"To me, to become a really good team, you have to win at home,\" Bobcats coach Steve Clifford.\nThey're doing that.\nThe Bobcats, currently the seventh seed in the Eastern Conference, came in averaging 103.9 points and shooting 47 percent in their last seven homes games. They shot 48 percent against the Timberwolves.\nAl Jefferson had 25 points and 16 rebounds to set a single-season franchise record with his 20th 20-point, 10-rebound game of the season and the Bobcats held Kevin Love scoreless in the second half.\n\"They brought me here to be a double-double guy, a 20-10 guy, and I'm just living up to my contract,\" said Jefferson, who inked a three-year, $40.5 million deal this past offseason.\nGary Neal, benched Wednesday for an \"internal team matter,\" returned and provided a huge lift off the bench with 19 points on 6-of-10 shooting.\nHe said his comfort level is improving since being acquired from the Milwaukee Bucks just before the NBA trade deadline.\n\"I've never been traded in the middle of the season before, so that has been tough,\" Neal said. \"That is what I can bring to the team is scoring, but you also want to fit in. You don't want to come in with the second team and think that you can shoot all of the shots. It was a feeling-out process and so far I have done a good job.\"\nKevin Martin had 19 points to lead Minnesota.\nLove had 18 points in the first half, but was 0 for 7 from the floor in the second half against Josh McRoberts and improving rookie Cody Zeller.\nIt didn't help that Timberwolves center Nikola Pekovic left late in the third quarter with a sore right ankle. He missed most of February with an ankle issue.\n\"I was particularly tired and it was just a tough game from the start,\" Love said. \"They were hitting a lot shots. They kept making shots and we didn't get any stops. ... I don't think I scored in the second half. It was a tough night for everybody.\"\nSaid McRoberts: \"(Love) is going to hit all seven of those shots tomorrow even if he faces the same defense. When you're that good, as a defense you just try to make it tough for him to get to a spot he wants to get to.\"\nThe Bobcats entered the night with the seventh-best record in the Eastern Conference and three games below .500.\nCharlotte led by as many as 18 in the second half and the Timberwolves were never able to get the lead under double-digits after the break.\nJefferson, the only player in the Eastern Conference averaging more than 20 points and 10 rebounds per game this season, continued his torrid pace with his 25th 20-point game in the last 28 outings. The 6-foot-10 center only had eight points in a 119-92 loss at Minnesota on Jan. 10.\nBut he had 12 at the break and helped the Bobcats extend their lead to 18 in the third quarter with an old-fashioned three-point play on an up-and-under scoop shot that drew a foul.\nHe was 12 of 26 from the field.\nThe Timberwolves came in looking for their first four-game road win streak in five years, but instead fell back to .500 on the season and six games behind Dallas in the race for the final playoff spot in the Western Conference.\nThe Bobcats broke up a tie game by outscoring the Timberwolves 32-20 in the second quarter behind 16 first half points from Neal, who was 5 of 7 from the field with a pair of 3-pointers.\nCharlotte shot 54 percent in the first half, including 5 of 8 from beyond the 3-point arc.\n\"The start of the second quarter just killed us,\" Timberwolves coach Rick Adelman said. \"They didn't miss many shots. I thought defense was our problem. Second half, it was an even game but we were too far down.\"\nThe Bobcats (32-34) have won five of six and are trying to catch the Washington Wizards for sixth place in the East. The way things stand now, that would be the difference between playing the Miami Heat and Toronto Raptors in the first round of the playoffs.\nGame notes\nClifford said before the game he doesn't expect center Brandon Haywood back this season. Haywood has been out all season with a stress fracture in his left foot that hasn't quite healed. He said the Bobcats will look to sign another center soon. ... Michael Kidd-Gilchrist had 10 points and nine rebounds for the Bobcats. ... Zeller provided a boost off the bench for Charlotte with 10 points and eight rebounds. Charlotte's bench outscored Minnesota's 47-32."}
