{"game_id": "0021301228", "chunk_id": "0021301228_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- Leaving the Trail Blazers' locker room following the regular-season finale, Wesley Matthews was wished well in the playoffs.\n\"Now the fun starts,\" he said.\nThe Blazers wrapped up the regular season with a 110-104 victory Wednesday night over the Los Angeles Clippers, with both teams resting key players in advance of the postseason.\nWill Barton had a career-high 23 (points for the Blazers, who sat All-Star forward LaMarcus Aldridge. Seeded fifth in the Western Conference, Portland will face the Rockets in a first-round series starting Sunday in Houston."}
{"game_id": "0021301228", "chunk_id": "0021301228_002", "order": 2, "role": "closing", "text": "Portland ended the regular season on a five-game winning streak. They won 54 games, their most since the 2008-09 season, and bettered their record by 21 wins over last season for the biggest turnaround in franchise history.\n\"We've got to stay in our game and do what we've been doing all season, staying together as a team,\" Blazers guard Damian Lillard said. \"We've done that all year, through ups and downs. And now we need to do it in the playoffs.\nJamal Crawford had 34 points for the Clippers, who didn't play Chris Paul and Blake Griffin. The team set the franchise record for most regular season wins (57) the night before with a victory over Denver.\nGoing into the game the Clippers had a chance to secure the No. 2 seed in the West. But when Oklahoma City defeated Detroit earlier Wednesday, the Clippers sewed up the third seed and will face Golden State in the opening round starting Saturday.\nPaul, Griffin and J.J. Redick did not make the trip to Portland.\nThe team had already announced that Griffin would not play when the league suspended him for the game because he had accumulated 16 technical fouls. Griffin was handed the technical in Tuesday night's 117-105 win against the Nuggets.\nDeAndre Jordan started but he played less than two minutes before he headed to the bench.\n\"We wanted to win. I hope I didn't send the wrong message to you guys that because we sent guys home we weren't going to play hard and play to win,\" Clippers coach Doc Rivers said. \"We want to win the game. It's a competition no matter who is out on the floor.\"\nIn addition to Aldridge, the Blazers sat reserve guard Mo Williams. But Portland saw the return of forward Joel Freeland, who hadn't played since Feb. 11 with a sprained MCL in his right knee. The Blazers need Freeland to back up center Robin Lopez against the Rockets and Dwight Howard.\n\"To be out that long is tough,\" Freeland said. \"But at the end of the day it gave me time to rest my leg, time to rest my body.\"\nPortland led by as many as 22 points in the first half.\nBarton's 3-pointer for Portland put the Blazers up 54-37 midway through the second quarter and they went on to lead 68-52 at the half. Portland played its starters all 12 minutes apiece in the first half.\nLopez was the only starter who started the second half for the Blazers. Nicolas Batum, Wesley Matthews and Damian Lillard did not play again.\nThe Clippers closed to within 74-73 in the third quarter after Crawford hit a driving layup, two 3-pointers and a free throw. Los Angeles went ahead 81-78 on Matt Barnes' 3. Portland reclaimed the lead when Freeland's basket with just under 10 minutes left to make it 89-87.\nCrawford made a 3-pointer that put the Clippers in front 96-94, but Barton answered with his own 3 with 4:37 left. Victor Claver's 3-pointer gave the Blazers a 106-100 lead and all but sealed the win with 1:58 to go.\n\"It was good to end the season on a positive note,\" Blazers coach Terry Stotts said. \"I was proud of the young guys in the second half, the fact that they struggled through a third quarter where the offense didn't quite click and it was a close games. It was really good experience for them to play in a game, in a fourth quarter that mattered and going up against vets like Jamal Crawford and Willie Green.\"\nGame notes\nLopez was awarded the Blazers' Maurice Lucas award for his contributions to the team both on and off the court. ... The Clippers' victory over the Nuggets Tuesday was the team's 57th, setting a new franchise record. ... Lopez set a new franchise record with 326 offensive rebounds this season."}
