{"game_id": "0021401204", "chunk_id": "0021401204_001", "order": 1, "role": "lead", "text": "PHILADELPHIA --  Michael Carter-Williams showed the 76ers what they are missing, and the Milwaukee Bucks displayed in the second half why they are a playoff team."}
{"game_id": "0021401204", "chunk_id": "0021401204_002", "order": 2, "role": "body", "text": "Carter-Williams matched his season-high with 30 points in his first game back in Philadelphia to lead the playoff-bound Bucks to a 107-97 victory over the 76ers on Monday night."}
{"game_id": "0021401204", "chunk_id": "0021401204_003", "order": 3, "role": "body", "text": "O.J. Mayo and Ersan Ilyasova had 13 points apiece and Giannis Antetokounmpo chipped in 12 for the Bucks, who capped a turnaround from the NBA's worst record last season with a playoff berth with Sunday's win over the Nets."}
{"game_id": "0021401204", "chunk_id": "0021401204_004", "order": 4, "role": "body", "text": "\"I was just trying to be aggressive, attack the open lanes,\" Carter-Williams said. \"I was able to hit some midrange shots and my teammates put me in the right positions.\""}
{"game_id": "0021401204", "chunk_id": "0021401204_005", "order": 5, "role": "body", "text": "After an uncharacteristically poor defensive performance in the first half, Milwaukee clamped down after halftime."}
{"game_id": "0021401204", "chunk_id": "0021401204_006", "order": 6, "role": "body", "text": "\"I think the guys, talking to them at halftime, understand what we've done all year is play hard no matter what the circumstances are, and as a whole we didn't play up to that in the first half,\" Bucks coach Jason Kidd said. \"Those guys came out in the second half and played like we played all year.\""}
{"game_id": "0021401204", "chunk_id": "0021401204_007", "order": 7, "role": "body", "text": "Carter-Williams continued his recent hot stretch. He made 11 of 17 field goals while contributing five rebounds and five assists. Over his last four games, Carter-Williams is averaging 22.8 points, 3.0 rebounds and 6.3 assists."}
{"game_id": "0021401204", "chunk_id": "0021401204_008", "order": 8, "role": "body", "text": "\"You could see he was playing at a very high level,\" Kidd said. \"He's been doing that for us the last couple of weeks.\""}
{"game_id": "0021401204", "chunk_id": "0021401204_009", "order": 9, "role": "body", "text": "Carter-Williams was Rookie of the Year last season as a 76er and thought to be part of Philadelphia's rebuild before his surprising trade to Milwaukee on Feb. 19. Philadelphia fans greeted Carter-Williams with applause during introductions and louder cheers during the second quarter when the team thanked him with a video tribute."}
{"game_id": "0021401204", "chunk_id": "0021401204_010", "order": 10, "role": "body", "text": "\"That was great, that's unbelievable,\" he said. \"Thank you for it. I appreciate it.\""}
{"game_id": "0021401204", "chunk_id": "0021401204_011", "order": 11, "role": "body", "text": "Robert Covington scored 25 points and Hollis Thompson added 19 for Philadelphia, which played without Rookie of the Year contender Nerlens Noel (ankle) for the second straight game while losing its ninth in a row. The 76ers, who committed a season-high 30 turnovers, entered play with the league's third-worst record. They dropped to 18-63."}
{"game_id": "0021401204", "chunk_id": "0021401204_013", "order": 13, "role": "body", "text": "\"He came in and had a (terrific) game,\" Philadelphia coach Brett Brown said. \"We wish him well for the playoffs.\""}
{"game_id": "0021401204", "chunk_id": "0021401204_014", "order": 14, "role": "body", "text": "The Bucks were back on the court a day after clinching a playoff spot. Milwaukee is locked into a No. 6 seed and will play either Toronto or Chicago in the first round."}
{"game_id": "0021401204", "chunk_id": "0021401204_015", "order": 15, "role": "body", "text": "The Bucks picked up their game in the third quarter to turn a 58-52 halftime deficit to an 80-78 lead entering the final period. The Bucks held the 76ers to 24 percent (4-for-17 shooting) in the period while forcing 10 turnovers."}
{"game_id": "0021401204", "chunk_id": "0021401204_016", "order": 16, "role": "body", "text": "Using their regular lineup despite having clinched the postseason, the Bucks didn't take the night off against Philadelphia. But they sure played like it in the first half."}
{"game_id": "0021401204", "chunk_id": "0021401204_017", "order": 17, "role": "body", "text": "Behind 18 first-half points from Covington, Philadelphia took a six-point lead at the break. That's out of character for a Bucks team that entered second in the NBA in defensive points per 100 possessions and first in turnovers (17.2 per game). And for a Philadelphia team that entered last in the league in field-goal percentage (40.8 percent) and second worst in scoring (91.8 points per game)."}
{"game_id": "0021401204", "chunk_id": "0021401204_018", "order": 18, "role": "body", "text": "The 76ers shot 56.4 percent (22 for 39) in the opening half, including 40 percent (6 for 15) from 3-point range."}
{"game_id": "0021401204", "chunk_id": "0021401204_020", "order": 20, "role": "body", "text": "While his former team continues rebuilding, Carter-Williams is grateful for his first playoff appearance with the Bucks."}
{"game_id": "0021401204", "chunk_id": "0021401204_021", "order": 21, "role": "body", "text": "\"It's real exciting,\" he said. \"It's my first playoffs and a lot of guys' first playoffs. I'm just glad to be a part of it.\""}
{"game_id": "0021401204", "chunk_id": "0021401204_023", "order": 23, "role": "body", "text": "Mayo and JaKarr Sampson got into a verbal confrontation with just under six minutes remaining, and the teams came together without any punches being thrown."}
{"game_id": "0021401204", "chunk_id": "0021401204_025", "order": 25, "role": "body", "text": "Bucks: Carter-Williams had seven points and eight assists in 18 minutes against the 76ers on Feb. 25 in Milwaukee. He set his career high of 33 points on Jan. 7, 2014 vs. Cleveland while with the 76ers.  . The Bucks are headed to the playoffs for just the third time in nine seasons."}
{"game_id": "0021401204", "chunk_id": "0021401204_026", "order": 26, "role": "body", "text": "76ers: Isaiah Canaan (sprained right foot) sat out for the fifth consecutive contest, and Luc Mbah a Moute (strained left shoulder) missed his fifth in the last 10. . Former Sixers great Allen Iverson was among those in attendance."}
{"game_id": "0021401204", "chunk_id": "0021401204_028", "order": 28, "role": "body", "text": "Bucks: close regular season by hosting Boston on Wednesday night."}
{"game_id": "0021401204", "chunk_id": "0021401204_029", "order": 29, "role": "closing", "text": "76ers: end season at home vs. Miami on Wednesday night."}
