{"game_id": "0021400222", "chunk_id": "0021400222_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- Mike Conley thinks the Memphis Grizzlies are atop the NBA standings because they've been consistent and determined each night, no matter whether they're playing title contenders or the Los Angeles Lakers.\nThe Grizzlies needed every bit of that focus to hold off those 15th-place Lakers, who fell a few minutes shy of an unlikely win.\nMarc Gasol had 19 points and 11 rebounds, Conley added 19 points and the Grizzlies beat Los Angeles 99-93 Wednesday night for their seventh victory in eight games.\nZach Randolph scored 16 for the Grizzlies, who improved to 13-2 and kept pace with Toronto atop the overall standings. But Memphis barely withstood a strong effort from Kobe Bryant and the Lakers, who kept it close throughout a tense fourth quarter.\n\"It says a lot about our focus early this season,\" Conley said. \"That's all we want to do, is to come out focused for the first couple of months of the season, set a good standard for ourselves, and have to just hold ourselves accountable and try to get better.\"\nComing off back-to-back 30-point games, Gasol scored 16 points in the second half, including 12 in the third quarter while the Grizzlies moved ahead. Gasol saw a familiar pattern in the final minutes for Memphis.\n\"We got more stops, got a little more physical with each possession,\" Gasol said. \"Put more pressure on them, everything we should have done all night. It's never perfect, but you aim for perfection.\"\nBryant scored 22 points for the Lakers, who have lost seven of nine. Los Angeles dropped to 1-7 at Staples Center after missing several chances to seize control down the stretch. The Lakers have lost six games by seven points or fewer.\n\"It's just as frustrating no matter how many times we lost by seven points or less,\" Bryant said. \"I mean, it's not like we have levels of frustration. It's either all or nothing. We've had some opportunities against some of the top teams in the West to win, and we just let it get away from us.\"\nThe NBA's worst defensive team held the Grizzlies to six field goals in the fourth, and the Lakers trailed 97-93 after Jeremy Lin's free throws with 1:41 left. But Los Angeles' offense flopped down the stretch, capped by Bryant's brutal turnover with 16 seconds left.\nThe Lakers opened with one of their better halves of the season, and they did it without much help from Bryant, who took his first shot and scored his first points about three minutes before halftime.\nTIP-INS\nGrizzlies: Memphis went 5 for 22 on 3-pointers. ... The Grizzlies beat the Lakers in Memphis on Nov. 11. ... Compton native Tayshaun Prince had two points in 9 minutes.\nLakers: They tied their season high with nine blocked shots, including three by Ed Davis -- two on the same Memphis possession early. ... Ronnie Price had 11 points and five assists in a reserve role, providing a notable spark during his 18 minutes. ... Carlos Boozer returned after missing one game with a strained left shoulder.\nENCOURAGING SIGNS\nLin sees hope in the Lakers' latest failure to execute down the stretch: \"If you learn from them, I don't see them as wasted opportunities. ... There are going to be rough times, and as long as we learn, which I think we really are doing, I think we'll be able to use these losses and turn them into something better.\"\nEARL ON THE WAY?\nAlthough the Lakers haven't formally announced they're bringing back Earl Clark, the forward posted a photo of himself in his Lakers jersey on Instagram. With Xavier Henry's torn Achilles tendon on Monday, Los Angeles already has lost three players to season-ending injuries, and Clark had the best season of his five-year NBA career with the Lakers in 2012-13. Clark went to training camp with Memphis, but was waived last month.\nUP NEXT\nGrizzlies: At Portland on Friday.\nLakers: Host Minnesota on Friday."}
