{"game_id": "0021400403", "chunk_id": "0021400403_001", "order": 1, "role": "lead", "text": "NEW YORK --  The Brooklyn Nets had an easy time in their first game this season without Deron Williams -- until the last few seconds."}
{"game_id": "0021400403", "chunk_id": "0021400403_002", "order": 2, "role": "body", "text": "Mason Plumlee scored 10 of his 21 points in the fourth quarter and Brooklyn held off a late rally for a 110-105 victory over the Detroit Pistons on Sunday."}
{"game_id": "0021400403", "chunk_id": "0021400403_003", "order": 3, "role": "body", "text": "After Mirza Teletovic's layup with 5:31 remaining gave the Nets a seemingly comfortable 98-83 lead, the Pistons pulled to 106-105 on Kentavious Caldwell-Pope's 3-pointer with 9 seconds left."}
{"game_id": "0021400403", "chunk_id": "0021400403_004", "order": 4, "role": "body", "text": "Joe Johnson, who scored 16 points, followed with two free throws. Caldwell-Pope, who finished with 20 points, then missed on a long 3-pointer and Andre Drummond committed a loose ball foul on the rebound"}
{"game_id": "0021400403", "chunk_id": "0021400403_005", "order": 5, "role": "body", "text": "\"Sometimes we get to the point where we try and protect the lead instead of just playing basketball,\" Johnson said. \"We kind of shot ourselves in the foot and let them right back into the game."}
{"game_id": "0021400403", "chunk_id": "0021400403_006", "order": 6, "role": "body", "text": "Kevin Garnett missed the two ensuing free throws. Josh Smith grabbed the rebound and was immediately fouled by Sergey Karasev."}
{"game_id": "0021400403", "chunk_id": "0021400403_007", "order": 7, "role": "body", "text": "Smith also missed both free throws, Garnett grabbed another rebound and this time made both for the final score."}
{"game_id": "0021400403", "chunk_id": "0021400403_008", "order": 8, "role": "body", "text": "Jarrett Jack, who replaced the injured Williams, finished with 15 points and contributed 10 assists as the Nets tied a season high with 29 assists."}
{"game_id": "0021400403", "chunk_id": "0021400403_009", "order": 9, "role": "body", "text": "\"I thought the brand of basketball we put out there tonight was very, very contagious,\" Jack said. \"I just thought it was an enjoyable brand of basketball. Obviously, we need to clean up some things at the end.\""}
{"game_id": "0021400403", "chunk_id": "0021400403_010", "order": 10, "role": "body", "text": "Williams has a strained right calf."}
{"game_id": "0021400403", "chunk_id": "0021400403_011", "order": 11, "role": "body", "text": "Plumlee shot 9 of 10 from the field and had 12 rebounds."}
{"game_id": "0021400403", "chunk_id": "0021400403_012", "order": 12, "role": "body", "text": "\"He's going to be a great player. You can see his progress,\" said Drummond, who finished with 18 points and 20 rebounds. \"He played a great game tonight. Brooklyn is utilizing him the right way. He's going to thrive here.\""}
{"game_id": "0021400403", "chunk_id": "0021400403_013", "order": 13, "role": "body", "text": "Bojan Bogdanovic had 14 points, Teletovic finished with 13 and Garnett added 10 for the Nets."}
{"game_id": "0021400403", "chunk_id": "0021400403_014", "order": 14, "role": "body", "text": "Greg Monroe had 16 points, Smith and Jodie Meeks finished with 13, and Jonas Jerebko added 10 for the Pistons."}
{"game_id": "0021400403", "chunk_id": "0021400403_015", "order": 15, "role": "body", "text": "\"Our defense is just not giving us a chance to win games,\" said coach Stan Van Gundy. \"You're going to give 53 percent, 110 points, 29 free throw attempts, we don't have a chance. That's got to improve or we're not going to have a chance to win.\""}
{"game_id": "0021400403", "chunk_id": "0021400403_017", "order": 17, "role": "body", "text": "Pistons: The Pistons have lost four straight games, with their opponents (Clippers, Mavericks, Raptors, Nets) each scoring at least 110 points. . In their last five games, five different Pistons have led the team in scoring (Monroe, Meeks, Drummond, Jennings, Caldwell-Pope). . Assistant Coach Malik Allen played for the New Jersey Nets during the 2007-08 season, while assistant coach Charles Klask was on Brooklyn's staff in 2013-14."}
{"game_id": "0021400403", "chunk_id": "0021400403_018", "order": 18, "role": "body", "text": "Nets: Williams was the only Nets player to start in each of the team's first 25 games. . In the teams' first meeting this season, a 102-90 Brooklyn win on Nov. 1, the Nets held the Pistons to 1-for-17 shooting (5.9 percent) from 3-point range and matched their season-low with eight turnovers. . Coach Lionel Hollins played for the Pistons during the 1983-84 season."}
{"game_id": "0021400403", "chunk_id": "0021400403_020", "order": 20, "role": "body", "text": "Plumlee is averaging 18 points and 10.2 rebounds while shooting 68.2 percent in his last six games. He is the first Nets player to have 20 points and 10 rebounds in a game while shooting 90 percent or better since Mike Gminski on Nov. 13, 1987, at Chicago."}
{"game_id": "0021400403", "chunk_id": "0021400403_022", "order": 22, "role": "body", "text": "Pistons: Host Indiana on Friday."}
