{"game_id": "0021200570", "chunk_id": "0021200570_001", "order": 1, "role": "lead", "text": "TORONTO -- Sore hamstring or not, Chicago Bulls coach Tom Thibodeau had no problem trusting Luol Deng with the biggest shot of the game."}
{"game_id": "0021200570", "chunk_id": "0021200570_002", "order": 2, "role": "body", "text": "Deng hit a tiebreaking jumper with 3 seconds left in overtime and the Chicago Bulls beat Toronto 107-105 on Wednesday night, their eighth victory in nine meetings against the Raptors."}
{"game_id": "0021200570", "chunk_id": "0021200570_003", "order": 3, "role": "body", "text": "Carlos Boozer had a season-high 36 points and 12 rebounds, and Joakim Noah added 16 points and 14 rebounds for the Bulls."}
{"game_id": "0021200570", "chunk_id": "0021200570_004", "order": 4, "role": "body", "text": "Deng, who played almost 48 minutes despite injuring his right hamstring in the first quarter, made the decisive shot on a pull-up jumper in the closing seconds of overtime."}
{"game_id": "0021200570", "chunk_id": "0021200570_005", "order": 5, "role": "body", "text": "To Thibodeau, Deng's big basket was no surprise."}
{"game_id": "0021200570", "chunk_id": "0021200570_006", "order": 6, "role": "body", "text": "\"The guys that have been around and seen him play a lot know that's what he does -- whatever you need,\" Thibodeau said. \"You need great defense, he does that. You need a rebound in traffic, he does that. You need a big shot, he does that. To me, that's who he is. That's what makes him such a good player.\""}
{"game_id": "0021200570", "chunk_id": "0021200570_007", "order": 7, "role": "body", "text": "Thibodeau initially drew up a different play, but didn't like the matchups when the teams took the court and called timeout again, changing the play to give Deng the shot."}
{"game_id": "0021200570", "chunk_id": "0021200570_008", "order": 8, "role": "body", "text": "That was fine for Deng, an eight-year veteran who said he's learned how to stay calm and comfortable when the pressure mounts."}
{"game_id": "0021200570", "chunk_id": "0021200570_009", "order": 9, "role": "body", "text": "\"I've been in the league for a while now,\" he said. \"I know what I can do and what I can't do. When it comes to the last minutes of the game, I'm not as nervous or worried about what I'm going to do as I used to be. There's a few things that I do well and I'm going to stick to that.\""}
{"game_id": "0021200570", "chunk_id": "0021200570_010", "order": 10, "role": "body", "text": "Deng scored 19 points and Richard Hamilton had 15 as Chicago won its fourth straight road game. The Bulls have won nine of their past 11 away from home."}
{"game_id": "0021200570", "chunk_id": "0021200570_011", "order": 11, "role": "body", "text": "Wearing a clear plastic wrap on his leg after the game, Deng said he \"tweaked\" his hamstring while running early in the first, but was able to continue."}
{"game_id": "0021200570", "chunk_id": "0021200570_012", "order": 12, "role": "body", "text": "\"I just felt like I could play through it,\" he said. \"Coach kept asking me, the training staff kept asking me how it felt. Hopefully it won't be too bad tomorrow.\""}
{"game_id": "0021200570", "chunk_id": "0021200570_013", "order": 13, "role": "body", "text": "Boozer's double-double was his Eastern Conference-leading 21st, and his 11th in 13 games against the Raptors."}
{"game_id": "0021200570", "chunk_id": "0021200570_014", "order": 14, "role": "body", "text": "\"He can score a lot of different ways,\" Thibodeau said. \"Right now he's in a really good rhythm. His teammates are really searching him out.\""}
{"game_id": "0021200570", "chunk_id": "0021200570_015", "order": 15, "role": "body", "text": "Alan Anderson fouled out with 27 points, matching his career-high, and Kyle Lowry had 26 as Toronto lost its third straight."}
{"game_id": "0021200570", "chunk_id": "0021200570_016", "order": 16, "role": "body", "text": "\"This is a game we could have had but some balls didn't bounce our way,\" Lowry said."}
{"game_id": "0021200570", "chunk_id": "0021200570_017", "order": 17, "role": "body", "text": "DeMar DeRozan scored 18 points and Ed Davis had 11 for the Raptors, who were playing the second game of a back-to-back. Toronto lost at Brooklyn on Tuesday."}
{"game_id": "0021200570", "chunk_id": "0021200570_018", "order": 18, "role": "body", "text": "The Bulls led 99-95 with 1:16 left in the fourth when Nate Robinson fouled Lowry on a 3-point attempt. The Raptors' guard missed the first of his three free throws, then made the next two, cutting it to 99-97."}
{"game_id": "0021200570", "chunk_id": "0021200570_019", "order": 19, "role": "body", "text": "Marco Belinelli made 1 of 2 from the line with 1:08 left, putting the Bulls up by three, but Lowry drove past Noah for a layup to make it a one-point game with 53 seconds to play."}
{"game_id": "0021200570", "chunk_id": "0021200570_020", "order": 20, "role": "body", "text": "Belinelli missed a driving layup and the Raptors called time with 28 seconds to go. Lowry missed a long jumper with the shot clock winding down but Taj Gibson picked up his sixth foul as Amir Johnson grabbed the rebound and went to the line with 12 seconds left. He made the first, tying it at 100-all, but missed the second as Boozer grabbed the rebound."}
{"game_id": "0021200570", "chunk_id": "0021200570_021", "order": 21, "role": "body", "text": "Chicago let the clock wind down before Belinelli missed a short jumper. Lowry grabbed the rebound and called timeout, giving Toronto 0.7 seconds to try for the winning shot, but Anderson fumbled DeRozan's inbounds pass, sending it to overtime."}
{"game_id": "0021200570", "chunk_id": "0021200570_022", "order": 22, "role": "body", "text": "After Noah opened the scoring in overtime with a tip-in, Anderson made one of two from the line for Toronto. Boozer answered with a driving layup before Anderson hit a jumper, making it 104-103 with 1:32 to go."}
{"game_id": "0021200570", "chunk_id": "0021200570_023", "order": 23, "role": "body", "text": "Belinelli made one of two from the line to put Chicago up 105-103 with 15 seconds to go, but Lowry tied it again with a running jumper in the lane with 8 seconds left."}
{"game_id": "0021200570", "chunk_id": "0021200570_024", "order": 24, "role": "body", "text": "Deng pulled up and hit a jumper over Landry Fields to put the Bulls on top."}
{"game_id": "0021200570", "chunk_id": "0021200570_025", "order": 25, "role": "body", "text": "\"That's Lou's strength right there,\" Thibodeau said. \"A big shot.\""}
{"game_id": "0021200570", "chunk_id": "0021200570_026", "order": 26, "role": "body", "text": "Raptors coach Dwane Casey was upset that the officials ruled Amir Johnson was passing, not shooting, when Noah fouled him with one second left, leading to an inbounds play instead of free throws."}
{"game_id": "0021200570", "chunk_id": "0021200570_027", "order": 27, "role": "body", "text": "\"I hope the league looks at that,\" Casey said. \"That's all I'm going to say about it, because it's a very questionable, marginal call at the end of the game. We'll see what the ruling is.\""}
{"game_id": "0021200570", "chunk_id": "0021200570_028", "order": 28, "role": "body", "text": "Toronto had one final shot, but Jose Calderon's 3-point attempt bounced off the back rim as the buzzer sounded."}
{"game_id": "0021200570", "chunk_id": "0021200570_029", "order": 29, "role": "body", "text": "Boozer made his first four shots and scored 17 points in the first as Chicago took a 29-22 lead after one."}
{"game_id": "0021200570", "chunk_id": "0021200570_030", "order": 30, "role": "body", "text": "\"When we get points in the paint like that, it makes the game a lot easier,\" Deng said of Boozer. \"I thought it was one of his best games tonight.\""}
{"game_id": "0021200570", "chunk_id": "0021200570_031", "order": 31, "role": "body", "text": "Toronto took its first lead of the game at 38-37 on a 3-pointer by Lowry with 4:59 left in the second. But the lead was short-lived, and Boozer scored six more as Chicago closed the half with a 15-6 run to take a 52-44 lead at the break."}
{"game_id": "0021200570", "chunk_id": "0021200570_032", "order": 32, "role": "body", "text": "Anderson scored 10 points in the third but the Bulls got 13 from Hamilton, who connected on five of six field goal attempts. Chicago led 79-73 heading to the fourth."}
{"game_id": "0021200570", "chunk_id": "0021200570_033", "order": 33, "role": "closing", "text": "Game notes Calderon started for Toronto after suffering a hip injury in Tuesday's loss at Brooklyn. ... Lowry, who missed time Tuesday with a sore left ankle, came off the bench for the Raptors. ... Anderson also played after having dental surgery earlier Wednesday to repair a chipped tooth suffered in the loss to the Nets. ... The Raptors fell to 1-3 in overtime games. ... Chicago is 9-0 when scoring 100 points or more."}
