{"game_id": "0021700877", "chunk_id": "0021700877_001", "order": 1, "role": "lead", "text": "HOUSTON --  James Harden wrapped up another 30-point night and another Rockets victory, then made his way to Minnesota's training room."}
{"game_id": "0021700877", "chunk_id": "0021700877_002", "order": 2, "role": "body", "text": "Even the Timberwolves' opponents were concerned about Jimmy Butler."}
{"game_id": "0021700877", "chunk_id": "0021700877_003", "order": 3, "role": "body", "text": "Harden scored 31 points and Houston won its 11th straight game with a 120-102 victory Friday night over the Timberwolves, who lost Butler to an apparent right knee injury."}
{"game_id": "0021700877", "chunk_id": "0021700877_004", "order": 4, "role": "body", "text": "Butler left the game late in the third quarter. After grabbing a rebound late in the third quarter, the All-Star pivoted and planted hard on his right foot before collapsing and grabbing his right knee. He was on the floor for at least three minutes before he was carried off the court by two teammates. He appeared to avoid putting weight on his right leg when heading to the locker room."}
{"game_id": "0021700877", "chunk_id": "0021700877_005", "order": 5, "role": "body", "text": "Minnesota coach Tom Thibodeau said early evaluations by the team's medical staff were inconclusive and that Butler will undergo an MRI on Saturday."}
{"game_id": "0021700877", "chunk_id": "0021700877_006", "order": 6, "role": "body", "text": "\"You've got to wait for the doctors to do their thing,\" Thibodeau said. \"Until they do the MRI, it's speculating. We'll know more tomorrow. I don't want to speculate on what it might be, but we'll just hope for the best.\""}
{"game_id": "0021700877", "chunk_id": "0021700877_007", "order": 7, "role": "body", "text": "Butler did not speak to reporters after the game but was in high spirits, according to multiple teammates. He was visited in the training room by Harden."}
{"game_id": "0021700877", "chunk_id": "0021700877_008", "order": 8, "role": "body", "text": "\"His first reaction was, `I'm OK, I'll be OK,\" Wolves forward Taj Gibson said. \"But he was smiling. That was a big thing and it was a huge relief for everybody in this locker room. He's a warrior so we've just got to hold it down for him.\""}
{"game_id": "0021700877", "chunk_id": "0021700877_009", "order": 9, "role": "body", "text": "Clint Capela had 25 points and 11 rebounds for Houston, getting his 10th double-double over the past 13 games. Chris Paul added 14 points, 10 rebounds and eight assists."}
{"game_id": "0021700877", "chunk_id": "0021700877_010", "order": 10, "role": "body", "text": "The Rockets trailed for much of the first half before going ahead to maintain the NBA's best record."}
{"game_id": "0021700877", "chunk_id": "0021700877_011", "order": 11, "role": "body", "text": "\"Probably the biggest story was that our defense after the first six minutes was not very good,\" Rockets coach Mike D'Antoni said. \"Then after that, we really locked them up and everybody contributed. Everybody played well and that's what we need going forward.\""}
{"game_id": "0021700877", "chunk_id": "0021700877_012", "order": 12, "role": "body", "text": "The Rockets outrebounded Minnesota 50-42."}
{"game_id": "0021700877", "chunk_id": "0021700877_013", "order": 13, "role": "body", "text": "\"Once we gang rebound, we're off to the races,\" Harden said. \"If we don't, it makes it harder for our offense and then our defense.\""}
{"game_id": "0021700877", "chunk_id": "0021700877_014", "order": 14, "role": "body", "text": "Andrew Wiggins led Minnesota with 21 points, and Jeff Teague and Karl-Anthony Towns both had 18. Towns added 13 rebounds."}
{"game_id": "0021700877", "chunk_id": "0021700877_015", "order": 15, "role": "body", "text": "The Rockets have won 11 straight at home against the Timberwolves and will go for a four-game season series sweep in Minnesota on March 18. In their previous three meetings, Houston overwhelmed Minnesota from beyond the arc, making 19.5 3-pointers per game. But whether it was rust or an improved defensive strategy from Minnesota, Houston was limited to just 14 of 38 3-pointers on Friday night."}
{"game_id": "0021700877", "chunk_id": "0021700877_016", "order": 16, "role": "body", "text": "The Rockets were without guard Eric Gordon, who was a game-time scratch with an illness. P.J. Tucker started in his place and had 11 points in 28 minutes."}
{"game_id": "0021700877", "chunk_id": "0021700877_017", "order": 17, "role": "body", "text": "Trevor Ariza, who missed the previous nine games before the All-Star break with a hamstring injury, was back in the starting rotation and scored 11 points in 26 minutes."}
{"game_id": "0021700877", "chunk_id": "0021700877_018", "order": 18, "role": "body", "text": "The Timberwolves have lost four of their last six."}
{"game_id": "0021700877", "chunk_id": "0021700877_019", "order": 19, "role": "body", "text": "\"Injuries are an unfortunate part of the NBA,\" Thibodeau said. \"The next guy has to get up and be ready to get the job done. Every night is a challenge, but dealing with your injuries and being mentally tough when you face adversity is a big part of winning. We have to find a way to win.\""}
{"game_id": "0021700877", "chunk_id": "0021700877_021", "order": 21, "role": "body", "text": "Timberwolves: After Butler fell to the floor, the play continued and ended with Gibson committing a horse-collar-like takedown of Harden on a layup. Harden made the desperation heave and ensuing free throw to put the Rockets up 14. ... Towns and fellow 7-footer Cole Aldrich served as human crutches in escorting Butler to the locker room."}
{"game_id": "0021700877", "chunk_id": "0021700877_022", "order": 22, "role": "body", "text": "Rockets: With a steal in the third quarter, Paul passed Allen Iverson for 12th on the NBA's career list with 1,984. Mookie Blaylock is 11th with 2,075 steals. ... In his second game with the Rockets, veteran small forward Joe Johnson had 10 points in 22 minutes."}
{"game_id": "0021700877", "chunk_id": "0021700877_024", "order": 24, "role": "body", "text": "After draining 14 3-pointers, the Rockets have hit at least 10 3-pointers in 54 straight games, which is twice as long as the previous NBA record of 27 consecutive games set by Houston last season. Six Rockets had 3s on Friday night, including three apiece from Ariza, Tucker and Harden."}
{"game_id": "0021700877", "chunk_id": "0021700877_026", "order": 26, "role": "body", "text": "Paul arrived to the Toyota Center wearing a tan cowboy hat and a double-breasted button-down western shirt tucked into tight blue jeans with a buckled belt and cowboy boots to complete the ensemble. Friday marked Go Texan Day, which is celebrated in Houston as the kickoff to the Houston Livestock Show and Rodeo."}
{"game_id": "0021700877", "chunk_id": "0021700877_028", "order": 28, "role": "body", "text": "\"For us mortals, it would be real difficult, but for somebody like him, not much. I've known Joe forever and he's a machine. He just keeps playing, doesn't get tired, he's strong and just really understated in his game.\" -- D'Antoni, on 16-year veteran Johnson."}
{"game_id": "0021700877", "chunk_id": "0021700877_030", "order": 30, "role": "body", "text": "Timberwolves: Host Chicago on Saturday night."}
{"game_id": "0021700877", "chunk_id": "0021700877_031", "order": 31, "role": "closing", "text": "Rockets: Visit Denver on Sunday night."}
