{"game_id": "0022100335", "chunk_id": "0022100335_001", "order": 1, "role": "lead", "text": "ATLANTA -- — After playing only .500 ball through 22 games, the Philadelphia 76ers finally produced a win capable of turning around their season."}
{"game_id": "0022100335", "chunk_id": "0022100335_002", "order": 2, "role": "body", "text": "Joel Embiid scored 28 points, including a jumper with 42 seconds  remaining that gave Philadelphia its first lead of the second half, and the 76ers took a 98-96 comeback win over Trae Young and the Atlanta Hawks on Friday night."}
{"game_id": "0022100335", "chunk_id": "0022100335_003", "order": 3, "role": "body", "text": "Embiid snapped a 96-all tie with the 13-foot jumper. Seth Curry then stole a pass from John Collins — the 76ers' ninth steal. Danilo Gallinari missed a potential winning 3-pointer as time expired."}
{"game_id": "0022100335", "chunk_id": "0022100335_004", "order": 4, "role": "body", "text": "“Just a tough, gut-it-out win,” Curry said. “... We got down and nobody gave in, and made some big stops.”"}
{"game_id": "0022100335", "chunk_id": "0022100335_005", "order": 5, "role": "body", "text": "When the last-gasp attempt by Gallinari bounced off the rim, Embiid jumped into the air, clinching his fists as he celebrated the win."}
{"game_id": "0022100335", "chunk_id": "0022100335_006", "order": 6, "role": "body", "text": "Embiid added 12 rebounds for Philadelphia, which has won each of its first two games against the Hawks. Friday night was Philadelphia’s first visit to Atlanta since losing to the Hawks in last season’s Eastern Conference semifinal."}
{"game_id": "0022100335", "chunk_id": "0022100335_007", "order": 7, "role": "body", "text": "Philadelphia outscored Atlanta 20-9 in the fourth quarter."}
{"game_id": "0022100335", "chunk_id": "0022100335_008", "order": 8, "role": "body", "text": "“We had some shots that just didn’t go in, but you have to give credit to them,” Young said. “They out-physicaled us in the fourth quarter.”"}
{"game_id": "0022100335", "chunk_id": "0022100335_009", "order": 9, "role": "body", "text": "Young led Atlanta with 25 points. He failed to extend his streak of five games with 30 or more points but had 10 assists."}
{"game_id": "0022100335", "chunk_id": "0022100335_010", "order": 10, "role": "body", "text": "The return to Atlanta was a good setting for a morale-boosting win."}
{"game_id": "0022100335", "chunk_id": "0022100335_011", "order": 11, "role": "body", "text": "“Right, wrong or indifferent, we’ve lost a bunch of close games this year,” said Philadelphia's Georges Niang, who scored 13 points. “Never apologize for winning, especially when you can get a win on the road against a good team. You’re going to be excited, and we are.”"}
{"game_id": "0022100335", "chunk_id": "0022100335_012", "order": 12, "role": "body", "text": "The 76ers rallied after trailing 90-80. Curry, who had 18 points, made a layup to cut the lead to 92-91. Following Atlanta's timeout, Young sank a 16-foot jumper, Collins blocked a layup by Tyrese Maxey, and Young pushed the lead back to five by making a short floater."}
{"game_id": "0022100335", "chunk_id": "0022100335_013", "order": 13, "role": "body", "text": "The 76ers again answered, this time with a 3-pointer from Curry and tying basket by Embiid."}
{"game_id": "0022100335", "chunk_id": "0022100335_014", "order": 14, "role": "body", "text": "Collins and Gallinari each had 18 points."}
{"game_id": "0022100335", "chunk_id": "0022100335_015", "order": 15, "role": "body", "text": "Atlanta led 67-66 in the third period before Young scored the final five points of a 7-0 run that stretched the lead to eight."}
{"game_id": "0022100335", "chunk_id": "0022100335_016", "order": 16, "role": "body", "text": "After scoring only six points in the first period, Young had eight points, including two 3s as the Hawks took the lead with a 12-4 run in the second period. Young's step-back 3 gave Atlanta a 47-39 lead."}
{"game_id": "0022100335", "chunk_id": "0022100335_018", "order": 18, "role": "body", "text": "76ers: F Tobias Harris did not play due to a non-COVID illness that coach Doc Rivers said was the flu that “hit him really hard.” Harris missed six games from Nov. 1-9 after testing positive for COVID-19. The 76ers also have had Embiid, who missed nine games, and Danny Green held out because of COVID-19. “At some point we're going to catch a stretch when we're healthy,” Rivers said, adding his emphasis is “to just focus on winning, not who is not here.” ... The 76ers took a 122-94 home win over Atlanta on Oct. 30."}
{"game_id": "0022100335", "chunk_id": "0022100335_019", "order": 19, "role": "body", "text": "Hawks: F Cam Reddish was held out with a non-COVID illness. G Bogdan Bogdanovic (right ankle sprain) missed his second consecutive game. Timothe Luwawu-Cabarrot again made a fill-in start."}
{"game_id": "0022100335", "chunk_id": "0022100335_021", "order": 21, "role": "body", "text": "Beth Mowins became the first female broadcaster to handle play-by-play duties on an NBA regular-season game for ESPN. Nate McMillan presented Mowins with a Hawks No. 1 jersey before the game in recognition of the feat."}
{"game_id": "0022100335", "chunk_id": "0022100335_023", "order": 23, "role": "body", "text": "Hawks coach Nate McMillan returned after sitting out Wednesday’s 114-111 win at Indiana after his son, assistant coach Jamelle McMillan, entered the NBA’s COVID-19 health and safety protocols. Despite his absence, it was Nate McMillan’s 700th career win."}
{"game_id": "0022100335", "chunk_id": "0022100335_024", "order": 24, "role": "body", "text": "Jamelle McMillan also returned to the bench following two negative COVID tests."}
{"game_id": "0022100335", "chunk_id": "0022100335_025", "order": 25, "role": "body", "text": "“We think it was a false positive,” Nate McMillan said."}
{"game_id": "0022100335", "chunk_id": "0022100335_027", "order": 27, "role": "body", "text": "76ers: Continue four-game road trip at Charlotte on Monday."}
{"game_id": "0022100335", "chunk_id": "0022100335_028", "order": 28, "role": "body", "text": "Hawks: Host Charlotte on Sunday."}
