{"game_id": "0022100064", "chunk_id": "0022100064_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Collin Sexton scored 26 points, Darius Garland added 16 and the Cleveland Cavaliers led all the way in beating the Los Angeles Clippers 92-79 on Wednesday night."}
{"game_id": "0022100064", "chunk_id": "0022100064_002", "order": 2, "role": "body", "text": "It was the Cavs’ first road win against the Clippers since March 13, 2016."}
{"game_id": "0022100064", "chunk_id": "0022100064_003", "order": 3, "role": "body", "text": "Sexton took off on a fast break in the second quarter and threw down a slam dunk on Nicolas Batum that caught the attention of LeBron James."}
{"game_id": "0022100064", "chunk_id": "0022100064_004", "order": 4, "role": "body", "text": "“My goodness Young Bull!” James tweeted, using Sexton’s nickname. “With the left too.”"}
{"game_id": "0022100064", "chunk_id": "0022100064_005", "order": 5, "role": "body", "text": "Sexton joked, “He wasn't expecting that one.”"}
{"game_id": "0022100064", "chunk_id": "0022100064_006", "order": 6, "role": "body", "text": "“I’ve just been trying to lay the ball up. Coach has been pretty much telling me just go to the basket,” Sexton said. “I was just going and I took off.”"}
{"game_id": "0022100064", "chunk_id": "0022100064_007", "order": 7, "role": "body", "text": "Evan Mobley had 12 points and 10 rebounds in his homecoming. The former Southern California star taken third overall in the draft has scored in double figures in all five games so far."}
{"game_id": "0022100064", "chunk_id": "0022100064_008", "order": 8, "role": "body", "text": "“Feels great to be back home,” Mobley said. “I had a lot of family cheering for me and it felt great playing in front of them.”"}
{"game_id": "0022100064", "chunk_id": "0022100064_009", "order": 9, "role": "body", "text": "Mobley made an impression, too. He dunked over Ivica Zubac and later blocked his fellow 7-footer on a drive in the first quarter."}
{"game_id": "0022100064", "chunk_id": "0022100064_010", "order": 10, "role": "body", "text": "Batum scored a season-high 16 points and Reggie Jackson added 16 for the Clippers on a night when Paul George struggled."}
{"game_id": "0022100064", "chunk_id": "0022100064_011", "order": 11, "role": "body", "text": "He missed his first seven shots and finished 6 of 20, went 0 for 8 from 3-point range, and had 12 points and 10 rebounds to go with four fouls. George, along with fellow starters Batum and Jackson, failed to score in the opening quarter."}
{"game_id": "0022100064", "chunk_id": "0022100064_012", "order": 12, "role": "body", "text": "“After a night like this, the only way is to get better,” George said."}
{"game_id": "0022100064", "chunk_id": "0022100064_013", "order": 13, "role": "body", "text": "Jackson added, “Yeah, they beat us up pretty good all around.”"}
{"game_id": "0022100064", "chunk_id": "0022100064_014", "order": 14, "role": "body", "text": "Zubac dunked and scored on consecutive possessions to get the Clippers within four to start the fourth. But the Cavs outscored them 14-4 to extend their lead to 16 points."}
{"game_id": "0022100064", "chunk_id": "0022100064_015", "order": 15, "role": "body", "text": "The Clippers were coming off a 30-point rout of Portland on Monday, when they had 21 steals, 37 assists and forced 30 turnovers."}
{"game_id": "0022100064", "chunk_id": "0022100064_016", "order": 16, "role": "body", "text": "That team didn't show up against the Cavs."}
{"game_id": "0022100064", "chunk_id": "0022100064_017", "order": 17, "role": "body", "text": "LA shot 31 of 87 and was 9 of 41 from 3-point range. Cleveland wasn't much better, hitting 33 of 81 and making 3 of 20 3-pointers. But the Cavs controlled the paint, 48-34, and their bench outscored LA's reserves, 27-18."}
{"game_id": "0022100064", "chunk_id": "0022100064_018", "order": 18, "role": "body", "text": "“We left a little on the table offensively, but you can’t knock what these guys are doing on the floor defensively now,” Cavs coach J.B. Bickerstaff said. “Our guys are sacrificing whatever the moment is to go win the basketball game.”"}
{"game_id": "0022100064", "chunk_id": "0022100064_019", "order": 19, "role": "body", "text": "After opening the season 0-2, Cleveland won its third in a row. The Cavs snapped a seven-game overall skid and a four-game road losing streak to the Clippers."}
{"game_id": "0022100064", "chunk_id": "0022100064_020", "order": 20, "role": "body", "text": "“They’re creating that identity of who we are and how we’re going to play,” Bickerstaff said. “We’re early so I don’t want to jump the gun here, but their attitude has been to try and quench that thirst. That’s the thing to me that’s been most impressive.”"}
{"game_id": "0022100064", "chunk_id": "0022100064_021", "order": 21, "role": "body", "text": "Three times the Clippers closed within three in the third. Jackson hit back-to-back 3s that pulled them to 63-62."}
{"game_id": "0022100064", "chunk_id": "0022100064_022", "order": 22, "role": "body", "text": "Earlier, veterans Kevin Love and Ricky Rubio propelled a 7-0 run that included Lamar Stevens' dunk off Love's miss to push Cleveland's lead back to double digits, 63-53."}
{"game_id": "0022100064", "chunk_id": "0022100064_023", "order": 23, "role": "body", "text": "The Cavs led by 15 points before George made his first basket of the game in the second. He hit three in a row and Jackson got his first points during a 17-9 run that closed the first half with Cleveland ahead 47-40."}
{"game_id": "0022100064", "chunk_id": "0022100064_025", "order": 25, "role": "body", "text": "Cavaliers: Mobley will need more tickets again Friday when his family and friends come to see him against the Lakers. ... Jarrett Allen had four points and eight rebounds after double-doubles in his last two games. ... G Isaac Okoro (left hamstring strain) sat out."}
{"game_id": "0022100064", "chunk_id": "0022100064_026", "order": 26, "role": "body", "text": "Clippers: Their lone victory so far was against the Blazers."}
{"game_id": "0022100064", "chunk_id": "0022100064_028", "order": 28, "role": "body", "text": "Cavaliers: Play Lakers on Friday as part of their five-game trip."}
{"game_id": "0022100064", "chunk_id": "0022100064_029", "order": 29, "role": "body", "text": "Clippers: Visit Portland on Friday in their second road game of the season."}
