{"game_id": "0022100336", "chunk_id": "0022100336_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Kevin Durant scored 30 points, including the clinching jumper with 11 seconds left, and the Brooklyn Nets held off the Minnesota Timberwolves 110-105 on Friday night."}
{"game_id": "0022100336", "chunk_id": "0022100336_002", "order": 2, "role": "body", "text": "Durant was 12 of 13 on free throws and Patty Mills added 23 points for the Nets, who won for the fifth time in six games and improved their Eastern Conference-leading record to 16-6."}
{"game_id": "0022100336", "chunk_id": "0022100336_003", "order": 3, "role": "body", "text": "James Harden finished with 20 points, nine assists and seven rebounds. LaMarcus Aldridge scored 13 points."}
{"game_id": "0022100336", "chunk_id": "0022100336_004", "order": 4, "role": "body", "text": "“We stayed with our defense,” Durant said. “We made them shoot over us. We got stops (and) we were able to make shots down the stretch.”"}
{"game_id": "0022100336", "chunk_id": "0022100336_005", "order": 5, "role": "body", "text": "Former Nets guard D’Angelo Russell scored 21 points for the Timberwolves, who have lost three of five. Naz Reid and Anthony Edwards finished with 19 apiece, and Malik Beasley had 18."}
{"game_id": "0022100336", "chunk_id": "0022100336_007", "order": 7, "role": "body", "text": "Russell's pull-up jumper on the first possession of the fourth quarter gave Minnesota an 87-86 lead and he made another for a 95-91 edge with 9:33 left."}
{"game_id": "0022100336", "chunk_id": "0022100336_008", "order": 8, "role": "body", "text": "The Nets regained the lead with a 6-0 spurt midway through the fourth quarter, going ahead 105-101. Minnesota cut the deficit to 107-105 on Edwards' basket but Harden knocked down a free throw and Durant drilled a mid-range jumper with 11 seconds left to seal the win."}
{"game_id": "0022100336", "chunk_id": "0022100336_009", "order": 9, "role": "body", "text": "“I know how important the fourth quarter is, especially in a tight game,” said Durant. “I was able to get to my spots in the fourth and knock some in.”"}
{"game_id": "0022100336", "chunk_id": "0022100336_010", "order": 10, "role": "body", "text": "Brooklyn took a one-point lead on Durant's three-point play with 1:20 left in the first half, and extended it to as much as seven points three times in the third quarter. But the pesky Timberwolves kept hanging around and only trailed 86-85 entering the fourth."}
{"game_id": "0022100336", "chunk_id": "0022100336_011", "order": 11, "role": "body", "text": "“They (tried) to muck it up and stay in the game,” Durant said. “You have to appreciate that and respect that as an opponent.”"}
{"game_id": "0022100336", "chunk_id": "0022100336_012", "order": 12, "role": "body", "text": "After a raggedly played opening 24 minutes for both sides, it was the Nets who led 59-55 at halftime. The Nets went to the foul line 24 times in the first two quarters, and made 19 free throws. By comparison, Minnesota made 13 of 14 free throws in the first half. Both teams committed 11 turnovers."}
{"game_id": "0022100336", "chunk_id": "0022100336_013", "order": 13, "role": "body", "text": "“There were a lot of things we could (have done differently),” Reid said of the first half. “A lot of bonehead turnovers that we could have possibly got a shot at the rim.”"}
{"game_id": "0022100336", "chunk_id": "0022100336_014", "order": 14, "role": "body", "text": "The Timberwolves were short-handed, as starting center Karl-Anthony Towns (bruised tailbone), reserve point guard Patrick Beverley (left adductor strain) and Jaden McDaniels (flu-like symptoms) did not play."}
{"game_id": "0022100336", "chunk_id": "0022100336_016", "order": 16, "role": "body", "text": "Timberwolves: After missing the playoffs 16 times in the last 21 seasons, Minnesota hopes to turn a corner under coach Chris Finch, who has the Timberwolves in eighth place in the Western Conference. Finch credited his players for “incredible buy in” to the approach he and the coaching staff have implemented, as well as their maturity. “Sometimes it’s about when you get these guys in their career,” Finch said. “They’re ready, actually, to turn the page to another point in their career and (they are) very focused on playoffs, opportunities, team success; doing all the things you need to do to win at a higher level on every given night.”"}
{"game_id": "0022100336", "chunk_id": "0022100336_017", "order": 17, "role": "body", "text": "Nets: The short-handed Nets took another step closer to being at full strength with the return of reserve big man Nic Claxton. Claxton, 22, had missed 17 straight games with an undisclosed illness after playing in the first four games of Brooklyn’s season. “It’s not like he’s coming back to play 25 minutes a night. We want to give him opportunities to grow and improve his fitness,” coach Steve Nash said before the game, stressing he would wait to see if a situation “presents itself” to get Claxton playing time."}
{"game_id": "0022100336", "chunk_id": "0022100336_019", "order": 19, "role": "body", "text": "Timberwolves: Host Atlanta Monday night."}
{"game_id": "0022100336", "chunk_id": "0022100336_020", "order": 20, "role": "body", "text": "Nets: Host Chicago Saturday night."}
{"game_id": "0022100336", "chunk_id": "0022100336_022", "order": 22, "role": "closing", "text": "MORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports"}
