{"game_id": "0022101112", "chunk_id": "0022101112_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — De’Anthony Melton had 24 points, Desmond Bane added 20 and the Memphis Grizzlies continued to win in the absence of scoring leader Ja Morant, beating the Milwaukee Bucks 127-102 on Saturday night."}
{"game_id": "0022101112", "chunk_id": "0022101112_002", "order": 2, "role": "body", "text": "Dillon Brooks scored 19 points and Jaren Jackson Jr. had 16 and two blocks to help Memphis win its fourth straight and eighth in the last nine games. Melton was 8 of 11 from the field, going 6 of 9 from 3-point range."}
{"game_id": "0022101112", "chunk_id": "0022101112_003", "order": 3, "role": "body", "text": "“I’m just trying to go out there and hoop,” Melton said. “Have fun with it. Play with confidence and do what the team needs me to do.”"}
{"game_id": "0022101112", "chunk_id": "0022101112_004", "order": 4, "role": "body", "text": "Giannis Antetokounmpo led the Bucks with 30 points, 11 rebounds and four blocks, scoring 18 points in the third quarter when Milwaukee tried to make a run. Khris Middleton added 16 points. The defending champion Bucks lost for only the third time in the last 13 games."}
{"game_id": "0022101112", "chunk_id": "0022101112_005", "order": 5, "role": "body", "text": "Milwaukee dropped into a tie for third with Boston in the Eastern Conference, a half-game behind Philadelphia and Miami."}
{"game_id": "0022101112", "chunk_id": "0022101112_006", "order": 6, "role": "body", "text": "Antetokounmpo was listed as questionable before the game with a sore right knee, but after going through pregame warmups was deemed ready to play. Meanwhile, the Grizzlies continued to play without Morant who is nursing a sore right knee and is not expected to return until near the end of the regular season."}
{"game_id": "0022101112", "chunk_id": "0022101112_007", "order": 7, "role": "body", "text": "“They just do a lot of things that are about winning basketball,” Bucks coach Mike Budenholzer said, adding: \"Credit to their players, to (Memphis coach Taylor Jenkins), the coaching staff. They just keep playing no matter who’s in.”"}
{"game_id": "0022101112", "chunk_id": "0022101112_008", "order": 8, "role": "body", "text": "The Bucks had trouble connecting on their first-half shots and were under 30% overall near the midway point of the second quarter. Antetokounmpo was 3 of 11 in the first half, part of Milwaukee’s 32% shooting."}
{"game_id": "0022101112", "chunk_id": "0022101112_009", "order": 9, "role": "body", "text": "Bane and Melton had 12 apiece as Memphis led 59-46 at the break."}
{"game_id": "0022101112", "chunk_id": "0022101112_010", "order": 10, "role": "body", "text": "Antetokounmpo came out with much more aggression in the second half making his way to the basket and helping Milwaukee chip into the Memphis lead. But near the three-minute mark, Melton connected on a trio of 3-pointers to take the Grizzlies lead to 22."}
{"game_id": "0022101112", "chunk_id": "0022101112_011", "order": 11, "role": "body", "text": "Memphis led 98-79 entering the fourth."}
{"game_id": "0022101112", "chunk_id": "0022101112_012", "order": 12, "role": "body", "text": "“It felt like (Antetokounmpo) tried to will us back into the game,” Budenholzer said. “It felt like we had some momentum for some small stretches there in the third quarter, where I felt like we might get back in it."}
{"game_id": "0022101112", "chunk_id": "0022101112_013", "order": 13, "role": "body", "text": "“But we weren’t able to sustain it.”"}
{"game_id": "0022101112", "chunk_id": "0022101112_014", "order": 14, "role": "body", "text": "For the Grizzlies, they continue to win with Morant on the shelf. They are now 17-2 with their leading scorer not playing. Jenkins credits the success to a balanced team."}
{"game_id": "0022101112", "chunk_id": "0022101112_015", "order": 15, "role": "body", "text": "“We’re just sticking with our identity,” Jenkins said. “It doesn’t matter if you’re a starter, bench, mixed lineups. Whatever we do, we do to the best of our abilities.”"}
{"game_id": "0022101112", "chunk_id": "0022101112_017", "order": 17, "role": "body", "text": "Melton has connected on 26 of 44 3-pointers in the last six game – a 59% clip. As for the secret to his recent success, Melton said his family is in town. He said they “instill confidence in me.”"}
{"game_id": "0022101112", "chunk_id": "0022101112_018", "order": 18, "role": "body", "text": "“Even if I do go out there and play soft or something like that, I’ve got to go home and hear that from them,” he said. “I’m just trying to go out there, play hard, play my game and keep them off my back a little bit.”"}
{"game_id": "0022101112", "chunk_id": "0022101112_020", "order": 20, "role": "body", "text": "Bucks: Jrue Holiday, who had led the team in scoring the last two games and was averaging 23 points in the last five, sat out with left ankle soreness. … Middleton passed Vin Baker for 11th place on the Bucks’ career rebounding list. Baker had 3,080. …Saw an end to their four-game winning streak in Memphis. … Bobby Portis Jr. had a season-high eight offensive rebounds."}
{"game_id": "0022101112", "chunk_id": "0022101112_021", "order": 21, "role": "body", "text": "Grizzlies: Memphis has a seven-game home winning streak. … Steven Adams grabbed his third offensive rebound in the second half to set a new single-season franchise record. He passed Zach Randolph who had 330 offensive boards in 2009-10. … Tyus Jones finished with 13 points and 10 assists."}
{"game_id": "0022101112", "chunk_id": "0022101112_023", "order": 23, "role": "body", "text": "Bucks: At Philadelphia on Tuesday night."}
{"game_id": "0022101112", "chunk_id": "0022101112_024", "order": 24, "role": "body", "text": "Grizzlies: Host Golden State on Monday night."}
