{"game_id": "0022100896", "chunk_id": "0022100896_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Terry Rozier and Kelly Oubre Jr. each scored 23 points and the Charlotte Hornets emerged from the All-Star break looking reenergized with a 125-93 rout of the Toronto Raptors on Friday night."}
{"game_id": "0022100896", "chunk_id": "0022100896_002", "order": 2, "role": "body", "text": "Montrezl Harrell added 20 points and 10 rebounds for the Hornets. They never trailed and led by 41 points near the end of the third quarter."}
{"game_id": "0022100896", "chunk_id": "0022100896_003", "order": 3, "role": "body", "text": "Charlotte entered the break looking like a tired team, having lost nine of 10 games while shooting 29% from 3-point range during that span. But the Hornets made 15 of 40 from beyond the arc and shot 55.3% overall from the field against the Raptors while racking up 34 assists."}
{"game_id": "0022100896", "chunk_id": "0022100896_004", "order": 4, "role": "body", "text": "“We needed it,” Hornets coach James Borrego said about the break. “We could have used it a few weeks before that, but that's OK. ... What can you do differently to the shoot the ball better? You rest your legs — that’s really the bottom line.\""}
{"game_id": "0022100896", "chunk_id": "0022100896_005", "order": 5, "role": "body", "text": "Rozier, who was 10 of 16 from the field, said he didn't even touch a basketball over the All-Star break."}
{"game_id": "0022100896", "chunk_id": "0022100896_006", "order": 6, "role": "body", "text": "“I was good for us to get a reset over the break,” Rozier said."}
{"game_id": "0022100896", "chunk_id": "0022100896_007", "order": 7, "role": "body", "text": "Scottie Barnes had a career-high 28 points for the Raptors."}
{"game_id": "0022100896", "chunk_id": "0022100896_008", "order": 8, "role": "body", "text": "The Hornets raced to a 14-2 lead after holding the Raptors to 1-of-10 shooting. They extended the lead to 70-47 at halftime as P.J. Washington hit back-to-back 3-pointers and had a fast-break dunk off a steal."}
{"game_id": "0022100896", "chunk_id": "0022100896_009", "order": 9, "role": "body", "text": "Charlotte used a 19-0 run in the third quarter to push its lead to 41, which included 7-foot center Mason Plumlee bringing the crowd to its feet when used a behind-the-back dribble to shake his man, and drive down the lane for a rim-rocking two-handed dunk."}
{"game_id": "0022100896", "chunk_id": "0022100896_010", "order": 10, "role": "body", "text": "The Hornets outscored the Raptors 37-14 in the third quarter to snap a seven-game home losing streak."}
{"game_id": "0022100896", "chunk_id": "0022100896_011", "order": 11, "role": "body", "text": "“The only thing we can say is to hopefully get a little conditioning and get a little rust off from the break and we can bounce back tomorrow and get our guys going here tomorrow,\" Raptors coach Nick Nurse said. \"I know we will play better tomorrow.”"}
{"game_id": "0022100896", "chunk_id": "0022100896_012", "order": 12, "role": "body", "text": "The Hornets outrebounded the Raptors 52-36 and scored 18 points off 17 Toronto turnovers."}
{"game_id": "0022100896", "chunk_id": "0022100896_013", "order": 13, "role": "body", "text": "Charlotte is looking to reach the postseason after falling to ninth place in the Eastern Conference and two games under .500. But Borrego believes his team's best basketball is ahead of them, saying the team had come off two days great days of practice."}
{"game_id": "0022100896", "chunk_id": "0022100896_014", "order": 14, "role": "body", "text": "“It’s about staying focus and disciplined — regardless of who the opponent it,\" Borrego said. “I feel like this group is locked in right now. What is behind us is behind us.”"}
{"game_id": "0022100896", "chunk_id": "0022100896_016", "order": 16, "role": "body", "text": "Nurse said Pascal Siakam had some flu-like symptoms before the game, but decided to play anyway. Siakam was limited to eight points on 3 of 13 shooting and had just three rebounds."}
{"game_id": "0022100896", "chunk_id": "0022100896_018", "order": 18, "role": "body", "text": "The Hornets are getting a huge impact from Harrell since he joined the team via trade before the All-Star break."}
{"game_id": "0022100896", "chunk_id": "0022100896_019", "order": 19, "role": "body", "text": "In five games he's averaged 18.2 points and eight rebounds off the bench and provided a boost of defensive energy."}
{"game_id": "0022100896", "chunk_id": "0022100896_020", "order": 20, "role": "body", "text": "“He’s a hell of a ball player, a hell of a leader and a hell of a talker,” Rozier said of his former teammate at Louisville. “I'm pretty sure the crowd loves him. We are happy to have him.”"}
{"game_id": "0022100896", "chunk_id": "0022100896_022", "order": 22, "role": "body", "text": "Raptors: Forward OG Anunoby did not play after he popped up on the injury report Friday with a fractured finger on his right hand. ... Made 6 of 23 3-point attempts."}
{"game_id": "0022100896", "chunk_id": "0022100896_023", "order": 23, "role": "body", "text": "Hornets: Continued to play without Gordon Hayward (ankle), Jalen McDaniels (ankle) and Nick Richards (foot), but Cody Martin was able to return after missing multiple weeks to give the Hornets more depth. However, Martin was limited in the second half due to back tightness. ... Charlotte was a plus-46 with Rozier on the floor."}
{"game_id": "0022100896", "chunk_id": "0022100896_025", "order": 25, "role": "body", "text": "Raptors: At Atlanta on Saturday night."}
{"game_id": "0022100896", "chunk_id": "0022100896_026", "order": 26, "role": "body", "text": "Hornets: Host Detroit on Sunday night."}
