{"game_id": "0022100797", "chunk_id": "0022100797_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Jimmy Butler scored 27 points, Bam Adebayo added 20 points and 12 rebounds and the Miami Heat used a dominant third quarter to hand the struggling Charlotte Hornets their fourth straight loss, 104-86 on Saturday night."}
{"game_id": "0022100797", "chunk_id": "0022100797_002", "order": 2, "role": "body", "text": "Tyler Herro had 19 points behind five 3-pointers for Miami (34-20), which scored 27 points off 20 turnovers by Charlotte while holding the Hornets to 38.4% shooting from the floor."}
{"game_id": "0022100797", "chunk_id": "0022100797_003", "order": 3, "role": "body", "text": "The Hornets led 51-46 halftime before things unraveled."}
{"game_id": "0022100797", "chunk_id": "0022100797_004", "order": 4, "role": "body", "text": "Miami, which shot just 2 of 16 from beyond the arc in the first half, outscored Charlotte 35-8 in the third quarter to take control as turnovers led to easy buckets in transition. It was the fewest points the Hornets have scored in a quarter since March 21, 2016."}
{"game_id": "0022100797", "chunk_id": "0022100797_005", "order": 5, "role": "body", "text": "Adebayo had 10 points in the third quarter and dominated inside the paint."}
{"game_id": "0022100797", "chunk_id": "0022100797_006", "order": 6, "role": "body", "text": "“We have a bunch of guys on this team who know how to score in bunches,” Herro said."}
{"game_id": "0022100797", "chunk_id": "0022100797_007", "order": 7, "role": "body", "text": "Frustration set in for the Hornets before the start of the fourth quarter when coach James Borrego said something to guard James Bouknight, who was seated on the bench after playing the final 14 seconds of the third quarter."}
{"game_id": "0022100797", "chunk_id": "0022100797_008", "order": 8, "role": "body", "text": "Bouknight appeared to take offense to what was said, and stood up to confront Borrego before a teammate tugged at the back of his jersey to hold him back. An assistant coach quickly stepped in and escorted the team's first-round draft pick to the locker room without further incident."}
{"game_id": "0022100797", "chunk_id": "0022100797_009", "order": 9, "role": "body", "text": "Bouknight did not return to the bench, and the Hornets did not make him available to speak to reporters after the game."}
{"game_id": "0022100797", "chunk_id": "0022100797_010", "order": 10, "role": "body", "text": "“Obviously, we were all frustrated, all of us, in the third quarter, early fourth, and it got a little emotional there,\" Borrego said. \"Beyond that, I’ll leave it there.”"}
{"game_id": "0022100797", "chunk_id": "0022100797_011", "order": 11, "role": "body", "text": "Bouknight entered the night having played in only 24 of the team's 53 games, averaging 10.4 minutes and 5 points per game."}
{"game_id": "0022100797", "chunk_id": "0022100797_012", "order": 12, "role": "body", "text": "When asked if Bouknight is frustrated over a lack of playing time, Borrego responded: \"He’s in a tough spot and he obviously wants to play. I get that. I understand that. He’s a kid we believe in, trust in. We’re going to find more minutes for him.”"}
{"game_id": "0022100797", "chunk_id": "0022100797_013", "order": 13, "role": "body", "text": "Terry Rozier had 16 points and Miles Bridges 15 for Charlotte (28-26), which fell to 1-9 on the second night of back-to-backs."}
{"game_id": "0022100797", "chunk_id": "0022100797_014", "order": 14, "role": "body", "text": "The Heat, who are 2-2 so far on a six-game road trip, caught a break as coach Erik Spoelstra was able rest his veteran players for the entire fourth quarter with game well in hand."}
{"game_id": "0022100797", "chunk_id": "0022100797_015", "order": 15, "role": "body", "text": "While Spoelstra said the team's defense in the third quarter was key, he was happy to see the ball moving on offense and players finding the open guy."}
{"game_id": "0022100797", "chunk_id": "0022100797_016", "order": 16, "role": "body", "text": "Miami shot 50% from the field in the second half."}
{"game_id": "0022100797", "chunk_id": "0022100797_017", "order": 17, "role": "body", "text": "“Guys didn’t really care necessarily who was shooting as long as the guy was open,” Spoelstra said. \"They were working together to move the bodies and the ball to find that open guy. That was inspiring to see.”"}
{"game_id": "0022100797", "chunk_id": "0022100797_019", "order": 19, "role": "body", "text": "LaMelo Ball played only six minutes in the second half and finished with 12 points and six rebounds. The second-year point guard took a few ill-advised shots, including jacking up two 3-pointers after crossing half court instead of passing the ball."}
{"game_id": "0022100797", "chunk_id": "0022100797_020", "order": 20, "role": "body", "text": "“I think he's trying to play the right way,\" Borrego said. \"Obviously there is some shot selection and (game) management that is work in progress for him. But we just have to stick with it. He's trying to figure it out, as am I, and we will do it together.”"}
{"game_id": "0022100797", "chunk_id": "0022100797_022", "order": 22, "role": "body", "text": "The Hornets aren't getting much from veteran small forward Gordon Hayward since he returned to the team after missing six games in the league's health and safety protocols. Hayward was 0 for 7 from the field against the Heat and is just 3 of 20 overall in the two games since he's been back."}
{"game_id": "0022100797", "chunk_id": "0022100797_023", "order": 23, "role": "body", "text": "Borrego doesn't seem too worried."}
{"game_id": "0022100797", "chunk_id": "0022100797_024", "order": 24, "role": "body", "text": "“He needs to get his legs back underneath him and we want him to keep shooting it,\" Borrego said."}
{"game_id": "0022100797", "chunk_id": "0022100797_026", "order": 26, "role": "body", "text": "Heat: Caleb Martin returned to action against his former team — and his brother Cody — after missing a game with an Achilles injury. He received a hug from Borrego at the scorer's table before checking into the game."}
{"game_id": "0022100797", "chunk_id": "0022100797_027", "order": 27, "role": "body", "text": "Hornets: Bridges has made just two of his last 22 3-point field goal attempts."}
{"game_id": "0022100797", "chunk_id": "0022100797_029", "order": 29, "role": "body", "text": "Heat: At Washington on Monday night."}
{"game_id": "0022100797", "chunk_id": "0022100797_030", "order": 30, "role": "body", "text": "Hornets: Host Toronto on Monday night."}
