{"game_id": "0022100532", "chunk_id": "0022100532_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Jimmy Butler scored a season-high 37 points and the short-handed Miami Heat built a big lead early and held on for a 120-110 win over the Houston Rockets on Friday night."}
{"game_id": "0022100532", "chunk_id": "0022100532_002", "order": 2, "role": "body", "text": "The Heat extended their winning streak to five games in their return to action after Wednesday’s game at San Antonio was postponed because Miami didn’t have enough players. They signed Mario Chalmers and Chris Silva to 10-day contracts on Friday as reinforcements with seven players still out because of COVID protocols."}
{"game_id": "0022100532", "chunk_id": "0022100532_003", "order": 3, "role": "body", "text": "Butler embraced the challenge of keeping the team on track with so many players unavailable."}
{"game_id": "0022100532", "chunk_id": "0022100532_004", "order": 4, "role": "body", "text": "“That’s when you really find out who you are and what you’re made of,\" he said. “We had new guys coming in and guys are nicked up and you just find a way to win.\""}
{"game_id": "0022100532", "chunk_id": "0022100532_005", "order": 5, "role": "body", "text": "Miami got a boost with the return of Kyle Lowry, who had 12 points after missing two games due to health and safety protocols. Kyle Guy added 17 points off the bench for the Heat after signing a 10-day contract Thursday, and Tyler Herro had 16."}
{"game_id": "0022100532", "chunk_id": "0022100532_006", "order": 6, "role": "body", "text": "“All the new guys that played tonight did a great job of impacting the game,\" coach Erik Spoelstra said. “Kyle (Guy) was a spark right away. It was fun. That was a fun night and it was fun to see these new guys contribute.\""}
{"game_id": "0022100532", "chunk_id": "0022100532_007", "order": 7, "role": "body", "text": "Jae’Sean Tate scored 22 points off the bench to lead the Rockets, who lost their sixth consecutive game. He returned Friday after missing two games due to health and safety protocols"}
{"game_id": "0022100532", "chunk_id": "0022100532_008", "order": 8, "role": "body", "text": "“He gave us everything that he always brings,\" coach Stephen Silas said. “That shows a lot about him. For him to be out five days and pick up right where he left off is really good.\""}
{"game_id": "0022100532", "chunk_id": "0022100532_009", "order": 9, "role": "body", "text": "The Heat led by as many as 25 points in the first half after a 41-point opening quarter. But the Rockets chipped away at the lead, and Tate scored five straight points to get them within 107-102 with less than five minutes left."}
{"game_id": "0022100532", "chunk_id": "0022100532_010", "order": 10, "role": "body", "text": "Miami made four free throws after that, starting a 7-0 run that was capped by a 3 from Lowry and pushed the lead to 114-102 with three minutes remaining."}
{"game_id": "0022100532", "chunk_id": "0022100532_011", "order": 11, "role": "body", "text": "Houston opened the fourth quarter with an 8-1 spurt to cut the lead to 101-95 with about eight minutes to go. But Butler entered the game after starting the fourth quarter on the bench and his three-point play soon after ended the run."}
{"game_id": "0022100532", "chunk_id": "0022100532_012", "order": 12, "role": "body", "text": "Josh Christopher made a layup for Houston before another three-point play by Butler made it 107-97 midway through the quarter."}
{"game_id": "0022100532", "chunk_id": "0022100532_013", "order": 13, "role": "body", "text": "The Heat used a 6-0 run to extend the lead to 18 with about five minutes left in the third quarter. Houston scored the next seven points, with four from Christian Wood, to get within 90-79 about a minute later."}
{"game_id": "0022100532", "chunk_id": "0022100532_014", "order": 14, "role": "body", "text": "But Miami scored five quick points after that, with a 3 from Haywood Highsmith, to pad the lead."}
{"game_id": "0022100532", "chunk_id": "0022100532_015", "order": 15, "role": "body", "text": "Miami was up by 18 again late in the third before the Rockets scored the last five points of the quarter to cut the lead to 100-87 entering the fourth."}
{"game_id": "0022100532", "chunk_id": "0022100532_017", "order": 17, "role": "body", "text": "Heat: P.J. Tucker, Zylan Cheatham, Marcus Garrett, Udonis Haslem, Duncan Robinson, Max Strus and Gabe Vincent all sat out due to health and safety protocols. Robinson’s absence Friday night ended his franchise-record streak of 182 consecutive games played, dating to April 2019. ... Omer Yurtseven had 10 points and 13 rebounds."}
{"game_id": "0022100532", "chunk_id": "0022100532_018", "order": 18, "role": "body", "text": "Rockets: Jalen Green had 16 points and Wood had 18. ... D.J. Augustin, DeJon Jarreau and Garrison Mathews missed the game because of health and safety protocols. ... Alperen Sengun injured his right ankle in the first half and didn’t return."}
{"game_id": "0022100532", "chunk_id": "0022100532_020", "order": 20, "role": "body", "text": "Friday marked the 20th consecutive season in which the Rockets hosted a game on New Year’s Eve. Houston fell to 15-5 with the loss that snapped a five-game winning streak."}
{"game_id": "0022100532", "chunk_id": "0022100532_021", "order": 21, "role": "body", "text": "It is the fifth time the Heat have played on New Year’s Eve, and the first since 2014. They improved to 3-2."}
{"game_id": "0022100532", "chunk_id": "0022100532_023", "order": 23, "role": "body", "text": "Heat: Visit Sacramento on Sunday night."}
{"game_id": "0022100532", "chunk_id": "0022100532_024", "order": 24, "role": "body", "text": "Rockets: Host Nuggets on Saturday night."}
