{"game_id": "0022100560", "chunk_id": "0022100560_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — Portland's Anfernee Simons played through his grief over his grandfather's death with a career night that tempered an NBA season-best 56-point outburst by Atlanta's Trae Young."}
{"game_id": "0022100560", "chunk_id": "0022100560_002", "order": 2, "role": "body", "text": "Simons scored a career-high 43 points and the Trail Blazers snapped a four-game losing streak with a 136-131 victory over the Hawks on Monday night."}
{"game_id": "0022100560", "chunk_id": "0022100560_003", "order": 3, "role": "body", "text": "\"I came in with a heavy heart, but obviously a clear mind for what I needed to do,\" Simons said. His grandfather, who had pancreatic cancer, passed away Sunday."}
{"game_id": "0022100560", "chunk_id": "0022100560_004", "order": 4, "role": "body", "text": "Young shot 17 for 26 from the field, 7 for 12 from 3-point range — including a 3 from the center-court logo late in the first half — and 15 for 15 from the line for his career-high scoring total, and added 14 assists. His 56-point game eclipsed Kevin Durant's 51-point performance for the Nets at Detroit on Dec. 12. Golden State's Stephen Curry and Boston's Jaylen Brown have had 50-point games this season."}
{"game_id": "0022100560", "chunk_id": "0022100560_005", "order": 5, "role": "body", "text": "Young became the first player with 50-plus points and 14-plus assists in a game since James Harden with the Houston Rockets on Dec. 31, 2016."}
{"game_id": "0022100560", "chunk_id": "0022100560_006", "order": 6, "role": "body", "text": "“I don’t care about nothing besides the fact we lost, so it sucks I had this type of night on a loss because at the end of the day that’s all that matters to me,” Young said. \"I just wish we would have won.”"}
{"game_id": "0022100560", "chunk_id": "0022100560_007", "order": 7, "role": "body", "text": "Simons had a career-high nine 3-pointers, the most for a Portland player this season. The 22-year-old Simons is the youngest Portland player to score more than 40 points in a game. After missing Portland's last game, Simons started in place of All-Star Damian Lillard, who was out because of injury management."}
{"game_id": "0022100560", "chunk_id": "0022100560_008", "order": 8, "role": "body", "text": "“This is all him, honestly,” Simons said afterward about his grandfather, who he called Papa. \"I give credit to him, dedicated this whole game to him.”"}
{"game_id": "0022100560", "chunk_id": "0022100560_009", "order": 9, "role": "body", "text": "Portland trailed at the start of the final quarter, but took a 112-107 lead after Ben McLemore's layup and Nassir Little's 3-pointer with 7:43 left. Simons' floater extended the lead to 118-111, but the persistent Hawks kept it close down the stretch."}
{"game_id": "0022100560", "chunk_id": "0022100560_010", "order": 10, "role": "body", "text": "Young came down hard on the court after an attempted layup with less than a minute left, but recovered to make a pair of free throws that closed the gap to 127-125."}
{"game_id": "0022100560", "chunk_id": "0022100560_011", "order": 11, "role": "body", "text": "Jusuf Nukic made a layup and added a free throw to make it 130-125 and Portland held on for the win."}
{"game_id": "0022100560", "chunk_id": "0022100560_012", "order": 12, "role": "body", "text": "Atlanta coach Nate McMillan entered the league's health and safety protocol on Saturday. But six Hawks players were available to return from protocols for the game against the Blazers, including Sharife Cooper, Danilo Gallinari, Kevin Huerter, Timothe Luwawu-Cabarrot, Onyeka Okongwu and Delon Wright."}
{"game_id": "0022100560", "chunk_id": "0022100560_013", "order": 13, "role": "body", "text": "Five Hawks, including Bogdan Bogdanovic, remain in the protocol. At one point, Atlanta was without a league-high 12 players."}
{"game_id": "0022100560", "chunk_id": "0022100560_014", "order": 14, "role": "body", "text": "“We’re just trying to fight through it and weather the storm,” Young said. “Last year, we were 14-20 at this point, so we made progress; we’re 16-20. But we gotta find a way. We gotta find a way to turn it back around like we did last year, and I think we will. I think once we get guys back and guys start to get back in their rhythm we’ll turn it around.”"}
{"game_id": "0022100560", "chunk_id": "0022100560_015", "order": 15, "role": "body", "text": "Joe Prunty took over in McMillan's absence. The Hawks were coming off a 121-118 win in Cleveland on Friday that snapped a three-game losing streak."}
{"game_id": "0022100560", "chunk_id": "0022100560_016", "order": 16, "role": "body", "text": "The Blazers were without Lillard because of abdominal tendinopathy, which has bothered him since the Olympics. The team was also still missing backcourt teammate CJ McCollum because of a collapsed lung."}
{"game_id": "0022100560", "chunk_id": "0022100560_017", "order": 17, "role": "body", "text": "But Nurkic, the starting center, returned from the protocols for the game against the Hawks, announcing his availability personally via Twitter.  He finished with 21 points and 12 rebounds."}
{"game_id": "0022100560", "chunk_id": "0022100560_018", "order": 18, "role": "body", "text": "Blazers coach Chauncey Billups also was back on the sideline after missing three games."}
{"game_id": "0022100560", "chunk_id": "0022100560_019", "order": 19, "role": "body", "text": "Portland jumped out to a 18-7 lead midway through the opening quarter. Atlanta perked up after its sluggish start, taking a 37-36 lead on Delon Wright's 3-pointer."}
{"game_id": "0022100560", "chunk_id": "0022100560_020", "order": 20, "role": "body", "text": "The Blazers reclaimed the lead and went up 58-46 on Nassir Little's 3-pointer. Portland led 70-65 at the break."}
{"game_id": "0022100560", "chunk_id": "0022100560_021", "order": 21, "role": "body", "text": "Young had 29 points and nine assists in the first half. He has scored 29 or more points in 16 straight games to tie Dominique Wilkins’ team record, set between December 1985 and January 1986."}
{"game_id": "0022100560", "chunk_id": "0022100560_022", "order": 22, "role": "body", "text": "The Hawks took a 91-90 lead on Huerter's layup and held on for a 105-100 lead going into the final quarter."}
{"game_id": "0022100560", "chunk_id": "0022100560_024", "order": 24, "role": "body", "text": "Hawks: Atlanta is in the midst of a season-long six-game road trip. ... Young's streak of games with 25 or more points is the longest in the NBA this season. ... Young is the first NBA player to reach 29 points and nine assists in the first half of a game this season."}
{"game_id": "0022100560", "chunk_id": "0022100560_025", "order": 25, "role": "body", "text": "Trail Blazers: Portland's Dec. 23 game against the Brooklyn Nets that was postponed has been rescheduled for Jan. 10 at the Moda Center."}
{"game_id": "0022100560", "chunk_id": "0022100560_027", "order": 27, "role": "body", "text": "Hawks: Visit the Sacramento Kings on Wednesday night."}
{"game_id": "0022100560", "chunk_id": "0022100560_028", "order": 28, "role": "body", "text": "Trail Blazers: Host the Miami Heat on Wednesday night."}
