{"game_id": "0022100924", "chunk_id": "0022100924_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Giannis Antetokounmpo had 26 points and 16 rebounds and the Milwaukee Bucks scored a season-high 44 points in the second quarter on the way to a 130-106 win over the Charlotte Hornets on Monday night."}
{"game_id": "0022100924", "chunk_id": "0022100924_002", "order": 2, "role": "body", "text": "Jrue Holiday had 21 points and eight assists, and Bobby Portis added 20 points and 10 rebounds for the Bucks, who were coming off a loss to the Brooklyn Nets on Saturday."}
{"game_id": "0022100924", "chunk_id": "0022100924_003", "order": 3, "role": "body", "text": "LaMelo Ball scored 24 points to lead Charlotte. Terry Rozier finished with 17 points and eight assists. Charlotte has split its last two games since returning from the All-Star break."}
{"game_id": "0022100924", "chunk_id": "0022100924_004", "order": 4, "role": "body", "text": "Milwaukee made its first 26 free throws and finished 32 of 37 from the line. Antetokounmpo made all 14 of his free throws."}
{"game_id": "0022100924", "chunk_id": "0022100924_005", "order": 5, "role": "body", "text": "Milwaukee outrebounded Charlotte 62-41."}
{"game_id": "0022100924", "chunk_id": "0022100924_006", "order": 6, "role": "body", "text": "“If we got everybody locked in, giving that effort defensively, who can really score on us at a high level?\" said Jevon Carter, who scored 10 points off the bench. \"And then on the other end, being able to guard us in transition. So, we keep that pace up, sky’s the limit.”"}
{"game_id": "0022100924", "chunk_id": "0022100924_007", "order": 7, "role": "body", "text": "The game was tied at 32-all after the first quarter, and Charlotte trailed by nine, 48-39, with just under seven minutes left in the second. The Bucks outscored the Hornets 38-14 over the rest of the quarter and led 76-53 at halftime. Portis scored eight points during the run."}
{"game_id": "0022100924", "chunk_id": "0022100924_008", "order": 8, "role": "body", "text": "“We were in a little bit of aggressive mindset” in the second quarter, Bucks coach Mike Budenholzer said. \"I thought Giannis quarterbacked in some of those situations, whether it was against the press or against the zone and found shooters. Sometimes we were able to play fast against the zone before it could get set, get some corner 3s.”"}
{"game_id": "0022100924", "chunk_id": "0022100924_009", "order": 9, "role": "body", "text": "The Bucks’ previous high point total in a quarter this season was 43 points in the third period of a 117-113 win at Boston on Dec. 25."}
{"game_id": "0022100924", "chunk_id": "0022100924_010", "order": 10, "role": "body", "text": "Hornets coach James Borrego said the second quarter “was a combination of things, poor offense, give them credit. They were the more physical team in the first half.”"}
{"game_id": "0022100924", "chunk_id": "0022100924_011", "order": 11, "role": "body", "text": "Antetokounmpo thrilled the crowd in the first quarter with a blocked shot. After driving to the basket and missing a layup, then pleading for a foul to be called, Antetokounmpo sprinted the floor to swat away a layup attempt by Mason Plumlee, then raised his right arm in triumph."}
{"game_id": "0022100924", "chunk_id": "0022100924_013", "order": 13, "role": "body", "text": "Hornets: Borrego, before the game, described the ups and downs of his young team. “This is the process you go through. It’s painful. But you get up every day, you get better, you learn from it, you grow,” he said. “One of the quotes that is resonating right now is: ‘In these moments when you feel buried, it’s really you being planted.’”"}
{"game_id": "0022100924", "chunk_id": "0022100924_014", "order": 14, "role": "body", "text": "Bucks: Budenzholzer recalled seeing Jevon Carter, who was signed Feb. 24, play at West Virginia. “It was like kamikaze, that whole team, just the way they played defense,” Budenzholer said. “I think he’s carried that into the league.”"}
{"game_id": "0022100924", "chunk_id": "0022100924_016", "order": 16, "role": "body", "text": "Budenzholzer recalled seeing Carter, who was signed Feb. 24, play at West Virginia. “It was like kamikaze, that whole team, just the way they played defense,” Budenzholer said. “I think he’s carried that into the league.”"}
{"game_id": "0022100924", "chunk_id": "0022100924_018", "order": 18, "role": "body", "text": "Hornets: At Cleveland on Wednesday. The Hornets are 1-2 against the Cavaliers this season."}
{"game_id": "0022100924", "chunk_id": "0022100924_019", "order": 19, "role": "body", "text": "Bucks: Host Miami on Wednesday. The Heat have won two out of three against the Bucks this season."}
