{"game_id": "0022100552", "chunk_id": "0022100552_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Joel Embiid got rolling early with a Euro-step, one-handed jam that shook the arena. Embiid walked to midcourt with his arms extended and soaked in the cheers."}
{"game_id": "0022100552", "chunk_id": "0022100552_002", "order": 2, "role": "body", "text": "It was exactly the tonic the 76ers' All-Star center needed against one of the NBA's worst teams."}
{"game_id": "0022100552", "chunk_id": "0022100552_003", "order": 3, "role": "body", "text": "“We can beat anybody on any given night,” Embiid said. “I just want to do whatever.”"}
{"game_id": "0022100552", "chunk_id": "0022100552_004", "order": 4, "role": "body", "text": "How does a triple-double and a fourth straight 30-plus-point game sound?"}
{"game_id": "0022100552", "chunk_id": "0022100552_005", "order": 5, "role": "body", "text": "Embiid had 31 points, 15 rebounds and 10 assists, reaching the triple-double to the tune of “MVP!” chants in the Philadelphia 76ers’ 133-113 win over the Houston Rockets on Monday night."}
{"game_id": "0022100552", "chunk_id": "0022100552_006", "order": 6, "role": "body", "text": "Embiid wasn't even looking to score as he sat on nine assists in the fourth quarter and finally hit Seth Curry for a bucket and his third career triple-double. He shot 12 of 20 from the floor in 30 minutes."}
{"game_id": "0022100552", "chunk_id": "0022100552_007", "order": 7, "role": "body", "text": "“He was not going to let us lose that game,” acting coach Dan Burke said."}
{"game_id": "0022100552", "chunk_id": "0022100552_008", "order": 8, "role": "body", "text": "The Sixers were slow to shake off a sub-.500 team — a familiar situation this season — and needed a 41-29 third quarter to put some distance between themselves and the Rockets, the worst team in the Western Conference."}
{"game_id": "0022100552", "chunk_id": "0022100552_009", "order": 9, "role": "body", "text": "“Whether it's me pushing the ball, attacking or finding guys, I thought it's been great,” Embiid said."}
{"game_id": "0022100552", "chunk_id": "0022100552_010", "order": 10, "role": "body", "text": "Furkan Korkmaz had 24 points and 11 rebounds, and Isaiah Joe scored 18 points for the Sixers."}
{"game_id": "0022100552", "chunk_id": "0022100552_011", "order": 11, "role": "body", "text": "Garrison Mathews led the Rockets with 23 points."}
{"game_id": "0022100552", "chunk_id": "0022100552_012", "order": 12, "role": "body", "text": "The Rockets played without guard Kevin Porter Jr. and forward Christian Wood after they were each suspended one game for bad behavior. Porter and Wood both had meltdowns in a loss Saturday to Denver. Rockets coach Stephen Silas said it was “best for our culture” to sit the duo for a game."}
{"game_id": "0022100552", "chunk_id": "0022100552_013", "order": 13, "role": "body", "text": "“It should be a bump in the road and we continue on,” Silas said. “If you really love somebody, you don't take an instance and say that's it or make it to where it's more than it is. You love them. And when stuff like this happens, you love them even more.”"}
{"game_id": "0022100552", "chunk_id": "0022100552_014", "order": 14, "role": "body", "text": "Embiid played the entire first quarter and carried the Sixers to a 34-30 lead. Korkmaz, making only his eighth start, stepped in as the able sidekick and hit three 3-pointers. Korkmaz subbed for Tyrese Maxey who, along with Matisse Thybulle, entered the NBA's health and safety protocols."}
{"game_id": "0022100552", "chunk_id": "0022100552_015", "order": 15, "role": "body", "text": "That left the Sixers without two key contributors."}
{"game_id": "0022100552", "chunk_id": "0022100552_016", "order": 16, "role": "body", "text": "“There seems to be a perception because you have Joel Embiid, you’re not missing guys,” Burke said."}
{"game_id": "0022100552", "chunk_id": "0022100552_017", "order": 17, "role": "body", "text": "The 76ers again played a short-handed team they were expected to beat easily —  had them as 13-point favorites — and criticism over recent losses or slim-margin victories against weaker teams led to a terse exchange from coach Doc Rivers with a reporter after a win against Toronto."}
{"game_id": "0022100552", "chunk_id": "0022100552_018", "order": 18, "role": "body", "text": "Sure enough, the malaise continued and the Sixers trailed 63-62 at halftime. Embiid and Korkmaz combined for 22 points in the third and Philly shot 14 of 19 (74%) from the floor to put away the Rockets."}
{"game_id": "0022100552", "chunk_id": "0022100552_020", "order": 20, "role": "body", "text": "Tobias Harris shot 3 of 10 in the first half and mockingly waved his arms toward the crowd for boos in his direction to get louder. When he scored a basket in the fourth that made it 112-96, he backpedaled on defense and appeared to mutter a profanity between the words “don’t clap.”"}
{"game_id": "0022100552", "chunk_id": "0022100552_021", "order": 21, "role": "body", "text": "“He's maybe, since I've been here, one of the surprise guys for me with how professional he is,” Burke said. “He really leads by example, not very vocal, so when I saw him raise his hands when they were booing, we talked about it at halftime. The only thing that matters is within that locker room.”"}
{"game_id": "0022100552", "chunk_id": "0022100552_022", "order": 22, "role": "body", "text": "Embiid shrugged it off and said “fans are going to be fans.\""}
{"game_id": "0022100552", "chunk_id": "0022100552_024", "order": 24, "role": "body", "text": "Rockets: G Eric Gordon returned after missing one game with a groin injury. ... Lost their fifth straight road game."}
{"game_id": "0022100552", "chunk_id": "0022100552_025", "order": 25, "role": "body", "text": "76ers: Burke coached the 76ers for the second straight game with Rivers still in protocols. ... Signed G Charlie Brown Jr. to a 10-day contract. ... Embiid had triple-doubles in April 2019 vs. Milwaukee and November 2018 vs. Orlando."}
{"game_id": "0022100552", "chunk_id": "0022100552_027", "order": 27, "role": "body", "text": "Burke said all the roster disruptions and game interruptions are making games as hard as ever to prepare for in the NBA."}
{"game_id": "0022100552", "chunk_id": "0022100552_028", "order": 28, "role": "body", "text": "“Lately, it’s becoming a Forrest Gump box of chocolates,” he said."}
{"game_id": "0022100552", "chunk_id": "0022100552_030", "order": 30, "role": "body", "text": "Burke was an assistant coach with Indiana when he took shots at Embiid and once said the All-Star center “gets away with a bunch of crap the league ignores.”"}
{"game_id": "0022100552", "chunk_id": "0022100552_032", "order": 32, "role": "body", "text": "Burke, in his second season with the 76ers, was all smiles watching Embiid show why he's one of the best players in the NBA."}
{"game_id": "0022100552", "chunk_id": "0022100552_033", "order": 33, "role": "body", "text": "“He doesn't flop any more, by the way,” Burke said, laughing."}
{"game_id": "0022100552", "chunk_id": "0022100552_035", "order": 35, "role": "body", "text": "The Rockets play Wednesday at Washington."}
{"game_id": "0022100552", "chunk_id": "0022100552_036", "order": 36, "role": "body", "text": "The 76ers play Wednesday at Orlando."}
