{"game_id": "0022101009", "chunk_id": "0022101009_001", "order": 1, "role": "lead", "text": "DENVER -- — Pascal Siakam scored 33 points, Scottie Barnes had 25 and the Toronto Raptors pulled away late to beat the Denver Nuggets 127-115 on Saturday night."}
{"game_id": "0022101009", "chunk_id": "0022101009_002", "order": 2, "role": "body", "text": "Chris Boucher added 21 points and 13 rebounds for the Raptors, and Barnes also had 10 assists and eight rebounds. They won their third in a row and improved to 5-5 since the All-Star break."}
{"game_id": "0022101009", "chunk_id": "0022101009_003", "order": 3, "role": "body", "text": "The victory came on the back end of a back-to-back that began with a victory at NBA-leading Phoenix the night before."}
{"game_id": "0022101009", "chunk_id": "0022101009_004", "order": 4, "role": "body", "text": "“Showed a lot of character,” Raptors coach Nick Nurse said. “We’ve showed a lot of toughness these past two nights and that takes you a long way.”"}
{"game_id": "0022101009", "chunk_id": "0022101009_005", "order": 5, "role": "body", "text": "So did their second unit, which Nurse stuck with for much of the fourth quarter."}
{"game_id": "0022101009", "chunk_id": "0022101009_006", "order": 6, "role": "body", "text": "“It was rolling,” Siakam said. “As long as we win the game, that’s what I’m about. Kudos to those guys, they came in high intensity, they played hard and they won the game for us.”"}
{"game_id": "0022101009", "chunk_id": "0022101009_007", "order": 7, "role": "body", "text": "Nikola Jokic had 26 points and 10 rebounds to lead the Nuggets. Bones Hyland added 17 points, and Will Barton had 16 in his return from an ankle injury."}
{"game_id": "0022101009", "chunk_id": "0022101009_008", "order": 8, "role": "body", "text": "But the Nuggets lost out in the rebounding battle. Toronto finished with 55 rebounds, including 23 offensive boards leading to 30 second-chance points. Only nine of Denver’s 46 rebounds were on the offensive end and the Nuggets had 11 second chance-points."}
{"game_id": "0022101009", "chunk_id": "0022101009_009", "order": 9, "role": "body", "text": "“That’s unacceptable,” Jokic said. “They had more offensive than defensive (rebounds), it seemed like. We just need to do a better job than today.”"}
{"game_id": "0022101009", "chunk_id": "0022101009_010", "order": 10, "role": "body", "text": "Trailing by two at the break, the Nuggets got 3-pointers from Hyland and Austin Rivers around a tip-in from Siakam to close the third quarter with a 99-93 lead."}
{"game_id": "0022101009", "chunk_id": "0022101009_011", "order": 11, "role": "body", "text": "The Raptors regained the lead with a 10-2 burst capped by Boucher’s alley-oop layup that put them in front 117-109 with 3:56 left to play. Morris made one of two free throws, but Boucher hit a 3-pointer and Barnes drove in for a layup around a dunk by Jeff Green to build the Raptors’ lead to 10 points with 1:25 left to secure the victory."}
{"game_id": "0022101009", "chunk_id": "0022101009_012", "order": 12, "role": "body", "text": "Siakam scored 23 of his points in the first half, helping the Raptors take a 65-63 lead."}
{"game_id": "0022101009", "chunk_id": "0022101009_014", "order": 14, "role": "body", "text": "Raptors: G Fred VanVleet was held out of the game, the second in a back-to-back set, as part of managing his recovery from a right knee injury. He returned to action Friday night in a victory at NBA-leading Phoenix after missing the previous five games because of the knee injury. … Siakam has scored 20 or more points in six straight games."}
{"game_id": "0022101009", "chunk_id": "0022101009_015", "order": 15, "role": "body", "text": "Nuggets: F Aaron Gordon was held out of the game because of right foot soreness. … F Zeke Nnaji missed a second straight game due to bilateral knee soreness. … Barton returned from a three-game absence because of a left ankle sprain."}
{"game_id": "0022101009", "chunk_id": "0022101009_017", "order": 17, "role": "body", "text": "Raptors: At the Los Angeles Lakers on Monday night."}
{"game_id": "0022101009", "chunk_id": "0022101009_018", "order": 18, "role": "closing", "text": "Nuggets: At Philadelphia on Monday night."}
