{"game_id": "0022100555", "chunk_id": "0022100555_001", "order": 1, "role": "lead", "text": "CHICAGO -- — DeMar DeRozan scored 29 points, Zach LaVine added 27 and the Chicago Bulls won their eight straight game, beating the Orlando Magic 102-98 on Monday night."}
{"game_id": "0022100555", "chunk_id": "0022100555_002", "order": 2, "role": "body", "text": "Nikola Vucevic had 13 points and 17 rebounds for the Bulls. Coby White came off the bench to score 17 points."}
{"game_id": "0022100555", "chunk_id": "0022100555_003", "order": 3, "role": "body", "text": "Franz Wagner led Orlando with 22 points. Wendell Carter Jr. finished with 21 points and 10 rebounds for the Magic, who lost their sixth straight. Orlando has three wins since Nov. 17."}
{"game_id": "0022100555", "chunk_id": "0022100555_004", "order": 4, "role": "body", "text": "LaVine and DeRozan combined for 17 points in the third quarter, helping the Bulls hold off the Magic. Chicago last lost on Dec. 11, 118-92 to Miami."}
{"game_id": "0022100555", "chunk_id": "0022100555_005", "order": 5, "role": "body", "text": "“We can’t be satisfied with anything,” DeRozan said. “We work extremely hard, and can’t take anything for granted. Yeah, we’ve won some games and we’re on a winning streak, but we’re not satisfied with none of that.”"}
{"game_id": "0022100555", "chunk_id": "0022100555_006", "order": 6, "role": "body", "text": "Chicago led by eight points after LaVine hit a step-back 3-pointer with 2:13 left in the fourth quarter. Orlando closed within two points after Wagner hit three free throws in the final 20 seconds. LaVine and DeRozan hit free throws that iced the game for the Bulls."}
{"game_id": "0022100555", "chunk_id": "0022100555_007", "order": 7, "role": "body", "text": "The second-half scoring outburst by DeRozan and LaVine was just what Chicago needed to overcome a slow start. The Bulls shot just 5 of 22 in the first quarter, missing their first seven attempts and going 1 of 9 on 3-pointers."}
{"game_id": "0022100555", "chunk_id": "0022100555_008", "order": 8, "role": "body", "text": "“Our guys gave everything they had,” Bulls coach Billy Donovan said. “I don’t think we shot the ball particularly well. If you don’t defend and shoot it the way we did, we would not have had a chance to win. We’ve got to have the mentality of, if the ball’s not in the basket, we can still defend.”"}
{"game_id": "0022100555", "chunk_id": "0022100555_009", "order": 9, "role": "body", "text": "Orlando started strong despite playing on the second night of a back-to-back, opening the game on an 11-2 run and getting points from all but one of its starters within the first four minutes. The Magic hung with the Bulls throughout, and never fell behind by more than nine. But, the Magic was unable to come up with a key stop down the stretch."}
{"game_id": "0022100555", "chunk_id": "0022100555_010", "order": 10, "role": "body", "text": "“I was really happy with the way we battled until the end of the game,” Orlando coach Jamahl Mosley said. “Our guys did a great job of understanding our coverages. Offensively, trying to move the ball, understanding how to exploit some of their defense. But their ability to compete for the entire 48 was what I’m most impressed with.”"}
{"game_id": "0022100555", "chunk_id": "0022100555_011", "order": 11, "role": "body", "text": "Chicago outscored the Magic 20-9 in the opening minutes of the second quarter to take the lead. LaVine hit a 3-pointer and a driving layup over Magic center Mo Bamba, pushing Chicago’s edge to eight points. A Hassani Gravett 3-point buzzer-beater cut Orlando’s deficit to 45-40 at halftime."}
{"game_id": "0022100555", "chunk_id": "0022100555_013", "order": 13, "role": "body", "text": "Donovan returned Monday after missing five games while in NBA health and safety protocols. He entered protocols on Dec. 24, and dealt only with mild symptoms."}
{"game_id": "0022100555", "chunk_id": "0022100555_014", "order": 14, "role": "body", "text": "“It really was not that bad for me at all,” Donovan said. “I was fortunate. A lot of families have been hit hard with this.”"}
{"game_id": "0022100555", "chunk_id": "0022100555_015", "order": 15, "role": "body", "text": "Donovan was initially cleared to travel for Saturday’s game at Washington, but his flight was canceled because of a snowstorm in Chicago."}
{"game_id": "0022100555", "chunk_id": "0022100555_016", "order": 16, "role": "body", "text": "Chris Fleming went 5-0 serving as the Bulls’ interim coach in Donovan’s absence."}
{"game_id": "0022100555", "chunk_id": "0022100555_018", "order": 18, "role": "body", "text": "Magic: Bamba was assessed a technical foul early in the fourth despite being on the bench at the time. … Carter returned to Chicago for the second time since the Bulls included him in a deal for Nikola Vucevic at last season’s trade deadline. The Bulls drafted him seventh overall in the 2018 draft."}
{"game_id": "0022100555", "chunk_id": "0022100555_019", "order": 19, "role": "body", "text": "Bulls: F Javonte Green (groin) is expected to miss two to four weeks. Green became a starter for Chicago after the team lost F Patrick Williams to an early season wrist injury. … G Alex Caruso (foot) has been ramping up his conditioning, but needs to go through contact drills before the Bulls determine his return date. … F Tyler Cook is expected to miss a couple weeks after spraining his ankle in Saturday’s game against Washington."}
{"game_id": "0022100555", "chunk_id": "0022100555_021", "order": 21, "role": "body", "text": "Magic: Host Philadelphia on Wednesday."}
{"game_id": "0022100555", "chunk_id": "0022100555_022", "order": 22, "role": "body", "text": "Bulls: Host Washington on Friday."}
