{"game_id": "0022101181", "chunk_id": "0022101181_001", "order": 1, "role": "lead", "text": "MIAMI -- — Tyler Herro scored 35 points off the bench and the Miami Heat moved closer to clinching the No. 1 seed in the Eastern Conference playoffs with a 144-115 victory over the Charlotte Hornets on Tuesday night."}
{"game_id": "0022101181", "chunk_id": "0022101181_002", "order": 2, "role": "body", "text": "Miami won its fifth straight and posted the second-highest point total in franchise history, while Charlotte allowed 144 for the second consecutive game after a 144-112 loss Saturday at Philadelphia."}
{"game_id": "0022101181", "chunk_id": "0022101181_003", "order": 3, "role": "body", "text": "Jimmy Butler added 27 points, Bam Adebayo had 22 and Duncan Robinson broke out of a recent scoring slump with 21 points for the Heat, who need to win one of their two remaining games to secure the top spot in the East. Robinson shot 7 of 11 on 3-pointers after averaging 5.7 points in his previous six games, including two scoreless outings."}
{"game_id": "0022101181", "chunk_id": "0022101181_004", "order": 4, "role": "body", "text": "“Role and involvement and everything has looked different night to night,” said Robinson, now on Miami’s second unit. “That’s what you get when you play on a good team with a lot of guys that can do a lot of different things. For me, it’s just about wrapping my mind around that.”"}
{"game_id": "0022101181", "chunk_id": "0022101181_005", "order": 5, "role": "body", "text": "Ahead 104-97 after three periods, the Heat began the fourth on a 13-2 spurt. Robinson’s 3-pointer with 7:55 remaining capped the run for a 117-99 lead."}
{"game_id": "0022101181", "chunk_id": "0022101181_006", "order": 6, "role": "body", "text": "Miami finished 23 of 42 from 3-point range. Herro was 8 of 14 from behind the arc and tied Dwyane Wade’s single-game record for points by a Heat reserve."}
{"game_id": "0022101181", "chunk_id": "0022101181_007", "order": 7, "role": "body", "text": "“I have to give credit to my teammates. They trust me to have the ball in my hands and let me be myself,” Herro said. “I couldn’t do it without them. Another good win for us and just getting ready for the playoffs.”"}
{"game_id": "0022101181", "chunk_id": "0022101181_008", "order": 8, "role": "body", "text": "The Hornets have clinched a berth in the play-in tournament. They dropped to 10th in the East after Brooklyn defeated Houston."}
{"game_id": "0022101181", "chunk_id": "0022101181_009", "order": 9, "role": "body", "text": "“That’s why they are a title contender,” Hornets coach James Borrego said of the Heat. “They’ve got depth, size, they shoot it, they defend. They are a hell of a group, so give them credit. It was a test for us.”"}
{"game_id": "0022101181", "chunk_id": "0022101181_010", "order": 10, "role": "body", "text": "Miles Bridges scored 29 points and LaMelo Ball finished with 18 points and 14 assists for Charlotte."}
{"game_id": "0022101181", "chunk_id": "0022101181_011", "order": 11, "role": "body", "text": "“I’m kind of surprised, a different sense of urgency, but we have to fix it next game,” Bridges said. “We have to get better. Around this time if you don’t have a sense of urgency, you shouldn’t be playing. We just have to fix that.”"}
{"game_id": "0022101181", "chunk_id": "0022101181_012", "order": 12, "role": "body", "text": "Heat coach Erik Spoelstra (health and safety protocols) missed his second straight game. Miami assistant Chris Quinn is running the team during Spoelstra’s absence."}
{"game_id": "0022101181", "chunk_id": "0022101181_013", "order": 13, "role": "body", "text": "“The ball was moving, guys were helping each other get shots,” Quinn said. “It really was a team effort offensively.”"}
{"game_id": "0022101181", "chunk_id": "0022101181_014", "order": 14, "role": "body", "text": "The Hornets hit their first four 3-pointers for a 14-4 lead 2:57 into the game. Consecutive 3s from Robinson and Herro keyed a 12-3 spurt in the final 2:07 of the second period that gave Miami a 70-60 lead at halftime."}
{"game_id": "0022101181", "chunk_id": "0022101181_015", "order": 15, "role": "body", "text": "Miami’s Kyle Lowry and Charlotte’s Gordon Hayward rested and didn’t play. Hayward had missed 22 games because of a left ankle sprain before his 17-minute outing against Philadelphia."}
{"game_id": "0022101181", "chunk_id": "0022101181_017", "order": 17, "role": "body", "text": "Hornets: Charlotte is locked into the play-in tournament. It’ll be the Hornets’ first game past the end of the regular season since 2016, when they lost a first-round series to Miami in seven games. ... Bridges is averaging 26.6 points in his last six games."}
{"game_id": "0022101181", "chunk_id": "0022101181_018", "order": 18, "role": "body", "text": "Heat: The game technically was the 1,111th of Spoelstra’s coaching career, a figure that includes games he’s missed for family reasons and virus-related issues. ... Quinn is 2-1 while stepping in for Spoelstra this season. In addition to Sunday’s win at Toronto, Spoelstra missed Miami’s game against Brooklyn on March 26 after one of his sons underwent a medical procedure. ... F P.J. Tucker sustained a right calf strain in the third quarter and didn’t return."}
{"game_id": "0022101181", "chunk_id": "0022101181_020", "order": 20, "role": "body", "text": "Caleb Martin outscored twin brother Cody 12-7. The Martins were teammates in Charlotte the previous two seasons before Caleb joined Miami as a free agent."}
{"game_id": "0022101181", "chunk_id": "0022101181_022", "order": 22, "role": "body", "text": "Hornets: Host the Orlando Magic on Thursday."}
{"game_id": "0022101181", "chunk_id": "0022101181_023", "order": 23, "role": "body", "text": "Heat: Conclude their regular-season home schedule against Atlanta on Friday."}
