{"game_id": "0022100864", "chunk_id": "0022100864_001", "order": 1, "role": "lead", "text": "DENVER -- — Nikola Jokic scored 26 points to lead six Denver players in double figures, and the Nuggets beat the Orlando Magic 121-111. on Monday night."}
{"game_id": "0022100864", "chunk_id": "0022100864_002", "order": 2, "role": "body", "text": "Jeff Green and Will Barton added 17 points apiece and Bryn Forbes had 16 for the Nuggets, who have won four of five since losing three in a row. Bones Hyland had 14 points and Aaron Gordon 10."}
{"game_id": "0022100864", "chunk_id": "0022100864_003", "order": 3, "role": "body", "text": "Franz Wagner scored 26 points to lead the Magic, who have lost three in a row, all by double digits. Wendell Carter Jr. added 25 points and Jalen Suggs had 16."}
{"game_id": "0022100864", "chunk_id": "0022100864_004", "order": 4, "role": "body", "text": "Leading by 13 points at the half, the Nuggets got a jumper from Forbes at the end of the third quarter, followed by a driving dunk by DeMarcus Cousins to start the fourth and extended their lead to 87-70."}
{"game_id": "0022100864", "chunk_id": "0022100864_005", "order": 5, "role": "body", "text": "Orlando fought back to within 99-87 on Carter’s dunk with 6:54 left to play and cut the deficit to eight points on Carter’s 3-pointer with 1:32 remaining. Jokic answered with a 3-pointer from the corner on the Nuggets’ ensuing possession, and Green had a dunk and Hyland a pair of free throws around a 3-pointer by Wagner to help fend off the Magic’s comeback bid. Their balanced offense is a reflection of the improved play by the Nuggets’ midseason acquisitions as they get more comfortable and increasingly adapt to their new teammates and new surroundings."}
{"game_id": "0022100864", "chunk_id": "0022100864_006", "order": 6, "role": "body", "text": "“I think we’re figuring each other out and getting things rolling now,” said Forbes, who was acquired from San Antonio in mid-January. “I think we’re all starting to click, and understand each other.”"}
{"game_id": "0022100864", "chunk_id": "0022100864_007", "order": 7, "role": "body", "text": "Added DeMarcus Cousins, who was signed to a second 10-day contract: “I think we’re taking the right steps forward. I’m just trying to come in and bring good energy for these guys, be a spark.”"}
{"game_id": "0022100864", "chunk_id": "0022100864_008", "order": 8, "role": "body", "text": "The Magic got off to a slow start, missing their first seven attempts from 3-point range and trailing 29-14 after the first quarter. They fell behind by as many as 22 points in the second quarter before managing to gain some ground and closing to within 53-40 at halftime. “I’m really proud of this group’s resilience and their ability to fight and continue to play no matter what’s happening in the game,” Magic coach Jamahl Mosley said. “We’ve got to get better at taking care of the basketball. We gave points away early, but these guys continue to fight.”"}
{"game_id": "0022100864", "chunk_id": "0022100864_009", "order": 9, "role": "body", "text": "Wagner said it was encouraging to see the team battle to the end."}
{"game_id": "0022100864", "chunk_id": "0022100864_010", "order": 10, "role": "body", "text": "“At the same time, we didn’t come here to lose by 10 points and walk out satisfied,” he said. “We need to do a better job of starting games. ... But we have all guys that want to compete and want to win.”"}
{"game_id": "0022100864", "chunk_id": "0022100864_012", "order": 12, "role": "body", "text": "Magic: F Moritz Wagner was held out the game with bruised left ribs. ... Former Nuggets player Gary Harris had 15 points in his first game back in Denver since being traded to Orlando a year ago."}
{"game_id": "0022100864", "chunk_id": "0022100864_013", "order": 13, "role": "body", "text": "Nuggets: G Monte Morris missed a third consecutive game because of a concussion. … F Zeke Nnaji missed a second straight game due to a right hamstring injury. … Jokic also had 15 rebounds."}
{"game_id": "0022100864", "chunk_id": "0022100864_015", "order": 15, "role": "body", "text": "Magic: Host the Atlanta Hawks on Wednesday night."}
{"game_id": "0022100864", "chunk_id": "0022100864_016", "order": 16, "role": "body", "text": "Nuggets: At Golden State Warriors on Wednesday night."}
