{"game_id": "0022100403", "chunk_id": "0022100403_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — LeBron James finished playing back-to-back road games in the Midwest on Friday, flew to Phoenix on Saturday to watch his son play, and then dropped a triple-double on the Orlando Magic back in LA on Sunday night."}
{"game_id": "0022100403", "chunk_id": "0022100403_002", "order": 2, "role": "body", "text": "What's this soon-to-be 37-year-old's secret, other than spectacular talent and decades of hard work?"}
{"game_id": "0022100403", "chunk_id": "0022100403_003", "order": 3, "role": "body", "text": "“Sleep,” James said. “Sleep, and inspiration from my son and his team. ... I slept last night from 12 to 8. I got up, ate breakfast, and then I went back to sleep from 8:30 to 12:30. That's pretty good, right?”"}
{"game_id": "0022100403", "chunk_id": "0022100403_004", "order": 4, "role": "body", "text": "The well-rested James scored 14 of his 30 points during Los Angeles' spectacular third quarter, and he added 11 rebounds and 10 assists while the Lakers rolled past Orlando 106-94 for their fifth victory in seven games."}
{"game_id": "0022100403", "chunk_id": "0022100403_005", "order": 5, "role": "body", "text": "“He’s exemplifying finding joy through hustle,” Lakers coach Frank Vogel said. \"The effort he’s playing with is inspiring our whole group.”"}
{"game_id": "0022100403", "chunk_id": "0022100403_006", "order": 6, "role": "body", "text": "Talen Horton-Tucker scored seven of his 19 points as Los Angeles utterly dominated a close game out of halftime, scoring 23 consecutive points while holding the Magic to 2-for-23 shooting in the third quarter with their field goals scored nearly 10 minutes apart. Los Angeles rode that 36-10 advantage in the third to its second straight win and moved two games above .500 for the first time in four weeks."}
{"game_id": "0022100403", "chunk_id": "0022100403_007", "order": 7, "role": "body", "text": "Russell Westbrook had 19 points and James secured his 101st career triple-double in the final minutes as the Lakers won their second straight with second-leading scorer Anthony Davis sidelined by left knee soreness."}
{"game_id": "0022100403", "chunk_id": "0022100403_008", "order": 8, "role": "body", "text": "James also had three exciting blocked shots in an all-around effort that showed the four-time MVP is still a formidable force — and the Lakers still could be a championship threat if they can somehow stay healthy."}
{"game_id": "0022100403", "chunk_id": "0022100403_009", "order": 9, "role": "body", "text": "“When he’s aggressive and making the right plays and reads, our team is different,” Westbrook said. “This was another game where he imposed his will. ... (The blocked shots) are just big for us, and I know it’s big for him to show he’s still doing what he’s been doing year after year. It’s great to see.\""}
{"game_id": "0022100403", "chunk_id": "0022100403_010", "order": 10, "role": "body", "text": "Cole Anthony scored 21 points for the Magic, who went 0-5 on their West Coast trip despite rallying in the fourth quarter."}
{"game_id": "0022100403", "chunk_id": "0022100403_011", "order": 11, "role": "body", "text": "Franz Wagner added 20 points and seven rebounds, but the Magic responded to Saturday night's last-second loss to the Clippers with a solid first half and a catastrophic third quarter in their 12th loss in 13 games. Orlando dropped to 5-23 despite hitting 13 3-pointers."}
{"game_id": "0022100403", "chunk_id": "0022100403_012", "order": 12, "role": "body", "text": "James scored 13 points in the first four minutes after halftime, slicing up Orlando's defense with 3-pointers and dunks alike while also making two crowd-pleasing blocks at the rim. With his final assist late in the fourth quarter, he got his second triple-double of the season and second in three games."}
{"game_id": "0022100403", "chunk_id": "0022100403_013", "order": 13, "role": "body", "text": "“Tonight, LeBron James happened,” Orlando coach Jahmal Mosley said. “He came out and hit two 3s quickly. We missed a couple of chippies, and it fueled their break. ... They just turned up the defensive pressure. I know we did get some good looks. Shots just didn’t happen to fall. Those shots go in, it slows down the run, but those misses led to easy transition baskets.\""}
{"game_id": "0022100403", "chunk_id": "0022100403_014", "order": 14, "role": "body", "text": "Neither team took a substantial lead in a first half highlighted by James' spectacular chase-down block of R.J. Hampton's layup attempt in the second quarter. The Magic hit nine 3-pointers during the first half in another significant step for one of the NBA's worst-shooting and lowest-scoring teams."}
{"game_id": "0022100403", "chunk_id": "0022100403_015", "order": 15, "role": "body", "text": "“We see where we’re trying to go as a team, and for a lot of us, we understand it doesn’t happen overnight,” said Wendell Carter Jr., who scored 16 points. “I’ve seen it with the team I’ve been on (Chicago) before I came here. It’s a process. Things don’t happen overnight with a young team. There’s going to be ups and downs, but as long as we’re learning from mistakes, I like it.”"}
{"game_id": "0022100403", "chunk_id": "0022100403_017", "order": 17, "role": "body", "text": "Magic: Terrence Ross added 15 points. ... Gary Harris was limited to six points in 33 minutes on just five shots."}
{"game_id": "0022100403", "chunk_id": "0022100403_018", "order": 18, "role": "body", "text": "Lakers: Horton-Tucker added a career-high six steals. ... Dwight Howard made his third start of the season against the team that drafted him in 2004 and employed him for eight years before he became an NBA vagabond. The center, who turned 36 last Wednesday, had five points and four rebounds."}
{"game_id": "0022100403", "chunk_id": "0022100403_020", "order": 20, "role": "body", "text": "Vogel said examinations of Davis’ knee found it structurally sound, and the team anticipates him returning to action soon. The oft-injured Davis has missed only three games this season."}
{"game_id": "0022100403", "chunk_id": "0022100403_022", "order": 22, "role": "body", "text": "Los Angeles’ 23 straight points comprised its longest run of the season, and the Lakers turned a small halftime deficit into a 25-point lead while holding Orlando without a field goal for 9:48. The Magic’s 2-for-23 shooting in the third was the worst percentage in a quarter by a Lakers opponent since 1999."}
{"game_id": "0022100403", "chunk_id": "0022100403_024", "order": 24, "role": "body", "text": "Magic: Host the Atlanta Hawks on Wednesday night."}
{"game_id": "0022100403", "chunk_id": "0022100403_025", "order": 25, "role": "body", "text": "Lakers: At the Dallas Mavericks on Wednesday night."}
