{"game_id": "0022100045", "chunk_id": "0022100045_001", "order": 1, "role": "lead", "text": "MIAMI -- — Jimmy Butler kept getting to the rim, and predictably, scoring suddenly became pretty easy."}
{"game_id": "0022100045", "chunk_id": "0022100045_002", "order": 2, "role": "body", "text": "Butler scored 36 points on 15-for-21 shooting, Bam Adebayo added 16 points and 13 rebounds and the Miami Heat pulled away in the fourth quarter to beat the Orlando Magic 107-90 on Monday night."}
{"game_id": "0022100045", "chunk_id": "0022100045_003", "order": 3, "role": "body", "text": "“Jimmy is an elite scorer. He's also an elite playmaker and he's an elite defender,\" Heat coach Erik Spoelstra said. “He can do a lot of different things.\""}
{"game_id": "0022100045", "chunk_id": "0022100045_004", "order": 4, "role": "body", "text": "Butler had 10 baskets from inside of 10 feet. He was 13 for 32 in the season's first two games."}
{"game_id": "0022100045", "chunk_id": "0022100045_005", "order": 5, "role": "body", "text": "“I shot the same shots. They just happened to go in tonight,\" Butler said. “Let my defense lead to my offense."}
{"game_id": "0022100045", "chunk_id": "0022100045_006", "order": 6, "role": "body", "text": "Markieff Morris had 16 points off the Miami bench, and Tyler Herro finished with 13 points, five rebounds and nine assists for the Heat."}
{"game_id": "0022100045", "chunk_id": "0022100045_007", "order": 7, "role": "body", "text": "Miami was 19 for 19 from the foul line, tying the second-most makes without a miss in team history. The Heat were 30 for 30 against Boston on March 24, 1993."}
{"game_id": "0022100045", "chunk_id": "0022100045_008", "order": 8, "role": "body", "text": "Franz Wagner and Jalen Suggs led Orlando with 15 points, while Cole Anthony and R.J. Hampton each added 12 for the Magic. Mo Bamba and Robin Lopez had 11 apiece for Orlando."}
{"game_id": "0022100045", "chunk_id": "0022100045_009", "order": 9, "role": "body", "text": "“We’re a very young team,\" Hampton said. “Going up against very experienced teams like New York, like Miami, like San Antonio, that’s going to benefit us.\""}
{"game_id": "0022100045", "chunk_id": "0022100045_010", "order": 10, "role": "body", "text": "Butler also had five steals. He had 11 field goals — a career best for the opening two quarters of a game — by halftime, the majority of those dunks or layups, and the Heat led by as many as 19 in the early going before taking a 57-44 lead into the break."}
{"game_id": "0022100045", "chunk_id": "0022100045_011", "order": 11, "role": "body", "text": "Orlando, which rallied from a double-digit deficit to win in New York on Sunday night, tried to do it again in Miami. Anthony had five consecutive points midway through the third quarter to get Orlando within six, and another score from Anthony cut Miami’s lead to 86-77 early in the fourth."}
{"game_id": "0022100045", "chunk_id": "0022100045_012", "order": 12, "role": "body", "text": "That’s when the Heat pulled away for good."}
{"game_id": "0022100045", "chunk_id": "0022100045_013", "order": 13, "role": "body", "text": "A 12-2 run started with a basket by Herro, ended with him unintentionally banking in a 3-pointer with a big smile, and the lead was restored to 98-79 with 6:47 left."}
{"game_id": "0022100045", "chunk_id": "0022100045_014", "order": 14, "role": "body", "text": "“I don’t want to make excuses,\" Magic coach Jamahl Mosley said. “We all laced them up, ready to get out there and play. I think we started a little bit slow, then we got our momentum ... and we kept fighting.\""}
{"game_id": "0022100045", "chunk_id": "0022100045_016", "order": 16, "role": "body", "text": "Magic: Orlando started last season with three consecutive road wins, but has won back-to-back road games only once since. ... The Magic have been trailing by double digits for 99 of the 192 minutes that they’ve played so far this season, or 52% of the time."}
{"game_id": "0022100045", "chunk_id": "0022100045_017", "order": 17, "role": "body", "text": "Heat: Kyle Lowry had nine points and eight assists. ... Duncan Robinson appeared in his 150th consecutive game, the fifth-longest streak in Heat history. He’s eight games shy of matching Adebayo for the fourth-best streak and 24 games away from Glen Rice’s franchise record. ... Butler became the first Heat player to have at least 24 points and at least four steals by halftime."}
{"game_id": "0022100045", "chunk_id": "0022100045_019", "order": 19, "role": "body", "text": "Butler was a combined 5 for 13 in first halves of Miami’s first two games. He was 11 for 13 in the first half Monday."}
{"game_id": "0022100045", "chunk_id": "0022100045_021", "order": 21, "role": "body", "text": "The game was a reunion of some key parts of the USA Basketball Select Team that trained against the Olympic team in Las Vegas this summer. Spoelstra and Mosley were involved in coaching that team, and Herro played for the selects. “Having Tyler with the USA Select team, I understand his level of confidence, his level of being able to score at a high clip,” Mosley said."}
{"game_id": "0022100045", "chunk_id": "0022100045_023", "order": 23, "role": "body", "text": "Magic: Host Charlotte on Wednesday."}
{"game_id": "0022100045", "chunk_id": "0022100045_024", "order": 24, "role": "body", "text": "Heat: Visit Brooklyn on Wednesday."}
