{"game_id": "0022100773", "chunk_id": "0022100773_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Gary Harris scored 22 points and Wendell Carter Jr. had 19 points and 18 rebounds to rally the Orlando Magic past the Indiana Pacers 119-118 on Wednesday night."}
{"game_id": "0022100773", "chunk_id": "0022100773_002", "order": 2, "role": "body", "text": "Harris scored 10 points in the fourth quarter, including two key 3-pointers. He finished 6 of 11 from beyond the arc and thought his team played with more energy in the second half."}
{"game_id": "0022100773", "chunk_id": "0022100773_003", "order": 3, "role": "body", "text": "“We able to lock down on the defensive end, share the ball, make shots and get a win the second half,\" Harris said. “I feel like that’s the team we are. We’re resilient. We always keep fighting. These guys are hungry, they love to play basketball, they compete every day. It's a fun group to play with.\""}
{"game_id": "0022100773", "chunk_id": "0022100773_004", "order": 4, "role": "body", "text": "Harris said Carter played like a beast."}
{"game_id": "0022100773", "chunk_id": "0022100773_005", "order": 5, "role": "body", "text": "“When Wendell is being aggressive, there are not many people in the league that can stop him,” Harris said. “We need that from him every night.\""}
{"game_id": "0022100773", "chunk_id": "0022100773_006", "order": 6, "role": "body", "text": "Indiana led by 17 midway through the third, but the margin had dwindled to two by the end of the quarter. Orlando outscored the Pacers 33-21 in the period."}
{"game_id": "0022100773", "chunk_id": "0022100773_007", "order": 7, "role": "body", "text": "“The third quarter was the killer,” Indiana coach Rick Carlisle said. “We did a lot of other good things through the course of the game. The third quarter was our undoing.”"}
{"game_id": "0022100773", "chunk_id": "0022100773_008", "order": 8, "role": "body", "text": "Caris LeVert led the Pacers with 26 points, and rookie Terry Taylor posted his first career double-double with 24 points and 16 rebounds. Torrey Craig added 22 points."}
{"game_id": "0022100773", "chunk_id": "0022100773_009", "order": 9, "role": "body", "text": "Harris hit consecutive 3s to tie it at 108 with 1:50 left. Cole Anthony then stole the ball and made two free throws to give the Magic their first lead."}
{"game_id": "0022100773", "chunk_id": "0022100773_010", "order": 10, "role": "body", "text": "Franz Wagner’s three-point play put Orlando in front for good at 113-110. Wagner finished with 17 points."}
{"game_id": "0022100773", "chunk_id": "0022100773_011", "order": 11, "role": "body", "text": "With the Pacers trailing by four, Justin Holiday hit a 3 at the buzzer."}
{"game_id": "0022100773", "chunk_id": "0022100773_012", "order": 12, "role": "body", "text": "“They kept getting it to the rim,” Carlisle said. “They were aggressive and got it going downhill.”"}
{"game_id": "0022100773", "chunk_id": "0022100773_013", "order": 13, "role": "body", "text": "Indiana led 81-64 midway through the third before the Magic scored eight straight points to cut it to 86-80. They tied it at 88 early in the fourth."}
{"game_id": "0022100773", "chunk_id": "0022100773_014", "order": 14, "role": "body", "text": "“I'm so proud of these guys, playing three games in four nights and back-to-back — they show their resilience,\" Orlando coach Jamahl Mosley said. \"Every guy was a part of it. We continued to compete at a high level through the end of the game.”"}
{"game_id": "0022100773", "chunk_id": "0022100773_015", "order": 15, "role": "body", "text": "Indiana sank 10 of 19 3-pointers in the first half to lead 67-53 at halftime. The Pacers shot 54.2% in the first half while the Magic hit 44.9% from the field."}
{"game_id": "0022100773", "chunk_id": "0022100773_016", "order": 16, "role": "body", "text": "Taylor’s contributions were needed as Pacers rookie forward Isaiah Jackson left the game in the first 30 seconds with a right ankle sprain. He went straight to the locker room and wasn’t able to return."}
{"game_id": "0022100773", "chunk_id": "0022100773_017", "order": 17, "role": "body", "text": "It was Taylor’s sixth game, as he has played most of the season in the G League. Carlisle said Jackson was limping after the game but didn't need a walking boot."}
{"game_id": "0022100773", "chunk_id": "0022100773_019", "order": 19, "role": "body", "text": "Magic: Harris, who is from the Indianapolis suburb of Fishers, cracked 20 points for the first time since scoring 28 on Jan. 8 against Detroit. “It's always good to come home and get a win in front of family and friends,” he said. ... Anthony’s shooting woes continued as he shot just 2 of 15. He is shooting only 35% over the last 10 games."}
{"game_id": "0022100773", "chunk_id": "0022100773_020", "order": 20, "role": "body", "text": "Pacers: Domantas Sabonis missed his second consecutive game because of health and safety protocols. Sabonis is expected to miss Friday’s game against Chicago as well. Oshae Brissett (sore right ankle) and Goga Bitzade (sore right foot) also were sidelined."}
{"game_id": "0022100773", "chunk_id": "0022100773_022", "order": 22, "role": "body", "text": "Magic: Host the Memphis Grizzlies on Saturday."}
{"game_id": "0022100773", "chunk_id": "0022100773_023", "order": 23, "role": "body", "text": "Pacers: Host the Chicago Bulls in the finale of a three-game homestand Friday night."}
