{"game_id": "0022100155", "chunk_id": "0022100155_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Giannis Antetokounmpo had 31 points and 16 rebounds, Grayson Allen scored 25 points and hit a key 3-pointer late in the fourth quarter, and the Milwaukee Bucks held off the short-handed Philadelphia 76ers 118-109 on Tuesday night."}
{"game_id": "0022100155", "chunk_id": "0022100155_002", "order": 2, "role": "body", "text": "Bobby Portis added 19 points for the NBA champions, who played a day after celebrating the franchise’s first title in 50 years with a trip to visit President Joe Biden at the White House. The Bucks won for just the second time in the last seven."}
{"game_id": "0022100155", "chunk_id": "0022100155_003", "order": 3, "role": "body", "text": "“Always feels good to get a win,” Antetokounmpo said. “I was just trying to be competitive and trying to do whatever it takes to get a win. That’s what my team wants me to do, that’s what my team needs me to do.”"}
{"game_id": "0022100155", "chunk_id": "0022100155_004", "order": 4, "role": "body", "text": "Bucks coach Mike Budenholzer said Antetokounmpo took his game to another level."}
{"game_id": "0022100155", "chunk_id": "0022100155_005", "order": 5, "role": "body", "text": "“I think he had that extra competitiveness tonight,” Budenholzer said. “He made some plays that are special. He can do some unique things, and he did it multiple times tonight. There was just that extra desire, that extra competitive gear that he needed, that we needed.”"}
{"game_id": "0022100155", "chunk_id": "0022100155_006", "order": 6, "role": "body", "text": "Tyrese Maxey scored 31 points for the 76ers, who played without four-time All-Star Joel Embiid for the second straight game. Embiid was one of four 76ers out due to the NBA’s health and safety protocols, along with Tobias Harris, Matisse Thybulle and Isaiah Joe."}
{"game_id": "0022100155", "chunk_id": "0022100155_007", "order": 7, "role": "body", "text": "Seth Curry (left foot contusion) also sat for the 76ers, and Ben Simmons (personal reasons) hasn’t played all season."}
{"game_id": "0022100155", "chunk_id": "0022100155_008", "order": 8, "role": "body", "text": "All of the absences led Philadelphia general manager Daryl Morey to tweet Tuesday afternoon that “the hits just keep on comin”"}
{"game_id": "0022100155", "chunk_id": "0022100155_009", "order": 9, "role": "body", "text": "But the 76ers left the court in defeat to applause from the normally demanding home crowd, which recognized the strong effort put forth by a Philadelphia team that started Shake Milton, Maxey, Furkan Korkmaz, Paul Reed and Andre Drummond."}
{"game_id": "0022100155", "chunk_id": "0022100155_010", "order": 10, "role": "body", "text": "“The energy in the arena is unreal,” said Georges Niang, who scored 21 points off the bench."}
{"game_id": "0022100155", "chunk_id": "0022100155_011", "order": 11, "role": "body", "text": "Still, Niang is looking for more than moral victories."}
{"game_id": "0022100155", "chunk_id": "0022100155_012", "order": 12, "role": "body", "text": "“I think everybody’s here to win,” he said. “We know we’re short-handed, but we have to clean up some things in the fourth quarter.”"}
{"game_id": "0022100155", "chunk_id": "0022100155_013", "order": 13, "role": "body", "text": "Philadelphia took its last lead of the contest on Maxey’s bank shot that made it 102-101 with 5:43 left. Consecutive 3-pointers by Portis and Pat Connaughton put the Bucks ahead 107-102, and Allen all but sealed it with a 3 that put the Bucks up 114-107 with 1:30 to play."}
{"game_id": "0022100155", "chunk_id": "0022100155_014", "order": 14, "role": "body", "text": "“Grayson did a great job of getting to the right spot,” said Antetokounmpo, who assisted the key basket."}
{"game_id": "0022100155", "chunk_id": "0022100155_015", "order": 15, "role": "body", "text": "The Bucks led by eight early in the third on George Hill’s follow shot, but Philadelphia didn’t wilt. The 76ers went ahead 90-89 on Danny Green’s 3-pointer with 1:49 left in the third and finished the period in front 93-91 thanks to Drummond’s tip of Maxey’s miss with 1.5 ticks remaining."}
{"game_id": "0022100155", "chunk_id": "0022100155_016", "order": 16, "role": "body", "text": "Drummond had 17 points and 20 rebounds, and Milton scored 20 points."}
{"game_id": "0022100155", "chunk_id": "0022100155_018", "order": 18, "role": "body", "text": "Budenholzer talked before the game about how much he enjoyed the Bucks’ visit to the White House."}
{"game_id": "0022100155", "chunk_id": "0022100155_019", "order": 19, "role": "body", "text": "“It’s an honor, special,” he said. “It’s just a great day for the organization, our players. Just a very historical place. You can feel it when you’re in the building and when you’re in the presence of President Biden. (Biden was) very, very kind and generous with us. It’s a day all of us will remember. Just feel very honored to have been invited.”"}
{"game_id": "0022100155", "chunk_id": "0022100155_021", "order": 21, "role": "body", "text": "Bucks: Khris Middleton (health and safety protocols) missed his fifth straight contest. … Brook Lopez (back soreness) hasn’t played since the season opener and Budenholzer didn’t have an update when asked about Lopez prior to the contest. … Donte DiVincenzo (left ankle recovery) hasn’t played this season."}
{"game_id": "0022100155", "chunk_id": "0022100155_022", "order": 22, "role": "body", "text": "76ers: Harris missed his sixth straight contest, but Rivers said before the game that his health is improving. “Tobias is doing a lot better,” Rivers said. “We’ll say he’ll be back sooner than later.” … Thybulle sat for the third straight game and Joe missed his fourth in a row. Rivers wasn’t as optimistic about their imminent return."}
{"game_id": "0022100155", "chunk_id": "0022100155_024", "order": 24, "role": "body", "text": "Bucks: Improved to 1-1 on season-high, five-game road trip. … Won their sixth in a row against Philadelphia."}
{"game_id": "0022100155", "chunk_id": "0022100155_025", "order": 25, "role": "body", "text": "76ers: Reed brought the home fans to their feet with an emphatic block of Antetokounmpo with 4:03 left in the second quarter. … Maxey had 17 points in the first quarter, making 7 of 9 shots and 3 of 4 from beyond the arc. … … Hall of Famer and 76ers great Julius “Dr. J” Erving was in attendance."}
{"game_id": "0022100155", "chunk_id": "0022100155_027", "order": 27, "role": "body", "text": "Bucks: At Knicks on Wednesday night."}
{"game_id": "0022100155", "chunk_id": "0022100155_028", "order": 28, "role": "body", "text": "76ers: Host Toronto on Thursday night."}
{"game_id": "0022100155", "chunk_id": "0022100155_030", "order": 30, "role": "closing", "text": "https://apnews.com/hub/NBA and https://twitter.com/AP--Sports"}
