{"game_id": "0022100668", "chunk_id": "0022100668_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Joel Embiid doesn't need to emulate any other NBA star."}
{"game_id": "0022100668", "chunk_id": "0022100668_002", "order": 2, "role": "body", "text": "He proved Wednesday night that he's in a class on his own."}
{"game_id": "0022100668", "chunk_id": "0022100668_003", "order": 3, "role": "body", "text": "Embiid tied his career high with 50 points in just 27 minutes, leading a dominant third quarter that carried the Philadelphia 76ers to a 123-110 victory over the Orlando Magic."}
{"game_id": "0022100668", "chunk_id": "0022100668_004", "order": 4, "role": "body", "text": "Embiid also had 12 rebounds and three blocks while making 17 of 23 field goals and 15 of 17 free throws. The four-time All-Star and MVP candidate played just 58 seconds of the fourth quarter."}
{"game_id": "0022100668", "chunk_id": "0022100668_005", "order": 5, "role": "body", "text": "Before the game, teammate Tyrese Maxey asked Embiid: “Who you going to be tonight? Shaq (O'Neal)? Dirk (Nowitzki)?”"}
{"game_id": "0022100668", "chunk_id": "0022100668_006", "order": 6, "role": "body", "text": "“(He said) ‘I’m going to be Joel,’\" Maxey said. \"(I said) ‘You go be Joel.’ And that’s what he did.”"}
{"game_id": "0022100668", "chunk_id": "0022100668_007", "order": 7, "role": "body", "text": "“I said me,” Embiid said, “because at times whenever I want I’m able to be Shaq, whenever I want I’m also able to be Dirk, or Kobe (Bryant) or MJ (Michael Jordan), or any guards really, meaning shooting off the dribble, or pull-ups, or ball-handling, just a combination of everything offensively.”"}
{"game_id": "0022100668", "chunk_id": "0022100668_008", "order": 8, "role": "body", "text": "Embiid joined Hall of Famers Allen Iverson and Wilt Chamberlain as the only players in club history with multiple games of 50 points or more, while getting at least 50 points and 10 rebounds in the fewest minutes of any NBA player since 1955, according to Elias."}
{"game_id": "0022100668", "chunk_id": "0022100668_009", "order": 9, "role": "body", "text": "“That was easy, quick, efficient and determined,” Philadelphia coach Doc Rivers said. “He’s a little bit of (Hakeem) Olajuwon and a little bit of (Kevin) Garnett. It’s a heck of a combination if you can get it. But the difference is he can go out to the 3-point line, which sets him apart. He’s Joel Embiid; he’s not any of those guys. He’s his own guy.”"}
{"game_id": "0022100668", "chunk_id": "0022100668_010", "order": 10, "role": "body", "text": "Philadelphia was booed off the court at halftime, trailing 57-47. But the 76ers came out determined after the break, using a 17-6 run over the first 5:05. Embiid finally got some help from his teammates during the spurt, as Maxey drained a pair of 3-pointers."}
{"game_id": "0022100668", "chunk_id": "0022100668_011", "order": 11, "role": "body", "text": "Embiid, who entered averaging 27.3 points, took over from there, scoring in a variety of ways in a breathtaking third quarter that matched his similarly stellar first quarter. He brought the fans roaring to their feet when he made a 3-pointer with 25 seconds left in the quarter that gave Philadelphia its largest lead to that point, 92-80."}
{"game_id": "0022100668", "chunk_id": "0022100668_012", "order": 12, "role": "body", "text": "“I’m trying to play at the best level possible I can, and that’s being the best player in the world,” Embiid said. “And for us to win I have to be that guy every single night.”"}
{"game_id": "0022100668", "chunk_id": "0022100668_013", "order": 13, "role": "body", "text": "It gave Embiid 47 points for the game and 23 in the third quarter alone in which he shot 8 of 10. The star center opened the contest by draining 8 of 10 shots in a 20-point first quarter that helped the 76ers to a 25-21 advantage."}
{"game_id": "0022100668", "chunk_id": "0022100668_014", "order": 14, "role": "body", "text": "“He was just unbelievable from the start,” Rivers said. “Just dominant in every way. Every shot was the right shot.”"}
{"game_id": "0022100668", "chunk_id": "0022100668_015", "order": 15, "role": "body", "text": "Tobias Harris added 21 points for the 76ers, who have won nine of 11. Philadelphia began play sixth in the East but just 2 ½ games out of the top spot."}
{"game_id": "0022100668", "chunk_id": "0022100668_016", "order": 16, "role": "body", "text": "Mo Bamba set career highs with 32 points and seven 3-pointers for Orlando. The rebuilding Magic dropped to an NBA-worst 8-38 with their third straight loss and 13th defeat in the last 14 games."}
{"game_id": "0022100668", "chunk_id": "0022100668_017", "order": 17, "role": "body", "text": "Despite the defeat, Orlando continues to take a big-picture, positive approach to player development."}
{"game_id": "0022100668", "chunk_id": "0022100668_018", "order": 18, "role": "body", "text": "“Positive energy is extremely valuable,” said Magic assistant coach Jesse Mermuys, who filled in for head coach Jamahl Mosley (health and safety protocols) for the second straight game."}
{"game_id": "0022100668", "chunk_id": "0022100668_019", "order": 19, "role": "body", "text": "Embiid was dominant in the first quarter but the rest of the 76ers combined for just five points on 2-for-11 shooting. And it caught up to them in the second quarter. The Magic scored 11 of the final 14 points to open a 10-point advantage after Embiid went to the bench with three fouls with 3:07 remaining."}
{"game_id": "0022100668", "chunk_id": "0022100668_020", "order": 20, "role": "body", "text": "Bamba finished with 28 points and made 7 of 8 3-pointers in the opening half, easily bettering his previous career highs in scoring (22 points) and made 3-pointers (5)."}
{"game_id": "0022100668", "chunk_id": "0022100668_022", "order": 22, "role": "body", "text": "Magic: Assistant coach Nate Tibbetts also was absent due to health and safety protocols. … Wendell Carter Jr. (sore left hamstring) was out of the lineup for the seventh consecutive contest. Mermuys believes Carter’s return is imminent. … R.J. Hampton went down hard with 4:52 left in the fourth, went to the locker room and didn’t return."}
{"game_id": "0022100668", "chunk_id": "0022100668_023", "order": 23, "role": "body", "text": "76ers: Danny Green (right hip) missed his fourth in a row, Matisse Thybulle (right shoulder) his third straight and Shake Milton (back) his eighth. Rivers said he expects Thybulle to miss at least one more game, while he didn’t have a timetable for Milton."}
{"game_id": "0022100668", "chunk_id": "0022100668_025", "order": 25, "role": "body", "text": "Magic: Fell to 6-22 on the road. Orlando is 2-16 at home. … Trail the four-game season series 3-0. The teams will play once more, March 13 in Orlando."}
{"game_id": "0022100668", "chunk_id": "0022100668_026", "order": 26, "role": "body", "text": "76ers: Improved to 10-9 at home and 9-6 with Embiid in the lineup in Philadelphia. … As trade rumors continue to circulate around Ben Simmons, who has been out all season due to personal reasons, Rivers said rebounding and playmaking would be areas for addition at the trade deadline when pressed. “You need playmakers in the playoffs, you just do,” he said. “You need guys who are going to make plays for themselves and others. And the more you have, the better team you have, the better chance you have.”"}
{"game_id": "0022100668", "chunk_id": "0022100668_028", "order": 28, "role": "body", "text": "Magic: Open five-game homestand against the Lakers on Friday."}
{"game_id": "0022100668", "chunk_id": "0022100668_029", "order": 29, "role": "body", "text": "76ers: Host the Clippers on Friday."}
