{"game_id": "0022100579", "chunk_id": "0022100579_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Ja Morant had 22 points, nine rebounds and six assists and Memphis built an early lead and coasted to a 118-88 victory over the Detroit Pistons on Thursday night, the Grizzlies’ seventh straight win."}
{"game_id": "0022100579", "chunk_id": "0022100579_002", "order": 2, "role": "body", "text": "Dillon Brooks finished with 18 points, and Tyus Jones and rookie Ziaire Williams added 14 points apiece for Memphis, a season high for Williams."}
{"game_id": "0022100579", "chunk_id": "0022100579_003", "order": 3, "role": "body", "text": "“Guys understood what the game plan was,” Memphis coach Taylor Jenkins said of taking an early lead and building it through the game. “I thought they came out and did a great job and set the tone in that first quarter."}
{"game_id": "0022100579", "chunk_id": "0022100579_004", "order": 4, "role": "body", "text": "“We talked about, ‘We’ve got to keep doing that.’ And luckily, we were able to build on that lead after halftime going into the fourth quarter.”"}
{"game_id": "0022100579", "chunk_id": "0022100579_005", "order": 5, "role": "body", "text": "Saben Lee led the Pistons with 14 points. Hamidou Diallo and rookie Cade Cunningham had 12 apiece. Trey Lyles finished with 10 points."}
{"game_id": "0022100579", "chunk_id": "0022100579_006", "order": 6, "role": "body", "text": "Memphis led by 16 at the half and extended the advantage in the third quarter as the Pistons continued to struggle shooting. Detroit made only one of its first 10 shots in the third. Eventually, Memphis would build its lead to 82-52 and the Pistons were headed to their second blowout loss on consecutive nights."}
{"game_id": "0022100579", "chunk_id": "0022100579_007", "order": 7, "role": "body", "text": "It was another night of learning experience for Detroit, which has the second-worst record in the NBA at 7-30. The Pistons, who lost Wednesday night in Charlotte 140-111, quickly found themselves down by double digits against Memphis. The lead would reach 18 early as the Grizzlies shot better than 50%, while the Pistons misfired on all six of their 3-point attempts."}
{"game_id": "0022100579", "chunk_id": "0022100579_008", "order": 8, "role": "body", "text": "“It’s hard when you put yourself down in the hole,” Detroit center Isaiah Stewart said."}
{"game_id": "0022100579", "chunk_id": "0022100579_009", "order": 9, "role": "body", "text": "Pistons coach Dwane Casey said there were some lingering effects from the loss at Charlotte and playing a back-to-back on the road. Even when the Pistons tried to make a run, the energy just wasn’t there."}
{"game_id": "0022100579", "chunk_id": "0022100579_010", "order": 10, "role": "body", "text": "“Our fuel meter was down. Our energy was down from top to bottom. Guys coming off the bench; guys starting,” Casey said, later adding: “It really showed in our shooting. Everything was short, Again, we’ve got to be a team that faces adversity. … Understanding that every night you come out, you’re going to have a gunslinging.”"}
{"game_id": "0022100579", "chunk_id": "0022100579_011", "order": 11, "role": "body", "text": "The Memphis shooting remained near 50%, the lead maintained at double digits and the Grizzlies led 62-46 at the half, Morant and Williams leading the way with 14 points each."}
{"game_id": "0022100579", "chunk_id": "0022100579_012", "order": 12, "role": "body", "text": "It was the latest in a series of wins in spite of the Grizzlies – like most teams – dealing with missing players because of health and safety protocols."}
{"game_id": "0022100579", "chunk_id": "0022100579_013", "order": 13, "role": "body", "text": "“We’ve got so much to give,” Brooks said. “The potential is untapped yet. We haven’t even hit on all cylinders.”"}
{"game_id": "0022100579", "chunk_id": "0022100579_015", "order": 15, "role": "body", "text": "Casey isn’t looking for success right now with his young team. He made the point that most of the players “should be playing for Memphis State,” a reference to the local college team under Penny Hardaway. “We rarely talk about winning,” Casey said, later adding: “It’s the same thing where Memphis was when Ja (Morant) first got here a few years ago. It’s no mystery. We’re rebuilding.”"}
{"game_id": "0022100579", "chunk_id": "0022100579_017", "order": 17, "role": "body", "text": "The first returns were released Thursday in the All-Star voting and Morant is third among guards in the Western Conference. His teammates said they were not surprised. “He brings it every night. Every single night. There’s never an off game,” Brooks said of Morant. “That’s why I love playing with this guy.”"}
{"game_id": "0022100579", "chunk_id": "0022100579_019", "order": 19, "role": "body", "text": "Pistons: Saddiq Bey, who averages 15.1 points a game, was held scoreless until a 3-pointer with 3:28 left. He missed his previous five shots in the game. … C Isaiah Stewart was back in the starting lineup after missing the previous six games under the health and safety protocol. … Lee had 10 points at the half, hitting all three of his shots, including a pair of 3-pointers."}
{"game_id": "0022100579", "chunk_id": "0022100579_020", "order": 20, "role": "body", "text": "Grizzlies: Of the eight players on the injury report, four were listed under the health and safety protocol. Before the game, Jenkins said all of the players have been cleared from the protocols and would return when ready. Brooks and De’Anthony Melton were available. … The seven-game winning streak matched a winning span between Jan. 8 and Feb. 1, 2021. … Williams started his first NBA game. His previous scoring high was 11 points on Nov. 3 against Denver. …Steven Adams had 14 rebounds. …Memphis scored 70 points in the paint, the ninth game where the Grizzlies have had at least 70 paint points."}
{"game_id": "0022100579", "chunk_id": "0022100579_022", "order": 22, "role": "body", "text": "Pistons: Host Orlando on Saturday night."}
{"game_id": "0022100579", "chunk_id": "0022100579_023", "order": 23, "role": "closing", "text": "Grizzlies: At Los Angeles Clippers on Saturday night."}
