{"game_id": "0022100173", "chunk_id": "0022100173_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — After losing four of their first five games, the Los Angeles Clippers are rolling. And they're showing they can play with the lead when Paul George needs a breather."}
{"game_id": "0022100173", "chunk_id": "0022100173_002", "order": 2, "role": "body", "text": "George scored 27 points, Reggie Jackson added all of his 22 in the second half and the Clippers hung on to beat the Miami Heat 112-109 Thursday night for their sixth straight win."}
{"game_id": "0022100173", "chunk_id": "0022100173_003", "order": 3, "role": "body", "text": "Eric Bledsoe had 21 points and Ivica Zubac finished with 18 points and 11 rebounds for the Clippers, who trailed by 17 points in the first quarter when Miami’s Bam Adebayo scored 19 points."}
{"game_id": "0022100173", "chunk_id": "0022100173_004", "order": 4, "role": "body", "text": "Adebayo had a season-high 30 points and 11 rebounds. Kyle Lowry scored 22 of his 25 points in the fourth, when Miami outscored the Clippers 9-4 over the final 1:36."}
{"game_id": "0022100173", "chunk_id": "0022100173_005", "order": 5, "role": "body", "text": "“I like that Kyle. I like that type of Kyle. I like that aggressive Kyle,” Adebayo said. “I like the way he got to his spots. I feed off that.”"}
{"game_id": "0022100173", "chunk_id": "0022100173_006", "order": 6, "role": "body", "text": "Miami dropped its third in a row and fourth of five."}
{"game_id": "0022100173", "chunk_id": "0022100173_007", "order": 7, "role": "body", "text": "“I was trying to just find a way to get a win,” Lowry said. “I had opportunity, I attacked a lot more. And just trying to be a little bit more assertive on my team, but it doesn’t matter because we still lost the game.”"}
{"game_id": "0022100173", "chunk_id": "0022100173_008", "order": 8, "role": "body", "text": "Tyler Herro added 23 points while missing all of his six 3-pointers for Miami."}
{"game_id": "0022100173", "chunk_id": "0022100173_009", "order": 9, "role": "body", "text": "Jackson made two free throws with 3.9 seconds to go for a three-point lead. P.J. Tucker turned the ball over when Nicolas Batum batted away his inbounds pass from the sideline to Terance Mann."}
{"game_id": "0022100173", "chunk_id": "0022100173_010", "order": 10, "role": "body", "text": "“I just tried to anticipate a little bit,” Batum said."}
{"game_id": "0022100173", "chunk_id": "0022100173_011", "order": 11, "role": "body", "text": "George sat down early in the third, but Jackson and Bledsoe showed the Clippers were in capable hands."}
{"game_id": "0022100173", "chunk_id": "0022100173_012", "order": 12, "role": "body", "text": "Jackson’s 3-pointer gave the Clippers their first lead of the game in the third after he scored his first points of the game on their previous possession. He finished with 15 in the period, with the Clippers closing on a 21-12 run to lead 86-78 going into the fourth."}
{"game_id": "0022100173", "chunk_id": "0022100173_013", "order": 13, "role": "body", "text": "“We’re just playing with more flow and pace,” said Bledsoe, who is back for his second stint with the Clippers. “We got tons of shooters.”"}
{"game_id": "0022100173", "chunk_id": "0022100173_014", "order": 14, "role": "body", "text": "Adebayo’s dunk provided the Heat’s only lead in the third, 66-65. Jackson and Bledsoe keyed LA’s big run, combining for 19 points. Zubac’s dunk off Bledsoe’s pass was the only time Jackson and Bledsoe didn’t score during the spurt."}
{"game_id": "0022100173", "chunk_id": "0022100173_015", "order": 15, "role": "body", "text": "The Clippers erased all of their 17-point deficit in the second and trailed 58-56 at halftime."}
{"game_id": "0022100173", "chunk_id": "0022100173_016", "order": 16, "role": "body", "text": "Bledsoe kept it up in the fourth, scoring seven straight, capped by a 3-pointer that pushed the Clippers' lead to 93-82."}
{"game_id": "0022100173", "chunk_id": "0022100173_017", "order": 17, "role": "body", "text": "It was Adebayo's show in the first quarter, when he scored nearly half of the Heat's 40 points and they led by 17. Even when he sat in the last couple minutes, Max Strus hit back-to-back 3-pointers to preserve Miami's comfortable lead. Buoyed by Adebayo's offense, the Heat shot 68% and dominated the paint, 22-8."}
{"game_id": "0022100173", "chunk_id": "0022100173_018", "order": 18, "role": "body", "text": "“We knew exactly what was coming. The speed at which they did it we weren’t ready for,” Clippers coach Tyronn Lue said. “We looked like we were the team that was on a back-to-back instead of those guys.”"}
{"game_id": "0022100173", "chunk_id": "0022100173_020", "order": 20, "role": "body", "text": "Heat: Playing 10 of 15 games this month on the road, the most in November since a franchise-record 11 in 2017. ... They played a back-to-back in LA for the first time in franchise history, losing in overtime to the Lakers a night earlier."}
{"game_id": "0022100173", "chunk_id": "0022100173_021", "order": 21, "role": "body", "text": "Clippers: Won a franchise-best six in a row over the Heat. Their last loss was in December 2018."}
{"game_id": "0022100173", "chunk_id": "0022100173_023", "order": 23, "role": "body", "text": "Serge Ibaka asked to go down to the G League to work on his timing and conditioning after playing his first two games of the season with the Clippers."}
{"game_id": "0022100173", "chunk_id": "0022100173_024", "order": 24, "role": "body", "text": "“That just shows you the professional he is,” Lue said."}
{"game_id": "0022100173", "chunk_id": "0022100173_025", "order": 25, "role": "body", "text": "Ibaka underwent back surgery in June that ended his season and caused him to sit out the first six games of this season."}
{"game_id": "0022100173", "chunk_id": "0022100173_026", "order": 26, "role": "body", "text": "He had 14 points and eight rebounds in 25 minutes of the Agua Caliente Clippers' win Thursday night."}
{"game_id": "0022100173", "chunk_id": "0022100173_028", "order": 28, "role": "body", "text": "Heat: Visits Utah on Saturday in the teams' second and final matchup of the regular season."}
{"game_id": "0022100173", "chunk_id": "0022100173_029", "order": 29, "role": "body", "text": "Clippers: Hosts Minnesota on Saturday in the first game of a back-to-back."}
