{"game_id": "0022100705", "chunk_id": "0022100705_001", "order": 1, "role": "lead", "text": "DALLAS -- — Luka Doncic had 37 points, 11 rebounds and nine assists and Kristaps Porzingis had 15 points, eight rebounds and a season-best six blocks as the Dallas Mavericks shut down the Memphis Grizzlies to win 104-91 on Sunday night."}
{"game_id": "0022100705", "chunk_id": "0022100705_002", "order": 2, "role": "body", "text": "The Mavericks never trailed and led by as many as 22 points in winning for the 11th time in their last 13 games. They took the season series 3-1 and pulled within four games of the Southwest Division-leading Grizzlies."}
{"game_id": "0022100705", "chunk_id": "0022100705_003", "order": 3, "role": "body", "text": "They also held Memphis to within six points of its lowest scoring total — which came in Dallas’ 112-85 road win on Jan. 14 that snapped the Grizzlies’ franchise-best 11-game winning streak."}
{"game_id": "0022100705", "chunk_id": "0022100705_004", "order": 4, "role": "body", "text": "“Everybody’s involved,” Doncic said of the Mavericks’ defense, which went into the game third in the NBA allowing 102.8 points per game. “Everybody’s helping each other. That’s what we’ve got to do.”"}
{"game_id": "0022100705", "chunk_id": "0022100705_005", "order": 5, "role": "body", "text": "Ja Morant had 35 points and 13 rebounds for the Grizzlies, going 14 for 31 from the floor while the rest of the team shot 23 for 68 (33.8%). They shot a season-worst 16.7% on 3-pointers (4 for 24)."}
{"game_id": "0022100705", "chunk_id": "0022100705_006", "order": 6, "role": "body", "text": "“We couldn’t make a shot tonight,” Grizzlies coach Taylor Jenkins said. “Our defense was there. Just our offense couldn’t get it done.”"}
{"game_id": "0022100705", "chunk_id": "0022100705_007", "order": 7, "role": "body", "text": "Doncic wore elastic therapeutic tape on his neck after taking a hard fall late in Dallas’ loss to Phoenix on Thursday, and often wore a heat pack around his waist while on the bench."}
{"game_id": "0022100705", "chunk_id": "0022100705_008", "order": 8, "role": "body", "text": "“My neck’s pretty stiff,” said Doncic, who then showed how he struggles to turn his head. “With the therapy, it’s going to get better.”"}
{"game_id": "0022100705", "chunk_id": "0022100705_009", "order": 9, "role": "body", "text": "The Mavericks had a season-high 12 blocks, four more than their previous high, after averaging 3.8 per game coming in. Porzingis fouled out with 6:43 to play, but his six blocks were one short of his career best."}
{"game_id": "0022100705", "chunk_id": "0022100705_010", "order": 10, "role": "body", "text": "“We know if we don’t come and play with that toughness that they’re going to get us out of the gym,” Dorian Finney-Smith said."}
{"game_id": "0022100705", "chunk_id": "0022100705_011", "order": 11, "role": "body", "text": "Memphis saw a series of season-worsts in the first half: lowest scoring (34 points), poorest shooting (28%) and worst behind the 3-point line (14.3% on 2 for 14). It was also the lowest-scoring opening half for a Dallas opponent this season."}
{"game_id": "0022100705", "chunk_id": "0022100705_013", "order": 13, "role": "body", "text": "Grizzlies: The shooting woes negated their usual strengths, outscoring Dallas 60-50 in the paint, 19-9 on fast-break points and 16-5 on second-chance points thanks with 21 offensive rebounds. … Jenkins grew up in Dallas and will visit his high school, St. Mark’s, on Monday. … Forward Brandon Clarke was sidelined by back soreness. … Starting guard Desmond Bane, who played at TCU in nearby Fort Worth, and reserve forward Kyle Anderson missed their third consecutive games while in the NBA’s COVID-19 health and safety protocol."}
{"game_id": "0022100705", "chunk_id": "0022100705_014", "order": 14, "role": "body", "text": "Mavericks: They finished a five-game homestand 4-1. … Porzingis’ five blocks in the first half matched his season high for a full game. … Guard Sterling Brown missed his third straight game with a sore left foot and guard Frank Ntilikina sat out with a non-COVID illness."}
{"game_id": "0022100705", "chunk_id": "0022100705_016", "order": 16, "role": "body", "text": "Doncic went into the fourth quarter with eight assists and added his ninth with 6:23 to play, which was his last of the game. It was the 17th time he has fallen either one rebound or one assist short of a triple-double, of which he has 41 in his four-year NBA career."}
{"game_id": "0022100705", "chunk_id": "0022100705_017", "order": 17, "role": "body", "text": "“He had the total package, not just the stats,” Mavericks coach Jason Kidd said. “Mentally he was in the right place. He was great tonight.”"}
{"game_id": "0022100705", "chunk_id": "0022100705_019", "order": 19, "role": "body", "text": "Morant scored 28 points in the paint."}
{"game_id": "0022100705", "chunk_id": "0022100705_020", "order": 20, "role": "body", "text": "“That should tell you if I’m scared or not of who’s at the rim,” he said."}
{"game_id": "0022100705", "chunk_id": "0022100705_022", "order": 22, "role": "body", "text": "Grizzlies: Visit San Antonio on Wednesday to end a four-game road trip."}
{"game_id": "0022100705", "chunk_id": "0022100705_023", "order": 23, "role": "body", "text": "Mavericks: At Golden State on Tuesday; Dallas held the Warriors to season-low score of 82 on Jan. 5."}
