{"game_id": "0022100279", "chunk_id": "0022100279_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — De’Aaron Fox scored 21 points before being ejected in the fourth quarter, Marvin Bagley III made a clutch 3-pointer with 30 seconds remaining and the Sacramento Kings held off the Portland Trail Blazers 125-121 on Wednesday night."}
{"game_id": "0022100279", "chunk_id": "0022100279_002", "order": 2, "role": "body", "text": "Buddy Hield added 22 points in 30 minutes off the bench and Davion Mitchell had 16 to give the Kings their first win under interim coach Alvin Gentry. Gentry took over after Luke Walton was fired Sunday."}
{"game_id": "0022100279", "chunk_id": "0022100279_003", "order": 3, "role": "body", "text": "“It takes a village,” Gentry said. “We’re not a team of one guy we throw it to or two guys we throw it to. We’re a team that has to have different people do different things for us and step up. That’s exactly what we did tonight.”"}
{"game_id": "0022100279", "chunk_id": "0022100279_004", "order": 4, "role": "body", "text": "Damian Lillard had 32 points and 10 assists for Portland. Jusuf Nurkic added a season-high 28 points and 17 rebounds. The Trail Blazers had won four in a row."}
{"game_id": "0022100279", "chunk_id": "0022100279_005", "order": 5, "role": "body", "text": "Fox was ejected with 6:06 left after picking up back-to-back technical fouls on a night that included six technicals and two player ejections. Portland’s Robert Covington was ejected in the first half for a hostile act after tossing his goggles near the feet of a referee."}
{"game_id": "0022100279", "chunk_id": "0022100279_006", "order": 6, "role": "body", "text": "“It got a little chippy,” Blazers coach Chauncey Billups said. “There was a time or two I came into the huddle and said, ‘Stay off the officials.’ I felt like that got us a little bit off our rhythm.”"}
{"game_id": "0022100279", "chunk_id": "0022100279_007", "order": 7, "role": "body", "text": "The Kings led by one, then slowly pulled away after their leading scorer was tossed."}
{"game_id": "0022100279", "chunk_id": "0022100279_008", "order": 8, "role": "body", "text": "Hield had seven points over the final five minutes, including four free throws. Mitchell also scored five down the stretch, and Bagley’s 3-pointer from the right corner put Sacramento ahead 121-114. Bagley, the second overall pick in 2018, has played sparingly this season."}
{"game_id": "0022100279", "chunk_id": "0022100279_009", "order": 9, "role": "body", "text": "“I shot it with confidence and was able to knock it down,” said Bagley, who finished with 10 points and eight rebounds. “My biggest thing is staying ready. It pays off, especially in times like this. I’m just staying locked in and being ready for whatever comes my way.”"}
{"game_id": "0022100279", "chunk_id": "0022100279_010", "order": 10, "role": "body", "text": "The Kings won for the second time in 10 games."}
{"game_id": "0022100279", "chunk_id": "0022100279_011", "order": 11, "role": "body", "text": "The Blazers ended the first quarter with a flurry capped by Larry Nance’s buzzer-beating 3-pointer."}
{"game_id": "0022100279", "chunk_id": "0022100279_012", "order": 12, "role": "body", "text": "But Portland’s offense was inconsistent much of the night and the Blazers had critical breakdowns on the other end of the court."}
{"game_id": "0022100279", "chunk_id": "0022100279_013", "order": 13, "role": "body", "text": "“We just couldn’t come up with stops,” Lillard said. “When you’re not able to score like we usually are, you control what you can control, which is getting stops. Tonight the effort was there. We were just one or two plays short.”"}
{"game_id": "0022100279", "chunk_id": "0022100279_014", "order": 14, "role": "body", "text": "Things got chippy in the third quarter when Nurkic and former Blazer Moe Harkless exchanged words while standing face to face. Both players were hit with technicals."}
{"game_id": "0022100279", "chunk_id": "0022100279_016", "order": 16, "role": "body", "text": "Trail Blazers: Portland is 1-8 on the road. … Lillard has scored 20 or more in nine straight. Lillard was also called for a technical for arguing with officials during a break in play. … Nurkic had a double-double within the first 10 minutes of the game."}
{"game_id": "0022100279", "chunk_id": "0022100279_017", "order": 17, "role": "body", "text": "Kings: Fox needs 10 assists to pass Chris Webber for fifth place in franchise history. … Leading rebounder Richaun Holmes was held out because of an eye injury."}
{"game_id": "0022100279", "chunk_id": "0022100279_019", "order": 19, "role": "body", "text": "Trail Blazers: At Golden State on Friday night."}
{"game_id": "0022100279", "chunk_id": "0022100279_020", "order": 20, "role": "body", "text": "Kings: At Los Angeles Lakers on Friday night in the first of two games in five days between the teams."}
