{"game_id": "0022100416", "chunk_id": "0022100416_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — Deandre Ayton had 28 points and 13 rebounds in his return from a non-COVID-19 illness, and the Phoenix Suns held off the Portland Trail Blazers 111-107 in overtime Tuesday night."}
{"game_id": "0022100416", "chunk_id": "0022100416_002", "order": 2, "role": "body", "text": "Chris Paul, who made the jumper that forced overtime, added 24 points and 14 assists for a Phoenix team still missing leading scorer Devin Booker because of a hamstring injury."}
{"game_id": "0022100416", "chunk_id": "0022100416_003", "order": 3, "role": "body", "text": "“That’s a big-time win for us. We’ve got a lot of guys down. Deandre Ayton being back in the lineup was huge for us,” Paul said."}
{"game_id": "0022100416", "chunk_id": "0022100416_004", "order": 4, "role": "body", "text": "Damian Lillard had 31 points and 10 assists for the Blazers, who lost their sixth straight."}
{"game_id": "0022100416", "chunk_id": "0022100416_005", "order": 5, "role": "body", "text": "The Suns have just five losses this season, but one of them came the night before against the Los Angeles Clippers. Phoenix had lost two of four before facing the struggling Blazers."}
{"game_id": "0022100416", "chunk_id": "0022100416_006", "order": 6, "role": "body", "text": "Cam Johnson's deep 3-pointer gave the Suns a 107-104 lead in overtime, but Norman Powell's long jumper got Portland within one. Ayton's basket kept the Suns in front 109-106."}
{"game_id": "0022100416", "chunk_id": "0022100416_007", "order": 7, "role": "body", "text": "Lillard missed the first of two free throws with 11.9 seconds left and the Blazers couldn't catch up."}
{"game_id": "0022100416", "chunk_id": "0022100416_008", "order": 8, "role": "body", "text": "“I told the guys it was a lot of character and integrity to be able to play on a back-to-back with that kind of energy against a team that was sitting there waiting for us,” Suns coach Monty Williams said."}
{"game_id": "0022100416", "chunk_id": "0022100416_009", "order": 9, "role": "body", "text": "After trailing by 14 in the first half, Portland rallied to go up 86-81 on Tony Snell's 3-pointer in the fourth quarter."}
{"game_id": "0022100416", "chunk_id": "0022100416_010", "order": 10, "role": "body", "text": "It was tight the rest of the way. Cameron Payne's 3-pointer briefly gave Phoenix a 94-93 lead with 2:30 left, but Lillard answered with a 3 of his own."}
{"game_id": "0022100416", "chunk_id": "0022100416_011", "order": 11, "role": "body", "text": "The Suns tied it at 100 with 40.5 seconds left after Payne and Chris Powell each made a basket. Jusuf Nurkic missed the second of two free throws for the Blazers."}
{"game_id": "0022100416", "chunk_id": "0022100416_012", "order": 12, "role": "body", "text": "After a jump ball, a call that was challenged by the Suns, leaving them with no timeouts, Paul fouled Powell, who missed his first free throw but hit the second to make it 102-100."}
{"game_id": "0022100416", "chunk_id": "0022100416_013", "order": 13, "role": "body", "text": "Paul's jumper tied it at 102 with 8.2 seconds to go in regulation."}
{"game_id": "0022100416", "chunk_id": "0022100416_014", "order": 14, "role": "body", "text": "“Nobody likes losing. I don’t like losing. Nobody in the locker room likes losing, so obviously, nobody’s happy,” Blazers first-year coach Chauncey Billups said. ”However, we’re in this thing together. We know that. We’ve talked about that. And just like we dug ourselves into this hole, no one person can do it and bring us out. We’ve got to just stick together and keep scrapping.\""}
{"game_id": "0022100416", "chunk_id": "0022100416_015", "order": 15, "role": "body", "text": "Injuries have plagued Portland in recent weeks, and starting guard CJ McCollum remained out with a punctured lung."}
{"game_id": "0022100416", "chunk_id": "0022100416_016", "order": 16, "role": "body", "text": "Booker, who sat out his sixth game, is averaging 23.2 points for the Suns. Abdel Nader remained out because of right knee injury management, and Jalen Smith missed his second game with a non-COVID-19 illness."}
{"game_id": "0022100416", "chunk_id": "0022100416_017", "order": 17, "role": "body", "text": "But the Suns welcomed back Ayton, their talented big man who missed the previous two games. He said afterward he lost 10 pounds while he was sick, so putting in a long shift with a game that went to overtime was tough."}
{"game_id": "0022100416", "chunk_id": "0022100416_018", "order": 18, "role": "body", "text": "“That’s what 45 minutes feels like. I ain’t never played 45. But us just executing down the stretch and just trusting one another and playing together the whole night was beautiful to see,” he said."}
{"game_id": "0022100416", "chunk_id": "0022100416_019", "order": 19, "role": "body", "text": "Phoenix went up 36-24 in the opening half after Mikal Bridges' jumper. Portland closed to 49-43 at the break. The Blazers struggled from 3-point range in the half, making just three of 18 attempts and missing 11 straight."}
{"game_id": "0022100416", "chunk_id": "0022100416_020", "order": 20, "role": "body", "text": "Portland narrowed the gap to 73-72 late in the third quarter after Robert Covington's short jumper and 3-pointer. He hit another 3 at the buzzer to give the Blazers the lead and cap an 11-0 run."}
{"game_id": "0022100416", "chunk_id": "0022100416_022", "order": 22, "role": "body", "text": "Lillard spoke to the team about the losses the day before, and said the Blazers have found a way to get out of holes before, and they will again."}
{"game_id": "0022100416", "chunk_id": "0022100416_023", "order": 23, "role": "body", "text": "“I don’t think we’re proud of the way we're playing right now, closing games. I’m not proud of the way I’m shooting the ball. I’m not proud of a lot of things. But I’m a soldier. I know that in my heart. I know how to will a team,” he said. \"And we as a group, we know these situations, we know how to come out of it, and we’re gonna do that. We’ve just got to make sure that our minds are in the right place.”"}
{"game_id": "0022100416", "chunk_id": "0022100416_025", "order": 25, "role": "body", "text": "Suns: It was the third meeting with the Blazers this season — the teams split the first two. The Suns swept Portland in three meetings last season. ... JaVale McGee picked up five fouls and went to the bench in the third quarter."}
{"game_id": "0022100416", "chunk_id": "0022100416_026", "order": 26, "role": "body", "text": "Trail Blazers: It was the first of a back-to-back for the Blazers, who host Memphis on Wednesday. ... Larry Nance Jr. made his second start after Billups moved Covington to the bench. ... Portland went 14 of 22 from the free throw line. Lillard, Nurkic and Powell all missed key free throws."}
{"game_id": "0022100416", "chunk_id": "0022100416_028", "order": 28, "role": "body", "text": "The Suns host the Washington Wizards on Thursday."}
{"game_id": "0022100416", "chunk_id": "0022100416_029", "order": 29, "role": "body", "text": "The Trail Blazers host the Grizzlies on Wednesday night."}
