{"game_id": "0022100159", "chunk_id": "0022100159_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Kevin Durant scored 30 points and James Harden had his 59th career triple double in the Brooklyn Nets' 123-90 victory over the Orlando Magic on Wednesday night."}
{"game_id": "0022100159", "chunk_id": "0022100159_002", "order": 2, "role": "body", "text": "They gave most of the credit to 36-year-old LaMarcus Aldridge,"}
{"game_id": "0022100159", "chunk_id": "0022100159_003", "order": 3, "role": "body", "text": "Durant, the NBA’s leading scorer at 29.5 points per game, made 11 of 12 shots, including both of his 3-point attempts, to help Brooklyn win for the sixth time in seven games. Harden had 17 points, 11 rebounds and 11 assists to help the Nets recover from a disappointing loss at Chicago on Monday."}
{"game_id": "0022100159", "chunk_id": "0022100159_004", "order": 4, "role": "body", "text": "“We just wanted to come back and get that bad taste out of our mouth,” said Harden. “That (second) unit did an unbelievable job. A great effort in a bounce-back win.”"}
{"game_id": "0022100159", "chunk_id": "0022100159_005", "order": 5, "role": "body", "text": "The two stars sat out the fourth quarter, with the Nets up 94-75 after three. That put the game in the hands of a bench that produced 59 points, 21 of them by Aldridge."}
{"game_id": "0022100159", "chunk_id": "0022100159_006", "order": 6, "role": "body", "text": "“I was glad he was able to come out and extend the lead for us, and win the game for us basically,” Durant said about of the 36-year-old Aldridge, who also had eight rebounds."}
{"game_id": "0022100159", "chunk_id": "0022100159_007", "order": 7, "role": "body", "text": "“A true professional,” noted Harden. “He basically retired last year and had the confidence to come back, and he's doing it all for us.”"}
{"game_id": "0022100159", "chunk_id": "0022100159_008", "order": 8, "role": "body", "text": "Aldridge came off the bench with a big second quarter to put Brooklyn in command. The Magic never got the lead under 11 points in the second half."}
{"game_id": "0022100159", "chunk_id": "0022100159_009", "order": 9, "role": "body", "text": "Terrence Ross led Orlando with 17 points, and Mo Bamba added 14 points and nine rebounds. The Magic shot 38% and made 4 of 33 3-point shots."}
{"game_id": "0022100159", "chunk_id": "0022100159_010", "order": 10, "role": "body", "text": "“They went on their run early and we've got to be able to bounce back from that,” Magic coach Jamahl Mosley said. “Against this team you have to play before the defense is set. You have to create problems on the defensive end so it leads to points on the other end.”"}
{"game_id": "0022100159", "chunk_id": "0022100159_011", "order": 11, "role": "body", "text": "Aldridge hit three 3-pointers and scored 15 points in his first eight minutes in the game, helping the Nets pull out to a 19-point lead late in the first half."}
{"game_id": "0022100159", "chunk_id": "0022100159_012", "order": 12, "role": "body", "text": "Brooklyn led 65-53 after shooting 56% in the first half. The Nets shot 50% overall."}
{"game_id": "0022100159", "chunk_id": "0022100159_014", "order": 14, "role": "body", "text": "Nets: The Nets didn't shoot a free throw until Harden stepped to the line following a technical foul with 4:34 left in the first half. . . . Aldridge had a plus-minus of 29 in his 22 minutes. . . . Harden, who is third in the NBA in assists, had six in the first quarter."}
{"game_id": "0022100159", "chunk_id": "0022100159_015", "order": 15, "role": "body", "text": "Magic: Cole Anthony, Orlando's leading scorer who was coming off a career-high 33 points Sunday, did not score until making a layup with 4:46 left in the first half. He finished with 10 points and eight rebounds. . . Ross went over the 7,000-point mark for his 10-year career, finishing with 7,011."}
{"game_id": "0022100159", "chunk_id": "0022100159_017", "order": 17, "role": "body", "text": "Nets: At New Orleans on Friday night."}
{"game_id": "0022100159", "chunk_id": "0022100159_018", "order": 18, "role": "closing", "text": "Magic: Host Washington on Saturday night."}
