{"game_id": "0022100391", "chunk_id": "0022100391_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Even though the Los Angeles Clippers were missing Paul George, there weren't any doubts on who they were going to with the game on the line Saturday against the Orlando Magic."}
{"game_id": "0022100391", "chunk_id": "0022100391_002", "order": 2, "role": "body", "text": "Reggie Jackson hit a step-back jumper with 2.2 seconds remaining to give the Clippers a 106-104 victory over the Orlando Magic on Saturday."}
{"game_id": "0022100391", "chunk_id": "0022100391_003", "order": 3, "role": "body", "text": "“When Paul isn’t out there, Reggie is going to take that shot,” Clippers guard Terance Mann said."}
{"game_id": "0022100391", "chunk_id": "0022100391_004", "order": 4, "role": "body", "text": "Jackson had nine of his 25 points points in the final three minutes. He hit the winning 20-footer following a timeout after Orlando tied it at 104 on Cole Anthony's 3-pointer with 23.6 seconds left."}
{"game_id": "0022100391", "chunk_id": "0022100391_005", "order": 5, "role": "body", "text": "Jackson said his confidence was waning a bit after he air balled a 3-point attempt with 1:04 remaining, but Luke Kennard said during a timeout that the players and coaching staff made sure to let Jackson know they had his back."}
{"game_id": "0022100391", "chunk_id": "0022100391_006", "order": 6, "role": "body", "text": "“As soon as I was about to get down on myself, Luke said to stay confident. It was easy to dig deep down and find something else in there,” Jackson said. “I knew where I wanted to get to on the floor (on the final possession) and the shot dropped.\""}
{"game_id": "0022100391", "chunk_id": "0022100391_007", "order": 7, "role": "body", "text": "Orlando's Terrence Ross missed a 3-pointer at the buzzer, and the Clippers held on for their third straight victory. Ross, who had 22 points off the bench and made all 13 of his free-throw attempts, said he had a good look and missed it."}
{"game_id": "0022100391", "chunk_id": "0022100391_008", "order": 8, "role": "body", "text": "Anthony led the Magic with 23 points, hitting five 3-pointers."}
{"game_id": "0022100391", "chunk_id": "0022100391_009", "order": 9, "role": "body", "text": "“You call the timeout, you have 2.2 left on the clock and the one thing you ask for in a game like this on the road is that you get a good look, you get the shot you want. Whether it goes in or doesn’t, you gave yourself an opportunity on the road to win the game,\" coach Jamahl Mosley said after Orlando dropped its four straight and 14 of its last 16."}
{"game_id": "0022100391", "chunk_id": "0022100391_011", "order": 11, "role": "body", "text": "Kennard had a career high seven 3-pointers. The Clippers guard, who scored a season-high 23 points, hit a 27-footer with 59.3 seconds left to put the Clippers up 103-98."}
{"game_id": "0022100391", "chunk_id": "0022100391_012", "order": 12, "role": "body", "text": "Kennard was 8 of 16 from the floor, including 7 of 11 from beyond the arc, but coach Tyronn Lue thought the fourth-year guard could have played better."}
{"game_id": "0022100391", "chunk_id": "0022100391_013", "order": 13, "role": "body", "text": "“He’s still messing up a little bit. Turning down some shots and not coming off the screens when he’s supposed to be coming off the screens. We’ve been working with him, so he’s getting better,\" Lue said."}
{"game_id": "0022100391", "chunk_id": "0022100391_014", "order": 14, "role": "body", "text": "Kennard said he thought there would be some opportunities against the Magic."}
{"game_id": "0022100391", "chunk_id": "0022100391_015", "order": 15, "role": "body", "text": "“I think I was hunting shots and trying to find the open space,\" he said. \"Overall, I thought it was a pretty aggressive game. With PG being out and just having that mentality from start to finish.”"}
{"game_id": "0022100391", "chunk_id": "0022100391_017", "order": 17, "role": "body", "text": "George, who is 10th in the league in scoring at 25 points per game, has missed two straight games and is questionable going into Monday's contest against Phoenix. It will be the first time the two teams have met since the Suns won the Western Conference finals in six games."}
{"game_id": "0022100391", "chunk_id": "0022100391_019", "order": 19, "role": "body", "text": "Magic: Franz Wagner had 20 points, which is his fourth game this season with at least 20. ... Orlando jumped out to a 22-13 lead with four minutes remaining in the first quarter by making five of its first six from beyond the arc. ... Gary Harris had 14 points and Mo Bamba added 11. ... Wendell Carter Jr., who had 14 rebounds, reached 1,000 career defensive rebounds."}
{"game_id": "0022100391", "chunk_id": "0022100391_020", "order": 20, "role": "body", "text": "Clippers: Mann added 16 points. ... LA had a 49-44 lead at halftime after it held the Magic to 4 of 18 from the floor and 1 of 10 on 3-pointers. ... Rookie Brandon Boston Jr., who scored 25 points in Wednesday's win over Boston, missed his first six shots and scored seven points on 3-of-11 shooting. ... Ivica Zubac had 10 points. ... Los Angeles has won 17 of its last 20 meetings with Orlando going back to 2011-12."}
{"game_id": "0022100391", "chunk_id": "0022100391_022", "order": 22, "role": "body", "text": "Magic: Conclude five-game trip against the Los Angeles Lakers on Sunday."}
{"game_id": "0022100391", "chunk_id": "0022100391_023", "order": 23, "role": "body", "text": "Clippers: Host Phoenix on Monday."}
