{"game_id": "0022100680", "chunk_id": "0022100680_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Caris LeVert scored a franchise-record 22 of his 30 points in the fourth quarter, Malcolm Brogdon added 19 and the Indiana Pacers increased the pressure on Lakers coach Frank Vogel with a 111-104 victory over Los Angeles on Wednesday night."}
{"game_id": "0022100680", "chunk_id": "0022100680_002", "order": 2, "role": "body", "text": "Domantas Sabonis had 20 points, 12 rebounds and 10 assists in his 17th career triple-double for the Pacers, who snapped a four-game losing streak with just their second victory in 12 games. The Eastern Conference's 13th-place team roared past the Lakers in the fourth, starting with a 14-2 run led by LeVert and concluding with his three consecutive buckets in the final two minutes."}
{"game_id": "0022100680", "chunk_id": "0022100680_003", "order": 3, "role": "body", "text": "LeVert topped Reggie Miller's previous Pacers fourth-quarter record of 21 points. He went 9 for 10 with three 3-pointers in his brilliant final period."}
{"game_id": "0022100680", "chunk_id": "0022100680_004", "order": 4, "role": "body", "text": "“I knew I felt good,” said LeVert, limited to 15 minutes in the first three quarters by foul trouble. “My teammates kept me in it. ... My body felt great, and I felt locked in. The fouls were definitely frustrating. I knew I had to have a big fourth with Malcolm sitting out in the fourth.”"}
{"game_id": "0022100680", "chunk_id": "0022100680_005", "order": 5, "role": "body", "text": "Indiana won with a high degree of difficulty: Brogdon was on a minutes limit in his return from injury, while Sabonis played on a sprained ankle that's “probably going to be significant, but he was not coming out of this game,” according to coach Rick Carlisle."}
{"game_id": "0022100680", "chunk_id": "0022100680_006", "order": 6, "role": "body", "text": "“It was something we desperately needed,” Carlisle said. “It’s been a while since we won a game. ... These are all great challenges. We’re finding out more about the team all the time.”"}
{"game_id": "0022100680", "chunk_id": "0022100680_007", "order": 7, "role": "body", "text": "LeBron James had 30 points and 12 rebounds — including the 10,000th of his career — for the Lakers, who have lost four of five to fall back below .500. Talen Horton-Tucker added 20 points in the latest embarrassing loss during a season dotted with them for the 17-time champion franchise."}
{"game_id": "0022100680", "chunk_id": "0022100680_008", "order": 8, "role": "body", "text": "“Of course there’s a lot of frustration, for sure,” James said. “I feel like we have a good enough team to win ballgames and be over .500. But our record is ... we are who we are. We’ve got a road trip coming up and we will be tested with a lot of great teams.”"}
{"game_id": "0022100680", "chunk_id": "0022100680_009", "order": 9, "role": "body", "text": "Russell Westbrook scored 14 points on 5-for-17 shooting, and Vogel kept the struggling former NBA MVP on the Lakers' bench for the final 3:52."}
{"game_id": "0022100680", "chunk_id": "0022100680_010", "order": 10, "role": "body", "text": "Indiana trailed for most of the first three quarters before jumping ahead early in the fourth with 10 consecutive points, including eight from LeVert. The Pacers held strong down the stretch with more big baskets by LeVert, while the Lakers struggled to score with whatever lineup Vogel used."}
{"game_id": "0022100680", "chunk_id": "0022100680_011", "order": 11, "role": "body", "text": "The Lakers held a 15-point lead in the first half, but Indiana erased it with several minutes left in the third quarter, taking its first lead in two games at Crypto.com Arena. The Pacers never led while giving up 139 points to the Clippers on Monday."}
{"game_id": "0022100680", "chunk_id": "0022100680_013", "order": 13, "role": "body", "text": "Pacers: Brogdon played through a sore right Achilles tendon that kept him out for the last two games. ... Jeremy Lamb scored five points while playing on a sore left knee. ... T.J. McConnell went into the NBA's health and safety protocols. He hasn't played since Dec. 1 after having surgery on his right wrist."}
{"game_id": "0022100680", "chunk_id": "0022100680_014", "order": 14, "role": "body", "text": "Lakers: Anthony Davis missed his 15th straight game since Dec. 17 with a sprained left knee, but he was on the court during his team's morning shootaround. Los Angeles is deliberately bringing back its star big man from his latest major injury. ... Carmelo Anthony scored 14 points in his return from a three-game absence with lower back tightness."}
{"game_id": "0022100680", "chunk_id": "0022100680_016", "order": 16, "role": "body", "text": "Ninety minutes before this debacle began, Vogel shrugged off widespread rumors of his expected firing if the Lakers don’t make immediate headway in their mediocre season. Vogel led Los Angeles to a championship just 15 months ago, but only three players — and Dwight Howard, who left and returned — remain from that title team."}
{"game_id": "0022100680", "chunk_id": "0022100680_017", "order": 17, "role": "body", "text": "“It’s everyone. It’s all of us,” Vogel said. “We have to coach better. We have to play better. Everything has to be better.”"}
{"game_id": "0022100680", "chunk_id": "0022100680_018", "order": 18, "role": "body", "text": "In their last three games, the Lakers sandwiched an impressive win over Utah between humiliating losses to Denver and Indiana."}
{"game_id": "0022100680", "chunk_id": "0022100680_019", "order": 19, "role": "body", "text": "“We have high expectations,” Vogel said before the game. “This fan base really cares. It’s a big market. I wouldn’t want it any other way, to be honest with you. I want people to care.”"}
{"game_id": "0022100680", "chunk_id": "0022100680_021", "order": 21, "role": "body", "text": "Pacers: At Golden State on Thursday."}
{"game_id": "0022100680", "chunk_id": "0022100680_022", "order": 22, "role": "body", "text": "Lakers: At Orlando on Friday to open a six-game East Coast road trip."}
