{"game_id": "0022100433", "chunk_id": "0022100433_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Max Strus scored 23 of his career-best 32 points in the first half, Gabe Vincent added a career-best 27 and the Miami Heat beat the short-handed Orlando Magic 115-105 on Friday night."}
{"game_id": "0022100433", "chunk_id": "0022100433_002", "order": 2, "role": "body", "text": "The Heat made 19 3-pointers to give them 91 over their past five games. That's the most in team history, easily topping the 82 made over a five-game stretch from Feb.. 24, 2020, to March 4, 2020, according to the Elias Sports Bureau."}
{"game_id": "0022100433", "chunk_id": "0022100433_003", "order": 3, "role": "body", "text": "“That’s what we do; we’ve got shooters and we’ve got a lot guys who put in time in the gym and work on it,” said Strus, one of seven undrafted players out of the Heat’s 10 active players on Friday. “We’re going to keep playing that way if shots are falling. We’re making then, so why not keep shooting them?”"}
{"game_id": "0022100433", "chunk_id": "0022100433_004", "order": 4, "role": "body", "text": "Strus, a third-year NBA player, hit eight of his first 10 shots and six of his first seven from 3-point range. After Orlando climbed within 93-85 early in the fourth quarter, Strus had a four-point play and another 3 in a run that pushed the Heat back ahead by 17."}
{"game_id": "0022100433", "chunk_id": "0022100433_005", "order": 5, "role": "body", "text": "Strus’ eight 3-pointers were also a career high."}
{"game_id": "0022100433", "chunk_id": "0022100433_006", "order": 6, "role": "body", "text": "“(Strus) is like a few of our guys — Duncan (Robinson), Tyler (Herro) and even Gabe, to an extent — they’re ignitable,” Miami coach Erik Spoelstra said. “They hit two (3-pointers) and immediately they’re thinking three, four, five. They all can get in a roll and that’s what we saw with Max.”"}
{"game_id": "0022100433", "chunk_id": "0022100433_007", "order": 7, "role": "body", "text": "Vincent followed up his career-best, 26-point effort from two nights earlier with another stellar shooting night for Miami, which won for the fourth time in the past five games. The Heat also beat the Magic for a fourth consecutive time in the past two seasons."}
{"game_id": "0022100433", "chunk_id": "0022100433_008", "order": 8, "role": "body", "text": "Kyle Lowry added 11 points and a season-best 15 assists. P.J. Tucker had 15 points."}
{"game_id": "0022100433", "chunk_id": "0022100433_009", "order": 9, "role": "body", "text": "Still without stars Jimmy Butler and Bam Adebayo and key reserve Tyler Herro, the Heat were similarly short-handed and had just 10 available players."}
{"game_id": "0022100433", "chunk_id": "0022100433_010", "order": 10, "role": "body", "text": "The Magic scrambled on Friday and signed four players from their G League franchise in nearby Lakeland — Aleem Ford, Admiral Schofield, B.J. Johnson and Hassani Gravett — with hardship exemptions in order to meet the NBA’s minimum eight-player rule."}
{"game_id": "0022100433", "chunk_id": "0022100433_011", "order": 11, "role": "body", "text": "Terrence Ross, Moritz Wagner, Mo Bamba, R.J. Hampton and Ignas Brazdeikis were placed in the health and safety protocols, necessitating the G League call-ups. Orlando has been without Markelle Fultz, Jonathan Isaac, Michael Carter-Williams and E’Twaun Moore all season because of injuries, while Cole Anthony was scratched because of an ankle sprain and Jalen Suggs has a fractured thumb."}
{"game_id": "0022100433", "chunk_id": "0022100433_012", "order": 12, "role": "body", "text": "Orlando lost its seventh straight game and for the 13th time in the past 14 games. The Magic are 2-10 at the Amway Center."}
{"game_id": "0022100433", "chunk_id": "0022100433_013", "order": 13, "role": "body", "text": "Rookie Franz Wagner led the Magic with 27 points, while Gary Harris chipped in 20. Chuma Okeke added 18 points and 10 rebounds."}
{"game_id": "0022100433", "chunk_id": "0022100433_014", "order": 14, "role": "body", "text": "“I absolutely love our team’s effort,” Magic coach Jamahl Mosley said. “I love the way they played, I love the way they competed and the way they battled until the end.”"}
{"game_id": "0022100433", "chunk_id": "0022100433_015", "order": 15, "role": "body", "text": "With his Heat down 18-8 in the early going, Spoelstra angrily called time and Miami responded with a 15-0 burst. Ultimately, Miami outscored Orlando 23-4 over the final 5:48 of the first quarter to break open the game."}
{"game_id": "0022100433", "chunk_id": "0022100433_017", "order": 17, "role": "body", "text": "The emergency call-ups meant that the Magic’s four newcomers would be playing a back-to-back after the Lakeland Magic lost 112-101 to Austin on Thursday. In that game, Schofield scored 32 points in 38 minutes."}
{"game_id": "0022100433", "chunk_id": "0022100433_018", "order": 18, "role": "body", "text": "Schofield and Johnson are the only two G League call-ups with any prior NBA experience. Scofield, a University of Tennessee product, appeared in 33 NBA games previously with the Washington Wizards, while Johnson had previously seen time in 17 NBA games with Atlanta, Sacramento and Orlando."}
{"game_id": "0022100433", "chunk_id": "0022100433_020", "order": 20, "role": "body", "text": "Heat: Herro, the NBA’s leading bench scorer at 19.9 points per game, missed his second straight game with a quad contusion. “He’s making progress, but we want to be responsible to make sure he doesn’t have a setback,” Spoelstra said."}
{"game_id": "0022100433", "chunk_id": "0022100433_021", "order": 21, "role": "body", "text": "Magic: Orlando lost Wendell Carter Jr. early in the second quarter when he banged knees with Strus. He left the floor in a wheelchair and did not return. … Anthony rolled his ankle on Sunday, but he struggled through 34 minutes in Wednesday’s loss to the Hawks. The decision was made to rest Anthony on Friday 90 minutes prior to tipoff."}
{"game_id": "0022100433", "chunk_id": "0022100433_023", "order": 23, "role": "body", "text": "Heat: Play at Detroit on Sunday night."}
{"game_id": "0022100433", "chunk_id": "0022100433_024", "order": 24, "role": "closing", "text": "Magic: Play at Brooklyn on Saturday night."}
