{"game_id": "0022101149", "chunk_id": "0022101149_001", "order": 1, "role": "lead", "text": "CHICAGO -- — DeMar DeRozan did everything he could to carry the Chicago Bulls to a much-needed victory."}
{"game_id": "0022101149", "chunk_id": "0022101149_002", "order": 2, "role": "body", "text": "The only glitch came in the closing seconds of regulation. That's when he missed the potential go-ahead free throw after making his first two to tie it."}
{"game_id": "0022101149", "chunk_id": "0022101149_003", "order": 3, "role": "body", "text": "In the end, it didn't matter much."}
{"game_id": "0022101149", "chunk_id": "0022101149_004", "order": 4, "role": "body", "text": "DeRozan scored a season-high 50 points and Chicago rallied to beat the Los Angeles Clippers 135-130 in overtime Thursday night."}
{"game_id": "0022101149", "chunk_id": "0022101149_005", "order": 5, "role": "body", "text": "DeRozan finished two points shy of his career high. The five-time All-Star scored 17 in the fourth quarter and made up for his missed foul shot by scoring 10 more in overtime."}
{"game_id": "0022101149", "chunk_id": "0022101149_006", "order": 6, "role": "body", "text": "“It felt like a bomb went off inside my head,” he said. \"Just frustrated with myself.”"}
{"game_id": "0022101149", "chunk_id": "0022101149_007", "order": 7, "role": "body", "text": "DeRozan shrugged off the missed free throw and helped the Bulls come away with a win after falling behind by 16 in the third period."}
{"game_id": "0022101149", "chunk_id": "0022101149_008", "order": 8, "role": "body", "text": "Chicago, which led the Eastern Conference for a large portion of the season, moved a half-game ahead of sixth-place Toronto with five remaining. The Bulls are trying to stay in the top six in order to avoid the play-in round in the postseason."}
{"game_id": "0022101149", "chunk_id": "0022101149_009", "order": 9, "role": "body", "text": "Nikola Vucevic added 22 points and 14 rebounds. Zach LaVine scored 21 as the Bulls won for the third time in four games."}
{"game_id": "0022101149", "chunk_id": "0022101149_010", "order": 10, "role": "body", "text": "Reggie Jackson led Los Angeles with 34 points."}
{"game_id": "0022101149", "chunk_id": "0022101149_011", "order": 11, "role": "body", "text": "Paul George scored 22 in his second game back after missing three months because of a torn ulnar collateral ligament in his right elbow. He played 32 minutes and sat out overtime."}
{"game_id": "0022101149", "chunk_id": "0022101149_012", "order": 12, "role": "body", "text": "Marcus Morris Sr. added 20 points and Nicolas Batum scored 17. But the Clippers — eighth in the West — lost for the sixth time in seven games."}
{"game_id": "0022101149", "chunk_id": "0022101149_013", "order": 13, "role": "body", "text": "Clippers coach Tyronn Lue noticed a difference in the Bulls' defense as Chicago rallied."}
{"game_id": "0022101149", "chunk_id": "0022101149_014", "order": 14, "role": "body", "text": "“They picked their defensive intensity up,” he said. “I thought they did a good job with that. We took some bad shots, I thought, during that stretch instead of just continuing to keep playing the way we were playing.”"}
{"game_id": "0022101149", "chunk_id": "0022101149_016", "order": 16, "role": "body", "text": "Chicago led by four in overtime when Luke Kennard hit a 3 for Los Angeles with 1:12 left. Patrick Williams answered with one of his own to make it 129-125 with just under a minute remaining."}
{"game_id": "0022101149", "chunk_id": "0022101149_017", "order": 17, "role": "body", "text": "Jackson then hit two foul shots for the Clippers before DeRozan converted two to make it 131-127."}
{"game_id": "0022101149", "chunk_id": "0022101149_018", "order": 18, "role": "body", "text": "Williams rebounded a missed drive by Jackson, leading to two more free throws by DeRozan that made it a six-point game. Jackson nailed a 3 to cut it to 133-130 with five seconds left."}
{"game_id": "0022101149", "chunk_id": "0022101149_019", "order": 19, "role": "body", "text": "DeRozan caught the inbounds pass following a timeout by the Bulls and drove for a dunk, sealing a wild win for Chicago."}
{"game_id": "0022101149", "chunk_id": "0022101149_021", "order": 21, "role": "body", "text": "The Clippers saw their lead shrink to four early in the fourth and got it back up to 11 with about five minutes remaining before the Bulls made another push."}
{"game_id": "0022101149", "chunk_id": "0022101149_022", "order": 22, "role": "body", "text": "Los Angeles was leading 118-115 with seven seconds left in regulation when Terance Mann got called for a foul away from the ball on an inbounds play following a timeout. That led to a free throw for DeRozan that cut it to two and possession for Chicago."}
{"game_id": "0022101149", "chunk_id": "0022101149_023", "order": 23, "role": "body", "text": "DeRozan then got fouled by George on a 3-point attempt with 3.5 seconds remaining. He hit the first two foul shots to tie it at 118 and missed the third, sending the game to overtime."}
{"game_id": "0022101149", "chunk_id": "0022101149_025", "order": 25, "role": "body", "text": "Clippers: Batum (sore left ankle) and Morris (sore left knee) played well after being listed as questionable."}
{"game_id": "0022101149", "chunk_id": "0022101149_026", "order": 26, "role": "body", "text": "Bulls: DeRozan has 2,019 points, the second time he's scored 2,000 in a season. He is the first Bulls player to do it since Derrick Rose had 2,026 points in his 2010-11 MVP season. ... G Lonzo Ball (left knee) will start building up to sprinting at full speed and resume cutting after a 10-day pause because of discomfort, coach Billy Donovan said. How Ball responds will determine when — or if — he returns this season. Ball had surgery in January to repair a torn meniscus. “I have not gotten anything from the doctors that said to me like, ‘Listen, there’s just not enough time. We can't get him back.' They're gonna do everything they can to try to get him back,\" Donovan said. Chicago closes the regular season at Minnesota on April 10. ... Williams said he was late for the morning shootaround and got fined by the team. He then played by far a season-high 36:49 in his seventh game back after being sidelined since late October because of torn ligaments in his left wrist."}
{"game_id": "0022101149", "chunk_id": "0022101149_028", "order": 28, "role": "body", "text": "Clippers: Visit Milwaukee on Friday."}
{"game_id": "0022101149", "chunk_id": "0022101149_029", "order": 29, "role": "body", "text": "Bulls: Host Miami on Saturday."}
