{"game_id": "0022100671", "chunk_id": "0022100671_001", "order": 1, "role": "lead", "text": "BOSTON -- — LaMelo Ball had a triple-double with 15 points, 10 rebounds and 10 assists to lead the Charlotte Hornets to a 111-102 victory over the Boston Celtics on Wednesday night."}
{"game_id": "0022100671", "chunk_id": "0022100671_002", "order": 2, "role": "body", "text": "Terry Rozier led Charlotte with 28 points against his former team. Miles Bridges scored 22 and Kelly Oubre Jr. added 18 for the Hornets, who won for the ninth time in 12 games."}
{"game_id": "0022100671", "chunk_id": "0022100671_003", "order": 3, "role": "body", "text": "“To come in here and get a win — we want to make a statement,” Rozier said. “We want to get to where they're at as an organization.”"}
{"game_id": "0022100671", "chunk_id": "0022100671_004", "order": 4, "role": "body", "text": "Dennis Schröder paced Boston with 24 points. Jaylen Brown scored 21 and Al Horford had 13 points and 10 rebounds."}
{"game_id": "0022100671", "chunk_id": "0022100671_005", "order": 5, "role": "body", "text": "“I thought we had a lot of good looks and we moved the ball really well,” Brown said. “They made a lot of tough baskets. They came and outplayed us.”"}
{"game_id": "0022100671", "chunk_id": "0022100671_006", "order": 6, "role": "body", "text": "Boston star Jayson Tatum was hampered by foul trouble and finished with just 12 points on 5-of-19 shooting in 35 minutes. The Celtics had won five of six."}
{"game_id": "0022100671", "chunk_id": "0022100671_007", "order": 7, "role": "body", "text": "“I thought part of the foul trouble affected him overall as well as some other guys,” Celtics coach Ime Udoka said. “That was my message to the team: Impact the game when the shot's not falling.”"}
{"game_id": "0022100671", "chunk_id": "0022100671_008", "order": 8, "role": "body", "text": "The Celtics were just 14 of 46 on 3-point attempts."}
{"game_id": "0022100671", "chunk_id": "0022100671_009", "order": 9, "role": "body", "text": "Boston sliced a 12-point deficit to 88-84 early in the final quarter but Charlotte scored 10 of the next 14 points, pulling ahead 98-88 on Oubre’s 3-pointer from the left wing with 4:55 to play. Ball had nailed a 3 from the left corner two minutes earlier."}
{"game_id": "0022100671", "chunk_id": "0022100671_010", "order": 10, "role": "body", "text": "“The competitiveness and resiliency was there in the fourth quarter,” Hornets coach James Borrego said."}
{"game_id": "0022100671", "chunk_id": "0022100671_011", "order": 11, "role": "body", "text": "The Celtics cut it to 102-96 on Horford’s 3 with 2:48 left, but Ball nailed a 3 from in front of Boston’s bench and Rozier followed with one on the Hornets’ next possession."}
{"game_id": "0022100671", "chunk_id": "0022100671_012", "order": 12, "role": "body", "text": "Boston trimmed the margin to six one more time, but Rozier nailed another 3 to seal it in the final minute."}
{"game_id": "0022100671", "chunk_id": "0022100671_013", "order": 13, "role": "body", "text": "Ball grabbed a rebound with 0.2 seconds remaining to complete his triple-double. He said Bridges reminded him how close he was."}
{"game_id": "0022100671", "chunk_id": "0022100671_014", "order": 14, "role": "body", "text": "“He was like: ‘Box out and you'll get that last rebound,’\" Ball said, pointing to Bridges sitting next to him at the postgame news conference. ”I said, ‘Oh, you’re right!\""}
{"game_id": "0022100671", "chunk_id": "0022100671_015", "order": 15, "role": "body", "text": "Rozier hit three from beyond the arc in a 62-second span of the third quarter, pushing the Hornets’ lead to 75-61. They were up 86-74 entering the fourth."}
{"game_id": "0022100671", "chunk_id": "0022100671_016", "order": 16, "role": "body", "text": "“To be the best, you've got to beat the best,” Rozier said. “We just want to keep going. We're not satisfied. We've got to stay humble and keep on having fun and playing out there. That's the main thing.”"}
{"game_id": "0022100671", "chunk_id": "0022100671_018", "order": 18, "role": "body", "text": "Hornets: Oubre returned from COVID-19 protocol after missing four games and had 10 points by early in the second quarter. … Gordon Hayward took just one shot in the first half and finished with five points."}
{"game_id": "0022100671", "chunk_id": "0022100671_019", "order": 19, "role": "body", "text": "Celtics: C Robert Williams missed the game due to the birth of his son, named Hendrix. … G Marcus Smart missed his fifth straight game. He was out of virus protocol but sidelined for conditioning. ... G Aaron Nesmith has a sprained right ankle and also was sidelined. … Tatum picked up his third foul early in the second quarter and stood on the court near Boston’s bench, so the Celtics got a delay-of-game warning. He was whistled for his fifth early in the final quarter."}
{"game_id": "0022100671", "chunk_id": "0022100671_021", "order": 21, "role": "body", "text": "Mason Plumlee shot a free throw that appeared to miss the rim short by a few feet, bringing a loud reaction from the crowd."}
{"game_id": "0022100671", "chunk_id": "0022100671_023", "order": 23, "role": "body", "text": "Ball fell backward into the front row of seats after taking a 3 early in the third quarter, spilling drinks on a pair of fans."}
{"game_id": "0022100671", "chunk_id": "0022100671_025", "order": 25, "role": "body", "text": "Ball wore bright mismatched sneakers; the left was lime green and the other bright pink."}
{"game_id": "0022100671", "chunk_id": "0022100671_027", "order": 27, "role": "body", "text": "The Celtics acquired a pair of injured players from the Denver Nuggets as part of a three-team deal that included San Antonio. Boston received 7-foot-2 center Bol Bol, who is expected to have foot surgery and be sidelined for 8 to 12 weeks, and guard P.J. Dozier, who is out indefinitely after tearing his ACL this season."}
{"game_id": "0022100671", "chunk_id": "0022100671_028", "order": 28, "role": "body", "text": "Boston sent forward Juancho Hernangomez to the Spurs in a trade that helps the Celtics get under the luxury tax."}
{"game_id": "0022100671", "chunk_id": "0022100671_030", "order": 30, "role": "body", "text": "Hornets: Host the Oklahoma City Thunder on Friday."}
{"game_id": "0022100671", "chunk_id": "0022100671_031", "order": 31, "role": "body", "text": "Celtics: Host the Portland Trail Blazers on Friday."}
