{"game_id": "0022100129", "chunk_id": "0022100129_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Paul George had 21 points and 11 rebounds, Reggie Jackson scored 14 of his 20 points in the second half, and the Los Angeles Clippers rallied from a 20-point deficit to beat the Minnesota Timberwolves 104-84 on Friday night."}
{"game_id": "0022100129", "chunk_id": "0022100129_002", "order": 2, "role": "body", "text": "Ivica Zubac had 14 points and 14 rebounds for Los Angeles, which also won at Minnesota on Wednesday night. The Clippers have won three straight after losing four of their first five."}
{"game_id": "0022100129", "chunk_id": "0022100129_003", "order": 3, "role": "body", "text": "“To be down 20 on the road and come back to win by 20 just shows a lot about our team, our character, our resilience and not giving up,” Los Angeles coach Tyronn Lue said. “We could have easily gave in, winning Wednesday’s game and just giving in to this game. But our guys kept fighting, kept competing. That’s what you love to see.”"}
{"game_id": "0022100129", "chunk_id": "0022100129_004", "order": 4, "role": "body", "text": "Karl-Anthony Towns had 20 points and Anthony Edwards added 17 for the Timberwolves, who have lost five of six. Malik Beasley finished with 18 points off the bench for Minnesota, which shot 35.2% from the field and had 22 turnovers."}
{"game_id": "0022100129", "chunk_id": "0022100129_005", "order": 5, "role": "body", "text": "“The key was, man, we came out (in the) third quarter flat once again,” Edwards said. “We came out flat, but we’re struggling right now, man. It’s tough right now because we’re struggling. We’re playing good sometimes. We have spurts of playing good, then we play bad and don’t pick it up. It’s tough.”"}
{"game_id": "0022100129", "chunk_id": "0022100129_006", "order": 6, "role": "body", "text": "Minnesota was much more active defensively in its rematch with the Clippers, who in the teams’ first meeting shot a season-high 60.3% from the field and converted a season-high 21 3-pointers. Los Angeles shot 39.5% in the first half Friday and 41.4% for the game."}
{"game_id": "0022100129", "chunk_id": "0022100129_007", "order": 7, "role": "body", "text": "The Clippers went over five minutes without a field goal in the second quarter, and the Timberwolves used a 14-2 run capped by a pair of 3s by Beasley for a game-high, 20-point advantage."}
{"game_id": "0022100129", "chunk_id": "0022100129_008", "order": 8, "role": "body", "text": "Minnesota’s shooting waned in the third as the offense became stagnant and reliant on quick 3s early in possessions. The T’Wolves’ defense also slipped, opening the door for LA."}
{"game_id": "0022100129", "chunk_id": "0022100129_009", "order": 9, "role": "body", "text": "“We move the ball in practice,” Minnesota coach Chris Finch said. “We do all the right things in practice. When the lights come on and they start counting stats, things get sticky.”"}
{"game_id": "0022100129", "chunk_id": "0022100129_010", "order": 10, "role": "body", "text": "Finch added: “It goes back to the same thing, everyone just standing around wanting the ball. We’re just very ball-dominant right now.”"}
{"game_id": "0022100129", "chunk_id": "0022100129_011", "order": 11, "role": "body", "text": "Jackson was the catalyst as the Clippers used a 10-0 run in the third to take their first lead since scoring the first three points of the game."}
{"game_id": "0022100129", "chunk_id": "0022100129_012", "order": 12, "role": "body", "text": "Beasley again sparked the T’Wolves. He hit back-to-back 3s to bring Minnesota within 68-67. Edwards made a 3 to cap an 11-2 run that put the T’Wolves back in front, but LA followed with 15 points in a row."}
{"game_id": "0022100129", "chunk_id": "0022100129_013", "order": 13, "role": "body", "text": "Minnesota scored 27 points in the second half on 22% shooting. It was 5 of 23 (21.7%) from 3 in the second half."}
{"game_id": "0022100129", "chunk_id": "0022100129_014", "order": 14, "role": "body", "text": "“I think that can be our kind of identity this year, being a defensive team,” Zubac said. “We know without Kawhi (Leonard), it’s going to be tougher to win games. But if we can get stops and we can get out and run more, get open shots, we give ourselves a better chance to win.”"}
{"game_id": "0022100129", "chunk_id": "0022100129_016", "order": 16, "role": "body", "text": "Los Angeles held a decided advantage at the free-throw line, making 26 of 32 attempts. Minnesota, meanwhile, had seven opportunities and made five."}
{"game_id": "0022100129", "chunk_id": "0022100129_017", "order": 17, "role": "body", "text": "The T’Wolves' reliance on outside shooting contributed to a discrepancy in fouls. The Clippers were called for 16 fouls while Minnesota was whistled 33 times."}
{"game_id": "0022100129", "chunk_id": "0022100129_018", "order": 18, "role": "body", "text": "“Felt like every time they were going to the hoop they got a whistle,” Finch said. “We didn’t drive as much as they did. Seven free throws and two of them were in the last few minutes. Felt like we were going a little more than that, but we got to be stronger.”"}
{"game_id": "0022100129", "chunk_id": "0022100129_020", "order": 20, "role": "body", "text": "Clippers: Marcus Morris missed his sixth straight game with left knee injury maintenance. ... Los Angeles held a 61-42 advantage in rebounds. The 61 rebounds were a season high."}
{"game_id": "0022100129", "chunk_id": "0022100129_021", "order": 21, "role": "body", "text": "Timberwolves: D’Angelo Russell missed his second straight game with a right ankle sprain. ... All five losses for Minnesota during its 1-5 stretch have been at home. ... All of Beasley’s points came from beyond the arc as he shot 6 of 15 from 3. ... Towns has scored in double figures in 169 straight games, the longest streak by a center since Shaquille O’Neal had a 245-game streak from 1995-99, according to Stats Perform."}
{"game_id": "0022100129", "chunk_id": "0022100129_023", "order": 23, "role": "body", "text": "Clippers: Host Charlotte on Sunday."}
{"game_id": "0022100129", "chunk_id": "0022100129_024", "order": 24, "role": "body", "text": "Timberwolves: At Memphis on Monday."}
