{"game_id": "0022100862", "chunk_id": "0022100862_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Anfernee Simons’ hot streak has helped the Portland Trail Blazers thrive after reshaping their roster at the trade deadline."}
{"game_id": "0022100862", "chunk_id": "0022100862_002", "order": 2, "role": "body", "text": "Simons scored 31 points and the Trail Blazers capitalized on Giannis Antetokounmpo’s absence, beating the Milwaukee Bucks 122-107 on Monday night for their third straight victory."}
{"game_id": "0022100862", "chunk_id": "0022100862_003", "order": 3, "role": "body", "text": "Simons has averaged 30 points and shot 18 of 39 from 3-point range during Portland's winning streak, which also included victories over the Los Angeles Lakers  and New York Knicks."}
{"game_id": "0022100862", "chunk_id": "0022100862_004", "order": 4, "role": "body", "text": "“It’s a great feeling, just going out there and being the underdogs in each and every game and being able to come out with three wins against some good teams, at least on paper,” Simons said."}
{"game_id": "0022100862", "chunk_id": "0022100862_005", "order": 5, "role": "body", "text": "Antetokounmpo didn’t play for the Bucks due to a sore left ankle. Milwaukee coach Mike Budenholzer said before the game he believes it’s a short-term issue."}
{"game_id": "0022100862", "chunk_id": "0022100862_006", "order": 6, "role": "body", "text": "Josh Hart scored 27 points and Jusuf Nurkic had 23 points and 16 rebounds for the Trail Blazers. Justise Winslow had 13 points and 10 rebounds."}
{"game_id": "0022100862", "chunk_id": "0022100862_007", "order": 7, "role": "body", "text": "Portland outrebounded Milwaukee 58-43."}
{"game_id": "0022100862", "chunk_id": "0022100862_008", "order": 8, "role": "body", "text": "“I think wire to wire that was probably our best game,” Blazers coach Chauncey Billups said."}
{"game_id": "0022100862", "chunk_id": "0022100862_009", "order": 9, "role": "body", "text": "The teams met just nine days after the  Bucks’ 137-108 victory at Phoenix,  but much had changed with both squads since."}
{"game_id": "0022100862", "chunk_id": "0022100862_010", "order": 10, "role": "body", "text": "The Blazers traded  C.J. McCollum, Larry Nance Jr. and Tony Snell to the New Orleans Pelicans last week for a package that was headlined by Hart. The Bucks sent Donte DiVincenzo to Sacramento and moved Rodney Hood and Semi Ojeleye to the Los Angeles Clippers as part of a four-team trade  that brought them veteran center Serge Ibaka."}
{"game_id": "0022100862", "chunk_id": "0022100862_011", "order": 11, "role": "body", "text": "Ibaka made his Bucks debut Monday and filled Antetokounmpo’s spot in the starting lineup. Ibaka had the Bucks’ first six points, but didn’t score again in his 31-minute outing, though he did have seven rebounds."}
{"game_id": "0022100862", "chunk_id": "0022100862_012", "order": 12, "role": "body", "text": "Nurkic says the Bucks might have been expecting an easier game Monday because of the lopsided nature of their game in Portland."}
{"game_id": "0022100862", "chunk_id": "0022100862_013", "order": 13, "role": "body", "text": "“I think that happened the last couple of games, (opponents) thinking we're tanking or whatever the name is,” Nurkic said. “But a lot of our guys have something to prove.\""}
{"game_id": "0022100862", "chunk_id": "0022100862_014", "order": 14, "role": "body", "text": "Jrue Holiday led the Bucks with 23 points, but he also had seven turnovers. Bobby Portis and Jordan Nwora had 17 each. Khris Middleton shot 3 of 15 but had 16 points, 11 rebounds and nine assists."}
{"game_id": "0022100862", "chunk_id": "0022100862_015", "order": 15, "role": "body", "text": "After neither team led by more than six points for most of the first half, the Blazers broke the game open by scoring 14 straight points to grab a 65-48 advantage. Simons scored the last nine points in that run by making three straight 3-pointers over a span of 70 seconds."}
{"game_id": "0022100862", "chunk_id": "0022100862_016", "order": 16, "role": "body", "text": "Simons had 16 points in the last 7:36 of the second quarter. His surge helped the Blazers outscore the Bucks 34-14 over the last 8 ½ minutes of that period, turning a 40-37 deficit into a 71-54 halftime lead."}
{"game_id": "0022100862", "chunk_id": "0022100862_017", "order": 17, "role": "body", "text": "Portland got the lead up to 21 points in the third quarter. The Bucks got the margin down to eight on a few occasions early in the fourth period, but couldn’t get any closer."}
{"game_id": "0022100862", "chunk_id": "0022100862_018", "order": 18, "role": "body", "text": "“They were playing hard,\" Budenholzer said. “They played well. We've got to be a lot better.”"}
{"game_id": "0022100862", "chunk_id": "0022100862_020", "order": 20, "role": "body", "text": "Trail Blazers: Simons has scored at least 19 points in seven straight games. … Nurkic has seven consecutive double-doubles. ... The Blazers snapped a six-game skid in the series. Portland hadn’t beaten the Bucks since Nov. 6, 2018."}
{"game_id": "0022100862", "chunk_id": "0022100862_021", "order": 21, "role": "body", "text": "Bucks: Pat Connaughton underwent surgery Monday after breaking a bone in his right hand during a 131-107 loss at Phoenix. The Bucks say they expect him to miss four weeks. ... George Hill missed a seventh straight game with neck soreness. ... Lindell Wigginton had a career-high 11 points."}
{"game_id": "0022100862", "chunk_id": "0022100862_023", "order": 23, "role": "body", "text": "Trail Blazers: At Memphis on Wednesday. The Blazers are 2-1 against the Grizzlies this season, and haven’t faced them since Dec. 19."}
{"game_id": "0022100862", "chunk_id": "0022100862_024", "order": 24, "role": "body", "text": "Bucks: Host the Indiana Pacers on Tuesday. The Bucks have won their last seven matchups with the Pacers and are 3-0 against them this season."}
