{"game_id": "0022100789", "chunk_id": "0022100789_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Chicago Bulls center Nikola Vucevic perfected Friday's simple game plan."}
{"game_id": "0022100789", "chunk_id": "0022100789_002", "order": 2, "role": "body", "text": "With the undersized and short-handed Indiana Pacers missing their top four post players, coach Billy Donovan asked him to dominate the middle."}
{"game_id": "0022100789", "chunk_id": "0022100789_003", "order": 3, "role": "body", "text": "Vucevic came up big with a season-high 36 points and 17 rebounds, to which DeMar DeRozan added 31 points to give the Bulls a 122-115 win over the Indiana Pacers."}
{"game_id": "0022100789", "chunk_id": "0022100789_004", "order": 4, "role": "body", "text": "“It's like people think he has this huge size advantage but I'm not really used to playing against smaller guys like that,\" said Vucevic, the 6-foot-11 veteran who only faced one defender taller than 6-7. “It was a lot of seals in the post so a lot of my points were easy. It's just a different look and different for me.\""}
{"game_id": "0022100789", "chunk_id": "0022100789_005", "order": 5, "role": "body", "text": "He looked poised throughout the night, posting his second straight 30-point game while helping the Eastern Conference's top team win for the fourth time in six games despite playing without injured All-Star Zach LaVine (back spasms)."}
{"game_id": "0022100789", "chunk_id": "0022100789_006", "order": 6, "role": "body", "text": "Vucevic went 16 of 21 from the field, and had four assists and three blocks. That wasn't all."}
{"game_id": "0022100789", "chunk_id": "0022100789_007", "order": 7, "role": "body", "text": "“I was really, really impressed with what he did at the rim tonight,\" Donovan said. “He had a couple of really good blocks and he made some guys miss some shots as well.\""}
{"game_id": "0022100789", "chunk_id": "0022100789_008", "order": 8, "role": "body", "text": "The result: Indiana lost its second straight despite getting a season-high 42 points from Caris LeVert, who also had eight assists and five rebounds. The recently signed Terry Taylor finished with 21 points, 14 rebounds and five assists."}
{"game_id": "0022100789", "chunk_id": "0022100789_009", "order": 9, "role": "body", "text": "Vucevic wasted no time making his presence felt. He was already nearing a double-double midway through a first quarter, when the Bulls scored 40 points and led by double digits."}
{"game_id": "0022100789", "chunk_id": "0022100789_010", "order": 10, "role": "body", "text": "But the Pacers closed to 65-62 at halftime and finally took an 86-85 lead on Lance Stephenson's shot-clock beating 3-pointer with 2:57 to go in the third quarter."}
{"game_id": "0022100789", "chunk_id": "0022100789_012", "order": 12, "role": "body", "text": "DeRozan answered with two free throws and a 14-footer, Vucevic drove the lane for a dunk and Malcolm Hill's basket closed out an 8-2 run that helped Chicago retake a 93-90 lead."}
{"game_id": "0022100789", "chunk_id": "0022100789_013", "order": 13, "role": "body", "text": "The Bulls finally seized control with a 10-0 run midway through the fourth, capped by Ayo Dosunmu's 3 with 4:52 left to make it 110-98 and the Pacers never got another chance to tie the score or take the lead."}
{"game_id": "0022100789", "chunk_id": "0022100789_014", "order": 14, "role": "body", "text": "“It’s a disappointing result but there’s plenty of good things going on,” coach Rick Carlisle said. “We’ve just got to stay in the fight while we’re undermanned.”"}
{"game_id": "0022100789", "chunk_id": "0022100789_016", "order": 16, "role": "body", "text": "Bulls: Vucevic has 29 double-doubles this season. ... DeRozan has scored at least 20 points in 39 of the 47 games he's played this season. He also had five rebounds and seven assists on Friday. ... Javonte Green scored 16 points while Dosunmu finished with 15. ... Chicago won the final three in this season's four-game series and had a 43-37 rebounding advantage on Friday."}
{"game_id": "0022100789", "chunk_id": "0022100789_017", "order": 17, "role": "body", "text": "Pacers: LeVert produced one of the most dominant performances in his career in his 299th start. ... Dwayne Washington Jr. had 17 points and Chris Duarte added 12. ... Reggie Perry played 10 minutes less than 24 hours after signing with the Pacers and arriving in Indianapolis. ... Goga Bitadze, Malcolm Brogdon, Isaiah Jackson, T.J. McConnell, Myles Turner and T.J. Warren were all out with injuries. Domantas Sabonis is in the health and safety protocols."}
{"game_id": "0022100789", "chunk_id": "0022100789_019", "order": 19, "role": "body", "text": "Before the game, Carlisle honored Hall of Fame coach Bill Fitch, who died Wednesday at age 89."}
{"game_id": "0022100789", "chunk_id": "0022100789_020", "order": 20, "role": "body", "text": "“He cut me from my last NBA team and offered me my first coaching job — in the same phone call,\" Carlisle said. “Anytime someone sees you and believes you and gives you that first opportunity, that's very special.\""}
{"game_id": "0022100789", "chunk_id": "0022100789_021", "order": 21, "role": "body", "text": "Fitch did more than give Carlisle a start. He was Larry Bird's first coach in Boston, Phil Jackson's coach at North Dakota and, Carlisle recalled, Hall of Fame pitcher Bob Gibson's coach in baseball and basketball at Creighton."}
{"game_id": "0022100789", "chunk_id": "0022100789_023", "order": 23, "role": "body", "text": "Bulls: Host Philadelphia on Sunday, seeking its first win against the 76ers in three games."}
{"game_id": "0022100789", "chunk_id": "0022100789_024", "order": 24, "role": "body", "text": "Pacers: Visit Cleveland on Sunday."}
