{"game_id": "0022100524", "chunk_id": "0022100524_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Chimezie Metu made a corner 3-pointer at the buzzer to give the Sacramento Kings a 95-94 victory over the Dallas Mavericks on Wednesday night in the opener of a two-game set between the teams."}
{"game_id": "0022100524", "chunk_id": "0022100524_002", "order": 2, "role": "body", "text": "Dallas led 94-92 with 33.2 seconds remaining after Jalen Brunson’s short jumper and two free throws from Kristaps Porzingis. After Harrison Barnes missed a layup for Sacramento, and the Mavericks were called for a 24-second violation, Kings point guard De’Aaron Fox drove down the lane and passed to Metu in the right corner in front of the Mavericks' bench."}
{"game_id": "0022100524", "chunk_id": "0022100524_003", "order": 3, "role": "body", "text": "The crowd erupted when his shot dropped through the net."}
{"game_id": "0022100524", "chunk_id": "0022100524_004", "order": 4, "role": "body", "text": "“That was probably the best part, all the guys in your ear and everything. Block all that out and let muscle memory take over,” said Metu, who went to the Kings' practice court after the game to get in extra work. “It was a great moment. Since I’ve been in the league, for sure one of the best moments I’ve had. For us to grind that one out, it felt good.”"}
{"game_id": "0022100524", "chunk_id": "0022100524_005", "order": 5, "role": "body", "text": "Metu’s big moment came after Fox’s last-second decision to dish the ball away after he initially thought about trying to dunk it."}
{"game_id": "0022100524", "chunk_id": "0022100524_006", "order": 6, "role": "body", "text": "“Mezzie made a big shot out of the corner but it was Fox’s assist that really made the play,” Kings interim coach Alvin Gentry said. “He turned the corner and went so quickly. He said, ‘I was either gonna dunk it and try to get to the line or if I saw them pull in so far I was going to try to hit the corner guy.'\""}
{"game_id": "0022100524", "chunk_id": "0022100524_007", "order": 7, "role": "body", "text": "Fox had 16 points and five assists. Barnes and Davion Mitchell scored 14 apiece, and Tyrese Haliburton added 12 points and 10 assists."}
{"game_id": "0022100524", "chunk_id": "0022100524_008", "order": 8, "role": "body", "text": "Brunson scored 25 for Dallas. Porzingis had 24 points and seven rebounds. The Mavericks have lost 14 of 21 to the Kings."}
{"game_id": "0022100524", "chunk_id": "0022100524_009", "order": 9, "role": "body", "text": "“They didn’t have an opportunity to take a timeout, then Fox makes a heck of a play,” Mavericks coach Jason Kidd said. “It’s tough. Unfortunately if we give up a layup the game is tied, we go into overtime. But (Dwight Powell) went to help and they made a shot.”"}
{"game_id": "0022100524", "chunk_id": "0022100524_010", "order": 10, "role": "body", "text": "The teams meet again Friday in Sacramento."}
{"game_id": "0022100524", "chunk_id": "0022100524_011", "order": 11, "role": "body", "text": "“It’s a tough, tough, tough loss,” Porzingis said. “This one’s on us, the players. I could have played much better. Not our best performance and that’s on us. We have to take this feeling that (stinks) and take it and use it as fuel for the next game.”"}
{"game_id": "0022100524", "chunk_id": "0022100524_012", "order": 12, "role": "body", "text": "Marvin Bagley III, the No. 2 overall draft pick in 2018 making his second consecutive start, had eight straight points in the second quarter for Sacramento. Mitchell — fresh out of the health and safety protocols — made a 3-pointer to put the Kings up 55-43."}
{"game_id": "0022100524", "chunk_id": "0022100524_013", "order": 13, "role": "body", "text": "Dallas trailed by 13 early in the third, then went on a 20-6 run."}
{"game_id": "0022100524", "chunk_id": "0022100524_015", "order": 15, "role": "body", "text": "Isaiah Thomas might have been wearing a Mavericks jersey but the crowd at Golden 1 Center did its best to make him feel at home. Thomas, who signed a 10-day contract with Dallas on Wednesday under the COVID-19-related hardship allowance, spent his first three NBA seasons in Sacramento after being the final pick of the 2011 draft and was greeted with a rousing ovation when he entered the game in the first quarter."}
{"game_id": "0022100524", "chunk_id": "0022100524_016", "order": 16, "role": "body", "text": "Fans didn’t jeer Thomas when the 32-year-old shot an airball on his first shot of the night, and applauded when he connected on an 18-footer. The two-time All-Star, who played four games with the Lakers this month, had six points and four assists in 13 minutes."}
{"game_id": "0022100524", "chunk_id": "0022100524_017", "order": 17, "role": "body", "text": "“These players coming in on these hardship deals is a tough thing to do, especially what he did today, to fly in and go straight to work,” Brunson said. “This fan base here, they love him. He’s one of those players, wherever he goes he’s going to get a lot of love.”"}
{"game_id": "0022100524", "chunk_id": "0022100524_019", "order": 19, "role": "body", "text": "Mavericks: Brandon Knight, signed to a 10-day hardship contract on Dec. 23, and Boban Marjanović were entered into the NBA health and safety protocol. The two joined a crowded list that includes Trey Burke, Luka Doncic, Tim Hardaway Jr., Maxi Kleber and JaQuori McLaughlin."}
{"game_id": "0022100524", "chunk_id": "0022100524_020", "order": 20, "role": "body", "text": "Kings: Before the game, Mitchell, Alex Len and Louis King were cleared to return from the health and safety protocol. Neemias Queta is the lone Kings player in the protocol."}
