{"game_id": "0022100613", "chunk_id": "0022100613_001", "order": 1, "role": "lead", "text": "TORONTO -- — Devin Booker scored 16 points, including the go-ahead basket with 1:02 remaining, and Chris Paul had 15 points and 12 assists as the Phoenix Suns beat Toronto 99-95 on Tuesday night to snap the Raptors’ longest winning streak of the season at six games."}
{"game_id": "0022100613", "chunk_id": "0022100613_002", "order": 2, "role": "body", "text": "Jae Crowder matched his season high with 19 points, Deandre Ayton had 16 and Mikal Bridges added 12 as the Suns improved to 31-9, matching the franchise’s best record through 40 games."}
{"game_id": "0022100613", "chunk_id": "0022100613_003", "order": 3, "role": "body", "text": "“That’s one of those games you’ve got to put your hard hat on,” Paul said."}
{"game_id": "0022100613", "chunk_id": "0022100613_004", "order": 4, "role": "body", "text": "Phoenix won despite allowing Toronto 15 more field goal attempts, and letting the Raptors grab a season-high 22 offensive rebounds. The Suns also committed 20 turnovers, leading to 18 points for Toronto."}
{"game_id": "0022100613", "chunk_id": "0022100613_005", "order": 5, "role": "body", "text": "“When you have that many turnovers and you give up that many extra possessions, you’d better do something well,” Suns coach Monty Williams said. “I thought our half-court defense was sound.”"}
{"game_id": "0022100613", "chunk_id": "0022100613_006", "order": 6, "role": "body", "text": "Booker shot 4 for 13, including 2 of 7 from 3-point range, and committed three turnovers."}
{"game_id": "0022100613", "chunk_id": "0022100613_007", "order": 7, "role": "body", "text": "“It was a fight all night,” he said. “They beat us up a little bit, but down the stretch we picked it up a little bit and did what we had to do.”"}
{"game_id": "0022100613", "chunk_id": "0022100613_008", "order": 8, "role": "body", "text": "OG Anunoby scored 25 points, Pascal Siakam had 22 and Fred VanVleet added 21 for the Raptors, who lost for the first time since Dec. 28 against Philadelphia."}
{"game_id": "0022100613", "chunk_id": "0022100613_009", "order": 9, "role": "body", "text": "“Give them credit,” VanVleet said. “They’re one of the best teams in the league for a reason. They closed us out there at the end, but I thought we had a good fight.”"}
{"game_id": "0022100613", "chunk_id": "0022100613_010", "order": 10, "role": "body", "text": "Chris Boucher had 13 points and 16 rebounds for the Raptors, who played without injured starters Scottie Barnes and Gary Trent Jr."}
{"game_id": "0022100613", "chunk_id": "0022100613_011", "order": 11, "role": "body", "text": "Trent missed his second straight game because of a sore left ankle, while Barnes sat out with a sore right knee."}
{"game_id": "0022100613", "chunk_id": "0022100613_012", "order": 12, "role": "body", "text": "“We didn’t have Scottie, we didn’t have Gary — those are two big pieces for us — but we hung in there,” Boucher said. “We didn’t shoot the ball well. There’s a lot of things that didn’t go our way, but we still figured out a way to stay in the game.”"}
{"game_id": "0022100613", "chunk_id": "0022100613_013", "order": 13, "role": "body", "text": "The Raptors led 83-81 after Boucher made a pair of free throws with 6:19 left, but Crowder and Bridges each hit a 3-pointer before Ayton capped an 8-0 spurt as Phoenix opened an 89-83 lead with 4:13 to go, its biggest of the game."}
{"game_id": "0022100613", "chunk_id": "0022100613_014", "order": 14, "role": "body", "text": "Siakam stopped the run with a basket and Anunoby added a 3 to make it 89-88 with 2:36 to play."}
{"game_id": "0022100613", "chunk_id": "0022100613_015", "order": 15, "role": "body", "text": "Booker fouled Anunoby as they scrambled after a loose ball with 1:41 left, and the Toronto forward made both to put the Raptors up 90-89."}
{"game_id": "0022100613", "chunk_id": "0022100613_016", "order": 16, "role": "body", "text": "After three missed 3-pointers by the Suns, Booker hit a go-ahead jumper with 62 seconds left and, after Siakam missed, Paul’s pull-up jumper made it 93-90 with 32 seconds remaining."}
{"game_id": "0022100613", "chunk_id": "0022100613_017", "order": 17, "role": "body", "text": "Anunoby cut it to one with a driving basket, but Booker restored the three-point cushion with a pair of free throws."}
{"game_id": "0022100613", "chunk_id": "0022100613_018", "order": 18, "role": "body", "text": "Toronto’s Khem Birch and Paul each converted two free throws and the Suns sent VanVleet to the line with four seconds left. He made the first and missed the second, but Phoenix’s Jalen Smith grabbed the rebound and Ayton pushed the lead to four with a pair of free throws."}
{"game_id": "0022100613", "chunk_id": "0022100613_019", "order": 19, "role": "body", "text": "VanVleet scored 10 points in the first as Toronto led 31-23 after one, but Crowder answered with 13 points in the second as the Suns cut the deficit to 48-46 at halftime."}
{"game_id": "0022100613", "chunk_id": "0022100613_020", "order": 20, "role": "body", "text": "“Jae’s shot-making in the second quarter saved us, kind of kept the air in the tires a bit,” Williams said."}
{"game_id": "0022100613", "chunk_id": "0022100613_021", "order": 21, "role": "body", "text": "Siakam hit a tiebreaking jumper with 8.8 seconds left in the third to give the Raptors a 71-69 lead heading to the fourth."}
{"game_id": "0022100613", "chunk_id": "0022100613_023", "order": 23, "role": "body", "text": "An angry Booker asked the officiating crew to relocate the Raptor mascot between free throws late in the fourth quarter and the referees obliged, moving the red dinosaur from his spot behind the basket to the corner of the court."}
{"game_id": "0022100613", "chunk_id": "0022100613_024", "order": 24, "role": "body", "text": "“We hashed it out, we homies now,” Booker said afterward of his run-in with the Raptor."}
{"game_id": "0022100613", "chunk_id": "0022100613_026", "order": 26, "role": "body", "text": "Suns: F Cam Johnson (left ankle) was not available after being injured in Saturday’s loss to Miami. … G Landry Shamet returned after missing the past three games while in the health and safety protocols. … F Justin Jackson (personal) did not travel to Toronto. Williams said Jackson could rejoin the team Friday in Indiana. … F Ish Wainwright (health and safety protocols) was not available. … Phoenix signed C Bismack Biyombo for the remainder of the season."}
{"game_id": "0022100613", "chunk_id": "0022100613_027", "order": 27, "role": "body", "text": "Raptors: Boucher matched a career high with nine offensive rebounds. … Siakam had four assists in the first quarter. He finished with seven. … Yuta Watanabe missed the previous four games after entering the health and safety protocols."}
{"game_id": "0022100613", "chunk_id": "0022100613_029", "order": 29, "role": "body", "text": "Suns: Visit the Indiana Pacers on Friday."}
{"game_id": "0022100613", "chunk_id": "0022100613_030", "order": 30, "role": "body", "text": "Raptors: Begin a five-game road trip at Detroit on Friday."}
