{"game_id": "0022100675", "chunk_id": "0022100675_001", "order": 1, "role": "lead", "text": "DALLAS -- — Luka Doncic scored a season-high 41 points, including a clutch 3-pointer with 1:01 to play, and tied his season best with 14 rebounds as the surging Dallas Mavericks held off the Toronto Raptors 102-98 on Wednesday night."}
{"game_id": "0022100675", "chunk_id": "0022100675_002", "order": 2, "role": "body", "text": "Kristaps Porzingis had 18 points and seven rebounds to help Dallas win its fourth straight and 10th in 11 games. Tim Hardaway Jr. scored 16 off the bench for the Mavericks, who host NBA-best Phoenix on Thursday."}
{"game_id": "0022100675", "chunk_id": "0022100675_003", "order": 3, "role": "body", "text": "The Mavericks began this stretch ninth in the Western Conference. They’re now fifth, three games behind fourth-place Utah."}
{"game_id": "0022100675", "chunk_id": "0022100675_004", "order": 4, "role": "body", "text": "Doncic, who had the 10th 40-point regular-season game of his four-year career, was pleased with how the Mavericks shared the ball but gave most of the credit for the recent streak to his team's effort at the other end of the floor."}
{"game_id": "0022100675", "chunk_id": "0022100675_005", "order": 5, "role": "body", "text": "“We’re playing team defense; that’s where we’re winning,” he said."}
{"game_id": "0022100675", "chunk_id": "0022100675_006", "order": 6, "role": "body", "text": "Dallas outshot Toronto 48.7% to 38.5% after going into play ranked third in the NBA with 102.7 points allowed per game."}
{"game_id": "0022100675", "chunk_id": "0022100675_007", "order": 7, "role": "body", "text": "Pascal Siakam scored 20 points, OG Anunoby had 19 and Fred VanVleet added 18 points and 12 assists for the Raptors, who have lost four of five following a six-game winning streak that marked their longest of the season."}
{"game_id": "0022100675", "chunk_id": "0022100675_008", "order": 8, "role": "body", "text": "Toronto had six double-figure scorers while using only seven players, with starters Gary Trent Jr. and Kham Birch sidelined by injuries."}
{"game_id": "0022100675", "chunk_id": "0022100675_009", "order": 9, "role": "body", "text": "VanVleet’s 3-pointer gave Toronto a 96-95 lead with 1:55 to go, but Doncic put Dallas back ahead with a layup 10 seconds later. After the Mavericks regained possession, Doncic hit a 27-footer behind the arc to beat the shot clock and give the Mavericks a 100-96 lead."}
{"game_id": "0022100675", "chunk_id": "0022100675_010", "order": 10, "role": "body", "text": "“It’s an amazing feeling,” Doncic said."}
{"game_id": "0022100675", "chunk_id": "0022100675_011", "order": 11, "role": "body", "text": "The Raptors were shooting for the lead seconds later at 100-98. Chris Boucher’s 26-footer bounced off the rim, Dorian Finney-Smith grabbed a defensive rebound and Porzingis added two clinching free throws with 5.6 seconds left."}
{"game_id": "0022100675", "chunk_id": "0022100675_012", "order": 12, "role": "body", "text": "VanVleet, leading Toronto in scoring at 21.9 points per game coming in, was 4 for 20 from the floor and 3 for 15 from long distance."}
{"game_id": "0022100675", "chunk_id": "0022100675_013", "order": 13, "role": "body", "text": "“If I make a couple more shots, we probably sneak out with a win,” he said."}
{"game_id": "0022100675", "chunk_id": "0022100675_014", "order": 14, "role": "body", "text": "Doncic was 13 for 24 from the floor, including 4 of 10 on 3-pointers after going 4 for 17 and missing all six attempts behind the arc in Dallas’ 104-102 win over Oklahoma City on Monday."}
{"game_id": "0022100675", "chunk_id": "0022100675_015", "order": 15, "role": "body", "text": "“He did a great job from start to finish,” Mavericks coach Jason Kidd said."}
{"game_id": "0022100675", "chunk_id": "0022100675_017", "order": 17, "role": "body", "text": "Raptors: VanVleet went into play leading the NBA with an average of 38 minutes per game. He played 42. … Boucher, one of two reserves to play, had 15 points and 12 rebounds. … Trent missed his sixth consecutive game with a swollen ankle and remains day-to-day."}
{"game_id": "0022100675", "chunk_id": "0022100675_018", "order": 18, "role": "body", "text": "Mavericks: Have won six straight home games, their longest streak since November and December 2018. … Doncic’s 22 first-half points matched his most in a half this season. He clinched his eighth straight 20-point game with 4:50 to play in the second period. … Reserve forward Sterling Brown sat out with a sore foot."}
{"game_id": "0022100675", "chunk_id": "0022100675_020", "order": 20, "role": "body", "text": "In the past nine days, the Raptors have beaten defending champion Milwaukee and lost to Phoenix by four points, to Miami by five and now to Dallas by four."}
{"game_id": "0022100675", "chunk_id": "0022100675_021", "order": 21, "role": "body", "text": "“This has been an incredible stretch of games here against really good teams, three of the four if not four of the four with championship aspirations,” coach Nick Nurse said. “It’s been an incredibly valuable experience.”"}
{"game_id": "0022100675", "chunk_id": "0022100675_023", "order": 23, "role": "body", "text": "Raptors: End a five-game road trip Wednesday at Washington, which leads Toronto by a half-game for eighth place in the East."}
{"game_id": "0022100675", "chunk_id": "0022100675_024", "order": 24, "role": "body", "text": "Mavericks: Thursday’s game will be the first of three straight against top teams in the West (followed by No. 3 Memphis at home on Sunday and at No. 2 Golden State on Tuesday)."}
