{"game_id": "0022100020", "chunk_id": "0022100020_001", "order": 1, "role": "lead", "text": "BOSTON -- — Raptors coach Nick Nurse didn't think Scottie Barnes played that badly in his first NBA game."}
{"game_id": "0022100020", "chunk_id": "0022100020_002", "order": 2, "role": "body", "text": "Just in case, though, he had a chat with the rookie."}
{"game_id": "0022100020", "chunk_id": "0022100020_003", "order": 3, "role": "body", "text": "“I did talk to him a couple of times in between the games. But I just said ‘You did fine, man. Just keep doing what you’re doing,’” Nurse said Friday night after Barnes broke out with 25 points and 13 rebounds in a 115-83 victory over the Boston Celtics."}
{"game_id": "0022100020", "chunk_id": "0022100020_004", "order": 4, "role": "body", "text": "“He looked like he had a much better tempo today,” Nurse said. \"He played with more composure coming up the floor. He waited for his moment and took it to the rim, or if they played off him he took some jump shots. He played at his speed tonight maybe."}
{"game_id": "0022100020", "chunk_id": "0022100020_005", "order": 5, "role": "body", "text": "The No. 4 overall pick in the NBA draft, Barnes had five turnovers and four fouls in his first 20 NBA minutes in Toronto's season-opening loss to the Wizards on Wednesday. Against Boston, he showed no such jitters."}
{"game_id": "0022100020", "chunk_id": "0022100020_006", "order": 6, "role": "body", "text": "\"I just play hard, and the team gives me confidence that helped get me going,” he said. “Me playing hard throughout the the game just takes things off my mind, and it just helps me play more free."}
{"game_id": "0022100020", "chunk_id": "0022100020_007", "order": 7, "role": "body", "text": "Gary Trent Jr. scored 12 of his 20 points in the third quarter, when the Raptors pulled turned a two-point lead into a blowout and spoiled the home debut of new Celtics coach Ime Udoka."}
{"game_id": "0022100020", "chunk_id": "0022100020_008", "order": 8, "role": "body", "text": "The team, which lost in the first round of the playoffs after reaching the Eastern Conference finals three of the previous four years, was booed off the court at halftime and throughout the second half."}
{"game_id": "0022100020", "chunk_id": "0022100020_010", "order": 10, "role": "body", "text": "“The one thing you can’t stand as a coach is to get punked out there,\" he said. \"They basically came out and punked us, outplayed us.”"}
{"game_id": "0022100020", "chunk_id": "0022100020_011", "order": 11, "role": "body", "text": "Precious Achiuwa had 15 points and 15 rebounds, and Fred VanVleet had 11 points and nine assists for Toronto."}
{"game_id": "0022100020", "chunk_id": "0022100020_012", "order": 12, "role": "body", "text": "Jayson Tatum scored 18 points and Al Horford returned for a second stint with the Celtics to add 11 points and 11 rebounds. Jaylen Brown, who scored a career-high 46 points in a season-opening, double-overtime loss to New York on Wednesday night, had nine points on 3-for-13 shooting."}
{"game_id": "0022100020", "chunk_id": "0022100020_013", "order": 13, "role": "body", "text": "Toronto led 59-51 when Tatum was whistled for a technical foul, and the free throw made it a 10-point game. The call seemed to energize the Celtics, who scored the next three baskets to cut the deficit to two points."}
{"game_id": "0022100020", "chunk_id": "0022100020_014", "order": 14, "role": "body", "text": "But they failed to score the next five trips down the floor -- never getting a shot off on three of them. The Raptors ran off 10 straight points — six of them by Trent — and 20 of the next 23 to take an 80-61 lead."}
{"game_id": "0022100020", "chunk_id": "0022100020_015", "order": 15, "role": "body", "text": "While Brown was notching a personal best in the opener, Tatum had an off-night shooting making just 7 of 30 shots — 2 of 15 from 3-point range. Tatum was 8 of 14 against Toronto, but Brown missed all seven 3-point attempts."}
{"game_id": "0022100020", "chunk_id": "0022100020_016", "order": 16, "role": "body", "text": "Pacscal Siakam has missed both games for Toronto as he returns from offseason left shoulder surgery."}
{"game_id": "0022100020", "chunk_id": "0022100020_018", "order": 18, "role": "body", "text": "Udoka made his home debut as the 18th coach in franchise history. Horford returned after missing the opener following a positive COVID-19 test. Dennis Schröder played 23 minutes and had four points, four rebounds and four assists."}
{"game_id": "0022100020", "chunk_id": "0022100020_020", "order": 20, "role": "body", "text": "Marcus Smart thanked the crowd before the game. The Celtics also introduced the former players in attendance, including recently inducted Hall of Famer Paul Pierce and recently retired team president Danny Ainge."}
{"game_id": "0022100020", "chunk_id": "0022100020_021", "order": 21, "role": "body", "text": "It was the first full-attendance regular-season game at the TD Garden in 593 days since March 8, 2020, before the NBA’s pandemic shutdown. But many of them had left by the time it was over."}
{"game_id": "0022100020", "chunk_id": "0022100020_022", "order": 22, "role": "body", "text": "Those that remained were booing."}
{"game_id": "0022100020", "chunk_id": "0022100020_023", "order": 23, "role": "body", "text": "“The people in Boston know basketball,\" guard Josh Richardson said. \"They were being honest.”"}
{"game_id": "0022100020", "chunk_id": "0022100020_025", "order": 25, "role": "body", "text": "Raptors: Host Dallas on Saturday."}
{"game_id": "0022100020", "chunk_id": "0022100020_026", "order": 26, "role": "body", "text": "Celtics: Visit Houston on Sunday."}
