{"game_id": "0022100453", "chunk_id": "0022100453_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Denver Nuggets coach Michael Malone sensed his team would play down to a Brooklyn Nets team that was missing three of their best players, including All-Star guard James Harden."}
{"game_id": "0022100453", "chunk_id": "0022100453_002", "order": 2, "role": "body", "text": "The Nuggets needed Austin Rivers, who scored 22 of his 25 points in the second half, and Nikola Jokic's 26 points, 10 rebounds and eight assists to beat the Nets 124-118 on Wednesday night."}
{"game_id": "0022100453", "chunk_id": "0022100453_003", "order": 3, "role": "body", "text": "Denver jumped out to an early 17-8 lead before the Nets shook off their early struggles to trail by one at the end of the first quarter."}
{"game_id": "0022100453", "chunk_id": "0022100453_004", "order": 4, "role": "body", "text": "“We haven’t played maybe perfect basketball, but we’re winning games,” Malone said. “Ultimately that’s all that matters. A lot of the NBA is like winning the games you’re supposed to and that’s no disrespect to a team like Detroit or these Brooklyn Nets — obviously all the guys they have out.”"}
{"game_id": "0022100453", "chunk_id": "0022100453_005", "order": 5, "role": "body", "text": "Aside from Harden, who had the night off to rest an ailing left hamstring after playing 38 minutes in Tuesday’s loss against the Los Angeles Lakers, the Nets are without Kevin Durant (sprained left knee ligament) and Kyrie Irving (vaccination status)."}
{"game_id": "0022100453", "chunk_id": "0022100453_006", "order": 6, "role": "body", "text": "Rookie Cam Thomas scored 25 points and Patty Mills added 21 for Brooklyn, who have lost three consecutive games."}
{"game_id": "0022100453", "chunk_id": "0022100453_007", "order": 7, "role": "body", "text": "“Just not enough against a very good team,” Nets coach Steve Nash said. “We played well for long stretches, but probably didn’t take care of enough details to close it out.”"}
{"game_id": "0022100453", "chunk_id": "0022100453_008", "order": 8, "role": "body", "text": "The Nets are now 6-10 in January after going 8-3 in December."}
{"game_id": "0022100453", "chunk_id": "0022100453_009", "order": 9, "role": "body", "text": "Denver also got 21 points and 10 rebounds from Will Barton and 13 points off the bench from DeMarcus Cousins to win its last three games and eight of 13."}
{"game_id": "0022100453", "chunk_id": "0022100453_010", "order": 10, "role": "body", "text": "Brooklyn was up 65-54 at the half, and Denver cut it to 77-70 with 7:39 left in the third period."}
{"game_id": "0022100453", "chunk_id": "0022100453_011", "order": 11, "role": "body", "text": "The Nuggets then outscored the Nets 22-7 during a span of six minutes in which Rivers hit three 3-pointers, the last one putting Denver ahead 92-84."}
{"game_id": "0022100453", "chunk_id": "0022100453_012", "order": 12, "role": "body", "text": "Rivers connected on three more 3-pointers in the fourth quarter."}
{"game_id": "0022100453", "chunk_id": "0022100453_013", "order": 13, "role": "body", "text": "“I’m a scorer. I can score the ball,” said Rivers, who shot 8 for 11 from the field, including 7 for 10 from long range. “I really feel like I can do this consistently. But obviously I have my role here. So, I try to come out each and every night and be aggressive and you just look for those opportunities.”"}
{"game_id": "0022100453", "chunk_id": "0022100453_014", "order": 14, "role": "body", "text": "Brooklyn had a chance to get within two points with 3:22 remaining in regulation. LaMarcus Aldridge, who scored 18 points, missed two free throws."}
{"game_id": "0022100453", "chunk_id": "0022100453_015", "order": 15, "role": "body", "text": "Aaron Gordon then answered with a stepback baseline jumper to make it 118-113 before James Johnson made a free throw to cut Denver’s lead 118-114 with 1:52 left in the game."}
{"game_id": "0022100453", "chunk_id": "0022100453_016", "order": 16, "role": "body", "text": "Brooklyn’s offense sputtered down the stretch, missing five straight shots while Denver went on a 6-0 run, capped by Monte Morris’ layup with 45 seconds to play to extend the lead 124-114."}
{"game_id": "0022100453", "chunk_id": "0022100453_018", "order": 18, "role": "body", "text": "Nuggets: Barton was back in the starting lineup after missing Tuesday night’s win at Detroit because of a right hamstring strain. ... Cousins picked up two technical fouls. The first came with 42 seconds left in the third quarter, and he was ejected after he picked up the second with 11:17 left in the final period."}
{"game_id": "0022100453", "chunk_id": "0022100453_019", "order": 19, "role": "body", "text": "Nets: Rookie center Day’ron Sharpe was did not play due to an illness that was not related to COVID-19."}
{"game_id": "0022100453", "chunk_id": "0022100453_021", "order": 21, "role": "body", "text": "Nets coach Steve Nash thinks Harden’s frustration is about the Nets struggling since the team's COVID-19 outbreak in December — not because he is unhappy in Brooklyn."}
{"game_id": "0022100453", "chunk_id": "0022100453_022", "order": 22, "role": "body", "text": "“Ever since the COVID return, it’s been very average basketball,” Nash said. “So, we have higher expectations and it’s frustrating, but I think James is happy here for sure.”"}
{"game_id": "0022100453", "chunk_id": "0022100453_024", "order": 24, "role": "body", "text": "Denver’s improved to 2-0 on its current six-game road trip, their second-longest of the season. The Nuggets played seven straight away from home between Nov. 29 and Dec. 11, going 4-3."}
{"game_id": "0022100453", "chunk_id": "0022100453_026", "order": 26, "role": "body", "text": "Nuggets: At New Orleans n Friday night. The Nuggets have won three straight over the Pelicans."}
{"game_id": "0022100453", "chunk_id": "0022100453_027", "order": 27, "role": "body", "text": "Nets: Starts a five-game, Western Conference trip Saturday night at Golden State. The Warriors routed the Nets 117-99 on Nov. 16."}
