{"game_id": "0022100459", "chunk_id": "0022100459_001", "order": 1, "role": "lead", "text": "CHICAGO -- — DeMar DeRozan scored 26 points and the Chicago Bulls beat the Houston Rockets 133-118 on Monday night."}
{"game_id": "0022100459", "chunk_id": "0022100459_002", "order": 2, "role": "body", "text": "DeRozan, who scored 38 points in Sunday’s win over the Lakers after missing three games due to the NBA’s COVID-19 protocols, received help from five teammates who scored in double figures."}
{"game_id": "0022100459", "chunk_id": "0022100459_003", "order": 3, "role": "body", "text": "The Bulls never trailed and led by 25 during the first half. They have won two consecutive games and six of their last eight."}
{"game_id": "0022100459", "chunk_id": "0022100459_004", "order": 4, "role": "body", "text": "Christian Wood had 23 points and 11 rebounds, but the Rockets lost for the fifth time in seven games. Jae’Sean Tate added 16 points."}
{"game_id": "0022100459", "chunk_id": "0022100459_005", "order": 5, "role": "body", "text": "Bulls guard Alex Caruso sprained his left foot with 5:56 remaining in the first quarter, went to the locker room and didn’t return."}
{"game_id": "0022100459", "chunk_id": "0022100459_006", "order": 6, "role": "body", "text": "After the game, Bulls coach Billy Donovan wasn’t sure about the severity of Caruso’s injury."}
{"game_id": "0022100459", "chunk_id": "0022100459_007", "order": 7, "role": "body", "text": "Donovan was mindful of the minutes logged by several starters in Sunday’s win over the Lakers following a seven-day layoff caused by the NBA’s coronavirus protocols. He inserted Alfonzo McKinnie after Caruso departed, and McKinnie sank two consecutive 3-pointers."}
{"game_id": "0022100459", "chunk_id": "0022100459_008", "order": 8, "role": "body", "text": "The reserves accounted for 32 of the Bulls’ 73 first-half points and finished with 66, with McKinnie’s third 3-pointer giving the Bulls their biggest lead of the half at 61-36."}
{"game_id": "0022100459", "chunk_id": "0022100459_009", "order": 9, "role": "body", "text": "Coby White, in his second game since returning from protocols, came off the bench to score 24 points. McKinnie finished with 16."}
{"game_id": "0022100459", "chunk_id": "0022100459_010", "order": 10, "role": "body", "text": "“I give those guys a lot of credit,” Donovan said. “I thought they were terrific tonight. It’s good to see those guys’ hard work get rewarded.”"}
{"game_id": "0022100459", "chunk_id": "0022100459_011", "order": 11, "role": "body", "text": "The contributions were extremely special to McKinnie, who grew up 10 minutes from the United Center."}
{"game_id": "0022100459", "chunk_id": "0022100459_012", "order": 12, "role": "body", "text": "“I’m a West Side kid,” McKinnie said. “Our house was a Bulls house. This is a dream come true.\""}
{"game_id": "0022100459", "chunk_id": "0022100459_013", "order": 13, "role": "body", "text": "Bulls point guard Lonzo Ball had 19 points and eight assists."}
{"game_id": "0022100459", "chunk_id": "0022100459_014", "order": 14, "role": "body", "text": "“They got veteran guys who were ready to play tonight,” Rockets coach Paul Silas Jr. said. “This was a lesson for our young group as far as the readiness that you need coming in regardless of the circumstance.”"}
{"game_id": "0022100459", "chunk_id": "0022100459_015", "order": 15, "role": "body", "text": "Bulls center Nikola Vucevic, who entered Monday’s game shooting 32% from the field (24 for 75) in his last four games, scored 18 points on 8-of-18 shooting."}
{"game_id": "0022100459", "chunk_id": "0022100459_016", "order": 16, "role": "body", "text": "Josh Christopher’s two free throws cut the Rockets’ deficit to 30-26, but the Bulls embarked on a 15-2 run, punctuated by a basket by Ball that prompted a Rockets timeout."}
{"game_id": "0022100459", "chunk_id": "0022100459_017", "order": 17, "role": "body", "text": "The Rockets lost for the fourth time in 13 games when scoring at least 110 points. They fell to 3-14 on the road."}
{"game_id": "0022100459", "chunk_id": "0022100459_018", "order": 18, "role": "body", "text": "“We got to do a better job of knowing the importance of these games, not just kind of coming in and hoping and seeing,” Silas said. “We need to come in with intention and come in with a focus on being ready. If we don’t, what happened in the first half will happen to us.”"}
{"game_id": "0022100459", "chunk_id": "0022100459_020", "order": 20, "role": "body", "text": "Rockets: G Jalen Green (left hamstring strain) could return within the next three games, Silas Jr. said. G Kevin Porter Jr. (left thigh bruise) likely won’t return until after the holidays."}
{"game_id": "0022100459", "chunk_id": "0022100459_021", "order": 21, "role": "body", "text": "Bulls: McKinnie was signed to a second 10-day contract before the game. ... G Derrick Jones Jr. (left hamstring strain) was ruled out and will be re-evaluated after Christmas with the expectation he wouldn’t be sidelined for an extended period, Donovan said."}
{"game_id": "0022100459", "chunk_id": "0022100459_023", "order": 23, "role": "body", "text": "Rockets: Visit Milwaukee on Wednesday."}
{"game_id": "0022100459", "chunk_id": "0022100459_024", "order": 24, "role": "body", "text": "Bulls: Visit Toronto on Wednesday."}
