{"game_id": "0022100149", "chunk_id": "0022100149_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Ja Morant scored 33 points, reserve Brandon Clarke had 20 points and nine rebounds, and the Memphis Grizzlies put together a furious fourth-quarter rally before defeating the Minnesota Timberwolves 125-118 in overtime on Monday night."}
{"game_id": "0022100149", "chunk_id": "0022100149_002", "order": 2, "role": "body", "text": "Memphis trailed by as many as 16 with 7:30 left in regulation but a 21-4 burst erased Minnesota’s advantage. Over the final 5:22 of regulation, Minnesota made only one of 10 shots and had five turnovers."}
{"game_id": "0022100149", "chunk_id": "0022100149_003", "order": 3, "role": "body", "text": "The one successful shot came as the Timberwolves forced OT with a 39-foot 3-pointer banked in by Karl-Anthony Towns as regulation expired."}
{"game_id": "0022100149", "chunk_id": "0022100149_004", "order": 4, "role": "body", "text": "“It was a real tough shot,” Clarke said. “I was watching him shoot. Watching it go up, and I was like ‘That might go in’ because he shot it with a bunch of touch."}
{"game_id": "0022100149", "chunk_id": "0022100149_005", "order": 5, "role": "body", "text": "“I knew if it hit the backboard, it would have a chance of going in.”"}
{"game_id": "0022100149", "chunk_id": "0022100149_006", "order": 6, "role": "body", "text": "But even after the unlikely shot, Memphis pulled away in the extra period, keyed by an offensive rebound and put back by Clarke with 22.7 seconds left."}
{"game_id": "0022100149", "chunk_id": "0022100149_007", "order": 7, "role": "body", "text": "De’Anthony Melton had 19 points for the Grizzlies, Jaren Jackson Jr. had 14, Desmond Bane had 13 and Kyle Anderson added 12 points and nine rebounds for Memphis, which also had erased a double-digit deficit in the first half."}
{"game_id": "0022100149", "chunk_id": "0022100149_008", "order": 8, "role": "body", "text": "“We fought to the end,” Morant said of the late rally and overtime. “Went down early in the game, late in the game. Went on a run of our own. Big-time run. Got stops. Were able to score.”"}
{"game_id": "0022100149", "chunk_id": "0022100149_009", "order": 9, "role": "body", "text": "It was Minnesota’s sixth straight loss. D’Angelo Russell, who missed the previous two games with a sprained right ankle, led the Timberwolves with 30 points. Towns had 25 points and 13 rebounds. Anthony Edwards, who entered the game shooting 30% from 3-point range, connected on 4 of 9 from outside the arc and ended up with 27 points."}
{"game_id": "0022100149", "chunk_id": "0022100149_010", "order": 10, "role": "body", "text": "“We didn’t execute at a high level,” Towns said. “Just didn’t play good enough. It’s as simple as that. We didn’t do enough to win. We did enough to hang on, and we have to give a little more of ourselves.”"}
{"game_id": "0022100149", "chunk_id": "0022100149_011", "order": 11, "role": "body", "text": "Memphis struggled in the third quarter to stop the Timberwolves — especially Russell, who scored 13 points in the frame, including connecting on 3 of 5 from outside the arc. Minnesota had an 11-point lead after the third quarter, which swelled to 16 in the fourth before the Grizzlies made their run."}
{"game_id": "0022100149", "chunk_id": "0022100149_012", "order": 12, "role": "body", "text": "Then the Timberwolves fell apart down the stretch and in the extra period."}
{"game_id": "0022100149", "chunk_id": "0022100149_013", "order": 13, "role": "body", "text": "“We played better for longer tonight,” Minnesota coach Chris Finch said. “I still think we’re a good team, and we have good basketball in us. I think we have good basketball in our future."}
{"game_id": "0022100149", "chunk_id": "0022100149_014", "order": 14, "role": "body", "text": "“We’ve just got to figure out a way to close and win these games that we’ve been able to create an advantage in.”"}
{"game_id": "0022100149", "chunk_id": "0022100149_016", "order": 16, "role": "body", "text": "Timberwolves: Had only played one road game this season before Monday’s game, which was the start of a four-game road trip. … …G Josh Okogie grabbed his 200th career offensive rebound in the second quarter. …Towns was 3 of 9 from 3-point range, but also had five turnovers."}
{"game_id": "0022100149", "chunk_id": "0022100149_017", "order": 17, "role": "body", "text": "Grizzlies: Are now 8-2 in games after losses of 19 points or more, dating to the start of last season. Memphis lost to the Wizards by 28 points on Friday. … Are 4-1 at home. … Have won seven straight over Minnesota. …Rookie F Ziaire Williams was listed as questionable with right wrist soreness and did not play."}
{"game_id": "0022100149", "chunk_id": "0022100149_019", "order": 19, "role": "body", "text": "Jaren Jackson Jr. has been splitting time from playing forward, shifting over to center. And while that isn’t necessarily where Jackson starts the game, Clarke said it only makes sense: “He’s 7-1. If you can’t play the 5 at 7-1, there’s something going on.”"}
{"game_id": "0022100149", "chunk_id": "0022100149_021", "order": 21, "role": "body", "text": "Timberwolves: At Golden State on Wednesday night."}
{"game_id": "0022100149", "chunk_id": "0022100149_022", "order": 22, "role": "body", "text": "Grizzlies: Host Charlotte on Wednesday night."}
