{"game_id": "0022100303", "chunk_id": "0022100303_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Dillon Brooks scored 21 points, Desmond Bane added 18 and the Memphis Grizzlies took advantage of Sacramento’s poor shooting to beat the Kings 128-101 on Sunday night."}
{"game_id": "0022100303", "chunk_id": "0022100303_002", "order": 2, "role": "body", "text": "Jaren Jackson Jr. added 17 points and nine rebounds, and Brandon Clarke had 15 points to help Memphis snap a two-game losing streak."}
{"game_id": "0022100303", "chunk_id": "0022100303_003", "order": 3, "role": "body", "text": "Buddy Hield led the Kings with 14 points, but was 5 of 17 from the field, including missing eight of his nine 3-pointers. Terence Davis had 13 points, and De’Aaron Fox added 12, but was 4 of 12 from the field, all part of the Kings shooting 34% for the game — including 9 of 42 from outside the arc."}
{"game_id": "0022100303", "chunk_id": "0022100303_004", "order": 4, "role": "body", "text": "“We shot the ball atrociously,” Kings interim coach Alvin Gentry said."}
{"game_id": "0022100303", "chunk_id": "0022100303_005", "order": 5, "role": "body", "text": "Memphis was playing its first game without scoring leader Ja Morant, who sprained his left knee Friday night in a loss to the Atlanta Hawks. That put the Memphis scoring onus on others to pick up the slack. It was Bane and Brooks early with an assist from the Grizzlies bench, which connected on 16 of its 21 shots in the first half."}
{"game_id": "0022100303", "chunk_id": "0022100303_006", "order": 6, "role": "body", "text": "“I think this was a perfect game to go back on and see what we did and what was beneficial,” said reserve guard De’Anthony Melton, who had 14 points for Memphis. “It’s always a blessing that we had to move the ball and we are all sharing and everybody’s getting involved.”"}
{"game_id": "0022100303", "chunk_id": "0022100303_007", "order": 7, "role": "body", "text": "For the first half, Sacramento managed only 35% shooting and connected on only five of 34 3-pointers. The 76-52 halftime lead was the most points by Memphis in a half this season."}
{"game_id": "0022100303", "chunk_id": "0022100303_008", "order": 8, "role": "body", "text": "“Early in the game, the first half, the duress a lot of those 3s were under was really good,” Memphis coach Taylor Jenkins said. “The urgency to defend the 3-point line was really good.”"}
{"game_id": "0022100303", "chunk_id": "0022100303_009", "order": 9, "role": "body", "text": "Memphis kept up the pressure offensively in the second half. Jackson scored 11 points before the midway point of the third as the Grizzlies shooting remained above 57% at that point."}
{"game_id": "0022100303", "chunk_id": "0022100303_010", "order": 10, "role": "body", "text": "Through three quarters, the Kings managed only 32% shooting, were only 6 of 33 from outside the arc and trailed 106-74."}
{"game_id": "0022100303", "chunk_id": "0022100303_011", "order": 11, "role": "body", "text": "Gentry did make a direct correlation to a poor shooting night affecting the defense but said the Grizzlies accuracy was a byproduct of the Kings’ off-the-mark shooting."}
{"game_id": "0022100303", "chunk_id": "0022100303_012", "order": 12, "role": "body", "text": "“When you’re not making shots, and teams are running out off of misses, it takes you longer to set your defense, and it takes you longer to get matched up in transition,” Gentry said."}
{"game_id": "0022100303", "chunk_id": "0022100303_014", "order": 14, "role": "body", "text": "Kings: Sacramento played without forwards Harrison Barnes, Maurice Harkless and Richaun Holmes, all who sat out with various ailments. … Sacramento is 2-2 under Gentry since he took over when Luke Walton was fired last week."}
{"game_id": "0022100303", "chunk_id": "0022100303_015", "order": 15, "role": "body", "text": "Grizzlies: Tyus Jones started his first game of the season in place of Morant. Morant was on the bench for the game. … The previous high for a half was 74 points against the Rockets on Nov. 15. … Steven Adams had 12 rebounds."}
{"game_id": "0022100303", "chunk_id": "0022100303_017", "order": 17, "role": "body", "text": "The Grizzlies were relieved when tests on Morant showed only a sprain to the left knee. And while he was on crutches for practice Saturday, indications are the damage was not significant, and his return is measured in weeks, not months. Jenkins said there is no set timeline. “He’ll be out for a few weeks, and each week, we’ll have a better idea as (things) unfold,” Jenkins said. “We expect a full recovery, and this is nothing long-term that we’re worried about.”"}
{"game_id": "0022100303", "chunk_id": "0022100303_019", "order": 19, "role": "body", "text": "A Memphis fan along the sidelines was ejected from his seat in the second half at the urging of Gentry. It was unclear what the man said. “I think you pay for a ticket, you’ve got a right to boo guys. You’ve got a right to cheer for your team,” Gentry said. “But inappropriate things should never be what anyone should say or have an opportunity to say in an NBA game without being removed.” Asked about the context of the comments, the Sacramento coach would not be specific. “It’s not anything I’m going to tolerate people saying to my player, I know that, not without intervening and asking that (the fan) be removed.”"}
{"game_id": "0022100303", "chunk_id": "0022100303_021", "order": 21, "role": "body", "text": "Kings: Host Los Angeles Lakers on Tuesday night."}
{"game_id": "0022100303", "chunk_id": "0022100303_022", "order": 22, "role": "body", "text": "Grizzlies: At Toronto on Tuesday night."}
