{"game_id": "0022101063", "chunk_id": "0022101063_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Desmond Bane had 24 points and the Memphis Grizzlies overcame the absence of star Ja Morant with balanced scoring in a 122-98 victory over the NBA-worst Houston Rockets on Sunday."}
{"game_id": "0022101063", "chunk_id": "0022101063_002", "order": 2, "role": "body", "text": "Bane was one of six Memphis players to score at least 13 points on a day Morant sat out with a sore knee."}
{"game_id": "0022101063", "chunk_id": "0022101063_003", "order": 3, "role": "body", "text": "“We’ve just got a great team,\" coach Taylor Jenkins said. “They uplift each other. They they rise up when someone’s out and ... they know we’ve got a job to do out there and that’s to compete to our level. Luckilym when guys have been out, especially Ja recently, they’ve stepped up.\""}
{"game_id": "0022101063", "chunk_id": "0022101063_004", "order": 4, "role": "body", "text": "The Grizzlies led by double figures for most of the game and had a 13-point lead after three quarters. Kenyon Martin Jr. opened the fourth quarter with a dunk for Houston before Memphis used a 15-0 run to push its advantage to 99-73 with nine minutes to go."}
{"game_id": "0022101063", "chunk_id": "0022101063_005", "order": 5, "role": "body", "text": "Jaren Jackson Jr. had two 3-pointers and a block in that stretch and Brandon Clarke added four points as the Grizzlies forced two turnovers to help pad the lead."}
{"game_id": "0022101063", "chunk_id": "0022101063_006", "order": 6, "role": "body", "text": "“I thought we did a great job getting stops and converting that to easy shots on the other end,\" Jenkins said of about the team's success during that huge run."}
{"game_id": "0022101063", "chunk_id": "0022101063_007", "order": 7, "role": "body", "text": "Jenkins said Morant was OK and that he just wanted to give him some time to rest with the team’s next game not until Wednesday night. Morant has helped the Grizzlies to the second-best record in the NBA this season behind Phoenix at 49-23. But Memphis has done well without him too, going 14-2 in games that he’s missed."}
{"game_id": "0022101063", "chunk_id": "0022101063_008", "order": 8, "role": "body", "text": "Dennis Schroder had 17 points off the bench for the Rockets. They have dropped five straight."}
{"game_id": "0022101063", "chunk_id": "0022101063_009", "order": 9, "role": "body", "text": "Coach Stephen Silas was disappointed that his team let its poor shooting impact its performance on the other end of the court."}
{"game_id": "0022101063", "chunk_id": "0022101063_010", "order": 10, "role": "body", "text": "“We’ve been doing that a lot this season, getting frustrated with the offense and letting it creep into our defense,\" he said."}
{"game_id": "0022101063", "chunk_id": "0022101063_011", "order": 11, "role": "body", "text": "The Grizzlies led by 12 at halftime and had extended the lead to 17 after two free throws by Jackson midway through the quarter. Houston got hot after that, making the next 10 points to get to 71-64."}
{"game_id": "0022101063", "chunk_id": "0022101063_012", "order": 12, "role": "body", "text": "Schroder started things off in that stretch with a 3-pointer and Alperen Sengun had five points, capped by a steal and dunk to help the Rockets cut the deficit."}
{"game_id": "0022101063", "chunk_id": "0022101063_013", "order": 13, "role": "body", "text": "A 3-pointer by De’Anthony Melton’s ended Houston’s run and started an 8-3 run for Memphis that extended the lead to 79-67 with about three minutes left in the third."}
{"game_id": "0022101063", "chunk_id": "0022101063_014", "order": 14, "role": "body", "text": "Houston got within 10 late in the third quarter on a dunk by Kevin Porter Jr., but another 3 by Melton gave the Grizzlies an 84-71 lead entering the fourth quarter. TIP-INS"}
{"game_id": "0022101063", "chunk_id": "0022101063_015", "order": 15, "role": "body", "text": "Grizzlies: Dillon Brooks scored 20 points. ... Melton had 16 points and seven rebounds. ... Memphis was 16 of 34 on 3-pointers."}
{"game_id": "0022101063", "chunk_id": "0022101063_016", "order": 16, "role": "body", "text": "Rockets: Eric Gordon missed a third straight game with an illness. ... Houston made just 10 of 31 3-pointers. ... Rookie Jalen Green, the second overall pick in the draft, had a tough day, shooting 3 of 13 with eight points. ... Sengun had 12 points and nine rebounds off the bench."}
{"game_id": "0022101063", "chunk_id": "0022101063_018", "order": 18, "role": "body", "text": "Schroder on embracing a leadership role since being traded to this young team about two months ago: “It’s different. But to help the young guys day in and day out and help them go through this process is great.\""}
{"game_id": "0022101063", "chunk_id": "0022101063_020", "order": 20, "role": "body", "text": "Grizzlies: Host Brooklyn on Wednesday night."}
{"game_id": "0022101063", "chunk_id": "0022101063_021", "order": 21, "role": "body", "text": "Rockets: Host Washington on Monday night."}
