{"game_id": "0022101043", "chunk_id": "0022101043_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Giannis Antetokounmpo had 36 points and 10 rebounds, Wesley Matthews made a clutch 3-pointer with 1:32 remaining, and the Milwaukee Bucks held off the Sacramento Kings 135-126 on Wednesday night."}
{"game_id": "0022101043", "chunk_id": "0022101043_002", "order": 2, "role": "body", "text": "Khris Middleton added 32 points, eight rebounds and eight assists to help Milwaukee win its eighth in nine games. Jrue Holiday scored 21 points and Bobby Portis Jr. had 12."}
{"game_id": "0022101043", "chunk_id": "0022101043_003", "order": 3, "role": "body", "text": "The defending NBA champions pulled within two games of idle Miami for the top seed in the Eastern Conference."}
{"game_id": "0022101043", "chunk_id": "0022101043_004", "order": 4, "role": "body", "text": "“They’ve got a belief,” Bucks coach Mike Budenholzer said. “You can’t feel it — but you can feel it. There’s an excitement about we’re getting closer to the end of the season, the playoffs, and those guys are eager to get going again.”"}
{"game_id": "0022101043", "chunk_id": "0022101043_005", "order": 5, "role": "body", "text": "Antetokounmpo had his fifth straight game with 30 points or more as he chases Kareem Abdul-Jabbar’s franchise scoring record. The two-time MVP shot 12 of 23, made 12 of 16 free throws and dominated a stretch late in the third quarter when he scored Milwaukee’s final 12 points."}
{"game_id": "0022101043", "chunk_id": "0022101043_006", "order": 6, "role": "body", "text": "“Believe it or not, he’s hungrier,” Matthews said. “He’s greedy, in a good way. He wants everything. He wants to win a championship this year. He wants to win a championship next year. He wants to be better than he was last year. That’s just how he is. That’s how he’s wired.”"}
{"game_id": "0022101043", "chunk_id": "0022101043_007", "order": 7, "role": "body", "text": "The Bucks didn’t pull away until late in the fourth."}
{"game_id": "0022101043", "chunk_id": "0022101043_008", "order": 8, "role": "body", "text": "After De’Aaron Fox’s three-point play gave Sacramento a 123-120 lead, Holiday and Middleton made consecutive 3s. Fox answered with a 3-pointer to tie it before Matthews hit his go-ahead shot from beyond the arc."}
{"game_id": "0022101043", "chunk_id": "0022101043_009", "order": 9, "role": "body", "text": "Antetokounmpo followed with a hook shot and two free throws, and Portis sank two free throws."}
{"game_id": "0022101043", "chunk_id": "0022101043_010", "order": 10, "role": "body", "text": "“That’s the beauty of this team, it’s not always me,” Antetokounmpo said. “Everybody has to come in and do their part. One day it’s going to be Jrue. One day it’s going to be Khris. One day it’s going to be me. That’s how our team is built. You never know who it’s going to be.”"}
{"game_id": "0022101043", "chunk_id": "0022101043_011", "order": 11, "role": "body", "text": "Domantas Sabonis had 22 points for the Kings. Fox added 21 points on 8-of-23 shooting."}
{"game_id": "0022101043", "chunk_id": "0022101043_012", "order": 12, "role": "body", "text": "Sacramento fell to 3-8 since the All-Star break."}
{"game_id": "0022101043", "chunk_id": "0022101043_013", "order": 13, "role": "body", "text": "“We did a good job of challenging shots but they are a good 3-point shooting team and were able to knock down some,” Kings interim coach Alvin Gentry said. “Give them a lot of credit for jumping up and making them.”"}
{"game_id": "0022101043", "chunk_id": "0022101043_014", "order": 14, "role": "body", "text": "The Bucks fell behind early, tied the game midway through the second quarter on a pair of 3s from Middleton and then went ahead 51-50 when Middleton made a free throw after Fox was called for a technical."}
{"game_id": "0022101043", "chunk_id": "0022101043_015", "order": 15, "role": "body", "text": "Antetokounmpo brought the Bucks’ bench to its feet when he grabbed a defensive rebound and raced past several Kings players to throw down a one-handed dunk. Matthews followed with two free throws to put Milwaukee up by seven at halftime."}
{"game_id": "0022101043", "chunk_id": "0022101043_017", "order": 17, "role": "body", "text": "Donte DiVincenzo made a leaping steal of an inbounds pass near Milwaukee’s basket and tipped it to Davion Mitchell, who went the other way and scored a breakaway layup to pull Sacramento to 108-105."}
{"game_id": "0022101043", "chunk_id": "0022101043_019", "order": 19, "role": "body", "text": "After making a 3-pointer to put the Kings ahead by five in the second quarter, Chimezie Metu sprinted back and blocked a shot attempt under the basket by Antetokounmpo."}
{"game_id": "0022101043", "chunk_id": "0022101043_021", "order": 21, "role": "body", "text": "Former Green Bay Packers quarterback and Hall of Famer Brett Favre attended the game and sat courtside, not far from Kings owner Vivek Ranadive and former Kings general manager Vlade Divac. The 52-year-old Favre, who retired from the NFL in 2010, wore a bright yellow Southern Miss beach volleyball shirt — an ode to his alma mater. Former UFC light heavyweight champion Chuck Liddell sat next to Favre in the second half."}
{"game_id": "0022101043", "chunk_id": "0022101043_023", "order": 23, "role": "body", "text": "Bucks: Antetokounmpo needs 135 points to pass Abdul-Jabbar’s team record of 14,211."}
{"game_id": "0022101043", "chunk_id": "0022101043_024", "order": 24, "role": "body", "text": "Kings: Sacramento has lost 12 straight to Milwaukee dating to 2016."}
{"game_id": "0022101043", "chunk_id": "0022101043_026", "order": 26, "role": "body", "text": "Bucks: End their four-game road trip against the Timberwolves on Saturday. Minnesota never trailed when the teams played in October."}
{"game_id": "0022101043", "chunk_id": "0022101043_027", "order": 27, "role": "body", "text": "Kings: Host the Celtics on Friday. The Kings lost at Boston in January but have won the last two meetings at home."}
