{"game_id": "0022100496", "chunk_id": "0022100496_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Desmond Bane scored 28 points and the Memphis Grizzlies defeated Sacramento for the second time in 10 days, beating the Kings 127-102 on Sunday night."}
{"game_id": "0022100496", "chunk_id": "0022100496_002", "order": 2, "role": "body", "text": "Ja Morant had 18 points, nine assists and seven rebounds to help the Grizzlies end a three-game losing streak. Jaren Jackson scored 21 points and John Konchar had his first career double-double with 11 points and 14 rebounds."}
{"game_id": "0022100496", "chunk_id": "0022100496_003", "order": 3, "role": "body", "text": "“We were driving the ball in the first half, but shots weren’t falling,” Bane said. “We stuck with it and eventually our defense turned into offense and busted the game open.”"}
{"game_id": "0022100496", "chunk_id": "0022100496_004", "order": 4, "role": "body", "text": "The Grizzlies beat the Kings 124-105 on Dec. 17 at Golden 1 Center, and won handily again to extend their winning streak against Sacramento to six."}
{"game_id": "0022100496", "chunk_id": "0022100496_005", "order": 5, "role": "body", "text": "After Fox stood and glared following his one-handed dunk early in the third, the Grizzlies took control with a 24-5 run in just under four minutes. Morant had eight points during the outburst and ended it sprinting through the lane for an emphatic dunk, similar to Fox."}
{"game_id": "0022100496", "chunk_id": "0022100496_006", "order": 6, "role": "body", "text": "Sacramento got within 91-79 early in the fourth, but Memphis went on another big run and pulled away. Anderson converted a three-point play, Bane made a deep jumper and Morant added another dunk to make it 116-89."}
{"game_id": "0022100496", "chunk_id": "0022100496_007", "order": 7, "role": "body", "text": "“It was a collection of cycles, defense to offense, defense to offense,” Grizzlies coach Taylor Jenkins said. “Shots started falling. We got to our pace a little bit more in the full court, but especially in the half court. In that third quarter, we were getting to second-side drives, third-side drives (and) we were relentless on the boards. When we got those second-chance opportunities we capitalized.”"}
{"game_id": "0022100496", "chunk_id": "0022100496_008", "order": 8, "role": "body", "text": "Tyrese Haliburton had 18 points and seven assists for Sacramento, ending his run of four consecutive games with at least 20 points and 10 assists. De’Aaron Fox scored 12 points in his return for the Kings after missing nearly two weeks while in the NBA’s health and safety protocol."}
{"game_id": "0022100496", "chunk_id": "0022100496_009", "order": 9, "role": "body", "text": "Kings interim coach Alvin Gentry, who had also been in the protocol, lashed out at his team after what he called an embarrassing performance."}
{"game_id": "0022100496", "chunk_id": "0022100496_010", "order": 10, "role": "body", "text": "“It’s the most disappointed I’ve been in 34 years in the NBA, I can honestly say that,” Gentry said. “That performance was absolutely ridiculous. We didn’t play hard, we didn’t compete. We didn’t guard the ball, we didn’t guard screen and rolls. We didn’t follow the game plan. No competitiveness whatsoever. They basically toyed with us. I’m totally disappointed and everybody in this building should be disappointed.”"}
{"game_id": "0022100496", "chunk_id": "0022100496_011", "order": 11, "role": "body", "text": "Fox, Marvin Bagley III and Terence Davis were cleared to return from the protocols before the game"}
{"game_id": "0022100496", "chunk_id": "0022100496_012", "order": 12, "role": "body", "text": "Even with the added bodies, the Kings had a hard time keeping up."}
{"game_id": "0022100496", "chunk_id": "0022100496_013", "order": 13, "role": "body", "text": "Fox made a pair of free throws and a layup to put Sacramento ahead by one at halftime, but the Kings were outscored 40-27 in the third quarter."}
{"game_id": "0022100496", "chunk_id": "0022100496_014", "order": 14, "role": "body", "text": "Sacramento fell to 7-10 at home."}
{"game_id": "0022100496", "chunk_id": "0022100496_015", "order": 15, "role": "body", "text": "“I feel like teams come in here licking their chops for sure,” Davis said. “It’s up to us to protect our home court. We have to fix the little things. No excuses whatsoever. Once we get on the same page, all aboard, this team is very talented. It’ll come along.”"}
{"game_id": "0022100496", "chunk_id": "0022100496_017", "order": 17, "role": "body", "text": "Grizzlies: Before the game Dillon Brooks, De’Anthony Melton and Yves Pons entered health and safety protocol. … Santi Aldama remains out with right ankle soreness."}
{"game_id": "0022100496", "chunk_id": "0022100496_018", "order": 18, "role": "body", "text": "Kings: Fox was whistled for a technical foul after missing a shot midway through the second quarter. Chimezie Metu picked up one in the third. Both calls were made by referee Cheryl Flores. … Davion Mitchell, Alex Len and Neemias Queta remain in the health and safety protocol."}
{"game_id": "0022100496", "chunk_id": "0022100496_020", "order": 20, "role": "body", "text": "Grizzlies: Travel to Phoenix to play the Suns on Monday. The Suns won by 25 points when the teams played in Memphis in November."}
{"game_id": "0022100496", "chunk_id": "0022100496_021", "order": 21, "role": "body", "text": "Kings: Face the Thunder at Golden 1 Center on Tuesday. Sacramento swept all three games last season, but lost in Oklahoma City earlier this season in November."}
