{"game_id": "0022100372", "chunk_id": "0022100372_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Eric Gordon scored 21 points before being ejected in the fourth quarter and Garrison Mathews added 19 as the Houston Rockets extended their winning streak to seven games with a 114-104 victory over the shorthanded Brooklyn Nets on Wednesday night."}
{"game_id": "0022100372", "chunk_id": "0022100372_002", "order": 2, "role": "body", "text": "Before the streak, the Rockets dropped their previous 15 games. It's the first time Houston has won seven straight since winning eight in a row in November 2019."}
{"game_id": "0022100372", "chunk_id": "0022100372_003", "order": 3, "role": "body", "text": "“The adversity that we went through prior to this point has made it even sweeter,\" coach Stephen Silas said. “We’re feeling pretty good about ourselves.\""}
{"game_id": "0022100372", "chunk_id": "0022100372_004", "order": 4, "role": "body", "text": "James Harden had 25 points for the Eastern Conference-leading Nets on a night when NBA leading scorer Kevin Durant and LaMarcus Aldridge both sat out for rest. It was Harden’s second visit to Houston since he was traded in January during his ninth season with the Rockets."}
{"game_id": "0022100372", "chunk_id": "0022100372_005", "order": 5, "role": "body", "text": "The Rockets led by 17 to start the fourth quarter and the Nets cut the deficit to four before Houston pulled away."}
{"game_id": "0022100372", "chunk_id": "0022100372_006", "order": 6, "role": "body", "text": "Mathews, who had 12 points in the fourth, scored four in a 5-0 run that extended Houston’s lead to 109-97. Patty Mills made one of two free throws for the Nets before a three-point play by D.J. Augustin made it 112-98 with about two minutes to go."}
{"game_id": "0022100372", "chunk_id": "0022100372_007", "order": 7, "role": "body", "text": "“When you beat a team like that it means something,\" Mathews said. “This streak's been a huge boost to our confidence. It’s been a huge boost to our morale.\""}
{"game_id": "0022100372", "chunk_id": "0022100372_008", "order": 8, "role": "body", "text": "The loss snapped a six-game road winning streak for the Nets, whose nine road wins are tied with the Suns for most in the NBA."}
{"game_id": "0022100372", "chunk_id": "0022100372_009", "order": 9, "role": "body", "text": "The Nets shot just 8 of 33 from 3-point range, with Harden going 3 of 12 and finishing 4 of 16 overall. He was 14 for 16 from the line."}
{"game_id": "0022100372", "chunk_id": "0022100372_010", "order": 10, "role": "body", "text": "“I got the shots I wanted, for sure,\" he said. “I just didn’t make them.”"}
{"game_id": "0022100372", "chunk_id": "0022100372_011", "order": 11, "role": "body", "text": "Harden received a fair number of boos when he was introduced and each time he had the ball early. But he got a warm ovation after a highlight video of his time in Houston was played during a timeout in the first quarter."}
{"game_id": "0022100372", "chunk_id": "0022100372_012", "order": 12, "role": "body", "text": "He formed his hands into the shape of a heart as he held them over his head and then moved them to his chest and smiled as the crowd cheered."}
{"game_id": "0022100372", "chunk_id": "0022100372_013", "order": 13, "role": "body", "text": "Harden said playing in Houston will always be meaningful to him."}
{"game_id": "0022100372", "chunk_id": "0022100372_014", "order": 14, "role": "body", "text": "“Very special,\" he said. “I spent some of my most amazing years here on the court and off the court.”"}
{"game_id": "0022100372", "chunk_id": "0022100372_015", "order": 15, "role": "body", "text": "Cam Thomas had 18 points for Brooklyn, and Mills added 12."}
{"game_id": "0022100372", "chunk_id": "0022100372_016", "order": 16, "role": "body", "text": "A 10-0 spurt by the Nets got them within four with about 7½ minutes left. Harden capped that run when he made a 3-pointer as he crashed to the court after being fouled by Mathews and made the free throw for a four-point play."}
{"game_id": "0022100372", "chunk_id": "0022100372_017", "order": 17, "role": "body", "text": "Gordon was ejected soon after that when he received his second technical foul of the game for yelling at the officials about not getting a foul call."}
{"game_id": "0022100372", "chunk_id": "0022100372_018", "order": 18, "role": "body", "text": "Harden’s free throw after Gordon’s technical cut the lead to four, but a 6-1 spurt by the Rockets, highlighted by a 3 from Mathews, made it 104-95 with 4½ minutes left."}
{"game_id": "0022100372", "chunk_id": "0022100372_019", "order": 19, "role": "body", "text": "Houston led by as many as 20 and took control of the game with a 37-point second quarter."}
{"game_id": "0022100372", "chunk_id": "0022100372_020", "order": 20, "role": "body", "text": "The Rockets ended the third quarter on a 6-2 run, punctuated by a one-handed dunk by Kenyon Martin Jr. to make it 90-73 entering the fourth. Houston rookie Josh Christopher stole the ball from Jevon Carter and dished to Martin on the other end, and he sailed over Carter for the slam."}
{"game_id": "0022100372", "chunk_id": "0022100372_022", "order": 22, "role": "body", "text": "Nets: Nic Claxton received a flagrant 1 foul for a foul on Mathews in the second quarter. ... Paul Millsap scored 10 points off the bench. ... Claxton had eight points."}
{"game_id": "0022100372", "chunk_id": "0022100372_023", "order": 23, "role": "body", "text": "Rockets: Jalen Green missed his sixth straight game with a strained left hamstring. ... Kevin Porter Jr. missed his second game in a row with a bruised left thigh. ... Danuel House sat out with a sprained left ankle."}
{"game_id": "0022100372", "chunk_id": "0022100372_025", "order": 25, "role": "body", "text": "Christopher had a career-high 18 points off the bench on his 20th birthday."}
{"game_id": "0022100372", "chunk_id": "0022100372_026", "order": 26, "role": "body", "text": "“He’s been working at his game day in, day out,\" Silas said. “He played a really solid game on both ends of the floor.\""}
{"game_id": "0022100372", "chunk_id": "0022100372_027", "order": 27, "role": "body", "text": "Asked what it was like to have such a big game on his birthday, Christopher thought for a second before answering."}
{"game_id": "0022100372", "chunk_id": "0022100372_028", "order": 28, "role": "body", "text": "“Perfect, perfect day,\" he said."}
{"game_id": "0022100372", "chunk_id": "0022100372_030", "order": 30, "role": "body", "text": "Nets: Visit the Atlanta Hawks on Friday night."}
{"game_id": "0022100372", "chunk_id": "0022100372_031", "order": 31, "role": "body", "text": "Rockets: Host the Milwaukee Bucks on Friday night."}
