{"game_id": "0022100014", "chunk_id": "0022100014_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Beginning a season of high expectations, the Atlanta Hawks showed they're far more than Trae Young."}
{"game_id": "0022100014", "chunk_id": "0022100014_002", "order": 2, "role": "body", "text": "He's their unquestioned leader, of course, but a 113-87 rout of the Dallas Mavericks displayed Atlanta's impressive depth."}
{"game_id": "0022100014", "chunk_id": "0022100014_003", "order": 3, "role": "body", "text": "Cam Reddish scored 20 points, Young added 19 and four others scored in double figures as the Hawks blew away Luka Doncic and the Mavericks on Thursday night, ruining the debut of Dallas coach Jason Kidd."}
{"game_id": "0022100014", "chunk_id": "0022100014_004", "order": 4, "role": "body", "text": "Coming off a surprising run to the Eastern Conference final, the Hawks took control of the game with a dominant third quarter, stretching a 51-44 halftime lead to 86-64 heading to the fourth."}
{"game_id": "0022100014", "chunk_id": "0022100014_005", "order": 5, "role": "body", "text": "After a sluggish start, Young scored 12 points and dished out nine assists in the decisive period, drawing chants of “MVP! MVP!” from the home crowd in the very first game."}
{"game_id": "0022100014", "chunk_id": "0022100014_006", "order": 6, "role": "body", "text": "Reddish led a stellar effort from the deep Hawks bench, which contributed 44 points."}
{"game_id": "0022100014", "chunk_id": "0022100014_007", "order": 7, "role": "body", "text": "Seven Hawks scored before Young finally knocked down his first shot with 4 1/2 minutes left in the first half."}
{"game_id": "0022100014", "chunk_id": "0022100014_008", "order": 8, "role": "body", "text": "“It's a good problem to have,” Young said. “We've got so many guys who can play.”"}
{"game_id": "0022100014", "chunk_id": "0022100014_009", "order": 9, "role": "body", "text": "Coach Nate McMillan, who guided the Hawks to a remarkable turnaround last season after taking over on an interim basis, wants his starters to play as hard as they can right from the opening tip."}
{"game_id": "0022100014", "chunk_id": "0022100014_010", "order": 10, "role": "body", "text": "“We can play 10, 11 guys,” McMillan said. “There's no need to pace yourself when you have a bench that can come in. We want to keep the pressure on an opponent.”"}
{"game_id": "0022100014", "chunk_id": "0022100014_011", "order": 11, "role": "body", "text": "The Mavericks were thoroughly miserable in their first game under Kidd, who had not been a head coach since he was fired in Milwaukee midway through the 2017-18 season."}
{"game_id": "0022100014", "chunk_id": "0022100014_012", "order": 12, "role": "body", "text": "Kidd learned before the game that he was picked as one of the NBA’s 75 greatest players as part of the league's 75th anniversary."}
{"game_id": "0022100014", "chunk_id": "0022100014_013", "order": 13, "role": "body", "text": "It was all downhill from there."}
{"game_id": "0022100014", "chunk_id": "0022100014_014", "order": 14, "role": "body", "text": "The Mavericks appear to have a lot more work to do if they want to take the next step behind Doncic, their dynamic young star."}
{"game_id": "0022100014", "chunk_id": "0022100014_015", "order": 15, "role": "body", "text": "“I thought guys got great looks. They just didn’t go in for us,” said Kidd, who took over in Dallas after longtime coach Rick Carlisle stepped down on the heels of a first-round playoff loss last season."}
{"game_id": "0022100014", "chunk_id": "0022100014_016", "order": 16, "role": "body", "text": "With De'Andre Hunter doing a stellar defensive job, Doncic was held to 18 points on 6-of-17 shooting, to go along with 11 rebounds and seven assists."}
{"game_id": "0022100014", "chunk_id": "0022100014_017", "order": 17, "role": "body", "text": "He didn't get much help from anyone except Jalen Brunson, who scored 17 off the bench."}
{"game_id": "0022100014", "chunk_id": "0022100014_018", "order": 18, "role": "body", "text": "The Mavericks shot a dismal 32.6% (31 of 93) from the field."}
{"game_id": "0022100014", "chunk_id": "0022100014_019", "order": 19, "role": "body", "text": "In the unending comparison between Young and Doncic, who were traded for each other during the 2018 draft, the Atlanta point guard was the clear winner in this one."}
{"game_id": "0022100014", "chunk_id": "0022100014_020", "order": 20, "role": "body", "text": "“We've got to find that balance so we're not clogging up the paint,” said Kristaps Porzingis, who managed just 11 points and five rebounds. “Everybody has got to find their most comfortable spot.”"}
{"game_id": "0022100014", "chunk_id": "0022100014_022", "order": 22, "role": "body", "text": "Leading by as many as 30, the Hawks were able to empty their bench in the fourth quarter."}
{"game_id": "0022100014", "chunk_id": "0022100014_023", "order": 23, "role": "body", "text": "Fourteen players got on the court for Atlanta, including first-round pick Jalen Johnson. He scored six points and grabbed two rebounds."}
{"game_id": "0022100014", "chunk_id": "0022100014_024", "order": 24, "role": "body", "text": "Everyone played for Atlanta except veteran Lou Williams, who suited up but was dealing with a hip injury."}
{"game_id": "0022100014", "chunk_id": "0022100014_026", "order": 26, "role": "body", "text": "Mavericks: Doncic played his 200th game in very rarified territory. He had already joined Oscar Robertson as the only players in NBA history to reach 5,000 points, 1,500 rebounds and 1,500 assists by that career landmark."}
{"game_id": "0022100014", "chunk_id": "0022100014_027", "order": 27, "role": "body", "text": "Hawks: F Danilo Gallinari was ruled out with a nagging shoulder injury. Solomon Hill moved up to fill Gallinari's spot on the second team. ... The Hawks doled out 31 assists, compared to 16 for the Mavericks. ... Dominique Wilkins received a standing ovation when he was introduced during the first timeout as a member of the 75th anniversary team."}
{"game_id": "0022100014", "chunk_id": "0022100014_029", "order": 29, "role": "body", "text": "Mavericks: Travel to Toronto to face the Raptors on Saturday. Dallas will finally play its home opener next Tuesday against the Rockets."}
{"game_id": "0022100014", "chunk_id": "0022100014_030", "order": 30, "role": "body", "text": "Hawks: Head to Cleveland to face the Cavaliers in their first road game Saturday."}
{"game_id": "0022100014", "chunk_id": "0022100014_032", "order": 32, "role": "body", "text": "Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 and find his work at https://apnews.com/search/paulnewberry"}
