{"game_id": "0022101048", "chunk_id": "0022101048_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Seth Curry came back and some of the burden on Kevin Durant went away."}
{"game_id": "0022101048", "chunk_id": "0022101048_002", "order": 2, "role": "body", "text": "Durant scored 38 points, Curry returned to the lineup with seven 3-pointers in his best game as a Net, and Brooklyn rallied to beat the Portland Trail Blazers 128-123 on Friday night."}
{"game_id": "0022101048", "chunk_id": "0022101048_003", "order": 3, "role": "body", "text": "Curry finished with 27 points, his most since coming from Philadelphia last month in the trade headlined by James Harden and Ben Simmons. Curry had missed the previous three games with left ankle soreness and with Kyrie Irving ineligible to play at home, Dallas took advantage of that Wednesday by constantly sending second defenders at Durant."}
{"game_id": "0022101048", "chunk_id": "0022101048_004", "order": 4, "role": "body", "text": "“You shouldn’t be able to run two or three guys at a player the entire game without having to pay for it,” Curry said, “so I think we did a good job of taking advantage of it tonight.”"}
{"game_id": "0022101048", "chunk_id": "0022101048_005", "order": 5, "role": "body", "text": "Andre Drummond and Bruce Brown each added 17 points for the Nets. They bounced back from their loss at the buzzer to the Mavericks and won for the fifth time in six games."}
{"game_id": "0022101048", "chunk_id": "0022101048_006", "order": 6, "role": "body", "text": "Josh Hart scored 25 points for the Trail Blazers, who led by 18 early in the second half but couldn't hold on and lost their third straight. Brandon Williams added 24 points."}
{"game_id": "0022101048", "chunk_id": "0022101048_007", "order": 7, "role": "body", "text": "Durant shot 11 for 15 from the field and added six rebounds and six assists, but the decisive stretch came when he was on the bench to begin the fourth quarter. The Nets opened with a 10-0 spurt, featuring two 3-pointers by Curry, to turn a tie game into a 111-101 lead."}
{"game_id": "0022101048", "chunk_id": "0022101048_008", "order": 8, "role": "body", "text": "Curry finished 7 for 11 behind the arc."}
{"game_id": "0022101048", "chunk_id": "0022101048_009", "order": 9, "role": "body", "text": "“We needed that and good to see him back out there,” Durant said. “He missed a few games with that ankle but I’m glad he’s getting better and he was able to come out here and play and we needed all those points tonight.”"}
{"game_id": "0022101048", "chunk_id": "0022101048_010", "order": 10, "role": "body", "text": "Portland would get it down to three late but Curry finished it off with two free throws the final time."}
{"game_id": "0022101048", "chunk_id": "0022101048_011", "order": 11, "role": "body", "text": "“We just couldn’t get a basket at the start of the fourth quarter,” Blazers coach Chauncey Billups said. “They go on that 10-0 run I think and that really hurt us.”"}
{"game_id": "0022101048", "chunk_id": "0022101048_012", "order": 12, "role": "body", "text": "Playing again without Irving at home, the Nets allowed the Blazers to make nine of first 12 shots, but recovered for a 34-33 lead after one behind 13 points from Durant. Portland then shot 18 for 25 (72%) in a 42-point second quarter. Ben McLemore's 3-pointer made it 75-62 at the break."}
{"game_id": "0022101048", "chunk_id": "0022101048_013", "order": 13, "role": "body", "text": "Portland extended the lead to 82-64 with a good start to the third. The Nets charged back by hitting 13 of 18 shots in the third, outscoring the Blazers 39-26 to even it at 101 heading to the fourth."}
{"game_id": "0022101048", "chunk_id": "0022101048_015", "order": 15, "role": "body", "text": "Trail Blazers: Justise Winslow played in his second straight game since returning from a sore right Achilles tendon. Billups said he came through Wednesday's game well and had a good workout Thursday."}
{"game_id": "0022101048", "chunk_id": "0022101048_016", "order": 16, "role": "body", "text": "Nets: Goran Dragic had nine points and a season-high 10 assists. ... Durant was fined $25,000 by the NBA on Friday for directing obscene language toward a fan with 9.4 seconds left in the first half of the loss to Dallas on Wednesday. ... The Nets had lost six straight home meetings, though one was a designated home game played at Walt Disney World during the restart in 2020"}
{"game_id": "0022101048", "chunk_id": "0022101048_018", "order": 18, "role": "body", "text": "Coach Steve Nash said he couldn't recall whether he noticed if Simmons, who remains out with a back injury, appeared to have any physical issues after the Nets acquired him from Philadelphia on Feb. 10."}
{"game_id": "0022101048", "chunk_id": "0022101048_019", "order": 19, "role": "body", "text": "“What was that, a month ago?” Nash said. “I can’t remember if he was having issues or if it flared up.”"}
{"game_id": "0022101048", "chunk_id": "0022101048_020", "order": 20, "role": "body", "text": "Simmons' back began bothering him after he tried to rebuild his conditioning after the trade and has done nothing more than individual workouts. Nash revealed that the guard had an MRI he believed was a couple weeks ago and had no update on how Simmons felt after getting an epidural earlier this week."}
{"game_id": "0022101048", "chunk_id": "0022101048_022", "order": 22, "role": "body", "text": "Toronto fell back into seventh place in the Eastern Conference after beginning the night tied for sixth with Cleveland. If the Raptors avoid seventh and the play-in, the Nets wouldn't have to worry about possibly playing there if they remain eighth without Irving, who can't travel to Canada because he is unvaccinated."}
{"game_id": "0022101048", "chunk_id": "0022101048_023", "order": 23, "role": "body", "text": "“Not that I’m oblivious to all that, but I’m not like refreshing my screen to find out what the standings are,” Nash said. “We’re focusing on ourselves, trying to improve, trying to put ourselves in a position where we’ll be ready for that game no matter who we play.”"}
{"game_id": "0022101048", "chunk_id": "0022101048_025", "order": 25, "role": "body", "text": "Trail Blazers: At Indiana on Sunday."}
{"game_id": "0022101048", "chunk_id": "0022101048_026", "order": 26, "role": "closing", "text": "Nets: Host Utah on Monday night."}
