{"game_id": "0022100505", "chunk_id": "0022100505_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Ja Morant had one thing on his mind after Devin Booker's 3-pointer with 5 seconds left gave the Phoenix Suns their first lead since early in the game."}
{"game_id": "0022100505", "chunk_id": "0022100505_002", "order": 2, "role": "body", "text": "\"It was, ‘Ja’s gonna get a bucket,’” Morant said."}
{"game_id": "0022100505", "chunk_id": "0022100505_003", "order": 3, "role": "body", "text": "He made a layup with 0.5 seconds left that gave the Memphis Grizzlies a 114-113 victory over the Suns on Monday night."}
{"game_id": "0022100505", "chunk_id": "0022100505_004", "order": 4, "role": "body", "text": "“I like being in those pressure situations, I like taking on that challenge,\" Morant said. \"It was a big-time win for us against a great team.”"}
{"game_id": "0022100505", "chunk_id": "0022100505_005", "order": 5, "role": "body", "text": "Morant finished with 33 points and backcourt mate Desmond Bane scored a career-high 32, hitting 6 of 11 from 3-point range, as the Grizzlies won for the second night in a row on the road. They beat Sacramento on Sunday behind Bane's 28 points."}
{"game_id": "0022100505", "chunk_id": "0022100505_006", "order": 6, "role": "body", "text": "Booker’s 3-pointer with 5 seconds to play capped a rally from an 18-point deficit. Phoenix was playing without starters Deandre Ayton and Jae Crowder, as well as coach Monty Williams, all on the COVID-19 protocol list."}
{"game_id": "0022100505", "chunk_id": "0022100505_007", "order": 7, "role": "body", "text": "After a timeout, Morant drove the left side of the lane and banked it in. Phoenix’s final shot from the corner was off the mark."}
{"game_id": "0022100505", "chunk_id": "0022100505_008", "order": 8, "role": "body", "text": "“You have to make decisions on the fly. The main objective was to keep the ball away from him, but we kind of let him get (to the) left,” the Suns' Cameron Johnson said."}
{"game_id": "0022100505", "chunk_id": "0022100505_009", "order": 9, "role": "body", "text": "Kevin Young, who filled in for Williams as the Suns coach, credited Morant but said there was “a little bit of a defensive miscommunication” on the play."}
{"game_id": "0022100505", "chunk_id": "0022100505_010", "order": 10, "role": "body", "text": "“We were throwing a lot at him and kudos to him for making that play.”"}
{"game_id": "0022100505", "chunk_id": "0022100505_011", "order": 11, "role": "body", "text": "Steven Adams had 13 points and 16 rebounds — nine on the offensive glass — as the Grizzlies dominated the boards, 50-35. Memphis played without Dillon Brooks, Jarrett Culver, De’Anthony Melton and Yves Pons, all in the protocols."}
{"game_id": "0022100505", "chunk_id": "0022100505_012", "order": 12, "role": "body", "text": "Booker led the Suns with 30 points. The Suns lost their second straight at home following the Christmas defeat to Golden State. The Suns had won 15 in a row in Phoenix after losing their first two at home this season."}
{"game_id": "0022100505", "chunk_id": "0022100505_013", "order": 13, "role": "body", "text": "Johnson scored 19 for the Suns. Jalen Smith had 15 points and nine rebounds. Cam Payne also scored 15 and Chris Paul had 13 points and 13 assists."}
{"game_id": "0022100505", "chunk_id": "0022100505_014", "order": 14, "role": "body", "text": "JaVale McGee, who started in place of Ayton, scored six points and fouled out."}
{"game_id": "0022100505", "chunk_id": "0022100505_016", "order": 16, "role": "body", "text": "Young, 40, has been an assistant with the Suns and the 76ers, where he worked with Williams. He began his coaching career when he was 23, with the Shamrock Rovers in Dublin in the Ireland Super League. He also has coached three teams in the NBA Development League."}
{"game_id": "0022100505", "chunk_id": "0022100505_017", "order": 17, "role": "body", "text": "Young referenced his time in the D-League when he was asked about dealing with the sudden lineup changes, remembering a time when three of his players were called up to the NBA within an hour."}
{"game_id": "0022100505", "chunk_id": "0022100505_018", "order": 18, "role": "body", "text": "As a result, he knew to expect the unexpected."}
{"game_id": "0022100505", "chunk_id": "0022100505_019", "order": 19, "role": "body", "text": "“You see what’s going on (with the virus), you just start kind of mentally preparing for things like this,” Young said before the game."}
{"game_id": "0022100505", "chunk_id": "0022100505_020", "order": 20, "role": "body", "text": "“Everyone’s going through the same thing. You kind of get lost in the task at hand, you got a job to do and I think that’s the approach we’ve all taken. Just keep it simple.”"}
{"game_id": "0022100505", "chunk_id": "0022100505_021", "order": 21, "role": "body", "text": "Jenkins says his team doesn’t worry about the opponent in the moment. “If things have to change a little bit, our guys are really good at changing on the fly.”"}
{"game_id": "0022100505", "chunk_id": "0022100505_023", "order": 23, "role": "body", "text": "Grizzlies: Have 10 or more steals in 13 of their last 14 games. The Grizzlies entered Monday leading the NBA in steals with 10.4 per game."}
{"game_id": "0022100505", "chunk_id": "0022100505_024", "order": 24, "role": "body", "text": "Suns: Signed forward Emanuel Terry to a 10-day contract Monday. Terry, who is 6-9, played in two games with the Suns during 2018-19, and was playing for the G League Stockton Kings this season... Booker is four points shy of 10,000 in his career; if he reaches it in the Suns' next game, he would be the sixth youngest NBA player to reach the milestone. He turned 25 in October."}
{"game_id": "0022100505", "chunk_id": "0022100505_026", "order": 26, "role": "body", "text": "Grizzlies: Host the Los Angeles Lakers on Wednesday."}
{"game_id": "0022100505", "chunk_id": "0022100505_027", "order": 27, "role": "closing", "text": "Suns: Host Oklahoma City on Wednesday."}
