{"game_id": "0022100686", "chunk_id": "0022100686_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — The 76ers lost the lead — and then their cool."}
{"game_id": "0022100686", "chunk_id": "0022100686_002", "order": 2, "role": "body", "text": "Reggie Jackson scored 19 points, including two free throws with 18.2 seconds remaining, and the Los Angeles Clippers rallied from a 24-point second-half deficit to beat Joel Embiid and Philadelphia 102-101 on Friday night."}
{"game_id": "0022100686", "chunk_id": "0022100686_003", "order": 3, "role": "body", "text": "Sixers coach Doc Rivers was asked how much of the loss could be attributed to coaching. He didn't take it well, saying San Antonio's Gregg Popovich would never have to fend off the suggestion he blew a game for his team."}
{"game_id": "0022100686", "chunk_id": "0022100686_004", "order": 4, "role": "body", "text": "“Would you ask Pop that question? No you wouldn’t,” Rivers said. “So don’t ask me that question. I’ve earned that.”"}
{"game_id": "0022100686", "chunk_id": "0022100686_005", "order": 5, "role": "body", "text": "Rivers has won more than 1,000 games in 23 seasons, including a title with the Celtics in 2008. But he’s received a lukewarm reception in Philadelphia in 1 1/2 seasons, not helped by the top-seeded Sixers’ surprising second-round playoff exit last season to Atlanta and his comments after the series about Ben Simmons that likely played a part in the three-time All-Star demanding a trade and remaining away from the team all season."}
{"game_id": "0022100686", "chunk_id": "0022100686_006", "order": 6, "role": "body", "text": "Philadelphia fans didn’t turn against Rivers for saying he didn't know if Simmons could lead the team to a title — much of their ire has been directed at Simmons, actually — but they quickly lashed out at their coach on social media following his reply on Friday night."}
{"game_id": "0022100686", "chunk_id": "0022100686_007", "order": 7, "role": "body", "text": "“Honestly, we just blew this one and we all know that in the locker room,” Tobias Harris said."}
{"game_id": "0022100686", "chunk_id": "0022100686_008", "order": 8, "role": "body", "text": "Nicolas Batum had 15 points, seven rebounds and a key steal late in the game for the Clippers. Los Angeles, playing the second of an eight-game, 13-day trip, won for the second time in its last five games."}
{"game_id": "0022100686", "chunk_id": "0022100686_009", "order": 9, "role": "body", "text": "“Just keep scrapping like this team has been doing all year,” Clippers coach Tyronn Lue said. “That’s our motto: Just scrap to the finish. We all just stayed with it. It was a team win.”"}
{"game_id": "0022100686", "chunk_id": "0022100686_010", "order": 10, "role": "body", "text": "Embiid, who tied his career high with 50 points on Wednesday night, had 40 points, 13 rebounds and six assists. Harris added 20 points and Tyrese Maxey had 19 points and eight assists for Philadelphia, which lost for the third time in its last 12."}
{"game_id": "0022100686", "chunk_id": "0022100686_011", "order": 11, "role": "body", "text": "“We got to be better prepared,” Embiid said. “We got to know our assignments. We just got to be focused.”"}
{"game_id": "0022100686", "chunk_id": "0022100686_012", "order": 12, "role": "body", "text": "Marcus Morris’ 3 with 1:52 left tied it at 96. Batum stripped Embiid on Philadelphia’s ensuing possession, and Ivica Zubac’s layup put the Clippers up 98-96 with 1:30 remaining."}
{"game_id": "0022100686", "chunk_id": "0022100686_013", "order": 13, "role": "body", "text": "Los Angeles stretched its lead to 100-97 on Amir Coffey’s 8-footer with 39.7 seconds to play. Embiid then made a pair of free throws with 22 seconds remaining. Jackson then sank his free throws for LA. Up 3, the Clippers let Embiid go in for an easy layup."}
{"game_id": "0022100686", "chunk_id": "0022100686_014", "order": 14, "role": "body", "text": "The 76ers quickly fouled Morris, who missed both free throws with 9.4 seconds left, but Maxey’s runner at the buzzer was short."}
{"game_id": "0022100686", "chunk_id": "0022100686_015", "order": 15, "role": "body", "text": "Embiid started slowly but heated up in the second quarter."}
{"game_id": "0022100686", "chunk_id": "0022100686_016", "order": 16, "role": "body", "text": "First, the nearly unguardable 7-footer hit a 3-pointer. Then, he stole the ball, dribbled coast to coast and, looking like Magic Johnson in his heyday, beat the defense single-handedly and finished with a one-handed dunk. On the next possession, he faked a drive, then pulled back and smoothly swished a 16-footer."}
{"game_id": "0022100686", "chunk_id": "0022100686_017", "order": 17, "role": "body", "text": "Late in the quarter, Embiid flew past Isaiah Hartenstein for a too-easy, two-handed dunk, helping the Sixers turn their seven-point first-quarter deficit into a 54-40 halftime lead. Philadelphia extended its advantage to 68-44 when Harris made a pair of free throws with 7:39 left in the third."}
{"game_id": "0022100686", "chunk_id": "0022100686_018", "order": 18, "role": "body", "text": "It looked like the 76ers had the game in control, but the Clippers clawed back."}
{"game_id": "0022100686", "chunk_id": "0022100686_020", "order": 20, "role": "body", "text": "Lue was happy to be in Philadelphia to visit with Rivers, his coaching mentor. Lue played for Rivers in Orlando from 2003-04."}
{"game_id": "0022100686", "chunk_id": "0022100686_021", "order": 21, "role": "body", "text": "“He thought I was going to be a coach before I knew I was going to be a coach,” Lue said."}
{"game_id": "0022100686", "chunk_id": "0022100686_022", "order": 22, "role": "body", "text": "Rivers hired Lue as an assistant in Boston in 2011. Lue entered Friday 197-132 in six seasons as a head coach with the Clippers and in Cleveland, where he won the NBA title in 2016."}
{"game_id": "0022100686", "chunk_id": "0022100686_023", "order": 23, "role": "body", "text": "“He gave me my first opportunity,” said Lue, who succeeded Rivers as Clippers coach in 2020. “Someone that’s mentored me my whole coaching career and someone I look up to, so it’s just good to see him.”"}
{"game_id": "0022100686", "chunk_id": "0022100686_025", "order": 25, "role": "body", "text": "Clippers: Batum returned to the lineup after missing Wednesday’s game against Denver due to health and safety protocols. ... Paul George (right elbow) has missed the last 15 games, and Kawhi Leonard (right knee) hasn’t played all season."}
{"game_id": "0022100686", "chunk_id": "0022100686_026", "order": 26, "role": "body", "text": "76ers: Danny Green (right hip) missed his fifth in a row, Matisse Thybulle (right shoulder) his fourth straight and Shake Milton (back) his ninth. Seth Curry (ankle) also was out."}
{"game_id": "0022100686", "chunk_id": "0022100686_028", "order": 28, "role": "body", "text": "Morris was back on the court after sitting out Wednesday due to personal reasons. The Philadelphia native had 12 points and nine rebounds. ... The teams’ second meeting this season will be March 25 in Los Angeles. ... Instead of a morning shootaround, the Clippers did a walkthrough in their hotel."}
{"game_id": "0022100686", "chunk_id": "0022100686_030", "order": 30, "role": "body", "text": "Clippers: At the New York Knicks on Sunday."}
{"game_id": "0022100686", "chunk_id": "0022100686_031", "order": 31, "role": "body", "text": "76ers: At San Antonio on Sunday."}
