{"game_id": "0022100916", "chunk_id": "0022100916_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Reggie Jackson scored 26 points, including three key points down the stretch to lead the Los Angeles Clippers to a 99-98 victory over the Houston Rockets on Sunday night to open a two-game series."}
{"game_id": "0022100916", "chunk_id": "0022100916_002", "order": 2, "role": "body", "text": "Jackson's jumper with about 90 seconds left put the Clippers up 97-95."}
{"game_id": "0022100916", "chunk_id": "0022100916_003", "order": 3, "role": "body", "text": "Both teams missed shots before Houston's Christian Wood was fouled by Ivica Zubac on a shot in the lane with about 16 seconds to go. The Clippers challenged the call, and it was overturned, giving them the ball back and giving Zubac his career-high sixth block of the game."}
{"game_id": "0022100916", "chunk_id": "0022100916_004", "order": 4, "role": "body", "text": "The Rockets intentionally fouled Jackson with 11.3 seconds left and he made 1 of 2 free throws to make it 98-95."}
{"game_id": "0022100916", "chunk_id": "0022100916_005", "order": 5, "role": "body", "text": "“Reggie was good, especially there in the fourth quarter,” coach Tyronn Lue said. “He made every right play. He lives for those moments and he was able to bring us home.”"}
{"game_id": "0022100916", "chunk_id": "0022100916_006", "order": 6, "role": "body", "text": "Jackson deflected credit to the guys playing around him for his success."}
{"game_id": "0022100916", "chunk_id": "0022100916_007", "order": 7, "role": "body", "text": "“We’re playing great team ball,\" he said. “It’s not an individual thing. It’s my teammates doing everything right. They’re allowing the floor to be opened up."}
{"game_id": "0022100916", "chunk_id": "0022100916_008", "order": 8, "role": "body", "text": "Jalen Green, the second overall pick in the most recent draft, had a chance to tie it after that, but his 3-point attempt clanged off the rim."}
{"game_id": "0022100916", "chunk_id": "0022100916_009", "order": 9, "role": "body", "text": "Amir Coffey made 1 of 2 free throws with 4.7 seconds left to extend it to 99-95, and his free throws was an important shot as Garrison Mathews hit a 3 with a second left."}
{"game_id": "0022100916", "chunk_id": "0022100916_010", "order": 10, "role": "body", "text": "The teams will meet again Tuesday night in Houston."}
{"game_id": "0022100916", "chunk_id": "0022100916_011", "order": 11, "role": "body", "text": "Houston led by 13 points in the first half and was up nine early in the fourth before the Clippers used a big run to take the lead. The teams exchanged leads several times after that before Los Angeles closed it out late to extend its winning streak to three games."}
{"game_id": "0022100916", "chunk_id": "0022100916_012", "order": 12, "role": "body", "text": "Mathews had 17 points off the bench for the Rockets, and Dennis Schroder added 11 points, 10 assists and eight rebounds in his fifth game since a trade from Boston. Houston has lost nine straight and 13 of 14."}
{"game_id": "0022100916", "chunk_id": "0022100916_013", "order": 13, "role": "body", "text": "Coach Stephen Silas was encouraged that his team had just six turnovers after struggling with ball security this season."}
{"game_id": "0022100916", "chunk_id": "0022100916_014", "order": 14, "role": "body", "text": "“The turnovers were really good,\" he said. “As we look at this season, the turnovers have been one of the biggest separators as far as our offense is concerned and not doing it tonight kept us in the game.\""}
{"game_id": "0022100916", "chunk_id": "0022100916_015", "order": 15, "role": "body", "text": "Kenyon Martin Jr. made a 3 to start the fourth and extend Houston’s lead to 83-74."}
{"game_id": "0022100916", "chunk_id": "0022100916_016", "order": 16, "role": "body", "text": "But the Clippers scored the next 13 points take an 87-83 lead with about nine minutes to go. Luke Kennard, who made a career-high eight 3s in a 142-111 win over the Rockets Feb. 17, had his first 3 during that run after missing his first five tries."}
{"game_id": "0022100916", "chunk_id": "0022100916_017", "order": 17, "role": "body", "text": "The Rockets scored their first points in almost three minutes after that on two free throws by Mathews that were the start of a 5-0 run that put them on top 88-87."}
{"game_id": "0022100916", "chunk_id": "0022100916_018", "order": 18, "role": "body", "text": "A 3-pointer by Jackson gave Los Angeles the lead with about four minutes to go. But a 3 by Mathews tied it at 94-all a few seconds later."}
{"game_id": "0022100916", "chunk_id": "0022100916_019", "order": 19, "role": "body", "text": "The Rockets were up by 3 late in the third quarter before Alperen Sengun made a 3-pointer just before the buzzer to make it 80-74 entering the fourth."}
{"game_id": "0022100916", "chunk_id": "0022100916_021", "order": 21, "role": "body", "text": "Clippers: Former Rocket Isaiah Hartenstein had 12 points and four rebounds. ... Zubac had 14 points and 15 rebounds. ... Marcus Morris had 13 points."}
{"game_id": "0022100916", "chunk_id": "0022100916_022", "order": 22, "role": "body", "text": "Rockets: Kevin Porter Jr. missed the game with a sprained left ankle. ... Sengun had 15 points and three rebounds off the bench. ... Wood scored 15 points with seven rebounds. ... Houston made 17 3-pointers."}
{"game_id": "0022100916", "chunk_id": "0022100916_024", "order": 24, "role": "body", "text": "Lue on Zubac's performance: “It was huge. He was dominant inside the paint. I thought his play around the basket was huge for us.\""}
