{"game_id": "0022101006", "chunk_id": "0022101006_001", "order": 1, "role": "lead", "text": "CHICAGO -- — Alex Caruso returned to the rotation, and the Chicago Bulls went back to their disruptive ways."}
{"game_id": "0022101006", "chunk_id": "0022101006_003", "order": 3, "role": "body", "text": "DeMar DeRozan scored 25 points, Nikola Vucevic added 20 points and 14 rebounds, and the Bulls beat the Cleveland Cavaliers 101-91 on Saturday night."}
{"game_id": "0022101006", "chunk_id": "0022101006_004", "order": 4, "role": "body", "text": "Ayo Dosunmu made three 3-pointers and finished with 17 points. Caruso made a big impact on defense in his return from a broken right wrist that kept him out of the previous 22 games, and Chicago held an opponent below 100 points for the first time since he was injured."}
{"game_id": "0022101006", "chunk_id": "0022101006_005", "order": 5, "role": "body", "text": "“How vocal he is, his leadership, that helps us overall and it helps us get better and better each time,\" Dosunmu said. “The thing I love about Alex is not only is he willing to give out so much wisdom and words of encouragement, he also is willing to take it. That's what makes him very unique.”"}
{"game_id": "0022101006", "chunk_id": "0022101006_006", "order": 6, "role": "body", "text": "The Bulls came away with their second straight win after losing five in a row even though they were missing Zach LaVine. The two-time All-Star was sidelined because of lingering soreness in his left knee."}
{"game_id": "0022101006", "chunk_id": "0022101006_007", "order": 7, "role": "body", "text": "Darius Garland led Cleveland with 25 points, though he was 9 of 24 from the field. Evan Mobley had 17 points and seven rebounds."}
{"game_id": "0022101006", "chunk_id": "0022101006_008", "order": 8, "role": "body", "text": "DeRozan shot just 9 of 26 in the game, but the five-time All-Star scored 17 points in the first half, including nailing a buzzer-beating jumper from the wing over Isaac Okoro and Kevin Love. That sent Chicago to the locker room with a 53-42 lead, and the Bulls remained in control the rest of the way."}
{"game_id": "0022101006", "chunk_id": "0022101006_009", "order": 9, "role": "body", "text": "Vucevic recorded his 38th double-double. Caruso added 11 points and four steals in his first appearance since he was injured at Milwaukee on Jan. 21. And the Bulls came out on top in a matchup of teams jockeying for playoff positioning in the crowded Eastern Conference."}
{"game_id": "0022101006", "chunk_id": "0022101006_010", "order": 10, "role": "body", "text": "“It felt great,” Caruso said. “I'm excited to just play basketball again. Caught myself just walking onto the court for pregame warmups just kind of smiling, just excited to be out there. When the game started, I was standing up for random plays that probably didn't need to be cheered for.”"}
{"game_id": "0022101006", "chunk_id": "0022101006_012", "order": 12, "role": "body", "text": "Cleveland lost for the second time in as many nights after falling at Miami on Friday."}
{"game_id": "0022101006", "chunk_id": "0022101006_013", "order": 13, "role": "body", "text": "“I just felt like they were the aggressor tonight,” said Love, who had 10 points and 11 rebounds. “You've got to tip your hat to the Bulls. Great all season. Obviously, Miami and Chicago back to back is not easy. I think you saw it in our energy level tonight, us just trying to find and manufacture some offense.”"}
{"game_id": "0022101006", "chunk_id": "0022101006_015", "order": 15, "role": "body", "text": "Cavaliers: The Cavaliers lost for the eighth time in 11 games. ... F Lauri Markkanen missed the game because of a sore right ankle after tweaking it in Friday’s loss at Miami. The 7-footer from Finland missed 11 games in late January and February because of a sprained right ankle. ... All-Star C Jarrett Allen (broken finger on his left hand) missed his third game in a row. ... The Cavaliers were 5 of 24 on 3-pointers."}
{"game_id": "0022101006", "chunk_id": "0022101006_016", "order": 16, "role": "body", "text": "Bulls: Caruso got a nice ovation when he checked into the game midway through the first quarter. He missed 22 games after he got knocked to the floor by Milwaukee’s Grayson Allen, resulting in an injury that required surgery. ... The fact LaVine wasn’t able to play even though they had two days off after winning at Detroit on Wednesday to stop a five-game losing streak did not seem to raise extra alarms for coach Billy Donovan. “It’s not necessarily him regressing,” Donovan said. “It’s just something that he’s going to have to manage and deal with throughout the course of the season.” Lavine missed the final three games before the All-Star break. The high-flying guard had platelet-rich plasma therapy, a cortisone injection and fluid drained in Los Angeles, hoping the treatment will help him get through the remainder of the season. ... Chicago was 14 of 15 from the foul line, with DeRozan making all seven attempts."}
{"game_id": "0022101006", "chunk_id": "0022101006_018", "order": 18, "role": "body", "text": "Cavaliers: Host the Los Angeles Clippers on Monday."}
{"game_id": "0022101006", "chunk_id": "0022101006_019", "order": 19, "role": "body", "text": "Bulls: Visit Sacramento on Monday."}
