{"game_id": "0022100486", "chunk_id": "0022100486_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — Anfernee Simons had 23 points and 11 assists, and the short-handed Portland Trail Blazers took advantage of James Harden's absence for a 114-108 victory over the Brooklyn Nets on Monday night."}
{"game_id": "0022100486", "chunk_id": "0022100486_002", "order": 2, "role": "body", "text": "Harden was out with a hyperextended left knee. Kyrie Irving started in his second game of the season and finished with 22 points. Kevin Durant led all scorers with 28 points and 10 rebounds for the Nets."}
{"game_id": "0022100486", "chunk_id": "0022100486_003", "order": 3, "role": "body", "text": "Robert Covington had 21 points, including five 3-pointers, for the Blazers, who saw all five starters score in double figures."}
{"game_id": "0022100486", "chunk_id": "0022100486_004", "order": 4, "role": "body", "text": "Simons said Covington's play against Durant boosted the team."}
{"game_id": "0022100486", "chunk_id": "0022100486_005", "order": 5, "role": "body", "text": "“I think RoCo did a good job of playing him the second half,” Simons said. “So that was that was big for us to slow him down and just kind of play team defense. We’ve been playing very hard, we’ve been making a lot less mistakes on defense. That’s been helping us.”"}
{"game_id": "0022100486", "chunk_id": "0022100486_006", "order": 6, "role": "body", "text": "Monday’s game was originally scheduled for Dec. 23 but was postponed because of COVID-19 issues. In making up the game, both teams were playing the second of back-to-backs."}
{"game_id": "0022100486", "chunk_id": "0022100486_007", "order": 7, "role": "body", "text": "Portland led 87-81 going into the final quarter. Covington's 3-pointer put Portland up 107-100 with 2:15 to go but the Nets closed within 110-105 down the stretch."}
{"game_id": "0022100486", "chunk_id": "0022100486_008", "order": 8, "role": "body", "text": "Ben McLemore's 3 with 31.9 seconds left made it 113-105 and sealed it for Portland. McLemore finished with 20 points and five 3s."}
{"game_id": "0022100486", "chunk_id": "0022100486_009", "order": 9, "role": "body", "text": "“Certainly nobody in the world thought that we would win this game with the guys that we have missing, even though they're missing some important players too,” Portland first-year coach Chauncey Billups said. “I'm more happy than anything for our team, to be honest. We've suffered a lot of losses in this building, a lot of bad losses.”"}
{"game_id": "0022100486", "chunk_id": "0022100486_010", "order": 10, "role": "body", "text": "The Blazers again were without Damian Lillard, out with lower abdominal tendinopathy, and backcourt teammate CJ McCollum, who has been out for 14 games after a collapsed lung. Fellow starters Norman Powell (COVID-19 protocols) and Larry Nance Jr. (right knee) were also out for Portland."}
{"game_id": "0022100486", "chunk_id": "0022100486_011", "order": 11, "role": "body", "text": "Meanwhile, Nets coach Steve Nash said the team was being cautious with Harden in a dense stretch of games and that Harden should be available on Wednesday at Chicago."}
{"game_id": "0022100486", "chunk_id": "0022100486_012", "order": 12, "role": "body", "text": "Irving, who has refused to get the COVID-19 vaccine and is barred from playing in New York due to the city’s vaccine mandate, has resumed playing on the road. For his first game last week at Indiana, he finished with 22 points in nearly 32 minutes."}
{"game_id": "0022100486", "chunk_id": "0022100486_013", "order": 13, "role": "body", "text": "“It felt like I made a few good moves, but now it's just getting back in that NBA action of that athleticism and catching up to that speed, that’s really what it is at this point, I feel,” Irving said."}
{"game_id": "0022100486", "chunk_id": "0022100486_014", "order": 14, "role": "body", "text": "Irving appeared to tweak his ankle in the fourth quarter but afterward said he was fine and would play Wednesday. He criticized Portland's Nassir Little for diving on the play: “I tried to get out of the way but I just felt like it was unnecessary for him to dive that far away from the ball.\""}
{"game_id": "0022100486", "chunk_id": "0022100486_015", "order": 15, "role": "body", "text": "Brooklyn led 62-55 at the break, paced by Durant with 20 points. It was his 19th straight game with 20 or more points, the second-longest streak of 20-point games in Nets history."}
{"game_id": "0022100486", "chunk_id": "0022100486_016", "order": 16, "role": "body", "text": "“Second half, they hit 3s in that third quarter, they hit 3s in that fourth quarter. You gotta give them credit for knocking down shots but I thought we were there, intentions were good,\" Durant said. “We've just got to finish it a little better, finish plays a little better.”"}
{"game_id": "0022100486", "chunk_id": "0022100486_018", "order": 18, "role": "body", "text": "The Nets arrived in Portland late Sunday after wrapping up the win over the Spurs and flying across the country. Then there's another long flight ahead for Wednesday night's game at the Bulls. And on Thursday, they're back at home against the Thunder."}
{"game_id": "0022100486", "chunk_id": "0022100486_019", "order": 19, "role": "body", "text": "The Nets are playing four games in five days, and five games in the next seven days."}
{"game_id": "0022100486", "chunk_id": "0022100486_020", "order": 20, "role": "body", "text": "“I think it's really important for us to take day-by-day right now. I know that's a cliche, but I think that is the smartest way to approach this,” Nash said."}
{"game_id": "0022100486", "chunk_id": "0022100486_022", "order": 22, "role": "body", "text": "Nets: Joining Harden on the Nets’ injury report was former Blazer LaMarcus Aldridge, who has a sore right foot and also missed the game against the Spurs. ... The Nets lead the league with a 15-4 road record."}
{"game_id": "0022100486", "chunk_id": "0022100486_023", "order": 23, "role": "body", "text": "Trail Blazers: Portland was coming off a 103-88 victory at home over Sacramento on Sunday night. ... Simons made a seemingly impossible layup to end the first half, going up against two defenders and throwing the ball up behind his back."}
{"game_id": "0022100486", "chunk_id": "0022100486_025", "order": 25, "role": "body", "text": "Nets: Visit Chicago on Wednesday."}
{"game_id": "0022100486", "chunk_id": "0022100486_026", "order": 26, "role": "body", "text": "Trail Blazers: Kick off a six-game road trip at Denver on Wednesday."}
