{"game_id": "0022100920", "chunk_id": "0022100920_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Karl-Anthony Towns wasn't shooting for a trophy or title. This time, his clutch 3-pointer saved the Timberwolves."}
{"game_id": "0022100920", "chunk_id": "0022100920_002", "order": 2, "role": "body", "text": "On the same floor where he recently won the NBA's 3-point Contest during All-Star Weekend, Towns drained a 27-footer with 11.8 seconds left as the Timberwolves survived Cleveland's comeback for a 127-122 win over the Cavaliers on Monday night."}
{"game_id": "0022100920", "chunk_id": "0022100920_003", "order": 3, "role": "body", "text": "“I was ready for the moment,” Towns said."}
{"game_id": "0022100920", "chunk_id": "0022100920_004", "order": 4, "role": "body", "text": "The 7-footer's first 3 of the game helped the Timberwolves hang on after blowing a 23-point third-quarter lead. One of the league's best outside shooters, Towns became the first center to win the 3-point contest, surprising a field of seven guards."}
{"game_id": "0022100920", "chunk_id": "0022100920_005", "order": 5, "role": "body", "text": "“Oh, yeah,” he said with a smile when asked if he likes shooting at Rocket Mortgage FieldHouse. “This building has great memories for me.”"}
{"game_id": "0022100920", "chunk_id": "0022100920_006", "order": 6, "role": "body", "text": "Towns missed his first three 3-point attempts before taking a pass from guard D'Angelo Russell and calmly knocking down his winner over Cedi Osman. Towns had been surprised his first three 3-point attempts were off the mark."}
{"game_id": "0022100920", "chunk_id": "0022100920_007", "order": 7, "role": "body", "text": "“The fourth,\" he said, \"was cash money.”"}
{"game_id": "0022100920", "chunk_id": "0022100920_008", "order": 8, "role": "body", "text": "Russell scored 25 points, and Towns and Anthony Edwards added 17 apiece as Minnesota handed Cleveland its first home loss in nearly two months."}
{"game_id": "0022100920", "chunk_id": "0022100920_009", "order": 9, "role": "body", "text": "Kevin Love led the Cavaliers with 26 points, Jarrett Allen had 21 and rookie Evan Mobley had 15 and 10 rebounds."}
{"game_id": "0022100920", "chunk_id": "0022100920_010", "order": 10, "role": "body", "text": "Cleveland’s trying to scrape by without All-Star guard Darius Garland, who is sidelined with a bone bruise, and the Cavs are also missing guards Rajon Rondo (sprained toe) and Caris LeVert (sprained foot)."}
{"game_id": "0022100920", "chunk_id": "0022100920_011", "order": 11, "role": "body", "text": "Brandon Goodwin had 17 points, 12 assists and just one turnover in 35 minutes for the Cavs while starting in Garland’s spot."}
{"game_id": "0022100920", "chunk_id": "0022100920_012", "order": 12, "role": "body", "text": "Jaden McDaniels made a career-high five 3s and added 17 for the Timberwolves, who opened the third quarter with a 26-7 run and built a 98-75 lead with 2:44 left in the third."}
{"game_id": "0022100920", "chunk_id": "0022100920_013", "order": 13, "role": "body", "text": "It appeared Minnesota would coast to an easy win, but the Cavs, who have had to persevere through major injuries all season, wouldn't quit."}
{"game_id": "0022100920", "chunk_id": "0022100920_014", "order": 14, "role": "body", "text": "With Love leading the way, Cleveland battled all the way back and tied it 122-all on Osman's 3-pointer with 33.8 seconds left."}
{"game_id": "0022100920", "chunk_id": "0022100920_015", "order": 15, "role": "body", "text": "But on Minnesota's next possession, Towns, who badly missed a 31-footer moments earlier, hit his go-ahead bucket from the top of the key."}
{"game_id": "0022100920", "chunk_id": "0022100920_016", "order": 16, "role": "body", "text": "“KAT is such a good shooter, I always think the shot is going in, no matter if he hasn’t shot it in two quarters or whatever,” Minnesota coach Chris Finch said. ”We went pick-and-roll to see if we could find KAT on the pop. He decided just to rise up and put up the shot."}
{"game_id": "0022100920", "chunk_id": "0022100920_017", "order": 17, "role": "body", "text": "\"KAT is big-time, so he can get his shot off against anyone — and it was a tough shot.”"}
{"game_id": "0022100920", "chunk_id": "0022100920_018", "order": 18, "role": "body", "text": "Osman was way off with a 3-pointer with 4.6 seconds to go and Russell iced the win with two free throws."}
{"game_id": "0022100920", "chunk_id": "0022100920_019", "order": 19, "role": "body", "text": "Cleveland lost at home for the first time since Jan. 4, ending an eight-game win streak."}
{"game_id": "0022100920", "chunk_id": "0022100920_020", "order": 20, "role": "body", "text": "“We've been in that situation a couple times before,\" Osman said. “We never gave up. We're upset we lost because we fought really hard. I apologize for that last shot. I have to be better in those positions.”"}
{"game_id": "0022100920", "chunk_id": "0022100920_022", "order": 22, "role": "body", "text": "Timberwolves: G Malik Beasley (illness) returned after missing one game. ... G McKinley Wright IV (left elbow) and G Leando Bolmaro (G League assignment with Iowa) were inactive. ... Finch spent two seasons in the G League, taking Rio Grande to the finals both years. “I believe it’s the third-best league in the world behind the EuroLeague,” Finch said. “It’s one of the best things the NBA has ever done.”"}
{"game_id": "0022100920", "chunk_id": "0022100920_023", "order": 23, "role": "body", "text": "Cavaliers: Committed 22 turnovers. ... Didn't get a rebound for the first 9:50 of the second quarter. ... Allen has a career-high 31 double-doubles, tying him for the third most in the East with Philadelphia’s James Harden. ... Love holds the Timberwolves record with 190 3-pointers in a season, set eight years ago. He spent his first six seasons with Minnesota."}
{"game_id": "0022100920", "chunk_id": "0022100920_025", "order": 25, "role": "body", "text": "The Cavs have embraced an underdog’s mentality all season, which has led to players barking before, during and after games."}
{"game_id": "0022100920", "chunk_id": "0022100920_026", "order": 26, "role": "body", "text": "Coach J.B. Bickerstaff ramped up the canine connection last weekend by awarding a bejeweled “Junkyard Dog” chain to Isaac Okoro for his shut-down defense in a win over Washington. The award will be given to a Cavs player after each victory."}
{"game_id": "0022100920", "chunk_id": "0022100920_027", "order": 27, "role": "body", "text": "“It’s cool,” said Mobley, who believes the chain will be an incentive. “I feel like guys will go even harder.”"}
{"game_id": "0022100920", "chunk_id": "0022100920_029", "order": 29, "role": "body", "text": "Timberwolves: Host Golden State on Tuesday."}
{"game_id": "0022100920", "chunk_id": "0022100920_030", "order": 30, "role": "body", "text": "Cavaliers: Host Charlotte on Wednesday."}
