{"game_id": "0022100245", "chunk_id": "0022100245_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — D’Angelo Russell scored 28 points, Anthony Edwards added 23 and the Minnesota Timberwolves cruised to their third straight win, a 138-95 victory over the Memphis Grizzlies on Saturday night."}
{"game_id": "0022100245", "chunk_id": "0022100245_002", "order": 2, "role": "body", "text": "Karl-Anthony Towns finished with 21 points in a game Minnesota led by as many as 45, its biggest lead in a game this season and the Grizzlies’ largest deficit."}
{"game_id": "0022100245", "chunk_id": "0022100245_003", "order": 3, "role": "body", "text": "Edwards started the blowout with 17 points in the first quarter. He was 5 of 5 on 3-point attempts and added a soaring dunk to bring the crowd to its feet."}
{"game_id": "0022100245", "chunk_id": "0022100245_004", "order": 4, "role": "body", "text": "“I feel like once I hit one shot, it’s over for anybody. It don’t matter. Once I hit the first one,\" Edwards said. \"Think about a basketball player, right, like me. I’m known for getting to the rim and layups. But once my 3-ball fall, you're all in trouble. My first shot was a 3 and I made it, so nothing else was on my mind but they're in trouble now.”"}
{"game_id": "0022100245", "chunk_id": "0022100245_005", "order": 5, "role": "body", "text": "From there, Russell took control with his most efficient outing of the season. Russell shot 9 of 15 from the field and was 4 of 9 from 3. He added five assists and four rebounds."}
{"game_id": "0022100245", "chunk_id": "0022100245_006", "order": 6, "role": "body", "text": "Ja Morant tied a season low with 11 points for Memphis, which had won two in a row."}
{"game_id": "0022100245", "chunk_id": "0022100245_007", "order": 7, "role": "body", "text": "“They punked us tonight,” Grizzlies coach Taylor Jenkins said. “In three seasons, it’s probably one of the least competitive games we’ve ever had. It’s completely unacceptable.”"}
{"game_id": "0022100245", "chunk_id": "0022100245_008", "order": 8, "role": "body", "text": "Entering the day eighth in the NBA in scoring at 26.0 points per game, Morant was just 3 of 9 from the field. He didn’t score his first basket until 5:12 remained in the first half and finished with five points in the half as the Wolves led by as many as 31."}
{"game_id": "0022100245", "chunk_id": "0022100245_009", "order": 9, "role": "body", "text": "“I’m not a shot hunter, but I guess I should have done that tonight in certain situations; played better defensively with more energy,” Morant said. “Pretty much what we have to do.”"}
{"game_id": "0022100245", "chunk_id": "0022100245_010", "order": 10, "role": "body", "text": "Desmond Bane scored 21 points for the Grizzlies. He kept Memphis in the game early, hitting his first three 3s in the first quarter."}
{"game_id": "0022100245", "chunk_id": "0022100245_011", "order": 11, "role": "body", "text": "Minnesota methodically pulled away, widening the advantage throughout."}
{"game_id": "0022100245", "chunk_id": "0022100245_013", "order": 13, "role": "body", "text": "The Wolves felt they made strides in a loss at home against Phoenix on Monday. Already playing improved defense, the offense had better execution and they followed with wins against Sacramento and San Antonio."}
{"game_id": "0022100245", "chunk_id": "0022100245_014", "order": 14, "role": "body", "text": "“We needed it,” Minnesota coach Chris Finch said of the 3-1 homestand. “We talked about coming back off that road trip and how our season in many ways restarted now. We had to start making up some ground, and get going here and take advantage of the schedule we have here at home. So, guys were very, very locked in and now we just have to maintain that.”"}
{"game_id": "0022100245", "chunk_id": "0022100245_016", "order": 16, "role": "body", "text": "Memphis has lost four of its past six games, but more troubling this season have been big losses. Five of the eight losses this season have been by at least 20 points and seven have been by double digits."}
{"game_id": "0022100245", "chunk_id": "0022100245_017", "order": 17, "role": "body", "text": "“We’re trying to get to the playoffs, I think we need to dial in,” Bane said. “I think we’ve done a pretty good job, had our lapses here and there, but it’s time to lock in, for sure.”"}
{"game_id": "0022100245", "chunk_id": "0022100245_019", "order": 19, "role": "body", "text": "Grizzlies: Dillon Brooks (right hamstring soreness) and De’Anthony Melton (right groin soreness) were inactive. Kyle Anderson started in place of Brooks and had two points in 20 minutes. … Memphis had won the last seven meetings between the teams, including two straight in Minnesota. … Morant had scored 20-plus points in six straight games."}
{"game_id": "0022100245", "chunk_id": "0022100245_020", "order": 20, "role": "body", "text": "Timberwolves: Josh Okogie missed his third straight game with back spasms. … Minnesota scored a season high in points and was 20 of 41 from 3. The plus-43 margin of victory is the second-largest in franchise history. The Wolves beat Chicago by 58, 127-74, on Nov. 8, 2001. … Russell, Edwards and Towns, Minnesota’s three leading players in minutes, sat the entire fourth quarter."}
{"game_id": "0022100245", "chunk_id": "0022100245_022", "order": 22, "role": "body", "text": "Grizzlies: Finish their road trip at Utah on Monday."}
{"game_id": "0022100245", "chunk_id": "0022100245_023", "order": 23, "role": "body", "text": "Timberwolves: Go on the road for one game Monday at New Orleans."}
