{"game_id": "0022100583", "chunk_id": "0022100583_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Back at the site of an overtime thriller in the playoffs, the Milwaukee Bucks quickly made clear this one wasn't going down to the wire."}
{"game_id": "0022100583", "chunk_id": "0022100583_002", "order": 2, "role": "body", "text": "Giannis Antetokounmpo scored 31 points in his return from a one-game absence, Khris Middleton added 15 of his 20 in the third quarter and the Bucks blew out the Brooklyn Nets 121-109 on Friday night."}
{"game_id": "0022100583", "chunk_id": "0022100583_003", "order": 3, "role": "body", "text": "Bobby Portis scored 20 of his 25 in the first half to help the Bucks snap a two-game skid. The last loss came without Antetokounmpo, who didn't play Wednesday night against Toronto because of an illness unrelated to COVID-19."}
{"game_id": "0022100583", "chunk_id": "0022100583_004", "order": 4, "role": "body", "text": "He added nine rebounds and seven assists in his return."}
{"game_id": "0022100583", "chunk_id": "0022100583_005", "order": 5, "role": "body", "text": "“He comes with the killer knockout blow,” acting coach Darvin Ham said. “Once he sees us in position, he knows what spots he wants to get to.”"}
{"game_id": "0022100583", "chunk_id": "0022100583_006", "order": 6, "role": "body", "text": "The Bucks are without coach Mike Budenholzer, point guard Jrue Holiday and a number of other key players because of coronavirus health and safety protocols."}
{"game_id": "0022100583", "chunk_id": "0022100583_007", "order": 7, "role": "body", "text": "“But at the end of the day, guys are ready to step up,” Antetokounmpo said."}
{"game_id": "0022100583", "chunk_id": "0022100583_008", "order": 8, "role": "body", "text": "Kevin Durant had 29 points, nine rebounds and seven assists for the Nets, who have lost five straight home games. James Harden finished with 16 points, nine rebounds and seven assists."}
{"game_id": "0022100583", "chunk_id": "0022100583_009", "order": 9, "role": "body", "text": "Brooklyn won Wednesday night in Indiana with Kyrie Irving making his season debut. He wasn't in the building Friday, ineligible to play home games because he hasn't been vaccinated against COVID-19 as mandated for New York City's professional athletes."}
{"game_id": "0022100583", "chunk_id": "0022100583_010", "order": 10, "role": "body", "text": "Harden said having Irving on Wednesday felt like having new life."}
{"game_id": "0022100583", "chunk_id": "0022100583_011", "order": 11, "role": "body", "text": "“But we got to live with what we’re dealt with, and that’s home games we’ve got to figure ways and even road games,” he said. “Just because Ky’s on the road with us doesn’t mean it’s going to be easy for us as well. So we’ve got to mesh and we’ve got to find ways to win games each individual time we play.”"}
{"game_id": "0022100583", "chunk_id": "0022100583_012", "order": 12, "role": "body", "text": "The Bucks won Game 7 of the Eastern Conference semifinals here in overtime."}
{"game_id": "0022100583", "chunk_id": "0022100583_013", "order": 13, "role": "body", "text": "This time, Portis scored 10 points in the first quarter, though it should have been 12. He missed a breakaway dunk with no Nets player anywhere near."}
{"game_id": "0022100583", "chunk_id": "0022100583_014", "order": 14, "role": "body", "text": "He had 10 more in the second, sending Milwaukee to the half with a 60-49 lead even though Antetokounmpo played just 2 1/2 minutes of the period before going to the bench with a third foul."}
{"game_id": "0022100583", "chunk_id": "0022100583_015", "order": 15, "role": "body", "text": "Middleton took over from there, making three 3-pointers — one while being fouled — during a 19-4 spurt in the third that extended a nine-point lead to 87-63 at the midway point of the period."}
{"game_id": "0022100583", "chunk_id": "0022100583_016", "order": 16, "role": "body", "text": "The Bucks scored 77 points in the first half Wednesday but then had just 11 in the third."}
{"game_id": "0022100583", "chunk_id": "0022100583_017", "order": 17, "role": "body", "text": "“Last two games specifically where we gave up leads,” Middleton said. “This one we were able to extend our lead, which was huge.”"}
{"game_id": "0022100583", "chunk_id": "0022100583_019", "order": 19, "role": "body", "text": "Bucks: Portis added 12 rebounds. ... Milwaukee signed guards Langston Galloway and Jeff Dowtin to 10-day hardship contracts Friday. Galloway recently finished a stint with the Nets, appearing in four games during two 10-day contracts. ... Ham, on being back at the site of the playoff thriller: “Great memories, but it’s 2022,” he said."}
{"game_id": "0022100583", "chunk_id": "0022100583_020", "order": 20, "role": "body", "text": "Nets: Durant moved ahead of Patrick Ewing (24,815 points) into 23rd place on the career scoring list. ... Nicolas Claxton and Cam Thomas each scored 14 points."}
{"game_id": "0022100583", "chunk_id": "0022100583_022", "order": 22, "role": "body", "text": "Patty Mills shot 1 for 8 for three points. He returned to his reserve role when Irving played Wednesday, but was back in the starting lineup again Friday. Coach Steve Nash said the Nets need to keep Mills in the lineup at home while starting swingman Joe Harris is recovering from left ankle surgery."}
{"game_id": "0022100583", "chunk_id": "0022100583_023", "order": 23, "role": "body", "text": "“I think the Kyrie situation hopefully helps Patty,” Nash said. “I think we’ve seen him kind of almost be overused and over-depended on, and I think it’s been difficult for him at times to be able to continue his level of play because we’ve overburdened him. So, can Kyrie keep his minutes in a sweet spot where he can keep it consistently high level?”"}
{"game_id": "0022100583", "chunk_id": "0022100583_025", "order": 25, "role": "body", "text": "Ham, on what it feels like to in the head coach's seat:"}
{"game_id": "0022100583", "chunk_id": "0022100583_026", "order": 26, "role": "body", "text": "“It feels weird and feels intense and I like it, but I also like not being in it at this point in time. Bud makes it look effortless man, but I've seen what he goes through being with him since Day 1.”"}
{"game_id": "0022100583", "chunk_id": "0022100583_028", "order": 28, "role": "body", "text": "Bucks: At Charlotte on Saturday night."}
{"game_id": "0022100583", "chunk_id": "0022100583_029", "order": 29, "role": "closing", "text": "Nets: Host San Antonio on Sunday."}
