{"game_id": "0022101111", "chunk_id": "0022101111_001", "order": 1, "role": "lead", "text": "MIAMI -- — Goran Dragic looked up at the overhead screen and watched the video that paid tribute to his seven seasons with the Miami Heat, then waved to acknowledge the loud cheers from his former home crowd."}
{"game_id": "0022101111", "chunk_id": "0022101111_002", "order": 2, "role": "body", "text": "It was the start of a great night for the Brooklyn Nets."}
{"game_id": "0022101111", "chunk_id": "0022101111_003", "order": 3, "role": "body", "text": "And it was about the only thing Heat fans could cheer about."}
{"game_id": "0022101111", "chunk_id": "0022101111_004", "order": 4, "role": "body", "text": "Kevin Durant scored 23 points, Seth Curry added 17 and the Nets overwhelmed Miami 110-95 on Saturday night, sending the Heat to their season-worst fourth consecutive loss."}
{"game_id": "0022101111", "chunk_id": "0022101111_005", "order": 5, "role": "body", "text": "“I thought there was a lot of force and purpose offensively,\" Nets coach Steve Nash said. “We didn't take things for granted.\""}
{"game_id": "0022101111", "chunk_id": "0022101111_006", "order": 6, "role": "body", "text": "Andre Drummond had 13 points and 11 rebounds for Brooklyn, which got 11 points from Kyrie Irving — who will play his first home game of the season for the Nets on Sunday — and 10 from Nic Claxton."}
{"game_id": "0022101111", "chunk_id": "0022101111_007", "order": 7, "role": "body", "text": "“I think all phases of our game worked tonight,\" Durant said."}
{"game_id": "0022101111", "chunk_id": "0022101111_008", "order": 8, "role": "body", "text": "Bam Adebayo scored 14 points for Miami, which trailed by as many as 37 — its biggest deficit of the season. The Heat were without coach Erik Spoelstra, who missed the game because of a family matter, and assistant Chris Quinn took his place."}
{"game_id": "0022101111", "chunk_id": "0022101111_009", "order": 9, "role": "body", "text": "Tyler Herro and Max Strus each had 13 and Kyle Lowry had 12 for Miami. Caleb Martin had 10 and Jimmy Butler was held to just seven points on 2-of-9 shooting."}
{"game_id": "0022101111", "chunk_id": "0022101111_010", "order": 10, "role": "body", "text": "And the Eastern Conference race only got tighter, now with the top four teams all separated by only a half-game."}
{"game_id": "0022101111", "chunk_id": "0022101111_011", "order": 11, "role": "body", "text": "Philadelphia (46-27, .630) moved into first in the East, percentage points ahead of Miami (47-28, .627). Boston and Milwaukee — which lost Saturday night in Memphis — are both 46-28 (.622); the Celtics hold the head-to-head tiebreaker at this point over the Bucks."}
{"game_id": "0022101111", "chunk_id": "0022101111_012", "order": 12, "role": "body", "text": "“We're not concerned in the sense of, like, panicking,\" Lowry said. “But, yeah, we have to fix some stuff.\""}
{"game_id": "0022101111", "chunk_id": "0022101111_013", "order": 13, "role": "body", "text": "Brooklyn (39-35) remained in the No. 8 spot, now a full game ahead of No. 9 Charlotte. The Nets and Hornets meet on Sunday night."}
{"game_id": "0022101111", "chunk_id": "0022101111_014", "order": 14, "role": "body", "text": "“We're in that mindset where every game counts,\" Drummond said."}
{"game_id": "0022101111", "chunk_id": "0022101111_015", "order": 15, "role": "body", "text": "Dragic said he learned about the tribute earlier Saturday. He's kept friendships with plenty of Heat players and employees since getting moved in the trade that brought Lowry to Miami last summer."}
{"game_id": "0022101111", "chunk_id": "0022101111_016", "order": 16, "role": "body", "text": "“It means a lot,\" Dragic said. “I spent seven years, 6 1/2 years here. It's always nice to get the reception that I did. ... We had a blast, but right now, my focus is in Brooklyn.\""}
{"game_id": "0022101111", "chunk_id": "0022101111_017", "order": 17, "role": "body", "text": "The Heat bench stood in unison for the tribute."}
{"game_id": "0022101111", "chunk_id": "0022101111_018", "order": 18, "role": "body", "text": "“One of the best point guards to put on the jersey,” Quinn said. “Anytime we get to see him, we love seeing him. Obviously, we don’t love seeing him on the other team, but it’s always good to be around someone of that caliber.”"}
{"game_id": "0022101111", "chunk_id": "0022101111_019", "order": 19, "role": "body", "text": "Brooklyn outscored Miami 40-21 in the second quarter to take a 21-point lead into the half. It just kept getting worse for Miami; Drummond intercepted a pass, dribbled downcourt, threw up a “peace” sign at Heat defenders on his way to the rim and dunked for an 82-55 lead midway through the third."}
{"game_id": "0022101111", "chunk_id": "0022101111_020", "order": 20, "role": "body", "text": "“I don't know what made me do it,\" Drummond said."}
{"game_id": "0022101111", "chunk_id": "0022101111_021", "order": 21, "role": "body", "text": "The Heat led New York 90-73 with 11 minutes to go on Friday, then got outscored 38-13 the rest of the way. Curry made a 3-pointer with 4:02 left in the third for a 94-57 lead — meaning, going back to Friday, over a span of 43 minutes the Heat were outscored 132-70."}
{"game_id": "0022101111", "chunk_id": "0022101111_023", "order": 23, "role": "body", "text": "Nets: Brooklyn spent basically three full days in Miami on this trip, after flying in from Memphis on Wednesday night. As one might expect, it’s not uncommon for visiting teams to spend an extra day or two in Miami when schedules allow. ... The Nets are now 20-0 in games in which they hold a lead of 17 points or more."}
{"game_id": "0022101111", "chunk_id": "0022101111_024", "order": 24, "role": "body", "text": "Heat: Gabe Vincent (toe) remained sidelined, but Herro returned after a two-game absence with a knee issue. ... Butler spent some time Saturday at the Miami Open, watching tennis several hours before the Nets-Heat game. ... Miami went 3-1 against Brooklyn this season. ... Before Saturday, the largest deficit Miami had faced this season was 32 at Boston on Jan. 31."}
{"game_id": "0022101111", "chunk_id": "0022101111_026", "order": 26, "role": "body", "text": "Spoelstra’s absence was his third since taking over as head coach in 2008; he missed a game in 2018 for the birth of his first son, and another game the following year for the birth of his second son. The Heat are now 0-3 in those games, which go on Spoelstra’s record."}
{"game_id": "0022101111", "chunk_id": "0022101111_028", "order": 28, "role": "body", "text": "Nets forward LaMarcus Aldridge (right hip impingement) missed his ninth consecutive game, though there is a chance he could return to the Brooklyn rotation on Sunday. “We’ll discuss it ... see where he’s at physically and what the right time is for him to come back,” Brooklyn coach Steve Nash said."}
{"game_id": "0022101111", "chunk_id": "0022101111_030", "order": 30, "role": "body", "text": "Nets: Host Charlotte on Sunday night."}
{"game_id": "0022101111", "chunk_id": "0022101111_031", "order": 31, "role": "body", "text": "Heat: Host Sacramento on Monday night."}
