{"game_id": "0022100029", "chunk_id": "0022100029_001", "order": 1, "role": "lead", "text": "TORONTO -- — Luka Doncic and the Dallas Mavericks shook off the disappointment of a season-opening defeat with an impressive comeback win in Toronto."}
{"game_id": "0022100029", "chunk_id": "0022100029_002", "order": 2, "role": "body", "text": "Doncic had 27 points, 12 assists and nine rebounds, narrowly missing his 37th career triple-double, Kristaps Porzingis had 18 points and 10 rebounds, and the Mavericks rallied from an early 14-point deficit to beat the Raptors 103-95 Saturday night."}
{"game_id": "0022100029", "chunk_id": "0022100029_003", "order": 3, "role": "body", "text": "“Our defense wasn’t the best in the first half,” Doncic said. “In the second half we stayed together, we picked it up, not like the first game. I think that was the key.”"}
{"game_id": "0022100029", "chunk_id": "0022100029_004", "order": 4, "role": "body", "text": "Tim Hardaway Jr. scored 13 of his 25 points in the fourth quarter and Dwight Powell and Dorian Finney-Smith each had 11 as Dallas bounced back from Thursday’s loss at Atlanta."}
{"game_id": "0022100029", "chunk_id": "0022100029_005", "order": 5, "role": "body", "text": "“We were tested in Atlanta and we didn’t respond well,” new Dallas coach Jason Kidd said. “I thought the guys responded well here tonight, on the road.”"}
{"game_id": "0022100029", "chunk_id": "0022100029_006", "order": 6, "role": "body", "text": "Hardaway credited Kidd for lifiting the team’s spirits with some encouraging words before tip off."}
{"game_id": "0022100029", "chunk_id": "0022100029_007", "order": 7, "role": "body", "text": "“Coach Kidd said before the game ‘Great teams, they don’t lose two in a row, and they find a way to win, especially in hard situations,’” Hardaway said. “We just wanted to make sure that we finished strong and played hard on both ends of the floor, and didn’t want to question ourselves after the game.”"}
{"game_id": "0022100029", "chunk_id": "0022100029_008", "order": 8, "role": "body", "text": "OG Anunoby scored 23 points for the Raptors, who were playing the second game of a back-to-back. Toronto won 115-83 at Boston Friday."}
{"game_id": "0022100029", "chunk_id": "0022100029_009", "order": 9, "role": "body", "text": "Fred VanVleet scored 20 points and Scottie Barnes had 17. Precious Achiuwa had 10 points and 12 rebounds and Gary Trent Jr. scored 12 points."}
{"game_id": "0022100029", "chunk_id": "0022100029_010", "order": 10, "role": "body", "text": "Anunoby and Trent combined for 30 points in the first half but had just five between them in the second as the Raptors couldn’t make an early lead stand up."}
{"game_id": "0022100029", "chunk_id": "0022100029_011", "order": 11, "role": "body", "text": "“Those are the nights right there where we really need our bench to provide some energy,” Raptors head coach Nick Nurse said. “At home, back-to-back, they really need to give us something and they got outplayed pretty badly, I thought.”"}
{"game_id": "0022100029", "chunk_id": "0022100029_012", "order": 12, "role": "body", "text": "The Mavericks shot a dismal 32.6% (31 of 93) from the field against the Hawks Thursday, and weren’t much better in the early going against Toronto, missing nine of their first 10 attempts. Dallas went 0 for 8 from 3-point range in the first quarter."}
{"game_id": "0022100029", "chunk_id": "0022100029_013", "order": 13, "role": "body", "text": "Anunoby had 12 points in the first as Toronto led 25-18 after one."}
{"game_id": "0022100029", "chunk_id": "0022100029_014", "order": 14, "role": "body", "text": "Barnes went to the locker room for treatment after bruising his left quadriceps muscle early in the second quarter and did not play again in the half. Toronto led 51-45 at the intermission."}
{"game_id": "0022100029", "chunk_id": "0022100029_015", "order": 15, "role": "body", "text": "Barnes returned in the third but Dallas tied it at 62-all on a basket by Doncic with 6:06 left in the quarter, then took their first lead of the game when Powell dunked after a Toronto turnover. Doncic followed with his first 3-pointer after starting 0 for 5 from distance, then hit another jumper to complete a 12-0 run for the Mavs."}
{"game_id": "0022100029", "chunk_id": "0022100029_016", "order": 16, "role": "body", "text": "Doncic scored 12 points in the third as Dallas took a narrow 74-72 lead to the fourth."}
{"game_id": "0022100029", "chunk_id": "0022100029_018", "order": 18, "role": "body", "text": "Mavericks: Dallas scored 15 points off 12 Toronto turnovers. … Hardaway shot 7 for 11from 3-point range, while Doncic went 2 for 10. … The visiting team won for the second time in nine meetings between Toronto and Dallas."}
{"game_id": "0022100029", "chunk_id": "0022100029_019", "order": 19, "role": "body", "text": "Raptors: G/F Svi Mykhailiuk needed four stitches at halftime to close a cut on his head. Mykhailiuk was hurt in an accidental collision with Porzingis late in the second. Mykhailiuk returned in the third. … F Pascal Siakam (left shoulder) is now practicing with light contact, coach Nick Nurse said. … F Yuta Watanabe (left calf) is expected to start practicing Tuesday."}
{"game_id": "0022100029", "chunk_id": "0022100029_021", "order": 21, "role": "body", "text": "Doncic missed a triple-double by one rebound or one assist for the 15th time."}
{"game_id": "0022100029", "chunk_id": "0022100029_023", "order": 23, "role": "body", "text": "VanVleet and Achiuwa connected on the basket of the game, with VanVleet finding his teammate for a half-court lob pass late in the third."}
{"game_id": "0022100029", "chunk_id": "0022100029_025", "order": 25, "role": "body", "text": "Mavericks: Open their home schedule against Houston on Tuesday night."}
{"game_id": "0022100029", "chunk_id": "0022100029_026", "order": 26, "role": "body", "text": "Raptors: Host Chicago on Monday night."}
