{"game_id": "0022100115", "chunk_id": "0022100115_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Paul George had 32 points and eight assists, and Reggie Jackson scored a season-high 29 points as the Los Angeles Clippers beat the Minnesota Timberwolves 126-115 on Wednesday night."}
{"game_id": "0022100115", "chunk_id": "0022100115_002", "order": 2, "role": "body", "text": "George shot 11 of 18, including 4 of 8 from long distance, as Los Angeles had its best shooting night of the season and won its second straight game. The Clippers shot 60.3% from the field and made a season-high 21 3-pointers on 36 attempts."}
{"game_id": "0022100115", "chunk_id": "0022100115_003", "order": 3, "role": "body", "text": "Nicholas Batum added 20 points and Terance Mann had a season-high 17 points off the bench, including a career-best three 3s."}
{"game_id": "0022100115", "chunk_id": "0022100115_004", "order": 4, "role": "body", "text": "“You don’t have a choice, we got to start winning games,” George said. “We got to start getting some momentum. At some point, things have to change for us. We’re not a young team. We’re not a team that’s, you know, let’s just wait for guys to come back. The time is now for us.”"}
{"game_id": "0022100115", "chunk_id": "0022100115_005", "order": 5, "role": "body", "text": "Anthony Edwards scored 29 points for Minnesota, which has lost four of five. Karl-Anthony Towns finished with 18 points and 11 rebounds. The Timberwolves were without D’Angelo Russell, who was sidelined with a right ankle sprain."}
{"game_id": "0022100115", "chunk_id": "0022100115_006", "order": 6, "role": "body", "text": "“Just not into the ball, not physical enough,” Minnesota coach Chris Finch said. “Started with the beginning of the third quarter and we noticed just a lax approach there. Shot contests were not up to par. Then they got hot. That’s what they do.”"}
{"game_id": "0022100115", "chunk_id": "0022100115_007", "order": 7, "role": "body", "text": "The Timberwolves also had one of their better shooting nights overall, finishing at 45.7% and going 14 for 40 from beyond the arc in the first of two straight games between the teams."}
{"game_id": "0022100115", "chunk_id": "0022100115_008", "order": 8, "role": "body", "text": "“You can say it’s a bright spot, but there’s no bright spot in a loss,” Towns said of the team’s shooting. “We’re 3-4 in the season. I’d be remiss to say I think we should be about 6-1, 7-0. There’s things that we caused. That’s why we lost. … They just had that night, but our defense has kept us to not having any one of those nights.”"}
{"game_id": "0022100115", "chunk_id": "0022100115_009", "order": 9, "role": "body", "text": "Two of the worst shooting teams in the league traded blows for three quarters before Los Angeles took control late in the third."}
{"game_id": "0022100115", "chunk_id": "0022100115_010", "order": 10, "role": "body", "text": "The Clippers entered the game shooting 41.3% from the field this season, 26th in the league. Minnesota was right behind at 41.1%, tied with Oklahoma City. Only Dallas and Detroit have been worse."}
{"game_id": "0022100115", "chunk_id": "0022100115_011", "order": 11, "role": "body", "text": "Towns gave the Wolves a 70-68 lead midway through the third quarter with a soaring dunk after Edwards had scored five straight points. But Edwards banged his knee on Clippers guard Eric Bledsoe and had to leave the game temporarily."}
{"game_id": "0022100115", "chunk_id": "0022100115_012", "order": 12, "role": "body", "text": "Los Angeles went on a 12-2 run, culminating in a 3-pointer by George, to take a lead it wouldn’t relinquish. George fanned himself as he went back down the court."}
{"game_id": "0022100115", "chunk_id": "0022100115_013", "order": 13, "role": "body", "text": "“He’s hot,” Mann said. “He’s going to stay hot. He’s been hot all year.”"}
{"game_id": "0022100115", "chunk_id": "0022100115_015", "order": 15, "role": "body", "text": "Clippers coach Tyronn Lue entered his postgame press conference clapping and said, “make shots.”"}
{"game_id": "0022100115", "chunk_id": "0022100115_016", "order": 16, "role": "body", "text": "The biggest display of shot-making came in the third as Los Angeles made its run. The Clippers scored 45 points in the quarter and made 17 of 20 shots, including 9 of 11 from 3-point range."}
{"game_id": "0022100115", "chunk_id": "0022100115_017", "order": 17, "role": "body", "text": "“Guys continue to keep taking their shots,” Lue said. “We talked about it all week long, about just stepping up, having confidence and taking their shots. Our guys were open and they made shots. That was good to see.”"}
{"game_id": "0022100115", "chunk_id": "0022100115_019", "order": 19, "role": "body", "text": "Clippers: Marcus Morris missed his fifth straight game with a left knee injury. Kawhi Leonard (knee surgery) and Serge Ibaka (back surgery) haven’t played this season. … The 126 points were a season-high for Los Angeles. … The Clippers had 21 turnovers, leading to 30 points for Minnesota."}
{"game_id": "0022100115", "chunk_id": "0022100115_020", "order": 20, "role": "body", "text": "Timberwolves: Edwards limped off the court immediately after banging his knee. He went to the locker room under his own power and returned shortly after. … Russell missed his first game of the season after injuring his ankle Monday against Orlando. Patrick Beverly made his first start for Minnesota. He had 10 points and 10 rebounds against his former team and was called for a technical foul in the fourth."}
{"game_id": "0022100115", "chunk_id": "0022100115_022", "order": 22, "role": "body", "text": "The teams finish their two-game set on Friday in Minnesota."}
