{"game_id": "0022100556", "chunk_id": "0022100556_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — The Detroit Pistons owned the NBA’s worst record. The Milwaukee Bucks were the defending NBA champions."}
{"game_id": "0022100556", "chunk_id": "0022100556_002", "order": 2, "role": "body", "text": "None of that mattered Monday night as Saddiq Bey scored a career-high 34 points to lift Detroit to a 115-106 victory that snapped the Bucks’ six-game winning streak."}
{"game_id": "0022100556", "chunk_id": "0022100556_003", "order": 3, "role": "body", "text": "“Growing in this league is not easy, but this is an excellent step for us to take,” Pistons coach Dwane Casey said."}
{"game_id": "0022100556", "chunk_id": "0022100556_004", "order": 4, "role": "body", "text": "It also enabled them to step out of the Eastern Conference basement."}
{"game_id": "0022100556", "chunk_id": "0022100556_005", "order": 5, "role": "body", "text": "The Pistons' triumph improved their record to 7-28 and moved them ahead of the Orlando Magic, who now have the NBA's worst winning percentage."}
{"game_id": "0022100556", "chunk_id": "0022100556_006", "order": 6, "role": "body", "text": "Milwaukee had won 12 consecutive regular-season matchups with the Pistons by an average margin of 16.7 points before Monday. That streak didn’t include the Bucks’ four-game sweep of Detroit in a 2019 first-round playoff series."}
{"game_id": "0022100556", "chunk_id": "0022100556_007", "order": 7, "role": "body", "text": "That streak ended even though the Bucks had their top three players – Giannis Antetokounmpo, Khris Middleton and Jrue Holiday – all available. This marked just the third time all season that the Bucks have lost when they’ve had all three of those players in the starting lineup."}
{"game_id": "0022100556", "chunk_id": "0022100556_008", "order": 8, "role": "body", "text": "“They did a great job of just moving the ball, finding the open guy, knocking down shots, not letting us get momentum,” Antetokounmpo said. “They played well. They played real well.”"}
{"game_id": "0022100556", "chunk_id": "0022100556_009", "order": 9, "role": "body", "text": "Milwaukee attempted to erase a 13-point deficit in the final two minutes. But after Holiday's 3-pointer narrowed the margin to five with 47.1 seconds left, Detroit's Cade Cunningham converted a putback of his own miss with 27.8 seconds remaining."}
{"game_id": "0022100556", "chunk_id": "0022100556_010", "order": 10, "role": "body", "text": "The Bucks wouldn't threaten again."}
{"game_id": "0022100556", "chunk_id": "0022100556_011", "order": 11, "role": "body", "text": "“My teammates trust me with the ball at the end of the game after missing so many games,” said Cunningham, who hadn't played since Dec. 21 due to the NBA's health and safety protocols. “I appreciate them for that. I'm glad I got to make the play.”"}
{"game_id": "0022100556", "chunk_id": "0022100556_012", "order": 12, "role": "body", "text": "Josh Jackson, Trey Lyles, Killian Hayes, Saben Lee and Rodney McGruder also were back from protocols. Jackson had 24 points, Cunningham scored 19 and Lyles added 11."}
{"game_id": "0022100556", "chunk_id": "0022100556_013", "order": 13, "role": "body", "text": "“I thought I was going to be a little winded out there, but I didn't get as tired as I was expecting,” Jackson said."}
{"game_id": "0022100556", "chunk_id": "0022100556_014", "order": 14, "role": "body", "text": "Hamidou Diallo added 11 points, nine rebounds and five assists for the Pistons."}
{"game_id": "0022100556", "chunk_id": "0022100556_015", "order": 15, "role": "body", "text": "Antetokounmpo had 31 points, 10 rebounds and seven assists. Holiday scored 29. Bobby Portis had 12 points and 14 rebounds. Middleton added 10 points."}
{"game_id": "0022100556", "chunk_id": "0022100556_016", "order": 16, "role": "body", "text": "Detroit was 18 of 43 and Milwaukee shot just 11 of 46 on 3-point attempts."}
{"game_id": "0022100556", "chunk_id": "0022100556_017", "order": 17, "role": "body", "text": "“This is a big win for us, a breath of fresh air for sure,” Cunningham said. “Everybody can kind of cool out and now just play their game, not think so much. When you're losing, all that other stuff is kind of amplified, all the problems you're having and whatever. When you can find ways to win, stick together through tough games and pull out a victory, everything else you can work through a lot easier.”"}
{"game_id": "0022100556", "chunk_id": "0022100556_019", "order": 19, "role": "body", "text": "Pistons: This marks the second time in a week that Bey has established a career high in scoring. He had 32 against the New York Knicks on Wednesday. ... Jackson's 24 points were a season high. ... Cory Joseph and Isaiah Stewart remained unavailable because of league protocols."}
{"game_id": "0022100556", "chunk_id": "0022100556_020", "order": 20, "role": "body", "text": "Bucks: Middleton returned after missing a victory over the New Orleans Pelicans on Saturday for personal reasons. ... Luke Kornet signed a 10-day contract with the Bucks under the NBA’s hardship allowance. The 7-foot-2 center played two games with the Cleveland Cavaliers on a 10-day contract earlier this season and also has played 10 games for the NBA G League’s Maine Celtics. … Jordan Nwora was unavailable due to the protocols two nights after scoring 23 points and shooting 5 of 7 from 3-point range. Reserve forwards Thanasis Antetokounmpo and Semi Ojeleye remained unavailable due to league protocols"}
{"game_id": "0022100556", "chunk_id": "0022100556_022", "order": 22, "role": "body", "text": "Pistons: Visit Charlotte Hornets on Wednesday. The Pistons have lost their last 13 meetings with the Hornets."}
{"game_id": "0022100556", "chunk_id": "0022100556_023", "order": 23, "role": "body", "text": "Bucks: Host the Toronto Raptors on Wednesday. The Bucks lost 97-93 at Toronto on Dec. 2."}
