{"game_id": "0022101086", "chunk_id": "0022101086_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Damian Jones' tip-in with less than a second left lifted the Sacramento Kings to a 110-109 victory over the Indiana Pacers on Wednesday night."}
{"game_id": "0022101086", "chunk_id": "0022101086_002", "order": 2, "role": "body", "text": "Trey Lyles missed a 3-pointer for Sacramento but Jones tipped in the rebound with 0.2 seconds remaining."}
{"game_id": "0022101086", "chunk_id": "0022101086_003", "order": 3, "role": "body", "text": "Davion Mitchell scored 25 points and Chimezie Metu had a career-high 22 as the Kings snapped a three-game losing streak."}
{"game_id": "0022101086", "chunk_id": "0022101086_004", "order": 4, "role": "body", "text": "“It was a good win for us,” Kings coach Alvin Gentry said. “We've been struggling on the road. Just to come and find a way to win a game on the road is really important to us. It makes a statement that these guys haven't quit. They're still battling and do the best they can to win games. We found a way to make a few plays offensively and defensively to win.\""}
{"game_id": "0022101086", "chunk_id": "0022101086_005", "order": 5, "role": "body", "text": "Gentry said Mitchell made the plays down the stretch, along with Jones' huge offensive rebound and putback."}
{"game_id": "0022101086", "chunk_id": "0022101086_006", "order": 6, "role": "body", "text": "“(Jones) is always staying aggressive and we talk to him all the time about being on the offensive broads,” Gentry said. “He had a great block, too. He continues to grow and he's a competitor.”"}
{"game_id": "0022101086", "chunk_id": "0022101086_007", "order": 7, "role": "body", "text": "Buddy Hield led the Pacers with 25 points on 10-of-15 shooting and Goga Bitadze added 20. Tyrese Haliburton had 13 points and 15 assists."}
{"game_id": "0022101086", "chunk_id": "0022101086_008", "order": 8, "role": "body", "text": "Haliburton and Hield were traded by the Kings to the Pacers in February."}
{"game_id": "0022101086", "chunk_id": "0022101086_009", "order": 9, "role": "body", "text": "“It was good to see Tyrese and Buddy. It felt good to rub it in,” Jones said after the first game-winning shot of his career."}
{"game_id": "0022101086", "chunk_id": "0022101086_010", "order": 10, "role": "body", "text": "Hield put Indiana ahead 107-106 on a short jumper with 2:11 left. After a steal by Haliburton, Terry Taylor hit two free throws to make it 109-106. Mitchell made a 15-foot jumper to cut it to 109-108 with 18.7 seconds remaining, and Indiana gave Sacramento another chance with a turnover by Hield with 14 seconds left."}
{"game_id": "0022101086", "chunk_id": "0022101086_011", "order": 11, "role": "body", "text": "“They just made plays and we didn't,” Haliburton said. “I missed a layup. (Hield) had a bad turnover in the full court, obviously. I thought we were in position to win. We just didn't execute down the stretch.\""}
{"game_id": "0022101086", "chunk_id": "0022101086_012", "order": 12, "role": "body", "text": "Pacers coach Rick Carlisle said the Kings were trapping as expected in the final seconds."}
{"game_id": "0022101086", "chunk_id": "0022101086_013", "order": 13, "role": "body", "text": "“We have to space the floor better and have to do a better job of ball security there,” Carlisle said."}
{"game_id": "0022101086", "chunk_id": "0022101086_014", "order": 14, "role": "body", "text": "Carlisle loves Hield's enthusiasm, though."}
{"game_id": "0022101086", "chunk_id": "0022101086_015", "order": 15, "role": "body", "text": "“He's a willing learner,” Carlisle said. “He's doing a better job defensively all the time. Offensively, he can make plays. I'm sure he's disappointed. I'm sure he and Ty would have liked to win this game. He'll move on and do better.\""}
{"game_id": "0022101086", "chunk_id": "0022101086_016", "order": 16, "role": "body", "text": "The Pacers outscored the Kings 28-19 in the third quarter to take an 89-85 lead, erasing a four-point halftime deficit."}
{"game_id": "0022101086", "chunk_id": "0022101086_017", "order": 17, "role": "body", "text": "The Kings shot 61.5% to take a 66-61 lead at halftime. Metu came off the bench and led the way with 18 points, making all six shots from the field — including three 3-pointers."}
{"game_id": "0022101086", "chunk_id": "0022101086_018", "order": 18, "role": "body", "text": "“We started off hot,” Metu said. “At the end of the day, everyone just wants to win. Any time you get a win on the road it feels good. Everyone contributed.”"}
{"game_id": "0022101086", "chunk_id": "0022101086_019", "order": 19, "role": "body", "text": "The Pacers made 50% in the first half and stayed close by committing just six turnovers, four fewer than the Kings."}
{"game_id": "0022101086", "chunk_id": "0022101086_020", "order": 20, "role": "body", "text": "Sacramento sank 72% of its shots in the first quarter to lead 37-35."}
{"game_id": "0022101086", "chunk_id": "0022101086_021", "order": 21, "role": "body", "text": "For the game, the Kings shot 52.4% while the Pacers finished at 46.2%."}
{"game_id": "0022101086", "chunk_id": "0022101086_023", "order": 23, "role": "body", "text": "Kings: Domantas Sabonis, traded by the Pacers in February, was sidelined with a left knee bone bruise. … De’Aaron Fox, the team’s leading scorer, missed his third consecutive game with a hand injury."}
{"game_id": "0022101086", "chunk_id": "0022101086_024", "order": 24, "role": "body", "text": "Pacers: Rookie center Isaiah Jackson cleared concussion protocol and returned after missing two games. Jackson played in the first half but then left the game with a headache. … Malcolm Brogdon was out for the second consecutive game due to rest. … Jalen Smith missed the game with an illness."}
{"game_id": "0022101086", "chunk_id": "0022101086_026", "order": 26, "role": "body", "text": "Kings: Play at Orlando on Saturday, the second stop on a five-game road trip."}
{"game_id": "0022101086", "chunk_id": "0022101086_027", "order": 27, "role": "body", "text": "Pacers: Play at Memphis on Thursday."}
