{"game_id": "0022100724", "chunk_id": "0022100724_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Luke Kennard scored 17 points, Amir Coffey added 15 and the Los Angeles Clippers rallied to defeat the Orlando Magic 111-102 on Wednesday, one night after they matched the second-largest comeback in NBA history."}
{"game_id": "0022100724", "chunk_id": "0022100724_002", "order": 2, "role": "body", "text": "The Clippers trailed by as much as 14 points on Wednesday, and were behind 78-76 at the start of the fourth quarter. LA used a 20-9 run to open the final period and cruised from there for its third victory in four games."}
{"game_id": "0022100724", "chunk_id": "0022100724_003", "order": 3, "role": "body", "text": "“On a back-to-back, just to continue fighting on the road down 14, that was big,” said Clippers coach Tyronn Lue, who won his 200th regular-season game. “You don’t want to keep getting down early, but it is what it is. But our guys keep fighting, keep playing hard and playing the right way.”"}
{"game_id": "0022100724", "chunk_id": "0022100724_004", "order": 4, "role": "body", "text": "LA made 15 of 28 3-pointers and finished the game off at the free-throw line. After attempting just two free throws in the game’s first three quarters, the Clippers hit 23 of 25 free throws in the final quarter."}
{"game_id": "0022100724", "chunk_id": "0022100724_005", "order": 5, "role": "body", "text": "Kennard, the last-second hero from Tuesday's win in Washington made six of nine shots and had two 3-pointers. Terrence Mann added 14 points."}
{"game_id": "0022100724", "chunk_id": "0022100724_006", "order": 6, "role": "body", "text": "LA’s rally on Wednesday was aided by a 49-27 advantage in bench points — including Eric Bledsoe's 13."}
{"game_id": "0022100724", "chunk_id": "0022100724_007", "order": 7, "role": "body", "text": "“We’ve got a good mixture of guys. We’ve got good vets who have been in the league for awhile and young players who are hungry to show the world what they can do,” Bledsoe said. “Mix those two and it’s a great group of players.”"}
{"game_id": "0022100724", "chunk_id": "0022100724_008", "order": 8, "role": "body", "text": "Orlando had a 78-76 advantage at the end of three periods — just the 10th time all season it has taken a lead into the final quarter. But the Magic failed in their bid to win a second straight game for just the second time this season and dropped to an NBA-worst 3-18 at home."}
{"game_id": "0022100724", "chunk_id": "0022100724_009", "order": 9, "role": "body", "text": "“We talked about the aggression, but we also have to understand when to be aggressive and not getting them to the free-throw line,” Orlando coach Jamahl Mosley said."}
{"game_id": "0022100724", "chunk_id": "0022100724_010", "order": 10, "role": "body", "text": "Rookie Franz Wagner led the Magic with 21 points and nine assists, while Cole Anthony had 19 points, eight assists and six rebounds. Rookie Jalen Suggs scored 14 points, as did veteran guard Gary Harris."}
{"game_id": "0022100724", "chunk_id": "0022100724_011", "order": 11, "role": "body", "text": "“We messed up on our part by less than two minutes into the (fourth) quarter putting them into the bonus, and that changes our whole game plan,” Anthony said. \"At that point, we can’t be as aggressive as we want to be.”"}
{"game_id": "0022100724", "chunk_id": "0022100724_012", "order": 12, "role": "body", "text": "The Clippers beat the Magic for a 16th time in the past 17 games. LA won in Orlando for an eighth consecutive year."}
{"game_id": "0022100724", "chunk_id": "0022100724_014", "order": 14, "role": "body", "text": "Lue said Tuesday’s rally from 35 points down was emblematic of the “no excuses” mentality his team has adopted. Lue said even without superstars Kawhi Leonard and Paul George, he expects the Clippers to make the playoffs."}
{"game_id": "0022100724", "chunk_id": "0022100724_015", "order": 15, "role": "body", "text": "“It was just about, ‘keep competing’ — that’s the culture that we’ve established around here,” Lue said. “No matter who is on the floor or who is out, no excuses and continue to play the game the right way.”"}
{"game_id": "0022100724", "chunk_id": "0022100724_016", "order": 16, "role": "body", "text": "One of the hallmarks of the season for the Clippers has been their ability to stay in games even when trailing by large amounts. They rallied from 25 down against Denver on Jan. 11 and after falling behind by 24 in Philadelphia on Jan. 21, and they won both games. The Clippers are the only NBA franchise in the last 25 years to wipe out deficits as large as 24 points three times in a season."}
{"game_id": "0022100724", "chunk_id": "0022100724_017", "order": 17, "role": "body", "text": "And over the last four years — including playoff games — the Clippers have an NBA-most seven victories when trailing by at least 24 points."}
{"game_id": "0022100724", "chunk_id": "0022100724_019", "order": 19, "role": "body", "text": "Clippers: Starting point guard Reggie Jackson was replaced by Bledsoe just 82 seconds into the game after picking up two early fouls. … Justise Winslow had seven points and seven of his eight rebounds in the fourth quarter."}
{"game_id": "0022100724", "chunk_id": "0022100724_020", "order": 20, "role": "body", "text": "Magic: Terrence Ross and Harris were available after one-game injury absences. Harris, who has started 30 games, shifted into a reserve role. Ross finished with seven points and five rebounds in 16 minutes."}
{"game_id": "0022100724", "chunk_id": "0022100724_022", "order": 22, "role": "body", "text": "Clippers: Play at Miami on Friday night."}
{"game_id": "0022100724", "chunk_id": "0022100724_023", "order": 23, "role": "body", "text": "Magic: Host Detroit on Friday night."}
