{"game_id": "0022100730", "chunk_id": "0022100730_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — Nicola Vucevic had 26 points and 15 rebounds, and the Chicago Bulls withstood a fierce rally by Oklahoma City to beat the Thunder 111-110 on Monday night."}
{"game_id": "0022100730", "chunk_id": "0022100730_002", "order": 2, "role": "body", "text": "The Bulls led by 28 points in the third quarter, but the Thunder had a chance to tie it in the closing seconds. Oklahoma City's Shai Gilgeous-Alexander missed a 3-pointer that would have evened the score with 2.3 seconds to play."}
{"game_id": "0022100730", "chunk_id": "0022100730_003", "order": 3, "role": "body", "text": "The Bulls were short-handed. DeMar DeRozan, who averages 26.3 points per game, rested. Lonzo Ball was out with a bruised left knee and Alex Caruso missed the game with a fractured wrist suffered when Milwaukee’s Grayson Allen yanked him to the ground."}
{"game_id": "0022100730", "chunk_id": "0022100730_004", "order": 4, "role": "body", "text": "With Ball and Caruso out, the Thunder harassed the Bulls in the fourth quarter."}
{"game_id": "0022100730", "chunk_id": "0022100730_005", "order": 5, "role": "body", "text": "“Two of our primary ballhandlers in Lonzo and Alex are not here, and when you get into these situations in the fourth quarter where teams turn up the defensive pressure and pick up full court, you’ve got to be able to handle it,\" Bulls coach Billy Donovan said."}
{"game_id": "0022100730", "chunk_id": "0022100730_006", "order": 6, "role": "body", "text": "Rookie Ayo Dosunmu scored a season-high 24 points and Zach LaVine added 23 for the Bulls."}
{"game_id": "0022100730", "chunk_id": "0022100730_007", "order": 7, "role": "body", "text": "Chicago, one of the top teams in the Eastern Conference, had lost six of seven and was coming off a 19-point loss to NBA-worst Orlando. LaVine, who had been out since Jan. 14 with a bruised left knee, was happy to provide a spark."}
{"game_id": "0022100730", "chunk_id": "0022100730_008", "order": 8, "role": "body", "text": "“It felt good,\" LaVine said. “I got tired of just sitting at home watching. I’m about as healthy as I can get, but it just sucks sitting at home and not being able to help.”"}
{"game_id": "0022100730", "chunk_id": "0022100730_009", "order": 9, "role": "body", "text": "Gilgeous-Alexander had 31 points and 10 assists and Lu Dort added 16 points for the Thunder, who have lost 11 of 12."}
{"game_id": "0022100730", "chunk_id": "0022100730_010", "order": 10, "role": "body", "text": "Dosunmu scored 16 points on 7-for-7 shooting in the first half to help the Bulls take a 58-48 lead at the break."}
{"game_id": "0022100730", "chunk_id": "0022100730_011", "order": 11, "role": "body", "text": "Javonte Green's right-handed throwdown in traffic put the Bulls up 66-50 early in the third quarter, and Chicago's biggest lead was 84-56 midway through the period. Oklahoma City trimmed that deficit, but Dosunmu banked in a 3-pointer from just inside half court at the buzzer to give the Bulls a 92-78 advantage."}
{"game_id": "0022100730", "chunk_id": "0022100730_012", "order": 12, "role": "body", "text": "Dort's 3-pointer with 53.6 seconds remaining cut Chicago's lead to three, and a layup by Josh Giddey with 14.8 seconds left made it a one-point game."}
{"game_id": "0022100730", "chunk_id": "0022100730_013", "order": 13, "role": "body", "text": "LaVine made two free throws with 9.9 seconds left. After Gilgeous-Alexander's miss, Green sealed it when he made a free throw with 1 second remaining."}
{"game_id": "0022100730", "chunk_id": "0022100730_014", "order": 14, "role": "body", "text": "“I give our guys a lot of credit,” Thunder coach Mark Daigneault said. “The ball pressure really amped up and they brought a lot of energy. To go out there and pressure the ball like that was huge for us because it took them out of their offense and didn’t allow them to use their size at the (center position).”"}
{"game_id": "0022100730", "chunk_id": "0022100730_016", "order": 16, "role": "body", "text": "Daigneault on Gilgeous-Alexander: “I think he’s been on a nice run here for a while. He’s had a couple of lower output games mixed in there, but I feel like he played with really good balance tonight. That was a really efficient 31 points tonight. He got to the line a ton. He made the right passes, got his teammates shots and played with pace up the floor and played with pace inside the action, which makes it harder for the defense to help on him.”"}
{"game_id": "0022100730", "chunk_id": "0022100730_018", "order": 18, "role": "body", "text": "Dosunmu, a second-round draft pick, set a Bulls rookie record for made shots to start a game with nine. Orlando Woolridge made eight straight during the 1981-82 season. Dosunmu made 10 of 14 shots overall."}
{"game_id": "0022100730", "chunk_id": "0022100730_020", "order": 20, "role": "body", "text": "Donovan, who coached the Thunder for five years before leaving for the Bulls, got a mixed reaction when he was announced during pregame introductions. He had a 243-157 record with Oklahoma City."}
{"game_id": "0022100730", "chunk_id": "0022100730_022", "order": 22, "role": "body", "text": "Bulls: Derrick Jones (hyperextended right knee) and Patrick Williams (torn left wrist) sat out. ... LaVine was hit in the face in the third quarter and returned with bandages above his left eye. ... Forward Tyler Cook took an elbow to the face in the third quarter, left the game and did not return. ... Dosunmu fouled out after playing 35 minutes."}
{"game_id": "0022100730", "chunk_id": "0022100730_023", "order": 23, "role": "body", "text": "Thunder: Gilgeous-Alexander scored 19 points in the second half. ... Held Chicago to 6-for-22 shooting in the fourth quarter. ... Mike Muscala scored 14 points in 15 minutes."}
{"game_id": "0022100730", "chunk_id": "0022100730_025", "order": 25, "role": "body", "text": "Bulls: At Toronto on Wednesday."}
{"game_id": "0022100730", "chunk_id": "0022100730_026", "order": 26, "role": "body", "text": "Thunder: Host Indiana on Friday."}
{"game_id": "0022100730", "chunk_id": "0022100730_028", "order": 28, "role": "body", "text": "Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP"}
