{"game_id": "0022100870", "chunk_id": "0022100870_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Giannis Antetokounmpo scored a season-high 50 points, two off his career best, and pulled down 14 rebounds to lead the Milwaukee Bucks past the skidding Indiana Pacers 128-119 on Tuesday night."}
{"game_id": "0022100870", "chunk_id": "0022100870_002", "order": 2, "role": "body", "text": "The Bucks (36-23) swept the four-game season series from the Pacers and have won eight straight against their Central Division foe."}
{"game_id": "0022100870", "chunk_id": "0022100870_003", "order": 3, "role": "body", "text": "Antetokounmpo, who didn’t play in Milwaukee’s loss to Portland on Monday night because of a sore left ankle, showed no ill effects as he racked up 12 first-quarter points that included a pair of thunderous dunks and a 3-pointer."}
{"game_id": "0022100870", "chunk_id": "0022100870_004", "order": 4, "role": "body", "text": "“I felt way better,” Antetokounmpo said. “I was rested.”"}
{"game_id": "0022100870", "chunk_id": "0022100870_005", "order": 5, "role": "body", "text": "Antetokounmpo set a career high with his seventh 40-point game of the season and scored 50 for the first time since the memorable title-clinching game in the NBA Finals last season against Phoenix, which gave the Bucks their first championship in 50 years. It was the fourth 50-point game of his nine-year career, including the postseason."}
{"game_id": "0022100870", "chunk_id": "0022100870_006", "order": 6, "role": "body", "text": "The NBA Finals MVP shrugged off the accomplishment."}
{"game_id": "0022100870", "chunk_id": "0022100870_007", "order": 7, "role": "body", "text": "“Obviously, it’s a nice feeling to have 50, you’ll always remember it, but I care about the win. I want to win games,” Antetokounmpo said. \"We have another one on Thursday. We’ll try to finish and go to the All-Star break on a good note. As long as we’re winning, I’m good. You do whatever it takes. If you are thinking about let me get to 50, let me get mine, it doesn’t work that way. You have to focus on winning games.”"}
{"game_id": "0022100870", "chunk_id": "0022100870_008", "order": 8, "role": "body", "text": "Milwaukee bounced back after consecutive double-digit losses to hand Indiana (19-40) its seventh consecutive defeat."}
{"game_id": "0022100870", "chunk_id": "0022100870_009", "order": 9, "role": "body", "text": "Antetokounmpo scored 12 points in the first quarter, six in the second, 13 in the third and 19 in the final period. He made 17 of 21 shots from the field and was 14 of 18 at the foul line."}
{"game_id": "0022100870", "chunk_id": "0022100870_010", "order": 10, "role": "body", "text": "“He’s in a good place and good rhythm at the free-throw line,\" Bucks coach Mike Budenholzer said. “You get 14 of those and a couple of 3-balls and it can add up for him. Fifty is never easy. It's great to have him back.\""}
{"game_id": "0022100870", "chunk_id": "0022100870_011", "order": 11, "role": "body", "text": "It marked only the 12th time in NBA history that a player has scored 50 or more points on 80% shooting or better."}
{"game_id": "0022100870", "chunk_id": "0022100870_012", "order": 12, "role": "body", "text": "“He makes it look so easy,” teammate Jordan Nwora said."}
{"game_id": "0022100870", "chunk_id": "0022100870_013", "order": 13, "role": "body", "text": "Both teams had only 10 players available due to injuries."}
{"game_id": "0022100870", "chunk_id": "0022100870_014", "order": 14, "role": "body", "text": "Buddy Hield scored a season-high 36 points and Tyrese Haliburton had 17 points and eight assists for Indiana."}
{"game_id": "0022100870", "chunk_id": "0022100870_015", "order": 15, "role": "body", "text": "“We’re in a tough stretch right now,” Pacers coach Rick Carlisle said."}
{"game_id": "0022100870", "chunk_id": "0022100870_016", "order": 16, "role": "body", "text": "Haliburton said the Pacers battled throughout the game but just couldn't overcome Antetokounmpo's dominating performance."}
{"game_id": "0022100870", "chunk_id": "0022100870_017", "order": 17, "role": "body", "text": "“He made it tough on us,” Haliburton said. “He's a load.”"}
{"game_id": "0022100870", "chunk_id": "0022100870_018", "order": 18, "role": "body", "text": "The Bucks led 34-27 after the first quarter before the Pacers grabbed a short-lived lead midway through the second. A pair of 3-pointers by reserve guard Lindell Wigginton sparked a 12-2 surge that grew the lead to double digits. Milwaukee led 69-63 at halftime, paced by Antetokounmpo’s 18 points."}
{"game_id": "0022100870", "chunk_id": "0022100870_019", "order": 19, "role": "body", "text": "Milwaukee built a pair of nine-point leads in the third but couldn’t shake the Pacers. When Indiana got close again in the fourth, Antetokounmpo swished a 3 and added a pair of free throws after a clear-path foul and Milwaukee eventually increased its lead to 14 before holding off the Pacers down the stretch."}
{"game_id": "0022100870", "chunk_id": "0022100870_021", "order": 21, "role": "body", "text": "Pacers: G Chris Duarte (sore left big toe), F Isaiah Jackson (right ankle sprain), G Malcolm Brogdon (sore right Achilles) and C Myles Turner (left foot issue) all sat out. … Haliburton didn’t attempt a shot from the field until sinking a 3-pointer about four minutes into the second quarter. … Scored 13 points off nine Milwaukee turnovers in the first half. … Keifer Sykes had 10 points off the bench. … Lance Stephenson was whistled for a flagrant 1 foul after hitting Antetokounmpo in the face battling for a loose ball. ... Jalen Smith fouled out while playing only 17 minutes."}
{"game_id": "0022100870", "chunk_id": "0022100870_022", "order": 22, "role": "body", "text": "Bucks: G Wesley Matthews didn’t play due to right toe soreness and G George Hill missed his eighth consecutive game with a neck issue. … G Grayson Allen exited with left hip soreness. ... Wigginton scored a career-high 12 points, topping his previous mark of 11 set a night earlier. ... Serge Ibaka, who started in place of Antetokounmpo on Monday, had nine points in 24 minutes in his second game with Milwaukee after being acquired from the Los Angeles Clippers."}
{"game_id": "0022100870", "chunk_id": "0022100870_024", "order": 24, "role": "body", "text": "Carlisle spoke glowingly of Haliburton, acquired by the Pacers in a trade with Sacramento on Feb. 8."}
{"game_id": "0022100870", "chunk_id": "0022100870_025", "order": 25, "role": "body", "text": "“Everything about him has impressed me. His abilities on the floor are tremendous. They are diverse. He has a natural leadership aura about him. His wisdom and presence are beyond his years. He does not walk out onto the floor like a 21-year-old. He walks out there like a guy who’s a multiyear veteran in this league,” Carlisle said."}
{"game_id": "0022100870", "chunk_id": "0022100870_026", "order": 26, "role": "body", "text": "Budenholzer added his own praise for Haliburton, who is averaging 14.6 points per game. “He’s an impressive young player,” Budenholzer said. “He has a poise and a confidence that’s impressive.”"}
{"game_id": "0022100870", "chunk_id": "0022100870_028", "order": 28, "role": "body", "text": "Pacers: Host the Washington Wizards on Wednesday."}
{"game_id": "0022100870", "chunk_id": "0022100870_029", "order": 29, "role": "body", "text": "Bucks: Host the Philadelphia 76ers on Thursday."}
