{"game_id": "0022100027", "chunk_id": "0022100027_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Rookie Evan Mobley collected 17 points, 11 rebounds and four blocked shots, helping the Cleveland Cavaliers rally for their first win of the season, 101-95 over the Atlanta Hawks on Saturday night."}
{"game_id": "0022100027", "chunk_id": "0022100027_002", "order": 2, "role": "body", "text": "Ricky Rubio had 23 points and eight assists, and Jarrett Allen added 11 points and 14 rebounds for Cleveland, which trailed by 13 points in the second quarter. The Cavaliers had lost their first two games, both by 11."}
{"game_id": "0022100027", "chunk_id": "0022100027_003", "order": 3, "role": "body", "text": "“We’re definitely really happy about our first win, it felt great,” Mobley said. “But we don’t want to just settle on it. We want to keep winning and growing from here.”"}
{"game_id": "0022100027", "chunk_id": "0022100027_004", "order": 4, "role": "body", "text": "Mobley, the No. 3 overall selection from USC, scored seven points during a 21-0 run that put Cleveland ahead 67-58 in the third. Atlanta went scoreless for 4:28 after Trae Young made a layup with 46 seconds left in the second quarter."}
{"game_id": "0022100027", "chunk_id": "0022100027_005", "order": 5, "role": "body", "text": "“As Evan kept making plays, we kept giving him the ball,” Cavaliers coach J.B. Bickerstaff said. “He’s got that straight face, but his skill set is diverse and versatile. Evan has earned our trust because of how quickly he’s picked things up.”"}
{"game_id": "0022100027", "chunk_id": "0022100027_006", "order": 6, "role": "body", "text": "Young paced the Hawks with 24 points and seven assists, while Cam Reddish scored 19 points off the bench and Clint Capela had 10 points and 14 rebounds. Atlanta was not credited with a fast-break point in the second half."}
{"game_id": "0022100027", "chunk_id": "0022100027_007", "order": 7, "role": "body", "text": "The Hawks, who lost to NBA champion Milwaukee in the East finals last season, won their opener 113-87 over Dallas two days earlier."}
{"game_id": "0022100027", "chunk_id": "0022100027_008", "order": 8, "role": "body", "text": "“They outworked us and were the aggressive team throughout the second half,” Atlanta coach Nate McMillan said. “We weren’t getting stops, so we couldn’t get out in transition like we have to.”"}
{"game_id": "0022100027", "chunk_id": "0022100027_009", "order": 9, "role": "body", "text": "The Hawks pulled within 99-95 in the final minute, but missed a pair of shots before Lauri Markkanen sealed the win by making two free throws with 15 seconds remaining. Young finished 8 of 22 shooting and didn’t make a 3-pointer after the first quarter."}
{"game_id": "0022100027", "chunk_id": "0022100027_010", "order": 10, "role": "body", "text": "“I’ve got to do better,” Young said. “I will do better. I’ve just got to find the rhythm.”"}
{"game_id": "0022100027", "chunk_id": "0022100027_011", "order": 11, "role": "body", "text": "Collin Sexton, Markkanen and Kevin Love each scored 12 points for Cleveland, which committed a season-low 10 turnovers. The Cavaliers’ 21-point run was their longest since Dec. 11, 2019 against Houston, when they scored 24 in a row."}
{"game_id": "0022100027", "chunk_id": "0022100027_012", "order": 12, "role": "body", "text": "Mobley played 35 minutes in his third straight start. The 7-foot power forward is averaging 15.7 points and 8.3 rebounds with a .563 field goal percentage."}
{"game_id": "0022100027", "chunk_id": "0022100027_013", "order": 13, "role": "body", "text": "“Evan is going to be a guy who can get a double-double every night,” Love said. “He’s got a huge future and he’s going to make a number of All-Defensive teams in his career.”"}
{"game_id": "0022100027", "chunk_id": "0022100027_014", "order": 14, "role": "body", "text": "A 3-pointer by Bogdan Bogdanovic gave Atlanta its largest lead at 43-30, but Rubio answered with six points in the final 3:03 of the second quarter to pull the Cavaliers within 55-53 at intermission."}
{"game_id": "0022100027", "chunk_id": "0022100027_015", "order": 15, "role": "body", "text": "Young scored nine points in the first quarter and Reddish had five off the bench as Atlanta held a 27-24 lead after the first."}
{"game_id": "0022100027", "chunk_id": "0022100027_017", "order": 17, "role": "body", "text": "Love looked comfortable for the first time in his new role coming off the bench. The five-time All-Star had 12 points, six rebounds and three assists in 24 minutes. “Kevin knows who he is and what is important to us,” Bickerstaff said. “He played to win.” In Cleveland’s first two games, Love had 10 total points and missed 11 of his 14 field goal attempts."}
{"game_id": "0022100027", "chunk_id": "0022100027_019", "order": 19, "role": "body", "text": "Hawks: G Lou Williams (left hip soreness) was active and available, but the 17th-year pro did not play. … F Danilo Gallinari (left shoulder soreness) and F Onyeka Okongwu (right shoulder recovery) remain out and have not made their regular season debuts."}
{"game_id": "0022100027", "chunk_id": "0022100027_020", "order": 20, "role": "body", "text": "Cavaliers: Starting G Darius Garland (left ankle sprain) missed his second straight game after being hurt in the opener at Memphis. … G Dylan Windler (right hip strain) has been inactive for each game. He will travel with the team on its five-game road trip."}
{"game_id": "0022100027", "chunk_id": "0022100027_022", "order": 22, "role": "body", "text": "Hawks: Host Detroit on Monday. Atlanta is in the midst of four road games in a five-game stretch that ends Oct. 30."}
{"game_id": "0022100027", "chunk_id": "0022100027_023", "order": 23, "role": "body", "text": "Cavaliers: Visit Denver on Monday. Cleveland will not return home again until Nov. 3 against Portland."}
