{"game_id": "0022101029", "chunk_id": "0022101029_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Desmond Bane scored 21 points, Jaren Jackson Jr. had 19 and the Memphis Grizzlies rolled without All-Star Ja Morant, beating the Indiana Pacers 135-102 on Tuesday night."}
{"game_id": "0022101029", "chunk_id": "0022101029_002", "order": 2, "role": "body", "text": "De’Anthony Melton added 18 points while Morant sat out with back soreness. The Grizzlies made the decision to hold him out after he went through pregame warmups."}
{"game_id": "0022101029", "chunk_id": "0022101029_003", "order": 3, "role": "body", "text": "It was the fourth consecutive victory for the Grizzlies. The Pacers have lost two in a row and five of their last six games."}
{"game_id": "0022101029", "chunk_id": "0022101029_004", "order": 4, "role": "body", "text": "“We played great,” Bane said. “Everybody contributed. We had 38 assists, not a lot of teams do that.\""}
{"game_id": "0022101029", "chunk_id": "0022101029_005", "order": 5, "role": "body", "text": "Bane, who grew up about 75 miles away in Richmond, Indiana, said it was great to have so many family and friends at the game."}
{"game_id": "0022101029", "chunk_id": "0022101029_006", "order": 6, "role": "body", "text": "Steven Adams had 13 points and 13 rebounds for the Grizzlies."}
{"game_id": "0022101029", "chunk_id": "0022101029_007", "order": 7, "role": "body", "text": "Jalen Smith scored 15 points for Indiana. Buddy Hield and Terry Taylor each had 14."}
{"game_id": "0022101029", "chunk_id": "0022101029_008", "order": 8, "role": "body", "text": "Tyus Jones, who started in Morant’s spot, had 10 assists."}
{"game_id": "0022101029", "chunk_id": "0022101029_009", "order": 9, "role": "body", "text": "“We shared the ball,” Jones said. “We played fast. We played with pace. We played unselfish basketball. Instead taking a good shot, we created for someone else to have a great, wide-open shot. We had everything clicking on both ends of the floor."}
{"game_id": "0022101029", "chunk_id": "0022101029_010", "order": 10, "role": "body", "text": "“Ja has been out before this year and I just try to step in and fill his shoes the best I can,” Jones added. “We just try to get the team to continue to play the right way, play as a team and execute the game plan.”"}
{"game_id": "0022101029", "chunk_id": "0022101029_011", "order": 11, "role": "body", "text": "Memphis shot 51% while holding Indiana to 42%. The Pacers were 6 of 30 from 3-point range while the Grizzlies were 15 of 40."}
{"game_id": "0022101029", "chunk_id": "0022101029_012", "order": 12, "role": "body", "text": "The 33-point loss was the Pacers’ largest of the season, topping the previous total of 32 points to Charlotte."}
{"game_id": "0022101029", "chunk_id": "0022101029_013", "order": 13, "role": "body", "text": "The Grizzlies dominated throughout, leading by as many as 37 in the third quarter before settling for a 104-70 lead after three quarters."}
{"game_id": "0022101029", "chunk_id": "0022101029_014", "order": 14, "role": "body", "text": "In the fourth quarter, the Pacers’ Isaiah Jackson fouled out when he was called for a flagrant foul on a moving screen. Jackson actually fell over Dillon Brooks."}
{"game_id": "0022101029", "chunk_id": "0022101029_015", "order": 15, "role": "body", "text": "The Pacers' largest deficit was 43 points in the fourth quarter."}
{"game_id": "0022101029", "chunk_id": "0022101029_016", "order": 16, "role": "body", "text": "Memphis shot 55.6% in the first half to take a 74-49 halftime lead."}
{"game_id": "0022101029", "chunk_id": "0022101029_017", "order": 17, "role": "body", "text": "“I think looking at the stat sheet and remembering the game, I've got to give them a lot of credit for how they played,” Pacers coach Rick Carlisle said. “(It was) very, very difficult night.”"}
{"game_id": "0022101029", "chunk_id": "0022101029_018", "order": 18, "role": "body", "text": "Pacers guard Malcolm Brogdon said the Pacers had no chemistry on either end."}
{"game_id": "0022101029", "chunk_id": "0022101029_019", "order": 19, "role": "body", "text": "“There was no consistency,” Brogdon said. “Part of it is new team and attention to detail and coming out being ready to play. That's a real good team out there with or without Ja Morant.”"}
{"game_id": "0022101029", "chunk_id": "0022101029_021", "order": 21, "role": "body", "text": "“It's hard to forget about this,” Hield said, “We can try to flush it out of our minds, but it's human nature, especially as competitors. It'll be hard to sleep.”"}
{"game_id": "0022101029", "chunk_id": "0022101029_023", "order": 23, "role": "body", "text": "Grizzlies: Coach Taylor Jenkins said before the game he doesn’t see Morant’s back soreness as anything that will linger for multiple games. … Jackson played three seasons for Park Tudor School in Indianapolis before transferring to La Lumiere in LaPorte, Indiana."}
{"game_id": "0022101029", "chunk_id": "0022101029_024", "order": 24, "role": "body", "text": "Pacers: Brogdon returned to action after missing the past two games with a concussion. He scored 12 points. … Goga Bitzadze was listed as active, but didn’t play. He had missed Sunday’s game at Atlanta with a lingering foot injury."}
{"game_id": "0022101029", "chunk_id": "0022101029_026", "order": 26, "role": "body", "text": "The Grizzlies scored 24 fast-break points in the first half compared to zero for the Pacers. For the game, Memphis had a 33-9 edge."}
{"game_id": "0022101029", "chunk_id": "0022101029_028", "order": 28, "role": "body", "text": "Grizzlies: At Atlanta on Friday"}
