{"game_id": "0022100957", "chunk_id": "0022100957_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Ja Morant had 25 points and seven assists, Desmond Bane scored 24 points on 10-for-15 shooting and the Memphis Grizzlies routed the Orlando Magic 124-96 on Saturday night."}
{"game_id": "0022100957", "chunk_id": "0022100957_002", "order": 2, "role": "body", "text": "The victory, coupled with the Los Angeles Lakers’ 124-116 victory over Golden State later Saturday, moved Memphis into second place in the Western Conference — a half-game ahead of the Warriors and eight games behind NBA-leading Phoenix."}
{"game_id": "0022100957", "chunk_id": "0022100957_003", "order": 3, "role": "body", "text": "Tyus Jones added 14 points, and Jaren Jackson Jr. had 13 to help the Grizzlies win for the third in the last four. Jones and Memphis' other reserves had 50 points."}
{"game_id": "0022100957", "chunk_id": "0022100957_004", "order": 4, "role": "body", "text": "“Great performance by our guys,” Memphis coach Taylor Jenkins said. “Our depth was huge. I thought our starters did a great job, and the bench came out and played great.”"}
{"game_id": "0022100957", "chunk_id": "0022100957_005", "order": 5, "role": "body", "text": "The Magic were playing the second night of a back-to-back after winning at Toronto on Friday night. This time, they couldn’t keep up with Memphis as the Grizzlies' pace was too much."}
{"game_id": "0022100957", "chunk_id": "0022100957_006", "order": 6, "role": "body", "text": "“It’s allowing growth for these young men, playing two tough team back-to-back and having them feel the experience of what that’s like,” Magic coach Jahmal Mosley said. “Memphis is a darn good basketball team. They play well together. Ja is special.”"}
{"game_id": "0022100957", "chunk_id": "0022100957_007", "order": 7, "role": "body", "text": "Cole Anthony led the Magic with 19 points. Moritz Wagner added 17 points and 11 rebounds, and Franz Wagner had 15 points."}
{"game_id": "0022100957", "chunk_id": "0022100957_008", "order": 8, "role": "body", "text": "The Grizzlies recovered from a poor defensive showing in the first quarter to outscore the Magic 37-16 in the second period, building a double-digit lead that they never let dip below 20 in the second half."}
{"game_id": "0022100957", "chunk_id": "0022100957_009", "order": 9, "role": "body", "text": "“I thought we were rather loose with our defense in the first quarters,” Jenkins said, later adding: “Overall, I thought we did a much better job as the game went on.”"}
{"game_id": "0022100957", "chunk_id": "0022100957_010", "order": 10, "role": "body", "text": "Memphis used its 3-point shooting in the first half to build a 68-45 lead. The Grizzlies were 11 of 20 from outside the arc at that point, including Morant hitting all three of his enroute to 14 first-half points to go with six assists."}
{"game_id": "0022100957", "chunk_id": "0022100957_011", "order": 11, "role": "body", "text": "The Grizzlies’ 23-point halftime lead was their largest of the first half as Memphis closed the second period on a 21-5 run. The lead would stretch to 29 in the early in the third quarter and eventually reach 32."}
{"game_id": "0022100957", "chunk_id": "0022100957_012", "order": 12, "role": "body", "text": "While Memphis has become the surprise team in the Western Conference, Orlando sits at the bottom of the East, a rebuilding process and a learning curve. While Orlando is playing with a faster pace, there are still some things to work out for the young team."}
{"game_id": "0022100957", "chunk_id": "0022100957_013", "order": 13, "role": "body", "text": "“I like the way we’re playing with the pace,” Mosley said, “but obviously we have to make sure we are taking care of the basketball in that same sense.”"}
{"game_id": "0022100957", "chunk_id": "0022100957_015", "order": 15, "role": "body", "text": "While the Grizzlies have games on consecutive nights, they got a break in that it is Orlando, the worst team in the East and on Sunday against the Houston Rockets, who sit at the bottom of the West. Still, Morant says his team must lock in. “It’s not easy,” the Grizzlies leading scorer said. “Those teams are still NBA teams. Still NBA players. They’ve got a lot of guys who can score the ball. So, we have to be locked in like we’re playing one of the best teams in the league.”"}
{"game_id": "0022100957", "chunk_id": "0022100957_017", "order": 17, "role": "body", "text": "Magic: G Jalen Suggs sat out with a sprained right ankle. R.J. Hampton started in his place and missed six of his seven shots from the field. … Have 10 straight games making at least 10 3- pointers. …Orlando managed just one offensive rebound in the game. …Moritz Wagner recorded his first double-double of the season"}
{"game_id": "0022100957", "chunk_id": "0022100957_018", "order": 18, "role": "body", "text": "Grizzlies: Memphis is 8-4 in the opening game of a back-to-back. … Memphis leads the overall series with the Magic 26-25 and swept the Magic in a season series for the first time since the 2014-15 season. … Jackson has gone 2 for 17 from 3 in the last six games. …Bane has 25 games where he has scored at least 20 points."}
{"game_id": "0022100957", "chunk_id": "0022100957_020", "order": 20, "role": "body", "text": "Magic: Host Phoenix on Tuesday night."}
{"game_id": "0022100957", "chunk_id": "0022100957_021", "order": 21, "role": "body", "text": "Grizzlies: At Houston on Sunday night."}
