{"game_id": "0022100483", "chunk_id": "0022100483_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Cam Johnson played some of the best basketball of his three-year career when All-Star teammate Devin Booker was out with a hamstring injury."}
{"game_id": "0022100483", "chunk_id": "0022100483_002", "order": 2, "role": "body", "text": "Now Booker's back, Johnson's still pouring in the points, and it has made the NBA-leading Suns even more dangerous."}
{"game_id": "0022100483", "chunk_id": "0022100483_003", "order": 3, "role": "body", "text": "“It's just a fun team to play for,\" Johnson said. “You see guys coming out, playing hard and when we win games, we're just excited to play basketball. It's like we were when we were kids. That's the beauty of it.”"}
{"game_id": "0022100483", "chunk_id": "0022100483_004", "order": 4, "role": "body", "text": "Booker scored 30 points, Johnson added 21 while making five 3-pointers on 7-for-7 shooting and Phoenix won its fifth straight game, beating the Oklahoma City Thunder 113-101 on Thursday night."}
{"game_id": "0022100483", "chunk_id": "0022100483_005", "order": 5, "role": "body", "text": "Booker splashed home a long 3-pointer at the third quarter buzzer to give the Suns an 82-69 lead after they trailed by three at halftime."}
{"game_id": "0022100483", "chunk_id": "0022100483_006", "order": 6, "role": "body", "text": "Booker — the two-time All-Star who was in his third game back since missing a few weeks with a hamstring injury — gave Phoenix some momentum midway through the third quarter when he grabbed an offensive rebound and drove the baseline for a dunk. Luguentz Dort was there to meet him at the rim but fouled Booker as the ball was deflected up in the air and still somehow fell through the hoop."}
{"game_id": "0022100483", "chunk_id": "0022100483_007", "order": 7, "role": "body", "text": "It was part of an 25-9 run that helped the Suns take control."}
{"game_id": "0022100483", "chunk_id": "0022100483_008", "order": 8, "role": "body", "text": "Deandre Ayton added 19 points — including an emphatic dunk in the final minute that earned a technical after he slapped the backboard — and 12 rebounds. Chris Paul had 16 points and seven assists."}
{"game_id": "0022100483", "chunk_id": "0022100483_009", "order": 9, "role": "body", "text": "Johnson was the catalyst for another great night from the Suns' bench. He made all seven of his shots from the field while grabbing a season-high nine rebounds."}
{"game_id": "0022100483", "chunk_id": "0022100483_010", "order": 10, "role": "body", "text": "“He's been playing well for a while,” Suns coach Monty Williams said. “I've said this a number of times — we look at Cam as a starter. To bring a guy off the bench who can shoot like that, attack the basket and go to the other end and defend. He puts the work in and he's more than just a shooter.”"}
{"game_id": "0022100483", "chunk_id": "0022100483_011", "order": 11, "role": "body", "text": "The Suns improved to 26-5 for the season and have won 25 of their last 27."}
{"game_id": "0022100483", "chunk_id": "0022100483_012", "order": 12, "role": "body", "text": "Shai Gilgeous Alexander had 29 points for the Thunder, who had their three-game winning streak snapped. The Thunder shot just 38.5% from the field and 26.8% from 3-point range."}
{"game_id": "0022100483", "chunk_id": "0022100483_013", "order": 13, "role": "body", "text": "The Thunder proved a tough opponent for much of the night and rallied for a 48-45 halftime lead after trailing by as many as 15 points. Oklahoma City closed the second quarter on a 24-8 run."}
{"game_id": "0022100483", "chunk_id": "0022100483_014", "order": 14, "role": "body", "text": "“From where we have come from at the start of the year to now, 30 games later, you can definitely see improvements,” Thunder guard Josh Giddey said. \"Earlier in the year that 15-point lead would have gone to 30. Now we are able to kind of control those leads and weather the storm."}
{"game_id": "0022100483", "chunk_id": "0022100483_015", "order": 15, "role": "body", "text": "“You've got to take positives out of games like this ... We fought our way back.”"}
{"game_id": "0022100483", "chunk_id": "0022100483_017", "order": 17, "role": "body", "text": "The Suns are on a 15-game winning streak at home. It's the eighth time in franchise history that they've won 15 straight at home. They'll get a chance to stretch the winning streak to 16 against the Warriors on Christmas Day."}
{"game_id": "0022100483", "chunk_id": "0022100483_018", "order": 18, "role": "body", "text": "The 25-year-old Johnson said it's the first time he's played on Christmas at any point in his basketball career and said he has so many memories as a kid of eating a huge holiday meal and watching NBA games on TV all day and all night."}
{"game_id": "0022100483", "chunk_id": "0022100483_019", "order": 19, "role": "body", "text": "“It's like a dream come true,” Johnson said. “Playing on Christmas, getting out there, super excited for that.”"}
{"game_id": "0022100483", "chunk_id": "0022100483_021", "order": 21, "role": "body", "text": "Thunder: F Derrick Favors was out for rest. ... Dort played college basketball at Arizona State."}
{"game_id": "0022100483", "chunk_id": "0022100483_022", "order": 22, "role": "body", "text": "Suns: F/C Frank Kaminsky (knee), F Abdel Nader (knee) and F Dario Saric (knee) were all out. Kaminsky has missed the past 17 games while Nader has missed 15. Saric has been out since tearing the right ACL in his knee in Game 1 of last year's NBA Finals. ... The Suns are 22-0 when taking a lead into the fourth quarter."}
{"game_id": "0022100483", "chunk_id": "0022100483_024", "order": 24, "role": "body", "text": "Thunder: Host New Orleans on Sunday."}
{"game_id": "0022100483", "chunk_id": "0022100483_025", "order": 25, "role": "body", "text": "Suns: Host Golden State on Saturday."}
