{"game_id": "0022100662", "chunk_id": "0022100662_001", "order": 1, "role": "lead", "text": "MIAMI -- — The final rebound of the game fell into Jimmy Butler's hands just a moment or two before the final buzzer, and Bam Adebayo started celebrating for two reasons."}
{"game_id": "0022100662", "chunk_id": "0022100662_002", "order": 2, "role": "body", "text": "One, he knew Butler had just gotten a triple-double."}
{"game_id": "0022100662", "chunk_id": "0022100662_003", "order": 3, "role": "body", "text": "Two, the Miami Heat had just won his comeback game."}
{"game_id": "0022100662", "chunk_id": "0022100662_004", "order": 4, "role": "body", "text": "Tyler Herro scored 23 points, Adebayo scored 14 in his first game coming off a six-week absence following thumb surgery and the Miami Heat held off the Toronto Raptors 104-99 on Monday night."}
{"game_id": "0022100662", "chunk_id": "0022100662_005", "order": 5, "role": "body", "text": "“We’re just blessed to have a team like this,\" Adebayo said. “Everybody buys in. Everybody wants to compete. And everybody wants to get the job done.\""}
{"game_id": "0022100662", "chunk_id": "0022100662_006", "order": 6, "role": "body", "text": "Adebayo played 32 minutes, shooting 4 for 12 and grabbing nine rebounds."}
{"game_id": "0022100662", "chunk_id": "0022100662_007", "order": 7, "role": "body", "text": "“You can see his energy out there,\" Heat coach Erik Spoelstra said after his team pulled into a virtual tie with Chicago for first in the Eastern Conference. “He makes us different.\""}
{"game_id": "0022100662", "chunk_id": "0022100662_008", "order": 8, "role": "body", "text": "Butler finished with 19 points, 10 assists and 10 rebounds — the last of those coming as time was expiring, when Fred VanVleet's 3-point try missed. It was Butler's ninth triple-double with the Heat, tying LeBron James for the most in team regular-season history."}
{"game_id": "0022100662", "chunk_id": "0022100662_009", "order": 9, "role": "body", "text": "Chris Boucher scored 23 points and grabbed 10 rebounds for Toronto. VanVleet finished with 22, and Pascal Siakam added 18 points and 10 assists for the Raptors. Scottie Barnes scored 16 points, OG Anunoby scored 14 and former Heat forward Precious Achiuwa grabbed 15 rebounds for Toronto."}
{"game_id": "0022100662", "chunk_id": "0022100662_010", "order": 10, "role": "body", "text": "Siakam scored off a turnover with 1:48 left to get Toronto within 99-96, but PJ Tucker made a corner 3 with 20 seconds left — off Butler's 10th assist — to help Miami hold on."}
{"game_id": "0022100662", "chunk_id": "0022100662_011", "order": 11, "role": "body", "text": "Toronto basically used a six-man rotation, with those players getting between 34 and 42 minutes. The only other Raptor who got minutes was Justin Champagnie, who played 9:07 before leaving with a dislocated finger."}
{"game_id": "0022100662", "chunk_id": "0022100662_012", "order": 12, "role": "body", "text": "“We played as tough as we could,” Raptors coach Nick Nurse said. “I didn’t see anything that was changing. We were battling from start to finish. ... That one could have went either way. It was a hell of an effort by our guys.”"}
{"game_id": "0022100662", "chunk_id": "0022100662_013", "order": 13, "role": "body", "text": "The game was expected to be the first time that Heat guard Kyle Lowry faced the Raptors since leaving Toronto for Miami this past season. Lowry helped Toronto win the 2019 NBA title on his way to claiming to the unofficial moniker of GROAT — the Greatest Raptor Of All-Time."}
{"game_id": "0022100662", "chunk_id": "0022100662_014", "order": 14, "role": "body", "text": "Lowry missed the game for personal reasons."}
{"game_id": "0022100662", "chunk_id": "0022100662_015", "order": 15, "role": "body", "text": "“I wanted to see him, obviously,” Nurse said."}
{"game_id": "0022100662", "chunk_id": "0022100662_016", "order": 16, "role": "body", "text": "Lowry missed a pretty good one."}
{"game_id": "0022100662", "chunk_id": "0022100662_017", "order": 17, "role": "body", "text": "There were 22 lead changes and 10 ties in the first 35 minutes, putting the teams knotted at 75-75 late in the third. Herro scored the last five points of the third quarter, then had the first bucket of the fourth to put Miami up by seven."}
{"game_id": "0022100662", "chunk_id": "0022100662_018", "order": 18, "role": "body", "text": "The Heat wouldn’t trail again. Anunoby made a 3-pointer with 6:57 left to get Toronto within two, but Miami scored the next seven points in a span of 59 seconds — a basket by Adebayo, a corner 3 from Max Strus and a driving layup by Caleb Martin for a 98-89 lead."}
{"game_id": "0022100662", "chunk_id": "0022100662_020", "order": 20, "role": "body", "text": "Raptors: Gary Trent Jr. (ankle) was listed as questionable and has been doing some on-court work but wound up missing his fifth consecutive game. ... Khem Birch, who broke his nose and needed surgery last week, is likely to miss about two weeks. ... Each of VanVleet’s first 10 shot attempts were 3-pointers. ... Toronto used a 17th starting lineup of the season. The Raptors have had only four lineups start at least four games."}
{"game_id": "0022100662", "chunk_id": "0022100662_021", "order": 21, "role": "body", "text": "Heat: Chicago, Brooklyn, Milwaukee and Philadelphia — the teams that started Monday closest to Miami in the East standings — all lost on Monday. ... Gabe Vincent scored 15 points for the Heat. ... Floyd Mayweather Jr., a regular at Heat games in recent years, sat courtside. ... The Heat are 3-5 on Mondays this season. They’re 25-11 on all other days. ... Adebayo wore a wrap to protect his repaired thumb. ... Lowry’s next game will be the 1,000th regular season appearance of his career."}
{"game_id": "0022100662", "chunk_id": "0022100662_023", "order": 23, "role": "body", "text": "Monday’s game was the first of three Heat-Raptors meetings in a span of 16 days. The teams play again in Miami on Jan. 29 and then the Heat visit Toronto — potentially Lowry’s first game back since his departure — on Feb. 1. It’s unclear if fans will be back at Raptors games by then; Miami also visits Toronto on April 3."}
{"game_id": "0022100662", "chunk_id": "0022100662_025", "order": 25, "role": "body", "text": "With Adebayo back, it meant rookie center Omer Yurtseven was the odd man out in the Heat rotation. Yurtseven had averaged 11.6 points and 13.4 rebounds in his last 14 appearances, but didn't play on Monday. Yurtseven’s 14-game streak of double-digit rebounds is the second-longest in the NBA this season behind Utah’s Rudy Gobert, who entered Monday with an 18-game streak of at least 10 rebounds."}
{"game_id": "0022100662", "chunk_id": "0022100662_027", "order": 27, "role": "body", "text": "Monday marked Toronto’s 41st game of the season — meaning all 30 NBA teams have now reached the midway point of their planned 82-game campaigns. The Raptors (21-20) are over .500 at the halfway mark for the eighth time in the last nine seasons, the exception being last season. “There’s been a lot of positives,” Nurse said."}
{"game_id": "0022100662", "chunk_id": "0022100662_029", "order": 29, "role": "body", "text": "Raptors: Visit Dallas on Wednesday."}
{"game_id": "0022100662", "chunk_id": "0022100662_030", "order": 30, "role": "body", "text": "Heat: Host Portland on Wednesday."}
