{"game_id": "0022100421", "chunk_id": "0022100421_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Playing without stars Giannis Antetokounmpo and Khris Middleton, the Milwaukee Bucks leaned on Jrue Holiday and had a 21-0 fourth-quarter run to beat the Indiana Pacers 114-99 on Wednesday night."}
{"game_id": "0022100421", "chunk_id": "0022100421_002", "order": 2, "role": "body", "text": "“Just a lot of decision making, making a lot of plays, just a lot of trying to get in the paint,\" Holiday said. \"It was a lot, but it was fun.”"}
{"game_id": "0022100421", "chunk_id": "0022100421_003", "order": 3, "role": "body", "text": "Holiday had 26 points and 14 assists."}
{"game_id": "0022100421", "chunk_id": "0022100421_004", "order": 4, "role": "body", "text": "“He just takes what the game gives him,\" Bucks coach Mike Budenholzer said. \"He’s got incredible poise and calm and confidence. He’s going to make the right read and the right play very, very often. I think his leadership, regardless of who’s here, is pretty significant, but I think it goes to another level on a night like tonight.”"}
{"game_id": "0022100421", "chunk_id": "0022100421_005", "order": 5, "role": "body", "text": "Tied at 87 after three quarters, Milwaukee surged ahead early in the fourth quarter with the big run. The Bucks raced to a 112-92 lead with just over three minutes left, with Pat Connaughton and Jordan Nwora each scoring eight points during the run. Both finished with 20 points."}
{"game_id": "0022100421", "chunk_id": "0022100421_006", "order": 6, "role": "body", "text": "Antetokounmpo, averaging 27 points, 11.6 rebounds and 5.8 assists, entered the league’s health and safety protocols list Tuesday. Middleton, averaging 17.8 points, exited with a hyperextended left knee late in the third quarter Monday night in Boston."}
{"game_id": "0022100421", "chunk_id": "0022100421_007", "order": 7, "role": "body", "text": "Domantas Sabonis had 16 points and 14 rebounds for Indiana. Caris LeVert scored 14 of Indiana’s first 20 points and finished with 16."}
{"game_id": "0022100421", "chunk_id": "0022100421_008", "order": 8, "role": "body", "text": "Milwaukee has won five of its last eight. It has won seven straight against Indiana. Indiana had won three of its previous four games, following a four-game losing streak."}
{"game_id": "0022100421", "chunk_id": "0022100421_009", "order": 9, "role": "body", "text": "Indiana coach Rick Carlisle missed his third game since testing positive for COVID-19. Assistant Lyd Pierce filled in."}
{"game_id": "0022100421", "chunk_id": "0022100421_010", "order": 10, "role": "body", "text": "Budenholzer said he did not know how long Antetokounmpo would be out, but said Middleton could return Friday night at New Orleans"}
{"game_id": "0022100421", "chunk_id": "0022100421_011", "order": 11, "role": "body", "text": "The team has not said whether Antetokounmpo tested positive for COVID-19. Antetokounmpo said at the league’s media day in September that he was vaccinated."}
{"game_id": "0022100421", "chunk_id": "0022100421_013", "order": 13, "role": "body", "text": "Pacers: F Justin Holiday returned. The younger brother of Jrue Holiday missed six games after entering the health and safety protocols Nov. 30. … The team waived rookie G DeJon Jarreau and signed rookie G Terry Taylor."}
{"game_id": "0022100421", "chunk_id": "0022100421_014", "order": 14, "role": "body", "text": "Bucks: Budenholzer said of Antetokounmpo: “We’ll follow all the guidelines that the league has laid out and hope that he’s just healthy and taking care of himself.”...Wesley Matthews and Donte DiVincenzo are also on the health and protocols list."}
{"game_id": "0022100421", "chunk_id": "0022100421_016", "order": 16, "role": "body", "text": "Entering Wednesday, only Antetokounmpo and the Nuggets’ Nikola Jokić were averaging at least 25 points, 10 rebounds and five assists...Sabonis and the Pelicans’ Jonas Valanciunas lead the league with 23 double-doubles...Pacers C Myles Turner entered Wednesday leading the NBA in blocked shots with 78."}
{"game_id": "0022100421", "chunk_id": "0022100421_018", "order": 18, "role": "body", "text": "Pacers: Host Detroit on Thursday night."}
{"game_id": "0022100421", "chunk_id": "0022100421_019", "order": 19, "role": "closing", "text": "Bucks: At New Orleans on Friday night."}
