{"game_id": "0022100230", "chunk_id": "0022100230_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — LaMelo Ball had a season-high 32 points and the Charlotte Hornets held off a furious second-half rally from Indiana's backups to beat the Pacers 121-118 on Friday night for their fifth straight victory."}
{"game_id": "0022100230", "chunk_id": "0022100230_002", "order": 2, "role": "body", "text": "Gordon Hayward added 25 points, and Kelly Oubre Jr. had 16 to finish off a 4-0 homestand that included wins over Golden State and Washington."}
{"game_id": "0022100230", "chunk_id": "0022100230_003", "order": 3, "role": "body", "text": "\"I feel like we are really locking in on defense right now,\" said Ball, who also had 11 rebounds and eight assists."}
{"game_id": "0022100230", "chunk_id": "0022100230_004", "order": 4, "role": "body", "text": "The Hornets appeared to be on cruise control after building a 25-point third quarter lead that prompted Pacers coach Rick Carlisle to bench his starters for the remainder of the game."}
{"game_id": "0022100230", "chunk_id": "0022100230_005", "order": 5, "role": "body", "text": "Carlisle said “the energy wasn't good\" from his starting unit and that “we needed some fighters in there.”"}
{"game_id": "0022100230", "chunk_id": "0022100230_007", "order": 7, "role": "body", "text": "Jeremy Lamb scored 23 points in 16 second-half minutes and Brad Wanamaker came up with several big plays as the Pacers methodically cut into Charlotte's lead."}
{"game_id": "0022100230", "chunk_id": "0022100230_008", "order": 8, "role": "body", "text": "The Hornets, who had just one turnover in the first half, committed 16 in the second including an ill-advised full-court baseball from Ball that sailed off the hands of teammates Miles Bridges with 16.2 seconds left — and earned Ball a spot on the bench."}
{"game_id": "0022100230", "chunk_id": "0022100230_009", "order": 9, "role": "body", "text": "Ball's turnover caused the crowd to let out a collective gasp, and gave the Pacers a chance to send the game into overtime. But with the Pacers out of timeouts Carlisle was unable to set up a play and Indiana couldn't get a 3-point shot off before the final buzzer."}
{"game_id": "0022100230", "chunk_id": "0022100230_010", "order": 10, "role": "body", "text": "“They mucked up the game,” Hayward said of Indiana's comeback. \"They trapped (us), made it unorthodox.”"}
{"game_id": "0022100230", "chunk_id": "0022100230_011", "order": 11, "role": "body", "text": "Carlisle said he never thought about putting the starters back in — even after it became a single-digit game."}
{"game_id": "0022100230", "chunk_id": "0022100230_012", "order": 12, "role": "body", "text": "“These other guys earned a chance to win the game,” Carlisle said. “They almost did it. They almost pulled what would have been a hell of a small miracle. ... They got it to a one-possession game with the ball, so they did an amazing job out there.\""}
{"game_id": "0022100230", "chunk_id": "0022100230_013", "order": 13, "role": "body", "text": "Lamb, a former Hornet, made four 3-pointers and was 7 of 7 from the foul line."}
{"game_id": "0022100230", "chunk_id": "0022100230_014", "order": 14, "role": "body", "text": "“I was happy that we just kept fighting,\" Lamb said. “We had nothing to lose. We kept playing, keep getting to the line, keep being physical on both ends. ... We have to play like that the whole game. We can’t wait until we are down 20 or 25” points."}
{"game_id": "0022100230", "chunk_id": "0022100230_015", "order": 15, "role": "body", "text": "Hornets coach James Borrego said his team played one of its best games for 2 1/2 quarters but got stagnant after building a big lead."}
{"game_id": "0022100230", "chunk_id": "0022100230_016", "order": 16, "role": "body", "text": "“That is something I have to look at to see if I could’ve kept them more in attack mode,” Borrego said. “We still want to maintain an aggressive mentality, that is what got us the lead. I’ve seen this countless times in the NBA. It is a long 48-minute game. You don’t want to take your foot off the gas.\""}
{"game_id": "0022100230", "chunk_id": "0022100230_017", "order": 17, "role": "body", "text": "Ball was spectacular in the first half, scoring 21 points."}
{"game_id": "0022100230", "chunk_id": "0022100230_018", "order": 18, "role": "body", "text": "At one point attacking the Pacers 1 on 4 in transition and scoring anyway with a scooping layup while drawing a foul on Goga Bitadze for a 3-point play. Later he added step-back 3-pointer from the right wing that spun defender Torrey Craig around."}
{"game_id": "0022100230", "chunk_id": "0022100230_019", "order": 19, "role": "body", "text": "“I just felt like I wanted to be more aggressive,” said Ball, who had 31 points in the team's previous win against Indiana."}
{"game_id": "0022100230", "chunk_id": "0022100230_021", "order": 21, "role": "body", "text": "Carlisle said he planned to watch the game film before making any decisions about changing up the starting lineup moving forward."}
{"game_id": "0022100230", "chunk_id": "0022100230_022", "order": 22, "role": "body", "text": "“The NBA has become a hard-play league,” Carlisle said. “It’s been one of the great things about the evolution of today’s games. It’s highly skilled and highly competitive and if you don’t compete the right way, you get kicked in the face.”"}
{"game_id": "0022100230", "chunk_id": "0022100230_024", "order": 24, "role": "body", "text": "Pacers Malcolm Brogdon and Damantas Sabonis were the only Indiana starters to play more than 20 minutes. Brogdon has 16 points. ... Shot 30.6% from 3-point range. ... Indiana's bench players had two turnovers; the starters had eight."}
{"game_id": "0022100230", "chunk_id": "0022100230_025", "order": 25, "role": "body", "text": "Hornets: Shot 54.3% from the field. ... Had 28 assists."}
{"game_id": "0022100230", "chunk_id": "0022100230_027", "order": 27, "role": "body", "text": "Pacers: Host New Orleans on Saturday night."}
{"game_id": "0022100230", "chunk_id": "0022100230_028", "order": 28, "role": "body", "text": "Hornets: At Atlanta on Saturday night."}
