{"game_id": "0022100220", "chunk_id": "0022100220_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Anthony Edwards scored 16 of his 26 points in the fourth quarter and Karl-Anthony Towns had 22 for the Minnesota Timberwolves in a 107-97 win against the Sacramento Kings on Wednesday night."}
{"game_id": "0022100220", "chunk_id": "0022100220_002", "order": 2, "role": "body", "text": "Patrick Beverley added 14 points, six rebounds and six assists for Minnesota, which lost eight of its previous nine games. The Timberwolves’ improved defense held Sacramento to 36.6% shooting and forced 20 turnovers."}
{"game_id": "0022100220", "chunk_id": "0022100220_003", "order": 3, "role": "body", "text": "Edwards hit four 3-pointers in the fourth to push Minnesota to just its third win in 10 home games."}
{"game_id": "0022100220", "chunk_id": "0022100220_004", "order": 4, "role": "body", "text": "“He’s a streak player,” Timberwolves coach Chris Finch said. “When he hits one or two, his confidence goes sky high. He had a great layup I think to start the fourth which maybe broke the ice a little bit for him.”"}
{"game_id": "0022100220", "chunk_id": "0022100220_005", "order": 5, "role": "body", "text": "De’Aaron Fox had 28 points for the Kings and Buddy Hield finished with 16 off the bench. Sacramento had a season-high 20 offensive rebounds but lost for the fifth time in six games."}
{"game_id": "0022100220", "chunk_id": "0022100220_006", "order": 6, "role": "body", "text": "“We didn’t do anything to impose our will on the game,” Kings coach Luke Walton said. “We did offensive rebound. We rebounded the ball pretty well tonight. Two transition points, that’s just us not being committed to playing how we want to play.”"}
{"game_id": "0022100220", "chunk_id": "0022100220_007", "order": 7, "role": "body", "text": "Prior to the game, Walton stressed the need for better rebounding from his team, repeatedly mentioning it in regards to matchups in the game and potential lineups going forward."}
{"game_id": "0022100220", "chunk_id": "0022100220_008", "order": 8, "role": "body", "text": "The rebounding kept Sacramento in the game."}
{"game_id": "0022100220", "chunk_id": "0022100220_009", "order": 9, "role": "body", "text": "The Kings had 13 offensive rebounds in the first half, led by Richaun Holmes with four. The focus resulted in 16 second-chance points and a close game despite the poor shooting and heavy turnover totals."}
{"game_id": "0022100220", "chunk_id": "0022100220_010", "order": 10, "role": "body", "text": "“When we went small with our more spacing, offensive group, we struggled to rebound,” Walton said. “When we went big with our rebounding group, we rebounded but we didn’t make shots or take advantage of our stops. It’s a balance that we’ve got to figure out. We've got to be more consistent and be able to play both styles.”"}
{"game_id": "0022100220", "chunk_id": "0022100220_011", "order": 11, "role": "body", "text": "Minnesota also struggled shooting in a lackluster first half for both teams."}
{"game_id": "0022100220", "chunk_id": "0022100220_012", "order": 12, "role": "body", "text": "Towns finally took control in the third quarter. He scored the first seven points of the second half and the Wolves used a 10-2 run to take command."}
{"game_id": "0022100220", "chunk_id": "0022100220_013", "order": 13, "role": "body", "text": "The lead grew to eight and Minnesota found its shooting touch by going 13 of 20 from the field and 4 of 7 from 3-point range in the third quarter."}
{"game_id": "0022100220", "chunk_id": "0022100220_014", "order": 14, "role": "body", "text": "Hield, too, found his shooting stroke after going 1 of 10 in the first half. He hit four 3s and had Sacramento within one early in the fourth until Edwards countered and Minnesota pulled away."}
{"game_id": "0022100220", "chunk_id": "0022100220_015", "order": 15, "role": "body", "text": "“I feel good about this. There’s no bad wins in the NBA,” Towns said. “This is a good win. I’m very happy about how we played. I’m happy about how we fought. Like I said before, it’s about consistency with us. How much can we do this in a row?\""}
{"game_id": "0022100220", "chunk_id": "0022100220_017", "order": 17, "role": "body", "text": "Following a 1/3 road trip, veteran center Tristan Thompson spoke candidly about the Kings’ recent struggles and displayed his frustration, often times with expletives. He spoke about how the four teams Sacramento played are likely in rebuilding situations."}
{"game_id": "0022100220", "chunk_id": "0022100220_018", "order": 18, "role": "body", "text": "“I think at the end of the day, the reality is this road trip should have been a 4-0,” Thompson said, breaking down each of Oklahoma City, San Antonio, Detroit and Minnesota. “Those teams, three out of those four teams really didn’t want to win those games. They’re probably (ticked off) that they even won those games. Tonight was another night, these are the games you have to win. If you’re trying to be in the playoffs or be in the play-in game, these are the wins that you have to capitalize on.”"}
{"game_id": "0022100220", "chunk_id": "0022100220_019", "order": 19, "role": "body", "text": "Thompson harped on the team’s defense, which allowed Minnesota to shoot 62.5% in the second half and 50% for the game. A 10-year veteran, Thompson also said it’s not on Walton to inspire the team and said the team is united in trying to solve its issues."}
{"game_id": "0022100220", "chunk_id": "0022100220_020", "order": 20, "role": "body", "text": "“No man in this world should rely on another man to inspire him,” Thompson said. “Point-blank, you can put that in all capitals. Me personally, no one should ever need a coach to inspire you. If you don’t get inspired in the game, then you shouldn’t be on the court.”"}
{"game_id": "0022100220", "chunk_id": "0022100220_022", "order": 22, "role": "body", "text": "Kings: Finished with 47 rebounds after entering 19th in the NBA at 45.2 per game. ... The 20 turnovers were four off a season high. ... Holmes had 12 points and seven rebounds. He didn’t have an offensive rebound in the second half."}
{"game_id": "0022100220", "chunk_id": "0022100220_023", "order": 23, "role": "body", "text": "Timberwolves: Josh Okogie was inactive with back spasms. Naz Reid returned after missing one game with right foot soreness and led the reserves with eight points. … It marked the fourth time this season Minnesota has held a team under 40% shooting. … The Wolves tied a season high with 56 points in the paint."}
{"game_id": "0022100220", "chunk_id": "0022100220_025", "order": 25, "role": "body", "text": "Kings: Return home against Toronto on Friday."}
{"game_id": "0022100220", "chunk_id": "0022100220_026", "order": 26, "role": "body", "text": "Timberwolves: Host San Antonio on Thursday for their first back-to-back of the season."}
