{"game_id": "0022100412", "chunk_id": "0022100412_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Marcus Morris had season highs of 24 points and 11 rebounds, leading the Los Angeles Clippers to a 111-95 victory over the Phoenix Suns on Monday night in the teams’ first meeting since the Western Conference finals."}
{"game_id": "0022100412", "chunk_id": "0022100412_002", "order": 2, "role": "body", "text": "The Suns defeated the Clippers in six games last season to reach the NBA Finals, where they lost to Milwaukee. Phoenix has kept up the momentum this season, leading the West with a 21-5 record."}
{"game_id": "0022100412", "chunk_id": "0022100412_003", "order": 3, "role": "body", "text": "It wasn't quite the rematch from the playoffs, with both teams missing their stars. The Suns were without Deandre Ayton and Devin Booker, while Paul George and Kawhi Leonard sat out for the Clippers."}
{"game_id": "0022100412", "chunk_id": "0022100412_004", "order": 4, "role": "body", "text": "“It definitely didn't feel like that,” Morris said of Monday's game compared to last spring's playoffs."}
{"game_id": "0022100412", "chunk_id": "0022100412_005", "order": 5, "role": "body", "text": "Morris had his first double-double since joining the Clippers in February 2020."}
{"game_id": "0022100412", "chunk_id": "0022100412_006", "order": 6, "role": "body", "text": "“Throughout my career, anytime I have a big rebounding game, I’m scoring the ball,” he said."}
{"game_id": "0022100412", "chunk_id": "0022100412_007", "order": 7, "role": "body", "text": "Reggie Jackson added 19 points and Terance Mann had 17 points and nine rebounds for the Clippers, who won their fourth in a row."}
{"game_id": "0022100412", "chunk_id": "0022100412_008", "order": 8, "role": "body", "text": "“We're just getting contributions from all of our guys,” Clippers coach Tyronn Lue said. “Our whole team did a good job of just chipping in.”"}
{"game_id": "0022100412", "chunk_id": "0022100412_009", "order": 9, "role": "body", "text": "Cam Johnson led Phoenix with 17 points off the bench. Mikal Bridges added 16 points. Chris Paul was held to nine points and eight assists against his former team."}
{"game_id": "0022100412", "chunk_id": "0022100412_010", "order": 10, "role": "body", "text": "“Against CP, we tried to slow him down and give him different looks,” Lue said. “To slow him down a little bit was huge for us.”"}
{"game_id": "0022100412", "chunk_id": "0022100412_011", "order": 11, "role": "body", "text": "The Suns' only lead came on the game's first basket by Jae Crowder. They missed 12 of 13 shots at the start while the Clippers built a 10-point lead. Crowder and JaVale McGee picked up two fouls apiece in the first quarter."}
{"game_id": "0022100412", "chunk_id": "0022100412_012", "order": 12, "role": "body", "text": "Phoenix was in pursuit the rest of the way. The Suns missed 60 of 96 shots from the field."}
{"game_id": "0022100412", "chunk_id": "0022100412_013", "order": 13, "role": "body", "text": "“We were out of rhythm all night. We just couldn’t knock down shots,” Suns coach Monty Williams said. “If you're missing shots, you're playing in transition a lot.”"}
{"game_id": "0022100412", "chunk_id": "0022100412_014", "order": 14, "role": "body", "text": "The Clippers outscored the Suns 15-6 to start the fourth, building a 19-point lead. Five different players scored, highlighted by Mann's one-handed jam, Isaiah Hartenstein's floater and Luke Kennard's 3-pointer."}
{"game_id": "0022100412", "chunk_id": "0022100412_015", "order": 15, "role": "body", "text": "Paul was called for an offensive foul and a technical in the second shortly before Crowder and McGee earned their third fouls apiece. Crowder finished with six points and four fouls. McGee had 13 points and 13 rebounds."}
{"game_id": "0022100412", "chunk_id": "0022100412_016", "order": 16, "role": "body", "text": "The Clippers extended their lead to 15 points late in the second. They sank 5 of 6 free throws down the stretch to go up 56-44 at halftime."}
{"game_id": "0022100412", "chunk_id": "0022100412_017", "order": 17, "role": "body", "text": "LA opened the third with a 10-5 spurt, bookended by dunks from Ivica Zubac, for a 17-point lead."}
{"game_id": "0022100412", "chunk_id": "0022100412_018", "order": 18, "role": "body", "text": "The Suns cut their deficit to 10 points a handful of times but trailed 79-69 going into the fourth."}
{"game_id": "0022100412", "chunk_id": "0022100412_020", "order": 20, "role": "body", "text": "Suns: Ayton and Jalen Smith sat out because of non-COVID-19 illnesses. ... Booker remained out with a strained left hamstring. ... They fell to 5-1 in the first game of back-to-backs."}
{"game_id": "0022100412", "chunk_id": "0022100412_021", "order": 21, "role": "body", "text": "Clippers: Longest winning streak of season since they won seven straight last month. ... George missed his third straight game because of a right elbow contusion. ... Serge Ibaka earned his third DNP in a row due to a coach's decision."}
{"game_id": "0022100412", "chunk_id": "0022100412_023", "order": 23, "role": "body", "text": "Suns: Visit Portland on Tuesday to complete the road back-to-back."}
{"game_id": "0022100412", "chunk_id": "0022100412_024", "order": 24, "role": "body", "text": "Clippers: Visit Utah on Wednesday in the first of a two-game trip."}
