{"game_id": "0022101216", "chunk_id": "0022101216_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Four wins in the final week sent the Brooklyn Nets surging up to seventh in the Eastern Conference."}
{"game_id": "0022101216", "chunk_id": "0022101216_002", "order": 2, "role": "body", "text": "One more win sends them to the playoffs."}
{"game_id": "0022101216", "chunk_id": "0022101216_003", "order": 3, "role": "body", "text": "“Now we get to carry some of that momentum on into Tuesday,” Kyrie Irving said."}
{"game_id": "0022101216", "chunk_id": "0022101216_004", "order": 4, "role": "body", "text": "Irving scored 35 points, Kevin Durant had 20 points, a career-high 16 assists and 10 rebounds and the Nets locked up seventh place with a 134-126 victory over the Indiana Pacers on Sunday."}
{"game_id": "0022101216", "chunk_id": "0022101216_005", "order": 5, "role": "body", "text": "The Nets will host No. 8 Cleveland on Tuesday in the play-in tournament, with the winner moving into the playoffs as the No. 7 seed. The loser will have a second chance by hosting the winner of the game between the Nos. 9 and 10 seeds on Friday."}
{"game_id": "0022101216", "chunk_id": "0022101216_006", "order": 6, "role": "body", "text": "Brooklyn and Cleveland both finished 44-38, but the Nets won the season series to take the tiebreaker."}
{"game_id": "0022101216", "chunk_id": "0022101216_007", "order": 7, "role": "body", "text": "Durant shot just 5 for 17 from the field but finished with his fourth triple-double, his highest total in any season. Andre Drummond added 20 points, shooting 9 for 9, and 13 rebounds. Bruce Brown scored 21 points in the Nets' fourth straight victory to wrap up the regular season."}
{"game_id": "0022101216", "chunk_id": "0022101216_008", "order": 8, "role": "body", "text": "The Nets began the final week in danger of finishing ninth or 10th, which would’ve meant needing two wins — at least one on the road — in the play-in to get into the postseason."}
{"game_id": "0022101216", "chunk_id": "0022101216_009", "order": 9, "role": "body", "text": "But they took advantage of a soft schedule in their final days, with victories over Houston and New York before beating Cleveland on Friday. The Nets needed to finish strong after an uneven regular season."}
{"game_id": "0022101216", "chunk_id": "0022101216_010", "order": 10, "role": "body", "text": "“We stayed with it. We all had one goal in mind and we saw it through,” Drummond said. “We finished off the year great.”"}
{"game_id": "0022101216", "chunk_id": "0022101216_011", "order": 11, "role": "body", "text": "Oshae Brissett scored 28 points for the Pacers, who lost their final 10 games to finish 25-57. Indiana didn't win after March 20. Buddy Hield added 21."}
{"game_id": "0022101216", "chunk_id": "0022101216_012", "order": 12, "role": "body", "text": "The Nets made 20 of their first 26 shots — Durant was 0 for 5, the rest of the team 20 for 21 — and opened a 47-29 lead just over a minute into the second quarter."}
{"game_id": "0022101216", "chunk_id": "0022101216_013", "order": 13, "role": "body", "text": "The Nets led 76-60 at halftime but the Pacers began the third quarter with a 17-2 run to make it a one-point game. Terry Taylor's basket tied it at 91, but Irving made a 3-pointer before Durant scored and then threw a lob to Nic Claxton for a dunk that quickly pushed it back to 98-91."}
{"game_id": "0022101216", "chunk_id": "0022101216_014", "order": 14, "role": "body", "text": "“It’s tough playing against Irving and Durant, but guys just stayed with it and got back into the game, gave ourselves a chance,” Pacers coach Rick Carlisle said."}
{"game_id": "0022101216", "chunk_id": "0022101216_015", "order": 15, "role": "body", "text": "The Pacers kept trying to come back, even after the Nets regained a double-digit lead, but Irving answered with baskets a couple times when it got close. He shot 15 for 20."}
{"game_id": "0022101216", "chunk_id": "0022101216_016", "order": 16, "role": "body", "text": "“That's what makes them all-time greats,” guard T.J. McConnell said of Irving and Durant. “If someone thinks that they're going to guard Kyrie 1 on 1 and be effective, I think you may have another thing coming.”"}
{"game_id": "0022101216", "chunk_id": "0022101216_018", "order": 18, "role": "body", "text": "Pacers: Duane Washington Jr. scored 18 points. Tyrese Haliburton had 17 points and 10 assists."}
{"game_id": "0022101216", "chunk_id": "0022101216_019", "order": 19, "role": "body", "text": "Nets: Seth Curry missed the game with left ankle soreness. ... Coach Steve Nash said that G Goran Dragic, who missed his fifth straight game while in health and safety protocols, has been feeling better and could play Tuesday if he is cleared in time."}
{"game_id": "0022101216", "chunk_id": "0022101216_021", "order": 21, "role": "body", "text": "Ben Simmons, who still hasn't played for the Nets since being acquired from Philadelphia at the trade deadline, worked out on the court before the game. Nash provided a positive update on the 2016 No. 1 pick, who has been battling back problems that include a herniated disk."}
{"game_id": "0022101216", "chunk_id": "0022101216_022", "order": 22, "role": "body", "text": "“He’s doing a little bit of movement,” Nash said. “Still 1-on-0 stuff, so he still got a lot of milestones to reach, but it’s positive. At least he’s moving around a little bit.”"}
{"game_id": "0022101216", "chunk_id": "0022101216_024", "order": 24, "role": "closing", "text": "Kessler Edwards started on the day the Nets signed him to a standard NBA contract, making him eligible to play in the postseason. The second-round pick from Pepperdine had a two-way deal, which wouldn’t have allowed him to play next week."}
