{"game_id": "0022100151", "chunk_id": "0022100151_001", "order": 1, "role": "lead", "text": "DENVER -- — Nikola Jokic had 25 points, 15 rebounds and 10 assists before the NBA MVP was ejected for violently slamming his shoulder into Markieff Morris, and the Denver Nuggets beat the Miami Heat 113-96 on Monday night."}
{"game_id": "0022100151", "chunk_id": "0022100151_002", "order": 2, "role": "body", "text": "The Heat said Morris has an apparent neck injury. Jokic said he saw a replay of the altercation and recoiled when he saw how hard Morris’ head hit the floor."}
{"game_id": "0022100151", "chunk_id": "0022100151_003", "order": 3, "role": "body", "text": "“I felt bad, really bad,” Jokic said."}
{"game_id": "0022100151", "chunk_id": "0022100151_004", "order": 4, "role": "body", "text": "Will Barton scored 25 points and Jeff Green, who started in place of an injured Michael Porter Jr., added 13 points for the Nuggets. Denver held the opposition to under 100 points for the seventh time this season."}
{"game_id": "0022100151", "chunk_id": "0022100151_005", "order": 5, "role": "body", "text": "Jimmy Butler had 31 points to lead the Heat, and Duncan Robinson had 13."}
{"game_id": "0022100151", "chunk_id": "0022100151_006", "order": 6, "role": "body", "text": "With 2:39 remaining, Morris elbowed Jokic in the midsection at half court. Jokic retaliated with a hard shove from behind with his upper arm/shoulder that knocked Morris to the floor. Morris rolled in pain as teammates pushed Jokic away. Medical personnel brought a stretcher onto the floor but Morris was able to get up and walk off the floor on his own."}
{"game_id": "0022100151", "chunk_id": "0022100151_007", "order": 7, "role": "body", "text": "“We wanted to make sure Kieff was and is OK. We’ll find out more,” Heat coach Erik Spoelstra said of the apparent neck injury. “He’s moving around right now in the locker room. But that was a very dangerous, dirty play.”"}
{"game_id": "0022100151", "chunk_id": "0022100151_008", "order": 8, "role": "body", "text": "Morris was assessed a flagrant foul and ejected, Jokic also was ejected and Butler received a technical foul."}
{"game_id": "0022100151", "chunk_id": "0022100151_009", "order": 9, "role": "body", "text": "Spoelstra said Jokic’s actions were “absolutely uncalled for.” Jokic, on the other hand, said Morris’ hit went beyond a hard foul."}
{"game_id": "0022100151", "chunk_id": "0022100151_010", "order": 10, "role": "body", "text": "“I felt I just needed to protect myself but on the other hand I’m not supposed to react that way, get thrown out of the game,” Jokic said."}
{"game_id": "0022100151", "chunk_id": "0022100151_011", "order": 11, "role": "body", "text": "Green called it “a play that shouldn’t happen.”"}
{"game_id": "0022100151", "chunk_id": "0022100151_012", "order": 12, "role": "body", "text": "“I think Markieff just went and tried to make a hard foul. I don’t think he had any intention of hurting Joker,\" he said. \"But sometimes when things like that happen, you don’t know the intention of the other person and you just react and that’s what Joker did.”"}
{"game_id": "0022100151", "chunk_id": "0022100151_013", "order": 13, "role": "body", "text": "Up by 15 at the half, the Nuggets scored 11 of the first 16 points in the third quarter, pushing their lead to 75-54 on a driving layup by Green off a feed from Jokic. Denver took a 91-70 lead into the fourth quarter."}
{"game_id": "0022100151", "chunk_id": "0022100151_014", "order": 14, "role": "body", "text": "Butler hit successive 3s around a basket by Jokic as Miami pulled to within 105-92 with jut over four minutes remaining before Barton connected on successive 3s to seal the win for Denver."}
{"game_id": "0022100151", "chunk_id": "0022100151_015", "order": 15, "role": "body", "text": "The Nuggets built a 64-49 lead at halftime, fueled by Jokic, Barton and Morris, all of whom were in double figures scoring by the intermission."}
{"game_id": "0022100151", "chunk_id": "0022100151_017", "order": 17, "role": "body", "text": "Miami’s Duncan Robinson hit a 3-pointer in the first quarter, his 58th consecutive game with at least one three. The streak stands out as a personal and franchise record, eclipsing his streak of 57 in a row in 2019-20."}
{"game_id": "0022100151", "chunk_id": "0022100151_019", "order": 19, "role": "body", "text": "Heat: G-F Max Strus remains sidelined by a left knee sprain."}
{"game_id": "0022100151", "chunk_id": "0022100151_020", "order": 20, "role": "body", "text": "Nuggets: F Porter was ruled out because of low back pain. He left Saturday night’s game against Houston early due to back problems. Coach Michael Malone said that team doctors are evaluating Porter’s back injury and don’t have a definitive prognosis. “Obviously, this is a process where we’re being very cautious,” Malone said. “Talking to doctors, getting imaging, all that kind of stuff. As of right now, he’s out tonight and aside from that really can’t say too much at the moment.”"}
{"game_id": "0022100151", "chunk_id": "0022100151_022", "order": 22, "role": "body", "text": "Heat: Continue a five-game road trip Wednesday night at the Los Angeles Lakers."}
{"game_id": "0022100151", "chunk_id": "0022100151_023", "order": 23, "role": "closing", "text": "Nuggets: Host Indiana on Wednesday night."}
