{"game_id": "0022100707", "chunk_id": "0022100707_002", "order": 2, "role": "body", "text": "Nikola Jokic scored 34 points, including four free throws in the closing seconds, and the Denver Nuggets held on to beat the Detroit Pistons 117-111 Sunday night."}
{"game_id": "0022100707", "chunk_id": "0022100707_003", "order": 3, "role": "body", "text": "Jokic also had nine rebounds and eight assists, just missing a fifth straight triple double. Will Barton had 14 points and Aaron Gordon added 13 points for the Nuggets, who went 4-2 on a six-game homestand."}
{"game_id": "0022100707", "chunk_id": "0022100707_004", "order": 4, "role": "body", "text": "Isaiah Stewart, Cade Cunningham, Cory Joseph and Trey Lyles each scored 18 points for the Pistons, who have lost four of five. “Detroit played hard and they gave us a challenge but we pulled it out,” said Austin Rivers, who finished with 11 points. “They’ve got young, talented players. They’re trying to improve. You can’t just go in there and sleep on a bunch of pros. They’re playing loose. They’re playing free and they’re dangerous. Give them credit.”"}
{"game_id": "0022100707", "chunk_id": "0022100707_005", "order": 5, "role": "body", "text": "After a 3-pointer by Cunningham pulled Detroit to 75-73 with 3:57 remaining in the third quarter, Davon Reed and Facundo Campazzo hit successive 3’s to start a 17-3 run that allowed the Nuggets to take a 92-76 lead into the fourth."}
{"game_id": "0022100707", "chunk_id": "0022100707_006", "order": 6, "role": "body", "text": "Again, the Pistons rallied. Lyles converted successive three-point plays and Detroit pulled to 94-90 midway through the quarter. The game remained tight in the closing minutes and Joseph’s jumper with 1:45 left evened the score at 109-all."}
{"game_id": "0022100707", "chunk_id": "0022100707_007", "order": 7, "role": "body", "text": "Jokic made a pair of free throws with 40.3 seconds left to give the Nuggets a two-point edge. After a Detroit turnover, Jokic was fouled on a drive to the basket with 17.7 seconds remaining and converted two more free throws."}
{"game_id": "0022100707", "chunk_id": "0022100707_008", "order": 8, "role": "body", "text": "An offensive foul on Joseph resulted in another turnover with 8.8 seconds left and the Pistons fouled Monte Morris, who made both free throws for the final margin. Detroit coach Dwane Casey lamented the late-game turnovers which took the ball out of the Pistons’ hands without putting up a shot."}
{"game_id": "0022100707", "chunk_id": "0022100707_009", "order": 9, "role": "body", "text": "“We’ve got to value the ball, and right now we’re not valuing the ball ,” he said. “Those add up. We’ve got to take every play as if it’s the last play of the game. Until we grow up and do that, we’re going to be sad a lot this year.”"}
{"game_id": "0022100707", "chunk_id": "0022100707_010", "order": 10, "role": "body", "text": "The Pistons trailed by 10 late in the second quarter but gradually cut into the deficit and tied it at 60-all at the intermission on Cunningham’s pullup jumper that beat the halftime buzzer."}
{"game_id": "0022100707", "chunk_id": "0022100707_012", "order": 12, "role": "body", "text": "DeMarcus Cousins, signed to a 10-day contract Friday, made his Nuggets debut, playing 11:49 in relief of Jokic. He had two points and six rebounds. . “I didn’t have the best shooting performance but I made a couple of plays and the ultimate thing is we’ve got to win,” said Cousins, who was 1 of 7 from the floor. “I’m just trying to come out and have an impact any way I can.”"}
{"game_id": "0022100707", "chunk_id": "0022100707_014", "order": 14, "role": "body", "text": "Pistons: F Kelly Olynyk has been sidelined again, entering the league’s health and safety protocols on Saturday. He played impressively in two games last week after returning from a knee injury that had kept him out for two months."}
{"game_id": "0022100707", "chunk_id": "0022100707_015", "order": 15, "role": "body", "text": "Nuggets: F Jeff Green was held out of the game because of a left quadriceps contusion. … F JaMychal Green remains sidelined due to the league’s health and safety protocols. … G Bones Hyland did not play because of non-COVID illness."}
{"game_id": "0022100707", "chunk_id": "0022100707_017", "order": 17, "role": "closing", "text": "The Pistons and Nuggets complete a home-and-home set Tuesday night when the Nuggets open a six-game road trip at Detroit."}
