{"game_id": "0022101122", "chunk_id": "0022101122_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Nikola Jokic had 26 points, 19 rebounds and 11 assists for his 19th triple-double of the season, and the Denver Nuggets held on to beat the Charlotte Hornets 113-109 on Monday night."}
{"game_id": "0022101122", "chunk_id": "0022101122_002", "order": 2, "role": "body", "text": "Aaron Gordon added 21 points and Will Barton scored 18 for the Nuggets, who earned a split of the season series."}
{"game_id": "0022101122", "chunk_id": "0022101122_003", "order": 3, "role": "body", "text": "Miles Bridges had 27 points and 11 rebounds and LaMelo Ball added 22 points, 11 assists and six rebounds for Charlotte, which fell to 1-13 in the second night of back-to-backs. The loss dropped the Hornets to ninth place in the Eastern Conference, a half-game behind the idle Brooklyn Nets."}
{"game_id": "0022101122", "chunk_id": "0022101122_004", "order": 4, "role": "body", "text": "The Nuggets currently sit in sixth place in the Western Conference, so there's a chance that they won't host a playoff series."}
{"game_id": "0022101122", "chunk_id": "0022101122_005", "order": 5, "role": "body", "text": "But Denver has won a franchise-record 23 road games this season, so Jokic doesn't seem all that concerned."}
{"game_id": "0022101122", "chunk_id": "0022101122_006", "order": 6, "role": "body", "text": "“It just seems like we have been good on the road,” said Jokic, offering no explanation as to why."}
{"game_id": "0022101122", "chunk_id": "0022101122_007", "order": 7, "role": "body", "text": "Denver took an 83-74 lead into the fourth quarter and quickly extended it to 13 points. The Hornets rallied, battling back to cut the lead to one with 4:07 left behind 3-pointers from Isaiah Thomas, Bridges and Ball and an alley-oop dunk by Bridges."}
{"game_id": "0022101122", "chunk_id": "0022101122_008", "order": 8, "role": "body", "text": "The Hornets had several chances to tie the game, but shots simply wouldn't fall."}
{"game_id": "0022101122", "chunk_id": "0022101122_009", "order": 9, "role": "body", "text": "Monte Morris put the Nuggets up by five with two free throws with 38.8 seconds left before Terry Rozier answered with a 3."}
{"game_id": "0022101122", "chunk_id": "0022101122_010", "order": 10, "role": "body", "text": "Jokic missed a jumper on Denver's next possession with the shot clock running down, but got his own rebound off a tipped ball and was fouled hard with 8.6 seconds left. He made both shots to make it a two-possession game and put the Hornets away."}
{"game_id": "0022101122", "chunk_id": "0022101122_011", "order": 11, "role": "body", "text": "It was the 17th offensive rebound for the Nuggets — and the fifth by Jokic. Denver finished with 32 second-chance points."}
{"game_id": "0022101122", "chunk_id": "0022101122_012", "order": 12, "role": "body", "text": "The Nuggets held a 51-40 advantage on the glass overall."}
{"game_id": "0022101122", "chunk_id": "0022101122_013", "order": 13, "role": "body", "text": "“Sometimes you do everything right and it just bounces their way,\" Hornets coach James Borrego said. \"I don’t have the answers right now, but I do know we have to be more physical and just go get them.”"}
{"game_id": "0022101122", "chunk_id": "0022101122_014", "order": 14, "role": "body", "text": "Borrego said one of the things he'll study this offseason is finding ways to be better on the second night of back-to-backs."}
{"game_id": "0022101122", "chunk_id": "0022101122_015", "order": 15, "role": "body", "text": "For now, Bridges said it is time for the Hornets to continue to fight for seeding."}
{"game_id": "0022101122", "chunk_id": "0022101122_016", "order": 16, "role": "body", "text": "“We’re a young team and it’s playoff push time, so we really don’t have time for fatigue,\" Bridges said."}
{"game_id": "0022101122", "chunk_id": "0022101122_018", "order": 18, "role": "body", "text": "Montrezl Harrell and Gordon exchanged words and some light shoves near the end of the third quarter, resulting in Harrell getting two technical fouls and being ejected from the game."}
{"game_id": "0022101122", "chunk_id": "0022101122_019", "order": 19, "role": "body", "text": "Gordon was assessed one technical foul, but remained in the game."}
{"game_id": "0022101122", "chunk_id": "0022101122_020", "order": 20, "role": "body", "text": "It started when Harrell appeared to step over Austin Rivers — who was on the ground after taking a shot to the head — and then shoved Gordon with one arm, prompting a retaliatory shove from Gordon. The two then had to be separated by teammates and, after a long delay, Harrell was ejected."}
{"game_id": "0022101122", "chunk_id": "0022101122_021", "order": 21, "role": "body", "text": "Rivers stayed in the game but was seen leaving the arena with an ice pack on his head."}
{"game_id": "0022101122", "chunk_id": "0022101122_023", "order": 23, "role": "body", "text": "Gordon set the tone early for the Nuggets, scoring 17 points in the first quarter — most of those by attacking the rim."}
{"game_id": "0022101122", "chunk_id": "0022101122_024", "order": 24, "role": "body", "text": "“We talked to him today after lunch, just talking to him saying, ‘The way you’re playing right now, the guy guarding you is saying, How am I going to stop this guy?'\" Denver coach Michael Malone said. “When you settle for jump shots, when you settle for 3s, that same guy is saying, 'Oh, thank goodness this guy is not putting his head down and (going to) the rim.’”"}
{"game_id": "0022101122", "chunk_id": "0022101122_026", "order": 26, "role": "body", "text": "Nuggets: Morris had 14 points and nine assists."}
{"game_id": "0022101122", "chunk_id": "0022101122_027", "order": 27, "role": "body", "text": "Hornets: Had 33 assists. ... Bridges and Terry Rozier were a combined 4 of 17 from 3-point range."}
{"game_id": "0022101122", "chunk_id": "0022101122_029", "order": 29, "role": "body", "text": "Nuggets: At Pelicans on Wednesday night."}
{"game_id": "0022101122", "chunk_id": "0022101122_030", "order": 30, "role": "body", "text": "Hornets: At Knicks on Wednesday night."}
