{"game_id": "0022100735", "chunk_id": "0022100735_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Russell Westbrook had a choice to make at the end of regulation — drive to the basket and try to send the game into overtime or pull the trigger on a 3-pointer and go for the victory."}
{"game_id": "0022100735", "chunk_id": "0022100735_002", "order": 2, "role": "body", "text": "Westbrook went for the win, but his shot with 0.7 seconds left didn't fall resulting in yet another loss for the struggling Los Angeles Lakers."}
{"game_id": "0022100735", "chunk_id": "0022100735_003", "order": 3, "role": "body", "text": "Miles Bridges had 26 points, the seldom-used Ish Smith provided a huge boost off the bench with 22 points on 10-of-12 shooting as the Charlotte Hornets held off the short-handed Lakers 117-114 on Friday night."}
{"game_id": "0022100735", "chunk_id": "0022100735_004", "order": 4, "role": "body", "text": "With stars LeBron James and Anthony Davis out with injuries, Westbrook had an impressive game scoring 35 points — including 16 in the fourth quarter — while willing the Lakers back from a 20-point deficit."}
{"game_id": "0022100735", "chunk_id": "0022100735_005", "order": 5, "role": "body", "text": "As for the final shot, he has no regrets."}
{"game_id": "0022100735", "chunk_id": "0022100735_006", "order": 6, "role": "body", "text": "“I had just made two (3-pointers) just before that, so I will live and die with that one,” Westbrook said."}
{"game_id": "0022100735", "chunk_id": "0022100735_007", "order": 7, "role": "body", "text": "Down by two, Westbrook got the ball at the top of the key with nine seconds left and pivoted to the left side of the floor where he sized up defender Miles Bridges. Feeling Bridges was giving him enough room to shoot, Westbrook went for the win and pulled up."}
{"game_id": "0022100735", "chunk_id": "0022100735_008", "order": 8, "role": "body", "text": "But the ball bounced off the rim and P.J. Washington secured the rebound. Washington added a free throw with 0.2 left for the final margin."}
{"game_id": "0022100735", "chunk_id": "0022100735_009", "order": 9, "role": "body", "text": "Bridges, who got switched onto Westbrook on the final play, said he figured Westbrook was going to go for the win with the Lakers playing on the road and on the second night of a back-to-back."}
{"game_id": "0022100735", "chunk_id": "0022100735_010", "order": 10, "role": "body", "text": "\"I know he didn’t want to go to overtime,” Bridges said. “I tried to get a good contest on him.”"}
{"game_id": "0022100735", "chunk_id": "0022100735_011", "order": 11, "role": "body", "text": "Lakers coach Frank Vogel said he had no problem with Westbrook’s shot selection."}
{"game_id": "0022100735", "chunk_id": "0022100735_012", "order": 12, "role": "body", "text": "“The hottest guy in the gym has the ball in his hands ready to make a play,” Vogel said. “He was 3 for 6 from the 3 in the second half and went for the win. He knocks that down, we’re talking about one hell of a win. It just didn’t go down for us. Russell was spectacular in that second half. He just really willed our team into an opportunity to steal one on the road.”"}
{"game_id": "0022100735", "chunk_id": "0022100735_013", "order": 13, "role": "body", "text": "James missed his second straight game because of left knee soreness, and Davis did not play due to right wrist soreness. Vogel said he held out his star center as a precautionary measure after Davis scored 31 points in a loss at Philadelphia on Thursday night."}
{"game_id": "0022100735", "chunk_id": "0022100735_014", "order": 14, "role": "body", "text": "LaMelo Ball and Terry Rozier each had 20 points for the Hornets. Carmelo Anthony added 19 points for the Lakers, and rookie Austin Reaves had 16."}
{"game_id": "0022100735", "chunk_id": "0022100735_015", "order": 15, "role": "body", "text": "The Hornets jumped out to 16-3 lead and led by 20 in the third quarter before the Lakers used a strong third quarter to fight their way back into the game."}
{"game_id": "0022100735", "chunk_id": "0022100735_017", "order": 17, "role": "body", "text": "Smith sees sporadic playing time for the Hornets playing behind Ball and Rozier. But Hornets coach James Borrego praised the veteran point guard for his ability to stay ready when his number is called."}
{"game_id": "0022100735", "chunk_id": "0022100735_018", "order": 18, "role": "body", "text": "“Stay ready, your opportunity is right around the corner,” Borrego said. “You have to be ready for it. Every time we have called his number he has answered the bell.”"}
{"game_id": "0022100735", "chunk_id": "0022100735_020", "order": 20, "role": "body", "text": "Westbrook said he drew some motivation when Bridges mocked him with the “you're too small” sign — and promptly drew a technical foul for taunting."}
{"game_id": "0022100735", "chunk_id": "0022100735_021", "order": 21, "role": "body", "text": "“I think he was trying to say I was too small or something, but that ain't the case and he knows better than that,” Westbrook said. “It was definitely on my mind and I was like, ok, that's going to be a good trigger for me. I was able to turn it up a little notch, especially during that time of the game.\""}
{"game_id": "0022100735", "chunk_id": "0022100735_023", "order": 23, "role": "body", "text": "Bridges has scored at least 20 points in five of his last six games."}
{"game_id": "0022100735", "chunk_id": "0022100735_024", "order": 24, "role": "body", "text": "“I’m comfortable right now and I love to have the ball in my hands,” Bridges said. “And LaMelo does a great job of getting everyone the ball.”"}
{"game_id": "0022100735", "chunk_id": "0022100735_026", "order": 26, "role": "body", "text": "Lakers: Were outscored 58-38 in the paint."}
{"game_id": "0022100735", "chunk_id": "0022100735_027", "order": 27, "role": "body", "text": "Hornets: Mason Plumlee had a season-high 17 rebounds. Plumlee was called for defensive 3 seconds twice in the same possession in the second half. ... Cody Martin had a remarkable block on Westbrook in the second half, chasing him down the lane and beating the shot off the glass from behind."}
{"game_id": "0022100735", "chunk_id": "0022100735_030", "order": 30, "role": "body", "text": "Hornets: Host Los Angeles Clippers on Sunday."}
