{"game_id": "0022100301", "chunk_id": "0022100301_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Giannis Antetokounmpo had 26 points and 13 rebounds and the Milwaukee Bucks extended their winning streak to seven, routing the Indiana Pacers 118-100 on Sunday night."}
{"game_id": "0022100301", "chunk_id": "0022100301_002", "order": 2, "role": "body", "text": "The Bucks led by five at halftime and pulled away with a 39-27 third quarter. Guard Jrue Holiday scored 11 of his 23 points in the quarter."}
{"game_id": "0022100301", "chunk_id": "0022100301_003", "order": 3, "role": "body", "text": "“We're playing together and everybody is contributing,” Holiday said. “It's been fun.”"}
{"game_id": "0022100301", "chunk_id": "0022100301_004", "order": 4, "role": "body", "text": "Much like the surging Bucks, who improved to 13-8, Holiday has been hot in averaging 19.7 points in the last four victories. He also had nine assists and seven rebounds against Indiana."}
{"game_id": "0022100301", "chunk_id": "0022100301_005", "order": 5, "role": "body", "text": "“Being able to go through the things we went through last year was huge,” Holiday said of winning the NBA title. “We know we can make a run at any time.”"}
{"game_id": "0022100301", "chunk_id": "0022100301_006", "order": 6, "role": "body", "text": "Bobby Portis scored 15 points, Khris Middleton and Pat Connaughton each had 14, and Indianapolis native George Hill added 13 for the Bucks."}
{"game_id": "0022100301", "chunk_id": "0022100301_007", "order": 7, "role": "body", "text": "“We didn't have enough in the tank tonight,” Pacers coach Rick Carlisle said. “We just had a very difficult night.”"}
{"game_id": "0022100301", "chunk_id": "0022100301_008", "order": 8, "role": "body", "text": "Caris LeVert led the Pacers with a season-high 23 points. Malcolm Brogdon had 16."}
{"game_id": "0022100301", "chunk_id": "0022100301_009", "order": 9, "role": "body", "text": "“They're the champions,” said the Pacers' Justin Holiday. “It's going to be a tough game against them every time.”"}
{"game_id": "0022100301", "chunk_id": "0022100301_011", "order": 11, "role": "body", "text": "In reference to multiple reports that the Bucks have signed veteran center DeMarcus Cousins, coach Mike Budenholzer acknowledged a lack of depth at center because Brook Lopez has played only one game due to a back injury."}
{"game_id": "0022100301", "chunk_id": "0022100301_012", "order": 12, "role": "body", "text": "\"When you look at the depth chart and look at how we're subbing, depth at the big position is something that we could use,” Budenholzer said."}
{"game_id": "0022100301", "chunk_id": "0022100301_014", "order": 14, "role": "body", "text": "Bucks: Extended series winning streak against Pacers to six games ... Antetokounmpo has led the team in scoring in 17 games and in rebounding in 16 games."}
{"game_id": "0022100301", "chunk_id": "0022100301_015", "order": 15, "role": "body", "text": "Pacers: After a season-high 12 assists Friday night in a home win over Toronto, Brogdon had just two. ... Domantas Sabonis scored a season-low four points on 1-of-8 shooting."}
{"game_id": "0022100301", "chunk_id": "0022100301_017", "order": 17, "role": "body", "text": "Bucks: Host Charlotte on Wednesday night."}
{"game_id": "0022100301", "chunk_id": "0022100301_018", "order": 18, "role": "body", "text": "Pacers: At Minnesota on Monday night."}
