{"game_id": "0022100206", "chunk_id": "0022100206_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Chris Paul scored 19 of his 21 points in the fourth quarter, Devin Booker had 29 and the Phoenix Suns beat the Minnesota Timberwolves 99-96 Monday night for their ninth straight win."}
{"game_id": "0022100206", "chunk_id": "0022100206_002", "order": 2, "role": "body", "text": "Deandre Ayton had 22 points and 12 rebounds in his return to the Suns after missing five games with a right lower leg contusion. Phoenix won a day after a 115-89 victory in Houston."}
{"game_id": "0022100206", "chunk_id": "0022100206_003", "order": 3, "role": "body", "text": "“It’s an ugly game but not as ugly if you come out with the win,” Booker said. “Hard, scrappy game. It was a back-to-back. They played well. In the end, we figured it out. So, it feels a lot better this way.”"}
{"game_id": "0022100206", "chunk_id": "0022100206_004", "order": 4, "role": "body", "text": "Booker made one of two foul shots with 16.1 seconds to give the Suns a 98-96 lead."}
{"game_id": "0022100206", "chunk_id": "0022100206_005", "order": 5, "role": "body", "text": "Minnesota’s D’Angelo Russell missed a 3-point and Anthony Edwards couldn’t control an offensive rebound. Booker made another free throw and the Timberwolves’ last-second heave was short."}
{"game_id": "0022100206", "chunk_id": "0022100206_006", "order": 6, "role": "body", "text": "“I think there’s a trust factor there,” Paul said. “We know when we want to foul. We know what sort of plays we want to go to down the stretch. I think these are some of the games where that continuity really helps us.”"}
{"game_id": "0022100206", "chunk_id": "0022100206_007", "order": 7, "role": "body", "text": "Karl-Anthony Towns had 35 points and 13 rebounds for Minnesota, which has lost eight of nine. Russell scored 22 points, including 11 in a wild, back-and-forth fourth quarter. Malik Beasley shot made 4 of 10 on 3s for 12 points."}
{"game_id": "0022100206", "chunk_id": "0022100206_008", "order": 8, "role": "body", "text": "“Fourth quarter is just a slugfest,” Towns said. “Both teams are trying to find ways to win. Both teams were hitting shots, and difficult shots. It wasn’t easy. There’s a lot to be proud of tonight. Obviously, it’s disappointing. We didn’t come out with the win. I’ll be the first one to come out here and say it, but I’m very happy with the energy, the effort and tenacity we played with.”"}
{"game_id": "0022100206", "chunk_id": "0022100206_009", "order": 9, "role": "body", "text": "A close game throughout turned Phoenix’s way midway through the third as Minnesota became frustrated with the officiating."}
{"game_id": "0022100206", "chunk_id": "0022100206_010", "order": 10, "role": "body", "text": "Edwards and Towns were called for technical fouls in the span of 16 seconds. Teammate Patrick Beverly was called for a foul on a layup attempt by Booker and when replays showed very little contact, fans started chanting toward the officials."}
{"game_id": "0022100206", "chunk_id": "0022100206_011", "order": 11, "role": "body", "text": "Following his technical foul, Towns went to the bench and waved his arms up and down, encouraging the crowd to show its displeasure with the calls."}
{"game_id": "0022100206", "chunk_id": "0022100206_012", "order": 12, "role": "body", "text": "The Suns, meanwhile, started hitting shots. Landry Shamet and Booker hit 3s and a 14-5 run gave the Suns a seven-point lead, their largest of the game."}
{"game_id": "0022100206", "chunk_id": "0022100206_013", "order": 13, "role": "body", "text": "Towns scored nine points in a 9-2 run and gave Minnesota a 78-77 lead with a deep 3, setting up the crazy finish as both teams started making shots after a tough offensive game for both."}
{"game_id": "0022100206", "chunk_id": "0022100206_014", "order": 14, "role": "body", "text": "“I thought they did a really good job getting dialed back in, going out and making the next play,” Wolves coach Chris Finch said of his team. “It was an unfortunate stretch of play right there. A couple things went against us that put distance in the game, but they did a good job of tightening it up over time.”"}
{"game_id": "0022100206", "chunk_id": "0022100206_016", "order": 16, "role": "body", "text": "Ayton played 32:54 in his return and provided an immediate impact inside. He was 10-of-14 shooting and had seven offensive rebounds. Phoenix coach Monty Williams said he even played Ayton a few more minutes than he had planned."}
{"game_id": "0022100206", "chunk_id": "0022100206_017", "order": 17, "role": "body", "text": "“I was telling everybody, ‘Let’s make sure we bring that same energy that you all was bringing the last game because don’t try to take ail when I’m back now,’” Ayton said of joining the team during the win streak. “So, I made sure on my end, I tried everything. Everybody tell me I brought the energy coming out the gate.”"}
{"game_id": "0022100206", "chunk_id": "0022100206_019", "order": 19, "role": "body", "text": "The Suns have the longest current winning streak in the NBA and it’s the team’s longest since it won 10 straight from March 14-April 2, 2010."}
{"game_id": "0022100206", "chunk_id": "0022100206_020", "order": 20, "role": "body", "text": "Monday also marked the third straight game in which Phoenix held its opponent under 100 points, the first time it’s done so in three consecutive games since March 27-30, 2015."}
{"game_id": "0022100206", "chunk_id": "0022100206_022", "order": 22, "role": "body", "text": "Suns: The 18 points in the first quarter were the fewest in an opening period for Phoenix this season. The 40 points in the first half tied their lowest output in a half. But Minnesota’s 38 points were the fewest allowed by the Suns in a half this season. … Paul had two points on 1-of-7 shooting through three quarters."}
{"game_id": "0022100206", "chunk_id": "0022100206_023", "order": 23, "role": "body", "text": "Timberwolves: C Naz Reid missed the game with right foot soreness. Coach Chris Finch said the injury occurred in Saturday’s loss to the Clippers, but Reid wasn’t sure what happened. … Edwards finished with nine points and a career-high 12 rebounds. He shot 2 of 11 from the field."}
{"game_id": "0022100206", "chunk_id": "0022100206_025", "order": 25, "role": "body", "text": "Suns: Return home for a three-game stand starting Wednesday with the first of two straight against the Dallas Mavericks."}
{"game_id": "0022100206", "chunk_id": "0022100206_026", "order": 26, "role": "body", "text": "Timberwolves: Host the Sacramento Kings on Wednesday."}
