{"game_id": "0022100807", "chunk_id": "0022100807_001", "order": 1, "role": "lead", "text": "DALLAS -- — Luka Doncic went to the bench with five fouls just 53 seconds into the third quarter. Dallas' second-best point guard joined him a little bit later for the same reason."}
{"game_id": "0022100807", "chunk_id": "0022100807_002", "order": 2, "role": "body", "text": "The Mavericks never lost the lead against Trae Young and Atlanta, beating the Hawks 103-94 on Sunday night."}
{"game_id": "0022100807", "chunk_id": "0022100807_003", "order": 3, "role": "body", "text": "Doncic had another triple-double — 18 points, 10 rebounds and 11 assists — and Jalen Brunson scored 22 points despite sitting for long stretches because of the fouls."}
{"game_id": "0022100807", "chunk_id": "0022100807_004", "order": 4, "role": "body", "text": "“I’m all about teaching,” said Dallas coach Jason Kidd, who chose not to pull Doncic after the superstar picked up his third foul with 2:50 left in the first half. The Mavericks used a patchwork lineup that looked similar to when the team was battling COVID-19 issues earlier in the season."}
{"game_id": "0022100807", "chunk_id": "0022100807_005", "order": 5, "role": "body", "text": "“There’s a bigger picture,” he added. “It can happen in the playoffs, it can happen in Game 7. Everybody has to be ready. There’s no guarantee Luka’s not going to get four or five fouls. It was a teaching moment for our team.”"}
{"game_id": "0022100807", "chunk_id": "0022100807_006", "order": 6, "role": "body", "text": "John Collins had 22 points and 18 rebounds for Atlanta. Young missed all six of his 3-point attempts and finished with 17 points on 6-of-19 shooting in another meeting with Doncic, the fellow All-Star he was traded for near the top of the 2018 draft."}
{"game_id": "0022100807", "chunk_id": "0022100807_007", "order": 7, "role": "body", "text": "“It’s one of those nights you don’t shoot the ball great,” Young said. “I felt like I had a lot of really good looks and some open shots that I normally hit. I wish I could get them back and knock them down.”"}
{"game_id": "0022100807", "chunk_id": "0022100807_008", "order": 8, "role": "body", "text": "After staying in late in the second, Doncic got his fourth foul on a charge when he drove and passed in the final minute of before halftime."}
{"game_id": "0022100807", "chunk_id": "0022100807_009", "order": 9, "role": "body", "text": "Doncic, who has never fouled out in regulation in his four-year career, got his fifth — and a technical foul — when he bumped Young as both chased a loose ball early in the third. Kidd chose not to challenge."}
{"game_id": "0022100807", "chunk_id": "0022100807_010", "order": 10, "role": "body", "text": "After Brunson picked up his fifth with 6:21 left in the third, the Mavericks pushed their lead to eight before Atlanta eventually pulled even but never could go in front."}
{"game_id": "0022100807", "chunk_id": "0022100807_011", "order": 11, "role": "body", "text": "With Trey Burke running the point in just his second game with more than 10 minutes in a month, Dallas took the same four-point lead from halftime to the fourth quarter."}
{"game_id": "0022100807", "chunk_id": "0022100807_012", "order": 12, "role": "body", "text": "Doncic was in a joking mood when Brunson joined him on the bench."}
{"game_id": "0022100807", "chunk_id": "0022100807_013", "order": 13, "role": "body", "text": "“I was very tempted to push him away from me, but I was heated at the time,” said Brunson, whose fifth was an offensive foul when he jumped into Kevin Huerter. “He was happy I got my fifth. I was like, ‘You make no sense right now.’”"}
{"game_id": "0022100807", "chunk_id": "0022100807_014", "order": 14, "role": "body", "text": "Doncic came back with 9:02 remaining — sitting for 14 minutes — and Brunson returned with 5:48 to go. The Mavericks pulled away for their 10th victory in 12 home games."}
{"game_id": "0022100807", "chunk_id": "0022100807_015", "order": 15, "role": "body", "text": "Young got the Hawks within two on a floater with 4 1/2 minutes to go, but a bucket by Dwight Powell started a 12-2 run for a 100-88 lead with 1:41 remaining. The clinching surge was capped by 3-pointers from Brunson and Reggie Bullock, who also had 22 points with a season-high nine rebounds."}
{"game_id": "0022100807", "chunk_id": "0022100807_016", "order": 16, "role": "body", "text": "Bullock, who has four 20-point games in the past five after none in his first 41 with Dallas, also had a key steal and breakaway layup on a goaltending call against Huerter early in the clinching run."}
{"game_id": "0022100807", "chunk_id": "0022100807_017", "order": 17, "role": "body", "text": "The Mavericks won the rematch after getting blown out in the season opener in Atlanta, which was also Kidd's debut as Dallas coach."}
{"game_id": "0022100807", "chunk_id": "0022100807_018", "order": 18, "role": "body", "text": "“I thought this game was a missed opportunity,” Hawks coach Nate McMillan said. “I think that was a missed opportunity when Luka went out. But teams a lot of times when the best player goes out, they rise to the occasion. They got even more aggressive.”"}
{"game_id": "0022100807", "chunk_id": "0022100807_020", "order": 20, "role": "body", "text": "Hawks: Collins started after being listed as questionable with right heel discomfort. ... De'Andre Hunter scored 14 points and Huerter added 11."}
{"game_id": "0022100807", "chunk_id": "0022100807_021", "order": 21, "role": "body", "text": "Mavericks: F/C Kristaps Porzingis missed his 20th game of the season because of injuries or COVID-19 protocols. It was the fourth consecutive game he was sidelined with a bone bruise in his right knee. ... Dallas also was without F Maxi Kleber (left knee) and Sterling Brown (left foot soreness). Brown has missed the past 10 games. G Tim Hardaway is out long-term with a broken left foot. ... Brunson was 4 of 5 from deep, and Bullock 6 of 10. Dallas was 16 of 36 (44%)."}
{"game_id": "0022100807", "chunk_id": "0022100807_023", "order": 23, "role": "body", "text": "Hawks: Host Indiana on Tuesday."}
{"game_id": "0022100807", "chunk_id": "0022100807_024", "order": 24, "role": "body", "text": "Mavericks: Hosts Detroit on Tuesday in the first meeting of the season. Dallas has won three straight in the series."}
