{"game_id": "0022100507", "chunk_id": "0022100507_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — So much for feeling his way back after being out two weeks in the NBA's health and safety protocols. James Harden sure looks all the way back."}
{"game_id": "0022100507", "chunk_id": "0022100507_002", "order": 2, "role": "body", "text": "Harden tied his season high with 39 points and had a season-best 15 assists in the second game of his return, and the Brooklyn Nets beat the Los Angeles Clippers 124-108 on Monday night in a matchup of short-handed teams."}
{"game_id": "0022100507", "chunk_id": "0022100507_003", "order": 3, "role": "body", "text": "He had eight rebounds, just missing a second straight triple-double."}
{"game_id": "0022100507", "chunk_id": "0022100507_004", "order": 4, "role": "body", "text": "“I wasn’t expecting it,” Nets coach Steve Nash said. “Against the Lakers and tonight, he was just clinical. If he plays like that, we'll be very difficult to beat.”"}
{"game_id": "0022100507", "chunk_id": "0022100507_005", "order": 5, "role": "body", "text": "Harden had 36 points, 10 rebounds and 10 assists in a 122-115 win against LeBron James and the Lakers on Christmas in the Nets' first game after three straight postponements due to the coronavirus pandemic."}
{"game_id": "0022100507", "chunk_id": "0022100507_006", "order": 6, "role": "body", "text": "He used his down time to lift weights and do cardio at home."}
{"game_id": "0022100507", "chunk_id": "0022100507_007", "order": 7, "role": "body", "text": "“That protocol could have went two ways and I just overly locked into my body and my eating,” Harden said. “When you prepare yourself to be great, there's no surprise.”"}
{"game_id": "0022100507", "chunk_id": "0022100507_008", "order": 8, "role": "body", "text": "The Nets improved their NBA-best road mark to 13-3 with a sweep in Los Angeles."}
{"game_id": "0022100507", "chunk_id": "0022100507_009", "order": 9, "role": "body", "text": "“Confidence is through the roof,” Harden said."}
{"game_id": "0022100507", "chunk_id": "0022100507_010", "order": 10, "role": "body", "text": "A combined 15 players were missing from both teams due to health and safety protocols as well as injuries. The Nets have seven players in protocols, including NBA scoring leader Kevin Durant and Kyrie Irving, both of whom weren't with the team."}
{"game_id": "0022100507", "chunk_id": "0022100507_011", "order": 11, "role": "body", "text": "Turns out, Harden was plenty on his own and his supporting cast backed him up. Four other Nets scored in double figures, including Patty Mills, who had 18 points and made six 3-pointers. Nic Claxton tied his career high with 18 points."}
{"game_id": "0022100507", "chunk_id": "0022100507_012", "order": 12, "role": "body", "text": "“Our confidence level for our bench is high,” Harden said. “They can come in and impact the game. We can find different ways to win.”"}
{"game_id": "0022100507", "chunk_id": "0022100507_013", "order": 13, "role": "body", "text": "With Harden leading drives inside, the Nets completely dominated the Clippers in the paint with a 74-38 edge."}
{"game_id": "0022100507", "chunk_id": "0022100507_014", "order": 14, "role": "body", "text": "“He picked us apart, everything we did,” Clippers coach Tyronn Lue said."}
{"game_id": "0022100507", "chunk_id": "0022100507_015", "order": 15, "role": "body", "text": "The Clippers were without their two superstars. Paul George is expected to be out up to a month with a torn ligament in his right elbow and Kawhi Leonard has yet to play this season as he works his way back from ACL reconstruction surgery."}
{"game_id": "0022100507", "chunk_id": "0022100507_016", "order": 16, "role": "body", "text": "Marcus Morris led the Clippers with a season high-tying 24 points in his first game in nearly two weeks after being in the protocols. Eric Bledsoe added 15 points."}
{"game_id": "0022100507", "chunk_id": "0022100507_017", "order": 17, "role": "body", "text": "Harden joined some exclusive company while engineering the easy win. His 10th assist was the 6,000th of his career, making him the 10th player in NBA history with 20,000 points, 5,000 rebounds and 6,000 assists. Among others on the list are the late Kobe Bryant, James, Chris Paul, Oscar Robertson and current Clippers executive Jerry West."}
{"game_id": "0022100507", "chunk_id": "0022100507_018", "order": 18, "role": "body", "text": "Harden downplayed the accomplishment, saying, “Just want to win, try to find ways to impact the game. That’s it.”"}
{"game_id": "0022100507", "chunk_id": "0022100507_019", "order": 19, "role": "body", "text": "The Nets ran away for good in the second quarter."}
{"game_id": "0022100507", "chunk_id": "0022100507_020", "order": 20, "role": "body", "text": "That's when they scored 33 points while holding the Clippers to 22. DeAndre' Bembry had six points, including a dunk that drew a technical for hanging on the rim, and Mills hit two 3-pointers in helping the Nets lead 71-55 at the break — their largest halftime lead on the road this season."}
{"game_id": "0022100507", "chunk_id": "0022100507_021", "order": 21, "role": "body", "text": "The Nets scored 30 points in the third, when they extended their lead to 22 points."}
{"game_id": "0022100507", "chunk_id": "0022100507_022", "order": 22, "role": "body", "text": "The Clippers hit five 3-pointers in rushing to an eight-point lead to open the game."}
{"game_id": "0022100507", "chunk_id": "0022100507_023", "order": 23, "role": "body", "text": "Then, Blake Griffin came off the bench to haunt his old team."}
{"game_id": "0022100507", "chunk_id": "0022100507_024", "order": 24, "role": "body", "text": "Griffin scored back-to-back on a dunk and layup that tied and then gave the Nets their first lead of the game as part of an 11-0 run. Harden scored next on Griffin's steal and later Harden assisted on Griffin's one-handed jam that recalled his old Lob City days with the Clippers. Griffin finished with 12 points and nine rebounds."}
{"game_id": "0022100507", "chunk_id": "0022100507_026", "order": 26, "role": "body", "text": "Nets: Bembry was called for a flagrant-1 foul on Brandon Boston Jr. under the basket in the fourth. He got a second tech for unsportsmanlike behavior in the third. ... Harden recorded his fifth 30-point game of the season and second straight. ... Their 71 points were a season-high for either half. ... Their 38 points tied their highest total in a first quarter on the road this season. ... They won their fourth in a row over the Clippers. ... Signed guard Langston Galloway to a second 10-day contract."}
{"game_id": "0022100507", "chunk_id": "0022100507_027", "order": 27, "role": "body", "text": "Clippers: Starter Reggie Jackson remained in protocols, along with reserve Jay Scrubb. ... Nicolas Batum sat out a night after playing because of pain from a right ankle sprain."}
{"game_id": "0022100507", "chunk_id": "0022100507_029", "order": 29, "role": "body", "text": "Harden spent “a special day” between games going back to Artesia High in nearby Lakewood, where he led his alma mater to two state championships. He had his No. 13 retired."}
{"game_id": "0022100507", "chunk_id": "0022100507_030", "order": 30, "role": "body", "text": "“That was where I fell in love with the game of basketball,” he said. “High school is where I learned how to work hard and actually train and stay in the gym and find things I can get better at in basketball.”"}
{"game_id": "0022100507", "chunk_id": "0022100507_032", "order": 32, "role": "body", "text": "Nets: Host Philadelphia on Thursday to open a three-game homestand that includes a visit from the Clippers."}
{"game_id": "0022100507", "chunk_id": "0022100507_033", "order": 33, "role": "body", "text": "Clippers: At Boston on Wednesday in the opener of a three-game Eastern trip."}
