{"game_id": "0022100960", "chunk_id": "0022100960_001", "order": 1, "role": "lead", "text": "BOSTON -- — The challenge to Jayson Tatum against a Brooklyn lineup that featured a rare appearance from both Kevin Durant and Kyrie Irving: “Take the alpha approach.”"}
{"game_id": "0022100960", "chunk_id": "0022100960_002", "order": 2, "role": "body", "text": "“Be the best guy on the court each night,” Celtics coach Ime Udoka said he told Tatum before Tatum scored a season-high 54 points to lead Boston to a 126-120 victory over the uncommonly intact Nets. “He takes pride in the matchup going against high-level opponents.”"}
{"game_id": "0022100960", "chunk_id": "0022100960_003", "order": 3, "role": "body", "text": "Durant played in his second game since mid-January and scored 37 for the Nets, becoming the 23rd player in NBA history to reach 25,000 points. Irving joined him for just the fourth time all season, scoring 19 in his first game in three weeks and his first in Boston since he was pelted with a water bottle during the playoffs last year."}
{"game_id": "0022100960", "chunk_id": "0022100960_004", "order": 4, "role": "body", "text": "“Those matchups — when you're playing one of the better teams in the league, two of the best guys — as a competitor, those are the kinds of moments that as a kid you looked forward to,” Tatum said. “When those opportunities come, you try to make the most of it.”"}
{"game_id": "0022100960", "chunk_id": "0022100960_005", "order": 5, "role": "body", "text": "Tatum scored a 34 points in the second half, and Jaylen Brown scored 21 for the Celtics. Brown, who was cleared to return to Boston’s lineup after testing his sprained ankle pregame, beat the 24-second clock to hit a 3-pointer and give Boston a 121-115 lead with 40 seconds left."}
{"game_id": "0022100960", "chunk_id": "0022100960_006", "order": 6, "role": "body", "text": "Durant missed a jumper the next time down — complaining that he was fouled, with no luck. Tatum was fouled the next possession and, as “MVP!” chants rang out in the TD Garden, he hit one of two free throws to surpass his previous season high of 51."}
{"game_id": "0022100960", "chunk_id": "0022100960_007", "order": 7, "role": "body", "text": "He added a pair of free throws in the final seconds for the second-highest total of his career."}
{"game_id": "0022100960", "chunk_id": "0022100960_008", "order": 8, "role": "body", "text": "“It was chaos. Good chaos,” said Marcus Smart, who had 14 points and nine assists. “It was a fun game and it was a fun five minutes to be a part of.”"}
{"game_id": "0022100960", "chunk_id": "0022100960_009", "order": 9, "role": "body", "text": "The Celtics have won five of their last six and 21 of their last 27 games."}
{"game_id": "0022100960", "chunk_id": "0022100960_011", "order": 11, "role": "body", "text": "Tatum, who played one season at Duke before the Celtics drafted him No. 3 overall in 2017, said he thought about attending Blue Devils coach Mike Krzyzewski's final home game on Saturday night, a 94-81 loss to North Carolina."}
{"game_id": "0022100960", "chunk_id": "0022100960_012", "order": 12, "role": "body", "text": "But the Celtics' 1 p.m. Sunday start made it difficult."}
{"game_id": "0022100960", "chunk_id": "0022100960_013", "order": 13, "role": "body", "text": "“I definitely wish I could have been there, for the last game. It was an incredible run, 42 years, everything he’s accomplished at Cameron” Indoor Stadium, Tatum told a reporter who went to California, with Brown, who also went to Cal, at his side. “Definitely a better atmosphere than Cal.”"}
{"game_id": "0022100960", "chunk_id": "0022100960_015", "order": 15, "role": "body", "text": "Irving was booed by Boston fans still irked that he opted out of his contract after professing his love for the city. On his last visit — the Celtics’ first full house since the pandemic began — a fan threw a water bottle at him when he left the court following a playoff victory."}
{"game_id": "0022100960", "chunk_id": "0022100960_016", "order": 16, "role": "body", "text": "Irving stomped on the Celtics’ leprechaun logo at midcourt after that game. On Sunday, former Celtics player Glen “Big Baby” Davis was sitting courtside wearing a T-shirt that read “Respect the Logo.”"}
{"game_id": "0022100960", "chunk_id": "0022100960_017", "order": 17, "role": "body", "text": "“I know it’s going to be like that the rest of my career coming in here,” Irving said. “It’s like the scorned girlfriend who wants an explanation on why I left but still hoping for a text back. I’m just like, ‘It was fun while it lasted.’”"}
{"game_id": "0022100960", "chunk_id": "0022100960_019", "order": 19, "role": "body", "text": "The Nets scored 11 straight points midway through the third and opened their biggest lead of the game, 90-81, with just over a minute left in the quarter. But Boston scored eight in a row to cut it to one point, then took the lead on the first basket of the fourth."}
{"game_id": "0022100960", "chunk_id": "0022100960_020", "order": 20, "role": "body", "text": "The Celtics opened a 108-100 lead in the middle of the fourth. They trailed by one point with 3:29 remaining before running off 13 of the next 17 points — the first six from Tatum and the last five from Brown."}
{"game_id": "0022100960", "chunk_id": "0022100960_021", "order": 21, "role": "body", "text": "“Tonight this man to the left was unstoppable,” Brown said, nodding toward Tatum. “I think that helps.”"}
{"game_id": "0022100960", "chunk_id": "0022100960_023", "order": 23, "role": "body", "text": "Nets: Irving had missed seven straight games and did not play in the Feb. 8 game against Boston in Brooklyn because of New York City's COVID-19 vaccine requirements. ... Durant missed 21 straight games before returning Thursday night."}
{"game_id": "0022100960", "chunk_id": "0022100960_024", "order": 24, "role": "body", "text": "Celtics: Nick Stauskas, the No. 8 overall pick in the 2014 draft, signed with Boston over the weekend but did not play. He played in two games for Miami this season and 26 games for the Grand Rapids Gold of the G League. ... Signed forwards Malik Fitts and Kelan Martin to their second 10-day contracts. They each have played in one game for the Celtics and did not get off the bench on Sunday."}
{"game_id": "0022100960", "chunk_id": "0022100960_026", "order": 26, "role": "body", "text": "Nets: At Charlotte on Tuesday."}
{"game_id": "0022100960", "chunk_id": "0022100960_027", "order": 27, "role": "body", "text": "Celtics: At Charlotte on Wednesday."}
