{"game_id": "0022100940", "chunk_id": "0022100940_001", "order": 1, "role": "lead", "text": "BOSTON -- — Jayson Tatum scored 21 of his 37 points in the fourth quarter, leading the Boston Celtics past the Memphis Grizzlies 120-107 on Thursday night."}
{"game_id": "0022100940", "chunk_id": "0022100940_002", "order": 2, "role": "body", "text": "Al Horford had 21 points and 15 rebounds and Robert Williams finished with 10 points and 12 rebounds for the Celtics, who shot 51.7% and won for the ninth time in 11 games. Marcus Smart finished with 18 points and 12 assists, Derrick White scored 12 and Grant Williams 11."}
{"game_id": "0022100940", "chunk_id": "0022100940_003", "order": 3, "role": "body", "text": "“It was a lot of fun. The place was electric tonight,” said Tatum, who also had five assists and six rebounds on his 24th birthday."}
{"game_id": "0022100940", "chunk_id": "0022100940_004", "order": 4, "role": "body", "text": "Tatum's torrid fourth quarter and Boston's solid defense throughout allowed the Celtics to hold off any late pushes by the Grizzlies and Ja Morant, who was coming off a career-high 52 points Monday night in a win over San Antonio."}
{"game_id": "0022100940", "chunk_id": "0022100940_005", "order": 5, "role": "body", "text": "Morant started slowly and finished with 38 points, getting 16 in the third quarter and 14 in the fourth as he and Tatum put on a display at both ends of the court."}
{"game_id": "0022100940", "chunk_id": "0022100940_006", "order": 6, "role": "body", "text": "“I think it was just kind of one of those moments — two guys just going at it and doing what they can to try and will their team to a victory,” Tatum said. “It just so happened that it was kind of a back-and-forth thing.”"}
{"game_id": "0022100940", "chunk_id": "0022100940_007", "order": 7, "role": "body", "text": "Jaren Jackson had 20 points and seven rebounds for Memphis, and Desmond Bane finished with 17 points and seven assists."}
{"game_id": "0022100940", "chunk_id": "0022100940_008", "order": 8, "role": "body", "text": "Boston started pulling away in the second half, opening the third period on a 10-2 run and then turning to Tatum throughout the fourth, when the Grizzlies started hitting shots that we're falling earlier."}
{"game_id": "0022100940", "chunk_id": "0022100940_009", "order": 9, "role": "body", "text": "“We were just missing shots that we normally hit. Whether it’s a hook shot or a floater. ... We couldn’t buy a bucket, really, but we kept it close,” Memphis coach Taylor Jenkins said. “You’ve got to give them credit. They played great as a team and obviously Tatum took over.”"}
{"game_id": "0022100940", "chunk_id": "0022100940_010", "order": 10, "role": "body", "text": "After Bane hit a 3-pointer that pulled Memphis within 91-84, Tatum scored six straight for Boston and followed that with an assist on a jumper by Payton Pritchard that put Boston up 99-84. Tatum scored the next eighth points for Boston, then added a 3-pointer that finished off the Grizzlies, giving Boston a 115-100 lead with 1:34 left to play."}
{"game_id": "0022100940", "chunk_id": "0022100940_011", "order": 11, "role": "body", "text": "Morant, who was 0 for 6 in the first quarter with a pair of free throws, ended up scoring 30 points in the second half as he tried to keep the Grizzlies within range. He did show his leaping ability late in the second quarter on an alley-oop, slamming down a one-handed dunk off a pass from Kyle Anderson to pull the Grizzlies within 45-42 with 1:39 to go before halftime."}
{"game_id": "0022100940", "chunk_id": "0022100940_013", "order": 13, "role": "body", "text": "First-year coach Ime Udoka was named the NBA Eastern Conference coach of the month Thursday after Boston went 9-2 in February."}
{"game_id": "0022100940", "chunk_id": "0022100940_014", "order": 14, "role": "body", "text": "Udoka said it helps that his team's overall health has improved, and also credited his players for working through early season injuries and roster rotations caused by COVID-19."}
{"game_id": "0022100940", "chunk_id": "0022100940_015", "order": 15, "role": "body", "text": "“The main thing — it means we’re playing well and that’s the bottom line. When you get recognition, it’s a reflection on the guys,” Udoka said. “They’re letting us coach them, letting us push them and learning and growing throughout the season. Kind of what we thought we’d have when we got healthy.”"}
{"game_id": "0022100940", "chunk_id": "0022100940_017", "order": 17, "role": "body", "text": "Already missing starting forward Jaylen Brown with a sprained right ankle, the Celtics lost his replacement to the same injury early in the first quarter when Aaron Nesmith rolled his ankle after going up for a defensive rebound. He did not return."}
{"game_id": "0022100940", "chunk_id": "0022100940_019", "order": 19, "role": "body", "text": "Grizzlies: Never recovered from a slow start, making 8 of 29 shots in the first quarter and hitting just 2 of 14 3-pointers. ... G/F John Konchar missed his second straight game with a sprained left ankle."}
{"game_id": "0022100940", "chunk_id": "0022100940_020", "order": 20, "role": "body", "text": "Celtics: Boston led 26-20 at the end of the first quarter despite committing six turnovers. ... The Celtics outrebounded the Grizzlies 51-44."}
{"game_id": "0022100940", "chunk_id": "0022100940_022", "order": 22, "role": "body", "text": "Grizzlies: Host the Orlando Magic on Saturday night."}
{"game_id": "0022100940", "chunk_id": "0022100940_023", "order": 23, "role": "body", "text": "Celtics: Host the Brooklyn Nets on Sunday afternoon."}
