{"game_id": "0022101021", "chunk_id": "0022101021_001", "order": 1, "role": "lead", "text": "ATLANTA -- — The Portland Trail Blazers were on a roll before making a crucial mistake against Atlanta's Trae Young."}
{"game_id": "0022101021", "chunk_id": "0022101021_002", "order": 2, "role": "body", "text": "“We let Trae get hot and they gained momentum,” Trendon Watford said."}
{"game_id": "0022101021", "chunk_id": "0022101021_003", "order": 3, "role": "body", "text": "Young scored 21 of his 46 points in the third period and the Hawks recovered from a 15-point second-half deficit to beat the Blazers 122-113 on Monday night."}
{"game_id": "0022101021", "chunk_id": "0022101021_004", "order": 4, "role": "body", "text": "Young, who scored 47 points a night earlier in a win over Indiana, added 12 assists against the Blazers. He became the first player in the NBA this season to score at least 40 points on back-to-back nights, according to Elias Sports."}
{"game_id": "0022101021", "chunk_id": "0022101021_005", "order": 5, "role": "body", "text": "“He does it every night,” teammate De'Andre Hunter said. “We’re used to seeing it, but it’s amazing still.”"}
{"game_id": "0022101021", "chunk_id": "0022101021_006", "order": 6, "role": "body", "text": "Young set a career high with 56 points in Atlanta’s 136-131 loss at Portland on Jan. 3."}
{"game_id": "0022101021", "chunk_id": "0022101021_007", "order": 7, "role": "body", "text": "After Portland claimed its big lead at 73-58, Young scored eight straight points and 17 of Atlanta’s first 19 in the third period."}
{"game_id": "0022101021", "chunk_id": "0022101021_008", "order": 8, "role": "body", "text": "The Hawks (34-34), who entered the game ninth in the Eastern Conference, have won three straight to reach .500 for the first time since Dec. 15, when they were 14-14."}
{"game_id": "0022101021", "chunk_id": "0022101021_009", "order": 9, "role": "body", "text": "Hunter scored 20 points for Atlanta, including a 3-pointer that put the Hawks ahead 116-111."}
{"game_id": "0022101021", "chunk_id": "0022101021_010", "order": 10, "role": "body", "text": "Josh Hart led Portland with 31 points. The Blazers began the night 11th in the Western Conference, one spot out of the play-in tournament."}
{"game_id": "0022101021", "chunk_id": "0022101021_011", "order": 11, "role": "body", "text": "Portland led 67-58 at halftime as Atlanta made only 19 of 59 shots (32.3%) from the field, its worst-shooting first half this season."}
{"game_id": "0022101021", "chunk_id": "0022101021_012", "order": 12, "role": "body", "text": "The Blazers made 56.5% (26 of 46) of their shots in the half. Portland scored the first six points of the second half, stretching its lead to 15 points before Young took control."}
{"game_id": "0022101021", "chunk_id": "0022101021_013", "order": 13, "role": "body", "text": "The Hawks led 104-93 early in the fourth before Portland went on a 10-0 run, capped by Brandon Williams’ 3-pointer. Kevin Huerter responded with a 3 for Atlanta."}
{"game_id": "0022101021", "chunk_id": "0022101021_014", "order": 14, "role": "body", "text": "Watford had 22 points and Williams added 20 for Portland."}
{"game_id": "0022101021", "chunk_id": "0022101021_015", "order": 15, "role": "body", "text": "“We fought like crazy and I was proud of that,” Blazers coach Chauncey Billups said. “We gave ourselves a chance to win the game. Our guys fought and I loved it.”"}
{"game_id": "0022101021", "chunk_id": "0022101021_017", "order": 17, "role": "body", "text": "Trail Blazers: PG Kris Dunn, who signed a 10-day contract before the game, had two points in 20 minutes. It was Dunn’s first game since he played four games with Atlanta last season. He started in a combined 119 games in three seasons with Chicago. Dunn adds backcourt depth as Anfernee Simons (patellar tendinopathy in his left knee) is expected to miss up to two weeks."}
{"game_id": "0022101021", "chunk_id": "0022101021_018", "order": 18, "role": "body", "text": "Hawks: F Danilo Gallinari (right Achilles tendon soreness) was held out, leaving the Hawks thin at forward. Gallinari had been the fill-in starter for John Collins (right finger sprain, right foot strain), who missed his second straight game. Coach Nate McMillan said Gallinari has played through the injury “most of the season. ... Sometimes it flares up.” ... Clint Capela had eight points and 16 rebounds."}
{"game_id": "0022101021", "chunk_id": "0022101021_020", "order": 20, "role": "body", "text": "Hart continued to emerge as a scoring threat after scoring a career-high 44 points when the Blazers snapped a six-game losing streak by beating Washington on Saturday night."}
{"game_id": "0022101021", "chunk_id": "0022101021_021", "order": 21, "role": "body", "text": "“Having to be that scoring option is a new role for Josh,” Billups said. “We’re asking him to do things he’s not really used to.”"}
{"game_id": "0022101021", "chunk_id": "0022101021_022", "order": 22, "role": "body", "text": "Hart looked comfortable while scoring 25 points in the first half against the Hawks. He finished 4 of 7 from 3-point range."}
{"game_id": "0022101021", "chunk_id": "0022101021_024", "order": 24, "role": "body", "text": "Young's second straight 40-point outing was the 24th of his career."}
{"game_id": "0022101021", "chunk_id": "0022101021_025", "order": 25, "role": "body", "text": "“He’s a guy who is going to establish the tempo for us,” McMillan said. “He’s done a good job of that in these last few games, playing faster and looking to attack and really be aggressive.”"}
{"game_id": "0022101021", "chunk_id": "0022101021_027", "order": 27, "role": "body", "text": "The Hawks outscored the Trail Blazers 31-17 in the third."}
{"game_id": "0022101021", "chunk_id": "0022101021_028", "order": 28, "role": "body", "text": "“I thought we got our legs a little bit and established our defense in that third quarter,” McMillan said."}
{"game_id": "0022101021", "chunk_id": "0022101021_030", "order": 30, "role": "body", "text": "Trail Blazers: Continue a five-game trip at the New York Knicks on Wednesday night."}
{"game_id": "0022101021", "chunk_id": "0022101021_031", "order": 31, "role": "body", "text": "Hawks: At Charlotte on Wednesday night."}
