{"game_id": "0022100961", "chunk_id": "0022100961_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Khris Middleton and Jrue Holiday made sure the Milwaukee Bucks withstood Giannis Antetokounmpo’s foul trouble and got through arguably the toughest three-game stretch of their schedule unscathed."}
{"game_id": "0022100961", "chunk_id": "0022100961_002", "order": 2, "role": "body", "text": "Middleton scored a season-high 44 points, Holiday had 24 and the Bucks rallied to beat the short-handed Phoenix Suns 132-122 on Sunday for their fourth consecutive victory."}
{"game_id": "0022100961", "chunk_id": "0022100961_003", "order": 3, "role": "body", "text": "Holiday scored 17 points and Middleton had 16 in the fourth quarter to help the Bucks outscore the Suns 12-1 over the last three minutes. They're the first Bucks teammates to each score at least 15 fourth-quarter points in the same game over the last 25 seasons, according to the Elias Sports Bureau."}
{"game_id": "0022100961", "chunk_id": "0022100961_004", "order": 4, "role": "body", "text": "“We love being in those type of games,\" Holiday said. “They're a really good team. We kind of know what it takes, especially in moments like that, what it takes to win games.”"}
{"game_id": "0022100961", "chunk_id": "0022100961_005", "order": 5, "role": "body", "text": "The Bucks won their fourth straight overall and third in the last five days. Milwaukee beat the Eastern Conference-leading Miami Heat 120-119  on Wednesday night and Chicago 118-112 on Friday night before knocking off the Suns, who own the NBA's best record."}
{"game_id": "0022100961", "chunk_id": "0022100961_006", "order": 6, "role": "body", "text": "Milwaukee erased a 14-point deficit in the final six minutes of the Heat game and trailed the Bulls by seven points at the start of the fourth quarter."}
{"game_id": "0022100961", "chunk_id": "0022100961_007", "order": 7, "role": "body", "text": "“We’re just trying to lock in a little bit better,\" Middleton said. \"We’ve spoken on it multiple times in the past where we’ve had these lapses and what not. We’re trying to be dialed in, trying to be your best self for 48 minutes out there.”"}
{"game_id": "0022100961", "chunk_id": "0022100961_008", "order": 8, "role": "body", "text": "This was the Suns’ first visit since Antetokounmpo scored 50 points in a 105-98 Game 6 victory gave the Bucks their first NBA title in 50 years. In their only previous matchup this season, the Suns won 131-107 in Phoenix  on Feb. 10."}
{"game_id": "0022100961", "chunk_id": "0022100961_009", "order": 9, "role": "body", "text": "This time, Antetokounmpo had 19 points, 13 rebounds and six assists in 31 minutes before fouling out with 1:12 left."}
{"game_id": "0022100961", "chunk_id": "0022100961_010", "order": 10, "role": "body", "text": "“That was a big statement game for us. ... We really wanted to get that win,” said Phoenix's Jae Crowder, who scored 19 points. “I'm really disappointed with how we finished the game.”"}
{"game_id": "0022100961", "chunk_id": "0022100961_011", "order": 11, "role": "body", "text": "The Suns were playing without their usual All-Star starting backcourt of Devin Booker and Chris Paul. Booker missed his third straight game due to the NBA’s health and safety protocols. Paul broke his right thumb Feb. 16."}
{"game_id": "0022100961", "chunk_id": "0022100961_012", "order": 12, "role": "body", "text": "Phoenix also was missing Cam Johnson, two days after he scored 38 points and made a buzzer-beating 3-pointer in a 115-114 victory over the New York Knicks. Johnson has a bruised right quadriceps."}
{"game_id": "0022100961", "chunk_id": "0022100961_013", "order": 13, "role": "body", "text": "Deandre Ayton led the Suns with 30 points. Cam Payne had 23, Landry Shamet 17 and Mikal Bridges 14."}
{"game_id": "0022100961", "chunk_id": "0022100961_014", "order": 14, "role": "body", "text": "Serge Ibaka had 14 points and 10 rebounds for the Bucks. Jordan Nwora had 12 points and Grayson Allen added 10."}
{"game_id": "0022100961", "chunk_id": "0022100961_015", "order": 15, "role": "body", "text": "The Suns led 107-102 when Antetokounmpo went to the bench after picking up his fifth foul with 7:40 left."}
{"game_id": "0022100961", "chunk_id": "0022100961_016", "order": 16, "role": "body", "text": "But the Bucks outscored the Suns 18-11 in the four-plus minutes Antetokounmpo missed and owned a 120-118 lead when the two-time MVP returned with 3:23 remaining. Holiday and Middleton combined for 16 of the Bucks' 18 points during that stretch."}
{"game_id": "0022100961", "chunk_id": "0022100961_017", "order": 17, "role": "body", "text": "“They were both being aggressive,” said Antetokounmpo, who scored only one point in the fourth quarter. “They took over the fourth quarter offensively and defensively.”"}
{"game_id": "0022100961", "chunk_id": "0022100961_018", "order": 18, "role": "body", "text": "Crowder sank a 3-pointer to put the Suns back ahead with 3:13 left. Nwora missed a 3-point attempt on the Bucks’ next possession, but Antetokounmpo got the rebound and passed to Nwora, who hit a jumper to put Milwaukee back in front for good with 2:52 remaining."}
{"game_id": "0022100961", "chunk_id": "0022100961_020", "order": 20, "role": "body", "text": "Suns: The free-throw disparity killed the Suns' chances. The Bucks went 23 of 29 and the Suns were 8 of 11 on free-throw attempts. ... The Suns had won their last four regular-season matchups with the Bucks. ... Payne's 23 points were one off his career high."}
{"game_id": "0022100961", "chunk_id": "0022100961_021", "order": 21, "role": "body", "text": "Bucks: Wesley Matthews didn’t play due to a sore left hamstring. Matthews had hurt the hamstring Friday at Chicago. “We’re thinking and hoping it’s day to day,” Bucks coach Mike Budenholzer said before the game. ... Serge Ibaka had his highest point and rebound totals since the Bucks acquired him Feb. 10. This was his ninth game with the Bucks."}
{"game_id": "0022100961", "chunk_id": "0022100961_023", "order": 23, "role": "body", "text": "Suns: At Orlando on Tuesday night in the second of three straight road games. The Suns beat the Magic 132-105 at home on Feb. 12."}
{"game_id": "0022100961", "chunk_id": "0022100961_024", "order": 24, "role": "body", "text": "Bucks: At Oklahoma City on Tuesday night. The Bucks defeated the Thunder 96-89 in Milwaukee on Nov. 19."}
