{"game_id": "0022100702", "chunk_id": "0022100702_001", "order": 1, "role": "lead", "text": "TORONTO -- — CJ McCollum had 19 points and 10 rebounds, Jusuf Nurkic had 11 points and 11 rebounds for his fifth straight double-double, and the Portland Trail Blazers beat the Toronto Raptors 114-105 on Sunday night."}
{"game_id": "0022100702", "chunk_id": "0022100702_002", "order": 2, "role": "body", "text": "Anfernee Simons and Nassir Little each had 19 points and Ben McLemore had 17 for the Blazers, who never trailed."}
{"game_id": "0022100702", "chunk_id": "0022100702_003", "order": 3, "role": "body", "text": "Pascal Siakam scored 28 points and Fred VanVleet had 19 for Toronto, which fell behind by 34 points in the first half before cutting the gap to four, 105-101, on a 3 from VanVleet with 1:24 remaining."}
{"game_id": "0022100702", "chunk_id": "0022100702_004", "order": 4, "role": "body", "text": "But Simons answered VanVleet’s late 3 with two of his own, putting Portland up 111-101 with 40 seconds left."}
{"game_id": "0022100702", "chunk_id": "0022100702_005", "order": 5, "role": "body", "text": "“They fought like crazy to get themselves a chance to win this game, and (Simons) hit a couple of daggers,” Blazers coach Chauncey Billups said."}
{"game_id": "0022100702", "chunk_id": "0022100702_006", "order": 6, "role": "body", "text": "Gary Trent Jr. scored 13 points for the Raptors, while Chris Boucher and OG Anunoby each had 11."}
{"game_id": "0022100702", "chunk_id": "0022100702_007", "order": 7, "role": "body", "text": "Playing his fourth game since returning from a collapsed right lung, McCollum shot 8 for 12, including 3 for 5 from distance, while adding six assists and a pair of steals."}
{"game_id": "0022100702", "chunk_id": "0022100702_008", "order": 8, "role": "body", "text": "“We’re building in the right direction,” McCollum said."}
{"game_id": "0022100702", "chunk_id": "0022100702_009", "order": 9, "role": "body", "text": "Little credited McCollum for his dependability and experience on offense."}
{"game_id": "0022100702", "chunk_id": "0022100702_010", "order": 10, "role": "body", "text": "“He’s a guy who can get that bucket when you need it,” Little said. “He’s so creative and the way he handles the ball, he just commands the defense to pay attention to him.”"}
{"game_id": "0022100702", "chunk_id": "0022100702_011", "order": 11, "role": "body", "text": "Portland finished a six-game road trip at 4-2. The Blazers are 6-15 on the road."}
{"game_id": "0022100702", "chunk_id": "0022100702_012", "order": 12, "role": "body", "text": "“It was an incredible trip for us,” Billups said. “I’m so proud of our guys. We’re just becoming a real unit. I’m really happy about that.”"}
{"game_id": "0022100702", "chunk_id": "0022100702_013", "order": 13, "role": "body", "text": "Billups said time off between games helped keep his team fresh throughout the lengthy road swing."}
{"game_id": "0022100702", "chunk_id": "0022100702_014", "order": 14, "role": "body", "text": "“We were fortunate on this trip that we didn’t have back-to-backs at all,” he said. “We were able to play our butts off, play hard as heck and rest the next day. I felt differently than any other long trip, where that last game you’re so tired and bogged down. I didn’t feel that way about us.”"}
{"game_id": "0022100702", "chunk_id": "0022100702_015", "order": 15, "role": "body", "text": "After a five-game road trip in mostly-full arenas, Toronto played at home, where fans have not been permitted since Dec. 31."}
{"game_id": "0022100702", "chunk_id": "0022100702_016", "order": 16, "role": "body", "text": "Raptors coach Nick Nurse said his team had “super-low energy\" in the return to the crowd-free environment."}
{"game_id": "0022100702", "chunk_id": "0022100702_017", "order": 17, "role": "body", "text": "“Usually we’ll try everybody and anybody, keep moving guys around and try to find a unit that works,” Nurse said. “We couldn’t really get that done either.”"}
{"game_id": "0022100702", "chunk_id": "0022100702_018", "order": 18, "role": "body", "text": "A frustrated Nurse said the absence of home support “sucks,” but refused to pin blame on a lack of fans."}
{"game_id": "0022100702", "chunk_id": "0022100702_019", "order": 19, "role": "body", "text": "“That is not the issue,” Nurse said. “It’s really disappointing. Right, wrong, or indifferent, whatever your thoughts are, it’s just hard.”"}
{"game_id": "0022100702", "chunk_id": "0022100702_020", "order": 20, "role": "body", "text": "Portland connected on six of its first eight field-goal attempts, while the Raptors made just one of their first 16."}
{"game_id": "0022100702", "chunk_id": "0022100702_021", "order": 21, "role": "body", "text": "Little scored 10 in the first quarter to help the Trail Blazers jump out to a 25-4 lead and held a 33-15 edge going into the second quarter."}
{"game_id": "0022100702", "chunk_id": "0022100702_022", "order": 22, "role": "body", "text": "Toronto missed five straight shots to start the second and didn’t score until Anunoby’s dunk with 7:41 left in the half. The Raptors had the final four points of the quarter, but trailed 64-34 at the intermission."}
{"game_id": "0022100702", "chunk_id": "0022100702_023", "order": 23, "role": "body", "text": "“So many guys had it going,” Billups said, “and we were able to have that beautiful first half.”"}
{"game_id": "0022100702", "chunk_id": "0022100702_024", "order": 24, "role": "body", "text": "The Raptors had almost as many turnovers in the opening half (10) as they had made baskets (11). Toronto responded with a 33-point third period, including 11 from Siakam, and trailed 86-67 heading to the fourth."}
{"game_id": "0022100702", "chunk_id": "0022100702_026", "order": 26, "role": "body", "text": "Trail Blazers: Former Raptors G Norm Powell missed his third straight game for personal reasons, but Billups said he hopes Powell will rejoin the team soon."}
{"game_id": "0022100702", "chunk_id": "0022100702_027", "order": 27, "role": "body", "text": "Raptors: Set season-lows for first-quarter points and first-half points. … C Khem Birch (fractured nose) missed his fifth straight game."}
{"game_id": "0022100702", "chunk_id": "0022100702_029", "order": 29, "role": "body", "text": "Billups played 29 games for Toronto in 1997-98, his rookie season. Back then, the Raptors played home games at SkyDome, now Rogers Centre, the retractable-roofed home of baseball’s Blue Jays. During his brief time north of the border, Billups lived in the stadium hotel, where the rooms overlook the field."}
{"game_id": "0022100702", "chunk_id": "0022100702_030", "order": 30, "role": "body", "text": "“You could look out of my hotel room right onto the court,” Billups said. “There were so many crazy things that I laugh about, but I loved my time here. It was fun.”"}
{"game_id": "0022100702", "chunk_id": "0022100702_032", "order": 32, "role": "body", "text": "Trail Blazers: Host Minnesota on Tuesday."}
{"game_id": "0022100702", "chunk_id": "0022100702_033", "order": 33, "role": "body", "text": "Raptors: Host Charlotte on Tuesday."}
