{"game_id": "0022101085", "chunk_id": "0022101085_001", "order": 1, "role": "lead", "text": "DETROIT -- — Jeremi Grant scored 21 points and the slumping Detroit Pistons routed the Atlanta Hawks 122-101 on Wednesday night."}
{"game_id": "0022101085", "chunk_id": "0022101085_002", "order": 2, "role": "body", "text": "“We knew they played a tough game last night in New York, and that's always tough for a back-to-back because it takes a while to get out of there,” Pistons coach Dwane Casey said. “So we talked about getting off to a fast start and I was very pleased with our approach.”"}
{"game_id": "0022101085", "chunk_id": "0022101085_003", "order": 3, "role": "body", "text": "Cade Cunningham added 17 points and eight assists for Detroit. The Pistons led by 29 points while winning for the second time in eight games."}
{"game_id": "0022101085", "chunk_id": "0022101085_004", "order": 4, "role": "body", "text": "“We've had a lot of games this year where we let leads get away, so tonight we wanted to make sure we kept our foot on the game,” Marvin Bagley III said. “They made a little bit of a run when we were up almost 30 in the third, but we kept our cool and shut them back down.”"}
{"game_id": "0022101085", "chunk_id": "0022101085_005", "order": 5, "role": "body", "text": "Detroit had eight players in double figures as they easily surpassed its previous biggest victory margin of the season, 16 against Toronto on Jan. 14. Saddiq Bey hit his 192nd 3-pointer of the season in the fourth quarter, breaking Allan Houston’s franchise record."}
{"game_id": "0022101085", "chunk_id": "0022101085_006", "order": 6, "role": "body", "text": "Trae Young had 21 points and nine assists for Atlanta, De’Andre Hunter scored 15 points, and Bogan Bogdanovic added 13. The Hawks had won five of seven."}
{"game_id": "0022101085", "chunk_id": "0022101085_007", "order": 7, "role": "body", "text": "“The second half of a back-to-back is always going to be tough, but the Pistons make it even tougher because they keep so much pressure on the ball,” Hawks coach Nate McMillin said. “They are also always pushing on your defense because they have multiple ballhandlers.”"}
{"game_id": "0022101085", "chunk_id": "0022101085_008", "order": 8, "role": "body", "text": "Young was 9-18 from the floor, including 3-9 on 3-pointers, despite often being guarded by Pistons center Isaiah Stewart."}
{"game_id": "0022101085", "chunk_id": "0022101085_009", "order": 9, "role": "body", "text": "“Trae hit some shots tonight, like he always does, but Isaiah was able to stay in front of him all the way to the 3-point line,” Casey said. “He can do that with any point guard in the league, and that's why he's the focus of our defense.”"}
{"game_id": "0022101085", "chunk_id": "0022101085_010", "order": 10, "role": "body", "text": "The Pistons shot 48.9% in the first half on their way to a 59-51 lead, then started the third quarter with a 16-4 run to force Hawks coach Nate McMillan to call a timeout with his team down 75-55."}
{"game_id": "0022101085", "chunk_id": "0022101085_011", "order": 11, "role": "body", "text": "Detroit, though, continued the run with nine more points before McMillan called another timeout with the score 84-55. This time, his reserves responded, narrowing the Pistons lead to 93-78 going into the fourth quarter."}
{"game_id": "0022101085", "chunk_id": "0022101085_012", "order": 12, "role": "body", "text": "Detroit's defense held Atlanta to two points in the first four minutes of the period and the Hawks never seriously challenged down the stretch."}
{"game_id": "0022101085", "chunk_id": "0022101085_013", "order": 13, "role": "body", "text": "“You could see a lot of our shots coming up short all night,” Young said. “We had a lot of heavy legs out there.”"}
{"game_id": "0022101085", "chunk_id": "0022101085_015", "order": 15, "role": "body", "text": "Hawks: Atlanta starters Timothe Luwawu-Cabarrot and Clint Capela combined for one point in the first half, missing all seven of their field-goal attempts. Capela had nine rebounds in the half."}
{"game_id": "0022101085", "chunk_id": "0022101085_016", "order": 16, "role": "body", "text": "Pistons: Kelly Olynyk scored 10 points in nine first-half minutes, going 4-6 from the floor, including a 3-pointer and a three-point play."}
{"game_id": "0022101085", "chunk_id": "0022101085_018", "order": 18, "role": "body", "text": "With the Hawks running on fumes, McMillin gave Jalen Johnson a season-high 24:42 as the second-unit point guard. Johnson finished with 11 points and seven rebounds."}
{"game_id": "0022101085", "chunk_id": "0022101085_019", "order": 19, "role": "body", "text": "“I've been working all year to be ready for this moment,” said Johnson, whose previous high was 15:13 in a Christmas Day loss to the New York Knicks. “I just wanted to embrace the opportunity.”"}
{"game_id": "0022101085", "chunk_id": "0022101085_021", "order": 21, "role": "body", "text": "Like many NBA coaches, Casey sees plus-minus as a flawed stat, but he did bring attention to Cunningham's plus-43 against Atlanta."}
{"game_id": "0022101085", "chunk_id": "0022101085_022", "order": 22, "role": "body", "text": "“I'm not sure I've had a player get a plus-43 before,” he said. “That shows you how well we are capable of playing with Cade on the floor.”"}
{"game_id": "0022101085", "chunk_id": "0022101085_024", "order": 24, "role": "body", "text": "Hawks: Host Golden State on Friday night."}
{"game_id": "0022101085", "chunk_id": "0022101085_025", "order": 25, "role": "closing", "text": "Pistons: Host Washington on Friday night."}
