{"game_id": "0022100659", "chunk_id": "0022100659_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Nicolas Batum scored all of his season-high 32 points in the second half, Reggie Jackson added 26 points and the Los Angeles Clippers beat the Indiana Pacers 139-133 on Monday in a matchup of sub-.500 teams."}
{"game_id": "0022100659", "chunk_id": "0022100659_002", "order": 2, "role": "body", "text": "Marcus Morris had 21 points for the Clippers, who snapped a two-game skid with their highest-scoring game of the season. Batum and Jackson combined to score 33 of their team's 35 points in the fourth."}
{"game_id": "0022100659", "chunk_id": "0022100659_003", "order": 3, "role": "body", "text": "“I didn’t do anything crazy, I was just wide-open,” Batum said. “I just played off of those guys and made some shots.”"}
{"game_id": "0022100659", "chunk_id": "0022100659_004", "order": 4, "role": "body", "text": "Caris LeVert had 26 points and nine rebounds before fouling out with 28 seconds to play and the Pacers down by five. Chris Duarte added 24 points, seven rebounds and six assists as seven Pacers scored in double figures. They’ve lost four in a row and 10 of 11."}
{"game_id": "0022100659", "chunk_id": "0022100659_005", "order": 5, "role": "body", "text": "The Pacers got within three with 30 seconds left on LeVert's basket after trailing by 13 earlier in the fourth. But Jackson scored the Clippers' final seven points to close out the win."}
{"game_id": "0022100659", "chunk_id": "0022100659_006", "order": 6, "role": "body", "text": "“His pace was really good, attacking and getting downhill,” Clippers coach Tyronn Lue said. “His pace is what really changed the game for us.”"}
{"game_id": "0022100659", "chunk_id": "0022100659_007", "order": 7, "role": "body", "text": "The Clippers have struggled offensively of late, but they shot 55% from the floor and as a team made 18 3-pointers."}
{"game_id": "0022100659", "chunk_id": "0022100659_008", "order": 8, "role": "body", "text": "“It's great to play like that,” Batum said. “Everybody is touching the ball and everybody’s shooting.”"}
{"game_id": "0022100659", "chunk_id": "0022100659_009", "order": 9, "role": "body", "text": "Down 19 points in the third, the Pacers made a run to start the fourth. They scored 10 in a row and later cut their deficit to 109-102 on a wide-open dunk by Goga Bitadze, who finished with a career-high 17 points."}
{"game_id": "0022100659", "chunk_id": "0022100659_010", "order": 10, "role": "body", "text": "Batum hit his fifth 3-pointer of the game and Jackson scored eight in a row to keep the Clippers ahead by 12. Batum had a season-high seven 3-pointers."}
{"game_id": "0022100659", "chunk_id": "0022100659_011", "order": 11, "role": "body", "text": "Batum kept up his run, reeling off 12 in a row, but Duarte hit a 3 and LeVert scored six in a row to threaten until the final seconds."}
{"game_id": "0022100659", "chunk_id": "0022100659_012", "order": 12, "role": "body", "text": "“Batum had a spectacular game,” Pacers coach Rick Carlisle said."}
{"game_id": "0022100659", "chunk_id": "0022100659_013", "order": 13, "role": "body", "text": "The Clippers stretched their lead to double digits in the third. Batum scored 14 in the quarter, hitting back-to-back 3-pointers. A basket by Isaiah Hartenstein gave them their largest lead of the game, 98-79. Terance Mann scored their final six points to send the Clippers into the fourth leading 104-90."}
{"game_id": "0022100659", "chunk_id": "0022100659_014", "order": 14, "role": "body", "text": "The Clippers led by 16 points in a 40-point first quarter and were up by 15 in the second when the Pacers briefly grabbed the momentum."}
{"game_id": "0022100659", "chunk_id": "0022100659_015", "order": 15, "role": "body", "text": "“Giving up 40 in the first quarter was a real killer,” Carlisle said. “The rest of the way we did quite a few good things, but that put us up against it.”"}
{"game_id": "0022100659", "chunk_id": "0022100659_016", "order": 16, "role": "body", "text": "Indiana used an 18-4 run — including 13 in a row with six by LeVert and five by Duarte — to close within one. The Clippers recovered with a 10-2 run to lead 68-59 at halftime."}
{"game_id": "0022100659", "chunk_id": "0022100659_018", "order": 18, "role": "body", "text": "Pacers: Myles Turner (sore left ankle-foot), Malcolm Brogdon (sore right Achilles tendon) and Jeremy Lamb (sore left knee) sat out."}
{"game_id": "0022100659", "chunk_id": "0022100659_019", "order": 19, "role": "body", "text": "Clippers: It was Batum's highest-scoring game since he had 33 against Portland on Nov. 15, 2015, and his most points and 3-pointers in a Clippers uniform. He missed tying his career high by three points. ... Luke Kennard is still working his way back after being in health and safety protocols."}
{"game_id": "0022100659", "chunk_id": "0022100659_021", "order": 21, "role": "body", "text": "Pacers: Stay in LA to play the Lakers on Wednesday."}
{"game_id": "0022100659", "chunk_id": "0022100659_022", "order": 22, "role": "body", "text": "Clippers: At Denver on Wednesday to open an eight-game trip."}
