{"game_id": "0022101164", "chunk_id": "0022101164_001", "order": 1, "role": "lead", "text": "CHICAGO -- — The Miami Heat appear to be back on steady ground after stumbling through a season-high four straight losses. Their grip on the No. 1 seed in the Eastern Conference is tightening, too."}
{"game_id": "0022101164", "chunk_id": "0022101164_002", "order": 2, "role": "body", "text": "Jimmy Butler scored 22 points, Kyle Lowry and Tyler Herro added 19 apiece and the first-place Heat beat the Chicago Bulls 127-109 on Saturday night."}
{"game_id": "0022101164", "chunk_id": "0022101164_003", "order": 3, "role": "body", "text": "Bam Adebayo scored 16 as Miami increased its lead over second-place Milwaukee to 1 1/2 games. The Heat moved within a win of securing home-court advantage in Round 1 of the postseason. And if they go 3-1 the rest of the way, they’ll clinch the top seed in the East."}
{"game_id": "0022101164", "chunk_id": "0022101164_004", "order": 4, "role": "body", "text": "The way they were reeling a week ago, it's quite a turnaround. They bounced back from a loss to Brooklyn, then beat struggling Sacramento and surging Boston before having their way with Chicago."}
{"game_id": "0022101164", "chunk_id": "0022101164_005", "order": 5, "role": "body", "text": "“I think we just had a little bit of a rut, which most teams go through at some point in the season,” Lowry said. “I think it was an opportunity for us to settle things down and communicate a little better.”"}
{"game_id": "0022101164", "chunk_id": "0022101164_006", "order": 6, "role": "body", "text": "The hot-shooting Heat (50-28) also reached the 50-win mark for the first time since the 2013-14 season. They might have two years ago, when they went 44-29 in the pandemic-shortened season and advanced to the NBA Finals."}
{"game_id": "0022101164", "chunk_id": "0022101164_007", "order": 7, "role": "body", "text": "“It just shows you, even when you feel like you have a culture and you're doing things right, it's hard to win consistently in this league,” coach Erik Spoelstra said. “When you have to retool and rebuild new teams and rosters, it's tough. The league is really competitive.”"}
{"game_id": "0022101164", "chunk_id": "0022101164_009", "order": 9, "role": "body", "text": "Miami built a nine-point halftime lead and broke it open in the third quarter. The Heat shot 53.7% in the game and made 17 of 34 3-pointers."}
{"game_id": "0022101164", "chunk_id": "0022101164_010", "order": 10, "role": "body", "text": "Butler, the former Bull, had seven rebounds and six assists. Herro had a strange stat line, matching a season high by nailing 6 of 7 3s, including three in the third. But he was 0 for 9 on 2-point attempts."}
{"game_id": "0022101164", "chunk_id": "0022101164_011", "order": 11, "role": "body", "text": "Dewayne Dedmon added 14 points, and the Heat won their third straight."}
{"game_id": "0022101164", "chunk_id": "0022101164_012", "order": 12, "role": "body", "text": "“We have a long way to go to be at their level,” Bulls coach Billy Donovan said."}
{"game_id": "0022101164", "chunk_id": "0022101164_014", "order": 14, "role": "body", "text": "Zach LaVine led Chicago with 33 points. DeMar DeRozan finished with 26, though he shot 6 of 18, and the Bulls once again lost to an elite opponent. Chicago is a combined 2-19 against the top four teams in the East and West."}
{"game_id": "0022101164", "chunk_id": "0022101164_015", "order": 15, "role": "body", "text": "The sixth-place Bulls fell a half-game behind Toronto with four to play. Chicago, which led the conference for part of the season, is trying to stay in the top six and avoid the play-in round."}
{"game_id": "0022101164", "chunk_id": "0022101164_016", "order": 16, "role": "body", "text": "The Heat were ahead 66-57 at halftime after Lowry made three free throws in the closing seconds. Herro heated up in the third, scoring nine and hitting a 3 in the final minute to make it 98-79."}
{"game_id": "0022101164", "chunk_id": "0022101164_018", "order": 18, "role": "body", "text": "The Heat play in Toronto on Sunday, and it’ll mark Lowry’s first time playing there since he joined Miami last summer. Lowry remains beloved in Toronto after helping the Raptors win the 2019 NBA title, and he said it’ll be emotional. “I'm nervous,\" he said. “At the same time, I'm excited. It's gonna be a great moment. I told the guys I gave them a good game today, but I don't know what I'm gonna give them (Sunday). Emotionally, I might not be there. But it's gonna be a great day.\""}
{"game_id": "0022101164", "chunk_id": "0022101164_020", "order": 20, "role": "body", "text": "Heat: The Heat have 10 50-win seasons. ... F Caleb Martin (bruised right calf), G/F Max Strus (bruised right shoulder) and G Gabe Vincent (bruised right big toe) were available after being listed as questionable."}
{"game_id": "0022101164", "chunk_id": "0022101164_021", "order": 21, "role": "body", "text": "Bulls: F Alex Caruso sat out part of the third quarter because of back spasms. “It's nothing long term,” Donovan said. ... G Lonzo Ball (left knee) will not start sprinting and cutting until early in the week. Donovan said the Bulls figure to have a better handle on his status on Tuesday or Wednesday. “They're slowly building him up into that right now,” he said. “We're close to getting to that point from what they told me.” Ball had surgery in January to repair a torn meniscus. ... Saturday marked the 15th anniversary of Donovan coaching Florida to an NCAA championship win over Ohio State and a title repeat."}
{"game_id": "0022101164", "chunk_id": "0022101164_023", "order": 23, "role": "body", "text": "Heat: Visit Toronto on Sunday."}
{"game_id": "0022101164", "chunk_id": "0022101164_024", "order": 24, "role": "body", "text": "Bulls: Host Milwaukee on Tuesday."}
