{"game_id": "0022100248", "chunk_id": "0022100248_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Paul George scored 12 of his 29 points in the third quarter and the Los Angeles Clippers ended a two-game skid with a 97-91 victory over the Dallas Mavericks on Sunday."}
{"game_id": "0022100248", "chunk_id": "0022100248_002", "order": 2, "role": "body", "text": "Reggie Jackson scored eight of his 23 points in the third, when the Clippers turned a one-point halftime deficit into a nine-point lead. The Clippers improved to 7-0 when Jackson has 20 or more points, all since Nov. 3."}
{"game_id": "0022100248", "chunk_id": "0022100248_003", "order": 3, "role": "body", "text": "“When he is aggressive scoring the basketball, making the right play, we are a tough team to beat,” Clippers coach Tyronn Lue said. “For him to step up and be that second scorer behind PG, we need that a lot. When he plays well, we play well.”"}
{"game_id": "0022100248", "chunk_id": "0022100248_004", "order": 4, "role": "body", "text": "Kristaps Porzingis had 25 points and eight rebounds as the Mavericks played their third consecutive game without star Luka Doncic because of a sprained left knee and ankle."}
{"game_id": "0022100248", "chunk_id": "0022100248_005", "order": 5, "role": "body", "text": "Jalen Brunson scored 20 points for the Mavericks, who have lost all three games without Doncic to open a four-game road trip."}
{"game_id": "0022100248", "chunk_id": "0022100248_006", "order": 6, "role": "body", "text": "“I thought we had a lot of great looks at 3 that were just short tonight for whatever reason,” Mavericks coach Jason Kidd said of his team that was just 20% (6 of 30) from 3-point range."}
{"game_id": "0022100248", "chunk_id": "0022100248_007", "order": 7, "role": "body", "text": "“In that fourth quarter, when things weren’t going well, I thought we improved to give ourselves a chance to win on the road.”"}
{"game_id": "0022100248", "chunk_id": "0022100248_008", "order": 8, "role": "body", "text": "The Mavericks led by as many as nine points in a rough-shooting first half in which both teams shot under 42% from the field. The Clippers rallied to pull within 47-46 at halftime."}
{"game_id": "0022100248", "chunk_id": "0022100248_009", "order": 9, "role": "body", "text": "The Clippers shot 55.6% (10 of 18) in the third quarter, getting half of their made shots from 3-point range while taking a 71-62 lead."}
{"game_id": "0022100248", "chunk_id": "0022100248_010", "order": 10, "role": "body", "text": "The Mavericks pulled within 78-75 on Tim Hardaway Jr.‘s 3-pointer with 7:33 remaining before the Clippers went on a 9-0 run for an 87-75 lead."}
{"game_id": "0022100248", "chunk_id": "0022100248_011", "order": 11, "role": "body", "text": "“It’s been a process, honestly,” Jackson said. “There are games when we play well and there are games where we hit these lulls and are still trying to figure each other out. … I think we all just found easier shots today.”"}
{"game_id": "0022100248", "chunk_id": "0022100248_012", "order": 12, "role": "body", "text": "The Mavericks appeared to pull within 94-91 with 52 seconds remaining after a basket by Brunson, but a foul on the Clippers’ Terance Mann was rescinded and the basket was taken away. Jackson then scored inside to give the Clippers a 96-89 lead with 29 seconds to play."}
{"game_id": "0022100248", "chunk_id": "0022100248_013", "order": 13, "role": "body", "text": "“I thought he got fouled and made a great play,” Kidd said. “It’s a strange play because we lose the two points and then we lose the ball. It puts you in a difficult situation coming down the stretch.”"}
{"game_id": "0022100248", "chunk_id": "0022100248_014", "order": 14, "role": "body", "text": "Ivica Zubac had 16 points and 10 rebounds for the Clippers in the opener of a six-game home stretch."}
{"game_id": "0022100248", "chunk_id": "0022100248_015", "order": 15, "role": "body", "text": "The teams were meeting for the first time since the Clippers staved off elimination in the first round of last season’s playoffs by winning Game 6 and 7 to advance."}
{"game_id": "0022100248", "chunk_id": "0022100248_017", "order": 17, "role": "body", "text": "The Clippers revealed that F Nicolas Batum was placed into health and safety protocols for at least 10 days. It’s the latest personnel hurdle for a team that is without star Kawhi Leonard (knee) indefinitely."}
{"game_id": "0022100248", "chunk_id": "0022100248_018", "order": 18, "role": "body", "text": "“It’s next-man-up mentality and hopefully we get some help soon,” Zubac said. “That stuff, you can’t control what happens and you have to have that (positive) mentality and I think we do. Everyone has to stay ready and everyone will get a chance.”"}
{"game_id": "0022100248", "chunk_id": "0022100248_019", "order": 19, "role": "body", "text": "Batum has averaged 9.8 points and 5.5 rebounds, but has scored in double digits just once since a 22-point game on Nov. 9 against the Portland Trail Blazers as he recently dealt with Achilles tendon soreness."}
{"game_id": "0022100248", "chunk_id": "0022100248_021", "order": 21, "role": "body", "text": "Mavericks: Doncic went through pregame shooting drills but was ruled out on a game-time decision. … After missing nine consecutive games with a left oblique strain, F Maxi Kleber returned to score five points in 20 minutes. … G Frank Ntilikina (three points on 1-of-6 shooting) left after nine minutes and did not play in the second half because of a right calf injury."}
{"game_id": "0022100248", "chunk_id": "0022100248_022", "order": 22, "role": "body", "text": "Clippers: C Serge Ibaka was activated for the first time since Nov. 9 and for just the third time this season after a G League stint to get him up to speed after offseason back surgery. He scored six points in 12 minutes. … G Amir Coffey made his second start in three games and just the fourth of his career."}
{"game_id": "0022100248", "chunk_id": "0022100248_024", "order": 24, "role": "body", "text": "Mavericks: Play at the Clippers on Tuesday."}
{"game_id": "0022100248", "chunk_id": "0022100248_025", "order": 25, "role": "closing", "text": "Clippers: Play host to Dallas on Tuesday."}
