{"game_id": "0022100692", "chunk_id": "0022100692_001", "order": 1, "role": "lead", "text": "DENVER -- — Ja Morant scored 38 points and the Memphis Grizzlies overcame Nikola Jokic's fourth straight triple-double to beat the Denver Nuggets 122-118 on Friday night."}
{"game_id": "0022100692", "chunk_id": "0022100692_002", "order": 2, "role": "body", "text": "Morant scored on floaters, runners, fadeaways, 3-pointers, an emphatic alley-oop and driving layups while slicing through a variety of Nuggets defenders. He set a career-high with 23 points in the first half and finished 15 of 26 from the field."}
{"game_id": "0022100692", "chunk_id": "0022100692_003", "order": 3, "role": "body", "text": "“I was able to get to my spots on the floor, which I excel at,” Morant said. “And once I get to my normal spots, it's pretty much buckets.”"}
{"game_id": "0022100692", "chunk_id": "0022100692_004", "order": 4, "role": "body", "text": "Morant was six points shy of his career high and also had six rebounds and six assists. Jaren Jackson Jr. added 20 points, including a 3-pointer on a feed from Morant with 41 seconds left after the Nuggets got within 115-111."}
{"game_id": "0022100692", "chunk_id": "0022100692_005", "order": 5, "role": "body", "text": "“That was the play of the game,” Grizzlies coach Taylor Jenkins said. “It was a beautiful pass. He and Jaren have connected on a couple big game-winners this year.”"}
{"game_id": "0022100692", "chunk_id": "0022100692_006", "order": 6, "role": "body", "text": "De'Anthony Melton had 21 points and nine rebounds off the bench as the Grizzlies won for the second time in four games since snapping their 11-game winning streak."}
{"game_id": "0022100692", "chunk_id": "0022100692_007", "order": 7, "role": "body", "text": "Two days after his 49-point triple-double in an overtime victory over the Los Angeles Clippers, Jokic had 26 points, 11 rebounds and 12 assists. It was his NBA-best 11th triple-double of the season and 68th of his career."}
{"game_id": "0022100692", "chunk_id": "0022100692_008", "order": 8, "role": "body", "text": "Will Barton had 27 points and eight assists, but the Nuggets' bench let them down as the Grizzlies took control early in the fourth quarter."}
{"game_id": "0022100692", "chunk_id": "0022100692_009", "order": 9, "role": "body", "text": "“At times it felt like they were playing at a different speed than us,” coach Michael Malone said."}
{"game_id": "0022100692", "chunk_id": "0022100692_010", "order": 10, "role": "body", "text": "Bryn Forbes, acquired by Denver from San Antonio in a three-team trade Wednesday, was the first player off the bench. He immediately hit a 20-footer but hit just 4 of 13 shots and scored nine points."}
{"game_id": "0022100692", "chunk_id": "0022100692_011", "order": 11, "role": "body", "text": "Malone said Forbes told him “my bad” as they headed to the locker room after the game."}
{"game_id": "0022100692", "chunk_id": "0022100692_012", "order": 12, "role": "body", "text": "“I think probably because I know I’m better than I played tonight,” Forbes said. \"It was kind of frustrating for me, just personally. I think I’ve got a lot more in me than that.”"}
{"game_id": "0022100692", "chunk_id": "0022100692_013", "order": 13, "role": "body", "text": "Forbes and the second unit were on the floor as the Grizzlies scored the first six points of the fourth quarter to go ahead 104-92. When Morant checked back in with 7:18 left, the Grizzlies led 108-96."}
{"game_id": "0022100692", "chunk_id": "0022100692_014", "order": 14, "role": "body", "text": "About the only thing Morant did wrong was run the length of the floor, grab and hang onto the backboard, and pick up a technical foul after he was called for a foul on Jokic in the third quarter."}
{"game_id": "0022100692", "chunk_id": "0022100692_015", "order": 15, "role": "body", "text": "“I know there are conversations about him being an All-Star. That's a for-sure thing,\" Jenkins said. \"He's playing at an All-Star level. And I think he's playing at an MVP level.”"}
{"game_id": "0022100692", "chunk_id": "0022100692_016", "order": 16, "role": "body", "text": "The Grizzlies were 9 of 40 from 3-point range in Wednesday's loss at Milwaukee. They hit their first five from long range Friday and were 10 of 16 in the first half in building a 13-point lead."}
{"game_id": "0022100692", "chunk_id": "0022100692_017", "order": 17, "role": "body", "text": "The Nuggets added veteran center DeMarcus Cousins on Friday to a 10-day contract, but he didn't play after Malone said he was “dealing with a slight, I wouldn’t say injury, but just something where we’ll kind of see how he feels pregame.”"}
{"game_id": "0022100692", "chunk_id": "0022100692_019", "order": 19, "role": "body", "text": "Grizzlies: F Dillon Brooks (left ankle sprain) is still expected to miss about a month after being injured Jan. 8. “The swelling is going down and his mobility is starting to go up a little bit,\" Jenkins said. “He hasn’t jumped on the court yet, so the timeline really hasn’t changed.\" ... F Killian Tillie exited COVID-19 protocols but didn't play. ... Desmond Bane, Kyle Anderson and Tyus Jones (COVID-19 protocols) remained out."}
{"game_id": "0022100692", "chunk_id": "0022100692_020", "order": 20, "role": "body", "text": "Nuggets: Malone and F Jeff Green picked up second-quarter technical fouls. ... G Jamal Murray, who is recovering from knee surgery, was placed in COVID-19 protocols. ... With Forbes' addition, G Austin Rivers was dropped from rotation and didn't play. ... Peyton Manning, who led the Broncos to their last Super Bowl title, sat behind Memphis' bench."}
{"game_id": "0022100692", "chunk_id": "0022100692_022", "order": 22, "role": "body", "text": "Malone hopes he can boost the second unit when Jokic is resting."}
{"game_id": "0022100692", "chunk_id": "0022100692_023", "order": 23, "role": "body", "text": "“I think DeMarcus makes it hard for other teams to say, ‘We’re going to switch from 1 to 5,’” Malone said. “DeMarcus is a very effective low post player, and I hope you realize he’s a hell of a playmaker.”"}
{"game_id": "0022100692", "chunk_id": "0022100692_025", "order": 25, "role": "body", "text": "Grizzles: Visit Dallas on Sunday night in the third stop of a four-game trip."}
{"game_id": "0022100692", "chunk_id": "0022100692_026", "order": 26, "role": "body", "text": "Nuggets: Conclude their season-long six-game homestand Sunday night vs. Detroit."}
