{"game_id": "0022100122", "chunk_id": "0022100122_001", "order": 1, "role": "lead", "text": "PHOENIX -- — JaVale McGee has played just seven games for the Phoenix Suns and has already become a fan favorite in the desert. At 7-feet tall with long arms, long legs and a tendency to throw his body all over the court, the veteran's stints in the game are never boring."}
{"game_id": "0022100122", "chunk_id": "0022100122_002", "order": 2, "role": "body", "text": "They're also usually pretty effective."}
{"game_id": "0022100122", "chunk_id": "0022100122_003", "order": 3, "role": "body", "text": "McGee had emphatic blocks on back-to-back possessions to energize the Suns late in the third quarter, which helped the team rally for a 123-111 victory over the Houston Rockets on Thursday night."}
{"game_id": "0022100122", "chunk_id": "0022100122_004", "order": 4, "role": "body", "text": "“Defensively, he's a big dude,” Suns coach Monty Williams said. “He's long and athletic and his ability to distract shots, even if he doesn't block it, really helps us.”"}
{"game_id": "0022100122", "chunk_id": "0022100122_005", "order": 5, "role": "body", "text": "Devin Booker led the Suns with 27 points while Landry Shamet added 19 off the bench. Phoenix has won three straight games and pushed above .500 for the first time this season with a 4-3 record."}
{"game_id": "0022100122", "chunk_id": "0022100122_006", "order": 6, "role": "body", "text": "Houston has dropped five straight overall and lost five in a row to the Suns. The Rockets are 1-7."}
{"game_id": "0022100122", "chunk_id": "0022100122_007", "order": 7, "role": "body", "text": "Shamet and McGee led a strong effort from the Suns' bench, which combined for 52 points. Chris Paul had 13 assists two nights after he had 18 in a win against the Pelicans, which moved him to No. 3 all-time on the NBA's career list."}
{"game_id": "0022100122", "chunk_id": "0022100122_008", "order": 8, "role": "body", "text": "Booker added nine rebounds and five assists."}
{"game_id": "0022100122", "chunk_id": "0022100122_009", "order": 9, "role": "body", "text": "The Suns bumbled through a large chunk of the game before gaining some momentum late in the third quarter. McGee sparked the rally with his blocks on back-to-back possessions and nearly had a third but it was wiped out for goaltending. The defensive outburst helped Phoenix turn a narrow deficit into a 93-86 advantage heading into the fourth quarter."}
{"game_id": "0022100122", "chunk_id": "0022100122_010", "order": 10, "role": "body", "text": "The Suns led by as many as 15 points in the fourth."}
{"game_id": "0022100122", "chunk_id": "0022100122_011", "order": 11, "role": "body", "text": "Houston's Kevin Porter Jr. scored a season-high 20 points, while Christian Wood added 18. Rockets coach Stephen Silas said there were several reasons for his team's third-quarter breakdown."}
{"game_id": "0022100122", "chunk_id": "0022100122_012", "order": 12, "role": "body", "text": "“There was the momentum, the fans, there’s our youth,” Silas said. “Their know-how and they came at us like a hurricane and it was hard for us to regroup after that.”"}
{"game_id": "0022100122", "chunk_id": "0022100122_013", "order": 13, "role": "body", "text": "Houston used a big second quarter to jump out to a 61-56 halftime lead. Wood led the Rockets with 12 points while Porter added 10. Mikal Bridges had 12 for the Suns before the break."}
{"game_id": "0022100122", "chunk_id": "0022100122_015", "order": 15, "role": "body", "text": "The game was somewhat of an afterthought for the Suns, who spent most of the day digesting the fallout from an ESPN report that owner Robert Sarver has a history of racist, misogynistic and hostile incidents during his 17-year tenure in charge of the franchise."}
{"game_id": "0022100122", "chunk_id": "0022100122_016", "order": 16, "role": "body", "text": "Williams — who is Black — said he hadn’t talked with Sarver since ESPN’s story was published and that if he had heard the owner say any of the things that were alleged in the story “I wouldn’t be in this seat.”"}
{"game_id": "0022100122", "chunk_id": "0022100122_017", "order": 17, "role": "body", "text": "“My reaction is it’s a lot to process,” Williams said. “There’s so many things there and for me it’s still not clear, as far as the facts are concerned. As someone who is the caretaker of the program, I find all of these things that are being said serious in nature. These allegations are sensitive — that’s an understatement.”"}
{"game_id": "0022100122", "chunk_id": "0022100122_018", "order": 18, "role": "body", "text": "Williams was pleased the Suns were able to focus despite the turmoil and pull out a win."}
{"game_id": "0022100122", "chunk_id": "0022100122_019", "order": 19, "role": "body", "text": "“You're not going to have a long career in the NBA if you can't handle distractions,\" Williams said. “I was proud of the way we approached this morning and the way we played tonight.”"}
{"game_id": "0022100122", "chunk_id": "0022100122_021", "order": 21, "role": "body", "text": "Rockets: F Daniel Theis (right big toe soreness) didn't play."}
{"game_id": "0022100122", "chunk_id": "0022100122_022", "order": 22, "role": "body", "text": "Suns: Deandre Ayton was back in the lineup after missing one game with a right leg contusion. He finished with 16 points and 11 rebounds in 26 minutes before fouling out ... G Cameron Payne (hamstring) missed his fifth straight game. ... F Jae Crowder got a technical foul in the third quarter for arguing with a referee."}
{"game_id": "0022100122", "chunk_id": "0022100122_024", "order": 24, "role": "body", "text": "Rockets: Travel to face the Nuggets on Saturday."}
{"game_id": "0022100122", "chunk_id": "0022100122_025", "order": 25, "role": "body", "text": "Suns: Host the Hawks on Saturday."}
