{"game_id": "0022100345", "chunk_id": "0022100345_001", "order": 1, "role": "lead", "text": "DALLAS -- — The next time the Memphis Grizzlies trail in what is expected to be about two weeks without Ja Morant will be the first."}
{"game_id": "0022100345", "chunk_id": "0022100345_002", "order": 2, "role": "body", "text": "Desmond Bane scored a career-high 29 points, and the Grizzlies held on to beat the Dallas Mavericks 97-90 on Saturday night in their first game since setting an NBA record with a 73-point victory."}
{"game_id": "0022100345", "chunk_id": "0022100345_003", "order": 3, "role": "body", "text": "Tyus Jones had 16 points and seven assists for the Grizzlies, who haven't trailed at all while going 4-0 since Morant, their star guard and leading scorer, was sidelined with a left knee sprain."}
{"game_id": "0022100345", "chunk_id": "0022100345_004", "order": 4, "role": "body", "text": "Memphis is the first team in the 25 seasons of the statistic being tracked to lead at least four consecutive games without even being tied after 0-0, according to the Elias Sports Bureau."}
{"game_id": "0022100345", "chunk_id": "0022100345_005", "order": 5, "role": "body", "text": "“I think we’ve been getting off to good starts,” said Bane, who was 12 of 20 from the field. “We’ve been playing well on the defensive side, and that’s been allowing us to get out and run. That’s our best offense. The more we can get stops and get out in transition, the more I like our chances.”"}
{"game_id": "0022100345", "chunk_id": "0022100345_006", "order": 6, "role": "body", "text": "The Mavericks dropped to 0-4 this season without young sensation Luka Doncic. They were also missing his European sidekick, Kristaps Porzingis, and lost their fourth consecutive game without their top two scorers going back to last season."}
{"game_id": "0022100345", "chunk_id": "0022100345_007", "order": 7, "role": "body", "text": "Dallas had little punch offensively until it was too late in a fourth consecutive home loss, shooting 34% in their second game since setting a franchise record at 68.7% in a 32-point victory at New Orleans."}
{"game_id": "0022100345", "chunk_id": "0022100345_008", "order": 8, "role": "body", "text": "Tim Hardaway Jr. scored 20 of his 29 points in the fourth quarter for the Mavericks, who cut a 15-point deficit to five in the final five minutes but couldn't get closer."}
{"game_id": "0022100345", "chunk_id": "0022100345_009", "order": 9, "role": "body", "text": "“You can get discouraged when you’re not playing well at home,” Dallas coach Jason Kidd said. “I think the mental part is strong because it would be easy for them to let go of the rope, having the built-in excuse of no Luka and no (Porzingis) and end up losing by 20. But those guys that were in uniform fought and gave themselves a chance to get back in the game.”"}
{"game_id": "0022100345", "chunk_id": "0022100345_010", "order": 10, "role": "body", "text": "Steven Adams had 11 points and 13 rebounds, and Jaren Jackson Jr. scored 13 points for Memphis."}
{"game_id": "0022100345", "chunk_id": "0022100345_011", "order": 11, "role": "body", "text": "Doncic sat the second night of a back-to-back with left ankle soreness, which Kidd said was related to a sprain of his ankle, along with his left knee, sustained almost three weeks ago. Kidd said the two-time All-Star had an MRI but wouldn't reveal the results."}
{"game_id": "0022100345", "chunk_id": "0022100345_012", "order": 12, "role": "body", "text": "“It’s just been a busy stretch of games for us,” Kidd said before the game. “So we’ll see how he feels tomorrow.”"}
{"game_id": "0022100345", "chunk_id": "0022100345_013", "order": 13, "role": "body", "text": "The oft-injured Porzingis was out for a second consecutive game with a left knee contusion."}
{"game_id": "0022100345", "chunk_id": "0022100345_014", "order": 14, "role": "body", "text": "Two nights after a 152-79 victory at home against Oklahoma City, Memphis went up 10 points in the first six minutes and led by as many as 17 before holding on late and improving to a season-best three games over .500 (13-10)."}
{"game_id": "0022100345", "chunk_id": "0022100345_015", "order": 15, "role": "body", "text": "“The first couple of possessions our activity, especially defensively, has been good for us,” coach Taylor Jenkins said. “That has allowed us to play with confidence on the offensive end. I think our spacing and ball movement is getting better, and now we are making some shots.”"}
{"game_id": "0022100345", "chunk_id": "0022100345_016", "order": 16, "role": "body", "text": "The Mavericks have lost consecutive home games on either side of the victory at New Orleans that was the best shooting night in the NBA in almost 24 years. Dallas is at 37% in the two games since then, including a 107-91 loss to the Pelicans to finish a home-and-home set."}
{"game_id": "0022100345", "chunk_id": "0022100345_018", "order": 18, "role": "body", "text": "Grizzlies: F Brandon Clarke was out with right knee soreness, while rookie F Ziaire Williams, the 10th pick in the draft, missed his third consecutive game with left knee soreness. Coach Taylor Jenkins indicated both could return soon. ... Bane's previous career high was 28 at Utah on Nov. 22."}
{"game_id": "0022100345", "chunk_id": "0022100345_019", "order": 19, "role": "body", "text": "Mavericks: C Willie Cauley-Stein missed his fourth consecutive game, the past three of which have been for personal reasons. ... G Frank Ntilikina (right calf strain) played for the first time since Nov. 21, scoring three points in 13 minutes. He was active a night earlier against New Orleans but didn't play."}
{"game_id": "0022100345", "chunk_id": "0022100345_021", "order": 21, "role": "body", "text": "Bane, who spent four years on the other side of the Dallas-Fort Worth area at TCU, scored 11 points in the fourth quarter to help keep the lead comfortable until a late Dallas surge. He also set a career best with nine rebounds."}
{"game_id": "0022100345", "chunk_id": "0022100345_022", "order": 22, "role": "body", "text": "The 30th pick in the 2020 draft uses all the teams that passed on him as motivation, but that's especially true with the franchise closest to his college home. “I'm glad we got the win tonight, let me just say that,” Bane said."}
{"game_id": "0022100345", "chunk_id": "0022100345_024", "order": 24, "role": "body", "text": "Jalen Brunson, starting in place of Doncic when he normally replaces him off the bench, was just 7 of 21 from the field, including a missed jumper that could have pulled Dallas within three with a minute remaining. He had 15 points and eight assists."}
{"game_id": "0022100345", "chunk_id": "0022100345_026", "order": 26, "role": "body", "text": "Grizzlies: At Miami on Monday to complete the season series. The Heat won the first meeting."}
{"game_id": "0022100345", "chunk_id": "0022100345_027", "order": 27, "role": "body", "text": "Mavericks: Kevin Durant, James Harden and the Brooklyn Nets visit Tuesday. Dallas swept the two-game series last season, but Durant missed the first game and Harden the second."}
