{"game_id": "0022100444", "chunk_id": "0022100444_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — Shai Gilgeous-Alexander created space to hit his winner. Then he created space for his celebration dance."}
{"game_id": "0022100444", "chunk_id": "0022100444_002", "order": 2, "role": "body", "text": "Gilgeous-Alexander hit a 27-foot, step-back 3-pointer at the buzzer to give the Oklahoma City Thunder a 104-103 victory over the Los Angeles Clippers on Saturday night."}
{"game_id": "0022100444", "chunk_id": "0022100444_003", "order": 3, "role": "body", "text": "On Wednesday night, Gilgeous-Alexander hit a 30-footer with 1.4 seconds to tie the game against New Orleans, but Devonte Graham drained a 60-foot heave as time expired  for the winner."}
{"game_id": "0022100444", "chunk_id": "0022100444_004", "order": 4, "role": "body", "text": "This time, Gilgeous-Alexander  hit the game’s last dramatic shot, and his teammates mobbed him as he ran downcourt. He then broke into a dance in which waved his arms. He called it the “Lamar Odom Dance,\" for the former NBA player Gilgeous-Alexander said he got it from. Gilgeous-Alexander said he and Thunder forward Darius Bazley had seen footage of Odom doing the dance and liked it."}
{"game_id": "0022100444", "chunk_id": "0022100444_005", "order": 5, "role": "body", "text": "“Baze and I always thought it was like, so cool,” Gilgeous-Alexander said. \"And I told him (Bazley) the first time I hit my real game-winner with the buzzer going down, I was going to do the dance. And then I forgot to do it. And then as soon as I saw Baze on the court, it came back to my head.”"}
{"game_id": "0022100444", "chunk_id": "0022100444_006", "order": 6, "role": "body", "text": "Lu Dort, who scored 29 points after sitting out Oklahoma City’s previous game with a sprained left ankle, said Gilgeous-Alexander definitely wanted his room to show off his moves."}
{"game_id": "0022100444", "chunk_id": "0022100444_007", "order": 7, "role": "body", "text": "“He actually pushed me and started dancing,” Dort said, laughing."}
{"game_id": "0022100444", "chunk_id": "0022100444_008", "order": 8, "role": "body", "text": "Gilgeous-Alexander's footwork, not his arms, got him the clean look on the final shot. He was able to step away from Los Angeles' Nicolas Batum."}
{"game_id": "0022100444", "chunk_id": "0022100444_009", "order": 9, "role": "body", "text": "“I looked at the clock and there was like three seconds left after (Mike Muscala) had got it to me,\" Gilgeous-Alexander said. \"And I knew like where I caught it was like, perfect for my comfort zone shot I want to shoot. I tried to make it look like I was driving, and then I got into my step back that I work on every day. And as soon as I let go, it felt good.”"}
{"game_id": "0022100444", "chunk_id": "0022100444_010", "order": 10, "role": "body", "text": "Gilgeous-Alexander scored 18 points, and rookie Josh Giddey had eight points, a career-high 18 rebounds and 10 assists."}
{"game_id": "0022100444", "chunk_id": "0022100444_011", "order": 11, "role": "body", "text": "Luke Kennard scored a season-high 27 points for Los Angeles. Terance Mann had 18 points, and Reggie Jackson added 16 points and 10 assists. Los Angeles forward Paul George, the team's leading scorer with 25 points per game, sat out with a sprained right elbow."}
{"game_id": "0022100444", "chunk_id": "0022100444_012", "order": 12, "role": "body", "text": "The Thunder led 57-52 at halftime behind 15 points from Dort and 11 from rookie reserve Tre Mann. Oklahoma City shot 53% before the break. Kennard scored 15 points for the Clippers."}
{"game_id": "0022100444", "chunk_id": "0022100444_013", "order": 13, "role": "body", "text": "The Thunder led 81-79 at the end of the third quarter."}
{"game_id": "0022100444", "chunk_id": "0022100444_014", "order": 14, "role": "body", "text": "Gilgeous-Alexander was quiet as a scorer until the fourth quarter. He scored a layup and a 3-pointer to give the Thunder a 93-86 lead."}
{"game_id": "0022100444", "chunk_id": "0022100444_015", "order": 15, "role": "body", "text": "Oklahoma City led for most of the quarter, but the Clippers took the lead late. Los Angeles led 103-101 with Justise Winslow at the line in the closing seconds. Winslow missed both free throws and the Thunder rebounded and called timeout to set up their final play."}
{"game_id": "0022100444", "chunk_id": "0022100444_016", "order": 16, "role": "body", "text": "“I thought we did some good things,\" Clippers coach Tyronn Lue said. \"We had a chance to win the game and (Gilgeous-Alexander) made a tough shot at the end to win.”"}
{"game_id": "0022100444", "chunk_id": "0022100444_018", "order": 18, "role": "body", "text": "Clippers: Winslow got his first start of the season for the Clippers. He finished with nine points and nine rebounds. ... Batum returned after missing three games because of a sprained right ankle. He scored 12 points, but he couldn't keep up with Gilgeous-Alexander on the final shot."}
{"game_id": "0022100444", "chunk_id": "0022100444_019", "order": 19, "role": "body", "text": "Thunder: Rookie Aaron Wiggins started in place of Bazley. Thunder coach Mark Daigneault said before the game that the situation was fluid and the team wanted to try different combinations to find out what works. Bazley scored 10 points in 24 minutes. Wiggins scored five points in 18 minutes."}
{"game_id": "0022100444", "chunk_id": "0022100444_021", "order": 21, "role": "body", "text": "Gilgeous-Alexander scored just eight points in the first three quarters. He scored 10 points on 4-for-6 shooting in the fourth."}
{"game_id": "0022100444", "chunk_id": "0022100444_023", "order": 23, "role": "body", "text": "Gilgeous-Alexander, on hitting the winner after losing in dramatic fashion on Wednesday: “Yeah, it feels good. It’s almost like this one felt a little bit better after the last one.”"}
{"game_id": "0022100444", "chunk_id": "0022100444_025", "order": 25, "role": "body", "text": "Clippers: Host San Antonio on Monday night."}
{"game_id": "0022100444", "chunk_id": "0022100444_026", "order": 26, "role": "body", "text": "Thunder: At Memphis on Monday night."}
{"game_id": "0022100444", "chunk_id": "0022100444_028", "order": 28, "role": "body", "text": "Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP"}
