{"game_id": "0022100975", "chunk_id": "0022100975_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Kevin Durant simply began clapping when asked about teammate Kyrie Irving's 50-point performance Tuesday night."}
{"game_id": "0022100975", "chunk_id": "0022100975_002", "order": 2, "role": "body", "text": "“That was master class,” Durant said."}
{"game_id": "0022100975", "chunk_id": "0022100975_003", "order": 3, "role": "body", "text": "Irving hit nine 3-pointers and the Brooklyn Nets snapped a four-game skid with a 132-121 win over the Charlotte Hornets."}
{"game_id": "0022100975", "chunk_id": "0022100975_004", "order": 4, "role": "body", "text": "Irving became one of 22 players in NBA history with five 50-point games, according to Basketball Reference. His career high is 57 points on March, 12, 2015, while playing for the Cleveland Cavaliers in an overtime win against San Antonio."}
{"game_id": "0022100975", "chunk_id": "0022100975_005", "order": 5, "role": "body", "text": "“Younger players should watch this game and learn what it takes to score at that level,\" Durant said."}
{"game_id": "0022100975", "chunk_id": "0022100975_006", "order": 6, "role": "body", "text": "Durant had a quiet night by his lofty standards, finishing with 14 points."}
{"game_id": "0022100975", "chunk_id": "0022100975_007", "order": 7, "role": "body", "text": "But he didn’t have to do much lifting with Irving taking control most of the game."}
{"game_id": "0022100975", "chunk_id": "0022100975_008", "order": 8, "role": "body", "text": "Irving, who has only been allowed to play in away games due to COVID-19 protocols in New York, finished 15 of 19 from the field and 9 of 12 from beyond the arc. He also was 11 of 13 from the line."}
{"game_id": "0022100975", "chunk_id": "0022100975_009", "order": 9, "role": "body", "text": "He became only the second guard in NBA history to have multiple 50-point games while shooting 75% from the floor, according to Stats. The other is Michael Jordan."}
{"game_id": "0022100975", "chunk_id": "0022100975_010", "order": 10, "role": "body", "text": "“It was special,” Seth Curry said. “He made great plays all over the floor. He didn’t force it. Catch and shoot, off the dribble and got to the rim, too. We needed that Kyrie.”"}
{"game_id": "0022100975", "chunk_id": "0022100975_011", "order": 11, "role": "body", "text": "Durant said Irving had “that look in his eye” before the game, and the former Duke point guard agreed."}
{"game_id": "0022100975", "chunk_id": "0022100975_012", "order": 12, "role": "body", "text": "“It felt like a must-win night,” Irving said. “I’m not saying the other nights didn’t feel like that, but you have to go into that deep place where you aren’t distracted by anything that is going on.”"}
{"game_id": "0022100975", "chunk_id": "0022100975_013", "order": 13, "role": "body", "text": "Added Durant: “Everything he does is so pure. It looked so easy tonight. I looked up and he had 10 points and it felt like he had taken two shots.”"}
{"game_id": "0022100975", "chunk_id": "0022100975_014", "order": 14, "role": "body", "text": "Andre Drummond dominated inside, finishing with 20 points and 14 rebounds for Brooklyn, which got back to .500 on the season and moved into sole possession of eighth place in the Eastern Conference standings, breaking a tie with the Hornets."}
{"game_id": "0022100975", "chunk_id": "0022100975_015", "order": 15, "role": "body", "text": "Miles Bridges and Terry Rozier each finished with 30 points for Charlotte, which had its two-game win streak snapped. LaMelo Ball added 24 points and seven assists for the Hornets."}
{"game_id": "0022100975", "chunk_id": "0022100975_016", "order": 16, "role": "body", "text": "The Nets bolted to a 69-43 lead behind Irving's 20 points in the first half. The Hornets didn't help themselves, repeatedly committing turnovers with lazy passes, including two by Ball on back-to-back possessions."}
{"game_id": "0022100975", "chunk_id": "0022100975_017", "order": 17, "role": "body", "text": "Brooklyn stretched its lead to 34 points in the second half before the Hornets trimmed it to 13 with less than four minutes left in the game. But Irving, as he'd done throughout the second half, thwarted the rally by knocking down a jumper."}
{"game_id": "0022100975", "chunk_id": "0022100975_018", "order": 18, "role": "body", "text": "“He’s incredible. He’s a career highlight reel every time, every night,” said Nets coach Steve Nash. “We obviously have a special player on our hands and tonight, he was unbelievably efficient and difficult to defend. ... Those were really big shots he made in the second half, but overall he’s just an incredible player, shot maker.”"}
{"game_id": "0022100975", "chunk_id": "0022100975_019", "order": 19, "role": "body", "text": "The Hornets used a number of players to defend Irving, but simply couldn't stop him."}
{"game_id": "0022100975", "chunk_id": "0022100975_020", "order": 20, "role": "body", "text": "“He made tough shots,\" Hornets coach James Borrego said. \"We double-teamed him, switched up our coverages and threw different looks at him, but we have to give him credit.”"}
{"game_id": "0022100975", "chunk_id": "0022100975_022", "order": 22, "role": "body", "text": "The Nets travel to Philadelphia to face former teammate James Harden and the 76ers on Thursday night in what should be an interesting, if not entertaining, night."}
{"game_id": "0022100975", "chunk_id": "0022100975_023", "order": 23, "role": "body", "text": "Irving said he harbors no ill feelings toward Harden, who sought to leave Brooklyn."}
{"game_id": "0022100975", "chunk_id": "0022100975_024", "order": 24, "role": "body", "text": "“It's fine,” Irving said. “It makes for good stories, it makes for good narratives and good build up for our league. It's never too personal, but we understand as competitors we want to win the game. ... But it's not about us and any individual matchups, it's about being a great team and building on what we set out to do.”"}
{"game_id": "0022100975", "chunk_id": "0022100975_026", "order": 26, "role": "body", "text": "Nets: Durant was assessed a technical foul in the third quarter for pushing Rozier while trying to free himself up for an inbounds pass. ... Curry picked up a technical for arguing a call."}
{"game_id": "0022100975", "chunk_id": "0022100975_027", "order": 27, "role": "body", "text": "Hornets: Jalen McDaniels, who had been out since Jan. 21 with an ankle injury, returned to action. He played nine minutes and had two points. ... Montrezl Harrell was assessed a technical foul when he shoved Nic Claxton."}
{"game_id": "0022100975", "chunk_id": "0022100975_029", "order": 29, "role": "body", "text": "Nets: At Philadelphia 76ers on Thursday night."}
{"game_id": "0022100975", "chunk_id": "0022100975_030", "order": 30, "role": "body", "text": "Hornets: Host Boston Celtics on Wednesday night."}
