{"game_id": "0022100879", "chunk_id": "0022100879_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Jusuf Nurkic had 32 points and eight rebounds, Anfernee Simons added 31 points and six assists and the Portland Trail Blazers overcame Ja Morant’s 44-point performance, beating the Memphis Grizzlies 123-119 on Wednesday night."}
{"game_id": "0022100879", "chunk_id": "0022100879_002", "order": 2, "role": "body", "text": "Josh Hart added 22 points, six assists and seven rebounds for the Trail Blazers, who won their fourth straight after leading most of the game and weathering a frantic finish."}
{"game_id": "0022100879", "chunk_id": "0022100879_003", "order": 3, "role": "body", "text": "“They made a heckuva run, as they should. They’re at home,” Portland coach Chauncey Billups said. “We can’t lose our composure. Keep playing the way that we play, and we did that.”"}
{"game_id": "0022100879", "chunk_id": "0022100879_004", "order": 4, "role": "body", "text": "Morant matched his career high in scoring as Memphis had its six-game winning streak halted. Desmond Bane scored 30 points and Brandon Clarke finished with 12."}
{"game_id": "0022100879", "chunk_id": "0022100879_005", "order": 5, "role": "body", "text": "The Grizzlies benefitted from a big scoring night from Morant and Bane, the team’s starting guard tandem. Their 74 points came on 20 of 39 shooting, Bane hit 7 of 12 from outside the arc, the seven made 3-pointers a career high. At times, the Trail Blazers tried to clog the middle to cut down on Morant’s paint points."}
{"game_id": "0022100879", "chunk_id": "0022100879_006", "order": 6, "role": "body", "text": "That opened the door for Bane."}
{"game_id": "0022100879", "chunk_id": "0022100879_007", "order": 7, "role": "body", "text": "“If you shift (defensively), you’re too late,” Morant said. “… Just reading (defenders). If they help, I already know I’ve got (Bane) on the wings to knock down the 3-ball. If they try to stay home, I’m in the paint.”"}
{"game_id": "0022100879", "chunk_id": "0022100879_008", "order": 8, "role": "body", "text": "Memphis had trouble generating offense through the first half and into the third quarter. The Grizzlies used an offensive burst and closed within a possession on a couple of occasions, but Portland maintained the lead it held since the opening minutes."}
{"game_id": "0022100879", "chunk_id": "0022100879_009", "order": 9, "role": "body", "text": "Memphis finally caught the Trail Blazers with just less than five minutes remaining in the fourth as Bane scored seven straight points."}
{"game_id": "0022100879", "chunk_id": "0022100879_010", "order": 10, "role": "body", "text": "The teams swapped the lead, with Nurkic keeping Portland in the game by scoring nine straight points. Simons followed with a 3-pointer from the right wing for a 122-117 lead with 44 seconds left, helping preserve the victory."}
{"game_id": "0022100879", "chunk_id": "0022100879_011", "order": 11, "role": "body", "text": "“I had the ball in the hands of the dude that we needed it to be in,” Billups said of Simons’ 3-pointer. “We got what we wanted.”"}
{"game_id": "0022100879", "chunk_id": "0022100879_012", "order": 12, "role": "body", "text": "He later added: “That was a big, big shot.”"}
{"game_id": "0022100879", "chunk_id": "0022100879_013", "order": 13, "role": "body", "text": "Portland, which is dealing with numerous injuries to Damian Lillard and forward Nassir Little, along with several trade-deadline acquisitions, are working with a pieced-together roster. In addition to the injuries, solid producers like Norman Powell, Robert Covington and CJ McCollum were sent elsewhere at the deadline."}
{"game_id": "0022100879", "chunk_id": "0022100879_014", "order": 14, "role": "body", "text": "The Trail Blazers have played well during their winning streak, including a double-digit win over the Milwaukee Bucks on Monday. They continued that trend in the first half."}
{"game_id": "0022100879", "chunk_id": "0022100879_015", "order": 15, "role": "body", "text": "Portland shot 60% until the late stages of the half, and Memphis seemed a step slower than it had during its recent winning streak. That translated into a 68-57 Portland lead at the break, despite Morant scoring 27 points."}
{"game_id": "0022100879", "chunk_id": "0022100879_016", "order": 16, "role": "body", "text": "“Giving up 68 points in the first half is not up to our standards,” Memphis coach Taylor Jenkins said. “… We threw a lot of different looks at them, and nothing really worked.”"}
{"game_id": "0022100879", "chunk_id": "0022100879_017", "order": 17, "role": "body", "text": "But the Trail Blazers still had to endure a Memphis rally at the end."}
{"game_id": "0022100879", "chunk_id": "0022100879_018", "order": 18, "role": "body", "text": "“I feel like people still try to overlook us,” Nurkic said. “I think we’re playing hard. That’s no doubt. Making shots obviously helps. But we play the right way. It gives us a chance to win. … Tonight, was a playoff-type of basketball.”"}
{"game_id": "0022100879", "chunk_id": "0022100879_020", "order": 20, "role": "body", "text": "Trail Blazers: Simons has recorded at least 29 points in each of his last three games. …. The four-game winning streak matches the longest of the season for Portland. It won four straight from Nov. 15-23. … Portland captured the season series 3-1 over Memphis."}
{"game_id": "0022100879", "chunk_id": "0022100879_021", "order": 21, "role": "body", "text": "Grizzlies: Morant, who missed Tuesday’s win at New Orleans with a sore ankle, returned to action and started. … Morant’s 20 first-quarter points marked a season-high for a Memphis player in a period. … Had scored at least 120 points during the six-game winning streak. … Memphis is now 24-3 when Clarke scores in double figures."}
{"game_id": "0022100879", "chunk_id": "0022100879_023", "order": 23, "role": "body", "text": "Morant finished the night 21 of 25 from the line, the 21 made free throws was a franchise record. Nurkic was amazed at the number. “I don’t know the last time I remember playing somebody that shoots 25 free throws,” Nurkic said, adding “I don’t remember Dame (Damian Lillard) shooting 25 free throws. … I wasn’t happy about it. It was amazing. At some point, he had more free throws than our whole team.”"}
{"game_id": "0022100879", "chunk_id": "0022100879_025", "order": 25, "role": "body", "text": "Trail Blazers: Host Golden State on Feb. 24 after the All-Star break."}
{"game_id": "0022100879", "chunk_id": "0022100879_026", "order": 26, "role": "body", "text": "Grizzlies: On All-Star break until Feb. 24 at Minnesota."}
