{"game_id": "0022100519", "chunk_id": "0022100519_001", "order": 1, "role": "lead", "text": "CHICAGO -- — Zach LaVine scored 25 points and the Chicago Bulls beat the Atlanta Hawks for the second time in three nights, 131-117 on Wednesday."}
{"game_id": "0022100519", "chunk_id": "0022100519_002", "order": 2, "role": "body", "text": "The Bulls extended their winning streak to a season-high five games. The Hawks, who are playing without 15 players due to the NBA’s health and safety protocols and injuries, lost for the fifth time in six games."}
{"game_id": "0022100519", "chunk_id": "0022100519_003", "order": 3, "role": "body", "text": "The Bulls shot 61.9% and had a season-high with 38 assists. They beat the Hawks 130-118 on Monday night in Atlanta."}
{"game_id": "0022100519", "chunk_id": "0022100519_004", "order": 4, "role": "body", "text": "Trey Young scored 26 points for Atlanta, and Clint Capela added 18 in the opener of a six-game trip."}
{"game_id": "0022100519", "chunk_id": "0022100519_005", "order": 5, "role": "body", "text": "“We got three-fourths of our team out,” Young said. “I came to shoot around not knowing most of my teammates.”"}
{"game_id": "0022100519", "chunk_id": "0022100519_006", "order": 6, "role": "body", "text": "LaVine punctuated his performance with a. 360 dunk that extended the Bulls’ lead to 119-96 with 6:44 left."}
{"game_id": "0022100519", "chunk_id": "0022100519_007", "order": 7, "role": "body", "text": "Nicola Vucevic had 16 points and a season-high 20 rebounds for Chicago. DeMar DeRozan scored 20 pointts, and guard Coby White had 17 points and 12 assists. Reserve guard Ayo Dosunmu converted 6 of 7 shots and finished with 14 points, as did Javonte Green."}
{"game_id": "0022100519", "chunk_id": "0022100519_008", "order": 8, "role": "body", "text": "“I think people realize how good (LaVine) is,” Bulls interim coach Chris Fleming said. “I think that secret is out. He’s been an All-Star and has played at an extremely high level.”"}
{"game_id": "0022100519", "chunk_id": "0022100519_009", "order": 9, "role": "body", "text": "The Bulls made 40 of 43 field goal attempts in the first half (69.8%), including 6 of 10 three-point attempts."}
{"game_id": "0022100519", "chunk_id": "0022100519_010", "order": 10, "role": "body", "text": "The Bulls had an 18-1 run to end the first half with a 74-53 lead. They were credited with 24 assists in the first half without point guard Lonzo Ball, who is in health and safety protocols."}
{"game_id": "0022100519", "chunk_id": "0022100519_012", "order": 12, "role": "body", "text": "Hawks: Chris Clemons and Cameron Oliver were signed to 10-day contracts. Wes Iwundu was activated from the NBA’s health and safety protocol. The Hawks have 12 players in protocols, which has caused coach Nate McMillan to play Young, Cam Reddish, Capela and Skylar Mays, a two-way guard, longer than he’d prefer. “We really don’t have subs for them,” McMillan said. “There are times we’re having to put four-five guys out there who don’t know our system. We’re giving them basic sets.”"}
{"game_id": "0022100519", "chunk_id": "0022100519_013", "order": 13, "role": "body", "text": "Bulls: Marko Simonovic entered the NBA’s health and safety protocols. Simonovic is the 17th Bulls player to enter the protocols this season. F Patrick Williams (ligament tear) had pins removed from his left wrist, but Fleming didn’t know how this would affect Williams’ rehab schedule. Williams was expected to miss the regular season. With coach Billy Donovan currently in health and safety protocols, Fleming said he expects to remain as interim coach through at least the next two games."}
{"game_id": "0022100519", "chunk_id": "0022100519_015", "order": 15, "role": "body", "text": "Hawks: At Cleveland on Friday night."}
