{"game_id": "0022100494", "chunk_id": "0022100494_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Kevin Love and Darius Garland scored 22 points apiece, and the Cleveland Cavaliers tied their franchise record with 46 points in the third quarter of a 144-99 rout over the COVID-19 depleted Toronto Raptors on Sunday night."}
{"game_id": "0022100494", "chunk_id": "0022100494_002", "order": 2, "role": "body", "text": "Lauri Markkanen added 20 points and Garland had eight assists for Cleveland, which led by 47 points twice late in the fourth. The Cavaliers won their fifth in a row at home and made 22 3-pointers in a team-record 52 attempts."}
{"game_id": "0022100494", "chunk_id": "0022100494_003", "order": 3, "role": "body", "text": "It was Cleveland’s largest victory margin of the season and the first time Toronto has lost by more than 17 points in 2021-22. The Cavaliers had 39 assists, two shy of the most in the NBA this season."}
{"game_id": "0022100494", "chunk_id": "0022100494_004", "order": 4, "role": "body", "text": "“We’re lucky to be in this position where we’ve got such a good thing going on,” Markkanen said. “We play hard and we play unselfish basketball. Once we brought the energy we needed, the floodgates just kind of opened up after that.”"}
{"game_id": "0022100494", "chunk_id": "0022100494_005", "order": 5, "role": "body", "text": "Yuta Watanabe posted career highs of 26 points and 13 rebounds for Toronto, and Chris Boucher scored 21 points. The Raptors have 10 players in the NBA’s health and safety protocols, including top scorer Fred VanVleet, rookie Scottie Barnes and Pascal Siakam."}
{"game_id": "0022100494", "chunk_id": "0022100494_006", "order": 6, "role": "body", "text": "“We had to take a pretty good loss tonight, but we’ll bounce back,” Raptors coach Nick Nurse said. “It was a good game for Yuta, and that’s about it.”"}
{"game_id": "0022100494", "chunk_id": "0022100494_007", "order": 7, "role": "body", "text": "Toronto’s eight-man active roster — featuring four hardship signees — had never been together until holding a brief practice on the main court at Rocket Mortgage FieldHouse before the game. D.J. Wilson had 15 points and eight rebounds in his team debut."}
{"game_id": "0022100494", "chunk_id": "0022100494_008", "order": 8, "role": "body", "text": "“We met those guys on the bus on the way to the arena,” Watanabe said. “Because we weren’t permitted to do anything together the last few days, I spent a lot of time in the gym by myself putting up shots. That’s all you could do.”"}
{"game_id": "0022100494", "chunk_id": "0022100494_009", "order": 9, "role": "body", "text": "The Raptors’ previous two games were postponed when they could not suit up the required eight players. Boucher, Watanabe, Svi Mykhailiuk and Dalano Banton were the only holdovers from their pre-outbreak squad."}
{"game_id": "0022100494", "chunk_id": "0022100494_010", "order": 10, "role": "body", "text": "Denzel Valentine had 17 points and nine rebounds, Dean Wade scored 17 points, and Ricky Rubio had 16 points and six assists for Cleveland. Love grabbed nine boards and Tacko Fall had three points and seven rebounds in 11 minutes off the bench."}
{"game_id": "0022100494", "chunk_id": "0022100494_011", "order": 11, "role": "body", "text": "“We’ve got a good thing going and I’m having a lot of fun,” Love said. “It’s going to be great watching this young team develop. We know we’re going to get everyone’s best shot at us going forward, so I hope 2022 is a year of growth.”"}
{"game_id": "0022100494", "chunk_id": "0022100494_012", "order": 12, "role": "body", "text": "Rookie Evan Mobley and center Jarrett Allen were among seven Cavaliers sidelined because of the safety protocols. Cleveland has the fifth-best record in the Eastern Conference at 20-13."}
{"game_id": "0022100494", "chunk_id": "0022100494_013", "order": 13, "role": "body", "text": "“The Raptors came out and played hard, but as the game went on, we were more physical and that obviously took a toll on them,” Cavaliers coach J.B. Bickerstaff said."}
{"game_id": "0022100494", "chunk_id": "0022100494_015", "order": 15, "role": "body", "text": "Raptors: G Gary Trent Jr., F Precious Achiuwa, F OG Anunoby, C Khem Birch, F Isaac Bonga, F Justin Champagnie and G Malachi Flynn also are in the health and safety protocols. … G Goran Dragic (personal reasons) and G David Johnson (left calf strain) were officially active, but unavailable. … F D.J. Wilson, F Juwan Morgan, C Daniel Oturu and G Tremont Waters are on 10-day contracts via roster exceptions."}
{"game_id": "0022100494", "chunk_id": "0022100494_016", "order": 16, "role": "body", "text": "Cavaliers: G Isaac Okoro missed his third straight game as he works on his conditioning after being cleared from the safety protocols. … F Cedi Osman was added to the protocols earlier in the day, joining C Ed Davis, G RJ Nembhard, G Lamar Stevens and F Dylan Windler. … Cleveland leads the East and ranks third in the NBA with 15 double-digit victories. The Cavaliers’ last 11 wins have been by at least 10 points."}
{"game_id": "0022100494", "chunk_id": "0022100494_018", "order": 18, "role": "body", "text": "Bickerstaff, who was promoted to the job on Feb. 19, 2020, signed a multi-year contract extension on Saturday morning. The son of longtime NBA coach and current Cleveland senior advisor Bernie Bickerstaff took over a team in disarray following the resignation of John Beilein. “If you look at our roster, we’ve got guys locked in here for a long time,” said Bickerstaff, who is 47-69 with the Cavaliers. “Now, with this coaching staff, we’re locked in for a long time, too.”"}
{"game_id": "0022100494", "chunk_id": "0022100494_020", "order": 20, "role": "body", "text": "Raptors: Host Philadelphia on Tuesday night."}
{"game_id": "0022100494", "chunk_id": "0022100494_021", "order": 21, "role": "body", "text": "Cavaliers: Visit New Orleans on Tuesday night."}
