{"game_id": "0022100710", "chunk_id": "0022100710_001", "order": 1, "role": "lead", "text": "ATLANTA -- — The sense of urgency may be similar, but the stakes are different for Chicago and Atlanta on opposite ends of the Eastern Conference playoff standings."}
{"game_id": "0022100710", "chunk_id": "0022100710_002", "order": 2, "role": "body", "text": "For the Hawks, who are struggling for any spot in the playoffs, a win over the upper-tier Bulls was especially important."}
{"game_id": "0022100710", "chunk_id": "0022100710_003", "order": 3, "role": "body", "text": "Bogdan Bogdanovic's 3-pointer with 1:41 left gave Atlanta the lead and Trae Young scored 39 points in the Hawks' 130-124 victory over the Bulls on Thursday night."}
{"game_id": "0022100710", "chunk_id": "0022100710_004", "order": 4, "role": "body", "text": "The Hawks began the night 10th in the conference, fighting to keep the last spot in the play-in tournament while still hoping to move higher in the final 20 games of the regular season."}
{"game_id": "0022100710", "chunk_id": "0022100710_005", "order": 5, "role": "body", "text": "“Yeah, the pressure has been on for us to keep going and figure this out as fast as possible and get some wins,” Young said. “We don’t have many left in the regular season. We have to win as many as possible. ... Of course, beating a team like them, with how high their seed is, is big.”"}
{"game_id": "0022100710", "chunk_id": "0022100710_006", "order": 6, "role": "body", "text": "Young made seven 3-pointers, including two  after Bogdanovic's go-ahead 3, to seal the win."}
{"game_id": "0022100710", "chunk_id": "0022100710_007", "order": 7, "role": "body", "text": "Chicago suffered its third consecutive loss and fell percentage points behind Philadelphia in the battle for second place in the East, each 2 1/2 games behind Miami."}
{"game_id": "0022100710", "chunk_id": "0022100710_008", "order": 8, "role": "body", "text": "“We’ve got to have way, way better habits against elite teams,” Chicago coach Billy Donovan said. “I think we’re learning the tough way all these little lessons, so to speak. ... There was just a lot, a lot of breakdowns. We fouled entirely too much.\""}
{"game_id": "0022100710", "chunk_id": "0022100710_009", "order": 9, "role": "body", "text": "Hawks coach Nate McMillan said he urged his players before the game to prevent the Bulls’ bid to complete a four-game sweep of the season series."}
{"game_id": "0022100710", "chunk_id": "0022100710_010", "order": 10, "role": "body", "text": "“I thought our guys responded in the third and fourth quarter with urgency,” McMillan said."}
{"game_id": "0022100710", "chunk_id": "0022100710_011", "order": 11, "role": "body", "text": "After Bogdanovic's 3 made it 119-118, Chicago's DeMar DeRozan's had a turnover, and Young padded the advantage with two 3s in the final 1:12."}
{"game_id": "0022100710", "chunk_id": "0022100710_012", "order": 12, "role": "body", "text": "Young had 13 assists and made 7 of 10 3s and all 10 of his free throws. Bogdanovic had 20 points."}
{"game_id": "0022100710", "chunk_id": "0022100710_013", "order": 13, "role": "body", "text": "DeRozan and Zach LaVine each had 22 points for the Bulls. Nikola Vucevic had 21 points and 11 rebounds."}
{"game_id": "0022100710", "chunk_id": "0022100710_014", "order": 14, "role": "body", "text": "LaVine blocked Young's last jumper of the first half, leaving the Bulls with a 63-56 halftime lead."}
{"game_id": "0022100710", "chunk_id": "0022100710_015", "order": 15, "role": "body", "text": "When LaVine opened the second half with a 3-pointer for a 66-56 lead, the Bulls were 10 of 19 and on pace to match their season high of 18 3s. They made only four 3s the remainder of the game, finishing 14 of 26."}
{"game_id": "0022100710", "chunk_id": "0022100710_016", "order": 16, "role": "body", "text": "The Hawks surged as they began outworking the Bulls under the basket. DeAndre Hunter, who had 18 points, grabbed a rebound of his own miss and scored for a 72-70 Atlanta lead."}
{"game_id": "0022100710", "chunk_id": "0022100710_018", "order": 18, "role": "body", "text": "Bulls: Vucevic had been 0 for 10 on 3-pointers in his last three games before making his first long-range attempt of the game in the second period. ... Donovan said he expects LaVine to be available for the second of back-to-back games against Milwaukee on Friday night. LaVine has been slowed by periodic soreness in his surgically repaired left knee. Donovan said before the game LaVine “feels really good” before adding “That's today. ... No question, after tonight, tomorrow check with him. I would say it's more likely he'll be playing.”"}
{"game_id": "0022100710", "chunk_id": "0022100710_019", "order": 19, "role": "body", "text": "Hawks: F John Collins (right foot strain) missed his sixth consecutive game and may be moving closer to a return. “He is getting better,” McMillan said. ... C Onyeka Okongwu (concussion protocol) did not play. ... Gorgui Dieng moved into a more prominent role behind C Clint Capela and F Danilo Gallinari. ... Young (left ankle sprain) and G Lou Williams (left hip discomfort) were cleared after pregame warmups."}
{"game_id": "0022100710", "chunk_id": "0022100710_021", "order": 21, "role": "body", "text": "The Hawks made 24 of 28 free throws. The Bulls made six of seven. Donovan said he couldn't complain."}
{"game_id": "0022100710", "chunk_id": "0022100710_022", "order": 22, "role": "body", "text": "“Generally when you see a discrepancy like that, coaches complain,” Donovan said. “We fouled. We fouled.”"}
{"game_id": "0022100710", "chunk_id": "0022100710_024", "order": 24, "role": "body", "text": "The Hawks were motivated by their 112-108 loss at Chicago on Feb. 24, when Young made 3 of 17 shots from the field and scored only 14 points."}
{"game_id": "0022100710", "chunk_id": "0022100710_025", "order": 25, "role": "body", "text": "“I owed them one,” Young said."}
{"game_id": "0022100710", "chunk_id": "0022100710_026", "order": 26, "role": "body", "text": "This time, Young made 11 of 18 shots."}
{"game_id": "0022100710", "chunk_id": "0022100710_028", "order": 28, "role": "body", "text": "Bulls: Host Milwaukee on Friday night"}
{"game_id": "0022100710", "chunk_id": "0022100710_029", "order": 29, "role": "body", "text": "Hawks: At Washington on Friday night."}
