{"game_id": "0022100522", "chunk_id": "0022100522_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Devin Booker joined some heady company Wednesday night."}
{"game_id": "0022100522", "chunk_id": "0022100522_002", "order": 2, "role": "body", "text": "The Phoenix guard scored 38 points, surpassing 10,000 for his career, and the Suns beat the Oklahoma City Thunder 115-97 to end a two-game losing streak and tie for the NBA lead."}
{"game_id": "0022100522", "chunk_id": "0022100522_003", "order": 3, "role": "body", "text": "Booker was 12 of 24 from the floor, going 6 of 12 from 3-point range. He also had seven rebounds, five assists and two blocks."}
{"game_id": "0022100522", "chunk_id": "0022100522_004", "order": 4, "role": "body", "text": "Booker — at 25 years, 60 days — became the seventh-youngest NBA player to reach 10,000 points. The others are LeBron James, Kevin Durant, Kobe Bryant, Carmelo Anthony, Tracy McGrady and Giannis Antetokounmpo."}
{"game_id": "0022100522", "chunk_id": "0022100522_005", "order": 5, "role": "body", "text": "“It means a lot,” Booker said. “Truly grateful to be in this position. I have a lot of praise for my coaches for trusting a young kid and letting me play through mistakes because everybody doesn't get that opportunity.”"}
{"game_id": "0022100522", "chunk_id": "0022100522_006", "order": 6, "role": "body", "text": "The Suns rebounded from home losses to Golden State and Memphis to pull even with the Warriors atop the league standings at 27-7."}
{"game_id": "0022100522", "chunk_id": "0022100522_007", "order": 7, "role": "body", "text": "Both teams were without several key players and their head coaches. Suns starters Deandre Ayton and Jae Crowder and coach Monty Williams each missed their second straight game."}
{"game_id": "0022100522", "chunk_id": "0022100522_008", "order": 8, "role": "body", "text": "The Thunder played without guard Shai Gilgeous-Alexander (right ankle soreness) and fellow starters Jeremiah Robinson-Earl and Josh Giddey, who were already on the health and safety protocols list. Coach Mark Daigneault missed his second straight game."}
{"game_id": "0022100522", "chunk_id": "0022100522_009", "order": 9, "role": "body", "text": "Oklahoma City trailed by 10 points after the first quarter but came back to take the lead in the third quarter. The Suns outscored the Thunder 30-16 in the final period, with Booker leading the way with nine points."}
{"game_id": "0022100522", "chunk_id": "0022100522_010", "order": 10, "role": "body", "text": "“We kind of knew it was going to be like that against a hungry team with guys who were excited to have an opportunity,” said acting Suns coach Kevin Young, filling in for Williams."}
{"game_id": "0022100522", "chunk_id": "0022100522_011", "order": 11, "role": "body", "text": "“The thing you love about Book is he's a fierce competitor and he's fearless,” Young said. “He made some huge shots tonight and to get that milestone, that's just what he does.”"}
{"game_id": "0022100522", "chunk_id": "0022100522_012", "order": 12, "role": "body", "text": "Ty Jerome, filling Gilgeous-Alexander's spot, scored a career-high 24 points for the Thunder, who lost at Sacramento on Tuesday. Aaron Wiggins had 22 points and a team-high eight rebounds."}
{"game_id": "0022100522", "chunk_id": "0022100522_013", "order": 13, "role": "body", "text": "“I was really proud of our guys,” acting Thunder coach Mike Wilks said. “Five, six minutes left, and it was a two-possession game. We made it a game which is hard to do against a high-level team on the road.”"}
{"game_id": "0022100522", "chunk_id": "0022100522_014", "order": 14, "role": "body", "text": "“(Jerome) was huge,” Wiggins said. “His leadership was definitely a huge factor in us being able to compete.”"}
{"game_id": "0022100522", "chunk_id": "0022100522_015", "order": 15, "role": "body", "text": "Oklahoma City was 7 of 35 (20%) from 3-point range. Guards Jerome and Luguentz Dort were a combined 1 for 13 from long distance."}
{"game_id": "0022100522", "chunk_id": "0022100522_016", "order": 16, "role": "body", "text": "“We felt we had some good looks tonight, quality looks,” Wilks said. “We just didn't get them to go down.”"}
{"game_id": "0022100522", "chunk_id": "0022100522_017", "order": 17, "role": "body", "text": "For the Suns, JaVale McGee and Cameron Payne each scored 16 points, with McGee adding eight rebounds and Payne a team-high seven assists. Cam Johnson finished with 12 points, and Jalen Smith had 11 points and a career-high 14 rebounds."}
{"game_id": "0022100522", "chunk_id": "0022100522_018", "order": 18, "role": "body", "text": "“We’re figuring things out, but we didn’t want to lose three in a row, especially after the last one (last-second loss to Memphis), that was tough on us,” Booker said. “We just have to move this train on.”"}
{"game_id": "0022100522", "chunk_id": "0022100522_020", "order": 20, "role": "body", "text": "Since the Thunder played in Phoenix last Thursday night, they have had five players placed on the health and safety protocols list. That game was a 113-101 Suns victory."}
{"game_id": "0022100522", "chunk_id": "0022100522_021", "order": 21, "role": "body", "text": "Also sidelined on the Thunder’s COVID-19 list are forwards Darius Bazley, and Alexsej Pokusevski and guard Tre Mann. Those players scored 69 of the Thunder’s 101 points last week."}
{"game_id": "0022100522", "chunk_id": "0022100522_022", "order": 22, "role": "body", "text": "Center Isaiah Roby, forward Paul Watson Jr. and Jerome, none of whom played six days ago, start in place of the sidelined trio. Derrick Favors, who was rested last Thursday, played in Wednesday’s game. Watson had 11 points and Roby 10 before he fouled out."}
{"game_id": "0022100522", "chunk_id": "0022100522_024", "order": 24, "role": "body", "text": "Wilks, who played briefly for the Thunder before becoming an assistant, grew close to Chris Paul when the Phoenix point guard was with Oklahoma City two seasons ago."}
{"game_id": "0022100522", "chunk_id": "0022100522_025", "order": 25, "role": "body", "text": "“Chris is a great guy,” Wilks said before the game. “I see how he is with his family, in his community. The time I got to spend with him was invaluable. We check in on one another. He’s one of my favorites and one of the best point guards to ever do it."}
{"game_id": "0022100522", "chunk_id": "0022100522_027", "order": 27, "role": "body", "text": "Thunder: Giddey was named Western Conference Rookie of the Month for games in October/November. He started 20 games and averaged 10.4 points, 5.8 assists and 7.2 rebounds."}
{"game_id": "0022100522", "chunk_id": "0022100522_028", "order": 28, "role": "body", "text": "Suns: Their 27-7 start is the second best in franchise history through 34 games. The 2004-05 team started 30-4."}
{"game_id": "0022100522", "chunk_id": "0022100522_030", "order": 30, "role": "body", "text": "Thunder: Host New York on Friday night."}
{"game_id": "0022100522", "chunk_id": "0022100522_031", "order": 31, "role": "closing", "text": "Suns: play at Boston on Friday."}
