{"game_id": "0022100302", "chunk_id": "0022100302_001", "order": 1, "role": "lead", "text": "TORONTO -- — Marcus Smart scored 21 points, Al Horford had 17 points and 11 rebounds and the Boston Celtics beat the short-handed Toronto Raptors 109-97 on Sunday night to snap a two-game losing streak."}
{"game_id": "0022100302", "chunk_id": "0022100302_002", "order": 2, "role": "body", "text": "Josh Richardson scored 18 of Boston’s 32 bench points. Jaylen Brown added 16 points, and Grant Williams had 15 to help the Celtics improve to 11-10."}
{"game_id": "0022100302", "chunk_id": "0022100302_003", "order": 3, "role": "body", "text": "Jayson Tatum shot 2 for 16 and scored eight points, but added seven rebounds and a season-high 10 assists."}
{"game_id": "0022100302", "chunk_id": "0022100302_004", "order": 4, "role": "body", "text": "“He didn’t have the greatest shooting night, obviously, but 10 assists, we’ll take that every time,” Celtics coach Ime Udoka said."}
{"game_id": "0022100302", "chunk_id": "0022100302_005", "order": 5, "role": "body", "text": "Boston bounced back after losing at San Antonio on Friday night, when it allowed the Spurs to score the final 15 points."}
{"game_id": "0022100302", "chunk_id": "0022100302_006", "order": 6, "role": "body", "text": "“The way we lost that game was definitely tough,” Smart said. “To be able to come back and respond the way we did just shows growth. I know we get up here and say that a lot, but it’s true.”"}
{"game_id": "0022100302", "chunk_id": "0022100302_007", "order": 7, "role": "body", "text": "Fred VanVleet led Toronto with 27 points, Scottie Barnes had 21, Pascal Siakam 18 and Svi Mykhailiuk 12. The Raptors lost for the sixth time in eight games to fall to 9-12."}
{"game_id": "0022100302", "chunk_id": "0022100302_008", "order": 8, "role": "body", "text": "Already without forwards OG Anunoby (left hip) and Khem Birch (right knee), who each sat for the sixth straight game, Toronto was also without guards Gary Trent Jr. (bruised right calf) and Goran Dragic. The Raptors released a statement Sunday afternoon saying Dragic had been granted leave to deal with a personal matter, with no definite timeline for his return."}
{"game_id": "0022100302", "chunk_id": "0022100302_009", "order": 9, "role": "body", "text": "VanVleet credited the remaining Raptors for trying to overcome the absences, even if the result didn’t go their way."}
{"game_id": "0022100302", "chunk_id": "0022100302_010", "order": 10, "role": "body", "text": "“I thought guys played with intensity for the most part, but not enough to get the win,” VanVleet said."}
{"game_id": "0022100302", "chunk_id": "0022100302_011", "order": 11, "role": "body", "text": "Boston was without guard Dennis Schroder. He sat because of a sprained right ankle."}
{"game_id": "0022100302", "chunk_id": "0022100302_012", "order": 12, "role": "body", "text": "With Schroder sidelined, Udoka said Richardson’s performance was all the more meaningful."}
{"game_id": "0022100302", "chunk_id": "0022100302_013", "order": 13, "role": "body", "text": "“To get 27 minutes and 18 points of production from him is huge, obviously, especially with Dennis being out,” Udoka said."}
{"game_id": "0022100302", "chunk_id": "0022100302_014", "order": 14, "role": "body", "text": "Richardson had missed the previous three games because of flu-like symptoms."}
{"game_id": "0022100302", "chunk_id": "0022100302_015", "order": 15, "role": "body", "text": "“I was itching to be back,” he said."}
{"game_id": "0022100302", "chunk_id": "0022100302_016", "order": 16, "role": "body", "text": "The Raptors were called for 24 fouls, compared to 19 for Boston."}
{"game_id": "0022100302", "chunk_id": "0022100302_017", "order": 17, "role": "body", "text": "“They made some plays and we didn’t quite make the defensive plays, but I’m pretty proud of the effort,” Toronto coach Nick Nurse said."}
{"game_id": "0022100302", "chunk_id": "0022100302_019", "order": 19, "role": "body", "text": "Celtics: Made 19 straight free throws to begin the game before Tatum missed with just over a minute left in the second quarter. Boston finished 29 for 31 at the line."}
{"game_id": "0022100302", "chunk_id": "0022100302_020", "order": 20, "role": "body", "text": "Raptors: Mykhailiuk started for Trent. … Acquired from Miami in the trade that sent Kyle Lowry to the Heat, Dragic is averaging 8.0 points and 1.8 assists in five games with Toronto. He’s played just once since Oct. 25. … After making five 3-pointers in his first 20 games, Barnes had four against Boston, including three in the third quarter."}
{"game_id": "0022100302", "chunk_id": "0022100302_022", "order": 22, "role": "body", "text": "Toronto began a seven-game homestand and, including Sunday’s game, will close out 2021 by playing 12 of 15 at home."}
{"game_id": "0022100302", "chunk_id": "0022100302_024", "order": 24, "role": "body", "text": "Enes Kanter, who announced earlier Sunday that he will change his name to Enes Kanter Freedom when he becomes a U.S. citizen Monday, played under his birth name for the final time."}
{"game_id": "0022100302", "chunk_id": "0022100302_026", "order": 26, "role": "body", "text": "Celtics: Host Philadelphia on Wednesday night."}
{"game_id": "0022100302", "chunk_id": "0022100302_027", "order": 27, "role": "body", "text": "Raptors: Host Memphis on Tuesday night."}
