{"game_id": "0022100646", "chunk_id": "0022100646_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — Darius Garland had 27 points and a career-high 18 assists and the Cleveland Cavaliers overcame an 18-point deficit to beat the Oklahoma City Thunder 107-102 on Saturday night for their fourth straight victory."}
{"game_id": "0022100646", "chunk_id": "0022100646_002", "order": 2, "role": "body", "text": "Lauri Markkanen made a 3-pointer with 11.4 seconds remaining to secure the victory, Cleveland’s fifth on a six-game, nine-day trip."}
{"game_id": "0022100646", "chunk_id": "0022100646_003", "order": 3, "role": "body", "text": "Garland tied Phoenix’s Chris Paul for the most assists in a game this season on Markkanen’s game-sealing triple."}
{"game_id": "0022100646", "chunk_id": "0022100646_004", "order": 4, "role": "body", "text": "“He took command of the game in all aspects,” Cleveland coach J.B. Bickerstaff said of Garland. “Reading what the defense was doing, how to make them pay for when they were making those mistakes or whatever the reason may have been. But you saw a will in him to not allow us to lose this game.”"}
{"game_id": "0022100646", "chunk_id": "0022100646_005", "order": 5, "role": "body", "text": "Evan Mobley added 20 points, and Jarrett Allen had 13 points and 13 rebounds."}
{"game_id": "0022100646", "chunk_id": "0022100646_006", "order": 6, "role": "body", "text": "Shai Gilgeous-Alexander led the Thunder with 21 points and seven assists. They have lost six of seven."}
{"game_id": "0022100646", "chunk_id": "0022100646_007", "order": 7, "role": "body", "text": "“I didn’t think we offensively had the sense of purpose that we had in the first half or the sense of purpose that we’ve had the last few games,” Oklahoma City coach Mark Daigneault said. “I thought we really drifted from that in the second half and it caught us. But credit to them. They were poised on the road. They hung in there. They were down significantly in the game and came back and won. They deserved to win.”"}
{"game_id": "0022100646", "chunk_id": "0022100646_008", "order": 8, "role": "body", "text": "Oklahoma City controlled the first half, shooting 49% from the floor to Cleveland’s 38%, in its first game since scoring a season-best 130 points in a victory over the Brooklyn Nets on Thursday night."}
{"game_id": "0022100646", "chunk_id": "0022100646_009", "order": 9, "role": "body", "text": "The Thunder built a 56-46 by halftime, extending that advantage to 74-56 through the first four minutes of the second half."}
{"game_id": "0022100646", "chunk_id": "0022100646_010", "order": 10, "role": "body", "text": "The Cavaliers chipped away at the margin, closing within single digits by the end of the period, taking their first lead with 11:07 remaining in the fourth and didn’t trail the rest of the way."}
{"game_id": "0022100646", "chunk_id": "0022100646_011", "order": 11, "role": "body", "text": "“Tonight was another example of showing that grit and that toughness to bear down and go get a job done,” Bickerstaff said. “This is a great environment to play in. The fans are yelling and screaming and on your back. And for us to not get rattled, not to give in. That was a great sign for us.”"}
{"game_id": "0022100646", "chunk_id": "0022100646_013", "order": 13, "role": "body", "text": "Cavaliers: Garland became the Cavaliers’ sixth player in franchise history to record 25 points and 15 assists in a game, joining LeBron James, Andre Miller, Terrell Brandon, John Johnson and Bobby Washington. … Kevin Love made three 3-pointers. He finished with 13 points."}
{"game_id": "0022100646", "chunk_id": "0022100646_014", "order": 14, "role": "body", "text": "Thunder: Kenrich Williams (health and safety protocol) remained out for Oklahoma City, while Isaiah Roby (health and safety protocols) returned to the lineup. … Jeremiah Robinson-Earl posted a team-high 11 rebounds, just three short of the rookie’s career single-game best."}
{"game_id": "0022100646", "chunk_id": "0022100646_016", "order": 16, "role": "body", "text": "Cavaliers: Host Brooklyn on Monday."}
{"game_id": "0022100646", "chunk_id": "0022100646_017", "order": 17, "role": "closing", "text": "Thunder: At Dallas on Monday night."}
