{"game_id": "0022100736", "chunk_id": "0022100736_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Franz Wagner scored 24 points and outplayed fellow rookie Cade Cunningham, Terrence Ross added 21 points and the Orlando Magic beat the Detroit Pistons 119-103 in a matchup of the NBA’s worst teams on Friday night."}
{"game_id": "0022100736", "chunk_id": "0022100736_002", "order": 2, "role": "body", "text": "Wagner, second only to Cunningham in scoring among rookies, made 7 of 12 shots, hit all eight of his free throws and scored 13 points in the first quarter. Mo Bamba had 18 points and 10 rebounds, and Chuma Okeke added 17 points and three 3-pointers."}
{"game_id": "0022100736", "chunk_id": "0022100736_003", "order": 3, "role": "body", "text": "“I was just trying to be aggressive. I felt good and I got the line a couple of times, which always helps get your rhythm,” said Wagner, who was picked eighth in last summer's draft. “I was able to get to the basket a couple times and I just tried to make the easy plays.”"}
{"game_id": "0022100736", "chunk_id": "0022100736_004", "order": 4, "role": "body", "text": "Orlando won at home for the second time in three games and the fourth time this season. The Magic had lost to the Pistons twice in Detroit and improved to 10-40, two games behind the Pistons in the standings. Only three of Orlando’s wins have been by double digits."}
{"game_id": "0022100736", "chunk_id": "0022100736_005", "order": 5, "role": "body", "text": "Cunningham, the top overall draft pick, missed his first 11 shots and finished with eight points on 3-of-17 shooting. Cunningham was coming off a career-best 34-point effort in Tuesday’s loss to Denver, but he struggled from the start with Orlando rookie Jalen Suggs guarding him. Cunningham has made just 7 of 39 shots in three games against the Magic, missing all 15 of his 3-point attempts."}
{"game_id": "0022100736", "chunk_id": "0022100736_006", "order": 6, "role": "body", "text": "“That’s this league. There are great players and great athletes in this league and I thought Orlando did a good job of preparing for him,” Detroit coach Dwane Casey said. “We felt like we prepared for what they were about to do, but we tip our hats to the Orlando Magic tonight.”"}
{"game_id": "0022100736", "chunk_id": "0022100736_007", "order": 7, "role": "body", "text": "Trey Lyles scored 18 points and Saddiq Bey added 17 for Detroit, which has lost four straight. The Pistons dropped to 4-22 on the road."}
{"game_id": "0022100736", "chunk_id": "0022100736_008", "order": 8, "role": "body", "text": "Ross opened the fourth quarter with three straight 3-pointers to push Orlando’s lead to 24 points."}
{"game_id": "0022100736", "chunk_id": "0022100736_009", "order": 9, "role": "body", "text": "Orlando made 15 of its first 22 shots and built a lead as large as 22 points in the first quarter. Detroit cut that deficit to seven in the second period, but Orlando pushed its lead back to 67-51 by halftime."}
{"game_id": "0022100736", "chunk_id": "0022100736_010", "order": 10, "role": "body", "text": "“The start of the first quarter, you spot a team 20 points, but we just didn't come out ready to approach their physicality,” Casey said. “They did an excellent job of getting into us.”"}
{"game_id": "0022100736", "chunk_id": "0022100736_011", "order": 11, "role": "body", "text": "Suggs had six points, four assists, two steals and a block to deny a dunk while playing physical defense on Cunningham."}
{"game_id": "0022100736", "chunk_id": "0022100736_012", "order": 12, "role": "body", "text": "“I think he did a great job and he was willing and wanting to take on that challenge,” Magic coach Jamahl Mosley said. “He did a great job of getting into the ball and having active hands early.”"}
{"game_id": "0022100736", "chunk_id": "0022100736_013", "order": 13, "role": "body", "text": "The Magic are 2-2 on their season-long five-game homestand."}
{"game_id": "0022100736", "chunk_id": "0022100736_014", "order": 14, "role": "body", "text": "“The most important thing is that we take a step in the right direction, and today was one of those days,” Wagner said."}
{"game_id": "0022100736", "chunk_id": "0022100736_016", "order": 16, "role": "body", "text": "Pistons: Cunningham missed his first 11 shots and three 3-point tries. He asked the referee for the ball during a second-quarter timeout so he could shoot a 3-foot jumper. His first points came with 1:51 left in the first half on two free throws. ... Casey said Jerami Grant continues to work his way back from time in the NBA’s health and safety protocols. Grant remained in Michigan to work with Pistons development coach John Beilein."}
{"game_id": "0022100736", "chunk_id": "0022100736_017", "order": 17, "role": "body", "text": "Magic: Anthony was fined $25,000 on Friday for derogatory remarks toward officials at the end of Orlando’s 111-102 loss to the Los Angeles Clippers on Wednesday. Anthony had 12 points, nine assists and six rebounds on Friday. … Bamba continues to play through a sprained ankle suffered in practice this week."}
{"game_id": "0022100736", "chunk_id": "0022100736_019", "order": 19, "role": "body", "text": "Pistons: Host Cleveland on Sunday night."}
{"game_id": "0022100736", "chunk_id": "0022100736_020", "order": 20, "role": "body", "text": "Magic: Host Dallas on Sunday night."}
