{"game_id": "0022100196", "chunk_id": "0022100196_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — Kevin Durant made himself at home again in Oklahoma City."}
{"game_id": "0022100196", "chunk_id": "0022100196_002", "order": 2, "role": "body", "text": "The former Thunder star scored 33 points to help the Brooklyn Nets beat Oklahoma City 120-96 on Sunday night."}
{"game_id": "0022100196", "chunk_id": "0022100196_003", "order": 3, "role": "body", "text": "Durant played eight seasons for the Thunder, winning four scoring titles and an MVP award before joining Golden State in 2016. Oklahoma City fans still haven't forgiven him for leaving in free agency. He was booed during pregame warmups and whenever he touched the ball early in the game."}
{"game_id": "0022100196", "chunk_id": "0022100196_004", "order": 4, "role": "body", "text": "It didn't affect him — the league's scoring leader made 9 of 17 field goals and had eight rebounds. He helped Brooklyn take the energy out of a crowd that was spirited early on."}
{"game_id": "0022100196", "chunk_id": "0022100196_006", "order": 6, "role": "body", "text": "“You think about the foundation and how you built yourself up as a pro, and this is definitely the spot for me,\" he said. “It taught me all about what it means to be a pro. The people here and the organization really guided me as a young player. That set the foundation for where I am today. There are a lot of great memories coming back, seeing a lot of people. It’s good to see folks here and play in front of the crowd … I had a good time.”"}
{"game_id": "0022100196", "chunk_id": "0022100196_007", "order": 7, "role": "body", "text": "James Harden added 16 points and 13 assists for the Nets. Harden started his career with the Thunder before he was traded to Houston. Harden and Durant were on the Oklahoma City team that reached the 2012 NBA Finals. It was the first time they played together against the Thunder."}
{"game_id": "0022100196", "chunk_id": "0022100196_008", "order": 8, "role": "body", "text": "“It’s crazy how stuff happens,\" Durant said. “You never thought when James got traded — I didn’t know what the future would hold. For us to come back around on the same team as we got older is pretty sweet ... We helped build this thing. It’s good to come in here and see what it is today.”"}
{"game_id": "0022100196", "chunk_id": "0022100196_009", "order": 9, "role": "body", "text": "Patty Mills scored 29 points and made a career-high nine 3-pointers for the Nets. They have won eight of nine, including five of six on their trip."}
{"game_id": "0022100196", "chunk_id": "0022100196_010", "order": 10, "role": "body", "text": "Shai Gilgeous-Alexander scored 23 points for the Thunder, and Lu Dort added 20. Oklahoma City had had won four straight."}
{"game_id": "0022100196", "chunk_id": "0022100196_011", "order": 11, "role": "body", "text": "The Nets led 61-48 at halftime behind 18 points from Durant. Oklahoma City cut it to eight on a 3-pointer by Gilgeous-Alexander in the third quarter, but the Nets pushed it to 90-74 by the end of the period."}
{"game_id": "0022100196", "chunk_id": "0022100196_012", "order": 12, "role": "body", "text": "Oklahoma City had overcome deficits of 16 or more points in four of their five wins this season, but the experienced Nets never allowed the Thunder to put anything significant together late."}
{"game_id": "0022100196", "chunk_id": "0022100196_013", "order": 13, "role": "body", "text": "“This team’s been so good at competing and responding, and we just couldn’t get the fire lit tonight,” Thunder coach Mark Daigneault said."}
{"game_id": "0022100196", "chunk_id": "0022100196_014", "order": 14, "role": "body", "text": "Now, Durant has to prepare for his other former team. The Nets host the Golden State Warriors on Tuesday. Durant won two NBA titles with the Warriors and was Finals MVP both times."}
{"game_id": "0022100196", "chunk_id": "0022100196_015", "order": 15, "role": "body", "text": "Durant said it's just another game."}
{"game_id": "0022100196", "chunk_id": "0022100196_016", "order": 16, "role": "body", "text": "“Obviously, they’re the best team in the league and they’re playing at an elite level,\" he said. “But it’s a regular-season game. We obviously want to go out there and win in front of our home crowd, but we’re not going to put too much pressure on ourselves and call this a Finals (matchup) — we ain’t even looking at it like that. It’s another opportunity for us to build up who we are, figure out what we want to do out there and keep pushing.”"}
{"game_id": "0022100196", "chunk_id": "0022100196_018", "order": 18, "role": "body", "text": "Nets: Mills' bank shot as time expired in the first quarter gave the Nets a 30-25 lead. ... Shot 55% in the first quarter and 50% in the game. ... Paul Millsap missed the game for personal reasons. ... LaMarcus Aldridge had 15 points and eight rebounds."}
{"game_id": "0022100196", "chunk_id": "0022100196_019", "order": 19, "role": "body", "text": "Thunder: Mike Muscala, one of the Thunder's top sparks off the bench this season, rested. ... Rookie Aaron Wiggins made his Thunder debut. He had three points, four rebounds and four assists in 21 minutes. ... Dort picked up four fouls in the first half and finished with five."}
{"game_id": "0022100196", "chunk_id": "0022100196_021", "order": 21, "role": "body", "text": "Mills made nine 3-pointers on 12 attempts. His previous career high was eight threes. He’s in his 13th season, yet he had only made more than six threes five times in his career. His 29 points tied for his fourth-best scoring total."}
{"game_id": "0022100196", "chunk_id": "0022100196_022", "order": 22, "role": "body", "text": "“He was aggressive,” Nets coach Steve Nash said. “Obviously, he got hot. You know, some great threes and big threes and gave our offense a little extra boost and some life.”"}
{"game_id": "0022100196", "chunk_id": "0022100196_024", "order": 24, "role": "body", "text": "Nash on the Thunder: “That’s a well-coached team that has a terrific player in Shai, and there’s a bunch of guys that are trying to make careers for themselves that play extremely hard and have the freedom to just step up and shoot the ball. And they get on a roll, they can be very difficult.”"}
{"game_id": "0022100196", "chunk_id": "0022100196_026", "order": 26, "role": "body", "text": "Nets: Host Golden State on Tuesday night."}
{"game_id": "0022100196", "chunk_id": "0022100196_027", "order": 27, "role": "body", "text": "Thunder: Host Miami on Monday night."}
{"game_id": "0022100196", "chunk_id": "0022100196_029", "order": 29, "role": "body", "text": "Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP."}
