{"game_id": "0022100782", "chunk_id": "0022100782_001", "order": 1, "role": "lead", "text": "DETROIT -- — Anthony Edwards scored 25 points, and Karl-Anthony Towns added 21 points and 14 rebounds and the Minnesota Timberwolves beat the Detroit Pistons 128-117 on Thursday night."}
{"game_id": "0022100782", "chunk_id": "0022100782_002", "order": 2, "role": "body", "text": "Taurean Prince added 23 points to help Minnesota win its third straight and fifth in six games."}
{"game_id": "0022100782", "chunk_id": "0022100782_003", "order": 3, "role": "body", "text": "Saddiq Bey had 21 points and 13 rebounds for Detroit, and Jerami Grant added 20 points. The Pistons lost for the sixth time in seven games."}
{"game_id": "0022100782", "chunk_id": "0022100782_004", "order": 4, "role": "body", "text": "Minnesota got off to a fast start, taking a 21-11 lead with five minutes remaining in the first quarter. But the Pistons outscored the Timberwolves 22-10 to take a 32-31 lead in the second quarter. The Pistons led 67-65 at halftime before Minnesota pulled away in the second half."}
{"game_id": "0022100782", "chunk_id": "0022100782_005", "order": 5, "role": "body", "text": "“I think being ready for and matching (Detroit's) physicality, which bothered us in the first half,” Minnesota coach Chris Finch said. “Just a little more attention to detail on the defensive end, in particular.”"}
{"game_id": "0022100782", "chunk_id": "0022100782_006", "order": 6, "role": "body", "text": "The Timberwolves led by 16 in the fourth quarter before the Pistons rallied to cut it to five, at 122-117 with 50 seconds remaining."}
{"game_id": "0022100782", "chunk_id": "0022100782_007", "order": 7, "role": "body", "text": "“We did a god job down the stretch, but not enough,” Detroit coach Dwain Casey said."}
{"game_id": "0022100782", "chunk_id": "0022100782_008", "order": 8, "role": "body", "text": "Patrick Beverley then hit a 3-pointerfor Minnesota to put it out of reach."}
{"game_id": "0022100782", "chunk_id": "0022100782_009", "order": 9, "role": "body", "text": "Towns, who learned at halftime he had been named an All-Star, had a couple of key blocks down the stretch after missing a wide-open shot."}
{"game_id": "0022100782", "chunk_id": "0022100782_010", "order": 10, "role": "body", "text": "“If you're going to miss a jumper, you have to make a block, make a stop,” he said."}
{"game_id": "0022100782", "chunk_id": "0022100782_011", "order": 11, "role": "body", "text": "The Timberwolves shot 51% from the floor to 44% for the Pistons."}
{"game_id": "0022100782", "chunk_id": "0022100782_013", "order": 13, "role": "body", "text": "Pistons rookie point guard Cade Cunningham sat out because of a hip-pointer. While Cunningham has been the focus of Detroit's offense this season, coach Dwain Casey says he likes to rely on more than one guard to run his offense."}
{"game_id": "0022100782", "chunk_id": "0022100782_014", "order": 14, "role": "body", "text": "“I believe in today's game, you've got to have three (guards who can play the point),” Casey said. “That's why I like the three-guard offense. It doesn't matter if it's Cory (Joseph) bringing it down, Killian (Hayes) or Cade bringing it down.\""}
{"game_id": "0022100782", "chunk_id": "0022100782_015", "order": 15, "role": "body", "text": "Having that kind of versatility, Casey said also allows him to use Cunningham at shooting guard or small forward."}
{"game_id": "0022100782", "chunk_id": "0022100782_017", "order": 17, "role": "body", "text": "Timberwolves: Host Detroit on Sunday"}
{"game_id": "0022100782", "chunk_id": "0022100782_018", "order": 18, "role": "closing", "text": "Pistonst: Host Boston on Friday night."}
