{"game_id": "0022100127", "chunk_id": "0022100127_001", "order": 1, "role": "lead", "text": "TORONTO -- — Darius Garland made a pair of free throws with 4.8 seconds remaining, and the Cleveland Cavaliers rallied to beat the Raptors 102-101 on Friday night, ending Toronto’s winning streak at five games."}
{"game_id": "0022100127", "chunk_id": "0022100127_002", "order": 2, "role": "body", "text": "Garland scored 17 of his 21 points in the second half, Jarrett Allen had 16 points and 15 rebounds, and Evan Mobley scored 18 for the Cavs, who had lost their previous six games at Toronto."}
{"game_id": "0022100127", "chunk_id": "0022100127_003", "order": 3, "role": "body", "text": "“They are a really good, physical, active, defensive team that tries to get you on your heels,” Cavs coach J.B. Bickerstaff said of the Raptors. “In the second half, Darius put them on their heels.”"}
{"game_id": "0022100127", "chunk_id": "0022100127_004", "order": 4, "role": "body", "text": "Allen credited Garland, a third-year guard, for keeping the Cavs composed in the final minutes."}
{"game_id": "0022100127", "chunk_id": "0022100127_005", "order": 5, "role": "body", "text": "“Towards the end we could see we were getting flustered,” Allen said. “They were hitting some tough shots, our defense wasn’t where it needed to be. He got us all grouped together and told us that we needed to be on our game, and we got it done.”"}
{"game_id": "0022100127", "chunk_id": "0022100127_006", "order": 6, "role": "body", "text": "Cleveland won its third straight and improved to 4-3 on the road."}
{"game_id": "0022100127", "chunk_id": "0022100127_007", "order": 7, "role": "body", "text": "“We’re getting more and more confident every game,” Mobley said. “The chemistry is building every game.”"}
{"game_id": "0022100127", "chunk_id": "0022100127_008", "order": 8, "role": "body", "text": "Bickerstaff was impressed with the maturity his team showed in overcoming a tough opponent on the road."}
{"game_id": "0022100127", "chunk_id": "0022100127_009", "order": 9, "role": "body", "text": "“There’s something special growing in that locker room,” Bickerstaff said."}
{"game_id": "0022100127", "chunk_id": "0022100127_010", "order": 10, "role": "body", "text": "OG Anunoby scored 23 points but missed a jump shot in the final seconds that would have won it for the Raptors. Rookie Scottie Barnes, who returned after missing two games because of a sprained right thumb, couldn’t convert a tip-in on Anunoby’s late miss."}
{"game_id": "0022100127", "chunk_id": "0022100127_011", "order": 11, "role": "body", "text": "“We got the ball to OG, got a decent shot,” Barnes said. “I just missed the tip.”"}
{"game_id": "0022100127", "chunk_id": "0022100127_012", "order": 12, "role": "body", "text": "Cedi Osman scored 17 points for the Cavaliers and Ricky Rubio had 11."}
{"game_id": "0022100127", "chunk_id": "0022100127_013", "order": 13, "role": "body", "text": "Fred VanVleet scored 18 points, Gary Trent Jr. had 17 and Barnes scored 14 for the Raptors, who led by 15 points early in the third quarter."}
{"game_id": "0022100127", "chunk_id": "0022100127_014", "order": 14, "role": "body", "text": "“That one felt strange to lose,” Raptors coach Nick Nurse said. “I think we played pretty hard and I think we played pretty well.”"}
{"game_id": "0022100127", "chunk_id": "0022100127_015", "order": 15, "role": "body", "text": "Toronto led 80-74 to begin the fourth. With 4:42 remaining, Allen banked home a 3-pointer to tie it at 94-all."}
{"game_id": "0022100127", "chunk_id": "0022100127_016", "order": 16, "role": "body", "text": "“The basketball gods, when you’re playing the game the way our guys were playing, sometimes they favor you,” Bickerstaff said. “That shot showed favor.”"}
{"game_id": "0022100127", "chunk_id": "0022100127_017", "order": 17, "role": "body", "text": "The Raptors pushed back ahead, and Anunoby’s 3 made it 101-96 with 1:43 left. Allen scored back-to-back baskets to make it a one-point game, and the Cavs got possession with 24.8 seconds left after Barnes couldn’t grab the rebound on VanVleet’s missed 3."}
{"game_id": "0022100127", "chunk_id": "0022100127_018", "order": 18, "role": "body", "text": "Anunoby fouled a driving Garland, and the Cavs guard made both to give his team its first and only lead of the game."}
{"game_id": "0022100127", "chunk_id": "0022100127_019", "order": 19, "role": "body", "text": "Toronto called timeout, but Anunoby and Barnes couldn’t deliver the winning basket."}
{"game_id": "0022100127", "chunk_id": "0022100127_020", "order": 20, "role": "body", "text": "Up 29-28 after one, the Raptors widened their lead with an 11-2 run to start the second quarter and took a 57-48 advantage into halftime."}
{"game_id": "0022100127", "chunk_id": "0022100127_022", "order": 22, "role": "body", "text": "Cavaliers: Committed 19 turnovers, leading to 23 Toronto points. ... Osman shot 3 for 5 from 3-point range in the first half but the rest of the Cavs were 1 for 9. ... Garland had eight assists."}
{"game_id": "0022100127", "chunk_id": "0022100127_023", "order": 23, "role": "body", "text": "Raptors: F Pascal Siakam is ahead of schedule in his return from left shoulder surgery and could return to the lineup next week, Nurse said. Siakam recently returned from a check-up with the Los Angeles-based doctor who performed his surgery."}
{"game_id": "0022100127", "chunk_id": "0022100127_025", "order": 25, "role": "body", "text": "Toronto didn’t shoot a free throw in the first quarter, while the Cavs went 8 for 9 at the line in the period."}
{"game_id": "0022100127", "chunk_id": "0022100127_027", "order": 27, "role": "body", "text": "Anunoby has scored 20 or more points in six of his past eight games."}
{"game_id": "0022100127", "chunk_id": "0022100127_029", "order": 29, "role": "body", "text": "Cavaliers: Visit New York on Sunday night."}
{"game_id": "0022100127", "chunk_id": "0022100127_030", "order": 30, "role": "body", "text": "Raptors: Host Brooklyn on Sunday."}
