{"game_id": "0022100043", "chunk_id": "0022100043_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young had 32 points and nine assists, John Collins scored 22 and the Atlanta Hawks beat the Detroit Pistons 122-104 on Monday night."}
{"game_id": "0022100043", "chunk_id": "0022100043_002", "order": 2, "role": "body", "text": "The Hawks have won 24 of their last 30 home games, including playoff games, dating to Feb. 21."}
{"game_id": "0022100043", "chunk_id": "0022100043_003", "order": 3, "role": "body", "text": "“It’s always great playing here, so we want to make this a tough place to play,\" Young said. “We’ve got to win at home. We’re about to go on the road for a couple of games. Hopefully we bring that same energy we had tonight and carry it over.\""}
{"game_id": "0022100043", "chunk_id": "0022100043_004", "order": 4, "role": "body", "text": "The Pistons' Kelly Olynyk had 17 of his 21 points in the first half and Saddiq Bey scored 21 for Detroit, which is still winless. Olynyk and Josh Jackson were new additions to the Pistons’ starting lineup — Olynyk replacing the injured Jerami Grant and Jackson taking the spot of Frank Jackson."}
{"game_id": "0022100043", "chunk_id": "0022100043_005", "order": 5, "role": "body", "text": "“Hopefully we start knocking some shots down soon,\" Josh Jackson said. “That's one thing we talk about. We're taking the right ones.\""}
{"game_id": "0022100043", "chunk_id": "0022100043_006", "order": 6, "role": "body", "text": "Atlanta led 62-54 at halftime. And Young, who became the first player in NBA history to record 20 points and seven assists in his first 13 career playoff games, again looked in his prime facing the Pistons."}
{"game_id": "0022100043", "chunk_id": "0022100043_007", "order": 7, "role": "body", "text": "A dunk from Collins and a layup by Young pushed the Hawks' lead back to double digits at 73-62 early in the third. Collins followed with an alley-oop layup on a pass from Kevin Huerter to make it 75-62."}
{"game_id": "0022100043", "chunk_id": "0022100043_008", "order": 8, "role": "body", "text": "Detroit coach Dwane Casey called a timeout. But Atlanta poured it on, with Collins hitting a runner on the next Hawks possession to push the lead to 77-62, the biggest of the game at the time."}
{"game_id": "0022100043", "chunk_id": "0022100043_009", "order": 9, "role": "body", "text": "Bey scored inside to pull the Pistons within seven at the 3:47 mark of the third, Hawks coach Nate McMillan took a timeout. Reddish, Lou Williams and Gorgui Dieng hit 3s, and Young’s layup pushed the lead to 93-77."}
{"game_id": "0022100043", "chunk_id": "0022100043_010", "order": 10, "role": "body", "text": "“We got up 13 in the first half and then they came back and made it a close game before halftime,” Young said. “We got it up to 13 again, and we wanted to make one more push and not let them back in the game. I think they made one more run, but at that point we kind of put our foot on their necks and made them a little more tired."}
{"game_id": "0022100043", "chunk_id": "0022100043_011", "order": 11, "role": "body", "text": "“They were missing some guys tonight, so it was good for us.\""}
{"game_id": "0022100043", "chunk_id": "0022100043_012", "order": 12, "role": "body", "text": "Atlanta led 95-79 entering the fourth, and continued its offensive assault. Collins made a one-handed dunk over Olynyk on another alley-oop pass from Huerter in the closing minutes to make it 120-97. He and the starters left the game at that point."}
{"game_id": "0022100043", "chunk_id": "0022100043_013", "order": 13, "role": "body", "text": "“It feels like he has one every game now, so to us it’s nothing new,\" Huerter said. “I said it after the game — it seems like every new one is better than the last one he had. That’s what we’ve come to expect out of him.\""}
{"game_id": "0022100043", "chunk_id": "0022100043_015", "order": 15, "role": "body", "text": "Pistons: Grant could not play because of a left elbow infection. ... No. 1 overall draft pick Cade Cunningham, with a right ankle sprain, did not make the trip. ... Rookie F Isaiah Livers was out with a left knee ailment."}
{"game_id": "0022100043", "chunk_id": "0022100043_016", "order": 16, "role": "body", "text": "Hawks: F De’Andre Hunter wasn’t feeling well enough to play and stayed home, McMillan said. Hunter’s illness is not COVID-19 related. Huerter started in his spot and scored 14. ... F Danilo Gallinari missed his third straight game with left shoulder soreness."}
{"game_id": "0022100043", "chunk_id": "0022100043_018", "order": 18, "role": "body", "text": "The play of Pistons point guard Killian Hayes was a concern as he entered with a one-point scoring average, but he ended up with 12 points and three assists on Monday. He didn't play in the fourth quarter for the third straight game. “We knew there was going to be growing pains,” Casey said. “He’s young. You can’t wave a magic wand on any of our point guards right now and hope and say he should be doing this and he should be doing that. There’s going to be steps, and our job right now is to continue to support him, to push him, to kick him in the behind and put an arm around him at the same time.”"}
{"game_id": "0022100043", "chunk_id": "0022100043_020", "order": 20, "role": "body", "text": "Pistons: Host Orlando on Thursday."}
{"game_id": "0022100043", "chunk_id": "0022100043_021", "order": 21, "role": "body", "text": "Hawks: At New Orleans on Wednesday."}
