{"game_id": "0022100270", "chunk_id": "0022100270_001", "order": 1, "role": "lead", "text": "BOSTON -- — Kevin Durant grew up in the Washington, D.C., area looking up to Allen Iverson as he led Georgetown to back-to-back trips to the NCAA Sweet 16."}
{"game_id": "0022100270", "chunk_id": "0022100270_002", "order": 2, "role": "body", "text": "Now the Nets forward is looking down at the Hall of Famer from the top 25 of the NBA's all-time scoring list."}
{"game_id": "0022100270", "chunk_id": "0022100270_003", "order": 3, "role": "body", "text": "“Iverson, he was in the Pantheon for me. One of those guys I emulated every time I went outside,” Durant said on Wednesday night after surpassing Iverson's career total and leading Brooklyn to a 123-104 victory over the Boston Celtics."}
{"game_id": "0022100270", "chunk_id": "0022100270_004", "order": 4, "role": "body", "text": "“To pass him on the list, to end up there with some of the greats on that list is incredible,” said Durant, who entered the night with 24,367 points, one behind Iverson, and passed him on a jumper in the first two minutes. “I’ve just got to keep going.”"}
{"game_id": "0022100270", "chunk_id": "0022100270_005", "order": 5, "role": "body", "text": "Patty Mills scored 23, and James Harden had 20 points and 11 assists for Brooklyn. LaMarcus Aldridge scored 17 points with nine rebounds for the Nets, who have won four in a row, seven out of eight and 12 of their last 14 games."}
{"game_id": "0022100270", "chunk_id": "0022100270_006", "order": 6, "role": "body", "text": "Marcus Smart had 20 points and eight assists for Boston, which had won three in a row. Jayson Tatum had 15 points and eight rebounds for the Celtics, who cut a 29-point, third-quarter lead to 12 early in the fourth, but could get no closer."}
{"game_id": "0022100270", "chunk_id": "0022100270_007", "order": 7, "role": "body", "text": "It was Brooklyn’s first visit to Boston since completing a Game 4 victory in the first round of last season’s playoffs."}
{"game_id": "0022100270", "chunk_id": "0022100270_008", "order": 8, "role": "body", "text": "“It’s a quality road win against a team that’s been playing great basketball,” Nets coach Steve Nash said."}
{"game_id": "0022100270", "chunk_id": "0022100270_009", "order": 9, "role": "body", "text": "The Nets opened an 11-point lead midway through the first quarter and led by as many as 17 in the second before taking a 62-49 lead into the half. They scored 18 of the first 21 points in the third and led 97-68 before Boston scored the last eight points of the quarter."}
{"game_id": "0022100270", "chunk_id": "0022100270_010", "order": 10, "role": "body", "text": "Boston scored the first eight points in the fourth to cut it to 97-85. But Mills assisted on James Johnson's jumper, then hit a 3-pointer to extend the lead."}
{"game_id": "0022100270", "chunk_id": "0022100270_012", "order": 12, "role": "body", "text": "Nash had just finished explaining how these Nets were the quietest team he’s ever had when a ruckus erupted from the coaches’ locker room next door."}
{"game_id": "0022100270", "chunk_id": "0022100270_013", "order": 13, "role": "body", "text": "“Keep it down in there,” guard James Harden said with a laugh, banging on the wall as he followed Nash in the postgame news conference. “I’m doing media.”"}
{"game_id": "0022100270", "chunk_id": "0022100270_014", "order": 14, "role": "body", "text": "Nash said he is starting to feel his team become more vocal."}
{"game_id": "0022100270", "chunk_id": "0022100270_015", "order": 15, "role": "body", "text": "“They’re one of the quietest teams I’ve ever been around,” he said. “We're not a loud group, but the spirit is growing. The guys are starting to come together and find the joy in playing together.”"}
{"game_id": "0022100270", "chunk_id": "0022100270_017", "order": 17, "role": "body", "text": "The last time Brooklyn visited Boston, ex-Celtic Kyrie Irving was hit with a water bottle as the team left the court. Irving has not played this season due to his refusal to comply with COVID-19 vaccination mandates."}
{"game_id": "0022100270", "chunk_id": "0022100270_018", "order": 18, "role": "body", "text": "New Celtics coach Ime Udoka was a Nets assistant last season. Harden stopped by the Boston bench before the game for a handshake, but Durant preferred to exchange trash talk with the coach who was also an assistant on the U.S. Olympic team."}
{"game_id": "0022100270", "chunk_id": "0022100270_019", "order": 19, "role": "body", "text": "\"Coming into Boston’s a tough place to play,\" Durant said. “Now that Ime's here makes it even sweeter.”"}
{"game_id": "0022100270", "chunk_id": "0022100270_021", "order": 21, "role": "body", "text": "Tatum went 1 for 9 from 3-point range, but his make gave him 650 in his career and moved him ahead of Larry Bird and into fifth on the Celtics’ all-time list. Smart, who made three on Wednesday, is fourth with 702."}
{"game_id": "0022100270", "chunk_id": "0022100270_023", "order": 23, "role": "body", "text": "Next up on the scoring list for Durant is Ray Allen, who has 24,505 points. ... Hall of Famer Bill Russell was at the game, sitting courtside under the basket at the Nets end of the court. ... Udoka picked up a technical foul leaving the court at halftime. Durant shot the free throw before the start of the third quarter, and missed it. ... Harden stopped by the Boston bench before the game to say hello to Udoka, who was a Nets assistant last season."}
{"game_id": "0022100270", "chunk_id": "0022100270_025", "order": 25, "role": "body", "text": "Nets: Host Phoenix on Saturday."}
{"game_id": "0022100270", "chunk_id": "0022100270_026", "order": 26, "role": "body", "text": "Celtics: Play at San Antonio on Friday night."}
