{"game_id": "0022100309", "chunk_id": "0022100309_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Karl-Anthony Towns scored 16 of his 32 points in the third quarter and Anthony Edwards added 21 as the Minnesota Timberwolves rallied for a 100-98 win against the Indiana Pacers on Monday night."}
{"game_id": "0022100309", "chunk_id": "0022100309_002", "order": 2, "role": "body", "text": "The Timberwolves trailed by 12 early in the third before Towns willed them back into the game. Michael Beasley’s 3-pointer for Minnesota with 51.5 seconds left in the fourth broke a 94-all tie."}
{"game_id": "0022100309", "chunk_id": "0022100309_003", "order": 3, "role": "body", "text": "D’Angelo Russell had 21 points and a season-high 11 assists for the Timberwolves, who have won seven of eight."}
{"game_id": "0022100309", "chunk_id": "0022100309_004", "order": 4, "role": "body", "text": "“I think the biggest thing for me is through all the good things that we did do, I don’t think it was overall a great performance by us and we still managed to win,” coach Chris Finch said. “We did enough of the right things at the right times and overall in the second half our defense was on point.”"}
{"game_id": "0022100309", "chunk_id": "0022100309_005", "order": 5, "role": "body", "text": "Minnesota held Indiana to 41 points and 29.3% shooting in the second half."}
{"game_id": "0022100309", "chunk_id": "0022100309_006", "order": 6, "role": "body", "text": "Domantas Sabonis had 16 points, a career-high 25 rebounds and 10 assists for the Pacers. Malcolm Brogdon added 25 points but Indiana lost for the third time in four games."}
{"game_id": "0022100309", "chunk_id": "0022100309_007", "order": 7, "role": "body", "text": "“I think it’s a game we should have won,” Brogdon said. “We had some breakdowns. We had Myles (Turner) out, which is our defensive anchor around the basket. Despite all that, we still had a chance to win this game.”"}
{"game_id": "0022100309", "chunk_id": "0022100309_008", "order": 8, "role": "body", "text": "With the Wolves clinging to a 94-91 lead, Towns fouled out with 1:34 remaining. Sabonis made three free throws to tie the game, but Beasley hit a corner 3 in the final minute to put Minnesota back in front."}
{"game_id": "0022100309", "chunk_id": "0022100309_009", "order": 9, "role": "body", "text": "Josh Okogie blocked a jumper from Caris Levert and Minnesota was able to close it out from the foul line."}
{"game_id": "0022100309", "chunk_id": "0022100309_010", "order": 10, "role": "body", "text": "“The more adversity we have throughout these games versus beating the hell out of teams, I think it prepares us for the next one, prepares us for those moments,” Russell said. “So, I liked this one for us; good defensive game all the way around.”"}
{"game_id": "0022100309", "chunk_id": "0022100309_011", "order": 11, "role": "body", "text": "Frustration with the officials got the Wolves crowd into the game and seemed to energize Towns and the team. Indiana then became frustrated with the calls as Minnesota took control."}
{"game_id": "0022100309", "chunk_id": "0022100309_012", "order": 12, "role": "body", "text": "The Wolves went on a 22-9 run, with Towns scoring 15 points, to take the lead late in the third."}
{"game_id": "0022100309", "chunk_id": "0022100309_013", "order": 13, "role": "body", "text": "“I tried to go out and do it myself,\" Towns said. \"Just being aggressive, getting downhill. You know, making plays, trying to score, keep us, give us energy.”"}
{"game_id": "0022100309", "chunk_id": "0022100309_014", "order": 14, "role": "body", "text": "Edwards scored 11 points in the third. He brought the crowd to its feet with a soaring dunk on a breakaway and again when he finished an alley-oop on the break from Taurean Prince."}
{"game_id": "0022100309", "chunk_id": "0022100309_015", "order": 15, "role": "body", "text": "On the ensuing possession, Edwards poked the ball away from Brogdon for a steal and hit a long 3-pointer at the other end to again take the lead after Indiana had come back."}
{"game_id": "0022100309", "chunk_id": "0022100309_016", "order": 16, "role": "body", "text": "“It brings a smile to my face knowing that as soon as I get going, everybody just starts standing up, gets super loud,” Edwards said. “Once I hit that step-back 3, it was so loud in there, bro. Like damn, it’s crazy. I love it. I love the fans, man.\""}
{"game_id": "0022100309", "chunk_id": "0022100309_018", "order": 18, "role": "body", "text": "Rookie guard Chris Duarte hit a 3 early in the fourth to bring the Pacers within one but then missed a layup on the next possession. He followed with a turnover and barked at the official, getting a technical foul."}
{"game_id": "0022100309", "chunk_id": "0022100309_019", "order": 19, "role": "body", "text": "While Sabonis tried to intervene and move Duarte away, the rookie kept complaining and was ejected with his second technical."}
{"game_id": "0022100309", "chunk_id": "0022100309_020", "order": 20, "role": "body", "text": "“I just thought, in that situation, that what you want to see is a veteran official defuse the situation, not stare at the guy and dare him to keep talking,” Indiana coach Rick Carlisle said. “I thought that Chris was wrong. But officials can walk away in certain situations and I would have loved to see that right there.”"}
{"game_id": "0022100309", "chunk_id": "0022100309_021", "order": 21, "role": "body", "text": "A minute later during a Minnesota timeout, Indiana’s T.J. McConnell and Carlisle were called for technical fouls."}
{"game_id": "0022100309", "chunk_id": "0022100309_023", "order": 23, "role": "body", "text": "Pacers: Turner missed the game with a non-COVID-19 illness. McConnell joined the starting lineup as Indiana went small. He had eight points. … Duarte had 14 points off the bench before his ejection, going 3 of 5 from 3-point distance."}
{"game_id": "0022100309", "chunk_id": "0022100309_024", "order": 24, "role": "body", "text": "Timberwolves: Forwards Jarred Vanderbilt and Jaden McDaniels were held out with flu-like symptoms. Okogie started in place of Vanderbilt. ... G Patrick Beverley missed his third straight game with a left adductor strain. … Naz Reid had 13 points off the bench and made several key plays in the third-quarter run. … Minnesota has made going inside more of a focus in recent games and had 46 points in the paint, its third straight game with at least that many inside."}
{"game_id": "0022100309", "chunk_id": "0022100309_026", "order": 26, "role": "body", "text": "Pacers: Host the Atlanta Hawks on Wednesday."}
{"game_id": "0022100309", "chunk_id": "0022100309_027", "order": 27, "role": "body", "text": "Timberwolves: Start a two-game road trip Wednesday at Washington."}
