{"game_id": "0022100046", "chunk_id": "0022100046_001", "order": 1, "role": "lead", "text": "TORONTO -- — DeMar DeRozan took control in the fourth quarter, something he's done plenty of times in Toronto."}
{"game_id": "0022100046", "chunk_id": "0022100046_002", "order": 2, "role": "body", "text": "DeRozan scored 26 points against his former team, including 11 in the final period, Zach LaVine had 22 points and the Chicago Bulls opened a season with four straight wins for the first time since 1996-97, holding off the Toronto Raptors 111-108 on Monday night."}
{"game_id": "0022100046", "chunk_id": "0022100046_003", "order": 3, "role": "body", "text": "“DeMar obviously did a great job of closing the game out,” Bulls coach Billy Donovan said."}
{"game_id": "0022100046", "chunk_id": "0022100046_004", "order": 4, "role": "body", "text": "DeRozan scored four of Chicago’s final five points as the Bulls survived a late Toronto challenge."}
{"game_id": "0022100046", "chunk_id": "0022100046_005", "order": 5, "role": "body", "text": "“You live for those moments, honestly,” DeRozan said. “I get up for those moments. I love them.”"}
{"game_id": "0022100046", "chunk_id": "0022100046_006", "order": 6, "role": "body", "text": "Lonzo Ball said the Bulls have faith in DeRozan to deliver late in close games."}
{"game_id": "0022100046", "chunk_id": "0022100046_007", "order": 7, "role": "body", "text": "“He’s been our go-to in the closing moments of games and he hasn’t disappointed yet,” Ball said. “Tonight he put us on his back and carried the fourth quarter for us.”"}
{"game_id": "0022100046", "chunk_id": "0022100046_008", "order": 8, "role": "body", "text": "Charlotte’s overtime loss against Boston left the Bulls as the East’s lone unbeaten team."}
{"game_id": "0022100046", "chunk_id": "0022100046_009", "order": 9, "role": "body", "text": "“It’s great, but we’ve got a lot more basketball to go,” DeRozan said. “We’ve got to move on to the next game. We can’t carry this record like it’s some kind of badge of honor.”"}
{"game_id": "0022100046", "chunk_id": "0022100046_010", "order": 10, "role": "body", "text": "Nikola Vucevic scored 17 points and Ball had 15 as the Bulls won their fourth straight meeting with Toronto. Ball shot 5 for 9 from 3-point range."}
{"game_id": "0022100046", "chunk_id": "0022100046_011", "order": 11, "role": "body", "text": "“They’ve got some prolific shot makers and they were making a few,” Toronto coach Nick Nurse said."}
{"game_id": "0022100046", "chunk_id": "0022100046_012", "order": 12, "role": "body", "text": "OG Anunoby scored 22 points and Gary Trent Jr. had 18 as the struggling Raptors lost for the third time in four games."}
{"game_id": "0022100046", "chunk_id": "0022100046_013", "order": 13, "role": "body", "text": "Toronto’s Fred VanVleet scored 15 points and set a career high with 17 assists. Precious Achiuwa had 11 points and 11 rebounds for the Raptors, and rookie Scottie Barnes scored 13 points."}
{"game_id": "0022100046", "chunk_id": "0022100046_014", "order": 14, "role": "body", "text": "Chicago opened a 20-point lead less than three minutes into the second half and was up 97-86 with 7:57 left in the fourth, but Anunoby scored the final five points in a 9-0 Toronto run as the Raptors cut it to 97-95 with 4:49 to go."}
{"game_id": "0022100046", "chunk_id": "0022100046_015", "order": 15, "role": "body", "text": "DeRozan sandwiched jump shots around a pair of free throws from Alex Caruso as the Bulls answered with a 6-0 spurt to take a 103-95 lead with 3:27 to play."}
{"game_id": "0022100046", "chunk_id": "0022100046_016", "order": 16, "role": "body", "text": "Barnes scored off a Bulls turnover with 15 seconds left, cutting it to 110-108. Vucevic missed the first of two free throws, ending Chicago’s streak of 20 consecutive makes, but hit the second to put the Bulls up by three. VanVleet missed a potential game-tying shot at the buzzer."}
{"game_id": "0022100046", "chunk_id": "0022100046_017", "order": 17, "role": "body", "text": "Six different Raptors made a 3-pointer in the second quarter, but Ball made three of his own as Chicago outscored Toronto 37-27 to lead 61-51 at halftime."}
{"game_id": "0022100046", "chunk_id": "0022100046_018", "order": 18, "role": "body", "text": "LaVine scored 13 points in the third as the Bulls took a 92-80 lead to the final quarter."}
{"game_id": "0022100046", "chunk_id": "0022100046_020", "order": 20, "role": "body", "text": "Chicago shot 21 for 22 at the free throw line, led by a 10-for-10 performance from DeRozan."}
{"game_id": "0022100046", "chunk_id": "0022100046_022", "order": 22, "role": "body", "text": "Achiuwa posted his third straight double-double. He had three in 61 games with Miami as a rookie last season."}
{"game_id": "0022100046", "chunk_id": "0022100046_024", "order": 24, "role": "body", "text": "Bulls: Troy Brown Jr. scored 11 points. ... Toronto’s first-round pick in 2009, DeRozan played nine seasons with the Raptors and remains the team’s leader in games (675), minutes (22,986) and points (13,296). He spent the most recent three seasons with San Antonio."}
{"game_id": "0022100046", "chunk_id": "0022100046_025", "order": 25, "role": "body", "text": "Raptors: Toronto turned the ball over 10 times in the first half, including five from VanVleet, and finished with a season-worst 21 turnovers, leading to 27 points for Chicago. VanVleet had a career-worst eight turnovers."}
{"game_id": "0022100046", "chunk_id": "0022100046_027", "order": 27, "role": "body", "text": "Bulls: Host New York on Thursday night."}
{"game_id": "0022100046", "chunk_id": "0022100046_028", "order": 28, "role": "body", "text": "Raptors: Host Indiana on Wednesday night."}
