{"game_id": "0022100081", "chunk_id": "0022100081_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — As much as Scottie Barnes has made a strong first impression in the NBA, Toronto Raptors coach Nick Nurse suggests the rookie could take more shots."}
{"game_id": "0022100081", "chunk_id": "0022100081_002", "order": 2, "role": "body", "text": "The No. 4 overall pick in July's draft made nine of 17 shots to finish with a team-high 21 points in the Raptors' 97-94 road win over the Indiana Pacers on Saturday night. Barnes also grabbed 12 rebounds and hit a pair of free throws with 6.2 seconds remaining to give the Raptors the final margin."}
{"game_id": "0022100081", "chunk_id": "0022100081_003", "order": 3, "role": "body", "text": "“With all of his offensive stuff, he's still learning what he's going to do,” Nurse said of Barnes. “Seventeen shots in a game are quite a few, and I love it, but they're not enough.”"}
{"game_id": "0022100081", "chunk_id": "0022100081_004", "order": 4, "role": "body", "text": "The Pacers' Domantas Sabonis missed a hurried 3-pointer in the final seconds."}
{"game_id": "0022100081", "chunk_id": "0022100081_005", "order": 5, "role": "body", "text": "The Raptors have won three in a row, including a 118-100 victory over Indiana at home on Thursday. The Pacers have lost six of seven."}
{"game_id": "0022100081", "chunk_id": "0022100081_006", "order": 6, "role": "body", "text": "“It's the NBA, it's not supposed to be easy,” Pacers coach Rick Carlisle said. “If it was, I'd be pulling guys off the street. It's a tough, tough league. ... We played hard. We just need to play better.”"}
{"game_id": "0022100081", "chunk_id": "0022100081_007", "order": 7, "role": "body", "text": "The Raptors never led by more than three until the final quarter, then surged to a 92-84 advantage on Fred VanFleet's three with 1:44 remaining. VanFleet finished with 16 points."}
{"game_id": "0022100081", "chunk_id": "0022100081_008", "order": 8, "role": "body", "text": "“We're spreading it around, not trying to rely on only one guy,” VanFleet said. “Our team chemistry is building. Our trust is building in each other.\""}
{"game_id": "0022100081", "chunk_id": "0022100081_009", "order": 9, "role": "body", "text": "Svi Mykhailiuk scored 16 off the bench for Toronto. OG Anunoby had 15."}
{"game_id": "0022100081", "chunk_id": "0022100081_010", "order": 10, "role": "body", "text": "“We're trying to learn every time out,\" Mykhailiuk said. \"We've still got a ways to go.”"}
{"game_id": "0022100081", "chunk_id": "0022100081_011", "order": 11, "role": "body", "text": "Sabonis led the Pacers with 22 points and 14 rebounds. Caris LeVert scored 15 in his season debut, all in the first half because he was on a minutes restriction. He scored nine of Indiana's initial 13 points. He missed the season's first six games with a back stress fracture."}
{"game_id": "0022100081", "chunk_id": "0022100081_012", "order": 12, "role": "body", "text": "“I feel like I prepared as well as I could have and kind of hit the ground running tonight,” LeVert said."}
{"game_id": "0022100081", "chunk_id": "0022100081_013", "order": 13, "role": "body", "text": "The Pacers led by as many as seven points in the first half."}
{"game_id": "0022100081", "chunk_id": "0022100081_015", "order": 15, "role": "body", "text": "Raptors: Barnes banged a thumb, but X-rays came back negative. He's just the second player in franchise history to score 100 points in his first six games. The other was Damon Stoudamire in 1995-96. He entered with a 17.7-point average that ranked second among NBA rookies. ... VanFleet hit six threes in Thursday's win over the Pacers. He was two of seven from beyond the arc this time."}
{"game_id": "0022100081", "chunk_id": "0022100081_016", "order": 16, "role": "body", "text": "Pacers: Center Myles Turner blocked five shots, the 35th time in his career he's had at least five. ... Point guard Malcolm Brogdon (hamstring strain) missed a second consecutive game. ... Rookie guard Chris Duarte bumped his left knee in the third quarter but returned. He ranked first among NBA rookies at 18.6 points and 37 minutes per game through five games. ... Exercised 2022-23 option on reserve center Goga Bitadze."}
{"game_id": "0022100081", "chunk_id": "0022100081_018", "order": 18, "role": "body", "text": "Raptors: Visit New York on Monday."}
{"game_id": "0022100081", "chunk_id": "0022100081_019", "order": 19, "role": "body", "text": "Pacers: Host San Antonio on Monday."}
