{"game_id": "0022100371", "chunk_id": "0022100371_001", "order": 1, "role": "lead", "text": "TORONTO -- — Mike Muscala made a go-ahead 3-pointer with nine seconds remaining and the Oklahoma City Thunder held on to beat the shorthanded Toronto Raptors 110-109 on Wednesday night."}
{"game_id": "0022100371", "chunk_id": "0022100371_002", "order": 2, "role": "body", "text": "Shai Gilgeous-Alexander scored 16 of his 26 points in the third quarter and the Thunder (8-16) rallied from a 13-point deficit to win their second straight game."}
{"game_id": "0022100371", "chunk_id": "0022100371_003", "order": 3, "role": "body", "text": "Toronto’s Justin Champagnie thought he had tipped in Fred VanVleet’s missed shot at the buzzer to give the Raptors the win but, after a wild celebration at center court, the referees ruled Champagnie’s shot had come too late."}
{"game_id": "0022100371", "chunk_id": "0022100371_004", "order": 4, "role": "body", "text": "“I was really scared,” Gilgeous-Alexander said. “Obviously, you put so much into a game. Like that it can be taken away. Thankfully, it wasn’t.”"}
{"game_id": "0022100371", "chunk_id": "0022100371_005", "order": 5, "role": "body", "text": "The Thunder, who won Monday at Detroit to snap an eight-game losing streak, overcame a double-digit deficit for the second game in a row. Oklahoma City fought back from 18 down to beat the Pistons."}
{"game_id": "0022100371", "chunk_id": "0022100371_006", "order": 6, "role": "body", "text": "“Guys just made big-time plays tonight,” coach Mark Daigneault said."}
{"game_id": "0022100371", "chunk_id": "0022100371_007", "order": 7, "role": "body", "text": "Luguentz Dort scored 22 points, Darius Bazley had 15 and Josh Giddey added 13 for Oklahoma City."}
{"game_id": "0022100371", "chunk_id": "0022100371_008", "order": 8, "role": "body", "text": "Gary Trent Jr. scored 24 points, Pascal Siakam had 23 and VanVleet scored 14 of his 19 in the fourth quarter as the Raptors lost for the first time in three games. Toronto is 4-9 at home."}
{"game_id": "0022100371", "chunk_id": "0022100371_009", "order": 9, "role": "body", "text": "Already without forward OG Anunoby (left hip) and center Khem Birch (right knee), who sat out for the 10th straight game, the Raptors also played without center Precious Achiuwa, who was unavailable because of a sore right shoulder. Chris Boucher made his first start of the season in place of Achiuwa."}
{"game_id": "0022100371", "chunk_id": "0022100371_010", "order": 10, "role": "body", "text": "The Canadian-born Gilgeous-Alexander said he got a boost from playing north of the border, with friends and family from his nearby home of Hamilton, Ontario, watching from the stands."}
{"game_id": "0022100371", "chunk_id": "0022100371_011", "order": 11, "role": "body", "text": "“It’s an exciting feeling,” he said. “It’s always fun and it always will be.”"}
{"game_id": "0022100371", "chunk_id": "0022100371_012", "order": 12, "role": "body", "text": "Gilgeous-Alexander shot 6 for 17 and went 12 for 12 at the free throw line. He also had nine assists."}
{"game_id": "0022100371", "chunk_id": "0022100371_013", "order": 13, "role": "body", "text": "“He was really good,” Raptors coach Nick Nurse said. “He was hard to keep in front of and he was making good plays.”"}
{"game_id": "0022100371", "chunk_id": "0022100371_014", "order": 14, "role": "body", "text": "Dort, who is also from Canada, said he had family and friends who came in from Montreal, some 300 miles away, to watch him play."}
{"game_id": "0022100371", "chunk_id": "0022100371_015", "order": 15, "role": "body", "text": "“It was just great,” Dort said. “It’s always good to be back in your country.”"}
{"game_id": "0022100371", "chunk_id": "0022100371_016", "order": 16, "role": "body", "text": "Toronto trailed 100-94 after back-to-back 3-pointers by VanVleet with 3:51 remaining, and Trent’s 3 with 1:45 left made it 103-102."}
{"game_id": "0022100371", "chunk_id": "0022100371_017", "order": 17, "role": "body", "text": "Dort scored for the Thunder before VanVleet connected again, his fourth 3 of the quarter, tying it at 105 with 59 seconds left."}
{"game_id": "0022100371", "chunk_id": "0022100371_018", "order": 18, "role": "body", "text": "VanVleet put the Raptors ahead with a pair of free throws, but Gilgeous-Alexander made a pair of his own to tie the score again before Champagnie’s basket with 18 seconds left gave Toronto a 109-107 lead."}
{"game_id": "0022100371", "chunk_id": "0022100371_019", "order": 19, "role": "body", "text": "After a timeout, a driving Gileous-Alexander kicked out to find Muscala for his go-ahead 3."}
{"game_id": "0022100371", "chunk_id": "0022100371_020", "order": 20, "role": "body", "text": "“As soon as I saw Mike was open, I had to get it to him,” Gilgeous-Alexander said."}
{"game_id": "0022100371", "chunk_id": "0022100371_021", "order": 21, "role": "body", "text": "Daigneault praised Gilgeous-Alexander for not trying to do too much with the game on the line."}
{"game_id": "0022100371", "chunk_id": "0022100371_022", "order": 22, "role": "body", "text": "“I’ve been really impressed with his restraint and his ability to play the long game,” Daigneault said. “He’s home in Canada and he’s got the ball in his hands, down by two, and he makes the right play. He doesn’t get thirsty and try to force anything up there.\""}
{"game_id": "0022100371", "chunk_id": "0022100371_023", "order": 23, "role": "body", "text": "Toronto led 64-54 at halftime but Gilgeous-Alexander scored 16 in the third quarter, going 8 for 8 at the free throw line and adding a pair of 3-pointers. The Raptors shot 5 for 27 in the third and were outscored 33-12, matching their lowest point total in any quarter this season."}
{"game_id": "0022100371", "chunk_id": "0022100371_024", "order": 24, "role": "body", "text": "The Raptors made only one basket in the final eight minutes of the third, a 3-pointer from Scottie Barnes, and were outscored 25-3 during that span. The Thunder took an 87-76 lead into the fourth."}
{"game_id": "0022100371", "chunk_id": "0022100371_026", "order": 26, "role": "body", "text": "The Raptors made six 3-pointers in the fourth and finished with 15, matching their season high. Toronto has made 15 3-pointers twice previously, doing it most recently in a Nov. 21 loss at Golden State."}
{"game_id": "0022100371", "chunk_id": "0022100371_028", "order": 28, "role": "body", "text": "Thunder: Outscored Toronto 29-14 in bench points.. … Derrick Favors had eight points and nine rebounds. … Improved to 6-16 when shooting below 50% ."}
{"game_id": "0022100371", "chunk_id": "0022100371_029", "order": 29, "role": "body", "text": "Raptors: Siakam shot 7 for 9 in the first half. He finished 10 of 15. … Toronto scored 12 points in the fourth quarter of a Nov. 19 win at Sacramento."}
{"game_id": "0022100371", "chunk_id": "0022100371_031", "order": 31, "role": "body", "text": "Thunder: Host the Los Angeles Lakers on Friday night."}
{"game_id": "0022100371", "chunk_id": "0022100371_032", "order": 32, "role": "body", "text": "Raptors: Host the New York Knicks on Friday night."}
