{"game_id": "0022100475", "chunk_id": "0022100475_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Eric Bledsoe scored 19 points, Paul George had 17 and the Los Angeles Clippers held off the Sacramento Kings 105-89 on Wednesday night."}
{"game_id": "0022100475", "chunk_id": "0022100475_002", "order": 2, "role": "body", "text": "Serge Ibaka added a season-high 17 points, including three dunks and 12 points in the fourth quarter, to help the Clippers end a three-game losing streak."}
{"game_id": "0022100475", "chunk_id": "0022100475_003", "order": 3, "role": "body", "text": "Los Angeles had lost three straight to Sacramento, including twice this season."}
{"game_id": "0022100475", "chunk_id": "0022100475_004", "order": 4, "role": "body", "text": "“Tonight I just came with the mindset that I’m going to be out there for my teammates. We needed this win so bad,” said Ibaka, who has played sparingly this season while working his way back from back surgery in June. “I just tried to go out there and play hard and see what happened. When we play like that, it’s very hard to beat us.”"}
{"game_id": "0022100475", "chunk_id": "0022100475_005", "order": 5, "role": "body", "text": "Tyrese Haliburton had his fourth consecutive double-double with 22 points and a career-high 13 assists for Sacramento. Chimezie Metu added 11 points and 10 rebounds."}
{"game_id": "0022100475", "chunk_id": "0022100475_006", "order": 6, "role": "body", "text": "“They know how to manipulate defense, they were really sharp, and really ready go,” Kings assistant Doug Christie said. “Once they got us on our heels, it was attack.”"}
{"game_id": "0022100475", "chunk_id": "0022100475_007", "order": 7, "role": "body", "text": "George was playing in his second game since missing nearly two weeks with an elbow injury before being cleared to return. The seven-time All-Star, who scored 25 points against the Spurs on Monday, struggled with his shot most of the game against the Kings and was hit with a technical foul in the third quarter. He made a clutch 3-pointer as part of the Clippers’ game-ending 10-3 run."}
{"game_id": "0022100475", "chunk_id": "0022100475_008", "order": 8, "role": "body", "text": "Ibaka was just as big in the fourth quarter. He scored seven consecutive points for the Clippers during one stretch, and then added his final dunk of the quarter to push Los Angeles ahead 103-88."}
{"game_id": "0022100475", "chunk_id": "0022100475_009", "order": 9, "role": "body", "text": "“Serge was great, making two 3s, on the offensive glass, finishing at the rim,” Clippers coach Tyronn Lue said. “Serge’s presence was huge and big off the bench, and then definitely anchoring the defense on that second unit.”"}
{"game_id": "0022100475", "chunk_id": "0022100475_010", "order": 10, "role": "body", "text": "Ibaka’s dunk put the Clippers ahead by 10 points early in the second quarter. Nicolas Batum later scored off an assist from George to make it 49-36, before Damian Jones scored for the Kings."}
{"game_id": "0022100475", "chunk_id": "0022100475_011", "order": 11, "role": "body", "text": "Sacramento shot 32.6% in the first half, committed 19 turnovers overall and never led."}
{"game_id": "0022100475", "chunk_id": "0022100475_012", "order": 12, "role": "body", "text": "“They have a lot of guys that have great hands, but to tell you the truth it was just me doing a bunch of dumb stuff, throwing the ball to the other team,” Haliburton said."}
{"game_id": "0022100475", "chunk_id": "0022100475_013", "order": 13, "role": "body", "text": "After the Clippers extended their lead to 19 points following back-to-back dunks by Terance Mann and Zubac and a Bledsoe layup, the Kings made their best push and got within 71-66 on Moe Harkless’ shot that banked off the glass."}
{"game_id": "0022100475", "chunk_id": "0022100475_015", "order": 15, "role": "body", "text": "Both teams were down several players who are in the NBA’s health and safety protocol. The Clippers were without Reggie Jackson and Marcus Morris Sr., while the Kings were missing De’Aaron Fox, Davion Mitchell, Marvin Bagley III, Terence Davis, Alex Len, Louis King and Neemias Queta, along with interim coach Alvin Gentry."}
{"game_id": "0022100475", "chunk_id": "0022100475_017", "order": 17, "role": "body", "text": "Clippers: Bledsoe picked up a technical in the third quarter. … Los Angeles scored only six points off 11 Sacramento turnovers in the first half."}
{"game_id": "0022100475", "chunk_id": "0022100475_018", "order": 18, "role": "body", "text": "Kings: Richaun Holmes had four points and seven rebounds in 17 minutes. Holmes had missed the previous seven games with a right eye injury and wore protective goggles. … Buddy Hield missed his first nine shots and was 1 for 12 in the first half. … Sacramento signed guard Ade Murkey to a 10-day contract. Murkey had been playing for the Kings’ G-League team in Stockton."}
{"game_id": "0022100475", "chunk_id": "0022100475_020", "order": 20, "role": "body", "text": "Clippers: Face the Nuggets in Los Angeles on Sunday. The visiting team has won each of the last three games between the two."}
{"game_id": "0022100475", "chunk_id": "0022100475_021", "order": 21, "role": "body", "text": "Kings: Host the Grizzlies on Sunday. Memphis has won its last five against Sacramento."}
