{"game_id": "0022100632", "chunk_id": "0022100632_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Moritz Wagner scored a season-high 26 points, younger brother Franz added 19 points and seven assists, and the Orlando Magic beat the Charlotte Hornets 116-109 on Friday night to snap a 10-game losing streak."}
{"game_id": "0022100632", "chunk_id": "0022100632_002", "order": 2, "role": "body", "text": "Gary Harris added 18 points for the Magic (8-35), who had not won since before Christmas."}
{"game_id": "0022100632", "chunk_id": "0022100632_003", "order": 3, "role": "body", "text": "Orlando also got a big lift off the bench from rookie Jalen Suggs, who scored 12 points on 5-of-8 shooting and had seven assists and six rebounds in his first game since fracturing his thumb on Nov. 29. The No. 5 pick in the NBA draft was a little rusty at times though, committing six turnovers in 22 1/2 minutes."}
{"game_id": "0022100632", "chunk_id": "0022100632_004", "order": 4, "role": "body", "text": "“It feels good for these guys to be able to celebrate all of the work that we have put in,” said Magic coach Jamahl Mosley. “... They have done a great job of just staying the course and continuing to compete for one another.”"}
{"game_id": "0022100632", "chunk_id": "0022100632_005", "order": 5, "role": "body", "text": "LaMelo Ball had 23 points and eight assists for the Hornets (23-20), who shot 12 of 42 from 3-point range. Miles Bridges added 20 points and Mason Plumlee had 10 points and 10 rebounds in a chippy game."}
{"game_id": "0022100632", "chunk_id": "0022100632_006", "order": 6, "role": "body", "text": "Despite the 10-game skid, the Magic had been competitive with eight of those losses by 10 points or less."}
{"game_id": "0022100632", "chunk_id": "0022100632_008", "order": 8, "role": "body", "text": "Orlando trailed by three entering the fourth quarter, but took advantage of a cold-shooting Hornets team to open the quarter on a 15-2 run. The Magic extended the lead to 13 with 2 minutes left, punctuated by Moritz Wagner's dunk — and celebratory flex — off a feed from Cole Anthony."}
{"game_id": "0022100632", "chunk_id": "0022100632_009", "order": 9, "role": "body", "text": "“At some point you get impatient and you do want it all to carry over and be a win,” Moritz Wagner said. “At a certain point in the game, we said let's play to win and get one.”"}
{"game_id": "0022100632", "chunk_id": "0022100632_010", "order": 10, "role": "body", "text": "The Hornets entered the game on a five-game win streak that included two victories over the defending NBA champion Milwaukee Bucks and one over the Philadelphia 76ers. But Charlotte went cold in the fourth quarter and the Magic quickly surged ahead behind Moritz Wagner, who finished 11 of 17 from the field with four 3-pointers."}
{"game_id": "0022100632", "chunk_id": "0022100632_011", "order": 11, "role": "body", "text": "Franz Wagner brought intensity throughout the game, and the Magic outscored the Hornets by 24 points when he was on the floor. He finished 8 of 11 from the field and added six rebounds and two blocked shots."}
{"game_id": "0022100632", "chunk_id": "0022100632_012", "order": 12, "role": "body", "text": "He said having Suggs back paid immediate dividends."}
{"game_id": "0022100632", "chunk_id": "0022100632_013", "order": 13, "role": "body", "text": "“Forget what he does on offense, the biggest thing is the energy that he brings to the floor,” Franz Wagner said of the second-team All-American while at Gonzaga."}
{"game_id": "0022100632", "chunk_id": "0022100632_014", "order": 14, "role": "body", "text": "Added Mosley: “There is a level of toughness that needs to be brought from him. The competitive edge that he continues to show. ... . He just continues to fight and compete at a high level and then shows some poise at different times.”"}
{"game_id": "0022100632", "chunk_id": "0022100632_015", "order": 15, "role": "body", "text": "Orlando’s reserves outscored Charlotte’s backups 55-19."}
{"game_id": "0022100632", "chunk_id": "0022100632_016", "order": 16, "role": "body", "text": "It was a bad loss for the Hornets, who had beaten the Magic twice this season in Orlando by a combined 16 points."}
{"game_id": "0022100632", "chunk_id": "0022100632_017", "order": 17, "role": "body", "text": "“Yeah, disappointing loss,\" Hornets coach James Borrego said. \"They played harder. They were the more aggressive team. They acted like we did for the last couple games, so credit to them. We have a ways to go.”"}
{"game_id": "0022100632", "chunk_id": "0022100632_019", "order": 19, "role": "body", "text": "Ball came up with two eye-popping plays on back-to-back possessions for the Hornets that brought fans out of their seats."}
{"game_id": "0022100632", "chunk_id": "0022100632_020", "order": 20, "role": "body", "text": "First, he shook Anthony by faking a drive to the basket before stepping back and creating more than 5 feet of space, more than enough to knock down a 3-pointer. Then he came up with a steal on the other end of the court, drove the length of the floor, and went between his legs with the ball while in the air before lofting a perfect alley-oop pass to Bridges, who finished with a resounding dunk."}
{"game_id": "0022100632", "chunk_id": "0022100632_022", "order": 22, "role": "body", "text": "Magic: Mo Bamba (sprained right toe) and Wendell Carter Jr. (hamstring) did not play."}
{"game_id": "0022100632", "chunk_id": "0022100632_023", "order": 23, "role": "body", "text": "Hornets: Kelly Oubre Jr. remained in the health and safety protocols. ... Terry Rozier had 19 points, but shot just 4 of 15 from 3-point range."}
{"game_id": "0022100632", "chunk_id": "0022100632_025", "order": 25, "role": "body", "text": "Magic: At Dallas on Saturday night."}
{"game_id": "0022100632", "chunk_id": "0022100632_026", "order": 26, "role": "body", "text": "Hornets: At New York on Monday."}
