{"game_id": "0022100157", "chunk_id": "0022100157_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Paul George has been putting the Los Angeles Clippers on his shoulders the first month of the season. He needed some help Tuesday night after running into foul trouble midway through the third quarter against the Portland Trail Blazers."}
{"game_id": "0022100157", "chunk_id": "0022100157_002", "order": 2, "role": "body", "text": "Reggie Jackson and Nicolas Batum were able to pick up the slack."}
{"game_id": "0022100157", "chunk_id": "0022100157_003", "order": 3, "role": "body", "text": "George led the Clippers with 24 points in their 117-109 victory over the Trail Blazers, but Jackson added 23 and Batum scored a season-high 22 points as Los Angeles extended its winning streak to five."}
{"game_id": "0022100157", "chunk_id": "0022100157_004", "order": 4, "role": "body", "text": "“We just keep being resilient and finding ways to win,” coach Tyron Lue said. “In the timeouts my message was I wanted us to keep our poise. We had to keep playing through it. They held it down until we got Paul back in the game.”"}
{"game_id": "0022100157", "chunk_id": "0022100157_005", "order": 5, "role": "body", "text": "George went to the bench with 5:53 remaining in the third quarter and the Clippers up 70-65. When he came back into the game with 9:55 left in the fourth, LA had extended the lead to 88-82."}
{"game_id": "0022100157", "chunk_id": "0022100157_006", "order": 6, "role": "body", "text": "Batum and Isaiah Hartenstein keyed the Clippers' offense during George's absence with eight points apiece."}
{"game_id": "0022100157", "chunk_id": "0022100157_007", "order": 7, "role": "body", "text": "“The first two or three possessions we didn’t play well. We weren’t moving the ball,” said Batum, who was 6 of 8 from beyond the arc. “Then we just started to play simple, move around and got open shots. That was a big stretch before Paul came back.”"}
{"game_id": "0022100157", "chunk_id": "0022100157_008", "order": 8, "role": "body", "text": "George, the reigning Western Conference player of the week, played only 33 minutes because of his foul trouble. Despite the decreased playing time, he was near a triple-double with nine rebounds and seven assists."}
{"game_id": "0022100157", "chunk_id": "0022100157_009", "order": 9, "role": "body", "text": "“So many guys are stepping up when we need them. You never know in a big night who it is going to be. You can’t put enough emphasis on that,” said George, who is fifth in the league in scoring at 26.7 points per game."}
{"game_id": "0022100157", "chunk_id": "0022100157_010", "order": 10, "role": "body", "text": "Damian Lillard led Portland with 27 points and Norman Powell scored 23. Jusuf Nurkic had 15 points and 13 rebounds for the Trail Blazers, who are winless in their first five road games."}
{"game_id": "0022100157", "chunk_id": "0022100157_011", "order": 11, "role": "body", "text": "The Clippers had an 83-79 lead going into the fourth quarter before going on a 13-6 run to take control. They would extend the lead to 12 in the final minute."}
{"game_id": "0022100157", "chunk_id": "0022100157_012", "order": 12, "role": "body", "text": "Blazers coach Chauncey Billups thought his team played well for the first three quarters but became undisciplined in the fourth."}
{"game_id": "0022100157", "chunk_id": "0022100157_013", "order": 13, "role": "body", "text": "“There is a different level of focus you have to have here and we didn’t get that done,” he said. “We had some shots we couldn't make late.”"}
{"game_id": "0022100157", "chunk_id": "0022100157_014", "order": 14, "role": "body", "text": "The third meeting between the teams was close compared to the first two. The Clippers won 116-86 on Oct. 25 before the Trail Blazers countered with a 111-92 victory four nights later."}
{"game_id": "0022100157", "chunk_id": "0022100157_016", "order": 16, "role": "body", "text": "Lillard looked perturbed postgame, mostly about the offseason rule emphasis that has taken away players relying on non-basketball moves to draw fouls."}
{"game_id": "0022100157", "chunk_id": "0022100157_017", "order": 17, "role": "body", "text": "“I feel like the way the game is being officiated is unacceptable. I don't want to go too deep into it but the explanations and (stuff) that is getting missed ...\" he said. “I felt like, coming in, the rule change wouldn’t affect me because I don’t trick the referees. I don’t do the trick plays.”"}
{"game_id": "0022100157", "chunk_id": "0022100157_019", "order": 19, "role": "body", "text": "The Clippers jumped out to a 13-3 lead less than three minutes into the game on the strength of three 3-pointers. The Trail Blazers would rally though and go up by 26-20 on Cody Zeller's dunk with 3:44 remaining in the period."}
{"game_id": "0022100157", "chunk_id": "0022100157_020", "order": 20, "role": "body", "text": "LA would score the last 13 points in the period to have a 33-26 advantage after 12 minutes."}
{"game_id": "0022100157", "chunk_id": "0022100157_022", "order": 22, "role": "body", "text": "Trail Blazers: The 33 points by LA in the first quarter is the most Portland has allowed in the first 12 minutes this season."}
{"game_id": "0022100157", "chunk_id": "0022100157_023", "order": 23, "role": "body", "text": "Clippers: Hartenstein came off the bench and scored a season-high 14 points in 17 minutes."}
{"game_id": "0022100157", "chunk_id": "0022100157_025", "order": 25, "role": "body", "text": "Trail Blazers: Travel to the Phoenix Suns on Wednesday. Portland won the first meeting 134-105 on Oct. 23."}
{"game_id": "0022100157", "chunk_id": "0022100157_026", "order": 26, "role": "body", "text": "Clippers: Host the Miami Heat on Thursday. LA has won the last five meetings."}
