{"game_id": "0022100726", "chunk_id": "0022100726_001", "order": 1, "role": "lead", "text": "NEW YORK -- — No Kevin Durant, no Steve Nash and nobody who could guard Scottie Barnes."}
{"game_id": "0022100726", "chunk_id": "0022100726_002", "order": 2, "role": "body", "text": "The Brooklyn Nets were missing plenty Monday night, and the Raptors rookie wasn't missing much at all."}
{"game_id": "0022100726", "chunk_id": "0022100726_003", "order": 3, "role": "body", "text": "Barnes made his first 11 shots and had 28 points and a season-high 16 rebounds, leading Toronto to a 133-97 victory over the Nets in the opener of a home-and-home series."}
{"game_id": "0022100726", "chunk_id": "0022100726_004", "order": 4, "role": "body", "text": "Blown out by Charlotte and Atlanta in their first two games after the All-Star break, the Raptors were on the good side of a romp."}
{"game_id": "0022100726", "chunk_id": "0022100726_005", "order": 5, "role": "body", "text": "“We were just really locked in and really focused,” Barnes said. “Really just wanted to bounce back after those first two games. Just really had to bring it tonight.”"}
{"game_id": "0022100726", "chunk_id": "0022100726_006", "order": 6, "role": "body", "text": "The forward was 10 for 10 at halftime, the first rookie to be perfect on 10 or more shots in a half since Derrick Rose on March 18, 2009, according to the Elias Sports Bureau. The Nets finally stopped the No. 4 pick when James Johnson blocked his shot with 7:08 left in the third quarter."}
{"game_id": "0022100726", "chunk_id": "0022100726_007", "order": 7, "role": "body", "text": "By then, Barnes was on the way to matching his highest-scoring game on a night Toronto led by as many as 39 points. He grabbed nine offensive rebounds, putting some back for baskets in his 12-for-14 performance."}
{"game_id": "0022100726", "chunk_id": "0022100726_008", "order": 8, "role": "body", "text": "“He’s going to get it no matter what,” guard Malachi Flynn said. “You don’t have to give him the ball, he’s going to find a way to go get it and those are the best players to play with.”"}
{"game_id": "0022100726", "chunk_id": "0022100726_009", "order": 9, "role": "body", "text": "Precious Achiuwa had 20 points and eight rebounds for the Raptors, who played without All-Star guard Fred VanVleet because of a sore right knee. Flynn scored 18 points in his place."}
{"game_id": "0022100726", "chunk_id": "0022100726_010", "order": 10, "role": "body", "text": "The teams play again Tuesday in Toronto, which the Nets hope will be their last game without Durant, who is expected to return soon after missing the last 20 games with a sprained left knee ligament. Kyrie Irving and Ben Simmons were also out for the Nets, and Nash was placed in health and safety protocols shortly before the game. Assistant coach Jacque Vaughn ran the team in his place."}
{"game_id": "0022100726", "chunk_id": "0022100726_011", "order": 11, "role": "body", "text": "“Hopefully our guys are ready for that and looking forward to going to Toronto and addressing the fact that we could have played better tonight and we will play better tomorrow,” Vaughn said."}
{"game_id": "0022100726", "chunk_id": "0022100726_012", "order": 12, "role": "body", "text": "The Raptors moved three games in the loss column ahead of the Nets for seventh place in the Eastern Conference. The No. 7 seed hosts No. 8 to open the play-in round, with the winner of that game earning the No. 7 seed. No. 8 hosts the winner of the 9-10 game for the No. 8 seed."}
{"game_id": "0022100726", "chunk_id": "0022100726_013", "order": 13, "role": "body", "text": "The Nets never envisioned having to worry about that, but it looks increasingly likely after their 14th loss in 17 games. LaMarcus Aldridge scored 15 points, while Cam Thomas and Bruce Brown had 14."}
{"game_id": "0022100726", "chunk_id": "0022100726_014", "order": 14, "role": "body", "text": "Brooklyn was coming off a victory at defending champion Milwaukee on Saturday, with Irving scoring 38 points. Irving was unavailable again at home Monday because he hasn't met New York City's vaccine mandate, nor will he be able to travel to Toronto."}
{"game_id": "0022100726", "chunk_id": "0022100726_015", "order": 15, "role": "body", "text": "Nash said before the game he has not had any new talks with Irving about getting the shot."}
{"game_id": "0022100726", "chunk_id": "0022100726_016", "order": 16, "role": "body", "text": "Toronto was 6 for 9 from 3-point range to take a 42-27 lead after one quarter. Barnes had 13 points on 5-for-5 shooting, then went 5 for 5 and scored 11 in the second, when Toronto led by 28 before taking a 71-48 lead to the break."}
{"game_id": "0022100726", "chunk_id": "0022100726_018", "order": 18, "role": "body", "text": "Raptors: Coach Nick Nurse said OG Anunoby (broken right finger) hadn't seen a specialist yet so had no update. ... The Raptors signed forward D.J. Wilson to a third 10-day contract."}
{"game_id": "0022100726", "chunk_id": "0022100726_019", "order": 19, "role": "body", "text": "Nets: Vaughn coached the Nets at the end of the 2019-20 season after Kenny Atkinson was fired in early March. He guided the Nets to the playoffs, where they were swept by the Raptors in the first round at Walt Disney World, shortly before Nash was hired."}
{"game_id": "0022100726", "chunk_id": "0022100726_021", "order": 21, "role": "body", "text": "Nash, who held his news conference before he was ruled out, said he doesn't think Simmons will practice this week after being bothered by back pain. He hasn't been cleared for any high-intensity work, making it unlikely the former 76ers star will be ready when the Nets visit Philadelphia on March 10."}
{"game_id": "0022100726", "chunk_id": "0022100726_023", "order": 23, "role": "body", "text": "The Raptors will be allowed to play in front of full capacity on Tuesday after being limited to 1,000 fans when they were last home on Feb. 12."}
{"game_id": "0022100726", "chunk_id": "0022100726_024", "order": 24, "role": "body", "text": "“It hasn’t been that great for our team or even our opposition coming in, the low energy that's been in that building with no one there,” Nurse said. “So especially for a place that’s full of energy, it’s a super-fun place to be when we do have funs and all that stuff, so we’re certainly looking forward to that.”"}
