{"game_id": "0022100661", "chunk_id": "0022100661_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- - CJ McCollum scored 16 points in his first game back from a collapsed lung, Jusuf Nurkic added 21 points and a season-best 22 rebounds, and the Portland Trail Blazers beat the Orlando Magic 98-88 Monday night.\nMcCollum missed 17 games over six weeks after being injured Dec. 4. The ninth-year pro started Monday but played on a minutes restriction. He made 7 of 13 shots and 2 of 4 3-pointers in 28 minutes.\nPortland beat the Magic for a 10th straight time dating to Jan. 13, 2017. The Blazers have won four of five games overall and are 4-14 on the road. The Blazers won their second straight road game after ending a nine-game road skid Saturday in Washington.\nBen McLemore added 14 points and four 3-pointers for the Blazers. Nurkic registered his team-best 18th double-double and finished one rebound shy of tying a career high.\nAssistant Jesse Mermuys coached Orlando after head coach Jamahl Mosley and assistant Nate Tibbetts entered the NBA's health and safety protocols Monday afternoon. Mosley became the NBA's 17th head coach put into the protocols this season.\nOrlando never led after scoring the game's first basket and fell to 0-20 when failing to score 100 points. Franz Wagner and Mortiz Wagner each had 14 pionts.\nThe Magic lost their second straight after ending a 10-game losing streak Friday in Charlotte. Orlando hasn't won at Amway Center since Dec. 1 and dropped to an NBA-worst 2-16 at home.\nOrlando native Anfernee Simons played in front of several dozen family members but struggled throughout with just 13 points. He was coming off a 31-point effort in Portland's win Saturday. Fellow Orlando native Nassir Little added 13 points and 10 rebounds for the Blazers.\nOrlando got within nine midway through the third quarter, but it was turned back by a 16-2 Portland burst. McLemore hit three 3-pointers and two free throws during the run.\nMcCollum scored Portland's first and last baskets of the first half and the Blazers led 54-40 at the break.\nMCCOLLUM MAKES HIS RETURN\nEven though he missed more than a month of game action, McCollum stayed in close contact with the team and regularly called and texted with first-year coach Chauncey Billups. Billups said the guard has been extraordinarily eager to get back on the floor following his lengthy absence.\n\"It's not just good to have him back on the floor; it's good to have him back around the locker room and around the guys because he's one of our leaders and he gives us life,\" Billups said of McCollum, who averaged 20.6 points prior to the injury.\nTIP-INS\nTrail Blazers: Norman Powell has cleared COVID-19 protocols but missed his fifth straight game. Billups said the guard should play Wednesday.\nMagic: Mermuys said he spent most of Monday preparing for his first shot to be a head coach at the NBA level. \"Today has been a good day with a lot of reflection and its's under some tough circumstances, obviously. But I've dreamt of being a head coach in the NBA for a really long time. This isn't that, but it's an opportunity, for sure.\" ... Wendell Carter Jr. missed his sixth straight game with a sore left hamstring.\nUP NEXT\nTrail Blazers: Play at Miami on Wednesday night.\nMagic: Play at Philadelphia on Wednesday night.\n------"}
