{"game_id": "0022100690", "chunk_id": "0022100690_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Giannis Antetokounmpo and the Milwaukee Bucks displayed a championship mentality by beating a quality opponent even when their shots didn't fall."}
{"game_id": "0022100690", "chunk_id": "0022100690_002", "order": 2, "role": "body", "text": "Of course, it helped that the Chicago Bulls were also ice cold from the field."}
{"game_id": "0022100690", "chunk_id": "0022100690_003", "order": 3, "role": "body", "text": "Antetokounmpo had 30 points and 12 rebounds to help the Bucks overcome Grayson Allen's ejection and beat the Bulls 94-90 on Friday night. Both teams shot below 40% overall and posted their worst 3-point percentages of the season."}
{"game_id": "0022100690", "chunk_id": "0022100690_004", "order": 4, "role": "body", "text": "“At the end of the day, a win is a win,” Antetokounmpo said. “We did the right things. We created good habits tonight.”"}
{"game_id": "0022100690", "chunk_id": "0022100690_005", "order": 5, "role": "body", "text": "DeMar DeRozan scored 35 points but missed a 3-pointer that would have put the Bulls ahead with 23 seconds left. Milwaukee’s Khris Middleton made two free throws with 15.8 seconds remaining to close out the scoring"}
{"game_id": "0022100690", "chunk_id": "0022100690_006", "order": 6, "role": "body", "text": "Chicago shot 18.4% (7 of 38) from beyond the arc and the Bucks made 19.4% (6 of 31) of their attempts."}
{"game_id": "0022100690", "chunk_id": "0022100690_007", "order": 7, "role": "body", "text": "Bulls coach Billy Donovan appreciated the effort his team showed even on a poor-shooting night as they played without injured guards Lonzo Ball and Zach LaVine for a fourth straight game."}
{"game_id": "0022100690", "chunk_id": "0022100690_008", "order": 8, "role": "body", "text": "Donovan was more frustrated about the hard foul on Chicago's Alex Caruso midway through the third quarter that resulted in Allen's ejection. Allen was called for a flagrant foul 2 against Caruso as the Bulls guard was driving to the basket."}
{"game_id": "0022100690", "chunk_id": "0022100690_009", "order": 9, "role": "body", "text": "“For Alex to be in the air like that and for (Allen) to take him down like that, he could have ended his career,” Donovan said. “(Allen) has a history of this. That, to me, was really dangerous. I really hope the league takes a hard look at something like that because he could have really, really seriously hurt (Caruso).”"}
{"game_id": "0022100690", "chunk_id": "0022100690_010", "order": 10, "role": "body", "text": "Caruso landed on his right side and remained on the floor under the basket for a couple of minutes before staying in the game."}
{"game_id": "0022100690", "chunk_id": "0022100690_011", "order": 11, "role": "body", "text": "“The dude just grabbed me out of the air,” Caruso said."}
{"game_id": "0022100690", "chunk_id": "0022100690_012", "order": 12, "role": "body", "text": "Bucks coach Mike Budenholzer had a different perspective."}
{"game_id": "0022100690", "chunk_id": "0022100690_013", "order": 13, "role": "body", "text": "“I think Grayson (did) nothing malicious, went to block the shot,” Budenholzer said. \"I think it’s a close call, and they went with flagrant 2. I’m not going to disagree. It’s right on the border and that’s the direction they went.”"}
{"game_id": "0022100690", "chunk_id": "0022100690_014", "order": 14, "role": "body", "text": "The first of four scheduled matchups this season between the defending NBA champion Bucks and the Central Division-leading Bulls was a down-to-the wire battle featuring 16 lead changes and 15 ties."}
{"game_id": "0022100690", "chunk_id": "0022100690_015", "order": 15, "role": "body", "text": "Neither team ever led by more than seven."}
{"game_id": "0022100690", "chunk_id": "0022100690_016", "order": 16, "role": "body", "text": "DeRozan, who went 17 of 18 on free-throw attempts, hit a jumper to put the Bulls ahead 67-66 in the last minute of the third quarter. The Bulls grabbed a four-point lead early in the final period, but the Bucks responded and moved ahead for good on Antetokounmpo's free throw with 7:24 left."}
{"game_id": "0022100690", "chunk_id": "0022100690_017", "order": 17, "role": "body", "text": "“We talk about versatility in a lot of different ways,” Budenholzer said. “And I think you’ve got to be versatile in the kind of games you can win. I’m very proud of the guys, for them to find a way to win tonight. We had to earn that.”"}
{"game_id": "0022100690", "chunk_id": "0022100690_018", "order": 18, "role": "body", "text": "Middleton had 16 points and 11 rebounds for the Bucks, while Bobby Portis added 12 points and 13 rebounds. Jrue Holiday scored 13 points."}
{"game_id": "0022100690", "chunk_id": "0022100690_019", "order": 19, "role": "body", "text": "Nikola Vucevic had 19 points and 11 rebounds for the Bulls. Matt Thomas added 11 points and went 3 of 5 on 3-point attempts."}
{"game_id": "0022100690", "chunk_id": "0022100690_021", "order": 21, "role": "body", "text": "Bulls: Donovan said Ball is expected to undergo surgery sometime next week. The Bulls had announced Thursday that Ball's injury would require surgery.  Ball is expected to require 6 to 8 weeks of recovery after his surgery. ... Donovan said LaVine has responded well to his treatment but doesn’t have an exact return date for him in mind."}
{"game_id": "0022100690", "chunk_id": "0022100690_022", "order": 22, "role": "body", "text": "Bucks: Holiday came off the bench for a second straight game as the Bucks continue to monitor his minutes. Holiday returned to action Wednesday against Memphis after missing five games with a sore left ankle. ... The Bucks are 18-3 when they have Antetokounmpo, Holiday and Middleton all on the floor."}
{"game_id": "0022100690", "chunk_id": "0022100690_024", "order": 24, "role": "body", "text": "Bulls: At Orlando on Sunday. The Bulls beat the Magic 123-88 in Orlando  on Nov. 26 and 102-98 in Chicago on Jan. 3."}
{"game_id": "0022100690", "chunk_id": "0022100690_025", "order": 25, "role": "body", "text": "Bucks: Host the Sacramento Kings on Saturday. The Bucks have won their last 10 meetings with the Kings and haven’t lost to them since Feb. 1, 2016."}
