{"game_id": "0022100028", "chunk_id": "0022100028_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — After not playing much defense in the season's first two games, the Indiana Pacers were far more stingy against the Miami Heat."}
{"game_id": "0022100028", "chunk_id": "0022100028_002", "order": 2, "role": "body", "text": "The Pacers outscored the Heat 16-5 in overtime for a 102-91 victory on Saturday night to avoid losing a third consecutive close game in which they blew a halftime lead."}
{"game_id": "0022100028", "chunk_id": "0022100028_003", "order": 3, "role": "body", "text": "“It really came down to just a hell of a lot better defense than we played in the first two games,” Pacers coach Rick Carlisle said, referring to a pair of one-point losses, including at Washington in overtime on Thursday. “The first two games, we just traded shots. When you do that, you can get bitten.”"}
{"game_id": "0022100028", "chunk_id": "0022100028_004", "order": 4, "role": "body", "text": "The Pacers allowed an average of 129 points in those games. They were ahead by 10 entering the third quarter against the Heat, who cut the deficit to one entering the fourth."}
{"game_id": "0022100028", "chunk_id": "0022100028_005", "order": 5, "role": "body", "text": "“This is more Pacers basketball,” said guard Malcolm Brogdon, who had 18 points and 14 rebounds. “Not all the missed shots, but the defensive grind-it-out style.”"}
{"game_id": "0022100028", "chunk_id": "0022100028_006", "order": 6, "role": "body", "text": "A timely bench boost also helped as reserve forward Oshae Brissett scored 18 points, including the go-ahead inside basket in overtime. The teams traded baskets to start overtime, then Brissett scored off an offensive rebound to provide a 90-88 lead and start a 9-0 run."}
{"game_id": "0022100028", "chunk_id": "0022100028_007", "order": 7, "role": "body", "text": "“We wouldn't have won that game without (Jeremy) Lamb and Oshae,” Brogdon said, making reference to Lamb adding 12 points on four threes."}
{"game_id": "0022100028", "chunk_id": "0022100028_008", "order": 8, "role": "body", "text": "Rookie guard Chris Duarte led the Pacers with 19 points."}
{"game_id": "0022100028", "chunk_id": "0022100028_009", "order": 9, "role": "body", "text": "Tyler Herro led all scorers with 30 points on 12-of-28 shooting and also grabbed 10 rebounds. All-Star guard Jimmy Butler added 19, but lamented too many missed shots in a 7-of-22 effort."}
{"game_id": "0022100028", "chunk_id": "0022100028_010", "order": 10, "role": "body", "text": "“We missed a lot of shots we normally make, myself included,” Butler said. “I've got to be better overall.”"}
{"game_id": "0022100028", "chunk_id": "0022100028_011", "order": 11, "role": "body", "text": "Bam Adebayo had 17 points and 16 rebounds for the Heat."}
{"game_id": "0022100028", "chunk_id": "0022100028_012", "order": 12, "role": "body", "text": "Butler missed shots on back-to-back possessions with the game tied in the final minute. Brogdon blocked Butler's driving layup attempt with 17 seconds remaining."}
{"game_id": "0022100028", "chunk_id": "0022100028_013", "order": 13, "role": "body", "text": "“You have to credit their defense for a lot of that,” Heat coach Erik Spoelstra said. “Our offense just didn't put up enough points. We missed some shots, and some good looks, too.”"}
{"game_id": "0022100028", "chunk_id": "0022100028_014", "order": 14, "role": "body", "text": "Duarte missed a 3-pointer in the final seconds of regulation."}
{"game_id": "0022100028", "chunk_id": "0022100028_015", "order": 15, "role": "body", "text": "The outcome was in stark contrast to the Heat's season opener, a 42-point home blowout of NBA champion Milwaukee on Thursday. Miami scored 40 points in the first quarter of that win, yet managed just 46 points and trailed by 10 at the half against Indiana."}
{"game_id": "0022100028", "chunk_id": "0022100028_017", "order": 17, "role": "body", "text": "Heat: Trailed by four after the first quarter, unlike Thursday when the Heat opened on a 22-3 run and led by 23 against the Bucks after 12 minutes. ... Herro, who scored a team-high 27 points off the bench in the opener, led Miami with 16 points in the first half."}
{"game_id": "0022100028", "chunk_id": "0022100028_018", "order": 18, "role": "body", "text": "Pacers: Missed nine consecutive shots and scored just eight points in the third quarter. ... Duarte scored seven of the team's first nine points. ... Lamb hit 3-pointers on three consecutive possessions in the first quarter."}
{"game_id": "0022100028", "chunk_id": "0022100028_020", "order": 20, "role": "body", "text": "Heat: Host Orlando on Monday night."}
{"game_id": "0022100028", "chunk_id": "0022100028_021", "order": 21, "role": "body", "text": "Pacers: Host Milwaukee on Monday night."}
