{"game_id": "0022101208", "chunk_id": "0022101208_001", "order": 1, "role": "lead", "text": "CHICAGO -- — The Charlotte Hornets looked like they had their sights set on something bigger while the Chicago Bulls delivered their worst effort in recent memory."}
{"game_id": "0022101208", "chunk_id": "0022101208_002", "order": 2, "role": "body", "text": "It added up to a game that got out of hand almost as soon as it started."}
{"game_id": "0022101208", "chunk_id": "0022101208_003", "order": 3, "role": "body", "text": "LaMelo Ball scored 24 points and Charlotte buried Chicago early in a 133-117 win on Friday night."}
{"game_id": "0022101208", "chunk_id": "0022101208_004", "order": 4, "role": "body", "text": "The Hornets tied Atlanta for ninth place in the Eastern Conference with one game left before the play-in tournament and secured their first winning season since 2015-16."}
{"game_id": "0022101208", "chunk_id": "0022101208_005", "order": 5, "role": "body", "text": "“It's fantastic, for us to have a winning season this year,” coach James Borrego said. “There were a number of things that went against us. But we still have one to go and even more after that. ... I want us to stay hungry and stay aggressive.”"}
{"game_id": "0022101208", "chunk_id": "0022101208_006", "order": 6, "role": "body", "text": "Charlotte sure looked hungry and aggressive in this one, building a 79-51 halftime lead."}
{"game_id": "0022101208", "chunk_id": "0022101208_007", "order": 7, "role": "body", "text": "The Bulls had not allowed more than 78 points in a half this season. They trailed by 37 in the third quarter and came away with their fourth straight loss."}
{"game_id": "0022101208", "chunk_id": "0022101208_008", "order": 8, "role": "body", "text": "\"I always try to be very uplifting and try to see the bright side,\" Zach LaVine said. “But I’m tired of talking. We say a lot of words and we say the right things. But we've got to figure it out. And we're not doing that, plain and simple. Everybody, top to bottom, coaching staff and everybody involved. We just have to do a better job. ... We can’t let this happen. It’s embarrassing.\""}
{"game_id": "0022101208", "chunk_id": "0022101208_009", "order": 9, "role": "body", "text": "Charlotte shot 60.5% and made 19 of 40 3-pointers, with Ball setting the tone. The All-Star point guard did all his scoring in the first half. He made 8 of 16 shots in the game, including 5 of 9 3-pointers, and finished with nine assists in 29 minutes."}
{"game_id": "0022101208", "chunk_id": "0022101208_010", "order": 10, "role": "body", "text": "Miles Bridges scored 20, and the Hornets snapped a five-game losing streak against Chicago."}
{"game_id": "0022101208", "chunk_id": "0022101208_012", "order": 12, "role": "body", "text": "The Bulls locked in the No. 6 seed in the East with what might be their most discouraging performance in coach Billy Donovan's two seasons. The crowd let the team hear it, too."}
{"game_id": "0022101208", "chunk_id": "0022101208_013", "order": 13, "role": "body", "text": "Donovan cited communication issues and put some of the blame on himself for the breakdowns on defense."}
{"game_id": "0022101208", "chunk_id": "0022101208_014", "order": 14, "role": "body", "text": "“Some of the struggles that took place in the first quarter were things that we really tried to cover today at shootaround,” he said. “To be quite honest with you, I didn't do a good enough job of creating maybe enough clarity for them on those situations. And I thought we had some blown coverages. We got hurt on some slip-outs. It was stuff that we knew that they were gonna do.”"}
{"game_id": "0022101208", "chunk_id": "0022101208_015", "order": 15, "role": "body", "text": "LaVine led the Bulls with 23 points. Coby White scored 19. DeMar DeRozan added 17 points. But coming off convincing losses to Miami, Milwaukee and Boston, the Bulls never put up a fight against Charlotte."}
{"game_id": "0022101208", "chunk_id": "0022101208_017", "order": 17, "role": "body", "text": "They gave up uncontested shots at the rim and open 3-pointers, helping the Hornets get off to a blistering start."}
{"game_id": "0022101208", "chunk_id": "0022101208_018", "order": 18, "role": "body", "text": "Charlotte made its first 11 shots, including four 3-pointers, before Rozier missed badly from beyond the arc with 4:41 left in the first quarter."}
{"game_id": "0022101208", "chunk_id": "0022101208_019", "order": 19, "role": "body", "text": "Ball, meanwhile, hit his first five shots and buried three 3s before missing a driving finger roll in the final minute of the period. He made back-to-back 3s early in the second quarter to boost the lead to 50-32, and things didn’t get better for the Bulls after that."}
{"game_id": "0022101208", "chunk_id": "0022101208_021", "order": 21, "role": "body", "text": "Hornets: F Gordon Hayward (sore left foot) missed his third consecutive game, and coach James Borrego had no update on his status for the regular-season finale against Washington on Sunday or the play-in tournament. After missing 22 games with a sprained left ankle, Hayward returned to play 17 minutes against Philadelphia on Saturday. But he has since been sidelined. Hayward is averaging 15.9 points in 49 games."}
{"game_id": "0022101208", "chunk_id": "0022101208_022", "order": 22, "role": "body", "text": "Bulls: G Lonzo Ball (left knee surgery) will remain in Chicago for the remainder of the season as he rehabs his season-ending injury. Coach Billy Donovan said the plan, at least for now, does not call for more surgery. Ball’s final game was Jan. 14, and he had surgery two weeks later. The Bulls hoped a recent 10-day shutdown in activities after he experienced discomfort would resolve the issue and allow him to return this season. But he felt pain again when he tried to ramp back up. The Bulls announced Wednesday he is out for the rest of the season. ... G Alex Caruso (bruised lower back) missed his second consecutive game, and Donovan wasn't sure if he will play in Sunday's regular-season finale at Minnesota."}
{"game_id": "0022101208", "chunk_id": "0022101208_024", "order": 24, "role": "body", "text": "Hornets: Host Washington on Sunday."}
{"game_id": "0022101208", "chunk_id": "0022101208_025", "order": 25, "role": "body", "text": "Bulls: Visit Minnesota on Sunday."}
