{"game_id": "0022100189", "chunk_id": "0022100189_001", "order": 1, "role": "lead", "text": "TORONTO -- — Jerami Grant scored 14 of his 24 points in the fourth quarter, Isaiah Stewart scored 20 and Detroit used a big finish to beat short-handed Toronto 127-121 on Saturday night, the Pistons’ fourth straight victory over the Raptors."}
{"game_id": "0022100189", "chunk_id": "0022100189_002", "order": 2, "role": "body", "text": "Killian Hayes had 13 points and a season-high 10 assists, Saddiq Bey scored 16 points, Josh Jackson had 15 points and Frank Jackson added 14 as the Pistons bounced back from Friday’s 20-point loss at Cleveland to win for the second time in three games, setting season-highs in points, assists (34), and made field goals (43)."}
{"game_id": "0022100189", "chunk_id": "0022100189_003", "order": 3, "role": "body", "text": "“That felt good,” Stewart said. “It felt really good. Just want to continue to keep this up heading into the next game.”"}
{"game_id": "0022100189", "chunk_id": "0022100189_004", "order": 4, "role": "body", "text": "The Pistons shot 6 for 8 from 3-point range in the fourth, outscoring Toronto 34-26 in the final period."}
{"game_id": "0022100189", "chunk_id": "0022100189_005", "order": 5, "role": "body", "text": "“When we’re able to share the ball like we did tonight, guys can just make plays,” Hayes said."}
{"game_id": "0022100189", "chunk_id": "0022100189_006", "order": 6, "role": "body", "text": "Detroit rookie Cade Cunningham scored seven of his 10 points in the fourth."}
{"game_id": "0022100189", "chunk_id": "0022100189_007", "order": 7, "role": "body", "text": "“He’s made for those kind of moments,” Stewart said. “He’s that kind of player.”"}
{"game_id": "0022100189", "chunk_id": "0022100189_008", "order": 8, "role": "body", "text": "Pistons coach Dwane Casey said a team meeting Saturday morning helped change the mood after Friday’s lopsided loss."}
{"game_id": "0022100189", "chunk_id": "0022100189_009", "order": 9, "role": "body", "text": "“We had a good meeting this morning, just talking about everything as far as team chemistry, discipline, and being a disciplined team, setting our culture,” Casey said. “As ugly as last night was, tonight was a thing of beauty.”"}
{"game_id": "0022100189", "chunk_id": "0022100189_010", "order": 10, "role": "body", "text": "Pascal Siakam fouled out with 25 points and 12 rebounds, Gary Trent Jr. scored 23 points and OG Anunoby had 17 for the Raptors. Toronto lost for the fourth time in five games and dropped to 2-6 at home."}
{"game_id": "0022100189", "chunk_id": "0022100189_011", "order": 11, "role": "body", "text": "“It seems like we haven’t played nearly as good a defense at home as we’ve played on the road,” Raptors coach Nick Nurse said. “We’re not sure why. We should have more energy and juice feeding off our home crowd.”"}
{"game_id": "0022100189", "chunk_id": "0022100189_012", "order": 12, "role": "body", "text": "Toronto played without guard Fred VanVleet (left groin) and forward Precious Achiuwa (right shoulder). Forward Khem Birch returned after missing the previous three games because of a sore right knee."}
{"game_id": "0022100189", "chunk_id": "0022100189_013", "order": 13, "role": "body", "text": "Raptors forward Chris Boucher left after three quarters because of a sore lower back."}
{"game_id": "0022100189", "chunk_id": "0022100189_014", "order": 14, "role": "body", "text": "Dragic started for VanVleet, his first appearance for Toronto since an Oct. 25 loss to Chicago. Dragic scored 16 points in 28 minutes."}
{"game_id": "0022100189", "chunk_id": "0022100189_015", "order": 15, "role": "body", "text": "Dalano Banton scored 12 points for the Raptors and fellow rookie Scottie Barnes had 11."}
{"game_id": "0022100189", "chunk_id": "0022100189_016", "order": 16, "role": "body", "text": "Toronto led 34-32 after one but Grant scored eight points in the second to give the visitors a narrow 65-64 lead at halftime."}
{"game_id": "0022100189", "chunk_id": "0022100189_017", "order": 17, "role": "body", "text": "Stewart shot 6 for 6 in the third and scored 12 points, but Anunoby and Dragic each had six points for the Raptors, who took a 95-93 lead to the fourth."}
{"game_id": "0022100189", "chunk_id": "0022100189_018", "order": 18, "role": "body", "text": "“Stewart was awesome tonight,” Nurse said. “Part of that was we blew some coverages on him early.”"}
{"game_id": "0022100189", "chunk_id": "0022100189_020", "order": 20, "role": "body", "text": "Pistons: Hayes had seven rebounds. … The Pistons made their first five field goal attempts of the game, then missed the next six. … Detroit scored 44 bench points. … Casey is Toronto’s career leader in coaching wins with 320 victories in six seasons. He received a warm ovation during pre-game introductions."}
{"game_id": "0022100189", "chunk_id": "0022100189_021", "order": 21, "role": "body", "text": "Raptors: Siakam had seven rebounds. … Toronto went 20 for 31 at the free throw line. … The Raptors scored 25 points off turnovers. … Banton played his fourth game in four days. Banton played at Boston Wenesday and at Philadelphia Thursday, then debuted for Toronto’s G League team Friday."}
{"game_id": "0022100189", "chunk_id": "0022100189_023", "order": 23, "role": "body", "text": "The Pistons (Cory Josesph, Trey Lyles, and Kelly Olynyk) and the Raptors (Birch, Banton, and Boucher) are the only two teams in the NBA with three Canadians on the roster. Five of the six were on the court together in the first quarter. The injured Olynyk (sprained left knee) is currently sidelined and expected to miss at least six weeks."}
{"game_id": "0022100189", "chunk_id": "0022100189_025", "order": 25, "role": "body", "text": "After being called for travelling in the third, Barnes picked up a technical foul when he made an eyeglasses gesture toward referee Jacyn Goble. It was the first technical foul of Barnes’ career."}
{"game_id": "0022100189", "chunk_id": "0022100189_027", "order": 27, "role": "body", "text": "Pistons: Host Sacramento on Monday night."}
{"game_id": "0022100189", "chunk_id": "0022100189_028", "order": 28, "role": "body", "text": "Raptors: Open a six-game trip at Portland on Monday night."}
