{"game_id": "0022100377", "chunk_id": "0022100377_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — De’Aaron Fox scored 33 points, Tyrese Haliburton had a big fourth quarter and the Sacramento Kings won their season-best third straight game, beating the Orlando Magic 142-130 on Wednesday night."}
{"game_id": "0022100377", "chunk_id": "0022100377_002", "order": 2, "role": "body", "text": "Fox shot 12 of 18 and made a pair of 3-pointers to help the Kings set a season high for scoring."}
{"game_id": "0022100377", "chunk_id": "0022100377_003", "order": 3, "role": "body", "text": "“We were very good offensively, moving the basketball, creating shots,” interim coach Alvin Gentry said. “But I don’t want to try to win games where you’re giving up 130 points. That put really, really too much pressure on the offense.”"}
{"game_id": "0022100377", "chunk_id": "0022100377_004", "order": 4, "role": "body", "text": "Haliburton added 18 points and matched his career high with 11 assists for his third NBA double-double and second this season. The 12th overall pick in the 2020 draft, Haliburton scored 11 in the fourth quarter with three 3s and a floater off the glass. He also threw a pair of alley-oop passes for dunks."}
{"game_id": "0022100377", "chunk_id": "0022100377_005", "order": 5, "role": "body", "text": "The Kings are 5-3 since Gentry replaced Luke Walton."}
{"game_id": "0022100377", "chunk_id": "0022100377_006", "order": 6, "role": "body", "text": "There wasn’t much celebrating afterward, however. As good as Sacramento’s offense was, the defense struggled most of the night. Orlando’s 130 points were 30 more than its season average."}
{"game_id": "0022100377", "chunk_id": "0022100377_007", "order": 7, "role": "body", "text": "“It’s not acceptable. It’s not going to be sustainable as we move forward,” said Haliburton, who had three of Sacramento's seven steals. “If we’re not going to guard then we have to score and we did that tonight, but it’s not something that we can continue to think that we are able to do.”"}
{"game_id": "0022100377", "chunk_id": "0022100377_008", "order": 8, "role": "body", "text": "Cole Anthony had 33 points and eight assists for the Magic (5-21), who have lost three straight and 10 of 11."}
{"game_id": "0022100377", "chunk_id": "0022100377_009", "order": 9, "role": "body", "text": "“I’m still tired,” Anthony said. “We got into a shootout and lost. That’s not how we want to play. We have to hold ourselves to a higher standard.”"}
{"game_id": "0022100377", "chunk_id": "0022100377_010", "order": 10, "role": "body", "text": "Fox scored 10 points in the third quarter when the Kings led by 16, then made a 3-pointer late to put Sacramento ahead 137-124."}
{"game_id": "0022100377", "chunk_id": "0022100377_011", "order": 11, "role": "body", "text": "Davion Mitchell had 18 points off the bench for the Kings. Terrence Davis and Harrison Barnes scored 16 apiece. Tristan Thompson added 14 points and 10 rebounds."}
{"game_id": "0022100377", "chunk_id": "0022100377_012", "order": 12, "role": "body", "text": "Marvin Bagley III, playing increased minutes since the coaching change nearly three weeks ago, had eight points in the first quarter, including back-to-back 3s, to put Sacramento ahead."}
{"game_id": "0022100377", "chunk_id": "0022100377_013", "order": 13, "role": "body", "text": "Orlando stayed close and got within 70-67 on Mo Bamba’s buzzer-beating 3 to end the second quarter."}
{"game_id": "0022100377", "chunk_id": "0022100377_014", "order": 14, "role": "body", "text": "But the Magic couldn’t keep up and faded in the fourth."}
{"game_id": "0022100377", "chunk_id": "0022100377_015", "order": 15, "role": "body", "text": "After trailing by 16 midway through the third, the Magic closed to 98-90 when Terrence Ross converted a four-point play followed by a thunderous, one-handed dunk and free throw."}
{"game_id": "0022100377", "chunk_id": "0022100377_016", "order": 16, "role": "body", "text": "“You score 130, you should give yourself a chance,” Orlando coach Jamahl Mosley said. “The defensive side of the floor is what travels. We cannot get into a shootout with certain teams.”"}
{"game_id": "0022100377", "chunk_id": "0022100377_018", "order": 18, "role": "body", "text": "Kings center Richaun Holmes was taken to the locker room in the second quarter after getting cut near his right eye when he was hit in the head by Wendell Carter Jr. The play was reviewed and determined to be a common foul. Holmes had blood trickling down his face and was being evaluated for a concussion. He was wearing a thick patch over his eye after the game."}
{"game_id": "0022100377", "chunk_id": "0022100377_020", "order": 20, "role": "body", "text": "NBA Commissioner Adam Silver was on hand for the game and watched from the stands. Silver had been in Reno for a speaking engagement earlier in the day."}
{"game_id": "0022100377", "chunk_id": "0022100377_022", "order": 22, "role": "body", "text": "A small but vocal group of fans seated in one corner of Golden 1 Center loudly cheered every play made by Orlando backup center Robin Lopez. When Lopez was fouled and went to shoot free throws, the group chanted “MVP! MVP!”"}
{"game_id": "0022100377", "chunk_id": "0022100377_024", "order": 24, "role": "body", "text": "Magic: Jalen Suggs missed his fourth consecutive game with a fractured right thumb. Suggs, who was injured Nov. 29, is expected to be re-evaluated every two weeks."}
{"game_id": "0022100377", "chunk_id": "0022100377_025", "order": 25, "role": "body", "text": "Kings: Buddy Hield missed nine of his first 10 3-point attempts. Hield entered the day second in the NBA with 87 makes from beyond the arc. … Thompson was called for a technical foul for taunting when he dunked and then turned and pointed at Ross."}
{"game_id": "0022100377", "chunk_id": "0022100377_027", "order": 27, "role": "body", "text": "Magic: Play in Los Angeles against the Clippers on Saturday. Orlando had lost 14 straight against the Clippers before winning last March."}
{"game_id": "0022100377", "chunk_id": "0022100377_028", "order": 28, "role": "body", "text": "Kings: Play the Hornets in Charlotte on Friday."}
