{"game_id": "0022100176", "chunk_id": "0022100176_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Darius Garland tied his season high with 21 points and rookie power forward Evan Mobley had 16 points and seven rebounds, leading the Cleveland Cavaliers to a 98-78 victory over the Detroit Pistons on Friday night."}
{"game_id": "0022100176", "chunk_id": "0022100176_002", "order": 2, "role": "body", "text": "Mobley, the No. 3 overall pick, also blocked three shots, made two steals and hit a pair of 3-pointers in winning his first matchup with Detroit shooting guard Cade Cunningham, the top overall pick. Cunningham had nine points, six rebounds and a season-high seven turnovers."}
{"game_id": "0022100176", "chunk_id": "0022100176_003", "order": 3, "role": "body", "text": "“I just try to do my job and be even-keeled every game, so tonight was just another one,” Mobley said. “We keep getting these wins because our coaching staff and this team are doing a good job coming together.”"}
{"game_id": "0022100176", "chunk_id": "0022100176_004", "order": 4, "role": "body", "text": "Cedi Osman scored 17 points and Jarrett Allen had 11 points and seven rebounds for the Cavaliers. They led by 27 early in the fourth quarter and coasted home with their most lopsided victory of the season. Cleveland has won five of six to improve to 8-5."}
{"game_id": "0022100176", "chunk_id": "0022100176_005", "order": 5, "role": "body", "text": "Mobley is averaging 15.3 points, 7.8 rebounds and 1.4 blocks, while Cunningham is averaging 12.0 points and 2.8 assists while shooting 30.5%. Their teams will play three more times this season."}
{"game_id": "0022100176", "chunk_id": "0022100176_006", "order": 6, "role": "body", "text": "“It was great to see Evan and Cade Cunningham on the floor together for the first time, but obviously, we were rooting for Evan,” Osman said, chuckling. “As long as he’s Rookie of the Year, we’ll be OK.”"}
{"game_id": "0022100176", "chunk_id": "0022100176_007", "order": 7, "role": "body", "text": "The Pistons were held to a season low in points, committed 23 turnovers and have the worst record in the East at 2-9. Jeremi Grant scored 16 points, Josh Jackson added 11 off the bench, and Killian Hayes had five points, five assists and six steals."}
{"game_id": "0022100176", "chunk_id": "0022100176_008", "order": 8, "role": "body", "text": "“We’ve got a lot of things we need to figure out to be good in this league,” Grant said. “It’s growing pains, but we’ve got to slow down and learn the game.”"}
{"game_id": "0022100176", "chunk_id": "0022100176_009", "order": 9, "role": "body", "text": "Isaac Okoro had nine points and nine rebounds for Cleveland, which scored 27 points off turnovers. Ricky Rubio had five points, nine assists and five steals."}
{"game_id": "0022100176", "chunk_id": "0022100176_010", "order": 10, "role": "body", "text": "The Cavaliers, who are off to their best start in five seasons, owned a 74-52 lead after three when Garland beat the buzzer with his fourth 3-pointer of the night."}
{"game_id": "0022100176", "chunk_id": "0022100176_011", "order": 11, "role": "body", "text": "“You’re not just going to come to Cleveland and roll over us anymore,” Garland said. “We've got the bark and the bite right now. Everybody is jelling and is fun to be around. It’s a lot of fun.”"}
{"game_id": "0022100176", "chunk_id": "0022100176_012", "order": 12, "role": "body", "text": "Detroit has lost six games by double-digits and is averaging an NBA-low 94.9 points. It also ranks last in the league in field goal percentage and 3-point percentage."}
{"game_id": "0022100176", "chunk_id": "0022100176_013", "order": 13, "role": "body", "text": "“We can’t come in and keep shooting ourselves in the foot,” Pistons coach Dwane Casey said. “We have to do a better job taking care of the basketball.”"}
{"game_id": "0022100176", "chunk_id": "0022100176_015", "order": 15, "role": "body", "text": "Pistons G Killian Hayes is struggling in his first full season starting at the point, shooting 30.6% from the field while averaging 6.0 points and 2.9 assists. Coach Dwane Casey believes those numbers will improve as he gets comfortable with G Cade Cunningham. “Cade isn’t a point guard, he’s a basketball player, but him handling the ball a little bit more has helped Killian’s rhythm,” Casey said. “And it will continue to improve.”"}
{"game_id": "0022100176", "chunk_id": "0022100176_017", "order": 17, "role": "body", "text": "Pistons: C Luka Garza, a 6-foot-11 rookie from Iowa, was recalled from the G League and was the first substitute in the game. … C Kelly Olynyk (left knee sprain) will miss at least six weeks after injuring his medial collateral ligament Wednesday at Houston. Olynyk is averaging 12.5 points and 5.3 rebounds in 10 games off the bench. “Without Kelly, it’s got to be a gang mentality on the boards for us,” Casey said."}
{"game_id": "0022100176", "chunk_id": "0022100176_018", "order": 18, "role": "body", "text": "Cavaliers: F Lamar Stevens (right ankle sprain) was hurt in the first quarter and did not return. … F Kevin Love missed his sixth straight game and F Lauri Markkanen sat out his fifth as they remain in the NBA’s health and safety protocols. … G Collin Sexton (left meniscus tear) is out indefinitely after tearing cartilage in his left knee Sunday at New York. Sexton is averaging a team-high 16.0 points in 11 games."}
{"game_id": "0022100176", "chunk_id": "0022100176_020", "order": 20, "role": "body", "text": "Pistons: At Toronto on Saturday night."}
{"game_id": "0022100176", "chunk_id": "0022100176_021", "order": 21, "role": "body", "text": "Cavaliers: Host Boston on Saturday night. The teams also will play Monday in Cleveland."}
