{"game_id": "0022100191", "chunk_id": "0022100191_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — The Los Angeles Clippers shut down Karl-Anthony Towns, and the Minnesota Timberwolves disappeared with him."}
{"game_id": "0022100191", "chunk_id": "0022100191_002", "order": 2, "role": "body", "text": "Paul George scored 23 points, Reggie Jackson added 21 points and the Clippers won 129-102 on Saturday night for their seventh victory in a row."}
{"game_id": "0022100191", "chunk_id": "0022100191_003", "order": 3, "role": "body", "text": "Towns was held to eight points on 3-of-11 shooting in his first single-digit scoring game since 2018. He missed all five of his 3-point attempts, ending his streak of making at least two in the season’s first 11 games."}
{"game_id": "0022100191", "chunk_id": "0022100191_004", "order": 4, "role": "body", "text": "“We’re fronting him on the post and coming with the low man,” Clippers coach Tyronn Lue said. “We just try to switch everything so he can’t get shots off. We just want to slow him down.”"}
{"game_id": "0022100191", "chunk_id": "0022100191_005", "order": 5, "role": "body", "text": "Ivica Zubac had 10 points and 12 rebounds, Eric Bledsoe had 14 points and nine assists and George had nine rebounds for the Clippers, who have taken all three meetings this month against the Wolves."}
{"game_id": "0022100191", "chunk_id": "0022100191_006", "order": 6, "role": "body", "text": "“It was an all-around team win,” Lue said, citing the Clippers' 35 assists. “Everybody did their part.”"}
{"game_id": "0022100191", "chunk_id": "0022100191_007", "order": 7, "role": "body", "text": "Anthony Edwards led Minnesota with 21 points and nine rebounds. D’Angelo Russell and Jaden McDaniels had 15 points each."}
{"game_id": "0022100191", "chunk_id": "0022100191_008", "order": 8, "role": "body", "text": "Towns led the Wolves to a 107-83 victory over the Lakers on Friday night that snapped their six-game skid. He scored 29 points on 11-of-17 shooting in that game, but the Clippers suffocated him."}
{"game_id": "0022100191", "chunk_id": "0022100191_009", "order": 9, "role": "body", "text": "“They wrestled with him, they pre-doubled him,” Wolves coach Chris Finch said. “They take the ball out of his hands every shape, way and form when he gets it. We got to find a way to solve that and it’s on me.”"}
{"game_id": "0022100191", "chunk_id": "0022100191_010", "order": 10, "role": "body", "text": "The Wolves kept it close in the first, when there were six lead changes and seven ties and they trailed by six. Then the Clippers took over and the Wolves never led again."}
{"game_id": "0022100191", "chunk_id": "0022100191_011", "order": 11, "role": "body", "text": "They outscored the Wolves 38-17 in the second to lead 70-43 at the break. They did it with George scoring just two points when he wasn’t on the bench. Jackson and reserve Terance Mann had nine points each and Bledsoe added eight. Mann finished with 16 points."}
{"game_id": "0022100191", "chunk_id": "0022100191_012", "order": 12, "role": "body", "text": "“The vets we have, they want to do anything to win,” Mann said. “They lead and we follow.”"}
{"game_id": "0022100191", "chunk_id": "0022100191_013", "order": 13, "role": "body", "text": "Towns was held scoreless in the second. He had just one free throw in the third, when the teams each scored 28 points, but the Wolves trailed 98-71 going into the fourth."}
{"game_id": "0022100191", "chunk_id": "0022100191_014", "order": 14, "role": "body", "text": "“We just haven’t all clicked at once for one reason or another,” Finch said."}
{"game_id": "0022100191", "chunk_id": "0022100191_015", "order": 15, "role": "body", "text": "George extended the Clippers' lead to 31 points early in the third, showing off a variety of moves. He dunked, hit a jumper, scored inside and fed Zubac for a basket. The two of them combined for the Clippers' first 12 points of the period."}
{"game_id": "0022100191", "chunk_id": "0022100191_017", "order": 17, "role": "body", "text": "Timberwolves: Patrick Beverley was welcomed back to Staples Center with a tribute video from his old team during a timeout in the first quarter. He formed a heart with his fingers in response to the standing ovation. He finished with five points. ... They have yet to sweep the Lakers and Clippers after playing them consecutively on the same road trip for the 16th time. They've earned a split in six of those trips. ... Fell to 2/3 on the road."}
{"game_id": "0022100191", "chunk_id": "0022100191_018", "order": 18, "role": "body", "text": "Clippers: Outrebounded the Wolves 58-40 and owned a 66-50 edge in the paint. ... Won five in a row vs. Wolves. ... They have yet to lose this month."}
{"game_id": "0022100191", "chunk_id": "0022100191_020", "order": 20, "role": "body", "text": "“Did you remind him that he won?” — Finch on Lue not liking the teams playing each other so often."}
{"game_id": "0022100191", "chunk_id": "0022100191_022", "order": 22, "role": "body", "text": "Timberwolves: Host Phoenix on Monday night."}
{"game_id": "0022100191", "chunk_id": "0022100191_023", "order": 23, "role": "body", "text": "Clippers: Host Chicago on Sunday night."}
