{"game_id": "0022101182", "chunk_id": "0022101182_001", "order": 1, "role": "lead", "text": "TORONTO -- — Pascal Siakam had 31 points and 13 rebounds, Scottie Barnes added 19 points and 14 rebounds, and the Toronto Raptors clinched a playoff berth by beating the Atlanta Hawks 118-108 on Tuesday night."}
{"game_id": "0022101182", "chunk_id": "0022101182_002", "order": 2, "role": "body", "text": "Chris Boucher scored 18 points, Gary Trent Jr. had 14, Fred VanVleet 12 and Precious Achiuwa 11. Toronto has won 12 of 16. This victory, coupled with Cleveland’s loss at Orlando, ensured the Raptors (46-33) will finish no lower than sixth in the Eastern Conference."}
{"game_id": "0022101182", "chunk_id": "0022101182_003", "order": 3, "role": "body", "text": "“We did what we set out to do in the regular season,” VanVleet said. “Now it’s time to go see what we can do.”"}
{"game_id": "0022101182", "chunk_id": "0022101182_004", "order": 4, "role": "body", "text": "Toronto rose to fifth in the East after Chicago lost to Milwaukee. The Bulls hold the tiebreaker over the Raptors."}
{"game_id": "0022101182", "chunk_id": "0022101182_005", "order": 5, "role": "body", "text": "Sixth place is the last guaranteed postseason spot, with teams finishing in the Nos. 7-10 spots headed for the play-in tournament."}
{"game_id": "0022101182", "chunk_id": "0022101182_006", "order": 6, "role": "body", "text": "Raptors coach Nick Nurse said he was proud of his players for exceeding expectations."}
{"game_id": "0022101182", "chunk_id": "0022101182_007", "order": 7, "role": "body", "text": "“They found a way to grind out enough wins to get them in this situation,” Nurse said. “I don’t think they were picked to be here, so that’s always a good accomplishment.”"}
{"game_id": "0022101182", "chunk_id": "0022101182_008", "order": 8, "role": "body", "text": "Trae Young had 26 points and 15 assists for the Hawks, who lost for the first time in six games and locked themselves into a play-in berth. Atlanta (41-38) and Brooklyn are 1 1/2 games behind seventh-place Cleveland."}
{"game_id": "0022101182", "chunk_id": "0022101182_009", "order": 9, "role": "body", "text": "“Obviously we wish we were higher in the standings but we’re not,” Young said. “We are where we are. We’ve got to take care of business with what’s ahead of us.”"}
{"game_id": "0022101182", "chunk_id": "0022101182_010", "order": 10, "role": "body", "text": "The Hawks host Washington on Wednesday before finishing the season with games at Miami and Houston. Atlanta is one game ahead of Charlotte in 10th."}
{"game_id": "0022101182", "chunk_id": "0022101182_011", "order": 11, "role": "body", "text": "Kevin Huerter scored 21 points, De’Andre Hunter had 20 and Bogdan Bogdanovic finished with 19. Clint Capela had 10 points and 14 rebounds."}
{"game_id": "0022101182", "chunk_id": "0022101182_012", "order": 12, "role": "body", "text": "“Their size definitely hurt us,” Huerter said of the Raptors, who outscored Atlanta 62-42 in the paint."}
{"game_id": "0022101182", "chunk_id": "0022101182_013", "order": 13, "role": "body", "text": "Toronto led 102-92 after Barnes made a 3-pointer with 7:38 left in the fourth quarter, but Atlanta answered with a 10-0 run, tying it at 102-all on Young’s basket with 4:29 remaining."}
{"game_id": "0022101182", "chunk_id": "0022101182_014", "order": 14, "role": "body", "text": "Young gave the Hawks their first lead of the fourth quarter by making one of two from the line with 2:53 to play, but Achiuwa made one to tie it and Barnes ended Toronto’s drought of 5 minutes, 45 seconds by converting a putback layup with 1:53 to go."}
{"game_id": "0022101182", "chunk_id": "0022101182_015", "order": 15, "role": "body", "text": "After Bogdanovic missed a 3, VanVleet connected from distance for Toronto, giving the Raptors a 108-103 lead with just over a minute left."}
{"game_id": "0022101182", "chunk_id": "0022101182_016", "order": 16, "role": "body", "text": "“It comes down to making shots and getting stops, and we didn’t do that after being able to tie that game 102-102,” Hawks coach Nate McMillan said. “You’ve got to close, you’ve got to finish that game.”"}
{"game_id": "0022101182", "chunk_id": "0022101182_018", "order": 18, "role": "body", "text": "The Raptors started 0 for 12 from 3-point range but finished 9 for 35. Thad Young made Toronto’s first 3 with 1:12 left in the first half."}
{"game_id": "0022101182", "chunk_id": "0022101182_020", "order": 20, "role": "body", "text": "Atlanta is 15-24 on the road. The Hawks have fewer road wins than any postseason contender in either conference except for the West’s 11th place Lakers, who were 11-27 on the road going into Tuesday’s game at Phoenix."}
{"game_id": "0022101182", "chunk_id": "0022101182_021", "order": 21, "role": "body", "text": "“It’s tough to win on the road in the NBA,” Huerter said."}
{"game_id": "0022101182", "chunk_id": "0022101182_023", "order": 23, "role": "body", "text": "With a playoff berth clinched, Nurse said he’ll give VanVleet and other regulars some rest in the final three games of the season. VanVleet has been playing with a sore right knee."}
{"game_id": "0022101182", "chunk_id": "0022101182_024", "order": 24, "role": "body", "text": "“We’re going to get him off his feet here for a couple days,” Nurse said."}
{"game_id": "0022101182", "chunk_id": "0022101182_026", "order": 26, "role": "body", "text": "Hawks: F Danilo Gallinari sat because of a sore left knee. … Bogdanovic had nine rebounds."}
{"game_id": "0022101182", "chunk_id": "0022101182_027", "order": 27, "role": "body", "text": "Raptors: Nurse said F OG Anunoby’s sore left thigh is “much improved” but held the injured forward out for a second straight game. … VanVleet had nine assists and Siakam had six. … Young matched his season-high with five offensive rebounds."}
{"game_id": "0022101182", "chunk_id": "0022101182_029", "order": 29, "role": "body", "text": "Hawks: Host Washington on Wednesday night"}
{"game_id": "0022101182", "chunk_id": "0022101182_030", "order": 30, "role": "body", "text": "Raptors: Host Philadelphia on Thursday night."}
