{"game_id": "0022100752", "chunk_id": "0022100752_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Reggie Jackson and Brandon Boston Jr. each scored 19 points, and the Los Angeles Clippers routed the Charlotte Hornets 115-90 on Sunday to improve to 4-3 on their current road trip."}
{"game_id": "0022100752", "chunk_id": "0022100752_002", "order": 2, "role": "body", "text": "Marcus Morris Sr. added 16 points and Luke Kennard had 14 points and 10 rebounds off the bench for the Clippers, who’ll wrap up an eight-game road trip on Monday at Indiana. Justise Winslow also had a big second half and finished with 13 points and eight rebounds as the Clippers’ bench outscored Charlotte’s reserves 62-21."}
{"game_id": "0022100752", "chunk_id": "0022100752_003", "order": 3, "role": "body", "text": "It was the Clippers’ third-largest margin of victory this season."}
{"game_id": "0022100752", "chunk_id": "0022100752_004", "order": 4, "role": "body", "text": "“We were very tough minded from the beginning. Just a scrappy team who is going to compete every night no matter who is on the floor,\" Clippers coach Tyronn Lue said. \"We have been cursed with a lot of injuries, cursed with Covid, but our guys keep fighting and competing and trying to play the right way. Every night is not going to be great and we understand that, but the biggest thing is just staying together when times get hard.”"}
{"game_id": "0022100752", "chunk_id": "0022100752_005", "order": 5, "role": "body", "text": "LaMelo Ball had 23 points, 10 assists, six rebounds and no turnovers, and Miles Bridges had 18 points and nine rebounds for the Hornets, who had their two-game win streak snapped after a disappointing outing in which they lacked energy and cohesiveness on offense in rare Sunday afternoon home game. Fans were so frustrated they began piling out in droves midway through the fourth quarter, some mumbling about the team's lack of effort."}
{"game_id": "0022100752", "chunk_id": "0022100752_006", "order": 6, "role": "body", "text": "Ball said the Hornets were “lackadaisical.”"}
{"game_id": "0022100752", "chunk_id": "0022100752_007", "order": 7, "role": "body", "text": "“We pretty much just have to get some stops,” Ball said."}
{"game_id": "0022100752", "chunk_id": "0022100752_008", "order": 8, "role": "body", "text": "The Clippers got plenty of stops."}
{"game_id": "0022100752", "chunk_id": "0022100752_009", "order": 9, "role": "body", "text": "They held the Hornets to 32.7% shooting, while shooting 52.4% from the field themselves."}
{"game_id": "0022100752", "chunk_id": "0022100752_010", "order": 10, "role": "body", "text": "Los Angeles has developed a reputation recently for being a comeback team — they battled from a 35-point deficit to beat the Washington Wizards on Tuesday — but they left no doubt about this one with an explosive second half."}
{"game_id": "0022100752", "chunk_id": "0022100752_011", "order": 11, "role": "body", "text": "“Definitely it feels good to have a lead (most of) the time and not get down by 20,\" Boston said."}
{"game_id": "0022100752", "chunk_id": "0022100752_012", "order": 12, "role": "body", "text": "The Clippers jumped out to a 51-47 halftime lead after holding the Hornets to 31.6% shooting in the first half."}
{"game_id": "0022100752", "chunk_id": "0022100752_013", "order": 13, "role": "body", "text": "Los Angeles kept the pressure on and led by eight entering the fourth quarter, but quickly extended the lead to 20 behind Winslow, who did his work on both ends of the court, and Boston Jr."}
{"game_id": "0022100752", "chunk_id": "0022100752_014", "order": 14, "role": "body", "text": "Winslow and Boston combined to shoot 9 of 12 from the floor for 22 points in the pivotal fourth quarter. The Clippers' reserves were playing so well in the fourth quarter that Lue never needed to go back to his starters — and his reserves still outscored the Hornets 31-14 in the final frame."}
{"game_id": "0022100752", "chunk_id": "0022100752_015", "order": 15, "role": "body", "text": "“I thought Justise (Winslow) was great and also, Luke (Kennard),\" Lue said. “So, they did a good job with just playing with pace and I thought defensively we were terrific tonight.”"}
{"game_id": "0022100752", "chunk_id": "0022100752_016", "order": 16, "role": "body", "text": "Hornets coach James Borrego emptied his bench with about 3 minutes to play with the Clippers leading by 22."}
{"game_id": "0022100752", "chunk_id": "0022100752_017", "order": 17, "role": "body", "text": "“They are a really good defense and offensively, we just wouldn’t drive, we couldn’t make shots, we made poor decisions,” Borrego said. \"They sped us up and are a really good defense, so we have to give them credit. We hung in there as long as we could and we struggled at the end of the third and the end of the fourth.”"}
{"game_id": "0022100752", "chunk_id": "0022100752_019", "order": 19, "role": "body", "text": "Clippers: Nic Batum did not play because of lower back soreness. ... Outrebounded Charlotte 58-46."}
{"game_id": "0022100752", "chunk_id": "0022100752_020", "order": 20, "role": "body", "text": "Hornets: Kelly Oubre Jr. missed his second straight game with a sprained ankle. ... Bridges was called for a technical foul for the second straight game. ... Mason Plumlee had 10 points and 10 rebounds."}
{"game_id": "0022100752", "chunk_id": "0022100752_022", "order": 22, "role": "body", "text": "Clippers: At Indiana on Monday night."}
{"game_id": "0022100752", "chunk_id": "0022100752_023", "order": 23, "role": "body", "text": "Hornets: At Boston on Wednesday night."}
