{"game_id": "0022100520", "chunk_id": "0022100520_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Ja Morant scored 41 points, Desmond Bane added 20 and the Memphis Grizzlies overcame a 14-point second-half deficit to beat the Los Angeles Lakers 104-99 on Wednesday night."}
{"game_id": "0022100520", "chunk_id": "0022100520_002", "order": 2, "role": "body", "text": "LeBron James led Los Angeles with 37 points — a day short of his 37th birthday — and 13 rebounds and a season-high eight 3-pointers. Russell Westbrook added a triple-double with 16 points, 10 rebounds and 12 assists."}
{"game_id": "0022100520", "chunk_id": "0022100520_003", "order": 3, "role": "body", "text": "The Grizzlies improved to 22-14 with their third straight victory, while the Lakers fell to 17-19 with their sixth loss in seven games."}
{"game_id": "0022100520", "chunk_id": "0022100520_004", "order": 4, "role": "body", "text": "Morant, making a strong bid for the All-Star Game, scored 25 of his points in the second half, including 14 in the third quarter. He scored 11 of the Grizzlies’ final 15 points."}
{"game_id": "0022100520", "chunk_id": "0022100520_005", "order": 5, "role": "body", "text": "“What an unbelievable night by Ja,” Memphis coach Taylor Jenkins said. “When he got going it kind of fueled everyone else. We’ve said it from Day 1, he’s built for moments like this.”"}
{"game_id": "0022100520", "chunk_id": "0022100520_006", "order": 6, "role": "body", "text": "Jenkins also was impressed with Morant’s defense (two steals, two blocks) and rebounding. He had 10 rebounds."}
{"game_id": "0022100520", "chunk_id": "0022100520_007", "order": 7, "role": "body", "text": "“I was taking what the defense gave me and it turned out good for us,” Morant said. ”That’s normally how I attack every game. Tonight was just my night.”"}
{"game_id": "0022100520", "chunk_id": "0022100520_008", "order": 8, "role": "body", "text": "Memphis trailed in the second half until Tyus Jones hit in a floater for a 93-92 lead with 6:50 left. Morant followed with consecutive 3-pointers for a 99-92 advantage with 4:28 to go. Bane sealed the win with two free throws with 5.1 seconds to go"}
{"game_id": "0022100520", "chunk_id": "0022100520_009", "order": 9, "role": "body", "text": "Ahead by six at the half, the Lakers pushed their advantage to 14 at 80-66 during a third quarter in which Los Angeles made six 3-pointers. James had three of those."}
{"game_id": "0022100520", "chunk_id": "0022100520_010", "order": 10, "role": "body", "text": "The Grizzlies were able to battle back and trim the lead to five at 83-78 at the end of the quarter. Morant made in a deep 3-pointer at the buzzer."}
{"game_id": "0022100520", "chunk_id": "0022100520_011", "order": 11, "role": "body", "text": "In the fourth quarter, the Lakers were slowed by four-minute scoring drought which allowed the Grizzlies to erase a 92-87 deficit with 12 straight points. With 8:12 to go, Memphis led 99-92"}
{"game_id": "0022100520", "chunk_id": "0022100520_012", "order": 12, "role": "body", "text": "“Coming out in the third quarter it got away from us,” Lakers forward Malik Monk said. “It was super frustrating because we’ve been doing that all year.”"}
{"game_id": "0022100520", "chunk_id": "0022100520_013", "order": 13, "role": "body", "text": "Grizzlies starting forward Dillon Brooks sat out his third straight game because of health and safety protocols."}
{"game_id": "0022100520", "chunk_id": "0022100520_015", "order": 15, "role": "body", "text": "Grizzlies: Morant and James became the third pair of opponents in NBA history to each amass 35 or more points, 10 or more rebounds and six or more 3-pointers in a game... . . .John Konchar entered the league’s health and safety protocols Tuesday after making the first two starts of his career."}
{"game_id": "0022100520", "chunk_id": "0022100520_016", "order": 16, "role": "body", "text": "Lakers: Interim head coach David Fizdale said Morant has quickly blossomed into an elite player. “You are talking about one of the best players in this league period. Period. The guy is a true superstar.”. . . Austin Reaves and Kent Bazemore tested out of the NBA’s health and safety protocols Wednesday. Reaves missed the previous six games and Bazemore the last five."}
{"game_id": "0022100520", "chunk_id": "0022100520_018", "order": 18, "role": "body", "text": "Lakers: Host Portland on Friday night."}
{"game_id": "0022100520", "chunk_id": "0022100520_019", "order": 19, "role": "closing", "text": "Grizzlies: Host San Antonio on Friday night."}
