{"game_id": "0022100280", "chunk_id": "0022100280_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Reggie Jackson scored 21 points and the Los Angeles Clippers got back on track with a 107-96 victory over the lowly Detroit Pistons on Friday."}
{"game_id": "0022100280", "chunk_id": "0022100280_002", "order": 2, "role": "body", "text": "After dropping three of four games, the Clippers never trailed."}
{"game_id": "0022100280", "chunk_id": "0022100280_003", "order": 3, "role": "body", "text": "“To have a comfortable lead was good,” coach Tyronn Lue said. “We made some shots, did a good job of getting to the paint and made the right play. We had 16 assists in the first half, so moving the basketball was good to see.”"}
{"game_id": "0022100280", "chunk_id": "0022100280_004", "order": 4, "role": "body", "text": "Jackson missed his first five shots, but was 8 of 14 the rest of the way. Terance Mann added 16 points and tied a career high with 10 rebounds for the fifth double-double of his career."}
{"game_id": "0022100280", "chunk_id": "0022100280_005", "order": 5, "role": "body", "text": "Jerami Grant had 20 points and 10 rebounds for Detroit, which has dropped five straight. Trey Lyles added 13 points."}
{"game_id": "0022100280", "chunk_id": "0022100280_006", "order": 6, "role": "body", "text": "Eric Bledsoe scored 11 straight points in the first quarter to help the Clippers take a 13-4 lead. They extended their advantage to 64-40 at halftime before extending it to a 29-point cushion midway through the third quarter."}
{"game_id": "0022100280", "chunk_id": "0022100280_007", "order": 7, "role": "body", "text": "Detroit went on a 21-8 run late in the fourth quarter as it cut the deficit by more than half."}
{"game_id": "0022100280", "chunk_id": "0022100280_008", "order": 8, "role": "body", "text": "“We don’t have the luxury of being a young team and having trouble scoring to come in and not play desperate to start the game,\" Pistons coach Dwane Casey said. \"That was the message at halftime. We just weren’t competing at the level you need to compete to be a playoff team like the Clippers. And once we decided to do that, we did.”"}
{"game_id": "0022100280", "chunk_id": "0022100280_010", "order": 10, "role": "body", "text": "Isaiah Stewart returned from his two game suspension after being involved in an altercation with the Lakers’ LeBron James and had four points and 10 rebounds."}
{"game_id": "0022100280", "chunk_id": "0022100280_011", "order": 11, "role": "body", "text": "Casey said before the game that Stewart was remorseful for what took place and that it was an unfortunate situation for both players. James was suspended for one game"}
{"game_id": "0022100280", "chunk_id": "0022100280_012", "order": 12, "role": "body", "text": "“I think if you put nine men in that same situation, they probably would’ve reacted — right, wrong or indifferent — in the same manner. Maybe not as extended as Isaiah took it, which was unfortunate,” Casey said."}
{"game_id": "0022100280", "chunk_id": "0022100280_013", "order": 13, "role": "body", "text": "Stewart said after the game that he would address it one more time, and that he felt the elbow thrown by James was intentional."}
{"game_id": "0022100280", "chunk_id": "0022100280_014", "order": 14, "role": "body", "text": "“I watched the film. Me, personally, like I said, I didn’t feel like it was an accident. But this is my last time addressing it,\" Stewart said. “My main focus right now is on my team and my teammates, getting back to playing basketball. I’m not going to let that define who I am.\""}
{"game_id": "0022100280", "chunk_id": "0022100280_016", "order": 16, "role": "body", "text": "Bledsoe had 15 points after scoring 15 combined in his last four games. He was 6 of 9 from the floor, including three 3-pointers."}
{"game_id": "0022100280", "chunk_id": "0022100280_017", "order": 17, "role": "body", "text": "“I have to do a better job of being aggressive. I need to try to catch and shoot more without hesitating,” said Bledsoe, who was 6 of 18 shooting in the previous four games."}
{"game_id": "0022100280", "chunk_id": "0022100280_018", "order": 18, "role": "body", "text": "Lue was pleased to see Bledsoe shoot the ball well, especially in a game in which Paul George and Jackson had their struggles."}
{"game_id": "0022100280", "chunk_id": "0022100280_020", "order": 20, "role": "body", "text": "It is the second straight game where the Pistons have not led at some point. The Milwaukee Bucks scored the first 14 points Wednesday night to cruise to a 114-93 victory."}
{"game_id": "0022100280", "chunk_id": "0022100280_022", "order": 22, "role": "body", "text": "Pistons: Cade Cunningham, the first overall pick in the draft, shot only 3 of 13 from the field and had 10 points along with six rebounds and six assists. ... Killian Hayes missed his fourth straight game due to a left thumb injury."}
{"game_id": "0022100280", "chunk_id": "0022100280_023", "order": 23, "role": "body", "text": "Clippers: George had 12 points, but was 5 of 19 from the field and 1 of 9 on 3-pointers. ... Ivan Zubac had 10 points and 13 rebounds for his fifth double-double in November. ... Lue experimented by having Serge Ibaka and Isaiah Hartenstein on the floor at the same time. Hartenstein's minutes have decreased since Ibaka returned earlier this week."}
{"game_id": "0022100280", "chunk_id": "0022100280_025", "order": 25, "role": "body", "text": "Pistons: At Los Angeles Lakers on Sunday night."}
{"game_id": "0022100280", "chunk_id": "0022100280_026", "order": 26, "role": "body", "text": "Clippers: Host Golden State on Sunday."}
