{"game_id": "0022101069", "chunk_id": "0022101069_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — The 76ers acquired James Harden to score big baskets when the game is on the line."}
{"game_id": "0022101069", "chunk_id": "0022101069_002", "order": 2, "role": "body", "text": "He had the ball and tried, tried and tried again over the final 2:25 — and a Raptors team fighting for an Eastern Conference playoff spot kept Harden in check."}
{"game_id": "0022101069", "chunk_id": "0022101069_003", "order": 3, "role": "body", "text": "“He's got all the options,” Raptors coach Nick Nurse said. “He went to the float game and we made some plays on it. That's really the defense.”"}
{"game_id": "0022101069", "chunk_id": "0022101069_004", "order": 4, "role": "body", "text": "Pascal Siakam had 26 points and 10 rebounds, and Precious Achiuwa scored 21 points to lead Toronto to a 93-88 win over Philadelphia on Sunday night."}
{"game_id": "0022101069", "chunk_id": "0022101069_005", "order": 5, "role": "body", "text": "Chris Boucher had 12 points and 14 rebounds to help the Raptors extend their road winning streak to six."}
{"game_id": "0022101069", "chunk_id": "0022101069_006", "order": 6, "role": "body", "text": "Harden missed two free throws with the Sixers down 87-86 and missed a driving layup with 59 seconds left and the Sixers down 89-86. The Sixers had the ball with 37.3 seconds left and Joel Embiid lost the ball for a costly turnover."}
{"game_id": "0022101069", "chunk_id": "0022101069_007", "order": 7, "role": "body", "text": "Scottie Barnes missed two free throws that kept Toronto's lead at 90-88 with 7.1 seconds left."}
{"game_id": "0022101069", "chunk_id": "0022101069_008", "order": 8, "role": "body", "text": "Harden, though, missed again when he was whistled for an offensive foul against Boucher on a drive down the lane that crushed the Sixers' comeback bid."}
{"game_id": "0022101069", "chunk_id": "0022101069_009", "order": 9, "role": "body", "text": "“We were trying to make it hard for him in the paint,” Boucher said."}
{"game_id": "0022101069", "chunk_id": "0022101069_010", "order": 10, "role": "body", "text": "Yes, the Sixers had their chances. But the Raptors were clearly the aggressors against a stagnant Sixers team that played at half-speed compared to their division rival. The Raptors had a whopping 20 offensive rebounds and held an overall 56-40 edge on the glass. The Sixers made only four baskets and had seven turnovers in the fourth quarter."}
{"game_id": "0022101069", "chunk_id": "0022101069_011", "order": 11, "role": "body", "text": "“We just got our butt kicked. That’s all I have,” coach Doc Rivers said."}
{"game_id": "0022101069", "chunk_id": "0022101069_012", "order": 12, "role": "body", "text": "Embiid had 21 points and 13 rebounds for Philadelphia. He shot only 6 of 20 overall from the floor and missed all three 3-pointers. Tyrese Maxey scored 19 points and Harden had 17."}
{"game_id": "0022101069", "chunk_id": "0022101069_013", "order": 13, "role": "body", "text": "“I just got to be better, it’s simple,” Harden said."}
{"game_id": "0022101069", "chunk_id": "0022101069_014", "order": 14, "role": "body", "text": "Maxey continued to shine as Philly’s bundle of energy. His 3 late in the third put the Sixers back in the lead that was just one of a handful of tweet-worthy highlights. His hustle helped the Sixers take a 74-69 lead into the fourth."}
{"game_id": "0022101069", "chunk_id": "0022101069_015", "order": 15, "role": "body", "text": "The Sixers just couldn't hold onto their leads."}
{"game_id": "0022101069", "chunk_id": "0022101069_016", "order": 16, "role": "body", "text": "The Raptors outscored the Sixers 30-17 in the second quarter to erase a 16-point deficit and take a 57-54 lead into the break. The Sixers got little offensive punch out Embiid and Harden. Embiid missed eight of 12 shots and the two combined for just 16 points. Embiid came in with a slim lead over LeBron James (30.0 vs. 29.8) in the NBA scoring race, and Harden averaged 22.6 points."}
{"game_id": "0022101069", "chunk_id": "0022101069_017", "order": 17, "role": "body", "text": "It was a needed win for the Raptors as the regular season winds down. The Raptors are fighting for the sixth seed — they started a game back of Cleveland — and want to finish there so they can avoid the play-in tournament for the seven through 10 seeds."}
{"game_id": "0022101069", "chunk_id": "0022101069_018", "order": 18, "role": "body", "text": "“Can we go out there and look these really good teams eye-to-eye and go compete and believe we can win? And execute to win?” Nurse asked. “If we believe we can win and compete as hard as we've been competing, we're going to get our share of wins. We deserve to get our share of wins.”"}
{"game_id": "0022101069", "chunk_id": "0022101069_020", "order": 20, "role": "body", "text": "Raptors: Malachi Flynn sat out with a strained hamstring and OG Anunoby missed his 14th straight with a fractured finger. Fred VanFleet sat out with a nagging knee injury, but was expected to play Monday against the Bulls."}
{"game_id": "0022101069", "chunk_id": "0022101069_021", "order": 21, "role": "body", "text": "76ers: Embiid was questionable with back soreness and could get a rest day Monday when the Sixers host Miami in the back-to-back set. Embiid is an NBA MVP front-runner but at this point, the Sixers are more concerned with keeping their big man fresh for the playoffs."}
{"game_id": "0022101069", "chunk_id": "0022101069_023", "order": 23, "role": "body", "text": "Raptors: Play Monday at Chicago."}
