{"game_id": "0022100084", "chunk_id": "0022100084_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Jimmy Butler scored 27 points, Tyler Herro added 22 and the Miami Heat used a strong shooting performance to rout the Memphis Grizzlies 129-103 on Saturday night."}
{"game_id": "0022100084", "chunk_id": "0022100084_002", "order": 2, "role": "body", "text": "Duncan Robinson and Kyle Lowry scored 15 points apiece. Lowry added eight assists and the Heat made 21 3-pointers, one short of the franchise record set last May at Milwaukee."}
{"game_id": "0022100084", "chunk_id": "0022100084_003", "order": 3, "role": "body", "text": "“We’ve got a lot of guys who can score the ball,” Butler said. “We know that. But we’re also picking it up on the defensive end. … Guys are just gaining more and more confidence.”"}
{"game_id": "0022100084", "chunk_id": "0022100084_004", "order": 4, "role": "body", "text": "The performance was particularly satisfying for Robinson, who has struggled from outside the arc this season. Entering the game, Robinson was shooting right at 28% from 3-point range, making only 12 of 43 shots. That included going 2 of 11 from distance in Friday night’s win over Charlotte."}
{"game_id": "0022100084", "chunk_id": "0022100084_005", "order": 5, "role": "body", "text": "He made 5 of 10 3-pointers against Memphis."}
{"game_id": "0022100084", "chunk_id": "0022100084_006", "order": 6, "role": "body", "text": "“The way I started this year, obviously not up to what I know I’m capable of,” Robinson said. “With that being said, and I can see a couple go (in), it helps with some confidence.”"}
{"game_id": "0022100084", "chunk_id": "0022100084_007", "order": 7, "role": "body", "text": "Heat coach Erik Spoelstra and Miami teammates have encouraged Robinson to keep shooting, even after the poor performance against the Hornets."}
{"game_id": "0022100084", "chunk_id": "0022100084_008", "order": 8, "role": "body", "text": "“If you’re going to be a great shooter in this league, you have to have a quick memory. I think that’s where Duncan’s really grown over the years,” Spoelstra said."}
{"game_id": "0022100084", "chunk_id": "0022100084_009", "order": 9, "role": "body", "text": "Ja Morant and De’Anthony Melton each had 20 points for Grizzlies. Desmond Bane finished with 17 points and Kyle Anderson scored 13."}
{"game_id": "0022100084", "chunk_id": "0022100084_010", "order": 10, "role": "body", "text": "“We got punched in the mouth,” Melton said after the Heat built an early lead they never surrendered. “I think we’ve got to understand that facing veteran teams like that, they’re going to come out (fast), and we’ve got to respond. And we’ve got to respond quick.”"}
{"game_id": "0022100084", "chunk_id": "0022100084_011", "order": 11, "role": "body", "text": "Through three quarters, the Heat kept shooting and kept making. The 56% shooting at that point included 18 of 28 from 3-point range and a lead that had swelled to 26 points. That was enough for Miami’s fifth win of the first six games."}
{"game_id": "0022100084", "chunk_id": "0022100084_012", "order": 12, "role": "body", "text": "“We’ve got to lock in for the game and come out and play hard for a full 48 (minutes),” Anderson said. “We don’t want to give teams any advantages or things like that. So, we’ve got to come out ready to go.”"}
{"game_id": "0022100084", "chunk_id": "0022100084_014", "order": 14, "role": "body", "text": "Heat: C Bam Adebayo missed the game with a left knee bruise. He was listed as questionable until an hour before the game. In his pregame availability, Spoelstra expected Adebayo to play. ... Dewayne Dedmon started in Adebayo’s place. ... Miami connected on its first five 3-pointers of the game. ... All five wins have been by double digits."}
{"game_id": "0022100084", "chunk_id": "0022100084_015", "order": 15, "role": "body", "text": "Grizzlies: G/F Dillon Brooks, who has not played this season recovering from a fractured left hand, is “trending real well,” according to coach Taylor Jenkins. “He’s going to have a follow up in the next week, but hopefully when we get that follow up, he’s going to be ramping up even more.” ... Jenkins successfully challenged a play in the second quarter and a foul against C Steven Adams was overturned. ... It was Memphis’ first wire-to-wire loss since April 11 against Indiana."}
{"game_id": "0022100084", "chunk_id": "0022100084_017", "order": 17, "role": "body", "text": "Udonis Haslem got his first minutes of the season, officially making this his 19th season in the NBA — all with the Heat."}
{"game_id": "0022100084", "chunk_id": "0022100084_018", "order": 18, "role": "body", "text": "He’s now the fifth player in league history to appear in at least 19 seasons, all with one team, joining Dallas’ Dirk Nowitzki, the Los Angeles Lakers’ Kobe Bryant, San Antonio’s Tim Duncan and Utah’s John Stockton."}
{"game_id": "0022100084", "chunk_id": "0022100084_019", "order": 19, "role": "body", "text": "Haslem had the final basket of the night for the Heat, one that led to teammates getting out of their seats on the bench in celebration."}
{"game_id": "0022100084", "chunk_id": "0022100084_021", "order": 21, "role": "body", "text": "The scoreboards at FedExForum went on the fritz in the first quarter leaving only the main scoreboard over the center of the court working with the score and time. The clocks over each basket were working as far as the time and shot clock. The entire system came back on early in the fourth quarter."}
{"game_id": "0022100084", "chunk_id": "0022100084_023", "order": 23, "role": "body", "text": "Heat: Travel to Dallas on Tuesday to face the Mavericks."}
{"game_id": "0022100084", "chunk_id": "0022100084_024", "order": 24, "role": "body", "text": "Grizzlies: Play the first of two consecutive home games against the Denver Nuggets on Monday."}
