{"game_id": "0022100500", "chunk_id": "0022100500_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Nikola Jokic kept the Denver Nuggets from blowing another game with a history-making performance."}
{"game_id": "0022100500", "chunk_id": "0022100500_002", "order": 2, "role": "body", "text": "He had 26 points and 22 rebounds, rallying Denver past the Los Angeles Clippers 103-100 on Sunday night after the Nuggets wasted a 17-point lead."}
{"game_id": "0022100500", "chunk_id": "0022100500_003", "order": 3, "role": "body", "text": "Jokic also had eight assists, becoming the first player to record 25-plus points, 20-plus rebounds and five-plus assists in consecutive games since Charles Barkley in 1988."}
{"game_id": "0022100500", "chunk_id": "0022100500_004", "order": 4, "role": "body", "text": "The Nuggets led by 19 points against Charlotte in their previous game at home and lost just before Christmas. It made for a tough holiday at coach Michael Malone's house."}
{"game_id": "0022100500", "chunk_id": "0022100500_005", "order": 5, "role": "body", "text": "“I wasn’t very much fun to be around. I was kind of a scrooge,” he said. “I apologized to my wife, my daughters and my dogs.”"}
{"game_id": "0022100500", "chunk_id": "0022100500_006", "order": 6, "role": "body", "text": "Jokic had 29 points, 21 rebounds and five assists in the Charlotte defeat. For a while Sunday, it looked as if the Nuggets would give away another one, this time on the road."}
{"game_id": "0022100500", "chunk_id": "0022100500_007", "order": 7, "role": "body", "text": "Luke Kennard almost made it happen. He came off the bench from foul trouble and hit a 3-pointer from the right corner with 19 seconds remaining that got the Clippers to 101-100."}
{"game_id": "0022100500", "chunk_id": "0022100500_008", "order": 8, "role": "body", "text": "“It was a little bit of an adventure there at the end,” Malone said."}
{"game_id": "0022100500", "chunk_id": "0022100500_009", "order": 9, "role": "body", "text": "Jokic was trying to catch an inbounds pass when he got fouled by Eric Bledsoe, sending them both crashing into the Clippers bench. Jokic made both free throws to extend the Nuggets' lead to three."}
{"game_id": "0022100500", "chunk_id": "0022100500_010", "order": 10, "role": "body", "text": "Brandon Boston Jr. took the Clippers’ final shot under heavy pressure from Davon Reed, but his potential tying 3-pointer was off the mark at the buzzer. Reed just signed a second 10-day contract with Denver."}
{"game_id": "0022100500", "chunk_id": "0022100500_011", "order": 11, "role": "body", "text": "Boston and Bledsoe led the Clippers with 18 points apiece. Bledsoe had 10 assists. Ivica Zubac had 17 points and 11 rebounds."}
{"game_id": "0022100500", "chunk_id": "0022100500_012", "order": 12, "role": "body", "text": "The Clippers were playing without Paul George, who is sidelined for up to a month with an ulnar collateral ligament tear in his right elbow. They lost for the fourth time in five games."}
{"game_id": "0022100500", "chunk_id": "0022100500_013", "order": 13, "role": "body", "text": "“We're missing our best closer,” Terance Mann said. “We got to a close game and nearly stole it.”"}
{"game_id": "0022100500", "chunk_id": "0022100500_014", "order": 14, "role": "body", "text": "After scoring just five points in the third, Jokic scored nine in the fourth in addition to pulling down seven rebounds."}
{"game_id": "0022100500", "chunk_id": "0022100500_015", "order": 15, "role": "body", "text": "Will Barton added 17 points for Denver, which snapped a two-game skid."}
{"game_id": "0022100500", "chunk_id": "0022100500_016", "order": 16, "role": "body", "text": "“We needed this one,” Malone said. “We responded the way we needed to, getting stops, sharing the ball.”"}
{"game_id": "0022100500", "chunk_id": "0022100500_017", "order": 17, "role": "body", "text": "Jokic helped the Nuggets tie the game at 93-all in the fourth. He fed Barton for the tying jumper after scoring on a hook shot and hitting a pair of free throws. Jokic's 3-pointer gave Denver its first lead of the fourth, 96-94."}
{"game_id": "0022100500", "chunk_id": "0022100500_018", "order": 18, "role": "body", "text": "The Clippers erased a 17-point deficit in the third. They got outscored 10-2 to open the quarter, then closed on a 26-5 run to lead 83-79 going into the fourth."}
{"game_id": "0022100500", "chunk_id": "0022100500_019", "order": 19, "role": "body", "text": "Four reserves helped key the spurt, with Boston and Serge Ibaka hitting 3-pointers and Amir Coffey scoring on a drive. Bledsoe added seven points."}
{"game_id": "0022100500", "chunk_id": "0022100500_020", "order": 20, "role": "body", "text": "“Our guys did a good job and we were in position to win the game,” Clippers coach Tyronn Lue said. “I was happy and pleased with the way our young guys played.”"}
{"game_id": "0022100500", "chunk_id": "0022100500_021", "order": 21, "role": "body", "text": "Monte Morris scored all five Denver points. The Clippers' defense denied Jokic around the rim, leading to transition baskets for them on the offensive end."}
{"game_id": "0022100500", "chunk_id": "0022100500_022", "order": 22, "role": "body", "text": "“We built a 17-point lead and then all of a sudden everything changed,\" Malone said. “The Clippers became very aggressive, they got out and ran and had us on our heels. To weather that storm and stay together was great to see.”"}
{"game_id": "0022100500", "chunk_id": "0022100500_023", "order": 23, "role": "body", "text": "A total of four players were out because of health and safety protocols, including Clippers starter Reggie Jackson. Fellow starter Marcus Morris exited protocols before the game, but remains out while he goes through reconditioning. Denver's Michael Porter Jr. and Bol Bol were in protocols."}
{"game_id": "0022100500", "chunk_id": "0022100500_025", "order": 25, "role": "body", "text": "“It’s almost become normal and it’s scary because you don’t really want this to be what normal is.” — Malone on the COVID-19 absences plaguing the league."}
{"game_id": "0022100500", "chunk_id": "0022100500_027", "order": 27, "role": "body", "text": "Nuggets: Jokic now has six games of 20-plus points and 20-plus rebounds, the most in team history since Denver joined the NBA in 1976-77. The previous record of five was held by Marcus Camby. ... They got back to .500 at 16-16. ... They traveled without six players."}
{"game_id": "0022100500", "chunk_id": "0022100500_028", "order": 28, "role": "body", "text": "Clippers: George complained of soreness in his elbow after Wednesday's win at Sacramento and had an MRI, which revealed the ligament tear. ... Backup big man Isaiah Hartenstein missed his second straight game with a left ankle sprain. ... Signed Xavier Moon to a 10-day contract under the league's COVID-related hardship allowance."}
{"game_id": "0022100500", "chunk_id": "0022100500_030", "order": 30, "role": "body", "text": "Nuggets: At Golden State on Tuesday."}
{"game_id": "0022100500", "chunk_id": "0022100500_031", "order": 31, "role": "body", "text": "Clippers: Host Brooklyn on Monday to complete a back-to-back."}
