{"game_id": "0022101052", "chunk_id": "0022101052_001", "order": 1, "role": "lead", "text": "MIAMI -- — Tyler Herro got through an ankle scare and scored 26 points, Duncan Robinson scored 19 points in 19 minutes and the Eastern Conference-leading Miami Heat topped the Oklahoma City Thunder 120-108 on Friday night."}
{"game_id": "0022101052", "chunk_id": "0022101052_002", "order": 2, "role": "body", "text": "Bam Adebayo had 19 points on 8-for-10 shooting and Kyle Lowry added 16 points for the Heat. Miami used a 16-2 run late in the first half to take control of what was a tie game, and pushed the lead out to 29 in the second half."}
{"game_id": "0022101052", "chunk_id": "0022101052_003", "order": 3, "role": "body", "text": "Shai Gilgeous-Alexander played through ankle soreness and scored 26 points for the injury-depleted Thunder, who have dropped eight straight and reached the 50-loss mark in back-to-back seasons. Tre Mann added 25 points."}
{"game_id": "0022101052", "chunk_id": "0022101052_004", "order": 4, "role": "body", "text": "“It's our jobs to be professionals,\" Lowry said. “They've got a bunch of talent down there. They play hard. We had to do our jobs and stick with the game plan.\""}
{"game_id": "0022101052", "chunk_id": "0022101052_005", "order": 5, "role": "body", "text": "The Thunder have used five starting lineups in their last five games, giving them 30 such combinations so far this season. That ties the franchise-record total that the Thunder used a season ago."}
{"game_id": "0022101052", "chunk_id": "0022101052_006", "order": 6, "role": "body", "text": "“They have guys out of the lineup and, you know, their record is what it is,” Heat coach Erik Spoelstra said. “Those teams can be extremely dangerous. With 10, 12 games left in the year, they’re just playing free and young guys can play with a lot of confidence and they can become dangerous.”"}
{"game_id": "0022101052", "chunk_id": "0022101052_007", "order": 7, "role": "body", "text": "Markieff Morris scored 13 points, Max Strus scored 12 and Caleb Martin — back after missing just over a week with a knee injury — added 11 for Miami (47-24), which moved 2-1/2 games clear of second-place Milwaukee in the East standings. The Heat played without Jimmy Butler, who is dealing with an ankle sprain, and Victor Oladipo (back spasms)."}
{"game_id": "0022101052", "chunk_id": "0022101052_008", "order": 8, "role": "body", "text": "“They bring the fight to their opponent every night,” Thunder coach Mark Daigneault said. “That’s why they’re such a good team. They’re a good team because they do everything well. And that’s the baseline for any good team. It’s that competitive spirit over 82 games and they’re ready to rock every single night.”"}
{"game_id": "0022101052", "chunk_id": "0022101052_009", "order": 9, "role": "body", "text": "The scare for Miami came midway through the third quarter when Herro went airborne and twisted his left ankle after landing on Thunder reserve Isaiah Roby’s foot. Herro stayed down briefly, punching the floor in obvious pain and even went to the Heat locker room for evaluation."}
{"game_id": "0022101052", "chunk_id": "0022101052_010", "order": 10, "role": "body", "text": "He missed all of 1:04. Herro returned to the court, checked right back in and remained in the game until midway through the fourth."}
{"game_id": "0022101052", "chunk_id": "0022101052_011", "order": 11, "role": "body", "text": "“He brings it every single night,\" Robinson said. “As a young player, it can be tough to establish that. He's establishing himself as a star.\""}
{"game_id": "0022101052", "chunk_id": "0022101052_013", "order": 13, "role": "body", "text": "Thunder: Aaron Wiggins scored 17 points and Darius Bazley added 15 for the Thunder. ... Oklahoma City plans to update the status on rookie Josh Giddey (right hip) in about a week, Daigneault said. ... This is the sixth losing streak of at least eight games for the Thunder since the franchise moved to Oklahoma City. Of those, four have come in the last 12 months."}
{"game_id": "0022101052", "chunk_id": "0022101052_014", "order": 14, "role": "body", "text": "Heat: Miami went 5-2 in its seven-game homestand. ... Butler’s ankle sprain doesn’t have the Heat overly concerned. “Thankfully, this is not something that’s long-term,” Spoelstra said. ... The Heat play eight of their next 10 games against teams that are, at worst, likely to be in the play-in tournament. ... Chris Bosh, part of Miami’s 2012 and 2013 NBA title teams, was honored at halftime for his enshrinement in the Basketball Hall of Fame this year. “It’s been an amazing journey,” Bosh said."}
{"game_id": "0022101052", "chunk_id": "0022101052_016", "order": 16, "role": "body", "text": "The family foundation of Heat managing general partner Micky Arison and his wife Madeleine is donating $3 million to World Central Kitchen, Direct Relief and UNICEF USA to assist Ukrainians affected by the war in their homeland. Carnival Cruise Line donated an additional $50,000 to World Central Kitchen in honor of employees and crew members from Ukraine."}
{"game_id": "0022101052", "chunk_id": "0022101052_018", "order": 18, "role": "body", "text": "Herro’s sixth point Friday gave him 1,000 in games where he came off the bench this season. He’s the third player in Heat history to have that many in a reserve role; he’s now up to 1,020, closing in on the team single-season reserve record of 1,028."}
{"game_id": "0022101052", "chunk_id": "0022101052_020", "order": 20, "role": "body", "text": "The Thunder have now been swept by nine teams this season — Chicago, Charlotte, Cleveland, Golden State, Milwaukee, Minnesota, Philadelphia, Washington and Miami. They still could be swept by Atlanta, Boston, Phoenix and Utah. OKC was swept by 10 clubs last season; that’s the most since it endured 12 sweeps in 2008-09."}
{"game_id": "0022101052", "chunk_id": "0022101052_022", "order": 22, "role": "body", "text": "Thunder: Visit Orlando on Sunday."}
{"game_id": "0022101052", "chunk_id": "0022101052_023", "order": 23, "role": "body", "text": "Heat: Visit Philadelphia on Monday."}
