{"game_id": "0022100271", "chunk_id": "0022100271_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Danuel House Jr. had 18 points, Christian Wood added 16 points and 10 rebounds and the Houston Rockets ended their losing streak at 15, beating the Chicago Bulls 118-113 on Wednesday night."}
{"game_id": "0022100271", "chunk_id": "0022100271_002", "order": 2, "role": "body", "text": "Kevin Porter Jr. had 14 points, six rebounds and nine assists after missing three games because of a bruised left thigh. Second overall pick Jalen Green scored 11 points in the first quarter before exiting with a left leg injury."}
{"game_id": "0022100271", "chunk_id": "0022100271_003", "order": 3, "role": "body", "text": "“Great. Unbelievable. Excited,” House said. “So many words to be said for that one question. We’re grateful for it, but we can’t hang our hats on it.”"}
{"game_id": "0022100271", "chunk_id": "0022100271_004", "order": 4, "role": "body", "text": "House scored all 18 points in the second half after not playing at all in the first half. Houston coach Stephen Silas called House’s impact “huge”."}
{"game_id": "0022100271", "chunk_id": "0022100271_005", "order": 5, "role": "body", "text": "“He’s been in and out of the rotation,” Silas said. “He played eight minutes the last game. I wanted to get him out there just so he could continue to believe that his work would pay off, and tonight, he was the difference maker really.”"}
{"game_id": "0022100271", "chunk_id": "0022100271_006", "order": 6, "role": "body", "text": "Houston improved to 2-16. It shot 50% from the field and made 17 of 36 on 3-pointers, going 8 of 11 from behind the arc in the third quarter."}
{"game_id": "0022100271", "chunk_id": "0022100271_007", "order": 7, "role": "body", "text": "“It feels good, and when you make 17 3s it looks a lot better,” Silas said. “We were getting some of those shots previously and shooting 25% instead of 47%. We were in our spacing spots. It looked a lot better because we were making them.”"}
{"game_id": "0022100271", "chunk_id": "0022100271_008", "order": 8, "role": "body", "text": "Zach LaVine led Chicago with 28 points. Lonzo Ball added 19 points, DeMar DeRozan had 17 points and seven assists, and Alex Caruso scored 15 points."}
{"game_id": "0022100271", "chunk_id": "0022100271_009", "order": 9, "role": "body", "text": "Nikola Vucevic had 14 points and 13 rebounds in his return after missing seven games in the NBA’s COVID-19 health and safety protocols."}
{"game_id": "0022100271", "chunk_id": "0022100271_010", "order": 10, "role": "body", "text": "Chicago coach Billy Donovan said the Rockets came out of halftime more aggressive. Houston outscored the Bulls 35-18 in the third quarter."}
{"game_id": "0022100271", "chunk_id": "0022100271_011", "order": 11, "role": "body", "text": "“We just came out and kind of messed around with the game, and before you know it, we’re down by 10 after being up by 10,” Donovan said. “I have to help this group solve it and figure that part of it out. … We’re a very good team, but we are not so good that we cannot show up and play in a quarter in an NBA game and expect to win.”"}
{"game_id": "0022100271", "chunk_id": "0022100271_012", "order": 12, "role": "body", "text": "Chicago cut Houston’s lead to three on LaVine’s layup, but House responded with a 3 to increase the lead to 109-103 with 2:23 remaining. After the teams traded baskets, Caruso hit a 3-pointer with 47 seconds left to cut the lead to 111-108."}
{"game_id": "0022100271", "chunk_id": "0022100271_013", "order": 13, "role": "body", "text": "Garrison Matthews responded with a 3-pointer from the corner with 25 seconds remaining, and Houston pushed the lead to eight on two free throws by House with 16 seconds left. LaVine hit a 3-pointer, and after a steal, connected on a long two with two seconds left to cut the lead to 116-113."}
{"game_id": "0022100271", "chunk_id": "0022100271_014", "order": 14, "role": "body", "text": "After a timeout, Matthews hit two free throws to ice the win."}
{"game_id": "0022100271", "chunk_id": "0022100271_015", "order": 15, "role": "body", "text": "Trailing 73-63 midway through the third, Houston finished the quarter outscoring the Bulls 27-9 to take a 90-82 lead on a 3-pointer by House with 30 seconds left in the third. House had 10 points in the run, and Armoni Brooks added eight."}
{"game_id": "0022100271", "chunk_id": "0022100271_017", "order": 17, "role": "body", "text": "Bulls: Caruso (bruised left wrist) also returned to the lineup after missing Monday’s game against Indiana. … The Bulls held a 50-42 advantage in points in the paint. … Chicago forced Houston into 21 turnovers, which the Bulls turned into 35 points."}
{"game_id": "0022100271", "chunk_id": "0022100271_018", "order": 18, "role": "body", "text": "Rockets: Alperen Sengun had 13 points, Brooks had 11 points and Matthews had 12 points as Houston’s bench finished with 59 points. … The Rockets had a 45-41 advantage in rebounds. … Houston held a 16-2 advantage in second-chance points."}
{"game_id": "0022100271", "chunk_id": "0022100271_020", "order": 20, "role": "body", "text": "Bulls: At Orlando on Friday night."}
{"game_id": "0022100271", "chunk_id": "0022100271_021", "order": 21, "role": "closing", "text": "Rockets: Host Charlotte on Saturday night."}
