{"game_id": "0022100076", "chunk_id": "0022100076_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — Damian Lillard said when he has his breakthrough, everyone will know it."}
{"game_id": "0022100076", "chunk_id": "0022100076_002", "order": 2, "role": "body", "text": "Lillard has struggled to make shots to start the season, but it has begun to come together. He scored 25 points and the Portland Trail Blazers extracted some revenge for a loss earlier this week to the Los Angeles Clippers with a 111-92 victory on Friday night."}
{"game_id": "0022100076", "chunk_id": "0022100076_003", "order": 3, "role": "body", "text": "“I shot the ball well tonight. I had a stretch in the third quarter of the last game. I've just got to keep going in that direction,” he said about his progress. “To me, I think when I come out of it, I feel like it's going to be loud. Usually when I shoot the ball poorly over a stretch, it's loud when I come out of it.”"}
{"game_id": "0022100076", "chunk_id": "0022100076_004", "order": 4, "role": "body", "text": "Jusuf Nurkic added 14 points and 17 rebounds for the Blazers, who snapped a seven-game losing streak to the Clippers."}
{"game_id": "0022100076", "chunk_id": "0022100076_005", "order": 5, "role": "body", "text": "Paul George, who had 41 points earlier this season against Memphis, had 42 against the Blazers, just six shy of his career-high."}
{"game_id": "0022100076", "chunk_id": "0022100076_006", "order": 6, "role": "body", "text": "Portland led by as many as 20 points in the third quarter but the Clippers closed within 76-67 heading into the final quarter."}
{"game_id": "0022100076", "chunk_id": "0022100076_007", "order": 7, "role": "body", "text": "George's off-balance jumper pulled Los Angeles as close as 82-78, but Nurkic and Anfernee Simons answered with baskets for Portland."}
{"game_id": "0022100076", "chunk_id": "0022100076_008", "order": 8, "role": "body", "text": "Norman Powell's 3-pointer extended the Blazers' lead before Lillard made a step-back 3 that made it 94-80. Lillard added another 3 that made it 97-83 with 3:57 left."}
{"game_id": "0022100076", "chunk_id": "0022100076_009", "order": 9, "role": "body", "text": "George said it's way too early to be too concerned. The Clippers remained without Serge Ibaka, Kawhi Leonard and Marcus Morris Sr."}
{"game_id": "0022100076", "chunk_id": "0022100076_010", "order": 10, "role": "body", "text": "“We'll grow. With more time to get practice, more time to get games, we'll know how to play out there with one another,\" George said."}
{"game_id": "0022100076", "chunk_id": "0022100076_011", "order": 11, "role": "body", "text": "The Clippers handed the Trail Blazers a 116-86 loss on Monday in Los Angeles, a loss that was marked by 30 Portland turnovers. It was the Clippers' lone win through their first five games of the season."}
{"game_id": "0022100076", "chunk_id": "0022100076_012", "order": 12, "role": "body", "text": "Lillard went into the game still trying to find a rhythm in the early season. He averaged just 17.8 points through Portland's first four games, well off his usual output. He had made just six of 35 3-point attempts. He had five 3-pointers against the Clippers."}
{"game_id": "0022100076", "chunk_id": "0022100076_013", "order": 13, "role": "body", "text": "“The thing about Dame, as you all know, whatever he's got going on, he doesn't wear it. He's the same guy on his great days and on his not-so-great days. He handles adversity and prosperity the same way,” Blazers coach Chauncey Billups said. “But, let's be honest, we're all human, nobody wants to struggle at something they're really really good at, for even a small amount of time.”"}
{"game_id": "0022100076", "chunk_id": "0022100076_014", "order": 14, "role": "body", "text": "Los Angeles hit six straight 3-point attempts to start the game and take an early 18-9 lead. George hit three of them."}
{"game_id": "0022100076", "chunk_id": "0022100076_015", "order": 15, "role": "body", "text": "The Blazers trailed by as many as 11 points in the first quarter but came back to lead 25-24 going into the second. A 23-6 run put Portland up 42-30 before the team went into halftime with a 48-40 lead."}
{"game_id": "0022100076", "chunk_id": "0022100076_016", "order": 16, "role": "body", "text": "CJ McCollum's 3-pointer gave the Blazers a 61-41 lead midway through the third quarter."}
{"game_id": "0022100076", "chunk_id": "0022100076_018", "order": 18, "role": "body", "text": "Clippers: Billups was an assistant under Tyronn Lue with the Clippers last season. ... George led all players with 22 first-half points. ... The Clippers were coming off a 92-79 loss at home to Cleveland on Wednesday."}
{"game_id": "0022100076", "chunk_id": "0022100076_019", "order": 19, "role": "body", "text": "Trail Blazers: The Trail Blazers held a moment of silence for team historian and archivist Chuck Charnquist, who recently died. Charnquist had been a fixture with the Blazers since the team was founded in 1970, and the media room at the Moda Center is named in his honor. ... Powell started for the Blazers after missing two games with a knee injury. ... Portland rebounded from Monday's loss to the Clippers with a 116-96 victory at home over Memphis on Wednesday night."}
{"game_id": "0022100076", "chunk_id": "0022100076_021", "order": 21, "role": "body", "text": "Clippers: Host Oklahoma City on Monday."}
{"game_id": "0022100076", "chunk_id": "0022100076_022", "order": 22, "role": "body", "text": "Trail Blazers: Open a four-game road trip on Sunday at Charlotte."}
{"game_id": "0022100076", "chunk_id": "0022100076_024", "order": 24, "role": "closing", "text": "MORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports"}
