{"game_id": "0022100007", "chunk_id": "0022100007_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Ja Morant had 37 points and six assists, De’Anthony Melton added 20 points and the Memphis Grizzlies pulled away in the fourth for a 132-121 victory over the Cleveland Cavaliers on Wednesday night in the opener for both teams."}
{"game_id": "0022100007", "chunk_id": "0022100007_002", "order": 2, "role": "body", "text": "Morant and Melton combined for 14 points down the stretch as the Cavaliers pulled within a point on a couple of occasions but could never overtake Memphis. Desmond Bane added 22 points for Memphis."}
{"game_id": "0022100007", "chunk_id": "0022100007_003", "order": 3, "role": "body", "text": "“Our defense generates our offense,” Morant said. “Our mindset was just get stops late and go on the other end and execute.”"}
{"game_id": "0022100007", "chunk_id": "0022100007_004", "order": 4, "role": "body", "text": "Jarrett Allen led the Cavaliers with 25 points, hitting all 11 of his shots from the field. Allen is the first player since in the shot-clock era (since 1954) to go 10 of 10 or better in a season opener. It’s also the second time in his career that he’s gone 11 for 11. He also did it on Feb. 21, 2021, against Oklahoma City."}
{"game_id": "0022100007", "chunk_id": "0022100007_005", "order": 5, "role": "body", "text": "“I just came in and wanted to help the team get off on the right foot,” Allen said. “I think that’s a big thing when coming into a long season like this. Starting off right.”"}
{"game_id": "0022100007", "chunk_id": "0022100007_006", "order": 6, "role": "body", "text": "Collin Sexton and rookie Evan Mobley added 17 points each, Mobley also grabbed nine rebounds."}
{"game_id": "0022100007", "chunk_id": "0022100007_007", "order": 7, "role": "body", "text": "The Cavaliers, who trailed by as many as 16 in the first half, chipped away at the Memphis lead, trailing by 94-90 heading to the fourth."}
{"game_id": "0022100007", "chunk_id": "0022100007_008", "order": 8, "role": "body", "text": "But Memphis opened the final quarter with 10 straight points to create some space. The Cavaliers got to 119-118 with just under two minutes left. But Morant’s floater and a layup by Melton clinched the victory."}
{"game_id": "0022100007", "chunk_id": "0022100007_009", "order": 9, "role": "body", "text": "“The game got away from us down the stretch,” Cavaliers coach J.B. Bickerstaff said. “But we’ve got to take steps there. You can’t allow teams to get to your paint. They scored 70 points in (the) paint. And then (we) give up 14 3s as well.”"}
{"game_id": "0022100007", "chunk_id": "0022100007_010", "order": 10, "role": "body", "text": "Morant scored 20 points in the half as the Grizzlies took a 73-61 lead. The 73 points was the fifth-highest for a first half in franchise history."}
{"game_id": "0022100007", "chunk_id": "0022100007_011", "order": 11, "role": "body", "text": "Then down the stretch, Morant scored 11 points in the fourth, including connecting on a 3-pointer in the closing minute to stretch the Memphis lead."}
{"game_id": "0022100007", "chunk_id": "0022100007_012", "order": 12, "role": "body", "text": "“He’s a special person, a special player,” Memphis coach Taylor Jenkins saidnt, adding: “He knows he has got a lot of room for growth, and he’s excited to push in that direction. But (Wednesday night) was a great statement on all the work he’s been doing.”"}
{"game_id": "0022100007", "chunk_id": "0022100007_014", "order": 14, "role": "body", "text": "Cavaliers: Bickerstaff coached the Grizzlies from 2017-19. … Mobley, the third overall pick in last summer’s draft, scored on the Cavs first possession, knocking down a 15-footer. … Allen tied a career high with three steals."}
{"game_id": "0022100007", "chunk_id": "0022100007_015", "order": 15, "role": "body", "text": "Grizzlies: G/F Dillon Brooks was out of action recovering from a left hand fracture. …Memphis is now 6-21 in season openers in franchise history. The last opening win for the Grizzlies was in 2017 over the New Orleans Pelicans. … Bane picked up Memphis’ first technical of the year, punching the air when he was called for a foul in the second quarter."}
{"game_id": "0022100007", "chunk_id": "0022100007_017", "order": 17, "role": "body", "text": "Cleveland is young and still establishing its character. Bickerstaff saw some of that development in the preseason, but there is still improvement before the transition is complete."}
{"game_id": "0022100007", "chunk_id": "0022100007_018", "order": 18, "role": "body", "text": "“I think our guys know who we want to be, and they have a clear picture of that.” Bickerstaff said, later adding: “You have a new group of guys together, new positions, new roles. It takes a minute to get all the way there.”"}
{"game_id": "0022100007", "chunk_id": "0022100007_020", "order": 20, "role": "body", "text": "Near the end of the game, Morant went to the free throw line, and the Grizzlies faithful began MVP chants. “I’m not going to lie. Those MVP chants almost made me miss my free throws,” Morant said. “I was shook. The only thing going through my head was ‘Wow.’ But at the same time, I was like: ‘You’ve got to make these free throws with these MVP chants.’”"}
{"game_id": "0022100007", "chunk_id": "0022100007_022", "order": 22, "role": "body", "text": "Cavaliers: Play their home opener Friday, entertaining the Charlotte Hornets."}
{"game_id": "0022100007", "chunk_id": "0022100007_023", "order": 23, "role": "closing", "text": "Grizzlies: Travel to Los Angeles to face the Clippers on Saturday in the opener of a four-game West Coast swing."}
