{"game_id": "0022100525", "chunk_id": "0022100525_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Kevin Durant came back and Joel Embiid waved him off the floor."}
{"game_id": "0022100525", "chunk_id": "0022100525_002", "order": 2, "role": "body", "text": "Durant used the same dismissive motion toward the Philadelphia 76ers when they were in Brooklyn two weeks ago, but this time the final word — and more importantly the victory — went to Embiid."}
{"game_id": "0022100525", "chunk_id": "0022100525_003", "order": 3, "role": "body", "text": "Embiid scored 34 points and the 76ers spoiled Durant’s return to the lineup by beating the Nets 110-102 on Thursday night."}
{"game_id": "0022100525", "chunk_id": "0022100525_004", "order": 4, "role": "body", "text": "Embiid punctuated the victory with a follow shot while being fouled. He and Durant then both received technical fouls for jawing at each other and the center was talking to multiple Nets as the game ended, waving his arm to send them off the floor."}
{"game_id": "0022100525", "chunk_id": "0022100525_005", "order": 5, "role": "body", "text": "Afterward, the players professed a mutual respect for each other and their teams."}
{"game_id": "0022100525", "chunk_id": "0022100525_006", "order": 6, "role": "body", "text": "“If there’s one player I think is probably talented or more talented than me, it’s definitely him,\" Embiid said. \"So I have a lot of respect for him. I admire his game. So we’re just competitive. Wins matter, every single one of them, and it’s always good to beat the best in the conference.”"}
{"game_id": "0022100525", "chunk_id": "0022100525_007", "order": 7, "role": "body", "text": "Durant downplayed the chatter, acknowledging that his gesture at the end of the Dec. 16 victory may have led to Embiid's."}
{"game_id": "0022100525", "chunk_id": "0022100525_008", "order": 8, "role": "body", "text": "“If you've been watching Joel and I play against each other, it’s been like that every game, even the All-Star Game,” Durant said. “We just respect each other so much that that natural competitive fire I guess comes out. So it’s the name of the game.”"}
{"game_id": "0022100525", "chunk_id": "0022100525_009", "order": 9, "role": "body", "text": "Durant had 33 points in his first game in two weeks, having missed three games in health and safety protocols. He picked up right where he left off, having averaged 39.7 points in the three games before that."}
{"game_id": "0022100525", "chunk_id": "0022100525_010", "order": 10, "role": "body", "text": "But Embiid converted a tiebreaking three-point play with 3:14 remaining and Tyrese Maxey and Seth Curry hit 3-pointers to send the 76ers to their third straight victory."}
{"game_id": "0022100525", "chunk_id": "0022100525_011", "order": 11, "role": "body", "text": "“Tonight’s game was fun to be a part of but I think we shot ourselves in the foot throughout this game,” Durant said. “But it’s good to be back.”"}
{"game_id": "0022100525", "chunk_id": "0022100525_012", "order": 12, "role": "body", "text": "James Harden had 33 points, 14 rebounds and 10 assists for his sixth triple-double, continuing his strong stretch since returning from a three-game absence in health and safety protocols. But the Nets had no good answer for Embiid all night."}
{"game_id": "0022100525", "chunk_id": "0022100525_013", "order": 13, "role": "body", "text": "Maxey added five 3-pointers and 25 points, while Curry scored 17 for the 76ers, who were led by assistant coach Dan Burke after Doc Rivers was placed in health and safety protocols earlier Thursday."}
{"game_id": "0022100525", "chunk_id": "0022100525_014", "order": 14, "role": "body", "text": "“It’s been a crazy past week and I’m just happy to end the road trip off the three wins and get back to my family,” Maxey said."}
{"game_id": "0022100525", "chunk_id": "0022100525_015", "order": 15, "role": "body", "text": "Embiid scored 16 points in the first 9 1/2 minutes and Andre Drummond added six more after replacing him, giving Philadelphia a 39-31 lead after one quarter. Embiid banked in a 3-pointer with 30 seconds left in the half to give the 76ers a 55-54 edge."}
{"game_id": "0022100525", "chunk_id": "0022100525_016", "order": 16, "role": "body", "text": "Durant scored 14 in the third and the Nets were up seven after he made consecutive 3-pointers. But Maxey made two in a row to end the period and send the Sixers to the fourth up 84-82."}
{"game_id": "0022100525", "chunk_id": "0022100525_018", "order": 18, "role": "body", "text": "76ers: Burke said Rivers was feeling well and was upbeat. “He said he feels good, he’s not the least bit worried, and if anybody just takes things in stride and keep it real or keep it relative, it’s Doc,” Burke said, “and that’s the lead we’ve got to follow.” ... Burke was 0-2 as an acting head coach under Nate McMillan in Indiana."}
{"game_id": "0022100525", "chunk_id": "0022100525_019", "order": 19, "role": "body", "text": "Nets: A day after Kyrie Irving returned to practice, coach Steve Nash said he hadn't had any further discussion with the point guard about whether he would get vaccinated, making him eligible to play in home games. “Not since we had those conversations in the preseason and since then we have not,” Nash said. ... The Nets fell to 6-1 against Atlantic Division opponents."}
{"game_id": "0022100525", "chunk_id": "0022100525_021", "order": 21, "role": "body", "text": "Along with Rivers, assistant coaches Sam Cassell and Brian Adams were both unavailable because of protocols. Assistant coach Dave Joerger stepped away from the team in November to undergo treatment for cancer. That left just Burke, Eric Hughes and Jamie Young among Rivers' assistant coaches."}
{"game_id": "0022100525", "chunk_id": "0022100525_023", "order": 23, "role": "body", "text": "76ers: Host the Houston Rockets on Monday."}
{"game_id": "0022100525", "chunk_id": "0022100525_024", "order": 24, "role": "body", "text": "Nets: Host the Los Angeles Clippers on Saturday."}
