{"game_id": "0022100100", "chunk_id": "0022100100_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Ja Morant had 26 points, eight assists and seven rebounds, Tyus Jones added 17 points and the Memphis Grizzlies defeated the Denver Nuggets 106-97 on Monday night."}
{"game_id": "0022100100", "chunk_id": "0022100100_002", "order": 2, "role": "body", "text": "Xavier Tillman had 12 points, while Desmond Bane and Jaren Jackson Jr. finished with 11 each as Memphis snapped a three-game losing streak to the Nuggets."}
{"game_id": "0022100100", "chunk_id": "0022100100_003", "order": 3, "role": "body", "text": "Jones and Tillman were part of a Grizzlies bench that outscored Nuggets reserves 43-34 and kept Memphis in front most of the way. Denver never led by more than two points, and there were six ties."}
{"game_id": "0022100100", "chunk_id": "0022100100_004", "order": 4, "role": "body", "text": "“We said all along, if our bench is clicking defensively and offensively, that just creates great balance for our team,” Memphis coach Taylor Jenkins said. “That leads to a lot of success for us.”"}
{"game_id": "0022100100", "chunk_id": "0022100100_005", "order": 5, "role": "body", "text": "Nikola Jokic led Denver with 23 points, seven rebounds and seven assists, while Aaron Gordon added 15 points and 10 rebounds. Monte Morris scored 11 but was 5 of 12 from the field — part of the Nuggets shooting 44% for the game."}
{"game_id": "0022100100", "chunk_id": "0022100100_006", "order": 6, "role": "body", "text": "Denver’s major problems came from outside the arc where it went 9 of 38 for 24%."}
{"game_id": "0022100100", "chunk_id": "0022100100_007", "order": 7, "role": "body", "text": "“Of course, that’s their defense, too,” Jokic said. “But we missed a couple of open shots. We didn’t rebound enough. We had a couple of turnovers. It is what it is.”"}
{"game_id": "0022100100", "chunk_id": "0022100100_008", "order": 8, "role": "body", "text": "The teams face each other again Wednesday night in Memphis."}
{"game_id": "0022100100", "chunk_id": "0022100100_009", "order": 9, "role": "body", "text": "The Grizzlies, who held an 82-73 lead entering the fourth quarter, were able to hold Denver at bay as the Nuggets tried to muster a rally. At one point, Kyle Anderson made three straight baskets to help Memphis maintain a double-digit lead. Jones hit a pair of 3-pointers earlier in the period as the Grizzlies led by at least nine over the final 11 minutes."}
{"game_id": "0022100100", "chunk_id": "0022100100_010", "order": 10, "role": "body", "text": "Jones connected on five 3s, part of Memphis going 13 of 34 from outside the arc."}
{"game_id": "0022100100", "chunk_id": "0022100100_011", "order": 11, "role": "body", "text": "“It’s going to open things up on the offensive end for me,” Jones said of his long-range accuracy. “At the same time, we’ve got a lot of guys who can create and play-make. So, it’s just another way to help out the offense.”"}
{"game_id": "0022100100", "chunk_id": "0022100100_012", "order": 12, "role": "body", "text": "Jokic characterized Jones’ 3-point shooting as “a game-changer” in bolstering the Grizzlies' second unit. But he also noted that Memphis outscored the Nuggets in the paint 58-40, some of that from Morant’s zigzagging, stop-and-start moves to the basket."}
{"game_id": "0022100100", "chunk_id": "0022100100_013", "order": 13, "role": "body", "text": "“Ja is a really good player, of course,” Jokic said, adding: “Mainly, it is Ja’s ability to get in the middle of the paint and all those kinds of (shots). We say we can live with that, but he’s really good at that.”"}
{"game_id": "0022100100", "chunk_id": "0022100100_014", "order": 14, "role": "body", "text": "In the fourth quarter, Jenkins played both Jones and Morant for much of the period, providing the Grizzlies with more stability to hold off Denver."}
{"game_id": "0022100100", "chunk_id": "0022100100_015", "order": 15, "role": "body", "text": "“Me and Tyus have been talking about (playing together) for three years,” Morant said. “I definitely love it. We play with a way better pace. I don’t have to be on the ball with Tyus being such a good creator on the floor for everybody.”"}
{"game_id": "0022100100", "chunk_id": "0022100100_017", "order": 17, "role": "body", "text": "Nuggets: Allowed an opponent to reach 100 points for only the second time this season. The only other team to pass the century mark was Utah in a 122-110 Jazz victory. … Gordon left in the third quarter with a right eye injury. He returned in the fourth."}
{"game_id": "0022100100", "chunk_id": "0022100100_018", "order": 18, "role": "body", "text": "Grizzlies: Morant got his 1,000th career assist with his first of the game early in the first quarter. … Jones’ five 3-pointers tied a career high in a regular-season game."}
{"game_id": "0022100100", "chunk_id": "0022100100_020", "order": 20, "role": "body", "text": "There’s no doubt the Nuggets’ game depends heavily on Jokic, no matter how coach Michael Malone mixes his lineup with starters and reserves. “I think our plus-minus with Nikola on the floor is spectacular,” Malone said in his pregame media session. “And I don’t want to talk about what it is when he’s off the floor.”"}
{"game_id": "0022100100", "chunk_id": "0022100100_022", "order": 22, "role": "body", "text": "Morant was added to the injury report Monday afternoon with a sore right elbow but started. Jenkins said Morant hurt the elbow when he fell in the Miami game Saturday. Asked whether the soreness bothered him during the game, Morant replied: “How much points did I have today?” When told it was 26, he replied: “There you go. Tonight, I don’t know. But during the game it was good.”"}
{"game_id": "0022100100", "chunk_id": "0022100100_024", "order": 24, "role": "body", "text": "The teams play the second of a two-game set Wednesday in Memphis."}
