{"game_id": "0022100131", "chunk_id": "0022100131_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — CJ McCollum scored 27 points, making five 3-pointers, and the Portland Trail Blazers rallied to beat the Indiana Pacers 110-106 on Friday night and snap a three-game losing streak."}
{"game_id": "0022100131", "chunk_id": "0022100131_002", "order": 2, "role": "body", "text": "Robert Covington added a season-high 19 points, including a key 3-pointer with 14.7 seconds left."}
{"game_id": "0022100131", "chunk_id": "0022100131_003", "order": 3, "role": "body", "text": "“He shot it tonight, made the extra pass when he needed to, defended. He was aggressive,\" McCollum said. \"He was the hero tonight. He hit some big shots for us.\""}
{"game_id": "0022100131", "chunk_id": "0022100131_004", "order": 4, "role": "body", "text": "Damian Lillard continued to struggle with his shot, going 2 for 13 from the field and missing all six of his 3-point attempts. He had four points and 11 assists."}
{"game_id": "0022100131", "chunk_id": "0022100131_005", "order": 5, "role": "body", "text": "T.J. McConnell had 19 points for the Pacers, whose two-game winning streak was snapped."}
{"game_id": "0022100131", "chunk_id": "0022100131_006", "order": 6, "role": "body", "text": "Portland led by as many as 16 points in the opening half, but the Pacers closed the gap before halftime and held a narrow lead going into the final period."}
{"game_id": "0022100131", "chunk_id": "0022100131_007", "order": 7, "role": "body", "text": "The Pacers went on an 11-0 run to go up 97-90 but it was snapped by Jusuf Nurkic's layup. McCollum and Covington each made 3-pointers to pull Portland within 101-98 with 3:55 left."}
{"game_id": "0022100131", "chunk_id": "0022100131_008", "order": 8, "role": "body", "text": "Norman Powell's free throws and McCollum's layup put the Blazers in front 102-101. After Nurkic dunked, Domantas Sabonis' layup kept the Pacers close."}
{"game_id": "0022100131", "chunk_id": "0022100131_009", "order": 9, "role": "body", "text": "Covington hit a 3-pointer to extend Portland's lead, but Myles Turner answered with a 3 to narrow it to 107-106. Covington's 3 as the seconds ticked down sealed it."}
{"game_id": "0022100131", "chunk_id": "0022100131_010", "order": 10, "role": "body", "text": "Indiana was without starting guard Malcolm Brogdon, who leads the Pacers with 22.3 points per game, because of a non-COVID illness. McConnell started in his place."}
{"game_id": "0022100131", "chunk_id": "0022100131_011", "order": 11, "role": "body", "text": "Caris LeVert, who missed the start of the season with a stress fracture in his back, averaged 18.5 points in the Pacers' past two games. He finished with 12 against the Blazers."}
{"game_id": "0022100131", "chunk_id": "0022100131_012", "order": 12, "role": "body", "text": "“I really like our team. I think we have a lot of talent on this team, but we don’t have the kind of talent to win on talent alone,\" Pacers coach Rick Carlisle said. “I mean, we’ve got to really be tied together. And our compete level has got to be way up there.”"}
{"game_id": "0022100131", "chunk_id": "0022100131_013", "order": 13, "role": "body", "text": "Lillard was averaging 19.5 points, well off his average last season. Going into Friday game, Portland's All-Star had hit just 18 of 77 3-point attempts, or about 23%. However, he is among the league leaders with 8.5 assists a game."}
{"game_id": "0022100131", "chunk_id": "0022100131_014", "order": 14, "role": "body", "text": "Blazers coach Chauncey Billups praised Lillard's floor game, saying he was finding guys for the right shots. Asked if he was concerned about Lillard, Portland's new coach was emphatic."}
{"game_id": "0022100131", "chunk_id": "0022100131_015", "order": 15, "role": "body", "text": "“No. Why would I? He’s one of the greatest of all time. He’s still in his prime. He’s not 38 or 39,\" Billups said. “I played this game for a long time, I went through that myself.”"}
{"game_id": "0022100131", "chunk_id": "0022100131_016", "order": 16, "role": "body", "text": "Portland led by as many as 13 points early but Indiana closed the gap to 24-22 on Justin Holiday's 3-pointer early in the second."}
{"game_id": "0022100131", "chunk_id": "0022100131_017", "order": 17, "role": "body", "text": "McCollum made back-to-back 3-pointers to push Portland's lead to 40-28 but the Pacers went on a 10-0 run to close the half and got within 59-53."}
{"game_id": "0022100131", "chunk_id": "0022100131_018", "order": 18, "role": "body", "text": "“It’s easy to lay down and just let the chips fall where they may. But I don’t think we did that. We got off to a slow start and we were able to fight back. But it just wasn’t enough,\" Turner said. \"We can go and make all the excuses in the world — it’s the West Coast, travel, and all that — but you’ve got to find a way to get it done.\""}
{"game_id": "0022100131", "chunk_id": "0022100131_019", "order": 19, "role": "body", "text": "Powell finished with 25 points."}
{"game_id": "0022100131", "chunk_id": "0022100131_021", "order": 21, "role": "body", "text": "Pacers: Domantas Sabonis, son of former Trail Blazers great Arvydas Sabonis, wore special shoes customized by Pacific Northwest artist Justin Tigner that pays homage to both father and son. ... Billups played under Carlisle in Detroit. “It’s a proud moment for me,\" Carlisle said about coaching opposite former players. \"I always thought Chauncey could do anything he wanted in basketball.”"}
{"game_id": "0022100131", "chunk_id": "0022100131_022", "order": 22, "role": "body", "text": "Trail Blazers: McCollum led all scorers in the first half with 19 points. ... Powell has had three straight games with 20 or more points. ... Blazers owner Jody Allen was at the game."}
{"game_id": "0022100131", "chunk_id": "0022100131_024", "order": 24, "role": "body", "text": "Pacers: Visit the Sacramento Kings on Sunday."}
{"game_id": "0022100131", "chunk_id": "0022100131_025", "order": 25, "role": "body", "text": "Trail Blazers: Play the second of a back-to-back against the Lakers on Saturday."}
