{"game_id": "0022100820", "chunk_id": "0022100820_001", "order": 1, "role": "lead", "text": "DALLAS -- — Luka Doncic had 33 points with 11 assists while coming up three rebounds shy of his third consecutive triple-double, Jalen Brunson scored 21 points and the Dallas Mavericks overwhelmed the Detroit Pistons 116-86 on Tuesday night."}
{"game_id": "0022100820", "chunk_id": "0022100820_002", "order": 2, "role": "body", "text": "The Mavericks won their third game in a row, never trailing after Reggie Bullock's 3-pointer snapped a 21-21 tie with 3 1/2 minutes left in the first quarter. That started a 15-5 run over the rest of the quarter, with Doncic scoring the next six points for Dallas before assisting on consecutive 3s by Trey Burke."}
{"game_id": "0022100820", "chunk_id": "0022100820_003", "order": 3, "role": "body", "text": "Doncic either scored or assisted on 29 of the 36 points the Mavericks scored in the first quarter."}
{"game_id": "0022100820", "chunk_id": "0022100820_004", "order": 4, "role": "body", "text": "“It set the whole tone,\" Pistons coach Dwane Casey said. “Dallas is a very good team. They have an MVP candidate that affects everything. Passing, he picked us apart when we tried to blitz him. ... We just couldn’t stay on him, no matter who we put on him.”"}
{"game_id": "0022100820", "chunk_id": "0022100820_005", "order": 5, "role": "body", "text": "The 22-year-old, third-time All-Star had 15 points and five assists — four of those 3s by teammates — in the first quarter. He finished 9-of-18 shooting overall with five made 3s."}
{"game_id": "0022100820", "chunk_id": "0022100820_006", "order": 6, "role": "body", "text": "“We’re trying to move him around a little bit on the court, put him in some different spots and see how the defense is going to react,” Mavericks coach Jason Kidd said. “I thought he took what they gave him.”"}
{"game_id": "0022100820", "chunk_id": "0022100820_007", "order": 7, "role": "body", "text": "Hamidou Diallo had 18 points to lead the Pistons, who have lost five in a row and nine of 10. Jeramie Grant had 15 points, and Isaiah Stewart had 14 points and 15 rebounds."}
{"game_id": "0022100820", "chunk_id": "0022100820_008", "order": 8, "role": "body", "text": "The Pistons played their fourth game in a row without standout rookie Cade Cunningham, their leading scorer who missed the chance to play before family and friends because of a hip injury. The No. 1 overall pick in last summer’s NBA draft was born in nearby Arlington, Texas."}
{"game_id": "0022100820", "chunk_id": "0022100820_009", "order": 9, "role": "body", "text": "Kidd, the first-year Mavericks head coach, shared an embrace at the end of the game with Casey. When the Mavericks won their only NBA title in 2011, Kidd was the point guard and Casey was in his third and final season as a top assistant for Rick Carlisle."}
{"game_id": "0022100820", "chunk_id": "0022100820_010", "order": 10, "role": "body", "text": "Burke had eight points with four of the 18 made 3-pointers by Dallas, which played the fourth of its season-long stretch of six consecutive home games. The Mavs have won 11 of their last 13 games played at the American Airlines Center."}
{"game_id": "0022100820", "chunk_id": "0022100820_011", "order": 11, "role": "body", "text": "Doncic was coming off a foul-plagued effort two days earlier, when he had 18 points, 11 assists and 10 rebounds in less than 28 minutes. He got his fifth foul early in the third quarter against the Atlanta Hawks before sitting for a significant period of time."}
{"game_id": "0022100820", "chunk_id": "0022100820_012", "order": 12, "role": "body", "text": "The Mavericks had a 35-point lead and Doncic only three fouls in 33 minutes when he departed with nine minutes left Tuesday night."}
{"game_id": "0022100820", "chunk_id": "0022100820_013", "order": 13, "role": "body", "text": "Burke also came back with a strong effort after being plagued by fouls against Atlanta."}
{"game_id": "0022100820", "chunk_id": "0022100820_014", "order": 14, "role": "body", "text": "“It meant a lot,” Burke said. “Like I always talk about, just staying prepared.”"}
{"game_id": "0022100820", "chunk_id": "0022100820_016", "order": 16, "role": "body", "text": "Doncic has at least 10 assists in seven consecutive games, a career long and one short of the franchise record."}
{"game_id": "0022100820", "chunk_id": "0022100820_017", "order": 17, "role": "body", "text": "“He’s making all the right reads. He’s finding his teammates,” Kidd said. “It’s a great balance. Guys are getting wide-open shots. It’s amazing what he’s done in such a short career of the things that he’s doing.”"}
{"game_id": "0022100820", "chunk_id": "0022100820_019", "order": 19, "role": "body", "text": "Pistons: Casey described Cunningham as being disappointed at not being able to play. “He has got a lot of people coming to the game to see him on the side in his suit clothes,” Casey said before the game. ... Saddiq Bey was 1-of-7 on 3-pointers, and 1-of-11 shooting overall. That was his 309th career 3-pointer in 124 games. “They really, really did a good job of really trying to take him off his spots, and when he tried to put it on the floor, they got in front of him,” Casey said of the Mavs defending him."}
{"game_id": "0022100820", "chunk_id": "0022100820_020", "order": 20, "role": "body", "text": "Mavericks: Maxi Kleber was back after missing two games with a left knee issue. He played nearly 13 minutes before his first shot, and made a 3-pointer with 3:26 left in the third quarter for an 88-65 lead. He also made his only other shot, and finished with five points and seven rebounds in 18 minutes. ... Bullock finished with 12 points on four 3s, ending his career-best streak of consecutive 20-point games at three."}
{"game_id": "0022100820", "chunk_id": "0022100820_022", "order": 22, "role": "body", "text": "Pistons: Home on Thursday to host the Grizzlies, who beat them by 30 in Memphis on Jan. 6."}
{"game_id": "0022100820", "chunk_id": "0022100820_023", "order": 23, "role": "body", "text": "Mavericks: Play the first of two home games in three days against the Clippers on Thursday night. They split a pair of back-to-back games in Los Angeles in November."}
