{"game_id": "0022100834", "chunk_id": "0022100834_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Gary Trent Jr. scored a season-high 42 points, and the Toronto Raptors pushed their season-high winning streak to eight games with a 139-120 victory over the Houston Rockets on Thursday night."}
{"game_id": "0022100834", "chunk_id": "0022100834_002", "order": 2, "role": "body", "text": "Toronto’s winning streak is the longest active one in the NBA and the loss extended Houston’s skid to four games."}
{"game_id": "0022100834", "chunk_id": "0022100834_003", "order": 3, "role": "body", "text": "It was Trent’s seventh game with 30 points or more this season and Pascal Siakam added 30 points for his sixth 30-point game. Trent and Siakam both got going early and had 25 and 26 points respectively by halftime as Toronto built a 73-64 lead."}
{"game_id": "0022100834", "chunk_id": "0022100834_004", "order": 4, "role": "body", "text": "“Those two guys really came out ready to go tonight,\" coach Nick Nurse said. “They’re doing it with composure. They’re just really confident with the ball right now.\""}
{"game_id": "0022100834", "chunk_id": "0022100834_005", "order": 5, "role": "body", "text": "The 42 points were the most for Trent, who made six 3-pointers, since he had a career-high 44 last April against Cleveland."}
{"game_id": "0022100834", "chunk_id": "0022100834_006", "order": 6, "role": "body", "text": "Trent said the 51 points he and Siakam combined for in the first half helped get them going on a night they were without Fred VanVleet."}
{"game_id": "0022100834", "chunk_id": "0022100834_007", "order": 7, "role": "body", "text": "“It was a big boost,\" Trent said. “No Freddie VanVleet, an All-Star being out, everybody needed to pick up the slack in a sense and everybody needed to come ready to get a win and that’s what we did.\""}
{"game_id": "0022100834", "chunk_id": "0022100834_008", "order": 8, "role": "body", "text": "The Raptors had a 12-point lead to start the fourth and a 9-2 spurt early in the period, with four points from Chris Boucher, pushed their advantage to 114-95 with about 9 minutes to go."}
{"game_id": "0022100834", "chunk_id": "0022100834_009", "order": 9, "role": "body", "text": "Houston used a 14-5 run to cut the deficit to 119-109 with about 5 minutes remaining. The Rockets made four 3-pointers in that stretch, with two from Kevin Porter Jr."}
{"game_id": "0022100834", "chunk_id": "0022100834_010", "order": 10, "role": "body", "text": "Toronto called a timeout, and the Raptors scored the next seven points, highlighted by a steal and three-point play by Trent, to make it 126-109 with 4 minutes to go and Houston didn’t threaten again."}
{"game_id": "0022100834", "chunk_id": "0022100834_011", "order": 11, "role": "body", "text": "Nurse was asked about the key to his team's success during this streak."}
{"game_id": "0022100834", "chunk_id": "0022100834_012", "order": 12, "role": "body", "text": "“Our first five has really meshed together with some great chemistry,\" he said. “They can hit you from a lot of different areas and they’ve been pretty good at finding each other. It’s been a lot of guys playing well and that’s what you need when you go on a longish winning streak.\""}
{"game_id": "0022100834", "chunk_id": "0022100834_013", "order": 13, "role": "body", "text": "Porter had a season-high 30 points and Garrison Mathews added 19 for the Rockets, who lost for the eighth time in nine games."}
{"game_id": "0022100834", "chunk_id": "0022100834_014", "order": 14, "role": "body", "text": "“We’ve been starting games off pretty good, our energy’s been very good,\" coach Stephen Silas said. “But... the growing pains that we have are are evident at (key) points of the game.\""}
{"game_id": "0022100834", "chunk_id": "0022100834_015", "order": 15, "role": "body", "text": "The Raptors were up by nine with about 4 ½ minutes left in the third quarter when Siakam collected his fifth foul and went to the bench. A 3-pointer by Christian Wood got the Rockets within 93-87 soon after that. But an 8-2 spurt by Toronto, with the first four points from Dalano Banton, pushed the lead to 12 with less than a minute left in the third."}
{"game_id": "0022100834", "chunk_id": "0022100834_016", "order": 16, "role": "body", "text": "Josh Christopher made a 3-pointer for Houston with 10 seconds left in the quarter before Chris Boucher’s 3 at the buzzer left the Raptors up 104-92 entering the fourth."}
{"game_id": "0022100834", "chunk_id": "0022100834_018", "order": 18, "role": "body", "text": "Raptors: VanVleet sat out with left groin soreness. ... Boucher had 16 points off the bench. ... Toronto made 15 of 39 3-pointers."}
{"game_id": "0022100834", "chunk_id": "0022100834_019", "order": 19, "role": "body", "text": "Rockets: Eric Gordon missed his third straight game with a foot injury. ... Jalen Green, the second overall pick in the draft, had 18 points. ... Wood had 17 points and 11 rebounds. ... The Rockets had 21 turnovers."}
{"game_id": "0022100834", "chunk_id": "0022100834_021", "order": 21, "role": "body", "text": "Siakam and Trent are the third pair of teammates since the 1997-98 season to score at least 25 points by halftime. Stephen Curry and Klay Thompson did it for the Warriors and James Harden and Chandler Parsons did it while playing for the Rockets."}
{"game_id": "0022100834", "chunk_id": "0022100834_023", "order": 23, "role": "body", "text": "Raptors: Host Denver Saturday night."}
{"game_id": "0022100834", "chunk_id": "0022100834_024", "order": 24, "role": "body", "text": "Rockets: Play the first of four straight road games at Utah Monday night."}
