{"game_id": "0022100754", "chunk_id": "0022100754_001", "order": 1, "role": "lead", "text": "DETROIT -- — Saddiq Bey scored 31 points, Cade Cunningham had 19 points, 10 rebounds and 10 assists and the Detroit Pistons overcame a terrible start to beat the Cleveland Cavaliers 115-105 on Sunday night."}
{"game_id": "0022100754", "chunk_id": "0022100754_002", "order": 2, "role": "body", "text": "After Cleveland raced to a 15-0 lead, Detroit cut it to 55-49 at halftime, and finally took its first lead in the fourth quarter."}
{"game_id": "0022100754", "chunk_id": "0022100754_003", "order": 3, "role": "body", "text": "“That's the beauty of the NBA,” Bey said. “We didn't want to start like that, but we knew we had plenty of time to get back into the game. We just needed to start doing the little things.”"}
{"game_id": "0022100754", "chunk_id": "0022100754_004", "order": 4, "role": "body", "text": "Cunningham finished with the triple-double after failing to score in the first half."}
{"game_id": "0022100754", "chunk_id": "0022100754_005", "order": 5, "role": "body", "text": "“I can't let myself be a prisoner to whatever happens in the first half,” he said. “We made adjustments, and they made adjustments, and I have to be ready to do what I need to do. I have to throw away the first half.”"}
{"game_id": "0022100754", "chunk_id": "0022100754_006", "order": 6, "role": "body", "text": "Frank Jackson added 19 points, and Isaiah Stewart had 14 points and 12 rebounds to help the Pistons end a four-game skid."}
{"game_id": "0022100754", "chunk_id": "0022100754_007", "order": 7, "role": "body", "text": "“I’m really proud of the way this team bounced back,” Pistons coach Dwane Casey said. “Our second unit got us back into the game -- we needed every one of Frank's 19 points.\""}
{"game_id": "0022100754", "chunk_id": "0022100754_008", "order": 8, "role": "body", "text": "Darius Garland had 24 points for Cleveland, and Evan Mobley added 18."}
{"game_id": "0022100754", "chunk_id": "0022100754_009", "order": 9, "role": "body", "text": "“This is a bad loss, and it is going to stick in my mind,” Garland said. “We were up 15-0 and we were still up by 11 with a couple minutes left in the third quarter, but we stopped playing defense. They dictated everything in the fourth quarter -- we let them do whatever they wanted.”"}
{"game_id": "0022100754", "chunk_id": "0022100754_010", "order": 10, "role": "body", "text": "The Cavaliers, who beat the Milwaukee Bucks 115-99 on Wednesday night, lost for the second time in 10 games."}
{"game_id": "0022100754", "chunk_id": "0022100754_011", "order": 11, "role": "body", "text": "“We beat the defending champs, and I think we took it as a sign that we were a better team than we really are,” Mobley said. “Tonight was our wakeup call. We got brought down to earth a little.”"}
{"game_id": "0022100754", "chunk_id": "0022100754_012", "order": 12, "role": "body", "text": "Stewart's layup gave the Pistons their first lead with 5:19 left. He missed a chance at a three-point play, but Cunningham got the offensive rebound and hit a 3-pointer to put Detroit ahead 102-98. Cunningham 3-pointer moved Detroit's run to 20-2 and made it 109-100 with 2:24 left."}
{"game_id": "0022100754", "chunk_id": "0022100754_013", "order": 13, "role": "body", "text": "Cleveland led 88-84 going into the fourth quarter, and Isaac Okoro's 3-pointer made it 98-89 with nine minutes to play, but the Cavaliers only scored six more points."}
{"game_id": "0022100754", "chunk_id": "0022100754_014", "order": 14, "role": "body", "text": "“They got a lot more physical than we did down the stretch,” Cavaliers coach J.B. Bickerstaff said. “They put their heads down and played a more forceful game — that was the difference.”"}
{"game_id": "0022100754", "chunk_id": "0022100754_016", "order": 16, "role": "body", "text": "Cavaliers: Dropped to 10-4 in January."}
{"game_id": "0022100754", "chunk_id": "0022100754_017", "order": 17, "role": "body", "text": "Pistons: Detroit's 84 points in the first three quarters were more than it scored in its last meeting with Cleveland — a 98-78 road loss on Nov. 21"}
{"game_id": "0022100754", "chunk_id": "0022100754_019", "order": 19, "role": "body", "text": "After a 7-30 start, the Pistons are 5-7 in their last 12 games. They are allowing 13.3 points per game off turnovers in that stretch, as opposed to 18.3 in the first 37."}
{"game_id": "0022100754", "chunk_id": "0022100754_020", "order": 20, "role": "body", "text": "“If we keep our turnovers under 12, we’re going to win games,” Casey said. “We can’t give up 27 points like we did when we played Cleveland at their place.”"}
{"game_id": "0022100754", "chunk_id": "0022100754_022", "order": 22, "role": "body", "text": "Cavaliers: Host New Orleans on Monday night."}
{"game_id": "0022100754", "chunk_id": "0022100754_023", "order": 23, "role": "closing", "text": "Pistons: Host New Orleans on Tuesday night."}
