{"game_id": "0022100868", "chunk_id": "0022100868_001", "order": 1, "role": "lead", "text": "MIAMI -- — Luka Doncic scored 21 points and the Dallas Mavericks beat the Miami Heat 107-99 Tuesday night."}
{"game_id": "0022100868", "chunk_id": "0022100868_002", "order": 2, "role": "body", "text": "Jalen Brunson and Maxi Kleber each finished with 19 points and Dorian Finney Smith had 14 points for the Mavericks, who have won 17 of 23 since Jan. 1 and snapped Miami’s five-game winning streak."}
{"game_id": "0022100868", "chunk_id": "0022100868_003", "order": 3, "role": "body", "text": "Recently acquired Davis Bertans had 12 points for Dallas in his debut. Bertans and Spencer Dinwiddie were acquired from Washington for Kristaps Porzingis on Feb. 12. Dinwiddie finished with four points."}
{"game_id": "0022100868", "chunk_id": "0022100868_004", "order": 4, "role": "body", "text": "“The only thing that went through my mind was having fun, enjoying every second on the court,” Bertans said. “I was trying to do my part to help the team win the game, bring energy. We won the game. That’s the best part of it.”"}
{"game_id": "0022100868", "chunk_id": "0022100868_005", "order": 5, "role": "body", "text": "Miami’s Jimmy Butler scored a game-high 29 points and Bam Adebayo finished with 21 for the Heat, which is now tied for the Eastern Conference lead with Chicago."}
{"game_id": "0022100868", "chunk_id": "0022100868_006", "order": 6, "role": "body", "text": "The Heat emphasized double-teaming Doncic, limiting him to 5-of-19 shooting and six points under his season average."}
{"game_id": "0022100868", "chunk_id": "0022100868_007", "order": 7, "role": "body", "text": "“If they’re going to double, somebody is going to be open,” Doncic said. “We struggled in the first half but then picked it up. There was good spacing and that’s why we won the game.”"}
{"game_id": "0022100868", "chunk_id": "0022100868_008", "order": 8, "role": "body", "text": "While Doncic struggled with his shot, Brunson, Kleber, Dorian-Smith and Bertans were a combined 20 of 39."}
{"game_id": "0022100868", "chunk_id": "0022100868_009", "order": 9, "role": "body", "text": "“I thought he did a great job of absorbing the double team and making the right play,” Mavericks coach Jason Kidd said of Doncic. “He was getting the hockey assist tonight. Guys were knocking down shots.”"}
{"game_id": "0022100868", "chunk_id": "0022100868_010", "order": 10, "role": "body", "text": "Doncic’s 11 points in the third period helped the Mavericks erase an eight-point halftime deficit, outscoring Miami 30-19. Dallas took its first lead since early in the second period with about 31 seconds left in the third on Bertans’ 3-point play."}
{"game_id": "0022100868", "chunk_id": "0022100868_011", "order": 11, "role": "body", "text": "“They stayed at home on our shooters for the most part,” Heat coach Erik Spoelstra said. “We did get some good opportunities in the paint but then they just got some key stops repeatedly there in the fourth quarter.”"}
{"game_id": "0022100868", "chunk_id": "0022100868_012", "order": 12, "role": "body", "text": "Kleber’s layup 3:03 into the fourth quarter gave Dallas its first double-digit lead at 91-81."}
{"game_id": "0022100868", "chunk_id": "0022100868_013", "order": 13, "role": "body", "text": "Miami got to 99-95 on Butler’s jumper with 3:50 before 3 pointers from Brunson and Kleber helped Dallas secure the season-series split."}
{"game_id": "0022100868", "chunk_id": "0022100868_014", "order": 14, "role": "body", "text": "“I feel that was a tad bit of a playoff-style basketball game atmosphere, it’s fun,” Butler said. “Those are always the games that you want to play in. We know what we’re capable of.”"}
{"game_id": "0022100868", "chunk_id": "0022100868_015", "order": 15, "role": "body", "text": "Miami guard Tyler Herro, who averages the team’s second-best 20 points per game, didn’t play because of a right knee contusion. In the Heat’s win over Brooklyn on Saturday, Herro returned from a two-game absence (right knee soreness) and scored 15 points."}
{"game_id": "0022100868", "chunk_id": "0022100868_016", "order": 16, "role": "body", "text": "Meanwhile, Heat guard Victor Oladipo, who has missed the entire season as he recovers from offseason knee surgery, will report to the club’s G League affiliate in Sioux Falls, South Dakota, for 5-on-5 practice. The club emphasized Oladipo is not ready yet to participate in games."}
{"game_id": "0022100868", "chunk_id": "0022100868_018", "order": 18, "role": "body", "text": "Mavericks: F/G Reggie Bullock (left hip contusion), F Marquese Chriss (right knee soreness) and G Trey Burks (right shoulder sprain) sat out. ... Dallas improved to 22-11 since Brunson joined the starting lineup on Dec. 12."}
{"game_id": "0022100868", "chunk_id": "0022100868_019", "order": 19, "role": "body", "text": "Heat: C Dewayne Dedmon (back spasms) didn’t play. ... F Haywood Highsmith signed his second 10-day contract and scored six points. Highsmith joined the club on Dec. 30, when multiple Heat players went into COVID-19 protocols."}
{"game_id": "0022100868", "chunk_id": "0022100868_021", "order": 21, "role": "body", "text": "The Heat signed Caleb Martin to a standard contract, replacing the two-way deal the forward had played through the first 57 games. An offseason acquisition after being released by Charlotte, the 26-year-old is averaging nine points per game and shooting a career-best 50% from the field. Martin missed his third straight game because of left Achilles soreness."}
{"game_id": "0022100868", "chunk_id": "0022100868_023", "order": 23, "role": "body", "text": "Mavericks: Visit New Orleans on Thursday."}
{"game_id": "0022100868", "chunk_id": "0022100868_024", "order": 24, "role": "body", "text": "Heat: Visit Charlotte on Thursday."}
