{"game_id": "0022100182", "chunk_id": "0022100182_001", "order": 1, "role": "lead", "text": "DENVER -- — Nikola Jokic had 22 points, 19 rebounds and 10 assists in his return from a one-game suspension, posting his second triple-double of the season to lead the Denver Nuggets to a 105-96 win over the struggling Atlanta Hawks on Friday night."}
{"game_id": "0022100182", "chunk_id": "0022100182_002", "order": 2, "role": "body", "text": "Jokic, the reigning NBA MVP, served the ban for his late-game shove of Markieff Morris in Denver’s win over Miami on Monday. Morris was fined for his role in the exchange of hard fouls."}
{"game_id": "0022100182", "chunk_id": "0022100182_003", "order": 3, "role": "body", "text": "Aaron Gordon had 23 points, Jeff Green scored 16 and rookie Bones Hyland added 15, including two key 3-pointers in the fourth quarter for Denver, which has won the first four on its five-game homestand."}
{"game_id": "0022100182", "chunk_id": "0022100182_004", "order": 4, "role": "body", "text": "Jokic has 59 career triple-doubles, tying him with Larry Bird for eighth all-time."}
{"game_id": "0022100182", "chunk_id": "0022100182_005", "order": 5, "role": "body", "text": "“He’s one of the greatest basketball players ever, so my name being next to his means a lot,” Jokic said. “I’m just going to try to be the best that I can be and I have a couple of years left.”"}
{"game_id": "0022100182", "chunk_id": "0022100182_006", "order": 6, "role": "body", "text": "Trae Young scored 30 points to lead the Hawks, who lost their sixth straight, including a winless four-game road trip. John Collins had 26 points and Clint Capela added 14 points with 13 rebounds."}
{"game_id": "0022100182", "chunk_id": "0022100182_007", "order": 7, "role": "body", "text": "“We’ve got to go home and make up some ground,” coach Nate McMillan said. “It’s just as simple as that. We knew the road was going to be tough and we weren’t able to get a win. We’ll have a couple of home games and we have to make up some ground, take care of business at home.”"}
{"game_id": "0022100182", "chunk_id": "0022100182_008", "order": 8, "role": "body", "text": "Leading by two, the Nuggets put together a 13-2 run that included a pair of 3-pointers by P.J. Dozier and a dunk by Jokic to move in front 78-65 with 1:16 left in the third quarter. They headed into the fourth with a 10-point advantage."}
{"game_id": "0022100182", "chunk_id": "0022100182_009", "order": 9, "role": "body", "text": "Capela’s dunk pulled the Hawks to 88-79 with 7:48 remaining but the Nuggets answered with successive 3-pointers from Hyland, the first off a feed from Jokic, to push their lead to 15 points."}
{"game_id": "0022100182", "chunk_id": "0022100182_010", "order": 10, "role": "body", "text": "“That definitely was a key point,” Nuggets coach Michael Malone said. “Bones has extreme confidence. He shoots into a big basket. He’s not afraid and I think that’s what the veteran players love about him. He’s talented. He’s young. He’s a work in progress but he competes.”"}
{"game_id": "0022100182", "chunk_id": "0022100182_011", "order": 11, "role": "body", "text": "Denver maintained a double-digit lead until the final moments of the game."}
{"game_id": "0022100182", "chunk_id": "0022100182_012", "order": 12, "role": "body", "text": "“They got a big lead and it was just too hard to overcome,” Young said. “They’re a good team on their home court and it was just too much of a deficit.”"}
{"game_id": "0022100182", "chunk_id": "0022100182_013", "order": 13, "role": "body", "text": "The Hawks began the second quarter with a 13-2 run to go in front 38-34. Denver came back to lead 49-46 at halftime, regaining the advantage on consecutive dunks by Gordon and Green."}
{"game_id": "0022100182", "chunk_id": "0022100182_015", "order": 15, "role": "body", "text": "Hawks: Bogdan Bogdanovic (right ankle soreness) and De’Andre Hunter (right wrist soreness) were both back on the court after missing Tuesday night’s game at Utah. However, the pain in Hunter’s wrist flared up later in the game and he missed much of the second half. “It was pretty sore coming into the game and the second half, he took a shot and it just didn’t feel right, so I had to pull him,” McMillan said."}
{"game_id": "0022100182", "chunk_id": "0022100182_016", "order": 16, "role": "body", "text": "Nuggets: Michael Porter Jr. missed a third successive game because of low back pain. He was injured last Saturday against Houston, limping off the floor after missing a breakaway layup. No timetable has been given for his return."}
{"game_id": "0022100182", "chunk_id": "0022100182_018", "order": 18, "role": "body", "text": "Hawks: Return home to host Milwaukee on Sunday night."}
{"game_id": "0022100182", "chunk_id": "0022100182_019", "order": 19, "role": "body", "text": "Nuggets: Close out a five-game homestand Sunday night against Portland."}
