{"game_id": "0022100238", "chunk_id": "0022100238_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Pascal Siakam scored 18 of his season-high 32 points in the first half and the Toronto Raptors continued their recent dominance in Sacramento, thumping the Kings 108-89 on Friday night."}
{"game_id": "0022100238", "chunk_id": "0022100238_002", "order": 2, "role": "body", "text": "Gary Trent Jr. had 23 points as the Raptors ended a three-game skid and won for the second time in eight games. Fred VanVleet added 13 points and six assists."}
{"game_id": "0022100238", "chunk_id": "0022100238_003", "order": 3, "role": "body", "text": "Playing the second half of a back-to-back after getting blown out in Utah on Thursday, the Raptors led by 30 and were aggressive most of the night, taking advantage of breakdowns in the Kings defense to make wide-open shots."}
{"game_id": "0022100238", "chunk_id": "0022100238_004", "order": 4, "role": "body", "text": "“You have to have a short memory in this league,” Toronto coach Nick Nurse said. “I thought (Siakam) came out and went to work. It’s as good as he’s looked offensively in a long time. He did a lot of good stuff.”"}
{"game_id": "0022100238", "chunk_id": "0022100238_005", "order": 5, "role": "body", "text": "The Raptors have won five straight in Sacramento dating to 2016."}
{"game_id": "0022100238", "chunk_id": "0022100238_006", "order": 6, "role": "body", "text": "De’Aaron Fox scored 17 points for the Kings. Harrison Barnes added 14. Sacramento has lost six of seven."}
{"game_id": "0022100238", "chunk_id": "0022100238_007", "order": 7, "role": "body", "text": "“We started the game ready to play. From that point on they pushed us around and we didn’t give ourselves a chance,” Kings coach Luke Walton said. “They played desperate, and for some reason we did not.”"}
{"game_id": "0022100238", "chunk_id": "0022100238_008", "order": 8, "role": "body", "text": "Siakam, who had four points on 2-of-14 shooting against the Jazz, bounced back with one of his best all-around performances of the season. He shot 10 of 12 from the floor and grabbed eight rebounds with two blocks."}
{"game_id": "0022100238", "chunk_id": "0022100238_009", "order": 9, "role": "body", "text": "“I’m learning over the years,” Siakam said. “I always say I’m super tough on myself because I know how hard I work. Sometimes I can over-analyze things. I just wanted to focus on defense, have my presence felt, pressuring the ball and doing things like that. I have to bring that intensity every single night.”"}
{"game_id": "0022100238", "chunk_id": "0022100238_010", "order": 10, "role": "body", "text": "Siakam scored the first eight points of the third quarter with a turnaround jumper followed by a pair of 3-pointers. He later connected on a turnaround jumper to make it 85-57."}
{"game_id": "0022100238", "chunk_id": "0022100238_011", "order": 11, "role": "body", "text": "“Tonight was one of those nights for P,” VanVleet said. “He’s just gotta go do it and he did it tonight. If he plays like that and everybody else is locking in on the defensive end we’ll have a chance most nights.”"}
{"game_id": "0022100238", "chunk_id": "0022100238_012", "order": 12, "role": "body", "text": "Toronto outscored Sacramento 42-18 over the final 13 ½ minutes of the first half including a buzzer-beating shot from the right corner in the second quarter that put the Raptors ahead 63-45."}
{"game_id": "0022100238", "chunk_id": "0022100238_014", "order": 14, "role": "body", "text": "VanVleet’s streak of eight consecutive games with at least three 3-pointers ended but the fifth-year guard made two and moved into sole possession of third place on the Raptors’ career list with 600. Kyle Lowry holds the team record with 1,518."}
{"game_id": "0022100238", "chunk_id": "0022100238_016", "order": 16, "role": "body", "text": "Marvin Bagley III had four points and six assists in 17 minutes in his third consecutive game for Sacramento. The No. 2 overall pick in 2018, Bagley has been relegated to a backup role this season and was limited to one game when he refused to enter a home game against the Phoenix Suns on Nov, 8."}
{"game_id": "0022100238", "chunk_id": "0022100238_018", "order": 18, "role": "body", "text": "Nurse put Scott Barnes at point guard at various times in the second half, and the Raptors rookie responded with six assists for the second consecutive game to overcome shooting 1 of 8."}
{"game_id": "0022100238", "chunk_id": "0022100238_019", "order": 19, "role": "body", "text": "“It just kind of happened that way and it felt like the way to do it with that group out there,” Nurse said. “He made a couple of really good passes that we didn’t capitalize on. I liked it overall. Interesting.”"}
{"game_id": "0022100238", "chunk_id": "0022100238_021", "order": 21, "role": "body", "text": "“I don’t think I could find an excuse in the book for this one. We were just awful tonight.” – Kings guard Tyrese Haliburton."}
{"game_id": "0022100238", "chunk_id": "0022100238_023", "order": 23, "role": "body", "text": "Raptors: Leading scorer OG Anunoby missed his second consecutive game because of a left hip pointer. Anunoby was injured in practice Wednesday."}
{"game_id": "0022100238", "chunk_id": "0022100238_024", "order": 24, "role": "body", "text": "Kings: Barnes made all eight of his free throw attempts in the first quarter while the rest of the Kings were a combined 3 for 10 in the first half. … The crowd at Golden 1 Center showered the team with boos at the end of the third quarter."}
{"game_id": "0022100238", "chunk_id": "0022100238_026", "order": 26, "role": "body", "text": "Raptors: Play the Warriors in San Francisco on Sunday."}
{"game_id": "0022100238", "chunk_id": "0022100238_027", "order": 27, "role": "body", "text": "Kings: Face the Jazz for the third time this season. Utah has won the previous two, including 110-101 at Golden 1 Center on Oct. 22."}
