{"game_id": "0022101091", "chunk_id": "0022101091_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — Theo Maledon scored 17 of his season-high 25 points in the fourth quarter and the Oklahoma City Thunder defeated the Orlando Magic 118-102 on Wednesday night to snap a 10-game losing streak."}
{"game_id": "0022101091", "chunk_id": "0022101091_002", "order": 2, "role": "body", "text": "Maledon, a second-year guard from France, shot 6 of 8 from the field and 4 of 4 at the free-throw line in the fourth quarter."}
{"game_id": "0022101091", "chunk_id": "0022101091_003", "order": 3, "role": "body", "text": "“I think it was just trying to be aggressive and making sure we keep the lead,\" he said. \"I was playing off my teammates and the situation that I was in. That helped me get an advantage, and I think I did a good job using those advantages.”"}
{"game_id": "0022101091", "chunk_id": "0022101091_004", "order": 4, "role": "body", "text": "Tre Mann and Isaiah Roby each scored 21 for the Thunder in a matchup between two of the NBA's worst teams. Shai Gilgeous-Alexander, Oklahoma City’s top scorer this season, sat out with a sore right ankle. He has averaged 30.4 points and 7.3 assists on 54% shooting since the All-Star break."}
{"game_id": "0022101091", "chunk_id": "0022101091_005", "order": 5, "role": "body", "text": "Maledon didn't care that the Magic were near the bottom of the standings."}
{"game_id": "0022101091", "chunk_id": "0022101091_006", "order": 6, "role": "body", "text": "“A win is a win,\" he said. “No matter what, every time we get on the court, we’re trying to win for sure. That was a good one, being able to control, take the lead in the second quarter and maintain the lead and manage it at the end of the game.”"}
{"game_id": "0022101091", "chunk_id": "0022101091_007", "order": 7, "role": "body", "text": "Chuma Okeke scored 19 points and Cole Anthony added 17 for the Magic. Orlando was without Wendell Carter Jr., its leading rebounder and No. 3 scorer, because of left wrist and ankle sprains. Orlando coach Jamahl Mosley said that was no excuse."}
{"game_id": "0022101091", "chunk_id": "0022101091_008", "order": 8, "role": "body", "text": "“It has to be next man up,” Mosley said. “We have to continue to compete, no matter what’s happened. And we were a step slow in areas.”"}
{"game_id": "0022101091", "chunk_id": "0022101091_009", "order": 9, "role": "body", "text": "Orlando led 34-26 at the end of the first quarter, but Oklahoma City outscored the Magic 20-2 to start the second. During that stretch, Oklahoma City's Olivier Sarr was called for a flagrant-1 foul for a hard box out on R.J. Hampton, and Hampton got a technical for complaining about Sarr's contact."}
{"game_id": "0022101091", "chunk_id": "0022101091_010", "order": 10, "role": "body", "text": "After Hampton's free throws, the Thunder scored 13 straight points to take a 46-36 lead. The Thunder held the Magic without a field goal for more than six minutes to start the second quarter and led 60-53 at the break."}
{"game_id": "0022101091", "chunk_id": "0022101091_011", "order": 11, "role": "body", "text": "“I thought we were a little loose early,” Thunder coach Mark Daigneault said. \"And then we really tightened it up with our help especially and did a nice job in the middle of the game. Help-oriented, played hard, competed, good communication. Good in man, good in the zone. I thought we played pretty well defensively for much of the game.”"}
{"game_id": "0022101091", "chunk_id": "0022101091_012", "order": 12, "role": "body", "text": "The Thunder led 84-74 at the end of the third after holding the Magic to 7-for-22 shooting in the period."}
{"game_id": "0022101091", "chunk_id": "0022101091_013", "order": 13, "role": "body", "text": "A lob from Roby to Sarr for a dunk put the Thunder up 93-77 early in the fourth, and Maledon's offense kept them in control."}
{"game_id": "0022101091", "chunk_id": "0022101091_015", "order": 15, "role": "body", "text": "Magic: Rookie G Jalen Suggs missed his fifth straight game while managing a left knee injury. He averages 12.1 points per game. ... C Mo Bamba had 11 points and 10 rebounds."}
{"game_id": "0022101091", "chunk_id": "0022101091_016", "order": 16, "role": "body", "text": "Thunder: Before the opening tip, G Josh Giddey received a trophy for being selected the Western Conference rookie of the month for February. In 10 games, he averaged 16.3 points, 8.7 rebounds and 7.7 assists. He has won the award four straight months. He sat out with a right hip injury. ... Mann scored 14 points in the first quarter. ... G Vit Krejci had 12 points and a career-high 11 rebounds."}
{"game_id": "0022101091", "chunk_id": "0022101091_018", "order": 18, "role": "body", "text": "Daigneault on Maledon, who primarily has been a reserve this season after starting for most of last season: “He’s a really hard worker. He’s highly professional. He attacks the program. And when I say attacks, I mean, attacks. Puts in the extra work. His solution is always more work and putting his head down. And anytime somebody is that committed and is willing to persevere and plow through adversity with work ethic, I respect that and we respect that. And so when he has success on the other side of that, it’s good to see and deserved.\""}
{"game_id": "0022101091", "chunk_id": "0022101091_020", "order": 20, "role": "body", "text": "Mann was coming off a 35-point game against Boston on Monday. He followed it by shooting 7 of 12 against Orlando, including 3 of 6 on 3-pointers."}
{"game_id": "0022101091", "chunk_id": "0022101091_022", "order": 22, "role": "body", "text": "Magic: Host the Sacramento Kings on Saturday."}
{"game_id": "0022101091", "chunk_id": "0022101091_023", "order": 23, "role": "body", "text": "Thunder: At the Denver Nuggets on Saturday."}
{"game_id": "0022101091", "chunk_id": "0022101091_025", "order": 25, "role": "body", "text": "Follow Cliff Brunt on Twitter: twitter.com/CliffBruntAP"}
