{"game_id": "0022100257", "chunk_id": "0022100257_001", "order": 1, "role": "lead", "text": "CHICAGO -- — Domantas Sabonis scored 21 points, Malcolm Brogdon added 16 more, and the Indiana Pacers routed the Chicago Bulls 109-77 on Monday night."}
{"game_id": "0022100257", "chunk_id": "0022100257_002", "order": 2, "role": "body", "text": "Myles Turner also scored 12 points and hauled in 10 rebounds in Indiana's second straight win."}
{"game_id": "0022100257", "chunk_id": "0022100257_003", "order": 3, "role": "body", "text": "“It feels like we’re getting our footing,” Pacers coach Rick Carlisle said. “We're a team that's not going to get any free lunch from anybody. We've got to embrace that fact, and it's got to be something that brings us closer and closer together.”"}
{"game_id": "0022100257", "chunk_id": "0022100257_004", "order": 4, "role": "body", "text": "DeMar DeRozan led the Bulls with 18 points, while Zach LaVine scored 17 — just the second time this season he was held to fewer than 20 points."}
{"game_id": "0022100257", "chunk_id": "0022100257_005", "order": 5, "role": "body", "text": "It was a one-sided affair for much of the night, with Indiana stretching its lead to as many as 35 points in the fourth. Chicago had a few offensive spurts, but ended up with 36.5% shooting for the game. The Bulls played their reserves for the entire final frame."}
{"game_id": "0022100257", "chunk_id": "0022100257_006", "order": 6, "role": "body", "text": "The Pacers came out of the gate firing on all cylinders offensively, opening with a 26-9 run. Justin Holiday and Caris LeVert scored six points apiece within the first four minutes."}
{"game_id": "0022100257", "chunk_id": "0022100257_007", "order": 7, "role": "body", "text": "“Beating a team that's high-powered and doing well is big for us,” Holiday said. “We've been trying to figure out how we can play a full 48 minutes. Our main goal coming in is to play together and play hard. Being able to do that tonight and win it the way we did, it's good for our team to see that, when we play that way, it works.”"}
{"game_id": "0022100257", "chunk_id": "0022100257_008", "order": 8, "role": "body", "text": "Indiana led 67-46 at halftime thanks to a strong effort on the glass, outrebounding the Bulls 28-16 in the first two quarters. DeRozan helped fuel a 10-3 run for Chicago to cut the second-quarter deficit to eight, but key baskets from Brogdon and Kelan Martin down the stretch pushed the Pacers’ advantage to 21 points at the break."}
{"game_id": "0022100257", "chunk_id": "0022100257_009", "order": 9, "role": "body", "text": "Chicago, playing on the second night of a back-to-back, looked sluggish early, going 7 of 22 from the floor in the first quarter, including just 1 of 7 3-pointers."}
{"game_id": "0022100257", "chunk_id": "0022100257_010", "order": 10, "role": "body", "text": "“We missed some good looks,” Bulls coach Billy Donovan said. “As the game started to get into double figures, we got very, very stagnant. The ball didn't move well enough, and we didn't generate enough for each other.”"}
{"game_id": "0022100257", "chunk_id": "0022100257_012", "order": 12, "role": "body", "text": "DeRozan and LaVine entered the game as the NBA’s fourth and fifth leading scorers, respectively. But the two stars received little help on offense Monday, with the Bulls’ three other starters combining for 10 points total. Lonzo Ball missed all seven shots."}
{"game_id": "0022100257", "chunk_id": "0022100257_014", "order": 14, "role": "body", "text": "Pacers: All five of Indiana’s starters finished the night scoring in double figures. ... Indiana’s defensive rebounding efforts created numerous quick-scoring opportunities early on. The Pacers hauled in 21 defensive boards in the first half, which helped them outscore Chicago 14-2 in fast-break points."}
{"game_id": "0022100257", "chunk_id": "0022100257_015", "order": 15, "role": "body", "text": "Bulls: C Nikola Vucevic remains in the cardiovascular testing phase of the league’s COVID-19 health and safety protocols. Vucevic emerged from isolation Sunday after being sidelined on Nov. 11. The Bulls have not yet determined if he will travel for Wednesday’s game in Houston. ...G Alex Caruso (bruised wrist) was a last-minute injury scratch. He hurt his wrist during Chicago’s recent West Coast road trip and reaggravated it when taking a charge during Sunday’s game against New York."}
{"game_id": "0022100257", "chunk_id": "0022100257_017", "order": 17, "role": "body", "text": "Pacers: Host Los Angeles Lakers on Wednesday night."}
{"game_id": "0022100257", "chunk_id": "0022100257_018", "order": 18, "role": "body", "text": "Bulls: At Houston on Wednesday night."}
