{"game_id": "0022100175", "chunk_id": "0022100175_001", "order": 1, "role": "lead", "text": "BOSTON -- — When the Milwaukee Bucks scratched Giannis Antetokounmpo 90 minutes before the tipoff, Boston coach Ime Udoka worried that his team would expect an easy night against the rest of the defending NBA champions."}
{"game_id": "0022100175", "chunk_id": "0022100175_002", "order": 2, "role": "body", "text": "It took the Celtics a while to snap out of it."}
{"game_id": "0022100175", "chunk_id": "0022100175_003", "order": 3, "role": "body", "text": "\"There’s always a natural letdown. That was the message before the game,\" Udoka said after Boston beat Milwaukee 122-113 in overtime Friday night. “The other guys are going to play hard and come in with a ‘nothing to lose’ attitude, and they did.”"}
{"game_id": "0022100175", "chunk_id": "0022100175_004", "order": 4, "role": "body", "text": "Dennis Schröder scored a season-high 38 points — eight in overtime — as the Celtics took advantage of the reigning NBA Finals MVP's absence to pull away. Jayson Tatum scored 27 with 11 rebounds for Boston, which has won four of five since opening the season 2-5."}
{"game_id": "0022100175", "chunk_id": "0022100175_005", "order": 5, "role": "body", "text": "Tatum said that hearing Antetokounmpo was out, joining Khris Middleton, made him “locked in even more.”"}
{"game_id": "0022100175", "chunk_id": "0022100175_006", "order": 6, "role": "body", "text": "“Guys played more free when they know they’re going to get an opportunity,” he said."}
{"game_id": "0022100175", "chunk_id": "0022100175_007", "order": 7, "role": "body", "text": "Jrue Holiday had 17 points and 13 assists, and Bobby Portis scored 22 for the Bucks. Grayson Allen scored 21, hitting a pair of 3-pointers in the final 73 seconds of regulation to send the game into overtime."}
{"game_id": "0022100175", "chunk_id": "0022100175_008", "order": 8, "role": "body", "text": "But Schröder took over from there, scoring six straight points to turn a one-point lead into a runaway."}
{"game_id": "0022100175", "chunk_id": "0022100175_009", "order": 9, "role": "body", "text": "“He got hot late, and we kind of rode his hand there,” Udoka said. “He had a great night tonight, which we needed.”"}
{"game_id": "0022100175", "chunk_id": "0022100175_010", "order": 10, "role": "body", "text": "After Antetokounmpo was scratched with a right ankle sprain, Arlington, Massachusetts, native Pat Connaughton started in his place and scored 15 points. The Bucks lost for the sixth time in their last nine games."}
{"game_id": "0022100175", "chunk_id": "0022100175_011", "order": 11, "role": "body", "text": "The game featured 22 lead changes — and eight ties — in the first 30 minutes before Boston went on a 13-2 run to turn a one-point deficit into a double-digit lead."}
{"game_id": "0022100175", "chunk_id": "0022100175_012", "order": 12, "role": "body", "text": "Robert Williams III had 12 points and 10 rebounds and Marcus Smart scored 12 of his 19 points in the third quarter, when the Celtics erased a four-point deficit and went up by seven."}
{"game_id": "0022100175", "chunk_id": "0022100175_013", "order": 13, "role": "body", "text": "It was 106-100 with 73 seconds left in regulation when Allen hit a 3-pointer, then Tatum turned the ball over. George Hill made a putback of Holiday’s missed 3 to cut the deficit to one point."}
{"game_id": "0022100175", "chunk_id": "0022100175_014", "order": 14, "role": "body", "text": "After Schröder sank a floater, Allen hit a step-back 3-pointer to tie it 108-all with 14 seconds left in the fourth. Tatum’s short jumper at the end of regulation bounced off the front of the rim and the Celtics were headed for their sixth overtime period in 12 games."}
{"game_id": "0022100175", "chunk_id": "0022100175_015", "order": 15, "role": "body", "text": "“I tried to make it at the end,” Tatum said. “End the stress of all these overtimes.”"}
{"game_id": "0022100175", "chunk_id": "0022100175_016", "order": 16, "role": "body", "text": "Boston led 112-111 midway through overtime when Schröder made a pair of baskets, then hit a pair of free throws as the crowd chanted “M-V-P!”"}
{"game_id": "0022100175", "chunk_id": "0022100175_017", "order": 17, "role": "body", "text": "“That’s just great,” he said. “But for me, that doesn't count. I need a win, and that’s what we got.”"}
{"game_id": "0022100175", "chunk_id": "0022100175_018", "order": 18, "role": "body", "text": "Smart scored 12 consecutive Celtics points over a 4:24 span in the third quarter before Tatum hit a 3-pointer that sparked a 13-2 run and gave Boston its first double-digit lead of the game."}
{"game_id": "0022100175", "chunk_id": "0022100175_020", "order": 20, "role": "body", "text": "In addition to Antetokounmpo, the Bucks were also without Middleton (COVID-19 protocols), Brook Lopez (back) and Donte DiVincenzo (foot). The Celtics were without Jaylen Brown (leg). ... The Celtics did not shoot a free throw in the first half. A ccording to Celtics broadcaster Sean Grande, the last time the Bucks came to Boston as the defending NBA champions, on Feb. 13, 1972, Kareem Abdul-Jabbar scored 51 points with 17 rebounds. JoJo White had 31 for Boston."}
{"game_id": "0022100175", "chunk_id": "0022100175_022", "order": 22, "role": "body", "text": "Bucks: At Atlanta on Saturday."}
{"game_id": "0022100175", "chunk_id": "0022100175_023", "order": 23, "role": "body", "text": "Celtics: At Cleveland on Saturday and Monday."}
