{"game_id": "0022100343", "chunk_id": "0022100343_001", "order": 1, "role": "lead", "text": "NEW YORK -- — The Bulls were down, but not out."}
{"game_id": "0022100343", "chunk_id": "0022100343_002", "order": 2, "role": "body", "text": "Behind Zach LaVine’s 31 points and DeMar DeRozan’s 29, 13 in the fourth quarter, Chicago overcame a double-digit deficit in the second half to beat the Brooklyn Nets 111-107 on Saturday night."}
{"game_id": "0022100343", "chunk_id": "0022100343_003", "order": 3, "role": "body", "text": "“I thought they were the quicker, more responsive team earlier in the game,” said coach Billy Donovan. “Coming out of the half we talked about the adjustments we had to make, and they went out there and did it. What DeMar did out there in the third and fourth quarter was amazing.”"}
{"game_id": "0022100343", "chunk_id": "0022100343_004", "order": 4, "role": "body", "text": "Nikola Vucevic and Ayo Dosunmu each added 11 points for the Bulls in a matchup of the top teams in the Eastern Conference."}
{"game_id": "0022100343", "chunk_id": "0022100343_005", "order": 5, "role": "body", "text": "“If you want to be the best, you have to beat the best,” DeRozan said."}
{"game_id": "0022100343", "chunk_id": "0022100343_006", "order": 6, "role": "body", "text": "The Bulls also beat the East-leading Nets on Nov. 8 and have clinched the season series."}
{"game_id": "0022100343", "chunk_id": "0022100343_007", "order": 7, "role": "body", "text": "“We’re just going to keep coming,” DeRozan added. “We’re learning not to get down on ourselves if we’re missing shots. We’re learning a very critical part of the game is to stay level-headed and to stay balanced. There’s a lot of time in the game for things to turn over. Stay the course. That’s what we do.”"}
{"game_id": "0022100343", "chunk_id": "0022100343_008", "order": 8, "role": "body", "text": "Kevin Durant led Brooklyn with 28 points and LaMarcus Aldridge had 20. James Harden added 14 points and 14 assists, but shot 5 for 21 from the field."}
{"game_id": "0022100343", "chunk_id": "0022100343_009", "order": 9, "role": "body", "text": "The Bulls opened the fourth on a 13-4 run and took their biggest lead at 92-86 on DeRozan’s short jumper with 7 minutes remaining."}
{"game_id": "0022100343", "chunk_id": "0022100343_010", "order": 10, "role": "body", "text": "“The greatness that DeMar displays each and every night in those crunch-time situations, to be able to witness what he’s doing on such a high level, making tough shot after tough shot while also being a leader just shows the type of person he is,” Sosunmu said."}
{"game_id": "0022100343", "chunk_id": "0022100343_011", "order": 11, "role": "body", "text": "Aldridge’s layup brought the Nets within 101-100, but they never got closer."}
{"game_id": "0022100343", "chunk_id": "0022100343_012", "order": 12, "role": "body", "text": "Durant’s 3-pointer with 39 seconds left cut it to 107-105, but Lonzo Ball answered with a 3 with 16 seconds remaining to end the threat."}
{"game_id": "0022100343", "chunk_id": "0022100343_013", "order": 13, "role": "body", "text": "Patty Mills, who scored 12 points, gave Brooklyn its biggest lead at 71-60 with 6:34 left in the third quarter."}
{"game_id": "0022100343", "chunk_id": "0022100343_014", "order": 14, "role": "body", "text": "Chicago rallied and LaVine’s 3-pointer trimmed it to 80-79 before Paul Millsap, who scored a season-high 13 points, hit a buzzer-beater to give the Nets an 82-79 lead after three quarters."}
{"game_id": "0022100343", "chunk_id": "0022100343_015", "order": 15, "role": "body", "text": "Brooklyn scored the first nine points of the game, all on 3s, and led 34-28 after the first quarter. The Nets were ahead 56-52 at the half."}
{"game_id": "0022100343", "chunk_id": "0022100343_016", "order": 16, "role": "body", "text": "“We did a lot of good things,” coach Steve Nash said. “Our guys did what we asked them to do. We got 111 shots at the basket. They just didn’t go tonight.”"}
{"game_id": "0022100343", "chunk_id": "0022100343_018", "order": 18, "role": "body", "text": "Bulls: Javonte Green, who had appeared in each of Chicago’s first 23 games, did not play Saturday after testing positive for COVID-19. That leaves DeRozan, LaVine and Ball as the only Bulls to play in every game this season."}
{"game_id": "0022100343", "chunk_id": "0022100343_019", "order": 19, "role": "body", "text": "Nets: Brooklyn has had four back-to-backs so far this season and gone 1-1 each time. … The Nets had won eight of their previous nine home games against the Bulls. … James Johnson did not play due to left shoulder soreness."}
{"game_id": "0022100343", "chunk_id": "0022100343_021", "order": 21, "role": "body", "text": "Durant has played at least 37 minutes in each of his last seven games, including a season-high 45 vs. Phoenix on Nov. 21. “Kevin’s mentality is why he’s one of the best players of all-time,” Nash said. “He loves the game. To tell him we’re going to limit his minutes is not going to go over very well. We try to sneak minutes from him here and there and keep him on the bench for an extra 30 or 40 seconds when we can.”"}
{"game_id": "0022100343", "chunk_id": "0022100343_023", "order": 23, "role": "body", "text": "In their two games prior to Saturday, LaVine, DeRozan and Vucevic all scored 25 or more points while shooting 50% or better from the field. It was the first time three teammates had reached those marks in consecutive games since Mitch Richmond, Chris Mullin and Tim Hardaway did it for Golden State in 1990."}
{"game_id": "0022100343", "chunk_id": "0022100343_025", "order": 25, "role": "body", "text": "Harden has shot 13 for 49 (26.5%) over his last three games."}
{"game_id": "0022100343", "chunk_id": "0022100343_027", "order": 27, "role": "body", "text": "Bulls: Chicago hosts Denver on Monday."}
{"game_id": "0022100343", "chunk_id": "0022100343_028", "order": 28, "role": "closing", "text": "Nets: Brooklyn visits Dallas on Tuesday."}
