{"game_id": "0022100288", "chunk_id": "0022100288_001", "order": 1, "role": "lead", "text": "DENVER -- — Giannis Antetokounmpo had 24 points and 13 rebounds, Pat Connaughton added 20 points off the bench and the Milwaukee Bucks beat the depleted Denver Nuggets 120-109 on Friday night for their sixth straight win."}
{"game_id": "0022100288", "chunk_id": "0022100288_002", "order": 2, "role": "body", "text": "Antetokounmpo hit 10 of 13 shots in just 30 minutes, and the Bucks never trailed in winning by double digits for the third straight game."}
{"game_id": "0022100288", "chunk_id": "0022100288_003", "order": 3, "role": "body", "text": "The anticipated matchup of the last two MVPs didn’t happen. Nikola Jokic, who won last season in becoming the first Denver player to capture the award, missed his fourth straight game with a sprained right wrist. Michael Porter Jr. hasn’t played since Nov. 6 due to lower back soreness and P.J. Dozier suffered a torn ACL in his left knee Tuesday night in Portland."}
{"game_id": "0022100288", "chunk_id": "0022100288_004", "order": 4, "role": "body", "text": "Aaron Gordon led the Nuggets with 18 points and nine rebounds. Will Barton scored 17, and Facu Campazzo finished with 16 points for Denver, which dropped its sixth straight."}
{"game_id": "0022100288", "chunk_id": "0022100288_005", "order": 5, "role": "body", "text": "“The only way we’re going to end this losing streak is if we find a way to play some defense,” Nuggets coach Michael Malone said. “I think our guys are playing hard and I understand we’re undermanned but the reality is the last six games we’re the 30th ranked defense. That is a far cry from the defense that we started the year off playing."}
{"game_id": "0022100288", "chunk_id": "0022100288_006", "order": 6, "role": "body", "text": "“If we continue to be the 30th ranked defense, this losing streak can go for a very long time.”"}
{"game_id": "0022100288", "chunk_id": "0022100288_007", "order": 7, "role": "body", "text": "Milwaukee’s winning streak started with five in a row at home and coincided with getting back to health. Jrue Holiday returned from a left ankle sprain in early November and Khris Middleton missed seven games this month. He returned at the start of the Bucks’ winning streak, which have featured big early leads."}
{"game_id": "0022100288", "chunk_id": "0022100288_008", "order": 8, "role": "body", "text": "“I can’t really give a reason why, I just feel like it’s just comfortable,” Holiday, who had 16 points, said of the fast starts to games. “It’s like that first game when we came out it felt comfortable playing with everybody being back on the court. We went through some struggles and that helped us to kind of find a place.”"}
{"game_id": "0022100288", "chunk_id": "0022100288_009", "order": 9, "role": "body", "text": "Milwaukee threatened to run Denver off the court from the start. The Bucks led 24-8 early in the first quarter and were up by 17 points in the second quarter before the Nuggets made a run to get within 48-43 with 3:45 left in the period."}
{"game_id": "0022100288", "chunk_id": "0022100288_010", "order": 10, "role": "body", "text": "Milwaukee led by 11 at halftime. Denver closed within five in the third quarter. The Nuggets had a chance to make it a one-possession game, but Monte Morris missed a 3-pointer. The Bucks built a 19-point lead late in the quarter. Denver got within 12 points in the fourth period, but never threatened."}
{"game_id": "0022100288", "chunk_id": "0022100288_012", "order": 12, "role": "body", "text": "Bucks: Connaughton took an inadvertent elbow in the first quarter and ended up with a bloody nose. It was ruled a common offensive foul on Jeff Green. ... F Semi Ojeleye missed his fourth straight game with right calf soreness. ... Rodney Hood played despite soreness in his right Achilles."}
{"game_id": "0022100288", "chunk_id": "0022100288_013", "order": 13, "role": "body", "text": "Nuggets: G Bones Hyland (right ankle sprain) missed his second straight game. ... Green and Morris scored 15 each for Denver, while Vlatko Cancar had 10 points in his first extended play this season."}
{"game_id": "0022100288", "chunk_id": "0022100288_015", "order": 15, "role": "body", "text": "Middleton entered Friday with 9,999 career points, and wasted little time in eclipsing the 10,000 mark. He got the ball in front of the Denver bench, rose up and hit a 3-pointer over Green just 36 seconds into the game. He finished with 17 points."}
{"game_id": "0022100288", "chunk_id": "0022100288_016", "order": 16, "role": "body", "text": "“To actually think you’re going to get there the way you started is kind of hard to really believe,” Middleton said. “But that’s why you put the work in every single day to get to these moments. Hopefully I can get to 20,000, because that would mean 10 more years.”"}
{"game_id": "0022100288", "chunk_id": "0022100288_019", "order": 19, "role": "body", "text": "Nuggets: At Miami on Monday night."}
