{"game_id": "0022101096", "chunk_id": "0022101096_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Desmond Bane scored 30 points, hitting 12 of 15 shots, and the Memphis Grizzlies built a big lead early before coasting to a 133-103 victory over the Indiana Pacers on Thursday night to clinch a spot in the playoffs."}
{"game_id": "0022101096", "chunk_id": "0022101096_002", "order": 2, "role": "body", "text": "Jaren Jackson Jr. finished with 20 points, going 7 of 13 from the field, as the Grizzlies shot 54%. De’Anthony Melton added 19 and John Konchar matched his career high with 18. Bane was 5 of 7 from outside the arc as Memphis made a season-high 21 3-pointers."}
{"game_id": "0022101096", "chunk_id": "0022101096_003", "order": 3, "role": "body", "text": "“It just kind of goes,” Bane said of his shooting. “I made my first couple and then found a couple of openings for easy shots, and just kept hooping.”"}
{"game_id": "0022101096", "chunk_id": "0022101096_004", "order": 4, "role": "body", "text": "Before the game, Grizzlies coach Taylor Jenkins announced that leading scorer Ja Morant would miss the next two weeks with right knee soreness. Morant sat out the previous two games after tweaking the knee in Memphis’ loss to Atlanta last Friday."}
{"game_id": "0022101096", "chunk_id": "0022101096_005", "order": 5, "role": "body", "text": "Jenkins noted that what was recently a tight rotation has expanded to include other players."}
{"game_id": "0022101096", "chunk_id": "0022101096_006", "order": 6, "role": "body", "text": "“Unfortunately, with a couple of guys nicked up, it creates some of these opportunities,” the Memphis coach said. “But guys have stayed the course and stayed ready.”"}
{"game_id": "0022101096", "chunk_id": "0022101096_007", "order": 7, "role": "body", "text": "The Grizzlies were sharp again without their All-Star, just as they were in a 132-120 victory over the Brooklyn Nets on Wednesday, and became the second team to lock up a spot in the postseason."}
{"game_id": "0022101096", "chunk_id": "0022101096_008", "order": 8, "role": "body", "text": "With Memphis leading 107-71 entering the fourth, the Grizzlies reserves finished up the game."}
{"game_id": "0022101096", "chunk_id": "0022101096_009", "order": 9, "role": "body", "text": "Lance Stephenson led the Pacers with 25 points, including making all five of his 3-pointers, while Terry Taylor had 17. Goga Bitadze finished with 14."}
{"game_id": "0022101096", "chunk_id": "0022101096_010", "order": 10, "role": "body", "text": "Besides Morant, the Grizzles were also without Dillon Brooks, who rested his left ankle, and Brandon Clarke (left hip soreness.)"}
{"game_id": "0022101096", "chunk_id": "0022101096_011", "order": 11, "role": "body", "text": "Indiana also was playing the second consecutive night after a last-second loss to Sacramento. Like Memphis, the Pacers had multiple players out. Additionally, Pacers coach Rick Carlisle missed the game for personal reasons."}
{"game_id": "0022101096", "chunk_id": "0022101096_012", "order": 12, "role": "body", "text": "“We're short-handed. We’re asking guys to do a little bit more, … and needing them to do a little bit more,” said acting coach Lloyd Pierce. “It puts you in a situation where you need everything to go right. Obviously, tonight, it didn’t go well for us.”"}
{"game_id": "0022101096", "chunk_id": "0022101096_013", "order": 13, "role": "body", "text": "As they did against Brooklyn, the Grizzlies surpassed 70 points in the first half, taking a 74-48 lead into the locker room. Bane had 23 points, missing only one of his shots in the half, going 5 of 6 from outside the arc."}
{"game_id": "0022101096", "chunk_id": "0022101096_014", "order": 14, "role": "body", "text": "The Grizzlies opened the second half on a 10-0 run and Memphis had its seventh win in the last eight."}
{"game_id": "0022101096", "chunk_id": "0022101096_015", "order": 15, "role": "body", "text": "“I’m glad I don’t have to go against us,” Bane said, noting the Grizzlies handed out 34 assists, including four players with at least five. “We’ve got multiple guys that can handle. Multiple guys that can shoot, pass. It makes us that much tougher to guard."}
{"game_id": "0022101096", "chunk_id": "0022101096_016", "order": 16, "role": "body", "text": "“It’s definitely hard to go against, and it is fun when you are on the other side.”"}
{"game_id": "0022101096", "chunk_id": "0022101096_018", "order": 18, "role": "body", "text": "Despite clinching the playoff spot, Memphis players weren’t celebrating the accomplishment. There are still other goals. “It’s cool, I guess,” Jackson said. “But we’ve got to move on. The playoffs are going to come soon. Before we know it, we’re going to be in it. The goal will change. We want to win a series, and then the next one. One game at a time. But the goal is to win a championship.”"}
{"game_id": "0022101096", "chunk_id": "0022101096_020", "order": 20, "role": "body", "text": "Pacers: G Malcolm Brogdon missed his third game with rest. … Bitadze has reached double figures in seven straight. … Duane Washington Jr., who turned 22 on Thursday, finished with four points. … Indiana is 9-28 on the road."}
{"game_id": "0022101096", "chunk_id": "0022101096_021", "order": 21, "role": "body", "text": "Grizzlies: Memphis outscored the Pacers 44-23 in the first quarter, matching its most points in a quarter this season. … The 10 3-pointers in the first quarter were a franchise record. … Memphis is 7-1 against the Central Division. Its only loss was to the Milwaukee Bucks, whom Memphis plays Saturday night. … C Steven Adams had 17 rebounds, nine of them off the offensive glass. … With Morant out, the Grizzlies failed to win the points in the paint for the second straight night. Memphis and Indiana both had 54 paint points."}
{"game_id": "0022101096", "chunk_id": "0022101096_023", "order": 23, "role": "body", "text": "Pacers: Travel to Toronto to face the Raptors on Saturday."}
{"game_id": "0022101096", "chunk_id": "0022101096_024", "order": 24, "role": "body", "text": "Grizzlies: Continue a four-game homestand Saturday against Milwaukee."}
