{"game_id": "0022100780", "chunk_id": "0022100780_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Tyrese Haliburton scored seven of his 12 points in the fourth quarter on his way to a double-double, and the Sacramento Kings handed the stumbling Brooklyn Nets their sixth consecutive loss, 112-101 on Wednesday night."}
{"game_id": "0022100780", "chunk_id": "0022100780_002", "order": 2, "role": "body", "text": "Harrison Barnes scored 19 points and Haliburton had 11 assists to help the Kings stop a seven-game skid. Buddy Hield and Davion Mitchell scored 18 apiece."}
{"game_id": "0022100780", "chunk_id": "0022100780_003", "order": 3, "role": "body", "text": "Nic Claxton had a career-high 23 points and grabbed 11 rebounds for Brooklyn. James Johnson added 18 points."}
{"game_id": "0022100780", "chunk_id": "0022100780_004", "order": 4, "role": "body", "text": "James Harden, who has been nursing a sore right hand and a hamstring injury, was held to four points, his fewest since scoring five against the Chicago Bulls on May 15, 2021."}
{"game_id": "0022100780", "chunk_id": "0022100780_005", "order": 5, "role": "body", "text": "“There’s no concern,” Harden said. “We don’t have our entire team and this is happening to us. We’re just trying to figure out what works best, what guys fit, what guys don’t. Hopefully after the break we can get our whole roster and start making strides in the right direction.”"}
{"game_id": "0022100780", "chunk_id": "0022100780_006", "order": 6, "role": "body", "text": "The Nets’ skid is their longest since a seven-game slide Dec. 26, 2019, to Jan. 7, 2020. Brooklyn, which played at NBA-best Phoenix on Tuesday night, hasn’t won since beating the Spurs in San Antonio on Jan. 21."}
{"game_id": "0022100780", "chunk_id": "0022100780_007", "order": 7, "role": "body", "text": "Nets coach Steve Nash said his team looked tired in the second half."}
{"game_id": "0022100780", "chunk_id": "0022100780_008", "order": 8, "role": "body", "text": "“This trip our objective is to get better. The first two games and the first half tonight we were getting better,” Nash said. “We didn’t contain the ball enough in the second half and we didn’t make plays.”"}
{"game_id": "0022100780", "chunk_id": "0022100780_009", "order": 9, "role": "body", "text": "The Kings trailed by eight at halftime and were down 86-83 going into the fourth quarter."}
{"game_id": "0022100780", "chunk_id": "0022100780_010", "order": 10, "role": "body", "text": "Haliburton converted a three-point play as part of a 9-0 run to open the final period. He made a 17-footer to put the Kings up 97-91, then later drove through the lane to make it 101-93."}
{"game_id": "0022100780", "chunk_id": "0022100780_011", "order": 11, "role": "body", "text": "“It felt like we were on a string as a unit,” Haliburton said. “We were together communicating and that helped us a lot. That’s why good things happened for us.”"}
{"game_id": "0022100780", "chunk_id": "0022100780_012", "order": 12, "role": "body", "text": "Johnson’s dunk cut Sacramento’s lead to 107-101 but Chimezie Metu had a three-point play, made two free throws and then blocked a shot by Patty Mills."}
{"game_id": "0022100780", "chunk_id": "0022100780_013", "order": 13, "role": "body", "text": "“I just thought it was a really good defensive effort,” Kings interim coach Alvin Gentry said. “When you can hold that team to (101) points … I really liked the activity in the fourth quarter on the defensive end.”"}
{"game_id": "0022100780", "chunk_id": "0022100780_014", "order": 14, "role": "body", "text": "Claxton got the Nets going early with 11 points in the first quarter. Kyrie Irving added a pair of 3-pointers to put Brooklyn ahead 31-23."}
{"game_id": "0022100780", "chunk_id": "0022100780_015", "order": 15, "role": "body", "text": "Haliburton’s jumper closed the Kings to 45-43 but Irving made a short jumper and Mills followed with a pair of 3s."}
{"game_id": "0022100780", "chunk_id": "0022100780_016", "order": 16, "role": "body", "text": "Sacramento got close again in the third and had a chance to cut Brooklyn’s lead to two when Claxton blocked Haliburton’s shot from behind and scored on the other end. The Nets’ big man dunked a few moments later to make it 71-65."}
{"game_id": "0022100780", "chunk_id": "0022100780_018", "order": 18, "role": "body", "text": "“When you’re going through a losing streak, not many people want to hear the same thing over and over again. The get-better jargon that we consistently use, it can get mundane. Game to game we’re feeling like we’re coming out with some morale victories if we lose, but I’m tired of that.” — Irving on the Nets' woes."}
{"game_id": "0022100780", "chunk_id": "0022100780_020", "order": 20, "role": "body", "text": "Nets: Harden was whistled for a technical foul in the fourth quarter. … LaMarcus Aldridge sat out a second straight game because of a left ankle sprain."}
{"game_id": "0022100780", "chunk_id": "0022100780_021", "order": 21, "role": "body", "text": "Kings: Haliburton’s double-double was his 13th this season. … Mitchell had nine points in the third quarter. … De’Aaron Fox missed his sixth straight game because of left ankle soreness. … Marvin Bagley III (left ankle sprain) did not play for the second consecutive game."}
{"game_id": "0022100780", "chunk_id": "0022100780_023", "order": 23, "role": "body", "text": "Nets: Face the Jazz in Utah on Friday."}
{"game_id": "0022100780", "chunk_id": "0022100780_024", "order": 24, "role": "body", "text": "Kings: Play the Warriors in San Francisco on Thursday. Golden State has won three straight against Sacramento, including twice this season."}
