{"game_id": "0022101205", "chunk_id": "0022101205_001", "order": 1, "role": "lead", "text": "NEW YORK -- — After a season full of complications, things are finally simple for the Brooklyn Nets."}
{"game_id": "0022101205", "chunk_id": "0022101205_002", "order": 2, "role": "body", "text": "Win two games at home and they're in the playoffs."}
{"game_id": "0022101205", "chunk_id": "0022101205_003", "order": 3, "role": "body", "text": "Kevin Durant scored 36 points, leading a pair of fourth-quarter surges that carried the Nets into a tie for seventh place in the Eastern Conference with a 118-107 victory over the Cleveland Cavaliers on Friday night."}
{"game_id": "0022101205", "chunk_id": "0022101205_004", "order": 4, "role": "body", "text": "The Nets caught the Cavaliers at 43-38 with a game remaining and clinched the tiebreaker. They will finish seventh if they beat Indiana on Sunday in their final regular-season game. The No. 7 team hosts No. 8 on Tuesday, moving into the playoffs with a victory."}
{"game_id": "0022101205", "chunk_id": "0022101205_005", "order": 5, "role": "body", "text": "Brooklyn put itself in position for that by regaining control in the fourth quarter and holding Cleveland to 19 points."}
{"game_id": "0022101205", "chunk_id": "0022101205_006", "order": 6, "role": "body", "text": "“Game of runs. We made ours early, they hit us in the mouth and I like how we responded,” Durant said. “So that’s just been the nature of our season. Just getting knocked down and seeing how we respond and I thought tonight was a good example of how we can respond.”"}
{"game_id": "0022101205", "chunk_id": "0022101205_007", "order": 7, "role": "body", "text": "The loser of the 7-8 game has a second shot at the postseason by beating the winner of the game between the Nos. 9 and 10 teams on Friday."}
{"game_id": "0022101205", "chunk_id": "0022101205_008", "order": 8, "role": "body", "text": "The Nets didn't figure on having to worry about any of that. But between Durant missing 21 games with a sprained knee, Irving missing many more because he isn't vaccinated against the coronavirus and couldn't play in New York until recently, and the midseason trade of James Harden, they never turned into the predicted powerhouse."}
{"game_id": "0022101205", "chunk_id": "0022101205_009", "order": 9, "role": "body", "text": "“That’s the past,” Irving said. “Now we just control what we can control and get ready to hoop.”"}
{"game_id": "0022101205", "chunk_id": "0022101205_010", "order": 10, "role": "body", "text": "Irving shook off a poor shooting night to finish with 18 points, eight assists and six rebounds. Bruce Brown had 18 points, 10 rebounds and eight assists for the Nets, who won their third straight. Andre Drummond had 15 points and 12 rebounds."}
{"game_id": "0022101205", "chunk_id": "0022101205_011", "order": 11, "role": "body", "text": "Darius Garland scored 31 points for the Cavaliers, who dropped their third straight. They got rookie Evan Mobley back after a five-game absence with a sprained left ankle but are still missing All-Star center Jarrett Allen because of a broken finger that has sidelined him nearly a month."}
{"game_id": "0022101205", "chunk_id": "0022101205_012", "order": 12, "role": "body", "text": "“I’m proud of the way they played and proud of the effort that they played with, the way they kept coming back and staying in the game,” Cavs coach J.B. Bickerstaff said. \"We had a few lapses, especially in that fourth quarter and when you have great players like they got, they make you pay.”"}
{"game_id": "0022101205", "chunk_id": "0022101205_013", "order": 13, "role": "body", "text": "Mobley and Lauri Markkanen each had 17 points."}
{"game_id": "0022101205", "chunk_id": "0022101205_014", "order": 14, "role": "body", "text": "“I just went out there and played,\" Mobley said. \"Wasn’t trying to think too much about not playing and stuff like that, so I was just really playing my game and I feel like it came pretty easily tonight, fitting in pretty comfortable from the start of the game.”"}
{"game_id": "0022101205", "chunk_id": "0022101205_015", "order": 15, "role": "body", "text": "Durant scored 16 points in the first quarter but the Cavaliers defended well across the middle two periods and were ahead 93-89 early in the fourth. Durant then made a go-ahead 3-pointer during a 10-0 spurt that made it 99-93."}
{"game_id": "0022101205", "chunk_id": "0022101205_016", "order": 16, "role": "body", "text": "Cleveland got the next two baskets but Durant made another 3 to kick off an 8-0 run that put Brooklyn in control at 107-97 with about 4 1/2 minutes remaining."}
{"game_id": "0022101205", "chunk_id": "0022101205_017", "order": 17, "role": "body", "text": "Durant was 6 for 7 in the first quarter and the Nets led 34-19. Cleveland cut it to 62-54 at the half."}
{"game_id": "0022101205", "chunk_id": "0022101205_019", "order": 19, "role": "body", "text": "Cavaliers: Cedi Osman turned 27. ... Former Nets swingman Caris LeVert scored 16 points. ... Garland, on a potential return of Allen: \"We’re scary with him or without him.”"}
{"game_id": "0022101205", "chunk_id": "0022101205_020", "order": 20, "role": "body", "text": "Nets: Coach Steve Nash, on the decision to waive veteran James Johnson on Thursday: “There’s a lot of tough decisions throughout the year, so that’s just another tough one and sometimes it’s a bit unforeseen where things are going to go and the decision was made.”"}
{"game_id": "0022101205", "chunk_id": "0022101205_022", "order": 22, "role": "body", "text": "Bickerstaff said he wasn't offended by the notion that top teams in the East might have been angling to avoid the Nets and would rather face his young team."}
{"game_id": "0022101205", "chunk_id": "0022101205_023", "order": 23, "role": "body", "text": "“I mean, the perception or the reality of Kevin Durant and Kyrie Irving and the pieces that are around this team and the way that they’re coached, you can understand why people would want to do that,” Bickerstaff said. “But I’ll tell you this, if we’re healthy, we’re not a team people want to face.”"}
{"game_id": "0022101205", "chunk_id": "0022101205_025", "order": 25, "role": "body", "text": "Garland, on the possibility of getting Allen back before the postseason:"}
{"game_id": "0022101205", "chunk_id": "0022101205_026", "order": 26, "role": "body", "text": "“We’re scary with him or without him. A lot of teams that probably don’t want to see us with him or without him, So if we get him back, great. If we don’t, great. We still got basketball games to play.”"}
{"game_id": "0022101205", "chunk_id": "0022101205_028", "order": 28, "role": "body", "text": "Cavaliers: Host Milwaukee on Sunday."}
