{"game_id": "0022100297", "chunk_id": "0022100297_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Christian Wood scored a career-high 33 points and had 16 rebounds to help the Houston Rockets beat the Charlotte Hornets 146-143 in overtime on Saturday night."}
{"game_id": "0022100297", "chunk_id": "0022100297_002", "order": 2, "role": "body", "text": "The Rockets have won two straight after a 15-game losing streak."}
{"game_id": "0022100297", "chunk_id": "0022100297_003", "order": 3, "role": "body", "text": "“It feels great to get a win,” Wood said. “We went a month without winning a game. We haven’t seen that winning energy in the locker room so it’s good to see it. Now we have that winning momentum, and we need to just carry it over.”"}
{"game_id": "0022100297", "chunk_id": "0022100297_004", "order": 4, "role": "body", "text": "Charlotte’s P.J. Washington forced overtime with a putback dunk off a missed 3 from LaMelo Ball, tying it at 135 with 4.4 seconds remaining."}
{"game_id": "0022100297", "chunk_id": "0022100297_005", "order": 5, "role": "body", "text": "In overtime, Kelly Oubre Jr. missed a 3 with 3 seconds remaining that would have given Charlotte the lead."}
{"game_id": "0022100297", "chunk_id": "0022100297_006", "order": 6, "role": "body", "text": "The Rockets entered the fourth with a 110-99 lead and led by as much as 17 in the game, but Charlotte tied it at 124 with 3:38 remaining and briefly took the lead a few plays later."}
{"game_id": "0022100297", "chunk_id": "0022100297_007", "order": 7, "role": "body", "text": "Charlotte entered Saturday having won three straight and eight of its last nine games."}
{"game_id": "0022100297", "chunk_id": "0022100297_008", "order": 8, "role": "body", "text": "Terry Rozier led Charlotte with 31 points, Oubre had 23, Miles Bridges 22, Gordon Hayward 21 and Ball 19."}
{"game_id": "0022100297", "chunk_id": "0022100297_009", "order": 9, "role": "body", "text": "For Houston, Kevin Porter Jr. had 23, Eric Gordon 22, Garrison Mathews 20 and Jae’Sean Tate added 16."}
{"game_id": "0022100297", "chunk_id": "0022100297_010", "order": 10, "role": "body", "text": "“We were moving the ball, taking open shots and making open shots,” Rockets coach Stephen Silas said. “Once a few go, you’re feeling a lot more confident about shooting your shot. We’re feeling pretty confident shooting right now.”"}
{"game_id": "0022100297", "chunk_id": "0022100297_011", "order": 11, "role": "body", "text": "The Rockets were boosted by hot 3-point shooting. Houston hit 23 of 49 3-pointers for 46.9%. The Rockets improved to 3-3 when making more 3s than their opponent. They’re 0-13 when they get outshot from long range."}
{"game_id": "0022100297", "chunk_id": "0022100297_012", "order": 12, "role": "body", "text": "“They were too comfortable, too early,” Hornets coach James Borrego said. “They got what they wanted. They made 3s. Give them credit -- they made shots tonight, but we could’ve been much better, defensively.”"}
{"game_id": "0022100297", "chunk_id": "0022100297_013", "order": 13, "role": "body", "text": "Houston played its first game without rookie point guard Jalen Green, the second-overall pick, who suffered a left hamstring strain."}
{"game_id": "0022100297", "chunk_id": "0022100297_014", "order": 14, "role": "body", "text": "Houston was coming off a 118-113 win over Chicago on Wednesday night."}
{"game_id": "0022100297", "chunk_id": "0022100297_015", "order": 15, "role": "body", "text": "“We’re just playing better on both sides of the ball,” Gordon said. “We’re trusting each other more. It’s good to have a game like this where guys are knocking down shots, and we’re keeping the ball moving.”"}
{"game_id": "0022100297", "chunk_id": "0022100297_017", "order": 17, "role": "body", "text": "Hornets: C Mason Plumlee missed the game with a right calf strain. … Oubre received a technical foul with 1:58 remaining in the fourth quarter."}
{"game_id": "0022100297", "chunk_id": "0022100297_018", "order": 18, "role": "body", "text": "Rockets: PG John Wall, who has not played this season while the Rockets try to facilitate a trade, took shots during a pregame workout. Rockets coach Stephen Silas said Saturday night that Wall has had conversations with GM Rafael Stone about a possible return."}
{"game_id": "0022100297", "chunk_id": "0022100297_020", "order": 20, "role": "body", "text": "Mathews and Armoni Brooks made a huge impact for Houston by spacing out the floor and knocking down 3s. Mathews made 5 of 9 and Brooks made 5 of 11 for Houston, making nearly half of the team’s 23 3s. Both shooters had season highs in 3-pointers made. Mathews is on a two-way contract and was just recalled two weeks ago."}
{"game_id": "0022100297", "chunk_id": "0022100297_021", "order": 21, "role": "body", "text": "“When you call up a two-way guy, you usually don’t expect him to make the main playing group, but he’s earned it,” Silas said."}
{"game_id": "0022100297", "chunk_id": "0022100297_023", "order": 23, "role": "body", "text": "Borrego said the Hornets have had the toughest strength of schedule in the NBA and have only had one stretch of two days’ rest. Charlotte hosted Minnesota on Friday night before heading to Houston and will visit Chicago on Monday."}
{"game_id": "0022100297", "chunk_id": "0022100297_024", "order": 24, "role": "body", "text": "“You’re going to have these moments,” Borrego said. “But I love that this group continued to battle. Nobody gave in tonight, but we kept fighting, pushed it to overtime and had a chance to win it.”"}
{"game_id": "0022100297", "chunk_id": "0022100297_026", "order": 26, "role": "body", "text": "“They’re one of the worst shooting teams in the NBA, and they made 3s tonight.” -- Borrego"}
{"game_id": "0022100297", "chunk_id": "0022100297_028", "order": 28, "role": "body", "text": "Hornets: At Chicago on Monday night."}
{"game_id": "0022100297", "chunk_id": "0022100297_029", "order": 29, "role": "closing", "text": "Rockets: Host Oklahoma City on Monday night."}
