{"game_id": "0022101222", "chunk_id": "0022101222_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Amir Coffey had career highs of 32 points and 13 rebounds, and the Los Angeles Clippers routed the depleted Oklahoma City Thunder 138-88 on Sunday night to end the regular season on a five-game winning streak."}
{"game_id": "0022101222", "chunk_id": "0022101222_002", "order": 2, "role": "body", "text": "The Clippers finished 42-40, a major accomplishment after playing the entire season without injured superstar Kawhi Leonard — and with Paul George only returning recently after missing 43 games with an elbow injury."}
{"game_id": "0022101222", "chunk_id": "0022101222_003", "order": 3, "role": "body", "text": "The Clippers rested George and Reggie Jackson, while Norman Powell sat out for maintenance after returning from a left foot injury earlier in the week. Marcus Morris was out sick. Still, they equaled their second-longest winning streak of the season in a tune-up for the play-in tournament that awaits this week."}
{"game_id": "0022101222", "chunk_id": "0022101222_004", "order": 4, "role": "body", "text": "“We did a good job of playing the right way on both sides of the basketball,” Clippers coach Tyronn Lue said. “The bench was really strong, 34 assists, moving bodies, that’s what we wanted to see going into the play-in game.”"}
{"game_id": "0022101222", "chunk_id": "0022101222_005", "order": 5, "role": "body", "text": "Coffey wore a championship belt inscribed “Big Moment Fella” across his chest after the game."}
{"game_id": "0022101222", "chunk_id": "0022101222_006", "order": 6, "role": "body", "text": "“I'm sleeping next to it tonight,” he said. “I’ve always been a guy that tries to stay in the moment, but looking back the last few years seeing my progression, it’s a good feeling. I got to keep working, I’m just getting started.”"}
{"game_id": "0022101222", "chunk_id": "0022101222_007", "order": 7, "role": "body", "text": "Luke Kennard added 20 points, Brandon Boston Jr. scored 18 and Ivica Zubac had 12 points and 11 rebounds for the Clippers, whose winning margin was the largest in franchise history. All nine of their players scored and the team made 18 3-pointers."}
{"game_id": "0022101222", "chunk_id": "0022101222_008", "order": 8, "role": "body", "text": "“Just the win is good enough for me,” Lue said. “It’s not like we were trying to show up OKC. The guys just played really good.”"}
{"game_id": "0022101222", "chunk_id": "0022101222_009", "order": 9, "role": "body", "text": "The Thunder staggered to the finish. Three of their starting five played on 10-day contracts with much of the roster idled by injury. They dropped three in a row and five of the last seven to end the season."}
{"game_id": "0022101222", "chunk_id": "0022101222_010", "order": 10, "role": "body", "text": "Zavier Simpson and Georgios Kalaitzakis scored 17 points each for Oklahoma City. Jaylen Hoard had 14 points and 15 rebounds."}
{"game_id": "0022101222", "chunk_id": "0022101222_011", "order": 11, "role": "body", "text": "“To come to the Thunder and play the last four games, it was a great opportunity,\" Kalaitzakis said. \"I’m thankful for the organization for giving me this opportunity and got to keep going and get better and keep working hard and developing my game.”"}
{"game_id": "0022101222", "chunk_id": "0022101222_012", "order": 12, "role": "body", "text": "Los Angeles got the rout going early, hitting five straight 3-pointers to lead by 16 while shooting 62% in the first quarter."}
{"game_id": "0022101222", "chunk_id": "0022101222_013", "order": 13, "role": "body", "text": "The Clippers outscored the Thunder 18-5 midway through the second to go up by 29. The Thunder closed to 66-51 at halftime on a 3-pointer by Vit Krejci."}
{"game_id": "0022101222", "chunk_id": "0022101222_014", "order": 14, "role": "body", "text": "The crowd mocked Kalaitzakis after he stole the ball from Zubac at midcourt and missed a wide-open dunk in the third, when the Thunder were held to 18 points."}
{"game_id": "0022101222", "chunk_id": "0022101222_015", "order": 15, "role": "body", "text": "The Clippers opened the third with an 18-4 run, including 16 points in a row, and led 95-67 going into the fourth."}
{"game_id": "0022101222", "chunk_id": "0022101222_016", "order": 16, "role": "body", "text": "They finished off the blowout by scoring 43 points in the fourth, including 15 by Coffey."}
{"game_id": "0022101222", "chunk_id": "0022101222_018", "order": 18, "role": "body", "text": "Thunder: Finished 12-29 on the road. ... Shot 9 of 34 from 3-point range. ... Got outrebounded 57-40."}
{"game_id": "0022101222", "chunk_id": "0022101222_019", "order": 19, "role": "body", "text": "Clippers: Coffey's seven 3-pointers were also a career high. ... Notched their 11th consecutive winning season, the longest active streak in the league. ... The bench outscored the Thunder reserves 52-8. ... Zubac went over 3,000 career points. ... Won season series, 2-1."}
{"game_id": "0022101222", "chunk_id": "0022101222_021", "order": 21, "role": "body", "text": "Thunder: Head home for the summer, having finished the season with a 24-58 record."}
{"game_id": "0022101222", "chunk_id": "0022101222_022", "order": 22, "role": "body", "text": "Clippers: At Minnesota on Tuesday in the play-in tournament. The winner gets the No. 7 seed and a first-round playoff series with the Memphis Grizzlies."}
