{"game_id": "0022100867", "chunk_id": "0022100867_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young scored 41 points, Danilo Gallinari added 25 and the Atlanta Hawks held off the Cleveland Cavaliers 124-116 on Tuesday night."}
{"game_id": "0022100867", "chunk_id": "0022100867_002", "order": 2, "role": "body", "text": "Cleveland, sitting in third place in the Eastern Conference, lost consecutive games for the first time since Dec. 31. The Hawks are 10th in the East and had dropped two straight and five of seven."}
{"game_id": "0022100867", "chunk_id": "0022100867_003", "order": 3, "role": "body", "text": "Darius Garland finished with 30 points, Evan Mobley had 21 points and Kevin Love 20 for the Cavaliers, who had held opponents under 100 points 23 times this season but struggled to contain Young’s frantic pace."}
{"game_id": "0022100867", "chunk_id": "0022100867_004", "order": 4, "role": "body", "text": "“I just thought we played good,\" Young said. “We made shots and got stops when we needed to. Besides that first quarter, they didn’t really have a big quarter.\""}
{"game_id": "0022100867", "chunk_id": "0022100867_005", "order": 5, "role": "body", "text": "The Cavaliers called timeout after Young dished to De’Andre Hunter for a straightaway 3 that made it 113-104 with 4:50 to go. Young missed a layup and Garland drove to assist on Jarrett Allen’s hook shot that trimmed the lead to 113-109. But a couple of possessions later, Young assisted on Kevin Huerter’s corner 3 that made it 120-111 and drove the lane for a runner that put the Hawks up 122-114 with 1:27 remaining."}
{"game_id": "0022100867", "chunk_id": "0022100867_006", "order": 6, "role": "body", "text": "Beating a team like Cleveland gave the Hawks a dose of self-respect."}
{"game_id": "0022100867", "chunk_id": "0022100867_007", "order": 7, "role": "body", "text": "“It’s big,\" Young said. “It’s good that we finished off (ahead of the All-Star) break at home the right way, and we’ve got one more we’ve got to take care of before the break. Just a clear mind and come back after the break and finish the season strong. It was big to get this one.\""}
{"game_id": "0022100867", "chunk_id": "0022100867_008", "order": 8, "role": "body", "text": "Garland, averaging 23.4 points and 9.5 assists over his previous 10 games, took charge in the third period by driving the lane and either dishing off or scoring. The Cavaliers led 79-75 on his layup, and the Hawks soon called timeout."}
{"game_id": "0022100867", "chunk_id": "0022100867_009", "order": 9, "role": "body", "text": "Whatever coach Nate McMillan told his team must have made a difference because Atlanta went up 80-79 on a pair of free throws by Young at the 6:37 mark and didn’t trail again. The Hawks twice took an eight-point lead late in the third and were ahead 94-90 entering the fourth."}
{"game_id": "0022100867", "chunk_id": "0022100867_010", "order": 10, "role": "body", "text": "“Our defense was solid from start to finish, and I thought we got better with our pressure in that fourth quarter and I thought Kevin (Huerter) and De'Andre (Hunter) — just really a team effort getting pressure on Garland and just making it difficult for him to come off the screen and get a clean look,\" McMillan said. “The pressure was turned up, and the offensive execution I thought was really good.\""}
{"game_id": "0022100867", "chunk_id": "0022100867_011", "order": 11, "role": "body", "text": "Cleveland missed five straight shots and had a turnover to open the second quarter and trailed 44-37 for the Hawks’ biggest lead, but the Cavs went on a 14-4 run to briefly reclaim momentum. Atlanta led 66-61 at halftime."}
{"game_id": "0022100867", "chunk_id": "0022100867_012", "order": 12, "role": "body", "text": "Cleveland coach J.B. Bickerstaff isn't concerned that his team is heading into the All-Star break with two straight losses."}
{"game_id": "0022100867", "chunk_id": "0022100867_013", "order": 13, "role": "body", "text": "“We’ll be fine,\" Bickerstaff said. “We lost to two good basketball teams, two players that are elite players in Trae Young and Joel Embiid. They had great nights and they had to have great nights to beat us, so we’ll go back obviously and come back confident and ready to go.\""}
{"game_id": "0022100867", "chunk_id": "0022100867_014", "order": 14, "role": "body", "text": "There were 14 lead changes and nine ties in the first two quarters."}
{"game_id": "0022100867", "chunk_id": "0022100867_015", "order": 15, "role": "body", "text": "In a matchup of All-Star guards, Young had 23 points and six assists in the first half while Garland had 18 points with three assists."}
{"game_id": "0022100867", "chunk_id": "0022100867_017", "order": 17, "role": "body", "text": "Cavaliers: F Lauri Markkanen missed his 11th straight game with a right ankle sprain. Bickerstaff said he will remain in Cleveland during the break for rehab. ... Mobley blocked two shots and his 83 blocks are the most by a Cavs rookie since Zydrunas Ilgauskas in 1997-98. ... Garland needed five field goals to record 1,000 in his career and finished with 12. ... Love surpassed 14,000 career points with 14 in the first quarter."}
{"game_id": "0022100867", "chunk_id": "0022100867_018", "order": 18, "role": "body", "text": "Hawks: F John Collins missed his second straight game with a right foot strain. ... Gallinari started again in his spot. ... G Lou Williams played in his 984th career game off the bench, the second-most such games in league history. ... The Hawks have connected on at least 10 3s in 15 straight home games to tie the longest streak in franchise history."}
{"game_id": "0022100867", "chunk_id": "0022100867_020", "order": 20, "role": "body", "text": "Bickerstaff was delighted that Allen was named an All-Star reserve in place of James Harden. Bickerstaff thought Allen had the best case “when you take into account impacting winning, you throw in numbers, all those things, both sides of the ball, the type of human being he is, the type of guy you want representing this league, Jarrett is the guy.”"}
{"game_id": "0022100867", "chunk_id": "0022100867_021", "order": 21, "role": "body", "text": "Allen didn’t take long to celebrate, however."}
{"game_id": "0022100867", "chunk_id": "0022100867_022", "order": 22, "role": "body", "text": "“It’s a great moment but it’s so Jarrett at the same time,” Bickerstaff said. “It was like literally he couldn’t pause his video game so we told him and he goes right back to his video game. But you knew how much it meant to him. You could tell by the smile on his face.”"}
{"game_id": "0022100867", "chunk_id": "0022100867_024", "order": 24, "role": "body", "text": "Cavaliers: At Detroit on Feb. 24 after the All-Star break."}
{"game_id": "0022100867", "chunk_id": "0022100867_025", "order": 25, "role": "body", "text": "Hawks: At Orlando on Wednesday."}
