{"game_id": "0022100394", "chunk_id": "0022100394_001", "order": 1, "role": "lead", "text": "MIAMI -- — Duncan Robinson scored a season high-26 points and the Miami Heat beat the short-handed Chicago Bulls 118-92 on Saturday night."}
{"game_id": "0022100394", "chunk_id": "0022100394_002", "order": 2, "role": "body", "text": "Playing in his record-tying 174th consecutive game for Miami, Robinson shot 9 of 13 from the field, making 5 of 9 3-pointers."}
{"game_id": "0022100394", "chunk_id": "0022100394_003", "order": 3, "role": "body", "text": "“I pride myself on being available whenever the team needs me,” Robinson said. “(The streak’s) another milestone, but we have bigger fish to fry.”"}
{"game_id": "0022100394", "chunk_id": "0022100394_004", "order": 4, "role": "body", "text": "Dewayne Dedmon had 20 points and 12 rebounds, and Kyle Lowry finished with 16 points and 14 assists. Tyler Herro had 17 points, and KZ Okpala 10."}
{"game_id": "0022100394", "chunk_id": "0022100394_005", "order": 5, "role": "body", "text": "After a 15-point loss against Memphis on Monday, the Heat closed their three-game homestand with wins over Milwaukee and Chicago."}
{"game_id": "0022100394", "chunk_id": "0022100394_006", "order": 6, "role": "body", "text": "“We’re just playing well together and making shots, figuring things out,” Lowry said. “We don’t have time to do too much and we’re all aware what our roles are going to be.”"}
{"game_id": "0022100394", "chunk_id": "0022100394_007", "order": 7, "role": "body", "text": "The Bulls lost two additional players to health and safety protocols hours before the game. Guards Ayo Dosunmu and recently signed Stanley Johnson were ruled out, joining leading scorer DeMar DeRozan as well as Matt Thomas, Coby White, Javonte Green and Derrick Jones Jr., who are sidelined because of protocols."}
{"game_id": "0022100394", "chunk_id": "0022100394_008", "order": 8, "role": "body", "text": "“Everybody is probably a little bit out of sorts right now just because we keep losing players,” Chicago coach Billy Donovan said. “We need more from different guys.”"}
{"game_id": "0022100394", "chunk_id": "0022100394_009", "order": 9, "role": "body", "text": "Miami was without Caleb Martin because of health and safety protocols. Martin scored a career-high 28 points in the victory over defending champion Milwaukee on Wednesday."}
{"game_id": "0022100394", "chunk_id": "0022100394_010", "order": 10, "role": "body", "text": "The Heat, who never trailed, led 65-52 at halftime. Chicago closed to 65-57 early in the third period before Miami answered with a 13-3 spurt to maintain its double digit advantage."}
{"game_id": "0022100394", "chunk_id": "0022100394_011", "order": 11, "role": "body", "text": "“This one was a bit of a unique game,’ Miami coach Erik Spoelstra said “It was a little bit strange. We just had to focus on the task at hand. I really liked the competitiveness and how the guys helped each other offensively.”"}
{"game_id": "0022100394", "chunk_id": "0022100394_012", "order": 12, "role": "body", "text": "Zach LaVine scored 31 points for Chicago, and Lonzo Ball added 15. Nikola Vucevic also finished in double figures with 10 points but on 3-of-15 shooting."}
{"game_id": "0022100394", "chunk_id": "0022100394_013", "order": 13, "role": "body", "text": "“Nothing was falling for me tonight,” Vucevic said. “I don’t really have an explanation on what’s going on with my shot. I just have figure it out.”"}
{"game_id": "0022100394", "chunk_id": "0022100394_015", "order": 15, "role": "body", "text": "Bulls: G Alex Caruso (right hamstring strain) returned from a two-game absence and scored six points in 27 minutes. ... F Alfonzo McKinnie was called up from the G League’s Mexico City Capitanes and signed a 10-day contract. The signing of McKinnie and Johnson during the club’s current roster limits was allowed after the NBA granted hardship exemptions. ... The Bulls will have five of their next six games at home. The exception is a stop in Toronto on Thursday."}
{"game_id": "0022100394", "chunk_id": "0022100394_016", "order": 16, "role": "body", "text": "Heat: After losing their first 16 games against the Bulls in club history, the Heat reached .500 (60-60) with the win. Miami has winning records against 17 opponents. ... Robinson was perfect on three free throw attempts, ending a three-game drought of going to the foul line."}
{"game_id": "0022100394", "chunk_id": "0022100394_018", "order": 18, "role": "body", "text": "Donovan said that Jones has returned to Chicago. Jones went into protocols during the club’s stay in Miami. The seven-year forward played three seasons with the Heat from 2017 to 2020."}
{"game_id": "0022100394", "chunk_id": "0022100394_020", "order": 20, "role": "body", "text": "Bulls: Host Detroit on Tuesday night."}
{"game_id": "0022100394", "chunk_id": "0022100394_021", "order": 21, "role": "closing", "text": "Heat: At Cleveland on Monday night."}
