{"game_id": "0022100281", "chunk_id": "0022100281_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Kelly Oubre Jr. matched a career high with seven 3-pointers and had 27 points off the bench, helping the surging Charlotte Hornets snap the Minnesota Timberwolves’ five-game winning streak with a 133-115 victory Friday night."}
{"game_id": "0022100281", "chunk_id": "0022100281_002", "order": 2, "role": "body", "text": "Miles Bridges and Gordon Hayward each had 18 points, and LaMelo Ball had 10 points and 13 assists. The Hornets have won eight of their last nine games."}
{"game_id": "0022100281", "chunk_id": "0022100281_003", "order": 3, "role": "body", "text": "Karl-Anthony Towns had 25 points for Minnesota, and D’Angelo Russell and Malik Beasley each added 18 points."}
{"game_id": "0022100281", "chunk_id": "0022100281_004", "order": 4, "role": "body", "text": "Oubre said the key for the Hornets during their current streak is the team's eagerness to get better."}
{"game_id": "0022100281", "chunk_id": "0022100281_005", "order": 5, "role": "body", "text": "“It's the willingness to grow and learn,” Oubre said. “We're a young team, but we show up each and every day. We show up ready to work and ready to get better and grow closer as a unit.”"}
{"game_id": "0022100281", "chunk_id": "0022100281_006", "order": 6, "role": "body", "text": "The Hornets (13-8) tied a franchise record with 23 3-pointers and shot 57.5% from beyond the arc against the NBA's top-ranked 3-point defense. The Timberwolves (9-10) had held their opponents to 30.1% shooting from 3-point range entering the game."}
{"game_id": "0022100281", "chunk_id": "0022100281_007", "order": 7, "role": "body", "text": "“The ball was moving,” Hornets coach James Borrego said, citing his team's 32 assists. \"The unselfish spirit was there.\""}
{"game_id": "0022100281", "chunk_id": "0022100281_008", "order": 8, "role": "body", "text": "Borrego said he felt Ball got the effort going early with nine assists in the first half, including a full-court baseball pass to Bridges for a transition layup as he was falling out of bounds."}
{"game_id": "0022100281", "chunk_id": "0022100281_009", "order": 9, "role": "body", "text": "\"He got downhill and created for himself and for others,\" Borrego said. “I thought he was fantastic.\""}
{"game_id": "0022100281", "chunk_id": "0022100281_010", "order": 10, "role": "body", "text": "Hayward was also effective driving to the rim, which Borrego said is one of the keys to the Hornets moving up the standings."}
{"game_id": "0022100281", "chunk_id": "0022100281_011", "order": 11, "role": "body", "text": "“We have so many weapons. We have so many guys who can throw it up,” Hayward said."}
{"game_id": "0022100281", "chunk_id": "0022100281_012", "order": 12, "role": "body", "text": "Towns said allowing the Hornets to shoot 23 of 40 from 3-point range is “unacceptable.”"}
{"game_id": "0022100281", "chunk_id": "0022100281_013", "order": 13, "role": "body", "text": "“We were just not matching up with anybody,\" Towns said. “We were having two people guarding the ball, and leaving guys on the wing ready to shoot. ... Kelly Oubre was feasting off of that tonight.”"}
{"game_id": "0022100281", "chunk_id": "0022100281_014", "order": 14, "role": "body", "text": "The Hornets improved to 7-2 at home."}
{"game_id": "0022100281", "chunk_id": "0022100281_015", "order": 15, "role": "body", "text": "Charlotte took a 68-58 lead at halftime behind 15 points from Oubre."}
{"game_id": "0022100281", "chunk_id": "0022100281_016", "order": 16, "role": "body", "text": "Charlotte broke open the game late in the third quarter behind the left-handed shooting Oubre, who made four 3-pointers in the final 3:58 of the quarter to push the lead to 19. Minnesota could never make a run in the fourth and Minnesota coach Chris Finch yanked his starters with about six minutes to play with his team down 20."}
{"game_id": "0022100281", "chunk_id": "0022100281_018", "order": 18, "role": "body", "text": "This marked the second time this month Oubre has knocked down seven 3s in a game, with most of them coming Friday night on catch-and-shoot jumpers from the left corner."}
{"game_id": "0022100281", "chunk_id": "0022100281_019", "order": 19, "role": "body", "text": "The free agent pickup is shooting a career-best 36.6% from 3-point range in his first season with the Hornets. His previous high was 35.2% in 2019 with the Phoenix Suns."}
{"game_id": "0022100281", "chunk_id": "0022100281_021", "order": 21, "role": "body", "text": "Towns said the loss was a “trip,” not a “step back” for the Timberwolves."}
{"game_id": "0022100281", "chunk_id": "0022100281_022", "order": 22, "role": "body", "text": "“I anything we have shown that we are here to play this season,\" Towns said. \"This is one of those days where you have to chalk it up and say, ‘we got humbled.’ But this is not how we play. We can't expect that because we have a five-game winning streak it is just going to translate to a six- or seven-game winning streak. The more wins we get, the more teams are going to want to beat us.”"}
{"game_id": "0022100281", "chunk_id": "0022100281_024", "order": 24, "role": "body", "text": "P.J. Washington had 17 points in his second game back from a shoulder injury."}
{"game_id": "0022100281", "chunk_id": "0022100281_025", "order": 25, "role": "body", "text": "He got his first start of the season with Mason Plumlee out with a calf injury."}
{"game_id": "0022100281", "chunk_id": "0022100281_026", "order": 26, "role": "body", "text": "Borrego said when Washington plays at the 5-spot “the floor opens up offensively for us because he creates more space for us, especially when he is hitting shots.”"}
{"game_id": "0022100281", "chunk_id": "0022100281_028", "order": 28, "role": "body", "text": "Timberwolves: G Patrick Beverly (left adductor strain) did not play. ... Shot just 31.4% from 3-point range."}
{"game_id": "0022100281", "chunk_id": "0022100281_029", "order": 29, "role": "body", "text": "Hornets: First-round draft pick Kai Jones scored his first NBA points on a late dunk."}
{"game_id": "0022100281", "chunk_id": "0022100281_031", "order": 31, "role": "body", "text": "Timberwolves: At Philadelphia on Saturday night."}
{"game_id": "0022100281", "chunk_id": "0022100281_032", "order": 32, "role": "body", "text": "Hornets: Open four-game trip at Houston on Saturday night."}
