{"game_id": "0022101223", "chunk_id": "0022101223_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Jayson Tatum scored 31 points, Jaylen Brown added 18 and the Boston Celtics secured the second seed in the East with a 139-110 victory over the Memphis Grizzlies on Sunday night in the regular-season finale for both teams."}
{"game_id": "0022101223", "chunk_id": "0022101223_002", "order": 2, "role": "body", "text": "Al Horford added 13 points as the Celtics shot close to 55% against the short-handed Grizzlies. With Milwaukee’s loss to Cleveland earlier Sunday, Boston was able to move into second with the victory. Coach Ime Udoka was aware of the situation as the game unfolded and even was keeping up with the Philadelphia 76ers situation, even though a Celtics win assured them of the second seed."}
{"game_id": "0022101223", "chunk_id": "0022101223_003", "order": 3, "role": "body", "text": "Boston will face the winner of the play-in game between Cleveland and Brooklyn."}
{"game_id": "0022101223", "chunk_id": "0022101223_004", "order": 4, "role": "body", "text": "“We were worried about ourselves and getting some guys some reps,” Udoka said."}
{"game_id": "0022101223", "chunk_id": "0022101223_005", "order": 5, "role": "body", "text": "Santi Aldama led Memphis with 20 points, and Ziaire Williams finished with 18 points. John Konchar had his first career triple-double with 17 points, 13 rebounds and 10 assists. Kyle Anderson scored 16 points."}
{"game_id": "0022101223", "chunk_id": "0022101223_006", "order": 6, "role": "body", "text": "“It was pretty neat. It was pretty cool,” Konchar said. “You can thank my teammates for making shots.”"}
{"game_id": "0022101223", "chunk_id": "0022101223_007", "order": 7, "role": "body", "text": "The teams took different approaches to the game based on their places in the standings. Memphis was playing out the regular season having secured the second seed in the Western Conference behind the Phoenix Suns. The Grizzlies sat the bulk of their regular rotation players."}
{"game_id": "0022101223", "chunk_id": "0022101223_008", "order": 8, "role": "body", "text": "Boston entered in a logjam for the Nos. 2-4 seeds, jockeying for postseason placement with Milwaukee and Philadelphia. That meant all of the Celtics’ regulars were playing against the Grizzlies’ reserves."}
{"game_id": "0022101223", "chunk_id": "0022101223_009", "order": 9, "role": "body", "text": "And the Memphis makeshift lineup couldn’t keep pace with the Celtics’ regular rotation."}
{"game_id": "0022101223", "chunk_id": "0022101223_010", "order": 10, "role": "body", "text": "The Celtics steadily built the lead in the first half by shooting 63%, including connecting on 11 of 22 from outside the arc. That, coupled with Memphis struggling at 34% provide the Celtics with a 72-49 lead at intermission — matching the most points given up by the Grizzlies in a first half this season."}
{"game_id": "0022101223", "chunk_id": "0022101223_011", "order": 11, "role": "body", "text": "The Celtics continued to maintain the lead in the third period, leading 104-79 as Udoka sat the starters for the final quarter."}
{"game_id": "0022101223", "chunk_id": "0022101223_012", "order": 12, "role": "body", "text": "Most of the postgame discussion wasn’t about the game itself, but rather looking forward to the postseason."}
{"game_id": "0022101223", "chunk_id": "0022101223_013", "order": 13, "role": "body", "text": "“We’ve done a little bit of prep work on Minnesota and the Clippers,” Memphis coach Taylor Jenkins said of the potential first-round matchup. “Obviously things have changed since the last time we played (the Clippers) with Paul George back.\""}
{"game_id": "0022101223", "chunk_id": "0022101223_014", "order": 14, "role": "body", "text": "He added that the plan is “really just kind of fine-tune what is our simple game plan getting into Game 1, that our guys can be confident in.”"}
{"game_id": "0022101223", "chunk_id": "0022101223_015", "order": 15, "role": "body", "text": "Boston came together after it was under .500 in late-January. The Celtics play over the last three months gives them confidence heading into the postseason."}
{"game_id": "0022101223", "chunk_id": "0022101223_016", "order": 16, "role": "body", "text": "“It’s exciting,” Horford said. “I don’t know in mid-January if this is a possibility. We would have settled for like 6 or 5. To be in this position is a testament to our group.”"}
{"game_id": "0022101223", "chunk_id": "0022101223_018", "order": 18, "role": "body", "text": "Memphis coach Taylor Jenkins doesn’t pay much attention to social media but chuckled slightly when told guard Ja Morant was pushing for the Grizzlies leader to be named coach of the year. ““I don’t see it, but that’s pretty cool,” Jenkins said, adding that it would be a “team award” rather than individual recognition of him."}
{"game_id": "0022101223", "chunk_id": "0022101223_020", "order": 20, "role": "body", "text": "Celtics: Nik Stauskas missed his fourth game with a right ankle sprain. … Tatum had 14 points in the first quarter.He converted a four-point play late in the first half. … The 72 points scored in the first half, matched the most scored by Boston in a first half this season. The Celtics also had 72 against Minnesota on March 27. … C Daniel Theis had 11 points and matched his season-high in rebounds with 10, the fourth time he has reached that mark."}
{"game_id": "0022101223", "chunk_id": "0022101223_021", "order": 21, "role": "body", "text": "Grizzlies: G Desmond Bane set a franchise record for free throw shooting percentage at 90.4. The previous record was by O.J. Mayo in 2008-09 campaign. … The injury list included Steven Adams (left ankle soreness), Dillon Brooks (right hip soreness), Jaren Jackson Jr. (left thigh soreness), Tyus Jones (left hand soreness) and Ja Morant (management of right knee soreness). …Desmond Bane and Brandon Clarke were listed as questionable, and while not ruled out, they did not play."}
