{"game_id": "0022100982", "chunk_id": "0022100982_001", "order": 1, "role": "lead", "text": "DETROIT -- — DeMar DeRozan scored 16 of his 36 points in the fourth quarter and the Chicago Bulls beat the Detroit Pistons 114-108 on Wednesday night to snap a five-game losing streak."}
{"game_id": "0022100982", "chunk_id": "0022100982_002", "order": 2, "role": "body", "text": "“There's no doubt he is playing the best basketball of his career,” said Pistons coach Dwane Casey, who coached DeRozan for eight years in Toronto. “He doesn't have the analytics on his side, because he uses the mid-range jumper, but he gets to the line. We gifted him 13 free throws tonight, and he beat us.”"}
{"game_id": "0022100982", "chunk_id": "0022100982_003", "order": 3, "role": "body", "text": "Zach LeVine added 25 points for the Bulls, and Nikola Vucevic had 21 points. They won despite only hitting three 3-pointers."}
{"game_id": "0022100982", "chunk_id": "0022100982_004", "order": 4, "role": "body", "text": "“We have to stop putting ourselves in holes like we did again tonight,” DeRozan said. “We can't wait for the fourth quarter to get aggressive.”"}
{"game_id": "0022100982", "chunk_id": "0022100982_005", "order": 5, "role": "body", "text": "Cade Cunningham had 22 points for the Pistons, but no one else scored more than 12."}
{"game_id": "0022100982", "chunk_id": "0022100982_006", "order": 6, "role": "body", "text": "“I love watching the way he's developing,” DeRozan said about Cunningham. “You don't see a lot of young guys with his patience, and he's got size and skill and the confidence to make plays. He's got a great coach, too.”"}
{"game_id": "0022100982", "chunk_id": "0022100982_007", "order": 7, "role": "body", "text": "Detroit had won three straight."}
{"game_id": "0022100982", "chunk_id": "0022100982_008", "order": 8, "role": "body", "text": "“He's obviously a great player and he showed that down the stretch tonight,” Pistons center Kelly Olynyk said. “What makes him so tough is, in today’s NBA, you are usually trying to get guys to shoot mid-range jumpers, but that's how he kills you.”"}
{"game_id": "0022100982", "chunk_id": "0022100982_009", "order": 9, "role": "body", "text": "The Pistons led 99-92 with 8:59 left before DeRozan and Zach LeVine took over."}
{"game_id": "0022100982", "chunk_id": "0022100982_010", "order": 10, "role": "body", "text": "DeRozan’s layup gave the Bulls a 101-99 lead with 5:44 left and, after a Detroit miss, LeVine made two free throws to finish an 11-0 run. Two more baskets from DeRozan made it 109-101, and the Pistons couldn’t hit enough shots down the stretch."}
{"game_id": "0022100982", "chunk_id": "0022100982_011", "order": 11, "role": "body", "text": "“I don't know what changed down the stretch, but that was definitely the difference in the game,” Bulls coach Billy Donovan said. “We played with a level of desperation in the fourth quarter that was good to see on both ends of the floor. Our defense was a huge, huge factor in the fourth.”"}
{"game_id": "0022100982", "chunk_id": "0022100982_012", "order": 12, "role": "body", "text": "Neither team led by more than eight points in the first three quarters, but Hamadou Diallo's put-back dunk gave the Pistons a 91-84 advantage going into the fourth."}
{"game_id": "0022100982", "chunk_id": "0022100982_013", "order": 13, "role": "body", "text": "“They were just going by us for three quarters,” DeRozan said, “In the fourth quarter, we started playing defense again and getting into transition. That's how we have to play to win games.”"}
{"game_id": "0022100982", "chunk_id": "0022100982_015", "order": 15, "role": "body", "text": "Bulls: Vucevic missed Chicago's loss to the 76ers on Thursday night with a hamstring strain. He played 29:11 despite being limited to six-minute stretches by the team's medical staff."}
{"game_id": "0022100982", "chunk_id": "0022100982_016", "order": 16, "role": "body", "text": "“Obviously, I'm used to playing longer than that, but I had to do whatever I could to make it work,” he said. “I felt pretty good and the guys got me a lot of open looks.”"}
{"game_id": "0022100982", "chunk_id": "0022100982_017", "order": 17, "role": "body", "text": "Pistons: C Isaiah Stewart (knee), G Frank Jackson (back) and G Killian Hayes (adductor) missed the game."}
{"game_id": "0022100982", "chunk_id": "0022100982_019", "order": 19, "role": "body", "text": "The Bulls were 31-35 from the free-throw line, including 11-13 in the fourth quarter. The Pistons finished 13-17 and made one of two attempts in the fourth."}
{"game_id": "0022100982", "chunk_id": "0022100982_020", "order": 20, "role": "body", "text": "“I'm going to have to go back and look at the film to see how we ended up in that position,” Casey said."}
{"game_id": "0022100982", "chunk_id": "0022100982_022", "order": 22, "role": "body", "text": "Bulls: Host Cleveland on Saturday night."}
{"game_id": "0022100982", "chunk_id": "0022100982_023", "order": 23, "role": "closing", "text": "Pistons: At Boston on Friday night."}
