{"game_id": "0022100493", "chunk_id": "0022100493_001", "order": 1, "role": "lead", "text": "MIAMI -- — This speaks to how highly the Miami Heat think of Omer Yurtseven. After his finest game as a pro, the Heat told him he's capable of even more."}
{"game_id": "0022100493", "chunk_id": "0022100493_002", "order": 2, "role": "body", "text": "Yurtseven scored 16 points and grabbed 15 rebounds in his first start, Jimmy Butler and Caleb Martin each scored 17 points in their returns and the Heat beat the Orlando Magic 93-83 on Sunday."}
{"game_id": "0022100493", "chunk_id": "0022100493_003", "order": 3, "role": "body", "text": "“You're seeing the skill level that he has,\" Heat coach Erik Spoelstra said."}
{"game_id": "0022100493", "chunk_id": "0022100493_004", "order": 4, "role": "body", "text": "Gabe Vincent and Max Strus each had 13 points for Miami."}
{"game_id": "0022100493", "chunk_id": "0022100493_005", "order": 5, "role": "body", "text": "Butler had missed 12 of Miami's last 13 games because of the injury. Martin had missed Miami's last seven games because of a stint in the NBA's health and safety protocols."}
{"game_id": "0022100493", "chunk_id": "0022100493_006", "order": 6, "role": "body", "text": "“I'm just grateful for the opportunity,\" said Yurtseven, who was called on to start because of injuries to Miami centers Bam Adebayo and Dewayne Dedmon."}
{"game_id": "0022100493", "chunk_id": "0022100493_007", "order": 7, "role": "body", "text": "Gary Harris scored 20 for Orlando, which got 14 from RJ Hampton, 13 from Franz Wagner and 12 from Hassani Gravett."}
{"game_id": "0022100493", "chunk_id": "0022100493_008", "order": 8, "role": "body", "text": "Orlando signed four players — Gravett among them — earlier this month to hardship deals after the Magic were hit by virus-related problems. Those deals are expiring."}
{"game_id": "0022100493", "chunk_id": "0022100493_009", "order": 9, "role": "body", "text": "“I was ready. I was ready at any given moment,\" Gravett said. “I knew coming into this year what could take place with COVID or injuries or anything and was ready.\""}
{"game_id": "0022100493", "chunk_id": "0022100493_010", "order": 10, "role": "body", "text": "Hampton’s 3-pointer with 4:42 left in the first gave Orlando a 21-12 lead, the biggest Magic cushion of the afternoon. Miami answered with a 12-3 run capped by a layup from Udonis Haslem to pull into a tie, then took its first lead with 7:29 left in the half on a pair of free throws from Butler."}
{"game_id": "0022100493", "chunk_id": "0022100493_011", "order": 11, "role": "body", "text": "The Heat edge was only 42-39 at the half. But Miami scored the first 10 points of the second half — getting four baskets from four different players, Strus, Yurtseven, Duncan Robinson and Vincent — to push the lead out to 13."}
{"game_id": "0022100493", "chunk_id": "0022100493_012", "order": 12, "role": "body", "text": "Orlando wouldn’t go away. Hampton’s 3-pointer with 6:03 left got the Magic within 80-72, but Miami scored the next eight and sealed the win when Strus hit a 3 with 3:14 left for an 88-72 edge."}
{"game_id": "0022100493", "chunk_id": "0022100493_013", "order": 13, "role": "body", "text": "“I think we did a really good job of competing all night and getting the looks we were looking for,\" Magic coach Jamahl Mosley said."}
{"game_id": "0022100493", "chunk_id": "0022100493_015", "order": 15, "role": "body", "text": "Magic: Orlando fell to 7-27, tying the worst 34-game start in franchise history. It also happened in 1991-92. ... The Magic are now 0-3 against Miami this season."}
{"game_id": "0022100493", "chunk_id": "0022100493_016", "order": 16, "role": "body", "text": "Heat: Kyle Lowry (protocols) remained sidelined, and Miami was without assistant coaches Chris Quinn and Caron Butler for virus-related reasons. ... Haslem has played in three consecutive games for the first time since making four consecutive appearances in December 2017."}
{"game_id": "0022100493", "chunk_id": "0022100493_018", "order": 18, "role": "body", "text": "Yurtseven was part of more unique lineups for both sides. The three Heat-Magic games this season have seen 19 different players in the starting lineups, already the most in any season series between the Florida teams since 21 players opened Miami-Orlando games during 2002-03."}
{"game_id": "0022100493", "chunk_id": "0022100493_020", "order": 20, "role": "body", "text": "Heat guard Tyler Herro was ejected late in the third quarter after picking up his second technical foul of the game. He also received one midway through the second quarter, a double technical along with Hampton."}
{"game_id": "0022100493", "chunk_id": "0022100493_022", "order": 22, "role": "body", "text": "Magic: Host Milwaukee on Tuesday, the start of a two-game homestand against the reigning champions."}
{"game_id": "0022100493", "chunk_id": "0022100493_023", "order": 23, "role": "body", "text": "Heat: Host Washington on Tuesday, the end of Miami’s first four-game homestand so far this season."}
