{"game_id": "0022100806", "chunk_id": "0022100806_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Jaylen Brown scored 26 points and the Boston Celtics played solid defense in a 116-83 victory over the Orlando Magic on Sunday night for their season-best fifth straight win."}
{"game_id": "0022100806", "chunk_id": "0022100806_002", "order": 2, "role": "body", "text": "Boston limited Orlando to 35.8% shooting from the floor and 5 of 25 from 3-point range. It was similar to their matchup in November when the Celtics beat the Magic by holding them to 79 points and 32.1% shooting — both season lows."}
{"game_id": "0022100806", "chunk_id": "0022100806_003", "order": 3, "role": "body", "text": "“It’s suffocating, at times, with our size and versatility,” Boston coach Ime Udoka said of his team's defense. “We’ve got big wings, versatile bigs and a pit bull for a point guard (Marcus Smart). There’s no real weakness out there or anybody to pick on. …"}
{"game_id": "0022100806", "chunk_id": "0022100806_004", "order": 4, "role": "body", "text": "\"This is what we envisioned and it’s coming to fruition now that we have some consistency with our lineups.”"}
{"game_id": "0022100806", "chunk_id": "0022100806_005", "order": 5, "role": "body", "text": "Dennis Schröder scored 23 points and hit four 3-pointers off Boston’s bench, while Al Horford added 13 points and 11 rebounds for his 10th double-double."}
{"game_id": "0022100806", "chunk_id": "0022100806_006", "order": 6, "role": "body", "text": "Jayson Tatum had 15 points, nine rebounds and seven assists, but he shot just 6 of 18. Brown, who scored a career-best 50 points in an overtime victory over Orlando last month, made 10 of 22 shots. It is Boston’s first five-game win streak since April 7-17, 2021, when it won six straight."}
{"game_id": "0022100806", "chunk_id": "0022100806_007", "order": 7, "role": "body", "text": "“We’re finding some continuity and chemistry. We’ve had some adversity, but now we’re finding ways to win some games,” Brown said. “I’d say before the season, with the way our team was structured, we had a defensive group. This is what we imagined when we started.”"}
{"game_id": "0022100806", "chunk_id": "0022100806_008", "order": 8, "role": "body", "text": "Rookie Jalen Suggs had 17 points, six rebounds and five assists for Orlando, which dropped to an NBA-worst 0-21 when it fails to score 100 points."}
{"game_id": "0022100806", "chunk_id": "0022100806_009", "order": 9, "role": "body", "text": "Boston never trailed Sunday and beat the Magic for a third time this season. The Celtics swept the season series for a third straight year."}
{"game_id": "0022100806", "chunk_id": "0022100806_010", "order": 10, "role": "body", "text": "“We're playing with pace, everybody is touching (the ball) and everybody is sharing the ball,” Schroder said. “We're playing a lot faster and that's been great.”"}
{"game_id": "0022100806", "chunk_id": "0022100806_011", "order": 11, "role": "body", "text": "Wendell Carter Jr. added 14 points for Orlando, which was playing less than 24 hours after getting routed 135-115 at home by Memphis. Down as much as 31 and 33 points the past two nights, the Magic have followed up their only two-game home winning streak of the season with two straight lopsided losses."}
{"game_id": "0022100806", "chunk_id": "0022100806_012", "order": 12, "role": "body", "text": "“You’re never as good as you are when you win or as bad as you think you are when you lose, so our guys understand that and we’ll bounce back,” Magic coach Jamahl Mosley said. “It’s just about guys staying the course and staying positive. It’s a tied-together group so they are going to continue to push and fight for one another.”"}
{"game_id": "0022100806", "chunk_id": "0022100806_013", "order": 13, "role": "body", "text": "Boston pushed its 10-point halftime lead to as much as 19 in the third quarter by smothering Orlando defensively. The Magic missed 18 of their 20 3-point attempts in the game’s first three quarters against the Celtics’ active defense."}
{"game_id": "0022100806", "chunk_id": "0022100806_014", "order": 14, "role": "body", "text": "Boston mostly struggled offensively early on, but it locked down the Magic on the other end and led 49-39 at the half. Orlando managed just 15 first-quarter points and shot a dismal 31.7% in the opening half."}
{"game_id": "0022100806", "chunk_id": "0022100806_016", "order": 16, "role": "body", "text": "Celtics: Smart came into Sunday third in the NBA in steals at 1.87 a game, but his effectiveness as a defender extends beyond that area. He’s also had 140 pass deflections — 64 more than his next closest teammate. He also leads the team in charges taken with seven. ... Boston missed its first six 3-point shots and 14 of the first 15 tries from beyond the arc. ... Boston pulled even in the standings with the struggling Nets, the team it faces Tuesday in Brooklyn."}
{"game_id": "0022100806", "chunk_id": "0022100806_017", "order": 17, "role": "body", "text": "Magic: Mo Bamba played despite spraining his right ankle again Saturday. He had eight points, 10 rebounds and two blocks on Sunday. ... Rookie Franz Wagner is one of just 10 players in the NBA to appear in all of his team’s games this season. Also, he is the only rookie to not miss a game. ... Orlando made just five of its first 21 shots and missed all four of its 3-point tries in the first quarter."}
{"game_id": "0022100806", "chunk_id": "0022100806_019", "order": 19, "role": "body", "text": "Celtics: Play at Brooklyn on Tuesday night."}
{"game_id": "0022100806", "chunk_id": "0022100806_020", "order": 20, "role": "body", "text": "Magic: Play at Portland on Tuesday night."}
