{"game_id": "0022100827", "chunk_id": "0022100827_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — Pascal Siakam had 27 points and 16 rebounds, Fred VanVleet made six 3-pointers and added 21 points, and the Toronto Raptors beat the Oklahoma City Thunder 117-98 on Wednesday night for their seventh straight victory."}
{"game_id": "0022100827", "chunk_id": "0022100827_002", "order": 2, "role": "body", "text": "Siakam started quickly en route to a 13-for-17 shooting performance. He had 15 points on 7-of-8 shooting in the first nine minutes of play. The spark led the Raptors to outscore the Thunder 34-22 in the opening quarter, shooting 68.4% from the field while the Thunder shot just 31.8%."}
{"game_id": "0022100827", "chunk_id": "0022100827_003", "order": 3, "role": "body", "text": "“Just being aggressive,” Siakam said. “That’s pretty much my mindset. Just attacking gaps, taking whatever the defense gives me, seeing lanes and when they collapse, making the right play.”"}
{"game_id": "0022100827", "chunk_id": "0022100827_004", "order": 4, "role": "body", "text": "Aleksej Pokuševski and Theo Maledon scored 18 points apiece for the Thunder. Lu Dort had 15, while Darius Bazley, Josh Giddey and Ty Jerome all had 13."}
{"game_id": "0022100827", "chunk_id": "0022100827_005", "order": 5, "role": "body", "text": "“I thought we left something to be desired there to start the game,” Thunder coach Mark Daigneault said. “But then we got into the game and got ourselves back, especially late in the second quarter. We stood up for a bit.”"}
{"game_id": "0022100827", "chunk_id": "0022100827_006", "order": 6, "role": "body", "text": "The Thunder made a push in the second quarter with Jerome knocking down three consecutive 3-pointers. Oklahoma City’s bench outscored Toronto’s 22-7 in the first half but the scoring difference didn’t matter as Siakam answered with 21 first-half points. The Thunder ended the half on a 9-3 run but the Raptors led by eight points."}
{"game_id": "0022100827", "chunk_id": "0022100827_007", "order": 7, "role": "body", "text": "VanVleet began to find his rhythm in the second half, outscoring the Thunder 7-2 to open the third quarter. He finished with 10 points in the period and the Raptors’ lead grew to 87-72."}
{"game_id": "0022100827", "chunk_id": "0022100827_008", "order": 8, "role": "body", "text": "The Thunder beat the Raptors 110-109 on Dec. 9, with Shai Gilgeous-Alexander scoring 26 points and Mike Muscala hitting a go-ahead 3-pointer. But neither Gilgeous-Alexander (right ankle sprain) nor Muscala (right ankle soreness) suited up on Wednesday night."}
{"game_id": "0022100827", "chunk_id": "0022100827_009", "order": 9, "role": "body", "text": "All five starters scored in double figures as the Raptors handed the Thunder their third consecutive loss. Oklahoma City is 4-15 since the start of 2022 while the Raptors are 15-6."}
{"game_id": "0022100827", "chunk_id": "0022100827_010", "order": 10, "role": "body", "text": "“We have experience in the past of dropping these type of games,” Siakam said. “We have that focus against really good teams but teams maybe the record is not as good, we kind of come in like relaxing a little bit. I think that’s a point of emphasis that Coach has been having. Having the same focus for every team we play, I think that’s what makes a good team special.”"}
{"game_id": "0022100827", "chunk_id": "0022100827_012", "order": 12, "role": "body", "text": "Raptors: Scottie Barnes scored 17 points and Gary Trent Jr. had 16. ... OG Anunoby finished with 15 points and 10 rebounds."}
{"game_id": "0022100827", "chunk_id": "0022100827_013", "order": 13, "role": "body", "text": "Thunder: Tre Mann missed all six shots. ... Kenrich Williams had 12 rebounds and six assists but was 0 for 5 on 3-pointers."}
{"game_id": "0022100827", "chunk_id": "0022100827_015", "order": 15, "role": "body", "text": "Raptors: Visit the Rockets on Thursday."}
{"game_id": "0022100827", "chunk_id": "0022100827_016", "order": 16, "role": "closing", "text": "Thunder: Visit the 76ers on Saturday."}
