{"game_id": "0022100315", "chunk_id": "0022100315_001", "order": 1, "role": "lead", "text": "TORONTO -- — Jaren Jackson Jr. scored 25 points, Desmond Bane had 23 and Dillon Brooks 17 as the Memphis Grizzlies won back-to-back games, beating the struggling Toronto Raptors 98-91 Tuesday night."}
{"game_id": "0022100315", "chunk_id": "0022100315_002", "order": 2, "role": "body", "text": "After beating Sacramento Sunday, Memphis won again without leading scorer Ja Morant, who sat for the second game because of a sprained left knee. Morant is expected to miss at least two weeks."}
{"game_id": "0022100315", "chunk_id": "0022100315_003", "order": 3, "role": "body", "text": "“It’s not about doing more, it’s about playing better, even with Ja out of the lineup,” Grizzlies coach Taylor Jenkins said."}
{"game_id": "0022100315", "chunk_id": "0022100315_004", "order": 4, "role": "body", "text": "Jackson, who shot 8 for 14, said the Grizzlies aren’t trying to do too much without the influential Morant."}
{"game_id": "0022100315", "chunk_id": "0022100315_005", "order": 5, "role": "body", "text": "“You can’t force it,” Jackson said. “You’ve just got to be able to go out there and fill those gaps where he might have done something else.”"}
{"game_id": "0022100315", "chunk_id": "0022100315_006", "order": 6, "role": "body", "text": "Bane made five 3-pointers and Jackson had four for the Grizzlies, who never trailed and led by as many as 17 points."}
{"game_id": "0022100315", "chunk_id": "0022100315_007", "order": 7, "role": "body", "text": "“He really can do it all out there,” Jackson said of Bane. “There’s really no limit to what he can do.”"}
{"game_id": "0022100315", "chunk_id": "0022100315_008", "order": 8, "role": "body", "text": "Brooks, who is from suburban Toronto, played in Canada for the first time since Feb. 2018."}
{"game_id": "0022100315", "chunk_id": "0022100315_009", "order": 9, "role": "body", "text": "“This game was circled, for sure,” Brooks said. “I love playing here. It’s been a dream. It’s been circled for a while.”"}
{"game_id": "0022100315", "chunk_id": "0022100315_010", "order": 10, "role": "body", "text": "Brooks said he heard some trash talk from Toronto staffer and fellow Canadian Jamaal Magloire on the Raptors' bench. Brooks responded by facing the crowd and yelling “This is my house,” after hitting a pull-up 3-pointer in the fourth quarter."}
{"game_id": "0022100315", "chunk_id": "0022100315_011", "order": 11, "role": "body", "text": "Pascal Siakam scored 20 points, Scottie Barnes had 19 and Fred VanVleet 15 as the Raptors lost their third straight. Toronto has lost five straight home games. The Raptors are 2-8 at home this season."}
{"game_id": "0022100315", "chunk_id": "0022100315_012", "order": 12, "role": "body", "text": "“We’ve got to fix that,” Siakam said. “It’s not acceptable. We can’t play like that at home. We’ve got to be better, no excuses.”"}
{"game_id": "0022100315", "chunk_id": "0022100315_013", "order": 13, "role": "body", "text": "Raptors forwards OG Anunoby (left hip) and Khem Birch (right knee) each sat for the seventh straight game, while guard Gary Trent Jr. (right calf) missed his second. Guard Goran Dragic remains away from the team because of a personal matter."}
{"game_id": "0022100315", "chunk_id": "0022100315_014", "order": 14, "role": "body", "text": "The Raptors had won seven of the past eight meetings, including a Nov. 24 win at Memphis in which the Grizzlies squandered a 12-point halftime lead."}
{"game_id": "0022100315", "chunk_id": "0022100315_015", "order": 15, "role": "body", "text": "However, Toronto also came in having lost four straight at home, its longest losing streak north of the border since November and December 2013."}
{"game_id": "0022100315", "chunk_id": "0022100315_016", "order": 16, "role": "body", "text": "Toronto had twice as many turnovers (eight) as assists (four) in the first half. Memphis led 50-39 at the break."}
{"game_id": "0022100315", "chunk_id": "0022100315_017", "order": 17, "role": "body", "text": "“There wasn’t a whole lot of space,” Raptors coach Nick Nurse said. “They kind of baited us into some early shots, and we kind of kept taking them one after another, and didn’t make many.”"}
{"game_id": "0022100315", "chunk_id": "0022100315_018", "order": 18, "role": "body", "text": "Trailing 56-45 at 9:23 of the third, the Raptors used a 10-0 run to cut the deficit to one. That was the first of three times before the end of the quarter that Toronto trailed by a single point, but they were never able to tie or take the lead."}
{"game_id": "0022100315", "chunk_id": "0022100315_019", "order": 19, "role": "body", "text": "Memphis led 70-67 through three quarters, then scored seven of the first nine points in the fourth."}
{"game_id": "0022100315", "chunk_id": "0022100315_020", "order": 20, "role": "body", "text": "Barnes hit a 3-pointer with 19.5 seconds left to make it 95-91, but Brooks answered with a pair of free throws to halt the comeback effort."}
{"game_id": "0022100315", "chunk_id": "0022100315_021", "order": 21, "role": "body", "text": "“It was a hard-fought battle and we made the plays in stretch-time to seal it,” Brooks said."}
{"game_id": "0022100315", "chunk_id": "0022100315_023", "order": 23, "role": "body", "text": "Grizzlies: G Ziaire Williams (left knee) and G Sam Merrill (left ankle) were out. … Bane has scored 10 or more in the first quarter of five of his past six games. … De’Anthony Melton had nine points and 10 rebounds."}
{"game_id": "0022100315", "chunk_id": "0022100315_024", "order": 24, "role": "body", "text": "Raptors: Svi Mykhailiuk made his second straight start in place of Trent. … Yuta Watanabe scored 11 points. … VanVleet led the Raptors with nine rebounds. … Toronto scored a season-low 37 points in the first half of an Oct. 20 home loss to Washington."}
{"game_id": "0022100315", "chunk_id": "0022100315_026", "order": 26, "role": "body", "text": "Jackson made an impressive block on Barnes’s dunk attempt early in the fourth."}
{"game_id": "0022100315", "chunk_id": "0022100315_028", "order": 28, "role": "body", "text": "Bane and Jackson combined to shoot 9 for 16 from 3-point range. The rest of the Grizzlies shot 1 for 18 from long range, with Brooks (1 for 5) getting the other make."}
{"game_id": "0022100315", "chunk_id": "0022100315_030", "order": 30, "role": "body", "text": "Grizzlies: Host Oklahoma City on Thursday night."}
{"game_id": "0022100315", "chunk_id": "0022100315_031", "order": 31, "role": "body", "text": "Raptors: Host Milwaukee on Thursday night."}
