{"game_id": "0022100805", "chunk_id": "0022100805_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Cedi Osman scored 22 points and Kevin Love had 19 as the Cleveland Cavaliers rallied from 20 down to beat Indiana 98-85 on Sunday night, shortly after agreeing to acquire shooting guard Caris LeVert from the Pacers."}
{"game_id": "0022100805", "chunk_id": "0022100805_002", "order": 2, "role": "body", "text": "Osman and Love combined to score the first 19 points in the fourth quarter, completing a 25-3 run that gave the Cavaliers an 80-68 lead. Osman finished with 18 in the period, while Love had nine points and drew two charging fouls on Pacers rookie Chris Duarte."}
{"game_id": "0022100805", "chunk_id": "0022100805_003", "order": 3, "role": "body", "text": "“These are the moments that we live for, to be honest,” Love said. “When one of us gets going like Cedi did, it’s contagious and infectious and we feed off that. We have so much fun playing in front of this crowd.”"}
{"game_id": "0022100805", "chunk_id": "0022100805_004", "order": 4, "role": "body", "text": "Jarrett Allen had 15 points and 17 rebounds, and Rajon Rondo added 15 points and a season-high 12 assists off the bench for Cleveland, which is one game behind East-leading Miami. The Cavaliers made their first eight 3-pointers in the fourth."}
{"game_id": "0022100805", "chunk_id": "0022100805_005", "order": 5, "role": "body", "text": "“At one point, I thought I needed some oxygen,” Osman said, laughing. “It was crazy. That was crazy. It was a great win for us.”"}
{"game_id": "0022100805", "chunk_id": "0022100805_006", "order": 6, "role": "body", "text": "Duarte paced Indiana with 22 points, Duane Washington Jr. scored 17 and Domantas Sabonis had nine points and 11 rebounds. The Pacers, who jumped out to a 34-14 lead, have lost three straight and seven of nine."}
{"game_id": "0022100805", "chunk_id": "0022100805_007", "order": 7, "role": "body", "text": "“I thought our guys rallied and showed up, especially in the first half,” Indiana coach Rick Carlisle said. “They hit us with a barrage of 3s, and it got to be too much. We’re a team with a thin margin for error to begin with.”"}
{"game_id": "0022100805", "chunk_id": "0022100805_008", "order": 8, "role": "body", "text": "LeVert, who is averaging 18.7 points and 4.4 assists, will be acquired for injured guard Ricky Rubio — and his expiring $17.8 million contract — and three draft picks, a person familiar with the trade told The Associated Press."}
{"game_id": "0022100805", "chunk_id": "0022100805_009", "order": 9, "role": "body", "text": "Cleveland also will receive a 2022 second-round pick in the transaction, adding needed backcourt help after losing Rubio and Collin Sexton to season-ending knee injuries. All-Star point guard Darius Garland missed his fourth straight game with a sore lower back."}
{"game_id": "0022100805", "chunk_id": "0022100805_010", "order": 10, "role": "body", "text": "Carlisle announced the trade had been completed 90 minutes before the opening tip, pending approval from the NBA."}
{"game_id": "0022100805", "chunk_id": "0022100805_011", "order": 11, "role": "body", "text": "“We’re losing a brother and I wish the best for him,” Pacers forward Justin Holiday said."}
{"game_id": "0022100805", "chunk_id": "0022100805_012", "order": 12, "role": "body", "text": "Osman’s running floater with 10:23 remaining put the Cavaliers in front for the first time at 69-68. Garland ran down the sideline to greet his teammates after each of Indiana’s three timeouts that failed to stop the surge."}
{"game_id": "0022100805", "chunk_id": "0022100805_013", "order": 13, "role": "body", "text": "“This team doesn’t have any fear because we trust each other,” Love said. “We give ourselves a chance to win every night and we play a beautiful brand of basketball.”"}
{"game_id": "0022100805", "chunk_id": "0022100805_014", "order": 14, "role": "body", "text": "The Pacers went into intermission with a 47-36 lead after Cleveland missed 24 of its first 29 shots, including all nine 3-pointers."}
{"game_id": "0022100805", "chunk_id": "0022100805_015", "order": 15, "role": "body", "text": "Indiana scored the first five points and jumped in front 23-5, ending the quarter with a 27-12 advantage. Sabonis had six points and eight rebounds in eight minutes, returning from a three-game stay in the NBA’s health and safety protocols."}
{"game_id": "0022100805", "chunk_id": "0022100805_017", "order": 17, "role": "body", "text": "Cavaliers G Rajon Rondo has appeared in 10 games, but has not started since being acquired from the Lakers on Jan. 3. Coach J.B. Bickerstaff says Rondo is still getting acquainted with his teammates. “As we get deeper in the season, we will need more from him,” Bickerstaff said. “He’s working his way into a comfort level with us, but I can tell you he’s got an understanding for the game that’s second to none.”"}
{"game_id": "0022100805", "chunk_id": "0022100805_019", "order": 19, "role": "body", "text": "Pacers: G Malcolm Brogdon (right Achilles soreness) missed his 16th game this season with the injury. He was listed as questionable. ... Carlisle appreciated the Cavaliers’ pregame moment of silence for Hall of Fame coach Bill Fitch, who died last week. “I know Bill is a very special person in Cleveland, having been their first coach,” Carlisle said. “To me, he was the ultimate franchise builder.”"}
{"game_id": "0022100805", "chunk_id": "0022100805_020", "order": 20, "role": "body", "text": "Cavaliers: F Lauri Markkanen (right ankle sprain) performed light basketball activities Saturday. The 7-footer has been inactive for seven games since being hurt against Oklahoma City on Jan. 22. ... Two-way G Brandon Goodwin made his third straight start at the point. ... Exterior signage for the NBA All-Star Game featuring LeBron James is now in place on the south side of Rocket Mortgage FieldHouse."}
{"game_id": "0022100805", "chunk_id": "0022100805_022", "order": 22, "role": "body", "text": "Pacers: Visit Atlanta on Tuesday night."}
{"game_id": "0022100805", "chunk_id": "0022100805_023", "order": 23, "role": "body", "text": "Cavaliers: Host San Antonio on Wednesday night."}
