{"game_id": "0022100853", "chunk_id": "0022100853_001", "order": 1, "role": "lead", "text": "DALLAS -- — Luka Doncic was unstoppable at the end instead of the beginning in the rematch with the Los Angeles Clippers."}
{"game_id": "0022100853", "chunk_id": "0022100853_002", "order": 2, "role": "body", "text": "The Dallas superstar couldn’t quite do enough to get one of these teams an elusive sweep in their repetitive two-game sets."}
{"game_id": "0022100853", "chunk_id": "0022100853_003", "order": 3, "role": "body", "text": "Reggie Jackson scored 24 points and the Clippers held off the Mavericks in the final minute for a 99-97 victory Saturday night for another split between the teams."}
{"game_id": "0022100853", "chunk_id": "0022100853_004", "order": 4, "role": "body", "text": "Doncic had 23 of his 45 points in the fourth quarter two nights after scoring 28 of his career-high 51 points in the first of Dallas’ 112-105 win. Doncic had 15 rebounds and eight assists."}
{"game_id": "0022100853", "chunk_id": "0022100853_005", "order": 5, "role": "body", "text": "The LA victory in the rematch meant splits in all three two-game home sets over two regular season for teams that have met in the first round of the playoffs the past two years. The Clippers won both of those series."}
{"game_id": "0022100853", "chunk_id": "0022100853_006", "order": 6, "role": "body", "text": "“I just want to win. I don’t care if he had 90,” LA coach Tyronn Lue said. “Hats off to him for playing great, but I thought our team did a hell of a job. We know he can dominate the game with his passing and his scoring. We wanted to try to limit him to being a scorer, and he did it again, unfortunately, but we were able to weather the storm.”"}
{"game_id": "0022100853", "chunk_id": "0022100853_007", "order": 7, "role": "body", "text": "Terance Mann had 21 points and nine rebounds, and Marcus Morris Sr. scored 20 as the Clippers ended a three-game losing streak."}
{"game_id": "0022100853", "chunk_id": "0022100853_008", "order": 8, "role": "body", "text": "Jackson answered two of Doncic’s four 3-pointers in the fourth with driving buckets, the second drawing a foul. Jackson missed the free throw, but Mann rebounded and passed out to Jackson for a 3 and a 97-89 lead with 1:15 to go."}
{"game_id": "0022100853", "chunk_id": "0022100853_009", "order": 9, "role": "body", "text": "Doncic, who scored the last 19 Dallas points after a 3-pointer by Reggie Bullock with 4:55 remaining, had the Mavericks within one on a layup with eight seconds to go."}
{"game_id": "0022100853", "chunk_id": "0022100853_010", "order": 10, "role": "body", "text": "After a timeout, Jackson took an inbound pass while sprinting away from Jalen Brunson and managed to run the clock down to 3.4 seconds before Dallas got the foul."}
{"game_id": "0022100853", "chunk_id": "0022100853_011", "order": 11, "role": "body", "text": "Jackson made one of two free throws, and Doncic’s step-back shot from near midcourt at the buzzer was wide right and a little short."}
{"game_id": "0022100853", "chunk_id": "0022100853_012", "order": 12, "role": "body", "text": "“Luka was great and then we had the ball to tie it or win it,” Dallas coach Jason Kidd said. “That’s all you can ask when we didn’t play well tonight. But we found a way to put ourselves in position.”"}
{"game_id": "0022100853", "chunk_id": "0022100853_013", "order": 13, "role": "body", "text": "About to turn 23 and preparing for his third All-Star game, Doncic was 15 of 33 from the field, 6 of 13 from 3 and 9 of 13 from the line."}
{"game_id": "0022100853", "chunk_id": "0022100853_014", "order": 14, "role": "body", "text": "With 96 points in the two games, Doncic had the most in a two-game span against the same opponent since Wilt Chamberlain scored 100 for Philadelphia against Seattle in December 1967, according to STATS Inc."}
{"game_id": "0022100853", "chunk_id": "0022100853_015", "order": 15, "role": "body", "text": "“Sometimes they double me, specially in the fourth quarter and somebody else makes shots,” Doncic said. “But today they let me go one-on-one. The first three quarters, I should have been way more aggressive than I was.”"}
{"game_id": "0022100853", "chunk_id": "0022100853_016", "order": 16, "role": "body", "text": "Brunson scored 22 points, and Reggie Bullock had 17 for Dallas."}
{"game_id": "0022100853", "chunk_id": "0022100853_017", "order": 17, "role": "body", "text": "Ivica Zubac had 11 points, 10 rebounds and six assists for the Clippers."}
{"game_id": "0022100853", "chunk_id": "0022100853_019", "order": 19, "role": "body", "text": "Clippers: Norman Powell was out with a toe injury in his fourth game since being acquired from Portland in a trade. ... Rodney Hood was available off the bench for his debut after the trade that brought him and Semi Ojeleye from Milwaukee in the four-team deal that sent Serge Ibaka to the Bucks. Ojeleye will join the team in LA."}
{"game_id": "0022100853", "chunk_id": "0022100853_020", "order": 20, "role": "body", "text": "Mavericks: Spencer Dinwiddie and Davis Bertans, acquired two days ago in the trade that sent Kristaps Porzingis to Washington, met with reporters but weren't available to play. That means their Dallas debuts should be on the upcoming five-game road trip. ... Dorian Finney-Smith had a quiet night with three points on the same day the club announced a $56 million, four-year contract extension for the undrafted sixth-year player."}
{"game_id": "0022100853", "chunk_id": "0022100853_022", "order": 22, "role": "body", "text": "Doncic and Mann rekindled the chippy play that marked both the playoff meetings, the first a six-game LA victory in the playoff bubble in 2020. Last year's seven-game series was the first in NBA history with the road team winning the first six games before the Clippers won Game 7 at home."}
{"game_id": "0022100853", "chunk_id": "0022100853_023", "order": 23, "role": "body", "text": "After one of Doncic's seven fourth-quarter buckets, the players jawed at each other all the way up the floor, kept talking as the Clippers set up and ended up nose-to-nose after the whistle blew."}
{"game_id": "0022100853", "chunk_id": "0022100853_024", "order": 24, "role": "body", "text": "“It’s between the lines,” Mann said. “He’s a competitor. He’s a great player. We both want to win. It gets chippy at times, but that’s just ... to try to win the game.”"}
{"game_id": "0022100853", "chunk_id": "0022100853_025", "order": 25, "role": "body", "text": "Doncic said he hadn't responded to trash talk from Mann all game, and wasn't pleased with the double technical call after he said he finally decided to talk back."}
{"game_id": "0022100853", "chunk_id": "0022100853_027", "order": 27, "role": "body", "text": "Clippers: Golden State at home Monday. The Warriors won the first two meetings."}
{"game_id": "0022100853", "chunk_id": "0022100853_028", "order": 28, "role": "body", "text": "Mavericks: At Miami on Tuesday to start a five-game trip that will finish on the West Coast."}
