{"game_id": "0022100124", "chunk_id": "0022100124_001", "order": 1, "role": "lead", "text": "DETROIT -- — Kevin Durant had 29 points and 10 rebounds, James Harden added a triple-double and the Brooklyn Nets extended their winning streak to four games with a 96-90 victory over the Detroit Pistons on Friday night."}
{"game_id": "0022100124", "chunk_id": "0022100124_002", "order": 2, "role": "body", "text": "Durant shook off a poor shooting night by hitting three straight Brooklyn baskets down the stretch. He became the first player in Nets history to score at least 20 points in the first nine games of a season, despite finishing 12 of 27 from the field."}
{"game_id": "0022100124", "chunk_id": "0022100124_003", "order": 3, "role": "body", "text": "“I was getting to my spots, but my fundamentals weren't there,” he said. “If I had made the shots I should have made, it wouldn't have been close down the stretch.”"}
{"game_id": "0022100124", "chunk_id": "0022100124_004", "order": 4, "role": "body", "text": "LaMarcus Aldridge added 16 points for Brooklyn (6-3), while Harden had 15 points, 10 rebounds and 10 assists. Harden also had nine turnovers and finished 0 for 5 from inside the arc. He became the fifth player in NBA history with a triple-double and no 2-point baskets, joining Jason Kidd, Delon Wright, Steve Blake and Kirk Hinrich."}
{"game_id": "0022100124", "chunk_id": "0022100124_005", "order": 5, "role": "body", "text": "“You are going to have games where emotionally, physically or mentally you just aren't sharp,” Nets coach Steve Nash said. “I didn't think we were as sharp as we needed to be tonight, but we scrapped defensively and won the game.”"}
{"game_id": "0022100124", "chunk_id": "0022100124_006", "order": 6, "role": "body", "text": "Cade Cunningham had 17 points for Detroit (1-8), while Kelly Olynyk added 13 points and 10 rebounds."}
{"game_id": "0022100124", "chunk_id": "0022100124_007", "order": 7, "role": "body", "text": "Cunningham missed training camp and the first four games of the regular season with a sprained ankle. He's shooting 23.2% from the floor, including 14.3% on 3-pointers, but totaled 35 points in Detroit's back-to-back losses to the Philadelphia 76ers and Nets."}
{"game_id": "0022100124", "chunk_id": "0022100124_008", "order": 8, "role": "body", "text": "“I love Cade’s game,” said Durant, who swapped jerseys with Cunningham after the game. “He’s going to be a tough, tough cover for a long, long time. I’ve known him since he was in high school. He’s one of my guys. I’m looking forward to seeing his career.”"}
{"game_id": "0022100124", "chunk_id": "0022100124_009", "order": 9, "role": "body", "text": "Both offenses struggled badly in a first half that ended with the teams tied at 39. Detroit had a slight advantage in shooting percentage — 33.3% to 32.5% -- but made just 2 of 16 3-point attempts."}
{"game_id": "0022100124", "chunk_id": "0022100124_010", "order": 10, "role": "body", "text": "“I think there was a leprechaun on the rim, knocking away shots,” Pistons coach Dwane Casey said. “It was dunks, 2-pointers, free throws, 3s — everything imaginable was bouncing off.”"}
{"game_id": "0022100124", "chunk_id": "0022100124_011", "order": 11, "role": "body", "text": "Brooklyn scored the first eight points of the third quarter and kept rolling, shooting 78.9% in a 39-point quarter to take a 78-62 lead. Durant had 12 points in the period while Blake Griffin added eight."}
{"game_id": "0022100124", "chunk_id": "0022100124_012", "order": 12, "role": "body", "text": "“Stops can make up for a lot of other stuff,” Durant said. “We played solid defense in the first half, and then we finally started making shots in the third quarter.”"}
{"game_id": "0022100124", "chunk_id": "0022100124_013", "order": 13, "role": "body", "text": "The Pistons came back in the fourth, with Cunningham's five straight points and Cory Joseph's 3-pointer making it 88-86 with 4:03 left. Joseph missed another 3-pointer that could have given Detroit the lead with 2:56 to play, and Isaiah Stewart and Griffin got tangled up on the rebound."}
{"game_id": "0022100124", "chunk_id": "0022100124_014", "order": 14, "role": "body", "text": "They were called for a double foul and a double technical. Durant made it 90-86, but Cunningham's 3-pointer pulled the Pistons within a point."}
{"game_id": "0022100124", "chunk_id": "0022100124_015", "order": 15, "role": "body", "text": "Durant scored again, and Saddiq Bey was called for an offensive foul with 43 seconds left. Durant missed a jumper, but Griffin knocked the rebound to Harden. The ball went back to Durant, who hit a layup in traffic to put the Nets up 94-89 with 12.9 seconds to play."}
{"game_id": "0022100124", "chunk_id": "0022100124_016", "order": 16, "role": "body", "text": "“We just don't have any margin for error,” Casey said. “We can't win if we make too many mistakes.”"}
{"game_id": "0022100124", "chunk_id": "0022100124_018", "order": 18, "role": "body", "text": "Nets: For the second straight night, Pistons fans gave an unpleasant welcome to a former Detroit fan favorite, On Thursday, Andre Drummond was booed every time he touched the ball for the 76ers, and Griffin got the same treatment on Friday."}
{"game_id": "0022100124", "chunk_id": "0022100124_019", "order": 19, "role": "body", "text": "“I wasn't surprised. I heard they booed Andre Drummond last night, and what did he do? He just got traded,” Griffin said. “So I assumed it was going to happen.”"}
{"game_id": "0022100124", "chunk_id": "0022100124_020", "order": 20, "role": "body", "text": "Pistons: PG Killian Hayes missed the game after injuring his thumb in the loss to Philadelphia. Josh Jackson replaced him, with Cunningham doing most of the ball handling.'"}
{"game_id": "0022100124", "chunk_id": "0022100124_022", "order": 22, "role": "body", "text": "With the Nets up 13 in the third, Harden lost control of the ball and it rolled over the halfcourt line. He strolled after it, knowing Brooklyn would be called for a violation when he touched it, but Saddiq Bey hustled past him to grab the ball and get an uncontested dunk."}
{"game_id": "0022100124", "chunk_id": "0022100124_023", "order": 23, "role": "body", "text": "“The ball was loose and the whistle hadn't gone, so I decided to try to make a play,\" Bey said."}
{"game_id": "0022100124", "chunk_id": "0022100124_025", "order": 25, "role": "body", "text": "Nets: Visit the Toronto Raptors on Sunday."}
{"game_id": "0022100124", "chunk_id": "0022100124_026", "order": 26, "role": "closing", "text": "Pistons: Visit the Houston Rockets on Wednesday."}
