{"game_id": "0022100465", "chunk_id": "0022100465_001", "order": 1, "role": "lead", "text": "MIAMI -- — Tyler Herro scored 26 points in his return from a three-game absence with a bruised thigh, Duncan Robinson tied a season-high with 26 points and the Miami Heat rolled past the Indiana Pacers 125-96 on Tuesday night."}
{"game_id": "0022100465", "chunk_id": "0022100465_002", "order": 2, "role": "body", "text": "Miami tied a franchise record with 22 made 3-pointers, the fourth time the Heat have made that many."}
{"game_id": "0022100465", "chunk_id": "0022100465_003", "order": 3, "role": "body", "text": "Max Strus scored 18 points, KZ Okpala scored 16 and Kyle Lowry finished with eight points, 11 rebounds and 12 assists for Miami. Omer Yurtseven added 13 rebounds for the Heat, who had 30 assists."}
{"game_id": "0022100465", "chunk_id": "0022100465_004", "order": 4, "role": "body", "text": "“When the ball’s moving like that, people just feel the energy of the ball, unselfish play,\" Robinson said. “It’s easy to let it fly.\""}
{"game_id": "0022100465", "chunk_id": "0022100465_005", "order": 5, "role": "body", "text": "Chris Duarte and Caris LeVert each scored 17 for Indiana, which got 14 points from Oshae Brissett and 12 points from Domantas Sabonis. Indiana lost Malcolm Brogdon in the first half with more soreness in his right Achilles, something that has been bothering him. He had one point and two assists in eight minutes, and when he left the game it was quickly determined that he couldn't return."}
{"game_id": "0022100465", "chunk_id": "0022100465_006", "order": 6, "role": "body", "text": "“We’ll keep treating it, we’ll keep looking at everything we can to help this situation be resolved,\" Pacers coach Rick Carlisle said. “It’s obviously a big loss on the floor without having him out there. Just a tough night.\""}
{"game_id": "0022100465", "chunk_id": "0022100465_007", "order": 7, "role": "body", "text": "It was the first game back for Carlisle, who entered the league’s health and safety protocols on Dec. 9 after testing positive for COVID-19 and missed four games. Indiana led by five early, but the deficit was 12 by the time the first quarter ended and eventually reached 33."}
{"game_id": "0022100465", "chunk_id": "0022100465_008", "order": 8, "role": "body", "text": "“Miami was tremendous,\" Carlisle said. “They played a phenomenal game. They played at an extremely high level and we obviously didn’t play well. So it was a tough night.\""}
{"game_id": "0022100465", "chunk_id": "0022100465_009", "order": 9, "role": "body", "text": "Miami improved to 2-1 in a nine-game stretch where it’ll play at least eight games against teams with losing records. The Heat are playing Orlando twice, Detroit twice, the Pacers, San Antonio, Houston and Sacramento in this portion of the season; Washington (16-15) currently has the best record of Miami’s opponents between now and Jan. 2."}
{"game_id": "0022100465", "chunk_id": "0022100465_010", "order": 10, "role": "body", "text": "The Heat finished 22 of 49 from 3-point range, with Udonis Haslem making the record-tying shot with 1:36 left. The Heat, without starters Jimmy Butler, Bam Adebayo and P.J. Tucker, got 75 points from undrafted players."}
{"game_id": "0022100465", "chunk_id": "0022100465_011", "order": 11, "role": "body", "text": "“Our veteran group really infuses so much confidence in our young guys,\" Heat coach Erik Spoelstra said."}
{"game_id": "0022100465", "chunk_id": "0022100465_013", "order": 13, "role": "body", "text": "Pacers: Indiana lost the season series with the Heat, 2-1. This was the Pacers’ lone trip to Miami this season. ... The game, barring a playoff meeting, was the last in Miami for the longtime and universally well-regarded Pacers media relations director David Benner. He is retiring after the season. Heat guard Victor Oladipo, the former Indiana standout, presented Benner with a signed jersey."}
{"game_id": "0022100465", "chunk_id": "0022100465_014", "order": 14, "role": "body", "text": "Heat: Miami’s first eight shots were all 3-pointers, and first five field goals were all from beyond the arc. ... Tucker (lower left leg nerve inflammation) missed his first game of the season. Robinson and Dewayne Dedmon are now the only Miami players to appear in all 32 games so far, with Robinson’s team record games-played streak at 179 and counting. ... Butler (bruised tailbone) missed his 14th game of the season, including 11 of the last 12."}
{"game_id": "0022100465", "chunk_id": "0022100465_016", "order": 16, "role": "body", "text": "This was the first season series completed by the Pacers this season; they haven’t started series against eight other opponents. It’s the fourth series that’s over for Miami (the Heat went 0-2 against Denver, 1-1 against Memphis and 2-0 against Utah). The Heat have yet to play nine teams."}
{"game_id": "0022100465", "chunk_id": "0022100465_018", "order": 18, "role": "body", "text": "The Pacers haven’t spent a day over .500 this season. There’s still obviously plenty of time to change that, but it’s most unusual for Indiana. The last season where the Pacers never had a winning record at any point in the schedule was 1988-89, a year where they technically had four coaches."}
{"game_id": "0022100465", "chunk_id": "0022100465_020", "order": 20, "role": "body", "text": "Pacers: Host Houston on Thursday."}
{"game_id": "0022100465", "chunk_id": "0022100465_021", "order": 21, "role": "body", "text": "Heat: Host Detroit on Thursday."}
