{"game_id": "0022100849", "chunk_id": "0022100849_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Joel Embiid had a triple-double of 40 points, 14 rebounds and 10 assists along with a highlight-reel jam, and the Philadelphia 76ers beat the Cleveland Cavaliers 103-93 on Saturday night."}
{"game_id": "0022100849", "chunk_id": "0022100849_002", "order": 2, "role": "body", "text": "The Sixers are awaiting the debut of James Harden, who was acquired before the trade deadline."}
{"game_id": "0022100849", "chunk_id": "0022100849_003", "order": 3, "role": "body", "text": "Tyrese Maxey added 16 points for Philadelphia, which has won both games since Thursday’s blockbuster trade that sent disgruntled Ben Simmons to Brooklyn for Harden."}
{"game_id": "0022100849", "chunk_id": "0022100849_004", "order": 4, "role": "body", "text": "Harden arrived in Philadelphia on Saturday, and 76ers general manager Daryl Morey posted a video on social media of his airport embrace with the three-time NBA scoring champion. Harden was evaluated by the team’s medical staff on Saturday, but not present at the arena for the game. Fans cheered loudly when a video showing Harden highlights, which ended with him in a photoshopped 76ers jersey, was posted on the video screen for the second straight night."}
{"game_id": "0022100849", "chunk_id": "0022100849_005", "order": 5, "role": "body", "text": "Embiid’s first-half dunk also got plenty of play on the big board. The 7-foot MVP candidate brought the house down with 1:47 left in the first half with a one-handed throw-down over Jarrett Allen that had fans – and even players – putting their hands to their heads."}
{"game_id": "0022100849", "chunk_id": "0022100849_006", "order": 6, "role": "body", "text": "He posted a picture of the dunk on his social media accounts."}
{"game_id": "0022100849", "chunk_id": "0022100849_007", "order": 7, "role": "body", "text": "“It was crazy, it was cool,” Embiid said. “I was finally able to make my dreams come true.”"}
{"game_id": "0022100849", "chunk_id": "0022100849_008", "order": 8, "role": "body", "text": "Embiid finished 11 of 22 from the field, including 4 of 5 from 3-point range, and made 14 of 15 free throws. He has scored at least 25 points in 31 consecutive games."}
{"game_id": "0022100849", "chunk_id": "0022100849_009", "order": 9, "role": "body", "text": "Darius Garland scored 27 points to lead Cleveland."}
{"game_id": "0022100849", "chunk_id": "0022100849_010", "order": 10, "role": "body", "text": "The already electric atmosphere in Philadelphia created by Embiid’s presence and nightly “M-V-P! M-V-P!” chants is going to ramp up even more when Harden takes the court, which could be as early as Tuesday’s home game against Boston. Philadelphia also plays Thursday at Milwaukee before a hiatus for the All-Star break."}
{"game_id": "0022100849", "chunk_id": "0022100849_011", "order": 11, "role": "body", "text": "“He’s going to make the game easy for all of us, especially me,” Embiid said. “I don’t get a lot of easy shots. I have to work for most of them. I hope he’s going to make my game easier.”"}
{"game_id": "0022100849", "chunk_id": "0022100849_012", "order": 12, "role": "body", "text": "The 76ers looked good without Harden against upstart Cleveland, which entered the contest one game back of first place in the Eastern Conference but played catch-up all night."}
{"game_id": "0022100849", "chunk_id": "0022100849_013", "order": 13, "role": "body", "text": "Philadelphia came out firing, making 11 of its first 14 shots, to double up the Cavs, 30-15 in the early going. The Cavs did manage to go up two points in the third quarter, but Embiid was just too much and Philadelphia pulled away during crunch time."}
{"game_id": "0022100849", "chunk_id": "0022100849_014", "order": 14, "role": "body", "text": "“Every team that is in front of you, you always want to see where we’re at,” Embiid said. “Good to get this first one in and see how we compare to them.”"}
{"game_id": "0022100849", "chunk_id": "0022100849_015", "order": 15, "role": "body", "text": "The defeat was a good lesson for the Cavaliers, according to coach J.B. Bickerstaff."}
{"game_id": "0022100849", "chunk_id": "0022100849_016", "order": 16, "role": "body", "text": "“The intensity at which you’re going to have to play at in order to compete with teams like this,” he said. “It was a clear message from the beginning of the game the intensity they were coming with. These are the tests we talk about and these are the lessons we have to learn. It’s a matter of playing with force and playing with speed.”"}
{"game_id": "0022100849", "chunk_id": "0022100849_018", "order": 18, "role": "body", "text": "Sixers coach Doc Rivers spoke to Harden on Saturday, but didn’t have a timetable for his debut with the 76ers, saying it would depend on his health. Harden missed four straight games before the trade with a hamstring injury."}
{"game_id": "0022100849", "chunk_id": "0022100849_019", "order": 19, "role": "body", "text": "Once healthy, Rivers is excited to get the former NBA MVP on the court. In their conversation, Rivers wanted to put Harden at ease and wanted to let him know the importance of working together in the hopes of winning the franchise’s first title since 1983."}
{"game_id": "0022100849", "chunk_id": "0022100849_020", "order": 20, "role": "body", "text": "Rivers said Harden would enter the lineup when healthy, even if it means he doesn’t have any practice time with the 76ers."}
{"game_id": "0022100849", "chunk_id": "0022100849_022", "order": 22, "role": "body", "text": "Cavaliers: Lauri Markkanen (sprained ankle) missed his 10th in a row, but looked fluid while working out by himself before the game. … Garland played for just the second time in the last seven. He’s been battling lower back soreness."}
{"game_id": "0022100849", "chunk_id": "0022100849_023", "order": 23, "role": "body", "text": "76ers: Rivers said the team’s medical staff wasn’t concerned about Embiid’s right wrist, which was wrapped after Friday’s 100-87 win over Oklahoma City. Embiid played with tape on his right wrist. The Philadelphia star grabbed at his lower back after being fouled by Allen with 1:52 left in the second quarter, but clearly was fine when he dunked five seconds later."}
{"game_id": "0022100849", "chunk_id": "0022100849_025", "order": 25, "role": "body", "text": "Cavaliers: This was the first of four meetings between the Eastern Conference contenders. They’ll play March 4 in Philadelphia and March 16 and April 3 in Cleveland. … Caris LeVert, playing in his third game since being acquired from Indiana on Sunday, scored 11 points. … Fell to 17-13 on the road."}
{"game_id": "0022100849", "chunk_id": "0022100849_026", "order": 26, "role": "body", "text": "76ers: Paul Millsap, also acquired from the Nets along with Harden, was in attendance and received a warm reception when shown on the video board. … Improved to 16-12 at home. … Embiid has played six in a row after a one-game rest on Jan. 31 that followed 21 consecutive contests."}
{"game_id": "0022100849", "chunk_id": "0022100849_028", "order": 28, "role": "body", "text": "Cavaliers: At Atlanta on Tuesday."}
{"game_id": "0022100849", "chunk_id": "0022100849_029", "order": 29, "role": "body", "text": "76ers: Host Boston on Tuesday."}
{"game_id": "0022100849", "chunk_id": "0022100849_031", "order": 31, "role": "body", "text": "More AP NBA coverage: https://apnews.com/hub/NBA and https://twitter.com/AP--Sports"}
