{"game_id": "0022100353", "chunk_id": "0022100353_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Joel Embiid had a season-high 43 points, 15 rebounds and seven assists, and the Philadelphia 76ers held off the short-handed Charlotte Hornets 127-124 in overtime on Monday night."}
{"game_id": "0022100353", "chunk_id": "0022100353_002", "order": 2, "role": "body", "text": "Tobias Harris returned from a one-game absence due to illness and had 21 points and 11 rebounds as the 76ers shot 52.9% from the field and earned back-to-back wins for the first time since Nov. 4-6."}
{"game_id": "0022100353", "chunk_id": "0022100353_003", "order": 3, "role": "body", "text": "Embiid had six of Philadelphia’s eight points in overtime and assisted on the other score."}
{"game_id": "0022100353", "chunk_id": "0022100353_004", "order": 4, "role": "body", "text": "“It’s what I have to do,” Embiid said. “Coaches trust me to put me in those situations. Sometimes I make mistakes, but I feel like I’m getting better and better in those situations. I just made the right plays and made some shots.”"}
{"game_id": "0022100353", "chunk_id": "0022100353_005", "order": 5, "role": "body", "text": "Kelly Oubre Jr. had another standout game with 35 points with six 3-pointers for the Hornets, but missed a 3 at the end of the first overtime that would have tied the game and sent it to a second extra period."}
{"game_id": "0022100353", "chunk_id": "0022100353_006", "order": 6, "role": "body", "text": "Charlotte played without five players, including starters Lamelo Ball, Terry Rozier and Mason Plumlee because of NBA health and safety protocols."}
{"game_id": "0022100353", "chunk_id": "0022100353_007", "order": 7, "role": "body", "text": "The 76ers barely had a possession in which they weren’t looking to dump the ball in the paint to Embiid, especially with the Hornets lacking much rim protection and playing small ball for most of the game."}
{"game_id": "0022100353", "chunk_id": "0022100353_008", "order": 8, "role": "body", "text": "Embiid responded time and time again to the extra workload in what Doc Rivers likes to call a “feed the pig” game."}
{"game_id": "0022100353", "chunk_id": "0022100353_009", "order": 9, "role": "body", "text": "“He's so dominant out there, especially when he is able to get his position on the floor,” Harris said of Embiid, a four-time NBA All-Star. “He's able to punish a team. They threw different guys at him, but he's so much bigger and stronger.\""}
{"game_id": "0022100353", "chunk_id": "0022100353_010", "order": 10, "role": "body", "text": "Embiid said he's been watching film of some of last year's games and said he realized he needed to work harder to get a deeper position on the block. He feels like he's been doing that the last few games — and that now shots are dropping."}
{"game_id": "0022100353", "chunk_id": "0022100353_011", "order": 11, "role": "body", "text": "“I feel like the last couple of games I have really imposed myself inside,” Embiid said."}
{"game_id": "0022100353", "chunk_id": "0022100353_012", "order": 12, "role": "body", "text": "After a tight, back-and-forth fourth quarter, Embiid tied the game with a 18-footer with 29.4 seconds left."}
{"game_id": "0022100353", "chunk_id": "0022100353_013", "order": 13, "role": "body", "text": "Miles Bridges missed a step-back 3 as the shot clock was winding down on Charlotte's next possession, giving the 76ers a chance to win the game on the final possession of regulation. But, Embiid's fall-away jumper didn't drop."}
{"game_id": "0022100353", "chunk_id": "0022100353_014", "order": 14, "role": "body", "text": "But his jumper early in overtime put the 76ers up for good."}
{"game_id": "0022100353", "chunk_id": "0022100353_015", "order": 15, "role": "body", "text": "The Hornets, who played only eight players, were 2 of 9 from the field in overtime."}
{"game_id": "0022100353", "chunk_id": "0022100353_016", "order": 16, "role": "body", "text": "Despite the loss, Borrego had nothing but praise for the play of his short-handed team, which was coming off a win against Atlanta on Sunday night, calling it a “fantastic effort.”"}
{"game_id": "0022100353", "chunk_id": "0022100353_017", "order": 17, "role": "body", "text": "“As proud as I was of them (Sunday) night, I was even more proud with them tonight,” Borrego said. “ Just their spirit, resiliency, but it is who we are and nothing is changing. We are building, we’re growing and we are on a mission here to get better, stronger, be a contender and basically keep climbing.”"}
{"game_id": "0022100353", "chunk_id": "0022100353_019", "order": 19, "role": "body", "text": "Harris said he fought through fatigue after spending the last couple days in bed with an illness. He said once he got going, he felt better. He likes the idea that the 76ers don't have to travel and will play again in Charlotte in two nights, allowing him more time to rest and recover."}
{"game_id": "0022100353", "chunk_id": "0022100353_020", "order": 20, "role": "body", "text": "“I still have some symptoms,” Harris said."}
{"game_id": "0022100353", "chunk_id": "0022100353_022", "order": 22, "role": "body", "text": "Hornets' second-year center Nick Richards got the start for Plumlee and had a career-high 12 points. Rookie guard James Bouknight also had a career-best 11 points for Charlotte."}
{"game_id": "0022100353", "chunk_id": "0022100353_024", "order": 24, "role": "body", "text": "Tyrese Maxey (illness) did not play, meaning Milton got the start at point guard."}
{"game_id": "0022100353", "chunk_id": "0022100353_025", "order": 25, "role": "body", "text": "“Starting is something I definitely feel like I can do in this league,” Milton said."}
{"game_id": "0022100353", "chunk_id": "0022100353_026", "order": 26, "role": "body", "text": "Rivers called Milton's effort “up and down.”"}
{"game_id": "0022100353", "chunk_id": "0022100353_028", "order": 28, "role": "body", "text": "76ers: Had 15 turnovers, which led to 23 Charlotte points. ... Took 20 fewer shots than the Hornets."}
{"game_id": "0022100353", "chunk_id": "0022100353_029", "order": 29, "role": "body", "text": "Hornets: Ish Smith became the fifth Hornets player to be placed into the health and safety protocols earlier in the day, leaving the team without its top three points guards. Cody Martin had to fill in as the starting point guard. ... Rookie JT Thor got a rise from the crowd when he dropped the hammer with a flying one-handed dunk over 6-foot-10 center Andre Drummond in the first quarter."}
{"game_id": "0022100353", "chunk_id": "0022100353_031", "order": 31, "role": "body", "text": "The teams meet again Wednesday night in Charlotte."}
