{"game_id": "0022101131", "chunk_id": "0022101131_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Giannis Antetokounmpo’s game is no laughing matter. His jokes? Well, they could use some work."}
{"game_id": "0022101131", "chunk_id": "0022101131_002", "order": 2, "role": "body", "text": "Antetokounmpo scored 40 points and had a game-deciding block of Joel Embiid in the final seconds to lead the Milwaukee Bucks to a 118-116 victory over the Philadelphia 76ers on Tuesday night in a matchup of two of the Eastern Conference’s top teams."}
{"game_id": "0022101131", "chunk_id": "0022101131_003", "order": 3, "role": "body", "text": "Khris Middleton added 22 points and Jrue Holiday had 18 for the Bucks, who pulled within a half-game of idle Miami for first place in the East."}
{"game_id": "0022101131", "chunk_id": "0022101131_004", "order": 4, "role": "body", "text": "Milwaukee was clinging to a two-point lead when Antetokounmpo swatted away Embiid’s put-back attempt with 1.6 seconds left."}
{"game_id": "0022101131", "chunk_id": "0022101131_005", "order": 5, "role": "body", "text": "“Spectacular block,” 76ers coach Doc Rivers said."}
{"game_id": "0022101131", "chunk_id": "0022101131_006", "order": 6, "role": "body", "text": "“Just a special block,” Bucks coach Mike Budenholzer said."}
{"game_id": "0022101131", "chunk_id": "0022101131_008", "order": 8, "role": "body", "text": "Antetokounmpo, though, seemed more eager to test out his material from his postgame read, a book titled “Dad Jokes,\" and opened his postgame press conference like this:"}
{"game_id": "0022101131", "chunk_id": "0022101131_009", "order": 9, "role": "body", "text": "Q: What do you call a cow on the floor?"}
{"game_id": "0022101131", "chunk_id": "0022101131_011", "order": 11, "role": "body", "text": "Antetokounmpo seemed amused by the joke, which drew only light chuckles from reporters. If not an air ball, it certainly seemed like a miss."}
{"game_id": "0022101131", "chunk_id": "0022101131_012", "order": 12, "role": "body", "text": "His game, however, continues to get rave reviews."}
{"game_id": "0022101131", "chunk_id": "0022101131_013", "order": 13, "role": "body", "text": "“We count on him to make big plays,” Middleton said. “We don’t expect him to make that block, but when he does, we’re not surprised.”"}
{"game_id": "0022101131", "chunk_id": "0022101131_014", "order": 14, "role": "body", "text": "Said Holiday, “Giannis just being Giannis. Made a great play and saved the game.”"}
{"game_id": "0022101131", "chunk_id": "0022101131_015", "order": 15, "role": "body", "text": "James Harden had 32 points and nine rebounds for the 76ers, and Embiid recovered from a slow start and finished with 29 points, 14 rebounds and seven assists. Philadelphia dropped 1½ behind the Heat in the conference."}
{"game_id": "0022101131", "chunk_id": "0022101131_016", "order": 16, "role": "body", "text": "“Couple mistakes defensively and they made us pay for it,” Harden said."}
{"game_id": "0022101131", "chunk_id": "0022101131_017", "order": 17, "role": "body", "text": "Antetokounmpo added 14 rebounds, six assists and three blocks for the defending NBA champion Bucks."}
{"game_id": "0022101131", "chunk_id": "0022101131_018", "order": 18, "role": "body", "text": "The Bucks scored 13 of the first 17 points of the fourth, going in front on Middleton’s 3-pointer that made it 94-93 with nine minutes to play. The game remained close the rest of the way, with neither team going up by more than six points."}
{"game_id": "0022101131", "chunk_id": "0022101131_019", "order": 19, "role": "body", "text": "Every time it looked as if Milwaukee was going to pull away, the 76ers answered with a 3 to stay close. Embiid’s 3-pointer with 49.8 seconds left pulled Philadelphia within 117-116. After a turnover by Brook Lopez, Philadelphia had a chance to go in front, but Embiid missed a 14-footer following a timeout."}
{"game_id": "0022101131", "chunk_id": "0022101131_020", "order": 20, "role": "body", "text": "Antetokounmpo was fouled on the ensuing possession and made the first of two free throws to put the Bucks up 118-116 with 13.2 seconds to play. After another 76ers timeout, Harden’s step-back 3 was long. Embiid grabbed the rebound and looked primed to tie it with an easy layup, but Antetokounmpo blocked it. The officials originally ruled that it was goaltending, tying the score, but it was overturned after a video review."}
{"game_id": "0022101131", "chunk_id": "0022101131_021", "order": 21, "role": "body", "text": "“Just let my instincts play,” Antetokounmpo said. “I just tried to jump as high as I can and make a play.”"}
{"game_id": "0022101131", "chunk_id": "0022101131_022", "order": 22, "role": "body", "text": "The 76ers controlled the ensuing jump ball but ran out of time for a shot."}
{"game_id": "0022101131", "chunk_id": "0022101131_024", "order": 24, "role": "body", "text": "Antetokounmpo and Harden traded first-half highlights, with the Bucks star and two-time MVP dunking on Embiid with his left hand late in the first quarter before a thunderous, two-handed jam late in the second. Harden scored over Antetokounmpo with his trademark step-back 3 with 35.7 seconds left in the first and connected with Matisse Thybulle with a beautiful three-quarter court pass to set Thybulle up for an easy dunk."}
{"game_id": "0022101131", "chunk_id": "0022101131_026", "order": 26, "role": "body", "text": "The game pitted a pair of teams that have their eyes on the NBA title. The Bucks broke a long title drought last season, earning the franchise’s second title after winning their first in 1971. Philadelphia last won a championship in 1983, and the 76ers added Harden at the trade deadline to bolster their chances of the franchise’s fourth title."}
{"game_id": "0022101131", "chunk_id": "0022101131_027", "order": 27, "role": "body", "text": "Milwaukee has been one of the NBA’s best teams since the All-Star break, going 11-4 as it gears up for another postseason run. Philadelphia coach Doc Rivers said he doesn’t hear the Bucks enough when NBA title contenders are mentioned."}
{"game_id": "0022101131", "chunk_id": "0022101131_028", "order": 28, "role": "body", "text": "“I hear everybody but Milwaukee,” Rivers said. “They didn’t luck into winning.”"}
{"game_id": "0022101131", "chunk_id": "0022101131_030", "order": 30, "role": "body", "text": "Bucks: Jrue Holiday (left ankle soreness) and Serge Ibaka (non-COVID illness) returned after both sat out Saturday’s 127-102 loss at Memphis. … Antetokounmpo is 40 points from passing Kareem Abdul-Jabbar as the franchise’s all-time leading scorer. Antetokounmpo has scored 14,172 career points."}
{"game_id": "0022101131", "chunk_id": "0022101131_031", "order": 31, "role": "body", "text": "76ers: Former Sixer and Hall of Famer Bobby Jones rang the ceremonial Liberty Bell prior to the contest. … Connor Castellani, a 29-year-old fan from Linwood, New Jersey, won 76ers season tickets for next season by hitting a half-court shot during a first-half timeout. … Danny Green was assessed a Flagrant 1 foul on Antetokounmpo 1:19 into the fourth."}
{"game_id": "0022101131", "chunk_id": "0022101131_033", "order": 33, "role": "body", "text": "Bucks: At Brooklyn on Thursday night."}
{"game_id": "0022101131", "chunk_id": "0022101131_034", "order": 34, "role": "body", "text": "76ers: At Detroit on Thursday night."}
