{"game_id": "0022100255", "chunk_id": "0022100255_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young scored 21 of his 30 points in the second half, Clint Capela finished with 10 points and 15 rebounds, and the Atlanta Hawks closed a perfect five-game homestand with a 113-101 win over the Oklahoma City Thunder on Monday night."}
{"game_id": "0022100255", "chunk_id": "0022100255_002", "order": 2, "role": "body", "text": "The Hawks held Oklahoma City to 11 points on 4-of-25 shooting in the third period. John Collins finished with five blocks to tie a career high."}
{"game_id": "0022100255", "chunk_id": "0022100255_003", "order": 3, "role": "body", "text": "The Hawks led 66-60 at halftime. By the end of the third, they were ahead 93-71."}
{"game_id": "0022100255", "chunk_id": "0022100255_004", "order": 4, "role": "body", "text": "“We really didn’t make any adjustments,” coach Nate McMillan said. “I thought our guys just really locked in and played defense. We started to push pressure on the basketball and not let them get in front of us.”"}
{"game_id": "0022100255", "chunk_id": "0022100255_005", "order": 5, "role": "body", "text": "Collins had 11 points, six rebounds and five assists."}
{"game_id": "0022100255", "chunk_id": "0022100255_006", "order": 6, "role": "body", "text": "“To hold any NBA team to 11 points in a quarter just shows you where our minds were at,” Collins said. “We want to keep this energy that we have here and take it on the road.”"}
{"game_id": "0022100255", "chunk_id": "0022100255_007", "order": 7, "role": "body", "text": "The Hawks are 8-1 at home but 1-8 in away games."}
{"game_id": "0022100255", "chunk_id": "0022100255_008", "order": 8, "role": "body", "text": "Rookie Josh Giddey, a 19-year-old guard from Australia, had 15 points, eight assists and seven rebounds for the Thunder, and Lu Dort scored 15 points. Oklahoma City was without leading scorer Shai Gilgeous-Alexander, who missed his first game of the season with a sprained right ankle."}
{"game_id": "0022100255", "chunk_id": "0022100255_009", "order": 9, "role": "body", "text": "The Hawks shot 54.2% in the first half and 48.3% overall."}
{"game_id": "0022100255", "chunk_id": "0022100255_010", "order": 10, "role": "body", "text": "The Thunder whittled away at 10-point second-quarter deficit and tied the game at 56 when Jeremiah Robinson-Earl made a pair of free throws with 3:01 remaining. But that lasted 30 seconds before Cam Reddish hit a long 3-pointer to push Atlanta back in front."}
{"game_id": "0022100255", "chunk_id": "0022100255_011", "order": 11, "role": "body", "text": "Atlanta moved to 6-0 with the starting lineup of Young, Capela, Kevin Huerter, Bogdan Bogdanovic and John Collins."}
{"game_id": "0022100255", "chunk_id": "0022100255_012", "order": 12, "role": "body", "text": "Oklahoma City ended up with a 40.2% overall field-goal percentage and 26.3% 3-point percentage (10 of 38)."}
{"game_id": "0022100255", "chunk_id": "0022100255_014", "order": 14, "role": "body", "text": "The only real drama after Atlanta's dominant third quarter came with 6:08 left in the game when the officiating crew of ruled that Young made contact with defender Dort when he made a 3-pointer. The basket was waved off."}
{"game_id": "0022100255", "chunk_id": "0022100255_015", "order": 15, "role": "body", "text": "McMillian issued a coach's challenge."}
{"game_id": "0022100255", "chunk_id": "0022100255_016", "order": 16, "role": "body", "text": "The crew went to video review, which showed there was minimal contact, although Dort stumbled slightly after the two players brushed each other. After the foul was overturned and Young's long ball restored, Atlanta led 104-87 and the Thunder never threatened again."}
{"game_id": "0022100255", "chunk_id": "0022100255_017", "order": 17, "role": "body", "text": "“I think our mindset was different (in the second half),” Young said. “We were just focused.”"}
{"game_id": "0022100255", "chunk_id": "0022100255_019", "order": 19, "role": "body", "text": "McMillan's 696th win as a coach in Portland, Seattle, Indiana and Atlanta moved him into 19th place all-time, one more than Red Holzman. “I really didn’t even think about it,” he said. \"I was more concerned with getting the sweep here at home."}
{"game_id": "0022100255", "chunk_id": "0022100255_020", "order": 20, "role": "body", "text": "“It’s just been a blessing for me to have the opportunity to even coach in this league. It’s something I never really thought about until the end of my career and (former Seattle coach) George Karl asked me to be on his staff. To be able to have all the opportunities that I’ve had is really a blessing.”"}
{"game_id": "0022100255", "chunk_id": "0022100255_022", "order": 22, "role": "body", "text": "Thunder: Host Utah on Wednesday."}
{"game_id": "0022100255", "chunk_id": "0022100255_023", "order": 23, "role": "body", "text": "Hawks: At San Antonio on Wednesday."}
