{"game_id": "0022100329", "chunk_id": "0022100329_001", "order": 1, "role": "lead", "text": "TORONTO -- — Fred VanVleet scored 13 of his 29 points in the fourth quarter and the Toronto Raptors took advantage of Giannis Antetokounmpo sitting out with a sore right calf to beat Milwaukee 97-93 Thursday night, ending the Bucks’ winning streak at eight."}
{"game_id": "0022100329", "chunk_id": "0022100329_002", "order": 2, "role": "body", "text": "Antetokounmpo sat one day after he scored 40 points as Milwaukee beat Charlotte 127-125. The two-time NBA MVP didn’t play for the first time since Nov. 12, when he missed an overtime loss at Boston because of a sprained right ankle."}
{"game_id": "0022100329", "chunk_id": "0022100329_003", "order": 3, "role": "body", "text": "“He’s got some soreness,” Bucks coach Mike Budenholzer said. “He feels it on certain things. I think we feel like it’s hopefully something that’s very short term and that a day or two and hopefully he’ll be ready to go.”"}
{"game_id": "0022100329", "chunk_id": "0022100329_004", "order": 4, "role": "body", "text": "Milwaukee is off Friday before hosting Miami Saturday."}
{"game_id": "0022100329", "chunk_id": "0022100329_005", "order": 5, "role": "body", "text": "VanVleet said the Raptors found out Antetokounmpo wasn’t playing about 30 minutes before tip-off."}
{"game_id": "0022100329", "chunk_id": "0022100329_006", "order": 6, "role": "body", "text": "“You don’t flinch,” VanVleet said. “In the back of your head you just thank the man upstairs, and you go out there and try to get a win.”"}
{"game_id": "0022100329", "chunk_id": "0022100329_007", "order": 7, "role": "body", "text": "Pascal Siakam scored 20 points and Scottie Barnes had 13as the Raptors won for the first time in four games and snapped a five-game home losing streak, their longest since January 2011. Toronto is 3-8 at home."}
{"game_id": "0022100329", "chunk_id": "0022100329_008", "order": 8, "role": "body", "text": "VanVleet shot 9 for 17, including 5 for 10 from long range. He also had four assists and five rebounds."}
{"game_id": "0022100329", "chunk_id": "0022100329_009", "order": 9, "role": "body", "text": "“He was kind of involved in all of it tonight,” Raptors coach Nick Nurse said."}
{"game_id": "0022100329", "chunk_id": "0022100329_010", "order": 10, "role": "body", "text": "VanVleet scored 26 of his 29 points in the second half after making one of three attempts in the first two quarters."}
{"game_id": "0022100329", "chunk_id": "0022100329_011", "order": 11, "role": "body", "text": "“I just reset at half and just made sure I’d be aggressive,” VanVleet said. “I knew that we probably couldn’t win without me being aggressive.”"}
{"game_id": "0022100329", "chunk_id": "0022100329_012", "order": 12, "role": "body", "text": "Jrue Holiday scored a season-high 26 points, Khris Middleton had 22 and Bobby Portis Jr. had 15 points and 11 rebounds for the Bucks, who lost for the first time since a Nov. 14 defeat at Atlanta."}
{"game_id": "0022100329", "chunk_id": "0022100329_013", "order": 13, "role": "body", "text": "Newly signed center DeMarcus Cousins was out for Milwaukee. Cousins scored seven points in 15 minutes in his Bucks debut Wednesday."}
{"game_id": "0022100329", "chunk_id": "0022100329_014", "order": 14, "role": "body", "text": "Gary Trent Jr. returned to Toronto’s starting lineup after missing the past two games because of a sore right calf, but forward OG Anunoby (left hip) and Khem Birch (right knee) sat for the eighth straight game."}
{"game_id": "0022100329", "chunk_id": "0022100329_015", "order": 15, "role": "body", "text": "Holiday shot 10 for 19 and scored 20 or more for the third time in his past five games."}
{"game_id": "0022100329", "chunk_id": "0022100329_016", "order": 16, "role": "body", "text": "“He carried a big load tonight,” Budenholzer said."}
{"game_id": "0022100329", "chunk_id": "0022100329_017", "order": 17, "role": "body", "text": "The Raptors made six of 10 from 3-point range in the first to lead 26-23 after one, then missed seven straight from beyond the arc to begin the second. Toronto led 48-40 at halftime."}
{"game_id": "0022100329", "chunk_id": "0022100329_018", "order": 18, "role": "body", "text": "VanVleet made three 3-pointers and scored 13 points in the third. Middleton replied with seven points in the final minute of the quarter, including a buzzer-beating jump shot, but the Raptors took a 73-68 lead into the fourth."}
{"game_id": "0022100329", "chunk_id": "0022100329_019", "order": 19, "role": "body", "text": "Portis made a 3-pointer with 33 seconds remaining to bring the Bucks to within 93-90, but VanVleet answered with a pair of free throws."}
{"game_id": "0022100329", "chunk_id": "0022100329_020", "order": 20, "role": "body", "text": "Precious Achiuwa fouled Middleton on a 3-point attempt, then picked up another foul battling Portis for the rebound after Middleton missed his third attempt. Portis made the first but missed the second, Milwaukee got the rebound, but Pat Connaughton missed a corner 3 that would have given the Bucks the lead."}
{"game_id": "0022100329", "chunk_id": "0022100329_021", "order": 21, "role": "body", "text": "“Shot felt good,” Connaughton said. “I’ve made a lot of shots in that right corner. Just one that I’d like to have back.”"}
{"game_id": "0022100329", "chunk_id": "0022100329_022", "order": 22, "role": "body", "text": "VanVleet made two more from the line to seal it for Toronto."}
{"game_id": "0022100329", "chunk_id": "0022100329_024", "order": 24, "role": "body", "text": "The Bucks matched a season-low with 16 assists. They also had 16 in an Oct. 31 loss to Utah."}
{"game_id": "0022100329", "chunk_id": "0022100329_026", "order": 26, "role": "body", "text": "Bucks: C Brook Lopez had back surgery in Los Angeles on Thursday. There is no timetable for his return. Lopez hasn’t played since Milwaukee’s season-opening victory over Brooklyn. … Grayson Allen scored 10 points. … Sandro Mamukelashvili had eight points and 10 rebounds. … F Semi Ojeleye (right calf) and G Donte DiVincenzo (left ankle) were not available."}
{"game_id": "0022100329", "chunk_id": "0022100329_027", "order": 27, "role": "body", "text": "Raptors: Toronto snapped a five-game home losing streak against the Bucks. … Siakam, who fouled out, and Achiuwa each had eight rebounds. … Siakam has scored 17 or more in seven straight games. … VanVleet finished 6 for 6 at the free throw line."}
{"game_id": "0022100329", "chunk_id": "0022100329_029", "order": 29, "role": "body", "text": "Bucks: Host Miami on Saturday night"}
{"game_id": "0022100329", "chunk_id": "0022100329_030", "order": 30, "role": "body", "text": "Raptors: Host Washington on Sunday night."}
