{"game_id": "0022100323", "chunk_id": "0022100323_001", "order": 1, "role": "lead", "text": "MIAMI -- — Kevin Love scored 22 points and the Cleveland Cavaliers snapped a 20-game losing streak in Miami, beating the Heat 111-85 on Wednesday night."}
{"game_id": "0022100323", "chunk_id": "0022100323_002", "order": 2, "role": "body", "text": "Jarrett Allen added 19 points and 11 rebounds and Darius Garland finished with 16 points for the Cavaliers, who had not won on the Heat’s home court since Jan. 25, 2010."}
{"game_id": "0022100323", "chunk_id": "0022100323_003", "order": 3, "role": "body", "text": "“2010? I was 9 years old,” said Cavaliers rookie Evan Mobley, who had a double-double with 17 points and 11 rebounds."}
{"game_id": "0022100323", "chunk_id": "0022100323_004", "order": 4, "role": "body", "text": "Tyler Herro scored 21 points for Miami, which played without injured starters Jimmy Butler and Bam Adebayo."}
{"game_id": "0022100323", "chunk_id": "0022100323_005", "order": 5, "role": "body", "text": "Cleveland took the lead for good early on a 14-0 run in the first quarter. Love hit two 3-pointers during the surge, finishing 6 of 8 from beyond the arc."}
{"game_id": "0022100323", "chunk_id": "0022100323_006", "order": 6, "role": "body", "text": "“Tonight we wanted to set the tone,” Allen said. “We all know they’re down a couple of star players but that’s no excuse for us to go out there and be lackadaisical. We went out there and threw the first punch and we took it home.”"}
{"game_id": "0022100323", "chunk_id": "0022100323_007", "order": 7, "role": "body", "text": "The Cavaliers made 16-of-31 3-pointers and built a 61-43 lead at halftime, then went on an 18-4 run to end the third period. It's Cleveland's second win in a row, following Monday's 114-96 victory at Dallas."}
{"game_id": "0022100323", "chunk_id": "0022100323_008", "order": 8, "role": "body", "text": "“We knew that we had a job to do and that’s the way how we approached the game,” Cleveland coach J.B. Bickerstaff said. “There can’t be any letdown when you’re playing a team that carries the reputation that the Miami Heat carry. Our guys were aware of that and they went out with a business-like approach and got the job done.”"}
{"game_id": "0022100323", "chunk_id": "0022100323_009", "order": 9, "role": "body", "text": "Dewayne Dedmon started at center for Miami in place of Adebayo, who learned Wednesday that he’s likely out until at least mid-January. Tests confirmed that Adebayo tore a ligament in his right thumb during Monday’s loss to Denver. He is scheduled to undergo surgery Sunday, at which time the Heat will have a more definitive timetable for his return."}
{"game_id": "0022100323", "chunk_id": "0022100323_010", "order": 10, "role": "body", "text": "“When you lose an All-Star player, it’s never easy,” Miami coach Erik Spoelstra said. “But this is the league, and when I look around the league, I see a lot of teams dealing with injuries, guys out and guys coming back.”"}
{"game_id": "0022100323", "chunk_id": "0022100323_011", "order": 11, "role": "body", "text": "Butler (bruised tailbone) also remained sidelined."}
{"game_id": "0022100323", "chunk_id": "0022100323_012", "order": 12, "role": "body", "text": "“Guys will have to step up, not just bigs, but guards have to help rebound,” Herro said. “All five guys on the floor can really impact the game whether it’s defensively or rebounding.”"}
{"game_id": "0022100323", "chunk_id": "0022100323_013", "order": 13, "role": "body", "text": "Heat guard Duncan Robinson was scoreless in seven field-goal attempts, ending his franchise record of consecutive games with a 3-pointer at 69."}
{"game_id": "0022100323", "chunk_id": "0022100323_015", "order": 15, "role": "body", "text": "Cavaliers: This is the first season since 2000-01 that Cleveland hasn’t been below .500 after 22 games without LeBron James on the roster. ... Garland became very familiar to Erik Spoelstra over the summer, when the Heat coach led the USA Basketball select team tasked with helping the Olympic team get ready for the Tokyo Games. Garland was one of the select team’s top players. “He had his moments,” Spoelstra said."}
{"game_id": "0022100323", "chunk_id": "0022100323_016", "order": 16, "role": "body", "text": "Heat: The game was played one day shy of the 11th anniversary of the Heat vs. Cavaliers game in which James returned to Cleveland as an opponent for the first time. ... Butler missed his fifth game of the season, Adebayo his fourth."}
{"game_id": "0022100323", "chunk_id": "0022100323_018", "order": 18, "role": "body", "text": "The NBA announced Wednesday that the Heat will lose a future second-round draft pick as the penalty for violating “league rules governing the timing of this season’s free agency discussions.” The NBA had spent months looking into the circumstances surrounding Miami’s acquisition of Kyle Lowry in the offseason. The same penalty was imposed Wednesday on the Chicago Bulls, who were probed for how they landed Lonzo Ball."}
{"game_id": "0022100323", "chunk_id": "0022100323_020", "order": 20, "role": "body", "text": "It’ll be a hectic month for both teams. The Cavaliers and Heat both play 16 times in December."}
{"game_id": "0022100323", "chunk_id": "0022100323_022", "order": 22, "role": "body", "text": "Cavaliers: Visit Washington on Friday."}
{"game_id": "0022100323", "chunk_id": "0022100323_023", "order": 23, "role": "body", "text": "Heat: Visit Indiana on Friday."}
