{"game_id": "0022100121", "chunk_id": "0022100121_001", "order": 1, "role": "lead", "text": "MIAMI -- — Whatever the Boston Celtics said at that team dinner a few days ago clearly worked."}
{"game_id": "0022100121", "chunk_id": "0022100121_002", "order": 2, "role": "body", "text": "Especially on the defensive end."}
{"game_id": "0022100121", "chunk_id": "0022100121_003", "order": 3, "role": "body", "text": "Jaylen Brown scored 17 points to lead six Boston players in double figures, and the Celtics played airtight defense for a second consecutive night on the way to easily beating the Miami Heat 95-78 on Thursday."}
{"game_id": "0022100121", "chunk_id": "0022100121_004", "order": 4, "role": "body", "text": "The Celtics became the first team since Toronto in April 2018 to hold consecutive opponents under 80 points, and Miami had its worst scoring night since managing only 74 at Oklahoma City on Jan. 17, 2016."}
{"game_id": "0022100121", "chunk_id": "0022100121_005", "order": 5, "role": "body", "text": "“I wouldn’t say that’s the prototype for us offensively,\" Celtics coach Ime Udoka said. “Defensively, that’s exactly what we want it to look like.\""}
{"game_id": "0022100121", "chunk_id": "0022100121_006", "order": 6, "role": "body", "text": "Dennis Schroder scored 14, Aaron Nesmith had 13 and Romeo Langford scored 12 for Boston, which swept a back-to-back in Orlando and Miami by giving up an average of 78.5 points on 33% shooting. The Celtics topped the Magic 92-79 on Wednesday."}
{"game_id": "0022100121", "chunk_id": "0022100121_007", "order": 7, "role": "body", "text": "Boston's week started by giving up 128 points at home to Chicago on Monday. Then came a team dinner on Tuesday, and the Celtics' defense has been feasting since."}
{"game_id": "0022100121", "chunk_id": "0022100121_008", "order": 8, "role": "body", "text": "“Everyone’s locked in one through five,” Langford said. “We guard through the whole possession. We limited those guys on second-chance points and guarded them individually.”"}
{"game_id": "0022100121", "chunk_id": "0022100121_009", "order": 9, "role": "body", "text": "Jimmy Butler scored 20 points for Miami, which lost point guard Kyle Lowry to a sprained left ankle in the third quarter as part of an utterly forgettable night. The Heat shot 35%, 9 for 41 from 3-point range and managed a total of 54 points in the final three quarters. Lowry will be re-evaluated Friday, the Heat said."}
{"game_id": "0022100121", "chunk_id": "0022100121_010", "order": 10, "role": "body", "text": "Duncan Robinson had 16 points on 5-for-17 shooting — all of it from 3-point range — for the Heat, and Bam Adebayo scored 13."}
{"game_id": "0022100121", "chunk_id": "0022100121_011", "order": 11, "role": "body", "text": "“Any time you get punched in the mouth like that, you've got to learn from it,\" Robinson said."}
{"game_id": "0022100121", "chunk_id": "0022100121_012", "order": 12, "role": "body", "text": "The Heat got what had been a 20-point deficit down to eight late in the third quarter, a 14-2 run making it 62-54."}
{"game_id": "0022100121", "chunk_id": "0022100121_013", "order": 13, "role": "body", "text": "Whatever hope Miami had at that point didn’t last for long. Boston closed the third on an 11-1 run to go up by 18, Lowry limped into the locker room in obvious pain, and the Celtics maintained control the rest of the way."}
{"game_id": "0022100121", "chunk_id": "0022100121_014", "order": 14, "role": "body", "text": "Miami had four separate scoreless stretches of 2 minutes, 21 seconds or more in the first half alone, including a stretch of 5:38 late in the second quarter as Boston took control."}
{"game_id": "0022100121", "chunk_id": "0022100121_015", "order": 15, "role": "body", "text": "Tyler Herro scored on a drive to put Miami up 28-21 with 10:50 left in the half. From there, it was all Boston."}
{"game_id": "0022100121", "chunk_id": "0022100121_016", "order": 16, "role": "body", "text": "The Celtics went on a 30-5 run over the rest of the second quarter, 15 of those points being unanswered, and ended up taking a 51-33 lead into the half. Boston outscored Miami 11-0 off turnovers in the half."}
{"game_id": "0022100121", "chunk_id": "0022100121_017", "order": 17, "role": "body", "text": "The Heat had the second-worst second quarter in franchise history in terms of points scored (9, two more than they had against Charlotte on Dec. 23, 1995) and point differential (24, two shy of the 26-point difference against Charlotte on March 11, 2020)."}
{"game_id": "0022100121", "chunk_id": "0022100121_018", "order": 18, "role": "body", "text": "“Defensively, you do have to give Boston credit,\" Heat coach Erik Spoelstra said. “That’s probably as poorly as we’ve played offensively all season, including preseason and training camp. But those nights are going to happen. Sometimes it's going to be ugly offensively.\""}
{"game_id": "0022100121", "chunk_id": "0022100121_020", "order": 20, "role": "body", "text": "Celtics: Boston hasn’t lost in Miami since Jan. 10, 2019, going 4-0 since. That doesn’t include Miami’s “home” games in the restart bubble at Walt Disney World during the 2020 season. ... Josh Richardson, the former Miami guard, missed the game with a left foot contusion. ... Jayson Tatum started 0 for 8 and finished with 10 points, and Al Horford scored 10 for the Celtics. ... Brown left in the second half with right hamstring tightness."}
{"game_id": "0022100121", "chunk_id": "0022100121_021", "order": 21, "role": "body", "text": "Heat: Robinson's 17 3-point tries tied Wayne Ellington's Heat single-game record. ... Let this illustrate how rough a shooting night it was for Miami. Butler, an 89% foul shooter this season entering Thursday and an 84% shooter for his career, went 0 for 2 on a trip to the line in the first half. He hadn’t done that since Feb. 13."}
{"game_id": "0022100121", "chunk_id": "0022100121_023", "order": 23, "role": "body", "text": "Spoelstra, whose team is fully vaccinated against COVID-19, said Miami players will have booster shots available to them “pretty soon.” A handful of NBA players tested positive and entered the league’s health and safety protocols in recent days, and Spoelstra said that serves as a reminder that the virus is still a major concern. “You have to be as vigilant as possible,” Spoelstra said."}
{"game_id": "0022100121", "chunk_id": "0022100121_025", "order": 25, "role": "body", "text": "Udoka became the 100th different coach to go against Spoelstra, who is in his 14th season with the Heat. Udoka and Spoelstra both have deep ties to Portland, have known each other for years and worked together this summer with USA Basketball on its way to the Olympic gold medal. The only opposing coaches on that list Spoelstra hasn’t beaten: Ryan Saunders (0-3), Marc Iavaroni (0-1) and now Udoka (0-1)."}
{"game_id": "0022100121", "chunk_id": "0022100121_027", "order": 27, "role": "body", "text": "Celtics: Visit Dallas on Saturday."}
