{"game_id": "0022100715", "chunk_id": "0022100715_001", "order": 1, "role": "lead", "text": "TORONTO -- — Pascal Siakam had 24 points and matched his career high with 12 assists, and Gary Trent Jr. scored a season-best 32 for the Toronto Raptors in a 125-113 victory over the Charlotte Hornets on Tuesday night."}
{"game_id": "0022100715", "chunk_id": "0022100715_002", "order": 2, "role": "body", "text": "OG Anunoby added 24 points, Chris Boucher had 12, Malachi Flynn 11 and Dalano Banton 10 as the short-handed Raptors overcame the absences of starters Fred VanVleet and Scottie Barnes. VanVleet sat out with a sore right knee, and Barnes was scratched less than an hour before tipoff because of a sore right wrist."}
{"game_id": "0022100715", "chunk_id": "0022100715_003", "order": 3, "role": "body", "text": "With VanVleet unavailable, Siakam started at point guard. He wasted no time showing off his playmaking skills, registering four assists in each of the first two quarters."}
{"game_id": "0022100715", "chunk_id": "0022100715_004", "order": 4, "role": "body", "text": "“I’m just trying to be an overall player,” Siakam said. “I feel like I can do that most nights, just being the best player out there and making my teammates better. That’s the role I’m trying to take on.”"}
{"game_id": "0022100715", "chunk_id": "0022100715_005", "order": 5, "role": "body", "text": "Siakam was replaced with 3:07 to play and Toronto leading by 17. He finished with nine rebounds, narrowly missing his second career triple-double."}
{"game_id": "0022100715", "chunk_id": "0022100715_006", "order": 6, "role": "body", "text": "Siakam lost a triple-double in a Jan. 15 win at Milwaukee when the NBA took two rebounds away from him following the game."}
{"game_id": "0022100715", "chunk_id": "0022100715_007", "order": 7, "role": "body", "text": "“As long as we win, man, I’m cool,” Siakam said. “To be out there getting wins is more important to me.”"}
{"game_id": "0022100715", "chunk_id": "0022100715_008", "order": 8, "role": "body", "text": "LaMelo Ball scored 25 points and Miles Bridges had 22 for the Hornets, who had won three straight road games but also were missing key players. Gordon Hayward (sore right foot) and Jalen McDaniels (sprained left ankle) both sat out for the second consecutive game."}
{"game_id": "0022100715", "chunk_id": "0022100715_009", "order": 9, "role": "body", "text": "James Bouknight scored 18 points, and Mason Plumlee and Terry Rozier each had 12."}
{"game_id": "0022100715", "chunk_id": "0022100715_010", "order": 10, "role": "body", "text": "“Not enough defense in this game, period,” Hornets coach James Borrego said. “First quarter, got off to a poor start defensively, and it carried through.”"}
{"game_id": "0022100715", "chunk_id": "0022100715_011", "order": 11, "role": "body", "text": "Toronto came in trailing Charlotte by 2½ games in the Eastern Conference. The Raptors (23-22) have played three fewer games than the Hornets (26-22)."}
{"game_id": "0022100715", "chunk_id": "0022100715_012", "order": 12, "role": "body", "text": "“It’s important,” Siakam said of maintaining position in the tightly packed standings. “We’re all right there. You go into a little slump and it could be the end of the season for you.”"}
{"game_id": "0022100715", "chunk_id": "0022100715_013", "order": 13, "role": "body", "text": "After scoring a season-low 34 points in the first half of Sunday’s loss to Portland, Toronto shot 16 for 26 in the opening period, including 7 for 11 from 3-point range, to lead 39-27 after one."}
{"game_id": "0022100715", "chunk_id": "0022100715_014", "order": 14, "role": "body", "text": "“It just seemed like every time we were going to shoot the other night, it wasn’t going to go in,” Raptors coach Nick Nurse said of Sunday, when his team shot 5 for 26 in the first quarter. “Everybody that stepped into one tonight, you thought they were going to make them.”"}
{"game_id": "0022100715", "chunk_id": "0022100715_015", "order": 15, "role": "body", "text": "Bridges and Bouknight each scored 13 points in the second, but Toronto kept up its hot shooting, connecting on 13 of 21 attempts. The Raptors led 76-61 at halftime, their highest-scoring half of the season."}
{"game_id": "0022100715", "chunk_id": "0022100715_016", "order": 16, "role": "body", "text": "“They had great rhythm, they stepped into all their shots, and they got second opportunities,” Plumlee said."}
{"game_id": "0022100715", "chunk_id": "0022100715_017", "order": 17, "role": "body", "text": "Charlotte opened the third quarter with a 14-2 run, cutting the deficit to 78-75 with 7:29 left, but Trent scored 14 points as the Raptors pulled away again, taking a 105-86 lead into the fourth."}
{"game_id": "0022100715", "chunk_id": "0022100715_019", "order": 19, "role": "body", "text": "Hornets: Lost on the road for the first time since a 124-121 defeat at Washington on Jan. 3. … Borrego said McDaniels did not accompany the team on its two-game trip to Toronto and Indiana."}
{"game_id": "0022100715", "chunk_id": "0022100715_020", "order": 20, "role": "body", "text": "Raptors: Nurse said Barnes and VanVleet will accompany the team on a three-game road trip that begins Wednesday in Chicago. … Boucher and Precious Achiuwa started for Toronto. … C Khem Birch (broken nose) sat out for the sixth straight game and is not close to a return, Nurse said. … Toronto plays 11 of its next 15 on the road."}
{"game_id": "0022100715", "chunk_id": "0022100715_022", "order": 22, "role": "body", "text": "Toronto’s Justin Champagnie and Charlotte’s P.J. Washington were ejected with 1:46 left in the first quarter after a shoving match under the Hornets’ basket."}
{"game_id": "0022100715", "chunk_id": "0022100715_023", "order": 23, "role": "body", "text": "“I didn’t quite understand the call but they made their call and we’ve got to adjust,” Borrego said. “It obviously affected our lineup and our rotations, but that’s part of the game. You’ve got to adjust, you’ve got to adapt, and they did a better job of that than we did.”"}
{"game_id": "0022100715", "chunk_id": "0022100715_025", "order": 25, "role": "body", "text": "Hornets: Visit the Indiana Pacers on Wednesday."}
{"game_id": "0022100715", "chunk_id": "0022100715_026", "order": 26, "role": "body", "text": "Raptors: At the Chicago Bulls on Wednesday."}
