{"game_id": "0022100104", "chunk_id": "0022100104_001", "order": 1, "role": "lead", "text": "DALLAS -- — Four Miami Heat players had 22 or more points for the first time in franchise history to hold off a late Dallas rally and beat the Mavericks 125-110 on Tuesday night for their fifth straight win."}
{"game_id": "0022100104", "chunk_id": "0022100104_002", "order": 2, "role": "body", "text": "Tyler Herro scored 25 points off the bench, 15 alone in the second quarter when the Heat outscored the Mavericks 46-32 to take a 70-62 halftime lead. Jimmy Butler added 23 points, Kyle Lowry had 22 and Bam Adebayo scored 22 and grabbed 13 rebounds."}
{"game_id": "0022100104", "chunk_id": "0022100104_003", "order": 3, "role": "body", "text": "Miami’s top scorers did so from all over the court. Butler sank 15 of 17 free throws while Lowry hit six of nine 3-pointers. The Heat shot 52% behind the arc."}
{"game_id": "0022100104", "chunk_id": "0022100104_004", "order": 4, "role": "body", "text": "“You want to be able to maximize your offense in all the different ways in your menu without feeling like you’re taking turns,” Heat coach Erik Spoelstra said."}
{"game_id": "0022100104", "chunk_id": "0022100104_005", "order": 5, "role": "body", "text": "Luka Doncic scored a season-high 33 points for the Mavericks, who lost for the first time in four home games."}
{"game_id": "0022100104", "chunk_id": "0022100104_006", "order": 6, "role": "body", "text": "Miami is off to its first 6-1 start since the 2012-13 season, when it won the second of its three NBA championships."}
{"game_id": "0022100104", "chunk_id": "0022100104_007", "order": 7, "role": "body", "text": "“The Heat, I would consider them the best team in the league right now,” Dallas coach Jason Kidd said."}
{"game_id": "0022100104", "chunk_id": "0022100104_008", "order": 8, "role": "body", "text": "Dallas' Jalen Brunson had a season-high 25 points in his first start of the season, necessitated by injuries that have sidelined big men Kristaps Porzingis and Maxi Kleber."}
{"game_id": "0022100104", "chunk_id": "0022100104_009", "order": 9, "role": "body", "text": "Porzingis missed his fourth straight game with lower back tightness. Kleber, who started Sunday’s win over Sacramento in Porzingis’ place, left that game late in the first period and will be out 7-10 days with a left oblique strain."}
{"game_id": "0022100104", "chunk_id": "0022100104_010", "order": 10, "role": "body", "text": "The Mavericks got out to a 20-9 lead seven minutes into the game, hitting four of their first six 3-pointers before the Heat pushed back, led by Herro’s second-quarter scoring."}
{"game_id": "0022100104", "chunk_id": "0022100104_011", "order": 11, "role": "body", "text": "Miami led 97-81 with 2:12 to play in the third quarter when Dallas began its run. The Mavericks pulled within 101-95 two minutes into the fourth period before the Heat held them off down the stretch."}
{"game_id": "0022100104", "chunk_id": "0022100104_012", "order": 12, "role": "body", "text": "Spoelstra said Herro made his largest improvements over the summer."}
{"game_id": "0022100104", "chunk_id": "0022100104_013", "order": 13, "role": "body", "text": "“People are noticing now from a lot of work that happened behind the scenes,” Spoelstra said."}
{"game_id": "0022100104", "chunk_id": "0022100104_015", "order": 15, "role": "body", "text": "Veteran Mavericks guard Trey Burke, who is unvaccinated, missed the COVID-19 testing window for the second time in four games and was unavailable, forfeiting another game check. Kidd said Burke will travel with the team for Wednesday night’s game at San Antonio."}
{"game_id": "0022100104", "chunk_id": "0022100104_016", "order": 16, "role": "body", "text": "“For us as the Mavs, we can only talk (to him) about it,” Kidd said. “He has the responsibility to show up on time.”"}
{"game_id": "0022100104", "chunk_id": "0022100104_018", "order": 18, "role": "body", "text": "Herro has 157 points off the bench in the season’s first seven games. That’s more than any player has scored coming off the bench since 1975, when the NBA began charting stats by whether a player started a game or was a reserve. The previous mark through a team’s first seven games was 156 by Jason Terry (2007-08) and Michael Brooks (1980-81)."}
{"game_id": "0022100104", "chunk_id": "0022100104_020", "order": 20, "role": "body", "text": "Heat: Spoelstra’s 613rd career win tied him for 26th most in NBA history. ... Duncan Robinson has hit 3-pointers in 55 consecutive games, beginning last Feb. 11. It’s the second-longest streak in franchise history to Robinson’s 57 straight from Nov. 25, 2019, to Aug. 12, 2020."}
{"game_id": "0022100104", "chunk_id": "0022100104_021", "order": 21, "role": "body", "text": "Mavericks: Doncic shot 3 for 9 behind the line and is hitting 25.5% this season coming into the season at 32.9% during his first three seasons. He passed his coach and moved into 14th place on the franchise points list with 5,283 to Kidd’s 5,258."}
{"game_id": "0022100104", "chunk_id": "0022100104_023", "order": 23, "role": "body", "text": "Heat: Host Boston on Thursday in the first of two consecutive games at home, where they are 3-0 this season."}
{"game_id": "0022100104", "chunk_id": "0022100104_024", "order": 24, "role": "body", "text": "Mavericks: At San Antonio on Wednesday night to close second back-to-back in the season’s first eight games."}
