{"game_id": "0022100915", "chunk_id": "0022100915_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Kelly Olynyk made a fadeaway jumper from the baseline at the overtime buzzer and the Detroit Pistons beat Charlotte 127-126 on Sunday night, their first victory over the Hornets in nearly 4 1/2 years."}
{"game_id": "0022100915", "chunk_id": "0022100915_002", "order": 2, "role": "body", "text": "Saddiq Bey had 28 points and eight rebounds and Jerami Grant added 26 points for Detroit, which had lost 15 straight games to the Hornets since its last win on Oct. 18, 2017."}
{"game_id": "0022100915", "chunk_id": "0022100915_003", "order": 3, "role": "body", "text": "Olynyk had 20 points and eight rebounds for the Pistons, who have won three of four. Rookie Cade Cunningham scored 19 points."}
{"game_id": "0022100915", "chunk_id": "0022100915_004", "order": 4, "role": "body", "text": "It was Olynyk's first NBA game-winner."}
{"game_id": "0022100915", "chunk_id": "0022100915_005", "order": 5, "role": "body", "text": "“It took me nine years, but I'm here,” the 30-year-old Olynyk said."}
{"game_id": "0022100915", "chunk_id": "0022100915_006", "order": 6, "role": "body", "text": "Charlotte got 33 points from Terry Rozier and 29 points and 10 rebounds from Miles Bridges."}
{"game_id": "0022100915", "chunk_id": "0022100915_007", "order": 7, "role": "body", "text": "P.J. Washington — who sent the game to an extra period when he scored off an offensive rebound — missed a layup with 20 seconds left in OT that would have given Charlotte a three-point lead."}
{"game_id": "0022100915", "chunk_id": "0022100915_008", "order": 8, "role": "body", "text": "After Cunningham missed a jumper, Detroit won a jump ball with 6.8 seconds left. Cunningham drove but was fouled, giving the Pistons the ball on the side with 2.1 seconds left. The inbounds pass from Killian Hayes went to Olynyk near the baseline and he turned and fired a 13-footer over Washington's outstretched arm."}
{"game_id": "0022100915", "chunk_id": "0022100915_009", "order": 9, "role": "body", "text": "Olynyk said the Pistons had an inbounds play drawn up — one they have practiced frequently — but wound up having to improvise."}
{"game_id": "0022100915", "chunk_id": "0022100915_010", "order": 10, "role": "body", "text": "“Sometimes you have to just read and react in this league,” Olynyk said. “I saw an opening and obviously Killian saw it as well, and that's half the battle. You have to have both guys on the same page.”"}
{"game_id": "0022100915", "chunk_id": "0022100915_011", "order": 11, "role": "body", "text": "Pistons coach Dwane Casey liked the way his team persevered during a game with 20 lead changes."}
{"game_id": "0022100915", "chunk_id": "0022100915_012", "order": 12, "role": "body", "text": "“A month ago, we would’ve hung our heads and hung our coat at the end of regulation, but we stayed together and stuck together,” Casey said."}
{"game_id": "0022100915", "chunk_id": "0022100915_013", "order": 13, "role": "body", "text": "The Hornets had a chance to win at the end of regulation when LaMelo Ball stole an inbounds pass after Washington's bucket, but the All-Star missed a 16-footer at the buzzer. Ball also missed a 2-footer off an offensive rebound in overtime and finished 6 of 24 shooting from the field for 17 points."}
{"game_id": "0022100915", "chunk_id": "0022100915_014", "order": 14, "role": "body", "text": "For the Hornets, it was another frustrating loss to one of the NBA's cellar dwellers."}
{"game_id": "0022100915", "chunk_id": "0022100915_015", "order": 15, "role": "body", "text": "Earlier this season they lost to the Houston Rockets and Orlando Magic — games that could cost them valuable playoff positioning or even knock them out of the postseason altogether."}
{"game_id": "0022100915", "chunk_id": "0022100915_016", "order": 16, "role": "body", "text": "“We have to fix it,” Bridges said. “We can’t play down to our competition.”"}
{"game_id": "0022100915", "chunk_id": "0022100915_017", "order": 17, "role": "body", "text": "Charlotte fell to 0-6 in overtime games."}
{"game_id": "0022100915", "chunk_id": "0022100915_018", "order": 18, "role": "body", "text": "“We have to make shots and be better and make a play down the stretch,\" coach James Borrego said. \"It isn’t tricky here — one rebound, one stop, one free throw, one shot. We continue to put ourselves in position to win games, we just have to find a way to close out and make one more play.”"}
{"game_id": "0022100915", "chunk_id": "0022100915_020", "order": 20, "role": "body", "text": "Mason Plumlee's free-throw shooting is becoming a serious liability for the Hornets. He entered the game shooting 37.3% from the line and went 1 of 7 against the Pistons."}
{"game_id": "0022100915", "chunk_id": "0022100915_021", "order": 21, "role": "body", "text": "With about five minutes left, the Pistons intentionally fouled Plumlee and he missed two free throws badly, allowing Detroit to steal an extra possession."}
{"game_id": "0022100915", "chunk_id": "0022100915_023", "order": 23, "role": "body", "text": "Pistons: Outrebounded the Hornets 54-46."}
{"game_id": "0022100915", "chunk_id": "0022100915_024", "order": 24, "role": "body", "text": "Hornets: Cody Martin, who missed the team's final six games before the All-Star break, was a big contributor off the bench, finishing with 13 points on 6-of-6 shooting."}
{"game_id": "0022100915", "chunk_id": "0022100915_026", "order": 26, "role": "body", "text": "Pistons: At Washington on Tuesday night."}
{"game_id": "0022100915", "chunk_id": "0022100915_027", "order": 27, "role": "body", "text": "Hornets: At Milwaukee on Monday night."}
