{"game_id": "0022100417", "chunk_id": "0022100417_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Darius Garland scored 21 points, Isaac Okoro added 20 and the Cleveland Cavaliers won their fifth straight game, a 124-89 rout of the Houston Rockets on Wednesday night."}
{"game_id": "0022100417", "chunk_id": "0022100417_002", "order": 2, "role": "body", "text": "Ricky Rubio had seven points and a season-high 12 assists, and Dean Wade scored 16 points for Cleveland, which led 84-39 midway through the third quarter and had 100 points entering the fourth."}
{"game_id": "0022100417", "chunk_id": "0022100417_003", "order": 3, "role": "body", "text": "It was the largest victory margin of the season for the Cavaliers and the Rockets’ most lopsided loss."}
{"game_id": "0022100417", "chunk_id": "0022100417_004", "order": 4, "role": "body", "text": "“To keep this streak going, that’s what we’re out to do,” said Okoro, who is averaging 19.0 points over the last four games. “We’ll keep on working and our shots will keep on falling.”"}
{"game_id": "0022100417", "chunk_id": "0022100417_005", "order": 5, "role": "body", "text": "Cleveland’s last five-game winning streak occurred from March 28-April 5, 2018, with LeBron James on the roster. The Cavaliers have the fourth-best record in the East at 18-12."}
{"game_id": "0022100417", "chunk_id": "0022100417_006", "order": 6, "role": "body", "text": "“We’re putting in the work, so we have the confidence that the ball is going to go in every time,” Garland said. “Our mindset all season is to play all 48 minutes. We did that tonight.”"}
{"game_id": "0022100417", "chunk_id": "0022100417_007", "order": 7, "role": "body", "text": "Houston coach Stephen Silas walked off the court late in the first quarter and was treated for dehydration. The son of longtime NBA coach Paul Silas motioned to assistant John Lucas to take over as he headed past the bench."}
{"game_id": "0022100417", "chunk_id": "0022100417_008", "order": 8, "role": "body", "text": "Silas, 48, received fluids from the Rockets’ medical staff and spent the remainder of the game in the locker room. He was able to travel back to Houston with the team."}
{"game_id": "0022100417", "chunk_id": "0022100417_009", "order": 9, "role": "body", "text": "“He’s OK, he’s better,” Lucas said. “We were slowly drifting when Coach left and we lost our composure for about five minutes after. They just had us at everything.”"}
{"game_id": "0022100417", "chunk_id": "0022100417_010", "order": 10, "role": "body", "text": "Rookie Alperen Sengun had season highs of 19 points and 11 rebounds. Josh Christopher scored 17 points and KJ Martin added 14 for Houston. The Rockets have lost three of their last four after winning seven in a row, dropping to 9-19."}
{"game_id": "0022100417", "chunk_id": "0022100417_011", "order": 11, "role": "body", "text": "Garland scored 17 points in the first half as the Cavaliers built a 69-38 lead, their largest at intermission since being up 34 on Nov. 25, 2016, against Dallas. All five games in their winning streak have been by double digits."}
{"game_id": "0022100417", "chunk_id": "0022100417_012", "order": 12, "role": "body", "text": "“We did the job we had to do,” Cleveland coach J.B. Bickerstaff said. “We played well and we played up to our standards. That’s all we ask from our guys.”"}
{"game_id": "0022100417", "chunk_id": "0022100417_013", "order": 13, "role": "body", "text": "The Cavaliers were without rookie Evan Mobley, who bruised his right hip Monday against Miami. The third overall pick is averaging 13.8 points, 8.3 rebounds and 1.8 blocked shots. Cleveland is 1-4 when he isn’t in uniform."}
{"game_id": "0022100417", "chunk_id": "0022100417_014", "order": 14, "role": "body", "text": "Center Christian Wood was a game-day scratch with left knee tendinitis, leaving Houston with 10 available players. Guard Eric Gordon sat out for the second time in three games with a tight groin."}
{"game_id": "0022100417", "chunk_id": "0022100417_015", "order": 15, "role": "body", "text": "Sengun dished out five assists and Jae’Sean Tate had 12 points and six rebounds. The Rockets were called for four technical fouls, two by D.J. Augustin, and shot 5 of 29 on 3-pointers."}
{"game_id": "0022100417", "chunk_id": "0022100417_016", "order": 16, "role": "body", "text": "“That team was bigger, taller and a lot hungrier than we were,” Lucas said."}
{"game_id": "0022100417", "chunk_id": "0022100417_018", "order": 18, "role": "body", "text": "Rockets: G Jalen Green (left hamstring strain), F Danuel House Jr. (left ankle sprain) and G Kevin Porter Jr. (left thigh bruise) also were out. Silas said Green is the closest to returning, followed by House. Green has missed 10 games, while House has been sidelined for five. … Porter spent his rookie season with Cleveland, but was released in 2020 after a series of disciplinary issues, including an arrest in Eastern Ohio."}
{"game_id": "0022100417", "chunk_id": "0022100417_019", "order": 19, "role": "body", "text": "Cavaliers: Garland is one of three players averaging 18.0 points and 7.0 assists while shooting better than 46%. Lakers F LeBron James and Nuggets C Nikola Jokic are the others. … C Tacko Fall and G RJ Nembhard, both on two-way contracts, are on G League assignments with the Cleveland Charge. … Cleveland has a .356 all-time winning percentage against Houston, its second-worst behind San Antonio (.343)."}
{"game_id": "0022100417", "chunk_id": "0022100417_021", "order": 21, "role": "body", "text": "Rockets: Host New York on Thursday night."}
{"game_id": "0022100417", "chunk_id": "0022100417_022", "order": 22, "role": "body", "text": "Cavaliers: Visit NBA champion Milwaukee on Saturday night."}
