{"game_id": "0022100274", "chunk_id": "0022100274_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Anthony Edwards and the surging Minnesota Timberwolves treated their most energetic home crowd of the season to a cohesive and resolute performance."}
{"game_id": "0022100274", "chunk_id": "0022100274_002", "order": 2, "role": "body", "text": "The more intensity the better for Minnesota's precocious guard."}
{"game_id": "0022100274", "chunk_id": "0022100274_003", "order": 3, "role": "body", "text": "Edwards had 33 points and 14 rebounds, and the Timberwolves beat Jimmy Butler and the Miami Heat 113-101 on Wednesday for their fifth straight victory."}
{"game_id": "0022100274", "chunk_id": "0022100274_004", "order": 4, "role": "body", "text": "“It was a great night. Our guys were amped up to play for all the obvious reasons — good team, personal battles, big crowd,\" coach Chris Finch said."}
{"game_id": "0022100274", "chunk_id": "0022100274_005", "order": 5, "role": "body", "text": "Malik Beasley scored a season-high 29 points off the bench and D'Angelo Russell added 20 for the Timberwolves, who launched a franchise-record 55 attempts from behind the arc and made 18. Edwards (six), Beasley (five) and Russell (four) did the most damage."}
{"game_id": "0022100274", "chunk_id": "0022100274_006", "order": 6, "role": "body", "text": "The Wolves, who closed the game on an 11-2 run, went 11 for 27 from 3-point range after halftime as Edwards added yet another highlight to his budding career."}
{"game_id": "0022100274", "chunk_id": "0022100274_007", "order": 7, "role": "body", "text": "“He took over the game. Simple as that,” Russell said. “He was guarding, he was moving, he was boxing, he was rebounding. I think we’re watching him grow in front of us, just all around.”"}
{"game_id": "0022100274", "chunk_id": "0022100274_008", "order": 8, "role": "body", "text": "All of Minnesota's wins on the streak have come by 10 points or more, the third such five-game run in franchise history. This is the longest winning streak for the Wolves in four years."}
{"game_id": "0022100274", "chunk_id": "0022100274_009", "order": 9, "role": "body", "text": "Bam Adebayo led the Heat with 18 points, and Butler had a quiet 16 points, eight rebounds and five assists against his former team while being booed often. Duncan Robinson added 17 points and super sub Tyler Herro had 16 points on 5-for-18 shooting after scoring 31 points the night before in a win at Detroit."}
{"game_id": "0022100274", "chunk_id": "0022100274_010", "order": 10, "role": "body", "text": "“When we’re at home, we play lights out. It’s electric. We’re having fun,” Adebayo said. “But when we’re on the road, it’s like sluggish.”"}
{"game_id": "0022100274", "chunk_id": "0022100274_011", "order": 11, "role": "body", "text": "Karl-Anthony Towns had first-quarter foul trouble and finished with 11 points and six rebounds. Jarred Vanderbilt picked up the slack inside with a career-high 15 rebounds to go with eight points and Edwards more than handled the alpha role."}
{"game_id": "0022100274", "chunk_id": "0022100274_012", "order": 12, "role": "body", "text": "“I was just trying to stay as close as possible until big fella came back,” Edwards said."}
{"game_id": "0022100274", "chunk_id": "0022100274_013", "order": 13, "role": "body", "text": "Edwards thrives in higher-intensity games like these, and he was the driving force in the second-half surge by the Wolves. His one-handed dunk off a backdoor cut posterized Gabe Vincent  early in the fourth quarter, only to have it wiped out by an offensive foul."}
{"game_id": "0022100274", "chunk_id": "0022100274_014", "order": 14, "role": "body", "text": "“The zebras, man. I don’t know. If I’m refereeing that game and you dunk on someone like that, I’m not calling a charge. And you're at home? I’m not calling a charge,” Edwards said."}
{"game_id": "0022100274", "chunk_id": "0022100274_015", "order": 15, "role": "body", "text": "The Heat immediately went on a 7-0 run to take back the lead, but Russell put the Wolves back in front for good at 91-89 with a 3-pointer at the 9-minute mark."}
{"game_id": "0022100274", "chunk_id": "0022100274_016", "order": 16, "role": "body", "text": "“They were throwing us to the ground, doing whatever they wanted, and we couldn’t do it back. Plain and simple, just like it looked,\" Vincent said."}
{"game_id": "0022100274", "chunk_id": "0022100274_018", "order": 18, "role": "body", "text": "Butler was the one trying to lock Edwards down on defense. He swiped the ball out of Edwards’ arms after a whistle at one point. Edwards reacted by pushing Butler in the back. Then Butler whirled around and got in Edwards’ face, before they were separated."}
{"game_id": "0022100274", "chunk_id": "0022100274_019", "order": 19, "role": "body", "text": "Butler and Towns didn’t exactly mesh well here, with the fiery Butler requesting a trade after only one year and playing 10 awkward games in his second season before being dealt to Philadelphia."}
{"game_id": "0022100274", "chunk_id": "0022100274_020", "order": 20, "role": "body", "text": "They did make the playoffs together in 2018, though, the only such appearance for the woebegone Wolves in the last 17 years."}
{"game_id": "0022100274", "chunk_id": "0022100274_021", "order": 21, "role": "body", "text": "The Wolves have a prime opportunity to return to the postseason with this team, particularly with two extra spots in the new play-in format, but their worthiness will get a stiff test over the holidays. Starting with Miami, only three of their next 20 opponents had a losing record entering Wednesday. They play the Los Angeles Lakers in two of those three games against under-the-.500-mark foes, on Dec. 17 and Jan. 2. Indiana is the only one currently below the cut for the playoffs."}
{"game_id": "0022100274", "chunk_id": "0022100274_023", "order": 23, "role": "body", "text": "Towns watched all but five minutes of the first half from the bench after drawing three fouls, and the Wolves were down two starters by midway through the first quarter when Patrick Beverley hurt his left groin and did not return."}
{"game_id": "0022100274", "chunk_id": "0022100274_024", "order": 24, "role": "body", "text": "The Wolves were frustrated by some of the calls, and Towns at one point waved his arms to encourage the crowd during a derogatory chant toward the officials. The whistles went the other way, too, as Kyle Lowry picked up his fourth and fifth fouls 15 seconds apart early in the third quarter followed by a technical for mouthing off about the last one."}
{"game_id": "0022100274", "chunk_id": "0022100274_026", "order": 26, "role": "body", "text": "Heat: Adebayo, who was shooting a career-best 82.1% from the free throw line entering the game, went 4 for 11. ... Robinson went 5 for 15 from 3-point range, extending his franchise-record streak to 67 straight games with at least one make from deep."}
{"game_id": "0022100274", "chunk_id": "0022100274_027", "order": 27, "role": "body", "text": "Timberwolves: Edwards had four 30-plus-point games as a rookie and one earlier this season, his career-best 48 points at Golden State on Nov. 10. ... Vanderbilt had his fourth straight double-digit rebound game."}
{"game_id": "0022100274", "chunk_id": "0022100274_030", "order": 30, "role": "body", "text": "Timberwolves: at Charlotte on Friday."}
