{"game_id": "0022100993", "chunk_id": "0022100993_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — The 76ers fans came to boo Ben Simmons. They left booing their own team."}
{"game_id": "0022100993", "chunk_id": "0022100993_002", "order": 2, "role": "body", "text": "Kevin Durant scored 18 of his 25 points in Brooklyn’s dominating first half in the Nets’ 129-100 blowout victory over the 76ers on Thursday night in Simmons’ much-hyped return to Philadelphia."}
{"game_id": "0022100993", "chunk_id": "0022100993_003", "order": 3, "role": "body", "text": "Seth Curry added 24 points, and Kyrie Irving had 22 for the Nets. They entered in eighth place in the East, but looked like a legitimate conference contender while badly outplaying the third-place 76ers."}
{"game_id": "0022100993", "chunk_id": "0022100993_004", "order": 4, "role": "body", "text": "Joel Embiid had 27 points and 12 rebounds for the 76ers, and James Harden finished with just 11 points. It was the first loss for Philadelphia in six games with Harden in the lineup."}
{"game_id": "0022100993", "chunk_id": "0022100993_005", "order": 5, "role": "body", "text": "The game was dubbed as “Boo Ben” night, but the raucous fans instead turned their displeasure on the home team when the 76ers went to the locker room trailing 72-51 and again when Brooklyn built a stunning 32-point lead in the third quarter."}
{"game_id": "0022100993", "chunk_id": "0022100993_006", "order": 6, "role": "body", "text": "“I think all of us look at Ben as our brother,” Durant said. “We knew this was a hostile environment. It’s hard to chant at Ben Simmons when you’re losing by that much.”"}
{"game_id": "0022100993", "chunk_id": "0022100993_007", "order": 7, "role": "body", "text": "Simmons, wearing a designer hockey jersey and flashy jewelry, watched from the bench, likely taking delight in the vitriol deflected away from him. The three-time All-Star is continuing to recover from a back injury that has sidelined him since being swapped for Harden in a blockbuster deal at the trade deadline."}
{"game_id": "0022100993", "chunk_id": "0022100993_008", "order": 8, "role": "body", "text": "“We definitely felt like Ben was on our heart,” Irving said. “If you come at Ben, you come at us.”"}
{"game_id": "0022100993", "chunk_id": "0022100993_009", "order": 9, "role": "body", "text": "While Simmons hasn’t taken the floor yet, Harden had been a boon for the 76ers unlike his time in Brooklyn, where the so-called Big 3 of Harden, Durant and Irving managed to play just 16 games together following Harden’s trade to Brooklyn last January that was billed as a potentially championship move. Harden exchanged fist bumps with Nets staff members just before tip before a shockingly poor performance from the 10-time All-Star and former MVP."}
{"game_id": "0022100993", "chunk_id": "0022100993_010", "order": 10, "role": "body", "text": "Harden missed 14 of 17 field-goal attempts."}
{"game_id": "0022100993", "chunk_id": "0022100993_011", "order": 11, "role": "body", "text": "“We just didn’t have the pop that we needed,” Harden said."}
{"game_id": "0022100993", "chunk_id": "0022100993_012", "order": 12, "role": "body", "text": "The only shot Simmons took was a dunk during pregame warmups that drew derisive cheers from the Philly fans."}
{"game_id": "0022100993", "chunk_id": "0022100993_013", "order": 13, "role": "body", "text": "The boos started early, as Simmons was met with catcalls while boarding the team bus to shootaround from the Nets’ downtown hotel. Simmons did oblige one fan for an autograph, with another being heard on a video widely circulated on social media yelling, “Why the grievance? Why spit in the face of Sixers fans? We did nothing but support you for five years, Ben. You know that.”"}
{"game_id": "0022100993", "chunk_id": "0022100993_014", "order": 14, "role": "body", "text": "The heckling continued when Simmons was at the arena. He entered the court 55 minutes prior to tip, wearing a sleeveless Nets warmup shirt and sweats and spent 20 minutes passing for Patty Mills’ warmup shots. He didn’t embrace any of his former teammates, though he did walk the length of the court to hug a 76ers official and then exchanged fist pumps with coach Doc Rivers at halftime."}
{"game_id": "0022100993", "chunk_id": "0022100993_015", "order": 15, "role": "body", "text": "“Looked good to me, looked happy to be here,” Nets coach Steve Nash said. “I think he was happy to get it out of the way.”"}
{"game_id": "0022100993", "chunk_id": "0022100993_016", "order": 16, "role": "body", "text": "A large security presence closely watched the crowd and cell phones captured every Simmons move. By the end of the game, though, many 76ers fans had left and the remaining Nets fans were chanting: “BEN SIM-MONS! BEN SIM-MONS!” in a remarkable turnaround from the start of the evening."}
{"game_id": "0022100993", "chunk_id": "0022100993_018", "order": 18, "role": "body", "text": "Former 76ers Curry and Andre Drummond, who also were part of the Simmons for Harden trade, were cheered during introductions, Curry made 10 of 14 shots, including 4 of 8 from 3-point range. Drummond had seven points and seven rebounds."}
{"game_id": "0022100993", "chunk_id": "0022100993_020", "order": 20, "role": "body", "text": "Harden passed Reggie Miller for third on the NBA’s 3-point list when he made his 2,561st trey with 6:47 left in the first quarter."}
{"game_id": "0022100993", "chunk_id": "0022100993_022", "order": 22, "role": "body", "text": "Nets: LaMarcus Aldridge (hip) missed his second straight contest."}
{"game_id": "0022100993", "chunk_id": "0022100993_023", "order": 23, "role": "body", "text": "76ers: Danny Green sat out after injuring his left middle finger in the first half of the 76ers’ 121-106 win over the Bulls on Monday."}
{"game_id": "0022100993", "chunk_id": "0022100993_025", "order": 25, "role": "body", "text": "Nets: Improved to 21-15 on the road, where Irving is only allowed to play due to his vaccination status. ... Durant also had 14 rebounds and seven assists."}
{"game_id": "0022100993", "chunk_id": "0022100993_026", "order": 26, "role": "body", "text": "76ers: Paul Millsap returned after missing Monday’s game against Chicago due to personal reasons but didn’t play. … Former Sixers and Hall of Famers Allen Iverson and Julus “Dr. J” Erving were in attendance. Erving rang the ceremonial Liberty Bell before the contest."}
{"game_id": "0022100993", "chunk_id": "0022100993_028", "order": 28, "role": "body", "text": "Nets: Host New York on Sunday."}
