{"game_id": "0022100628", "chunk_id": "0022100628_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Desmond Bane scored 21 points, Jaren Jackson Jr. added 20 and the Memphis Grizzlies pulled away in the final minutes for their 11th straight victory, beating the Minnesota Timberwolves 116-108 on Thursday night."}
{"game_id": "0022100628", "chunk_id": "0022100628_002", "order": 2, "role": "body", "text": "Ja Morant had 16 points, nine assists and eight rebounds, and John Konchar added 15 points and a career-best 17 rebounds."}
{"game_id": "0022100628", "chunk_id": "0022100628_003", "order": 3, "role": "body", "text": "Anthony Edwards led the Timberwolves with 30 points. D’Angelo Russell had 29 points and six assists, and Karl-Anthony Towns added 25 points and nine rebounds."}
{"game_id": "0022100628", "chunk_id": "0022100628_004", "order": 4, "role": "body", "text": "The game was much different than the last time the teams played when the Timberwolves won 138-95 on Nov. 20, Memphis’ largest losing margin of the season. In this one, neither team held a double-digit advantage until the Grizzlies led by 10 in the closing seconds."}
{"game_id": "0022100628", "chunk_id": "0022100628_005", "order": 5, "role": "body", "text": "“It’s all about attention to details,” Minnesota coach Chris Finch said. “It’s all about the small things. It’s all about the winning plays. … You’re going to be in close games, and that’s going to win you games, and that, right now, is not what we’re doing.”"}
{"game_id": "0022100628", "chunk_id": "0022100628_006", "order": 6, "role": "body", "text": "The teams exchanged leads beginning with four minutes left. Two free throws by Brandon Clarke (14 points) with 1:47 remaining gave the Grizzlies the lead for good. Memphis extended it with a layup by Bane, and Konchar’s 3-pointer with 1:02 left stretched the lead as the Timberwolves were cursed by turnovers down the stretch."}
{"game_id": "0022100628", "chunk_id": "0022100628_007", "order": 7, "role": "body", "text": "Konchar has become a key role player, and it wasn’t just his rebounding against Minnesota. The third-year guard not only had a big night on the boards but missed only one of his seven shots and was 3 of 4 from outside the arc."}
{"game_id": "0022100628", "chunk_id": "0022100628_008", "order": 8, "role": "body", "text": "“He just does a lot on the floor for us,” Morant said, adding of Konchar’s shooting “You really can’t leave him open. He’s just a sparkplug for us off the bench.”"}
{"game_id": "0022100628", "chunk_id": "0022100628_009", "order": 9, "role": "body", "text": "Morant also noted that Konchar’s 17 rebounds came from the guard position. “That’s pretty tough to do,” Morant said."}
{"game_id": "0022100628", "chunk_id": "0022100628_010", "order": 10, "role": "body", "text": "But Konchar couldn’t explain how he grabs so many rebounds other than long shots like the 3s taken by Minnesota lead to long rebounds. “I don’t really got much for you on that one,” Konchar said when pressed further about his rebounding. “The ball just kind of ends up in my hands.”"}
{"game_id": "0022100628", "chunk_id": "0022100628_011", "order": 11, "role": "body", "text": "Memphis, which struggled in the first half and trailed 60-53 at the break, got untracked in the third quarter as Morant scored 11 points. That was part of the Grizzlies outscoring Minnesota 37-24. That gave Memphis its biggest lead of the game at that point headed into the fourth 90-84."}
{"game_id": "0022100628", "chunk_id": "0022100628_012", "order": 12, "role": "body", "text": "For the Timberwolves it was the second straight time they let a game slip away. They lost 128-125 on Tuesday to New Orleans when Brandon Ingram hit a 3-pointer with 1.3 seconds remaining."}
{"game_id": "0022100628", "chunk_id": "0022100628_013", "order": 13, "role": "body", "text": "“We don’t have time to take Ls that we should have won. Tonight, I definitely feel we should have won this game, and, especially New Orleans,” Edwards said, adding: “These games hurt when you don’t have everything right and you come down to the very end and you can’t get a rebound to finish a possession.”"}
{"game_id": "0022100628", "chunk_id": "0022100628_015", "order": 15, "role": "body", "text": "Memphis’ winning streak includes wins over some of the best teams in the league, but the memories of a 43-point loss to Minnesota on Nov. 20 was enough for interim coach Darko Rajakovic to put aside any question of letdown against the imberwolves. “The last time we played this team, they really punked us,” said Rajakovic, who was filling in for head coach Taylor Jenkins who is still in health and safety protocols."}
{"game_id": "0022100628", "chunk_id": "0022100628_017", "order": 17, "role": "body", "text": "Konchar, who can be low-key in his answers, made a rather obvious observation about Morant when asked what makes the Grizzlies good in these situations. “He’s really good at basketball, if you didn’t know that,” Konchar said."}
{"game_id": "0022100628", "chunk_id": "0022100628_019", "order": 19, "role": "body", "text": "Timberwolves: Either Towns or Edwards has led Minnesota in scoring in 31 of the team’s 42 games. … Minnesota is 2-16 when trailing after three quarters. … Jarred Vanderbilt had 13 rebounds."}
{"game_id": "0022100628", "chunk_id": "0022100628_020", "order": 20, "role": "body", "text": "Grizzlies: F Killian Tillie was added to the health and safety protocols Thursday afternoon and did not play. … C Steven Adams missed his fourth game under health and safety protocols. … Konchar had 10 rebounds in the first half."}
{"game_id": "0022100628", "chunk_id": "0022100628_022", "order": 22, "role": "body", "text": "Timberwolves: Host Golden State on Sunday night."}
{"game_id": "0022100628", "chunk_id": "0022100628_023", "order": 23, "role": "closing", "text": "Grizzlies: Host Dallas on Friday night."}
