{"game_id": "0022100077", "chunk_id": "0022100077_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Just a handful of games into their first NBA season as teammates, LeBron James and Carmelo Anthony sometimes already look like they've been playing together for their entire careers."}
{"game_id": "0022100077", "chunk_id": "0022100077_002", "order": 2, "role": "body", "text": "These 19-year veterans still have plenty to give to each other and to the Los Angeles Lakers, who rolled to their first comfortable win of the season behind their veteran leaders."}
{"game_id": "0022100077", "chunk_id": "0022100077_003", "order": 3, "role": "body", "text": "James scored 26 points, Anthony added 24 while hitting six 3-pointers, and the Lakers snapped the Cleveland Cavaliers' three-game winning streak with a 113-101 victory Friday night."}
{"game_id": "0022100077", "chunk_id": "0022100077_004", "order": 4, "role": "body", "text": "James and Anthony took control down the stretch of the Lakers' third win in four games, with Anthony hitting three 3-pointers to the increasingly raucous cheers of his new fans at Staples Center. James missed nine of his 10 3-point attempts, but had eight assists against his former team in his return from a two-game absence with a sore right ankle."}
{"game_id": "0022100077", "chunk_id": "0022100077_005", "order": 5, "role": "body", "text": "Anthony is \"a threat,” according to James, who improved to 16-1 in his career against the Cavaliers."}
{"game_id": "0022100077", "chunk_id": "0022100077_006", "order": 6, "role": "body", "text": "“He's a sniper,\" James added. \"One of those guys that doesn't need much air space to get it off because it's a quick trigger. He creates so much space for Russ and myself and A.D. to work our pick-and-roll magic.”"}
{"game_id": "0022100077", "chunk_id": "0022100077_007", "order": 7, "role": "body", "text": "Anthony has led the Lakers' bench in scoring in five of his six games with his new team."}
{"game_id": "0022100077", "chunk_id": "0022100077_008", "order": 8, "role": "body", "text": "Russell Westbrook had 19 points and Anthony Davis added 15 for the Lakers, who showed signs of emerging from their rocky start to the season. Their markedly improved defensive effort in the second half led to the offense's success."}
{"game_id": "0022100077", "chunk_id": "0022100077_009", "order": 9, "role": "body", "text": "“I think we’ve been doing a solid job,” Westbrook said. “Everybody on the outside looking in wants things to click immediately, but that’s not realistic. ... We’ll keep our swag up, keep our spirits high regardless of what’s happening.”"}
{"game_id": "0022100077", "chunk_id": "0022100077_010", "order": 10, "role": "body", "text": "Rookie Evan Mobley scored 23 points and Darius Garland had 18 points and 11 assists in the third stop on Cleveland's five-game road trip."}
{"game_id": "0022100077", "chunk_id": "0022100077_011", "order": 11, "role": "body", "text": "Ricky Rubio scored 18 points and Lauri Markkanen added 17, but the Cavs struggled while the Lakers pulled away in the fourth quarter, missing 12 of their first 14 shots and going nearly six minutes between field goals. Cleveland got outscored 25-16 in the fourth."}
{"game_id": "0022100077", "chunk_id": "0022100077_012", "order": 12, "role": "body", "text": "“I think this was a valuable lesson for us,” Cavs coach J.B. Bickerstaff said. “When you're playing a team of that caliber, you can't make the mistakes that we made, because they're going to take advantage of them.”"}
{"game_id": "0022100077", "chunk_id": "0022100077_013", "order": 13, "role": "body", "text": "The Cavaliers’ strong recent stretch of play ended with this effort against the Lakers. Cleveland had beaten three possible title contenders in its previous three games, going through Atlanta, Denver and the Clippers with impressive efforts from its young roster."}
{"game_id": "0022100077", "chunk_id": "0022100077_014", "order": 14, "role": "body", "text": "The Lakers' grand roster reboot continues to be eventful, but this win was their most encouraging of the young season. After adding 12 new players to its roster and then largely blowing off the preseason, Los Angeles has predictably struggled for teamwork and cohesion from its star-studded roster."}
{"game_id": "0022100077", "chunk_id": "0022100077_015", "order": 15, "role": "body", "text": "Cleveland jumped to an 11-point lead in the first half before the Lakers finally got some defensive stops led by Dwight Howard and Avery Bradley, who have emerged as their defensive lynchpins."}
{"game_id": "0022100077", "chunk_id": "0022100077_017", "order": 17, "role": "body", "text": "Cavaliers: Isaac Okoro missed his second straight game with a strained left hamstring. ... Collin Sexton went 2 for 9 and scored nine points. ... Kevin Love scored four points in 16 minutes."}
{"game_id": "0022100077", "chunk_id": "0022100077_018", "order": 18, "role": "body", "text": "Lakers: James didn't decide to play until shortly before game time. Afterward, he said his ankle felt better than it did after the game in which he injured it last Sunday. ... Wayne Ellington (left hamstring strain) was technically available, but didn't play."}
{"game_id": "0022100077", "chunk_id": "0022100077_020", "order": 20, "role": "body", "text": "Mobley's career is off to an auspicious start, and he showed why during two games back home."}
{"game_id": "0022100077", "chunk_id": "0022100077_021", "order": 21, "role": "body", "text": "Mobley went 10 for 16 and grabbed six rebounds against the Lakers in his second consecutive game about two miles up Figueroa Street from the Galen Center, where the Southern California native starred for USC last season and where his brother, Isaiah, is still playing this winter."}
{"game_id": "0022100077", "chunk_id": "0022100077_022", "order": 22, "role": "body", "text": "“It was great playing in LA,” Mobley said. “It was a great atmosphere, but I just tried to stay locked in, tried to stay focused on what I needed to do.”"}
{"game_id": "0022100077", "chunk_id": "0022100077_023", "order": 23, "role": "body", "text": "Mobley also had 12 points and 10 rebounds during Cleveland's win over the Clippers on Wednesday."}
{"game_id": "0022100077", "chunk_id": "0022100077_024", "order": 24, "role": "body", "text": "“It's so crazy, because he was just playing against my son a couple of years ago,” James said. “This gets more weird by the day. They've got a good one. Cleveland has a good one.”"}
{"game_id": "0022100077", "chunk_id": "0022100077_026", "order": 26, "role": "body", "text": "Cavaliers: At Suns on Saturday."}
{"game_id": "0022100077", "chunk_id": "0022100077_027", "order": 27, "role": "body", "text": "Lakers: Host Rockets on Sunday."}
