{"game_id": "0022100307", "chunk_id": "0022100307_001", "order": 1, "role": "lead", "text": "CHICAGO -- — Lonzo Ball has faced his brother LaMelo three times in the NBA, winning twice. That's the only thing that matters to him."}
{"game_id": "0022100307", "chunk_id": "0022100307_002", "order": 2, "role": "body", "text": "“I play to win. I'm still the big brother at the end of the day,\" Lonzo Ball said, “and I got to stack my wins.”"}
{"game_id": "0022100307", "chunk_id": "0022100307_003", "order": 3, "role": "body", "text": "The Chicago Bulls took the latest battle of the Ball brothers, riding a stellar performance by Nikola Vucevic to a 133-119 victory over the Charlotte Hornets on Monday night."}
{"game_id": "0022100307", "chunk_id": "0022100307_004", "order": 4, "role": "body", "text": "Chicago shot a season-high 59.6% from the field and had five players score in double figures. Vucevic had a season-best 30 points and grabbed 14 rebounds. DeMar DeRozan scored 28 points, and Zach LaVine, a game-time decision because of an illness, finished with 25."}
{"game_id": "0022100307", "chunk_id": "0022100307_005", "order": 5, "role": "body", "text": "With patriarch LaVar Ball watching and wearing a black hat that read “I Told You So,” Lonzo Ball helped the Bulls get back on track after dropping three of four. He had 16 points and eight assists, and LaMelo Ball had 18 points and 13 assists."}
{"game_id": "0022100307", "chunk_id": "0022100307_006", "order": 6, "role": "body", "text": "“I mean we've been talking about the NBA since we were little boys,” LaMelo said. “Just going out there and playing against him, always a dream come true, for real.”"}
{"game_id": "0022100307", "chunk_id": "0022100307_007", "order": 7, "role": "body", "text": "The United Center crowd of 21,366 roared every time the Ball brothers matched up early on. But there was little sign from Lonzo or LaMelo that they were guarding someone they'd guarded since they were kids."}
{"game_id": "0022100307", "chunk_id": "0022100307_008", "order": 8, "role": "body", "text": "“Obviously we are brothers and it's all love off the court,\" Lonzo Ball said. “But on the court, like I said, he got a job he got to do, I got a job I got to do.”"}
{"game_id": "0022100307", "chunk_id": "0022100307_009", "order": 9, "role": "body", "text": "Terry Rozier scored 31 points and Gordon Hayward had 22 for the Hornets, who dropped to 0-2 on their four-game trip."}
{"game_id": "0022100307", "chunk_id": "0022100307_010", "order": 10, "role": "body", "text": "“Disappointed tonight in our defense,” Charlotte coach James Borrego said. “We just got to correct it.”"}
{"game_id": "0022100307", "chunk_id": "0022100307_011", "order": 11, "role": "body", "text": "Charlotte trimmed a 23-point deficit down to four on Hayward's cutting layup with 7:31 left, but Chicago responded with a 9-0 run."}
{"game_id": "0022100307", "chunk_id": "0022100307_012", "order": 12, "role": "body", "text": "Vucevic sparked the decisive stretch with a layup. The 6-foot-10 center also went 6 for 6 from 3-point range in his highest scoring game of the season — rounding into form after struggling in his return from COVID-19."}
{"game_id": "0022100307", "chunk_id": "0022100307_013", "order": 13, "role": "body", "text": "He averaged 12.3 points on 42% shooting in his previous three games."}
{"game_id": "0022100307", "chunk_id": "0022100307_014", "order": 14, "role": "body", "text": "“I felt like I was getting my rhythm, and then I got COVID and then I had to sit out,” Vucevic said. “But obviously tonight was a good game for me. Felt great to make some shots.”"}
{"game_id": "0022100307", "chunk_id": "0022100307_015", "order": 15, "role": "body", "text": "The Ball brothers were hampered by foul trouble in the second quarter. But Lonzo Ball got the better of his brother with 5:06 left, blocking his shot at the rim, which led to a running slam by Javonte Green at the other end."}
{"game_id": "0022100307", "chunk_id": "0022100307_016", "order": 16, "role": "body", "text": "The Bulls closed the half with a 9-0 run for a 69-58 lead at the break. LaVine found Vucevic for a 3-pointer from the side at the buzzer."}
{"game_id": "0022100307", "chunk_id": "0022100307_018", "order": 18, "role": "body", "text": "Hornets: Reserve forward Cody Martin was sidelined by an illness. ... C Mason Plumlee missed his third straight game with a right calf strain."}
{"game_id": "0022100307", "chunk_id": "0022100307_019", "order": 19, "role": "body", "text": "Bulls: F Patrick Williams (left wrist) has talked about taking some classes at Florida State to work toward his degree, coach Billy Donovan said. “I think things like that are important, but when he's been around our team, I think he's been in good spirits,” Donovan said. Williams, 20, got hurt during a loss to the Knicks on Oct. 28 and is expected to be sidelined for four to six months. ... The Bulls swept their three-game series against the Hornets last season."}
{"game_id": "0022100307", "chunk_id": "0022100307_021", "order": 21, "role": "body", "text": "Hornets: At the Milwaukee Bucks on Wednesday night. It's the first meeting for the teams this season."}
{"game_id": "0022100307", "chunk_id": "0022100307_022", "order": 22, "role": "body", "text": "Bulls: At the New York Knicks on Thursday night. The teams split their first two meetings, both in Chicago."}
{"game_id": "0022100307", "chunk_id": "0022100307_024", "order": 24, "role": "body", "text": "Jay Cohen can be reached at https://twitter.com/jcohenap"}
