{"game_id": "0022100063", "chunk_id": "0022100063_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — With a productive third quarter, Damian Lillard began to find a groove again."}
{"game_id": "0022100063", "chunk_id": "0022100063_002", "order": 2, "role": "body", "text": "Lillard, who has struggled to open the season, had 20 points and 10 assists in Portland's 116-96 victory over the Memphis Grizzlies on Wednesday night."}
{"game_id": "0022100063", "chunk_id": "0022100063_003", "order": 3, "role": "body", "text": "Eleven of those points came in the third quarter, when the Trail Blazers outscored Memphis 36-20. It still wasn't his best shooting night, but Lillard said things started to fall into place."}
{"game_id": "0022100063", "chunk_id": "0022100063_004", "order": 4, "role": "body", "text": "“You just want to see the ball go in. When you're missing shots, rattling in and out, and the ball is rolling off the rim, I think the easy thing to do is be like `I don't have it going,' and just go away from it and keep passing it,” he said. “But when you're in a stretch like I am shooting the ball, I think it's important to jump into it, to get more aggressive and get yourself out of it.”"}
{"game_id": "0022100063", "chunk_id": "0022100063_005", "order": 5, "role": "body", "text": "CJ McCollum led the Blazers with 25 points and Anfernee Simons added 17 points off the bench."}
{"game_id": "0022100063", "chunk_id": "0022100063_006", "order": 6, "role": "body", "text": "Desmond Bane had 19 points for the Grizzlies, who trailed by as many as 26 points in their second straight loss."}
{"game_id": "0022100063", "chunk_id": "0022100063_007", "order": 7, "role": "body", "text": "Portland held Ja Morant to a season-low 17 points. Morant had averaged 35 points and eight assists through the Grizzlies' first three games this season."}
{"game_id": "0022100063", "chunk_id": "0022100063_008", "order": 8, "role": "body", "text": "“I feel like we let our offensive struggles affect us on the other end of the floor,\" Morant said. \"It was missing assignments, really wasn’t locked into the game plan too much. We just let mistakes turn into more mistakes and they got hot and won the game. ”"}
{"game_id": "0022100063", "chunk_id": "0022100063_009", "order": 9, "role": "body", "text": "The Blazers were looking to rebound after a 116-86 loss at the Clippers on Monday night, which new Portland coach Chauncey Billups said was “embarrassing.”"}
{"game_id": "0022100063", "chunk_id": "0022100063_010", "order": 10, "role": "body", "text": "Lillard had scoring just 17 points per game through the first three games after averaging more than 28 points last season. He'd made just two of 24 attempts from 3-point range. Lillard was 4 for 11 Wednesday."}
{"game_id": "0022100063", "chunk_id": "0022100063_011", "order": 11, "role": "body", "text": "Billups said he isn't concerned about his All-Star guard, complimenting his floor game and his defense."}
{"game_id": "0022100063", "chunk_id": "0022100063_012", "order": 12, "role": "body", "text": "“I just feel he’s getting really good looks that we’re accustomed to seeing him make,” said Billups, who sat his starters with just over five minutes left and the Blazers up 107-81."}
{"game_id": "0022100063", "chunk_id": "0022100063_013", "order": 13, "role": "body", "text": "It was the third of a four-game road trip for Memphis, which was coming off a 121-118 loss at the Lakers on Sunday. Morant had 40 points and 10 assists in the loss."}
{"game_id": "0022100063", "chunk_id": "0022100063_014", "order": 14, "role": "body", "text": "Morant was scoreless against the Blazers until 5:44 left in the second quarter, when he hit a 3-pointer. He finished with 10 assists and nine rebounds. He also had a career-high nine turnovers."}
{"game_id": "0022100063", "chunk_id": "0022100063_015", "order": 15, "role": "body", "text": "The Grizzlies led by as many as eight points in the opening half. McCollum's jumper closed the gap to 57-51 going into halftime."}
{"game_id": "0022100063", "chunk_id": "0022100063_016", "order": 16, "role": "body", "text": "The Blazers rallied in the third, pulling ahead 68-62 on McCollum's jumper. Simons' 3-pointer capped an 18-3 run to give Portland a 76-68 lead."}
{"game_id": "0022100063", "chunk_id": "0022100063_017", "order": 17, "role": "body", "text": "“No team has ever won the championship through four games, so sitting at 2-2 puts us in a good position to build on it,” Portland's Larry Nance Jr. said. “I'm just glad we bounced back from the stinker in L.A.”"}
{"game_id": "0022100063", "chunk_id": "0022100063_018", "order": 18, "role": "body", "text": "It was the first of four games between the teams this season."}
{"game_id": "0022100063", "chunk_id": "0022100063_020", "order": 20, "role": "body", "text": "Grizzlies: Memphis went 2-1 against the Blazers last season. ... Guard Dillon Brooks, who played at the University of Oregon, remains out with a fracture in his left hand. ... Bane led all players at the break with 15 points."}
{"game_id": "0022100063", "chunk_id": "0022100063_021", "order": 21, "role": "body", "text": "Trail Blazers: After 30 turnovers against the Clippers, most of any team since 2004, the Blazers had 13 against Memphis. ... McCollum moved past Jerome Kersey for sixth on the Blazers' career scoring list."}
{"game_id": "0022100063", "chunk_id": "0022100063_023", "order": 23, "role": "body", "text": "Grizzlies: Conclude their road trip on Thursday night at Golden State."}
{"game_id": "0022100063", "chunk_id": "0022100063_024", "order": 24, "role": "body", "text": "Trail Blazers: Host the Clippers on Friday night."}
