{"game_id": "0022100822", "chunk_id": "0022100822_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Giannis Antetokounmpo scored 44 points on 17-for-20 shooting, and Bobby Portis had 23 points with five 3-pointers in the Milwaukee Bucks' 131-116 victory over the Los Angeles Lakers on Tuesday night."}
{"game_id": "0022100822", "chunk_id": "0022100822_002", "order": 2, "role": "body", "text": "Khris Middleton scored all of his 21 points in the first half as the defending NBA champions won their fourth straight overall and swept back-to-back games against LA's two teams."}
{"game_id": "0022100822", "chunk_id": "0022100822_003", "order": 3, "role": "body", "text": "Antetokounmpo was largely unguardable in the two-time MVP's highest-scoring performance since Nov. 17, getting 14 rebounds and eight assists while making his first 11 shots."}
{"game_id": "0022100822", "chunk_id": "0022100822_004", "order": 4, "role": "body", "text": "“He made it look easy, honestly,” Middleton said. “That just shows the level of how he’s playing. He was knocking down his jump shot. He’s got guys going for his pump fake. Just the way he let the game come to him and stay patient, it was pretty fun to watch.”"}
{"game_id": "0022100822", "chunk_id": "0022100822_005", "order": 5, "role": "body", "text": "Milwaukee jumped to a 24-point lead in the first half with 70% shooting and led by 30 midway through the third quarter before surviving the Lakers' strong late rally. The Bucks hung on for their third win on a four-game West Coast road trip that ends with an NBA Finals rematch in Phoenix on Thursday."}
{"game_id": "0022100822", "chunk_id": "0022100822_006", "order": 6, "role": "body", "text": "“Obviously when you make shots, the game is a lot easier, looks a lot better,” Antetokounmpo said. “I know I’m going to try to get my teammates involved and look for the best way to help the team, but sometimes when you start making shots, you feel better about yourself, you defend better. Today was one of those games.”"}
{"game_id": "0022100822", "chunk_id": "0022100822_007", "order": 7, "role": "body", "text": "LeBron James scored 27 points and Anthony Davis had 22 points and nine rebounds for the Lakers, who couldn't catch up to the champs even on a rare night with both superstars in their injury-riddled lineup. LA has lost five of seven to fall back to three games below .500."}
{"game_id": "0022100822", "chunk_id": "0022100822_008", "order": 8, "role": "body", "text": "“We played a terrible defensive half,” Lakers coach Frank Vogel said. “Disposition, competition, the level of competitive spirit we showed for a big game was very disappointing. Two straight games we started with a terrible defensive half. We’ve got to get that right.”"}
{"game_id": "0022100822", "chunk_id": "0022100822_009", "order": 9, "role": "body", "text": "The Lakers rallied impressively in the fourth quarter, trimming Milwaukee's lead to 10 points midway through the period with a 20-5 run. Portis' fifth 3-pointer stopped the surge, and the Lakers never got closer than 11 again."}
{"game_id": "0022100822", "chunk_id": "0022100822_010", "order": 10, "role": "body", "text": "Los Angeles dropped to 10-8 with both James and Davis in their lineup during a season totally lacking in continuity due to lengthy absences for its two cornerstones. James looked tired at times in just his second game back from a five-game absence for the Lakers, who haven't won back-to-back games since Jan. 7."}
{"game_id": "0022100822", "chunk_id": "0022100822_011", "order": 11, "role": "body", "text": "Malik Monk scored 20 points and Stanley Johnson added a season-high 16 for the Lakers in a reserve role."}
{"game_id": "0022100822", "chunk_id": "0022100822_012", "order": 12, "role": "body", "text": "After giving up 42 points to the Knicks in the first quarter on Saturday night, the Lakers allowed 38 to the Bucks in the opening period. Milwaukee took a 51-28 lead in the second by scoring seven points on one trip down the floor with a pair of 3-pointers sandwiching a flagrant foul."}
{"game_id": "0022100822", "chunk_id": "0022100822_013", "order": 13, "role": "body", "text": "The Bucks hit 70% of their shots until late in the first half and led 78-56 at halftime. Antetokounmpo finally missed a shot with 2:19 left in the third quarter, and he also got a rare technical in the third for arguing a foul called against him."}
{"game_id": "0022100822", "chunk_id": "0022100822_015", "order": 15, "role": "body", "text": "Bucks: Grayson Allen scored 12 points in his return from a one-game absence with right hip soreness. ... Veteran C Greg Monroe played 15 scoreless minutes in his third appearance in four days since joining Milwaukee on a 10-day contract last Saturday."}
{"game_id": "0022100822", "chunk_id": "0022100822_016", "order": 16, "role": "body", "text": "Lakers: Dwight Howard sat out with lower back tightness for the second straight game. ... Carmelo Anthony missed his second straight game with a right hamstring strain. ... James got a technical foul in the final minute of the first half for demanding a foul after throwing down a reverse dunk on Antetokounmpo. ... 49ers star Deebo Samuel, the Raiders' Darren Waller and Tampa Bay receiver Mike Evans watched the game from courtside."}
{"game_id": "0022100822", "chunk_id": "0022100822_018", "order": 18, "role": "body", "text": "Russell Westbrook had 10 points on 3-of-11 shooting, 10 assists and four turnovers in another rough game for the Lakers' former MVP. He was taken out with 2:34 left in the third quarter and didn't play in the fourth while the Lakers made their comeback."}
{"game_id": "0022100822", "chunk_id": "0022100822_019", "order": 19, "role": "body", "text": "Westbrook said he was disappointed he couldn't play in the final period, and he was seen consoling James and Davis on the bench after the rally fell short. Westbrook deferred to Vogel's decision, but said he feels he has “earned the right” to close games."}
{"game_id": "0022100822", "chunk_id": "0022100822_020", "order": 20, "role": "body", "text": "Westbrook got light booing in spots from the home crowd, particularly when he missed an 11-foot jumper in the first half and committed two turnovers in 12 seconds in the second half."}
{"game_id": "0022100822", "chunk_id": "0022100822_021", "order": 21, "role": "body", "text": "Westbrook called the boos “a sign of respect” and later said basketball wasn't \"the end-all, be-all... Whatever comes, cheers, boos, it doesn’t really matter.”"}
{"game_id": "0022100822", "chunk_id": "0022100822_024", "order": 24, "role": "body", "text": "Lakers: At Trail Blazers on Wednesday."}
