{"game_id": "0022100962", "chunk_id": "0022100962_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — The Cavaliers couldn't even celebrate a signature win. They've got another significant injury to overcome."}
{"game_id": "0022100962", "chunk_id": "0022100962_002", "order": 2, "role": "body", "text": "All-Star center Jarrett Allen reportedly suffered a fractured finger during the first quarter of Sunday's 104-96 win over the Toronto Raptors, a potentially damaging blow to Cleveland's playoff hopes."}
{"game_id": "0022100962", "chunk_id": "0022100962_003", "order": 3, "role": "body", "text": "Following the game, The Athletic, citing unnamed sources, said Allen broke his finger and will be sidelined indefinitely. The report did not specify which finger or hand."}
{"game_id": "0022100962", "chunk_id": "0022100962_004", "order": 4, "role": "body", "text": "The Cavs only said Allen had suffered a bruised quadriceps and said nothing about a finger injury following the game. Allen had six points and two rebounds in 10 minutes."}
{"game_id": "0022100962", "chunk_id": "0022100962_005", "order": 5, "role": "body", "text": "Coach J.B. Bickerstaff said he had not spoken to the training staff and did not provide any update on Allen, who has developed into one of the NBA's best young centers in his second season with Cleveland."}
{"game_id": "0022100962", "chunk_id": "0022100962_006", "order": 6, "role": "body", "text": "The Cavs have been ravaged by injuries for months, losing leading scorer Collin Sexton and veteran guard Ricky Rubio to season-ending knee injuries. All-Star guard Darius Garland has been dealing with a back bruise, and the Cavs are still without guards Rajon Rondo and Caris LeVert."}
{"game_id": "0022100962", "chunk_id": "0022100962_007", "order": 7, "role": "body", "text": "The news on Allen is a tough blow for a team trying to make the playoffs for the first time since 2018. Without the 7-footer, rookie Evan Mobley will be asked to do even more, and the Cavs will be faced with yet another challenge."}
{"game_id": "0022100962", "chunk_id": "0022100962_008", "order": 8, "role": "body", "text": "“I'll have to play more big and Kevin Love will play my position,” Mobley said. “It will just shift down the line. We still got three bigs — me, K-Love and Lauri (Markkanen). We're still a very big team and we can play a similar way.”"}
{"game_id": "0022100962", "chunk_id": "0022100962_009", "order": 9, "role": "body", "text": "Mobley had 20 points and 17 rebounds, Lauri Markkanen scored 22 as the Cavaliers widened their lead on Toronto in the Eastern Conference standings with just their second win in eight games."}
{"game_id": "0022100962", "chunk_id": "0022100962_010", "order": 10, "role": "body", "text": "Darius Garland had 17 points and 10 assists, Cedi Osman added 17 points and Kevin Love 15 as Cleveland improved to 3-0 against Toronto."}
{"game_id": "0022100962", "chunk_id": "0022100962_011", "order": 11, "role": "body", "text": "Pascal Siakam scored 24 points and Chris Boucher 21 for the Raptors, who opened a six-game road trip without All-Star guard Fred VanVleet (knee soreness) or forward OG Anunoby (fractured finger)."}
{"game_id": "0022100962", "chunk_id": "0022100962_012", "order": 12, "role": "body", "text": "Down 18 in the fourth, the Raptors closed within 100-95, but Garland made two free throws and Osman's steal with 56 seconds left helped seal it for the Cavs."}
{"game_id": "0022100962", "chunk_id": "0022100962_013", "order": 13, "role": "body", "text": "“We came in and knew what was at stake. So did they,\" Boucher said. \"That’s two good teams that were out there. Kudos to them. We would have liked to have the win, but those were two good teams playing.”"}
{"game_id": "0022100962", "chunk_id": "0022100962_014", "order": 14, "role": "body", "text": "Injuries to VanVleet and backup Malachi Flynn led to Toronto coach Nick Nurse starting rookie Scottie Barnes at point guard. He finished with 19 points, 12 rebounds and six assists in 42 minutes."}
{"game_id": "0022100962", "chunk_id": "0022100962_015", "order": 15, "role": "body", "text": "Cleveland came in having lost six of seven, but there were encouraging signs of the young team snapping out of its recent funk in a 125-119 loss at Philadelphia on Friday. A matchup against the team directly behind them in the standings figured to be a bigger test."}
{"game_id": "0022100962", "chunk_id": "0022100962_016", "order": 16, "role": "body", "text": "“To do what we want to do, this is a moment and challenge for us,” Bickerstaff said pregame."}
{"game_id": "0022100962", "chunk_id": "0022100962_017", "order": 17, "role": "body", "text": "Cleveland led by 13 at halftime and then overcame a brutal third quarter — 16 points, 1 of 10 on 3-pointers — by opening an 82-64 lead early in the fourth. Love then hit a 3-pointer and reserve Dean Wade delivered a thunderous dunk over Toronto's Khem Birch."}
{"game_id": "0022100962", "chunk_id": "0022100962_019", "order": 19, "role": "body", "text": "Raptors: Finished 6 of 24 on 3-pointers. ... VanVleet has missed the past five games, but Nurse believes he'll be back “shortly.” Toronto is off the next two days and Nurse is optimistic the “extra couple days will get him ready to go.” ... Anunoby, averaging career highs in points (17.5), rebounds (5.5), has missed seven straight games."}
{"game_id": "0022100962", "chunk_id": "0022100962_020", "order": 20, "role": "body", "text": "Cavaliers: Markkanen added a season-high 12 rebounds. ... Rondo (sprained toe) sat out his fifth game in a row while LeVert (sprained foot) missed his sixth straight. “Both of them are taking steps in the right direction,” Bickerstaff said."}
{"game_id": "0022100962", "chunk_id": "0022100962_022", "order": 22, "role": "body", "text": "Nurse attended Duke coach Mike Krzyzewski's final game at Cameron Indoor Stadium on Saturday night as a guest of Raptors assistant Adrian Griffin, whose son, AJ, is a freshman forward for the Blue Devils."}
{"game_id": "0022100962", "chunk_id": "0022100962_023", "order": 23, "role": "body", "text": "Nurse said one of his biggest takeaways from the event was Coach K's deep connection to the school."}
{"game_id": "0022100962", "chunk_id": "0022100962_024", "order": 24, "role": "body", "text": "“It's incredible,” he said. \"The guy was there for 42 years. When I was 30, I had nine jobs already. It seems impossible that that was his vision and that was his plan and to execute it to such a level of magnificence."}
{"game_id": "0022100962", "chunk_id": "0022100962_025", "order": 25, "role": "body", "text": "\"That's what he wanted to do and to keep it all together and do it in relationship-slash-family way.\""}
{"game_id": "0022100962", "chunk_id": "0022100962_027", "order": 27, "role": "body", "text": "Raptors: At San Antonio on Wednesday."}
{"game_id": "0022100962", "chunk_id": "0022100962_028", "order": 28, "role": "body", "text": "Cavaliers: Visit Indiana on Tuesday to start a three-game road swing. Cleveland is 3-0 this season against Indiana."}
