{"game_id": "0022101180", "chunk_id": "0022101180_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Kyrie Irving scored 42 points and the Brooklyn Nets beat the Houston Rockets 118-105 on Tuesday night to improve their position in the race for play-in seeding."}
{"game_id": "0022101180", "chunk_id": "0022101180_002", "order": 2, "role": "body", "text": "Irving had 17 points in the fourth quarter to help the Nets pull away again after their 21-point lead dwindled to six."}
{"game_id": "0022101180", "chunk_id": "0022101180_003", "order": 3, "role": "body", "text": "“When the game starts to get a little out of hand or we have a big lead and let it go, then it’s time to put the foot back on the gas pedal and I have to lead by example,” Irving said."}
{"game_id": "0022101180", "chunk_id": "0022101180_004", "order": 4, "role": "body", "text": "Kevin Durant added 18 points, Bruce Brown had 15 and Cam Thomas 13 for the Nets. Andre Drummond finished with 10 points and 11 rebounds."}
{"game_id": "0022101180", "chunk_id": "0022101180_005", "order": 5, "role": "body", "text": "With Cleveland, Atlanta and Charlotte all losing, the Nets climbed into a tie for eighth place in the Eastern Conference, just 1 1/2 games behind the Cavaliers. The No. 7 seed hosts a game to open the tournament."}
{"game_id": "0022101180", "chunk_id": "0022101180_006", "order": 6, "role": "body", "text": "Kevin Porter Jr scored a season-high 36 points and Jalen Green added 30 for the Rockets."}
{"game_id": "0022101180", "chunk_id": "0022101180_007", "order": 7, "role": "body", "text": "The Nets led 90-69 late in the third quarter, but a 15-0 Houston run brought the Rockets within 90-84. Irving scored the game’s next eight points and Brooklyn held a double-digit lead the rest of the way."}
{"game_id": "0022101180", "chunk_id": "0022101180_008", "order": 8, "role": "body", "text": "“Kyrie was huge for us tonight. If we didn’t have him I don’t think we win this game,” Brown said. “He did everything for us. He brought energy. Everything he did for us was huge."}
{"game_id": "0022101180", "chunk_id": "0022101180_009", "order": 9, "role": "body", "text": "The Nets led by nine early, but a 12-2 Houston run capped by Alperen Sengun’s breakaway dunk gave the Rockets their only lead of the game, 18-17."}
{"game_id": "0022101180", "chunk_id": "0022101180_010", "order": 10, "role": "body", "text": "Brooklyn scored the next eight points and led 30-25 after the first quarter."}
{"game_id": "0022101180", "chunk_id": "0022101180_011", "order": 11, "role": "body", "text": "After the Rockets tied the game at 32, the Nets went on a 10-0 run. They increased their lead to 51-37 on Kessler Edwards’ short jumper with 5:14 left in the half and went into halftime up 64-47 following Irving’s 3-pointer with 44 seconds remaining."}
{"game_id": "0022101180", "chunk_id": "0022101180_012", "order": 12, "role": "body", "text": "Porter’s 3-pointer cut it to 77-65 midway through the third quarter but the Nets scored the next seven points and took the 90-69 lead on Thomas’ short jumper with 1:21 remaining in the quarter."}
{"game_id": "0022101180", "chunk_id": "0022101180_013", "order": 13, "role": "body", "text": "But those were the last points Brooklyn scored until Irving’s jumper with 8:33 left in the game snapped that 15-0 Houston run."}
{"game_id": "0022101180", "chunk_id": "0022101180_014", "order": 14, "role": "body", "text": "“It wasn’t a great performance. I don’t think anyone in the locker room thought it was a great performance,” Nets coach Steve Nash said. “But we found a way. We got it done. We weathered some tricky patches.”"}
{"game_id": "0022101180", "chunk_id": "0022101180_015", "order": 15, "role": "body", "text": "Sengun added 14 points and 11 rebounds for the Rockets, who have lost five straight games and have the worst record in the NBA."}
{"game_id": "0022101180", "chunk_id": "0022101180_016", "order": 16, "role": "body", "text": "“We just didn’t make enough 3s. That was basically the game,” Rockets coach Stephen Silas said. “The 3s and the free throws to me was the game. Making 11 3s out of 43 and 14 for 25 on the line, that is not going to beat a good team and they are a good team.”"}
{"game_id": "0022101180", "chunk_id": "0022101180_018", "order": 18, "role": "body", "text": "Rockets: No Houston player has seen action in each of the team’s 80 games this season. Kenyon Martin Jr. has played in the most (77), while Jae’Sean Tate (75) has the most starts."}
{"game_id": "0022101180", "chunk_id": "0022101180_019", "order": 19, "role": "body", "text": "Nets: Seth Curry (left ankle soreness), Goran Dragic (health and safety protocols) and James Johnson (non-Covid illness) were all out of the Brooklyn lineup. … LaMarcus Aldridge played for the first time since March 6."}
{"game_id": "0022101180", "chunk_id": "0022101180_021", "order": 21, "role": "body", "text": "Brooklyn debuted a new starting five on Tuesday (Durant, Brown, Drummond, Patty Mills, Irving). They became the 43rd different starting lineup in Brooklyn’s 79 games. Overall, 19 players have made at least one start for the Nets this season."}
{"game_id": "0022101180", "chunk_id": "0022101180_022", "order": 22, "role": "body", "text": "PASSING OF A FRANCHISE FIXTURE"}
{"game_id": "0022101180", "chunk_id": "0022101180_023", "order": 23, "role": "body", "text": "Herb Turetzky, who was the Nets’ official scorer for 54 years across multiple leagues and states, died Monday at 76. Turetzky was a senior at Long Island University when he scored the first game in franchise history — when the New Jersey Americans of the American Basketball Association hosted the Pittsburgh Pipers on Oct. 23, 1967, in Teaneck, New Jersey. He went on to score more than 2,200 games, a record for pro basketball games that was certified in the Guinness Book of World Records."}
{"game_id": "0022101180", "chunk_id": "0022101180_024", "order": 24, "role": "body", "text": "“He was a beloved figure within the organization and beyond,” coach Steve Nash said. “We want to make sure his family recognizes how important he was to the franchise and how our thoughts are with them at this time.”"}
{"game_id": "0022101180", "chunk_id": "0022101180_026", "order": 26, "role": "body", "text": "Rockets: Houston visits Toronto on Friday."}
{"game_id": "0022101180", "chunk_id": "0022101180_027", "order": 27, "role": "closing", "text": "Nets: Brooklyn visits New York on Wednesday."}
