{"game_id": "0022100015", "chunk_id": "0022100015_001", "order": 1, "role": "lead", "text": "MIAMI -- — Only one thing went wrong for the Miami Heat on Thursday night. Udonis Haslem voted no."}
{"game_id": "0022100015", "chunk_id": "0022100015_002", "order": 2, "role": "body", "text": "The rest went as well as anyone could have expected."}
{"game_id": "0022100015", "chunk_id": "0022100015_003", "order": 3, "role": "body", "text": "Tyler Herro scored 27 points in 24 minutes off the bench, Jimmy Butler added 21 and the Miami Heat opened their season with an easy 137-95 victory over the NBA champion Milwaukee Bucks on Thursday night."}
{"game_id": "0022100015", "chunk_id": "0022100015_004", "order": 4, "role": "body", "text": "“I mean, 137's a lot,\" Herro said. “Hopefully, we can see that a lot this season.\""}
{"game_id": "0022100015", "chunk_id": "0022100015_005", "order": 5, "role": "body", "text": "Bam Adebayo had 20 points and 13 rebounds for the Heat, who set team records for opening night scoring and opening night margin of victory. It was nearly the biggest margin of victory in any game — falling just short of a 43-point win over the Los Angeles Clippers in 1994."}
{"game_id": "0022100015", "chunk_id": "0022100015_006", "order": 6, "role": "body", "text": "The previous team record for points in an opener was 128 points against Detroit in 1999, and the biggest margin of victory was 26 points over Orlando in 2000. The only event that left Heat fans wanting more was when Haslem, now in his 19th season, politely declined cries from the crowd — and even some on his own bench — and didn't check into the game in the final moments."}
{"game_id": "0022100015", "chunk_id": "0022100015_007", "order": 7, "role": "body", "text": "“That was just great, hearing everybody chanting his name,\" Heat coach Erik Spoelstra said. “He doesn't need to go in there. That was just all love.\""}
{"game_id": "0022100015", "chunk_id": "0022100015_008", "order": 8, "role": "body", "text": "Giannis Antetokounmpo scored 15 points and Grayson Allen added 14 for Milwaukee. Olympic gold medalist Khris Middleton had 10 points on 4-for-14 shooting for the Bucks, who were without, among others, Jrue Holiday (right heel), Brook Lopez (back) and Bobby Portis (left hamstring)."}
{"game_id": "0022100015", "chunk_id": "0022100015_009", "order": 9, "role": "body", "text": "Miami outrebounded Milwaukee 58-38."}
{"game_id": "0022100015", "chunk_id": "0022100015_010", "order": 10, "role": "body", "text": "“We’ll get some of the guys back and every team is going to deal with this at different points, most likely,\" Bucks coach Mike Budenholzer said. “It’s a long journey and we’re just getting started.”"}
{"game_id": "0022100015", "chunk_id": "0022100015_011", "order": 11, "role": "body", "text": "P.J. Tucker started his Miami debut, against the team that he helped win an NBA title a few months ago, and had eight points and six rebounds."}
{"game_id": "0022100015", "chunk_id": "0022100015_012", "order": 12, "role": "body", "text": "Tucker committed Miami’s first foul of the game, a reintroduction to Antetokounmpo just 38 seconds after tip-off. And in the second quarter, Tucker chased down a loose ball and went airborne — crashing into the Milwaukee bench and ending up saying hello to occupants of some of the most expensive seats in the sold-out arena."}
{"game_id": "0022100015", "chunk_id": "0022100015_013", "order": 13, "role": "body", "text": "The outcome was never in doubt. A 19-0 run in the opening minutes gave the Heat a 22-3 lead out of the gate, Herro beat the first-quarter buzzer with a 35-footer that gave Miami a 40-17 edge, one that was up to 72-43 by halftime."}
{"game_id": "0022100015", "chunk_id": "0022100015_014", "order": 14, "role": "body", "text": "“We kept locking in,\" Adebayo said."}
{"game_id": "0022100015", "chunk_id": "0022100015_015", "order": 15, "role": "body", "text": "Over a nine-minute stretch of the opening quarter, Milwaukee missed 13 consecutive shots and had four turnovers in that span as well. The Bucks were within 53-38 with 3:35 left in the half — and Miami then scored the game’s next 14 points."}
{"game_id": "0022100015", "chunk_id": "0022100015_016", "order": 16, "role": "body", "text": "Herro’s 27 points off the bench matched a Heat record for any reserve playing 25 minutes or less. Goran Dragic had 27 points in 20 minutes against Golden State on Feb. 27, 2019; Dwyane Wade had 27 points in 25 minutes against Philadelphia on Feb. 27, 2018."}
{"game_id": "0022100015", "chunk_id": "0022100015_017", "order": 17, "role": "body", "text": "“We got our butts kicked,\" Budenholzer said. “That happens in the NBA.\""}
{"game_id": "0022100015", "chunk_id": "0022100015_019", "order": 19, "role": "body", "text": "Bucks: Milwaukee took its starters out with 5:01 left in the third quarter, except for Antetokounmpo, who came out 13 seconds later and Miami leading by 33. Allen and George Hill returned briefly, but the likes of Antetokounmpo and Middleton got an early end to their evening."}
{"game_id": "0022100015", "chunk_id": "0022100015_020", "order": 20, "role": "body", "text": "Heat: Miami improved to 19-15 in season openers. ... Kyle Lowry rolled an ankle in the second quarter and was back within a few minutes of his Miami debut. He had five points and six assists on 1 for 8 shooting."}
{"game_id": "0022100015", "chunk_id": "0022100015_022", "order": 22, "role": "body", "text": "The Heat and Bucks have played eight times since the start of last season, including Milwaukee's 4-0 first-round sweep. Half have been routs: the Bucks won games by 29, 34 and 37 last season, and the Heat won by 42 on Thursday."}
{"game_id": "0022100015", "chunk_id": "0022100015_023", "order": 23, "role": "body", "text": "“Last year, we felt like we got embarrassed,\" Herro said."}
{"game_id": "0022100015", "chunk_id": "0022100015_025", "order": 25, "role": "body", "text": "The Heat held a pregame moment of silence in memory of Johnnie Haslem, the Heat captain's father. The elder Haslem — a standout high school, college and semi-pro player — died this summer at the age of 70."}
{"game_id": "0022100015", "chunk_id": "0022100015_027", "order": 27, "role": "body", "text": "Bucks: Visit San Antonio on Saturday."}
{"game_id": "0022100015", "chunk_id": "0022100015_028", "order": 28, "role": "body", "text": "Heat: Visit Indiana on Saturday."}
