{"game_id": "0022101172", "chunk_id": "0022101172_001", "order": 1, "role": "lead", "text": "TORONTO -- — Kyle Lowry kept his tears in check, then took care of his old teammates from Toronto."}
{"game_id": "0022101172", "chunk_id": "0022101172_002", "order": 2, "role": "body", "text": "Lowry had 16 points and 10 assists against his former team, Max Strus scored all of his 23 points in the second half, and the Miami Heat beat the Raptors 114-109 on Sunday night."}
{"game_id": "0022101172", "chunk_id": "0022101172_003", "order": 3, "role": "body", "text": "“It’s something I’m going to cherish for a long, long time,” Lowry said after being showered with love throughout his first game in Toronto for more than two years. “I got the win, so that made it better. Even if I didn’t win, it would have been a great night, a special night.”"}
{"game_id": "0022101172", "chunk_id": "0022101172_004", "order": 4, "role": "body", "text": "Victor Oladipo scored a season-high 21 points, Tyler Herro had 18 and Bam Adebayo 16 as the Heat won their fourth straight and remained two games ahead of Boston atop the Eastern Conference standings. Each team has three games remaining."}
{"game_id": "0022101172", "chunk_id": "0022101172_005", "order": 5, "role": "body", "text": "Fred VanVleet and Pascal Siakam each scored 29 points, and Scottie Barnes and Gary Trent Jr. both had 19. But Toronto lost for the first time in six games, and OG Anunoby sat because of a sore thigh."}
{"game_id": "0022101172", "chunk_id": "0022101172_006", "order": 6, "role": "body", "text": "The Raptors have the same record as fifth-place Chicago but the Bulls hold the tiebreaker. Toronto is 2.5 games ahead of seventh-place Cleveland after the Cavaliers lost at home to Philadelphia on Sunday. Sixth place is the last guaranteed postseason spot, with teams finishing in the Nos. 7-10 spots headed for the play-in tournament."}
{"game_id": "0022101172", "chunk_id": "0022101172_007", "order": 7, "role": "body", "text": "Miami shot 6 for 20 from 3-point range in the first half, then went 12 for 18 from distance in the second half."}
{"game_id": "0022101172", "chunk_id": "0022101172_008", "order": 8, "role": "body", "text": "“We didn’t play defense worth a darn,” Raptors coach Nick Nurse said."}
{"game_id": "0022101172", "chunk_id": "0022101172_009", "order": 9, "role": "body", "text": "Leading 113-109 with 13 seconds left in the game, Miami turned the ball over in their own half but VanVleet missed a 3 that would have cut the deficit to one point."}
{"game_id": "0022101172", "chunk_id": "0022101172_010", "order": 10, "role": "body", "text": "Miami’s Jimmy Butler sat because of a sore left big toe a day after getting 22 points in Saturday’s 127-109 win at Chicago. The Heat were also without center Dewayne Dedmon (sprained right ankle), forward P.J. Tucker (left knee), and guard Gabe Vincent (right big toe)."}
{"game_id": "0022101172", "chunk_id": "0022101172_011", "order": 11, "role": "body", "text": "Lowry hadn’t played in Toronto since Feb. 28, 2020, when the defending champion Raptors lost to Charlotte. Less than two weeks later, the season was shut down by the pandemic, eventually resuming inside the bubble."}
{"game_id": "0022101172", "chunk_id": "0022101172_012", "order": 12, "role": "body", "text": "After Miami’s other starters were introduced, the arena lights dimmed and a video tribute to Lowry’s nine seasons with Toronto played on the scoreboard. As the sellout crowd of 19,800 rose to their feet, Lowry was introduced as a visitor the same way he once was as a local star, with the words “From North Philly to your city …”"}
{"game_id": "0022101172", "chunk_id": "0022101172_013", "order": 13, "role": "body", "text": "With his two young sons by his side, Lowry walked out to center court, holding his hands aloft in gratitude, but managing to contain his emotions. He’d previously said he might cry."}
{"game_id": "0022101172", "chunk_id": "0022101172_014", "order": 14, "role": "body", "text": "“It meant the world to me for the fans to show their appreciation, give me an ovation like that,” Lowry said. “The first time is always special and you don’t forget that.”"}
{"game_id": "0022101172", "chunk_id": "0022101172_015", "order": 15, "role": "body", "text": "Strus said the reception for Lowry was the kind many athletes dream about hearing."}
{"game_id": "0022101172", "chunk_id": "0022101172_016", "order": 16, "role": "body", "text": "“It’s a testament to who he is as a person,” Strus said. “You don’t get that type of chants and love like that if you’re not a good person and a great teammate. It just shows true to who he is and who we know him as.”"}
{"game_id": "0022101172", "chunk_id": "0022101172_017", "order": 17, "role": "body", "text": "Heat assistant coach Chris Quinn, who handled coaching duties because Erik Spoelstra was in the NBA's health and safety protocols, praised Lowry for not letting the emotional introduction impact his performance."}
{"game_id": "0022101172", "chunk_id": "0022101172_018", "order": 18, "role": "body", "text": "“I’m surprised he was able to reel it back in and play so well,” Quinn said. “Obviously we needed him tonight as the quarterback of our team. What a cool night.”"}
{"game_id": "0022101172", "chunk_id": "0022101172_019", "order": 19, "role": "body", "text": "VanVleet came in needing three 3-pointers to top Lowry’s single-season team record of 238 and wasted no time, connecting on his third 3 of the game with 5:39 left in the opening quarter. VanVleet scored 17 points in the first as Toronto led 34-28 after one."}
{"game_id": "0022101172", "chunk_id": "0022101172_020", "order": 20, "role": "body", "text": "VanVleet said his hot start was inspired by the intense drive to succeed he and Lowry famously share."}
{"game_id": "0022101172", "chunk_id": "0022101172_021", "order": 21, "role": "body", "text": "“That’s what respect looks like,” VanVleet said. “Obviously I want to give him my best and he deserves that. He brings out a different competitive edge in myself.”"}
{"game_id": "0022101172", "chunk_id": "0022101172_022", "order": 22, "role": "body", "text": "The Raptors led 55-45 at halftime but Strus scored 14 points in the third, connecting on four of six from long range, as Miami took a 79-78 edge to the fourth."}
{"game_id": "0022101172", "chunk_id": "0022101172_023", "order": 23, "role": "body", "text": "“I was the beneficiary of a lot of good ball movement, just made open shots when I had them.” Strus said."}
{"game_id": "0022101172", "chunk_id": "0022101172_025", "order": 25, "role": "body", "text": "Heat: Quinn also stood in for Spoelstra in a March 26 loss to Brooklyn when the coach missed the game for personal reasons. … Strus shot 7 for 9 from 3-point range. He made a career-best nine 3-pointers against Boston on Jan. 31. … Lowry had six rebounds."}
{"game_id": "0022101172", "chunk_id": "0022101172_026", "order": 26, "role": "body", "text": "Raptors: Khen Birch started in place of Anunoby. … VanVleet shot 11 for 11 at the free throw line."}
{"game_id": "0022101172", "chunk_id": "0022101172_028", "order": 28, "role": "body", "text": "Brazilian soccer star and 2002 World Cup winner Ronaldinho watched from a courtside seat adjacent to the Miami bench. Siakam, who played soccer as a child, stopped by for a quick handshake."}
{"game_id": "0022101172", "chunk_id": "0022101172_030", "order": 30, "role": "body", "text": "Heat: Host Charlotte on Tuesday night"}
{"game_id": "0022101172", "chunk_id": "0022101172_031", "order": 31, "role": "body", "text": "Raptors: Host Atlanta on Tuesday night."}
