{"game_id": "0022100695", "chunk_id": "0022100695_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Darius Garland collected 23 points and 11 assists, and rookie Evan Mobley had 15 points and a season-high 17 rebounds to power the Cleveland Cavaliers over the Oklahoma City Thunder 94-87 on Saturday night."}
{"game_id": "0022100695", "chunk_id": "0022100695_002", "order": 2, "role": "body", "text": "Jarrett Allen added 14 points and 13 rebounds for Cleveland, which built a 74-57 lead in the third quarter and never allowed the Thunder to pull closer than six points in the fourth. The Cavaliers have won six of their last seven."}
{"game_id": "0022100695", "chunk_id": "0022100695_003", "order": 3, "role": "body", "text": "“We just came out there and we fought like dogs,” Mobley said. “That’s what we have to do. Me being attack-minded, it just comes natural. We try to dominate the paint and play our brand of basketball, and we did.”"}
{"game_id": "0022100695", "chunk_id": "0022100695_004", "order": 4, "role": "body", "text": "Shai Gilgeous-Alexander paced Oklahoma City across the board with 29 points, nine rebounds and six assists. Kenrich Williams scored 12 points and Luguentz Dort had 10 points before being ejected for elbowing Kevin Love in the head."}
{"game_id": "0022100695", "chunk_id": "0022100695_005", "order": 5, "role": "body", "text": "Mobley, the third overall draft pick from USC, has nine double-doubles in 39 pro games. Garland posted his sixth double-double in the last seven games and is averaging 21.0 points and 12.3 assists during that timeframe."}
{"game_id": "0022100695", "chunk_id": "0022100695_006", "order": 6, "role": "body", "text": "Cedi Osman had 10 points off the bench for the Cavaliers, who went 18 of 35 from the foul line and missed 21 of 27 3-point attempts. They also lost forward Lauri Markkanen to a sprained right ankle in the second quarter."}
{"game_id": "0022100695", "chunk_id": "0022100695_007", "order": 7, "role": "body", "text": "“We’ll take the win, but that was a disappointing game for us,” Cleveland coach J.B. Bickerstaff said. “Hopefully, it won’t be too long until Lauri is back with us. It’s over now and we got the win, but we can’t afford to play that way. We didn’t play well.”"}
{"game_id": "0022100695", "chunk_id": "0022100695_008", "order": 8, "role": "body", "text": "Dort received a flagrant 2 for striking Love after the whistle on a scramble for a loose ball. Love received a personal foul prior to absorbing the elbow."}
{"game_id": "0022100695", "chunk_id": "0022100695_009", "order": 9, "role": "body", "text": "“If you look at what constitutes a flagrant 2, I don’t know if it was that malicious,” Thunder coach Mark Daigneault said. “I thought he was trying to rip the ball away from Garland and he caught Love high.”"}
{"game_id": "0022100695", "chunk_id": "0022100695_010", "order": 10, "role": "body", "text": "The Thunder, who wrapped up a four-game road trip, have lost five straight and 10 of their last 11 games. Oklahoma City’s starting frontcourt of Dort, Darius Bazley and Jeremiah Robinson-Earl shot a combined 5 of 25 from the field."}
{"game_id": "0022100695", "chunk_id": "0022100695_011", "order": 11, "role": "body", "text": "“We've got a target on our back now,” Garland said. “Everybody wants to beat us, so we have to play the full 48 minutes. Coach let us know that after the game because we let up a little bit.”"}
{"game_id": "0022100695", "chunk_id": "0022100695_013", "order": 13, "role": "body", "text": "The Thunder didn’t check into their downtown Cleveland hotel until 8 a.m. due to winter travel delays in Charlotte following their 121-98 loss to the Hornets on Friday."}
{"game_id": "0022100695", "chunk_id": "0022100695_014", "order": 14, "role": "body", "text": "Oklahoma City’s team bus became stuck on an icy road en route to the airport, forcing several members of its traveling party to disembark to help push it to safety. The Thunder also had to change planes at 5 a.m."}
{"game_id": "0022100695", "chunk_id": "0022100695_015", "order": 15, "role": "body", "text": "“It was grueling for the guys, but these experiences are a little unifying,” Daigneault said. “When we got off the elevator at the hotel, people were already eating breakfast, so that kind of reinforced how long we’d been trying to get here.”"}
{"game_id": "0022100695", "chunk_id": "0022100695_017", "order": 17, "role": "body", "text": "Thunder: Oklahoma City is assured of finishing January with a losing record, marking the eighth straight month it has done so. … Rookie G Vit Krejci (right ankle sprain), who has two points in nine minutes this season, missed his fifth straight game. … G Theo Maledon, C Aleksej Pokusevski and C Isaiah Roby are on G League assignments with the Oklahoma City Blue, along with two-way G Paul Watson. … The Thunder lost at Rocket Mortgage FieldHouse for the first time since Jan. 29, 2017."}
{"game_id": "0022100695", "chunk_id": "0022100695_018", "order": 18, "role": "body", "text": "Cavaliers: G Rajon Rondo (right hamstring soreness) missed his sixth game in a row. Rondo has only appeared in three games since being acquired from the Lakers in a three-team trade on Jan. 3. … G Lamar Stevens (left knee soreness), who had started seven straight contests prior to being hurt at Oklahoma City on Jan. 15, returned from a two-game absence."}
{"game_id": "0022100695", "chunk_id": "0022100695_020", "order": 20, "role": "body", "text": "Thunder: Host Chicago on Wednesday night."}
{"game_id": "0022100695", "chunk_id": "0022100695_021", "order": 21, "role": "body", "text": "Cavaliers: Host New York on Monday night."}
