{"game_id": "0022100370", "chunk_id": "0022100370_001", "order": 1, "role": "lead", "text": "MIAMI -- — Caleb Martin scored a career-high 28 points and the Miami Heat beat the Milwaukee Bucks 113-104 on Wednesday night."}
{"game_id": "0022100370", "chunk_id": "0022100370_002", "order": 2, "role": "body", "text": "Starting for injured Jimmy Butler, Martin shot 9 of 12 from the field, including 6 for 8 on 3-pointers, as the Heat tied a franchise record with 22 3s against the defending NBA champions."}
{"game_id": "0022100370", "chunk_id": "0022100370_003", "order": 3, "role": "body", "text": "“They put me in the starting lineup because they believe in me,” Martin said. “When my opportunity comes, I want to take advantage.\""}
{"game_id": "0022100370", "chunk_id": "0022100370_004", "order": 4, "role": "body", "text": "Kyle Lowry had 22 points and 13 assists, and Max Strus scored all 16 of his points in the fourth quarter for Miami, which snapped a three-game home losing streak."}
{"game_id": "0022100370", "chunk_id": "0022100370_005", "order": 5, "role": "body", "text": "“We don’t like to be in the losing column,” Martin said. “We were locked in. You could tell we were hungry for a victory.”"}
{"game_id": "0022100370", "chunk_id": "0022100370_006", "order": 6, "role": "body", "text": "After 15- and 26-point losses in its previous two home games, Miami outscored Milwaukee 69-53 in the second half. The Heat shot 14 of 26 on 3s in the final two periods, including four each from Lowry and Strus."}
{"game_id": "0022100370", "chunk_id": "0022100370_007", "order": 7, "role": "body", "text": "Jrue Holiday scored 27 points and Khris Middleton finished with 20 for the Bucks. Two-time MVP Giannis Antetokounmpo had 15 points as Miami limited him to 4-of-13 shooting from the field."}
{"game_id": "0022100370", "chunk_id": "0022100370_008", "order": 8, "role": "body", "text": "“We have to play harder and close out, too,” Antetokounmpo said. “They made some tough (shots), too. They played harder than us and they played better than us.”"}
{"game_id": "0022100370", "chunk_id": "0022100370_009", "order": 9, "role": "body", "text": "The Heat took the lead for good with nine straight points in the final 55 seconds of the third. Consecutive 3-pointers from Lowry, and P.J. Tucker’s 3 at the buzzer, put Miami ahead 83-77. Tucker finished with 15 points."}
{"game_id": "0022100370", "chunk_id": "0022100370_010", "order": 10, "role": "body", "text": "Butler, the Heat’s leading scorer, aggravated an injury in Monday’s loss to Memphis. He had missed the previous four games because of a bruised tailbone."}
{"game_id": "0022100370", "chunk_id": "0022100370_011", "order": 11, "role": "body", "text": "“We’re going to need our full roster to contribute,” Miami coach Erik Spoelstra said. “It’ll be different guys at different times. We had some different lineups out there clearly.”"}
{"game_id": "0022100370", "chunk_id": "0022100370_012", "order": 12, "role": "body", "text": "Miami's reserves outscored Milwaukee’s 40-16."}
{"game_id": "0022100370", "chunk_id": "0022100370_013", "order": 13, "role": "body", "text": "“The second-unit guys really just gave us some inspiring basketball out there,” Spoelstra said."}
{"game_id": "0022100370", "chunk_id": "0022100370_014", "order": 14, "role": "body", "text": "The loss was Milwaukee’s second in its last 12 games."}
{"game_id": "0022100370", "chunk_id": "0022100370_015", "order": 15, "role": "body", "text": "“Those guys stepped up and hit 22 3s as a team,” Bucks coach Mike Budenholzer said. “They made the plays to win and we’ll give them credit.”"}
{"game_id": "0022100370", "chunk_id": "0022100370_017", "order": 17, "role": "body", "text": "Bucks: G George Hill (right knee hyperextension) missed his third consecutive game. ... Antetokounmpo blocked a shot and moved within one of Alton Lister, the club’s career leader at 804. ... Middleton had his sixth straight game of 20 or more points. Milwaukee is 7-2 when he reaches 20 points."}
{"game_id": "0022100370", "chunk_id": "0022100370_018", "order": 18, "role": "body", "text": "Heat: The 51-44 halftime deficit was Miami’s first under double digits in its last three home games. ... G Duncan Robinson played in his 173rd consecutive game, one behind Glen Rice for most in club history. Robinson began the streak on April 9, 2019."}
{"game_id": "0022100370", "chunk_id": "0022100370_020", "order": 20, "role": "body", "text": "Heat center Bam Adebayo is expected to miss between four and six weeks after undergoing surgery on his right thumb to repair a torn ligament Monday in Los Angeles. Adebayo sustained the injury in the home loss against Denver."}
{"game_id": "0022100370", "chunk_id": "0022100370_022", "order": 22, "role": "body", "text": "The Bucks and Heat already have played three times in their first 26 games. Neither team has faced another opponent more than twice. Their fourth and final regular-season meeting is March 2 at Milwaukee."}
{"game_id": "0022100370", "chunk_id": "0022100370_024", "order": 24, "role": "body", "text": "Bucks: Continue their four-game road trip Friday at Houston."}
{"game_id": "0022100370", "chunk_id": "0022100370_025", "order": 25, "role": "body", "text": "Heat: Conclude a three-game homestand Saturday against Chicago."}
