{"game_id": "0022101031", "chunk_id": "0022101031_001", "order": 1, "role": "lead", "text": "MIAMI -- — The game plan didn't call for Max Strus to play Tuesday night. He was not in the Miami Heat rotation to start the game, only entering after halftime because Jimmy Butler left with a sprained ankle."}
{"game_id": "0022101031", "chunk_id": "0022101031_002", "order": 2, "role": "body", "text": "His impact wound up being massive."}
{"game_id": "0022101031", "chunk_id": "0022101031_003", "order": 3, "role": "body", "text": "Strus scored all of his 16 points in the fourth quarter, Tyler Herro finished with a game-high 29 off the bench and the Heat escaped with a 105-98 win over the Detroit Pistons on Tuesday night."}
{"game_id": "0022101031", "chunk_id": "0022101031_004", "order": 4, "role": "body", "text": "“Max, he stays ready, no matter what,\" Herro said."}
{"game_id": "0022101031", "chunk_id": "0022101031_005", "order": 5, "role": "body", "text": "Strus scored 13 points in a span of 2:55 of the final quarter to help Miami rally. Bam Adebayo finished with 16 for the Heat and Herro hit the biggest shot of the night for Miami, a 3-pointer for a five-point lead with 1:59 left."}
{"game_id": "0022101031", "chunk_id": "0022101031_006", "order": 6, "role": "body", "text": "Jerami Grant led the Pistons with 22 points. Isaiah Livers scored 16, while Marvin Bagley III and Saddiq Bey each had 13 for Detroit, which closed the third quarter on a 19-0 run to put a serious scare into the Eastern Conference leaders."}
{"game_id": "0022101031", "chunk_id": "0022101031_007", "order": 7, "role": "body", "text": "“Everybody's playing together,\" Livers said. “We're sharing the ball and that just creates happiness. Happiness goes a long way in the game of basketball.\""}
{"game_id": "0022101031", "chunk_id": "0022101031_008", "order": 8, "role": "body", "text": "P.J. Tucker’s layup with 6:56 left in the third gave Miami what was its largest lead of the night, 68-54. That’s when things went bad for the Heat, in a hurry."}
{"game_id": "0022101031", "chunk_id": "0022101031_009", "order": 9, "role": "body", "text": "They missed their next 14 shots — eight of them from 3-point range — and Detroit simultaneously found its best stride of the night. Grant had nine points in the 19-0 run, and Livers’ 3-pointer with 1:45 left in the third capped the burst to give Detroit a 73-68 lead."}
{"game_id": "0022101031", "chunk_id": "0022101031_010", "order": 10, "role": "body", "text": "But Miami (46-24) would survive and put another half-game between itself and all its closest challengers in the race for the No. 1 seed in the East playoffs. Milwaukee is now 2 1/2 games back, Philadelphia 3 1/2 games back, Chicago four back and Boston 4 1/2 out."}
{"game_id": "0022101031", "chunk_id": "0022101031_011", "order": 11, "role": "body", "text": "“Just had to find a way,\" Herro said. “We found a way, got the W and that’s all that matters.\""}
{"game_id": "0022101031", "chunk_id": "0022101031_012", "order": 12, "role": "body", "text": "Butler had eight points on 2-for-9 shooting in the first half, limping through much of the second quarter. He didn’t return after halftime, diagnosed with a sprained right ankle."}
{"game_id": "0022101031", "chunk_id": "0022101031_013", "order": 13, "role": "body", "text": "Detroit played without No. 1 overall pick Cade Cunningham, who was held out and stayed behind at the team hotel with a non-COVID illness."}
{"game_id": "0022101031", "chunk_id": "0022101031_014", "order": 14, "role": "body", "text": "“He started feeling bad last night,” Pistons coach Dwane Casey said. “Came to shootaround looking like death, eating crackers. So, he’s in pretty bad shape.”"}
{"game_id": "0022101031", "chunk_id": "0022101031_016", "order": 16, "role": "body", "text": "Pistons: Detroit didn’t have anyone reach double figures in scoring until Grant made a 3-pointer midway through the third quarter. ... The Pistons had been 5-0 when leading road games entering the fourth quarter. ... Casey remained on 99 wins in his three-plus seasons with Detroit."}
{"game_id": "0022101031", "chunk_id": "0022101031_017", "order": 17, "role": "body", "text": "Heat: Butler's ankle will be evaluated again Wednesday. It's his third known sprain of the season. ... It was Herro’s 48th time scoring at least 20 off the Miami bench, which is exactly twice as many times as anyone else has. Goran Dragic did it 24 times. ... Duncan Robinson scored 12. ... Kyle Lowry took only three shots, missing them all."}
{"game_id": "0022101031", "chunk_id": "0022101031_019", "order": 19, "role": "body", "text": "Caleb Martin (knee) missed his third consecutive game for Miami. Excluding the two-way players, he was the only Heat player not available to play on Tuesday. The Heat have not had a game yet this season with all 15 of the players on standard contracts medically able to take part."}
{"game_id": "0022101031", "chunk_id": "0022101031_021", "order": 21, "role": "body", "text": "Unprompted, Heat coach Erik Spoelstra paid tribute Tuesday night to Pistons broadcaster George Blaha — who underwent a heart bypass procedure Tuesday and will miss the rest of the season. The need for the bypass was discovered during a routine checkup last week. “I want to wish him well and hope for a quick recovery. My dad went to college with him so they go way, way, way back,” Spoelstra said. Blaha intends to return for a 47th season of calling Pistons games next fall."}
{"game_id": "0022101031", "chunk_id": "0022101031_023", "order": 23, "role": "body", "text": "Rodney McGruder started 112 games in his first three NBA seasons, all with Miami. He started for the Pistons on Tuesday — just his eighth start in three seasons since leaving the Heat. McGruder started four games with the Los Angeles Clippers in 2019-20, then two for the Pistons last season and now two for Detroit this season."}
{"game_id": "0022101031", "chunk_id": "0022101031_025", "order": 25, "role": "body", "text": "Pistons: Visit Orlando on Thursday."}
{"game_id": "0022101031", "chunk_id": "0022101031_026", "order": 26, "role": "body", "text": "Heat: Host Oklahoma City on Friday."}
