{"game_id": "0022100476", "chunk_id": "0022100476_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Myles Turner had 32 points and 10 rebounds, Caris LeVert had 24 points and 11 assists, and the Indiana Pacers beat the Houston Rockets 118-106 Thursday night."}
{"game_id": "0022100476", "chunk_id": "0022100476_002", "order": 2, "role": "body", "text": "Turner made 14 of 18 shots as the Pacers hit 52.8% from the field. Chris Duarte scored 18 points and Jeremy Lamb had 16 for Indiana, which played without starters Malcolm Brogdon (sore right Achilles tendon) and Domantas Sabonis (sore right calf)."}
{"game_id": "0022100476", "chunk_id": "0022100476_003", "order": 3, "role": "body", "text": "“Myles was sensational,” Pacers coach Rick Carlisle said. “His offensive decision making was on point. He hit a 3, he hit a couple of mid-range shots, he attacked the rim and made some nice touch passes. He only had two turnovers. He had a calm poise to us that helped us get through the third quarter.\""}
{"game_id": "0022100476", "chunk_id": "0022100476_004", "order": 4, "role": "body", "text": "Christian Wood scored 22 points for Houston, and Jalen Green added 20 in his return after missing nearly a month with a strained hamstring. Jae'Sean Tate had 18 points, and Eric Gordon scored 15."}
{"game_id": "0022100476", "chunk_id": "0022100476_005", "order": 5, "role": "body", "text": "The Rockets led 94-91 after three quarters, but the Pacers opened the fourth with a 10-2 run and maintained control the rest of the way."}
{"game_id": "0022100476", "chunk_id": "0022100476_006", "order": 6, "role": "body", "text": "Carlisle said the turning point was assistant coach Lloyd Pierce's decision to go to the zone in the fourth quarter."}
{"game_id": "0022100476", "chunk_id": "0022100476_007", "order": 7, "role": "body", "text": "“Their shotmaking was exceptional in the third quarter,” Carlisle said. “(Houston) is a rhythm team. We went to a zone to disrupt their rhythm. The guys did a great job of executing. Zones are harder to play than man-to-man, but we did a terrific job. They scored a few baskets but it wasn't like the barrage they hit us with in the second half.\""}
{"game_id": "0022100476", "chunk_id": "0022100476_008", "order": 8, "role": "body", "text": "Wood said it did throw the Rockets off their game."}
{"game_id": "0022100476", "chunk_id": "0022100476_009", "order": 9, "role": "body", "text": "“Our offense got stagnant,” he said. “We didn't attack the zone the way we should.”"}
{"game_id": "0022100476", "chunk_id": "0022100476_010", "order": 10, "role": "body", "text": "Indiana won the rebounding battle 47-28."}
{"game_id": "0022100476", "chunk_id": "0022100476_011", "order": 11, "role": "body", "text": "“That's an effort stat,” Carlisle said of the rebounding. “These guys responded extremely well without two of our top players. It was a game we needed very badly.\""}
{"game_id": "0022100476", "chunk_id": "0022100476_012", "order": 12, "role": "body", "text": "Carlisle said he was especially pleased with the way his team responded following a 125-96 loss at Miami on Tuesday night."}
{"game_id": "0022100476", "chunk_id": "0022100476_013", "order": 13, "role": "body", "text": "Wood said overall defense was a bigger problem for the Rockets rather than just the Pacers' edge in rebounding."}
{"game_id": "0022100476", "chunk_id": "0022100476_015", "order": 15, "role": "body", "text": "LeVert took over point guard duties in Brogdon's absence."}
{"game_id": "0022100476", "chunk_id": "0022100476_016", "order": 16, "role": "body", "text": "“Caris has proven he's a hell of a point guard,” Carlisle said. “Caris is a stone-cold attacker. He knows how to win. If you put the ball in his hands the way we did tonight, he makes really good plays.\""}
{"game_id": "0022100476", "chunk_id": "0022100476_018", "order": 18, "role": "body", "text": "Rockets: Houston has lost seven of nine. ... Coach Stephen Silas said Green would be on a minutes restriction, but he played 25 minutes. Green, the second overall pick in the 2021 draft, was out since Nov. 24."}
{"game_id": "0022100476", "chunk_id": "0022100476_019", "order": 19, "role": "body", "text": "Pacers: Brogdon played eight minutes Tuesday at Miami and couldn't suit up Thursday. ... Carlisle said Sabonis was kicked in the leg against Detroit on Dec. 16. He played at Miami, but he aggravated the injury. “We're hoping this thing without Malcolm and Domas is not a long-term thing, and we can get back being more intact sooner rather than later,\" Carlisle said."}
{"game_id": "0022100476", "chunk_id": "0022100476_021", "order": 21, "role": "body", "text": "Rockets: At Charlotte on Monday."}
