{"game_id": "0022100542", "chunk_id": "0022100542_001", "order": 1, "role": "lead", "text": "NEW YORK -- — The Los Angeles Clippers came to Brooklyn without their coach and many of their best players."}
{"game_id": "0022100542", "chunk_id": "0022100542_002", "order": 2, "role": "body", "text": "The Nets couldn't convince themselves that LA's patchwork lineup could beat them."}
{"game_id": "0022100542", "chunk_id": "0022100542_003", "order": 3, "role": "body", "text": "“I mean, it’s natural when a team is missing so many players. They've been going through so much over there and you relax,” Kevin Durant said. “You don’t think you could lose an NBA game like this.”"}
{"game_id": "0022100542", "chunk_id": "0022100542_005", "order": 5, "role": "body", "text": "Eric Bledsoe scored a season-high 27 points and the short-handed Clippers, playing on the second night of a back-to-back, rallied to beat the Nets 120-116 on Saturday night."}
{"game_id": "0022100542", "chunk_id": "0022100542_006", "order": 6, "role": "body", "text": "Terance Mann and Reggie Jackson added 19 points apiece for the Clippers, who were coached for the second straight night by assistant Brian Shaw with coach Tyronn Lue in health and safety protocols."}
{"game_id": "0022100542", "chunk_id": "0022100542_007", "order": 7, "role": "body", "text": "They were missing much more than their coach. With Kawhi Leonard, Paul George and Nicolas Batum injured and Ivica Zubac and Luke Kennard in COVID-19 protocols, the Clippers were without much of what would be their normal starting lineup. They didn't even play Marcus Morris Sr., who got the night off after scoring 20 points Friday in a loss at Toronto."}
{"game_id": "0022100542", "chunk_id": "0022100542_008", "order": 8, "role": "body", "text": "But they were good enough to beat the Nets, who wasted James Harden's seventh triple-double."}
{"game_id": "0022100542", "chunk_id": "0022100542_009", "order": 9, "role": "body", "text": "“It just shows our grit, it just shows what we’ve been through the last year and a half in terms of our next-man-up mentality and it just shows what we're capable of, really,” Mann said."}
{"game_id": "0022100542", "chunk_id": "0022100542_010", "order": 10, "role": "body", "text": "Harden finished with 34 points, 13 assists and 12 rebounds. Durant added 28 points and nine rebounds, but the Nets fell to 0-2 since he returned from a three-game absence in health and safety protocols."}
{"game_id": "0022100542", "chunk_id": "0022100542_011", "order": 11, "role": "body", "text": "They surrendered 40 points in the fourth and coach Steve Nash said they got what they deserved. Durant echoed that, adding, “We came here with a (bad) attitude to start, thinking we were just going to walk into a ‘W.'\""}
{"game_id": "0022100542", "chunk_id": "0022100542_012", "order": 12, "role": "body", "text": "The Nets routed the Clippers 124-108 without Durant in Los Angeles on Monday behind 39 points and 15 assists from Harden. But they couldn't shake free after opening a series of double-digit leads in the second half."}
{"game_id": "0022100542", "chunk_id": "0022100542_013", "order": 13, "role": "body", "text": "The Clippers hung around and used a 15-3 run to turn a 12-point deficit into a 110-all tie on Amir Coffey's 3-pointer with 2:35 to play."}
{"game_id": "0022100542", "chunk_id": "0022100542_014", "order": 14, "role": "body", "text": "Harden's free throw gave the Nets their last lead at 113-112 but Justise Winslow scored in the paint before Mann got wide open in the corner in front of his bench for a 3-pointer that made it 117-113 with 23 seconds to play."}
{"game_id": "0022100542", "chunk_id": "0022100542_015", "order": 15, "role": "body", "text": "The Clippers went home with a 2-1 road trip, though wouldn't celebrate too much. Shaw said they didn't know what would happen next, knowing they have to test again before leaving and then again once they get home."}
{"game_id": "0022100542", "chunk_id": "0022100542_016", "order": 16, "role": "body", "text": "“We’re just going to enjoy it and then get ready for our next game on Monday when we get back,” Shaw said."}
{"game_id": "0022100542", "chunk_id": "0022100542_018", "order": 18, "role": "body", "text": "Clippers: The Clippers were so short-handed that James Ennis III and Wenyen Gabriel both played against the Nets after recently being Nets. Both signed 10-day hardship contracts this week after doing the same in Brooklyn when the Nets needed bodies. ... Coffey scored 14 points."}
{"game_id": "0022100542", "chunk_id": "0022100542_019", "order": 19, "role": "body", "text": "Nets: Harden has two straight 30-point triple-doubles. ... The Nets fell to 3-5 on New Year's Day."}
{"game_id": "0022100542", "chunk_id": "0022100542_021", "order": 21, "role": "body", "text": "Nash said Kyrie Irving, who recently rejoined the team and is working toward his season debut, looks great in practice. Irving is expected to begin playing road games this month, but still isn't eligible to play at home because he is not vaccinated as required in New York."}
{"game_id": "0022100542", "chunk_id": "0022100542_022", "order": 22, "role": "body", "text": "“I think he’s on his way. It’s getting close,” Nash said. “We’ve just got to make sure that we don’t make a hasty decision, but it’s coming.”"}
{"game_id": "0022100542", "chunk_id": "0022100542_024", "order": 24, "role": "body", "text": "This was the third time in the Nets' last four games that their opponent was without its coach. The Lakers' Frank Vogel was in health and safety protocols on Christmas, as was Philadelphia's Doc Rivers on Thursday."}
{"game_id": "0022100542", "chunk_id": "0022100542_025", "order": 25, "role": "body", "text": "“Coaching is very overrated, so it’s not the biggest deal,” Nash joked. “I think in this league, you play so many games and the regular season is so different from the playoffs that sometimes it can give a team a bump. You know, they hear a new voice for a night or two, whatever it is, and it’s a little bit of break or change and then you get back to normalcy.”"}
{"game_id": "0022100542", "chunk_id": "0022100542_027", "order": 27, "role": "body", "text": "Clippers: Host Minnesota on Monday."}
