{"game_id": "0022100320", "chunk_id": "0022100320_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Cole Anthony scored 24 points, Wendell Carter Jr. added 18 and the Orlando Magic rallied from a 16-point deficit to beat the Denver Nuggets 108-103 on Wednesday night and end their seven-game losing streak."}
{"game_id": "0022100320", "chunk_id": "0022100320_002", "order": 2, "role": "body", "text": "The Magic took their first lead of the night at 106-103 when rookie Franz Wagner drilled a step-back 3-pointer with 1:45 to play. Wagner had 15 points, while his brother, Moritz Wagner, chipped in 12 points off the bench."}
{"game_id": "0022100320", "chunk_id": "0022100320_003", "order": 3, "role": "body", "text": "“I came off a pick-and-roll looking to pass it early, but they messed up the switch and I was just open and shot a 3,” Franz Wagner said. “Obviously, it felt really good.\""}
{"game_id": "0022100320", "chunk_id": "0022100320_004", "order": 4, "role": "body", "text": "Denver’s final chance fell short when Will Barton’s 25-foot shot with 2 seconds remaining badly missed the rim. The Nuggets were outscored 66-38 in the paint by the Magic, who shot better than 60% from the floor in each of the final three quarters."}
{"game_id": "0022100320", "chunk_id": "0022100320_005", "order": 5, "role": "body", "text": "“After that (first) quarter, they got anything they wanted and the biggest thing that stands out is our inability to defend the paint,” Denver coach Michael Malone said. \"It was a 12-3 punch in the mouth (to start the second half). We tried to go zone and it was layup after layup after layup.”"}
{"game_id": "0022100320", "chunk_id": "0022100320_006", "order": 6, "role": "body", "text": "Orlando ended a 10-game losing streak against Denver, a skid that dated to March 15, 2016. The Magic’s rally also ruined the return of Denver’s Aaron Gordon, who played at the Amway Center for the first time since Orlando traded him to Denver on March 28. Gordon, who spent seven seasons in Orlando from 2014-21, scored 17 points, grabbed eight rebounds and had three thunderous dunks on Wednesday."}
{"game_id": "0022100320", "chunk_id": "0022100320_007", "order": 7, "role": "body", "text": "“It was kind of a weird experience, coming into Amway on the other side for the first time in my career,” Gordon said. “I didn’t want to make it about me; I wanted to make it about getting a win, but unfortunately we didn’t.”"}
{"game_id": "0022100320", "chunk_id": "0022100320_008", "order": 8, "role": "body", "text": "The Magic came into the night ranked 28th in the NBA in field goal percentage, but they shot a season-best 54.3%."}
{"game_id": "0022100320", "chunk_id": "0022100320_009", "order": 9, "role": "body", "text": "Anthony, who returned after missing the previous six games with an ankle injury, had his ninth 20-point game and chipped in eight rebounds and seven assists. Gary Harris, who was traded from Denver in the Gordon deal, had 11 points."}
{"game_id": "0022100320", "chunk_id": "0022100320_010", "order": 10, "role": "body", "text": "Orlando outscored Denver 32-20 in the third quarter and dominated the fourth to win for the first time since Nov. 17. Also, the Magic won for just the second time at home — both victories coming as a result of fourth-quarter rallies."}
{"game_id": "0022100320", "chunk_id": "0022100320_011", "order": 11, "role": "body", "text": "Monte Morris scored a season-best 22 points, while Nikola Jokic had 18 points, 15 rebounds and seven assists. Jokic had a turnover and a layup attempt blocked in the final minute."}
{"game_id": "0022100320", "chunk_id": "0022100320_012", "order": 12, "role": "body", "text": "After ending a six-game losing streak on Monday in Miami, the Nuggets fell to 3-7 on the road. They are in the midst of a seven-game, 13-day road trip."}
{"game_id": "0022100320", "chunk_id": "0022100320_013", "order": 13, "role": "body", "text": "“We weren’t doing anything on defense and they were getting whatever they wanted,” Gordon said. “This one hurts.”"}
{"game_id": "0022100320", "chunk_id": "0022100320_015", "order": 15, "role": "body", "text": "Malone raved about how Gordon has embraced his role in Denver. He came in averaging 13.9 points on 51.7% shooting."}
{"game_id": "0022100320", "chunk_id": "0022100320_016", "order": 16, "role": "body", "text": "“When we traded for him at the deadline last (season), we went 19-6 to close out the season with Aaron in the lineup,” Malone said. “I think this is the best Aaron Gordon has ever played. What he is doing on both ends of the floor for us is remarkable.”"}
{"game_id": "0022100320", "chunk_id": "0022100320_018", "order": 18, "role": "body", "text": "Nuggets: Malone said that he and President of Basketball Operations Tim Connelly spoke on Wednesday about possible wing additions to the roster with the Nuggets down several players. Jamal Murray has yet to play following knee surgery, while Michael Porter Jr. is out for the season with a back injury. … The Nuggets were also without guard Austin Rivers, who was placed on the NBA’s health and safety protocols. That kept Rivers from playing in Orlando, where he starred in high school following his father, Doc Rivers’ stint as coach of the Magic."}
{"game_id": "0022100320", "chunk_id": "0022100320_019", "order": 19, "role": "body", "text": "Magic: After further evaluation, Orlando determined guard Jalen Suggs won’t need surgery to repair the fractured right thumb he suffered on Monday. As of Wednesday, Suggs ranked seventh among rookies in scoring (12.3) and third in assists (3.6)."}
{"game_id": "0022100320", "chunk_id": "0022100320_021", "order": 21, "role": "body", "text": "Nuggets: At New York on Saturday night."}
{"game_id": "0022100320", "chunk_id": "0022100320_022", "order": 22, "role": "closing", "text": "Magic: At Houston on Friday night."}
