{"game_id": "0022100581", "chunk_id": "0022100581_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Chris Paul and the Phoenix Suns have turned into some of the league's best closers. It's a big reason they've reached 30 wins before any other team in the NBA this season."}
{"game_id": "0022100581", "chunk_id": "0022100581_002", "order": 2, "role": "body", "text": "Paul had a triple-double with 14 points, 13 rebounds and 10 assists, and the Suns improved to 25-0 when leading after three quarters by beating the Los Angeles Clippers 106-89 on Thursday night."}
{"game_id": "0022100581", "chunk_id": "0022100581_003", "order": 3, "role": "body", "text": "As usual, the 36-year-old Paul was the maestro making big plays in the final minutes to close out the Clippers. He hit a crucial 3-pointer and had five assists in the fourth quarter."}
{"game_id": "0022100581", "chunk_id": "0022100581_004", "order": 4, "role": "body", "text": "“Some teams' biggest issue is that they don't know what they want to run or who they want to go to down the stretch,\" Paul said. “I think we have a good sense of that. We know what our go-to plays are.”"}
{"game_id": "0022100581", "chunk_id": "0022100581_005", "order": 5, "role": "body", "text": "The Suns moved a game ahead of Golden State for the best record in the league. They’ve won three straight and four of five. That's despite several players missing considerable time this season, including All-Star guard Devin Booker."}
{"game_id": "0022100581", "chunk_id": "0022100581_006", "order": 6, "role": "body", "text": "“I just think the players have done a really good job of driving our culture,” Suns coach Monty Williams said. “We have unreal guard play, which really helps.”"}
{"game_id": "0022100581", "chunk_id": "0022100581_007", "order": 7, "role": "body", "text": "Paul continues to look 26 years old instead of 36, doing a little of everything to keep the Suns among the league's elite. His 13 rebounds were a career high in his 1,128th regular-season NBA game."}
{"game_id": "0022100581", "chunk_id": "0022100581_008", "order": 8, "role": "body", "text": "Cam Johnson added a career-high 24 points, and Jalen Smith — the second-year forward whose playing time has drastically increased recently because of the Suns’ COVID-19 issues — had another good game with 19 points and 14 rebounds."}
{"game_id": "0022100581", "chunk_id": "0022100581_009", "order": 9, "role": "body", "text": "“We're having a lot of fun playing together,” Johnson said. “Things are starting to click.”"}
{"game_id": "0022100581", "chunk_id": "0022100581_010", "order": 10, "role": "body", "text": "Those performances helped offset a tough night for Booker, who shot just 5 of 22 from the field and finished with 11 points. He was 0 of 7 on 3-pointers."}
{"game_id": "0022100581", "chunk_id": "0022100581_011", "order": 11, "role": "body", "text": "Williams said center Deandre Ayton, forward Jae Crowder and JaVale McGee have all cleared the league’s COVID-19 protocols, but were held out of the game as they work their way back into shape. Guard Landry Shamet is still in the protocol."}
{"game_id": "0022100581", "chunk_id": "0022100581_012", "order": 12, "role": "body", "text": "The Clippers dropped below .500 at 19-20 despite a season-high 26 points from former Suns forward Marcus Morris Sr. Reggie Jackson added 16. The Clippers were missing guards Luke Kennard and Xavier Moon, along with center Ivica Zubac, because of COVID-19 protocols."}
{"game_id": "0022100581", "chunk_id": "0022100581_013", "order": 13, "role": "body", "text": "“We scraped and competed,” Clippers coach Ty Lue said. “That is a good ball club over there and they played well. Their stars took over down the stretch and took over the game.”"}
{"game_id": "0022100581", "chunk_id": "0022100581_014", "order": 14, "role": "body", "text": "The Suns led by 17 points midway through the third quarter, but the Clippers cut it to 73-66 in the next few minutes. The Suns took a 75-66 lead into the final quarter."}
{"game_id": "0022100581", "chunk_id": "0022100581_015", "order": 15, "role": "body", "text": "The Clippers pulled to 79-76 with 8:36 left when Amir Coffey converted a three-point play after making a layup while being fouled. But the Suns responded with the next six points and slowly pulled away."}
{"game_id": "0022100581", "chunk_id": "0022100581_016", "order": 16, "role": "body", "text": "The Suns jumped out to a 56-40 halftime lead after outscoring the Clippers by 15 in the second quarter. Johnson led the Suns with 17 points before the break. Morris had 13 for the Clippers."}
{"game_id": "0022100581", "chunk_id": "0022100581_018", "order": 18, "role": "body", "text": "Suns: F Bismack Biyombo played his third game for the Suns and his first at home. The 11-year veteran was signed last week because the Suns were thin in the frontcourt. He finished with three rebounds in 13 minutes. ... The Suns had a season-high 63 rebounds."}
{"game_id": "0022100581", "chunk_id": "0022100581_019", "order": 19, "role": "body", "text": "Clippers: G Brandon Boston Jr. was back on the court after spending time in the COVID-19 protocol. ... L.A. shot just 3 of 18 (17%) from 3-point range in the first half."}
{"game_id": "0022100581", "chunk_id": "0022100581_021", "order": 21, "role": "body", "text": "Clippers: Host Memphis on Saturday."}
{"game_id": "0022100581", "chunk_id": "0022100581_022", "order": 22, "role": "body", "text": "Suns: Host Miami on Saturday night"}
