{"game_id": "0022100809", "chunk_id": "0022100809_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — While most teams are looking ahead to next week's All-Star break, Giannis Antetokounmpo and the Milwaukee Bucks are trying to correct some bad habits they hope won't trip them up in the playoffs."}
{"game_id": "0022100809", "chunk_id": "0022100809_002", "order": 2, "role": "body", "text": "If the first two games of their Western Conference road trip are any indication, the defending NBA champions are on the right track."}
{"game_id": "0022100809", "chunk_id": "0022100809_003", "order": 3, "role": "body", "text": "The Bucks had another dominating third quarter as they pulled away to beat the Los Angeles Clippers 137-113 Sunday night."}
{"game_id": "0022100809", "chunk_id": "0022100809_004", "order": 4, "role": "body", "text": "“I enjoy playing in January and February. This is where you have to get some wins, come out, set a tone and play good games,” said Antetokounmpo, who had 28 points and 10 rebounds. “The last couple games have been fun. Guys are playing and shooting well.”"}
{"game_id": "0022100809", "chunk_id": "0022100809_005", "order": 5, "role": "body", "text": "Antetokounmpo was one of three players with a double-double. Los Angeles native and former UCLA standout Jrue Holiday added 27 points and 13 assists and Bobby Portis had 24 points with 11 rebounds."}
{"game_id": "0022100809", "chunk_id": "0022100809_006", "order": 6, "role": "body", "text": "It is the first time since last April the Bucks have had three players with at least 24 points in a regular-season game."}
{"game_id": "0022100809", "chunk_id": "0022100809_007", "order": 7, "role": "body", "text": "One of the bad habits the Bucks are trying to put behind them are awful third quarters. They had been outscored in 16 of 19 games in the third before the road trip, but have had the advantage in two straight games for the first time since late December."}
{"game_id": "0022100809", "chunk_id": "0022100809_008", "order": 8, "role": "body", "text": "Milwaukee led 60-53 early in the third before it went on a 19-3 run over a 2 1/2 minute span to put the game out of reach. Pat Connaughton made four of his six 3-pointers during the spurt and Middleton scored five points."}
{"game_id": "0022100809", "chunk_id": "0022100809_009", "order": 9, "role": "body", "text": "“We were able to do good things on both ends,” said Bucks coach Mike Budenholzer about the third quarter. “Pat started getting hot and went on a run that was pretty incredible. The running, transition and spacing was good.”"}
{"game_id": "0022100809", "chunk_id": "0022100809_010", "order": 10, "role": "body", "text": "The Clippers went on a 17-2 run late in the third and early in the fourth to get within nine, before the Bucks responded with a pair of spurts over the remaining nine minutes. Milwaukee's largest lead was 26 points late in the fourth quarter as they won for the seventh time in nine games."}
{"game_id": "0022100809", "chunk_id": "0022100809_011", "order": 11, "role": "body", "text": "The Bucks — who tied a season high in points — shot 54.5% from the field (48 of 88) and were 19 of 38 from beyond the arc."}
{"game_id": "0022100809", "chunk_id": "0022100809_012", "order": 12, "role": "body", "text": "Norman Powell, who was acquired in a five-player trade with Portland on Friday, had 28 points in his Clippers debut and Marcus Morris Sr. scored 20 points along with eight rebounds. Robert Covington, who was also acquired in the deal, had 13 points."}
{"game_id": "0022100809", "chunk_id": "0022100809_013", "order": 13, "role": "body", "text": "Coach Tyronn Lue said the Bucks had too much for the Clippers, but was pleased with how his new players performed in spite of no practice."}
{"game_id": "0022100809", "chunk_id": "0022100809_014", "order": 14, "role": "body", "text": "“Norm attacked the basket and Covington provided defense and energy. There are some things we have to tweak but I thought they did a good job,” Lue said."}
{"game_id": "0022100809", "chunk_id": "0022100809_015", "order": 15, "role": "body", "text": "Powell, who went to UCLA and grew up in San Diego, didn't expect to be traded, but said he was happy to be back closer to home."}
{"game_id": "0022100809", "chunk_id": "0022100809_016", "order": 16, "role": "body", "text": "“They have a good thing going here, they fight, they compete. Like tonight, we fought, got it to single digits,\" he said. “I like that. I love a team that’s like that. I’m a grinder, I think I fit perfectly here.”"}
{"game_id": "0022100809", "chunk_id": "0022100809_017", "order": 17, "role": "body", "text": "The Clippers led 32-28 at the end of the first quarter and scored the first five points of the second quarter before the Bucks tied it at 37 with nine straight points."}
{"game_id": "0022100809", "chunk_id": "0022100809_018", "order": 18, "role": "body", "text": "Milwaukee had a 53-49 lead before scoring seven of the final nine points of the first half to take a 60-51 advantage at halftime."}
{"game_id": "0022100809", "chunk_id": "0022100809_020", "order": 20, "role": "body", "text": "Bucks: Milwaukee is 17-0 this season when scoring at least 120 points and 10-0 when shooting 50% or better as a team. ... Khris Middleton scored six of his 17 points in the first quarter. ... Grayson Allen was a late addition to Sunday's injury report with hip soreness and did not play after testing it out pregame."}
{"game_id": "0022100809", "chunk_id": "0022100809_021", "order": 21, "role": "body", "text": "Clippers: Ivica Zubac returned after missing two games due to a calf injury and scored 10 points. ... Reggie Jackson and Amir Coffey each scored 10 points and were a combined 7 of 23 from the field."}
{"game_id": "0022100809", "chunk_id": "0022100809_023", "order": 23, "role": "body", "text": "Bucks: Remain in Los Angeles to face the Lakers on Tuesday night."}
{"game_id": "0022100809", "chunk_id": "0022100809_024", "order": 24, "role": "body", "text": "Clippers: Begin a three-game trip at Memphis on Tuesday night."}
