{"game_id": "0022100482", "chunk_id": "0022100482_001", "order": 1, "role": "lead", "text": "DENVER -- — Kelly Oubre Jr., P.J. Washington and the Charlotte reserves helped recapture the momentum with their early fourth-quarter spurt."}
{"game_id": "0022100482", "chunk_id": "0022100482_002", "order": 2, "role": "body", "text": "Only fitting they got to finish it, too."}
{"game_id": "0022100482", "chunk_id": "0022100482_003", "order": 3, "role": "body", "text": "Washington hit three big 3-pointers down the stretch, Oubre scored 14 of his 23 points in the final quarter and the Hornets overcame a 19-point deficit to beat the Denver Nuggets 115-107 on Thursday night."}
{"game_id": "0022100482", "chunk_id": "0022100482_004", "order": 4, "role": "body", "text": "Will Barton’s step-back shot gave the Nuggets a 90-71 advantage late in the third — the first of three times the Nuggets pushed the advantage to 19 — before the Hornets rallied. Washington tied it at 99 on a 3-pointer with 5:30 remaining and gave the Hornets the lead for good on another 3 with 1:20 left."}
{"game_id": "0022100482", "chunk_id": "0022100482_005", "order": 5, "role": "body", "text": "Jalen McDaniels had a dunk and Ish Smith a 3-pointer to help the Hornets end a six-game trip with a 2-4 mark. Oubre, Washington, McDaniels and Smith all played the entire fourth quarter, with Charlotte outscoring Denver 38-13."}
{"game_id": "0022100482", "chunk_id": "0022100482_006", "order": 6, "role": "body", "text": "“A feel thing,” Hornets coach James Borrego explained. “I thought that group deserved to finish the game out. They were ready and capable of finishing that game.”"}
{"game_id": "0022100482", "chunk_id": "0022100482_007", "order": 7, "role": "body", "text": "The comeback overshadowed a big night from reigning MVP Nikola Jokic, who had 29 points and 21 rebounds — one away from tying his career high."}
{"game_id": "0022100482", "chunk_id": "0022100482_008", "order": 8, "role": "body", "text": "Oubre fueled the run with big bucket after big bucket in the final quarter, including a four-point play."}
{"game_id": "0022100482", "chunk_id": "0022100482_009", "order": 9, "role": "body", "text": "“We just wanted it more,” Oubre said."}
{"game_id": "0022100482", "chunk_id": "0022100482_010", "order": 10, "role": "body", "text": "On Wednesday night at Oklahoma City, Nuggets coach Michael Malone wasn't pleased with his starters and didn't play them in the fourth quarter in a 108-94 loss."}
{"game_id": "0022100482", "chunk_id": "0022100482_011", "order": 11, "role": "body", "text": "In this game, he inserted the starters to try and gain back control, but they couldn't. The Nuggets drop to 1-5 on the second night of a back-to-back."}
{"game_id": "0022100482", "chunk_id": "0022100482_012", "order": 12, "role": "body", "text": "“It’s easy to see what happened — the ball stopped moving,” Malone said. “It became an isocentric, over-dribbling, everybody trying to get theirs, and that led to poor offensive possessions, which fueled their break.”"}
{"game_id": "0022100482", "chunk_id": "0022100482_013", "order": 13, "role": "body", "text": "Would he characterize it as selfish pay?"}
{"game_id": "0022100482", "chunk_id": "0022100482_014", "order": 14, "role": "body", "text": "“I didn’t say that,” Malone said. “Don’t put words in my mouth. We just stopped moving the ball.”"}
{"game_id": "0022100482", "chunk_id": "0022100482_015", "order": 15, "role": "body", "text": "This wasn't the sort of mark the Nuggets wanted to equal: They matched the largest blown lead at the end of three quarters (17 points) in franchise history, according to the team. They were also up 17 heading into the fourth against Minnesota on Feb. 5, 2000."}
{"game_id": "0022100482", "chunk_id": "0022100482_016", "order": 16, "role": "body", "text": "“They were more aggressive than us,” Jokic said. \"They deserved to win.”"}
{"game_id": "0022100482", "chunk_id": "0022100482_018", "order": 18, "role": "body", "text": "Hornets: F Cody Martin was ruled out for a third straight game (health and safety protocols). ... Terry Rozier added 17 points and Miles Bridges and LaMelo Ball each had 16. Washington had 13."}
{"game_id": "0022100482", "chunk_id": "0022100482_019", "order": 19, "role": "body", "text": "Nuggets: F Aaron Gordon didn't play (left hamstring soreness). ... G Facundo Campazzo picked up a technical foul in the first quarter. He had 12 points. ... Austin Rivers, Jeff Green, Vlatko Cancar and Will Barton all had 11 points."}
{"game_id": "0022100482", "chunk_id": "0022100482_021", "order": 21, "role": "body", "text": "The thing Washington was looking forward to the most upon returning home?"}
{"game_id": "0022100482", "chunk_id": "0022100482_022", "order": 22, "role": "body", "text": "“Sleep in my own bed,” Washington said. “We’re excited to close that one out.”"}
{"game_id": "0022100482", "chunk_id": "0022100482_024", "order": 24, "role": "body", "text": "Hornets center Mason Plumlee knows Jokic well, spending plenty of time defending him in practice while playing for the Nuggets from 2016-20."}
{"game_id": "0022100482", "chunk_id": "0022100482_025", "order": 25, "role": "body", "text": "“I said, ‘What’s the secret?’” Borrego cracked. “(Plumlee) knows all the little tricks.”"}
{"game_id": "0022100482", "chunk_id": "0022100482_026", "order": 26, "role": "body", "text": "Jokic had 16 rebounds in the first half."}
{"game_id": "0022100482", "chunk_id": "0022100482_028", "order": 28, "role": "body", "text": "All alone on a fast break in the first quarter, Rozier  lobbed a pass off the backboard to Bridges for an easy slam. Rozier later had a nifty pass to McDaniels for an alley-oop dunk."}
{"game_id": "0022100482", "chunk_id": "0022100482_030", "order": 30, "role": "body", "text": "While spending a few days in Denver, Borrego said he ate his fill of green chile."}
{"game_id": "0022100482", "chunk_id": "0022100482_031", "order": 31, "role": "body", "text": "“Hatch green chile — it just gets the heart pumping,” he said. “Gets the mind working. It calms your spirit and gets you ready to move on.”"}
{"game_id": "0022100482", "chunk_id": "0022100482_033", "order": 33, "role": "body", "text": "Count Malone as a fan of Ball's play."}
{"game_id": "0022100482", "chunk_id": "0022100482_034", "order": 34, "role": "body", "text": "“He’s one of those guys that can really hurt you with his scoring, his shooting, his downhill drives, but also his playmaking,” Malone said. “That’s why he’s a complete player, and one of the more exciting young players in the league.”"}
{"game_id": "0022100482", "chunk_id": "0022100482_036", "order": 36, "role": "body", "text": "Hornets: Host Houston on Monday night."}
{"game_id": "0022100482", "chunk_id": "0022100482_037", "order": 37, "role": "body", "text": "Nuggets: At Los Angeles Clippers on Sunday night."}
