{"game_id": "0022100674", "chunk_id": "0022100674_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Giannis Antetokounmpo had 33 points and 15 rebounds, and Khris Middleton scored 27 to lead the Milwaukee Bucks to a 126-114 victory over the short-handed Memphis Grizzlies on Wednesday night."}
{"game_id": "0022100674", "chunk_id": "0022100674_002", "order": 2, "role": "body", "text": "Memphis, which had won 12 of 13, was without two of its leading scorers in Dillon Brooks and Desmond Bane. Brooks, averaging 18.4 points per game, sat out with a left ankle sprain, while Bane (17.7 ppg) was in the NBA’s health and safety protocol."}
{"game_id": "0022100674", "chunk_id": "0022100674_003", "order": 3, "role": "body", "text": "Ja Morant had 33 points and 14 assists, and Jaren Jackson Jr. scored 29 for Memphis in the opener of a four-game road swing. Without Bane, sixth in the NBA with 131 3-pointers, the Grizzlies were just 9 of 40 beyond the arc."}
{"game_id": "0022100674", "chunk_id": "0022100674_004", "order": 4, "role": "body", "text": "Morant capped a seven-point run with a drive down the lane to pull the Grizzlies to 114-111 with 2:32 left, but George Hill hit two free throws and Antetokounmpo scored six straight to make it 122-111."}
{"game_id": "0022100674", "chunk_id": "0022100674_005", "order": 5, "role": "body", "text": "“I think just his ability to do it different ways,” Bucks coach Mike Budenholzer said about Antetokounmpo. “I think also including he’s getting to the line, he’s making free throws. His ability to kind of get to his spots in the post with a variety of moves ... and then I think of him as a playmaker, as a passer. That’s what makes him special. We’re fortunate to have him.”"}
{"game_id": "0022100674", "chunk_id": "0022100674_006", "order": 6, "role": "body", "text": "Hill and Bobby Portis each scored 14 points for Milwaukee, which had dropped six of eight."}
{"game_id": "0022100674", "chunk_id": "0022100674_007", "order": 7, "role": "body", "text": "Memphis pulled within 96-89 to open the fourth quarter, but De’Anthony Melton missed a pair of free throws. The Bucks responded with a layup by Hill and Middleton’s baseline jumper to make it 102-91."}
{"game_id": "0022100674", "chunk_id": "0022100674_008", "order": 8, "role": "body", "text": "Middleton’s 3-pointer put the Bucks up 108-93 with just under seven minutes remaining."}
{"game_id": "0022100674", "chunk_id": "0022100674_009", "order": 9, "role": "body", "text": "“Great resiliency from our guys,” Grizzlies coach Taylor Jenkins. “Credit the Bucks, they played great tonight. They were hitting on all cylinders, especially in that first half. When we tried to make our run there in the third quarter, they had a response. Every time we scored, they scored."}
{"game_id": "0022100674", "chunk_id": "0022100674_010", "order": 10, "role": "body", "text": "“For our guys to dig down in that fourth quarter and keep fighting, we’ve got a lot of different guys playing different roles right now. Our activity was great when we needed it to cut it down to three, a one-possession game, just couldn’t get enough stops there late in the game.”"}
{"game_id": "0022100674", "chunk_id": "0022100674_011", "order": 11, "role": "body", "text": "The Bucks led 73-59 when Antetokounmpo picked up his fourth foul with 8:30 left in the third quarter, but the Grizzlies were unable to capitalize. Milwaukee led 88-75 when Antetokounmpo returned after five minutes."}
{"game_id": "0022100674", "chunk_id": "0022100674_012", "order": 12, "role": "body", "text": "Milwaukee went 9 of 19 from beyond the arc in the first half en route to a 61-47 lead at the break. The Grizzlies were 4 for 23 from 3-point range."}
{"game_id": "0022100674", "chunk_id": "0022100674_013", "order": 13, "role": "body", "text": "Antetokounmpo had 15 points, including a pair of 3s, to help the Bucks to a 36-30 lead after one quarter."}
{"game_id": "0022100674", "chunk_id": "0022100674_014", "order": 14, "role": "body", "text": "Morant shot 12 of 27, including 4 of 10 on 3s, and matched his career high for assists."}
{"game_id": "0022100674", "chunk_id": "0022100674_015", "order": 15, "role": "body", "text": "“I’ve liked him since he came into the league,” Antetokounmpo said. “Unbelievable player, plays the right way. He’s getting better each year. He’s getting his teammates involved. He’s building a great culture with Coach Taylor in Memphis. They’re a young team, a great team. The future is bright for his team and for himself, also. But, he’s been playing great. He’s one of the best point guards in the league, in my opinion.”"}
{"game_id": "0022100674", "chunk_id": "0022100674_017", "order": 17, "role": "body", "text": "Memphis signed G Shaquille Harrison to a 10-day contract under the NBA’s COVID-19-related hardship exception. Harrison (6-foot-4, 195 pounds) has appeared in 175 games over five seasons with Phoenix, Chicago, Utah, Denver and Brooklyn, averaging 5.2 points. He played in two games for the Nets earlier this season."}
{"game_id": "0022100674", "chunk_id": "0022100674_019", "order": 19, "role": "body", "text": "Jenkins returned after missing six games due to health and safety protocols. The Grizzlies were 5-1 in his absence under assistants Brad Jones and Darko Rajakovic."}
{"game_id": "0022100674", "chunk_id": "0022100674_021", "order": 21, "role": "body", "text": "Grizzlies: PG Tyrus Jones was added to the health and safety protocols list, joining F Kyle Anderson, Bane and F-C Killian Tillie."}
{"game_id": "0022100674", "chunk_id": "0022100674_022", "order": 22, "role": "body", "text": "Bucks: G Jrue Holiday, who missed the previous six games (one in health and safety protocols, five with a left ankle injury) was active after working out before the game. He entered with 5:04 left in the first quarter. The Bucks were 2-4 during his most recent absence, and 4-9 overall in games he’s missed. Holiday played 22 minutes, scoring nine points on 2-of-8 shooting with four assists and five rebounds."}
{"game_id": "0022100674", "chunk_id": "0022100674_024", "order": 24, "role": "body", "text": "Grizzlies: At the Denver Nuggets on Friday."}
{"game_id": "0022100674", "chunk_id": "0022100674_025", "order": 25, "role": "body", "text": "Bucks: Host the Chicago Bulls on Friday."}
