{"game_id": "0022100178", "chunk_id": "0022100178_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Devin Booker and Jae Crowder scored 17 points each, Chris Paul added 15 points and 12 assists as the Phoenix Suns dominated the Memphis Grizzlies 119-94 on Friday night for their seventh straight victory."}
{"game_id": "0022100178", "chunk_id": "0022100178_002", "order": 2, "role": "body", "text": "Mikal Bridges had 13 points as the defending Western Conference champion Suns controlled the game throughout, never trailing. Phoenix held a double-digit lead from the late stages of the first quarter through the end of the game."}
{"game_id": "0022100178", "chunk_id": "0022100178_003", "order": 3, "role": "body", "text": "“I think our defense was very, very, very good tonight,” Crowder said. “It was no coincidence we were able to get out to a good lead.”"}
{"game_id": "0022100178", "chunk_id": "0022100178_004", "order": 4, "role": "body", "text": "Crowder said the key was to make the Grizzlies face multiple defenders."}
{"game_id": "0022100178", "chunk_id": "0022100178_005", "order": 5, "role": "body", "text": "“Show a crowd,\" he said. \"Make these guys play in a crowd, and I think we did a good job of that.”"}
{"game_id": "0022100178", "chunk_id": "0022100178_006", "order": 6, "role": "body", "text": "Ja Morant led Memphis with 26 points, 12 rebounds and six assists, and Jaren Jackson Jr. had 19 points. The Grizzlies shot 38%, making only 7 of 33 3-point attempts."}
{"game_id": "0022100178", "chunk_id": "0022100178_007", "order": 7, "role": "body", "text": "But the defensive effort was as much a concern as the poor shooting."}
{"game_id": "0022100178", "chunk_id": "0022100178_008", "order": 8, "role": "body", "text": "“We need to get back to enjoying playing defense and flying around for 48 minutes,” said forward Desmond Bane, who had eight rebounds to go with nine points. “I feel like our defense has let us down in the games we lose.”"}
{"game_id": "0022100178", "chunk_id": "0022100178_009", "order": 9, "role": "body", "text": "Phoenix’s defense contributed to a poor shooting first half for Memphis. The Grizzlies managed only 37% shooting in the half, and Memphis was 3 of 12 from outside the arc. Nine turnovers only made matters worse for the Grizzlies."}
{"game_id": "0022100178", "chunk_id": "0022100178_010", "order": 10, "role": "body", "text": "That trend continued in the second half."}
{"game_id": "0022100178", "chunk_id": "0022100178_011", "order": 11, "role": "body", "text": "“Defensively, to hold a team to 23 points or less in a quarter, that’s hard to do in the NBA,” Suns coach Monty Williams said, noting his team gave up 30 points when reserves played most of the fourth quarter. “I thought our intensity was in a really good place.”"}
{"game_id": "0022100178", "chunk_id": "0022100178_012", "order": 12, "role": "body", "text": "Meanwhile, Phoenix was shooting better than 50% for most of the first half as Paul scored 13 points and missed only one of his seven shots to help the Suns to a 19-point halftime lead. The lead reached 38 in the third."}
{"game_id": "0022100178", "chunk_id": "0022100178_013", "order": 13, "role": "body", "text": "“We’ve got two versions of the Grizzlies,” Memphis coach Taylor Jenkins said. “The six wins, we’ve played disciplined basketball. We made shots. We do what we need to do defensively."}
{"game_id": "0022100178", "chunk_id": "0022100178_014", "order": 14, "role": "body", "text": "“And then the ones where we’ve gotten smacked, our defense hasn’t been disciplined, and we’ve missed a lot of shots.”"}
{"game_id": "0022100178", "chunk_id": "0022100178_016", "order": 16, "role": "body", "text": "Suns: C Deandre Ayton remained out, missing his fourth game with a right lower leg contusion. JaVale McGee started in Ayton’s place, as he has since Ayton has been out of action. … Landry Shamet returned after missing a game with a right foot contusion. …Crowder had a season-high five 3-pointers. … Booker drew a technical foul in the third quarter. …Phoenix made 18 3-pointers – a season high."}
{"game_id": "0022100178", "chunk_id": "0022100178_017", "order": 17, "role": "body", "text": "Grizzlies: Dillon Brooks, who saw his first action of the season Wednesday in a loss to Charlotte, was out recovering from the left hand fracture that caused him to missed the first 10 games. … Bane connected on a 3-pointer in the second quarter, ending a string of 17 straight misses from outside the arc."}
{"game_id": "0022100178", "chunk_id": "0022100178_019", "order": 19, "role": "body", "text": "Williams spoke highly of Morant’s ability to get to the paint with his speed and “controlled athleticism.” But Williams noted that people overlook another part of the Grizzlies point guard’s game. “He probably doesn’t get enough credit for his passing,” Williams said. “When you’re going that fast, to be able to put a pass on time and on target is a skill.”"}
{"game_id": "0022100178", "chunk_id": "0022100178_021", "order": 21, "role": "body", "text": "Suns: At Houston on Sunday night."}
{"game_id": "0022100178", "chunk_id": "0022100178_022", "order": 22, "role": "body", "text": "Grizzlies: At New Orleans on Saturday night."}
