{"game_id": "0022100977", "chunk_id": "0022100977_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — DeAndre Ayton and Landry Shamet scored 21 points each and Mikal Bridges blocked a potential tying 3-pointer in the final seconds to help the Phoenix Suns hold off the Orlando Magic 102-99 Tuesday night."}
{"game_id": "0022100977", "chunk_id": "0022100977_002", "order": 2, "role": "body", "text": "After Cameron Payne's two free throws put the Suns up by three with 6.9 seconds left, Orlando's Franz Wagner put up a 3-pointer that Bridges deflected."}
{"game_id": "0022100977", "chunk_id": "0022100977_003", "order": 3, "role": "body", "text": "Ayton had 19 rebounds and scored the Suns' final two baskets, including a putback with 1:31 left after Orlando had taken a 98-97 lead."}
{"game_id": "0022100977", "chunk_id": "0022100977_004", "order": 4, "role": "body", "text": "Payne finished with 18 points and 12 assists. In three starts with Shamet while the Suns are playing without injured All-Star guards Chris Paul and Devin Booker, Payne has 58 points and 36 assists. Payne gave a lot of the credit to Shamet."}
{"game_id": "0022100977", "chunk_id": "0022100977_005", "order": 5, "role": "body", "text": "“Six 3s tonight, that's big-time,” Payne said. “Landry's been playing big-time and we've got to keep this going when Book comes back. I know I've been getting a lot of assists, but the credit goes to the guys making the shots.”"}
{"game_id": "0022100977", "chunk_id": "0022100977_006", "order": 6, "role": "body", "text": "All six of Shamet's field goals came from behind the arc."}
{"game_id": "0022100977", "chunk_id": "0022100977_007", "order": 7, "role": "body", "text": "“Everybody on the team tells him to shoot. Tonight it was impressive to see him step up and make big shot after big shot,” coach Monty Williams said. “This (new backcourt) develops a capacity for us to grow as a team. That's something that could pay off for us later on.”"}
{"game_id": "0022100977", "chunk_id": "0022100977_008", "order": 8, "role": "body", "text": "Wendell Carter Jr. led Orlando with 20 points and had 12 rebounds. Mo Bamba had nine points and 15 boards."}
{"game_id": "0022100977", "chunk_id": "0022100977_009", "order": 9, "role": "body", "text": "Bad shooting — 38% overall and 7 for 39 from 3-point range — cost the Magic (16-50) a chance to upset the team with the NBA's best record (52-13)."}
{"game_id": "0022100977", "chunk_id": "0022100977_010", "order": 10, "role": "body", "text": "\"I'm proud of our guys for the way we competed all night long, but it's more about what we did defensively,\" coach Jamahl Mosley said. “When you're shooting 18% from the 3-point line ... we weren't able to make shots, but we still had an opportunity to win the game.”"}
{"game_id": "0022100977", "chunk_id": "0022100977_011", "order": 11, "role": "body", "text": "Carter scored nine points on a 15-0 run that lifted the Magic to a 17-14 lead, but the Suns responded with 11 straight points. A 3-pointer by Mo Wagner brought Orlando within 38-37 late in the first half, but Payne scored 10 straight points, then set up Ayton's layup that made it 60-45, the biggest lead of the game."}
{"game_id": "0022100977", "chunk_id": "0022100977_012", "order": 12, "role": "body", "text": "“We're getting more confident playing off of each other, especially early in the game,” Shamet said. “Everything was natural, fluid. We were playing out of our stuff and getting great looks. So we're getting there.”"}
{"game_id": "0022100977", "chunk_id": "0022100977_013", "order": 13, "role": "body", "text": "Markelle Fultz, playing in only his fourth game after missing 14 months with a torn ACL, helped the Magic stay in it with eight points and two assists in the third quarter. He finished with 11 points and four assists."}
{"game_id": "0022100977", "chunk_id": "0022100977_014", "order": 14, "role": "body", "text": "Cole Anthony's layup with 3:25 left pulled Orlando even, and Carter's two free throws with 1:51 remaining gave the Magic their only lead of the second half."}
{"game_id": "0022100977", "chunk_id": "0022100977_016", "order": 16, "role": "body", "text": "Suns: Booker missed a fourth game due to the health and safety protocols. Paul has missed seven games with a broken thumb... F Cameron Johnson missed a second game with a bruised right quad. ... A fan got into a profane shouting match with the Suns bench during he fourth quarter and was thrown out. “Fans tend to forget sometimes that it's real life out there, it's not a zoo,” Shamet said."}
{"game_id": "0022100977", "chunk_id": "0022100977_017", "order": 17, "role": "body", "text": "Magic: Anthony left the game in the third quarter after taking Bamba's elbow to the face, but he returned in the fourth. ... G Jalen Suggs missed a second straight game with a sprained right ankle."}
{"game_id": "0022100977", "chunk_id": "0022100977_019", "order": 19, "role": "body", "text": "Suns: Play at Miami on Wednesday night."}
{"game_id": "0022100977", "chunk_id": "0022100977_020", "order": 20, "role": "body", "text": "Magic: Play at New Orleans on Wednesday night."}
