{"game_id": "0022100012", "chunk_id": "0022100012_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Nikola Jokic was up to his old tricks Wednesday night, scoring on a crafty array of hook shots, 3-pointers and flat-footed jumpers."}
{"game_id": "0022100012", "chunk_id": "0022100012_002", "order": 2, "role": "body", "text": "In short, the reigning MVP still looks a lot like an MVP."}
{"game_id": "0022100012", "chunk_id": "0022100012_003", "order": 3, "role": "body", "text": "The 6-foot-11 Serbian poured in 27 points and grabbed 13 rebounds, leading the Denver Nuggets past the Phoenix Suns 110-98 in the opener for both teams. The Nuggets recovered from a 16-point deficit late in the second quarter and held the Suns to just 40 points in the second half."}
{"game_id": "0022100012", "chunk_id": "0022100012_004", "order": 4, "role": "body", "text": "“It's a hell of a way to start the season,” Denver coach Michael Malone said. “But it's one game, 81 left.”"}
{"game_id": "0022100012", "chunk_id": "0022100012_005", "order": 5, "role": "body", "text": "The 26-year-old Jokic earned his first NBA MVP award last season after averaging 26.4 points, 10.8 rebounds and 8.3 assists per game. He was 13 of 22 from the field on Wednesday, providing a few crucial buckets in the fourth quarter to turn back a Suns rally."}
{"game_id": "0022100012", "chunk_id": "0022100012_006", "order": 6, "role": "body", "text": "Malone said it's obvious that Jokic continues to be an elite player. Now the coach is pushing Jokic to become a leader and wants his star's voice heard in the huddle during every timeout."}
{"game_id": "0022100012", "chunk_id": "0022100012_007", "order": 7, "role": "body", "text": "“Early in his career, he was growing up, maturing, handling adversity and handling the refs,” Malone said. “He's done that. He's really improved.”"}
{"game_id": "0022100012", "chunk_id": "0022100012_008", "order": 8, "role": "body", "text": "The Suns were playing three months after losing Game 6 of the NBA Finals to the Milwaukee Bucks. Phoenix has returned much of the same roster, including the All-Star backcourt of Chris Paul and Devin Booker, to make another run at the title."}
{"game_id": "0022100012", "chunk_id": "0022100012_009", "order": 9, "role": "body", "text": "The teams were playing for the first time since the Suns swept the Nuggets in four games in the second round of last season's Western Conference playoffs."}
{"game_id": "0022100012", "chunk_id": "0022100012_010", "order": 10, "role": "body", "text": "This time, it was Denver with the upper hand. Will Barton scored 20 points and Michael Porter Jr. added 15."}
{"game_id": "0022100012", "chunk_id": "0022100012_011", "order": 11, "role": "body", "text": "Mikal Bridges led Phoenix with 16 points. Paul had 15 points and 10 assists. The Suns struggled with their shooting in the fourth quarter, going nearly five minutes without scoring as the Nuggets took control. Denver's Aaron Gordon had a huge chase-down block during that drought, swatting Booker's layup into the stands behind the Nuggets' bench."}
{"game_id": "0022100012", "chunk_id": "0022100012_012", "order": 12, "role": "body", "text": "“It's definitely one we wanted to get,” Gordon said. “Start off on the right foot and you know, a little payback. We'll see them again. It's just one game.”"}
{"game_id": "0022100012", "chunk_id": "0022100012_013", "order": 13, "role": "body", "text": "Phoenix led 58-51 at halftime following a seesaw first half that saw the Nuggets take an early 25-16 advantage before the Suns rallied for a 57-41 lead late in the second. Denver had a late flurry — capped by Jokic's 3-pointer at the buzzer — to cut the margin to seven points."}
{"game_id": "0022100012", "chunk_id": "0022100012_014", "order": 14, "role": "body", "text": "“We missed a ton of shots, put them in transition and our transition defense was below our standard,” Suns coach Monty Williams said."}
{"game_id": "0022100012", "chunk_id": "0022100012_016", "order": 16, "role": "body", "text": "It was Deandre Ayton's first game since the Suns opted not to extend the former No. 1 overall draft pick's rookie contract by Monday's deadline."}
{"game_id": "0022100012", "chunk_id": "0022100012_017", "order": 17, "role": "body", "text": "Ayton reportedly wanted a maximum deal, which would have been five years and worth $172 million. The Suns weren't willing to do that deal — at least not before the season — and the two sides ended negotiations without an agreement."}
{"game_id": "0022100012", "chunk_id": "0022100012_018", "order": 18, "role": "body", "text": "The 23-year-old Ayton changed the trajectory of his career during last year's playoffs, helping push the Suns to the NBA Finals. He contributed 15.8 points and 11.8 rebounds per game while shooting 66% and providing stellar defense."}
{"game_id": "0022100012", "chunk_id": "0022100012_019", "order": 19, "role": "body", "text": "Ayton started with a flourish on Wednesday, leading the Suns with 13 points in the first half. He finished with 15 points and six rebounds."}
{"game_id": "0022100012", "chunk_id": "0022100012_021", "order": 21, "role": "body", "text": "The Suns changed their arena name from Phoenix Suns Arena to the Footprint Center — which is a sustainable technology firm that took over as title sponsor — midway through last year's NBA Finals."}
{"game_id": "0022100012", "chunk_id": "0022100012_022", "order": 22, "role": "body", "text": "The new name is not off to a good start. They're now 0-2 with the name, losing Game 5 of the Finals and Wednesday's opener."}
{"game_id": "0022100012", "chunk_id": "0022100012_024", "order": 24, "role": "body", "text": "Nuggets: G Jamal Murray was working out before the game, putting up shots. He's rehabbing a torn ACL in his left knee sustained last season. ... Six Nuggets scored in double figures."}
{"game_id": "0022100012", "chunk_id": "0022100012_025", "order": 25, "role": "body", "text": "Suns: Though most of the roster is the same, G Landry Shamet and C JaVale McGee both made their Suns debuts. Shamet finished with 11 points and McGee added six points and eight rebounds."}
{"game_id": "0022100012", "chunk_id": "0022100012_027", "order": 27, "role": "body", "text": "Nuggets: Host San Antonio on Friday night."}
{"game_id": "0022100012", "chunk_id": "0022100012_028", "order": 28, "role": "body", "text": "Suns: At the Los Angeles Lakers on Friday night."}
