{"game_id": "0022101229", "chunk_id": "0022101229_001", "order": 1, "role": "lead", "text": "PHOENIX -- — The Sacramento Kings just finished a dismal year, which has been a common theme for the franchise over the last 16 seasons."}
{"game_id": "0022101229", "chunk_id": "0022101229_002", "order": 2, "role": "body", "text": "Interim coach Alvin Gentry said one look at their final opponent, the NBA-best Phoenix Suns, should provide hope that good times can come soon."}
{"game_id": "0022101229", "chunk_id": "0022101229_003", "order": 3, "role": "body", "text": "Justin Holiday, Damian Jones and Donte DiVincenzo each scored 19 points and the Kings beat the Suns 116-109 on Sunday night in the regular-season finale for both teams."}
{"game_id": "0022101229", "chunk_id": "0022101229_004", "order": 4, "role": "body", "text": "Gentry wasn't particulary concerned about the final score — acknowledging that the Suns didn't play most of their best players — but he said the winning culture the Suns have built in a relatively short time span is a great example for the Kings."}
{"game_id": "0022101229", "chunk_id": "0022101229_005", "order": 5, "role": "body", "text": "“Not long ago, they had the worst record in the NBA,” Gentry said of the Suns. “It wasn't even 10 years ago, it was four years ago. The opportunity is there to make great strides. That's what we should shoot for.”"}
{"game_id": "0022101229", "chunk_id": "0022101229_006", "order": 6, "role": "body", "text": "At 64-18, Phoenix finished with the best mark in franchise history and had eight more victories than other team in the NBA. The brilliant regular season comes just four years after finishing 19-63."}
{"game_id": "0022101229", "chunk_id": "0022101229_007", "order": 7, "role": "body", "text": "Sacramento was 30-52 and will miss the playoffs for a 16th straight year."}
{"game_id": "0022101229", "chunk_id": "0022101229_008", "order": 8, "role": "body", "text": "The Suns rested most of their top players in preparation for the playoffs, including Chris Paul, Devin Booker, Deandre Ayton and Jae Crowder. Coach Monty Williams said his major goal against the Kings was helping some of the backups gain confidence heading into the postseason."}
{"game_id": "0022101229", "chunk_id": "0022101229_009", "order": 9, "role": "body", "text": "“It wasn’t our best shooting night,” Williams said. “But one thing we always said to our guys, make or miss you got to let it fly and shoot it with confidence.”"}
{"game_id": "0022101229", "chunk_id": "0022101229_010", "order": 10, "role": "body", "text": "Mikal Bridges started but played just six minutes. He extended his games streak to 309 games, which is every possible regular-season game since he came into the league four seasons ago. It is the longest active streak in the NBA."}
{"game_id": "0022101229", "chunk_id": "0022101229_011", "order": 11, "role": "body", "text": "Landry Shamet led the Suns with 27 points. JaVale McGee had 11 points and 13 rebounds. Down for most of the game, the Suns pulled within three points late, but Sacramento's Davion Mitchell hit two free throws with eight seconds left to seal it."}
{"game_id": "0022101229", "chunk_id": "0022101229_012", "order": 12, "role": "body", "text": "Mitchell finished with 18 points and 15 assists."}
{"game_id": "0022101229", "chunk_id": "0022101229_013", "order": 13, "role": "body", "text": "The Kings also had several of their top players out, including leading scorer De'Aaron Fox."}
{"game_id": "0022101229", "chunk_id": "0022101229_014", "order": 14, "role": "body", "text": "The Kings dominated in the first half, shooting 60% and jumping out to a 67-51 lead by halftime. Holiday had 16 points before the break while Mitchell added 10. Shamet had 12 points for the Suns."}
{"game_id": "0022101229", "chunk_id": "0022101229_016", "order": 16, "role": "body", "text": "The Suns should enter the playoffs with a healthy playing rotation. Paul has been back for several games since missing more than a month with a broken thumb. Cam Johnson has also returned after missing time with a thigh contusion."}
{"game_id": "0022101229", "chunk_id": "0022101229_017", "order": 17, "role": "body", "text": "Bridges and McGee were the only two rotation players who were available for at least 70 of the 82 games this season."}
{"game_id": "0022101229", "chunk_id": "0022101229_019", "order": 19, "role": "body", "text": "Kings: Terence Davis II (right wrist), Fox (right hand soreness), Richaun Holmes (personal), Alex Len (back soreness) and Domantas Sabonis (left knee contusion) were all out."}
{"game_id": "0022101229", "chunk_id": "0022101229_020", "order": 20, "role": "body", "text": "Suns: Converted F Ish Wainright's deal from a two-way contract to a standard NBA contract. The 27-year-old has appeared in 44 games this season and averaged 2.1 points and 1.2 rebounds per game. ... Bridges won the team's Majerle Hustle Award for the third time in his four seasons. The award's namesake Dan Majerle virtually presented Bridges with the award."}
{"game_id": "0022101229", "chunk_id": "0022101229_022", "order": 22, "role": "body", "text": "The Suns get ready to host Game 1 of the first round of the NBA playoffs."}
