{"game_id": "0022100743", "chunk_id": "0022100743_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Chris Paul was on the receiving end of a rough shove in the final seconds from Minnesota's Taurean Prince and players from both teams froze for a split-second, wondering how the 11-time All-Star would react."}
{"game_id": "0022100743", "chunk_id": "0022100743_002", "order": 2, "role": "body", "text": "Basically, the Phoenix point guard did nothing. He waved off his teammates and walked to the free-throw line."}
{"game_id": "0022100743", "chunk_id": "0022100743_003", "order": 3, "role": "body", "text": "The Suns were about to win — again. That's all that mattered."}
{"game_id": "0022100743", "chunk_id": "0022100743_004", "order": 4, "role": "body", "text": "Devin Booker scored 29 points, Paul had a triple-double with 21 points, 14 assists and 10 rebounds and the NBA-leading Suns won their ninth straight game, beating the Timberwolves 134-124 on Friday night."}
{"game_id": "0022100743", "chunk_id": "0022100743_005", "order": 5, "role": "body", "text": "“Right now, we're in a good groove as a team,” Paul said. “We just want to stay that way.”"}
{"game_id": "0022100743", "chunk_id": "0022100743_006", "order": 6, "role": "body", "text": "Cam Johnson — who has recently moved into a starting role with several key players are injured — hit back-to-back 3-pointers midway through fourth to help push the Suns past the pesky Timberwolves. He finished with 23 points. The 6-foot-8 forward also had the assist on two more 3-pointers in the closing minutes — one by Landry Shamet and another by Paul."}
{"game_id": "0022100743", "chunk_id": "0022100743_007", "order": 7, "role": "body", "text": "“He's listening to us and just shooting the ball,” Paul said about Johnson. “Sometimes, he doesn't realize how good he is. We're just happy he's on our team.\""}
{"game_id": "0022100743", "chunk_id": "0022100743_008", "order": 8, "role": "body", "text": "Phoenix played without starters Deandre Ayton (right ankle sprain) and Jae Crowder (left wrist contusion) and key backups JaVale McGee (left knee soreness) and Cameron Payne (right wrist sprain)."}
{"game_id": "0022100743", "chunk_id": "0022100743_009", "order": 9, "role": "body", "text": "The Suns improved to 39-9, the best start in franchise history. They moved to 30-0 when leading after three quarters, using the veteran savvy of Paul to take control in key moments. Phoenix hit 20 3-pointers to tie a season high."}
{"game_id": "0022100743", "chunk_id": "0022100743_010", "order": 10, "role": "body", "text": "The Suns also are one win away from clinching the top spot in the Western Conference heading into the All-Star break. That would mean that Monty Williams would be a head coach in the All-Star game."}
{"game_id": "0022100743", "chunk_id": "0022100743_011", "order": 11, "role": "body", "text": "“We know our main objective is to win a title, bring a championship here,” Booker said. “But you can celebrate the little things going into it, along with the big things. Getting our whole coaching staff there would be big time.”"}
{"game_id": "0022100743", "chunk_id": "0022100743_012", "order": 12, "role": "body", "text": "It was Paul’s 18th career triple-double and third since joining the Suns last season."}
{"game_id": "0022100743", "chunk_id": "0022100743_013", "order": 13, "role": "body", "text": "The Suns had a 12-point lead late in the third quarter but had to settle for a 100-93 advantage going into the fourth after Anthony Edwards had a steal and made a 14-foot jumper at the buzzer. The Timberwolves cut it to three points at one point in the fourth but couldn't get closer."}
{"game_id": "0022100743", "chunk_id": "0022100743_014", "order": 14, "role": "body", "text": "“We could come up with excuses all day but at the end of the day no one cares about the labor,” Towns said. “They only care about the baby. We have to make sure we got the job done because that is the only thing people care about.\""}
{"game_id": "0022100743", "chunk_id": "0022100743_015", "order": 15, "role": "body", "text": "Edwards had 27 points and a career-high 10 assists for Minnesota. Malik Beasley added in 26 points off the bench, and Karl-Anthony Towns had 23. Beasley scored 18 points in the fourth quarter."}
{"game_id": "0022100743", "chunk_id": "0022100743_016", "order": 16, "role": "body", "text": "“Our offense is clicking. We did a very good job there,” Minnesota's Chris Finch said. “We got to get our defense back to where it was for the bulk of the season. I think it is a little loose right now.”"}
{"game_id": "0022100743", "chunk_id": "0022100743_017", "order": 17, "role": "body", "text": "The Suns pushed ahead 40-32 after the first quarter and took a 74-66 lead into halftime. Booker led all scorers with 20 points before the break, and Paul added 15 points and nine assists. Edwards led the Timberwolves with 16 points."}
{"game_id": "0022100743", "chunk_id": "0022100743_019", "order": 19, "role": "body", "text": "Timberwolves: Guards Patrick Beverley (right ankle sprain) and D'Angelo Russell (left shin contusion) didn't play. ... Towns got a technical foul late in the second quarter for arguing with a referee."}
{"game_id": "0022100743", "chunk_id": "0022100743_020", "order": 20, "role": "body", "text": "Suns: Phoenix shot 10 of 19 (52.6%) from 3-point range in the first half. ... The Footprint Center hosted a sellout crowd for the 10th straight game. ... Paul needed just nine shots to get his triple-double. He was 4 of 5 on 3-pointers."}
{"game_id": "0022100743", "chunk_id": "0022100743_022", "order": 22, "role": "body", "text": "Timberwolves: Host Utah on Sunday."}
{"game_id": "0022100743", "chunk_id": "0022100743_023", "order": 23, "role": "body", "text": "Suns: Host Sam Antonio on Sunday."}
