{"game_id": "0022100755", "chunk_id": "0022100755_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Franz Wagner scored 18 points, including the tiebreaking layup with 54 seconds remaining, and the Orlando Magic overcame Luka Doncic’s seventh triple-double of the season to beat the Dallas Mavericks 110-108 on Sunday night."}
{"game_id": "0022100755", "chunk_id": "0022100755_002", "order": 2, "role": "body", "text": "Chuma Okeke scored a season-high 19 points and helped Orlando win consecutive games for just the second time all season."}
{"game_id": "0022100755", "chunk_id": "0022100755_003", "order": 3, "role": "body", "text": "“I’m going out there and having fun and I’m realizing all the work I’m putting in after practice is paying off,” said Okeke, who had an open-court steal from Doncic late in the third quarter for a dunk. “I’m going out there confident, my teammates believe in me and I believe in myself.”"}
{"game_id": "0022100755", "chunk_id": "0022100755_004", "order": 4, "role": "body", "text": "Doncic finished with 34 points, 12 rebounds and 11 assists for the Mavericks for the 43rd triple-double of his career, tying Fat Lever for 10th place in NBA history."}
{"game_id": "0022100755", "chunk_id": "0022100755_005", "order": 5, "role": "body", "text": "Down two in the final seconds, Dallas got the ball into the hands of Doncic, but he gave it up under defensive pressure with 5.5 seconds remaining. Maxi Kleber missed a 3-pointer from the corner. Reggie Bullock’s put-back try at the horn was strong and Dallas’ winning streak ended at two games."}
{"game_id": "0022100755", "chunk_id": "0022100755_006", "order": 6, "role": "body", "text": "“He did everything right,” Dallas coach Jason Kidd said of Doncic’s decision to give up the ball in the closing seconds. “That’s what champions do and leaders do — they trust that their teammates are going to make the right play and knock down a shot. When that happens and we move forward, it’s going to make the game so much easier for him.\""}
{"game_id": "0022100755", "chunk_id": "0022100755_007", "order": 7, "role": "body", "text": "Said Doncic of his decision: “I’m not going to shoot over two because somebody is open. I think that was a good play and I’ll do it again.”"}
{"game_id": "0022100755", "chunk_id": "0022100755_008", "order": 8, "role": "body", "text": "Dorian Finney-Smith had a chance to tie the game again after Wagner’s layup, but the Dallas forward converted just one of two free throws with 34 seconds remaining."}
{"game_id": "0022100755", "chunk_id": "0022100755_009", "order": 9, "role": "body", "text": "Kleber then rebounded a Wagner miss with 18.6 seconds remaining. Kidd said he yelled for a time out, but referee Bennie Adams didn’t hear him. Kleber had the ball stolen from him by Jalen Suggs, and Wendell Carter Jr. split two free throws to give Orlando a two-point lead with 16.8 to play."}
{"game_id": "0022100755", "chunk_id": "0022100755_010", "order": 10, "role": "body", "text": "“It’s an unfortunate play — with the mask (that Kidd was wearing) Bennie said he didn’t hear me call time out,” Kidd said. “That’s unfortunate, because our defense gave us a chance.”"}
{"game_id": "0022100755", "chunk_id": "0022100755_011", "order": 11, "role": "body", "text": "Cole Anthony added 16 points and six assists for Orlando, while Carter added 14 points and 14 rebounds for his team-best 20th double-double of the season."}
{"game_id": "0022100755", "chunk_id": "0022100755_012", "order": 12, "role": "body", "text": "Jalen Brunson scored 15 points for Dallas, while Marquese Chriss scored 14 points off the Dallas bench."}
{"game_id": "0022100755", "chunk_id": "0022100755_013", "order": 13, "role": "body", "text": "Wagner, the NBA’s second-highest scoring rookie at 15.7 points per game, had six fourth-quarter points as the Magic rallied in the final three minutes of the game."}
{"game_id": "0022100755", "chunk_id": "0022100755_014", "order": 14, "role": "body", "text": "“Now, even when we have a couple of bad minutes, we picked it up a lot quicker and get back to how we’ve been playing,” Wagner said. “In these five (home) games we got back to what makes us really good.”"}
{"game_id": "0022100755", "chunk_id": "0022100755_015", "order": 15, "role": "body", "text": "Dallas was playing less than 24 hours after beating Indiana 132-105 at home on Saturday. The Mavericks were without starting center Kristaps Porzingis, who didn’t travel because of a sore right knee."}
{"game_id": "0022100755", "chunk_id": "0022100755_016", "order": 16, "role": "body", "text": "Orlando entered Sunday 27th in the NBA in 3-point shooting, but made 9 of 16 tries from beyond the arc in the early going and led 64-59 at the half. Down by as much as 11 in the first quarter, Orlando outscored Dallas 41-25 in the second quarter."}
{"game_id": "0022100755", "chunk_id": "0022100755_018", "order": 18, "role": "body", "text": "Mavericks: Dallas has swept or split 24 straight two-game season series with the Magic. The last time Orlando swept Dallas was the 1998-99 season. … On Sunday, Doncic either scored or assisted on Dallas’ first 11 points and 28 of its 34 first-quarter points."}
{"game_id": "0022100755", "chunk_id": "0022100755_019", "order": 19, "role": "body", "text": "Magic: Magic coach Jamahl Mosley was an assistant coach with Dallas from 2014-2021. … Admiral Schofield was back with the Magic one night after compiling 30 points, 10 rebounds and six made 3-pointers for the G League's Lakeland Magic. ... Orlando improved to 5-18 at home Sunday, with three of the victories coming on its five-game homestand."}
{"game_id": "0022100755", "chunk_id": "0022100755_021", "order": 21, "role": "body", "text": "Mavericks: Host Oklahoma City on Wednesday night."}
{"game_id": "0022100755", "chunk_id": "0022100755_022", "order": 22, "role": "body", "text": "Magic: At Chicago on Tuesday night."}
