{"game_id": "0022100306", "chunk_id": "0022100306_001", "order": 1, "role": "lead", "text": "MIAMI -- — The Miami Heat said 19,600 fans attended their home game Monday night."}
{"game_id": "0022100306", "chunk_id": "0022100306_002", "order": 2, "role": "body", "text": "At least two of them left happy."}
{"game_id": "0022100306", "chunk_id": "0022100306_003", "order": 3, "role": "body", "text": "Nikola Jokic — with his two brothers behind the Denver bench — returned and scored 24 points, Aaron Gordon added 20 and the Nuggets snapped their longest losing streak in nearly six years by beating the short-handed Heat 120-111 on Monday night."}
{"game_id": "0022100306", "chunk_id": "0022100306_004", "order": 4, "role": "body", "text": "“That's behind us,\" Jokic said. “We need to move on to the future. We won the game and that's the most important thing.\""}
{"game_id": "0022100306", "chunk_id": "0022100306_005", "order": 5, "role": "body", "text": "Bones Hyland returned from injury to score 19 and Will Barton added 14 for the Nuggets, who had dropped six straight. Jokic hadn’t played in the last four of those because of a wrist injury but finished with 15 rebounds and seven assists."}
{"game_id": "0022100306", "chunk_id": "0022100306_006", "order": 6, "role": "body", "text": "“I shot the lights out of the ball,\" Hyland said after going 5 for 8 from 3-point range."}
{"game_id": "0022100306", "chunk_id": "0022100306_007", "order": 7, "role": "body", "text": "Denver shot 58% on the day that it was revealed Michael Porter Jr. will need back surgery. Porter has been limited to only nine games this season."}
{"game_id": "0022100306", "chunk_id": "0022100306_008", "order": 8, "role": "body", "text": "Bam Adebayo finished with 24 points and 13 rebounds for Miami, which was without its two leading scorers — Jimmy Butler was out with a bruised tailbone, and Tyler Herro missed the game with what the Heat called general body soreness. Adebayo had 15 of his points in the third quarter."}
{"game_id": "0022100306", "chunk_id": "0022100306_009", "order": 9, "role": "body", "text": "“Our defense is better than that,\" Heat coach Erik Spoelstra said. “I think they played extremely well. And in those pivotal moments in the course of the game, it seemed like they made every shot, every play.\""}
{"game_id": "0022100306", "chunk_id": "0022100306_010", "order": 10, "role": "body", "text": "Max Strus scored 19 points and Caleb Martin added 18 for the Heat, which got 17 points and 14 assists from Kyle Lowry."}
{"game_id": "0022100306", "chunk_id": "0022100306_011", "order": 11, "role": "body", "text": "It was the first meeting of the teams since the dustup between Jokic and Miami’s Markieff Morris on Nov. 8. Morris committed a hard take foul that the Nuggets felt was overzealous; Jokic responded with a shove into Morris’ back. Morris has now missed 11 games with what the Heat have described as a neck injury."}
{"game_id": "0022100306", "chunk_id": "0022100306_012", "order": 12, "role": "body", "text": "Jokic said he hasn't talked to Morris since. Heat fans booed Jokic every time he touched the ball, and the reigning MVP didn't seem to mind."}
{"game_id": "0022100306", "chunk_id": "0022100306_013", "order": 13, "role": "body", "text": "“I played in Serbia, brother,\" Jokic said."}
{"game_id": "0022100306", "chunk_id": "0022100306_014", "order": 14, "role": "body", "text": "Jokic’s brothers — Strahinja and Nemanja — got into a Twitter jousting with Markieff Morris’ twin brother, Marcus Morris. The Jokic brothers, who have drawn attention for their reactions to certain plays in the past, were in Miami for Monday’s game, seated just behind the Denver bench."}
{"game_id": "0022100306", "chunk_id": "0022100306_015", "order": 15, "role": "body", "text": "“They’re coming down here because this is Miami and I know for a fact every year they’ve been able to come, non-COVID, they’ve been here,” Nuggets coach Michael Malone said. “And that’s not to cause trouble. That’s just to support their brother, which they always do.”"}
{"game_id": "0022100306", "chunk_id": "0022100306_016", "order": 16, "role": "body", "text": "There was no fight in this one. It was only basketball, and fairly one-sided for most of the night."}
{"game_id": "0022100306", "chunk_id": "0022100306_017", "order": 17, "role": "body", "text": "A 12-0 run by the Nuggets in the second quarter — with Miami missing 10 consecutive shots — put Denver up 50-35. The lead was 63-43 by halftime, the biggest deficit that the Heat faced at intermission so far this season."}
{"game_id": "0022100306", "chunk_id": "0022100306_018", "order": 18, "role": "body", "text": "The only time Denver's lead dipped into single figures after halftime came when 0.9 seconds left, when Gabe Vincent made a 3-pointer on the game's final shot."}
{"game_id": "0022100306", "chunk_id": "0022100306_020", "order": 20, "role": "body", "text": "Nuggets: Malone used a challenge just 2:05 into the game, with good reason. It overturned an offensive foul, which would have been Barton’s second personal, and got Denver two points. ... The Nuggets are 4-0 when Hyland scores in double figures."}
{"game_id": "0022100306", "chunk_id": "0022100306_021", "order": 21, "role": "body", "text": "Heat: Miami is 0-4 in games where it trails by double digits at halftime, 13-4 in all other games. ... Adebayo’s high for a quarter is 19, set on Nov. 11 in the first quarter against the Los Angeles Clippers."}
{"game_id": "0022100306", "chunk_id": "0022100306_023", "order": 23, "role": "body", "text": "Heat forward P.J. Tucker, a fashion aficionado and shoe collector, paid tribute to fashion designer Virgil Abloh with his sneakers on Monday. “Virgil will always be with us,” Tucker scrawled on his game sneakers in honor of Abloh, whose death was announced Sunday."}
{"game_id": "0022100306", "chunk_id": "0022100306_025", "order": 25, "role": "body", "text": "Here’s a meteorological oddity for late November: About 90 minutes before game time, it was 68 degrees in Denver — one degree warmer than it was in typically balmy Miami. Things should be closer to normal in both cities by week’s end, with Saturday’s high in Miami expected to be in the low 80s and the high in Denver likely to hover in the low 50s."}
{"game_id": "0022100306", "chunk_id": "0022100306_027", "order": 27, "role": "body", "text": "Nuggets: Visit Orlando on Wednesday."}
{"game_id": "0022100306", "chunk_id": "0022100306_028", "order": 28, "role": "body", "text": "Heat: Host Cleveland on Wednesday."}
