{"game_id": "0022100857", "chunk_id": "0022100857_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Anthony Edwards celebrated a milestone Sunday by scoring 37 points and leading the Minnesota Timberwolves to a 129-120 victory over the Indiana Pacers."}
{"game_id": "0022100857", "chunk_id": "0022100857_002", "order": 2, "role": "body", "text": "Edwards became the fourth-youngest player in NBA history to reach the 2,500-point mark when he made his first basket of the game. The second-year forward is 20 years, 192 days old. LeBron James, Kevin Durant and Devin Booker are the only younger players to achieve the feat."}
{"game_id": "0022100857", "chunk_id": "0022100857_003", "order": 3, "role": "body", "text": "The Timberwolves snapped a two-game losing streak overall and a three-game losing streak at Indiana as they compete to finish among the top six in the Western Conference and avoid the play-in round."}
{"game_id": "0022100857", "chunk_id": "0022100857_004", "order": 4, "role": "body", "text": "Edwards made seven 3-pointers and had five rebounds, four assists and four steals on a day Karl Anthony-Towns was in foul trouble."}
{"game_id": "0022100857", "chunk_id": "0022100857_005", "order": 5, "role": "body", "text": "“When he’s playing that well, we’re a tough team,\" guard Patrick Beverley said, referring to Edwards. “I love the way he played tonight, put the pressure on them all night. He's hard to guard and it can be anybody’s night.\""}
{"game_id": "0022100857", "chunk_id": "0022100857_006", "order": 6, "role": "body", "text": "Oshae Brissett had a season-high 22 points and matched his career high with 13 rebounds for Indiana, which has lost six in a row.. Tyrese Haliburton added 22 points and 16 assists, one short of tying his career high in just his second game with the Pacers."}
{"game_id": "0022100857", "chunk_id": "0022100857_007", "order": 7, "role": "body", "text": "The difference was Minnesota's size and depth."}
{"game_id": "0022100857", "chunk_id": "0022100857_008", "order": 8, "role": "body", "text": "“Against a team that had all their guys and is playing very well and is very talented we did some good things to hang around and give ourselves a chance in the fourth,\" Pacers coach Rick Carlisle said. “There’s some very positive things and some things that obviously need work. We're just running low on bodies now.\""}
{"game_id": "0022100857", "chunk_id": "0022100857_009", "order": 9, "role": "body", "text": "Indiana opened with a quick scoring flurry, but the Timberwolves cut the deficit to 37-33 at the end of one quarter then took charge in the second. Malik Beasley's 3-pointer gave the Timberwolves the lead and spurred a 13-0 run that allowed the Timberwolves to build a 56-44 lead."}
{"game_id": "0022100857", "chunk_id": "0022100857_010", "order": 10, "role": "body", "text": "They extended the margin to 18 early in the second half — before the Pacers finally charged back. Indiana closed to 96-94 in the final minute of the third quarter and made it a two-point game again when Terry Taylor opened the fourth by making two free throws. But Minnesota answered with an 8-2 run."}
{"game_id": "0022100857", "chunk_id": "0022100857_012", "order": 12, "role": "body", "text": "Timberwolves: Towns had 15 points and 13 rebounds and D'Angelo Russell had 23 points and six assists. ... Beverley and Naz Reid each scored 13 points, Jaden McDaniels had 11 and Beasley finished with 10. ... Minnesota was 18 of 34 ons 3s. ... The Timberwolves matched their season high with 41 second-quarter points. ... Minnesota has scored at least 100 points by the end of the third quarter 10 times this season."}
{"game_id": "0022100857", "chunk_id": "0022100857_013", "order": 13, "role": "body", "text": "Pacers: Lance Stephenson had 21 points. ... Jalen Smith had 17 points and 12 rebounds, Buddy Hield had 13 points and Terry Taylor added 10 points and five rebounds. ... Haliburton had 10 assists in the first half. ... Indiana was swept by Minnesota in the season series for the first time since 2006-07. ... Indiana has lost four straight home games and is now 13-17 on its home court."}
{"game_id": "0022100857", "chunk_id": "0022100857_015", "order": 15, "role": "body", "text": "Indiana has been short-handed for weeks because of injuries to key rotational players including three projected starters. And those woes are only get worse. The Pacers ruled out rookie big man Isaiah Jackson before the game after he aggravated a sprained right ankle Friday night and they lost rookie guard Chris Duarte with a jammed toe in the first half Sunday. Carlisle said he doesn't expect Duarte to return before the All-Star break."}
{"game_id": "0022100857", "chunk_id": "0022100857_017", "order": 17, "role": "body", "text": "Timberwolves: Hosts Charlotte on Tuesday."}
{"game_id": "0022100857", "chunk_id": "0022100857_018", "order": 18, "role": "body", "text": "Pacers: Visit Milwaukee on Tuesday."}
