{"game_id": "0022100033", "chunk_id": "0022100033_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — Trail Blazers head coach Chauncey Billups was happy to have an extra pair of clothes on Saturday night. He needed them after getting drenched by his players as they celebrated his first career victory as a head coach."}
{"game_id": "0022100033", "chunk_id": "0022100033_002", "order": 2, "role": "body", "text": "CJ McCollum scored 28 points to lead the Portland Trail Blazers to a 134-105 victory over the Phoenix Suns on Saturday night."}
{"game_id": "0022100033", "chunk_id": "0022100033_003", "order": 3, "role": "body", "text": "“That was crazy,” Billups said of getting soaked postgame. “I knew I was in trouble when I saw everyone getting their cameras out. All I know is that water was cold as hell. We couldn’t find any room temperature water?”"}
{"game_id": "0022100033", "chunk_id": "0022100033_004", "order": 4, "role": "body", "text": "McCollum’s hot shooting set the pace for the Blazers to their first win of the season."}
{"game_id": "0022100033", "chunk_id": "0022100033_005", "order": 5, "role": "body", "text": "“There was a time or two that I wanted to get him out of there and I just kept saying ‘next play’ because he kept making shots,” Billups said of McCollum. “He just kept going.”"}
{"game_id": "0022100033", "chunk_id": "0022100033_006", "order": 6, "role": "body", "text": "Damian Lillard finished with 19 points and eight assists, while Anfernee Simons pitched in 18 points off the bench. But the defense was what caught the coach’s eye."}
{"game_id": "0022100033", "chunk_id": "0022100033_007", "order": 7, "role": "body", "text": "“There were times where it was like we had six guys on the floor,” Billups said. “People were just giving so many multiple efforts.”"}
{"game_id": "0022100033", "chunk_id": "0022100033_008", "order": 8, "role": "body", "text": "Devin Booker led the Suns with 21 points in the loss."}
{"game_id": "0022100033", "chunk_id": "0022100033_009", "order": 9, "role": "body", "text": "Lillard made his first 3-pointer of the season with 1:03 left in the second quarter after missing his first 11 attempts behind the arc. Portland led by 20 at halftime, with the only first half mishap coming when Norman Powell left the game with 5:43 remaining in the second quarter due to a left knee injury."}
{"game_id": "0022100033", "chunk_id": "0022100033_010", "order": 10, "role": "body", "text": "Nassir Little started the second half in Powell’s place."}
{"game_id": "0022100033", "chunk_id": "0022100033_011", "order": 11, "role": "body", "text": "Portland led by as many as 37."}
{"game_id": "0022100033", "chunk_id": "0022100033_013", "order": 13, "role": "body", "text": "Suns: Back-up point guard Cameron Payne was out for the Suns. Payne suffered a right hamstring strain in Phoenix’s win Friday night over the Los Angeles Lakers. “We noticed it last night,” Monty Williams said of Payne. “Earlier in the game he felt OK, but as the game went on it felt like it worsened but he wanted to play. It got worse after the game and last night I had a feeling that he wouldn’t play.”"}
{"game_id": "0022100033", "chunk_id": "0022100033_014", "order": 14, "role": "body", "text": "Trail Blazers: The Blazers were one of the worst defensive teams in the NBA last season and under a new head coach, that is one of their biggest tasks. Billups said the Blazers are “working on” creating their identity but have yet to define it. “I want us to be tough, I want us to compete every single night and I want us to be unselfish on both ends,” he said."}
{"game_id": "0022100033", "chunk_id": "0022100033_016", "order": 16, "role": "body", "text": "Prior to the game Billups and Williams shared their admiration for each other, dating back to their days as teammates in the NBA."}
{"game_id": "0022100033", "chunk_id": "0022100033_017", "order": 17, "role": "body", "text": "“(The Suns) compete really hard on the defensive end and they are one of the teams in the league that actually have an identity,” Billups said. “What I’m trying do is what Monty did when he got (to Phoenix).”"}
{"game_id": "0022100033", "chunk_id": "0022100033_018", "order": 18, "role": "body", "text": "Williams and Billups crossed paths a few times in their playing careers. But it was in their time with the Orlando Magic in 2000, during which Billups never suited up due to injury, that they became close, according to Williams."}
{"game_id": "0022100033", "chunk_id": "0022100033_019", "order": 19, "role": "body", "text": "Williams, however, was very modest when it came to playing up his abilities as a mentor."}
{"game_id": "0022100033", "chunk_id": "0022100033_020", "order": 20, "role": "body", "text": "“I typically try to share my mistakes (with young coaches), so they don’t waste time,” Williams said. “Chauncey’s a leader. He led a team to a world title. What can I tell him? But hopefully I can share him what I haven’t done well and he can avoid those same mistakes.”"}
{"game_id": "0022100033", "chunk_id": "0022100033_022", "order": 22, "role": "body", "text": "Suns: host the Sacramento Kings on Wednesday."}
{"game_id": "0022100033", "chunk_id": "0022100033_023", "order": 23, "role": "body", "text": "Blazers: visit the Los Angeles Clippers on Monday."}
