{"game_id": "0022101047", "chunk_id": "0022101047_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Bogdan Bogdanovic scored a season-high 30 points, Delon Wright had 18 and the Atlanta Hawks beat the Memphis Grizzlies 120-105 on Friday night."}
{"game_id": "0022101047", "chunk_id": "0022101047_002", "order": 2, "role": "body", "text": "Ja Morant scored 29 points for Memphis, which saw its four-game winning streak end. The Grizzlies began the night second in the Western Conference, one game ahead of Golden State."}
{"game_id": "0022101047", "chunk_id": "0022101047_003", "order": 3, "role": "body", "text": "Morant left the game in the fourth quarter in what coach Taylor Jenkins said was a “precautionary” move after “he said he felt a little soreness in his knee.”"}
{"game_id": "0022101047", "chunk_id": "0022101047_004", "order": 4, "role": "body", "text": "Wright, filling in for Trae Young, provided a big boost for Atlanta, which is clinging to the 10th spot in the Eastern Conference and final spot in the play-in tournament. Wright had five steals and six assists and enjoyed a strong start by sinking his first three shots, all 3-pointers, while scoring 11 points in the opening period."}
{"game_id": "0022101047", "chunk_id": "0022101047_005", "order": 5, "role": "body", "text": "“I knew I was going to have some wide-open shots, the way they play and load up in the paint,” Wright said. “I just wanted to stay patient and stay confident.”"}
{"game_id": "0022101047", "chunk_id": "0022101047_006", "order": 6, "role": "body", "text": "Atlanta led by 23 points in the third quarter before the Grizzlies pulled to 103-92, following back-to-back 3-pointers by De’Anthony Melton and Desmond Bane, who had 15 points."}
{"game_id": "0022101047", "chunk_id": "0022101047_007", "order": 7, "role": "body", "text": "A three-point play by De’Andre Hunter, who had 14 points, helped Atlanta regain control. Bogdanovic sank two 3s in the final three minutes."}
{"game_id": "0022101047", "chunk_id": "0022101047_008", "order": 8, "role": "body", "text": "The Hawks won despite playing without their two leading scorers. Young was held out with a bruised left quad after testing the injury in pregame shooting. John Collins (right foot strain, right finger sprain) missed his fourth straight game."}
{"game_id": "0022101047", "chunk_id": "0022101047_009", "order": 9, "role": "body", "text": "“Just got to give them a lot of credit,” Jenkins said of the Hawks. \"They made tough shots. ... They played great for 48 (minutes) and we only had it in spurts tonight. They stepped up when their best player was out and played great team ball.\""}
{"game_id": "0022101047", "chunk_id": "0022101047_010", "order": 10, "role": "body", "text": "Atlanta used a 13-2 run, capped by Bogdanovic’s 3-pointer, to lead 58-38 in the second. A long 3-pointer by De’Andre Hunter gave Atlanta its biggest lead of the half at 65-44."}
{"game_id": "0022101047", "chunk_id": "0022101047_011", "order": 11, "role": "body", "text": "Morant scored the Grizzlies’ first nine points of the second half. After trimming Atlanta’s lead to 73-63, Memphis appeared to have momentum. Atlanta answered with a 16-3 run, capped by another 3 from Bogdanovic, to lead 89-66."}
{"game_id": "0022101047", "chunk_id": "0022101047_012", "order": 12, "role": "body", "text": "Bogdanovic made five of six 3s, matching his season high."}
{"game_id": "0022101047", "chunk_id": "0022101047_014", "order": 14, "role": "body", "text": "Grizzlies: Memphis set season lows with eight first-half assists and 18 for the game. ... Morant started after missing one game with back soreness. ... Jaren Jackson Jr. had 15 points."}
{"game_id": "0022101047", "chunk_id": "0022101047_015", "order": 15, "role": "body", "text": "Hawks: G Kevin Huerter scored one point in eight minutes before leaving in the first quarter with a lower back strain. He returned in the second and had six points. ... Danilo Gallinari, who was listed as questionable with a bruised right biceps, started at Collins’ power forward spot and had 11 points."}
{"game_id": "0022101047", "chunk_id": "0022101047_017", "order": 17, "role": "body", "text": "The Grizzlies committed 16 turnovers, leading to 24 points for Atlanta."}
{"game_id": "0022101047", "chunk_id": "0022101047_018", "order": 18, "role": "body", "text": "Jenkins said the Hawks' length on defense “bothered us. ... The turnovers definitely hurt us.\""}
{"game_id": "0022101047", "chunk_id": "0022101047_019", "order": 19, "role": "body", "text": "Bane said the Grizzles have “got to move the ball better. We're not going to win many with 18 assists.”"}
{"game_id": "0022101047", "chunk_id": "0022101047_021", "order": 21, "role": "body", "text": "The Hawks said before the game Collins is out indefinitely after tests revealed a plantar fascia tear in his right foot. Collins’ status will be updated in about two weeks. There is no guarantee Collins will return this season."}
{"game_id": "0022101047", "chunk_id": "0022101047_022", "order": 22, "role": "body", "text": "“I don’t think we’re saying in two weeks he’ll be back,” Hawks coach Nate McMillan said before the game. “In two weeks we’ll evaluate.”"}
{"game_id": "0022101047", "chunk_id": "0022101047_024", "order": 24, "role": "body", "text": "Grizzlies: End four-game road trip at Houston on Sunday."}
{"game_id": "0022101047", "chunk_id": "0022101047_025", "order": 25, "role": "body", "text": "Hawks: Host New Orleans on Sunday."}
