{"game_id": "0022100035", "chunk_id": "0022100035_001", "order": 1, "role": "lead", "text": "NEW YORK -- — LaMelo Ball had a good first three quarters in Brooklyn, then decided it was best if he watched the fourth."}
{"game_id": "0022100035", "chunk_id": "0022100035_002", "order": 2, "role": "body", "text": "Ish Smith was rolling so well that the Rookie of the Year told Charlotte coach James Borrego to stick with this backup."}
{"game_id": "0022100035", "chunk_id": "0022100035_003", "order": 3, "role": "body", "text": "“That’s big. That just shows where our growth is,” forward Miles Bridges said. “As long as he’s being mature and we’re all being mature, we’re going to keep winning.”"}
{"game_id": "0022100035", "chunk_id": "0022100035_004", "order": 4, "role": "body", "text": "The Hornets have never done that this well to start a season."}
{"game_id": "0022100035", "chunk_id": "0022100035_005", "order": 5, "role": "body", "text": "Bridges had 32 points and nine rebounds, Smith added 11 of his 15 points in the fourth quarter and the Hornets improved to 3-0 for the first time by beating the Brooklyn Nets 111-95 on Sunday."}
{"game_id": "0022100035", "chunk_id": "0022100035_006", "order": 6, "role": "body", "text": "Ball had 18 points, six rebounds and five assists, but it was the Hornets' backups who led them in a dominant final quarter. Cody Martin scored eight of his 12 in the final 12 minutes."}
{"game_id": "0022100035", "chunk_id": "0022100035_007", "order": 7, "role": "body", "text": "Before that, it was another big night for Bridges, who had his second straight 30-point outing and finished a point shy of his career high."}
{"game_id": "0022100035", "chunk_id": "0022100035_008", "order": 8, "role": "body", "text": "Kevin Durant scored 38 points for the Nets, who fell to 1-2. James Harden had 15 points, eight assists and seven rebounds for Brooklyn."}
{"game_id": "0022100035", "chunk_id": "0022100035_009", "order": 9, "role": "body", "text": "It was a disappointing home opener that featured demonstrators outside the arena supporting Nets guard Kyrie Irving and protesting New York’s vaccine mandate."}
{"game_id": "0022100035", "chunk_id": "0022100035_010", "order": 10, "role": "body", "text": "The Nets are not allowing Irving to play while he is not vaccinated against COVID-19, which the city's mandate says pro athletes playing for a local team must do."}
{"game_id": "0022100035", "chunk_id": "0022100035_011", "order": 11, "role": "body", "text": "Brooklyn sure looked as if it needed Irving on a night when nobody besides Durant, who shot 17 for 24, got into any sort of flow."}
{"game_id": "0022100035", "chunk_id": "0022100035_013", "order": 13, "role": "body", "text": "“It’s three games in. Of course, we’ve got enough,” Durant said."}
{"game_id": "0022100035", "chunk_id": "0022100035_014", "order": 14, "role": "body", "text": "“We definitely want Kyrie Irving out here on the floor and he’s a huge part of what we do, but it’s not happening right now. So we've got to figure it out. But nobody’s going to lose confidence while we’re playing and hope Kyrie comes and saves us during the game. No, you’ve got to play.”"}
{"game_id": "0022100035", "chunk_id": "0022100035_015", "order": 15, "role": "body", "text": "The Hornets won their first two largely through their offense, with a team-best 246 points in their first two games. This one was done through defense, outscoring the Nets 61-37 in the second half."}
{"game_id": "0022100035", "chunk_id": "0022100035_016", "order": 16, "role": "body", "text": "“To hold that team to 95 points, that’s pretty special,” Smith said."}
{"game_id": "0022100035", "chunk_id": "0022100035_017", "order": 17, "role": "body", "text": "“Obviously, previous two games we scored in the low-120s, but tonight defensively we did a great job, especially in that fourth quarter.”"}
{"game_id": "0022100035", "chunk_id": "0022100035_018", "order": 18, "role": "body", "text": "Leading by four, they broke it open with a 10-5 spurt, with Smith and Martin scoring all the points. Charlotte shot 14 for 22 (63.6%) in the fourth quarter."}
{"game_id": "0022100035", "chunk_id": "0022100035_020", "order": 20, "role": "body", "text": "Hornets: The Hornets played without Terry Rozier because of a sprained ankle. ... Charlotte outscored Brooklyn 29-20 in the third quarter. It was the first time the Hornets were held below 30 in the period, having scored a league-best 69 points in the third quarter through two games."}
{"game_id": "0022100035", "chunk_id": "0022100035_021", "order": 21, "role": "body", "text": "Nets: Patty Mills missed his first four 3-pointers after starting 10 for 10 this season. ... Brooklyn opened a six-game homestand. The Nets follow that with a six-game road trip. ... The Nets were 28-8 at home last season, their best winning percentage in Brooklyn."}
{"game_id": "0022100035", "chunk_id": "0022100035_023", "order": 23, "role": "body", "text": "A small group of demonstrators broke through barriers and got all the way to the front entrance of Barclays Center, forcing arena officials to briefly close the doors  while fans were trying to get in. A spokeswoman for the arena said that “Only ticketed guests were able to enter the building and the game proceeded according to schedule.”"}
{"game_id": "0022100035", "chunk_id": "0022100035_025", "order": 25, "role": "body", "text": "The Nets gave Blake Griffin a night off in the opener of their first back-to-back of the season. Coach Steve Nash said he's not concerned about having to sit Durant when the Nets play on consecutive nights, which he did early last season after the All-Star forward missed the 2019-20 season recovering from Achilles tendon surgery."}
{"game_id": "0022100035", "chunk_id": "0022100035_026", "order": 26, "role": "body", "text": "“I think we’re more comfortable playing him. He’s had more than enough time since the injury, since the return. He’s proven that he can handle that,” Nash said. “Now do I want to pick some spots to be able to protect him this year? Of course, but it’s not as formulaic as perhaps last year was.”"}
{"game_id": "0022100035", "chunk_id": "0022100035_028", "order": 28, "role": "body", "text": "Hornets: Host Boston on Monday night."}
{"game_id": "0022100035", "chunk_id": "0022100035_029", "order": 29, "role": "body", "text": "Nets: Host Washington on Monday night."}
