{"game_id": "0022100305", "chunk_id": "0022100305_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Doc Rivers gave a pep talk to Jamahl Mosley shortly after the Orlando Magic hired the rookie head coach in July. The 76ers coach's advice was simple:"}
{"game_id": "0022100305", "chunk_id": "0022100305_002", "order": 2, "role": "body", "text": "“Just trust the process of things,” Mosley said."}
{"game_id": "0022100305", "chunk_id": "0022100305_003", "order": 3, "role": "body", "text": "Trust the process is still a triggering expression in Philadelphia, where the slogan for the franchise’s controversial rebuild method lingers to this day."}
{"game_id": "0022100305", "chunk_id": "0022100305_004", "order": 4, "role": "body", "text": "The Magic rekindled some of the earliest days of the plan with grit in a fiery second half that pushed the four-win team to the brink of an upset. Much like those early Sixers, the fight fell short."}
{"game_id": "0022100305", "chunk_id": "0022100305_005", "order": 5, "role": "body", "text": "Seth Curry scored 24 points, Tobias Harris had 17 and the Philadelphia 76ers needed free throws in the final minute to beat the Magic 101-96 on Monday night."}
{"game_id": "0022100305", "chunk_id": "0022100305_006", "order": 6, "role": "body", "text": "“We gave ourselves a chance because we sat down and guarded,” Mosley said after Orlando's seventh straight loss."}
{"game_id": "0022100305", "chunk_id": "0022100305_007", "order": 7, "role": "body", "text": "The Sixers shot 39% in the third quarter as they coughed up a 16-point lead and the Philly crowd booed them off the court. Mo Bamba’s dunk with 57 seconds left tied it 93-all."}
{"game_id": "0022100305", "chunk_id": "0022100305_008", "order": 8, "role": "body", "text": "The Sixers just hung on from the line. Ty Maxey made two for the lead, Joel Embiid hit 3 of 4 and Maxey added two more to help the Sixers avoid an embarrassing defeat. Embiid scored 16 points on 4-for-16 shooting."}
{"game_id": "0022100305", "chunk_id": "0022100305_009", "order": 9, "role": "body", "text": "Franz Wagner led the Magic with 27 points and Jalen Suggs had 17 before he left late in the fourth with a broken right thumb. He will miss “an extended period of time.\""}
{"game_id": "0022100305", "chunk_id": "0022100305_010", "order": 10, "role": "body", "text": "Last season’s top regular-season team in the East, the Sixers were hit with injury and illness this season that left them sputtering along at .500 most of this year. Embiid missed nine games because of COVID-19 — it him so bad, he said he had “headaches worse than migraines” — and Harris and Danny Green were among the other Sixers out for games because of league protocols."}
{"game_id": "0022100305", "chunk_id": "0022100305_011", "order": 11, "role": "body", "text": "Throw in the season-long absence of All-Star Ben Simmons following his trade demand, and the Sixers have been out of sync in Rivers’ second year on the bench."}
{"game_id": "0022100305", "chunk_id": "0022100305_012", "order": 12, "role": "body", "text": "Consider, the opening night lineup of Embiid-Harris-Green-Curry-Maxey started for only the seventh time this season (5-2)."}
{"game_id": "0022100305", "chunk_id": "0022100305_013", "order": 13, "role": "body", "text": "“Now that everybody’s back, we got to figure out how to get back to playing dominant basketball,” Curry said."}
{"game_id": "0022100305", "chunk_id": "0022100305_014", "order": 14, "role": "body", "text": "For a while, the combo worked."}
{"game_id": "0022100305", "chunk_id": "0022100305_015", "order": 15, "role": "body", "text": "The Magic missed their first five 3s and the Sixers raced to a 31-19 lead."}
{"game_id": "0022100305", "chunk_id": "0022100305_016", "order": 16, "role": "body", "text": "But this was no blowout. And it was more proof that backed Rivers’ belief the starting lineup needed more games together to get its groove back."}
{"game_id": "0022100305", "chunk_id": "0022100305_017", "order": 17, "role": "body", "text": "“This team is going to be really good. I just feel it,” he said. “It’ll take a little bit, but we’ll be fine.”"}
{"game_id": "0022100305", "chunk_id": "0022100305_018", "order": 18, "role": "body", "text": "The Magic about handed Philly its worst loss of the season."}
{"game_id": "0022100305", "chunk_id": "0022100305_019", "order": 19, "role": "body", "text": "Embiid still look fatigued in the second half and the Magic rallied their way into the lead. The Magic took the lead 64-62 on Suggs’ pick off of Embiid’s lazy pass and a fastbreak dunk that ignited boos from the home crowd. Suggs swung from the rim and then pointed toward the sky as he hustled back on defense. Wagner let out a primal yell on another dunk off a turnover that kept Orlando’s lead at three."}
{"game_id": "0022100305", "chunk_id": "0022100305_020", "order": 20, "role": "body", "text": "Knocking the Sixers on the ropes is all part of the journey for the Magic."}
{"game_id": "0022100305", "chunk_id": "0022100305_021", "order": 21, "role": "body", "text": "“They kind of stunned us a little bit,” Harris said. “We missed a couple of shots that could have fell, then we passed up a couple of ones. That's kind of the formula to allow a team to get confident.”"}
{"game_id": "0022100305", "chunk_id": "0022100305_022", "order": 22, "role": "body", "text": "Embiid and Curry hit consecutive 3s late in the third to send the Sixers to an 81-78 lead at the end of the quarter. Curry hit a 3 that made it 94-89 late in the fourth, yet the Sixers still couldn’t completely hold off Orlando."}
{"game_id": "0022100305", "chunk_id": "0022100305_024", "order": 24, "role": "body", "text": "Magic: Former 76ers guards Michael Carter-Williams, the 2013-14 rookie of the year, and Markelle Fultz, the No. 1 pick of the 2017 draft, both remained sidelined with injuries. Mosley said there is no timeline for the players, each once considered key cornerstones of the Sixers’ rebuild, to return to the lineup."}
{"game_id": "0022100305", "chunk_id": "0022100305_025", "order": 25, "role": "body", "text": "76ers: C Andre Drummond had his fourth game this season with at least 10 rebounds off the bench."}
{"game_id": "0022100305", "chunk_id": "0022100305_027", "order": 27, "role": "body", "text": "Magic: Host Denver on Wednesday."}
{"game_id": "0022100305", "chunk_id": "0022100305_028", "order": 28, "role": "body", "text": "Sixers: Head out on a four-game trip and play Wednesday at Boston. The Sixers play in Atlanta and twice in Charlotte to end a stretch of 10 of 12 games on the road."}
