{"game_id": "0022101044", "chunk_id": "0022101044_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Pascal Siakam had 31 points and the streaking Toronto Raptors held off a fourth-quarter comeback by the Los Angeles Clippers for a 103-100 victory Wednesday night."}
{"game_id": "0022101044", "chunk_id": "0022101044_002", "order": 2, "role": "body", "text": "The Raptors (39-30) have won five straight and went 5-1 on their road trip. Siakam has scored at least 20 points in a career-high eight consecutive games and is averaging 27.8 points during that span."}
{"game_id": "0022101044", "chunk_id": "0022101044_003", "order": 3, "role": "body", "text": "“I think it’s great composure. He’s seeing things very clearly,” Toronto coach Nick Nurse said. “I thought he made one really tough basket where they knocked him back, but he was able to clear some space and make a physical finish.”"}
{"game_id": "0022101044", "chunk_id": "0022101044_004", "order": 4, "role": "body", "text": "Siakam also had 12 rebounds for his 23rd double-double this season and tied a season high with three 3-pointers."}
{"game_id": "0022101044", "chunk_id": "0022101044_005", "order": 5, "role": "body", "text": "“The more I am getting in situations, the better I get,” he said. “I'm trying to work on being composed, knowing where to go and imposing my will. I just have to stick with it. I know there are going to be runs, but stay consistent in what we do.”"}
{"game_id": "0022101044", "chunk_id": "0022101044_006", "order": 6, "role": "body", "text": "Fred VanVleet added 21 points for the Raptors, who moved into a tie for sixth place with the Cleveland Cavaliers in the Eastern Conference at 39-30. Nine of Toronto's final 13 regular-season games are at home as it tries to avoid being in the play-in tournament in what is a tightly bunched playoff race."}
{"game_id": "0022101044", "chunk_id": "0022101044_007", "order": 7, "role": "body", "text": "Reggie Jackson led the Clippers with 23 points, and Marcus Morris Sr. added 22. Los Angeles has dropped three of four to fall to 36-36. The Clippers are entrenched in eighth place in the Western Conference. They are 5 1/2 games behind Minnesota for seventh but 5 1/2 ahead of the Lakers, who are in ninth."}
{"game_id": "0022101044", "chunk_id": "0022101044_008", "order": 8, "role": "body", "text": "“It was a good challenge for us offensively. We tried to make the right play and right pass, but they were beating us 1-on-1,” coach Tyronn Lue said."}
{"game_id": "0022101044", "chunk_id": "0022101044_009", "order": 9, "role": "body", "text": "Toronto led 93-83 midway through the fourth quarter before the Clippers came back. Jackson's layup got Los Angeles within 99-97 with 1:28 remaining, but it couldn't get the tying basket."}
{"game_id": "0022101044", "chunk_id": "0022101044_010", "order": 10, "role": "body", "text": "The Clippers had a chance to send it to overtime, but Morris was short on a 3-point attempt with 1.7 seconds left."}
{"game_id": "0022101044", "chunk_id": "0022101044_011", "order": 11, "role": "body", "text": "The first half saw nine lead changes and four ties before the Raptors went on a 19-6 run over the final 6:35 to take a 54-44 lead at halftime. VanVleet keyed the spurt with nine points."}
{"game_id": "0022101044", "chunk_id": "0022101044_012", "order": 12, "role": "body", "text": "Toronto extended its lead to 65-48 with 9:42 remaining in the third quarter. It remained in double digits until the Clippers scored 11 straight points late in the third and early in the fourth to get within 78-76. Raptors rookie Scottie Barnes answered with a 3-pointer on the ensuing possession to help Toronto regain momentum."}
{"game_id": "0022101044", "chunk_id": "0022101044_013", "order": 13, "role": "body", "text": "“I think we were able to weather some things without looking like we were shaky,” Nurse said."}
{"game_id": "0022101044", "chunk_id": "0022101044_015", "order": 15, "role": "body", "text": "Raptors: Toronto had 16 offensive rebounds, which led to 21 points. ... Barnes had 15 points, including nine in the second half. ... Siakam had 14 points and six rebounds during the third quarter."}
{"game_id": "0022101044", "chunk_id": "0022101044_016", "order": 16, "role": "body", "text": "Clippers: Terance Mann (16 points, nine rebounds) and Isaiah Hartenstein (12 points) came off the bench to score in double figures. ... Robert Covington returned after missing five games due to personal reasons and scored seven points in 21 minutes He also had three steals to reach 850 for his career. ... Jackson accounted for 23 of LA's 26 first-quarter points. He scored 10 points, and his five assists led to 13 points. ... Ivica Zubac had all seven of his rebounds during the first 8 1/2 minutes."}
{"game_id": "0022101044", "chunk_id": "0022101044_018", "order": 18, "role": "body", "text": "Raptors: Host the Los Angeles Lakers on Friday night."}
{"game_id": "0022101044", "chunk_id": "0022101044_019", "order": 19, "role": "body", "text": "Clippers: At the Utah Jazz on Friday night."}
