{"game_id": "0022100060", "chunk_id": "0022100060_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — D’Angelo Russell scored 29 points, Karl-Anthony Towns and Anthony Edwards each added 25, and the Minnesota Timberwolves held off the short-handed Milwaukee Bucks 113-108 on Wednesday night."}
{"game_id": "0022100060", "chunk_id": "0022100060_002", "order": 2, "role": "body", "text": "Giannis Antetokounmpo had 40 points and 16 rebounds for the Bucks, who were without point guard Jrue Holiday and center Brook Lopez."}
{"game_id": "0022100060", "chunk_id": "0022100060_003", "order": 3, "role": "body", "text": "“We’ve got to figure it out, because obviously there’s going to be times that we’re going to play without them and this was one of those times,” Antetokounmpo said. “But we cannot use that as an excuse. We’ve got to do a better job of rebounding the ball.”"}
{"game_id": "0022100060", "chunk_id": "0022100060_004", "order": 4, "role": "body", "text": "The Bucks, who trailed 94-79 entering the final period, pulled within 110-108 on Antetokounmpo’s layup with 9.4 seconds remaining. Edwards answered with two free throws."}
{"game_id": "0022100060", "chunk_id": "0022100060_005", "order": 5, "role": "body", "text": "“That’s an NBA championship opponent,” Minnesota coach Chris Finch said. “I know they’ve got some injuries and whatnot, but they play hard and they don’t beat themselves. We had to do a good job of executing our game plan.”"}
{"game_id": "0022100060", "chunk_id": "0022100060_006", "order": 6, "role": "body", "text": "Jarred Vanderbilt, making his first start of the season, had 10 points and 13 rebounds for the Timberwolves. Khris Middleton scored 16 points and Grayson Allen had 13 for the Bucks."}
{"game_id": "0022100060", "chunk_id": "0022100060_007", "order": 7, "role": "body", "text": "Minnesota had lost six straight against the Bucks and hadn’t won at Milwaukee since the 2013-14 season. The Timberwolves were coming off a 107-98 loss to New Orleans."}
{"game_id": "0022100060", "chunk_id": "0022100060_008", "order": 8, "role": "body", "text": "“I think we responded to a poor performance the other day,” Finch said. “I think that’s one of the things we’re most pleased with. When they closed the gap coming out of the half, we pushed back and pushed it back up.”"}
{"game_id": "0022100060", "chunk_id": "0022100060_009", "order": 9, "role": "body", "text": "Edwards’ free throw put Minnesota up 106-92 with 5:20 left, but the Bucks responded with a 10-2 run, cutting the lead to 108-102 on George Hill’s 3-pointer with 1:59 remaining."}
{"game_id": "0022100060", "chunk_id": "0022100060_010", "order": 10, "role": "body", "text": "Milwaukee was 14 of 51 from 3-point range, with Antetokounmpo going 3-for-6."}
{"game_id": "0022100060", "chunk_id": "0022100060_011", "order": 11, "role": "body", "text": "“Those are great shots that all those guys took,” said Middleton, who was 1 of 8 from beyond the arc. “The only way to get it back is getting stops on the defensive end. We did in stretches of the game, but we could just never get over that hump, it seems like. But I love the way we still fought. We were down 20, went one a quick run to cut to six or eight. There it’s an uphill battle, back and forth to try and get it to be tied or take the lead. Just one of those nights where it seemed we couldn’t any 3-ball to go down for us.”"}
{"game_id": "0022100060", "chunk_id": "0022100060_012", "order": 12, "role": "body", "text": "The Timberwolves never trailed, leading 44-34 after one quarter and 66-58 at the half. Minnesota used a 9-2 run midway through the third quarter to push the lead to 82-69."}
{"game_id": "0022100060", "chunk_id": "0022100060_013", "order": 13, "role": "body", "text": "Minnesota made 17 of 25 shots in the first quarter, including 6 of 10 from beyond the arc."}
{"game_id": "0022100060", "chunk_id": "0022100060_015", "order": 15, "role": "body", "text": "Timberwolves: Vanderbilt replaced Josh Okogie in the starting lineup and had seven rebounds, including four offensive, in 14 minutes in the first half."}
{"game_id": "0022100060", "chunk_id": "0022100060_016", "order": 16, "role": "body", "text": "Bucks: Lopez (back soreness) and Holiday (left ankle sprain) were inactive, along with G Donte DiVincenzo (left ankle reconstructive surgery). Lopez missed his fourth straight game. F Bobby Portis (left calf strain), who missed the first four games, made his first appearance, scoring six points."}
{"game_id": "0022100060", "chunk_id": "0022100060_018", "order": 18, "role": "body", "text": "Timberwolves: Host Denver on Saturday."}
{"game_id": "0022100060", "chunk_id": "0022100060_019", "order": 19, "role": "body", "text": "Bucks: Host San Antonio on Saturday."}
