{"game_id": "0022100450", "chunk_id": "0022100450_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Damian Lillard scored 32 points, Norman Powell added 28 and the Portland Trail Blazers beat Memphis 105-100 on Sunday night to snap the Grizzlies’ five-game winning streak."}
{"game_id": "0022100450", "chunk_id": "0022100450_002", "order": 2, "role": "body", "text": "Dillon Brooks scored a career-high 37 points for Memphis. The Grizzlies lost for the second time in their last 12 games."}
{"game_id": "0022100450", "chunk_id": "0022100450_003", "order": 3, "role": "body", "text": "“It’s not like we blew them out,” Lillard said. “We had to execute. We had to get stops. We had to weather a few storms. It was a great win.”"}
{"game_id": "0022100450", "chunk_id": "0022100450_004", "order": 4, "role": "body", "text": "Powell scored 20 in the second half to give the Trail Blazers their second straight victory after they snapped a seven-game losing streak with a home victory over Charlotte on Friday night."}
{"game_id": "0022100450", "chunk_id": "0022100450_005", "order": 5, "role": "body", "text": "Portland took the lead, 94-91, on a four-point play by Lillard with 4:02 left and reclaimed the advantage, 97-95, on a 3-pointer by Powell three minutes later."}
{"game_id": "0022100450", "chunk_id": "0022100450_006", "order": 6, "role": "body", "text": "“It was a big play,” Powell said about his 3-pointer. “I was just trying to find an opening. We are not going to get too excited, but it’s a great win for us. It was great to get a gritty win.”"}
{"game_id": "0022100450", "chunk_id": "0022100450_007", "order": 7, "role": "body", "text": "The Grizzlies had a chance to tie at 103 with 5.3 seconds to go, but Desmond Bane’s 3-pointer rimmed out. Nassir Little added two free throws with 1.8 seconds left to seal the win."}
{"game_id": "0022100450", "chunk_id": "0022100450_008", "order": 8, "role": "body", "text": "“Pulling a game out like this shows growth,” Lillard said."}
{"game_id": "0022100450", "chunk_id": "0022100450_009", "order": 9, "role": "body", "text": "Lillard scored 17 points of his 21 first-half points in the first quarter."}
{"game_id": "0022100450", "chunk_id": "0022100450_011", "order": 11, "role": "body", "text": "Grizzlies: Ja Morant, out since Nov. 26 with a sprained left knee, was removed from the team’s injury report, but did not play. Morant also returned from the NBA health and safety protocols and is permitted to practice and to be on the bench. Morant was out 12 days with his knee injury before entering protocols. ... The Grizzlies had 10 or more steals for the 11th straight time. The only NBA team with a longer streak was the 1997-98 Boston Celtics, who went 16 consecutive games with 10-plus steals from Feb. 25 to March 29, 1998. ... Dillon Brooks had his fifth consecutive 20-point game."}
{"game_id": "0022100450", "chunk_id": "0022100450_012", "order": 12, "role": "body", "text": "Trail Blazers: CJ McCollum (collapsed right lung) and Cody Zeller (patella) did not play. ... The Trail Blazers set a franchise record with 16 3s in their 125-116 win over Charlotte Friday night. They were 6 of 20 in the opening half Sunday against the Grizzlies and finished with 11. ... Portland limited the Grizzlies to 38.5% shooting."}
{"game_id": "0022100450", "chunk_id": "0022100450_014", "order": 14, "role": "body", "text": "Trail Blazers: At New Orleans on Tuesday night."}
{"game_id": "0022100450", "chunk_id": "0022100450_015", "order": 15, "role": "closing", "text": "Grizzlies: Host Oklahoma City on Monday night."}
