{"game_id": "0022100888", "chunk_id": "0022100888_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Marcus Morris Sr. scored 27 points and Luke Kennard added 25 as the Los Angeles Clippers sped to a 17-point lead in the first half and beat the Houston Rockets 142-111 Thursday night in the final game before the NBA’s All-Star break."}
{"game_id": "0022100888", "chunk_id": "0022100888_002", "order": 2, "role": "body", "text": "Terance Mann scored 20 points as the Clippers won for the third time in four games. Los Angeles shot 51.4% (18 of 35) from 3-point range, and had a 50-35 rebounding advantage. Kennard went 8 of 9 from 3-point range in his last game before Saturday’s 3-point contest."}
{"game_id": "0022100888", "chunk_id": "0022100888_003", "order": 3, "role": "body", "text": "“I think the last few games I played, there were some shots that I turned down and I think tonight I shot some tougher shots and had tougher looks,” Kennard said. “That’s what the coaches wanted me to do. Any kind of space, they want me to get it off, and I thought I had the mindset tonight of just doing it (in) the last game before the break.”"}
{"game_id": "0022100888", "chunk_id": "0022100888_004", "order": 4, "role": "body", "text": "Jalen Green had 21 points and Jae’Sean Tate added 19 for the Rockets, who lost their seventh straight game and for the 11th time in 12 games. Christian Wood and Josh Christopher scored 13 points apiece for Houston, which appeared to run out of energy one night after nearly pulling off a road upset over the Phoenix Suns."}
{"game_id": "0022100888", "chunk_id": "0022100888_005", "order": 5, "role": "body", "text": "“There were definitely times I looked out there and I was like, ‘Man, these guys are beat,’” Rockets head coach Stephen Silas said. “After a heck of a game last night, where they tried their hearts out and were all so into the game, tonight was a rough one for us.”"}
{"game_id": "0022100888", "chunk_id": "0022100888_006", "order": 6, "role": "body", "text": "The Clippers had their first double-digit lead of the game at 24-14, with 5:46 remaining in the first quarter. They led by 17 at 54-37 with 6:54 remaining in the first half and were up 71-59 at the break."}
{"game_id": "0022100888", "chunk_id": "0022100888_007", "order": 7, "role": "body", "text": "Los Angeles shot 58% (29 of 50) from the field in the first half and 63.2% (12 of 19) from 3-point range in the opening 24 minutes. The Clippers finished at 54.9% from the field."}
{"game_id": "0022100888", "chunk_id": "0022100888_008", "order": 8, "role": "body", "text": "The blowout widened in the third quarter as the Clippers reached the 100-point mark on a Kennard 3-pointer with 1:01 remaining in the period, and took a 107-79 lead into the fourth quarter."}
{"game_id": "0022100888", "chunk_id": "0022100888_009", "order": 9, "role": "body", "text": "Reggie Jackson had 12 points and a season-high 14 assists for the Clippers. Ivica Zubac had 13 points and 10 rebounds, and Amir Coffey and Isaiah Hartenstein each scored 13 points. Hartenstein and Mann added eight rebounds."}
{"game_id": "0022100888", "chunk_id": "0022100888_010", "order": 10, "role": "body", "text": "“We need to continue to build on what we have going right now,” said Clippers head coach Tyronn Lue, who brought an overnight bag to his postgame press conference and said he was heading immediately to Las Vegas for the break. “Coming into this last stretch, starting with a game against the Lakers, we talked about one game at a time. We knew it was going to be a tough stretch. To go (4-4) against the opponents we had, it’s a tribute to the guys in the locker room.”"}
{"game_id": "0022100888", "chunk_id": "0022100888_011", "order": 11, "role": "body", "text": "Dennis Schroder had nine points and nine assists in his third game (second start) with Houston after arriving in a trade last week with the Boston Celtics."}
{"game_id": "0022100888", "chunk_id": "0022100888_012", "order": 12, "role": "body", "text": "“You want guys who want to be here and want to come in and help the other guys, especially in the situation we’re in,” Silas said about Schroder. “We need guys who are willing to pull guys aside and communicate, and he adds to our depth and guard rotation.”"}
{"game_id": "0022100888", "chunk_id": "0022100888_014", "order": 14, "role": "body", "text": "Rockets: After playing 38 minutes Wednesday at Phoenix, G Eric Gordon was inactive with a sore right groin. … G Kevin Porter Jr. missed his second-consecutive game with an undisclosed illness. … Wood returned to the starting lineup after missing Friday’s game with an undisclosed illness."}
{"game_id": "0022100888", "chunk_id": "0022100888_015", "order": 15, "role": "body", "text": "Clippers: The starting lineup of Nicolas Batum, Morris, Zubac, Mann and Jackson improved to 4-1 on the season. … Kennard went 6 of 7 from long distance in the first half. … Semi Ojeleye, who was acquired from the Milwaukee Bucks last week, scored his first seven points for the Clippers … The Minnesota Timberwolves’ Patrick Beverley was sitting courtside wearing a Zubac Clippers jersey in honor of his former teammate."}
{"game_id": "0022100888", "chunk_id": "0022100888_017", "order": 17, "role": "body", "text": "Rockets: Visit the Orlando Magic next Friday."}
{"game_id": "0022100888", "chunk_id": "0022100888_018", "order": 18, "role": "body", "text": "Clippers: Visit the Los Angeles Lakers next Friday."}
