{"game_id": "0022100198", "chunk_id": "0022100198_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — DeMar DeRozan scored 35 points and Zach LaVine added 29 to help the Chicago Bulls beat the Los Angeles Clippers 100-90 on Sunday night, ending the Clippers’ seven-game winning streak."}
{"game_id": "0022100198", "chunk_id": "0022100198_002", "order": 2, "role": "body", "text": "Lonzo Ball had 10 points for the Bulls, who used generous amounts of Los Angeles-area talent to earn the victory. DeRozan is a LA native who went to USC, while LaVine and Ball attended UCLA."}
{"game_id": "0022100198", "chunk_id": "0022100198_003", "order": 3, "role": "body", "text": "“We battled and fought,” Bulls coach Billy Donovan said after his team held the Clippers to 35.8% from the field and 32.4% from 3-point range. “Everybody who went in there helped. It was a game where everyone went small. So yeah, I was happy with the way we played defense.”"}
{"game_id": "0022100198", "chunk_id": "0022100198_004", "order": 4, "role": "body", "text": "Paul George scored 27 points and had 11 rebounds for the Clippers, while Eric Bledsoe added 21 points. Los Angeles lost for the first time since Oct. 29 at Portland."}
{"game_id": "0022100198", "chunk_id": "0022100198_005", "order": 5, "role": "body", "text": "George and Reggie Jackson, who lead the Clippers with more than eight 3-point attempts per game, were a combined 5 of 21 from distance. Jackson scored 13 points while going 4 of 17 from the field."}
{"game_id": "0022100198", "chunk_id": "0022100198_006", "order": 6, "role": "body", "text": "“Couldn’t make shots, couldn’t get them to fall,” George said. “A lot of in and outs, lot of good looks, just wasn’t my night shooting.”"}
{"game_id": "0022100198", "chunk_id": "0022100198_007", "order": 7, "role": "body", "text": "The Bulls’ Alex Caruso, a former Laker who is in his first season in Chicago, scored just seven points but had nine rebounds and helped thwart the Clippers’ long-distance shooters over a team-high 39 minutes."}
{"game_id": "0022100198", "chunk_id": "0022100198_008", "order": 8, "role": "body", "text": "“He’s one of the highest IQ players I’ve played with,” DeRozan said about Caruso. “It makes life so much easier for us when he’s out there.”"}
{"game_id": "0022100198", "chunk_id": "0022100198_009", "order": 9, "role": "body", "text": "Chicago is 1-1 to open a five-game trip that includes a visit to the Lakers on Monday."}
{"game_id": "0022100198", "chunk_id": "0022100198_010", "order": 10, "role": "body", "text": "The Bulls had a double-digit lead less than five minutes into the game and had a 17-point advantage one minute into the second quarter after a cutting layup by Ayo Dosunmu. The Bulls led 54-45 at the half."}
{"game_id": "0022100198", "chunk_id": "0022100198_011", "order": 11, "role": "body", "text": "The Clippers did go in front 78-77 with 10 minutes to go on a fall-away, fall-down 10-footer from George. But the Bulls answered with a 9-0 run, capped by a LaVine 3-pointer, for an 86-78 advantage and held on from there."}
{"game_id": "0022100198", "chunk_id": "0022100198_012", "order": 12, "role": "body", "text": "“Our guys got tired,” Clippers coach Tyronn Lue said of the loss one day after a 129-102 victory over the Minnesota Timberwolves. “I messed up and played them to many minutes. … That was on me, so whatever. Start a new (winning) streak.”"}
{"game_id": "0022100198", "chunk_id": "0022100198_014", "order": 14, "role": "body", "text": "Bulls: G Coby White has not played this season after shoulder surgery. That'll change this week: He was cleared to make his season debut Monday against the Lakers, Donovan said."}
{"game_id": "0022100198", "chunk_id": "0022100198_015", "order": 15, "role": "body", "text": "Clippers: F Marcus Morris, who has not played since Oct. 23, is making progress on a left knee injury, according to Lue. LA still doesn't know if Morris will be on a two-game road trip later this week."}
{"game_id": "0022100198", "chunk_id": "0022100198_017", "order": 17, "role": "body", "text": "Bulls: At the Los Angeles Lakers on Monday."}
{"game_id": "0022100198", "chunk_id": "0022100198_018", "order": 18, "role": "closing", "text": "Clippers: Host San Antonio on Tuesday."}
