{"game_id": "0022100892", "chunk_id": "0022100892_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Karl-Anthony Towns was on the Minnesota bench for half of the fourth quarter with five fouls. Anthony Edwards was having a way-off night with the ball."}
{"game_id": "0022100892", "chunk_id": "0022100892_002", "order": 2, "role": "body", "text": "D'Angelo Russell had no trouble taking over in a playoff-worthy performance by the rising Timberwolves."}
{"game_id": "0022100892", "chunk_id": "0022100892_003", "order": 3, "role": "body", "text": "Russell had 23 of his 37 points in the fourth quarter, including a tiebreaking 3-pointer with 1:23 left, to lead the Timberwolves past the Memphis Grizzlies 119-114 on Thursday."}
{"game_id": "0022100892", "chunk_id": "0022100892_004", "order": 4, "role": "body", "text": "“They can’t stop all of us. I think that’s the hardest thing for any team, to stop all three of us,” Russell said. “If something’s not working, we see the next plan working.”"}
{"game_id": "0022100892", "chunk_id": "0022100892_005", "order": 5, "role": "body", "text": "Towns added 22 points and 11 rebounds and Malik Beasley had 17 points on 5-for-7 shooting from 3-point range for the Timberwolves, who grinded and hustled their way to a season split of four games against the Grizzlies. They could meet again, of course, in the playoffs."}
{"game_id": "0022100892", "chunk_id": "0022100892_006", "order": 6, "role": "body", "text": "“We feel like we play this team really well. We feel like we match up,” Timberwolves coach Chris Finch said. “We feel like we should be at least 3-1 against them this season. They’ve found ways to beat us in the end.”"}
{"game_id": "0022100892", "chunk_id": "0022100892_007", "order": 7, "role": "body", "text": "Not this time, when Ja Morant's 3-pointer from the top of the key with 5 seconds remaining fell well short. He was well-guarded by Edwards, who celebrated the defensive success afterward like it was a 40-point game."}
{"game_id": "0022100892", "chunk_id": "0022100892_008", "order": 8, "role": "body", "text": "“I always tell people I’d rather get a game-saving block than a game-winning shot. I take pride in that,\" Edwards said. \"I feel like anybody can hit a game-winning shot. But I don’t think anybody can go get a game-winning block ... or a game-winning stop.”"}
{"game_id": "0022100892", "chunk_id": "0022100892_009", "order": 9, "role": "body", "text": "The Grizzlies were ahead by as many as 15 points in the first quarter but lost their lead for good on Russell's layup with 7:11 to go. Russell also broke ties with a 3-pointer with 6:23 left and a pair of free throws at the 2-minute mark."}
{"game_id": "0022100892", "chunk_id": "0022100892_010", "order": 10, "role": "body", "text": "“He got whatever he wanted out of pick and roll,” Finch said."}
{"game_id": "0022100892", "chunk_id": "0022100892_011", "order": 11, "role": "body", "text": "The Grizzlies, one of the most well-rounded teams in the league who brought the NBA's third-best record out of the All-Star break, were ultimately done in by mental breakdowns on defense."}
{"game_id": "0022100892", "chunk_id": "0022100892_012", "order": 12, "role": "body", "text": "“We gave them too many open looks, layups, free throws,” coach Taylor Jenkins said. “If we’re going to be good and take the next step as a team, we’re always going to have the physical edge but we’ve got to have that mental edge. We didn’t have it tonight.”"}
{"game_id": "0022100892", "chunk_id": "0022100892_013", "order": 13, "role": "body", "text": "Ziaire Williams and Jaren Jackson Jr. each scored 21 points for Memphis, which averaged more than 126 points over a 6-1 stretch leading into the All-Star break. This was far from the finest or sharpest performance for the Grizzlies, but their 59-42 rebounding edge helped keep them in it."}
{"game_id": "0022100892", "chunk_id": "0022100892_014", "order": 14, "role": "body", "text": "Brandon Clarke's tip-in with 1:40 remaining gave the Grizzlies a 114-all tie, but Russell — who urged Minnesota's fans earlier this month to crank up the noise — sent the crowd into a frenzy at the other end with another swish."}
{"game_id": "0022100892", "chunk_id": "0022100892_016", "order": 16, "role": "body", "text": "Morant was not at full strength after getting hurt in the third quarter, an injury that Jenkins described as cramping. Morant gutted his way to 20 points despite shooting 7 for 25, never shying from knifing through traffic and taking the ball to the basket — oftentimes hitting the floor hard after letting it go."}
{"game_id": "0022100892", "chunk_id": "0022100892_017", "order": 17, "role": "body", "text": "Morant, who became the first guard and the youngest player in Grizzlies history to make the All-Star Game last week, gave them a scare when he hobbled to the locker room while clutching at his left hip. But he was back for the fourth quarter to set up the taut finish."}
{"game_id": "0022100892", "chunk_id": "0022100892_018", "order": 18, "role": "body", "text": "“He basically just needed to get stretched out, and he was better. He's obviously going to be sore,” Jenkins said."}
{"game_id": "0022100892", "chunk_id": "0022100892_020", "order": 20, "role": "body", "text": "Grizzlies: Morant's backup, Tyus Jones, had just three points and three assists in 13 minutes on the floor he played on for his first four seasons in the league. Jones also won a state championship at Target Center with Apple Valley High School in 2013. ... The Grizzlies had their five-game road winning streak stopped. They're 21-10 away from home, the NBA's second-best record."}
{"game_id": "0022100892", "chunk_id": "0022100892_021", "order": 21, "role": "body", "text": "Timberwolves: Edwards shot just 1 for 11 to finish with five points. He has only 20 points in his last three games on 4-for-29 shooting, including 1 for 17 from 3-point range. ... Minnesota moved into a 51-50 lead in the all-time series with Memphis."}
{"game_id": "0022100892", "chunk_id": "0022100892_023", "order": 23, "role": "body", "text": "Grizzlies: Visit Chicago on Saturday."}
{"game_id": "0022100892", "chunk_id": "0022100892_024", "order": 24, "role": "body", "text": "Timberwolves: Host Philadelphia on Friday."}
