{"game_id": "0022100042", "chunk_id": "0022100042_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Giannis Antetokounmpo went into attack mode with the defending NBA champion Milwaukee Bucks playing short-handed Monday night."}
{"game_id": "0022100042", "chunk_id": "0022100042_002", "order": 2, "role": "body", "text": "He carried them to another victory."}
{"game_id": "0022100042", "chunk_id": "0022100042_003", "order": 3, "role": "body", "text": "Antetokounmpo finished with 30 points, 10 rebounds and nine assists, and Khris Middleton added 27 points to help the Bucks beat Indiana 119-109."}
{"game_id": "0022100042", "chunk_id": "0022100042_004", "order": 4, "role": "body", "text": "“It was really aggressive Giannis tonight,\" coach Mike Budenholzer said. “At the same time, he making reads, making great passes. When he's attacking like that, that's when we are at our best. He had that extra gear tonight.\""}
{"game_id": "0022100042", "chunk_id": "0022100042_005", "order": 5, "role": "body", "text": "It showed on a night Budenholzer held out two injured starters — center Brook Lopez and guard Jrue Holiday — as well as key backup Bobby Portis. Thanks to Antetokounmpo and Middleton, they still had enough scoring punch to pull away from the Pacers early and hold off a late charge."}
{"game_id": "0022100042", "chunk_id": "0022100042_006", "order": 6, "role": "body", "text": "Indiana has lost three of its first four games under new coach Rick Carlisle, this time with Malcolm Brogdon scoring 25 points and Domantas Sabonis with 21 points, 13 rebounds and five assists"}
{"game_id": "0022100042", "chunk_id": "0022100042_007", "order": 7, "role": "body", "text": "The Pacers never led after Middleton closed the first quarter with a four-point play that broke a 30-30 tie and couldn't get closer than three the rest of the game."}
{"game_id": "0022100042", "chunk_id": "0022100042_008", "order": 8, "role": "body", "text": "“The fourth quarter was encouraging,\" Carlisle said. “We held them to 18 points and made some runs. The other three quarters were uneven and not good enough. We've got some things to do better and need to clean up.”"}
{"game_id": "0022100042", "chunk_id": "0022100042_009", "order": 9, "role": "body", "text": "Antetokounmpo certainly can cause those problems — and he did repeatedly against the Pacers."}
{"game_id": "0022100042", "chunk_id": "0022100042_010", "order": 10, "role": "body", "text": "The Bucks extended the lead to 57-46 midway through the second quarter and fended off one challenge when Sabonis' spinning layup made it 60-57 by responded with the final six points of the first half. Milwaukee extended the lead to 83-66 in the third, only to watch Indiana close to 107-102 with 6:21 left in the game."}
{"game_id": "0022100042", "chunk_id": "0022100042_011", "order": 11, "role": "body", "text": "But Antetounkmpo helped force a key turnover and the Bucks rebuilt their lead."}
{"game_id": "0022100042", "chunk_id": "0022100042_012", "order": 12, "role": "body", "text": "“Credit Giannis and just his defensive action there, to get that turnover was big,\" Budenholzer said. “He was special in the paint tonight.\""}
{"game_id": "0022100042", "chunk_id": "0022100042_014", "order": 14, "role": "body", "text": "Bucks: Grayson Allen went 4 of 9 for 3-pointers and finished with 19 points. Pat Connaughton had 13 points. ... Middleton also had seven assists. ... The Bucks had 13 steals. ... Lopez (sore back), Jrue Holiday (left ankle) and Portis (sore back) weren't Milwaukee's only missing players. Guard Donte DiVencenzo (left ankle) and forward Semi Ojeley (left calf) also sat out. ... The Bucks have won five straight in the series and are 39-4 against Central Division foes under coach Mike Budenholzer's tenure."}
{"game_id": "0022100042", "chunk_id": "0022100042_015", "order": 15, "role": "body", "text": "Pacers: Chris Duarte had 18 points, Justin Holiday finished with 12 and Jeremy Lamb scored 11. ... Myles Turner had five points and four rebounds but played only 14 minutes after getting into early foul trouble. ... The Pacers held a 47-42 rebounding advantage, giving up just seven offensive rebounds. But they had 19 turnovers and were 14 of 36 on 3-pointers. ... Carlisle still needs one win to tie Nate McMillan (183) for the third-most in the franchise's NBA history."}
{"game_id": "0022100042", "chunk_id": "0022100042_017", "order": 17, "role": "body", "text": "The game was marred by a brief shouting match midway through the fourth quarter, which occurred on a tie-up between Brogdon and Bucks guard George Hill underneath the Pacers basket. But the bigger issue came when Middleton and Goga Bitadze wound up on the court. Bitadze was pulled out of the pile by the seat of his pants. Hill and Bitadze were each given technical fouls following a replay review."}
{"game_id": "0022100042", "chunk_id": "0022100042_019", "order": 19, "role": "body", "text": "Turner wore custom-designed shoes as part of a contest sponsored by Mountain Dew. The shoes came in the Pacers team colors, blue and gold. One shoe came with an Indianapolis city flag while the other included Indiana's nickname and the Pacers team logo."}
{"game_id": "0022100042", "chunk_id": "0022100042_021", "order": 21, "role": "body", "text": "Bucks: Host Minnesota on Wednesday."}
{"game_id": "0022100042", "chunk_id": "0022100042_022", "order": 22, "role": "body", "text": "Pacers: In Toronto on Wednesday in the first of two matchups this week."}
