{"game_id": "0022101118", "chunk_id": "0022101118_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Jae Crowder's wide-open 3-pointer late in the fourth quarter Sunday sealed yet another win for the Phoenix Suns, who continue to pile up victories even though they've accomplished just about everything possible in an NBA regular season."}
{"game_id": "0022101118", "chunk_id": "0022101118_002", "order": 2, "role": "body", "text": "Motivation isn't a problem for these Suns, who hope they're just getting started."}
{"game_id": "0022101118", "chunk_id": "0022101118_003", "order": 3, "role": "body", "text": "Devin Booker scored 35 points, Chris Paul had 19 points and 14 assists and the NBA-leading Suns won their eighth straight game, beating the Philadelphia 76ers 114-104 on Sunday."}
{"game_id": "0022101118", "chunk_id": "0022101118_004", "order": 4, "role": "body", "text": "“The motivation comes from last year,” said Crowder, who was part of the Suns last season when they lost to Milwaukee in the NBA Finals. “Making it all the way to the Finals and not achieving the main goal — that's the ultimate motivation. That's all you need. You want to get back there, you want a different story."}
{"game_id": "0022101118", "chunk_id": "0022101118_006", "order": 6, "role": "body", "text": "The game Sunday was an intriguing matchup between two teams with an eye on the Finals. The Suns have wrapped up the No. 1 seed in the Western Conference and best record in the league, while the 76ers are fighting Milwaukee, Boston and Miami for the top spot in the East. The loss left the 76ers tied with the Bucks, a half-game behind the Celtics and Heat."}
{"game_id": "0022101118", "chunk_id": "0022101118_007", "order": 7, "role": "body", "text": "Phoenix is 61-14, a victory shy of trying the franchise season victory record. The 76ers had their three-game winning streak snapped despite another big game from Joel Embiid, who had 37 points and 15 rebounds."}
{"game_id": "0022101118", "chunk_id": "0022101118_008", "order": 8, "role": "body", "text": "“That is the best team in the league for a reason,” Embiid said. “They've got a bunch of great players who play well together. They are connected offensively and defensively, they don’t get rattled.”"}
{"game_id": "0022101118", "chunk_id": "0022101118_009", "order": 9, "role": "body", "text": "Philadelphia's other star, James Harden, had a tough game, shooting 2 of 11 from the field. He had 14 points, nine assists and seven rebounds."}
{"game_id": "0022101118", "chunk_id": "0022101118_010", "order": 10, "role": "body", "text": "The Suns took a 91-86 lead into the final quarter. They pushed that advantage to 101-90 by midway through the quarter, but the 76ers scored 10 straight points — highlighted by two 3-pointers from Tyrese Maxey — to get back it it."}
{"game_id": "0022101118", "chunk_id": "0022101118_011", "order": 11, "role": "body", "text": "But Booker responded by making another tough jumper while getting fouled by Danny Green and the Suns pulled away for the victory. Booker shot 13 of 22 from the field, including 3 of 5 from 3-point range, in one of his more efficient games this season."}
{"game_id": "0022101118", "chunk_id": "0022101118_012", "order": 12, "role": "body", "text": "He said playing against another team with Finals aspirations helps with motivation."}
{"game_id": "0022101118", "chunk_id": "0022101118_013", "order": 13, "role": "body", "text": "“That's a talented team that we could possibly see at the end,” Booker said. “We just want to make statements. Play the right brand of basketball and wear teams down.”"}
{"game_id": "0022101118", "chunk_id": "0022101118_014", "order": 14, "role": "body", "text": "The 76ers took a 39-37 lead into the second quarter despite Booker's 22 points in the first on 8-of-11 shooting. When Booker went to the bench to start the second quarter, the 76ers responded with a 12-0 run."}
{"game_id": "0022101118", "chunk_id": "0022101118_015", "order": 15, "role": "body", "text": "Philadelphia led the entire second quarter and took a 64-60 lead into the break. Embiid had 19 points and eight rebounds before the break while Tobias Harris added 15 points. Harris finished with 17."}
{"game_id": "0022101118", "chunk_id": "0022101118_017", "order": 17, "role": "body", "text": "The 76ers had a scary moment late in the third quarter when Embiid rolled his ankle."}
{"game_id": "0022101118", "chunk_id": "0022101118_018", "order": 18, "role": "body", "text": "Embiid missed an easy layup but then snared the offensive rebound before landing on Booker's foot. Embiid limped down the court on defense before getting taken out of the game. He eventually returned in the fourth quarter."}
{"game_id": "0022101118", "chunk_id": "0022101118_020", "order": 20, "role": "body", "text": "76ers: Maxey scored 18 points, but shot just 7 of 21 from the field. ... The 76ers have a six-game losing streak against the Suns."}
{"game_id": "0022101118", "chunk_id": "0022101118_021", "order": 21, "role": "body", "text": "Suns: Cam Johnson missed his 12th straight game with a right quad contusion. ... JaVale McGee was out because of a non-COVID illness. ... Scott Foster was among the three officials Sunday. Paul has been a vocal critic of Foster in the past. ... Shamet played part of his rookie season in 2018-19 with the 76ers before being traded to the Los Angeles Clippers. ... Hosted a sellout crowd at the Footprint Center for a 24th straight game."}
{"game_id": "0022101118", "chunk_id": "0022101118_023", "order": 23, "role": "body", "text": "76ers: Host Milwaukee on Tuesday night."}
{"game_id": "0022101118", "chunk_id": "0022101118_024", "order": 24, "role": "body", "text": "Suns: At Golden State on Wednesday night."}
