{"game_id": "0022100878", "chunk_id": "0022100878_001", "order": 1, "role": "lead", "text": "CHICAGO -- — DeMar DeRozan's spectacular run is now one for the NBA record book."}
{"game_id": "0022100878", "chunk_id": "0022100878_002", "order": 2, "role": "body", "text": "DeRozan scored 38 points in breaking a mark set by Hall of Famer Wilt Chamberlain, and the Chicago Bulls beat the Sacramento Kings 125-118 on Wednesday night."}
{"game_id": "0022100878", "chunk_id": "0022100878_003", "order": 3, "role": "body", "text": "DeRozan, who made 16 of 27 field goals, became the first player in NBA history to score 35 or more points and shoot 50% or better in seven consecutive games. Chamberlain did it in six straight twice — during the 1960-61 and 1962-63 seasons."}
{"game_id": "0022100878", "chunk_id": "0022100878_004", "order": 4, "role": "body", "text": "It was also DeRozan’s eighth game in a row with 30 or more points. It’s the longest such streak by a Bulls player since Michael Jordan did it in eight straight in January 1996."}
{"game_id": "0022100878", "chunk_id": "0022100878_005", "order": 5, "role": "body", "text": "DeRozan had difficulty describing just how locked in he is. And when it came to the record, he was “speechless.”"}
{"game_id": "0022100878", "chunk_id": "0022100878_006", "order": 6, "role": "body", "text": "“As a kid, as a fan of the history of the game, being in the league as long as I've been in this league — things like that continue to make me even more humble,” he said. “Being an NBA player and being able to have the privilege to be able to play this long and have these opportunities, man, it's something I never take for granted. And the crazy thing is I felt like I missed eight easy shots I normally would have made.”"}
{"game_id": "0022100878", "chunk_id": "0022100878_007", "order": 7, "role": "body", "text": "Coby White set a season high with 31 points and matched one with six 3-pointers. Nikola Vucevic added 21 points and 10 rebounds as the Bulls won their fifth straight."}
{"game_id": "0022100878", "chunk_id": "0022100878_008", "order": 8, "role": "body", "text": "They also moved a half-game ahead of Miami for the Eastern Conference lead even though Zach LaVine missed his third in a row because of soreness in his left knee. They are guaranteed at least a share of first place at the All-Star break, with the Heat visiting Charlotte on Thursday."}
{"game_id": "0022100878", "chunk_id": "0022100878_009", "order": 9, "role": "body", "text": "“I'm just really appreciative of this group of guys from top to bottom — the way they come to work every day, how professional they are, how they try to keep themselves ready, how it's all about the team, it's all about winning and what each individual can do to impact and help in winning,\" Bulls coach Billy Donovan said."}
{"game_id": "0022100878", "chunk_id": "0022100878_011", "order": 11, "role": "body", "text": "De’Aaron Fox led Sacramento with 33 points and nine assists. Domantas Sabonis added 22 points, 12 rebounds and eight assists in his fourth game since a trade from Indiana."}
{"game_id": "0022100878", "chunk_id": "0022100878_012", "order": 12, "role": "body", "text": "Justin Holiday made six 3s and scored 18 points. Harrison Barnes added 17 points, but the Kings dropped their second straight after winning two in a row."}
{"game_id": "0022100878", "chunk_id": "0022100878_013", "order": 13, "role": "body", "text": "“I know that stigma or whatever is out there, but being here with this team, that’s not what this organization is about,” said Holiday, acquired with Sabonis from Indiana. \"They want to win.”"}
{"game_id": "0022100878", "chunk_id": "0022100878_015", "order": 15, "role": "body", "text": "DeRozan hit the 30-point mark when he nailed a 15-footer off a crossover to make it 107-98 with 7:10 left. And he made several big shots down the stretch."}
{"game_id": "0022100878", "chunk_id": "0022100878_016", "order": 16, "role": "body", "text": "DeRozan hit a 3 with about 5:15 left after Sacramento pulled within two. He also converted a three-point play to bump the lead to 115-109 with 3:51 remaining, and the Bulls remained in control the rest of the way."}
{"game_id": "0022100878", "chunk_id": "0022100878_018", "order": 18, "role": "body", "text": "The Bulls apparently are about to sign Tristan Thompson."}
{"game_id": "0022100878", "chunk_id": "0022100878_019", "order": 19, "role": "body", "text": "Indiana coach Rick Carlisle announced the Pacers are waiving the veteran big man and that he is headed to Chicago."}
{"game_id": "0022100878", "chunk_id": "0022100878_020", "order": 20, "role": "body", "text": "“He'll be joining a contending team in the East — a little bit north if anybody wants to tweet, starts with a C and ends with an O,” Carlisle said after Thompson scored 17 points in the Pacers' win over Washington."}
{"game_id": "0022100878", "chunk_id": "0022100878_021", "order": 21, "role": "body", "text": "In case there was any doubt, Carlisle clarified: “Chicago, if anybody didn't get that.”"}
{"game_id": "0022100878", "chunk_id": "0022100878_022", "order": 22, "role": "body", "text": "Thompson, in his 11th season, won a championship with Cleveland in 2016. He was traded to the Pacers last week as part of the deal for Sabonis."}
{"game_id": "0022100878", "chunk_id": "0022100878_023", "order": 23, "role": "body", "text": "The Bulls are looking for frontcourt help."}
{"game_id": "0022100878", "chunk_id": "0022100878_024", "order": 24, "role": "body", "text": "Donovan said he had not heard “anything along the lines of that happening” and said it was “the first I'm hearing of it.”"}
{"game_id": "0022100878", "chunk_id": "0022100878_026", "order": 26, "role": "body", "text": "Kings: Interim coach Alvin Gentry said G Davion Mitchell (bruised right hand) has “just a little contusion” and wasn't sure if the No. 9 overall draft pick will play in the Rising Stars game in Cleveland on Friday during All-Star weekend."}
{"game_id": "0022100878", "chunk_id": "0022100878_027", "order": 27, "role": "body", "text": "Bulls: LaVine has been cleared medically to participate in All-Star festivities this weekend in Cleveland and return to the lineup after the break. LaVine got the OK after having his left knee drained and a lubricant injected in Los Angeles, Donovan said. LaVine can resume activities after about 48 hours. ... Donovan said he expected G Alex Caruso (broken right wrist) to start dribbling and shooting in a week to 10 days."}
{"game_id": "0022100878", "chunk_id": "0022100878_029", "order": 29, "role": "body", "text": "Kings: Host the Denver Nuggets on Feb. 24."}
{"game_id": "0022100878", "chunk_id": "0022100878_030", "order": 30, "role": "body", "text": "Bulls: Host the Atlanta Hawks on Feb. 24."}
