{"game_id": "0022100630", "chunk_id": "0022100630_001", "order": 1, "role": "lead", "text": "NEW YORK -- — James Harden had the look of a man who needed rest, even before explaining how he felt."}
{"game_id": "0022100630", "chunk_id": "0022100630_002", "order": 2, "role": "body", "text": "“Tired,” he said. “Exhausted.”"}
{"game_id": "0022100630", "chunk_id": "0022100630_003", "order": 3, "role": "body", "text": "That wasn't because he just played a basketball game."}
{"game_id": "0022100630", "chunk_id": "0022100630_004", "order": 4, "role": "body", "text": "The Nets are worn down from a rough stretch of travel, then were beaten down by the Oklahoma City Thunder."}
{"game_id": "0022100630", "chunk_id": "0022100630_005", "order": 5, "role": "body", "text": "Shai Gilgeous-Alexander had 33 points, 10 rebounds and nine assists, Lu Dort scored 27 points and the Thunder ran by the Nets 130-109 on Thursday night."}
{"game_id": "0022100630", "chunk_id": "0022100630_006", "order": 6, "role": "body", "text": "Rookie guard Josh Giddey added 19 points for the Thunder, who jumped on a weary Nets team to snap a five-game losing streak with their first victory in 2022. They hadn't won since beating New York at home on New Year's Eve."}
{"game_id": "0022100630", "chunk_id": "0022100630_007", "order": 7, "role": "body", "text": "But with NBA scoring leader Kevin Durant resting, the Thunder led comfortably for most of the last three quarters and improved to 14-27 at the midpoint of their schedule."}
{"game_id": "0022100630", "chunk_id": "0022100630_008", "order": 8, "role": "body", "text": "“I think we just had it clicking,” Darius Bazley said. “Shai got off to a crazy start, Lu had it going. We were just firing on all cylinders.”"}
{"game_id": "0022100630", "chunk_id": "0022100630_009", "order": 9, "role": "body", "text": "Oklahoma City made a season-high 20 3-pointers and had a season-best 32 assists."}
{"game_id": "0022100630", "chunk_id": "0022100630_010", "order": 10, "role": "body", "text": "Harden had 26 points, nine assists and seven rebounds for the Nets, who couldn’t muster enough energy after their 138-112 rout of the East-leading Bulls in Chicago on Wednesday night."}
{"game_id": "0022100630", "chunk_id": "0022100630_011", "order": 11, "role": "body", "text": "They had Kyrie Irving for that game but not Thursday, as he remains ineligible to play in New York City while unvaccinated against the coronavirus."}
{"game_id": "0022100630", "chunk_id": "0022100630_012", "order": 12, "role": "body", "text": "That left only Harden among the Nets’ Big Three, playing with two rookie starters and two more playing key roles off the bench."}
{"game_id": "0022100630", "chunk_id": "0022100630_013", "order": 13, "role": "body", "text": "Cam Thomas, one of the rookie reserves, added 21 points. Brooklyn fell to 11-11 at home."}
{"game_id": "0022100630", "chunk_id": "0022100630_014", "order": 14, "role": "body", "text": "The Nets were playing their fourth game in five days, a stretch that began with a home victory Sunday over San Antonio and a loss the next night in Portland. That made the Nets the first team since Detroit in 1973 to play in the Eastern and Pacific time zones on consecutive days and it seemed to have sapped them by the time they returned home again."}
{"game_id": "0022100630", "chunk_id": "0022100630_015", "order": 15, "role": "body", "text": "Harden said he got home around 5 a.m. on Thursday, finally falling asleep a couple hours later."}
{"game_id": "0022100630", "chunk_id": "0022100630_016", "order": 16, "role": "body", "text": "Gilgeous-Alexander scored 12 straight points, sending the Thunder from two points down into a 21-11 lead. He had 16 consecutive Oklahoma City points and the Thunder led 38-26 after one quarter."}
{"game_id": "0022100630", "chunk_id": "0022100630_017", "order": 17, "role": "body", "text": "His three-point play gave Oklahoma City a 21-point lead with 1:08 left in the half and it was 70-51 at the break."}
{"game_id": "0022100630", "chunk_id": "0022100630_018", "order": 18, "role": "body", "text": "Mike Muscala said the Thunder have struggled getting off to good starts but knew they could jump on a short-handed team Thursday."}
{"game_id": "0022100630", "chunk_id": "0022100630_019", "order": 19, "role": "body", "text": "“We definitely talked about that, just trying to really be the aggressor tonight and come out and deliver that punch,” he said."}
{"game_id": "0022100630", "chunk_id": "0022100630_020", "order": 20, "role": "body", "text": "The lead grew to 22 in the third quarter, though Brooklyn got it to 104-96 with about 8 1/2 minutes to play. The Thunder quickly ran off a 14-4 spurt, capped by consecutive 3-pointers from Dort and Gilgeous-Alexander that made it 118-100."}
{"game_id": "0022100630", "chunk_id": "0022100630_022", "order": 22, "role": "body", "text": "Thunder: Bazley scored 16 points. ... The Thunder snapped a five-game road losing streak."}
{"game_id": "0022100630", "chunk_id": "0022100630_023", "order": 23, "role": "body", "text": "Nets: Brooklyn remained without big men LaMarcus Aldridge (sore right foot) and Nic Claxton (left hamstring tightness). ... Durant remained the leading vote-getter among Eastern Conference players in the second fan returns of All-Star voting announced Thursday. He has more than 4 million votes."}
{"game_id": "0022100630", "chunk_id": "0022100630_025", "order": 25, "role": "body", "text": "Brooklyn coach Steve Nash said the Nets were being cautious in deciding to rest Durant and Patty Mills, who has had to play more minutes than expected with Irving playing only three games and Joe Harris recovering from ankle surgery."}
{"game_id": "0022100630", "chunk_id": "0022100630_026", "order": 26, "role": "body", "text": "“I think those guys have just played so much and they have so much responsibility in the games recently that it’s just, it wouldn’t be smart for them to play tonight,” Nash said."}
{"game_id": "0022100630", "chunk_id": "0022100630_028", "order": 28, "role": "body", "text": "The Thunder have won seven straight in New York. They haven't lost on the road to either the Knicks or Nets since December 2017."}
{"game_id": "0022100630", "chunk_id": "0022100630_030", "order": 30, "role": "body", "text": "Thunder: Host the Cleveland Cavaliers on Saturday."}
{"game_id": "0022100630", "chunk_id": "0022100630_031", "order": 31, "role": "body", "text": "Nets: Host the New Orleans Pelicans on Saturday."}
