{"game_id": "0022100215", "chunk_id": "0022100215_001", "order": 1, "role": "lead", "text": "ATLANTA -- — John Collins scored 20 points, Cam Reddish and Kevin Huerter had 19 apiece and the Atlanta Hawks won their third straight game with a 110-99 victory over the Boston Celtics on Wednesday night."}
{"game_id": "0022100215", "chunk_id": "0022100215_002", "order": 2, "role": "body", "text": "The Celtics missed a chance to climb above .500 for the first time this season."}
{"game_id": "0022100215", "chunk_id": "0022100215_003", "order": 3, "role": "body", "text": "Trae Young chipped in with 18 points and 11 assists as the Hawks used a balanced attack to overcome a 34-point performance by Jayson Tatum."}
{"game_id": "0022100215", "chunk_id": "0022100215_004", "order": 4, "role": "body", "text": "The Celtics spent a lot of time doubling Young."}
{"game_id": "0022100215", "chunk_id": "0022100215_005", "order": 5, "role": "body", "text": "The other Hawks made Boston pay."}
{"game_id": "0022100215", "chunk_id": "0022100215_006", "order": 6, "role": "body", "text": "“If a team wants to take Ice (Young) out of the game, the other guys should be empowered to do more,\" Collins said. “The game becomes easy for us. We have so many skilled guys.”"}
{"game_id": "0022100215", "chunk_id": "0022100215_007", "order": 7, "role": "body", "text": "After Reddish knocked down a 3-pointer to push Atlanta to an 81-70 lead with 3 1/2 minutes left in the third quarter, the margin never dipped below 10 points until former Hawk Dennis Schröder connected on a trey to cut it to 108-99 with 1:47 left."}
{"game_id": "0022100215", "chunk_id": "0022100215_008", "order": 8, "role": "body", "text": "Young answered with a pull-up jumper in the lane and the Celtics were done. Neither team scored the rest of the way."}
{"game_id": "0022100215", "chunk_id": "0022100215_009", "order": 9, "role": "body", "text": "Huerter scored all his points in the first half, going 5 of 6 from 3-point range. Reddish, Collins and Young carried the load the rest of the way."}
{"game_id": "0022100215", "chunk_id": "0022100215_010", "order": 10, "role": "body", "text": "“The guys were trying to find me,” Reddish said. “I got some easy ones and that got me going.”"}
{"game_id": "0022100215", "chunk_id": "0022100215_011", "order": 11, "role": "body", "text": "Collins also had 11 rebounds, while Reddish came up with three steals."}
{"game_id": "0022100215", "chunk_id": "0022100215_012", "order": 12, "role": "body", "text": "With Robert Williams out with an injury, Grant Williams stepped in to score 18 points for the Celtics."}
{"game_id": "0022100215", "chunk_id": "0022100215_013", "order": 13, "role": "body", "text": "“Robert is a huge piece of what we do, but I thought we did a good job defensively, ” Grant Williams said. “We've just got to do a better job putting the ball in the basket.”"}
{"game_id": "0022100215", "chunk_id": "0022100215_014", "order": 14, "role": "body", "text": "The Celtics hit just 43.5% from the field, including 11 of 42 beyond the arc."}
{"game_id": "0022100215", "chunk_id": "0022100215_015", "order": 15, "role": "body", "text": "Tatum made 5 of 13 from long range, and Williams knocked down 3 of 8. But the rest of the team was just 3 of 21 on 3-pointers."}
{"game_id": "0022100215", "chunk_id": "0022100215_016", "order": 16, "role": "body", "text": "“We’re not where we want to be,” Tatum said. “The more we can play with pace, guys will get easier looks. We’ll knock down some shots.”"}
{"game_id": "0022100215", "chunk_id": "0022100215_018", "order": 18, "role": "body", "text": "Williams pulled off a three-point play with a nifty bit of footwork in the closing seconds of the first half."}
{"game_id": "0022100215", "chunk_id": "0022100215_019", "order": 19, "role": "body", "text": "On a scramble along the baseline, Williams stopped dribbling when he stepped out of bounds, then stepped back in with both feet and regained possession after the ball went between his legs."}
{"game_id": "0022100215", "chunk_id": "0022100215_020", "order": 20, "role": "body", "text": "Huerter relaxed just a bit, pleading toward the official, which gave Williams an opening to dart to the basket. Huerter took a swipe and was called for the foul as the ball dropped through the hoop."}
{"game_id": "0022100215", "chunk_id": "0022100215_021", "order": 21, "role": "body", "text": "Williams flexed his arms before knocking down the free throw. Even so, the Hawks led 58-49 at the break and never trailed in the second half."}
{"game_id": "0022100215", "chunk_id": "0022100215_023", "order": 23, "role": "body", "text": "The Hawks improved to 6-1 at State Farm Arena."}
{"game_id": "0022100215", "chunk_id": "0022100215_024", "order": 24, "role": "body", "text": "Knowing that Atlanta has long been one of the least-imposing venues in the NBA, coach Nate McMillan has stressed the importance of building a true home-court advantage."}
{"game_id": "0022100215", "chunk_id": "0022100215_025", "order": 25, "role": "body", "text": "“We have to create that atmosphere, create that energy in the building with the way we play,” McMillan said."}
{"game_id": "0022100215", "chunk_id": "0022100215_027", "order": 27, "role": "body", "text": "Celtics: Robert Williams injured his left knee in Monday night's victory over Cleveland, sitting out the second half. Even though he missed a full game Wednesday, the injury is not believed to be a long-term issue. ... F Jaylen Brown (right hamstring strain) missed his sixth straight game but has ramped up his on-court rehab and appears close to returning. ... Two players who began their career in Atlanta started for Boston. Schröder scored 15 points and Al Horford had 13."}
{"game_id": "0022100215", "chunk_id": "0022100215_028", "order": 28, "role": "body", "text": "Hawks: Huerter (left hamstring) and G Bogdan Bogdanovic (right ankle) both played despite lingering ailments. ... Clint Capela had 12 rebounds and nine points. ... Bogdanovic scored 12 points, all on 3-pointers."}
{"game_id": "0022100215", "chunk_id": "0022100215_030", "order": 30, "role": "body", "text": "Celtics: Return home to host the Los Angeles Lakers on Friday night, the first of four straight home games."}
{"game_id": "0022100215", "chunk_id": "0022100215_031", "order": 31, "role": "body", "text": "Hawks: Host the Charlotte Hornets on Saturday is the next-to-last outing of a five-game homestand."}
{"game_id": "0022100215", "chunk_id": "0022100215_033", "order": 33, "role": "body", "text": "Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 and find his work at https://apnews.com/search/paulnewberry"}
