{"game_id": "0022100684", "chunk_id": "0022100684_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Terry Rozier scored 24 points, Miles Bridges added 22 points and 14 rebounds, and the Charlotte Hornets defeated the Oklahoma City Thunder 121-98 on Friday night."}
{"game_id": "0022100684", "chunk_id": "0022100684_002", "order": 2, "role": "body", "text": "P.J. Washington scored 20 and Gordon Hayward 16 for Charlotte, which has won seven of eight. LaMelo Ball finished with 10 points for the Hornets."}
{"game_id": "0022100684", "chunk_id": "0022100684_003", "order": 3, "role": "body", "text": "Shai Gilgeous-Alexander led the Thunder with 29 points, but was held to four in the second half. Josh Giddey added 21 and Jeremiah Robinson-Earl notched a double-double with 12 points and 11 rebounds."}
{"game_id": "0022100684", "chunk_id": "0022100684_004", "order": 4, "role": "body", "text": "“Shai does a great job,” Bridges said. “He’s one of the best in the league at getting to the rim, so we knew that he was going to get his buckets. We wanted to stop all the other guys from doing what they do.”"}
{"game_id": "0022100684", "chunk_id": "0022100684_005", "order": 5, "role": "body", "text": "After Oklahoma City cut Charlotte’s lead to 82-73 on Robinson-Earl’s 3-pointer with 4:06 to play in the third, Charlotte pushed its lead to a game-high 25 on a 3-pointer by Bridges."}
{"game_id": "0022100684", "chunk_id": "0022100684_006", "order": 6, "role": "body", "text": "“That was what we talked about at halftime was slowing them down in transition,” Giddey said of the Thunder’s performance, in which they kept Charlotte close in the final three quarters after a lopsided first."}
{"game_id": "0022100684", "chunk_id": "0022100684_007", "order": 7, "role": "body", "text": "“They get out and run, small ball lineups,\" Giddey added. \"And in the first half, they did that.”"}
{"game_id": "0022100684", "chunk_id": "0022100684_008", "order": 8, "role": "body", "text": "Charlotte’s only loss in the past eight games has been to Orlando, last in the Eastern Conference. Facing another team out of playoff contention, the Hornets trailed 2-0 but didn’t relinquish the lead after taking it back early."}
{"game_id": "0022100684", "chunk_id": "0022100684_009", "order": 9, "role": "body", "text": "Charlotte pushed its lead to 46-27 on Washington’s 3-pointer midway through the second period. The Hornets maintained a lead around 20 points despite Ball picking up his third foul with 5:47 to play in the first half."}
{"game_id": "0022100684", "chunk_id": "0022100684_010", "order": 10, "role": "body", "text": "“I took my hair out and just started shooting better,” Washington said of his second-half hairstyle change and scoring surge. “It just started falling.”"}
{"game_id": "0022100684", "chunk_id": "0022100684_011", "order": 11, "role": "body", "text": "Charlotte led throughout the first period, with Oklahoma City coming within one at 13-12 on Giddey’s basket. But the Hornets closed the period on a 24-8 run to take a 37-20 lead."}
{"game_id": "0022100684", "chunk_id": "0022100684_013", "order": 13, "role": "body", "text": "Thunder coach Mark Daigneault sees similarities between young point guards on both sides of Friday’s matchup."}
{"game_id": "0022100684", "chunk_id": "0022100684_014", "order": 14, "role": "body", "text": "Gilgeous-Alexander leads Oklahoma City with 22.5 points per game. Ball, last season's NBA Rookie of the Year, is second in scoring for Charlotte (19.9) and leads in assists (7.7)."}
{"game_id": "0022100684", "chunk_id": "0022100684_015", "order": 15, "role": "body", "text": "“Ball’s got a great pace to him for a young player,” Daigneault said. “He’s got an advanced pass mentality, he’s a good, dynamic, young guard in the NBA. And we’ve got a guy that’s going to move very far in his track.”"}
{"game_id": "0022100684", "chunk_id": "0022100684_017", "order": 17, "role": "body", "text": "Charlotte is 13-6 at home. Its six losses are tied for second fewest in the Eastern Conference. Bridges wants to see the Hornets turn their home court into a nightmare for opponents."}
{"game_id": "0022100684", "chunk_id": "0022100684_018", "order": 18, "role": "body", "text": "“We want our home court to be how the Warriors were, how the Thunder were in their prime,” Bridges said. “We want people to be scared when they come in here. In order for us to do that, we've just got to continue to win, continue to dominate teams.”"}
{"game_id": "0022100684", "chunk_id": "0022100684_020", "order": 20, "role": "body", "text": "Thunder: Gilgeous-Alexander entered Friday with 30 points or more in three of his past five games. He missed that mark by one point. ... Oklahoma City has lost 11 of 13, but those wins were against playoff contenders Brooklyn and New York. ... Center Derrick Favors sat out with a back injury."}
{"game_id": "0022100684", "chunk_id": "0022100684_021", "order": 21, "role": "body", "text": "Hornets: Forward Jalen McDaniels left with 6:01 left in the first half with an apparent leg injury. He was helped to the locker room and did not return. ... Ball nearly notched a triple-double, but came up short with nine rebounds and eight assists."}
{"game_id": "0022100684", "chunk_id": "0022100684_023", "order": 23, "role": "body", "text": "Thunder: at Cavaliers on Saturday."}
{"game_id": "0022100684", "chunk_id": "0022100684_024", "order": 24, "role": "body", "text": "Hornets: host Atlanta on Sunday."}
