{"game_id": "0022100804", "chunk_id": "0022100804_001", "order": 1, "role": "lead", "text": "DENVER -- — Nikola Jokic had 27 points, 12 rebounds and 10 assists and the Denver Nuggets beat Brooklyn 124-104 on Sunday to extend the Nets’ losing streak to eight games."}
{"game_id": "0022100804", "chunk_id": "0022100804_002", "order": 2, "role": "body", "text": "Jokic has an NBA-best 14 triple-doubles this season. He scored 23 points in the second and third quarters when Denver went from trailing by seven to leading by 21."}
{"game_id": "0022100804", "chunk_id": "0022100804_003", "order": 3, "role": "body", "text": "The Nuggets held Brooklyn to 29 points in the second half to end a three-game skid."}
{"game_id": "0022100804", "chunk_id": "0022100804_004", "order": 4, "role": "body", "text": "“We rebounded better in the second half, we made them take tough shots. The defense was much, much better,” Jokic said."}
{"game_id": "0022100804", "chunk_id": "0022100804_005", "order": 5, "role": "body", "text": "Will Barton had 21 points and Aaron Gordon had 17 points and nine rebounds in his return from a two-game absence."}
{"game_id": "0022100804", "chunk_id": "0022100804_006", "order": 6, "role": "body", "text": "Nets guard James Harden missed his second straight game with left hamstring tightness. Brooklyn coach Steve Nash said the team is being cautious with the former MVP."}
{"game_id": "0022100804", "chunk_id": "0022100804_007", "order": 7, "role": "body", "text": "Nash was asked before the game if it’s accurate the team won’t trade Harden before Thursday’s deadline and gave a definitive answer."}
{"game_id": "0022100804", "chunk_id": "0022100804_008", "order": 8, "role": "body", "text": "“Yes, that’s correct,” he said."}
{"game_id": "0022100804", "chunk_id": "0022100804_009", "order": 9, "role": "body", "text": "Kyrie Irving finished with 27 points and 11 assists and Cam Thomas had 20 for Brooklyn. The losing streak is the longest since the Nets lost seven in a row from Dec. 26, 2019, to Jan. 7, 2020. They finished 0-5 on the trip."}
{"game_id": "0022100804", "chunk_id": "0022100804_010", "order": 10, "role": "body", "text": "“The common thread is not having everyone and us finding ways to get better,” Patty Mills said. “It has been tough but no excuses. We’ve got to hang our hat on our ability to rely on each other.”"}
{"game_id": "0022100804", "chunk_id": "0022100804_011", "order": 11, "role": "body", "text": "Brooklyn continues to play without Kevin Durant, LaMarcus Aldridge and Nic Claxton due to injuries, and Joe Harris has not played since Nov. 14 with an ankle injury."}
{"game_id": "0022100804", "chunk_id": "0022100804_012", "order": 12, "role": "body", "text": "The mounting injuries have contributed to the Nets falling into the first play-in position in the Eastern Conference."}
{"game_id": "0022100804", "chunk_id": "0022100804_013", "order": 13, "role": "body", "text": "“We’re not going to panic, there’s still plenty of games after the all-star break when Kevin gets back,” Nash said. “Hopefully have Kevin and James. You’re talking about five guys. That’s your starting lineup, potentially.”"}
{"game_id": "0022100804", "chunk_id": "0022100804_014", "order": 14, "role": "body", "text": "Denver led 76-75 at halftime and outscored the Nets 31-16 in the third quarter to take a 107-91 lead. Jokic came out late in the third sitting on nine assists and looked like he would finish an assist shy of another triple-double until Brooklyn cut the deficit to 109-99."}
{"game_id": "0022100804", "chunk_id": "0022100804_015", "order": 15, "role": "body", "text": "Jokic checked back in and fed Barton for a layup for his 10th assist."}
{"game_id": "0022100804", "chunk_id": "0022100804_016", "order": 16, "role": "body", "text": "The Nuggets stayed a game ahead of Minnesota to remain in the sixth position in the Western Conference with 10 days left before the All-Star break."}
{"game_id": "0022100804", "chunk_id": "0022100804_017", "order": 17, "role": "body", "text": "“This is a challenging time for every team, every coach, and every player,” Denver coach Michael Malone said. “We have five games until the all-star break. We’re tired of each other. I see this team more than I see my wife and kids.”"}
{"game_id": "0022100804", "chunk_id": "0022100804_019", "order": 19, "role": "body", "text": "Irving showed off his skills in the second quarter when he bumped into Denver forward Aaron Gordon and fell to the court. Irving never stopped dribbling as he got up, and then hit Day’Ron Sharpe with a bounce pass as Sharpe went baseline to the bucket."}
{"game_id": "0022100804", "chunk_id": "0022100804_020", "order": 20, "role": "body", "text": "Sharpe lost the ball as he went up for a shot and the Nets didn’t finish off Irving’s artwork."}
{"game_id": "0022100804", "chunk_id": "0022100804_022", "order": 22, "role": "body", "text": "DeMarcus Cousins’ second 10-day contract with Denver expired after Sunday’s game and a decision looms on whether to sign him for the rest of the season. Cousins said he is comfortable with this team and wants to stay on the roster."}
{"game_id": "0022100804", "chunk_id": "0022100804_023", "order": 23, "role": "body", "text": "“I would love to be here,” he said. “I think it’s a great fit. Both sides benefit from it and I think can be the extra piece to push us over the top.”"}
{"game_id": "0022100804", "chunk_id": "0022100804_025", "order": 25, "role": "body", "text": "Nets: Durant is still rehabbing his sprained MCL but has started to get on the court for basketball activities. ... Blake Griffin scored all of his 19 points in the first half."}
{"game_id": "0022100804", "chunk_id": "0022100804_026", "order": 26, "role": "body", "text": "Nuggets: Gordon returned to the lineup after missing two games with a hamstring injury. ... G Austin Rivers went to the locker room in the first half with a slight limp and was accompanied by team trainer Steve Short. He did not return."}
{"game_id": "0022100804", "chunk_id": "0022100804_028", "order": 28, "role": "body", "text": "Nets: Host the Boston Celtics on Tuesday night."}
{"game_id": "0022100804", "chunk_id": "0022100804_029", "order": 29, "role": "body", "text": "Nuggets: Host the New York Knicks on Tuesday night"}
