{"game_id": "0022100428", "chunk_id": "0022100428_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Caris LeVert scored 20 of his season-high 31 points in the first half and the Indiana Pacers sent the Detroit Pistons to their 13th straight loss, 122-113 on Thursday night."}
{"game_id": "0022100428", "chunk_id": "0022100428_002", "order": 2, "role": "body", "text": "“The past couple weeks I’ve turned the corner with my body,” said LeVert, who missed the first several games with a stress fracture."}
{"game_id": "0022100428", "chunk_id": "0022100428_003", "order": 3, "role": "body", "text": "The Pacers were without point guard Malcolm Brogdon because of a sore Achilles. LeVert said having his backcourt mate out didn’t change how he played."}
{"game_id": "0022100428", "chunk_id": "0022100428_004", "order": 4, "role": "body", "text": "“I always try to be aggressive,” LeVert said. “I had the ball in my hands more.”"}
{"game_id": "0022100428", "chunk_id": "0022100428_005", "order": 5, "role": "body", "text": "LeVert was 12 of 18 from the field."}
{"game_id": "0022100428", "chunk_id": "0022100428_006", "order": 6, "role": "body", "text": "Pacers acting coach Lloyd Pierce said LeVert is shifty."}
{"game_id": "0022100428", "chunk_id": "0022100428_007", "order": 7, "role": "body", "text": "“He as a lot of wiggle to his game,” said Pierce, who took over with Rick Carlisle out after testing positive for COVID-19 . “He finds a way to get into paint. He had a tremendous end of second quarter."}
{"game_id": "0022100428", "chunk_id": "0022100428_008", "order": 8, "role": "body", "text": "Justin Holiday added 17 points for Indiana, shooting 5 of 15."}
{"game_id": "0022100428", "chunk_id": "0022100428_009", "order": 9, "role": "body", "text": "Saddiq Bey led the Pistons with 28 points and 10 rebounds. Cade Cunningham added 19 points, and Frank Jackson had 18. Detroit is an NBA-worst 4-23."}
{"game_id": "0022100428", "chunk_id": "0022100428_010", "order": 10, "role": "body", "text": "“It’s a game of runs and they made more of them,” Bey said. “We have to play physical without fouling. The effort was there but our communication on the rotation has to be better.”"}
{"game_id": "0022100428", "chunk_id": "0022100428_011", "order": 11, "role": "body", "text": "The Pistons were 26 of 30 from the foul line, while the Pacers made 25 of 28.."}
{"game_id": "0022100428", "chunk_id": "0022100428_012", "order": 12, "role": "body", "text": "“We were fouling them with they cut,” said Pistons acting coach Rex Kalamian, who was filling in with Dwane Casey out because of a personal issue. “When we fouled, we want it to be two shots. We didn’t want to give them those and-1s.”"}
{"game_id": "0022100428", "chunk_id": "0022100428_013", "order": 13, "role": "body", "text": "The Pacers had to play the last several minutes of the third quarter without Domantas Sabonis and Myles Turner after they each picked up their fourth foul. Despite Sabonis playing just a little more than four minutes and Turner 6 1/2, the Pacers were able to take a 103-91 lead."}
{"game_id": "0022100428", "chunk_id": "0022100428_014", "order": 14, "role": "body", "text": "Turner finished with 16 points and four blocked shots. Sabonis had 12 points and nine rebounds."}
{"game_id": "0022100428", "chunk_id": "0022100428_016", "order": 16, "role": "body", "text": "Pistons: Detroit last won at home against Indiana on Nov. 13."}
{"game_id": "0022100428", "chunk_id": "0022100428_017", "order": 17, "role": "body", "text": "Pacers: Malcolm Brogdon sat out because of a sore right Achilles. Brad Wanamaker made his first start of the season, replacing Brogdon. Wanamaker finished with six points ... Indiana recalled Goga Bitadze from its G-League affiliate Thursday. The Fort Wayne Mad Ants. Bitadze, who joint the Mad Ants on Tuesday, averaged 28.5 points and 10.5 rebounds in two games."}
{"game_id": "0022100428", "chunk_id": "0022100428_019", "order": 19, "role": "body", "text": "Pistons: Host Houston on Saturday."}
{"game_id": "0022100428", "chunk_id": "0022100428_020", "order": 20, "role": "closing", "text": "Pacers: At Miami on Tuesday night."}
