{"game_id": "0022101013", "chunk_id": "0022101013_001", "order": 1, "role": "lead", "text": "DETROIT -- — Marcus Morris scored 31 points and Luke Kennard had 16 against their former team, helping the Los Angeles Clippers rally from an 18-point deficit to beat the Detroit Pistons 106-102 on Sunday."}
{"game_id": "0022101013", "chunk_id": "0022101013_002", "order": 2, "role": "body", "text": "Reggie Jackson, another former Piston, finished with 15 points, nine assists and eight rebounds."}
{"game_id": "0022101013", "chunk_id": "0022101013_003", "order": 3, "role": "body", "text": "“I will always have mad love for the Pistons, the city and the fans,” Jackson said. “I was just a rugrat when I came here from OKC, but I learned how to be an NBA player in Detroit. It's always special for me to come back here and I hope all the fans understand that.”"}
{"game_id": "0022101013", "chunk_id": "0022101013_004", "order": 4, "role": "body", "text": "Jeremi Grant scored 21 for Detroit, and Cade Cunningham had 19 points, 10 assists and nine rebounds."}
{"game_id": "0022101013", "chunk_id": "0022101013_005", "order": 5, "role": "body", "text": "“We're still a very young team and we need to learn how to close out games,” Grant said. “We still have too many mental lapses, especially on defense. We're doing too much and switching and doubling at the wrong times. That gets you beat in this league.”"}
{"game_id": "0022101013", "chunk_id": "0022101013_006", "order": 6, "role": "body", "text": "The Clippers, who trailed 44-26 in the second quarter, took an 85-83 lead on Kennard's 3-pointer with 7:53 left. He added two more 3s as Los Angeles grabbed a 97-92 lead with 4:25 to play."}
{"game_id": "0022101013", "chunk_id": "0022101013_007", "order": 7, "role": "body", "text": "“I thought we made some minor adjustments at halftime, but a lot of it was just Marcus getting us going,” Clippers coach Tyronn Lue said. “And Reggie played beautiful basketball. It wasn't just his control of the game, but understanding how to attack the Pistons.”"}
{"game_id": "0022101013", "chunk_id": "0022101013_008", "order": 8, "role": "body", "text": "Cunningham's layup in traffic pulled the Pistons within one, but Jackson answered with a step-back 3-pointer. Detroit came up empty on the next two possessions, and Morris hit a jumper to make it 102-96 with 36.5 seconds left."}
{"game_id": "0022101013", "chunk_id": "0022101013_009", "order": 9, "role": "body", "text": "“This group has learned a lot about becoming a good basketball team,\" Pistons coach Dwane Casey said. \"But the next step needs to be understand the fourth quarter is different, especially against playoff teams like the Clippers. You have to play harder and play smarter, because the other team is going to pick it up down the stretch."}
{"game_id": "0022101013", "chunk_id": "0022101013_010", "order": 10, "role": "body", "text": "“We haven't gotten there, but we will.”"}
{"game_id": "0022101013", "chunk_id": "0022101013_011", "order": 11, "role": "body", "text": "Detroit dominated the first half. The Clippers were already playing at what felt like noon, but it came on the day after both teams lost an hour of sleep to the beginning of Daylight Savings Time. It seemed to impact their shooting legs, as they shot 28.6% from the floor in the first quarter and missed all eight 3-point attempts."}
{"game_id": "0022101013", "chunk_id": "0022101013_012", "order": 12, "role": "body", "text": "The Pistons still had a 53-39 advantage at the half."}
{"game_id": "0022101013", "chunk_id": "0022101013_013", "order": 13, "role": "body", "text": "“We were really struggling in the first half and they are really good in transition,” Kennard said. “In the second half, we finally started hitting our shots and playing at our tempo. We really did a good job of controlling the speed of the game.”"}
{"game_id": "0022101013", "chunk_id": "0022101013_015", "order": 15, "role": "body", "text": "Clippers: C Ivica Zubac finished with 14 points and 15 rebounds. ... The Clippers' last loss in Detroit came on Nov. 25, 2016, at the Palace of Auburn Hills."}
{"game_id": "0022101013", "chunk_id": "0022101013_016", "order": 16, "role": "body", "text": "Pistons: Longtime play-by-play announcer George Blaha will miss the rest of the season for health reasons. Blaha, who has announced Pistons games on radio and TV since 1976, expects to return for a 47th season this fall."}
{"game_id": "0022101013", "chunk_id": "0022101013_018", "order": 18, "role": "body", "text": "Clippers: Visit the Cleveland Cavaliers on Monday"}
{"game_id": "0022101013", "chunk_id": "0022101013_019", "order": 19, "role": "body", "text": "Pistons: Visit the Miami Heat on Tuesday."}
