{"game_id": "0022100017", "chunk_id": "0022100017_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — For the second straight game, the Hornets saved their best for last."}
{"game_id": "0022100017", "chunk_id": "0022100017_002", "order": 2, "role": "body", "text": "And once again, the Cavaliers crumbled."}
{"game_id": "0022100017", "chunk_id": "0022100017_003", "order": 3, "role": "body", "text": "Miles Bridges scored 30 points, Kelly Oubre Jr. added 25 and Charlotte took advantage of Cleveland's sloppiness to open the fourth quarter in a 123-112 victory Friday night, wrecking the Cavs' home opener."}
{"game_id": "0022100017", "chunk_id": "0022100017_004", "order": 4, "role": "body", "text": "The Hornets only led by one entering the final 12 minutes before outscoring the Cavs 19-2 in the first 3:27, when Charlotte raised its defensive intensity and Cleveland turned the ball over seven times."}
{"game_id": "0022100017", "chunk_id": "0022100017_005", "order": 5, "role": "body", "text": "“It was our defense,” said Bridges, who made four 3-pointers and added seven rebounds. “When we lock down defensively, I feel like we're one of the best defensive teams in the NBA.”"}
{"game_id": "0022100017", "chunk_id": "0022100017_006", "order": 6, "role": "body", "text": "Gordon Hayward made two 3-pointes in the decisive run as Charlotte won its second straight to open the season."}
{"game_id": "0022100017", "chunk_id": "0022100017_007", "order": 7, "role": "body", "text": "Hayward finished with 18 points and LaMelo Ball had 17 for the Hornets. The pair combined for 58 points in the opener, when Charlotte overcame a 23-point deficit in the third quarter and beat Indiana."}
{"game_id": "0022100017", "chunk_id": "0022100017_008", "order": 8, "role": "body", "text": "“I love our depth,” Hornets coach James Borrego said. “I love our toughness.”"}
{"game_id": "0022100017", "chunk_id": "0022100017_009", "order": 9, "role": "body", "text": "Collin Sexton scored 33 points and rookie Evan Mobley had 13 for the Cavs, who have a promising young nucleus but will undoubtedly go through growing pains — especially early in the season."}
{"game_id": "0022100017", "chunk_id": "0022100017_010", "order": 10, "role": "body", "text": "Much as they did in their opening loss at Memphis, the Cavs played well for three quarters and then collapsed."}
{"game_id": "0022100017", "chunk_id": "0022100017_011", "order": 11, "role": "body", "text": "Bridges and Hayward hit back-to-back 3-pointers as the Hornets opened the fourth with 10 quick points. Then, following yet another Cleveland turnover, Cody Martin drove the left side and unleashed a dunk over 6-foot-11 center Jarrett Allen, sending the Hornets bench spilling onto the floor."}
{"game_id": "0022100017", "chunk_id": "0022100017_012", "order": 12, "role": "body", "text": "Cavs guard Ricky Rubio had three turnovers in the defining moments in the fourth to help Charlotte take control."}
{"game_id": "0022100017", "chunk_id": "0022100017_013", "order": 13, "role": "body", "text": "“It was a snowball we couldn't stop,” said Rubio who started in place of Darius Garland, out with a sprained ankle. “I'll have go back and watch but there were a lot of turnovers. It happened so fast. I don't remember all of them. There was a lot.”"}
{"game_id": "0022100017", "chunk_id": "0022100017_014", "order": 14, "role": "body", "text": "Rubio finished with 15 points and 10 assists, and Kevin Love had 11 rebounds."}
{"game_id": "0022100017", "chunk_id": "0022100017_016", "order": 16, "role": "body", "text": "Browns star defensive end Myles Garrett sat courtside and got a rousing ovation from the Cleveland crowd. He showed off a Cavs No. 95 jersey with his name on the back."}
{"game_id": "0022100017", "chunk_id": "0022100017_017", "order": 17, "role": "body", "text": "Cavs coach J.B. Bickerstaff joked he wanted Garrett to put it on."}
{"game_id": "0022100017", "chunk_id": "0022100017_018", "order": 18, "role": "body", "text": "“There were a few moments where I wish he would have protected the paint for us,” Bickerstaff cracked.\""}
{"game_id": "0022100017", "chunk_id": "0022100017_020", "order": 20, "role": "body", "text": "The announced crowd of 17,116 was the largest the Cavs have played before at Rocket Mortgage FieldHouse since the COVI9-19 pandemic started. Attendance last season was limited to 25% in the 19,000-seat arena."}
{"game_id": "0022100017", "chunk_id": "0022100017_021", "order": 21, "role": "body", "text": "Hornets: Mason Plumlee had 14 rebounds. ... Ball added five steals. ... Charlotte entered the season as the NBA's fifth-youngest with average of 24.8 years. Only Oklahoma City (23.5), Memphis (24.1), Detroit (24.5) and Minnesota (24.5) are younger."}
{"game_id": "0022100017", "chunk_id": "0022100017_022", "order": 22, "role": "body", "text": "Cavaliers: While it may have been his first start for Cleveland, Rubio started 594 previous games in his 10-year NBA career. ... Garland injured his ankle in the first half of the opener but still finished with 12 assists, matching his career-high. ... G/F Dylan Windler missed his second game with a right hip strain. ... Backup G Kevin Pangos made his NBA debut. He played the past six seasons in Europe."}
{"game_id": "0022100017", "chunk_id": "0022100017_024", "order": 24, "role": "body", "text": "From the jump, Mobley has impressed the Cavs with his maturity, basketball IQ and understanding of his role."}
{"game_id": "0022100017", "chunk_id": "0022100017_025", "order": 25, "role": "body", "text": "Bickerstaff said there's been no need to remind the 20-year-old of anything."}
{"game_id": "0022100017", "chunk_id": "0022100017_026", "order": 26, "role": "body", "text": "“You just have to tell him one time,” Bickerstaff said when asked if Mobley needs to be pushed to be more assertive. “When we first started working with him this summer, we had the conversation about what we needed him to be. He's very aware of who he needs to be.”"}
{"game_id": "0022100017", "chunk_id": "0022100017_028", "order": 28, "role": "body", "text": "Cavs chairman Dan Gilbert, dressed in a wine-colored blazer, watched the opening half from his customary courtside seat. It was Gilbert's first home game since he suffered a stroke more than two years ago."}
{"game_id": "0022100017", "chunk_id": "0022100017_029", "order": 29, "role": "body", "text": "The 59-year-old Gilbert received a warm ovation from the crowd when he was shown on the giant scoreboard just before halftime."}
{"game_id": "0022100017", "chunk_id": "0022100017_031", "order": 31, "role": "body", "text": "Hornets: Visit Brooklyn on Sunday."}
{"game_id": "0022100017", "chunk_id": "0022100017_032", "order": 32, "role": "body", "text": "Cavaliers: Host Atlanta on Saturday before embarking on a five-game trip."}
