{"game_id": "0022100310", "chunk_id": "0022100310_001", "order": 1, "role": "lead", "text": "DALLAS -- — Jarrett Allen and Lauri Markkanen notched season highs with 28 and 24 points respectively, and the Cleveland Cavaliers dominated the Dallas Mavericks for a 114-96 win on Monday night — their most lopsided win of the season."}
{"game_id": "0022100310", "chunk_id": "0022100310_002", "order": 2, "role": "body", "text": "Allen also had 14 rebounds, while Darius Garland added 18 points for the Cavaliers."}
{"game_id": "0022100310", "chunk_id": "0022100310_003", "order": 3, "role": "body", "text": "Their largest lead was 31 points midway through the fourth quarter, when Markkanen’s season-high fifth 3-pointer put Cleveland ahead 104-73."}
{"game_id": "0022100310", "chunk_id": "0022100310_004", "order": 4, "role": "body", "text": "“We’re playing how we want to play,” said Allen, who was a first-round draft pick in 2017 after playing one season at Texas. “We’re playing with the aggressiveness, the assertiveness that we want to play with, and it’s just setting the tone.”"}
{"game_id": "0022100310", "chunk_id": "0022100310_005", "order": 5, "role": "body", "text": "Luka Doncic posted his second triple-double of the season with 25 points, 10 rebounds and 10 assists. Doncic made a season-high seven 3-pointers (7 of 11), while his teammates went 4 for 28 from behind the arc."}
{"game_id": "0022100310", "chunk_id": "0022100310_006", "order": 6, "role": "body", "text": "“Obviously, Jarrett Allen was the key to their win,” Doncic said. “Their whole team played great, but we’ve got to control our emotions. We’ve got to be better on defense.”"}
{"game_id": "0022100310", "chunk_id": "0022100310_007", "order": 7, "role": "body", "text": "Cleveland outshot Dallas 56.3% to 43.8% with its best shooting game of the season. The Cavaliers outrebounded the Mavericks 49-33 — 44-26 on the defensive glass — and outscored them in the paint 60-46."}
{"game_id": "0022100310", "chunk_id": "0022100310_008", "order": 8, "role": "body", "text": "It was Dallas’ lowest rebounding total this season. Ricky Rubio, Cleveland's 31-year-old, 6-foot-2 reserve point guard, had seven rebounds — more than any Dallas player other than Doncic."}
{"game_id": "0022100310", "chunk_id": "0022100310_009", "order": 9, "role": "body", "text": "Dorian Finney-Smith was the only other Mavericks starter in double figures with 14 points. Maxi Kleber matched a season high with 13 points off the bench for the Mavericks, who have lost five of their last six games."}
{"game_id": "0022100310", "chunk_id": "0022100310_010", "order": 10, "role": "body", "text": "Kristaps Porzingis had nine points, five rebounds and four blocks -– the latter all in the first half. Porzingis left midway through the second half with a right ankle sprain."}
{"game_id": "0022100310", "chunk_id": "0022100310_011", "order": 11, "role": "body", "text": "Dallas coach Jason Kidd said his team’s poor shooting affected their defense."}
{"game_id": "0022100310", "chunk_id": "0022100310_012", "order": 12, "role": "body", "text": "“When we don’t make shots, we tend to feel bad or feel sorry for ourselves,” Kidd said. “The opposing team is not going to wait for us to get back on defense. Our transition defense has stunk here of late because we’re not making shots.”"}
{"game_id": "0022100310", "chunk_id": "0022100310_013", "order": 13, "role": "body", "text": "Dallas dropped into fifth place in the West, one-half game behind the Los Angeles Clippers. Cleveland moved into a three-way tie for eighth place in the Eastern Conference."}
{"game_id": "0022100310", "chunk_id": "0022100310_015", "order": 15, "role": "body", "text": "The Cavaliers had lost their previous four games in Dallas. In their four games against the Mavericks during the past two seasons, they were 0-4 and lost by an average of 24.75 points."}
{"game_id": "0022100310", "chunk_id": "0022100310_016", "order": 16, "role": "body", "text": "Irrelevant, Cleveland coach J.B. Bickerstaff said."}
{"game_id": "0022100310", "chunk_id": "0022100310_017", "order": 17, "role": "body", "text": "“We’re a different team, so I don’t think you can equate what’s happened in the past to this group,” Bickerstaff said. “The young guys that have been here and been through those struggles have matured. We’ve added some key pieces to make us a different basketball team. Our mentality is different.”"}
{"game_id": "0022100310", "chunk_id": "0022100310_019", "order": 19, "role": "body", "text": "Markkanen, acquired from Chicago last August, failed to reach 20 points in his first seven games with the Cavaliers. He has scored at least 20 in four of his last five games."}
{"game_id": "0022100310", "chunk_id": "0022100310_020", "order": 20, "role": "body", "text": "“My teammates trust me to make shots,” he said. “I’ve been trying to just be more active off the ball and look for a shot.”"}
{"game_id": "0022100310", "chunk_id": "0022100310_022", "order": 22, "role": "body", "text": "Cavaliers: They’re 6-4 on the road through 21 games. They reached six road victories last season after 44 games. … Cleveland’s previous largest win was by 17 points against the New York Knicks, also on the road. … The Cavaliers were missing reserve forwards Cedi Osman (lower back soreness) and Dean Wade (calf strain)."}
{"game_id": "0022100310", "chunk_id": "0022100310_023", "order": 23, "role": "body", "text": "Mavericks : Doncic shot better from 3-point range than on 2-pointers (2 for 10) or free throws (0 for 4). … Reserve guard Jalen Brunson returned after missing a game and a half with an injured left foot. … In addition to Willie Cauley-Stein being out, reserve guard Frank Ntilikina missed his third consecutive game with a right calf strain."}
{"game_id": "0022100310", "chunk_id": "0022100310_025", "order": 25, "role": "body", "text": "Cavaliers: At Miami on Wednesday for the middle of a three-game trip."}
{"game_id": "0022100310", "chunk_id": "0022100310_026", "order": 26, "role": "body", "text": "Mavericks: At New Orleans on Wednesday."}
