{"game_id": "0022101062", "chunk_id": "0022101062_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Oshae Brissett scored 24 points, Justin Anderson had 18 and the Indiana Pacers cruised past the Portland Trail Blazers 129-98 Sunday."}
{"game_id": "0022101062", "chunk_id": "0022101062_002", "order": 2, "role": "body", "text": "Brissett sank 8 of 10 shots and all six free throws, and he led Indiana with nine rebounds."}
{"game_id": "0022101062", "chunk_id": "0022101062_003", "order": 3, "role": "body", "text": "“I'm still learning and continuing to build,” Brissett said. “I'm thankful for the opportunity I'm getting right now and trying to capitalize on it. I'm trying not force anything and being my best self.”"}
{"game_id": "0022101062", "chunk_id": "0022101062_004", "order": 4, "role": "body", "text": "Terry Taylor and Jalen Smith each scored 17 points for the Pacers, who never trailed. Lance Stephenson had 11 assists."}
{"game_id": "0022101062", "chunk_id": "0022101062_005", "order": 5, "role": "body", "text": "“Our guys jumped into the game,\" Pacers coach Rick Carlisle said. \"We did what we need to do, which was to execute and be unselfish. We did some good things defensively, held them under 100.\""}
{"game_id": "0022101062", "chunk_id": "0022101062_006", "order": 6, "role": "body", "text": "The Trail Blazers have lost 10 of 11, including four in a row. Josh Hart led them with 26 points, hitting 11 of 13 shots. Trendon Watford scored 17 points, Drew Eubanks had 12, and Kris Dunn and Ben McLemore each had 11."}
{"game_id": "0022101062", "chunk_id": "0022101062_007", "order": 7, "role": "body", "text": "Hart scored 14 points in the third quarter as Portland held a 34-25 lead to close the deficit to 94-82. However, the Pacers were able to expand their lead in fourth with a 35-16 advantage."}
{"game_id": "0022101062", "chunk_id": "0022101062_008", "order": 8, "role": "body", "text": "The Pacers led by 25 in the first half before settling for a 69-48 halftime lead."}
{"game_id": "0022101062", "chunk_id": "0022101062_009", "order": 9, "role": "body", "text": "Indiana grabbed a 16-4 lead as the Trail Blazers hit only one of their first nine shots."}
{"game_id": "0022101062", "chunk_id": "0022101062_010", "order": 10, "role": "body", "text": "“We got off to a slow start with turnovers and missed shots,\" Watford said. “We were pretty much playing catch up from there. We would start to make a little run and we'd look up and we’re still down 17.\""}
{"game_id": "0022101062", "chunk_id": "0022101062_012", "order": 12, "role": "body", "text": "Trail Blazers: Justise Winslow was sidelined with soreness in his right Achilles tendon. ... Watford scored in double figures for the eighth straight game. Watford, a rookie from LSU, also had eight rebounds and three assists."}
{"game_id": "0022101062", "chunk_id": "0022101062_013", "order": 13, "role": "body", "text": "Pacers: Malcolm Brogdon sat out for rest, Pacers coach Rick Carlisle said. ... Chris Duarte missed his second consecutive game with a sore left big toe. ... With Brogdon and Duarte out, Anderson got the start after signing a 10-day contract Thursday."}
{"game_id": "0022101062", "chunk_id": "0022101062_015", "order": 15, "role": "body", "text": "The Trail Blazers have played eight of their last nine games on the road."}
{"game_id": "0022101062", "chunk_id": "0022101062_016", "order": 16, "role": "body", "text": "“I feel like I got hit by a truck,” Hart said. “It’s definitely rough with time zones and time changes.\""}
{"game_id": "0022101062", "chunk_id": "0022101062_017", "order": 17, "role": "body", "text": "Hart said that shouldn't be an excuse, especially with all the young players on the team. The Trail Blazers play at Detroit on Monday night before returning home."}
{"game_id": "0022101062", "chunk_id": "0022101062_019", "order": 19, "role": "body", "text": "Near the end of the first half, Stephenson hit Brissett with a behind-the-back pass, and Brissett went up for a reverse dunk."}
{"game_id": "0022101062", "chunk_id": "0022101062_020", "order": 20, "role": "body", "text": "“It was spectacular,” Carlisle said. “We see Lance make similar type plays like that before. He put a little extra mustard on it with the look off into the crowd. It’s one of the most unselfish and best plays of the season, and it’ll be a highlight.”"}
{"game_id": "0022101062", "chunk_id": "0022101062_021", "order": 21, "role": "body", "text": "Brissett got fouled and hit the free throw to complete"}
{"game_id": "0022101062", "chunk_id": "0022101062_022", "order": 22, "role": "body", "text": "“I got out in transition and you got to get the crowd into it,” Brissett said. “Lance made a great pass and I just had to do something to show out.\""}
{"game_id": "0022101062", "chunk_id": "0022101062_023", "order": 23, "role": "body", "text": "Stephenson said he heard everybody yelling but didn't see Brissett's dunk until he saw the replay."}
{"game_id": "0022101062", "chunk_id": "0022101062_026", "order": 26, "role": "body", "text": "Trail Blazers: At Detroit on Monday to close five-game road trip."}
{"game_id": "0022101062", "chunk_id": "0022101062_027", "order": 27, "role": "body", "text": "Pacers: Hosts Sacramento on Wednesday."}
