{"game_id": "0022100382", "chunk_id": "0022100382_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — A confident De'Aaron Fox stepped the foul line for two shots with 2.4 seconds left and his team trailing by one."}
{"game_id": "0022100382", "chunk_id": "0022100382_002", "order": 2, "role": "body", "text": "After making his first eight free throws of the game, Fox said he was thinking “I'm going to make these two and we're going to get out of here” with a win."}
{"game_id": "0022100382", "chunk_id": "0022100382_003", "order": 3, "role": "body", "text": "Then the unthinkable happened."}
{"game_id": "0022100382", "chunk_id": "0022100382_004", "order": 4, "role": "body", "text": "A 74.1% free-throw shooter coming into the game, Fox sent the first shot off the back rim, the crowd screaming and waving trying to distract him. They got louder on the next try, and Fox tried to overcompensate for the first miss by taking something off his second shot. The ball bounced off the front rim."}
{"game_id": "0022100382", "chunk_id": "0022100382_005", "order": 5, "role": "body", "text": "Marvin Bagley III tried for a tip-in, but it didn't fall, and the Charlotte Hornets escaped with a wild 124-123 win over Sacramento on Friday night, snapping the Kings' three-game win streak."}
{"game_id": "0022100382", "chunk_id": "0022100382_006", "order": 6, "role": "body", "text": "“I'm very disappointed because I wanted the ball in my hands,” said Fox, who finished with a game-high 31 points — including two free throws to tie the game with 20.2 seconds left. “They took the foul and you want to punish a team for making a mistake like that. But I missed them and there is nothing I can do about it now.”"}
{"game_id": "0022100382", "chunk_id": "0022100382_007", "order": 7, "role": "body", "text": "Rookie James Bouknight, the 11th pick in the 2021 NBA draft, poured in a career-high 24 points on six 3-pointers lead the Hornets, who snapped a three-game losing streak. Miles Bridges added 23 points, eight assists and seven rebounds, and Kelly Oubre had 22 points. The Hornets had seven players out due to illness and NBA health and safety protocols."}
{"game_id": "0022100382", "chunk_id": "0022100382_008", "order": 8, "role": "body", "text": "Fox's misses capped a wild final 5.5 seconds. With the game tied and the shot clock off, the Hornets were looking for one shot."}
{"game_id": "0022100382", "chunk_id": "0022100382_009", "order": 9, "role": "body", "text": "However, a frantic final possession turned into a what appeared to be an and-one after Cody Martin made a reverse layup on the baseline. But Kings coach Alvin Gentry challenged the play and won, and the basket was waived off. Martin went to the line for two shots — missing the first and making the second."}
{"game_id": "0022100382", "chunk_id": "0022100382_010", "order": 10, "role": "body", "text": "Then, Martin made a critical mental error, fouling Fox near midcourt as he was bringing the ball up the floor with 2.4 seconds left."}
{"game_id": "0022100382", "chunk_id": "0022100382_011", "order": 11, "role": "body", "text": "“I was just trying being too aggressive and I have to learn from that,” Martin said."}
{"game_id": "0022100382", "chunk_id": "0022100382_012", "order": 12, "role": "body", "text": "Martin said he knew the Kings were in the bonus and didn’t try to foul Fox intentionally, thinking the Hornets had a foul to give."}
{"game_id": "0022100382", "chunk_id": "0022100382_013", "order": 13, "role": "body", "text": "“The basketball gods were with us tonight,” Martin said."}
{"game_id": "0022100382", "chunk_id": "0022100382_014", "order": 14, "role": "body", "text": "Gentry said the team wouldn't have been in that position without “Foxy (DeAaron Fox) and the way he played up until that point."}
{"game_id": "0022100382", "chunk_id": "0022100382_015", "order": 15, "role": "body", "text": "“It’s a tough loss for us to take, but we’ve got to take it and move on.”"}
{"game_id": "0022100382", "chunk_id": "0022100382_017", "order": 17, "role": "body", "text": "For Bouknight, Friday had been a long time coming."}
{"game_id": "0022100382", "chunk_id": "0022100382_018", "order": 18, "role": "body", "text": "He hasn't seen much playing time since being drafted, in large part because of how well Martin has played. But he said he has remained confident and continued to focus in practice without getting down on himself."}
{"game_id": "0022100382", "chunk_id": "0022100382_019", "order": 19, "role": "body", "text": "Before the game, Bouknight told Hornets coach James Borrego, “I'm ready.”"}
{"game_id": "0022100382", "chunk_id": "0022100382_020", "order": 20, "role": "body", "text": "“Miles Bridges has been telling me all year my time is going to come — and tonight it came,\" said Bouknight, who finished 6 of 8 from 3-point range."}
{"game_id": "0022100382", "chunk_id": "0022100382_022", "order": 22, "role": "body", "text": "Borrego said after the this game that this is the proudest he has ever been of a team after a win since his arrival in Charlotte four years ago."}
{"game_id": "0022100382", "chunk_id": "0022100382_023", "order": 23, "role": "body", "text": "“Just the resiliency of this team, to never give in, the fight, the perseverance and just the buy in of this group is just, I love this group,” Borrego said. \"They never give up. We had seven of our top 10 rotation players out and those guys in that locker room deserve all the credit. They battled until the last second and they deserve all the credit.”"}
{"game_id": "0022100382", "chunk_id": "0022100382_025", "order": 25, "role": "body", "text": "Kings: Alex Len got the start at center for Richaun Holmes, who did not play due to a right eye injury. Holmes came in averaging 14 points and 9.3 rebounds per game."}
{"game_id": "0022100382", "chunk_id": "0022100382_026", "order": 26, "role": "body", "text": "Hornets: P.J. Washington and Nick Richards didn't play Friday night, and LaMelo Ball, Terry Rozier, Mason Plumlee, Jalen McDaniels and Ish Smith were still out due to NBA health and safety protocols. ... Amoldas Kulboka, a 2018 second-round draft pick by the Hornets, saw his first action with the team."}
{"game_id": "0022100382", "chunk_id": "0022100382_028", "order": 28, "role": "body", "text": "Kings: At Cleveland on Saturday night."}
{"game_id": "0022100382", "chunk_id": "0022100382_029", "order": 29, "role": "body", "text": "Hornets: Open a six-game trip at Dallas on Monday night."}
