{"game_id": "0022100562", "chunk_id": "0022100562_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Ja Morant scored six of his 26 points in the final 30 seconds, including the go-ahead basket, allowing the Memphis Grizzlies to extend their winning streak to six with a 110-106 victory over the Cleveland Cavaliers on Tuesday night."}
{"game_id": "0022100562", "chunk_id": "0022100562_002", "order": 2, "role": "body", "text": "Morant gave Memphis a 106-104 lead with a double-pump short jumper, then stripped the ball from Brandon Goodwin and scored on Cleveland’s subsequent possession with 22 seconds remaining."}
{"game_id": "0022100562", "chunk_id": "0022100562_003", "order": 3, "role": "body", "text": "After Lauri Markkanen’s layup pulled the Cavaliers within 108-106, Morant made a pair of free throws to lock up Memphis’ 10th road victory in its last 11 games. The Grizzlies won 118-104 at Brooklyn one night earlier."}
{"game_id": "0022100562", "chunk_id": "0022100562_004", "order": 4, "role": "body", "text": "“At the end of games, I love being the guy to take that shot — make or miss — and I’ve been delivering of late,” Morant said. “When I attack, my job is just to make the right play, whether it’s me or it’s a drop-off to one of my teammates.”"}
{"game_id": "0022100562", "chunk_id": "0022100562_005", "order": 5, "role": "body", "text": "Darius Garland had 27 points and 10 assists in his return to Cleveland’s lineup after missing four games in the NBA’s health and safety protocols, while Jarrett Allen had 22 points and 12 rebounds. The Cavaliers have dropped four of five."}
{"game_id": "0022100562", "chunk_id": "0022100562_006", "order": 6, "role": "body", "text": "Kevin Love had 18 points and 10 rebounds off the bench, and Evan Mobley added 17 points and eight boards for Cleveland."}
{"game_id": "0022100562", "chunk_id": "0022100562_007", "order": 7, "role": "body", "text": "“We’re learning that the fourth quarters are what’s important,” Cavaliers coach J.B. Bickerstaff said. “Every shot, every pass, every possession, every box out, every rotation means everything. Give Memphis credit for hitting the shots at the end.”"}
{"game_id": "0022100562", "chunk_id": "0022100562_008", "order": 8, "role": "body", "text": "Jaren Jackson Jr. scored 22 points and Desmond Bane had 11 points and a career-best seven assists for Memphis. Morant also had six assists, but had his franchise-record run of 30-point games end at four."}
{"game_id": "0022100562", "chunk_id": "0022100562_009", "order": 9, "role": "body", "text": "“It was definitely tough to get to the rim against their big guys, but I made some big shots to close it out,” said Morant, who is averaging 30.7 points and 6.2 assists during the win streak. “It’s a good feeling, knowing everyone has the confidence that I can do it.”"}
{"game_id": "0022100562", "chunk_id": "0022100562_010", "order": 10, "role": "body", "text": "Grizzlies assistant coach Brad Jones filled in for Taylor Jenkins, who was attending a memorial service for this father-in-law. Jenkins was named Western Conference coach of the month earlier in the day."}
{"game_id": "0022100562", "chunk_id": "0022100562_011", "order": 11, "role": "body", "text": "“We have a great group of guys and I knew they wouldn’t let me get away without celebrating,” Jones said, smiling broadly. “I had a bunch of water baths and ice dumped on me, which was the most fun of the night, honestly.”"}
{"game_id": "0022100562", "chunk_id": "0022100562_012", "order": 12, "role": "body", "text": "Cleveland, which went 1-2 on its three-game homestand, now embarks on its longest trip of the season. The Cavaliers play their next six on the road."}
{"game_id": "0022100562", "chunk_id": "0022100562_013", "order": 13, "role": "body", "text": "“We made a couple mistakes, offensively and defensively, at the worst time and weren’t in the positions that Coach put us in,” Allen said. “It’s too bad because we were all excited to have Darius back and missed the energy he brings.”"}
{"game_id": "0022100562", "chunk_id": "0022100562_014", "order": 14, "role": "body", "text": "Brandon Clarke finished with 13 points and nine rebounds for Memphis, which scored 58 points in the paint."}
{"game_id": "0022100562", "chunk_id": "0022100562_016", "order": 16, "role": "body", "text": "Cavaliers G Rajon Rondo is out of the NBA’s health and safety protocols, but won’t make his team debut until completing a conditioning stint. The four-time All-Star was acquired from the Lakers in a three-team trade Monday."}
{"game_id": "0022100562", "chunk_id": "0022100562_017", "order": 17, "role": "body", "text": "Rondo, who averaged 3.1 points and 3.7 assists in 18 games with Los Angeles, fills a huge need created when Cleveland lost guards Ricky Rubio and Collin Sexton to season-ending left knee injuries."}
{"game_id": "0022100562", "chunk_id": "0022100562_018", "order": 18, "role": "body", "text": "“He can make our big guys better and he can play with Darius,” Bickerstaff said. “All around, it looks like it’s going to be a fit and a win for us.”"}
{"game_id": "0022100562", "chunk_id": "0022100562_020", "order": 20, "role": "body", "text": "Grizzlies: G Dillon Brooks, G De’Anthony Melton, F Kyle Anderson, F Xavier Tillman and G John Konchar are in the league safety protocols, while G Tyrell Terry has a non-COVID illness. … Rookie G Ziaire Williams, the 10th overall pick from Stanford, scored 10 points after missing 16 games with left knee and left ankle injuries. … Former Michigan C Jon Teske made his NBA debut Monday at Brooklyn. Teske signed a 10-day contract via a hardship roster exception."}
{"game_id": "0022100562", "chunk_id": "0022100562_021", "order": 21, "role": "body", "text": "Cavaliers: G Isaac Okoro (left elbow sprain) will miss the next 2/3 weeks after being hurt Monday against Indiana. Okoro ran into a pick set by Pacers center Domantas Sabonis near the top of the key. … F Cedi Osman remains in the COVID-19 protocols and has been sidelined for six straight games. … G Dylan Windler (left knee soreness) returned from a one-game absence. … Two-way C Tacko Fall is on assignment with the Cleveland Charge of the G League."}
{"game_id": "0022100562", "chunk_id": "0022100562_023", "order": 23, "role": "body", "text": "Grizzlies: Host Detroit on Thursday night."}
{"game_id": "0022100562", "chunk_id": "0022100562_024", "order": 24, "role": "body", "text": "Cavaliers: Visit Portland on Friday night."}
