{"game_id": "0022100170", "chunk_id": "0022100170_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — With the most important player on both of these super-teams out of action, the Heat's visit to the Lakers had to be decided by which supporting cast came through down the stretch."}
{"game_id": "0022100170", "chunk_id": "0022100170_002", "order": 2, "role": "body", "text": "Miami surged ahead in the fourth quarter, and the Lakers answered. After Los Angeles took control in overtime, the Heat just missed — repeatedly."}
{"game_id": "0022100170", "chunk_id": "0022100170_003", "order": 3, "role": "body", "text": "“It was just a wild game from start to finish,” Miami's Bam Adebayo said."}
{"game_id": "0022100170", "chunk_id": "0022100170_004", "order": 4, "role": "body", "text": "Malik Monk scored five of his season-high 27 points in overtime, and the Lakers rallied late in regulation before surging in overtime for a 120-117 victory Wednesday night."}
{"game_id": "0022100170", "chunk_id": "0022100170_005", "order": 5, "role": "body", "text": "Russell Westbrook had 25 points, 14 assists and 12 rebounds for the Lakers, who made a season-high 18 3-pointers and improved to 2-2 while LeBron James is sidelined by a strained abdominal muscle."}
{"game_id": "0022100170", "chunk_id": "0022100170_006", "order": 6, "role": "body", "text": "The Heat lost Jimmy Butler to a sprained ankle in the first half, leaving both stars' teammates to figure out their games without them. Miami did a better job early, but the Lakers came on strong late."}
{"game_id": "0022100170", "chunk_id": "0022100170_007", "order": 7, "role": "body", "text": "Anthony Davis had 24 points and 13 rebounds while Monk put on an impressive shooting display with four 3-pointers for the Lakers, who trailed by nine in the fourth quarter before rallying to beat the Heat."}
{"game_id": "0022100170", "chunk_id": "0022100170_008", "order": 8, "role": "body", "text": "“I had this role a couple of times in Charlotte when a lot of guys got hurt,\" said Monk, who has turned in three of the five highest-scoring performances of his career against Miami. “I had to come in, play big minutes and facilitate and do all the things I normally don't do. I work on my game a lot, so I was really prepared for this moment.”"}
{"game_id": "0022100170", "chunk_id": "0022100170_009", "order": 9, "role": "body", "text": "Adebayo scored 28 points before fouling out and Kyle Lowry had 18 points and 11 assists for the Heat, who lost Butler for the night after he scored seven points while playing the entire first quarter. Miami coach Erik Spoelstra had no postgame update on Butler’s condition."}
{"game_id": "0022100170", "chunk_id": "0022100170_010", "order": 10, "role": "body", "text": "Tyler Herro scored 27 points, but missed two 3-pointers in the final nine seconds of overtime in Miami's third loss in four games."}
{"game_id": "0022100170", "chunk_id": "0022100170_011", "order": 11, "role": "body", "text": "Herro also missed a 3 with 23 seconds left in regulation, but P.J. Tucker threw down a tying rebound dunk. Westbrook missed a 3 before Davis missed the tip at the buzzer, sending the Lakers to overtime for the second straight game."}
{"game_id": "0022100170", "chunk_id": "0022100170_012", "order": 12, "role": "body", "text": "“I thought we were still getting some good looks and reads, and I think there was a couple of times we could have extended that (fourth-quarter lead),” Spoelstra said. “A five-point swing really fast just gave them a little bit of life, and they made shots.”"}
{"game_id": "0022100170", "chunk_id": "0022100170_013", "order": 13, "role": "body", "text": "Los Angeles jumped to a five-point lead in OT, but Adebayo trimmed it to 119-117 with 23 seconds left before fouling out. The Heat forced a five-second violation by the Lakers on the ensuing inbounds play, but Herro missed an off-balance 3-pointer."}
{"game_id": "0022100170", "chunk_id": "0022100170_014", "order": 14, "role": "body", "text": "Carmelo Anthony hit one of two free throws with 6.5 seconds left, and Herro missed again to end it."}
{"game_id": "0022100170", "chunk_id": "0022100170_015", "order": 15, "role": "body", "text": "“The second shot was a great look,” Herro said. “I can make that nine times out of 10. It is what it is, and we move on.”"}
{"game_id": "0022100170", "chunk_id": "0022100170_016", "order": 16, "role": "body", "text": "Avery Bradley scored 17 points with a season-high five 3s for the Lakers, who have bounced back to beat Charlotte and Miami after a lackluster loss to the Trail Blazers last weekend."}
{"game_id": "0022100170", "chunk_id": "0022100170_017", "order": 17, "role": "body", "text": "“After that Portland loss, we took that personally,” Davis said. “These last two games have definitely been fun. Guys are starting to realize how good of a team we are, and we just have to take that mindset to the floor.”"}
{"game_id": "0022100170", "chunk_id": "0022100170_019", "order": 19, "role": "body", "text": "Heat: Adebayo, Tucker and Herro all played despite nagging injuries. ... Miami’s Markieff Morris sat out against his former team with whiplash stemming from his altercation with Denver’s Nikola Jokic on Monday. The Lakers played a video tribute to Morris and his role in their 2020 championship run during the first timeout."}
{"game_id": "0022100170", "chunk_id": "0022100170_020", "order": 20, "role": "body", "text": "Lakers: Improved to 3-0 in overtime this season. ... Dwight Howard fouled out with 8:50 to play. He didn't take a shot in 11 minutes. ... Austin Reaves and Rajon Rondo both sat out with hamstring strains."}
{"game_id": "0022100170", "chunk_id": "0022100170_022", "order": 22, "role": "body", "text": "Westbrook had his second straight triple-double and his third with his hometown team. He extended his NBA record to 187 triple-doubles and scored two huge baskets in the final minute of regulation, but also committed eight turnovers and missed the probable game-winner in regulation."}
{"game_id": "0022100170", "chunk_id": "0022100170_024", "order": 24, "role": "body", "text": "Thanks to foul trouble for Adebayo and Dewayne Dedmon in the first half, Udonis Haslem played a season-high five minutes in the 41-year-old big man’s third appearance of the season for Miami. Turkish big man Ömer Yurtseven also got four minutes in his most significant action of the year."}
{"game_id": "0022100170", "chunk_id": "0022100170_025", "order": 25, "role": "body", "text": "Haslem had played only five minutes this season, and Yurtseven had played just 22."}
{"game_id": "0022100170", "chunk_id": "0022100170_027", "order": 27, "role": "body", "text": "Heat: At the Los Angeles Clippers on Thursday."}
{"game_id": "0022100170", "chunk_id": "0022100170_028", "order": 28, "role": "body", "text": "Lakers: Host the Minnesota Timberwolves on Friday."}
