{"game_id": "0022101074", "chunk_id": "0022101074_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Tyrese Maxey told teammate Joel Embiid he’d step up in his absence. Then, Maxey took over the game and the fans’ chants normally reserved for the 76ers' star center."}
{"game_id": "0022101074", "chunk_id": "0022101074_002", "order": 2, "role": "body", "text": "Maxey scored 13 of his game-high 28 points in the fourth quarter, including nine in a row during a crucial stretch, and short-handed Philadelphia — without Embiid and James Harden — beat the Eastern Conference-leading Miami Heat 113-106 on Monday night."}
{"game_id": "0022101074", "chunk_id": "0022101074_003", "order": 3, "role": "body", "text": "Shake Milton scored 20 points and Furkan Korkmaz added 18 for Philadelphia, which pulled within 2½ games of the Heat in the conference. Embiid sat out with back soreness and Harden with left hamstring tightness."}
{"game_id": "0022101074", "chunk_id": "0022101074_004", "order": 4, "role": "body", "text": "“He said, ‘Go out there and help us get a ‘W’,” Maxey said of Embiid’s pregame message. “I told him, ‘I got him.’”"}
{"game_id": "0022101074", "chunk_id": "0022101074_006", "order": 6, "role": "body", "text": "Maxey took over the final 2½ minutes with the game on the line. In a contest that was tight from the tip, Philadelphia was clinging to a two-point lead when Maxey scored on a drive, was fouled and made the free throw for a 106-101 lead with 2:18 left."}
{"game_id": "0022101074", "chunk_id": "0022101074_007", "order": 7, "role": "body", "text": "After Jimmy Butler missed a 3-point try, Maxey hit a step-back 3 for a 109-101 lead. Kyle Lowry and Tyler Herro couldn’t convert at the other hand, and the second-year guard from Kentucky drained another 3, this time for a 112-101 lead with 1:03 to play that brought “MAX-EY! MAX-EY!” chants from the sold-out crowd which usually reserves the loudest cheers for Embiid."}
{"game_id": "0022101074", "chunk_id": "0022101074_008", "order": 8, "role": "body", "text": "“He’s just not scared; he’s so comfortable in the moment,” Philadelphia coach Doc Rivers said. “He’s put in so much work. The more work, the more confident you are, and I think that’s a great testament for Tyrese Maxey.”"}
{"game_id": "0022101074", "chunk_id": "0022101074_010", "order": 10, "role": "body", "text": "After the Heat stole a Philadelphia inbound pass with the 76ers up six points, Maxey raced down the court and blocked Caleb Martin’s attempt with 21 seconds remaining — resulting in more “MAX-EY! MAX-EY!” chants."}
{"game_id": "0022101074", "chunk_id": "0022101074_011", "order": 11, "role": "body", "text": "“I was thinking either he’s going to dunk on me, or I’m going to get this block,” Maxey said. “It’s one of those you have to put your body on the line.”"}
{"game_id": "0022101074", "chunk_id": "0022101074_012", "order": 12, "role": "body", "text": "Butler scored 27, Bam Adebayo had 22 and Lowry 20 for Miami, which lost for just the fifth time in the last 20 games."}
{"game_id": "0022101074", "chunk_id": "0022101074_013", "order": 13, "role": "body", "text": "Philly fans are used to chanting this season, but it’s usually “M-V-P! M-V-P!” for Embiid."}
{"game_id": "0022101074", "chunk_id": "0022101074_014", "order": 14, "role": "body", "text": "“Great feeling to see all the work you put in come together,” Maxey said."}
{"game_id": "0022101074", "chunk_id": "0022101074_015", "order": 15, "role": "body", "text": "Embiid entered Monday tied with LeBron James for the NBA lead in scoring (29.8 ppg). The five-time All-Star is one of the frontrunners for the MVP award."}
{"game_id": "0022101074", "chunk_id": "0022101074_016", "order": 16, "role": "body", "text": "But Maxey took center stage with Embiid on the sidelines."}
{"game_id": "0022101074", "chunk_id": "0022101074_017", "order": 17, "role": "body", "text": "“Maxey played great,” Heat coach Erik Spoelstra said. “He was getting to his right hand all night long. Regardless of what we were doing or whatever the scheme was or whoever was on him, he was getting to his right and getting to where he wanted to go.”"}
{"game_id": "0022101074", "chunk_id": "0022101074_019", "order": 19, "role": "body", "text": "Embiid watched Maxey’s heroics from the bench. He has played in 58 games this season and has made playing regularly a priority this season. The sixth-year center hasn’t played more than 64 games in a season. He missed nine contests in November due to health and safety protocols."}
{"game_id": "0022101074", "chunk_id": "0022101074_020", "order": 20, "role": "body", "text": "Harden has averaged 22.4 points, 10.5 assists and 7.0 rebounds in 11 games with the 76ers since being acquired from Brooklyn for Ben Simmons in a blockbuster trade last month. But the hamstring injury kept Harden off the court in his final four games with the Nets and first four with the 76ers. Since then, the 10-time All-Star and former MVP has played in 11 of 12 games, missing only the 76ers’ 99-82 defeat at Miami on March 5."}
{"game_id": "0022101074", "chunk_id": "0022101074_021", "order": 21, "role": "body", "text": "He didn’t play in the rematch, either, a potential Eastern Conference final preview."}
{"game_id": "0022101074", "chunk_id": "0022101074_022", "order": 22, "role": "body", "text": "“We’re just being careful,” Rivers said before the game. Rivers said Harden did not suffer a setback in his hamstring recovery."}
{"game_id": "0022101074", "chunk_id": "0022101074_023", "order": 23, "role": "body", "text": "The 76ers started Paul Millsap in place of Embiid and Georges Niang for Harden."}
{"game_id": "0022101074", "chunk_id": "0022101074_024", "order": 24, "role": "body", "text": "The star duo’s next opportunity to return to the court will be in Los Angeles on Wednesday, when the 76ers begin a three-game trip against the Lakers."}
{"game_id": "0022101074", "chunk_id": "0022101074_026", "order": 26, "role": "body", "text": "Heat: Gabe Vincent (bruised toe) and Victor Oladipo (lower back spasms) didn’t play."}
{"game_id": "0022101074", "chunk_id": "0022101074_028", "order": 28, "role": "body", "text": "Heat: Begin four-game homestand on Wednesday against Golden State."}
{"game_id": "0022101074", "chunk_id": "0022101074_029", "order": 29, "role": "body", "text": "76ers: Open three-game Western trip against the Lakers on Wednesday."}
