{"game_id": "0022100760", "chunk_id": "0022100760_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Indiana Pacers rookie Isaiah Jackson celebrated his best game of the season with an unexpected bath."}
{"game_id": "0022100760", "chunk_id": "0022100760_002", "order": 2, "role": "body", "text": "He savored every precious second of the ice cold water."}
{"game_id": "0022100760", "chunk_id": "0022100760_003", "order": 3, "role": "body", "text": "Jackson scored 26 points, grabbed 10 rebounds and posted his first double-double in his first career start, leading the Pacers past the Los Angeles Clippers 122-116 on Monday night."}
{"game_id": "0022100760", "chunk_id": "0022100760_004", "order": 4, "role": "body", "text": "“It surprised me because I didn’t know the guys were going to do that and I'm not going to lie, it was very cold,\" he said. “That’s the first time it's happened to me and it’s something I’m going to remember forever.\""}
{"game_id": "0022100760", "chunk_id": "0022100760_005", "order": 5, "role": "body", "text": "The first-round draft pick out of Kentucky spent most of Indiana’s first 51 games scrapping for minutes and avoiding fouls. But with Indiana’s top three centers out of action, the Pacers challenged Jackson and he impressed everyone."}
{"game_id": "0022100760", "chunk_id": "0022100760_006", "order": 6, "role": "body", "text": "Jackson was 12 of 19 from the field, posted season highs in points and rebounds, blocked two shots and even made a 3-pointer all without being called for a single foul. Duane Washington Jr. added 16 points, including four 3s in the fourth quarter, to help the short-handed Pacers earn their second win in six games."}
{"game_id": "0022100760", "chunk_id": "0022100760_007", "order": 7, "role": "body", "text": "Rick Carlisle became the second coach in the franchise’s NBA history to win 200 career games. Frank Vogel had 250 wins in five seasons with the team and this one looked awfully good to Carlisle."}
{"game_id": "0022100760", "chunk_id": "0022100760_008", "order": 8, "role": "body", "text": "“He did such a great job in every area tonight,” Carlisle said, referring to Jackson. “When we talked about him in the draft, this is what we were talking about and this is a dimension this team hasn’t had.”"}
{"game_id": "0022100760", "chunk_id": "0022100760_009", "order": 9, "role": "body", "text": "The worn-out Clippers also were caught off guard. Amir Coffey finished with 27 points and Reggie Jackson had 21 as their five-game winning streak against Indiana came to an end."}
{"game_id": "0022100760", "chunk_id": "0022100760_010", "order": 10, "role": "body", "text": "“To go 4-4 on this tough trip was pretty good for us. It is what it is and now we have to go back and try to regroup,\" coach Tyronn Lue said. “They played well and Isaiah Jackson did a hell of a job.\""}
{"game_id": "0022100760", "chunk_id": "0022100760_011", "order": 11, "role": "body", "text": "Neither team was near full strength."}
{"game_id": "0022100760", "chunk_id": "0022100760_012", "order": 12, "role": "body", "text": "Injured All-Stars Paul George and Kawhi Leonard were out again for the Clippers, and the Pacers played without two-time All-Star Domantas Sabonis, who entered the COVID-19 health and safety protocols earlier Monday."}
{"game_id": "0022100760", "chunk_id": "0022100760_013", "order": 13, "role": "body", "text": "Not surprisingly, it turned this game into a grind-it-out contest."}
{"game_id": "0022100760", "chunk_id": "0022100760_014", "order": 14, "role": "body", "text": "Indiana took a 30-27 lead after one quarter and a 60-55 halftime advantage. Even when it appeared the Clippers had taken control with a 14-5 run late in the third period, they couldn't put it away. Instead, the Pacers answered with 10 straight points to retake an 84-82 lead — only to give it back on Nicolas Batum's 3 to end the third."}
{"game_id": "0022100760", "chunk_id": "0022100760_015", "order": 15, "role": "body", "text": "Batum opened the fourth with another 3 to make it 88-84 and this time Indiana answered with 12 points in a row, including three consecutive 3s by Washington, to make it 99-89. Los Angeles never led again."}
{"game_id": "0022100760", "chunk_id": "0022100760_017", "order": 17, "role": "body", "text": "Clippers: Lost at Indiana for the first time since 2018. ... Batum scored 13 points despite playing with a sore lower back. ... Serge Ibaka had 14 points and 11 rebounds. ... Jackson added five assists. ... Eric Bledsoe also scored 13 points. ... Jason Preston (right foot) and Ivica Zubac (sore right calf) sat out with injuries."}
{"game_id": "0022100760", "chunk_id": "0022100760_018", "order": 18, "role": "body", "text": "Pacers: Caris LeVert had 17 points, seven rebounds and nine assists. ... Terry Taylor had 15 points and eight rebounds. ... Justin Holiday finished with 13 points, including a 3 to seal the win in the waning minutes. He also had five rebounds and six assists. ... Lance Stephenson had 10 points, three rebounds and four assists."}
{"game_id": "0022100760", "chunk_id": "0022100760_020", "order": 20, "role": "body", "text": "Carlisle provided a lengthy pregame medical report. Sabonis is expected to miss at least six additional days. Oshae Brissett (right ankle) was a late scratch and Goga Bitadze will return from his sore right foot when he feels comfortable."}
{"game_id": "0022100760", "chunk_id": "0022100760_021", "order": 21, "role": "body", "text": "Meanwhile, Malcolm Brogdon (right Achilles tendon) and T.J. Warren (left foot) squared off Monday in a 1-on-1 competition, T.J. McConnell had a pin removed from his surgically repaired right wrist and center Myles Turner (left foot) is shooting again. But Carlisle provided no timetable for the return of any players."}
{"game_id": "0022100760", "chunk_id": "0022100760_023", "order": 23, "role": "body", "text": "Clippers: Play their first home game since Jan. 17 on Thursday against the crosstown Lakers."}
{"game_id": "0022100760", "chunk_id": "0022100760_024", "order": 24, "role": "body", "text": "Pacers: Host the Orlando Magic on Wednesday in the second game of a three-game homestand."}
