{"game_id": "0022100413", "chunk_id": "0022100413_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Patty Mills made a 3 to force overtime, Kevin Durant had 34 points, 13 rebounds and 11 assists, and the Brooklyn Nets beat the Toronto Raptors 131-129 on Tuesday night."}
{"game_id": "0022100413", "chunk_id": "0022100413_002", "order": 2, "role": "body", "text": "Durant was upgraded from questionable just before the game because Brooklyn has seven players in the NBA's health and safety protocol, including starters James Harden, LaMarcus Aldridge and DeAndre' Bembry. He responded to the last-minute add with his 14th triple-double of his career."}
{"game_id": "0022100413", "chunk_id": "0022100413_003", "order": 3, "role": "body", "text": "“I felt like it was something I could play on, so I knew I was going to play this morning,” Durant said. “I hate that my teammates are out. I wish everybody was playing.”"}
{"game_id": "0022100413", "chunk_id": "0022100413_004", "order": 4, "role": "body", "text": "Brooklyn won its third straight, with Mills adding 30 points. It was the fourth career 30-point game in Mills’ career, and his first since Nov. 1, 2019, when he was a member of the San Antonio Spurs. The Nets also got 17 from Kessler Edwards, 16 from Nic Claxton and 13 from Blake Griffin before he fouled out in overtime."}
{"game_id": "0022100413", "chunk_id": "0022100413_005", "order": 5, "role": "body", "text": "The loss snapped a two-game winning streak for Toronto (12-15). Fred VanVleet led the Raptors with 31. Gary Trent Jr. and Pascal Siakam each finished with 25."}
{"game_id": "0022100413", "chunk_id": "0022100413_006", "order": 6, "role": "body", "text": "“We know how good of a team we can be when we are clicking and doing what we are supposed to do,” Siakam said. “Every time we haven't done that in season we pay for it.”"}
{"game_id": "0022100413", "chunk_id": "0022100413_007", "order": 7, "role": "body", "text": "Scottie Barnes had 23, but missed what would have been a game-winning, buzzer-beating 3 in overtime."}
{"game_id": "0022100413", "chunk_id": "0022100413_008", "order": 8, "role": "body", "text": "“I feel like we're right there as a team,” Barnes said. “We'll get this thing really going as a unit.”"}
{"game_id": "0022100413", "chunk_id": "0022100413_009", "order": 9, "role": "body", "text": "Trailing by 10 entering the third quarter, Toronto outscored Brooklyn 44-25 to take a 100-91 advantage going into the fourth. But Brooklyn outscored Toronto 26-11 over the first 7:18 of the fourth quarter, regaining the lead, 109-108, on a Mills 3 with 7:12 left. Another Mills 3 from the left side with 4:43 left extended the lead to 117-111."}
{"game_id": "0022100413", "chunk_id": "0022100413_010", "order": 10, "role": "body", "text": "It didn’t last. Barnes knocked down two 3s to tie the game, and Trent made a 3 with 1:21 left to give the Raptors a 120-117 lead. That held until Mills’ 3 with 13 seconds left forced overtime."}
{"game_id": "0022100413", "chunk_id": "0022100413_011", "order": 11, "role": "body", "text": "“I like how we responded throughout the whole game,” Durant said. \"Hitting them first and taking their punch — 44-25 in the third — then turning it up in the fourth quarter and overtime, man. ... I'm so proud to just be a part of this group and play with these young dudes."}
{"game_id": "0022100413", "chunk_id": "0022100413_012", "order": 12, "role": "body", "text": "“Man, it was amazing to be out there.”"}
{"game_id": "0022100413", "chunk_id": "0022100413_014", "order": 14, "role": "body", "text": "Raptors: Barnes has at least one very important fan: Coach Nick Nurse. During his pregame session with reporters, Nurse raved about Barnes, who entered the game averaging 15.1 points and 8.2 rebounds per game. “I’m really happy with the type of person he is,” Nurse said. “He’s really progressing nicely. … He’s just got good energy and passion to play, and I think there’s a real youthful enthusiasm (that) shows itself and sometimes when we need it.”"}
{"game_id": "0022100413", "chunk_id": "0022100413_015", "order": 15, "role": "body", "text": "Nets: Brooklyn was significantly shorthanded as six players were put in the COVID-19 protocols prior to game — Harden, Aldridge, Bembry, Bruce Brown, Jevon Carter and James Johnson. Paul Millsap went into protocol Monday. “It’s unfortunate, for sure,” Nets coach Steve Nash said, who also noted “a couple coaches and a couple staff (members)” were in protocol."}
{"game_id": "0022100413", "chunk_id": "0022100413_017", "order": 17, "role": "body", "text": "Raptors: Host Golden State on Saturday night."}
{"game_id": "0022100413", "chunk_id": "0022100413_018", "order": 18, "role": "body", "text": "Nets: Host Philadelphia on Thursday night."}
