{"game_id": "0022101148", "chunk_id": "0022101148_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Giannis Antetokounmpo loved the fact that he became Milwaukee's career scoring leader on a 3-pointer, so nobody can say he's just a dunker anymore."}
{"game_id": "0022101148", "chunk_id": "0022101148_002", "order": 2, "role": "body", "text": "Otherwise, there was no reason for celebrating after passing Kareem Abdul-Jabbar."}
{"game_id": "0022101148", "chunk_id": "0022101148_003", "order": 3, "role": "body", "text": "“When I’m done we can talk about it, but now there’s no time,” Antetokoumpo said, looking ahead to Friday's game against the Clippers. “There’s things that have to be done.”"}
{"game_id": "0022101148", "chunk_id": "0022101148_004", "order": 4, "role": "body", "text": "Antetokounmpo's record-setting 3-pointer forced overtime, and he made two free throws in the final seconds to give the Bucks a 120-119 victory over the Brooklyn Nets on Thursday night."}
{"game_id": "0022101148", "chunk_id": "0022101148_005", "order": 5, "role": "body", "text": "The defending NBA champions clinched a return to the postseason with the win, in which Antetokounmpo had 44 points, 14 rebounds and six assists. Jrue Holiday added 19 points and Khris Middleton had 16 before being ejected for a flagrant foul midway through the third quarter."}
{"game_id": "0022101148", "chunk_id": "0022101148_006", "order": 6, "role": "body", "text": "Kevin Durant had 26 points, 11 assists and seven rebounds for the Nets, but missed a 3-pointer that would have won it. Kyrie Irving scored 25 points and Bruce Brown had 23."}
{"game_id": "0022101148", "chunk_id": "0022101148_007", "order": 7, "role": "body", "text": "Just as in the memorable end to their second-round series last summer, when the Bucks overcame 48 points from Durant — most ever in a Game 7 — overtime was needed to determine a winner. Milwaukee took that one 115-111 and pulled it out Thursday behind a second straight 40-point game from Antetokounmpo."}
{"game_id": "0022101148", "chunk_id": "0022101148_008", "order": 8, "role": "body", "text": "The Greek Freak has been dismissed, famously by James Harden, as a great athlete but not necessarily a skilled basketball player. But the NBA Finals MVP has become a confident shooter and his teammates are confident in him."}
{"game_id": "0022101148", "chunk_id": "0022101148_009", "order": 9, "role": "body", "text": "“We just fight, compete, compete and know that obviously it helps to have that big fellow on your team that can literally break a game open for you and make plays,” Bucks swingman Wesley Matthews said."}
{"game_id": "0022101148", "chunk_id": "0022101148_010", "order": 10, "role": "body", "text": "Antetokounmpo came into the game 39 points behind Abdul-Jabbar, the NBA's career scoring leader who had 14,211 points after beginning his career in Milwaukee. Antetokounmpo passed him with 18 seconds left to knot the game at 110."}
{"game_id": "0022101148", "chunk_id": "0022101148_011", "order": 11, "role": "body", "text": "The Bucks and Nets could be headed for a first-round matchup this year. The Bucks are a half-game behind Miami for the top spot in the Eastern Conference, while the Nets are tied for eighth and can likely hope for nothing better than the No. 7 or 8 seed by coming out of the play-in tournament."}
{"game_id": "0022101148", "chunk_id": "0022101148_012", "order": 12, "role": "body", "text": "The Bucks led by four in overtime but the Nets rallied to take a 119-118 lead when Durant was fouled on a 3-point attempt and made all three shots with 8.7 seconds left. Antetokounmpo quickly rushed into the lane and was fouled by Nic Claxton. He made both free throws and finished 15 of 19 from the line."}
{"game_id": "0022101148", "chunk_id": "0022101148_013", "order": 13, "role": "body", "text": "The Nets led 99-96 with 5 1/2 minutes left in regulation when Antetokounmpo re-entered the game but threw a bad pass that Brown grabbed and appeared to be on his way to an uncontested layup. But Middleton raced back and grabbed Brown’s upper arm as he was in the air, sending him to a hard landing. Referees reviewed the replay and informed a stunned Middleton that he received the harsher Flagrant 2 and was ejected."}
{"game_id": "0022101148", "chunk_id": "0022101148_014", "order": 14, "role": "body", "text": "Crew chief John Goble said the play was ruled a Flagrant 2 because a “high potential for injury.”"}
{"game_id": "0022101148", "chunk_id": "0022101148_015", "order": 15, "role": "body", "text": "Brown made the free throws, Irving scored and the Nets built a 108-99 lead when Durant threw down Irving’s lob pass with 3:52 left. But they managed only two more points in regulation."}
{"game_id": "0022101148", "chunk_id": "0022101148_016", "order": 16, "role": "body", "text": "“It was just one of those games that got funky at the end, but we’ve just got to finish it out in regulation,” Irving said."}
{"game_id": "0022101148", "chunk_id": "0022101148_018", "order": 18, "role": "body", "text": "Bucks: Coach Mike Budenholzer coached in Brooklyn for the first time this season, having missed the Bucks’ 121-109 victory on Jan. 7 while in the NBA’s health and safety protocols."}
{"game_id": "0022101148", "chunk_id": "0022101148_019", "order": 19, "role": "body", "text": "Nets: Coach Steve Nash said he isn’t closely watching the results of the Cleveland Cavaliers, who have tumbled all the way to seventh in the East. If they remain behind Toronto, the removes the possibility of having to play a play-in game in Canada, where the unvaccinated Irving is unable to travel."}
{"game_id": "0022101148", "chunk_id": "0022101148_020", "order": 20, "role": "body", "text": "“I’m not averse to seeing how they’re doing and where they’re at, but it’s not something that I’m, like I said the other day, refreshing my feed daily,” Nash said."}
{"game_id": "0022101148", "chunk_id": "0022101148_022", "order": 22, "role": "body", "text": "Though Antetokounmpo appeared on the injury report with right knee soreness, Budenholzer said it’s nothing beyond what the two-time NBA MVP has been dealing with for years."}
{"game_id": "0022101148", "chunk_id": "0022101148_023", "order": 23, "role": "body", "text": "“I think it’s in a good place,” Budenholzer said. “I don’t think it’s anything that we’re concerned about, but there’s a daily attention and effort that it takes from the sports performance team and him and what he does to be his best. It’s impressive.”"}
{"game_id": "0022101148", "chunk_id": "0022101148_025", "order": 25, "role": "body", "text": "Bucks: Host the Los Angeles Clippers on Friday."}
{"game_id": "0022101148", "chunk_id": "0022101148_026", "order": 26, "role": "body", "text": "Nets: Visit Atlanta on Saturday."}
