{"game_id": "0022100452", "chunk_id": "0022100452_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young scored 30 points and the surging Atlanta Hawks never trailed while beating the short-handed Cleveland Cavaliers 131-107 on Thursday night to clinch a spot in the Eastern Conference play-in tournament."}
{"game_id": "0022100452", "chunk_id": "0022100452_002", "order": 2, "role": "body", "text": "Cedi Osman led Cleveland with 21 points. Darius Garland had 18 points and eight assists while sitting out the final quarter of the blowout loss."}
{"game_id": "0022100452", "chunk_id": "0022100452_003", "order": 3, "role": "body", "text": "Cavaliers standout rookie Evan Mobley missed his second consecutive game with a sprained ankle. Cleveland has lost two straight and five of six as it attempts to keep the No. 7 spot in the Eastern Conference."}
{"game_id": "0022100452", "chunk_id": "0022100452_004", "order": 4, "role": "body", "text": "Young had nine assists as the Hawks' fourth consecutive win clinched no worse than the No. 10 spot in the Eastern Conference and a berth in the play-in tournament. The Hawks began the night one-half game behind Charlotte and one game behind Brooklyn."}
{"game_id": "0022100452", "chunk_id": "0022100452_005", "order": 5, "role": "body", "text": "“We’re in a tight race here at the end and we’re starting to click at the right time,” Young said, before offering the reminder the Hawks advanced to the Eastern Conference finals last year. “We did the same thing last year and we were able to make a run.”"}
{"game_id": "0022100452", "chunk_id": "0022100452_006", "order": 6, "role": "body", "text": "Kevin Huerter continued his strong finish to the regular season with 23 points, his fourth consecutive game with at least 20 points. Clint Capela added 12 points with 14 rebounds."}
{"game_id": "0022100452", "chunk_id": "0022100452_007", "order": 7, "role": "body", "text": "Cavaliers coach B.J. Bickerstaff said before the game “we’re searching at this point” for a playing rotation due to injuries. Guard Rajon Rando (ankle) missed his 10th consecutive game. Center Jarrett Allen missed his 12th straight with a finger injury."}
{"game_id": "0022100452", "chunk_id": "0022100452_008", "order": 8, "role": "body", "text": "Bickerstaff said he respected the Hawks' “firepower” and said “they have the ability to blow you out because of that.”"}
{"game_id": "0022100452", "chunk_id": "0022100452_009", "order": 9, "role": "body", "text": "The Hawks delivered on Bickerstaff's assessment."}
{"game_id": "0022100452", "chunk_id": "0022100452_010", "order": 10, "role": "body", "text": "Atlanta took its first double-digit lead at 29-19 on Bogdan Bogdanovic's 3-pointer with 3 minutes remaining in the opening period. The Hawks stretched the lead to 20 points, 73-53, early in the second half on Young's 3 and extended the advantage to 30 points in the final period."}
{"game_id": "0022100452", "chunk_id": "0022100452_012", "order": 12, "role": "body", "text": "Cavaliers: Mobley did not travel to Atlanta and is “headed in the right direction,” according to Bickerstaff. ... G RJ Nembhard was converted to a standard NBA contract. ... C Moses Brown had 15 points and 13 rebounds in his second consecutive start after he was signed to a two-way contract."}
{"game_id": "0022100452", "chunk_id": "0022100452_013", "order": 13, "role": "body", "text": "Hawks: C Onyeka Oknogwu had 17 points and 12 rebounds. ... There was no update on F John Collins almost two weeks after the team announced he would be out indefinitely with a plantar fascia tear in his right foot and a right finger sprain. Coach Nate McMillan said Collins “is not doing anything as far as running and jumping” but added “we're not saying he's shut down.” ... In a pregame ceremony, Young was presented the team's Jason Collier Memorial Trophy for community service. The award is given each year in honor of the late Atlanta center who died in 2005."}
{"game_id": "0022100452", "chunk_id": "0022100452_015", "order": 15, "role": "body", "text": "Young played the third quarter after suffering what McMillan said he feared was a serious groin injury in the first half."}
{"game_id": "0022100452", "chunk_id": "0022100452_016", "order": 16, "role": "body", "text": "“It’s been kind of sore these past couple of weeks,” Young said. “... I just took a wrong step and it kind of shocked me for a second. ... I’ll be all right.”"}
{"game_id": "0022100452", "chunk_id": "0022100452_018", "order": 18, "role": "body", "text": "Huerter is taking advantage of increased scoring opportunities, especially in games when Danilo Gallinari (right elbow contusion) has joined John Collins on the inactive list. Huerter sank five of six 3-pointers, his fourth consecutive game making at least four 3s."}
{"game_id": "0022100452", "chunk_id": "0022100452_019", "order": 19, "role": "body", "text": "Some of Huerter’s shots are the result of defenses placing extra attention on Young."}
{"game_id": "0022100452", "chunk_id": "0022100452_020", "order": 20, "role": "body", "text": "“Kevin has been getting more minutes, and playing with Trae the ball has found him,” McMillan said."}
{"game_id": "0022100452", "chunk_id": "0022100452_022", "order": 22, "role": "body", "text": "Cavaliers: Continue a stretch of three games in four days when they visit the New York Knicks on Saturday."}
{"game_id": "0022100452", "chunk_id": "0022100452_023", "order": 23, "role": "body", "text": "Hawks: Remain home to play the Brooklyn Nets on Saturday."}
