{"game_id": "0022100062", "chunk_id": "0022100062_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Their 10-point lead had evaporated in less than three minutes and it looked like the same ol' dreadful Sacramento Kings were about to blow another winnable game."}
{"game_id": "0022100062", "chunk_id": "0022100062_002", "order": 2, "role": "body", "text": "Then Harrison Barnes calmly rose up over Devin Booker, the 3-pointer looked good all the way, and it splashed through the net at the buzzer to give the Kings a thrilling 110-107 victory over the stunned Phoenix Suns on Wednesday night."}
{"game_id": "0022100062", "chunk_id": "0022100062_003", "order": 3, "role": "body", "text": "Instead of finding a way to lose, the Kings had clawed out a win. That's progress."}
{"game_id": "0022100062", "chunk_id": "0022100062_004", "order": 4, "role": "body", "text": "“We're a different group,” Kings coach Luke Walton said. “I know we've got a long way to go still, but we've put in the time, put in the work and it's a group that believes in each other.”"}
{"game_id": "0022100062", "chunk_id": "0022100062_005", "order": 5, "role": "body", "text": "The Kings led by as many as 13 points in the fourth quarter but the Suns rallied late. Booker found Mikal Bridges for an alley-oop dunk with 34 seconds remaining to tie the game at 107."}
{"game_id": "0022100062", "chunk_id": "0022100062_006", "order": 6, "role": "body", "text": "Phoenix got a defensive stop on the next possession but Booker’s difficult 18-foot jumper with 4.1 seconds left was off the mark. Sacramento grabbed the rebound and called a timeout to set up a final possession."}
{"game_id": "0022100062", "chunk_id": "0022100062_007", "order": 7, "role": "body", "text": "With 1.4 seconds left, De’Aaron Fox threw a short inbounds pass to Barnes, who was guarded tightly by Booker. The 6-foot-8 Barnes jumped, turning and rising over Booker’s outstretched arm for the game-winning shot, shouting as it went through the hoop."}
{"game_id": "0022100062", "chunk_id": "0022100062_008", "order": 8, "role": "body", "text": "Barnes said there were no nerves in the final moments: “Honestly, we're just trying to get a good look. We know worst-case scenario, we go to overtime.\""}
{"game_id": "0022100062", "chunk_id": "0022100062_009", "order": 9, "role": "body", "text": "Walton said the Kings have to grow from the jittery final minutes, but it's a lot easier to teach those lessons with a win."}
{"game_id": "0022100062", "chunk_id": "0022100062_010", "order": 10, "role": "body", "text": "“It's an emotional roller coaster sometimes,” Walton said. “I'm happy for our guys because they did play really hard tonight. They fought back from a poor first half, built up a nice lead, made some big plays. But we have to learn from that.”"}
{"game_id": "0022100062", "chunk_id": "0022100062_011", "order": 11, "role": "body", "text": "Barnes had 22 points. Buddy Hield thrived in his role off the bench, pouring in 26 points in just 27 minutes. The 6-foot-4 guard made a season-high seven 3-pointers on just 11 attempts and added five rebounds."}
{"game_id": "0022100062", "chunk_id": "0022100062_012", "order": 12, "role": "body", "text": "Tyrese Haliburton scored 15 points and hit an off-balance 3-pointer from the corner late in the fourth to help the Kings stay ahead. The Kings improved to 2-2 and are trying to break a string of 15 straight losing seasons."}
{"game_id": "0022100062", "chunk_id": "0022100062_013", "order": 13, "role": "body", "text": "The loss continued a slow start for the Suns, who are 1/3 after making the NBA Finals last season. They have similar expectations this season with essentially the same team, but had a cold night shooting from long range, finishing 6 of 22 (27.3%) from behind the arc."}
{"game_id": "0022100062", "chunk_id": "0022100062_014", "order": 14, "role": "body", "text": "Deandre Ayton had 21 points and a season-high 21 rebounds. Booker scored a season-high 31 points. Jae Crowder — who had 10 points — said the Suns were coasting at times until the final few minutes."}
{"game_id": "0022100062", "chunk_id": "0022100062_015", "order": 15, "role": "body", "text": "“You saw us play desperate,” Crowder said. “We have to find a way to generate that for 48 minutes. We have to get back being the hunter instead of being hunted. We are stepping up to the challenge but not for 48 minutes.”"}
{"game_id": "0022100062", "chunk_id": "0022100062_016", "order": 16, "role": "body", "text": "The Kings trailed for much of the night before a 17-6 run pushed them to an 82-76 advantage by the end of the third quarter. The Suns scored just 15 points in the third on 7-of-22 (32%) shooting."}
{"game_id": "0022100062", "chunk_id": "0022100062_017", "order": 17, "role": "body", "text": "The Suns never trailed in the first half, jumping out to 61-53 lead by halftime. Ayton had 16 points and 11 rebounds before the break, making 8 of 11 shots from the field. Fox and Barnes both scored 10 for the Kings."}
{"game_id": "0022100062", "chunk_id": "0022100062_019", "order": 19, "role": "body", "text": "Kings: Alex Len finished with 10 points and three rebounds. He made a 3-pointer midway through the fourth quarter to put the Kings up 12. The 7-footer spent his first five seasons in the NBA with the Suns. ... Terence Davis missed all seven of his shots."}
{"game_id": "0022100062", "chunk_id": "0022100062_020", "order": 20, "role": "body", "text": "Suns: Backup point guard Cam Payne didn't play because of a right hamstring strain. Elfrid Payton filled in for Payne and finished with 10 points and two assists."}
{"game_id": "0022100062", "chunk_id": "0022100062_022", "order": 22, "role": "body", "text": "Kings: Visit New Orleans on Friday."}
{"game_id": "0022100062", "chunk_id": "0022100062_023", "order": 23, "role": "body", "text": "Suns: Host Cleveland on Saturday."}
