{"game_id": "0022100607", "chunk_id": "0022100607_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — LaMelo Ball spent his youth “playing up” against older competition."}
{"game_id": "0022100607", "chunk_id": "0022100607_002", "order": 2, "role": "body", "text": "That's when he learned to shoot floaters."}
{"game_id": "0022100607", "chunk_id": "0022100607_003", "order": 3, "role": "body", "text": "“Playing against bigger people, you can't really get no shot up, so I did all of these little floats,” Ball said."}
{"game_id": "0022100607", "chunk_id": "0022100607_004", "order": 4, "role": "body", "text": "It paid off Monday night when Ball hit an off-balance, go-ahead floater with 15 seconds left to lift the Charlotte Hornets over the NBA champion Milwaukee Bucks for the second straight night, 103-99."}
{"game_id": "0022100607", "chunk_id": "0022100607_005", "order": 5, "role": "body", "text": "Terry Rozier had 27 points, Ball scored 18 of his 23 points in the second half, and Miles Bridges added 17 points and 11 rebounds for the Hornets, who have won six of eight games and improved to 12-5 at home."}
{"game_id": "0022100607", "chunk_id": "0022100607_006", "order": 6, "role": "body", "text": "Khris Middleton had 27 points and 11 assists, and Giannis Antetokounmpo added 26 points, 13 rebounds and eight assists for the Bucks, who also lost 114-106 to the Hornets on Saturday night."}
{"game_id": "0022100607", "chunk_id": "0022100607_007", "order": 7, "role": "body", "text": "The Bucks battled back from the 15 down in the third quarter to tie it when Antetokounmpo scored on a drive through the lane with 38.8 seconds left and drew a foul. He missed the free throw, but Wesley Matthews got the tip-in to tie it."}
{"game_id": "0022100607", "chunk_id": "0022100607_008", "order": 8, "role": "body", "text": "While Ball has been terrific as a playmaker since joining the Hornets as the No. 3 overall pick in the 2020 NBA draft, he hasn't often been called upon to score with the game on the line."}
{"game_id": "0022100607", "chunk_id": "0022100607_009", "order": 9, "role": "body", "text": "When Charlotte's play began to break down and the Bucks took away his first two reads in Rozier and Bridges, Ball took matters into his own hands and darted across the lane to his left, sweeping the ball above his shoulder before launching a runner across his body as he was falling away to give the Hornets (22-19) the lead for good."}
{"game_id": "0022100607", "chunk_id": "0022100607_010", "order": 10, "role": "body", "text": "“That is a highly difficult shot, but he makes it look effortless,” Hornets coach James Borrego said. “Melo has that uncanny ability to be going 100 mph, get off-balance and still be poised when he raises up. ... That’s tough to do for a player who has been in the league 15 years, let alone a guy who has been in the league two years.”"}
{"game_id": "0022100607", "chunk_id": "0022100607_011", "order": 11, "role": "body", "text": "The Bucks (26-17) had a chance to tie or take the lead on the next possession. However, Antetokounmpo drove the lane and tried to dish to Pat Connaughton in the corner but instead threw the ball over his head and out of bounds with 3.3 seconds left, the Bucks' 20th turnover of the game."}
{"game_id": "0022100607", "chunk_id": "0022100607_012", "order": 12, "role": "body", "text": "Bridges then sank two free throws to seal Charlotte's win."}
{"game_id": "0022100607", "chunk_id": "0022100607_013", "order": 13, "role": "body", "text": "The Bucks have lost four of five."}
{"game_id": "0022100607", "chunk_id": "0022100607_014", "order": 14, "role": "body", "text": "“You are definitely concerned anytime you lose four out of five,\" Middleton said. “And you never want to lose two in a row. You understand what the circumstances are (with players being out) and you never want to use that as an excuse. We understand what we're going through and everybody is going through. But we still have to go out there and compete.”"}
{"game_id": "0022100607", "chunk_id": "0022100607_015", "order": 15, "role": "body", "text": "The Bucks led 48-47 at the break as the teams combined to shoot 38% from the floor in the first half."}
{"game_id": "0022100607", "chunk_id": "0022100607_016", "order": 16, "role": "body", "text": "The Hornets came out of halftime hot, surging ahead by 15 behind Ball's 16 third-quarter points, including a 3 off the glass from the wing and a step-back 3 from the top of the key off a fast break."}
{"game_id": "0022100607", "chunk_id": "0022100607_018", "order": 18, "role": "body", "text": "Milwaukee is clearly missing point guard Jrue Holiday."}
{"game_id": "0022100607", "chunk_id": "0022100607_019", "order": 19, "role": "body", "text": "Middleton has been forced to play more point guard in his absence, and he turned the ball over 13 times in two games against the Hornets."}
{"game_id": "0022100607", "chunk_id": "0022100607_020", "order": 20, "role": "body", "text": "“The last two games I have had some bad, careless turnovers,” Middleton said."}
{"game_id": "0022100607", "chunk_id": "0022100607_022", "order": 22, "role": "body", "text": "Rozier was 4 of 11 from 3-point range, marking the eighth time in the last nine games he has made at least four 3s. He is shooting 47.6% (40 of 84) from long distance during that nine-game stretch."}
{"game_id": "0022100607", "chunk_id": "0022100607_023", "order": 23, "role": "body", "text": "“We are heading in the right direction at the halfway point of the season,” Rozier said. “... We're not satisfied, but we like where we are at.”"}
{"game_id": "0022100607", "chunk_id": "0022100607_025", "order": 25, "role": "body", "text": "Bucks: Connaughton returned for Milwaukee, but Grayson Allen and George Hill remained in the health and safety protocols. Connaughton struggled, missing all six shot attempts including five from long distance."}
{"game_id": "0022100607", "chunk_id": "0022100607_026", "order": 26, "role": "body", "text": "Hornets: Played without top reserve Kelly Oubre Jr., who entered the league's health and safety protocols on Monday. Oubre was averaging 25 points over his last two games."}
{"game_id": "0022100607", "chunk_id": "0022100607_028", "order": 28, "role": "body", "text": "Bucks: Host Golden State on Thursday night."}
{"game_id": "0022100607", "chunk_id": "0022100607_029", "order": 29, "role": "body", "text": "Hornets: At Philadelphia on Wednesday night."}
