{"game_id": "0022100748", "chunk_id": "0022100748_001", "order": 1, "role": "lead", "text": "MIAMI -- — Fred VanVleet hit two 3-pointers in the third overtime and the Toronto Raptors outlasted the Miami Heat 124-120 on Saturday night."}
{"game_id": "0022100748", "chunk_id": "0022100748_002", "order": 2, "role": "body", "text": "Gary Trent Jr. led Toronto with 33 points, Scottie Barnes added 22, Pascal Siakam had 21, and OG Anunoby 20. Sidelined the previous two games because of right knee soreness, VanVleet finished with 19 points."}
{"game_id": "0022100748", "chunk_id": "0022100748_003", "order": 3, "role": "body", "text": "“We hung in there and certainly could’ve went either way several times,” Toronto coach Nick Nurse said. “And to just keep hanging in there and keep fighting and keep figuring it out.”"}
{"game_id": "0022100748", "chunk_id": "0022100748_004", "order": 4, "role": "body", "text": "VanVleet’s first 3 tied it at 117. Anunoby’s dunk with 3:05 left put Toronto ahead for good before VanVleet connected again from long distance and a 122-117 lead."}
{"game_id": "0022100748", "chunk_id": "0022100748_005", "order": 5, "role": "body", "text": "“We fought through some adversity so it was good for us tonight to stick it out and keep our composure,” VanVleet said."}
{"game_id": "0022100748", "chunk_id": "0022100748_006", "order": 6, "role": "body", "text": "Jimmy Butler had a triple-double with 37 points, 14 rebounds and 11 assists for the Eastern Conference-leading Heat."}
{"game_id": "0022100748", "chunk_id": "0022100748_007", "order": 7, "role": "body", "text": "“It was highly competitive and wild swings, back and forth, of emotion,” Miami coach Erik Spoelstra said. “It was going to require a great deal of mental toughness to be able to fight through a lot of frustrating moments in the first three quarters, but I thought we responded. Just a terrific ball game in the fourth quarter and all the overtimes.”"}
{"game_id": "0022100748", "chunk_id": "0022100748_008", "order": 8, "role": "body", "text": "After shooting 3 for 15 in regulation, VanVleet was 4 of 7 in the overtime periods."}
{"game_id": "0022100748", "chunk_id": "0022100748_009", "order": 9, "role": "body", "text": "“At that point we tried everybody, everybody had a shot,” VanVleet said. “Everybody had their chance once and it came to me again. By that point I’m going to shoot those and if we miss them we lose and if I make them we win.”"}
{"game_id": "0022100748", "chunk_id": "0022100748_010", "order": 10, "role": "body", "text": "Former Raptors guard Kyle Lowry missed his seventh straight game for Miami. Lowry, who joined the Heat in the offseason after nine years in Toronto, is out because of personal reasons."}
{"game_id": "0022100748", "chunk_id": "0022100748_011", "order": 11, "role": "body", "text": "Miami prematurely celebrated Gabe Vincent’s dribble to the front court and 35-foot heave that bounced in and would have given the Heat a 3-point win in the second overtime. But Vincent had not seen Spoelstra signal a timeout before his attempt."}
{"game_id": "0022100748", "chunk_id": "0022100748_012", "order": 12, "role": "body", "text": "Emotionally, it was a battle for us, going in there on the second night of a back to back,” said Heat guard Tyler Herro, who finished with 13 points. “The mentality is just to do whatever it takes to get the win and we came up a little short. But we battled and that’s all we can ask for.”"}
{"game_id": "0022100748", "chunk_id": "0022100748_013", "order": 13, "role": "body", "text": "Two free throws from Trent with 16.8 seconds left in overtime tied it at 105 and forced the first additional five minutes. Trent shot 13 of 28 from the field in his third consecutive game of scoring 30 or more points."}
{"game_id": "0022100748", "chunk_id": "0022100748_014", "order": 14, "role": "body", "text": "The Heat rallied from a 16-point third quarter deficit and outscored Toronto 27-17 in the fourth period."}
{"game_id": "0022100748", "chunk_id": "0022100748_016", "order": 16, "role": "body", "text": "Raptors: The five starters played more than 50 minutes. ... Began a stretch of 10 of 14 road games. ... Siakam has scored 20 or more points in nine of his last 11 games."}
{"game_id": "0022100748", "chunk_id": "0022100748_017", "order": 17, "role": "body", "text": "Heat: Missed their first four free throw attempts after converting 26 of 27 against the Los Angeles Clippers on Friday. Butler’s string of 19 straight converted free throws ended when he missed two attempts in the first period. ... Dropped to 19-6 at home."}
{"game_id": "0022100748", "chunk_id": "0022100748_019", "order": 19, "role": "body", "text": "Raptors: At Atlanta on Monday night."}
{"game_id": "0022100748", "chunk_id": "0022100748_020", "order": 20, "role": "closing", "text": "Heat: At Boston on Monday night."}
