{"game_id": "0022100251", "chunk_id": "0022100251_001", "order": 1, "role": "lead", "text": "PHOENIX -- — The Phoenix Suns rolled up 48 points in just the first quarter with a smorgasbord of 3-pointers, dunks and mid-range jumpers that buried the Denver Nuggets."}
{"game_id": "0022100251", "chunk_id": "0022100251_002", "order": 2, "role": "body", "text": "Cam Johnson admits it was pretty impressive. He still believes the Suns can do better."}
{"game_id": "0022100251", "chunk_id": "0022100251_003", "order": 3, "role": "body", "text": "“I think we can get to 50,” Johnson said."}
{"game_id": "0022100251", "chunk_id": "0022100251_004", "order": 4, "role": "body", "text": "Expectations are understandably high for the Suns these days, who eased to their 12th straight victory by beating the short-handed Nuggets 126-97 on Sunday night."}
{"game_id": "0022100251", "chunk_id": "0022100251_005", "order": 5, "role": "body", "text": "Johnson scored a career-high 22 points and Deandre Ayton added 21. The fast-starting Suns were able to rest several of their starters for much of the second half, including veteran point guard Chris Paul, who finished with nine points and 10 assists."}
{"game_id": "0022100251", "chunk_id": "0022100251_006", "order": 6, "role": "body", "text": "Phoenix shot 17 of 22 (77.3%) from the field during its first-quarter spree, going 7 of 8 from 3-point range."}
{"game_id": "0022100251", "chunk_id": "0022100251_007", "order": 7, "role": "body", "text": "“Everything was working,” Booker said."}
{"game_id": "0022100251", "chunk_id": "0022100251_008", "order": 8, "role": "body", "text": "Johnson, Devin Booker and Jae Crowder all hit two 3-pointers during the early run. The Suns haven’t lost since Oct. 27 against Sacramento when Harrison Barnes made a 3-pointer at the buzzer. It’s the longest winning streak for the franchise since winning 17 straight during the 2006-07 season."}
{"game_id": "0022100251", "chunk_id": "0022100251_009", "order": 9, "role": "body", "text": "“The way we moved the ball in the first quarter — shooting and passing and recognizing what they were doing in their coverages — it was good to see,” Suns coach Monty Williams said."}
{"game_id": "0022100251", "chunk_id": "0022100251_010", "order": 10, "role": "body", "text": "Denver star forward Nikola Jokic missed his second straight game with a sprained right wrist. The Nuggets have lost four straight to fall to 9-8."}
{"game_id": "0022100251", "chunk_id": "0022100251_011", "order": 11, "role": "body", "text": "\"They were just making shots,\" Nuggets forward JaMychal Green said. “It was like a blur out there. I felt like everything we threw at them didn’t work.”"}
{"game_id": "0022100251", "chunk_id": "0022100251_012", "order": 12, "role": "body", "text": "Denver is one of the few teams that has beaten the Suns this season — winning the opener 110-98 — but that's when the Nuggets had a healthy Jokic and Michael Porter Jr. (low back pain)."}
{"game_id": "0022100251", "chunk_id": "0022100251_013", "order": 13, "role": "body", "text": "This was much different. The Nuggets became even more short-handed late in the third quarter when Aaron Gordon was ejected after two quick technicals for arguing with an official after he was called for an offensive foul. Jeff Green led the Nuggets with 19 points. Gordon had 16."}
{"game_id": "0022100251", "chunk_id": "0022100251_014", "order": 14, "role": "body", "text": "The Suns took a 100-78 lead into the fourth."}
{"game_id": "0022100251", "chunk_id": "0022100251_015", "order": 15, "role": "body", "text": "Denver recovered from the lopsided first quarter to cut Phoenix's advantage to 73-60 by halftime and cut the deficit to nine points briefly in the third quarter. But the Suns built their big lead back in a hurry."}
{"game_id": "0022100251", "chunk_id": "0022100251_016", "order": 16, "role": "body", "text": "“When you give up 48 in the first quarter and you are down by 20, as many as 30 at one point, you spend so much energy trying to get back in the game,” Denver coach Michael Malone said. “It was great to see our guys continue to fight, compete and not just to roll over but you can’t allow a team to come out and play like that in the first quarter.”"}
{"game_id": "0022100251", "chunk_id": "0022100251_018", "order": 18, "role": "body", "text": "The Suns have a 6-0 record against teams that have been above .500 this season. They're 13-3 overall."}
{"game_id": "0022100251", "chunk_id": "0022100251_020", "order": 20, "role": "body", "text": "Nuggets: Jokic was listed as probable on the injury report but still didn't play. ... The Nuggets were also missing F Zeke Nnaji (right ankle sprain). G Bones Hyland appeared to injure an ankle during the first quarter. He tried to play through the pain for a possession but eventually had to leave the game."}
{"game_id": "0022100251", "chunk_id": "0022100251_021", "order": 21, "role": "body", "text": "Suns: F/C Frank Kaminsky missed his third straight game and the team announced he's out indefinitely with a stress reaction in his right knee. Kaminsky is averaging 10.6 points and 4.6 rebounds and scored a career-high 31 points this season. ... F Abdel Nader (right knee injury) also didn't play. ... The 48 points were the second-most in franchise history in the first quarter. They scored 50 against the Nuggets in the first quarter during a game in 1990. ... Cam Payne and JaVale McGee both added 10 points off the bench."}
{"game_id": "0022100251", "chunk_id": "0022100251_023", "order": 23, "role": "body", "text": "Nuggets: At Portland on Tuesday night. Denver plays eight of the next nine games on the road."}
{"game_id": "0022100251", "chunk_id": "0022100251_024", "order": 24, "role": "body", "text": "Suns: At San Antonio on Monday night."}
