{"game_id": "0022101051", "chunk_id": "0022101051_001", "order": 1, "role": "lead", "text": "TORONTO -- — LeBron James scored 19 of his 36 points in the fourth quarter and overtime, Russell Westbrook had 22 points, 10 rebounds, and 10 assists, and the Los Angeles Lakers snapped a three-game losing streak by beating the Toronto Raptors 128-123 on Friday night."}
{"game_id": "0022101051", "chunk_id": "0022101051_002", "order": 2, "role": "body", "text": "Avery Bradley hit a go-ahead 3-pointer with 32.5 seconds left in the extra session, putting the visitors up 125-123, then added a pair of free throws after a turnover by Toronto rookie Scottie Barnes."}
{"game_id": "0022101051", "chunk_id": "0022101051_003", "order": 3, "role": "body", "text": "“To be able to come into a very hostile environment and win a basketball game, and the way we won it, was big for our team,” James said. “We needed literally every minute, all 53 of them, to accomplish that.”"}
{"game_id": "0022101051", "chunk_id": "0022101051_004", "order": 4, "role": "body", "text": "Wenyen Gabriel scored 17 points, Bradley had 14 and Austin Reaves 10 as Los Angeles avenged Monday’s home loss to the Raptors and ended Toronto’s winning streak at five."}
{"game_id": "0022101051", "chunk_id": "0022101051_005", "order": 5, "role": "body", "text": "“I thought we did a great job of just sticiing to our principles, grinding the game out,” Westbrook said. “This was a grind-out game.”"}
{"game_id": "0022101051", "chunk_id": "0022101051_006", "order": 6, "role": "body", "text": "The Lakers snapped an 11-game road losing streak that dated back to a Jan. 25 victory at Brooklyn. Los Angeles also ended a seven-game losing streak north of the border."}
{"game_id": "0022101051", "chunk_id": "0022101051_007", "order": 7, "role": "body", "text": "“It’s a great feeling,” Bradley said. “It was a great accomplishment for us tonight to go out there and be able to play the right way on both ends of the floor. It was really refreshing.”"}
{"game_id": "0022101051", "chunk_id": "0022101051_008", "order": 8, "role": "body", "text": "James shot 15 for 26 and went 2 for 7 from 3-point range. He had nine rebounds."}
{"game_id": "0022101051", "chunk_id": "0022101051_009", "order": 9, "role": "body", "text": "“That’s part of what makes him the greatest is his ability to just make whatever play is necessary, whatever side of the floor,” Lakers coach Frank Vogel said."}
{"game_id": "0022101051", "chunk_id": "0022101051_010", "order": 10, "role": "body", "text": "Barnes set career-highs with 31 points and 17 rebounds, Gary Trent Jr. scored 23 points and Fred Van Vleet 20."}
{"game_id": "0022101051", "chunk_id": "0022101051_011", "order": 11, "role": "body", "text": "Precious Achiuwa scored 18 points, but made a costly turnover in the final seconds of regulation that led to Westbrook’s tying 3 with less than a second to play."}
{"game_id": "0022101051", "chunk_id": "0022101051_012", "order": 12, "role": "body", "text": "Toronto looked to have the game won after Trent hit a go-ahead 3 with 25 seconds left, and James and Westbrook both missed from distance at the other end, with Trent grabbing the rebound on Westbrook’s shot."}
{"game_id": "0022101051", "chunk_id": "0022101051_013", "order": 13, "role": "body", "text": "Los Angeles got a break when Achiuwa turned the ball over with 5 seconds left and Westbrook hit a tying 3 with less than 1 second remaining."}
{"game_id": "0022101051", "chunk_id": "0022101051_014", "order": 14, "role": "body", "text": "“We just didn’t make one little play there to get the ball in bounds,” Raptors coach Nick Nurse said. “We got it in and got a tough pass complete, and then gave it up.”"}
{"game_id": "0022101051", "chunk_id": "0022101051_015", "order": 15, "role": "body", "text": "Westbrook said he snuck a look at his feet and slid his right toe back to make sure he wasn’t on the line for his pivotal shot."}
{"game_id": "0022101051", "chunk_id": "0022101051_016", "order": 16, "role": "body", "text": "“Big-time IQ right there on his part,” James said. “A big-time shot by a big-time player.”"}
{"game_id": "0022101051", "chunk_id": "0022101051_017", "order": 17, "role": "body", "text": "Westbrook’s triple-double was his 10th of the season and the 194th of his career."}
{"game_id": "0022101051", "chunk_id": "0022101051_018", "order": 18, "role": "body", "text": "“He really competed,” Vogel said. “I thought tonight he did a great job of really leading the team in terms of organizing our action, not just making plays himself but getting our group organized.”"}
{"game_id": "0022101051", "chunk_id": "0022101051_019", "order": 19, "role": "body", "text": "Toronto couldn’t get a shot off on its final possession, sending it to OT."}
{"game_id": "0022101051", "chunk_id": "0022101051_020", "order": 20, "role": "body", "text": "The Lakers made their first six field-goal attempts of the game, including three from long range, to lead 15-5, but Toronto reclaimed the advantage with a 18-3 spurt. Making his first start for Los Angeles, Gabriel shot 6 for 6 in the first quarter and scored 14 points as the Lakers led 33-30 after one."}
{"game_id": "0022101051", "chunk_id": "0022101051_021", "order": 21, "role": "body", "text": "James scored 12 points in the second. Los Angeles led 59-55 at the half, but Barnes had 12 in the third as Toronto took an 89-88 lead to the fourth."}
{"game_id": "0022101051", "chunk_id": "0022101051_023", "order": 23, "role": "body", "text": "Beforehand, Nurse said he hasn’t seen James slow down with age."}
{"game_id": "0022101051", "chunk_id": "0022101051_024", "order": 24, "role": "body", "text": "“To me, he’s got the freight train game going,” Nurse said. “He gets in transition, and you’ve got to be a man to stand in there and get in the way to slow him down.”"}
{"game_id": "0022101051", "chunk_id": "0022101051_026", "order": 26, "role": "body", "text": "Injured Lakers forward Anthony Davis tested his sprained right foot by taking some shots on the court before the game. Davis sat for the 12th straight game, but Vogel said the star big man is making progress in the intensity of his work."}
{"game_id": "0022101051", "chunk_id": "0022101051_027", "order": 27, "role": "body", "text": "“Anthony has had a good week,” Vogel said. “He’s had a productive week.”"}
{"game_id": "0022101051", "chunk_id": "0022101051_029", "order": 29, "role": "body", "text": "Lakers: G Talen Horton-Tucker sat because of a sprained left ankle. F Carmelo Anthony and G Wayne Ellington were both sidelined due to a non-COVID illness."}
{"game_id": "0022101051", "chunk_id": "0022101051_030", "order": 30, "role": "body", "text": "Raptors: F OG Anunoby (fractured right ring finger) will be reevaluated in a week, Nurse said. Anunoby has missed the past 13 games. … Siakam scored 17 points."}
{"game_id": "0022101051", "chunk_id": "0022101051_032", "order": 32, "role": "body", "text": "Lakers: At Washington on Saturday night."}
{"game_id": "0022101051", "chunk_id": "0022101051_033", "order": 33, "role": "body", "text": "Raptors: At Philadelphia on Sunday night."}
