{"game_id": "0022101203", "chunk_id": "0022101203_001", "order": 1, "role": "lead", "text": "DETROIT -- — Giannis Antetokounmpo had 30 points, 13 rebounds and eight assists to help the Milwaukee Bucks rout the Detroit Pistons 131-101 on Friday night."}
{"game_id": "0022101203", "chunk_id": "0022101203_002", "order": 2, "role": "body", "text": "“I knew I had to be aggressive and play downhill tonight,” Antetokounmpo said. “Even when we had the big lead, I kept going, because this is the time of year when you build good habits. Now isn't the time to cheat the game.”"}
{"game_id": "0022101203", "chunk_id": "0022101203_003", "order": 3, "role": "body", "text": "Averaging 29.9 points, Antetokounmpo needs 35 points or more Sunday in the season finale at Cleveland to join Kareem Abdul-Jabbar as the only Milwaukee players to average 30 points for a season."}
{"game_id": "0022101203", "chunk_id": "0022101203_004", "order": 4, "role": "body", "text": "“What is huge for us is that Giannis scores of all his points without knocking himself out on double teams,” Bucks coach Mike Budenholzer said. “When he sees an opportunity to find an open teammate, he makes the right play. Not every great scorer has that mentality.”"}
{"game_id": "0022101203", "chunk_id": "0022101203_005", "order": 5, "role": "body", "text": "Brook Lopez added 17 points, and Khris Middleton had 15. The defending champion Bucks led by 32 points en route to their third straight victory. They improved to 51-30."}
{"game_id": "0022101203", "chunk_id": "0022101203_006", "order": 6, "role": "body", "text": "“That's a well-oiled machine and they are playing like a championship team,” Pistons coach Dwane Casey said. “That's one of the first real stinkers we've played since the All-Star Game, but they make you pay for every mistake you make.”"}
{"game_id": "0022101203", "chunk_id": "0022101203_007", "order": 7, "role": "body", "text": "Rodney McGruder had a career-high 26 points for Detroit. Saddiq Bey (20) and Cade Cunningham (14) were the only starters to reach double figures."}
{"game_id": "0022101203", "chunk_id": "0022101203_008", "order": 8, "role": "body", "text": "“It's fun to play the game and have the opportunity to still play like this,” McGruder said. “I know I'm not going to get 24 minutes very often, and the circumstances weren't great, but I made sure to take advantage.”"}
{"game_id": "0022101203", "chunk_id": "0022101203_009", "order": 9, "role": "body", "text": "The Pistons missed 15 of their first 16 field-goal attempts, falling behind 23-4. Detroit finished with an NBA-season-low eight points in the first quarter, falling behind by 22."}
{"game_id": "0022101203", "chunk_id": "0022101203_010", "order": 10, "role": "body", "text": "Milwaukee's defense wasn't quite as sharp in the second quarter, but the Bucks still led 56-38 at the half despite only shooting 41.2% themselves."}
{"game_id": "0022101203", "chunk_id": "0022101203_011", "order": 11, "role": "body", "text": "“That's a talented team that beat us earlier in the season, so we knew we had to take them seriously,” said Bucks guard Wesley Matthews. “We came out and locked in right away, which is great to see on the second half of a back-to-back.”"}
{"game_id": "0022101203", "chunk_id": "0022101203_012", "order": 12, "role": "body", "text": "The Bucks moved the margin to 31, 76-44, on Antetokounmpo's three-point play midway through the third quarter, and only McGruder's career night kept the Pistons from being humiliated."}
{"game_id": "0022101203", "chunk_id": "0022101203_013", "order": 13, "role": "body", "text": "Milwaukee's George Hill left the game with back spasms after scoring 10 points in 16 minutes."}
{"game_id": "0022101203", "chunk_id": "0022101203_014", "order": 14, "role": "body", "text": "“We will see how he feels tomorrow, but he's really sore right now,” Budenholzer said."}
{"game_id": "0022101203", "chunk_id": "0022101203_016", "order": 16, "role": "body", "text": "Bucks: Milwaukee improved to 13-1 against the Pistons under Budenholzer. The only blemish was Detroit's 115-105 win in Milwaukee on Jan. 3. ... Antetokounmpo reached 2,000 points for the second time in his career. He needs 13 points in the finale to break his current career high of 2,014, set in 2017-18."}
{"game_id": "0022101203", "chunk_id": "0022101203_017", "order": 17, "role": "body", "text": "Pistons: Detroit's loss guarantees it will finish with fewer than 25 wins for the third straight season — the longest streak in franchise history."}
{"game_id": "0022101203", "chunk_id": "0022101203_019", "order": 19, "role": "body", "text": "Bucks: At Cleveland on Sunday."}
{"game_id": "0022101203", "chunk_id": "0022101203_020", "order": 20, "role": "closing", "text": "Pistons: At Philadelphia on Sunday."}
