{"game_id": "0022100384", "chunk_id": "0022100384_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Kevin Durant and James Harden carried the heavy scoring load for the Brooklyn Nets, as usual."}
{"game_id": "0022100384", "chunk_id": "0022100384_002", "order": 2, "role": "body", "text": "Coach Steve Nash also credited his “bullpen” for closing out New Jersey's win over Atlanta."}
{"game_id": "0022100384", "chunk_id": "0022100384_003", "order": 3, "role": "body", "text": "Durant scored 31 points, including a go-ahead jumper midway through the fourth quarter, and the Nets proved to be resilient once again, beating the Hawks 113-105 on Friday night."}
{"game_id": "0022100384", "chunk_id": "0022100384_004", "order": 4, "role": "body", "text": "New Jersey trailed 91-89 before outscoring Atlanta 24-14 in the final period."}
{"game_id": "0022100384", "chunk_id": "0022100384_005", "order": 5, "role": "body", "text": "Rookie Cam Thomas sank three 3-pointers while scoring 11 points off Brooklyn's bench. Another backup, Nic Claxton, added four points and four rebounds while providing valuable defense as most of his minutes came in the final quarter."}
{"game_id": "0022100384", "chunk_id": "0022100384_006", "order": 6, "role": "body", "text": "“They’re both so versatile,” Nash said of Thomas and Claxton. “It really gives us a great bullpen, so to speak. ... I think it just elevates our level of play at that end of the floor so much.”"}
{"game_id": "0022100384", "chunk_id": "0022100384_007", "order": 7, "role": "body", "text": "With the 6-foot-11 Claxton sharing the defensive load on Atlanta point guard Trae Young, the Hawks made only 6 of 22 shots in the final period."}
{"game_id": "0022100384", "chunk_id": "0022100384_008", "order": 8, "role": "body", "text": "“It was just a good lineup to finish the game,” Durant said. “I’m glad the defense won it for us.”"}
{"game_id": "0022100384", "chunk_id": "0022100384_009", "order": 9, "role": "body", "text": "Young led Atlanta with 31 points but made 2 of 7 shots from the field in the fourth."}
{"game_id": "0022100384", "chunk_id": "0022100384_010", "order": 10, "role": "body", "text": "“We both played good defense,” Young said. “They played better defense in the fourth. I’ve got to do a better job of making shots in the fourth.”"}
{"game_id": "0022100384", "chunk_id": "0022100384_011", "order": 11, "role": "body", "text": "Harden had 20 points and 11 assists for Brooklyn, which is 2-0 against Atlanta this season."}
{"game_id": "0022100384", "chunk_id": "0022100384_012", "order": 12, "role": "body", "text": "The Nets, protecting their slim lead over Chicago for the best record in the Eastern Conference, improved to 8-0 following losses this season. Durant and LaMarcus Aldridge, who had 15 points, were rested in Wednesday night’s 114-104 loss at Houston."}
{"game_id": "0022100384", "chunk_id": "0022100384_013", "order": 13, "role": "body", "text": "John Collins had 20 points and Kevin Huerter added 19 for the Hawks."}
{"game_id": "0022100384", "chunk_id": "0022100384_014", "order": 14, "role": "body", "text": "There were three ties early in the final period, including at 95-all. Durant's jumper sparked an 8-0 run that gave the Nets a 103-95 lead. Harden had four points in the run."}
{"game_id": "0022100384", "chunk_id": "0022100384_015", "order": 15, "role": "body", "text": "Atlanta answered with seven straight points, including a 3-pointer and another basket by Young, to pull to within 103-102. The Hawks couldn't complete the comeback."}
{"game_id": "0022100384", "chunk_id": "0022100384_016", "order": 16, "role": "body", "text": "The Hawks led 73-62 early in the third period."}
{"game_id": "0022100384", "chunk_id": "0022100384_017", "order": 17, "role": "body", "text": "Thomas, coming off a season-high 18 points against Houston, had three 3s in the period, including one that tied it at 86-all."}
{"game_id": "0022100384", "chunk_id": "0022100384_018", "order": 18, "role": "body", "text": "Thomas added another 3 to give Brooklyn its first lead of the half, 89-88. Danilo Gallinari answered with a 3 to give Atlanta the lead entering the final period."}
{"game_id": "0022100384", "chunk_id": "0022100384_020", "order": 20, "role": "body", "text": "Nets: Nash acknowledged he worries about the toll of excessive minutes logged by the 32-year-old Harden. He played 41 minutes, his fifth game in the last six logging at least 39. ... Aldridge set a season high with three blocked shots. Durant also had three blocks."}
{"game_id": "0022100384", "chunk_id": "0022100384_021", "order": 21, "role": "body", "text": "Hawks: Clint Capela posted his 16th double-double of the season with 14 points and 16 rebounds. ... Huerter opened the game by making two 3-pointers. The Hawks didn't make another 3 in the period but they closed the half with another 3 from Huerter. He made 5 of 7 3s."}
{"game_id": "0022100384", "chunk_id": "0022100384_023", "order": 23, "role": "body", "text": "Hawks forward Cam Reddish scored four points in his return after missing four games with a sprained left wrist. Timothe Luwawu-Cabarrot remained in the starting lineup, but did not score."}
{"game_id": "0022100384", "chunk_id": "0022100384_024", "order": 24, "role": "body", "text": "Reddish scored all his points on free throws. He was 0 for 6 from the field."}
{"game_id": "0022100384", "chunk_id": "0022100384_025", "order": 25, "role": "body", "text": "“He didn’t get his shot to fall tonight, but he’ll get back into it,” Young said. “When he’s in a groove, it’s a lot better for our team.”"}
{"game_id": "0022100384", "chunk_id": "0022100384_026", "order": 26, "role": "body", "text": "Reddish adds important depth on the wing. The issue became more critical with Wednesday’s announcement that Solomon Hill is expected to miss the remainder of the season with a torn right hamstring tendon."}
{"game_id": "0022100384", "chunk_id": "0022100384_027", "order": 27, "role": "body", "text": "Atlanta also is without De’Andre Hunter, who is recovering from surgery on his right wrist, and Bogdan Bogdanovic, who missed his fifth consecutive game due to a sprained right ankle."}
{"game_id": "0022100384", "chunk_id": "0022100384_029", "order": 29, "role": "body", "text": "One game after setting a franchise record by making 25 3-pointers in a 121-110 win at Minnesota on Monday, the Hawks made 11 of 34 3s. Entering the game, Atlanta led the NBA in 3-point shooting, making 38.6%, while Brooklyn led the league in 3-point defense, allowing 30.5%."}
{"game_id": "0022100384", "chunk_id": "0022100384_031", "order": 31, "role": "body", "text": "Durant and Young each drew technical fouls for a brief skirmish in the final period. The two were separated and downplayed the incident after the game."}
{"game_id": "0022100384", "chunk_id": "0022100384_032", "order": 32, "role": "body", "text": "“He wanted me to get out of his space and I understand that,” Durant said."}
{"game_id": "0022100384", "chunk_id": "0022100384_034", "order": 34, "role": "body", "text": "Nets: Wrap up a four-game trip at Detroit on Sunday night."}
{"game_id": "0022100384", "chunk_id": "0022100384_035", "order": 35, "role": "body", "text": "Hawks: Play Houston on Monday night."}
