{"game_id": "0022100964", "chunk_id": "0022100964_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Kevin Porter Jr. scored 29 points, Christian Wood added 28 points and 13 rebounds and the Houston Rockets beat the Memphis Grizzlies 123-112 on Sunday night to end a 12-game losing streak."}
{"game_id": "0022100964", "chunk_id": "0022100964_002", "order": 2, "role": "body", "text": "Porter scored 19 of his 22 second-half points in the third quarter to help Houston overcome a 10-point halftime deficit. Wood has scored at least 20 points in three games."}
{"game_id": "0022100964", "chunk_id": "0022100964_003", "order": 3, "role": "body", "text": "“I honestly would say this is the best that we have all played altogether,” Wood said. “It’s really good to see when we are all clicking like that. It’s a really scary sight, so we just have try to harp on that, try to build on that, try to see if we can repeat that same effort, that same energy.”"}
{"game_id": "0022100964", "chunk_id": "0022100964_004", "order": 4, "role": "body", "text": "Jalen Green added 24 points and eight rebounds, and Eric Gordon had 12 points in the Rockets’ first victory since beating Cleveland on Feb. 2."}
{"game_id": "0022100964", "chunk_id": "0022100964_005", "order": 5, "role": "body", "text": "“Grit, desperation a little bit, togetherness and just a collective will to win,” Houston coach Stephen Silas said. “We were tired of losing, and it showed in our performance, not just at the end of the game. … We came out in the second half and played so good. Christian Wood, this was the best game I’ve seen him play.”"}
{"game_id": "0022100964", "chunk_id": "0022100964_006", "order": 6, "role": "body", "text": "Desmond Bane scored 28 points, and Ja Morant added 22 points and six assists for Memphis, coming off a home victory Saturday night over Orlando. Steven Adams had season-high 23 points and finished with 12 rebounds."}
{"game_id": "0022100964", "chunk_id": "0022100964_007", "order": 7, "role": "body", "text": "“They played great. We played terrible,” Memphis coach Taylor Jenkins said. “They played great the entire the game. Wood in the first half. Porter, Green they brought it tonight. … We didn’t play well individually. We didn’t play well as a team. They kicked our butts.”"}
{"game_id": "0022100964", "chunk_id": "0022100964_008", "order": 8, "role": "body", "text": "After Brandon Clarke cut Houston’s lead to 108-107 with a layup with 5 1/2 minutes remaining, the Rockets responded with a 10-1 run to open up a 10-point lead on a layup by Porter with 2:42 left."}
{"game_id": "0022100964", "chunk_id": "0022100964_009", "order": 9, "role": "body", "text": "Trailing 82-75 with four minutes left in the third, Houston scored 11 straight to take an 86-82 lead with 1:48 remaining in the quarter. But Bane scored eight and the teams were tied at 92 after three."}
{"game_id": "0022100964", "chunk_id": "0022100964_010", "order": 10, "role": "body", "text": "The Rockets shot 52% and made 13 of 35 on 3-pointers. Houston outrebounded the Grizzlies 45-40 and had a 22-13 advantage in second chance points. The Grizzlies were 5 of 26 on 3-pointers."}
{"game_id": "0022100964", "chunk_id": "0022100964_011", "order": 11, "role": "body", "text": "“We gave them too much life in the game,” Jenkins said. “We could have been up 20 if you ask me. We didn’t come out with the urgency we needed to. That 10-point (halftime) lead wasn’t even a 10-point lead if you ask me. They came back with a storm, had it tied, but it felt like we played down the entire night. We didn’t have it tonight.”"}
{"game_id": "0022100964", "chunk_id": "0022100964_013", "order": 13, "role": "body", "text": "Grizzlies: Memphis made 19 of 27 free throws. … The Grizzlies turned 17 Houston turnovers into 24 points. … Memphis held a 72-56 advantage in points in the paint and had 17 fast break points."}
{"game_id": "0022100964", "chunk_id": "0022100964_014", "order": 14, "role": "body", "text": "Rockets: G Dennis Schroder missed his third straight game with a right ankle sprain. Silas said Schroder was day-to-day, and could possibly return on Monday, but if not, probably on Wednesday. … Houston had a season-high 40 points in the third quarter."}
{"game_id": "0022100964", "chunk_id": "0022100964_016", "order": 16, "role": "body", "text": "“Those games where there’s individual improvement for a couple guys and then the rest of the guys are mad, aren’t great. But when everybody contributes to a win and feels good leaving the locker room with whatever they did, it’s important for morale, it’s important for us moving forward and it’s important for the organization as a whole.” – Silas on the Rockets’ winning as a team."}
{"game_id": "0022100964", "chunk_id": "0022100964_018", "order": 18, "role": "body", "text": "Grizzlies: Host New Orleans on Tuesday night."}
{"game_id": "0022100964", "chunk_id": "0022100964_019", "order": 19, "role": "closing", "text": "Rockets: At Miami on Monday night."}
