{"game_id": "0022100945", "chunk_id": "0022100945_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Reggie Jackson scored 12 of his season-high 36 points in the fourth quarter while adding nine assists and eight rebounds, and the Los Angeles Clippers completed a four-game season sweep of the Los Angeles Lakers with a 132-111 victory Thursday night."}
{"game_id": "0022100945", "chunk_id": "0022100945_002", "order": 2, "role": "body", "text": "Ivica Zubac had 19 points and nine rebounds for the Clippers, who seized control of the sweep-clinching victory and their seventh straight win over the Lakers overall by scoring 23 consecutive points during the first six minutes of the third quarter."}
{"game_id": "0022100945", "chunk_id": "0022100945_003", "order": 3, "role": "body", "text": "The Clippers outscored their cross-hallway rivals 37-10 late into the third before coasting to their fifth consecutive victory in the past eight days, including two over the Lakers."}
{"game_id": "0022100945", "chunk_id": "0022100945_004", "order": 4, "role": "body", "text": "The victory was the latest in a torrid stretch for the Clippers, who have won seven of their last eight without likely their three most talented players: Kawhi Leonard, Paul George and Norman Powell."}
{"game_id": "0022100945", "chunk_id": "0022100945_005", "order": 5, "role": "body", "text": "Although none of the trio is thought to be close to returning, Jackson and a gritty supporting cast have kept the Clips on track for another playoff berth with an increasing chance to avoid the play-in tournament after this victory, which pulled them within one game of seventh-place Minnesota."}
{"game_id": "0022100945", "chunk_id": "0022100945_006", "order": 6, "role": "body", "text": "“We came out on a mission,” Jackson said. “We wanted to close out. We’re still a hungry team. ... We feel like we’re writing our own story. We know what the narrative is with our guys out. We’re trying to do something special with this group. It’s about this team, to write our own story.”"}
{"game_id": "0022100945", "chunk_id": "0022100945_007", "order": 7, "role": "body", "text": "Jackson hit four 3-pointers and embarrassed a succession of Lakers defenders, particularly in a fourth-quarter display that had the Clippers' portion of the crowd chanting his name. After Jackson and former teammate Russell Westbrook clashed and exchanged words, Jackson responded by drilling a 3-pointer over Westbrook's defense to earn one of several standing ovations."}
{"game_id": "0022100945", "chunk_id": "0022100945_008", "order": 8, "role": "body", "text": "“He loves it,” Clippers coach Tyronn Lue said. “He loves the moment. He’s a big-time player. Sometimes we go back and forth, but he’s held us together all year. ... It was a struggle when we first lost PG, because the offense is built around PG and Kawhi for the most part. But once we got a set rotation and understood how we had to play, these guys have bought into it, and it starts with our veterans. That’s the kind of team and the kind of culture we’ve built around here.\""}
{"game_id": "0022100945", "chunk_id": "0022100945_009", "order": 9, "role": "body", "text": "LeBron James had 26 points and eight rebounds for the Lakers, who have lost four straight and seven of eight to fall a season-worst eight games below .500 (27-35). A proud franchise that began the season with championship aspirations is now two games ahead of 11th-place Portland with little reason to think its spiral will end soon."}
{"game_id": "0022100945", "chunk_id": "0022100945_010", "order": 10, "role": "body", "text": "“We’ve had one quarter that’s killed us,” James said. “It’s been the second quarter. Today it was the third quarter.”"}
{"game_id": "0022100945", "chunk_id": "0022100945_011", "order": 11, "role": "body", "text": "After scoring 14 consecutive points to close the first half with only a three-point deficit, the Lakers curiously became discombobulated early in the third after the referees didn't give a continuation foul to James and they were unable to challenge the call."}
{"game_id": "0022100945", "chunk_id": "0022100945_012", "order": 12, "role": "body", "text": "“We’re just persistent and staying with the work,” Lakers coach Frank Vogel said. “We’ll leave no stone unturned to get this right, but it hasn’t come together for us. We’ll continue to try to find ways to win with Anthony (Davis) out. It’s not something we can’t do, but we haven’t found it yet.”"}
{"game_id": "0022100945", "chunk_id": "0022100945_014", "order": 14, "role": "body", "text": "Lakers: Talen Horton-Tucker sat out after spraining his ankle Tuesday. He was listed as probable before the game. ... The Lakers used their 31st starting lineup of the season with Dwight Howard moving in alongside rookie Austin Reaves and Malik Monk. ... Wenyen Gabriel hit a late 3-pointer in his Lakers debut. Los Angeles signed him Tuesday."}
{"game_id": "0022100945", "chunk_id": "0022100945_015", "order": 15, "role": "body", "text": "Clippers: Nicolas Batum appeared in his 900th career NBA game. ... Lue had no updates on the injury recoveries of George, Leonard and Powell: “I don't know. Sorry.” ... Justin Bieber, Rami Malek, Saweetie and UFC middleweight champion Israel Adesanya attended the game."}
{"game_id": "0022100945", "chunk_id": "0022100945_017", "order": 17, "role": "body", "text": "D.J. Augustin had three points and six assists in his debut with the Lakers, who signed the 14-year NBA veteran Tuesday to bolster their backcourt depth. The Lakers are Augustin's 11th NBA franchise; Houston waived him Feb. 11."}
{"game_id": "0022100945", "chunk_id": "0022100945_019", "order": 19, "role": "body", "text": "Lakers: Host Warriors on Saturday."}
{"game_id": "0022100945", "chunk_id": "0022100945_020", "order": 20, "role": "body", "text": "Clippers: Host Knicks on Sunday."}
