{"game_id": "0022100171", "chunk_id": "0022100171_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Kyle Lowry's mom was in the house, repping the Raptors in a sweatshirt even though her son has moved on to Miami. But the competitive sprit Lowry left behind in turning Toronto into a champion has rubbed off on this year's team."}
{"game_id": "0022100171", "chunk_id": "0022100171_002", "order": 2, "role": "body", "text": "Gary Trent Jr. and Fred VanVleet hit back-to-back 3-pointers over the final 1:10 to lift the Raptors past the undermanned Philadelphia 76ers, 115-109 on Thursday night."}
{"game_id": "0022100171", "chunk_id": "0022100171_003", "order": 3, "role": "body", "text": "VanVleet hit six 3s and scored 32 points, and Trent added 20. The Raptors lost to Boston on the front end of a back-to-back but the late 3s rallied them to a needed road victory."}
{"game_id": "0022100171", "chunk_id": "0022100171_004", "order": 4, "role": "body", "text": "The Raptors played hard until the end, a trait that can work wonders for a team trying to surprise this season."}
{"game_id": "0022100171", "chunk_id": "0022100171_005", "order": 5, "role": "body", "text": "“It’s been in the culture with the Raptors for a while,\" coach Nick Nurse said. \"We just believe in it, talk about it, drill it. We hold guys accountable. I think the biggest metric is your heart and your toughness and your desire to want to do it. Fortunately, our guys most nights will do that.”"}
{"game_id": "0022100171", "chunk_id": "0022100171_006", "order": 6, "role": "body", "text": "Joel Embiid, Isaiah Joe, and Matisse Thybulle are still in the NBA’s health and safety protocols and sat out again. Seth Curry did return from a foot injury and Tobias Harris scored 19 points in his return from a six-game absence after testing positive for COVID-19."}
{"game_id": "0022100171", "chunk_id": "0022100171_007", "order": 7, "role": "body", "text": "“We just need bodies. He’s a warm body. The fact that he’s one of our better players helps,” coach Doc Rivers said."}
{"game_id": "0022100171", "chunk_id": "0022100171_008", "order": 8, "role": "body", "text": "The Sixers need more reinforcements and have lost three straight games. Tyrese Maxey did score 33 points for the Sixers."}
{"game_id": "0022100171", "chunk_id": "0022100171_009", "order": 9, "role": "body", "text": "Andre Drummond had put the Sixers ahead 109-107 with 1:44 left and then followed with a blocked shot on the next possession that sent the crowd into a frenzy."}
{"game_id": "0022100171", "chunk_id": "0022100171_010", "order": 10, "role": "body", "text": "Trent, though, hit the 3 with 1:10 left that put the Raptors ahead."}
{"game_id": "0022100171", "chunk_id": "0022100171_011", "order": 11, "role": "body", "text": "The Raptors led most of the fourth quarter until the Sixers went on a late run. Shake Milton hit a 3 and his baseline drive cut it to 92-89 before Harris scored to bring the Sixers within one. VanVleet and Svi Mykhailiuk, though, each buried 3-pointers that stretched the lead and OG Anunoby dunked off a turnover."}
{"game_id": "0022100171", "chunk_id": "0022100171_012", "order": 12, "role": "body", "text": "Anunoby then hit a 3, one of 14 for the Raptors."}
{"game_id": "0022100171", "chunk_id": "0022100171_013", "order": 13, "role": "body", "text": "“He's always been a great all-around talent,” Trent said. “This year, I've seen him lead in certain situation situations, find certain guys. He's just being that ultimate team player, that ultimate winner.”"}
{"game_id": "0022100171", "chunk_id": "0022100171_015", "order": 15, "role": "body", "text": "Raptors: Anunoby also scored 20 points. ... Trailed 57-52 at halftime."}
{"game_id": "0022100171", "chunk_id": "0022100171_016", "order": 16, "role": "body", "text": "76ers: Ben Simmons attended Thursday’s film session, though there are still no immediate plans for the guard to return to play. “He’s been around more. He’s doing all the things that I know of that he’s supposed to do,” Rivers said. Rivers continues to deflect questions about Simmons, who officially is out with back and mental health issues. Rivers said Simmons’ status is “the last thing on my mind right now.” Simmons’ agent Rich Paul told The Athletic: “This is no longer about a trade. This is about finding a place where we can help Ben get back to his mental strength and get back on the floor. I want him on the floor playing the game that he loves. I want Ben on the floor. Whether that’s in a 76ers uniform or any other uniform, that’s not up to me, but I want him in a state where he can resume play.” Simmons, a three-time All-Star, requested a trade in the offseason and has a frosty relationship with the Sixers."}
{"game_id": "0022100171", "chunk_id": "0022100171_018", "order": 18, "role": "body", "text": "The yearly open tryout held by the NBA G League teams actually yielded a player this season for the Delaware Blue Coats. Brian Cameron, a standout shooter at Division III Wesley College, went from Delaware native to deep reserve on the bench."}
{"game_id": "0022100171", "chunk_id": "0022100171_019", "order": 19, "role": "body", "text": "He was inactive for the opener but was expected to make the roster at Maine."}
{"game_id": "0022100171", "chunk_id": "0022100171_020", "order": 20, "role": "body", "text": "Not bad for a guard who pretty much sat out a year because of the pandemic. He impressed in the open workout that included former DI players and was invited to training camp. He signed a one-year deal with the Blue Coats."}
{"game_id": "0022100171", "chunk_id": "0022100171_021", "order": 21, "role": "body", "text": "“I’m hoping I can find my way in eventually,” he said. “Nothing’s given. Everything’s earned. That’s how I’ve been my whole life coming from small schools here and there. I didn’t have the top recruits with me, or anything. I just have to prove what I can bring with the team.”"}
{"game_id": "0022100171", "chunk_id": "0022100171_022", "order": 22, "role": "body", "text": "Blue Coats general manager Prosper Karangwa said Cameron’s shooting — he shot at least 45% from 3 his first three college seasons — made him attractive to the team."}
{"game_id": "0022100171", "chunk_id": "0022100171_023", "order": 23, "role": "body", "text": "“I don’t think there’s been a day where Brian hasn’t looked like he didn’t belong,” Karangwa said. “Hopefully there comes an opportunity for him to get some minutes at some point.”"}
{"game_id": "0022100171", "chunk_id": "0022100171_025", "order": 25, "role": "body", "text": "Raptors: Return home Saturday to play Detroit."}
{"game_id": "0022100171", "chunk_id": "0022100171_026", "order": 26, "role": "body", "text": "76ers: Open a six-game road trip Saturday in Indiana."}
