{"game_id": "0022100226", "chunk_id": "0022100226_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Ja Morant scored 17 of his 28-points in a third-quarter rally in the Memphis Grizzlies’ 120-108 victory over the Los Angeles Clippers on Thursday night."}
{"game_id": "0022100226", "chunk_id": "0022100226_002", "order": 2, "role": "body", "text": "Dillon Brooks and Jaren Jackson Jr. added 18 points each, and Desmond Bane had 16. Brandon Clarke finished with 14 points, 10 of them in the fourth quarter."}
{"game_id": "0022100226", "chunk_id": "0022100226_003", "order": 3, "role": "body", "text": "Paul George led the Clippers with 23 points and six assists. Reggie Jackson had 18 points, hitting 4 of 8 3-point attempts. Luke Kennard added 15 points for Los Angeles, going 6 of 8 overall and 3 of 4 from 3-point range."}
{"game_id": "0022100226", "chunk_id": "0022100226_004", "order": 4, "role": "body", "text": "“We were just active on defense. When they had their runs, we slacked off,” Brooks said. “We just got steals. Ran down and made plays for each other. When we are making plays for each other, you see what the end result is. We’re all happy and getting ready for the next game.”"}
{"game_id": "0022100226", "chunk_id": "0022100226_005", "order": 5, "role": "body", "text": "Memphis held the lead through most of the game, but Morant provided an offensive burst in the third quarter. The Grizzlies stretched the advantage to 20 when Clark converted four consecutive inside baskets early in the fourth."}
{"game_id": "0022100226", "chunk_id": "0022100226_006", "order": 6, "role": "body", "text": "“I feel like it is tougher for a defense to guard me,” said Morant who worked in the offseason on his 3-point shooting. “I can knock down the 3, knock down the midrange pull up, get to my floater or get all the way to the rack.”"}
{"game_id": "0022100226", "chunk_id": "0022100226_007", "order": 7, "role": "body", "text": "Memphis shot 54% in the game and made 11 of 26 from outside the arc against a Clippers defense that is among the best in the league."}
{"game_id": "0022100226", "chunk_id": "0022100226_008", "order": 8, "role": "body", "text": "“We had a tough time just guarding the ball at the point of attack,” Clippers coach Tyronn Lue said. “We just didn’t do a good job of controlling the basketball. They got deep in the paint.”"}
{"game_id": "0022100226", "chunk_id": "0022100226_009", "order": 9, "role": "body", "text": "In the first half, Memphis would pull away only to have the Clippers fight their way back, coming close to erasing the Grizzlies’ advantage. That trend continued until the break, Memphis holding a 56-53 advantage."}
{"game_id": "0022100226", "chunk_id": "0022100226_010", "order": 10, "role": "body", "text": "The game stayed close through much of the third. George and Jackson began converting 3-point shots. But Morant took over the Memphis offense. The guard wiggled his way into the paint and added a 3-pointer. His 17 points went with four assists in the frame as Memphis connected on 13 of 18 shots for a 94-85 lead entering the fourth."}
{"game_id": "0022100226", "chunk_id": "0022100226_011", "order": 11, "role": "body", "text": "“We did a better job of taking care of the basketball,” Lue said. “We just didn’t do a good job of making quick decisions offensively. Not able to make the quick decisions right now so we’ve got to continue to keep getting better with that as well.”"}
{"game_id": "0022100226", "chunk_id": "0022100226_013", "order": 13, "role": "body", "text": "Clippers: Nicolas Batum sat out the game with right Achilles soreness. Amir Coffey started in his place. … Terance Mann, who was listed on the injury report before the game with a left ankle sprain, played and scored 5 points. … George reached 4,000 career defensive rebounds and Ivica Zubac grabbed his 1,200th career defensive rebound."}
{"game_id": "0022100226", "chunk_id": "0022100226_014", "order": 14, "role": "body", "text": "Grizzlies: DeAnthony Melton handed out his 500th career assist in the second quarter. … Morant was 13 of 21 from the field. … Jackson had four blocks and was 3 of 7 from 3-point range. He has eight games with multiple 3s and multiple blocks."}
{"game_id": "0022100226", "chunk_id": "0022100226_016", "order": 16, "role": "body", "text": "The Grizzlies outscored the Clippers in the paint 74-36. The 74 paint points was a season high for Memphis, which leads the league with an average of 53.3. Morant had 20 points in the paint."}
{"game_id": "0022100226", "chunk_id": "0022100226_018", "order": 18, "role": "body", "text": "Brooks has a growing reputation as one of the toughest, most annoying defenders in the league. And he wasn’t happy about some calls that went against him. “These refs are trying to blackball me. Just giving me (technicals). I don’t appreciate it. I just play hard. I talk my stuff. But, you know, I know when to cool it down, and the refs have got to see that. They can’t just blackball me.”"}
{"game_id": "0022100226", "chunk_id": "0022100226_020", "order": 20, "role": "body", "text": "Clippers: At New Orleans on Friday night."}
{"game_id": "0022100226", "chunk_id": "0022100226_021", "order": 21, "role": "body", "text": "Grizzlies: At Minnesota on Saturday night."}
