{"game_id": "0022100949", "chunk_id": "0022100949_001", "order": 1, "role": "lead", "text": "CHICAGO -- — Jrue Holiday hit enough big shots down the stretch while keeping DeMar DeRozan in check to help the Milwaukee Bucks squeeze out another tight win. And once again, they did it against a top Eastern Conference team."}
{"game_id": "0022100949", "chunk_id": "0022100949_002", "order": 2, "role": "body", "text": "Giannis Antetokounmpo had 34 points and 16 rebounds, Holiday came on strong down the stretch to finish with 26 points and Milwaukee beat the Chicago Bulls 118-112 on Friday night."}
{"game_id": "0022100949", "chunk_id": "0022100949_003", "order": 3, "role": "body", "text": "The Bucks went from leading by 14 in the second quarter to trailing by seven through three. Holiday went off in the fourth, scoring 16 to help the defending NBA champions pull out another tight win."}
{"game_id": "0022100949", "chunk_id": "0022100949_004", "order": 4, "role": "body", "text": "“It's just a feeling and you know you've got to turn it on,” Holiday said. “It's time for us to lock in. It's time for us to just concentrate, be aggressive and make good plays, smart plays, down the stretch.”"}
{"game_id": "0022100949", "chunk_id": "0022100949_005", "order": 5, "role": "body", "text": "After rallying late from 14 down to beat Miami by one on Wednesday, the Bucks tied Chicago for the Central Division lead with their third straight victory. The toughest stretch of their schedule continues with a home game against NBA-leading Phoenix on Sunday."}
{"game_id": "0022100949", "chunk_id": "0022100949_006", "order": 6, "role": "body", "text": "“We got to keep it up,\" Antetokounmpo said. \"If good things are going on, you got to keep waking up the next day and keep learning something new, keep evolving, keep improving.”"}
{"game_id": "0022100949", "chunk_id": "0022100949_007", "order": 7, "role": "body", "text": "Antetokounmpo made 12 of 22 shots and had five assists, helping make up for a 10-for-19 showing at the foul line. Khris Middleton scored 22 points as the Bucks beat Chicago for the 14th time in 15 games."}
{"game_id": "0022100949", "chunk_id": "0022100949_008", "order": 8, "role": "body", "text": "Zach LaVine led Chicago with 30 points. DeRozan scored 29 points, though he was 11 for 30 from the field."}
{"game_id": "0022100949", "chunk_id": "0022100949_009", "order": 9, "role": "body", "text": "Nikola Vucevic added 19 points and nine rebounds, but the Bulls lost their fourth straight game."}
{"game_id": "0022100949", "chunk_id": "0022100949_010", "order": 10, "role": "body", "text": "“I felt like we competed,” DeRozan said. “It came down to the last couple minutes. ... They're defending champs for a reason.”"}
{"game_id": "0022100949", "chunk_id": "0022100949_012", "order": 12, "role": "body", "text": "Chicago led 102-100 after Javonte Green nailed a 3 with six minutes remaining. Milwaukee then scored six straight, with Middleton's turnaround jumper making it a four-point game with just over four minutes left, and maintained the lead the rest of the way."}
{"game_id": "0022100949", "chunk_id": "0022100949_013", "order": 13, "role": "body", "text": "LaVine cut it to 112-109 when he drove for a layup with 47 seconds remaining. Antetokounmpo made two free throws before LaVine buried a 3 to pull Chicago within 114-112 with 24.4 seconds left."}
{"game_id": "0022100949", "chunk_id": "0022100949_014", "order": 14, "role": "body", "text": "A reverse layup by Jevon Carter bumped Milwaukee's lead to four. The Bucks then won a challenge after Middleton got called for a foul as LaVine attempted a 3. Milwaukee controlled the jump ball, and Holiday made two free throws with 12.5 seconds left."}
{"game_id": "0022100949", "chunk_id": "0022100949_016", "order": 16, "role": "body", "text": "Bucks guard Grayson Allen got booed during introductions and throughout the game for a hard foul that resulted in a broken wrist for Alex Caruso when the teams met Jan. 21 in Milwaukee. Caruso has not played since that game, leaving Chicago without one of its best defenders."}
{"game_id": "0022100949", "chunk_id": "0022100949_017", "order": 17, "role": "body", "text": "The crowd was delighted when Derrick Jones Jr. knocked Allen to the floor as he drove the baseline early in the fourth quarter. Jones got called for a flagrant foul. And Allen made both free throws."}
{"game_id": "0022100949", "chunk_id": "0022100949_018", "order": 18, "role": "body", "text": "Jones insisted he's “not a dirty player” and didn't think he committed a flagrant foul."}
{"game_id": "0022100949", "chunk_id": "0022100949_019", "order": 19, "role": "body", "text": "“What happened in Milwaukee, we didn’t like it,” he said. \"It's obvious we didn't like it. Nobody like that. But I’m not going to go out there and just try to take a man out. That's not who I am.”"}
{"game_id": "0022100949", "chunk_id": "0022100949_021", "order": 21, "role": "body", "text": "Bucks: C Brook Lopez is ready to participate in contact drills and five-on-five scrimmages after being sidelined since the season opener because of a back injury that required surgery. “It's another good, positive step for him on his return to play,” coach Mike Budenholzer said. ... Budenholzer said the Bucks hope to get G George Hill (sore neck) back in the next week. He has been sidelined since Jan. 28. ... G Pat Connaughton “still has a ways to go\" in his recovery from surgery on his right finger, Budenholzer said. Connaughton was hurt fouling Chris Paul on a drive to the basket in a 131-107 loss at Phoenix on Feb. 10. Connaughton was expected to miss four weeks."}
{"game_id": "0022100949", "chunk_id": "0022100949_022", "order": 22, "role": "body", "text": "Bulls: The Bulls are a combined 0-8 against East-leading Miami, second-place Philadelphia and Milwaukee. ... Chicago didn’t attempt a free throw until DeRozan completed a four-point play in the closing minute of the first half. The Bulls made 8 of 11. ... LaVine, who missed time recently because of soreness in his surgically repaired left knee, was not listed on the injury report. “He feels fine,” coach Billy Donovan said. “I think if there were any problems, he would talk.”"}
{"game_id": "0022100949", "chunk_id": "0022100949_024", "order": 24, "role": "body", "text": "Bucks: Host Phoenix on Sunday."}
{"game_id": "0022100949", "chunk_id": "0022100949_025", "order": 25, "role": "body", "text": "Bulls: At Philadelphia on Monday night."}
