{"game_id": "0022100914", "chunk_id": "0022100914_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Indiana Pacers coach Rick Carlisle knew his team needed to work hard for quality shots."}
{"game_id": "0022100914", "chunk_id": "0022100914_002", "order": 2, "role": "body", "text": "Oshae Brissett and Buddy Hield made sure they did."}
{"game_id": "0022100914", "chunk_id": "0022100914_003", "order": 3, "role": "body", "text": "Brissett scored 27 points on a career-high six 3-pointers and Hield finished with 11 of his 21 points during the final eight minutes to help the Indiana Pacers beat the Boston Celtics 128-107 on Sunday."}
{"game_id": "0022100914", "chunk_id": "0022100914_004", "order": 4, "role": "body", "text": "“It was important for us to play with pace and play randomly and play with an unselfish spirit to get shots,” Carlisle said. “So letting our guys play was a really important thing for our guys tonight.”"}
{"game_id": "0022100914", "chunk_id": "0022100914_005", "order": 5, "role": "body", "text": "The Pacers delivered their best performance since reshaping the roster with three trade-week deals."}
{"game_id": "0022100914", "chunk_id": "0022100914_006", "order": 6, "role": "body", "text": "They decimated one of the league’s top defenses by making 17 3s, just two short of their season high, to earn their second win in 10 games and their second win over an Eastern Conference foe since Dec. 17."}
{"game_id": "0022100914", "chunk_id": "0022100914_007", "order": 7, "role": "body", "text": "Tyrese Haliburton had 22 points and nine assists for Indiana."}
{"game_id": "0022100914", "chunk_id": "0022100914_008", "order": 8, "role": "body", "text": "Jayson Tatum finished with 24 points and Jaylen Brown scored 23 as the Celtics' seven-game road winning streak ended. Boston had won five straight in the series and three in a row at Indiana."}
{"game_id": "0022100914", "chunk_id": "0022100914_009", "order": 9, "role": "body", "text": "But on Sunday, the Celtics couldn't slow down the Pacers' long-range shooters."}
{"game_id": "0022100914", "chunk_id": "0022100914_010", "order": 10, "role": "body", "text": "“We didn't come out as physical as we wanted to and it allowed them to get in a rhythm and it kind of snowballed on us,\" Boston coach Ime Udoka said. “Those guys were walking into 3s and a guy like Brissett started making some but they've got good 3-point shooters.\""}
{"game_id": "0022100914", "chunk_id": "0022100914_011", "order": 11, "role": "body", "text": "Three of them — Brissett, Chris Duarte and Hield — combined for five straight 3s late in the first half, and when Hield capped the 15-5 run, Indiana led 59-46. Boston never completely recovered."}
{"game_id": "0022100914", "chunk_id": "0022100914_012", "order": 12, "role": "body", "text": "Indiana led 66-55 at the half and, after extending the lead to 19 early in the third, fended off a charge that got Boston within 83-76 with 3:46 left in the quarter. Indiana then rebuilt a 93-82 lead."}
{"game_id": "0022100914", "chunk_id": "0022100914_013", "order": 13, "role": "body", "text": "When the Celtics closed within 99-92 early in fourth, Hield scored five straight and Indiana closed it out from there."}
{"game_id": "0022100914", "chunk_id": "0022100914_014", "order": 14, "role": "body", "text": "“We got to it them and they were flying around and everyone kind of flowed to it,\" Haliburton said when asked about Brissett and Hield. “And that kind of set the tone.”"}
{"game_id": "0022100914", "chunk_id": "0022100914_016", "order": 16, "role": "body", "text": "Celtics: Tatum became the third player to score 1,500 points this season. ... Robert Williams had 10 points, 11 rebounds and four blocks while Marcus Smart had 13 points and seven assists. ... Payton Pritchard had 14 points off the bench. ... Brown also had eight assists. ... Boston played without center Al Horford."}
{"game_id": "0022100914", "chunk_id": "0022100914_017", "order": 17, "role": "body", "text": "Pacers: Indiana was 12 of 20 from 3-point range in the first half and finished 17 of 33. ... Malcolm Brogdon had 20 points and five assists. ... Jalen Smith finished with 12 points and 10 rebounds. ... Isaiah Jackson had 11 points and three blocks while Chris Duarte added 11 points."}
{"game_id": "0022100914", "chunk_id": "0022100914_019", "order": 19, "role": "body", "text": "Carlisle offered condolences to the family of former Pacers coach Dick Versace. Bradley University, where Versace won three Missouri Valley Conference coach of the year awards, announced Saturday that the longtime coach had died. He was 81."}
{"game_id": "0022100914", "chunk_id": "0022100914_020", "order": 20, "role": "body", "text": "“I didn't know him well, but I knew of his love for the game,” Carlisle said."}
{"game_id": "0022100914", "chunk_id": "0022100914_021", "order": 21, "role": "body", "text": "Carlisle also said the league's coaches are working with the Houston Rockets organization to hold a celebration-of-life ceremony for Bill Fitch, who died earlier this year."}
{"game_id": "0022100914", "chunk_id": "0022100914_023", "order": 23, "role": "body", "text": "“As professionals you don’t know what’s coming toward you every game or every other play, so you’ve got to adjust and we didn’t,\" Williams said. “They came here to play, honestly.\""}
{"game_id": "0022100914", "chunk_id": "0022100914_025", "order": 25, "role": "body", "text": "Celtics: Host Atlanta on Tuesday."}
{"game_id": "0022100914", "chunk_id": "0022100914_026", "order": 26, "role": "body", "text": "Pacers: Play the first of two straight games at Orlando on Monday."}
