{"game_id": "0022100406", "chunk_id": "0022100406_001", "order": 1, "role": "lead", "text": "TORONTO -- — Chris Boucher matched his season high with 17 points, Yuta Watanabe had 12 points and 10 rebounds for his first career double-double, and the Toronto Raptors used a 70-point first half to rout the Sacramento Kings 124-101 on Monday night."}
{"game_id": "0022100406", "chunk_id": "0022100406_002", "order": 2, "role": "body", "text": "Pascal Siakam and Scottie Barnes each scored 16 points, Fred VanVleet had 12 and Gary Trent Jr. added 10 as Toronto made a season-best 53 field goals and set a season high with 28 assists."}
{"game_id": "0022100406", "chunk_id": "0022100406_003", "order": 3, "role": "body", "text": "Nine different Toronto players scored 10 or more points, including all five starters. The Raptors set season highs for bench points (51) and points in the paint (68)."}
{"game_id": "0022100406", "chunk_id": "0022100406_004", "order": 4, "role": "body", "text": "“I thought we came out with a professional approach, set the tone early, and we were just able to control it from there,” VanVleet said. “Everybody that stepped on the court tonight contributed in a major way.\""}
{"game_id": "0022100406", "chunk_id": "0022100406_005", "order": 5, "role": "body", "text": "Malachi Flynn scored 14 points, Svi Mykhailiuk had 11 and Justin Champagnie finished with 10 for the Raptors, who wrapped up a 4-3 homestand — their longest of the season."}
{"game_id": "0022100406", "chunk_id": "0022100406_006", "order": 6, "role": "body", "text": "“The big goal was to come out and set a tone defensively that we were there to play hard on that end and I think that was a huge key by the whole team, really,” Raptors coach Nick Nurse said. “The first group did a great job and when the subs started coming in, they kept it going.”"}
{"game_id": "0022100406", "chunk_id": "0022100406_007", "order": 7, "role": "body", "text": "De’Aaron Fox scored 29 points, Buddy Hield added 14 and Marvin Bagley III had 12 points and 11 rebounds for the Kings, who went 0-3 on an Eastern Conference road trip that also included losses at Charlotte and Cleveland."}
{"game_id": "0022100406", "chunk_id": "0022100406_008", "order": 8, "role": "body", "text": "“I have no idea what to say,” coach Alvin Gentry said. “It was embarrassing. That’s the only phrase I think you can use.”"}
{"game_id": "0022100406", "chunk_id": "0022100406_009", "order": 9, "role": "body", "text": "Gentry said his players held a closed-door meeting after the game, although Fox refused to comment on it and Harrison Barnes had little to say."}
{"game_id": "0022100406", "chunk_id": "0022100406_010", "order": 10, "role": "body", "text": "“We’re not playing together,” Barnes said. “That’s really what it boils down to. As a group, we discussed it. That’s really all I’m going to say on that at this point.”"}
{"game_id": "0022100406", "chunk_id": "0022100406_011", "order": 11, "role": "body", "text": "Toronto scored the first 11 points and led 30-22 after one quarter, getting nine points off six turnovers by the Kings."}
{"game_id": "0022100406", "chunk_id": "0022100406_012", "order": 12, "role": "body", "text": "The Raptors extended their lead by connecting on 18 of 27 field goal attempts in the second, one more than the Kings had in the entire first half. Toronto led 70-45 at halftime after its highest-scoring half of the season."}
{"game_id": "0022100406", "chunk_id": "0022100406_013", "order": 13, "role": "body", "text": "“Obviously, the second quarter was bad all around,” Fox said."}
{"game_id": "0022100406", "chunk_id": "0022100406_014", "order": 14, "role": "body", "text": "The Raptors scored 67 points in the second half of a Nov. 24 game at Memphis. Toronto made 47 field goals in that game, its previous season high."}
{"game_id": "0022100406", "chunk_id": "0022100406_015", "order": 15, "role": "body", "text": "With 40 points in the second, Toronto also matched its biggest quarter of the season Monday, equaling a 40-point second in a Dec. 5 home win over the Wizards."}
{"game_id": "0022100406", "chunk_id": "0022100406_016", "order": 16, "role": "body", "text": "The Raptors took a 93-69 lead into the fourth."}
{"game_id": "0022100406", "chunk_id": "0022100406_018", "order": 18, "role": "body", "text": "Toronto’s scheduled home game Thursday against Chicago was one of two Bulls games postponed Monday after 10 of the team’s players entered the NBA’s health and safety protocol. Nurse said he scheduled a practice and a shooting session instead."}
{"game_id": "0022100406", "chunk_id": "0022100406_019", "order": 19, "role": "body", "text": "“It’s starting to feel like it used to feel last year,” VanVleet said of the first COVID-19-related postponements of the season. “We’ve just got to be mindful of that.”"}
{"game_id": "0022100406", "chunk_id": "0022100406_021", "order": 21, "role": "body", "text": "In a statement issued by the Raptors, the TV broadcast team of play-by-play announcer Matt Devlin and color commentator Jack Armstrong said they may have been exposed to COVID-19 and would stay away from the team “for a period of time.”"}
{"game_id": "0022100406", "chunk_id": "0022100406_023", "order": 23, "role": "body", "text": "For the first time in 15 home games this season, the Raptors did not draw a capacity crowd of 19,800. Attendance was 19,463."}
{"game_id": "0022100406", "chunk_id": "0022100406_025", "order": 25, "role": "body", "text": "Kings: Missed their first six field goal attempts, and their first seven from 3-point range. … F Richaun Holmes (right eye) sat out for the third straight game."}
{"game_id": "0022100406", "chunk_id": "0022100406_026", "order": 26, "role": "body", "text": "Raptors: F OG Anunoby (left hip) and C Khem Birch (right knee) sat out for the 12th consecutive game and will miss Tuesday’s game at Brooklyn, Nurse said. There is no timetable for their return. … C Precious Achiuwa, who had missed the previous two games with a sore right shoulder, entered the league’s health and safety protocol Sunday. … Nurse said G Dalano Banton was sent home after halftime because he was feeling ill, adding that Banton is unlikely to travel with the team for Tuesday’s game at Brooklyn. A team spokesperson said Banton’s illness is not related to COVID-19."}
{"game_id": "0022100406", "chunk_id": "0022100406_028", "order": 28, "role": "body", "text": "Kings: Host the Washington Wizards on Wednesday."}
{"game_id": "0022100406", "chunk_id": "0022100406_029", "order": 29, "role": "body", "text": "Raptors: Visit the Brooklyn Nets on Tuesday."}
