{"game_id": "0022100747", "chunk_id": "0022100747_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Joel Embiid put his versatility on display and the 76ers on his back."}
{"game_id": "0022100747", "chunk_id": "0022100747_002", "order": 2, "role": "body", "text": "Embiid scored 36 points, Tyrese Maxey keyed a game-changing run in the fourth quarter and Philadelphia won its fourth in a row with a 103-101 victory over the Sacramento Kings on Saturday night."}
{"game_id": "0022100747", "chunk_id": "0022100747_003", "order": 3, "role": "body", "text": "Playing in his 21st straight contest, Embiid added 12 rebounds and six assists. He made 10 of 18 field goals, including 2 of 5 3-pointers, and 14 of 18 free throws."}
{"game_id": "0022100747", "chunk_id": "0022100747_004", "order": 4, "role": "body", "text": "“He’s part Shaq (O’Neal), part (Hakeem) Olajuwon, part whatever you want to say,” Kings interim coach Alvin Gentry said."}
{"game_id": "0022100747", "chunk_id": "0022100747_005", "order": 5, "role": "body", "text": "The Philadelphia star has been dominant over this stretch that has raised his MVP talk. Embiid, who this week was elected as a starter for the All-Star Game for the fifth straight season, finished as MVP runner-up last season, his chances weakened because of questions about his durability."}
{"game_id": "0022100747", "chunk_id": "0022100747_006", "order": 6, "role": "body", "text": "He is out to put those questions to rest this season, though he admitted feeling fatigued while getting 26 points and nine rebounds in Philadelphia’s 105-87 win over the Lakers on Thursday. That was just the fourth time he’d been held under 30 points since the consecutive games streak started on Dec. 15."}
{"game_id": "0022100747", "chunk_id": "0022100747_007", "order": 7, "role": "body", "text": "And he looked gassed in the first half on Saturday when the Kings went up 11. But Embiid almost single-handedly pulled the 76ers back with a dominating third quarter in which he scored 17 points while moving from receiving the ball in the post to attacking off the dribble to overcome Sacramento double- and triple-teams."}
{"game_id": "0022100747", "chunk_id": "0022100747_008", "order": 8, "role": "body", "text": "“Just being aggressive,” Embiid said. “We did a good job of executing.”"}
{"game_id": "0022100747", "chunk_id": "0022100747_009", "order": 9, "role": "body", "text": "The “MVP! MVP!” chants were deafening when Embiid finished a three-point play that tied it at 81 with 48 seconds left in the third."}
{"game_id": "0022100747", "chunk_id": "0022100747_010", "order": 10, "role": "body", "text": "“He’s making the right plays,” said Danny Green, who had 11 points."}
{"game_id": "0022100747", "chunk_id": "0022100747_011", "order": 11, "role": "body", "text": "Tobias Harris scored 16 points and Maxey had 13 for the 76ers, who held on when Harrison Barnes missed a 3-pointer as time expired."}
{"game_id": "0022100747", "chunk_id": "0022100747_012", "order": 12, "role": "body", "text": "Philadelphia has won 14 of 17 and the first three games of a five-game homestand that continues Monday against Memphis."}
{"game_id": "0022100747", "chunk_id": "0022100747_013", "order": 13, "role": "body", "text": "Tyrese Haliburton scored a career-high 38 points and Barnes had 16 for the Kings, who have lost six in a row overall and 11 straight on the road. Sacramento was without leading scorer De’Aaron Fox (left ankle)."}
{"game_id": "0022100747", "chunk_id": "0022100747_014", "order": 14, "role": "body", "text": "“If we play that way with that kind of intensity and togetherness, we’ll be fine,” Gentry said."}
{"game_id": "0022100747", "chunk_id": "0022100747_015", "order": 15, "role": "body", "text": "The Kings took an 87-81 lead early in the final quarter on consecutive baskets by Richaun Holmes and then went cold. The 76ers scored the next 12 points over 4:59, capped by Maxey’s 3-pointer, to go up 93-87 with 6:01 left. Sacramento went 0 for 6 and committed four turnovers during the game-changing stretch – most of which happened while Embiid was resting on the bench. Maxey had seven points during the key spurt."}
{"game_id": "0022100747", "chunk_id": "0022100747_016", "order": 16, "role": "body", "text": "Haliburton hit a corner 3 with 11.2 seconds to play to trim the lead to 103-101. Sacramento got the ball with a chance to tie or go ahead when Philadelphia’s Georges Niang was called for a five-second violation just before he called timeout on the ensuing inbounds play after a 76ers timeout. But Barnes’ miss sent the crowd into a celebration."}
{"game_id": "0022100747", "chunk_id": "0022100747_017", "order": 17, "role": "body", "text": "“We just weathered the storm,” Maxey said."}
{"game_id": "0022100747", "chunk_id": "0022100747_018", "order": 18, "role": "body", "text": "Philadelphia fans didn’t have much to cheer about in the first half, though. The Kings controlled the opening 24 minutes and went up by as many as 17 points on Marvin Bagley’s 8-footer that made it 50-33 with 4:10 left in the second quarter before settling for a 61-50 halftime lead."}
{"game_id": "0022100747", "chunk_id": "0022100747_020", "order": 20, "role": "body", "text": "Kings: Fox missed his fourth straight game. Gentry said there’s no timetable on Fox’s return. … Terence Davis (right wrist) was sidelined for the second game in a row. He is out indefinitely. … Chimezie Metu returned to the court after a two-game absence due to a left foot injury. He finished with five points and two rebounds."}
{"game_id": "0022100747", "chunk_id": "0022100747_021", "order": 21, "role": "body", "text": "76ers: Shake Milton (back) sat for the 13th straight contest. Seth Curry returned after missing four in a row with an ankle injury. He had eight points and five assists."}
{"game_id": "0022100747", "chunk_id": "0022100747_023", "order": 23, "role": "body", "text": "Kings: With the Feb. 10 trade deadline approaching and several Kings rumored in deals, Gentry has advised his players to focus on what they can control. “The best thing you can do in these situations is be focused on the games, be focused on the level of play and whatever happens is going to happen anyway,” he said. … Fell to 6-17 on the road."}
{"game_id": "0022100747", "chunk_id": "0022100747_024", "order": 24, "role": "body", "text": "76ers: Due to the snowstorm in Philadelphia, coach Doc Rivers canceled Saturday morning’s scheduled shootaround. … Improved to 13-10 at home. … The club reportedly has banned the fan who heckled the Lakers’ Carmelo Anthony on Thursday from attending future games."}
{"game_id": "0022100747", "chunk_id": "0022100747_026", "order": 26, "role": "body", "text": "Kings: At New York Knicks on Monday."}
{"game_id": "0022100747", "chunk_id": "0022100747_027", "order": 27, "role": "body", "text": "76ers: Host Memphis on Monday."}
