{"game_id": "0022101018", "chunk_id": "0022101018_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — Dillon Brooks had to wait a few more minutes to make his return."}
{"game_id": "0022101018", "chunk_id": "0022101018_002", "order": 2, "role": "body", "text": "After being sidelined for 27 games due to an ankle injury, Brooks walked onto the court Sunday only to see that both Memphis and Oklahoma City were wearing white uniforms. The Grizzlies retreated to their locker room to change into their navy blues — a five-minute delay."}
{"game_id": "0022101018", "chunk_id": "0022101018_003", "order": 3, "role": "body", "text": "The mishap was a rare snag in an otherwise successful night for Brooks and Company. The Grizzlies trailed the Thunder for a total of 25 seconds all night before leaving with a 125-118 win."}
{"game_id": "0022101018", "chunk_id": "0022101018_004", "order": 4, "role": "body", "text": "Memphis saw a balanced scoring effort: Desmond Bane had 21, Jaren Jackson Jr. 18, Ja Morant 17, Brooks 15, Brandon Clarke and Tyus Jones with and Ziaire Williams had 11."}
{"game_id": "0022101018", "chunk_id": "0022101018_005", "order": 5, "role": "body", "text": "“Tons of credit to the Thunder,” Memphis coach Taylor Jenkins said. “They were just relentless for 48 minutes … We just got enough stops in crucial moments there.”"}
{"game_id": "0022101018", "chunk_id": "0022101018_006", "order": 6, "role": "body", "text": "Shai Gilgeous-Alexander led the Thunder with 31 points and seven assists, and Darius Bazley had a season-high 29 points to go along with 10 rebounds for Oklahoma City, which has lost six of its last seven games."}
{"game_id": "0022101018", "chunk_id": "0022101018_007", "order": 7, "role": "body", "text": "Memphis led 38-26 at the end of the first quarter, with former OKC player Steven Adams recording seven points and eight rebounds in nine minutes. He finished with 9 points and 16 rebounds."}
{"game_id": "0022101018", "chunk_id": "0022101018_008", "order": 8, "role": "body", "text": "“It was beautiful, man,” Adams said of his return. “Nostalgia … It was awesome coming back.”"}
{"game_id": "0022101018", "chunk_id": "0022101018_009", "order": 9, "role": "body", "text": "The Thunder opened up the second quarter on a 7-0 run that Lindy Waters III capped off with a 3-pointer, but the Grizzlies led 61-54 at halftime."}
{"game_id": "0022101018", "chunk_id": "0022101018_010", "order": 10, "role": "body", "text": "Despite picking up his fourth foul with 6:11 left in the third, Gilgeous-Alexander stayed in the game and scored seven of his team’s next 12 points."}
{"game_id": "0022101018", "chunk_id": "0022101018_011", "order": 11, "role": "body", "text": "Memphis took a 95-79 lead heading into the fourth quarter, but Bazley scored 12 points to will Oklahoma City into contention. A 3-point shot by Theo Maledon trimmed the deficit to 121-115 with 25.5 seconds left in regulation, but the Grizzlies hung on."}
{"game_id": "0022101018", "chunk_id": "0022101018_012", "order": 12, "role": "body", "text": "“We needed a lot of things to happen for us and a lot of stuff not to fall for them,” Bazley said of the late push. “(Memphis) is a good team … But I thought we did a good job of just staying together and trying to get all the way back into it.”"}
{"game_id": "0022101018", "chunk_id": "0022101018_014", "order": 14, "role": "body", "text": "Grizzlies: Memphis recorded 20 offensive rebounds in the win. Adams led the way with seven offensive boards, while Bane added three of his own."}
{"game_id": "0022101018", "chunk_id": "0022101018_015", "order": 15, "role": "body", "text": "Thunder: After scoring a career-high 16 points against the Milwaukee Bucks on Tuesday, Waters tied it Sunday with 16 points in 30 minutes off the bench."}
{"game_id": "0022101018", "chunk_id": "0022101018_017", "order": 17, "role": "body", "text": "Grizzlies: At Indiana on Tuesday night."}
{"game_id": "0022101018", "chunk_id": "0022101018_018", "order": 18, "role": "body", "text": "Thunder: Host Charlotte on Monday night."}
