{"game_id": "0022100589", "chunk_id": "0022100589_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — LeBron James scored 23 of his 32 points in the second half, Malik Monk added a season-high 29 and the Los Angeles Lakers held off the Atlanta Hawks 134-118 Friday night for their first four-game winning streak of the season."}
{"game_id": "0022100589", "chunk_id": "0022100589_002", "order": 2, "role": "body", "text": "Avery Bradley and Talen Horton-Tucker scored 21 points apiece for the Lakers, who have won five of six overall while remaining perfect on a five-game homestand that ends Sunday. With Anthony Davis the only major contributor still absent from their injury-plagued roster, the Lakers had a season-high 37 assists and continued to play their most cohesive basketball of their tumultuous season."}
{"game_id": "0022100589", "chunk_id": "0022100589_003", "order": 3, "role": "body", "text": "“We’re getting our guys back,” said James, who also had nine assists, eight rebounds, four steals and three blocked shots. “It’s literally that simple. We’re starting to see what we have because guys are in the lineup. Soon we’re getting (Kendrick) Nunn as well, and not too long after that, AD returns. When you’re building a team with depth and chemistry on the floor, and when too many guys are out, it’s too early to gauge it.”"}
{"game_id": "0022100589", "chunk_id": "0022100589_004", "order": 4, "role": "body", "text": "Trae Young had 25 points and 14 assists, and John Collins scored 21 points in his return to the Hawks, who have lost five of seven amid significant coronavirus problems. Atlanta dropped to 2/3 on a six-game trip, its longest of the season."}
{"game_id": "0022100589", "chunk_id": "0022100589_005", "order": 5, "role": "body", "text": "Los Angeles led by 19 early in the fourth quarter, but Atlanta trimmed the margin to 10 before the Lakers closed it out with dramatic dunks from James and Monk, who soared through the lane for a put-back slam with 1:56 to play."}
{"game_id": "0022100589", "chunk_id": "0022100589_006", "order": 6, "role": "body", "text": "Monk scored 21 points in the first half while hitting eight of his first nine shots in his latest impressive performance for the Lakers, who signed him as a free agent in the offseason. Monk averaged 20.7 points per game in Los Angeles’ previous six games starting on Christmas, showing off his quick-release jumper with multiple 3-pointers in every outing."}
{"game_id": "0022100589", "chunk_id": "0022100589_007", "order": 7, "role": "body", "text": "“What we love about him is that he can create, and he can be a finisher,” Lakers coach Frank Vogel said. “He's playing really well in all ways you can offensively.”"}
{"game_id": "0022100589", "chunk_id": "0022100589_008", "order": 8, "role": "body", "text": "Coach Nate McMillan is still away from the Hawks under the NBA’s health and safety protocols, but starters Collins and Bogdan Bogdanovic returned to uniform after clearing the protocols earlier in the week. Collins had missed the Hawks’ previous five games, and Bogdanovic scored 15 points after missing the last four."}
{"game_id": "0022100589", "chunk_id": "0022100589_009", "order": 9, "role": "body", "text": "Once again, Atlanta's main problem was defense: The Hawks yielded at least 130 points for the eighth time since November and in its fourth consecutive loss."}
{"game_id": "0022100589", "chunk_id": "0022100589_010", "order": 10, "role": "body", "text": "“We’ve got to do a better job,” Atlanta interim coach Joe Prunty said. “Because in a game like tonight, you have a guy like Malik Monk and Avery Bradley who weren’t necessarily causing the problems, but they were getting the benefits. We need to be better defensively.”"}
{"game_id": "0022100589", "chunk_id": "0022100589_011", "order": 11, "role": "body", "text": "Young added nine rebounds to another outstanding performance despite a lower back injury that forced him to miss Atlanta's last game in Sacramento after he dropped 56 in Portland on Monday."}
{"game_id": "0022100589", "chunk_id": "0022100589_012", "order": 12, "role": "body", "text": "“I think defense is an effort thing,” said Young, who broke Dominique Wilkins' franchise record by scoring at least 25 points in his 17th consecutive game. “It’s not necessarily a skill too much. It’s more about effort and your want, and a lot of it is game plan. Those two things to hand in hand, and I think we’ve got to do better on both of them. We’ve got to want it more.”"}
{"game_id": "0022100589", "chunk_id": "0022100589_014", "order": 14, "role": "body", "text": "Hawks: Cameron Oliver and Gorgui Dieng remain in the NBA's health and safety protocols along with McMillan. ... Timothé Luwawu-Cabarrot played 23 scoreless minutes in his first game since his contract became guaranteed for the rest of the season."}
{"game_id": "0022100589", "chunk_id": "0022100589_015", "order": 15, "role": "body", "text": "Lakers: Austin Reaves' contract also became fully guaranteed Friday in an unsurprising decision. The rookie is a regular rotation player off LA's bench. ... James passed Alvin Robertson for 10th place on the NBA's career steals list in the second half. ... Russell Westbrook had nine points, 13 assists and 11 rebounds before fouling out just shy of his eighth triple-double of the season."}
{"game_id": "0022100589", "chunk_id": "0022100589_017", "order": 17, "role": "body", "text": "Bradley scored 16 points in an outstanding first half and hit four 3-pointers in his first game since his contract with the Lakers became guaranteed for the rest of the season."}
{"game_id": "0022100589", "chunk_id": "0022100589_018", "order": 18, "role": "body", "text": "Los Angeles claimed Bradley in October after their roster had preseason injury problems, and the veteran guard surprisingly became a starter and a dependable contributor in his second stint in LA. Bradley was a contributor to the Lakers’ championship team before the coronavirus pause, but he opted out of the playoff bubble and didn’t get to win the title."}
{"game_id": "0022100589", "chunk_id": "0022100589_020", "order": 20, "role": "body", "text": "Kevin Huerter, who scored 25 points and closed out the Hawks’ win in Sacramento two days ago with five late points, hit four 3-pointers and scored 12 of his 16 points in the first half against the Lakers."}
{"game_id": "0022100589", "chunk_id": "0022100589_023", "order": 23, "role": "body", "text": "Lakers: Host Memphis on Sunday."}
