{"game_id": "0022100761", "chunk_id": "0022100761_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Tyrese Maxey scored 33 points, including a driving layup with 26.4 seconds left in overtime that put Philadelphia ahead for good, and the 76ers beat the Memphis Grizzlies 122-119 without Joel Embiid on Monday night."}
{"game_id": "0022100761", "chunk_id": "0022100761_002", "order": 2, "role": "body", "text": "Tobias Harris added 31 points and Andre Drummond had 16 points and 23 rebounds for Philadelphia, which won its fifth game in a row and 15th in the last 18. The 76ers improved to 4-8 without Embiid, who sat out for rest."}
{"game_id": "0022100761", "chunk_id": "0022100761_003", "order": 3, "role": "body", "text": "“Just great efforts from everybody,” Harris said. “We wanted this one.”"}
{"game_id": "0022100761", "chunk_id": "0022100761_004", "order": 4, "role": "body", "text": "Ja Morant scored 37 points and Desmond Bane had a career-high 34 for Memphis."}
{"game_id": "0022100761", "chunk_id": "0022100761_005", "order": 5, "role": "body", "text": "“I love big games,” Bane said. “They played well. We played well and fought. As long as we’re fighting and playing together, I’ll live with the result every night.”"}
{"game_id": "0022100761", "chunk_id": "0022100761_006", "order": 6, "role": "body", "text": "Neither team led by more than four in a back-and-forth and exciting fourth quarter and overtime."}
{"game_id": "0022100761", "chunk_id": "0022100761_007", "order": 7, "role": "body", "text": "Maxey’s driving layup put Philadelphia in front 120-119. The 76ers packed the lane as Morant tried to reclaim the lead with a drive on the ensuing possession, and the Memphis star kicked it out to Ziaire Williams, whose corner 3-pointer rimmed out. Matisse Thybulle grabbed the rebound and passed ahead to Maxey, who finished the scoring with a layup."}
{"game_id": "0022100761", "chunk_id": "0022100761_008", "order": 8, "role": "body", "text": "“I’m happy he’s my point guard,” Drummond said."}
{"game_id": "0022100761", "chunk_id": "0022100761_009", "order": 9, "role": "body", "text": "Embiid celebrated with the 76ers in the locker room afterward."}
{"game_id": "0022100761", "chunk_id": "0022100761_010", "order": 10, "role": "body", "text": "“He’s a great teammate,” Maxey said. “He’s our MVP.”"}
{"game_id": "0022100761", "chunk_id": "0022100761_011", "order": 11, "role": "body", "text": "Morant reached 30 points for the seventh straight game. Before Embiid’s absence was announced earlier in the day, the game looked to be a matchup of two of the NBA’s top stars."}
{"game_id": "0022100761", "chunk_id": "0022100761_012", "order": 12, "role": "body", "text": "Embiid rested after a scintillating streak of 21 straight games played in which he raised his MVP profile. The 76ers big man averaged 33.1 points during the stretch to up his season scoring average to 29.1 points per game, which ranked second in the league behind Kevin Durant’s 29.3 points entering Monday."}
{"game_id": "0022100761", "chunk_id": "0022100761_013", "order": 13, "role": "body", "text": "Selected as a starter for his fifth straight All-Star Game last week, Embiid was named the Eastern Conference Player of the Week on Monday. Philadelphia coach Doc Rivers said the rest day was prearranged by the team’s medical staff."}
{"game_id": "0022100761", "chunk_id": "0022100761_014", "order": 14, "role": "body", "text": "“They thought it was the right day,” Rivers said."}
{"game_id": "0022100761", "chunk_id": "0022100761_015", "order": 15, "role": "body", "text": "After finishing second in MVP voting last season, Embiid has spoken publicly about the slight he has felt the last two seasons by individual award selectors knocking him down their list because of his absences — he played just 51 games in each of the last two seasons — and has made it a priority to be more reliable this season."}
{"game_id": "0022100761", "chunk_id": "0022100761_016", "order": 16, "role": "body", "text": "Monday marked Embiid’s 12th missed game, nine of which he missed due to health and safety protocols. The last time he sat out was Dec. 13 when Philadelphia lost 126-91 at Memphis, a game in which the 76ers felt they got out-toughed."}
{"game_id": "0022100761", "chunk_id": "0022100761_017", "order": 17, "role": "body", "text": "“They like to punk teams and they have punked a lot of teams in this league,” Harris said. “We weren’t going to let that happen tonight.”"}
{"game_id": "0022100761", "chunk_id": "0022100761_018", "order": 18, "role": "body", "text": "Embiid missed a thriller in a game that was tight throughout the fourth quarter."}
{"game_id": "0022100761", "chunk_id": "0022100761_019", "order": 19, "role": "body", "text": "Morant raced down the floor, scored on a floater with 8.1 seconds left in regulation and was fouled by Drummond. Rivers challenged the call, but it was unsuccessful. Morant missed the free throw, though, keeping the game tied at 111, and Seth Curry’s baseline jumper at the regulation buzzer rimmed out, sending the game to overtime."}
{"game_id": "0022100761", "chunk_id": "0022100761_020", "order": 20, "role": "body", "text": "Rivers was assessed a technical for arguing that a foul should have been called."}
{"game_id": "0022100761", "chunk_id": "0022100761_021", "order": 21, "role": "body", "text": "“If there’s anybody you want to be mad at, it can be me,” Morant said. “If I made free throws, we probably wouldn’t have even gone into overtime.”"}
{"game_id": "0022100761", "chunk_id": "0022100761_022", "order": 22, "role": "body", "text": "Morant put on an exciting show in the third quarter, dazzling with shifty moves, awe-inspiring leaping ability and magician-like passing. He twice zoomed past Drummond with stop-on-the-dime change of direction on consecutive layups early in the quarter, assisted Williams’ fast-break layup with a perfectly placed behind-the-back pass and took off like bouncing on a trampoline for a left-handed alley-oop dunk that tied it at 80 with 2:43 left in the period."}
{"game_id": "0022100761", "chunk_id": "0022100761_023", "order": 23, "role": "body", "text": "The Memphis star, named a Western Conference All-Star starter last week, had the normally tough Philly fans “oohing” and “aahing” in amazement of his moves, and he finished the period with 13 points as the Grizzlies trailed 84-80 entering the fourth."}
{"game_id": "0022100761", "chunk_id": "0022100761_024", "order": 24, "role": "body", "text": "“He’s a great athlete, he’s able to make spectacular plays, but at the end of the day it’s still two points,” Drummond said. “You have to take your hat off to him, but we won the game.”"}
{"game_id": "0022100761", "chunk_id": "0022100761_026", "order": 26, "role": "body", "text": "Grizzlies: Dillon Brooks (left ankle) was sidelined for the 18th time in the last 20 games. He last played on Jan. 8. … Tyus Jones returned to the lineup after a six-game absence due to health and safety protocols. He had four points, two rebounds and two assists. … Morant had nine turnovers."}
{"game_id": "0022100761", "chunk_id": "0022100761_027", "order": 27, "role": "body", "text": "76ers: Furkan Korkmaz (left knee soreness) sat out after getting injured in Saturday’s game. … Shake Milton (back) missed his 14th game in a row."}
{"game_id": "0022100761", "chunk_id": "0022100761_029", "order": 29, "role": "body", "text": "Grizzlies: Coach Taylor Jenkins graduated from nearby University of Pennsylvania and reminisced about attending 76ers games in the mid-2000s as an undergraduate. “Great times here, saw a lot of great matchups here,” he said. “The energy in this building, the fans are so unique, the passion they have here. I go down memory lane every time I come back to the city.” ... Memphis fell to 16-9 on the road."}
{"game_id": "0022100761", "chunk_id": "0022100761_030", "order": 30, "role": "body", "text": "76ers: Isaiah Joe had a pair of four-point plays in the first half. … Philadelphia Eagles WR DeVonta Smith sat courtside, as did former Eagles WR Freddie Mitchell. … The 76ers improved to 14-10 at home."}
{"game_id": "0022100761", "chunk_id": "0022100761_032", "order": 32, "role": "body", "text": "Grizzlies: At the New York Knicks on Wednesday night."}
{"game_id": "0022100761", "chunk_id": "0022100761_033", "order": 33, "role": "body", "text": "76ers: Finish a five-game homestand Wednesday night against Washington."}
