{"game_id": "0022100851", "chunk_id": "0022100851_001", "order": 1, "role": "lead", "text": "MIAMI -- — Bam Adebayo had 19 points and 14 rebounds, and the Miami Heat held off a furious rally from Kyrie Irving and the Brooklyn Nets for a 115-111 victory Saturday night."}
{"game_id": "0022100851", "chunk_id": "0022100851_002", "order": 2, "role": "body", "text": "Irving scored 20 of his 29 points in the fourth quarter to help the Nets rally from a 21-point, third-quarter deficit before dropping their 11th straight game."}
{"game_id": "0022100851", "chunk_id": "0022100851_003", "order": 3, "role": "body", "text": "Cam Thomas’ 3-pointer with 37 seconds left cut Miami’s lead to 110-109. Down 113-111, the Nets had possession and an opportunity to tie or take the lead. But Kyle Lowry stole Thomas’ pass, dribbled downcourt and found P.J. Tucker, who got fouled and converted his shots to secure Miami’s fifth consecutive win."}
{"game_id": "0022100851", "chunk_id": "0022100851_004", "order": 4, "role": "body", "text": "“I think that was what it was going to take, some random deflection,” Miami coach Erik Spoelstra said of Lowry’s defensive play. “It didn’t go necessarily how we wanted it to in the fourth quarter. Particularly when we had the 20-point lead, we allowed them some life with some of our inefficient offense.”"}
{"game_id": "0022100851", "chunk_id": "0022100851_005", "order": 5, "role": "body", "text": "Duncan Robinson finished with 17 points and hit 6-of-10 3-pointers, Jimmy Butler and Tyler Herro each scored 13 and Lowry had 13 points and six assists for the Eastern Conference-leading Heat."}
{"game_id": "0022100851", "chunk_id": "0022100851_006", "order": 6, "role": "body", "text": "Thomas had 22 points and Kessler Edwards finished with 13 for the Nets, who have lost their last two in the slide by single digits. Their previous five losses were by double figures."}
{"game_id": "0022100851", "chunk_id": "0022100851_007", "order": 7, "role": "body", "text": "“There were some moments where it could have gotten away,” Brooklyn coach Steve Nash said. “We found a way to scrap and claw. They rose to the occasion and took the challenge.”"}
{"game_id": "0022100851", "chunk_id": "0022100851_008", "order": 8, "role": "body", "text": "Irving shot 6 of 9 from the field, including 2 of 3 from beyond the arc, in the fourth quarter."}
{"game_id": "0022100851", "chunk_id": "0022100851_009", "order": 9, "role": "body", "text": "“It’s being myself, making some shots,” Irving said of his late scoring spree. “There were some easy opportunities I had in those first three quarters but in that fourth I saw the lane open up a little bit more and I was just being very decisive.”"}
{"game_id": "0022100851", "chunk_id": "0022100851_010", "order": 10, "role": "body", "text": "The Heat stretched a six-point lead at halftime with a 16-3 spurt to start the third period. Eight points from Adebayo and Robinson’s two 3-pointers keyed the run. Dewayne Dedmon split two free throws with 1:53 remaining in the quarter, giving Miami its largest lead at 89-68."}
{"game_id": "0022100851", "chunk_id": "0022100851_011", "order": 11, "role": "body", "text": "“We had a good start to the third quarter but then let off a little bit,” Robinson said. “We have to be better than that. But still, to win games down the stretch, having those closing possessions and stops were big.”"}
{"game_id": "0022100851", "chunk_id": "0022100851_012", "order": 12, "role": "body", "text": "Former league MVP Kevin Durant recently began workouts in hopes of returning to the Nets lineup. Durant has been sidelined since his spraining left knee in a game against New Orleans Jan. 15."}
{"game_id": "0022100851", "chunk_id": "0022100851_013", "order": 13, "role": "body", "text": "Seth Curry and Andre Drummond, acquired by the Nets with Ben Simmons in the trade for James Harden, had not been cleared to play."}
{"game_id": "0022100851", "chunk_id": "0022100851_015", "order": 15, "role": "body", "text": "Nets: Thomas has scored 20 points or more in four of his last five games. He is averaging 23.2 during the stretch. ... C/F LaMarcus Aldridge (left ankle sprain) missed his seventh straight."}
{"game_id": "0022100851", "chunk_id": "0022100851_016", "order": 16, "role": "body", "text": "Heat: Miami is 19-6 vs. East at home and 23-12 overall. .... The winning streak coincides with Lowry’s return. He missed nine games because of personal reasons. ... F Caleb Martin (left Achilles soreness) sat out."}
{"game_id": "0022100851", "chunk_id": "0022100851_018", "order": 18, "role": "body", "text": "The recently completed six-game road slate has positioned the Heat toward a favorable home stretch to conclude the regular season. Beginning with Saturday’s game against Brooklyn, Miami will play 17 of its final 26 at home. And the longest road trip remaining is a three-game set at Boston, Chicago and Toronto March 30-April 3."}
{"game_id": "0022100851", "chunk_id": "0022100851_020", "order": 20, "role": "body", "text": "Nets: Host Sacramento on Monday."}
