{"game_id": "0022100590", "chunk_id": "0022100590_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — Rajon Rondo settled right in with his newest team."}
{"game_id": "0022100590", "chunk_id": "0022100590_002", "order": 2, "role": "body", "text": "Soon after coming into Friday night's game against the Trail Blazers, Rondo hit a 3-pointer and finished with 11 points in Cleveland's 114-101 victory."}
{"game_id": "0022100590", "chunk_id": "0022100590_003", "order": 3, "role": "body", "text": "“When Coach calls my name, I’m always trying to be ready,” said Rondo, who was traded to the Cavaliers earlier this week. “Regardless if I start, come off the bench, play 28 minutes or two minutes, it’s a great opportunity to be here and and play for this team.”"}
{"game_id": "0022100590", "chunk_id": "0022100590_004", "order": 4, "role": "body", "text": "Darius Garland had 26 points in the Cavaliers' 22nd win, matching their total for all of last season when they finished 13th in the Eastern Conference."}
{"game_id": "0022100590", "chunk_id": "0022100590_005", "order": 5, "role": "body", "text": "Rookie Evan Mobley added 18 points for Cleveland in the team's first victory in Portland since January 2013."}
{"game_id": "0022100590", "chunk_id": "0022100590_006", "order": 6, "role": "body", "text": "“It was fun, the first couple plays were kinda like, `Dang, that’s Rondo on the floor.'\" Garland said. \"New face, but it was cool — Rondo’s a really good guy, he’s a great vet, he’s a leader on the floor, so it was fun playing with him.\""}
{"game_id": "0022100590", "chunk_id": "0022100590_007", "order": 7, "role": "body", "text": "Norman Powell had 19 points for the Blazers, who have lost six of their last seven games."}
{"game_id": "0022100590", "chunk_id": "0022100590_008", "order": 8, "role": "body", "text": "“I thought we played hard, thought we did some things that we wanted to do,” Powell said. “I think we had, again, two or three minutes with some lapses that they countered. Dug ourselves into a little hole, but we were able to respond.”"}
{"game_id": "0022100590", "chunk_id": "0022100590_009", "order": 9, "role": "body", "text": "The Cavaliers led much of the game, but Nassir Little's 3-pointer got Portland within 90-87 in the fourth quarter. Cedi Osman answered with a 3 for the Cavaliers."}
{"game_id": "0022100590", "chunk_id": "0022100590_010", "order": 10, "role": "body", "text": "Little hit another 3 that narrowed it to 101-96 with 3:01 to go, but again Osman came back with a 3-pointer and the Blazers couldn't catch up."}
{"game_id": "0022100590", "chunk_id": "0022100590_011", "order": 11, "role": "body", "text": "Rondo was acquired in a three-team trade with the Lakers and Knicks earlier in the week. The 16-year NBA veteran came into the game with just over five minutes left in the opening quarter and his 3-pointer gave the Cavaliers a 22-16 lead."}
{"game_id": "0022100590", "chunk_id": "0022100590_012", "order": 12, "role": "body", "text": "Cleveland was stung by absences caused by COVID-19 protocols in recent weeks, but the team has largely reassembled. As far as integrating the newest player, coach J.B. Bickerstaff said he wants Rondo to be Rondo."}
{"game_id": "0022100590", "chunk_id": "0022100590_013", "order": 13, "role": "body", "text": "“We just want all of our guys, we want them to be the best versions of themselves. So we won't put any restraints on him. We'll let him play to his strengths,” Bickerstaff said. “Some of this is feeling it out for us, figuring out combinations and things like that.”"}
{"game_id": "0022100590", "chunk_id": "0022100590_014", "order": 14, "role": "body", "text": "Rondo, who played just under 17 minutes, said his mindset was “\"just to have fun, go out there and do what I do best. Be myself. And coach Bickerstaff made me feel comfortable from jump.\""}
{"game_id": "0022100590", "chunk_id": "0022100590_015", "order": 15, "role": "body", "text": "Portland remained without star guard Damian Lillard, who is out because of abdominal tendinopathy. Lillard has missed the last two games and is expected to also sit out Sunday's game against Sacramento while he is evaluated for the injury, which has bothered him since the Tokyo Olympics."}
{"game_id": "0022100590", "chunk_id": "0022100590_016", "order": 16, "role": "body", "text": "Fellow guard CJ McCollum was sidelined for the 13th straight game for Portland because of a collapsed right lung, while starter Larry Nance Jr. was out after hurting his right knee during Wednesday night's 115-109 loss to Miami."}
{"game_id": "0022100590", "chunk_id": "0022100590_017", "order": 17, "role": "body", "text": "The Cavaliers went up by as many as 12 points in the opening half and led 57-47 at the break. Garland led all scorers with 16."}
{"game_id": "0022100590", "chunk_id": "0022100590_018", "order": 18, "role": "body", "text": "Powell's 3 pointer and a floater from Dennis Smith Jr. pulled the Blazers within 79-76 late in the third quarter."}
{"game_id": "0022100590", "chunk_id": "0022100590_020", "order": 20, "role": "body", "text": "Cavaliers: Cleveland saw the return of Osman, who missed six games in health and safety protocols. ... It was the first of a six-game road trip for the Cavaliers."}
{"game_id": "0022100590", "chunk_id": "0022100590_021", "order": 21, "role": "body", "text": "Trail Blazers: Center Jusuf Nurkic hit a pair of 3-pointers in the first half, marking his first regular-season game with multiple 3s. ... Center Cody Zeller returned after missing 12 games with a knee injury and a stint in the COVID-19 protocols."}
{"game_id": "0022100590", "chunk_id": "0022100590_023", "order": 23, "role": "body", "text": "Cavaliers: Continue their road swing at Golden State on Sunday night."}
{"game_id": "0022100590", "chunk_id": "0022100590_024", "order": 24, "role": "body", "text": "Trail Blazers: Host the Sacramento Kings on Sunday. The next night they host the Brooklyn Nets in a game originally set for Dec. 23."}
