{"game_id": "0022100529", "chunk_id": "0022100529_001", "order": 1, "role": "lead", "text": "BOSTON -- — Jaylen Brown and Marcus Smart each scored 24 points, and the Boston Celtics stopped a three-game slide by topping the Phoenix Suns 123-108 on Friday."}
{"game_id": "0022100529", "chunk_id": "0022100529_002", "order": 2, "role": "body", "text": "Brown also grabbed 11 rebounds and Smart finished with eight assists, helping the Celtics bounce back from a 91-82 home loss to the Los Angeles Clippers on Wednesday night. Robert Williams had 10 points, 10 assists and 11 rebounds, and Josh Richardson added 19 points."}
{"game_id": "0022100529", "chunk_id": "0022100529_003", "order": 3, "role": "body", "text": "The Celtics were without leading scorer Jayson Tatum, who was placed on the health and safety protocols list early in the week, but Smart returned and the offense responded by shooting 54%. Seven players scored in double figures."}
{"game_id": "0022100529", "chunk_id": "0022100529_004", "order": 4, "role": "body", "text": "“We played some great basketball down the stretch,” Brown said. “We played with a nice flow and a nice identity. It made the game so much easier.\""}
{"game_id": "0022100529", "chunk_id": "0022100529_005", "order": 5, "role": "body", "text": "Devin Booker scored 22 points for Phoenix, and Cam Johnson had 20. Jalen Smith scored 19 and Chris Paul finished with 14 points and eight assists."}
{"game_id": "0022100529", "chunk_id": "0022100529_006", "order": 6, "role": "body", "text": "The Suns remained without starters Deandre Ayton and Jae Crowder, who missed their third straight game because of health and safety protocols. Coach Monty Williams was also on the protocol list for the third game in a row."}
{"game_id": "0022100529", "chunk_id": "0022100529_007", "order": 7, "role": "body", "text": "The Suns (27-8), who entered with the top record in the NBA, lost for the third time in four games."}
{"game_id": "0022100529", "chunk_id": "0022100529_008", "order": 8, "role": "body", "text": "Kevin Young, who is coaching Phoenix while Williams remains out, said the Suns weren't physical enough to keep the Celtics from rolling early."}
{"game_id": "0022100529", "chunk_id": "0022100529_009", "order": 9, "role": "body", "text": "“I thought the biggest difference was we got much more physical in the second half. They were the more physical team in the first. Some of those cuts, we just let them go where they wanted to go,” Young said."}
{"game_id": "0022100529", "chunk_id": "0022100529_010", "order": 10, "role": "body", "text": "Boston (17-19) was coming off a dreadful shooting performance, making just 4 of 42 3-pointers against the Clippers."}
{"game_id": "0022100529", "chunk_id": "0022100529_011", "order": 11, "role": "body", "text": "The Celtics jumped all over the Suns, shooting 58% in the first half and leading by as much as 30 points. Boston closed out the first quarter on an 18-6 run and outscored Phoenix 35-21 in the second period, taking a 67-41 lead into halftime."}
{"game_id": "0022100529", "chunk_id": "0022100529_012", "order": 12, "role": "body", "text": "“To be down 30, it has to be a little bit of both — not defending and stagnant offense,” Booker said. “They were switching actions, which slowed us down, and getting easy layups and wide-open 3s to start the game.”"}
{"game_id": "0022100529", "chunk_id": "0022100529_013", "order": 13, "role": "body", "text": "Boston made 10 of 27 3-pointers in the New Year’s Eve matinee."}
{"game_id": "0022100529", "chunk_id": "0022100529_014", "order": 14, "role": "body", "text": "The Suns were 3 for 15 on 3-pointers in first half. They started faring better from outside in the second half, but it was too late to make much of a dent in Boston’s lead. Back-to-back 3-pointers by Paul and Ish Wainright early in the fourth only got Phoenix back within 15, still down 106-91."}
{"game_id": "0022100529", "chunk_id": "0022100529_016", "order": 16, "role": "body", "text": "Williams punctuated his first career triple-double with five blocks, swatting away three shots in the second half as the Suns tried to generate some offense inside."}
{"game_id": "0022100529", "chunk_id": "0022100529_017", "order": 17, "role": "body", "text": "Williams went 5 for 5 from the field and added two steals."}
{"game_id": "0022100529", "chunk_id": "0022100529_018", "order": 18, "role": "body", "text": "“When he comes out and plays basketball, there’s not a lot of people that can contain him on both ends. His effect on defense and offense tonight, everybody seen it,” Brown said. “Rob had a great night tonight and deserves all the praise he gets.\""}
{"game_id": "0022100529", "chunk_id": "0022100529_020", "order": 20, "role": "body", "text": "The Celtics held a moment of silence before the game in memory of Sam Jones, a Hall of Famer who died Thursday at age 88. Jones won 10 NBA titles with Boston — second only to teammate Bill Russell — and the Celtics retired his No. 24 in 1969 when he was still an active player."}
{"game_id": "0022100529", "chunk_id": "0022100529_021", "order": 21, "role": "body", "text": "“Sam Jones was one of the most talented, versatile, and clutch shooters for the most successful and dominant teams in NBA history,” the team said in a statement."}
{"game_id": "0022100529", "chunk_id": "0022100529_023", "order": 23, "role": "body", "text": "The game featured a rookie official in Tyler Mirkovich, one of three G League officials who made their NBA debuts Friday with officiating crews also depleted by COVID-19."}
{"game_id": "0022100529", "chunk_id": "0022100529_025", "order": 25, "role": "body", "text": "Suns: C JaVale McGee was also unavailable due to COVID-19 protocols and F/C Frank Kaminsky (right knee) missed his 22nd straight game. … Booker was called for a technical with five minutes left in the first quarter."}
{"game_id": "0022100529", "chunk_id": "0022100529_026", "order": 26, "role": "body", "text": "Celtics: Smart returned after missing two games with a cut on his hand. ... Boston used only three reserves in the first half, and the trio of Josh Richardson, Romeo Langford and Payton Pritchard combined for 32 points. Langford finished with 16 points and Pritchard scored 11 in the game. ... Tatum missed his third straight game and remained on the protocol list with C Bruno Fernando, C Enes Freedom, G C.J. Miles, F Aaron Nesmith and G Dennis Schroder."}
{"game_id": "0022100529", "chunk_id": "0022100529_028", "order": 28, "role": "body", "text": "Suns: At Charlotte on Sunday night."}
{"game_id": "0022100529", "chunk_id": "0022100529_029", "order": 29, "role": "body", "text": "Celtics: Host Orlando on Sunday night."}
