{"game_id": "0022100636", "chunk_id": "0022100636_001", "order": 1, "role": "lead", "text": "MIAMI -- — The stars were out in Miami. Drake was sitting courtside. Golfer Brooks Koepka had prime seats."}
{"game_id": "0022100636", "chunk_id": "0022100636_003", "order": 3, "role": "body", "text": "The Heat made them wait until the end, but they didn't disappoint."}
{"game_id": "0022100636", "chunk_id": "0022100636_004", "order": 4, "role": "body", "text": "Tyler Herro scored 11 of his 24 points in the fourth quarter, Jimmy Butler returned from a three-game absence with a sprained ankle to add 23 and the Heat rallied to beat the Atlanta Hawks 124-118 on Friday night — moving within a game of Chicago for first place in the Eastern Conference."}
{"game_id": "0022100636", "chunk_id": "0022100636_005", "order": 5, "role": "body", "text": "“I love the spirit of our group,\" said Heat coach Erik Spoelstra, after his team moved a season-high 12 games over .500 and won its fourth straight overall."}
{"game_id": "0022100636", "chunk_id": "0022100636_006", "order": 6, "role": "body", "text": "Omer Yurtseven finished with 17 points and 11 rebounds for Miami. P.J. Tucker scored 17 points, and Max Strus added 16 — all in the first quarter — for the Heat. But it was defense that won it; Miami forced Atlanta into more fourth-quarter turnovers (7) than field goals (6)."}
{"game_id": "0022100636", "chunk_id": "0022100636_007", "order": 7, "role": "body", "text": "“When the game’s on the line, we’ve got guys that step up,” Butler said."}
{"game_id": "0022100636", "chunk_id": "0022100636_008", "order": 8, "role": "body", "text": "Trae Young had 24 points for Atlanta, which rallied from 17 down early and led by 10 in the second half before letting it get away. De'Andre Hunter scored 20 points, Danilo Gallinari added 18, John Collins 16 and Kevin Huerter 15."}
{"game_id": "0022100636", "chunk_id": "0022100636_009", "order": 9, "role": "body", "text": "Atlanta didn't have a field goal in the final 3:13, shooting just 30% in that final quarter."}
{"game_id": "0022100636", "chunk_id": "0022100636_010", "order": 10, "role": "body", "text": "“We just made some mistakes going down the stretch,\" Hawks coach Nate McMillan said. “We didn't execute offensively, had a couple bad fouls, gave up a couple loose balls — those 50-50 balls, we've got get those — and just didn't execute. We just didn't execute in that fourth quarter and it cost us tonight.\""}
{"game_id": "0022100636", "chunk_id": "0022100636_011", "order": 11, "role": "body", "text": "Herro made a pair of free throws with 46 seconds left to put Miami ahead to stay."}
{"game_id": "0022100636", "chunk_id": "0022100636_012", "order": 12, "role": "body", "text": "Miami led 30-13 early, then gave up 57 points in the final 16 minutes of the half. Atlanta scored 40 in the second quarter alone, becoming the first team to score that many in a quarter against the Heat this season."}
{"game_id": "0022100636", "chunk_id": "0022100636_013", "order": 13, "role": "body", "text": "“We played a good enough game to win this game,” McMillan said. “Now we have to build off of this.”"}
{"game_id": "0022100636", "chunk_id": "0022100636_014", "order": 14, "role": "body", "text": "But the seeds for Miami's comeback were planted in the final seconds of the third quarter. Atlanta was poised to take a 10-point lead into the final quarter after Gallinari made a 3-pointer to make it 99-89 with 13.7 seconds in the third."}
{"game_id": "0022100636", "chunk_id": "0022100636_016", "order": 16, "role": "body", "text": "Herro made a 3-pointer with 8.5 seconds left, Dewayne Dedmon made a pair of free throws after getting fouled while jostling for a rebound with 1.9 ticks remaining — and in a span of 6.6 seconds Miami had cut a double-digit deficit in half."}
{"game_id": "0022100636", "chunk_id": "0022100636_017", "order": 17, "role": "body", "text": "And it took until the final seconds, but the Heat finished it off."}
{"game_id": "0022100636", "chunk_id": "0022100636_018", "order": 18, "role": "body", "text": "“We've just got to take all the wins we can, ugly or not,\" Strus said."}
{"game_id": "0022100636", "chunk_id": "0022100636_020", "order": 20, "role": "body", "text": "Hawks: Atlanta plays host to New York on Saturday, the first game between the teams since this week’s trade that sent Cam Reddish to the Knicks. The Knicks say Reddish (ankle) won’t play Saturday. ... The Hawks became the first team in the last 53 Heat home games to score 70 points on Miami by halftime. Atlanta’s lead was 70-64 at the break."}
{"game_id": "0022100636", "chunk_id": "0022100636_021", "order": 21, "role": "body", "text": "Heat: Miami played 25 of its first 41 games on the road, and Friday began a stretch where the Heat will play eight out of nine at home. ... Yurtseven had gauze stuffed in his left nostril to stop bleeding after taking a hit early in the first quarter and Strus got a laceration under his right eye after taking an elbow from Collins in the third quarter."}
{"game_id": "0022100636", "chunk_id": "0022100636_023", "order": 23, "role": "body", "text": "Saturday will be the 22nd consecutive game that Miami center Bam Adebayo misses while recovering from thumb surgery. It might be the last. Heat coach Erik Spoelstra said Friday that Adebayo has been doing “three-a-day workouts just because he has so much extra energy.” But Spoelstra wouldn’t commit to a return Monday against Toronto, only conceding that “he’ll be back soon enough.”"}
{"game_id": "0022100636", "chunk_id": "0022100636_025", "order": 25, "role": "body", "text": "The Heat (15 for 16) and the Hawks (17 for 17) combined to shoot 32 for 33 from the foul line in the first half. That was the best combined shooting from the stripe in a first half, with that many makes, since Indiana and Detroit also went 32 for 33 in the first 24 minutes of a game on Dec. 13, 2006."}
{"game_id": "0022100636", "chunk_id": "0022100636_027", "order": 27, "role": "body", "text": "Hawks: Host New York on Saturday night."}
{"game_id": "0022100636", "chunk_id": "0022100636_028", "order": 28, "role": "body", "text": "Heat: Host Philadelphia on Saturday night.."}
