{"game_id": "0022101167", "chunk_id": "0022101167_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Luka Doncic continues to feel right at home when he’s facing the Milwaukee Bucks, even when his Dallas Mavericks are on the road facing a fourth-quarter deficit."}
{"game_id": "0022101167", "chunk_id": "0022101167_002", "order": 2, "role": "body", "text": "Doncic scored 32 points and matched a season high with 15 assists to help the Mavericks defeat Giannis Antetokounmpo and the defending champion Bucks 118-112 on Sunday."}
{"game_id": "0022101167", "chunk_id": "0022101167_003", "order": 3, "role": "body", "text": "“Obviously, when you play against superstars like Giannis today, you always have extra motivation,” Doncic said. “He’s a champion, a two-time MVP.”"}
{"game_id": "0022101167", "chunk_id": "0022101167_004", "order": 4, "role": "body", "text": "Antetokounmpo led the Bucks with 28 points and 10 rebounds. Milwaukee was essentially at full strength Sunday after resting all of its usual starters in a 153-119 loss  to the Los Angeles Clippers on Friday night."}
{"game_id": "0022101167", "chunk_id": "0022101167_005", "order": 5, "role": "body", "text": "Doncic flirted with a triple-double before finishing with eight rebounds. In six career games against the Bucks, Doncic has averaged 26.8 points, 11.3 assists and 9.2 rebounds with three triple-doubles."}
{"game_id": "0022101167", "chunk_id": "0022101167_006", "order": 6, "role": "body", "text": "“He’s one of the most talented players in the league, one of the most talented players probably ever to play this game,” Antetokounmpo said."}
{"game_id": "0022101167", "chunk_id": "0022101167_007", "order": 7, "role": "body", "text": "Antetokounmpo added that “we tried to make it tough for him, but he played well.”"}
{"game_id": "0022101167", "chunk_id": "0022101167_008", "order": 8, "role": "body", "text": "Dallas’ Dwight Powell added 22 points and 13 rebounds — one off his career high — and the Mavericks bounced back two days after a 135-103 loss at Washington."}
{"game_id": "0022101167", "chunk_id": "0022101167_009", "order": 9, "role": "body", "text": "“On the road against the champs, it’s a hard place to win, especially after we had that performance in Washington,” Mavericks coach Jason Kidd said. “This group in the locker room knows they can respond.\""}
{"game_id": "0022101167", "chunk_id": "0022101167_010", "order": 10, "role": "body", "text": "After a basket by Bobby Portis briefly gave the Bucks a one-point lead early in the fourth, Doncic led the Mavericks back by scoring or assisting on each of Dallas’ first 11 points in the final period."}
{"game_id": "0022101167", "chunk_id": "0022101167_011", "order": 11, "role": "body", "text": "Doncic hit a 3-pointer to put the Mavericks back ahead 93-91 with 9:04 left. He made a pair of free throws just over a minute later to make it 95-91. He capped the 8-0 run by finding Dorian Finney-Smith for a corner 3-pointer with 7:20 left."}
{"game_id": "0022101167", "chunk_id": "0022101167_012", "order": 12, "role": "body", "text": "Antetokounmpo made two free throws to cut the margin to five, but Doncic found Reggie Bullock for a corner 3-pointer that extended Dallas’ lead to 101-93 with 6:55 remaining."}
{"game_id": "0022101167", "chunk_id": "0022101167_013", "order": 13, "role": "body", "text": "“He’s able to pick apart whatever a defense is throwing at him,” said Jalen Brunson, who scored 15 points for the Mavericks."}
{"game_id": "0022101167", "chunk_id": "0022101167_014", "order": 14, "role": "body", "text": "Milwaukee's Jrue Holiday sank a 3-pointer to cut the Mavericks’ lead to 101-98 midway through the fourth quarter. Powell responded by converting a conventional three-point play to make it 104-98 with 5:52 remaining."}
{"game_id": "0022101167", "chunk_id": "0022101167_015", "order": 15, "role": "body", "text": "The margin didn’t drop below five the rest of the way."}
{"game_id": "0022101167", "chunk_id": "0022101167_016", "order": 16, "role": "body", "text": "Bullock had 16 points and Finney-Smith and Spencer Dinwiddie had 11 each for the Mavericks. Holiday had 20, Portis 17, Brook Lopez 14, Pat Connaughton 12 and Khris Middleton 11 for the Bucks."}
{"game_id": "0022101167", "chunk_id": "0022101167_018", "order": 18, "role": "body", "text": "Mavericks: Maxi Kleber didn’t play due to a sore right ankle. ... Mavericks coach Jason Kidd congratulated former Dallas coach Del Harris for his selection to the Naismith Memorial Hall of Fame on Saturday, but said it’s about time another former Mavericks coach gets honored as well. “We’re all excited for him and his family because he should have been in there a long time ago,” Kidd said before the game. “The next guy we have to try to get in is Dick Motta. He should be in, too, a coach that maybe didn’t do the politic thing, but he came to work every day and so he’s the one that should be in the Hall of Fame next. Hopefully we can get him in.” ... This was Kidd’s first game in Milwaukee as a visiting head coach since the end of his own Bucks tenure. Kidd, who’s in his first season with Dallas, coached the Bucks from 2015-18."}
{"game_id": "0022101167", "chunk_id": "0022101167_019", "order": 19, "role": "body", "text": "Bucks: Antetokounmpo’s season scoring average remained at 30.1 points. He entered the day ranked second in the league to LeBron James (30.3). Philadelphia’s Joel Embiid was averaging 30.0 points. Antetokounmpo has never won the scoring title."}
{"game_id": "0022101167", "chunk_id": "0022101167_021", "order": 21, "role": "body", "text": "The Mavericks were leading 106-101 with 4:47 left when Holiday was called for fouling Doncic on a 3-point attempt. The Bucks challenged the call, but officials determined after looking at the replay that Holiday had made contact with Doncic’s head."}
{"game_id": "0022101167", "chunk_id": "0022101167_022", "order": 22, "role": "body", "text": "Doncic made all three of his ensuing free throws."}
{"game_id": "0022101167", "chunk_id": "0022101167_023", "order": 23, "role": "body", "text": "“Jrue told me after the game, ‘You’re welcome for the haircut,'\" Doncic quipped. “But he got me a little bit, though. I think that’s a foul.”"}
{"game_id": "0022101167", "chunk_id": "0022101167_025", "order": 25, "role": "body", "text": "Mavericks: At Detroit on Wednesday. The Mavericks will be completing a four-game trip before finishing the regular season with two home games."}
{"game_id": "0022101167", "chunk_id": "0022101167_026", "order": 26, "role": "body", "text": "Bucks: At Chicago on Tuesday. The Bucks are 3-0 against the Bulls this season."}
