{"game_id": "0022100947", "chunk_id": "0022100947_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — James Harden is the new kid in town, earning raucous cheers from the moment he steps on the court. Joel Embiid hears wire-to-wire “MVP!” chants from Philly fans begging for a championship."}
{"game_id": "0022100947", "chunk_id": "0022100947_002", "order": 2, "role": "body", "text": "The 76ers are so much more than their dynamic duo."}
{"game_id": "0022100947", "chunk_id": "0022100947_003", "order": 3, "role": "body", "text": "Make room for Tyrese Maxey in Philly's version of a Big 3."}
{"game_id": "0022100947", "chunk_id": "0022100947_004", "order": 4, "role": "body", "text": "Maxey made five 3-pointers and scored 33 points to lead the Philadelphia 76ers to their fifth straight win, 125-119 over the Cleveland Cavaliers on Friday night."}
{"game_id": "0022100947", "chunk_id": "0022100947_005", "order": 5, "role": "body", "text": "“I don't think we look at it as Big 3, Big 2,” Maxey said. “I think we look at it as one unit.”"}
{"game_id": "0022100947", "chunk_id": "0022100947_006", "order": 6, "role": "body", "text": "The 76ers improved to 4-0 with Harden in the lineup. Harden had 25 points and 11 assists. Embiid added 22 points and nine rebounds."}
{"game_id": "0022100947", "chunk_id": "0022100947_007", "order": 7, "role": "body", "text": "Maxey, though, stole the show."}
{"game_id": "0022100947", "chunk_id": "0022100947_008", "order": 8, "role": "body", "text": "“On any given night, it can be any one of us to go off,” Harden said. “Tyrese really picked it up for us tonight.”"}
{"game_id": "0022100947", "chunk_id": "0022100947_009", "order": 9, "role": "body", "text": "The second-year guard out of Kentucky tore through the Cavaliers in the second half and seemingly turned Embiid and Harden into bystanders. His best sequence came in the fourth. Maxey hit a 3 that gave the Sixers a one-point lead, then he drained a 3 off a pass from Harden on the break that made it 110-106 and had the Philly crowd going wild."}
{"game_id": "0022100947", "chunk_id": "0022100947_010", "order": 10, "role": "body", "text": "Harden held his arms high and beckoned the crowd to get even louder."}
{"game_id": "0022100947", "chunk_id": "0022100947_011", "order": 11, "role": "body", "text": "Maxey made 10 of 15 shots (5 of 6 on 3s) and 8 of 9 from the free-throw line with five assists."}
{"game_id": "0022100947", "chunk_id": "0022100947_012", "order": 12, "role": "body", "text": "“He's a fearless kid,” coach Doc Rivers said."}
{"game_id": "0022100947", "chunk_id": "0022100947_013", "order": 13, "role": "body", "text": "Darius Garland scored 26 points and had 19 assists for the Cavaliers, and Isaac Okoro added 22."}
{"game_id": "0022100947", "chunk_id": "0022100947_014", "order": 14, "role": "body", "text": "Harden, who had at least 20 points and 10 assists for the third time in four games, picked up his third foul at 8:32 in the second quarter and took only four shots through three. Yet, he still had 18 points (and nine assists) on the strength of two 3s and 8 of 8 from the free-throw line."}
{"game_id": "0022100947", "chunk_id": "0022100947_015", "order": 15, "role": "body", "text": "“I've got to do a better job of being more solid,” Harden said. “I've got to be more smarter so I can be out there and help my team.\""}
{"game_id": "0022100947", "chunk_id": "0022100947_016", "order": 16, "role": "body", "text": "His fast success with Embiid was expected. But his presence has turned Maxey into a knock-off Allen Iverson since his arrival."}
{"game_id": "0022100947", "chunk_id": "0022100947_017", "order": 17, "role": "body", "text": "Maxey made 76ers fans — and, frankly, the 76ers — forget about Ben Simmons with his play this season."}
{"game_id": "0022100947", "chunk_id": "0022100947_018", "order": 18, "role": "body", "text": "He turned it on in the third quarter and brought the Sixers back from long-range, attacking the net, and even with a nifty pass off the break to Embiid."}
{"game_id": "0022100947", "chunk_id": "0022100947_019", "order": 19, "role": "body", "text": "Maxey hit two 3s and scored 14 points in the quarter to bring the Sixers back from 21 points down to grab a lead late in the third. He buried a 3, then came back right with a 12-footer to make it a three-point deficit. The speedy guard tossed the ball to Embiid for the easy bucket that sent the crowd into a frenzy. He scored 20 points for the fourth straight game, the longest streak of his career -- and all with Harden."}
{"game_id": "0022100947", "chunk_id": "0022100947_020", "order": 20, "role": "body", "text": "But it was Georges Niang who finally gave the Sixers their first lead on a basket and a 3 that made it 97-93."}
{"game_id": "0022100947", "chunk_id": "0022100947_021", "order": 21, "role": "body", "text": "“He's a shooter. That's what he does,” Harden said."}
{"game_id": "0022100947", "chunk_id": "0022100947_022", "order": 22, "role": "body", "text": "The Cavaliers hit their first nine shots and Kevin Love made a pair of 3s to help them race to a 39-18 lead. They have lost six of seven."}
{"game_id": "0022100947", "chunk_id": "0022100947_023", "order": 23, "role": "body", "text": "“We felt and looked like ourselves for the first time in a while,” coach J.B. Bickerstaff said. “We just happened to run into a really good basketball team.”"}
{"game_id": "0022100947", "chunk_id": "0022100947_025", "order": 25, "role": "body", "text": "Cavaliers: Bickerstaff was fined $20,000 by the NBA for his behavior while being ejected from a game on Monday night. The league fined Bickerstaff for using inappropriate language toward the officiating crew and not leaving the court “in a timely manner.”"}
{"game_id": "0022100947", "chunk_id": "0022100947_026", "order": 26, "role": "body", "text": "76ers: Veteran C DeAndre Jordan is expected to join the team Saturday after he signed this week. Jordan’s arrival reunites him with Rivers, who was his coach while with the Los Angeles Clippers. “I hope he recaptures the Lob City days,” Rivers said. “That would be fantastic for us.” The 33-year-old Jordan joins Paul Millsap as a backup center for the Sixers. “We've got a bunch of backups now. He’s just one of them,” Rivers said. “But it’s great to have him.”"}
{"game_id": "0022100947", "chunk_id": "0022100947_028", "order": 28, "role": "body", "text": "Harden hit two 3s and has 2,559 on his career, one shy of matching Reggie Miller for third on the NBA's career list."}
{"game_id": "0022100947", "chunk_id": "0022100947_029", "order": 29, "role": "body", "text": "Bickerstaff coached Harden as an assistant and an interim coach when they were in Houston and raved about his greatness."}
{"game_id": "0022100947", "chunk_id": "0022100947_030", "order": 30, "role": "body", "text": "“He sees the game a step ahead,” he said. “He’s not one of those guys that’s just going so fast he’s waiting for the offense to react. He’s forcing the defense to react. He’s one of the most creative decision makers and passers in our game. He also knows when to make the play that’s right in front of him.”"}
{"game_id": "0022100947", "chunk_id": "0022100947_032", "order": 32, "role": "body", "text": "Garland joined LeBron James and Andre Miller  as the only players in Cavs franchise history with multiple 25-point, 15-assist games in a single season."}
{"game_id": "0022100947", "chunk_id": "0022100947_034", "order": 34, "role": "body", "text": "Cavaliers: Host Toronto on Sunday."}
{"game_id": "0022100947", "chunk_id": "0022100947_035", "order": 35, "role": "body", "text": "76ers: Play Saturday at Eastern Conference-leading Miami."}
