{"game_id": "0022100164", "chunk_id": "0022100164_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Kelly Oubre Jr. scored a season-best 37 points on 13-of-17 shooting and the Charlotte Hornets beat the Memphis Grizzlies 118-108 on Wednesday night to snap a five-game losing streak."}
{"game_id": "0022100164", "chunk_id": "0022100164_002", "order": 2, "role": "body", "text": "“I think I had the same approach that I do every game,” Oubre said. “I just try to go one play at a time. One shot at a time. My first couple (of shots) were good, so the rim opened up. The goal got bigger for me. I was able to find a rhythm early.”"}
{"game_id": "0022100164", "chunk_id": "0022100164_003", "order": 3, "role": "body", "text": "Oubre matched his career high with seven 3-pointers on nine attempts and broke the franchise record for points off the bench."}
{"game_id": "0022100164", "chunk_id": "0022100164_004", "order": 4, "role": "body", "text": "“When Kelly plays like that and our bench plays with that type of efficiency, we’re a different team,” Hornets coach James Borrego said."}
{"game_id": "0022100164", "chunk_id": "0022100164_005", "order": 5, "role": "body", "text": "Gordon Hayward added 25 points for Charlotte. LaMelo Ball, who was coming off a triple-double of 25 points, 15 rebounds and 11 assists Monday night in an overtime loss to the Los Angeles Lakers, fell just short of his second consecutive triple-double with 12 points, nine rebounds and eight assists."}
{"game_id": "0022100164", "chunk_id": "0022100164_006", "order": 6, "role": "body", "text": "Ja Morant led Memphis with 32 points, 19 of them in the first quarter, and eight assists. Dillon Brooks, in his first game of the season after dealing with recovery from a left hand fracture, added 20 points. Jaren Jackson Jr. had 19."}
{"game_id": "0022100164", "chunk_id": "0022100164_007", "order": 7, "role": "body", "text": "Brooks came off the bench, rather than in his usual starting spot. Memphis coach Taylor Jenkins said he wanted to get Brooks into the flow of the game."}
{"game_id": "0022100164", "chunk_id": "0022100164_008", "order": 8, "role": "body", "text": "“It was a little different,” Brooks said. “But I just stayed ready.”"}
{"game_id": "0022100164", "chunk_id": "0022100164_009", "order": 9, "role": "body", "text": "The Hornets led by double digits in the fourth quarter, and were up 102-95 with four minutes left."}
{"game_id": "0022100164", "chunk_id": "0022100164_010", "order": 10, "role": "body", "text": "“We missed open shots,” Morant said. “Shot 23% from 3. … I feel like we had a lot of great looks. Just didn’t go down.”"}
{"game_id": "0022100164", "chunk_id": "0022100164_012", "order": 12, "role": "body", "text": "Hornets: Ball received a flagrant foul 1 in the third quarter on a foul against Morant on a drive. … Outscored Memphis 26-16 in the second quarter. … Miles Bridges was held to 10 points on 3-of-11 shooting. He had nine rebounds and seven assists."}
{"game_id": "0022100164", "chunk_id": "0022100164_013", "order": 13, "role": "body", "text": "Grizzlies: Rookie F Ziaire Williams, who sat out Monday night against Minnesota because of a sore right wrist, also was active against Charlotte, but did not play. ... Desmond Bane has missed his last 15 3-point attempts."}
{"game_id": "0022100164", "chunk_id": "0022100164_015", "order": 15, "role": "body", "text": "Hornets: Host New York on Friday night."}
{"game_id": "0022100164", "chunk_id": "0022100164_016", "order": 16, "role": "body", "text": "Grizzlies: Host Phoenix on Friday night."}
