{"game_id": "0022100921", "chunk_id": "0022100921_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Wendell Carter Jr. had 21 points and 12 rebounds, Markelle Fultz scored 10 points in his return from injury and eight Orlando players scored in double figures as the Magic beat the Indiana Pacers 119-103 on Monday night."}
{"game_id": "0022100921", "chunk_id": "0022100921_002", "order": 2, "role": "body", "text": "“It wasn't like I was out there thinking too much,” said Fultz, who also had six assists in his first game since tearing his left ACL nearly 14 months ago. “My goal was just to go out and play as hard as I can and enjoy the game. With the energy of the crowd and everything, and the adrenaline running, it was great to get the first game under my belt.”"}
{"game_id": "0022100921", "chunk_id": "0022100921_003", "order": 3, "role": "body", "text": "Mo Bamba and Franz Wagner had 15 points apiece for Orlando, which won its second straight."}
{"game_id": "0022100921", "chunk_id": "0022100921_004", "order": 4, "role": "body", "text": "Tyrese Haliburton had 23 points and seven assists for the Pacers. Buddy Hield added 18 points in Indiana's ninth loss in 11 games."}
{"game_id": "0022100921", "chunk_id": "0022100921_005", "order": 5, "role": "body", "text": "Fultz played 16 minutes, and shot 5 for 7 from the field before leaving the game with the Magic up by 16 points in the middle of the fourth quarter."}
{"game_id": "0022100921", "chunk_id": "0022100921_006", "order": 6, "role": "body", "text": "“It was very easy for me to come in and be relaxed, and be myself,” he said."}
{"game_id": "0022100921", "chunk_id": "0022100921_007", "order": 7, "role": "body", "text": "“The stuff I've seen him do in the past, when he was healthy, I was excited just to be on the court with him,” Carter said. \"This was a special one for me and a special one for him. When he gets his legs underneath him a little more, this team is going to be a whole lot better.\""}
{"game_id": "0022100921", "chunk_id": "0022100921_008", "order": 8, "role": "body", "text": "Indiana forward Jalen Smith was ejected after picking up two technical fouls with 7:04 left in the third quarter. The ejection came in the middle of a 14-2 run by the Magic, and the Pacers never recovered."}
{"game_id": "0022100921", "chunk_id": "0022100921_009", "order": 9, "role": "body", "text": "“They hit shots early in the third quarter and we didn't,” Haliburton said. “When you're not hitting shots and not getting stops, it's a recipe for failure. They were the aggressors for the majority of the night, picking us up, getting into us.”"}
{"game_id": "0022100921", "chunk_id": "0022100921_010", "order": 10, "role": "body", "text": "Hield and Duane Washington Jr. hit 3-pointers during a 10-0 run midway through the second quarter that gave the Pacers their biggest lead of the game at 49-38."}
{"game_id": "0022100921", "chunk_id": "0022100921_011", "order": 11, "role": "body", "text": "Carter answered with three dunks to help Orlando finish the half on a 17-7 spurt, and the Magic pulled ahead for keeps when Wagner and Carter opened the second half with a layup and a 3-pointer, respectively."}
{"game_id": "0022100921", "chunk_id": "0022100921_013", "order": 13, "role": "body", "text": "Pacers: Rookie C Isaiah Jackson had all six of his points and all five of his rebounds after sitting down with four fouls with 9:13 left in the third quarter. ... G Malcolm Brogdon (Achilles) and F Lance Stephenson (ankle) did not play, but the Pacers are hopeful of having both back Wednesday night. . . . After hitting 17 of 33 3-point shots in a win over Boston on Sunday, the Pacers made five of their first seven against Orlando, but only 10 of 29 after that."}
{"game_id": "0022100921", "chunk_id": "0022100921_014", "order": 14, "role": "body", "text": "Magic: Fultz's last start for the Magic was on Jan. 6, 2021. He played four minutes in a win against Cleveland that left Orlando with a 6-2 record. The Magic went 15-49 in the remainder of the season, and none of the other starters from that game are still on the roster. ... Coach Jamahl Mosley estimated Fultz will play 16-20 minutes per game, but “we'll see how he feels as he goes through the games.” . . . Carter had double-digit rebounds for the fifth straight game. ... The Magic have not won three straight since Feb. 17-21, 2021."}
{"game_id": "0022100921", "chunk_id": "0022100921_016", "order": 16, "role": "body", "text": "Pacers and Magic play again in Orlando on Wednesday night."}
