{"game_id": "0022100387", "chunk_id": "0022100387_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Jarrett Allen scored 21 points and added 10 rebounds, Darius Garland and Kevin Love also had double-doubles, and the Cleveland Cavaliers used a fast start to cruise 123-106 over the Minnesota Timberwolves on Friday night."}
{"game_id": "0022100387", "chunk_id": "0022100387_002", "order": 2, "role": "body", "text": "Love scored 18 points and had a season-high 13 rebounds off the bench against his former team, and Garland scored 12 points to go with a career-high tying 12 assists. All told, Cleveland had seven players score in double digits: Lauri Markkanen (19), Isaac Okoro (season-high 16), Cedi Osman (13) and Evan Mobley (11)."}
{"game_id": "0022100387", "chunk_id": "0022100387_003", "order": 3, "role": "body", "text": "Winners of two straight and six of eight, Cleveland is one of the surprise teams in the NBA this season at 15-12."}
{"game_id": "0022100387", "chunk_id": "0022100387_004", "order": 4, "role": "body", "text": "“We come into every game with that dog mentality, the underdog,” Okoro said. “I feel teams are starting to respect us now and we got to keep on fighting.”"}
{"game_id": "0022100387", "chunk_id": "0022100387_005", "order": 5, "role": "body", "text": "Karl-Anthony Towns scored 12 of his 21 points in garbage time, Malik Beasley had 15 points off the bench and Anthony Edwards scored 13 for Minnesota, which shot 39.1% from the field and again missed too many layups and other close shots. The Wolves are a combined 60 for 128 on attempts in the paint the past three games."}
{"game_id": "0022100387", "chunk_id": "0022100387_006", "order": 6, "role": "body", "text": "“The start was poor, and the rest of the game was wholly unacceptable. In this league, if you don’t set the tone early, everybody has a good and comfortable night,” coach Chris Finch said."}
{"game_id": "0022100387", "chunk_id": "0022100387_007", "order": 7, "role": "body", "text": "The Cavaliers shot 54.1% from the floor, including 61.5% in the first half in opening a 26-point lead before the break. Cleveland also outrebounded Minnesota 47-40."}
{"game_id": "0022100387", "chunk_id": "0022100387_008", "order": 8, "role": "body", "text": "The Timberwolves have lost five straight. Minnesota averages the second-most 3-point attempts in the league with 42.3 a game, but went a mere 11 of 39 Friday, including 1 of 10 in the opening quarter and 3 of 19 in the first half."}
{"game_id": "0022100387", "chunk_id": "0022100387_009", "order": 9, "role": "body", "text": "Towns is frustrated at his team’s struggles."}
{"game_id": "0022100387", "chunk_id": "0022100387_010", "order": 10, "role": "body", "text": "“The last three games, we’re getting spanked. We’re not losing, we’re getting spanked,” he said. “You can have those little moral victories we’ve been talking about for seven years since I’ve been here. We play well, we just don’t win. We’re the better team, we just didn’t hit shots. That’s not the case. We come in here and getting beat. It’s as simple as that.”"}
{"game_id": "0022100387", "chunk_id": "0022100387_011", "order": 11, "role": "body", "text": "Taking advantage of a decided size advantage, Cleveland used a 14-0 run — four dunks and a pair of 3-pointers — for a 20-4 lead less than five minutes into the game. The lead grew to as much as 26 before intermission. Minnesota got within 18 midway through the third quarter but trailed 92-71 heading to the fourth."}
{"game_id": "0022100387", "chunk_id": "0022100387_012", "order": 12, "role": "body", "text": "“We understand the NBA is a league where a 20-point lead might not be that big actually because teams go on runs,” Markkanen said. “We talked at halftime … that we needed to win the third quarter and have a big start. We can’t start messing around with the game.”"}
{"game_id": "0022100387", "chunk_id": "0022100387_014", "order": 14, "role": "body", "text": "Cavaliers: Since Nov. 1, Cleveland is 7-2 away from home, a 77.8% winning percentage. Only Phoenix (8-1, .889) and Brooklyn (9-2, .818) have better road records in that span. … Former Timberwolves’ G Ricky Rubio had six points and eight assists. … Playing in just his eighth game of the season and first since Nov. 18, 7-foot-6 Tacko Fall scored with 2:55 left to provide one of the biggest roars of the night from the crowd."}
{"game_id": "0022100387", "chunk_id": "0022100387_015", "order": 15, "role": "body", "text": "Timberwolves: Minnesota starters were a combined minus-117. … Although he worked out on the court pregame, PG D’Angelo Russell (right ankle soreness) missed his third straight game."}
{"game_id": "0022100387", "chunk_id": "0022100387_017", "order": 17, "role": "body", "text": "Cavaliers: Host Sacramento on Saturday to open a three-game homestand."}
{"game_id": "0022100387", "chunk_id": "0022100387_018", "order": 18, "role": "body", "text": "Timberwolves: At Portland on Sunday, the first of two straight road contests."}
