{"game_id": "0022100756", "chunk_id": "0022100756_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Nikola Jokic had 18 points, 15 assists and nine rebounds to help the Denver Nuggets rout the Milwaukee Bucks 136-100 on Sunday night."}
{"game_id": "0022100756", "chunk_id": "0022100756_002", "order": 2, "role": "body", "text": "The reigning NBA MVP just missed his 13th triple-double of the season. He matched his season high for assists."}
{"game_id": "0022100756", "chunk_id": "0022100756_003", "order": 3, "role": "body", "text": "“He likes to win,” Bucks coach Mike Budenholzer said about Jokic. “He’s going to do whatever it takes to win. Credit to him.”"}
{"game_id": "0022100756", "chunk_id": "0022100756_004", "order": 4, "role": "body", "text": "Aaron Gordon scored 24 points, Monte Morris had 18 and Will Barton 15 for the Nuggets. They improved to 4-0 on a six-game trip and matched their longest winning streak of the season. Denver has won six of the last seven and 13 of the last 19 road games against Milwaukee."}
{"game_id": "0022100756", "chunk_id": "0022100756_005", "order": 5, "role": "body", "text": "“We had a lot of guys shoot the ball really really well tonight,” Nuggets coach Michael Malone said. “This is a really really good win for us.”"}
{"game_id": "0022100756", "chunk_id": "0022100756_006", "order": 6, "role": "body", "text": "The Nuggets had a season-high 39 assists, four more than they had against the Los Angeles Lakers on Jan. 15."}
{"game_id": "0022100756", "chunk_id": "0022100756_007", "order": 7, "role": "body", "text": "Milwaukee star Giannis Antetokounmpo scored 22 of his 29 points in the first half. He was the MVP in consecutive seasons before Jokic earned that honor last season."}
{"game_id": "0022100756", "chunk_id": "0022100756_008", "order": 8, "role": "body", "text": "Jrue Holiday scored 14 points, and Bobby Portis, who guarded Jokic throughout the contest, added 11 for the Bucks. Grayson Allen finished with 11 points in his second start since serving a one-game suspension for his flagrant foul 2 on the Chicago Bulls’ Alex Caruso that resulted in a fractured right wrist."}
{"game_id": "0022100756", "chunk_id": "0022100756_009", "order": 9, "role": "body", "text": "“Any time you can win all fourth quarters that means your starters are playing really well and your bench is playing really well,” Malone said."}
{"game_id": "0022100756", "chunk_id": "0022100756_010", "order": 10, "role": "body", "text": "Denver took control in the third quarter. The Nuggets led 118-93 when the Bucks called a timeout with 5:55 left to play and cleared the bench."}
{"game_id": "0022100756", "chunk_id": "0022100756_011", "order": 11, "role": "body", "text": "“They were significantly better than us tonight,” Budenholzer said."}
{"game_id": "0022100756", "chunk_id": "0022100756_012", "order": 12, "role": "body", "text": "Jokic passed to Barton, who flipped a no-luck pass to Gordon for an uncontested dunk that capped a 12-5 run and gave Denver a 77-62 lead with 8:27 left in the third quarter. The Bucks immediately called a timeout to figure out how to stop the Nuggets. They never did."}
{"game_id": "0022100756", "chunk_id": "0022100756_013", "order": 13, "role": "body", "text": "“He (Jokic) was sitting there picking us apart,” Holliday said. “We didn't give ourselves a chance to win.”"}
{"game_id": "0022100756", "chunk_id": "0022100756_014", "order": 14, "role": "body", "text": "Milwaukee beat the Nuggets 120-109 in Denver on Nov. 26."}
{"game_id": "0022100756", "chunk_id": "0022100756_016", "order": 16, "role": "body", "text": "Nuggets: Barton was back in the starting lineup after missing two game due to non-COVID illness. … DeMarcus Cousins (sprained right foot) was ruled out. Cousins appeared in 17 games for the Bucks on a non-guaranteed contract, but was waived Jan. 6. The Nuggets signed him to a 10-day contract Jan. 21."}
{"game_id": "0022100756", "chunk_id": "0022100756_017", "order": 17, "role": "body", "text": "Bucks: George Hill (neck soreness) was out."}
{"game_id": "0022100756", "chunk_id": "0022100756_019", "order": 19, "role": "body", "text": "Nuggets: At Minnesota on Tuesday night."}
{"game_id": "0022100756", "chunk_id": "0022100756_020", "order": 20, "role": "closing", "text": "Bucks: Host Washington on Tuesday night."}
