{"game_id": "0022100616", "chunk_id": "0022100616_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Amir Coffey had 18 points, Reggie Jackson scored 11 of his 13 in the fourth quarter and the Los Angeles Clippers rallied from a 25-point deficit in the second half for a stunning 87-85 victory over the Denver Nuggets on Tuesday night."}
{"game_id": "0022100616", "chunk_id": "0022100616_002", "order": 2, "role": "body", "text": "Terance Mann scored nine of his 13 points in the fourth quarter for Los Angeles, which won for the fourth time in 10 games since Paul George joined Kawhi Leonard on its lengthy injured list. The Clippers won despite managing a meager 28 points in the lowest-scoring first half in the NBA this season and then falling behind 59-34 midway through the third period."}
{"game_id": "0022100616", "chunk_id": "0022100616_003", "order": 3, "role": "body", "text": "Denver scored just seven points in the next 10 minutes, allowing the Clippers to mount their improbable comeback. Los Angeles tied it on Jackson’s jumper with 7:03 to play and went ahead on his 3-pointer moments later. And after the Clippers fell behind again, Jackson brought fans to their feet when he dunked on Nikola Jokic with 4:12 left."}
{"game_id": "0022100616", "chunk_id": "0022100616_004", "order": 4, "role": "body", "text": "“That game was ugly early,” said Jackson, who missed eight of his first nine shots. “Most of the game was ugly, the first three quarters. We just stayed ready, stayed in it. The team stayed in the fight, stayed confident and continued to have success. It just gave me a chance to make some plays, and we stayed calm. It was hard.”"}
{"game_id": "0022100616", "chunk_id": "0022100616_005", "order": 5, "role": "body", "text": "After Jokic got back-to-back buckets to put Denver back on top, Coffey’s 3-pointer with 2:30 left pushed the Clippers ahead for good. Nicolas Batum hit a 3 on the next possession, and Jokic missed a long 3-pointer right before the buzzer — the Nuggets' 29th miss on 33 attempts from 3-point territory."}
{"game_id": "0022100616", "chunk_id": "0022100616_006", "order": 6, "role": "body", "text": "“Maybe we get relaxed,” Jokic said. “Maybe we think it’s going to be easy. I don’t know. Something happens, especially when we make four 3s. It’s really hard for us to do anything.\""}
{"game_id": "0022100616", "chunk_id": "0022100616_007", "order": 7, "role": "body", "text": "Aaron Gordon scored a season-high 30 points and Jokic had 21 points, 13 rebounds and eight assists for the Nuggets, who couldn't overcome a long stretch of ineptitude spanning the final two quarters."}
{"game_id": "0022100616", "chunk_id": "0022100616_008", "order": 8, "role": "body", "text": "Gordon had his highest-scoring performance since joining the Nuggets last March, but Jokic hit only three shots in the fourth quarter with the Clippers focused on keeping the ball away from him."}
{"game_id": "0022100616", "chunk_id": "0022100616_009", "order": 9, "role": "body", "text": "“Probably even more important than the turnovers is we have a really good player that we can’t get the ball to,” Denver coach Michael Malone said. “We had a lot of guys that looked a little nervous out there as they turned up the pressure. Anytime you lose a game where you led by 25 points in the second half is unacceptable. ... But if you can’t get Nikola Jokic the basketball, that’s a big, big problem.”"}
{"game_id": "0022100616", "chunk_id": "0022100616_010", "order": 10, "role": "body", "text": "The Clippers’ supporting cast has back-to-back victories without both of the team's cornerstones. Los Angeles also played without Luke Kennard and Justise Winslow, who are in the NBA’s health and safety protocols."}
{"game_id": "0022100616", "chunk_id": "0022100616_011", "order": 11, "role": "body", "text": "“We just kept chipping away,” Coffey said. “Just trying to throw some different coverages at Jokic, mess him up. Just trying to finish possessions with rebounds. ... We just got it clicking there late in the third and took it over to the fourth.”"}
{"game_id": "0022100616", "chunk_id": "0022100616_013", "order": 13, "role": "body", "text": "Nuggets: Played without Will Barton, who entered the health and safety protocols Monday. Rodney McGruder also was inactive one day after Denver acquired him from Detroit in a trade for Bol Bol. ... Austin Rivers started and scored four points after being briefly hospitalized after an unspecified allergic reaction Monday, Malone said."}
{"game_id": "0022100616", "chunk_id": "0022100616_014", "order": 14, "role": "body", "text": "Clippers: Kennard has missed six straight games, and Winslow joined him this week. ... Isaiah Hartenstein missed his 12th straight game with a left ankle injury. ... Actor Paul Walter Hauser (\"Cobra Kai\") was the guest host of the game, wearing a No. 33 jersey with his name on the back as he pumped up the crowd and threw a few karate kicks at Chuck the Condor."}
{"game_id": "0022100616", "chunk_id": "0022100616_016", "order": 16, "role": "body", "text": "Jamal Murray and Michael Porter Jr. both got some shots up during early pregame warmups. Murray had surgery to repair a torn knee ligament last April, and Porter had back surgery in December. Neither is close to a return, but Denver hopes both will play in the second half of the season."}
{"game_id": "0022100616", "chunk_id": "0022100616_018", "order": 18, "role": "body", "text": "Malone was asked how the Nuggets responded to the loss: “I don't know. ... Losses like this keep me awake for weeks. I think today’s NBA player, they’re worrying about where they’re going out tonight, or what’s going to happen.”"}
{"game_id": "0022100616", "chunk_id": "0022100616_020", "order": 20, "role": "body", "text": "Nuggets: Host the Portland Trail Blazers on Thursday."}
{"game_id": "0022100616", "chunk_id": "0022100616_021", "order": 21, "role": "body", "text": "Clippers: At the New Orleans Pelicans on Thursday."}
