{"game_id": "0022100430", "chunk_id": "0022100430_001", "order": 1, "role": "lead", "text": "TORONTO -- — Pascal Siakam had 25 points and 13 rebounds, Chris Boucher added 16 points and 10 rebounds, and the Toronto Raptors beat the Chicago Bulls 127-120 in overtime on Thursday night."}
{"game_id": "0022100430", "chunk_id": "0022100430_002", "order": 2, "role": "body", "text": "Scottie Barnes scored 21 points, including the go-ahead basket with 1:44 left in OT, and Gary Trent Jr. added a decisive 3-pointer with 16 seconds remaining."}
{"game_id": "0022100430", "chunk_id": "0022100430_003", "order": 3, "role": "body", "text": "Trent scored 16 points, ending his career-best streak of 30-point games at five."}
{"game_id": "0022100430", "chunk_id": "0022100430_004", "order": 4, "role": "body", "text": "Fred VanVleet and OG Anunoby each scored 21 as Toronto won its fourth straight overall and snapped a five-game losing streak against the Bulls."}
{"game_id": "0022100430", "chunk_id": "0022100430_005", "order": 5, "role": "body", "text": "“They out-physicalled us throughout the whole game,” Chicago’s Zach LaVine said."}
{"game_id": "0022100430", "chunk_id": "0022100430_006", "order": 6, "role": "body", "text": "Toronto finished with 113 field goal attempts, while the Bulls had 90. The Raptors also had 22 offensive rebounds, compared to 10 for Chicago."}
{"game_id": "0022100430", "chunk_id": "0022100430_007", "order": 7, "role": "body", "text": "Chicago committed 17 turnovers, leading to 22 points for the Raptors."}
{"game_id": "0022100430", "chunk_id": "0022100430_008", "order": 8, "role": "body", "text": "“It’s difficult because they have guys that have a lot of length and agility. They move really well and they cover a lot of space,” Bulls center Nikola Vucevic said. “Obviously tonight, turnovers and then the offensive glass, we didn’t do a good job on that end.”"}
{"game_id": "0022100430", "chunk_id": "0022100430_009", "order": 9, "role": "body", "text": "Vucevic matched his season high with 30 points and had 18 rebounds, his ninth double-double in 10 games."}
{"game_id": "0022100430", "chunk_id": "0022100430_010", "order": 10, "role": "body", "text": "“I feel that I’ve been able to find my rhythm,” Vucevic said."}
{"game_id": "0022100430", "chunk_id": "0022100430_011", "order": 11, "role": "body", "text": "DeMar DeRozan scored 28 points against his former team. Coby White had 16 points, LaVine had 15, Javonte Green 13 and Ayo Dosunmu 11 for the Bulls, who came in as the Eastern Conference leaders."}
{"game_id": "0022100430", "chunk_id": "0022100430_012", "order": 12, "role": "body", "text": "“When we had the floor spaced correctly, we got a lot of good things,” Bulls coach Billy Donovan said. “When we did not have the floor spaced correctly, we kind of got up against it.”"}
{"game_id": "0022100430", "chunk_id": "0022100430_013", "order": 13, "role": "body", "text": "LaVine said he played through back spasms for the second game in a row."}
{"game_id": "0022100430", "chunk_id": "0022100430_014", "order": 14, "role": "body", "text": "“It hurts,” he said. “That’s what happens when you play a 42-minute game with back spasms.”"}
{"game_id": "0022100430", "chunk_id": "0022100430_015", "order": 15, "role": "body", "text": "The Raptors led 103-93 after VanVleet’s 3 with 5:50 to go in regulation, but DeRozan tied it at 112 on a jump shot with 47 seconds left, capping a personal six-point run."}
{"game_id": "0022100430", "chunk_id": "0022100430_016", "order": 16, "role": "body", "text": "VanVleet lost the ball out of bounds and, after the officials initially ruled in Toronto’s favor, Chicago successfully challenged and got possession, taking the lead on Vucecvic’s basket with 8.6 seconds left."}
{"game_id": "0022100430", "chunk_id": "0022100430_017", "order": 17, "role": "body", "text": "VanVleet came up empty on a driving shot attempt at the other end, but Barnes tipped in the missed shot to tie it with 0.7 seconds left. Vucevic got a final shot off, but didn’t come close."}
{"game_id": "0022100430", "chunk_id": "0022100430_018", "order": 18, "role": "body", "text": "Toronto led 26-24 after one, and got nine points from Siakam to extend its lead to 54-50 at halftime."}
{"game_id": "0022100430", "chunk_id": "0022100430_019", "order": 19, "role": "body", "text": "Vucevic scored 10 points in the third but VanVleet answered with nine for Toronto as the Raptors took an 87-81 lead to the fourth. The Raptors shot 4 for 17 from 3-point range in the first half but went 6 for 11 from distance in the third."}
{"game_id": "0022100430", "chunk_id": "0022100430_021", "order": 21, "role": "body", "text": "VanVleet’s teammates mobbed him in celebration on the court before the game when he was named an All Star reserve. Fellow All-Star DeRozan, his former Raptors teammate, also came over for a hug."}
{"game_id": "0022100430", "chunk_id": "0022100430_022", "order": 22, "role": "body", "text": "“It’s a special moment for me and my family,” VanVleet said."}
{"game_id": "0022100430", "chunk_id": "0022100430_023", "order": 23, "role": "body", "text": "He is the NBA’s first undrafted All-Star since Ben Wallace in 2006."}
{"game_id": "0022100430", "chunk_id": "0022100430_024", "order": 24, "role": "body", "text": "“It’s an incredible story and it keeps getting better,” Raptors coach Nick Nurse said."}
{"game_id": "0022100430", "chunk_id": "0022100430_026", "order": 26, "role": "body", "text": "Bulls: Played their first OT game of the season. … Vucevic had 12 points and 10 rebounds in the first half. … DeRozan went 14 for 14 at the free throw line."}
{"game_id": "0022100430", "chunk_id": "0022100430_027", "order": 27, "role": "body", "text": "Raptors: Precious Achiuwa had 11 rebounds. … VanVleet had nine assists. … Wearing a protective face shield, C Khem Birch returned to the lineup for the first time since fracturing his nose in a Jan. 14 loss at Detroit. … Siakam leads the Raptors with 15 double-doubles."}
{"game_id": "0022100430", "chunk_id": "0022100430_029", "order": 29, "role": "body", "text": "Bulls: Visit Indiana on Friday."}
{"game_id": "0022100430", "chunk_id": "0022100430_030", "order": 30, "role": "body", "text": "Raptors: Host Atlanta on Friday."}
