{"game_id": "0022100969", "chunk_id": "0022100969_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Joel Embiid had 43 points and 14 rebounds, and the Philadelphia 76ers beat the Chicago Bulls 121-106 Monday night in a showdown between two of the Eastern Conference’s top teams headed in opposite directions."}
{"game_id": "0022100969", "chunk_id": "0022100969_002", "order": 2, "role": "body", "text": "James Harden added 16 points and 14 assists, and Tyrese Maxey added 17 points for the 76ers, who have won six of seven and stayed perfect with Harden in the lineup."}
{"game_id": "0022100969", "chunk_id": "0022100969_003", "order": 3, "role": "body", "text": "The 76ers improved to 5-0 with Harden since the blockbuster deal at the trade deadline that sent Ben Simmons to the Nets in exchange for the 2017-18 MVP. Harden sat out Philadelphia’s 99-82 loss at Miami on Saturday to rest his hamstring."}
{"game_id": "0022100969", "chunk_id": "0022100969_004", "order": 4, "role": "body", "text": "“It’s fun,” Embiid said. “He just makes the game easy for everybody.”"}
{"game_id": "0022100969", "chunk_id": "0022100969_005", "order": 5, "role": "body", "text": "Harden is averaging 24.6 points, 12.4 assists and 7.4 rebounds as a member of the 76ers."}
{"game_id": "0022100969", "chunk_id": "0022100969_006", "order": 6, "role": "body", "text": "“Like a dream come true,” said Georges Niang, who scored 14 points and hit four 3-pointers, three of which Harden assisted."}
{"game_id": "0022100969", "chunk_id": "0022100969_007", "order": 7, "role": "body", "text": "Harden set up 76ers for open shots and driving dunks, like Embiid’s slam with 6:31 left in the third and Matisse Thybulle’s jam with 1:51 to play."}
{"game_id": "0022100969", "chunk_id": "0022100969_008", "order": 8, "role": "body", "text": "“He’s teaching me on the fly,” Thybulle said."}
{"game_id": "0022100969", "chunk_id": "0022100969_009", "order": 9, "role": "body", "text": "Embiid, the league’s leading scorer, made 15 of 27 field goals and 12 of 16 free throws."}
{"game_id": "0022100969", "chunk_id": "0022100969_010", "order": 10, "role": "body", "text": "“Joel had it going the whole night, which obviously makes the game a little easier for everybody,” Harden said."}
{"game_id": "0022100969", "chunk_id": "0022100969_011", "order": 11, "role": "body", "text": "The MVP frontrunner scored at least 40 points for the 10th time this season while upping his season average to 29.7 points per contest."}
{"game_id": "0022100969", "chunk_id": "0022100969_012", "order": 12, "role": "body", "text": "“Just being aggressive,” Embiid said. “The last two games I’ve had bad starts, so I wanted to be aggressive and live in the paint.”"}
{"game_id": "0022100969", "chunk_id": "0022100969_013", "order": 13, "role": "body", "text": "Zach Lavine scored 24 points and DeMar DeRozan added 23 points and 11 rebounds for the Bulls, who have lost five in a row."}
{"game_id": "0022100969", "chunk_id": "0022100969_014", "order": 14, "role": "body", "text": "The Bulls couldn’t beat the 76ers without Harden, and it certainly didn’t get any easier with the 10-time All-Star point guard directing Philadelphia’s offense."}
{"game_id": "0022100969", "chunk_id": "0022100969_015", "order": 15, "role": "body", "text": "“He’s a guy that has gotten a huge reputation, rightfully so, of being an incredible scorer; I also think he’s very unselfish,” Bulls coach Billy Donovan said of Harden. “He’s a pass-first kind of guy. I think he gets a lot of pleasure out of that.”"}
{"game_id": "0022100969", "chunk_id": "0022100969_017", "order": 17, "role": "body", "text": "Harden tied Reggie Miller for third on the career 3-pointers list, draining No. 2,560 with his patented step-back move with 1:09 left in the first quarter. With Tony Brown Jr. guarding him, Harden dribbled behind his back, then got the crowd buzzing by putting the ball between his legs four times before stepping back to the 3-point line and swishing the long-range shot."}
{"game_id": "0022100969", "chunk_id": "0022100969_019", "order": 19, "role": "body", "text": "The Bulls have had trouble against the conference’s elite and dropped to 0-9 versus Miami, Philadelphia and Milwaukee — the three teams ahead of them in the standings. Philadelphia began play tied with the Bucks for second in the East, three games back of the Heat. The 76ers ended the season series with Chicago with a four-game sweep."}
{"game_id": "0022100969", "chunk_id": "0022100969_021", "order": 21, "role": "body", "text": "DeAndre Jordan received a loud ovation when he entered for his 76ers' debut with 55.6 seconds left in the first quarter. The veteran center was signed by Philadelphia last week to back up Embiid. He had two points and three rebounds in 10:24."}
{"game_id": "0022100969", "chunk_id": "0022100969_023", "order": 23, "role": "body", "text": "Bulls: The Bulls were without third-leading scorer (17.9 ppg) and top rebounder (9.6 rpg) Nikola Vucevic due to hamstring tightness. ... Lonzo Ball (left knee surgery), Patrick Williams (wright) and Alex Caruso (wrist) worked out on Sunday during practice, but did not participate in any contact."}
{"game_id": "0022100969", "chunk_id": "0022100969_024", "order": 24, "role": "body", "text": "76ers: Danny Green injured his left middle finger late in the first half and didn’t return."}
{"game_id": "0022100969", "chunk_id": "0022100969_026", "order": 26, "role": "body", "text": "Bulls: Hall of Famer Mo Cheeks, whose retired No. 10 76ers jersey hangs in the rafters, is an assistant coach for Chicago. ... Dropped to 15-16 on the road."}
{"game_id": "0022100969", "chunk_id": "0022100969_027", "order": 27, "role": "body", "text": "76ers: Paul Millsap (personal reasons) was not in attendance. ... Harden trails Ray Allen (2,973) and Steph Curry (3,101 entering Monday) for most 3-pointers made. ... Harden also went 5 of 6 from the free-throw line and passed Paul Pierce for ninth all-time in free throws made. ... Moved within 11 wins of reaching 3,000 all-time, which only Boston and the Lakers have accomplished in NBA history."}
{"game_id": "0022100969", "chunk_id": "0022100969_029", "order": 29, "role": "body", "text": "Bulls: At Detroit on Wednesday."}
{"game_id": "0022100969", "chunk_id": "0022100969_030", "order": 30, "role": "body", "text": "76ers: Host Brooklyn on Thursday."}
