{"game_id": "0022100190", "chunk_id": "0022100190_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Darius Garland made two free throws with 9.4 seconds left and the Cleveland Cavaliers rallied from 19 points down in the third quarter to stun the Boston Celtics 91-89 on Saturday night in the opener of a two-game set."}
{"game_id": "0022100190", "chunk_id": "0022100190_002", "order": 2, "role": "body", "text": "Dennis Schroder had an opportunity to force overtime for Boston, but missed a jumper from the right baseline as time expired. There were five lead changes and seven ties in the final seven minutes."}
{"game_id": "0022100190", "chunk_id": "0022100190_003", "order": 3, "role": "body", "text": "“There is no basketball reason why we should have won, but there was a collective spirit,” Cavaliers coach J.B. Bickerstaff said. “Momentum is a hell of a thing. When you start to ride that wave in either direction, it changes the game.”"}
{"game_id": "0022100190", "chunk_id": "0022100190_004", "order": 4, "role": "body", "text": "The teams will meet again Monday at Rocket Mortgage FieldHouse."}
{"game_id": "0022100190", "chunk_id": "0022100190_005", "order": 5, "role": "body", "text": "The Celtics built their largest lead at 72-53 with 3:05 left in the third, but the Cavaliers answered with a 24-4 run to go ahead 77-76 on Ricky Rubio’s free throw with 6:43 remaining in the game."}
{"game_id": "0022100190", "chunk_id": "0022100190_006", "order": 6, "role": "body", "text": "Garland finished with 22 points and six assists, rookie Evan Mobley had 19 points, nine rebounds and three blocks, and Rubio had 16 points and seven assists. Cleveland has won six of its last seven and is off to its best start in five years at 9-5."}
{"game_id": "0022100190", "chunk_id": "0022100190_007", "order": 7, "role": "body", "text": "“We’re here and we’re not a slouch anymore,” Garland said. “We’ve got a lot of heart and we never quit. My teammates trust me to make the plays, so I give them the praise.”"}
{"game_id": "0022100190", "chunk_id": "0022100190_008", "order": 8, "role": "body", "text": "Schroder scored 28 points and gave Boston its final advantage at 87-85 on a drive with 1:59 left. Jayson Tatum scored 21 points and tied the score with a pull-up basket with 30 seconds remaining, but shot just 8 of 22 and was 1 of 8 on 3-pointers."}
{"game_id": "0022100190", "chunk_id": "0022100190_009", "order": 9, "role": "body", "text": "The Celtics had their two-game win streak snapped and failed to move over .500 for the first time this season. Robert Williams III collected 12 points and 16 rebounds, and Marcus Smart had eight assists and five steals for Boston."}
{"game_id": "0022100190", "chunk_id": "0022100190_010", "order": 10, "role": "body", "text": "“Jayson showed frustration on his shots, but you’ve got to play through that,” Celtics coach Ime Udoka said. “He had some turnovers late -- some sloppy ones -- but he has to find a way to affect the game in a positive way when his shot isn’t falling.”"}
{"game_id": "0022100190", "chunk_id": "0022100190_011", "order": 11, "role": "body", "text": "Jarrett Allen had 11 points and eight rebounds, and Cedi Osman scored nine points off the bench for Cleveland, which played in front of its first home sellout crowd since March 7, 2020."}
{"game_id": "0022100190", "chunk_id": "0022100190_012", "order": 12, "role": "body", "text": "The Cavaliers’ comeback occurred after their lowest scoring quarter (9 in the first) and half (38 in the first) of the season."}
{"game_id": "0022100190", "chunk_id": "0022100190_013", "order": 13, "role": "body", "text": "“We were just dancing in the locker room because it was a great game,” Osman said, smiling broadly. “We have the best fans in the world, man. It was like a playoff game tonight. The atmosphere was amazing.”"}
{"game_id": "0022100190", "chunk_id": "0022100190_014", "order": 14, "role": "body", "text": "Both teams played on back-to-back nights, having hosted games Friday. Schroder scored a season-high 38 points as Boston beat NBA champion Milwaukee 122-113 in overtime, while Cleveland routed Detroit 98-78."}
{"game_id": "0022100190", "chunk_id": "0022100190_015", "order": 15, "role": "body", "text": "The Celtics were up 52-38 at halftime when Williams slammed an alley-oop from Smart just before the buzzer. Schroder scored 19 points and Williams had eight points and eight rebounds."}
{"game_id": "0022100190", "chunk_id": "0022100190_016", "order": 16, "role": "body", "text": "“We’ve got to play for 48 minutes,” Schroder said. “It’s the NBA, everybody makes runs. It’s about how your respond. They did a great job, give them props.”"}
{"game_id": "0022100190", "chunk_id": "0022100190_017", "order": 17, "role": "body", "text": "Garland was the Cavaliers’ offense in the opening half with 18 points and four assists, accounting for 10 of their 12 baskets. The rest of the team missed 21 of their first 23 field goal attempts."}
{"game_id": "0022100190", "chunk_id": "0022100190_018", "order": 18, "role": "body", "text": "Grant Williams had six points on a pair of 3-pointers in the first as Boston seized a 20-9 lead. Cleveland shot 3 of 20 with six turnovers."}
{"game_id": "0022100190", "chunk_id": "0022100190_020", "order": 20, "role": "body", "text": "Celtics: C Al Horford (back stiffness) was a pregame scratch after working out on the court. … All-Star G Jaylen Brown (right hamstring strain) missed his fourth straight game. Coach Ime Udoka said Brown will be evaluated next week, but remains on track to return this month. … G Josh Richardson (knee soreness) and G Brodric Thomas (left shoulder sprain) were inactive. Richardson played 28 minutes Friday."}
{"game_id": "0022100190", "chunk_id": "0022100190_021", "order": 21, "role": "body", "text": "Cavaliers: F Kevin Love has been cleared to rejoin his teammates, but F Lauri Markanen remains in the NBA’s health and safety protocols. Love sat out his seventh straight game as he works on his conditioning, while Markkanen has been sidelined for six games. … G Collin Sexton (left meniscus tear) is out indefinitely and F Lamar Stevens (right ankle sprain) was unavailable after being hurt Friday against Detroit."}
