{"game_id": "0022101073", "chunk_id": "0022101073_001", "order": 1, "role": "lead", "text": "DETROIT -- — Brandon Williams scored 23 points and Ben McLemore added 21 as the patchwork Portland Trail Blazers ended a four-game losing streak with a 119-115 win over the Detroit Pistons on Monday night."}
{"game_id": "0022101073", "chunk_id": "0022101073_002", "order": 2, "role": "body", "text": "Detroit, which trailed by 23 points in the third period, took a 106-105 lead on Luka Garza's free throw with 5:02 to play before Portland responded with a 7-2 run."}
{"game_id": "0022101073", "chunk_id": "0022101073_003", "order": 3, "role": "body", "text": "Cade Cunningham had two key turnovers down the stretch, and Williams' layup put the Trail Blazers up 116-112 with 47.8 seconds to go."}
{"game_id": "0022101073", "chunk_id": "0022101073_004", "order": 4, "role": "body", "text": "“You can't turn the ball over 19 times for 30 points and expect to win games in this league,” Pistons coach Dwane Casey said. “A lot of those were live-ball turnovers, and there's no way to defend those.”"}
{"game_id": "0022101073", "chunk_id": "0022101073_005", "order": 5, "role": "body", "text": "The Pistons turned the ball over, and although Kris Dunn missed a 3-pointer, Justise Winslow got the rebound and Williams made it 118-112 with two free throws."}
{"game_id": "0022101073", "chunk_id": "0022101073_006", "order": 6, "role": "body", "text": "Williams finished 11 for 11 from the free-throw line. That pleased his coach."}
{"game_id": "0022101073", "chunk_id": "0022101073_007", "order": 7, "role": "body", "text": "“I've missed some free throws in the last few games, and Chauncey (Billups) always tells me that the reason they are called free throws is that they are free points,” he said. “He never missed from the line when he was playing, so having a game like this means I can look him in the face again.”"}
{"game_id": "0022101073", "chunk_id": "0022101073_008", "order": 8, "role": "body", "text": "The teams combined for an NBA season-high 90 free throws."}
{"game_id": "0022101073", "chunk_id": "0022101073_009", "order": 9, "role": "body", "text": "Portland, which was coming off a 129-98 loss to Indiana on Sunday, had lost 10 of 11 and was missing its top seven scorers this season."}
{"game_id": "0022101073", "chunk_id": "0022101073_010", "order": 10, "role": "body", "text": "“We got our butts whupped last night, but we were able to come out here and get a win against another really young team,\" McLemore said. “I think we had a lot of energy and we played really hard.”"}
{"game_id": "0022101073", "chunk_id": "0022101073_011", "order": 11, "role": "body", "text": "Cunningham and Saddiq Bey scored 25 apiece for the Pistons, who lost for the sixth time in seven games. Cunningham finished with nine turnovers, including eight in the second half."}
{"game_id": "0022101073", "chunk_id": "0022101073_012", "order": 12, "role": "body", "text": "“There's never an acceptable turnover, but especially not nine of them,” he said. “That's giving away points when we are trying to rally down the stretch.”"}
{"game_id": "0022101073", "chunk_id": "0022101073_013", "order": 13, "role": "body", "text": "Billups, who won a championship as Detroit's point guard in 2004, likes what he sees from Cunningham."}
{"game_id": "0022101073", "chunk_id": "0022101073_014", "order": 14, "role": "body", "text": "“I think he's going to be a star in this league,” he said. “He can do it all, he's got great size and he plays with a level of patience and confidence that you love from a young guy.”"}
{"game_id": "0022101073", "chunk_id": "0022101073_015", "order": 15, "role": "body", "text": "The Trail Blazers didn't look like a tired team in the first half, leading by as many as 17 points on their way to a 67-52 advantage at the intermission. Portland outshot Detroit 53.5% to 34.8%, including 42.9% to 11.1% on 3-pointers. McLemore had 16 points, including four 3-pointers."}
{"game_id": "0022101073", "chunk_id": "0022101073_016", "order": 16, "role": "body", "text": "Portland pushed its lead to 23 points at 79-56 early in the third quarter."}
{"game_id": "0022101073", "chunk_id": "0022101073_017", "order": 17, "role": "body", "text": "“We came out relaxed and they jumped all over us,” Cunningham said. “I'm not sure what happened, but we have to be ready to play at the start of the game, not in the second half.”"}
{"game_id": "0022101073", "chunk_id": "0022101073_018", "order": 18, "role": "body", "text": "Detroit finally started getting some stops, and closed within 95-88 entering the fourth."}
{"game_id": "0022101073", "chunk_id": "0022101073_020", "order": 20, "role": "body", "text": "Blazers: Billups, whose No. 1 jersey hangs from the rafters at Little Caesars Arena near the 2004 NBA championship banner, paid tribute to longtime Pistons broadcaster George Blaha. Blaha, who joined the team in 1976, will miss the rest of the season after heart surgery. “I just want to send my love to one of the best to ever do it. I hate that I'm not going to be able to see him today and give him a big squeeze.”"}
{"game_id": "0022101073", "chunk_id": "0022101073_021", "order": 21, "role": "body", "text": "Pistons: The teams joined arms before the game to honor the victims of Russia's invasion of Ukraine and a local choir performed the Ukrainian national anthem."}
{"game_id": "0022101073", "chunk_id": "0022101073_023", "order": 23, "role": "body", "text": "Trail Blazers: Host the San Antonio Spurs on Wednesday."}
{"game_id": "0022101073", "chunk_id": "0022101073_024", "order": 24, "role": "body", "text": "Pistons: Host the Atlanta Hawks on Wednesday."}
