{"game_id": "0022100706", "chunk_id": "0022100706_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Anthony Edwards scored 25 points, D’Angelo Russell had 23 points and 10 assists, and the Minnesota Timberwolves defeated the Brooklyn Nets 136-125 on Sunday night."}
{"game_id": "0022100706", "chunk_id": "0022100706_002", "order": 2, "role": "body", "text": "Karl-Anthony Towns overcame a poor shooting night, scoring 15 of his 23 points in the fourth quarter as the Wolves put the game away, winning for the third time in four games."}
{"game_id": "0022100706", "chunk_id": "0022100706_003", "order": 3, "role": "body", "text": "“It doesn’t have to be me every night,” said Towns, Minnesota's leading scorer and rebounder. “That’s why we have great talents like D’Angelo Russell and Anthony Edwards. You’ve got to be able to lean on them. They can carry the load just as well as myself.”"}
{"game_id": "0022100706", "chunk_id": "0022100706_004", "order": 4, "role": "body", "text": "Minnesota also got strong contributions from their role players. Jaylen Nowell scored 16 points, Taurean Prince had 15, and Jaden McDaniels added 14. The three went 18 for 26 from the floor, including a perfect 6-for-6 night from Prince."}
{"game_id": "0022100706", "chunk_id": "0022100706_005", "order": 5, "role": "body", "text": "“Those guys are coming in, bringing their own energy and spice to the game,” Russell said. “That takes the pressure off everybody.”"}
{"game_id": "0022100706", "chunk_id": "0022100706_006", "order": 6, "role": "body", "text": "Kyrie Irving scored a game-high 30 points for the Nets, while Patty Mills hit five 3-pointers on the way to 21 points. Kessler Edwards added 15 points, and James Harden had 13 points and 13 assists for Brooklyn, which is 2-2 since losing leading scorer Kevin Durant to a sprained ligament in his left knee."}
{"game_id": "0022100706", "chunk_id": "0022100706_007", "order": 7, "role": "body", "text": "“I don’t know that we gave enough resistance, weren’t into the body enough,” Nets coach Steve Nash said. \"Didn’t feel like our will, our force, was felt defensively. Whatever it was, we didn’t have the juice down there tonight. ... We tried to find a way to hang in and see if we could get on a run defensively. We just never did.”"}
{"game_id": "0022100706", "chunk_id": "0022100706_008", "order": 8, "role": "body", "text": "Minnesota led by as much as 15 in the third quarter before a late surge pulled the Nets to within seven heading into the fourth. Then Towns went to work, hitting a pair of 3-pointers and converting a three-point play as part of his huge fourth quarter."}
{"game_id": "0022100706", "chunk_id": "0022100706_009", "order": 9, "role": "body", "text": "The Nets dominated the boards, outrebounding Minnesota 16-5 in the first quarter and 48-37 overall. But after shooting over 55% in the first quarter, Brooklyn turned ice-cold, hitting just 8 of 24 shots from the floor in the second quarter."}
{"game_id": "0022100706", "chunk_id": "0022100706_010", "order": 10, "role": "body", "text": "Meanwhile, Russell led Minnesota with 17 points in the first half as the Wolves shot 56.8% from the floor to take a 72-62 lead at the break."}
{"game_id": "0022100706", "chunk_id": "0022100706_012", "order": 12, "role": "body", "text": "NBA officials have been cracking down this year on offensive players making moves that appear solely designed to create contact and draw fouls. Harden has been considered the poster child of this rule, and his coach is getting frustrated about the treatment his star guard sometimes receives."}
{"game_id": "0022100706", "chunk_id": "0022100706_013", "order": 13, "role": "body", "text": "“I think there’s nights where it’s fair, even including the points of emphasis this year,\" Nash said. “There’s other nights where it feels like he gets targeted the whole night. He just automatically gets lumped into the point of emphasis where he’s creating the foul, which is not always the case at all.”"}
{"game_id": "0022100706", "chunk_id": "0022100706_014", "order": 14, "role": "body", "text": "Harden indicated he's more concerned that Nets opponents aren't receiving the same scrutiny, and he's just hoping to see the rule called consistently."}
{"game_id": "0022100706", "chunk_id": "0022100706_015", "order": 15, "role": "body", "text": "“Obviously you can’t call all of them, but there’s ones where there’s a clear stiff-arm and trips and things like that,” Harden said. “But on the other end, there’s no consistency. So, it’s frustrating.”"}
{"game_id": "0022100706", "chunk_id": "0022100706_016", "order": 16, "role": "body", "text": "He also said he hasn't heard much of an explanation from officials regarding some of the disputed foul calls."}
{"game_id": "0022100706", "chunk_id": "0022100706_017", "order": 17, "role": "body", "text": "“Nothing, honestly. Like, ‘I didn’t see it’ or ‘I didn’t think it was a foul.’ But it’s clear, like extremely clear,” Harden said. “But I've got to keep going. That’s not going to stop me. Keep getting to the basket, keep being aggressive and keep making plays for my team.”"}
{"game_id": "0022100706", "chunk_id": "0022100706_019", "order": 19, "role": "body", "text": "Minnesota caught a huge break early in the fourth quarter, just after Irving made two free throws to cut the lead to 106-102. On the next Wolves' possession, a wild pass was headed out of bounds when it deflected off referee Curtis Blair."}
{"game_id": "0022100706", "chunk_id": "0022100706_020", "order": 20, "role": "body", "text": "Josh Okogie recovered the loose ball just before it crossed the half-court line. As the shot clock wound down, the Wolves worked it to Prince in the corner, and he drained a 3-pointer to push Minnesota’s lead back to seven. The Nets didn’t get closer than six points the rest of the way."}
{"game_id": "0022100706", "chunk_id": "0022100706_022", "order": 22, "role": "body", "text": "Anthony Edwards made his 300th career 3-pointer in the first quarter. At 20 years and 171 days, he’s the youngest player in NBA history to amass 300 3-pointers, surpassing the record held by Luka Doncic by 187 days."}
{"game_id": "0022100706", "chunk_id": "0022100706_023", "order": 23, "role": "body", "text": "Edwards limped off the floor late in the fourth quarter after knocking knees with a Nets player. He didn't return to the game, though afterwards, Wolves coach Chris Finch said Edwards told him it wasn't anything serious."}
{"game_id": "0022100706", "chunk_id": "0022100706_025", "order": 25, "role": "body", "text": "Nets: Nash said that guard Joe Harris had suffered some “setbacks” in his recovery from his late-November ankle surgery. He initially was expected to miss 4-8 weeks, but Nash said Harris wasn’t yet healthy enough to resume practice."}
{"game_id": "0022100706", "chunk_id": "0022100706_026", "order": 26, "role": "body", "text": "Timberwolves: Minnesota played without G Patrick Beverley, who injured his right during Wednesday’s game at Atlanta. … Over their previous five games, the Timberwolves were outscored by 51 points in the third quarter. On Sunday, Minnesota was only minus-3 (33-30) in the third."}
{"game_id": "0022100706", "chunk_id": "0022100706_028", "order": 28, "role": "body", "text": "Nets: After going 2-2 on a four-game road trip, Brooklyn is at home vs. the Lakers on Tuesday."}
{"game_id": "0022100706", "chunk_id": "0022100706_029", "order": 29, "role": "body", "text": "Timberwolves: Minnesota begins a three-game West Coast swing in Portland on Tuesday."}
