{"game_id": "0022101020", "chunk_id": "0022101020_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Evan Mobley doesn’t look like he’s in his first NBA playoff race."}
{"game_id": "0022101020", "chunk_id": "0022101020_002", "order": 2, "role": "body", "text": "The 20-year-old rookie scored a season-high 30 points and Darius Garland had 24 points and 13 assists, sending the Cleveland Cavaliers to a 120-111 overtime victory against the Los Angeles Clippers on Monday night."}
{"game_id": "0022101020", "chunk_id": "0022101020_003", "order": 3, "role": "body", "text": "Isaac Okoro added 20 points, including two free throws to open the extra period. Cleveland held the Clippers scoreless for the first 2:33 in OT and never trailed."}
{"game_id": "0022101020", "chunk_id": "0022101020_004", "order": 4, "role": "body", "text": "The Cavaliers hold a 1 1/2-game lead over Toronto for the sixth playoff spot in the East, but are 4-8 since Feb. 12 and remain without All-Star center Jarrett Allen, who has a broken finger on his left hand."}
{"game_id": "0022101020", "chunk_id": "0022101020_005", "order": 5, "role": "body", "text": "Mobley is averaging 21.6 points and 10.8 rebounds in five games at center."}
{"game_id": "0022101020", "chunk_id": "0022101020_006", "order": 6, "role": "body", "text": "“I’m just going out there and being aggressive,” he said. “I feel like my teammates have put me in good spots to score and defend, so I’m really just trying to get better.”"}
{"game_id": "0022101020", "chunk_id": "0022101020_007", "order": 7, "role": "body", "text": "Ivica Zubac had 24 points, 14 rebounds and four assists, and Amir Coffey scored 19 for the Clippers, who had only nine players in uniform. Los Angeles shot 1 of 10 from the field in OT, with Nicolas Batum making a 3-pointer to pull his team within one."}
{"game_id": "0022101020", "chunk_id": "0022101020_008", "order": 8, "role": "body", "text": "Cleveland scored the final seven points on Okoro’s dunk, Lauri Markkanen’s 3-pointer and two free throws by Markkanen."}
{"game_id": "0022101020", "chunk_id": "0022101020_009", "order": 9, "role": "body", "text": "“Everyone in the East is trying to fight for a playoff spot, so it’s great to have that playoff atmosphere every night,” Okoro said. “Evan has impressed me all season. He keeps on improving as the games are going on, so to see him do that is special.”"}
{"game_id": "0022101020", "chunk_id": "0022101020_010", "order": 10, "role": "body", "text": "The Cavaliers welcomed back Caris LeVert, who had 11 points in his return from a sprained right foot that sidelined him for a month. Markkanen finished with 17 points and nine rebounds, and Kevin Love had 13 points and nine boards off the bench."}
{"game_id": "0022101020", "chunk_id": "0022101020_011", "order": 11, "role": "body", "text": "All-Star point guard Garland buried a 3 with 1:20 left in regulation to give Cleveland a 106-103 lead, but Zubac answered with a layup and Coffey made 1 of 2 free throws to force OT. Coffey missed a 23-footer at the buzzer."}
{"game_id": "0022101020", "chunk_id": "0022101020_012", "order": 12, "role": "body", "text": "“We had our chances, but I think we ran out of gas,” Clippers coach Tyronn Lue said. “Only having nine guys and going into overtime made it tough, but everyone gave it all they had.”"}
{"game_id": "0022101020", "chunk_id": "0022101020_013", "order": 13, "role": "body", "text": "Cleveland began a five-game homestand, its longest of the season, over an eight-day span. Ten of its final 15 regular-season games are at Rocket Mortgage FieldHouse, where Mobley — the third overall pick in last year's draft — is already a fan favorite."}
{"game_id": "0022101020", "chunk_id": "0022101020_014", "order": 14, "role": "body", "text": "“I like Mobley’s game a lot, and he’s gotten a lot more aggressive than he was early in the season,” Zubac said. “Now, he’s settled in and you can see the improvement in his game.”"}
{"game_id": "0022101020", "chunk_id": "0022101020_015", "order": 15, "role": "body", "text": "The Clippers, who have played an NBA-high 71 games, completed a stretch of five in seven days. Starting point guard Reggie Jackson and starting power forward Marcus Morris were given the night off."}
{"game_id": "0022101020", "chunk_id": "0022101020_016", "order": 16, "role": "body", "text": "Kawhi Leonard (right knee surgery) has not played this season for Los Angeles, while Paul George (right elbow ligament tear) has been sidelined since Dec. 26 and does not have a projected return date."}
{"game_id": "0022101020", "chunk_id": "0022101020_017", "order": 17, "role": "body", "text": "“We know we’ve got to push through it to get some wins and get ready for the play-in tournament,” Zubac said."}
{"game_id": "0022101020", "chunk_id": "0022101020_018", "order": 18, "role": "body", "text": "Lue, who coached Cleveland to its only NBA championship in 2016, was embraced by Love during a first-quarter timeout. Love is the only remaining player from that team."}
{"game_id": "0022101020", "chunk_id": "0022101020_019", "order": 19, "role": "body", "text": "“The tribute video they played for me, it felt great,” Lue said. “Just reflecting on the great memories I had here is always special.”"}
{"game_id": "0022101020", "chunk_id": "0022101020_021", "order": 21, "role": "body", "text": "The Clippers are solidly in eighth place in the West, placing them in the play-in tournament. Lue said being “cemented” in the spot allowed him to rest Jackson and Morris. “If we were close to being out of the playoffs, these guys would all play,” Lue said. “Reggie didn’t want to sit, but playing him wasn’t the smart thing to do. It was fair to give them the night off, especially after (winning 106-102 in Detroit on Sunday).”"}
{"game_id": "0022101020", "chunk_id": "0022101020_023", "order": 23, "role": "body", "text": "Clippers: F Robert Covington (personal reasons) missed his fifth straight game, but will rejoin the team in Los Angeles and is expected to play Wednesday. … G Norman Powell (left foot fracture), two-way G Jay Scrubb (right foot recovery) and rookie G Jason Preston (right foot recovery) were inactive. … The Clippers wore their San Diego-era, light blue, orange and white throwback jerseys."}
{"game_id": "0022101020", "chunk_id": "0022101020_024", "order": 24, "role": "body", "text": "Cavaliers: F Dean Wade (right knee soreness) and G Rajon Rondo (right ankle sprain) were inactive. Rondo has missed 12 games with various right leg injuries since being acquired from the Lakers in a Jan. 3 trade. … G Collin Sexton (left knee surgery) is out for the season. … G Dylan Windler and two-way G RJ Nembhard were recalled from their G League assignments with the Cleveland Charge."}
{"game_id": "0022101020", "chunk_id": "0022101020_026", "order": 26, "role": "body", "text": "Clippers: Host the Toronto Raptors on Wednesday night."}
{"game_id": "0022101020", "chunk_id": "0022101020_027", "order": 27, "role": "body", "text": "Cavaliers: Host the Philadelphia 76ers on Wednesday night."}
