{"game_id": "0022100843", "chunk_id": "0022100843_001", "order": 1, "role": "lead", "text": "CHICAGO -- — DeMar DeRozan delivered another big performance and got plenty of help along the way. It added up to a well-rounded win for the the balanced Bulls even though Zach LaVine struggled."}
{"game_id": "0022100843", "chunk_id": "0022100843_002", "order": 2, "role": "body", "text": "DeRozan scored 35 points, Nikola Vucevic added 26 and Chicago used a big fourth quarter to beat the Minnesota Timberwolves 134-122 on Friday night."}
{"game_id": "0022100843", "chunk_id": "0022100843_003", "order": 3, "role": "body", "text": "Tied with Milwaukee and Cleveland for second place in the Eastern Conference coming in, the Bulls went on a 15-2 run early in the fourth and outscored the Timberwolves 42-31 in the period."}
{"game_id": "0022100843", "chunk_id": "0022100843_004", "order": 4, "role": "body", "text": "“Our togetherness,” guard Coby White said. “When one has not got it going, others got to step up to the plate. Everybody stepped up big tonight on both ends of the court, especially in that second half. We came out with the win, the most important thing.\""}
{"game_id": "0022100843", "chunk_id": "0022100843_005", "order": 5, "role": "body", "text": "The Bulls set season highs for points and shooting percentage (63.2) despite a rare rough outing for LaVine. The All-Star has dealt with back and knee issues in recent weeks, and he finished with just 12 points — about half his average coming in."}
{"game_id": "0022100843", "chunk_id": "0022100843_006", "order": 6, "role": "body", "text": "Even with LaVine struggling, the Bulls had no trouble getting to the rim and making their shots."}
{"game_id": "0022100843", "chunk_id": "0022100843_007", "order": 7, "role": "body", "text": "DeRozan matched a career high with his fifth straight 30-point performance. He scored 16 in the final quarter."}
{"game_id": "0022100843", "chunk_id": "0022100843_008", "order": 8, "role": "body", "text": "Vucevic had eight rebounds and seven assists. Javonte Green tied a career high with 23 points. White scored 12 of his 22 in the fourth and tied a season high with six 3-pointers, and the Bulls won their second straight while stopping a two-game home losing streak."}
{"game_id": "0022100843", "chunk_id": "0022100843_009", "order": 9, "role": "body", "text": "The Timberwolves lost their second in a row following five consecutive wins."}
{"game_id": "0022100843", "chunk_id": "0022100843_010", "order": 10, "role": "body", "text": "Anthony Edwards scored 31. Karl-Anthony Towns had 27 points, eight rebounds and eight assists. D’Angelo Russell added 18 points."}
{"game_id": "0022100843", "chunk_id": "0022100843_011", "order": 11, "role": "body", "text": "“I want the fans to know this,” Towns said. \"This is not panic button. This is not the old Wolves, you press the panic button, everyone gotta do this, we gotta do that. We’re good.”"}
{"game_id": "0022100843", "chunk_id": "0022100843_013", "order": 13, "role": "body", "text": "Minnesota led 100-97 early in the fourth when the Bulls went on that 15-2 run."}
{"game_id": "0022100843", "chunk_id": "0022100843_014", "order": 14, "role": "body", "text": "They scored nine straight, starting with a fadeaway jumper by DeRozan. White nailed a 3 to put Chicago on top. DeRozan scored again after the Timberwolves' Jaden McDaniels threw the ball away, and Ayo Dosunmu fed Zach LaVine for an alley-oop dunk to make it 106-100."}
{"game_id": "0022100843", "chunk_id": "0022100843_015", "order": 15, "role": "body", "text": "The Bulls kept it up after Russell made two free throws. DeRozan hit back-to-back jumpers, and Dosunmu drove for a dunk, making it 112-102 with 7:22 remaining."}
{"game_id": "0022100843", "chunk_id": "0022100843_016", "order": 16, "role": "body", "text": "“I think tonight was an example of showing how many guys we have that are capable of doing things at a high level,” Dosunmu said."}
{"game_id": "0022100843", "chunk_id": "0022100843_018", "order": 18, "role": "body", "text": "Timberwolves: The 134 points allowed were two shy of a season high. Utah beat the Timberwolves 136-104 on Dec. 8. ... Minnesota shot 13 of 40 on 3-pointers. ... Chicago product Patrick Beverley scored 10. ... Beverley (sprained right ankle), Edwards (left knee pain), G Josh Okogie (bruised right quad), F Taurean Prince (sprained left ankle), C Naz Reid (bruised right knee) and Russell (bruised left shin) were all available after being listed as questionable."}
{"game_id": "0022100843", "chunk_id": "0022100843_019", "order": 19, "role": "body", "text": "Bulls: G Dosunmu had 14 points and 10 assists after missing a game because because of a concussion. The rookie made 6 of 7 shots, including 2 of 3 3-pointers. Dosunmu said his concussion happened when he banged heads with teammate Matt Thomas during the loss at home to Philadelphia on Sunday. He started to feel woozy late in the game against Phoenix the next day and sat out Chicago's win at Charlotte on Wednesday. ... Coach Billy Donovan wasn't sure if LaVine will play against Oklahoma City on Saturday. LaVine finished with his third-lowest point total this season. He also had six assists and four turnovers."}
{"game_id": "0022100843", "chunk_id": "0022100843_021", "order": 21, "role": "body", "text": "Timberwolves: Visit Indiana on Sunday."}
{"game_id": "0022100843", "chunk_id": "0022100843_022", "order": 22, "role": "body", "text": "Bulls: Host Oklahoma City on Saturday."}
