{"game_id": "0022101174", "chunk_id": "0022101174_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — Backup center Olivier Sarr scored a career-high 24 points and Aleksej Pokuveski recorded his first career triple-double to lead the Oklahoma City Thunder to a 117-96 victory over the NBA-leading Phoenix Suns on Sunday night."}
{"game_id": "0022101174", "chunk_id": "0022101174_002", "order": 2, "role": "body", "text": "Sarr came off the bench to shoot 9 of 12 from the field, including 5 of 6 from 3-point range. The other 7-footer, Pokuveski, had 17 points, 12 assists and 10 rebounds while playing point guard for the bulk of the game."}
{"game_id": "0022101174", "chunk_id": "0022101174_003", "order": 3, "role": "body", "text": "In the first half, Pokuveski struggled to run the offense, committing five turnovers. Thunder coach Mark Daigneault said he didn’t say anything to the second-year player before the second-half turnaround in which he continually set up teammates and turned it over just once."}
{"game_id": "0022101174", "chunk_id": "0022101174_004", "order": 4, "role": "body", "text": "“One thing Poku has worked on since he’s been here is having a steady, reliable offensive game in terms of decision making,” Daigneault said. “So when he goes out there and kicks it around the way he did, we trust at this point, he knows how to course correct and he obviously did settle in.”"}
{"game_id": "0022101174", "chunk_id": "0022101174_005", "order": 5, "role": "body", "text": "Pokuveski is getting the chance to run the offense with Josh Giddey and Tre Mann sidelined for the remainder of the season and he said it took some time for him to get comfortable."}
{"game_id": "0022101174", "chunk_id": "0022101174_006", "order": 6, "role": "body", "text": "“The first half wasn’t the best for me, and I was just being more aggressive and making better decisions,\" he said. \"It’s something I couldn’t do last year or the beginning of this year.”"}
{"game_id": "0022101174", "chunk_id": "0022101174_007", "order": 7, "role": "body", "text": "Sarr, who is on a two-way contract with the Thunder, continually pulled the Suns' big men away from the basket and even got the opportunity to complete a four-point play when Cameron Johnson fouled him on a 3-pointer in the fourth quarter."}
{"game_id": "0022101174", "chunk_id": "0022101174_008", "order": 8, "role": "body", "text": "“It felt amazing. Being a big, you’re jealous seeing guards having four-point plays all the time, so it felt great,” Sarr said. “Every night is a job interview for me. It’s just being ready all the time. Whatever it is, offense, defense, being a great teammate. It’s really a job interview for guys like me in this position and I’m trying to make the most out of it.”"}
{"game_id": "0022101174", "chunk_id": "0022101174_009", "order": 9, "role": "body", "text": "The Thunder put seven players in double figures and took advantage of the Suns’ worst 3-point shooting effort of the season. Playing without scoring leader Devin Booker, Phoenix hit just 7 of 38 (18.4%) beyond the arc, well below its previous season low of 22% in a January win over Dallas."}
{"game_id": "0022101174", "chunk_id": "0022101174_010", "order": 10, "role": "body", "text": "“We’ve got to get back to playing our kind of basketball,” Phoenix coach Monty Williams said. “We had a bad second half. We didn’t play well, didn’t make a shot, didn’t have great energy and they did. They played with great energy the whole night. You give them a lot of credit. We can sit here and talk about what we didn’t do but they did well the whole night.”"}
{"game_id": "0022101174", "chunk_id": "0022101174_011", "order": 11, "role": "body", "text": "Phoenix led by 12 in the first quarter, but the Thunder refused to go away, getting a halftime buzzer beater from Isaiah Roby to go into intermission down 53-52."}
{"game_id": "0022101174", "chunk_id": "0022101174_012", "order": 12, "role": "body", "text": "The Thunder got the opening points of the third quarter on a goaltending call on JaVale McGee to grab their first lead of the game and held it the rest of the way. Oklahoma City took an 11-point lead into the fourth quarter and doubled it to 22 before Phoenix emptied the bench in the final four minutes."}
{"game_id": "0022101174", "chunk_id": "0022101174_013", "order": 13, "role": "body", "text": "Mikal Bridges led Phoenix with 18 points. The Thunder outrebounded Phoenix 54-32 and hit 17 3-pointers."}
{"game_id": "0022101174", "chunk_id": "0022101174_015", "order": 15, "role": "body", "text": "Thunder: Jeremiah Robinson-Earl is still on restricted minutes after coming back from a foot injury, but he is making the most of his time on the court. In 11 first-half minutes, he hit all four shots, including three 3-pointers, to lead the Thunder with 11 points and also grabbed three rebounds. He finished with 14 points and five rebounds in just 15 minutes."}
{"game_id": "0022101174", "chunk_id": "0022101174_016", "order": 16, "role": "body", "text": "Suns: Chris Paul got his usual rousing welcome from Thunder fans, who credit him for popularizing NBA basketball in the city when the-then New Orleans Hornets were relocated to Oklahoma City after Hurricane Katrina. Paul sent the fans a message with his game shoes which carried the message “Thank You OKC!!”"}
{"game_id": "0022101174", "chunk_id": "0022101174_018", "order": 18, "role": "body", "text": "Suns: Host the Los Angeles Lakers on Tuesday."}
{"game_id": "0022101174", "chunk_id": "0022101174_019", "order": 19, "role": "closing", "text": "Thunder: Host Portland on Tuesday"}
