{"game_id": "0022100657", "chunk_id": "0022100657_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Kevin Durant wasn't there to make the big shot, snatch the key rebound or take over like he's done countless times."}
{"game_id": "0022100657", "chunk_id": "0022100657_002", "order": 2, "role": "body", "text": "The Brooklyn Nets knew life would be challenging without their superstar."}
{"game_id": "0022100657", "chunk_id": "0022100657_003", "order": 3, "role": "body", "text": "On Monday, that became reality — and their foreseeable future."}
{"game_id": "0022100657", "chunk_id": "0022100657_004", "order": 4, "role": "body", "text": "Darius Garland strengthened his All-Star case with 22 points and 12 assists, leading the Cleveland Cavaliers to a 114-107 win Monday over the Nets, who lost their first game since Durant injured his left knee."}
{"game_id": "0022100657", "chunk_id": "0022100657_005", "order": 5, "role": "body", "text": "“You can't replace Kev,” said Kyrie Irving, who led the Nets with 27 points in just his fourth game since coming back despite being unvaccinated and only playing road games. \"It's impossible. We just faced that reality right now.”"}
{"game_id": "0022100657", "chunk_id": "0022100657_006", "order": 6, "role": "body", "text": "Isaac Okoro added 15 points and Jarrett Allen had 14 and 10 rebounds for the Cavs, who followed up a 5-1 road trip with the fifth straight win."}
{"game_id": "0022100657", "chunk_id": "0022100657_007", "order": 7, "role": "body", "text": "“It’s a signature win for us against a high-level team,” Cavs coach J.B. Bickerstaff said. \"Obviously with reasons why and excuses coming back off that long road trip and all those things, playing against two of the most elite players in our league, and our guys figuring out a way."}
{"game_id": "0022100657", "chunk_id": "0022100657_008", "order": 8, "role": "body", "text": "\"To me, the most impressive thing is you hold a team like that to 19 points in the fourth quarter.”"}
{"game_id": "0022100657", "chunk_id": "0022100657_009", "order": 9, "role": "body", "text": "James Harden added 22 points for Brooklyn, playing for the first time since Durant, the NBA's leading scorer, sprained a ligament in his left knee — an injury that's expected to keep him out for several weeks and again deprives the Nets from getting their “Big 3” running at full speed."}
{"game_id": "0022100657", "chunk_id": "0022100657_010", "order": 10, "role": "body", "text": "Durant's injury is a setback, but it hasn't changed Irving's stance on the COVID-19 vaccine."}
{"game_id": "0022100657", "chunk_id": "0022100657_011", "order": 11, "role": "body", "text": "He's the league's most prominent unvaccinated player, and because of New York's mandate in public arenas, he's not eligible to play home games."}
{"game_id": "0022100657", "chunk_id": "0022100657_012", "order": 12, "role": "body", "text": "And despite Durant’s situation, Irving won’t change his status or belief."}
{"game_id": "0022100657", "chunk_id": "0022100657_013", "order": 13, "role": "body", "text": "“I'm not bringing science into it,” said Irving, who was defensive about his position. “I'm staying rooted in what I believe in.\""}
{"game_id": "0022100657", "chunk_id": "0022100657_014", "order": 14, "role": "body", "text": "The Nets missed five straight shots down the stretch but were still within 110-107 when a costly turnover by Harden led to a breakaway dunk for Okoro."}
{"game_id": "0022100657", "chunk_id": "0022100657_015", "order": 15, "role": "body", "text": "Harden attempted a pass back to Irving, who slipped near mid-court and laid helplessly on the floor as Okoro streaked by and scored."}
{"game_id": "0022100657", "chunk_id": "0022100657_016", "order": 16, "role": "body", "text": "Irving missed a 3-pointer that went halfway down and came out before Cleveland's Kevin Love made three free throws to close out one of the Cavs' biggest wins this season."}
{"game_id": "0022100657", "chunk_id": "0022100657_017", "order": 17, "role": "body", "text": "Durant, averaging 29.3 points per game, sprained his left medial collateral ligament (MCL) on Saturday in a win over New Orleans. The Nets don't have a definitive timeframe for his return, but it's safe to assume he'll be out several weeks."}
{"game_id": "0022100657", "chunk_id": "0022100657_018", "order": 18, "role": "body", "text": "Before the game, Brooklyn coach Steve Nash said Durant will be re-evaluated in “a few weeks,” at which point the team will have a better sense of when he'll be back."}
{"game_id": "0022100657", "chunk_id": "0022100657_019", "order": 19, "role": "body", "text": "In the meantime, the Nets, who were hoping to finally have a long stretch with Durant, Harden and Irving on the floor together, are again being forced to cope, adjust and figure out how to win."}
{"game_id": "0022100657", "chunk_id": "0022100657_020", "order": 20, "role": "body", "text": "“It's an opportunity for our team to grow,” Nash said. “We have to find solutions.\""}
{"game_id": "0022100657", "chunk_id": "0022100657_022", "order": 22, "role": "body", "text": "He moved like the Irving of old, using his hesitation dribble to freeze defenders before blowing by them."}
{"game_id": "0022100657", "chunk_id": "0022100657_023", "order": 23, "role": "body", "text": "“I'm still getting my bearings,” he said."}
{"game_id": "0022100657", "chunk_id": "0022100657_024", "order": 24, "role": "body", "text": "The Nets got another scare in the third quarter when Harden grabbed his left leg and hobbled off."}
{"game_id": "0022100657", "chunk_id": "0022100657_025", "order": 25, "role": "body", "text": "He stayed in for another minute before being replaced by Irving, who then scored seven straight points, dropping a 3-pointer with 11.7 seconds left to put Brooklyn up 88-87 heading into the fourth."}
{"game_id": "0022100657", "chunk_id": "0022100657_026", "order": 26, "role": "body", "text": "Garland, who was named the Eastern Conference's player of the week during the game, was in the middle of the game's splashiest play in the first half."}
{"game_id": "0022100657", "chunk_id": "0022100657_027", "order": 27, "role": "body", "text": "After making an overhead catch on a long outlet pass from Love like a football wide receiver, Garland flipped the ball back to a trailing Okoro for a thundering dunk."}
{"game_id": "0022100657", "chunk_id": "0022100657_029", "order": 29, "role": "body", "text": "Nets: It's hard to find a positive with Durant's situation, but one plus is that Brooklyn plays nine of its next 11 on the road — with Irving. ... F/C Nick Claxton (hamstring) missed his fourth straight game. ... A two-time league MVP as a point guard, Nash has been impressed with Garland's development. “He kind of has all the tools you want, coupled with speed and quickness.\""}
{"game_id": "0022100657", "chunk_id": "0022100657_030", "order": 30, "role": "body", "text": "Cavaliers: With the All-Star Game in Cleveland next month, the Cavs are pushing hard for Garland to make the team along with Allen, who has been one of the East's most dominant big men. “They both deserve it,” said Bickerstaff, who hasn't started calling colleagues to push for their votes. ... G Lamar Stevens (sore knee) sat out. ... G Rajon Rondo (hamstring) missed his fourth game in a row. ... Chairman Dan Gilbert attended his second game this season."}
{"game_id": "0022100657", "chunk_id": "0022100657_032", "order": 32, "role": "body", "text": "Nets: Visit Washington on Wednesday. They beat the Wizards 104-90 on Oct. 25."}
{"game_id": "0022100657", "chunk_id": "0022100657_033", "order": 33, "role": "body", "text": "Cavaliers: Play at Eastern Conference-leading Chicago on Wednesday."}
