{"game_id": "0022100160", "chunk_id": "0022100160_001", "order": 1, "role": "lead", "text": "BOSTON -- — Jayson Tatum had 22 points, 12 rebounds and seven assists in the Boston Celtics' 104-88 victory over the Toronto Raptors on Wednesday night."}
{"game_id": "0022100160", "chunk_id": "0022100160_002", "order": 2, "role": "body", "text": "Robert Williams III added 16 points and 13 rebounds, with a career-best eight coming on the offensive glass. Dennis Schroder scored 20 points, Josh Richardson had 15 and Marcus Smart 13."}
{"game_id": "0022100160", "chunk_id": "0022100160_003", "order": 3, "role": "body", "text": "“It was all about aggressiveness,” Williams said. “To be honest, I felt like us as a team did a great job of rebounding, not just me.”"}
{"game_id": "0022100160", "chunk_id": "0022100160_004", "order": 4, "role": "body", "text": "Scottie Barnes led Toronto with 21 points, Fred VanVleet had 16, and OG Anunoby and Gary Trent Jr. each had 14. The Raptors dropped to 4-1 on the road."}
{"game_id": "0022100160", "chunk_id": "0022100160_005", "order": 5, "role": "body", "text": "In the teams’ first meeting of the season — in Boston’s home opener on Oct. 22 — the Raptors won by 32 points, and Celtics coach Ime Uboka said after that his team got “punked out there.” Boston was booed off the court at halftime."}
{"game_id": "0022100160", "chunk_id": "0022100160_006", "order": 6, "role": "body", "text": "“We're learning the intensity and effort it takes to win every night,” Uboka said after Boston led wire-to-wire Wednesday."}
{"game_id": "0022100160", "chunk_id": "0022100160_007", "order": 7, "role": "body", "text": "Boston led by 16 at halftime and 12 after three quarters."}
{"game_id": "0022100160", "chunk_id": "0022100160_008", "order": 8, "role": "body", "text": "The Raptors gave up 12 offensive rebounds."}
{"game_id": "0022100160", "chunk_id": "0022100160_009", "order": 9, "role": "body", "text": "“I think it was just a good old fashioned case of everybody blocking out,” Toronto coach Nick Nurse said."}
{"game_id": "0022100160", "chunk_id": "0022100160_010", "order": 10, "role": "body", "text": "The Celtics broke it open with an 8-0 run midway into the fourth, pulling ahead 95-79 on Tatum’s driving basket with 5:35 to play."}
{"game_id": "0022100160", "chunk_id": "0022100160_011", "order": 11, "role": "body", "text": "Tatum shot just 8-of-24 from the floor."}
{"game_id": "0022100160", "chunk_id": "0022100160_012", "order": 12, "role": "body", "text": "“He didn't have the best shooting night, but he knows how they're going to guard him and he knows the intensity he draws every night,” Uboka said. “Our big point of emphasis with them overshifting and guarding on him, as you saw in the first half, he was really getting into the paint and kicking out for shots.”"}
{"game_id": "0022100160", "chunk_id": "0022100160_013", "order": 13, "role": "body", "text": "Playing just his second game of the season after being sidelined with a shoulder injury, Pascal Siakim scored eight points in 30 minutes for Toronto."}
{"game_id": "0022100160", "chunk_id": "0022100160_014", "order": 14, "role": "body", "text": "“It's probably just all about timing,” Nurse said. “I think they caught him off guard with a few of those double teams.”"}
{"game_id": "0022100160", "chunk_id": "0022100160_016", "order": 16, "role": "body", "text": "Raptors: Siakim had 15 points and four rebounds in 25 minutes in his first game, a 13-point loss to Brooklyn on Sunday. … Malachi Flynn was whistled for a Flagrant 1 foul midway into the second."}
{"game_id": "0022100160", "chunk_id": "0022100160_017", "order": 17, "role": "body", "text": "Celtics: G Jaylen Brown was out. He’s expected to miss 1-2 weeks with a strained right hamstring. “It doesn’t change a ton, but some of the plays we call for Jaylen, we have to give to other guys,” Uboka said before the game. … G Romeo Langford was back after missing the last game in Dallas on Saturday with what Udoka said was a “non-COVID illness.” He made his first shot — a 3-pointer — and scored six points in 19 minutes. … Williams had nine rebounds in the first half, a career-high seven off the offensive boards."}
{"game_id": "0022100160", "chunk_id": "0022100160_019", "order": 19, "role": "body", "text": "Raptors: At Philadelphia on Thursday night."}
{"game_id": "0022100160", "chunk_id": "0022100160_020", "order": 20, "role": "body", "text": "Celtics: Host Milwaukee on Friday night."}
