{"game_id": "0022101156", "chunk_id": "0022101156_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — On a night when both the Milwaukee Bucks and Los Angeles Clippers rested their top guys, Robert Covington made the most of an opportunity for additional playing time."}
{"game_id": "0022101156", "chunk_id": "0022101156_002", "order": 2, "role": "body", "text": "So did his Clippers teammates."}
{"game_id": "0022101156", "chunk_id": "0022101156_003", "order": 3, "role": "body", "text": "Covington scored a career-high 43 points and made a franchise-record 11 3-pointers to help the hot-shooting Clippers trounce the Bucks 153-119 on Friday night."}
{"game_id": "0022101156", "chunk_id": "0022101156_004", "order": 4, "role": "body", "text": "\"The basket just kept getting bigger and bigger,\" said Covington, who went 11 of 18 from 3-point range. “And my rhythm just stayed the same.”"}
{"game_id": "0022101156", "chunk_id": "0022101156_005", "order": 5, "role": "body", "text": "The Clippers' 153 points were the most they've ever scored in a regular-season game. The Clippers won a first-round playoff game 154-111 over the Dallas Mavericks in 2020."}
{"game_id": "0022101156", "chunk_id": "0022101156_006", "order": 6, "role": "body", "text": "Amir Coffey also had a career high with 32 points for the Clippers, matching a career best with seven assists to go along with six rebounds."}
{"game_id": "0022101156", "chunk_id": "0022101156_007", "order": 7, "role": "body", "text": "The Clippers shot 60.9% from the floor and 23 of 43 from 3-point range."}
{"game_id": "0022101156", "chunk_id": "0022101156_008", "order": 8, "role": "body", "text": "“They obviously executed at a high level,” Bucks coach Mike Budenholzer said. “We didn’t.”"}
{"game_id": "0022101156", "chunk_id": "0022101156_009", "order": 9, "role": "body", "text": "Both teams had played Thursday night games that reached overtime, with the Bucks winning 120-119 at Brooklyn and the Clippers falling 135-130 at Chicago.  The only starter from those two games who played at all Friday was Clippers center Ivica Zubac."}
{"game_id": "0022101156", "chunk_id": "0022101156_010", "order": 10, "role": "body", "text": "Among the players sitting out Friday’s game were Milwaukee’s Giannis Antetokounmpo, Khris Middleton and Jrue Holiday, and the Clippers’ Paul George, Reggie Jackson and Marcus Morris."}
{"game_id": "0022101156", "chunk_id": "0022101156_011", "order": 11, "role": "body", "text": "“Rather than having our guys who make plays for us normally on a regular basis, we had to do it by committee,” Clippers coach Tyronn Lue said. “Those guys did a great job for us.”"}
{"game_id": "0022101156", "chunk_id": "0022101156_012", "order": 12, "role": "body", "text": "This marked the first time the Clippers had reached the 150-point mark since a  150-125 triumph over the Washington Wizards on Dec. 1, 2019."}
{"game_id": "0022101156", "chunk_id": "0022101156_013", "order": 13, "role": "body", "text": "Covington hadn’t had more than 21 points or five 3-point baskets in a game all season before Friday. He had 33 points and went 9 of 13 from beyond the arc in the second half alone, scoring 17 in the third quarter and 16 in the fourth quarter."}
{"game_id": "0022101156", "chunk_id": "0022101156_014", "order": 14, "role": "body", "text": "“They were trying to throw different coverages at him, different players at him, different matchups,” Coffey said. “But he just kept hitting.\""}
{"game_id": "0022101156", "chunk_id": "0022101156_015", "order": 15, "role": "body", "text": "Luke Kennard had 23 points, Terance Mann 18 and Isaiah Hartenstein 14 for the Clippers. Jordan Nwora scored 28, Portis had 25 and Jevon Carter 18 for the Bucks."}
{"game_id": "0022101156", "chunk_id": "0022101156_016", "order": 16, "role": "body", "text": "“My teammates, they were trying to get me 50,” Covington said. “But the other team was like, ‘Naw, we can’t let you do that.' I came close. Two 3s I missed toward the end, they looked really good.”"}
{"game_id": "0022101156", "chunk_id": "0022101156_017", "order": 17, "role": "body", "text": "With so many notable players missing, neither team played much defense early on as both the Bucks and Clippers were shooting over 60% from the floor midway through the second quarter."}
{"game_id": "0022101156", "chunk_id": "0022101156_018", "order": 18, "role": "body", "text": "The Bucks couldn't keep up that pace, though they still shot 53.2%. But the Clippers never cooled off at all."}
{"game_id": "0022101156", "chunk_id": "0022101156_020", "order": 20, "role": "body", "text": "The loudest ovation came during a first-quarter timeout when a  video on the Fiserv Forum scoreboard  showed Antetokounmpo’s career highlights and noted that he had become the Bucks’ all-time leading scorer. The crowd chanted “MVP! MVP!” for Antetokounmpo, whose 14,216 career points enabled him to overtake Kareem Abdul-Jabbar for the franchise record."}
{"game_id": "0022101156", "chunk_id": "0022101156_022", "order": 22, "role": "body", "text": "Clippers: This was the Clippers’ final regular-season road trip. They’re at home for their final four games. … Covington’s previous career high of 31 points came against the Clippers, as a member of the Philadelphia 76ers on Nov. 13, 2017."}
{"game_id": "0022101156", "chunk_id": "0022101156_023", "order": 23, "role": "body", "text": "Bucks: Antetokounmpo was out for the third time in the last seven games due to a sore right knee. Middleton was unavailable for the third time in six games because of a sore left wrist. Bucks coach Mike Budenholzer said Holiday sprained his left ankle Thursday. … Carter made his first start since joining the Bucks last month. He made one start for Brooklyn earlier this season. ... The Bucks are now 20-2 when they shoot at least 50%,"}
{"game_id": "0022101156", "chunk_id": "0022101156_025", "order": 25, "role": "body", "text": "Clippers: Host the New Orleans Pelicans on Sunday. The Hornets have won their last five matchups with the Clippers, including all three meetings this season."}
{"game_id": "0022101156", "chunk_id": "0022101156_026", "order": 26, "role": "body", "text": "Bucks: Host the Dallas Mavericks on Sunday. The Bucks won 102-95 at Dallas in their only previous meeting this season, though neither Antetokounmpo nor Mavericks guard Luka Doncic played in that game."}
