{"game_id": "0022100148", "chunk_id": "0022100148_001", "order": 1, "role": "lead", "text": "CHICAGO -- — DeMar DeRozan scored 28 points, Zach LaVine added 24 and the Chicago Bulls used a 42-point fourth quarter to pull away for a 118-95 victory over the Brooklyn Nets on Monday night."}
{"game_id": "0022100148", "chunk_id": "0022100148_002", "order": 2, "role": "body", "text": "Rookie Ayo Dosumnu had a season-high 15 points and played a key role in the late rally as Chicago snapped a two-game losing streak."}
{"game_id": "0022100148", "chunk_id": "0022100148_003", "order": 3, "role": "body", "text": "Kevin Durant, who entered as the NBA's leading scorer with a 28.6 average, had 38 points but Brooklyn had its five-game winning streak snapped. LaMarcus Aldridge added 19."}
{"game_id": "0022100148", "chunk_id": "0022100148_004", "order": 4, "role": "body", "text": "The Nets had played Sunday in Toronto and appeared to run out of gas late."}
{"game_id": "0022100148", "chunk_id": "0022100148_005", "order": 5, "role": "body", "text": "Brooklyn held a 78-76 edge entering the final quarter. Aldridge hit a pair of free throws to open the scoring in the fourth, but Chicago responded with 13 straight points to take command."}
{"game_id": "0022100148", "chunk_id": "0022100148_006", "order": 6, "role": "body", "text": "“We stayed aggressive,\" DeRozan said. \"We had a couple of stretches, especially in the first half, where we got messy on both ends. Turning the ball over, letting them get out in transition."}
{"game_id": "0022100148", "chunk_id": "0022100148_007", "order": 7, "role": "body", "text": "“We stayed resilient, especially going into that fourth quarter. We stayed aggressive and kept attacking, getting out on transition and making everything tough for them.\""}
{"game_id": "0022100148", "chunk_id": "0022100148_008", "order": 8, "role": "body", "text": "DeRozan had back-to-back jumpers to tie the score at 80 and Dosunmu put Chicago back on top with a free throw. Dosunmu then converted a three-point play on the next possession to make it 84-80."}
{"game_id": "0022100148", "chunk_id": "0022100148_009", "order": 9, "role": "body", "text": "“He's really, really good off the dribble, he's really good going to the basket,” Bulls coach Billy Donovan said. “To me, it's all about his makeup. He's got the ‘it’ factor. What I mean by that, he's going to impact the game, he's going to influence the game, and he's incredibly motivated.”"}
{"game_id": "0022100148", "chunk_id": "0022100148_010", "order": 10, "role": "body", "text": "Chicago stretched the lead to 89-80 before Durant scored the Nets’ first field goal of the fourth with 7:46 remaining. Alex Caruso countered with a 3-pointer to stretch the lead to double digits for the first time at 92-82."}
{"game_id": "0022100148", "chunk_id": "0022100148_011", "order": 11, "role": "body", "text": "Last Monday, the Bulls put together a 39-11 fourth to rally for a win in Boston."}
{"game_id": "0022100148", "chunk_id": "0022100148_012", "order": 12, "role": "body", "text": "“They made shots,\" Durant said. \"They were aggressive in everything that they did. They got stops, ran out. They got some high-level shotmakers on that team, so they made tough ones all night. You got to give them credit, they played with a lot of intensity."}
{"game_id": "0022100148", "chunk_id": "0022100148_013", "order": 13, "role": "body", "text": "“We’re frustrated. We want to win every game.”"}
{"game_id": "0022100148", "chunk_id": "0022100148_014", "order": 14, "role": "body", "text": "Nikola Vucevic added 11 points and 13 rebounds for Chicago, which had dropped back-to-back games to the Philadelphia 76ers."}
{"game_id": "0022100148", "chunk_id": "0022100148_015", "order": 15, "role": "body", "text": "Unlike the previous three games, Chicago got off to a fast start and took a 35-27 lead after the first quarter. The Bulls were up 47-45 late in the second quarter before Brooklyn took control with 10 straight points, sparked by two 3-pointers by Joe Harris, for a 55-47 lead."}
{"game_id": "0022100148", "chunk_id": "0022100148_016", "order": 16, "role": "body", "text": "The Nets led 57-51 at halftime, with Durant and Aldridge leading the way with 15 points apiece."}
{"game_id": "0022100148", "chunk_id": "0022100148_018", "order": 18, "role": "body", "text": "Nets: They scored just 17 points in the fourth quarter. ... James Harden had 14 points and Blake Griffin had just two points ... Aldridge came off the bench to go 7 for 8 from the field in the first half."}
{"game_id": "0022100148", "chunk_id": "0022100148_019", "order": 19, "role": "body", "text": "Bulls: G Coby White (offseason left shoulder surgery) has been cleared to practice. “(Sunday) we had him work with some of the player development guys and (he) went through some contact,” Donovan said. “He came out of that really good. He will practice with us tomorrow and he'll make the trip with us out West.” There's no timeline for when White will be ready to play in games."}
{"game_id": "0022100148", "chunk_id": "0022100148_021", "order": 21, "role": "body", "text": "Dosunmu, who is from Chicago, quickly has become a crowd favorite and is cheered loudly every time he enters the game."}
{"game_id": "0022100148", "chunk_id": "0022100148_022", "order": 22, "role": "body", "text": "“I love it and we feed off it,” DeRozan said. “If he sneezes, the crowd goes nuts.”"}
{"game_id": "0022100148", "chunk_id": "0022100148_024", "order": 24, "role": "body", "text": "Nets: At Orlando Magic on Wednesday night."}
{"game_id": "0022100148", "chunk_id": "0022100148_025", "order": 25, "role": "body", "text": "Bulls: Host Dallas Mavericks on Wednesday night."}
