{"game_id": "0022101228", "chunk_id": "0022101228_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Joel Embiid and James Harden are off to Toronto for the playoffs. Defensive specialist Matisse Thybulle is staying behind for the road games; he's not fully vaccinated and barred from entering Canada."}
{"game_id": "0022101228", "chunk_id": "0022101228_002", "order": 2, "role": "body", "text": "Embiid sat out after he clinched the scoring title and Harden joined him on the bench, leaving Shake Milton and Tyrese Maxey to lead the Philadelphia 76ers to a 118-106 victory over the Detroit Pistons on Sunday night."}
{"game_id": "0022101228", "chunk_id": "0022101228_003", "order": 3, "role": "body", "text": "The Sixers finished with the No. 4 seed in the Eastern Conference playoffs and will open against Toronto."}
{"game_id": "0022101228", "chunk_id": "0022101228_004", "order": 4, "role": "body", "text": "“We pretty much knew it going into the game,” coach Doc Rivers said. “So we'll be ready.\""}
{"game_id": "0022101228", "chunk_id": "0022101228_005", "order": 5, "role": "body", "text": "They'll try and beat the Raptors without Thybulle."}
{"game_id": "0022101228", "chunk_id": "0022101228_006", "order": 6, "role": "body", "text": "Unvaccinated foreign nationals are currently prohibited from entering Canada. Limited exemptions to the rule no longer apply to professional athletes. Rivers said Thybulle would be “ineligible” for Games 3 and 4."}
{"game_id": "0022101228", "chunk_id": "0022101228_007", "order": 7, "role": "body", "text": "Thybulle said he was raised in a “holistic household” and declined to become fully vaccinated. He said he did feel the need to get one shot last season but did not go through with any more, saying “I felt like I had a solid foundation of medical resources that could serve me beyond what this vaccine could do for me.”"}
{"game_id": "0022101228", "chunk_id": "0022101228_008", "order": 8, "role": "body", "text": "“It was not the outcome that I wanted,” he said. “It's always hard not be available.”"}
{"game_id": "0022101228", "chunk_id": "0022101228_009", "order": 9, "role": "body", "text": "Thybulle said he's accepted his decision could hurt the Sixers, his reputation and future earnings but he did not see any benefits he could get from trying “alternative medicine.”"}
{"game_id": "0022101228", "chunk_id": "0022101228_010", "order": 10, "role": "body", "text": "“I made this choice and thought I could keep it to myself, I could keep it quiet,” Thybulle said."}
{"game_id": "0022101228", "chunk_id": "0022101228_011", "order": 11, "role": "body", "text": "Milton scored 30 points, and Maxey and Paul Reed had 25. Luka Garza led the Pistons with 20 points and 10 rebounds."}
{"game_id": "0022101228", "chunk_id": "0022101228_012", "order": 12, "role": "body", "text": "Embiid sat at the end of the bench and Harden pulled the hood of his sweatshirt over his head and they both watched the Sixers rally from a blown 15-point lead to knock off the 59-loss Pistons."}
{"game_id": "0022101228", "chunk_id": "0022101228_013", "order": 13, "role": "body", "text": "Allen Iverson was in the house and the last Sixer to win a scoring title -- four, actually— got to share the arena with this season’s champ. Embiid finished at 30.6 points per game. Milwaukee’s Giannis Antetokounmpo also rested Sunday, finishing at 29.9 points. Embiid posted those numbers in just 33.8 minutes per game, the fewest minutes averaged in a season by the scoring champion in the shot-clock era. He also became the first international player to win a scoring title and first center since Shaquille O’Neal in 1999-00."}
{"game_id": "0022101228", "chunk_id": "0022101228_014", "order": 14, "role": "body", "text": "Sixers fans erupted into “MVP! MVP! chants for Embiid when he was celebrated on the big screen for his scoring title."}
{"game_id": "0022101228", "chunk_id": "0022101228_015", "order": 15, "role": "body", "text": "Harden also earned a game off and averaged 21 points and 7.1 rebounds in 21 games with the Sixers. He has been plagued by hamstring issues since he played with Brooklyn — the Nets sent him to Philly for Ben Simmons in a trade-deadline deal — but Rivers said Harden was fine."}
{"game_id": "0022101228", "chunk_id": "0022101228_016", "order": 16, "role": "body", "text": "“He’s in a good place, I can say that,” Rivers said. “Conditioning wise, he’s in a good place. We’ve got a week to get that a little bit better. The hamstring, from everything they tell me, is in a very good place. That’s the biggest concern, but I don’t have much. Going by our staff, they feel pretty good about him.”"}
{"game_id": "0022101228", "chunk_id": "0022101228_017", "order": 17, "role": "body", "text": "Rivers will give the Sixers a day off Monday and use Tuesday for film before running playoff practices."}
{"game_id": "0022101228", "chunk_id": "0022101228_019", "order": 19, "role": "body", "text": "76ers: DeAndre Jordan had 11 rebounds."}
{"game_id": "0022101228", "chunk_id": "0022101228_020", "order": 20, "role": "body", "text": "Pistons: Former Villanova star Saddiq Bey started all 82 games. ... Cade Cunningham sat out."}
{"game_id": "0022101228", "chunk_id": "0022101228_022", "order": 22, "role": "body", "text": "“We're not going on a Paul Reed victory tour. We're trying to win a championship, man.” — Rivers, shooting down questions that Reed could have a larger role in the playoffs."}
{"game_id": "0022101228", "chunk_id": "0022101228_024", "order": 24, "role": "body", "text": "Pistons coach Dwane Casey said there was reason for excitement next season. Casey said the best part of this season was “growth\" and how they played close to .500 ball after the All-Star break."}
{"game_id": "0022101228", "chunk_id": "0022101228_025", "order": 25, "role": "body", "text": "“Just watching them grow,\" he said. “A lot of the games didn’t equate to win, but the growth is there. It’ll be evident in the future.”"}
