{"game_id": "0022101089", "chunk_id": "0022101089_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Desmond Bane scored 23 points, including nine straight as Memphis rebuilt its lead in the fourth quarter, and the Grizzlies beat Kyrie Irving and the Brooklyn Nets 132-120 on Wednesday night."}
{"game_id": "0022101089", "chunk_id": "0022101089_002", "order": 2, "role": "body", "text": "Irving scored 43 points and Kevin Durant had 35 points, 11 rebounds and eight assists. Still banned from playing home games because of a New York City vaccine mandate, Irving was on the court for the first time since scoring a career-high 60 points at Orlando eight days earlier."}
{"game_id": "0022101089", "chunk_id": "0022101089_003", "order": 3, "role": "body", "text": "But that arrangement for Irving, who is unvaccinated against COVID-19, is coming to an end. New York City Mayor Eric Adams is set to lift the mandate for athletes and performers."}
{"game_id": "0022101089", "chunk_id": "0022101089_004", "order": 4, "role": "body", "text": "Memphis was the short-handed home team this time with leading scorer Ja Morant sidelined because of right knee soreness. But the Grizzlies got enough offense anyway thanks to reserve De’Anthony Melton, who matched Bane’s 23 points, and Dillon Brooks, who finished with 21, part of seven Memphis players reaching double figures."}
{"game_id": "0022101089", "chunk_id": "0022101089_005", "order": 5, "role": "body", "text": "“Great example of just staying the course,” Memphis coach Taylor Jenkins said. “We’ve been saying that throughout the season.”"}
{"game_id": "0022101089", "chunk_id": "0022101089_006", "order": 6, "role": "body", "text": "As for the Grizzlies' 15-2 record without Morant, Jenkins said: “Togetherness. That’s probably the biggest thing.”"}
{"game_id": "0022101089", "chunk_id": "0022101089_007", "order": 7, "role": "body", "text": "The Grizzlies have won six of seven and are second in the Western Conference. They have a two-game lead over the Golden State Warriors, who beat the Miami Heat 118-104 on Wednesday night."}
{"game_id": "0022101089", "chunk_id": "0022101089_008", "order": 8, "role": "body", "text": "Meanwhile, the Nets maintained their one-game lead over Charlotte for eighth place in the Eastern Conference after the Hornets lost 121-106 to the New York Knicks."}
{"game_id": "0022101089", "chunk_id": "0022101089_009", "order": 9, "role": "body", "text": "Early on, after a fast start, Memphis maintained a comfortable lead until the Nets got untracked in the third. Memphis squandered a double-digit lead in the second half but pulled away in the fourth quarter, outscoring Brooklyn 29-16."}
{"game_id": "0022101089", "chunk_id": "0022101089_010", "order": 10, "role": "body", "text": "‘The fourth quarter rolled around, and we adjusted our coverage,” Jenkins said, adding: “Our defensive activity really set a tone going from a 42-point (third quarter for Brooklyn) to a 16-points quarter. It really sparked our offense.”"}
{"game_id": "0022101089", "chunk_id": "0022101089_011", "order": 11, "role": "body", "text": "The Grizzlies led 76-62 at halftime and by 15 points early in the third quarter, but Brooklyn relied on Durant and Irving to chip away. Brooklyn made 16 of 22 shots in the period and led 104-103 entering the fourth."}
{"game_id": "0022101089", "chunk_id": "0022101089_012", "order": 12, "role": "body", "text": "Durant noted that the 14 Brooklyn turnovers and 16 Memphis offensive rebounds leading to 33 second-chance points were hard to overcome, even with Morant out."}
{"game_id": "0022101089", "chunk_id": "0022101089_013", "order": 13, "role": "body", "text": "“They are playing with freedom knowing (Morant) is not there so a lot of guys are playing with a free mind and spirit,” Durant said. “You see it’s translating into buckets.”"}
{"game_id": "0022101089", "chunk_id": "0022101089_015", "order": 15, "role": "body", "text": "Nets: Have lost five straight in the series. The Grizzlies are the only team the Nets haven’t beaten this season. … Durant had two blocks. … The Nets had 52 points in the paint, compared to 48 for Memphis, which leads the NBA in the category, averaging 58.2."}
{"game_id": "0022101089", "chunk_id": "0022101089_016", "order": 16, "role": "body", "text": "Grizzlies: As for Morant’s status, Jenkins said: “He’s dealing with some soreness that crept up in the last couple of days, just offloading that.” ... The win was Memphis’ 50th of the season, the fourth time Memphis has won that many and the first since 2014-15. ... Bane made six 3-pointers, moving him past Mike Miller for the most 3s by a Grizzlies player in a season."}
{"game_id": "0022101089", "chunk_id": "0022101089_018", "order": 18, "role": "body", "text": "Irving turned 30 on Wednesday, but it was his coach who got a gift when news emerged that the star could soon play home games."}
{"game_id": "0022101089", "chunk_id": "0022101089_019", "order": 19, "role": "body", "text": "“I would welcome that,” Steve Nash said to laughter."}
{"game_id": "0022101089", "chunk_id": "0022101089_021", "order": 21, "role": "body", "text": "The Grizzlies took a 40-32 lead in the first quarter. In recent games, it was Brooklyn jumping out to fast leads, making opponents play from behind. “When you give up close to 40 points in the first quarter, and you feel like you’re playing from behind for most of the game,” Irving said, “the momentum shifted on their side. It felt like they were doing to us what we try to do to other teams – which is beating them in the first half and then be able to coast.”"}
{"game_id": "0022101089", "chunk_id": "0022101089_024", "order": 24, "role": "body", "text": "Grizzlies: Host Indiana on Thursday."}
