{"game_id": "0022100890", "chunk_id": "0022100890_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Jayson Tatum swooped in and slammed down a dunk for the game's highlight, though he was hardly the only Boston player who didn’t find much resistance from the Nets’ defense on this night."}
{"game_id": "0022100890", "chunk_id": "0022100890_003", "order": 3, "role": "body", "text": "Tatum scored 30 points and the Celtics returned from the All-Star break with another romp in Brooklyn, beating the Nets 129-106 on Thursday night."}
{"game_id": "0022100890", "chunk_id": "0022100890_004", "order": 4, "role": "body", "text": "Jaylen Brown added 18 points and Marcus Smart had 15. The Celtics picked up where they left off before the break, when they won nine of their final 10 games. One of those was a 126-91 victory in Brooklyn on Feb. 8, when they jumped to a 28-2 lead."}
{"game_id": "0022100890", "chunk_id": "0022100890_005", "order": 5, "role": "body", "text": "This one wasn't much closer. Boston never trailed, just as it didn't that night, led by as much as 29 and won its sixth straight on the road."}
{"game_id": "0022100890", "chunk_id": "0022100890_006", "order": 6, "role": "body", "text": "“We feel like we found something in the past few weeks and it’s just good that after the break we came out and there was no steps back,” forward Al Horford said."}
{"game_id": "0022100890", "chunk_id": "0022100890_007", "order": 7, "role": "body", "text": "Tatum made four 3-pointers along with his dunk over two defenders."}
{"game_id": "0022100890", "chunk_id": "0022100890_008", "order": 8, "role": "body", "text": "“I’ve had my fair share of highlights and sometimes I’ve got to remind people that I can still do that,\" the All-Star forward said. “I don’t do it as often, but in the right moment I can still do those things.”"}
{"game_id": "0022100890", "chunk_id": "0022100890_009", "order": 9, "role": "body", "text": "Plenty of guys in green had highlights. Boston put seven players in double figures and shot 54%."}
{"game_id": "0022100890", "chunk_id": "0022100890_010", "order": 10, "role": "body", "text": "The Celtics' strong stretch before the break moved them up to sixth place in the Eastern Conference, though just two games back of third."}
{"game_id": "0022100890", "chunk_id": "0022100890_011", "order": 11, "role": "body", "text": "Way back in eighth are the Nets, who fell to 31-29 and might need a good run just to get into playoff position without having to go through the play-in round."}
{"game_id": "0022100890", "chunk_id": "0022100890_012", "order": 12, "role": "body", "text": "Kevin Durant, Ben Simmons and Goran Dragic all watched from the bench, with Kyrie Irving unable to be in the building because he isn't vaccinated against the coronavirus as mandated to play in New York City."}
{"game_id": "0022100890", "chunk_id": "0022100890_013", "order": 13, "role": "body", "text": "Coach Steve Nash said Durant (sprained left knee ligament) and the newly signed Dragic could be ready to play in the next three games, though perhaps not Saturday when the Nets visit Milwaukee. It's still unknown when Simmons, who didn't play for Philadelphia before the Nets acquired him in the deal for James Harden at the trade deadline, will be ready."}
{"game_id": "0022100890", "chunk_id": "0022100890_014", "order": 14, "role": "body", "text": "Nash said health is the “1, 2, 3 and 4” things the Nets need to fix, and swingman Bruce Brown also downplayed any concerns related to their place in the standings."}
{"game_id": "0022100890", "chunk_id": "0022100890_015", "order": 15, "role": "body", "text": "“Because our guys are going to come back and we’re going to take care of business,” he said."}
{"game_id": "0022100890", "chunk_id": "0022100890_016", "order": 16, "role": "body", "text": "Seth Curry scored 22 points and Brown had 15 for the Nets, who lost for the 13th time in 15 games. Patty Mills was 0 for 9 from the field."}
{"game_id": "0022100890", "chunk_id": "0022100890_017", "order": 17, "role": "body", "text": "The Celtics jumped to a 22-10 lead midway through the first quarter. They led 35-22 going to the second — a six-point improvement for the Nets after it was 35-16 after one in the Feb. 8 game."}
{"game_id": "0022100890", "chunk_id": "0022100890_018", "order": 18, "role": "body", "text": "Derrick White's three-point play made it 48-26 early in the second before the Nets trimmed it to 67-52 at halftime. Tatum then lad 11 in the third as the Celtics pushed it to 98-74."}
{"game_id": "0022100890", "chunk_id": "0022100890_020", "order": 20, "role": "body", "text": "Celtics: Coach Ime Udoka said the Celtics would monitor the buyout market before March 1, but felt the Celtics may have addressed their needs through trades when they got White and Daniel Theis at the deadline. “So we checked a lot of boxes with what they bring to the group,” he said. ... White scored 13 points."}
{"game_id": "0022100890", "chunk_id": "0022100890_021", "order": 21, "role": "body", "text": "Nets: Nash said the Nets usually consider a player cleared to return to game action when they have had three consecutive workouts at full capacity. He said Durant has had one and they would see how he responded Thursday. ... Kessler Edwards scored 13."}
{"game_id": "0022100890", "chunk_id": "0022100890_023", "order": 23, "role": "body", "text": "Udoka was an assistant with the Nets last season and the 76ers before that, so he knows the personnel involved in the swap. He said Brooklyn felt it wasn't far off last year and knows what Harden brings to the table, but thinks the key to move was the Nets also getting Andre Drummond and Curry. He said it will come down to whether they have enough time to jell once Simmons is ready to play."}
{"game_id": "0022100890", "chunk_id": "0022100890_024", "order": 24, "role": "body", "text": "“But as far as him, he fits right in because of what he brings that others don’t,” Udoka said. “So I can’t say who won the trade, but they tightened up a lot of areas that they needed to here.”"}
{"game_id": "0022100890", "chunk_id": "0022100890_026", "order": 26, "role": "body", "text": "Celtics: Visit Detroit on Saturday."}
{"game_id": "0022100890", "chunk_id": "0022100890_027", "order": 27, "role": "body", "text": "Nets: Visit Milwaukee on Saturday."}
