{"game_id": "0022100751", "chunk_id": "0022100751_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young believes a defensive revival has the Atlanta Hawks back on track. That defense finally showed up in the final quarter against the Los Angeles Lakers."}
{"game_id": "0022100751", "chunk_id": "0022100751_002", "order": 2, "role": "body", "text": "Young had  36 points and 12 assists, and the Hawks earned their seventh straight win by rallying to beat the Lakers 129-121 on Sunday."}
{"game_id": "0022100751", "chunk_id": "0022100751_003", "order": 3, "role": "body", "text": "The Hawks outscored Los Angeles 38-20 in the final period, when Young scored 13 points."}
{"game_id": "0022100751", "chunk_id": "0022100751_004", "order": 4, "role": "body", "text": "“If our mindset is right we get stops on the defensive end ... I think we have a good chance of winning any night,” Young said."}
{"game_id": "0022100751", "chunk_id": "0022100751_005", "order": 5, "role": "body", "text": "Onyeka Okongwu  scored 12 of his 16 points in the final period, when he helped hold Anthony Davis to five of his 27 points."}
{"game_id": "0022100751", "chunk_id": "0022100751_006", "order": 6, "role": "body", "text": "Malik Monk led Los Angeles with 33 points in the Lakers’ third consecutive loss, all without LeBron James."}
{"game_id": "0022100751", "chunk_id": "0022100751_007", "order": 7, "role": "body", "text": "James was not with the team due to continued swelling in his left knee. He returned to Los Angeles for treatment."}
{"game_id": "0022100751", "chunk_id": "0022100751_008", "order": 8, "role": "body", "text": "The Hawks (24-25) matched their longest win streak of the season by charging back after trailing 101-91 entering the fourth quarter. The Lakers scored a season-high 71 points in the first half while making 71.4% of their shots from the field, but they couldn't continue the hot shooting in the final period."}
{"game_id": "0022100751", "chunk_id": "0022100751_009", "order": 9, "role": "body", "text": "Davis helped power the Lakers' strong start with 18 first-half points in his return after missing one game with a sore right wrist."}
{"game_id": "0022100751", "chunk_id": "0022100751_010", "order": 10, "role": "body", "text": "Monk's eighth 3-pointer tied it at 121. De'Andre Hunter made one of two free throws for Atlanta before Young rattled in a 3-pointer for a four-point lead."}
{"game_id": "0022100751", "chunk_id": "0022100751_011", "order": 11, "role": "body", "text": "Young stretched the lead by making two free throws with 25 seconds remaining."}
{"game_id": "0022100751", "chunk_id": "0022100751_012", "order": 12, "role": "body", "text": "Entering Sunday's games, the Hawks were 10th in the Eastern Conference. Atlanta, which lost to Milwaukee in last season's Eastern Conference final, was 12th before the winning streak."}
{"game_id": "0022100751", "chunk_id": "0022100751_013", "order": 13, "role": "body", "text": "The Lakers (24-27), who were ninth in the Western Conference, fell a season-low three games below .500."}
{"game_id": "0022100751", "chunk_id": "0022100751_014", "order": 14, "role": "body", "text": "“We’re not in the position we want to be right now but that’s OK,” said Russell Westbrook, who had 20 points and 12 assists. “We know what we need to do as a team. Just find a way to get over the hump and close games out.”"}
{"game_id": "0022100751", "chunk_id": "0022100751_015", "order": 15, "role": "body", "text": "Monk was on target in his return after missing one game with soreness in his left groin. Monk went 4 for 5 from 3-point range in the first half and 8 for 14 from deep for the game. His last-second 3 capped a 10-2 run to close the half, sending the Lakers into the break with a 71-62 lead."}
{"game_id": "0022100751", "chunk_id": "0022100751_016", "order": 16, "role": "body", "text": "Monk set a season high by scoring 29 points in the Lakers' 134-118 home win over the Hawks on Jan. 7. Monk again feasted on Atlanta's defense to set a new high mark for the season."}
{"game_id": "0022100751", "chunk_id": "0022100751_018", "order": 18, "role": "body", "text": "Lakers: The 71 first-half points set a season high for either half. The Lakers made 30 of 42 shots from the field (71.4%) in the half. They finished at 54% (48 of 87) after making only 7 of 22 shots in the final period."}
{"game_id": "0022100751", "chunk_id": "0022100751_019", "order": 19, "role": "body", "text": "Hawks: John Collins had 20 points and 11 rebounds, and Clint Capela scored 15 points. ... Atlanta also won seven consecutive games from Nov. 14-26."}
{"game_id": "0022100751", "chunk_id": "0022100751_021", "order": 21, "role": "body", "text": "Okongwu continues to emerge as a key backup on Atlanta’s front line. He played the full 12 minutes in the final period, almost doubling his first-half time on the court. Capela, the starting center, did not play the final period."}
{"game_id": "0022100751", "chunk_id": "0022100751_022", "order": 22, "role": "body", "text": "“He was doing a good job of keeping his body between (Davis) and the basket,” Hawks coach Nate McMillan said. “I decided to just stay with him and finish the game.”"}
{"game_id": "0022100751", "chunk_id": "0022100751_023", "order": 23, "role": "body", "text": "Okongwu had four dunks in the final period."}
{"game_id": "0022100751", "chunk_id": "0022100751_025", "order": 25, "role": "body", "text": "Lakers coach Frank Vogel said before the game that an MRI on James’ knee revealed “general swelling.”"}
{"game_id": "0022100751", "chunk_id": "0022100751_026", "order": 26, "role": "body", "text": "“As the long as the swelling is there he’s going to be out,” Vogel said."}
{"game_id": "0022100751", "chunk_id": "0022100751_028", "order": 28, "role": "body", "text": "The Lakers capped a 2-4 road trip with losses to Philadelphia, Charlotte and Atlanta."}
{"game_id": "0022100751", "chunk_id": "0022100751_029", "order": 29, "role": "body", "text": "“We were close but just have fallen short in the last couple,” Vogel said. “We played well the last two games. We fell short in the end. We’ve just got to get home and put this trip behind us ... and get ready for the next game, whether LeBron is in or out.”"}
{"game_id": "0022100751", "chunk_id": "0022100751_031", "order": 31, "role": "body", "text": "Lakers: Host Portland on Wednesday night."}
{"game_id": "0022100751", "chunk_id": "0022100751_032", "order": 32, "role": "body", "text": "Hawks: Host Toronto on Monday night."}
