{"game_id": "0022100324", "chunk_id": "0022100324_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Giannis Antetokounmpo scored on a driving layup with two seconds left to give Milwaukee a 127-125 victory over the Charlotte Hornets on Wednesday night, the Bucks’ eighth consecutive victory."}
{"game_id": "0022100324", "chunk_id": "0022100324_002", "order": 2, "role": "body", "text": "Antetokounmpo had 40 points and 12 rebounds and Khris Middleton added 21 points for the Bucks."}
{"game_id": "0022100324", "chunk_id": "0022100324_003", "order": 3, "role": "body", "text": "“Giannis is just great. Reading the defense, attack mode,” Bucks coach Mike Budenholzer said. “Any time we can get him the ball in that type of situation, we feel like he’s going to make a good play.”"}
{"game_id": "0022100324", "chunk_id": "0022100324_004", "order": 4, "role": "body", "text": "The last minute saw a lot of back and forth between the teams. Middleton buried a 3-pointer from the top left to put Milwaukee in front 123-122 with 52 seconds left. Antetokounmpo’s lay-in on the Bucks’ next possession was negated by an offensive foul."}
{"game_id": "0022100324", "chunk_id": "0022100324_005", "order": 5, "role": "body", "text": "Gordon Hayward missed a jumper from the top of the key for the Hornets, and Middleton hit two free throws to make it 125-122 with 8.6 seconds remaining."}
{"game_id": "0022100324", "chunk_id": "0022100324_006", "order": 6, "role": "body", "text": "LaMelo Ball made a fadeaway 3-pointer — his eighth of the game — with 5.9 seconds left to pull the Hornets even at 125. After a timeout, Jru Holliday fed Antetokounmpo near the top of the lane for the reverse left-side layup."}
{"game_id": "0022100324", "chunk_id": "0022100324_007", "order": 7, "role": "body", "text": "“I haven’t seen the play, but I knew in the position I was in, there was two different routes,” Antetokounmpo said. “Float it up or try to sneak it in, and when you try to sneak it in, you’ve got to spin on. If you just go normal, most likely you’re going to get it blocked.”"}
{"game_id": "0022100324", "chunk_id": "0022100324_008", "order": 8, "role": "body", "text": "Middleton said Antetokounmpo’s game-winner was more difficult than it looked."}
{"game_id": "0022100324", "chunk_id": "0022100324_009", "order": 9, "role": "body", "text": "“People talk about him just being dominant, but on that shot, you can see the skill that he has,” Middleton said. “He’s not always dunking over people, not always using the jump hook. That’s a tough layup even for guards, and he’s a 7-footer coming down to end the game. Going over, then under an arm, then flipping it with a little bit of spin off the glass, that just shows you the type of skills he has as a player.”"}
{"game_id": "0022100324", "chunk_id": "0022100324_010", "order": 10, "role": "body", "text": "Ball had a career-high 36 points for the Hornets, followed by Kelly Oubre Jr. with 25 and Miles Bridges with 22 points."}
{"game_id": "0022100324", "chunk_id": "0022100324_011", "order": 11, "role": "body", "text": "Charlotte made 10 of 17 from beyond the arc in the opening quarter, and Oubre’s 3-pointer in the closing seconds put the Hornets up 41-25 entering the second period. Oubre had 20 points in the first half, making 5 of 7 3-pointers. Hill’s 3-pointer from the left corner brought the Bucks within 68-60 at the half."}
{"game_id": "0022100324", "chunk_id": "0022100324_012", "order": 12, "role": "body", "text": "Milwaukee took its first lead at 91-90 on a three-point play by George Hill with 2:25 left in the third quarter."}
{"game_id": "0022100324", "chunk_id": "0022100324_013", "order": 13, "role": "body", "text": "“Great effort, on the road against a really good team,” Hornets coach James Borrego said. “Came in with the right mentality from the start. Played for 48 minutes the right way. I don’t have one minute where I didn’t think we were playing the right way.”"}
{"game_id": "0022100324", "chunk_id": "0022100324_014", "order": 14, "role": "body", "text": "Ball hit 12 of 22 shots, including 8 of 15 from beyond the arc, along with nine assists."}
{"game_id": "0022100324", "chunk_id": "0022100324_015", "order": 15, "role": "body", "text": "“He’s grown all year, he’s a fantastic player, we’re lucky to have him, we’re fortunate to have him,” Borrego said, adding, “his fearlessness and his composure is fantastic” against the NBA champions. \"He’s a great player. He’s only getting better. This just the tip of the iceberg. The kid’s got a bright, bright future.”"}
{"game_id": "0022100324", "chunk_id": "0022100324_017", "order": 17, "role": "body", "text": "Hornets: Charlotte entered last in scoring defense at 114.9 points per game and was without two of its better inside defenders, F Cody Martin (illness) and C Mason Plumlee (right calf strain)."}
{"game_id": "0022100324", "chunk_id": "0022100324_018", "order": 18, "role": "body", "text": "“We’ve got to be a much better defensive team. We understand that. It’s no secret,” Borrego said. “The bottom five teams defensively just don’t win consistently in this league. I’ve never seen that. Top-tier defenses do. That’s our goal.”"}
{"game_id": "0022100324", "chunk_id": "0022100324_019", "order": 19, "role": "body", "text": "Bucks: With C Brook Lopez sidelined since the opener (back soreness), Milwaukee signed veteran free agent DeMarcus Cousins, who was available Wednesday night. The 6-foot-10 Cousins averaged 8.9 points, 6.4 rebounds, and 17.4 minutes in 41 games last season with the Houston Rockets and Los Angeles Clippers."}
{"game_id": "0022100324", "chunk_id": "0022100324_020", "order": 20, "role": "body", "text": "Cousins played 14 minutes, scoring seven points. Budenholzer said before the game that he thought Cousins is “mentally ... in a good place, so we’re excited about having him for, whatever this is, 60 games or so.”"}
{"game_id": "0022100324", "chunk_id": "0022100324_022", "order": 22, "role": "body", "text": "Hornets: At Atlanta on Sunday."}
{"game_id": "0022100324", "chunk_id": "0022100324_023", "order": 23, "role": "body", "text": "Bucks: At Toronto on Thursday."}
