{"game_id": "0022100200", "chunk_id": "0022100200_001", "order": 1, "role": "lead", "text": "DETROIT -- — Buddy Hield scored 22 points and Tyrese Haliburton added 17 points and 10 assists as the Sacramento Kings routed the Detroit Pistons 129-107 on Monday night."}
{"game_id": "0022100200", "chunk_id": "0022100200_002", "order": 2, "role": "body", "text": "The Kings ended a four-game losing streak, taking control with a 26-2 run for a 33-12 lead early in the second quarter."}
{"game_id": "0022100200", "chunk_id": "0022100200_003", "order": 3, "role": "body", "text": "“We knew we needed to do something to get better on this road trip,” Haliburton said. “You always want to win games, but this was a situation where we needed to win one.”"}
{"game_id": "0022100200", "chunk_id": "0022100200_004", "order": 4, "role": "body", "text": "Richaun Holmes had 19 points and eight rebounds for the Kings. De'Aaron Fox had 19 points and nine assists for Sacramento, which had six players with at least 15 points."}
{"game_id": "0022100200", "chunk_id": "0022100200_005", "order": 5, "role": "body", "text": "“There's a lot to love about this game,” Kings coach Luke Walton said. “We had 32 assists, we played at our pace, and we kept building after our good start. When you are a professional athlete, it gets frustrating to lose a bunch of a games in a row, so now we don't have that hanging over us.”"}
{"game_id": "0022100200", "chunk_id": "0022100200_006", "order": 6, "role": "body", "text": "Cade Cunningham had 25 points, eight rebounds and eight assists for Detroit. Saddiq Bey scored 28, but no one else reached double figures for the Pistons."}
{"game_id": "0022100200", "chunk_id": "0022100200_007", "order": 7, "role": "body", "text": "“I think our first group came out too lax —- we didn't set the right tone and it dragged all through the quarter,\" Cunningham said. “You want to throw that quarter away, but when you are down 31-12, there's not much you can do other than try to chip away at it.”"}
{"game_id": "0022100200", "chunk_id": "0022100200_008", "order": 8, "role": "body", "text": "Detroit shot 20% from the floor in the first quarter, but rallied in the second to get within 46-32. Sacramento answered with a 14-2 run and led 68-44 at halftime."}
{"game_id": "0022100200", "chunk_id": "0022100200_009", "order": 9, "role": "body", "text": "“I think we've probably played 10 or 11 good games this season, with a couple terrible ones,” Walton said. “We haven't been finishing off wins when we've had a chance, so that was a focus tonight.”"}
{"game_id": "0022100200", "chunk_id": "0022100200_010", "order": 10, "role": "body", "text": "The Kings shot 56.3% from the floor in the half, including 9 of 16 on 3-pointers, while the Pistons shot 31.4% and missed 21 of 27 on 3s."}
{"game_id": "0022100200", "chunk_id": "0022100200_011", "order": 11, "role": "body", "text": "“We weren't ready to play, and that's on me,” Pistons coach Dwane Casey said. “It is always tough to come back from a long road trip and get right back at it at home, but that's not an excuse. You have to be ready to play every night in this league, and we weren't there tonight.”"}
{"game_id": "0022100200", "chunk_id": "0022100200_013", "order": 13, "role": "body", "text": "Kings: Marvin Bagley III played for the first time since Oct. 22, finishing with seven points in 18 minutes. ... The most-lopsided win for the Sacramento franchise over the Pistons came in a 130-96 victory as the Rochester Royals on Dec. 31, 1957."}
{"game_id": "0022100200", "chunk_id": "0022100200_014", "order": 14, "role": "body", "text": "Pistons: Detroit was starting a stretch of five home games in nine days. ... With Kelly Olynyk (knee) out for several weeks, rookie center Lucas Garza played a career-high 17 minutes, finishing with five points and seven rebounds."}
{"game_id": "0022100200", "chunk_id": "0022100200_016", "order": 16, "role": "body", "text": "Kings: Visit the Minnesota Timberwolves on Wednesday."}
{"game_id": "0022100200", "chunk_id": "0022100200_017", "order": 17, "role": "body", "text": "Pistons: Host the Indiana Pacers on Wednesday."}
