{"game_id": "0022100048", "chunk_id": "0022100048_001", "order": 1, "role": "lead", "text": "DENVER -- — The tempers briefly flared between feisty guards Ricky Rubio and Facundo Campazzo as both got in each other's face late in the third quarter."}
{"game_id": "0022100048", "chunk_id": "0022100048_002", "order": 2, "role": "body", "text": "Nothing happened besides a stare down. All it did was help ignite Cleveland's big win."}
{"game_id": "0022100048", "chunk_id": "0022100048_003", "order": 3, "role": "body", "text": "Kevin Love scored 22 points, Jarrett Allen recorded his second straight double-double and the Cavaliers fended off the Denver Nuggets 99-87 on Monday night."}
{"game_id": "0022100048", "chunk_id": "0022100048_004", "order": 4, "role": "body", "text": "“Everybody was showing their commitment to one another,” Cavaliers coach J.B. Bickerstaff said of his team’s intensity. \"We didn’t back down at all.”"}
{"game_id": "0022100048", "chunk_id": "0022100048_005", "order": 5, "role": "body", "text": "Especially Rubio, who appeared to take exception with Campazzo’s foul in the corner. He glared at Campazzo as teammates rushed in. Both were issued technicals."}
{"game_id": "0022100048", "chunk_id": "0022100048_006", "order": 6, "role": "body", "text": "“That would’ve been one of the worst fights I’ve seen in my life,” Love cracked."}
{"game_id": "0022100048", "chunk_id": "0022100048_007", "order": 7, "role": "body", "text": "Following the small fracas — and after Denver rallied to tie the game at 70 — Love hit a reverse layup to spark a 19-3 run that helped put the game away."}
{"game_id": "0022100048", "chunk_id": "0022100048_008", "order": 8, "role": "body", "text": "“Everybody wants the next guy to have success,” Love said. “That feeling here is infectious.”"}
{"game_id": "0022100048", "chunk_id": "0022100048_009", "order": 9, "role": "body", "text": "Allen finished with 21 points and 16 rebounds to help the Cavaliers start a five-game trip on the right note. This was on the heels of a 11-point, 14-rebound performance in a win over Atlanta over the weekend."}
{"game_id": "0022100048", "chunk_id": "0022100048_010", "order": 10, "role": "body", "text": "\"He always brings it every single game,” Love said. “You know what you’re going to get from him.”"}
{"game_id": "0022100048", "chunk_id": "0022100048_011", "order": 11, "role": "body", "text": "The Cavaliers overcame a big night from NBA MVP Nikola Jokic, who scored 24 points and grabbed 19 rebounds. They held Denver to 9-of-38 shooting from 3-point land, and forced 22 turnovers."}
{"game_id": "0022100048", "chunk_id": "0022100048_012", "order": 12, "role": "body", "text": "“I don’t know in what we have to be better, but we have to be better in something because you’re going to lose a lot of games if you continue to play like this,” Jokic said. “It’s very much everything (wrong) when you have this kind of game. They didn’t score that many points. We had a lot of turnovers.\""}
{"game_id": "0022100048", "chunk_id": "0022100048_013", "order": 13, "role": "body", "text": "Nuggets coach Michael Malone reiterated that thought."}
{"game_id": "0022100048", "chunk_id": "0022100048_014", "order": 14, "role": "body", "text": "“It’s almost like Keystone-copish out there, some of the turnovers,” Malone said. “Hopefully we can find a way to fix it in a hurry.”"}
{"game_id": "0022100048", "chunk_id": "0022100048_016", "order": 16, "role": "body", "text": "Cavaliers: Love moved past John “Hot Rod” Williams for sole possession of fifth place on Cleveland's all-time defensive rebounds list. ... Rookie PF Evan Mobley had 10 points. ... SG Collin Sexton had 14 points. ... G Darius Garland scored nine points for the Cavs as he returned after missing the last two games with a sprained left ankle."}
{"game_id": "0022100048", "chunk_id": "0022100048_017", "order": 17, "role": "body", "text": "Nuggets: G Jamal Murray (torn ACL) went through a shooting routine in pregame warmups as the crowd shuffled into the arena. ... G Will Barton finished with 12 points, while Aaron Gordon had 12 points and nine rebounds."}
{"game_id": "0022100048", "chunk_id": "0022100048_019", "order": 19, "role": "body", "text": "Bickerstaff had high praise for his defense. But now he expects it every single night."}
{"game_id": "0022100048", "chunk_id": "0022100048_020", "order": 20, "role": "body", "text": "“I told Jarrett that you get an ‘A’ on your report card, now your mom and dad expect you to come back with an ‘A,'\" Bickerstaff said. “This was an ‘A’ defensive effort. We expect them to come back with an ‘A.’”"}
{"game_id": "0022100048", "chunk_id": "0022100048_022", "order": 22, "role": "body", "text": "Malone recently chatted with Bones Hyland about staying patient as he tries to work the rookie guard into the rotation. Hyland saw his first action of the season Monday and had seven points. He was taken 26th overall out of VCU."}
{"game_id": "0022100048", "chunk_id": "0022100048_023", "order": 23, "role": "body", "text": "“Every rookie has a different path,” Malone said. “I told Bones that Jamal didn’t start and Nikola didn’t start. Michael Porter (Jr.) as a rookie probably had 15 DNPs (did not play), and now he’s a max player. America’s great.”"}
{"game_id": "0022100048", "chunk_id": "0022100048_025", "order": 25, "role": "body", "text": "Bickerstaff figures it will take about 10 games of tinkering before he settles on a steady rotation."}
{"game_id": "0022100048", "chunk_id": "0022100048_026", "order": 26, "role": "body", "text": "“We want to give groups an opportunity to be successful or to fail, but they need to have the data behind them,” Bickerstaff explained."}
{"game_id": "0022100048", "chunk_id": "0022100048_028", "order": 28, "role": "body", "text": "Cavaliers: Face the Clippers in Los Angeles on Wednesday."}
{"game_id": "0022100048", "chunk_id": "0022100048_029", "order": 29, "role": "body", "text": "Nuggets: At Utah on Tuesday to complete a back-to-back."}
