{"game_id": "0022100933", "chunk_id": "0022100933_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Malcolm Brogdon hung around until the finish and was the difference for the Indiana Pacers against Orlando."}
{"game_id": "0022100933", "chunk_id": "0022100933_002", "order": 2, "role": "body", "text": "Brogdon, had 31 points, 11 rebounds and eight assists as the Pacers overcame a 15-point deficit in the fourth quarter and beat the Magic in overtime, 122-114 on Wednesday night."}
{"game_id": "0022100933", "chunk_id": "0022100933_003", "order": 3, "role": "body", "text": "Brogdon had sat out Monday night’s loss, also in Orlando, and missed the end of the preceding game against Boston because of an Achilles injury."}
{"game_id": "0022100933", "chunk_id": "0022100933_004", "order": 4, "role": "body", "text": "“Tonight was the night to really push it and see how it responded, and I thought it responded very well,” Brogdon said. “It's a lot of fun to come back and win a game like that when you're not playing really well.”"}
{"game_id": "0022100933", "chunk_id": "0022100933_005", "order": 5, "role": "body", "text": "Brogdon had 14 points in the fourth quarter, which started with Orlando leading 91-76."}
{"game_id": "0022100933", "chunk_id": "0022100933_006", "order": 6, "role": "body", "text": "“He was the best player on the floor tonight,” Indiana coach Rick Carlisle said. “He's the best all-around player on our team, and when he plays it's a different ball game.”"}
{"game_id": "0022100933", "chunk_id": "0022100933_007", "order": 7, "role": "body", "text": "Tyrese Haliburton, who finished with 21 pints and six assists, scored five of Indiana's 12 points in OT."}
{"game_id": "0022100933", "chunk_id": "0022100933_008", "order": 8, "role": "body", "text": "“They understood what they had to do to get back in the game,” Magic coach Jamahl Mosley said. “They got more aggressive, turned up the heat a little bit and we turned the ball over a couple of times.”"}
{"game_id": "0022100933", "chunk_id": "0022100933_009", "order": 9, "role": "body", "text": "Buddy Hield had eight of his 17 points in the fourth quarter for the Pacers, and Jalen Smith came of the bench with 15 points, 15 rebounds and a plus/minus of 27."}
{"game_id": "0022100933", "chunk_id": "0022100933_010", "order": 10, "role": "body", "text": "Franz Wagner led Orlando with 28 points. Mo Bamba added 19 points and Wendell Carter Jr. finished with 13 points and 18 rebounds for the Magic, who led by 18 points in the third quarter in their attempt to win a third straight game for the first time in more than a year."}
{"game_id": "0022100933", "chunk_id": "0022100933_011", "order": 11, "role": "body", "text": "The Pacers moved ahead 101-99 on Haliburton's 3-pointer with 4:58 remaining in the fourth quarter, their first lead since 2-0."}
{"game_id": "0022100933", "chunk_id": "0022100933_012", "order": 12, "role": "body", "text": "“It was kind of an uneven, ugly game most of the night for both teams. But then we started moving it better,\" Carlisle said, “and our unselfishness on offense energized our defense, and we were able to make a run.”"}
{"game_id": "0022100933", "chunk_id": "0022100933_013", "order": 13, "role": "body", "text": "Bamba hit a couple of 3-pointers and scored on a three-point play in the first 4 1/2 minutes, and finished the first half with 15 points."}
{"game_id": "0022100933", "chunk_id": "0022100933_014", "order": 14, "role": "body", "text": "Wagner opened the second half with 12 points in five minutes and Orlando stretched its lead to 18 on four occasions in the third quarter. But after turning the ball over 22 times Monday night and 17 times in the first three quarters, the Pacers had only one turnover in the fourth quarter and overtime."}
{"game_id": "0022100933", "chunk_id": "0022100933_015", "order": 15, "role": "body", "text": "The Magic shot 10 for 32 with eight turnovers after the third quarter."}
{"game_id": "0022100933", "chunk_id": "0022100933_016", "order": 16, "role": "body", "text": "“Part of it was our execution on offense, not moving the ball as well,” Wagner said. “We had some sloppy turnovers and they got out and ran and got a couple of easy ones. They're good in transition.”"}
{"game_id": "0022100933", "chunk_id": "0022100933_018", "order": 18, "role": "body", "text": "Pacers: Terry Taylor and Jalen Smith fought for a rebound in the third quarter and tipped it into the Orlando basket. Carter, running back on defense, was credited with the field goal. ... G Chris Duarte did not play for the fourth time in six games due to a toe injury. ... Smith was fined $20,000 for directing profane language toward a game official after his ejection in the third quarter Monday night."}
{"game_id": "0022100933", "chunk_id": "0022100933_019", "order": 19, "role": "body", "text": "Magic: The Magic's last three-game win streak came on Feb. 17-21 2021. . . . Brian Hill, Orlando's head coach from 1993-97 and from 2005-07, and John Gabriel, an executive with the team for 19 years, were inducted into the Magic's Hall of Fame."}
{"game_id": "0022100933", "chunk_id": "0022100933_021", "order": 21, "role": "body", "text": "Pacers: Play at Detroit on Friday night."}
{"game_id": "0022100933", "chunk_id": "0022100933_022", "order": 22, "role": "body", "text": "Magic: Play at Toronto on Friday night."}
