{"game_id": "0022100882", "chunk_id": "0022100882_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Even without Chris Paul, the Phoenix Suns did what they've done pretty much every time they've taken the court this year."}
{"game_id": "0022100882", "chunk_id": "0022100882_003", "order": 3, "role": "body", "text": "Depending on the status of Paul's right hand, the Suns might have to figure out more ways to win without their star point guard following the All-Star break."}
{"game_id": "0022100882", "chunk_id": "0022100882_004", "order": 4, "role": "body", "text": "Devin Booker scored 24 points, Deandre Ayton added 23 and the NBA-leading Suns extended their winning streak to seven games, rallying after Paul was hurt and then ejected to beat the Houston Rockets 124-121 on Wednesday night."}
{"game_id": "0022100882", "chunk_id": "0022100882_005", "order": 5, "role": "body", "text": "Phoenix improved to 48-10 heading into the All-Star break, but the main concern was the status of Paul’s hand. The 12-time All-Star was angry after getting his right hand jammed on a pass and argued for the first technical."}
{"game_id": "0022100882", "chunk_id": "0022100882_006", "order": 6, "role": "body", "text": "He then bumped into referee J.T. Orr a few seconds later, which earned the second technical. Paul left the court holding his right hand but it was unclear if the injury was serious. There was no official update after the game, though Yahoo! Sports reported that he’s scheduled for an MRI on Thursday."}
{"game_id": "0022100882", "chunk_id": "0022100882_007", "order": 7, "role": "body", "text": "Paul's injury was a disconcerting development in the last game before the break. It's one of the few things that's gone wrong for the Suns so far this season, who have rolled through much of their schedule."}
{"game_id": "0022100882", "chunk_id": "0022100882_008", "order": 8, "role": "body", "text": "“I thought we'd be pretty good because of continuity,” Suns coach Monty Williams said. “But I didn't see this many wins. I don't think on any team I've been on — coach or player — I've ever won this many games. I told the guys that — you have to relish it.”"}
{"game_id": "0022100882", "chunk_id": "0022100882_009", "order": 9, "role": "body", "text": "Booker said Paul was “fine” during the postgame press conference and didn't expect the injury to hold his backcourt teammate out of the All-Star Game in Cleveland on Sunday."}
{"game_id": "0022100882", "chunk_id": "0022100882_010", "order": 10, "role": "body", "text": "The Rockets fell to 15-42 and have lost six straight. Eric Gordon missed a tightly guarded 3-pointer at the buzzer that could have tied it."}
{"game_id": "0022100882", "chunk_id": "0022100882_011", "order": 11, "role": "body", "text": "Houston led for a big chunk of the game and took a 95-89 lead into the final quarter, but Phoenix rallied in a hurry."}
{"game_id": "0022100882", "chunk_id": "0022100882_012", "order": 12, "role": "body", "text": "Torrey Craig's 3-pointer gave the Suns a 96-95 lead. Aaron Holiday — who was recently acquired in a trade with Washington — followed with another 3-pointer and Mikal Bridges added a fast-break layup for a 101-95 advantage to finish the 12-0 run."}
{"game_id": "0022100882", "chunk_id": "0022100882_013", "order": 13, "role": "body", "text": "The game stayed tight from that point forward. Bridges made a short jumper in the lane for a 116-114 lead with 1:10 left. After a Houston turnover, Booker airballed a 3-pointer, but Bridges corralled the offensive rebound and made a layup for a 118-114 advantage."}
{"game_id": "0022100882", "chunk_id": "0022100882_014", "order": 14, "role": "body", "text": "Bridges finished with 17 points and seven rebounds."}
{"game_id": "0022100882", "chunk_id": "0022100882_015", "order": 15, "role": "body", "text": "Dennis Schroder led the Rockets with 23 points. Jae'Sean Tate added 22 points and 10 rebounds, and Gordon scored 20 points. Houston has lost 10 of its last 11 games."}
{"game_id": "0022100882", "chunk_id": "0022100882_016", "order": 16, "role": "body", "text": "“It is disappointing that we lost but, shoot, that's the best team in the NBA and we were right there,” Rockets coach Stephen Silas said. “We had a shot to tie the game at the end. I am proud of the guys the way they fought but I am also proud of the way they prepared to play.”"}
{"game_id": "0022100882", "chunk_id": "0022100882_017", "order": 17, "role": "body", "text": "Houston took a 67-59 lead into halftime. Tate led the Rockets with 16 points and seven rebounds before the break, while Paul led the Suns with 11 points and five assists."}
{"game_id": "0022100882", "chunk_id": "0022100882_018", "order": 18, "role": "body", "text": "The teams combined for 43 free throws in a foul-filled first half — 22 for the Rockets and 21 for the Suns."}
{"game_id": "0022100882", "chunk_id": "0022100882_020", "order": 20, "role": "body", "text": "The start of the second half was delayed because the rim on one of the baskets was bent. Suns 7-foot-1 center JaVale McGee hung on the rim a few times to bend it back in place."}
{"game_id": "0022100882", "chunk_id": "0022100882_021", "order": 21, "role": "body", "text": "A stadium employee climbed a ladder and set a level on the basket to make sure it was OK. Once the officials were satisfied, the game resumed."}
{"game_id": "0022100882", "chunk_id": "0022100882_023", "order": 23, "role": "body", "text": "Rockets: All five starters scored in double figures. ... Alperen Sengun had 19 points and 14 rebounds."}
{"game_id": "0022100882", "chunk_id": "0022100882_024", "order": 24, "role": "body", "text": "Suns: Booker made a one-handed 90-footer at the end of the first quarter. Unfortunately for Phoenix, it was a few moments after the buzzer. ... Hosted a sellout crowd for a 16th straight game."}
{"game_id": "0022100882", "chunk_id": "0022100882_026", "order": 26, "role": "body", "text": "Rockets: At Los Angeles Clippers on Thursday night."}
{"game_id": "0022100882", "chunk_id": "0022100882_027", "order": 27, "role": "body", "text": "Suns: At Oklahoma City on Thursday, Feb. 24."}
