{"game_id": "0022100573", "chunk_id": "0022100573_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Pascal Siakam scored 33 points, OG Anunoby and Gary Trent Jr. had 22 apiece and the Toronto Raptors beat the short-handed Milwaukee Bucks 117-111 on Wednesday night."}
{"game_id": "0022100573", "chunk_id": "0022100573_002", "order": 2, "role": "body", "text": "Fred VanVleet added 19 points for the Raptors. They improved to 18-17 and overcame Milwaukee’s hot-shooting first half and late rally."}
{"game_id": "0022100573", "chunk_id": "0022100573_003", "order": 3, "role": "body", "text": "The defending NBA champion Bucks were without coach Mike Budenholzer after he entered the NBA’s health and safety protocols."}
{"game_id": "0022100573", "chunk_id": "0022100573_004", "order": 4, "role": "body", "text": "Milwaukee played without NBA Finals MVP Giannis Antetokounmpo because of an an illness unrelated to COVID-19. Grayson Allen, George Hill and Pat Connaughton also entered protocols Wednesday."}
{"game_id": "0022100573", "chunk_id": "0022100573_005", "order": 5, "role": "body", "text": "Khris Middleton led the Bucks with 25 points. Jordan Nwora had 17 and Jrue Holiday and DeMarcus Cousins each had 15."}
{"game_id": "0022100573", "chunk_id": "0022100573_006", "order": 6, "role": "body", "text": "The Bucks were coming off a 115-106 home loss to lowly Detroit."}
{"game_id": "0022100573", "chunk_id": "0022100573_007", "order": 7, "role": "body", "text": "Milwaukee connected on 61% of its shots to take a 77-68 at the half, tying the most points it has scored in the first half this season. The 77 points marked the most Toronto has surrendered in any half this season. The previous high was 72 in both halves of a 144-99 loss at Cleveland on Dec. 26."}
{"game_id": "0022100573", "chunk_id": "0022100573_008", "order": 8, "role": "body", "text": "“You learn that it is a long game and sometimes you aren’t always going to be at your best,\" Raptors coach Nick Nurse said. \"They did a good job of not really overreacting to that first half. We got into the locker room and I told them we were pretty fortunate that it was only a nine-point game. It was just a matter of can we flip it around and start doing some of the things we do defensively, and we did.”"}
{"game_id": "0022100573", "chunk_id": "0022100573_009", "order": 9, "role": "body", "text": "The Toronto coaching staff and bench became very vocal in the second half in an effort to boost the team's defensive intensity, Nurse said."}
{"game_id": "0022100573", "chunk_id": "0022100573_010", "order": 10, "role": "body", "text": "“Everybody was energized and tuned in. That was fun,\" he said."}
{"game_id": "0022100573", "chunk_id": "0022100573_011", "order": 11, "role": "body", "text": "Toronto erased a 14-point deficit and tied it at 85 midway through the third. The Raptors built a 15-point lead in the fourth, but the Bucks pulled within four points twice in the final minute."}
{"game_id": "0022100573", "chunk_id": "0022100573_012", "order": 12, "role": "body", "text": "“I’m not devastated,\" Bucks acting coach Darvin Ham said. \"I thought our guys busted their butts.”"}
{"game_id": "0022100573", "chunk_id": "0022100573_013", "order": 13, "role": "body", "text": "Middleton said he was disappointed that the team couldn't get a win for Ham."}
{"game_id": "0022100573", "chunk_id": "0022100573_014", "order": 14, "role": "body", "text": "“Overall, the coaching staff did a great job preparing us for tonight, we just let ourselves down in the third quarter,\" he said."}
{"game_id": "0022100573", "chunk_id": "0022100573_016", "order": 16, "role": "body", "text": "Raptors: F Svi Mykhailiuk and F Yuta Watanabe remained in the health and safety protocols. … G David Johnson returned from a calf strain. … Siakim was whistled for a third-quarter technical foul after his elbow connected with Middleton’s face."}
{"game_id": "0022100573", "chunk_id": "0022100573_017", "order": 17, "role": "body", "text": "Bucks: Reserves Nwora, Thanasis Antetokounmpo and Semi Ojeleye, who had previously been unavailable due to the protocols, all returned. Nwora started. … Made 13 of 21 3-pointers in the first half but missed all eight of their 3-point attempts in the third quarter. … Cousins left the game with a left calf contusion."}
{"game_id": "0022100573", "chunk_id": "0022100573_019", "order": 19, "role": "body", "text": "Ham is in his 11th season as an assistant coach. Wednesday marked the second time he’s served as acting head coach. Ham said he stepped in for Budenholzer in 2017 when the pair coached together with the Hawks in Atlanta and Budenholzer had to serve a one-game suspension for bumping an official. He said he learned of Budenholzer’s positive test after a practice session on Tuesday evening."}
{"game_id": "0022100573", "chunk_id": "0022100573_020", "order": 20, "role": "body", "text": "“My job is to keep the bus moving forward,” Ham said. “These are some unfortunate times and unfortunate circumstances. I’m not looking to make a big splash and prove to the world that I can really coach. I know that already. I’m very comfortable in my role here.”"}
{"game_id": "0022100573", "chunk_id": "0022100573_022", "order": 22, "role": "body", "text": "The Raptors are playing games at Scotiabank Arena in Toronto with a limit of 1,000 fans in accordance with a decision by Ontario health authorities that went into effect on Dec. 31. Having an opportunity to play in front of thousands of fans at Fiserv Forum had Toronto players excited, Nurse said."}
{"game_id": "0022100573", "chunk_id": "0022100573_023", "order": 23, "role": "body", "text": "“It’s not great playing without fans,” Nurse said. “It’s a big old building that doesn’t have a lot of energy or juice when the game is going on. I know our guys are pretty excited to be here tonight. We’re hoping it gets better quick. Our fans are awesome. We want to play in front of them.”"}
{"game_id": "0022100573", "chunk_id": "0022100573_025", "order": 25, "role": "body", "text": "Raptors: Host Utah on Friday night."}
{"game_id": "0022100573", "chunk_id": "0022100573_026", "order": 26, "role": "closing", "text": "Bucks: At Brooklyn on Friday night."}
