{"game_id": "0022100567", "chunk_id": "0022100567_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Kelly Oubre Jr. hit a career-high nine of Charlotte's franchise-record 24 3-pointers and the Hornets routed the Pistons 140-111 on Wednesday night."}
{"game_id": "0022100567", "chunk_id": "0022100567_002", "order": 2, "role": "body", "text": "Oubre had eight 3-pointers in the fourth quarter, tying an NBA record set by Milwaukee's Michael Redd in 2002. Oubre was 8 of 9 on 3s in the fourth quarter before being subbed out with 4:08 left and the Hornets leading by 35."}
{"game_id": "0022100567", "chunk_id": "0022100567_003", "order": 3, "role": "body", "text": "Golden State's Klay Thompson holds the league record for 3-pointers in a quarter with nine, that coming in the third quarter of a game in 2015."}
{"game_id": "0022100567", "chunk_id": "0022100567_004", "order": 4, "role": "body", "text": "“I give all the credit to my teammates,” Oubre said. “We had 39 assists tonight. ... I am blessed to be able to play with a bunch of unselfish guys out there who allow me to continue with a hot stretch.”"}
{"game_id": "0022100567", "chunk_id": "0022100567_005", "order": 5, "role": "body", "text": "Gordon Hayward and Miles Bridges each had 19 points to help the Hornets beat the Pistons for the 14th straight time. Charlotte hasn’t lost to Detroit since Oct. 18, 2017."}
{"game_id": "0022100567", "chunk_id": "0022100567_006", "order": 6, "role": "body", "text": "Terry Rozier added 16 points, and LaMelo Ball had 12 points, 12 assists and eight rebounds in three quarters."}
{"game_id": "0022100567", "chunk_id": "0022100567_007", "order": 7, "role": "body", "text": "Trey Lyles had 17 points for Detroit. Cade Cunningham added 16."}
{"game_id": "0022100567", "chunk_id": "0022100567_008", "order": 8, "role": "body", "text": "Oubre finished 9 of 14 for the game, and the Hornets shot 57.1% overall from deep."}
{"game_id": "0022100567", "chunk_id": "0022100567_009", "order": 9, "role": "body", "text": "A seven-year NBA veteran, Oubre is averaging a career-high 16.2 points per game in his first season with the Hornets and is shooting a 36.7% from beyond the arc, also a personal best."}
{"game_id": "0022100567", "chunk_id": "0022100567_010", "order": 10, "role": "body", "text": "“When Kelly gets hot, he’s tough to stop,” Hornets coach James Borrego said. “It’s great to see him play with that joy, that happiness and that confidence. He had a big time fourth quarter and our guys kept feeding him.”"}
{"game_id": "0022100567", "chunk_id": "0022100567_011", "order": 11, "role": "body", "text": "Borrego said Oubre deserves consideration for the NBA’s Sixth Man of the Year award."}
{"game_id": "0022100567", "chunk_id": "0022100567_012", "order": 12, "role": "body", "text": "“I don’t have all of the candidates, but I would vote for him if I had a vote,” Borrego said. “There are number of players out there capable I'm sure, but Kelly has to be right there in the mix.”"}
{"game_id": "0022100567", "chunk_id": "0022100567_013", "order": 13, "role": "body", "text": "Detroit was feeling confident coming off a road win Monday night over the defending NBA champion Milwaukee Bucks, marking the first time the Pistons (7-29) have won back-to-back games this season."}
{"game_id": "0022100567", "chunk_id": "0022100567_014", "order": 14, "role": "body", "text": "But Charlotte (20-19) jumped on Detroit early, making 7 of 11 3-point attempts in the first quarter and building a 26-point lead in the opening half. The Hornets never led by less than double figures after that."}
{"game_id": "0022100567", "chunk_id": "0022100567_015", "order": 15, "role": "body", "text": "“It’s the way you start the game,\" Pistons coach Dwane Casey said. “We didn’t come out with the right disposition, didn’t switch properly. ... Just because you beat somebody, the top team in the league, doesn’t mean jack in this league because the very next night you’ve got another gunslinger coming in.”"}
{"game_id": "0022100567", "chunk_id": "0022100567_016", "order": 16, "role": "body", "text": "It was a welcome change for the Hornets, who have struggled to get off to fast starts in recent games."}
{"game_id": "0022100567", "chunk_id": "0022100567_017", "order": 17, "role": "body", "text": "Ball missed out on his fourth career triple-double when Borrego sat him the entire fourth quarter. Charlotte led by 25 entering the fourth quarter."}
{"game_id": "0022100567", "chunk_id": "0022100567_018", "order": 18, "role": "body", "text": "“When Melo has double digit assists, most times we like the result,\" Borrego said. “He starts the ball movement and when he does that it seems to spread throughout the team. It’s no surprise that he had 12 and we had 39 as a team.”"}
{"game_id": "0022100567", "chunk_id": "0022100567_020", "order": 20, "role": "body", "text": "Rozier has quietly been on a bit of a tear of late from long range. He was 4 of 7 from 3-point range against the Pistons and has made 30 of 63 3's in his last seven games."}
{"game_id": "0022100567", "chunk_id": "0022100567_022", "order": 22, "role": "body", "text": "P.J. Washington gave the Hornets a big lift off the bench with 14 points and eight rebounds after missing the last four games in the NBA’s health and safety protocols."}
{"game_id": "0022100567", "chunk_id": "0022100567_023", "order": 23, "role": "body", "text": "“I thought he had great energy on both ends,” Borrego said. “It’s great to have him back and I thought he was a major part of this win.”"}
{"game_id": "0022100567", "chunk_id": "0022100567_025", "order": 25, "role": "body", "text": "Pistons: Jerami Grant, the team's leading scorer, remained out with a right thumb sprain."}
{"game_id": "0022100567", "chunk_id": "0022100567_026", "order": 26, "role": "body", "text": "Hornets: Charlotte's previous franchise record of 23 3-pointers came Nov. 26 against Minnesota."}
{"game_id": "0022100567", "chunk_id": "0022100567_028", "order": 28, "role": "body", "text": "Pistons: At Memphis on Thursday night."}
{"game_id": "0022100567", "chunk_id": "0022100567_029", "order": 29, "role": "body", "text": "Hornets: Host Milwaukee on Saturday and Monday nights."}
