{"game_id": "0022101019", "chunk_id": "0022101019_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Anthony Davis had a few words to say about the Los Angeles Lakers' playoff loss to the Phoenix Suns last season before the teams played Sunday night."}
{"game_id": "0022101019", "chunk_id": "0022101019_003", "order": 3, "role": "body", "text": "Devin Booker scored 30 points, Deandre Ayton had 23 points and 16 rebounds in just 27 minutes and the NBA-leading Suns routed the Lakers 140-111."}
{"game_id": "0022101019", "chunk_id": "0022101019_004", "order": 4, "role": "body", "text": "Booker also had 10 assists and four steals. Mikal Bridges added 18 points to help Phoenix move 40 games over .500 at 54-14. The 140 points were a season high for the Suns."}
{"game_id": "0022101019", "chunk_id": "0022101019_005", "order": 5, "role": "body", "text": "Davis told reporters before the game that the Lakers would have beaten the Suns last year in their postseason series had he not been sidelined with a groin injury."}
{"game_id": "0022101019", "chunk_id": "0022101019_006", "order": 6, "role": "body", "text": "“We know that. They know that. They got away with one,” Davis said."}
{"game_id": "0022101019", "chunk_id": "0022101019_007", "order": 7, "role": "body", "text": "Booker said the Suns heard about Davis' comments before the teams took the court Sunday."}
{"game_id": "0022101019", "chunk_id": "0022101019_008", "order": 8, "role": "body", "text": "“Instead of taking the high (road), you make a comment like that,” Booker said."}
{"game_id": "0022101019", "chunk_id": "0022101019_009", "order": 9, "role": "body", "text": "LeBron James led the Lakers, who have lost 10 straight road games, with 31 points, seven rebounds and six assists. He did not play in the fourth quarter."}
{"game_id": "0022101019", "chunk_id": "0022101019_010", "order": 10, "role": "body", "text": "James reached a milestone with his 10,000th career assist in the second quarter on Carmelo Anthony's 3-pointer. James is the only player in NBA history with at least 30,000 points, 10,000 rebounds and 10,000 assists."}
{"game_id": "0022101019", "chunk_id": "0022101019_011", "order": 11, "role": "body", "text": "“I get a loss of words anytime things like this happen to me,” James said. “I automatically start thinking about my hometown of Akron and my upbringing where I come from. The dreams I had of being in this league at the highest level and to now sit alone in a statistical category in this league. I model my game after being able to score, rebound and assist. And to sit alone in a stat, I'll say cool, but it doesn't quite make sense to me.”"}
{"game_id": "0022101019", "chunk_id": "0022101019_012", "order": 12, "role": "body", "text": "Ayton's double-double came after a text exchange with coach Monty Williams following the Suns' loss to Toronto on Friday night. Ayton had 16 points and seven rebounds in the loss and told Williams in the text that he could take advantage of the Lakers' small lineup, featuring James at center."}
{"game_id": "0022101019", "chunk_id": "0022101019_013", "order": 13, "role": "body", "text": "“It wasn't selfish, not like I want more points,” Williams said. “(It was) ‘I can dominate them. I think we need to look at me more.’ ... DA doesn't make those kinds of statements so he can score more and get those points. He's like, ‘I can work down there.’ I've been around long enough to know his intentions and he backed it up.”"}
{"game_id": "0022101019", "chunk_id": "0022101019_014", "order": 14, "role": "body", "text": "Ayton said he feels “disrespected” when teams employ a small lineup against him."}
{"game_id": "0022101019", "chunk_id": "0022101019_015", "order": 15, "role": "body", "text": "“That's just my thing,” he said. “I'm punishing teams like that.”"}
{"game_id": "0022101019", "chunk_id": "0022101019_016", "order": 16, "role": "body", "text": "The Suns broke it open in the first five minutes. They went on a 14-0 run — punctuated by back-to-back 27-foot 3-pointers by Booker — to take a 16-6 lead, and kept pouring it on."}
{"game_id": "0022101019", "chunk_id": "0022101019_017", "order": 17, "role": "body", "text": "Phoenix led 48-22 after the first quarter, the Suns' highest output in a quarter this season and the most the Lakers have given up in a quarter in the shot-clock era."}
{"game_id": "0022101019", "chunk_id": "0022101019_018", "order": 18, "role": "body", "text": "Phoenix had 14 assists and no turnovers in the quarter and was 7 of 12 from 3-point range. The Lakers had seven turnovers and were 1 of 10 on 3-point attempts."}
{"game_id": "0022101019", "chunk_id": "0022101019_019", "order": 19, "role": "body", "text": "Phoenix had a season-high 79 points at the half for a 23-point lead."}
{"game_id": "0022101019", "chunk_id": "0022101019_020", "order": 20, "role": "body", "text": "“We played poorly,” Lakers coach Frank Vogel said. “How we started, really the whole night, was unacceptable ... This is a tough matchup to play small-ball against but we definitely have to be better than we were tonight.”"}
{"game_id": "0022101019", "chunk_id": "0022101019_022", "order": 22, "role": "body", "text": "Lakers: F Davis, who has been sidelined since Feb. 16 with a foot sprain, will begin on-court work and spot shooting Monday. It's uncertain when Davis will ramp up his activity. Vogel called his return sometime this season a “100% maybe.”"}
{"game_id": "0022101019", "chunk_id": "0022101019_023", "order": 23, "role": "body", "text": "Suns: F Cam Johnson missed his fifth straight game with a right quad contusion ... Danish guard Gabriel Lundburg, signed to a two-way contract, will not report to the Suns for two weeks because of visa issues ... Phoenix has beaten every NBA team at least once this season, the first time that's happened since 2006-07."}
{"game_id": "0022101019", "chunk_id": "0022101019_025", "order": 25, "role": "body", "text": "Williams was asked before the game if he was surprised that James, at the age of 37 had scored 50 points or more in two of the last three Lakers' games."}
{"game_id": "0022101019", "chunk_id": "0022101019_026", "order": 26, "role": "body", "text": "“Scoring 25 points in an NBA game is hard. Ask anybody who hasn't done it,” Williams said. “To do what he's done the last few games, I don't even think about his age anymore. He doesn't look like he's closing in on 40. He just looks like LeBron James.”"}
{"game_id": "0022101019", "chunk_id": "0022101019_028", "order": 28, "role": "body", "text": "Lakers: Host Toronto on Monday night."}
{"game_id": "0022101019", "chunk_id": "0022101019_029", "order": 29, "role": "closing", "text": "Suns: At New Orleans on Tuesday night."}
