{"game_id": "0022100530", "chunk_id": "0022100530_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — DeMar DeRozan made a 28-foot 3-pointer at the buzzer to give the Chicago Bulls a 108-106 victory over the Indiana Pacers on Friday."}
{"game_id": "0022100530", "chunk_id": "0022100530_002", "order": 2, "role": "body", "text": "DeRozan, who shot off of one leg, led the Bulls with 28 points, hitting 8 of 24 shots and 11 of 12 free throws. Coby White added 24 points, and Zach LaVine had 17 to help Chicago win its sixth consecutive game."}
{"game_id": "0022100530", "chunk_id": "0022100530_003", "order": 3, "role": "body", "text": "“He has a calm about him,” Bulls acting coach Chris Fleming said about DeRozan. \"I think he was frustrated but was still able to keep his head in the game and be there when it mattered. I think that is one qualify about him, which really impressed me about him.”"}
{"game_id": "0022100530", "chunk_id": "0022100530_004", "order": 4, "role": "body", "text": "Domantas Sabonis said there isn't much to do with a shot like DeRozan hit."}
{"game_id": "0022100530", "chunk_id": "0022100530_005", "order": 5, "role": "body", "text": "“We were trying to get the ball out of his hands,\" Sabonis said. “I feel like he didn't know how much time was left. He looked up and just shot that shot. Sometimes that shot goes in, sometimes it doesn't.\""}
{"game_id": "0022100530", "chunk_id": "0022100530_006", "order": 6, "role": "body", "text": "DeRozan said he never thinks about missed opportunities on shots ate in the game"}
{"game_id": "0022100530", "chunk_id": "0022100530_007", "order": 7, "role": "body", "text": "“I always think about the next opportunity and try to capitalize on that the best I can,” he said."}
{"game_id": "0022100530", "chunk_id": "0022100530_008", "order": 8, "role": "body", "text": "DeRozan praised White, who hit 6 of 7 3-pointers and made a late hustle play to get a loose ball."}
{"game_id": "0022100530", "chunk_id": "0022100530_009", "order": 9, "role": "body", "text": "“Without him, we don't win this game,” DeRozan said."}
{"game_id": "0022100530", "chunk_id": "0022100530_010", "order": 10, "role": "body", "text": "Nikola Vucevic had 14 points and and 16 rebounds for Chicago."}
{"game_id": "0022100530", "chunk_id": "0022100530_011", "order": 11, "role": "body", "text": "Caris LeVert topped the Pacers with 27 points, and Sabonis had 24 points and 14 rebounds. The Pacers had a 55-42 edge in rebounds."}
{"game_id": "0022100530", "chunk_id": "0022100530_012", "order": 12, "role": "body", "text": "Trailing 94-90, the Pacers used a 9-0 run to take a 99-94 advantage. Chicago cut it to 104-103 on LaVine’s dunk with 1:40 to go. After LeVert hit two free throws with 56 seconds left to give Indiana a 106-103 lead, DeRozan hit a 14-footer with 36 seconds left. DeRozan then got a steal with 12 seconds to go."}
{"game_id": "0022100530", "chunk_id": "0022100530_013", "order": 13, "role": "body", "text": "The final minute pulled the game out for the Bulls, who struggled for a stretch in the fourth quarter."}
{"game_id": "0022100530", "chunk_id": "0022100530_014", "order": 14, "role": "body", "text": "“I think collectively we did a subpar defensively,” Fleming said. “I think we were flat in general. We didn’t have a whole lot of pop to us. We had trouble generating on both ends of the floor the energy we normally play with.”"}
{"game_id": "0022100530", "chunk_id": "0022100530_015", "order": 15, "role": "body", "text": "The Bulls had lead most of the way, taking an 82-79 advantage into the fourth quarter. Chicago’s largest lead was nine points."}
{"game_id": "0022100530", "chunk_id": "0022100530_016", "order": 16, "role": "body", "text": "Justin Holiday said it was good to see how the Pacers fought the whole time being without some key players."}
{"game_id": "0022100530", "chunk_id": "0022100530_017", "order": 17, "role": "body", "text": "“To lose that way is tough,” Holiday said. “But we have to build off how we played together.”"}
{"game_id": "0022100530", "chunk_id": "0022100530_019", "order": 19, "role": "body", "text": "Bulls: Chicago was without coach Billy Donovan for the fourth consecutive game because of COVID-19, with Chris Fleming directing the team. Fleming said Donovan is expected back next week. … Starting guard Lonzo Ball remains sidelined as well due to health and safety protocols. In addition, Marko Simonovic, Tony Bradley, Ersan Ilyasova and Alfonzo McKinnie were out due to COVID-19 protocols. … The Bulls signed Jordan Bell to 10-day contract on Thursday. … Alex Caruso didn’t play because of foot injury."}
{"game_id": "0022100530", "chunk_id": "0022100530_020", "order": 20, "role": "body", "text": "Pacers: Indiana was without five players, including starting guard Malcolm Brogdon sidelined because of COVID-19 protocols. Brogdon, the team’s leading scorer, had already missed the previous three games with an Achilles injury. The others were Chris Duarte, Jeremy Lamb, Isaiah Jackson and Kelan Martin. Duarte had started 25 games. Assistant coach Lloyd Pierce also was out following a positive COVID-19 test. ... Duane Washington Jr. made the first start of his NBA career, replacing Duarte. … The Pacers signed Ahmad Caver to a 10-day hardship contact on Friday. Indiana had signed Nate Hinton to a 10-day hardship contract on Thursday."}
{"game_id": "0022100530", "chunk_id": "0022100530_022", "order": 22, "role": "body", "text": "Bulls: At Washington on Saturday night."}
{"game_id": "0022100530", "chunk_id": "0022100530_023", "order": 23, "role": "closing", "text": "Pacers: At Cleveland on Sunday night."}
