{"game_id": "0022100266", "chunk_id": "0022100266_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — It would have been understandable if the Dallas Mavericks folded in overtime against the Los Angeles Clippers after blowing a 10-point lead."}
{"game_id": "0022100266", "chunk_id": "0022100266_002", "order": 2, "role": "body", "text": "Kristaps Porzingis and Luka Dončić weren't about to let that happen, though, and they dominated the final five minutes."}
{"game_id": "0022100266", "chunk_id": "0022100266_003", "order": 3, "role": "body", "text": "Porzingis scored 30 points, including six in overtime, and Dončić had 26 in his return to the lineup as the Mavericks defeated the Clippers 112-104 on Tuesday night."}
{"game_id": "0022100266", "chunk_id": "0022100266_004", "order": 4, "role": "body", "text": "“For a second you are disappointed because we should have finished them off (in regulation), but I think we are growing mentally as a team,” said Porzingis, who has scored 20 or more points in a career-high seven straight games. “We realized it was five more minutes and we went out there and proved we are the superior team.”"}
{"game_id": "0022100266", "chunk_id": "0022100266_005", "order": 5, "role": "body", "text": "The Mavericks were up 102-92 late in the fourth quarter before the Clippers scored 11 of the final 12 points to force overtime, including a 3-pointer by Paul George at the buzzer."}
{"game_id": "0022100266", "chunk_id": "0022100266_006", "order": 6, "role": "body", "text": "“That second felt like it was forever. Guess I just got free and let it fly,” George said."}
{"game_id": "0022100266", "chunk_id": "0022100266_007", "order": 7, "role": "body", "text": "Dallas, though, put up the first seven points of overtime and outscored Los Angeles 9-1 to snap a three-game skid that included a six-point loss to the Clippers on Sunday."}
{"game_id": "0022100266", "chunk_id": "0022100266_008", "order": 8, "role": "body", "text": "Dončić, who missed the past three games due to left knee and ankle sprains, also had nine rebounds and nine assists in 41 minutes."}
{"game_id": "0022100266", "chunk_id": "0022100266_009", "order": 9, "role": "body", "text": "Dallas trailed by six at halftime but scored 38 points in the third quarter to grab an 80-76 advantage going into the final 12 minutes. Dončić had 15 points in the period and four assists that resulted in 10 additional Mavericks points."}
{"game_id": "0022100266", "chunk_id": "0022100266_010", "order": 10, "role": "body", "text": "“Overtime in the first game back? That's tough. But we got the win and I am happy,” Dončić said."}
{"game_id": "0022100266", "chunk_id": "0022100266_011", "order": 11, "role": "body", "text": "Dallas coach Jason Kidd was happy with the way his two stars played, especially Porzingis, who made all 10 of his free throws in 40 minutes of action."}
{"game_id": "0022100266", "chunk_id": "0022100266_012", "order": 12, "role": "body", "text": "“He’s playing at a very high level. He didn’t force anything. Sometimes when a star player comes back others might change their game but he didn't,” Kidd said. “Luca's prep work the past two days was at a high level. He has a great feel and there’s a big trust that the other guys were going to make plays.”"}
{"game_id": "0022100266", "chunk_id": "0022100266_013", "order": 13, "role": "body", "text": "Reggie Jackson led the Clippers with 31 points, his most in 2 1/2 seasons with the team. George scored 26."}
{"game_id": "0022100266", "chunk_id": "0022100266_014", "order": 14, "role": "body", "text": "Jackson hit a 3-pointer with 4.2 seconds remaining to get LA within 102-100. George then fouled Maxi Kleber with 1.9 seconds remaining. Kleber made his first free throw, but missed the second. George grabbed the rebound and called a timeout with 1.1 seconds remaining."}
{"game_id": "0022100266", "chunk_id": "0022100266_015", "order": 15, "role": "body", "text": "After the Clippers moved the ball to midcourt, Terance Mann passed to George, who hit a 3-pointer from the right corner to send it to overtime."}
{"game_id": "0022100266", "chunk_id": "0022100266_016", "order": 16, "role": "body", "text": "“We wanted a catch-and-shoot. Terance made a good pass and he made a big shot for us,” Clippers coach Tyronn Lue said."}
{"game_id": "0022100266", "chunk_id": "0022100266_017", "order": 17, "role": "body", "text": "The teams were facing each other for the second time in three days and things got chippy at times. Dončić received a technical foul late in the first quarter for taunting Mann. The two teams — who don't meet again until February — don't have many warm feelings toward each other after a contentious first-round playoff series last season that the Clippers won in seven games after trailing 3-1."}
{"game_id": "0022100266", "chunk_id": "0022100266_018", "order": 18, "role": "body", "text": "“Two great teams. Great players. Both of us come out and focus on our principles,” said Jackson, who also had 10 rebounds. “A lot of similarities. I think we’re gonna continue to have great battles.”"}
{"game_id": "0022100266", "chunk_id": "0022100266_020", "order": 20, "role": "body", "text": "The Mavericks were 6 of 30 on 3-pointers in Sunday's loss and started Tuesday's game missing their first 13 from beyond the arc before warming up. They went 12 for 26 the remainder of the game."}
{"game_id": "0022100266", "chunk_id": "0022100266_022", "order": 22, "role": "body", "text": "Mavericks: Dorian Finney-Smith, who had a season-high 17 points, scored eight points during a 16-5 run midway through the fourth to give Dallas a double-digit lead. ... Jalen Brunson injured his left foot in the first half and did not return. ... Reggie Bullock (non-COVID-19 illness) and Frank Ntilikina (right calf strain) did not play."}
{"game_id": "0022100266", "chunk_id": "0022100266_023", "order": 23, "role": "body", "text": "Clippers: George missed his first five shots from the field and didn’t get his first basket until there was 1:44 remaining in the first half. ... Marcus Morris Sr., who missed 15 games due to a left knee injury, had 10 points in 31 minutes. ... Nicolas Batum entered the NBA's health and safety protocol before the game and is expected to miss at least 10 days. LA canceled its morning shootaround for precautionary reasons. ... The Clippers' largest lead was 11 points during the first quarter and late in the second before Dallas scored the last five points to get to 48-42 at halftime. ... Mann received a flagrant 1 foul during the third quarter."}
{"game_id": "0022100266", "chunk_id": "0022100266_025", "order": 25, "role": "body", "text": "Mavericks: Return home to face the Washington Wizards on Saturday."}
{"game_id": "0022100266", "chunk_id": "0022100266_026", "order": 26, "role": "body", "text": "Clippers: Host the Detroit Pistons on Friday."}
