{"game_id": "0022100102", "chunk_id": "0022100102_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — With his team in a shooting slump to start the season and 3 of 21 from 3-point range during the first half Monday night, Los Angeles Clippers coach Ty Lue kept his message simple at halftime."}
{"game_id": "0022100102", "chunk_id": "0022100102_002", "order": 2, "role": "body", "text": "“There was nowhere to go but up,” he said."}
{"game_id": "0022100102", "chunk_id": "0022100102_003", "order": 3, "role": "body", "text": "Even though the Clippers faced a nine-point deficit late in the fourth quarter, they found their shooting touch just in time and were able to rally for a 99-94 victory over the Oklahoma City Thunder."}
{"game_id": "0022100102", "chunk_id": "0022100102_004", "order": 4, "role": "body", "text": "“I thought early on, we had great looks. ... Our bench guys started laughing, ‘We’re getting wide-open shots and we can’t make them,'\" Lue said. “I felt like we were in a good place.”"}
{"game_id": "0022100102", "chunk_id": "0022100102_005", "order": 5, "role": "body", "text": "Los Angeles came in 26th in the NBA in field goal shooting and was converting only 31.7% of its 3-pointers after making a record 41.1% last season. It appeared to be more of the same against the Thunder, especially after Josh Giddey’s jumper with 2:44 remaining put Oklahoma City in front 91-82."}
{"game_id": "0022100102", "chunk_id": "0022100102_006", "order": 6, "role": "body", "text": "But the Clippers (2-4) finally found their rhythm in the last three minutes as they went on a 17-3 run to take the lead. They were 12 of 21 on 3s in the second half, including 6 for 9 in the fourth quarter."}
{"game_id": "0022100102", "chunk_id": "0022100102_007", "order": 7, "role": "body", "text": "Paul George scored 32 points, including 15 in the final period. George, who also had nine rebounds and seven assists, scored eight points during the decisive spurt, including a 10-footer with 1:08 left to give Los Angeles a 93-92 lead, its first since early in the first quarter."}
{"game_id": "0022100102", "chunk_id": "0022100102_008", "order": 8, "role": "body", "text": "“Our team was playing good defense. We were holding them. We were getting stops, so we couldn't finish with empty possessions,” said George, who has scored at least 29 points in four of the Clippers' six games. “We had to stay confident that shots were going to fall.\""}
{"game_id": "0022100102", "chunk_id": "0022100102_009", "order": 9, "role": "body", "text": "Reggie Jackson added 15 points, while Luke Kennard and Nicolas Batum scored 14 apiece."}
{"game_id": "0022100102", "chunk_id": "0022100102_010", "order": 10, "role": "body", "text": "“There was almost a dark cloud over us. We tried to keep it lighthearted,” Jackson said about the shooting woes. “As long as Coach kept having confidence in us.”"}
{"game_id": "0022100102", "chunk_id": "0022100102_011", "order": 11, "role": "body", "text": "Shai Gilgeous-Alexander had 28 points, including 15 in the third quarter for Oklahoma City (1-6), which led by 16 in the second. Darius Bazley and Giddey scored 15 apiece."}
{"game_id": "0022100102", "chunk_id": "0022100102_012", "order": 12, "role": "body", "text": "The Clippers cut the Thunder's lead to two a couple of times in the fourth quarter, but Oklahoma City was able to go on runs to get some breathing room. However, the Thunder weren't able to fend off one last Los Angeles rally."}
{"game_id": "0022100102", "chunk_id": "0022100102_013", "order": 13, "role": "body", "text": "“We didn't make the plays we needed to make. Overall we gave ourselves a chance to win, but they went and got the game and we didn't,” Thunder coach Mark Daigneault said. “We showed great poise throughout the game until that last stretch. We would have liked to close it but at the end of the day it is progress that we are putting ourselves in these situations on the road against a good team.”"}
{"game_id": "0022100102", "chunk_id": "0022100102_015", "order": 15, "role": "body", "text": "Oklahoma City snapped a 43-game streak dating to last season of allowing 100 or more points."}
{"game_id": "0022100102", "chunk_id": "0022100102_017", "order": 17, "role": "body", "text": "Los Angeles was outrebounded by at least 20 in losses to Cleveland and Portland, but broke even against the Thunder as both teams had 51 boards."}
{"game_id": "0022100102", "chunk_id": "0022100102_019", "order": 19, "role": "body", "text": "Derrick Favors’ 3-pointer during the first quarter gave the Thunder a 9-5 lead and was his first make from beyond the arc since the 2019-20 season. The 11-year veteran has hit only 37 3-pointers in his career."}
{"game_id": "0022100102", "chunk_id": "0022100102_021", "order": 21, "role": "body", "text": "Thunder: G Lu Dort missed the game due to a shoulder injury sustained Saturday at Golden State. ... F Gabriel Deck was also out of the lineup due to a bruised left heel. ... Aleksej Pokusevski had nine points and an assist in the second quarter."}
{"game_id": "0022100102", "chunk_id": "0022100102_022", "order": 22, "role": "body", "text": "Clippers: Los Angeles set a season high for rebounds, including 12 from Isaiah Hartenstein. It was the third-year center's eighth career game with 12 or more boards. ... Jackson went over 8,000 career points."}
{"game_id": "0022100102", "chunk_id": "0022100102_024", "order": 24, "role": "body", "text": "Thunder: Remain in Los Angeles to face the Lakers on Thursday."}
{"game_id": "0022100102", "chunk_id": "0022100102_025", "order": 25, "role": "body", "text": "Clippers: Visit Minnesota on Wednesday for the first of back-to-back games against the Timberwolves."}
