{"game_id": "0022100641", "chunk_id": "0022100641_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Pascal Siakam had 30 points, 10 assists and 10 rebounds for his second career triple-double and the Toronto Raptors overcame an early 15-point deficit to beat the cold-shooting Milwaukee Bucks 103-96 on Saturday night."}
{"game_id": "0022100641", "chunk_id": "0022100641_002", "order": 2, "role": "body", "text": "“I just try to come out every night with just the same intensity and same energy,” Siakam said. “Tonight I think we all played well. We were flowing and moving the ball and just playing our brand of basketball.”"}
{"game_id": "0022100641", "chunk_id": "0022100641_003", "order": 3, "role": "body", "text": "OG Anunoby added 24 points to help the Raptors improve to 3-0 this season against the defending champion Bucks, who shot a season low 33.8%."}
{"game_id": "0022100641", "chunk_id": "0022100641_004", "order": 4, "role": "body", "text": "Toronto has won five straight in the series."}
{"game_id": "0022100641", "chunk_id": "0022100641_005", "order": 5, "role": "body", "text": "“I think it shows our potential,” said Fred VanVleet, who had 17 points for Toronto. “We’re one of those teams I feel like can compete with anybody when we’re at our best. And when we’re not, we’re very average. The challenge is to be consistent and raise the floor and let your bad nights be better than what our bad nights have been.”"}
{"game_id": "0022100641", "chunk_id": "0022100641_006", "order": 6, "role": "body", "text": "Giannis Antetokounmpo led Milwaukee with 30 points, making all 17 of his free throws but going 6 of 17 from the field. He didn’t play in the previous two games with Toronto this season, with the Raptors winning 97-93 in Toronto on Dec. 2 and 117-111 in Milwaukee on Jan. 5."}
{"game_id": "0022100641", "chunk_id": "0022100641_007", "order": 7, "role": "body", "text": "“Just do more,” Antetokounmpo said. “It wasn’t enough tonight.”"}
{"game_id": "0022100641", "chunk_id": "0022100641_008", "order": 8, "role": "body", "text": "Chris Boucher had 15 for Toronto, and Precious Achiuwa added with 14 points and 10 rebounds as the Raptors bounced back one night after losing 103-87 at Detroit. Grayson Allen had 18 points for the Bucks, and Khris Middleton added 16."}
{"game_id": "0022100641", "chunk_id": "0022100641_009", "order": 9, "role": "body", "text": "After spending two minutes on the bench with five fouls, Siakam returned with 6:46 left in a tie game and made a jumper 21 seconds later. After Antetokounmpo tied it again with two free throws, Siakam hit a corner 3-pointer in front of the Bucks’ bench with 5:53 left to put the Raptors back in front for good."}
{"game_id": "0022100641", "chunk_id": "0022100641_010", "order": 10, "role": "body", "text": "“I was just trying to stay aggressive but not take any stupid foul,” Siakam said. “I think that was my mindset, really.”"}
{"game_id": "0022100641", "chunk_id": "0022100641_011", "order": 11, "role": "body", "text": "The Bucks took a 16-2 lead in the first four minutes and the Raptors missed 11 of their first 12 shots. Milwaukee extended the lead to 22-7."}
{"game_id": "0022100641", "chunk_id": "0022100641_012", "order": 12, "role": "body", "text": "“I just said, ‘Hey, listen, we’re generating good shots, just keep doing what you’re doing and settle down a little bit and fight back,’ ” Raptors coach Nick Nurse said."}
{"game_id": "0022100641", "chunk_id": "0022100641_013", "order": 13, "role": "body", "text": "Toronto chipped away at the deficit and tied it on Anunoby’s free throws with 45 seconds left in the half. Pat Connaughton made a 3-pointer with 38.5 seconds left to give the Bucks a 49-46 halftime lead."}
{"game_id": "0022100641", "chunk_id": "0022100641_014", "order": 14, "role": "body", "text": "The Raptors took their first lead at 53-52 on Siakam’s 11-foot jumper with 9:19 left in the third quarter. Achiuwa followed with a layup that capped a 9-0 spurt for Toronto."}
{"game_id": "0022100641", "chunk_id": "0022100641_015", "order": 15, "role": "body", "text": "Milwaukee tied it twice later in the third quarter and three more times in the first six minutes of the fourth period, but Toronto responded and regained the lead each of those instances."}
{"game_id": "0022100641", "chunk_id": "0022100641_016", "order": 16, "role": "body", "text": "“These guys are fighters,” Nurse said. “They love the challenge and they really fought hard tonight.”"}
{"game_id": "0022100641", "chunk_id": "0022100641_017", "order": 17, "role": "body", "text": "The Bucks were missing guard Jrue Holiday for a fifth straight game as he deals with a sore left ankle. Toronto was playing without Gary Trent Jr. (swollen left ankle) and Scottie Barnes (right knee)."}
{"game_id": "0022100641", "chunk_id": "0022100641_019", "order": 19, "role": "body", "text": "Raptors: Siakam has averaged 27.7 points in three games against the Bucks this season. ... Rookie Justin Champagnie had a career-high 12 rebounds."}
{"game_id": "0022100641", "chunk_id": "0022100641_020", "order": 20, "role": "body", "text": "Bucks: Wesley Matthews went to the locker room in the first quarter with a bruised collarbone but returned to the game in the second period. ... The Bucks made 32 of 35 free throws. ... Middleton shot 3 of 12. ... Bobby Portis had a double-double with 11 points and 11 rebounds. ... Antetokounmpo has scored at least 30 points in nine of his last 10 games."}
{"game_id": "0022100641", "chunk_id": "0022100641_022", "order": 22, "role": "body", "text": "Raptors: At Miami on Monday night."}
