{"game_id": "0022100034", "chunk_id": "0022100034_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Ja Morant led five starters in double figures with 28 points and the Memphis Grizzlies defeated the Los Angeles Clippers 120-114 in their home opener Saturday night."}
{"game_id": "0022100034", "chunk_id": "0022100034_002", "order": 2, "role": "body", "text": "Morant burned Cleveland for 37 points — second-most in franchise history in a season opener — in the Grizzlies’ 11-point win. He came back strong to open a four-game West Coast trip in which the Grizzlies face three playoff teams from last season."}
{"game_id": "0022100034", "chunk_id": "0022100034_003", "order": 3, "role": "body", "text": "The Clippers twice got within two points in the final 1:14 on baskets by Paul George, who finished with 41 points — seven off his career high — and 10 rebounds."}
{"game_id": "0022100034", "chunk_id": "0022100034_004", "order": 4, "role": "body", "text": "But Jaren Jackson Jr. answered with a 3-pointer that kept the Grizzlies in front 119-114 with 17 seconds to go."}
{"game_id": "0022100034", "chunk_id": "0022100034_005", "order": 5, "role": "body", "text": "“You can hear the crowd just feel sick,” Jackson said. “It’s a good feeling.”"}
{"game_id": "0022100034", "chunk_id": "0022100034_006", "order": 6, "role": "body", "text": "Memphis coach Taylor Jenkins said, \"Ja collapsing the defense and then kicking out and trusting his teammate to make a big shot. That's leading by example.”"}
{"game_id": "0022100034", "chunk_id": "0022100034_007", "order": 7, "role": "body", "text": "George missed a 25-footer and Luke Kennard fouled Desmond Bane, who made 1 of 2 free throws. George missed again from the left side as the Clippers fell to 0-2 to start the season."}
{"game_id": "0022100034", "chunk_id": "0022100034_008", "order": 8, "role": "body", "text": "“I’m happy we fought, but that can’t be who we are, just be happy that we played hard,” George said. “Play hard should be a given. We got to win games.”"}
{"game_id": "0022100034", "chunk_id": "0022100034_009", "order": 9, "role": "body", "text": "De’Anthony Melton added 22 points, Jackson had 21 points, Bane had 19 points and Steven Adams 17 points and nine rebounds for the Grizzlies."}
{"game_id": "0022100034", "chunk_id": "0022100034_010", "order": 10, "role": "body", "text": "“To close out this one was good, especially on the road,” Jackson said."}
{"game_id": "0022100034", "chunk_id": "0022100034_011", "order": 11, "role": "body", "text": "Reggie Jackson added 17 points for the Clippers."}
{"game_id": "0022100034", "chunk_id": "0022100034_012", "order": 12, "role": "body", "text": "Memphis outscored the Clippers 30-11 to open the third and take an 89-73 lead after trailing much of the first half. Morant and Adams scored nine points each, and Melton and Bane hit back-to-back 3-pointers."}
{"game_id": "0022100034", "chunk_id": "0022100034_013", "order": 13, "role": "body", "text": "“He’s just explosive. He’s so good and so fast,” George said of Morant. “He made it tough for us, he put a lot of pressure on us.”"}
{"game_id": "0022100034", "chunk_id": "0022100034_014", "order": 14, "role": "body", "text": "The Clippers closed with a 14-8 spurt, including consecutive 3-pointers from George, to trail 97-89 going into the fourth."}
{"game_id": "0022100034", "chunk_id": "0022100034_015", "order": 15, "role": "body", "text": "“They were going zone, going physical, trapping and doing everything to get us out of our rhythm, but we made some big-time plays,” Jenkins said."}
{"game_id": "0022100034", "chunk_id": "0022100034_017", "order": 17, "role": "body", "text": "Grizzlies: Ziaire Williams, the 10th overall pick in the NBA draft, finished with six points, two rebounds and two assists in 16 minutes."}
{"game_id": "0022100034", "chunk_id": "0022100034_018", "order": 18, "role": "body", "text": "Clippers: Dressed in street clothes, Kawhi Leonard sat next to the coaches on the bench. He’s rehabbing from surgery in July for a partial tear of his right ACL. ... Lost to Golden State by three in their season opener."}
{"game_id": "0022100034", "chunk_id": "0022100034_020", "order": 20, "role": "body", "text": "Grizzlies: Play the Lakers on Sunday as part of a four-game trip, tied for their longest of the season."}
{"game_id": "0022100034", "chunk_id": "0022100034_021", "order": 21, "role": "body", "text": "Clippers: Host Portland on Monday in the middle of a three-game homestand."}
