{"game_id": "0022100139", "chunk_id": "0022100139_001", "order": 1, "role": "lead", "text": "TORONTO -- — Kevin Durant had 31 points, James Harden scored 16 of his 28 points in the fourth quarter and the Brooklyn Nets won their fifth straight game, beating the Toronto Raptors 116-103 on Sunday."}
{"game_id": "0022100139", "chunk_id": "0022100139_002", "order": 2, "role": "body", "text": "“Our defense was there when we needed it to be,” Durant said. “We got stops and made shots.”"}
{"game_id": "0022100139", "chunk_id": "0022100139_003", "order": 3, "role": "body", "text": "Harden narrowly missed his second straight triple-double, finishing with 10 rebounds and eight assists."}
{"game_id": "0022100139", "chunk_id": "0022100139_004", "order": 4, "role": "body", "text": "“When he’s at that level, he makes us go,” Brooklyn’s Blake Griffin said about Harden. “We, as a team, can go to a different level.”"}
{"game_id": "0022100139", "chunk_id": "0022100139_005", "order": 5, "role": "body", "text": "Harden missed his first seven shots from beyond the arc before connecting with 4:34 left to play the fourth, extending a seven-point Nets lead to double digits. He added two more from distance in the final quarter."}
{"game_id": "0022100139", "chunk_id": "0022100139_006", "order": 6, "role": "body", "text": "“James was special there in the fourth,” Durant said."}
{"game_id": "0022100139", "chunk_id": "0022100139_007", "order": 7, "role": "body", "text": "Griffin had 14 points and 11 rebounds, and Patty Mills scored 13 points to help Steve Nash earn the victory in his first game in his home country as an NBA head coach."}
{"game_id": "0022100139", "chunk_id": "0022100139_008", "order": 8, "role": "body", "text": "“That means a lot,” Nash said. “This is a very special place for me. Not only Canada, but Toronto. I’ve spent so much of my time here, I have so many close friends, relationships, and memories in this city. For me, this is definitely a sweet win.”"}
{"game_id": "0022100139", "chunk_id": "0022100139_009", "order": 9, "role": "body", "text": "Durant reached 20 points for the 10th straight game, extending both his career-best streak to begin a season and the Nets’ record for 20-point games at the start of a season."}
{"game_id": "0022100139", "chunk_id": "0022100139_010", "order": 10, "role": "body", "text": "“Like we said since Day 1, he’s been unbelievable this season at both ends of the floor, rebounding, scoring, facilitating” Nash said."}
{"game_id": "0022100139", "chunk_id": "0022100139_011", "order": 11, "role": "body", "text": "Durant was playing in Toronto for the first time since tearing his left Achilles tendon while playing for Golden State in Game 5 of the 2019 NBA Finals."}
{"game_id": "0022100139", "chunk_id": "0022100139_012", "order": 12, "role": "body", "text": "“The last time I was here was one of my lowest moments as a basketball player,” Durant said. “It’s good to come back here playing and see the fans again.”"}
{"game_id": "0022100139", "chunk_id": "0022100139_013", "order": 13, "role": "body", "text": "The 11-time All-Star shot 11 for 18, going 3 for 6 from 3-point range, and 6 for 6 at the free throw line. He had seven rebounds and seven assists."}
{"game_id": "0022100139", "chunk_id": "0022100139_014", "order": 14, "role": "body", "text": "Fred VanVleet scored 21 points, OG Anunoby had 16 and Gary Trent Jr. scored 15 points for the Raptors, who have lost two straight after winning the previous five."}
{"game_id": "0022100139", "chunk_id": "0022100139_015", "order": 15, "role": "body", "text": "Toronto (7 for 25) matched its season-low with seven made 3-pointers. The Raptors also had seven in their season-opening loss to Washington."}
{"game_id": "0022100139", "chunk_id": "0022100139_016", "order": 16, "role": "body", "text": "Raptors forward Pascal Siakam made his first start of the season after missing the first 10 games because of left shoulder surgery. Siakam scored 15 points in 25 minutes. He shot 5 for 12."}
{"game_id": "0022100139", "chunk_id": "0022100139_017", "order": 17, "role": "body", "text": "“My legs were heavy,” Siakam said. “I was out of breath after about three minutes.”"}
{"game_id": "0022100139", "chunk_id": "0022100139_018", "order": 18, "role": "body", "text": "Toronto led 60-53 at halftime, but Brooklyn reclaimed the lead with a 9-0 run to begin the third that was capped by a 3-pointer from Griffin. Durant scored 13 points in the quarter and Griffin had seven as the Nets took an 88-77 lead to the fourth."}
{"game_id": "0022100139", "chunk_id": "0022100139_020", "order": 20, "role": "body", "text": "Nets: F James Johnson (left knee) was inactive. … The Nets won consecutive games against Toronto for the first time since February and April, 2015.… Griffin said he expects to play in the second half of Brooklyn’s back-to-back at Chicago tomorrow night."}
{"game_id": "0022100139", "chunk_id": "0022100139_021", "order": 21, "role": "body", "text": "Raptors: Siakam replaced Precious Achiuwa in the starting lineup. … C Khem Birch (right knee) was inactive. … Toronto shot 2 for 11 from 3-point range in the first. … For the second straight game, the Raptors didn’t attempt a free throw in the first quarter. … Toronto waived F Sam Dekker Saturday. … Rookie Dalano Banton celebrated his 22nd birthday."}
{"game_id": "0022100139", "chunk_id": "0022100139_023", "order": 23, "role": "body", "text": "Toronto plays eight of its next nine games away from home."}
{"game_id": "0022100139", "chunk_id": "0022100139_025", "order": 25, "role": "body", "text": "Nash represented Canada at the 2000 Summer Olympics and was general manager of Canada’s men’s national team from 2012 to 2019."}
{"game_id": "0022100139", "chunk_id": "0022100139_027", "order": 27, "role": "body", "text": "Nets: At Chicago on Monday night."}
{"game_id": "0022100139", "chunk_id": "0022100139_028", "order": 28, "role": "body", "text": "Raptors: At Boston on Wednesday night."}
