{"game_id": "0022100404", "chunk_id": "0022100404_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Kevin Love made five 3-pointers and scored all 23 of his points in the second half, leading the Cleveland Cavaliers to their fourth straight win, 105-94 over the Miami Heat on Monday night."}
{"game_id": "0022100404", "chunk_id": "0022100404_002", "order": 2, "role": "body", "text": "Love made 6 of 10 field goals, 5 of 8 from beyond the arc, and hit all six of his free throws in his highest scoring game of the season. He also grabbed nine rebounds."}
{"game_id": "0022100404", "chunk_id": "0022100404_003", "order": 3, "role": "body", "text": "The Cavaliers have four consecutive double-digit victories and moved into fourth place in the Eastern Conference at 17-12."}
{"game_id": "0022100404", "chunk_id": "0022100404_004", "order": 4, "role": "body", "text": "“We’re living in the moment, but our big-picture goals are toward the end of the year,” Love said. “Two things we do extremely well are compete and play defense. And offensively, that’s the thing about this team, anybody at any time can whip it up.”"}
{"game_id": "0022100404", "chunk_id": "0022100404_005", "order": 5, "role": "body", "text": "Isaac Okoro scored 18 points, Jarrett Allen had 17 points, eight rebounds and three assists, and Darius Garland added 16 points and five assists for Cleveland, which has won eight of its last 10 games."}
{"game_id": "0022100404", "chunk_id": "0022100404_006", "order": 6, "role": "body", "text": "“Kevin has been to the mountain top, so a little blood, sweat and tears is nothing for him after that,” Cavaliers coach J.B. Bickerstaff said. “He’s leading us in that way. We all know his commitment and buy-in to this team.”"}
{"game_id": "0022100404", "chunk_id": "0022100404_007", "order": 7, "role": "body", "text": "P.J. Tucker had a season-high 23 points, nine rebounds and five assists, Kyle Lowry scored 22 points, and Tyler Herro had 12 points for the Heat. Miami had its two-game winning streak snapped in the opener of a four-game trip."}
{"game_id": "0022100404", "chunk_id": "0022100404_008", "order": 8, "role": "body", "text": "The Heat had 11 players in uniform and were without Jimmy Butler, who missed his third straight game with a bruised tailbone. Forward Caleb Martin is in the NBA’s health and safety protocols for COVID-19."}
{"game_id": "0022100404", "chunk_id": "0022100404_009", "order": 9, "role": "body", "text": "“To be honest, we didn’t communicate well enough on the defensive end,” Lowry said. “That’s what killed us, but scoring 94 points is not enough.”"}
{"game_id": "0022100404", "chunk_id": "0022100404_010", "order": 10, "role": "body", "text": "Love also matched his season high with 24 minutes, giving Cleveland its largest lead at 100-84 with his final 3-pointer. The five-time All-Star is coming off the bench for the first time since 2009-10 with the Timberwolves."}
{"game_id": "0022100404", "chunk_id": "0022100404_011", "order": 11, "role": "body", "text": "“Kevin threw his cane to the side and went out and balled out,” Allen said, laughing. “He played amazing.”"}
{"game_id": "0022100404", "chunk_id": "0022100404_012", "order": 12, "role": "body", "text": "Cavaliers rookie Evan Mobley was limited to nine points and five rebounds. Ricky Rubio had seven points and seven assists, becoming the 12th active player with 5,000 career assists."}
{"game_id": "0022100404", "chunk_id": "0022100404_013", "order": 13, "role": "body", "text": "After Cleveland jumped ahead 55-41, Miami used a 23-9 run spanning halftime to tie the score on a Tucker jumper. Love answered with a 3-pointer to put the Cavaliers in front to stay."}
{"game_id": "0022100404", "chunk_id": "0022100404_014", "order": 14, "role": "body", "text": "“We’re playing excellent basketball and doing everything we can as a team, and it’s working,” Allen said."}
{"game_id": "0022100404", "chunk_id": "0022100404_015", "order": 15, "role": "body", "text": "Neither team led by more than six until an Allen dunk put the Cavaliers up 46-38 with 2:51 remaining in the second. The Heat attempted 19 3-pointers before taking their first free throw, finishing 13 of 40 on 3s and 5 of 9 from the foul line."}
{"game_id": "0022100404", "chunk_id": "0022100404_017", "order": 17, "role": "body", "text": "After playing in Miami on Saturday, the Bulls had their next two games postponed due to a COVID outbreak on the team. Positive test results in the NBA and NHL are beginning to affect both leagues’ schedules, but Heat coach Erik Spoelstra isn’t panicking. “It’s not something we can control,” Spoelstra said. “This is the world that we’re living in. We feel blessed that our profession continues to go forward with the proper precautions.”"}
{"game_id": "0022100404", "chunk_id": "0022100404_019", "order": 19, "role": "body", "text": "Heat: G Victor Oladipo (right knee injury recovery) traveled with the team to Cleveland, but coach Erik Spoelstra said it doesn’t mean that a timetable has been established for his return. Oladipo underwent quadriceps surgery on May 13. … C Bam Adebayo (right thumb surgery) will not return until at least January. .... F Markieff Morris (neck whiplash) has not played since Nov. 8."}
{"game_id": "0022100404", "chunk_id": "0022100404_020", "order": 20, "role": "body", "text": "Cavaliers: F Evan Mobley leads all rookies with seven double-doubles. Cleveland is 6-1 in those games. … Two-way C Tacko Fall, a Cavaliers and Celtics fan favorite, remains on the active roster. The 7-foot-6 Central Florida product has five points and five rebounds in 25 minutes this season. … G Dylan Windler was recalled from his G League assignment after averaging 16.7 points in three games."}
{"game_id": "0022100404", "chunk_id": "0022100404_022", "order": 22, "role": "body", "text": "Heat: Visit Philadelphia on Wednesday night."}
{"game_id": "0022100404", "chunk_id": "0022100404_023", "order": 23, "role": "body", "text": "Cavaliers: Host Houston on Wednesday night."}
