{"game_id": "0022100304", "chunk_id": "0022100304_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — LeBron James and Isaiah Stewart had no Round 2 in the Lakers' rematch with the Pistons."}
{"game_id": "0022100304", "chunk_id": "0022100304_002", "order": 2, "role": "body", "text": "James was too busy making sure Los Angeles got the same decision he wasn't around to see last week in Detroit."}
{"game_id": "0022100304", "chunk_id": "0022100304_003", "order": 3, "role": "body", "text": "James had 33 points, nine assists and no confrontations with Stewart in the Lakers' 110-106 victory Sunday night."}
{"game_id": "0022100304", "chunk_id": "0022100304_004", "order": 4, "role": "body", "text": "Russell Westbrook had 25 points and nine assists, and Anthony Davis added 24 points and 10 rebounds. The Lakers returned to .500 with their second win over Detroit in eight days, rebounding from an embarrassing triple-overtime loss to Sacramento on Friday."}
{"game_id": "0022100304", "chunk_id": "0022100304_005", "order": 5, "role": "body", "text": "“That Sac game lingered with us for a couple of days, giving that game away,” Davis said. “I think we did a good job defensively tonight, getting this kick-start to a winning streak.”"}
{"game_id": "0022100304", "chunk_id": "0022100304_006", "order": 6, "role": "body", "text": "Stewart was booed repeatedly and zealously by the Lakers' crowd, but he appeared to have no significant interactions with James after both players were ejected from the teams’ meeting in Detroit a week earlier for an ugly altercation."}
{"game_id": "0022100304", "chunk_id": "0022100304_007", "order": 7, "role": "body", "text": "James was assessed a Flagrant-2 foul and ejected when he hit Stewart in the face while they jockeyed for rebounding position. An infuriated Stewart repeatedly attempted to charge at James in the aftermath, earning his own ejection. James served a one-game suspension and Stewart got a two-game ban."}
{"game_id": "0022100304", "chunk_id": "0022100304_008", "order": 8, "role": "body", "text": "Stewart kept the pot stirring Friday by saying he didn’t think James’ blow had been accidental, as James claims it was. The 20-year-old Stewart is 3 1/2 years older than James’ oldest son, Bronny."}
{"game_id": "0022100304", "chunk_id": "0022100304_009", "order": 9, "role": "body", "text": "James was well past the brouhaha before the rematch."}
{"game_id": "0022100304", "chunk_id": "0022100304_010", "order": 10, "role": "body", "text": "“We were mad as heck the other night after that Sac loss,” James said. “We made it a point to come in today very focused on our game plan, learning from our mistakes, and we got better. Right there lets me know we're a team that cares and wants to get better.”"}
{"game_id": "0022100304", "chunk_id": "0022100304_011", "order": 11, "role": "body", "text": "The Pistons also didn't feel there was any extra juice to the rematch."}
{"game_id": "0022100304", "chunk_id": "0022100304_012", "order": 12, "role": "body", "text": "“It’s just basketball,” Jerami Grant said. “Things happen on the court, but you’ve got to get your mind right and get ready to play.”"}
{"game_id": "0022100304", "chunk_id": "0022100304_013", "order": 13, "role": "body", "text": "Grant scored 32 points and No. 1 pick Cade Cunningham had 15 points and 11 rebounds in the Pistons’ sixth straight loss. Detroit followed up its 11-point loss to the Clippers at Staples Center on Friday by being more competitive against Los Angeles' other team, but falling short again."}
{"game_id": "0022100304", "chunk_id": "0022100304_014", "order": 14, "role": "body", "text": "Stewart had five points and six rebounds in 27 minutes in the rematch."}
{"game_id": "0022100304", "chunk_id": "0022100304_015", "order": 15, "role": "body", "text": "“We did a great job moving the ball,” Grant said. “Almost played a complete game. We had a mental lapse in the third quarter and let them get a lead, but other than that, I think we played well.”"}
{"game_id": "0022100304", "chunk_id": "0022100304_016", "order": 16, "role": "body", "text": "Los Angeles once again failed to pull away from a struggling opponent, but still beat the Pistons at Staples Center for the fifth straight time."}
{"game_id": "0022100304", "chunk_id": "0022100304_017", "order": 17, "role": "body", "text": "The Lakers ran out to a 19-point lead in the third quarter with a 16-0 run, the most consecutive points they've scored this season. But Los Angeles has rarely sustained any significant stretch of good play this season, and the Pistons got to 97-91 with 5:48 left with a 13-2 run."}
{"game_id": "0022100304", "chunk_id": "0022100304_018", "order": 18, "role": "body", "text": "Grant's free throws cut the lead to 108-104 with 16.7 seconds left, but the Lakers hung on."}
{"game_id": "0022100304", "chunk_id": "0022100304_019", "order": 19, "role": "body", "text": "“It’s disappointing (not to win more convincingly), but at the same time I understand the process,\" Westbrook said. “Adversity is something that I think is great in life in general. It builds character. It shows who you really are when things aren’t going your way.\""}
{"game_id": "0022100304", "chunk_id": "0022100304_021", "order": 21, "role": "body", "text": "Pistons: Kelly Olynyk missed his 10th straight game with a left knee sprain. ... Frank Jackson scored 17 points."}
{"game_id": "0022100304", "chunk_id": "0022100304_022", "order": 22, "role": "body", "text": "Lakers: Austin Reaves got his first action since Nov. 8, going scoreless in six minutes. The rookie missed 10 games with a hamstring injury. ... Wayne Ellington scored five points on his 34th birthday. The Lakers have five players older than him. ... James said he didn't aggravate his recent abdominal injury in a late collision: “I'll be ready to go Tuesday.”"}
{"game_id": "0022100304", "chunk_id": "0022100304_024", "order": 24, "role": "body", "text": "Detroit coach Dwane Casey praised his young team’s improvements on offense, including 29 assists on 38 field goals and 39.4% shooting on 3-pointers."}
{"game_id": "0022100304", "chunk_id": "0022100304_025", "order": 25, "role": "body", "text": "“We found the open guys and made our shots,” Casey said. “The only concerning part with the offense is our (17) turnovers. That’s huge. That’s 17 attempts you take away for shooting the ball in a five-point game. Careless passing. We put our finger in one hole, and another one opens up. Nobody gets a participation trophy. Close doesn’t count.”"}
{"game_id": "0022100304", "chunk_id": "0022100304_027", "order": 27, "role": "body", "text": "Pistons: At Portland on Tuesday night."}
{"game_id": "0022100304", "chunk_id": "0022100304_028", "order": 28, "role": "body", "text": "Lakers: At Sacramento on Tuesday night."}
