{"game_id": "0022100088", "chunk_id": "0022100088_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Devin Booker was feeling good on the court for his 25th birthday and saw Mikal Bridges streaking toward the rim. He let the pass fly from well beyond halfcourt and Bridges soared through the air, corralled it with two hands and stuffed it through the hoop."}
{"game_id": "0022100088", "chunk_id": "0022100088_002", "order": 2, "role": "body", "text": "For the first time in a while, the Phoenix Suns looked a lot like the Suns who made it to the NBA Finals last year."}
{"game_id": "0022100088", "chunk_id": "0022100088_003", "order": 3, "role": "body", "text": "Booker had 27 points and nine assists, Deandre Ayton added 17 points and 12 rebounds and the Suns beat the Cleveland Cavaliers 101-92 on Saturday night."}
{"game_id": "0022100088", "chunk_id": "0022100088_004", "order": 4, "role": "body", "text": "“It was just getting out, picking up the pace a little bit,\" Booker said. “Just playing basketball.”"}
{"game_id": "0022100088", "chunk_id": "0022100088_005", "order": 5, "role": "body", "text": "The Suns used a 50-12 run that Booker called “crazy” to break open the game. The dominant stretch — which included a lot of Suns fast-break buckets and a lot of Cavs turnovers — lasted from the middle of the second quarter to late in the third and turned a 14-point deficit into a 24-point lead."}
{"game_id": "0022100088", "chunk_id": "0022100088_006", "order": 6, "role": "body", "text": "“We think we're capable of that all the time,” Suns guard Cameron Johnson said. \"You keep your head down, keep pushing, keep trying to get better, keep trying to get back to high-level championship basketball. I think we've got a good team, good guys who always stick together."}
{"game_id": "0022100088", "chunk_id": "0022100088_007", "order": 7, "role": "body", "text": "“That period of the game showed it.”"}
{"game_id": "0022100088", "chunk_id": "0022100088_008", "order": 8, "role": "body", "text": "It was a reassuring stretch for the Suns, who haven't looked much like the team that came two victories away from winning the NBA Finals last season. Phoenix is 2/3 this season and had lost two straight."}
{"game_id": "0022100088", "chunk_id": "0022100088_009", "order": 9, "role": "body", "text": "Chris Paul added 16 points and 10 assists. Ayton shot 8 of 10 from the field but left in the second half with a right leg contusion. The 6-foot-11 forward said he banged knees with one of the Cavaliers during the game, but was feeling OK."}
{"game_id": "0022100088", "chunk_id": "0022100088_010", "order": 10, "role": "body", "text": "The Cavaliers managed to close the gap to 78-65 by the end of the third but couldn't make up enough ground in the fourth. It was the second loss in two days for Cleveland, which also fell to the Lakers 113-101 on Friday night."}
{"game_id": "0022100088", "chunk_id": "0022100088_011", "order": 11, "role": "body", "text": "Cedi Osman led the Cavaliers with 20 points off the bench. He made 6 of 12 shots from 3-point range. Cleveland coach J.B. Bickerstaff pulled most of his starters by the end of the 50-12 run, frustrated by their ineffectiveness."}
{"game_id": "0022100088", "chunk_id": "0022100088_012", "order": 12, "role": "body", "text": "The Cavaliers had 19 turnovers."}
{"game_id": "0022100088", "chunk_id": "0022100088_013", "order": 13, "role": "body", "text": "The Cavaliers led by as many as 14 in the second quarter but the Suns responded with a 19-2 run to end the first half and took a 50-46 lead into the break. Ayton had 11 points, nine rebounds and three steals. Darius Garland scored nine for the Cavs."}
{"game_id": "0022100088", "chunk_id": "0022100088_015", "order": 15, "role": "body", "text": "The Cavaliers announced that they've picked up the fourth-year option for Garland and Dylan Windler, along with the third-year option for guard Isaac Okoro. The moves mean all of them are under contract through the 2022-23 season."}
{"game_id": "0022100088", "chunk_id": "0022100088_016", "order": 16, "role": "body", "text": "Garland was the No. 5 overall pick in 2019 and has averaged 14.7 points over 117 games played. Windler was the 26th pick in 2019 and averaged 5.2 points and 3.5 rebounds last year as a backup. Okoro was the No. 5 pick in the 2020 draft and has averaged 9.5 points in his career."}
{"game_id": "0022100088", "chunk_id": "0022100088_018", "order": 18, "role": "body", "text": "Cavaliers: Okoro didn't play because of a left hamstring strain. G Kevin Pangos was out for personal reasons."}
{"game_id": "0022100088", "chunk_id": "0022100088_019", "order": 19, "role": "body", "text": "Suns: G Cameron Payne didn't play because of a right hamstring strain. ... The Suns missed their first nine 3-pointers. They finished 6 of 26 (23%) from long range. ... Johnson had 10 points off the bench. JaVale McGee added eight points and seven rebounds."}
{"game_id": "0022100088", "chunk_id": "0022100088_021", "order": 21, "role": "body", "text": "Cavaliers: Wrap up a five-game road trip against the Hornets on Monday."}
{"game_id": "0022100088", "chunk_id": "0022100088_022", "order": 22, "role": "body", "text": "Suns: Host the Pelicans on Tuesday."}
