{"game_id": "0022100650", "chunk_id": "0022100650_001", "order": 1, "role": "lead", "text": "DALLAS -- — Kristaps Porzingis got the call on the first play of his first game in two weeks for the Dallas Mavericks."}
{"game_id": "0022100650", "chunk_id": "0022100650_002", "order": 2, "role": "body", "text": "That started a strong return for the 7-foot-3 Latvian."}
{"game_id": "0022100650", "chunk_id": "0022100650_003", "order": 3, "role": "body", "text": "Porzingis scored 12 of his 19 points in the first quarter and the Mavericks cruised to a 108-92 victory over the Orlando Magic on Saturday night."}
{"game_id": "0022100650", "chunk_id": "0022100650_004", "order": 4, "role": "body", "text": "The 7-foot-3 Latvian was sharp from the start after missing seven games because of COVID-19. Porzingis hit four of five shots in the opening quarter, starting with a post-up bucket and finishing with a 3-pointer that barely beat the buzzer after a pump fake created a clean look from the corner."}
{"game_id": "0022100650", "chunk_id": "0022100650_005", "order": 5, "role": "body", "text": "“Kind of makes me comfortable right off the bat,” Porzingis said of getting the first basket 22 seconds in. “And then just finding opportunities within the offense. That’s what I wanted to do. I didn’t want to force anything too much first game back.”"}
{"game_id": "0022100650", "chunk_id": "0022100650_006", "order": 6, "role": "body", "text": "Luka Doncic scored 23 points in the eighth win in nine games for the Mavericks. Dallas was playing a night after ending Memphis' 11-game winning streak and got coach Jason Kidd back from a four-game absence after his positive COVID-19 test."}
{"game_id": "0022100650", "chunk_id": "0022100650_007", "order": 7, "role": "body", "text": "Robin Lopez, Moritz Wagner and Jalen Suggs scored 16 points apiece for the Magic, who never led a night after ending a 10-game losing streak with a victory at Charlotte. Orlando is an NBA-worst 8-36."}
{"game_id": "0022100650", "chunk_id": "0022100650_008", "order": 8, "role": "body", "text": "The Magic had eight of their 15 turnovers in the first quarter, which ended with them trailing by nine."}
{"game_id": "0022100650", "chunk_id": "0022100650_009", "order": 9, "role": "body", "text": "“Just carelessness,” point guard Cole Anthony said. “That was really the only thing to it. To win in this league, you've got value possessions, try to get a shot every time.”"}
{"game_id": "0022100650", "chunk_id": "0022100650_010", "order": 10, "role": "body", "text": "After Orlando cut a steady double-digit deficit to eight on a jump hook from Lopez in the third quarter, the Mavericks quickly pushed it back to at least 10 for good when Dwight Powell dunked on an assist from Jalen Brunson, who scored 19 points. Dallas took its first 20-point lead early in the fourth quarter."}
{"game_id": "0022100650", "chunk_id": "0022100650_011", "order": 11, "role": "body", "text": "Kidd said the Mavericks would keep an eye on Porzingis in terms of conditioning, and he ended up playing 28 minutes, slightly below his season average. All of Porzingis' points after the first quarter came at the free throw line, where he was 9 of 12."}
{"game_id": "0022100650", "chunk_id": "0022100650_012", "order": 12, "role": "body", "text": "Dallas attempted 38 free throws, making 32. It was a season high in attempts for the Mavericks, and the most for an Orlando opponent this season."}
{"game_id": "0022100650", "chunk_id": "0022100650_013", "order": 13, "role": "body", "text": "“They got guys that know how to draw fouls,” said first-year Magic coach Jamahl Mosley, who spent the past seven seasons as a Dallas assistant. “Defending without fouling has to be a primary thing for us. Thirty-eight free throws is way too many.”"}
{"game_id": "0022100650", "chunk_id": "0022100650_015", "order": 15, "role": "body", "text": "Magic: Mosley was Rick Carlisle's top assistant for the Mavericks when both left the organization. Carlisle is now coach at Indiana. This was Mosley's first trip to Dallas as Magic coach. “The people here, the relationships that I've built and my family has built, it's just great to see the wonderful people that have been here,” he said before the game. ... Chuma Okeke was called for a technical foul in the third quarter after a review that appeared to be initiated over whether Anthony made excessive contact when he hit Doncic in the head on a foul."}
{"game_id": "0022100650", "chunk_id": "0022100650_016", "order": 16, "role": "body", "text": "Mavericks: F Marquese Chriss signed a multiyear deal after joining the Mavericks on 10-day contracts under the relaxed COVID-19 guidelines. Dallas waived C Willie Cauley-Stein to make room for Chriss on the roster. Cauley-Stein hadn't played since Nov. 27 and was on an extended absence for personal reasons. ... Tim Hardaway Jr. scored 17 points."}
{"game_id": "0022100650", "chunk_id": "0022100650_018", "order": 18, "role": "body", "text": "There were quite a few empty seats on what ended up being a quiet night and a business-like win for the Mavericks. For the final three quarters, Dallas led by double digits for all but 2:33. The loudest moment for the fans came early in the fourth quarter when Dallas got three offensive rebounds on the same possession. It was ultimately a letdown when the Magic finally got the rebound on a 28-foot missed 3 from Doncic."}
{"game_id": "0022100650", "chunk_id": "0022100650_020", "order": 20, "role": "body", "text": "Magic: Host Portland on Monday. The Trail Blazers have nine consecutive victories against the Magic."}
{"game_id": "0022100650", "chunk_id": "0022100650_021", "order": 21, "role": "body", "text": "Mavericks: Host Oklahoma City on Monday. The Mavericks won both games at the Thunder and can clinch the season series with a victory."}
