{"game_id": "0022100478", "chunk_id": "0022100478_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Kevin Huerter sat in the parking lot when he found out he flunked a COVID-19 test. Sharife Cooper was escorted out of Atlanta's locker room once his results came back."}
{"game_id": "0022100478", "chunk_id": "0022100478_002", "order": 2, "role": "body", "text": "The Hawks kept piling up players in health and safety protocols, and lost two more players during the game with injuries."}
{"game_id": "0022100478", "chunk_id": "0022100478_003", "order": 3, "role": "body", "text": "No matter. The Hawks are making a habit of upsets in Philly."}
{"game_id": "0022100478", "chunk_id": "0022100478_004", "order": 4, "role": "body", "text": "Bogdan Bogdanovic scored 10 of his 15 points in the final 3:44, leading the short-handed Hawks to a 98-96 win over the Philadelphia 76ers on Thursday night."}
{"game_id": "0022100478", "chunk_id": "0022100478_005", "order": 5, "role": "body", "text": "“We needed it desperately,” Bogdanovic said. “Tough times. It's crazy.”"}
{"game_id": "0022100478", "chunk_id": "0022100478_006", "order": 6, "role": "body", "text": "Joel Embiid missed a 21-footer at the horn in one of the Sixers' worst regular-season loss in coach Doc Rivers' two seasons."}
{"game_id": "0022100478", "chunk_id": "0022100478_007", "order": 7, "role": "body", "text": "“We approached the game too casually,” Rivers said."}
{"game_id": "0022100478", "chunk_id": "0022100478_008", "order": 8, "role": "body", "text": "The Hawks were without seven players because of health and safety protocols — and Cam Reddish sprained his right ankle and Delon Wright sprained his left — but stuck it to the Sixers, who were 9-1 favorites to"}
{"game_id": "0022100478", "chunk_id": "0022100478_009", "order": 9, "role": "body", "text": "Bogdanovic came off the bench and buried a 3 with 3:44 left for a 91-90 lead. He pulled up for a 23-footer that made it 96-92, and hit a step-back jumper with 1:25 left that stretched the lead to six. Bogdanovic missed his first 10 shots before he got hot in the fourth."}
{"game_id": "0022100478", "chunk_id": "0022100478_010", "order": 10, "role": "body", "text": "“I'm more locked in the last five minutes of the game,” he said."}
{"game_id": "0022100478", "chunk_id": "0022100478_011", "order": 11, "role": "body", "text": "Reddish scored 18 points and John Collins had 17 for the Hawks."}
{"game_id": "0022100478", "chunk_id": "0022100478_012", "order": 12, "role": "body", "text": "Embiid had 23 points and 10 rebounds for the Sixers, and hit a go-ahead 3-pointer with just under 6 minutes left for an 88-86 lead that wouldn’t stick. Tyrese Maxey scored 17 points."}
{"game_id": "0022100478", "chunk_id": "0022100478_013", "order": 13, "role": "body", "text": "Huerter, Trae Young, Clint Capela, Danilo Gallinari, Lou Williams, Cooper and Timothe Luwawu-Cabarrot all missed the game for health and safety protocols. The Hawks started Onyeka Okongwu, Skylar Mays, Delon Wright, Reddish and Collins, a far cry from the lineup that helped upset the Sixers in the second round of last season’s East playoffs. Collins was the lone starter from Game 7."}
{"game_id": "0022100478", "chunk_id": "0022100478_014", "order": 14, "role": "body", "text": "“We’re bringing in guys from the G League that we really don’t have time to practice with,” coach Nate McMillan said. “They haven’t had time to get with us on the floor. It’s really difficult to put them in situations to get out and play on the floor. You’re limited in what you can do.”"}
{"game_id": "0022100478", "chunk_id": "0022100478_015", "order": 15, "role": "body", "text": "The Hawks actually raced to a 19-point lead, getting two key points when Philadelphia’s Tobias Harris tipped the ball into the Hawks’ basket. That unofficially gave Harris four points, though only two for the Sixers."}
{"game_id": "0022100478", "chunk_id": "0022100478_016", "order": 16, "role": "body", "text": "It was that kind of start, and Sixers' fans let the home team have it and booed them off the court headed into breaks in the action."}
{"game_id": "0022100478", "chunk_id": "0022100478_017", "order": 17, "role": "body", "text": "Maxey led a Sixers rebound in the second quarter and his alley-oop pass to Matisse Thybulle right before the half tied the game at 51-all and sent the crowd into a frenzy. Maxey scored 11 points off the bench and helped the Sixers outscore Atlanta 33-19 in the second quarter."}
{"game_id": "0022100478", "chunk_id": "0022100478_018", "order": 18, "role": "body", "text": "“You've got to win tonight, honestly,” Rivers said."}
{"game_id": "0022100478", "chunk_id": "0022100478_020", "order": 20, "role": "body", "text": "Hawks: The short-handed Hawks lost 104-98 to Orlando a night earlier. ... The Hawks led 79-75 at the end of the third quarter."}
{"game_id": "0022100478", "chunk_id": "0022100478_021", "order": 21, "role": "body", "text": "76ers: Furkan Korkmaz started after missing the last three games with the flu. ... Maxey punctuated a big slam by pointing to his father, who had a courtside seat."}
{"game_id": "0022100478", "chunk_id": "0022100478_023", "order": 23, "role": "body", "text": "Rivers has talked to Ben Simmons of late and said the three-time All-Star guard was “doing good” as he continues to sit out the season. Will Simmons rescind his trade demand and eventually play for the Sixers? Rivers said that topic has been off-limits with the guard."}
{"game_id": "0022100478", "chunk_id": "0022100478_024", "order": 24, "role": "body", "text": "“That’s the stuff I’ve intentionally stayed out of. I have enough on my plate,” Rivers said. “I didn’t feel like I needed to add that.”"}
{"game_id": "0022100478", "chunk_id": "0022100478_026", "order": 26, "role": "body", "text": "Tyler Johnson, a seven-year veteran, made his Philly debut a day after he signed a 10-day contract. Rivers said it was hard for short-contract players to get up to speed on the playbook as the protocols have all but ended practices."}
{"game_id": "0022100478", "chunk_id": "0022100478_027", "order": 27, "role": "body", "text": "“He said, ‘I know I don’t know, but I know it’s basketball,’” Rivers said."}
{"game_id": "0022100478", "chunk_id": "0022100478_029", "order": 29, "role": "body", "text": "Hawks: Play Saturday in a Christmas game against New York."}
{"game_id": "0022100478", "chunk_id": "0022100478_030", "order": 30, "role": "body", "text": "76ers: Play Sunday at Washington."}
