{"game_id": "0022100502", "chunk_id": "0022100502_001", "order": 1, "role": "lead", "text": "ATLANTA -- — DeMar DeRozan scored 35 points, Zach LaVine added 30 and the Chicago Bulls won their fourth straight game, beating the short-handed Atlanta Hawks 130-118 on Monday night."}
{"game_id": "0022100502", "chunk_id": "0022100502_002", "order": 2, "role": "body", "text": "Cam Reddish finished with 33 points and Trae Young, cleared from health and safety protocols about 90 minutes before tipoff, returned to the starting lineup and scored 29 for Atlanta in the first game of a home-and-home set with the Bulls."}
{"game_id": "0022100502", "chunk_id": "0022100502_003", "order": 3, "role": "body", "text": "DeRozan was 14 for 20 from the field. LaVine, in his second game back after missing 15 days in protocols, went 11 for 21, including 5 of 8 from 3-point range. Nikola Vucevic got his 14th double-double with 24 points and 17 rebounds."}
{"game_id": "0022100502", "chunk_id": "0022100502_004", "order": 4, "role": "body", "text": "“We’re the veteran leaders of this team,\" DeRozan said. “That’s our job. We’ve got a couple of key guys out, and it was up to us to step up and play big, especially against an Atlanta Hawks team that was going to come out and play hard. The three main guys did what they were supposed to do and everybody else fell in line.\""}
{"game_id": "0022100502", "chunk_id": "0022100502_005", "order": 5, "role": "body", "text": "Vucevic banked in a 3 with 3:15 remaining to make it a 10-point lead and essentially put the game out of reach after DeRozan’s 15-foot fadeaway jumper padded the lead at 126-116. Coby White’s 3 from the left corner ended it with 1:19 left."}
{"game_id": "0022100502", "chunk_id": "0022100502_006", "order": 6, "role": "body", "text": "Matt Thomas’ 3 gave the Bulls their biggest lead at 16 points in the closing minutes of the third, and the Hawks never really threatened the rest of the way, though two 3s by Reddish twice cut it to five early in the fourth. Reddish buried a 3 from the left wing to make it 108-105 before Vucevic hit consecutive 3s to push the lead to seven."}
{"game_id": "0022100502", "chunk_id": "0022100502_007", "order": 7, "role": "body", "text": "“Their big three, it seemed like everything they threw up went in,\" Hawks coach Nate McMillan said. “They do a good job of executing, spacing the floor out and making plays. It seemed like every time we would get close they would stop that momentum with a made bucket.\""}
{"game_id": "0022100502", "chunk_id": "0022100502_008", "order": 8, "role": "body", "text": "Young, who ranks fourth in the NBA with a 27.3 scoring average and third with 9.3 assists per game, returned two negative tests to be eligible to return. He missed the last three games after a positive COVID-19 test, and the Hawks went 1-2 without him."}
{"game_id": "0022100502", "chunk_id": "0022100502_009", "order": 9, "role": "body", "text": "The Bulls improved to 21-10, second-best in the Eastern Conference. They began the day 10 games over .500 for the first time since January 2016."}
{"game_id": "0022100502", "chunk_id": "0022100502_010", "order": 10, "role": "body", "text": "The Hawks began the day tied for 10th in the East and dropped to 15-18, losing their eighth in a row at home."}
{"game_id": "0022100502", "chunk_id": "0022100502_011", "order": 11, "role": "body", "text": "White’s straightaway 3 gave the Bulls their first double-digit lead with 9:10 to go in the third. Vucevic's lay-in against Clint Capela made it 80-70, and Atlanta called a full timeout."}
{"game_id": "0022100502", "chunk_id": "0022100502_012", "order": 12, "role": "body", "text": "Young and Reddish combined for 23 points as Atlanta led 36-31 at the end of the first. DeRozan scored 15 in the period on 5-for-6 shooting."}
{"game_id": "0022100502", "chunk_id": "0022100502_013", "order": 13, "role": "body", "text": "The Bulls came back from an eight-point deficit to tie it at 46-all on Ayo Dosunmu’s dunk midway through the second before LaVine hit a free throw to give Chicago a 55-54 lead. LaVine’s 3 made it 58-56 and caused the Hawks to call timeout."}
{"game_id": "0022100502", "chunk_id": "0022100502_014", "order": 14, "role": "body", "text": "The lead swelled to 11 on LaVine’s 3 and DeRozan’s finger-roll in the closing minute before halftime. LaVine beat the second-quarter buzzer with a jumper that put the Bulls up 69-63 entering the third."}
{"game_id": "0022100502", "chunk_id": "0022100502_015", "order": 15, "role": "body", "text": "Chicago went 9 for 18 beyond the arc, and DeRozan and LaVine combined for 44 points in the first half. Vucevic got hot in the second half with 19 points."}
{"game_id": "0022100502", "chunk_id": "0022100502_016", "order": 16, "role": "body", "text": "“I think Vuc has found a way to fit with those other two guys and it's been nice to watch,\" acting Bulls head coach Chris Fleming said. “It's been a big part of our success these last two games.\""}
{"game_id": "0022100502", "chunk_id": "0022100502_018", "order": 18, "role": "body", "text": "Bulls: Chicago had 22 assists and 10 turnovers. ... DeRozan had 10 assists and Vucevic chipped in six assists and four blocked shots. ... Fleming was pleased to hear that Young had been cleared to return. “You want to play against the best,” Fleming said. “That’s how we get better.”. ... Coach Billy Donovan missed his second straight game in the protocols. “He had some mild symptoms at the beginning,” Fleming said. “He sounds like himself now.”... Minutes leader Lonzo Ball, Tony Bradley and Alfonzo McKinnie are in the protocols. ... G Alex Caruso (left hamstring strain) and F Derrick Jones Jr. (left hamstring strain) were sidelined, too."}
{"game_id": "0022100502", "chunk_id": "0022100502_019", "order": 19, "role": "body", "text": "Hawks: Reddish went 8 for 12 on 3s. ... Atlanta had 12 players absent, including John Collins, forward Danilo Gallinari, guard Kevin Huerter, guard Lou Williams, swingman Timothe Luwawu-Cabbarot and reserve center Onyeka Okongwu in the protocols. ... The Hawks won the series with Chicago 3-0 last season."}
{"game_id": "0022100502", "chunk_id": "0022100502_021", "order": 21, "role": "body", "text": "Bulls: Host Atlanta on Wednesday."}
{"game_id": "0022100502", "chunk_id": "0022100502_022", "order": 22, "role": "body", "text": "Hawks: At Chicago on Wednesday."}
