{"game_id": "0022100205", "chunk_id": "0022100205_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Ja Morant had 22 points, six rebounds and six assists, Jaren Jackson Jr. added 18 points and the Memphis Grizzlies beat Houston 136-102 Monday night, sending the Rockets to their 12th straight loss."}
{"game_id": "0022100205", "chunk_id": "0022100205_002", "order": 2, "role": "body", "text": "Dillon Brooks finished with 16 points, and Kyle Anderson added 15 as Memphis snapped a three-game losing streak. The 136 points was a season-high for the Grizzlies. Brooks and other Grizzlies said a renewed energy meant better defense."}
{"game_id": "0022100205", "chunk_id": "0022100205_003", "order": 3, "role": "body", "text": "“That should never die,” Brooks said. “The energy every single game, every single day at practice. …We should never lack energy.”"}
{"game_id": "0022100205", "chunk_id": "0022100205_004", "order": 4, "role": "body", "text": "Jalen Green led the Rockets with 15 points, while Jae’Sean Tate added 14 points and nine rebounds. Houston, again was stymied by poor shooting, connecting on only 38%."}
{"game_id": "0022100205", "chunk_id": "0022100205_005", "order": 5, "role": "body", "text": "Neither team entered Monday night playing well. Memphis struggled in its previous three games – all losses by double-digit margins to Charlotte, Phoenix and New Orleans. Meanwhile, over the last four games, the Rockets have lost by an average of 14.3 points a game."}
{"game_id": "0022100205", "chunk_id": "0022100205_006", "order": 6, "role": "body", "text": "The misery continued early for the Rockets, who just couldn’t match the Grizzlies, even though Memphis had its own problems with turnovers early. But whatever issues Memphis was dealing with, the Rockets had more with a dozen miscues. The Rockets shot a respectable 44% in the half, but Memphis connected on 56% building its lead."}
{"game_id": "0022100205", "chunk_id": "0022100205_007", "order": 7, "role": "body", "text": "A 20-0 run in the third quarter, part of Memphis outscoring the Rockets 31-15 in the frame, guaranteed Houston’s losing streak would continue for at least another game as the Grizzlies lead reached 40 in the second half."}
{"game_id": "0022100205", "chunk_id": "0022100205_008", "order": 8, "role": "body", "text": "“I feel like we played great defense,” Morant said. “We held them to a 15-point quarter. Obviously got to be better rebounding the ball, especially when we play hard defense to get a stop, which we need to get out and run.\""}
{"game_id": "0022100205", "chunk_id": "0022100205_009", "order": 9, "role": "body", "text": "Rockets coach Stephen Silas dealt with a similar lengthy losing streak last season, but there are difference with this skid."}
{"game_id": "0022100205", "chunk_id": "0022100205_010", "order": 10, "role": "body", "text": "“It’s right at the beginning of the season, and we’re trying to find ourselves and trust ourselves,” the Rockets coach said. “The message is the same. It’s the process. It’s the work, the preparation, the trust. All of those things and trusting that if you do things the right way, we’ll get out of the streak.”"}
{"game_id": "0022100205", "chunk_id": "0022100205_012", "order": 12, "role": "body", "text": "Rockets: Last win was Oct. 22 against Oklahoma City in the second game of the season. …G Eric Gordon did not play with right groin tightness, a problem that caused him to miss the Nov. 7 loss to Golden State. “After games, it just tightens up on him.\" Silas said. \"…Right now, he can’t (play).” …Tate was called for a technical in the third quarter after a no-call on his drive to the basket. …Kevin Porter Jr. left the game in the second half and did not return. Porter had a similar issue in the Rockets game against Golden State."}
{"game_id": "0022100205", "chunk_id": "0022100205_013", "order": 13, "role": "body", "text": "Grizzlies: The Grizzlies’ 74 first-half points was the most allowed by Houston in a half this season. The previous high was by Minnesota with 72 on Oct. 20. …Had a season-high with 33 assists. …Bradon Clarke finished with 12 points, making all five of his shots."}
{"game_id": "0022100205", "chunk_id": "0022100205_015", "order": 15, "role": "body", "text": "With a three-game losing streak headed into the game and double-digit losses, some may think it is time to panic. Not Grizzlies coach Taylor Jenkins. “It’s way too early. Natural early season struggles,” he said. “Our guys have been through this before. Obviously, you don’t want to go through this. I’d rather do (this) early in the season.”"}
{"game_id": "0022100205", "chunk_id": "0022100205_017", "order": 17, "role": "body", "text": "Silas hinted after the loss to the Suns that a lineup change could be considered. After thinking about it a day, he decided to stay put – for now. “I want to put a lot more thought into it,” he said. “I don’t want it just to be like after a bad loss that we’re just going to flip the switch and change the lineup. I want to give myself a few more hours, a few more days to mull it over.”"}
{"game_id": "0022100205", "chunk_id": "0022100205_019", "order": 19, "role": "body", "text": "Rockets: Continue on a four-game road trip with a stop in Oklahoma City to face the Thunder on Wednesday."}
{"game_id": "0022100205", "chunk_id": "0022100205_020", "order": 20, "role": "body", "text": "Grizzlies: Entertain the Los Angeles Clippers on Thursday."}
