{"game_id": "0022100682", "chunk_id": "0022100682_001", "order": 1, "role": "lead", "text": "DALLAS -- — Devin Booker scored 28 points, Chris Paul had 20 points and 11 assists with no turnovers, and the Phoenix Suns rallied late to beat the Dallas Mavericks 109-101 on Thursday night."}
{"game_id": "0022100682", "chunk_id": "0022100682_002", "order": 2, "role": "body", "text": "In a matchup of two of the NBA’s hottest teams, Phoenix (35-9) finished a sweep of its season-high, five-game road trip and won its ninth straight against the Mavericks by outscoring Dallas 35-19 in the fourth quarter. Paul scored 10 points in the fourth."}
{"game_id": "0022100682", "chunk_id": "0022100682_003", "order": 3, "role": "body", "text": "“Chris knows when to go,” Dallas coach Jason Kidd said. “He showed that again in the fourth quarter.”"}
{"game_id": "0022100682", "chunk_id": "0022100682_004", "order": 4, "role": "body", "text": "Luka Doncic scored 28 points, Jalen Brunson added 19 and Kristaps Porzingis had 18 points and 11 rebounds for the Mavericks (26-20), who had won four straight games and 10 of their last 11."}
{"game_id": "0022100682", "chunk_id": "0022100682_005", "order": 5, "role": "body", "text": "“That’s a team that’s been running through the league here of late,” Suns coach Monty Williams. “To beat them on their home floor like that is huge.”"}
{"game_id": "0022100682", "chunk_id": "0022100682_006", "order": 6, "role": "body", "text": "After Mikal Bridges’ floater gave Phoenix a 101-99 lead with 2:56 left, Bismack Biyombo – playing only his seventh game this season after joining the Suns this month – followed his free throw with a dunk to give Phoenix a 104-99 lead. Paul’s 3-pointer with 19 seconds to go was the clincher, putting the Suns ahead 107-99."}
{"game_id": "0022100682", "chunk_id": "0022100682_007", "order": 7, "role": "body", "text": "Doncic had 24 points through three quarters – giving him 20 or more points in nine straight games – but went to the bench in the period’s closing seconds after hurting his neck on a hard fall. He played eight minutes in the fourth, hitting 2 of 3 shots from the floor with none behind the arc."}
{"game_id": "0022100682", "chunk_id": "0022100682_008", "order": 8, "role": "body", "text": "“My neck’s not an excuse,” said Doncic, who had eight turnovers and said he might have lost some steam in the fourth quarter. “But man, they’re the best record in the league. We were right there.”"}
{"game_id": "0022100682", "chunk_id": "0022100682_009", "order": 9, "role": "body", "text": "The Suns won despite shooting a season-worst 22.2% on 3-pointers (8 for 36), including missing 17 straight in the first half. But they forced a Mavericks team that was second in the NBA averaging 12.4 turnovers into 19 and outscored Dallas 31-7 on points off turnovers."}
{"game_id": "0022100682", "chunk_id": "0022100682_010", "order": 10, "role": "body", "text": "Paul has an NBA-best 49 career games with double-digit assists and no turnovers."}
{"game_id": "0022100682", "chunk_id": "0022100682_011", "order": 11, "role": "body", "text": "“He pushes everybody,” Booker said of the 11-time All-Star. “He’s very vocal.”"}
{"game_id": "0022100682", "chunk_id": "0022100682_013", "order": 13, "role": "body", "text": "With the Suns leading 104-99 in the final minute, Booker was called for a blocking foul as Dorian Finney-Smith drove the baseline. Every Phoenix player on floor motioned to the bench that the call should be challenged."}
{"game_id": "0022100682", "chunk_id": "0022100682_014", "order": 14, "role": "body", "text": "“It’s hard to trust the players because no player in the history of the league has ever committed a foul,” Williams said."}
{"game_id": "0022100682", "chunk_id": "0022100682_015", "order": 15, "role": "body", "text": "But he did trust them – along with his gut and from what he heard from down the bench – and the play was reversed into an offensive foul."}
{"game_id": "0022100682", "chunk_id": "0022100682_017", "order": 17, "role": "body", "text": "During Dallas’ 14-0 run to take a 42-38 lead late in the second quarter, the 7-foot-3 Latvian had a block on JaVale McGee, scored on an alley-oop from Maxi Kleber and then popped a 25-foot 3-pointer."}
{"game_id": "0022100682", "chunk_id": "0022100682_019", "order": 19, "role": "body", "text": "Suns: They’re one win short of the franchise’s best record through 44 games. Being 26 games over .500 is the most since finishing last season’s shortened schedule 51-21. … Played their second straight game without starting center Deandre Ayton, their second-leading scorer and top rebounder (right ankle sprain)."}
{"game_id": "0022100682", "chunk_id": "0022100682_020", "order": 20, "role": "body", "text": "Mavericks: Had won six consecutive home games, including wins over Golden State and Chicago. … Finished a home back-to-back after beating Toronto by four points on Wednesday night. … Played their second straight game without reserve guard Sterling Brown (sore left foot)."}
{"game_id": "0022100682", "chunk_id": "0022100682_022", "order": 22, "role": "body", "text": "Suns: Host Indiana on Saturday for their first home game since Jan. 8."}
{"game_id": "0022100682", "chunk_id": "0022100682_023", "order": 23, "role": "body", "text": "Mavericks: Home on Sunday against Southwest Division leader Memphis to finish a five-game homestand."}
