{"game_id": "0022100803", "chunk_id": "0022100803_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Karl-Anthony Towns had 24 points and 12 rebounds and the Minnesota Timberwolves got a big boost from their bench in a 118-105 victory over the Detroit Pistons on Sunday."}
{"game_id": "0022100803", "chunk_id": "0022100803_002", "order": 2, "role": "body", "text": "D’Angelo Russell returned with 22 points and eight assists after missing four games because of a left shin contusion, and Michael Beasley had 20 points off the bench."}
{"game_id": "0022100803", "chunk_id": "0022100803_003", "order": 3, "role": "body", "text": "Minnesota’s preferred starting lineup was back together for the first time in seven games with Russell’s return. But it was the work of the second unit that helped the Timberwolves overcome a sluggish start to the matinee affair. Minnesota won its fourth straight."}
{"game_id": "0022100803", "chunk_id": "0022100803_004", "order": 4, "role": "body", "text": "“It’s a good test of our maturity right now,” Timberwolves coach Chris Finch said, crediting the way Detroit played. “They compete, they’re physical, do a lot of things that can bother you. Every time we had a chance to stretch the lead, I thought we kind of got a little bit sloppy. Attention to detail wasn’t where it probably needed to be and those are things we have to work on and work through.”"}
{"game_id": "0022100803", "chunk_id": "0022100803_005", "order": 5, "role": "body", "text": "Saddiq Bey scored 24 points for Detroit, which has lost eight of nine. Trey Lyles added 16, and Cory Joseph had 15."}
{"game_id": "0022100803", "chunk_id": "0022100803_006", "order": 6, "role": "body", "text": "“I thought we played some good basketball,” Pistons coach Dwane Casey said. “We just didn’t play long enough periods of it, long enough stretches of it. That’s the mark of us this year, our growth potential I would say, is to make sure we extend that because I thought the ball was hopping. I thought we had some good defensive possessions.”"}
{"game_id": "0022100803", "chunk_id": "0022100803_007", "order": 7, "role": "body", "text": "Injuries and COVID-19 have led to constant change for Minnesota’s starting lineup. Russell’s return finally reunited coach Chris Finch’s preferred lineup with Russell, Towns, Anthony Edwards, Jarred Vanderbilt and Patrick Beverley."}
{"game_id": "0022100803", "chunk_id": "0022100803_008", "order": 8, "role": "body", "text": "Before Russell’s injury, Beverley had missed games with a right ankle sprain and COVID-19 struck the team in November. With those five in the lineup, Minnesota is 12-5."}
{"game_id": "0022100803", "chunk_id": "0022100803_009", "order": 9, "role": "body", "text": "Russell had nine of his points in the fourth as the Wolves pulled away."}
{"game_id": "0022100803", "chunk_id": "0022100803_010", "order": 10, "role": "body", "text": "“Our system’s pretty easy to play in but when we don’t share the ball, nobody really looks like they’re finding their rhythm or anything,” Russell said. “It just looks the complete opposite. Today, we shared the ball. It was kind of easy for me to just fit right in as another plug-and-play guy.”"}
{"game_id": "0022100803", "chunk_id": "0022100803_011", "order": 11, "role": "body", "text": "The lack of cohesiveness was noticed early as Detroit’s struggling unit led by as many as five in the first quarter."}
{"game_id": "0022100803", "chunk_id": "0022100803_012", "order": 12, "role": "body", "text": "Beasley helped the Wolves recover. He had two 3-pointers as Minnesota used a 19-8 run to take the lead. Beasley finished 5 of 9 from beyond the arc."}
{"game_id": "0022100803", "chunk_id": "0022100803_013", "order": 13, "role": "body", "text": "“He’s more than capable, so we still believe in him,” Russell said. “We trust him. Today I think there was a stretch where he got a bunch of 3s up in that short period of time and he made them, so throughout the game I knew it’d be a good game for him.”"}
{"game_id": "0022100803", "chunk_id": "0022100803_014", "order": 14, "role": "body", "text": "The young Pistons wouldn’t let up. After the Wolves took a game-high, 13-point lead in the fourth, Detroit closed within five with 3:55 remaining."}
{"game_id": "0022100803", "chunk_id": "0022100803_015", "order": 15, "role": "body", "text": "“We need some more stops down the stretch,” Bey said. “We had a couple stretches where we would score, but they scored every time as well. We needed to have some possessions where we get three, four stops in a row and then convert to be able to push up the lead or to stay a little closer at the end of the game.”"}
{"game_id": "0022100803", "chunk_id": "0022100803_017", "order": 17, "role": "body", "text": "Detroit’s Killian Hayes, who was scoreless through three quarters and had three turnovers in the first half, had 10 points in the fourth. He finished with eight assists and didn't have a turnover in the second half."}
{"game_id": "0022100803", "chunk_id": "0022100803_018", "order": 18, "role": "body", "text": "“That’s what we expect out of him, the growth from him handling the basketball, making decisions, making passes, making plays without turning it over,” Casey said. “The growth from him, again, it’s not coming out as a ‘W’ but there is individual growth and a lot of collective growth also.\""}
{"game_id": "0022100803", "chunk_id": "0022100803_020", "order": 20, "role": "body", "text": "Minnesota forward Taurean Prince, who scored in double figures off the bench in four straight games, left the game late in the first with a left ankle sprain and didn’t return. Reserve center Naz Reid went down hard in the fourth quarter and was down for several minutes before limping to the bench."}
{"game_id": "0022100803", "chunk_id": "0022100803_021", "order": 21, "role": "body", "text": "Finch didn’t have an update on either player after the game but said Reid wanted to stay in the game."}
{"game_id": "0022100803", "chunk_id": "0022100803_023", "order": 23, "role": "body", "text": "Pistons: G Cade Cunningham missed his third straight game with a right hip pointer. F Josh Jackson missed his fifth in a row due to right lumbar spine spasms."}
{"game_id": "0022100803", "chunk_id": "0022100803_024", "order": 24, "role": "body", "text": "Timberwolves: G Josh Okogie missed his fourth straight game with a right quad contusion. … Minnesota’s bench contributed 43 points."}
{"game_id": "0022100803", "chunk_id": "0022100803_026", "order": 26, "role": "body", "text": "Pistons: At Dallas on Tuesday night."}
{"game_id": "0022100803", "chunk_id": "0022100803_027", "order": 27, "role": "body", "text": "Timberwolves: At Sacramento on Tuesday and Wednesday nights."}
