{"game_id": "0022100234", "chunk_id": "0022100234_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Giannis Antetokounmpo had 21 points, 19 rebounds and seven assists to help the Milwaukee Bucks withstand Oklahoma City’s comeback attempt and beat the Thunder 96-89 on Friday night."}
{"game_id": "0022100234", "chunk_id": "0022100234_002", "order": 2, "role": "body", "text": "Milwaukee never trailed but nearly allowed Oklahoma City to come all the way back from a 20-point deficit."}
{"game_id": "0022100234", "chunk_id": "0022100234_003", "order": 3, "role": "body", "text": "“We kind of ran into mud,” Bucks coach Mike Budenholzer said. “It looked like we were in mud. We couldn’t make enough shots, couldn’t make enough plays.”"}
{"game_id": "0022100234", "chunk_id": "0022100234_004", "order": 4, "role": "body", "text": "Oklahoma City cut Milwaukee’s lead to 84-82 on Kenrich Williams’ 3-pointer with 8:01 left. The Thunder missed several shots later in the fourth quarter that would have tied the game or given them the lead, including an alley-oop attempt that Antetokounmpo blocked with under four minutes to go."}
{"game_id": "0022100234", "chunk_id": "0022100234_005", "order": 5, "role": "body", "text": "The Thunder's final squandered opportunity to tie the game or take the lead came when Shai Gilgeous-Alexander misfired on a 3-pointer with about 49 seconds left. Antetokounmpo then hit a 15-footer in the paint to extend Milwaukee’s lead to 93-89 with 28.7 seconds remaining."}
{"game_id": "0022100234", "chunk_id": "0022100234_006", "order": 6, "role": "body", "text": "Oklahoma City wouldn't score again."}
{"game_id": "0022100234", "chunk_id": "0022100234_007", "order": 7, "role": "body", "text": "“We fought back,” said Josh Giddey, who had 14 points and 12 rebounds for the Thunder. “We got the game well within our reach. We kept it to two points for a lot of that (fourth) quarter. We couldn't break through and get that lead.”"}
{"game_id": "0022100234", "chunk_id": "0022100234_008", "order": 8, "role": "body", "text": "Bobby Portis had 17 points and 13 rebounds for the Bucks. Khris Middleton added 16 points, George Hill 12, Grayson Allen 11 and Jrue Holiday 10."}
{"game_id": "0022100234", "chunk_id": "0022100234_009", "order": 9, "role": "body", "text": "Gilgeous-Alexander led Oklahoma City with 17 points but shot 5 of 20 overall and 2 of 12 from 3-point range. Mike Muscala had 14 points. Luguentz Dort and Ty Jerome added 10 apiece."}
{"game_id": "0022100234", "chunk_id": "0022100234_010", "order": 10, "role": "body", "text": "Middleton made a 26-footer in the opening minute of the game for his 1,052nd career 3-pointer as a Buck to overtake Ray Allen for the franchise lead. Allen owns the NBA record with 2,973 3-point baskets during a career that also included stints with the Seattle SuperSonics, Boston Celtics and Miami Heat."}
{"game_id": "0022100234", "chunk_id": "0022100234_011", "order": 11, "role": "body", "text": "“To be No. 1 in the franchise is pretty cool,” Middleton said. “I told Giannis, ‘Just let me have one record and I’m happy about it.' \""}
{"game_id": "0022100234", "chunk_id": "0022100234_012", "order": 12, "role": "body", "text": "The Thunder were missing coach Mark Daigneault, who was with his wife, Ashley, as they expect their first child. Assistant coach Dave Bliss is serving as Oklahoma City’s acting head coach while Daigneault is away."}
{"game_id": "0022100234", "chunk_id": "0022100234_013", "order": 13, "role": "body", "text": "The opportunity was particularly rewarding for Bliss, a Wisconsin native who graduated from Wausau West High School, about 180 miles northwest of Milwaukee. His dad attended Friday’s game. So did his brother and his brother’s wife, who live in suburban Milwaukee."}
{"game_id": "0022100234", "chunk_id": "0022100234_014", "order": 14, "role": "body", "text": "A high school friend traveled all the way from Montana to attend the game."}
{"game_id": "0022100234", "chunk_id": "0022100234_015", "order": 15, "role": "body", "text": "“He found out yesterday afternoon and left work, jumped right on a plane and got in last night,” said Bliss, who isn’t related to the former Baylor coach with the same name."}
{"game_id": "0022100234", "chunk_id": "0022100234_017", "order": 17, "role": "body", "text": "The Bucks didn’t show any outward signs of protest at the start of the game, which began several hours after a jury in Kenosha, Wisconsin, cleared Kyle Rittenhouse of all charges in connection with the shootings that resulted in the deaths of two men and the wounding of a third."}
{"game_id": "0022100234", "chunk_id": "0022100234_018", "order": 18, "role": "body", "text": "The shootings occurred in the summer of 2020 during protests over the shooting of a Black man, Jacob Blake, by a white Kenosha police officer. The Bucks refused to play a playoff game to protest the shooting. That led the NBA to postpone all games that day, and player-driven protests also led to postponements in the WNBA and Major League Baseball."}
{"game_id": "0022100234", "chunk_id": "0022100234_019", "order": 19, "role": "body", "text": "“We talked about it a little as a team,” Middleton said. “Speaking for myself, it's definitely disappointing, but at the same time, it really wasn't surprising, about the verdict. I watched it a little bit, was able to keep up with it. It's something that I think we've all seen over and over again.”"}
{"game_id": "0022100234", "chunk_id": "0022100234_021", "order": 21, "role": "body", "text": "Thunder: Oklahoma City was seeking to win a game it had trailed by at least 16 points for the fifth time this season. ... The Thunder outrebounded the Bucks 53-47 and had a 10-5 edge in second-chance points but shot just 12 of 48 on 3-point attempts."}
{"game_id": "0022100234", "chunk_id": "0022100234_022", "order": 22, "role": "body", "text": "Bucks: Budenholzer said center Brook Lopez is starting to do more things in his recovery from a back issue but had no updated timetable for the 7-footer’s potential return. Lopez hasn’t played since the season opener."}
{"game_id": "0022100234", "chunk_id": "0022100234_024", "order": 24, "role": "body", "text": "Thunder: At Boston on Saturday night."}
{"game_id": "0022100234", "chunk_id": "0022100234_025", "order": 25, "role": "body", "text": "Bucks: Hosts Orlando on Saturday and Monday nights."}
