{"game_id": "0022100606", "chunk_id": "0022100606_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — The Memphis Grizzlies set a franchise record with their ninth straight win, getting 16 points and a breathtaking block from Ja Morant in a 127-119 victory over the Los Angeles Lakers on Sunday night."}
{"game_id": "0022100606", "chunk_id": "0022100606_002", "order": 2, "role": "body", "text": "Desmond Bane had 23 points, Jaren Jackson Jr. added 21 and six blocks, and Memphis won for the 12th time in 13 road games."}
{"game_id": "0022100606", "chunk_id": "0022100606_003", "order": 3, "role": "body", "text": "Morant’s swat came in the first quarter, when he soared from behind Avery Bradley as he tried for a layup, caught the ball with both hands and smacked it off the glass about halfway up the backboard."}
{"game_id": "0022100606", "chunk_id": "0022100606_004", "order": 4, "role": "body", "text": "Bradley had stolen the ball away from Morant and tried to break for the other end."}
{"game_id": "0022100606", "chunk_id": "0022100606_005", "order": 5, "role": "body", "text": "“I just got back and made an incredible play,\" Morant said. \"I was just trying to gather the ball. Most of the time on a break like that, if you block it, they might have a player trailing to get the ball and lay it up. It worked out perfect for me. Now I’m probably all over the internet for it.”"}
{"game_id": "0022100606", "chunk_id": "0022100606_006", "order": 6, "role": "body", "text": "His teammates were understandably impressed."}
{"game_id": "0022100606", "chunk_id": "0022100606_007", "order": 7, "role": "body", "text": "“That’s probably the best block I’ve ever seen live. Probably the best block I’ve ever seen, period,” Jackson said. “That was crazy. I knew he was going to do it, too, because he always loads up right before."}
{"game_id": "0022100606", "chunk_id": "0022100606_008", "order": 8, "role": "body", "text": "Morant also threw down an alley-oop dunk off a lob from Bane in the third quarter, nearly hitting his head on the rim a night after sitting out against the Clippers with left thigh soreness."}
{"game_id": "0022100606", "chunk_id": "0022100606_009", "order": 9, "role": "body", "text": "LeBron James scored 23 of his 35 points in the first half. He made 14 of 19 shots and added seven assists. He passed Oscar Robertson (9,887 assists) for seventh most assists in NBA history."}
{"game_id": "0022100606", "chunk_id": "0022100606_010", "order": 10, "role": "body", "text": "The Grizzlies snapped the Lakers’ four-game winning streak and a stretch in which the Lakers had won five of six."}
{"game_id": "0022100606", "chunk_id": "0022100606_011", "order": 11, "role": "body", "text": "“Memphis played great. They’re one of the hottest teams in the league,” Lakers coach Frank Vogel said. “We had trouble getting back in transition. We let a lot of misses at the basket affect our defensive focus. When we weren’t scoring, we lost focus of what we were supposed to be doing on the defensive side. That can’t happen. That was a big reason they built a big league.”"}
{"game_id": "0022100606", "chunk_id": "0022100606_012", "order": 12, "role": "body", "text": "Memphis’ largest lead was 29 points, but the Lakers cut that to seven late in the fourth quarter."}
{"game_id": "0022100606", "chunk_id": "0022100606_013", "order": 13, "role": "body", "text": "During the nine-game winning streak, the Grizzlies have had three back-to-backs."}
{"game_id": "0022100606", "chunk_id": "0022100606_014", "order": 14, "role": "body", "text": "“It’s obviously exciting,” said Brad Jones, who was the acting coach Sunday. “I don’t think we’d talked to our players about that at all. They told us before we went in the locker room. We told them we made history tonight. They were pretty excited about that.\""}
{"game_id": "0022100606", "chunk_id": "0022100606_015", "order": 15, "role": "body", "text": "Dane had 13 of his points in the first half. Jackson added 12 rebounds."}
{"game_id": "0022100606", "chunk_id": "0022100606_016", "order": 16, "role": "body", "text": "The Grizzlies outscored the Lakers 38-25 in the second quarter, building a 65-52 halftime lead."}
{"game_id": "0022100606", "chunk_id": "0022100606_018", "order": 18, "role": "body", "text": "This was win No. 100 for Memphis coach Taylor Jenkins, although he was in quarantine back in his Los Angeles hotel room, missing his second straight game because of COVID-19 protocols."}
{"game_id": "0022100606", "chunk_id": "0022100606_019", "order": 19, "role": "body", "text": "Taylor was part of pre-game planning with the team via Zoom, and the Grizzlies celebrated with him postgame via video conference also."}
{"game_id": "0022100606", "chunk_id": "0022100606_021", "order": 21, "role": "body", "text": "Grizzlies: F Dillon Brooks (left ankle sprain), Yves Pons (left ankle soreness) and C Steven Adams (health and safety protocols) were out."}
{"game_id": "0022100606", "chunk_id": "0022100606_022", "order": 22, "role": "body", "text": "Lakers: Kendrick Nunn (right knee bone bruise) missed the game. ... Flea, the bassist from the Red Hot Chili Peppers and a longtime Lakers fan, wore a signed Talen Horton-Tucker jersey while competing in a skills challenge at halftime. Horton-Tucker had 13 points off the bench."}
{"game_id": "0022100606", "chunk_id": "0022100606_024", "order": 24, "role": "body", "text": "Grizzlies: Hosts Golden State on Tuesday night."}
{"game_id": "0022100606", "chunk_id": "0022100606_025", "order": 25, "role": "body", "text": "Lakers: At Sacramento on Wednesday night."}
