{"game_id": "0022100772", "chunk_id": "0022100772_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Every opposing team knows that Phoenix Suns guard Devin Booker can score points in bunches. They also know about Chris Paul's elite passing and mid-range game, along with Deandre Ayton's low-post scoring ability."}
{"game_id": "0022100772", "chunk_id": "0022100772_002", "order": 2, "role": "body", "text": "Then there's Mikal Bridges. He's a No. 4 option that makes this arguably the deepest team in the NBA."}
{"game_id": "0022100772", "chunk_id": "0022100772_003", "order": 3, "role": "body", "text": "Booker scored 35 points, Bridges added a season-high 27 and the league-leading Suns extended their winning streak to 11 games by beating the Brooklyn Nets 121-111 on Tuesday night."}
{"game_id": "0022100772", "chunk_id": "0022100772_004", "order": 4, "role": "body", "text": "“What helps us is we just have a complete team,” Paul said. “You can't key in on one or two guys. If people try to do that with me or Booker, Mikal can get hot...\""}
{"game_id": "0022100772", "chunk_id": "0022100772_005", "order": 5, "role": "body", "text": "\"That's what makes us good. On any given night, anybody can get going.”"}
{"game_id": "0022100772", "chunk_id": "0022100772_006", "order": 6, "role": "body", "text": "The Suns (41-9) continued their best start to a season in franchise history and have two double-digit winning streaks this season. They also won 18 games in a row from Oct. 30 to Dec. 2."}
{"game_id": "0022100772", "chunk_id": "0022100772_007", "order": 7, "role": "body", "text": "Phoenix has made winning look easy for much of the season. Booker said that’s not the case."}
{"game_id": "0022100772", "chunk_id": "0022100772_008", "order": 8, "role": "body", "text": "“This league is not simple,” Booker said. “Guarding Kyrie (Irving) 1-on-1 is not simple. So it’s something you have to lock in to. It takes a lot of hard work and effort. But having those experiences that we’ve had together, it helps a lot.”"}
{"game_id": "0022100772", "chunk_id": "0022100772_009", "order": 9, "role": "body", "text": "Bridges scored a season high for a second straight game. The lanky 6-foot-6 forward had 26 points against the Spurs on Sunday and was arguably even better against the Nets, shooting 10 of 14 from the field and adding eight rebounds and four assists. It's the kind of performance the Suns envisioned when they signed him to a four-year, $90 million extension during the offseason."}
{"game_id": "0022100772", "chunk_id": "0022100772_010", "order": 10, "role": "body", "text": "The Suns took a 91-82 lead into the fourth quarter and never trailed. Paul finished with 20 points and 14 assists. Cam Johnson had 16 points off the bench."}
{"game_id": "0022100772", "chunk_id": "0022100772_011", "order": 11, "role": "body", "text": "Brooklyn has lost five straight. Irving led the Nets with 26 points while James Harden had 22. Blake Griffin scored 17 points on 6-of-10 shooting off the bench."}
{"game_id": "0022100772", "chunk_id": "0022100772_012", "order": 12, "role": "body", "text": "Irving was playing just his ninth game of the season and all of them have been on the road. The star guard remains one of the few unvaccinated players in the NBA and due to COVID-19 mandates in New York City concerning public arenas, he's not permitted to play in home games."}
{"game_id": "0022100772", "chunk_id": "0022100772_013", "order": 13, "role": "body", "text": "The Suns jumped out to a 39-29 lead by the end of the first quarter after shooting 71.4% from the field. Booker scored 14 points after making his first six shots from the field."}
{"game_id": "0022100772", "chunk_id": "0022100772_014", "order": 14, "role": "body", "text": "“We had opportunities,” Harden said. “We need to get off to a better start. That first quarter really hurt us. I felt like the last three quarters we were really pretty good.”"}
{"game_id": "0022100772", "chunk_id": "0022100772_015", "order": 15, "role": "body", "text": "Said Brooklyn coach Steve Nash: “That is a high-level team playing the best basketball in the league, a lot of momentum, great crowd. Other than giving up 39 in the first quarter and getting them in the bonus early in the fourth and some loose balls, we matched them for large stretches.”"}
{"game_id": "0022100772", "chunk_id": "0022100772_016", "order": 16, "role": "body", "text": "Paul made a driving layup as the second quarter buzzer sounded to give the Suns a 65-58 halftime advantage. Paul had nine points and 10 assists in the first half. Harden led the Nets with 15 points before the break."}
{"game_id": "0022100772", "chunk_id": "0022100772_018", "order": 18, "role": "body", "text": "Nets: Irving averaged 24.5 points and 5.1 rebounds over his first eight games this season. ... Among those who missed the game: F Kevin Durant (left knee MCL sprain), F LaMarcus Aldridge (left ankle sprain) and F Joe Harris (left ankle surgery). ... Nash won both of his MVPs as a player with the Suns."}
{"game_id": "0022100772", "chunk_id": "0022100772_019", "order": 19, "role": "body", "text": "Suns: Ayton returned after missing the past seven games with an ankle injury. He had 12 points and six rebounds. ... F Jae Crowder was back after missing four games and scored three points ... Guards Landry Shamet (right ankle sprain) and Cameron Payne (right wrist sprain) were out. ... Hosted a sellout crowd at Footprint Center for a 12th straight game. ... Have a 31-0 record when leading after three quarters."}
{"game_id": "0022100772", "chunk_id": "0022100772_021", "order": 21, "role": "body", "text": "Nets: Travel to face the Kings on Wednesday."}
{"game_id": "0022100772", "chunk_id": "0022100772_022", "order": 22, "role": "body", "text": "Suns: Travel to face the Hawks on Thursday."}
