{"game_id": "0022100991", "chunk_id": "0022100991_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Nikola Jokic had 38 points, 18 rebounds and seven assists, and the Denver Nuggets held on after blowing an 18-point lead and beat the Sacramento Kings 106-100 on Wednesday night."}
{"game_id": "0022100991", "chunk_id": "0022100991_002", "order": 2, "role": "body", "text": "Monte Morris added 20 points and made a critical three-point play late to help preserve the Nuggets’ fourth consecutive win and 12th in the last 14 games. Bryn Forbes and Aaron Gordon each scored 11 points."}
{"game_id": "0022100991", "chunk_id": "0022100991_003", "order": 3, "role": "body", "text": "“Our guys understand what time it is in the season,” Nuggets coach Mike Malone said. “This is when you want to be playing your best basketball. There’s a feel-good atmosphere in the locker room.”"}
{"game_id": "0022100991", "chunk_id": "0022100991_004", "order": 4, "role": "body", "text": "The Nuggets trailed 92-91 after De’Aaron Fox’s dunk. Austin Rivers followed with a 3-pointer and Morris made an 18-foot jumper for Denver. Harrison Barnes’ 3-pointer got the Kings within 96-95 before Jokic and Morris scored on consecutive three-point plays."}
{"game_id": "0022100991", "chunk_id": "0022100991_005", "order": 5, "role": "body", "text": "Fox had 32 points and 10 assists for Sacramento. Barnes added 17 points and five rebounds. The Kings have lost six of eight since the All-Star break."}
{"game_id": "0022100991", "chunk_id": "0022100991_006", "order": 6, "role": "body", "text": "Jokic dominated the Kings all night. He had a double-double before halftime and fell three assists shy of a third consecutive triple-double."}
{"game_id": "0022100991", "chunk_id": "0022100991_007", "order": 7, "role": "body", "text": "“Lately, we’re playing really good, we’re winning games,” Jokic said. “Hopefully it’s going to continue.”"}
{"game_id": "0022100991", "chunk_id": "0022100991_008", "order": 8, "role": "body", "text": "The reigning league MVP leads the NBA with 18 triple-doubles and needs three more to tie Wilt Chamberlain’s career record for centers (78)."}
{"game_id": "0022100991", "chunk_id": "0022100991_009", "order": 9, "role": "body", "text": "“He just controls the whole game,” Kings interim coach Alvin Gentry said. “He’s a point guard, he’s a forward, he’s a center. He’s whatever he needs to be at that particular time to get them over the hump.”"}
{"game_id": "0022100991", "chunk_id": "0022100991_010", "order": 10, "role": "body", "text": "Morris said it’s a no-brainer that Jokic should be MVP again this season."}
{"game_id": "0022100991", "chunk_id": "0022100991_011", "order": 11, "role": "body", "text": "“He’s been dominating for so long there’s nothing you can really do,” Morris said. “This guy’s playing phenomenal. He’s been doing it for a long time. I still feel like he doesn’t get enough credit.”"}
{"game_id": "0022100991", "chunk_id": "0022100991_012", "order": 12, "role": "body", "text": "The second quarter ended in controversy when Fox was fouled with eight-tenths of a second remaining. Initial indications were that Fox was fouled before shooting, yet he was awarded three free throws. Malone was charged with a technical as the teams were walking off the court at halftime, giving the Kings a free throw attempt to open the third quarter."}
{"game_id": "0022100991", "chunk_id": "0022100991_013", "order": 13, "role": "body", "text": "Sacramento trailed 80-77 at the start of the fourth then cut the gap to 87-86 following back-to-back 3s from Barnes and Fox."}
{"game_id": "0022100991", "chunk_id": "0022100991_015", "order": 15, "role": "body", "text": "Former Kings star DeMarcus Cousins had a rough night in his return to Sacramento. The fifth overall pick in 2010 who spent his first seven seasons with the Kings, Cousins was called for five fouls including four on the offensive end. He finished with five points and six rebounds."}
{"game_id": "0022100991", "chunk_id": "0022100991_017", "order": 17, "role": "body", "text": "The Kings were without Domantas Sabonis, who served a one-game NBA suspension without pay for aggressively confronting and making contact with a referee during Monday’s loss to the New York Knicks. Sabonis had been called for a foul when he was charged with his first technical foul, then picked up a second and was ejected after bumping into the official."}
{"game_id": "0022100991", "chunk_id": "0022100991_019", "order": 19, "role": "body", "text": "Nuggets: Will Barton (left ankle sprain), Jeff Green (personal reasons) and Bones Hyland (right knee soreness) were held out."}
{"game_id": "0022100991", "chunk_id": "0022100991_020", "order": 20, "role": "body", "text": "Kings: Gentry had to be restrained by an assistant following a foul call in the second quarter. ... Davion Mitchell was hurt after a hard fall in the first half. He was taken to the locker room, then returned in the second quarter."}
{"game_id": "0022100991", "chunk_id": "0022100991_022", "order": 22, "role": "body", "text": "Nuggets: Face Golden State in Denver on Thursday. The Nuggets beat the Warriors 131-124 on Monday."}
{"game_id": "0022100991", "chunk_id": "0022100991_023", "order": 23, "role": "body", "text": "Kings: Play the Jazz in Utah on Saturday. Sacramento has lost six straight against the Jazz."}
