{"game_id": "0022100714", "chunk_id": "0022100714_001", "order": 1, "role": "lead", "text": "DETROIT -- — Nikola Jokic had 28 points, 21 rebounds and nine assists, Monte Morris made four free throws in the final 11.5 seconds, and the Denver Nuggets beat the Detroit Pistons 110-105 on Tuesday night."}
{"game_id": "0022100714", "chunk_id": "0022100714_002", "order": 2, "role": "body", "text": "Jokic was asked if he'd check the film for a missed assist, having fallen just short of a triple-double."}
{"game_id": "0022100714", "chunk_id": "0022100714_003", "order": 3, "role": "body", "text": "“I'm not worried about that,” he said. “It was a good game for me and a huge win for our team. I knew I was having a big night, but I wasn't thinking about the stats.”"}
{"game_id": "0022100714", "chunk_id": "0022100714_004", "order": 4, "role": "body", "text": "Jeff Green added 20 points for the Nuggets in the second game between the teams in three nights. Denver won 117-111 at home on Sunday."}
{"game_id": "0022100714", "chunk_id": "0022100714_005", "order": 5, "role": "body", "text": "“It's incredible to play with Jokic — he's one of the best players I've ever been on the floor with,” Green said. “When you are out there with him, you know that if you do your job, you're going to get open shots. The defense has to focus on him.”"}
{"game_id": "0022100714", "chunk_id": "0022100714_006", "order": 6, "role": "body", "text": "The Nuggets turned the ball over 25 times for 38 Detroit points and won despite a 13-point fourth quarter."}
{"game_id": "0022100714", "chunk_id": "0022100714_007", "order": 7, "role": "body", "text": "“I think we might have had a game a few years ago when we won while giving up 40 points on turnovers, but it isn't something you want to do,” Denver coach Michael Malone said. “It shows you how good we were on defense in the second half, because we won that game while beating ourselves on offense.”"}
{"game_id": "0022100714", "chunk_id": "0022100714_008", "order": 8, "role": "body", "text": "Cade Cunningham led Detroit with 34 points, eight rebounds and eight assists."}
{"game_id": "0022100714", "chunk_id": "0022100714_009", "order": 9, "role": "body", "text": "“It's surreal to be out there battling guys like Jokic — those are the moments I dreamed about my whole life,” the rookie said. “I thought we played really well defensively in the second half, but we gave them too much in the first half.”"}
{"game_id": "0022100714", "chunk_id": "0022100714_010", "order": 10, "role": "body", "text": "Cunningham looked like a vet, though, making a layup with 1:31 left in the game to pull the Pistons within four, 106-102. Detroit then got a pair of stops, but Saddiq Bey missed at the rim and Cunningham came up empty on a pair of jumpers."}
{"game_id": "0022100714", "chunk_id": "0022100714_011", "order": 11, "role": "body", "text": "“What a player,” Malone said of Cunningham. “He showed again tonight how special he's going to be in this league. Detroit's really got a star there.”"}
{"game_id": "0022100714", "chunk_id": "0022100714_012", "order": 12, "role": "body", "text": "Jokic had 19 points, 11 rebounds and five assists in the first half, helping the Nuggets build a 69-59 lead."}
{"game_id": "0022100714", "chunk_id": "0022100714_013", "order": 13, "role": "body", "text": "“The first half was the difference in the game,” Pistons coach Dwane Casey said. “Our defensive intensity wasn't there and they shot 20 free throws. In the second half, we bounced back and played physical basketball without fouling. That's how we gave ourselves a chance to win.”"}
{"game_id": "0022100714", "chunk_id": "0022100714_014", "order": 14, "role": "body", "text": "Isaiah Stewart, who was guarding Jokic, picked up his fourth and fifth fouls early in the third quarter, which allowed Denver to build the margin to 15 points."}
{"game_id": "0022100714", "chunk_id": "0022100714_015", "order": 15, "role": "body", "text": "Cunningham, who had 10 points in the quarter, hit a 3-pointer to make it 88-82, but Detroit couldn't get enough stops to continue the rally."}
{"game_id": "0022100714", "chunk_id": "0022100714_016", "order": 16, "role": "body", "text": "The Nuggets led 97-85 going into the fourth, but didn't score for the first five minutes, allowing Detroit to get within 97-91."}
{"game_id": "0022100714", "chunk_id": "0022100714_017", "order": 17, "role": "body", "text": "Cunningham's 3-pointer made it 99-96 with 5:33 left, but Jokic returned to the game and immediately hit a 3-pointer."}
{"game_id": "0022100714", "chunk_id": "0022100714_018", "order": 18, "role": "body", "text": "“I think that's the play of the night by far,” Malone said. \"We were really struggling, and they were making a heck of a run. Nicola had been sitting on the bench for quite a while, but he comes in and immediately knocks down that 3."}
{"game_id": "0022100714", "chunk_id": "0022100714_021", "order": 21, "role": "body", "text": "Nuggets: Jokic picked up his 3,000th NBA assist in the first quarter. He is the only Denver player to have 5,000 rebounds and 3,000 assists."}
{"game_id": "0022100714", "chunk_id": "0022100714_022", "order": 22, "role": "body", "text": "“It's hard to keep track of all the milestones he's passing,” Malone said. “He just won Western Conference Player of the Week, and then he has 28, 21 and nine tonight.”"}
{"game_id": "0022100714", "chunk_id": "0022100714_023", "order": 23, "role": "body", "text": "Pistons: Josh Jackson was ejected in the second quarter after picking up two technical fouls for arguing calls."}
{"game_id": "0022100714", "chunk_id": "0022100714_025", "order": 25, "role": "body", "text": "Nuggets: Visit the Brooklyn Nets on Wednesday."}
{"game_id": "0022100714", "chunk_id": "0022100714_026", "order": 26, "role": "body", "text": "Pistons: Visit the Orlando Magic on Friday."}
