{"game_id": "0022100909", "chunk_id": "0022100909_001", "order": 1, "role": "lead", "text": "CHICAGO -- — Ja Morant spun and flipped in an over-the-shoulder layup. He threw down a vicious alley-oop dunk."}
{"game_id": "0022100909", "chunk_id": "0022100909_002", "order": 2, "role": "body", "text": "Memphis' All-Star put on quite a display for the Chicago crowd and might have gotten little extra lift seeing highlights of Michael Jordan on the video board."}
{"game_id": "0022100909", "chunk_id": "0022100909_003", "order": 3, "role": "body", "text": "Morant scored a franchise-record 46 points and the Grizzlies hung on to beat DeMar DeRozan and the Bulls 116-110 on Saturday night."}
{"game_id": "0022100909", "chunk_id": "0022100909_004", "order": 4, "role": "body", "text": "“I did watch it,” he said. “And then, I did start scoring a lot. It probably played a part in it.”"}
{"game_id": "0022100909", "chunk_id": "0022100909_005", "order": 5, "role": "body", "text": "The Grizzlies let a 17-point lead shrink to one before squeezing it out after losing two in a row. They also stopped Chicago’s six-game winning streak."}
{"game_id": "0022100909", "chunk_id": "0022100909_006", "order": 6, "role": "body", "text": "Morant surpassed his previous regular-season high of 44 points. He had 47 in a playoff loss to Utah last season."}
{"game_id": "0022100909", "chunk_id": "0022100909_007", "order": 7, "role": "body", "text": "Morant scored 16 in the first half and 20 in the third quarter. He made 15 of 28 shots, including three 3-pointers, and was 13 for 15 at the foul line."}
{"game_id": "0022100909", "chunk_id": "0022100909_008", "order": 8, "role": "body", "text": "“I've seen too many of them. Kinda boring now,” Steven Adams said in jest. “He's such an amazing player.”"}
{"game_id": "0022100909", "chunk_id": "0022100909_009", "order": 9, "role": "body", "text": "Adams added 12 points and a season-high 21 rebounds, and the Grizzlies frustrated DeRozan even though the five-time All-Star scored 31 points."}
{"game_id": "0022100909", "chunk_id": "0022100909_010", "order": 10, "role": "body", "text": "1 STREAK CONTINUES, ANOTHER ENDS"}
{"game_id": "0022100909", "chunk_id": "0022100909_011", "order": 11, "role": "body", "text": "That gave DeRozan 10 straight 30-point games, the longest such streak by a Bulls player since Michael Jordan did it in 10 straight from Dec. 25, 1990, to Jan. 14, 1991. But he was 10 of 29 from the field, ending his NBA-record run of eight games of scoring at least 35 while shooting 50% or better, and was ejected in the closing seconds."}
{"game_id": "0022100909", "chunk_id": "0022100909_012", "order": 12, "role": "body", "text": "“As remarkable as he has been, he did not have a great shooting night,” Donovan said. “I thought early in the game, he got fouled really, really quite a bit and he should have been to the foul line. I have not watched the film. That's just going from my eyes watching the game on some downhill plays. Who knows what the game's like for him if he gets four quick free throws or some of those plays are called differently.”"}
{"game_id": "0022100909", "chunk_id": "0022100909_013", "order": 13, "role": "body", "text": "Zach LaVine scored 28 points in his second game back after missing the final three prior to the All-Star break because of his ailing left knee."}
{"game_id": "0022100909", "chunk_id": "0022100909_015", "order": 15, "role": "body", "text": "Memphis led by 17 in the third, with Morant going off in the quarter. He made 6 of 7 shots, including a 3, and a soaring alley-oop dunk near the end of the period."}
{"game_id": "0022100909", "chunk_id": "0022100909_016", "order": 16, "role": "body", "text": "It was a 16-point game early in the fourth when the Bulls reeled off a 14-0 run, with DeRozan hitting two free throws to cut it to 101-99 with 4:38 remaining."}
{"game_id": "0022100909", "chunk_id": "0022100909_017", "order": 17, "role": "body", "text": "Chicago's Coby White cut it to 106-105 when he nailed a 3 with about 2:30 remaining. Morant then hit two free throws before DeRozan drove for a layup."}
{"game_id": "0022100909", "chunk_id": "0022100909_018", "order": 18, "role": "body", "text": "Desmond Bane hit a 3 to bump the lead to 111-107. The Bulls' Nikola Vucevic made a foul shot, and Bane and Morant missed jumpers before LaVine hit two free throws to cut it to 111-110 with 25.5 seconds remaining."}
{"game_id": "0022100909", "chunk_id": "0022100909_019", "order": 19, "role": "body", "text": "Tyus Jones then hit a pair for Memphis to make it a three-point game with 14.9 seconds remaining. The Bulls then opted to attack the rim rather than try a 3, with a timeout in their pocket. But DeRozan missed in the lane, argued a no-call and picked up his second technical after getting one earlier in the game, earning an ejection."}
{"game_id": "0022100909", "chunk_id": "0022100909_020", "order": 20, "role": "body", "text": "Morant, who got fouled by LaVine in the scramble, then made the technical free throw and two more foul shots to bump the lead to 116-110 with 5.3 seconds remaining."}
{"game_id": "0022100909", "chunk_id": "0022100909_022", "order": 22, "role": "body", "text": "Grizzlies: The Grizzlies have won four straight against Chicago. ... Coach Taylor Jenkins said Morant was feeling “really good” following treatments, after his hip tightened Thursday night in a loss at Minnesota. \""}
{"game_id": "0022100909", "chunk_id": "0022100909_023", "order": 23, "role": "body", "text": "Bulls: Jordan holds the franchise record of 11 straight games with 30 points or more, from Feb. 13-March 4, 1987. ... The Bulls hope to have G Alex Caruso (broken right wrist) resume basketball activities during the upcoming week, coach Billy Donovan said. Caruso was injured Jan. 21 when Milwaukee's Grayson Allen took him down, and had surgery."}
{"game_id": "0022100909", "chunk_id": "0022100909_025", "order": 25, "role": "body", "text": "Grizzlies: Host San Antonio on Monday night."}
{"game_id": "0022100909", "chunk_id": "0022100909_026", "order": 26, "role": "body", "text": "Bulls: At Miami on Monday night."}
