{"game_id": "0022100055", "chunk_id": "0022100055_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Miles Bridges scored 31 points, Gordon Hayward added 24 and the Charlotte Hornets beat the Orlando Magic 120-111 on Wednesday night for their fourth win in five games."}
{"game_id": "0022100055", "chunk_id": "0022100055_002", "order": 2, "role": "body", "text": "Bridges, who scored 30 or more points for the third time in four games, hit a 3-pointer with 1:02 remaining to put the game away for the Hornets, whose only loss of the season came in overtime against Boston on Monday night."}
{"game_id": "0022100055", "chunk_id": "0022100055_003", "order": 3, "role": "body", "text": "“His confidence to make plays is just oozing out of him. You can see the belief in himself right now,” Hornets coach James Borrego said of Bridges, who is averaging 26 points on 53% shooting. “He's a very confident kid, and you can just feel his will to lead us to win games.”"}
{"game_id": "0022100055", "chunk_id": "0022100055_004", "order": 4, "role": "body", "text": "Cole Anthony led Orlando with 24 points and six assists. Wendell Carter Jr. added 20 points and 10 rebounds for the Magic, who committed eight turnovers in the fourth quarter after leading for most of the game."}
{"game_id": "0022100055", "chunk_id": "0022100055_005", "order": 5, "role": "body", "text": "Jalen McDaniels came off the bench to score 16 points, hitting a 3-pointer to put Charlotte ahead for keeps with 8:18 left. LaMelo Ball followed quickly with another 3-pointer, and Bridges returned to the court to help the Hornets stay ahead."}
{"game_id": "0022100055", "chunk_id": "0022100055_006", "order": 6, "role": "body", "text": "“I thought (the fourth-quarter rally) showed a lot of maturity,” center Miles Plumlee said. “It was a good response to the Boston game.”"}
{"game_id": "0022100055", "chunk_id": "0022100055_007", "order": 7, "role": "body", "text": "The Hornets held the Magic to 18 points, and one 3-pointer, in the final quarter."}
{"game_id": "0022100055", "chunk_id": "0022100055_008", "order": 8, "role": "body", "text": "“I saw one good defensive quarter,” Borrego said. “The fourth quarter is what it's got to look like. For us to be an elite team, we've got to do it closer to 48 (minutes).”"}
{"game_id": "0022100055", "chunk_id": "0022100055_009", "order": 9, "role": "body", "text": "After Charlotte erased an early 12-point Orlando lead, Bridges and Hayward combined for 21 points in the second quarter to help the Hornets lead 64-61 at halftime."}
{"game_id": "0022100055", "chunk_id": "0022100055_010", "order": 10, "role": "body", "text": "Anthony and Gary Harris rallied the Magic to an 85-77 lead in the third quarter, but Bridges responded with eight straight points for Charlotte."}
{"game_id": "0022100055", "chunk_id": "0022100055_011", "order": 11, "role": "body", "text": "The Hornets shot 52% for the game, made 14 of 30 3-pointers (47%) and had a 40-33 edge in rebounds, led by Plumlee's 10."}
{"game_id": "0022100055", "chunk_id": "0022100055_013", "order": 13, "role": "body", "text": "Hornets: The Hornets are averaging 121.2 points after five games, second-best in the NBA. ... G Terry Rozier (sprained left ankle) worked out Wednesday and is hopeful of playing Friday. ... F P.J. Washington missed a second game with a right knee sprain."}
{"game_id": "0022100055", "chunk_id": "0022100055_014", "order": 14, "role": "body", "text": "Magic: The Magic are 55-56 all-time against Charlotte, having lost 19 of the last 26 meetings. ... Rookie Jalen Suggs, who had eight points and five assists, is shooting 29% (18 for 63) after five games. ... F Chuma Okeke (hip), G Michael Carter-Williams (ankle) and G E'Twaun Moore (knee) have yet to play in the regular season, though none of the injuries is considered long-term."}
{"game_id": "0022100055", "chunk_id": "0022100055_016", "order": 16, "role": "body", "text": "Hayward’s first basket came on a 3-point attempt that drew a goaltending call early in the second quarter. The shot hung on the rim until it was touched by Orlando’s Carter. After a conference, officials Josh Tiven, Scott Wall and Danielle Scott ruled Carter had interfered with the shot attempt."}
{"game_id": "0022100055", "chunk_id": "0022100055_018", "order": 18, "role": "body", "text": "Hornets: At Miami on Friday night."}
{"game_id": "0022100055", "chunk_id": "0022100055_019", "order": 19, "role": "body", "text": "Magic: At Toronto on Friday night."}
