{"game_id": "0022101059", "chunk_id": "0022101059_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Miles Bridges scored 23 points, P.J. Washington added a season-high 21 and the Charlotte Hornets routed the road-weary Dallas Mavericks 129-108 on Saturday night for their fourth straight victory."}
{"game_id": "0022101059", "chunk_id": "0022101059_002", "order": 2, "role": "body", "text": "Terry Rozier scored 18 points, and LaMelo Ball and Kelly Oubre each had 17 points for the Hornets. They shot 20 of 42 from 3-point range."}
{"game_id": "0022101059", "chunk_id": "0022101059_003", "order": 3, "role": "body", "text": "“We knew it was going to turn around for us eventually,” Bridges said, referring to the Hornets losing 11 of their final 13 games in February."}
{"game_id": "0022101059", "chunk_id": "0022101059_004", "order": 4, "role": "body", "text": "Luka Doncic had 37 points and eight 3s for the Mavericks, who were playing their fifth road game in eight nights and on the second night of a back-to-back. Doncic did not play in the fourth quarter with the game out of hand."}
{"game_id": "0022101059", "chunk_id": "0022101059_005", "order": 5, "role": "body", "text": "The Hornets (36-35) moved into sole possession of ninth place in the Eastern Conference, a half-game ahead of Atlanta. They are one game behind eighth-place Brooklyn."}
{"game_id": "0022101059", "chunk_id": "0022101059_006", "order": 6, "role": "body", "text": "“We are playing well, we are playing hard and we are playing together and that’s all I can ask for,” Hornets coach James Borrego said. “... Right now we have to sustain it and keep our foot on the gas.”"}
{"game_id": "0022101059", "chunk_id": "0022101059_007", "order": 7, "role": "body", "text": "Said Bridges: “As long as we keep playing like this I think we’re going to be good in the standings.”"}
{"game_id": "0022101059", "chunk_id": "0022101059_008", "order": 8, "role": "body", "text": "The Hornets are playing unselfish basketball, averaging 34 assists during their win streak."}
{"game_id": "0022101059", "chunk_id": "0022101059_009", "order": 9, "role": "body", "text": "“We all are good 1-on-1 players and it is tough sometimes to get to the second side\" of the court, Bridges said. “But everybody is buying into the offense.”"}
{"game_id": "0022101059", "chunk_id": "0022101059_010", "order": 10, "role": "body", "text": "The Mavericks (43-28) beat Houston, Boston and Brooklyn to open the five-game trip, but lost at Philadelphia and Charlotte on consecutive nights to fall 1 1/2 games behind the fourth-place Utah Jazz in the West."}
{"game_id": "0022101059", "chunk_id": "0022101059_011", "order": 11, "role": "body", "text": "Mavericks coach Jason Kidd said his team’s play on defense over the last two games needs to improve."}
{"game_id": "0022101059", "chunk_id": "0022101059_012", "order": 12, "role": "body", "text": "“Sometimes when you rely on scoring when things are good there can be some slippage on the defensive end,” Kidd said. “We are trending down and we have to pay attention to that and get back to playing the way that we have in the past.”"}
{"game_id": "0022101059", "chunk_id": "0022101059_013", "order": 13, "role": "body", "text": "The Hornets came out of the gates hot, bolting to a 19-4 lead after making their first seven shots from the field, including five 3s. The Mavericks looked slow closing out on shots as Charlotte made eight 3s in the first quarter."}
{"game_id": "0022101059", "chunk_id": "0022101059_014", "order": 14, "role": "body", "text": "Dallas showed signs of life by battling back to take the lead late in the second quarter, but the Hornets closed the first half on an 11-0 run to take a 61-52 edge at the break."}
{"game_id": "0022101059", "chunk_id": "0022101059_015", "order": 15, "role": "body", "text": "Charlotte pulled away in the third quarter despite 21 points from Doncic, and extended the lead to 32 in the fourth quarter. Charlotte was 15 of 22 from the field in the third quarter and outscored the Mavericks 41-28 as Bridges and Washington combined for 23 points."}
{"game_id": "0022101059", "chunk_id": "0022101059_017", "order": 17, "role": "body", "text": "Nobody plays more zone than the Hornets, and that was on full display against the Mavericks."}
{"game_id": "0022101059", "chunk_id": "0022101059_018", "order": 18, "role": "body", "text": "Kidd said that he expects more teams to play zone against them in the playoffs, so Saturday night's game was a good learning experience for his team."}
{"game_id": "0022101059", "chunk_id": "0022101059_019", "order": 19, "role": "body", "text": "“Teams are trying to take the ball out of Luka's hands, so other guys are going to have to make plays and step up and make shots,\" Kidd said. \"So this is a great dress rehearsal for them.”"}
{"game_id": "0022101059", "chunk_id": "0022101059_021", "order": 21, "role": "body", "text": "Mavericks: Spencer Dinwiddie (injury recovery, right knee), Tim Hardaway Jr. (left foot surgery) and Theo Pinson (right fifth finger fracture) all sat out. ... Davis Bertans fouled out early in the fourth quarter with two points. ... With the Mavs trailing by 31 in the fourth quarter, Dallas fans in the crowd began chanting “We want Boban” Marjanovic. He did not play."}
{"game_id": "0022101059", "chunk_id": "0022101059_022", "order": 22, "role": "body", "text": "Hornets: Gordon Hayward missed his 16th straight game with a sprained left ankle."}
{"game_id": "0022101059", "chunk_id": "0022101059_024", "order": 24, "role": "body", "text": "Mavericks: Host Minnesota on Monday night."}
{"game_id": "0022101059", "chunk_id": "0022101059_025", "order": 25, "role": "body", "text": "Hornets: Host New Orleans on Monday night."}
