{"game_id": "0022100098", "chunk_id": "0022100098_001", "order": 1, "role": "lead", "text": "BOSTON -- — DeMar DeRozan scored 37 points and the Chicago Bulls rallied from a 19-point, second-half deficit on Monday night to beat the Boston Celtics 128-114 and improve to 6-1 for the season."}
{"game_id": "0022100098", "chunk_id": "0022100098_002", "order": 2, "role": "body", "text": "Zach LaVine scored 26 points and Nikola Vucevic had 11 points, 10 rebounds and nine assists for the Bulls, who outscored Boston 39-11 in the fourth quarter to turn a 14-point lead into a 14-point victory."}
{"game_id": "0022100098", "chunk_id": "0022100098_003", "order": 3, "role": "body", "text": "“It was very gratifying to see we kept the fight,” DeRozan said. “We were down big on the road, tough place to play, we didn't get rattled.”"}
{"game_id": "0022100098", "chunk_id": "0022100098_004", "order": 4, "role": "body", "text": "Jaylen Brown scored 28 for the Celtics, who have lost three in a row and left their home court to boos. Al Horford had 20 points and 10 rebounds, and Jayson Tatum scored 20 for Boston."}
{"game_id": "0022100098", "chunk_id": "0022100098_005", "order": 5, "role": "body", "text": "“We got up, got comfortable, got a little bit too cute thinking the game was over in the third quarter,” said Celtics coach Ime Udoka, who fell to 2-5 in his first season at the helm. “We started celebrating early. It’s a good lesson learned: You mess with the game, it will come back to bite you.”"}
{"game_id": "0022100098", "chunk_id": "0022100098_006", "order": 6, "role": "body", "text": "The Celtics led 94-75 with about three minutes left in the third quarter and still had a 103-89 lead entering the fourth. But Chicago scored the first 12 points in the fourth to cut the deficit to two points, 103-101, with just over 8 minutes left."}
{"game_id": "0022100098", "chunk_id": "0022100098_007", "order": 7, "role": "body", "text": "Ayo Dosunmu, a second-round draft pick who had his first double-digit NBA game with 14 points, hit a 3-pointer with 6:53 left to put the Bulls up 106-105. The Celtics briefly retook the lead before Chicago scored 18 of the next 20 points."}
{"game_id": "0022100098", "chunk_id": "0022100098_008", "order": 8, "role": "body", "text": "Tatum scored two points on 1-for-8 shooting in the fourth quarter, and Brown was scoreless on just two shots."}
{"game_id": "0022100098", "chunk_id": "0022100098_009", "order": 9, "role": "body", "text": "“We’re running plays for our best players. Every team knows that. They do a good job of shutting that down,” Celtics guard Marcus Smart said. “We can’t allow that.”"}
{"game_id": "0022100098", "chunk_id": "0022100098_010", "order": 10, "role": "body", "text": "The Celtics led 35-31 near the end of the first quarter before DeRozan ran off nine straight points, scoring 11 during a 15-0 run that gave Chicago a 46-35 lead. But Brown scored the next 10 on his own — hitting back-to-back 3-pointers to make it a one-point game."}
{"game_id": "0022100098", "chunk_id": "0022100098_011", "order": 11, "role": "body", "text": "After Dosunmu’s layup, Brown hit another 3, then Smart made one of his own and the Celtics made it an eight-point lead at halftime."}
{"game_id": "0022100098", "chunk_id": "0022100098_013", "order": 13, "role": "body", "text": "The Celtics' Marcus Smart appeared to hurt his leg during the third quarter but gave a thumbs-up to the bench and remained in the game. ... Boston's Robert Williams limped off the court and straight to the locker room after a collision in the third quarter. He returned to the bench for the start of the fourth, and the team said he tweaked his hip."}
{"game_id": "0022100098", "chunk_id": "0022100098_015", "order": 15, "role": "body", "text": "Bulls: Visit Philadelphia on Wednesday night."}
{"game_id": "0022100098", "chunk_id": "0022100098_016", "order": 16, "role": "body", "text": "Celtics: Play at Orlando on Wednesday night."}
