{"game_id": "0022101189", "chunk_id": "0022101189_001", "order": 1, "role": "lead", "text": "PHOENIX -- — The shots kept falling for Devin Booker, who appeared he was trying to prove a point."}
{"game_id": "0022101189", "chunk_id": "0022101189_002", "order": 2, "role": "body", "text": "The Phoenix Suns are the best team in the NBA this season and, according to the standings, it isn't particularly close."}
{"game_id": "0022101189", "chunk_id": "0022101189_003", "order": 3, "role": "body", "text": "Booker scored 32 points to lead the Suns to their franchise-record 63rd victory Tuesday night, beating a Lakers team minus LeBron James 121-110 to eliminate Los Angeles from the playoff race."}
{"game_id": "0022101189", "chunk_id": "0022101189_004", "order": 4, "role": "body", "text": "“Tonight is unbelievably special for so many people,” Suns coach Monty Williams said. “Not just the organization, but the people in the city, who have basically birthed the Suns. Everywhere I go, people say the Suns are their baby."}
{"game_id": "0022101189", "chunk_id": "0022101189_005", "order": 5, "role": "body", "text": "“It's hard to put it into words, but we're all pretty grateful.”"}
{"game_id": "0022101189", "chunk_id": "0022101189_006", "order": 6, "role": "body", "text": "Booker signed his jersey during the postgame celebration before handing it to team radio broadcaster Al McCoy, who is in the midst of his 50th season on the microphone. McCoy has watched a lot of good basketball over a half century — describing stars such as Charles Barkley, Walter Davis and Steve Nash — but none of them won as many games for the Suns in one season as this Booker and Chris Paul-led team."}
{"game_id": "0022101189", "chunk_id": "0022101189_007", "order": 7, "role": "body", "text": "Phoenix is 63-16, which is eight games better than the Memphis Grizzlies, who have the second-most wins in the NBA."}
{"game_id": "0022101189", "chunk_id": "0022101189_008", "order": 8, "role": "body", "text": "It was a tight game on Tuesday during the first half but Phoenix used a 29-9 run in the third quarter to create separation. The rest of the night was essentially a celebration for the Suns, who danced and dunked their way past the forlorn Lakers."}
{"game_id": "0022101189", "chunk_id": "0022101189_009", "order": 9, "role": "body", "text": "“All I could do the last five seconds of the game is tell everybody how much I appreciate them,” Suns forward Deandre Ayton said. “And there's a lot more to go. But on this team, we celebrate everything.”"}
{"game_id": "0022101189", "chunk_id": "0022101189_010", "order": 10, "role": "body", "text": "Los Angeles — playing without James for a second consecutive game because of a sprained ankle — has lost seven straight. Russell Westbrook scored 28 points while Anthony Davis added 21 points and 13 rebounds."}
{"game_id": "0022101189", "chunk_id": "0022101189_011", "order": 11, "role": "body", "text": "Lakers coach Frank Vogel said he was “extremely disappointed” that his team won't play in the postseason."}
{"game_id": "0022101189", "chunk_id": "0022101189_012", "order": 12, "role": "body", "text": "“We fell short. We were eliminated tonight,” he said. “I can say it has not been due to lack of effort. We have all put in the work. Our guys stayed fighting right until the end. We brought integrity to the process. We just fell short though a disjointed season.”"}
{"game_id": "0022101189", "chunk_id": "0022101189_013", "order": 13, "role": "body", "text": "Ayton had 22 points for Phoenix, which avoided its first three-game losing streak of the season."}
{"game_id": "0022101189", "chunk_id": "0022101189_014", "order": 14, "role": "body", "text": "Even without James, the Lakers led for a big chunk of the first half. But the Suns started to take control late in the second quarter, and two straight alley-oops from Paul to Ayton put Phoenix up 56-50."}
{"game_id": "0022101189", "chunk_id": "0022101189_015", "order": 15, "role": "body", "text": "The Suns took a 63-58 into halftime. Booker scored 16 points and Ayton added 14. Westbrook had 18 points for the Lakers before the break."}
{"game_id": "0022101189", "chunk_id": "0022101189_016", "order": 16, "role": "body", "text": "Phoenix pulled away in the third quarter, jumping to an 84-65 advantage in the first six minutes. Booker scored 16 points in the third and finished 12 of 22 from the field, including 6 for 9 from 3-point range."}
{"game_id": "0022101189", "chunk_id": "0022101189_017", "order": 17, "role": "body", "text": "Once the Suns built their big lead, the Lakers didn't seem particularly interested in mounting a comeback. Los Angeles finished with 16 turnovers, plagued by the same poor decisions that have hurt the Lakers much of the season."}
{"game_id": "0022101189", "chunk_id": "0022101189_019", "order": 19, "role": "body", "text": "The Lakers have potentially five future Hall of Famers on their roster — James, Davis, Westbrook, Carmelo Anthony and Dwight Howard — and still couldn't find a way to make the playoffs."}
{"game_id": "0022101189", "chunk_id": "0022101189_020", "order": 20, "role": "body", "text": "Davis and James missed significant chunks of the season with injuries and Westbrook never seemed to mesh well with his new team."}
{"game_id": "0022101189", "chunk_id": "0022101189_021", "order": 21, "role": "body", "text": "“Some things we could control, some things we couldn’t,” Anthony said. “It is nothing more than we just didn’t get it done. We can’t make excuses; we just didn’t get it done.”"}
{"game_id": "0022101189", "chunk_id": "0022101189_023", "order": 23, "role": "body", "text": "Lakers: Howard had eight points and six rebounds in the first quarter. He came into the game averaging 5.8 points per game. ... Austin Reaves scored 18 points off the bench."}
{"game_id": "0022101189", "chunk_id": "0022101189_024", "order": 24, "role": "body", "text": "Suns: Booker, Ayton and Jae Crowder all played after sitting out Sunday's loss to the Thunder. ... JaVale McGee added nine points and nine rebounds. ... The Suns topped their previous record of 62 wins in a season. They accomplished it twice, in 1992-93 and again in 2004-05. ... The Suns swept the Lakers this season, winning all four games. ... The Suns hosted a sellout crowd for a 25th straight game. ... Paul has been part of four NBA teams that have set regular-season franchise records for wins, including the Suns, Clippers, Pelicans and Rockets."}
{"game_id": "0022101189", "chunk_id": "0022101189_026", "order": 26, "role": "body", "text": "Lakers: Visit the Golden State Warriors on Thursday."}
{"game_id": "0022101189", "chunk_id": "0022101189_027", "order": 27, "role": "body", "text": "Suns: At the Los Angeles Clippers on Wednesday."}
