{"game_id": "0022100685", "chunk_id": "0022100685_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — LeBron James scored 29 points and played exclusively at center in the second half as the Los Angeles Lakers rallied from an eight-point halftime deficit and beat the Orlando Magic 116-105 on Friday night."}
{"game_id": "0022100685", "chunk_id": "0022100685_002", "order": 2, "role": "body", "text": "Los Angeles coach Frank Vogel replaced starting center Dwight Howard with James to start the second half, and the Lakers opened the third quarter on a 20-2 run. They outscored Orlando 31-16 in the third, making 13 of 23 shots and 5 of 8 3-pointers in the frame."}
{"game_id": "0022100685", "chunk_id": "0022100685_003", "order": 3, "role": "body", "text": "“He’s the most unique player in the history of the game,” Vogel said of James. “We won a championship with him playing point guard two years ago, he’s been a ball-handling wing throughout his career and he’s been playing center for us. It’s pretty remarkable, and for him to be doing it at this stage of his career, it’s even more remarkable.”"}
{"game_id": "0022100685", "chunk_id": "0022100685_004", "order": 4, "role": "body", "text": "Carmelo Anthony scored 19 of his 23 points in the second half and hit four 3-pointers, while Stanley Johnson added 11 points off the bench. It was the eighth time the 37-year-old Anthony scored at least 20 points this season."}
{"game_id": "0022100685", "chunk_id": "0022100685_005", "order": 5, "role": "body", "text": "One game after being benched in the fourth quarter of Wednesday’s loss to Indiana, Russell Westbrook had 18 points, 11 rebounds and seven assists. When Westbrook fed James for an alley-oop in the fourth, chants of “M-V-P” broke out for James among the crowd."}
{"game_id": "0022100685", "chunk_id": "0022100685_006", "order": 6, "role": "body", "text": "“I was upset about (not finishing Wednesday’s game) and I was more upset that we didn’t win the game,” Westbrook said. “I’ve been here doing my job since Day 1 and doing everything asked of me. I want to continue to do that for the betterment of the team.”"}
{"game_id": "0022100685", "chunk_id": "0022100685_007", "order": 7, "role": "body", "text": "The Lakers ended a three-game road losing streak, winning away from home for the first time since Dec. 28 in Houston. Friday’s game was the start of a six-game, 11-night trip for the Lakers."}
{"game_id": "0022100685", "chunk_id": "0022100685_008", "order": 8, "role": "body", "text": "“We feel like the first game on an East Coast road trip is always the toughest game, and that first half is usually when you’re trying to get your legs back coming off a long flight from LA,” James said. “We knew we could play a lot better in the second half.\""}
{"game_id": "0022100685", "chunk_id": "0022100685_009", "order": 9, "role": "body", "text": "Orlando lost its fourth straight and for the 14th time in 15 games. The Magic led by 10 at the half in Philadelphia on Wednesday and by eight at the break on Friday but lost both games."}
{"game_id": "0022100685", "chunk_id": "0022100685_010", "order": 10, "role": "body", "text": "Rookie guard Jalen Suggs scored a career-best 22 points for the Magic while Wendell Carter Jr. added 19 points. Mo Bamba, who scored a career-best 32 points on Wednesday, had 11 points and eight rebounds Friday."}
{"game_id": "0022100685", "chunk_id": "0022100685_011", "order": 11, "role": "body", "text": "The Magic dropped to an NBA-worst 2-17 at home. They haven’t won at the Amway Center since Dec. 1 — a span of nine straight home defeats."}
{"game_id": "0022100685", "chunk_id": "0022100685_012", "order": 12, "role": "body", "text": "“They came out with a level of intensity to try and push it back up,” Magic coach Jamahl Mosley said. “The same thing happened when we were in Los Angeles.\""}
{"game_id": "0022100685", "chunk_id": "0022100685_013", "order": 13, "role": "body", "text": "James scored 18 points and Westbrook had 12 in the first 24 minutes, but the Lakers got little else from anyone in the rotation. Los Angeles led by seven in the first quarter, but it surrendered 24 bench points to the Magic in the opening half."}
{"game_id": "0022100685", "chunk_id": "0022100685_015", "order": 15, "role": "body", "text": "Lakers: Vogel was complimentary of Westbrook’s willingness to adapt his game in order to fit in with his new teammates, saying “he’s all-in on doing whatever is necessary to get the Lakers in position to win a championship, for sure.” ... Vogel said there still is no firm timetable for the return of Anthony Davis (left knee sprain), who was on the bench Friday night."}
{"game_id": "0022100685", "chunk_id": "0022100685_016", "order": 16, "role": "body", "text": "Magic: Former Lakers and Magic great Shaquille O’Neal sat courtside. ... Former Magic standout Hedo Turkoglu also attended the game. ... Carter returned after missing the past seven games with a sore left hamstring. ... Mosley and assistant Nate Tibbets cleared the NBA’s health and safety protocols and returned to the bench after missing the previous two games."}
{"game_id": "0022100685", "chunk_id": "0022100685_018", "order": 18, "role": "body", "text": "Lakers: Play at Miami on Sunday night."}
{"game_id": "0022100685", "chunk_id": "0022100685_019", "order": 19, "role": "body", "text": "Magic: Host Chicago on Sunday night."}
