{"game_id": "0022101090", "chunk_id": "0022101090_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — The NBA-leading Phoenix Suns, still playing short-handed, passed another stiff test."}
{"game_id": "0022101090", "chunk_id": "0022101090_002", "order": 2, "role": "body", "text": "Even before Chris Paul comes back, they appear more than ready for another deep postseason run."}
{"game_id": "0022101090", "chunk_id": "0022101090_003", "order": 3, "role": "body", "text": "Deandre Ayton scored a career-high 35 points and had 14 rebounds, Devin Booker had 22 of his 28 points in the second half and the Suns surged past the trash-talking Minnesota Timberwolves 125-116 on Wednesday night."}
{"game_id": "0022101090", "chunk_id": "0022101090_004", "order": 4, "role": "body", "text": "Landry Shamet scored 10 of his 19 points in the fourth quarter to help fuel the rally from a 15-point deficit."}
{"game_id": "0022101090", "chunk_id": "0022101090_005", "order": 5, "role": "body", "text": "Phoenix needs one win — or a Memphis loss — to wrap up home-court advantage for the entire playoffs. The Suns have a nine-game lead with nine games left. They have won six straight, 18 of 22 and are 59-14 overall."}
{"game_id": "0022101090", "chunk_id": "0022101090_006", "order": 6, "role": "body", "text": "“That’s a playoff environment,” said Ayton, who clutched the game ball for his career game at a podium afterward for his interview session."}
{"game_id": "0022101090", "chunk_id": "0022101090_007", "order": 7, "role": "body", "text": "Phoenix completed its first sweep of three or more games against Minnesota in 11 seasons."}
{"game_id": "0022101090", "chunk_id": "0022101090_008", "order": 8, "role": "body", "text": "Anthony Edwards scored 19 points and Karl-Anthony Towns had 15 points and 11 rebounds for the Timberwolves. They dropped 1 1/2 games behind Denver for the No. 6 seed that avoids the play-in tournament. Minnesota has its first two-game losing streak since Feb. 9-11."}
{"game_id": "0022101090", "chunk_id": "0022101090_009", "order": 9, "role": "body", "text": "Towns had only three points in the second half. He seemed to spark the exchanges of trash talking and rough stuff that led to three technical fouls and one flagrant foul called on each team."}
{"game_id": "0022101090", "chunk_id": "0022101090_010", "order": 10, "role": "body", "text": "The Suns sure weren’t fazed by it."}
{"game_id": "0022101090", "chunk_id": "0022101090_011", "order": 11, "role": "body", "text": "“I don’t think we were on much of that talking until they started it, to be completely honest,” said Booker, who is a close friend of Towns and Timberwolves point guard D’Angelo Russell. “It’s a long game. We’ve seen that situation plenty of times before — a team comes out, gets hots and gets comfortable. We just stuck with what we do.”"}
{"game_id": "0022101090", "chunk_id": "0022101090_012", "order": 12, "role": "body", "text": "Towns was called for a Flagrant 1 foul with 8:35 to go on Shamet, who gave the Suns their first lead at 95-94 with a pair of free throws. They stayed ahead the rest of the way."}
{"game_id": "0022101090", "chunk_id": "0022101090_013", "order": 13, "role": "body", "text": "“I think that changed the game, unfortunately,” Towns said."}
{"game_id": "0022101090", "chunk_id": "0022101090_014", "order": 14, "role": "body", "text": "The Suns, who have confidently maintained their comfortable margin for the NBA’s best record without the playmaking and leadership of the 12-time All-Star Paul for the last month, have also been playing without sixth-man Cam Johnson. They’re 11-4 since Paul broke his right thumb."}
{"game_id": "0022101090", "chunk_id": "0022101090_015", "order": 15, "role": "body", "text": "The Suns never flinched against a promising team trying to make its way up with young energy, a deep offense and a dose of bravado. The Timberwolves were outscored 42-28 in the fourth quarter by the Suns, who are 29-6 on the road — better than every other NBA team’s record at home."}
{"game_id": "0022101090", "chunk_id": "0022101090_016", "order": 16, "role": "body", "text": "“We know where we want to go. You’ve got to win games like this on the road. So this is not just practice for us. We value these experiences, and you’ve got to have a level of mental fortitude and stamina,” coach Monty Williams said."}
{"game_id": "0022101090", "chunk_id": "0022101090_018", "order": 18, "role": "body", "text": "Booker reached the 11,000-point mark for his career. He’s the fourth-youngest player in NBA history to get there, behind LeBron James, Kevin Durant and Kobe Bryant."}
{"game_id": "0022101090", "chunk_id": "0022101090_020", "order": 20, "role": "body", "text": "Towns drove to the basket late in the second quarter and delivered a one-handed dunk on Jae Crowder complete with a stare-down, igniting the crowd and irritating the Suns. Just a few seconds later, a double technical foul was called on Towns and Crowder. Then Timberwolves coach Chris Finch got one, too, for his protest."}
{"game_id": "0022101090", "chunk_id": "0022101090_021", "order": 21, "role": "body", "text": "Crowder later clipped Timberwolves pest Patrick Beverley in the head to draw a Flagrant 1 foul after the video review, putting Beverley at the line after time in the first half expired."}
{"game_id": "0022101090", "chunk_id": "0022101090_022", "order": 22, "role": "body", "text": "Ayton and Booker both got technicals in the second half."}
{"game_id": "0022101090", "chunk_id": "0022101090_023", "order": 23, "role": "body", "text": "“Both teams was crying a lot. The refs got it for sure,” Ayton said, laughing. “They didn’t hear a word after that. I shut up after that.”"}
{"game_id": "0022101090", "chunk_id": "0022101090_025", "order": 25, "role": "body", "text": "The Timberwolves will have the tiebreaker over the Nuggets, but they have two more losses. Their game at Denver on April 1 could well be the determinant."}
{"game_id": "0022101090", "chunk_id": "0022101090_026", "order": 26, "role": "body", "text": "The Nuggets have nine games left, and five of them are against teams that were 10 or more games under the .500 mark entering Wednesday. The Timberwolves have eight games remaining, five against opponents eight games or more above .500."}
{"game_id": "0022101090", "chunk_id": "0022101090_028", "order": 28, "role": "body", "text": "Suns: Mikal Bridges had 16 points. ... Cam Payne, Paul’s backup, returned to the lineup after missing the previous game with an illness. ... Ayton has 119 points in six career games against Minnesota."}
{"game_id": "0022101090", "chunk_id": "0022101090_029", "order": 29, "role": "body", "text": "Timberwolves: Towns also passed the 11,000-point mark in the 475th game of his career. Hall of Fame member Kevin Garnett is the only other player in franchise history to reach that milestone, having done so in 575 games. ... The bench had a 55-28 scoring edge on the Suns. The Timberwolves fell to 21-10 this season when their reserves score 40-plus points."}
{"game_id": "0022101090", "chunk_id": "0022101090_031", "order": 31, "role": "body", "text": "Suns: At Denver on Thursday night."}
{"game_id": "0022101090", "chunk_id": "0022101090_032", "order": 32, "role": "body", "text": "Timberwolves: Host Dallas on Friday night."}
