{"game_id": "0022100939", "chunk_id": "0022100939_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Even without their All-Star backcourt, the Phoenix Suns are a heavy load to handle."}
{"game_id": "0022100939", "chunk_id": "0022100939_002", "order": 2, "role": "body", "text": "Cam Johnson scored 20 points, Deandre Ayton added 18 and the Suns became the first NBA team to 50 wins this season by easily beating the Portland Trail Blazers 120-90 on Wednesday night."}
{"game_id": "0022100939", "chunk_id": "0022100939_003", "order": 3, "role": "body", "text": "“It feels good,” Johnson said. “Fifty is a big benchmark in this league, but now we want to get to 60.”"}
{"game_id": "0022100939", "chunk_id": "0022100939_004", "order": 4, "role": "body", "text": "That's certainly a good possibility. The Suns just need to play .500 ball the rest of the regular season to reach 60 wins."}
{"game_id": "0022100939", "chunk_id": "0022100939_005", "order": 5, "role": "body", "text": "Phoenix won this one without starting guards Chris Paul and Devin Booker. Paul’s been out since Feb. 16 because of a broken thumb and could miss the rest of the regular season. Booker was placed in the league’s COVID-19 health and safety protocols Wednesday, but the Suns didn't flinch."}
{"game_id": "0022100939", "chunk_id": "0022100939_006", "order": 6, "role": "body", "text": "“We know how to adjust,” Ayton said."}
{"game_id": "0022100939", "chunk_id": "0022100939_007", "order": 7, "role": "body", "text": "Johnson was 6 of 8 from the field, and Ayton 9 of 12 to help Phoenix end a two-game skid and break a tie with Golden State for the NBA's best home record at 27-7. Mikal Bridges and Jae Crowder each added 15 points, with Bridges shooting 6 of 9."}
{"game_id": "0022100939", "chunk_id": "0022100939_008", "order": 8, "role": "body", "text": "Brandon Williams had a career-high 14 points for Portland. The depleted Trail Blazers have lost three straight since the All-Star break — all by at least 30 points — and fell to 25-37. They shot just 38.5% from the field and were hurt by 19 turnovers."}
{"game_id": "0022100939", "chunk_id": "0022100939_009", "order": 9, "role": "body", "text": "Portland is adjusting to an overhauled roster after a busy trade deadline. The Trail Blazers are without injured star Damian Lillard, and they traded their other high-scoring guard, CJ McCollum, to New Orleans."}
{"game_id": "0022100939", "chunk_id": "0022100939_010", "order": 10, "role": "body", "text": "“My biggest concern is just trying to get some continuity with our new guys and the guys we had here,” Portland coach Chauncey Billups said. “That is the biggest thing for me. The problem is it's tough to rush that. You have to get it when it comes and keep chipping away at it.”"}
{"game_id": "0022100939", "chunk_id": "0022100939_011", "order": 11, "role": "body", "text": "The Suns led the entire second half and pulled away late in the third quarter, taking a 92-69 advantage into the fourth. They finished with 32 assists."}
{"game_id": "0022100939", "chunk_id": "0022100939_012", "order": 12, "role": "body", "text": "“We were moving the ball,” guard Cameron Payne said. “We played well. We've just got to keep it going.”"}
{"game_id": "0022100939", "chunk_id": "0022100939_013", "order": 13, "role": "body", "text": "Phoenix trailed early in the second quarter but rallied for a 63-48 advantage by halftime. Bridges and Crowder both scored 13 points for the Suns, while Johnson added 11. Anfernee Simons led the Trail Blazers with 11 points before the break, but didn't score in the second half."}
{"game_id": "0022100939", "chunk_id": "0022100939_015", "order": 15, "role": "body", "text": "The Suns honored radio announcer Al McCoy, in his 50th season with the franchise. His first broadcast was on Sept. 27, 1972, in a preseason game, and he's been a fixture on the sideline ever since."}
{"game_id": "0022100939", "chunk_id": "0022100939_016", "order": 16, "role": "body", "text": "The 88-year-old has called three NBA Finals, in 1976, 1993 and 2021. The Suns played a tribute on the video board, complete with messages from former stars like Steve Nash, Charles Barkley, Shaquille O'Neal, Kevin Johnson and NBA Commissioner Adam Silver."}
{"game_id": "0022100939", "chunk_id": "0022100939_018", "order": 18, "role": "body", "text": "Trail Blazers: Portland had a long inactive list that included Lillard, Eric Bledsoe, Joe Ingles, Nassir Little, Didi Louzada, Jusuf Nurkic and Justise Winslow. ... Had 12 turnovers in the first half."}
{"game_id": "0022100939", "chunk_id": "0022100939_019", "order": 19, "role": "body", "text": "Suns: Payne returned after missing 16 games with a sprained right wrist. He finished with five points and eight assists in 20 minutes. ... G Landry Shamet made his eighth start of the year, replacing Booker. He had 12 points. ... Hosted a sellout crowd for a 19th straight game. ... Everyone on the Suns' active roster scored. Six players were in double figures. ... Crowder tied a career high with five steals."}
{"game_id": "0022100939", "chunk_id": "0022100939_021", "order": 21, "role": "body", "text": "Trail Blazers: At Minnesota on Saturday and Monday nights."}
{"game_id": "0022100939", "chunk_id": "0022100939_022", "order": 22, "role": "body", "text": "Suns: Host the New York Knicks on Friday night."}
