{"game_id": "0022101161", "chunk_id": "0022101161_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Joel Embiid had 29 points, 14 rebounds and six assists and the Philadelphia 76ers snapped a three-game losing streak with a 144-114 victory over the Charlotte Hornets on Saturday."}
{"game_id": "0022101161", "chunk_id": "0022101161_002", "order": 2, "role": "body", "text": "Philadelphia tied its franchise record of 21 3-pointers, last set on March 1, 2020."}
{"game_id": "0022101161", "chunk_id": "0022101161_003", "order": 3, "role": "body", "text": "Tobias Harris added 23 points and had a season-high five three-pointers as the Sixers placed seven players in double figures and was able to play their bench for the majority of the fourth quarter."}
{"game_id": "0022101161", "chunk_id": "0022101161_004", "order": 4, "role": "body", "text": "“We were able to move the ball well,\" Embiid said. “I was extremely happy with the way that we played today because (of) the pace and how we moved the ball around and found our shooters.”"}
{"game_id": "0022101161", "chunk_id": "0022101161_005", "order": 5, "role": "body", "text": "James Harden had 12 points and 13 assists for Philadelphia. Tyrese Maxey had 19 points and four assists for the Sixers (47-30), who can clinch a playoff berth with a win on Sunday against Cleveland."}
{"game_id": "0022101161", "chunk_id": "0022101161_006", "order": 6, "role": "body", "text": "Miles Bridges had 20 points for Charlotte, which has already wrapped up a berth in the East's play-in tournament. PJ Washington had 14 points while LaMelo Ball added 13 for the Hornets."}
{"game_id": "0022101161", "chunk_id": "0022101161_007", "order": 7, "role": "body", "text": "“They made shots and you have to give them credit,” Hornets coach James Borrego said. “They made shots. There were a few rotations where we could have been better with Embiid — the easy stuff at the rim with the rolls. Sometimes, you have to pick your poison when they hit their shots.”"}
{"game_id": "0022101161", "chunk_id": "0022101161_008", "order": 8, "role": "body", "text": "Philadelphia broke the game open in the third quarter, outscoring Charlotte by a 45-27 margin and hitting on 17 of 22 shots in the period, including 7 of 10 from beyond the 3-point arc to break open a 58-53 halftime edge."}
{"game_id": "0022101161", "chunk_id": "0022101161_009", "order": 9, "role": "body", "text": "“We needed to come out in the third quarter with a lot more energy and we were able to do that,” Harris said. “We were able to get out off our stops, get good looks and push the pace. When we found a good set that work, we were able to keep going to that. And we have to build off that momentum.”"}
{"game_id": "0022101161", "chunk_id": "0022101161_010", "order": 10, "role": "body", "text": "The Hornets struggled to defend the 3-point line, allowing the Sixers to shoot 21-for-43 (48.8 percent) from beyond the arc."}
{"game_id": "0022101161", "chunk_id": "0022101161_011", "order": 11, "role": "body", "text": "“They made shots, but our turnovers helped give them some easy looks the other way,” Borrego said."}
{"game_id": "0022101161", "chunk_id": "0022101161_012", "order": 12, "role": "body", "text": "Embiid scored 21 points and grabbed 11 rebounds in the first half as Philadelphia's offense seemed to flow more through Harden, who was 4-for-15 from the floor in the Sixers' 102-94 loss at Detroit on Thursday night. Harden became more of a distributor, getting the ball to Embiid down low and Harris in the corner."}
{"game_id": "0022101161", "chunk_id": "0022101161_013", "order": 13, "role": "body", "text": "“We're balancing everything game by game and possession by possession,” Harden said. “When Tyrese and Tobi have it going on and they are being aggressive, we can put up 140. It's just me trying to make the right plays. There are nights when I'm going to have to be aggressive. It's just going possession by possession and seeing the game as it plays out.”"}
{"game_id": "0022101161", "chunk_id": "0022101161_015", "order": 15, "role": "body", "text": "Hornets: Gordon Hayward returned to the Charlotte roster on Saturday for the first time after missing 22 games with a left ankle sprain on Feb. 7. The forward came off the bench as Hornets coach James Borrego tries to manage his minutes before Charlotte's appearance in the East's play-in tournament, scoring five points in 16 minutes."}
{"game_id": "0022101161", "chunk_id": "0022101161_016", "order": 16, "role": "body", "text": "“The first time out of the gate, it's going to take a minute,” Borrego said. “He looked comfortable and I didn't see any hestitation or reservation from him. That's positive.”"}
{"game_id": "0022101161", "chunk_id": "0022101161_017", "order": 17, "role": "body", "text": "76ers: The Sixers set season highs in points (144), three-pointers made (21) and assists. ... Embiid showed reporters after the game that he has a cut at the bend point on his right middle finger that he says has been in place for a few months as a result of passing and dunking at different points. He did not indicate that the cut will force him to miss any time."}
{"game_id": "0022101161", "chunk_id": "0022101161_019", "order": 19, "role": "body", "text": "Hornets: Play at Miami on Tuesday night. Miami has won the first three games between the two teams this season."}
{"game_id": "0022101161", "chunk_id": "0022101161_020", "order": 20, "role": "body", "text": "76ers: At Cleveland on Sunday. It is the first game of a three-game road trip that will serve as the final one of Philadelphia's regular season"}
