{"game_id": "0022100354", "chunk_id": "0022100354_001", "order": 1, "role": "lead", "text": "DETROIT -- — Shea Gilgeous-Alexander had 30 points and 13 assists, Luguentz Dort scored 28 points and the Oklahoma City Thunder rallied past the Detroit Pistons 114-103 Monday night in a battle of teams that entered with eight-game losing streaks."}
{"game_id": "0022100354", "chunk_id": "0022100354_002", "order": 2, "role": "body", "text": "“I thought our team showed a lot of heart and fight in the second half,” Thunder coach Mark Daigneault said. “We've lost all these games, so it would have been easy to give up when they came out making everything. They didn't do that.”"}
{"game_id": "0022100354", "chunk_id": "0022100354_003", "order": 3, "role": "body", "text": "Detroit led by 16 in the third quarter and 12 early in the fourth, but the Pistons were outscored 25-8 in the final five minutes of their ninth straight loss."}
{"game_id": "0022100354", "chunk_id": "0022100354_004", "order": 4, "role": "body", "text": "“We played a great first half, but we forgot how to take care of the ball in the third quarter and we didn't play defense in the fourth,” Pistons coach Dwane Casey said. “We're a young team, but that's not an excuse. We have to learn to play 48 minutes a night.”"}
{"game_id": "0022100354", "chunk_id": "0022100354_005", "order": 5, "role": "body", "text": "Gilgeous-Alexander's layup with 3:46 left gave Oklahoma City its first lead of the game, and after Cade Cunningham's miss, Mike Muscala made it 101-97 with a 3-pointer."}
{"game_id": "0022100354", "chunk_id": "0022100354_006", "order": 6, "role": "body", "text": "Another empty possession by the Pistons led to a three-point play for Dort, giving Oklahoma City a 104-97 advantage with 2:43 to play."}
{"game_id": "0022100354", "chunk_id": "0022100354_007", "order": 7, "role": "body", "text": "“We didn't focus on how far behind we were, we just tried to win the next possession,” Gilgeous-Alexander said. “I didn't know we were shooting (89.5%) for the quarter. I was just trying to get us a good look every time we had the ball.”"}
{"game_id": "0022100354", "chunk_id": "0022100354_008", "order": 8, "role": "body", "text": "Cunningham had 28 points and 11 rebounds for the Pistons, while Jeremi Grant added 20 points."}
{"game_id": "0022100354", "chunk_id": "0022100354_009", "order": 9, "role": "body", "text": "“We talked before the game about how this was the night we were going to change this,” Cunningham said. “But we've got 19 losses now. We have to stop talking about fixing this and start doing something on the floor.”"}
{"game_id": "0022100354", "chunk_id": "0022100354_010", "order": 10, "role": "body", "text": "Cunningham scored nine points in the first five minutes and finished with 15 in the first half. The offensively challenged Pistons shot 49% from the floor, including 52.6% on 3-pointers, to take a 63-50 lead into the half."}
{"game_id": "0022100354", "chunk_id": "0022100354_011", "order": 11, "role": "body", "text": "“They came out shooting that way, but we kept playing hard with the wind in our face,” Daigneault said, “That's the reason we were able to take advantage when we got the wind at our back down the stretch.”"}
{"game_id": "0022100354", "chunk_id": "0022100354_012", "order": 12, "role": "body", "text": "Detroit only scored 18 points in the third quarter, turning the ball over seven times, but played enough defense to hang on to a nine-point lead."}
{"game_id": "0022100354", "chunk_id": "0022100354_013", "order": 13, "role": "body", "text": "“We stopped playing the way we are supposed to play,” Cunningham said. “Instead of following the game plan, we started freestyling.\""}
{"game_id": "0022100354", "chunk_id": "0022100354_014", "order": 14, "role": "body", "text": "Jordan Lyles opened the fourth with a 3-pointer, but the Thunder answered with a nine-point run. Casey called a timeout with 9:33 left and his team's lead down to 84-81."}
{"game_id": "0022100354", "chunk_id": "0022100354_015", "order": 15, "role": "body", "text": "“We could smell the win at that point,” Daigneault said. “We just had to keep up the effort.”"}
{"game_id": "0022100354", "chunk_id": "0022100354_017", "order": 17, "role": "body", "text": "Thunder: Oklahoma City, the fifth-best rebounding team in the NBA, was outrebounded 52-40. The Pistons had 16 offensive rebounds."}
{"game_id": "0022100354", "chunk_id": "0022100354_018", "order": 18, "role": "body", "text": "Pistons: Detroit came into the game ranked second in the league in bench scoring at 39.4 points per game. However, the Pistons only got 12 points from the bench in the first half."}
{"game_id": "0022100354", "chunk_id": "0022100354_020", "order": 20, "role": "body", "text": "Thunder: Visit the Toronto Raptors on Wednesday."}
{"game_id": "0022100354", "chunk_id": "0022100354_021", "order": 21, "role": "body", "text": "Pistons: Host the Washington Wizards on Wednesday."}
