{"game_id": "0022100515", "chunk_id": "0022100515_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Tyrese Haliburton had 24 points and 10 assists, and the Sacramento Kings held off the Oklahoma City Thunder 117-111 on Tuesday night."}
{"game_id": "0022100515", "chunk_id": "0022100515_002", "order": 2, "role": "body", "text": "Buddy Hield added 21 points off the bench for the Kings. Harrison Barnes scored 17 and De’Aaron Fox had 12 points and eight assists."}
{"game_id": "0022100515", "chunk_id": "0022100515_003", "order": 3, "role": "body", "text": "“We needed a win in any kind of way,” said Kings interim coach Alvin Gentry, who was highly critical of his team following a 25-point loss to Memphis on Sunday. “We have some things that we have to correct and we have to correct immediately. (But) we got back on track and did a really good job of finding a way to close the game.”"}
{"game_id": "0022100515", "chunk_id": "0022100515_004", "order": 4, "role": "body", "text": "Haliburton played a big role in that while handling point guard duties much of the night, same as he did when Fox was in the NBA’s health and safety protocol."}
{"game_id": "0022100515", "chunk_id": "0022100515_005", "order": 5, "role": "body", "text": "“With guys out I knew I had to step up and be better,” Haliburton said. “I hold myself to a high standard and work really hard. That’s just a (result) of how hard I’ve been working.”"}
{"game_id": "0022100515", "chunk_id": "0022100515_006", "order": 6, "role": "body", "text": "Shai Gilgeous-Alexander scored 33 points for the Thunder."}
{"game_id": "0022100515", "chunk_id": "0022100515_007", "order": 7, "role": "body", "text": "Earlier in the day, Oklahoma City coach Mark Daigneault, rookie Josh Giddey and forward Derrick Favors entered the health and safety protocols. Assistant coach Mike Wilks ran the team in Daigneault’s absence."}
{"game_id": "0022100515", "chunk_id": "0022100515_008", "order": 8, "role": "body", "text": "“Unique situation,” Wilks said. “We had some lows but we kept fighting, kept coming until the end.”"}
{"game_id": "0022100515", "chunk_id": "0022100515_009", "order": 9, "role": "body", "text": "The Kings withstood a scoring flurry by the Thunder in the third quarter, built a 17-point lead early in the fourth and made three free throws over the final 32 seconds to end a three-game losing streak."}
{"game_id": "0022100515", "chunk_id": "0022100515_010", "order": 10, "role": "body", "text": "Haliburton had 10 points in the fourth, including a clutch 3-pointer after Oklahoma City pulled to 106-96. It’s the fifth time in six games Haliburton has had at least 20 points and 10 assists."}
{"game_id": "0022100515", "chunk_id": "0022100515_011", "order": 11, "role": "body", "text": "“The only one that has been able to stop him was me by taking him out of the game the other night (against Memphis),” Gentry said. “He’s playing at a real high level.”"}
{"game_id": "0022100515", "chunk_id": "0022100515_012", "order": 12, "role": "body", "text": "Gilgeous-Alexander kept Oklahoma City close and scored 15 points in the final 12 minutes, but the short-handed Thunder had just two players reach double figures."}
{"game_id": "0022100515", "chunk_id": "0022100515_013", "order": 13, "role": "body", "text": "The Thunder started a lineup that included Isaiah Roby making his second start of the season after not playing four of the last five games due to coach’s decision, and Paul Watson, who was making his third career start and first this season. Roby had eight points and six rebounds, while Watson scored five points."}
{"game_id": "0022100515", "chunk_id": "0022100515_014", "order": 14, "role": "body", "text": "“We didn’t do what we needed to do for the full 48 minutes, but there were some positives for sure,” Gilgeous-Alexander said, noting the loss of players to the health and safety protocol didn’t help. “It’s been a lot, but there’s a lot of teams in the league dealing with it. We know we have a job to do every night — that’s what we focus on.”"}
{"game_id": "0022100515", "chunk_id": "0022100515_015", "order": 15, "role": "body", "text": "Sacramento led by 10 early in the third but Aaron Wiggins had eight points as part of a 17-3 run to give Oklahoma City the lead. The Kings scored the next 13 points and led 87-71 going into the fourth."}
{"game_id": "0022100515", "chunk_id": "0022100515_017", "order": 17, "role": "body", "text": "Thunder: Gabriel Deck made a buzzer-beating 3-pointer to end the first quarter. … Wiggins was called for a technical foul in the second quarter."}
{"game_id": "0022100515", "chunk_id": "0022100515_018", "order": 18, "role": "body", "text": "Kings: Former No. 2 overall draft pick Marvin Bagley III started for the second time this season and had nine points and 10 rebounds. … Damian Jones set a career high with 14 rebounds."}
{"game_id": "0022100515", "chunk_id": "0022100515_020", "order": 20, "role": "body", "text": "Thunder: Play the Suns in Phoenix on Wednesday. Oklahoma City has lost three straight to Phoenix, including 113-101 last Thursday."}
{"game_id": "0022100515", "chunk_id": "0022100515_021", "order": 21, "role": "body", "text": "Kings: Face the Mavericks on Wednesday for the first of two games in three days against Dallas at Golden 1 Center."}
