{"game_id": "0022100162", "chunk_id": "0022100162_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Jerami Grant scored a season-high 35 points to help the Detroit Pistons beat the Houston Rockets 112-104 on Wednesday night in a matchup of two of the worst teams in the NBA."}
{"game_id": "0022100162", "chunk_id": "0022100162_002", "order": 2, "role": "body", "text": "Detroit improved to 2-8, and Houston dropped to 1-10."}
{"game_id": "0022100162", "chunk_id": "0022100162_003", "order": 3, "role": "body", "text": "Grant shot 12 of 23 from the field, including 4 of 9 from 3-point range. It was a stark contrast to his last game when he went 0 for 9 from the field, missing four 3s, in a 96-90 loss to Brooklyn on Friday night."}
{"game_id": "0022100162", "chunk_id": "0022100162_004", "order": 4, "role": "body", "text": "“He got us going,” Pistons coach Dwane Casey said. “His ability to attack the paint, get to the rim, then set up his outside shooting was big for us. Not only did he do that, but he also got some rebounds and kept us going in that way. It was a big night for Jerami. Huge night.”"}
{"game_id": "0022100162", "chunk_id": "0022100162_005", "order": 5, "role": "body", "text": "The meeting was the first between the top two picks in the July draft. Cade Cunningham, Detroit’s choice as the No. 1 pick, had 20 points on 8-of-18 shooting. Houston’s Jalen Green, the No. 2 pick, had 23 points on 8-of-20 shooting."}
{"game_id": "0022100162", "chunk_id": "0022100162_006", "order": 6, "role": "body", "text": "Green had a thunderous dunk midway through the third quarter and appeared to shout something at Cunningham. He received a technical foul."}
{"game_id": "0022100162", "chunk_id": "0022100162_007", "order": 7, "role": "body", "text": "“I don’t remember exactly what I said,” Green said. “It was just the intensity of the game. I was getting fired up.”"}
{"game_id": "0022100162", "chunk_id": "0022100162_008", "order": 8, "role": "body", "text": "Cunningham downplayed the impact of Green’s words on-court."}
{"game_id": "0022100162", "chunk_id": "0022100162_009", "order": 9, "role": "body", "text": "“Nothing that I heard tonight held any weight to me — it was just all for cameras, I felt like,” Cunningham said. “So, I wasn’t really tripping. I was just trying to play the game.”"}
{"game_id": "0022100162", "chunk_id": "0022100162_010", "order": 10, "role": "body", "text": "Cunningham hit a 3 with less than five minutes remaining in the game to stop a 10-0 Houston run and put Detroit up 103-96. He took a charge from a driving Green on the next play."}
{"game_id": "0022100162", "chunk_id": "0022100162_011", "order": 11, "role": "body", "text": "“We came back, and I just kept telling them to believe and to be together,” Rockets coach Stephen Silas said. “We came back, and we fought, but it wasn’t enough. We need to learn how to close the deal, and we didn’t do that tonight.”"}
{"game_id": "0022100162", "chunk_id": "0022100162_012", "order": 12, "role": "body", "text": "Christian Wood added 20 points and nine rebounds for Houston, and Kevin Porter Jr. had 18 points, five assists and five rebounds."}
{"game_id": "0022100162", "chunk_id": "0022100162_013", "order": 13, "role": "body", "text": "Detroit jumped to an 11-2 lead out of the gate and led 23-21 at the end of the first quarter. Houston led 50-49 at halftime."}
{"game_id": "0022100162", "chunk_id": "0022100162_014", "order": 14, "role": "body", "text": "Kelly Olynyk, who spent the last two months of last season in Houston after being traded away from Miami, had 13 points, six rebounds and six assists. Olynyk limped off the court late in the game, and Casey said he would be evaluated."}
{"game_id": "0022100162", "chunk_id": "0022100162_016", "order": 16, "role": "body", "text": "Pistons: PG Killian Hayes returned to the starting lineup after missing one game with a left thumb sprain and had four points in 31 minutes. … C Isaiah Stewart received a technical foul early in the fourth quarter after shouting after he was called for a foul."}
{"game_id": "0022100162", "chunk_id": "0022100162_017", "order": 17, "role": "body", "text": "Rockets: SF Danuel House Jr. returned after missing six games with a right foot sprain. House Jr. played 19 minutes and had eight points. … Rookie C Alperen Sengun missed the game with illness. … SG Eric Gordon returned after a one-game absence with right groin tightness, scoring 11 in 29 minutes."}
{"game_id": "0022100162", "chunk_id": "0022100162_019", "order": 19, "role": "body", "text": "Kevin Porter Jr. expressed frustration after a turnover late in the second quarter where he was trying to hit a cutting Daniel Theis with a bounce pass, and it went out of bounds. Theis pointed up, indicating he wanted Porter Jr. to throw the pass in the air. A few possessions later, Porter Jr. found Theis for a perfect alley-oop and two-handed finish."}
{"game_id": "0022100162", "chunk_id": "0022100162_021", "order": 21, "role": "body", "text": "“He’s got that gene where he can perform down the stretch under pressure.” — Casey on Cunningham."}
{"game_id": "0022100162", "chunk_id": "0022100162_023", "order": 23, "role": "body", "text": "Pistons: At Cleveland on Friday night."}
{"game_id": "0022100162", "chunk_id": "0022100162_024", "order": 24, "role": "closing", "text": "Rockets: Host Portland on Friday night."}
