{"game_id": "0022100082", "chunk_id": "0022100082_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Tobias Harris had 22 points and 11 rebounds, Joel Embiid added 19 points and the Philadelphia 76ers routed the Atlanta Hawks 122-94 Saturday night."}
{"game_id": "0022100082", "chunk_id": "0022100082_002", "order": 2, "role": "body", "text": "Philadelphia carried a 60-36 advantage over the Hawks in the paint while outscoring Atlanta by a 34-14 margin on fast-break points. Six different Sixers finished in double figures with, Tyrese Maxey (16), Seth Curry (15), Matisse Thybulle (11) and Shake Milton (11) all adding to the scoring party in the first game between the teams since Atlanta's seven-game ouster of the Sixers in last year's Eastern Conference semifinals."}
{"game_id": "0022100082", "chunk_id": "0022100082_003", "order": 3, "role": "body", "text": "“When we go out like we did last season, this was a good test for us early this season to know where we stand,” Harris said. “There was obviously more to this game than just a regular-season game.”"}
{"game_id": "0022100082", "chunk_id": "0022100082_004", "order": 4, "role": "body", "text": "Most of what Philadelphia was able to do against Atlanta was breakout on transition, pushing the action and getting open looks inside, shooting 30 of 36 from the paint."}
{"game_id": "0022100082", "chunk_id": "0022100082_005", "order": 5, "role": "body", "text": "“We kept moving the ball and the paint points came from just moving the ball and eventually shots will fall,” Sixers coach Doc Rivers said. “When we play like that, we're pretty good offensively.”"}
{"game_id": "0022100082", "chunk_id": "0022100082_006", "order": 6, "role": "body", "text": "Harris was 9 of 13 from the floor and had four assists. Embiid — who has been forced to play at the perimeter and away from the post because of nagging knee issues left over from last year's postseason — shot 5 of 13 and grabbed five rebounds."}
{"game_id": "0022100082", "chunk_id": "0022100082_007", "order": 7, "role": "body", "text": "“The defense allowed us to increase our pace, feel good running, get a stop and helped us all around,” Harris said."}
{"game_id": "0022100082", "chunk_id": "0022100082_008", "order": 8, "role": "body", "text": "Cam Reddish led the Hawks with 16 points on 7-of-14 shooting from the floor. Trae Young and Bogan Bogdanovic each had 13 points, but Young struggled at 5 for 15 from the floor and only got to the foul line four times."}
{"game_id": "0022100082", "chunk_id": "0022100082_009", "order": 9, "role": "body", "text": "“Our offense is out of sync and that's leading to no defense at all,” Hawks coach Nate McMillan said. “We're turning the ball over. Our shot selection — we're taking quick shots and it's leading to transition baskets. We have no rhythm right now. And this group has to find a chemistry on the offensive end of the floor and that's leading to poor defense.”"}
{"game_id": "0022100082", "chunk_id": "0022100082_010", "order": 10, "role": "body", "text": "It was the first meeting between the teams since Atlanta beat top-seeded Philadelphia in seven games in the Eastern Conference semifinals."}
{"game_id": "0022100082", "chunk_id": "0022100082_011", "order": 11, "role": "body", "text": "“I didn’t talk about it,” Rivers said. “I didn’t think I needed to. I think they knew it.”"}
{"game_id": "0022100082", "chunk_id": "0022100082_012", "order": 12, "role": "body", "text": "The 76ers’ Game 7 defeat was punctuated by Ben Simmons passing on an open dunk in the final minutes — a flashpoint in the ongoing drama between the All-Star point guard and the organization."}
{"game_id": "0022100082", "chunk_id": "0022100082_013", "order": 13, "role": "body", "text": "Simmons was spotted on an exercise bike at the 76ers practice facility following shootaround Saturday."}
{"game_id": "0022100082", "chunk_id": "0022100082_015", "order": 15, "role": "body", "text": "Rivers said there is no time frame for Simmons to return to on-court team activities. Simmons is currently out for “personal reasons” after holding out for a trade and being suspended for conduct detrimental to the team prior to the Sixers opener on Oct. 20."}
{"game_id": "0022100082", "chunk_id": "0022100082_016", "order": 16, "role": "body", "text": "“I stay out of it,” Rivers said. “I really do. My job is to coach the guys who are here and to believe that the guys that are here will play for us some day. That’s all I have to believe as a coach. I try not to get involved as a coach in the clutter.”"}
{"game_id": "0022100082", "chunk_id": "0022100082_017", "order": 17, "role": "body", "text": "Rivers said he has been in contact with Simmons' agent, Rich Paul from Klutch Sports, on a frequent basis. However, Rivers described those conversation as more personal in nature than anything connected to Simmons."}
{"game_id": "0022100082", "chunk_id": "0022100082_019", "order": 19, "role": "body", "text": "Hawks: Young, who has been vocal in his opposition to the NBA's crackdown on defensive fouls initiated by the offensive player, received a technical foul in the first quarter after his reaction to being whistled for a three-shot foul against Philadelphia guard Seth Curry. Young was fined $15,000 on Friday for making contact with referee Ben Taylor during Atlanta's loss to Washington on Thursday night."}
{"game_id": "0022100082", "chunk_id": "0022100082_020", "order": 20, "role": "body", "text": "76ers: Despite indicating that he may shake up his starting lineup, Rivers stayed with his same five starters and brought Milton off the bench. “When I start a new lineup, you will know,” Rivers said."}
{"game_id": "0022100082", "chunk_id": "0022100082_022", "order": 22, "role": "body", "text": "Hawks: Host Washington on Monday night."}
{"game_id": "0022100082", "chunk_id": "0022100082_023", "order": 23, "role": "body", "text": "76ers: Continue four-game homestand against Portland on Monday."}
