{"game_id": "0022101053", "chunk_id": "0022101053_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Malcolm Brogdon scored 25 points and Goga Bitadze added 23, including two key baskets down the stretch, to help the Indiana Pacers beat the Houston Rockets 121-118 on Friday night."}
{"game_id": "0022101053", "chunk_id": "0022101053_002", "order": 2, "role": "body", "text": "A 3-pointer by Tyrese Haliburton cut Houston’s lead to two with about 2 1/2 minutes left. Jalen Green followed with a basket for the Rockets, but the Pacers scored the next six points, with the last four from Bitadze to take a 117-115 lead with about 20 seconds to go."}
{"game_id": "0022101053", "chunk_id": "0022101053_003", "order": 3, "role": "body", "text": "Bitadze was fouled on both his baskets in that stretch but missed both free throws."}
{"game_id": "0022101053", "chunk_id": "0022101053_004", "order": 4, "role": "body", "text": "Indiana coach Rick Carlisle spoke at length about the performance of Bitadze."}
{"game_id": "0022101053", "chunk_id": "0022101053_005", "order": 5, "role": "body", "text": "“Goga Bitadze had a great game,\" he said. “A lot of impact around the rim. It’s great to see him feeling good and having a chance to be out there. I'm real happy for him. He made huge plays, really on both sides of the ball.\""}
{"game_id": "0022101053", "chunk_id": "0022101053_006", "order": 6, "role": "body", "text": "Houston had a chance to tie it, but Kevin Porter Jr.’s jump shot in the lane was off. Buddy Hield made two free throws after that before Porter made a 3-pointer with 1.9 seconds left to cut it to 1."}
{"game_id": "0022101053", "chunk_id": "0022101053_007", "order": 7, "role": "body", "text": "But Hield made two more free throws to seal the victory."}
{"game_id": "0022101053", "chunk_id": "0022101053_008", "order": 8, "role": "body", "text": "“Those last six minutes we really did a good job of creating great shots for ourselves by continuing to work the defense and make that extra pass,\" Carlisle said. “It was just really good basketball down the stretch.\""}
{"game_id": "0022101053", "chunk_id": "0022101053_009", "order": 9, "role": "body", "text": "Christian Wood had 32 points, 13 rebounds and seven assists for the Rockets, who lost their fourth straight. Green added 20 points."}
{"game_id": "0022101053", "chunk_id": "0022101053_010", "order": 10, "role": "body", "text": "“This is a disappointing loss, it really, really is,\" coach Stephen Silas said. “We couldn't come up with the stops we needed in the fourth.\""}
{"game_id": "0022101053", "chunk_id": "0022101053_011", "order": 11, "role": "body", "text": "Houston, which has the worst record in the NBA at 17-53, has had plenty of tough losses this season. But Silas said this one hurt more than most because he believes they should have been able to pull it out."}
{"game_id": "0022101053", "chunk_id": "0022101053_012", "order": 12, "role": "body", "text": "“I'm disappointed for our guys... I haven’t been like this all season, so I’m allowed every once in a while to be super down,\" Silas said. “But yeah they deserved this one.\"\""}
{"game_id": "0022101053", "chunk_id": "0022101053_013", "order": 13, "role": "body", "text": "Consecutive 3-pointers by Brogdon and Hield started an 8-0 run that got he Pacers within a point with 4 1/2 minutes to go."}
{"game_id": "0022101053", "chunk_id": "0022101053_014", "order": 14, "role": "body", "text": "Garrison Mathews was fouled on a 3-pointer after that and made each of his free throws to make it 109-105 a few seconds later."}
{"game_id": "0022101053", "chunk_id": "0022101053_015", "order": 15, "role": "body", "text": "Indiana scored the first seven points of the fourth quarter, capped by a 3 from Lance Stephenson, to cut the lead to 95-90 with about 10 minutes to go."}
{"game_id": "0022101053", "chunk_id": "0022101053_016", "order": 16, "role": "body", "text": "The Rockets scored the next four points, with a dunk from Kenyon Martin Jr., to extend the lead to nine soon after that. But the Pacers used a 7-2 spurt to get to 101-97 midway through the quarter."}
{"game_id": "0022101053", "chunk_id": "0022101053_017", "order": 17, "role": "body", "text": "The Rockets were up by 8 after a dunk by Wood in the third when the Pacers used an 8-2 run, with 3s from Duane Washington Jr. and Oshae Brissett, to cut it to 76-74."}
{"game_id": "0022101053", "chunk_id": "0022101053_018", "order": 18, "role": "body", "text": "Indiana cut the lead to a point after scoring four quick points with about five minutes left in the third, but Houston scored the next six points to make it 87-80 a couple minutes later."}
{"game_id": "0022101053", "chunk_id": "0022101053_019", "order": 19, "role": "body", "text": "Brogdon had a 3-point play for the Pacers after that, but Houston scored the last eight points of the quarter, with four from Wood, to take a 95-83 lead into the fourth."}
{"game_id": "0022101053", "chunk_id": "0022101053_021", "order": 21, "role": "body", "text": "Pacers: Isaiah Jackson missed the game after sustaining a concussion Tuesday. ... Chris Duarte sat out with a sore toe. ... Hield had 15 points. ... Indiana made 14 of 43 3-pointers."}
{"game_id": "0022101053", "chunk_id": "0022101053_022", "order": 22, "role": "body", "text": "Rockets: Eric Gordon missed a second straight game with an illness. ... Porter had 19 points. ... Houston had 15 turnovers."}
{"game_id": "0022101053", "chunk_id": "0022101053_024", "order": 24, "role": "body", "text": "Jalen Smith scored 17 points off the bench for the Pacers before he was injured with about four minutes left in the third quarter. It was unclear what happened, but he remained on the ground for several minutes before being helped up and slowly walking to the locker room. The team said he had a head contusion and he didn’t return."}
{"game_id": "0022101053", "chunk_id": "0022101053_025", "order": 25, "role": "body", "text": "Carlisle said he got hit in the head on the follow through of a pass by Wood and was pretty shaken up but was feeling better after the game."}
{"game_id": "0022101053", "chunk_id": "0022101053_027", "order": 27, "role": "body", "text": "Pacers: Host Portland on Sunday."}
{"game_id": "0022101053", "chunk_id": "0022101053_028", "order": 28, "role": "body", "text": "Rockets: Host Memphis on Sunday."}
