{"game_id": "0022100970", "chunk_id": "0022100970_001", "order": 1, "role": "lead", "text": "MIAMI -- — Victor Oladipo entered a game for the first time in nearly a year, a loud ovation greeting him as he stepped onto the floor."}
{"game_id": "0022100970", "chunk_id": "0022100970_002", "order": 2, "role": "body", "text": "He took a charge seconds later. The cheers got louder."}
{"game_id": "0022100970", "chunk_id": "0022100970_003", "order": 3, "role": "body", "text": "And when he capped his night with a dunk, even louder."}
{"game_id": "0022100970", "chunk_id": "0022100970_004", "order": 4, "role": "body", "text": "Welcome back, indeed. Oladipo scored 11 points in just under 15 minutes of action, Tyler Herro came off the bench to score 21 of his game-high 31 points in the second quarter and the Eastern Conference-leading Miami Heat beat the Houston Rockets 123-106 on Monday night."}
{"game_id": "0022100970", "chunk_id": "0022100970_005", "order": 5, "role": "body", "text": "“At the end of the day, I’m a winner,” Oladipo said. “And this team is all about winning.”"}
{"game_id": "0022100970", "chunk_id": "0022100970_006", "order": 6, "role": "body", "text": "Oladipo was playing his first game since April 8 following a second surgery to repair a right quadriceps tendon. He took a charge on his first defensive possession, hitting the deck without any signs of problems."}
{"game_id": "0022100970", "chunk_id": "0022100970_007", "order": 7, "role": "body", "text": "Jimmy Butler scored 21 points for Miami, which got Kyle Lowry back after a four-game absence for personal reasons. Bam Adebayo finished with 18 points and 10 rebounds for the Heat, who had a quick celebration for Oladipo in the postgame locker room."}
{"game_id": "0022100970", "chunk_id": "0022100970_008", "order": 8, "role": "body", "text": "“That was very uplifting for everybody,\" Heat coach Erik Spoelstra said."}
{"game_id": "0022100970", "chunk_id": "0022100970_009", "order": 9, "role": "body", "text": "Kevin Porter Jr. scored 22 points for Houston, which got 20 from Jalen Green, 16 from Josh Christopher and 14 from KJ Martin. Green was 4 for 4 from 3-point range in the game’s first 5:40, then missed his final six tries from beyond the arc."}
{"game_id": "0022100970", "chunk_id": "0022100970_010", "order": 10, "role": "body", "text": "Alperen Sengun had 13 points and eight rebounds, getting the start at center for Houston because Christian Wood was ill. It was just the sixth start this season for the 19-year-old from Turkey."}
{"game_id": "0022100970", "chunk_id": "0022100970_011", "order": 11, "role": "body", "text": "“We are almost to the end of the season,\" Sengun said. “I'm playing more comfortable and I've learned a lot.\""}
{"game_id": "0022100970", "chunk_id": "0022100970_012", "order": 12, "role": "body", "text": "The Heat trailed by 13 late in the first half before Herro scored 15 points in a 23-6 run over the final 4:35 before intermission. Butler had the other eight points in that run for the Heat, a burst capped by Herro making a 3-pointer with 29 seconds left and then a 36-footer just before the buzzer."}
{"game_id": "0022100970", "chunk_id": "0022100970_013", "order": 13, "role": "body", "text": "“Just trying to come in and impact the game,\" said Herro, the likely frontrunner for the NBA's sixth man of the year award. “The second quarter was fun.\""}
{"game_id": "0022100970", "chunk_id": "0022100970_014", "order": 14, "role": "body", "text": "But the story was Oladipo, who was 4 for 7 from the field, 2 for 3 from 3-point range, plus had four assists against his former team. He was with the Rockets briefly last season, before getting traded to Miami and playing in just four games before being shut down for a second surgery on the leg he originally injured in 2019."}
{"game_id": "0022100970", "chunk_id": "0022100970_015", "order": 15, "role": "body", "text": "“Everybody is really encouraging him,\" Spoelstra said. “They've seen him behind the scenes, really working and grinding.\""}
{"game_id": "0022100970", "chunk_id": "0022100970_016", "order": 16, "role": "body", "text": "Rockets coach Stephen Silas had Oladipo in Houston last season and said he enjoyed their 20 games together."}
{"game_id": "0022100970", "chunk_id": "0022100970_017", "order": 17, "role": "body", "text": "“He’s competitive. He wants to do things the right way. He is a fighter. For him to fight through all of the injuries that he’s had and manage the ups and downs and the emotional part of what he’s been through is admirable,” Silas said. “And he’s just a great guy, a really good person to kind of sit down and talk to.”"}
{"game_id": "0022100970", "chunk_id": "0022100970_018", "order": 18, "role": "body", "text": "Oladipo had missed each of Miami’s last 89 games, including last season’s playoff appearance. He missed 201 games since the initial injury three years ago, sidelined for a year following the first surgery and more 11 months this time after the second surgery."}
{"game_id": "0022100970", "chunk_id": "0022100970_020", "order": 20, "role": "body", "text": "“Just to see him out there, it’s crazy,” Heat forward P.J. Tucker said. “It’s unbelievable. It’s pretty cool.”"}
{"game_id": "0022100970", "chunk_id": "0022100970_022", "order": 22, "role": "body", "text": "Rockets: PG John Wall, who missed his 77th consecutive game dating back to last season, was in attendance. ... An off-court item that the Rockets pointed to as a positive came a few nights ago, when Wood rented out a movie theater to take teammates to see “The Batman,” which was released Friday. “That’s growth from Christian to do that. ... We’ve had a lot of cool moments,” Silas said."}
{"game_id": "0022100970", "chunk_id": "0022100970_023", "order": 23, "role": "body", "text": "Heat: The Heat outrebounded Houston 50-33. ... Miami had more than just Oladipo playing with ties to Houston. Lowry and Tucker — who had 11 points and 12 rebounds — both spent parts of four seasons with the Rockets and Butler is a Houston-area native. ... Lowry was scoreless, missing all three of his shots. ... Gabe Vincent and Max Strus were out of the regular rotation with Lowry and Oladipo playing. “Guys understand the opportunity with this group. ... We're going to need everybody,\" Spoelstra said."}
{"game_id": "0022100970", "chunk_id": "0022100970_025", "order": 25, "role": "body", "text": "At 44-22, Miami is 22 games over the .500 mark for the first time since the end of the 2013-14 season. The Heat remained three games ahead of Philadelphia in the East standings; the 76ers beat Chicago on Monday night."}
{"game_id": "0022100970", "chunk_id": "0022100970_027", "order": 27, "role": "body", "text": "Rockets guard Dennis Schröder missed his fourth consecutive game with a sprained right ankle. “He’s been able to do his rehab. He’s been on the floor for a couple of days. He’s just trying to get to 100%,” Silas said."}
{"game_id": "0022100970", "chunk_id": "0022100970_029", "order": 29, "role": "body", "text": "Rockets: Host the L.A. Lakers on Wednesday."}
{"game_id": "0022100970", "chunk_id": "0022100970_030", "order": 30, "role": "body", "text": "Heat: Host Phoenix on Wednesday."}
