{"game_id": "0022100722", "chunk_id": "0022100722_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — The Cleveland Cavaliers are legit, and the defending NBA champions now know it, too."}
{"game_id": "0022100722", "chunk_id": "0022100722_002", "order": 2, "role": "body", "text": "Kevin Love scored 25 points, Cedi Osman added 23 and the Cavs pulled off their most impressive win in what's become a turnaround season, 115-99 over the Milwaukee Bucks on Wednesday night."}
{"game_id": "0022100722", "chunk_id": "0022100722_003", "order": 3, "role": "body", "text": "“This is not the Cleveland we knew over the past few years,” Bucks superstar Giannis Antetokounmpo said. “They have a good team and we have to respect them more. They're a playoff team and are fighting for the title themselves.”"}
{"game_id": "0022100722", "chunk_id": "0022100722_004", "order": 4, "role": "body", "text": "A year ago, the Cavs won just 22 games and found themselves in the draft lottery for the third straight season. Not only has Cleveland surpassed its win total already this season, but the Cavs (30-19) are tied for the most wins in the Eastern Conference."}
{"game_id": "0022100722", "chunk_id": "0022100722_005", "order": 5, "role": "body", "text": "“It's who we are,\" Cavs coach J.B. Bickerstaff said when asked about the win's significance. \"We take on all challenges. We don't run from anybody. We don't back down. We give everybody our best shot.\""}
{"game_id": "0022100722", "chunk_id": "0022100722_006", "order": 6, "role": "body", "text": "The Cavs made 19 3-pointers — seven in the second quarter — and won for the eighth time in nine games. They also leap-frogged Milwaukee in the standings, and served notice they've got bigger plans ahead."}
{"game_id": "0022100722", "chunk_id": "0022100722_007", "order": 7, "role": "body", "text": "“We feel if we play hard and stay true to our system, we can beat anybody,” said Love, a five-time All-Star thriving in a reserve role this season. “I just want to bottle up what we have right now and stay hungry.”"}
{"game_id": "0022100722", "chunk_id": "0022100722_008", "order": 8, "role": "body", "text": "Darius Garland scored 19 and rookie Evan Mobley had 16 for the Cavs. Jarrett Allen returned after missing one game with an illness and had 10 points and 10 rebounds."}
{"game_id": "0022100722", "chunk_id": "0022100722_009", "order": 9, "role": "body", "text": "Antetokounmpo scored 26 points after missing a game with knee soreness, but had seven of Milwaukee's 19 turnovers that led to 31 points for Cleveland. Bobby Portis added 22 points and Khris Middleton 21 for the Bucks, who had their winning streak stopped at three."}
{"game_id": "0022100722", "chunk_id": "0022100722_010", "order": 10, "role": "body", "text": "Milwaukee has lost a season-high four straight on the road, and the trouble really started in the third period."}
{"game_id": "0022100722", "chunk_id": "0022100722_011", "order": 11, "role": "body", "text": "Cleveland regrouped after a slow start, tightened its perimeter defense and built an eight-point halftime lead. The Cavs then opened the second half with an 11-2 run that included three 3-pointers in a 48-second span by Garland, Mobley and Dean Wade."}
{"game_id": "0022100722", "chunk_id": "0022100722_012", "order": 12, "role": "body", "text": "The Cavs pushed their lead to 93-72 before Garland went out briefly with back tightness. The young point guard seemed to land awkwardly after making a reverse layup and went to the locker room for treatment before returning. Bickerstaff said Garland is OK."}
{"game_id": "0022100722", "chunk_id": "0022100722_013", "order": 13, "role": "body", "text": "“They played lights out tonight,” Bucks coach Mike Budenholzer said. \"I don’t know what the right analogy is, but they played really well. They beat us pretty good. Live ball turnovers is when transition defense is the toughest, and we made a lot of them.”"}
{"game_id": "0022100722", "chunk_id": "0022100722_014", "order": 14, "role": "body", "text": "Before the game, Bickerstaff figured 3-pointers would be the key because of Milwaukee's preference to shoot them — and give them up."}
{"game_id": "0022100722", "chunk_id": "0022100722_015", "order": 15, "role": "body", "text": "After the Bucks made six 3s in the first quarter, the Cavs did them one better with seven in the second to take a 65-57 lead at the half."}
{"game_id": "0022100722", "chunk_id": "0022100722_016", "order": 16, "role": "body", "text": "While the outside shooting was impressive, Mobley had the most memorable bucket in the half when Garland slipped him a pass on the baseline and Cleveland's big man dunked over Antetokounmpo."}
{"game_id": "0022100722", "chunk_id": "0022100722_017", "order": 17, "role": "body", "text": "“An incredible play,” Love said. “Those guys are so talented. There's going to be a lot of those plays coming.”"}
{"game_id": "0022100722", "chunk_id": "0022100722_019", "order": 19, "role": "body", "text": "Bucks: Milwaukee started 6 of 7 on 3-pointers but finished just 9 of 32. ... G Wesley Matthews (bruised left knee) missed the game. Budenholzer said Matthews stayed in Milwaukee for treatment. He could return for Friday's game or “shortly after.” ... Budenholzer said he sees the Cavs' confidence growing. “They have a belief,” he said. “You can see it and you can feel it.”"}
{"game_id": "0022100722", "chunk_id": "0022100722_020", "order": 20, "role": "body", "text": "Cavaliers: G Rajon Rondo became the 14th player to reach 7,500 career assists. ... Garland, Isaac Okoro and backup guard Kevin Pangos all share the same Jan. 26 birthday. At shootaround, the team made Mobley sing happy birthday to the trio. “He’s got pretty decent vocals,” Wade said. “I’d like to hear him maybe a touch louder.” ... Lauri Markkanen (ankle) missed his second straight game and is expected to sit out several weeks."}
{"game_id": "0022100722", "chunk_id": "0022100722_022", "order": 22, "role": "body", "text": "Bucks guard Grayson Allen served the one-game league suspension he received for his flagrant-2 foul against Chicago's Alex Caruso, who suffered a fractured right wrist and could miss two months."}
{"game_id": "0022100722", "chunk_id": "0022100722_023", "order": 23, "role": "body", "text": "Allen traveled with the team and participated in the morning shootaround."}
{"game_id": "0022100722", "chunk_id": "0022100722_025", "order": 25, "role": "body", "text": "Bucks: Begin a three-game homestand Friday against New York."}
{"game_id": "0022100722", "chunk_id": "0022100722_026", "order": 26, "role": "body", "text": "Cavaliers: Visit Detroit on Sunday."}
