{"game_id": "0022100049", "chunk_id": "0022100049_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Luke Kennard scored 23 points, tying his career high with six 3-pointers, and Los Angeles ran away early to beat the Portland Trail Blazers 116-86 for the Clippers' first win of the season on Monday night."}
{"game_id": "0022100049", "chunk_id": "0022100049_002", "order": 2, "role": "body", "text": "“If I make two or three in a row, I’m really looking to be aggressive the next shot or two,” Kennard said. “Guys were looking for me, especially in the transition. That’s where I try to sneak around the defense.”"}
{"game_id": "0022100049", "chunk_id": "0022100049_003", "order": 3, "role": "body", "text": "Reggie Jackson added 18 points and Paul George had 16 points to help the Clippers avoid their first 0-3 start since 2010-11, when coach Vinny Del Negro was in his first season."}
{"game_id": "0022100049", "chunk_id": "0022100049_004", "order": 4, "role": "body", "text": "CJ McCollum scored 20 points for the Blazers in their first road game of the season. Damian Lillard's slow start to the season continued. He was held to 12 points on 4 of 15 shooting and missed all eight of his 3-point attempts. Portland shot 38% from the floor and had 15 assists, both lows in the young season. The Clippers' defense never let the Blazers get an extended run going in and forced 30 turnovers."}
{"game_id": "0022100049", "chunk_id": "0022100049_005", "order": 5, "role": "body", "text": "After losing their first two games by a combined eight points, the Clippers got the rout going early. They led by 14 after each of the first two quarters, shooting 49% from the floor in the half. Kennard had 17 points off the bench by halftime, hitting four 3-pointers and connecting on his career-tying sixth 3 to open the fourth."}
{"game_id": "0022100049", "chunk_id": "0022100049_006", "order": 6, "role": "body", "text": "“He got us going in the first half. Our players understand when he's on the floor we've got to look for him,\" Clippers coach Tyronn Lue said. “We know we’re going to play through PG, but on any given night it can be anybody’s night.”"}
{"game_id": "0022100049", "chunk_id": "0022100049_007", "order": 7, "role": "body", "text": "The Blazers' only lead came on Nassir Little's 3-pointer to start the game. Lillard had just eight points in the first half, when Robert Covington and Jusuf Nurkic were held scoreless and combined for nine rebounds."}
{"game_id": "0022100049", "chunk_id": "0022100049_008", "order": 8, "role": "body", "text": "The Clippers extended their lead to 30 points going into the fourth, allowing their starters to rest. The second unit easily maintained the momentum against Portland's reserves in what amounted to a scrimmage that sent the fans to the exits in droves. Terance Mann hit a 3-pointer to push the Clippers into triple digits, 100-65, and finished with 13 points."}
{"game_id": "0022100049", "chunk_id": "0022100049_009", "order": 9, "role": "body", "text": "Zubac and Jackson combined for 13 points as LA outscored the Blazers 27-10 to open the third. Kennard sank his fifth 3-pointer in the spurt."}
{"game_id": "0022100049", "chunk_id": "0022100049_010", "order": 10, "role": "body", "text": "“We had 37 assists but we should have had 50,” Lue said. “We had 15 shots that were wide-open that we didn’t make.”"}
{"game_id": "0022100049", "chunk_id": "0022100049_012", "order": 12, "role": "body", "text": "Ivica Zubac scored down low and got poked in the eye by Cody Zeller in the second quarter. The Clippers received a delay of game warning when Zubac was slow to get up, but he stayed in the game. About a minute later, Zeller got hit on his chin at the Blazers' end when he and Zubac tangled going for the ball. Zeller held a towel to his mouth as he left the court. He returned in the fourth. He's already wearing a plastic mask to protect a broken nose suffered in the preseason."}
{"game_id": "0022100049", "chunk_id": "0022100049_014", "order": 14, "role": "body", "text": "Trail Blazers: F Norman Powell (left patellar tendinopathy) and G-F Tony Snell (right foot sprain) sat out. ... Little replaced Powell in the starting lineup and finished with 10 points. He made two starts while playing in 48 games last season. ... Portland plays the Clippers three times in their first 11 games. ... Chauncey Billups was applauded when he was welcomed back before the game. He played for the team from 2011-13, and was a Clippers assistant last season before being hired to run the Blazers in June."}
{"game_id": "0022100049", "chunk_id": "0022100049_015", "order": 15, "role": "body", "text": "Clippers: Los Angeles was outrebounded 47-43, about the only category in which they were worse than Portland. ... They've won seven in a row overall and five straight at home against the Blazers."}
{"game_id": "0022100049", "chunk_id": "0022100049_017", "order": 17, "role": "body", "text": "Trail Blazers: Host Memphis on Wednesday."}
{"game_id": "0022100049", "chunk_id": "0022100049_018", "order": 18, "role": "body", "text": "Clippers: Host Cleveland on Wednesday."}
