{"game_id": "0022100246", "chunk_id": "0022100246_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — Damian Lillard scored a season-high 39 points to help the Portland Trail Blazers beat the Philadelphia 76ers 118-111 on Saturday night."}
{"game_id": "0022100246", "chunk_id": "0022100246_002", "order": 2, "role": "body", "text": "The All-Star guard, fighting his way out of a slump early in the season, was 10 for 21 from the field and made all 14 free throws."}
{"game_id": "0022100246", "chunk_id": "0022100246_003", "order": 3, "role": "body", "text": "“He earned every single one of those 14 free throws tonight,” Blazers coach Chauncey Billups said. “I think this is more what people are accustomed to seeing when he attacks, him getting double-figure free throws.”"}
{"game_id": "0022100246", "chunk_id": "0022100246_004", "order": 4, "role": "body", "text": "Lillard struggled with his shot to start the season, shooting career-lows across the board. But the six-time All-Star believes he is starting to round into form on the offensive end."}
{"game_id": "0022100246", "chunk_id": "0022100246_005", "order": 5, "role": "body", "text": "“I said it after we played Philly (Nov. 1): These moments give you an opportunity to rise. It shows your true character, whether you can deal with hard times and criticism,” Lillard said. “The last five or six games, I’m starting to feel better and better. I still don’t feel completely in form but I’m getting there.”"}
{"game_id": "0022100246", "chunk_id": "0022100246_006", "order": 6, "role": "body", "text": "CJ McCollum added 18 points, Norman Powell had 17, and Jusuf Nurkic finished with 11 points and 11 rebounds. Portland improved to 8-1 at home and, at 9-8, is above .500 for the first time since Oct. 31."}
{"game_id": "0022100246", "chunk_id": "0022100246_007", "order": 7, "role": "body", "text": "The Blazers closed the game with Larry Nance Jr. in place of Nurkic for the third straight game. After being subbed out for Nance with 4:23 remaining after committing two fouls seconds apart, Nurkic threw his mouthguard on the floor in frustration before Lillard spoke to him on the bench."}
{"game_id": "0022100246", "chunk_id": "0022100246_008", "order": 8, "role": "body", "text": "“Any time you get subbed out of the game late, there’s going to be frustration,” Lillard said. “It’s happened a few times over this homestand if teams go small. I told him, ‘I understand why you’re upset.’ I would be more curious if he wasn’t upset. But I told him on both of those fouls that he got, if his man turns the corner, it’s my job to be the help. He’s got to trust that the low man is going to be there.”"}
{"game_id": "0022100246", "chunk_id": "0022100246_009", "order": 9, "role": "body", "text": "Said Billups: “If the big picks up two quick fouls, they’re going to keep going to that, so I went back to Larry so we can switch 1 through 5. At the end of the day, I’m just trying to get the win however we can get it.”"}
{"game_id": "0022100246", "chunk_id": "0022100246_010", "order": 10, "role": "body", "text": "Tobias Harris and Tyrese Maxey each scored 28 points for Philadelphia. Joel Embiid missed his seventh straight game after entering the NBA’s COVID-19 health and safety protocols."}
{"game_id": "0022100246", "chunk_id": "0022100246_011", "order": 11, "role": "body", "text": "Harris’ layup cut the Blazers’ lead to 97-95 at the 6:18 mark, but that was the closest the 76ers would get in the second half."}
{"game_id": "0022100246", "chunk_id": "0022100246_013", "order": 13, "role": "body", "text": "76ers: Philadelphia also was without Danny Green (left hamstring). And there’s been no resolution with Ben Simmons (personal reasons), who has asked to be traded."}
{"game_id": "0022100246", "chunk_id": "0022100246_014", "order": 14, "role": "body", "text": "Trail Blazers: Billups said he wants Lillard to be as comfortable as possible playing through his abdominal injury. After sitting out last Sunday against Denver, Lillard has played in the next three games, despite being deemed a game-time decision Saturday. “It sucks to play hurt man,” Billups said. “You can’t do a lot of the things that you’re accustomed to. But people will still play you like you’re 12 for 12 in the game.”"}
{"game_id": "0022100246", "chunk_id": "0022100246_016", "order": 16, "role": "body", "text": "76ers: At Sacramento on Monday night."}
{"game_id": "0022100246", "chunk_id": "0022100246_017", "order": 17, "role": "closing", "text": "Trail Blazers: Host Denver on Tuesday night."}
