{"game_id": "0022100718", "chunk_id": "0022100718_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Anthony Davis' knee looked fine leaping high to slam down a lob pass from LeBron James on the game's first possession."}
{"game_id": "0022100718", "chunk_id": "0022100718_002", "order": 2, "role": "body", "text": "And he looked healthy jumping into his teammate in celebration after James' two steals and dunks in the fourth quarter punctuated his performance."}
{"game_id": "0022100718", "chunk_id": "0022100718_004", "order": 4, "role": "body", "text": "James scored 33 points and the Los Angeles Lakers welcomed Davis back with a 106-96 victory over the Brooklyn Nets on Tuesday night."}
{"game_id": "0022100718", "chunk_id": "0022100718_005", "order": 5, "role": "body", "text": "Davis had eight points in 25 minutes after missing 17 games with a sprained left knee and the Lakers got good nights off the bench from Malik Monk and Carmelo Anthony."}
{"game_id": "0022100718", "chunk_id": "0022100718_006", "order": 6, "role": "body", "text": "James added seven rebounds and six assists, highlighting his night with steals and dunks about 15 seconds apart midway through the fourth quarter in front of a roaring road crowd that didn't have most of its own stars to cheer."}
{"game_id": "0022100718", "chunk_id": "0022100718_007", "order": 7, "role": "body", "text": "Davis ran onto the court during the ensuing timeout and jumped into James, showing no fear while knocking his 6-foot-8, 250-pound teammate backward."}
{"game_id": "0022100718", "chunk_id": "0022100718_008", "order": 8, "role": "body", "text": "“Can't think about it. When I’m on the floor I try not to think about it,” Davis said. “I was what, a month, five weeks, doing a lot of weightlifting. So I hit him, he kind of like fell over. I was more worried for him than my knee.”"}
{"game_id": "0022100718", "chunk_id": "0022100718_009", "order": 9, "role": "body", "text": "Monk scored 22 points, hitting six 3-pointers, and Anthony added 13."}
{"game_id": "0022100718", "chunk_id": "0022100718_010", "order": 10, "role": "body", "text": "James Harden had 33 points, 12 rebounds and 11 assists in an impressive follow-up to his strong game in Los Angeles when the Nets won there on Christmas. But with Kevin Durant still out with a sprained left knee ligament and the unvaccinated Kyrie Irving unavailable again now that the Nets are back from their four-game road trip, the Nets couldn't match the Lakers on one of their good nights in an uneven season."}
{"game_id": "0022100718", "chunk_id": "0022100718_011", "order": 11, "role": "body", "text": "Afterward, Harden was asked about a Bleacher Report story detailing reasons that he is frustrated in Brooklyn."}
{"game_id": "0022100718", "chunk_id": "0022100718_012", "order": 12, "role": "body", "text": "“Listen, I don’t know about any reports,” Harden said. “Of course I’m frustrated because we’re not healthy, there’s a lot of inconsistency for whatever reason. Injuries, COVID, whatever you want to call it, so yeah, it is frustrating. I think everyone in this organization is frustrated because we are better than our record is and we should be on the way up. So that’s all it is.”"}
{"game_id": "0022100718", "chunk_id": "0022100718_013", "order": 13, "role": "body", "text": "Davis looked in sync right away, throwing down a lob pass from James on the first possession of the game. He also blocked three shots in the first quarter, which ended with the Lakers leading 33-25 on James' basket as time expired."}
{"game_id": "0022100718", "chunk_id": "0022100718_014", "order": 14, "role": "body", "text": "“Obviously right away you see what he’s capable of,” James said. “We draw a play right to start the game, I was able to turn the corner and threw a late lob that he was still able to throw home. So very exciting to have him back.”"}
{"game_id": "0022100718", "chunk_id": "0022100718_015", "order": 15, "role": "body", "text": "James opened the second quarter with a three-point play to push the lead to 11, and the Lakers would lead by as much as 14 before taking a 62-53 lead to halftime."}
{"game_id": "0022100718", "chunk_id": "0022100718_016", "order": 16, "role": "body", "text": "The Nets got within two midway through the third, but James made two straight jumpers, Monk hit a 3-pointer and James fired a pass to a cutting Russell Westbrook that led to a three-point play that capped a quick 10-2 spurt and restored the double-digit lead at 81-71. It wasn't close again."}
{"game_id": "0022100718", "chunk_id": "0022100718_018", "order": 18, "role": "body", "text": "Lakers: Westbrook scored 15 points. ... Monk had 16 points in the first half."}
{"game_id": "0022100718", "chunk_id": "0022100718_019", "order": 19, "role": "body", "text": "Nets: Harden became the 32nd player to reach 23,000 points. The four active ones were all on the rosters of these teams: James, Anthony and Durant are ahead of him. ... Center Nic Claxton returned after missing seven games with left hamstring tightness. He had six points and seven rebounds in 17 minutes."}
{"game_id": "0022100718", "chunk_id": "0022100718_021", "order": 21, "role": "body", "text": "Coach Frank Vogel said the Lakers expected Davis to have stretches where he was out of sync or rhythm, because he would be playing his way into shape in games without enough opportunities to do it during full 5-on-5 workout situations."}
{"game_id": "0022100718", "chunk_id": "0022100718_022", "order": 22, "role": "body", "text": "“With limited practice time, we are still viewing these first few games as not out of the woods yet,” Vogel said. “This is going to be his reconditioning phase.\""}
{"game_id": "0022100718", "chunk_id": "0022100718_024", "order": 24, "role": "body", "text": "Coach Steve Nash said he hadn't spoken to Harden about any of Harden's concerns that were reported in the Bleacher Report story Tuesday looking at his free agency after the season. The story said Harden was frustrated with Irving's part-time status and by Nash's playing rotations. Nash said they didn't seem like things Harden would say."}
{"game_id": "0022100718", "chunk_id": "0022100718_025", "order": 25, "role": "body", "text": "“So I’m not sure what to believe,” Nash said. “James and I speak all the time and I think we have a great relationship, so I’m not sure the validity of these comments to be honest with you.”"}
{"game_id": "0022100718", "chunk_id": "0022100718_027", "order": 27, "role": "body", "text": "Lakers: Visit Philadelphia on Thursday."}
{"game_id": "0022100718", "chunk_id": "0022100718_028", "order": 28, "role": "closing", "text": "Nets: Host Denver on Wednesday."}
