{"game_id": "0022100810", "chunk_id": "0022100810_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — The Toronto Raptors keep on rolling, and the Charlotte Hornets keep on floundering."}
{"game_id": "0022100810", "chunk_id": "0022100810_002", "order": 2, "role": "body", "text": "Pascal Siakam had 24 points, 11 rebounds and eight assists, and the Raptors defeated the Hornets 116-101 on Monday night for their sixth straight win."}
{"game_id": "0022100810", "chunk_id": "0022100810_003", "order": 3, "role": "body", "text": "Gary Trent Jr. scored 24 points, and Fred VanVleet and OG Anunoby each had 20 points for the Raptors, who began a stretch of eight of nine games on the road with a convincing win. Scottie Barnes added 15 points as the Raptors' starters accounted for all but 13 points."}
{"game_id": "0022100810", "chunk_id": "0022100810_004", "order": 4, "role": "body", "text": "Siakam, the NBA’s Eastern Conference Player of the Week, set the tone in the first half, shooting 6 of 9 from the floor for 14 points with six rebounds and five assists as the Raptors opened a 23-point lead."}
{"game_id": "0022100810", "chunk_id": "0022100810_005", "order": 5, "role": "body", "text": "“It has been a rough couple of years, but I feel healthy right now,” Siakam said. “My shoulder is feeling better, my body is feeling good. So just physically and mentally being in a good place.”"}
{"game_id": "0022100810", "chunk_id": "0022100810_006", "order": 6, "role": "body", "text": "Miles Bridges scored 25 points to lead the Hornets, who lost their fifth consecutive game. Charlotte struggled through yet another poor offensive performance, shooting 41.1% from the field and 22.5% from 3-point range."}
{"game_id": "0022100810", "chunk_id": "0022100810_007", "order": 7, "role": "body", "text": "LaMelo Ball, named as an All-Star game replacement a few hours before the game, finished with 15 points and nine assists for the Hornets."}
{"game_id": "0022100810", "chunk_id": "0022100810_008", "order": 8, "role": "body", "text": "Charlotte (28-27) did battle back to cut the lead to three in the third quarter after getting a big boost from Terry Rozier, who had 20 points, and P.J. Washington. But the Hornets ran out of firepower as their poor outside shooting caught up with them."}
{"game_id": "0022100810", "chunk_id": "0022100810_009", "order": 9, "role": "body", "text": "“We just have to start finding that rhythm offensively,” Hornets coach James Borrego said. “The 3-ball has dried up obviously, but that is okay. It will come back to us. Until then we have to find our offense through our defense.”"}
{"game_id": "0022100810", "chunk_id": "0022100810_010", "order": 10, "role": "body", "text": "The win moved the Raptors (29-23) into sixth place in the Eastern Conference, ahead of the slumping Brooklyn Nets, who have lost eight straight."}
{"game_id": "0022100810", "chunk_id": "0022100810_011", "order": 11, "role": "body", "text": "Siakam is a big reason for the Raptors' surge."}
{"game_id": "0022100810", "chunk_id": "0022100810_012", "order": 12, "role": "body", "text": "He said he's enjoyed playing some point guard because it's given him a different understanding of the game, and also has helped him to develop a rhythm. And recently, he's brought back what coach Nick Nurse called his “signature spin move.”"}
{"game_id": "0022100810", "chunk_id": "0022100810_013", "order": 13, "role": "body", "text": "“For a while there it just seemed like it didn’t seem to be a go-to move for him anymore,” Nurse said. “I think a lot of it now has to do with mindset, energy and the spacing on the floor.”"}
{"game_id": "0022100810", "chunk_id": "0022100810_014", "order": 14, "role": "body", "text": "That included one in the second quarter when Siakam took Bridges off the dribble and found himself at the basket in a flash for an easy, uncontested score."}
{"game_id": "0022100810", "chunk_id": "0022100810_015", "order": 15, "role": "body", "text": "“There are some games where I know the spin move is going to be there, and some games it won’t,” Siakam said."}
{"game_id": "0022100810", "chunk_id": "0022100810_016", "order": 16, "role": "body", "text": "Charlotte struggled throughout with the Raptors’ length, turning the ball over nine times in the first half, leading to 14 Toronto points."}
{"game_id": "0022100810", "chunk_id": "0022100810_018", "order": 18, "role": "body", "text": "The struggling Hornets, who were without Cody Martin and James Bouknight due to injuries, lost Gordon Hayward for the game after he sprained his left ankle in the first quarter."}
{"game_id": "0022100810", "chunk_id": "0022100810_019", "order": 19, "role": "body", "text": "Hayward had struggled since he missed six games while in COVID-19 protocols, making just 3 of 23 shots from the field. But, coach James Borrego was counting on him to help a young team break out of a slump."}
{"game_id": "0022100810", "chunk_id": "0022100810_021", "order": 21, "role": "body", "text": "Bouknight was listed as out with a sprained wrist just two days after he stood up and confronted Borrego on the bench — and was later escorted to the locker room by an assistant coach. Borrego downplayed the incident before the game, saying that \"we're in a good place” with Bouknight."}
{"game_id": "0022100810", "chunk_id": "0022100810_023", "order": 23, "role": "body", "text": "Toronto entered the game averaging 118 points during their five-game winning streak, and didn’t miss a beat against the Hornets. It marked the 10th straight game the Raptors have scored at least 100 points."}
{"game_id": "0022100810", "chunk_id": "0022100810_025", "order": 25, "role": "body", "text": "Raptors: Shot 42.9% (15 of 35) from 3-point range. ... Made just 19 of 29 free throws."}
{"game_id": "0022100810", "chunk_id": "0022100810_026", "order": 26, "role": "body", "text": "Hornets: Outscored the Raptors 58-48 in the paint. ... Kelly Oubre was 0 for 8 from long distance, but had 17 points. ... Fell to 0-3 on their four-game homestand."}
{"game_id": "0022100810", "chunk_id": "0022100810_028", "order": 28, "role": "body", "text": "Raptors: At Oklahoma City on Wednesday night."}
{"game_id": "0022100810", "chunk_id": "0022100810_029", "order": 29, "role": "body", "text": "Hornets: Host Bulls on Wednesday night."}
