{"game_id": "0022100408", "chunk_id": "0022100408_001", "order": 1, "role": "lead", "text": "BOSTON -- — Jayson Tatum scored 16 of his 42 points in the fourth quarter and the Boston Celtics beat the Milwaukee Bucks 117-103 on Monday night."}
{"game_id": "0022100408", "chunk_id": "0022100408_002", "order": 2, "role": "body", "text": "Jaylen Brown returned to the lineup after missing five games with a tight right hamstring and scored 19 points for Boston. Grant Williams had 17 points, and Robert Williams III and Al Horford each scored 10."}
{"game_id": "0022100408", "chunk_id": "0022100408_003", "order": 3, "role": "body", "text": "Giannis Antetokounmpo had 20 points, eight rebounds and three assists for Milwaukee a day after posting his 26th career triple-double in a victory over the New York Knicks at Madison Square Garden."}
{"game_id": "0022100408", "chunk_id": "0022100408_004", "order": 4, "role": "body", "text": "Jrue Holiday also had 20 points for the Bucks, who lost for just the third time in 15 games. Khris Middleton exited with a hyperextended left knee late in the third quarter."}
{"game_id": "0022100408", "chunk_id": "0022100408_005", "order": 5, "role": "body", "text": "The Celtics were coming off a 1-4 West Coast trip, and coach Ime Udoka showed his team film of opponents going down the lane easily."}
{"game_id": "0022100408", "chunk_id": "0022100408_006", "order": 6, "role": "body", "text": "“We've been talking about who we want to be and just showed them,” he said."}
{"game_id": "0022100408", "chunk_id": "0022100408_007", "order": 7, "role": "body", "text": "“I had an animated film session of that trip,\" Udoka added. \"We didn't like that feeling and got back to who we are.”"}
{"game_id": "0022100408", "chunk_id": "0022100408_008", "order": 8, "role": "body", "text": "The Bucks had sliced Boston’s lead to 95-86 midway through the final quarter before Tatum had a twisting drive for a basket and followed that with a 3-pointer from the right wing, giving the Celtics a 100-86 advantage."}
{"game_id": "0022100408", "chunk_id": "0022100408_009", "order": 9, "role": "body", "text": "“You have to give credit to those guys and we weren't at our best,” Bucks coach Mike Budenholzer said. “Whatever the reasons are, we've got to be better.”"}
{"game_id": "0022100408", "chunk_id": "0022100408_010", "order": 10, "role": "body", "text": "Tatum put it away with consecutive 3s from the left corner, making it 114-96 with 2:15 to play."}
{"game_id": "0022100408", "chunk_id": "0022100408_011", "order": 11, "role": "body", "text": "“He had it going,” Holiday said. “He got a couple of wide-open 3s. It was just some rhythm stuff.”"}
{"game_id": "0022100408", "chunk_id": "0022100408_012", "order": 12, "role": "body", "text": "Returning to TD Garden after rough trip, the Celtics started slowly, falling behind by 12 in the first half before turning a one-point halftime lead into a 64-56 advantage with a 13-6 surge to start the second half."}
{"game_id": "0022100408", "chunk_id": "0022100408_013", "order": 13, "role": "body", "text": "“It wasn't time to sugarcoat anything,\" Tatum said of the film meeting. “He showed us. It was open.”"}
{"game_id": "0022100408", "chunk_id": "0022100408_014", "order": 14, "role": "body", "text": "They pushed their lead to 11 after three quarters and made it 90-76 on Dennis Schröder’s 3-pointer just over a minute into the fourth."}
{"game_id": "0022100408", "chunk_id": "0022100408_015", "order": 15, "role": "body", "text": "“On that West Coast trip we were out of our identity,” Grant Williams said. “Tonight it was part of us getting back to our identity as the best defensive team in the league.”"}
{"game_id": "0022100408", "chunk_id": "0022100408_017", "order": 17, "role": "body", "text": "Bucks: Middleton went to the floor awkwardly late in the third period, limped to the locker room and didn’t return. He scored only four points, ending his string of seven straight games with at least 20. … The Bucks were shooting over 60 percent a few minutes into the second quarter but missed 12 of their final 15 shots in the first half. … Antetokounmpo didn’t get his first basket until scoring on a drive early in the second quarter. He had just two baskets in the first half. … Milwaukee is in a stretch of five games in seven days."}
{"game_id": "0022100408", "chunk_id": "0022100408_018", "order": 18, "role": "body", "text": "Celtics: Brown played 30 minutes in his return. “I'm fine,” he said. “I'm grateful that I was able to do that. It felt good moving out there. I didn't care if I missed every shot.” ... G Josh Richardson (protocol) was out. … Grant Williams’ 3 from the left corner gave Boston a 51-50 halftime edge. … Marcus Smart was listed as probable with an illness earlier in the day and played 30 minutes."}
{"game_id": "0022100408", "chunk_id": "0022100408_020", "order": 20, "role": "body", "text": "Grant Williams and Milwaukee’s Bobby Portis got tangled up under the basket and had to be separated late in the third quarter. They each were given a technical."}
{"game_id": "0022100408", "chunk_id": "0022100408_021", "order": 21, "role": "body", "text": "Tatum had words with his teammate, Schröder, in the final quarter."}
{"game_id": "0022100408", "chunk_id": "0022100408_022", "order": 22, "role": "body", "text": "“It’s two passionate players,” Tatum said. “It’s fine. We’ve moved on.”"}
{"game_id": "0022100408", "chunk_id": "0022100408_024", "order": 24, "role": "body", "text": "Boston opened a five-game homestand and plays on the road just twice in its last nine games before New Year’s Day."}
{"game_id": "0022100408", "chunk_id": "0022100408_026", "order": 26, "role": "body", "text": "Bucks: Host the Pacers on Wednesday. Milwaukee won the first two meetings between the teams this season, both in Indiana."}
{"game_id": "0022100408", "chunk_id": "0022100408_027", "order": 27, "role": "body", "text": "Celtics: Host Steph Curry and the Golden State Warriors on Friday."}
