{"game_id": "0022100928", "chunk_id": "0022100928_001", "order": 1, "role": "lead", "text": "TORONTO -- — Scottie Barnes had 18 points and 10 rebounds, Gary Trent Jr. scored 24 and the Toronto Raptors rallied to beat Brooklyn 109-108 on Tuesday night for their second win over the struggling Nets in two days."}
{"game_id": "0022100928", "chunk_id": "0022100928_002", "order": 2, "role": "body", "text": "Pascal Siakam fouled out with 18 points and Malachi Flynn scored 15 for the Raptors, who were coming off a 133-97 victory in Brooklyn on Monday."}
{"game_id": "0022100928", "chunk_id": "0022100928_003", "order": 3, "role": "body", "text": "Thaddeus Young and Khem Birch each had 11 points for Toronto. Trent went 9 for 9 at the free-throw line."}
{"game_id": "0022100928", "chunk_id": "0022100928_004", "order": 4, "role": "body", "text": "James Johnson scored 19 points, Seth Curry had 18 and LaMarcus Aldridge added 16 for the Nets. Cam Thomas had 11 and Goran Dragic scored 10."}
{"game_id": "0022100928", "chunk_id": "0022100928_005", "order": 5, "role": "body", "text": "“We should have won,” Aldridge said."}
{"game_id": "0022100928", "chunk_id": "0022100928_006", "order": 6, "role": "body", "text": "Instead, eighth-place Brooklyn split its season series with Toronto and lost ground to the Raptors, who are three games ahead in seventh place in the Eastern Conference."}
{"game_id": "0022100928", "chunk_id": "0022100928_007", "order": 7, "role": "body", "text": "“Obviously, everybody knows the situation we’re in,” Johnson said. “But the guys in the locker room, we understand it a little bit different. We understand where we’re at, we understand how close we really are to becoming what we want to become this year.”"}
{"game_id": "0022100928", "chunk_id": "0022100928_008", "order": 8, "role": "body", "text": "The Nets played again without Kevin Durant, who is expected to return Thursday against Miami after being out since Jan. 15 because of ​​a sprained left knee ligament."}
{"game_id": "0022100928", "chunk_id": "0022100928_009", "order": 9, "role": "body", "text": "Kyrie Irving, Ben Simmons and Joe Harris were all out for the Nets, while center Andre Drummond sat because of a sore left knee. Drummond’s injury is not considered serious, assistant coach Jacque Vaughn said."}
{"game_id": "0022100928", "chunk_id": "0022100928_010", "order": 10, "role": "body", "text": "Filling in for head coach Steve Nash (health and safety protocols) for the second straight game, Vaughn said the Nets have a “sense of urgency” about the 19-game test that remains to secure a play-in berth or better."}
{"game_id": "0022100928", "chunk_id": "0022100928_011", "order": 11, "role": "body", "text": "“We talked about it before the game, we talked about it after the game, we’ll talk about it when we get back home,” Vaughn said. “There is an urgency. It has to be with this group. They have to feel it, they have to sense it and embrace it.”"}
{"game_id": "0022100928", "chunk_id": "0022100928_012", "order": 12, "role": "body", "text": "Aldridge said he’s not concerned with how teams around the Nets perform in the final weeks of the season."}
{"game_id": "0022100928", "chunk_id": "0022100928_013", "order": 13, "role": "body", "text": "“I’m not watching the standings,” he said. “I think it’s more about us. We’ve got to start taking care of business.”"}
{"game_id": "0022100928", "chunk_id": "0022100928_014", "order": 14, "role": "body", "text": "Brooklyn led 96-90 after Aldridge scored with 5:25 left, but Toronto reclaimed the lead with a 10-0 run."}
{"game_id": "0022100928", "chunk_id": "0022100928_015", "order": 15, "role": "body", "text": "Curry’s 3-pointer with 50 seconds remaining tied it at 103, but he fouled Trent at the other end and the Toronto guard broke the tie by making a pair of free throws with 30 seconds to go."}
{"game_id": "0022100928", "chunk_id": "0022100928_016", "order": 16, "role": "body", "text": "Barnes blocked Curry’s shot out of bounds, and Curry missed another attempt before Barnes grabbed the rebound. Trent sealed it by making four more free throws in the final 18 seconds."}
{"game_id": "0022100928", "chunk_id": "0022100928_017", "order": 17, "role": "body", "text": "Johnson’s buzzer-beating 3 wasn’t enough for the Nets, who have lost four of five."}
{"game_id": "0022100928", "chunk_id": "0022100928_018", "order": 18, "role": "body", "text": "“We all know who we have coming back, and we all know what we have to do to help,” Johnson said."}
{"game_id": "0022100928", "chunk_id": "0022100928_019", "order": 19, "role": "body", "text": "For the first time since Dec. 13, the Raptors played a home game without any capacity limits on fan attendance. Toronto played a handful of December games at 50% capacity, but games since Dec. 31 had either been played before no fans, or small crowds of a few hundred people. Tuesday’s game drew 18,903, about 900 short of a sellout."}
{"game_id": "0022100928", "chunk_id": "0022100928_020", "order": 20, "role": "body", "text": "“It was amazing,” Trent said. “They were loud, they were into it. We need all of that.”"}
{"game_id": "0022100928", "chunk_id": "0022100928_021", "order": 21, "role": "body", "text": "Before tipoff, the Raptors honored first-time All-Star Fred VanVleet with a brief ceremony at center court. VanVleet sat for the third time in five games because of a sore right knee. He also missed Monday’s win."}
{"game_id": "0022100928", "chunk_id": "0022100928_022", "order": 22, "role": "body", "text": "The crowd was much less welcoming to Dragic. The veteran guard began his season with the Raptors but left the team for personal reasons and was later traded to San Antonio. Dragic was booed when he came on in the second quarter, and jeered whenever he touched the ball."}
{"game_id": "0022100928", "chunk_id": "0022100928_023", "order": 23, "role": "body", "text": "“They really had fun doing that, didn’t they?” Raptors coach Nick Nurse said. “They never took their foot off the gas.”"}
{"game_id": "0022100928", "chunk_id": "0022100928_024", "order": 24, "role": "body", "text": "Siakam said he was caught off guard by the chilly reception."}
{"game_id": "0022100928", "chunk_id": "0022100928_025", "order": 25, "role": "body", "text": "“I was surprised,” Siakam said. “I like Goran.”"}
{"game_id": "0022100928", "chunk_id": "0022100928_026", "order": 26, "role": "body", "text": "Brooklyn led 59-55 at halftime. Young’s 3-pointer put the Raptors up 77-75 with 3:18 left in the third, but the Nets closed the quarter with a 14-4 spurt, taking an 89-81 lead to the fourth."}
{"game_id": "0022100928", "chunk_id": "0022100928_028", "order": 28, "role": "body", "text": "Aldridge was left frustrated after twice being called for defensive three seconds less than a minute apart in the final quarter. Trent connected on technical free throws each time."}
{"game_id": "0022100928", "chunk_id": "0022100928_029", "order": 29, "role": "body", "text": "“One was probably legit, and then one wasn’t legit,” Aldridge said."}
{"game_id": "0022100928", "chunk_id": "0022100928_030", "order": 30, "role": "body", "text": "Curry said he’d never before seen two such calls in quick succession at the end of a close game."}
{"game_id": "0022100928", "chunk_id": "0022100928_033", "order": 33, "role": "body", "text": "Neither team scored in the first 3:23 of the fourth quarter, a drought that ended when Trent connected for Toronto."}
{"game_id": "0022100928", "chunk_id": "0022100928_035", "order": 35, "role": "body", "text": "Nets: Vaughn spoke to Nash on Tuesday and said the head coach was in good spirits. Vaughn did not know whether Nash was experiencing any COVID-19 symptoms. … Brooklyn used its 35th starting lineup of the season."}
{"game_id": "0022100928", "chunk_id": "0022100928_036", "order": 36, "role": "body", "text": "Raptors: Nurse said F OG Anunoby won’t need surgery to repair a fractured right ring finger. Anunoby, who saw a specialist Monday, sat for the fourth straight game."}
{"game_id": "0022100928", "chunk_id": "0022100928_038", "order": 38, "role": "body", "text": "Nets: Host the Miami Heat on Thursday night."}
{"game_id": "0022100928", "chunk_id": "0022100928_039", "order": 39, "role": "body", "text": "Raptors: Host the Detroit Pistons on Thursday night."}
