{"game_id": "0022101195", "chunk_id": "0022101195_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — The Los Angeles Clippers got way too comfortable against the NBA-leading Phoenix Suns and it nearly cost them."}
{"game_id": "0022101195", "chunk_id": "0022101195_002", "order": 2, "role": "body", "text": "Leading by 39 points in the third quarter, the Clippers survived an offensive onslaught by Phoenix's bench in the fourth and hung on for a 113-109 victory on Wednesday night."}
{"game_id": "0022101195", "chunk_id": "0022101195_003", "order": 3, "role": "body", "text": "Norman Powell scored 24 points after being out two months and Paul George added 19 points in three quarters to go over 15,000 in his career for the Clippers."}
{"game_id": "0022101195", "chunk_id": "0022101195_004", "order": 4, "role": "body", "text": "“You can never relax in the NBA,” Clippers coach Tyronn Lue said. “The players are too good, the coaches are too good, and as soon as you let your guard down things like this can happen.”"}
{"game_id": "0022101195", "chunk_id": "0022101195_005", "order": 5, "role": "body", "text": "With nothing at stake, Phoenix rested All-Star guards Devin Booker and Chris Paul and fellow starters Deandre Ayton and Jae Crowder on the second night of a back-to-back. The Suns had already set a franchise record for wins in a season with 63 by eliminating the Lakers from playoff contention Tuesday."}
{"game_id": "0022101195", "chunk_id": "0022101195_006", "order": 6, "role": "body", "text": "The Clippers beat up the Suns for three quarters. But Phoenix's reserves put together a 48-point fourth quarter and then ran out of time."}
{"game_id": "0022101195", "chunk_id": "0022101195_007", "order": 7, "role": "body", "text": "“It’s a great lesson for our team and any kid watching, you just play it out,” Suns coach Monty Williams said. “We just stayed with it and had that Suns grit.”"}
{"game_id": "0022101195", "chunk_id": "0022101195_008", "order": 8, "role": "body", "text": "Cameron Payne came back in and hit a 3-pointer that drew the Suns within four with 10 seconds left. Amir Coffey got fouled and made both free throws to preserve the win."}
{"game_id": "0022101195", "chunk_id": "0022101195_009", "order": 9, "role": "body", "text": "Ish Wainwright scored a career-high 20 points to lead Phoenix. Aaron Holiday added 16 points and Bismack Biyombo had 14 points and 12 rebounds. The only starter in double figures was Payne with 13 points. The Suns' bench outscored the Clippers' reserves 66-58."}
{"game_id": "0022101195", "chunk_id": "0022101195_010", "order": 10, "role": "body", "text": "“When you have games like this, you find out who that guy is that you may be able to throw into a big game,” Williams said. “You build that confidence in games like this.”"}
{"game_id": "0022101195", "chunk_id": "0022101195_011", "order": 11, "role": "body", "text": "George and Powell were playing together for the first time this season, but they quickly got in sync to help the Clippers win their third in a row. They are locked into the eighth spot for the Western Conference play-in tournament next week."}
{"game_id": "0022101195", "chunk_id": "0022101195_012", "order": 12, "role": "body", "text": "George has played in five of six games since returning from a torn UCL. Powell is back after missing 21 games with a broken foot. He played in just three games with the team before getting hurt shortly after he was acquired in a trade from Portland."}
{"game_id": "0022101195", "chunk_id": "0022101195_013", "order": 13, "role": "body", "text": "“Playing with PG still didn’t seem real to me,” Powell said. “I looked up to him growing up. Early on in my career he gave me some words of encouragement that stuck with me.”"}
{"game_id": "0022101195", "chunk_id": "0022101195_014", "order": 14, "role": "body", "text": "George scored 10 of his team’s first 14 points to start the game. Powell came in for the first time late in the first quarter and hit a jumper."}
{"game_id": "0022101195", "chunk_id": "0022101195_015", "order": 15, "role": "body", "text": "They started the second quarter together. Powell hit a 3-pointer and a jumper back-to-back, then George found him for another 3-pointer as part of a 22-0 run."}
{"game_id": "0022101195", "chunk_id": "0022101195_016", "order": 16, "role": "body", "text": "“We just tried to play off one another,” George said. “The biggest thing for me was playing off the ball and letting Norm get comfortable. He’s a big-time playmaker and scorer off the ball.”"}
{"game_id": "0022101195", "chunk_id": "0022101195_017", "order": 17, "role": "body", "text": "The Suns’ first points didn’t come until 6:49, when former Clipper Landry Shamet hit a 3-pointer."}
{"game_id": "0022101195", "chunk_id": "0022101195_018", "order": 18, "role": "body", "text": "The Clippers outscored the Suns 34-9 in the second to lead 60-31 going into halftime."}
{"game_id": "0022101195", "chunk_id": "0022101195_019", "order": 19, "role": "body", "text": "Ivica Zubac had 13 points and 11 rebounds for the Clippers."}
{"game_id": "0022101195", "chunk_id": "0022101195_021", "order": 21, "role": "body", "text": "Suns: Their 31 points in the first half were the fewest allowed by the Clippers in a half this season. ... JaVale McGee led a rollicking, expletive-filled huddle in the tunnel before the Suns took the court to warm up. ... The Jenner sisters, Kylie and Kendall, who dates Booker, sat opposite the team bench."}
{"game_id": "0022101195", "chunk_id": "0022101195_022", "order": 22, "role": "body", "text": "Clippers: Split the season series, 2-2. ... A moment of silence was held for Gene Shue, a two-time NBA coach of the year who had two separate stints guiding the Clippers. He died earlier this week at age 90. ... Hall of Famer and Clippers executive Jerry West posed for a photo at halftime with Grammy nominee Saweetie, who sported bright pink hair. ... Hall of Famer Scottie Pippen sat courtside."}
{"game_id": "0022101195", "chunk_id": "0022101195_024", "order": 24, "role": "body", "text": "George reflected on becoming the 16th active player with at least 15,000 career points."}
{"game_id": "0022101195", "chunk_id": "0022101195_025", "order": 25, "role": "body", "text": "“I'm just a kid who came literally from the desert,” he said, referring to his high desert hometown of Palmdale north of Los Angeles. “Every time I touch the floor, especially because of the injuries, I’m always grateful for the opportunity.”"}
{"game_id": "0022101195", "chunk_id": "0022101195_026", "order": 26, "role": "body", "text": "He added, “Hopefully, I crack the 20,000 milestone and the 30,000 milestone.”"}
{"game_id": "0022101195", "chunk_id": "0022101195_029", "order": 29, "role": "body", "text": "Clippers: Host Sacramento on Saturday in the first game of a back-to-back."}
