{"game_id": "0022101028", "chunk_id": "0022101028_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Scottie Barnes scored 15 of his 21 points in the first quarter and the Toronto Raptors held off a late rally by the Los Angeles Lakers for a 114-103 victory Monday night."}
{"game_id": "0022101028", "chunk_id": "0022101028_002", "order": 2, "role": "body", "text": "The Raptors led by 24 in the first as the Lakers were soundly defeated for the second consecutive night."}
{"game_id": "0022101028", "chunk_id": "0022101028_003", "order": 3, "role": "body", "text": "“It was a great, great start,” Toronto coach Nick Nurse said. “And then it was kind of weird from there, but it was good to get off to a good start like that.”"}
{"game_id": "0022101028", "chunk_id": "0022101028_004", "order": 4, "role": "body", "text": "Gary Trent Jr. had 28 points and Pascal Siakam scored 27 for Toronto, which has won four straight — all on the road. Fred VanVleet returned after being held out Saturday at Denver to rest his right knee and finished with 11 points, seven rebounds and seven assists."}
{"game_id": "0022101028", "chunk_id": "0022101028_005", "order": 5, "role": "body", "text": "LeBron James had 30 points and nine rebounds for Los Angeles, which has lost four of five — including 140-111 at Phoenix on Sunday. James was a game-time decision because of soreness in his left knee but ended up playing 40 minutes."}
{"game_id": "0022101028", "chunk_id": "0022101028_006", "order": 6, "role": "body", "text": "The Raptors piled on early against the floundering Lakers, scoring the first nine points on the way to a 33-12 lead after one. Los Angeles was 3 for 25 from the field and missed all 13 of its 3-pointers in the opening quarter. Avery Bradley had four points and was the only Lakers player with more than two in the period."}
{"game_id": "0022101028", "chunk_id": "0022101028_007", "order": 7, "role": "body", "text": "“Especially kind of early on, you get an open shot that everyone pretty much expects you to make it and you don’t make it, it’s kind of frustrating,” Lakers guard Talen Horton-Tucker said."}
{"game_id": "0022101028", "chunk_id": "0022101028_008", "order": 8, "role": "body", "text": "Foul trouble was the only thing that slowed Barnes during an impressive first half. He scored 17 points on 8-of-11 shooting in 18 minutes before sitting down with his third foul."}
{"game_id": "0022101028", "chunk_id": "0022101028_009", "order": 9, "role": "body", "text": "“I really just try to run, get those easy baskets,” Barnes said. “I just came out there and was being aggressive, really just trying to get to my spots.”"}
{"game_id": "0022101028", "chunk_id": "0022101028_010", "order": 10, "role": "body", "text": "Los Angeles mounted a late charge in the fourth quarter, pulling within 109-97 with 2:19 remaining on a 3-pointer by James. Horton-Tucker missed a 3 that would have made the deficit six points, and Siakam and Trent hit free throws to push Toronto’s lead back to 12."}
{"game_id": "0022101028", "chunk_id": "0022101028_011", "order": 11, "role": "body", "text": "“It’s almost like every game we put ourselves in a hole. We just have to kind of play consistent from the start and get on top of teams early,” said Horton-Tucker, who finished with 20 points."}
{"game_id": "0022101028", "chunk_id": "0022101028_013", "order": 13, "role": "body", "text": "Barnes relished his first chance to play against James. However, James sent the rookie ducking for cover when he tried to save a possession while falling out of bounds. Barnes was caught by surprise at the amount of force James was able to generate so quickly and admitted he was glad to have covered his face."}
{"game_id": "0022101028", "chunk_id": "0022101028_014", "order": 14, "role": "body", "text": "“I was like, ‘Damn,’” Barnes said."}
{"game_id": "0022101028", "chunk_id": "0022101028_016", "order": 16, "role": "body", "text": "Raptors: Chris Boucher had 13 points off the bench. … Toronto turned 19 offensive rebounds into 17 second-chance points. … Siakam (11 rebounds) and Precious Achiuwa (10 points, 11 rebounds) each had a double-double."}
{"game_id": "0022101028", "chunk_id": "0022101028_017", "order": 17, "role": "body", "text": "Lakers: Russell Westbrook and Carmelo Anthony each scored 14 points. … Los Angeles F Wenyen Gabriel grabbed a career-high nine rebounds, offering good energy off the bench. … The Lakers have allowed 100 points in 16 straight games. They are 4-12 in that span."}
{"game_id": "0022101028", "chunk_id": "0022101028_019", "order": 19, "role": "body", "text": "Raptors: At the Los Angeles Clippers on Wednesday."}
{"game_id": "0022101028", "chunk_id": "0022101028_020", "order": 20, "role": "body", "text": "Lakers: At the Minnesota Timberwolves on Wednesday."}
