{"game_id": "0022101038", "chunk_id": "0022101038_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Devin Booker scored 36 points, Mikal Bridges added 26 and the NBA-leading Phoenix Suns beat the Houston Rockets 129-112 on Wednesday night for their third straight victory."}
{"game_id": "0022101038", "chunk_id": "0022101038_002", "order": 2, "role": "body", "text": "Booker shot 15 of 24 from the field and scored at least 30 points for the second time in the last three games."}
{"game_id": "0022101038", "chunk_id": "0022101038_003", "order": 3, "role": "body", "text": "“Just getting open shots,” Booker said. “We have a lot of guys who are selfless that make plays for each other. You see what everybody did today looking at the stat sheet. That’s hard for defenses. That wears teams down when everybody is a threat out there. You don’t know who to guard, so I get a free open look. After that, I was just in rhythm.”"}
{"game_id": "0022101038", "chunk_id": "0022101038_004", "order": 4, "role": "body", "text": "Deandre Ayton added 23 points and 11 rebounds, and Torrey Craig — starting in place of the injured Jae Crowder for the short-handed Suns — had 21 points on 8-of-8 shooting and a season-high 14 rebounds."}
{"game_id": "0022101038", "chunk_id": "0022101038_005", "order": 5, "role": "body", "text": "Craig said he found out he was starting when he got to the locker room before the game."}
{"game_id": "0022101038", "chunk_id": "0022101038_006", "order": 6, "role": "body", "text": "“I was just trying to keep it simple,” Craig said. “Just playing basketball. Taking shots that were available. Be aggressive when I could. I was just playing a game. It was nothing I did special to prepare for a game like this. I did what I do normally and went out there and played.”"}
{"game_id": "0022101038", "chunk_id": "0022101038_007", "order": 7, "role": "body", "text": "Also playing without All-Star point guard Chris Paul and sixth-man Cameron Johnson, Phoenix improved to 56-14 and pushed its NBA-best road record to 27-6."}
{"game_id": "0022101038", "chunk_id": "0022101038_008", "order": 8, "role": "body", "text": "“These are the nights that you want to be as positive as you can because we have so many guys out,” Phoenix coach Monty Williams said. “Yet, we have a standard of play that we want to live up to, so we never want to lower that standard."}
{"game_id": "0022101038", "chunk_id": "0022101038_009", "order": 9, "role": "body", "text": "“We talk about playing seven to 10. That’s our scale. Not one to 10. We never want to go below a seven, and in the first half, I thought we were below that tonight. We came out in the third quarter and had a 36-24 quarter. We responded.”"}
{"game_id": "0022101038", "chunk_id": "0022101038_010", "order": 10, "role": "body", "text": "The Rockets are last in the NBA at 17-52."}
{"game_id": "0022101038", "chunk_id": "0022101038_011", "order": 11, "role": "body", "text": "“We were trying to blitz them in the pick-and-rolls, and our blitzes I thought they impacted him some in the first half but not as much in the second half,” Houston coach Stephen Silas said about Booker. “Then, in the second half, he was getting them in all kinds of ways not just pick-and-rolls. … That’s what he does.”"}
{"game_id": "0022101038", "chunk_id": "0022101038_012", "order": 12, "role": "body", "text": "Jalen Green scored 22 points for Houston, Kevin Porter Jr. added 21 points and eight assists and Christian Wood had 18 points and nine rebounds. Dennis Schroder scored 17 points off the bench."}
{"game_id": "0022101038", "chunk_id": "0022101038_013", "order": 13, "role": "body", "text": "The Suns jumped out to a 16-2 lead on a dunk by Craig, but the Rockets responded late in the first with 13 straight points to cut the lead to 33-31 on a 3-pointer by Schroder with a minute left in the quarter."}
{"game_id": "0022101038", "chunk_id": "0022101038_014", "order": 14, "role": "body", "text": "After Houston pulled even at 69, the Suns went on a 15-2 run capped by a 3-pointer by Booker with 4:15 remaining in the third. The Rockets got no closer than eight the rest of the way."}
{"game_id": "0022101038", "chunk_id": "0022101038_016", "order": 16, "role": "body", "text": "Suns: Crowder sat out with a sore left groin. Paul is expected to miss the rest of the regular season because of a right thumb avulsion fracture. Johnson has a right quad contusion. ... Cameron Payne finished with seven points, seven rebounds and 11 assists. … The Suns swept the season series from the Rockets and have won a series-high eight games over the Rockets."}
{"game_id": "0022101038", "chunk_id": "0022101038_017", "order": 17, "role": "body", "text": "Rockets: G Eric Gordon was out of the lineup on Wednesday with a non-COVID-19 illness. … Jae’Sean Tate scored 10 points. … Houston’s bench finished with 38 points led by Schroder and Kenyon Martin Jr, who scored 11 points."}
{"game_id": "0022101038", "chunk_id": "0022101038_018", "order": 18, "role": "body", "text": "“The second unit came in and did a good job,” Silas said. “Dennis played well off the bench. (Alperen Sengun) was good and KJ (Martin) was good. It’s just the energy that we need off the bench that we got tonight. They all did a good job, but as good as they were, it’s just a good team that we played tonight.”"}
{"game_id": "0022101038", "chunk_id": "0022101038_020", "order": 20, "role": "body", "text": "Suns: Hosts Chicago on Friday night."}
{"game_id": "0022101038", "chunk_id": "0022101038_021", "order": 21, "role": "closing", "text": "Rockets: Hosts Indiana on Friday night."}
