{"game_id": "0022100092", "chunk_id": "0022100092_001", "order": 1, "role": "lead", "text": "NEW YORK -- — James Harden had 18 points, 10 rebounds, and 12 assists to power the Brooklyn Nets to a 117-91 rout of the Detroit Pistons on Sunday night."}
{"game_id": "0022100092", "chunk_id": "0022100092_002", "order": 2, "role": "body", "text": "Harden is Brooklyn’s all-time leader with 13 triple-doubles, and joined Larry Bird for second on the NBA’s all-time list with 59."}
{"game_id": "0022100092", "chunk_id": "0022100092_003", "order": 3, "role": "body", "text": "“James was great,” Nets head coach Steve Nash said."}
{"game_id": "0022100092", "chunk_id": "0022100092_004", "order": 4, "role": "body", "text": "And he had help as Kevin Durant scored 23 points before being ejected in the third quarter. Durant became the third player in the Nets’ NBA history to score at least 20 points in the team’s first seven games to start a season. LaMarcus Aldridge added 16 off the bench. De’Andre Bembry contributed 15, and Joe Harris finished with 12."}
{"game_id": "0022100092", "chunk_id": "0022100092_005", "order": 5, "role": "body", "text": "“We've shown some signs of being a really good team,” Harden said. “We're nowhere near where we would like to be.”"}
{"game_id": "0022100092", "chunk_id": "0022100092_006", "order": 6, "role": "body", "text": "Whereas Brooklyn improved to 4-3 with its second straight win, Detroit fell to 1-5 with the loss."}
{"game_id": "0022100092", "chunk_id": "0022100092_007", "order": 7, "role": "body", "text": "“We just didn't play with any activity,” said Cory Joseph, who led the Pistons with 13 points."}
{"game_id": "0022100092", "chunk_id": "0022100092_008", "order": 8, "role": "body", "text": "He later said the Pistons “have to play harder.”"}
{"game_id": "0022100092", "chunk_id": "0022100092_009", "order": 9, "role": "body", "text": "Josh Jackson chipped in with 12, and Jerami Grant had 11."}
{"game_id": "0022100092", "chunk_id": "0022100092_010", "order": 10, "role": "body", "text": "After Jackson knocked down a pull up jumper to tie the game at 32 in the second quarter, the Nets outscored the Pistons 32-17 over the final 10:40 to go into halftime with a 64-49 advantage."}
{"game_id": "0022100092", "chunk_id": "0022100092_011", "order": 11, "role": "body", "text": "The Nets did not let up in the second half, as they extended their lead to as much as 30. Brooklyn’s dominance was encapsulated by Bembry’s alley-oop jam off of a Harden feed with 4.5 seconds left in the third. The 13,507 in attendance at Barclays Center became unglued as Bembry hung on the rim and Harden bounced down the court in celebration."}
{"game_id": "0022100092", "chunk_id": "0022100092_012", "order": 12, "role": "body", "text": "It was not an entirely seamless night for the Nets, as Durant was ejected with 3:23 left in the third quarter after being assessed for a flagrant foul 2 against Kelly Olynyk. The Detroit center and Brooklyn forward became tangled as Olynyk set a screen, and Durant threw a forearm and then shoved Olynyk to the court following a whistle."}
{"game_id": "0022100092", "chunk_id": "0022100092_013", "order": 13, "role": "body", "text": "The incident was Durant’s second in as many games. He had received a technical in Brooklyn’s 105-98 win over the Pacers Friday night for throwing the ball into the stands after a foul was called."}
{"game_id": "0022100092", "chunk_id": "0022100092_014", "order": 14, "role": "body", "text": "“I tried to run through the screen,” Durant said. “That was the result of me trying to blow the screen up.”"}
{"game_id": "0022100092", "chunk_id": "0022100092_015", "order": 15, "role": "body", "text": "Brooklyn finished the game having made 65.3% of its shots from the field (47-for-72), 52% from 3 (13-for-25), as well as out-rebounding Detroit 41-29 and enjoying an 30-21 advantage in assists. The Nets also outscored the Pistons in the paint, 42-30."}
{"game_id": "0022100092", "chunk_id": "0022100092_016", "order": 16, "role": "body", "text": "“We couldn't get them out of their rhythm,” Joseph said."}
{"game_id": "0022100092", "chunk_id": "0022100092_018", "order": 18, "role": "body", "text": "Pistons: Detroit is young. Detroit is rebuilding. Detroit is learning about life in the NBA. All of which means a great deal of head coach Dwane Casey’s job is to monitor his team’s emotional state. “They’re somewhere in-between their growth process,\" Casey said before the game. \"So what you have to have is patience and that’s what we have. We’re in for the long run. We understand where we. Are in our process. We’re not going to skip letters of the alphabet just to try to win tonight’s game. So that’s where we are. We know what we are and I’ve been there before so I know there’s no magic wand.”"}
{"game_id": "0022100092", "chunk_id": "0022100092_020", "order": 20, "role": "body", "text": "Pistons: Hosts defending champion Milwaukee Tuesday night."}
{"game_id": "0022100092", "chunk_id": "0022100092_021", "order": 21, "role": "body", "text": "Nets: Concludes six-game homestead by hosting Atlanta Wednesday night."}
