{"game_id": "0022100350", "chunk_id": "0022100350_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Miles Bridges scored 32 points and the Charlotte Hornets, without four players, leaned on their best 3-point shooting game of the season and beat the Atlanta Hawks 130-127 on Sunday night."}
{"game_id": "0022100350", "chunk_id": "0022100350_002", "order": 2, "role": "body", "text": "Bridges made each of his four shots in the fourth quarter, when he scored 13 points."}
{"game_id": "0022100350", "chunk_id": "0022100350_003", "order": 3, "role": "body", "text": "“I feel like that’s a statement game, let people know that we’re here,” Bridges said."}
{"game_id": "0022100350", "chunk_id": "0022100350_004", "order": 4, "role": "body", "text": "Kelly Oubre Jr. made six 3s and scored 28 points for Charlotte. The Hornets made a season-high 17 3s."}
{"game_id": "0022100350", "chunk_id": "0022100350_005", "order": 5, "role": "body", "text": "Hawks coach Nate McMillan said the Hornets, even when short-handed, are “probably the best catch-and-shoot team in the league.”"}
{"game_id": "0022100350", "chunk_id": "0022100350_006", "order": 6, "role": "body", "text": "“We just really weren’t able to get stops when we needed to,” McMillan said. “We scored 127 points. That’s more than enough to win the game. It comes down to defensively being able to stop them and we weren’t able to do that.”"}
{"game_id": "0022100350", "chunk_id": "0022100350_007", "order": 7, "role": "body", "text": "John Collins led Atlanta with a season-best 31 points and 12 rebounds."}
{"game_id": "0022100350", "chunk_id": "0022100350_008", "order": 8, "role": "body", "text": "Among the four Charlotte players held out after being placed in the NBA’s health and safety protocols was leading scorer LaMelo Ball. Also, starting guard Terry Rozier, the third-leading scorer, and two more usual rotation players — center Mason Plumlee and forward Jalen McDaniels — were held out. They’ll be sidelined for at least 10 days."}
{"game_id": "0022100350", "chunk_id": "0022100350_009", "order": 9, "role": "body", "text": "“It was about who wanted it more and we have some guys on our team who are just dogs and wouldn’t be denied,” Oubre said."}
{"game_id": "0022100350", "chunk_id": "0022100350_010", "order": 10, "role": "body", "text": "“It was a blessing for us to go out and just compete and hold it down for our brothers.”"}
{"game_id": "0022100350", "chunk_id": "0022100350_011", "order": 11, "role": "body", "text": "Oubre, Ish Smith and Nick Richards moved into the starting lineup."}
{"game_id": "0022100350", "chunk_id": "0022100350_012", "order": 12, "role": "body", "text": "Bridges' 3 with 4:26 remaining gave Charlotte a 115-113 lead that it didn't relinquish. Oubre added another key 3 to push the lead to 122-116."}
{"game_id": "0022100350", "chunk_id": "0022100350_013", "order": 13, "role": "body", "text": "Trae Young's jumper with 22 seconds remaining cut Charlotte's lead to three points. Young scored 25 points and had a season-high 15 assists."}
{"game_id": "0022100350", "chunk_id": "0022100350_014", "order": 14, "role": "body", "text": "Atlanta's Kevin Huerter tried to counter Charlotte's long-distance game by making a career-best seven 3s, finishing with 28 points."}
{"game_id": "0022100350", "chunk_id": "0022100350_015", "order": 15, "role": "body", "text": "The Hornets made 53.5% of their shots from the field and 17 of 37 3s."}
{"game_id": "0022100350", "chunk_id": "0022100350_016", "order": 16, "role": "body", "text": "After trailing 74-63 early in the third quarter, the Hawks were boosted by three consecutive 3-pointers, including two by Collins, to cut the Hornets' lead to two points."}
{"game_id": "0022100350", "chunk_id": "0022100350_017", "order": 17, "role": "body", "text": "Atlanta led 89-87 before the Hornets regained momentum with a 12-0 run late in the third. Cody Martin had eight points, including two 3s, in the run."}
{"game_id": "0022100350", "chunk_id": "0022100350_019", "order": 19, "role": "body", "text": "Hornets: Charlotte's previous high for 3s was 14 in a 127-125 loss at Milwaukee on Wednesday. The Hornets matched that through three quarters — after a late 3 by Martin to end the third was disallowed. ... Martin had a career-high 19 points and Gordon Hayward added 18."}
{"game_id": "0022100350", "chunk_id": "0022100350_020", "order": 20, "role": "body", "text": "Hawks: F Solomon Hill was helped to the locker room after he slipped, did a split, and suffered a right hamstring injury late in the first quarter. Minutes later, he was ruled out for the remainder of the game. ... After winning eight of their first 10 home games, the Hawks have suffered back-to-back losses at State Farm Arena. ... F Cam Reddish (non-COVID illness) and G Bogdan Bogdanovic (right ankle sprain) did not play for the third consecutive game. ... Young was listed as questionable before the game with left knee soreness."}
{"game_id": "0022100350", "chunk_id": "0022100350_022", "order": 22, "role": "body", "text": "Smith, who led Charlotte with seven assists, started at point guard. Smith had help from Martin, who had four assists in addition to his scoring high."}
{"game_id": "0022100350", "chunk_id": "0022100350_023", "order": 23, "role": "body", "text": "“It’s not a coincidence we win this game with Cody out there 32 minutes and has a plus-22,” said Hornets coach James Borrego."}
{"game_id": "0022100350", "chunk_id": "0022100350_025", "order": 25, "role": "body", "text": "Huerter said Atlanta’s defense was “pretty bad, plain and simple.” He said inconsistency on defense has been an issue all season. “What that is I can’t put my finger on,” he said."}
{"game_id": "0022100350", "chunk_id": "0022100350_027", "order": 27, "role": "body", "text": "Hornets: Host Philadelphia 76ers on Monday."}
{"game_id": "0022100350", "chunk_id": "0022100350_028", "order": 28, "role": "body", "text": "Hawks: Visit Minnesota on Monday."}
