{"game_id": "0022100113", "chunk_id": "0022100113_001", "order": 1, "role": "lead", "text": "NEW YORK -- — The Brooklyn Nets are starting to look like the team that was so potent a season ago."}
{"game_id": "0022100113", "chunk_id": "0022100113_002", "order": 2, "role": "body", "text": "Kevin Durant scored 32 points and led the spurt that broke open the game late in the third quarter, and the Nets beat the Atlanta Hawks 117-108 on Wednesday night for their third straight victory."}
{"game_id": "0022100113", "chunk_id": "0022100113_003", "order": 3, "role": "body", "text": "“We’re finding that rhythm, we’re finding each other and it’s just getting a lot easier,” James Harden said."}
{"game_id": "0022100113", "chunk_id": "0022100113_004", "order": 4, "role": "body", "text": "Durant had 13 points in a 20-4 run to end the third that turned a tie game into a 16-point Nets lead going to the fourth. He added seven rebounds and five assists overall."}
{"game_id": "0022100113", "chunk_id": "0022100113_005", "order": 5, "role": "body", "text": "Joe Harris made six 3-pointers and scored 18 points, Harden had 16 points and 11 assists, and the Nets finished 4-2 on their homestand. They begin a six-game road trip Friday."}
{"game_id": "0022100113", "chunk_id": "0022100113_006", "order": 6, "role": "body", "text": "“We knew it was going to be a process for us. I’m glad we were able to figure some stuff out the last few games and get back on the right page,” Durant said. “We know it’s going to be tougher on the road but we’ve just got to keep grinding.”"}
{"game_id": "0022100113", "chunk_id": "0022100113_007", "order": 7, "role": "body", "text": "De'Andre Hunter made all six 3-pointers and scored 26 points for the Hawks. Trae Young had 21 points, 10 assists and nine rebounds, but shot just 6 for 22."}
{"game_id": "0022100113", "chunk_id": "0022100113_008", "order": 8, "role": "body", "text": "After a slow start to the season, the Nets are finding a flow. They shot a franchise-record 65.3% in a 117-91 rout of Detroit on Sunday and followed that by making 22 3-pointers Wednesday, their most since hitting a franchise-best 27 last Feb. 15 at Sacramento."}
{"game_id": "0022100113", "chunk_id": "0022100113_009", "order": 9, "role": "body", "text": "Durant snapped a 75-all tie with a pair of free throws with 4:40 left in the third, then added another basket and a 3 for a seven-point lead."}
{"game_id": "0022100113", "chunk_id": "0022100113_010", "order": 10, "role": "body", "text": "Then, leading by four, the Nets scored the final 12 points of the third quarter. Durant finished that with a 3 just before the buzzer to send Brooklyn to the fourth with a 95-79 cushion."}
{"game_id": "0022100113", "chunk_id": "0022100113_011", "order": 11, "role": "body", "text": "“For me, you’re going to make shots, you’re going to miss shots, but it’s the quality of the looks and I thought we had a great stretch in the second half where we got a lot of quality looks,” coach Steve Nash said. “And whether they go in or not, that makes you happy and when you make them, you do find separation.”"}
{"game_id": "0022100113", "chunk_id": "0022100113_012", "order": 12, "role": "body", "text": "Young thinks the Hawks have mostly played good defense this season."}
{"game_id": "0022100113", "chunk_id": "0022100113_013", "order": 13, "role": "body", "text": "“I mean, besides that third quarter,” he said. “They really took off in that third.”"}
{"game_id": "0022100113", "chunk_id": "0022100113_014", "order": 14, "role": "body", "text": "The Nets won for the first time this season when being outrebounded. Atlanta finished with a 52-42 advantage behind 16 from Clint Capela and 12 from John Collins. Brooklyn had been 0-3 when losing the battle on the boards."}
{"game_id": "0022100113", "chunk_id": "0022100113_016", "order": 16, "role": "body", "text": "Hawks: Reserve guard Lou Williams appeared in his 1,072nd game, tying Michael Jordan and Marvin Williams for 92nd place on the NBA’s career list. ... Steve Holman, the Hawks' radio broadcaster who has never missed a game in his 37 seasons, will be inducted into the Georgia Sports Hall of Fame in February."}
{"game_id": "0022100113", "chunk_id": "0022100113_017", "order": 17, "role": "body", "text": "Nets: Patty Mills scored 14 points. ... The Nets wore their blue city edition uniforms for the first time this season, looking more like the New Jersey Nets before they moved to Brooklyn and changed their colors to black."}
{"game_id": "0022100113", "chunk_id": "0022100113_019", "order": 19, "role": "body", "text": "Nash was asked if Kyrie Irving would be allowed to rejoin the Nets if New York City mayor-elect Eric Adams changes the local vaccine mandate, even if Irving hasn't been vaccinated against COVID-19."}
{"game_id": "0022100113", "chunk_id": "0022100113_020", "order": 20, "role": "body", "text": "“I might be speaking out of turn, but I think if the mandate changes he’d be welcomed back for sure,” Nash said."}
{"game_id": "0022100113", "chunk_id": "0022100113_021", "order": 21, "role": "body", "text": "Adams will take office Jan. 1. Currently, players on New York's professional teams must be vaccinated to play games in the city's public venues. The Nets could have allowed Irving to practice and play in road games, but instead told him to stay away from the team."}
{"game_id": "0022100113", "chunk_id": "0022100113_023", "order": 23, "role": "body", "text": "Hawks coach Nate McMillan opened his pregame press conference by congratulating the Atlanta Braves, who won the World Series with a 7-0 victory over the Houston Astros on Tuesday night in Game 6."}
{"game_id": "0022100113", "chunk_id": "0022100113_024", "order": 24, "role": "body", "text": "“I mean, just outstanding baseball for nine innings last night,” McMillan said."}
{"game_id": "0022100113", "chunk_id": "0022100113_025", "order": 25, "role": "body", "text": "The Hawks said they plan to honor the Braves at their home game Thursday, with some players and team officials expected to attend."}
{"game_id": "0022100113", "chunk_id": "0022100113_028", "order": 28, "role": "body", "text": "Nets: Visit Detroit on Friday."}
