{"game_id": "0022100030", "chunk_id": "0022100030_001", "order": 1, "role": "lead", "text": "CHICAGO -- — DeMar DeRozan scored 21 points, Nikola Vucevic added 15 points and 18 rebounds and the Chicago Bulls beat the Detroit Pistons 97-82 on Saturday night."}
{"game_id": "0022100030", "chunk_id": "0022100030_002", "order": 2, "role": "body", "text": "DeRozan put an exclamation point on his night, finishing a thunderous third quarter dunk despite getting hit in the face by Pistons guard Hamidou Diallo. His efforts helped give the Bulls their first 3-0 start to a season since 2016."}
{"game_id": "0022100030", "chunk_id": "0022100030_003", "order": 3, "role": "body", "text": "They were also badly needed, as Zach LaVine endured a sluggish start for the second straight night. Chicago’s star didn’t hit his first shot until just after the six minute mark of the second, and finished the night with 14 points on 6 of 18 shooting."}
{"game_id": "0022100030", "chunk_id": "0022100030_004", "order": 4, "role": "body", "text": "“We’re just going out there playing for each other,” DeRozan said. “We knew offense is going to take a little time, but I’d rather it be this way now. We can continue to build defensively while the offense comes around.”"}
{"game_id": "0022100030", "chunk_id": "0022100030_005", "order": 5, "role": "body", "text": "Chicago carried a 54-43 edge into the half, thanks in large part to its defense. The Bulls had seven steals in the second quarter, but offensive struggles prevented them from building a larger lead. Chicago finished the first half shooting just 18 of 45 from the field."}
{"game_id": "0022100030", "chunk_id": "0022100030_006", "order": 6, "role": "body", "text": "“We didn’t shoot it great, but I thought defensively we hung in there,” Bulls coach Billy Donovan said. “When you have a night like we did shooting the basketball, you want to be able to give yourself an opportunity to win. Without question, the defense did that.”"}
{"game_id": "0022100030", "chunk_id": "0022100030_007", "order": 7, "role": "body", "text": "Detroit opened the game on a 9-0 run, but Vucevic kick-started the Bulls with five points and three rebounds within a one-minute stretch. The Pistons went cold from that point on, shooting just 38.6% from the floor and hitting only five of their 28 3-point attempts."}
{"game_id": "0022100030", "chunk_id": "0022100030_008", "order": 8, "role": "body", "text": "Saddiq Bey led the way for Detroit with 20 points and 16 rebounds. Kelly Olynyk came off the bench to provide 10 points, eight of which came in the first quarter. Trey Lyles was the only other Pistons player to score in double figures, finishing the night with 12 points."}
{"game_id": "0022100030", "chunk_id": "0022100030_009", "order": 9, "role": "body", "text": "The Pistons tried to claw their way back into the game with a 20-2 run in the fourth quarter, but LaVine and Vucevic each hit late shots to prevent any drama."}
{"game_id": "0022100030", "chunk_id": "0022100030_011", "order": 11, "role": "body", "text": "Holding on to the ball was a significant issue for Detroit throughout the night. The Pistons turned it over 23 times, nine times in the second quarter alone. Chicago feasted on the mistakes, finishing the game with 24 points off turnovers."}
{"game_id": "0022100030", "chunk_id": "0022100030_012", "order": 12, "role": "body", "text": "“You can’t beat anybody in this league when you’re careless with the ball,” Pistons coach Dwane Casey said. “We’ve been preaching it since September. I take responsibility for the turnovers. Evidently, I’m not preaching it enough.”"}
{"game_id": "0022100030", "chunk_id": "0022100030_014", "order": 14, "role": "body", "text": "Pistons: Detroit is still awaiting the debut of rookie guard Cade Cunningham, the No. 1 overall pick. Cunningham is recovering from a sprained right ankle and practicing with the Motor City Cruise, Detroit’s G-League affiliate, to get fully up to speed."}
{"game_id": "0022100030", "chunk_id": "0022100030_015", "order": 15, "role": "body", "text": "Bulls: Chicago has now won nine straight games against Detroit. ...Alex Caruso received MVP chants from the home crowd for the second night in a row. He finished the game with 12 points and five steals off the bench."}
{"game_id": "0022100030", "chunk_id": "0022100030_017", "order": 17, "role": "body", "text": "Pistons: At Atlanta on Monday night."}
{"game_id": "0022100030", "chunk_id": "0022100030_018", "order": 18, "role": "body", "text": "Bulls: At Toronto on Monday night."}
