{"game_id": "0022100295", "chunk_id": "0022100295_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Darius Garland scored a season-high 26 points, rookie Evan Mobley had 13 points in his return from a sprained right elbow and the Cleveland Cavaliers beat the Orlando Magic 105-92 on Saturday night."}
{"game_id": "0022100295", "chunk_id": "0022100295_002", "order": 2, "role": "body", "text": "Mobley missed four games after getting entangled with Boston’s Enes Kanter on Nov. 15. The No. 3 overall selection had nine rebounds, three assists and four blocked shots, helping Cleveland end its longest losing streak of the season at five."}
{"game_id": "0022100295", "chunk_id": "0022100295_003", "order": 3, "role": "body", "text": "Garland added 11 assists, Lauri Markkanen scored 20 points, and Jarrett Allen had 19 points and 11 rebounds. Cedi Osman scored 10 points off the bench as Cleveland wrapped up a four-game homestand and evened its record at 10-10."}
{"game_id": "0022100295", "chunk_id": "0022100295_004", "order": 4, "role": "body", "text": "“It was great being back out there with J.A., Lauri and the guys again,” said Mobley, who is averaging 14.5 points, 8.1 rebounds and 1.8 blocked shots. “Our chemistry gets better every game. I missed a couple of shots early, but I felt good tonight.”"}
{"game_id": "0022100295", "chunk_id": "0022100295_005", "order": 5, "role": "body", "text": "Wendell Carter Jr. led Orlando with 19 points and 11 rebounds before being ejected with 2:09 left. Robin Lopez had 13 points and Gary Harris scored 11 for the Magic, who have the worst record in the East at 4-17 and dropped their sixth in a row."}
{"game_id": "0022100295", "chunk_id": "0022100295_006", "order": 6, "role": "body", "text": "Neither team led by more than seven until the Cavaliers opened the third quarter with an 11-3 run fueled by two Markkanen 3-pointers to go up 65-52. Cleveland put the game away midway through the fourth when Mobley nailed a trey to make it 91-75."}
{"game_id": "0022100295", "chunk_id": "0022100295_007", "order": 7, "role": "body", "text": "“It means everything to have him back because Evan wants to be great,” Garland said. “That’s why he always puts in the work. He brings a lot to the team with the way he blocks shots, grabs rebounds and, of course, his dunking.”"}
{"game_id": "0022100295", "chunk_id": "0022100295_008", "order": 8, "role": "body", "text": "Franz Wagner, the eighth overall selection, had 12 points, eight boards and four assists for Orlando, which didn’t attempt a free throw until 39 seconds remained in the second. Fifth pick Jalen Suggs had 10 points and made four steals, and Gary Harris scored 11."}
{"game_id": "0022100295", "chunk_id": "0022100295_009", "order": 9, "role": "body", "text": "Magic point guard Cole Anthony, who is averaging 19.6 points and 5.9 assists, missed his fifth straight game with a sprained right ankle. Terrence Ross played 11 minutes before exiting with lower back discomfort."}
{"game_id": "0022100295", "chunk_id": "0022100295_010", "order": 10, "role": "body", "text": "“There are no excuses, but the guys we had out there gave it everything they had,” Magic coach Jamahl Mosley said. “Cleveland did an outstanding job and stayed in attack mode the entire game.”"}
{"game_id": "0022100295", "chunk_id": "0022100295_011", "order": 11, "role": "body", "text": "Cleveland had lost seven straight to Orlando and beat the Magic for the first time since March 3, 2019."}
{"game_id": "0022100295", "chunk_id": "0022100295_012", "order": 12, "role": "body", "text": "“Evan came back and impacted the game at both ends of the floor,” Cavaliers coach J.B. Bickerstaff said. “He makes everyone feel safe because he and Jarrett are two of the best rim-protecting bigs in the league.”"}
{"game_id": "0022100295", "chunk_id": "0022100295_014", "order": 14, "role": "body", "text": "Bickerstaff was impressed with Mobley’s work ethic while he was sidelined, noting that the 20-year-old post player did not miss a practice. “Evan didn’t take any days off when he got hurt, which tells you something,” Bickerstaff said. “The first few days, he just did everything with his left hand because he wanted to be out there with his teammates.”"}
{"game_id": "0022100295", "chunk_id": "0022100295_016", "order": 16, "role": "body", "text": "Magic: C Mo Bamba (lower back spasms) was a late scratch. … C Jonathan Isaac (left knee), G Markelle Fultz (left knee) and G Michael Carter-Williams (left ankle) have yet to play this season as they recover from surgeries on torn ligaments. G E’Twaun Moore (left knee sprain) also has not appeared in a game. … Orlando coach Jamahl Mosley was a Cleveland assistant from 2010-2014 under Byron Scott and Mike Brown."}
{"game_id": "0022100295", "chunk_id": "0022100295_017", "order": 17, "role": "body", "text": "Cavaliers: F Lamar Stevens (right ankle sprain) saw his first action since Nov. 12 against Detroit. … F Dean Wade (left calf strain), who has started 11 games, was inactive after being hurt Wednesday against Phoenix. … G Collin Sexton (left knee surgery) will miss the rest of the season after having a torn meniscus repaired on Nov. 17. … C Tacko Fall and G RJ Nembhard, both two-way players, are on G League assignments."}
{"game_id": "0022100295", "chunk_id": "0022100295_019", "order": 19, "role": "body", "text": "Magic: At Philadelphia on Monday night."}
{"game_id": "0022100295", "chunk_id": "0022100295_020", "order": 20, "role": "body", "text": "Cavaliers: At Dallas on Monday night."}
