{"game_id": "0022100108", "chunk_id": "0022100108_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Jarrett Allen had 24 points and 17 rebounds, and rookie Evan Mobley added 11 points and 11 rebounds in his fourth double-double as the Cleveland Cavaliers beat the Portland Trail Blazers 107-104 on Wednesday night."}
{"game_id": "0022100108", "chunk_id": "0022100108_002", "order": 2, "role": "body", "text": "Damian Lillard missed a fadeaway 3-pointer from the left wing with two seconds left and Mobley, the third overall pick in the draft, grabbed the rebound as time expired. Cleveland has won four of its last six."}
{"game_id": "0022100108", "chunk_id": "0022100108_003", "order": 3, "role": "body", "text": "“Everyone in the building knew Dame was going to shoot it, so I just tried to crowd him the best I could without fouling,” Allen said. “We’re having fun and we’re playing the right way. We’re just going out and playing basketball together.”"}
{"game_id": "0022100108", "chunk_id": "0022100108_004", "order": 4, "role": "body", "text": "Collin Sexton scored 21 points and Darius Garland had 19 points and 11 assists for Cleveland, which never trailed in the second half. The Cavaliers returned home after a 3-2 trip that included wins over the Nuggets and Clippers."}
{"game_id": "0022100108", "chunk_id": "0022100108_005", "order": 5, "role": "body", "text": "“Our guys are thriving off the competition right now and that’s giving us a chance every night,” Cleveland coach J.B. Bickerstaff said."}
{"game_id": "0022100108", "chunk_id": "0022100108_006", "order": 6, "role": "body", "text": "Lillard had a game-high 26 points and eight assists, and shot 10 of 27 from the field as Portland lost its third straight. Norman Powell scored 23 points and CJ McCollum had 21 points, seven rebounds and six assists."}
{"game_id": "0022100108", "chunk_id": "0022100108_007", "order": 7, "role": "body", "text": "Sexton scored to give the Cavaliers a 107-101 lead with 1:43 remaining., but Lillard pulled the Blazers within three on a three-point play with 32 seconds left. Portland regained possession with 10 seconds remaining after a miss by Sexton."}
{"game_id": "0022100108", "chunk_id": "0022100108_008", "order": 8, "role": "body", "text": "“I took a peek over at CJ, but it looked like I’d get a clean look after I came off the screen,” Lillard said. “If I had to do it again, I wouldn’t even use a screen. I’d just go right into it.”"}
{"game_id": "0022100108", "chunk_id": "0022100108_009", "order": 9, "role": "body", "text": "Earlier in the fourth quarter, the Blazers cut their deficit to 93-92 on a 3-pointer by McCollum before Allen scored six points in a 10-4 run."}
{"game_id": "0022100108", "chunk_id": "0022100108_010", "order": 10, "role": "body", "text": "“Jarrett Allen, he was a monster,” said Portland coach Chauncey Billups, whose team is 0-4 on the road. “He’s not a scorer, but he had a night tonight.”"}
{"game_id": "0022100108", "chunk_id": "0022100108_011", "order": 11, "role": "body", "text": "Mobley, a former USC standout, had a 3-pointer, dunk and block on Lillard in the final five minutes. The rookie is averaging 13.3 points and 8.2 rebounds through nine games."}
{"game_id": "0022100108", "chunk_id": "0022100108_012", "order": 12, "role": "body", "text": "Cleveland forwards Kevin Love and Lauri Markkanen were unavailable and are in the NBA’s health and safety protocols. Love has missed two games and Markkanen one."}
{"game_id": "0022100108", "chunk_id": "0022100108_013", "order": 13, "role": "body", "text": "The Cavaliers held an 87-77 lead after three quarters when Garland beat the buzzer with a 25-footer. Cleveland made 15 3-pointers in 30 attempts, five by Garland and four from Cedi Osman."}
{"game_id": "0022100108", "chunk_id": "0022100108_014", "order": 14, "role": "body", "text": "Dylan Windler made three 3-pointers early in the second as Cleveland went into the break with a 60-53 edge despite 18 points by Powell. A three-point play by Sexton gave the Cavaliers their largest advantage at 58-46."}
{"game_id": "0022100108", "chunk_id": "0022100108_016", "order": 16, "role": "body", "text": "Garland is seventh in the NBA in assists at 7.9 per game, but also leads the team with 29 turnovers. Bickerstaff doesn’t believe Garland’s ballhandling is reason for concern, yet. “I tend to like guys who are safer with the ball, but there are some guys who you’ve got to allow them more freedom,” Bickerstaff said. “It’s not like he’s traveling all the time. He’s trying to make passes to set up his teammates.”"}
{"game_id": "0022100108", "chunk_id": "0022100108_018", "order": 18, "role": "body", "text": "Trail Blazers: Lillard (16,971) moved past Celtics legend Bob Cousy (16,960) into 98th place on the all-time scoring list. Grant Hill (17,137) is next. … F Larry Nance Jr. spent the past four seasons with Cleveland, coming off the bench on its 2018 NBA Finals team. Nance grew up in northeast Ohio and graduated from suburban Richfield Revere High."}
{"game_id": "0022100108", "chunk_id": "0022100108_019", "order": 19, "role": "body", "text": "Cavaliers: G Isaac Okoro (left hamstring strain) missed his fifth consecutive game. Okoro led all rookies by averaging 32.4 minutes last season. … Allen became the third NBA player in the shot-clock era to shoot .730 from the field with at least 45 makes over the first eight games, joining Wilt Chamberlain (1972) and Rudy Gobert (2018)."}
{"game_id": "0022100108", "chunk_id": "0022100108_021", "order": 21, "role": "body", "text": "Trail Blazers: Host Indiana on Friday. Portland remains at Moda Center to play the Los Angeles Lakers on Saturday."}
{"game_id": "0022100108", "chunk_id": "0022100108_022", "order": 22, "role": "body", "text": "Cavaliers: Visit Toronto on Friday. It will be Cleveland’s first game in Canada since Dec. 31, 2019, at Scotiabank Arena."}
