{"game_id": "0022101218", "chunk_id": "0022101218_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — The Milwaukee Bucks used the final game of the regular season to rest up before defending their NBA crown."}
{"game_id": "0022101218", "chunk_id": "0022101218_002", "order": 2, "role": "body", "text": "The Cavaliers didn't have any such luxury."}
{"game_id": "0022101218", "chunk_id": "0022101218_003", "order": 3, "role": "body", "text": "Kevin Love made eight 3-pointers and scored 32 points as Cleveland took the No. 8 play-in spot — and a matchup against Brooklyn — with a 133-115 victory Sunday over the Bucks, who sat superstar Giannis Antetokounmpo and their other regulars."}
{"game_id": "0022101218", "chunk_id": "0022101218_004", "order": 4, "role": "body", "text": "The Cavs were in jeopardy of falling all the way to the No. 10 seed in the Eastern Conference with a loss."}
{"game_id": "0022101218", "chunk_id": "0022101218_005", "order": 5, "role": "body", "text": "However, they ended any suspense immediately, scoring the first 14 points and dominating a team of backups to the Bucks' backups. The Cavs made 10 3-pointers while building a 28-point lead in the first quarter and Cleveland led by 33 at half."}
{"game_id": "0022101218", "chunk_id": "0022101218_006", "order": 6, "role": "body", "text": "“They just played the game with purpose,\" coach J.B. Bickerstaff said. “Times this year we’ve been in circumstances where we didn’t play the game with 48 minutes of purpose. Tonight, I thought they did a great job of coming out and setting the tone and playing the game the way we needed to play it.”"}
{"game_id": "0022101218", "chunk_id": "0022101218_007", "order": 7, "role": "body", "text": "Love did all his damage in 15 minutes, matching his career high for 3s and adding 10 rebounds."}
{"game_id": "0022101218", "chunk_id": "0022101218_008", "order": 8, "role": "body", "text": "According to Elias Sports Bureau, Love is the first player since 1954 (in the shot clock era) to record at least and 10 rebounds in 15 minutes or less."}
{"game_id": "0022101218", "chunk_id": "0022101218_009", "order": 9, "role": "body", "text": "Rookie Evan Mobley added 18 points and 10 rebounds for the Cavs, who won just 22 games a year ago and weren't expected to be anywhere near the playoffs. But here they are and will now face the Nets in Brooklyn on Tuesday night with the winner advancing to the first round."}
{"game_id": "0022101218", "chunk_id": "0022101218_010", "order": 10, "role": "body", "text": "Cleveland went 1/3 against Brooklyn this season, but the Cavs led the Nets in the fourth quarter on Friday night before collapsing in crunch time."}
{"game_id": "0022101218", "chunk_id": "0022101218_011", "order": 11, "role": "body", "text": "“I like our chances when it comes down to a dog fight,” Love said. \"That's what it's going to be come Tuesday night.”"}
{"game_id": "0022101218", "chunk_id": "0022101218_012", "order": 12, "role": "body", "text": "The Bucks whittled a 40-point deficit to 12 in the fourth against Cleveland's reserves before Bickerstaff re-inserted Mobley, Darius Garland and Lauri Markkanen and the Cavs regained control."}
{"game_id": "0022101218", "chunk_id": "0022101218_013", "order": 13, "role": "body", "text": "Milwaukee rookie Sandro Mamukelashvili had a season-high 28 points and added 13 rebounds."}
{"game_id": "0022101218", "chunk_id": "0022101218_014", "order": 14, "role": "body", "text": "With a top-three seed already secured, the Bucks rested Antetokounmpo along with starters Khris Middleton, Brook Lopez and Bobby Portis — a reward for the defending champs having another solid year."}
{"game_id": "0022101218", "chunk_id": "0022101218_015", "order": 15, "role": "body", "text": "Jrue Holiday started for the Bucks but played just seven seconds. He would earn a bonus by playing, so Holiday took the floor for the jump ball, immediately committed a foul and checked out."}
{"game_id": "0022101218", "chunk_id": "0022101218_016", "order": 16, "role": "body", "text": "Assuming they get the No. 3 seed (No. 2 Boston plays at Memphis on Sunday night), the Bucks will play No. 6 Chicago in the first round and avoid an early matchup against Brooklyn, which took Milwaukee to seven games in the conference semifinals last season."}
{"game_id": "0022101218", "chunk_id": "0022101218_017", "order": 17, "role": "body", "text": "“It’s great to have 82 games in the bank, and we have pretty good health,\" coach Mike Budenholzer said. \"The guys know we have a special group and we have a special opportunity.”"}
{"game_id": "0022101218", "chunk_id": "0022101218_018", "order": 18, "role": "body", "text": "The Cavaliers, who have maneuvered around injuries all season, are still without All-Star center Jarrett Allen. He hasn't played since breaking a finger on March 5, but might be ready for the postseason."}
{"game_id": "0022101218", "chunk_id": "0022101218_019", "order": 19, "role": "body", "text": "While the Cavs have loftier goals, Bickerstaff wanted his players to appreciate making the play-tournament."}
{"game_id": "0022101218", "chunk_id": "0022101218_020", "order": 20, "role": "body", "text": "“These opportunities, and this is what I want our guys to understand, they’re not promised, they’re not guaranteed,” he said. “We have guys on this team that it took them six or seven years to get to the playoffs. Me, personally, it was my ninth season before I had an opportunity to compete in a playoff, so this is noting that just because you are around the league, it’s guaranteed.”"}
{"game_id": "0022101218", "chunk_id": "0022101218_022", "order": 22, "role": "body", "text": "Bucks: Despite finishing the season averaging 29.9 points, 11.6 rebounds and 5.8 assists, Antetokounmpo appears to be an outsider in a tight MVP race. ... G George Hill (neck soreness) was held out, but Budenholzer said he's “pretty optimistic” about the veteran playing in the postseason. Hill missed 17 games with the injury from Jan. 30 to March 12. … G Grayson Allen (left hip soreness) was unavailable for the third straight game."}
{"game_id": "0022101218", "chunk_id": "0022101218_023", "order": 23, "role": "body", "text": "Cavaliers: C Moses Brown had his two-way contract converted to a standard NBA pact. He's now eligible for the play-in tournament and playoffs. … Rajon Rondo had a season-high 13 assists. ... Cleveland finished 44-38, doubling its win total from 2021."}
{"game_id": "0022101218", "chunk_id": "0022101218_025", "order": 25, "role": "body", "text": "Allen got in an intense workout on the floor before the game, going through a variety of drills and shooting with his injured left hand."}
{"game_id": "0022101218", "chunk_id": "0022101218_026", "order": 26, "role": "body", "text": "He’s no longer wearing a protective splint and his fingers are merely taped, another strong sign he’s close to being ready."}
{"game_id": "0022101218", "chunk_id": "0022101218_027", "order": 27, "role": "body", "text": "The Cavaliers have missed him at both ends of the court."}
{"game_id": "0022101218", "chunk_id": "0022101218_028", "order": 28, "role": "body", "text": "“He’s making steps,” Bickerstaff said. “It’s just one of those things, the day will come and he’ll be ready to go.”"}
{"game_id": "0022101218", "chunk_id": "0022101218_030", "order": 30, "role": "body", "text": "Bucks: The Bucks went 4-0 against the Bulls this season."}
{"game_id": "0022101218", "chunk_id": "0022101218_031", "order": 31, "role": "body", "text": "Cavaliers: Will make their first play-in appearance Tuesday."}
