{"game_id": "0022100831", "chunk_id": "0022100831_001", "order": 1, "role": "lead", "text": "DETROIT -- — Ja Morant scored 23 points, Steven Adams added 17 points and 14 rebounds, and the Memphis Grizzlies routed the Detroit Pistons 132-107 on Thursday night."}
{"game_id": "0022100831", "chunk_id": "0022100831_002", "order": 2, "role": "body", "text": "“I think we've got a few things to clean up on the defensive end, but our offense is playing at such a high level that we are still able to win games,” said Morant, who led Memphis with 30:05 of playing time. “When we've got things going like this, it gives us all a chance to get some rest and watch the show."}
{"game_id": "0022100831", "chunk_id": "0022100831_003", "order": 3, "role": "body", "text": "“We just have to keep it going.”"}
{"game_id": "0022100831", "chunk_id": "0022100831_004", "order": 4, "role": "body", "text": "Desmond Bane added 22 points for the Grizzlies, who have won four straight and seven of eight. Bane said the big night was enjoyable against Detroit, who passed on him three times in the first round of the 2020 draft."}
{"game_id": "0022100831", "chunk_id": "0022100831_005", "order": 5, "role": "body", "text": "“I haven't been making shots in the last few days, so maybe it was fitting to come back with a good game against the Pistons,” he said. “I know they had a lot of interest in me, especially with the 16th and 19th picks, but that's how how it ended up happening.”"}
{"game_id": "0022100831", "chunk_id": "0022100831_006", "order": 6, "role": "body", "text": "Memphis, which led 41-19 at the end of the first quarter, had seven players score in double figures."}
{"game_id": "0022100831", "chunk_id": "0022100831_007", "order": 7, "role": "body", "text": "“We told the guys before the game that Detroit was going to play a scrappy, tough game, so we were going to need good energy,” Grizzlies coach Taylor Jenkins said. “I thought we came out with the right mentality and put it to good use.”"}
{"game_id": "0022100831", "chunk_id": "0022100831_008", "order": 8, "role": "body", "text": "Jeremi Grant had 20 points for Detroit, which has lost six in a row. Hamidou Diallo added 17 points and 10 rebounds."}
{"game_id": "0022100831", "chunk_id": "0022100831_009", "order": 9, "role": "body", "text": "“I was able to play free tonight because I know I'm going to be a Piston,” said Grant, who had been mentioned in trade rumors ahead of Thursday's deadline. “This is where I want to be, so it feels good to know they feel the same way about me.”"}
{"game_id": "0022100831", "chunk_id": "0022100831_010", "order": 10, "role": "body", "text": "The Pistons, who were outscored 81-78 in the final three quarters, have gone 2-12 since winning five of their first eight games of this year."}
{"game_id": "0022100831", "chunk_id": "0022100831_011", "order": 11, "role": "body", "text": "“I thought there were a lot of points in this game where we played hard and we played well,” Pistons coach Dwane Casey said. “But we didn't start the game that way. I don't care if we miss 50 million shots, we have to execute and we have to play with the right spirit.”"}
{"game_id": "0022100831", "chunk_id": "0022100831_012", "order": 12, "role": "body", "text": "The Grizzlies led 65-40 with 2 minutes left in the second quarter, but the Pistons finished the half with a 10-0 run to cut the margin to 15. Memphis outshot Detroit 46% to 36.4% and had 11 points off turnovers to Detroit's two."}
{"game_id": "0022100831", "chunk_id": "0022100831_013", "order": 13, "role": "body", "text": "The Pistons quickly cut the deficit to 68-57 in the third quarter, forcing a timeout from Jenkins."}
{"game_id": "0022100831", "chunk_id": "0022100831_014", "order": 14, "role": "body", "text": "“We stalled out a little at the end of the second quarter and into the third quarter,” he said. “There are always going to be ebbs and flows in this league, but I liked the way we responded.”"}
{"game_id": "0022100831", "chunk_id": "0022100831_015", "order": 15, "role": "body", "text": "That was as close as Detroit got in the period, and Memphis had restored the 15-point lead at quarter's end. The Grizzlies went on a 9-2 run to start the fourth, with Brandon Clarke's uncontested dunk putting them ahead 104-82."}
{"game_id": "0022100831", "chunk_id": "0022100831_017", "order": 17, "role": "body", "text": "Grizzlies: Memphis beat the Pistons 118-88 on Jan. 6, the biggest margin of victory for either team in the rivalry. ... Eleven players scored as the Grizzlies took a 41-19 lead in the first quarter."}
{"game_id": "0022100831", "chunk_id": "0022100831_018", "order": 18, "role": "body", "text": "Pistons: Cade Cunningham missed his fifth straight game with a hip injury. ... The Pistons traded Trey Lyles and Josh Jackson as part of a four-way trade that brought Marvin Bagley III from the Sacramento Kings."}
{"game_id": "0022100831", "chunk_id": "0022100831_020", "order": 20, "role": "body", "text": "Morant found out after the game he had been selected by Kevin Durant for his All-Star Game roster."}
{"game_id": "0022100831", "chunk_id": "0022100831_021", "order": 21, "role": "body", "text": "“That means a lot to me, because KD was one of the first NBA players to mention me when I was playing in college,” he said. “He said I was his favorite player to watch and he's always shown me a lot of love, so go Team Durant.”"}
{"game_id": "0022100831", "chunk_id": "0022100831_023", "order": 23, "role": "body", "text": "Grizzlies: Visit the Charlotte Hornets on Saturday."}
{"game_id": "0022100831", "chunk_id": "0022100831_024", "order": 24, "role": "body", "text": "Pistons: Host the Charlotte Hornets on Friday."}
