{"game_id": "0022100153", "chunk_id": "0022100153_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Cameron Payne scored a season-high 24 points in 22 minutes off the bench and the Phoenix Suns got help from an overturned call to win their fifth straight game, beating the Sacramento Kings 109-104 on Monday night."}
{"game_id": "0022100153", "chunk_id": "0022100153_002", "order": 2, "role": "body", "text": "Devin Booker had 18 points, nine rebounds and six assists for Phoenix. Chris Paul and Mikal Bridges scored 16 apiece."}
{"game_id": "0022100153", "chunk_id": "0022100153_003", "order": 3, "role": "body", "text": "The Suns led by 21 early in the fourth quarter before Sacramento made a late push over the final five minutes."}
{"game_id": "0022100153", "chunk_id": "0022100153_004", "order": 4, "role": "body", "text": "“The second unit has to do a lot better job of maintaining. To expect the starters to come in and save us in moments like that, that’s a pretty tough assignment,” Phoenix coach Monty Williams said. “We gave them a lot of momentum with the turnovers. We were able to make enough plays to win the game, but that’s a tough spot to be in.”"}
{"game_id": "0022100153", "chunk_id": "0022100153_005", "order": 5, "role": "body", "text": "De’Aaron Fox hit a pair of free throws and Damian Jones scored on a putback dunk to pull the Kings to 107-102. After a Suns miss, Sacramento’s Harrison Barnes scored on a layup and appeared to be fouled by Booker."}
{"game_id": "0022100153", "chunk_id": "0022100153_006", "order": 6, "role": "body", "text": "“I thought I got my two feet down, thought I was pretty still,” Booker said. “I definitely thought it was a charge.”"}
{"game_id": "0022100153", "chunk_id": "0022100153_007", "order": 7, "role": "body", "text": "Williams challenged the play and, after a lengthy review, the call was overturned and Barnes was charged with an offensive foul."}
{"game_id": "0022100153", "chunk_id": "0022100153_008", "order": 8, "role": "body", "text": "“The players always feel like they didn’t commit the crime, but Book was pretty adamant,” Williams said. “In the moment you almost have to do it to change the momentum. It was a good call by (associate head coach) Kevin Young to give me the go-ahead to do it. Book was in a good position.”"}
{"game_id": "0022100153", "chunk_id": "0022100153_009", "order": 9, "role": "body", "text": "After Barnes later dunked, Booker missed two free throws to keep the Suns’ lead at 107-104. But the Kings turned the ball over on the ensuing inbounds play."}
{"game_id": "0022100153", "chunk_id": "0022100153_010", "order": 10, "role": "body", "text": "Barnes had 26 points and Fox scored 24 for Sacramento, which was outscored 31-12 in the third before mounting a furious rally that fell short."}
{"game_id": "0022100153", "chunk_id": "0022100153_011", "order": 11, "role": "body", "text": "“Loved the fight that the group showed. Unfortunately, it took the bench to come in and do that,” Kings coach Luke Walton said. “What I’m most disappointed in is wasted opportunities. The third quarter was disgusting.”"}
{"game_id": "0022100153", "chunk_id": "0022100153_012", "order": 12, "role": "body", "text": "Playing without Deandre Ayton for the third time in four games, the Suns played well in the post and got big contributions from several reserves."}
{"game_id": "0022100153", "chunk_id": "0022100153_013", "order": 13, "role": "body", "text": "Payne led the charge off the bench while shooting 9 of 14 with four 3-pointers. Frank Kaminsky added 10 points and five rebounds."}
{"game_id": "0022100153", "chunk_id": "0022100153_014", "order": 14, "role": "body", "text": "The Suns built their big lead after scoring the first 14 points of the second half when the Kings missed eight straight shots and committed five turnovers. Paul had five points during the run and picked up a technical for arguing with an official after scoring on a layup following a steal."}
{"game_id": "0022100153", "chunk_id": "0022100153_016", "order": 16, "role": "body", "text": "Suns: Paul was held under 10 assists for the second time this season. … The bench had 39 points in the first half and outscored Sacramento’s reserves 48-33 overall. … Jae Crowder was called for a Flagrant 1 foul in the second quarter. … Ayton is dealing with a nagging right lower leg contusion."}
{"game_id": "0022100153", "chunk_id": "0022100153_017", "order": 17, "role": "body", "text": "Kings: Tyrese Haliburton was a late scratch because of lower back tightness. Buddy Hield started in Haliburton’s place and scored 14 points."}
{"game_id": "0022100153", "chunk_id": "0022100153_019", "order": 19, "role": "body", "text": "Suns: Host the Portland Trail Blazers on Wednesday."}
{"game_id": "0022100153", "chunk_id": "0022100153_020", "order": 20, "role": "body", "text": "Kings: Begin a four-game road trip in San Antonio on Wednesday."}
