{"game_id": "0022101198", "chunk_id": "0022101198_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — The Milwaukee Bucks turned up their defensive intensity just in time Thursday night to beat the short-handed Boston Celtics and take over second place in the Eastern Conference standings."}
{"game_id": "0022101198", "chunk_id": "0022101198_002", "order": 2, "role": "body", "text": "Once the playoffs arrive, they're hoping they can make those game-changing runs a little earlier."}
{"game_id": "0022101198", "chunk_id": "0022101198_003", "order": 3, "role": "body", "text": "Giannis Antetokounmpo and Jrue Holiday each scored 29 points and the Bucks defeated the Celtics 127-121 by closing with a 9-0 spurt."}
{"game_id": "0022101198", "chunk_id": "0022101198_004", "order": 4, "role": "body", "text": "“It would be a lot easier if we don’t wait until the last quarter or last couple of minutes to get stops, but it happens,” said Milwaukee's Khris Middleton, who had 22 points, nine assists and eight rebounds. “No matter how the game’s going, I just love the way we keep competing.”"}
{"game_id": "0022101198", "chunk_id": "0022101198_005", "order": 5, "role": "body", "text": "Miami (52-28) has clinched the East's top seed, but the projected playoff order of teams behind the Heat remains uncertain."}
{"game_id": "0022101198", "chunk_id": "0022101198_006", "order": 6, "role": "body", "text": "The Bucks (50-30) moved a half-game ahead of the Celtics (50-31) and a full game ahead of the Philadelphia 76ers (49-31), who lost 119-114 at Toronto  on Thursday. Milwaukee visits the Detroit Pistons on Friday and Cleveland Cavaliers on Sunday in its final two regular-season games."}
{"game_id": "0022101198", "chunk_id": "0022101198_007", "order": 7, "role": "body", "text": "Milwaukee withstood a triple-double from Boston's Jaylen Brown, who had 22 points, 11 assists and 10 rebounds. Brown’s 11 assists matched his career high."}
{"game_id": "0022101198", "chunk_id": "0022101198_008", "order": 8, "role": "body", "text": "One night after a  117-94 victory at Chicago,  the Celtics held Jayson Tatum and Al Horford out of Thursday’s game. They also were missing Robert Williams III, who hasn’t played since March 27 due to a meniscus tear in his left knee."}
{"game_id": "0022101198", "chunk_id": "0022101198_009", "order": 9, "role": "body", "text": "“We've seen that growth from (Brown) this year,\" Celtics coach Ime Udoka said. \"With certain guys out, he had the ball more and had to make those plays.”"}
{"game_id": "0022101198", "chunk_id": "0022101198_010", "order": 10, "role": "body", "text": "Milwaukee capitalized on Boston’s lack of size without Tatum, Horford and Williams by outscoring the Celtics 54-35 in the paint and 14-5 in second-chance points."}
{"game_id": "0022101198", "chunk_id": "0022101198_011", "order": 11, "role": "body", "text": "The Celtics still almost won by shooting 21 of 50 from 3-point range."}
{"game_id": "0022101198", "chunk_id": "0022101198_012", "order": 12, "role": "body", "text": "Boston's Marcus Smart shot 7 of 12 on 3-point attempts and scored 29 points. Daniel Theis had 22 points and Derrick White added 19 for the Celtics."}
{"game_id": "0022101198", "chunk_id": "0022101198_013", "order": 13, "role": "body", "text": "Bobby Portis scored 17 points and Brook Lopez had 15 for the Bucks. Antetokounmpo had 11 rebounds and five assists. Holiday had eight rebounds and eight assists."}
{"game_id": "0022101198", "chunk_id": "0022101198_014", "order": 14, "role": "body", "text": "Smart put Boston ahead 119-118 on a 3-pointer with 4:25 left and added a driving layup nearly two minutes later to make it 121-118. Portis tied it by sinking a 3-pointer with 2:11 remaining."}
{"game_id": "0022101198", "chunk_id": "0022101198_015", "order": 15, "role": "body", "text": "The Bucks took the lead for good when Antetokounmpo made the second of two free throws with 1:31 left. After White missed a 3-pointer, Holiday converted a putback of his own miss to make it 124-121 with a minute remaining."}
{"game_id": "0022101198", "chunk_id": "0022101198_016", "order": 16, "role": "body", "text": "“I guess I just got lucky, really,” Holiday said. “I left it short and it came back to me.”"}
{"game_id": "0022101198", "chunk_id": "0022101198_017", "order": 17, "role": "body", "text": "After Theis couldn’t score from right under the basket, Antetokounmpo made one of two free throws to extend Milwaukee’s lead to 125-121 with 39 seconds left."}
{"game_id": "0022101198", "chunk_id": "0022101198_018", "order": 18, "role": "body", "text": "George Hill stole the ball from Brown on Boston’s next possession and got credited with the game’s final basket when Theis was called for goaltending with 23.1 seconds remaining."}
{"game_id": "0022101198", "chunk_id": "0022101198_020", "order": 20, "role": "body", "text": "Hill offered more clarity Thursday on the neck injury that caused him to miss 17 games before he returned to action March 14."}
{"game_id": "0022101198", "chunk_id": "0022101198_021", "order": 21, "role": "body", "text": "The Bucks veteran guard said he had a partial tear between the sixth and seventh thoracic vertebra in his spine. Hill didn’t undergo surgery and plans to revisit the issue after the season."}
{"game_id": "0022101198", "chunk_id": "0022101198_022", "order": 22, "role": "body", "text": "“Surgery can be season-ending, so you don’t want to do that,” Hill said after the Bucks’ Thursday morning shootaround. “You want to figure out how I can manage to get back out with the guys. It feels a lot better now. I’m just trying to give it everything I have.”"}
{"game_id": "0022101198", "chunk_id": "0022101198_024", "order": 24, "role": "body", "text": "Celtics: Rookie Sam Hauser, a Wisconsin native who began his college career at Marquette, had a career-high 11 points and went 3 of 4 on 3-point attempts. Marquette and the Bucks both play their home games at Fiserv Forum. ... Celtics assistant coach Ben Sullivan, an assistant on Milwaukee's staff last season, received his 2020-21 championship ring in a pregame ceremony."}
{"game_id": "0022101198", "chunk_id": "0022101198_025", "order": 25, "role": "body", "text": "Bucks: The Bucks requested waivers on DeAndre’ Bembry, who played eight games for them before suffering a season-ending knee injury in a loss at Golden State on March 12. … Grayson Allen didn’t play due to left hip soreness."}
{"game_id": "0022101198", "chunk_id": "0022101198_027", "order": 27, "role": "body", "text": "Celtics: At Memphis on Sunday. The Celtics beat the Grizzlies 120-107 in Boston on March 3."}
{"game_id": "0022101198", "chunk_id": "0022101198_028", "order": 28, "role": "body", "text": "Bucks: At Detroit on Friday. The Bucks are 2-1 against the Pistons this season but lost the last matchup 115-106 at Milwaukee on Jan. 3."}
