{"game_id": "0022100703", "chunk_id": "0022100703_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Trae Young scored 30 points and tied a season-high with eight 3-pointers, and the streaky Atlanta Hawks defeated the cold-shooting Charlotte Hornets 113-91 on Sunday night for their fourth straight win."}
{"game_id": "0022100703", "chunk_id": "0022100703_002", "order": 2, "role": "body", "text": "De’Andre Hunter chipped in with 20 points and survived a hard fall late in the game for the Hawks, who led by 27 in the fourth quarter."}
{"game_id": "0022100703", "chunk_id": "0022100703_003", "order": 3, "role": "body", "text": "Miles Bridges and LaMelo Ball each finished with 19 points for the Hornets, who missed their first 19 3-point attempts and shot an abysmal 11.1% (4 of 36) from beyond the arc. Ball and Terry Rozier were a combined 0 for 14 from long distance as Charlotte had its three-game win streak snapped."}
{"game_id": "0022100703", "chunk_id": "0022100703_004", "order": 4, "role": "body", "text": "The Hawks are looking to climb back in the playoff race after a rough stretch of games."}
{"game_id": "0022100703", "chunk_id": "0022100703_005", "order": 5, "role": "body", "text": "“We are definitely headed in the right direction,” Young said. “Right now it's more about consistency and keeping it going. We're not satisfied. We know what to do and what we are capable of doing.”"}
{"game_id": "0022100703", "chunk_id": "0022100703_006", "order": 6, "role": "body", "text": "This game was a big step forward, with the Hawks building a 55-44 lead at halftime after holding the Hornets to 0-for-16 shooting from deep in the first half."}
{"game_id": "0022100703", "chunk_id": "0022100703_007", "order": 7, "role": "body", "text": "The Hornets would miss three more 3s to start the second half, and frustrations began to boil over midway through the third quarter when Ball had the ball stolen in the front court and was charged with a flagrant foul for swiping at a Hawks player."}
{"game_id": "0022100703", "chunk_id": "0022100703_008", "order": 8, "role": "body", "text": "After the flagrant was assessed and the players returned to the court, Ball complained to official about the call and was given a technical foul."}
{"game_id": "0022100703", "chunk_id": "0022100703_009", "order": 9, "role": "body", "text": "The Hawks used the momentum change to stretch their lead to 22."}
{"game_id": "0022100703", "chunk_id": "0022100703_010", "order": 10, "role": "body", "text": "P.J. Washington finally ended Charlotte's long-range drought when he knocked down a 3 with 5:38 left in the third quarter and quickly followed with a second. But Charlotte couldn't build on the momentum and the Hawks extended their lead to 27 in the fourth quarter behind Young, who finished 8 of 15 from beyond the arc."}
{"game_id": "0022100703", "chunk_id": "0022100703_011", "order": 11, "role": "body", "text": "“We couldn’t make shots,\" Hornets coach James Borrego. \"We move on, but we need to make shots.”"}
{"game_id": "0022100703", "chunk_id": "0022100703_012", "order": 12, "role": "body", "text": "The Hornets came into the game having won seven of their last eight games, and are fourth in the NBA in 3-point field-goal percentage."}
{"game_id": "0022100703", "chunk_id": "0022100703_013", "order": 13, "role": "body", "text": "“For the most part, I thought we did a good job of keeping the ball in front and closing out hard with urgency to the 3-point shooters,” Hawks coach Nate McMillan said."}
{"game_id": "0022100703", "chunk_id": "0022100703_015", "order": 15, "role": "body", "text": "There was a scary moment in the closing minutes of the fourth quarter when Hunter attacked from the baseline and was fouled in the air by Kelly Oubre Jr. and landed hard on the floor. The play was reviewed and Oubre was assessed a flagrant 2 foul and ejected from the game."}
{"game_id": "0022100703", "chunk_id": "0022100703_016", "order": 16, "role": "body", "text": "Hunter appeared to be injured at first, remaining on the court for more than a minute, but eventually got to his feet and stayed in the game."}
{"game_id": "0022100703", "chunk_id": "0022100703_017", "order": 17, "role": "body", "text": "After the game, McMillan said the side of Hunter's body was sore but he gave no indication of whether he might miss any time. The Hawks don't play again until Wednesday."}
{"game_id": "0022100703", "chunk_id": "0022100703_018", "order": 18, "role": "body", "text": "“He had ice on his shoulder and kind of that whole side,\" McMillan said. \"It’s too early to say if there is any concern. He was able to move around a little bit in the locker room and he was wrapped in ice.”"}
{"game_id": "0022100703", "chunk_id": "0022100703_020", "order": 20, "role": "body", "text": "Hawks: Bogdan Bogdanovic sat out with knee soreness. ... The Hawks outrebounded the Hornets 54-45."}
{"game_id": "0022100703", "chunk_id": "0022100703_021", "order": 21, "role": "body", "text": "Hornets: Gordon Hayward was downgraded to out before the game with what the team called “right foot discomfort.” ... Charlotte had 16 turnovers leading to 17 Atlanta points. ... Oubre was 1 of 9 on 3-pointers."}
{"game_id": "0022100703", "chunk_id": "0022100703_023", "order": 23, "role": "body", "text": "Hawks: Host Kings on Wednesday night."}
{"game_id": "0022100703", "chunk_id": "0022100703_024", "order": 24, "role": "body", "text": "Hornets: At Raptors on Tuesday night."}
