{"game_id": "0022100591", "chunk_id": "0022100591_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Even without their star point guard and their coach, the Memphis Grizzlies continued their dominant play."}
{"game_id": "0022100591", "chunk_id": "0022100591_002", "order": 2, "role": "body", "text": "Jaren Jackson Jr. scored 26 points, Desmond Bane added 23 and the Grizzlies tied a franchise record with their eighth straight win, beating the Los Angeles Clippers 123-108 on Saturday."}
{"game_id": "0022100591", "chunk_id": "0022100591_003", "order": 3, "role": "body", "text": "It is the fifth time in Memphis' history and first since 2015 it has won eight straight. The Grizzlies prevailed despite missing Ja Morant, who sat out due to left thigh soreness. They were also without coach Taylor Jenkins after he entered health and safety protocols."}
{"game_id": "0022100591", "chunk_id": "0022100591_004", "order": 4, "role": "body", "text": "“Our guys have stuck together. We figure it out as it goes along,” said assistant coach Brad Jones, who is handling duties in Jenkins' absence. “They believe in our system and each other. It’s really cool when players are talking about that and the coaches don’t have to.”"}
{"game_id": "0022100591", "chunk_id": "0022100591_005", "order": 5, "role": "body", "text": "Memphis has also won 11 of its last 12 road games, with the only loss during that stretch coming on Dec. 23 to Golden State."}
{"game_id": "0022100591", "chunk_id": "0022100591_006", "order": 6, "role": "body", "text": "It was Jackson's 13th game with at least 20 points this season. The 6-foot-11 frontcourt player, who came into the game sixth in the NBA in blocked shots, also tied a season high with five blocks."}
{"game_id": "0022100591", "chunk_id": "0022100591_007", "order": 7, "role": "body", "text": "“One of the great things about Jaren is that he’s very versatile. Steve Adams is a big part of us, but without him; Jaren got more minutes at the 5 today,\" Jones said. \"I really think that helps him offensively. It really causes problems for other teams. The Clippers struggled on how to handle him today.”"}
{"game_id": "0022100591", "chunk_id": "0022100591_008", "order": 8, "role": "body", "text": "The Grizzlies trailed by 12 late in the first quarter and were down 44-35 with 9:11 remaining in the second on Nicolas Batum's 3-pointer. The Grizzlies outscored the Clippers 31-12 the remainder of the first half."}
{"game_id": "0022100591", "chunk_id": "0022100591_009", "order": 9, "role": "body", "text": "Jackson had 10 points in the quarter for Memphis, which had runs of 16-4 during a three-minute span midway through the quarter and 8-0 at the end of the half."}
{"game_id": "0022100591", "chunk_id": "0022100591_010", "order": 10, "role": "body", "text": "“They went on a little run at the beginning. Then we woke up,” Jackson said. “We knew what we needed to do to beat them.”"}
{"game_id": "0022100591", "chunk_id": "0022100591_011", "order": 11, "role": "body", "text": "Marcus Morris Sr. had a season-high 29 points for the Clippers, who have dropped three straight and four of their last five to fall two games under .500 at 19-21. Reggie Jackson added 18."}
{"game_id": "0022100591", "chunk_id": "0022100591_012", "order": 12, "role": "body", "text": "Coach Tyron Lue said putting center on Ivica Zubac on Jackson was a tough matchup considering it was Zubac's first game back after missing the past four games due to health and safety protocols."}
{"game_id": "0022100591", "chunk_id": "0022100591_013", "order": 13, "role": "body", "text": "“We're asking him to come out to the perimeter and then the drive,” Lue said. “We tried to adjust and go small, but that hurt us on the glass. Their pace was too much. They were meeting the ball and attacking.”"}
{"game_id": "0022100591", "chunk_id": "0022100591_014", "order": 14, "role": "body", "text": "The Clippers jumped out to a 32-20 lead on Morris' 3-pointer with 2:52 remaining in the first quarter. Morris scored 13 and Jackson added 10 in the first as LA led 36-28 at the end of the period."}
{"game_id": "0022100591", "chunk_id": "0022100591_015", "order": 15, "role": "body", "text": "LA trailed by 14 late in the third quarter, but scored eight straight points to get back into the game. Memphis' Killian Tillie thwarted any hopes of a comeback though with a 3-pointer at the buzzer. That started a 13-2 Grizzlies spurt to put it out of reach."}
{"game_id": "0022100591", "chunk_id": "0022100591_016", "order": 16, "role": "body", "text": "“With the lineups switching always. I agree that our effort and physicality and coming out here feeling like we’re just getting pushed around,\" Reggie Jackson said. \"We’re going to have to get physical, we’re going to have to find ways to screen guys harder and do anything to keep guys off the offensive glass.”"}
{"game_id": "0022100591", "chunk_id": "0022100591_018", "order": 18, "role": "body", "text": "Grizzlies: Memphis has an NBA-best 10 double-digit comebacks this season. ... Dillon Brooks started but sustained an ankle injury during the first quarter and did not return. He scored two points in seven minutes. ... Brandon Clarke had 18 points and a career-high 14 rebounds off the bench, including a dunk off Jackson's alley-oop pass to make it 62-56. ... De’Anthony Melton had a career-best 11 rebounds off the bench."}
{"game_id": "0022100591", "chunk_id": "0022100591_019", "order": 19, "role": "body", "text": "Clippers: Ivica Zubac had eight points and seven rebounds in 19 minutes. He also collected his 2,000th career rebound during the second half."}
{"game_id": "0022100591", "chunk_id": "0022100591_021", "order": 21, "role": "body", "text": "Grizzlies: Remain in Los Angeles to face the Lakers Sunday night. Memphis is 4-3 in the second game of a back-to-back set."}
{"game_id": "0022100591", "chunk_id": "0022100591_022", "order": 22, "role": "body", "text": "Clippers: Host the Atlanta Hawks Sunday afternoon. LA is 1-5 on the back half of two-game sets."}
