{"game_id": "0022100767", "chunk_id": "0022100767_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Gary Trent Jr. scored 31 points, Pascal Siakam added 23 and the Toronto Raptors snapped Atlanta’s seven-game winning streak with a 106-100 victory on Monday night."}
{"game_id": "0022100767", "chunk_id": "0022100767_002", "order": 2, "role": "body", "text": "Trent, who has scored at least 30 points in four straight games, hit three 3s in the closing minutes of the third quarter, including a buzzer-beater. Then he connected early in the fourth to put the Raptors up 85-77. He finished with a career-high nine 3s."}
{"game_id": "0022100767", "chunk_id": "0022100767_003", "order": 3, "role": "body", "text": "“Coming into this summer, they talked to me about getting my jumper — it was good, but getting it to great,\" he said. “Getting a little quicker release. Just working, repetition. Believing in the coaching staff and what they're telling me. Just getting better day by day, week by week, month by month.\""}
{"game_id": "0022100767", "chunk_id": "0022100767_004", "order": 4, "role": "body", "text": "Fred VanVleet, who scored 16 and handed out 11 assists, got hot in the fourth, hitting consecutive 3s to push the lead to nine."}
{"game_id": "0022100767", "chunk_id": "0022100767_005", "order": 5, "role": "body", "text": "Kevin Huerter scored a team-high 26 points for the Hawks, who were without All-Star guard Trae Young. He was scratched with a right shoulder contusion, and ranks fifth in the NBA in scoring and third in assists."}
{"game_id": "0022100767", "chunk_id": "0022100767_006", "order": 6, "role": "body", "text": "Atlanta pulled within one on Onyeka Okongwu’s lay-in midway through the fourth and Bogdan Bogdanovich’s straightaway 3 with 1:52 remaining. Trent answered with a 3, and Bogdanovic made a corner 3 to make it 101-100."}
{"game_id": "0022100767", "chunk_id": "0022100767_007", "order": 7, "role": "body", "text": "OG Anunoby then shot a 3-pointer to put the Raptors up 104-100 with 20.1 seconds to go, and Toronto closed out the game."}
{"game_id": "0022100767", "chunk_id": "0022100767_008", "order": 8, "role": "body", "text": "“I thought their pressure bothered us,\" Hawks coach Nate McMillan said. “We didn't really get anything clean. We made some shots and were able to stay close, but I thought they established a presence with their defensive pressure pretty much all night long. And defensively for us, I thought we were back on our heels and they were in attack mode.\""}
{"game_id": "0022100767", "chunk_id": "0022100767_009", "order": 9, "role": "body", "text": "The Raptors were coming off arguably their biggest win of the season, a triple-overtime victory at Eastern Conference-leading Miami on Saturday. Coach Nick Nurse was mindful of the wear and tear on his starting five."}
{"game_id": "0022100767", "chunk_id": "0022100767_010", "order": 10, "role": "body", "text": "“I looked up and there was about 7½ (minutes) to go and kind of wondered if that group could make it the rest of the way, but I thought they were all contributing in different ways and the defense was pretty good,\" Nurse said. “There weren’t a lot of mistakes. It was really good defensive performance, I thought, by us in the second half.\""}
{"game_id": "0022100767", "chunk_id": "0022100767_011", "order": 11, "role": "body", "text": "The Raptors erased an 11-point deficit when Scottie Barnes converted a three-point play to make it 63-61 midway through the third. It was Toronto's first lead since it was 25-23."}
{"game_id": "0022100767", "chunk_id": "0022100767_012", "order": 12, "role": "body", "text": "Atlanta led 57-48 at halftime as Huerter scored 16 points, going 6 for 6 from the field and hitting three 3s."}
{"game_id": "0022100767", "chunk_id": "0022100767_014", "order": 14, "role": "body", "text": "Raptors: Siakam is one of five NBA players averaging 20 points, eight rebounds and five assists, joining Giannis Antetokounmpo, Luka Doncic, James Harden and Nikola Jokic. ... Barnes, who had seven points and six rebounds, leads all rookies with nine games of 20 points and five rebounds this season."}
{"game_id": "0022100767", "chunk_id": "0022100767_015", "order": 15, "role": "body", "text": "Hawks: F De’Andre Hunter was listed as probable with right ankle discomfort and finished with 17 points. ... The bench had outscored opponents 160-68 in the previous three games and outscored Toronto 41-12."}
{"game_id": "0022100767", "chunk_id": "0022100767_017", "order": 17, "role": "body", "text": "Nurse spent some time over the last couple of days lobbying his fellow NBA coaches to name VanVleet, the league’s minutes leader, as an All-Star reserve. VanVleet is averaging career highs of 21.7 points, seven assists and 4.7 rebounds."}
{"game_id": "0022100767", "chunk_id": "0022100767_018", "order": 18, "role": "body", "text": "“I think he’s had a great year, put in a different role with Kyle (Lowry) gone,” Nurse said. “It’s kind of his show to run with all the leadership and things. He’s historically had a huge impact for our team and organization as well. He’d be well-deserving.”"}
{"game_id": "0022100767", "chunk_id": "0022100767_020", "order": 20, "role": "body", "text": "Atlanta reserve center Okongwu had nine points and nine rebounds in 23 minutes. He was coming off Sunday’s win over the Lakers, in which he scored 12 of his 16 points in the fourth to go along with five rebounds and one steal in 22 minutes."}
{"game_id": "0022100767", "chunk_id": "0022100767_021", "order": 21, "role": "body", "text": "Okongwu, the sixth overall draft pick of 2020, has shown growth in his second year after returning from an ankle injury."}
{"game_id": "0022100767", "chunk_id": "0022100767_022", "order": 22, "role": "body", "text": "“He doesn’t say much,” McMillan said. “He just goes out and gets it done. He’s been bringing energy since last season when he got the opportunity and we were talking about starting him out with at least 10 minutes. He’s just playing and reacting to situations both offensively and defensively."}
{"game_id": "0022100767", "chunk_id": "0022100767_023", "order": 23, "role": "body", "text": "“You feel like you have a good one with this young player with some of the things that he’s doing.”"}
{"game_id": "0022100767", "chunk_id": "0022100767_025", "order": 25, "role": "body", "text": "In the win at Miami, Trent, Siakam, VanVleet, Anunoby and Barnes made the Raptors the fifth NBA team to have five players log 50 or more minutes and the first since Utah at Atlanta in a four-overtime game in 2012."}
{"game_id": "0022100767", "chunk_id": "0022100767_026", "order": 26, "role": "body", "text": "As a result, Nurse made Monday’s shootaround optional."}
{"game_id": "0022100767", "chunk_id": "0022100767_027", "order": 27, "role": "body", "text": "“Those guys did not go anywhere near the court today,” Nurse said. “I wouldn’t even let them get on the bus and come over. We’re trying to conserve as much as we can. I know a couple of them were appreciative of it for sure.”"}
{"game_id": "0022100767", "chunk_id": "0022100767_029", "order": 29, "role": "body", "text": "Raptors: Host Miami on Tuesday."}
{"game_id": "0022100767", "chunk_id": "0022100767_030", "order": 30, "role": "body", "text": "Hawks: Host Phoenix on Thursday."}
