{"game_id": "0022100925", "chunk_id": "0022100925_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — DeAaron Fox had 29 points and 10 assists, and the Sacramento Kings rolled past the Oklahoma City Thunder 131-110 on Monday night."}
{"game_id": "0022100925", "chunk_id": "0022100925_002", "order": 2, "role": "body", "text": "Trey Lyles scored 24 points and Harrison Barnes scored 23 for the Kings. Domantas Sabonis added 14 points, 16 rebounds and seven assists for Sacramento, which snapped a four-game losing streak."}
{"game_id": "0022100925", "chunk_id": "0022100925_003", "order": 3, "role": "body", "text": "The Kings made 56.3% of their attempts from the field."}
{"game_id": "0022100925", "chunk_id": "0022100925_004", "order": 4, "role": "body", "text": "“I just thought overall, we did a good job of playing with pace,\" Kings interim coach Alvin Gentry said. “We did a good job of passing up a good shot and creating a great shot.”"}
{"game_id": "0022100925", "chunk_id": "0022100925_005", "order": 5, "role": "body", "text": "Lyles excelled in his first start with the Kings since being traded from the Detroit Pistons."}
{"game_id": "0022100925", "chunk_id": "0022100925_006", "order": 6, "role": "body", "text": "“He’s mobile, he can shoot the ball, put it on the floor,\" Fox said. \"He can do whatever we need him to do. He did a great job of that tonight. Looking forward, that’s something that we really expect out of him.”"}
{"game_id": "0022100925", "chunk_id": "0022100925_007", "order": 7, "role": "body", "text": "Oklahoma City's Shai Gilgeous-Alexander had his third consecutive game with at least 30 points since returning from a sprained right ankle, scoring 37 points and dishing out 10 assists."}
{"game_id": "0022100925", "chunk_id": "0022100925_008", "order": 8, "role": "body", "text": "Gentry said he thought the Kings did a good job of guarding Gilgeous-Alexander, but he still put up big numbers."}
{"game_id": "0022100925", "chunk_id": "0022100925_009", "order": 9, "role": "body", "text": "“He’s very slippery or crafty or whatever word you want to use, as far as his drives and creating contact and getting to the line,” Gentry said. \"I just think it’s the experience of being in the league for a few years. Now he’s got it figured out where he can go and how he can get his shots. I will be shocked if he’s not on the All-Star team in the next year or so.”"}
{"game_id": "0022100925", "chunk_id": "0022100925_010", "order": 10, "role": "body", "text": "Thunder starters Josh Giddey (hip) and Lu Dort (left shoulder) missed the game."}
{"game_id": "0022100925", "chunk_id": "0022100925_011", "order": 11, "role": "body", "text": "The score was tied at 59 at halftime, and Gilgeous-Alexander had 19 points and eight assists before the break."}
{"game_id": "0022100925", "chunk_id": "0022100925_012", "order": 12, "role": "body", "text": "The Thunder opened the second half on a 9-0 run to go up 68-59, but the Kings rallied and led 99-90 at the end of the third quarter. Sabonis and Lyles both were 4 of 4 on shots and scored eight points each in the third quarter to help the Kings score 40 points in the period."}
{"game_id": "0022100925", "chunk_id": "0022100925_013", "order": 13, "role": "body", "text": "Oklahoma City cut Sacramento's lead to 102-96 early in the fourth quarter before the Kings took control for good."}
{"game_id": "0022100925", "chunk_id": "0022100925_014", "order": 14, "role": "body", "text": "“I just thought that we handled our business the way that we should have, especially in the second half and especially in the third quarter,\" Gentry said."}
{"game_id": "0022100925", "chunk_id": "0022100925_016", "order": 16, "role": "body", "text": "Kings: Shot 55% from the field in the first quarter for a 35-32 lead, despite allowing the Thunder to shoot 60%. ... G Donte Divincenzo scored 14 points in 22 minutes as a reserve. ... Fox's 10 assists matched a season high."}
{"game_id": "0022100925", "chunk_id": "0022100925_017", "order": 17, "role": "body", "text": "Thunder: F Aaron Wiggins went down with a right ankle injury in the second quarter and was helped off the court. He did not return. ... Rookie G Olivier Sarr scored a career-high 12 points. He's on a two-way contract. ... Gilgeous-Alexander committed his fifth foul in the third quarter but did not foul out. ... Isaiah Roby did foul out; he had eight points and four rebounds in 20 minutes."}
{"game_id": "0022100925", "chunk_id": "0022100925_019", "order": 19, "role": "body", "text": "Gilgeous-Alexander is averaging 35 points on 61.3% shooting from the field in three games since the All-Star break. He is averaging 6.7 assists and 5.7 rebounds."}
{"game_id": "0022100925", "chunk_id": "0022100925_020", "order": 20, "role": "body", "text": "“I’m just playing my game,\" he said. \"I think as the season’s gone on, I’ve gotten into a little rhythm. My cardio’s gotten a lot better. Ultimately, it’s feeling more comfortable.”"}
{"game_id": "0022100925", "chunk_id": "0022100925_022", "order": 22, "role": "body", "text": "“He doesn’t really move fast, it’s just his pace. It’s crazy how he blows by defenders but he’s not moving fast. It seemed like they got him beat to a spot, but he’s always got a counter move and he’s always getting to the rim.” — Thunder guard Tre Mann on Gilgeous-Alexander"}
{"game_id": "0022100925", "chunk_id": "0022100925_024", "order": 24, "role": "body", "text": "Kings: At the New Orleans Pelicans on Wednesday."}
{"game_id": "0022100925", "chunk_id": "0022100925_025", "order": 25, "role": "body", "text": "Thunder: At the Denver Nuggets on Wednesday."}
{"game_id": "0022100925", "chunk_id": "0022100925_027", "order": 27, "role": "body", "text": "Follow Cliff Brunt on Twitter: https://twitter.com/CliffBruntAP"}
