{"game_id": "0022101030", "chunk_id": "0022101030_001", "order": 1, "role": "lead", "text": "Orlando, Fla. -- — Kyrie Irving made it two nights in a row with a 60-point scorer in the NBA."}
{"game_id": "0022101030", "chunk_id": "0022101030_002", "order": 2, "role": "body", "text": "A 41-point first half hadn't been seen in almost two decades."}
{"game_id": "0022101030", "chunk_id": "0022101030_003", "order": 3, "role": "body", "text": "“It just shows you we’re on our way to history,” Irving said."}
{"game_id": "0022101030", "chunk_id": "0022101030_004", "order": 4, "role": "body", "text": "Irving scored a career-high 60 points, most in the Nets’ NBA history, to lead Brooklyn to a 150-108 victory over the Orlando Magic on Tuesday night."}
{"game_id": "0022101030", "chunk_id": "0022101030_005", "order": 5, "role": "body", "text": "Irving shot 20 for 31, including 8 of 12 on 3-pointers, in 35 minutes. He made 12 of 13 free throws in matching the highest-scoring game in the NBA this season, done just a night earlier by Minnesota’s Karl-Anthony Towns against San Antonio."}
{"game_id": "0022101030", "chunk_id": "0022101030_006", "order": 6, "role": "body", "text": "“The night after Karl Towns had an incredible performance, and then to have Kyrie do it the next night, the league is in an amazing place right now,” teammate Kevin Durant said. “We’re seeing a lot of talent displayed every night, and this was one of the elite ones.”"}
{"game_id": "0022101030", "chunk_id": "0022101030_007", "order": 7, "role": "body", "text": "Irving and Durant became the first teammates in NBA history to post 50-point performances in consecutive games. Durant scored 53 points in a win against the New York Knicks on Sunday."}
{"game_id": "0022101030", "chunk_id": "0022101030_008", "order": 8, "role": "body", "text": "Irving scored 41 points in the first half, the most in the first two quarters since Kobe Bryant had 42 against Washington on March 28, 2003."}
{"game_id": "0022101030", "chunk_id": "0022101030_009", "order": 9, "role": "body", "text": "“It was just about the team really, just getting in the flow,” he said. “That's the true purity of this game, doing it efficiently on both ends of the floor and coming out with a W.”"}
{"game_id": "0022101030", "chunk_id": "0022101030_010", "order": 10, "role": "body", "text": "The guard left the game after hitting a long 3-pointer with 8:33 remaining and Brooklyn leading 128-94."}
{"game_id": "0022101030", "chunk_id": "0022101030_011", "order": 11, "role": "body", "text": "Playing in only his 19th game of the season because he isn't eligible to play home games because of New York City's mandate requiring vaccination against COVID-19, Irving reached the 50-point mark by spinning a layup off the glass with 5:02 left in the third quarter."}
{"game_id": "0022101030", "chunk_id": "0022101030_012", "order": 12, "role": "body", "text": "“A few shots I probably shouldn't have taken. Tough ones, with double-teams and triple-teams coming,” he said. “But as long as I can do it with a smile on my face and my teammates weren't too angry with me, it was worthwhile.”"}
{"game_id": "0022101030", "chunk_id": "0022101030_013", "order": 13, "role": "body", "text": "It marked the sixth 50-point game of Irving's NBA career and the 16th 50-point game in the league this season, including two apiece by Irving, Durant, LeBron James of the Los Angeles Lakers and Boston's Jayson Tatum."}
{"game_id": "0022101030", "chunk_id": "0022101030_014", "order": 14, "role": "body", "text": "He went on to pass Deron Williams' Nets record of 57 points. Irving has four 40-point games with the Nets and Durant has two."}
{"game_id": "0022101030", "chunk_id": "0022101030_015", "order": 15, "role": "body", "text": "Irving scored 50 points last Tuesday in a 132-121 win at Charlotte. His previous career high was 57 points for Cleveland at San Antonio on March 3, 2015."}
{"game_id": "0022101030", "chunk_id": "0022101030_016", "order": 16, "role": "body", "text": "Irving had 16 points and three assists in the Nets' 48-point first quarter, in which they shot 74% (20 for 27) including 5 of 6 on 3s."}
{"game_id": "0022101030", "chunk_id": "0022101030_017", "order": 17, "role": "body", "text": "“When a guy has a game going like that, there's nothing he can do wrong,” said center Andre Drummond. “He was rolling, so it was fun to watch.”"}
{"game_id": "0022101030", "chunk_id": "0022101030_018", "order": 18, "role": "body", "text": "The Nets led 86-56 after Irving's 41-point first half. He was 14 for 19."}
{"game_id": "0022101030", "chunk_id": "0022101030_019", "order": 19, "role": "body", "text": "“There's times he's shooting over two people,” said Magic coach Jamahl Mosley. “You try to double-team him, he's smart enough to know when to go and when not to go. He's fast in transition so you can't speed up and try to deny him. They're setting backscreens. He's crafty enough and he's seen every coverage and he knows how to play with a pace. That makes it hard.”"}
{"game_id": "0022101030", "chunk_id": "0022101030_020", "order": 20, "role": "body", "text": "Durant added 19 points in the Nets’ fourth straight win."}
{"game_id": "0022101030", "chunk_id": "0022101030_021", "order": 21, "role": "body", "text": "Cole Anthony had 19 points and seven assists for Orlando."}
{"game_id": "0022101030", "chunk_id": "0022101030_023", "order": 23, "role": "body", "text": "Nets: Brooklyn shot 16 for 27 from 3-point range, with Patty Mills hitting 5 of 7. . . . G Cam Thomas (back contusion) did not play, and G Seth Curry (left ankle) missed a second straight game. Coach Steve Nash said both players might be available Wednesday night against Dallas. ... The Nets won three of four against the Magic this season. Neither Durant nor Irving played in the loss."}
{"game_id": "0022101030", "chunk_id": "0022101030_024", "order": 24, "role": "body", "text": "Magic: G Jalen Suggs did not play for the third time in five games after re-injuring his right ankle on Sunday night. ... The Magic announced that F Jonathan Isaac will not play this season, marking the second straight season Isaac has missed entirely since tearing his left ACL on Aug. 2, 2020."}
{"game_id": "0022101030", "chunk_id": "0022101030_026", "order": 26, "role": "body", "text": "Nets: Play at home Wednesday night against Dallas."}
{"game_id": "0022101030", "chunk_id": "0022101030_027", "order": 27, "role": "closing", "text": "Magic: Play at home Thursday night against Detroit."}
