{"game_id": "0022100885", "chunk_id": "0022100885_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Kyle Lowry scored 12 of his 25 points after regulation and the Miami Heat entered the All-Star break tied for the Eastern Conference lead, rallying to beat the Charlotte Hornets 111-107 in double overtime Thursday night."}
{"game_id": "0022100885", "chunk_id": "0022100885_002", "order": 2, "role": "body", "text": "Duncan Robinson added 21 points for Miami, and Jimmy Butler overcame a horrendous shooting night to make two clutch jumpers in the second overtime period and finish with 15 points, 10 rebounds and eight assists."}
{"game_id": "0022100885", "chunk_id": "0022100885_003", "order": 3, "role": "body", "text": "Miami has won six of its last seven games, tying the Chicago Bulls for the best record in the East at 38-21."}
{"game_id": "0022100885", "chunk_id": "0022100885_004", "order": 4, "role": "body", "text": "“It’s been fun,\" Lowry said the team's play. “We have a great group and a bunch of guys who want to win games.”"}
{"game_id": "0022100885", "chunk_id": "0022100885_005", "order": 5, "role": "body", "text": "Butler celebrated an exhausting win by sipping on a Michelob Ultra at the podium while sitting alongside Lowry and Bam Adebayo."}
{"game_id": "0022100885", "chunk_id": "0022100885_006", "order": 6, "role": "body", "text": "“I felt great,” Butler said. “A dub is a dub.”"}
{"game_id": "0022100885", "chunk_id": "0022100885_007", "order": 7, "role": "body", "text": "Added Adebayo: “We have been playing great basketball and we are number one in the East, so I can't be too mad.”"}
{"game_id": "0022100885", "chunk_id": "0022100885_008", "order": 8, "role": "body", "text": "Miles Bridges had 29 points and 11 rebounds for Charlotte, and LaMelo Ball added 14 points, 14 assists and 10 rebounds before fouling out in the second overtime. The Hornets limped into the All-Star break having lost eight of its last nine games to fall to 29-31. Montrezl Harrell added 24 points and eight rebounds off the bench."}
{"game_id": "0022100885", "chunk_id": "0022100885_009", "order": 9, "role": "body", "text": "“Yeah, we need this (break),\" Hornets coach James Borrego said. \"It will be great for us, get away from everything and just refresh and get ready for that final stretch run. Try to get some healthy bodies and get guys back and ready to go.”"}
{"game_id": "0022100885", "chunk_id": "0022100885_010", "order": 10, "role": "body", "text": "The Heat trailed by 14 after Harrell scored seven straight points to open the fourth quarter."}
{"game_id": "0022100885", "chunk_id": "0022100885_011", "order": 11, "role": "body", "text": "But Miami pulled back to tie it behind three 3s from Robinson and had a chance to win it in regulation, but Butler’s jump shot bounds away."}
{"game_id": "0022100885", "chunk_id": "0022100885_012", "order": 12, "role": "body", "text": "Both teams had a chance to win it in the first overtime."}
{"game_id": "0022100885", "chunk_id": "0022100885_013", "order": 13, "role": "body", "text": "With Charlotte trailing by one, Harrell was fouled in the paint with 1.7 seconds left. He made the first to tie the game, but the Hornets newcomer missed the second. Miami called timeout to set up a play for Butler, but his corner 3 was partially deflected by P.J. Washington."}
{"game_id": "0022100885", "chunk_id": "0022100885_014", "order": 14, "role": "body", "text": "In the second overtime, Miami led by three when Ball fouled out with 2:10 left."}
{"game_id": "0022100885", "chunk_id": "0022100885_015", "order": 15, "role": "body", "text": "That’s when Butler, who was just 3 of 22 from the field at the time, buried a mid-range jumper and a 3-pointer to give the Heat some breathing room. Charlotte rallied to cut the lead to two behind two big plays from Bridges, but Lowry scored on a backdoor layup and Adebayo blocked Kelly Oubre’s 3-point attempt to seal the win."}
{"game_id": "0022100885", "chunk_id": "0022100885_016", "order": 16, "role": "body", "text": "“I always have to stay aggressive,” said Butler, who finished 5 of 24 from the field."}
{"game_id": "0022100885", "chunk_id": "0022100885_018", "order": 18, "role": "body", "text": "The Hornets coaching staff was upset that officials never stopped the game to review a made step-back 3-pointer by Lowry in the first overtime period. Replays clearly showed that Lowry's foot was on the line and that he should have been credited with two points."}
{"game_id": "0022100885", "chunk_id": "0022100885_019", "order": 19, "role": "body", "text": "Because the 3-pointer came in overtime, officials on the court would have had to ask for a review rather than the league office in New York reviewing it and changing the score."}
{"game_id": "0022100885", "chunk_id": "0022100885_020", "order": 20, "role": "body", "text": "Borrego said he never got an explanation from the officials."}
{"game_id": "0022100885", "chunk_id": "0022100885_021", "order": 21, "role": "body", "text": "“Unfortunately, we did not have doubt at this time, which is the reason we didn’t stop the play,\" crew chief Sean Wright said on the pool report after the game when asked why Lowry's 3-pointer wasn’t reviewed."}
{"game_id": "0022100885", "chunk_id": "0022100885_022", "order": 22, "role": "body", "text": "“That was a 3, I don’t know what you’re talking about,” Lowry deadpanned after the game."}
{"game_id": "0022100885", "chunk_id": "0022100885_024", "order": 24, "role": "body", "text": "The made 3-pointer on Robinson’s four-point play in the fourth quarter was the 700th of his NBA career, making him the fastest player to reach that total in terms of games played."}
{"game_id": "0022100885", "chunk_id": "0022100885_026", "order": 26, "role": "body", "text": "Heat: Played without Tyler Herro, Dewayne Dedmon and Caleb Martin."}
{"game_id": "0022100885", "chunk_id": "0022100885_027", "order": 27, "role": "body", "text": "Hornets: Gordon Hayward, Jalen McDaniels and Cody Martin remained out with injuries. ... Shot 10 of 42 from 3-point range."}
{"game_id": "0022100885", "chunk_id": "0022100885_029", "order": 29, "role": "body", "text": "Heat: At New York on Friday, Feb. 25."}
{"game_id": "0022100885", "chunk_id": "0022100885_030", "order": 30, "role": "body", "text": "Hornets: Host Toronto on Friday, Feb. 25."}
