{"game_id": "0022100269", "chunk_id": "0022100269_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Terry Rozier scored 27 points and Kelly Oubre Jr. came off the bench with 21 points and six rebounds Wednesday night to help the Charlotte Hornets overcome poor shooting in a 106-99 victory over the Orlando Magic."}
{"game_id": "0022100269", "chunk_id": "0022100269_002", "order": 2, "role": "body", "text": "LaMelo Ball had 22 points for the Hornets, who won for the seventh time in eight games."}
{"game_id": "0022100269", "chunk_id": "0022100269_003", "order": 3, "role": "body", "text": "The Hornets shot only 42% and played from behind for most of the game until the bench sparked a 15-0 run near the conclusion of the third quarter."}
{"game_id": "0022100269", "chunk_id": "0022100269_004", "order": 4, "role": "body", "text": "“The identity of a winning team is to find different ways to win every night,” said Charlotte coach James Borrego. “It was a different script tonight, and different guys stepped up for us.”"}
{"game_id": "0022100269", "chunk_id": "0022100269_005", "order": 5, "role": "body", "text": "Oubre and Cody Martin were the key players in the decisive run."}
{"game_id": "0022100269", "chunk_id": "0022100269_006", "order": 6, "role": "body", "text": "Mo Bamba had 18 points and 12 rebounds for Orlando. Rookie Jalen Suggs had 17 points and six assists in the Magic's fourth straight loss. Wendell Carter Jr. added 14 points and 11 rebounds."}
{"game_id": "0022100269", "chunk_id": "0022100269_007", "order": 7, "role": "body", "text": "Rozier, coming of a 32-point game at Washington on Monday night in which he shot 8 of 11 from 3-point range, hit only 3 of 11 from behind the arc in this one. The Hornets, who came into the game as the No. 2 3-point shooting team in the NBA, made only 12 of 41 (29%)."}
{"game_id": "0022100269", "chunk_id": "0022100269_008", "order": 8, "role": "body", "text": "The Hornets fell behind while missing 12 of their first 13 shots, but rallied behind Ball, Rozier and Oubre to lead 52-49 at halftime."}
{"game_id": "0022100269", "chunk_id": "0022100269_009", "order": 9, "role": "body", "text": "Orlando had regained a seven-point lead before Oubre and Martin sparked the run of 15 straight points that put the Hornets back in charge for keeps. Martin blocked Bamba's 3-point attempt and set up Oubre for a dunk, then completed Charlotte's spurt with a driving dunk for an 82-74 lead."}
{"game_id": "0022100269", "chunk_id": "0022100269_010", "order": 10, "role": "body", "text": "“We came in with a lot of energy. We wanted to get stops,” Oubre said of the Hornets bench, which had 22 rebounds and six blocks. “Defense is bread and butter to me. I came into the league being a defensive player, and when I turn defense into offense, I think everything opens up for me.”"}
{"game_id": "0022100269", "chunk_id": "0022100269_011", "order": 11, "role": "body", "text": "The Magic, who shot 41% overall, went scoreless for more than four minutes before Franz Wagner beat the third-quarter buzzer with a 3-pointer."}
{"game_id": "0022100269", "chunk_id": "0022100269_012", "order": 12, "role": "body", "text": "Martin contributed five rebounds, six assists, two steals and two blocked in 28 minutes."}
{"game_id": "0022100269", "chunk_id": "0022100269_013", "order": 13, "role": "body", "text": "“Every time he's out there he impacts winning,” Borrego said. “He's a major part of what we're trying to do here.”"}
{"game_id": "0022100269", "chunk_id": "0022100269_014", "order": 14, "role": "body", "text": "Magic coach Jamahl Mosley took some consolation in the floor play of Suggs."}
{"game_id": "0022100269", "chunk_id": "0022100269_015", "order": 15, "role": "body", "text": "But Suggs didn't like the look of the Magic's defense in the second half of his 18th NBA game."}
{"game_id": "0022100269", "chunk_id": "0022100269_016", "order": 16, "role": "body", "text": "“Guys are just coming in here against us and being too comfortable,” he said. “I think they were able to run free, come down the lane with no resistance and things like that. I think we showed great things tonight, but we also have things to work on.”"}
{"game_id": "0022100269", "chunk_id": "0022100269_018", "order": 18, "role": "body", "text": "Hornets: F P.J. Washington played six scoreless minutes after missing 10 games with a hyperextended left elbow. .... The Hornets are 57-55 all-time against Orlando."}
{"game_id": "0022100269", "chunk_id": "0022100269_019", "order": 19, "role": "body", "text": "Magic: G Cole Anthony, Orlando's leading scorer, missed his third game with an ankle injury and is not likely to play Friday night. ... The Magic (4-15) have won once at home this season, and twice at New York's Madison Square Garden. . . . GG Gary Harris got his third start after missing a game with a sprained right hand . ... F Terrence Ross was a late scratch with back spasms."}
{"game_id": "0022100269", "chunk_id": "0022100269_021", "order": 21, "role": "body", "text": "Ball had the game's most visible blunder, blowing an easy score by turning a layup into a missed dunk in the second quarter, then promptly picking up his third foul and taking a seat on the bench. “Obviously that play, we'll talk about it,” Borrego said. “He knows it, he owns it and we'll move forward. ... Just another growth opportunity for him.”"}
{"game_id": "0022100269", "chunk_id": "0022100269_023", "order": 23, "role": "body", "text": "Hornets: Play at home against Minnesota on Friday night."}
{"game_id": "0022100269", "chunk_id": "0022100269_024", "order": 24, "role": "closing", "text": "Magic: Play at home against Chicago on Friday night."}
