{"game_id": "0022101033", "chunk_id": "0022101033_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — LaMelo Ball had 22 points, 11 assists and eight rebounds, P.J. Washington scored 13 of his 16 points in the fourth quarter and the Charlotte Hornets defeated the Atlanta Hawks 116-106 on Wednesday night for their third straight win."}
{"game_id": "0022101033", "chunk_id": "0022101033_002", "order": 2, "role": "body", "text": "Montrezl Harrell brought energy off the bench with 20 points and Terry Rozier and Miles Bridges each had 18 points for Charlotte."}
{"game_id": "0022101033", "chunk_id": "0022101033_003", "order": 3, "role": "body", "text": "The Hornets entered the night a half-game behind the ninth-place Hawks in the Eastern Conference but vaulted ahead of their division foes to get back to .500 on the season."}
{"game_id": "0022101033", "chunk_id": "0022101033_004", "order": 4, "role": "body", "text": "“It was a huge (win), definitely huge for us,” Washington said. “We showed we can do it. If we play like that it will be tough for teams to beat us.”"}
{"game_id": "0022101033", "chunk_id": "0022101033_005", "order": 5, "role": "body", "text": "Clint Capella had 17 points and 15 rebounds for the Hawks, who had their three-game win streak snapped. Trae Young had 15 assists but was held to a season-low nine points on 3-of-12 shooting and the Hornets doubled-team him whenever possible."}
{"game_id": "0022101033", "chunk_id": "0022101033_006", "order": 6, "role": "body", "text": "“We made the game very difficult for him,” Harrell said. “... We knew that he is the guy who makes them go. Stats show that if he scores more than 30 points they generally win.”"}
{"game_id": "0022101033", "chunk_id": "0022101033_007", "order": 7, "role": "body", "text": "Said Hornets coach James Borrego: “We used our length, size and physicality and we made it tough on Trae. He is a heck of a player and getting him out of the pick and roll, we went through probably three or four iterations tonight to make him think on the fly.\""}
{"game_id": "0022101033", "chunk_id": "0022101033_008", "order": 8, "role": "body", "text": "The Hawks and Hornets entered the fourth quarter tied at 85 in a game in which neither team led by more than eight points through the first three quarters."}
{"game_id": "0022101033", "chunk_id": "0022101033_009", "order": 9, "role": "body", "text": "But the Hornets started to pull away late after going with a “small-ball” lineup, using the 6-foot-7 Washington at the 5 spot — something they have done in past years but haven't used much this year."}
{"game_id": "0022101033", "chunk_id": "0022101033_010", "order": 10, "role": "body", "text": "Borrego's late fourth-quarter move, which featured Washington on pick and pops, paid off."}
{"game_id": "0022101033", "chunk_id": "0022101033_011", "order": 11, "role": "body", "text": "Washington stepped out to knock down a 3-pointer from the top of the key and Rozier followed with an off-balance 3 from the right wing to beat the shot clock and give the Hornets a 105-98 lead with 3:06 left in the game."}
{"game_id": "0022101033", "chunk_id": "0022101033_012", "order": 12, "role": "body", "text": "Washington then scored an old-fashioned three-point play off a pick-and-roll pass from Ball to give Charlotte a double-digit lead. Washington drilled another 3 to push the lead to 11 and then got free underneath for a dunk off a pass from Bridges to put the final touches on the win."}
{"game_id": "0022101033", "chunk_id": "0022101033_013", "order": 13, "role": "body", "text": "Borrego said he hasn't used the small-ball lineup much this season because Mason Plumlee, who had 12 points and 10 rebounds, and Harrell have been playing well."}
{"game_id": "0022101033", "chunk_id": "0022101033_014", "order": 14, "role": "body", "text": "“He’s a matchup problem when we go small ball,” Borrego said of Washington."}
{"game_id": "0022101033", "chunk_id": "0022101033_015", "order": 15, "role": "body", "text": "“We was capable of doing that,” Hawks coach Nate McMillan said. \"We didn’t get out quick enough, and we didn’t get out to the shooters, and they basically just ran a pick-and-pop game and he was able to knock down some shots.”"}
{"game_id": "0022101033", "chunk_id": "0022101033_016", "order": 16, "role": "body", "text": "Washington's eruption came after he missed a dunk earlier in the second half."}
{"game_id": "0022101033", "chunk_id": "0022101033_019", "order": 19, "role": "body", "text": "Charlotte's Mason Plumlee has been struggling so much from the foul line that the 7-foot center has switched to shooting his free throws left-handed. Plumlee air-balled his first attempt but then returned to the line later in the second quarter and made back-to-back free throws as the crowd erupted in cheers."}
{"game_id": "0022101033", "chunk_id": "0022101033_020", "order": 20, "role": "body", "text": "Plumlee is shooting 36.4% from the foul line, well below his career average of 58.3%."}
{"game_id": "0022101033", "chunk_id": "0022101033_022", "order": 22, "role": "body", "text": "Hawks: Were outscored 60-48 in the paint."}
{"game_id": "0022101033", "chunk_id": "0022101033_023", "order": 23, "role": "body", "text": "Hornets: Miles Bridges scored 18 points for Charlotte — all in the first half."}
{"game_id": "0022101033", "chunk_id": "0022101033_025", "order": 25, "role": "body", "text": "Hawks: Host Grizzlies on Friday night"}
{"game_id": "0022101033", "chunk_id": "0022101033_026", "order": 26, "role": "body", "text": "Hornets: Host Mavericks on Saturday night."}
