{"game_id": "0022100168", "chunk_id": "0022100168_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Phoenix Suns forward Frank Kaminsky bested his career high in points with a very Kaminsky-esque move, faking out Portland's Norman Powell with a smooth up and under that he finished with a finger roll at the rim."}
{"game_id": "0022100168", "chunk_id": "0022100168_002", "order": 2, "role": "body", "text": "From bench to beast, the big man's rise in the playing rotation might become a regular occurance."}
{"game_id": "0022100168", "chunk_id": "0022100168_003", "order": 3, "role": "body", "text": "Kaminsky finished with 31 points, Chris Paul added 21 and the Suns beat the Trail Blazers 119-109 on Wednesday night for their sixth straight victory."}
{"game_id": "0022100168", "chunk_id": "0022100168_004", "order": 4, "role": "body", "text": "The 7-foot Kaminsky continued a stellar stretch of play, making up for the recent absence of injured starter Deandre Ayton. The 28-year-old former Wisconsin star has at least 10 points in four of the past five games and was at his best Wednesday, making 12 of 18 shots and grabbing seven rebounds."}
{"game_id": "0022100168", "chunk_id": "0022100168_005", "order": 5, "role": "body", "text": "“I still don't think it's really hit me yet,” Kaminsky. “But it's just a mindset. Go out there, play as hard as you can, be ready for anything. You never know when your opportunities are going to come so you've got to make the most of them.”"}
{"game_id": "0022100168", "chunk_id": "0022100168_006", "order": 6, "role": "body", "text": "The big man also grabbed an offensive rebound with about 2:25 left and fired to Mikal Bridges in the corner, who hit a 3-pointer that gave the Suns an insurmountable 10-point lead. It's not a total shock when Kaminsky plays well: He was the No. 9 overall pick in 2015 and averaged about 11 points per game during his second and third seasons."}
{"game_id": "0022100168", "chunk_id": "0022100168_007", "order": 7, "role": "body", "text": "Paul said he wasn't surprised by Kaminsky's big night: “He just knows how to play.”"}
{"game_id": "0022100168", "chunk_id": "0022100168_008", "order": 8, "role": "body", "text": "Suns coach Monty Williams acknowledged that Kaminsky's been so good over the past couple weeks that it's his job to find a spot for him in the rotation, even with Ayton returns."}
{"game_id": "0022100168", "chunk_id": "0022100168_009", "order": 9, "role": "body", "text": "“He's not just out there,\" Williams said. “He's doing a lot of stuff.”"}
{"game_id": "0022100168", "chunk_id": "0022100168_010", "order": 10, "role": "body", "text": "The Suns improved to 7-3. They led the entire second half, though Portland cut the lead to six midway through the fourth quarter. Phoenix's Jae Crowder made a couple of 3-pointers in the fourth that helped keep the Trail Blazers from getting too close."}
{"game_id": "0022100168", "chunk_id": "0022100168_011", "order": 11, "role": "body", "text": "Damian Lillard led Portland with 28 points and gamely kept his team in it with some late baskets in the fourth quarter. But every time he'd score, the Suns had an answer. Powell scored 23 points for the Blazers. C.J. McCollum added 18."}
{"game_id": "0022100168", "chunk_id": "0022100168_012", "order": 12, "role": "body", "text": "Blazers coach Chauncey Billups said his team played hard, but there were too many mistakes."}
{"game_id": "0022100168", "chunk_id": "0022100168_013", "order": 13, "role": "body", "text": "“You know how hard it is to win on the road in this league,” Billups said. “If you don't play from the neck up a little bit, it makes it tough.”"}
{"game_id": "0022100168", "chunk_id": "0022100168_014", "order": 14, "role": "body", "text": "The Blazers have lost five of their last seven."}
{"game_id": "0022100168", "chunk_id": "0022100168_015", "order": 15, "role": "body", "text": "The Suns pushed to a 60-47 lead by halftime. Kaminsky poured in 18 points before the break, shooting 6 of 11 from the field and 5 of 5 on free throws. Paul added 10 points."}
{"game_id": "0022100168", "chunk_id": "0022100168_017", "order": 17, "role": "body", "text": "The Suns are playing their best basketball of the season as a tough stretch looms. Seven of the next 10 games are on the road."}
{"game_id": "0022100168", "chunk_id": "0022100168_018", "order": 18, "role": "body", "text": "“I feel like our team is definitely on the incline when it comes to just being in shape and not playing in the mud and being fatigued,” Crowder said. “It's coming together and there's a tough month ahead of us.”"}
{"game_id": "0022100168", "chunk_id": "0022100168_020", "order": 20, "role": "body", "text": "Trail Blazers: Backup guard Tony Snell was playing on his 30th birthday. He finished with no points and two rebounds in eight minutes. ... Larry Nance Jr. scored 13 points off the bench."}
{"game_id": "0022100168", "chunk_id": "0022100168_021", "order": 21, "role": "body", "text": "Suns: Ayton didn't play for a third straight game because of a right leg contusion. Coach Monty Williams said Ayton had been on the court some during practice but there was no immediate timetable for his return. ... G Landry Shamet missed the game with a right foot contusion. ... All five starters scored at least 10 points. JaVale McGee had 14 points and eight rebounds in just 16 minutes. Devin Booker and Crowder each added 12 points."}
{"game_id": "0022100168", "chunk_id": "0022100168_023", "order": 23, "role": "body", "text": "Trail Blazers: At Houston on Friday night."}
{"game_id": "0022100168", "chunk_id": "0022100168_024", "order": 24, "role": "body", "text": "Suns: At Memphis on Friday night."}
