{"game_id": "0022100554", "chunk_id": "0022100554_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Ja Morant scored 36 points and five Grizzlies scored in double figures as Memphis extended its winning streak to five games with a 118-104 win over the Brooklyn Nets on Monday night."}
{"game_id": "0022100554", "chunk_id": "0022100554_002", "order": 2, "role": "body", "text": "Desmond Bane scored 29 points, Brandon Clarke added 16, and Jarrett Culver and Tyus Jones had 12 apiece."}
{"game_id": "0022100554", "chunk_id": "0022100554_003", "order": 3, "role": "body", "text": "“Since I (came) here, I've been saying we deserve more respect,” Morant said. “The stuff we're doing now, obviously that recognition and everything will come.”"}
{"game_id": "0022100554", "chunk_id": "0022100554_004", "order": 4, "role": "body", "text": "Kevin Durant led the Nets with 26 points on 8-for-24 shooting from the field, including 2 for 8 from 3-point range. James Harden added 19 points on 5-for-14 shooting. Nic Claxton added 11 points and Blake Griffin and Bruce Brown each finished with 10 points as Brooklyn lost its third straight."}
{"game_id": "0022100554", "chunk_id": "0022100554_005", "order": 5, "role": "body", "text": "“It's about coming into the games with a sense of urgency on both ends of the floor,” Durant said, when asked to diagnose what has gone wrong for Brooklyn in its last three games. “Making the correct play on both ends of the floor.”"}
{"game_id": "0022100554", "chunk_id": "0022100554_006", "order": 6, "role": "body", "text": "Morant scored 18 points in the third period and had a spectacular tomahawk dunk that drew a gasp from the Barclays Center crowd of more 17,000, which included NFL wide receiver Antonio Brown, whose career is on hold after leaving the field and his Tampa Bay teammates in the Buccaneers’ win over the Jets on Sunday."}
{"game_id": "0022100554", "chunk_id": "0022100554_007", "order": 7, "role": "body", "text": "“Our expectations,” said Memphis coach Taylor Jenkins, “(are) to go out and impact the game at a high level.”"}
{"game_id": "0022100554", "chunk_id": "0022100554_008", "order": 8, "role": "body", "text": "The first of two regular-season matchups between the leaders in the Atlantic and Southwest divisions concerned Brooklyn coach Steve Nash. Nash, in his pregame comments, pointed to the Grizzlies’ ability to offensive rebound and force turnovers, parts of the game in which the Nets have struggled."}
{"game_id": "0022100554", "chunk_id": "0022100554_009", "order": 9, "role": "body", "text": "Memphis scored 14 points off nine Brooklyn turnovers in the opening quarters and led 56-47 at halftime. The Grizzlies also grabbed 13 offensive rebounds, which helped them score 18 second-chance points."}
{"game_id": "0022100554", "chunk_id": "0022100554_010", "order": 10, "role": "body", "text": "Memphis built its lead to as many as 25 points in the third quarter by continuously attacking the paint, led by Morant’s acrobatic drives."}
{"game_id": "0022100554", "chunk_id": "0022100554_011", "order": 11, "role": "body", "text": "“People will debate whether or not he should be an All-Star,” Bane said of Morant. “I think we should be debating whether or not he's the best point guard in the league.”"}
{"game_id": "0022100554", "chunk_id": "0022100554_012", "order": 12, "role": "body", "text": "The Grizzlies extended their lead to 28 points in the fourth quarter. With Durant and Harden on the bench, Brooklyn’s reserves cut the deficit to 10 points, but got no closer."}
{"game_id": "0022100554", "chunk_id": "0022100554_013", "order": 13, "role": "body", "text": "Brown scored seven of his 10 points in the period, and Jevon Carter (six), Day’Ron Sharpe (six), and Cam Thomas (eight) scored all of their points during the ill-fated comeback attempt."}
{"game_id": "0022100554", "chunk_id": "0022100554_014", "order": 14, "role": "body", "text": "“I love the young guys and what they bring to our team,” Durant said. “Good to see them get some minutes and opportunities to make it a game, and they did. For sure.”"}
{"game_id": "0022100554", "chunk_id": "0022100554_016", "order": 16, "role": "body", "text": "Grizzlies: The NBA announced before the game that Morant was named the player of the week in the Western Conference. The second overall pick in the 2019 draft averaged 34.7 points, 6.7 rebounds, and 34 minutes in three games — all wins — over the Phoenix Suns, Los Angeles Lakers, and San Antonio Spurs. Morant, who was awarded player of the week for the first time in his career, is averaging 24.7 points, 5.7 rebounds, 6.6 assists, and 1.48 steals in 32.4 minutes, and has started every game this season for Memphis."}
{"game_id": "0022100554", "chunk_id": "0022100554_017", "order": 17, "role": "body", "text": "Nets: The Nets have had their season upended by the pandemic. Brooklyn, which had 10 players in COVID-19 protocol as far back as Dec. 17, announced prior to the game that the NBA rescheduled five of its games. The Nets will host San Antonio at noon on Jan. 9, before flying to Portland to play the Trail Blazers the next night. Brooklyn’s game against Denver, initially scheduled for Dec. 19, was moved to Jan. 26. That forced the league to move the previously scheduled matchup against the Toronto Raptors to Feb. 28. Finally, the league shifted the Dec. 21 game against Washington to Feb. 17. … The Nets were short-handed as starting center LaMarcus Aldridge missed the game with a sore right foot."}
{"game_id": "0022100554", "chunk_id": "0022100554_019", "order": 19, "role": "body", "text": "Grizzlies: Visit Cleveland on Tuesday night."}
{"game_id": "0022100554", "chunk_id": "0022100554_020", "order": 20, "role": "body", "text": "Nets: Visit Indiana on Wednesday night."}
{"game_id": "0022100554", "chunk_id": "0022100554_022", "order": 22, "role": "closing", "text": "MORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports"}
