{"game_id": "0022100367", "chunk_id": "0022100367_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Darius Garland scored 24 points and rookie power forward Evan Mobley had 16 points and nine rebounds, sending the Cleveland Cavaliers to a 115-92 win over the Chicago Bulls on Wednesday night."}
{"game_id": "0022100367", "chunk_id": "0022100367_002", "order": 2, "role": "body", "text": "Garland also had six assists as Cleveland won for the fifth time in seven games, earning its most lopsided home victory of the season. Mobley, the third overall draft pick, shot 8 of 11 from the field and had a season-high five blocked shots and two steals."}
{"game_id": "0022100367", "chunk_id": "0022100367_003", "order": 3, "role": "body", "text": "“Whatever it takes to win, I’m about it,” Garland said. “I just try to get everybody else involved because we’re all hard-working. Evan got us started and got us going, and he had a big night defensively and offensively.”"}
{"game_id": "0022100367", "chunk_id": "0022100367_004", "order": 4, "role": "body", "text": "Zach LaVine scored 23 points with nine assists for Chicago, which had its four-game win streak snapped. Lonzo Ball added 19 points and Nikola Vucevic had 18 points and 12 rebounds, but shot 8 for 23 from the field."}
{"game_id": "0022100367", "chunk_id": "0022100367_005", "order": 5, "role": "body", "text": "The Bulls played their second game since leading scorer DeMar DeRozan was placed in the NBA’s health and safety protocol for COVID-19. Chicago guards Coby White, Matt Thomas and Javonte Green are sidelined for the same reason."}
{"game_id": "0022100367", "chunk_id": "0022100367_006", "order": 6, "role": "body", "text": "“In the half-court, we didn’t make the best decisions and we weren’t able to finish when we got downhill,” Bulls coach Billy Donovan said. “I think our offense defeated us, and you can’t do that and expect to beat a team like Cleveland.”"}
{"game_id": "0022100367", "chunk_id": "0022100367_007", "order": 7, "role": "body", "text": "The Cavaliers took command in the third quarter when Kevin Love made three 3-pointers in a 1:57 span to extend their lead to 78-56. Former Chicago forward Lauri Markkanen gave Cleveland its largest spread with a dunk that made it 104-78 midway through the fourth."}
{"game_id": "0022100367", "chunk_id": "0022100367_008", "order": 8, "role": "body", "text": "Markkanen scored 14 points, Jarrett Allen had 13 points and 12 rebounds, and Love and Ricky Rubio each had 11 points. The Cavaliers have won five in a row over the Bulls at Rocket Mortgage FieldHouse."}
{"game_id": "0022100367", "chunk_id": "0022100367_009", "order": 9, "role": "body", "text": "“Every time we go out and play like that, it’s a lot of fun,” Mobley said."}
{"game_id": "0022100367", "chunk_id": "0022100367_010", "order": 10, "role": "body", "text": "Mobley became the second Cleveland rookie with at least 300 points and 40 blocks in his first 22 games, joining John “Hot Rod” Williams in 1986-87. The USC product is averaging 14 points, 8.2 rebounds and a rookie-best 2.0 rejections."}
{"game_id": "0022100367", "chunk_id": "0022100367_011", "order": 11, "role": "body", "text": "“We’ve been on the other end with him blocking our shots in training camp,” Markkanen said, laughing. “It’s just what Evan does. That’s him.”"}
{"game_id": "0022100367", "chunk_id": "0022100367_012", "order": 12, "role": "body", "text": "Chicago, whose bench did not score in the first three quarters, has not won five straight since the 2017-18 season. Ball hit four 3-pointers and converted one of them into a four-point play, but his teammates were 3 of 17 beyond the arc."}
{"game_id": "0022100367", "chunk_id": "0022100367_013", "order": 13, "role": "body", "text": "“We really wanted to get this win and we had to put some pressure on them,” Cavaliers coach J.B. Bickerstaff said. “Evan led the way with that, which is good because we want him to be aggressive.”"}
{"game_id": "0022100367", "chunk_id": "0022100367_015", "order": 15, "role": "body", "text": "The Bulls had only 11 players in uniform, including two-way signees Tyler Cook and Devon Dotson, and were granted a hardship roster exception by the NBA. Chicago is expected to add G Stanley Johnson, but he was unable to make it to Cleveland in time. “The league has put some things on us that we can and cannot do, which makes it challenging,” Donovan said. “We’ve got to be flexible.”"}
{"game_id": "0022100367", "chunk_id": "0022100367_017", "order": 17, "role": "body", "text": "Bulls: G Alex Caruso (right hamstring strain) missed his second straight game, but will have his rehabilitation accelerated to include sprinting and cutting. “Alex is doing really, really well, but we’ll know more after we see how he responds from the next two days,” Donovan said. … F Patrick Williams (left wrist ligament tear) has been ruled out until at least March after being hurt against New York on Oct. 28."}
{"game_id": "0022100367", "chunk_id": "0022100367_018", "order": 18, "role": "body", "text": "Cavaliers: G Dylan Windler, who has fallen out of the rotation, scored 19 points in 33 minutes Monday for the Cleveland Charge of the G League. Bickerstaff said Windler was given the one-day assignment to stay sharp, saying, “We know who Dylan is.” … F Dean Wade (right calf strain) made three straight 3-pointers off the bench after missing six games. … C Tacko Fall and G RJ Nembhard are on G League assignments."}
{"game_id": "0022100367", "chunk_id": "0022100367_020", "order": 20, "role": "body", "text": "Bulls: Visit the Miami Heat on Saturday."}
{"game_id": "0022100367", "chunk_id": "0022100367_021", "order": 21, "role": "body", "text": "Cavaliers: Visit the Minnesota Timberwolves on Friday."}
