{"game_id": "0022100263", "chunk_id": "0022100263_001", "order": 1, "role": "lead", "text": "DETROIT -- — Tyler Herro had 31 points and eight rebounds as the Miami Heat rallied to beat the Detroit Pistons 100-92 on Tuesday night."}
{"game_id": "0022100263", "chunk_id": "0022100263_002", "order": 2, "role": "body", "text": "Miami (12-6) outscored the Pistons 27-6 in the first 8:17 of the fourth quarter to turn a nine-point deficit into a 12-point lead."}
{"game_id": "0022100263", "chunk_id": "0022100263_003", "order": 3, "role": "body", "text": "“It wasn't just Tyler. Our whole second unit turned the game around in the third quarter,” Heat coach Erik Spoelstra said. “We really didn't have any offensive rhythm in the first three quarters — and Detroit had a lot to do with that — but we put together some stops and that helped us get going offensively.”"}
{"game_id": "0022100263", "chunk_id": "0022100263_004", "order": 4, "role": "body", "text": "Jimmy Butler and Bam Adebayo each added 15 points and nine rebounds for the Heat, who won for the fifth time in six games. Kyle Lowry had 15 points, eight assists and six rebounds."}
{"game_id": "0022100263", "chunk_id": "0022100263_005", "order": 5, "role": "body", "text": "“It's easy to get assists when Tyler is shooting like that,” said Lowry, who had seven assists in the fourth. “I'd pass him the ball and he'd hit a 3.”"}
{"game_id": "0022100263", "chunk_id": "0022100263_006", "order": 6, "role": "body", "text": "Jerami Grant had 21 points and seven rebounds for Detroit (4-13), which went 1-4 on its homestand. The Pistons played without center Isaiah Stewart, who served the first of a two-game suspension for Sunday's altercation with Lakers star LeBron James."}
{"game_id": "0022100263", "chunk_id": "0022100263_007", "order": 7, "role": "body", "text": "Detroit led the Lakers by 15 after three quarters on Sunday before losing 121-116."}
{"game_id": "0022100263", "chunk_id": "0022100263_008", "order": 8, "role": "body", "text": "“The game is different in the fourth quarter and we're still learning how to handle that,” Pistons coach Dwane Casey said. “You can be up 10 or up 15, but it doesn't matter because of the 3-pointer and the way teams turn it up late.”"}
{"game_id": "0022100263", "chunk_id": "0022100263_009", "order": 9, "role": "body", "text": "The Pistons led 53-47 at halftime, and Miami couldn't put together a significant run in the third quarter. Hamadou Diallo's layup with 0.2 seconds left in the period gave Detroit a 76-67 advantage going into the fourth."}
{"game_id": "0022100263", "chunk_id": "0022100263_010", "order": 10, "role": "body", "text": "Herro's back-to-back 3s cut the deficit to 77-74, and Casey called timeout with 9:58 to play."}
{"game_id": "0022100263", "chunk_id": "0022100263_011", "order": 11, "role": "body", "text": "“We played sluggishly for three quarters, but we got rolling in the fourth,” said Herro, who had 14 points in the fourth. “I've always been the guy who took big shots, all the way back to high school, so this is the situation I love. I want to win games.”"}
{"game_id": "0022100263", "chunk_id": "0022100263_012", "order": 12, "role": "body", "text": "The timeout didn't help much, as Herro's floater gave the Heat an 80-79 lead with 8:09 left, and Herro hit another 3-pointer on the next possession. After a Pistons miss, Dewayne Dedmon's dunk put Miami ahead 85-79, extending the run to 18-3, and prompted another Detroit timeout."}
{"game_id": "0022100263", "chunk_id": "0022100263_013", "order": 13, "role": "body", "text": "“They went to a zone and we just couldn't get a bucket,” Casey said. “We didn't score and we didn't contain Herro.”"}
{"game_id": "0022100263", "chunk_id": "0022100263_015", "order": 15, "role": "body", "text": "Heat: Duncan Robinson played despite a bruised knee, extending his consecutive games streak to 165. Glen Rice holds the franchise record with 174."}
{"game_id": "0022100263", "chunk_id": "0022100263_016", "order": 16, "role": "body", "text": "Pistons: With Stewart suspended and Kelly Olynyk (knee) weeks away from a possible return, rookie center Luka Garza got his first NBA start. Garza scored seven points in 17 minutes."}
{"game_id": "0022100263", "chunk_id": "0022100263_017", "order": 17, "role": "body", "text": "“Obviously, when you are a kid, you dream about doing what I did tonight,” Garza said. “It was amazing, but I wish I could have stayed out of foul trouble and been able to help win the game.”"}
{"game_id": "0022100263", "chunk_id": "0022100263_019", "order": 19, "role": "body", "text": "Heat: Visit the Minnesota Timberwolves on Wednesday, the third stop of a four-game road trip."}
{"game_id": "0022100263", "chunk_id": "0022100263_020", "order": 20, "role": "body", "text": "Pistons: At the Milwaukee Bucks on Wednesday to start a five-game road trip."}
