{"game_id": "0022101120", "chunk_id": "0022101120_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Kyrie Irving waited all season for a chance to play in front of his home fans, and this sure wasn't the way he envisioned it going."}
{"game_id": "0022101120", "chunk_id": "0022101120_002", "order": 2, "role": "body", "text": "“Not the result we wanted, I didn’t shoot as well as I wanted,” Irving said. “Basically none of the things I had hoped for going well tonight just didn’t happen, and that’s just the flow of basketball.”"}
{"game_id": "0022101120", "chunk_id": "0022101120_003", "order": 3, "role": "body", "text": "It went much better for the other point guard."}
{"game_id": "0022101120", "chunk_id": "0022101120_004", "order": 4, "role": "body", "text": "LaMelo Ball had 33 points, nine assists and seven rebounds and the Charlotte Hornets spoiled Irving's first home game of the season by beating the Brooklyn Nets 119-110 on Sunday night."}
{"game_id": "0022101120", "chunk_id": "0022101120_005", "order": 5, "role": "body", "text": "Irving misfired for 3 1/2 quarters, finally warmed up to give the Nets the lead, and then the Hornets regained control with clutch 3-point shooting to give them a victory that tied them with Brooklyn for eighth place in the Eastern Conference."}
{"game_id": "0022101120", "chunk_id": "0022101120_006", "order": 6, "role": "body", "text": "Irving finished with 16 points and tied his season high with 11 assists but shot 6 for 22 from the field. He hadn't been able to play at home this season until Mayor Eric Adams last week exempted athletes and performers from the New York City's coronavirus vaccine mandate."}
{"game_id": "0022101120", "chunk_id": "0022101120_007", "order": 7, "role": "body", "text": "“It was great to see him out there, good to see the fans excited for him,” Kevin Durant said. “Unfortunately we took the ‘L’ though, but we move forward knowing that we have him here and build on what we have and try to get a win next game.”"}
{"game_id": "0022101120", "chunk_id": "0022101120_008", "order": 8, "role": "body", "text": "Miles Bridges scored 24 points and PJ Washington had 18 points and 11 rebounds for the Hornets, who won for the seventh time in eight games. They beat the Nets for the second time in three meetings this season, clinching a potential head-to-head tiebreaker."}
{"game_id": "0022101120", "chunk_id": "0022101120_009", "order": 9, "role": "body", "text": "Durant had 27 points, eight rebounds and seven assists, playing the entire second half on the second night of a back-to-back. He shot just 9 for 24. Andre Drummond had 20 points and 16 rebounds."}
{"game_id": "0022101120", "chunk_id": "0022101120_010", "order": 10, "role": "body", "text": "Irving missed 15 of his first 17 shots, but then made two layups and a short jumper to tie it at 104-104 with 4:05 remaining. His two free throws gave the Nets a one-point lead with 3:37 to go, but then the Hornets blew by them with four 3-pointers."}
{"game_id": "0022101120", "chunk_id": "0022101120_011", "order": 11, "role": "body", "text": "Cody Martin made two of them, with Terry Rozier adding one before Bridges closed it out for the final margin."}
{"game_id": "0022101120", "chunk_id": "0022101120_012", "order": 12, "role": "body", "text": "“Those last 3s in the end were really clutch I feel like,” Ball said, “so it was a great game.”"}
{"game_id": "0022101120", "chunk_id": "0022101120_013", "order": 13, "role": "body", "text": "Ball scored 18 points in the third quarter, going 5 of 6 from 3-point range. He finished 7 of 12 behind the arc."}
{"game_id": "0022101120", "chunk_id": "0022101120_014", "order": 14, "role": "body", "text": "Irving played his first home game since Game 2 of the Eastern Conference semifinals against Milwaukee. It was a pivotal time for the Nets to get Irving back, with Sunday beginning a stretch of eight games to finish the regular season and only one of them outside New York, with six at home and one at Madison Square Garden."}
{"game_id": "0022101120", "chunk_id": "0022101120_015", "order": 15, "role": "body", "text": "Irving got a loud ovation from the crowd of 18,166, the largest ever for a Nets game at Barclays Center, after resuming his spot as the last Nets player announced during the starting lineups. But he couldn't do anything to get another one early in the game, missing all four shots in the first quarter."}
{"game_id": "0022101120", "chunk_id": "0022101120_016", "order": 16, "role": "body", "text": "He went to the line early in the second quarter and missed his first free throw. Fans then began applauding as if trying to give him a lift and he responded by knocking down the second shot for his first point."}
{"game_id": "0022101120", "chunk_id": "0022101120_017", "order": 17, "role": "body", "text": "Irving then got a 3-pointer in transition to bounce in for a 10-point lead and his first field goal, and the Nets led by 14 before Charlotte trimmed it to 60-56 at halftime."}
{"game_id": "0022101120", "chunk_id": "0022101120_018", "order": 18, "role": "body", "text": "Ball then came out and hit three 3-pointers in the first three minutes, starting Charlotte off on its 37-point third quarter."}
{"game_id": "0022101120", "chunk_id": "0022101120_019", "order": 19, "role": "body", "text": "“We know we're a good third-quarter team and we came out and set the tone,” Hornets coach James Borrego said."}
{"game_id": "0022101120", "chunk_id": "0022101120_020", "order": 20, "role": "body", "text": "Ball's final 3 of the period gave the Hornets a 90-79 lead, but Brooklyn trimmed it to 93-89 by the end of the period."}
{"game_id": "0022101120", "chunk_id": "0022101120_022", "order": 22, "role": "body", "text": "Hornets: Charlotte was making its first of two visits to New York in four days. The Hornets visit the Knicks on Wednesday. ... Rozier scored 14 points. ... Charlotte has won four straight road games."}
{"game_id": "0022101120", "chunk_id": "0022101120_023", "order": 23, "role": "body", "text": "Nets: F/C LaMarcus Aldridge was available to play after missing nine games with a right hip injury but didn't get in the game. ... Seth Curry, battling a sore ankle, scored 12 points."}
{"game_id": "0022101120", "chunk_id": "0022101120_025", "order": 25, "role": "body", "text": "Hornets: Host Denver on Monday night."}
{"game_id": "0022101120", "chunk_id": "0022101120_026", "order": 26, "role": "closing", "text": "Nets: Host Detroit on Tuesday night."}
