{"game_id": "0022100510", "chunk_id": "0022100510_001", "order": 1, "role": "lead", "text": "TORONTO -- — Tobias Harris had 19 points, 12 rebounds, and 10 assists for his first career triple-double, Joel Embiid finished with 36 points and 11 rebounds, and the Philadelphia 76ers hung on to beat the Toronto Raptors 114-109 on Tuesday night."}
{"game_id": "0022100510", "chunk_id": "0022100510_002", "order": 2, "role": "body", "text": "Georges Niang scored 19 points, Seth Curry had 12 and Furkan Korkmaz 10 as the 76ers won their second straight."}
{"game_id": "0022100510", "chunk_id": "0022100510_003", "order": 3, "role": "body", "text": "“It wasn’t a pretty one but, for us, we’ll take it,” Harris said. “But we have to get better in a lot of areas.”"}
{"game_id": "0022100510", "chunk_id": "0022100510_004", "order": 4, "role": "body", "text": "Harris shot 3 for 12 and missed his only 3-point attempt but scored 13 points at the free throw line and reached double digits in assists for the first time in his career."}
{"game_id": "0022100510", "chunk_id": "0022100510_005", "order": 5, "role": "body", "text": "“Overall, just wanted to stay aggressive and just create plays out there,” Harris said. “Credit to my teammates for making good looks and being able to knock down shots and finish.”"}
{"game_id": "0022100510", "chunk_id": "0022100510_006", "order": 6, "role": "body", "text": "Niang said he was “ecstatic” for Harris."}
{"game_id": "0022100510", "chunk_id": "0022100510_007", "order": 7, "role": "body", "text": "“He got to the free throw line, he rebounded the ball, and was a facilitator and generated open shots,” Niang said. “That’s why they pay that guy the big bucks, you know what I mean? Because your capabilities are more than just one.”"}
{"game_id": "0022100510", "chunk_id": "0022100510_008", "order": 8, "role": "body", "text": "Chris Boucher scored a season-high 28 points and matched his career high with 19 rebounds, but the depleted Raptors lost their second straight."}
{"game_id": "0022100510", "chunk_id": "0022100510_009", "order": 9, "role": "body", "text": "Pascal Siakam, Gary Trent Jr. and Malachi Flynn returned for Toronto after being among the 10 players to miss Sunday’s 144-99 loss at Cleveland because of COVID-19 health and safety protocols. Fred VanVleet, OG Anunoby, Scottie Barnes, Isaac Bonga, and Justin Champagnie remain in the protocols."}
{"game_id": "0022100510", "chunk_id": "0022100510_010", "order": 10, "role": "body", "text": "Sixers coach Doc Rivers bristled at the suggestion his team should have won more comfortably against the undermanned Raptors."}
{"game_id": "0022100510", "chunk_id": "0022100510_011", "order": 11, "role": "body", "text": "“I will take any win on the road, any time, any way,” Rivers said. “I don’t sit back and judge like, ’Well, we didn’t win by 10 tonight, or 12.' We won the game.”"}
{"game_id": "0022100510", "chunk_id": "0022100510_012", "order": 12, "role": "body", "text": "Siakam scored 28 points while Trent had 19 despite shooting 6 for 24. Each played 41 minutes."}
{"game_id": "0022100510", "chunk_id": "0022100510_013", "order": 13, "role": "body", "text": "“No doubt they were tired,” coach Nick Nurse said. “They’d be tired under normal circumstances, but under these circumstances, they were pretty gassed, I would imagine.”"}
{"game_id": "0022100510", "chunk_id": "0022100510_014", "order": 14, "role": "body", "text": "After Toronto took a 78-76 lead on Svi Mykhailiuk’s 3-pointer with 2:02 left in the third, the 76ers responded with a 19-5 run, including a 10-2 spurt to begin the fourth that was fueled by eight straight points from Niang."}
{"game_id": "0022100510", "chunk_id": "0022100510_015", "order": 15, "role": "body", "text": "The Raptors battled back, and Trent hit a 3-pointer with 1:41 remaining to put Toronto up 107-106."}
{"game_id": "0022100510", "chunk_id": "0022100510_016", "order": 16, "role": "body", "text": "Harris answered with a pair of free throws, Siakam scored for Toronto, and Embiid replied with 51 seconds left to restore Philadelphia’s one-point lead."}
{"game_id": "0022100510", "chunk_id": "0022100510_017", "order": 17, "role": "body", "text": "Harris was fouled after grabbing the rebound on Trent’s miss with 21 seconds left, and made two more from the line to put the Sixers up 112-109. Toronto missed a chance to take a tying shot when Trent turned the ball over with six seconds left."}
{"game_id": "0022100510", "chunk_id": "0022100510_018", "order": 18, "role": "body", "text": "Toronto forward D.J. Wilson missed the first half while awaiting clearance to return from protocols, but entered the game in the third quarter."}
{"game_id": "0022100510", "chunk_id": "0022100510_019", "order": 19, "role": "body", "text": "The Sixers were without Andre Drummond, Danny Green, and Shake Milton, all of whom are in the health and safety protocols."}
{"game_id": "0022100510", "chunk_id": "0022100510_020", "order": 20, "role": "body", "text": "Siakam connected on six of eight attempts and scored 14 points in the first but the 76ers led 27-24 after one. Philadelphia shot 5 for 10 from 3-point range in the second and led 55-48 at halftime."}
{"game_id": "0022100510", "chunk_id": "0022100510_021", "order": 21, "role": "body", "text": "Embiid scored 15 points in the third but Boucher shot 3 for 3 from 3-point range as Toronto closed the gap. The Sixers led 85-81 heading to the fourth."}
{"game_id": "0022100510", "chunk_id": "0022100510_023", "order": 23, "role": "body", "text": "Harris went 13 for 14 at the free throw line while Embiid finished 12 for 14."}
{"game_id": "0022100510", "chunk_id": "0022100510_025", "order": 25, "role": "body", "text": "Playing at home for the second time since arena capacity was capped at 50% because of Ontario’s current COVID-19 restrictions, the Raptors drew a season-low crowd of 6,960."}
{"game_id": "0022100510", "chunk_id": "0022100510_027", "order": 27, "role": "body", "text": "76ers: Green’s absence denied him the opportunity to finally receive his 2019 NBA championship ring. He’s now scheduled to receive the ring when the Sixers return to Toronto on April 7, 2022."}
{"game_id": "0022100510", "chunk_id": "0022100510_028", "order": 28, "role": "body", "text": "Raptors: Had their three-game home winning streak snapped. … Missed seven of their first nine field goal attempts in the final period. … G Dalano Banton (right knee) was ruled out about an hour before tipoff. … Both C Precious Achiuwa and C Khem Birch are no longer in COVID-19 protocols but neither is ready to return."}
{"game_id": "0022100510", "chunk_id": "0022100510_030", "order": 30, "role": "body", "text": "76ers: Visit Brooklyn on Thursday."}
{"game_id": "0022100510", "chunk_id": "0022100510_031", "order": 31, "role": "body", "text": "Raptors: Host the LA Clippers on Friday."}
