{"game_id": "0022100596", "chunk_id": "0022100596_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Tyler Herro had his best scoring game of the season. Duncan Robinson did, too."}
{"game_id": "0022100596", "chunk_id": "0022100596_002", "order": 2, "role": "body", "text": "It all added up to a blowout win for the Miami Heat, who tied a franchise record with 22 3-pointers in a 123-100 victory over the NBA-leading Phoenix Suns on Saturday night."}
{"game_id": "0022100596", "chunk_id": "0022100596_003", "order": 3, "role": "body", "text": "Herro poured in 33 points while Robinson added 27. Both players came off the bench for the short-handed Heat, who had 11 players on the inactive list, including star guard Jimmy Butler."}
{"game_id": "0022100596", "chunk_id": "0022100596_004", "order": 4, "role": "body", "text": "“I just really continue to commend our group for staying in the moment, focusing on solutions and figuring out a way to improve and play good enough to win,” Heat coach Erik Spoelstra said. “One at a time.”"}
{"game_id": "0022100596", "chunk_id": "0022100596_005", "order": 5, "role": "body", "text": "The Heat made 50% of their 44 attempts from 3-point range. Robinson had a particularly good night, making eight 3s on 16 attempts, including a pair in the fourth quarter that turned back a short-lived Suns rally."}
{"game_id": "0022100596", "chunk_id": "0022100596_006", "order": 6, "role": "body", "text": "“We’ve got a lot of guys who can really shoot, which obviously helps,” Robinson said. “Sometimes shooting is contagious as well. Certainly ball movement is contagious."}
{"game_id": "0022100596", "chunk_id": "0022100596_007", "order": 7, "role": "body", "text": "\"Ball's finding energy. Ball's finding the open guy.\""}
{"game_id": "0022100596", "chunk_id": "0022100596_008", "order": 8, "role": "body", "text": "Herro had a stellar all-around game, making 12 of 20 shots, including three 3-pointers. He added five rebounds and three assists. The 21-year-old is averaging more than 20 points this season despite starting just 10 games."}
{"game_id": "0022100596", "chunk_id": "0022100596_009", "order": 9, "role": "body", "text": "“He just got into a great rhythm,” Spoelstra said."}
{"game_id": "0022100596", "chunk_id": "0022100596_010", "order": 10, "role": "body", "text": "The thin roster didn’t stop Miami from a strong start. The Heat shot 52% in the first quarter and took a 33-29 lead."}
{"game_id": "0022100596", "chunk_id": "0022100596_011", "order": 11, "role": "body", "text": "They were even better in the second quarter and pushed ahead 71-50 by the break. Robinson scored 18 points off the bench, all on six 3-pointers. Herro added 17 points. Miami was 15 of 30 from 3-point range in the first half and the bench scored 40 points."}
{"game_id": "0022100596", "chunk_id": "0022100596_012", "order": 12, "role": "body", "text": "Miami cooled off a little in the second half but the game never got particularly close. The Suns had their three-game winning streak snapped in a rare home blowout loss."}
{"game_id": "0022100596", "chunk_id": "0022100596_013", "order": 13, "role": "body", "text": "It was a tough night in all phases for the Suns, who came into the game with the NBA's best record but didn't play like it. They struggled to produce consistently on offense and let the Heat's shooters get way too many wide-open looks on defense."}
{"game_id": "0022100596", "chunk_id": "0022100596_014", "order": 14, "role": "body", "text": "Devin Booker led the Suns with 26 points while Mikal Bridges added 20. The Suns shot just 38% from the field and were outrebounded 49-35. Booker said he was more upset that the Heat didn't face much resistance from the Suns' defense."}
{"game_id": "0022100596", "chunk_id": "0022100596_015", "order": 15, "role": "body", "text": "“I think they came out way too comfortable,” Booker said. “That is not a team you want to give some confidence in and let them see a couple of easy ones go in. It was too loose. They got to do whatever they wanted.”"}
{"game_id": "0022100596", "chunk_id": "0022100596_017", "order": 17, "role": "body", "text": "Heat: Butler missed his second straight game with a right ankle sprain. ... Omer Yurtseven finished with seven points, 16 rebounds and eight assists. ... It's the third time in a month that the Heat have tied their franchise record of 22 3-pointers. ... Despite COVID-19 and injury issues, the Heat are 3-2 on their current road trip. ... Robinson usually starts but Spoelstra has brought him off the bench the past two games since he came off the COVID-19 list. ... The Heat had 11 players available, which matched the 11 players on the inactive list."}
{"game_id": "0022100596", "chunk_id": "0022100596_018", "order": 18, "role": "body", "text": "Suns: C Deandre Ayton, F Jae Crowder and C JaVale McGee all returned after spending time on the reserve/COVID-19 list. G Landry Shamet remains in the protocol. ... Booker scored 13 points in the first quarter, including a jumper that rattled in at the buzzer. ... G Cam Payne got a technical foul after a hard foul on Herro in the third quarter."}
{"game_id": "0022100596", "chunk_id": "0022100596_020", "order": 20, "role": "body", "text": "Heat: Wrap up a seven-game road trip at the Hawks on Wednesday."}
{"game_id": "0022100596", "chunk_id": "0022100596_021", "order": 21, "role": "body", "text": "Suns: Begin a five-game road trip against the Raptors on Tuesday."}
