{"game_id": "0022100561", "chunk_id": "0022100561_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Anthony Edwards scored 28 points to lead six players in double figures and the Minnesota Timberwolves routed the Los Angeles Clippers 122-104 on Monday night to end a three-game skid."}
{"game_id": "0022100561", "chunk_id": "0022100561_002", "order": 2, "role": "body", "text": "The Wolves gained a split in LA after losing by five to the Lakers a night earlier."}
{"game_id": "0022100561", "chunk_id": "0022100561_003", "order": 3, "role": "body", "text": "The Clippers struggled mightily in their first home game of the new year. They had 39 made shots and 21 turnovers in the game. They got dominated in the paint, 64-42."}
{"game_id": "0022100561", "chunk_id": "0022100561_004", "order": 4, "role": "body", "text": "Serge Ibaka tied his season high with 17 points for the Clippers, who have dropped four of six."}
{"game_id": "0022100561", "chunk_id": "0022100561_005", "order": 5, "role": "body", "text": "Reserves Jaylen McDaniels added 18 points and Taurean Prince had 17 points for the Wolves."}
{"game_id": "0022100561", "chunk_id": "0022100561_006", "order": 6, "role": "body", "text": "“It's probably one of my best games of the season,” said Prince, playing his second game since returning from the league's health and safety protocols."}
{"game_id": "0022100561", "chunk_id": "0022100561_007", "order": 7, "role": "body", "text": "Patrick Beverley tied his career high with 12 assists against his former team."}
{"game_id": "0022100561", "chunk_id": "0022100561_008", "order": 8, "role": "body", "text": "“He just told us he needed this game,” Prince said. “It was just perfect how it played out.”"}
{"game_id": "0022100561", "chunk_id": "0022100561_009", "order": 9, "role": "body", "text": "The Clippers went entirely to their bench in the fourth and clawed back within 12 points on consecutive 3-pointers by Xavier Moon and Stanley Johnson."}
{"game_id": "0022100561", "chunk_id": "0022100561_010", "order": 10, "role": "body", "text": "But the Wolves answered with back-to-back 3s from McDaniels and Edwards that kept them ahead by 18 points. Minnesota later ran off nine unanswered points, including five by Beverley, for a 111-84 lead."}
{"game_id": "0022100561", "chunk_id": "0022100561_011", "order": 11, "role": "body", "text": "“Pat Beverley did a great job really setting the tone, whether it was his intensity, defense and focus,” Wolves coach Chris Fitch said."}
{"game_id": "0022100561", "chunk_id": "0022100561_012", "order": 12, "role": "body", "text": "“We outworked them for the most part. We did a good job of being focused playing on the back-to-back. We got great bench production which is what you need on the back-to-back,” Fitch said."}
{"game_id": "0022100561", "chunk_id": "0022100561_013", "order": 13, "role": "body", "text": "The Clippers closed within 15 early in the third only to have the Wolves hit three straight 3-pointers — two by Edwards and another from Michael Beasley — for a 78-54 lead."}
{"game_id": "0022100561", "chunk_id": "0022100561_014", "order": 14, "role": "body", "text": "The Wolves all but put the game away in the second when they outscored the Clippers 38-25. Minnesota built its first double-digit lead of the game with a 17-4 run, including 10 straight points, early in the period. The Wolves led 64-46 at halftime."}
{"game_id": "0022100561", "chunk_id": "0022100561_015", "order": 15, "role": "body", "text": "“You got to learn from it like any game, figure out what we could have done better,” said Justise Winslow, who had 15 points off the Clippers' bench. “You got to bring it every night in this league, all the guys, even guys that aren’t playing.”"}
{"game_id": "0022100561", "chunk_id": "0022100561_017", "order": 17, "role": "body", "text": "Timberwolves: Snapped a six-game skid against the Clippers. ... Their 38 points in the paint in the first half were a season high for either half. ... Improved to 3-2 on the second night of a back-to-back. ... Karl-Anthony Towns and D'Angelo Russell are ramping up after being in protocols and could return later this week."}
{"game_id": "0022100561", "chunk_id": "0022100561_018", "order": 18, "role": "body", "text": "Clippers: They won the season series, 3-1. ... Assistants Jeremy Castleberry and Brendon O'Connor are in protocols. ... James Ennis III was called for a flagrant-1 foul in the fourth. ... Luke Kennard, Ivica Zubac and Brandon Boston Jr. remain in protocols. ... Nicolas Batum (right ankle sprain) and Isaiah Hartenstein (left ankle sprain) are out."}
{"game_id": "0022100561", "chunk_id": "0022100561_020", "order": 20, "role": "body", "text": "Timberwolves: Host Oklahoma City on Wednesday."}
{"game_id": "0022100561", "chunk_id": "0022100561_021", "order": 21, "role": "body", "text": "Clippers: At Phoenix on Thursday."}
