{"game_id": "0022100818", "chunk_id": "0022100818_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Ja Morant had 30 points, Jaren Jackson Jr. added 26 points and 11 rebounds as the Memphis Grizzlies routed the Los Angeles Clippers 135-109 on Tuesday night."}
{"game_id": "0022100818", "chunk_id": "0022100818_002", "order": 2, "role": "body", "text": "The offensive production from Morant came on 12 of 19 shooting from the field and marked the ninth time in the past 10 games the All-Star guard reached the 30-point mark. Brandon Clarke finished with 18 points for Memphis."}
{"game_id": "0022100818", "chunk_id": "0022100818_003", "order": 3, "role": "body", "text": "Reserve center Isaiah Hartenstein led the Clippers with 19 points, while Norman Powell added 16 points. Terance Mann and Robert Covington finished with 14 points each."}
{"game_id": "0022100818", "chunk_id": "0022100818_004", "order": 4, "role": "body", "text": "“I just thought we made the game a little too hard today,” Clippers coach Tyronn Lue said, later adding: “Just the things we did to hurt ourselves, like the offensive rebounds and the turnovers (17 leading to 21 Memphis points), which we’ve got to do better at.”"}
{"game_id": "0022100818", "chunk_id": "0022100818_005", "order": 5, "role": "body", "text": "Memphis, which held a 15-point lead at halftime extended it to 20 midway through the third quarter, capped by a dunk from Morant after a rebound stuff by the Grizzlies highlight reel on the previous possession was negated by an offensive goaltending call."}
{"game_id": "0022100818", "chunk_id": "0022100818_006", "order": 6, "role": "body", "text": "Memphis would stretch it to 32 with a one-handed alley-oop slam by Clarke and the Grizzlies were on their way to the third straight victory and sixth in the last seven."}
{"game_id": "0022100818", "chunk_id": "0022100818_007", "order": 7, "role": "body", "text": "“We’ve played a lot of games, so at this point, you have tired legs,” Jackson said of maintaining the energy. “Anything can be going on, but you just have to stay locked in."}
{"game_id": "0022100818", "chunk_id": "0022100818_008", "order": 8, "role": "body", "text": "“That’s really the secret at this point. The teams that can keep their energy up the longest in these games without losing focus and thinking about how many games we’ve played are usually going to win.”"}
{"game_id": "0022100818", "chunk_id": "0022100818_009", "order": 9, "role": "body", "text": "Lue said before the game that the key was trying to control Memphis’ transition offense. The team watched 20 or 30 plays regarding the Grizzlies running, and Lue warned his players that the Grizzlies “are too fast and too explosive offensively to give them easy baskets.”"}
{"game_id": "0022100818", "chunk_id": "0022100818_010", "order": 10, "role": "body", "text": "Memphis not only surpassed its average of 16.9 fastbreak points, it also continued to dominate the paint, outscoring the Clippers 78-46."}
{"game_id": "0022100818", "chunk_id": "0022100818_011", "order": 11, "role": "body", "text": "“This is a team that lives off of pace. They live off of getting up and down the court and they really live off your mistakes,” said guard Reggie Jackson, who had 12 points, but was 5 of 14 from the field, part of the Clippers shooting 45%."}
{"game_id": "0022100818", "chunk_id": "0022100818_012", "order": 12, "role": "body", "text": "Memphis’ 16.9 fastbreak points a game leads the league. The Grizzlies already had 12 at halftime benefitting from the Clippers shooting 43% and committing eight turnovers. That translated to a 70-55 Memphis lead as Jackson had 17 points and Morant 16."}
{"game_id": "0022100818", "chunk_id": "0022100818_013", "order": 13, "role": "body", "text": "Memphis would end the game with 22 fastbreak points to the Clippers eight."}
{"game_id": "0022100818", "chunk_id": "0022100818_015", "order": 15, "role": "body", "text": "Clippers: Powell, obtained with Covington from Portland, got his first start for the Clippers, starting at guard with Reggie Jackson, sending Amir Coffey to reserve status. …Coffey finished with 13 points off the bench. …Marcus Morris Sr. drew a technical disputing a call late in the second quarter. Then he was ejected after receiving a Flagrant 2 when he took down Morant on a drive to the basket in the third quarter."}
{"game_id": "0022100818", "chunk_id": "0022100818_016", "order": 16, "role": "body", "text": "Grizzlies: Won all four games in series this season. …Tuesday’s game was only one of three home games for Memphis in February. “NBA seasons are NBA seasons. You’re going to go through stretches like this,” Memphis coach Taylor Jenkins said. “Obviously, you want to cherish time at home.” …The league announced Tuesday afternoon that guard Desmond Bane will participate in the 3-point contest on All-Star weekend. He struggled from outside the arc going 0 for 5."}
{"game_id": "0022100818", "chunk_id": "0022100818_018", "order": 18, "role": "body", "text": "Grizzlies guard/forward Dillon Brooks missed his 15th game with a left ankle sprain, but there seemed to be some optimism about his return. “We’re still kind of taking it week by week,” Jenkins said. “I think there could be a chance (his return) may fall past the All-Star break. …I think we’ll have more of an update in the next couple of days.”"}
{"game_id": "0022100818", "chunk_id": "0022100818_020", "order": 20, "role": "body", "text": "Asked about missing out on an All-Star selection, Jaren Jackson Jr. said the snub, thus far, wasn’t a motivation. He’s still excited to be playing pro basketball. But then he added: “It’s not over yet. I’m trying to sneak my way in there. Back door, anything anybody wants to whatever. I’m honored to participate if need be.”"}
{"game_id": "0022100818", "chunk_id": "0022100818_022", "order": 22, "role": "body", "text": "Clippers: At Dallas on Thursday for the first of two consecutive games against the Mavericks."}
{"game_id": "0022100818", "chunk_id": "0022100818_023", "order": 23, "role": "body", "text": "Grizzlies: Travel to Detroit to face the Pistons Thursday, the first of a three-game road trip."}
