{"game_id": "0022100927", "chunk_id": "0022100927_001", "order": 1, "role": "lead", "text": "BOSTON -- — Jayson Tatum had 33 points, eight rebounds and seven assists to help the Boston Celtics rally in the second half and beat the Atlanta Hawks 107-98 on Tuesday night."}
{"game_id": "0022100927", "chunk_id": "0022100927_002", "order": 2, "role": "body", "text": "Derrick White and Grant Williams each added 18 points off the bench. Marcus Smart finished with 16 points and four assists."}
{"game_id": "0022100927", "chunk_id": "0022100927_003", "order": 3, "role": "body", "text": "Boston has won 10 of its last 12 and three of four since the All-Star break."}
{"game_id": "0022100927", "chunk_id": "0022100927_004", "order": 4, "role": "body", "text": "The Celtics played the final three quarters without starter Jaylen Brown, who left the game in the first quarter with a right ankle injury. Being able to recover from Brown's injury taught the team a lot, Smart said."}
{"game_id": "0022100927", "chunk_id": "0022100927_005", "order": 5, "role": "body", "text": "“It just shows, that if we continue to come out like this, this is the team that we are. This is the identity that we have. It's going to be hard for teams,” he said."}
{"game_id": "0022100927", "chunk_id": "0022100927_006", "order": 6, "role": "body", "text": "Trae Young had 31 points. Bogdan Bogdanovic added 25 for the Hawks, who have lost two of three."}
{"game_id": "0022100927", "chunk_id": "0022100927_007", "order": 7, "role": "body", "text": "“They came out aggressive, ready to attack and I thought we got back on our heels,” Hawks coach Nate McMillan said. “We just settled for the long ball. We didn't attack.”"}
{"game_id": "0022100927", "chunk_id": "0022100927_008", "order": 8, "role": "body", "text": "Atlanta led by as many as 17 points in the first half before that cushion evaporated in a 14-0 run by Boston to open the third quarter."}
{"game_id": "0022100927", "chunk_id": "0022100927_009", "order": 9, "role": "body", "text": "The Hawks shot selection didn't help, going 7 of 31 from 3-point range in the game."}
{"game_id": "0022100927", "chunk_id": "0022100927_010", "order": 10, "role": "body", "text": "“I think we kind of bailed them out and let them off the hook taking some shots and obviously not attacking like we did in the first half,” Young said."}
{"game_id": "0022100927", "chunk_id": "0022100927_011", "order": 11, "role": "body", "text": "The Celtics seized on it and kept their momentum going, outscoring the Hawks 31-13 in the period to take a 82-78 edge in the fourth."}
{"game_id": "0022100927", "chunk_id": "0022100927_012", "order": 12, "role": "body", "text": "The surge was keyed by Boston's defense, which held Young to just nine points after halftime. The increased intensity was a response to a plea by coach Ime Udoka at halftime for his team to be more physical."}
{"game_id": "0022100927", "chunk_id": "0022100927_013", "order": 13, "role": "body", "text": "“It’s part of us. It’s part of me. It’s something that when we’re being physical, it helps us on the defensive end. But also on the offensive end,” Smart said."}
{"game_id": "0022100927", "chunk_id": "0022100927_014", "order": 14, "role": "body", "text": "Boston’s lead grew to 102-88 with 3:11 left in the game following back-to-back 3-pointers by Williams. Both baskets were set up by defensive plays by Smart. First, he chased down De'Andre Hunter on a fast break and came up with a block from behind. Then, he stepped in front of an errant pass by Bogdanovic to start another Celtics' sprint out."}
{"game_id": "0022100927", "chunk_id": "0022100927_015", "order": 15, "role": "body", "text": "The plays were examples of how they want to play, Smart said."}
{"game_id": "0022100927", "chunk_id": "0022100927_016", "order": 16, "role": "body", "text": "The Celtics entered the game at full strength for the first time in weeks, but that changed in the first quarter when Brown left with a right ankle sprain after taking an awkward fall during a drive into the lane."}
{"game_id": "0022100927", "chunk_id": "0022100927_017", "order": 17, "role": "body", "text": "He grabbed at his right leg as he toppled to the ground, but was able to walk to the locker room on his own power. Udoka said he was able to move around on the ankle in the locker room, but he is day to day."}
{"game_id": "0022100927", "chunk_id": "0022100927_019", "order": 19, "role": "body", "text": "Hawks: Shot 14 of 20 (70%) from the field in the second quarter. … Weren’t whistled for their first foul until the 11:08 mark of the second quarter. … Closed the first period on a 17-5 run."}
{"game_id": "0022100927", "chunk_id": "0022100927_020", "order": 20, "role": "body", "text": "Celtics: White went 4 for 4 and scored nine points in the final 3:55 of the third quarter. … Had 10 turnovers in the first half, leading to 10 Atlanta points."}
{"game_id": "0022100927", "chunk_id": "0022100927_022", "order": 22, "role": "body", "text": "The Hawks got their own injury scare in the first quarter when Smart was issued a Flagrant 1 technical after sliding into Young’s landing area on a 3-point attempt. Young suffered a left ankle sprain on the play, but was able to shoot his free throws before heading to the locker room. He returned with 6:20 left in the second quarter."}
{"game_id": "0022100927", "chunk_id": "0022100927_023", "order": 23, "role": "body", "text": "Young said his ankle stiffened up some throughout the game, but he doesn't think it will be a serious issue going forward."}
{"game_id": "0022100927", "chunk_id": "0022100927_024", "order": 24, "role": "body", "text": "“As long as I keep it loose in the next couple of days, hopefully I can keep it going,” he said."}
{"game_id": "0022100927", "chunk_id": "0022100927_026", "order": 26, "role": "body", "text": "Hawks: Host Bulls on Thursday."}
{"game_id": "0022100927", "chunk_id": "0022100927_027", "order": 27, "role": "body", "text": "Celtics: Host Grizzlies on Thursday."}
