{"game_id": "0022101224", "chunk_id": "0022101224_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — Patrick Williams scored a career-high 35 points and Ayo Dosunmu had 26 points in a season-high 45 minutes as the Chicago Bulls hung on for a 124-120 victory over the Minnesota Timberwolves on Sunday night with both teams in rest-the-regulars mode in preparation for the postseason."}
{"game_id": "0022101224", "chunk_id": "0022101224_002", "order": 2, "role": "body", "text": "Troy Brown Jr. added 17 points and 11 rebounds for the Bulls, who played without four starters and stopped a four-game losing streak. They nearly blew a 28-point second quarter lead after a spirited rally by the deep reserves for the Timberwolves, who didn't use any starters in the second half."}
{"game_id": "0022101224", "chunk_id": "0022101224_003", "order": 3, "role": "body", "text": "The Bulls already had the No. 6 seed in the Eastern Conference bracket secured. They’ll face No. 3 seed Milwaukee in the first round, thanks to their concerning slide down the stretch. Chicago, which has returned to the playoffs after a four-year absence, shared the East’s best record with Miami at the All-Star break."}
{"game_id": "0022101224", "chunk_id": "0022101224_004", "order": 4, "role": "body", "text": "“We have to maintain a high level of competitive fight. They’re champions for a reason,\" coach Billy Donovan said. \"They’re battle-tested.”"}
{"game_id": "0022101224", "chunk_id": "0022101224_005", "order": 5, "role": "body", "text": "The Wolves, who were locked into seventh place in the Western Conference earlier in the week, will host the Los Angeles Clippers in a play-in game Tuesday night."}
{"game_id": "0022101224", "chunk_id": "0022101224_006", "order": 6, "role": "body", "text": "“It’s a good first step. This needs to be the foundation of what we’re trying to build, and regardless of what happens from here, we’ve got a lot of things that we’ve learned,” coach Chris Finch said."}
{"game_id": "0022101224", "chunk_id": "0022101224_007", "order": 7, "role": "body", "text": "Nathan Knight had 17 points and eight rebounds and Jaylen Nowell added 15 points for the Wolves, who outscored the Bulls 40-27 in the third quarter and pulled within 116-115 on a contested corner 3-pointer by little-used fan favorite Jake Layman with 1:42 to go."}
{"game_id": "0022101224", "chunk_id": "0022101224_008", "order": 8, "role": "body", "text": "Dosunmu, the only starter who played for the Bulls, dropped in a layup on the other end. The rookie from Illinois hit a 3-pointer on the next possession."}
{"game_id": "0022101224", "chunk_id": "0022101224_009", "order": 9, "role": "body", "text": "Williams, the fourth overall pick in the 2020 draft who missed 65 games earlier this season after tearing ligaments in his wrist and needing surgery, went 10 for 21 from the floor. Even when the stars are back, the Bulls need Williams to find his spots to score for them to upset the Bucks."}
{"game_id": "0022101224", "chunk_id": "0022101224_010", "order": 10, "role": "body", "text": "“I was running a lot of things at him tonight to try to get him to be like that,” Donovan said. “He took it upon himself to do the things that he did, even randomly.”"}
{"game_id": "0022101224", "chunk_id": "0022101224_012", "order": 12, "role": "body", "text": "The Bulls had only 10 available players, with four starters sidelined. DeMar DeRozan and Nikola Vucevic had the night off, Zach LaVine was shelved to give his nagging knee discomfort an extra break, and Coby White was out with a sprained toe. The Bulls have also been without point guard Lonzo Ball for the last three months with a knee injury that won't let him return for the playoffs."}
{"game_id": "0022101224", "chunk_id": "0022101224_013", "order": 13, "role": "body", "text": "The Timberwolves rested All-Star Karl-Anthony Towns and point guard D’Angelo Russell, who was officially listed with an illness but watched from the bench in a striped turtleneck. The third member of their star trio, Anthony Edwards, scored eight points in 18 minutes and didn't play in the second half. Neither did starter Jarred Vanderbilt."}
{"game_id": "0022101224", "chunk_id": "0022101224_014", "order": 14, "role": "body", "text": "“I’m real confident and real excited for what’s next for us,” Knight said."}
{"game_id": "0022101224", "chunk_id": "0022101224_016", "order": 16, "role": "body", "text": "Timberwolves firebrand Patrick Beverley joined Towns and Russell on the rest list after his ejection in the second quarter for drawing technical fouls 15 seconds apart. The trigger for Beverley was the absence of a foul call he argued for on a short jumper, and he aimed his complaining at referee David Guthrie. As Beverley jogged off the court, he gave referee Michael Smith a pat on the back."}
{"game_id": "0022101224", "chunk_id": "0022101224_018", "order": 18, "role": "body", "text": "Despite a 23-point halftime lead for the Bulls, coach Billy Donovan called two timeouts in the first two minutes of the third quarter. During the first one, he admonished Dosunmu for not taking better control of a disorganized offensive set."}
{"game_id": "0022101224", "chunk_id": "0022101224_020", "order": 20, "role": "body", "text": "The Bulls, who went 7-14 over the last 21 games, finished 46-36 for their best mark since 50-32 in 2014-15. That was also the last time they swept the two-game season series from the Wolves."}
{"game_id": "0022101224", "chunk_id": "0022101224_021", "order": 21, "role": "body", "text": "The Timberwolves finished with six losses in their last 10 games and landed at 46-36, their second-best record of the last 18 years. They were 47-35 in 2017-18, the only time they've made the playoffs since reaching the 2004 Western Conference finals."}
{"game_id": "0022101224", "chunk_id": "0022101224_023", "order": 23, "role": "body", "text": "Bulls: Backup guard Alex Caruso (bruised lower back) sat out for the third straight game. Donovan said he's not in danger of missing time in the playoffs."}
{"game_id": "0022101224", "chunk_id": "0022101224_024", "order": 24, "role": "body", "text": "Timberwolves: Backup center Greg Monroe, signed three days ago for some extra depth and experience in the post for the playoffs, had nine points and five assists in 18 minutes."}
{"game_id": "0022101224", "chunk_id": "0022101224_026", "order": 26, "role": "body", "text": "Bulls: The series against the defending NBA champion Bucks will begin in Milwaukee next weekend. The Bulls went 1-14 against the top four teams in the Eastern Conference this season, including 0-4 against the Bucks. They lost by four, six, 28 and 21 points in those matchups."}
{"game_id": "0022101224", "chunk_id": "0022101224_027", "order": 27, "role": "body", "text": "Timberwolves: If they beat the Clippers, they'll be the West's No. 7 seed and face Memphis in the first round starting next weekend. If the Wolves lose Tuesday, they'll stay home and play the San Antonio-New Orleans winner on Friday for the No. 8 seed."}
