{"game_id": "0022101212", "chunk_id": "0022101212_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Paul George put the Western Conference on notice that he is ready for the play-in tournament, and hopefully beyond."}
{"game_id": "0022101212", "chunk_id": "0022101212_002", "order": 2, "role": "body", "text": "George scored 23 points, tied a career high with 12 assists and added eight rebounds as the Los Angeles Clippers won their fourth straight game, beating the Sacramento Kings 117-98 on Saturday night."}
{"game_id": "0022101212", "chunk_id": "0022101212_003", "order": 3, "role": "body", "text": "The Clippers are 5-1 since George returned to the lineup. He is averaging 22.6 points, 5.6 rebounds and 6.8 assists after missing 43 games due to an elbow injury."}
{"game_id": "0022101212", "chunk_id": "0022101212_004", "order": 4, "role": "body", "text": "“The elbow’s fine. It feels pretty good,\" George said. \"Overall, I'm trying to take each possession for what it is and trying to make the best play possible."}
{"game_id": "0022101212", "chunk_id": "0022101212_005", "order": 5, "role": "body", "text": "“Honestly, I love settling for the role of being the playmaker instead of a scorer. With this team my ability to score is opening up passing and playmaking. It's easier when I can find guys to make baskets.”"}
{"game_id": "0022101212", "chunk_id": "0022101212_006", "order": 6, "role": "body", "text": "George played 34 minutes, his most since coming back. He will not play in Sunday's regular-season finale against Oklahoma City."}
{"game_id": "0022101212", "chunk_id": "0022101212_007", "order": 7, "role": "body", "text": "The Clippers will face Minnesota on Tuesday in the play-in tournament. A victory would send Los Angeles to the postseason for the fourth straight year and a first-round matchup against the second-seeded Memphis Grizzlies."}
{"game_id": "0022101212", "chunk_id": "0022101212_008", "order": 8, "role": "body", "text": "A loss to the Timberwolves would have the Clippers meeting New Orleans or San Antonio on Friday with one more chance to make the playoffs. The winner of that game would then get the top-seeded Phoenix Suns."}
{"game_id": "0022101212", "chunk_id": "0022101212_009", "order": 9, "role": "body", "text": "“We know them well, they know us well, it’ll be a tough game going into Minnesota,\" George said. \"We have a job to do. I'm looking forward to leading and being in that environment.”"}
{"game_id": "0022101212", "chunk_id": "0022101212_010", "order": 10, "role": "body", "text": "Norman Powell added 20 points off the bench and Ivica Zubac had 15 points and 12 rebounds for the Clippers, who led throughout."}
{"game_id": "0022101212", "chunk_id": "0022101212_011", "order": 11, "role": "body", "text": "Zubac had his 24th double-double of the season and the 60th of his six-year career, but this is the first time he did it by halftime, with 13 points and 12 rebounds."}
{"game_id": "0022101212", "chunk_id": "0022101212_012", "order": 12, "role": "body", "text": "“Defensively we did a lot of good things, and we were able to try some things with the second unit that should help us going forward,” coach Tyronn Lue said. “We had been trying to get Paul up to 35-36 minutes so we can push his minutes for the play-in tournament.\""}
{"game_id": "0022101212", "chunk_id": "0022101212_013", "order": 13, "role": "body", "text": "Davion Mitchell led Sacramento with 22 points, and Trey Lyles had 15."}
{"game_id": "0022101212", "chunk_id": "0022101212_014", "order": 14, "role": "body", "text": "George had 14 points during the first quarter when the Clippers scored the first nine points. Their largest lead in the first half was 20 points before the Kings went on a late run to get within 59-45 at halftime."}
{"game_id": "0022101212", "chunk_id": "0022101212_015", "order": 15, "role": "body", "text": "Sacramento then scored the first seven points of the second half to cut the margin in half. But the Clippers began to steadily pull away again. They went on a 19-5 run over the last five minutes of the third quarter to lead 92-71 going into the final 12 minutes. Powell had 10 points during the spurt."}
{"game_id": "0022101212", "chunk_id": "0022101212_016", "order": 16, "role": "body", "text": "“I didn’t think we started the game off the way we should, and then from there it was just an uphill battle for the rest of the night,” Kings coach Alvin Gentry said. “They've got Paul George and almost their whole team back. They're a good team and they are fighting for their lives.”"}
{"game_id": "0022101212", "chunk_id": "0022101212_018", "order": 18, "role": "body", "text": "Kings: Damian Jones had 12 points and tied a career high in a regular-season game with four steals. ... Neemias Queta had 10 points off the bench. ... Josh Jackson reached 250 career steals."}
{"game_id": "0022101212", "chunk_id": "0022101212_019", "order": 19, "role": "body", "text": "Clippers: Los Angeles was 21 of 43 on 3-pointers. It is the third time in the last four games the Clippers have made at least 20 from beyond the arc. ... Marcus Morris scored 11 points despite going 4 of 13 from the floor. ... Luke Kennard and Isaiah Hartenstein added 10 points apiece."}
{"game_id": "0022101212", "chunk_id": "0022101212_021", "order": 21, "role": "body", "text": "Kings: At Phoenix on Sunday night."}
{"game_id": "0022101212", "chunk_id": "0022101212_022", "order": 22, "role": "body", "text": "Clippers: Host Oklahoma City on Sunday night."}
