{"game_id": "0022100526", "chunk_id": "0022100526_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Giannis Antetokounmpo scored 33 points, Jrue Holiday added 25 points and Khris Middleton had 22 as the Milwaukee Bucks extended their winning streak to five games with a 136-118 victory over the Orlando Magic on Thursday night."}
{"game_id": "0022100526", "chunk_id": "0022100526_002", "order": 2, "role": "body", "text": "DeMarcus Cousins had 15 points off the bench for the Bucks, who completed a two-game sweep in Orlando. Antetokounmpo, who had his 11th 30-point game, added 12 rebounds for his 18th double-double."}
{"game_id": "0022100526", "chunk_id": "0022100526_003", "order": 3, "role": "body", "text": "\"For sure, we have a complete team — great guys, great teammates and great talent — and the more we play together, the better we will get,” Antetokounmpo said. “The sky is the limit for this team, but we’ve got to stay humble and stay hungry.”"}
{"game_id": "0022100526", "chunk_id": "0022100526_004", "order": 4, "role": "body", "text": "Franz Wagner, coming off a career-best 38-point effort on Tuesday, scored 20 points for Orlando. Moritz Wagner, older brother of the Magic rookie, had a season-best 19 points. Gary Harris added 17 points. Wendell Carter Jr. had 14 points and 10 rebounds as Orlando lost its fourth straight game and fell to 2-13 at home."}
{"game_id": "0022100526", "chunk_id": "0022100526_005", "order": 5, "role": "body", "text": "Antetokounmpo was too much for Orlando to handle."}
{"game_id": "0022100526", "chunk_id": "0022100526_006", "order": 6, "role": "body", "text": "“You want to get it out of (Antetokounmpo’s) hands, but he’s got four shooters around him,” Orlando coach Jamahl Mosley said. “You say you will live with certain things, but he’s so efficient in how he gets to the rim. They’re world champs for a reason.”"}
{"game_id": "0022100526", "chunk_id": "0022100526_007", "order": 7, "role": "body", "text": "Milwaukee swept the four-game season series against the rebuilding Magic and pushed its winning streak against Orlando to 11 games, dating to 2019. The Bucks’ only longer active winning streak is a 12-game run against Detroit. Nine of Milwaukee’s last 11 wins over the Magic have been by double figures, including three routs this season."}
{"game_id": "0022100526", "chunk_id": "0022100526_008", "order": 8, "role": "body", "text": "The Bucks improved to 7-0 this season when three players scored at least 20 points. Also, their 136 points were a season high, and they are 10-0 when topping 120 points."}
{"game_id": "0022100526", "chunk_id": "0022100526_009", "order": 9, "role": "body", "text": "“To play off those three — Jrue, Khris and Giannis, we’re very fortunate to have enough to win on the road,” Milwaukee coach Mike Budenholzer said. “That’s the key to being a good NBA team — you’ve got to have players. (GM) Jon Horst and the front office have done a great job of putting together a roster with a lot of depth and a lot of different ways (to win). I love our roster and love the talent up and down it.”"}
{"game_id": "0022100526", "chunk_id": "0022100526_010", "order": 10, "role": "body", "text": "The Bucks, who improved to a season-best 11 games over .500, broke open a close game with a 17-5 outburst to close the third quarter. Antetokounmpo then scored 14 of Milwaukee’s first 17 points of the fourth quarter. He finished with 16 points in the final period."}
{"game_id": "0022100526", "chunk_id": "0022100526_011", "order": 11, "role": "body", "text": "Orlando used a sizable second-half run to wipe out a big deficit. The Magic used a 17-3 run to tie the game at 71-all, prompting injured Magic players Cole Anthony and Jalen Suggs to playfully dance along the sidelines."}
{"game_id": "0022100526", "chunk_id": "0022100526_012", "order": 12, "role": "body", "text": "Orlando’s only second-half lead, at 80-79, lasted five seconds, and Milwaukee responded with 10 straight points and a 17-5 run to regain control."}
{"game_id": "0022100526", "chunk_id": "0022100526_014", "order": 14, "role": "body", "text": "Franz Wagner entered the game tied for first in scoring among NBA rookies at 15.6 points per game. The No. 8 pick in last summer’s draft also ranks seventh in rebounding (4.7), sixth in assists (2.7) and second in 3-point shooting (36.4%)."}
{"game_id": "0022100526", "chunk_id": "0022100526_015", "order": 15, "role": "body", "text": "“We continue to talk about and say the level of professionalism that you have to have every day to make yourself successful, and that’s what he does,” Orlando coach Jamahl Mosley said of the rookie."}
{"game_id": "0022100526", "chunk_id": "0022100526_017", "order": 17, "role": "body", "text": "Bucks: Holiday had double-digit assists just once in the team’s first 23 games, but he’s since done it three times in a six-game span. He came into Thursday averaging 24.8 points and 8.2 assists over the previous six games."}
{"game_id": "0022100526", "chunk_id": "0022100526_018", "order": 18, "role": "body", "text": "Magic: Out the past six games while in the NBA’s health and safety protocols, Mo Bamba rejoined his teammates on the bench. … Robin Lopez, who spent the 2019-20 season alongside brother, Brook Lopez, in Milwaukee, was placed in the protocols on Thursday. He joined teammate Hassani Gravett, who left Tuesday’s game early after feeling ill."}
{"game_id": "0022100526", "chunk_id": "0022100526_020", "order": 20, "role": "body", "text": "Bucks: Host New Orleans on Saturday."}
