{"game_id": "0022100816", "chunk_id": "0022100816_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young scored 34 points and the Atlanta Hawks regained their 3-point touch, overwhelming the trade-depleted Indiana Pacers 133-112 on Tuesday night."}
{"game_id": "0022100816", "chunk_id": "0022100816_002", "order": 2, "role": "body", "text": "After making only 5 of 25 3s in Sunday’s 103-94 loss at Dallas, the Hawks sank 17 of 33 long-range shots. They set a season high by making 51.5% of their 3s."}
{"game_id": "0022100816", "chunk_id": "0022100816_003", "order": 3, "role": "body", "text": "“Good to get out of that rut,” said John Collins, who had two 3s while scoring 20 points. “Good to see the ball go in. Hopefully that gives us confidence.”"}
{"game_id": "0022100816", "chunk_id": "0022100816_004", "order": 4, "role": "body", "text": "Young was 6 of 9 on 3s after missing each of his six in the loss at Dallas."}
{"game_id": "0022100816", "chunk_id": "0022100816_005", "order": 5, "role": "body", "text": "“I had missed my last 10 before this one, so to make my first two felt good,” Young said."}
{"game_id": "0022100816", "chunk_id": "0022100816_006", "order": 6, "role": "body", "text": "The Hawks regrouped after losing two straight games and three of four. Young, Collins and most starters sat out the fourth quarter."}
{"game_id": "0022100816", "chunk_id": "0022100816_007", "order": 7, "role": "body", "text": "Chris Duarte led the Pacers with 25 points. Lance Stephenson had 24 points, nine rebounds and eight assists in his first start of the season."}
{"game_id": "0022100816", "chunk_id": "0022100816_008", "order": 8, "role": "body", "text": "The Pacers had only eight healthy players. Thursday's six-player trade sent three players, including two-time All-Star forward Domantas Sabonis, to Sacramento."}
{"game_id": "0022100816", "chunk_id": "0022100816_009", "order": 9, "role": "body", "text": "Indiana also traded forward Justin Holiday, guard Jeremy Lamb and a second-round draft pick to Sacramento. The Pacers received point guard Tyrese Haliburton, 3-point specialist Buddy Hield and Tristan Thompson, whose experience in the post will be important following the exit of Sabonis, from the Kings."}
{"game_id": "0022100816", "chunk_id": "0022100816_010", "order": 10, "role": "body", "text": "The trade became official after the game."}
{"game_id": "0022100816", "chunk_id": "0022100816_011", "order": 11, "role": "body", "text": "“It’s an exciting trade and it changes the landscape significantly,” said Pacers coach Rick Carlisle."}
{"game_id": "0022100816", "chunk_id": "0022100816_012", "order": 12, "role": "body", "text": "“We’re getting three players who are good now and in the case of Tyrese, he has a chance to continue to grow. ... Finding a franchise-caliber point guard at age 21 is extremely difficult to do.\""}
{"game_id": "0022100816", "chunk_id": "0022100816_013", "order": 13, "role": "body", "text": "The Hawks, who are 10th in the Eastern Conference, answered a challenge from coach Nate McMillan. He said before facing the Pacers “it's definitely that time of the season” for the Hawks to improve their playoff standing."}
{"game_id": "0022100816", "chunk_id": "0022100816_014", "order": 14, "role": "body", "text": "McMillan said the goal is to finish among the top six teams in the conference and avoid the play-in tournament."}
{"game_id": "0022100816", "chunk_id": "0022100816_015", "order": 15, "role": "body", "text": "“We’re not talking the top 10,” McMillan said. “We’re talking the top six where you’re guaranteed a position. We have a lot of ground to make up and it started tonight.”"}
{"game_id": "0022100816", "chunk_id": "0022100816_016", "order": 16, "role": "body", "text": "McMillan was impressed the Hawks were not distracted by the Pacers' trade."}
{"game_id": "0022100816", "chunk_id": "0022100816_017", "order": 17, "role": "body", "text": "“I just like our approach to the game, taking care of business tonight and respecting the game,” McMillan said. “They were all business all night long tonight and we were able to control the game all night long.”"}
{"game_id": "0022100816", "chunk_id": "0022100816_019", "order": 19, "role": "body", "text": "Pacers: G Malcolm Brogdon (right Achilles soreness) and F Isaiah Jackson (right ankle sprain) were held out with injuries. ... Terry Taylor had seven points and 10 rebounds. Oshae Brissett had 15 points."}
{"game_id": "0022100816", "chunk_id": "0022100816_020", "order": 20, "role": "body", "text": "Hawks: Young had 11 assists for his third consecutive game against the Pacers with at least 30 points and 10 assists. ... Atlanta made 10 of 14 3s in the first half. ... Clint Capela had 12 rebounds."}
{"game_id": "0022100816", "chunk_id": "0022100816_021", "order": 21, "role": "body", "text": "YOUNG WANTS 3-POINT REDEMPTION"}
{"game_id": "0022100816", "chunk_id": "0022100816_022", "order": 22, "role": "body", "text": "Young, who will start in the All-Star Game, was announced on Thursday as a participant in the 3-point contest at the All-Star weekend."}
{"game_id": "0022100816", "chunk_id": "0022100816_023", "order": 23, "role": "body", "text": "“I’m excited to redeem myself from my performance at my last 3-point contest,” Young said."}
{"game_id": "0022100816", "chunk_id": "0022100816_024", "order": 24, "role": "body", "text": "He was eliminated in the first round of the 2020 contest."}
{"game_id": "0022100816", "chunk_id": "0022100816_026", "order": 26, "role": "body", "text": "Atlanta delivered one of its best offensive games of the season. The Hawks set a season high for points in any half by taking a 76-50 halftime lead. Their 36 assists, including 22 in the first half, also set season highs."}
{"game_id": "0022100816", "chunk_id": "0022100816_027", "order": 27, "role": "body", "text": "They finished one point below their season high of 134 points against Minnesota on Jan. 19."}
{"game_id": "0022100816", "chunk_id": "0022100816_028", "order": 28, "role": "body", "text": "McMillan said the 22 first-half assists were “just unbelievable.”"}
{"game_id": "0022100816", "chunk_id": "0022100816_030", "order": 30, "role": "body", "text": "Pacers: Host Cleveland on Friday night."}
{"game_id": "0022100816", "chunk_id": "0022100816_031", "order": 31, "role": "body", "text": "Hawks: Host San Antonio on Friday night."}
