{"game_id": "0022100670", "chunk_id": "0022100670_001", "order": 1, "role": "lead", "text": "ATLANTA -- — After leading Atlanta to back-to-back wins for the first time in almost two months, Trae Young wasn't ready to say the Hawks have regained last season's winning formula."}
{"game_id": "0022100670", "chunk_id": "0022100670_002", "order": 2, "role": "body", "text": "It's far too early to talk about a return to the Eastern Conference finals for the Hawks, who are still only 12th in the conference and on the outside of the playoff standings."}
{"game_id": "0022100670", "chunk_id": "0022100670_003", "order": 3, "role": "body", "text": "Young scored 23 of his 37 points in the third quarter, sparking Atlanta's comeback, and the Hawks beat the Minnesota Timberwolves 134-122 on Wednesday night."}
{"game_id": "0022100670", "chunk_id": "0022100670_004", "order": 4, "role": "body", "text": "“I think we’ve just got to keep doing what we’re doing and take it one game at a time and not look too far ahead,” Young said, adding the Hawks' focus should be to “try to climb back into this thing.”"}
{"game_id": "0022100670", "chunk_id": "0022100670_005", "order": 5, "role": "body", "text": "Led by Young, who had 14 assists, the Hawks opened the second half with a 20-2 run after the Timberwolves led 73-61 at halftime."}
{"game_id": "0022100670", "chunk_id": "0022100670_006", "order": 6, "role": "body", "text": "“That’s the way you hope your team responds to a challenge,” said Hawks coach Nate McMillan."}
{"game_id": "0022100670", "chunk_id": "0022100670_007", "order": 7, "role": "body", "text": "Minnesota’s biggest lead was 16 points in the first quarter."}
{"game_id": "0022100670", "chunk_id": "0022100670_008", "order": 8, "role": "body", "text": "De'Andre Hunter had 22 points for Atlanta. D’Angelo Russell led Minnesota with 31 points."}
{"game_id": "0022100670", "chunk_id": "0022100670_009", "order": 9, "role": "body", "text": "Minnesota's Anthony Edwards drew two technical fouls and was ejected with 5:57 remaining in the third quarter. Edwards thought he had been fouled on a drive to the basket and continued to argue his case following his first technical."}
{"game_id": "0022100670", "chunk_id": "0022100670_010", "order": 10, "role": "body", "text": "The loss of Edwards, who had 20 points, left Minnesota without two starters. Guard Patrick Beverley left the game with a right ankle sprain in the first period. Following the game, coach Chris Finch said he had no update on the severity of the injury."}
{"game_id": "0022100670", "chunk_id": "0022100670_011", "order": 11, "role": "body", "text": "Edwards' ejection was costly and reflected the Timberwolves' frustration in blowing the halftime advantage. Finch said Edwards apologized to his teammates."}
{"game_id": "0022100670", "chunk_id": "0022100670_012", "order": 12, "role": "body", "text": "“I was pretty frustrated,” Finch said of the technical foul. “... And I was also frustrated with the way we were playing overall. I kept saying we’ve got enough game left to get back into it but we never could get enough stops.”"}
{"game_id": "0022100670", "chunk_id": "0022100670_013", "order": 13, "role": "body", "text": "Atlanta outscored Minnesota 45-20 in the third, setting a season high for points in any quarter."}
{"game_id": "0022100670", "chunk_id": "0022100670_014", "order": 14, "role": "body", "text": "Young opened the second half by making two 3-pointers. The 20-2 run was capped by another 3 from Young, leaving Atlanta with an 81-75 lead. Young was scoreless in the opening period and had only seven points in the first half before his scoring surge."}
{"game_id": "0022100670", "chunk_id": "0022100670_015", "order": 15, "role": "body", "text": "The Timberwolves (22-23) fell below .500."}
{"game_id": "0022100670", "chunk_id": "0022100670_016", "order": 16, "role": "body", "text": "After snapping a string of 10 consecutive home losses with a 121-113 win over defending NBA champion Milwaukee on Monday night, the Hawks (19-25) have won back-to-back games for the first time since a seven-game winning streak from Nov. 14-26."}
{"game_id": "0022100670", "chunk_id": "0022100670_018", "order": 18, "role": "body", "text": "Timberwolves: Karl-Anthony Towns had 17 points, 10 rebounds and seven assists before fouling out with 1:01 remaining. ... Edwards' first career ejection came in the homecoming for the Atlanta native and former University of Georgia standout. ... Assistant coach Pablo Prigioni returned after missing six games due to health and safety protocols."}
{"game_id": "0022100670", "chunk_id": "0022100670_019", "order": 19, "role": "body", "text": "Hawks: C Clint Capela (left ankle sprain) participated in conditioning drills, including running, on Wednesday before missing his sixth consecutive game. Capela hasn't participated in live team drills. Onyeka Okongwu had 17 points, eight rebounds and five blocked shots. ... G Bogdan Bogdanovic (right knee soreness) missed his third straight game."}
{"game_id": "0022100670", "chunk_id": "0022100670_021", "order": 21, "role": "body", "text": "There were more frustrations for the Timberwolves to close the third quarter when an apparent basket by Towns was nullified. Towns was called for a flagrant foul and a technical foul after extending his leg and hitting Okongwu on the shot."}
{"game_id": "0022100670", "chunk_id": "0022100670_022", "order": 22, "role": "body", "text": "“I’ve never seen it in NBA basketball,” Towns said when asked about the calls, which required a lengthy review by the officials."}
{"game_id": "0022100670", "chunk_id": "0022100670_023", "order": 23, "role": "body", "text": "Towns declined to say more about the play."}
{"game_id": "0022100670", "chunk_id": "0022100670_024", "order": 24, "role": "body", "text": "“Telling the truth in this league gets you fined, so no comment,” he said."}
{"game_id": "0022100670", "chunk_id": "0022100670_025", "order": 25, "role": "body", "text": "Finch said he was “not 100% clear” on the calls."}
{"game_id": "0022100670", "chunk_id": "0022100670_026", "order": 26, "role": "body", "text": "“I guess they went to the review to see if the shot was good and then were able to determine that it was a flagrant somehow,” Finch said. “I didn’t even know that was possible. And then the technical to boot.”"}
{"game_id": "0022100670", "chunk_id": "0022100670_028", "order": 28, "role": "body", "text": "Timberwolves: Return home to play Brooklyn on Sunday night. The Nets took a 110-105 home win over Minnesota on Dec. 3."}
{"game_id": "0022100670", "chunk_id": "0022100670_029", "order": 29, "role": "body", "text": "Hawks: Continue four-game homestand on Friday night when they play Miami for the third time in 10 days. The Heat took a 124-118 home win over Atlanta on Friday night and a 115-91 win at Atlanta on Jan. 12."}
