{"game_id": "0022100111", "chunk_id": "0022100111_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Joel Embiid had 18 points, nine rebounds and seven assists in his return to the lineup, and Seth Curry scored 22 points and hit a crucial jumper late to lead the Philadelphia 76ers over the Chicago Bulls 103-98 on Wednesday night."}
{"game_id": "0022100111", "chunk_id": "0022100111_002", "order": 2, "role": "body", "text": "Georges Niang added 18 points for the short-handed 76ers, who have won four in a row."}
{"game_id": "0022100111", "chunk_id": "0022100111_003", "order": 3, "role": "body", "text": "In addition to Ben Simmons (personal reasons), who has missed all eight games, Philadelphia was without starters Tobias Harris (health and safety protocols) and Danny Green (hamstring)."}
{"game_id": "0022100111", "chunk_id": "0022100111_004", "order": 4, "role": "body", "text": "DeMar DeRozan tied a season high with 37 points for Chicago and grabbed 10 rebounds. Zach LaVine scored 27 for the Bulls, who nearly came back from a double-digit deficit in the second half for the second straight game."}
{"game_id": "0022100111", "chunk_id": "0022100111_005", "order": 5, "role": "body", "text": "Curry hit a tough elbow jumper with 10.7 seconds left to put the 76ers ahead 102-98."}
{"game_id": "0022100111", "chunk_id": "0022100111_006", "order": 6, "role": "body", "text": "“Once he gets open with Joel coming (to screen), it’s a tough cover,” 76ers coach Doc Rivers said. “He’s our best shooter.”"}
{"game_id": "0022100111", "chunk_id": "0022100111_007", "order": 7, "role": "body", "text": "“I thought we did a pretty good job,” Bulls coach Billy Donovan said. “Give Curry credit.”"}
{"game_id": "0022100111", "chunk_id": "0022100111_008", "order": 8, "role": "body", "text": "Chicago, which trailed by 15 in the second half, erased its 12-point deficit to start the fourth quarter when DeRozan drained a 16-footer to tie it at 87 with 6:40 to play, as Philadelphia missed nine of 10 shots to begin the final period."}
{"game_id": "0022100111", "chunk_id": "0022100111_009", "order": 9, "role": "body", "text": "“Their defense got into us,” Rivers said."}
{"game_id": "0022100111", "chunk_id": "0022100111_010", "order": 10, "role": "body", "text": "But the Bulls went cold from that point, going 0 for 5 with a pair of turnovers until Alex Caruso’s dunk with 2:54 left trimmed Philadelphia’s lead to 98-91."}
{"game_id": "0022100111", "chunk_id": "0022100111_011", "order": 11, "role": "body", "text": "Embiid helped the Sixers build that advantage, scoring on a putback that made it 94-89 with five minutes left. Although he missed the chance to convert a three-point play, Embiid made a pair from the stripe the next time down and the 76ers were comfortably up 98-89 on Tyrese Maxey’s layup with 4:11 left."}
{"game_id": "0022100111", "chunk_id": "0022100111_012", "order": 12, "role": "body", "text": "The Bulls, who came back from a 19-point second-half margin in Monday’s 128-114 win at Boston, didn’t go away, though. Lonzo Ball’s 3 with a minute left and DeRozan’s baseline jumper pulled them to 100-98 with 29.9 seconds left."}
{"game_id": "0022100111", "chunk_id": "0022100111_013", "order": 13, "role": "body", "text": "It looked as though the Bulls would have a chance to get closer when Embiid was called for a foul on DeRozan, but officials reversed it after a replay review."}
{"game_id": "0022100111", "chunk_id": "0022100111_014", "order": 14, "role": "body", "text": "“It’s huge when your best player really wants to win that bad, and is willing to go up there and sacrifice a knee to the groin or elbow to the face and make a winning play,” Niang said. “That doesn’t happen everywhere, so Joel is special for making the winning play.”"}
{"game_id": "0022100111", "chunk_id": "0022100111_015", "order": 15, "role": "body", "text": "Chicago trailed by 18 in the first half when Embiid hit a 16-foot pull-up jumper with 1:48 left before the break. DeRozan had one of the highlights of the first half with a one-handed dunk with 2:49 remaining."}
{"game_id": "0022100111", "chunk_id": "0022100111_017", "order": 17, "role": "body", "text": "Donovan acknowledged that trying to come back from big deficits is tough, but he likes his team’s resolve."}
{"game_id": "0022100111", "chunk_id": "0022100111_018", "order": 18, "role": "body", "text": "“I do feel very, very good about our guys’ ability to fight, and it’s a great characteristic to have,” he said."}
{"game_id": "0022100111", "chunk_id": "0022100111_019", "order": 19, "role": "body", "text": "Said DeRozan: “Every guy on this team is definitely resilient. We’re going to fight until the end. Now it’s about just channeling that energy from the start of the game and understanding we have to play as close to a 48-minute game as possible. We can’t have too many lapses. Teams are too good in this league to have lapses and they take advantage of it.”"}
{"game_id": "0022100111", "chunk_id": "0022100111_021", "order": 21, "role": "body", "text": "Embiid returned to the lineup after sitting out a victory over the Trail Blazers for rest. It was the first missed game of the season for the four-time All-Star, who played just 51 games last season due to injuries and rest on his way to finishing runner-up in the MVP race."}
{"game_id": "0022100111", "chunk_id": "0022100111_023", "order": 23, "role": "body", "text": "Bulls: Coby White (left shoulder) has missed all eight games after offseason shoulder surgery. Patrick Williams (left wrist) sat out for the third straight game in what is expected to be a 4-6 month absence after being injured against the Knicks on Oct. 26. … LaVine said he banged knees with Embiid on the first play of the game."}
{"game_id": "0022100111", "chunk_id": "0022100111_024", "order": 24, "role": "body", "text": "76ers: Harris tested positive for COVID-19 and Rivers told reporters before the game that Harris is dealing with symptoms. … Rivers also said Green is likely to miss at least a couple more games. Green was injured in the third quarter of Monday’s 113-103 win over Portland, a game Harris also missed."}
{"game_id": "0022100111", "chunk_id": "0022100111_026", "order": 26, "role": "body", "text": "Bulls: Have lost eight in a row to Philadelphia. The Bulls last beat the 76ers on March 6, 2019. … It was the third straight 30-point game for DeRozan."}
{"game_id": "0022100111", "chunk_id": "0022100111_027", "order": 27, "role": "body", "text": "76ers: Finished a 4-0 homestand. … Philadelphia wore throwback jerseys from the 1970s, and the court was stamped with the Spectrum logo from their former home prior to their current one at the Wells Fargo Center. … Seven players hit 3-pointers as Philadelphia was 12 of 28 from beyond the arc."}
{"game_id": "0022100111", "chunk_id": "0022100111_029", "order": 29, "role": "body", "text": "Bulls: Host the 76ers on Saturday night."}
{"game_id": "0022100111", "chunk_id": "0022100111_030", "order": 30, "role": "body", "text": "76ers: At the Detroit Pistons on Thursday night."}
