{"game_id": "0022101139", "chunk_id": "0022101139_001", "order": 1, "role": "lead", "text": "BOSTON -- — An untimely losing streak has left the Miami Heat with some late-season competition for the Eastern Conference’s top seed."}
{"game_id": "0022101139", "chunk_id": "0022101139_002", "order": 2, "role": "body", "text": "They took a step toward regaining some of the ground they lost recently against one of their chief challengers."}
{"game_id": "0022101139", "chunk_id": "0022101139_003", "order": 3, "role": "body", "text": "Jimmy Butler scored 24 points, Kyle Lowry added 23 and the Miami Heat rallied in the fourth quarter to hold off the Boston Celtics 106-98 on Wednesday night to stay atop the tight race for the conference’s top seed."}
{"game_id": "0022101139", "chunk_id": "0022101139_004", "order": 4, "role": "body", "text": "Bam Adebayo finished with 17 points and 12 rebounds as Miami posted its second straight win since a season-worst four-game losing streak."}
{"game_id": "0022101139", "chunk_id": "0022101139_005", "order": 5, "role": "body", "text": "“I think we did a good job of just communicating and being there for each other,” Lowry said."}
{"game_id": "0022101139", "chunk_id": "0022101139_006", "order": 6, "role": "body", "text": "After briefly taking over the East’s top spot, Boston has lost two in a row for the first time since late January."}
{"game_id": "0022101139", "chunk_id": "0022101139_007", "order": 7, "role": "body", "text": "Jaylen Brown led the Celtics with 28 points and 10 rebounds. Jayson Tatum added 23 points and six assists."}
{"game_id": "0022101139", "chunk_id": "0022101139_008", "order": 8, "role": "body", "text": "Despite the loss, Tatum said in the long run it will help strengthen the mettle of this team."}
{"game_id": "0022101139", "chunk_id": "0022101139_009", "order": 9, "role": "body", "text": "“It’s a good thing for us to learn from,\" Tatum said. “The season is not decided today. We've still got games to play, playoffs. So, we'll be good.”"}
{"game_id": "0022101139", "chunk_id": "0022101139_010", "order": 10, "role": "body", "text": "The back-and-forth game had very much the intensity of a playoff matchup, featuring nine ties and 16 lead changes."}
{"game_id": "0022101139", "chunk_id": "0022101139_011", "order": 11, "role": "body", "text": "Trailing by four points entering the fourth, Miami outscored Boston 27-15 over the final 12 minutes with a level of execution that has been missing over the past few weeks."}
{"game_id": "0022101139", "chunk_id": "0022101139_012", "order": 12, "role": "body", "text": "“We’ve gotten a lot better of knowing where the ball has to go,” Butler said. “Putting everybody in the position that they need to be in to be successful.”"}
{"game_id": "0022101139", "chunk_id": "0022101139_013", "order": 13, "role": "body", "text": "Miami led by just a point at the half, but opened an 11-point cushion at the start of the third quarter."}
{"game_id": "0022101139", "chunk_id": "0022101139_014", "order": 14, "role": "body", "text": "The Celtics answered, running off 16 straight points to nudge back in front and eventually carried a 83-79 edge into the fourth."}
{"game_id": "0022101139", "chunk_id": "0022101139_015", "order": 15, "role": "body", "text": "It grew to 90-85 with 7:40 remaining when Daniel Theis tipped in a lob from Derrick White through contact from Dewayne Dedmon, who fouled out on the play."}
{"game_id": "0022101139", "chunk_id": "0022101139_016", "order": 16, "role": "body", "text": "The Heat stayed composed and responded with 12-3 spurt to take a 98-93 lead on a short jumper by Butler."}
{"game_id": "0022101139", "chunk_id": "0022101139_017", "order": 17, "role": "body", "text": "Boston cut it 98-96 with less than three minutes left, but came up empty on three straight possessions."}
{"game_id": "0022101139", "chunk_id": "0022101139_018", "order": 18, "role": "body", "text": "Lowry broke the stalemate with a jumper. Brown then had his shot blocked on the the Celtics' next trip, and Lowry fed Butler for a fastbreak dunk to make it 102-96 with 1:43 left to play."}
{"game_id": "0022101139", "chunk_id": "0022101139_019", "order": 19, "role": "body", "text": "Boston had its own transition chance trailing 102-98 before Tatum was called for an offensive foul. The Celtics challenged the call, but it stood after review."}
{"game_id": "0022101139", "chunk_id": "0022101139_020", "order": 20, "role": "body", "text": "After another miss by Boston that was called out of bounds on Boston, Marcus Smart threw his hands up in frustration at the call and was ejected."}
{"game_id": "0022101139", "chunk_id": "0022101139_021", "order": 21, "role": "body", "text": "Miami was then able to close out the game on the free throw line."}
{"game_id": "0022101139", "chunk_id": "0022101139_022", "order": 22, "role": "body", "text": "Coach Erik Spoelstra said he likes the seeds his team is planting with the playoffs looming."}
{"game_id": "0022101139", "chunk_id": "0022101139_023", "order": 23, "role": "body", "text": "“That’s why I like going through all these kind of games during the regular season,” Spoelstra said. “We had our share of challenges going down the stretch. But what I love about this group is we come in the next day, work at it and really try to get better. Those experiences make you stronger.”"}
{"game_id": "0022101139", "chunk_id": "0022101139_025", "order": 25, "role": "body", "text": "Heat: Caleb Martin sat out with a right calf bruise."}
{"game_id": "0022101139", "chunk_id": "0022101139_026", "order": 26, "role": "body", "text": "Celtics: Grant Williams took Robert Williams place in the starting lineup. ... Tatum was whistled for a technical foul late in the second quarter after complaining about a foul on Butler."}
{"game_id": "0022101139", "chunk_id": "0022101139_028", "order": 28, "role": "body", "text": "Wednesday marked the first true glimpse at what the Celtics’ lineup and rotations will look like for the foreseeable future with center Robert Williams III sidelined following knee surgery."}
{"game_id": "0022101139", "chunk_id": "0022101139_029", "order": 29, "role": "body", "text": "Things started a little rocky for Boston with Miami jumping out to an early 8-3 lead, scoring some wide-open baskets as it capitalized on some early miscommunication by the Celtics on the defensive end."}
{"game_id": "0022101139", "chunk_id": "0022101139_030", "order": 30, "role": "body", "text": "Boston cleaned that up in the second quarter by limiting the Heat to one-shot possessions, forcing turnovers and converting them into points."}
{"game_id": "0022101139", "chunk_id": "0022101139_031", "order": 31, "role": "body", "text": "Miami took a 53-52 advantage into halftime, with both teams virtually mirroring each other on the stat sheet."}
{"game_id": "0022101139", "chunk_id": "0022101139_032", "order": 32, "role": "body", "text": "The Heat shot 46% from the field with 14 assists, knocking down eight of 19 from the 3-pont line. The Celtics shot 45% from the floor with 14 assists, connecting on eight of 21 of their shots from beyond the arc."}
{"game_id": "0022101139", "chunk_id": "0022101139_034", "order": 34, "role": "body", "text": "Heat: Continue three-game road trip at Chicago on Saturday."}
{"game_id": "0022101139", "chunk_id": "0022101139_035", "order": 35, "role": "body", "text": "Celtics: Host Indiana on Friday."}
