{"game_id": "0022100626", "chunk_id": "0022100626_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — De’Aaron Fox scored 29 points, Chimezie Metu made a clutch 3-pointer with 46.7 seconds remaining and the Sacramento Kings ended their longest losing streak of the season by beating the Los Angeles Lakers 125-116 on Wednesday night."}
{"game_id": "0022100626", "chunk_id": "0022100626_002", "order": 2, "role": "body", "text": "Harrison Barnes added 23 points and seven rebounds for the Kings, who dropped their previous five games. Tyrese Haliburton had 14 points and 10 assists."}
{"game_id": "0022100626", "chunk_id": "0022100626_003", "order": 3, "role": "body", "text": "LeBron James had 34 points, seven rebounds and six assists for the Lakers. Malik Monk scored 22."}
{"game_id": "0022100626", "chunk_id": "0022100626_004", "order": 4, "role": "body", "text": "“It was a much-needed win,” Kings interim coach Alvin Gentry said. “We did a good job of attacking the paint — we ended up with 70 points in the paint. That was the difference in the game, we were able to get the ball to the basket.”"}
{"game_id": "0022100626", "chunk_id": "0022100626_005", "order": 5, "role": "body", "text": "The Lakers trailed by 10 but cut it to 118-116 following a layup by James. Fox came back with a 12-footer near the right elbow and, after Russell Westbrook missed a 3-pointer, Metu made his big shot from the top of the arc."}
{"game_id": "0022100626", "chunk_id": "0022100626_006", "order": 6, "role": "body", "text": "Avery Bradley missed a 3 for the Lakers, and Haliburton made a pair of free throws to finish the scoring."}
{"game_id": "0022100626", "chunk_id": "0022100626_007", "order": 7, "role": "body", "text": "The Lakers repeatedly built sizeable leads but then let them slip away. They led by six at halftime before the Kings took control in the third quarter, outscoring Los Angeles 40-23."}
{"game_id": "0022100626", "chunk_id": "0022100626_008", "order": 8, "role": "body", "text": "“We knew if we didn’t put up a stand, put up a fight in the third, we would let this slip away like the previous five,” Barnes said. “Tonight from start to finish we did a good job of sticking to the game plan, everyone providing energy, competing. Things that we haven’t done consistently.”"}
{"game_id": "0022100626", "chunk_id": "0022100626_009", "order": 9, "role": "body", "text": "Sacramento didn’t trail after that, sending the Lakers (21-21) to their second consecutive loss after winning four in a row."}
{"game_id": "0022100626", "chunk_id": "0022100626_010", "order": 10, "role": "body", "text": "“It’s been an up-and-down season, that’s why we’re at .500,” James said. “The third quarter tonight, their tempo was too much for us. We couldn’t handle it.”"}
{"game_id": "0022100626", "chunk_id": "0022100626_011", "order": 11, "role": "body", "text": "Los Angeles led most of the first half."}
{"game_id": "0022100626", "chunk_id": "0022100626_012", "order": 12, "role": "body", "text": "James made four straight shots and then fed Austin Reaves, who was fouled while dunking and converted the three-point play. Reaves later made a 3-pointer that put Los Angeles ahead 51-39."}
{"game_id": "0022100626", "chunk_id": "0022100626_013", "order": 13, "role": "body", "text": "Trailing 67-53, the Kings closed the first half on an 8-0 run and then scored the first five points of the third quarter."}
{"game_id": "0022100626", "chunk_id": "0022100626_014", "order": 14, "role": "body", "text": "Fox fueled another big run later in the third when Sacramento scored 15 straight and led 92-79."}
{"game_id": "0022100626", "chunk_id": "0022100626_015", "order": 15, "role": "body", "text": "“For the second game in a row, our defense let us down,” Lakers coach Frank Vogel said. “We have to figure out what we’re doing there and be better in that situation.”"}
{"game_id": "0022100626", "chunk_id": "0022100626_017", "order": 17, "role": "body", "text": "Monk has had some of his best games this season against the Kings. In four games versus Sacramento, Monk has put up 88 total points for a 22.0 average — 10 points better than his overall average."}
{"game_id": "0022100626", "chunk_id": "0022100626_019", "order": 19, "role": "body", "text": "After Trevor Ariza blocked a shot by Fox, James grabbed the rebound and fed the ball to Monk sprinting down the right side of the court. Monk drove toward the basket and laid the ball high off the glass for James, who was cutting through the lane and dunked."}
{"game_id": "0022100626", "chunk_id": "0022100626_021", "order": 21, "role": "body", "text": "“We knew offensively we can get whatever we want. We just have to put it in the hoop.” — Haliburton."}
{"game_id": "0022100626", "chunk_id": "0022100626_023", "order": 23, "role": "body", "text": "Lakers: James has scored 31 or more in 11 of his last 12 games. … Reaves had a season-high 19 points on 7-of-10 shooting with four 3s. … Carmelo Anthony was held out because of lower back tightness. ... Sekou Doumbouya was signed to a two-way contract."}
{"game_id": "0022100626", "chunk_id": "0022100626_024", "order": 24, "role": "body", "text": "Kings: Richaun Holmes has cleared the NBA’s health and safety protocol and is working on his conditioning before rejoining the team. ... Tristan Thompson did not play because of a non-COVID-19 illness."}
{"game_id": "0022100626", "chunk_id": "0022100626_026", "order": 26, "role": "body", "text": "Lakers: Face the Nuggets in Denver on Saturday. Los Angeles has lost seven of its last 10 in Denver."}
{"game_id": "0022100626", "chunk_id": "0022100626_027", "order": 27, "role": "body", "text": "Kings: Play the Rockets at home Friday. Houston won two of the three games between the teams last season."}
