{"game_id": "0022100687", "chunk_id": "0022100687_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young scored 28 points, Kevin Huerter added 21 and the Atlanta Hawks won their third straight game after nearly blowing an 18-point lead in a 110-108 victory over the Miami Heat on Friday night."}
{"game_id": "0022100687", "chunk_id": "0022100687_002", "order": 2, "role": "body", "text": "The Heat again were without star guard Kyle Lowry, who missed his third straight game for personal reasons, and Tyler Herro, the sixth man who’s averaging 20.7 points per game and was sidelined in health and safety protocols for the second game in a row. Neither made the trip."}
{"game_id": "0022100687", "chunk_id": "0022100687_003", "order": 3, "role": "body", "text": "Bam Adebayo finished with 21 points and Duncan Robinson had 19 for Miami (29-17), which had won six of seven and was 15-5 since beating Milwaukee on Dec. 8. The Heat, who didn’t lead after the 30-second mark of the first quarter, began the night six percentage points out of the Eastern Conference lead."}
{"game_id": "0022100687", "chunk_id": "0022100687_004", "order": 4, "role": "body", "text": "The Hawks (20-25) have won three straight at home after losing 10 in a row at State Farm Arena. Atlanta is 12th in the East."}
{"game_id": "0022100687", "chunk_id": "0022100687_005", "order": 5, "role": "body", "text": "Miami nearly beat Atlanta for the third time in nine days."}
{"game_id": "0022100687", "chunk_id": "0022100687_006", "order": 6, "role": "body", "text": "“There’s been a chunk in the last three games when they got hot and then tonight the way we ended the game,” Young said. “We just have a little spurt throughout the game where they get on a run and we’ve got to be better to figure it out and not let that happen."}
{"game_id": "0022100687", "chunk_id": "0022100687_007", "order": 7, "role": "body", "text": "\"But teams are going to go on a run, so we have to manage it the best we can.”"}
{"game_id": "0022100687", "chunk_id": "0022100687_008", "order": 8, "role": "body", "text": "Atlanta took its largest lead at 18 on Young’s free throws with 1:13 left in the third. The Heat pulled within nine early in the fourth, but that was as close as they got before Robinson’s 3 trimmed the lead to six with 3:13 remaining. Adebayo followed with a dunk to make it 105-101 at the 2:41 mark."}
{"game_id": "0022100687", "chunk_id": "0022100687_009", "order": 9, "role": "body", "text": "Two foul shots by Butler made it 107-105, and a 3 by Robinson cut the lead to 109-108, but Butler missed an alley-oop layup with 22.8 seconds to go."}
{"game_id": "0022100687", "chunk_id": "0022100687_010", "order": 10, "role": "body", "text": "“I think my eyes kind of forced that one out,\" Hawks coach Nate McMillan said before adding, “You need breaks. You need a little luck, you need breaks, and we got one there.\""}
{"game_id": "0022100687", "chunk_id": "0022100687_011", "order": 11, "role": "body", "text": "Young hit a free throw to make it 110-108 with 10.7 seconds remaining. The Heat, with six 3s in the fourth quarter, missed the one that mattered when Butler’s trey from the left corner bounced off the rim. Max Strus missed a putback attempt and the buzzer sounded."}
{"game_id": "0022100687", "chunk_id": "0022100687_012", "order": 12, "role": "body", "text": "“It seems like we had a few balls that hit the rim and went out,\" Heat coach Erik Spoelstra said. “We probably had four or five of those in the second half, and that’s just the breaks of the game. We had two fairly clean looks at it down the stretch. I’ve got to commend our guys in the fourth quarter. Our guys did not have a lot of juice in this game."}
{"game_id": "0022100687", "chunk_id": "0022100687_013", "order": 13, "role": "body", "text": "“Guys were just finding ways to gut it out in the fourth quarter. We just weren’t able to get over the hump.\""}
{"game_id": "0022100687", "chunk_id": "0022100687_014", "order": 14, "role": "body", "text": "The Hawks went on a 9-0 run to go up 51-41 when John Collins hit a post-up jumper at the 4:44 mark of the second for the game’s first double-digit lead. A 3 by De’Andre Hunter made it 58-44 in the closing minutes, and Atlanta, which had 16 assists in the first half, led 60-51 at intermission."}
{"game_id": "0022100687", "chunk_id": "0022100687_016", "order": 16, "role": "body", "text": "Heat: Strus had all 15 of his points in the first half. ... F P.J. Tucker, the NBA leader in 3-point percentage at 46.2, hurt his left knee in the first half and did not return. He went 0 for 2 beyond the arc. ... Adebayo didn’t play in the first two games against Atlanta, both Miami wins."}
{"game_id": "0022100687", "chunk_id": "0022100687_017", "order": 17, "role": "body", "text": "Hawks: C Clint Capela, who missed the last six games with a left ankle sprain, was on a minutes restriction, finishing with six points and six rebounds in 26 minutes. ... Hunter had 13 points and 10 rebounds. ... Onyeka Okongwu started at center. ... G Bogdan Bogdanovich missed his fourth straight game with right knee soreness. ... F Danilo Gallinari was out with right Achilles soreness. ... Young was coming off his NBA-leading 11th 30-point, 10-plus assist double-double of the season."}
{"game_id": "0022100687", "chunk_id": "0022100687_019", "order": 19, "role": "body", "text": "Heat: Host the Lakers on Sunday."}
{"game_id": "0022100687", "chunk_id": "0022100687_020", "order": 20, "role": "body", "text": "Hawks: At Charlotte on Sunday."}
