{"game_id": "0022100202", "chunk_id": "0022100202_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young and John Collins each scored 23 points and the Atlanta Hawks beat the Orlando Magic 129-111 on Monday night for their second straight win."}
{"game_id": "0022100202", "chunk_id": "0022100202_002", "order": 2, "role": "body", "text": "Clint Capela finished with 20 points and 16 rebounds and Bogdan Bogdanovich added 20 points for Atlanta, which snapped a six-game skid with a 20-point win over defending NBA champion Milwaukee on Sunday."}
{"game_id": "0022100202", "chunk_id": "0022100202_003", "order": 3, "role": "body", "text": "“Tonight we were obviously a little gassed early on in the game, and they were making shots,\" Young said. “I don’t think there was a dead ball for the first 6½ minutes. We were just tired, but then we were able to catch our wind and get back to playing. We played hard and fast.\""}
{"game_id": "0022100202", "chunk_id": "0022100202_004", "order": 4, "role": "body", "text": "Cole Anthony had 27 points and 11 assists for the Magic, who have dropped three straight and five of six."}
{"game_id": "0022100202", "chunk_id": "0022100202_005", "order": 5, "role": "body", "text": "Lou Williams hit a layup to push the lead back to double digits with 9:26 left in the game, and the Magic, trailing by 11, called timeout. It didn’t help. Capela immediately stole the ball from Franz Wagner, and the Hawks went up 14 on Delon Wright’s 3."}
{"game_id": "0022100202", "chunk_id": "0022100202_006", "order": 6, "role": "body", "text": "The Magic didn’t pull under double digits the rest of the way."}
{"game_id": "0022100202", "chunk_id": "0022100202_007", "order": 7, "role": "body", "text": "“We talk about shots are going to be made and missed, but we have to hang our hat on the defensive end — 129 is not what we’re looking for,\" Orlando coach Jamahl Mosley said. “We want to make sure we sit down and guard, physically keep them off the glass. They had a couple of 50-50 balls they came up with. Again, that cost us some open 3s, so we’ve just to come up with those balls.\""}
{"game_id": "0022100202", "chunk_id": "0022100202_008", "order": 8, "role": "body", "text": "Orlando led through most of the first half, but Atlanta was up by nine midway through the third on Young’s 28-footer, and a right corner 3 by Bogdanovich made it 74-62."}
{"game_id": "0022100202", "chunk_id": "0022100202_009", "order": 9, "role": "body", "text": "Collins fed Clint Capela for a dunk that gave the Hawks a 78-66 lead, but Atlanta called timeout after the Magic trimmed it to seven on Terrence Ross’ 3. It wasn’t long before the Hawks went back up by double digits on Young’s runner."}
{"game_id": "0022100202", "chunk_id": "0022100202_010", "order": 10, "role": "body", "text": "Wendell Carter Jr. had 10 points in the first seven minutes of the game as the Magic led 31-30 at the end of the first on 10 second-chance points. Carter’s straightaway 3 early in the second made it 39-34 Orlando, but Bogdanovich answered with a 3 that made it 39-all."}
{"game_id": "0022100202", "chunk_id": "0022100202_011", "order": 11, "role": "body", "text": "Orlando entered with the Eastern Conference’s worst record at 3-10, but the Magic played a spirited first half, going up 50-46 on Anthony’s runner in the lane and 56-54 on a step-back jumper from Anthony with 1:22 remaining."}
{"game_id": "0022100202", "chunk_id": "0022100202_012", "order": 12, "role": "body", "text": "Bogdanovich hit a left corner 3 and broke into a big smile in the final minute to help the Hawks lead 60-56 at intermission. Atlanta never trailed in the second half."}
{"game_id": "0022100202", "chunk_id": "0022100202_013", "order": 13, "role": "body", "text": "“Coming off a West Coast trip like we did, only having 24 hours and we play a game and not only a game but a back-to-back game, this was a tough game,\" Hawks coach Nate McMillan said. “We played with a lot of energy last night against Milwaukee and to have to play against a scrappy Orlando team. It was a gut check."}
{"game_id": "0022100202", "chunk_id": "0022100202_014", "order": 14, "role": "body", "text": "“I thought our guys stayed with it. We could tell they were running with heavy legs really in that first half.\""}
{"game_id": "0022100202", "chunk_id": "0022100202_016", "order": 16, "role": "body", "text": "Magic: Rookie G Jalen Suggs, the fifth overall draft pick, missed the game with a right ankle sprain. Suggs was hurt in the fourth quarter of Saturday’s home loss to Washington. “Just being cautious,” Mosley said. “He went through (morning) shoot-around. We’re just going to treat it day to day.” ... Gary Harris started in Suggs’ spot and scored eight points in 30 minutes. ... The Magic are 2-5 on the road this season, 12-31 going back to the start of 2020-21."}
{"game_id": "0022100202", "chunk_id": "0022100202_017", "order": 17, "role": "body", "text": "Hawks: Bogdanovich was listed as questionable with right ankle soreness but played 29 minutes. ... Kevin Huerter started in De’Andre Hunter’s spot but departed with left hamstring tightness in the first half and didn’t return. ... Atlanta outscored the Magic by 10 in the paint. ... The Hawks are 41-21 all-time against the Magic in Atlanta. ... Against Milwaukee, Young became the fourth player in NBA history with 40 points, 10-plus assists, eight-plus rebounds and eight-plus 3s in a single game. James Harden (three times), Paul George and Russell Westbrook are the others."}
{"game_id": "0022100202", "chunk_id": "0022100202_019", "order": 19, "role": "body", "text": "McMillan spoke with Hunter after the third-year forward learned he faces right wrist surgery that will sideline him for eight weeks."}
{"game_id": "0022100202", "chunk_id": "0022100202_020", "order": 20, "role": "body", "text": "“I talked to him yesterday and just a tough blow to come into a season after having injuries last season to have something like this happen again,” McMillan said. “He was down about that, but the good thing is it’s early. He’ll have time to get healthy and get back to playing ball.”"}
{"game_id": "0022100202", "chunk_id": "0022100202_022", "order": 22, "role": "body", "text": "Magic: At New York on Wednesday."}
{"game_id": "0022100202", "chunk_id": "0022100202_023", "order": 23, "role": "body", "text": "Hawks: Host Boston on Wednesday."}
