{"game_id": "0022100618", "chunk_id": "0022100618_001", "order": 1, "role": "lead", "text": "INDIANAPOLIS -- — Jaylen Brown and Jayson Tatum packed a punch Wednesday night. Dennis Schroder added his own touch."}
{"game_id": "0022100618", "chunk_id": "0022100618_002", "order": 2, "role": "body", "text": "Brown scored 34 points, Tatum added 33 and Schroder finished with 23 as the Boston Celtics rolled past the Indiana Pacers 119-100."}
{"game_id": "0022100618", "chunk_id": "0022100618_003", "order": 3, "role": "body", "text": "Boston snapped a six-game road losing streak while beating Indiana for the second time in three days and the fourth straight time."}
{"game_id": "0022100618", "chunk_id": "0022100618_004", "order": 4, "role": "body", "text": "“When we can do that — get out and run and not play against everyone’s half-court set, we’re better,\" Celtics coach Ime Udoka said. “Those two came out great and Dennis got going and put a lot of pressure on them. They’ve got to make shots and at the end of the day, they did that.”"}
{"game_id": "0022100618", "chunk_id": "0022100618_005", "order": 5, "role": "body", "text": "With Brown, Tatum and Schroder operating at full throttle, the Pacers struggled to get in synch as two starters — Malcolm Brogdon and Caris LeVert — returned after being cleared through the health and safety protocols."}
{"game_id": "0022100618", "chunk_id": "0022100618_006", "order": 6, "role": "body", "text": "Neither played like themselves, though."}
{"game_id": "0022100618", "chunk_id": "0022100618_007", "order": 7, "role": "body", "text": "That left it up to Myles Turner, who had 18 points and Domantas Sabonis added 17 points, six rebounds and six assists as the Pacers lost their second straight and eighth in nine games."}
{"game_id": "0022100618", "chunk_id": "0022100618_008", "order": 8, "role": "body", "text": "“Look it’s never seamless and in this case, you’re talking about two of our highly, highly skilled guys who have been out a significant amount of time,\" Pacers coach Rick Carlisle said. “Tomorrow will be a new day and we’ll circle the wagons and try and get better.\""}
{"game_id": "0022100618", "chunk_id": "0022100618_009", "order": 9, "role": "body", "text": "After the opening minutes, the Celtics never really gave the Pacers a chance."}
{"game_id": "0022100618", "chunk_id": "0022100618_010", "order": 10, "role": "body", "text": "Boston quickly took a 10-point lead and kept Indiana at arm's length until the final minutes of the first half, then wasted no time reasserting its dominance in the third quarter. The Celtics scored the first eight points to extend a 54-49 halftime lead to 13 and then made it 68-53 when Schroder made back-to-back 3-pointers."}
{"game_id": "0022100618", "chunk_id": "0022100618_011", "order": 11, "role": "body", "text": "Another 3 from Schroder late in the third made it a 19-point game. Indiana never seriously challenged again."}
{"game_id": "0022100618", "chunk_id": "0022100618_012", "order": 12, "role": "body", "text": "“We were up five at halftime and felt like we gave up a double-digit lead so we wanted to do what we did in the first and second quarter,\" Udoka said. “ We made two baskets, they called timeout and we felt the momentum was back in our hands.\""}
{"game_id": "0022100618", "chunk_id": "0022100618_014", "order": 14, "role": "body", "text": "Celtics: Tatum also had seven rebounds and four assists while Brown added five rebounds and three assists. ... Schroder was 4 for 5 on 3s while Brown was 7 for 11. ... Boston made seven of its first eight 3s and wound up 18 of 38 from beyond the arc. ... The Celtics had 11 turnovers. ... Marcus Smart missed the game with a bruised right thigh. Payton Pritchard played limited minutes after being cleared through the health and safety protocols."}
{"game_id": "0022100618", "chunk_id": "0022100618_015", "order": 15, "role": "body", "text": "Pacers: LeVert had 16 points and four assists in 29 minutes. Justin Holiday scored 13. ... ... One day after signing a second 10-day contract, Lance Stephenson had six points, five rebounds and six assists ... The Pacers were 7 for 36 on 3s and went 13 for 20 on free throws."}
{"game_id": "0022100618", "chunk_id": "0022100618_017", "order": 17, "role": "body", "text": "Brogdon had also been dealing with a sore right Achilles tendon. The injury, combined with the COVID-19 protocols, kept the Pacers starting guard out of nine straight games and 10 of the previous 11. On Wednesday, he left in the third quarter after scoring six points on 3-for-7 shooting in just 17 minutes."}
{"game_id": "0022100618", "chunk_id": "0022100618_018", "order": 18, "role": "body", "text": "“We were playing him about five minutes at the start of each quarter with the hope of him finishing the game,\" Carlisle said. “But five minutes, you're just getting into the game and you’re coming out. That’s tough. Hopefully, he did OK and didn’t have any setbacks but I need to talk to the trainers.”"}
{"game_id": "0022100618", "chunk_id": "0022100618_020", "order": 20, "role": "body", "text": "Celtics: At Philadelphia on Friday night."}
{"game_id": "0022100618", "chunk_id": "0022100618_021", "order": 21, "role": "body", "text": "Pacers: Host Phoenix on Friday night."}
