{"game_id": "0022100058", "chunk_id": "0022100058_001", "order": 1, "role": "lead", "text": "TORONTO -- — Fred VanVleet and the Raptors pushed around the Indiana Pacers to pick up a long-awaited home win."}
{"game_id": "0022100058", "chunk_id": "0022100058_002", "order": 2, "role": "body", "text": "VanVleet had a season-high 26 points and a career-high 10 rebounds, OG Anunoby scored a season-high 25 points, and the Raptors won at home for the first time in 20 months, beating the Pacers 118-100 on Wednesday night."}
{"game_id": "0022100058", "chunk_id": "0022100058_003", "order": 3, "role": "body", "text": "“I thought we were definitely very physical tonight,” VanVleet said. “OG set the tone in the paint offensively. I thought all five guys were on the same page defensively to start the game.”"}
{"game_id": "0022100058", "chunk_id": "0022100058_004", "order": 4, "role": "body", "text": "Indiana was the opponent the last time Toronto won at Scotiabank Arena, a 127-81 victory on Feb. 23, 2020. Since-departed Raptors stars Serge Ibaka (15 rebounds) and Kyle Lowry (11 assists) were among Toronto’s statistical leaders in that game, the most lopsided win in team history."}
{"game_id": "0022100058", "chunk_id": "0022100058_005", "order": 5, "role": "body", "text": "The Raptors lost their first three home games this season. In the three seasons prior to the COVID-19 pandemic, Toronto went 89-25 at home. Travel restrictions related to the pandemic forced the Raptors to play home games in Florida at the end of the 2019-20 season and throughout 2020-21. They went 16-20 at their temporary home in Tampa last season."}
{"game_id": "0022100058", "chunk_id": "0022100058_006", "order": 6, "role": "body", "text": "On Wednesday, first-year forward Scottie Barnes had 18 points and seven assists, and fellow rookie Dalano Banton came off the bench to score 10 points."}
{"game_id": "0022100058", "chunk_id": "0022100058_007", "order": 7, "role": "body", "text": "“I think it’s good to build a foundation for a young team,” VanVleet said. “The team certainly looks different than a lot of the teams we’ve had since I’ve been here, but it’s good just to build that foundation.”"}
{"game_id": "0022100058", "chunk_id": "0022100058_008", "order": 8, "role": "body", "text": "VanVleet shot 6 for 7 from 3-point range and had six assists."}
{"game_id": "0022100058", "chunk_id": "0022100058_009", "order": 9, "role": "body", "text": "Banton made 4 of 7 field-goal attempts, including 2 of 3 from beyond the arc, and added three assists."}
{"game_id": "0022100058", "chunk_id": "0022100058_010", "order": 10, "role": "body", "text": "“When he’s out there moving, it’s hard to guard,” VanVleet said. “He was great for us tonight.”"}
{"game_id": "0022100058", "chunk_id": "0022100058_011", "order": 11, "role": "body", "text": "Indiana’s Malcolm Brogdon scored 18 points in 22 minutes but injured his left hamstring early in the third quarter and did not return. The Pacers also lost forward Isaiah Jackson to a left knee injury in the fourth. Jackson needed assistance to walk to the locker room after being injured."}
{"game_id": "0022100058", "chunk_id": "0022100058_012", "order": 12, "role": "body", "text": "“I do not know the severity or the description of what exactly happened,” coach Rick Carlsisle said of Jackson’s injury. “Obviously, it didn’t look good.”"}
{"game_id": "0022100058", "chunk_id": "0022100058_013", "order": 13, "role": "body", "text": "Chris Duarte scored 14 points, Jeremy Lamb had 12 and Myles Turner had 10 for the Pacers, who are 0-3 on the road."}
{"game_id": "0022100058", "chunk_id": "0022100058_014", "order": 14, "role": "body", "text": "Indiana went 21-15 away from home last season, the best road record in the Eastern Conference."}
{"game_id": "0022100058", "chunk_id": "0022100058_015", "order": 15, "role": "body", "text": "Domantas Sabonis had nine points and eight rebounds but had four of the Pacers’ 23 turnovers. The Raptors scored 31 points off Indiana miscues."}
{"game_id": "0022100058", "chunk_id": "0022100058_016", "order": 16, "role": "body", "text": "“They’ve got quick, angular guys,” Carlisle said of the Raptors. “They were ripping at the ball all night and they knocked a lot of balls loose. Give them credit, they executed well.”"}
{"game_id": "0022100058", "chunk_id": "0022100058_017", "order": 17, "role": "body", "text": "Toronto led 57-48 at halftime. VanVleet made all three of his 3-point attempts in the third quarter and Banton scored seven points as the Raptors took an 87-71 lead to the fourth."}
{"game_id": "0022100058", "chunk_id": "0022100058_018", "order": 18, "role": "body", "text": "Anunoby had 16 points in the first quarter."}
{"game_id": "0022100058", "chunk_id": "0022100058_020", "order": 20, "role": "body", "text": "Pacers: Indiana has scored at least 100 points in all four games so far. ... G Caris LeVert (sore lower back) missed his fifth straight game. ... Indiana had won its previous two meetings with Toronto. ... T.J. McConnell had four turnovers."}
{"game_id": "0022100058", "chunk_id": "0022100058_021", "order": 21, "role": "body", "text": "Raptors: Toronto’s 14 3-pointers were a season high. ... F Yuta Watanabe (left calf) is practicing with Toronto’s G League team this week and is expected to join the Raptors on their upcoming trip. ... VanVleet set career-highs in assists (17) and turnovers (8) in Monday’s home loss to Chicago."}
{"game_id": "0022100058", "chunk_id": "0022100058_023", "order": 23, "role": "body", "text": "VanVleet, listed at 6 feet, said he doesn’t expect to compete with taller players for rebounds."}
{"game_id": "0022100058", "chunk_id": "0022100058_024", "order": 24, "role": "body", "text": "“My rule is if it gets below head level, it’s mine,” he said. “Anything up there by the rim, somebody else has got to get that one.”"}
{"game_id": "0022100058", "chunk_id": "0022100058_026", "order": 26, "role": "body", "text": "The Raptors matched a season low with 12 turnovers. Toronto also had 12 in last Saturday’s loss to Dallas."}
{"game_id": "0022100058", "chunk_id": "0022100058_028", "order": 28, "role": "body", "text": "Pacers: Visit Brooklyn on Friday night."}
{"game_id": "0022100058", "chunk_id": "0022100058_029", "order": 29, "role": "body", "text": "Raptors: Host Orlando on Friday night."}
