{"game_id": "0022100788", "chunk_id": "0022100788_001", "order": 1, "role": "lead", "text": "DETROIT -- — Jayson Tatum scored 24 points in 28 minutes, and the Boston Celtics extended their winning streak to four games with a 102-93 victory over the Detroit Pistons on Friday night."}
{"game_id": "0022100788", "chunk_id": "0022100788_002", "order": 2, "role": "body", "text": "Jaylen Brown scored 13 points for the Celtics, who won for the sixth time in seven games. Josh Richardson scored 12 points and Robert Williams had 11 points, 11 rebounds and five blocks for Boston, which never trailed and led by as many as 24 points."}
{"game_id": "0022100788", "chunk_id": "0022100788_003", "order": 3, "role": "body", "text": "The four-game win streak is the Celtics' longest of the season."}
{"game_id": "0022100788", "chunk_id": "0022100788_004", "order": 4, "role": "body", "text": "“I just go back to us being locked in,” Williams said. “We've got great scorers, most people on our team can score but when we're locked in defensively and we cover for each other, I feel like that's when we're playing our best.”"}
{"game_id": "0022100788", "chunk_id": "0022100788_005", "order": 5, "role": "body", "text": "Hamidou Diallo had 21 points and 14 rebounds as Detroit wrapped up a four-game homestand and lost for the seventh time in eight games. Saddiq Bey scored 21 points and Jerami Grant added 10 points."}
{"game_id": "0022100788", "chunk_id": "0022100788_006", "order": 6, "role": "body", "text": "The Pistons were held to 32.7% shooting from the field (34 of 104)."}
{"game_id": "0022100788", "chunk_id": "0022100788_007", "order": 7, "role": "body", "text": "“We're coming out with the right focus from the start,” Boston coach Ime Udoka said. “We guarded extremely well for most of the game.”"}
{"game_id": "0022100788", "chunk_id": "0022100788_008", "order": 8, "role": "body", "text": "Detroit made 18 of 59 shots in the paint."}
{"game_id": "0022100788", "chunk_id": "0022100788_009", "order": 9, "role": "body", "text": "“Some of the looks we had inside were in and out. Point-blank layups, point-blank putbacks,” Pistons coach Dwane Casey said. “You can't explain that.”"}
{"game_id": "0022100788", "chunk_id": "0022100788_010", "order": 10, "role": "body", "text": "Boston held Detroit to a season-low point total in the first half and led 46-31 at the break. The Pistons’ previous first-half low was 37 points against the New York Knicks on Dec. 21."}
{"game_id": "0022100788", "chunk_id": "0022100788_011", "order": 11, "role": "body", "text": "“We could have kept them in the 20s other than for a few mistakes there,” Udoka said. “We were making it tough on Grant and Bey and some of those guys early. Our carryover is good, our physicality has been there and we're kind of buying into that defensive mentality and making it hard on times every night.”"}
{"game_id": "0022100788", "chunk_id": "0022100788_012", "order": 12, "role": "body", "text": "Tatum scored 19 points in the third quarter as the Celtics led 78-56 heading into the fourth quarter."}
{"game_id": "0022100788", "chunk_id": "0022100788_013", "order": 13, "role": "body", "text": "Detroit was playing the second game of a back-to-back after losing to Minnesota on Thursday."}
{"game_id": "0022100788", "chunk_id": "0022100788_014", "order": 14, "role": "body", "text": "“I think we came out in the first half in a mental fog,” Casey said. “A back-to-back here at home against a superior team and we didn't approach it the right way.”"}
{"game_id": "0022100788", "chunk_id": "0022100788_016", "order": 16, "role": "body", "text": "Detroit rookie guard Cade Cunningham, the top pick in last year’s draft, missed his second consecutive game due to a right hip pointer. “It’s nothing serious, but we’re going to be cautious with it,” coach Dwane Casey said. “He’s just got to get those muscles in his behind firing the right way and the soreness out.” … The Pistons were also missing guard Josh Jackson (right lumbar spine spasm). ... Celtics forward Al Horford was held out in the fourth quarter due to a sore right foot. ... The Celtics have won seven of their last nine games on Detroit’s home court. … The teams will play three more times over the next five weeks — in Detroit on Feb. 26 and in Boston on Feb. 16 and March 11."}
{"game_id": "0022100788", "chunk_id": "0022100788_018", "order": 18, "role": "body", "text": "Celtics: Visit Orlando Magic on Sunday."}
{"game_id": "0022100788", "chunk_id": "0022100788_019", "order": 19, "role": "body", "text": "Pistons: Visit Minnesota Timberwolves on Sunday."}
