{"game_id": "0022100456", "chunk_id": "0022100456_001", "order": 1, "role": "lead", "text": "PHOENIX -- — In Phoenix's last game, a victory over Washington on Thursday night, the Suns had eight players score in double figures. Devin Booker returned to action Sunday night — and they had nine."}
{"game_id": "0022100456", "chunk_id": "0022100456_002", "order": 2, "role": "body", "text": "Booker scored 16 points in his return from a hamstring injury and the NBA-leading Suns set a season-scoring high in a 137-106 victory over the Charlotte Hornets on Sunday night."}
{"game_id": "0022100456", "chunk_id": "0022100456_003", "order": 3, "role": "body", "text": "After missing seven games because of a hamstring injury, Booker played 26 minutes, and sat out the fourth quarter. The Suns never trailed, led by as many as 36 and improved to 24-5, moving a half-game ahead of Golden State."}
{"game_id": "0022100456", "chunk_id": "0022100456_004", "order": 4, "role": "body", "text": "“I learned some things from the sideline that I tried to implement today,” said Booker, who was 4 of 8 from 3-point range. “The machine keeps moving even in games we had people out. Somebody steps up and jumps right into that role.”"}
{"game_id": "0022100456", "chunk_id": "0022100456_005", "order": 5, "role": "body", "text": "The Suns made 20 of 41 3-point shots, also a season high for that category, and shot 56.8% overall."}
{"game_id": "0022100456", "chunk_id": "0022100456_006", "order": 6, "role": "body", "text": "They dominated the paint behind Deandre Ayton, who had 15 points and 15 rebounds, and Javale McGee, who led Phoenix with 19 points in 16 minutes off the bench. McGee made 9 of 10 shots."}
{"game_id": "0022100456", "chunk_id": "0022100456_007", "order": 7, "role": "body", "text": "\"The best backup center I have ever had,” Ayton said. “I feel so comfortable coming out of the game knowing that this man is a presence at both ends of the floor. The same thing I am doing. It is like I didn't leave.\""}
{"game_id": "0022100456", "chunk_id": "0022100456_008", "order": 8, "role": "body", "text": "Mikal Bridges had 16 points, Landry Shamet 15 and Jae Crowder and Chris Paul had 14 apiece, Cam Johnson scored 12 and Cameron Payne had 11 for the Suns, who are 14-0 at home after losing their first two. The Elias Sports Bureau is the Suns had at nine players score in double figures for the first time since April 21, 1991, against Portland."}
{"game_id": "0022100456", "chunk_id": "0022100456_009", "order": 9, "role": "body", "text": "“We have a ‘we score’ mentality,” Suns coach Monty Williams said. “We score, we defend and I think when you play that way, it creates a lot of opportunity to shoot the ball from range or attack the paint.”"}
{"game_id": "0022100456", "chunk_id": "0022100456_010", "order": 10, "role": "body", "text": "Miles Bridges had 26 points for Charlotte, and former Sun Kelly Oubre Jr. had 16. LaMelo Ball had nine points, 10 rebounds and seven assists, but was 2 of 12 from the field and 1 of 6 from behind the arc."}
{"game_id": "0022100456", "chunk_id": "0022100456_011", "order": 11, "role": "body", "text": "It started early as Phoenix built a 37-15 lead at the end of the first quarter."}
{"game_id": "0022100456", "chunk_id": "0022100456_012", "order": 12, "role": "body", "text": "“We just wanted to come in focused and make them pay,” Booker said. “If they made any mistakes defensively make sure we found the right person and shoot it with confidence.”"}
{"game_id": "0022100456", "chunk_id": "0022100456_013", "order": 13, "role": "body", "text": "As for Booker, Williams said, “He didn't look winded at all. He was gliding up and down the floor.\""}
{"game_id": "0022100456", "chunk_id": "0022100456_014", "order": 14, "role": "body", "text": "Charlotte made just six shots in the quarter, shooting 21%. The Hornets converted just 1 of 11 3-point tries. Ball was scoreless on six shots in the quarter."}
{"game_id": "0022100456", "chunk_id": "0022100456_015", "order": 15, "role": "body", "text": "“We were getting good shots in the first quarter, but just missing,\" Miles Bridges said. \"We were letting our offense dictate our defense. We still got to come out ready to go.”"}
{"game_id": "0022100456", "chunk_id": "0022100456_017", "order": 17, "role": "body", "text": "Hornets forward Cody Martin was placed in the NBA’s health and safety protocol on Sunday, but there were no other players affected. Three games were postponed league-wide Sunday."}
{"game_id": "0022100456", "chunk_id": "0022100456_018", "order": 18, "role": "body", "text": "“Everybody’s trying to do their best,” Williams said. “We want to coach and play but we’re all dealing with it. It’s affecting everybody. Every time you hit refresh there’s a new person in the protocol. It’s unfortunate but we’ve dealt with it also.”"}
{"game_id": "0022100456", "chunk_id": "0022100456_019", "order": 19, "role": "body", "text": "The game was played with two game officials. Zach Zerba and Eric Dalen, originally scheduled, were held out of the game. Brent Barnaky, the other scheduled referee, was joined by NBA referee Bill Kennedy, who lives in the Phoenix area."}
{"game_id": "0022100456", "chunk_id": "0022100456_021", "order": 21, "role": "body", "text": "Williams and Hornets coach James Borrego worked together as assistants with San Antonio, and Borrego was on Williams’ staff in New Orleans."}
{"game_id": "0022100456", "chunk_id": "0022100456_022", "order": 22, "role": "body", "text": "“I learned a lot from Monty,\" Borrego said. \"He’s a great leader, a great man. I’m thrilled for him where he has his program.”"}
{"game_id": "0022100456", "chunk_id": "0022100456_023", "order": 23, "role": "body", "text": "As for Williams, he thinks Borrego doesn’t get enough credit for Charlotte playing much better this season."}
{"game_id": "0022100456", "chunk_id": "0022100456_024", "order": 24, "role": "body", "text": "\"You don’t hear him being talked about as much as he should be.” Williams said."}
{"game_id": "0022100456", "chunk_id": "0022100456_026", "order": 26, "role": "body", "text": "Hornets: At Utah on Monday night."}
{"game_id": "0022100456", "chunk_id": "0022100456_027", "order": 27, "role": "closing", "text": "Suns: At Los Angeles Lakers on Tuesday night."}
