{"game_id": "0022100021", "chunk_id": "0022100021_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Ben Simmons wasn't there. Joel Embiid conceded he should not have played. With Philadelphia's All-Star cornerstones absent or injured, Kevin Durant and Brooklyn had the opening they needed to spoil the 76ers' opener with a rally down the stretch."}
{"game_id": "0022100021", "chunk_id": "0022100021_002", "order": 2, "role": "body", "text": "Durant had 29 points, 15 rebounds and 12 assists, James Harden scored 20 points and the Nets closed with a 16-1 run to beat the 76ers 114-109 on Friday night as each team played without a much-discussed star guard."}
{"game_id": "0022100021", "chunk_id": "0022100021_003", "order": 3, "role": "body", "text": "“My role tonight, I felt, was getting into the paint, making plays,” Durant said. “We've got to keep building on this and see where we can go.”"}
{"game_id": "0022100021", "chunk_id": "0022100021_004", "order": 4, "role": "body", "text": "The Nets were missing Kyrie Irving, who isn’t with the team due to his refusal to get a COVID-19 vaccine. Ben Simmons sat out the home opener for personal reasons and the Sixers do not know when the three-time All-Star will return."}
{"game_id": "0022100021", "chunk_id": "0022100021_005", "order": 5, "role": "body", "text": "They could have used Simmons' defense to shut down the Nets late."}
{"game_id": "0022100021", "chunk_id": "0022100021_006", "order": 6, "role": "body", "text": "The Sixers tossed up airballs on consecutive possessions early in Brooklyn's run. The Nets had never led or tied until LaMarcus Aldridge’s dunk with 48 seconds left made it 108-108. He sank the free throw for the one-point lead."}
{"game_id": "0022100021", "chunk_id": "0022100021_007", "order": 7, "role": "body", "text": "Durant made two free throws to seal Brooklyn's comeback from 14 points down."}
{"game_id": "0022100021", "chunk_id": "0022100021_008", "order": 8, "role": "body", "text": "“Sure, we made a lot of plays down the stretch, but that was more because of our willingness to keep going,” Nets coach Steve Nash said. “Their willingness to compete and believe is the reason they won the game.”"}
{"game_id": "0022100021", "chunk_id": "0022100021_009", "order": 9, "role": "body", "text": "Embiid scored 19 points on a sore right knee suffered against New Orleans in the opener. He left for the locker room in the final moments of the first half on Friday and warmed up at halftime with a wrap on his knee but started the third quarter. Tobias Harris and Seth Curry each scored 23 points for the Sixers."}
{"game_id": "0022100021", "chunk_id": "0022100021_010", "order": 10, "role": "body", "text": "“I probably shouldn't have played but it's good to be out there with the guys,” Embiid said."}
{"game_id": "0022100021", "chunk_id": "0022100021_011", "order": 11, "role": "body", "text": "Simmons has not played since his offseason trade demand. He met with the Sixers before the morning shootaround. Coach Doc Rivers said it was a “productive day” and hoped it was a start toward bringing Simmons back into the fold."}
{"game_id": "0022100021", "chunk_id": "0022100021_012", "order": 12, "role": "body", "text": "The 25-year-old Australian had become the No. 1 target for Sixers’ fans derision and they came dressed to mock the absentee guard. The most popular was a form of a Mister Softee T-shirt with an ice cream swirl on Simmons’ head. Another fan dressed in a red clown wig and clown nose and taped “CLOWN” over his No. 25 Simmons jersey. The parking lots found bootleg T-shirt sales of Simmons on a “MISSING” poster."}
{"game_id": "0022100021", "chunk_id": "0022100021_013", "order": 13, "role": "body", "text": "Harris said the Sixers and fans need to rally around Simmons."}
{"game_id": "0022100021", "chunk_id": "0022100021_014", "order": 14, "role": "body", "text": "“In this space, you’re depicted as superhuman, not really supposed to have feelings or go through anything,” Harris said. “I think we have to really understand he’s human first. And you know, if he’s going through something at this time, we have to respect that.”"}
{"game_id": "0022100021", "chunk_id": "0022100021_015", "order": 15, "role": "body", "text": "Durant and Harden were a two-player show until the fourth, and the Nets had no answers when Tyrese Maxey, Simmons’ replacement, scored five straight points early in the quarter that pushed the lead to double digits."}
{"game_id": "0022100021", "chunk_id": "0022100021_016", "order": 16, "role": "body", "text": "Harris hit Matisse Thybulle on an alley-oop that made it 108-98 and even made Embiid rise off the bench in celebration. The Sixers would not score again until Curry made 1 of 2 free throws with 15.2 seconds left to make it 111-109 and the collapse was complete."}
{"game_id": "0022100021", "chunk_id": "0022100021_018", "order": 18, "role": "body", "text": "The Sixers did their best to defuse potential anti-Simmons chants — a Flyers game in the same building this week got profanely loud toward Simmons — by sending Embiid out to address the crowd."}
{"game_id": "0022100021", "chunk_id": "0022100021_019", "order": 19, "role": "body", "text": "Embiid thanked the fans for coming after having to stay home most of last season amid the pandemic and asked they support Simmons because “he’s still our brother.” The crowd listened and no sustained chants of any substance ever developed."}
{"game_id": "0022100021", "chunk_id": "0022100021_021", "order": 21, "role": "body", "text": "Nets: Durant sank all 10 free throws. ... Harden had seven rebounds and eight assists."}
{"game_id": "0022100021", "chunk_id": "0022100021_022", "order": 22, "role": "body", "text": "76ers: Simmons was suspended for the first game of the season for conduct detrimental to the team after Rivers threw him out of practice for refusing to participate in a drill. Rivers said he didn’t want to predict when Simmons might rejoin the Sixers — if the guard returns at all. .. Embiid was hit with a technical in the first half. ... Danny Green shot three airballs in the fourth quarter."}
{"game_id": "0022100021", "chunk_id": "0022100021_024", "order": 24, "role": "body", "text": "The Nets decided Irving wouldn’t play or practice with the team at all until he could be a full participant. He can't play home games because of a New York City vaccination mandate."}
{"game_id": "0022100021", "chunk_id": "0022100021_025", "order": 25, "role": "body", "text": "“We lost a big piece,” Nash said. “It's not just the new pieces. It's the void we're used to playing with. It's a lot for us to take on in this moment in time and hopefully in the weeks coming, we'll start to clear some of the debris, so to speak, and figure out how to best play together.\""}
{"game_id": "0022100021", "chunk_id": "0022100021_027", "order": 27, "role": "body", "text": "“If they have a top 575, maybe I have a chance.” — Rivers, a former NBA All-Star guard, on not making the NBA’s 75th anniversary team."}
{"game_id": "0022100021", "chunk_id": "0022100021_029", "order": 29, "role": "body", "text": "Nets: Brooklyn heads home Sunday to face Charlotte in the start of a season-long six-game homestand. Washington, Miami, Indiana, Detroit and Atlanta are on the schedule."}
{"game_id": "0022100021", "chunk_id": "0022100021_030", "order": 30, "role": "body", "text": "76ers: Simmons’ next two chances to return are both on the road, Sunday at Oklahoma City and Tuesday at New York."}
