{"game_id": "0022100784", "chunk_id": "0022100784_001", "order": 1, "role": "lead", "text": "TORONTO -- — Gary Trent Jr. scored 33 points, Pascal Siakam had 16 points and 14 rebounds and the Toronto Raptors won their third straight game, beating the Miami Heat 110-106 on Tuesday night."}
{"game_id": "0022100784", "chunk_id": "0022100784_002", "order": 2, "role": "body", "text": "Trent matched DeMar DeRozan’s franchise record and extended his personal career best by reaching 30 points for the fifth consecutive game."}
{"game_id": "0022100784", "chunk_id": "0022100784_003", "order": 3, "role": "body", "text": "“He’s just full of confidence and he’s obviously really hard to guard right now,” Raptors coach Nick Nurse said of Trent., who shot 6 for 10 from 3-point range."}
{"game_id": "0022100784", "chunk_id": "0022100784_004", "order": 4, "role": "body", "text": "VanVleet said Trent, who joined Toronto last season in a trade deadline deal with Portland, was quiet and reserved in his first months with the Raptors, but has come out of his shell this season."}
{"game_id": "0022100784", "chunk_id": "0022100784_005", "order": 5, "role": "body", "text": "“I think we’re just seeing who he really is this year,” VanVleet said. “We’re getting more of his personality. He’s talking more, he’s stepping up as a leader, he’s bringing that competitiveness on both ends of the floor.”"}
{"game_id": "0022100784", "chunk_id": "0022100784_006", "order": 6, "role": "body", "text": "Trent said his recent hot stretch has helped boost his confidence."}
{"game_id": "0022100784", "chunk_id": "0022100784_007", "order": 7, "role": "body", "text": "“When you’re getting shots and your coach sees you rolling, believes in you and has confidence in you, he’ll call your number,” Trent said."}
{"game_id": "0022100784", "chunk_id": "0022100784_008", "order": 8, "role": "body", "text": "VanVleet scored 21 points, OG Anunoby had 13, Precious Achiuwa 12 and Scottie Barnes 11 as the Raptors won their second straight meeting with Miami. Toronto beat the Heat 124-120 in triple overtime last Saturday."}
{"game_id": "0022100784", "chunk_id": "0022100784_009", "order": 9, "role": "body", "text": "Bam Adebayo had a season-high 32 points and 11 rebounds, Jimmy Butler had 16 points and 12 assists, and Tyler Herro scored 18 points for the Heat, who lost their third straight."}
{"game_id": "0022100784", "chunk_id": "0022100784_010", "order": 10, "role": "body", "text": "Playing for the fourth time in five days, Miami shot 2 for 16 from 3-point range in the second half, when it was outrebounded 24-16. The Heat finished with 17 turnovers, leading to 24 Toronto points."}
{"game_id": "0022100784", "chunk_id": "0022100784_011", "order": 11, "role": "body", "text": "“This game was going to be decided by taking care of the ball, getting more shots on goal, and in the trenches, and I would say we categorically lost those departments, particularly in the trenches,” Heat coach Erik Spoelstra said."}
{"game_id": "0022100784", "chunk_id": "0022100784_012", "order": 12, "role": "body", "text": "Adebayo said Miami “ran out of gas” against Toronto, while Herro said the Raptors were “playing harder” than the Heat."}
{"game_id": "0022100784", "chunk_id": "0022100784_013", "order": 13, "role": "body", "text": "“The kind of outdid us at our own game,” Herro said. “This is the type of game we want and they just out-toughed us, outplayed us. They deserved it more than us.”"}
{"game_id": "0022100784", "chunk_id": "0022100784_014", "order": 14, "role": "body", "text": "Toronto finished with 15 offensive rebounds to Miami’s 10."}
{"game_id": "0022100784", "chunk_id": "0022100784_015", "order": 15, "role": "body", "text": "“They just absolutely crushed us in the possession game,” Spoelstra said. “I don’t know how many different ways I can say that.”"}
{"game_id": "0022100784", "chunk_id": "0022100784_016", "order": 16, "role": "body", "text": "Down by as many as 15 in the first half, Toronto cut the gap to 83-80 after three quarters, tied it on a 3-pointer by Siakam with 10:02 left, then took its first lead of the game on Achiuwa’s 3 with 9:16 remaining."}
{"game_id": "0022100784", "chunk_id": "0022100784_017", "order": 17, "role": "body", "text": "Miami led 93-92 after Butler made a pair of free throws with 6:46 left. Trent responded with a personal 8-0 run, hitting back-to-back 3-pointers, then making two of three at the line to put Toronto up 100-93 at 4:35."}
{"game_id": "0022100784", "chunk_id": "0022100784_018", "order": 18, "role": "body", "text": "Anunoby converted a three-point play with 2:53 left and VanVleet added a free throw after Miami’s Max Strus was called for a technical, giving the Raptors their biggest lead at 106-98."}
{"game_id": "0022100784", "chunk_id": "0022100784_019", "order": 19, "role": "body", "text": "Toronto called timeout after Herro’s driving layup cut it to 108-106 with 6.7 seconds to go, but Anunoby scored on Barnes’ alley-oop inbounds pass."}
{"game_id": "0022100784", "chunk_id": "0022100784_020", "order": 20, "role": "body", "text": "Butler returned to the starting lineup after sitting out Monday’s loss at Boston because of a sore toe, while P.J. Tucker was back after missing Monday’s game because of left knee soreness."}
{"game_id": "0022100784", "chunk_id": "0022100784_021", "order": 21, "role": "body", "text": "Former Raptors guard Kyle Lowry (personal reasons) missed his ninth straight game. Tuesday would have been his first visit to Toronto since leaving the Raptors last offseason."}
{"game_id": "0022100784", "chunk_id": "0022100784_022", "order": 22, "role": "body", "text": "Spoelstra said he has been talking with Lowry on a daily basis throughout his absence."}
{"game_id": "0022100784", "chunk_id": "0022100784_023", "order": 23, "role": "body", "text": "“​​He’s part of our family,” Spoelstra said. “I just want to be there for him. The basketball stuff, we can work all that out.”"}
{"game_id": "0022100784", "chunk_id": "0022100784_024", "order": 24, "role": "body", "text": "The Heat visit Toronto again on April 3."}
{"game_id": "0022100784", "chunk_id": "0022100784_025", "order": 25, "role": "body", "text": "Miami led 62-50 at the half but Toronto rallied in the third, cutting the deficit to 83-80 through three quarters."}
{"game_id": "0022100784", "chunk_id": "0022100784_027", "order": 27, "role": "body", "text": "Rapper Drake sat next to Raptors president Masai Ujuri in the empty stands behind Toronto’s bench in the first half. Drake moved to his customary courtside seat adjacent to Toronto’s bench for the second half."}
{"game_id": "0022100784", "chunk_id": "0022100784_029", "order": 29, "role": "body", "text": "For the first time since a Dec. 28 loss to Philadelphia, the Raptors played before fans who weren’t family and friends of the players. A small crowd of several hundred randomly selected season ticket holders watched from the stands opposite the benches."}
{"game_id": "0022100784", "chunk_id": "0022100784_030", "order": 30, "role": "body", "text": "Even so, the Heat said they found the intimate environment unusual."}
{"game_id": "0022100784", "chunk_id": "0022100784_031", "order": 31, "role": "body", "text": "“It was very quiet today,” Adebayo said."}
{"game_id": "0022100784", "chunk_id": "0022100784_033", "order": 33, "role": "body", "text": "Heat: Tucker scored 12 points. … Butler shot 10 for 10 at the free throw line and finished with eight rebounds. … Lost on a Tuesday for the first time, falling to 4-1."}
{"game_id": "0022100784", "chunk_id": "0022100784_034", "order": 34, "role": "body", "text": "Raptors: Barnes and Achiuwa were picked to play in the Rising Stars Game at All-Star weekend in Cleveland. … C Khem Birch (broken nose) should return within a week, Nurse said. .... DeRozan had five straight 30-point games for Toronto from Oct. 26 to Nov. 4, 2016."}
{"game_id": "0022100784", "chunk_id": "0022100784_036", "order": 36, "role": "body", "text": "Heat: Visit San Antonio on Thursday."}
{"game_id": "0022100784", "chunk_id": "0022100784_037", "order": 37, "role": "body", "text": "Raptors: Host Chicago on Thursday."}
