{"game_id": "0022100869", "chunk_id": "0022100869_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — Jaylen Brown thought for a second, but struggled to remember a victory quite as convincing in his career."}
{"game_id": "0022100869", "chunk_id": "0022100869_002", "order": 2, "role": "body", "text": "Brown scored 26 of his 29 points in the first half and the Boston Celtics won their ninth in a row, dominating the Philadelphia 76ers 135-87 on Tuesday night."}
{"game_id": "0022100869", "chunk_id": "0022100869_003", "order": 3, "role": "body", "text": "“We’ll take it,” Brown said. “We got the job done tonight. It feels good.\""}
{"game_id": "0022100869", "chunk_id": "0022100869_004", "order": 4, "role": "body", "text": "Jayson Tatum added 28 points, 12 rebounds and six assists for the Celtics, who have closed ground in the Eastern Conference with their stellar play of late. Boston entered sixth in the East, 4 ½ back of first-place Miami. They have won 11 of 12."}
{"game_id": "0022100869", "chunk_id": "0022100869_005", "order": 5, "role": "body", "text": "“I love the resolve of what we’re doing,” Boston coach Ime Udoka said."}
{"game_id": "0022100869", "chunk_id": "0022100869_006", "order": 6, "role": "body", "text": "The margin of victory was the largest by the Celtics over Philadelphia in a rivalry that has been played 457 times. Boston’s previous biggest win was a 124-87 drubbing of Philadelphia on Dec. 20, 1987."}
{"game_id": "0022100869", "chunk_id": "0022100869_007", "order": 7, "role": "body", "text": "Joel Embiid had 19 points and nine rebounds for the 76ers. The NBA’s leading scorer entering the contest averaging 29.5 points, Embiid had his string of games with at least 25 points end at 31 in a row."}
{"game_id": "0022100869", "chunk_id": "0022100869_008", "order": 8, "role": "body", "text": "In their franchise history, the 76ers have had only six losses by greater margins than the 48-point blowout on Tuesday."}
{"game_id": "0022100869", "chunk_id": "0022100869_009", "order": 9, "role": "body", "text": "“They were better in every way: coaching, playing and if there’s another category, they were better in that, too,” 76ers coach Doc Rivers said."}
{"game_id": "0022100869", "chunk_id": "0022100869_010", "order": 10, "role": "body", "text": "James Harden made his first appearance in Philadelphia — but in street clothes. The recently acquired star continues to recover from a hamstring injury. Harden is expected to make his 76ers debut on Feb. 25 at Minnesota."}
{"game_id": "0022100869", "chunk_id": "0022100869_011", "order": 11, "role": "body", "text": "Earlier Tuesday, Philadelphia introduced Harden at a press conference at the team’s training center in Camden, New Jersey, following last week’s blockbuster trade that sent disgruntled guard Ben Simmons to the Brooklyn Nets. Harden drew a loud ovation when he came onto the court unannounced during pregame warmups, and the arena erupted when he rang the ceremonial Liberty Bell prior to the home introductions."}
{"game_id": "0022100869", "chunk_id": "0022100869_012", "order": 12, "role": "body", "text": "The 76ers sure could’ve used the 10-time All-Star, three-time scoring champ and former MVP during the game. His first in-person look at his new teammates came in their worst game of the season."}
{"game_id": "0022100869", "chunk_id": "0022100869_013", "order": 13, "role": "body", "text": "Boston torched Philadelphia in the opening 24 minutes, building a 27-point halftime lead. It got even worse for Philadelphia in the second half."}
{"game_id": "0022100869", "chunk_id": "0022100869_014", "order": 14, "role": "body", "text": "“We’ve just been playing better overall, clicking better as a unit,” Tatum said. “We just had to be ready from the jump.”"}
{"game_id": "0022100869", "chunk_id": "0022100869_015", "order": 15, "role": "body", "text": "The Celtics did little wrong to start while making 22 of 39 first-half shots and silencing the previously frenzied crowd. Brown made all five of his 3-point attempts and Tatum added 16 at the break."}
{"game_id": "0022100869", "chunk_id": "0022100869_016", "order": 16, "role": "body", "text": "The 76ers got a little life on Embiid’s jumper that pulled them within 58-41 with 2:26 left before halftime, resulting in a Celtics timeout and Harden — dressed in cut-up jeans and a long pink blazer with yellow sleeves — raising both arms to implore the crowd to get loud."}
{"game_id": "0022100869", "chunk_id": "0022100869_017", "order": 17, "role": "body", "text": "But Boston closed the half by scoring 11 of the final 12 points, capped by Brown’s 3-pointer at the buzzer that had him dancing back to the locker room and the Celtics ahead 69-42."}
{"game_id": "0022100869", "chunk_id": "0022100869_018", "order": 18, "role": "body", "text": "The Celtics led by as many as 51 in a second half that featured booing from the dissatisfied home fans."}
{"game_id": "0022100869", "chunk_id": "0022100869_020", "order": 20, "role": "body", "text": "Celtics: Marcus Smart limped off the court after getting hurt on a drive to the basket with 5:15 left in the second quarter. He appeared to injure his right ankle by stepping on Embiid’s foot and didn’t put any pressure on the ankle while being helped back to the bench. He stayed in the game briefly to shoot the free throws, missing both, before heading to the locker room and not returning. … Robert Williams III (right calf tightness) didn’t play. Williams entered Tuesday averaging 10.0 points and a team-best 9.7 rebounds. He’ll be evaluated on Wednesday to determine his status for the night’s game versus Detroit."}
{"game_id": "0022100869", "chunk_id": "0022100869_021", "order": 21, "role": "body", "text": "76ers: Embiid again played with a bandage wrapped around his right wrist. He has had his wrist heavily wrapped following Philadelphia’s last two contests, though he downplayed the injury. … Harden missed his final four games with the Nets due to the hamstring injury and hasn’t played in any of the three contests since the 76ers acquired him on Feb. 10, although he did participate in practice on Monday and Tuesday. He’ll also sit out Thursday’s game at Milwaukee."}
{"game_id": "0022100869", "chunk_id": "0022100869_023", "order": 23, "role": "body", "text": "Celtics: Derrick White, playing in his third game with Boston after a trade with San Antonio, had 11 points. … Improved to 14-15 on the road. … The teams tied the four-game season series at two apiece. Boston split a pair of home games, losing 108-103 on Dec. 20 and winning 88-87 on Dec. 1. Philadelphia recorded a 111-99 home win on Jan. 14."}
{"game_id": "0022100869", "chunk_id": "0022100869_024", "order": 24, "role": "body", "text": "76ers: Philadelphia’s largest-ever loss was a 56-point defeat on Jan. 2, 1993. … Shot 28.7% (23 of 80) from the field. … Philadelphia’s previous largest margin of defeat this season was a 35-point loss at Utah on Nov. 10. Embiid wasn’t in the lineup for that game, and their worst loss with their star big man before Tuesday was a 22-point home defeat to the Jazz on Dec. 9. … Veteran Paul Millsap, also part of the deal that brought Harden to Philadelphia, started the fourth quarter and finished with nine points."}
{"game_id": "0022100869", "chunk_id": "0022100869_026", "order": 26, "role": "body", "text": "Celtics: Host Detroit on Wednesday night."}
{"game_id": "0022100869", "chunk_id": "0022100869_027", "order": 27, "role": "body", "text": "76ers: At Milwaukee on Thursday night."}
