{"game_id": "0022100859", "chunk_id": "0022100859_001", "order": 1, "role": "lead", "text": "NEW YORK -- — In his first game as a member of the Nets, Seth Curry scored 23 points to lead Brooklyn to a 109-85 win over the Sacramento Kings on Monday night."}
{"game_id": "0022100859", "chunk_id": "0022100859_002", "order": 2, "role": "body", "text": "Brooklyn snapped its 11-game losing streak, and Curry was one of five players who finished in double figures. Bruce Brown set season-highs with 19 points, six assists, and five steals. LaMarcus Aldridge finished with 19 points, Cam Thomas added 14 off the bench and Andre Drummond contributed 11."}
{"game_id": "0022100859", "chunk_id": "0022100859_003", "order": 3, "role": "body", "text": "“I was just getting the ball off the rim and pushing it,\" Brown said. \"I had shooters around me: Patty (Mills and) Seth (Curry) now and when other guys come back, just space on the floor. I can just find angles, get to the rim or find them for catch-and-shoot 3s.”"}
{"game_id": "0022100859", "chunk_id": "0022100859_004", "order": 4, "role": "body", "text": "Despite getting a game-high 26 points from De’Aaron Fox, Sacramento’s modest two-game winning streak came to an end. Davion Mitchell finished with 13 and Donte DiVincenzo chipped in with 12."}
{"game_id": "0022100859", "chunk_id": "0022100859_005", "order": 5, "role": "body", "text": "The new-look Nets debuted two of the three players acquired from Philadelphia in last Thursday’s star-laden deal with the 76ers. Curry and Drummond started at off-guard and center, respectively. Simmons, the centerpiece of the trade for the Nets, sat on the bench, wearing a beige sweater and black pants."}
{"game_id": "0022100859", "chunk_id": "0022100859_006", "order": 6, "role": "body", "text": "Even without the three-time All-Star, the Nets looked like a drastically different squad than the one that tumbled down the Eastern Conference standings over the last three weeks. Offensively, Brooklyn’s spacing was much improved and the ball moved freely and crisply from player to player."}
{"game_id": "0022100859", "chunk_id": "0022100859_007", "order": 7, "role": "body", "text": "“(Coach Steve Nash's) message was very simple — just play your game and the rest will take care of itself,” Drummond said. “All the little details of plays and defensive schemes, you know, we’ll worry about that later when we’ve got time to practice, but today’s agenda was just to play as hard as we can and win a game.”"}
{"game_id": "0022100859", "chunk_id": "0022100859_008", "order": 8, "role": "body", "text": "The two best examples of Brooklyn’s improved passing occurred in the third quarter, when Curry and, later, Mills set up Drummond for demonstrative dunks with spectacular assists."}
{"game_id": "0022100859", "chunk_id": "0022100859_009", "order": 9, "role": "body", "text": "Brooklyn finished with 43 baskets on 25 assists. The Nets shot 51.2% from the field and 34.6% from 3 and had 19-point leads in the first, third, and fourth quarters in a game in which the Nets never trailed."}
{"game_id": "0022100859", "chunk_id": "0022100859_010", "order": 10, "role": "body", "text": "“We definitely shared the ball a lot more,” Brown said. “We were just getting out in transition a lot more than we used to. Get out and run everybody pushing it, finding anybody just playing together.”"}
{"game_id": "0022100859", "chunk_id": "0022100859_011", "order": 11, "role": "body", "text": "Sacramento was limited to 34.4% shooting (31 of 90) overall and 25.7% (9-for-35) from 3."}
{"game_id": "0022100859", "chunk_id": "0022100859_013", "order": 13, "role": "body", "text": "Two games is a microscopically small sample size, but interim Kings coach Alvin Gentry believes Domantas Sabonis has affected positive change. Sacramento acquired the center from Indiana on Feb. 8 in six-player trade with Indiana."}
{"game_id": "0022100859", "chunk_id": "0022100859_014", "order": 14, "role": "body", "text": "“We have played a lot of our offense through him,” Gentry said."}
{"game_id": "0022100859", "chunk_id": "0022100859_015", "order": 15, "role": "body", "text": "Sabonis came into Monday night’s game averaging 18.9 points, 12.1 rebounds, and 5.1 assists in 46 combined games with the Pacers and Sacramento this season. He had nine points, nine rebounds and two assists on Monday."}
{"game_id": "0022100859", "chunk_id": "0022100859_016", "order": 16, "role": "body", "text": "“I think our guys have really enjoyed playing with him on the floor,\" Gentry said. \"I think our cuts have been much better because I think they anticipate getting the ball on the scoring cuts that they make. He’s just been a real stabilizer for us, really.”"}
{"game_id": "0022100859", "chunk_id": "0022100859_018", "order": 18, "role": "body", "text": "The process of integrating Simmons into the Nets’ system has started. Acquired in that trade with the 76ers on Feb. 10, Simmons “did his assessments” with the team during morning shoot-around, coach Steve Nash said before the game."}
{"game_id": "0022100859", "chunk_id": "0022100859_019", "order": 19, "role": "body", "text": "He also stressed putting the 25-year old into the lineup won't be immediate."}
{"game_id": "0022100859", "chunk_id": "0022100859_020", "order": 20, "role": "body", "text": "“There’s been a long period of non-NBA activity,” Nash said. \"We’ll see how they put his program together and how long it takes.”"}
{"game_id": "0022100859", "chunk_id": "0022100859_022", "order": 22, "role": "body", "text": "Kings: Visit Chicago on Wednesday night."}
{"game_id": "0022100859", "chunk_id": "0022100859_023", "order": 23, "role": "body", "text": "Nets: Cross the East River to take on the rival New York Knicks on Wednesday."}
{"game_id": "0022100859", "chunk_id": "0022100859_025", "order": 25, "role": "closing", "text": "MORE AP NBA: https://apnews.com/NBA and https://twitter.com/AP--Sports"}
