{"game_id": "0022101154", "chunk_id": "0022101154_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Harrison Barnes scored 25 points, and the Sacramento Kings beat the Houston Rockets 122-117 on Friday night."}
{"game_id": "0022101154", "chunk_id": "0022101154_002", "order": 2, "role": "body", "text": "The Rockets and Kings were playing each other for the second time in three days following Sacramento’s 121-118 win on Wednesday."}
{"game_id": "0022101154", "chunk_id": "0022101154_003", "order": 3, "role": "body", "text": "“I thought everybody contributed, and when we needed a stop or a basket, different guys did it for us,” Kings coach Alvin Gentry said. “We had guys stepping up, and I think that’s the main thing. It was a really good team win.”"}
{"game_id": "0022101154", "chunk_id": "0022101154_004", "order": 4, "role": "body", "text": "For Sacramento, Damian Jones had 17 points, 17 rebounds and six blocks, Donte DiVincenzo had 19, and Chimezie Metu had 18. Barnes made 10 of 16 from the field, including 4 of 6 from 3-point range."}
{"game_id": "0022101154", "chunk_id": "0022101154_005", "order": 5, "role": "body", "text": "“We just want to play good basketball, finish these games out and see where it goes,” Jones said. “We all played our part and fought to the end.”"}
{"game_id": "0022101154", "chunk_id": "0022101154_006", "order": 6, "role": "body", "text": "Houston rookie Jalen Green scored a career-high 33 points and had six 3-pointers. He was coming off a 32-point night on Wednesday and topped 20 points for a fifth straight game."}
{"game_id": "0022101154", "chunk_id": "0022101154_007", "order": 7, "role": "body", "text": "“I feel like I draw a lot of attention,” Green said. “When you attack the middle, a lot of people are going to close in so I just have to be there for my teammates and get to the rim.”"}
{"game_id": "0022101154", "chunk_id": "0022101154_008", "order": 8, "role": "body", "text": "Kevin Porter Jr. had 27 points and 11 assists for the Rockets, and Garrison Mathews had 22 points on 6 of 10 shooting from 3."}
{"game_id": "0022101154", "chunk_id": "0022101154_009", "order": 9, "role": "body", "text": "The Kings finished the third quarter trailing 91-86, but opened the fourth on an 8-0 run to take a 94-91 lead. Sacramento outscored Houston 36-26 in the fourth quarter."}
{"game_id": "0022101154", "chunk_id": "0022101154_010", "order": 10, "role": "body", "text": "“We had a bunch of good looks, a bunch of good shots that just didn’t go,” Rockets coach Stephen Silas said. “The fight that our group is showing is great. I just wish we could come up with the results.”"}
{"game_id": "0022101154", "chunk_id": "0022101154_011", "order": 11, "role": "body", "text": "Hot first-quarter shooting helped the Rockets to a 41-26 lead early and they led by as much as 19 points in the first half, but Sacramento came back to tie the game late in the second quarter."}
{"game_id": "0022101154", "chunk_id": "0022101154_012", "order": 12, "role": "body", "text": "Houston led 62-57 at halftime."}
{"game_id": "0022101154", "chunk_id": "0022101154_013", "order": 13, "role": "body", "text": "Tempers flared from the sideline throughout the game. Gentry received a technical just 1:14 into the game after yelling at the officials and Silas received a technical later in the third quarter following a foul call."}
{"game_id": "0022101154", "chunk_id": "0022101154_015", "order": 15, "role": "body", "text": "The game was interrupted midway through the third quarter by a streaker, who stripped down to his underwear and danced midcourt for a few seconds before being taken down to the floor and carried out by security."}
{"game_id": "0022101154", "chunk_id": "0022101154_016", "order": 16, "role": "body", "text": "“That was pretty funny,\" Jones said. “It looked like it hurt, to be honest, being tackled by them dudes.”"}
{"game_id": "0022101154", "chunk_id": "0022101154_018", "order": 18, "role": "body", "text": "“For these guys to be going through these moments, it’s big for our group. In the fourth quarter, those were big minutes. It does get frustrating at times, but I can’t be frustrated with this group and how they’re playing. It’s frustrating that we lost, but these guys are playing,” Silas said."}
{"game_id": "0022101154", "chunk_id": "0022101154_020", "order": 20, "role": "body", "text": "Former Rocket Robert Horry sat courtside for the game. Horry, who won two of his seven championships with the Rockets, attempted — and drained — the pregame First Shot free throw for charity."}
{"game_id": "0022101154", "chunk_id": "0022101154_022", "order": 22, "role": "body", "text": "Kings: Sacramento was without De’Aaron Fox (right hand soreness), Domantas Sabonis (left knee contusion) and Richuan Holmes (personal). … The Kings made 12 of 28 3-pointers for 42.9%."}
{"game_id": "0022101154", "chunk_id": "0022101154_023", "order": 23, "role": "body", "text": "Rockets: Rookie C Alperen Sengun missed the game with a left leg contusion. Dennis Schroder (left shoulder soreness) missed a third straight game. … Usman Garuba had a career-high 14 rebounds."}
{"game_id": "0022101154", "chunk_id": "0022101154_025", "order": 25, "role": "body", "text": "Kings: Host Minnesota on Sunday."}
{"game_id": "0022101154", "chunk_id": "0022101154_026", "order": 26, "role": "body", "text": "Rockets: Host Golden State on Sunday."}
