{"game_id": "0022100922", "chunk_id": "0022100922_001", "order": 1, "role": "lead", "text": "MIAMI -- — For the first time all season, the Miami Heat have a bit of a cushion atop the Eastern Conference."}
{"game_id": "0022100922", "chunk_id": "0022100922_002", "order": 2, "role": "body", "text": "Gabe Vincent and Tyler Herro each scored 20 points, and the Heat topped the Chicago Bulls 112-99 on Monday night for their ninth win in their last 10 games. The Heat moved a season-best two games clear of the second-place Bulls in the East."}
{"game_id": "0022100922", "chunk_id": "0022100922_003", "order": 3, "role": "body", "text": "“Whatever people want to say about us is cool,” Herro said."}
{"game_id": "0022100922", "chunk_id": "0022100922_004", "order": 4, "role": "body", "text": "Jimmy Butler and Bam Adebayo each had 15 points for Miami. Max Strus had all 13 of his points in the fourth quarter for the Heat."}
{"game_id": "0022100922", "chunk_id": "0022100922_005", "order": 5, "role": "body", "text": "Chicago guard DeMar DeRozan's streak of 10 consecutive games with at least 30 points ended; he finished with 18."}
{"game_id": "0022100922", "chunk_id": "0022100922_006", "order": 6, "role": "body", "text": "“I was just playing,” DeRozan said of the streak. “Just going out there playing, competing, doing whatever I could. I was just going out there playing. ... I’m glad it’s over with so I can stop hearing everything about it.”"}
{"game_id": "0022100922", "chunk_id": "0022100922_007", "order": 7, "role": "body", "text": "Zach LaVine led the Bulls with 22 points, while Ayo Dosunmu had 18 and Nikola Vucevic added 14 for Chicago."}
{"game_id": "0022100922", "chunk_id": "0022100922_008", "order": 8, "role": "body", "text": "The Heat are now 3-0 against Chicago, ensuring Miami would hold a head-to-head tiebreaker over the Bulls if one is needed to determine seeding. The Heat led most of the way, building as much as a 24-point cushion."}
{"game_id": "0022100922", "chunk_id": "0022100922_009", "order": 9, "role": "body", "text": "Chicago has the sixth-best record in the NBA, but is now 1-8 against the five teams with better marks — Phoenix, Golden State, Memphis, Utah and Miami. The win was against the Jazz in October."}
{"game_id": "0022100922", "chunk_id": "0022100922_010", "order": 10, "role": "body", "text": "“I think the biggest thing for me is we have to get battle-tested in some of these games and we just don’t have a lot of guys who have gone into these kind of experiences,” Bulls coach Billy Donovan said. “I think it’s really good for us.”"}
{"game_id": "0022100922", "chunk_id": "0022100922_011", "order": 11, "role": "body", "text": "Vincent, starting for Miami in place of Kyle Lowry — out for personal reasons — was 7 for 13 from the field, 4 of 8 from 3-point range."}
{"game_id": "0022100922", "chunk_id": "0022100922_012", "order": 12, "role": "body", "text": "“When the opportunity comes you want to take advantage of it,” Vincent said. “We miss Kyle and can't wait to get him back.”"}
{"game_id": "0022100922", "chunk_id": "0022100922_013", "order": 13, "role": "body", "text": "The Bulls missed 14 of their first 15 3s before Dosunmu made one from the right corner early in the third quarter, getting Chicago within 65-51. But the Bulls never made a serious run in the second half, and Miami wasn’t threatened in the fourth."}
{"game_id": "0022100922", "chunk_id": "0022100922_014", "order": 14, "role": "body", "text": "Miami outscored Chicago 36-21 in the third, pushing its lead to 24 points going into the final 12 minutes. It matched the third-largest deficit for the Bulls after three quarters this season, plus it was the fifth-largest advantage for the Heat at that point in a game this season."}
{"game_id": "0022100922", "chunk_id": "0022100922_016", "order": 16, "role": "body", "text": "Bulls: Chicago will take advantage of a couple days in Miami, with the team not scheduled to leave for Atlanta until Wednesday afternoon. ... DeRozan’s streak of 30-point games ended one shy of matching Michael Jordan’s franchise record of 11 in a row. There have been 29 instances of a Bulls player scoring 30 points in at least five consecutive regular-season games; DeRozan is now responsible for one of those streaks, Jordan for the other 28."}
{"game_id": "0022100922", "chunk_id": "0022100922_017", "order": 17, "role": "body", "text": "Heat: Miami is 41-21. The last five Heat teams to start 41-21 or better all went to the NBA Finals. ... It’s unknown how long Lowry will be away from the team. ... Actor Mark Wahlberg was among those in the crowd, as was former Miami player Michael Beasley. ... The Heat have a two-game trip to Milwaukee and Brooklyn later this week, then return home for 11 of their next 12 games. ... For the second consecutive game, a Ukrainian flag adorned the arena’s outside video display, and some fans also unfurled them inside the building."}
{"game_id": "0022100922", "chunk_id": "0022100922_019", "order": 19, "role": "body", "text": "Heat G Victor Oladipo has started a second stint with Miami’s G League team in Sioux Falls, South Dakota, as he ramps up the final stages of what’s been nearly a yearlong recovery from leg surgery. Oladipo practiced Monday and will practice again Tuesday and Wednesday. It's possible he could make his season debut for the Heat by mid-March."}
{"game_id": "0022100922", "chunk_id": "0022100922_021", "order": 21, "role": "body", "text": "Bulls G Alex Caruso hasn’t played since Jan. 21 because of a broken wrist. He’s doing some on-court work, but the strength in his right wrist isn’t anywhere near where he and the Bulls need it to be before he can think about playing again. He’s expected back in March, but a specific date has not been set."}
{"game_id": "0022100922", "chunk_id": "0022100922_023", "order": 23, "role": "body", "text": "Bulls: Visit Atlanta on Thursday."}
{"game_id": "0022100922", "chunk_id": "0022100922_024", "order": 24, "role": "body", "text": "Heat: Visit Milwaukee on Wednesday."}
