{"game_id": "0022100267", "chunk_id": "0022100267_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — With the Suns' long winning streak in serious danger, Devin Booker and Chris Paul knew exactly what had to be done."}
{"game_id": "0022100267", "chunk_id": "0022100267_002", "order": 2, "role": "body", "text": "Phoenix's season is still rising."}
{"game_id": "0022100267", "chunk_id": "0022100267_003", "order": 3, "role": "body", "text": "Booker scored 35 points, Paul had 12 assists and made four free throws in the final 8.8 seconds, and the Suns extended their winning streak to 14 games by holding off the Cleveland Cavaliers 120-115 on Wednesday night."}
{"game_id": "0022100267", "chunk_id": "0022100267_004", "order": 4, "role": "body", "text": "Phoenix's streak started with a win at home over Cleveland on Oct. 30, which came after a 1/3 opening to the season for the defending Western Conference champions. The surge has also corresponded with allegations of racism and misogyny surfacing against Suns owner Robert Sarver."}
{"game_id": "0022100267", "chunk_id": "0022100267_005", "order": 5, "role": "body", "text": "“That's just coincidence,” Paul said of the timing. “Our plan wasn't to start out 1-3. We've got a great group, a great locker room. I've never seen anything like it.”"}
{"game_id": "0022100267", "chunk_id": "0022100267_006", "order": 6, "role": "body", "text": "For nearly a month, the Suns have won in a variety of ways and Wednesday they improved the NBA's best road record to 7-1."}
{"game_id": "0022100267", "chunk_id": "0022100267_008", "order": 8, "role": "body", "text": "The young Cavs gave the Suns everything they could handle, and if not for Paul, a couple calls that could have gone either way and Cleveland's Ricky Rubio missing three free throws in the final seconds, the streak might have ended."}
{"game_id": "0022100267", "chunk_id": "0022100267_009", "order": 9, "role": "body", "text": "The win was also the 100th with the Suns for coach Monty Williams, who is in his third season with the club."}
{"game_id": "0022100267", "chunk_id": "0022100267_010", "order": 10, "role": "body", "text": "“We know we can win ugly games,” Williams said. “We know we can win slug outs. I wish we could win by 30 every night. But they have a really good team. We're just finding ways to win.”"}
{"game_id": "0022100267", "chunk_id": "0022100267_011", "order": 11, "role": "body", "text": "Jarrett Allen had 25 points and 11 rebounds, and Cedi Osman added 23 points for Cleveland, which dropped its fifth straight. Darius Garland scored 19 before fouling out late."}
{"game_id": "0022100267", "chunk_id": "0022100267_012", "order": 12, "role": "body", "text": "Paul finished with 17 points and JaVale McGee added 13 points and 12 rebounds in 20 minutes off the bench."}
{"game_id": "0022100267", "chunk_id": "0022100267_013", "order": 13, "role": "body", "text": "Williams pointed to a key sequence down the stretch when Mikal Bridges blocked Osman and Paul got Garland to bite on a rip-through move for his sixth personal."}
{"game_id": "0022100267", "chunk_id": "0022100267_014", "order": 14, "role": "body", "text": "“The biggest thing was just to get him out of the game because he's so shifty,” Paul said. “When I'm at home he's one of the guys I Iove to watch.”"}
{"game_id": "0022100267", "chunk_id": "0022100267_015", "order": 15, "role": "body", "text": "The Cavs were still within 117-114 when the Suns fouled Rubio with 6.5 seconds left. The veteran point guard, getting more time with leading scorer Collin Sexton out for the year, split the pair and Cleveland was forced to foul Booker."}
{"game_id": "0022100267", "chunk_id": "0022100267_016", "order": 16, "role": "body", "text": "The Suns' star also made just one of two and Phoenix put Rubio back on the line. He missed two more, the second one on purpose before Paul sealed it by making two free throws with 3.8 seconds left."}
{"game_id": "0022100267", "chunk_id": "0022100267_017", "order": 17, "role": "body", "text": "“Stay in the moment,” Paul said of his ability to stay calm in pressure moments at the line. “I've missed a ton of them in my career, too.”"}
{"game_id": "0022100267", "chunk_id": "0022100267_018", "order": 18, "role": "body", "text": "Phoenix's winning streak is the third-longest in club history, matching a 14-gamer by the club in 1992. The Suns won 17 straight during the 2006-07 season."}
{"game_id": "0022100267", "chunk_id": "0022100267_019", "order": 19, "role": "body", "text": "Leading by just one point after three, the Suns outscored the Cavs 13-4 to start the fourth and open a 100-90 lead with 6:56 left."}
{"game_id": "0022100267", "chunk_id": "0022100267_020", "order": 20, "role": "body", "text": "However, Phoenix couldn't pull away as Osman kept Cleveland close by scoring nine consecutive points in one stretch and then burying a 3-pointer to pull the Cavs within 105-104 with 3:49 remaining."}
{"game_id": "0022100267", "chunk_id": "0022100267_021", "order": 21, "role": "body", "text": "“For 48 minutes, we were right there,” Osman said. \"That’s what we do. We compete.”"}
{"game_id": "0022100267", "chunk_id": "0022100267_023", "order": 23, "role": "body", "text": "Suns: Bridges played in his 245th straight game to begin his career, the league's longest active streak. ... F Abdul Nader (injury management), who underwent arthroscopic right knee surgery on April 26, sat out his third consecutive game. … F Frank Kaminsky (right knee stress reaction) has missed five games in a row. … F Dario Saric (right knee surgery) last played in the opener of the 2021 NBA Finals."}
{"game_id": "0022100267", "chunk_id": "0022100267_024", "order": 24, "role": "body", "text": "Cavaliers: In some ways, Cleveland has modeled its rebuild after Phoenix's rise by drafting wisely and supplementing the roster with smart free-agent signings. “That is our goal,” coach J.B. Bickerstaff said. “To achieve the things that they've achieved and build the way they've kind of built. We're headed in the right direction.” ... Short-handed most of the season, Cleveland is still missing rookie F Evan Mobley (elbow sprain), Sexton (season-ending knee injury) and G Lamar Stevens (ankle sprain)."}
{"game_id": "0022100267", "chunk_id": "0022100267_026", "order": 26, "role": "body", "text": "Because of his length and athleticism, Mobley, who won’t be back until next month and was off to a fabulous start, has drawn comparisons to Chris Bosh among others."}
{"game_id": "0022100267", "chunk_id": "0022100267_027", "order": 27, "role": "body", "text": "The 20-year-old reminds William of a young Anthony Davis."}
{"game_id": "0022100267", "chunk_id": "0022100267_028", "order": 28, "role": "body", "text": "“They’re both long and graceful, if that makes sense,” said Williams, who spoke to Cavs coach Bickerstaff about the No. 3 overall pick before the season. “He can make plays with the basketball and he’s light on his feet."}
{"game_id": "0022100267", "chunk_id": "0022100267_029", "order": 29, "role": "body", "text": "“When I saw him make a pass with his left hand, that’s what showed me what kind of a playmaker he can be. Be careful putting him in that box because he’s his own player and he’s phenomenal.”"}
{"game_id": "0022100267", "chunk_id": "0022100267_031", "order": 31, "role": "body", "text": "Suns: Continue their four-game trip at New York on Friday against the Knicks."}
{"game_id": "0022100267", "chunk_id": "0022100267_032", "order": 32, "role": "body", "text": "Cavaliers: Host the Orlando Magic on Saturday."}
