{"game_id": "0022101142", "chunk_id": "0022101142_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Davion Mitchell, Damian Jones and Trey Lyles scored 24 points each, and the Sacramento Kings outlasted the Houston Rockets for a 121-118 win Wednesday night."}
{"game_id": "0022101142", "chunk_id": "0022101142_002", "order": 2, "role": "body", "text": "It was a wild back-and-forth game where both teams had double-digit leads before staying close in the fourth quarter."}
{"game_id": "0022101142", "chunk_id": "0022101142_003", "order": 3, "role": "body", "text": "Mitchell, who is a rookie, hopes that the Kings use these last few games to try and build momentum for more success next season."}
{"game_id": "0022101142", "chunk_id": "0022101142_004", "order": 4, "role": "body", "text": "“I feel like the whole year we didn’t really have an identity,\" he said. “Some games we’d play hard, some games we’d be sluggish. I think these games right here are helping us get an identity. Be that team that plays hard, is aggressive and who loves to play on the defensive end not just the offensive end.\""}
{"game_id": "0022101142", "chunk_id": "0022101142_005", "order": 5, "role": "body", "text": "The Kings got the win despite big performances from two of Houston’s young stars. Rookie Jalen Green, the second overall pick in the draft, tied a season high with 32 points, and Kevin Porter Jr. had his first career triple-double with 30 points, 12 assists and a career-high 12 rebounds."}
{"game_id": "0022101142", "chunk_id": "0022101142_006", "order": 6, "role": "body", "text": "Coach Stephen Silas was asked about Porter getting his first triple-double."}
{"game_id": "0022101142", "chunk_id": "0022101142_007", "order": 7, "role": "body", "text": "“It shows a lot of commitment,\" Silas said. “Commitment on his end as far as working to get better and getting the little successes to gain confidence and having big success tonight.\""}
{"game_id": "0022101142", "chunk_id": "0022101142_008", "order": 8, "role": "body", "text": "Donte DiVincenzo hit a 3 for Sacramento with about two minutes left and Jones added a layup on the next possession to give Sacramento a 117-113 lead with just more than a minute to go."}
{"game_id": "0022101142", "chunk_id": "0022101142_009", "order": 9, "role": "body", "text": "A basket by Jae’Sean Tate cut the lead to 2 and Josh Christopher got a steal but was called for a charge on the other end to give the Kings the ball back with 45 seconds left."}
{"game_id": "0022101142", "chunk_id": "0022101142_010", "order": 10, "role": "body", "text": "Mitchell turned it over to give Houston the ball with 24 seconds to go, but Porter couldn’t handle a bad inbound pass from Garrison Mathews, and the Kings got it back."}
{"game_id": "0022101142", "chunk_id": "0022101142_011", "order": 11, "role": "body", "text": "Mitchell made two free throws after that to extend the lead to 119-115, but a 3 by Green got Houston within 1 with 10.5 seconds left. Lyles made two free throws after that, and the Rockets had a chance to tie it at the buzzer. Christopher’s 3-pointer bounced off the rim."}
{"game_id": "0022101142", "chunk_id": "0022101142_012", "order": 12, "role": "body", "text": "Porter, who is 21, joins LeBron James, Brandon Jennings and Trae Young as the only players to have both a 50-point game and a triple-double before age 22. Porter had a career-high 50 points last April 29th against Milwaukee."}
{"game_id": "0022101142", "chunk_id": "0022101142_013", "order": 13, "role": "body", "text": "“I can’t even enjoy this one for real,\" Porter said. “Ultimately you want to win, so it wasn’t good enough.\""}
{"game_id": "0022101142", "chunk_id": "0022101142_014", "order": 14, "role": "body", "text": "It was the fifth straight game with at least 20 points for Mitchell, who was the ninth pick in the most recent draft."}
{"game_id": "0022101142", "chunk_id": "0022101142_015", "order": 15, "role": "body", "text": "“I’m learning a lot especially in games like this going down to the wire,\" he said. “I think it’s going to help me in the long run.\""}
{"game_id": "0022101142", "chunk_id": "0022101142_016", "order": 16, "role": "body", "text": "Both teams had trouble offensively to start the fourth and each team had scored just one basket when Kenyon Martin made a 3-pointer with 6 ½ minutes left to put Houston up 108-106."}
{"game_id": "0022101142", "chunk_id": "0022101142_017", "order": 17, "role": "body", "text": "The Kings went on a 6-0 run after that to take a 112-108 lead with 3 ½ minutes to go."}
{"game_id": "0022101142", "chunk_id": "0022101142_018", "order": 18, "role": "body", "text": "A 3-point play by Porter gave Houston its first points in almost four minutes and cut the lead to 1 with about 2 1/2 minutes left. Usman Garuba followed with a layup to put Houston on top 113-112."}
{"game_id": "0022101142", "chunk_id": "0022101142_019", "order": 19, "role": "body", "text": "Porter made four points to get the Rockets within 3 with about eight minutes left in the third quarter. The Kings then used a 13-2 run to make it 95-81 with about 4 1/2 minutes to go in the quarter."}
{"game_id": "0022101142", "chunk_id": "0022101142_020", "order": 20, "role": "body", "text": "Harrison Barnes had four points in that stretch and DiVincenzo capped it with a 3-pointer."}
{"game_id": "0022101142", "chunk_id": "0022101142_021", "order": 21, "role": "body", "text": "Sacramento had an 11-point lead later in the third before the Rockets used a 12-2 run to wrap up the period and cut it to 104-103 entering the fourth."}
{"game_id": "0022101142", "chunk_id": "0022101142_022", "order": 22, "role": "body", "text": "Porter and Bruno Fernando had four points each in that stretch and Christopher had two steals to help the Rockets close the gap."}
{"game_id": "0022101142", "chunk_id": "0022101142_024", "order": 24, "role": "body", "text": "Kings: De’Aaron Fox missed a sixth straight game with a sore right hand. ... Donatas Sabonis was out for a fourth consecutive game with a bruised left knee. ... Sacramento made just 7 of 26 3-pointers."}
{"game_id": "0022101142", "chunk_id": "0022101142_025", "order": 25, "role": "body", "text": "Rockets: Eric Gordon sat out for a third straight game with right groin soreness. ... Dennis Schroder missed his second game with a sore left shoulder. ... Christian Wood was out for the second game in a row with tightness in his left hamstring. ... Alperen Sengun missed the game because of a bruised left leg."}
{"game_id": "0022101142", "chunk_id": "0022101142_027", "order": 27, "role": "body", "text": "Green on Porter's performance: “He just does it so easy... he’s super talented.\""}
{"game_id": "0022101142", "chunk_id": "0022101142_029", "order": 29, "role": "body", "text": "These teams meet again in Houston Friday night."}
