{"game_id": "0022100700", "chunk_id": "0022100700_001", "order": 1, "role": "lead", "text": "MIAMI -- — The Miami Heat knew the run was coming. Even early in the fourth quarter, with a 23-point lead, Heat players were telling each other that the game wasn't over."}
{"game_id": "0022100700", "chunk_id": "0022100700_002", "order": 2, "role": "body", "text": "They were right. And they handled the moment — then moved atop the Eastern Conference."}
{"game_id": "0022100700", "chunk_id": "0022100700_003", "order": 3, "role": "body", "text": "Jimmy Butler broke LeBron James' record for triple-doubles in a Miami uniform, Duncan Robinson scored 25 points and the Heat held off a furious comeback attempt from the Los Angeles Lakers on the way to a 113-107 win on Sunday night."}
{"game_id": "0022100700", "chunk_id": "0022100700_004", "order": 4, "role": "body", "text": "“I think those are important experiences to go through together,” Heat coach Erik Spoelstra said."}
{"game_id": "0022100700", "chunk_id": "0022100700_005", "order": 5, "role": "body", "text": "The win, combined with losses by Brooklyn and Chicago, put Miami (30-17) at the top of the East, a half-game ahead of the Nets (29-17) and a game clear of the Bulls (28-17)."}
{"game_id": "0022100700", "chunk_id": "0022100700_006", "order": 6, "role": "body", "text": "Butler finished with 20 points, 10 rebounds and 12 assists for Miami, his 10th regular-season triple-double for the Heat — one more than James had in his four Miami seasons."}
{"game_id": "0022100700", "chunk_id": "0022100700_007", "order": 7, "role": "body", "text": "Miami led 89-70 going into the fourth, pushed the lead out to 23 with 8:38 left, then had to stave off what became a 32-13 Los Angeles run that got the Lakers within four in the final moments."}
{"game_id": "0022100700", "chunk_id": "0022100700_008", "order": 8, "role": "body", "text": "“To have those kind of pivotal moments down the stretch, you can never have enough of those,\" Robinson said. “They're invaluable.\""}
{"game_id": "0022100700", "chunk_id": "0022100700_009", "order": 9, "role": "body", "text": "Caleb Martin scored 15, Bam Adebayo scored 14 and Gabe Vincent had 11 for Miami, which wasted most of a 26-point first-half lead."}
{"game_id": "0022100700", "chunk_id": "0022100700_010", "order": 10, "role": "body", "text": "James carried the Lakers yet again, finishing with 33 points — his 17th consecutive game with at least 26 — and 11 rebounds. Russell Westbrook scored 24 for the Lakers, former Heat guard Avery Bradley added 15 and Carmelo Anthony scored 11."}
{"game_id": "0022100700", "chunk_id": "0022100700_011", "order": 11, "role": "body", "text": "“I'm in one of the best zones offensively I've been in in my career,\" James said."}
{"game_id": "0022100700", "chunk_id": "0022100700_012", "order": 12, "role": "body", "text": "The Heat were still without Kyle Lowry (personal matter) and Tyler Herro (health and safety protocols). It was the fourth consecutive missed game for Lowry, the third for Herro."}
{"game_id": "0022100700", "chunk_id": "0022100700_013", "order": 13, "role": "body", "text": "The Lakers were without Anthony Davis for a 17th consecutive game while he continues recovery from a sprained left knee ligament. Davis was listed as questionable for Sunday, raising the chance he could have finally returned, but the Lakers decided he needed at least a couple more days."}
{"game_id": "0022100700", "chunk_id": "0022100700_014", "order": 14, "role": "body", "text": "“He’s getting closer ... but not quite there yet,” Lakers coach Frank Vogel said."}
{"game_id": "0022100700", "chunk_id": "0022100700_015", "order": 15, "role": "body", "text": "The loss sent the Lakers to 23-24 — the first time since James' rookie season that he's been on a team with a losing record this deep into a season."}
{"game_id": "0022100700", "chunk_id": "0022100700_016", "order": 16, "role": "body", "text": "Miami came out flying, opening a double-digit lead just 5:12 into the game, going up 32-14 on a 3-pointer by PJ Tucker with 3:36 left in the opening quarter and taking a 39-25 lead into the second after Max Strus beat the clock with a corner 3-pointer over James’ outstretched arm."}
{"game_id": "0022100700", "chunk_id": "0022100700_017", "order": 17, "role": "body", "text": "The Lakers trailed by as many as 26 in the first half, their biggest pre-halftime deficit of the season, before James flexed some muscle just before the break. He scored the Lakers’ last six points of the second quarter, posing after powering through a double-team for one of those baskets, and got Los Angeles within 69-52 by the break."}
{"game_id": "0022100700", "chunk_id": "0022100700_018", "order": 18, "role": "body", "text": "“We just had a few too many breakdowns and they made us pay for everything,\" Vogel said."}
{"game_id": "0022100700", "chunk_id": "0022100700_019", "order": 19, "role": "body", "text": "Then came the rally try. James grabbed an offensive rebound and scored with 1:07 left to get the Lakers within 111-107, then got a stop on the next Heat possession — but Bradley fouled Tucker on a moving screen with 37.7 seconds remaining for a costly turnover."}
{"game_id": "0022100700", "chunk_id": "0022100700_020", "order": 20, "role": "body", "text": "Talen Horton-Tucker had another turnover on an inbounds pass with the Lakers down four with 7 seconds left, and Miami would survive."}
{"game_id": "0022100700", "chunk_id": "0022100700_021", "order": 21, "role": "body", "text": "“In the fourth quarter we played the type of basketball we want to play, but we dug ourselves too much of a hole early in the game,\" James said."}
{"game_id": "0022100700", "chunk_id": "0022100700_023", "order": 23, "role": "body", "text": "Lakers: The Lakers got a three-night stay on their lone visit to Miami this season, arriving Friday night after playing in Orlando. They aren’t scheduled to leave until Monday afternoon, flying then to New York for a Tuesday game against Brooklyn. ... James hadn’t played at Miami since Dec. 13, 2019."}
{"game_id": "0022100700", "chunk_id": "0022100700_024", "order": 24, "role": "body", "text": "Heat: Butler, playing in his 709th game including playoffs, had 10 assists by halftime for the first time. ... Miami held the Lakers to 11 of 40 shooting from 3-point range, and had 31 assists to the Lakers' 20."}
{"game_id": "0022100700", "chunk_id": "0022100700_026", "order": 26, "role": "body", "text": "Spoelstra studies film of James often at home. Not Lakers game film, however. Spoelstra and his wife Nikki have two young sons, and the boys are big fans of James’ movie “Space Jam: A New Legacy.” Said Spoelstra: “He’s our entertainment a couple nights a week. We put on ‘Space Jam.’ ... Our family enjoys the movie. I know our kids love it. He’s creating great joy for the Spo bros in our household.”"}
{"game_id": "0022100700", "chunk_id": "0022100700_028", "order": 28, "role": "body", "text": "Miami’s Dewayne Dedmon had a rare five-point possession — scoring while being flagrantly fouled, getting one free throw from that, then getting another field goal on the continuation after the flagrant. He also helped the Lakers have a five-point trip, flagrantly fouling Anthony, who made two free throws before Stanley Johnson hit a 3-pointer on the Lakers’ extended possession."}
{"game_id": "0022100700", "chunk_id": "0022100700_030", "order": 30, "role": "body", "text": "The last Lakers at Heat game was on April 8. The Lakers used nine players in that game; none of those nine are still with the Lakers. The Heat used 10 players in that game; of those, only Butler, Adebayo and Robinson played for Miami on Sunday."}
{"game_id": "0022100700", "chunk_id": "0022100700_032", "order": 32, "role": "body", "text": "Lakers: Visit Brooklyn on Tuesday."}
{"game_id": "0022100700", "chunk_id": "0022100700_033", "order": 33, "role": "body", "text": "Heat: Host New York on Wednesday."}
