{"game_id": "0022100697", "chunk_id": "0022100697_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Devin Booker wound up for a celebratory windmill dunk in the final minute, but misjudged it badly. The ball clanged off the back of the rim and ricocheted downcourt as the home crowd groaned."}
{"game_id": "0022100697", "chunk_id": "0022100697_002", "order": 2, "role": "body", "text": "The Phoenix Suns' star guard retreated with a sheepish grin."}
{"game_id": "0022100697", "chunk_id": "0022100697_003", "order": 3, "role": "body", "text": "It was one of the few things that's gone wrong lately for the NBA's top team."}
{"game_id": "0022100697", "chunk_id": "0022100697_004", "order": 4, "role": "body", "text": "Mikal Bridges tied a season high with 23 points, Bismack Biyombo matched his career best with 21 and the Suns won their sixth straight game by beating the Indiana Pacers 113-103 on Saturday night."}
{"game_id": "0022100697", "chunk_id": "0022100697_005", "order": 5, "role": "body", "text": "Biyombo also grabbed 13 rebounds as the Suns improved their NBA-best record to 36-9, shaking off a tough night for Booker, the team's leading scorer. He finished with just 11 points on 5-of-23 shooting, including 0 for 6 from 3-point range."}
{"game_id": "0022100697", "chunk_id": "0022100697_006", "order": 6, "role": "body", "text": "“That’s what makes us a pretty good team,” Bridges said. “Everybody can play, everybody can hoop. We just feed off of each other and we’re all unselfish. We play for each other and find each other.”"}
{"game_id": "0022100697", "chunk_id": "0022100697_007", "order": 7, "role": "body", "text": "Chris Paul added 18 points and 16 assists for the Suns. Bridges shot 10 of 15 from the field to help Phoenix equal its best start through 45 games. The Suns have opened 36-9 three other times, most recently during the 2006-07 season."}
{"game_id": "0022100697", "chunk_id": "0022100697_008", "order": 8, "role": "body", "text": "“Bridges really killed us tonight,” Pacers coach Rick Carlisle said. “With the way he does things off the ball, he finds the nook and crannies, he gets open for 3s in the corners. He was tremendous.”"}
{"game_id": "0022100697", "chunk_id": "0022100697_009", "order": 9, "role": "body", "text": "Phoenix had a 59-54 halftime and then went on an 8-0 run to start the third quarter to take control. The Suns pushed their advantage to 20 points late in the third and took a 92-74 lead into the fourth. The Pacers cut it to 105-99 with 3:59 left but couldn't get any closer."}
{"game_id": "0022100697", "chunk_id": "0022100697_010", "order": 10, "role": "body", "text": "“We’re just trying to pile up wins,” Paul said. “We could have been a little more solid down the stretch.”"}
{"game_id": "0022100697", "chunk_id": "0022100697_011", "order": 11, "role": "body", "text": "The short-handed Pacers were coming off impressive back-to-back wins against the Lakers and Warriors but couldn't keep the momentum going. Chris Duarte and Lance Stephenson both scored 17 points. Goga Bidatze added 16 points and 11 rebounds."}
{"game_id": "0022100697", "chunk_id": "0022100697_012", "order": 12, "role": "body", "text": "“With the guys we have out, we've got to be gritty and tough and resourceful,” Carlisle said. “That was really how we were in the first and fourth quarters. In the second and third we didn’t play well.”"}
{"game_id": "0022100697", "chunk_id": "0022100697_013", "order": 13, "role": "body", "text": "The Suns have been playing some of their basketball of the season, returning to the desert for Saturday's game after a 5-0 road trip."}
{"game_id": "0022100697", "chunk_id": "0022100697_014", "order": 14, "role": "body", "text": "Phoenix had a five-point halftime lead after shooting 54.3% in the first half. Paul had 14 points and nine assists, and Bridges added 13 points. Duarte led the Pacers with 11 points."}
{"game_id": "0022100697", "chunk_id": "0022100697_016", "order": 16, "role": "body", "text": "Biyombo was been a stellar midseason addition since being signed to a 10-day contract on Jan. 1. He was signed for the rest of the season on Jan. 11."}
{"game_id": "0022100697", "chunk_id": "0022100697_017", "order": 17, "role": "body", "text": "The 6-foot-8 Biyombo is a 10-year veteran and made an immediate impact on the Suns' rotation, coming into Saturday's game averaging 8.6 points and 6.0 rebounds per game. He was a force against the Pacers, shooting 9 of 11 from the field and adding five assists."}
{"game_id": "0022100697", "chunk_id": "0022100697_019", "order": 19, "role": "body", "text": "Suns guard Cam Payne and forward Jae Crowder both had to leave the game because of wrist injuries."}
{"game_id": "0022100697", "chunk_id": "0022100697_020", "order": 20, "role": "body", "text": "Payne was hurt on an awkward fall following a foul in the first quarter. He was slow to get up and was shaking his right hand throughout the second quarter but stayed in the game. He didn't play in the second half, finishing with seven points and three assists."}
{"game_id": "0022100697", "chunk_id": "0022100697_021", "order": 21, "role": "body", "text": "Crowder was hurt in the third quarter after a rough fall following a layup. He was holding his left wrist and immediately jogged back to the locker room to have it checked out."}
{"game_id": "0022100697", "chunk_id": "0022100697_022", "order": 22, "role": "body", "text": "For both players, the injury is to their non-shooting hand. Phoenix coach Monty Williams said postgame that he didn't have an immediate update on either player."}
{"game_id": "0022100697", "chunk_id": "0022100697_024", "order": 24, "role": "body", "text": "Pacers: Six players were on the inactive list, including their top three scorers in F Domantas Sabonis (ankle), F Malcolm Brogdon (sore right Achilles) and G Caris LeVert (sore right calf)."}
{"game_id": "0022100697", "chunk_id": "0022100697_025", "order": 25, "role": "body", "text": "Suns: Starting center Deandre Ayton missed the game with a sprained right ankle. ... The Suns hosted a sellout crowd for the eighth straight game. ... Snapped a six-game home losing streak to the Pacers, beating them at Footprint Center for the first time since 2014."}
{"game_id": "0022100697", "chunk_id": "0022100697_027", "order": 27, "role": "body", "text": "Pacers: Travel to face the New Orleans Pelicans on Monday."}
{"game_id": "0022100697", "chunk_id": "0022100697_028", "order": 28, "role": "body", "text": "Suns: Host the Utah Jazz on Monday."}
