{"game_id": "0022100996", "chunk_id": "0022100996_001", "order": 1, "role": "lead", "text": "ATLANTA -- — The Atlanta Hawks finally rediscovered the late-game composure that helped take them to the Eastern Conference finals last season."}
{"game_id": "0022100996", "chunk_id": "0022100996_002", "order": 2, "role": "body", "text": "Trae Young scored 27 points to lead six Atlanta scorers in double figures and the Hawks held off the Los Angeles Clippers 112-106 on Friday night."}
{"game_id": "0022100996", "chunk_id": "0022100996_003", "order": 3, "role": "body", "text": "The Hawks, who snapped a two-game losing streak, are in danger of missing the postseason. They began the night 10th in the Eastern Conference, holding the final spot in the play-in tournament. The Clippers are eighth in the West."}
{"game_id": "0022100996", "chunk_id": "0022100996_004", "order": 4, "role": "body", "text": "The Clippers trailed only 108-106 following Ivica Zubac’s hook with 56 seconds remaining. Zubac had 24 points and 12 rebounds."}
{"game_id": "0022100996", "chunk_id": "0022100996_005", "order": 5, "role": "body", "text": "De’Andre Hunter answered with a short jumper for Atlanta."}
{"game_id": "0022100996", "chunk_id": "0022100996_006", "order": 6, "role": "body", "text": "“That’s important for us, especially coming down the stretch,” Young said about the Hawks' late-game poise. “We’ve got to figure out how to close out games better. ... We’ve got to consistently do it.”"}
{"game_id": "0022100996", "chunk_id": "0022100996_007", "order": 7, "role": "body", "text": "It was an encouraging sign for Hawks coach Nate McMillan."}
{"game_id": "0022100996", "chunk_id": "0022100996_008", "order": 8, "role": "body", "text": "“We’ve been talking about execution in the last couple games and that’s execution,” McMillan said. “We’ve got to make stops when we need stops and we’ve got to make baskets when we need baskets. We were able to do that the last five minutes of the game.”"}
{"game_id": "0022100996", "chunk_id": "0022100996_009", "order": 9, "role": "body", "text": "With the game tied at 82 late in the third quarter, Clippers forward Marcus Morris Sr. was ejected after drawing two technical fouls for objecting when called for traveling."}
{"game_id": "0022100996", "chunk_id": "0022100996_010", "order": 10, "role": "body", "text": "“We definitely could have used his services out there,” said Clippers guard Reggie Jackson."}
{"game_id": "0022100996", "chunk_id": "0022100996_011", "order": 11, "role": "body", "text": "Morris was holding the ball at the top of the circle when he pivoted and was called for traveling. Morris left the game with 13 points."}
{"game_id": "0022100996", "chunk_id": "0022100996_012", "order": 12, "role": "body", "text": "“The officiating tonight, we didn’t get a good whistle,\" said Clippers coach Tyronn Lue. “... Marcus got a little frustrated with that. ... That kind of hurt us.”"}
{"game_id": "0022100996", "chunk_id": "0022100996_013", "order": 13, "role": "body", "text": "Young's free throw gave Atlanta the lead. Danilo Gallinari followed with a 3-pointer and the Clippers played from behind the remainder of the game."}
{"game_id": "0022100996", "chunk_id": "0022100996_014", "order": 14, "role": "body", "text": "Atlanta led only 94-92 in the fourth when back-to-back three-point plays by Onyeka Okongwu stretched the advantage to eight points."}
{"game_id": "0022100996", "chunk_id": "0022100996_015", "order": 15, "role": "body", "text": "After Atlanta led 52-46, Los Angeles used a 13-0 run to lead 59-52. The Hawks scored the final eight points of the period to lead 60-59 at halftime."}
{"game_id": "0022100996", "chunk_id": "0022100996_017", "order": 17, "role": "body", "text": "The Hawks’ John Collins, who had nine points in 23 minutes, is far from fully recovered from a right foot strain that forced the power forward to miss seven games in February and early March."}
{"game_id": "0022100996", "chunk_id": "0022100996_018", "order": 18, "role": "body", "text": "“I really have a great deal of respect for what John is doing for us and what he’s trying to play through,” McMillan said."}
{"game_id": "0022100996", "chunk_id": "0022100996_019", "order": 19, "role": "body", "text": "The Hawks had no player listed on their pregame injury report."}
{"game_id": "0022100996", "chunk_id": "0022100996_020", "order": 20, "role": "body", "text": "Collins is Atlanta’s second-leading scorer, entering Friday night averaging 16.4 points per game. He scored only two points and missing each of his nine shots from the field in Wednesday night’s 124-114 loss to Milwaukee, when he played only 19 minutes."}
{"game_id": "0022100996", "chunk_id": "0022100996_022", "order": 22, "role": "body", "text": "Jackson, who has emerged as the Clippers’ scoring leader with Paul George and Kawhi Leonard missing much of the season with injuries, had 24 points and five assists. He said he should have set up more shots for his teammates."}
{"game_id": "0022100996", "chunk_id": "0022100996_023", "order": 23, "role": "body", "text": "“I’ve got to get us some better shots ... especially coming down the stretch,” Jackson said."}
{"game_id": "0022100996", "chunk_id": "0022100996_025", "order": 25, "role": "body", "text": "Clippers: Amir Coffey, who started ahead of Terance Mann for the second straight game, had eight points. ... Robert Covington (personal) missed his third straight game."}
{"game_id": "0022100996", "chunk_id": "0022100996_026", "order": 26, "role": "body", "text": "Hawks: Young had 11 assists. He scored 11 points in the third period. ... Kevin Huerter had 16 points for Atlanta while making two of his four 3-pointers in the final six minutes. Clint Capela had 14 points and 11 rebounds."}
{"game_id": "0022100996", "chunk_id": "0022100996_028", "order": 28, "role": "body", "text": "Clippers: Continue three-game trip at Cleveland on Sunday."}
{"game_id": "0022100996", "chunk_id": "0022100996_029", "order": 29, "role": "body", "text": "Hawks: Face Indiana on Sunday in the second of three consecutive home games."}
