{"game_id": "0022100071", "chunk_id": "0022100071_001", "order": 1, "role": "lead", "text": "TORONTO -- — Scottie Barnes edged out fellow rookie Jalen Suggs in a showdown between top-five picks in Toronto."}
{"game_id": "0022100071", "chunk_id": "0022100071_002", "order": 2, "role": "body", "text": "Fred VanVleet scored 16 of his 19 points in the fourth quarter, Barnes had 21 points and the Raptors won back-to-back games for the first time this season, holding on to beat the Orlando Magic 110-109 on Friday night."}
{"game_id": "0022100071", "chunk_id": "0022100071_003", "order": 3, "role": "body", "text": "Gary Trent Jr. had 19 points and made a crucial defensive play on the final possession of the game. OG Anunoby scored 16, including 10 in the fourth, and Dalano Banton had 10 points as the Raptors evened their record at 3-3. Toronto beat Indiana on Wednesday."}
{"game_id": "0022100071", "chunk_id": "0022100071_004", "order": 4, "role": "body", "text": "Orlando’s Cole Anthony shot 5 for 6 from 3-point range and scored 24 points. Suggs had 21."}
{"game_id": "0022100071", "chunk_id": "0022100071_005", "order": 5, "role": "body", "text": "Toronto passed on Suggs to choose Barnes with the fourth pick in last summer’s draft. Suggs went to Orlando with the fifth pick."}
{"game_id": "0022100071", "chunk_id": "0022100071_006", "order": 6, "role": "body", "text": "“Any time you go up against someone who was picked ahead of you, you know they were picked ahead of you,” Anthony said. “You’re not a competitor if you don’t think about stuff like that.”"}
{"game_id": "0022100071", "chunk_id": "0022100071_007", "order": 7, "role": "body", "text": "On Friday, Barnes came out just ahead of Suggs as Orlando lost its third straight."}
{"game_id": "0022100071", "chunk_id": "0022100071_008", "order": 8, "role": "body", "text": "“We both did pretty well, I would say,” Barnes said. “Of course it’s a competition every time we play against each other. I would say it was fun.”"}
{"game_id": "0022100071", "chunk_id": "0022100071_009", "order": 9, "role": "body", "text": "Barnes and Suggs have been friends for several years and won two gold medals together with the U.S. at the FIBA Under-17 and Under-19 World Cups in 2018 and 2019. The two embraced, posed for pictures, and chatted briefly after the final buzzer."}
{"game_id": "0022100071", "chunk_id": "0022100071_010", "order": 10, "role": "body", "text": "Wendell Carter Jr. had 17 points and 12 rebounds. Mo Bamba added 14 points and 18 rebounds, but Orlando lost its ninth straight meeting with the Raptors."}
{"game_id": "0022100071", "chunk_id": "0022100071_011", "order": 11, "role": "body", "text": "Suggs made a pair of free throws to begin the fourth quarter, putting Orlando up 80-77, but Anunoby scored eight points as Toronto answered with a 13-0 run over the next three minutes to lead 90-80 with 8:37 to play."}
{"game_id": "0022100071", "chunk_id": "0022100071_012", "order": 12, "role": "body", "text": "Raptors fans chanted “Scottie’s better! Scottie’s better!” with Toronto leading in the final two minutes, but Suggs nearly showed otherwise, completing a four-point play with 52 seconds left to cut the gap to 100-106. After Suggs blocked Anunoby at the other end, Franz Wagner’s 3 made it a one-point game with 33 seconds left."}
{"game_id": "0022100071", "chunk_id": "0022100071_013", "order": 13, "role": "body", "text": "Anunoby missed from 3, and Orlando called timeout with 5.8 seconds left. On the ensuing inbounds play, Trent knocked the ball away from Anthony, whose halfcourt shot at the buzzer fell short."}
{"game_id": "0022100071", "chunk_id": "0022100071_014", "order": 14, "role": "body", "text": "“He got a hand on the ball and just killed some clock time,” Magic coach Jahmal Mosley said of Trent’s defensive play."}
{"game_id": "0022100071", "chunk_id": "0022100071_015", "order": 15, "role": "body", "text": "VanVleet connected on six of seven attempts in the fourth, including two of three from long range."}
{"game_id": "0022100071", "chunk_id": "0022100071_016", "order": 16, "role": "body", "text": "“He made a lot of tough shots,” Barnes said. “He organized our offense very well.”"}
{"game_id": "0022100071", "chunk_id": "0022100071_017", "order": 17, "role": "body", "text": "After leading all scorers with nine points in the first, Barnes added 10 more in the second, two of them on an impressive full-court drive and one-handed slam."}
{"game_id": "0022100071", "chunk_id": "0022100071_018", "order": 18, "role": "body", "text": "“You see the things he does on the floor and it’s incredible,” Trent said. “He’s dunking in transition, he’s finding guys, he’s playing defense. He’s doing everything for us and helping us get wins.”"}
{"game_id": "0022100071", "chunk_id": "0022100071_019", "order": 19, "role": "body", "text": "Barnes shot 4 for 4 in the quarter, leaving late in the half to receive treatment after he was poked in the eye. He returned to start the second half."}
{"game_id": "0022100071", "chunk_id": "0022100071_020", "order": 20, "role": "body", "text": "Carter scored 11 points in the second but Toronto led 54-51 at halftime."}
{"game_id": "0022100071", "chunk_id": "0022100071_021", "order": 21, "role": "body", "text": "Barnes didn’t score in the third but Suggs had seven points for the Magic, who took a narrow 78-77 lead to the fourth."}
{"game_id": "0022100071", "chunk_id": "0022100071_023", "order": 23, "role": "body", "text": "Magic: Orlando didn’t attempt any free throws in the first quarter. … Bamba and Anthony each had five assists. … Wagner scored 10 points as all five Magic starters reached double figures."}
{"game_id": "0022100071", "chunk_id": "0022100071_024", "order": 24, "role": "body", "text": "Raptors: Barnes had nine rebounds. … The Raptors scored 22 points off 17 Orlando turnovers. … F Yuta Watanabe (left calf) had a setback after practicing with Toronto’s G League team this week and was held out of practice Friday, coach Nick Nurse said."}
{"game_id": "0022100071", "chunk_id": "0022100071_026", "order": 26, "role": "body", "text": "Barnes is the second rookie in Raptors history to score at least 100 points through his first six games. The first was Damon Stoudamire, the 1995-96 NBA Rookie of the Year."}
{"game_id": "0022100071", "chunk_id": "0022100071_028", "order": 28, "role": "body", "text": "Magic: Visit Detroit on Saturday night."}
{"game_id": "0022100071", "chunk_id": "0022100071_029", "order": 29, "role": "body", "text": "Raptors: Visit Indiana on Saturday night."}
