{"game_id": "0022101201", "chunk_id": "0022101201_001", "order": 1, "role": "lead", "text": "DENVER -- — Nikola Jokic made history on the night his Denver Nuggets clinched a fourth consecutive playoff berth with a 122-109 victory over the Memphis Grizzlies."}
{"game_id": "0022101201", "chunk_id": "0022101201_002", "order": 2, "role": "body", "text": "Jokic became the first player in NBA history with 2,000 points, 1,000 rebounds and 500 assists in a season."}
{"game_id": "0022101201", "chunk_id": "0022101201_003", "order": 3, "role": "body", "text": "He had 35 points, 16 rebounds, six assists and five steals Thursday night."}
{"game_id": "0022101201", "chunk_id": "0022101201_004", "order": 4, "role": "body", "text": "“Dude is really great at basketball,” teammate Bones Hyland said."}
{"game_id": "0022101201", "chunk_id": "0022101201_005", "order": 5, "role": "body", "text": "Jokic's big night came after taking an inadvertent elbow from Jaren Jackson Jr. to the right forehead and temple that drew blood in the opening minute."}
{"game_id": "0022101201", "chunk_id": "0022101201_006", "order": 6, "role": "body", "text": "After having to retreat to the bench twice to stop the bleeding, Jokic donned a red headband for the remainder of the game as he helped the Nuggets (48-33) overcome a shaky start to avoid a season sweep at the hands of the Grizzlies."}
{"game_id": "0022101201", "chunk_id": "0022101201_007", "order": 7, "role": "body", "text": "“The MVP isn't even a competition,” Nuggets coach Michael Malone declared afterward. “There's other great players. I'm not saying they're not great players. But what Nikola Jokic has done this year — with this team — everything we've had to go through, is just incredible."}
{"game_id": "0022101201", "chunk_id": "0022101201_008", "order": 8, "role": "body", "text": "“He was good last year and he's even better this year.”"}
{"game_id": "0022101201", "chunk_id": "0022101201_009", "order": 9, "role": "body", "text": "Despite missing stars Jamal Murray and Kevin Porter Jr., the Nuggets clinched a top-six spot in the Western Conference playoffs and avoided the four-team play-in thanks to another outstanding performance from the reigning MVP."}
{"game_id": "0022101201", "chunk_id": "0022101201_010", "order": 10, "role": "body", "text": "They can still win the Northwest Division with a victory Sunday night against the Lakers and two losses by the Utah Jazz (48-32), who finish up against Phoenix and Portland."}
{"game_id": "0022101201", "chunk_id": "0022101201_011", "order": 11, "role": "body", "text": "Aaron Gordon added 22 points for Denver and Desmond Bane had 14 points for the Grizzlies, who were coming off an overtime loss at Utah on Wednesday night, have already captured the first division title in their history along with securing the second seed in the West."}
{"game_id": "0022101201", "chunk_id": "0022101201_012", "order": 12, "role": "body", "text": "“I think we’ve been playing good basketball, even the other night against Utah. Tonight, we just didn’t have it,” Grizzlies coach Taylor Jenkins said."}
{"game_id": "0022101201", "chunk_id": "0022101201_014", "order": 14, "role": "body", "text": "“We threw a lot at him,” Jenkins said. “He’s the MVP for a reason. He’s nearly impossible to guard. He’s going to beat you from inside, outside, playmaking. He played at a really high level tonight.”"}
{"game_id": "0022101201", "chunk_id": "0022101201_015", "order": 15, "role": "body", "text": "The Grizzlies are hopeful of getting All-Star guard Ja Morant back this weekend from a right knee injury that has sidelined him since March 18."}
{"game_id": "0022101201", "chunk_id": "0022101201_016", "order": 16, "role": "body", "text": "Jokic was hit in the head on the Grizzlies' first bucket, a drive by Jaren Jackson Jr., and retreated to the bench for treatment. He wasn't back on the court for long before returning to the sideline for more treatment and a red headband."}
{"game_id": "0022101201", "chunk_id": "0022101201_017", "order": 17, "role": "body", "text": "“My first thought was Steve Nash in that playoff series and they couldn't stop the bleeding,” Malone said. \"And I'm saying, ‘Of all games, Nikola gets a very non-malicious elbow, an inadvertent elbow to the head and he's bleeding.'"}
{"game_id": "0022101201", "chunk_id": "0022101201_019", "order": 19, "role": "body", "text": "Malone said he implored his trainers to do whatever they could to staunch the flow of blood."}
{"game_id": "0022101201", "chunk_id": "0022101201_020", "order": 20, "role": "body", "text": "“Like, get a staple gun out here,\" Malone said. \"And it finally stopped and Nikola put on another MVP performance.\""}
{"game_id": "0022101201", "chunk_id": "0022101201_022", "order": 22, "role": "body", "text": "Jokic said he's not going to keep wearing the headband, however. He'll leave that look to LeBron James."}
{"game_id": "0022101201", "chunk_id": "0022101201_023", "order": 23, "role": "body", "text": "“No, I look great,” Jokic said. “I cannot let you guys see me twice like that.\""}
{"game_id": "0022101201", "chunk_id": "0022101201_024", "order": 24, "role": "body", "text": "Jokic agreed he's had a better season than last year but he said there's 20 superstars in this league and he's not himself lobbying for another MVP award."}
{"game_id": "0022101201", "chunk_id": "0022101201_025", "order": 25, "role": "body", "text": "“If that's enough, it's enough,\" he said. \"It not, you cannot control that.”"}
{"game_id": "0022101201", "chunk_id": "0022101201_026", "order": 26, "role": "body", "text": "Jokic got a game ball from the Nuggets as a keepsake of his historic night but he joked the trainers would probably sell his blood-soaked headband on eBay."}
{"game_id": "0022101201", "chunk_id": "0022101201_028", "order": 28, "role": "body", "text": "Grizzlies: Memphis remains one win shy of tying the franchise record for wins in a single season (56-26 in 2012-13). ... Despite back-to-back losses to Utah and Denver, the Grizzlies finished 26-15 away from home, the NBA's second-best road record."}
{"game_id": "0022101201", "chunk_id": "0022101201_029", "order": 29, "role": "body", "text": "Nuggets: Murray missed his 81st game, but the Nuggets still haven't ruled out a return either Sunday in the regular season finale or in the playoffs. Murray tore his left ACL last April 12."}
{"game_id": "0022101201", "chunk_id": "0022101201_031", "order": 31, "role": "body", "text": "Morant is averaging 27.6 points. His return could make Memphis the darlings of the NBA playoffs."}
{"game_id": "0022101201", "chunk_id": "0022101201_032", "order": 32, "role": "body", "text": "Jenkins said they would like to have at least one game with their full contingent before the postseason. But health matters more."}
{"game_id": "0022101201", "chunk_id": "0022101201_033", "order": 33, "role": "body", "text": "“If that’s not what’s the recommendation of the medical team, we don’t feel like that’s the smartest move, then we won’t do it,” Jenkins said."}
{"game_id": "0022101201", "chunk_id": "0022101201_035", "order": 35, "role": "body", "text": "Among the VIPs at courtside was Broncos new QB Russell Wilson and his wife, R&B singer-songwriter Ciara."}
{"game_id": "0022101201", "chunk_id": "0022101201_036", "order": 36, "role": "body", "text": "“So, that was an added bonus,” Malone said of seeing Ciara, who's also a model and dancer."}
{"game_id": "0022101201", "chunk_id": "0022101201_037", "order": 37, "role": "body", "text": "He didn't introduce himself to Ciara, “but I talked to the guy she was with, but I didn't get his name,” cracked Malone."}
{"game_id": "0022101201", "chunk_id": "0022101201_038", "order": 38, "role": "body", "text": "Wilson, who tossed an autographed football about 40 yards into the stands in the first half, also is set to throw out the first pitch at the Colorado Rockies' home opener Friday against the Los Angeles Dodgers."}
{"game_id": "0022101201", "chunk_id": "0022101201_040", "order": 40, "role": "body", "text": "Grizzlies: Return home to face New Orleans on Saturday."}
{"game_id": "0022101201", "chunk_id": "0022101201_041", "order": 41, "role": "body", "text": "Nuggets: Wrap up the regular season at home Sunday night against the Lakers, who are sitting out these playoffs."}
