{"game_id": "0022101058", "chunk_id": "0022101058_001", "order": 1, "role": "lead", "text": "MINNEAPOLIS -- — With Patrick Beverley taking the lead in his first season with the team, the Minnesota Timberwolves are trying to prove they’re no longer a pushover."}
{"game_id": "0022101058", "chunk_id": "0022101058_002", "order": 2, "role": "body", "text": "Keeping their composure after a first-quarter skirmish in which Beverley was ejected, the Timberwolves showed their growth with a dominating win against the defending champions."}
{"game_id": "0022101058", "chunk_id": "0022101058_003", "order": 3, "role": "body", "text": "Karl-Anthony Towns had 25 points and 11 rebounds, Anthony Edwards scored 25 points and Minnesota pulled away for a 138-119 victory Saturday over the Milwaukee Bucks, who were playing without star Giannis Antetokounmpo due to right knee soreness."}
{"game_id": "0022101058", "chunk_id": "0022101058_004", "order": 4, "role": "body", "text": "“Any time we step on the court, we should win,” Towns said. “Simple as that. There’s no excuse. We don’t feel that we should lose to anybody. We feel we can beat anybody. So, every time we walk into the arena, we feel we should win. If we do what we’re supposed to do, we feel it’s a guaranteed win.”"}
{"game_id": "0022101058", "chunk_id": "0022101058_005", "order": 5, "role": "body", "text": "Naz Reid added 14 points off the bench for Minnesota in a matchup that turned testy early."}
{"game_id": "0022101058", "chunk_id": "0022101058_006", "order": 6, "role": "body", "text": "Beverley and Milwaukee’s George Hill were both ejected late in the first quarter after a scuffle started when Bucks center Serge Ibaka and Timberwolves forward Taurean Prince got tied up after a free-throw attempt."}
{"game_id": "0022101058", "chunk_id": "0022101058_007", "order": 7, "role": "body", "text": "Beverley ran in and pushed Ibaka and Hill countered by pushing Beverley."}
{"game_id": "0022101058", "chunk_id": "0022101058_008", "order": 8, "role": "body", "text": "“I thought they were great,” Minnesota coach Chris Finch said of his team’s response. “Didn’t really escalate into anything. We didn’t lose our concentration or our effort.”"}
{"game_id": "0022101058", "chunk_id": "0022101058_009", "order": 9, "role": "body", "text": "Minnesota won for the 10th time in 11 games by taking control in the third quarter with a flurry of 3-pointers. The Timberwolves shot 22 of 47 from 3, including 9 of 14 in the third."}
{"game_id": "0022101058", "chunk_id": "0022101058_010", "order": 10, "role": "body", "text": "“They’re good,” Milwaukee coach Mike Budenholzer said. “They’ve got a good thing going right now. They’re in a good rhythm. But the turnovers were a big part of them, kind of allowing them to get separation from us.”"}
{"game_id": "0022101058", "chunk_id": "0022101058_011", "order": 11, "role": "body", "text": "The Bucks had 14 turnovers, leading to 21 points for Minnesota."}
{"game_id": "0022101058", "chunk_id": "0022101058_012", "order": 12, "role": "body", "text": "Khris Middleton scored 15 for Milwaukee, which had won eight of nine, and Jrue Holiday added 14 points."}
{"game_id": "0022101058", "chunk_id": "0022101058_013", "order": 13, "role": "body", "text": "Brook Lopez scored 15 in his third game back after recovering from back surgery and started in place of Antetokounmpo, who was ruled out as the team manages the strain on his knees."}
{"game_id": "0022101058", "chunk_id": "0022101058_014", "order": 14, "role": "body", "text": "Edwards had 12 points in the first quarter to get the Wolves off to a strong start before tension emerged."}
{"game_id": "0022101058", "chunk_id": "0022101058_015", "order": 15, "role": "body", "text": "After Beverley and Hill were ejected, Milwaukee’s Bobby Portis Jr. and Reid were given matching technical fouls. The Timberwolves weren’t afraid to share their newfound confidence, but the defending champion Bucks weren’t taking it."}
{"game_id": "0022101058", "chunk_id": "0022101058_016", "order": 16, "role": "body", "text": "The feistiness was toned down in the second half as Minnesota made any talking a moot point."}
{"game_id": "0022101058", "chunk_id": "0022101058_017", "order": 17, "role": "body", "text": "Edwards hit three 3s in the third and Towns scored eight in the quarter with a pair of 3s as the Wolves scored 38 in the quarter and led by as many as 24."}
{"game_id": "0022101058", "chunk_id": "0022101058_018", "order": 18, "role": "body", "text": "“We can’t control who they play or who is out or whatever, but I thought it was a really focused and really great performance by us, for the most part,” Finch said. “We played with good energy, got out and ran, really moved the ball well early, which we’ve been struggling to do early in games. Generated a lot of really good looks.”"}
{"game_id": "0022101058", "chunk_id": "0022101058_020", "order": 20, "role": "body", "text": "Beverley has injected some swagger to a Minnesota team that has made the playoffs once in 17 years."}
{"game_id": "0022101058", "chunk_id": "0022101058_021", "order": 21, "role": "body", "text": "The Timberwolves also have gained confidence with a March run that included a 124-104 win over the Los Angeles Lakers that had Minnesota — with Beverley playing his usual abrasive role — eagerly trash talking LeBron James, Russell Westbrook and the Lakers."}
{"game_id": "0022101058", "chunk_id": "0022101058_022", "order": 22, "role": "body", "text": "“The way Pat brought the grit and hunger to this team and the swag, I think it’s remarkable,” Reid said."}
{"game_id": "0022101058", "chunk_id": "0022101058_024", "order": 24, "role": "body", "text": "Bucks: G Pat Connaughton returned for his first game since breaking a bone in his right hand on Feb. 10. He had 15 points off the bench."}
{"game_id": "0022101058", "chunk_id": "0022101058_025", "order": 25, "role": "body", "text": "Timberwolves: Towns was questionable for the game with a right forearm contusion. There were several moments where the injury appeared to bother the All-Star big man. … F Jaden McDaniels missed his second game with a left ankle sprain. Reid was back after missing two games with back spasms."}
{"game_id": "0022101058", "chunk_id": "0022101058_027", "order": 27, "role": "body", "text": "Bucks: Return home against Chicago on Tuesday."}
{"game_id": "0022101058", "chunk_id": "0022101058_028", "order": 28, "role": "body", "text": "Timberwolves: At Dallas on Monday."}
