{"game_id": "0022100753", "chunk_id": "0022100753_001", "order": 1, "role": "lead", "text": "CHICAGO -- — Nikola Vucevic had 24 points and 14 rebounds, DeMar DeRozan added 23 points and 10 assists and the Chicago Bulls overcame a slow to start to beat the Portland Trail Blazers 130-116 on Sunday."}
{"game_id": "0022100753", "chunk_id": "0022100753_002", "order": 2, "role": "body", "text": "Zach LaVine had 20 points, Coby White added 18 and Ayo Dosunmu finished with 11 assists. Chicago has won three of four to improve to 31-18."}
{"game_id": "0022100753", "chunk_id": "0022100753_003", "order": 3, "role": "body", "text": "C.J. McCollum had 29 points for Portland. Norman Powell added 22, and Anfernee Simons had 21."}
{"game_id": "0022100753", "chunk_id": "0022100753_004", "order": 4, "role": "body", "text": "The Trail Blazers made seven of their first nine 3-point attempts for a 35-29 lead after the first quarter before the Bulls picked up the effort defensively."}
{"game_id": "0022100753", "chunk_id": "0022100753_005", "order": 5, "role": "body", "text": "“In the past, with some of the games that we lost, we understand that it was because our defense wasn’t good enough,\" Vucevic said. \"Even tonight, to start the game they really got going. Once we were able to get stops, we were able to build a little bit of a lead."}
{"game_id": "0022100753", "chunk_id": "0022100753_006", "order": 6, "role": "body", "text": "“If we really want to be a really good team and have a deep push at the end of the year, our defense has to be there. We’ve shown we can do it. It’s just a matter of doing it every night for 48 minutes.”"}
{"game_id": "0022100753", "chunk_id": "0022100753_007", "order": 7, "role": "body", "text": "Chicago had it clicking on the offensive end throughout, going 50 for 90 from the field."}
{"game_id": "0022100753", "chunk_id": "0022100753_008", "order": 8, "role": "body", "text": "“We let them get comfortable, and when you let a team get comfortable, particularly at home, man it’s tough to walk ’em back,\" Portland coach Chauncey Billups said. \"They had 21 assists at halftime. That’s not just one guy going crazy. That’s everybody getting comfortable. They were moving the basketball, everybody was making shots, and we were never able to get them under control.”"}
{"game_id": "0022100753", "chunk_id": "0022100753_009", "order": 9, "role": "body", "text": "Portland led for much of the first half before Chicago took control late. Trailing 51-50 with just under six minutes left in the second quarter, the Bulls had a 20-8 run to take a 70-59 lead. They led 73-65 at halftime, and took a 104-92 advantage into the fourth."}
{"game_id": "0022100753", "chunk_id": "0022100753_010", "order": 10, "role": "body", "text": "The Trail Blazers managed to stay within striking distance with torrid 3-point shooting. They were 17 for 33 from behind the arc through three quarters."}
{"game_id": "0022100753", "chunk_id": "0022100753_011", "order": 11, "role": "body", "text": "Chicago scored 20 points in the first 6 1/2 minutes of the final quarter."}
{"game_id": "0022100753", "chunk_id": "0022100753_012", "order": 12, "role": "body", "text": "With Vucevic and LaVine resting, Matt Thomas came off the bench to score seven points in the first four minutes of the fourth."}
{"game_id": "0022100753", "chunk_id": "0022100753_014", "order": 14, "role": "body", "text": "Vucevic has 26 double-doubles this season. “I take a lot of pride in consistency,\" he said. \"It’s something I’ve done my whole career. I do take a lot of pride in that, especially the rebounding part, which is something I can control every night no matter what’s going on.”"}
{"game_id": "0022100753", "chunk_id": "0022100753_016", "order": 16, "role": "body", "text": "Trail Blazers: F Larry Nance Jr. was erroneously announced as a starter during the pregame introductions, but the team is hopeful he'll return soon after sitting out since Jan. 6 with right knee inflammation. “I don't know when,” Billups said. “He's just progressing every day. He is getting better.”"}
{"game_id": "0022100753", "chunk_id": "0022100753_017", "order": 17, "role": "body", "text": "Bulls: LaVine had struggled with his perimeter shot before Sunday since returning from a left knee injury last week. In the previous three games, he was a combined 6 for 25 on 3-pointers. However, he still managed to score at least 23 points in each game. LaVine was 3 for 9 on 3-pointers Sunday."}
{"game_id": "0022100753", "chunk_id": "0022100753_019", "order": 19, "role": "body", "text": "Trail Blazers: At Oklahoma on Monday night."}
{"game_id": "0022100753", "chunk_id": "0022100753_020", "order": 20, "role": "body", "text": "Bulls: Host Orlando on Tuesday night."}
