{"game_id": "0022100796", "chunk_id": "0022100796_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Ja Morant scored 33 points in three quarters and the Memphis Grizzlies led by as many as 31 points in a 135-115 win over the Orlando Magic on Saturday."}
{"game_id": "0022100796", "chunk_id": "0022100796_002", "order": 2, "role": "body", "text": "Morant scored 22 points in the first half as Memphis won its second straight and for the fifth time in six games. The Grizzlies went on a 14-0 run in the first quarter and led 76-56 at the half."}
{"game_id": "0022100796", "chunk_id": "0022100796_003", "order": 3, "role": "body", "text": "“It was just me taking what the defense was giving me when they tried to shift to me and pack the paint,” said Morant, who got teammates involved with the pass in the first quarter and then went into attack mode before halftime. “I’ve got too much shooters for that. I was just playing cat and mouse with the defense, pretty much.”"}
{"game_id": "0022100796", "chunk_id": "0022100796_004", "order": 4, "role": "body", "text": "Jaren Jackson Jr. scored 21 points for Memphis and Steve Adams added 12 points, 11 rebounds and a season-best eight assists. The Grizzlies shot 50.5% (53 for 105) and held a 68-34 advantage in points in the paint. The Grizzlies won on the road for the 16th time in 20 games."}
{"game_id": "0022100796", "chunk_id": "0022100796_005", "order": 5, "role": "body", "text": "“I thought Ja was phenomenal tonight,” Memphis coach Taylor Jenkins said. “He did a great job against a team that was in an early shift and wanting to take away the paint, and he did a great job getting the ball out early to his teammates. He always gives the defense a different look. Is he in attack mode, is he in score mode, or playmaking mode? Then, when he reads the game, he knows when to take over.”"}
{"game_id": "0022100796", "chunk_id": "0022100796_006", "order": 6, "role": "body", "text": "Cole Anthony scored 17 of his 22 points in the first half for Orlando, which had its two-game home win streak halted. Wendell Carter had 12 points and 10 rebounds for his 22nd double-double. Rookies Jalen Suggs and Franz Wagner scored 16 and 15 points, respectively."}
{"game_id": "0022100796", "chunk_id": "0022100796_007", "order": 7, "role": "body", "text": "“We did not do a good job (keeping Morant out of the paint), he was very comfortable and he got to all the spots he needed to be,” Magic coach Jamahl Mosley said. “Us being physical, finding heat and getting into the basketball, we’ll have to do a much better job of that moving forward.”"}
{"game_id": "0022100796", "chunk_id": "0022100796_008", "order": 8, "role": "body", "text": "Morant finished with seven assists, and his most spectacular pass of the game came in the third quarter when he passed behind his back to Zaire Williams, who fed a lob pass to De’Anthony Melton for a dunk. The play put Memphis ahead by 31 points and sent Morant jumping into the arms of his teammates."}
{"game_id": "0022100796", "chunk_id": "0022100796_009", "order": 9, "role": "body", "text": "“Killing their spirits, we try to do that with every team we play by going out and sending a message,” Morant said. “We keep our foot on the gas, we have a little fun and then we’re going to let you hear about it.”"}
{"game_id": "0022100796", "chunk_id": "0022100796_010", "order": 10, "role": "body", "text": "Morant made 14 of 21 shots, had 12 baskets in the paint and converted 10 buckets at the rim."}
{"game_id": "0022100796", "chunk_id": "0022100796_011", "order": 11, "role": "body", "text": "“We expect the unexpected with that guy,” Melton said of Morant. Melton added 16 points and 10 rebounds."}
{"game_id": "0022100796", "chunk_id": "0022100796_012", "order": 12, "role": "body", "text": "Memphis led by as many as 25 points in the early going and Morant scored or assisted on 22 of the Grizzlies’ 37 points. He had 22 points by halftime on 10-for-14 shooting, with eight baskets coming in the paint."}
{"game_id": "0022100796", "chunk_id": "0022100796_014", "order": 14, "role": "body", "text": "Grizzlies: Morant played despite being listed as questionable because of a sore right foot. Jenkins said Morant responded well to treatment on Saturday morning. … Saturday’s game was Jenkins’ 200th as head coach of the Grizzlies. He is 109-91 in 200 games."}
{"game_id": "0022100796", "chunk_id": "0022100796_015", "order": 15, "role": "body", "text": "Magic: Former No. 1 pick Markelle Fultz continues to practice with the Magic and went through another vigorous on-court workout prior to Saturday’s game. Mosley continues to insist there’s no timetable for the return of the guard who tore the ACL in his left knee on Jan. 6, 2021. “Those workouts are great to see and I’m enjoying watching them, but again we’re going to always be safe, and his health is the most important thing. It’s just about how many practices we can get him into and how he responds to the rehab.” ... The game featured a special 5 p.m. start to accommodate a prime-time television window in western Europe."}
{"game_id": "0022100796", "chunk_id": "0022100796_017", "order": 17, "role": "body", "text": "Grizzlies: Host the Los Angeles Clippers on Tuesday."}
{"game_id": "0022100796", "chunk_id": "0022100796_018", "order": 18, "role": "body", "text": "Magic: Host Boston on Sunday night."}
