{"game_id": "0022100399", "chunk_id": "0022100399_001", "order": 1, "role": "lead", "text": "DETROIT -- — Kevin Durant scored an NBA season-high 51 points in the Brooklyn Nets' 116-104 victory over the Detroit Pistons on Sunday."}
{"game_id": "0022100399", "chunk_id": "0022100399_002", "order": 2, "role": "body", "text": "With James Harden resting, Durant scored at least 10 points in all four quarters."}
{"game_id": "0022100399", "chunk_id": "0022100399_003", "order": 3, "role": "body", "text": "“I knew I probably needed to pick up a little more of the scoring tonight,” said Durant, who had his seventh 50-point game of his career. “We were turning the ball over more than we should, and I was doing as much of that as anyone, so I figured I better just keep shooting.”"}
{"game_id": "0022100399", "chunk_id": "0022100399_004", "order": 4, "role": "body", "text": "Patty Mills added 18 points for the Nets, who outscored Detroit 30-13 in the fourth quarter."}
{"game_id": "0022100399", "chunk_id": "0022100399_005", "order": 5, "role": "body", "text": "“It was fun just to watch K.D. when he’s playing like that,” Mills said. “Being a part of it is even better. You don’t see many games like he had tonight.”"}
{"game_id": "0022100399", "chunk_id": "0022100399_006", "order": 6, "role": "body", "text": "Cade Cunningham had 26 and Frank Jackson added 25 for Detroit, which lost its 12th straight. The Pistons' last win was Nov. 17 against the Pacers, and they still haven’t won back-to-back games this season."}
{"game_id": "0022100399", "chunk_id": "0022100399_007", "order": 7, "role": "body", "text": "“We didn't get this win, but we are moving in the right direction,” Jackson said. “I know it doesn't look like that, given all the losses, but we're working hard and getting better.”"}
{"game_id": "0022100399", "chunk_id": "0022100399_008", "order": 8, "role": "body", "text": "Detroit also was missing leading scorer Jeremi Grant, who is sidelined indefinitely by a thumb injury."}
{"game_id": "0022100399", "chunk_id": "0022100399_009", "order": 9, "role": "body", "text": "“We have to play with the guys we have,” Pistons coach Dwane Casey said. “We can't think about ‘What if Jeremi could play?' We gave ourselves a chance to win the game, but we have to finish one of these out.”"}
{"game_id": "0022100399", "chunk_id": "0022100399_010", "order": 10, "role": "body", "text": "Hours after Durant was fined $25,000 for using multiple expletives at a fan who yelled “Durant, stop crying,” on Friday during a game in Atlanta, he also bested Stephen Curry’s 50-point total for the league high this season, which Curry did Nov. 8 against Atlanta."}
{"game_id": "0022100399", "chunk_id": "0022100399_011", "order": 11, "role": "body", "text": "The Pistons led 91-86 after three quarters despite 38 points from Durant, who scored seven in the Nets' 11-0 run to start the fourth. He picked up his fifth foul with 8:46 to play, but stayed on the floor as the Nets expanded the lead to 105-92 midway through the quarter."}
{"game_id": "0022100399", "chunk_id": "0022100399_012", "order": 12, "role": "body", "text": "“I saw the look in his eyes and knew he didn't want to come out,” Nets coach Steve Nash said. “He was just incredible tonight. Not only does he score 51, but he had (nine) assists and (seven) rebounds. He even had a couple blocks and played incredible defense in the fourth quarter.”"}
{"game_id": "0022100399", "chunk_id": "0022100399_013", "order": 13, "role": "body", "text": "The Nets led 60-57 at the half behind Durant's 22 points. Detroit outshot Brooklyn 47.8% to 38.5% in the first half, but struggled with turnovers and on the glass."}
{"game_id": "0022100399", "chunk_id": "0022100399_014", "order": 14, "role": "body", "text": "Durant also set the record on Sunday for points scored at the Little Caesars Arena, which opened in 2017. He bested Blake Griffin's 50 in 2018, Kyrie Irving's 45 in 2020 and James Harden's 44 last season. Irving and Harden also had their games for the Nets, while Griffin now plays for them."}
{"game_id": "0022100399", "chunk_id": "0022100399_015", "order": 15, "role": "body", "text": "“I got Blake's record? That's great,” Durant said with a laugh. “I didn't know he got 50 here, but this is a new building, so I'm sure that will get broken pretty quickly.”"}
{"game_id": "0022100399", "chunk_id": "0022100399_017", "order": 17, "role": "body", "text": "Nets: Griffin only scored one point and was booed by Pistons fans every time he touched the ball. ... Durant came into the game averaging 25.2 points in 23 career games against Detroit — his second-worst against any team. He had only reached 40 against the Pistons once, scoring 42 with the Oklahoma City Thunder on April 16, 2014."}
{"game_id": "0022100399", "chunk_id": "0022100399_018", "order": 18, "role": "body", "text": "Pistons: Detroit honored Hall of Famer Dave Bing for his selection to the NBA's 75th-anniversary team. Bing, who played his first nine seasons for the Pistons, later served as Detroit's mayor. ... The 12-game losing streak is Detroit's longest since a 13-game stretch from Nov. 15-Dec. 9, 2014."}
{"game_id": "0022100399", "chunk_id": "0022100399_020", "order": 20, "role": "body", "text": "Nets: Host the Toronto Raptors on Tuesday."}
{"game_id": "0022100399", "chunk_id": "0022100399_021", "order": 21, "role": "body", "text": "Pistons: Visit the Chicago Bulls on Tuesday."}
