{"game_id": "0022100906", "chunk_id": "0022100906_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young knows what the Atlanta Hawks need from him to improve their playoff position, so it was time for a bounce-back game."}
{"game_id": "0022100906", "chunk_id": "0022100906_002", "order": 2, "role": "body", "text": "Young returned to his All-Star form by scoring 41 points and the Hawks rode a dominant third quarter to a 127-100 victory over the Toronto Raptors on Saturday night."}
{"game_id": "0022100906", "chunk_id": "0022100906_003", "order": 3, "role": "body", "text": "Young was 17 of 24 from the field, 6 of 6 from the line and had 11 assists. He shot only 3 of 17 in Atlanta's 112-108 loss at Chicago on Thursday night, his first game after starting in the All-Star Game."}
{"game_id": "0022100906", "chunk_id": "0022100906_004", "order": 4, "role": "body", "text": "“I knew I had to be better for my team and I try to do that each and every game,” Young said."}
{"game_id": "0022100906", "chunk_id": "0022100906_005", "order": 5, "role": "body", "text": "“I wanted to bounce back and felt I did.”"}
{"game_id": "0022100906", "chunk_id": "0022100906_006", "order": 6, "role": "body", "text": "Entering the game, the Hawks were 10th and the Raptors were seventh in the Eastern Conference playoff standings."}
{"game_id": "0022100906", "chunk_id": "0022100906_007", "order": 7, "role": "body", "text": "Young rebounded by making his first four shots in his fifth game of the season scoring more than 40 points. He set a career high with 56 points at Portland on Jan. 3."}
{"game_id": "0022100906", "chunk_id": "0022100906_008", "order": 8, "role": "body", "text": "It was the 23-year-old Young's 22nd career game with at least 40 points, tying Tracy McGrady for sixth-most in NBA history for a player under the age of 24."}
{"game_id": "0022100906", "chunk_id": "0022100906_009", "order": 9, "role": "body", "text": "Young posted his 10th career game with at least 40 points and 10 assists, passing Michael Jordan for ninth-most all-time."}
{"game_id": "0022100906", "chunk_id": "0022100906_010", "order": 10, "role": "body", "text": "“I never imagined that,” Young said before adding “if we don’t win none of this stuff matters, especially to me.”"}
{"game_id": "0022100906", "chunk_id": "0022100906_011", "order": 11, "role": "body", "text": "Fred VanVleet led Toronto with 24 points and nine assists after being listed as questionable with right knee soreness. Precious Achiuwa added a season-high 21 points."}
{"game_id": "0022100906", "chunk_id": "0022100906_012", "order": 12, "role": "body", "text": "Onyeka Okongwu matched his season high with 17 points for Atlanta, which pulled away by outscoring Toronto 38-16 in the decisive third period."}
{"game_id": "0022100906", "chunk_id": "0022100906_013", "order": 13, "role": "body", "text": "The teams traded dramatic runs in the first half."}
{"game_id": "0022100906", "chunk_id": "0022100906_014", "order": 14, "role": "body", "text": "The Raptors enjoyed the first hot streak, scoring 13 unanswered points for a 27-22 lead. Achiuwa started the run with a 3-pointer and capped the streak with a jam."}
{"game_id": "0022100906", "chunk_id": "0022100906_015", "order": 15, "role": "body", "text": "Toronto stretched the advantage to 45-33 early in the second period before the Hawks took command with an 18-0 run to lead 51-45."}
{"game_id": "0022100906", "chunk_id": "0022100906_016", "order": 16, "role": "body", "text": "After leading 66-58 at halftime, the Hawks pulled away with another long run, scoring 16 straight points early in the third period for an 89-62 lead."}
{"game_id": "0022100906", "chunk_id": "0022100906_017", "order": 17, "role": "body", "text": "The Raptors faced an ugly deficit for the second consecutive night. After trailing by 41 points in Friday night's 125-94 loss at Charlotte, the Raptors trailed by 32 points, at 102-70, late in the third period against the Hawks."}
{"game_id": "0022100906", "chunk_id": "0022100906_018", "order": 18, "role": "body", "text": "“We revved our motor pretty hard in the second and you shut down at the halftime break and we didn’t seem able to rev it back up,” said Raptors coach Nick Nurse. \"That’s not a good sign that two nights in a row that happened."}
{"game_id": "0022100906", "chunk_id": "0022100906_019", "order": 19, "role": "body", "text": "“We know we have a capability of playing better. We’ve got to dig in.”"}
{"game_id": "0022100906", "chunk_id": "0022100906_021", "order": 21, "role": "body", "text": "Raptors: Pascal Siakam had 14 points and 10 rebounds. ... F OG Anunoby missed his second consecutive game with a fractured right ring finger. Nurse said Onunoby is scheduled to see a specialist on Monday."}
{"game_id": "0022100906", "chunk_id": "0022100906_022", "order": 22, "role": "body", "text": "Hawks: G Lou Williams (left hip discomfort) was held out after playing 12 minutes in Thursday night's loss at Chicago. ... F De’Andre Hunter had 14 points after missing the second half against Chicago because of an illness."}
{"game_id": "0022100906", "chunk_id": "0022100906_024", "order": 24, "role": "body", "text": "Nurse said before the game VanVleet might not play after having renewed soreness in his knee on Saturday morning. The soreness came after VanVleet scored eight points in 29 minutes at Charlotte on Friday night."}
{"game_id": "0022100906", "chunk_id": "0022100906_025", "order": 25, "role": "body", "text": "VanVleet wouldn't discuss details about his knee and said he wouldn't use it as an excuse."}
{"game_id": "0022100906", "chunk_id": "0022100906_026", "order": 26, "role": "body", "text": "“It’s not a major thing but it’s definitely a pain in the ass,” VanVleet said. “I’ve got to keep working and rehab and try to be available for my team.”"}
{"game_id": "0022100906", "chunk_id": "0022100906_028", "order": 28, "role": "body", "text": "Hawks forward John Collins (strained right foot) missed his fifth consecutive game. Coach Nate McMillan said Collins “did some shooting and a little running” on Saturday morning. It was Young's first time testing the foot by running."}
{"game_id": "0022100906", "chunk_id": "0022100906_029", "order": 29, "role": "body", "text": "Collins will be checked on Sunday to see how the foot responds."}
{"game_id": "0022100906", "chunk_id": "0022100906_031", "order": 31, "role": "body", "text": "Raptors: Visit Brooklyn on Monday night."}
{"game_id": "0022100906", "chunk_id": "0022100906_032", "order": 32, "role": "body", "text": "Hawks: Visit Boston on Tuesday night."}
