{"game_id": "0022101157", "chunk_id": "0022101157_001", "order": 1, "role": "lead", "text": "OKLAHOMA CITY -- — Killian Hayes scored a career-high 26 points and Frank Jackson also had 26 to lead the Detroit Pistons to a 110-101 victory over Oklahoma City on Friday night in a matchup of teams near the bottom of the NBA standings."}
{"game_id": "0022101157", "chunk_id": "0022101157_002", "order": 2, "role": "body", "text": "In the second night of a back-to-back, Pistons regulars Cade Cunningham, Isaiah Stewart and Saddiq Bey started the game, but did not play after the midway point of the first quarter. Pistons coach Duane Casey said a combination of travel and minor injury concerns led him to limit their play."}
{"game_id": "0022101157", "chunk_id": "0022101157_003", "order": 3, "role": "body", "text": "“We’ve got a lot of nicks and bumps. Saddiq’s hip is a little banged up, Cade’s back is a little banged up. And it gives us an opportunity to play a lot of the young guys,\" Casey said. \"Probably if we were competing for a playoff position, they definitely could go out and play. We’ll see going forward where they are.”"}
{"game_id": "0022101157", "chunk_id": "0022101157_004", "order": 4, "role": "body", "text": "Theo Maledon led the Thunder with 28 points. Jaylen Hoard, called up Friday from the G-League, scored 11 points and grabbed 20 rebounds in his first career NBA start."}
{"game_id": "0022101157", "chunk_id": "0022101157_005", "order": 5, "role": "body", "text": "After a back-and-forth first quarter, Detroit rolled to a 14-point lead late in the second quarter before the Thunder made a run behind a trio of 3-point shots from Lindy Waters III to close the gap to 55-52 at intermission."}
{"game_id": "0022101157", "chunk_id": "0022101157_006", "order": 6, "role": "body", "text": "But Jackson scored nine points in the first four minutes of the third quarter and the Pistons expanded their lead to 22 points before settling for an 83-66 advantage heading into the fourth period. Oklahoma City cut it to seven in the final minute, but Isaiah Livers hit a three to put the game out of reach."}
{"game_id": "0022101157", "chunk_id": "0022101157_007", "order": 7, "role": "body", "text": "Hayes added eight assists, seven rebounds, five steals and two blocked shots. Saben Lee handed out a dozen assists for the Pistons."}
{"game_id": "0022101157", "chunk_id": "0022101157_008", "order": 8, "role": "body", "text": "“I just took what the defense gave me,” Hayes said. “I was just being aggressive, I was trying to find my teammates when they were open.”"}
{"game_id": "0022101157", "chunk_id": "0022101157_009", "order": 9, "role": "body", "text": "Casey said it was good for the second-year guard to find his level of endurance on the court."}
{"game_id": "0022101157", "chunk_id": "0022101157_010", "order": 10, "role": "body", "text": "“He had found a niche coming off the bench, tonight he started. I thought he paced himself. 40 minutes is probably the most NBA minutes he’s played,\" Casey said. \"Good test for him, measuring stick.”"}
{"game_id": "0022101157", "chunk_id": "0022101157_012", "order": 12, "role": "body", "text": "Thunder: Forward Aleksej Pokusevski was scratched from the lineup prior to warmups with flu-like symptoms, which is why Hoard was called up for his second NBA appearance of the season. He played 40 minutes for an OKC squad that had only eight available players."}
{"game_id": "0022101157", "chunk_id": "0022101157_013", "order": 13, "role": "body", "text": "Thunder coach Mark Daigneault was impressed with Hoard’s effort on such short notice."}
{"game_id": "0022101157", "chunk_id": "0022101157_014", "order": 14, "role": "body", "text": "“Big time. We needed the minutes tonight where we’re at. And I just appreciate his toughness. Always have,\" he said. \"That’s been the one thing that’s a constant from him from the day he walked in our gym.”"}
{"game_id": "0022101157", "chunk_id": "0022101157_015", "order": 15, "role": "body", "text": "Pistons: It was Cunningham's first return to the state where he played his lone season of collegiate ball (Oklahoma State) and got a large ovation from the Thunder crowd. Cunningham led the Cowboys to the NCAA Tournament last season."}
{"game_id": "0022101157", "chunk_id": "0022101157_017", "order": 17, "role": "body", "text": "Pistons: Visit Indiana on Sunday."}
{"game_id": "0022101157", "chunk_id": "0022101157_018", "order": 18, "role": "body", "text": "Thunder: Host Phoenix on Sunday."}
