{"game_id": "0022100242", "chunk_id": "0022100242_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Clint Capela had 20 points and 15 rebounds, Trae Young scored 19 points and the Atlanta Hawks beat the Charlotte Hornets 115-105 on Saturday night."}
{"game_id": "0022100242", "chunk_id": "0022100242_002", "order": 2, "role": "body", "text": "Cam Reddish scored 17 points, fellow reserve Danilo Gallinari had 16 and Atlanta won its fourth consecutive game. John Collins pitched in 15 points and eight rebounds."}
{"game_id": "0022100242", "chunk_id": "0022100242_003", "order": 3, "role": "body", "text": "The Hawks have picked up the pace after getting back from a rough road trip. Since returning to their home arena, they’re averaging 118.5 points."}
{"game_id": "0022100242", "chunk_id": "0022100242_004", "order": 4, "role": "body", "text": "“I think the improvement that we’ve made is just to play faster,” said Young, who shot just 5 for 15 but added nine assists. “The more possessions you have, the more shots you get up, with the guys we have, it’s good.”"}
{"game_id": "0022100242", "chunk_id": "0022100242_005", "order": 5, "role": "body", "text": "Miles Bridges scored 35 points but the Hornets made just 42 of 102 shots (42.6 percent) and were 10 of 40 on 3-pointers. LaMelo Ball finished with 15 points, 12 assists and 10 rebounds as Charlotte's five-game win streak was snapped."}
{"game_id": "0022100242", "chunk_id": "0022100242_006", "order": 6, "role": "body", "text": "The game was played at a fairly deliberate pace and Charlotte seemed sluggish, perhaps because the Hornets played Friday night against the Pacers."}
{"game_id": "0022100242", "chunk_id": "0022100242_007", "order": 7, "role": "body", "text": "Atlanta moved quickly to a 10-point lead by the middle of the first quarter, and the game’s margin remained within 10 points for most of the remainder of the night."}
{"game_id": "0022100242", "chunk_id": "0022100242_008", "order": 8, "role": "body", "text": "Kevin Huerter finished with 17 points for Atlanta."}
{"game_id": "0022100242", "chunk_id": "0022100242_009", "order": 9, "role": "body", "text": "“You have the crowd cheering for you. It helps. I think it probably makes a difference,” Collins said. “You can hear the crowd cheering for you every time you make a big play or a big shot.”"}
{"game_id": "0022100242", "chunk_id": "0022100242_012", "order": 12, "role": "body", "text": "Hawks: Collins led everyone with four blocked shots."}
{"game_id": "0022100242", "chunk_id": "0022100242_014", "order": 14, "role": "body", "text": "Hornets: Will play Monday at Washington."}
{"game_id": "0022100242", "chunk_id": "0022100242_015", "order": 15, "role": "closing", "text": "Hawks: Will play Monday vs. Oklahoma City."}
