{"game_id": "0022101221", "chunk_id": "0022101221_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Atlanta coach Nate McMillan is certainly glad his team's season didn't end Sunday with the regular-season finale."}
{"game_id": "0022101221", "chunk_id": "0022101221_002", "order": 2, "role": "body", "text": "But next year he hopes the Hawks aren't clawing for a spot in the play-in tournament during the last few days of the season."}
{"game_id": "0022101221", "chunk_id": "0022101221_003", "order": 3, "role": "body", "text": "Trae Young had 28 points and 11 assists as the Hawks beat the Houston Rockets 130-114 — a victory that didn't improve their postseason position."}
{"game_id": "0022101221", "chunk_id": "0022101221_004", "order": 4, "role": "body", "text": "The Hawks finished ninth in the Eastern Conference and will host the 10-seeded Charlotte Hornets on Wednesday night in the play-in tournament."}
{"game_id": "0022101221", "chunk_id": "0022101221_005", "order": 5, "role": "body", "text": "“This feeling of what we are going through right now is not the feeling I expect next season. ... Next year we don’t want to experience this,\" McMillan said. “Next year the mindset — I want it to be different.\""}
{"game_id": "0022101221", "chunk_id": "0022101221_006", "order": 6, "role": "body", "text": "Atlanta entered the day in ninth place and had already clinched a spot in the play-in tournament but played its starters against the lowly Rockets with a chance to improve its spot in the standings with a win and a loss by Cleveland. But the Cavaliers handily beat a Milwaukee team resting its starters to secure the eighth seed and leave the Hawks at No. 9."}
{"game_id": "0022101221", "chunk_id": "0022101221_007", "order": 7, "role": "body", "text": "Jalen Green, the second overall pick in the draft, had a season-high 41 points for the Rockets, who lost their seventh straight game to finish 20-62, giving them the NBA’s worst record for a second straight season."}
{"game_id": "0022101221", "chunk_id": "0022101221_008", "order": 8, "role": "body", "text": "Green was happy to finish with a big game after managing just eight points on 3-of-10 shooting in Houston's last game."}
{"game_id": "0022101221", "chunk_id": "0022101221_009", "order": 9, "role": "body", "text": "“It meant a lot just to end the year strong,\" he said."}
{"game_id": "0022101221", "chunk_id": "0022101221_010", "order": 10, "role": "body", "text": "Houston cut the lead to seven on two free throws by Green with about nine minutes to go. But Atlanta scored the next 16 points, fueled by four 3-pointers, to make it 120-97 midway through the fourth quarter."}
{"game_id": "0022101221", "chunk_id": "0022101221_011", "order": 11, "role": "body", "text": "Bogdan Bogdanovic had two 3s in that stretch and Danilo Gallinari and De’Andre Hunter had one each to help the Hawks pull away."}
{"game_id": "0022101221", "chunk_id": "0022101221_012", "order": 12, "role": "body", "text": "McMillan was proud of the way his team responded when Houston made it close in the fourth quarter."}
{"game_id": "0022101221", "chunk_id": "0022101221_013", "order": 13, "role": "body", "text": "“We just have to finish games,\" he said. “It wasn’t so much what I needed to say, it had already been said and we needed to close that quarter and close that game.\""}
{"game_id": "0022101221", "chunk_id": "0022101221_014", "order": 14, "role": "body", "text": "Gallinari added 26 points with six 3-pointers and Hunter had 22 points for the Hawks, who finished the regular season 43-39."}
{"game_id": "0022101221", "chunk_id": "0022101221_015", "order": 15, "role": "body", "text": "Young made four 3s to give him 233 this season, passing Mookie Blaylock (231 in 1995-96) for most in franchise history."}
{"game_id": "0022101221", "chunk_id": "0022101221_016", "order": 16, "role": "body", "text": "The Hawks were up by 14 after a 3-pointer by Young with about seven minutes left in the third quarter. Houston then used a 12-4 run to cut the lead to 88-82 with four minutes left in the third. Green had four points in that span and Garrison Mathews capped the run with a 3-pointer."}
{"game_id": "0022101221", "chunk_id": "0022101221_017", "order": 17, "role": "body", "text": "Clint Capela got Atlanta going after that, scoring the first four points of a 7-0 spurt that extended the lead to 95-82."}
{"game_id": "0022101221", "chunk_id": "0022101221_018", "order": 18, "role": "body", "text": "Houston got within eight on a basket by Kenyon Martin Jr. late in the third, but Gallinari hit a 3-pointer for the Hawks to leave them up 102-91 entering the fourth."}
{"game_id": "0022101221", "chunk_id": "0022101221_020", "order": 20, "role": "body", "text": "McMillan on his team's chances entering the play-in game: “We get a home game. It doesn’t guarantee anything, but we’ve been pretty good at home.\""}
{"game_id": "0022101221", "chunk_id": "0022101221_022", "order": 22, "role": "body", "text": "Rockets: Christian Wood sat out for a seventh consecutive game with a hamstring injury. ... Kevin Porter Jr. had 26 points. ... Mathews scored 14."}
{"game_id": "0022101221", "chunk_id": "0022101221_023", "order": 23, "role": "body", "text": "Hawks: Lou Williams missed a third straight game with lower back discomfort. ... Capela had 18 points and 13 rebounds. ... Atlanta shot 21 of 38 from 3-point range."}
