{"game_id": "0022100836", "chunk_id": "0022100836_001", "order": 1, "role": "lead", "text": "PHOENIX -- — Cam Johnson eased past his defender and slammed home a pretty one-handed dunk, thrilling a sellout crowd and giving the Phoenix Suns a 20-point cushion heading into the fourth quarter of a 131-107 win over the Milwaukee Bucks."}
{"game_id": "0022100836", "chunk_id": "0022100836_002", "order": 2, "role": "body", "text": "Nothing changes the fact that the Bucks beat the Suns last year in the NBA Finals."}
{"game_id": "0022100836", "chunk_id": "0022100836_003", "order": 3, "role": "body", "text": "Still, there's little doubt that Thursday night felt good for Phoenix."}
{"game_id": "0022100836", "chunk_id": "0022100836_004", "order": 4, "role": "body", "text": "Deandre Ayton scored 27 points, Mikal Bridges added 18 and the Suns pushed their NBA-best record to 45-10 in a rematch of last season's title series. Chris Paul added 17 points and 19 assists while Devin Booker also scored 17 points."}
{"game_id": "0022100836", "chunk_id": "0022100836_005", "order": 5, "role": "body", "text": "“They're the defending champs — we still hurt,” Suns coach Monty Williams said. “But from a confidence standpoint, for sure, it was a big game for us. I can admit it now.”"}
{"game_id": "0022100836", "chunk_id": "0022100836_006", "order": 6, "role": "body", "text": "The game was tight throughout most of the first half but the Suns slowly pulled away in the third quarter, building a 97-77 advantage going into the fourth. Ayton had an efficient night, shooting 12 of 14 from the field on a variety of post moves and jumpers."}
{"game_id": "0022100836", "chunk_id": "0022100836_007", "order": 7, "role": "body", "text": "The Suns led by as many as 27 in the fourth and received a standing ovation from the home crowd in the final minutes when the starters checked out of the game."}
{"game_id": "0022100836", "chunk_id": "0022100836_008", "order": 8, "role": "body", "text": "Paul finished with his 500th career double-double. He's just the fourth guard in NBA history to accomplish that feat."}
{"game_id": "0022100836", "chunk_id": "0022100836_009", "order": 9, "role": "body", "text": "“I'm grateful that I still get a chance to play,” Paul said. “And not just play, but I feel like I play at a high level every night. It's cool.”"}
{"game_id": "0022100836", "chunk_id": "0022100836_010", "order": 10, "role": "body", "text": "The Bucks had a four-game winning streak snapped. Jrue Holiday and Khris Middleton led the Bucks with 21 points apiece. Giannis Antetokounmpo had 18 points, eight assists and seven rebounds."}
{"game_id": "0022100836", "chunk_id": "0022100836_011", "order": 11, "role": "body", "text": "“They came out and executed,” Holiday said. “We missed a couple of shots. Our defense, I know my defense personally starting in the third quarter was really bad, really bad. They came out and took care of business.”"}
{"game_id": "0022100836", "chunk_id": "0022100836_012", "order": 12, "role": "body", "text": "Phoenix has won 15 of its past 16 games."}
{"game_id": "0022100836", "chunk_id": "0022100836_013", "order": 13, "role": "body", "text": "The Suns used a 12-4 run to end the second quarter and take a 64-56 lead into halftime. Ayton led Phoenix with 15 points before the break while Holiday had 17 points for the Bucks."}
{"game_id": "0022100836", "chunk_id": "0022100836_014", "order": 14, "role": "body", "text": "It was the first meeting between the teams since July 20, when the Bucks beat the Suns 105-98 in Milwaukee to win Game 6 and secure an NBA title. The Bucks won the final four games of the series."}
{"game_id": "0022100836", "chunk_id": "0022100836_016", "order": 16, "role": "body", "text": "Bucks guard Pat Connaughton broke a finger in his right hand in the third quarter."}
{"game_id": "0022100836", "chunk_id": "0022100836_017", "order": 17, "role": "body", "text": "Coach Mike Budenholzer confirmed the injury after the game. Connaughton was hurt when he fouled Paul on a drive to the basket late in the third quarter. He immediately was holding his right hand — which is his shooting hand — and came out of the game shortly afterwards."}
{"game_id": "0022100836", "chunk_id": "0022100836_018", "order": 18, "role": "body", "text": "Connaughton is one of the team's top reserves and is averaging more than 10 points per game."}
{"game_id": "0022100836", "chunk_id": "0022100836_020", "order": 20, "role": "body", "text": "Both teams were short-handed because of trades made earlier in the day."}
{"game_id": "0022100836", "chunk_id": "0022100836_021", "order": 21, "role": "body", "text": "The Bucks acquired center Serge Ibaka, but he wasn't with the team yet. The roster had three other holes after guard Donte DiVincenzo was traded to the Kings and forwards Rodney Hood and Semi Ojeleye were sent to the Clippers."}
{"game_id": "0022100836", "chunk_id": "0022100836_022", "order": 22, "role": "body", "text": "The Suns added forward Torrey Craig and guard Aaron Holiday in trades, but they hadn't arrived in Phoenix. The Suns dealt second-year forward Jalen Smith to the Pacers for Craig."}
{"game_id": "0022100836", "chunk_id": "0022100836_024", "order": 24, "role": "body", "text": "Bucks: Budenholzer said he hopes G George Hill (neck soreness) can return soon. He said the team hasn't decided if they'll wait until after the All-Star break to bring him back, giving him extra time to rest."}
{"game_id": "0022100836", "chunk_id": "0022100836_025", "order": 25, "role": "body", "text": "Suns: Guards Cam Payne (wrist sprain) and Landry Shamet (sprained ankle) didn't play. ... Hosted a sellout crowd at the Footprint Center for a 13th straight game. ... Johnson scored 15 points off the bench. ... Outscored Milwaukee 68-50 in the paint."}
{"game_id": "0022100836", "chunk_id": "0022100836_027", "order": 27, "role": "body", "text": "Bucks: Host the Trail Blazers on Monday."}
{"game_id": "0022100836", "chunk_id": "0022100836_028", "order": 28, "role": "body", "text": "Suns: Host the Magic on Saturday."}
