{"game_id": "0022100272", "chunk_id": "0022100272_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Gary Trent Jr. scored 17 of his 26 points in the fourth quarter and the Toronto Raptors rallied to beat the Memphis Grizzlies 126-113 on Wednesday night."}
{"game_id": "0022100272", "chunk_id": "0022100272_002", "order": 2, "role": "body", "text": "Fred VanVleet scored 23 points, and Precious Achiuwa, Pascal Siakam and Scottie Barnes added 17 each for the Raptors. Barnes had nine rebounds."}
{"game_id": "0022100272", "chunk_id": "0022100272_003", "order": 3, "role": "body", "text": "Ja Morant led Memphis with 23 points and nine assists. Desmond Bane and Dillon Brooks finished with 20 points each, while Jaren Jackson Jr. and Brandon Clarke added 16 points apiece."}
{"game_id": "0022100272", "chunk_id": "0022100272_004", "order": 4, "role": "body", "text": "Memphis squandered a 12-point halftime lead, first on the scoring of Achiuwa, then on Trent’s spree in the fourth."}
{"game_id": "0022100272", "chunk_id": "0022100272_005", "order": 5, "role": "body", "text": "“We just played harder. Played like we cared,” VanVleet said about the second-half burst."}
{"game_id": "0022100272", "chunk_id": "0022100272_006", "order": 6, "role": "body", "text": "“We went out there, we played hard, and we got a W,” Trent said."}
{"game_id": "0022100272", "chunk_id": "0022100272_007", "order": 7, "role": "body", "text": "Toronto used a third-quarter rush, fueled by Achiuwa hitting his first four shots in the quarter, getting the Raptors back in the game. Achiuwa had 17 points in the frame as Toronto outscored Memphis 32-21 in the quarter."}
{"game_id": "0022100272", "chunk_id": "0022100272_008", "order": 8, "role": "body", "text": "That cut the Memphis advantage to 92-91 entering the fourth. Then Trent started connecting, hitting five of his eight shots in the fourth, including all three 3-pointers as the Raptors pulled away at the end."}
{"game_id": "0022100272", "chunk_id": "0022100272_009", "order": 9, "role": "body", "text": "Memphis shot well throughout the first half but was hampered by ill-timed turnovers that kept the Grizzlies from building the lead beyond 14. Still, Memphis’ momentum established a 71-59 lead at the break with four players scoring at least 13 points."}
{"game_id": "0022100272", "chunk_id": "0022100272_010", "order": 10, "role": "body", "text": "The second half was a whole different story. Memphis was limited to 21 points in each of the final two quarters, while the Raptors were putting up 67 second-half points, connecting on 24 of their 41 shots. Toronto made all four 3-point attempts in the fourth."}
{"game_id": "0022100272", "chunk_id": "0022100272_011", "order": 11, "role": "body", "text": "“In the first half, we were bodying them. We were killing them in the paint,” Brooks said of his Grizzlies teammates. “In the second half, we weren’t doing the same thing on offense. Our defense let down.”"}
{"game_id": "0022100272", "chunk_id": "0022100272_012", "order": 12, "role": "body", "text": "Bane added: “I think that (the Raptors) turned their pressure up for sure. … I think they did a good job of making adjustments at halftime.”"}
{"game_id": "0022100272", "chunk_id": "0022100272_013", "order": 13, "role": "body", "text": "The comeback provided a nice feeling for Toronto, which has not had great luck on a road trip that finally ends later this week in Indianapolis. And things did not look good in the first half."}
{"game_id": "0022100272", "chunk_id": "0022100272_014", "order": 14, "role": "body", "text": "“We’re a young team and sometimes it is hard to stress the urgency and what it takes to win in this league every night,” VanVleet said. “You can’t go out there and go through the motions, or you’re going to have a team put 71 on you in the first half. Then you will be fighting uphill. Luckily, we were able to turn it around, but it’s not really the way we want to live.”"}
{"game_id": "0022100272", "chunk_id": "0022100272_016", "order": 16, "role": "body", "text": "Raptors: Barnes swished a 50-footer as the horn sounded to end the first quarter. …Have won 13 of the last 16 over the Grizzlies. … OG Anunoby missed his fourth game with a left hip pointer. C Khem Birch was out with right knee swelling. … Both Achiuwa and F Yuta Watanabe were active for the game, the first of the season for Watanabe."}
{"game_id": "0022100272", "chunk_id": "0022100272_017", "order": 17, "role": "body", "text": "Grizzlies: Brooks was listed as questionable with right hamstring soreness but started for Memphis. … The Grizzlies’ 71 points in the first half were the most scored against Toronto in a half this season. … Outrebounded Toronto in the first half 26-11, but ended the night with a 40-34 advantage."}
{"game_id": "0022100272", "chunk_id": "0022100272_019", "order": 19, "role": "body", "text": "Memphis coach Taylor Jenkins opened his pregame comments with “guilty, guilty, guilty” in reference to the verdicts from Brunswick, Georgia, against three men convicted of murder earlier Wednesday in the death of Ahmaud Arbery. Jenkins hailed the verdict saying the jury’s decision “gives me a lot of hope.”"}
{"game_id": "0022100272", "chunk_id": "0022100272_020", "order": 20, "role": "body", "text": "“Hopefully, this sends just shockwaves throughout our country, understanding that justice can be served, but there is still so much work to be done in our judicial system,” Jenkins said, adding that while there is satisfaction in the verdict “We should never be in this situation. Ever.”"}
{"game_id": "0022100272", "chunk_id": "0022100272_022", "order": 22, "role": "body", "text": "Raptors: Close out a six-game trip Friday night at Indiana."}
{"game_id": "0022100272", "chunk_id": "0022100272_023", "order": 23, "role": "body", "text": "Grizzlies: Host Atlanta on Friday night."}
