{"game_id": "0022100619", "chunk_id": "0022100619_001", "order": 1, "role": "lead", "text": "PHILADELPHIA -- — The Hornets didn't pop champagne or go wild in the locker room following a win over the Sixers more than five years in the making."}
{"game_id": "0022100619", "chunk_id": "0022100619_002", "order": 2, "role": "body", "text": "There was just a simple message from Gordon Hayward: On to the next game."}
{"game_id": "0022100619", "chunk_id": "0022100619_003", "order": 3, "role": "body", "text": "“We talked about it before the game. We talked about ending the streak,” Hayward said. “It was a big win for us. But it was just one.”"}
{"game_id": "0022100619", "chunk_id": "0022100619_004", "order": 4, "role": "body", "text": "Hayward made his first nine shots and scored 30 points and the Charlotte Hornets beat the Philadelphia 76ers 109-98 on Wednesday night to snap a 16-game losing streak in the series."}
{"game_id": "0022100619", "chunk_id": "0022100619_005", "order": 5, "role": "body", "text": "The Hornets hadn’t won against the Sixers since Nov. 2, 2016 and held the longest active losing streak to one team in the NBA."}
{"game_id": "0022100619", "chunk_id": "0022100619_006", "order": 6, "role": "body", "text": "Now the winning streak stands at one."}
{"game_id": "0022100619", "chunk_id": "0022100619_007", "order": 7, "role": "body", "text": "“We battled with these guys for a number of years and it feels like every shot at the end of the game has gone their direction,” Hornets coach James Borrego said."}
{"game_id": "0022100619", "chunk_id": "0022100619_008", "order": 8, "role": "body", "text": "All the Hornets needed was a flawless first half out of Hayward to get them going."}
{"game_id": "0022100619", "chunk_id": "0022100619_009", "order": 9, "role": "body", "text": "Hayward came out firing with a 9 of 9 first half -- that included four 3-pointers -- for 22 points that put the Hornets up 14 at the break. Hayward, who averaged 17 points, became the fourth Hornets player to score 20 points in the first half since the 1996-97 season."}
{"game_id": "0022100619", "chunk_id": "0022100619_010", "order": 10, "role": "body", "text": "“I had some easy looks and I was able to knock them down,” Hayward said."}
{"game_id": "0022100619", "chunk_id": "0022100619_011", "order": 11, "role": "body", "text": "Terry Rozier scored 22 points for the Hornets and Miles Bridges added 21."}
{"game_id": "0022100619", "chunk_id": "0022100619_012", "order": 12, "role": "body", "text": "Joel Embiid scored 31 points for the fifth straight game and the Sixers' seven-game winning streak ended."}
{"game_id": "0022100619", "chunk_id": "0022100619_013", "order": 13, "role": "body", "text": "Embiid continued to do Embiid things and wrecked the Hornets with every kind of a shot from a step-back 3 to a down-the-lane dunk that left the backboard shaking."}
{"game_id": "0022100619", "chunk_id": "0022100619_014", "order": 14, "role": "body", "text": "His recent stretch is one of the best in team history, joining Allen Iverson and Wilt Chamberlain as the only Sixers to score 30-plus points in eight straight games. Embiid made 10 of 17 shots and 10 of 14 free throws against the Hornets."}
{"game_id": "0022100619", "chunk_id": "0022100619_015", "order": 15, "role": "body", "text": "“It’s the skill and the power,” Borrego said. “He knows how to play the game. The way he can impose his size and power on the game and still use skill and finesse at the same time.”"}
{"game_id": "0022100619", "chunk_id": "0022100619_016", "order": 16, "role": "body", "text": "Embiid, though, can’t carry the Sixers alone and the franchise is still at a stalemate with All-Star guard Ben Simmons. Embiid picked up his fifth foul with 3:45 left in the third and the Hornets ended the quarter up 85-76."}
{"game_id": "0022100619", "chunk_id": "0022100619_017", "order": 17, "role": "body", "text": "“It starts with me. I wasn't good enough,\" Embiid said."}
{"game_id": "0022100619", "chunk_id": "0022100619_018", "order": 18, "role": "body", "text": "With a losing streak to the Sixers stretching more than five years, the Hornets, coming off two straight wins against Milwaukee, instead showed why they might be a team on the rise in the Eastern Conference."}
{"game_id": "0022100619", "chunk_id": "0022100619_019", "order": 19, "role": "body", "text": "“I wouldn’t say it’s a message. We just have to continue to get better,” Bridges said. “These are three good wins against three good teams but we still haven’t done anything yet.”"}
{"game_id": "0022100619", "chunk_id": "0022100619_020", "order": 20, "role": "body", "text": "Tobias Harris hit a 3 that brought the Sixers within eight only for Rozier to come right back and hit one for the Hornets. Bridges buried Charlotte’s ninth 3 to stretch the lead -- and put that losing streak to rest."}
{"game_id": "0022100619", "chunk_id": "0022100619_022", "order": 22, "role": "body", "text": "Hornets: Borrego stumped for guard LaMelo Ball to make the All-Star team. “He brings a joy to our gym,” he said. “If we were having a film session right here, he’s up front, he’s talking the most, he’s got great spirit about us. You need that spirit to get through 82 games.” ... C Kai Jones entered health and safety protocols."}
{"game_id": "0022100619", "chunk_id": "0022100619_023", "order": 23, "role": "body", "text": "76ers: G Danny Green had his right hip examined after a hard fall and returned to the game. ... The Sixers had 16 turnovers."}
{"game_id": "0022100619", "chunk_id": "0022100619_025", "order": 25, "role": "body", "text": "The Sixers continue to motor along with no change in Simmons’ status as he sits out the season following an offseason trade demand. The NBA trade deadline is about a month away (Feb. 10) and rumors continue to swirl around Simmons and the Sixers."}
{"game_id": "0022100619", "chunk_id": "0022100619_026", "order": 26, "role": "body", "text": "“We have the Ben thing,” coach Doc Rivers said. “I’m sure there will be some crazy rumors. There’s not a lot I can do about that. But there may be more than usual. If that’s the case, then you have to deal with it. You have to deal with it, I guess.”"}
{"game_id": "0022100619", "chunk_id": "0022100619_027", "order": 27, "role": "body", "text": "Rivers said Simmons continues to visit the Sixers’ training facility in New Jersey."}
{"game_id": "0022100619", "chunk_id": "0022100619_028", "order": 28, "role": "body", "text": "“Hopefully we’ll have an answer, sooner or later,” Rivers said."}
{"game_id": "0022100619", "chunk_id": "0022100619_029", "order": 29, "role": "body", "text": "Simmons’ agent, Klutch Sports CEO Rich Paul, sat courtside and heard one fan shout, “Yo, Rich Paul, get Ben Simmons out of Philly!”"}
{"game_id": "0022100619", "chunk_id": "0022100619_031", "order": 31, "role": "body", "text": "Hornets: Host the Magic on Friday."}
{"game_id": "0022100619", "chunk_id": "0022100619_032", "order": 32, "role": "body", "text": "76ers: Host the Celtics on Friday."}
