{"game_id": "0022101123", "chunk_id": "0022101123_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Darius Garland had 25 points and 12 assists, leading the Cleveland Cavaliers to a 107-101 win over the Orlando Magic on Monday night after losing big man Evan Mobley due to a sprained left ankle."}
{"game_id": "0022101123", "chunk_id": "0022101123_002", "order": 2, "role": "body", "text": "Mobley, the No. 3 overall pick, landed on the foot of Franz Wagner while defending under the basket in the second quarter. He limped to the locker room after briefly laying on the court and did not return."}
{"game_id": "0022101123", "chunk_id": "0022101123_003", "order": 3, "role": "body", "text": "The Cavaliers did not provide an update, but Kevin Love said Mobley rolled his ankle “pretty good.” Mobley is averaging 14.9 points and 8.3 rebounds, placing him squarely in the Rookie of the Year race with Toronto’s Scottie Barnes and Detroit’s Cade Cunningham."}
{"game_id": "0022101123", "chunk_id": "0022101123_004", "order": 4, "role": "body", "text": "“It gutted us to lose Evan, whether it’s for a game, two games, three games or whatever it may be,” Love said. “We need to keep fighting and hope that he recovers quickly and can be out there with us because he means so much to the team.”"}
{"game_id": "0022101123", "chunk_id": "0022101123_005", "order": 5, "role": "body", "text": "Lauri Markkanen scored 20 points, Love had 19 points and seven rebounds, and Isaac Okoro added 11 points for the Cavaliers, who snapped a three-game losing streak and remained seventh in the Eastern Conference with a 42-33 record."}
{"game_id": "0022101123", "chunk_id": "0022101123_006", "order": 6, "role": "body", "text": "Cleveland clinched its first winning season in four years. This is the first time the Cavaliers will finish above .500 without LeBron James on their roster since 1997-1998."}
{"game_id": "0022101123", "chunk_id": "0022101123_007", "order": 7, "role": "body", "text": "“Mentally, I think it struck us a little bit, seeing our rookie of the year go down like that,” Garland said. “We just had to pull it back together and that’s what we did. We got back to playing our style of basketball and came up with a win.”"}
{"game_id": "0022101123", "chunk_id": "0022101123_008", "order": 8, "role": "body", "text": "Magic power forward Wendell Carter Jr. had 15 points, 12 rebounds and six assists, Ignas Brazdeikis scored 13 points and Wagner had 10 points and six assists. Orlando has the worst record in the East at 20-56."}
{"game_id": "0022101123", "chunk_id": "0022101123_009", "order": 9, "role": "body", "text": "“That second unit with (Brazdeikis) gave us a large lift and really executed down the stretch,” Magic coach Jamahl Mosley said. “Our starters were right there cheering for those guys because we have such a dynamic group, they’re all so supportive.”"}
{"game_id": "0022101123", "chunk_id": "0022101123_010", "order": 10, "role": "body", "text": "Brazdeikis’ layup gave Orlando a 92-90 lead midway through the fourth, but Markkanen and Garland combined to score the next 12 points, putting Cleveland in front for good. It was capped by an alley-oop from Garland to Markkanen."}
{"game_id": "0022101123", "chunk_id": "0022101123_011", "order": 11, "role": "body", "text": "“Darius is a closer and he has the ability to make all the shots,” Cavaliers coach J.B. Bickerstaff said. “You look at teams that win -- and most of these games come down to the fourth quarter -- and they have a closer. Darius is at that level and it’s an elite level.”"}
{"game_id": "0022101123", "chunk_id": "0022101123_012", "order": 12, "role": "body", "text": "All-Star center Jarrett Allen (left middle finger fracture) missed his 11th straight game for Cleveland. Point guard Rajon Rondo (right ankle sprain) has not played since March 12, and shooting guard Collin Sexton (left knee surgery) is out for the season."}
{"game_id": "0022101123", "chunk_id": "0022101123_013", "order": 13, "role": "body", "text": "“We’ll play the guys who are here,” Bickerstaff said. “We’ll roll with the guys we got.”"}
{"game_id": "0022101123", "chunk_id": "0022101123_015", "order": 15, "role": "body", "text": "The Cavaliers lost their two most important games of the season to date, 117-104 at Toronto and 98-94 to Chicago in a three-day span. As a result, Cleveland slipped to seventh in the East and now trails both teams by one game. “It was the magnitude of the moment and the (limited) experience level of our guys,” Bickerstaff said. “It hurts. It’s painful. But you have to go through it and you have to take some lumps.” Four of the Cavaliers’ final seven games are on the road."}
{"game_id": "0022101123", "chunk_id": "0022101123_017", "order": 17, "role": "body", "text": "Magic: Mosley watched the Oscars with Bickerstaff at his house. … Rookie Wagner, Detroit’s Saddiq Bey and Phoenix’s Mikal Bridges are the only NBA players to start every game this season. … Rookie G Jalen Suggs (right ankle bruise), the No. 5 overall pick, last played on March 13 against Philadelphia. … C Bol Bol (right foot surgery) and C Jonathan Isaac (left knee rehabilitation) are out for the season."}
{"game_id": "0022101123", "chunk_id": "0022101123_018", "order": 18, "role": "body", "text": "Cavaliers: Mobley needs one point to become the eighth rookie in franchise history with 1,000. … F Dean Wade (right meniscus tear) will miss the rest of the season after undergoing knee surgery. Wade, who made 28 starts, averaged 5.3 points in 51 games. … C Moses Brown’s second 10-day contract runs through March 30. … Cleveland took a 59-58 lead in its series with Orlando, which entered the NBA in 1989."}
{"game_id": "0022101123", "chunk_id": "0022101123_020", "order": 20, "role": "body", "text": "Magic: Visit the Washington Wizards on Wednesday night."}
{"game_id": "0022101123", "chunk_id": "0022101123_021", "order": 21, "role": "body", "text": "Cavaliers: Host the Dallas Mavericks on Wednesday night."}
