{"game_id": "0022100110", "chunk_id": "0022100110_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Al Horford wasn't calling the Boston Celtics’ team meal a “player’s only meeting,” yet he said the squad discussed in detail their expectations for Wednesday's game against the Orlando Magic."}
{"game_id": "0022100110", "chunk_id": "0022100110_002", "order": 2, "role": "body", "text": "The Celtics then went out and backed up their talk with their best defensive effort of the season in a 92-79 rout of the Magic."}
{"game_id": "0022100110", "chunk_id": "0022100110_003", "order": 3, "role": "body", "text": "Jaylen Brown scored 28 points and the Celtics used an 18-1 run at the start of the second half to break open a close game. Boston, which saw guard Marcus Smart be critical of teammates Jayson Tatum and Brown following a Monday loss to Chicago, limited Orlando to 10 points in the third quarter."}
{"game_id": "0022100110", "chunk_id": "0022100110_004", "order": 4, "role": "body", "text": "“A gathering, a team dinner — it was just nice to break bread together and hang out,” Horford said of the Tuesday session in which head coach Ime Udoka left players alone for approximately 30 minutes to hash out their differences. “Most importantly, we talked about making sure we came out and had a good outing. Defensively, I felt like we took some steps.”"}
{"game_id": "0022100110", "chunk_id": "0022100110_005", "order": 5, "role": "body", "text": "Jayson Tatum added 14 points as the Celtics snapped a three-game losing streak and defeated the Magic for a seventh consecutive time over the last three seasons. Boston made 11 of its first 17 shots of the second half."}
{"game_id": "0022100110", "chunk_id": "0022100110_006", "order": 6, "role": "body", "text": "“We talked about their 18-point second quarter and we wanted to have some carryover,” Udoka said. “We wanted to lock up the paint and make them beat us with jump shots.”"}
{"game_id": "0022100110", "chunk_id": "0022100110_007", "order": 7, "role": "body", "text": "Horford had 12 points, 12 rebounds and seven assists for the Celtics, who won despite shooting 41.8% from the floor. Brown made 12 of 17 shots and had his fifth 20-point game of the season."}
{"game_id": "0022100110", "chunk_id": "0022100110_008", "order": 8, "role": "body", "text": "Wendell Carter Jr. had 13 points and 13 rebounds for the Magic, who remained winless at home. The Magic scored 28 points in the opening 12 minutes for their first first-quarter lead of the season. However, they mustered just 33 after halftime."}
{"game_id": "0022100110", "chunk_id": "0022100110_009", "order": 9, "role": "body", "text": "“In that third quarter, we got frustrated when none of our actions were working,” Carter said. “We were taking the first shot instead of getting to the second side. That’s immaturity.”"}
{"game_id": "0022100110", "chunk_id": "0022100110_010", "order": 10, "role": "body", "text": "Trailing 46-44 after a sluggish first half, Boston came alive offensively in the third quarter, running away from the cold-shooting Magic. By the time Orlando had missed 14 of its first 15 shots of the third period, Boston had built a comfortable 69-50 lead."}
{"game_id": "0022100110", "chunk_id": "0022100110_012", "order": 12, "role": "body", "text": "Udoka said he had no problem with Smart calling out Tatum and Brown for what he deemed to be an unwillingness to share the ball in Boston’s fourth-quarter meltdown on Monday. After all, Udoka said, Smart just stated what he tells players daily."}
{"game_id": "0022100110", "chunk_id": "0022100110_013", "order": 13, "role": "body", "text": "“I’ve preached that from Day 1 with Jayson and Jaylen, and it’s just about them growing into playmakers,” Udoka said. “Marcus, Jayson and Jaylen have a long history together, and every team I’ve ever been on has had moments when they butt heads. It’s nothing we haven’t talked about.”"}
{"game_id": "0022100110", "chunk_id": "0022100110_014", "order": 14, "role": "body", "text": "Udoka said the Celtics’ slow start to the season is more a result of their inability to close out games than selfishness by any players."}
{"game_id": "0022100110", "chunk_id": "0022100110_015", "order": 15, "role": "body", "text": "“Losing two double-overtime games where Jayson had a game-winning shot against New York and Jaylen had a shot to win it against Washington, and then the last game where we were up 19, the record is one thing, but it’s a big-picture approach,” Udoka said. “It could easily be 4-3, 5-2, and there probably wouldn’t be questions about (the record). But the fact we haven’t finished, you’re going to get these questions, and 2-5 is not up to the standard or where we’d like to be.”"}
{"game_id": "0022100110", "chunk_id": "0022100110_017", "order": 17, "role": "body", "text": "Celtics: Smart, Boston’s best 1-on-1 defender, started on Cole Anthony and shadowed Orlando’s leading scorer most of the game. Anthony made just four of 18 shots and scored only 13 points."}
{"game_id": "0022100110", "chunk_id": "0022100110_018", "order": 18, "role": "body", "text": "Magic: With an average age of 21 years, 213 days, the Magic’s starting five to open the season was the NBA’s youngest since 1970-71. They used that lineup in each of the first nine games and, remarkably, it came into Wednesday with the NBA’s highest net offensive rating (plus-20.5 points in 96 minutes together)."}
{"game_id": "0022100110", "chunk_id": "0022100110_020", "order": 20, "role": "body", "text": "Celtics: At Miami on Thursday night."}
{"game_id": "0022100110", "chunk_id": "0022100110_021", "order": 21, "role": "body", "text": "Magic: Host San Antonio on Friday night."}
