{"game_id": "0022100378", "chunk_id": "0022100378_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Brandon Boston Jr. had career highs of 27 points and five 3-pointers, sparking the Los Angeles Clippers to a 114-111 victory over the Boston Celtics on Wednesday in a matchup of teams barely above .500."}
{"game_id": "0022100378", "chunk_id": "0022100378_002", "order": 2, "role": "body", "text": "On a night when Paul George was sidelined with a bruised right elbow, Boston electrified his teammates and most of the crowd with a 3-pointer that beat the halftime buzzer. It capped 18 points in 14 minutes for the rookie out of Kentucky."}
{"game_id": "0022100378", "chunk_id": "0022100378_003", "order": 3, "role": "body", "text": "“I took one dribble to look how much was left on the clock,” Boston said. “I said, ‘OK, one second. OK, I got enough time to turn around.’ I turned around and just let it go.”"}
{"game_id": "0022100378", "chunk_id": "0022100378_004", "order": 4, "role": "body", "text": "Clippers teammate Nicolas Batum said: \"I don't think he was in their game plan — 51st pick.”"}
{"game_id": "0022100378", "chunk_id": "0022100378_005", "order": 5, "role": "body", "text": "The Celtics knew who he was. Boston said he heard some of their players calling him “Mr. 46,” a reference to the 46 points he scored in a G League game a week ago."}
{"game_id": "0022100378", "chunk_id": "0022100378_006", "order": 6, "role": "body", "text": "Marcus Morris added 20 points for the Clippers, who won consecutive games for the first time since Nov. 13. Ivica Zubac and Terance Mann had 10 points and 10 rebounds each."}
{"game_id": "0022100378", "chunk_id": "0022100378_007", "order": 7, "role": "body", "text": "The Celtics were led by Jayson Tatum with 29 points and 10 rebounds. Dennis Schröder added 19 points and eight assists, and Josh Richardson scored 17 off the bench."}
{"game_id": "0022100378", "chunk_id": "0022100378_008", "order": 8, "role": "body", "text": "The Clippers blew most of a 21-point lead in the third quarter, when the Celtics got within four."}
{"game_id": "0022100378", "chunk_id": "0022100378_009", "order": 9, "role": "body", "text": "Boston scored five points in a 13-4 run that opened the third and extended the Clippers’ lead to 76-55 — their biggest of the game."}
{"game_id": "0022100378", "chunk_id": "0022100378_010", "order": 10, "role": "body", "text": "The Celtics responded with a 20-4 spurt that drew them within four. Tatum scored nine points, drawing huge cheers from the green-clad fans in the crowd with a dunk off Eric Bledsoe’s turnover."}
{"game_id": "0022100378", "chunk_id": "0022100378_011", "order": 11, "role": "body", "text": "“We started picking up the pressure, getting some turnovers and speeding them up,” Tatum said. “We always feel like we have a chance till the buzzer goes off.”"}
{"game_id": "0022100378", "chunk_id": "0022100378_012", "order": 12, "role": "body", "text": "The Clippers led 87-78 going into the fourth. They pushed their lead to 15 after eight straight points capped by Morris' basket."}
{"game_id": "0022100378", "chunk_id": "0022100378_013", "order": 13, "role": "body", "text": "But the Celtics weren't done yet. They ran off 10 in a row to close to 102-97."}
{"game_id": "0022100378", "chunk_id": "0022100378_014", "order": 14, "role": "body", "text": "“Minus PG, this was a good win for us. I don't like how we finished the game,” Clippers coach Tyronn Lue said. “They got dunk after dunk. It's hard to win games like that, but we kept our composure.”"}
{"game_id": "0022100378", "chunk_id": "0022100378_015", "order": 15, "role": "body", "text": "The final 3 1/2 minutes turned into a 3-point shootout."}
{"game_id": "0022100378", "chunk_id": "0022100378_016", "order": 16, "role": "body", "text": "Reggie Jackson and Luke Kennard hit back-to-back 3s for the Clippers, restoring their lead to 11 points. Schröder and Richardson did the same for the Celtics, again putting them within five."}
{"game_id": "0022100378", "chunk_id": "0022100378_017", "order": 17, "role": "body", "text": "The Celtics successfully challenged an out-of-bounds call with 1:29 remaining that gave them possession. After Schröder missed, Tatum got the offensive rebound and tipped the ball in to get the Celtics to 108-105."}
{"game_id": "0022100378", "chunk_id": "0022100378_018", "order": 18, "role": "body", "text": "Morris then coolly sank a 3-pointer from the left corner."}
{"game_id": "0022100378", "chunk_id": "0022100378_019", "order": 19, "role": "body", "text": "The Clippers went 3 of 4 from the free throw line in the final 12 seconds to hold on after the Celtics closed within one. Tatum missed a potential tying 3 at the buzzer."}
{"game_id": "0022100378", "chunk_id": "0022100378_020", "order": 20, "role": "body", "text": "“We only played a quarter and a half,” Celtics coach Ime Udoka said. “Gifting them points, that is the frustrating part. The turnovers (22) were enough of a gift.”"}
{"game_id": "0022100378", "chunk_id": "0022100378_022", "order": 22, "role": "body", "text": "“That's unacceptable,” he said. “We've got to be tougher and take care of the ball.”"}
{"game_id": "0022100378", "chunk_id": "0022100378_023", "order": 23, "role": "body", "text": "Boston hit the Clippers' first 3 of the second half, looking as amazed as anyone. A grinning Morris celebrated with him before making a 3 of his own."}
{"game_id": "0022100378", "chunk_id": "0022100378_024", "order": 24, "role": "body", "text": "Boston did some trash talking in the second quarter that drew a technical foul. In the third, he was called for a flagrant 1 foul after his right elbow struck Grant Williams in the face."}
{"game_id": "0022100378", "chunk_id": "0022100378_025", "order": 25, "role": "body", "text": "Boston finished 9 of 13 from the floor and made all four of his free throws to go with four steals. He strummed an air guitar after making one of his 3s."}
{"game_id": "0022100378", "chunk_id": "0022100378_026", "order": 26, "role": "body", "text": "“We've got to respect everybody,” Schröder said. “He came in and busted our (tails). He won them the game.”"}
{"game_id": "0022100378", "chunk_id": "0022100378_028", "order": 28, "role": "body", "text": "Celtics: Closed out a back-to-back in LA after losing to the Lakers by 15 points on Tuesday."}
{"game_id": "0022100378", "chunk_id": "0022100378_029", "order": 29, "role": "body", "text": "Clippers: Boston joined Eric Gordon and Lamar Odom as the only Clippers age 20 or younger to score at least 27 points in a game. ... Batum returned to the starting lineup after entering the NBA’s health and safety protocol on Nov. 19. He was scoreless in 15 minutes and left with a right ankle injury. ... Justise Winslow saw his first action in a week, playing one minute."}
{"game_id": "0022100378", "chunk_id": "0022100378_031", "order": 31, "role": "body", "text": "Celtics: Visit the Phoenix Suns on Friday to conclude a five-game western trip."}
{"game_id": "0022100378", "chunk_id": "0022100378_032", "order": 32, "role": "body", "text": "Clippers: Host the Orlando Magic on Saturday."}
