{"game_id": "0022100358", "chunk_id": "0022100358_001", "order": 1, "role": "lead", "text": "MILWAUKEE -- — Giannis Antetokounmpo came back from a two-game absence and scored 27 points on his 27th birthday to help the Milwaukee Bucks defeat the Cleveland Cavaliers 112-104 on Monday night."}
{"game_id": "0022100358", "chunk_id": "0022100358_002", "order": 2, "role": "body", "text": "The two-time MVP made all three of his 3-point attempts and also had 12 rebounds in his return from a sore right calf as the Bucks won for the 10th time in 11 games. He scored 15 points in the fourth quarter."}
{"game_id": "0022100358", "chunk_id": "0022100358_003", "order": 3, "role": "body", "text": "“Guys are playing with confidence, playing together,\" said Antetokounmpo, who went 6 of 7 on free throws. “We're guarding together. We’re in a very, very good spot right now.”"}
{"game_id": "0022100358", "chunk_id": "0022100358_004", "order": 4, "role": "body", "text": "Milwaukee split the two games it played without Antetokounmpo, losing 97-93 at Toronto and rolling to a 124-102 home victory over Miami."}
{"game_id": "0022100358", "chunk_id": "0022100358_005", "order": 5, "role": "body", "text": "The Bucks broke a 29-all tie with seven straight points early in the second quarter and stayed ahead the rest of the way, though Cleveland made the Bucks work for it."}
{"game_id": "0022100358", "chunk_id": "0022100358_006", "order": 6, "role": "body", "text": "After trailing by as many as 13, the Cavaliers got the margin down to two in the fourth quarter. Cedi Osman missed a 3-point attempt with 6:14 left that would have given Cleveland its first lead since late in the first quarter."}
{"game_id": "0022100358", "chunk_id": "0022100358_007", "order": 7, "role": "body", "text": "Milwaukee's Bobby Portis got the rebound off Osman's missed shot. Khris Middleton then found Jrue Holiday, who hit a 3-pointer on the other end to extend the Bucks’ lead to 101-96 with 6:04 remaining."}
{"game_id": "0022100358", "chunk_id": "0022100358_008", "order": 8, "role": "body", "text": "It didn’t drop below five the rest of the way."}
{"game_id": "0022100358", "chunk_id": "0022100358_009", "order": 9, "role": "body", "text": "“I thought that pass and that shot might have been the biggest kind of swing because it was hanging there at two for a while,” Bucks coach Mike Budenholzer said. “We needed a play from somebody.”"}
{"game_id": "0022100358", "chunk_id": "0022100358_010", "order": 10, "role": "body", "text": "Holiday had 20 points, eight assists and seven rebounds. Khris Middleton provided 21 points and eight assists. Pat Connaughton scored 12, and Bobby Portis had 10 points and 16 rebounds."}
{"game_id": "0022100358", "chunk_id": "0022100358_011", "order": 11, "role": "body", "text": "The Bucks are undefeated this season when Antetokounmpo, Middleton and Holiday are all in the lineup."}
{"game_id": "0022100358", "chunk_id": "0022100358_012", "order": 12, "role": "body", "text": "Jarrett Allen led the Cavaliers with 25 points and nine rebounds while shooting 10 of 12. Lauri Markkanen scored 20, Kevin Love 15, Evan Mobley 12 and Darius Garland 10."}
{"game_id": "0022100358", "chunk_id": "0022100358_013", "order": 13, "role": "body", "text": "The Cavaliers were playing one night after a 109-108 loss to Utah that snapped a four-game winning streak. Although they dropped each of the last two games, they still saw reason for encouragement."}
{"game_id": "0022100358", "chunk_id": "0022100358_014", "order": 14, "role": "body", "text": "“We’re going to fight till the end,” Allen said. “That’s the main thing I learned about this team, about the guys. No matter how we start the game, no matter who’s in front of us, big or small, we’re going to go out there and fight till the end. You look at these last two games, we came out flat in both of them. We could have just rolled over and gave the game up easily, but we came back and tried to stay in it till the end.”"}
{"game_id": "0022100358", "chunk_id": "0022100358_015", "order": 15, "role": "body", "text": "Milwaukee has beaten the Cavaliers eight straight times. The Bucks are 43-4 against Central Division opponents since Budenholzer took over as coach in 2018."}
{"game_id": "0022100358", "chunk_id": "0022100358_017", "order": 17, "role": "body", "text": "Cavaliers: Garland entered the night having scored more than 30 points in each of his last two games, but he cooled off Monday and shot just 3 of 12. ... Allen was one rebound shy of his eighth consecutive double-double."}
{"game_id": "0022100358", "chunk_id": "0022100358_018", "order": 18, "role": "body", "text": "Bucks: Donte DiVincenzo was briefly assigned to the Wisconsin Herd, the Bucks’ NBA G League affiliate, to get some practice sessions as he works his way back from a torn left ankle ligament. DiVincenzo hasn’t played since injuring the ankle in a first-round playoff series against Miami last season. Budenholzer said DiVincenzo “continues to do well and probably exceed our expectations” but didn’t offer a timeline for the former Villanova star’s potential return. ... George Hill missed a second straight game due to hyperextension in his right knee"}
{"game_id": "0022100358", "chunk_id": "0022100358_020", "order": 20, "role": "body", "text": "Cavaliers: Host the Chicago Bulls on Wednesday."}
{"game_id": "0022100358", "chunk_id": "0022100358_021", "order": 21, "role": "body", "text": "Bucks: At the Miami Heat on Wednesday in the first of four straight road games."}
