{"game_id": "0022101206", "chunk_id": "0022101206_001", "order": 1, "role": "lead", "text": "TORONTO -- — Pascal Siakam had 29 points and 12 rebounds, Gary Trent Jr. made the winning layup with 4.8 seconds left and the Toronto Raptors beat the Houston Rockets 117-115 on Friday night."}
{"game_id": "0022101206", "chunk_id": "0022101206_002", "order": 2, "role": "body", "text": "Trent added 26 points for the Raptors in their home finale. With one game left in the regular season, they will be no worse than the fifth seed in the Eastern Conference."}
{"game_id": "0022101206", "chunk_id": "0022101206_003", "order": 3, "role": "body", "text": "“Every game we go out and play, they’re meaningful,” Trent said. “Whether it’s going on our record or not, it’s preparing yourself mentally and going through moves and emotions of what you’re gonna need in a week or two or in the next week. You try to stay assertive, keep a rhythm going into the little break before playoffs.”"}
{"game_id": "0022101206", "chunk_id": "0022101206_004", "order": 4, "role": "body", "text": "There was speculation about giving Siakam and Trent a night off to rest for the playoffs, but they wanted to play."}
{"game_id": "0022101206", "chunk_id": "0022101206_005", "order": 5, "role": "body", "text": "“Yeah, it was a good thing they did,” Raptors coach Nick Nurse said. “They were providing a lot of leadership and offense. I was doing a lot of searching tonight, as you could tell but got there in the end.”"}
{"game_id": "0022101206", "chunk_id": "0022101206_006", "order": 6, "role": "body", "text": "The Raptors finished with a 24-17 record at home, while the last-place Rockets lost their sixth in a row and finished with NBA-worst 9-32 road record."}
{"game_id": "0022101206", "chunk_id": "0022101206_007", "order": 7, "role": "body", "text": "Kevin Porter Jr. had 35 points and 10 rebounds for Houston. Josh Anderson added 20 points."}
{"game_id": "0022101206", "chunk_id": "0022101206_008", "order": 8, "role": "body", "text": "The Rockets led 53-29 early in the second quarter. But with Siakam scoring 13 points late in the first half, the Raptors closed to 66-57."}
{"game_id": "0022101206", "chunk_id": "0022101206_009", "order": 9, "role": "body", "text": "He was coming off his third career triple-double in Toronto’s win over Philadelphia on Thursday night."}
{"game_id": "0022101206", "chunk_id": "0022101206_010", "order": 10, "role": "body", "text": "The Raptors shot the ball much better to start the second half. Trent’s 3-pointer capped a 21-12 run that tied it at 78 with 5:32 remaining in the third quarter."}
{"game_id": "0022101206", "chunk_id": "0022101206_011", "order": 11, "role": "body", "text": "The Rockets led 95-85 after three quarters."}
{"game_id": "0022101206", "chunk_id": "0022101206_012", "order": 12, "role": "body", "text": "“Their length, their size and their physicality wore us down,” Houston coach Stephen Silas said."}
{"game_id": "0022101206", "chunk_id": "0022101206_013", "order": 13, "role": "body", "text": "“They’re a unique team. They have guys who can play so many different positions. (Raptors rookie) Scottie Barnes took the opening jump, and then he was guarding Kevin Porter at the half-court.”"}
{"game_id": "0022101206", "chunk_id": "0022101206_015", "order": 15, "role": "body", "text": "Rockets: Built a 36-20 first-quarter lead on 15 of 23 field-goal shooting, including Porter’s 3 of 4 in 3-point attempts. ... A technical foul on Jae’Sean Tate early in the third quarter allowed Toronto to pull to 72-70."}
{"game_id": "0022101206", "chunk_id": "0022101206_016", "order": 16, "role": "body", "text": "Raptors: G Fred VanVleet (sore right knee) missed a second straight game, but Nurse said he is expected to play on Sunday ... F Yuta Watanabe (left quadriceps) returned after a four-game absence. ... G OG Anunoby (right quad contusion) missed his fourth consecutive game."}
{"game_id": "0022101206", "chunk_id": "0022101206_018", "order": 18, "role": "body", "text": "Rockets: Host Atlanta on Sunday."}
{"game_id": "0022101206", "chunk_id": "0022101206_019", "order": 19, "role": "closing", "text": "Raptors: At New York on Sunday night."}
