{"game_id": "0022100800", "chunk_id": "0022100800_001", "order": 1, "role": "lead", "text": "PORTLAND, Ore. -- — Bobby Portis Jr. had a season-high 30 points, including six 3-pointers, and the Milwaukee Bucks handed the Portland Trail Blazers their fifth straight loss, 137-108 on Saturday night."}
{"game_id": "0022100800", "chunk_id": "0022100800_002", "order": 2, "role": "body", "text": "Giannis Antetokounmpo had 29 points, with a season-high four 3-pointers, and nine rebounds. He has scored at least 25 points in each of his 18 games since Christmas, the third-longest streak in Bucks' history."}
{"game_id": "0022100800", "chunk_id": "0022100800_003", "order": 3, "role": "body", "text": "Portis was 11 of 13 from the field and 6 of 8 from 3-point range for the Bucks, who have won six straight against the Blazers. Both Portis and Antetokounmpo went to the bench with the Bucks in front 107-75 after three quarters, giving them a break before the team visits the Clippers on Sunday."}
{"game_id": "0022100800", "chunk_id": "0022100800_004", "order": 4, "role": "body", "text": "“Sometimes I need to encourage him to shoot when he's open. Tonight he needed no encouragement once he made a couple. I love it when he's that aggressive, that confident and willing to just let it fly. He was special tonight,” Bucks coach Mike Budenholzer said about Portis."}
{"game_id": "0022100800", "chunk_id": "0022100800_005", "order": 5, "role": "body", "text": "Portis said he wasn't doing anything different."}
{"game_id": "0022100800", "chunk_id": "0022100800_006", "order": 6, "role": "body", "text": "“I shot the same shots I’ve been shooting the last couple of weeks. Some decided they’d go in the last couple of games,” he said. “I’m just going out there being myself and having fun, being spirited.”"}
{"game_id": "0022100800", "chunk_id": "0022100800_007", "order": 7, "role": "body", "text": "The Bucks' 137 total points were a season best. They also had a season-high 36 assists."}
{"game_id": "0022100800", "chunk_id": "0022100800_008", "order": 8, "role": "body", "text": "Anfernee Simons and Ben McLemore each had 19 points for the Blazers, who were coming off a 96-93 loss to the Oklahoma City Thunder a night earlier. Simons didn't play the fourth quarter."}
{"game_id": "0022100800", "chunk_id": "0022100800_009", "order": 9, "role": "body", "text": "The Bucks led nearly from start to finish against the Blazers, who are in the midst of a shakeup following a five-player trade with the Clippers on Friday that sent Norman Powell and Robert Covington to Los Angeles."}
{"game_id": "0022100800", "chunk_id": "0022100800_010", "order": 10, "role": "body", "text": "Portland's new additions, Justise Winslow, Eric Bledsoe and Keon Johnson, were officially listed as questionable against the Bucks. But the team said shortly before tipoff that Winslow would be available, but Johnson and (ankle) and Bledsoe (Achilles) are nursing injuries."}
{"game_id": "0022100800", "chunk_id": "0022100800_011", "order": 11, "role": "body", "text": "Winslow came into the game for the Blazers at the midway point of the opening quarter and finished with six points."}
{"game_id": "0022100800", "chunk_id": "0022100800_012", "order": 12, "role": "body", "text": "The Blazers remained without Damian Lillard, out indefinitely after abdominal surgery, and Larry Nance, Jr. because of right knee inflammation."}
{"game_id": "0022100800", "chunk_id": "0022100800_013", "order": 13, "role": "body", "text": "Milwaukee, the defending NBA champions, were 2-1 on the team's recent homestand and currently sit in fourth in the Eastern Conference standings."}
{"game_id": "0022100800", "chunk_id": "0022100800_014", "order": 14, "role": "body", "text": "Antetokounmpo made three consecutive 3-pointers and the Bucks jumped out to an early 21-11 lead. They stretched it to as many as 18 points and went into the half ahead 70-54. The Bucks led by as many as 34 points in the game."}
{"game_id": "0022100800", "chunk_id": "0022100800_015", "order": 15, "role": "body", "text": "Milwaukee’s George Hill missed his third game with neck soreness."}
{"game_id": "0022100800", "chunk_id": "0022100800_017", "order": 17, "role": "body", "text": "Bucks: The Bucks signed 6-11 center Greg Moore to a 10-day contract earlier Saturday. Moore has also played on 10-day deals with the Timberwolves and Wizards this season. He previously played for the Bucks from 2015-17. “He's a proven pro, veteran, has some relationships, some familiarity with guys in our locker room and we felt like he fit a lot of things that we need,\" Budenholzer said."}
{"game_id": "0022100800", "chunk_id": "0022100800_018", "order": 18, "role": "body", "text": "Trail Blazers: Bledsoe, who hadn't missed a game for the Clippers this season, was listed out with left Achilles tendinopathy. ... Jusuf Nurkic had 11 points and 10 rebounds for his 27th double-double of the season."}
{"game_id": "0022100800", "chunk_id": "0022100800_020", "order": 20, "role": "body", "text": "Nurkic was asked afterward his thoughts on the direction the franchise is taking with the recent moves. He responded: “Interesting.”"}
{"game_id": "0022100800", "chunk_id": "0022100800_021", "order": 21, "role": "body", "text": "The Blazers are in 10th place in the Western Conference and hopes of even making a play-in berth in the postseason seem to be fading."}
{"game_id": "0022100800", "chunk_id": "0022100800_022", "order": 22, "role": "body", "text": "“I think we understand that we're not going the direction we all wanted, but I think the team, organization, is taking steps they think is the best for the team,\" he said."}
{"game_id": "0022100800", "chunk_id": "0022100800_024", "order": 24, "role": "body", "text": "Bucks: Visit the Los Angeles Clippers on Sunday night."}
{"game_id": "0022100800", "chunk_id": "0022100800_025", "order": 25, "role": "body", "text": "Trail Blazers: Host Orlando on Tuesday."}
