{"game_id": "0022100711", "chunk_id": "0022100711_001", "order": 1, "role": "lead", "text": "HOUSTON -- — Joel Embiid had 31 points and eight rebounds to lead the Philadelphia 76ers over the Houston Rockets 111-91 Monday night for their seventh straight win."}
{"game_id": "0022100711", "chunk_id": "0022100711_002", "order": 2, "role": "body", "text": "Embiid turned in his seventh straight 30-point game and also had six assists. He was 9 of 16 from the field and made all 13 of his free throws."}
{"game_id": "0022100711", "chunk_id": "0022100711_003", "order": 3, "role": "body", "text": "He’s the second player in NBA history to score exactly 31 points in four straight games. Bob McAdoo was the first to do it for the Buffalo Braves in November 1973. Embiid entered Monday averaging 26.8 points per game, sixth in the NBA."}
{"game_id": "0022100711", "chunk_id": "0022100711_004", "order": 4, "role": "body", "text": "“I hold myself to that standard of trying to win and be the best, or one of the best, ever,” Embiid said. “The good thing about it is, we’ve been winning. To be able to win every single night, I’ve got to show up.”"}
{"game_id": "0022100711", "chunk_id": "0022100711_005", "order": 5, "role": "body", "text": "Philadelphia has the longest winning streak in the Eastern Conference and the second-longest in the NBA behind Memphis’ nine-game string."}
{"game_id": "0022100711", "chunk_id": "0022100711_006", "order": 6, "role": "body", "text": "“We’ve had to do it a lot of different ways,” 76ers coach Doc Rivers said. “Right before this streak started, I said this team was about to get rolling. You could just feel it. Our guys have finally found a way to play no matter who is on the floor."}
{"game_id": "0022100711", "chunk_id": "0022100711_007", "order": 7, "role": "body", "text": "“It’s also nice that our best player is playing dominating basketball right now.”"}
{"game_id": "0022100711", "chunk_id": "0022100711_008", "order": 8, "role": "body", "text": "Andre Drummond had 13 points and 11 rebounds off the bench for Philadelphia, Tobias Harris also had 13 points, Furkan Korkmaz had 12, and Matisse Thybulle and Isaiah Joe both added 10."}
{"game_id": "0022100711", "chunk_id": "0022100711_009", "order": 9, "role": "body", "text": "Philadelphia was playing without Seth Curry, who was dealing with left ankle soreness. Danny Green started in Curry’s place and scored five points in 20 minutes."}
{"game_id": "0022100711", "chunk_id": "0022100711_010", "order": 10, "role": "body", "text": "“We didn’t have much of a pick-and-roll game without our guards,” Rivers said. “I just thought Joel set the tone on a night where we had a lot of guys out.\""}
{"game_id": "0022100711", "chunk_id": "0022100711_011", "order": 11, "role": "body", "text": "Philadelphia led 36-27 after the first quarter and 62-50 at halftime."}
{"game_id": "0022100711", "chunk_id": "0022100711_012", "order": 12, "role": "body", "text": "Christian Wood and Jalen Green each scored 14 points for Houston. Josh Christopher had 13 and Daniel Theis added 12."}
{"game_id": "0022100711", "chunk_id": "0022100711_013", "order": 13, "role": "body", "text": "The Rockets were without shooting guard Eric Gordon, who was dealing with right groin tightness."}
{"game_id": "0022100711", "chunk_id": "0022100711_014", "order": 14, "role": "body", "text": "Houston had 21 turnovers, and the Sixers made them pay, scoring 29 points off turnovers and 11 points in transition. Philadelphia also outscored Houston 56-28 in the paint."}
{"game_id": "0022100711", "chunk_id": "0022100711_015", "order": 15, "role": "body", "text": "“Their size, obviously, was an issue, our decision-making wasn’t great at all,” Rockets coach Stephen Silas said. “We turned the ball over, and we just made a lot of young mistakes tonight.”"}
{"game_id": "0022100711", "chunk_id": "0022100711_016", "order": 16, "role": "body", "text": "The struggling Rockets have lost 11 of 12 and fell to 11-31 just past the season’s halfway point."}
{"game_id": "0022100711", "chunk_id": "0022100711_018", "order": 18, "role": "body", "text": "76ers: Curry tweaked his ankle in Friday’s win over San Antonio but stayed in the game. ... Tyrese Maxey and Paul Reed remained out for the NBA healthy and safety protocols, and Jaden Springer missed with a non-COVID-19 illness."}
{"game_id": "0022100711", "chunk_id": "0022100711_019", "order": 19, "role": "body", "text": "Rockets: C Alperen Sengun missed a sixth straight game with a right ankle sprain. ... Armoni Brooks (health and safety protocols) was out. ... Trevelin Queen (personal reasons) was also out."}
{"game_id": "0022100711", "chunk_id": "0022100711_021", "order": 21, "role": "body", "text": "Houston’s Kevin Porter Jr. was ejected after being issued a flagrant foul 2 with less than five minutes remaining in the fourth quarter. Porter fouled Charlie Brown Jr. on a layup in transition, and the foul was quickly deemed a flagrant 2 after official review of the play."}
{"game_id": "0022100711", "chunk_id": "0022100711_023", "order": 23, "role": "body", "text": "Rivers had high praise for Drummond, the former All-Star center who signed with Philadelphia last summer on a one-year deal at the veteran’s minimum."}
{"game_id": "0022100711", "chunk_id": "0022100711_024", "order": 24, "role": "body", "text": "“Drum has been playing so well for us,” Rivers said. “It’s so good to see. You look at this guy, who last year couldn’t get on the floor. Now, you watch him play, and he’s happy and playing hard. And he’s been great in the locker room, too. Just a great addition for us.”"}
{"game_id": "0022100711", "chunk_id": "0022100711_026", "order": 26, "role": "body", "text": "76ers: Host Charlotte on Wednesday."}
{"game_id": "0022100711", "chunk_id": "0022100711_027", "order": 27, "role": "body", "text": "Rockets: Visit San Antonio on Wednesday."}
