{"game_id": "0022100262", "chunk_id": "0022100262_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Callif. -- — Tyrese Maxey had 24 points and the short-handed Philadelphia 76ers beat Sacramento 102-94 on Monday night, spoiling Alvin Gentry’s debut as interim Kings coach."}
{"game_id": "0022100262", "chunk_id": "0022100262_002", "order": 2, "role": "body", "text": "Shake Milton scored 16 points and Matisse Thybulle added 15, helping the Sixers to their second win in eight games. Andre Drummond had nine points and 23 rebounds."}
{"game_id": "0022100262", "chunk_id": "0022100262_003", "order": 3, "role": "body", "text": "“Guys stepped up tonight,” Maxey said. “We really buckled down defensively in the last four minutes. We got so many consecutive stops and guys like Shake hit big shots late. It was just a team collective effort.”"}
{"game_id": "0022100262", "chunk_id": "0022100262_004", "order": 4, "role": "body", "text": "Sixers coach Doc Rivers was forced to juggle his roster yet again to make up for missing players. Philadelphia, already minus Joel Embiid and Ben Simmons, also played without Tobias Harris (left hip) and Seth Curry (back tightness)."}
{"game_id": "0022100262", "chunk_id": "0022100262_005", "order": 5, "role": "body", "text": "Maxey helped the team overcome those absences despite a rough night from the floor. The 76ers’ guard shot 8 of 22 and came up empty on four attempts beyond the arc."}
{"game_id": "0022100262", "chunk_id": "0022100262_006", "order": 6, "role": "body", "text": "But he had six points as part of Philadelphia’s fourth-quarter blitz. Milton and Georges Niang also scored six during the decisive surge."}
{"game_id": "0022100262", "chunk_id": "0022100262_007", "order": 7, "role": "body", "text": "“Like I said before the game, we can get it to the fourth quarter, we felt like we had a chance to win,” Rivers said. “They went up (nine), we didn’t let go of the rope. We got to the last six minutes and we didn’t know who was going to make the bucket but we played great defense and we executed offensively and the ball found the open guy. That’s a good lesson for us.”"}
{"game_id": "0022100262", "chunk_id": "0022100262_008", "order": 8, "role": "body", "text": "Philadelphia’s defense made the biggest difference down the stretch, limiting the Kings to 12 points in the fourth quarter. Drummond, who had three blocks, played a big role with three rebounds over the final two minutes while controlling the middle."}
{"game_id": "0022100262", "chunk_id": "0022100262_009", "order": 9, "role": "body", "text": "“Staying the course is what we’re doing right now, just holding on as long as we can until everybody gets back,” Drummond said."}
{"game_id": "0022100262", "chunk_id": "0022100262_010", "order": 10, "role": "body", "text": "De’Aaron Fox had 23 points and Buddy Hield scored 21 for the Kings."}
{"game_id": "0022100262", "chunk_id": "0022100262_011", "order": 11, "role": "body", "text": "Gentry was promoted to interim coach after the Kings fired Luke Walton on Sunday. Gentry most recently served as head coach for the New Orleans Pelicans (2015-20). He’s also had head coaching stops with Miami, Detroit, the Los Angeles Clippers and Phoenix."}
{"game_id": "0022100262", "chunk_id": "0022100262_012", "order": 12, "role": "body", "text": "Not much looked different, however, as Sacramento again had trouble finishing."}
{"game_id": "0022100262", "chunk_id": "0022100262_013", "order": 13, "role": "body", "text": "The Kings led by nine early in the fourth quarter but were outscored 25-8 over the final 9:45, extending their losing streak against the 76ers to seven games."}
{"game_id": "0022100262", "chunk_id": "0022100262_014", "order": 14, "role": "body", "text": "“Bottom line, you have to step up and make shots,” Gentry said. “We got some good looks at it and we didn’t make them. That’s where we’ve kind of struggled. We played a team that had a lot of their starters missing and we didn’t get the job done.”"}
{"game_id": "0022100262", "chunk_id": "0022100262_016", "order": 16, "role": "body", "text": "76ers: Philadelphia matched its season low with seven turnovers that led to just six points. ... Isaiah Joe had 11 points in 17 minutes off the bench. … The Sixers have used 10 different starting lineups in 18 games."}
{"game_id": "0022100262", "chunk_id": "0022100262_017", "order": 17, "role": "body", "text": "Kings: Tristan Thompson had eight points in the third quarter, including a one-handed putback dunk. … Richaun Holmes scored 10 of his 18 points in the third as well."}
{"game_id": "0022100262", "chunk_id": "0022100262_019", "order": 19, "role": "body", "text": "76ers: Face the Golden State Warriors on Wednesday."}
{"game_id": "0022100262", "chunk_id": "0022100262_020", "order": 20, "role": "body", "text": "Kings: Play the Portland Trail Blazers on Wednesday."}
