{"game_id": "0022100094", "chunk_id": "0022100094_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Jarrett Allen said the Cleveland Cavaliers are out to change how they're perceived around the NBA."}
{"game_id": "0022100094", "chunk_id": "0022100094_002", "order": 2, "role": "body", "text": "He wants them to be known as a “scrappy” team."}
{"game_id": "0022100094", "chunk_id": "0022100094_003", "order": 3, "role": "body", "text": "“We want to go into these games with people knowing they're going to have a fight on their hands,” Allen said. “Over the past few years it’s been like, ‘Oh, it’s the Cavs, it’s an off night.’ I’m just being honest, that’s how people looked at us. But know we want people to look at us and say, ‘We need to bring our A game.’”"}
{"game_id": "0022100094", "chunk_id": "0022100094_004", "order": 4, "role": "body", "text": "Allen brought his \"A game,” finishing with 24 points and 16 rebounds as the Cavaliers held off a frantic fourth-quarter rally by the Charlotte Hornets on Monday night for a 113-110 win and a positive ending to a five-game trip."}
{"game_id": "0022100094", "chunk_id": "0022100094_005", "order": 5, "role": "body", "text": "Lauri Markkanen scored 21 points, Evan Mobley added 15 points and 10 rebounds and Darius Garland had 16 points — including two clutch free throws with 14.9 seconds left — as the Cavaliers went 3-2 on the road."}
{"game_id": "0022100094", "chunk_id": "0022100094_006", "order": 6, "role": "body", "text": "“Bouncing back, we showed the fight we have,\" Markannen said of the Cavs snapping a two-game skid to improve to 4-4 on the season. \"We knew it was a tough trip and we just tried to stay in the moment. I thought we should have won one more, but I think 3-2 was still a pretty good trip.”"}
{"game_id": "0022100094", "chunk_id": "0022100094_007", "order": 7, "role": "body", "text": "LaMelo Ball finished with 30 points and Terry Rozier added 23 for Charlotte, which overcame a sloppy first half to cut a 17-point fourth-quarter deficit to two before falling short."}
{"game_id": "0022100094", "chunk_id": "0022100094_008", "order": 8, "role": "body", "text": "The Cavaliers took advantage of eight Charlotte turnovers in the first quarter to jump out to a 40-21 lead. By halftime, the Hornets had turned it over 13 times, leading to 22 Cleveland points and trailed by 16."}
{"game_id": "0022100094", "chunk_id": "0022100094_010", "order": 10, "role": "body", "text": "The Hornets trailed 101-84 with seven minutes remaining before Rozier and Ball ignited a 10-0 run. Ball then knocked down a pull-up 3-pointer off a fastbreak with 1:01 to play to trim Cleveland's lead 3 and Rozier had a chance to tie the game on the next possession, but his 3-pointer from the right wing just grazed the front rim."}
{"game_id": "0022100094", "chunk_id": "0022100094_011", "order": 11, "role": "body", "text": "Charlotte would get as close as two on a drive by Rozier with 20 seconds left, but Garland's two free throws helped seal the win."}
{"game_id": "0022100094", "chunk_id": "0022100094_012", "order": 12, "role": "body", "text": "“They smelled blood,\" Markkanen said of the Hornets. “But I think we were able to do a good job of staying calm and going on to the next possession.”"}
{"game_id": "0022100094", "chunk_id": "0022100094_013", "order": 13, "role": "body", "text": "Charlotte coach James Borrego said he knew Cleveland's length would give his team problems, but said the game came down to too many “careless turnovers.”"}
{"game_id": "0022100094", "chunk_id": "0022100094_014", "order": 14, "role": "body", "text": "“We had eight turnovers in the first quarter and last night we had nine for the whole game,” Borrego said. “That is what created all the offense for them in the first quarter.\""}
{"game_id": "0022100094", "chunk_id": "0022100094_015", "order": 15, "role": "body", "text": "The Hornets (5-3) have trailed by at least 10 points in all but one of their eight games."}
{"game_id": "0022100094", "chunk_id": "0022100094_016", "order": 16, "role": "body", "text": "“We have been able to dig ourselves out of holes so far this season, but we can’t rely on doing that every night,” Borrego said. “It was a frustrating start to the game, but we won the second, third, and fourth quarters.”"}
{"game_id": "0022100094", "chunk_id": "0022100094_018", "order": 18, "role": "body", "text": "Cavaliers forward Kevin Love did not play after he was placed in the NBA’s health and safety protocols just hours before Monday night’s game. Love is averaging 9.9 points and 7.3 rebounds for Cleveland this season in a reserve role."}
{"game_id": "0022100094", "chunk_id": "0022100094_019", "order": 19, "role": "body", "text": "“It's a huge impact,\" Cavaliers coach J.B. Bickerstaff said. \"Not only Kevin as a player, but him as a person around the locker room and on the floor with the guys helping the young guys through a lot of the things that they are seeing. He makes their job easier as a basketball player. When the ball is in his hands, he is a threat.”"}
{"game_id": "0022100094", "chunk_id": "0022100094_021", "order": 21, "role": "body", "text": "Immediately after the game, Allen hit the weight room before meeting with reporters. “If I don’t get something in like that after a game my body is going to go downhill,” Allen said."}
{"game_id": "0022100094", "chunk_id": "0022100094_023", "order": 23, "role": "body", "text": "Cavaliers: Collin Sexton had 17 points and seven rebounds."}
{"game_id": "0022100094", "chunk_id": "0022100094_024", "order": 24, "role": "body", "text": "Hornets: Charlotte came in leading the league in 3-point field percentage at 41.5% but shot 15 of 39 (38.5%) against the Cavaliers."}
{"game_id": "0022100094", "chunk_id": "0022100094_026", "order": 26, "role": "body", "text": "Cavaliers: Host Portland on Wednesday night."}
{"game_id": "0022100094", "chunk_id": "0022100094_027", "order": 27, "role": "body", "text": "Hornets: Begin a five-game West Coast swing at Golden State on Wednesday night."}
