{"game_id": "0022100193", "chunk_id": "0022100193_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young and the Atlanta Hawks have struggled under the weight of increased expectations."}
{"game_id": "0022100193", "chunk_id": "0022100193_002", "order": 2, "role": "body", "text": "Finally, they looked like the team that made a surprising playoff run last season."}
{"game_id": "0022100193", "chunk_id": "0022100193_003", "order": 3, "role": "body", "text": "Young scored a season-best 42 points and the Atlanta Hawks snapped a six-game losing streak, beating the Milwaukee Bucks 120-100 on Sunday night in a rematch of struggling teams that met in the Eastern Conference final."}
{"game_id": "0022100193", "chunk_id": "0022100193_004", "order": 4, "role": "body", "text": "Young just missed a triple-double, finishing with 10 assists and eight rebounds to push the Hawks to a much-needed victory."}
{"game_id": "0022100193", "chunk_id": "0022100193_005", "order": 5, "role": "body", "text": "Young was 8 of 13 from beyond the 3-point stripe, and easily surpassed his previous season high of 32 points in an Oct. 25 victory over Detroit."}
{"game_id": "0022100193", "chunk_id": "0022100193_006", "order": 6, "role": "body", "text": "“We all know where want to be at,” Young said. “We know we've got to turn it around and get some wins.”"}
{"game_id": "0022100193", "chunk_id": "0022100193_007", "order": 7, "role": "body", "text": "Despite the return of two-time MVP Giannis Antetokounmpo, the reigning NBA champion Bucks lost for the seventh time in 10 games."}
{"game_id": "0022100193", "chunk_id": "0022100193_008", "order": 8, "role": "body", "text": "The Hawks were scuffling even more after their surprising playoff run, which took them all the way to the conference final before they lost to the Bucks in six games."}
{"game_id": "0022100193", "chunk_id": "0022100193_009", "order": 9, "role": "body", "text": "Atlanta came into Sunday's game having lost eight of nine, dropping five games below .500 and near the bottom of the conference standings."}
{"game_id": "0022100193", "chunk_id": "0022100193_010", "order": 10, "role": "body", "text": "Coach Nate McMillan conceded that his team is still adapting to its new role within the NBA hierarchy."}
{"game_id": "0022100193", "chunk_id": "0022100193_011", "order": 11, "role": "body", "text": "“That's something these guys are going through for the first time,” he said. \"Guys are learning what it's like when expectations are a little higher.\""}
{"game_id": "0022100193", "chunk_id": "0022100193_012", "order": 12, "role": "body", "text": "Antetokounmpo scored 26 points in his return to the lineup after missing Milwaukee's previous game with a sprained right ankle."}
{"game_id": "0022100193", "chunk_id": "0022100193_013", "order": 13, "role": "body", "text": "“I felt good,\" Antetokounmpo said. \"The ankle did not hurt as much as I expected.”"}
{"game_id": "0022100193", "chunk_id": "0022100193_014", "order": 14, "role": "body", "text": "But the Bucks never figured out a way to slow Young and the Hawks."}
{"game_id": "0022100193", "chunk_id": "0022100193_015", "order": 15, "role": "body", "text": "“We were standing and watching some tonight,” coach Mike Budenholzer said. “It takes everybody guarding the ball better.”"}
{"game_id": "0022100193", "chunk_id": "0022100193_016", "order": 16, "role": "body", "text": "Young had 27 points by halftime, hitting 7 of 10 outside the arc. He scored 10 of Atlanta's final 12 points in the first half, including back-to-back 3s, and assisted on the other basket in that run."}
{"game_id": "0022100193", "chunk_id": "0022100193_017", "order": 17, "role": "body", "text": "“He's a threat when he crosses half-court,” Antetokounmpo said."}
{"game_id": "0022100193", "chunk_id": "0022100193_018", "order": 18, "role": "body", "text": "The Hawks led by as many as 18 before settling for a 58-44 edge at the break."}
{"game_id": "0022100193", "chunk_id": "0022100193_019", "order": 19, "role": "body", "text": "The Bucks scored the first eight points of third quarter, but that was as close as they got."}
{"game_id": "0022100193", "chunk_id": "0022100193_020", "order": 20, "role": "body", "text": "Atlanta came out of a timeout with six straight points and never let Milwaukee get back in the game."}
{"game_id": "0022100193", "chunk_id": "0022100193_021", "order": 21, "role": "body", "text": "John Collins added 19 points for the Hawks, and Clint Capela had 13 rebounds."}
{"game_id": "0022100193", "chunk_id": "0022100193_022", "order": 22, "role": "body", "text": "That duo also did a solid job guarding Antetokounmpo, who grumbled about a couple of offensive foul calls."}
{"game_id": "0022100193", "chunk_id": "0022100193_023", "order": 23, "role": "body", "text": "“I've got to watch the clips, but I think they were moving,” the Bucks star said."}
{"game_id": "0022100193", "chunk_id": "0022100193_025", "order": 25, "role": "body", "text": "Hawks forward De’Andre Hunter will be out about eight weeks after a right wrist injury will require surgery."}
{"game_id": "0022100193", "chunk_id": "0022100193_026", "order": 26, "role": "body", "text": "The injury plagued Hunter, one of Atlanta's best defensive players, initially hurt the wrist last Monday at Golden State. He sat out the next game, then returned to play Friday at Denver."}
{"game_id": "0022100193", "chunk_id": "0022100193_027", "order": 27, "role": "body", "text": "He wasn't in uniform against the Bucks, with Kevin Huerter starting in his place and scoring 11 points."}
{"game_id": "0022100193", "chunk_id": "0022100193_028", "order": 28, "role": "body", "text": "Late Sunday, the Hawks sent out a statement saying an MRI revealed a tendon injury. Hunter will undergo surgery Monday in Los Angeles."}
{"game_id": "0022100193", "chunk_id": "0022100193_030", "order": 30, "role": "body", "text": "McMillan had been imploring his team to play at a faster pace, and they finally seemed to get the message."}
{"game_id": "0022100193", "chunk_id": "0022100193_031", "order": 31, "role": "body", "text": "Running as much as possible, the Hawks were able to get numerous baskets in transition."}
{"game_id": "0022100193", "chunk_id": "0022100193_032", "order": 32, "role": "body", "text": "“I think we've been playing the game way too slow,” Young said. “Pushing the pace will be a lot better for our team. It was great. Everybody was able to run and make plays.”"}
{"game_id": "0022100193", "chunk_id": "0022100193_033", "order": 33, "role": "body", "text": "McMillan also changed up the rotation a bit, giving Young a breather a little earlier than usual in the first quarter but putting him back on the court for the final 3 1/2 minutes of the period."}
{"game_id": "0022100193", "chunk_id": "0022100193_034", "order": 34, "role": "body", "text": "“I could come out and think about what we needed to do before I go back in and attack,\" he said."}
{"game_id": "0022100193", "chunk_id": "0022100193_036", "order": 36, "role": "body", "text": "Bucks: G George Hill was not in uniform because of back soreness. ... F Khris Middleton is expected to return Wednesday night against the Los Angeles Lakers after missing seven games. He has been subject to the league’s health and safety protocols after testing positive for COVID-19. ... Jrue Holiday had 19 points and Grayson Allen chipped in with 18."}
{"game_id": "0022100193", "chunk_id": "0022100193_037", "order": 37, "role": "body", "text": "Hawks: G Bogdan Bogdanovic (sore right ankle) was cleared to play after going through pregame workouts but managed just 6 points. ... General manager Alex Anthopoulos of the World Series champion Atlanta Braves attended the game."}
{"game_id": "0022100193", "chunk_id": "0022100193_039", "order": 39, "role": "body", "text": "Bucks: Host Los Angeles Lakers on Wednesday night to open a five-game homestand."}
{"game_id": "0022100193", "chunk_id": "0022100193_040", "order": 40, "role": "body", "text": "Hawks: Host Orlando on Monday night, the second of five straight home games."}
{"game_id": "0022100193", "chunk_id": "0022100193_042", "order": 42, "role": "body", "text": "Follow Paul Newberry on Twitter at https://twitter.com/pnewberry1963 and find his work at https://apnews.com/search/paulnewberry"}
