{"game_id": "0022100348", "chunk_id": "0022100348_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Terence Davis scored 23 of his 28 points in the second half and the Sacramento Kings beat the Los Angeles Clippers for the second time in four nights with a 104-99 victory Saturday."}
{"game_id": "0022100348", "chunk_id": "0022100348_002", "order": 2, "role": "body", "text": "Davis made all four of his 3-point attempts in the third quarter and finished 6 of 11 from beyond the arc."}
{"game_id": "0022100348", "chunk_id": "0022100348_003", "order": 3, "role": "body", "text": "“I think he’s getting a little more comfortable in stuff,\" Kings interim coach Alvin Gentry said. \"I think with him, the whole idea is behind what is a good shot and what is not, or when do you shoot it and when do you not shoot it. I think he did a good job tonight of picking those opportunities.\""}
{"game_id": "0022100348", "chunk_id": "0022100348_004", "order": 4, "role": "body", "text": "Tyrese Haliburton added 18 points, six rebounds and five assists for Sacramento, which beat the Clippers 124-115 on Wednesday in Los Angeles. De’Aaron Fox had 17 points, seven rebounds and five assists, and Marvin Bagley III recorded his first double-double of the season with 12 points and 11 rebounds."}
{"game_id": "0022100348", "chunk_id": "0022100348_005", "order": 5, "role": "body", "text": "“When you make shots, everybody’s feeling good,” Haliburton said. “It feels like you’re throwing a rock in the ocean. It feels like everybody’s going and everybody’s having fun. It definitely feels good for us and we’ve just got to keep this momentum going.”"}
{"game_id": "0022100348", "chunk_id": "0022100348_006", "order": 6, "role": "body", "text": "Marcus Morris Sr. led the Clippers with 21 points and nine rebounds. Reggie Jackson added 18 points."}
{"game_id": "0022100348", "chunk_id": "0022100348_007", "order": 7, "role": "body", "text": "Paul George had 15 points and nine assists, but shot just 5 of 21 from the field. Ivica Zubac had 12 points and 11 rebounds."}
{"game_id": "0022100348", "chunk_id": "0022100348_008", "order": 8, "role": "body", "text": "“Terence Davis comes in to make six 3s, big shots, and momentum killers,” Clippers coach Tyronn Lue said. “He had a great game — two great games. He was aggressive. Tonight he hurt us.”"}
{"game_id": "0022100348", "chunk_id": "0022100348_009", "order": 9, "role": "body", "text": "Sacramento used a 12-2 run early in the fourth quarter to open its biggest lead of the game at 90-76. Los Angeles answered with nine straight points to get within 90-85, but Davis' three-point play pushed the lead back to eight with 4:24 remaining."}
{"game_id": "0022100348", "chunk_id": "0022100348_010", "order": 10, "role": "body", "text": "Morris made a deep 3-pointer with 10.4 seconds remaining to cut the Kings’ lead to 102-99, but Buddy Hield made two free throws to seal the win."}
{"game_id": "0022100348", "chunk_id": "0022100348_011", "order": 11, "role": "body", "text": "Sacramento held the Clippers to just 38% shooting from the field, including 13 of 34 from 3-point range. The Kings shot 42%."}
{"game_id": "0022100348", "chunk_id": "0022100348_012", "order": 12, "role": "body", "text": "“I thought defensively, obviously, we were really good,” Gentry said. “We have to try to get to that consistent level where we’re doing it every night.”"}
{"game_id": "0022100348", "chunk_id": "0022100348_013", "order": 13, "role": "body", "text": "Los Angeles opened the game on a 9-2 run and led by as many as eight in the first half. Sacramento went on a 10-0 run late in the second quarter to take a 50-45 lead into halftime."}
{"game_id": "0022100348", "chunk_id": "0022100348_015", "order": 15, "role": "body", "text": "The Kings’ win marked their first home victory against the Clippers since March 19, 2013, snapping a 15-game losing streak."}
{"game_id": "0022100348", "chunk_id": "0022100348_017", "order": 17, "role": "body", "text": "Clippers: Nicolas Batum missed his eighth straight game in the league’s health and safety protocols, but Lue said that he was nearing a return. ... Morris was assessed a technical foul in the third quarter."}
{"game_id": "0022100348", "chunk_id": "0022100348_018", "order": 18, "role": "body", "text": "Kings: Harrison Barnes (right foot sprain) missed his fifth straight game and Moe Harkless (left knee soreness) missed his fourth straight. Gentry was hopeful both could play next game. ... Bagley returned to the lineup after missing two games with a non-COVID-19 illness. ... Chimezie Metu had a career-high five blocks."}
{"game_id": "0022100348", "chunk_id": "0022100348_020", "order": 20, "role": "body", "text": "Clippers: At Portland on Monday night."}
{"game_id": "0022100348", "chunk_id": "0022100348_021", "order": 21, "role": "body", "text": "Kings: Host Orlando on Wednesday night."}
