{"game_id": "0022100395", "chunk_id": "0022100395_001", "order": 1, "role": "lead", "text": "MEMPHIS, Tenn. -- — Dillon Brooks scored 25 points, Desmond Bane added 19 points and the Memphis Grizzlies held on for a 113-106 victory over the Houston Rockets on Saturday night."}
{"game_id": "0022100395", "chunk_id": "0022100395_002", "order": 2, "role": "body", "text": "Christian Wood had 22 points and 11 rebounds for Houston. Armoni Brooks provided a spark off the Houston bench, scoring 18 points. Alperen Sengu finished with 15 and Garrison Mathews added 12 points as the Rockets lost their second game in two nights."}
{"game_id": "0022100395", "chunk_id": "0022100395_003", "order": 3, "role": "body", "text": "Houston trailed by as many 21 points in the first half before cutting into Memphis’ advantage as the Grizzlies’ first-half shooting accuracy waned in the third quarter."}
{"game_id": "0022100395", "chunk_id": "0022100395_004", "order": 4, "role": "body", "text": "“Fatigue was a factor right from the start for us,” said Rockets coach Stephen Silas, whose team arrive in Memphis after a loss to Milwaukee on Friday. “I just felt it with our group. So I tried to sub liberally, try to mix and match.”"}
{"game_id": "0022100395", "chunk_id": "0022100395_005", "order": 5, "role": "body", "text": "Memphis started the second half by missing nine of its first 10 shots. That helped the Rockets cut their deficit to single digits."}
{"game_id": "0022100395", "chunk_id": "0022100395_006", "order": 6, "role": "body", "text": "The Rockets closed within six points on a couple of occasions in the fourth, but never caught Memphis."}
{"game_id": "0022100395", "chunk_id": "0022100395_007", "order": 7, "role": "body", "text": "“It got close,” Memphis coach Taylor Jenkins said. “The Rockets are playing really good basketball now. They are super competitive.”"}
{"game_id": "0022100395", "chunk_id": "0022100395_008", "order": 8, "role": "body", "text": "Both teams played without significant contributors, such as Ja Morant and Jaren Jackson Jr. for Memphis, and Eric Gordon, Jalen Green and Kevin Porter Jr. for the Rockets. Given those absences, Wood noted a variety of players stepped up."}
{"game_id": "0022100395", "chunk_id": "0022100395_009", "order": 9, "role": "body", "text": "“I’m very proud, especially with three of our key guys out,” the Rockets' forward said. “We just couldn’t close it out tonight, but I’m happy. No one is discouraged in the locker room.”"}
{"game_id": "0022100395", "chunk_id": "0022100395_010", "order": 10, "role": "body", "text": "Jenkins also saw a team that was ready, no matter who was called."}
{"game_id": "0022100395", "chunk_id": "0022100395_011", "order": 11, "role": "body", "text": "“When you just stay ready and you understand this is how we play Grizzlies basketball, it’s the expectation, no matter if you are 1-5,” Jenkins said. “It’s offense, defense, whatever is asked of you, just go out there and make the right play.”"}
{"game_id": "0022100395", "chunk_id": "0022100395_012", "order": 12, "role": "body", "text": "The game featured teams playing among the best in the league. Both entered the game 4-1 in December, the Grizzlies winning six of their last seven, and the Rockets going 6-2 over their last eight."}
{"game_id": "0022100395", "chunk_id": "0022100395_013", "order": 13, "role": "body", "text": "The night was also a celebration of former Grizzlies forward Zach Randolph, who was honored with having his number 50 retired, the first Memphis player to receive that recognition."}
{"game_id": "0022100395", "chunk_id": "0022100395_014", "order": 14, "role": "body", "text": "Memphis shot better than 60% through much of the first half and connected on close to 50% of its 3-pointers. That translated to a quick double-digit lead and a 63-47 advantage at halftime."}
{"game_id": "0022100395", "chunk_id": "0022100395_016", "order": 16, "role": "body", "text": "Rockets: Green missed his eighth game with a left hamstring strain. … D.J. Augustin started his first game of the season. … Houston is 1-12 on the road. Its other road win was Dec. 1 over Oklahoma City 114-110."}
{"game_id": "0022100395", "chunk_id": "0022100395_017", "order": 17, "role": "body", "text": "Grizzlies: F Jaren Jackson Jr. did not play due to left knee soreness. Jenkins said it was simply soreness and not something that concerns the team in the long term. … Kyle Anderson started in Jackson’s spot and hit all five of his shots in the first half. He finished with 16 points. ... Memphis is 7-1 since Ja Morant sprained his left knee in a Nov. 26 loss to Atlanta. … C Steven Adams suffered a left ankle sprain in the third quarter and did not return."}
{"game_id": "0022100395", "chunk_id": "0022100395_019", "order": 19, "role": "body", "text": "The Grizzlies honored Randolph, retiring his number 50, the first to receive such recognition in franchise history. And both coaches recalled Randolph’s influence on the game. “He’s a legend with the Grizzlies. He’s a legend in this community,” Jenkins said. “… Such a positive soul. A welcoming soul. But then you saw him on the court, and he was just nasty. Just epitomized the grit and grind.”"}
{"game_id": "0022100395", "chunk_id": "0022100395_020", "order": 20, "role": "body", "text": "Rockets coach Stephen Silas said he was honored to be playing the night the team honored Randolph because he “was one of my favorite (players).” Asked about any comparison to Randolph and Silas’ father, Paul Silas, the Rockets coach replied with a laugh: “Zbo could score a lot better than my dad. He loved how tough he was. He loved how he couldn’t jump just like my dad. There are just so many similarities.”"}
{"game_id": "0022100395", "chunk_id": "0022100395_022", "order": 22, "role": "body", "text": "Rockets: Travel to Atlanta to face the Hawks on Monday."}
{"game_id": "0022100395", "chunk_id": "0022100395_023", "order": 23, "role": "body", "text": "Grizzlies: Host Philadelphia 76ers on Monday."}
