{"game_id": "0022100932", "chunk_id": "0022100932_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — Darius Garland returned. The Cavaliers remain missing."}
{"game_id": "0022100932", "chunk_id": "0022100932_002", "order": 2, "role": "body", "text": "Terry Rozier scored 29 points and carried Charlotte's backcourt with LaMelo Ball in foul trouble, leading the Hornets to a 119-98 win on Wednesday night over a Cleveland team sliding and looking for answers."}
{"game_id": "0022100932", "chunk_id": "0022100932_003", "order": 3, "role": "body", "text": "The Cavaliers lost for the fifth time in six games, and suddenly a surprising season has turned sour."}
{"game_id": "0022100932", "chunk_id": "0022100932_004", "order": 4, "role": "body", "text": "“We're not playing the same way we did in the first half of the season,” said Garland, who has been slowed by a back bruise. “We've got to get back to that. We're playing soft. We're giving up 38 points in a quarter, that happened twice this week — that's unacceptable."}
{"game_id": "0022100932", "chunk_id": "0022100932_005", "order": 5, "role": "body", "text": "“We're not being ourselves right now.”"}
{"game_id": "0022100932", "chunk_id": "0022100932_006", "order": 6, "role": "body", "text": "Rozier added seven assists and seven rebounds, while Isaiah Thomas scored 10 points in his debut for Charlotte after signing a 10-day contract. The Hornets made 17 3-pointers, improved to just 3-11 since Jan. 28 and outrebounded the taller Cavs 45-37."}
{"game_id": "0022100932", "chunk_id": "0022100932_007", "order": 7, "role": "body", "text": "“When we make an effort on the boards, this is possible,” said Hornets coach James Borrego. \"They had two offensive rebounds until the very end. That kind of execution is what we need and I do think it’s sustainable.”"}
{"game_id": "0022100932", "chunk_id": "0022100932_008", "order": 8, "role": "body", "text": "The Cavs, who have been ravaged by injuries to their backcourt, welcomed back Garland after he missed three games with a bone bruise in his back. The first-time All-Star finished with 33 points in 33 minutes."}
{"game_id": "0022100932", "chunk_id": "0022100932_009", "order": 9, "role": "body", "text": "However, Garland couldn't help the Cavs from falling behind by 24 points in the third quarter — a recent trend — or slowing the Hornets, who came in as the NBA's top scoring team (114.1 points per game) and handed Cleveland its most lopsided loss this season."}
{"game_id": "0022100932", "chunk_id": "0022100932_010", "order": 10, "role": "body", "text": "“It is effort,\" Garland said. “It's tough to touch on right now, but I'm pretty sure we'll fix it soon.”"}
{"game_id": "0022100932", "chunk_id": "0022100932_011", "order": 11, "role": "body", "text": "Cleveland also lost coach J.B. Bickerstaff, who was slapped with two technical fouls and ejected by referee Natalie Sago in the third quarter. Bickerstaff was upset with several non-calls and made his case known before getting run."}
{"game_id": "0022100932", "chunk_id": "0022100932_012", "order": 12, "role": "body", "text": "Bickerstaff said he apologized to his players, his staff and kids following the game."}
{"game_id": "0022100932", "chunk_id": "0022100932_013", "order": 13, "role": "body", "text": "“That's me losing my composure,\" he said. “It's a combination of frustration, but I need to stay in the fight.”"}
{"game_id": "0022100932", "chunk_id": "0022100932_014", "order": 14, "role": "body", "text": "Cavs All-Star center Jarrett Allen appreciated his coach's gesture, but said wasn't necessary."}
{"game_id": "0022100932", "chunk_id": "0022100932_015", "order": 15, "role": "body", "text": "“It's hard to get mad at the guy when he's fighting for you,” said Allen, who had 18 points and 11 rebounds."}
{"game_id": "0022100932", "chunk_id": "0022100932_016", "order": 16, "role": "body", "text": "Ball averages 19.9 points, but played just eight minutes and missed all three shots. Rozier, though, more than made up for his absence and Thomas provided a spark after being signed to a 10-day contract earlier in the day."}
{"game_id": "0022100932", "chunk_id": "0022100932_017", "order": 17, "role": "body", "text": "“He never ceases to amaze me, the way he can put the ball in the basket,\" Rozier said of Thomas, his former teammate in Boston. \"With his leadership and his voice, he’s already making a difference in the locker room.”"}
{"game_id": "0022100932", "chunk_id": "0022100932_018", "order": 18, "role": "body", "text": "The Cavs were still within 12 in the fourth when Miles Bridges and Rozier buried 3-pointers to bury Cleveland. Bridges added 15 points, seven rebounds and six assists."}
{"game_id": "0022100932", "chunk_id": "0022100932_019", "order": 19, "role": "body", "text": "Garland initially got hurt on Jan. 9 and will likely have to deal with the injury for the rest of this season."}
{"game_id": "0022100932", "chunk_id": "0022100932_020", "order": 20, "role": "body", "text": "Bickerstaff said Garland has to watch his back — literally."}
{"game_id": "0022100932", "chunk_id": "0022100932_021", "order": 21, "role": "body", "text": "“In his position, you spend a lot of time with your back to people when you’re on the defensive end of the floor,” Bickerstaff said. “The game is a lot of pick-and-roll, and that’s the angle that a lot of those screens get set on, so you’re just cautious and aware of all of it to be honest with you.”"}
{"game_id": "0022100932", "chunk_id": "0022100932_023", "order": 23, "role": "body", "text": "Hornets: F Gordon Hayward (left ankle sprain), who is averaging 16.1 points, missed his ninth straight game. … F Jalen McDaniels (left ankle sprain) last played on Jan. 21 and G James Bouknight (neck soreness) missed his second game in a row. … Charlotte has a winning road record against all three divisions in the East."}
{"game_id": "0022100932", "chunk_id": "0022100932_024", "order": 24, "role": "body", "text": "Cavaliers: G Rajon Rondo (sprained toe) missed his third straight game and G Caris LeVert (sprained foot) sat out his fourth in a row. ... Cleveland was just 2 of 13 on 3-pointers in the first half and finished 10 of 31. ... Recently signed G Tim Frazier has now played for nine NBA franchises, three shy of the league record shared by five players."}
{"game_id": "0022100932", "chunk_id": "0022100932_026", "order": 26, "role": "body", "text": "Thin in the backcourt, the Hornets signed Thomas, who had 10-day deals earlier this season with the Lakers and Mavericks. The 33-year-old caught Charlotte's eye with a 46-point game recently against their G League team."}
{"game_id": "0022100932", "chunk_id": "0022100932_027", "order": 27, "role": "body", "text": "Borrego is thrilled to have Thomas aboard, especially to mentor Ball and the team's other young guards."}
{"game_id": "0022100932", "chunk_id": "0022100932_028", "order": 28, "role": "body", "text": "“Leadership, poise, confidence. He provides all of that,” Borrego said."}
{"game_id": "0022100932", "chunk_id": "0022100932_030", "order": 30, "role": "body", "text": "Hornets: Host San Antonio on Saturday."}
{"game_id": "0022100932", "chunk_id": "0022100932_031", "order": 31, "role": "body", "text": "Cavaliers: Visit Philadelphia on Friday, beginning a stretch of four road games in eight days."}
