{"game_id": "0022100701", "chunk_id": "0022100701_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Moritz Wagner scored 23 points, younger brother Franz Wagner added 18, and the Orlando Magic defeated the short-handed Chicago Bulls 114-95 on Sunday night."}
{"game_id": "0022100701", "chunk_id": "0022100701_002", "order": 2, "role": "body", "text": "DeMar DeRozan scored a season-high 41 points for Chicago, while Coby White had 22 points. Nikola Vucevic hit two of Chicago’s five 3-pointers and scored 13 points to go with his 13 rebounds before fouling out."}
{"game_id": "0022100701", "chunk_id": "0022100701_003", "order": 3, "role": "body", "text": "Ending a nine-game home losing streak, the Magic won at home for just the third time this season — and the first since Dec. 1. Orlando blew a 10-point halftime lead Wednesday in Philadelphia and an eight-point halftime edge Friday against the Los Angeles Lakers, so their focus was to avoid a similar fate after building an 11-point halftime lead."}
{"game_id": "0022100701", "chunk_id": "0022100701_004", "order": 4, "role": "body", "text": "“We work so hard in the first half, which we’ve done in the past, but we have to do a better job of trying to break the other team and not give them life,” said Moritz Wagner, who made 9 of 13 shots."}
{"game_id": "0022100701", "chunk_id": "0022100701_005", "order": 5, "role": "body", "text": "Wendell Carter Jr. had 19 points and seven rebounds for an Orlando team that led by as much as 20 points in the second half and had to withstand a third-quarter run by the Bulls. Rookie Jalen Suggs added 15 points, seven assists and two thunderous second-half dunks to steady the Magic. Orlando had a 51-10 advantage in bench points."}
{"game_id": "0022100701", "chunk_id": "0022100701_006", "order": 6, "role": "body", "text": "DeRozan scored at least 30 points for the 12th time this season, but the Bulls dropped to 9-3 in those games. Chicago had just nine players available, and it had only 10 assists compared to 22 turnovers."}
{"game_id": "0022100701", "chunk_id": "0022100701_007", "order": 7, "role": "body", "text": "“They were the aggressor, start to finish,” Bulls coach Billy Donovan said."}
{"game_id": "0022100701", "chunk_id": "0022100701_008", "order": 8, "role": "body", "text": "It was DeRozan’s fourth game this season in which he scored at least 30 points without attempting a 3-pointer and the seventh time with 30 points and no 3-point makes — both NBA highs. But Chicago lost its second straight game, its seventh in the past nine and its fifth straight road game."}
{"game_id": "0022100701", "chunk_id": "0022100701_009", "order": 9, "role": "body", "text": "The Bulls are without Zach LaVine, Lonzo Ball, Javonte Green and Alex Caruso. He has a fractured wrist after he was hit midair by Milwaukee’s Grayson Allen, who was suspended one game without pay on Sunday by the NBA for the hit."}
{"game_id": "0022100701", "chunk_id": "0022100701_010", "order": 10, "role": "body", "text": "“It sucks with the bad luck that we’ve been hit with, losing (Caruso) and not having our key guys, it’s been rough,” DeRozan said. “But we’ve still got to go and compete. Hopefully we’re getting some of the cavalry (LaVine and Green) back tomorrow will definitely help us.”"}
{"game_id": "0022100701", "chunk_id": "0022100701_011", "order": 11, "role": "body", "text": "Orlando led 71-51 midway through the third quarter before Chicago ripped off 10 straight points. The Magic responded with 3-pointers from Brazdeikis and Okeke and an Anthony dunk."}
{"game_id": "0022100701", "chunk_id": "0022100701_012", "order": 12, "role": "body", "text": "Orlando took an 85-74 lead into the fourth period — just the ninth time all season it had the lead after three periods."}
{"game_id": "0022100701", "chunk_id": "0022100701_013", "order": 13, "role": "body", "text": "“(The Bulls) went on a little run and that was understood because basketball is a game of runs, but I was so happy for these guys to stand their ground,\" Magic coach Jamahl Mosley said."}
{"game_id": "0022100701", "chunk_id": "0022100701_015", "order": 15, "role": "body", "text": "Donovan said LaVine and Green worked out in Chicago on Sunday morning and are scheduled to fly to Oklahoma City on Monday. If all goes well, they could potentially play on Monday night against the Thunder."}
{"game_id": "0022100701", "chunk_id": "0022100701_016", "order": 16, "role": "body", "text": "LaVine, who ranks second on the Bulls in scoring at 24.9 points per game, hasn’t played since injuring his knee on Jan. 14 in a loss to Golden State."}
{"game_id": "0022100701", "chunk_id": "0022100701_017", "order": 17, "role": "body", "text": "“He’s been on the floor working the last few days. He’s doing well and I spoke to him yesterday for a little bit,” Donovan said of LaVine. “He’ll fly to Oklahoma City with Javonte and they’ll be reevaluated to see if those guys will be able to play.\""}
{"game_id": "0022100701", "chunk_id": "0022100701_019", "order": 19, "role": "body", "text": "Bulls: Caruso will have surgery on his right wrist Monday morning and is expected to miss 6-8 weeks. ... Vucevic banged his left kneecap on the floor in the fourth quarter but said he should be able to play on Monday."}
{"game_id": "0022100701", "chunk_id": "0022100701_020", "order": 20, "role": "body", "text": "Magic: Veterans Terrence Ross (knee soreness) and Gary Harris (back spasms) were scratched about two hours before tipoff. Since tying a franchise record with 20 consecutive points on Jan. 9, Ross has scored just 36 points over the past six games."}
{"game_id": "0022100701", "chunk_id": "0022100701_022", "order": 22, "role": "body", "text": "Bulls: At Oklahoma City on Monday night."}
{"game_id": "0022100701", "chunk_id": "0022100701_023", "order": 23, "role": "body", "text": "Magic: Host the Los Angeles Clippers on Wednesday night."}
