{"game_id": "0022100363", "chunk_id": "0022100363_001", "order": 1, "role": "lead", "text": "DALLAS -- — James Harden and the Brooklyn Nets were in danger of back-to-back losses for the first time this season, trailing Luka Doncic and the Dallas Mavericks by 17 points in the third quarter after blowing a double-digit lead against Chicago."}
{"game_id": "0022100363", "chunk_id": "0022100363_002", "order": 2, "role": "body", "text": "The Eastern Conference leaders responded during Harden's “go” time this time."}
{"game_id": "0022100363", "chunk_id": "0022100363_003", "order": 3, "role": "body", "text": "Kevin Durant scored 24 points, Harden had 23 points and 12 assists, and the Nets beat Dallas 102-99 on Tuesday night, handing the Mavericks their fifth consecutive home loss."}
{"game_id": "0022100363", "chunk_id": "0022100363_004", "order": 4, "role": "body", "text": "“We’ve been in this league long enough to know it’s winning time. It’s go time,” said Harden, who also had nine rebounds. “Throughout the course of the game, I feel like we got good shots. We just missed them. We just kept sticking with it and kept sticking with it. You’ve got to just keep shooting, especially if that’s what you do.”"}
{"game_id": "0022100363", "chunk_id": "0022100363_005", "order": 5, "role": "body", "text": "The Mavericks keep shooting — and missing."}
{"game_id": "0022100363", "chunk_id": "0022100363_006", "order": 6, "role": "body", "text": "Luka Doncic scored 28 points but had another rough night from 3-point range along with his teammates, except for the young sensation's 30-foot banked shot just before the first-half buzzer. Kristaps Porzingis had 17 points and 12 rebounds."}
{"game_id": "0022100363", "chunk_id": "0022100363_007", "order": 7, "role": "body", "text": "Harden easily beat Doncic one-on-one for a layup and Brooklyn’s biggest lead at 100-97 with 1:23 remaining. The Nets didn’t take their first lead until the middle of the fourth quarter."}
{"game_id": "0022100363", "chunk_id": "0022100363_008", "order": 8, "role": "body", "text": "Dallas didn't make a basket after Doncic's short jumper with 3:51 to go and finished 9 of 46 (19.6%) from long range. Tim Hardaway Jr. missed all seven from deep, including an open look that bounced off the back of the rim at the buzzer."}
{"game_id": "0022100363", "chunk_id": "0022100363_009", "order": 9, "role": "body", "text": "“We had a lot of open looks there in the fourth quarter that just didn’t go down,” Dallas coach Jason Kidd said. “And then Timmy has a wide-open look. You couldn’t ask for a better look to tie up the game.”"}
{"game_id": "0022100363", "chunk_id": "0022100363_010", "order": 10, "role": "body", "text": "The Nets trailed by 11 entering the fourth quarter before outscoring Dallas 27-13. Durant, who made 5 of 6 shots and scored 11 points in the final quarter, and Patty Mills hit consecutive 3s to cut a nine-point deficit to three early in the fourth. Mills scored 10 points."}
{"game_id": "0022100363", "chunk_id": "0022100363_011", "order": 11, "role": "body", "text": "“It's a character win where you just want to make the right plays to get back in the game and you want to turn the momentum to your side,” said Durant, who was 10 of 22 from the field and had seven rebounds. “I think we did that tonight.”"}
{"game_id": "0022100363", "chunk_id": "0022100363_012", "order": 12, "role": "body", "text": "Nic Claxton missed two free throws with Brooklyn leading by three with 20 seconds remaining, but Doncic missed from beyond the arc before Hardaway's miss. Doncic was 3 of 11 from deep."}
{"game_id": "0022100363", "chunk_id": "0022100363_013", "order": 13, "role": "body", "text": "The Mavericks (11-12) dropped below .500 for the first time since getting blown out by Atlanta in their opener despite the return of both Doncic and Porzingis. They both missed the previous loss to Memphis, the first time that's happened this season."}
{"game_id": "0022100363", "chunk_id": "0022100363_014", "order": 14, "role": "body", "text": "In three games since setting a franchise record by shooting 68.7% in a 32-point victory at New Orleans, Dallas is at 38%."}
{"game_id": "0022100363", "chunk_id": "0022100363_015", "order": 15, "role": "body", "text": "“Missed shots have been our narrative for a while now,” said Jalen Brunson, who had 10 points on 4-of-8 shooting. “But we’re getting the looks. We’re working on it. We’ve just to translate it to the game.”"}
{"game_id": "0022100363", "chunk_id": "0022100363_017", "order": 17, "role": "body", "text": "Nets: James Johnson had 12 points on 5-of-7 shooting against his former team. Johnson started the 2020-21 season in Dallas before a trade to New Orleans. He signed with Brooklyn as a free agent. ... LaMarcus Aldridge, playing in his hometown, had 15 points."}
{"game_id": "0022100363", "chunk_id": "0022100363_018", "order": 18, "role": "body", "text": "Mavericks: Doncic was called for a technical foul after he shoved Claxton in front of an official in the third quarter. Doncic appeared to think Claxton was crowding him after the whistle. Doncic tried to show his displeasure by sitting in an open courtside seat as Durant went to the other end to shoot the free throw, which he made. ... Dorian Finney-Smith scored 15 points and was the only Dallas player consistently hitting 3s, going 4 of 9."}
{"game_id": "0022100363", "chunk_id": "0022100363_020", "order": 20, "role": "body", "text": "Hardaway was joined in the oh-fer category for Dallas from beyond the arc by Reggie Bullock, who was brought in as a free agent to try to help Doncic by being a threat from deep. A career 39% shooter from long range coming into this season, Bullock is at 26% after missing all six attempts against the Nets."}
{"game_id": "0022100363", "chunk_id": "0022100363_022", "order": 22, "role": "body", "text": "Nets: The second game of a four-game trip is a back-to-back in Houston on Wednesday. Harden visited his former team in March last season, less than two months after forcing the trade to the Nets. He scored 29 points in a 132-114 Brooklyn win."}
{"game_id": "0022100363", "chunk_id": "0022100363_023", "order": 23, "role": "body", "text": "Mavericks: Their second back-to-back in a span of five days is Wednesday. Memphis is the opponent, just as it was in that 97-90 loss Saturday."}
