{"game_id": "0022100775", "chunk_id": "0022100775_001", "order": 1, "role": "lead", "text": "BOSTON -- — Josh Richardson made six 3-pointers and scored 23 points, Jayson Tatum hit two key free throws and finished with 19 points and the Boston Celtics held off the Charlotte Hornets 113-107 on Wednesday night, overcoming a career-best 38 points by LaMelo Ball."}
{"game_id": "0022100775", "chunk_id": "0022100775_002", "order": 2, "role": "body", "text": "Marcus Smart scored 22 points and Jaylen Brown 15 as Boston won its third straight."}
{"game_id": "0022100775", "chunk_id": "0022100775_003", "order": 3, "role": "body", "text": "“We’ve dealt with adversity and not always ended up the best,” Celtics coach Ime Udoka said. “Tonight we handled it well. We were able to make big plays down the stretch.”"}
{"game_id": "0022100775", "chunk_id": "0022100775_004", "order": 4, "role": "body", "text": "Terry Rozier scored 23 points, P.J. Washington 16, Kelly Oubre Jr. 15, and Mason Plumlee had 17 rebounds for the Hornets, who have lost four of six."}
{"game_id": "0022100775", "chunk_id": "0022100775_005", "order": 5, "role": "body", "text": "“We know these Eastern Conference teams are fighting for (playoff) spots, just like we are,” Rozier said. “It's going to be tough games, just like tonight.”"}
{"game_id": "0022100775", "chunk_id": "0022100775_006", "order": 6, "role": "body", "text": "The Hornets are in seventh place in the East, a half-game ahead of Boston and Toronto."}
{"game_id": "0022100775", "chunk_id": "0022100775_007", "order": 7, "role": "body", "text": "Boston shot 14 for 36 from 3-point range and Charlotte made 12 of 40 from long distance."}
{"game_id": "0022100775", "chunk_id": "0022100775_008", "order": 8, "role": "body", "text": "Rozier’s 3-pointer from the top of the key tied it at 107 with 62 seconds left."}
{"game_id": "0022100775", "chunk_id": "0022100775_009", "order": 9, "role": "body", "text": "Tatum then hit two free throws and, after Robert Williams III blocked Washington’s 3-point attempt, Smart hit two free throws with 15.6 seconds to play."}
{"game_id": "0022100775", "chunk_id": "0022100775_010", "order": 10, "role": "body", "text": "“It's just believing in everyone and trusting in the system that we have on both ends of the floor,” Smart said of Boston's composure at the end. “It's trusting the game plan, the scheme ... and trusting our instincts.”"}
{"game_id": "0022100775", "chunk_id": "0022100775_011", "order": 11, "role": "body", "text": "Boston had opened a 93-83 lead on Richardson’s sixth 3-pointer of the game with just over 10 minutes left in the fourth."}
{"game_id": "0022100775", "chunk_id": "0022100775_012", "order": 12, "role": "body", "text": "But the Hornets made a late charge. Rozier’s left-wing 3 sliced it to 103-98 with 2:56 to play. Ball was then fouled by Tatum, who was also whistled for a technical on the play."}
{"game_id": "0022100775", "chunk_id": "0022100775_013", "order": 13, "role": "body", "text": "Ball hit all three from the line, giving him a career high, and cutting it to 103-101 with just over two minutes left."}
{"game_id": "0022100775", "chunk_id": "0022100775_014", "order": 14, "role": "body", "text": "“We did come back a lot, just couldn't finish it,” said Ball, who was unaware he scored a career best. “It's kind of tight right now. If we want to make the playoffs, its going to be tight down the stretch.”"}
{"game_id": "0022100775", "chunk_id": "0022100775_015", "order": 15, "role": "body", "text": "The Celtics had scored 18 of the final 26 points of the third quarter, with Brown hitting a jumper from the foul line just before the buzzer to give Boston an 88-78 edge entering the fourth."}
{"game_id": "0022100775", "chunk_id": "0022100775_016", "order": 16, "role": "body", "text": "“Guys coming out of their comfort zone and playing on a string if we want to compete,” Richardson said of his team's thoughts during the current winning streak."}
{"game_id": "0022100775", "chunk_id": "0022100775_018", "order": 18, "role": "body", "text": "Hornets: F Gordon Hayward cleared the NBA’s health and safety protocols but didn’t travel with the team. … In their last trip to Boston, Ball had a triple-double, grabbing a rebound to complete it with 0.2 left in a game during a 111-102 victory."}
{"game_id": "0022100775", "chunk_id": "0022100775_019", "order": 19, "role": "body", "text": "Celtics: Shot 53.7% in the first half (22 of 41) with Tatum, Smart and Richardson all shooting 50% or better. … Al Horford briefly went to the locker room midway into the second quarter."}
{"game_id": "0022100775", "chunk_id": "0022100775_021", "order": 21, "role": "body", "text": "Boston opened a 12-point lead early in the second quarter, but the Hornets wiped it out quickly with a 14-1 spurt in just 2½ minutes."}
{"game_id": "0022100775", "chunk_id": "0022100775_023", "order": 23, "role": "body", "text": "Hornets: Host the Cavaliers on Friday."}
{"game_id": "0022100775", "chunk_id": "0022100775_024", "order": 24, "role": "body", "text": "Celtics: At the Pistons on Friday."}
