{"game_id": "0022100119", "chunk_id": "0022100119_001", "order": 1, "role": "lead", "text": "DETROIT -- — Seth Curry scored 23 points, Tyrese Maxey added 20 and the short-handed Philadelphia 76ers beat the Detroit Pistons 109-98 on Thursday night for their fifth straight win."}
{"game_id": "0022100119", "chunk_id": "0022100119_002", "order": 2, "role": "body", "text": "Joel Embiid had 19 points and nine rebounds for Philadelphia. Shake Milton scored 16 points and Georges Niang added 14 off the bench."}
{"game_id": "0022100119", "chunk_id": "0022100119_003", "order": 3, "role": "body", "text": "“This group is really close, they don’t have any distractions, and they play hard,” Sixers coach Doc Rivers said."}
{"game_id": "0022100119", "chunk_id": "0022100119_004", "order": 4, "role": "body", "text": "The Sixers, playing for the second straight night, only used eight players. Furkan Korkmaz (wrist) sat out, while former Pistons forward Tobias Harris remained sidelined due to COVID-19 protocols."}
{"game_id": "0022100119", "chunk_id": "0022100119_005", "order": 5, "role": "body", "text": "They weren't able to have a walkthrough on Thursday morning after Isaiah Joe's entry into the COVID-19 protocols required the entire team to be tested."}
{"game_id": "0022100119", "chunk_id": "0022100119_006", "order": 6, "role": "body", "text": "“We have gritty guys who are just here to win basketball games,” Niang said. “We came in here on the second half of a back-to-back after a tough win against Chicago plus everything this morning and got a win. This is a big team effort.”"}
{"game_id": "0022100119", "chunk_id": "0022100119_007", "order": 7, "role": "body", "text": "Jeremi Grant scored 27 for the Pistons, but only five in the second half."}
{"game_id": "0022100119", "chunk_id": "0022100119_008", "order": 8, "role": "body", "text": "“In the first half, we ran our offense and the ball got to Jeremi for some good shots,” Pistons coach Dwane Casey said. “In the second half, everyone came out and waited for Jeremi to do his thing. We can't play like that and expect to win.”"}
{"game_id": "0022100119", "chunk_id": "0022100119_009", "order": 9, "role": "body", "text": "Cade Cunningham had 18 points and 11 rebounds but missed 13 of his 17 field-goal attempts. Cunningham, the No. 1 overall pick this summer, is shooting 17.9% (7 for 39) in his first three games, including 1 for 21 on 3-pointers."}
{"game_id": "0022100119", "chunk_id": "0022100119_010", "order": 10, "role": "body", "text": "“I feel a lot more comfortable with the ball, but I obviously haven't been efficient shooting in my first three games,” said Cunningham, who missed the preseason and the start of the regular season with a sprained ankle. “I didn't have a training camp, but the guys are supporting me and they keep getting me the ball.”"}
{"game_id": "0022100119", "chunk_id": "0022100119_011", "order": 11, "role": "body", "text": "Detroit got 22 points from Grant on its way to a 66-63 halftime lead. Curry had 18."}
{"game_id": "0022100119", "chunk_id": "0022100119_012", "order": 12, "role": "body", "text": "Cunningham beat the shot clock from the center-court logo with 7:20 left in the third, his first make after missing his first 18 career 3-point attempts."}
{"game_id": "0022100119", "chunk_id": "0022100119_013", "order": 13, "role": "body", "text": "“We’re telling him to just keep shooting the ball,” Pistons center Isaiah Stewart said. “The shots he’s missing right now are shots we’ve seen him make a lot. Those are going to turn into points pretty soon.”"}
{"game_id": "0022100119", "chunk_id": "0022100119_014", "order": 14, "role": "body", "text": "Maxey, playing on his 21st birthday, had nine points in the third quarter as the 76ers took a 86-82 lead."}
{"game_id": "0022100119", "chunk_id": "0022100119_015", "order": 15, "role": "body", "text": "“I wasn't ready to be doing that when I was 21, that's for sure,” Curry said. “But once you get out there, everyone is the same age.”"}
{"game_id": "0022100119", "chunk_id": "0022100119_016", "order": 16, "role": "body", "text": "The Pistons shot 27.3% (6 for 22) from the floor in the period."}
{"game_id": "0022100119", "chunk_id": "0022100119_017", "order": 17, "role": "body", "text": "“The Sixers are a playoff team and we knew they were going to turn up the heat in the second half,” Casey said. “We didn't match them. That's what hurt us.”"}
{"game_id": "0022100119", "chunk_id": "0022100119_018", "order": 18, "role": "body", "text": "Philadelphia led 97-82 with 8:13 to play, but Cunningham hit four free throws as the Pistons cut the deficit to 97-89."}
{"game_id": "0022100119", "chunk_id": "0022100119_019", "order": 19, "role": "body", "text": "Embiid ended the run with a short jumper, and the Sixers turned two turnovers into easy baskets to make it 103-89 with 5:46 left."}
{"game_id": "0022100119", "chunk_id": "0022100119_021", "order": 21, "role": "body", "text": "Sixers: C Andre Drummond, who played his first 591 NBA games with the Pistons, was booed every time he touched the ball. ... Embiid's three first-half rebounds gave him 3,000 in his NBA career."}
{"game_id": "0022100119", "chunk_id": "0022100119_022", "order": 22, "role": "body", "text": "Pistons: Olynyk stole the ball from Drummond and hit a 27-footer at the buzzer to give Detroit a 32-31 lead at the end of the first quarter. ... PG Killian Hayes left the game with a left thumb injury, but returned for the last 6:29."}
{"game_id": "0022100119", "chunk_id": "0022100119_024", "order": 24, "role": "body", "text": "Sixers: Visit the Chicago Bulls on Saturday."}
{"game_id": "0022100119", "chunk_id": "0022100119_025", "order": 25, "role": "closing", "text": "Pistons: Host the Brooklyn Nets on Friday."}
