{"game_id": "0022100501", "chunk_id": "0022100501_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — Terry Rozier scored 27 points and made seven 3-pointers, and the Charlotte Hornets routed the Houston Rockets 123-99 on Monday night for their second straight win."}
{"game_id": "0022100501", "chunk_id": "0022100501_002", "order": 2, "role": "body", "text": "Kelly Oubre chipped in with 18 points, while LaMelo Ball and Jalen McDaniels had 16. Mason Plumlee finished with a season-high 15 points and nine rebounds for the Hornets, who pulled back above .500 on the season."}
{"game_id": "0022100501", "chunk_id": "0022100501_003", "order": 3, "role": "body", "text": "Eric Gordon and Christian Wood each had 16 points for the Rockets, who’ve lost six of their last seven games."}
{"game_id": "0022100501", "chunk_id": "0022100501_004", "order": 4, "role": "body", "text": "Rozier has made 15 3-pointers in the last three games while shooting 46.8% (15 of 32) from behind the arc."}
{"game_id": "0022100501", "chunk_id": "0022100501_005", "order": 5, "role": "body", "text": "“I feel like 80 percent of shooting is confidence,” Rozier said. “The mechanics, everyone has their own way of shooting, but you have to have confidence. I feel like I'm a hell of a shooter. But if my confidence is not there I may as well not shoot it. ... I have to know that I'm one of the best shooters in this league and just let it go.”"}
{"game_id": "0022100501", "chunk_id": "0022100501_006", "order": 6, "role": "body", "text": "Hornets coach James Borrego said he's pleased that Rozier is starting to find a rhythm, because the team needs his scoring."}
{"game_id": "0022100501", "chunk_id": "0022100501_007", "order": 7, "role": "body", "text": "“It’s great to see him put a few games now back-to-back,\" Borrego said."}
{"game_id": "0022100501", "chunk_id": "0022100501_008", "order": 8, "role": "body", "text": "Houston played without starters Jae’Sean Tate and Garrison Matthews, and key backups K.J. Martin and D.J. Augustin because of the NBA’s health and safety protocols. Also, Jalen Green and Kevin Porter JR. did not play because of injuries."}
{"game_id": "0022100501", "chunk_id": "0022100501_009", "order": 9, "role": "body", "text": "But coach Stephen Silas refused to blame the loss on playing short-handed."}
{"game_id": "0022100501", "chunk_id": "0022100501_010", "order": 10, "role": "body", "text": "“We’ve got our guys out there and if they play hard then we feel like we have a chance,” Silas said. “Not to say they didn’t play hard tonight because I thought we played pretty hard, but it was just a team that played well against us and we’re going to have to play a little bit better. It’s hard when you’ve got guys who haven’t played in the league before. We’ve been there, we were there last year. But they’re learning, they’re growing.”"}
{"game_id": "0022100501", "chunk_id": "0022100501_011", "order": 11, "role": "body", "text": "This contest wasn't nearly as close as the high-scoring affair in Houston one month ago, when the Rockets held on to edge the Hornets 146-143 in overtime behind 33 points from Wood."}
{"game_id": "0022100501", "chunk_id": "0022100501_012", "order": 12, "role": "body", "text": "The Hornets came in with a goal of holding the Rockets to fewer than 100 points, Borrego said."}
{"game_id": "0022100501", "chunk_id": "0022100501_013", "order": 13, "role": "body", "text": "“I thought we were much more focused this game defensively,” Borrego said. \"It was the No. 1 priority — and it needs to continue to be our No. 1 priority when we go on the road.”"}
{"game_id": "0022100501", "chunk_id": "0022100501_014", "order": 14, "role": "body", "text": "Plumlee, who came in averaging 6.4 points, gave the Hornets a huge boost on the offensive end with 13 points in the first half. He had two two-handed reverse dunks, helping Charlotte build a 64-50 lead at the break. The 7-foot center finished 7 of 7 from the field and added three blocks, three assists and two steals."}
{"game_id": "0022100501", "chunk_id": "0022100501_015", "order": 15, "role": "body", "text": "Charlotte later extended its lead to 26 after Rozier got hot in the third quarter, racking up 14 points with four 3s. Rozier didn't play in the fourth quarter with the victory well in hand."}
{"game_id": "0022100501", "chunk_id": "0022100501_016", "order": 16, "role": "body", "text": "“Mason played with a purpose,” Borrego said."}
{"game_id": "0022100501", "chunk_id": "0022100501_018", "order": 18, "role": "body", "text": "Rozier said Borrego challenged him recently to step up his defense."}
{"game_id": "0022100501", "chunk_id": "0022100501_019", "order": 19, "role": "body", "text": "“My defense all year hasn’t been there as far as the effort,” Rozier said. \"You have to look yourself in the mirror. Coach challenged me to pick it up.”"}
{"game_id": "0022100501", "chunk_id": "0022100501_020", "order": 20, "role": "body", "text": "Said Borrego: \"He set the tone for us with his defense.”"}
{"game_id": "0022100501", "chunk_id": "0022100501_022", "order": 22, "role": "body", "text": "Rockets: Rookie Daishen Nix scored his first NBA points on a fast-break dunk near the end of the first quarter. He finished with 11 points in 25 minutes, making 5 of 8 shots from the field."}
{"game_id": "0022100501", "chunk_id": "0022100501_023", "order": 23, "role": "body", "text": "Hornets: Were without P.J. Washington, Miles Bridges and Scottie Lewis due to health and safety protocols. ... Charlotte made 18 3-pointers."}
{"game_id": "0022100501", "chunk_id": "0022100501_025", "order": 25, "role": "body", "text": "Rockets: Host the Lakers on Tuesday night."}
{"game_id": "0022100501", "chunk_id": "0022100501_026", "order": 26, "role": "body", "text": "Hornets: At Indiana on Wednesday night."}
