{"game_id": "0022100249", "chunk_id": "0022100249_001", "order": 1, "role": "lead", "text": "DETROIT -- — LeBron James was ejected for drawing blood from Isaiah Stewart's face, sending the superstar to the locker room early in the third quarter and leaving his teammates to pick up the slack."}
{"game_id": "0022100249", "chunk_id": "0022100249_002", "order": 2, "role": "body", "text": "Anthony Davis and Russell Westbrook did that in a big way."}
{"game_id": "0022100249", "chunk_id": "0022100249_003", "order": 3, "role": "body", "text": "Davis had 30 points, 10 rebounds and two big blocked shots late on rookie Cade Cunningham. Westbrook contributed 26 points, 10 assists and nine rebounds, leading the Los Angeles Lakers to a 121-116 comeback victory over the Detroit Pistons on Sunday night."}
{"game_id": "0022100249", "chunk_id": "0022100249_004", "order": 4, "role": "body", "text": "“Everybody’s level went up when LB came out,\" Davis said."}
{"game_id": "0022100249", "chunk_id": "0022100249_005", "order": 5, "role": "body", "text": "The 20-year-old Cunningham, the No. 1 overall pick in the draft, had 13 points, 12 rebounds and 10 assists to become the youngest player in franchise history with a triple-double."}
{"game_id": "0022100249", "chunk_id": "0022100249_006", "order": 6, "role": "body", "text": "James' Flagrant 2 foul ended his night after his left elbow and hand appeared to make contact with Stewart’s face when they were tangled up while boxing out for a rebound."}
{"game_id": "0022100249", "chunk_id": "0022100249_007", "order": 7, "role": "body", "text": "Detroit’s center, who was called for a foul before James hit him, had to be held back more than once to keep him separated from the NBA superstar and was also ejected."}
{"game_id": "0022100249", "chunk_id": "0022100249_008", "order": 8, "role": "body", "text": "“I don’t think he should be facing anything from the league,\" Pistons coach Dwane Casey said. “He didn’t get off the floor in time, and the league will have to decide about that, and I thought that was why he was ejected from the game. ”"}
{"game_id": "0022100249", "chunk_id": "0022100249_009", "order": 9, "role": "body", "text": "Westbrook was assessed a technical after the officials reviewed the play and the fallout from it, determining he was an “escalator,” while there was pushing, shoving and trash talking."}
{"game_id": "0022100249", "chunk_id": "0022100249_010", "order": 10, "role": "body", "text": "All parties were relieved that an  all-out melee wasn't witnessed as it was on Nov. 19, 2004, when the Pistons and Indiana Pacers had a brawl  that spilled into the stands."}
{"game_id": "0022100249", "chunk_id": "0022100249_011", "order": 11, "role": "body", "text": "Davis praised players, coaches and security for keeping the peace."}
{"game_id": "0022100249", "chunk_id": "0022100249_012", "order": 12, "role": "body", "text": "“Everybody did a great job trying to deescalate the situation,” he said. “You never want it to get to that point like 17 years ago.”"}
{"game_id": "0022100249", "chunk_id": "0022100249_013", "order": 13, "role": "body", "text": "After calm was restored on Sunday night, Detroit closed the third quarter strong and led 99-84 entering the fourth."}
{"game_id": "0022100249", "chunk_id": "0022100249_014", "order": 14, "role": "body", "text": "“Up and until that point, we’re still trying to figure each other out,\" Los Angeles coach Frank Vogel said."}
{"game_id": "0022100249", "chunk_id": "0022100249_015", "order": 15, "role": "body", "text": "Westbrook and Davis both scored in double figures in the final quarter, leading a rally that gave the Lakers a win to reach .500 this season."}
{"game_id": "0022100249", "chunk_id": "0022100249_016", "order": 16, "role": "body", "text": "Detroit had the ball with 5.9 seconds left with the chance to potentially tie the game, but Hamidou Diallo turned the ball over and Davis made free throws to seal the victory."}
{"game_id": "0022100249", "chunk_id": "0022100249_017", "order": 17, "role": "body", "text": "“We had 27 assists going into the fourth quarter, which put us in a position to win, but we stopped moving the ball,\" Casey said. “We didn’t have a single assist in the fourth quarter.”"}
{"game_id": "0022100249", "chunk_id": "0022100249_018", "order": 18, "role": "body", "text": "James had 10 points and five assists in his second game back in the lineup. After missing eight games with an abdominal strain, he played Friday night in a 130-108 loss at Boston."}
{"game_id": "0022100249", "chunk_id": "0022100249_019", "order": 19, "role": "body", "text": "“Everyone in the league knows LeBron isn’t a dirty guy,” Davis said. “As soon as he did it, he looked back and told him, ‘My bad.’”"}
{"game_id": "0022100249", "chunk_id": "0022100249_021", "order": 21, "role": "body", "text": "Westbrook had 15 points, six assists and five rebounds in the fourth quarter."}
{"game_id": "0022100249", "chunk_id": "0022100249_022", "order": 22, "role": "body", "text": "“His offensive determination to attack was something that was very welcome and hopefully is a momentum-builder for him as well,\" Vogel said."}
{"game_id": "0022100249", "chunk_id": "0022100249_024", "order": 24, "role": "body", "text": "Lakers: Carmelo Anthony scored 18 points. ... Dwight Howard had 13 points, making a career-high two 3-pointers. ... Los Angeles will host Detroit next Sunday night."}
{"game_id": "0022100249", "chunk_id": "0022100249_025", "order": 25, "role": "body", "text": "Pistons: Diallo had 17 points and Frank Jackson had 15 points. ... Guard Killian Hayes missed the game with a thumb injury. ... Cunningham joined Hall of Famers Grant Hill and Dave DeBusschere as Detroit rookies to have a triple-double in their first 11 games with the franchise."}
{"game_id": "0022100249", "chunk_id": "0022100249_027", "order": 27, "role": "body", "text": "Lakers: Play at New York on Tuesday night."}
{"game_id": "0022100249", "chunk_id": "0022100249_028", "order": 28, "role": "body", "text": "Pistons: Host Miami on Tuesday night."}
{"game_id": "0022100249", "chunk_id": "0022100249_030", "order": 30, "role": "body", "text": "Follow Larry Lage at https://twitter.com/larrylage"}
