{"game_id": "0022100946", "chunk_id": "0022100946_001", "order": 1, "role": "lead", "text": "DETROIT -- — Saddiq Bey scored 25 points, Cade Cunningham had 20 points and nine rebounds and the Detroit Pistons rallied to beat the Indiana Pacers 111-106 on Friday night."}
{"game_id": "0022100946", "chunk_id": "0022100946_002", "order": 2, "role": "body", "text": "Marvin Bagley III added 18 points for Detroit. The Pistons have won five of seven, winning at Toronto on Thursday night."}
{"game_id": "0022100946", "chunk_id": "0022100946_003", "order": 3, "role": "body", "text": "“We're seeing more growth from this team,” Pistons coach Dwane Casey said. “We still have a lot of places to improve -- we didn't guard anyone and we didn't rebound for the first three quarters, but we picked it up in the fourth quarter and won the game. That's what we didn't do earlier in the year.”"}
{"game_id": "0022100946", "chunk_id": "0022100946_004", "order": 4, "role": "body", "text": "Malcolm Brogdon scored 26 points for Indiana. The Pacers lost for the 10th time in 13 games."}
{"game_id": "0022100946", "chunk_id": "0022100946_005", "order": 5, "role": "body", "text": "“They got much better shots than we did down the stretch,” Pacers coach Rick Carlisle said. “We ended up in too many contested one-on-one situations.”"}
{"game_id": "0022100946", "chunk_id": "0022100946_006", "order": 6, "role": "body", "text": "Cunningham and Bey hit 3-pointers to tie it at 105 with 1:40 left."}
{"game_id": "0022100946", "chunk_id": "0022100946_007", "order": 7, "role": "body", "text": "“That's the biggest moment of the game,” Casey said. “Cade hits a 3, gets a rebound at the other end and he's driving the ball to the rim. He could have easily taken that shot, but he saw Saddiq was open and got him the ball for the tying 3-pointer. That's why he's so important to us, even on tired legs.”"}
{"game_id": "0022100946", "chunk_id": "0022100946_008", "order": 8, "role": "body", "text": "Isaiah Jackson split a pair of free throws, and Cunningham's layup put Detroit ahead 107-106 with 1:09 to go. Tyrese Haliburton missed a 3-pointer, and the Pacers fouled Jeremi Grant with 19.1 seconds left. He hit both free throws, making it 109-106, and Jalen Smith missed an open 3-pointer with 10.4 seconds left."}
{"game_id": "0022100946", "chunk_id": "0022100946_009", "order": 9, "role": "body", "text": "“That's what happens with a young team,” Casey said. “The one thing we told them in the huddle was that a 2 wouldn't hurt us, so we can't leave their 3-point shooters. Lo and behold, there was Jalen Smith wide open. Luckily, he missed it.”"}
{"game_id": "0022100946", "chunk_id": "0022100946_010", "order": 10, "role": "body", "text": "Bey wrapped it up with two free throws."}
{"game_id": "0022100946", "chunk_id": "0022100946_011", "order": 11, "role": "body", "text": "The Pistons hit nine of their first 10 3-point attempts, but missed their last five of the first half. Indiana finished the half with 34 points in the paint, cutting Detroit's lead from 15 points to 65-62."}
{"game_id": "0022100946", "chunk_id": "0022100946_012", "order": 12, "role": "body", "text": "Haliburton's 3-pointer finished a 10-0 run and put the Pacers ahead 79-78 with 4:43 left in the third quarter. Detroit struggled to hit jumpers and keep Indiana off the boards in the second half."}
{"game_id": "0022100946", "chunk_id": "0022100946_013", "order": 13, "role": "body", "text": "“When you are playing your fifth game in seven nights, you are going to be dealing with some dead legs,” Pistons center Isaiah Stewart said. “We knew we had to fight through it, but it is tough.”"}
{"game_id": "0022100946", "chunk_id": "0022100946_014", "order": 14, "role": "body", "text": "Indiana led 98-93 with 6:21 to play and had the ball, but Killian Hayes stripped Haliburton and fed Bagley for a lay-up and foul. He missed the free throw, but Bey got the rebound and hit a 3-pointer for a five-point possession."}
{"game_id": "0022100946", "chunk_id": "0022100946_015", "order": 15, "role": "body", "text": "“We got really unlucky on that sequence, because Tyrese got fouled and it wasn't called, and then they throw it down the floor to Bagley for an and-one,” Carlisle said. “He misses the free throw, but they get the rebound and hit a three. That's a seven-point turnaround midway through the third quarter.”"}
{"game_id": "0022100946", "chunk_id": "0022100946_017", "order": 17, "role": "body", "text": "Pacers: Indiana had more offensive rebounds (13) in the first half than Detroit had defensive rebounds (12)."}
{"game_id": "0022100946", "chunk_id": "0022100946_018", "order": 18, "role": "body", "text": "Pistons: Bagley returned after missing three games with an ankle injury, but Frank Jackson sat out with a back problem."}
{"game_id": "0022100946", "chunk_id": "0022100946_020", "order": 20, "role": "body", "text": "Pacers center Isaiah Jackson had 12 points and 12 rebounds in his first NBA game at Little Caesars Arena. Jackson grew up in Rochester Hills, about 25 miles north of Little Caesars Arena and a bike ride away from the Palace of Auburn Hills."}
{"game_id": "0022100946", "chunk_id": "0022100946_021", "order": 21, "role": "body", "text": "“I had a lot of people here tonight, so I really wanted to have a good game,” he said. “It was great to see everyone. I would have rather won the game, but I think a lot of my friends were cheering for the Pistons.”"}
{"game_id": "0022100946", "chunk_id": "0022100946_023", "order": 23, "role": "body", "text": "Pacers: At Washington on Sunday night."}
{"game_id": "0022100946", "chunk_id": "0022100946_024", "order": 24, "role": "closing", "text": "Pistons: Host Atlanta on Monday night."}
