{"game_id": "0022100826", "chunk_id": "0022100826_001", "order": 1, "role": "lead", "text": "CHARLOTTE, N.C. -- — DeMar DeRozan scored 36 points, Nikola Vucevic added 18 points, 15 rebounds and eight assists, and the Chicago Bulls handed the Charlotte Hornets their sixth consecutive loss, 121-109 on Wednesday night."}
{"game_id": "0022100826", "chunk_id": "0022100826_002", "order": 2, "role": "body", "text": "Zach LaVine chipped in with 27 points for the Bulls (34-21), who pulled within one game of the Eastern Conference-leading Miami Heat."}
{"game_id": "0022100826", "chunk_id": "0022100826_003", "order": 3, "role": "body", "text": "It was DeRozan's fourth straight 30-point game and he has averaged 37.5 points over that span."}
{"game_id": "0022100826", "chunk_id": "0022100826_004", "order": 4, "role": "body", "text": "DeRozan even heard “MVP! MVP!” chants in the second half from a small, but vocal contingent of Bulls fans at the Spectrum Center in Charlotte."}
{"game_id": "0022100826", "chunk_id": "0022100826_005", "order": 5, "role": "body", "text": "“I'm just trying to finish this thing off going into the (All-Star) break,” DeRozan said. “I understand how critical these games are. It's a big opportunity for us to take advantage of these last few games. That's been my mindset.”"}
{"game_id": "0022100826", "chunk_id": "0022100826_006", "order": 6, "role": "body", "text": "LaMelo Ball had 33 points and nine rebounds for Charlotte, which continued to struggle with its 3-point shooting, making just 13 of 43. During their six-game losing streak, the Hornets are shooting 27.9% (66 of 236) from beyond the arc."}
{"game_id": "0022100826", "chunk_id": "0022100826_007", "order": 7, "role": "body", "text": "Hornets coach James Borrego said there is no magic pill to fix the team's shooting."}
{"game_id": "0022100826", "chunk_id": "0022100826_008", "order": 8, "role": "body", "text": "“We have to keep their legs fresh and their minds fresh,” Borrego said. “We're not going to go out and shoot 200 more 3s tomorrow (in practice) and it will change this. We just have to believe that once this thing turns we will get back to where we need to be.”"}
{"game_id": "0022100826", "chunk_id": "0022100826_009", "order": 9, "role": "body", "text": "Charlotte (28-28) has lost its last six games by an average of 11.8 points and wrapped up a homestand with an 0-4 record to fall to ninth place in the conference. The recent struggles could prompt general manager Mitch Kupchak to make some moves before the trade deadline."}
{"game_id": "0022100826", "chunk_id": "0022100826_010", "order": 10, "role": "body", "text": "Both teams entered the game short-handed."}
{"game_id": "0022100826", "chunk_id": "0022100826_011", "order": 11, "role": "body", "text": "The Bulls played without Lonzo Ball, Alex Caruso, Patrick Williams, Ayo Dosunmu and Derrick Jones Jr., while the Hornets were missing Gordon Hayward, Cody Martin and Jalen McDaniels."}
{"game_id": "0022100826", "chunk_id": "0022100826_012", "order": 12, "role": "body", "text": "The Bulls opened a 15-point lead the final minute of the second quarter behind a contested 3-pointer by DeRozan, who 8 of 11 for 18 points from the field in the first half."}
{"game_id": "0022100826", "chunk_id": "0022100826_013", "order": 13, "role": "body", "text": "Chicago held a double-digit lead for most of the game, and LaVine hit a 3-pointer at the end of the third quarter to give the Bulls an 89-76 lead after the Hornets had made a run."}
{"game_id": "0022100826", "chunk_id": "0022100826_014", "order": 14, "role": "body", "text": "Chicago stretched its lead to 21 in the fourth quarter as DeRozan and LaVine continued to knock down jumpers. The Bulls shot 56.1% from the field for the game, including 48.5% from 3-point land."}
{"game_id": "0022100826", "chunk_id": "0022100826_015", "order": 15, "role": "body", "text": "“DeMar DeRozan made clutch shots, he made tough shots,” Borrego said. “LaVine made tough shots. We tried to trap them, zone them, bump them, but they made tough shots and we have to tip our hat to them.”"}
{"game_id": "0022100826", "chunk_id": "0022100826_016", "order": 16, "role": "body", "text": "Chicago ran its offense through Vucevic, who was masterful with the ball scoring and setting up his teammates."}
{"game_id": "0022100826", "chunk_id": "0022100826_017", "order": 17, "role": "body", "text": "“We have to play through (Vucevic) because it relieves a lot of pressure on us trying to handle the ball at the top of the key,” DeRozan said. “... When we play through him we get a lot of open shots and layups.”"}
{"game_id": "0022100826", "chunk_id": "0022100826_019", "order": 19, "role": "body", "text": "Bulls point guard Coby White has heard his name circulating before the trade deadline, but said he's not spent much time worrying about a potential departure from Chicago, the team that drafted him."}
{"game_id": "0022100826", "chunk_id": "0022100826_020", "order": 20, "role": "body", "text": "“It's not something I can control,” White said. “I obviously love this team and we have a chance to be special, so it gives me an edge at the end of the day.”"}
{"game_id": "0022100826", "chunk_id": "0022100826_022", "order": 22, "role": "body", "text": "Bulls coach Billy Donovan said he can't continue to play DeRozan, LaVine and Vucevic as many minutes as he has been in recent games, and needs more contributions from his bench. He got some of that against the Hornets, as Tony Brown Jr. and Malcolm Hill each had two 3-pointers that helped quell Hornets rallies."}
{"game_id": "0022100826", "chunk_id": "0022100826_023", "order": 23, "role": "body", "text": "The Bulls should get Ball back on the floor sometime near the end of March, so that will help down the stretch."}
{"game_id": "0022100826", "chunk_id": "0022100826_025", "order": 25, "role": "body", "text": "Bulls: Had 14 turnovers, leading to 25 Hornets points."}
{"game_id": "0022100826", "chunk_id": "0022100826_026", "order": 26, "role": "body", "text": "Hornets: The Hornets are 11-25 over the past two seasons when Hayward doesn't play. ... Made just 16 of 23 free throws."}
{"game_id": "0022100826", "chunk_id": "0022100826_028", "order": 28, "role": "body", "text": "Bulls: Host Minnesota on Friday night, the start of a six-game homestand"}
{"game_id": "0022100826", "chunk_id": "0022100826_029", "order": 29, "role": "body", "text": "Hornets: At Detroit on Friday night."}
