{"game_id": "0022100568", "chunk_id": "0022100568_001", "order": 1, "role": "lead", "text": "ORLANDO, Fla. -- — Joel Embiid scored 31 points, Tobias Harris added 22 and the Philadelphia 76ers beat the Orlando Magic 116-106 on Wednesday night."}
{"game_id": "0022100568", "chunk_id": "0022100568_002", "order": 2, "role": "body", "text": "The 76ers, who notched their NBA-best 14th road victory of the season, tied a season high with a fifth straight win overall. They also defeated Orlando for a second time this season and a 10th straight time since 2016."}
{"game_id": "0022100568", "chunk_id": "0022100568_003", "order": 3, "role": "body", "text": "“We’re rolling and this is a good feeling for our team and our group,” said Harris, who bounced back a game after angrily egging on fans that booed him in Philadelphia on Monday. “Our group is meshing together, we’re having fun out there and it’s about the team.”"}
{"game_id": "0022100568", "chunk_id": "0022100568_004", "order": 4, "role": "body", "text": "Seth Curry added 20 points, a season-high 12 assists and seven rebounds, while Furkan Korkmaz scored 15 of his 20 points in the second half. Embiid, who scored at least 30 points for a fifth straight game, cupped his hands to his ears as fans repeatedly chanted, “MVP! MVP!”"}
{"game_id": "0022100568", "chunk_id": "0022100568_005", "order": 5, "role": "body", "text": "“Since I got to the league, in Orlando, for some reason, every single time we come here it’s basically a home game for us and our fans show out,” Embiid said."}
{"game_id": "0022100568", "chunk_id": "0022100568_006", "order": 6, "role": "body", "text": "Philadelphia wasted no time grabbing control in the fourth quarter. The 76ers forced the Magic into five turnovers and used a 14-5 run to open the fourth quarter. The 76ers improved to 5-14 when trailing after three quarters."}
{"game_id": "0022100568", "chunk_id": "0022100568_007", "order": 7, "role": "body", "text": "With Philadelphia leading 109-104 with 2:09 to play, Embiid was called for a flagrant foul on a hard hit to Wendell Carter Jr. However, the Magic center missed two free throws, Embiid blocked Cole Anthony’s layup and the Sixers iced the game on two jumpers by Curry."}
{"game_id": "0022100568", "chunk_id": "0022100568_008", "order": 8, "role": "body", "text": "“I told our guys before the game, with this (Orlando) team, if you look at their record and play like that, you’re going to lose,” said coach Doc Rivers, who was back on the bench after a two-game absence while in the NBA’s health and safety protocols. “We just hung in there.”"}
{"game_id": "0022100568", "chunk_id": "0022100568_009", "order": 9, "role": "body", "text": "Orlando lost its seventh straight, its third such losing streak of the season. The Magic dropped to 2-14 at home after committing 19 turnovers, leading to 28 Philadelphia points."}
{"game_id": "0022100568", "chunk_id": "0022100568_010", "order": 10, "role": "body", "text": "Anthony, who played for the first time since Dec. 23 because of a sprained right ankle, hit a 3-pointer early in the third quarter to put Orlando up five. However, he landed on Mo Bamba’s heel and sprained his left ankle. He initially screamed out in pain and needed help getting off the floor."}
{"game_id": "0022100568", "chunk_id": "0022100568_011", "order": 11, "role": "body", "text": "Anthony scored 14 of his 26 points in the first half. Bamba finished with 19 points and eight rebounds."}
{"game_id": "0022100568", "chunk_id": "0022100568_012", "order": 12, "role": "body", "text": "“This is one of them things that’s just not easy,” Anthony said of the Magic’s losing ways. “But I love this game and I love this city. … I’m ecstatic to be here and we have an opportunity to build something here.”"}
{"game_id": "0022100568", "chunk_id": "0022100568_014", "order": 14, "role": "body", "text": "Rivers found out late Tuesday he had tested negative for the COVID-19 virus, and he flew into Orlando on Wednesday to rejoin the team. Rivers said members of the NBA’s coaching fraternity have tried to check up on one another and share tips."}
{"game_id": "0022100568", "chunk_id": "0022100568_015", "order": 15, "role": "body", "text": "“A lot of frustration (among coaches),” Rivers said. “There were a few guys who were actually feeling poorly, and then there were a lot who were like, ‘I feel great,’ and they were frustrated they couldn’t get out there.”"}
{"game_id": "0022100568", "chunk_id": "0022100568_017", "order": 17, "role": "body", "text": "76ers: Rivers said guard Tyrese Maxey and forward Matisse Thybulle remain out and in the NBA’s health and safety protocols. “I know they’re feeling great,” Rivers said. “This thing, as everybody knows, is individual. Some guys have struggled with it and some guys haven’t.”"}
{"game_id": "0022100568", "chunk_id": "0022100568_018", "order": 18, "role": "body", "text": "Magic: Thursday will be the one-year anniversary of Markelle Fultz tearing the ACL in his left knee. The No. 1 pick from the 2017 NBA draft missed the final 64 games of last season and has yet to play this season. Magic coach Jamahl Mosley said Fultz has rejoined the team in some non-contact practices, but the guard is still in the rehabilitation phase."}
{"game_id": "0022100568", "chunk_id": "0022100568_020", "order": 20, "role": "body", "text": "76ers: Host San Antonio on Friday night."}
{"game_id": "0022100568", "chunk_id": "0022100568_021", "order": 21, "role": "closing", "text": "Magic: Play at Detroit on Saturday night."}
