{"game_id": "0022101163", "chunk_id": "0022101163_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Kevin Durant earned a new scoring record, though it was Danilo Gallinari and the Atlanta Hawks who celebrated with a postgame toast."}
{"game_id": "0022101163", "chunk_id": "0022101163_002", "order": 2, "role": "body", "text": "Trae Young scored 36 points, including nine in the final minute, and the streaking Hawks overcame Durant's career-high 55 points to hold off the Brooklyn Nets 122-115 on Saturday night for their fifth consecutive win."}
{"game_id": "0022101163", "chunk_id": "0022101163_003", "order": 3, "role": "body", "text": "Atlanta (41-37) moved into eighth place in the Eastern Conference, a game ahead of Brooklyn (40-38) and Charlotte."}
{"game_id": "0022101163", "chunk_id": "0022101163_004", "order": 4, "role": "body", "text": "“We're playing some good basketball right now,” Young said."}
{"game_id": "0022101163", "chunk_id": "0022101163_005", "order": 5, "role": "body", "text": "Gallinari's 15 points led Atlanta's bench, which outscored Brooklyn's backups 46-12. That deserved a reward, and Gallinari said Hawks coach Nate McMillan delivered."}
{"game_id": "0022101163", "chunk_id": "0022101163_006", "order": 6, "role": "body", "text": "“Coach gave the glass of wine to the ‘Bench Mob,’” Gallinari said, adding the backups have used that nickname since last season."}
{"game_id": "0022101163", "chunk_id": "0022101163_007", "order": 7, "role": "body", "text": "Added Gallinari, raising the glass he took to his postgame news conference, “Cheers!”"}
{"game_id": "0022101163", "chunk_id": "0022101163_008", "order": 8, "role": "body", "text": "The Hawks, attempting to regain the late-season momentum which pushed them to the last year's Eastern Conference finals, have won 10 of 13."}
{"game_id": "0022101163", "chunk_id": "0022101163_009", "order": 9, "role": "body", "text": "Durant set another career high by making eight 3-pointers, but his postgame focus was on his team."}
{"game_id": "0022101163", "chunk_id": "0022101163_010", "order": 10, "role": "body", "text": "“I’m not worried about that,” Durant said of the record. “I’m just mad at the loss.”"}
{"game_id": "0022101163", "chunk_id": "0022101163_011", "order": 11, "role": "body", "text": "The Nets' second consecutive loss left them locked into the play-in tournament, eliminating their slim hopes of moving up to sixth in the conference."}
{"game_id": "0022101163", "chunk_id": "0022101163_012", "order": 12, "role": "body", "text": "Kyrie Irving had 31 points to complement Durant, but the Nets had no other scorer in double figures. Brooklyn had too little scoring support for its two leaders while missing two starters and another top backup."}
{"game_id": "0022101163", "chunk_id": "0022101163_013", "order": 13, "role": "body", "text": "Backup point guard Goran Dragic did not play after he was placed in the NBA’s health and safety protocols with COVID-19 symptoms. Coach Steve Nash said Dragic “doesn’t feel well.”"}
{"game_id": "0022101163", "chunk_id": "0022101163_014", "order": 14, "role": "body", "text": "Only minutes before the game, Brooklyn’s backcourt depth took another hit when starter Seth Curry was ruled out with a sore left ankle. The Nets also were without starting forward Bruce Brown, who Nash said has the flu."}
{"game_id": "0022101163", "chunk_id": "0022101163_015", "order": 15, "role": "body", "text": "Durant's 19 third-quarter points included back-to-back 3s late in the period, giving him the Nets' last 16 points."}
{"game_id": "0022101163", "chunk_id": "0022101163_016", "order": 16, "role": "body", "text": "Thanks to Durant, the Nets were down only 94-87 entering the final period after trailing by 15 points at halftime. Brooklyn trimmed Atlanta's lead to 95-90 on a 3-pointer by Irving before Atlanta answered with a 12-3 run to push its lead to 14 points."}
{"game_id": "0022101163", "chunk_id": "0022101163_017", "order": 17, "role": "body", "text": "Durant scored 13 of Brooklyn's first 18 points while sinking each of his first three 3-pointers. Durant and Irving scored 22 of the Nets' 30 first-period points and 38 of 50 in the first half, including 25 by Durant."}
{"game_id": "0022101163", "chunk_id": "0022101163_018", "order": 18, "role": "body", "text": "Atlanta relied on more balanced scored while taking the lead with a 14-0 run in the second period. Delon Wright sank two 3-pointers in the run. The Hawks closed the half with back-to-back 3s by Young and Gallinari to lead 65-50 at the break."}
{"game_id": "0022101163", "chunk_id": "0022101163_020", "order": 20, "role": "body", "text": "Nets: Durant's previous high was 54 points for Oklahoma City on Jan. 17, 2014. His previous season high was 53 against the Knicks on March 13. ... The Hawks made 37 of 49 free throws, setting a season high for attempts by Brooklyn's opponents. The previous high was 38. ... Nash said he hopes Brown misses only one game. ... G David Duke Jr. and C Day'Ron Sharpe were recalled from G League Long Island."}
{"game_id": "0022101163", "chunk_id": "0022101163_021", "order": 21, "role": "body", "text": "Hawks: Young had 10 assists. ... De'Andre Hunter had 15 points. ... G Lou Williams appeared in his 1,000th career game off the bench, extending his NBA record. Earlier this season, Williams passed Dell Curry's mark of 984 games played as a backup."}
{"game_id": "0022101163", "chunk_id": "0022101163_023", "order": 23, "role": "body", "text": "Durant reached his career scoring high with his layup with 19 seconds remaining. He said poor defense — and too many fouls — spoiled the game for the Nets."}
{"game_id": "0022101163", "chunk_id": "0022101163_024", "order": 24, "role": "body", "text": "“It was not because of the refs, it was because of us reaching in,” Durant said."}
{"game_id": "0022101163", "chunk_id": "0022101163_025", "order": 25, "role": "body", "text": "Nash bemoaned the fouls, saying: “You can't give them 49 free throws. ... Tonight was a poor performance. Clear our minds, recover and get back at it.”"}
{"game_id": "0022101163", "chunk_id": "0022101163_027", "order": 27, "role": "body", "text": "Durant and Irving combined for 81 points — and some NBA history."}
{"game_id": "0022101163", "chunk_id": "0022101163_028", "order": 28, "role": "body", "text": "According to Stats by STATS, the Nets became the first team in NBA history to lose a game while having a player score at least 55 points and another add at least 30."}
{"game_id": "0022101163", "chunk_id": "0022101163_030", "order": 30, "role": "body", "text": "Nets: Return home to play Houston on Tuesday."}
{"game_id": "0022101163", "chunk_id": "0022101163_031", "order": 31, "role": "body", "text": "Hawks: Visit Toronto on Tuesday."}
