{"game_id": "0022101133", "chunk_id": "0022101133_001", "order": 1, "role": "lead", "text": "NEW YORK -- — Kevin Durant scored 41 points and the Brooklyn Nets rallied past the Detroit Pistons 130-123 on Tuesday night."}
{"game_id": "0022101133", "chunk_id": "0022101133_002", "order": 2, "role": "body", "text": "Durant connected on 14 of 23 shots, 4 of 6 from 3-point range and all nine of his foul shots while adding 11 rebounds, five assists and three blocks to help the Nets overcome a double-digit deficit in the second quarter."}
{"game_id": "0022101133", "chunk_id": "0022101133_003", "order": 3, "role": "body", "text": "“I want to get better shots sometimes, but like a couple of them are like, ‘I’m hot, let me risk it,’” Durant said. “I was just trying to get the best shots that I can. Sometimes it might be over a guy in the lane, but I feel like that’s open and I have to keep knocking them down.”"}
{"game_id": "0022101133", "chunk_id": "0022101133_004", "order": 4, "role": "body", "text": "Kyrie Irving added 24 points in his second home appearance since New York exempted athletes from a private employer mandate for COVID-19 vaccinations last week. Andre Drummond added 14 points and 13 rebounds."}
{"game_id": "0022101133", "chunk_id": "0022101133_005", "order": 5, "role": "body", "text": "Cade Cunningham led the Pistons with 34 points. Isaiah Stewart and Saddiq Bey each had 15."}
{"game_id": "0022101133", "chunk_id": "0022101133_006", "order": 6, "role": "body", "text": "The Pistons went ahead 55-43 following Frank Johnson’s short jumper with 5:54 left in the second quarter. Durant followed with a four-point play and the Nets pulled within 64-58 at halftime."}
{"game_id": "0022101133", "chunk_id": "0022101133_007", "order": 7, "role": "body", "text": "Brooklyn opened the second half on a 22-8 run and took an 80-72 lead on Drummond’s put-back with 5:54 remaining in the third quarter."}
{"game_id": "0022101133", "chunk_id": "0022101133_008", "order": 8, "role": "body", "text": "“We can’t hang our hat on the second half, we have to play a complete game,” Drummond said. “It’s never going to be easy to make that turn against great teams. Not that the Pistons aren’t a great team. They played a great game, but we just turned it up in the second half.”"}
{"game_id": "0022101133", "chunk_id": "0022101133_009", "order": 9, "role": "body", "text": "Cunningham’s 3-pointer with 38 seconds left in the quarter brought the Pistons within 96-94, and Jackson’s floater put Detroit ahead 101-99 early in the fourth."}
{"game_id": "0022101133", "chunk_id": "0022101133_010", "order": 10, "role": "body", "text": "The game was tied at 108 when Durant’s pull-up jumper followed by two free throws and Seth Curry’s 3-pointer gave Brooklyn the lead for good."}
{"game_id": "0022101133", "chunk_id": "0022101133_011", "order": 11, "role": "body", "text": "Durant’s final two points, on free throws, gave the Nets their biggest lead of the game, 128-118, with 1:18 remaining. Detroit got no closer than seven the rest of the way."}
{"game_id": "0022101133", "chunk_id": "0022101133_012", "order": 12, "role": "body", "text": "“We’re going to have to make our staple as a team on the defensive end, because if we’re going back and forth in a shooting contest, obviously we’ll still be in the game but can lead to mistakes on our end,” Irving said."}
{"game_id": "0022101133", "chunk_id": "0022101133_013", "order": 13, "role": "body", "text": "Curry finished with 11 points, while Bruce Brown added 15 and Nic Claxton also had 11 for the Nets."}
{"game_id": "0022101133", "chunk_id": "0022101133_014", "order": 14, "role": "body", "text": "Killian Hayes scored 13 points, while Johnson and Marvin Bagley III added 11 for the Pistons."}
{"game_id": "0022101133", "chunk_id": "0022101133_015", "order": 15, "role": "body", "text": "“I know their record isn’t good, but they still have pros over there,” Durant added. “They still made shots early and gained confidence as a team. This was a good test for us.”"}
{"game_id": "0022101133", "chunk_id": "0022101133_017", "order": 17, "role": "body", "text": "Pistons: Bey is the only Piston to have played in all 76 games this season. Stewart is next with 65 games played. They have both started in every game they have appeared. ... Detroit has lost three straight and nine of their last 11."}
{"game_id": "0022101133", "chunk_id": "0022101133_018", "order": 18, "role": "body", "text": "Nets: The Nets have won six straight games against the Pistons, tied for their longest winning streak against Detroit in franchise history. They have also beaten them six straight at the Barclays Center and haven’t lost to them at home since April 1, 2018."}
{"game_id": "0022101133", "chunk_id": "0022101133_020", "order": 20, "role": "body", "text": "Bey has made at least one 3-pointer in 40 straight games, the third-longest current streak in the NBA. The last game in which he did not connect from downtown came against the Nets on Dec. 12. Bey’s 197 treys this season are a franchise record, surpassing Alan Houston’s 191 during the 1995-96 season."}
{"game_id": "0022101133", "chunk_id": "0022101133_022", "order": 22, "role": "body", "text": "Pistons: Detroit hosts Philadelphia on Thursday."}
{"game_id": "0022101133", "chunk_id": "0022101133_023", "order": 23, "role": "body", "text": "Nets: Brooklyn hosts Milwaukee on Thursday."}
