{"game_id": "0022101060", "chunk_id": "0022101060_001", "order": 1, "role": "lead", "text": "CLEVELAND -- — All-Star point guard Darius Garland had 24 points and 12 assists, Evan Mobley had his NBA rookie-high 20th double-double and the Cleveland Cavaliers beat the Detroit Pistons 113-109 on Saturday night."}
{"game_id": "0022101060", "chunk_id": "0022101060_002", "order": 2, "role": "body", "text": "Mobley finished with 12 points, 11 rebounds and six assists. Cedi Osman scored 16 points and Kevin Love had 14 points and 10 rebounds for the Cavaliers, who earned their 41st win to clinch their first non-losing season in four years."}
{"game_id": "0022101060", "chunk_id": "0022101060_003", "order": 3, "role": "body", "text": "“And we’ve got a lot of games left and a lot more opportunities ahead of us,” Cleveland coach J.B. Bickerstaff said. “The fans are always engaged here and you can feel the wave that comes over the building, which is why I think it’s one of the best arenas in the league.”"}
{"game_id": "0022101060", "chunk_id": "0022101060_004", "order": 4, "role": "body", "text": "The Cavaliers extended their lead to 1 1/2 games over Toronto for sixth place in the Eastern Conference. They trailed 80-68 in the third quarter, but outscored Detroit 31-9 over the next 9:18 to take command and win for the 18th time in the last 23 home games."}
{"game_id": "0022101060", "chunk_id": "0022101060_005", "order": 5, "role": "body", "text": "Cleveland completed a back-to-back set after rallying from a 14-point deficit in the fourth quarter and beating Denver 119-116 in overtime Friday."}
{"game_id": "0022101060", "chunk_id": "0022101060_006", "order": 6, "role": "body", "text": "“We’re pretty tired from last night, but we had to do what we could to get the win,” Mobley said. “We really dug deep, and Kevin Love and Cedi rallied us back.”"}
{"game_id": "0022101060", "chunk_id": "0022101060_007", "order": 7, "role": "body", "text": "Jerami Grant scored 27 of his season-high 40 points in the first half and No. 1 overall draft pick Cade Cunningham added 15 points and 10 assists for Detroit. Saddiq Bey had 20 points, following up his career-best 51 at Orlando two days earlier."}
{"game_id": "0022101060", "chunk_id": "0022101060_008", "order": 8, "role": "body", "text": "The Pistons have lost five of six and have the second-worst record in the East at 19-52."}
{"game_id": "0022101060", "chunk_id": "0022101060_009", "order": 9, "role": "body", "text": "“I was feeling it, but it really didn’t mean nothing because we didn’t get the win,” Grant said. “Once Kevin Love got hot, they got a lot of confidence and you could feel it. Honestly, I live for games like this because it reminds me of the playoff environment.”"}
{"game_id": "0022101060", "chunk_id": "0022101060_010", "order": 10, "role": "body", "text": "The Cavaliers are 3-1 on their longest homestand of the season, a five-gamer that concludes Monday against LeBron James and the Lakers. All-Star center Jarrett Allen missed his seventh straight game with a broken finger on his left hand."}
{"game_id": "0022101060", "chunk_id": "0022101060_011", "order": 11, "role": "body", "text": "A dunk by Marvin Bagley III gave the Pistons the largest lead of the game at 80-68, but Love drained three 3-pointers in a 14-1 surge to end the quarter and put Cleveland up one."}
{"game_id": "0022101060", "chunk_id": "0022101060_012", "order": 12, "role": "body", "text": "Grant was 6 of 7 on 3-pointers as Detroit built a 60-55 advantage in the first half. The Pistons used a 14-0 run, with six players scoring, midway through the second quarter to erase Cleveland’s 36-27 lead."}
{"game_id": "0022101060", "chunk_id": "0022101060_013", "order": 13, "role": "body", "text": "“It had a playoff feel, a playoff atmosphere and that was good for evaluating our young guys,” Detroit coach Dwane Casey said. “That team was playing desperate and we weren’t, but there were a lot of positives to take out of this game.”"}
{"game_id": "0022101060", "chunk_id": "0022101060_015", "order": 15, "role": "body", "text": "Cunningham, Mobley and Raptors F Scottie Barnes are the top candidates for the Rookie of the Year award. Thunder G Josh Giddey, Rockets G Jalen Green and Magic F Franz Wagner also are in the upper tier of a very deep group."}
{"game_id": "0022101060", "chunk_id": "0022101060_016", "order": 16, "role": "body", "text": "“This is going to go down as a top-three or four draft class of all-time,” Bickerstaff said. “There are so many guys who can play at a high level and play the game more maturely than their age.”"}
{"game_id": "0022101060", "chunk_id": "0022101060_017", "order": 17, "role": "body", "text": "Casey views the class similarly, saying, “It’s been a while since we’ve seen a group like this. You could make a case for each player, but I’m very biased for Cade.”"}
{"game_id": "0022101060", "chunk_id": "0022101060_019", "order": 19, "role": "body", "text": "Pistons: G Killian Hayes (head contusion) was not in uniform after being hurt Thursday at Orlando. … G Frank Jackson (lumbar spine spasm), G Hamidou Diallo (left finger sprain) and two-way G Chris Smith (left knee sprain) were unavailable. … C Luka Garza is on a G League assignment with the Motor City Cruise. … Detroit has a three-game home winning streak against Cleveland."}
{"game_id": "0022101060", "chunk_id": "0022101060_020", "order": 20, "role": "body", "text": "Cavaliers: G Rajon Rondo (right ankle sprain) worked out on the court late in the afternoon, but was inactive for the fourth game in a row. … F Dean Wade (right knee soreness) has not played since March 12 at Chicago. … Cleveland went to overtime twice in a three-game span, beating the Clippers and Nuggets, after not going beyond regulation in its first 67 contests."}
{"game_id": "0022101060", "chunk_id": "0022101060_022", "order": 22, "role": "body", "text": "Pistons: Host the Portland Trail Blazers on Monday night."}
{"game_id": "0022101060", "chunk_id": "0022101060_023", "order": 23, "role": "body", "text": "Cavaliers: Host the Los Angeles Lakers on Monday night."}
