{"game_id": "0022100660", "chunk_id": "0022100660_001", "order": 1, "role": "lead", "text": "ATLANTA -- — Trae Young scored 30 points for the struggling Atlanta Hawks, who trailed for much of the game before rallying for a 121-114 victory over the Milwaukee Bucks on Monday night to snap a 10-game home losing streak."}
{"game_id": "0022100660", "chunk_id": "0022100660_002", "order": 2, "role": "body", "text": "Winning at State Farm Arena for the first time since Nov. 22, the Hawks avoided their longest stretch without a home victory since an 11-game skid near the end of the dismal 2004-05 season, when Atlanta finished 13-69."}
{"game_id": "0022100660", "chunk_id": "0022100660_003", "order": 3, "role": "body", "text": "“It first starts with believing,” coach Nate McMillan said. \"You've got to believe you can win a game. I think we've had some doubts.\""}
{"game_id": "0022100660", "chunk_id": "0022100660_004", "order": 4, "role": "body", "text": "Khris Middleton scored 34 points and Giannis Antetokounmpo had 27 for the Bucks, who lost for the fourth time in five games."}
{"game_id": "0022100660", "chunk_id": "0022100660_005", "order": 5, "role": "body", "text": "“We got to do a better job in the second half of coming out with urgency,” said the Bucks' Bobby Portis, who added 13 points and 13 rebounds. ”These are big games. We're trying to get into the hunt. I know people say it doesn't matter, but I want to win every game. I'm just disappointed right now.\""}
{"game_id": "0022100660", "chunk_id": "0022100660_006", "order": 6, "role": "body", "text": "The Hawks know that feeling. They have been one of the league's most underachieving teams after making a surprising run to the Eastern Conference final last season before losing to the eventual NBA champion Bucks."}
{"game_id": "0022100660", "chunk_id": "0022100660_007", "order": 7, "role": "body", "text": "The Hawks appeared headed for another home loss in the traditional game in Martin Luther King Jr.'s hometown on the national holiday honoring the civil rights leader, trailing by as many as 14 and finding themselves down 97-86 with about 9 minutes remaining."}
{"game_id": "0022100660", "chunk_id": "0022100660_008", "order": 8, "role": "body", "text": "But Atlanta outscored the Bucks 35-17 the rest of the way. Danilo Galinari gave the Hawks their first lead of the game, 104-103, on a 3-pointer with 4:37 to go."}
{"game_id": "0022100660", "chunk_id": "0022100660_009", "order": 9, "role": "body", "text": "Young hit a long 3 with 2 minutes left to stretch the edge to 111-105, and the Hawks held on from there."}
{"game_id": "0022100660", "chunk_id": "0022100660_010", "order": 10, "role": "body", "text": "Young scored 15 points in the fourth quarter, finishing 14 of 14 at the foul line. He also had 11 assists."}
{"game_id": "0022100660", "chunk_id": "0022100660_011", "order": 11, "role": "body", "text": "“Hopefully this is a good turning point for us to string together some wins,” Young said."}
{"game_id": "0022100660", "chunk_id": "0022100660_012", "order": 12, "role": "body", "text": "After falling behind 62-50 at halftime, the Hawks stayed in the locker room longer than usual before returning to the court. McMillan told TNT that he took some extra time getting on his team for its lack of defensive effort, especially in covering Antetokounmpo."}
{"game_id": "0022100660", "chunk_id": "0022100660_013", "order": 13, "role": "body", "text": "About 4 minutes into the second half, McMillan picked up a technical in another apparent attempt to fire up his lackluster squad. It seemed to work."}
{"game_id": "0022100660", "chunk_id": "0022100660_014", "order": 14, "role": "body", "text": "“Sometimes that can turn a game,” McMillan said. “If that helped us tonight, it's worth the fine.”"}
{"game_id": "0022100660", "chunk_id": "0022100660_015", "order": 15, "role": "body", "text": "Middleton missed his first three shots but was huge for the Bucks much of the game. It wasn't enough to prevent the Bucks from blowing another double-digit lead, just as they did in their previous game when they let a 15-point edge slip away against the Toronto Raptors."}
{"game_id": "0022100660", "chunk_id": "0022100660_016", "order": 16, "role": "body", "text": "Milwaukee had been 23-0 when leading after the third quarter. Make it 23-1."}
{"game_id": "0022100660", "chunk_id": "0022100660_018", "order": 18, "role": "body", "text": "While a bit undersized for an NBA center, Atlanta's 6-foot-9 Onyeka Okongwu manages to hold his own against bigger players."}
{"game_id": "0022100660", "chunk_id": "0022100660_019", "order": 19, "role": "body", "text": "McMillan said Okongwu's effort against the 6-11 Antetokounmpo allowed the Hawks to focus on Milwaukee's perimeter shooters in the fourth quarter."}
{"game_id": "0022100660", "chunk_id": "0022100660_020", "order": 20, "role": "body", "text": "Okongwu limited Milwaukee's star to 8 points on 2-of-6 shooting in the final period, and stuffed a shot for a jump ball that went Atlanta's way in the closing minutes."}
{"game_id": "0022100660", "chunk_id": "0022100660_021", "order": 21, "role": "body", "text": "“I've always been undersized, but I know how to play bigger guys and defend them,” Okongwu said. “Defense is all about effort and wanting to guard.”"}
{"game_id": "0022100660", "chunk_id": "0022100660_022", "order": 22, "role": "body", "text": "Okongqu also had 12 points to go along with eight rebounds and three blocks."}
{"game_id": "0022100660", "chunk_id": "0022100660_024", "order": 24, "role": "body", "text": "Bucks: G Jrue Holiday (left ankle soreness) missed his sixth straight game. His teammates can't to wait to get him back. “When things kind of get into a little bit of disarray, he comes in and calms everybody down, gets the ball in his hands and gets us a good shot,\" Donte DiVincenzo said. ... The Bucks fell to 0-2 against the Hawks this season. They lost 120-100 in Atlanta on Nov. 14. The teams meet for the final time this season in Milwaukee on March 9."}
{"game_id": "0022100660", "chunk_id": "0022100660_025", "order": 25, "role": "body", "text": "Hawks: De’Andre Hunter scored 20 points, while John Collins had 16 points and 12 rebounds. ... The Hawks were again missing two starters: G Bogdan Bogdanovic (sore right knee) and C Clint Capela (sprained left ankle). ... G Kevin Knox has yet to play in two games since being acquired in the trade for Cam Reddish."}
{"game_id": "0022100660", "chunk_id": "0022100660_027", "order": 27, "role": "body", "text": "Bucks: Return home to host the streaking Memphis Grizzlies on Wednesday."}
{"game_id": "0022100660", "chunk_id": "0022100660_028", "order": 28, "role": "body", "text": "Hawks: Continue a four-game homestand Wednesday when they face the Minnesota Timberwolves."}
