{"game_id": "0022100132", "chunk_id": "0022100132_001", "order": 1, "role": "lead", "text": "SACRAMENTO, Calif. -- — Richaun Holmes had 23 points and a career-best 20 rebounds and the Sacramento Kings made a franchise-record 22 3-pointers in a 140-110 victory over the Charlotte Hornets on Friday night."}
{"game_id": "0022100132", "chunk_id": "0022100132_002", "order": 2, "role": "body", "text": "Two nights after getting ejected early in the third quarter after picking up a foul and two technicals, Holmes shot 9 of 12 from the floor and had two assists."}
{"game_id": "0022100132", "chunk_id": "0022100132_003", "order": 3, "role": "body", "text": "It’s the first 20-20 game of Holmes’ career."}
{"game_id": "0022100132", "chunk_id": "0022100132_004", "order": 4, "role": "body", "text": "“It was a great moment to have,” Holmes said. “I had my family in the audience. It’s exciting. It’s a testament to the work I’ve put in. It was a team effort, honestly. We were able to get it done.”"}
{"game_id": "0022100132", "chunk_id": "0022100132_005", "order": 5, "role": "body", "text": "Buddy Hield made eight 3s and had 26 points, and De’Aaron Fox added 21 points and nine assists for the Kings."}
{"game_id": "0022100132", "chunk_id": "0022100132_006", "order": 6, "role": "body", "text": "Sacramento shot 50% beyond the arc while topping its previous record of 21 3-pointers."}
{"game_id": "0022100132", "chunk_id": "0022100132_007", "order": 7, "role": "body", "text": "“We shot 44 3s tonight but most of them came from us attacking and collapsing the defense,” coach Luke Walton said. “That’s what we want. We were sharing the ball, making the extra pass. It was fun.”"}
{"game_id": "0022100132", "chunk_id": "0022100132_008", "order": 8, "role": "body", "text": "Gordon Heyward scored 25 points for Charlotte. LaMelo Ball had 24 points and 13 assists."}
{"game_id": "0022100132", "chunk_id": "0022100132_009", "order": 9, "role": "body", "text": "The Kings led by double digits early in the first quarter and never let up while handing the Hornets their fourth loss in five games."}
{"game_id": "0022100132", "chunk_id": "0022100132_010", "order": 10, "role": "body", "text": "“They’re a fast ream, they put a lot of pressure on you and they were knocking down shots,” Hayward said. \"It seemed like they were getting just about anything they wanted. We have to figure it out.”"}
{"game_id": "0022100132", "chunk_id": "0022100132_011", "order": 11, "role": "body", "text": "Sacramento was up 54-27 midway through the second quarter and led by 19 early in the fourth when Charlotte made its biggest push — a 7-0 run — before Kings first-round pick Davion Mitchell and Hield made back-to-back 3-pointers."}
{"game_id": "0022100132", "chunk_id": "0022100132_012", "order": 12, "role": "body", "text": "Ball, who has been battling a hip contusion, struggled through an uneven night as did Charlotte’s entire team. The Hornets forced 18 turnovers, but scored only 18 points off them."}
{"game_id": "0022100132", "chunk_id": "0022100132_013", "order": 13, "role": "body", "text": "“We’ve got a long way to go defensively,” Charlotte coach James Borrego said. “That’s got to remain the focus. That’s how we’re going to dig out of this hole. We just have to commit to the defensive end. Building a team like this is not going to happen overnight.”"}
{"game_id": "0022100132", "chunk_id": "0022100132_015", "order": 15, "role": "body", "text": "Hornets: PJ Washington did not play and will miss at least one more game after suffering a left elbow hyperextension against the Warriors on Wednesday. Washington will be reevaluated next week."}
{"game_id": "0022100132", "chunk_id": "0022100132_016", "order": 16, "role": "body", "text": "Kings: Holmes scored 11 points in the third quarter. … Sacramento made nine 3s and scored a season-high 74 points in the first half."}
{"game_id": "0022100132", "chunk_id": "0022100132_018", "order": 18, "role": "body", "text": "Hornets: At Los Angeles Clippers on Sunday night."}
{"game_id": "0022100132", "chunk_id": "0022100132_019", "order": 19, "role": "body", "text": "Kings: Host Indiana on Sunday afternoon."}
