{"game_id": "0022100222", "chunk_id": "0022100222_001", "order": 1, "role": "lead", "text": "PHOENIX -- — It was a shooting slog for much of Wednesday night for the Phoenix Suns, who bricked short jumpers, 3-pointers and just about everything in between."}
{"game_id": "0022100222", "chunk_id": "0022100222_002", "order": 2, "role": "body", "text": "But then Cam Johnson hit a couple of 3-pointers. Chris Paul added another. Jae Crowder got in the act with another and Devin Booker hit the dagger with 50 seconds left: a long, off-balance triple that capped a 37-point team outburst in the final quarter."}
{"game_id": "0022100222", "chunk_id": "0022100222_003", "order": 3, "role": "body", "text": "It's awfully hard to hold down the Suns for 48 minutes."}
{"game_id": "0022100222", "chunk_id": "0022100222_004", "order": 4, "role": "body", "text": "That's a big reason they're riding the longest current winning streak in the NBA."}
{"game_id": "0022100222", "chunk_id": "0022100222_005", "order": 5, "role": "body", "text": "Booker scored 24 points, Deandre Ayton had 19 points and 13 rebounds and the Suns ran their winning streak to 10 games, beating the Dallas Mavericks 105-98. It's the longest winning streak for the Suns since the 2009-10 season."}
{"game_id": "0022100222", "chunk_id": "0022100222_006", "order": 6, "role": "body", "text": "“We didn't shoot a great number tonight but when we needed it, guys just stepped up,” coach Monty Williams said. “We have the mentality of, ‘Let it fly.'\""}
{"game_id": "0022100222", "chunk_id": "0022100222_007", "order": 7, "role": "body", "text": "Paul drove to the basket and was about to fall out of bounds before finding Ayton for the dunk and a 100-96 lead with 1:27 left. Paul had seven assists in the fourth quarter and finished with 14."}
{"game_id": "0022100222", "chunk_id": "0022100222_008", "order": 8, "role": "body", "text": "Booker's big 3 with less than a minute remaining closed it out."}
{"game_id": "0022100222", "chunk_id": "0022100222_009", "order": 9, "role": "body", "text": "“That wasn't the play,” Booker said with a grin. “But we made it work. That's the name of the game, figuring out a way.”"}
{"game_id": "0022100222", "chunk_id": "0022100222_010", "order": 10, "role": "body", "text": "Dallas lost for the second time in the last seven games. The Mavericks were playing their first game this season without star guard Luka Doncic, who suffered sprains to his left knee and ankle in the waning moments of a victory over Denver on Monday."}
{"game_id": "0022100222", "chunk_id": "0022100222_011", "order": 11, "role": "body", "text": "Even without their best player, the balanced Mavericks nearly won. Tim Hardaway Jr. scored 22 points, Kristaps Porzingis added 21 and Jalen Brunson had 18."}
{"game_id": "0022100222", "chunk_id": "0022100222_012", "order": 12, "role": "body", "text": "“The guys played hard, gave us a chance to win on the road against the Western Conference champs, who also have won nine in a row,” Mavericks coach Jason Kidd said. “Everyone in that locker room executed the game plan. We just missed some shots down the stretch and they didn’t.”"}
{"game_id": "0022100222", "chunk_id": "0022100222_013", "order": 13, "role": "body", "text": "Said Brunson: “We had control of it but they are a good team. They went to the Finals for a reason.”"}
{"game_id": "0022100222", "chunk_id": "0022100222_014", "order": 14, "role": "body", "text": "The game was tight throughout, though the Mavericks usually had a slight advantage. Booker gave the Suns their first lead of the fourth quarter at 87-86 when he made a driving layup with 5:32 left."}
{"game_id": "0022100222", "chunk_id": "0022100222_015", "order": 15, "role": "body", "text": "Dallas took a 73-68 lead into the fourth after Trey Burke hit a shot just before the third-quarter buzzer."}
{"game_id": "0022100222", "chunk_id": "0022100222_016", "order": 16, "role": "body", "text": "The Mavericks held a 46-45 lead at halftime. Booker had 15 points for the Suns, and Ayton added 10 points and eight rebounds. Porzingis had 14."}
{"game_id": "0022100222", "chunk_id": "0022100222_018", "order": 18, "role": "body", "text": "Ayton finished with his 100th double-double in 186 career games, which is the quickest to that mark in franchise history."}
{"game_id": "0022100222", "chunk_id": "0022100222_019", "order": 19, "role": "body", "text": "“He's just a specimen,” Crowder said. “He has a good body, he moves well for a guy his size, he just has all the tools you need to dominate the game.”"}
{"game_id": "0022100222", "chunk_id": "0022100222_021", "order": 21, "role": "body", "text": "Mavericks: Doncic and Maxi Kleber (left oblique strain) didn't play. Doncic is averaging 24.9 points, 8.3 rebounds and 7.9 assists per game. ... Frank Ntilikina scored 13 points on 5-of-8 shooting. ... The Mavericks shot 16 of 32 (50%) from 3-point range."}
{"game_id": "0022100222", "chunk_id": "0022100222_022", "order": 22, "role": "body", "text": "Suns: F/C Frank Kaminsky (knee soreness) didn't play. ... It took the Suns nearly four minutes to score their first point. Phoenix missed its first seven shots and fell into an 8-0 hole before Ayton made a fall-away jumper. ... Paul missed his first nine shots before making a 15-foot jumper early in the fourth quarter. He has seven points. ... Landry Shamet scored 11 points off the bench. JaVale McGee added 10 points and six rebounds."}
{"game_id": "0022100222", "chunk_id": "0022100222_024", "order": 24, "role": "body", "text": "The Mavericks and Suns play each other again Friday night in Phoenix."}
