{"game_id": "0022100214", "chunk_id": "0022100214_001", "order": 1, "role": "lead", "text": "DETROIT -- — Jeremi Grant scored 19 points, Cory Joseph added 18 and the Detroit Pistons rallied to beat the Indiana Pacers 97-89 on Wednesday night."}
{"game_id": "0022100214", "chunk_id": "0022100214_002", "order": 2, "role": "body", "text": "“This is the way we have to play,\" Grant said. “We have a lot of length in our lineup, and we need to be active defensively, get stops and get out to run.”"}
{"game_id": "0022100214", "chunk_id": "0022100214_003", "order": 3, "role": "body", "text": "Rookie guard Cade Cunningham added 16 points for Detroit (4-10), and Saddiq Bey scored 15."}
{"game_id": "0022100214", "chunk_id": "0022100214_004", "order": 4, "role": "body", "text": "“Cade is getting better each and every day, and he's already becoming a leader,” Joseph said. “When he's at the point, it is like we have another coach on the floor.”"}
{"game_id": "0022100214", "chunk_id": "0022100214_005", "order": 5, "role": "body", "text": "Malcolm Brogdan had 19 points for Indiana (6-10). Caris LeVert scored 18, and Domantas Sabonis finished with 15 points and 10 rebounds."}
{"game_id": "0022100214", "chunk_id": "0022100214_006", "order": 6, "role": "body", "text": "“This is a tough loss, because (the Pistons) really dominated the play,” Pacers coach Rick Carlisle said. “They were clearly the aggressors from the start, and we didn't raise our game to match it. That's a recipe for losing in the NBA.”"}
{"game_id": "0022100214", "chunk_id": "0022100214_007", "order": 7, "role": "body", "text": "Both teams shot below 43% from the floor and under 30% on 3-pointers."}
{"game_id": "0022100214", "chunk_id": "0022100214_008", "order": 8, "role": "body", "text": "“We told our guys that we have to be able to win games when we aren't making baskets,” Pistons coach Dwane Casey said. “The way we shoot, we have to be able to do other things.\""}
{"game_id": "0022100214", "chunk_id": "0022100214_009", "order": 9, "role": "body", "text": "The score was tied going into the fourth quarter, but Indiana got to the basket on its first three possessions to go ahead 79-73. The Pacers, though, couldn’t hit enough jumpers to take control of the game, and then Sabonis missed three straight free throws."}
{"game_id": "0022100214", "chunk_id": "0022100214_010", "order": 10, "role": "body", "text": "Detroit went ahead 85-82 on Joseph’s 3-pointer with 5:46 left, and Cunningham followed with a layup in traffic."}
{"game_id": "0022100214", "chunk_id": "0022100214_011", "order": 11, "role": "body", "text": "Indiana got as close as two, but Grant’s jumper made it 94-88 with 1:01 to play."}
{"game_id": "0022100214", "chunk_id": "0022100214_012", "order": 12, "role": "body", "text": "“We're such a young team that it isn't easy to play hard and play smart in the same game,” Joseph said. “We played hard all night, but there were a few times we didn't make good plays. We knew we had to stay focused in the fourth quarter — that's how we won the game.”"}
{"game_id": "0022100214", "chunk_id": "0022100214_013", "order": 13, "role": "body", "text": "The Pistons led 49-41 at halftime, aided by 17 points off 14 Pacers turnovers."}
{"game_id": "0022100214", "chunk_id": "0022100214_014", "order": 14, "role": "body", "text": "“The turnovers obviously killed us,” Brogdan said. “That's on me and it has to get better.”"}
{"game_id": "0022100214", "chunk_id": "0022100214_015", "order": 15, "role": "body", "text": "Joseph had 10 points in 13 minutes with the second unit, while Brogdan had 14 of the 27 points scored by the Indiana starters."}
{"game_id": "0022100214", "chunk_id": "0022100214_016", "order": 16, "role": "body", "text": "Detroit quickly increased the lead to 11 in the third quarter, but LeVert and Sabonis combined for 18 points in seven minutes as Indiana tied the game at 59."}
{"game_id": "0022100214", "chunk_id": "0022100214_017", "order": 17, "role": "body", "text": "“We had a very good third quarter and then we did some great things to build the six-point lead,” Carlisle said. “But then we gave up some easy dribble penetration, had some bad offensive possessions, and the game got away from us.”"}
{"game_id": "0022100214", "chunk_id": "0022100214_019", "order": 19, "role": "body", "text": "Pacers: SG Chris Duarte (shoulder soreness) missed his second straight game. The rookie started Indiana's first 14 games, averaging 14.3 points. ... The Pacers swept their three games against Detroit last year."}
{"game_id": "0022100214", "chunk_id": "0022100214_020", "order": 20, "role": "body", "text": "Pistons: Bey hit his 200th career 3-pointer in his 84th game, matching the third-fewest games for any NBA player. Duncan Robinson did it in 69 games, Anthony Edwards took 82 games and Donovan Mitchell also did it in 84."}
{"game_id": "0022100214", "chunk_id": "0022100214_022", "order": 22, "role": "body", "text": "Pacers: Visit the Charlotte Hornets on Friday."}
{"game_id": "0022100214", "chunk_id": "0022100214_023", "order": 23, "role": "body", "text": "Pistons: Host the Golden State Warriors on Friday."}
