{"game_id": "0022100357", "chunk_id": "0022100357_001", "order": 1, "role": "lead", "text": "CHICAGO -- — The Chicago Bulls found out they had to get by without DeMar DeRozan, then showed they have enough to keep winning, even when they're missing one of their best players."}
{"game_id": "0022100357", "chunk_id": "0022100357_002", "order": 2, "role": "body", "text": "It sure is a welcomed change for Zach LaVine after years of losing."}
{"game_id": "0022100357", "chunk_id": "0022100357_003", "order": 3, "role": "body", "text": "“No idea, brother,” he said, laughing."}
{"game_id": "0022100357", "chunk_id": "0022100357_004", "order": 4, "role": "body", "text": "LaVine scored 32 points and the Bulls overcame DeRozan's absence to beat the Denver Nuggets 109-97 on Monday night."}
{"game_id": "0022100357", "chunk_id": "0022100357_005", "order": 5, "role": "body", "text": "The Bulls took a big hit a few hours before tipoff when DeRozan, their leading scorer, entered the NBA’s health and safety protocols. Even without the four-time All-Star, they dominated down the stretch and tied Brooklyn for the Eastern Conference lead."}
{"game_id": "0022100357", "chunk_id": "0022100357_006", "order": 6, "role": "body", "text": "It's just another sign of how far the Bulls have come. After four straight losing seasons, they hope to make the playoffs for the first time since 2017."}
{"game_id": "0022100357", "chunk_id": "0022100357_007", "order": 7, "role": "body", "text": "LaVine had a season-high eight assists in a solid all-around game."}
{"game_id": "0022100357", "chunk_id": "0022100357_008", "order": 8, "role": "body", "text": "Lonzo Ball and Nikola Vucevic each had 20 points and 10 rebounds. Ball also blocked four shots. All five starters reached double figures in points, and Chicago outscored Denver 15-0 in transition."}
{"game_id": "0022100357", "chunk_id": "0022100357_009", "order": 9, "role": "body", "text": "\"I feel really bad for DeMar,\" coach Billy Donovan said. “He’s worked really hard. I think to the best of his ability, he’s really tried to remain very, very careful during these times of COVID. Vuc is a heck of a player, has been an All-Star. Zach last year was an All-Star. Those two guys, I think from a leadership standpoint, did a great job tonight. A lot of these guys have done a terrific job keeping themselves ready.”"}
{"game_id": "0022100357", "chunk_id": "0022100357_010", "order": 10, "role": "body", "text": "The Nuggets lost for the eighth time in 10 games despite a triple-double by Nikola Jokic. The reigning MVP finished with 17 points, 12 rebounds and a season-high 15 assists."}
{"game_id": "0022100357", "chunk_id": "0022100357_011", "order": 11, "role": "body", "text": "Will Barton and Monte Morris each scored 19. Aaron Gordon added 18 points. But the Nuggets got outscored 63-48 in the second half."}
{"game_id": "0022100357", "chunk_id": "0022100357_012", "order": 12, "role": "body", "text": "“This league is too good to come out lackadaisical,” Morris said. “It's a slap in the face to the coaching staff because we start off good and just — I don't know what's happening. They gave us a great game plan. And (when) we do that, that's not cool.”"}
{"game_id": "0022100357", "chunk_id": "0022100357_014", "order": 14, "role": "body", "text": "LaVine scored 12 in the third, including seven straight late in the quarter, to extend Chicago's lead to 74-66."}
{"game_id": "0022100357", "chunk_id": "0022100357_015", "order": 15, "role": "body", "text": "Ball made a four-point play early in the fourth when Jeff Green knocked him to floor with a flagrant foul. Tony Bradley dunked, and Chicago product Ayo Dosunmu nailed a 3 to make it 86-73 with 9:50 left in the game, delighting the crowd."}
{"game_id": "0022100357", "chunk_id": "0022100357_017", "order": 17, "role": "body", "text": "Dosunmu found out about an hour before tipoff he would make his first career start, then came through with 11 points, six rebounds and eight assists. The second-round draft pick out of Illinois also made sure he was billed as from Chicago rather than his college in the pregame introductions, just like former MVP Derrick Rose."}
{"game_id": "0022100357", "chunk_id": "0022100357_018", "order": 18, "role": "body", "text": "“I like to be proud, to say I'm from Chicago because I know the ups and downs of the city,” Dosunmu said. “I've seen so many things, so many tragedies. For me to be in this position -- and I’m doing what I love at the highest level -- any time I get an opportunity to show love to where I came from, I always love to do that.\""}
{"game_id": "0022100357", "chunk_id": "0022100357_020", "order": 20, "role": "body", "text": "Nuggets: Coach Michael Malone didn't let a reporter finish the question when asked about DeRozan's absence. “Doesn't change,” he said, referring to Denver's approach."}
{"game_id": "0022100357", "chunk_id": "0022100357_021", "order": 21, "role": "body", "text": "Bulls: DeRozan participated in the morning shootaround prior to the game against the Denver Nuggets. Coach Billy Donovan said he wasn’t sure if the four-time All-Star tested positive. “I cannot really confirm and deny if it’s a false positive or is positive,” Donovan said. “I don’t know right now. Obviously, the medical staff works through the league on that and they come up with the guidelines to which he’s got to follow. And I hope we’ll be able to have more news one way or another in the next day or so.” ... Backup G Alex Caruso will also miss at least the next week because of a strained right hamstring, Donovan said. He left Saturday’s win at Brooklyn."}
{"game_id": "0022100357", "chunk_id": "0022100357_023", "order": 23, "role": "body", "text": "Nuggets: Visit New Orleans on Wednesday."}
{"game_id": "0022100357", "chunk_id": "0022100357_024", "order": 24, "role": "body", "text": "Bulls: Visit Cleveland on Wednesday."}
