{"game_id": "0022100956", "chunk_id": "0022100956_001", "order": 1, "role": "lead", "text": "MIAMI -- — Everything is to Miami's liking right now. The Heat are at home for most of the month, they're enjoying their largest cushion of the season atop the Eastern Conference, and they added distance between themselves and Philadelphia."}
{"game_id": "0022100956", "chunk_id": "0022100956_002", "order": 2, "role": "body", "text": "They're about to get deeper, too."}
{"game_id": "0022100956", "chunk_id": "0022100956_003", "order": 3, "role": "body", "text": "Tyler Herro and Jimmy Butler each scored 21 points, and the Heat pulled away in the fourth quarter to beat the 76ers 99-82 on Saturday night. It was Miami's 11th win in its last 13 games, moving the Heat three games clear of the second-place 76ers in the East."}
{"game_id": "0022100956", "chunk_id": "0022100956_004", "order": 4, "role": "body", "text": "“Satisfied where we are now,\" Herro said. “Got to continue to get better.\""}
{"game_id": "0022100956", "chunk_id": "0022100956_005", "order": 5, "role": "body", "text": "Help is on the way. Victor Oladipo — who has been recovering from leg surgery for the better part of the year — watched from the Heat bench on Saturday night, in street clothes for perhaps the final time this season. He'd like to make his season debut on Monday against Houston."}
{"game_id": "0022100956", "chunk_id": "0022100956_006", "order": 6, "role": "body", "text": "“Can't do anything but make us a lot better,\" Heat forward Caleb Martin said. “That's the scary thing about it.\""}
{"game_id": "0022100956", "chunk_id": "0022100956_007", "order": 7, "role": "body", "text": "Gabe Vincent scored 16 points and Martin added 14 for the Heat, who are 11-2 in their last 13 games. Miami was again without Kyle Lowry, who missed his fourth consecutive game because of personal reasons."}
{"game_id": "0022100956", "chunk_id": "0022100956_008", "order": 8, "role": "body", "text": "“These have been good steps for our team,\" Heat coach Erik Spoelstra said. “We'll just have to try to continue to improve and take steps forward as we get guys fully healthy and get Kyle back into the mix.\""}
{"game_id": "0022100956", "chunk_id": "0022100956_009", "order": 9, "role": "body", "text": "Joel Embiid finished with 22 points and 15 rebounds for Philadelphia, which held out James Harden on the second night of a back-to-back as he recovers from a left hamstring injury. The 76ers had a season-low in points and fell to 1-14 when scoring less than 100 points."}
{"game_id": "0022100956", "chunk_id": "0022100956_010", "order": 10, "role": "body", "text": "Tyrese Maxey added 17 points for the 76ers, who ended a five-game winning streak. Tobias Harris added 16 for Philadelphia."}
{"game_id": "0022100956", "chunk_id": "0022100956_011", "order": 11, "role": "body", "text": "It was the first time since a three-game stretch in mid-December where Philadelphia trailed by 20 in consecutive outings. The 76ers trailed by 21 against Cleveland on Friday night before rallying to win 125-119."}
{"game_id": "0022100956", "chunk_id": "0022100956_012", "order": 12, "role": "body", "text": "The biggest deficit Saturday was 20, with Miami taking a 40-20 edge on a 3-pointer by Martin with 8:03 left in the half. Philadelphia went on a 12-2 run to cut the margin in half over the next 3 minutes, but Miami wound up taking a 54-40 edge into the break."}
{"game_id": "0022100956", "chunk_id": "0022100956_013", "order": 13, "role": "body", "text": "“We've got to get back to starting off fast and get the ball rolling quickly,\" Maxey said."}
{"game_id": "0022100956", "chunk_id": "0022100956_014", "order": 14, "role": "body", "text": "The win gave Miami (43-22) a season-high lead in the Eastern Conference over the second-place 76ers (39-24), with Milwaukee and Chicago (both 39-25) 3 1/2 games back."}
{"game_id": "0022100956", "chunk_id": "0022100956_015", "order": 15, "role": "body", "text": "“I really don’t look at the standings,” 76ers coach Doc Rivers said. “What do they matter? You have to win. And I swear to God, after 82, someone’s going to tap me and say ‘This is who you’re playing.’ ... You can only control what you can control. The other stuff is for everyone else to talk about.”"}
{"game_id": "0022100956", "chunk_id": "0022100956_016", "order": 16, "role": "body", "text": "An 11-2 run in the third got Philadelphia within two, before Vincent made a 3-pointer to end the quarter and send Miami into the final 12 minutes with a 73-68 lead."}
{"game_id": "0022100956", "chunk_id": "0022100956_017", "order": 17, "role": "body", "text": "Miami then outscored Philadelphia 26-14 in the fourth."}
{"game_id": "0022100956", "chunk_id": "0022100956_018", "order": 18, "role": "body", "text": "Miami went 3-1 on the week against four East contenders, beating Chicago, Brooklyn and now Philadelphia. The only loss was at Milwaukee, a game where the Heat led by 14 midway through the fourth quarter before collapsing."}
{"game_id": "0022100956", "chunk_id": "0022100956_019", "order": 19, "role": "body", "text": "“These last four have been good for us,\" Herro said."}
{"game_id": "0022100956", "chunk_id": "0022100956_021", "order": 21, "role": "body", "text": "76ers: Philadelphia remained 12 wins shy of 3,000 all-time, a milestone only the Boston Celtics and Los Angeles Lakers have reached. ... Embiid got his ninth rebound with 3 seconds left in the first quarter. He didn’t get his 10th until 9:05 remained in the third quarter."}
{"game_id": "0022100956", "chunk_id": "0022100956_022", "order": 22, "role": "body", "text": "Heat: Duncan Robinson’s first 3-pointer of the night was the 713th of his career, breaking a tie with Eddie Jones and moving him into No. 2 on Miami’s all-time list. Tim Hardaway has the club record with 806, something Robinson has a shot of reaching before the season ends. ... Heat managing general partner Micky Arison was among those at Cameron Indoor Stadium on Saturday for Mike Krzyzewski’s final home game at Duke. Heat CEO Nick Arison was Duke’s manager during his college days there."}
{"game_id": "0022100956", "chunk_id": "0022100956_024", "order": 24, "role": "body", "text": "Embiid flailed at a loose ball in the third quarter and wound up slapping Butler — his former Philadelphia teammate — in the side of the head, a play that did not appear to be intentional. Embiid went over to Butler and apologized but was given a technical anyway."}
{"game_id": "0022100956", "chunk_id": "0022100956_026", "order": 26, "role": "body", "text": "This was the opener of a stretch where Miami plays 11 out of 12 games at home. The Heat play one road game between now and March 30 — that being at Philadelphia on March 21. Miami has now played 29 home games so far this season, tied for the fewest in the league with Orlando, Houston and Denver. The Heat also have only five road games left, also tied for the fewest in the league with Orlando."}
{"game_id": "0022100956", "chunk_id": "0022100956_028", "order": 28, "role": "body", "text": "76ers: Host Chicago on Monday."}
