{"game_id": "0022100040", "chunk_id": "0022100040_001", "order": 1, "role": "lead", "text": "LOS ANGELES -- — Carmelo Anthony got the game ball after the Los Angeles Lakers’ first victory of the season."}
{"game_id": "0022100040", "chunk_id": "0022100040_002", "order": 2, "role": "body", "text": "Anthony had just scored a team-high 28 points, moving into ninth place on the NBA’s career scoring list, and was asked to make a speech. The 37-year-old Anthony said he was too tired."}
{"game_id": "0022100040", "chunk_id": "0022100040_003", "order": 3, "role": "body", "text": "Anthony Davis added 22 points and four blocks, and LeBron James scored 19 points as the Lakers overcame Ja Morant’s 40-point game and beat the Memphis Grizzlies 121-118 Sunday night."}
{"game_id": "0022100040", "chunk_id": "0022100040_004", "order": 4, "role": "body", "text": "There was plenty of drama in the final minute as Morant was fouled on a 3-point attempt by Kent Bazemore with 2.5 seconds left and Memphis trailing by three. Morant had a chance to tie the game, but missed the third and final free throw and the Lakers escaped with the win."}
{"game_id": "0022100040", "chunk_id": "0022100040_005", "order": 5, "role": "body", "text": "Anthony now has 27,423 career points, moving past Moses Malone (27,409). Shaquille O’Neal ranks eighth in scoring with 28,596 points."}
{"game_id": "0022100040", "chunk_id": "0022100040_006", "order": 6, "role": "body", "text": "“I keep saying it’s an honor and blessing to be on that list and pass Moses (Malone) for what he did for the game of basketball,” said Anthony, the third overall pick of the 2003 draft. “It’s hard to put it into words. That I’m still here and doing it, that’s what I’m excited about, that’ I’m here in year 19 and doing what I’m able to do. I’m still passionate about the game, and I’m still passionate about coming to work and getting better.”"}
{"game_id": "0022100040", "chunk_id": "0022100040_007", "order": 7, "role": "body", "text": "The Lakers snapped a season-opening two-game losing streak. The Grizzlies lost for the first time after consecutive wins to open the season."}
{"game_id": "0022100040", "chunk_id": "0022100040_008", "order": 8, "role": "body", "text": "Morant shot 13 of 21 from the field and made a career-best five 3-pointers. He added 10 assists. By halftime, Morant had 17 points, including four 3-pointers."}
{"game_id": "0022100040", "chunk_id": "0022100040_009", "order": 9, "role": "body", "text": "“I really don’t care about what I’ve done tonight,” Morant said. “I missed a free throw to tie it. That’s pretty much the only thing on my mind.”"}
{"game_id": "0022100040", "chunk_id": "0022100040_010", "order": 10, "role": "body", "text": "Davis blocked a Morant layup attempt with 50 seconds left and that appeared to seal it for the Lakers. The teams exchanged free three throws, then Bazemore fouled Morant. But the Grizzlies failed to complete the comeback."}
{"game_id": "0022100040", "chunk_id": "0022100040_011", "order": 11, "role": "body", "text": "The Lakers played for the first time since Davis and Dwight Howard had a physical confrontation on the bench during the game against Phoenix. The pair proclaimed that disagreement was over by halftime."}
{"game_id": "0022100040", "chunk_id": "0022100040_012", "order": 12, "role": "body", "text": "In a scary moment for the Lakers, James fell to the court and held his right leg in some pain in the third quarter after Desmond Bane fell into his leg. James was looked at by trainers and was down for a brief time. He re-tied his shoes, popped back up, jumped up and down a few times and stayed in the game. About a minute later, he had a big block."}
{"game_id": "0022100040", "chunk_id": "0022100040_013", "order": 13, "role": "body", "text": "James was sitting on the bench next to thre 37-year-old Anthony, his teammate and longtime friend, when a video tribute was played to honor his latest milestone and fans chanted “Melo!”"}
{"game_id": "0022100040", "chunk_id": "0022100040_014", "order": 14, "role": "body", "text": "“I think it’s always sweeter when you win and even more sweeter when it just happens organically,” James said of Anthony’s milestone. “He was playing straight up flow and rhythm basketball. To move into ninth all-time on the scoring leaderboard is special. Usually, when some of my friends have these kind of achievements, I text them or call them or Facetime them and put something on social media. In this case, I got to do it in person because he’s my teammate now. I got to do it in person. That made it special for me.”"}
{"game_id": "0022100040", "chunk_id": "0022100040_015", "order": 15, "role": "body", "text": "The Grizzlies led by as many as 10 points in the first quarter. The Lakers were dominating inside and used their height advantage to take a 62-56 halftime lead."}
{"game_id": "0022100040", "chunk_id": "0022100040_017", "order": 17, "role": "body", "text": "The Lakers had a lengthy film session on Saturday to work out defensive problems, among other things. A lot of good came from it, according to Frank Vogel."}
{"game_id": "0022100040", "chunk_id": "0022100040_018", "order": 18, "role": "body", "text": "“I just think there’s a feeling about our group that we’re OK,” Vogel said. “We have a lot of work to do, and we’re willing to put in the work. We feel good about our group. We want to start 2-0. We didn’t. But the mindset is to get the next game and still understand there will be some patience required, but we feel really good about our group.”"}
{"game_id": "0022100040", "chunk_id": "0022100040_020", "order": 20, "role": "body", "text": "Grizzlies: Guard De’Anthony Milton scored 10 points in 5:10 in the first quarter. … The Grizzlies played back-to-back nights and won at Staples Center a day earlier, beating the Clippers 120-114. They showed little signs of fatigue in the fourth quarter."}
{"game_id": "0022100040", "chunk_id": "0022100040_021", "order": 21, "role": "body", "text": "Lakers: Los Angeles played a tribute video of Anthony on the JumboTron in the fourth quarter to honor his move up the NBA’s scoring list. Fans broke out in a chant of “Melo!”"}
{"game_id": "0022100040", "chunk_id": "0022100040_023", "order": 23, "role": "body", "text": "Memphis: At Portland on Wednesday for the third game of a four-game trip."}
{"game_id": "0022100040", "chunk_id": "0022100040_024", "order": 24, "role": "body", "text": "Los Angeles: At San Antonio on Tuesday."}
