{"game_id": "0022100441", "chunk_id": "0022100441_001", "order": 1, "role": "lead", "text": "DETROIT -- — Christian Wood led a balanced attack with 21 points and eight rebounds as the Houston Rockets defeated the Detroit Pistons 116-107, handing the Pistons their 14th straight loss."}
{"game_id": "0022100441", "chunk_id": "0022100441_002", "order": 2, "role": "body", "text": "“I was concerned, because this was our sixth game in nine days and we were starting at noon,” Rockets coach Stephen Silas said. “Our first unit really got us off to a good start. Josh (Gordon) set the tone and then Christian worked himself into the game.”"}
{"game_id": "0022100441", "chunk_id": "0022100441_003", "order": 3, "role": "body", "text": "It matches the longest single-season skid in Pistons history, including 14-game streaks in 1979-80 and 1993-94. They had a 21-game streak spread between the 1979-80 and 1980-81 seasons."}
{"game_id": "0022100441", "chunk_id": "0022100441_004", "order": 4, "role": "body", "text": "“I firmly believe we're going to break out of this losing streak,” said Pistons center Isaiah Stewart. “We just have to keep our spirits up and keep playing hard, and it is going to turn around. It is.”"}
{"game_id": "0022100441", "chunk_id": "0022100441_005", "order": 5, "role": "body", "text": "Gordon added 18 points for Houston, which had lost four of five. The Rockets had seven players in double figures."}
{"game_id": "0022100441", "chunk_id": "0022100441_006", "order": 6, "role": "body", "text": "“I think with a noon game, whoever comes out with the most energy is going to win most of the time,” K.J. Martin said. “We were getting to the paint, making extra passes and getting touches for everyone.”"}
{"game_id": "0022100441", "chunk_id": "0022100441_007", "order": 7, "role": "body", "text": "Saddiq Bey had 23 points and Cade Cunningham added 21 for Detroit, which hasn't won since a 97-89 victory over the Indiana Pacers on Nov. 17."}
{"game_id": "0022100441", "chunk_id": "0022100441_008", "order": 8, "role": "body", "text": "Wood had 11 points and six rebounds in the first half, helping the Rockets take a 62-49 lead."}
{"game_id": "0022100441", "chunk_id": "0022100441_009", "order": 9, "role": "body", "text": "“I think we set the tone defensively by giving up 38 points in the first quarter,” Pistons coach Dwane Casey said. “They were driving to the basket, and we weren't doing anything to stop them. We competed hard after that, but we didn't give ourselves a chance.”"}
{"game_id": "0022100441", "chunk_id": "0022100441_010", "order": 10, "role": "body", "text": "Houston led 77-62 midway through the third quarter, but Detroit answered with an 8-0 run. However, the Rockets turned three offensive rebounds into a pair of scoring possessions and restore a double-digit lead."}
{"game_id": "0022100441", "chunk_id": "0022100441_011", "order": 11, "role": "body", "text": "The Rockets finished the quarter with six offensive rebounds and took a 88-75 lead into the fourth."}
{"game_id": "0022100441", "chunk_id": "0022100441_012", "order": 12, "role": "body", "text": "Detroit couldn't put together a significant run in the final 12 minutes."}
{"game_id": "0022100441", "chunk_id": "0022100441_013", "order": 13, "role": "body", "text": "“We can't win an NBA basketball game with 21 turnovers,” Casey said. “We have to find a way to get that down to 10 or 12 if we want to have a consistent chance to win.”"}
{"game_id": "0022100441", "chunk_id": "0022100441_015", "order": 15, "role": "body", "text": "Rockets: Josh Christopher, the 24th pick in this summer's draft, made his first NBA start. He finished with 10 points and seven assists in 28 minutes."}
{"game_id": "0022100441", "chunk_id": "0022100441_016", "order": 16, "role": "body", "text": "“I didn't have my contacts in when I got here, so I was squinting at the board to see if my name was really up there,” he said. “I knew I was probably going to start, but it was exciting to see it for sure.”"}
{"game_id": "0022100441", "chunk_id": "0022100441_017", "order": 17, "role": "body", "text": "Pistons: Casey returned to the bench after missing Detroit's previous game for a personal issue."}
{"game_id": "0022100441", "chunk_id": "0022100441_019", "order": 19, "role": "body", "text": "The game was part of the first Pistons-Red Wings doubleheader at Little Caesars Arena, resulting in the rare noon start."}
{"game_id": "0022100441", "chunk_id": "0022100441_020", "order": 20, "role": "body", "text": "“I got up, had breakfast and came to the arena, which was really weird,” Martin said. “I was awake, but my body didn't really wake up until I got going in pregame warmups.”"}
{"game_id": "0022100441", "chunk_id": "0022100441_022", "order": 22, "role": "body", "text": "Rockets: Visit the Chicago Bulls on Monday."}
{"game_id": "0022100441", "chunk_id": "0022100441_023", "order": 23, "role": "body", "text": "Pistons: Host the Miami Heat on Sunday."}
